
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки
		СтруктураОбязательныхПолей.Вставить("Проект");
		СтруктураОбязательныхПолей.Вставить("РуководительПроекта");
		СтруктураОбязательныхПолей.Вставить("КалендарьПроекта");
		Если упоИнтеграцияКлиентСервер.ИспользоватьМетодОперативногоПланированияРесурсовНаПроект() Тогда
			СтруктураОбязательныхПолей.Вставить("МетодОперативногоПланирования");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
//
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	
	// Правила для регистра "СтатусыПроектов"
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСтатусыПроектов.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ФиксацияСтатуса", ПравилаДвижения);
	
	ПравилаДвижения.Вставить("Проект", "Проект");
	
	// Правила для регистра "РуководителиПроектов"
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоРуководителиПроектов.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("НазначениеРуководителя", ПравилаДвижения);
	
	ПравилаДвижения.Вставить("Проект"             , "Проект");
	ПравилаДвижения.Вставить("РуководительПроекта", "РуководительПроекта");
	ПравилаДвижения.Вставить("КураторПроекта", "КураторПроекта");
	
	// Правила для регистра "КалендариПроектов"
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоКалендариПроектов.Метаданные().Имя, Правила);
	
	// Правила для шапки документа
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	// Делаем одно движение по шапке
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеПараметровПроекта", ПравилаДвижения);
	
	// Правила связи
	ПравилаДвижения.Вставить("Проект" , "Проект");
	ПравилаДвижения.Вставить("КалендарьПроекта" , "КалендарьПроекта");
	ПравилаДвижения.Вставить("КалендарьБанковскихДней" , "КалендарьБанковскихДней");
	ПравилаДвижения.Вставить("МетодОперативногоПланирования", "МетодОперативногоПланирования");
	ПравилаДвижения.Вставить("ПолучатьТрудозатратыПоОтчетамИсполнителей", "ПолучатьТрудозатратыПоОтчетамИсполнителей");
	
	Возврат ПравилаНаложения; 

КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	// Бизнес-логика дополнительной обработки данных движений по регистрам
	ТаблицаДвижений = ДанныеДвижений.упоСтатусыПроектов;
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.упоСостояниеСтатусаПроекта.Запланирован, "СтатусПроекта");
	
КонецПроцедуры // ПодготовитьДанныеДвижений()
 
// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда 
		Проект = ПараметрыСеанса.упоТекущийПроект;
		Возврат;
	ИначеЕсли ТипЗнч(Основание) = Тип("Структура") Тогда
		Основание.Свойство("Проект", Проект);
	Иначе
		Проект = Основание;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	упоПроектыИЗадачиСервер.ПроверитьТипПроекта(Проект);
	
	КалендарьПроекта = Константы.упоРабочийКалендарьПоУмолчанию.Получить();
	КалендарьБанковскихДней = КалендарьПроекта;
	МетодОперативногоПланирования = Константы.упоМетодОперативногоПланированияПоУмолчанию.Получить();
	ПолучатьТрудозатратыПоОтчетамИсполнителей = Истина;
	РуководительПроекта = ПараметрыСеанса.упоТекущийСотрудник;
	КураторПроекта = РуководительПроекта;

КонецПроцедуры // ОбработкаЗаполнения()

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СтруктураАналога = Новый Структура("Проект", Проект);
		Отказ = упоФункцииОбщегоНазначенияСервер.ЕстьАналогичныйДокумент(Ссылка,"упоРегистрацияПроекта",СтруктураАналога);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
	упоВерсионирование.ПроверитьТекущуюВерсиюПроекта(Проект);
	
	Если Не ЗначениеЗаполнено(МетодОперативногоПланирования) Тогда
		МетодОперативногоПланирования = Перечисления.упоМетодОперативногоПланирования.ПрямоеВыделениеРесурсовНаПроект;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	упоВерсионирование.ПроверитьТекущуюВерсиюПроекта(Проект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если НЕ	(ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);	
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, РежимЗаписиДокумента.Проведение, 
			Отказ, Заголовок, Истина);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли