#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетОткрытиеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьРежимПараметрыВыбораСписка();
	
	ВсеРоли 							= Ложь;
	РолиПоПодразделениям 				= Ложь;
	РолиПоГруппам 						= Ложь;
	ОтборПоПодразделениюВСпискеРолей 	= Ложь;
	
	ПолучитьСохраненныеНастройкиПользователя(ОтборПоПодразделениюВСпискеРолей, 
		ВсеРоли, РолиПоПодразделениям, РолиПоГруппам);
		
	УстановитьВидСписка(ВсеРоли, РолиПоПодразделениям, РолиПоГруппам, Ложь);
	
	УстановитьТекущуюСтрокуОтбора(ОтборПоПодразделениюВСпискеРолей);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтотОбъект, Список, Отказ, СтандартнаяОбработка); 		
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	ИдетОткрытиеФормы = Истина;
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтотОбъект);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтотОбъект, Список, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтотОбъект, Список, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтотОбъект, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтотОбъект, Список, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтотОбъект, Список, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Список, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеРоли(Команда)
	
	УстановитьВидСписка(Истина, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПоГруппам(Команда)
	
	УстановитьВидСписка(Ложь, Ложь, Истина);

КонецПроцедуры

&НаКлиенте
Процедура РолиПоПодразделениям(Команда)
	
	УстановитьВидСписка(Ложь, Истина, Ложь);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьРолиПодчиненныхЭлементовПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСкрытыеРолиПриИзменении(Элемент)
	
	УстановитьОтборСкрытых();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппы

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиОтбораКлиент", 0.1, Истина);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодразделения

&НаКлиенте
Процедура ПодразделенияПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиОтбораКлиент", 0.1, Истина);		
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтотОбъект, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтотОбъект, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

//

&НаСервере
Процедура УстановитьРежимПараметрыВыбораСписка()
		
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.ВыборГруппИЭлементов = Параметры.ВыборГруппИЭлементов;
		Элементы.Список.МножественныйВыбор = ЗначениеЗаполнено(Параметры.МножественныйВыбор) И Параметры.МножественныйВыбор;
	КонецЕсли;	
	
	ЕстьОтборПоПодразделению = Параметры.Свойство("ПодразделениеОтбора");
	
	Если ЕстьОтборПоПодразделению Тогда		
		ДобавитьОтборПоПодразделениюВТекстЗапросаСписка(Параметры.ПодразделениеОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуОтбора(ОтборПоПодразделениюВСпискеРолей)
	
	Если ОтборПоПодразделениюВСпискеРолей Тогда 							
		ПодразделенияТекСотрудника = 		
			упоИерархияИПолномочияСервер.ПолучитьПодразделенияРуководителяБезИерархии(ПараметрыСеанса.упоТекущийСотрудник);		 	
			
		Сч = 1;
		Для Каждого ПодразделениеТекСотрудника Из ПодразделенияТекСотрудника Цикл
			Если Сч = 1 Тогда
				Элементы.Подразделения.ТекущаяСтрока = ПодразделениеТекСотрудника;
			КонецЕсли;
			Элементы.Подразделения.ВыделенныеСтроки.Добавить(ПодразделениеТекСотрудника);				
			Сч = Сч + 1;
		КонецЦикла;
		
		ОбработатьАктивизациюСтрокиОтбораСервер();		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьСохраненныеНастройкиПользователя(ОтборПоПодразделениюПриВыбореРолей, 
													ВсеРоли, 
													РолиПоПодразделениям, 
													РолиПоГруппам)
	
	Настройка_ОтборПоПодразделениюВСпискеРолей	= Ложь;	
	Настройка_ВидВсеРоли 						= Ложь;
	Настройка_ВидРолиПоПодразделениям 			= Ложь;
	Настройка_ВидРолиПоГруппам 					= Ложь;
		
	ИмяГруппыНастроек = "СписокРолей";
	
	ИмяНастройки = "УстанавливатьОтборПоПодразделениюВСпискеРолей";	
	Настройка_ОтборПоПодразделениюВСпискеРолей = ХранилищеОбщихНастроек.Загрузить(ИмяГруппыНастроек, ИмяНастройки);		
	Если Настройка_ОтборПоПодразделениюВСпискеРолей = Неопределено Тогда 
		Настройка_ОтборПоПодразделениюВСпискеРолей = Ложь;
		ХранилищеОбщихНастроек.Сохранить(ИмяГруппыНастроек, ИмяНастройки, Настройка_ОтборПоПодразделениюВСпискеРолей);
	КонецЕсли;
	ОтборПоПодразделениюПриВыбореРолей = Настройка_ОтборПоПодразделениюВСпискеРолей;	
	
	Если Не ОтборПоПодразделениюПриВыбореРолей Тогда
		
		ИмяНастройки = "ВидВсеРоли";	
		Настройка_ВидВсеРоли = ХранилищеОбщихНастроек.Загрузить(ИмяГруппыНастроек, ИмяНастройки);		
		Если Настройка_ВидВсеРоли = Неопределено Тогда 
			Настройка_ВидВсеРоли = Ложь;
			ХранилищеОбщихНастроек.Сохранить(ИмяГруппыНастроек, ИмяНастройки, Настройка_ВидВсеРоли);
		КонецЕсли;

		ИмяНастройки = "ВидРолиПоПодразделениям";	
		Настройка_ВидРолиПоПодразделениям = ХранилищеОбщихНастроек.Загрузить(ИмяГруппыНастроек, ИмяНастройки);		
		Если Настройка_ВидРолиПоПодразделениям = Неопределено Тогда 
			Настройка_ВидРолиПоПодразделениям = Ложь;
			ХранилищеОбщихНастроек.Сохранить(ИмяГруппыНастроек, ИмяНастройки, Настройка_ВидРолиПоПодразделениям);
		КонецЕсли;
		
		ИмяНастройки = "ВидРолиПоГруппам";	
		Настройка_ВидРолиПоГруппам = ХранилищеОбщихНастроек.Загрузить(ИмяГруппыНастроек, ИмяНастройки);		
		Если Настройка_ВидРолиПоГруппам = Неопределено Тогда 
			Настройка_ВидРолиПоГруппам = Истина;
			ХранилищеОбщихНастроек.Сохранить(ИмяГруппыНастроек, ИмяНастройки, Настройка_ВидРолиПоГруппам);
		КонецЕсли;
					
	КонецЕсли;	
		
	РолиПоПодразделениям = ОтборПоПодразделениюПриВыбореРолей Или Настройка_ВидРолиПоПодразделениям;	
	ВсеРоли = Не РолиПоПодразделениям И Настройка_ВидВсеРоли;
	РолиПоГруппам = Не РолиПоПодразделениям И Не ВсеРоли И Настройка_ВидРолиПоГруппам;
	
	Если Не(РолиПоПодразделениям Или ВсеРоли Или РолиПоГруппам) Тогда
		РолиПоГруппам = Истина;
		ХранилищеОбщихНастроек.Сохранить(ИмяГруппыНастроек, "ВидРолиПоГруппам", РолиПоГруппам);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиОтбораКлиент()
	
	Если ИдетОткрытиеФормы Тогда
		ИдетОткрытиеФормы = Ложь;
	Иначе	
		СнятьОтборыДинамическогоСписка(ЭтотОбъект);
		УстановитьОтборыДинамическогоСписка(ЭтотОбъект);			
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьАктивизациюСтрокиОтбораСервер()
	
	СнятьОтборыДинамическогоСписка(ЭтотОбъект);
	УстановитьОтборыДинамическогоСписка(ЭтотОбъект);	
	
КонецПроцедуры	


&НаКлиентеНаСервереБезКонтекста
Процедура СнятьОтборыДинамическогоСписка(Форма)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Список, , "ОтборПоПодразделениям");				
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Список, , "ОтборПоГруппам");							
	
	Если Не Форма.Элементы.ФормаРолиПоГруппам.Пометка Тогда
		Форма.Элементы.Группы.ТекущаяСтрока = Неопределено;
	КонецЕсли;	
	Если Не Форма.Элементы.ФормаРолиПоПодразделениям.Пометка Тогда
		Форма.Элементы.Подразделения.ТекущаяСтрока = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыДинамическогоСписка(Форма)
								
	Если Форма.Элементы.ФормаВсеРоли.Пометка Тогда
		Возврат;		
	КонецЕсли;	
		
	Если Форма.Элементы.ФормаРолиПоПодразделениям.Пометка Тогда
		ТаблицаОтбора = "Подразделения";
		ПустаяСсылка = ПредопределенноеЗначение("Справочник.упоПодразделения.ПустаяСсылка");
		ПредставлениеОтбора = "ОтборПоПодразделениям";
		ПолеОтбора = "Подразделение";		
	ИначеЕсли Форма.Элементы.ФормаРолиПоГруппам.Пометка Тогда
		ТаблицаОтбора = "Группы";
		ПустаяСсылка = ПредопределенноеЗначение("Справочник.упоРоли.ПустаяСсылка");
		ПредставлениеОтбора = "ОтборПоГруппам";
		ПолеОтбора = "Родитель";					
	Иначе
		Возврат;
	КонецЕсли;
	
	УстановитьОтбор = Ложь;
	ВыделенныеЭлементы = Новый Массив;
	Для каждого ВыделеннаяСтрока Из Форма.Элементы[ТаблицаОтбора].ВыделенныеСтроки Цикл		
		Если ВыделеннаяСтрока = ПустаяСсылка Тогда			
			УстановитьОтбор = Ложь;
			Прервать;
		Иначе
			ВыделенныеЭлементы.Добавить(ВыделеннаяСтрока);
			УстановитьОтбор = Истина;
		КонецЕсли;			
	КонецЦикла;	
	
	Если УстановитьОтбор Тогда									
		ВидСравненияОтбора = ВидСравненияПоСпособуВыводаИерархии(Форма.ПоказыватьРолиПодчиненныхЭлементов);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Форма.Список.КомпоновщикНастроек.Настройки.Отбор, 
			ПолеОтбора, ВыделенныеЭлементы, ВидСравненияОтбора, ПредставлениеОтбора, Истина);					
	КонецЕсли;
									
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидСравненияПоСпособуВыводаИерархии(ПоказыватьРолиПодчиненныхЭлементов)
	
	Если ПоказыватьРолиПодчиненныхЭлементов Тогда
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	Иначе
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;	
	
	Возврат ВидСравненияОтбора;
	
КонецФункции	

&НаКлиенте
Процедура УстановитьОтборСкрытых()
				
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, 
		"НеОтображать", Ложь, , "ОтборСкрытых", Не ПоказыватьСкрытыеРоли);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидСписка(ВсеРоли, 
							РолиПоПодразделениям,
							РолиПоГруппам,
							СохранитьНастройки = Истина)
	
	Элементы.ФормаВсеРоли.Пометка 				= ВсеРоли;
	Элементы.ФормаРолиПоПодразделениям.Пометка 	= РолиПоПодразделениям;
	Элементы.ФормаРолиПоГруппам.Пометка 		= РолиПоГруппам;
	
	Элементы.Группы.Видимость 			= РолиПоГруппам;
	Элементы.Подразделения.Видимость 	= РолиПоПодразделениям;
	
	Элементы.ПоказыватьРолиПодчиненныхЭлементов.Видимость = Не ВсеРоли;	
			
	Если ВсеРоли Тогда
		ОтображениеСписка = ОтображениеТаблицы.ИерархическийСписок;				
		ЭтотОбъект.ПоказыватьРолиПодчиненныхЭлементов = Ложь;
	Иначе		
		ОтображениеСписка = ОтображениеТаблицы.Список;	
	КонецЕсли;	
	
	Элементы.Список.Отображение = ОтображениеСписка;

	СнятьОтборыДинамическогоСписка(ЭтотОбъект);	
	
	Если СохранитьНастройки Тогда				
		ХранилищеОбщихНастроек.Сохранить("СписокРолей", "ВидВсеРоли", 			ВсеРоли);
		ХранилищеОбщихНастроек.Сохранить("СписокРолей", "ВидРолиПоПодразделениям", 	РолиПоПодразделениям);
		ХранилищеОбщихНастроек.Сохранить("СписокРолей", "ВидРолиПоГруппам", 		РолиПоГруппам);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборПоПодразделениюВТекстЗапросаСписка(Подразделение)
	
	Шаблон = "%1 ГДЕ %2";
	УсловиеОтбора = "упоСоставПодразделенийСрезПоследних.Подразделение = &Подразделение";
	
	ТекстЗапроса = Список.ТекстЗапроса;
	ТекстЗапроса = СтрШаблон(Шаблон, ТекстЗапроса, УсловиеОтбора);
		
	Список.ТекстЗапроса = ТекстЗапроса;	
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	
КонецПроцедуры

#КонецОбласти
