////////////////////////////////////////////////////////////////////////////////
// Сервисные процедуры и функции.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вместо представления документа, который формирует платформа, подставляем 
// реквизит содержащий название документа.
//
// Параметры:
//  ОбъектДанных - ЛюбаяСсылка - Ссылка на объект данных.
// 
// Возвращаемое значение:
//  Строка - строковое описание объекта данных.
//
Функция ПолучитьСтроковоеПредставление(ОбъектДанных) Экспорт
	
	// Изменияем представление для следующих документов.
	Если ТипЗнч(ОбъектДанных) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Возврат упоПроектыИЗадачиСервер.НазваниеПроектнойЗадачи(ОбъектДанных);
	КонецЕсли;
		
	Возврат Строка(ОбъектДанных);
	
КонецФункции

#КонецОбласти