#Область ОписаниеПеременных

&НаКлиенте
Перем КэшТиповРеквизитов;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИнициализироватьИсточникДанныхФормы(ТекущийОбъект);
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	МодифицироватьЗаблокироватьФормуПредустановленного();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИнициализацияДанныхНовогоЭлемента(Параметры);
	
	НастроитьЭлементыФормы(Истина);
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.ПроизвольныйЗапрос Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	Иначе
		ТекущийОбъект.СхемаКомпоновкиДанных = Неопределено;
	КонецЕсли;
	
	Если НЕ ТекущийОбъект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование Тогда
		ТекущийОбъект.НастройкиКомпоновкиДанных = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	КонецЕсли;
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	КэшТиповРеквизитов = ЗаполнитьКэшТиповРеквизитов();
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, Источник)
	
	Если ТипЗНЧ(Источник) = Тип("КонструкторСхемыКомпоновкиДанных") Тогда
		
		Если ЭтотОбъект.ТолькоПросмотр Тогда
			ТекстСообщения = НСтр("ru = 'Элемент находится в режиме ""Только просмотр"" и недоступен для редактирования'");
			ПоказатьПредупреждение( , ТекстСообщения);
		Иначе
		#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
			ОбработатьИзменениеСхемыКомпоновкиДанныхНаФорме(ЭтаФорма, ВыбранноеЗначение);
		#КонецЕсли
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОчиститьСообщения();
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыДокументовТипДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТипыДокументов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекДок = Элементы.ТипДокумента.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
		Если ТекДок <> Неопределено Тогда
			ТекущиеДанные.ТипДокументаСиноним = ТекДок.Представление;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделДанныхПриИзменении(Элемент)
	
	ОчиститьСообщения();
	РазделДанныхПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПравилаПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ОбработатьИзменениеНастройкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникБюджетированияПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ОбработатьИзменениеНастройкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	мТекущийЭлемент = Элемент.ТекущийЭлемент;
	
	Если мТекущийЭлемент <> Неопределено 
		И ТипЗНЧ(мТекущийЭлемент) = Тип("ПолеФормы") 
		И мТекущийЭлемент.Имя = "СопоставлениеРеквизитовЗначениеЗаполнения" Тогда
		УстановитьОграничениеТипаРеквизита(мТекущийЭлемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовСпособЗаполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СопоставлениеРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитОписаниеТипа = КэшТиповРеквизитов[Объект.Раздел][ТекущиеДанные.Реквизит];
	
	ТипЗначенияЗаполнения = ТипЗнч(ТекущиеДанные.ЗначениеЗаполнения);
	
	Если Не ТекущиеДанные.СпособЗаполнения И Не РеквизитОписаниеТипа.СодержитТип(ТипЗначенияЗаполнения)
		Или ТекущиеДанные.СпособЗаполнения И Не ТипЗначенияЗаполнения = Тип("Строка") Тогда
		ТекущиеДанные.ЗначениеЗаполнения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовЗначениеЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СопоставлениеРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.СпособЗаполнения Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВыбораРеквизитаСКД(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьНаименованиеАвтоматическиПриИзменении(Элемент)
	
	Элементы.Наименование.Доступность = Не Объект.ФормироватьНаименованиеАвтоматически;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределятьПоПлануПриИзменении(Элемент)
	
	УстановитьЗначенияЗаполненияПоУмолчанию();
	
	УстановитьВидимостьДоступностьЭлементов_РаспределятьПоПлану(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПравилоДляПредустановленногоПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаписатьПредустановленныйОбъектВФорме", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСопоставлениеРеквизитовПоИсточнику(Команда)
	
	ОчиститьСообщения();
	ЗаполнитьСопоставлениеРеквизитовПоИсточникуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокументыКОтражению(Команда)
	
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru='Для регистрации документов необходимо записать правило. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьПравилоЗавершение", ЭтаФорма);
		
	Иначе
		
		ТекстНачалоИспользования = "";	
		НачалоИспользованияКонтураЭкономики = НачалоИспользованияКонтураЭкономики();
		Если ЗначениеЗаполнено(НачалоИспользованияКонтураЭкономики) Тогда
			ТекстНачалоИспользования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru=', начиная с %1'"),
				Формат(НачалоИспользованияКонтураЭкономики, "ДФ = ""дд.ММ.гггг 'г'"""));
		КонецЕсли;
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Будут зарегистрированы документы указанных типов%1. Продолжить?'"), 
			ТекстНачалоИспользования);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗарегистрироватьДокументыКОтражениюЗавершение", ЭтаФорма);
		
	КонецЕсли;
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#Область РедактированиеСхемыКомпоновкиДанных

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанных(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда						
		// Копирование исходной схемы.
		СхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных));
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
		
		// Редактирование копии схемы.
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);		
	#Иначе		
		ТекстПредупреждения = НСтр("ru='Для редактирования схемы получения данных необходимо запустить конфигурацию в режиме толстого клиента.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);		
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуКомпоновкиДанныхИзФайла(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСхемуКомпоновкиДанныхИзXMLФайлаРасширениеПодключено", ЭтаФорма);
	
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСхемуКомпоновкиДанныхВФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьСхемуКомпоновкиДанныхВXMLФайлРасширениеПодключено", ЭтаФорма);
	
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область РедактированиеСхемыКомпоновкиДанных

&НаСервереБезКонтекста
Процедура ОграничитьИспользованиеНетипизированныхПолейСКД(СхемаКомпоновкиДанных)
	
	Если СхемаКомпоновкиДанных = Неопределено ИЛИ СхемаКомпоновкиДанных.НаборыДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Период");	
	ОбязательныеПоля.Добавить("Регистратор");
	
	ПоляНабораДанных = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	Для каждого ПолеНабора Из ПоляНабораДанных Цикл
		
		Если ТипЗнч(ПолеНабора) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда 
			
			Если ОбязательныеПоля.Найти(ПолеНабора.Поле) = Неопределено Тогда
				ОграничитьИспользование = Не ЗначениеЗаполнено(ПолеНабора.ТипЗначения);
				ПолеНабора.ОграничениеИспользования.Поле = ОграничитьИспользование;
				ПолеНабора.ОграничениеИспользованияРеквизитов.Поле = ОграничитьИспользование;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСхемуКомпоновкиДанных(Правило)
	
	МенеджерПравила = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования;
	СхемаКомпоновкиДанных = МенеджерПравила.СхемаКомпоновкиДанныхПоНастройкам(Правило);
	
	ОграничитьИспользованиеНетипизированныхПолейСКД(СхемаКомпоновкиДанных);
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	Иначе
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных = "")
			
	Попытка	
		// Инициализация через адрес для передачи настроек на клиент.
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);	
		КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	Исключение
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка инициализации компоновщика: %1'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстИсключения;	
	КонецПопытки;
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекКомпоновкиДанных) Тогда
		НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроекКомпоновкиДанных);
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	Иначе
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьИсточникДанныхФормы(Правило = Неопределено)
	
	АдресНастроекКомпоновки = Неопределено;
	
	Если Правило <> Неопределено Тогда //Первое чтение объекта.
		НастройкиКомпоновки = Правило.НастройкиКомпоновкиДанных.Получить();
	Иначе
		Правило = РеквизитФормыВЗначение("Объект");
		НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	КонецЕсли;
	
	Если НастройкиКомпоновки <> Неопределено Тогда
		АдресНастроекКомпоновки = ПоместитьВоВременноеХранилище(НастройкиКомпоновки, УникальныйИдентификатор);
	КонецЕсли;
	
	ИнициализироватьСхемуКомпоновкиДанных(Правило);
	
	ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновки);
	
	ПроверитьДоступностьСопоставленныхРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаВыгрузкаСхемыКомпоновкиДанныхВФайл

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеСхемыКомпоновкиДанныхНаФорме(Форма, СхемаКомпоновкиДанных)
	
	Форма.Модифицированность = Истина;
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Форма.АдресСхемыКомпоновкиДанных);
	// Копирование текущих настроек правила.
	АдресНастроекКомпоновки = ПоместитьВоВременноеХранилище(Форма.КомпоновщикНастроек.ПолучитьНастройки(), 
		Форма.УникальныйИдентификатор);
	// Компоновщик настроек инициализируется новой схемой
	ИнициализироватьКомпоновщикНастроек(Форма.КомпоновщикНастроек, Форма.АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновки);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхемуИзXMLФайла(АдресФайлаВоВременномХранилище)
	
	Попытка
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ОбработатьИзменениеСхемыКомпоновкиДанныхНаФорме(ЭтаФорма, СхемаКомпоновкиДанных);
		
	Исключение
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка загрузки файла схемы источника: %1'"), 
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуКомпоновкиДанныхИзXMLФайлаРасширениеПодключено(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСхемуКомпоновкиДанныхИзXMLФайлаКлиент", ЭтаФорма);
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.ПолноеИмяФайла = "";
		Диалог.Заголовок = НСтр("ru = 'Выбор схемы компоновки данных'");
		Диалог.Фильтр = НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		
		Диалог.Показать(ОписаниеОповещения);
		
	Иначе
		
		АдресФайлаВоВременномХранилище = "";
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗагрузитьСхемуКомпоновкиДанныхИзXMLФайлаСервер", ЭтаФорма,
			АдресФайлаВоВременномХранилище);
		
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
		ПараметрыДиалога.МножественныйВыбор = Ложь;
		ПараметрыДиалога.Заголовок = НСтр("ru = 'Выбор схемы компоновки данных'");
		ПараметрыДиалога.Фильтр = НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		НачатьПомещениеФайлаНаСервер(ОписаниеОповещенияОЗавершении,,, АдресФайлаВоВременномХранилище, ПараметрыДиалога, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуКомпоновкиДанныхИзXMLФайлаКлиент(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВыбранныеФайлы[0]), УникальныйИдентификатор);
	
	ЗагрузитьСхемуИзXMLФайла(АдресФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуКомпоновкиДанныхИзXMLФайлаСервер(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСхемуИзXMLФайла(Результат.Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСхемуКомпоновкиДанныхВXMLФайлРасширениеПодключено(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьСхемуКомпоновкиДанныхВXMLФайлКлиент", ЭтаФорма);
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);	
		Диалог.Фильтр = НСтр("ru = 'XML-файл (*.xml)|*.xml'");
		Диалог.МножественныйВыбор = Ложь;
		Диалог.Заголовок = НСтр("ru = 'Сохранение схемы источника данных'");
		Диалог.Показать(ОписаниеОповещения);
		
	Иначе
		
		АдресФайлаВоВременномХранилище = упоТиповыеОтчетыСервер.ВыгрузитьСхемуВФайлXML(АдресСхемыКомпоновкиДанных, 
																						УникальныйИдентификатор);
		
		ПолучитьФайл(АдресФайлаВоВременномХранилище, "", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСхемуКомпоновкиДанныхВXMLФайлКлиент(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		АдресФайлаВоВременномХранилище = упоТиповыеОтчетыСервер.ВыгрузитьСхемуВФайлXML(АдресСхемыКомпоновкиДанных, 
																						УникальныйИдентификатор);
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		ДвоичныеДанныеФайла.Записать(ВыбранныеФайлы[0]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СопоставлениеРеквизитов

&НаСервере
Процедура ОчиститьСопоставлениеРеквизитов()
	
	Для Каждого СтрокаСопоставления Из Объект.СопоставлениеРеквизитов Цикл
		СтрокаСопоставления.СпособЗаполнения = Ложь;
		СтрокаСопоставления.ЗначениеЗаполнения = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступностьСопоставленныхРеквизитов()
	
	СтатьяБюджетов = Неопределено;
	Если Объект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование 
		И ЗначениеЗаполнено(Объект.ПравилоПолученияФактаПоСтатьямБюджетов) Тогда
		СтатьяБюджетов = 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоПолученияФактаПоСтатьямБюджетов, "СтатьяБюджетов");
	КонецЕсли;
	
	Для Каждого СтрокаНастройки Из Объект.СопоставлениеРеквизитов Цикл
		ПроверитьЗаполнениеСопоставленияРеквизита(СтрокаНастройки, СтатьяБюджетов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеСопоставленияРеквизита(СтрокаНастройкиСопоставления, СтатьяБюджетов)
	
	НайденноеПоле = Неопределено;
	ТекущееЗначение = СтрокаНастройкиСопоставления.ЗначениеЗаполнения;
	
	Если СтрокаНастройкиСопоставления.СпособЗаполнения Тогда
		
		Если ЗначениеЗаполнено(СтатьяБюджетов) Тогда
			АналитикаПоСтатье = упоПроектноеБюджетированиеСервер.НомераАналитикСтатьиБюджета(СтатьяБюджетов);
			НайденноеПоле = АналитикаПоСтатье[ТекущееЗначение];
		Иначе
			ПолеТекущееЗначение = Новый ПолеКомпоновкиДанных(ТекущееЗначение);
			НайденноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеТекущееЗначение);
		КонецЕсли;
		
		Если НайденноеПоле = Неопределено Тогда		
			СтрокаНастройкиСопоставления.ЗначениеЗаполнения = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШаблонРеквизитовРазделов(Раздел)
	
	ИмяРаздела = упоПроектноеБюджетированиеСервер.ИмяПеречисленияПоЗначению(Раздел);
	
	МетаданныеДокументаОтражения = Метаданные.Документы.упоОтражениеФактаВПроектномБюджетировании;
	РеквизитыРаздела = МетаданныеДокументаОтражения.ТабличныеЧасти[ИмяРаздела].Реквизиты;
	
	ТипыРеквизитов = Новый ТаблицаЗначений;
	ТипыРеквизитов.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	ТипыРеквизитов.Колонки.Добавить("ТипРеквизита", Новый ОписаниеТипов("ОписаниеТипов"));
	
	МассивРеквизитыИсключить = Новый Массив;	
	МассивРеквизитыИсключить.Добавить("Период");
	МассивРеквизитыИсключить.Добавить("Регистратор");
	МассивРеквизитыИсключить.Добавить("ПравилоОтражения");
	МассивРеквизитыИсключить.Добавить("Сумма");
	МассивРеквизитыИсключить.Добавить("СуммаВалютная");
	Если Раздел = Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы Тогда
		МассивРеквизитыИсключить.Добавить("Количество");
	КонецЕсли;
	
	Для Каждого РеквизитРаздела Из РеквизитыРаздела Цикл
		Если МассивРеквизитыИсключить.Найти(РеквизитРаздела.Имя) = Неопределено Тогда
			НоваяСтрока = ТипыРеквизитов.Добавить();
			НоваяСтрока.ИмяРеквизита = РеквизитРаздела.Имя;
			НоваяСтрока.ТипРеквизита = РеквизитРаздела.Тип;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТипыРеквизитов;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСопоставлениеРеквизитов(Правило)
	
	СопоставлениеРеквизитов = Правило.СопоставлениеРеквизитов;
	СопоставлениеРеквизитов.Очистить();
	
	НаборыРеквизитовРазделов = ШаблонРеквизитовРазделов(Правило.Раздел);
	
	Для Каждого РеквизитРаздела Из НаборыРеквизитовРазделов Цикл
		НоваяСтрока = СопоставлениеРеквизитов.Добавить();
		НоваяСтрока.Реквизит = РеквизитРаздела.ИмяРеквизита;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСопоставлениеРеквизитовРазделаАвтоматически(Правило, АдресСхемыКомпоновкиДанных = "")
	
	ВыраженияЗаполненияРеквизитов = ПоляСоответствияРеквизитовПоИсточникуДанных(Правило, АдресСхемыКомпоновкиДанных);
	
	Если ВыраженияЗаполненияРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНастройки Из Правило.СопоставлениеРеквизитов Цикл
		
		Отбор = Новый Структура("Реквизит", СтрокаНастройки.Реквизит);
		НайденныеСтроки = ВыраженияЗаполненияРеквизитов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()  = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатПоиска = НайденныеСтроки[0];
		Если ЗначениеЗаполнено(РезультатПоиска.Выражение) Тогда
			
			Если РезультатПоиска.Неоднозначно Тогда
				СтрокаНастройки.ЗначениеЗаполнения = "";
			Иначе
				СтрокаНастройки.ЗначениеЗаполнения = РезультатПоиска.Выражение;
			КонецЕсли;
			СтрокаНастройки.СпособЗаполнения = РезультатПоиска.СпособЗаполнения;
			
		Иначе
			СтрокаНастройки.ЗначениеЗаполнения = "";
			СтрокаНастройки.СпособЗаполнения = Ложь;
		КонецЕсли;
		
		Если РезультатПоиска.Неоднозначно И ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В источнике найдено больше одного варианта заполнения реквизита ""%1"". Выберите необходимый вариант вручную.'"), 
				СтрокаНастройки.Реквизит);
			Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"СопоставлениеРеквизитов[%1].ЗначениеЗаполнения", 
				СтрокаНастройки.ПолучитьИдентификатор());
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , Поле);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШаблонТаблицыЗаполнения()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ТаблицаЗаполнения = Новый ТаблицаЗначений;
	ТаблицаЗаполнения.Колонки.Добавить("Реквизит", 		Новый ОписаниеТипов("Строка"));
	ТаблицаЗаполнения.Колонки.Добавить("ТипЗначения", 	Новый ОписаниеТипов("ОписаниеТипов"));
	
	ТипыВыражения = Новый Массив;
	ТипыВыражения.Добавить("Строка");
	ТипыВыражения.Добавить("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	ТипыВыражения.Добавить("СправочникСсылка.упоСтатьиДоходов");
	ТипыВыражения.Добавить("СправочникСсылка.упоСтатьиЗатрат");
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ТипыВыражения.Добавить("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов");
	КонецЕсли;
	ТаблицаЗаполнения.Колонки.Добавить("Выражение", Новый ОписаниеТипов(ТипыВыражения));
	
	ТаблицаЗаполнения.Колонки.Добавить("СпособЗаполнения", 	ТипБулево);
	ТаблицаЗаполнения.Колонки.Добавить("Неоднозначно", 		ТипБулево);
	
	Возврат ТаблицаЗаполнения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПоляСоответствияРеквизитовПоИсточникуДанных(Правило, АдресСхемыКомпоновкиДанных)
	
	ИсточникиЗаполненияРеквизитов = Новый Соответствие;
	ТипыИсточниковЗаполненияРеквизитов = Новый Соответствие;
	ТипыФинСтатейПоСтатьеБюджета = Новый Соответствие;
	ЗначенияЗаполненияРеквизитов = Новый Соответствие;
	
	МенеджерПравилаОтражения = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования;
	
	КэшТиповРеквизитов = упоПроектноеБюджетированиеПовтИсп.ТипыЗначенийРеквизитовРазделаПравила(Правило.Раздел);
	
	ВыраженияЗаполнения = ШаблонТаблицыЗаполнения();
	
	КонтекстФормы = ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	// Бюджетирование: реквизиты по аналитике статьи.
	Если Правило.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование Тогда
	
		СтатьяБюджетирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило.ПравилоПолученияФактаПоСтатьямБюджетов, "СтатьяБюджетов");
		
		ТипыФинСтатейПоСтатьеБюджета = ТипыФинансовыхСтатейПоСтатьеБюджета(СтатьяБюджетирования);
		
		НомераАналитик = упоПроектноеБюджетированиеСервер.НомераАналитикСтатьиБюджета(СтатьяБюджетирования);
		
		Для Каждого НомерАналитики Из НомераАналитик Цикл
			
			Аналитика = НомерАналитики.Ключ;
			
			РасширенныйТипЗначенияАналитики = МенеджерПравилаОтражения.РасширенныйТипЗначенияАналитики(Аналитика.ТипЗначения);
			
			ИсточникиЗаполненияРеквизитов.Вставить(Аналитика, РасширенныйТипЗначенияАналитики);
			ЗначениеДляСохранения = ТипыИсточниковЗаполненияРеквизитов.Получить(РасширенныйТипЗначенияАналитики);
			Если ЗначениеДляСохранения = Неопределено Тогда
				ЗначениеДляСохранения = Новый Массив;
			КонецЕсли;
			ЗначениеДляСохранения.Добавить(Аналитика);
			ТипыИсточниковЗаполненияРеквизитов.Вставить(РасширенныйТипЗначенияАналитики, ЗначениеДляСохранения);
					
		КонецЦикла;	
	// Остальные типы: реквизиты по СКД.
	Иначе
		
		Если КонтекстФормы Тогда
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		Иначе
			СхемаКомпоновкиДанных = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.СхемаКомпоновкиДанныхПоНастройкам(Правило);
		КонецЕсли;
		
		Если СхемаКомпоновкиДанных <> Неопределено 
			И СхемаКомпоновкиДанных.НаборыДанных.Количество() <> 0 Тогда
			
			ПоляНабора = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
			Для Каждого ПолеНабора Из ПоляНабора Цикл
				Если ТипЗнч(ПолеНабора) = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПолеНабора.ТипЗначения) Тогда
					ИсточникиЗаполненияРеквизитов.Вставить(ПолеНабора.ПутьКДанным, ПолеНабора.ТипЗначения);
					ЗначениеДляСохранения = ТипыИсточниковЗаполненияРеквизитов.Получить(ПолеНабора.ТипЗначения);
					Если ЗначениеДляСохранения = Неопределено Тогда
						ЗначениеДляСохранения = Новый Массив;
					КонецЕсли;
					ЗначениеДляСохранения.Добавить(ПолеНабора.ПутьКДанным);
					ТипыИсточниковЗаполненияРеквизитов.Вставить(ПолеНабора.ТипЗначения, ЗначениеДляСохранения);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИсточникиЗаполненияРеквизитов.Количество() > 0 Тогда
	
		Для Каждого СтрокаСопоставления Из Правило.СопоставлениеРеквизитов Цикл
			
			ПоляСовпадающихТипов = Новый Массив;
			ПоляСодержащихТипов = Новый Массив;
			
			НоваяСтрока = ВыраженияЗаполнения.Добавить();
			НоваяСтрока.СпособЗаполнения = Истина;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСопоставления, , "СпособЗаполнения");
			
			НоваяСтрока.ТипЗначения = КэшТиповРеквизитов[СтрокаСопоставления.Реквизит];
			ИсточникЗаполненияАналитики = ТипыИсточниковЗаполненияРеквизитов.Получить(НоваяСтрока.ТипЗначения);
			Если Не ИсточникЗаполненияАналитики = Неопределено Тогда
				ПоляСовпадающихТипов = ИсточникЗаполненияАналитики;
			Иначе
				Для каждого ИсточникЗаполненияРеквизита Из ИсточникиЗаполненияРеквизитов Цикл
					Для каждого Тип Из ИсточникЗаполненияРеквизита.Значение.Типы() Цикл
						Если КэшТиповРеквизитов[СтрокаСопоставления.Реквизит].СодержитТип(Тип) Тогда
							ПоляСодержащихТипов.Добавить(ИсточникЗаполненияРеквизита.Ключ);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			ЗначенияСтатей = Новый Массив;
			Если СтрокаСопоставления.Реквизит = "Статья" ИЛИ СтрокаСопоставления.Реквизит = "СтатьяДДС" Тогда
				Для Каждого ТипФинСтатьиПоСтатьеБюджета Из ТипыФинСтатейПоСтатьеБюджета Цикл
					Если НоваяСтрока.ТипЗначения.СодержитТип(ТипФинСтатьиПоСтатьеБюджета.Ключ) Тогда
						Для Каждого ЗначениеСтатьи Из ТипФинСтатьиПоСтатьеБюджета.Значение Цикл
							ЗначенияСтатей.Добавить(ЗначениеСтатьи);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			
			Если ПоляСовпадающихТипов.Количество() <> 0 Тогда
				Если КонтекстФормы Тогда
					НоваяСтрока.Выражение = ПоляСовпадающихТипов[0];
					НоваяСтрока.Неоднозначно = ПоляСовпадающихТипов.Количество() > 1;
				Иначе
					ПолеПоИмениРеквизита = ПоляСовпадающихТипов.Найти(СтрокаСопоставления.Реквизит);
					Если ПолеПоИмениРеквизита <> Неопределено Тогда
						НоваяСтрока.Выражение = ПоляСовпадающихТипов[ПолеПоИмениРеквизита];
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ПоляСодержащихТипов.Количество() <> 0 Тогда
				Если КонтекстФормы Тогда
					НоваяСтрока.Выражение = ПоляСодержащихТипов[0];
					НоваяСтрока.Неоднозначно = ПоляСодержащихТипов.Количество() > 1;
				Иначе
					ПолеПоИмениРеквизита = ПоляСодержащихТипов.Найти(СтрокаСопоставления.Реквизит);
					Если ПолеПоИмениРеквизита <> Неопределено Тогда
						НоваяСтрока.Выражение = ПоляСодержащихТипов[ПолеПоИмениРеквизита];
					КонецЕсли;
				КонецЕсли;
			// Заполнение статьи по статье бюджета.
			ИначеЕсли КонтекстФормы И ЗначенияСтатей.Количество() <> 0 Тогда
				НоваяСтрока.СпособЗаполнения = Ложь;
				НоваяСтрока.Выражение = ЗначенияСтатей[0];
				НоваяСтрока.Неоднозначно = ЗначенияСтатей.Количество() > 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ВыраженияЗаполнения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТипыФинансовыхСтатейПоСтатьеБюджета(СтатьяБюджетирования)
	
	ТипыФинСтатейПоСтатьеБюджета = Новый Соответствие;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	упоСопоставленныеФинансовыеСтатьи.ФинансоваяСтатья КАК Статья,
	                      |	ТИПЗНАЧЕНИЯ(упоСопоставленныеФинансовыеСтатьи.ФинансоваяСтатья) КАК ТипЗначения
	                      |ИЗ
	                      |	РегистрСведений.упоСопоставленныеФинансовыеСтатьи КАК упоСопоставленныеФинансовыеСтатьи
	                      |ГДЕ
	                      |	упоСопоставленныеФинансовыеСтатьи.СтатьяБюджетов = &СтатьяБюджетов");
	Запрос.УстановитьПараметр("СтатьяБюджетов", СтатьяБюджетирования);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗначениеДляСохранения = ТипыФинСтатейПоСтатьеБюджета.Получить(Выборка.ТипЗначения);
			Если ЗначениеДляСохранения = Неопределено Тогда
				ЗначениеДляСохранения = Новый Массив;
			КонецЕсли;
			ЗначениеДляСохранения.Добавить(Выборка.Статья);
			ТипыФинСтатейПоСтатьеБюджета.Вставить(Выборка.ТипЗначения, ЗначениеДляСохранения);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТипыФинСтатейПоСтатьеБюджета;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОграничениеТипаРеквизита(Элемент)
	
	ТекущиеДанные = Элементы.СопоставлениеРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.СпособЗаполнения = Ложь Тогда
		РеквизитОписаниеТипа = КэшТиповРеквизитов[Объект.Раздел][ТекущиеДанные.Реквизит];
		Если РеквизитОписаниеТипа <> Неопределено Тогда
			Элемент.ОграничениеТипа = РеквизитОписаниеТипа;
		КонецЕсли;
	Иначе
		СписокТипов = Новый Массив;
		СписокТипов.Добавить("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов");
		СписокТипов.Добавить("Строка");
		
		Элемент.ОграничениеТипа = Новый ОписаниеТипов(СписокТипов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИнициализацияДанныхНовогоЭлемента(Параметры)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	Если Не ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ЗначениеКопирования = Неопределено; // Смена типа значения.
		Объект.Раздел = Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы;
		Объект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.ПроизвольныйЗапрос;
		ЗаполнитьСопоставлениеРеквизитов(Объект);
	КонецЕсли;
	
	ИнициализироватьИсточникДанныхФормы(ЗначениеКопирования);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы(ОткрытиеФормы = Ложь)
	
	Если ОткрытиеФормы Тогда
		
		ЗаполнитьВсеТипыДокументов(Элементы.ТипДокумента.СписокВыбора);
		
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
			Элементы.ОжидатьОтраженияВРеглУчете.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ИсточникПроизвольныйЗапрос = Объект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.ПроизвольныйЗапрос;
	ИсточникБюджетирование = Объект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование;
	
	Элементы.ГруппаРедактированиеСхемыИсточника.Видимость = ИсточникПроизвольныйЗапрос;
	Элементы.ГруппаПараметры.Видимость = ИсточникПроизвольныйЗапрос;
	
	Элементы.ГруппаСопоставлениеРеквизитов.Видимость = ИсточникПроизвольныйЗапрос ИЛИ ИсточникБюджетирование;
	Элементы.ГруппаОтбор.Видимость = Не ИсточникБюджетирование;
	Элементы.ИсточникБюджетирования.Видимость = ИсточникБюджетирование;
	
	Элементы.Наименование.Доступность = Не Объект.ФормироватьНаименованиеАвтоматически;
	
	УстановитьВидимостьДоступностьЭлементов_РаспределятьПоПлану(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеНастройкиФормы(ОчищатьСопоставлениеРеквизитов = Истина)
	
	НастроитьЭлементыФормы();
	
	ИнициализироватьИсточникДанныхФормы();
	
	Если ОчищатьСопоставлениеРеквизитов Тогда
		ОчиститьСопоставлениеРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСопоставлениеРеквизитовПоИсточникуСервер()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСопоставлениеРеквизитовРазделаАвтоматически(Объект, АдресСхемыКомпоновкиДанных);
	
	ПроверитьДоступностьСопоставленныхРеквизитов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьВсеТипыДокументов(ВсеТипыДокументов)
	
	ТипыДокументов = упоПроектноеБюджетированиеСервер.ТипыДокументовПроектногоБюджетирования();
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		ДокументМета = Метаданные.НайтиПоТипу(ТипДокумента);
		Если ДокументМета <> Неопределено Тогда 
			ВсеТипыДокументов.Добавить(ДокументМета.Имя, ДокументМета.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	ВсеТипыДокументов.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьКэшТиповРеквизитов()
	
	Возврат упоПроектноеБюджетированиеПовтИсп.ТипыЗначенийРеквизитовРазделаПравила();
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораРеквизитаСКД(Элемент)
	
	ТекущиеДанные = Элементы.СопоставлениеРеквизитов.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("АдресСхемыКомпоновкиДанных, ТекущееВыражение, ТипЗначения", 
		АдресСхемыКомпоновкиДанных,
		ТекущиеДанные.ЗначениеЗаполнения,
		КэшТиповРеквизитов[Объект.Раздел][ТекущиеДанные.Реквизит]);

	Если Объект.ТипПравила = ПредопределенноеЗначение("Перечисление.упоТипыПравилПроектногоБюджетирования.Бюджетирование")
		И ЗначениеЗаполнено(Объект.ПравилоПолученияФактаПоСтатьямБюджетов) Тогда
		ПараметрыФормы.Вставить("ПравилоБюджетирования", Объект.ПравилоПолученияФактаПоСтатьямБюджетов);
	КонецЕсли;
		
	ОткрытьФорму("Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования.Форма.ВыборИсточникаЗаполненияРеквизита", 
		ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура РазделДанныхПриИзмененииСервер()
	
	УстановитьВидимостьДоступностьЭлементов_РаспределятьПоПлану(ЭтаФорма);
	
	ЗаполнитьСопоставлениеРеквизитов(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПравилоЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма.Записать();
		
		ЗарегистрироватьДокументыКОтражению(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокументыКОтражениюЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	ТекстСостояния = НСтр("ru = 'Регистрация документов к отражению.'");
	Состояние = ТекстСостояния;
	
	ИмяЗадания = "Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ЗарегистрироватьДокументыКОтражениюПоПравилуВФоне";
	ПараметрыВыполнения = Новый Структура("Правило", Объект.Ссылка);
	Задание = упоПроектноеБюджетированиеВызовСервера.ЗапуститьФоновуюРегистрациюДокументовКОтражениюКонтекстКлиента(
	ИмяЗадания, ПараметрыВыполнения, УникальныйИдентификатор);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	НастройкиОжидания.ВыводитьОкноОжидания = Истина;
	НастройкиОжидания.ТекстСообщения = ТекстСостояния; 
	НастройкиОжидания.ПолучатьРезультат = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ПослеЗавершенияФоновогоЗадания", ЭтотОбъект, Параметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

// Принимает результат выполнения фонового задания.
&НаКлиенте
Процедура ПослеЗавершенияФоновогоЗадания(Задание, Параметры) Экспорт
	
	Если Задание = Неопределено Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	Предупреждение = Новый Структура("Текст, Подробно");
	
	Если Задание.Статус = "Выполнено" Тогда	
		ТекстПредупреждения = НСтр("ru = 'Регистрация документов завершена.'");
	Иначе
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выполнить отражение документа: %1'"),
			Задание.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	ПоказатьПредупреждение( , ТекстПредупреждения); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачалоИспользованияКонтураЭкономики()
	
	Возврат упоПроектноеБюджетированиеПовтИсп.НачалоИспользованияКонтураЭкономики();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементов_РаспределятьПоПлану(ЭтаФорма)
	
	ЭтоПравилоДиР = ЭтаФорма.Объект.Раздел = 
		ПредопределенноеЗначение("Перечисление.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы");
	Если Не ЭтоПравилоДиР Тогда
		ЭтаФорма.Объект.РаспределятьПоПлану = Ложь;
	КонецЕсли;
	ЭтаФорма.Элементы.РаспределятьПоПлану.Видимость = ЭтоПравилоДиР;
	
	ЭтаФорма.Элементы.РаспределятьПоРасходам.Видимость = ЭтаФорма.Объект.РаспределятьПоПлану;
	ЭтаФорма.Элементы.СопоставлениеРеквизитовЗаполнятьПоРаспределению.Видимость = ЭтаФорма.Объект.РаспределятьПоПлану;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияЗаполненияПоУмолчанию()
	
	Если Не Объект.РаспределятьПоПлану Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Раздел) Тогда
		Возврат;
	КонецЕсли;
		
	НайденныеСтроки = Объект.СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("ЗаполнятьПоРаспределению", Истина));
	Если НайденныеСтроки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Раздел = 
		ПредопределенноеЗначение("Перечисление.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы") Тогда
		УстановитьЗаполнятьПоРаспределениюВСтрокеТабличнойЧасти(Объект.СопоставлениеРеквизитов, "Подразделение");
	Иначе
		УстановитьЗаполнятьПоРаспределениюВСтрокеТабличнойЧасти(Объект.СопоставлениеРеквизитов, "СтатьяДДС");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаполнятьПоРаспределениюВСтрокеТабличнойЧасти(ТабличнаяЧасть, ИмяРеквизита)
	
	НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(Новый Структура("Реквизит", ИмяРеквизита));
	Если НайденныеСтроки.Количество() Тогда
		НайденныеСтроки[0].ЗаполнятьПоРаспределению = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура МодифицироватьЗаблокироватьФормуПредустановленного()
	
	ЭтоПредустановленноеПравило = ЗначениеЗаполнено(Объект.ПредустановленныйКод);
	
	Если ЭтоПредустановленноеПравило Тогда
		
		Элементы.ГруппаПредопределенныйЭлемент.Видимость 			= Истина;
		Элементы.ОтключитьПравилоДляПредустановленного.Видимость 	= Истина;
		Элементы.ОтключитьПравило.Видимость 						= Ложь;
		ОтключитьПравилоДляПредустановленного = Объект.ОтключитьПравило;
		
		ЭтотОбъект.ТолькоПросмотр = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПредустановленныйОбъектВФорме()
	
	Объект.ОтключитьПравило = ОтключитьПравилоДляПредустановленного;
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти