
&НаСервере
Процедура ПроверитьЗамену(ДействиеЗадачиID)
	Если Не ЗначениеЗаполнено(ДействиеЗадачиID) Тогда
		ИмяПоляВвода = "ПолеИКТ_Ответственный";
		Если Не Элементы.Найти(ИмяПоляВвода) = Неопределено Тогда
			Элементы[ИмяПоляВвода].Видимость = Ложь;
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Определение = Новый WSОпределения(Константы.АдресВебСервиса1СДокументооборот.Получить() + "ws\ikt_ERP.1cws?wsdl",
	Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить(), Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить(),,120);
	
	Прокси = Новый WSПрокси(Определение, "www.IKT.ru", "ikt_ERP", "ikt_ERPSoap");
	Прокси.Пользователь	= Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить();
	Прокси.Пароль 		= Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить();
	Параметр = Новый Структура("Команда, УИД, База", "НадоЗаменитьСотрудника", ДействиеЗадачиID, "Стройка");        
	Результат = Прокси.Exec(Новый ХранилищеЗначения(Параметр, Новый СжатиеДанных(6)), 
	Истина).Получить();
	Если Результат.Свойство("Ошибка") Тогда
		Сообщить(Результат.Ошибка);
		ИмяПоляВвода = "ПолеИКТ_Ответственный";
		Если Не Элементы.Найти(ИмяПоляВвода) = Неопределено Тогда
			Элементы[ИмяПоляВвода].Видимость = Ложь;
			
			Возврат;
		КонецЕсли;
	ИначеЕсли Результат.Надо Тогда
		
		МассивСотрудников = Новый Массив();
		Для Каждого Сотр Из Результат.Сотрудники Цикл
			СотрСпр = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Сотр));
			Если ЗначениеЗаполнено(СотрСпр.ВерсияДанных) Тогда
				МассивСотрудников.Добавить(СотрСпр);
			КонецЕсли;
		КонецЦикла;
		
		
		
		ЭтаФорма.ИКТ_РольОтветственного = Результат.ИКТ_РольОтветственного;
		ИмяПоляВвода = "ПолеИКТ_Ответственный";
		Если Элементы.Найти(ИмяПоляВвода) = Неопределено Тогда
			Элементы.ГруппаРезультатДействияТекстомГраницаЦентр.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НовоеПоле = Элементы.Добавить(ИмяПоляВвода, Тип("ПолеФормы"), Элементы.ГруппаРезультатДействияТекстомГраницаЦентр);
			НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
			НовоеПоле.ПутьКДанным = "ИКТ_Ответственный";
			НовоеПоле.АвтоОтметкаНезаполненного = Истина;
			НовоеПоле.РедактированиеТекста = Ложь;
			НовоеПоле.КнопкаВыбора = Ложь;
			НовоеПоле.Заголовок = Результат.Заголовок;
			НовоеПоле.КнопкаСпискаВыбора = Истина;
			НовоеПоле.РежимВыбораИзСписка = Истина;
			
			// 2. Заполняем список выбора конкретными сотрудниками (МассивСотрудников должен быть подготовлен заранее)
			// Например: МассивСотрудников = Новый Массив; МассивСотрудников.Добавить(Ссылка1); ...
			Для Каждого ТекущийСотрудник Из МассивСотрудников Цикл
				НовоеПоле.СписокВыбора.Добавить(ТекущийСотрудник);
			КонецЦикла;
		Иначе
			ИмяПоляВвода = "ПолеИКТ_Ответственный";
			Если Не Элементы.Найти(ИмяПоляВвода) = Неопределено Тогда
				Элементы[ИмяПоляВвода].Видимость = Истина;
				
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ИмяПоляВвода = "ПолеИКТ_Ответственный";
		Если Не Элементы.Найти(ИмяПоляВвода) = Неопределено Тогда
			Элементы[ИмяПоляВвода].Видимость = Ложь;
			
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаменитьСотрудника(ID, ИКТ_Ответственный, ИКТ_РольОтветственного)
	
	Определение = Новый WSОпределения(Константы.АдресВебСервиса1СДокументооборот.Получить() + "ws\ikt_ERP.1cws?wsdl",
	Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить(), Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить(),,120);
	
	Прокси = Новый WSПрокси(Определение, "www.IKT.ru", "ikt_ERP", "ikt_ERPSoap");
	Прокси.Пользователь	= Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить();
	Прокси.Пароль 		= Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить();
	Параметр = Новый Структура("Команда, УИД, Роль, Сотрудник, База", "ЗаменитьСотрудника", ID,ИКТ_РольОтветственного, ""+ ИКТ_Ответственный.УникальныйИдентификатор(), "Стройка");        
	Результат = Прокси.Exec(Новый ХранилищеЗначения(Параметр, Новый СжатиеДанных(6)), 
	Истина).Получить();
	
КонецПроцедуры

&НаКлиенте
&Вместо("ДействиеНадЗадачей")
Процедура Расш1_ДействиеНадЗадачей(ТипОперации, ПараметрыДействияНадЗадачей)
	СтрокаЗадачи = Элементы.СписокДействияЗадач.ТекущиеДанные;
	Если Не СтрокаЗадачи = Неопределено Тогда
		ДействиеЗадачиID = СтрокаЗадачи.ДействиеЗадачиID;
		ИмяПоляВвода = "ПолеИКТ_Ответственный";
		ЭлСотрудника = Элементы.Найти(ИмяПоляВвода);
		Если Не ЭлСотрудника = Неопределено И ЭлСотрудника.Видимость Тогда
			Если Не ЗначениеЗаполнено(ЭтаФОрма.ИКТ_Ответственный) Тогда
				ТекстСообщения = "Поле """ + ЭлСотрудника.Заголовок + """ обязательно для заполнения!";
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				,
				"ЭтаФорма.ИКТ_Ответственный",
				"Объект",
				
				);
				Возврат;
			КонецЕсли;
			ЗаменитьСотрудника(ДействиеЗадачиID, ЭтаФорма.ИКТ_Ответственный, ЭтаФорма.ИКТ_РольОтветственного);
		КонецЕсли;
	КонецЕсли;
	
	ПродолжитьВызов(ТипОперации, ПараметрыДействияНадЗадачей);
КонецПроцедуры

&НаКлиенте
&После("ОтобразитьДанныеПоТекущейЗадаче")
Процедура Расш1_ОтобразитьДанныеПоТекущейЗадаче(СтрокиНовыхФайлов)
	СтрокаЗадачи = Элементы.СписокДействияЗадач.ТекущиеДанные;
	Если Не СтрокаЗадачи = Неопределено Тогда
		ПроверитьЗамену(СтрокаЗадачи.ДействиеЗадачиID);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
	ОписаниеТиповСотрудник = Новый ОписаниеТипов(МассивТипов);
	
	НовыйРеквизит = Новый РеквизитФормы("ИКТ_Ответственный", ОписаниеТиповСотрудник, "", "Сотрудник", Истина);
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповРоли = Новый ОписаниеТипов(МассивТипов);
	
	// 1. Создаем сам реквизит в данных формы
	НовыйРеквизит = Новый РеквизитФормы("ИКТ_РольОтветственного", ОписаниеТиповРоли, "", "Роль", Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
КонецПроцедуры
