
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСтатей.ЗагрузитьЗначения(Параметры.СписокСтатей.ВыгрузитьЗначения());
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИЗакрыть(Команда)
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("СписокСтатей", СписокСтатей);
	СтруктураРезультата.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);

	ОповеститьОВыборе(СтруктураРезультата);
	
КонецПроцедуры

#КонецОбласти
