////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с проведением документов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает структурированную копию значений всех реквизитов документа.
//  Это требуется в тех случаях, когда работать напрямую с объектом нежелательно.
//  Данные, возвращаемые функцией, используются только для чтения.
//  Сам объект не изменяется.
//
// Параметры:
//  Документ - ДокументСсылка	 - ссылка на документ, копия которого требуется.
// 
// Возвращаемое значение:
//  Структура - структура данных документа, свойство:
//  * ШапкаДокумента - ТаблицаЗначений - содержит копию шапки в виде ТЗ (с одной строкой);
//  * ИмяТабличнойЧасти - Строка - содержит копию табличной части.
//
Функция обПолучитьДанныеДокумента(Документ) Экспорт
	
	ОписаниеДокумента = Документ.Метаданные();
	
	ДанныеДокумента = Новый Структура();
			
	Для Каждого РеквизитШапки Из ОписаниеДокумента.Реквизиты Цикл
		ДанныеДокумента.Вставить(РеквизитШапки.Имя, Документ[РеквизитШапки.Имя]);
	КонецЦикла; 	
	
	Для Каждого РеквизитШапки Из ОписаниеДокумента.СтандартныеРеквизиты Цикл
		ДанныеДокумента.Вставить(РеквизитШапки.Имя, Документ[РеквизитШапки.Имя]);
	КонецЦикла; 
	
	Для Каждого ТабличнаяЧасть Из ОписаниеДокумента.ТабличныеЧасти Цикл
		ДанныеТабличнойЧасти = Новый ТаблицаЗначений();	
		ДанныеТабличнойЧасти.Колонки.Добавить("НомерСтроки");
		Для Каждого РеквизитТабличнойЧасти Из ТабличнаяЧасть.Реквизиты Цикл
			ДанныеТабличнойЧасти.Колонки.Добавить(РеквизитТабличнойЧасти.Имя, Новый ОписаниеТипов(РеквизитТабличнойЧасти.Тип));	
		КонецЦикла;
		Для Каждого СтрокаТЧ Из Документ[ТабличнаяЧасть.Имя] Цикл
			ЗаполнитьЗначенияСвойств(ДанныеТабличнойЧасти.Добавить(), СтрокаТЧ);
		КонецЦикла;
		ДанныеДокумента.Вставить(ТабличнаяЧасть.Имя, ДанныеТабличнойЧасти);		
	КонецЦикла;
	
	// Добавляем сам объект.
	ДанныеДокумента.Вставить("ЭтотОбъект", Документ);
	
	// Все данные собраны.
	Возврат ДанныеДокумента;
	
КонецФункции

// Получает структуру метаданных для подготовки движений документа.
//  Структура включает описания метаданных всех регистров,
//  для которых документ является регистратором.
//
// Параметры:
//  Документ - ДокументСсылка	 - ссылка на документ.
// 
// Возвращаемое значение:
//  Структура - структурированное описание метаданных:
//  * ИмяРегистра - содержит описание метаданных регистра.
//
Функция обПолучитьОписаниеРегистровДляДвижения(Документ) Экспорт
	
	ПустойМассив = Новый Массив;
	
	// Создаем структуру для хранения описаний.
	
	ОписаниеРегистров = Новый Структура();
	
	// Выясняем, какие регистры может двигать документ.
	
	Для каждого Регистр Из Метаданные.Документы[Документ.Метаданные().Имя].Движения Цикл
		
		// Получаем структуру самым простым способом
		// берем Движения и выгружаем в ТЗ.
		
		ОписаниеРегистра = Документ.Движения[Регистр.Имя].Выгрузить(ПустойМассив);
		
		// И добавляем в общую структуру.
		
		ОписаниеРегистров.Вставить(Регистр.Имя, ОписаниеРегистра);
		
	КонецЦикла; 
	
	// Структура описаний готова.
	
	Возврат ОписаниеРегистров;
	
КонецФункции

// Получает таблицу правил наложения реквизитов документа
//  на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде плоской структуры.
//
// Параметры:
//  Документ		 - ДокументСсылка	 - ссылка на документ
//  ДанныеДокумента	 - Структура		 - данные документа в виде структуры.
// 
// Возвращаемое значение:
//  Структура - иерархическая структура пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция обПолучитьПравилаНаложенияРеквизитовНаРегистр(Документ, ДанныеДокумента) Экспорт
	
	// Функционал реализуется в модуле документа
	// данная функция представляет собой точку входа.
	
	Возврат Документ.ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента);
	
КонецФункции

// Универсальный генератор движений по регистрам для всех документов.
//
// Параметры:
//  Документ		 - ДокументОбъект			 - содержит сам объект.
//  ДанныеДокумента	 - Структура				 - данные документа в виде структуры.
//  Отказ			 - Булево					 - признак проведения документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура обПровестиДокументПоРегистрам(Документ, ДанныеДокумента, Отказ, РежимПроведения) Экспорт
	
	// Подготавливаем данные.
	// Нам требуется полная копия всех реквизитов документа.
	// Описание метаданных всех регистров, которые он может двигать,
	// и правила наложения первого на второе.
	
	ОписаниеРегистров = обПолучитьОписаниеРегистровДляДвижения(Документ);
	ПравилаНаложения = обПолучитьПравилаНаложенияРеквизитовНаРегистр(Документ, ДанныеДокумента);
	
	// Производим наложение данных документа на данные регистров.
	
	ДанныеДвижений = обПодготовитьДанныеДляДвижений(Документ, ДанныеДокумента, ОписаниеРегистров, ПравилаНаложения,
																							Отказ, РежимПроведения);
	
	Если Отказ Тогда      
		Возврат;		             
	КонецЕсли; 
	
	// После того, как данные подготовлены, можно осуществить дополнительные проверки и обработки,
	// для этого есть вся информация.
	
	// Это делает документ, потому что только он знает, что и как нужно делать .
	
	Документ.ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения);
	
	// Точка входа для установки системных атрибутов.
	
	обУстановитьАктивностьДвиженийРегистра(Документ, ДанныеДвижений, Отказ, РежимПроведения);
	
	Если Отказ Тогда      
		Возврат;
	КонецЕсли; 
	
	// Теперь данные движений окончательно готовы к записи, передаем их на запись.
	
	обЗаписатьДвиженияПоРегистрам(Документ, ДанныеДвижений, Отказ, РежимПроведения);
	
КонецПроцедуры
 
// Общая проверка данных на корректность при проведении документа.
//
// Параметры:
//  Документ		 - ДокументОбъект			 - содержит сам объект.
//  ДанныеДокумента	 - Структура				 - данные документа в виде структуры.
//  Отказ			 - Булево					 - Признак проведения документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//  Заголовок		 - Строка
//
Процедура обПроверитьДанныеДокумента(Документ, ДанныеДокумента, Отказ, РежимПроведения, Заголовок) Экспорт
	
	Документ.ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок);
	
КонецПроцедуры

// Удаляет движения документа.
//
// Параметры:
//  Отказ			 - Булево - признак отказа от выполнения действия.
//  ДокументОбъект	 - ДокументОбъект - документ, для которого происходит удаление движений.
//
Процедура обУдалитьДвиженияДокумента(Отказ, ДокументОбъект) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивРегистров = Новый Массив();
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("НеОчищатьРегистры") Тогда
		НеОчищатьРегистры = ДокументОбъект.ДополнительныеСвойства.НеОчищатьРегистры; 
	Иначе
		НеОчищатьРегистры = Неопределено;
	КонецЕсли;
	
	ДвиженияДокумента = ДокументОбъект.Метаданные().Движения;
	Для Каждого Движение Из ДвиженияДокумента Цикл
		ПолноеИмя = Движение.ПолноеИмя();
		Если НеОчищатьРегистры <> Неопределено Тогда
			Если НеОчищатьРегистры.Найти(ПолноеИмя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		МассивРегистров.Добавить(Движение.ПолноеИмя());
	КонецЦикла;
	
	Если МассивРегистров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПолноеИмяРегистра Из МассивРегистров Цикл
		
		ПозицияТочки = Найти(ПолноеИмяРегистра, ".");
		ТипРегистра = Лев(ПолноеИмяРегистра, ПозицияТочки - 1);
		ИмяРегистра = СокрП(Сред(ПолноеИмяРегистра, ПозицияТочки + 1));
		
		упоПроведениеДокументовСервер.ОчиститьНаборЗаписей(ТипРегистра, ИмяРегистра, ДокументОбъект.Ссылка, 
												ДокументОбъект.Движения[ИмяРегистра].ДополнительныеСвойства);		
		
	КонецЦикла;	
	
	Для Каждого НаборЗаписей Из ДокументОбъект.Движения Цикл		
		Если НаборЗаписей.Количество() > 0 Тогда	
			НаборЗаписей.Очистить();	
		КонецЕсли;		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает структуру данных для предполагаемых движений по
// регистру и устанавливает значения системных атрибутов.
//
// Параметры:
//  Документ		– Документ.Ссылка – документ, двигающий регистры.
//  ДанныеДвижения  – Структура – подготовленная структура данных для движений регистров.
//  Отказ			- Булево - признак отказа от записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
//
Процедура обУстановитьАктивностьДвиженийРегистра(Документ, ДанныеДвижений, Отказ, РежимПроведения)
	
	Для каждого ТаблицаДвижений Из ДанныеДвижений Цикл
		естьПериод = НЕ ТаблицаДвижений.Значение.Колонки.Найти("Период") = Неопределено;
		естьРегистратор = НЕ ТаблицаДвижений.Значение.Колонки.Найти("Регистратор") = Неопределено;
		естьАктивность = НЕ ТаблицаДвижений.Значение.Колонки.Найти("Активность") = Неопределено;
		
		Если естьАктивность Тогда
			ТаблицаДвижений.Значение.ЗаполнитьЗначения(Истина, "Активность");
		КонецЕсли;
				
		Если естьПериод Тогда
			Для каждого строкаТЧ Из ТаблицаДвижений.Значение Цикл
				Если НЕ ЗначениеЗаполнено(строкаТЧ.Период) Тогда
					строкаТЧ.Период = Документ.Дата;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если естьРегистратор Тогда
			ТаблицаДвижений.Значение.ЗаполнитьЗначения(Документ.Ссылка, "Регистратор");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Производит наложение реквизитов документа на структуру данных регистров
// согласно заданным правилам наложения.
//
// Параметры:
//  Документ	 		– ДокументСсылка - ссылка на документ.
//  ДанныеДокумента		– Структура - полная копия всех реквизитов документа.
//  ОписаниеРегистров	– Структура - описание метаданных регистров,
// 						  для которых нужно подготовить данные.
//  ПравилаНаложения	– Структура - описание правил наложения документа на регистр.
//  Отказ				- Булево - признак отказа от записи документа.
//  РежимПроведения 	- РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
//
// Возвращаемое значение:
//   Структура   – структура данных, полностью готовая для записи в регистры.
//
Функция обПодготовитьДанныеДляДвижений(Документ, ДанныеДокумента, ОписаниеРегистров, ПравилаНаложения, Отказ, РежимПроведения)
	
	// Делаем наложение по очереди для каждого регистра.
	
	Для Каждого ДвиженияРегистра Из ОписаниеРегистров Цикл
		
		ТаблицаДвижений = ДвиженияРегистра.Значение;
		
		// Находим в правилах наложения правила для этого регистра.
		// Но правил для регистра может и не быть.
		
		Правила = Неопределено;
		
		Если Не ПравилаНаложения.Свойство(ДвиженияРегистра.Ключ, Правила) Тогда      
			обСообщитьОтладка("Не найдены правила наложения данных для регистра " + ДвиженияРегистра.Ключ);
			Продолжить;
		КонецЕсли; 
		
		// Для одного регистра может быть определено несколько
		// таблиц данных документа.
		
		Для Каждого ПравилаТаблицы Из Правила Цикл
			
			// Шапку и табличные части документа обрабатываем отдельно.
			Если ПравилаТаблицы.Ключ = "ШапкаДокумента" Тогда
				
				// ШАПКА.
				
				// Для одной таблицы документа может формироваться несколько движений.
				Для Каждого ПравилоДвижения Из ПравилаТаблицы.Значение Цикл
						
					// Создаем новую "запись" движений регистра.
					НоваяЗапись = ТаблицаДвижений.Добавить();
						
					// И смотрим в правилах, какие именно реквзиты туда нужно записать.
					Для Каждого Правило Из ПравилоДвижения.Значение Цикл
												
						// В ключе у нас записано имя реквизита ресурса,
						// а в значении записано имя реквизита документа.
						// Но этих реквизитов может не быть в структуре данных.
						ИмяРеквизитаРегистра	= Правило.Ключ;
						ИмяРеквизитаДокумента	= Правило.Значение;
							
						ЗначениеРеквизита = Неопределено;
						
						// По правилам можно сразу получать значение без реквизита документа.
						Если ТипЗнч(ИмяРеквизитаДокумента) = Тип("Структура") Тогда
							ЗначениеРеквизита = ИмяРеквизитаДокумента.Значение;
						Иначе
							// По правилам из шапки можно брарть и так.
							Если Лев(ИмяРеквизитаДокумента, 6) = "Шапка_" Тогда
								ИмяРеквизитаДокумента = Прав(ИмяРеквизитаДокумента, СтрДлина(ИмяРеквизитаДокумента) - 6);
							КонецЕсли; 
							
							// Для шапки всегда берем значение напрямую из структуры, если таковое есть.
							Если Не ДанныеДокумента.Свойство(ИмяРеквизитаДокумента, ЗначениеРеквизита) Тогда
								обСообщитьОтладка("В структуре данных документа не найден реквизит шапки документа: " + ИмяРеквизитаДокумента);
								Отказ = Истина;
								Возврат Неопределено;
							КонецЕсли; 
						КонецЕсли;
						
						Если ТаблицаДвижений.Колонки.Найти(ИмяРеквизитаРегистра) = Неопределено Тогда      
							обСообщитьОтладка("В таблице движений не найден реквизит регистра " + ДвиженияРегистра.Ключ + ":" 
								+ ИмяРеквизитаРегистра);
							Отказ = Истина;
							Возврат Неопределено; 
						КонецЕсли; 
							
						НоваяЗапись[ИмяРеквизитаРегистра] = ЗначениеРеквизита;
							
					КонецЦикла; // По правилам наложения для конкретного регистра.
						
				КонецЦикла; // По списку движений для конкретной строки таблицы.
				
			Иначе
			
				// ТАБЛИЧНАЯ ЧАСТЬ.
				
				ТаблицаДанных = Неопределено;
				
				// Согласно правилам наложения нужно запустить цикл по таблице данных.
				// Но такой таблицы может и не быть в структуре данных .
				Если Не ДанныеДокумента.Свойство(ПравилаТаблицы.Ключ, ТаблицаДанных) Тогда      
					обСообщитьОтладка("Не найдена таблица данных по имени " + ПравилаТаблицы.Ключ);
					Продолжить;
				КонецЕсли;
					
				// Таблица есть, запускаем по ней цикл.
				Для Каждого СтрокаДанныхДокумента Из ТаблицаДанных Цикл
					
					// Для одной таблицы документа может формироваться несколько движений.
					Для Каждого ПравилоДвижения Из ПравилаТаблицы.Значение Цикл
						
						// Создаем новую "запись" движений регистра.
						НоваяЗапись = ТаблицаДвижений.Добавить();
						
						// И смотрим в правилах, какие именно реквзиты туда нужно записать.
						Для Каждого Правило Из ПравилоДвижения.Значение Цикл
												
							// В ключе у нас записано имя реквизита ресурса,
							// а в значении записано имя реквизита документа.
							// Но этих реквизитов может не быть в структуре данных.
							ИмяРеквизитаРегистра	= Правило.Ключ;
							ИмяРеквизитаДокумента	= Правило.Значение;
							
							// С реквизитом документа сложнее, он может быть в шапке, а может быть в таблице.
							ЗначениеРеквизита = Неопределено;
							
							// По правилам можно сразу получать значение без реквизита документа.
							Если ТипЗнч(ИмяРеквизитаДокумента) = Тип("Структура") Тогда
								ЗначениеРеквизита = ИмяРеквизитаДокумента.Значение;
							Иначе
								ЭтоРеквизитШапки = Ложь;
								
								Если Лев(ИмяРеквизитаДокумента, 6) = "Шапка_" Тогда      
									ИмяРеквизитаДокумента = Прав(ИмяРеквизитаДокумента, СтрДлина(ИмяРеквизитаДокумента) - 6);
									ЭтоРеквизитШапки = Истина;
								КонецЕсли; 
								
								Если Не ЭтоРеквизитШапки Тогда
									// Ищем в таблице.
									РеквизитНайден = ТаблицаДанных.Колонки.Найти(ИмяРеквизитаДокумента);
								Иначе
									// Ищем в структуре.
									РеквизитНайден = ДанныеДокумента.Свойство(ИмяРеквизитаДокумента);
								КонецЕсли; 
								
								// Завершаем проверку.
								Если РеквизитНайден = Неопределено Тогда      
									Если Не ЭтоРеквизитШапки Тогда
										обСообщитьОтладка("В таблице структуры данных документа не найден реквизит документа: " 
											+ ИмяРеквизитаДокумента);
									Иначе
										обСообщитьОтладка("В структуре данных документа не найден реквизит шапки документа: " 
											+ ИмяРеквизитаДокумента);
									КонецЕсли;
									Отказ = Истина;
									Возврат Неопределено;
								КонецЕсли; 
								
								// Все проверки закончены, теперь нужно просто положить нужное значение в правильное место.
								Если Не ЭтоРеквизитШапки Тогда
									// Берем из таблицы данных.
									ЗначениеРеквизита = СтрокаДанныхДокумента[ИмяРеквизитаДокумента];
								Иначе
									// Берем напрямую из структуры данных.
									ЗначениеРеквизита = ДанныеДокумента[ИмяРеквизитаДокумента];
								КонецЕсли;
							КонецЕсли;
							
							Если ТаблицаДвижений.Колонки.Найти(ИмяРеквизитаРегистра) = Неопределено Тогда      
								обСообщитьОтладка("В таблице движений не найден реквизит регистра " + ДвиженияРегистра.Ключ + ":"
									+ ИмяРеквизитаРегистра);
								Отказ = Истина;
								Возврат Неопределено; 
							КонецЕсли; 
							
							НоваяЗапись[ИмяРеквизитаРегистра] = ЗначениеРеквизита;
							
						КонецЦикла; // По правилам наложения для конкретного регистра.
						
					КонецЦикла; // По списку движений для конкретной строки таблицы.
					
				КонецЦикла; // По строкам таблицы данных документа.
				
			КонецЕсли; // Шапка/табличная часть.
			
		КонецЦикла; // По списку правил для таблиц документа.
		
	КонецЦикла; // По регистрам, предназначенным к записи.
	
	// Фактически, все данные собраны, проверены и наложены.
	// Возвращаем готовую структуру.
	
	Возврат ОписаниеРегистров;
	
КонецФункции

// Производит запись движений в регистры.
//
// Параметры:
//  Документ		– ДокументСсылка – документ, двигающий регистры.
//  ДанныеДвижения  – Структура – подготовленная структура данных для движений регистров.
//  Отказ			- Булево - признак отказа от записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
//
Процедура обЗаписатьДвиженияПоРегистрам(Документ, ДанныеДвижений, Отказ, РежимПроведения)
	
	// Наша структура данных представляет собой иерархию таблиц значений
	// имя каждой из которых совпадает с именем регистра.
	
	// Вот и обойдем все регистры по очереди.
	
	ИмяДокумента		= Документ.Метаданные().Имя;
	МетаданныеДокумент	= Метаданные.Документы[ИмяДокумента];		
	
	ЭтоНовый = Документ.ДополнительныеСвойства.Свойство("ЭтоНовый") И Документ.ДополнительныеСвойства.ЭтоНовый;
	
	Для каждого ОписаниеРегистра Из МетаданныеДокумент.Движения Цикл		
		
		// Получаем описание метаданных этого регистра и таблицу данных
		// для движений по нему.
		
		Если НЕ ДанныеДвижений.Свойство(ОписаниеРегистра.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДвижений = ДанныеДвижений[ОписаниеРегистра.Имя];		
		
		Если ЭтоНовый И ТаблицаДвижений.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Формируем движения регистра по таблице значений.
		
		Документ.Движения[ОписаниеРегистра.Имя].Загрузить(ТаблицаДвижений);				
		
	КонецЦикла; // По регистрам, которые двигает документ.
	
КонецПроцедуры

#КонецОбласти