////////////////////////////////////////////////////////////////////////////////
// Модуль упоМенеджерОбменаЧерезУниверсальныйФорматEPM является расширением
// функционала типового модуля ERP МенеджерОбменаЧерезУниверсальныйФормат.
//
// Все экспортные методы этого модуля вызывать в конце одноименных методов
// модуля МенеджерОбменаЧерезУниверсальныйФормат.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение(ПравилаКонвертации) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИмяПКО", "Документ_ОтражениеЗарплатыВФинУчете_Получение");
	ПараметрыОтбора.Вставить("ОбъектДанных", Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете);
	ПараметрыОтбора.Вставить("ОбъектФормата", "Документ.ОтражениеЗарплатыВФинансовомУчете");
	ПараметрыОтбора.Вставить("ПриКонвертацииДанныхXDTO", "ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПриКонвертацииДанныхXDTO");
	ПараметрыОтбора.Вставить("ПередЗаписьюПолученныхДанных", "ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПередЗаписьюПолученныхДанных");
	ПараметрыОтбора.Вставить("ВариантИдентификации", "ПоУникальномуИдентификатору");
	
	Найдено = ПравилаКонвертации.НайтиСтроки(ПараметрыОтбора);
	Если НЕ Найдено.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонвертации = Найдено[0];
	
	///////////////////////////////////////////////////////////////
	СтрокаТаблицы = ПравилоКонвертации.СвойстваТабличныхЧастей.Найти("НачисленнаяЗарплатаИВзносы", "ТЧКонфигурации");
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СвойстваТЧ = СтрокаТаблицы.Свойства;
		ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "", 1, "Справочник_ФизическиеЛица_Получение");
	КонецЕсли;
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "НачисленнаяЗарплатаИВзносыПоФизлицам", "");
	ДобавитьПКС(СвойстваТЧ, "ВзносыВсего", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ВзносыПоЕдиномуТарифу", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ВидНачисленияОплатыТрудаДляНУ", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ВидОперации", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ОблагаетсяЕНВД", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПодразделениеПредприятия", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРДоПредельнойВеличины", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРНаДоплатуЛетчикам", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРНаДоплатуШахтерам", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРНакопительная", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРПоСуммарномуТарифу", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРСПревышения", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРСтраховая", "", 1);
	ДобавитьПКС(СвойстваТЧ, "СпособОтраженияЗарплатыВБухучете", "", 1, "Справочник_СпособыОтраженияЗарплатыВБухУчете");
	ДобавитьПКС(СвойстваТЧ, "СпособРасчетов", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ТФОМС", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФСС", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФССНесчастныеСлучаи", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФФОМС", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "", 1, "Справочник_ФизическиеЛица_Получение");
	ДобавитьПКС(СвойстваТЧ, "упоНачислениеЗУП", "", 1);
	ДобавитьПКС(СвойстваТЧ, "упоНачислениеPM", "", 1);
	
	// НачисленныйНДФЛ
	СтрокаТаблицы = ПравилоКонвертации.СвойстваТабличныхЧастей.Найти("НачисленныйНДФЛ", "ТЧКонфигурации");
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СвойстваТЧ = СтрокаТаблицы.Свойства;
		ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "", 1, "Справочник_ФизическиеЛица_Получение");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена) Экспорт
	ПолученныеДанные.Проведен = Истина;
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСвойстваДопИнформация = "AdditionalInfo";
	ДополнительныеСвойства = Неопределено;
	
	Если НЕ ДанныеXDTO.Свойство(ИмяСвойстваДопИнформация, ДополнительныеСвойства)
		И НЕ ТипЗнч(ДополнительныеСвойства) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные.Сводно = Ложь;
	ПолученныеДанные.ПроводкиПоРаботникам = Истина;
	
	ВидыОперацийПоЗарплатеЗначения = Метаданные.Перечисления["ВидыОперацийПоЗарплате"].ЗначенияПеречисления;
	ВидыНачисленияОплатыТрудаДляНУЗначения = Метаданные.Перечисления["ВидыНачисленийОплатыТрудаДляНУ"].ЗначенияПеречисления;
	СпособыРасчетовСФизическимиЛицами = Метаданные.Перечисления["СпособыРасчетовСФизическимиЛицами"].ЗначенияПеречисления;
	
	// НачисленнаяЗарплатаИВзносы
	НачисленнаяЗарплатаИВзносыXDTO = Неопределено;
	Если ДанныеXDTO.Свойство("НачисленнаяЗарплатаИВзносы", НачисленнаяЗарплатаИВзносыXDTO)
		И ЗначениеЗаполнено(НачисленнаяЗарплатаИВзносыXDTO) Тогда
		
		МассивНачисленнаяЗарплатаИВзносыПоФизлицам = Новый Массив;
		
		Для Каждого СтрокаНачисленнаяЗарплатаИВзносыXDTO Из НачисленнаяЗарплатаИВзносыXDTO Цикл
			
			СтрокаНачисленнаяЗарплатаИВзносы = Новый Структура;
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФизическоеЛицо");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПодразделениеПредприятия");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ВидОперации");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("СпособОтраженияЗарплатыВБухучете");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОблагаетсяЕНВД");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("Сумма");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ВзносыВсего");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ВидНачисленияОплатыТрудаДляНУ");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРСтраховая");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРНакопительная");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРПоСуммарномуТарифу");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРНаДоплатуЛетчикам");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРНаДоплатуШахтерам");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФСС");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФФОМС");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ТФОМС");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФССНесчастныеСлучаи");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРДоПредельнойВеличины");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРСПревышения");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("СпособРасчетов");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ВзносыПоЕдиномуТарифу");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОПСпоМеждународнымДоговорам");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОПСпоМеждународнымДоговорамСПревышения");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОМСпоМеждународнымДоговорам");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОМСпоМеждународнымДоговорамСПревышения");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОССпоМеждународнымДоговорам");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОССпоМеждународнымДоговорамСПревышения");
			
			ЗаполнитьЗначенияСвойств(СтрокаНачисленнаяЗарплатаИВзносы, СтрокаНачисленнаяЗарплатаИВзносыXDTO);
			СтрокаНачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтрокаНачисленнаяЗарплатаИВзносыXDTO.СпособОтраженияЗарплатыВФинансовомУчете;
			
			СтрокаПодразделениеXDTO = Новый Структура("Подразделение");
			ЗаполнитьЗначенияСвойств(СтрокаПодразделениеXDTO, СтрокаНачисленнаяЗарплатаИВзносыXDTO);
			Если ЗначениеЗаполнено(СтрокаПодразделениеXDTO.Подразделение)
				И ТипЗнч(СтрокаПодразделениеXDTO.Подразделение) = Тип("Структура") Тогда
				Если Не СтрокаПодразделениеXDTO.Подразделение.Свойство("Ссылка") Тогда
					СтрокаНачисленнаяЗарплатаИВзносы.ПодразделениеПредприятия = ЭлементПоУмолчанию(КомпонентыОбмена, "Подразделение");
				Иначе
					СтрокаНачисленнаяЗарплатаИВзносы.ПодразделениеПредприятия = Новый Структура("Значение, ИмяПКО",
							СтрокаПодразделениеXDTO.Подразделение, "Справочник_Подразделения_Получение");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНачисленнаяЗарплатаИВзносы.ВидОперации) Тогда
				ВидОперацииМД = ВидыОперацийПоЗарплатеЗначения.Найти(СтрокаНачисленнаяЗарплатаИВзносы.ВидОперации);
				Если Не ВидОперацииМД = Неопределено Тогда
					СтрокаНачисленнаяЗарплатаИВзносы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Получить(ВидыОперацийПоЗарплатеЗначения.Индекс(ВидОперацииМД));
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ) Тогда
				ВидНачисленияОплатыТрудаДляНУМД = ВидыНачисленияОплатыТрудаДляНУЗначения.Найти(СтрокаНачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ);
				Если Не ВидНачисленияОплатыТрудаДляНУМД = Неопределено Тогда
					СтрокаНачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ =
						Перечисления.ВидыНачисленийОплатыТрудаДляНУ.Получить(ВидыНачисленияОплатыТрудаДляНУЗначения.Индекс(ВидНачисленияОплатыТрудаДляНУМД));
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНачисленнаяЗарплатаИВзносы.СпособРасчетов) Тогда
				СпособРасчетовМД = СпособыРасчетовСФизическимиЛицами.Найти(СтрокаНачисленнаяЗарплатаИВзносы.СпособРасчетов);
				Если Не СпособРасчетовМД = Неопределено Тогда
					МенеджерСпособыРасчетовСФизическимиЛицами = ОбщегоНазначения.ОбщийМодуль("Перечисления.СпособыРасчетовСФизическимиЛицами");
					СтрокаНачисленнаяЗарплатаИВзносы.СпособРасчетов =
						МенеджерСпособыРасчетовСФизическимиЛицами.Получить(СпособыРасчетовСФизическимиЛицами.Индекс(СпособРасчетовМД));
				КонецЕсли;
			КонецЕсли;
			
			МенеджерОтражениеЗарплатыВФинансовомУчете = ОбщегоНазначения.ОбщийМодуль("Документы.ОтражениеЗарплатыВФинансовомУчете");
			КолонкиДляСуммированияСтрокой = МенеджерОтражениеЗарплатыВФинансовомУчете.КолонкиДляСуммирования();
			КолонкиДляСуммирования = Новый Структура(КолонкиДляСуммированияСтрокой);
			
			СтрокаНачисленнаяЗарплатаИВзносы.ВзносыВсего = 0;
			Для Каждого Колонка Из КолонкиДляСуммирования Цикл
				Если СтрокаНачисленнаяЗарплатаИВзносы[Колонка.Ключ] = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаНачисленнаяЗарплатаИВзносы.ВзносыВсего = СтрокаНачисленнаяЗарплатаИВзносы.ВзносыВсего
					+ СтрокаНачисленнаяЗарплатаИВзносы[Колонка.Ключ];
			КонецЦикла;
			
			МассивНачисленнаяЗарплатаИВзносыПоФизлицам.Добавить(СтрокаНачисленнаяЗарплатаИВзносы);
			
		КонецЦикла;
		
		///////////////////////////////////////////////////////////////
		Если МассивНачисленнаяЗарплатаИВзносыПоФизлицам.Количество() Тогда
			
			МассивНачисленийТаблицы = Неопределено;
			Если ДополнительныеСвойства.Свойство("НачисленнаяЗарплатаИВзносы", МассивНачисленийТаблицы)
				И НЕ МассивНачисленийТаблицы = Неопределено Тогда
				
				КартаНачислений = Новый Соответствие;
				
				ИмяКолонкиНачислениеPM = "упоНачислениеPM";
				ИмяКолонкиНачислениеЗУП = "упоНачислениеЗУП";
				Индекс = 0;
				
				СоответствиеНачисленийPM = упоРаспределениеЗарплатыНастройкиСервер.ПолучитьСоответствиеНачисленийPM();
				
				Для Каждого СтруктураСтрокаНачисление Из МассивНачисленийТаблицы Цикл
					СсылкаНачислениеЗУП = ПолучитьНачислениеЗУП(СтруктураСтрокаНачисление);
					
					ДанныеНачислений = Новый Структура;
					ДанныеНачислений.Вставить(ИмяКолонкиНачислениеPM, СоответствиеНачисленийPM.Получить(СсылкаНачислениеЗУП));
					ДанныеНачислений.Вставить(ИмяКолонкиНачислениеЗУП, СсылкаНачислениеЗУП);
					
					КартаНачислений.Вставить(Индекс, ДанныеНачислений);
					Индекс = Индекс + 1;
				КонецЦикла;
				
				Индекс = 0;
				Для Каждого Строка Из МассивНачисленнаяЗарплатаИВзносыПоФизлицам Цикл
					ДанныеНачислений = КартаНачислений.Получить(Индекс);
					Индекс = Индекс + 1;
					Если НЕ ДанныеНачислений = Неопределено Тогда
						Строка.Вставить(ИмяКолонкиНачислениеPM, ДанныеНачислений[ИмяКолонкиНачислениеPM]);
						Строка.Вставить(ИмяКолонкиНачислениеЗУП, ДанныеНачислений[ИмяКолонкиНачислениеЗУП]);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////
		ПолученныеДанные.ДополнительныеСвойства.Вставить("НачисленнаяЗарплатаИВзносыПоФизлицам", МассивНачисленнаяЗарплатаИВзносыПоФизлицам);
		
	КонецЕсли;
	
	// НачисленныйНДФЛ
	НачисленныйНДФЛXDTO = Неопределено;
	Если ДанныеXDTO.Свойство("НачисленныйНДФЛ", НачисленныйНДФЛXDTO)
		И ЗначениеЗаполнено(НачисленныйНДФЛXDTO) Тогда
		
		МассивНачисленныйНДФЛ = Новый Массив;
		
		Для Каждого СтрокаНачисленныйНДФЛXDTO Из НачисленныйНДФЛXDTO Цикл
			
			СтрокаНачисленныйНДФЛ = Новый Структура(
				"ФизическоеЛицо, ВидОперации, ПодразделениеПредприятия, РегистрацияВНалоговомОргане, Сумма, СпособРасчетов");
			
			ЗаполнитьЗначенияСвойств(СтрокаНачисленныйНДФЛ, СтрокаНачисленныйНДФЛXDTO);
			
			СтрокаПодразделениеXDTO = Новый Структура("Подразделение");
			ЗаполнитьЗначенияСвойств(СтрокаПодразделениеXDTO, СтрокаНачисленныйНДФЛXDTO);
			Если ЗначениеЗаполнено(СтрокаПодразделениеXDTO.Подразделение)
				И ТипЗнч(СтрокаПодразделениеXDTO.Подразделение) = Тип("Структура") Тогда
				Если Не СтрокаПодразделениеXDTO.Подразделение.Свойство("Ссылка") Тогда
					СтрокаНачисленныйНДФЛ.ПодразделениеПредприятия = ЭлементПоУмолчанию(КомпонентыОбмена, "Подразделение");
				Иначе
					СтрокаНачисленныйНДФЛ.ПодразделениеПредприятия = Новый Структура("Значение, ИмяПКО",
							СтрокаПодразделениеXDTO.Подразделение, "Справочник_Подразделения_Получение");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНачисленныйНДФЛ.СпособРасчетов) Тогда
				СпособРасчетовМД = СпособыРасчетовСФизическимиЛицами.Найти(СтрокаНачисленныйНДФЛ.СпособРасчетов);
				Если Не СпособРасчетовМД = Неопределено Тогда
					МенеджерСпособыРасчетовСФизическимиЛицами = ОбщегоНазначения.ОбщийМодуль("Перечисления.СпособыРасчетовСФизическимиЛицами");
					СтрокаНачисленныйНДФЛ.СпособРасчетов = МенеджерСпособыРасчетовСФизическимиЛицами.Получить(
						СпособыРасчетовСФизическимиЛицами.Индекс(СпособРасчетовМД));
				КонецЕсли;
			КонецЕсли;

			ВидОперацииМД = ВидыОперацийПоЗарплатеЗначения.Найти(СтрокаНачисленныйНДФЛ.ВидОперации);
			Если Не ВидОперацииМД = Неопределено Тогда
				СтрокаНачисленныйНДФЛ.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Получить(ВидыОперацийПоЗарплатеЗначения.Индекс(ВидОперацииМД));
			КонецЕсли;
			
			МассивНачисленныйНДФЛ.Добавить(СтрокаНачисленныйНДФЛ);
		КонецЦикла;
		
		ПолученныеДанные.ДополнительныеСвойства.Вставить("НачисленныйНДФЛ", МассивНачисленныйНДФЛ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПолученныеДанные.Сводно Тогда
		ЗаполнитьДопПоляТаблицыДетальныхЗаписейПоФизЛицам(ПолученныеДанные);
		ОбновитьСводнуюТаблицуПоДетальнымЗаписям(ПолученныеДанные);
		ОбновитьСводнуюТаблицуНачисленныйНДФЛПоДетальнымЗаписям(ПолученныеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНачислениеЗУП(Данные)
	
	РезультатСсылка = Неопределено;
	UID_Пустой = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Если Данные.УИД = UID_Пустой Тогда
		Возврат РезультатСсылка;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////
	СсылкаНайдена = Ложь;
	РезультатСсылка = Справочники.упоНачисленияЗУП.ПолучитьСсылку(Данные.УИД);
	
	Если НЕ РезультатСсылка.ПолучитьОбъект() = Неопределено Тогда
		СсылкаНайдена = Истина;
	КонецЕсли;
	
	///////////// //////////////////////////////////////////////////
	Если НЕ СсылкаНайдена Тогда // НЕ ЗначениеЗаполнено(РезультатСсылка) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
				|    упоНачисленияЗУП.Ссылка КАК Ссылка
				|ИЗ
				|    Справочник.упоНачисленияЗУП КАК упоНачисленияЗУП
				|ГДЕ
				|    упоНачисленияЗУП.Код = &Код
				|    И упоНачисленияЗУП.Наименование = &Наименование");
		
		Запрос.УстановитьПараметр("Код", Данные.Код);
		Запрос.УстановитьПараметр("Наименование", Данные.Наименование);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			РезультатСсылка = Выборка.Ссылка;
			СсылкаНайдена = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////
	Если НЕ СсылкаНайдена Тогда // Если НЕ ЗначениеЗаполнено(РезультатСсылка) Тогда
		//Попытка
		НовыйОбъект = Справочники.упоНачисленияЗУП.СоздатьЭлемент();
		НовыйОбъект.УстановитьСсылкуНового(РезультатСсылка);
		
		НовыйОбъект.Код = Данные.Код;
		НовыйОбъект.Наименование = Данные.Наименование;
		
		НовыйОбъект.Записать();
		РезультатСсылка = НовыйОбъект.Ссылка;
		СсылкаНайдена = Истина;
		//Исключение
		//    Инфо = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		//КонецПопытки;
	КонецЕсли;
	
	Если НЕ СсылкаНайдена Тогда
		РезультатСсылка = Справочники.упоНачисленияЗУП.ПустаяСсылка();
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////
	Возврат РезультатСсылка;
	
КонецФункции // ПолучитьНачислениеЗУП()

Процедура ЗаполнитьДопПоляТаблицыДетальныхЗаписейПоФизЛицам(Объект)
	
	Для Каждого Строка Из Объект.НачисленнаяЗарплатаИВзносыПоФизлицам Цикл
		Строка["упоКорСпособОтраженияЗарплатыВБухучете"] = Строка["СпособОтраженияЗарплатыВБухучете"];
		Строка["упоКорПодразделениеУчетаЗатрат"] = Строка["ПодразделениеПредприятия"];
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСводнуюТаблицуПоДетальнымЗаписям(Объект)
	
	// Метод взят из формы "ОтражениеЗарплатыВФинансовомУчете.ФормаДокумента"
	// при обновлении релизов раздела зарплаты, желательно проверять состав полей запроса и реальной таблицы документа.
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ДетальныеЗаписи.ПодразделениеПредприятия,
			|	ДетальныеЗаписи.ВидОперации,
			|	ДетальныеЗаписи.СпособРасчетов,
			|	ДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете,
			|	ДетальныеЗаписи.ОблагаетсяЕНВД,
			|	ДетальныеЗаписи.Сумма,
			|	ДетальныеЗаписи.ПФРСтраховая,
			|	ДетальныеЗаписи.ПФРНакопительная,
			|	ДетальныеЗаписи.ПФРПоСуммарномуТарифу,
			|	ДетальныеЗаписи.ПФРДоПредельнойВеличины,
			|	ДетальныеЗаписи.ПФРСПревышения,
			|	ДетальныеЗаписи.ПФРНаДоплатуЛетчикам,
			|	ДетальныеЗаписи.ПФРНаДоплатуШахтерам,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
			|	ДетальныеЗаписи.ФСС,
			|	ДетальныеЗаписи.ФФОМС,
			|	ДетальныеЗаписи.ТФОМС,
			|	ДетальныеЗаписи.ФССНесчастныеСлучаи,
			|	ДетальныеЗаписи.ВзносыПоЕдиномуТарифу,
			|	ДетальныеЗаписи.ВзносыВсего
			|ПОМЕСТИТЬ ВТДетальныеЗаписи
			|ИЗ
			|	&ДетальныеЗаписи КАК ДетальныеЗаписи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия КАК ПодразделениеПредприятия,
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия.Наименование КАК НаименованиеПодразделения,
			|	ВТДетальныеЗаписи.ВидОперации КАК ВидОперации,
			|	ВТДетальныеЗаписи.СпособРасчетов КАК СпособРасчетов,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете.Наименование КАК НаименованиеСпособа,
			|	ВТДетальныеЗаписи.ОблагаетсяЕНВД,
			|	СУММА(ВТДетальныеЗаписи.Сумма) КАК Сумма,
			|	СУММА(ВТДетальныеЗаписи.ПФРСтраховая) КАК ПФРСтраховая,
			|	СУММА(ВТДетальныеЗаписи.ПФРНакопительная) КАК ПФРНакопительная,
			|	СУММА(ВТДетальныеЗаписи.ПФРПоСуммарномуТарифу) КАК ПФРПоСуммарномуТарифу,
			|	СУММА(ВТДетальныеЗаписи.ПФРДоПредельнойВеличины) КАК ПФРДоПредельнойВеличины,
			|	СУММА(ВТДетальныеЗаписи.ПФРСПревышения) КАК ПФРСПревышения,
			|	СУММА(ВТДетальныеЗаписи.ПФРНаДоплатуЛетчикам) КАК ПФРНаДоплатуЛетчикам,
			|	СУММА(ВТДетальныеЗаписи.ПФРНаДоплатуШахтерам) КАК ПФРНаДоплатуШахтерам,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
			|	СУММА(ВТДетальныеЗаписи.ФСС) КАК ФСС,
			|	СУММА(ВТДетальныеЗаписи.ФФОМС) КАК ФФОМС,
			|	СУММА(ВТДетальныеЗаписи.ТФОМС) КАК ТФОМС,
			|	СУММА(ВТДетальныеЗаписи.ФССНесчастныеСлучаи) КАК ФССНесчастныеСлучаи,
			|	СУММА(ВТДетальныеЗаписи.ВзносыПоЕдиномуТарифу) КАК ВзносыПоЕдиномуТарифу,
			|	СУММА(ВТДетальныеЗаписи.ВзносыВсего) КАК ВзносыВсего
			|ИЗ
			|	ВТДетальныеЗаписи КАК ВТДетальныеЗаписи
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия,
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия.Наименование,
			|	ВТДетальныеЗаписи.ВидОперации,
			|	ВТДетальныеЗаписи.СпособРасчетов,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете.Наименование,
			|	ВТДетальныеЗаписи.ОблагаетсяЕНВД
			|
			|УПОРЯДОЧИТЬ ПО
			|	НаименованиеПодразделения,
			|	ВидОперации,
			|	НаименованиеСпособа");
	
	Запрос.УстановитьПараметр("ДетальныеЗаписи", Объект.НачисленнаяЗарплатаИВзносыПоФизлицам.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Объект.НачисленнаяЗарплатаИВзносы.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

Процедура ОбновитьСводнуюТаблицуНачисленныйНДФЛПоДетальнымЗаписям(Объект)
	
	НачисленныйНДФЛДопСвойства = Неопределено;
	Если Объект.ДополнительныеСвойства.Свойство("НачисленныйНДФЛ") Тогда
		НачисленныйНДФЛДопСвойства = Объект.ДополнительныеСвойства["НачисленныйНДФЛ"];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачисленныйНДФЛДопСвойства) Тогда
		Возврат;			
	КонецЕсли;
	
	НачисленныйНДФЛ = Новый ТаблицаЗначений;

	НачисленныйНДФЛ.Колонки.Добавить("ФизическоеЛицо");
	НачисленныйНДФЛ.Колонки.Добавить("ПодразделениеПредприятия");
	НачисленныйНДФЛ.Колонки.Добавить("СпособРасчетов");
	НачисленныйНДФЛ.Колонки.Добавить("ВидОперации");
	НачисленныйНДФЛ.Колонки.Добавить("РегистрацияВНалоговомОргане");
	НачисленныйНДФЛ.Колонки.Добавить("Сумма");
	
	Для каждого СтрокаНачисленныйНДФЛДопСвойства Из НачисленныйНДФЛДопСвойства Цикл
		ФизЛицо = СтрокаНачисленныйНДФЛДопСвойства.ФизическоеЛицо;
		
		Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ФизЛицо) = Тип("Структура")
			И ФизЛицо.Свойство("Ссылка") Тогда
			УИДСтрокой = ФизЛицо["Ссылка"].Значение;
			ФизЛицоСсылка = Справочники["ФизическиеЛица"].ПолучитьСсылку(Новый УникальныйИдентификатор(УИДСтрокой));
		ИначеЕсли ТипЗнч(ФизЛицо) = упоФункцииОбщегоНазначенияКлиентСервер.упоТип("СправочникСсылка.ФизическиеЛица") Тогда
			ФизЛицоСсылка = ФизЛицо;
		Иначе
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаНачисленныйНДФЛ = НачисленныйНДФЛ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисленныйНДФЛ, СтрокаНачисленныйНДФЛДопСвойства, ,
			"ФизическоеЛицо, РегистрацияВНалоговомОргане");				
		НоваяСтрокаНачисленныйНДФЛ.ФизическоеЛицо = ФизЛицоСсылка;
		
		РегистрацияВНалоговомОргане = СтрокаНачисленныйНДФЛДопСвойства.РегистрацияВНалоговомОргане;
		
		Если Не ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(РегистрацияВНалоговомОргане) = Тип("Структура")
			И РегистрацияВНалоговомОргане.Свойство("Ссылка") Тогда
			УИДСтрокой = РегистрацияВНалоговомОргане["Ссылка"].Значение;
			РегистрацияВНалоговомОрганеСсылка = Справочники["РегистрацииВНалоговомОргане"].ПолучитьСсылку(
				Новый УникальныйИдентификатор(УИДСтрокой));
			ИначеЕсли ТипЗнч(РегистрацияВНалоговомОргане) = упоФункцииОбщегоНазначенияКлиентСервер.упоТип(
					"СправочникСсылка.РегистрацииВНалоговомОргане") Тогда
			РегистрацияВНалоговомОрганеСсылка = РегистрацияВНалоговомОрганеСсылка;
		Иначе
			Продолжить;
		КонецЕсли;
					
		НоваяСтрокаНачисленныйНДФЛ.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОрганеСсылка;

	КонецЦикла;
	
	Объект.НачисленныйНДФЛ.Загрузить(НачисленныйНДФЛ);
		
КонецПроцедуры

// См. МенеджерОбменаЧерезУниверсальныйФормат.ЗаписатьОшибкуВЖурналРегистрации.
Процедура ЗаписатьОшибкуВЖурналРегистрации(СсылкаНаОбъект, ОписаниеОшибки, КомпонентыОбмена, ОписаниеДействия = Неопределено, Уровень = Неопределено)
	
	// Процедура вызывается из исключений, при попытке записать или заблокировать объект в ИБ.
	
	Если ОписаниеДействия = Неопределено Тогда
		ОписаниеДействия = НСтр("ru = 'создать объект';
				|en = 'create an object'");
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru = 'Не удалось %1 %2.
			|%3';
			|en = 'Cannot %1 %2.
			|%3'");
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
			ОписаниеДействия, СсылкаНаОбъект.Метаданные().Синоним, ОписаниеОшибки);
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	ОбменДаннымиXDTOСервер.ЗаписьЖурналаРегистрацииОбменДанными(ТекстОшибки, КомпонентыОбмена, Уровень, СсылкаНаОбъект);
	
КонецПроцедуры

// См. МенеджерОбменаЧерезУниверсальныйФормат.ДобавитьПКС.
Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0,
		ПравилоКонвертацииСвойства = "")
	
	НоваяСтрока = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства;
	
КонецПроцедуры

// См. МенеджерОбменаЧерезУниверсальныйФормат.ДобавитьПКТЧ.
Функция ДобавитьПКТЧ(ПравилоКонвертации, ИмяТЧКонфигурации, ИмяТЧФормата)
	
	Если ПравилоКонвертации.СвойстваТабличныхЧастей.Колонки.Количество() = 0 Тогда
		ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	КонецЕсли;
	
	КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = ИмяТЧКонфигурации;
	КонвертацияТабличнойЧасти.ТЧФормата = ИмяТЧФормата;
	КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	Возврат КонвертацияТабличнойЧасти.Свойства;
	
КонецФункции

// См. МенеджерОбменаЧерезУниверсальныйФормат.ЭлементПоУмолчанию.
Функция ЭлементПоУмолчанию(КомпонентыОбмена, ВидЭлемента, ДопПараметры = Неопределено)
	ПараметрыКонвертации = КомпонентыОбмена.ПараметрыКонвертации;
	
	Если Не ЗначениеЗаполнено(ПараметрыКонвертации.ЭлементыПоУмолчанию) Тогда
		ПараметрыКонвертации.ЭлементыПоУмолчанию = Новый Структура;
	КонецЕсли;
	
	// {EPM}
	УчетНДСРФВызовСервераМодуль = ОбщегоНазначения.ОбщийМодуль("УчетНДСРФВызовСервера");
	// {/EPM}
	
	ЗначениеЭлемента = Неопределено;
	Если ДопПараметры = Неопределено И ПараметрыКонвертации.ЭлементыПоУмолчанию.Свойство(ВидЭлемента, ЗначениеЭлемента) Тогда
		Возврат ЗначениеЭлемента;
	КонецЕсли;
	
	Если ВидЭлемента = "ГруппаДоступаНоменклатуры" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Группа доступа по умолчанию';
				|en = 'Default access group'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	ГруппыДоступаНоменклатуры.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА ГруппыДоступаНоменклатуры.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.ГруппыДоступаНоменклатуры КАК ГруппыДоступаНоменклатуры
				|ГДЕ
				|	НЕ ГруппыДоступаНоменклатуры.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ГруппаДоступаОбъект = Справочники["ГруппыДоступаНоменклатуры"].СоздатьЭлемент();
			ГруппаДоступаОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			
			ГруппаДоступаОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ГруппаДоступаОбъект.Записать();
				ЗначениеЭлемента = ГруппаДоступаОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники["ГруппыДоступаНоменклатуры"].ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "ГруппаДоступаФизЛица" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Группа доступа по умолчанию';
				|en = 'Default access group'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	ГруппыДоступаФизЛиц.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА ГруппыДоступаФизЛиц.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.ГруппыДоступаФизическихЛиц КАК ГруппыДоступаФизЛиц
				|ГДЕ
				|	НЕ ГруппыДоступаФизЛиц.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ГруппаДоступаОбъект = Справочники["ГруппыДоступаФизическихЛиц"].СоздатьЭлемент();
			ГруппаДоступаОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			
			ГруппаДоступаОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ГруппаДоступаОбъект.Записать();
				ЗначениеЭлемента = ГруппаДоступаОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники["ГруппыДоступаФизическихЛиц"].ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "ГруппаДоступаПартнера" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Группа доступа по умолчанию';
				|en = 'Default access group'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	ГруппыДоступаПартнеров.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА ГруппыДоступаПартнеров.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.ГруппыДоступаПартнеров КАК ГруппыДоступаПартнеров
				|ГДЕ
				|	НЕ ГруппыДоступаПартнеров.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ГруппаДоступаОбъект = Справочники["ГруппыДоступаПартнеров"].СоздатьЭлемент();
			ГруппаДоступаОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			
			ГруппаДоступаОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ГруппаДоступаОбъект.Записать();
				ЗначениеЭлемента = ГруппаДоступаОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники["ГруппыДоступаПартнеров"].ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "НоменклатураУслуга" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Услуга';
				|en = 'Service'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	Номенклатура.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА Номенклатура.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	НЕ Номенклатура.ПометкаУдаления
				|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ЭлементПоУмолчаниюОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементПоУмолчаниюОбъект["Наименование"] = НаименованиеЭлементаПоУмолчанию;
			ЭлементПоУмолчаниюОбъект["НаименованиеПолное"] = НаименованиеЭлементаПоУмолчанию;
			
			ЭлементПоУмолчаниюОбъект["ТипНоменклатуры"] = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ТипыНоменклатуры.Услуга");
			// ++ Локализация
			//ЭлементПоУмолчаниюОбъект.СтавкаНДС         = УчетНДСРФВызовСервера.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
			// -- Локализация
			// {EPM}
			ЭлементПоУмолчаниюОбъект["СтавкаНДС"] = УчетНДСРФВызовСервераМодуль.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
			// {/EPM}
			ЭлементПоУмолчаниюОбъект["ЕдиницаИзмерения"] = ЭлементПоУмолчанию(КомпонентыОбмена, "ЕдиницаИзмерения");
			ЭлементПоУмолчаниюОбъект["ЕдиницаДляОтчетов"] = ЭлементПоУмолчанию(КомпонентыОбмена, "ЕдиницаИзмерения");
			
			ЭлементПоУмолчаниюОбъект["КоэффициентЕдиницыДляОтчетов"] = 1;
			ЭлементПоУмолчаниюОбъект["ЕдиницаИзмеренияСрокаГодности"] = 
				упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Сутки");
			
			ЭлементПоУмолчаниюОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ЭлементПоУмолчаниюОбъект.Записать();
				ОтложеннаяОбработка_Номенклатура(ЭлементПоУмолчаниюОбъект, КомпонентыОбмена);
				ЭлементПоУмолчаниюОбъект.Записать();
				ЗначениеЭлемента = ЭлементПоУмолчаниюОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники.Номенклатура.ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "ЕдиницаИзмерения" Тогда
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
				|	1 КАК Приоритет
				|ИЗ
				|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
				|ГДЕ
				|	УпаковкиЕдиницыИзмерения.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
				|	И УпаковкиЕдиницыИзмерения.Код = ""796""
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	УпаковкиЕдиницыИзмерения.Ссылка,
				|	0
				|ИЗ
				|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
				|ГДЕ
				|	УпаковкиЕдиницыИзмерения.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
				|	И УпаковкиЕдиницыИзмерения.Наименование = ""шт""
				|
				|УПОРЯДОЧИТЬ ПО
				|	Приоритет УБЫВ");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗначениеЭлемента = Выборка.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "СтатьяРасходовСписаниеТоваров"
		Или ВидЭлемента = "СтатьяРасходовАвансовыйОтчет"
		Или ВидЭлемента = "СтатьяРасходовПоступлениеУслуг"
		Или ВидЭлемента = "СтатьяРасходовПоступлениеУслугДопРасходы"
		Или ВидЭлемента = "СтатьяРасходовТаможенныйСбор"
		Или ВидЭлемента = "СтатьяРасходовТаможенныйШтраф"
		Или ВидЭлемента = "СтатьяРасходовКредиты"
		Или ВидЭлемента = "СтатьяРасходовСписаниеЗадолженности" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		Если ВидЭлемента = "СтатьяРасходовСписаниеТоваров" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов по умолчанию';
					|en = 'Default expense item'");
		ИначеЕсли ВидЭлемента = "СтатьяРасходовАвансовыйОтчет" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов авансовый отчет по умолчанию';
					|en = 'Expense item default expense report'");
		ИначеЕсли ВидЭлемента = "СтатьяРасходовПоступлениеУслуг" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов поступление услуг по умолчанию';
					|en = 'Expense item default receipt of services'");
		ИначеЕсли ВидЭлемента = "СтатьяРасходовПоступлениеУслугДопРасходы" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов поступление услуг (доп.расходы) по умолчанию';
					|en = 'Expense item receipt of services (add. expenses) by default'");
		ИначеЕсли ВидЭлемента = "СтатьяРасходовТаможенныйСбор" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов таможенный сбор по умолчанию';
					|en = 'Expense item default customs fee'");
		ИначеЕсли ВидЭлемента = "СтатьяРасходовТаможенныйШтраф" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов таможенный штраф по умолчанию';
					|en = 'Expense item default customs penalty'");
		ИначеЕсли ВидЭлемента = "СтатьяРасходовКредиты" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов кредиты по умолчанию';
					|en = 'Expense item credits by default'");
		ИначеЕсли ВидЭлемента = "СтатьяРасходовСписаниеЗадолженности" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья расходов списание задолженности по умолчанию';
					|en = 'Expense item debt relief by default'");
		КонецЕсли;
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	СтатьиРасходов.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА СтатьиРасходов.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
				|ГДЕ
				|	НЕ СтатьиРасходов.ПометкаУдаления
				|	И ВЫБОР
				|			КОГДА &ДоговорыКредитовИДепозитов
				|				ТОГДА СтатьиРасходов.ДоговорыКредитовИДепозитов
				|			КОГДА &ДопРасходы ТОГДА
				|				СтатьиРасходов.ТипРасходов = ЗНАЧЕНИЕ(Перечисление.ТипыРасходов.ЗакупкаТоваров)
				|				И СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		ДоговорыКредитовИДепозитов = ВидЭлемента = "СтатьяРасходовКредиты";
		Запрос.УстановитьПараметр("ДоговорыКредитовИДепозитов", ДоговорыКредитовИДепозитов);
		Запрос.УстановитьПараметр("ДопРасходы", (ВидЭлемента = "СтатьяРасходовПоступлениеУслугДопРасходы"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			СтатьяРасходовОбъект = ПланыВидовХарактеристик.СтатьиРасходов.СоздатьЭлемент();
			СтатьяРасходовОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			Если ВидЭлемента = "СтатьяРасходовСписаниеТоваров"
				Или ВидЭлемента = "СтатьяРасходовПоступлениеУслугДопРасходы" Тогда
				СтатьяРасходовОбъект["ВариантРаспределенияРасходовРегл"] = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
						"Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров");
			Иначе
				СтатьяРасходовОбъект["ВариантРаспределенияРасходовРегл"] = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
						"Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности");
			КонецЕсли;
			Если ВидЭлемента = "СтатьяРасходовПоступлениеУслугДопРасходы" Тогда
				СтатьяРасходовОбъект["ТипРасходов"] = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
					"Перечисление.ТипыРасходов.ЗакупкаТоваров");
			КонецЕсли;
			
			Попытка
				СтатьяРасходовОбъект.Записать();
				ЗначениеЭлемента = СтатьяРасходовОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = ПланыВидовХарактеристик.СтатьиРасходов.ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "СтатьяДоходовКредитыДепозиты"
		ИЛИ ВидЭлемента = "СтатьяДоходовСписаниеЗадолженности" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		Если ВидЭлемента = "СтатьяДоходовКредитыДепозиты" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья доходов кредиты и депозиты по умолчанию';
					|en = 'Income item credits and deposits by default'");
		ИначеЕсли ВидЭлемента = "СтатьяДоходовСписаниеЗадолженности" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Статья доходов списание задолженности по умолчанию';
					|en = 'Income item debt relief by default'");
		КонецЕсли;
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	СтатьиДоходов.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА СтатьиДоходов.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	ПланВидовХарактеристик.СтатьиДоходов КАК СтатьиДоходов
				|ГДЕ
				|	НЕ СтатьиДоходов.ПометкаУдаления
				|	И (&КредитыДепозиты = ЛОЖЬ ИЛИ СтатьиДоходов.ДоговорыКредитовИДепозитов)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		Запрос.УстановитьПараметр("КредитыДепозиты", (ВидЭлемента = "СтатьяДоходовКредитыДепозиты"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			СтатьяДоходовОбъект = ПланыВидовХарактеристик.СтатьиДоходов.СоздатьЭлемент();
			СтатьяДоходовОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			Попытка
				СтатьяДоходовОбъект.Записать();
				ЗначениеЭлемента = СтатьяДоходовОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки
		КонецЕсли;
		
		//++ НЕ УТ
	ИначеЕсли ВидЭлемента = "СтатьяКалькуляцииМатериальныеЗатраты"
		ИЛИ ВидЭлемента = "СтатьяКалькуляцииВозвратныеОтходы"
		ИЛИ ВидЭлемента = "СтатьяКалькуляцииПрочее" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		Если ВидЭлемента = "СтатьяКалькуляцииМатериальныеЗатраты" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Материальные затраты (по умолчанию)';
					|en = 'Material costs (default)'");
			ТипЗатрат = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ТипыЗатрат.Материальные");
		ИначеЕсли ВидЭлемента = "СтатьяКалькуляцииВозвратныеОтходы" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Возвратные отходы (по умолчанию)';
					|en = 'Recyclable waste (default)'");
			ТипЗатрат = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ТипыЗатрат.ВозвратныеОтходы");
		ИначеЕсли ВидЭлемента = "СтатьяКалькуляцииПрочее" Тогда
			НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Прочие затраты (по умолчанию)';
					|en = 'Other costs (default)'");
			ТипЗатрат = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыЗатрат.Прочее");
		КонецЕсли;
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	СтатьиКалькуляции.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА СтатьиКалькуляции.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.СтатьиКалькуляции КАК СтатьиКалькуляции
				|ГДЕ
				|	СтатьиКалькуляции.ТипЗатрат = &ТипЗатрат
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		Запрос.УстановитьПараметр("ТипЗатрат", ТипЗатрат);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			СтатьяКалькуляцииОбъект = Справочники["СтатьиКалькуляции"].СоздатьЭлемент();
			СтатьяКалькуляцииОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			СтатьяКалькуляцииОбъект.ТипЗатрат = ТипЗатрат;
			Попытка
				СтатьяКалькуляцииОбъект.Записать();
				ЗначениеЭлемента = СтатьяКалькуляцииОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники["СтатьиКалькуляции"].ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки
		КонецЕсли;
		//-- НЕ УТ
		
	ИначеЕсли ВидЭлемента = "КладоваяЦеха" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеПодразделения = Лев(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДопПараметры.Подразделение, "Наименование"), 18);
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Кладовая цеха (по умолчанию): ""%1""';
				|en = 'Shop storeroom (default): ""%1""'");
		НаименованиеЭлементаПоУмолчанию = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НаименованиеЭлементаПоУмолчанию, НаименованиеПодразделения);
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	Склады.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА Склады.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.Склады КАК Склады
				|ГДЕ
				|	НЕ Склады.ПометкаУдаления
				|	И Склады.ЦеховаяКладовая
				|	И Склады.Подразделение = &Подразделение
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		Запрос.УстановитьПараметр("Подразделение", ДопПараметры.Подразделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			СкладОбъект = Справочники.Склады.СоздатьЭлемент();
			СкладОбъект["Наименование"] = НаименованиеЭлементаПоУмолчанию;
			СкладОбъект["ТипСклада"] = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ТипыСкладов.ОптовыйСклад");
			СкладОбъект["ИсточникИнформацииОЦенахДляПечати"] = 
				упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
					"Перечисление.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен");
			СкладОбъект["ЦеховаяКладовая"] = Истина;
			СкладОбъект["Подразделение"] = ДопПараметры.Подразделение;
			
			
			СкладОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				СкладОбъект.Записать();
				ЗначениеЭлемента = СкладОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники.Склады.ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
		
	ИначеЕсли ВидЭлемента = "Подразделение" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = '<Подразделение по умолчанию>';
				|en = '<Default business unit>'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	СтруктураПредприятия.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА СтруктураПредприятия.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
				|ГДЕ
				|	НЕ СтруктураПредприятия.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ПодразделениеОбъект = Справочники.СтруктураПредприятия.СоздатьЭлемент();
			ПодразделениеОбъект["Наименование"] = НаименованиеЭлементаПоУмолчанию;
			ПодразделениеОбъект["ВариантОбособленногоУчетаТоваров"] = 
				упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
					"Перечисление.ВариантыОбособленногоУчетаТоваров.НеВедется");
			
			ПодразделениеОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ПодразделениеОбъект.Записать();
				ЗначениеЭлемента = ПодразделениеОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники.СтруктураПредприятия.ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "ВидКартЛояльности" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = 'Вид карт лояльности (по умолчанию)';
				|en = 'Loyalty cards type (default)'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	ВидыКартЛояльности.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА ВидыКартЛояльности.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.ВидыКартЛояльности КАК ВидыКартЛояльности
				|ГДЕ
				|	НЕ ВидыКартЛояльности.ПометкаУдаления
				|	И ВидыКартЛояльности.БонуснаяПрограммаЛояльности = ЗНАЧЕНИЕ(Справочник.БонусныеПрограммыЛояльности.ПустаяСсылка)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ВидКартЛояльностиОбъект = Справочники["ВидыКартЛояльности"].СоздатьЭлемент();
			ВидКартЛояльностиОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			ВидКартЛояльностиОбъект.Персонализирована = Истина;
			ВидКартЛояльностиОбъект.Статус = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.СтатусыВидовКартЛояльности.Действует");
			ВидКартЛояльностиОбъект.ТипКарты = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ТипыКарт.Смешанная");
						
			ВидКартЛояльностиОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ВидКартЛояльностиОбъект.Записать();
				ЗначениеЭлемента = ВидКартЛояльностиОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники["ВидыКартЛояльности"].ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "ФизическоеЛицо" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = '<Физическое лицо по умолчанию>';
				|en = '<Individual by default>'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	ФизическиеЛица.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА ФизическиеЛица.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.ФизическиеЛица КАК ФизическиеЛица
				|ГДЕ
				|	НЕ ФизическиеЛица.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ФизЛицоОбъект = Справочники["ФизическиеЛица"].СоздатьЭлемент();
			ФизЛицоОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			
			ФизЛицоОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ФизЛицоОбъект.Записать();
				ЗначениеЭлемента = ФизЛицоОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники["ФизическиеЛица"].ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "ЭквайринговыйТерминал" Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаПоУмолчанию = НСтр("ru = '<эквайринговый терминал по умолчанию>';
				|en = '<default POS terminal>'");
		
		Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 2
				|	ЭквайринговыеТерминалы.Ссылка КАК Ссылка,
				|	ВЫБОР
				|		КОГДА ЭквайринговыеТерминалы.Наименование = &НаименованиеЭлементаПоУмолчанию
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
				|ИЗ
				|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
				|ГДЕ
				|	НЕ ЭквайринговыеТерминалы.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		Запрос.УстановитьПараметр("НаименованиеЭлементаПоУмолчанию", НаименованиеЭлементаПоУмолчанию);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1
				Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ЗначениеЭлемента = Выборка.Ссылка;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		Если НеобходимоСоздатьЭлемент Тогда
			ЭквайринговыйТерминалОбъект = Справочники["ЭквайринговыеТерминалы"].СоздатьЭлемент();
			ЭквайринговыйТерминалОбъект.Наименование = НаименованиеЭлементаПоУмолчанию;
			
			ЭквайринговыйТерминалОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ЭквайринговыйТерминалОбъект.Записать();
				ЗначениеЭлемента = ЭквайринговыйТерминалОбъект.Ссылка;
			Исключение
				ЗначениеЭлемента = Справочники["ЭквайринговыеТерминалы"].ПустаяСсылка();
				ЗаписатьОшибкуВЖурналРегистрации(ЗначениеЭлемента,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыКонвертации.ЭлементыПоУмолчанию.Вставить(ВидЭлемента, ЗначениеЭлемента);
	
	Возврат ЗначениеЭлемента;
	
КонецФункции

// См. МенеджерОбменаЧерезУниверсальныйФормат.ОтложеннаяОбработка_Номенклатура.
Процедура ОтложеннаяОбработка_Номенклатура(Объект, КомпонентыОбмена)
	
	// {EPM}
	ОбщегоНазначенияУТКлиентСерверМодуль = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияУТКлиентСервер");
	// {/EPM}
	
	Если Не ЗначениеЗаполнено(Объект.ГруппаДоступа) Тогда
		Объект.ГруппаДоступа = ЭлементПоУмолчанию(КомпонентыОбмена, "ГруппаДоступаНоменклатуры");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Качество) Тогда
		Объект.Качество = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
			"Перечисление.ГрадацииКачества.Новый");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВариантОформленияПродажи) Тогда
		Объект.ВариантОформленияПродажи = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
			"Перечисление.ВариантыОформленияПродажи.РеализацияТоваровУслуг");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИспользованиеХарактеристик) Тогда
		НоменклатураДляОтложеннойОбработки = КомпонентыОбмена.ПараметрыКонвертации.НоменклатураДляОтложеннойОбработки; // Массив
		НоменклатураДляОтложеннойОбработки.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СтранаПроисхождения) И НЕ Объект.ВестиУчетПоГТД Тогда
		Объект.ВестиУчетПоГТД = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КодТНВЭД) И ОбщегоНазначения.СсылкаСуществует(Объект.КодТНВЭД) Тогда
		ПрослеживаемыйТовар = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КодТНВЭД, "ПрослеживаемыйТовар");
		Если ПрослеживаемыйТовар И Не Объект.ВестиУчетПоГТД Тогда
			Объект.ВестиУчетПоГТД = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// При загрузке необходимо проверять наличие записи в РС,
	// иначе в документ попадает ставка по умолчанию (20%).
	МенеджерСтавкиНДСНоменклатуры = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.СтавкиНДСНоменклатуры");
	АктуальнаяСтавкаНДС = МенеджерСтавкиНДСНоменклатуры.АктуальнаяСтавкаНДСНоменклатурыПоОсновнойСтране(Объект.Ссылка);
	Если Объект.СтавкаНДС <> АктуальнаяСтавкаНДС Тогда
		
		Если АктуальнаяСтавкаНДС.Пустая() Тогда
			
			ДатаЗаписи = Дата(1980, 1, 1);
			
		Иначе
			
			ДатаЗаписи = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
		МенеджерСтавкиНДСНоменклатуры.УстановитьАктуальнуюСтавкуНДСНоменклатурыПоОсновнойСтране(
			Объект.Ссылка, Объект.СтавкаНДС, Ложь, ДатаЗаписи);
		
	КонецЕсли;
	
	#Область ВидНоменклатуры
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры)
		И ЗначениеЗаполнено(Объект.ТипНоменклатуры) Тогда
		// Вид номенклатуры подбирается по типу и по признаку алкогольной продукции.
		ВидНоменклатуры = Неопределено;
		
		ПараметрыПоиска = Новый Структура("ТипНоменклатуры, АлкогольнаяПродукция");
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, Объект);
		НайдСтроки = КомпонентыОбмена.ПараметрыКонвертации.ВидыНоменклатурыПоУмолчанию.НайтиСтроки(ПараметрыПоиска);
		НайдСтрока = ?(НайдСтроки.Количество() = 0, Неопределено, НайдСтроки[0]);
		
		Если НайдСтрока = Неопределено Тогда
			
			НеобходимоСоздатьЭлемент = Ложь;
			
			Если ПараметрыПоиска.ТипНоменклатуры = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ТипыНоменклатуры.Товар") Тогда
				НаименованиеЭлементаДляОбменаПоУмолчанию = НСтр("ru = 'Товар';
						|en = 'Goods'", Метаданные.ОсновнойЯзык.КодЯзыка); // строка записывается в ИБ
			ИначеЕсли ПараметрыПоиска.ТипНоменклатуры = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ТипыНоменклатуры.Услуга") Тогда
				НаименованиеЭлементаДляОбменаПоУмолчанию = НСтр("ru = 'Услуга';
						|en = 'Service'", Метаданные.ОсновнойЯзык.КодЯзыка); // строка записывается в ИБ
			КонецЕсли;
			
			Если ПараметрыПоиска.АлкогольнаяПродукция Тогда
				НаименованиеЭлементаДляОбменаПоУмолчанию = НаименованиеЭлементаДляОбменаПоУмолчанию + "; Алк";
			КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2
					|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры,
					|	ВЫБОР
					|		КОГДА ВидыНоменклатуры.Наименование = &НаименованиеЭлементаДляОбменаПоУмолчанию
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
					|ИЗ
					|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
					|ГДЕ
					|	НЕ ВидыНоменклатуры.ПометкаУдаления
					|	И ВидыНоменклатуры.ТипНоменклатуры = &ТипНоменклатуры
					|	И ВидыНоменклатуры.АлкогольнаяПродукция = &АлкогольнаяПродукция
					|
					|УПОРЯДОЧИТЬ ПО
					|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
			
			Запрос.УстановитьПараметр("ТипНоменклатуры", ПараметрыПоиска.ТипНоменклатуры);
			Запрос.УстановитьПараметр("АлкогольнаяПродукция", ПараметрыПоиска.АлкогольнаяПродукция);
			Запрос.УстановитьПараметр("НаименованиеЭлементаДляОбменаПоУмолчанию", НаименованиеЭлементаДляОбменаПоУмолчанию);
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Количество() = 1 Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
					ВидНоменклатуры = Выборка.ВидНоменклатуры;
				Иначе
					НеобходимоСоздатьЭлемент = Истина;
				КонецЕсли;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
			
			// Создание элемента для обмена с заданными параметрами
			Если НеобходимоСоздатьЭлемент Тогда
				
				ВидНоменклатурыОбъект = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
				
				ЗаполнитьЗначенияСвойств(ВидНоменклатурыОбъект, ПараметрыПоиска);
				
				ВидНоменклатурыОбъект.Наименование = НаименованиеЭлементаДляОбменаПоУмолчанию;
				ВидНоменклатурыОбъект.Описание = НСтр("ru = '#Создан автоматически при обмене на основе универсального формата данных';
						|en = '#Created automatically while exchanging based on the universal data format'", Метаданные.ОсновнойЯзык.КодЯзыка); // строка записывается в ИБ
				ВидНоменклатурыОбъект.ВариантОформленияПродажи = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
						"Перечисление.ВариантыОформленияПродажи.РеализацияТоваровУслуг");
				ВидНоменклатурыОбъект.ИспользованиеХарактеристик = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
						"Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать");
				ВидНоменклатурыОбъект.НастройкаИспользованияСерий = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
						"Перечисление.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара");
				ВидНоменклатурыОбъект.ТочностьУказанияСрокаГодностиСерии = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
						"Перечисление.ТочностиУказанияСрокаГодности.СТочностьюДоДней");
				ВидНоменклатурыОбъект.ШаблонНаименованияДляПечатиНоменклатуры = "[Наименование]";
				ВидНоменклатурыОбъект.ШаблонНаименованияДляПечатиНоменклатуры = "[Наименование]";
				ВидНоменклатурыОбъект.ИспользованиеХарактеристик = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
						"Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать");
				
				// Заполнение группы доступа
				Если Не ЗначениеЗаполнено(ВидНоменклатурыОбъект.ГруппаДоступа)
					И упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьГруппыДоступаНоменклатуры") Тогда
					ВидНоменклатурыОбъект.ГруппаДоступа = Объект.ГруппаДоступа;
				КонецЕсли;
				
				Попытка
					ВидНоменклатурыОбъект.Записать();
					ВидНоменклатуры = ВидНоменклатурыОбъект.Ссылка;
				Исключение
					ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
					ЗаписатьОшибкуВЖурналРегистрации(ВидНоменклатуры,
						ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
				КонецПопытки
			КонецЕсли;
			
			НоваяСтрока = КомпонентыОбмена.ПараметрыКонвертации.ВидыНоменклатурыПоУмолчанию.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыПоиска);
			НоваяСтрока.ВидНоменклатуры = ВидНоменклатуры;
			
		Иначе
			ВидНоменклатуры = НайдСтрока.ВидНоменклатуры;
		КонецЕсли;
		Объект.ВидНоменклатуры = ВидНоменклатуры;
	КонецЕсли;
	#КонецОбласти
	
	СписокСвойств = Новый Массив;
	СписокСвойств.Добавить("ОсобенностьУчета");
	СписокСвойств.Добавить("ВладелецСерий");
	СписокСвойств.Добавить("ВладелецХарактеристик");
	СписокСвойств.Добавить("ВладелецТоварныхКатегорий");
	// {EPM}
	//ОбщегоНазначенияУТКлиентСервер.ЗаполнитьЗначенияПустыхСвойств(Объект, Объект.ВидНоменклатуры, СписокСвойств);
	ОбщегоНазначенияУТКлиентСерверМодуль.ЗаполнитьЗначенияПустыхСвойств(Объект, Объект.ВидНоменклатуры, СписокСвойств);
	// {/EPM}
	
КонецПроцедуры

#КонецОбласти