#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Изменяет приоритет риска.
//
// Параметры:
//  РискСсылка	 - СправочникСсылка.упоРискиПроектов - риск.
//  Смещение	 - Число - число, на которое менятеся приоритет.
//
// Возвращаемое значение:
//	Булево - результат выполнения функции.
//
Функция УдалитьИзменитьПриоритет(РискСсылка, Смещение) Экспорт
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(РискСсылка) Тогда			
		
		ТекущийПриоритет = Справочники.упоРискиПроектов.ПолучитьТекущиеПриоритетыРиска(РискСсылка);
		
		Документ = Документы.упоРегистрацияИзмененийРисковПроектов.СоздатьДокумент();
		Документ.Дата = ТекущаяДатаСеанса();
		СтрокаДанных = Документ.Приоритеты.Добавить();
		СтрокаДанных.Риск = РискСсылка;
		СтрокаДанных.Приоритет = ТекущийПриоритет.Приоритет;
		СтрокаДанных.Приоритет = СтрокаДанных.Приоритет + Смещение;
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);		
			Результат = Истина;
		Исключение
			Сообщение = НСтр("ru = 'Не удалось измененить приоритет риска проекта. Подробности см. в журнале регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			ЗаписьЖурналаРегистрации("Ошибка записи", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Документы.упоРегистрацияИзмененийРисковПроектов, РискСсылка, 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;		
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Изменяет приоритет риска проектов.
//
// Параметры:
//  РискСсылка	 - СправочникСсылка.упоРискиПроектов	- риск.
//  Смещение	 - Число	 							- смещение риска.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ИзменитьПриоритет(РискСсылка, Смещение) Экспорт
	
	ТекущийПриоритет = Справочники.упоРискиПроектов.ПолучитьТекущиеПриоритетыРиска(РискСсылка);
	
	ЗапросРисков = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоСвойстваРисковПроектовПланСрезПоследних.Риск,
	               |	упоСвойстваРисковПроектовПланСрезПоследних.ТипРиска,
	               |	упоСвойстваРисковПроектовПланСрезПоследних.Риск.Владелец КАК Проект
	               |ПОМЕСТИТЬ ВТ_СвойстваРиска
	               |ИЗ
	               |	РегистрСведений.упоСвойстваРисковПроектовПлан.СрезПоследних(, Риск = &Риск) КАК упоСвойстваРисковПроектовПланСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСвойстваРисковПроектовПланСрезПоследних.Риск
	               |ПОМЕСТИТЬ ВТ_ВсеРискиПоТипу
	               |ИЗ
	               |	РегистрСведений.упоСвойстваРисковПроектовПлан.СрезПоследних(, ) КАК упоСвойстваРисковПроектовПланСрезПоследних
	               |ГДЕ
	               |	(упоСвойстваРисковПроектовПланСрезПоследних.Риск.Владелец, упоСвойстваРисковПроектовПланСрезПоследних.ТипРиска) В
	               |			(ВЫБРАТЬ
	               |				ВТ_СвойстваРиска.Проект,
	               |				ВТ_СвойстваРиска.ТипРиска
	               |			ИЗ
	               |				ВТ_СвойстваРиска КАК ВТ_СвойстваРиска)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	упоПриоритетыРисковПроектов.Приоритет КАК Приоритет,
	               |	ВТ_ВсеРискиПоТипу.Риск
	               |ИЗ
	               |	ВТ_ВсеРискиПоТипу КАК ВТ_ВсеРискиПоТипу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПриоритетыРисковПроектов КАК упоПриоритетыРисковПроектов
	               |		ПО ВТ_ВсеРискиПоТипу.Риск = упоПриоритетыРисковПроектов.Риск
	               |ГДЕ
	               |	упоПриоритетыРисковПроектов.Приоритет < &ТекущийПриоритет
	               |	И упоПриоритетыРисковПроектов.Риск В
	               |			(ВЫБРАТЬ
	               |				ВТ_ВсеРискиПоТипу.Риск
	               |			ИЗ
	               |				ВТ_ВсеРискиПоТипу КАК ВТ_ВсеРискиПоТипу)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	
	Если Смещение = 1 Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "упоПриоритетыРисковПроектов.Приоритет < &ТекущийПриоритет", "упоПриоритетыРисковПроектов.Приоритет > &ТекущийПриоритет");
		ТекстЗапроса = ТекстЗапроса + " УБЫВ";		
		
	КонецЕсли;
	
	ЗапросРисков.Текст = ТекстЗапроса;
	
	ЗапросРисков.УстановитьПараметр("Риск", РискСсылка);
	ЗапросРисков.УстановитьПараметр("ТекущийПриоритет", ТекущийПриоритет.Приоритет);
	
	РезультатРисков = ЗапросРисков.Выполнить();
	
	Если РезультатРисков.Пустой() Тогда
		
		НовыйПриоритет = ТекущийПриоритет.Приоритет + Смещение;
		НижнийРиск = Неопределено;
		
	Иначе
		
		ВыборкаРисков = РезультатРисков.Выбрать();
		ВыборкаРисков.Следующий();
		
		НижнийРиск =  ВыборкаРисков.Риск;
		НовоеЗначениеНижнего = ВыборкаРисков.Приоритет - Смещение;
		НовыйПриоритет = ТекущийПриоритет.Приоритет + Смещение;
		
	КонецЕсли;
	
	РегистрПриоритетов = РегистрыСведений.упоПриоритетыРисковПроектов.СоздатьНаборЗаписей();
	РегистрПриоритетов.Отбор.Риск.Установить(РискСсылка);
	
	РегистрПриоритетов.Прочитать();
	РегистрПриоритетов.Очистить();
	
	НоваяСтрока = РегистрПриоритетов.Добавить();
	НоваяСтрока.Риск = РискСсылка;
	НоваяСтрока.Приоритет = НовыйПриоритет;
	
	РегистрПриоритетов.Записать(Истина);
	
	Если НижнийРиск <> Неопределено Тогда
		
		РегистрПриоритетов = РегистрыСведений.упоПриоритетыРисковПроектов.СоздатьНаборЗаписей();
		РегистрПриоритетов.Отбор.Риск.Установить(НижнийРиск);
		
		РегистрПриоритетов.Прочитать();
		РегистрПриоритетов.Очистить();
		
		НоваяСтрока = РегистрПриоритетов.Добавить();
		НоваяСтрока.Риск = НижнийРиск;
		НоваяСтрока.Приоритет = НовоеЗначениеНижнего;
		
		РегистрПриоритетов.Записать(Истина);
		
	КонецЕсли;
	
КонецФункции

#Область РаботаСРегистрами

// Получает имя регистра свойств.
//
// Возвращаемое значение:
//  Строка - имя регистра.
//
Функция ПолучитьИмяРегистраСвойств() Экспорт
	
	Возврат "упоСвойстваРисковПроектовПлан";
	
КонецФункции

// Получает имя регистра свойств факта.
//
// Возвращаемое значение:
//  Строка - имя регистра.
//
Функция ПолучитьИмяРегистраСвойствФакта() Экспорт
	
	Возврат "упоСвойстваРисковПроектовФакт";
	
КонецФункции

// Получает имя регистра статусов.
//
// Возвращаемое значение:
//  Строка - имя регистра.
//
Функция ПолучитьИмяРегистраСтатусов() Экспорт
	
	Возврат "упоСтатусыРисковПроектов";
	
КонецФункции

// Получает имя регистра приоритетов.
//
// Возвращаемое значение:
//  Строка - имя регистра.
//
Функция ПолучитьИмяРегистраПриоритетов() Экспорт
	
	Возврат "упоПриоритетыРисковПроектов";
	
КонецФункции

#КонецОбласти

#Область РаботаСТекущимиДанными

// Получает текущие свойства риска.
//
// Параметры:
//  Ссылка	 - СправочникСсылка.упоРискиПроектов - риск.
//
// Возвращаемое значение:
//  Структура - свойства риска.
//
Функция ПолучитьТекущиеСвойстваРиска(Ссылка) Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраСвойств();
	
	Результат = ПолучитьРесурсыСрезаПоследнихПоРегистру(ИмяРегистра, Ссылка);
	
	Возврат Результат;
				   
КонецФункции 

// Получает текущие приоритеты риска.
//
// Параметры:
//  Ссылка	 - СправочникСсылка.упоРискиПроектов - риск.
//
// Возвращаемое значение:
//  Структура - текущие приоритеты риска.
//
Функция ПолучитьТекущиеПриоритетыРиска(Ссылка) Экспорт
	
	СтруктураПриоритета = Новый Структура;
	СтруктураПриоритета.Вставить("Риск", Ссылка);
	СтруктураПриоритета.Вставить("Приоритет", 0);
	
	ЗапросРиска = Новый Запрос;
	ЗапросРиска.Текст ="ВЫБРАТЬ
	|	упоПриоритетыРисковПроектов.Риск,
	|	упоПриоритетыРисковПроектов.Приоритет
	|ИЗ
	|	РегистрСведений.упоПриоритетыРисковПроектов КАК упоПриоритетыРисковПроектов
	|ГДЕ
	|	упоПриоритетыРисковПроектов.Риск = &Риск"; 

	ЗапросРиска.УстановитьПараметр("Риск", Ссылка);
	Результат = ЗапросРиска.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтруктураПриоритета.Приоритет = Выборка.Приоритет;
		
	КонецЕсли;
	
	Возврат СтруктураПриоритета;
				   
КонецФункции 

// Получает текущие фактические свойства риска.
//
// Параметры:
//  Ссылка	 - СправочникСсылка.упоРискиПроектов - риск.
//
// Возвращаемое значение:
//  Структура - текущие фактические свойства риска.
//
Функция ПолучитьТекущиеСвойстваРискаФакта(Ссылка) Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраСвойствФакта();
	
	Результат = ПолучитьРесурсыСрезаПоследнихПоРегистру(ИмяРегистра, Ссылка);	
	
	Возврат Результат;
				   
КонецФункции 

// Получает текущий статус риска.
//
// Параметры:
//  Ссылка	 - СправочникСсылка.упоРискиПроектов - риск.
//
// Возвращаемое значение:
//  Структура - данные о текущем статусе риска.
//
Функция ПолучитьТекущийСтатусРиска(Ссылка) Экспорт
		
	ИмяРегистра = ПолучитьИмяРегистраСтатусов();
	
	Результат = ПолучитьРесурсыСрезаПоследнихПоРегистру(ИмяРегистра, Ссылка);	
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#Область ПолучениеПустыхСтруктур

// Получает структуру свойств с пустыми значениями для дальнейшего заполнения.
//
// Возвращаемое значение:
//  Структура - структура свойств.
//
Функция ПолучитьПустуюСтруктуруСвойств() Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраСвойств();

	СтруктураРеквизитов = ПолучитьСтруктуруРесурсовРегистра(ИмяРегистра);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Получить структуру свойств факта с пустыми значениями для дальнейшего заполнения.
//
// Возвращаемое значение:
//  Структура - структура свойств факта.
//
Функция ПолучитьПустуюСтруктуруСвойствФакта() Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраСвойствФакта();

	СтруктураРеквизитов = ПолучитьСтруктуруРесурсовРегистра(ИмяРегистра);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Получить структуру статусов с пустыми значениями для дальнейшего заполнения.
//
// Возвращаемое значение:
//  Структура - структура статусов.
//
Функция ПолучитьПустуюСтруктуруСтатусов() Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраСтатусов();

	СтруктураРеквизитов = ПолучитьСтруктуруРесурсовРегистра(ИмяРегистра);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Получает структуру приоритетов с пустыми значениями для дальнейшего заполнения.
//
// Возвращаемое значение:
//  Структура - структура приоритетов.
//
Функция ПолучитьПустуюСтруктуруПриоритетов() Экспорт
	
	ИмяРегистра = ПолучитьИмяРегистраПриоритетов();

	СтруктураРеквизитов = ПолучитьСтруктуруРесурсовРегистра(ИмяРегистра);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоРискиПроектов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьРесурсыСрезаПоследнихПоРегистру(ИмяРегистра, Ссылка)
	
	СтруктураРеквизитов = ПолучитьСтруктуруРесурсовРегистра(ИмяРегистра);
		
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		СтрокаПолейДляЗапроса = "";
		Для Каждого КлючЗначенеи Из СтруктураРеквизитов Цикл			
			СтрокаПолейДляЗапроса = СтрокаПолейДляЗапроса + ?(ЗначениеЗаполнено(СтрокаПолейДляЗапроса), ", ", "") 
				+ "ТаблицаДанных." + КлючЗначенеи.Ключ;
		КонецЦикла;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	#Поля#
			|ИЗ
			|	РегистрСведений." + ИмяРегистра + ".СрезПоследних(, Риск = &Ссылка) КАК ТаблицаДанных";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Поля#", СтрокаПолейДляЗапроса);				   
		
		Запрос = Новый Запрос;				   
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции 

Функция ПолучитьСтруктуруРесурсовРегистра(ИмяРегистра)
	
	Реквизиты = Метаданные.РегистрыСведений[ИмяРегистра].Ресурсы;
	
	СтруктураРеквизитов = Новый Структура;
	
	Для Каждого Реквизит Из Реквизиты Цикл
		СтруктураРеквизитов.Вставить(Реквизит.Имя);
	КонецЦикла;

	Возврат СтруктураРеквизитов;
	
КонецФункции

#КонецОбласти

#КонецЕсли