
Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ДоступСКУД.ЗоныИТочкиДоступа КАК ИКТ_ДоступСКУДЗоныИТочкиДоступа
	|ГДЕ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.ЗонаДоступа.Ссылка = &Ссылка";
	ЗонаДоступа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка,"Зона"); 
	Запрос.УстановитьПараметр("Ссылка",ЗонаДоступа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьСпр = Выборка.Ссылка.ПолучитьОбъект();
		МассивСтрок = ЗаписьСпр.ЗоныИТочкиДоступа.НайтиСтроки(Новый Структура("ЗонаДоступа",ЗонаДоступа));
		Для Каждого Стр Из МассивСтрок Цикл
			Если Не ПодразделениеСотрудникаСвязанаСЗоной(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка,"Подразделение"),ЗонаДоступа) Тогда
				ЗаписьСпр.ЗоныИТочкиДоступа.Удалить(Стр);
			КонецЕсли;
		КонецЦикла;
		ЗаписьСпр.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПодразделениеСотрудникаСвязанаСЗоной(Подразделение,ЗонаДоступа)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ЗоныПодразделений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ЗоныПодразделений КАК ИКТ_ЗоныПодразделений
	|ГДЕ
	|	ИКТ_ЗоныПодразделений.Подразделение = &Подразделение
	|	И ИКТ_ЗоныПодразделений.Зона = &Зона";
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Зона",ЗонаДоступа);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь
	Иначе
		Возврат Истина
	КонецЕсли;
	
КонецФункции