
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
				
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка); 		
	
	Параметры.Свойство("Источник",Источник);
	Параметры.Свойство("УИстроки",УИстроки);
	
	КолРекв = дзРеквизиты.ПолучитьЭлементы();
	ДобавитьРеквизитыТаблицы(ЭтаФорма,Источник,КолРекв,Источник,Источник);
	
	Реквизиты = упоОповещенияВызовСервера.ПолучитьСписокВычисляемыхРеквизитов(Источник);
	Для Каждого Эл Из Реквизиты Цикл
		
		НовЭл = КолРекв.Добавить();
		НовЭл.ПолноеИмя = "Вычисляемый." + Эл.Имя;
		НовЭл.Представление = Эл.Представление;
		НовЭл.ПолноеПредставление = Эл.Представление;
		НовЭл.ИмяТаблицы = Эл.ИмяТаблицы;		
		
	КонецЦикла;
	
	Реквизиты = упоОповещенияВызовСервера.ПолучитьВозможныеДопРеквизитыИСвойства(Источник);
	Для Каждого Эл Из Реквизиты Цикл
		НовЭл = КолРекв.Добавить();
		Если Эл.ЭтоДополнительноеСведение Тогда
			НовЭл.ПолноеИмя = "ДополнительноеСведение." + Эл.УникальныйИдентификатор();
			НовЭл.Представление = "" + Эл + "("+ НСтр("ru = 'доп. св-во'") + ")";
			НовЭл.ПолноеПредставление = НСтр("ru = 'Дополнительное сведение'") + " " + Эл;
		Иначе
			НовЭл.ПолноеИмя = "ДополнительныйРеквизит." + Эл.УникальныйИдентификатор();
			НовЭл.Представление = "" + Эл + "("+ НСтр("ru = 'доп. реквизит'") + ")";
			НовЭл.ПолноеПредставление = НСтр("ru = 'Дополнительный реквизит'") + " " + Эл;
		КонецЕсли;
		НовЭл.ИмяТаблицы = Ложь;			
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
   
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура дзРеквизитыПередРазворачиванием(Элемент, Строка, Отказ)
	
	ТекДанные = дзРеквизиты.НайтиПоИдентификатору(Строка);
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КолРекв = ТекДанные.ПолучитьЭлементы();
	КолРекв.Очистить();
	
	ДобавитьРеквизитыТаблицы(ЭтаФорма,ТекДанные.ИмяТаблицы,КолРекв,ТекДанные.ПолноеИмя,ТекДанные.ПолноеПредставление);
		
КонецПроцедуры

&НаКлиенте
Процедура дзРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	текДанные = Элементы.дзРеквизиты.ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пар = Новый Структура("ПолноеИмя,Представление,ПолноеПредставление,ИмяТаблицы,УИстроки,Источник",текДанные.ПолноеИмя,текДанные.Представление,текДанные.ПолноеПредставление,текДанные.ИмяТаблицы,УИстроки,Источник);
	
	ОповеститьОВыборе(Пар);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьРеквизитыТаблицы(Форма,ИмяТаблицы,КолРекв,ИмяРодителя,ПредставлениеРодителя)
	
	Реквизиты = упоОповещенияВызовСервера.ПолучитьСписокРеквизитовДляОповещений(ИмяТаблицы);
	Для Каждого Рекв Из Реквизиты Цикл
		
		//Если Рекв.Имя = "Ссылка" Тогда
		//	Продолжить;
		//КонецЕсли;
		
		НовЭл = КолРекв.Добавить();
		НовЭл.Представление = Рекв.Представление;
		НовЭл.ПолноеИмя = ИмяРодителя + "." + Рекв.Имя;
		НовЭл.ПолноеПредставление = ПредставлениеРодителя + "." + Рекв.Представление;
		НовЭл.ИмяТаблицы = Рекв.ИмяТаблицы;
		Если Не ПустаяСтрока(НовЭл.ИмяТаблицы) Тогда
			КолПодчРекв = НовЭл.ПолучитьЭлементы();
			НовПодчЭл = КолПодчРекв.Добавить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
