////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с оповещениями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НачальноеЗаполнение

// Заполняет предопределенные данные оповещений.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ЗаполнитьПредопределенныеДанныеОповещений(Параметры = Неопределено) Экспорт
	
	// Транспорт ЭП.
	
	Email = Справочники.упоТранспортОповещений.Email.ПолучитьОбъект();		
	Email.ДоступнаТемаСообщения = Истина;	
	Email.ДоступенТекстСообщенияВHTML = Истина;
	Email.ДоступнаНастройкаДляВидаСобытия = Ложь;	
	Email.ИмяМодуляОтправкиСообщений = "упоОтправкаСообщенийПоEmail";
	ПараметрыEmail = Email.Параметры.Получить();
	Если ТипЗнч(ПараметрыEmail) <> Тип("Структура") ИЛИ ПараметрыEmail.Количество() = 0 Тогда
		НастройкиТранспорта = упоОтправкаСообщенийПоEmail.ПолучитьНастройкиТранспорта().ПараметрыТранспорта;
		Email.Параметры =  Новый ХранилищеЗначения(НастройкиТранспорта);
	КонецЕсли;
	Email.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	Email.Записать();
	
	// Транспорт СМС.
	
	SMS = Справочники.упоТранспортОповещений.SMS.ПолучитьОбъект();		
	SMS.ДоступнаТемаСообщения = Ложь;	
	SMS.ДоступенТекстСообщенияВHTML = Ложь;
	SMS.ДоступнаНастройкаДляВидаСобытия = Ложь;
	SMS.ИмяМодуляОтправкиСообщений = "упоОтправкаСообщенийПоSMS";
	ПараметрыSMS = SMS.Параметры.Получить();
	Если ТипЗнч(ПараметрыSMS) <> Тип("Структура") ИЛИ ПараметрыSMS.Количество() = 0 Тогда
		НастройкиТранспорта = упоОтправкаСообщенийПоSMS.ПолучитьНастройкиТранспорта().ПараметрыТранспорта;
		SMS.Параметры =  Новый ХранилищеЗначения(НастройкиТранспорта);
	КонецЕсли;
	SMS.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	SMS.Записать();
	
	// Транспорт Задания.
	
	Задания = Справочники.упоТранспортОповещений.Задания.ПолучитьОбъект();		
	Задания.ДоступнаТемаСообщения = Истина;	
	Задания.ДоступенТекстСообщенияВHTML = Ложь;
	Задания.ДоступнаНастройкаДляВидаСобытия = Истина;
	Задания.ИмяМодуляОтправкиСообщений = "упоОтправкаСообщенийЧерезЗадания";
	ПараметрыЗадания = Задания.Параметры.Получить();
	Если ТипЗнч(ПараметрыЗадания) <> Тип("Структура") ИЛИ ПараметрыЗадания.Количество() = 0 Тогда
		НастройкиТранспорта = упоОтправкаСообщенийЧерезЗадания.ПолучитьНастройкиТранспорта().ПараметрыТранспорта;
		Задания.Параметры =  Новый ХранилищеЗначения(НастройкиТранспорта);
	КонецЕсли;
	Задания.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	Задания.Записать();
	
	// Вид получателя - Пользователи.
	
	обПользователи = Справочники.упоВидыПолучателейОповещений.Пользователи.ПолучитьОбъект();	
	обПользователи.ТаблицаПолучателя = "Справочник.Пользователи";
	обПользователи.АдресаОтправки.Очистить();
	
	// Транспорт для пользователей - СМС.
	
	ТранспортSMS = обПользователи.АдресаОтправки.Добавить();	
	ТранспортSMS.Транспорт = Справочники.упоТранспортОповещений.SMS;
	ТранспортSMS.ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВКонтИнформацииПолучателя;
	ТранспортSMS.ПолеАдреса = "Справочник.Пользователи.Контактная информация.НомерТелефона";
	
	ПолеАдресаСтрукт = Новый Структура;
	ПолеАдресаСтрукт.Вставить("ПолеАдреса", "НомерТелефона");
	ПолеАдресаСтрукт.Вставить("ИмяТаблицы", "Справочник.Пользователи.КонтактнаяИнформация");
	ПолеАдресаСтрукт.Вставить("ПолеУсловия", "Вид");
	ПолеАдресаСтрукт.Вставить("ЗначениеУсловия", Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
	ПолеАдресаСтрукт.Вставить("ПолеСвязи", "Ссылка");
	ПолеАдресаСтрукт.Вставить("ОписаниеХраненияАдреса", НСтр("ru = 'Номер телефона пользователя'"));
	
	ТранспортSMS.ПолеАдресаХЗ = Новый ХранилищеЗначения(ПолеАдресаСтрукт);
	ТранспортSMS.ОписаниеХраненияАдреса = ПолеАдресаСтрукт.ОписаниеХраненияАдреса;	
	
	// Транспорт для пользователей - ЭП.
	
	ТранспортEMAIL = обПользователи.АдресаОтправки.Добавить();	
	ТранспортEMAIL.Транспорт = Справочники.упоТранспортОповещений.Email;
	ТранспортEMAIL.ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВКонтИнформацииПолучателя;
	ТранспортEMAIL.ПолеАдреса = "Справочник.Пользователи.Контактная информация.Адрес ЭП";
	
	ПолеАдресаСтрукт = Новый Структура;
	ПолеАдресаСтрукт.Вставить("ПолеАдреса", "АдресЭП");
	ПолеАдресаСтрукт.Вставить("ИмяТаблицы", "Справочник.Пользователи.КонтактнаяИнформация");
	ПолеАдресаСтрукт.Вставить("ПолеУсловия", "Вид");
	ПолеАдресаСтрукт.Вставить("ЗначениеУсловия", Справочники.ВидыКонтактнойИнформации.EmailПользователя);	
	ПолеАдресаСтрукт.Вставить("ПолеСвязи", "Ссылка");
	ПолеАдресаСтрукт.Вставить("ОписаниеХраненияАдреса", НСтр("ru = 'Электронная почта пользователя'"));
	
	ТранспортEMAIL.ПолеАдресаХЗ = Новый ХранилищеЗначения(ПолеАдресаСтрукт);
	ТранспортEMAIL.ОписаниеХраненияАдреса = ПолеАдресаСтрукт.ОписаниеХраненияАдреса;	
	
	// Транспорт для пользователей - Задания.
	
	ТранспортЗадания = обПользователи.АдресаОтправки.Добавить();	
	ТранспортЗадания.Транспорт = Справочники.упоТранспортОповещений.Задания;
	ТранспортЗадания.ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВПолучателе;
	ТранспортЗадания.ПолеАдреса = "упоОсновнойТрудовойРесурс";
	
	ТранспортЗадания.ОписаниеХраненияАдреса = НСтр("ru = 'Основной трудовой ресурс пользователя'");	
	
	// Транспорт для пользователей - Telegram.
	
	ТранспортTg = обПользователи.АдресаОтправки.Добавить();
	ТранспортTg.Транспорт = Справочники.упоТранспортОповещений.Telegram;
	ТранспортTg.ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВРегистреСоответствияИД;
	ТранспортTg.ПолеАдреса = "РегистрСведений.упоСоответствиеПользователейTelegram.ИД_ПользователяTelegram";
	
	ТранспортTg.ОписаниеХраненияАдреса = НСтр("ru = 'Идентификатор пользователя в Telegram'");
	
	//
	
	обПользователи.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	обПользователи.Записать();
	
	// Константа "Срок хранения оповещений".
	
	Если Константы.упоСрокХраненияОповещений.Получить() = Неопределено Тогда
		Константы.упоСрокХраненияОповещений.Установить(0);
	КонецЕсли;
	
	// Ограничения - Изменения статусов проектов.
	
	Объект = Справочники.упоОграниченияДоступаКОповещениям.ИзмененияСтатусовПроектов.ПолучитьОбъект();
	Объект.ВидПолучателяОповещений = Справочники.упоВидыПолучателейОповещений.Пользователи;
	Объект.Условие = Перечисления.упоУсловияОграниченияДоступаКОповещениям.ТолькоУказанные;
	Объект.Состав.Очистить();
	Объект.Состав.Добавить().Элемент = УправлениеДоступом.ГруппаДоступаАдминистраторы();
	Объект.Состав.Добавить().Элемент = Справочники.ГруппыДоступа.упоАдминистраторыПроектногоОфиса;
	Объект.Состав.Добавить().Элемент = Справочники.ГруппыДоступа.упоРуководителиПроектногоОфиса;
	Объект.Состав.Добавить().Элемент = Справочники.ГруппыДоступа.упоОповещения_ИзмененияСтатусовПроектов;
	Объект.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	Объект.Записать();
	
	// Правило "Новое задание".
	
	НовоеЗадание = Справочники.упоВидыСобытий.НовоеЗадание.ПолучитьОбъект();
	НовоеЗадание.Используется = Истина;
	НовоеЗадание.СпособОтслеживанияСобытия = Перечисления.упоСпособыОтслеживанияСобытий.ПриЗаписиОбъекта;
	НовоеЗадание.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ЗаписьОбъекта;
	НовоеЗадание.Источник = "Справочник.упоЗадания";
	НовоеЗадание.КоличествоПопытокОтправки = 0;
	НовоеЗадание.Комментарий = "";
	НовоеЗадание.ЛогикаПримененияУсловийРегистрацииСобытия = Перечисления.упоЛогическиеОператоры.НЕ;
	НовоеЗадание.Наименование =	НСтр("ru = 'Новое задание'");
	НовоеЗадание.НеРегистрироватьПовторно =	Истина;
	
	НовоеЗадание.Получатели.Очистить();
	Получатель = НовоеЗадание.Получатели.Добавить();
	Получатель.ВидПолучателя = Справочники.упоВидыПолучателейОповещений.Пользователи;
	Получатель.ДопУсловие = "МасПолучатели = Новый Массив;
                             |Если ЗначениеЗаполнено(Источник.Исполнитель) Тогда
                             |	МасПолучатели = упоОповещенияВызовСервера.ПолучитьДиспетчеровТрудовогоРесурсаПодписанныхНаСобытие(Источник, Источник.Исполнитель); 
                             |	Если МасПолучатели.Количество() Тогда
                             |		Результат = Истина;
                             |	КонецЕсли;
                             |КонецЕсли;";
							 
	НовоеЗадание.Тэги.Очистить();
	Тэг = НовоеЗадание.Тэги.Добавить();
	Тэг.Представление = "СправочникЗадания.ОписаниеЗадания";
	Тэг.ТипТэга	= Перечисления.упоТипыТегов.РеквизитОбъекта;
	Тэг.Условие = "Справочник.упоЗадания.ОписаниеЗадания";
	Тэг = НовоеЗадание.Тэги.Добавить();
	Тэг.Представление = "СправочникЗадания.Автор";
	Тэг.ТипТэга	= Перечисления.упоТипыТегов.РеквизитОбъекта;
	Тэг.Условие = "Справочник.упоЗадания.АвторСотрудник";
	Тэг = НовоеЗадание.Тэги.Добавить();
	Тэг.Представление = "НавигационнаяСсылка.Ссылка";
	Тэг.ТипТэга	= Перечисления.упоТипыТегов.НавигационнаяСсылка;
	Тэг.Условие = "Справочник.упоЗадания.Ссылка";
	
	
	НовоеЗадание.НеРегистрироватьПовторно =	Истина;
	НовоеЗадание.Принудительное	= Ложь;
	НовоеЗадание.СрокХраненияОповещений =	0;
	НовоеЗадание.СрокХраненияСобытий =	0;
	
	ДобавитьТранспортВПредопределенныйВидСобытия(НовоеЗадание);
			
	НовоеЗадание.ШаблонТекста =	НСтр("ru = 'Получено новое задание
                                 |Автор: [СправочникЗадания.Автор]
                                 |[СправочникЗадания.ОписаниеЗадания]'")
								 + Символы.ПС + Символы.ПС + "[НавигационнаяСсылка.Ссылка]";
								 
	ШаблонHTML = Новый ФорматированныйДокумент;		
	ШаблонHTML.Добавить(НовоеЗадание.ШаблонТекста);
	ТекстHTML = "";
	Влож = Неопределено;
	ШаблонHTML.ПолучитьHTML(ТекстHTML, Влож);
	НовоеЗадание.ШаблонТекстаHTML = ТекстHTML;		
	НовоеЗадание.ШаблонТемы	= НСтр("ru = 'Новое задание'");
	НовоеЗадание.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	НовоеЗадание.Записать();
	
	// Назначение на ПЗ
	
	Оповещение = Справочники.упоВидыСобытий.НазначениеНаПЗ.ПолучитьОбъект();
	Оповещение.Используется = Истина;
	Оповещение.СпособОтслеживанияСобытия = Перечисления.упоСпособыОтслеживанияСобытий.ПриЗаписиОбъекта;
	Оповещение.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.Проведение;
	Оповещение.Источник = "Документ.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу";
	Оповещение.КоличествоПопытокОтправки = 0;
	Оповещение.Комментарий = "";
	Оповещение.ЛогикаПримененияУсловийРегистрацииСобытия = Перечисления.упоЛогическиеОператоры.НЕ;
	Оповещение.Наименование = НСтр("ru = 'Назначение на проектную задачу'");
	Оповещение.НеРегистрироватьПовторно =	Истина;
	Оповещение.КодОпределенияДопПараметра = "ИсточникДопПараметр = Источник.ВыделяемыеРесурсы.Выгрузить().ВыгрузитьКолонку(""Ресурс"");";
	
	Оповещение.Получатели.Очистить();
	Получатель = Оповещение.Получатели.Добавить();
	Получатель.ВидПолучателя = Справочники.упоВидыПолучателейОповещений.Пользователи;
	Получатель.ДопУсловие = "МасПолучатели = упоОповещенияВызовСервера.ПолучитьДиспетчеровТрудовогоРесурсаПодписанныхНаСобытие(Источник, ИсточникДопПараметр); Результат = Истина;";
							 
	Оповещение.Тэги.Очистить();
	Тэг = Оповещение.Тэги.Добавить();
	Тэг.Представление = "ПроектнаяЗадача";
	Тэг.ТипТэга	= Перечисления.упоТипыТегов.ВыполняемыйКод;
	Тэг.Условие = "Результат = упоПроектыИЗадачиВызовСервера.обПолучитьНазваниеПроектнойЗадачи(Источник.ПроектнаяЗадача);";
	Тэг = Оповещение.Тэги.Добавить();
	Тэг.Представление = "НавигационнаяСсылка";
	Тэг.ТипТэга	= Перечисления.упоТипыТегов.НавигационнаяСсылка;
	Тэг.Условие = "Ссылка";
	Тэг = Оповещение.Тэги.Добавить();
	Тэг.Представление = "ТрудовойРесурс";
	Тэг.ТипТэга	= Перечисления.упоТипыТегов.ВыполняемыйКод;
	Тэг.Условие = "Результат = """" + ИсточникДопПараметр;";	
	Тэг = Оповещение.Тэги.Добавить();
	Тэг.Представление = "Проект";
	Тэг.ТипТэга	= Перечисления.упоТипыТегов.ВыполняемыйКод;
	Тэг.Условие = "Результат = """" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.ПроектнаяЗадача, ""Проект"");";		
	
	Оповещение.НеРегистрироватьПовторно =	Истина;
	Оповещение.Принудительное	= Ложь;
	Оповещение.СрокХраненияОповещений =	0;
	Оповещение.СрокХраненияСобытий =	0;
	
	ДобавитьТранспортВПредопределенныйВидСобытия(Оповещение);
		
	Оповещение.ШаблонТекста =	НСтр("ru = 'Трудовой ресурс ""[ТрудовойРесурс]"" назначен на  	
                                 |проектную задачу ""[ПроектнаяЗадача]"" проекта ""[Проект]"".'")
								 + Символы.ПС + Символы.ПС + "[НавигационнаяСсылка]";
								 
	ШаблонHTML = Новый ФорматированныйДокумент;		
	ШаблонHTML.Добавить(Оповещение.ШаблонТекста);
	ТекстHTML = "";
	Влож = Неопределено;
	ШаблонHTML.ПолучитьHTML(ТекстHTML, Влож);
	Оповещение.ШаблонТекстаHTML = ТекстHTML;		
	Оповещение.ШаблонТемы = НСтр("ru = 'Назначение на проектную задачу'");
	Оповещение.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	Оповещение.Записать();	
	
	// Правила изменения статусов проектов.
	
	ТаблицаПравил = Новый ТаблицаЗначений;
	ТаблицаПравил.Колонки.Добавить("ВидСобытия");
	ТаблицаПравил.Колонки.Добавить("Источник");
	ТаблицаПравил.Колонки.Добавить("Наименование");
	ТаблицаПравил.Колонки.Добавить("Тэги");
	ТаблицаПравил.Колонки.Добавить("ШаблонТекста");
	ТаблицаПравил.Колонки.Добавить("ШаблонТемы");
	
	// Правило "Регистрация проекта".
	
	СтрокаПравил = ТаблицаПравил.Добавить();
	СтрокаПравил.ВидСобытия = "РегистрацияПроекта";
	СтрокаПравил.Источник = "Документ.упоРегистрацияПроекта";
	СтрокаПравил.Наименование = НСтр("ru = 'Регистрация проекта'");
	МассивТэгов = Новый Массив;
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "ДокументРегистрацияпроекта.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.РеквизитОбъекта);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "НавигационнаяСсылка.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.НавигационнаяСсылка);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);	
	СтрокаПравил.Тэги = МассивТэгов;
	СтрокаПравил.ШаблонТекста = НСтр("ru = 'Зарегистрирован проект ""[ДокументРегистрацияпроекта.Проект]""'") + 
																		Символы.ПС + "[НавигационнаяСсылка.Проект]";
	СтрокаПравил.ШаблонТемы = НСтр("ru = 'Зарегистрирован проект'");
	
	// Правило "Возобновление проекта".
	
	СтрокаПравил = ТаблицаПравил.Добавить();
	СтрокаПравил.ВидСобытия = "ВозобновлениеПроекта";
	СтрокаПравил.Источник = "Документ.упоВозобновлениеПроекта";
	СтрокаПравил.Наименование = НСтр("ru = 'Возобновление проекта'");
	МассивТэгов = Новый Массив;
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "Документ.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.РеквизитОбъекта);
	СтруктураТэга.Вставить("Условие", "Документ.упоВозобновлениеПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "НавигационнаяСсылка.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.НавигационнаяСсылка);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);	
	СтрокаПравил.Тэги = МассивТэгов;
	СтрокаПравил.ШаблонТекста = НСтр("ru = 'Возобновлен проект ""[ДокументРегистрацияпроекта.Проект]""'") + 
																		Символы.ПС + "[НавигационнаяСсылка.Проект]";
	СтрокаПравил.ШаблонТемы = НСтр("ru = 'Возобновлен проект'");	
	
	// Правило "Возобновление проекта".
	
	СтрокаПравил = ТаблицаПравил.Добавить();
	СтрокаПравил.ВидСобытия = "ВозобновлениеПроекта";
	СтрокаПравил.Источник = "Документ.упоВозобновлениеПроекта";
	СтрокаПравил.Наименование = НСтр("ru = 'Возобновление проекта'");
	МассивТэгов = Новый Массив;
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "Документ.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.РеквизитОбъекта);
	СтруктураТэга.Вставить("Условие", "Документ.упоВозобновлениеПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "НавигационнаяСсылка.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.НавигационнаяСсылка);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);	
	СтрокаПравил.Тэги = МассивТэгов;
	СтрокаПравил.ШаблонТекста = НСтр("ru = 'Возобновлен проект ""[Документ.Проект]""'") + 
																		Символы.ПС + "[НавигационнаяСсылка.Проект]";
	СтрокаПравил.ШаблонТемы = НСтр("ru = 'Возобновлен проект'");	
	
	// Правило "Завершение проекта".
	
	СтрокаПравил = ТаблицаПравил.Добавить();
	СтрокаПравил.ВидСобытия = "ЗавершениеПроекта";
	СтрокаПравил.Источник = "Документ.упоЗавершениеПроекта";
	СтрокаПравил.Наименование = НСтр("ru = 'Завершение проекта'");
	МассивТэгов = Новый Массив;
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "Документ.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.РеквизитОбъекта);
	СтруктураТэга.Вставить("Условие", "Документ.упоЗавершениеПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "НавигационнаяСсылка.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.НавигационнаяСсылка);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);	
	СтрокаПравил.Тэги = МассивТэгов;
	СтрокаПравил.ШаблонТекста = НСтр("ru = 'Завершен проект ""[Документ.Проект]""'") + 
																		Символы.ПС + "[НавигационнаяСсылка.Проект]";
	СтрокаПравил.ШаблонТемы = НСтр("ru = 'Завершен проект'");	
	
	// Правило "Остановка проекта".
	
	СтрокаПравил = ТаблицаПравил.Добавить();
	СтрокаПравил.ВидСобытия = "ОстановкаПроектныхРабот";
	СтрокаПравил.Источник = "Документ.упоОстановкаПроектныхРабот";
	СтрокаПравил.Наименование = НСтр("ru = 'Остановка проекта'");
	МассивТэгов = Новый Массив;
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "Документ.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.РеквизитОбъекта);
	СтруктураТэга.Вставить("Условие", "Документ.упоОстановкаПроектныхРабот.Проект");
	МассивТэгов.Добавить(СтруктураТэга);
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "НавигационнаяСсылка.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.НавигационнаяСсылка);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);	
	СтрокаПравил.Тэги = МассивТэгов;
	СтрокаПравил.ШаблонТекста = НСтр("ru = 'Остановлен проект ""[Документ.Проект]""'") + 
																		Символы.ПС + "[НавигационнаяСсылка.Проект]";
	СтрокаПравил.ШаблонТемы = НСтр("ru = 'Остановлен проект'");		
	
	// Правило "Старт проекта".
	
	СтрокаПравил = ТаблицаПравил.Добавить();
	СтрокаПравил.ВидСобытия = "СтартПроектныхРабот";
	СтрокаПравил.Источник = "Документ.упоСтартПроектныхРабот";
	СтрокаПравил.Наименование = НСтр("ru = 'Старт проекта'");
	МассивТэгов = Новый Массив;
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "Документ.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.РеквизитОбъекта);
	СтруктураТэга.Вставить("Условие", "Документ.упоСтартПроектныхРабот.Проект");
	МассивТэгов.Добавить(СтруктураТэга);
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "НавигационнаяСсылка.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.НавигационнаяСсылка);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);	
	СтрокаПравил.Тэги = МассивТэгов;
	СтрокаПравил.ШаблонТекста = НСтр("ru = 'Старт проекта ""[Документ.Проект]""'") + 
																		Символы.ПС + "[НавигационнаяСсылка.Проект]";
	СтрокаПравил.ШаблонТемы = НСтр("ru = 'Старт проекта'");		
	
	// Правило "Утверждение плана проекта".
	
	СтрокаПравил = ТаблицаПравил.Добавить();
	СтрокаПравил.ВидСобытия = "УтверждениеПланаПроекта";
	СтрокаПравил.Источник = "Документ.упоУтверждениеПланаПроекта";
	СтрокаПравил.Наименование = НСтр("ru = 'Утверждение плана проекта'");
	МассивТэгов = Новый Массив;
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "Документ.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.РеквизитОбъекта);
	СтруктураТэга.Вставить("Условие", "Документ.упоУтверждениеПланаПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);
	СтруктураТэга = Новый Структура;
	СтруктураТэга.Вставить("Представление", "НавигационнаяСсылка.Проект");
	СтруктураТэга.Вставить("ТипТэга", Перечисления.упоТипыТегов.НавигационнаяСсылка);
	СтруктураТэга.Вставить("Условие", "Документ.упоРегистрацияПроекта.Проект");
	МассивТэгов.Добавить(СтруктураТэга);	
	СтрокаПравил.Тэги = МассивТэгов;
	СтрокаПравил.ШаблонТекста = НСтр("ru = 'Утвержден план проекта ""[Документ.Проект]""'") + 
																		Символы.ПС + "[НавигационнаяСсылка.Проект]";
	СтрокаПравил.ШаблонТемы = НСтр("ru = 'Утвержден план проекта'");		
	
	//
	
	Для Каждого СтрокаПравил Из ТаблицаПравил Цикл
		
		СобытиеОбъект = Справочники.упоВидыСобытий[СтрокаПравил.ВидСобытия].ПолучитьОбъект();
		СобытиеОбъект.Используется = Истина;
		СобытиеОбъект.СпособОтслеживанияСобытия = Перечисления.упоСпособыОтслеживанияСобытий.ПриЗаписиОбъекта;
		СобытиеОбъект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.Проведение;
		СобытиеОбъект.Источник = СтрокаПравил.Источник;
		СобытиеОбъект.КоличествоПопытокОтправки = 0;
		СобытиеОбъект.Комментарий = "";
		СобытиеОбъект.ЛогикаПримененияУсловийРегистрацииСобытия = Перечисления.упоЛогическиеОператоры.НЕ;
		СобытиеОбъект.Наименование = СтрокаПравил.Наименование;
		СобытиеОбъект.НеРегистрироватьПовторно =	Истина;
		
		СобытиеОбъект.Получатели.Очистить();
		Получатель = СобытиеОбъект.Получатели.Добавить();
		Получатель.ВидПолучателя = Справочники.упоВидыПолучателейОповещений.Пользователи;
		Получатель.ОграничениеДоступа = Справочники.упоОграниченияДоступаКОповещениям.ИзмененияСтатусовПроектов;
		
		СобытиеОбъект.Тэги.Очистить();
		Для Каждого элТэг Из СтрокаПравил.Тэги Цикл
			ЗаполнитьЗначенияСвойств(СобытиеОбъект.Тэги.Добавить(), элТэг);
		КонецЦикла;
		
		СобытиеОбъект.НеРегистрироватьПовторно =	Истина;
		СобытиеОбъект.Принудительное	= Ложь;
		СобытиеОбъект.СрокХраненияОповещений =	0;
		СобытиеОбъект.СрокХраненияСобытий =	0;
			
		ДобавитьТранспортВПредопределенныйВидСобытия(СобытиеОбъект);
		
		СобытиеОбъект.ШаблонТекста = СтрокаПравил.ШаблонТекста;
		
		ШаблонHTML = Новый ФорматированныйДокумент;		
		ШаблонHTML.Добавить(СобытиеОбъект.ШаблонТекста);
		ТекстHTML = "";
		Влож = Неопределено;
		ШаблонHTML.ПолучитьHTML(ТекстHTML, Влож);
		СобытиеОбъект.ШаблонТекстаHTML = ТекстHTML;		
		СобытиеОбъект.ШаблонТемы = СтрокаПравил.ШаблонТемы;
		СобытиеОбъект.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
		СобытиеОбъект.Записать();	
		
	КонецЦикла;
	
КонецФункции 

#КонецОбласти

#Область ОбработчикиРегламентныхЗаданий

// Отработка регламентного задания.
//
// Параметры:
//  ВидСобытия	 - СправочникСсылка.упоВидыСобытий
//
Процедура ОбработкаДетекторовСобытий(ВидСобытия) Экспорт
	
	Если Не упоОповещенияПовтИсп.ИспользоватьОповещения() Тогда
		Возврат;
	КонецЕсли;	
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.упоОбработкаДетекторовСобытий);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытий.Ссылка КАК ВидСобытия,
	               |	упоВидыСобытий.ЛогикаПримененияУсловийРегистрацииСобытия КАК ЛогикаПримененияУсловий,
	               |	упоВидыСобытий.ДетекторСобытия,
	               |	упоВидыСобытий.КодОпределенияДопПараметра
	               |ИЗ
	               |	Справочник.упоВидыСобытий КАК упоВидыСобытий
	               |ГДЕ
	               |	упоВидыСобытий.Ссылка = &ВидСобытия
	               |	И упоВидыСобытий.Используется
	               |	И НЕ упоВидыСобытий.ПометкаУдаления
	               |	И упоВидыСобытий.СпособОтслеживанияСобытия = ЗНАЧЕНИЕ(Перечисление.упоСпособыОтслеживанияСобытий.ПоРасписанию)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(ВидСобытия);
	
	Пока Выборка.Следующий() Цикл
		
		КодОпределенияДопПараметра = Выборка.КодОпределенияДопПараметра;
		Результат = Ложь; 
		ПараметрыВозврата = Новый Структура;
		
		Источник = Неопределено;
		
		Попытка
	    	ВыполнитьКод(Выборка.ДетекторСобытия, Результат, ПараметрыВозврата, Источник,,, ПараметрыВыполненияКода);
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Обработка детекторов событий'"), УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.упоВидыСобытий, Выборка.ВидСобытия, СообщениеОбОшибке);
			Результат = Ложь;	
		КонецПопытки;
		
		Если Результат = Истина Тогда
			
			КоличествоСтандартных = 0;
			
			Если ПараметрыВозврата.Свойство("Источник") Тогда
				Источник = ПараметрыВозврата.Источник; 
				КоличествоСтандартных = КоличествоСтандартных + 1;
			КонецЕсли;
			
			Если Источник <> Неопределено Тогда
				Если ТипЗнч(Источник) = Тип("Массив") Тогда
					МассивИсточников = Источник;	
				Иначе
					МассивИсточников = Новый Массив;
					МассивИсточников.Добавить(Источник);
				КонецЕсли;
			Иначе
				МассивИсточников = Новый Массив;
				МассивИсточников.Добавить(Неопределено);
			КонецЕсли;
			
			Если ПараметрыВозврата.Свойство("Автор") Тогда
				Автор = ПараметрыВозврата.Автор;
				КоличествоСтандартных = КоличествоСтандартных + 1;
			Иначе
				Автор = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;				
				
			Если ПараметрыВозврата.Количество() > КоличествоСтандартных Тогда
				
				// Тут формируем КонтекстСобытия (XML).
				ИнформацияДляЗаписиXML = Новый ЗаписьXML;
				ИнформацияДляЗаписиXML.УстановитьСтроку();  
				
				НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);  
				НовыйСериализаторXDTO.ЗаписатьXML(ИнформацияДляЗаписиXML, ПараметрыВозврата, НазначениеТипаXML.Явное);  
				
				СтрокаXML = ИнформацияДляЗаписиXML.Закрыть(); 
				КонтекстСобытия = Новый ХранилищеЗначения(СтрокаXML);
				
			Иначе
				
				КонтекстСобытия = Неопределено;
				
			КонецЕсли;				
			
			Для Каждого ИсточникСсылка Из МассивИсточников Цикл			
				
				МассивДопПараметровИсточника = ПолучитьМассивДопПараметровИсточника(Выборка.ВидСобытия,КодОпределенияДопПараметра, 
																								ИсточникСсылка, ПараметрыВыполненияКода);
								
				Для Каждого ИсточникДопПараметр Из МассивДопПараметровИсточника Цикл
					
					ПолноеИмяОбъекта = Неопределено;							
					Регистрируем = Истина;	
					
					Если ЗначениеЗаполнено(ИсточникСсылка) Тогда
						ПолноеИмяОбъекта = ИсточникСсылка.Метаданные().ПолноеИмя();
						УсловияСобытия = Новый Массив;
						Для Каждого СтрТЧ Из Выборка.ВидСобытия.УсловияРегистрацииСобытия Цикл
							Если СтрТЧ.Используется Тогда
								УсловияСобытия.Добавить(Новый Структура("РеквизитОбъекта,ВидСравнения,ЗначениеУсловия,ПроверкаПоКоду,ВыполняемыйКод",
								СтрТЧ.РеквизитОбъекта,
								СтрТЧ.ВидСравнения,
								СтрТЧ.ЗначениеУсловия,
								СтрТЧ.ПроверкаПоКоду,
								СтрТЧ.ВыполняемыйКод));	
							КонецЕсли;
						КонецЦикла;
						
						Если Не ПроверитьУсловияРегистрацииСобытияДляОбъекта(ИсточникСсылка, ИсточникДопПараметр, Выборка.ВидСобытия, ПолноеИмяОбъекта, 
							Выборка.ЛогикаПримененияУсловий, УсловияСобытия,, 
							ПараметрыВыполненияКода) Тогда
							Регистрируем = Ложь;
						КонецЕсли;
						
					КонецЕсли;
					
					Если Регистрируем Тогда
						Справочники.упоПроизошедшиеСобытия.ЗарегистрироватьСобытие(Выборка.ВидСобытия, ИсточникСсылка, ИсточникДопПараметр, ПолноеИмяОбъекта, КонтекстСобытия, Автор);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

// Отработка регламентного задания.
//
Процедура упоОбработкаПроизошедшихСобытий() Экспорт
	
	Если Не упоОповещенияПовтИсп.ИспользоватьОповещения() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.упоОбработкаПроизошедшихСобытий);
	
	упоОбработкаПроизошедшихСобытийСПараметрами();
	
КонецПроцедуры

// Отработка регламентного задания.
//
Процедура упоОтправкаСообщенийИзОчереди() Экспорт
	
	Если НЕ упоОповещенияПовтИсп.ИспользоватьОповещения() Тогда
		Возврат;
	КонецЕсли;	
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.упоОтправкаСообщенийИзОчереди);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("СообщениеОбОшибках", "");
	
	КэшЗначений = Новый Структура;
	
	НедоступныеТранспортыОтправкиОповещений = НедоступныеТранспортыОтправкиОповещенийПроверкаИТС();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 200
	|	упоОчередьСобытийДляОповещений.ВидСобытия КАК ВидСобытия,
	|	упоОчередьСобытийДляОповещений.Источник КАК Источник,
	|	упоОчередьСобытийДляОповещений.ИсточникДопПараметр КАК ИсточникДопПараметр,
	|	упоОчередьСобытийДляОповещений.ВидПолучателя КАК ВидПолучателя,
	|	упоОчередьСобытийДляОповещений.Получатель КАК Получатель,
	|	упоОчередьСобытийДляОповещений.Транспорт КАК Транспорт,
	|	упоОчередьСобытийДляОповещений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	|	упоОчередьСобытийДляОповещений.ДатаОтправки КАК ДатаОтправки,
	|	упоОчередьСобытийДляОповещений.Текст КАК Текст,
	|	упоОчередьСобытийДляОповещений.ТекстHTML КАК ТекстHTML,
	|	упоОчередьСобытийДляОповещений.Тема КАК Тема,
	|	упоОчередьСобытийДляОповещений.ДатаВозникновения КАК ДатаВозникновения,
	|	упоОчередьСобытийДляОповещений.Автор КАК Автор
	|ИЗ
	|	РегистрСведений.упоОчередьСобытийДляОповещений КАК упоОчередьСобытийДляОповещений
	|ГДЕ
	|	упоОчередьСобытийДляОповещений.ДатаОтправки = &ПустаяДата
	|	И НЕ упоОчередьСобытийДляОповещений.Транспорт.Ссылка В (&НедоступныеТранспортыОтправкиОповещений)
	|	И ВЫБОР
	|			КОГДА упоОчередьСобытийДляОповещений.ДатаВозникновения = &ПустаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ упоОчередьСобытийДляОповещений.ДатаВозникновения <= &ТекущаяДата
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА упоОчередьСобытийДляОповещений.ДатаАктуальностиОтправки = &ПустаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ упоОчередьСобытийДляОповещений.ДатаАктуальностиОтправки >= &ТекущаяДата
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА упоОчередьСобытийДляОповещений.КоличествоПопытокОтправки > 0
	|				ТОГДА упоОчередьСобытийДляОповещений.КоличествоПопытокОтправки > упоОчередьСобытийДляОповещений.СчетчикПопытокОтправки
	|			КОГДА упоОчередьСобытийДляОповещений.КоличествоПопытокОтправки = 0
	|				ТОГДА упоОчередьСобытийДляОповещений.СчетчикПопытокОтправки <= 3
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("НедоступныеТранспортыОтправкиОповещений", НедоступныеТранспортыОтправкиОповещений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		УспешнаяОтправка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			ДопПараметры.Вставить("ШаблонТекста", Выборка.Текст);
			ДопПараметры.Вставить("ШаблонТекстаHTML", Выборка.ТекстHTML);
			ДопПараметры.Вставить("ШаблонТемы" ,Выборка.Тема);
			ДопПараметры.Вставить("Автор", Выборка.Автор);
			ДопПараметры.Вставить("ДатаВозникновения", Выборка.ДатаВозникновения);
			ДопПараметры.Вставить("ИдентификаторСобытия", Выборка.ИдентификаторСобытия);
			ДопПараметры.Вставить("ДатаОтправки", Неопределено);
			ДопПараметры.Вставить("СообщениеОбОшибке", "");
			
			ИдентификаторСообщения = ОтправитьСообщение(Выборка.ВидСобытия,
			Выборка.Источник,
			Выборка.ИсточникДопПараметр,
			Выборка.ВидПолучателя,
			Выборка.Получатель,
			Выборка.Транспорт,
			ДопПараметры,
			,
			КэшЗначений);														
			
			УспешнаяОтправка = ЗначениеЗаполнено(ИдентификаторСообщения);
			
			Если УспешнаяОтправка Тогда						
				МЗ = РегистрыСведений.упоОчередьСобытийДляОповещений.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ,Выборка);
				МЗ.Прочитать();
				МЗ.Удалить();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();			     
			
			ТекстОшибки = ДопПараметры.СообщениеОбОшибке;
			
		Исключение
			
			ОтменитьТранзакцию();
			
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Обработка очереди оповещений'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.РегистрыСведений.упоОчередьСобытийДляОповещений, Выборка.ВидСобытия, СообщениеОбОшибке);
			
			ТекстОшибки = СообщениеОбОшибке; 
			
		КонецПопытки;
		
		Если Не УспешнаяОтправка Тогда
			
			Попытка
				МЗ = РегистрыСведений.упоОчередьСобытийДляОповещений.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ, Выборка);
				МЗ.Прочитать();
				МЗ.СчетчикПопытокОтправки = МЗ.СчетчикПопытокОтправки + 1;
				МЗ.ТекстОшибки = ТекстОшибки;
				МЗ.Записать(Истина);
			Исключение 
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(НСтр("ru='Обработка очереди оповещений'"),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.упоОчередьСобытийДляОповещений,
				Выборка.ВидСобытия, СообщениеОбОшибке);
			КонецПопытки;	
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДопПараметры.СообщениеОбОшибках) Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru='Обработка очереди оповещений'"),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.упоОчередьСобытийДляОповещений,
			Выборка.ВидСобытия,
			ДопПараметры.СообщениеОбОшибках);	
		КонецЕсли;
		
	КонецЦикла;	
	
	ОчисткаОтправленныхСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписок

// Обработчик оповещения "Перед записью" преподобного справочника.
//
// Параметры:
//  Источник - Произвольный	 - справочник или подобное.
//  Отказ	 - Булево		 - признак отказа от записи.
//
Процедура упоОповещенияПередЗаписьюСправочникаИлиПодобного(Источник, Отказ) Экспорт
	
	Если НЕ ОбработкаСобытияДопустима(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	масВариантыИзменения = Новый Массив;
	
	ОпределитьВариантИзмененияПередЗаписью(Источник, масВариантыИзменения);
	
	ДобавитьВидыСобытийВДопСвойстваОбъекта(Источник, масВариантыИзменения);
	
КонецПроцедуры

// Обработчик оповещения "Перед записью" документа.
//
// Параметры:
//  Источник		 - ДокументСсылка	 	 	 - документ.
//  Отказ			 - Булево			 	 	 - признак отказа от записи.
//  РежимЗаписи		 - РежимЗаписиДокумента	 	 - режим записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - режим проведения документа.
//
Процедура упоОповещенияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ ОбработкаСобытияДопустима(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	масВариантыИзменения = Новый Массив;
		
	ОпределитьВариантИзмененияПередЗаписью(Источник, масВариантыИзменения, РежимЗаписи);
	
	ДобавитьВидыСобытийВДопСвойстваОбъекта(Источник, масВариантыИзменения);
	
КонецПроцедуры

// Обработчик оповещения "Перед записью" в регистр.
//
// Параметры:
//  Источник	 - Произвольный	 - источник записи.
//  Отказ		 - Булево		 - признак отказа от записи.
//  Замещение	 - Булево		 - признак замещения записи.
//
Процедура упоОповещенияПередЗаписьюВРегистр(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ ОбработкаСобытияДопустима(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоРегистр", Истина);
	
	масВариантыИзменения = Новый Массив;
	
	ОпределитьВариантИзмененияПередЗаписьюВРегистр(Источник, масВариантыИзменения);
	
	ДобавитьВидыСобытийВДопСвойстваОбъекта(Источник, масВариантыИзменения);
	
КонецПроцедуры

// Обработчик оповещения "При записи".
//
// Параметры:
//  Источник - Произвольный	 - источник события.
//  Отказ	 - Булево	 	 - признак отказа.
//
Процедура упоОповещенияПриЗаписи(Источник, Отказ) Экспорт
	
	Если НЕ ОбработкаСобытияДопустима(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьСобытияПриЗаписи(Источник);
		
КонецПроцедуры

// Обработчик оповещения "При записи" в регистр.
//
// Параметры:
//  Источник	 - Произвольный	 - источник события.
//  Отказ		 - Булево	 - признак отказа.
//  Замещение	 - Булево	 - признак замещения.
//
Процедура упоОповещенияПриЗаписиВРегистр(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ ОбработкаСобытияДопустима(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьСобытияПриЗаписи(Источник);
	
КонецПроцедуры

// Обработчик "Перед записью" типовых оповещений.
//
// Параметры:
//  ЭтотОбъект	 - Произвольный	 - объект
//  Отказ		 - Булево		 - признак отказа.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ПередЗаписьюТиповыхОповещений(ЭтотОбъект, Отказ) Экспорт
	
	// Временное решение.
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтотОбъект.Предопределенный 
		И Не (ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновлениеТиповыхОповещений") 
		И ЭтотОбъект.ДополнительныеСвойства.ОбновлениеТиповыхОповещений) Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Запрещено изменение типовых оповещений!'");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецФункции

// Обработчик "При создании на сервере" форм типовых оповещений.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма.
//  Объект	 - Произвольный	 	 - объект.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ПриСозданииНаСервереФормТиповыхОповещений(ЭтаФорма, Объект = Неопределено) Экспорт
	
	Если Найти(ЭтаФорма.ИмяФормы, "упоТранспортОповещений") <> 0 Тогда
		
	ИначеЕсли Объект <> Неопределено И Объект.Предопределенный Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Актуализирует регламентные задания детекторов событий.
//
// Параметры:
//  ВидыСобытийДляОбновления -  СправочникСсылка.упоВидыСобытий, Массив из СправочникСсылка.упоВидыСобытий - элемент или список видов событий.
// 
Процедура ОбновитьРегламентныеЗаданияДетекторов(ВидыСобытийДляОбновления) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбновитьВсе = Не ЗначениеЗаполнено(ВидыСобытийДляОбновления);
	Если Не ОбновитьВсе И ТипЗнч(ВидыСобытийДляОбновления) <> Тип("Массив") Тогда
		ВидыСобытийОтбор = Новый Массив;
		ВидыСобытийОтбор.Добавить(ВидыСобытийДляОбновления);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоВидыСобытий.Ссылка КАК Ссылка,
	               |	упоВидыСобытий.РасписаниеДетектора КАК РасписаниеДетектора,
	               |	упоВидыСобытий.Используется КАК Используется,
				   |	упоВидыСобытий.ПометкаУдаления КАК ПометкаУдаления,
	               |	упоВидыСобытий.СпособОтслеживанияСобытия КАК СпособОтслеживанияСобытия
	               |ИЗ
	               |	Справочник.упоВидыСобытий КАК упоВидыСобытий
	               |ГДЕ
	               |	%1";
		
	ТекстУсловия = ?(ОбновитьВсе, "ИСТИНА", "упоВидыСобытий.Ссылка В (&ВидыСобытийОтбор)");
	Запрос.Текст = СтрШаблон(ТекстЗапроса, ТекстУсловия);
	Запрос.УстановитьПараметр("ВидыСобытийОтбор", ВидыСобытийОтбор);
	
	ТаблицаАктуальных = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.упоОбработкаДетекторовСобытий);
	ШаблонНаименованияЗадания = НСтр("ru = 'Детектор оповещения: ""%1""'");
	
	Для Каждого СтрокаАктуальных Из ТаблицаАктуальных Цикл
		
		ВидСобытия = СтрокаАктуальных.Ссылка;
		УИ = ВидСобытия.УникальныйИдентификатор();
		
		Отбор.Вставить("Ключ", УИ);
		ЗаданияСобытия = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
		
		Если СтрокаАктуальных.СпособОтслеживанияСобытия = Перечисления.упоСпособыОтслеживанияСобытий.ПоРасписанию
			И Не СтрокаАктуальных.ПометкаУдаления Тогда
			ТребуемоеКоличествоРегЗаданий = 1;
		Иначе
			ТребуемоеКоличествоРегЗаданий = 0;
		КонецЕсли;
		
		Пока ЗаданияСобытия.Количество() > ТребуемоеКоличествоРегЗаданий Цикл
			Задание = ЗаданияСобытия[0];
			ЗаданияСобытия.Удалить(0);
			Задание.Удалить();
		КонецЦикла;
		
		Если ТребуемоеКоличествоРегЗаданий = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗаданияСобытия.Количество() > 0 Тогда
			Задание = ЗаданияСобытия[0];
		Иначе
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(
				Метаданные.РегламентныеЗадания.упоОбработкаДетекторовСобытий);
		КонецЕсли;
		
		Параметры = Новый Массив;
		Параметры.Добавить(ВидСобытия);		
		
		Расписание = СтрокаАктуальных.РасписаниеДетектора.Получить();
		Если Расписание = Неопределено Тогда
			Расписание = РасписаниеПоУмолчанию();
		КонецЕсли;
		
		Задание.Наименование = СтрШаблон(ШаблонНаименованияЗадания, ВидСобытия);
		Задание.Ключ = УИ;		
		Задание.Параметры = Параметры;
		Задание.Расписание = Расписание;
		Задание.Использование = СтрокаАктуальных.Используется; 
		
		Задание.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Расписание регламентного задания по умолчанию.
// 
// Возвращаемое значение:
//  РасписаниеРегламентногоЗадания - Расписание регламентного задания.
//
Функция РасписаниеПоУмолчанию() Экспорт
	Расписание = Новый РасписаниеРегламентногоЗадания();
	Расписание.ПериодПовтораДней = 1;
	//Расписание.ПериодПовтораВТечениеДня = 3600;
	Возврат Расписание;
КонецФункции 

// Получает массив модулей транспортов.
// 
// Возвращаемое значение:
//  Массив - массив модулей.
//
Функция ПолучитьМассивМодулейТранспортов() Экспорт
	
	МассивМодулей = Новый Массив;
	
	ОбщиеМодули = Метаданные.ОбщиеМодули;
	
	Для каждого Эл Из ОбщиеМодули Цикл
		Если Лев(Эл.Имя, 20) = "упоОтправкаСообщений" Тогда
			МассивМодулей.Добавить(Эл.Имя);	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат МассивМодулей;
	
КонецФункции 

// Включает/выключает вид события.
//
// Параметры:
//  Событие	 - ДокументСсылка, СправоникСсылка	 - событие.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ВключитьВыключитьВидСобытия(Событие) Экспорт
	
	обСобытие = Событие.ПолучитьОбъект();	
	обСобытие.Используется = Не обСобытие.Используется;
	обСобытие.ДополнительныеСвойства.Вставить("ОбновлениеТиповыхОповещений", Истина);
	обСобытие.Записать();
	
КонецФункции

// Очищает отправленные сообщения.
//
Процедура ОчисткаОтправленныхСообщений() Экспорт
	
	Если НЕ упоОповещенияПовтИсп.ИспользоватьОповещения() Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекДата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	упоВидыСобытий.Ссылка КАК ВидСобытия,
					|	ВЫБОР
					|		КОГДА ISNULL(упоВидыСобытий.СрокХраненияОповещений, 0) = 0
					|			ТОГДА ISNULL(упоСрокХраненияОповещений.Значение,0)
					|		ИНАЧЕ ISNULL(упоВидыСобытий.СрокХраненияОповещений, 0)
					|	КОНЕЦ КАК СрокХранения,
					|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаОтсечения
					|ИЗ
					|	Справочник.упоВидыСобытий КАК упоВидыСобытий,
					|	Константа.упоСрокХраненияОповещений КАК упоСрокХраненияОповещений";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрТз Из ТЗ Цикл
		СтрТз.ДатаОтсечения = ТекДата - СтрТз.СрокХранения * 86400;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВтСрокиХранения ИЗ &тз КАК тз";
	Запрос.УстановитьПараметр("тз", ТЗ);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 100
					|	упоОтправленныеСообщения.ВидСобытия,
					|	упоОтправленныеСообщения.Источник,
					|	упоОтправленныеСообщения.ИсточникДопПараметр,
					|	упоОтправленныеСообщения.ВидПолучателя,
					|	упоОтправленныеСообщения.Получатель,
					|	упоОтправленныеСообщения.Транспорт,
					|	упоОтправленныеСообщения.ИдентификаторСобытия,
					|	упоОтправленныеСообщения.ДатаОтправки
					|ИЗ
					|	РегистрСведений.упоОтправленныеСообщения КАК упоОтправленныеСообщения
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСрокиХранения КАК ВтСрокиХранения
					|		ПО упоОтправленныеСообщения.ВидСобытия = ВтСрокиХранения.ВидСобытия
					|ГДЕ
					|	ВЫБОР
					|			КОГДА ВтСрокиХранения.СрокХранения = 0
					|				ТОГДА ЛОЖЬ
					|			ИНАЧЕ упоОтправленныеСообщения.ДатаОтправки < ВтСрокиХранения.ДатаОтсечения
					|		КОНЕЦ";
	
	Пока Истина Цикл // В цикле получаем порциями по 100 необработанные события, пока есть что обрабатывать.
		
		Таблица = Запрос.Выполнить().Выгрузить();	
		Если Таблица.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;	
		
		Для Каждого Строка Из Таблица Цикл
			
			НачатьТранзакцию();
			Попытка
				
				МЗ = РегистрыСведений.упоОтправленныеСообщения.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ,Строка);
				МЗ.Прочитать();
				МЗ.Удалить();
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(НСтр("ru='Обработка отправленных сообщений'"),
					УровеньЖурналаРегистрации.Ошибка, 
					Метаданные.РегистрыСведений.упоОтправленныеСообщения,
					Строка.ВидСобытия,
					СообщениеОбОшибке);
				
			КонецПопытки;
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет код.
//
// Параметры:
//  ВыполняемыйКод			 - Строка
//  ТекстУспешногоЗавершения - Строка
//  Источник				 - ЛюбаяСсылка
//  ИсточникДопПараметр		 - ЛюбаяСсылка, Булево, Строка, Дата, Число
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ПроверитьКод(ВыполняемыйКод, ТекстУспешногоЗавершения, Источник = Неопределено, ИсточникДопПараметр = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Ложь; 
	ПараметрыВозврата = Новый Структура;
	
	ДанныеДоИзменения = Неопределено;
	
	ПараметрыВыполненияКода = Новый Структура;
	
	Попытка
		
		Выполнить(ВыполняемыйКод);
		
		ТекстУспешногоЗавершения = НСтр("ru = 'Результат = '") + Строка(Результат) + Символы.ПС;
		
		СтрокаПараметров = "";
		Для Каждого Пара Из ПараметрыВозврата Цикл
			
			Если Не ПустаяСтрока(СтрокаПараметров) Тогда
				СтрокаПараметров = СтрокаПараметров + Символы.ПС;
			КонецЕсли;	
			
			СтрокаПараметров = СтрокаПараметров + Строка(Пара.Ключ) + "=" + Строка(Пара.Значение);
			
		КонецЦикла;	
		
		ТекстУспешногоЗавершения = ТекстУспешногоЗавершения
			+ НСтр("ru = 'ПараметрыВозврата: '")
			+ Символы.ПС
			+ Строка(СтрокаПараметров)
			+ Символы.ПС;
			
		ТекстУспешногоЗавершения = ТекстУспешногоЗавершения
			+ НСтр("ru = 'Источник = '") + Источник;
			
			
		ТекстИсточникДопПараметр = "";
		Если ТипЗнч(ИсточникДопПараметр) = Тип("Массив") Тогда	 
			Для Каждого тДопПараметр Из ИсточникДопПараметр Цикл
				ТекстИсточникДопПараметр = ТекстИсточникДопПараметр + ?(ЗначениеЗаполнено(ТекстИсточникДопПараметр), ", ", "") + тДопПараметр;
			КонецЦикла;
		Иначе
			ТекстИсточникДопПараметр = "" + ИсточникДопПараметр; 
		КонецЕсли;	
		ТекстИсточникДопПараметр = НСтр("ru = 'Источник доп. параметр = '") + ТекстИсточникДопПараметр;	
		
		ТекстУспешногоЗавершения = ТекстУспешногоЗавершения + Символы.ПС + ТекстИсточникДопПараметр; 
			
		Возврат Истина;
		
	Исключение
		
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = '" + СообщениеОбОшибке + "'");
		Сообщение.Сообщить();
				
		Возврат Ложь;
		
	КонецПопытки;	
	
КонецФункции

// Выполняет код.
//
// Параметры:
//  ВыполняемыйКод			 - Строка
//  Результат				 - Произвольный
//  ПараметрыВозврата		 - Структура
//  Источник				 - Произвольный	 - не используется.
//  ИсточникДопПараметр		 - ЛюбаяСсылка, Булево, Строка, Дата, Число
//  ДанныеДоИзменения		 - Структура
//  ПараметрыВыполненияКода	 - Структура
//
Процедура ВыполнитьКод(ВыполняемыйКод, Результат, ПараметрыВозврата, Источник = Неопределено,
			ИсточникДопПараметр = Неопределено, ДанныеДоИзменения = Неопределено, ПараметрыВыполненияКода) Экспорт
	
	Выполнить(ВыполняемыйКод);
	
КонецПроцедуры

// Вычисляет значение тэга.
//
// Параметры:
//  ТипТэга					 - Перечисления.упоТипыТегов
//  Условие					 - Строка
//  УсловиеХЗ				 - Строка
//  Источник				 - Произвольный
//  ИсточникДопПараметр		 - Произвольный
//  ВидСобытия				 - СправочникСсылка.упоВидыСобытий
//  ПараметрыВыполненияКода	 - Структура
// 
// Возвращаемое значение:
//  Строка - значение тэга.
//
Функция ВычислитьЗначениеТэга(ТипТэга, Условие, УсловиеХЗ, Источник, ИсточникДопПараметр,
										ВидСобытия, ПараметрыВыполненияКода = Неопределено) Экспорт
	
	ЗначениеТэга = "";
	Если ПараметрыВыполненияКода = Неопределено Тогда
		ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(ВидСобытия);
	КонецЕсли;
	
	Если ТипТэга = Перечисления.упоТипыТегов.ВыполняемыйКод Тогда
		
		ПараметрыВозврата = Новый Структура;
		
		Попытка
			ВыполнитьКод(Условие, ЗначениеТэга, ПараметрыВозврата, Источник, ИсточникДопПараметр,, ПараметрыВыполненияКода);
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление значения тэга'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеТэга = "";	
		КонецПопытки;
		
		Если ЗначениеТэга = Неопределено Тогда
			ЗначениеТэга = "";	
		КонецЕсли;
		
	ИначеЕсли ТипТэга = Перечисления.упоТипыТегов.Константа Тогда
		
		Попытка
			ЗначениеТэга = "" + Константы[Условие].Получить();
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление значения тэга'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеТэга = "";	
		КонецПопытки;
					
	ИначеЕсли ТипТэга = Перечисления.упоТипыТегов.ВычисляемыйРеквизит Тогда
		
		ПарРеквизита = РазобратьИмяРеквизита(Условие);
		ПолноеИмяТаблицы = ПарРеквизита.ВидТаблицы + "." + ПарРеквизита.ИмяТаблицы;
		ВыполняемыйКод = ПолучитьВыполняемыйКодВычисляемогоРеквизита(ПолноеИмяТаблицы,ПарРеквизита.ИмяРеквизита);
		
		ПараметрыВозврата = Новый Структура;
		
		Попытка
			ВыполнитьКод(ВыполняемыйКод, ЗначениеТэга, ПараметрыВозврата, Источник, ИсточникДопПараметр,, ПараметрыВыполненияКода);
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление значения тэга'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеТэга = "";	
		КонецПопытки;
		
		Если ТипЗнч(ЗначениеТэга) = Тип("Дата") Тогда
			ЗначениеТэга = Формат(ЗначениеТэга,"ДЛФ=Д");
		ИначеЕсли ТипЗнч(ЗначениеТэга) = Тип("Число") Тогда
			ЗначениеТэга = Формат(ЗначениеТэга,"ЧГ=0");
		КонецЕсли;
		
	ИначеЕсли ТипТэга = Перечисления.упоТипыТегов.РеквизитОбъекта Тогда
		
		ПарРеквизита = РазобратьИмяРеквизита(Условие);
		
		Попытка
			ЗначениеТэга = "" + Источник[ПарРеквизита.ИмяРеквизита];
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление значения тэга'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеТэга = "";	
		КонецПопытки;
		
	ИначеЕсли ТипТэга = Перечисления.упоТипыТегов.НавигационнаяСсылка Тогда
		
		ПарРеквизита = РазобратьИмяРеквизита(Условие);
		
		АдресБазы = Константы.упоАдресБазыДляНавигационныхСсылок.Получить();
		
		Попытка
			ЗначениеРеквизита = Источник[ПарРеквизита.ИмяРеквизита];
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ЗначениеРеквизита);
			ЗначениеТэга = Новый Структура("Текст, HTML", "", "");
			ЗначениеТэга.Вставить("Текст", НавигационнаяСсылка);
			ЗначениеТэга.Вставить("HTML", "<a href="""+АдресБазы+НавигационнаяСсылка+""">"+НавигационнаяСсылка+"</a>");
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление значения тэга'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеТэга = "";	
		КонецПопытки;		
		
	ИначеЕсли ТипТэга = Перечисления.упоТипыТегов.ДопРеквизитОбъекта Тогда
		
		ПарРеквизита = УсловиеХЗ.Получить();
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	КонтИнфо.Адрес КАК Адрес
						|ИЗ
						|	Справочник.Пользователи КАК ТаблицаПолучателя
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтИнфо КАК КонтИнфо
						|		ПО ТаблицаПолучателя.Ссылка = КонтИнфо.Объект
						|ГДЕ
						|	ИСТИНА
						|	И ТаблицаПолучателя.Ссылка = &Получатель
						|	И КонтИнфо.ВидКонтИнфо = &ЗначениеУсловия";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".Адрес", "." + ПарРеквизита.ДопРеквПолеЗначения);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Пользователи", ПарРеквизита.ИмяТаблицыИсточника);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрСведений.КонтИнфо", ПарРеквизита.ДопРеквИмяТаблицы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КонтИнфо.Объект","КонтИнфо." + ПарРеквизита.ДопРеквПолеСвязи);
		Если ПарРеквизита.Свойство("ДопРеквПолеУсловия") И ЗначениеЗаполнено(ПарРеквизита.ДопРеквПолеУсловия) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КонтИнфо.ВидКонтИнфо", "КонтИнфо." + ПарРеквизита.ДопРеквПолеУсловия);
			Запрос.УстановитьПараметр("ЗначениеУсловия", ПарРеквизита.ДопРеквЗначениеУсловия);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И КонтИнфо.ВидКонтИнфо = &ЗначениеУсловия","");
		КонецЕсли;
		Запрос.УстановитьПараметр("Получатель", Источник);
		Запрос.Текст = ТекстЗапроса;
		
		Попытка
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗначениеТэга = "" + Выборка.Адрес;	
			КонецЕсли;
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление значения тэга'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеТэга = "";	
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ЗначениеТэга;
	
КонецФункции

// Вычисляет значение настройки траспорта вида события для отправки.
//
// Параметры:
//  ТекстКода				 - Строка
//  ВидСобытия				 - СправочникСсылка.упоВидыСобытий
//  Источник				 - Произвольный
//  ИсточникДопПараметр		 - Произвольный
//  ПараметрыВыполненияКода	 - Структура
// 
// Возвращаемое значение:
//  Структура, Неопределено - значение настройки.
//
Функция ВычислитьНастройкиТранспортаВидаСобытияДляОтправки(Знач ТекстКода, 
	Знач ВидСобытия, Знач Источник, Знач ИсточникДопПараметр, ПараметрыВыполненияКода = Неопределено) Экспорт
	
	Результат = Неопределено;
		
	Попытка
		Выполнить(ТекстКода);
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление значения настройки транспорта для вида события'"), 
								УровеньЖурналаРегистрации.Ошибка, 
								Метаданные.Справочники.упоВидыСобытий, 
								ВидСобытия, 
								СообщениеОбОшибке);
		Результат = Неопределено;	
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции

// Определяет адрес получателя.
//
// Параметры:
//  Получатель			 - Строка, СправочникСсылка
//  ВидПолучателя		 - СправочникСсылка.упоВидыПолучателейОповещений
//  Транспорт			 - СправочникСсылка.упоТранспортОповещений
//  СообщениеОбОшибках	 - Строка
// 
// Возвращаемое значение:
//  Строка - адрес получателя.
//
Функция ОпределитьАдресПолучателя(Получатель, ВидПолучателя, Транспорт, СообщениеОбОшибках = "") Экспорт
	
	АдресПолучателя = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыПолучателейОповещенийАдресаОтправки.ВариантХраненияПоляАдреса,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.ПолеАдресаХЗ,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.Ссылка.ТаблицаПолучателя КАК ТаблицаПолучателя,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.ПолеАдреса
	               |ИЗ
	               |	Справочник.упоВидыПолучателейОповещений.АдресаОтправки КАК упоВидыПолучателейОповещенийАдресаОтправки
	               |ГДЕ
	               |	упоВидыПолучателейОповещенийАдресаОтправки.Ссылка = &ВидПолучателя
	               |	И упоВидыПолучателейОповещенийАдресаОтправки.Транспорт = &Транспорт
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоВидыПолучателейОповещенийАдресаОтправки.НомерСтроки";
	Запрос.УстановитьПараметр("ВидПолучателя",ВидПолучателя);
	Запрос.УстановитьПараметр("Транспорт",Транспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекАдрес = ВычислитьАдресПолучателя(Получатель,
			Выборка.ТаблицаПолучателя,
			ВидПолучателя,
			Выборка.ВариантХраненияПоляАдреса,
			Выборка.ПолеАдреса,
			Выборка.ПолеАдресаХЗ,
			СообщениеОбОшибках);
				
		Если ЗначениеЗаполнено(ТекАдрес) Тогда
			АдресПолучателя = ТекАдрес;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат АдресПолучателя;
	
КонецФункции

// Получает настройки транспорта.
//
// Параметры:
//  Транспорт	 - СправочникСсылка.упоТранспортОповещений
// 
// Возвращаемое значение:
//  Структура - настройки.
//
Функция ПолучитьНастройкиТранспорта(Транспорт) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьНастройкиТранспорта(Транспорт);
	
КонецФункции

// Получает настройки транспорта для вида события.
//
// Параметры:
//  ВидСобытия	 - СправочникСсылка.упоВидыСобытий
// 
// Возвращаемое значение:
//  Соответствие - настройки.
//
Функция ПолучитьНастройкиТранспортовДляВидаСобытия(ВидСобытия) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьНастройкиТранспортовДляВидаСобытия(ВидСобытия);
	
КонецФункции

// Функция - Получить дополнительные параметры выполнения кода для вида события.
//
// Параметры:
//  ВидСобытия	 - Вид события	 - СправочникСсылка.упоВидыСобытий.
// 
// Возвращаемое значение:
//  Структура - Дополнительные параметры выполнения кода.
//
Функция ПолучитьПараметрыВыполненияКода(ВидСобытия) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьПараметрыВыполненияКода(ВидСобытия);
	
КонецФункции 

// Добавляет сообщение.
//
// Параметры:
//  ВидСобытия				 - СправочникСсылка.упоВидыСобытий
//  Источник				 - ЛюбаяСсылка
//  ИсточникДопПараметр		 - ЛюбаяСсылка, Булево, Строка, Дата, Число
//  ВидПолучателя			 - СправочникСсылка.упоВидыПолучателейОповещений, Строка
//  Получатель				 - СправочникСсылка, Строка
//  Транспорт				 - СправочникСсылка.упоТранспортОповещений
//  ДопПараметры			 - Структура
//  ПараметрыВыполненияКода	 - Структура
// 
// Возвращаемое значение:
//  Неопределено, Булево - результат.
//
Функция ДобавитьСообщение(ВидСобытия, Источник, ИсточникДопПараметр, ВидПолучателя,
	Получатель, Транспорт, ДопПараметры, ПараметрыВыполненияКода = Неопределено) Экспорт
	
	Если Не ДопПараметры.Свойство("СообщениеОбОшибках") Тогда
		ДопПараметры.Вставить("СообщениеОбОшибках", "");
	КонецЕсли;
	
	Отправить = Неопределено;
	ДопПараметры.Свойство("Отправить", Отправить);
	Если ТипЗнч(Отправить) <> Тип("Булево") Тогда
		Отправить = Истина;
		// Если отправить = Ложь, то помещаем сообщение в очередь.
	КонецЕсли;
	
	ШаблонТекста = "";
	ШаблонТекстаHTML = "";
	ШаблонТемы = "";
	КоличествоПопытокОтправки = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытий.ШаблонТекста,
	               |	упоВидыСобытий.ШаблонТекстаHTML,
	               |	упоВидыСобытий.ШаблонТемы,
	               |	упоВидыСобытий.КоличествоПопытокОтправки
	               |ИЗ
	               |	Справочник.упоВидыСобытий КАК упоВидыСобытий
	               |ГДЕ
	               |	упоВидыСобытий.Ссылка = &ВидСобытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытийТэги.НомерСтроки,
	               |	упоВидыСобытийТэги.ТипТэга,
	               |	упоВидыСобытийТэги.Значение,
	               |	упоВидыСобытийТэги.Условие,
				   |	упоВидыСобытийТэги.УсловиеХЗ,
	               |	упоВидыСобытийТэги.Представление
	               |ИЗ
	               |	Справочник.упоВидыСобытий.Тэги КАК упоВидыСобытийТэги
	               |ГДЕ
	               |	упоВидыСобытийТэги.Ссылка = &ВидСобытия";
				   
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	РезЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ШаблонТекста = Выборка.ШаблонТекста;
		ШаблонТекстаHTML = Выборка.ШаблонТекстаHTML;
		ШаблонТемы = Выборка.ШаблонТемы;
		КоличествоПопытокОтправки = Выборка.КоличествоПопытокОтправки;
		Если КоличествоПопытокОтправки = 0 Тогда
			КоличествоПопытокОтправки = 3;
		КонецЕсли;
	Иначе
		ДопПараметры.СообщениеОбОшибках = ДопПараметры.СообщениеОбОшибках + 
										  НСтр("ru = 'Не удалось получить параметры сообщения'") + Символы.ПС;
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(ВидСобытия);
	
	тзТэги = РезЗапроса[1].Выгрузить();
	Для Каждого СтрТз Из тзТэги Цикл
		
		ИмяТэга = "["+СтрТз.Представление + "]";
		
		Если Найти(ШаблонТекста,ИмяТэга) = 0 
			И Найти(ШаблонТекстаHTML,ИмяТэга) = 0
			И Найти(ШаблонТемы,ИмяТэга) = 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		РезультатВычисления = упоОповещенияВызовСервера.ВычислитьЗначениеТэга(
														СтрТз.ТипТэга, СтрТз.Условие, 
														СтрТз.УсловиеХЗ, Источник, ИсточникДопПараметр,
														ВидСобытия, ПараметрыВыполненияКода); 
		
		Если ТипЗнч(РезультатВычисления) = Тип("Структура") Тогда
			ЗначениеТэгаТекст = РезультатВычисления.Текст;	
			ЗначениеТэгаHTML = РезультатВычисления.HTML;
		Иначе
			ЗначениеТэгаТекст = РезультатВычисления;	
			ЗначениеТэгаHTML = ЗначениеТэгаТекст;	
		КонецЕсли;
		
		ШаблонТекста = СтрЗаменить(ШаблонТекста, ИмяТэга, ЗначениеТэгаТекст);
		ШаблонТекстаHTML = СтрЗаменить(ШаблонТекстаHTML, ИмяТэга, ЗначениеТэгаHTML);
		ШаблонТемы = СтрЗаменить(ШаблонТемы, ИмяТэга, ЗначениеТэгаТекст);

		
	КонецЦикла;
	
	ДопПараметры.Вставить("ШаблонТекста", ШаблонТекста);
	ДопПараметры.Вставить("ШаблонТекстаHTML", ШаблонТекстаHTML);
	ДопПараметры.Вставить("ШаблонТемы", ШаблонТемы);
	ДопПараметры.Вставить("КоличествоПопытокОтправки", КоличествоПопытокОтправки);
	
	Если Отправить Тогда
		Рез = ОтправитьСообщение(ВидСобытия, Источник, ИсточникДопПараметр, 
									ВидПолучателя, Получатель, Транспорт, ДопПараметры);
	Иначе
		Рез = ПоместитьСообщениеВОчередь(ВидСобытия, Источник, ИсточникДопПараметр, 
									ВидПолучателя, Получатель, Транспорт, ДопПараметры);	
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Отправляет сообщение.
//
// Параметры:
//  ВидСобытия			 - СправочникСсылка.упоВидыСобытий
//  Источник			 - ЛюбаяСсылка
//  ИсточникДопПараметр	 - ЛюбаяСсылка, Булево, Строка, Дата, Число
//  ВидПолучателя		 - СправочникСсылка.упоВидыПолучателейОповещений, Строка
//  Получатель			 - Строка, СправочникСсылка
//  Транспорт			 - СправочникСсылка.упоТранспортОповещений
//  ДопПараметры		 - Структура
//  СообщениеОбОшибке	 - Строка
//  КэшЗначений			 - Соответствие
// 
// Возвращаемое значение:
//  Неопределено, Булево - результат.
//
Функция ОтправитьСообщение(ВидСобытия, Источник, ИсточникДопПараметр, ВидПолучателя, Получатель, Транспорт, 
	ДопПараметры, СообщениеОбОшибке = "", КэшЗначений = Неопределено) Экспорт
	
	СообщениеОбОшибке = "";
	
	Автор = Неопределено;
	ДопПараметры.Свойство("Автор",Автор);
	Если Автор = Неопределено Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ИдентификаторСобытия = Неопределено;
	ДопПараметры.Свойство("ИдентификаторСобытия", ИдентификаторСобытия);
	ДатаВозникновения = Неопределено;
	
	ДопПараметры.Свойство("ДатаВозникновения", ДатаВозникновения);
	СообщениеОбОшибках = Неопределено;
	
	ДопПараметры.Свойство("СообщениеОбОшибках", СообщениеОбОшибках);
	Если СообщениеОбОшибках = Неопределено Тогда
		СообщениеОбОшибках = "";
	КонецЕсли;
		
	НастройкиТранспорта = ПолучитьНастройкиТранспорта(Транспорт);
	Если НастройкиТранспорта = Неопределено Тогда
		СообщениеОбОшибке = НСтр("ru = 'Не удалось получить параметры транспорта'");
		СообщениеОбОшибках = СообщениеОбОшибках + СообщениеОбОшибке + Символы.ПС;
		ДопПараметры.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
		ДопПараметры.Вставить("СообщениеОбОшибках", СообщениеОбОшибке);
		Возврат Неопределено;
	КонецЕсли;
		
	ПарОтправки = Новый Структура;
	ПарОтправки.Вставить("ИмяМодуляОтправкиСообщений", НастройкиТранспорта.ИмяМодуляОтправкиСообщений);
	
	Если НастройкиТранспорта.ДоступнаТемаСообщения И ДопПараметры.Свойство("ШаблонТемы") Тогда
		ПарОтправки.Вставить("Тема", ДопПараметры.ШаблонТемы);
	КонецЕсли;
	Если НастройкиТранспорта.ДоступенТекстСообщенияВHTML И Не ПустаяСтрока(ДопПараметры.ШаблонТекстаHTML) Тогда
		ПарОтправки.Вставить("Тело", ДопПараметры.ШаблонТекстаHTML);
		ПарОтправки.Вставить("ТипТекста","HTML");
	Иначе
		ПарОтправки.Вставить("Тело", ДопПараметры.ШаблонТекста);
		ПарОтправки.Вставить("ТипТекста", "ПростойТекст");
	КонецЕсли;
	ПарОтправки.Вставить("Источник", Источник);
	ПарОтправки.Вставить("ИсточникДопПараметр", ИсточникДопПараметр);
	
	ПараметрыТранспорта = Неопределено;
	НастройкиТранспорта.Свойство("ПараметрыТранспорта", ПараметрыТранспорта);
	Если ТипЗнч(ПараметрыТранспорта) = Тип("Структура") Тогда
		Для Каждого Эл Из ПараметрыТранспорта Цикл
			ПарОтправки.Вставить(Эл.Ключ,Эл.Значение);	
		КонецЦикла;
	КонецЕсли; 
	
	АдресПолучателя = упоОповещенияВызовСервера.ОпределитьАдресПолучателя(Получатель,
		ВидПолучателя,
		Транспорт,
		СообщениеОбОшибках);
	ПарОтправки.Вставить("Кому", АдресПолучателя);
	
	Если НастройкиТранспорта.ДоступнаНастройкаДляВидаСобытия Тогда
		НастройкиТранспортовДляВидаСобытия = ПолучитьНастройкиТранспортовДляВидаСобытия(ВидСобытия);
		НастройкиВидаСобытияДляОтправки  = Неопределено;
		Если НЕ НастройкиТранспортовДляВидаСобытия = Неопределено Тогда
			ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(ВидСобытия);		
			промНастройкиВидаСобытияДляОтправки = НастройкиТранспортовДляВидаСобытия.Получить(Транспорт);
			Если промНастройкиВидаСобытияДляОтправки <> Неопределено Тогда
				НастройкиВидаСобытияДляОтправки = Новый Структура;
				Для Каждого КлючЗначение Из промНастройкиВидаСобытияДляОтправки Цикл
					Если НЕ КлючЗначение.Значение.Использование Тогда
						Продолжить;
					КонецЕсли;
					Если КлючЗначение.Значение.Кодом Тогда
						РезультатВычисления = ВычислитьНастройкиТранспортаВидаСобытияДляОтправки(КлючЗначение.Значение.ВыполняемыйКод,
						                                                                        ВидСобытия,
																								Источник, 	
																								ИсточникДопПараметр, 
																								ПараметрыВыполненияКода);
						НастройкиВидаСобытияДляОтправки.Вставить(КлючЗначение.Ключ, РезультатВычисления);																								
					Иначе
						НастройкиВидаСобытияДляОтправки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение.Значение);
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		Если НастройкиВидаСобытияДляОтправки <> Неопределено Тогда
			ПарОтправки.Вставить("НастройкиВидаСобытия", НастройкиВидаСобытияДляОтправки);
		КонецЕсли;
	
	КонецЕсли;
	
	Попытка
		
		ИсполняемыйМодуль = Вычислить(ПарОтправки.ИмяМодуляОтправкиСообщений);
		ИдентификаторСообщения = ИсполняемыйМодуль.ОтправитьСообщение(ПарОтправки);
		
	Исключение
		
		ИдентификаторСообщения = Неопределено;	
		
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СообщениеОбОшибках = СообщениеОбОшибках + СообщениеОбОшибке + Символы.ПС;
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Отправка сообщения'"),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.упоВидыСобытий,
			ВидСобытия,
			СообщениеОбОшибке);
		
	КонецПопытки;
	
	ДопПараметры.Вставить("СообщениеОбОшибке", СообщениеОбОшибке);
	ДопПараметры.Вставить("СообщениеОбОшибках", СообщениеОбОшибках);
	
	Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		
		МЗ = РегистрыСведений.упоОтправленныеСообщения.СоздатьМенеджерЗаписи();
		МЗ.ВидСобытия = ВидСобытия;
		МЗ.Источник = Источник;
		МЗ.ИсточникДопПараметр = ИсточникДопПараметр;
		МЗ.ВидПолучателя = ВидПолучателя;
		МЗ.Получатель = Получатель;
		МЗ.Транспорт = Транспорт;
		МЗ.ИдентификаторСобытия = ИдентификаторСобытия;
		МЗ.Текст = ДопПараметры.ШаблонТекста;
		МЗ.ТекстHTML = ДопПараметры.ШаблонТекстаHTML;
		МЗ.Тема = ДопПараметры.ШаблонТемы;
		МЗ.ДатаОтправки = ТекущаяДатаСеанса();
		МЗ.ДатаВозникновения = ДатаВозникновения;
		МЗ.Получатели = АдресПолучателя;
		МЗ.Автор = Автор;
		МЗ.Идентификатор = ИдентификаторСообщения;
		МЗ.Записать(Истина);
		
		ДопПараметры.Вставить("ДатаОтправки", МЗ.ДатаОтправки);
		
	КонецЕсли;
	
	Возврат ИдентификаторСообщения;
	
КонецФункции

// Помещает сообщение в очередь.
//
// Параметры:
//  ВидСобытия			 - СправочникСсылка.упоВидыСобытий
//  Источник			 - ЛюбаяСсылка
//  ИсточникДопПараметр	 - ЛюбаяСсылка, Булево, Строка, Дата, Число
//  ВидПолучателя		 - СправочникСсылка.упоВидыПолучателейОповещений, Строка
//  Получатель			 - Строка, СправочникСсылка
//  Транспорт			 - СправочникСсылка.упоТранспортОповещений
//  ДопПараметры		 - Структура
// 
// Возвращаемое значение:
//  Булево - результат.
//
Функция ПоместитьСообщениеВОчередь(ВидСобытия, Источник, ИсточникДопПараметр, ВидПолучателя, 
		Получатель, Транспорт, ДопПараметры) Экспорт
	
	УИСобытия = Неопределено;
	Автор = Неопределено;
	КоличествоПопытокОтправки =Неопределено;
	ДопПараметры.Свойство("УИСобытия", УИСобытия);
	ДопПараметры.Свойство("Автор", Автор);
	ДопПараметры.Свойство("КоличествоПопытокОтправки", КоличествоПопытокОтправки);
	Если Автор = Неопределено Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КоличествоПопытокОтправки) Тогда
		КоличествоПопытокОтправки = 3;
	КонецЕсли;
	
	МЗ = РегистрыСведений.упоОчередьСобытийДляОповещений.СоздатьМенеджерЗаписи();
	МЗ.ВидСобытия = ВидСобытия;
	МЗ.Источник = Источник;
	МЗ.ИсточникДопПараметр = ИсточникДопПараметр;
	МЗ.ВидПолучателя = ВидПолучателя;
	МЗ.Получатель = Получатель;
	МЗ.Транспорт = Транспорт;
	МЗ.ИдентификаторСобытия = УИСобытия;
	МЗ.Текст = ДопПараметры.ШаблонТекста;
	МЗ.ТекстHTML = ДопПараметры.ШаблонТекстаHTML;
	МЗ.Тема = ДопПараметры.ШаблонТемы;
	МЗ.ДатаВозникновения = ТекущаяДатаСеанса();
	МЗ.КоличествоПопытокОтправки = КоличествоПопытокОтправки;
	МЗ.Автор = Автор;
	МЗ.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции

// Получает возможные доп. реквизиты и свойства.
//
// Параметры:
//  ИмяТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Массив - массив реквизитов и свойств.
//
Функция ПолучитьВозможныеДопРеквизитыИСвойства(ИмяТаблицы) Экспорт
    
    Реквизиты = упоОповещенияПовтИсп.ПолучитьВозможныеДопРеквизитыИСвойства(ИмяТаблицы);

    Возврат Реквизиты;

КонецФункции

// Получает диспетчеров трудового ресурса, подписанных на событие.
//
// Параметры:
//  Источник	 - Строка	 - источник вида события.
//  пВхПараметр	 - 			 - СправочникСсылка.упоТрудовыеРесурсы, Массив - трудовой ресурс.
// 
// Возвращаемое значение:
//  Массив - пользователи.
//
Функция ПолучитьДиспетчеровТрудовогоРесурсаПодписанныхНаСобытие(Источник, пВхПараметр) Экспорт
		
	Запрос = Новый Запрос;
        
	Если ТипЗнч(пВхПараметр) = Тип("Массив") Тогда
		вхМассив = Истина;
		Запрос.УстановитьПараметр("МассивРесурсов", пВхПараметр);
	Иначе
		вхМассив = Ложь;
		Запрос.УстановитьПараметр("ТрудовойРесурс", пВхПараметр);
    КонецЕсли;
    
    Запрос.УстановитьПараметр("Источник", Источник.Метаданные().ПолноеИмя());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   РегТР.Сотрудник КАК Сотрудник
        |ПОМЕСТИТЬ Сотрудники
        |ИЗ
        |   РегистрСведений.упоВладениеРесурсами.СрезПоследних(, Ресурс = &ТрудовойРесурс) КАК РегТР
        |ГДЕ
        |   РегТР.ВладеетРесурсом
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |   упоДиспетчерыСистемыСрезПоследних.Пользователь КАК Пользователь,
        |   упоДиспетчерыСистемыСрезПоследних.Сотрудник КАК Сотрудник
        |ПОМЕСТИТЬ ВТ_ДиспетчерыТР
        |ИЗ
        |   РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(
        |           ,
        |           Сотрудник В
        |               (ВЫБРАТЬ
        |                   Сотрудники.Сотрудник
        |               ИЗ
        |                   Сотрудники)) КАК упоДиспетчерыСистемыСрезПоследних
        |ГДЕ
        |   упоДиспетчерыСистемыСрезПоследних.ФлагУправления
        |   И НЕ упоДиспетчерыСистемыСрезПоследних.Пользователь.ПометкаУдаления
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ВЫРАЗИТЬ(упоПодпискиНаОповещения.Получатель КАК Справочник.Пользователи) КАК Пользователь
        |ИЗ
        |   РегистрСведений.упоПодпискиНаОповещения КАК упоПодпискиНаОповещения
        |ГДЕ
        |   упоПодпискиНаОповещения.ВидСобытия.Источник = &Источник
        |   И упоПодпискиНаОповещения.Получатель В
        |           (ВЫБРАТЬ
        |               ВТ_ДиспетчерыТР.Пользователь КАК Пользователь
        |           ИЗ
        |               ВТ_ДиспетчерыТР КАК ВТ_ДиспетчерыТР)
        |   И упоПодпискиНаОповещения.Действует";
	
	Если вхМассив Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Ресурс = &ТрудовойРесурс", "Ресурс В (&МассивРесурсов)");
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Если вхМассив Тогда
		Возврат ТаблицаРезультат;
	Иначе
		Возврат ТаблицаРезультат.ВыгрузитьКолонку("Пользователь");
	КонецЕсли;
	
КонецФункции

// Получает список доступных таблиц.
//
// Параметры:
//  Параметры	 - Структура
//  БезТабЧастей - Булево
// 
// Возвращаемое значение:
//  СписокЗначений - список таблиц.
//
Функция ПолучитьСписокДоступныхТаблиц(Параметры = Неопределено, БезТабЧастей = Ложь) Экспорт
	
	масНужныеТипы = Неопределено;
	масНужныеТаблицы = Неопределено;
	масТаблицыИсключения = Неопределено;
	СокрПредставление = Неопределено;
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		Параметры.Свойство("масНужныеТипы",масНужныеТипы);
		Параметры.Свойство("масНужныеТаблицы",масНужныеТаблицы);
		Параметры.Свойство("масТаблицыИсключения",масТаблицыИсключения);
		Параметры.Свойство("СокрПредставление",СокрПредставление);
	КонецЕсли;

	Если ТипЗнч(масНужныеТипы) = Тип("Массив") Тогда
		НужныеТипы = СтрСоединить(масНужныеТипы,",");
	Иначе
		НужныеТипы = "";
	КонецЕсли;
	
	Если ТипЗнч(масНужныеТаблицы) = Тип("Массив") Тогда
		НужныеТаблицы = СтрСоединить(масНужныеТаблицы,",");
	Иначе
		НужныеТаблицы = "";
	КонецЕсли;
	
	Если ТипЗнч(масТаблицыИсключения) = Тип("Массив") Тогда
		ТаблицыИсключения = СтрСоединить(масТаблицыИсключения,",");
	Иначе
		ТаблицыИсключения = "";
	КонецЕсли;
	
	Если СокрПредставление = Неопределено Тогда
		СокрПредставление = Ложь;
	КонецЕсли;
	
	Возврат упоОповещенияПовтИсп.ПолучитьСписокДоступныхТаблиц(НужныеТипы,
		НужныеТаблицы,
		ТаблицыИсключения,
		СокрПредставление,
		БезТабЧастей);
	
КонецФункции

// Получает список реквизитов для оповещений.
//
// Параметры:
//  ИмяТаблицы	 - Строка - имя таблицы.
// 
// Возвращаемое значение:
//  Массив - массив реквизитов.
//
Функция ПолучитьСписокРеквизитовДляОповещений(ИмяТаблицы) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьСписокРеквизитовДляОповещений(ИмяТаблицы);
	
КонецФункции

// Получает список вычисляемых реквизитов.
//
// Параметры:
//  ИмяТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Массив - массив реквизитов.
//
Функция ПолучитьСписокВычисляемыхРеквизитов(ИмяТаблицы) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьСписокВычисляемыхРеквизитов(ИмяТаблицы);
	
КонецФункции

// Получает выполняемый код вычисляемого реквизита.
//
// Параметры:
//  ИмяТаблицы	 - Строка
//  ИмяРеквизита - Строка
// 
// Возвращаемое значение:
//  Массив - массив реквизитов.
//
Функция ПолучитьВыполняемыйКодВычисляемогоРеквизита(ИмяТаблицы,ИмяРеквизита) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьВыполняемыйКодВычисляемогоРеквизита(ИмяТаблицы, ИмяРеквизита);
	
КонецФункции

// Получает список возможных реквизитов для хранения адресов.
//
// Параметры:
//  ИмяТаблицы	 - Строка
// 
// Возвращаемое значение:
//  СписокЗначений - список.
//
Функция ПолучитьСписокВозможныхРеквизитовДляХраненияАдресов(ИмяТаблицы) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьСписокВозможныхРеквизитовДляХраненияАдресов(ИмяТаблицы);
	
КонецФункции

// Получает представление таблицы.
//
// Параметры:
//  ИмяТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Строка - представление.
//
Функция ПолучитьПредставлениеТаблицы(ИмяТаблицы) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьПредставлениеТаблицы(ИмяТаблицы);	
	
КонецФункции 

// Получает список доступных констант для шаблона сообщения.
// 
// Возвращаемое значение:
//  СписокЗначений - список.
//
Функция ПолучитьСписокДоступныхКонстантДляШаблонаСообщения() Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьСписокДоступныхКонстантДляШаблонаСообщения();
	
КонецФункции

// Получает все вычисляемые реквизиты.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица.
//
Функция ПолучитьВсеВычисляемыеРеквизиты() Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьВсеВычисляемыеРеквизиты();
	
КонецФункции

// Получает таблицы контактной информации.
//
// Параметры:
//  ИмяВедущейТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Массив - массив таблиц.
//
Функция ПолучитьТаблицыКонтИнфо(ИмяВедущейТаблицы) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьТаблицыКонтИнфо(ИмяВедущейТаблицы);
	
КонецФункции

// Получает таблицы контактного лица.
//
// Параметры:
//  ИмяВедущейТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Массив - массив таблиц.
//
Функция ПолучитьТаблицыКонтЛицо(ИмяВедущейТаблицы) Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьТаблицыКонтЛицо(ИмяВедущейТаблицы);
	
КонецФункции

// Разбирает имя таблицы.
//
// Параметры:
//  ИмяТаблицыИТабЧасти	 - Строка
//  ИмяТаблицыБезВида	 - Строка
// 
// Возвращаемое значение:
//  Структура - структура с данными таблицы.
//
Функция РазобратьИмяТаблицы(Знач ИмяТаблицыИТабЧасти,ИмяТаблицыБезВида = Ложь) Экспорт
	
	Рез = Новый Структура;
	Рез.Вставить("ИмяТаблицы",ИмяТаблицыИТабЧасти);
	Рез.Вставить("ВидТаблицы","");
	Рез.Вставить("ИмяТабЧасти","");
	Рез.Вставить("ЭтоТабЧасть",Ложь);
	
	масПодстроки = Новый Массив;
	Остаток = ИмяТаблицыИТабЧасти;
	
	Поз = Найти(Остаток,".");
	Пока Поз > 0 Цикл
		Подстрока = Лев(Остаток,Поз-1);
		Остаток = Сред(Остаток,Поз+1);
		масПодстроки.Добавить(Подстрока);
		Поз = Найти(Остаток,".");
	КонецЦикла;
	
	Если Не ПустаяСтрока(Остаток) Тогда
		масПодстроки.Добавить(Остаток);		
	КонецЕсли;
	
	Если масПодстроки.Количество() = 2 Тогда
		Рез.ВидТаблицы = масПодстроки[0];
		Рез.ИмяТаблицы = ?(ИмяТаблицыБезВида, масПодстроки[1], масПодстроки[0] + "." + масПодстроки[1]);
	ИначеЕсли масПодстроки.Количество() = 3 Тогда	
		Рез.ВидТаблицы = масПодстроки[0];
		Рез.ИмяТабЧасти = масПодстроки[2];
		Рез.ИмяТаблицы = ?(ИмяТаблицыБезВида, масПодстроки[1], масПодстроки[0] + "." + масПодстроки[1]);
		Рез.ЭтоТабЧасть = Истина;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Разбирает имя реквизита.
//
// Параметры:
//  ИмяРеквизита - Строка
// 
// Возвращаемое значение:
//  Структура - структура с данными таблицы.
//
Функция РазобратьИмяРеквизита(Знач ИмяРеквизита) Экспорт
	
	Рез = Новый Структура;
	Рез.Вставить("ВидТаблицы", "");
	Рез.Вставить("ИмяТаблицы", "");
	Рез.Вставить("ИмяТабЧасти", "");
	Рез.Вставить("ИмяРеквизита", ИмяРеквизита);
	Рез.Вставить("ЭтоТабЧасть", Ложь);
	
	масПодстроки = Новый Массив;
	Остаток = ИмяРеквизита;
	
	Поз = Найти(Остаток, ".");
	Пока Поз > 0 Цикл
		Подстрока = Лев(Остаток, Поз-1);
		Остаток = Сред(Остаток, Поз+1);
		масПодстроки.Добавить(Подстрока);
		Поз = Найти(Остаток, ".");
	КонецЦикла;
	
	Если Не ПустаяСтрока(Остаток) Тогда
		масПодстроки.Добавить(Остаток);		
	КонецЕсли;
	
	Если масПодстроки.Количество() = 1 Тогда
		Рез.ИмяРеквизита = масПодстроки[0];
	ИначеЕсли масПодстроки.Количество() = 2 Тогда
		Рез.ИмяТаблицы = масПодстроки[0];
		Рез.ИмяРеквизита = масПодстроки[1];
	ИначеЕсли масПодстроки.Количество() = 3 Тогда
		Рез.ВидТаблицы = масПодстроки[0];
		Рез.ИмяТаблицы = масПодстроки[1];
		Рез.ИмяРеквизита = масПодстроки[2];
	ИначеЕсли масПодстроки.Количество() = 4 Тогда
		Рез.ВидТаблицы = масПодстроки[0];
		Рез.ИмяТаблицы = масПодстроки[1];
		Рез.ИмяТабЧасти = масПодстроки[2];
		Рез.ИмяРеквизита = масПодстроки[3];
		Рез.ЭтоТабЧасть = Истина;
	КонецЕсли;
		
	Возврат Рез;
	
КонецФункции

// Раскладывает строку в массив подстрок.
//
// Параметры:
//  Строка					 - Строка
//  Разделитель				 - Строка
//  ПропускатьПустыеСтроки	 - Булево
// 
// Возвращаемое значение:
//  Массив - массив подстрок.
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",",
	Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Получает список доступных видов сравнений для реквизита.
//
// Параметры:
//  ПолноеИмяРеквизита	 - Строка		 - строка.
//  Источник			 - Произвольный	 - источник.
// 
// Возвращаемое значение:
//  СписокЗначений - список.
//
Функция ПолучитьСписокДоступныхВидовСравненийДляРеквизита(ПолноеИмяРеквизита, Источник = "") Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьСписокДоступныхВидовСравненийДляРеквизита(ПолноеИмяРеквизита,Источник);
		
КонецФункции

// Проверяет, является ли переданный параметр ссылкой.
//
// Параметры:
//  ОписаниеТипа - ОписаниеТипа
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЭтоОписаниеТипаСсылка(ОписаниеТипа) Экспорт
	
	Рез = Истина;
	
	Если ОписаниеТипа.СодержитТип(Тип("Булево")) Тогда
		Рез = Ложь;
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Число")) Тогда
		Рез = Ложь;
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Дата")) Тогда
		Рез = Ложь;
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Строка")) Тогда
		Рез = Ложь;
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("УникальныйИдентификатор")) Тогда
		Рез = Ложь;
	КонецЕсли;	
		
	Возврат Рез;
		
КонецФункции

// Проверяет, является ли переданный параметр ссылкой.
//
// Параметры:
//  Тип	 - Тип	 - проверяемый тип.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЭтотТипСсылка(Тип) Экспорт
	
	Рез = Истина;
	
	Если Тип = Тип("Булево") Тогда
		Рез = Ложь;
	ИначеЕсли Тип = Тип("Число") Тогда
		Рез = Ложь;
	ИначеЕсли Тип = Тип("Дата") Тогда
		Рез = Ложь;
	ИначеЕсли Тип = Тип("Строка") Тогда
		Рез = Ложь;
	ИначеЕсли Тип = Тип("УникальныйИдентификатор") Тогда
		Рез = Ложь;
	КонецЕсли;	
		
	Возврат Рез;
		
КонецФункции

// Определяет тип таблицы.
//
// Параметры:
//  ИмяТаблицы	 - Строка - имя тблицы.
// 
// Возвращаемое значение:
//  Неопределено, Тип - тип таблицы.
//
Функция ОпределитьТипТаблицы(ИмяТаблицы) Экспорт
	
	Возврат упоОповещенияПовтИсп.ОпределитьТипТаблицы(ИмяТаблицы);
		
КонецФункции

// Получает описание типа реквизита.
//
// Параметры:
//  ПолноеИмя	 - Строка	 - полное имя.
//  ИмяРеквизита - Строка	 - имя реквизита.
// 
// Возвращаемое значение:
//  Неопределено, Тип - тип реквизита.
//
Функция ПолучитьОписаниеТипаРеквизита(ПолноеИмя, ИмяРеквизита = "") Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьОписаниеТипаРеквизита(ПолноеИмя, ИмяРеквизита);	
	
КонецФункции

// См. упоОповещенияПовтИсп.ПолучитьОписаниеТипаРеквизитаИсточника
//
Функция ПолучитьОписаниеТипаРеквизитаИсточника(ПолноеИмяРеквизита, Источник = "") Экспорт
	
	Возврат упоОповещенияПовтИсп.ПолучитьОписаниеТипаРеквизитаИсточника(ПолноеИмяРеквизита,Источник);	
	
КонецФункции

// Добавляет элементы подписки.
//
// Параметры:
//  Форма				 - УправляемаяФорма
//  Объект				 - СправочникОбъект, ДокументОбъект
//  ВыбЭлементРодитель	 - СправочникСсылка
//  БезПроверкиПрав		 - Булево	 - признак отсутствия проверки прав.
//
Процедура ДобавитьЭлементыПодписки(Форма, Объект, ВыбЭлементРодитель = Неопределено, БезПроверкиПрав = Ложь) Экспорт
	
	Если НЕ упоОповещенияПовтИсп.ПолучитьИспользоватьСобытия() Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		Источник = Объект.Ссылка;
	Иначе
		Источник = Объект;
	КонецЕсли;
	
	МД = Источник.Метаданные();
	ПолноеИмяОбъекта = МД.ПолноеИмя();
	
	Если НЕ БезПроверкиПрав И НЕ ПравоДоступа("Изменение", МД) И Не ПравоДоступа("Редактирование", МД) Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзВидыСобытий = упоОповещенияПовтИсп.ПолучитьВидыСобытийДляПодписки(ПолноеИмяОбъекта, Источник);
	Если тзВидыСобытий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МасДобРеквизитов = Новый Массив;
	ИзменяетСохраняемыеДанные = Истина;
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("упоПодпискаНаОповещения", Новый ОписаниеТипов("ТаблицаЗначений"), , ,
		ИзменяетСохраняемыеДанные));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("ВидСобытия", Новый ОписаниеТипов("СправочникСсылка.упоВидыСобытий"),
		"упоПодпискаНаОповещения" ,"Вид события"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("Раздел", Новый ОписаниеТипов("Строка"),"упоПодпискаНаОповещения",
		"Раздел"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("ВидПолучателя",
		Новый ОписаниеТипов("СправочникСсылка.упоВидыПолучателейОповещений"),"упоПодпискаНаОповещения" ,"Вид получателя"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("Действует", Новый ОписаниеТипов("Булево"),"упоПодпискаНаОповещения",
		"Действует"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("Принудительное", Новый ОписаниеТипов("Булево"),
		"упоПодпискаНаОповещения", "Принудительное"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("ИмяЭлемента", Новый ОписаниеТипов("Строка"),
		"упоПодпискаНаОповещения", "ИмяЭлемента"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("ЗаголовокЭлемента", Новый ОписаниеТипов("Строка"),
		"упоПодпискаНаОповещения", "Заголовок элемента"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("Адрес", Новый ОписаниеТипов("Строка"),
		"упоПодпискаНаОповещения", "Адрес"));
	МасДобРеквизитов.Добавить(Новый РеквизитФормы("ХранениеАдреса", Новый ОписаниеТипов("Строка"),
		"упоПодпискаНаОповещения", "Хранение адреса"));

	Форма.ИзменитьРеквизиты(МасДобРеквизитов);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВтВидыСобытий ИЗ &тз КАК тз";
	Запрос.УстановитьПараметр("тз", тзВидыСобытий);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПодпискиНаОповещения.ВидСобытия,
	               |	упоПодпискиНаОповещения.ВидПолучателя,
	               |	упоПодпискиНаОповещения.Действует
	               |ПОМЕСТИТЬ ВтТекущаяПодписка
	               |ИЗ
	               |	РегистрСведений.упоПодпискиНаОповещения КАК упоПодпискиНаОповещения
	               |ГДЕ
	               |	упоПодпискиНаОповещения.Получатель = &Получатель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВтВидыСобытий.ВидСобытия,
	               |	ВтВидыСобытий.ВидСобытия.Родитель.Наименование КАК Раздел,
	               |	ВтВидыСобытий.ВидСобытия.Наименование КАК ЗаголовокЭлемента,
	               |	""упоПодпискаНаОповещения1000"" КАК ИмяЭлемента,
	               |	ВтВидыСобытий.ВидПолучателя,
				   |	ВтВидыСобытий.Принудительное КАК Принудительное,
				   |	ВЫБОР КОГДА ВтВидыСобытий.Принудительное ТОГДА ИСТИНА ИНАЧЕ
	               |	ЕСТЬNULL(ВтТекущаяПодписка.Действует, ЛОЖЬ) КОНЕЦ КАК Действует
	               |ИЗ
	               |	ВтВидыСобытий КАК ВтВидыСобытий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВтТекущаяПодписка КАК ВтТекущаяПодписка
	               |		ПО ВтВидыСобытий.ВидСобытия = ВтТекущаяПодписка.ВидСобытия
	               |			И ВтВидыСобытий.ВидПолучателя = ВтТекущаяПодписка.ВидПолучателя	
	               |УПОРЯДОЧИТЬ ПО
	               |	Раздел,
	               |	ЗаголовокЭлемента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыПолучателейОповещенийАдресаОтправки.Транспорт.Наименование КАК Транспорт,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.Транспорт КАК ТранспортСсылка,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.ПолеАдреса,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.ПолеАдресаХЗ,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.ВариантХраненияПоляАдреса,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.ОписаниеХраненияАдреса
	               |ИЗ
	               |	Справочник.упоВидыПолучателейОповещений.АдресаОтправки КАК упоВидыПолучателейОповещенийАдресаОтправки
	               |ГДЕ
	               |	упоВидыПолучателейОповещенийАдресаОтправки.Ссылка.ТаблицаПолучателя = &ТаблицаПолучателя
	               |	И НЕ упоВидыПолучателейОповещенийАдресаОтправки.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Получатель", Источник.Ссылка);
	Запрос.УстановитьПараметр("ТаблицаПолучателя", ПолноеИмяОбъекта);
	РезЗапроса = Запрос.ВыполнитьПакет();
	тзПодписки = РезЗапроса[1].Выгрузить();
	Сч = 0;
	ВидПолучателя = Неопределено;
	Для Каждого СтрТз Из тзПодписки Цикл
		
		Сч = Сч + 1;
		НовСтр = Форма.упоПодпискаНаОповещения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрТз);
		НовСтр.ИмяЭлемента = "упоПодпискаНаОповещения" + Формат(Сч,"ЧГ=0");
		ВидПолучателя = СтрТз.ВидПолучателя;
	КонецЦикла;
	
	ЭлементРодитель = Неопределено;
	
	Если ТипЗнч(ВыбЭлементРодитель) = Тип("ГруппаФормы") Тогда
		ЭлементРодитель = Форма.Элементы.Добавить("упоГруппаОповещения", Тип("ГруппаФормы"), ВыбЭлементРодитель);
		ЭлементРодитель.Заголовок = НСтр("ru = 'Подписки на оповещения'");
		ЭлементРодитель.ШрифтЗаголовка = ШрифтыСтиля.ОбычныйШрифтТекста;
		Если ВыбЭлементРодитель.Вид = ВидГруппыФормы.Страницы Тогда			
			ЭлементРодитель.Вид = ВидГруппыФормы.Страница;
		Иначе
			ЭлементРодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;	
		КонецЕсли;
		ЭлементРодитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;

	Если ЭлементРодитель = Неопределено Тогда
		ЭлементРодитель = Форма;
	КонецЕсли;
	
	ДекарацияЗаголовокАдресов = Форма.Элементы.Добавить("упоПодсказкаАдреса", Тип("ДекорацияФормы"),ЭлементРодитель);
	ДекарацияЗаголовокАдресов.Заголовок = НСтр("ru = 'Адреса для отправки оповещений:'");
	ДекарацияЗаголовокАдресов.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	
	СчАдресов = 0;
	СообщениеОбОшибках = "";
	ВыборкаАдреса = РезЗапроса[2].Выбрать();
	Пока ВыборкаАдреса.Следующий() Цикл
		
		СчАдресов = СчАдресов + 1;
		
		ТекАдрес = ВычислитьАдресПолучателя(Объект.Ссылка,ПолноеИмяОбъекта,ВидПолучателя,
									ВыборкаАдреса.ВариантХраненияПоляАдреса,ВыборкаАдреса.ПолеАдреса,ВыборкаАдреса.ПолеАдресаХЗ,СообщениеОбОшибках);
										
		Если ПустаяСтрока(ВыборкаАдреса.ОписаниеХраненияАдреса) Тогда
			ХранениеАдреса = НСтр("ru = 'Хранение адреса: '") + ВыборкаАдреса.ПолеАдреса;
		Иначе
			ХранениеАдреса = СокрЛП(ВыборкаАдреса.ОписаниеХраненияАдреса);
		КонецЕсли;
		
		ГруппаАдрес = Форма.Элементы.Добавить("упоГруппаАдресОповещения"+Формат(СчАдресов,"ЧГ=0"), Тип("ГруппаФормы"), ЭлементРодитель);
		ГруппаАдрес.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаАдрес.ОтображатьЗаголовок = Ложь;
		ГруппаАдрес.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаАдрес.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
		ДекарацияТранспорт = Форма.Элементы.Добавить("упоТранспортОповещения" + Формат(СчАдресов,"ЧГ=0"), Тип("ДекорацияФормы"),ГруппаАдрес);
		ДекарацияТранспорт.Заголовок = СокрЛП(ВыборкаАдреса.Транспорт) + ": ";
				
		ДекарацияАдрес = Форма.Элементы.Добавить("упоАдресОповещения" + Формат(СчАдресов,"ЧГ=0"), Тип("ДекорацияФормы"),ГруппаАдрес);
		ДекарацияАдрес.Заголовок = "" + ТекАдрес + ", ";
		ДекарацияАдрес.ЦветТекста = Новый Цвет(0,0,255);
		
		ДекарацияХранениеАдреса = Форма.Элементы.Добавить("упоХранениеАдресаОповещения" + Формат(СчАдресов,"ЧГ=0"), Тип("ДекорацияФормы"),ГруппаАдрес);
		ДекарацияХранениеАдреса.Заголовок = ХранениеАдреса;
		
	КонецЦикла;

	ТаблицаФормы = Форма.Элементы.Добавить("упоТабВидыСобытий", Тип("ТаблицаФормы"),ЭлементРодитель); 
	//ТаблицаФормы = Форма.Элементы.Добавить("упоТабВидыСобытий", Тип("ТаблицаФормы"),Форма); 
	ТаблицаФормы.ПутьКДанным = "упоПодпискаНаОповещения"; 
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет; 
	
	НоваяКолонка = Форма.Элементы.Добавить("Действует", Тип("ПолеФормы"), Форма.Элементы.упоТабВидыСобытий); 
	НоваяКолонка.Заголовок = "Действует"; 
	НоваяКолонка.ПутьКДанным = "упоПодпискаНаОповещения.Действует"; 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;

	НоваяКолонка = Форма.Элементы.Добавить("ВидСобытия", Тип("ПолеФормы"), Форма.Элементы.упоТабВидыСобытий); 
	НоваяКолонка.Заголовок = "Событие"; 
	НоваяКолонка.ПутьКДанным = "упоПодпискаНаОповещения.ЗаголовокЭлемента"; 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ТолькоПросмотр = Истина;
	НоваяКолонка.АвтоВысотаЯчейки = Истина;
	
	НоваяКолонка = Форма.Элементы.Добавить("Раздел", Тип("ПолеФормы"), Форма.Элементы.упоТабВидыСобытий); 
	НоваяКолонка.Заголовок = "Раздел"; 
	НоваяКолонка.ПутьКДанным = "упоПодпискаНаОповещения.Раздел"; 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ТолькоПросмотр = Истина;
	НоваяКолонка.АвтоВысотаЯчейки = Истина;	
	
	НоваяКолонка = Форма.Элементы.Добавить("Принудительное", Тип("ПолеФормы"), Форма.Элементы.упоТабВидыСобытий); 
	НоваяКолонка.Заголовок = "Принудительное"; 
	НоваяКолонка.ПутьКДанным = "упоПодпискаНаОповещения.Принудительное"; 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
	НоваяКолонка.ТолькоПросмотр = Истина;	
	
	НовыйЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("упоПодпискаНаОповещения.Принудительное");
	НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементУООтбор.ПравоеЗначение = Истина;
	
	НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Действует");
	
	// Баг веб-клиента на 8.3.9.2033: программное добавление группы или таблицы в группу или на страницу 
	// вызывает ошибку создания формы, если нет завершающего элемента, добавленного на форму.	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		НадписьВебКлиент = Форма.Элементы.Добавить("упоЭтоВебКлиент", Тип("ДекорацияФормы"));		
		НадписьВебКлиент.Видимость = Ложь;
	КонецЕсли;	
			
КонецПроцедуры 

// Сохраняет подписку.
//
// Параметры:
//  Форма	 - УправляемаяФорма
//  Объект	 - Произвольный	 - объект.
//
Процедура СохранитьПодписку(Форма, Объект) Экспорт

	Если Не упоОповещенияПовтИсп.ПолучитьИспользоватьСобытия() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	
	ЕстьРеквизит = Ложь;
	Для Каждого Эл Из РеквизитыФормы Цикл
		Если Эл.Имя = "упоПодпискаНаОповещения" Тогда
			ЕстьРеквизит = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьРеквизит Тогда
		Возврат;
	КонецЕсли;	
	
	ТЗ = Форма.упоПодпискаНаОповещения.Выгрузить(, "ВидСобытия, ВидПолучателя,Действует");
	ТЗ.Колонки.Добавить("Получатель");
	ТЗ.ЗаполнитьЗначения(Объект.Ссылка, "Получатель");
	
	НЗ = РегистрыСведений.упоПодпискиНаОповещения.СоздатьНаборЗаписей();
	НЗ.Отбор.Получатель.Установить(Объект.Ссылка);
	НЗ.Очистить();
	
	НЗ.Загрузить(ТЗ);
	НЗ.Записать(Истина);
	
КонецПроцедуры

// Получает объект ДокументHTML из текста HTML.
//
// Параметры:
//  ТекстHTML	 - Строка
//  Кодировка	 - Строка
// 
// Возвращаемое значение:
//  ДокументHTML - созданный документ HTML.
//
Функция ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстHTML,Кодировка = Неопределено) Экспорт
	
	Построитель = Новый ПостроительDOM;
	ЧтениеHTML = Новый ЧтениеHTML;
	
	НовыйТекстHTML = ТекстHTML;
	ПозицияОткрытиеXML = Найти(НовыйТекстHTML,"<?xml");
	
	Если ПозицияОткрытиеXML > 0 Тогда
		
		ПозицияЗакрытиеXML = Найти(НовыйТекстHTML,"?>");
		Если ПозицияЗакрытиеXML > 0 Тогда
			
			НовыйТекстHTML = ЛЕВ(НовыйТекстHTML,ПозицияОткрытиеXML - 1) + ПРАВ(НовыйТекстHTML,СтрДлина(НовыйТекстHTML) - ПозицияЗакрытиеXML -1);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Кодировка = Неопределено Тогда
		ЧтениеHTML.УстановитьСтроку(ТекстHTML);
	Иначе
		ЧтениеHTML.УстановитьСтроку(ТекстHTML, Кодировка);
	КонецЕсли;
	
	Возврат Построитель.Прочитать(ЧтениеHTML);
	
КонецФункции

// Заменяет имена картинок в документ HTML на идентификаторы почтовых вложений.
//
// Параметры:
//  ДокументHTML - ДокументHTML - документ HTML в котором будет выполняться замена.
//  ТаблицаСоответствий - ТаблицаЗначений - таблица соответствий имен файлов и идентификаторов.
//
Процедура ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML(ДокументHTML, ТаблицаСоответствий) Экспорт
	
	Для каждого Картинка Из ДокументHTML.Картинки Цикл
		
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		
		НайденнаяСтрока = ТаблицаСоответствий.Найти(АтрибутИсточникКартинки.ТекстовоеСодержимое,"ИмяФайла");
		Если НайденнаяСтрока <> Неопределено Тогда
			
			НовыйАтрибутКартинки = АтрибутИсточникКартинки.КлонироватьУзел(Ложь);
			НовыйАтрибутКартинки.ТекстовоеСодержимое = Строка("cid:"+НайденнаяСтрока.ИдентификаторФайлаДляHTML);
			Картинка.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибутКартинки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Получает текст HTML из объекта ДокументHTML.
//
// Параметры:
//  ДокументHTML  - ДокументHTML - документ, из которого будет извлекаться текст.
//
// Возвращаемое значение:
//   Строка   - текст HTML.
//
Функция ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML) Экспорт
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(ДокументHTML,ЗаписьHTML);
	Возврат ЗаписьHTML.Закрыть();
	
КонецФункции

// Обрабатывает текст HTML для помещения в форматированный документ.
//
// Параметры:
//  Письмо				 - Произвольный - ДокументСсылка.ЭлектронноеПисьмоВходящее,
//  			ДокументСсылка.ЭлектронноеПисьмоИсходящее: письмо для которого будет проведена оценка.
//  ТекстHTML			 - Строка	 - обрабатываемый текст HTML.
//  СтруктураВложений	 - Структура - структура в которую помещаются картинки - вложения письма.
// 
// Возвращаемое значение:
//  Число - оценка размера письма в байтах.
//
Функция ОбработатьТекстHTMLДляФорматированногоДокумента(Письмо, ТекстHTML, СтруктураВложений) Экспорт
	
	Если Не ПустаяСтрока(ТекстHTML) Тогда
		
		ДокументHTML = ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекстHTML);

		Возврат ТекстHTML;
			
	Иначе
		
		Возврат ТекстHTML;
		
	КонецЕсли;
	
КонецФункции

// Обработчик оповещения "При записи" документа.
//
// Параметры:
//  Источник - Произвольный	 - не используется.
//  Отказ	 - Произвольный	 - не используется.
//
Процедура упоОповещенияПриЗаписиДокумента(Источник, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Отработка регламентного задания.
//
// Параметры:
//  ВидСобытия	 - СправочникСсылка.упоВидыСобытий
//
Процедура упоОбработкаПроизошедшихСобытийСПараметрами(ВидСобытия = Неопределено) Экспорт
	
	Если НЕ упоОповещенияПовтИсп.ИспользоватьОповещения() Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	КэшПолучателей = Новый Соответствие;
	ТранспортПолучателей = Новый Соответствие;
	НедоступныеТранспортыОтправкиОповещений = НедоступныеТранспортыОтправкиОповещенийПроверкаИТС();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыПолучателейОповещенийАдресаОтправки.Ссылка КАК ВидПолучателя,
	               |	упоВидыПолучателейОповещенийАдресаОтправки.Транспорт КАК Транспорт
	               |ИЗ
	               |	Справочник.упоВидыПолучателейОповещений.АдресаОтправки КАК упоВидыПолучателейОповещенийАдресаОтправки
	               |ГДЕ
	               |	НЕ упоВидыПолучателейОповещенийАдресаОтправки.Транспорт.Ссылка В (&НедоступныеТранспортыОтправкиОповещений)
	               |	И НЕ упоВидыПолучателейОповещенийАдресаОтправки.Транспорт.ПометкаУдаления
	               |	И НЕ упоВидыПолучателейОповещенийАдресаОтправки.Ссылка.ПометкаУдаления
	               |ИТОГИ ПО
	               |	ВидПолучателя";
	Запрос.УстановитьПараметр("НедоступныеТранспортыОтправкиОповещений", НедоступныеТранспортыОтправкиОповещений);
	ВыборкаВиды = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВиды.Следующий() Цикл
		ТранспортПолучателей.Вставить(ВыборкаВиды.ВидПолучателя, Новый Массив);
		Выборка = ВыборкаВиды.Выбрать();
		Пока Выборка.Следующий() Цикл
			текМассив = ТранспортПолучателей.Получить(ВыборкаВиды.ВидПолучателя);
			текМассив.Добавить(Выборка.Транспорт);
		КонецЦикла;
	КонецЦикла;
	
 	ДопПараметры = Новый Структура("Отправить,СообщениеОбОшибках,УИсобытия,Автор",Ложь,"");
	
	Пока Истина Цикл // В цикле получаем порциями по 100 необработанные события, пока есть что обрабатывать.
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 100
			|	ПроизошедшиеСобытия.Автор КАК Автор,
			|	ПроизошедшиеСобытия.ВидСобытия КАК ВидСобытия,
			|	ПроизошедшиеСобытия.Дата КАК Дата,
			|	ПроизошедшиеСобытия.Источник КАК Источник,
			|	ПроизошедшиеСобытия.ИсточникДопПараметр КАК ИсточникДопПараметр,
			|	ПроизошедшиеСобытия.КонтекстСобытия КАК КонтекстСобытия,
			|	ПроизошедшиеСобытия.Ссылка КАК Ссылка,
			|	ПроизошедшиеСобытия.КоличествоПопытокОбработки КАК КоличествоПопытокОбработки,
			|	ПроизошедшиеСобытия.ПометкаУдаления КАК ПометкаУдаления,
			|	ПроизошедшиеСобытия.ВидСобытия.СрокХраненияСобытий КАК СрокХраненияСобытий,
			|	ПроизошедшиеСобытия.ВидСобытия.Принудительное КАК Принудительное
			|ИЗ
			|	Справочник.упоПроизошедшиеСобытия КАК ПроизошедшиеСобытия
			|ГДЕ
			|	ПроизошедшиеСобытия.Обработано = ЛОЖЬ
			|	И ПроизошедшиеСобытия.КоличествоПопытокОбработки < 3
			|	И НЕ ПроизошедшиеСобытия.ПометкаУдаления
			|	И (&ВидСобытия = НЕОПРЕДЕЛЕНО
			|			ИЛИ ПроизошедшиеСобытия.ВидСобытия = &ВидСобытия)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПроизошедшиеСобытия.Дата";
					   
		Таблица = Запрос.Выполнить().Выгрузить();	
		Если Таблица.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;	
		
		Для Каждого Строка Из Таблица Цикл
			
			Событие_УИД = Строка.Ссылка.УникальныйИдентификатор();
			
			ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(Строка.ВидСобытия);
			
			ТаблицаПолучателей = ПолучитьТаблицуПолучателейДляПроизошедшегоСобытия(Строка.ВидСобытия, Строка.Источник, 
																						Строка.ИсточникДопПараметр, КэшПолучателей,
																						ПараметрыВыполненияКода);
			
			ДопПараметры.СообщениеОбОшибках = "";
			ДопПараметры.УИсобытия = Событие_УИД;
			ДопПараметры.Автор = Строка.Автор;			
			
			НачатьТранзакцию();			
			
			Попытка
				
				Для Каждого ДанныеПолучателя Из ТаблицаПолучателей Цикл
					
					ТранспортПолучателя = ТранспортПолучателей.Получить(ДанныеПолучателя.ВидПолучателя);
					Если ТранспортПолучателя.Найти(ДанныеПолучателя.Транспорт) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ДобавитьСообщение(Строка.ВидСобытия,
					Строка.Источник,
					Строка.ИсточникДопПараметр,
					ДанныеПолучателя.ВидПолучателя,
					ДанныеПолучателя.Получатель,
					ДанныеПолучателя.Транспорт,
					ДопПараметры,
					ПараметрыВыполненияКода);															
					
				КонецЦикла;	
				
				Объект = Строка.Ссылка.ПолучитьОбъект();
				Объект.Обработано = Истина;
				Объект.Записать();
				
				ЗафиксироватьТранзакцию();			
				
			Исключение
				
				ОтменитьТранзакцию();
				
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(НСтр("ru='Обработка событий'"), УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.упоПроизошедшиеСобытия, Строка.Ссылка, СообщениеОбОшибке);
				
				Попытка
					СобытиеОбъект = Строка.Ссылка.ПолучитьОбъект();
					СобытиеОбъект.КоличествоПопытокОбработки = СобытиеОбъект.КоличествоПопытокОбработки + 1;
					СобытиеОбъект.Ошибка = СообщениеОбОшибке; 
					СобытиеОбъект.Записать();
				Исключение 
					СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписьЖурналаРегистрации(НСтр("ru='Обработка событий'"), УровеньЖурналаРегистрации.Ошибка, 
					Метаданные.Справочники.упоПроизошедшиеСобытия, Строка.Ссылка, СообщениеОбОшибке);
				КонецПопытки;	
				
			КонецПопытки;
			
			Если Не ПустаяСтрока(ДопПараметры.СообщениеОбОшибках) Тогда
				ЗаписьЖурналаРегистрации(НСтр("ru='Обработка событий'"), УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.упоПроизошедшиеСобытия, Строка.Ссылка, ДопПараметры.СообщениеОбОшибках);	
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;		
		
	// Удаление уже обработанных бизнес-событий.
	
	// СрокХраненияБизнесСобытий - измеряется в днях.
	СрокХраненияСобытий = Константы.упоСрокХраненияСобытий.Получить(); 
	
	// СрокХраненияБизнесСобытий умножаем на 86400 (сек в сутках) и делим на 10
	// - т.к. с периодом в 1/10 срока хранения делаем очистку.
	ПериодОчистки = СрокХраненияСобытий * 86400 / 10;
	
	ДатаПоследнейОчисткиСобытий = Константы.упоДатаПоследнейОчисткиСобытий.Получить();
	
	НужнаОчистка = Ложь;
	Если ДатаПоследнейОчисткиСобытий = Дата("00010101000000") Тогда
		НужнаОчистка = Истина;
	Иначе
		Если ТекущаяДата() - ДатаПоследнейОчисткиСобытий > ПериодОчистки Тогда
			НужнаОчистка = Истина;
		КонецЕсли;		
	КонецЕсли;	
	
	Если НужнаОчистка Тогда
		
		// СрокХраненияБизнесСобытий умножаем на 86400 (сек в сутках).
		ДатаОтсечения = ТекущаяДата() - СрокХраненияСобытий * 86400; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоПроизошедшиеСобытия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.упоПроизошедшиеСобытия КАК упоПроизошедшиеСобытия
		|ГДЕ
		|	(упоПроизошедшиеСобытия.Обработано = ИСТИНА
		|	И упоПроизошедшиеСобытия.Дата < &ДатаОтсечения) ИЛИ упоПроизошедшиеСобытия.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	упоПроизошедшиеСобытия.Дата";
		
		Запрос.УстановитьПараметр("ДатаОтсечения", ДатаОтсечения);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаблокироватьДанныеДляРедактирования(Выборка.Ссылка);
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
			РазблокироватьДанныеДляРедактирования(Выборка.Ссылка);
		КонецЦикла;
		
		Константы.упоДатаПоследнейОчисткиСобытий.Установить(ТекущаяДата());
		
	КонецЕсли;
	
	//
	
	РегЗаданиеРассылки = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(Метаданные.РегламентныеЗадания.упоОтправкаСообщенийИзОчереди);
	РегламентныеЗаданияСлужебный.ВыполнитьРегламентноеЗаданиеВручную(РегЗаданиеРассылки);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПараметрыВыбораПроектныхЗадачИПроекта(Источник, ЭлементИсточникСсылка) Экспорт

	Если Источник = "Справочник.Проекты" Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый ПараметрВыбора("ВыбиратьЗадачиИПроекты", Истина));
		МассивПараметров.Добавить(Новый ПараметрВыбора("РежимВыбора", Истина));
		ЭлементИсточникСсылка.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);				
	КонецЕсли;	

КонецПроцедуры

Функция НедоступныеТранспортыОтправкиОповещенийПроверкаИТС() Экспорт
	
	НедоступныеТранспорты = Новый Массив;
	
	ДанныеПроверкиДоговораСопровождения = упоФункцииЗащитыСервер.ДанныеПроверкиДоговораСопровождения();
	Если ДанныеПроверкиДоговораСопровождения.УсловияДоговораСопровожденияВыполнены Тогда
		Возврат НедоступныеТранспорты;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   упоТранспортОповещений.Ссылка КАК Ссылка
		|ИЗ
		|   Справочник.упоТранспортОповещений КАК упоТранспортОповещений
		|ГДЕ
		|   упоТранспортОповещений.ИмяМодуляОтправкиСообщений ПОДОБНО &ИмяМодуляОтправкиСообщений";
	
	Запрос.УстановитьПараметр("ИмяМодуляОтправкиСообщений", "упоОтправкаСообщенийПоTelegram");
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НедоступныеТранспорты.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат НедоступныеТранспорты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НачальноеЗаполнение

Функция ДобавитьТранспортВПредопределенныйВидСобытия(ВидСобытияОбъект)
	
	ТекущееСостояние = ВидСобытияОбъект.ТранспортОповещений.Выгрузить();
	
	ИспользованиеТранспортаПоУмолчанию = ИспользованиеТранспортаПоУмолчанию();
	
	Для Каждого КлючЗначение Из ИспользованиеТранспортаПоУмолчанию Цикл
		
		Если ТекущееСостояние.Найти(КлючЗначение.Ключ, "Транспорт")= Неопределено Тогда
			Транспорт = ВидСобытияОбъект.ТранспортОповещений.Добавить();
			Транспорт.Используется = КлючЗначение.Значение;
			Транспорт.Транспорт = КлючЗначение.Ключ;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции 

Функция ИспользованиеТранспортаПоУмолчанию()
	
	ИспользованиеТранспортаПоУмолчанию = Новый Соответствие;
	ИспользованиеТранспортаПоУмолчанию.Вставить(Справочники.упоТранспортОповещений.SMS, 		Ложь);
	ИспользованиеТранспортаПоУмолчанию.Вставить(Справочники.упоТранспортОповещений.Email, 		Истина);
	ИспользованиеТранспортаПоУмолчанию.Вставить(Справочники.упоТранспортОповещений.Задания, 	Ложь);
	ИспользованиеТранспортаПоУмолчанию.Вставить(Справочники.упоТранспортОповещений.Telegram, 	Ложь);
	
	Возврат ИспользованиеТранспортаПоУмолчанию;
	
КонецФункции

#КонецОбласти

Функция ОбработкаСобытияДопустима(Источник) 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Результат = Ложь;
	ИначеЕсли Не упоОповещенияПовтИсп.ИспользоватьОповещения() Тогда
		Результат = Ложь;
	ИначеЕсли Источник.ДополнительныеСвойства.Свойство("упоИгнорироватьОповещения") 
	И Источник.ДополнительныеСвойства.упоИгнорироватьОповещения Тогда 
	 	Результат = Ложь;
	Иначе		
		Результат = Истина;	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Процедура ОпределитьВариантИзмененияПередЗаписью(Источник, масВариантыИзменения, пРежимЗаписиДокумента = Неопределено)
	
	Если РежимЗаписиДокумента <> Неопределено Тогда
		
		Если пРежимЗаписиДокумента = РежимЗаписиДокумента.Проведение Тогда
			
			масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.Проведение);
			Если Источник.Ссылка.Пустая() Тогда
				масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ПроведениеНового);			
			Иначе
				масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.Перепроведение);	
			КонецЕсли;
			
		ИначеЕсли пРежимЗаписиДокумента = РежимЗаписиДокумента.ОтменаПроведения Тогда
			
			масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ОтменаПроведения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПометкаУдаленияДоЗаписи = (НЕ Источник.Ссылка.Пустая()) 
							  И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПометкаУдаления");
	
	Если Источник.ПометкаУдаления И НЕ ПометкаУдаленияДоЗаписи Тогда
		масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ПометкаОбъектаНаУдаление);
	ИначеЕсли НЕ Источник.ПометкаУдаления И ПометкаУдаленияДоЗаписи Тогда
		масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.СнятиеПометкиНаУдалениеСОбъекта);	
	Иначе
		масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьОбъекта);	
		Если Источник.Ссылка.Пустая() Тогда
			масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьНовогоОбъекта);			
		Иначе
			масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьСуществующегоОбъекта);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьВариантИзмененияПередЗаписьюВРегистр(Источник, масВариантыИзменения)
	
	масВариантыИзменения.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьВРегистр);
	
КонецПроцедуры

Процедура ЗарегистрироватьСобытияПриЗаписи(ОбъектИсточник)
	
	УстановитьПривилегированныйРежим(Истина);

	ЭтоРегистр = ОбъектИсточник.ДополнительныеСвойства.Свойство("ЭтоРегистр") И ОбъектИсточник.ДополнительныеСвойства.ЭтоРегистр;
	
	соотвВидыСобытий = Неопределено;
	Если ОбъектИсточник.ДополнительныеСвойства.Свойство("упоВидыСобытий", соотвВидыСобытий) Тогда
		соотвУсловияСобытий = ОбъектИсточник.ДополнительныеСвойства.упоУсловияСобытий;
		Для Каждого Эл Из соотвВидыСобытий Цикл
			
			ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(Эл.Ключ);
			КодОпределенияДопПараметра = ОбъектИсточник.ДополнительныеСвойства.упоКодОпределенияДопПараметров.Получить(Эл.Ключ); 
						
			УсловияСобытия = соотвУсловияСобытий.Получить(Эл.Ключ); 
			
			МассивДопПараметровИсточника = ПолучитьМассивДопПараметровИсточника(Эл.Ключ, КодОпределенияДопПараметра, ОбъектИсточник, 
																											ПараметрыВыполненияКода);
																											
			Для Каждого ИсточникДопПараметр Из МассивДопПараметровИсточника Цикл																								
																											
				Если ПроверитьУсловияРегистрацииСобытияДляОбъекта(ОбъектИсточник, ИсточникДопПараметр, Эл.Ключ, Эл.Значение.ПолноеИмяОбъекта, 
																		Эл.Значение.ЛогикаПримененияУсловий, УсловияСобытия, 
																			ОбъектИсточник.ДополнительныеСвойства, ПараметрыВыполненияКода) Тогда
					
					Если ЭтоРегистр Тогда
						Справочники.упоПроизошедшиеСобытия.ЗарегистрироватьСобытие(Эл.Ключ,, ИсточникДопПараметр, Эл.Значение.ПолноеИмяОбъекта);
					Иначе
						Справочники.упоПроизошедшиеСобытия.ЗарегистрироватьСобытие(Эл.Ключ, ОбъектИсточник.Ссылка, ИсточникДопПараметр);	
					КонецЕсли;
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ВычислитьАдресПолучателя(Получатель, ТаблицаПолучателя, ВидПолучателя, ВариантХраненияПоляАдреса, ПолеАдреса,
	ПолеАдресаХЗ, СообщениеОбОшибках = "")
	
	ТекАдрес = "";
	
	Если ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВПолучателе Тогда
		
		Попытка
			ТекАдрес = Получатель[ПолеАдреса];
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление адреса получателя'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыПолучателейОповещений, ВидПолучателя, СообщениеОбОшибке);
			СообщениеОбОшибках = СообщениеОбОшибках + СообщениеОбОшибке + Символы.ПС;
			ТекАдрес = "";	
		КонецПопытки;
		
	ИначеЕсли ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВКонтИнформацииПолучателя Тогда
		
		ПолеАдресаПараметры = ПолеАдресаХЗ.Получить();
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтИнфо.Адрес КАК Адрес
			|ИЗ
			|	Справочник.Пользователи КАК ТаблицаПолучателя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтИнфо КАК КонтИнфо
			|		ПО ТаблицаПолучателя.Ссылка = КонтИнфо.Объект
			|ГДЕ
			|	ИСТИНА
			|	И ТаблицаПолучателя.Ссылка = &Получатель
			|	И КонтИнфо.ВидКонтИнфо = &ЗначениеУсловия";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,".Адрес","."+ПолеАдресаПараметры.ПолеАдреса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Справочник.Пользователи",ТаблицаПолучателя);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РегистрСведений.КонтИнфо",ПолеАдресаПараметры.ИмяТаблицы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"КонтИнфо.Объект","КонтИнфо." + ПолеАдресаПараметры.ПолеСвязи);
		Если ПолеАдресаПараметры.Свойство("ПолеУсловия") И ЗначениеЗаполнено(ПолеАдресаПараметры.ПолеУсловия) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"КонтИнфо.ВидКонтИнфо","КонтИнфо." + ПолеАдресаПараметры.ПолеУсловия);
			Запрос.УстановитьПараметр("ЗначениеУсловия",ПолеАдресаПараметры.ЗначениеУсловия);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И КонтИнфо.ВидКонтИнфо = &ЗначениеУсловия","");
		КонецЕсли;
		Запрос.УстановитьПараметр("Получатель",Получатель);
		Запрос.Текст = ТекстЗапроса;
		
		Попытка 
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекАдрес = Выборка.Адрес;	
			КонецЕсли;
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление адреса получателя'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыПолучателейОповещений, ВидПолучателя, СообщениеОбОшибке);
			СообщениеОбОшибках = СообщениеОбОшибках + СообщениеОбОшибке + Символы.ПС;
			ТекАдрес = "";	
		КонецПопытки;
		
	ИначеЕсли ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВКонтИнформацииКонтЛицаПолучателя Тогда	
		
		ПолеАдресаПараметры = ПолеАдресаХЗ.Получить();
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КонтИнфо.Адрес КАК Адрес
			|ИЗ
			|	Справочник.Пользователи КАК ТаблицаПолучателя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтЛица КАК КонтЛица
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтИнфо КАК КонтИнфо
			|			ПО КонтЛица.Ссылка = КонтИнфо.Объект
			|		ПО ТаблицаПолучателя.Ссылка = КонтЛица.Объект
			|ГДЕ
			|	ИСТИНА
			|	И ТаблицаПолучателя.Ссылка = &Получатель
			|	И КонтЛица.ПометкаУдаления = &ЗначениеУсловияКонтЛицо
			|	И КонтИнфо.ВидКонтИнфо = &ЗначениеУсловия";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,".Адрес","."+ПолеАдресаПараметры.ПолеАдреса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Справочник.Пользователи",ТаблицаПолучателя);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РегистрСведений.КонтИнфо",ПолеАдресаПараметры.ИмяТаблицы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"КонтИнфо.Объект","КонтИнфо." + ПолеАдресаПараметры.ПолеСвязи);
		Если ПолеАдресаПараметры.Свойство("ПолеУсловия") И ЗначениеЗаполнено(ПолеАдресаПараметры.ПолеУсловия) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"КонтИнфо.ВидКонтИнфо","КонтИнфо." + ПолеАдресаПараметры.ПолеУсловия);
			Запрос.УстановитьПараметр("ЗначениеУсловия",ПолеАдресаПараметры.ЗначениеУсловия);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И КонтИнфо.ВидКонтИнфо = &ЗначениеУсловия","");
		КонецЕсли;
		Запрос.УстановитьПараметр("Получатель",Получатель);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Справочник.КонтЛица",ПолеАдресаПараметры.ИмяТаблицыКонтЛицо);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"КонтЛица.Объект","КонтЛица." + ПолеАдресаПараметры.ПолеСвязиКонтЛицо);
		Если ПолеАдресаПараметры.Свойство("ПолеУсловияКонтЛицо") И ЗначениеЗаполнено(ПолеАдресаПараметры.ПолеУсловияКонтЛицо) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"КонтЛица.ПометкаУдаления","КонтИнфо." + ПолеАдресаПараметры.ПолеУсловияКонтЛицо);
			Запрос.УстановитьПараметр("ЗначениеУсловияКонтЛицо",ПолеАдресаПараметры.ЗначениеУсловияКонтЛицо);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И КонтЛица.ПометкаУдаления = &ЗначениеУсловияКонтЛицо","");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		Попытка 
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекАдрес = Выборка.Адрес;	
			КонецЕсли;
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Вычисление адреса получателя'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыПолучателейОповещений, ВидПолучателя, СообщениеОбОшибке);
			СообщениеОбОшибках = СообщениеОбОшибках + СообщениеОбОшибке + Символы.ПС;
			ТекАдрес = "";	
		КонецПопытки;
		
	ИначеЕсли ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВРегистреСоответствияИД Тогда
		
		ТекАдрес = упоРаботаCTelegram.ИД_ПользователяTelegramПоПользователю1С(Получатель);		
		
	КонецЕсли;
	
	Возврат ТекАдрес;
	
КонецФункции

Процедура ДобавитьВидыСобытийВДопСвойстваОбъекта(Источник, масВариантыИзменения)
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();

	СтруктураВариантыИзменения = Новый Структура;
	сч = 1;
	Для Каждого ВариантИзменения Из масВариантыИзменения Цикл
		СтруктураВариантыИзменения.Вставить("п"+сч, ВариантИзменения);	
		сч = сч + 1;
	КонецЦикла;
	
	ВидыСобытийДанные = упоОповещенияПовтИсп.ПолучитьВидыСобытийВДопСвойстваОбъекта(ПолноеИмя, СтруктураВариантыИзменения);
		
	Если ВидыСобытийДанные.упоВидыСобытий.Количество() > 0 Тогда
		Источник.ДополнительныеСвойства.Вставить("упоВидыСобытий", ВидыСобытийДанные.упоВидыСобытий);
		Источник.ДополнительныеСвойства.Вставить("упоКодОпределенияДопПараметров", ВидыСобытийДанные.упоКодОпределенияДопПараметров);
		Источник.ДополнительныеСвойства.Вставить("упоУсловияСобытий", ВидыСобытийДанные.упоУсловияСобытий);	
		Если ВидыСобытийДанные.НужныПредЗначения Тогда
			Источник.ДополнительныеСвойства.Вставить("упоДанныеДоИзменения", ПолучитьДанныеОбъектаПоСсылке(Источник.Ссылка));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеОбъектаПоСсылке(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ "+Ссылка.Метаданные().ПолноеИмя() + " КАК Таблица 
	| ГДЕ Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() Тогда
		Результат = Новый Структура;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Результат.Вставить(Колонка.Имя);
		КонецЦикла;		
		ЗаполнитьЗначенияСвойств(Результат, Таблица[0]);
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

Функция ПроверитьУсловияРегистрацииСобытияДляОбъекта(ИсточникСсылкаОбъект, ИсточникДопПараметр, ВидСобытия, ПолноеИмяОбъекта,
	ЛогикаПримененияУсловий, УсловияСобытия, ДополнительныеСвойства = Неопределено, ПараметрыВыполненияКода = Неопределено)
	
	Если УсловияСобытия.Количество() = 0 Тогда
		// Уловий нет, событие регистрируется в любом случае.
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыВыполненияКода = Неопределено Тогда
		ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(ВидСобытия);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Таб.Ссылка
					|ИЗ
					|	Справочник.Пользователи КАК Таб
					|ГДЕ
					|	Таб.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Справочник.Пользователи", ПолноеИмяОбъекта);
	
	УсловиеЗапроса = "";
	ТекстСоединений = "";
	Если ЛогикаПримененияУсловий = Перечисления.упоЛогическиеОператоры.И Тогда
		ОператорОбъединения = " и ";
	Иначе
		ОператорОбъединения = " или ";
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Массив;
	Ключи = "Имя,Значение,ЭтоПодобно";
	РезультатыУсловий = Новый Массив;
	
	Попытка
		ИсточникСсылка = ИсточникСсылкаОбъект.Ссылка;
		ОбъектИмеетСсылку = Истина;
	Исключение
		ИсточникСсылка = Неопределено;
		ОбъектИмеетСсылку = Ложь;
	КонецПопытки;;
	
	СчУсловийЗапроса = 0;
	СчИспКода = 0;
	Для Каждого Эл Из УсловияСобытия Цикл
		
		Если Эл.ПроверкаПоКоду Тогда
			
			СчИспКода = СчИспКода + 1;
			
			Результат = Ложь; 
			ПараметрыВозврата = Новый Структура;
			
			Если ДополнительныеСвойства <> Неопределено И ДополнительныеСвойства.Свойство("упоДанныеДоИзменения") Тогда
				ДанныеДоИзменения = ДополнительныеСвойства.упоДанныеДоИзменения;
			Иначе
				ДанныеДоИзменения = Неопределено;
			КонецЕсли;
			
			Попытка
				ВыполнитьКод(Эл.ВыполняемыйКод, Результат, ПараметрыВозврата, ИсточникСсылкаОбъект, 
											ИсточникДопПараметр, ДанныеДоИзменения, ПараметрыВыполненияКода);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(НСтр("ru='Обработка условий регистрации событий'"), УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
				Результат = Ложь;	
			КонецПопытки;
			
			ДобавитьРезультатаВыполненияУсловия(РезультатыУсловий,Результат);
			
		ИначеЕсли Лев(Эл.РеквизитОбъекта,12) = "Вычисляемый." Тогда
			
			Результат = ПроверитьВычисляемыйРеквизитНаУсловие(ПолноеИмяОбъекта,
																Сред(Эл.РеквизитОбъекта,13),
																ВидСобытия,
																Эл.ВидСравнения,
																Эл.ЗначениеУсловия.Получить(),
																ИсточникСсылкаОбъект,
																ИсточникДопПараметр,
																ПараметрыВыполненияКода);
																
			ДобавитьРезультатаВыполненияУсловия(РезультатыУсловий,Результат);
			
			Продолжить;
			
		ИначеЕсли ОбъектИмеетСсылку Тогда
			
			Если Найти(Эл.РеквизитОбъекта,ПолноеИмяОбъекта) = 0 И Найти(Эл.РеквизитОбъекта, "ДополнительныйРеквизит.") = 0 
				И Найти(Эл.РеквизитОбъекта, "ДополнительноеСведение.") = 0 Тогда
				Продолжить;
			КонецЕсли;
					
			СчУсловийЗапроса = СчУсловийЗапроса + 1;
			
			ПарСравнения = упоОповещенияПовтИсп.ПолучитьТекстВидаСравнения(Эл.ВидСравнения);
			ЗначениеУсловия = Эл.ЗначениеУсловия.Получить();
			
			ИмяПараметра = "Параметр" + Формат(СчУсловийЗапроса,"ЧГ=0");
			
			Если Лев(Эл.РеквизитОбъекта,23) = "ДополнительныйРеквизит." Тогда
				ИмяРеквизита = ".Значение";
				ИмяТаблицыПараметра = "Таб_"+ИмяПараметра;
				ТекстСоединений = ТекстСоединений + Символы.ПС + "ЛЕВОЕ СОЕДИНЕНИЕ "+ПолноеИмяОбъекта+".ДополнительныеРеквизиты КАК "
					+ ИмяТаблицыПараметра + Символы.ПС + "ПО " + ИмяТаблицыПараметра+".Ссылка = Таб.Ссылка И " + ИмяТаблицыПараметра
					+ ".Свойство = &Свойство" + ИмяПараметра;
				Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор(Сред(Эл.РеквизитОбъекта, 24)));
				ПараметрыЗапроса.Добавить(Новый Структура(Ключи,"Свойство"+ИмяПараметра,Свойство,Ложь));
			ИначеЕсли Лев(Эл.РеквизитОбъекта,23) = "ДополнительноеСведение." Тогда
				ИмяРеквизита = ".Значение";
				ИмяТаблицыПараметра = "Таб_"+ИмяПараметра;
				ТекстСоединений = ТекстСоединений + Символы.ПС + "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК "
					+ ИмяТаблицыПараметра + Символы.ПС + "ПО " + ИмяТаблицыПараметра + ".Объект = Таб.Ссылка И " + ИмяТаблицыПараметра
					+".Свойство = &Свойство" + ИмяПараметра;
				Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор(Сред(Эл.РеквизитОбъекта, 24)));
				ПараметрыЗапроса.Добавить(Новый Структура(Ключи, "Свойство" + ИмяПараметра, Свойство, Ложь));
			Иначе
				ИмяРеквизита = СтрЗаменить(Эл.РеквизитОбъекта, ПолноеИмяОбъекта, "");
				ИмяТаблицыПараметра = "Таб";				
			КонецЕсли;
			
			Если ПарСравнения.ДваЗначения Тогда
				
				ЭтоПодобно = Найти(ПарСравнения.ВидСравненияНач, "Подобно") > 0;
				ИмяПараметра1 = ИмяПараметра + "_1";
				ПараметрыЗапроса.Добавить(Новый Структура(Ключи,ИмяПараметра1,ЗначениеУсловия[0].Значение,ЭтоПодобно));
				ТекУсловие = " ISNULL(" + ИмяТаблицыПараметра + ИмяРеквизита + ", НЕОПРЕДЕЛЕНО)" + ПарСравнения.ВидСравненияНач
					+ "&"+ ИмяПараметра1 + ПарСравнения.ВидСравненияКон;
				
				ЭтоПодобно = Найти(ПарСравнения.ВидСравненияНач2,"Подобно") > 0;
				ИмяПараметра2 = ИмяПараметра+"_2";
				ПараметрыЗапроса.Добавить(Новый Структура(Ключи,ИмяПараметра2,ЗначениеУсловия[1].Значение,ЭтоПодобно));
				ТекУсловие = ТекУсловие + " И ISNULL(" + ИмяТаблицыПараметра + ИмяРеквизита + ", НЕОПРЕДЕЛЕНО)" 
					+ ПарСравнения.ВидСравненияНач2 + "&"+ ИмяПараметра2 + ПарСравнения.ВидСравненияКон2;
				
			Иначе
				
				ЭтоПодобно = Найти(ПарСравнения.ВидСравненияНач,"Подобно") > 0;
				ПараметрыЗапроса.Добавить(Новый Структура(Ключи,ИмяПараметра,ЗначениеУсловия,ЭтоПодобно));
				ТекУсловие = " ISNULL(" + ИмяТаблицыПараметра + ИмяРеквизита + ", НЕОПРЕДЕЛЕНО)"
					+ ПарСравнения.ВидСравненияНач + "&"+ ИмяПараметра + ПарСравнения.ВидСравненияКон;
				
			КонецЕсли;
			
			Если ПарСравнения.ЭтоОтрицание Тогда
				ТекУсловие = " НЕ (" + ТекУсловие + ")";	
			КонецЕсли;
			
			УсловиеЗапроса = УсловиеЗапроса + ?(СчУсловийЗапроса=1,"",ОператорОбъединения) + ТекУсловие; 
			
		Иначе	
			
			Результат = ПроверитьРеквизитНаУсловие(ПолноеИмяОбъекта,
												   Эл.РеквизитОбъекта,
												   ВидСобытия,
												   Эл.ВидСравнения,												   
												   Эл.ЗначениеУсловия.Получить(),
												   ИсточникСсылкаОбъект,
												   ИсточникДопПараметр);
											
			ДобавитьРезультатаВыполненияУсловия(РезультатыУсловий, Результат);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СчУсловийЗапроса > 0 Тогда
		
		Если ЗначениеЗаполнено(ТекстСоединений) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КАК Таб", "КАК Таб" + Символы.ПС + ТекстСоединений);
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + " И (" +УсловиеЗапроса + ")";	
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка",ИсточникСсылка);
		Для Каждого Эл Из ПараметрыЗапроса Цикл
			Если Эл.ЭтоПодобно Тогда
				Запрос.УстановитьПараметр(Эл.Имя,"%"+Эл.Значение+"%");	
			Иначе
				Запрос.УстановитьПараметр(Эл.Имя,Эл.Значение);
			КонецЕсли;
		КонецЦикла;
		РезЗапроса = НЕ Запрос.Выполнить().Пустой();
		
		ДобавитьРезультатаВыполненияУсловия(РезультатыУсловий,РезЗапроса);
		
	КонецЕсли;
	
	Строка = "";
	// Собирается строчка с логическими выражениями, в зависимости от условия.
	Для каждого Эл Из РезультатыУсловий Цикл
		Строка  = Строка + " & " + Эл;
	КонецЦикла;
	
	Строка = Сред(Строка,3);
	Строка = СтрЗаменить(Строка, "&", ОператорОбъединения);
	Если ЛогикаПримененияУсловий = Перечисления.упоЛогическиеОператоры.НЕ Тогда
		Строка = "НЕ (" + Строка + ")";
	КонецЕсли;
	
	Строка = СтрЗаменить(Строка, "Да", "Истина");
	Строка = СтрЗаменить(Строка, "Нет", "Ложь");
	
	Попытка
		ВсеУсловияВыполнены = Вычислить(Строка);
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Обработка условий регистрации событий'"), УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
		ВсеУсловияВыполнены = Ложь;
	КонецПопытки;
	
	Возврат ВсеУсловияВыполнены;
	
КонецФункции

Процедура ДобавитьРезультатаВыполненияУсловия(РезультатыУсловий, Знач Результат)
	РезультатыУсловий.Добавить(Результат);
КонецПроцедуры

Функция ПроверитьВычисляемыйРеквизитНаУсловие(ИмяТаблицы, ИмяРеквизита, ВидСобытия, ВидСравнения, ЗначениеУсловия,
	Источник, ИсточникДопПараметр, ПараметрыВыполненияКода = Неопределено)
	
	Результат = Ложь;
	
	ВыполняемыйКод = упоОповещенияПовтИсп.ПолучитьВыполняемыйКодВычисляемогоРеквизита(ИмяТаблицы, ИмяРеквизита);
	ТипРеквизитаСтрока = упоОповещенияПовтИсп.ПолучитьТипВычисляемогоРеквизита(ИмяТаблицы, ИмяРеквизита);
	Если ПараметрыВыполненияКода = Неопределено Тогда
		ПараметрыВыполненияКода = ПолучитьПараметрыВыполненияКода(ВидСобытия);
	КонецЕсли;
	
	Попытка
		ТипРеквизита = Тип(ТипРеквизитаСтрока);
	Исключение
		ТипРеквизита = Неопределено;	
	КонецПопытки;
		
	Если ЭтоНаборЗаписейРегистра(Источник) Тогда
		Источники = Источник;
	Иначе
		Источники = Новый Массив;
		Источники.Добавить(Источник);
	КонецЕсли;
	
	Для Каждого текИсточник Из Источники Цикл
		ЗначениеРеквизита = Неопределено;
		ПараметрыВозврата = Новый Структура;	
		Попытка
			ВыполнитьКод(ВыполняемыйКод, ЗначениеРеквизита, ПараметрыВозврата, текИсточник, ИсточникДопПараметр,, ПараметрыВыполненияКода);
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Обработка условий регистрации событий'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеРеквизита = Неопределено;	
		КонецПопытки;
		Результат = Результат ИЛИ ПроверкаЗначенияНаУсловие(ЗначениеРеквизита, ВидСравнения, ЗначениеУсловия, ИмяТаблицы);
	КонецЦикла;
				
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивДопПараметровИсточника(ВидСобытия, КодОпределенияДопПараметра, Источник, ПараметрыВыполненияКода)
	
	ИсточникДопПараметр = Неопределено;				
	
	Если ЗначениеЗаполнено(КодОпределенияДопПараметра) Тогда
		Результат = Неопределено;
		Попытка
			ПараметрыВозврата = Новый Структура;
			ВыполнитьКод(КодОпределенияДопПараметра, Неопределено, ПараметрыВозврата, Источник, ИсточникДопПараметр,, ПараметрыВыполненияКода);						
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Определение доп. параметра источника'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ИсточникДопПараметр = Неопределено;	
		КонецПопытки;					
	КонецЕсли;	
	
	Если ТипЗнч(ИсточникДопПараметр) = Тип("Массив") Тогда
		МассивДопПараметровИсточника = ИсточникДопПараметр;
	Иначе
		МассивДопПараметровИсточника = Новый Массив;
		МассивДопПараметровИсточника.Добавить(ИсточникДопПараметр);
	КонецЕсли;
	
	Возврат МассивДопПараметровИсточника;
	
КонецФункции 

Функция ПроверитьРеквизитНаУсловие(ИмяТаблицы, ИмяРеквизита, ВидСобытия, ВидСравнения, ЗначениеУсловия, Источник, ИсточникДопПараметр)
	
	Результат = Ложь;
	
	Попытка
		КраткоеИмяРеквизита = СтрЗаменить(ИмяРеквизита, ИмяТаблицы, "");
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	Если ЭтоНаборЗаписейРегистра(Источник) Тогда
		Источники = Источник;
	Иначе
		Источники = Новый Массив;
		Источники.Добавить(Источник);
	КонецЕсли;
	
	Для Каждого текИсточник Из Источники Цикл
		Попытка
			ЗначениеРеквизита = Вычислить("текИсточник"+КраткоеИмяРеквизита);
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru='Обработка условий регистрации событий'"), УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
			ЗначениеРеквизита = Неопределено;	
		КонецПопытки;
		Результат = ПроверкаЗначенияНаУсловие(ЗначениеРеквизита, ВидСравнения, ЗначениеУсловия, ИмяТаблицы);
	КонецЦикла;
				
	Возврат Результат;
	
КонецФункции

Функция ПроверкаЗначенияНаУсловие(ЗначениеРеквизита, ВидСравнения, ЗначениеУсловия, ИмяТаблицы = Неопределено)
	
	Результат = Истина;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИСТИНА КАК Поле1
	               |ИЗ
	               |	Справочник.Пользователи КАК Таб
	               |ГДЕ
	               |	ИСТИНА";
	
	Если ИмяТаблицы <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Справочник.Пользователи",ИмяТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Справочник.Пользователи КАК Таб","");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ИЗ","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗначениеРеквизита",ЗначениеРеквизита);
	
	ПарСравнения = упоОповещенияПовтИсп.ПолучитьТекстВидаСравнения(ВидСравнения);
	
	Если ПарСравнения.ДваЗначения Тогда
		
		ЭтоПодобно = Найти(ПарСравнения.ВидСравненияНач,"Подобно") > 0;
		ИмяПараметра1 = "Параметр1";
		Если ЭтоПодобно Тогда
			Запрос.УстановитьПараметр(ИмяПараметра1,"%"+ЗначениеУсловия[0].Значение+"%");	
		Иначе
			Запрос.УстановитьПараметр(ИмяПараметра1,ЗначениеУсловия[0].Значение);
		КонецЕсли;
		
		ЭтоПодобно = Найти(ПарСравнения.ВидСравненияНач2,"Подобно") > 0;
		ИмяПараметра2 = "Параметр2";
		Если ЭтоПодобно Тогда
			Запрос.УстановитьПараметр(ИмяПараметра1, "%" + ЗначениеУсловия[1].Значение + "%");
		Иначе
			Запрос.УстановитьПараметр(ИмяПараметра2, ЗначениеУсловия[1].Значение);
		КонецЕсли;
		
		ТекУсловие = " &ЗначениеРеквизита" + ПарСравнения.ВидСравненияНач + "&"+ ИмяПараметра1 
			+ ПарСравнения.ВидСравненияКон;
		ТекУсловие = ТекУсловие + " И &ЗначениеРеквизита" + ПарСравнения.ВидСравненияНач2 + "&"+ ИмяПараметра2 
			+ ПарСравнения.ВидСравненияКон2;
		
	Иначе
		
		ИмяПараметра1 = "Параметр1";
		Запрос.УстановитьПараметр(ИмяПараметра1,ЗначениеУсловия);
		ТекУсловие = " &ЗначениеРеквизита" + ПарСравнения.ВидСравненияНач + "&"+ ИмяПараметра1 
			+ ПарСравнения.ВидСравненияКон;
		
	КонецЕсли;
	
	Если ПарСравнения.ЭтоОтрицание Тогда
		
		ТекУсловие = " НЕ (" + ТекУсловие + ")";
		
	КонецЕсли;
	
	УсловиеЗапроса = ТекУсловие; 
	
	ТекстЗапроса = ТекстЗапроса + " И (" +УсловиеЗапроса + ")";	
	
	Запрос.Текст = ТекстЗапроса;
	РезЗапроса = Запрос.Выполнить();
	Результат = Не РезЗапроса.Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоНаборЗаписейРегистра(Объект)
	Тип = ТипЗнч(Объект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	ИмяМетаданных = ОбъектМетаданных.ПолноеИмя();
	Если Найти(ИмяМетаданных, "РегистрСведений.") 
		ИЛИ Найти(ИмяМетаданных, "РегистрНакопления.") 
		ИЛИ Найти(ИмяМетаданных, "РегистрБухгалтерии.") 
		ИЛИ Найти(ИмяМетаданных, "РегистрРасчета.") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции 

Функция ПолучитьТаблицуПолучателейДляПроизошедшегоСобытия(ВидСобытия, Источник, ИсточникДопПараметр, КэшПолучателей, ПараметрыВыполненияКода)
	
	Если ТипЗнч(КэшПолучателей) = Тип("Соответствие") Тогда
		тзПолучатели = КэшПолучателей.Получить(ВидСобытия);
		Если тзПолучатели <> Неопределено Тогда
			Возврат тзПолучатели;
		КонецЕсли;
	КонецЕсли;
	
	тзПолучатели = Новый ТаблицаЗначений;
	тзПолучатели.Колонки.Добавить("ВидПолучателя");
	тзПолучатели.Колонки.Добавить("Получатель");
	тзПолучатели.Колонки.Добавить("Транспорт");
			
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытийПолучатели.ВидПолучателя,
	               |	упоВидыСобытийПолучатели.ДопУсловие,
	               |	упоВидыСобытийПолучатели.Получатель,
	               |	упоВидыСобытийПолучатели.ВидПолучателя.ТаблицаПолучателя КАК ТаблицаПолучателя,
	               |	упоВидыСобытийПолучатели.ОграничениеДоступа,
	               |	упоВидыСобытийПолучатели.Ссылка.Принудительное КАК Принудительное,
	               |	упоВидыСобытийПолучатели.НомерСтроки,
	               |	ЕСТЬNULL(упоОграниченияДоступаКОповещениям.Условие, НЕОПРЕДЕЛЕНО) КАК УсловиеОграничениеДоступа,
	               |	упоВидыСобытийПолучатели.Ссылка КАК ВидСобытия
	               |ПОМЕСТИТЬ врТаблицаВидаСобытия
	               |ИЗ
	               |	Справочник.упоВидыСобытий.Получатели КАК упоВидыСобытийПолучатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоОграниченияДоступаКОповещениям КАК упоОграниченияДоступаКОповещениям
	               |		ПО упоВидыСобытийПолучатели.ОграничениеДоступа = упоОграниченияДоступаКОповещениям.Ссылка
	               |ГДЕ
	               |	упоВидыСобытийПолучатели.Ссылка = &ВидСобытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытийТранспортОповещений.Транспорт
	               |ИЗ
	               |	Справочник.упоВидыСобытий.ТранспортОповещений КАК упоВидыСобытийТранспортОповещений
	               |ГДЕ
	               |	упоВидыСобытийТранспортОповещений.Используется
	               |	И упоВидыСобытийТранспортОповещений.Ссылка = &ВидСобытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПодпискиНаОповещения.Получатель,
	               |	упоПодпискиНаОповещения.ВидПолучателя
	               |ИЗ
	               |	РегистрСведений.упоПодпискиНаОповещения КАК упоПодпискиНаОповещения
	               |ГДЕ
	               |	упоПодпискиНаОповещения.ВидСобытия = &ВидСобытия
	               |	И упоПодпискиНаОповещения.Действует
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	врТаблицаВидаСобытия.ВидПолучателя,
	               |	врТаблицаВидаСобытия.ДопУсловие,
	               |	врТаблицаВидаСобытия.Получатель,
	               |	врТаблицаВидаСобытия.ТаблицаПолучателя,
	               |	врТаблицаВидаСобытия.ОграничениеДоступа,
	               |	врТаблицаВидаСобытия.Принудительное,
	               |	врТаблицаВидаСобытия.НомерСтроки,
	               |	врТаблицаВидаСобытия.УсловиеОграничениеДоступа,
	               |	врТаблицаВидаСобытия.ВидСобытия
	               |ИЗ
	               |	врТаблицаВидаСобытия КАК врТаблицаВидаСобытия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	врТаблицаВидаСобытия.НомерСтроки,
	               |	упоОграниченияДоступаКОповещениямСостав.Элемент
	               |ПОМЕСТИТЬ врЭлементыОграничений
	               |ИЗ
	               |	Справочник.упоОграниченияДоступаКОповещениям.Состав КАК упоОграниченияДоступаКОповещениямСостав
	               |		ЛЕВОЕ СОЕДИНЕНИЕ врТаблицаВидаСобытия КАК врТаблицаВидаСобытия
	               |		ПО (врТаблицаВидаСобытия.ОграничениеДоступа = упоОграниченияДоступаКОповещениямСостав.Ссылка)
	               |ГДЕ
	               |	врТаблицаВидаСобытия.ОграничениеДоступа <> ЗНАЧЕНИЕ(Справочник.упоОграниченияДоступаКОповещениям.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	врЭлементыОграничений.НомерСтроки,
	               |	врЭлементыОграничений.Элемент КАК Элемент,
	               |	ЕСТЬNULL(СоставыГруппПользователей.Пользователь, ГруппыДоступаПользователи.Пользователь) КАК Пользователь
	               |ПОМЕСТИТЬ врСоставГруппДоступа
	               |ИЗ
	               |	врЭлементыОграничений КАК врЭлементыОграничений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	               |			ПО ГруппыДоступаПользователи.Пользователь = СоставыГруппПользователей.ГруппаПользователей
	               |		ПО врЭлементыОграничений.Элемент = ГруппыДоступаПользователи.Ссылка
	               |ГДЕ
	               |	врЭлементыОграничений.Элемент ССЫЛКА Справочник.ГруппыДоступа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	врЭлементыОграничений.НомерСтроки,
	               |	врЭлементыОграничений.Элемент,
	               |	ЕСТЬNULL(врСоставГруппДоступа.Пользователь, врЭлементыОграничений.Элемент) КАК ЭлементОграничения
	               |ИЗ
	               |	врЭлементыОграничений КАК врЭлементыОграничений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ врСоставГруппДоступа КАК врСоставГруппДоступа
	               |		ПО врЭлементыОграничений.Элемент = врСоставГруппДоступа.Элемент";
					   			   
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	РезультатПакета = Запрос.ВыполнитьПакет();

	Транспорт = РезультатПакета[1].Выгрузить(); 
	Подписки = РезультатПакета[2].Выгрузить(); 
	ТаблицаПолучателейВидаСобытия = РезультатПакета[3].Выгрузить();
	ЭлементыОграничений = РезультатПакета[6].Выгрузить();
	
	ЕстьДопУсловия = Ложь;	
	КэшПодписокВидовПолучателей = Новый Соответствие;
	
	Для Каждого СтрокаПолучателейВидаСобытия Из ТаблицаПолучателейВидаСобытия Цикл
				
		МассивПолучателей = Новый Массив;		
		
		Если СтрокаПолучателейВидаСобытия.Принудительное Тогда
			
			Если ЗначениеЗаполнено(СтрокаПолучателейВидаСобытия.Получатель) Тогда	
				МассивПолучателей.Добавить(СтрокаПолучателейВидаСобытия.Получатель);
			Иначе
				МассивПолучателей = упоОповещенияПовтИсп.ПолучитьВсеЭлементыТаблицыПолучателя(СтрокаПолучателейВидаСобытия.ТаблицаПолучателя);
			КонецЕсли;
			
		Иначе
			
			ПодпискиВидаПолучателя = КэшПодписокВидовПолучателей.Получить(СтрокаПолучателейВидаСобытия.ВидПолучателя);
			Если ПодпискиВидаПолучателя = Неопределено Тогда
				ТаблицаПодписокВидаПолучателя = Подписки.Скопировать(Новый Структура("ВидПолучателя", СтрокаПолучателейВидаСобытия.ВидПолучателя));
				ПодпискиВидаПолучателя = ТаблицаПодписокВидаПолучателя.ВыгрузитьКолонку("Получатель");
				КэшПодписокВидовПолучателей.Вставить(СтрокаПолучателейВидаСобытия.ВидПолучателя, ПодпискиВидаПолучателя); 
			КонецЕсли;	
				
			Если ЗначениеЗаполнено(СтрокаПолучателейВидаСобытия.Получатель) Тогда
				Если ПодпискиВидаПолучателя.Найти(СтрокаПолучателейВидаСобытия.Получатель) <> Неопределено Тогда
					МассивПолучателей.Добавить(СтрокаПолучателейВидаСобытия.Получатель);	
				КонецЕсли;
			Иначе
				МассивПолучателей = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ПодпискиВидаПолучателя);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПолучателейВидаСобытия.ДопУсловие) Тогда
			
			Если Не ЗначениеЗаполнено(ПодпискиВидаПолучателя) Тогда
				МассивПолучателей.Очистить();
				Продолжить;				
			КонецЕсли;

			ЕстьДопУсловия = Истина;
			МассивПолучателей = ПроверитьПолучателейНаДопУсловие(СтрокаПолучателейВидаСобытия.ДопУсловие, 
																Источник, ИсточникДопПараметр, МассивПолучателей, ВидСобытия,
																ПараметрыВыполненияКода);
			Индекс = МассивПолучателей.ВГраница();
			Пока Индекс <> -1 Цикл
				Получатель = МассивПолучателей[Индекс];
				Если ПодпискиВидаПолучателя.Найти(Получатель) = Неопределено Тогда
					МассивПолучателей.Удалить(Индекс);
				КонецЕсли;
				Индекс = Индекс - 1;
			КонецЦикла;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПолучателейВидаСобытия.ОграничениеДоступа) Тогда
			ВсеКроме = СтрокаПолучателейВидаСобытия.УсловиеОграничениеДоступа 
							= Перечисления.упоУсловияОграниченияДоступаКОповещениям.ВсеКромеУказанных;
							
			сч = МассивПолучателей.Количество()-1;
			Отбор = Новый Структура("НомерСтроки", СтрокаПолучателейВидаСобытия.НомерСтроки);
			Пока сч >= 0 Цикл
				Получатель = МассивПолучателей[сч];
				Отбор.Вставить("ЭлементОграничения", Получатель);
				НайденныеОграничения = ЭлементыОграничений.НайтиСтроки(Отбор);
				НайденВОграничениях = НайденныеОграничения.Количество() > 0;
				Если (ВсеКроме И НайденВОграничениях)
				 ИЛИ (Не ВсеКроме И Не НайденВОграничениях) Тогда
					МассивПолучателей.Удалить(сч);	
				КонецЕсли;
				сч = сч - 1;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Получатель Из МассивПолучателей Цикл
			Для Каждого ДанныеТранспорта Из Транспорт Цикл
				ДанныеПолучателя = тзПолучатели.Добавить();
				ДанныеПолучателя.ВидПолучателя = СтрокаПолучателейВидаСобытия.ВидПолучателя;
				ДанныеПолучателя.Получатель = Получатель;
				ДанныеПолучателя.Транспорт = ДанныеТранспорта.Транспорт;
			КонецЦикла;
		КонецЦикла;	
		
	КонецЦикла;
	
	тзПолучатели.Свернуть("ВидПолучателя, Получатель, Транспорт");
	
	Если Не ЕстьДопУсловия Тогда
		// Кэш заполняем если нет доп. условий
		КэшПолучателей.Вставить(ВидСобытия, тзПолучатели);		
	КонецЕсли;	
	
	Возврат тзПолучатели;	
	
КонецФункции

Функция ПроверитьПолучателейНаДопУсловие(УсловиеКод, Источник, ИсточникДопПараметр, Знач масПолучатели, ВидСобытия, ПараметрыВыполненияКода)
	
	Результат = Ложь; 
	
	Попытка
		Выполнить(УсловиеКод);
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Обработка условия определения получателей события'"), УровеньЖурналаРегистрации.Ошибка, 
		Метаданные.Справочники.упоВидыСобытий, ВидСобытия, СообщениеОбОшибке);
		Результат = Ложь;	
	КонецПопытки;
	
	Если Результат Тогда
		Возврат масПолучатели;
	Иначе
		Возврат Новый Массив;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
