
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл          
		
		Если ТипЗнч(Запись.ДокументБУ) <> ТипЗнч(Запись.ДокументУУ) И ЗначениеЗаполнено(Запись.ДокументБУ) И ЗначениеЗаполнено(Запись.ДокументУУ) Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Ошибка соответствия типов при записи в регистр сведений Соответствие документов.", ,,,Отказ);
		
		КонецЕсли;               
		
		Если Запись.СостояниеДокументаУУ <> перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент Тогда                                
			
			Запись.СостояниеДокументаУУ = ИКТ_ЗП_УОС.ПолучитьСостояниеДокументаУУ(Запись.ДокументБУ, Запись.ДокументУУ);    
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры   


