////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с динамическими списками.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает отбор в списке.
//
// Параметры:
//  Список			 - Произвольный - список, в котором можно установить отбор.
//  СтруктураОтбора	 - Структура 	- данные для установки отбора.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция УстановитьОтборВСписке(Список, СтруктураОтбора)	Экспорт
	
	Для каждого КлючЗначение Из СтруктураОтбора Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			КлючЗначение.Ключ, КлючЗначение.Значение, , , Истина);
	КонецЦикла;
		
КонецФункции

// Удаляет отбор списка.
//
// Параметры:
//  Список		 - Произвольный - список, в котором есть отбор.
//  НазваниеПоля - Строка		- имя элемента отбора, который надо удалить из списка.
//
// Возвращаемое значение:
//	Булево - результат выполнения операции.
//
Функция УдалитьОтборСписка(Список, НазваниеПоля) Экспорт
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных(НазваниеПоля);
	Для каждого элОтбор Из Список.Отбор.Элементы Цикл 
		
		Если ТипЗнч(элОтбор) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если элОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			Список.Отбор.Элементы.Удалить(элОтбор);
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти