
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ШаблонПроекта", ПараметрКоманды);
	ПараметрыФормы.Вставить("ТекущаяСтраница", "СтраницаНормирование");
	ПараметрыФормы.Вставить("ПоказыватьНормирование", Истина);
	
	ОткрытьФорму("Обработка.упоПанельШаблонаПроекта.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти