
#Область ОписаниеПеременных

&НаКлиенте	
Перем ПеременныеКлиента;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ПрочитатьДанныеОбъекта(ЭтаФорма, Объект);
	КонецЕсли;
			
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьПоследняяМодификация();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
  	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Проведен 
		И ПараметрыЗаписи.Свойство("РежимЗаписи") 
		И Не ПараметрыЗаписи.Свойство("упоБезусловноеВыполнение") Тогда
		
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			
			ТекстВопроса = НСтр("ru = 'Перепроведение документа приведет к замене данных в уже скопированных задачах. Выберите действие.'");
			
			СписокОтветов = Новый СписокЗначений;
			СписокОтветов.Добавить("ПровестиИЗакрыть", НСтр("ru = 'Провести и закрыть'"));
			СписокОтветов.Добавить("Провести", НСтр("ru = 'Провести'"));
			СписокОтветов.Добавить("Отмена", НСтр("ru = 'Отмена'"));
			СписокОтветов.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект);
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокОтветов);
			
			Отказ = Истина;
			
			Возврат;
			
		ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			
			ТекстВопроса = НСтр("ru = 'При отмене проведения будут удалены все копии задач, созданные данным документом. Продолжить?'");
			
			СписокОтветов = Новый СписокЗначений;
			СписокОтветов.Добавить("ОтменаПроведения", НСтр("ru = 'Отменить проведение'"));
			СписокОтветов.Добавить("Отмена", НСтр("ru = 'Отмена'"));
			СписокОтветов.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект);
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокОтветов);
			
			Отказ = Истина;
			
			Возврат;
				
		КонецЕсли;
		
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = "ПровестиИЗакрыть" Тогда
		Записать(Новый Структура("РежимЗаписи, упоБезусловноеВыполнение", РежимЗаписиДокумента.Проведение, Истина));
		Закрыть();
	ИначеЕсли РезультатВопроса = "Провести" Тогда		
		Записать(Новый Структура("РежимЗаписи, упоБезусловноеВыполнение", РежимЗаписиДокумента.Проведение, Истина));
	ИначеЕсли РезультатВопроса = "Закрыть" Тогда		
		Закрыть();
	ИначеЕсли РезультатВопроса = "ОтменаПроведения" Тогда		
		Записать(Новый Структура("РежимЗаписи, упоБезусловноеВыполнение", РежимЗаписиДокумента.ОтменаПроведения, Истина));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	ТекущийОбъект.НачалоПериода = ПериодЗначение.ДатаНачала;
	ТекущийОбъект.КонецПериода = ПериодЗначение.ДатаОкончания;
	ТекущийОбъект.ОтборПоПериоду = ПериодИспользование;
	
	ТекущийОбъект.ПроектыИсточники.Очистить();
	Для Каждого ЭлементСписка Из ПроектыИсточникиСписок Цикл
		ТекущийОбъект.ПроектыИсточники.Добавить().Проект = ЭлементСписка.Значение;	
	КонецЦикла;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("упоБезусловноеВыполнение");
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПрочитатьДанныеОбъекта(ЭтаФорма, ТекущийОбъект);
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КопируемыеЗадачиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КопируемыеЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	СтандартныйПериод_Вид_ПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСкопированныеРанееПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыИсточникИспользоватьПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КопируемыеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки = Объект.КопируемыеЗадачи.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, ДанныеСтроки.ПроектнаяЗадача);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ЗаполнитьКопируемыеЗадачи();
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#Область ВыборПериода

&НаКлиенте
Процедура ПериодИспользованиеПриИзменении(Элемент)
	
	ИзменитьОтображениеСостояния();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СтандартныйПериод_Вид_ПриИзменении(ЭтаФорма, Интерактивно = Истина)
		
	ВидПериодаИмя = "ПериодВид";
	ИдентификаторЭлемента  = Прав(ВидПериодаИмя, 32);
	СвойстваНастройкиТип = Лев(ВидПериодаИмя, Найти(ВидПериодаИмя, "_Вид_")-1);
	
	СтраницыИмя             = "ВидыПериодаСтраницы";
	ИспользованиеИмя        = "ПериодИспользование";
	ПериодЗначениеИмя       = "ПериодЗначение";
	ПериодПредставлениеИмя  = "ПериодПредставление";
	СтраницаПроизвольныйИмя = "СтраницаПроизвольныйПериод";
	СтраницаСтандартныйИмя  = "СтраницаСтандартныйПериод";
	
	Значение = ЭтаФорма[ПериодЗначениеИмя];
	ВидПериода = ЭтаФорма[ВидПериодаИмя];
	
	Если НЕ ЗначениеЗаполнено(ВидПериода) Тогда
		ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод");
		ЭтаФорма[ВидПериодаИмя] = ВидПериода;
	КонецЕсли;
		
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
		
		// Переключение страницы.
		ЭтаФорма.Элементы[СтраницыИмя].ТекущаяСтраница = ЭтаФорма.Элементы[СтраницаПроизвольныйИмя];
		
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		
	Иначе
		
		// Переключение страницы.
		ЭтаФорма.Элементы[СтраницыИмя].ТекущаяСтраница = ЭтаФорма.Элементы[СтраницаСтандартныйИмя];
		
		// Приведение значения периода в соответствие с выбранным видом.
		НачалоПериода = НачалоДня(Значение.ДатаНачала);
		Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
			НачалоПериода = НачалоДня(ТекущаяДата());
		КонецЕсли;
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ВидПериода, НачалоПериода);
		КонецПериода  = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ВидПериода, НачалоПериода);
		
		Значение.ДатаНачала    = НачалоПериода;
		Значение.ДатаОкончания = КонецПериода;
		
	КонецЕсли;
	
	Представление = упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(Значение, ВидПериода);
	ЭтаФорма[ПериодПредставлениеИмя] = Представление;
	ЭтаФорма[ПериодЗначениеИмя]      = Значение;
		
	ИзменитьОтображениеСостояния();
	
	Если Интерактивно И Значение.ДатаНачала <> '00010101' И Значение.ДатаОкончания <> '00010101' Тогда
		ЭтаФорма[ИспользованиеИмя] = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_Значение_НачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	// Формирование сведений по элементу.
	ПериодПредставлениеИмя = "ПериодПредставление";
	//ИдентификаторЭлемента  = Прав(ПериодПредставлениеИмя, 32);
	//СвойстваНастройкиТип = Лев(ПериодПредставлениеИмя, Найти(ПериодПредставлениеИмя, "_Представление_")-1);
	
	ПериодЗначениеИмя = "ПериодЗначение";
	ВидПериодаИмя     = "ПериодВид";
	ИспользованиеИмя  = "ПериодИспользование";
	
	Значение   = ЭтаФорма[ПериодЗначениеИмя];
	ВидПериода = ЭтаФорма[ВидПериодаИмя];
	
	НачалоПериода = Значение.ДатаНачала;
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ВидПериода, ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	// Параметры для чтения из обработчиков:
	ПараметрыВыбораИзСписка = Новый Структура;
	// Для выбора значения:
	ПараметрыВыбораИзСписка.Вставить("Значение",               Значение);
	ПараметрыВыбораИзСписка.Вставить("Элемент",                Элемент);
	// Для загрузки значения:
	//ПараметрыВыбораИзСписка.Вставить("ИдентификаторЭлемента",  ИдентификаторЭлемента);
	ПараметрыВыбораИзСписка.Вставить("ПериодПредставлениеИмя", ПериодПредставлениеИмя);
	ПараметрыВыбораИзСписка.Вставить("ПериодЗначениеИмя",      ПериодЗначениеИмя);
	ПараметрыВыбораИзСписка.Вставить("ИспользованиеИмя",       ИспользованиеИмя);
	ПараметрыВыбораИзСписка.Вставить("ВидПериода",             ВидПериода);
	//ПараметрыВыбора.Вставить("ЭтоПараметр",            СвойстваНастройкиТип = "ЗначениеПараметраНастроек");
	
	ВыборПериодаИзВыпадающегоСписка(-1, ПараметрыВыбораИзСписка);
	
	ИзменитьОтображениеСостояния();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбораИзСписка) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат; // Отмена выбора.
	КонецЕсли;
	
	Если Результат = -1 Тогда // Начало выбора.
		// Чтение параметров для формирования списка из сохраненного значения периода.
		ПараметрыВыбораИзСписка.Вставить("НачалоПериода", ПараметрыВыбораИзСписка.Значение.ДатаНачала);
		ПараметрыВыбораИзСписка.Вставить("Вариант",       ПараметрыВыбораИзСписка.Значение.Вариант);
		ИндексНачальногоЗначения = Неопределено;
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("Структура") Тогда
		// Чтение параметров для формирования списка из выбранного значения.
		ПараметрыВыбораИзСписка.Вставить("НачалоПериода", Результат.Значение.НачалоПериода);
		ПараметрыВыбораИзСписка.Вставить("Вариант",       Результат.Значение.Вариант);
		ИндексНачальногоЗначения = Результат.Значение.ИндексНачальногоЗначения;
	Иначе
		// Загрузка результата выбора.
		ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбораИзСписка);
		Возврат;
	КонецЕсли;
	
	// Формирование списка выбора.
	
	Если ПараметрыВыбораИзСписка.Вариант = Неопределено Или ПараметрыВыбораИзСписка.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		
		СписокПериодов = упоФункцииБСПКлиентСервер.СписокФиксированныхПериодов(ПараметрыВыбораИзСписка.НачалоПериода, ПараметрыВыбораИзСписка.ВидПериода);
		
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбораИзСписка.НачалоПериода);
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[0].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 0);
		СписокПериодов[0].Значение = ОписаниеНавигационногоЭлемента;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[8].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 8);
		СписокПериодов[8].Значение = ОписаниеНавигационногоЭлемента;
		
		Если Не ПараметрыВыбораИзСписка.Свойство("ВариантСтандартногоПериодаПоВиду") Тогда
			ПараметрыВыбораИзСписка.Вставить("ВариантСтандартногоПериодаПоВиду", ВариантСтандартногоПериодаПоВиду(ПараметрыВыбораИзСписка.ВидПериода));
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            ПараметрыВыбораИзСписка.НачалоПериода);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  ПараметрыВыбораИзСписка.ВариантСтандартногоПериодаПоВиду);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", Неопределено);
		СписокПериодов.Добавить(ОписаниеНавигационногоЭлемента, НСтр("ru = 'Относительный...'"));
		
	Иначе
		
		СписокПериодов = упоФункцииБСПКлиентСервер.СписокВычисляемыхПериодов(ПараметрыВыбораИзСписка.ВидПериода);
		
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбораИзСписка.Вариант);
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            ПараметрыВыбораИзСписка.НачалоПериода);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", Неопределено);
		СписокПериодов.Добавить(ОписаниеНавигационногоЭлемента, НСтр("ru = 'Фиксированный...'"));
		
		КонецЕсли;
		
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	
	Если ПеременныеКлиента = Неопределено Тогда
		
		ПеременныеКлиента = Новый Структура;
		
	КонецЕсли;
	
	ПеременныеКлиента.Вставить("ВыборПериодаИзВыпадающегоСписка", Новый Структура);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ПараметрыВыбора", ПараметрыВыбораИзСписка);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("СписокПериодов", СписокПериодов);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ИндексНачальногоЗначения", ИндексНачальногоЗначения);
	Если Результат = -1 Тогда
		НачатьВыборПериодаИзВыпадающегоСписка();
	Иначе
		ПодключитьОбработчикОжидания("НачатьВыборПериодаИзВыпадающегоСписка", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВариантСтандартногоПериодаПоВиду(ВидПериода)
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Возврат ВариантСтандартногоПериода.Сегодня;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаНеделя;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Декада") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаДекада;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотМесяц;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Квартал") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотКвартал;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Полугодие") Тогда
		Возврат ВариантСтандартногоПериода.ЭтоПолугодие;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Год") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотГод;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСписка()
	
	Если Не ПеременныеКлиента.Свойство("ВыборПериодаИзВыпадающегоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка;
	ПеременныеКлиента.Удалить("ВыборПериодаИзВыпадающегоСписка");
	ОповещениеВыбор = Новый ОписаниеОповещения("ВыборПериодаИзВыпадающегоСписка", ЭтотОбъект, Контекст.ПараметрыВыбора);
	ПоказатьВыборИзСписка(ОповещениеВыбор, Контекст.СписокПериодов, Контекст.ПараметрыВыбора.Элемент, 
																				Контекст.ИндексНачальногоЗначения);
																				
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_НачалоПериода_ПриИзменении(Элемент)
	
	// Формирование сведений по элементу.
	ПериодНачалоИмя = "ПериодЗначениеДатаНачала";
	ПериодЗначениеИмя = "ПериодЗначение";
	ИспользованиеИмя  = "ПериодИспользование";
	
	Значение = ЭтаФорма[ПериодЗначениеИмя];
	
	Если Значение.ДатаНачала <> '00010101' Тогда
		Значение.ДатаНачала = НачалоДня(Значение.ДатаНачала);
	КонецЕсли;
	
	// Запись значения в пользовательские настройки компоновки данных.
	
	Если Значение.ДатаНачала <> '00010101' И Элементы.Найти(ИспользованиеИмя) <> Неопределено Тогда
		ЭтаФорма[ИспользованиеИмя] = Истина;
	КонецЕсли;
	
	ИзменитьОтображениеСостояния();	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_КонецПериода_ПриИзменении(Элемент)
	
	// Формирование сведений по элементу.
	ПериодОкончаниеИмя = "ПериодЗначениеДатаОкончания";
	
	ПериодЗначениеИмя = "ПериодЗначение";
	ИспользованиеИмя  = "ПериодИспользование";
	
	Значение = ЭтаФорма[ПериодЗначениеИмя];
	
	Если Значение.ДатаОкончания <> '00010101' Тогда
		Значение.ДатаОкончания = КонецДня(Значение.ДатаОкончания);
	КонецЕсли;
	
	// Запись значения в пользовательские настройки компоновки данных.
	
	Если Значение.ДатаОкончания <> '00010101' И Элементы.Найти(ИспользованиеИмя) <> Неопределено Тогда
		ЭтаФорма[ИспользованиеИмя] = Истина;
	КонецЕсли;
	
	ИзменитьОтображениеСостояния();	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_Значение_Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбораИзСписка)
	Значение = ПараметрыВыбораИзСписка.Значение;
		
	// Запись результата выбора в данные формы и пользовательские настройки КД.
	Если ТипЗнч(Результат.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		ЭтаФорма[ПараметрыВыбораИзСписка.ПериодПредставлениеИмя] = ?(ПустаяСтрока(Результат.Представление), Строка(Результат.Значение), Результат.Представление);
		Значение.Вариант = Результат.Значение;
	Иначе
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ПараметрыВыбораИзСписка.ВидПериода, Результат.Значение);
		КонецПериода  = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ПараметрыВыбораИзСписка.ВидПериода, Результат.Значение);
		
		ЭтаФорма[ПараметрыВыбораИзСписка.ПериодПредставлениеИмя] = Результат.Представление;
		
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Значение.ДатаНачала    = НачалоПериода;
		Значение.ДатаОкончания = КонецПериода;
	КонецЕсли;
	
	ЭтаФорма[ПараметрыВыбораИзСписка.ПериодЗначениеИмя] = Значение;
	
		
	Если Элементы.Найти(ПараметрыВыбораИзСписка.ИспользованиеИмя) <> Неопределено Тогда
		ЭтаФорма[ПараметрыВыбораИзСписка.ИспользованиеИмя] = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста	
Процедура ИзменитьОтображениеСостояния()
	
	//Элементы.Результат.ОтображениеСостояния.Текст = "Отчет не сформирован. Нажмите 'Сформировать' для получения отчета";
	//Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
	//Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = 
	//	ДополнительныйРежимОтображения.Неактуальность;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = Ложь;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.
	тОбъект = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);
	тОбъект.ОбработкаЗаполнения(ВыбранноеЗначение);
	ЗначениеВДанныеФормы(тОбъект, Объект);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПрочитатьДанныеОбъекта(ЭтаФорма, Объект) 
		
	ЭтаФорма.ПериодЗначение.ДатаНачала = Объект.НачалоПериода;
	ЭтаФорма.ПериодЗначение.ДатаОкончания = Объект.КонецПериода;
	Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ЭтаФорма.ПериодВид = упоФункцииБСПКлиентСервер.ПолучитьВидПериода(Объект.НачалоПериода, КонецДня(Объект.КонецПериода));
	Иначе
		ЭтаФорма.ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод");
	КонецЕсли;		
	ЭтаФорма.ПериодИспользование = Объект.ОтборПоПериоду;
			
	ЭтаФорма.ПроектыИсточникиСписок.ЗагрузитьЗначения(Объект.ПроектыИсточники.Выгрузить().ВыгрузитьКолонку("Проект"));
	ЭтаФорма.ПроектыИсточникИспользовать = ЭтаФорма.ПроектыИсточникиСписок.Количество() <> 0;	
		                                                
	СтандартныйПериод_Вид_ПриИзменении(ЭтаФорма, Ложь);
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);

КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКопируемыеЗадачи()
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) И Не ЗначениеЗаполнено(Объект.Подразделение)
		И Не ПериодИспользование И Не (ПроектыИсточникИспользовать И ПроектыИсточникиСписок.Количество()) Тогда
		
		ТекстСообщения = НСтр("ru = 'Запрещено заполнять список задач без установки отбора.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.КопируемыеЗадачи.Количество() Тогда
		
		ОповещениеВопроса = Новый ОписаниеОповещения("ЗаполнитьКопируемыеЗадачиЗавершение", ЭтотОбъект);		
		ТекстВопроса = НСтр("ru = 'Список копируемых задач не пуст. Он будет очищен. Продолжить?'");		
		ПоказатьВопрос(ОповещениеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьКопируемыеЗадачиЗавершение(КодВозвратаДиалога.Да, Неопределено);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьКопируемыеЗадачиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКопируемыеЗадачиСервер();
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКопируемыеЗадачиСервер()
		
	Объект.КопируемыеЗадачи.Очистить();
	
	//
		
	СтатусыЗадач = Новый Массив;
	СтатусыЗадач.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Запланирована);
	СтатусыЗадач.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Выполняется);	
	
	//
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.СкопированаВСводныйИзЗадачи КАК ИзЗадачи
	               |ПОМЕСТИТЬ РанееЗагруженныеЗадачиСводного
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект = &СводныйПроект) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |ГДЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.СкопированаВСводныйИзЗадачи <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК ПредставлениеЗадачи,
	               |	Проекты.Ссылка КАК ПроектнаяЗадачаЗеркало,
	               |	Проекты.КодСДР КАК КодСДР,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачала,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершения,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК Статус,
	               |	ВЫБОР
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					РанееЗагруженныеЗадачиСводного.ИзЗадачи
	               |				ИЗ
	               |					РанееЗагруженныеЗадачиСводного)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК СкопированаРанее,
	               |	упоВерсииПроекта.Версия КАК ТекВерсия
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоСрокиПроектныхЗадачСрезПоследних.Версия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоСтатусыПроектныхЗадачСрезПоследних.Версия
	               |ГДЕ
	               |	(&флВсеПроекты
	               |				И упоВерсииПроекта.Проект <> &СводныйПроект
	               |			ИЛИ упоВерсииПроекта.Проект В (&МассивПроектов))
	               |	И (&флБезПериода
	               |			ИЛИ упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан <= &ДатаОкончания
	               |				И упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан >= &ДатаНачала)
	               |	И упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи В(&СтатусыЗадач)
	               |	И упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации = &ВидОперации
	               |	И НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект,
	               |	Проекты.КодСДР";
	
	Запрос = Новый Запрос;	
	
	Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Запрос.УстановитьПараметр("ВидОперации", Объект.ВидОперации);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации = &ВидОперации", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		КонструкторЗапроса = Новый СхемаЗапроса;	
		КонструкторЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		ЗапросБезОтбораПодразделения = КонструкторЗапроса.ПакетЗапросов[КонструкторЗапроса.ПакетЗапросов.Количество()-1];
		ЗапросБезОтбораПодразделения.ТаблицаДляПомещения = "ТаблицаБезОтбораПодразделения";
		
		ЗапросОтборПоПодразделению = КонструкторЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		ЗапросОтборПоПодразделению.УстановитьТекстЗапроса("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		                                                  |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
		                                                  |ПОМЕСТИТЬ ЗадачиПоПодразделению
		                                                  |ИЗ
		                                                  |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		                                                  |			,
		                                                  |			(ПроектнаяЗадача, Версия) В
		                                                  |					(ВЫБРАТЬ
		                                                  |						ТаблицаБезОтбораПодразделения.ПроектнаяЗадача,
		                                                  |						ТаблицаБезОтбораПодразделения.ТекВерсия
		                                                  |					ИЗ
		                                                  |						ТаблицаБезОтбораПодразделения)
		                                                  |				И Подразделение = &Подразделение) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		                                                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		                                                  |				,
		                                                  |				(ПроектнаяЗадача, Версия) В
		                                                  |					(ВЫБРАТЬ
		                                                  |						ТаблицаБезОтбораПодразделения.ПроектнаяЗадача,
		                                                  |						ТаблицаБезОтбораПодразделения.ТекВерсия
		                                                  |					ИЗ
		                                                  |						ТаблицаБезОтбораПодразделения)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		                                                  |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
		                                                  |			И упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		                                                  |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		                                                  |ГДЕ
		                                                  |	упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0");
		
		ЗапросРезультат = КонструкторЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		ЗапросРезультат.ВыбиратьРазрешенные = Истина;
		Оператор = ЗапросРезультат.Операторы[0];
		Источник = Оператор.Источники.Добавить("ТаблицаБезОтбораПодразделения", "ТаблицаБезОтбораПодразделения");
		Для Каждого Колонка Из ЗапросБезОтбораПодразделения.Колонки Цикл
			Оператор.ВыбираемыеПоля.Добавить(Колонка.Псевдоним);
		КонецЦикла;
		Оператор.Отбор.Добавить("ПроектнаяЗадача В (ВЫБРАТЬ ЗадачиПоПодразделению.ПроектнаяЗадача ИЗ ЗадачиПоПодразделению)");   		
		
		ЗапросРезультат.Порядок.Добавить("ПроектнаяЗадача.Проект");
		ЗапросРезультат.Порядок.Добавить("КодСДР");
		
		ТекстЗапроса = КонструкторЗапроса.ПолучитьТекстЗапроса();
		
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
		
	КонецЕсли;
					   
	Запрос.УстановитьПараметр("СводныйПроект", Объект.СводныйПроект);
	Запрос.УстановитьПараметр("флВсеПроекты", ПроектыИсточникиСписок.Количество() = 0);
	Запрос.УстановитьПараметр("МассивПроектов", ПроектыИсточникиСписок.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("флБезПериода", НЕ ПериодИспользование);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодЗначение.ДатаОкончания);
	Запрос.УстановитьПараметр("СтатусыЗадач", СтатусыЗадач);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Объект.НеСкопированныеРанее И Выборка.СкопированаРанее Тогда
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Выборка.ПроектнаяЗадача) Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Объект.КопируемыеЗадачи.Добавить(), Выборка); 	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьВозможностьИзменения(ЭтаФорма) 
	
	ЭтаФорма.ВозможностьМенятьСоставЗадач = НЕ ЭтаФорма.Объект.Проведен;
	ЭтаФорма.ВозможностьМенятьОтбор = ЭтаФорма.ВозможностьМенятьСоставЗадач И ЭтаФорма.Объект.КопируемыеЗадачи.Количество() = 0;
	ЭтаФорма.ВозможностьМенятьСводныйПроект = ЭтаФорма.ВозможностьМенятьОтбор;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьВидимостьДоступностьЭлементов(ЭтаФорма) 
	
	ОпределитьВозможностьИзменения(ЭтаФорма);
	
	ЭтаФорма.Элементы.СводныйПроект.ТолькоПросмотр = Не ЭтаФорма.ВозможностьМенятьСводныйПроект;	
	ЭтаФорма.Элементы.ГруппаОтбор.ТолькоПросмотр = Не ЭтаФорма.ВозможностьМенятьОтбор;
	ЭтаФорма.Элементы.КопируемыеЗадачи.ТолькоПросмотр = Не ЭтаФорма.ВозможностьМенятьСоставЗадач;	
	ЭтаФорма.Элементы.ГруппаПараметрыКопирования.ТолькоПросмотр = Не ЭтаФорма.ВозможностьМенятьСоставЗадач;	
	ЭтаФорма.Элементы.КопируемыеЗадачиКомандаЗаполнить.Доступность = ЭтаФорма.ВозможностьМенятьСоставЗадач;
	
	ЭтаФорма.Элементы.ПроектыИсточникиСписок.Видимость = ЭтаФорма.ПроектыИсточникИспользовать;
	
	ЭтаФорма.Элементы.КопируемыеЗадачиСкопированаРанее.Видимость = НЕ ЭтаФорма.Объект.НеСкопированныеРанее;
	
КонецФункции

#КонецОбласти
