
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ДанныеВыбора = Новый СписокЗначений;
	МассивИсключения = ПолучитьИсключенияЕРМ();
	
	Если МассивИсключения = Неопределено Тогда
		Возврат;
	КонецЕсли;		
		
    Запрос = Новый Запрос; 
    Запрос.УстановитьПараметр("МассивИсключения", МассивИсключения);
    
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |	упоСпособыРаспределенияРасходовПоПроектам.Ссылка КАК Ссылка
                   |ИЗ
                   |	Справочник.упоСпособыРаспределенияРасходовПоПроектам КАК упоСпособыРаспределенияРасходовПоПроектам
                   |ГДЕ
                   |	НЕ упоСпособыРаспределенияРасходовПоПроектам.Ссылка В (&МассивИсключения)";
    
    РезультатЗапроса = Запрос.Выполнить();        
    ДанныеВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка")); 
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИсключенияЕРМ() Экспорт

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивИсключения = Новый Массив; 
    МассивИсключения.Добавить(Справочники.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП);
	
	Возврат МассивИсключения;

КонецФункции 

#КонецОбласти

#КонецЕсли
