
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    Если НЕ Ссылка = Справочники.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП Тогда       
        
        Массив = Новый Массив;
        Массив.Добавить("СпособРаспределенияПоНаправлениямДеятельности");
        Массив.Добавить("СпособРаспределенияПоПодразделениям");
                
        Для Каждого Эл Из Массив Цикл             
            ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, Эл)                        
        КонецЦикла;         
                                
    КонецЕсли;                                         
    
    ПроверитьЗаполнениеДолиНД(Отказ);            
    ПроверитьЗаполнениеДолиПоПодразделениям(Отказ);
    
КонецПроцедуры

Процедура ПередЗаписью(Отказ)             
    
    Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
    КонецЕсли;
    
    ОчиститьНастройкиПоНД = Новый Структура;
    ОчиститьНастройкиПоНД.Вставить("СтатьиРасходов", НЕ СпособРаспределенияПоНаправлениямДеятельности = Перечисления.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности.ПоУказаннымСтатьям);
    ОчиститьНастройкиПоНД.Вставить("КоэффициентыНД", НЕ СпособРаспределенияПоНаправлениямДеятельности = Перечисления.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности.ПоКоэффициентам);
    
    Для Каждого КЗ Из ОчиститьНастройкиПоНД Цикл 
    	Если КЗ.Значение Тогда
            ЭтотОбъект[КЗ.Ключ].Очистить();
        КонецЕсли;  
    КонецЦикла;                  
    
    /////////////////////////////////////////////////////////////// 
    ОчиститьНастройкиПоПодразделениям = Новый Структура;    
    ОчиститьНастройкиПоПодразделениям.Вставить("КоэффициентыПодразделений", НЕ СпособРаспределенияПоПодразделениям = Перечисления.упоВидРаспределенияОПРиОХРпоПодразделениям.ПоКоэффициентам);
    
    Для Каждого КЗ Из ОчиститьНастройкиПоПодразделениям Цикл 
    	Если КЗ.Значение Тогда
            ЭтотОбъект[КЗ.Ключ].Очистить();
        КонецЕсли;  
    КонецЦикла;                  
    
    упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеДолиНД(Отказ)

    Если НЕ СпособРаспределенияПоНаправлениямДеятельности = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности.ПоКоэффициентам") Тогда
        Возврат;
    КонецЕсли;  
    
    ИмяТаблицы = "КоэффициентыНД";
    ВсегоВведено = ЭтотОбъект[ИмяТаблицы].Итог("Доля");
    
    Если ВсегоВведено <> 100 Тогда
        ТекстСообщения = НСтр("ru = 'Сумма долей ""Коэффициенты: направления деятельности"" должна быть равна 100%.'");        
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект." + ИмяТаблицы,, Отказ); 
    КонецЕсли;  
    
КонецПроцедуры  

Процедура ПроверитьЗаполнениеДолиПоПодразделениям(Отказ)

    ИмяТаблицы = "";
    
    Если СпособРаспределенияПоПодразделениям = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидРаспределенияОПРиОХРпоПодразделениям.ПоКоэффициентам") Тогда
        ИмяТаблицы = "КоэффициентыПодразделений";
    КонецЕсли;  
    
    Если НЕ ЗначениеЗаполнено(ИмяТаблицы) Тогда
        Возврат;
    КонецЕсли;  
        
    ВсегоВведено = ЭтотОбъект[ИмяТаблицы].Итог("Доля");
    
    Если ВсегоВведено <> 100 Тогда
        ТекстСообщения = НСтр("ru = 'Сумма долей таблицы ""%1"" должна быть равна 100%.'");//НСтр("ru = 'Сумма долей таблицы "" должна быть равна 100%.'");        
        ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ИмяТаблицы);
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект." + ИмяТаблицы,, Отказ); 
    КонецЕсли; 
    
КонецПроцедуры
 
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
