
Процедура ДобавитьЗаписьВЖурналОбмена(Период,
									Событие,
									ДействиеОбмена,
									СообщениеОбмена = "",
									ИнформацияОбОшибке = "",
									КоличествоПопыток = 0,
									Выгружен = Ложь,
									Ошибка = Ложь,
									ИмяСобытия = "",
									СообщениеОтвет = "") Экспорт 
	
	Запись = РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.Событие = Событие;
	Запись.Действие = ДействиеОбмена;
	Запись.СообщениеОбмена = СообщениеОбмена;
	Запись.ИнформацияОбОшибке = ИнформацияОбОшибке;
	Запись.КоличествоПопыток = КоличествоПопыток; 
	Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Запись.Выгружен = Выгружен;
	Запись.Ошибка = Ошибка;
	Запись.ИмяСобытия = ИмяСобытия;
	Запись.СообщениеОтвет = СообщениеОтвет;
	Запись.Записать();   
	
КонецПроцедуры
	