#Область СлужебныйПрограммныйИнтерфейс

// Пересчитывает процент распределения, трудоъемкость и количество в строке распределения при изменении номирования.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции - данные строки табличной части. 
//  НормированиеИтог	 - Число	 - общее нормирование. 
//  КоличествоИтог		 - Число	 - общее количество.
//
Процедура ПересчитатьДанныеСтрокиРаспределенияПриИзмененииНомирования(СтрокаТабличнойЧасти, НормированиеИтог,
	КоличествоИтог) Экспорт

	Если СтрокаТабличнойЧасти.Нормирование = 0 Тогда
		СтрокаТабличнойЧасти.ПроцентРаспределения = 0;
	Иначе
		СтрокаТабличнойЧасти.ПроцентРаспределения = СтрокаТабличнойЧасти.Нормирование / НормированиеИтог * 100;
	КонецЕсли;
	СтрокаТабличнойЧасти.Трудоемкость = СтрокаТабличнойЧасти.Нормирование * СтрокаТабличнойЧасти.КоэффициентСложности;
	СтрокаТабличнойЧасти.Количество = КоличествоИтог * СтрокаТабличнойЧасти.ПроцентРаспределения / 100;
	
КонецПроцедуры

#КонецОбласти