
Процедура ПередЗаписью(Отказ)
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат	
	КонецЕсли; 
	
	Для каждого стр Из Расписание Цикл
		Если Стр.Часы < 6 Тогда
			 Отказ = Истина;
			 
			 Сообщить("Смена не может быть короче 6ти часов");
			 Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Если НЕ ПроверкаНаУникальностьСправочника() Тогда
		Отказ = Истина;
		
		Сообщить("Уже существует такая смена в справочнике.
				|Выберите существующую смену " + Наименование);
	КонецЕсли; 
	
КонецПроцедуры

Функция ПроверкаНаУникальностьСправочника() Экспорт   
	
	ЗначениеУникально = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СменыРабот.Ссылка
	|ИЗ
	|	Справочник.ИКТ_СменыРабот КАК СменыРабот
	|ГДЕ
	|	СменыРабот.Наименование = &Наименование
	|	И НЕ СменыРабот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ЗначениеУникально = Истина; 
	КонецЕсли;
	
	Возврат ЗначениеУникально;
	
КонецФункции