#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура заполняет рабочими заданиями табличную часть или таблицу значений.
//
// Параметры:
//  ТЧПроектныеЗадачи - ТабличнаяЧасть, ТаблицаЗначения - Табличная часть, Таблица значения.
//  Дата 			 - Дата - День, на который получаем рабочие задания. 
//  ТрудовойРесурс 	 - СправочникСсылка.упоТрудовыеРесурсы - трудовой ресурс.
//  ЗаполнятьРоль 	 - Булево - Признак заполнения Роли в заданной ТЧ/ТЗ.
//
Процедура ЗаполнитьРабочимиЗаданиями(ТЧПроектныеЗадачи, Дата, ТрудовойРесурс, ЗаполнятьРоль) Экспорт
	
	НачалоДня = НачалоДня(Дата);
	
	РабочиеЗадания = ПолучитьРабочиеЗадания(НачалоДня, КонецДня(Дата), ТрудовойРесурс);
	
	Если Не ЗначениеЗаполнено(РабочиеЗадания) Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаЗаданий Из РабочиеЗадания Цикл
		
		Если СтрокаЗаданий.ДатаОкончанияНаМоментЗаполнения < НачалоДня Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаТаблицы = ТЧПроектныеЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЗаданий);
		Если ЗначениеЗаполнено(СтрокаЗаданий.Задание) Тогда
			СтрокаТаблицы.Задача = СтрокаЗаданий.Задание;	
		Иначе
			СтрокаТаблицы.Задача = СтрокаЗаданий.РабочееЗадание;
		КонецЕсли;
		Если ЗаполнятьРоль Тогда
			СтрокаТаблицы.Роль = СтрокаЗаданий.РольРесурса;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция получает рабочие задания.
//
// Параметры:
//  ДатаНачала 		- Дата - дата начала.
//  ДатаОкончания 	- Дата - дата окончания. 
//  ТрудовойРесурс 	- СправочникСсылка.упоТрудовыеРесурсы - трудовой ресурс. 
//
// Возвращаемое значение:
//  ТаблицаЗначений	- найденные рабочие задания.
//
Функция ПолучитьРабочиеЗадания(ДатаНачала, ДатаОкончания, ТрудовойРесурс) Экспорт 
		
	ТаблицаРабочихЗаданий = упоРаспределениеТрудозатратВызовСервера.ПолучитьРабочиеЗадания(ТрудовойРесурс, ДатаНачала, ДатаОкончания);
	Если ТаблицаРабочихЗаданий <> Неопределено Тогда
		ТаблицаРабочихЗаданий.Колонки.ДатаНачала.Имя = "ДатаНачалаНаМоментЗаполнения";
		ТаблицаРабочихЗаданий.Колонки.ДатаОкончания.Имя = "ДатаОкончанияНаМоментЗаполнения";
	КонецЕсли;
	
	ТаблицаРабочихЗаданий.Сортировать("Проект");
	
	Возврат ТаблицаРабочихЗаданий;
	
КонецФункции

// Функция получает документ дня на дату.
//
// Параметры:
//  Дата		 		- Дата - дата.
//  ТрудовойРесурс 	- СправочникСсылка.упоТрудовыеРесурсы - трудовой ресурс. 
//
// Возвращаемое значение:
//  Ссылка 			- ссылка на документ дня. 
//
Функция ПолучитьДокументДня(ТрудовойРесурс, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоТабельУчетаРабочегоВремени.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.упоТабельУчетаРабочегоВремени КАК упоТабельУчетаРабочегоВремени
	               |ГДЕ
	               |	упоТабельУчетаРабочегоВремени.Ресурс = &Ресурс
	               |	И НАЧАЛОПЕРИОДА(упоТабельУчетаРабочегоВремени.Дата, ДЕНЬ) = &ДатаДокумента
	               |	И упоТабельУчетаРабочегоВремени.Проведен";
	
	Запрос.УстановитьПараметр("Ресурс", ТрудовойРесурс);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Дата));	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		
		Возврат Выборка.Ссылка;
		
	Иначе	
		
		Возврат Неопределено;
		
	КонецЕсли;
		
КонецФункции

// Функция получает массив трудовых ресурсов пользователя.
//
// Возвращаемое значение:
//  Массив	- массив трудовых ресурсов.
//
Функция ПолучитьМассивТрудовыхРесурсовПользователя() Экспорт
	
	МассивТР = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекПользователь", Пользователи.ТекущийПользователь());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РегТР.Ресурс КАК Ресурс
	|ИЗ
	|	РегистрСведений.упоВладениеРесурсами.СрезПоследних(
	|			,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					РегДС.Сотрудник КАК Сотрудник
	|				ИЗ
	|					РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(, Пользователь = &ТекПользователь) КАК РегДС
	|				ГДЕ
	|					РегДС.ФлагУправления)) КАК РегТР
	|ГДЕ
	|	РегТР.ВладеетРесурсом";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		МассивТР = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ресурс");
	КонецЕсли;
	
	Возврат МассивТР;
	
КонецФункции

// Процедура заполняет таблицу ДанныеЗадач.
//
// Параметры:
//  ДанныеЗадач 		 - ТаблицаЗначения - 
//  Форма 			 - Форма клиентского приложения - Форма документа упоТабельУчетаРабочегоВремени 
//  СтрокаТабеля 	 - Строка ТаблицыЗначений - 
//  ИсходнаяТаблица 	 - ТаблицаЗначений - 
//
Процедура ОбновитьДопДанные(ДанныеЗадач, Форма = Неопределено, СтрокаТабеля = Неопределено, ИсходнаяТаблица = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновныеПараметры = ОсновныеПараметрыСтроки();
	
	Если ИсходнаяТаблица = Неопределено Тогда
		
		Если СтрокаТабеля = Неопределено Тогда
			ТаблицаЗадач = Форма.Объект.ПроектныеЗадачи.Выгрузить(, ОсновныеПараметры);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Форма.Объект.ТабельДня.Выгрузить(, ОсновныеПараметры), ТаблицаЗадач);  
			ТаблицаЗадач.Свернуть(ОсновныеПараметры);		
		Иначе
			ТаблицаЗадач = Форма.Объект.ПроектныеЗадачи.Выгрузить(Новый Массив, ОсновныеПараметры);
			ЗаполнитьЗначенияСвойств(ТаблицаЗадач.Добавить(), СтрокаТабеля);
		КонецЕсли;
		
	Иначе
		
		ТаблицаЗадач = ИсходнаяТаблица.Скопировать(, ОсновныеПараметры);
		ТаблицаЗадач.Свернуть(ОсновныеПараметры);	
		
	КонецЕсли;
	
	ДопДанныеЗадач = ПолучитьДопДанныеПроектныхЗадач(ТаблицаЗадач);
		
	Если НЕ ДопДанныеЗадач = Неопределено Тогда
		
		ЗадачиСДетальнымПланированием = Новый Соответствие;
		Если Форма <> Неопределено Тогда
			ОбъектФормы = Форма.Объект;
			Дата = ОбъектФормы.Дата;
			ЗадачиСДетальнымПланированием(ОбъектФормы.Ресурс, НачалоДня(Дата), КонецДня(Дата), 
				ДопДанныеЗадач.ВыгрузитьКолонку("ПроектнаяЗадача"), ЗадачиСДетальнымПланированием);
		КонецЕсли;
		
		ДобавитьДетальноеПланирование = ЗначениеЗаполнено(ЗадачиСДетальнымПланированием);
		
		Отбор = Новый Структура(ОсновныеПараметры);		
		Для Каждого ДопДанные Из ДопДанныеЗадач Цикл
			ЗаполнитьЗначенияСвойств(Отбор, ДопДанные);
			НайденныеСтроки = ДанныеЗадач.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() Тогда
				СтрокаДанных = НайденныеСтроки[0];
			Иначе
				СтрокаДанных = ДанныеЗадач.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаДанных, ДопДанные);
			
			Если ДопДанные.ДлительностьПлан <> 0 И ДопДанные.ДлительностьПланОкончательный <> 0 Тогда
				СтрокаДанных.ДлительностьПланПредставление = Формат(ДопДанные.ДлительностьПлан, "ЧДЦ=2") + "/" +
					Формат(ДопДанные.ДлительностьПланОкончательный, "ЧДЦ=2");
			ИначеЕсли ДопДанные.ДлительностьПлан = 0 И ДопДанные.ДлительностьПланОкончательный <> 0 Тогда		
				СтрокаДанных.ДлительностьПланПредставление = Формат(ДопДанные.ДлительностьПланОкончательный, "ЧДЦ=2");
			Иначе
				СтрокаДанных.ДлительностьПланПредставление = Формат(ДопДанные.ДлительностьПлан, "ЧДЦ=2");
			КонецЕсли;
			
			СтрокаДанных.ДетальноеПланирование = Ложь;
			
			Если Не ДобавитьДетальноеПланирование Тогда
				Продолжить;
			КонецЕсли;
				
			ЕстьДетальноеПланирование = ЗадачиСДетальнымПланированием[СтрокаДанных.ПроектнаяЗадача];
			Если ЕстьДетальноеПланирование <> Неопределено И ЕстьДетальноеПланирование Тогда
				СтрокаДанных.ДетальноеПланирование = Истина;					
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;				
	
КонецПроцедуры

// Функция получает строку основных параметров строки.
//
// Возвращаемое значение:
//  Строка - массив трудовых ресурсов.
//
Функция ОсновныеПараметрыСтроки() Экспорт
	Возврат "Роль, Подразделение, Задача";
КонецФункции

// Процедура заполняет таблицу ДанныеЗадач.
//
// Параметры:
//  СтрокаТаблицы 		 - Строка ТаблицыЗначений - 
//  ДанныеЗадач 			 - ТаблицаЗначения - 
//  Форма 	 			 - Форма клиентского приложения - Форма документа упоТабельУчетаРабочегоВремени 
//  ОбновлятьДопДаные 	 - Булево - 
//
Процедура ЗаполнитьСтрокуТаблицыДопДанными(СтрокаТаблицы, ДанныеЗадач, Форма = Неопределено, ОбновлятьДопДаные = Ложь) Экспорт 
	
	НайтиДанные = Ложь;
	ПростоеНаименование = Истина;						
	
	ОсновныеПараметры = "Задача, Роль, Подразделение";
	ДанныеЗадачи = СтруктураДопДанныхСтроки();										
	ЗаполнитьЗначенияСвойств(ДанныеЗадачи, СтрокаТаблицы, ОсновныеПараметры);											
											
	Если ТипЗнч(СтрокаТаблицы.Задача) = Тип("СправочникСсылка.упоВнепроектныеЗадачи") Тогда													
	ИначеЕсли ТипЗнч(СтрокаТаблицы.Задача) = Тип("СправочникСсылка.упоВнепроектныеЗадачи") Тогда		
	ИначеЕсли ТипЗнч(СтрокаТаблицы.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда		
		НайтиДанные = Истина;
	ИначеЕсли ТипЗнч(СтрокаТаблицы.Задача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда	
		НайтиДанные = Истина;		
	КонецЕсли;
	
	Если НайтиДанные Тогда
		
		ПростоеНаименование = Ложь;
		
		Отбор = Новый Структура(ОсновныеПараметры);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
		НайденныеСтроки = ДанныеЗадач.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() Тогда
			ЗаполнитьЗначенияСвойств(ДанныеЗадачи, НайденныеСтроки[0]);
		ИначеЕсли ОбновлятьДопДаные Тогда
			Документы.упоТабельУчетаРабочегоВремени.ОбновитьДопДанные(ДанныеЗадач, Форма, СтрокаТаблицы);	
			НайденныеСтроки = ДанныеЗадач.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() Тогда
				ЗаполнитьЗначенияСвойств(ДанныеЗадачи, НайденныеСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ПростоеНаименование Тогда
		ДанныеЗадачи.Наименование = Строка(СтрокаТаблицы.Задача);	
	Иначе
		Если ЗначениеЗаполнено(СтрокаТаблицы.Задача) И СтрокаТаблицы.Задача <> ДанныеЗадачи.ПроектнаяЗадача Тогда
			ДанныеЗадачи.Наименование = 
				?(ЗначениеЗаполнено(ДанныеЗадачи.НазваниеПроектнойЗадачи), "" + ДанныеЗадачи.НазваниеПроектнойЗадачи + " \ ", "") + СтрокаТаблицы.Задача;
		Иначе
			ДанныеЗадачи.Наименование = ДанныеЗадачи.НазваниеПроектнойЗадачи;	
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеЗадачи);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоТабельУчетаРабочегоВремени);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДопДанныеПроектныхЗадач(ТаблицаЗадач) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗадач", ТаблицаЗадач);
	Запрос.УстановитьПараметр("ПредварительныйУровеньПланирования", Перечисления.упоУровеньПланирования.Предварительный);
	Запрос.УстановитьПараметр("ОкончательныйУровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаЗадач.Задача КАК Задача,
	               |	ТаблицаЗадач.Роль КАК Роль,
	               |	ТаблицаЗадач.Подразделение КАК Подразделение
	               |ПОМЕСТИТЬ ТаблицаЗадачИсходная
	               |ИЗ
	               |	&ТаблицаЗадач КАК ТаблицаЗадач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗадач.Задача КАК Задача,
	               |	ТаблицаЗадач.Роль КАК Роль,
	               |	ТаблицаЗадач.Подразделение КАК Подразделение,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ТаблицаЗадач.Задача ССЫЛКА Справочник.упоЗадания
	               |				ТОГДА ВЫРАЗИТЬ(ТаблицаЗадач.Задача КАК Справочник.упоЗадания).ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу
	               |			КОГДА ТаблицаЗадач.Задача ССЫЛКА Документ.упоПроектнаяЗадача
	               |				ТОГДА ТаблицаЗадач.Задача
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
	               |		КОНЕЦ КАК Документ.упоПроектнаяЗадача) КАК ПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА ТаблицаЗадач.Задача ССЫЛКА Справочник.упоЗадания
	               |			ТОГДА ТаблицаЗадач.Задача
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоЗадания.ПустаяСсылка)
	               |	КОНЕЦ КАК Задание
	               |ПОМЕСТИТЬ ТаблицаЗадач
	               |ИЗ
	               |	ТаблицаЗадачИсходная КАК ТаблицаЗадач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗадач.Задание КАК Задание,
	               |	ТаблицаЗадач.Задача КАК Задача,
	               |	ТаблицаЗадач.Подразделение КАК Подразделение,
	               |	ТаблицаЗадач.Роль КАК Роль,
	               |	упоСрокиЗаданий.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	упоСрокиЗаданий.ДатаНачалаПлан КАК ДатаНачалаПлан
	               |ПОМЕСТИТЬ Задания
	               |ИЗ
	               |	ТаблицаЗадач КАК ТаблицаЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	               |		ПО ТаблицаЗадач.Задание = упоСрокиЗаданий.Задание
	               |			И (ТаблицаЗадач.Задание <> ЗНАЧЕНИЕ(Справочник.упоЗадания.ПустаяСсылка))
	               |			И (ТаблицаЗадач.Задание <> НЕОПРЕДЕЛЕНО)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТаблицаЗадач.Задача КАК Задача,
	               |	ТаблицаЗадач.Подразделение КАК Подразделение,
	               |	ТаблицаЗадач.Роль КАК Роль,
	               |	упоВерсииПроекта.Проект КАК Проект,
	               |	упоВерсииПроекта.Версия КАК Версия,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи
	               |ПОМЕСТИТЬ ПроектныеЗадачи
	               |ИЗ
	               |	ТаблицаЗадач КАК ТаблицаЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |		ПО ТаблицаЗадач.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВложенныйЗапрос.Задача КАК Задача,
	               |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	               |	ВложенныйЗапрос.Роль КАК Роль,
	               |	СУММА(ВложенныйЗапрос.ДлительностьПлан) КАК ДлительностьПлан,
	               |	СУММА(ВложенныйЗапрос.ДлительностьФакт) КАК ДлительностьФакт,
	               |	СУММА(ВложенныйЗапрос.ДлительностьПланОкончательный) КАК ДлительностьПланОкончательный
	               |ПОМЕСТИТЬ втДлительность
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |		ПроектныеЗадачи.Задача КАК Задача,
	               |		ПроектныеЗадачи.Подразделение КАК Подразделение,
	               |		ПроектныеЗадачи.Роль КАК Роль,
	               |		ВЫБОР
	               |			КОГДА упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = &ПредварительныйУровеньПланирования
	               |				ТОГДА упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ДлительностьПлан,
	               |		0 КАК ДлительностьФакт,
	               |		ВЫБОР
	               |			КОГДА упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = &ОкончательныйУровеньПланирования
	               |				ТОГДА упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов
	               |			ИНАЧЕ 0
	               |		КОНЕЦ КАК ДлительностьПланОкончательный
	               |	ИЗ
	               |		ПроектныеЗадачи КАК ПроектныеЗадачи
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
	               |			ПО ПроектныеЗадачи.ПроектнаяЗадача = упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача
	               |				И ПроектныеЗадачи.Подразделение = упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Подразделение
	               |				И ПроектныеЗадачи.Роль = упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс
	               |	ГДЕ
	               |		упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					ПроектныеЗАдачи.ПроектнаяЗадача
	               |				ИЗ
	               |					ПроектныеЗАдачи КАК ПроектныеЗАдачи)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПроектныеЗадачи.ПроектнаяЗадача,
	               |		ПроектныеЗадачи.Задача,
	               |		ПроектныеЗадачи.Подразделение,
	               |		ПроектныеЗадачи.Роль,
	               |		0,
	               |		упоФактТрудозатратСводно.КоличествоЧасов,
	               |		0
	               |	ИЗ
	               |		ПроектныеЗадачи КАК ПроектныеЗадачи
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоФактТрудозатратСводно КАК упоФактТрудозатратСводно
	               |			ПО ПроектныеЗадачи.ПроектнаяЗадача = упоФактТрудозатратСводно.ПроектнаяЗадача
	               |				И ПроектныеЗадачи.Подразделение = упоФактТрудозатратСводно.Подразделение
	               |				И ПроектныеЗадачи.Роль = упоФактТрудозатратСводно.Ресурс
	               |	ГДЕ
	               |		упоФактТрудозатратСводно.УровеньПланирования = &ПредварительныйУровеньПланирования) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Подразделение,
	               |	ВложенныйЗапрос.Роль,
	               |	ВложенныйЗапрос.ПроектнаяЗадача,
	               |	ВложенныйЗапрос.Задача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан
	               |ПОМЕСТИТЬ втСрокиПЗ
	               |ИЗ
	               |	ПроектныеЗадачи КАК ПроектныеЗадачи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ПО ПроектныеЗадачи.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И ПроектныеЗадачи.Версия = упоСрокиПроектныхЗадачСрезПоследних.Версия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроектныеЗадачи.Проект КАК Проект,
	               |	ЛОЖЬ КАК ПроектПометкаУдаления,
	               |	ПроектныеЗадачи.Задача КАК Задача,
	               |	ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЛОЖЬ КАК ПроектнаяЗадачаПометкаУдаления,
	               |	ПроектныеЗадачи.Роль КАК Роль,
	               |	ПроектныеЗадачи.Подразделение КАК Подразделение,
	               |	упоРуководителиПроектовСрезПоследних.РуководительПроекта КАК РуководительПроекта,
	               |	ЕСТЬNULL(Задания.ДатаНачалаПлан, втСрокиПЗ.ДатаНачалаПлан) КАК ДатаНачала,
	               |	ЕСТЬNULL(Задания.ДатаОкончанияПлан, втСрокиПЗ.ДатаЗавершенияПлан) КАК ДатаЗавершения,
	               |	ПроектныеЗадачи.НазваниеЗадачи КАК НазваниеПроектнойЗадачи,
	               |	втДлительность.ДлительностьПлан КАК ДлительностьПлан,
	               |	втДлительность.ДлительностьФакт КАК ДлительностьФакт,
	               |	втДлительность.ДлительностьПланОкончательный КАК ДлительностьПланОкончательный
	               |ИЗ
	               |	ПроектныеЗадачи КАК ПроектныеЗадачи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК упоРуководителиПроектовСрезПоследних
	               |		ПО ПроектныеЗадачи.Проект = упоРуководителиПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втДлительность КАК втДлительность
	               |		ПО ПроектныеЗадачи.ПроектнаяЗадача = втДлительность.ПроектнаяЗадача
	               |			И ПроектныеЗадачи.Подразделение = втДлительность.Подразделение
	               |			И ПроектныеЗадачи.Роль = втДлительность.Роль
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задания КАК Задания
	               |		ПО ПроектныеЗадачи.Задача = Задания.Задача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСрокиПЗ КАК втСрокиПЗ
	               |		ПО ПроектныеЗадачи.ПроектнаяЗадача = втСрокиПЗ.ПроектнаяЗадача"; 
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
КонецФункции

Функция СтруктураДопДанныхСтроки()
	Возврат Новый Структура("ДлительностьПлан, ДлительностьПланПредставление, ДлительностьФакт, ДатаНачала, ДатаЗавершения, 
											| Проект, ПроектПометкаУдаления, РуководительПроекта, ПроектнаяЗадача, ПроектнаяЗадачаПометкаУдаления, Наименование, НазваниеПроектнойЗадачи,
											| Роль, Подразделение, Задача, ДетальноеПланирование");
КонецФункции 

Процедура ЗадачиСДетальнымПланированием(Исполнитель, НачалоДня, КонецДня, ПроектныеЗадачи, 
	ЗадачиСДетальнымПланированием)
	
	// Выбираем задачи, назначенные ТР на конкретную дату обработкой ОперЗагрузка и документа ПланированиеТРЗ.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДетальноеПланирование.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	(ВЫБРАТЬ
	|		упоОперативнаяЗагрузкаСпециалистов.ПроектнаяЗадача КАК ПроектнаяЗадача
	|	ИЗ
	|		РегистрСведений.упоОперативнаяЗагрузкаСпециалистов.СрезПоследних(
	|				,
	|				ПроектнаяЗадача В (&ПроектныеЗадачи)
	|					И ТрудовойРесурс = &Исполнитель
	|					И ДатаВремя >= &ДатаНачала
	|					И ДатаВремя <= &ДатаКонца) КАК упоОперативнаяЗагрузкаСпециалистов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		упоДанныеРаспределенияПланаТрудозатратТР.ПроектнаяЗадача
	|	ИЗ
	|		РегистрСведений.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.СрезПоследних(
	|				,
	|				ПроектнаяЗадача В (&ПроектныеЗадачи)
	|					И Ресурс = &Исполнитель
	|					И Дата >= &ДатаНачала
	|					И Дата <= &ДатаКонца) КАК упоДанныеРаспределенияПланаТрудозатратТР) КАК ДетальноеПланирование"; 
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗадачиСДетальнымПланированием.Вставить(Выборка.ПроектнаяЗадача, Истина);
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли