
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ПроверятьРазграничениеДоступа = Не (ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ЭтотОбъект.ДополнительныеСвойства.НеПроверятьРазграничениеДоступа);
		
	ТекстыСообщений = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Ресурс) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Ресурс"" не заполнено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПроверятьРазграничениеДоступа
			И Не упоРесурсыИРолиСервер.РесурсУправляетсяТекущимПользователем(Ресурс) Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Текущий пользователь не является владельцем выбранного трудового ресурса ""%1"".'"),
			Ресурс);
		ТекстыСообщений.Добавить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли; 
	
	Для Каждого СтрокаТЧ Из ТабельДня Цикл
		Если СтрокаТЧ.ДлительностьВЧасах < 0 Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Длительность задачи меньше 0 в строке табеля №%1.'"), 
				СтрокаТЧ.НомерСтроки);
			ТекстыСообщений.Добавить(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ДокументДня = Документы.упоТабельУчетаРабочегоВремени.ПолучитьДокументДня(Ресурс, Дата);
	Если ЗначениеЗаполнено(ДокументДня) И ДокументДня <> ЭтотОбъект.Ссылка Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка записи документа %1. 
			|Для выбранных дня ""%2"" и трудового ресурса ""%3"" уже существует табель рабочего дня.'"),
			Ссылка,
			Формат(Дата, "ДЛФ=ДД"),
			Ресурс);
		ТекстыСообщений.Добавить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстСообщения = СтрСоединить(ТекстыСообщений, Символы.ПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , ЭтотОбъект.Ссылка, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Дата = КонецДня(ЭтотОбъект.Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьВозможностьСписанияФактическихЗатрат(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьРаспределениеРабочегоВремениТрудовогоРесурсаВДругихДокументах(Отказ); 

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокумента(Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДатаСеанса();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроведениеДокумента(Отказ, РежимПроведения)
	
	Движения.упоФактТрудозатратПоДням.Записывать 		= Истина;
	Движения.упоФактТрудозатратСводно.Записывать 		= Истина;
	Движения.упоИспользованиеРабочегоВремени.Записывать = Истина;
	
	Запрос = Новый Запрос;
	// Проведение в привилегированном режиме.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(упоТабельУчетаРабочегоВремениТабельДня.ДлительностьВЧасах) КАК ДлительностьВЧасах,
	|	упоТабельУчетаРабочегоВремениТабельДня.Задача КАК Задача,
	|	ВЫРАЗИТЬ(упоТабельУчетаРабочегоВремениТабельДня.Комментарий КАК СТРОКА(250)) КАК Комментарий,
	|	упоТабельУчетаРабочегоВремениТабельДня.Роль КАК Роль,
	|	упоТабельУчетаРабочегоВремениТабельДня.Подразделение КАК Подразделение,
	|	упоТабельУчетаРабочегоВремениТабельДня.Начало КАК Начало,
	|	упоТабельУчетаРабочегоВремениТабельДня.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ ВРТабель
	|ИЗ
	|	Документ.упоТабельУчетаРабочегоВремени.ТабельДня КАК упоТабельУчетаРабочегоВремениТабельДня
	|ГДЕ
	|	упоТабельУчетаРабочегоВремениТабельДня.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	упоТабельУчетаРабочегоВремениТабельДня.Задача,
	|	упоТабельУчетаРабочегоВремениТабельДня.Роль,
	|	ВЫРАЗИТЬ(упоТабельУчетаРабочегоВремениТабельДня.Комментарий КАК СТРОКА(250)),
	|	упоТабельУчетаРабочегоВремениТабельДня.Начало,
	|	упоТабельУчетаРабочегоВремениТабельДня.ВидОперации,
	|	упоТабельУчетаРабочегоВремениТабельДня.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВРТабель.Роль КАК Ресурс
	|ПОМЕСТИТЬ втРесурсыТабеля
	|ИЗ
	|	ВРТабель КАК ВРТабель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&РесурсТабеля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Задача КАК Задача,
	|	ВложенныйЗапрос.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	Проекты.Ссылка КАК ПроектнаяЗадачаЗеркало
	|ПОМЕСТИТЬ втЗадачиТабеля
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВРТабель.Задача КАК Задача,
	|		ЕСТЬNULL(упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу, ВЫРАЗИТЬ(ВРТабель.Задача КАК Документ.упоПроектнаяЗадача)) КАК ПроектнаяЗадача
	|	ИЗ
	|		ВРТабель КАК ВРТабель
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК упоЗадания
	|			ПО ((ВЫРАЗИТЬ(ВРТабель.Задача КАК Справочник.упоЗадания)) = упоЗадания.Ссылка)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО ВложенныйЗапрос.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	|			И (НЕ ВложенныйЗапрос.ПроектнаяЗадача = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗадачиТабеля.Задача КАК Задача,
	|	втЗадачиТабеля.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	втЗадачиТабеля.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов
	|ПОМЕСТИТЬ втСвойстваЗадачТабеля
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачиТабеля КАК втЗадачиТабеля
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = втЗадачиТабеля.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВРТабель.ДлительностьВЧасах КАК ДлительностьВЧасах,
	|	ВРТабель.Задача КАК Задача,
	|	ВРТабель.Комментарий КАК Комментарий,
	|	ВРТабель.Роль КАК Роль,
	|	ВЫБОР
	|		КОГДА ВРТабель.Подразделение = ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
	|			ТОГДА &ПодразделениеТабеля
	|		ИНАЧЕ ВРТабель.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ЕСТЬNULL(втСвойстваЗадачТабеля.ПроектнаяЗадача, ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)) КАК ПроектнаяЗадача,
	|	ЕСТЬNULL(втСвойстваЗадачТабеля.НормаСтоимостиТрудовыхРесурсов, НЕОПРЕДЕЛЕНО) КАК НормаСтоимости,
	|	ВРТабель.ВидОперации КАК ВидОперации,
	|	ЕСТЬNULL(втСвойстваЗадачТабеля.ПроектнаяЗадачаЗеркало, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК ПроектнаяЗадачаЗеркало,
	|	ВРТабель.Начало КАК Начало
	|ИЗ
	|	ВРТабель КАК ВРТабель
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваЗадачТабеля КАК втСвойстваЗадачТабеля
	|		ПО ВРТабель.Задача = втСвойстваЗадачТабеля.Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегНормы.Ресурс КАК Ресурс,
	|	РегНормы.Норма КАК Норма,
	|	РегНормы.ЕдиницаНормирования КАК ЕдиницаНормирования,
	|	РегНормы.ЕдСтоимость КАК СтоимостьЕдиницы,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(РегНормы.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени) ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РегНормы.ЕдиницаНормирования ЕСТЬ NULL
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР
	|						КОГДА РегНормы.ЕдиницаНормирования.Коэффициент > 0
	|							ТОГДА РегНормы.ЕдСтоимость / РегНормы.ЕдиницаНормирования.Коэффициент
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьЧаса
	|ИЗ
	|	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(&ДатаДок, ) КАК РегНормы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРесурсыТабеля КАК втРесурсыТабеля
	|		ПО РегНормы.Ресурс = втРесурсыТабеля.Ресурс";
	
	Запрос.УстановитьПараметр("ДатаДок", 				КонецДня(ЭтотОбъект.Дата));
	Запрос.УстановитьПараметр("Ссылка", 				ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("РесурсТабеля", 			ЭтотОбъект.Ресурс);
	Запрос.УстановитьПараметр("ПодразделениеТабеля", 	ЭтотОбъект.Подразделение);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ИндексПоследнего = РезультатЗапроса.Количество() - 1;
	
	ТаблицаТабеля 			= РезультатЗапроса[ИндексПоследнего - 1].Выгрузить();
	ТаблицаНормСтоимости 	= РезультатЗапроса[ИндексПоследнего].Выгрузить();
			
	ТаблицаЗадач = ТаблицаТабеля.Скопировать();
	ТаблицаЗадач.Свернуть("Задача, ПроектнаяЗадача, ПроектнаяЗадачаЗеркало, Роль, Подразделение, НормаСтоимости, 
		| ВидОперации", "ДлительностьВЧасах");	
	
	// упоФактТрудозатратПоДням И упоФактТрудозатратСводно.
	СформироватьДвижения_упоФактТрудозатрат(ТаблицаЗадач, ТаблицаНормСтоимости);
	
	// упоИспользованиеРабочегоВремени.
	СформироватьДвижения_упоИспользованиеРабочегоВремени(ТаблицаТабеля);
		
КонецПроцедуры

Процедура ПроверитьВозможностьСписанияФактическихЗатрат(Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПЗ.Задача КАК Задача
	               |ПОМЕСТИТЬ Задачи
	               |ИЗ
	               |	&ПЗ КАК ПЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Задачи.Задача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ПроектныеЗадачи
	               |ИЗ
	               |	Задачи КАК Задачи
	               |ГДЕ
	               |	Задачи.Задача ССЫЛКА Документ.упоПроектнаяЗадача
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу
	               |ИЗ
	               |	Задачи КАК Задачи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК упоЗадания
	               |		ПО Задачи.Задача = упоЗадания.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
				   |	ПроектныеЗадачи.ПроектнаяЗадача.Проект КАК Проект,
				   |	&Дата КАК ДатаСтатуса
				   |ИЗ
	               |	ПроектныеЗадачи КАК ПроектныеЗадачи
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ 
	               |	Задачи.Задача КАК Задание
	               |ИЗ
	               |	Задачи КАК Задачи
	               |ГДЕ
	               |	Задачи.Задача ССЫЛКА Справочник.упоЗадания";
	
	Запрос.УстановитьПараметр("ПЗ", ТабельДня.Выгрузить(, "Задача"));
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТЗ = РезультатЗапроса[2].Выгрузить();
	
	СотрудникТР = упоРесурсыИРолиВызовСервера.обПолучитьТекущегоВладельцаРесурса(Ресурс);
	
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоПроектамСУчетомСтатуса(
			ТЗ, СотрудникТР, "Остановлен", Отказ);
			
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоПроектамСУчетомСтатуса(
			ТЗ, СотрудникТР, "ЗапланированУтвержден", Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.упоРазрешитьРаспределениеРабочегоВремениПоЗакрытымЗадачам.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПЗ = ТЗ.ВыгрузитьКолонку("ПроектнаяЗадача");
	МассивЗаданий = РезультатЗапроса[3].Выгрузить().ВыгрузитьКолонку("Задание");
	
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоЗакрытымЗадачам(
		МассивПЗ,
		МассивЗаданий,
		Отказ);
	
КонецПроцедуры

Процедура ПроверитьРаспределениеРабочегоВремениТрудовогоРесурсаВДругихДокументах(Отказ)
	
	Если Константы.упоОтключитьПроверкуКоличестваРабочихЧасов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(упоТабельУчетаРабочегоВремениТабельДня.ДлительностьВЧасах) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудозатратыДокумента
	|ИЗ
	|	Документ.упоТабельУчетаРабочегоВремени.ТабельДня КАК упоТабельУчетаРабочегоВремениТабельДня
	|ГДЕ
	|	упоТабельУчетаРабочегоВремениТабельДня.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоИспользованиеРабочегоВремени.Регистратор КАК Регистратор,
	|	СУММА(упоИспользованиеРабочегоВремени.Трудозатраты) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудозатратыВБазеСРегистратором
	|ИЗ
	|	РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
	|ГДЕ
	|	упоИспользованиеРабочегоВремени.Регистратор <> &Ссылка
	|	И упоИспользованиеРабочегоВремени.ТрудовойРесурс = &ТрудовойРесурс
	|	И упоИспользованиеРабочегоВремени.День = &ДатаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	упоИспользованиеРабочегоВремени.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТрудозатратыВБазеСРегистратором.Регистратор) КАК КоличествоРегистраторов,
	|	СУММА(ТрудозатратыВБазеСРегистратором.Трудозатраты) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудозатратыВБазе
	|ИЗ
	|	ТрудозатратыВБазеСРегистратором КАК ТрудозатратыВБазеСРегистратором
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТрудозатратыДокумента.Трудозатраты КАК ТрудозатратыДокументаВДень,
	|	ТрудозатратыВБазе.Трудозатраты КАК ТрудозатратыТекущие,
	|	ТрудозатратыВБазе.КоличествоРегистраторов КАК КоличествоРегистраторов,
	|	24 - ТрудозатратыВБазе.Трудозатраты - ТрудозатратыДокумента.Трудозатраты КАК Превышение
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента,
	|	ТрудозатратыВБазе КАК ТрудозатратыВБазе
	|ГДЕ
	|	ТрудозатратыДокумента.Трудозатраты + ТрудозатратыВБазе.Трудозатраты > 24
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДатаДокумента КАК День,
	|	ИтоговаяТаблица.ТрудозатратыДокументаВДень КАК ТрудозатратыДокументаВДень,
	|	ИтоговаяТаблица.ТрудозатратыТекущие КАК ТрудозатратыТекущие,
	|	ИтоговаяТаблица.КоличествоРегистраторов КАК КоличествоРегистраторов,
	|	-ИтоговаяТаблица.Превышение КАК Превышение,
	|	ТрудозатратыВБазеСРегистратором.Регистратор КАК Регистратор,
	|	ТрудозатратыВБазеСРегистратором.Трудозатраты КАК Трудозатраты
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица,
	|	ТрудозатратыВБазеСРегистратором КАК ТрудозатратыВБазеСРегистратором";
	
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТрудовойРесурс", Ресурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	упоРаспределениеТрудозатратВызовСервера.СообщитьОбОшибкахПроверкиПриПроведении(РезультатЗапроса, Ресурс);
			
КонецПроцедуры

Процедура СформироватьДвижения_упоФактТрудозатрат(ТаблицаЗадач, ТаблицаНормСтоимости)
	
	ИспользоватьСтавкуТрудовогоРесурсаДляПредварительного = 
		Константы.упоИспользоватьСтавкуТрудовогоРесурсаПриРасчетеСтоимостиТрудозатрат.Получить();	
	
	Движения_упоФактТрудозатратПоДням = 
		упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоФактТрудозатратПоДням");
	Движения_упоФактТрудозатратСводно = 
		упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоФактТрудозатратСводно");
	
	Для каждого СтрокаДанных Из ТаблицаЗадач Цикл		
		
		Если СтрокаДанных.ДлительностьВЧасах = 0 Тогда 
			Продолжить; 
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаДанных.ПроектнаяЗадача) Тогда 
			Продолжить; 
		КонецЕсли;			
		
		//
		
		Если ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда
			Задание = СтрокаДанных.Задача;
		Иначе
			Задание = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВидОперации) Тогда
			ВидОперации = СтрокаДанных.ВидОперации;	
		Иначе
			ВидОперации = Справочники.упоВидыОпераций.Явка;	
		КонецЕсли; 
		
		СтоимостьПоУровням = СтоимостьРесурсаПоУровням(СтрокаДанных, 
													ТаблицаНормСтоимости, 
													ИспользоватьСтавкуТрудовогоРесурсаДляПредварительного);
		СтоимостьПредварительныйУровень = СтоимостьПоУровням.ПредварительныйУровень;
		СтоимостьОкончательныйУровень 	= СтоимостьПоУровням.ОкончательныйУровень;									
		
		СтрокаИсключаяСвойства = "Ресурс, Роль, УровеньПланирования, Стоимость";
		
		// упоФактТрудозатратПоДням
		
		ДвижениеОкончательный = Движения_упоФактТрудозатратПоДням.Добавить();						
		ДвижениеОкончательный.Операция 				= СтрокаДанных.ПроектнаяЗадача;
		ДвижениеОкончательный.Ресурс 				= ЭтотОбъект.Ресурс;     
		ДвижениеОкончательный.Роль 					= СтрокаДанных.Роль;
		ДвижениеОкончательный.Подразделение 		= СтрокаДанных.Подразделение;
		ДвижениеОкончательный.День 					= ЭтотОбъект.Дата;
		ДвижениеОкончательный.УровеньПланирования 	= Перечисления.упоУровеньПланирования.Окончательный;
		ДвижениеОкончательный.Трудозатраты 			= СтрокаДанных.ДлительностьВЧасах;		
		ДвижениеОкончательный.Стоимость 			= СтоимостьОкончательныйУровень;
		ДвижениеОкончательный.Задание 				= Задание;
		ДвижениеОкончательный.ВидОперации 			= ВидОперации;
		
		ДвижениеПредварительный = Движения_упоФактТрудозатратПоДням.Добавить();		
		ЗаполнитьЗначенияСвойств(ДвижениеПредварительный, ДвижениеОкончательный,, СтрокаИсключаяСвойства);		
		ДвижениеПредварительный.Ресурс 				= СтрокаДанных.Роль;
		ДвижениеПредварительный.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;		
		ДвижениеПредварительный.Стоимость 			= СтоимостьПредварительныйУровень;
		
		// упоФактТрудозатратСводно
		
		ДвижениеОкончательный = Движения_упоФактТрудозатратСводно.Добавить();		
		ДвижениеОкончательный.ПроектнаяЗадача 		= СтрокаДанных.ПроектнаяЗадача;
		ДвижениеОкончательный.ВидОперации 			= ВидОперации;	    
		ДвижениеОкончательный.Роль 					= СтрокаДанных.Роль;
		ДвижениеОкончательный.Подразделение			= СтрокаДанных.Подразделение;		
		ДвижениеОкончательный.Ресурс 				= ЭтотОбъект.Ресурс;
		ДвижениеОкончательный.УровеньПланирования 	= Перечисления.упоУровеньПланирования.Окончательный;		
		ДвижениеОкончательный.КоличествоЧасов 		= СтрокаДанных.ДлительностьВЧасах;
		ДвижениеОкончательный.Стоимость 			= СтоимостьОкончательныйУровень;
		ДвижениеОкончательный.Задание 				= Задание;
		
		ДвижениеПредварительный = Движения_упоФактТрудозатратСводно.Добавить();		
		ЗаполнитьЗначенияСвойств(ДвижениеПредварительный, ДвижениеОкончательный,, СтрокаИсключаяСвойства);						
		ДвижениеПредварительный.Ресурс 				= СтрокаДанных.Роль;
		ДвижениеПредварительный.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;				
		ДвижениеПредварительный.Стоимость 			= СтоимостьПредварительныйУровень;		
									
	КонецЦикла; 
	
	ЗагрузитьТаблицуВДвиженияРегистра(Движения_упоФактТрудозатратПоДням, "упоФактТрудозатратПоДням");
	ЗагрузитьТаблицуВДвиженияРегистра(Движения_упоФактТрудозатратСводно, "упоФактТрудозатратСводно");
	
КонецПроцедуры	

Процедура СформироватьДвижения_упоИспользованиеРабочегоВремени(ТаблицаЗадач)
	
	Движения_упоИспользованиеРабочегоВремени = 
		упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоИспользованиеРабочегоВремени");
		
	ДатаГод 	= Год(Дата);
	ДатаМесяц 	= Месяц(Дата);
	ДатаДень 	= День(Дата);
		
	Для каждого СтрокаДанных Из ТаблицаЗадач Цикл		
		
		Если СтрокаДанных.ДлительностьВЧасах = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.Задача) Тогда 
			Продолжить;
		КонецЕсли;
		
		//
		
		Если ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоВнепроектныеЗадачи") Тогда
			РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача;
		ИначеЕсли ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоПричиныПотерьРабочегоВремени") Тогда
			РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени;
		ИначеЕсли ТипЗнч(СтрокаДанных.Задача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда	
			РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
		ИначеЕсли ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда		
			Если ЗначениеЗаполнено(СтрокаДанных.ПроектнаяЗадача) Тогда
				РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
			Иначе
				РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ПроектнаяЗадача) Тогда
			РабочееЗадание 	= СтрокаДанных.ПроектнаяЗадача;
			ЗадачаПричина 	= СтрокаДанных.ПроектнаяЗадачаЗеркало;	
		Иначе
			РабочееЗадание 	= Неопределено;
			ЗадачаПричина 	= СтрокаДанных.Задача;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда
			Задание = СтрокаДанных.Задача;	
		Иначе
			Задание = Неопределено;
		КонецЕсли;
		
		Начало = Дата(ДатаГод, 
					ДатаМесяц, 
					ДатаДень, 
					Час(СтрокаДанных.Начало), 
					Минута(СтрокаДанных.Начало), 
					Секунда(СтрокаДанных.Начало));
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВидОперации) Тогда
			ВидОперации = СтрокаДанных.ВидОперации;	
		Иначе
			ВидОперации = Справочники.упоВидыОпераций.Явка;
			
			Если ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоВнепроектныеЗадачи")
				Или ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоПричиныПотерьРабочегоВремени") Тогда
				ВидОперацииЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.Задача, "ВидОперации");
				Если ЗначениеЗаполнено(ВидОперацииЗадачи) Тогда
					ВидОперации = ВидОперацииЗадачи;	
				КонецЕсли;					
			КонецЕсли;							
		КонецЕсли;	
		
		//
		
		Движение = Движения_упоИспользованиеРабочегоВремени.Добавить();		
		Движение.ТрудовойРесурс 		= ЭтотОбъект.Ресурс;			
		Движение.РазделУчета 			= РазделУчета;
		Движение.ЗадачаПричина 			= ЗадачаПричина;
		Движение.РабочееЗадание 		= РабочееЗадание;
		Движение.День 					= ЭтотОбъект.Дата;
		Движение.Начало 				= Начало; 
		Движение.РасшифровкаТрудозатрат = СтрокаДанных.Комментарий;
		Движение.Подразделение			= СтрокаДанных.Подразделение;
		Движение.РольРесурса 			= СтрокаДанных.Роль;
		Движение.Трудозатраты 			= СтрокаДанных.ДлительностьВЧасах;
		Движение.ВидОперации 			= ВидОперации;
		Движение.Задание 				= Задание;
		
	КонецЦикла;
	
	ЗагрузитьТаблицуВДвиженияРегистра(Движения_упоИспользованиеРабочегоВремени, "упоИспользованиеРабочегоВремени");
		
КонецПроцедуры	

Процедура ЗагрузитьТаблицуВДвиженияРегистра(ТаблицаДвижений, ИмяРегистра)
		
	упоФункцииОбщегоНазначенияСервер.СвернутьТаблицуДвижений(ТаблицаДвижений, 
															ИмяРегистра);
	упоФункцииОбщегоНазначенияСервер.ЗаполнитьСистемныеПоляТаблицыДвиженийРегистраСведений(
															ТаблицаДвижений, 
															ЭтотОбъект.Ссылка, 
															ЭтотОбъект.Дата);
	Движения[ИмяРегистра].Загрузить(ТаблицаДвижений);
	
КонецПроцедуры	

Функция СтоимостьРесурсаПоУровням(СтрокаДанных, 
	ТаблицаНормСтоимости, 
	ИспользоватьСтавкуТрудовогоРесурсаДляПредварительного)
	
	НормаСтоимостиФакт = СтрокаДанных.НормаСтоимости; 	
	
	ОтборПоТрудовомуРесурсу = Новый Структура("Ресурс, Норма", ЭтотОбъект.Ресурс, НормаСтоимостиФакт);	
	ОтборПоРоли 			= Новый Структура("Ресурс, Норма", СтрокаДанных.Роль, НормаСтоимостиФакт);
	
	СтрокаНормыПоПредварительномуУровню = Неопределено;
	СтрокаНормыПоОкончательномуУровню 	= Неопределено;	
	
	СтрокиНормыСтоимостиПоОкончательномуУровню 		= ТаблицаНормСтоимости.НайтиСтроки(ОтборПоТрудовомуРесурсу);
	СтрокиНормыСтоимостиПоПредварительномуУровню 	= ТаблицаНормСтоимости.НайтиСтроки(ОтборПоРоли);
	
	Если СтрокиНормыСтоимостиПоОкончательномуУровню.Количество() 
		И Не СтрокиНормыСтоимостиПоОкончательномуУровню[0].СтоимостьЧаса = 0 Тогда
		СтрокаНормыПоОкончательномуУровню = СтрокиНормыСтоимостиПоОкончательномуУровню[0];	
	ИначеЕсли СтрокиНормыСтоимостиПоПредварительномуУровню.Количество() 
		И Не СтрокиНормыСтоимостиПоПредварительномуУровню[0].СтоимостьЧаса = 0 Тогда
		СтрокаНормыПоОкончательномуУровню = СтрокиНормыСтоимостиПоПредварительномуУровню[0];	
	КонецЕсли;
	
	Если ИспользоватьСтавкуТрудовогоРесурсаДляПредварительного Тогда
		СтрокаНормыПоПредварительномуУровню = СтрокаНормыПоОкончательномуУровню;
	ИначеЕсли СтрокиНормыСтоимостиПоПредварительномуУровню.Количество() 
		И Не СтрокиНормыСтоимостиПоПредварительномуУровню[0].СтоимостьЧаса = 0 Тогда
		СтрокаНормыПоПредварительномуУровню = СтрокиНормыСтоимостиПоПредварительномуУровню[0];
	КонецЕсли;		
	
	СтоимостьПредварительныйУровень = 0;
	СтоимостьОкончательныйУровень 	= 0;
	Если СтрокаНормыПоПредварительномуУровню <> Неопределено Тогда
		СтоимостьПредварительныйУровень = СтрокаДанных.ДлительностьВЧасах 
		* СтрокаНормыПоПредварительномуУровню.СтоимостьЧаса;
	КонецЕсли;
	Если СтрокаНормыПоОкончательномуУровню <> Неопределено Тогда
		СтоимостьОкончательныйУровень = СтрокаДанных.ДлительностьВЧасах 
		* СтрокаНормыПоОкончательномуУровню.СтоимостьЧаса;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПредварительныйУровень", 	СтоимостьПредварительныйУровень);
	Результат.Вставить("ОкончательныйУровень", 		СтоимостьОкончательныйУровень);
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли

