
#Область ПрограммныйИнтерфейс

// Главная функция. По актуальным данным проекта пересчитывает 
// статусы и проценты готовности для всех проектных задач.
// Расчет проводится с учетом настроек пользователя.
// 
// Параметры:
//  вхПараметры - Структура - содержит параметры расчета, настраиваемые пользователем. Свойства:
//		* Проект 			- СправочникСсылка.Проекты, заданный проект, по которому собираются данные.
//		* ТекущаяВерсия 			- ДокументСсылка.упоВерсияПроекта, версия проекта
//		* УчитыватьТрудозатратыПриРасчетеГотовности 			- Булево
// 
// Возвращаемое значение:
//  Структура - содержит рассчитанные (актуализированыые) данные. Свойства:
//		* ДанныеЗадач - ТаблицаЗначений - содержит рассчитанные данные по проектным задачам.
//
Функция обАктуализацияГотовностиПроектныхЗадач(вхПараметры) Экспорт
	
	// Структура выходных данных.
	ТаблицаДанныхЗадачи = Новый ТаблицаЗначений;
	ТаблицаДанныхЗадачи.Колонки.Добавить("Задача");
	ТаблицаДанныхЗадачи.Колонки.Добавить("Готовность");
	ТаблицаДанныхЗадачи.Колонки.Добавить("Статус");
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеЗадач", ТаблицаДанныхЗадачи);
	СтруктураДанных.Вставить("ГотовностьПроекта", 0);
	
	ТаблицаЗадачи  = ПолучитьАктуальныеПараметрыЗадач(вхПараметры.Проект, вхПараметры.ТекущаяВерсия, 
						вхПараметры.НастройкаУровняПланированияПриРасчетеГотовностиПроектов);
										
	Если вхПараметры.Свойство("ТаблицаРучнойПроцентГотовности") Тогда
		Для Каждого СтрРучнойПроцент Из вхПараметры.ТаблицаРучнойПроцентГотовности Цикл
			РезПоиска = ТаблицаЗадачи.Найти(СтрРучнойПроцент.Задача, "Задача");
			Если Не РезПоиска = Неопределено Тогда
				РезПоиска.Готовность = СтрРучнойПроцент.Процент;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Если вхПараметры.Свойство("ТаблицаСвойстваПЗ") Тогда
		Для Каждого СтрокаСвойств Из вхПараметры.ТаблицаСвойстваПЗ Цикл	
			РезПоиска = ТаблицаЗадачи.Найти(СтрокаСвойств.ПроектнаяЗадача, "Задача");
			Если Не РезПоиска = Неопределено Тогда
				РезПоиска.Длительность = СтрокаСвойств.Длительность;
				РезПоиска.Родитель = СтрокаСвойств.ЗадачаРодитель;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Для Каждого СтрокаЗадачи Из ТаблицаЗадачи Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗадачи.Родитель) Тогда
			СтрокаЗадачи.Родитель = вхПараметры.Проект;	
		КонецЕсли;
	КонецЦикла;	
		
	НовСтрПроекта = ТаблицаЗадачи.Вставить(0);
	НовСтрПроекта.Задача = вхПараметры.Проект; 
	НовСтрПроекта.Длительность = 0;
	НовСтрПроекта.Готовность = 0;
	НовСтрПроекта.ОбщДЗ = 0;
	НовСтрПроекта.ВыпДЗ = 0;
	
	Если Не вхПараметры.Свойство("ИспДлитВместоПустТрудЗатДляРасчГотовности") Тогда
		вхПараметры.Вставить("ИспДлитВместоПустТрудЗатДляРасчГотовности", Ложь);
	КонецЕсли;
	
	РассчитатьГотовностьЗадачПоВходящимДанным(ТаблицаЗадачи, 
		вхПараметры.УчитыватьТрудозатратыПриРасчетеГотовности,
		вхПараметры.ИспДлитВместоПустТрудЗатДляРасчГотовности);
		
	Для Каждого ТекЗадача Из ТаблицаЗадачи Цикл
		
		Если ТекЗадача.Задача = вхПараметры.Проект Тогда
			РасчетнаяГотовность = ОкруглениеРасчетнойГотовности(ТекЗадача.Готовность);
			СтруктураДанных.Вставить("ГотовностьПроекта", РасчетнаяГотовность);
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДанныхЗадачи.Добавить();
		НоваяСтрока.Задача = ТекЗадача.Задача;
		
		НоваяСтрока.Готовность = ОкруглениеРасчетнойГотовности(ТекЗадача.Готовность) ;
		
		НоваяСтрока.Статус = упоПроектыИЗадачиОбщие.ПолучитьСтатусЗадачиПоПроцентуГотовности(НоваяСтрока.Готовность, ТекЗадача.Статус); 	
		
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции

// Производит актуализацию финансовых планов проекта (БДР и БДДС)
//  в соответствии с новыми сроками проектных задач.
//  Технически функция производит заполнение таблиц движений документа
//  по регистрам, в которых хранятся актуальные финансовые планы.
//
// Параметры:
//  ДокументОбъект							 - ДокументОбъект	 - который производит движение регистров.
//  ДанныеДокумента							 - Структура		 - полный слепок всех данных документа.
//  ТаблицаЗадач							 - ТаблицаЗначений	 - содержит новые сроки проектных задач:
//  	* Задача - ДокументСсылка.ПроектнаяЗадача,
//  	* ДатаНачала - Дата,
//  	* ДатаЗавершения - Дата.
//  Движения								 - Структура		 - содержит таблицы движений по регистрам БДР, БДДС и срокам проектных задач.
//  ЭтоПроектнаяЗадача						 - Булево			 - флаг указывает на расчет финансовых планов
//  			не для всего проекта, а только для одной задачи.
//  МассивЗадач								 - Массив			 - массив ссылок на документ "Проектная задача",
//  			для которых нужно провести актуализацию.
//  АктуализироватьРегистрыТабличныхЧастей	 - Булево			 - признак необходимости актуализировать регистры.
// 
// Возвращаемое значение:
//  Булево - – признак успешного завершения операции.
//
Функция обАктуализацияФинансовыхПлановПроекта(ДокументОбъект,
											  ДанныеДокумента,
											  ТаблицаЗадач,
											  Движения,
											  ЭтоПроектнаяЗадача = Ложь,
											  МассивЗадач = Неопределено,
											  АктуализироватьРегистрыТабличныхЧастей = Истина,
											  ЭтоДанныеСФинансамиИТрансляцией = Ложь) Экспорт
									  
	ТаблицаДвиженийБДР = Движения.ТаблицаДвиженийБДР;
	ТаблицаДвиженийБДДС = Движения.ТаблицаДвиженийБДДС;
	ТаблицаДвиженийБДДСАктуальные = Движения.ТаблицаДвиженийБДДСАктуальные;
	ТаблицаДвиженийСрокиПЗ = Движения.ТаблицаДвиженийСрокиПЗ;
	ТаблицаДвиженияПланПоставкиМатРесурсовПЗ = Движения.ТаблицаДвиженияПланПоставкиМатРесурсовПЗ;
	
	// Устаревший документ упоРасчетКалендарногоПланаПроекта не двигает регистр упоДанныеПлановДвиженияДенежныхСредств, 
	// только упоАктуальныеПланыДвиженийДенежныхСредств.
	//
	ЕстьДвижения_упоДанныеПлановДвиженияДенежныхСредств = Не ТаблицаДвиженийБДДС = Неопределено;
	
	мВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	Если Не ЭтоПроектнаяЗадача Тогда
		ПараметрДляПолученияДанных = ?(МассивЗадач = Неопределено, ДанныеДокумента.Проект, МассивЗадач);
	КонецЕсли;
	
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ДанныеДокумента.Проект);
	
	// ПЛАН БЮДЖЕТОВ ДОХОДА И РАСХОДА.
	
	Если Не ЭтоПроектнаяЗадача Тогда
		ДанныеПланаБДР = обПолучитьДанныеПланаБДР(
			ПараметрДляПолученияДанных, ДанныеДокумента.ТекущаяВерсияПроекта, СвойстваПроекта);
	Иначе
		
		// Собираем план БДР из двух табличных частей.
		ДанныеПланаБДР = упоДоходыИРасходыСервер.СводнаяТаблицаДоходыРасходы(
			ДанныеДокумента.ПланДоходов, ДанныеДокумента.ПланРасходов);
		
		Если СвойстваПроекта.ПланироватьЗатратыНаМатериалы И ДанныеДокумента.ВключитьМатРесурсыВПланРасходов Тогда
			Для каждого СтрокаДокумента Из ДанныеДокумента.МатериальныеРесурсы Цикл
				СтрокаПлана = ДанныеПланаБДР.Добавить();
				СтрокаПлана.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
				
				СтрокаПлана.Статья = СтрокаДокумента.СтатьяЗатрат;
				СтрокаПлана.Сумма = СтрокаДокумента.ОбщСтоимость;
				СтрокаПлана.ПрофильРаспределения = СтрокаДокумента.ПрофильРаспределения;
				СтрокаПлана.Контрагент = СтрокаДокумента.Контрагент;
				СтрокаПлана.Договор = СтрокаДокумента.Договор;
				СтрокаПлана.Валюта = СтрокаДокумента.Валюта;
				СтрокаПлана.СпособПривязки = СтрокаДокумента.СпособПривязки;
				СтрокаПлана.ДатаПривязки = СтрокаДокумента.ДатаПривязки;
				СтрокаПлана.ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты;
			КонецЦикла;
		КонецЕсли;
		
		Если СвойстваПроекта.ДоходыПоНатуральнымПоказателям И ДанныеДокумента.ВключитьСубпродуктыВПланДоходов Тогда
			Для каждого СтрокаДокумента Из ДанныеДокумента.Субпродукты Цикл
				СтрокаПлана = ДанныеПланаБДР.Добавить();
				СтрокаПлана.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
				
				СтрокаПлана.Статья = СтрокаДокумента.СтатьяДоходов;
				СтрокаПлана.Сумма = СтрокаДокумента.ОбщСтоимость;
				СтрокаПлана.ПрофильРаспределения = СтрокаДокумента.ПрофильРаспределения;
				СтрокаПлана.Контрагент = СтрокаДокумента.Контрагент;
				СтрокаПлана.Договор = СтрокаДокумента.Договор;
				СтрокаПлана.Валюта = СтрокаДокумента.Валюта;
				СтрокаПлана.СпособПривязки = СтрокаДокумента.СпособПривязки;
				СтрокаПлана.ДатаПривязки = СтрокаДокумента.ДатаПривязки;
				СтрокаПлана.ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.Объемы;
			КонецЦикла;
		КонецЕсли;
		
		Если СвойстваПроекта.ПланироватьДополнительныеЗатратыПоЗадаче И ДанныеДокумента.ВключитьДопЗатратыВПланРасходов Тогда
			Для каждого СтрокаДокумента Из ДанныеДокумента.ДополнительныеЗатраты Цикл
				СтрокаПлана = ДанныеПланаБДР.Добавить();
				СтрокаПлана.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
				
				СтрокаПлана.Статья = СтрокаДокумента.СтатьяЗатрат;
				СтрокаПлана.Сумма = СтрокаДокумента.Стоимость;
				СтрокаПлана.ПрофильРаспределения = СтрокаДокумента.ПрофильРаспределенияДоходовРасходов;
				СтрокаПлана.Контрагент = СтрокаДокумента.КонтрагентДоходовРасходов;
				СтрокаПлана.Договор = СтрокаДокумента.ДоговорДоходовРасходов;
				СтрокаПлана.Валюта = мВалютаУправленческогоУчета;
				СтрокаПлана.СпособПривязки = СтрокаДокумента.СпособПривязкиДоходовРасходов;
				СтрокаПлана.ДатаПривязки = СтрокаДокумента.ДатаПривязкиДоходовРасходов;
				СтрокаПлана.ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты;
			КонецЦикла;
		КонецЕсли;
		
		ДанныеПланаБДР.ЗаполнитьЗначения(ДанныеДокумента.Ссылка, "ПроектнаяЗадача");	
		
	КонецЕсли;
	
	естьВалютнаяСумма = Не (ДанныеПланаБДР.Колонки.Найти("СуммаВалютная") = Неопределено);
	
	Для каждого СтрокаДанных Из ДанныеПланаБДР Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДанных.ИсточникПлана) Тогда
			СтрокаДанных.ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы;
		КонецЕсли;	
		
		// Находим проектную задачу в списке актуализированных.
		
		Если ТипЗнч(ТаблицаЗадач) = Тип("ТаблицаЗначений") Тогда
			Если Не ЭтоПроектнаяЗадача Тогда      
				СтрокаЗадача = ТаблицаЗадач.Найти(СтрокаДанных.ПроектнаяЗадача, "Задача");
			Иначе
				СтрокаЗадача = ТаблицаЗадач.Найти(ДанныеДокумента.Ссылка, "Задача");	
			КонецЕсли; 
			
			Если СтрокаЗадача = Неопределено Тогда      
				Продолжить;
			КонецЕсли; 
							
			ДатаНачала = СтрокаЗадача.ДатаНачала;
			ДатаЗавершения = СтрокаЗадача.ДатаЗавершения;
		Иначе
			Если Не ЭтоПроектнаяЗадача Тогда      
				СтрокаЗадача = ТаблицаЗадач[СтрокаДанных.ПроектнаяЗадача];
			Иначе
				СтрокаЗадача = ТаблицаЗадач[ДанныеДокумента.Ссылка];	
			КонецЕсли; 
			
			Если СтрокаЗадача = Неопределено Тогда      
				Продолжить;
			КонецЕсли; 
			
			ДатаНачала = СтрокаЗадача.Результат.ДатаНачала;
			ДатаЗавершения = СтрокаЗадача.Результат.ДатаЗавершения;
			
		КонецЕсли;
						
		ПараметрыРаспределения = Новый Структура("ДатаНачала, ДатаЗавершения, естьВалютнаясумма", ДатаНачала, ДатаЗавершения, естьВалютнаяСумма); 
		ДанныеЗаполнения = Новый Структура("Период, ПроектнаяЗадача", ДанныеДокумента.Дата,
			?(ЭтоПроектнаяЗадача, ДанныеДокумента.ПроектнаяЗадача, СтрокаДанных.ПроектнаяЗадача)); 
						
		РаспределитьСуммуСтрокиБДР(ТаблицаДвиженийБДР, СтрокаДанных, ПараметрыРаспределения, ДанныеЗаполнения);
						
	КонецЦикла;
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийБДР, , Ложь);
	
	// Сгруппировать Таблицу движения БДР.	
	КолонкиСуммы = Новый Соответствие;
	КолонкиСуммы.Вставить("Сумма", Истина);
	КолонкиСуммы.Вставить("СуммаВалютная", Истина);
	
	ТаблицаДвиженийБДР.ЗаполнитьЗначения(ДанныеДокумента.ТекущаяВерсияПроекта, "Версия");	
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДвиженийБДР, КолонкиСуммы);	
	
	// ПЛАН ДВИЖЕНИЯ ДЕНЕЖНЫХ СРЕДСТВ.		
	
	Если Не ЭтоПроектнаяЗадача Тогда      
		ДанныеПланаДДС = обПолучитьДанныеПланаДДС(ПараметрДляПолученияДанных);
	Иначе
		ДанныеПланаДДС = ДанныеДокумента.ДвиженияДенежныхСредств;
	КонецЕсли; 	
	
	// Трансляция БДР в ДДС.
	// Сперва сформируем данные для регистра упоДанныеПлановДвиженияДенежныхСредств (без данных трансляции).
	ОбновитьДатуПривязкиДанныхДДС(ДанныеПланаДДС, ДанныеДокумента, ЭтоПроектнаяЗадача);
	Если ЕстьДвижения_упоДанныеПлановДвиженияДенежныхСредств Тогда
		ЗаполнитьТаблицуДвиженийДДС(ТаблицаДвиженийБДДС, ДанныеПланаДДС, ДанныеДокумента, ЭтоПроектнаяЗадача,
			ЭтоДанныеСФинансамиИТрансляцией);
	КонецЕсли;
	
	// Теперь сформируем данные для упоАктуальныеПланыДвиженийДенежныхСредств.
	ДополнитьДанныеПланаДДСДаннымиПланаБДР(ДанныеПланаДДС, ТаблицаДвиженийБДР, ДанныеДокумента, ЭтоПроектнаяЗадача, мВалютаУправленческогоУчета);
	
	упоДвиженияДенежныхСредствСервер.ЗаполнитьТаблицуБДДСПоДаннымПланаДДС(ТаблицаДвиженийБДДСАктуальные, ДанныеПланаДДС,
		ТаблицаЗадач, ДанныеДокумента, ЭтоПроектнаяЗадача);
		
	ТаблицаДвиженийБДДСАктуальные.ЗаполнитьЗначения(ДанныеДокумента.ТекущаяВерсияПроекта, "Версия");	
	
	// Зануление регистров.
	// Записи трансляции трудозатрат не актуализируем.
	
	ДанныеАктуализацииРегистра = Новый Структура("Регистратор, Период, МассивЗадач, ИмяРегистра",
		ДанныеДокумента.Ссылка, 
		упоРабочиеКалендариВызовСервера.обПолучитьМоментВремениДокумента(ДокументОбъект), 
		?(ЭтоПроектнаяЗадача, ДанныеДокумента.Ссылка, МассивЗадач));
	УсловиеОтбора = "Версия = &Версия И НЕ ИсточникПлана = &ИсточникПлана";
	ПараметрОтбора = Новый Структура("Версия", ДанныеДокумента.ТекущаяВерсияПроекта);
		
	ДанныеАктуализацииРегистра.ИмяРегистра = "упоАктуальныеПланыДвиженийДенежныхСредств";
	ПараметрОтбора.Вставить("ИсточникПлана", Перечисления.упоИсточникПланаДДС.Трудозатраты);
	АктуализироватьДанныеРегистраСведений(ТаблицаДвиженийБДДСАктуальные, ДанныеАктуализацииРегистра,,,
		УсловиеОтбора, ПараметрОтбора, Ложь);
	
	ДанныеАктуализацииРегистра.ИмяРегистра = "упоАктуальныеПланыДоходовИРасходов";
	ПараметрОтбора.Вставить("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.Трудозатраты);
	АктуализироватьДанныеРегистраСведений(ТаблицаДвиженийБДР, ДанныеАктуализацииРегистра,,,
		УсловиеОтбора, ПараметрОтбора, Ложь);
		
	Если ЕстьДвижения_упоДанныеПлановДвиженияДенежныхСредств Тогда
		УсловиеОтбора = "Версия = &Версия";
		ДанныеАктуализацииРегистра.ИмяРегистра = "упоДанныеПлановДвиженияДенежныхСредств";
		упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ТаблицаДвиженийБДДС, 
			ДанныеАктуализацииРегистра,,, УсловиеОтбора, ПараметрОтбора, Ложь);
	КонецЕсли;
	
	// Обновление даты заказа.
	
	ОбновлениеДатыЗаказаИлиВыпускаЗаданнойТЗ(ДанныеДокумента, ТаблицаДвиженийСрокиПЗ, 
		"упоДанныеПлановПотребностейМатериальныхРесурсов", ТаблицаДвиженияПланПоставкиМатРесурсовПЗ);	
		
	// Обновление даты выпуска.	
	
	ОбновлятьДатуВыпускаПланаСубпродуктов = Движения.Свойство("ТаблицаДвиженияПланВыпускаСубпродуктовПЗ");
	
	Если ОбновлятьДатуВыпускаПланаСубпродуктов Тогда
		ОбновлениеДатыЗаказаИлиВыпускаЗаданнойТЗ(ДанныеДокумента, ТаблицаДвиженийСрокиПЗ, 
			"упоДанныеПлановВыпускаСубпродуктов", Движения.ТаблицаДвиженияПланВыпускаСубпродуктовПЗ);
	КонецЕсли;	
		
	// В документе СохранениеДанныхПроекта идет разностная запись данных ТЧ, занулять не надо.
	Если АктуализироватьРегистрыТабличныхЧастей Тогда		
		УсловиеОтбора = "Версия = &Версия";
		ПараметрОтбора = Новый Структура("Версия", ДанныеДокумента.ТекущаяВерсияПроекта);
				
		ДанныеАктуализацииРегистра.ИмяРегистра = "упоДанныеПлановПотребностейМатериальныхРесурсов";
		АктуализироватьДанныеРегистраСведений(ТаблицаДвиженияПланПоставкиМатРесурсовПЗ, ДанныеАктуализацииРегистра,,, 
			УсловиеОтбора, ПараметрОтбора, Ложь);
		Если ОбновлятьДатуВыпускаПланаСубпродуктов Тогда
			ДанныеАктуализацииРегистра.ИмяРегистра = "упоДанныеПлановВыпускаСубпродуктов";
			АктуализироватьДанныеРегистраСведений(Движения.ТаблицаДвиженияПланВыпускаСубпродуктовПЗ, ДанныеАктуализацииРегистра,,, 
				УсловиеОтбора, ПараметрОтбора, Ложь);	
		КонецЕсли;
			
	КонецЕсли;		
	
	КолонкиСуммы = Новый Соответствие;
	КолонкиСуммы.Вставить("Сумма", Истина);
	КолонкиСуммы.Вставить("СуммаВалютная", Истина);
	КолонкиСуммы.Вставить("Количество", Истина);	
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДвиженияПланПоставкиМатРесурсовПЗ, КолонкиСуммы);	
	
	Если ОбновлятьДатуВыпускаПланаСубпродуктов Тогда
		упоСервисныеФункцииВызовСервера.СвернутьТЗ(Движения.ТаблицаДвиженияПланВыпускаСубпродуктовПЗ, КолонкиСуммы);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Актуализирует финансовые планы проекта по подразделениям.
//
// Параметры:
//  ДокументОбъект					 - ДокументОбъект.упоПроектнаяЗадача, ДокументОбъект.упоСохранениеДанныхПроекта - 
//		документ-владелец движений.
//  ДанныеДокумента					 - Структура - структура данных документа.
//  СоответствиеСроковЗадач			 - Соответствие - сроки задач.
//  Движения						 - ТаблицаЗначений - таблица движений документа.
//  МассивЗадач						 - Массив		 - задачи актуализации.
//  Отказ							 - Булево		 - флаг отказа.
//  ПолныйПересчетИзИсходныхДанных	 - Булево		 - флаг полного пересчета.
//  МВТ	 - МенеджерВременныхТаблиц	 - содержит таблицу неотмененных ПЗ для работы с актуальными задачами из МассивЗадач.
//
Процедура АктуализацияФинансовыхПлановПроектаПоПодразделениям(ДокументОбъект, ДанныеДокумента, СоответствиеСроковЗадач,
		Движения, МассивЗадач, Отказ, ПолныйПересчетИзИсходныхДанных = Ложь, МВТ) Экспорт
	
	Если ПолныйПересчетИзИсходныхДанных Тогда
		АктуализацияФинансовыхПлановПроектаПоПодразделениям_ПолныйПересчет(ДанныеДокумента,
			СоответствиеСроковЗадач,
			Движения,
			МассивЗадач,
			Отказ);
	Иначе
		МВТ = ПроверитьИнициализироватьМенеджерВТ(МассивЗадач, ДанныеДокумента.ТекущаяВерсияПроекта, МВТ);
		АктуализацияФинансовыхПлановПроектаПоПодразделениям_ПерезаписьАктуальныхПланов(ДокументОбъект,
			ДанныеДокумента,
			СоответствиеСроковЗадач,
			Движения,
			МВТ,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры
// Распределяет сумму строки БДР
//
// Параметры:
//  ТаблицаДвиженийБДР		 - ТаблицаЗначений	 - движения БДР
//  СтрокаДанных			 - СтрокаТаблицыЗначений,	 - строка данных.
//  ПараметрыРаспределения	 - Структура	 - параметры распределения.
//  ДанныеЗаполнения		 - Структура	 - данные для заполнения по умолчанию.
//
Процедура РаспределитьСуммуСтрокиБДР(ТаблицаДвиженийБДР, СтрокаДанных, ПараметрыРаспределения, Знач ДанныеЗаполнения) Экспорт
	
	ТаблицаРаспределение = ПолучитьТаблицуРаспределенияСуммы(СтрокаДанных, 
		ПараметрыРаспределения.ДатаНачала, ПараметрыРаспределения.ДатаЗавершения, ПараметрыРаспределения.естьВалютнаяСумма);
		
	Если ТаблицаРаспределение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Для каждого СтрокаРаспределение Из ТаблицаРаспределение Цикл        
		
		Движение = ТаблицаДвиженийБДР.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение, ДанныеЗаполнения);
		ЗаполнитьЗначенияСвойств(Движение, СтрокаДанных);		
		Движение.ДатаНачисления = СтрокаРаспределение.Период;
		Движение.СуммаВалютная = СтрокаРаспределение.Сумма;	
		// Сумму обнуляем, она будет пересчитана из суммы валютной.
		Движение.Сумма = 0;	
			
	КонецЦикла; 
	
КонецПроцедуры	

// Функция получает актуальные данные по задачам проекта из БД.
// 
// Параметры:
//  Проект          - СправочникСсылка.Проекты - заданный проект, по которому собираются данные.
//  ТекущаяВерсия   - ДокументСсылка.упоВерсияПланаПроекта - ссылка на текущую версию проекта.
//  НастройкаУровняПланированияПриРасчетеГотовностиПроектов - ПеречислениеСсылка.упоУровеньПланирования - 
//		уровень планирования трудозатрат для расчета процента готовности.
//
// Возвращаемое значение:
//  ТаблицаЗадачи   - ТаблицаЗначений, содержит параматры всех задач проекта.
// 
Функция ПолучитьАктуальныеПараметрыЗадач(Проект, ТекущаяВерсия, 
										НастройкаУровняПланированияПриРасчетеГотовностиПроектов = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&ТекущаяВерсия КАК Версия,
		|	РегТекПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(ЕСТЬNULL(РегТекПлан.Количество, 0) * ЕСТЬNULL(ЕдиницыВремени.Коэффициент, 0)) КАК Трудозатраты
		|ПОМЕСТИТЬ ВТ_Трудозатраты
		|ИЗ
		|	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И УровеньПланирования = &НастройкаУровняПланированияПриРасчетеГотовностиПроектов) КАК РегТекПлан
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоЕдиницыВремени КАК ЕдиницыВремени
		|		ПО РегТекПлан.ЕдиницаНормирования = ЕдиницыВремени.Ссылка
		|ГДЕ
		|	РегТекПлан.Ресурс ССЫЛКА Справочник.упоРоли
		|	И РегТекПлан.Количество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РегТекПлан.ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ТекущаяВерсия КАК Версия,
		|	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности КАК ПроцентГотовности
		|ПОМЕСТИТЬ втПроцентыГотовности
		|ИЗ
		|	РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(РегСвойстваПЗ.ПроектнаяЗадача, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК Задача,
		|	ЕСТЬNULL(РегСвойстваПЗ.ЗадачаРодитель, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК Родитель,
		|	РегСтатусыПЗ.СтатусЗадачи КАК Статус,
		|	ЕСТЬNULL(втПроцентыГотовности.ПроцентГотовности, 0) КАК Готовность,
		|	0 КАК ОбщДЗ,
		|	0 КАК ВыпДЗ,
		|	ЕСТЬNULL(РегСвойстваПЗ.Длительность, 0) КАК Длительность,
		|	спрПроекты.Ссылка КАК Ссылка,
		|	спрПроекты.КодСДР КАК КодСДР,
		|	спрПроекты.Наименование КАК НазваниеПЗ,
		|	ЕСТЬNULL(ВТ_Трудозатраты.Трудозатраты, 0) КАК Трудозатраты
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК РегСвойстваПЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК РегСтатусыПЗ
		|		ПО РегСвойстваПЗ.Версия = РегСтатусыПЗ.Версия
		|			И РегСвойстваПЗ.ПроектнаяЗадача = РегСтатусыПЗ.ПроектнаяЗадача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК спрПроекты
		|		ПО РегСвойстваПЗ.ПроектнаяЗадача = спрПроекты.СсылкаНаПроектнуюЗадачу
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПроцентыГотовности КАК втПроцентыГотовности
		|		ПО РегСвойстваПЗ.Версия = втПроцентыГотовности.Версия
		|			И РегСвойстваПЗ.ПроектнаяЗадача = втПроцентыГотовности.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Трудозатраты КАК ВТ_Трудозатраты
		|		ПО РегСвойстваПЗ.Версия = ВТ_Трудозатраты.Версия
		|			И РегСвойстваПЗ.ПроектнаяЗадача = ВТ_Трудозатраты.ПроектнаяЗадача
		|ГДЕ
		|	НЕ РегСвойстваПЗ.ЗадачаОтменена
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодСДР";
	Запрос.УстановитьПараметр("Проект",Проект);
	Запрос.УстановитьПараметр("ТекущаяВерсия",ТекущаяВерсия);
	Если Не ЗначениеЗаполнено(НастройкаУровняПланированияПриРасчетеГотовностиПроектов) Тогда
		НастройкаУровняПланированияПриРасчетеГотовностиПроектов = Перечисления.упоУровеньПланирования.Предварительный;
	КонецЕсли;
	Запрос.УстановитьПараметр("НастройкаУровняПланированияПриРасчетеГотовностиПроектов", НастройкаУровняПланированияПриРасчетеГотовностиПроектов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Расчет готовности проектных задач.
//
// Параметры:
//  ТаблицаЗадач								 - ТаблицаЗначений	 - таблица задач.
//  НадоУчитыватьТрудозатраты					 - Булево	 - признак учета трудозатрат.
//  ИспДлитВместоПустТрудЗатДляРасчГотовности	 - Булево	 - признак использования длительности вместо трудозатрат.
//  НакопленныеИтогиПоТрудозатратам				 - Булево	 - учет накопленных итогов.
//
Процедура РассчитатьГотовностьЗадачПоВходящимДанным(ТаблицаЗадач, 
													НадоУчитыватьТрудозатраты,
													ИспДлитВместоПустТрудЗатДляРасчГотовности,
													НакопленныеИтогиПоТрудозатратам = Ложь) Экспорт
	
	СоответствиеРодителей = Новый Соответствие;
	СоответствиеЗадачиКРасчету = Новый Соответствие;
	ЗадачиКРасчету = Новый Массив;
	СтоПроцентов = 100;
	
	Для Каждого СтрокаЗадачи Из ТаблицаЗадач Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЗадачи.Родитель) Тогда
			Продолжить;
		КонецЕсли;

		СтрокаРодителя = СоответствиеРодителей.Получить(СтрокаЗадачи.Родитель);
		Если СтрокаРодителя = Неопределено Тогда
			СтрокаРодителя = ТаблицаЗадач.Найти(СтрокаЗадачи.Родитель, "Задача");
			СоответствиеРодителей.Вставить(СтрокаЗадачи.Родитель, СтрокаРодителя);
		КонецЕсли;
		Если НадоУчитыватьТрудозатраты И НакопленныеИтогиПоТрудозатратам Тогда
			СтрокаРодителя.Трудозатраты = СтрокаРодителя.Трудозатраты - СтрокаЗадачи.Трудозатраты;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ТаблицаЗадач.Колонки.Найти("ЭтоЭтап") = Неопределено Тогда
		ТаблицаЗадач.Колонки.Добавить("ЭтоЭтап", Новый ОписаниеТипов("Булево"));	
	КонецЕсли;
	
	Для Каждого СтрокаЗадачи Из ТаблицаЗадач Цикл
		
		СтрокаЗадачи.ЭтоЭтап = СоответствиеРодителей.Получить(СтрокаЗадачи.Задача) <> Неопределено;
	
		СтрокаЗадачи.ВыпДЗ = 0;
		СтрокаЗадачи.ОбщДЗ = 0;
		
		Если СтрокаЗадачи.ЭтоЭтап Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НадоУчитыватьТрудозатраты 
			И Не (СтрокаЗадачи.Трудозатраты = 0 И ИспДлитВместоПустТрудЗатДляРасчГотовности) Тогда
			УсловныйВесЗадачи = СтрокаЗадачи.Трудозатраты;
		Иначе
			УсловныйВесЗадачи = СтрокаЗадачи.Длительность;
		КонецЕсли;
		
		Если УсловныйВесЗадачи = 0 Тогда
			УсловныйВесЗадачи = 0.00000001;
		КонецЕсли;			
		
		СтрокаЗадачи.ОбщДЗ = УсловныйВесЗадачи;
		Если СтрокаЗадачи.Готовность = СтоПроцентов Тогда
			СтрокаЗадачи.ВыпДЗ = УсловныйВесЗадачи;
		ИначеЕсли СтрокаЗадачи.Готовность = 0 Тогда
			СтрокаЗадачи.ВыпДЗ = 0;
		Иначе
			СтрокаЗадачи.ВыпДЗ = УсловныйВесЗадачи * (СтрокаЗадачи.Готовность / СтоПроцентов);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаЗадачи.Родитель) 
			И СоответствиеЗадачиКРасчету[СтрокаЗадачи.Родитель] = Неопределено Тогда
			СоответствиеЗадачиКРасчету.Вставить(СтрокаЗадачи.Родитель, Истина);
			ЗадачиКРасчету.Добавить(СтрокаЗадачи.Родитель);
		КонецЕсли;
			
	КонецЦикла;
	
	
	КолвоЗадач = ТаблицаЗадач.Количество();
	Для Сч = -КолвоЗадач По -1 Цикл
		
		ТекЗадача = ТаблицаЗадач[-Сч-1];
		СтрокаРодитель = СоответствиеРодителей.Получить(ТекЗадача.Родитель);
		Если СтрокаРодитель <> Неопределено Тогда
			СтрокаРодитель.ОбщДЗ = СтрокаРодитель.ОбщДЗ + ТекЗадача.ОбщДЗ;
			СтрокаРодитель.ВыпДЗ = СтрокаРодитель.ВыпДЗ + ТекЗадача.ВыпДЗ;
		КонецЕсли;
			
	КонецЦикла;
	
	// Подсчитаем готовность.
	Для Каждого ЗадачаКРасчету Из ЗадачиКРасчету Цикл
		
		СоответствиеЗадачиКРасчету[ЗадачаКРасчету] = Ложь;
		ТекЗадача = СоответствиеРодителей.Получить(ЗадачаКРасчету);	
		ЭтоЭтап = ТекЗадача.ЭтоЭтап; 

		Если Не ЭтоЭтап Тогда
			Продолжить;
		КонецЕсли;
			
		ТекЗадача.Готовность = ДоляГотовностиЗадачи(ТекЗадача) * СтоПроцентов;
		Если ЗначениеЗаполнено(ТекЗадача.Родитель) И СоответствиеЗадачиКРасчету[ТекЗадача.Родитель] = Неопределено Тогда
			СоответствиеЗадачиКРасчету.Вставить(ТекЗадача.Родитель, Истина);
			ЗадачиКРасчету.Добавить(ТекЗадача.Родитель);
		КонецЕсли;
		
		Если Не НадоУчитыватьТрудозатраты 
			Или ТекЗадача.Трудозатраты = 0 
			Или Не ЗначениеЗаполнено(ТекЗадача.Родитель) Тогда
			Продолжить;
		КонецЕсли;				
		
		ОбщДЗ = ТекЗадача.Трудозатраты;
		ВыпДЗ = ТекЗадача.Трудозатраты * (ТекЗадача.Готовность / СтоПроцентов);
		
		ЗадачаРодитель = ТекЗадача.Родитель;
		Пока ЗначениеЗаполнено(ЗадачаРодитель) Цикл
			
			СтрокаРодитель = СоответствиеРодителей.Получить(ЗадачаРодитель);
			СтрокаРодитель.ОбщДЗ = СтрокаРодитель.ОбщДЗ + ОбщДЗ;
			СтрокаРодитель.ВыпДЗ = СтрокаРодитель.ВыпДЗ + ВыпДЗ;
			
			Если СоответствиеЗадачиКРасчету[СтрокаРодитель.Задача] = Ложь Тогда
				СоответствиеЗадачиКРасчету.Вставить(СтрокаРодитель.Задача, Истина);
				ЗадачиКРасчету.Добавить(СтрокаРодитель.Задача);
			КонецЕсли;

			ЗадачаРодитель = СтрокаРодитель.Родитель;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура обнуляет ресурсы регистра сведений при записи нового набора записей.
//
// Параметры:
//  ТаблицаДвижений				 - ТаблицаЗначений, ТаблицаДвижений	 - текущие движения по регистру.
//  ДанныеОбработки				 - Структура						 - содержит необходимые параметры. Свойства:
//  						* Регистратор 	- документ движения.
//  						* Период 		- период движения.
//  						* ИмяРегистра 	- имя регистра сведений, по которому делаются движения.
//  						* МассивЗадач 	- массив ПЗ с обновляемыми движениями.
//  ЗаписатьДвижения			 - Булево		 - содержит признак необходимости отдельной записи движений.
//  ИмяПоляЗадачи				 - Строка		 - содержит имя поля в котором хранится проектная задача.
//  ДопОтбор					 - Структура	 - поля дополнительных отборов запроса.
//  ДопПараметры				 - Структура	 - дополнительные параметры запроса.
//  НуженОтборПоТекущейВерсии	 - Булево		 - признак установки отбора по текущей версии.
//  ДопОтборСоединение			 - Строка, Неопределено - строка с условием доп.отбора для текста запроса.
//
Процедура АктуализироватьДанныеРегистраСведений(ТаблицаДвижений, ДанныеОбработки, 
	ЗаписатьДвижения = Ложь, ИмяПоляЗадачи = "ПроектнаяЗадача",
	ДопОтбор = Неопределено, ДопПараметры = Неопределено,
	НуженОтборПоТекущейВерсии = Истина,
	ДопОтборСоединение = Неопределено) Экспорт
	
	ЭтоДвижения = Не (ТипЗНЧ(ТаблицаДвижений) = Тип("ТаблицаЗначений"));
	
	МассивЗадач = Неопределено;
	Если ДанныеОбработки.Свойство("МассивЗадач") Тогда
		Если ТипЗНЧ(ДанныеОбработки.МассивЗадач) = Тип("Массив") Тогда
			МассивЗадач = ДанныеОбработки.МассивЗадач;
		ИначеЕсли ДанныеОбработки.МассивЗадач <> Неопределено Тогда
			МассивЗадач = Новый Массив;
			МассивЗадач.Добавить(ДанныеОбработки.МассивЗадач);
		КонецЕсли;
	КонецЕсли;
	
	ИмяРегистра = ?(ЭтоДвижения, 
					ТаблицаДвижений.Метаданные().Имя, 
					ДанныеОбработки.ИмяРегистра);
	// Обрабатываем только регистры сведений.

	Регистр = Метаданные.РегистрыСведений[ИмяРегистра]; 
	Если Регистр = Неопределено Тогда
		Возврат; // Обрабатываем только регистры сведений.
	КонецЕсли;
	
	ИзмеренияРегистра = Регистр.Измерения;
	РесурсыРегистра = Регистр.Ресурсы;
	
	ЕстьРесурсОбнуление = РесурсыРегистра.Найти("Обнуление") <> Неопределено;
	
	Запрос = Новый Запрос();
	
	// Зануление обязательно должно занулять все записи, включая ранее зануленные,  
	// иначе при распроведении документа, сделавшего предыдущее зануление, 
	// в срезе появятся лишние незануленные значения.
	// Поэтому в запросе не должно быть условий на отбор ресурсов.
	ТекстЗапроса = "ВЫБРАТЬ
	|	&ПоляРегистра
	|ИЗ
	|	РегистрСведений.&ИмяРегистра.СрезПоследних(&Дата, &ПараметрыСреза) КАК Регистр
	|	&УсловиеСоединения";
	
	Шаблон = "Регистр.%1";
	МассивПолей = Новый Массив;
	ЕстьПолеВерсия = Ложь;
	Отбор = Новый Структура();
	Для Каждого ИзмерениеРегистра Из ИзмеренияРегистра Цикл
		МассивПолей.Добавить(СтрШаблон(Шаблон, ИзмерениеРегистра.Имя));
		Отбор.Вставить(ИзмерениеРегистра.Имя);
		Если НРег(ИзмерениеРегистра.Имя) = "Версия" Тогда
			ЕстьПолеВерсия = Истина;
		КонецЕсли;
	КонецЦикла; 
	
	ТекстПоляРегистра = СтрСоединить(МассивПолей, ", ");
	
	Если ЕстьРесурсОбнуление Тогда
		ТекстПоляРегистра = ТекстПоляРегистра + "," + Символы.ПС + "Истина КАК Обнуление"
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистра", ИмяРегистра);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляРегистра", ТекстПоляРегистра);
	
	Если ЕстьПолеВерсия И НуженОтборПоТекущейВерсии Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО (Регистр.Версия = упоВерсииПроекта.Версия
		|				И упоВерсииПроекта.Текущая)";
	КонецЕсли;
	
	ТекстЗаменыПараметров = "";
	СтруктураПараметровЗапроса = Новый Структура("Дата",	ДанныеОбработки.Период);
	Если МассивЗадач <> Неопределено Тогда
		ТекстЗаменыПараметров = "" + ИмяПоляЗадачи + " В (&МассивЗадач)";
		СтруктураПараметровЗапроса.Вставить("МассивЗадач", МассивЗадач);
	ИначеЕсли ДанныеОбработки.Свойство("Проект") И ДанныеОбработки.Проект <> Неопределено Тогда
		ТекстЗаменыПараметров = "" + ИмяПоляЗадачи + ".Проект = &Проект";
		СтруктураПараметровЗапроса.Вставить("Проект", ДанныеОбработки.Проект);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДопОтбор) Тогда
		ТекстЗаменыПараметров = ТекстЗаменыПараметров + ?(ЗначениеЗаполнено(ТекстЗаменыПараметров), " И ", "") + ДопОтбор;
	КонецЕсли;
	Если ДопПараметры <> Неопределено Тогда
		Для Каждого КлючЗначение Из ДопПараметры Цикл
			СтруктураПараметровЗапроса.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
			Если ТипЗнч(КлючЗначение.Значение) = Тип("ТаблицаЗначений") Тогда
				СтрокаКолонок = "";
				Для Каждого Колонка Из КлючЗначение.Значение.Колонки Цикл
					СтрокаКолонок = СтрокаКолонок + ?(ЗначениеЗаполнено(СтрокаКолонок), ", ","") + Колонка.Имя;
				КонецЦикла;
				ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ "+СтрокаКолонок+" ПОМЕСТИТЬ "+КлючЗначение.Ключ
								+" ИЗ &"+КлючЗначение.Ключ+" КАК "+КлючЗначение.Ключ+" ; "
								+Символы.ПС+ТекстЗапроса;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ДопОтборСоединение <> Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСоединения", ДопОтборСоединение);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСоединения", "");
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПараметрыСреза", ТекстЗаменыПараметров);
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, СтруктураПараметровЗапроса);
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивОтбора = Новый Массив;
	Для Каждого КлючЗначение Из Отбор Цикл
		МассивОтбора.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	ПоляОтбора = СтрСоединить(МассивОтбора, ",");
	
	// Обработка движений.
	Если ЭтоДвижения Тогда
		мТаблицаДвижений = ТаблицаДвижений.Выгрузить();
	Иначе
		мТаблицаДвижений = ТаблицаДвижений;
	КонецЕсли;
	мТаблицаДвижений.Индексы.Добавить(ПоляОтбора);
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		СтрокиТаблицыДвижений = мТаблицаДвижений.НайтиСтроки(Отбор);
		Если СтрокиТаблицыДвижений.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Регистратор = ДанныеОбработки.Регистратор;
		Движение.Период = ДанныеОбработки.Период;
		Движение.Активность = Истина;
		
	КонецЦикла;
	
	Если ЗаписатьДвижения И ЭтоДвижения Тогда
		ТаблицаДвижений.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Рассчитывает планы ДДС, БДР и объемов по новым срокам
//
// Параметры:
//  Объект - ДокументОбъект.упоПроектнаяЗадача, ДокументОбъектупоСохранениеДанныхПроекта - документ-владелец движений.
//  ДанныеДвижений - ТаблицаЗначений - таблица движений.
//  ДанныеДокумента- Структура - данные документа.
//  СоответствиеСроковЗадач- Соответствие - сроки задач.
//  МассивЗадач - Массив - массив ссылок на документ "Проектная задача"
//  ТекущаяВерсияПроекта - ДокументСсылка.ВерсияПланаПроекта
//  Отказ - Булево.
//  ДопПараметрыРасчета - Неопределено, Структура:
//		* упоДанныеПлановПотребностейМатериальныхРесурсов_ДвиженияПодготовлены - Булево - признак отсутствия подготовленных движений по регистру упоДанныеПлановПотребностейМатериальныхРесурсов.
//		* ПолныйПересчетИзИсходныхДанных - Булево - 
//			Истина: данные регистров упоАктуальныеПланыДоходовИРасходовПодразделения, упоАктуальныеПланыВыполненияОбъемов формируются из данных плановых регистров,  
//			Ложь: данные регистров упоАктуальныеПланыДоходовИРасходовПодразделения, упоАктуальныеПланыВыполненияОбъемов обновляются по соответствию сроков СоответствиеСроковЗадач. 
//
Процедура РассчитатьФинансовыеПланы(Объект,
									ДанныеДвижений,
									ДанныеДокумента,
									СоответствиеСроковЗадач,
									МассивЗадач,
									ТекущаяВерсияПроекта,
									Отказ,
									ДопПараметрыРасчета = Неопределено) Экспорт
	
	ЕстьДвиженияПоПланамВыпускаСубпродуктов = ДанныеДвижений.Свойство("упоДанныеПлановВыпускаСубпродуктов");
	
	Если ДопПараметрыРасчета = Неопределено Тогда
		ДопПараметрыРасчета = Новый Структура("ПолныйПересчетИзИсходныхДанных,
				|упоДанныеПлановПотребностейМатериальныхРесурсов_ДвиженияПодготовлены", Ложь, Ложь);
		Если ЕстьДвиженияПоПланамВыпускаСубпродуктов Тогда
			ДопПараметрыРасчета.Вставить("упоДанныеПлановВыпускаСубпродуктов_ДвиженияПодготовлены", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДокумента.Вставить("ТекущаяВерсияПроекта", текущаяВерсияПроекта);
	
	МВТ = Неопределено;
	
	// Актуализация основных таблиц.
	
	// При полном пересчете актуализированные данные уже содержатся в движениях.
	Если Не ДопПараметрыРасчета.упоДанныеПлановПотребностейМатериальныхРесурсов_ДвиженияПодготовлены Тогда
		МВТ = ПроверитьИнициализироватьМенеджерВТ(МассивЗадач, текущаяВерсияПроекта, МВТ);
		ЗаполнитьТаблицуДвиженияПланПоставкиМатРесурсовПЗДаннымиРегистра(ДанныеДокумента, ДанныеДвижений, МВТ);
	КонецЕсли;

	Если ЕстьДвиженияПоПланамВыпускаСубпродуктов 
		И Не ДопПараметрыРасчета.упоДанныеПлановВыпускаСубпродуктов_ДвиженияПодготовлены Тогда
		МВТ = ПроверитьИнициализироватьМенеджерВТ(МассивЗадач, текущаяВерсияПроекта, МВТ);
		ЗаполнитьТаблицуДвиженияПланВыпускаСубпродуктовПЗДаннымиРегистра(ДанныеДокумента, ДанныеДвижений, МВТ);
	КонецЕсли;
	
	// Устаревший документ упоРасчетКалендарногоПланаПроекта не двигает регистр упоДанныеПлановДвиженияДенежныхСредств, 
	// только упоАктуальныеПланыДвиженийДенежныхСредств. Документ используется при удалении ПЗ кнопкой Удалить.
	//
	ЕстьДвижения_упоДанныеПлановДвиженияДенежныхСредств = 
		ДанныеДвижений.Свойство("упоДанныеПлановДвиженияДенежныхСредств");
	
	ДанныеДвиженийФинансов = Новый Структура();
	ДанныеДвиженийФинансов.Вставить("ТаблицаДвиженийСрокиПЗ",  	ДанныеДвижений["упоСрокиПроектныхЗадач"]);
	ДанныеДвиженийФинансов.Вставить("ТаблицаДвиженийБДР", 		ДанныеДвижений["упоАктуальныеПланыДоходовИРасходов"]);
	ДанныеДвиженийФинансов.Вставить("ТаблицаДвиженийБДДСАктуальные", 
		ДанныеДвижений["упоАктуальныеПланыДвиженийДенежныхСредств"]);
	Если ЕстьДвижения_упоДанныеПлановДвиженияДенежныхСредств Тогда
		ДанныеДвиженийФинансов.Вставить("ТаблицаДвиженийБДДС",	ДанныеДвижений["упоДанныеПлановДвиженияДенежныхСредств"]);
	Иначе
		ДанныеДвиженийФинансов.Вставить("ТаблицаДвиженийБДДС",	Неопределено);
	КонецЕсли;
	ДанныеДвиженийФинансов.Вставить("ТаблицаДвиженияПланПоставкиМатРесурсовПЗ", 
		ДанныеДвижений["упоДанныеПлановПотребностейМатериальныхРесурсов"]);
	
	Если ЕстьДвиженияПоПланамВыпускаСубпродуктов Тогда
		ДанныеДвиженийФинансов.Вставить("ТаблицаДвиженияПланВыпускаСубпродуктовПЗ", 
			ДанныеДвижений["упоДанныеПлановВыпускаСубпродуктов"]);
	КонецЕсли;
	
	АктуализироватьРегистрыТабличныхЧастей = Не ДопПараметрыРасчета.ПолныйПересчетИзИсходныхДанных;
	ЭтоДанныеСФинансамиИТрансляцией = ДопПараметрыРасчета.Свойство("ЭтоДанныеСФинансамиИТрансляцией") 
		И ДопПараметрыРасчета.ЭтоДанныеСФинансамиИТрансляцией;
	
	обАктуализацияФинансовыхПлановПроекта(Объект,
		ДанныеДокумента,
		СоответствиеСроковЗадач,
		ДанныеДвиженийФинансов,
		Ложь,
		МассивЗадач,
		АктуализироватьРегистрыТабличныхЧастей,
		ЭтоДанныеСФинансамиИТрансляцией);
	
	колонкиСуммы = Новый Соответствие;
	колонкиСуммы.Вставить("Сумма", Истина);
	колонкиСуммы.Вставить("СуммаВалютная", Истина);
	Если ЕстьДвижения_упоДанныеПлановДвиженияДенежныхСредств Тогда
		упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДвиженийФинансов.ТаблицаДвиженийБДДС, колонкиСуммы);
	КонецЕсли;
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДвиженийФинансов.ТаблицаДвиженийБДДСАктуальные, колонкиСуммы);
	
	// Актуализация по подразделениям.
	
	АктуализацияФинансовыхПлановПроектаПоПодразделениям(Объект, 
		ДанныеДокумента, 
		СоответствиеСроковЗадач, 
		ДанныеДвижений, 
		МассивЗадач, 
		Отказ, 
		ДопПараметрыРасчета.ПолныйПересчетИзИсходныхДанных,
		МВТ);
	
	МВТ = Неопределено;
	
КонецПроцедуры

// Отключает опцию трансляции (по имени метаданных) табличной части проектных задач проекта.
//
// Параметры:
//  Проект                         - СправочникСсылка.Проекты
//  ОтключаемыеОпцииТрансляции     - Массив из Строка - имена отключаемых опций трансляции
//  Отказ                          - Булево
//
Процедура ОтключитьОпцииТрансляцииТабличныхЧастейЗадачПроекта(Проект, ОтключаемыеОпцииТрансляции, Отказ) Экспорт
	
	Если Не ОтключаемыеОпцииТрансляции.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	Если Не ЗначениеЗаполнено(ТекущаяВерсияПроекта) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстКомментарияДокумента =
		НСтр("ru = 'Документ создан автоматически при отключении проектных опций. Очистка данных трансляции, связанных с проектными опциями.'", "ru");
	ДокументСохранения = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ДокументСохранения.Проект = Проект;
	ДокументСохранения.Комментарий = ТекстКомментарияДокумента;
	
	Для Каждого ИмяОпцииТрансляции Из ОтключаемыеОпцииТрансляции Цикл
		НаименованиеОпцииТрансляции = НаименованиеОпцииТрансляцииПоИмениМетаданных(ИмяОпцииТрансляции);
		Если Не ЗначениеЗаполнено(НаименованиеОпцииТрансляции) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		АктуализируемыеПроектныеЗадачи = АктуализируемыеПроектныеЗадачиПоОпцииТрансляции(ИмяОпцииТрансляции, ТекущаяВерсияПроекта);
		Если Не АктуализируемыеПроектныеЗадачи.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		МассивЗадачТрансляции = Новый Массив;
		
		Для Каждого КлючИЗначение Из АктуализируемыеПроектныеЗадачи Цикл
			СвойстваПроектнойЗадачи = КлючИЗначение.Значение;
			
			СтрокаСвойствПЗВДокументеСДП = ДокументСохранения.ПроектныеЗадачи.Найти(СвойстваПроектнойЗадачи.ПроектнаяЗадача, "ПроектнаяЗадача");
			Если СтрокаСвойствПЗВДокументеСДП = Неопределено Тогда
				СтрокаСвойствПЗВДокументеСДП = ДокументСохранения.ПроектныеЗадачи.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСвойствПЗВДокументеСДП, СвойстваПроектнойЗадачи);
			КонецЕсли;
			
			СтрокаСвойствПЗВДокументеСДП[ИмяОпцииТрансляции] = Ложь;
			
			Если ИмяОпцииТрансляции = "ВключитьДопЗатратыВПланРасходов" Тогда
				МассивЗадачТрансляции.Добавить(СтрокаСвойствПЗВДокументеСДП.ПроектнаяЗадача);
			КонецЕсли;
		КонецЦикла;
		
		Если ИмяОпцииТрансляции = "ВключитьДопЗатратыВПланРасходов" Тогда
			ДокументСохранения.ДополнительныеСвойства.Вставить("МассивЗадачТрансляции", МассивЗадачТрансляции);
			Продолжить;
		КонецЕсли;
		
		ДокументСохранения["Перезаписать" + ИмяОпцииТрансляции] = Истина;
	КонецЦикла;
	
	Если Не ДокументСохранения.ПроектныеЗадачи.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ДокументСохранения.Дата = ТекущаяДатаСеанса();
		ДокументСохранения.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		
		СообщениеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отключение опции трансляции по проекту.'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Не удалось отключить трансляцию данных. Ошибка записи документа сохранения данных проекта.'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка отключения проектных опций. Не удалось очистить связанные данные трансляции. Подробнее см. Журнал регистрации.'"));
		
		ВызватьИсключение(СообщениеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Округляет расчетную готовность задачи.
//
// Параметры:
//  РасчетнаяГотовность - Число - Готовность задачи. 
// 
// Возвращаемое значение:
//  Число. 
//
Функция ОкруглениеРасчетнойГотовности(РасчетнаяГотовность) Экспорт

	Возврат	Окр(РасчетнаяГотовность * 100) / 100;	

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает свойства проектных задач для заполнения и изменения в документе сохранение данных проекта.
//
// Параметры:
//  ВерсияПроекта     - ДокументСсылка.упоВерсияПланаПроекта
//  СписокЗадач       - Массив из ДокументСсылка.упоПроектнаяЗадача
// 
// Возвращаемое значение:
//  СвойстваПроектныхЗадачСоответствие - Соответствие
//
Функция СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПроекта, СписокЗадач = Неопределено) Экспорт
	
	СвойстваПроектныхЗадачСоответствие = Новый Соответствие;
	
	ЗапросДанныхПроекта = Новый Запрос;
	ЗапросДанныхПроекта.УстановитьПараметр("текВерсия", ВерсияПроекта);
	Если ЗначениеЗаполнено(СписокЗадач) И СписокЗадач.Количество() Тогда
		ЗапросДанныхПроекта.УстановитьПараметр("ВсеЗадачи", Ложь);
		ЗапросДанныхПроекта.УстановитьПараметр("СписокЗадач", СписокЗадач);
	Иначе
		ЗапросДанныхПроекта.УстановитьПараметр("ВсеЗадачи", Истина);
		ЗапросДанныхПроекта.УстановитьПараметр("СписокЗадач", Новый Массив);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаСвойстваЗадачДляИзмененияВДокументеСохранениеДанныхПроекта();
	
	ЗапросДанныхПроекта.Текст = ТекстЗапроса;
	ДанныеПроекта = ЗапросДанныхПроекта.Выполнить().Выгрузить();
	
	Для каждого СтрокаДанных Из ДанныеПроекта Цикл
		СвойстваПроектныхЗадачСоответствие.Вставить(СтрокаДанных.ПроектнаяЗадача, СтрокаДанных);
	КонецЦикла;
	
	Возврат СвойстваПроектныхЗадачСоответствие;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоляГотовностиЗадачи(ТекЗадача)
	
	Если ТекЗадача.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта Тогда
		ГотовностьЗадачи = 1;
	ИначеЕсли Не ТекЗадача.ОбщДЗ = 0 Тогда
		ГотовностьЗадачи = ТекЗадача.ВыпДЗ / ТекЗадача.ОбщДЗ;
	Иначе
		ГотовностьЗадачи = 0;
	КонецЕсли;
	
	Возврат ГотовностьЗадачи;
	
КонецФункции

Функция ПолучитьТаблицуРаспределенияСуммы(строкаДанных, ДатаНачала, ДатаЗавершения, естьВалютнаяСумма = Ложь)

	Если СтрокаДанных.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.НаДату Тогда

		Результат = Новый ТаблицаЗначений();
		Результат.Колонки.Добавить("Период");
		Результат.Колонки.Добавить("Сумма");
		
		новаяСтрока = Результат.Добавить();
		новаяСтрока.Период = строкаДанных.ДатаПривязки;
		новаяСтрока.Сумма = ?(естьВалютнаяСумма, СтрокаДанных.СуммаВалютная, СтрокаДанных.Сумма);
		
		Возврат Результат;

	ИначеЕсли СтрокаДанных.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно Тогда
		
		Сумма = ?(естьВалютнаяСумма, СтрокаДанных.СуммаВалютная, СтрокаДанных.Сумма);
		Результат = упоРаспределениеТрудозатратВызовСервера.ПолучитьТаблицуРаспределенияПоПериодамСводно(
			СтрокаДанных.ПериодАгрегации, 
			ДатаЗавершения, 
			Сумма); 

		Возврат Результат;
		
	ИначеЕсли СтрокаДанных.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения Тогда
		
		Возврат обРаспределитьДоходыИРасходыПоПрофилю(
			СтрокаДанных.ПрофильРаспределения, 
			ДатаНачала, 
			ДатаЗавершения, 
			?(естьВалютнаяСумма, СтрокаДанных.СуммаВалютная, СтрокаДанных.Сумма));
			
	КонецЕсли;
				
КонецФункции

// Процедура обновляет дату заказа материальных ресурсов (или дату выпуска в субпродуктах)  
// при изменении сроков проектных задач в документе Сохранение данных проекта. 
//
// Параметры:			 - 	  
// 
Процедура ОбновлениеДатыЗаказаИлиВыпускаЗаданнойТЗ(ДанныеДокумента, ТаблицаДвиженийСрокиПЗ, ИмяТаблицы,  
	ТаблицаДвиженияПлан)	
		
	Если ТаблицаДвиженийСрокиПЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;			
	
	Если ИмяТаблицы = "упоДанныеПлановВыпускаСубпродуктов" Тогда
		ИмяРеквизитаТЧ = "ДатаВыпуска";	
	Иначе
		ИмяРеквизитаТЧ = "ДатаЗаказа";	
	КонецЕсли;	
	
	ЕстьСтрокиЗануления = Ложь;
	Для Каждого СтрокаТаблицы Из ТаблицаДвиженияПлан Цикл																							
		// Зануленные строки не актуализируем.
		Если СтрокаТаблицы.Количество = 0 И СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаВалютная = 0 Тогда
			ЕстьСтрокиЗануления = Истина;
			Продолжить;
		КонецЕсли;
		
		СтрокаЗадача = ТаблицаДвиженийСрокиПЗ.Найти(СтрокаТаблицы.ПроектнаяЗадача, "ПроектнаяЗадача");
		Если СтрокаЗадача <> Неопределено  Тогда								
			ДатаОтсчета = ?(СтрокаТаблицы.СпособПривязки = Перечисления.упоСпособПривязкиПоставокИСубпродуктов.НачалоЗадачи, 
				СтрокаЗадача.ДатаНачалаПлан, СтрокаЗадача.ДатаЗавершенияПлан);
			СтрокаТаблицы[ИмяРеквизитаТЧ] = обРассчитатьЗадержкуПоКалендарю(ДатаОтсчета, СтрокаТаблицы.ЗадержкаЗаказа, ДанныеДокумента.Проект);													
		КонецЕсли;			
	КонецЦикла;		
	
	// После актуализации могут получиться строки, совпадающие по дате выпуска/заказа с пропущенными зануленными строками.
	// Основное назначение сворачивания - убрать зануленные строки-дубликаты.
	Если ЕстьСтрокиЗануления Тогда
		упоФункцииОбщегоНазначенияСервер.СвернутьТаблицуДвижений(ТаблицаДвиженияПлан, ИмяТаблицы);
	КонецЕсли;	
	
	ТаблицаДвиженияПлан.ЗаполнитьЗначения(ДанныеДокумента.Ссылка, "Регистратор");
	ТаблицаДвиженияПлан.ЗаполнитьЗначения(ДанныеДокумента.Дата, "Период");
	
КонецПроцедуры	

Процедура ДополнитьДанныеПланаДДСДаннымиПланаБДР(ДанныеПланаДДС, 
	ТаблицаДвиженийБДР, ДанныеДокумента, ЭтоПроектнаяЗадача, мВалютаУправленческогоУчета)
	
	Если Не ЗначениеЗаполнено(ТаблицаДвиженийБДР) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрокБДР = Неопределено;
	СоответствиеСхемОплаты = Неопределено;
	Если ЭтоПроектнаяЗадача Тогда
		ПроектнаяЗадача = ДанныеДокумента.ПроектнаяЗадача;
		СхемаОплатыПЗ_Доходы = ДанныеДокумента.СхемаОплатыПоУмолчаниюДоходы; 
		СхемаОплатыПЗ_Расходы = ДанныеДокумента.СхемаОплатыПоУмолчаниюРасходы;
	Иначе		
		СоответствиеСхемОплаты = СхемыОплатыТаблицыДвиженийБДР(ТаблицаДвиженийБДР, ДанныеДокумента);
	КонецЕсли;
	
	ПараметрыРасчетаДДС = упоДвиженияДенежныхСредствКлиентСервер.ПараметрыРасчетаДДСПоБДР(ПроектнаяЗадача, 
		ДанныеДокумента.Проект, мВалютаУправленческогоУчета, СхемаОплатыПЗ_Доходы, СхемаОплатыПЗ_Расходы, СоответствиеСхемОплаты);
		
	Если ЭтоПроектнаяЗадача Тогда
		
		ЕстьТрансляцияБДРвБДДС = ДанныеДокумента.ВключитьПланДоходовВБДДС Или ДанныеДокумента.ВключитьПланРасходовВБДДС;
		Если Не ЕстьТрансляцияБДРвБДДС Тогда
			Возврат;
		КонецЕсли;
		
		НуженОтборСтрокБДР = Не (ДанныеДокумента.ВключитьПланДоходовВБДДС И ДанныеДокумента.ВключитьПланРасходовВБДДС);
		Если НуженОтборСтрокБДР Тогда
			ОтборСтрокБДР = Новый Структура("ВидЭлемента");
			Если ДанныеДокумента.ВключитьПланДоходовВБДДС Тогда 
				ОтборСтрокБДР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
			Иначе
				ОтборСтрокБДР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
			КонецЕсли;
		КонецЕсли;
		
		ДаныеБДРКОтражению = ТаблицаДвиженийБДР;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивЗадач", ТаблицаДвиженийБДР.ВыгрузитьКолонку("ПроектнаяЗадача"));
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланРасходовВБДДС КАК Расход,
		               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланДоходовВБДДС КАК Доход
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		               |			И (упоВерсииПроекта.Текущая)
		               |			И (упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланДоходовВБДДС
		               |				ИЛИ упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланРасходовВБДДС)";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ЗадачиКОтражению = Новый Соответствие;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗадачиКОтражению.Вставить(Выборка.ПроектнаяЗадача, 
				Новый Структура("Доход, Расход", Выборка.Доход, Выборка.Расход));
		КонецЦикла;
		
		ДаныеБДРКОтражению = ТаблицаДвиженийБДР.СкопироватьКолонки();
		Для Каждого СтрокаБДР Из ТаблицаДвиженийБДР Цикл
			
			ЗадачаКОтражению = ЗадачиКОтражению.Получить(СтрокаБДР.ПроектнаяЗадача);
			Если ЗадачаКОтражению = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если (СтрокаБДР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход И ЗадачаКОтражению.Расход)
				ИЛИ (СтрокаБДР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход И ЗадачаКОтражению.Доход) Тогда
				ЗаполнитьЗначенияСвойств(ДаныеБДРКОтражению.Добавить(), СтрокаБДР);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	упоДвиженияДенежныхСредствСервер.ДополнитьДанныеПланаДДСДаннымиПланаБДР(ДанныеПланаДДС, 
		ДаныеБДРКОтражению, ПараметрыРасчетаДДС, ОтборСтрокБДР);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуДвиженияПланВыпускаСубпродуктовПЗДаннымиРегистра(ДанныеДокумента, ДанныеДвижений, МВТ)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	&Ссылка КАК Регистратор,
	               |	ИСТИНА КАК Активность,
	               |	&Период КАК Период,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент КАК Контрагент,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор КАК Договор,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязки КАК СпособПривязки,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаВыпуска КАК ДатаВыпуска,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта КАК Валюта,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Цена КАК Цена,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Скорость КАК Скорость,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Основной КАК Основной,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Версия КАК Версия,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов КАК СтатьяДоходов,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов КАК СпособПривязкиДоходов,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Комментарий КАК Комментарий,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество КАК Количество,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма КАК Сумма,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Коэффициент КАК Коэффициент,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная КАК СуммаВалютная
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						ВТ_ПроектныеЗадачи КАК ВТ_ПроектныеЗадачи)
	               |				И Версия = &ТекВерсия) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
	               |ГДЕ
	               |	(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма <> 0
	               |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество <> 0)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ТекВерсия", 	ДанныеДокумента.ТекущаяВерсияПроекта);
	Запрос.УстановитьПараметр("Ссылка", 	ДанныеДокумента.Ссылка);
	Запрос.УстановитьПараметр("Период", 	ДанныеДокумента.Дата);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ДанныеДвижений["упоДанныеПлановВыпускаСубпродуктов"] = Результат.Выгрузить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуДвиженияПланПоставкиМатРесурсовПЗДаннымиРегистра(ДанныеДокумента, ДанныеДвижений, МВТ)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	&Ссылка КАК Регистратор,
	               |	ИСТИНА КАК Активность,
	               |	&Период КАК Период,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Номенклатура КАК Номенклатура,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Контрагент КАК Контрагент,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Договор КАК Договор,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязки КАК СпособПривязки,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Цена КАК Цена,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Валюта КАК Валюта,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Версия КАК Версия,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ВидОперации КАК ВидОперации,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязкиРасхода КАК СпособПривязкиРасхода,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ДатаЗаказа КАК ДатаЗаказа,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество КАК Количество,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма КАК Сумма,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная КАК СуммаВалютная
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						ВТ_ПроектныеЗадачи КАК ВТ_ПроектныеЗадачи)
	               |				И Версия = &ТекВерсия) КАК упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних
	               |ГДЕ
	               |	(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма <> 0
	               |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество <> 0)";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("ТекВерсия", 	ДанныеДокумента.ТекущаяВерсияПроекта);
	Запрос.УстановитьПараметр("Ссылка", 	ДанныеДокумента.Ссылка);
	Запрос.УстановитьПараметр("Период", 	ДанныеДокумента.Дата);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ДанныеДвижений["упоДанныеПлановПотребностейМатериальныхРесурсов"] = Результат.Выгрузить();
	КонецЕсли;
	
КонецПроцедуры

Функция АктуализацияФинансовыхПлановПроектаПоПодразделениям_ПерезаписьАктуальныхПланов(ДокументОбъект, ДанныеДокумента, СоответствиеСроковЗадач, 
	Движения, МВТ, Отказ) 
	
	СвойстваПроведения = Новый Структура;
	СвойстваПроведения.Вставить("текВерсия", 	ДанныеДокумента.ТекущаяВерсияПроекта);
	СвойстваПроведения.Вставить("МВТ", 			МВТ);
	
	упоАналитикаПоПодразделениямСервер.АктуализацияДанныхДоходовРасходов(ДокументОбъект, ДанныеДокумента, 
		СоответствиеСроковЗадач, СоответствиеСроковЗадач, 
		Движения.упоАктуальныеПланыДоходовИРасходовПодразделения, СвойстваПроведения, Отказ);
	
	упоАналитикаПоПодразделениямСервер.АктуализацияПлановыхОбъемов(ДокументОбъект, ДанныеДокумента,
		СоответствиеСроковЗадач, СоответствиеСроковЗадач, 
		Движения.упоАктуальныеПланыВыполненияОбъемов, СвойстваПроведения, Отказ);
	
КонецФункции

Функция АктуализацияФинансовыхПлановПроектаПоПодразделениям_ПолныйПересчет(ДанныеДокумента, СоответствиеСроковЗадач, 
	Движения, МассивЗадач, Отказ) 
	
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ДанныеДокумента.Проект);
	
	СтрокаПараметрыКонтрагентовПроекта = "КонтрагентДоходов, КонтрагентЗатрат, ДоговорДоходов, ДоговорЗатрат";
	ПараметрыПроекта = упоФункцииБСП.ЗначенияРеквизитовОбъектаВызовСервера(ДанныеДокумента.Проект, 
		СтрокаПараметрыКонтрагентовПроекта);
	
	СвойстваПроведения = Новый Структура(СтрокаПараметрыКонтрагентовПроекта);
	ЗаполнитьЗначенияСвойств(СвойстваПроведения, ПараметрыПроекта);
	
	СвойстваПроведения.Вставить("Проект", 			ДанныеДокумента.Проект);
	СвойстваПроведения.Вставить("Версия", 			ДанныеДокумента.ТекущаяВерсияПроекта);
	СвойстваПроведения.Вставить("ПроектнаяЗадача", 	МассивЗадач);
	СвойстваПроведения.Вставить("СрокиЗадач", 		СоответствиеСроковЗадач);
	
	упоАналитикаПоПодразделениямСервер.ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(ДанныеДокумента.Ссылка, 
		СвойстваПроведения);
	
	ДанныеДляАктуализацииПоПодразделениям = Новый Структура;
	ДанныеДляАктуализацииПоПодразделениям.Вставить("упоАктуальныеПланыДоходовИРасходовПодразделения", 
		Движения.упоАктуальныеПланыДоходовИРасходовПодразделения); 
	ДанныеДляАктуализацииПоПодразделениям.Вставить("упоАктуальныеПланыВыполненияОбъемов", 
		Движения.упоАктуальныеПланыВыполненияОбъемов); 
	
	упоАналитикаПоПодразделениямСервер.ПодготовитьТаблицыДвижений(ДанныеДокумента.Ссылка,
		ДанныеДляАктуализацииПоПодразделениям,
		СвойстваПроекта,
		СвойстваПроведения,
		Отказ);
	
КонецФункции

Функция ПроверитьИнициализироватьМенеджерВТ(МассивЗадач, ТекВерсия, МВТ = Неопределено)
	
	Если МВТ <> Неопределено Тогда
		Возврат МВТ;
	КонецЕсли;
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	ТекстОтбораПоЗадачам = ?(МассивЗадач = Неопределено, "", " И ПроектнаяЗадача В (&ПроектныеЗадачи)");
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Т.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_ПроектныеЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия" + ТекстОтбораПоЗадачам + ") КАК Т
	               |ГДЕ
	               |	НЕ Т.ЗадачаОтменена
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.УстановитьПараметр("Версия", ТекВерсия);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", МассивЗадач);
	
	Запрос.Выполнить();
	
	Возврат МВТ;
	
КонецФункции

Процедура ОбновитьДатуПривязкиДанныхДДС(ДанныеПланаДДС, ДанныеДокумента, ЭтоПроектнаяЗадача)
	
	Если Не ЗначениеЗаполнено(ДанныеПланаДДС) Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЭтоПроектнаяЗадача Тогда
		ПроектныеЗадачи = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеДокумента.ПроектнаяЗадача);
	Иначе
		ПроектныеЗадачи = Новый Массив;
		Для Каждого СтрокаДДС Из ДанныеПланаДДС Цикл
			ПроектныеЗадачи.Добавить(СтрокаДДС.ПроектнаяЗадача);
		КонецЦикла;
	КонецЕсли;
	Проект = ДанныеДокумента.Проект;
	
	СрокиЗадачСоответствие = упоДвиженияДенежныхСредствСервер.СрокиПроектныхЗадачДляРасчетаДДС(Проект, ПроектныеЗадачи);
	
	Для каждого СтрокаДДС Из ДанныеПланаДДС Цикл
		
		Если ЭтоПроектнаяЗадача Тогда
			ПроектнаяЗадача = ДанныеДокумента.ПроектнаяЗадача;
		Иначе
			ПроектнаяЗадача = СтрокаДДС.ПроектнаяЗадача;
		КонецЕсли;
		
		Сроки = СрокиЗадачСоответствие.Получить(ПроектнаяЗадача);
		
		Календарь = упоПроектыИЗадачиСервер.КалендарьПоИерархииОбъектовДДС(ПроектнаяЗадача);
		упоПроектыИЗадачиОбщие.ОбновитьДатуПривязкиВСтроке(Сроки, Календарь, СтрокаДДС);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуДвиженийДДС(ТаблицаДвиженийБДДС, ДанныеПланаДДС, ДанныеДокумента, ЭтоПроектнаяЗадача,
	ЭтоДанныеСФинансамиИТрансляцией)
	
	ВалютаУпр = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	// Для данных с финансами и трансляцией не нужно очищать таблицу движений БДДС полностью, т.к. она уже была 
	// предварительно заполнена данными актуализации по срокам. Удаляем только нужные задачи во избажании дублирования.	
	Если ЭтоДанныеСФинансамиИТрансляцией Тогда
		
		ЗадачиСТрансляцией = ДанныеПланаДДС.Скопировать(, "ПроектнаяЗадача");
		ЗадачиСТрансляцией.Свернуть("ПроектнаяЗадача");
		
		Для каждого ЗадачаСТрансляцией Из ЗадачиСТрансляцией Цикл
			СтруктураОтбора = Новый Структура("ПроектнаяЗадача", ЗадачаСТрансляцией.ПроектнаяЗадача);
			УдаляемыеСтроки = ТаблицаДвиженийБДДС.НайтиСтроки(СтруктураОтбора);
			Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				ТаблицаДвиженийБДДС.Удалить(УдаляемаяСтрока);
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		ТаблицаДвиженийБДДС.Очистить();
	КонецЕсли;
	
	Для Каждого СтрокаДДС Из ДанныеПланаДДС Цикл
		
		НоваяСтрока = ТаблицаДвиженийБДДС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДДС);
		Если ЭтоПроектнаяЗадача Тогда
			ПроектнаяЗадача = ДанныеДокумента.ПроектнаяЗадача;
			НоваяСтрока.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(СтрокаДДС.Сумма,
				СтрокаДДС.Валюта, ВалютаУпр, ПроектнаяЗадача.Дата);
			НоваяСтрока.СуммаВалютная = СтрокаДДС.Сумма;
		Иначе
			ПроектнаяЗадача = НоваяСтрока.ПроектнаяЗадача;
		КонецЕсли;
		НоваяСтрока.ПроектнаяЗадача = ПроектнаяЗадача;
		НоваяСтрока.Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция получает схемы оплаты для списка проектных задач. 
//
// Параметры:
//  ТаблицаДвиженийБДР - ТаблицаЗначений.
//  ДанныеДокумента - Структура.
//
Функция СхемыОплатыТаблицыДвиженийБДР(ТаблицаДвиженийБДР, ДанныеДокумента)
	
	СоответствиеСхемОплаты = Новый Соответствие;
	
	КопияТаблицаДвижений = ТаблицаДвиженийБДР.Скопировать();
	КопияТаблицаДвижений.Свернуть("ПроектнаяЗадача");
	
	ПроектныеЗадачи = КопияТаблицаДвижений.ВыгрузитьКолонку("ПроектнаяЗадача");	
	СвойстваПроектныхЗадач = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектныхЗадач(ПроектныеЗадачи, 
		"СхемаОплатыПоУмолчаниюДоходы, СхемаОплатыПоУмолчаниюРасходы");  	
		
	ИсточникНастроекВДокументе = ДанныеДокумента.Свойство("ПроектныеЗадачи") И
		(ДанныеДокумента.ПерезаписатьСхемаОплатыПоУмолчаниюДоходы
		Или ДанныеДокумента.ПерезаписатьСхемаОплатыПоУмолчаниюРасходы);
	
	Для каждого СтрокаДвиженияБДР Из КопияТаблицаДвижений Цикл
		
		ПроектнаяЗадача = СтрокаДвиженияБДР.ПроектнаяЗадача;
		
		Если ИсточникНастроекВДокументе Тогда
			СтрокаДокумента = ДанныеДокумента.ПроектныеЗадачи.Найти(ПроектнаяЗадача, "ПроектнаяЗадача");
		Иначе
			СтрокаДокумента = Неопределено;
		КонецЕсли;
		
		СхемаОплатыДоходыРасходы = Новый Структура;
		Если ЗначениеЗаполнено(СтрокаДокумента) Тогда
			СхемаОплатыДоходыРасходы.Вставить("СхемаОплатыПоУмолчаниюДоходы", СтрокаДокумента.СхемаОплатыПоУмолчаниюДоходы);
			СхемаОплатыДоходыРасходы.Вставить("СхемаОплатыПоУмолчаниюРасходы", СтрокаДокумента.СхемаОплатыПоУмолчаниюРасходы);
		Иначе 
			СвойстваЗадачи = СвойстваПроектныхЗадач.Получить(ПроектнаяЗадача);
			СхемаОплатыДоходыРасходы.Вставить("СхемаОплатыПоУмолчаниюДоходы", СвойстваЗадачи.СхемаОплатыПоУмолчаниюДоходы);
			СхемаОплатыДоходыРасходы.Вставить("СхемаОплатыПоУмолчаниюРасходы", СвойстваЗадачи.СхемаОплатыПоУмолчаниюРасходы);
		КонецЕсли;
		
		СоответствиеСхемОплаты.Вставить(ПроектнаяЗадача, СхемаОплатыДоходыРасходы);
		
	КонецЦикла;
	
	Возврат СоответствиеСхемОплаты;
	
КонецФункции

Функция ТекстЗапросаСвойстваЗадачДляИзмененияВДокументеСохранениеДанныхПроекта()
	
	ТекстЗапросаСвойства = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Сроки.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	Сроки.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
		|	&ПоляСвойств
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И (&ВсеЗадачи ИЛИ ПроектнаяЗадача В (&СписокЗадач))) КАК Свойства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		|				,
		|				Версия = &текВерсия) КАК Сроки
		|		ПО Свойства.Версия = Сроки.Версия
		|			И Свойства.ПроектнаяЗадача = Сроки.ПроектнаяЗадача";
	
	РесурсыРегистра = Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Ресурсы;
	СтрокиЗапросаСвойств = Новый Массив;
	Для Каждого Ресурс Из РесурсыРегистра Цикл
		СтрокаЗапроса = СтрШаблон("свойства.%1", Ресурс.Имя);
		СтрокиЗапросаСвойств.Добавить(СтрокаЗапроса);
	КонецЦикла;
	ТекстСвойства = СтрСоединить(СтрокиЗапросаСвойств, ",");
	
	ТекстЗапросаСвойства = СтрЗаменить(ТекстЗапросаСвойства, "&ПоляСвойств", ТекстСвойства);
	
	Возврат ТекстЗапросаСвойства;
	
КонецФункции

Функция АктуализируемыеПроектныеЗадачиПоОпцииТрансляции(ИмяОпцииТрансляции, ТекущаяВерсияПроекта)
	
	АктуализируемыеПроектныеЗадачи = Новый Соответствие;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
		|ИЗ
		|   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсияПроекта) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|   НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|   И упоСвойстваПроектныхЗадачСрезПоследних.%1";
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяОпцииТрансляции);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущаяВерсияПроекта", ТекущаяВерсияПроекта);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ПроектныеЗадачи = РезультатЗапроса.ВыгрузитьКолонку("ПроектнаяЗадача");
	Если Не ПроектныеЗадачи.Количество() Тогда
		Возврат АктуализируемыеПроектныеЗадачи;
	КонецЕсли;
	АктуализируемыеПроектныеЗадачи = СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ТекущаяВерсияПроекта,
		ПроектныеЗадачи);
	
	Возврат АктуализируемыеПроектныеЗадачи;
	
КонецФункции

Функция НаименованиеОпцииТрансляцииПоИмениМетаданных(ИмяОпцииТрансляции)
	
	Если ИмяОпцииТрансляции = "ВключитьСубпродуктыВПланДоходов" Тогда
		НаименованиеОпцииТрансляции = """Включить субпродукты в план доходов""";
	ИначеЕсли ИмяОпцииТрансляции = "ВключитьМатРесурсыВПланРасходов" Тогда
		НаименованиеОпцииТрансляции = """Включить материальные ресурсы в план расходов""";
	ИначеЕсли ИмяОпцииТрансляции = "ВключитьТрудРесурсыВПланРасходов" Тогда
		НаименованиеОпцииТрансляции = """Включить трудовые ресурсы в план расходов""";
	ИначеЕсли ИмяОпцииТрансляции = "ВключитьДопЗатратыВПланРасходов" Тогда
		НаименованиеОпцииТрансляции = """Включить дополнительные затраты в план расходов""";
	ИначеЕсли ИмяОпцииТрансляции = "ВключитьПланДоходовВБДДС" Тогда
		НаименованиеОпцииТрансляции = """Включить план доходов в план ДДС""";
	ИначеЕсли ИмяОпцииТрансляции = "ВключитьПланРасходовВБДДС" Тогда
		НаименованиеОпцииТрансляции = """Включить план расходов в план ДДС""";
	Иначе
		НаименованиеОпцииТрансляции = "";
	КонецЕсли;
	
	Возврат НаименованиеОпцииТрансляции;
	
КонецФункции

#КонецОбласти