////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с сообщениями пользователю.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция выводит сообщение пользователя по переданному коду сообщения.
//
// Параметры:
//	КодСообщения	   	   - Строка – код сообщения.
//	КлючДанных 			   - Ссылка – параметр для СообщениеПользователю().
//	Поле 				   - Строка – параметр для СообщениеПользователю().
//	ПутьКДанным 		   - Строка – параметр для СообщениеПользователю().
//	ИдентификаторНазначения- UUID	– параметр для СообщениеПользователю().
//	П1  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П2  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П3  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П4  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П5  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П6  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П7  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П8  		   		   - Строка - параметр для подстановки в текст сообщения.
//	П9  		   		   - Строка - параметр для подстановки в текст сообщения.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ВывестиПоКодуУниверсально(КодСообщения,
								  КлючДанных = Неопределено,
								  Поле = Неопределено,
								  ПутьКДанным = Неопределено,
								  ИдентификаторНазначения = Неопределено,
								  П1=Неопределено,
								  П2=Неопределено,
								  П3=Неопределено,
								  П4=Неопределено,
								  П5=Неопределено,
								  П6=Неопределено,
								  П7=Неопределено,
								  П8=Неопределено,
								  П9=Неопределено) Экспорт
	ТекстСообщения = ПолучитьТекстСообщенияПоКоду(КодСообщения);	
	ТекстСообщения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		ТекстСообщения, П1, П2, П3, П4, П5, П6, П7, П8, П9);	
	ВывестиУниверсально(ТекстСообщения, КлючДанных, Поле, ПутьКДанным, ИдентификаторНазначения);
КонецФункции

// Выводит сообщение пользователю универсально.
//
// Параметры:
//	Текст					 - Строка					- текст сообщения.
//	КлючДанных				 - Произвольный 			- ссылка на объект информационной базы, к которому это сообщение 
//								относится, или ключ записи.
//	Поле					 - Строка 					- путь к реквизиту формы, для которого было выведено сообщение,
//								или к данным объекта.
//	ПутьКДанным				 - Строка 					- путь в форме, которая будет отображать сообщение, до объекта,
//								связанного с этим сообщением.
//	ИдентификаторНазначения	 - УникальныйИдентификатор 	- позволяет точно указать, к какой форме должно быть.
//								"привязано" сообщение. Если сообщение не имеет идентификатора назначения, тогда оно
//								выводится и привязывается к активному окну.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ВывестиУниверсально(Текст,
							КлючДанных = Неопределено,
							Поле = Неопределено,
							ПутьКДанным = Неопределено,
							ИдентификаторНазначения = Неопределено) Экспорт
	текСообщение = Новый СообщениеПользователю();
	
	Если КлючДанных = Неопределено Тогда
		текСообщение.КлючДанных = ПредопределенноеЗначение("Справочник.упоСообщениеПользователю.СообщениеПользователю");
	ИначеЕсли ПутьКДанным = Неопределено Тогда
		текСообщение.УстановитьДанные(КлючДанных);
	Иначе
		текСообщение.ПутьКДанным = ПутьКДанным;
		текСообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если Поле <> Неопределено Тогда
		текСообщение.Поле = Поле;	
	КонецЕсли;
		
	Если ИдентификаторНазначения <> Неопределено Тогда
		текСообщение.ИдентификаторНазначения = ИдентификаторНазначения;	
	КонецЕсли;	
	
	текСообщение.Текст = Текст;
	текСообщение.Сообщить();
КонецФункции

// Выводит только текст сообщения в сообщении пользователя.
//
// Параметры:
//  текст	 - Строка - текст сообщения.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция Вывести(текст) Экспорт 
	ВывестиУниверсально(текст);
КонецФункции 

// Функция выводит сообщение пользователя по переданному коду сообщения.
//
// Параметры:
//  КодСообщения - Строка – код сообщения.
//  П1  		 - Строка - параметр для подстановки в текст сообщения.
//  П2  		 - Строка - параметр для подстановки в текст сообщения.
//  П3  		 - Строка - параметр для подстановки в текст сообщения.
//  П4  		 - Строка - параметр для подстановки в текст сообщения.
//  П5  		 - Строка - параметр для подстановки в текст сообщения.
//  П6  		 - Строка - параметр для подстановки в текст сообщения.
//  П7  		 - Строка - параметр для подстановки в текст сообщения.
//  П8  		 - Строка - параметр для подстановки в текст сообщения.
//  П9  		 - Строка - параметр для подстановки в текст сообщения.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ВывестиПоКоду(КодСообщения,
					  П1=Неопределено,
					  П2=Неопределено,
					  П3=Неопределено,
					  П4=Неопределено,
					  П5=Неопределено,
					  П6=Неопределено,
					  П7=Неопределено,
					  П8=Неопределено,
					  П9=Неопределено) Экспорт 
	ВывестиПоКодуУниверсально(КодСообщения, , , , , П1, П2, П3, П4, П5, П6, П7, П8, П9);
КонецФункции // ВывестиПоКоду()

// Функция выводит сообщение пользователя по переданному коду сообщения.
//
// Параметры:
//  КодСообщения	- Строка – код сообщения.
//  СсылкаНаОбъект	- Ссылка – ссылка на объект к которому относится сообщение.
//  П1	  			- Строка - параметр для подстановки в текст сообщения.
//  П2	  			- Строка - параметр для подстановки в текст сообщения.
//  П3	  			- Строка - параметр для подстановки в текст сообщения.
//  П4	  			- Строка - параметр для подстановки в текст сообщения.
//  П5	  			- Строка - параметр для подстановки в текст сообщения.
//  П6	  			- Строка - параметр для подстановки в текст сообщения.
//  П7	  			- Строка - параметр для подстановки в текст сообщения.
//  П8	  			- Строка - параметр для подстановки в текст сообщения.
//  П9	  			- Строка - параметр для подстановки в текст сообщения.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ВывестиПоКодуСоСсылкойНаОбъект(КодСообщения, СсылкаНаОбъект, П1=Неопределено, П2=Неопределено, П3=Неопределено,
	П4=Неопределено, П5=Неопределено, П6=Неопределено, П7=Неопределено, П8=Неопределено, П9=Неопределено) Экспорт
	
	ВывестиПоКодуУниверсально(КодСообщения, СсылкаНаОбъект, , , , П1, П2, П3, П4, П5, П6, П7, П8, П9);
	
КонецФункции
                     
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает текст сообщения по коду
//
// Параметры:
//  КодСообщения - Строка - код сообщения.
//
// Возвращаемое значение:
//   Строка  – текст сообщения.
//
Функция ПолучитьТекстСообщенияПоКоду(КодСообщения)
	// Планируется в дальнейшем вывести сообщения в макет.
	// Из которого используя кэшируемый общий модуль можно будет получать сообщение.
	
	ТекстыСообщений = упоСообщениеПользователюПовтИсп.ПолучитьСтруктуруСообщений();
	
	лТекстСообщения = ТекстыСообщений[КодСообщения];
	
	Возврат НСтр(лТекстСообщения);
КонецФункции // ПолучитьТекстСообщенияПоКоду()

#КонецОбласти