
#Область ПрограммныйИнтерфейс

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
// 
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.упоОбработкаДетекторовСобытий;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.упоИспользоватьОповещения;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ДоступноВМоделиСервиса = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.упоОбработкаПроизошедшихСобытий;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.упоИспользоватьОповещения;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ДоступноВМоделиСервиса = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.упоОтправкаСообщенийИзОчереди;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.упоИспользоватьОповещения;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	Настройка.ДоступноВМоделиСервиса = Ложь;	
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.упоПересчетОграниченийДоступаПоПроектам;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ОграничиватьДоступНаУровнеЗаписей;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	Настройка.ДоступноВМоделиСервиса = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.упоОтражениеДокументовВПроектномБюджетировании;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	Настройка.ДоступноВМоделиСервиса = Ложь;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Настройка = Настройки.Добавить();
		Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания["упоРасчетСтатусовПроектнойПродукции"];
		Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции["упоИспользоватьПроектнуюПродукцию"];
		Настройка.РаботаетСВнешнимиРесурсами = Ложь;
		Настройка.ДоступноВМоделиСервиса = Ложь;
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM()
		Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		// ИнтеграцияС1СДокументооборотом
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
		// Конец ИнтеграцияС1СДокументооборотом
	КонецЕсли;
	
КонецПроцедуры

// Определяет список объектов конфигурации, в модулях менеджеров которых предусмотрена процедура 
// ДобавитьКомандыСозданияНаОсновании, формирующая команды создания на основании объектов.
// Синтаксис процедуры ДобавитьКомандыСозданияНаОсновании см. в документации.
//
// Параметры:
//   Объекты - Массив - объекты метаданных (ОбъектМетаданных) с командами создания на основании.
//
// Пример:
//  Объекты.Добавить(Метаданные.Справочники.Организации);
//
Процедура ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		
		Объекты.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов);
		Объекты.Добавить(Метаданные.Справочники.Должности);
		Объекты.Добавить(Метаданные.Справочники.Контрагенты);
		Объекты.Добавить(Метаданные.Справочники.Номенклатура);
		Объекты.Добавить(Метаданные.Справочники.Организации);
		Объекты.Добавить(Метаданные.Справочники.СтатьиДвиженияДенежныхСредств);
		
	КонецЕсли; 
	
	Объекты.Добавить(Метаданные.Справочники.Проекты);
	Объекты.Добавить(Метаданные.Справочники.упоВидыКонкурсов);
	Объекты.Добавить(Метаданные.Справочники.упоВидыОбъектов);
	Объекты.Добавить(Метаданные.Справочники.упоВидыОпераций);
	Объекты.Добавить(Метаданные.Справочники.упоВнепроектныеЗадачи);
	Объекты.Добавить(Метаданные.Справочники.упоЕдиницыВремени);
	Объекты.Добавить(Метаданные.Справочники.упоЗадания);
	Объекты.Добавить(Метаданные.Справочники.упоИсточникиРисковПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоИсточникиФинансирования);
	Объекты.Добавить(Метаданные.Справочники.упоКатегорииРисков);
	Объекты.Добавить(Метаданные.Справочники.упоКлассификаторИспользованияРабочегоВремени);
	Объекты.Добавить(Метаданные.Справочники.упоНастройкиКалендарей);
	Объекты.Добавить(Метаданные.Справочники.упоНормыСтоимости);
	Объекты.Добавить(Метаданные.Справочники.упоОбъекты);
	Объекты.Добавить(Метаданные.Справочники.упоПодразделения);
	Объекты.Добавить(Метаданные.Справочники.упоПоказателиПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоПортфелиПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоПричиныПотерьРабочегоВремени);
	Объекты.Добавить(Метаданные.Справочники.упоПрограммыПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоПрофилиРаспределенияДоходовИРасходов);
	Объекты.Добавить(Метаданные.Справочники.упоПрофилиРаспределенияТрудозатрат);
	Объекты.Добавить(Метаданные.Справочники.упоРабочиеКалендари);
	Объекты.Добавить(Метаданные.Справочники.упоРискиПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоРоли);
	Объекты.Добавить(Метаданные.Справочники.упоСложностьПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоСобственныеСилыСубподряд);
	Объекты.Добавить(Метаданные.Справочники.упоСобытияКалендаря);
	Объекты.Добавить(Метаданные.Справочники.упоСообщениеПользователю);
	Объекты.Добавить(Метаданные.Справочники.упоСотрудники);
	Объекты.Добавить(Метаданные.Справочники.упоСтатусыРисковПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоСтатьиДоходов);
	Объекты.Добавить(Метаданные.Справочники.упоСтатьиЗатрат);
	Объекты.Добавить(Метаданные.Справочники.упоСхемыОплаты);
	Объекты.Добавить(Метаданные.Справочники.упоТипыКонтрактов);
	Объекты.Добавить(Метаданные.Справочники.упоТипыПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоТрудовыеРесурсы);
	Объекты.Добавить(Метаданные.Справочники.упоШаблоныКонтрагентов);
	Объекты.Добавить(Метаданные.Справочники.упоШаблоныПроектныхЗадач);
	Объекты.Добавить(Метаданные.Справочники.упоШаблоныПроектов);
	Объекты.Добавить(Метаданные.Справочники.упоШаблоныРисковПроектов);

	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Объекты.Добавить(Метаданные.Справочники.упоВидДоговора);
		Объекты.Добавить(Метаданные.Справочники.упоПравилаЗаполненияПараметров);
		Объекты.Добавить(Метаданные.Справочники.упоПравилаФормированияНаименованийДоговоров);
		Объекты.Добавить(Метаданные.Справочники.упоСвязиОбъектовСистемыИФайлов);
		Объекты.Добавить(Метаданные.Справочники.упоСтатусыОбъектов);
		Объекты.Добавить(Метаданные.Справочники.упоЭтапыДоговоров);
		Объекты.Добавить(Метаданные.Документы.упоЗаявкаНаПроект);
		Объекты.Добавить(Метаданные.Документы.упоИзменениеСтатусаДоговора);
		Объекты.Добавить(Метаданные.Документы.упоКопированиеЗадачВСводныйПроект);
		Объекты.Добавить(Метаданные.Документы.упоПланированиеТрудозатратПоТрудовымРесурсам);
		Объекты.Добавить(Метаданные.Документы.упоПрогнозТрудозатратПоРолям);
		Объекты.Добавить(Метаданные.Документы.упоРасчетИтоговогоБаллаПроектов);
		Объекты.Добавить(Метаданные.Документы.упоРегистрацияПоказателейЭффективностиПроекта);
		Объекты.Добавить(Метаданные.Документы.упоРегистрацияЮридическихУсловийДоговора);
		Объекты.Добавить(Метаданные.Документы.упоСоответствиеСтратегическимЦелям);
		Объекты.Добавить(Метаданные.Документы.упоСтатусОтчетПоПроекту);
		Объекты.Добавить(Метаданные.Документы.упоФормированиеБизнесПлана);
	КонецЕсли;
	
	Объекты.Добавить(Метаданные.Документы.упоАктуализацияПроекта);
	Объекты.Добавить(Метаданные.Документы.упоВерсияПланаПроекта);
	Объекты.Добавить(Метаданные.Документы.упоВозобновлениеПроекта);
	Объекты.Добавить(Метаданные.Документы.упоЗавершениеПроекта);
	Объекты.Добавить(Метаданные.Документы.упоЗакрытиеЭтапа);	
	Объекты.Добавить(Метаданные.Документы.упоИзменениеВладельцаРесурсов);
	Объекты.Добавить(Метаданные.Документы.упоИзменениеДолжностиСотрудника);
	Объекты.Добавить(Метаданные.Документы.упоИзменениеПозицииСДР);
	Объекты.Добавить(Метаданные.Документы.упоИзменениеРабочегоКалендаря);
	Объекты.Добавить(Метаданные.Документы.упоИзменениеРуководителяПроекта);
	Объекты.Добавить(Метаданные.Документы.упоИзменениеРуководителяПроектнойЗадачи);
	Объекты.Добавить(Метаданные.Документы.упоИзменениеСоставаПодразделения);	
	Объекты.Добавить(Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроект);
	Объекты.Добавить(Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу);
	Объекты.Добавить(Метаданные.Документы.упоОсвобождениеДиспетчера);
	Объекты.Добавить(Метаданные.Документы.упоОстановкаПроектныхРабот);
	Объекты.Добавить(Метаданные.Документы.упоОтражениеФактаВПроектномБюджетировании);
	Объекты.Добавить(Метаданные.Документы.упоПроектнаяЗадача);
	Объекты.Добавить(Метаданные.Документы.упоРаспределениеРабочегоВремениЗаНеделю);	
	Объекты.Добавить(Метаданные.Документы.упоРасчетКалендарногоПланаПроекта);
	Объекты.Добавить(Метаданные.Документы.упоРасчетЦеныКонтракта);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияВладельцаРесурсов);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияДиспетчера);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияИзмененийРисковПроектов);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияМощностиРолей);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияОперативнойЗагрузкиСпециалистов);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияПоказателейПроекта);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияПроекта);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияРабочегоКалендаря);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияРолейТрудовогоРесурса);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияРуководителяПодразделения);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияСоставаПодразделения);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияСотрудника);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияСтоимостиРесурса);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияСтоимостиРесурсов);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияФактическиВыполненногоОбъема);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияФактическихДвиженийДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияФактическихДопЗатрат);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов);
	Объекты.Добавить(Метаданные.Документы.упоРегистрацияФактическихЗатратМатРесурсов);
	Объекты.Добавить(Метаданные.Документы.упоРучнаяАктуализацияПроекта);
	Объекты.Добавить(Метаданные.Документы.упоСинхронизацияФактическиВыполненныхОбъемов);
	Объекты.Добавить(Метаданные.Документы.упоСинхронизацияФактическихДвиженийДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.упоСмещениеВладельцаРесурсов);
	Объекты.Добавить(Метаданные.Документы.упоСмещениеРолейТрудовогоРесурса);
	Объекты.Добавить(Метаданные.Документы.упоСохранениеДанныхПроекта);
	Объекты.Добавить(Метаданные.Документы.упоСтартПроектныхРабот);
	Объекты.Добавить(Метаданные.Документы.упоТабельУчетаРабочегоВремени);
	Объекты.Добавить(Метаданные.Документы.упоУтверждениеПланаПроекта);
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		Объекты.Добавить(Метаданные.Документы.упоСогласованиеТрудозатрат);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается для формирования списка команд создания на основании КомандыСозданияНаОсновании, однократно для при первой
// необходимости, а затем результат кэшируется с помощью модуля с повторным использованием возвращаемых значений.
// Здесь можно определить команды создания на основании, общие для большинства объектов конфигурации.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - сформированные команды для вывода в подменю:
//     
//     Общие настройки:
//       * Идентификатор - Строка - Идентификатор команды.
//     
//     Настройки внешнего вида:
//       * Представление - Строка   - Представление команды в форме.
//       * Важность      - Строка   - Группа в подменю, в которой следует вывести эту команду.
//                                    Допустимо использовать: "Важное", "Обычное" и "СмТакже".
//       * Порядок       - Число    - Порядок размещения команды в подменю. Используется для настройки под конкретное
//                                    рабочее место.
//       * Картинка      - Картинка - Картинка команды.
//     
//     Настройки видимости и доступности:
//       * ТипПараметра - ОписаниеТипов - Типы объектов, для которых предназначена эта команда.
//       * ВидимостьВФормах    - Строка - Имена форм через запятую, в которых должна отображаться команда.
//                                        Используется когда состав команд отличается для различных форм.
//       * ФункциональныеОпции - Строка - Имена функциональных опций через запятую, определяющих видимость команды.
//       * УсловияВидимости    - Массив - Определяет видимость команды в зависимости от контекста.
//                                        Для регистрации условий следует использовать процедуру
//                                        ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды().
//                                        Условия объединяются по "И".
//       * ИзменяетВыбранныеОбъекты - Булево - Определяет доступность команды в ситуации,
//                                        когда у пользователя нет прав на изменение объекта.
//                                        Если Истина, то в описанной выше ситуации кнопка будет недоступна.
//                                        Необязательный. Значение по умолчанию: Ложь.
//     
//     Настройки процесса выполнения:
//       * МножественныйВыбор - Булево, Неопределено - Если Истина, то команда поддерживает множественный выбор.
//             В этом случае в параметре выполнения будет передан список ссылок.
//             Необязательный. Значение по умолчанию: Ложь.
//       * РежимЗаписи - Строка - Действия, связанные с записью объекта, которые выполняются перед обработчиком команды.
//             "НеЗаписывать"          - Объект не записывается, а в параметрах обработчика вместо ссылок передается
//                                       вся форма. В этом режиме рекомендуется работать напрямую с формой,
//                                       которая передается в структуре 2 параметра обработчика команды.
//             "ЗаписыватьТолькоНовые" - Записывать новые объекты.
//             "Записывать"            - Записывать новые и модифицированные объекты.
//             "Проводить"             - Проводить документы.
//             Перед записью и проведением у пользователя запрашивается подтверждение.
//             Необязательный. Значение по умолчанию: "Записывать".
//       * ТребуетсяРаботаСФайлами - Булево - Если Истина, то в веб-клиенте предлагается
//             установить расширение работы с файлами.
//             Необязательный. Значение по умолчанию: Ложь.
//     
//     Настройки обработчика:
//       * Менеджер - Строка - Объект, отвечающий за выполнение команды.
//       * ИмяФормы - Строка - Имя формы, которую требуется получить для выполнения команды.
//             Если Обработчик не указан, то у формы вызывается метод "Открыть".
//       * ПараметрыФормы - Неопределено, ФиксированнаяСтруктура - Необязательный. Параметры формы, указанной в ИмяФормы.
//       * Обработчик - Строка - Описание процедуры, обрабатывающей основное действие команды.
//             Формат "<ИмяОбщегоМодуля>.<ИмяПроцедуры>" используется когда процедура размещена в общем модуле.
//             Формат "<ИмяПроцедуры>" используется в следующих случаях:
//               - Если ИмяФормы заполнено то в модуле указанной формы ожидается клиентская процедура.
//               - Если ИмяФормы не заполнено то в модуле менеджера этого объекта ожидается серверная процедура.
//       * ДополнительныеПараметры - ФиксированнаяСтруктура - Необязательный. Параметры обработчика, указанного в Обработчик.
//   
//   Параметры - Структура - Сведения о контексте исполнения.
//       * ИмяФормы - Строка - Полное имя формы.
//
//   СтандартнаяОбработка - Булево - Если установить в Ложь, то событие "ДобавитьКомандыСозданияНаОсновании" менеджера
//                                   объекта не будет вызвано.
//
Процедура ПередДобавлениемКомандСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры, СтандартнаяОбработка) Экспорт
	
	//Устарел. Не используется с версии 4.2.28.1
	//Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM()
	//	И ПравоДоступа("Просмотр", Метаданные.Обработки.ИнтеграцияС1СДокументооборот)
	//	И упоИнтеграция.ТипИнтегрированСДокументооборотом(Параметры.ТипыИсточников) Тогда  
	//			
	//	КомандаСозданияНаОсновании = КомандыСозданияНаОсновании.Добавить();
	//	КомандаСозданияНаОсновании.Обработчик = "упоИнтеграцияEPMКлиент.ИнтеграцияС1СДокументооборотСоздатьПисьмо";
	//	КомандаСозданияНаОсновании.Идентификатор = "ИнтеграцияС1СДокументооборотСоздатьПисьмо";
	//	КомандаСозданияНаОсновании.Представление = НСтр("ru = 'Документооборот: Письмо'; en = 'Data interchange: Email'");
	//	КомандаСозданияНаОсновании.РежимЗаписи = ?(Параметры.ВидВРег = "ДОКУМЕНТ", "Проводить", "Записывать");
	//	КомандаСозданияНаОсновании.ФункциональныеОпции = "ИспользоватьЭлектроннуюПочту1СДокументооборота";
	//	КомандаСозданияНаОсновании.Порядок = 98;
	//	
	//	КомандаСозданияНаОсновании = КомандыСозданияНаОсновании.Добавить();
	//	КомандаСозданияНаОсновании.Обработчик = "упоИнтеграцияEPMКлиент.ИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс";
	//	КомандаСозданияНаОсновании.Идентификатор = "ИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс";
	//	КомандаСозданияНаОсновании.Представление = НСтр("ru = 'Документооборот: Процесс...'; en = 'Data interchange: Process ...'");
	//	КомандаСозданияНаОсновании.РежимЗаписи = ?(Параметры.ВидВРег = "ДОКУМЕНТ", "Проводить", "Записывать");
	//	КомандаСозданияНаОсновании.ФункциональныеОпции = "ИспользоватьПроцессыИЗадачи1СДокументооборота";
	//	КомандаСозданияНаОсновании.Порядок = 99;
	//			
	//КонецЕсли;
	
	Справочники.упоЗадания.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании); 
	
КонецПроцедуры

// См. ВариантыОтчетовПереопределяемый.ОпределитьРазделыСВариантамиОтчетов
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсПортфелиИПрограммы);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсПроектыИФазы);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсСтруктураРаботПроекта);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсПроектноеБюджетирование);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсТрудозатратыПроектов);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсМатериальныеИДопЗатратыПроектов);
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсНормированиеИПроектныеРешения);
	КонецЕсли;
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсОбъемыИВыполнениеПроектов);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсЧасыРаботыИЗадания);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсПредприятиеИРесурсы);
	Разделы.Добавить(Метаданные.Подсистемы.упоИнтерфейсПроекты);
	
КонецПроцедуры

// Задает расширенные настройки отчетов конфигурации, такие как:
// - описание отчета;
// - поля поиска: наименования полей, параметров и отборов (для отчетов не на базе СКД);
// - размещение в разделах командного интерфейса
//   (начальная настройка размещения отчетов по подсистемам автоматически определяется из метаданных,
//    ее дублирование не требуется);
// - признак Включен (для контекстных отчетов);
// - режима вывода в панелях отчетов (с группировкой по отчету или без);
// - и другие.
// 
// В процедуре задаются только настройки отчетов (и вариантов отчетов) конфигурации.
// Для настройки отчетов из расширений конфигурации следует включать их в подсистему ПодключаемыеОтчетыИОбработки.
//
// Для задания настроек следует использовать следующие вспомогательные процедуры и функции:
//   ВариантыОтчетов.ОписаниеОтчета, 
//   ВариантыОтчетов.ОписаниеВарианта, 
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов, 
//   ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера.
//
// Изменяя настройки отчета, можно изменить настройки всех его вариантов.
// Однако, если явно получить настройки варианта отчета, то они станут самостоятельными,
// т.е. более не будут наследовать изменения настроек от отчета.
//   
// Функциональные опции предопределенного варианта отчета объединяются с функциональными опциями этого отчета по правилам:
// (ФО1_Отчета ИЛИ ФО2_Отчета) И (ФО3_Варианта ИЛИ ФО4_Варианта).
// При этом для пользовательских вариантов отчета действуют только функциональные опции отчета
// - они отключаются только с отключением всего отчета.
//
// Параметры:
//   Настройки - см. ВариантыОтчетов.КоллекцияПредопределенныхВариантовОтчетов
//
// Пример:
//
//  // Добавление варианта отчета в подсистему.
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "<ИмяВарианта>");
//	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ИмяРаздела.Подсистемы.ИмяПодсистемы);
//
//  // Отключение варианта отчета.
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчета, "<ИмяВарианта>");
//	НастройкиВарианта.Включен = Ложь;
//
//  // Отключение всех вариантов отчета, кроме одного.
//	НастройкиОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	НастройкиОтчета.Включен = Ложь;
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//	НастройкиВарианта.Включен = Истина;
//
//  // Заполнение настроек для поиска - наименования полей, параметров и отборов:
//	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИмяОтчетаБезСхемы, "");
//	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей =
//		НСтр("ru = 'Контрагент
//		|Договор
//		|Ответственный
//		|Скидка
//		|Дата'");
//	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов =
//		НСтр("ru = 'Период
//		|Ответственный
//		|Контрагент
//		|Договор'");
//
//  // Переключение режима вывода в панелях отчетов:
//  // Группировка вариантов отчета по этому отчету:
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Метаданные.Отчеты.ИмяОтчета, Истина);
//  // Без группировки по отчету:
//	Отчет = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмяОтчета);
//	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, Отчет, Ложь);
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоSКривая);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Графический анализ выполненных объемов, трудозатрат и готовности проекта.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоАнализ_БДР_по_БДДССКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация в разрезе проектов, проектных задач, статей и календарных периодов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоАнализПроектовПоПоказателямСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о текущем состоянии показателей проектов, а также " 
	+ "о динамике изменений показателей проектов во времени.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоАнализШаблонаПроектаСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация об отклонениях, возникших в процессе выполнения "
	+ "однотипных (созданных по единому шаблону) проектов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоБалансПроекта);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет за выбранный период получить информацию о фактической "
	+ "рентабельности проекта и проанализировать целевые показатели проекта в процессе его выполнения.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоБюджетСМРПоГлавамССР);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Является отчетом по плановым и фактическим объемам.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоВыполненныеИПринятыеОбъемы);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет сопоставить начальный и конечный остаток выполненных объемов, "
	+ "а также выполненный и принятый объем по доходу и расходу в количественном и стоимостном измерениях в разрезе "
	+ "подразделений и календарных периодов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоДвиженияДенежныхСредствПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о плановых и фактических поступлениях и "
	+ "выплатах в разрезе проектов, проектных задач, статей движений денежных средств и календарных периодов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоДвиженияДенежныхСредствПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПлатежныйКалендарь");
	ОписаниеВарианта.Описание = НСтр("ru = 'Платежный календарь проектов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоДвижениеДенежныхСредств);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Остатки и обороты фактических денежных средств.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоДинамикаЭкономикиПроекта);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Графический анализ динамики основных показателей проекта: "
	+ "актов, затрат, маржи, поступлений, выплат, денежного потока, выполненного объема, ФОТа.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоДополнительныеЗатратыПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о плановых и дополнительных затратах в разрезе "
	+ "проектов, проектных задач, статей затрат и календарных периодов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоДоходыИРасходыПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Плановые и фактические доходы и расходы "
	+ "в разрезе проектов, проектных задач, статей и календарных периодов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоЗагрузкаТрудовыхРесурсовПланСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация по запланированной загрузке трудовых "
	+ "ресурсов по предварительному и окончательному уровням планирования.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоЗатратыМатериальныхРесурсовПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических затрат "
	+ "на привлечение материальных ресурсов к проектным работам в количественном и стоимостном измерениях.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоЗатратыМатериальныхРесурсовПланФактСКДБезФинансов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических затратах "
	+ "на привлечение материальных ресурсов к проектным работам в количественном измерении.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоЗатратыТрудовыхРесурсовПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических затратах "
	+ "на привлечение трудовых ресурсов к проектным работам в количественном и стоимостном измерениях.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоЗатратыТрудовыхРесурсовПланФактСКДБезФинансов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических затратах "
	+ "на привлечение трудовых ресурсов к проектным работам в количественном измерении.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоИспользованиеРабочегоВремениСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о распределении рабочего времени между "
	+ "проектными задачами, внепроектными задачами, а также внепроизводственными потерями в разрезе трудовых ресурсов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоМощностьРолейПланСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о запланированной мощности трудовых ресурсов "
	+ "предприятия в разрезе подразделений, ролей трудовых ресурсов и периодов времени.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоОсвоенныеОбъемыEVA);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Используется для измерения и контроля эффективности выполнения проектов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоОсвоенныйОбъемТрудозатратСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических "
	+ "трудозатратах в количественном и стоимостном виде, а также о процентах освоенного объема трудозатрат в разрезе "
	+ "проектов, проектных задач, элементарных операций и трудовых ресурсов.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоОценкиИсполнителейПодрядчиков);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Результаты оценки работы исполнителей и подрядчиков по проектам.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоПланФактныйАнализБДР_Подразделения);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о плановых и фактических доходах и расходах "
	+ "в разрезе проектов, проектных задач, статей и календарных периодов по подразделениям.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоПланФактныйАнализБДР_Подразделения);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДоходыРасходыВКолонках");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о плановых и фактических доходах и расходах "
	+ "в разрезе проектов, проектных задач, статей и календарных периодов по подразделениям. "
	+ "Данные по доходам и расходам разнесены по разным колонкам.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоПланФактныйАнализПоПортфелю);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет за выбранный период получить информацию о плановых и фактических "
	+ "доходах и расходах, объемах, поступлениях и выплатах, а также трудозатратах в разрезе проектных задач портфеля, "
	+ "соответствующих подчиненных проектов, статей и подразделений.'");
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда 
		ОписаниеОтчета.Включен = Ложь;
		ОписаниеВарианта.Включен = Ложь;
	КонецЕсли;	
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоПланФактныйАнализПоПрограмме);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет за выбранный период получить информацию о плановых и фактических "
	+ "доходах и расходах, объемах, поступлениях и выплатах, а также трудозатратах в разрезе проектных задач программы, "
	+ "соответствующих подчиненных проектов, статей и подразделений.'");
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда 
		ОписаниеОтчета.Включен = Ложь;
		ОписаниеВарианта.Включен = Ложь;
	КонецЕсли;
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоПланФактныйАнализРаспределенияОбъемов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Предназначен для сопоставления планового, выполненного и принятого объема "
	+ "по доходу и расходу в количественном и стоимостном измерениях в разрезе подразделений.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоРабочиеКалендариСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о рабочих календарях предприятия.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоРесурсыПроектаПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических затратах "
	+ "на привлечение трудовых ресурсов к проектным работам в количественном и стоимостном измерениях.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСкользящийБДДСПроекта);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Данные о планах БДДС по всем проектам, ведущимся на "
	+ "предприятии, а также для сопоставления плановых и фактических данных БДДС.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСкользящийБДРОбъемыБДДС);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Предназначен для вывода плановых и фактических данных БДР, БДДС, Объемов и "
	+ "Расходов по всем проектам, ведущимся на предприятии, а также для сопоставления их плановых и фактических данных.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСкользящийБДРПроекта);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Предназначен для вывода данных о планах БДР по всем проектам, ведущимся на "
	+ "предприятии, а также для сопоставления плановых и фактических данных БДР.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСостояниеПроектныхЗадачСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Текущее состояние проектных задач.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСравнениеВерсий);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет получить информацию о сроках, финансах и трудозатратах различных "
	+ "версий проектов, а также вывести отклонения показателей выбранных для сравнения версий от эталонной версии.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСрокиПроектаПланФактСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет сопоставить данные о сроках проектных задач текущего (актуального) "
	+ "плана проекта с базовым планом, а также выявить отклонения по срокам.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСтоимостьРесурсовПоНормамСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о нормированной стоимости использования ролей, "
	+ "трудовых и материальных ресурсов предприятия в разрезе норм стоимости и единиц нормирования.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСтруктураТрудовыхРесурсовСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о ролевой структуре трудовых ресурсов "
	+ "предприятия с учетом запланированных ресурсных ограничений.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоТематическийПлан);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о плановых и фактических доходах в разрезе "
	+ "портфелей проектов (тем), проектов, проектных задач, подразделений и статусов договоров с заказчиками, по месяцам "
	+ "за один год.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоЮридическаяСтруктураПредприятияСКД);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о сотрудниках предприятия, занимающих те или "
	+ "иные должности в тех или иных подразделениях предприятия'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоТрудозатратыПоУровнямПланирования);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических затратах "
	+ "на привлечение трудовых ресурсов к проектным работам в количественном и стоимостном измерениях по предварительному "
	+ "и окончательному уровням планирования с возможностью сравнить версии проекта.'");
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоТрудозатратыПоУровнямПланирования);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ЗагрузкаПоЗаказчикам");
	ОписаниеВарианта.Описание = НСтр("ru = 'Информация о соответствии плановых и фактических затратах "
	+ "на привлечение трудовых ресурсов к проектным работам в количественном и стоимостном измерениях по предварительному "
	+ "и окончательному уровням планирования с возможностью сравнить версии проекта.'");
		
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда 
		
		ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоПроизводительностьТрудовыхРесурсовПоВидамОпераций);
		ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
		ОписаниеВарианта.Описание = НСтр("ru = 'Информация о компетенциях трудовых ресурсов.'");
		
		ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСводныйСтатусПоПродажамПроектов);
		ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
		ОписаниеВарианта.Описание = НСтр("ru = 'Сводная информация по статусу продаж проектов.'");
		
		// Распределение ОПР,ОХР
		ДоступенФункционалОПРОХР = упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР(); 
		
		ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоАнализРаспределенияДоходовИРасходов);
		ОписаниеОтчета.Включен = ДоступенФункционалОПРОХР;
		ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПоПроектам");
		ОписаниеВарианта.Описание = НСтр("ru = 'Анализ распределения доходов и расходов'");
		ОписаниеВарианта.Включен = ДоступенФункционалОПРОХР;
		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоСогласованныеТрудозатраты);
		ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СогласованныеТрудозатраты");
		ОписаниеВарианта.Описание = НСтр("ru = 'Информация о согласованных фактических трудозатратах проектных задач.'");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.упоФакторныйАнализПричинОтклонений);
		ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
		ОписаниеВарианта.Описание = НСтр("ru = 'Вывод причин отклонений сроков проектных задач.'");
	КонецЕсли;
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// Для начальной страницы указать ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы.
//
// Параметры:
//   Разделы - Массив - разделы, в которых размещены команды вызова дополнительных обработок.
//       * ОбъектМетаданных: Подсистема - метаданные раздела (подсистемы).
//       * Строка - для начальной страницы.
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	упоИнтеграция.ОпределитьРазделыСВариантамиОтчетов(Разделы);		
	
КонецПроцедуры

// Уточняет сокращенное наименование интегрируемой конфигурации для вывода в заголовках и декорациях.
//
// Параметры:
//   СокращенноеНаименование - Строка - неявно возвращаемое значение, краткое название конфигурации.
//
// Пример:
//   СокращенноеНаименование = НСтр("ru = '1С:ERP УП'");
//
Процедура ПриОпределенииСокращенногоНаименованияКонфигурации(СокращенноеНаименование) Экспорт
	 
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		СокращенноеНаименование = НСтр("ru = '1С:ERP+PM'");
	ИначеЕсли упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		СокращенноеНаименование = НСтр("ru = '1С:УНФ+PM'");	
	ИначеЕсли упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Корп() Тогда
		СокращенноеНаименование = НСтр("ru = '1С:PM КОРП'");
	ИначеЕсли упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		СокращенноеНаименование = НСтр("ru = '1С:PM ПРОФ'");
	КонецЕсли; 
	
КонецПроцедуры

// Определяет префикс кодов и номеров объектов информационной базы по умолчанию.
//
// Параметры:
//	Префикс - Строка, 2 - префикс кодов и номеров объектов информационной базы по умолчанию.
//
Процедура ПриОпределенииПрефиксаИнформационнойБазыПоУмолчанию(Префикс) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		Префикс = НСтр("ru = 'ЦБ'");	
	КонецЕсли;	
	
КонецПроцедуры

// Определяет список планов обмена, которые используют функционал подсистемы обмена данными.
//
// Параметры:
//  ПланыОбменаПодсистемы - Массив - Массив планов обмена конфигурации,
//   которые используют функционал подсистемы обмена данными.
//   Элементами массива являются объекты метаданных планов обмена.
//
// Пример:
//   ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменБезИспользованияПравилКонвертации);
//   ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменСБиблиотекойСтандартныхПодсистем);
//   ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.РаспределеннаяИнформационнаяБаза);
//
Процедура ПолучитьПланыОбмена(ПланыОбменаПодсистемы) Экспорт
	 	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат);
	КонецЕсли;

	ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.упоПереходНаPM);
	
КонецПроцедуры

// Получает доступные для использования версии универсального формата EnterpriseData.
//
// Параметры:
//   ВерсииФормата - Соответствие - Соответствие номера версии формата,
//                   общему модулю, в котором находятся обработчики выгрузки/загрузки для данной версии.
//
// Пример:
//   ВерсииФормата.Вставить("1.2", <ИмяОбщегоМодуляСПравиламиКонвертации>);
//
Процедура ПриПолученииДоступныхВерсийФормата(ВерсииФормата) Экспорт
	 
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
				
		ВерсииФормата.Вставить("1.3", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.4", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.5", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.6", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.7", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.8", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.10", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.11", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.12", упоМенеджерОбменаЧерезУниверсальныйФормат);
		ВерсииФормата.Вставить("1.15", упоМенеджерОбменаЧерезУниверсальныйФормат);
		
	КонецЕсли; 
	
	ВерсииФормата.Вставить("1.0", упоПереходСУПРОФ);
	
КонецПроцедуры

// Позволяет настроить общие параметры подсистемы.
//
// Параметры:
//  ОбщиеПараметры - Структура - структура со свойствами:
//      * ИмяФормыПерсональныхНастроек            - Строка - имя формы для редактирования персональных настроек.
//                                                           Ранее определялись в
//                                                           ОбщегоНазначенияПереопределяемый.ИмяФормыПерсональныхНастроек.
//      * ЗапрашиватьПодтверждениеПриЗавершенииПрограммы - Булево - по умолчанию Истина. Если установить в Ложь, то 
//                                                                  подтверждение при завершении работы программы не
//                                                                  будет запрашиваться,  если явно не разрешить в
//                                                                  персональных настройках программы.
//      * МинимальнаяВерсияПлатформы              - Строка - минимальная версии платформы, требуемая для запуска программы.
//                                                           Запуск программы на версии платформы ниже указанной будет невозможен.
//                                                           Например, "8.3.6.1650".
//      * РекомендуемаяВерсияПлатформы            - Строка - рекомендуемая версия платформы для запуска программы.
//                                                           Например, "8.3.8.2137".
//      * ОтключитьИдентификаторыОбъектовМетаданных - Булево - отключает заполнение справочников ИдентификаторыОбъектовМетаданных
//              и ИдентификаторыОбъектовРасширений, процедуру выгрузки и загрузки в узлах РИБ.
//              Для частичного встраивания отдельных функций библиотеки в конфигурации без постановки на поддержку.
//      * РекомендуемыйОбъемОперативнойПамяти - Число - объем памяти в гигабайтах, рекомендуемый для комфортной работы в
//                                                      программе.
//
//    Устарели, следует использовать свойства МинимальнаяВерсияПлатформы и РекомендуемаяВерсияПлатформы:
//      * МинимальноНеобходимаяВерсияПлатформы    - Строка - полный номер версии платформы для запуска программы.
//                                                           Например, "8.3.4.365".
//                                                           Ранее определялись в
//                                                           ОбщегоНазначенияПереопределяемый.ПолучитьМинимальноНеобходимуюВерсиюПлатформы.
//      * РаботаВПрограммеЗапрещена               - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииОбщихПараметровБазовойФункциональности(ОбщиеПараметры) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		
		ОбщиеПараметры.МинимальнаяВерсияПлатформы = "8.3.27.1244";
		ОбщиеПараметры.РекомендуемаяВерсияПлатформы = "8.3.27.1559";
		ОбщиеПараметры.РекомендуемыйОбъемОперативнойПамяти = 2;
		
	КонецЕсли;
	
	ОбщиеПараметры.Вставить("ИмяФормыПерсональныхНастроек", "ОбщаяФорма.ПерсональныеНастройки");
	
КонецПроцедуры

// Определяет соответствие имен параметров сеанса и обработчиков для их установки.
// Вызывается для инициализации параметров сеанса из обработчика события модуля сеанса УстановкаПараметровСеанса
// (подробнее о нем см. синтакс-помощник).
//
// В указанных модулях должна быть размещена процедура обработчика, в которую передаются параметры:
//  ИмяПараметра           - Строка - имя параметра сеанса, который требуется установить.
//  УстановленныеПараметры - Массив - имена параметров, которые уже установлены.
// 
// Далее пример процедуры обработчика для копирования в указанные модули.
//
//// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
//// 
//// Параметры:
////  ИмяПараметра           - Строка - имя параметра сеанса, который требуется установить.
////  УстановленныеПараметры - Массив из Строка - имена параметров, которые уже установлены.
////
//Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
//	
//	Если ИмяПараметра = "ТекущийПользователь" Тогда
//		ПараметрыСеанса.ТекущийПользователь = Значение;
//		УстановленныеПараметры.Добавить("ТекущийПользователь");
//	КонецЕсли;
//	
//КонецПроцедуры
//
// Параметры:
//  Обработчики - Соответствие - со свойствами:
//    * Ключ     - Строка - в формате "<ИмяПараметраСеанса>|<НачалоИмениПараметраСеанса*>".
//                   Символ '*'используется в конце имени параметра сеанса и обозначает,
//                   что один обработчик будет вызван для инициализации всех параметров сеанса
//                   с именем, начинающимся на слово НачалоИмениПараметраСеанса.
//
//    * Значение - Строка - в формате "<ИмяМодуля>.УстановкаПараметровСеанса".
//
//  Пример:
//   Обработчики.Вставить("ТекущийПользователь", "ПользователиСлужебный.УстановкаПараметровСеанса");
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("упо*", "упоИнициализацияСистемыСервер.УстановитьЗначениеПараметраСеанса");
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

// С помощью ПриОпределенииВидовПодключаемыхКоманд можно определить собственные виды подключаемых команд,
// помимо уже предусмотренных в стандартной поставке (печатные формы, отчеты и команды заполнения).
//
// Параметры:
//   ВидыПодключаемыхКоманд - ТаблицаЗначений - поддерживаемые виды команд:
//       * Имя         - Строка            - имя вида команд. Должно удовлетворять требованиям именования переменных и
//                                           быть уникальным (не совпадать с именами других видов).
//                                           Может соответствовать имени подсистемы, отвечающей за вывод этих команд.
//                                           Следующие имена зарезервированы: "Печать", "Отчеты", "ЗаполнениеОбъектов".
//       * ИмяПодменю  - Строка            - имя подменю для размещения команд этого вида на формах объектов.
//       * Заголовок   - Строка            - наименование подменю, выводимое пользователю.
//       * Картинка    - Картинка          - картинка подменю.
//       * Отображение - ОтображениеКнопки - режим отображения подменю.
//       * Порядок     - Число             - порядок подменю в командной панели формы объекта по отношению 
//                                           к другим подменю. Используется при автоматическом создании подменю 
//                                           в форме объекта.
//
// Пример:
//
//	Вид = ВидыПодключаемыхКоманд.Добавить();
//	Вид.Имя         = "Мотиваторы";
//	Вид.ИмяПодменю  = "ПодменюМотиваторов";
//	Вид.Заголовок   = НСтр("ru = 'Мотиваторы'");
//	Вид.Картинка    = БиблиотекаКартинок.Информация;
//	Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
//	
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	упоПроектноеБюджетированиеСервер.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);

КонецПроцедуры

// Позволяет расширить состав параметра Настройки процедуры ПриОпределенииНастроек в модулях менеджеров отчетов и 
// обработок, включенных в состав подсистемы ПодключаемыеОтчетыИОбработки, с помощью чего отчеты и обработки могут 
// сообщить о себе, что они предоставляют определенные виды команд и взаимодействуют с подсистемами через их 
// программный интерфейс.
//
// Параметры:
//  НастройкиПрограммногоИнтерфейса - ТаблицаЗначений - с колонками:
//   * Ключ              - Строка        - имя настройки, например "ДобавитьМотиваторы".
//   * ОписаниеТипов     - ОписаниеТипов - тип настройки, например: Новый ОписаниеТипов("Булево").
//   * ВидыПодключаемыхОбъектов - Строка - имена видов объектов метаданных, для которых будет доступна эта настройка,
//                                             перечисленные через запятую. Например: "Отчет" или "Отчет, Обработка".
//
// Пример:
//  Для того чтобы в ПриОпределенииНастроек модуля обработки предусмотреть собственный признак ДобавитьМотиваторы:
//  Процедура ПриОпределенииНастроек(Настройки) Экспорт
//    Настройки.ДобавитьМотиваторы = Истина;  // вызывается процедура ДобавитьМотиваторы
//    Настройки.Размещение.Добавить(Метаданные.Документы.Анкеты);
//  КонецПроцедуры
//
//  следует реализовать следующий код:
//  Настройка = НастройкиПрограммногоИнтерфейса.Добавить();
//  Настройка.Ключ          = "ДобавитьМотиваторы";
//  Настройка.ОписаниеТипов = Новый ОписаниеТипов("Булево");
//  Настройка.ВидыПодключаемыхОбъектов = "Обработка";
//
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
	
	упоПроектноеБюджетированиеСервер.ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса);	
	
КонецПроцедуры

// Вызывается однократно при первом формировании списка команд, выводимых в форме конкретного объекта конфигурации.
// Список добавленных команд следует вернуть в параметре Команды.
// Результат кэшируется с помощью модуля с повторными использованием возвращаемых значений (в разрезе имен форм).
//
// Параметры:
//   НастройкиФормы - Структура - сведения о форме, в которой выводятся команды. Для чтения.
//         * ИмяФормы - Строка - полное имя формы, в которой выводятся подключаемые команды. 
//                               Например, "Документ.Анкета.ФормаСписка".
//   
//   Источники - ДеревоЗначений - сведения о поставщиках команд этой формы. 
//         На втором уровне дерева могут располагаться источники, регистрируемые автоматически при регистрации владельца.
//         Например, документы-регистраторы журналов.
//         * Метаданные - ОбъектМетаданных - метаданные объекта.
//         * ПолноеИмя  - Строка           - полное имя объекта. Например: "Документ.ИмяДокумента".
//         * Вид        - Строка           - вид объекта в верхнем регистре. Например: "СПРАВОЧНИК".
//         * Менеджер   - Произвольный     - модуль менеджера объекта, или Неопределено, если у объекта 
//                                           нет модуля менеджера или если его не удалось получить.
//         * Ссылка     - СправочникСсылка.ИдентификаторыОбъектовМетаданных - ссылка объекта метаданных.
//         * ЭтоЖурналДокументов - Булево - Истина, если объект является журналом документов.
//         * ТипСсылкиДанных     - Тип, ОписаниеТипов - тип ссылки элемента.
//   
//   ПодключенныеОтчетыИОбработки - ТаблицаЗначений - отчеты и обработки, предоставляющие свои команды 
//         для объектов Источники:
//         * ПолноеИмя - Строка       - полное имя объекта метаданных.
//         * Менеджер  - Произвольный - модуль менеджера объекта метаданных.
//         Состав колонок см. в ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов.
//   
//   Команды - ТаблицаЗначений - записать в этот параметр сформированные команды для вывода в подменю: 
//       * Вид - Строка - вид команды.
//           Подробнее см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд.
//       * Идентификатор - Строка - идентификатор команды.
//       
//     Настройки внешнего вида:
//       * Представление - Строка   - представление команды в форме.
//       * Важность      - Строка   - суффикс подгруппы в меню, в которой следует вывести эту команду.
//                                    Допустимо использовать: "Важное", "Обычное" и "СмТакже".
//       * Порядок       - Число    - порядок размещения команды в группе. Используется для настройки под конкретное
//                                    рабочее место. Допустимо задавать в диапазоне от 1 до 100. По умолчанию порядок 50.
//       * Картинка      - Картинка - картинка команды. Необязательный.
//       * СочетаниеКлавиш - СочетаниеКлавиш - сочетание клавиш для быстрого вызова команды. Необязательный.
//       * ТолькоВоВсехДействиях - Булево - отображать команду только в меню Еще.
//     
//     Настройки видимости и доступности:
//       * ТипПараметра - ОписаниеТипов - типы объектов, для которых предназначена эта команда.
//       * ВидимостьВФормах    - Строка - имена форм через запятую, в которых должна отображаться команда.
//                                        Используется, когда состав команд отличается для различных форм.
//       * Назначение          - Строка - определяет вид форм, для которых предназначена команда. 
//                                        Принимаемые значения:
//                                         "ДляСписка" - показывать команду только в форме списка,
//                                         "ДляОбъекта" - показывать команду только в форме объекта.
//                                        Если параметр не указан, то команда предназначена для любых видов форм.
//       * ФункциональныеОпции - Строка - имена функциональных опций через запятую, определяющих видимость команды.
//       * УсловияВидимости    - Массив - определяет видимость команды в зависимости от контекста.
//                                        Для регистрации условий следует использовать процедуру
//                                        ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды().
//                                        Условия объединяются по "И".
//       * ИзменяетВыбранныеОбъекты - Булево - определяет доступность команды в ситуации,
//                                        когда у пользователя нет прав на изменение объекта.
//                                        Если Истина, то в описанной выше ситуации кнопка будет недоступна.
//                                        Необязательный. Значение по умолчанию - Ложь.
//     
//     Настройки процесса выполнения:
//       * МножественныйВыбор - Булево - если Истина, то команда поддерживает множественный выбор.
//             В этом случае в параметре выполнения будет передан список ссылок.
//             Необязательный. Значение по умолчанию - Истина.
//       * РежимЗаписи - Строка - действия, связанные с записью объекта, которые выполняются перед обработчиком команды.
//             ** "НеЗаписывать"          - объект не записывается, а в параметрах обработчика вместо ссылок передается
//                                          вся форма. В этом режиме рекомендуется работать напрямую с формой,
//                                          которая передается в структуре 2-го параметра обработчика команды.
//             ** "ЗаписыватьТолькоНовые" - записывать новые объекты.
//             ** "Записывать"            - записывать новые и модифицированные объекты.
//             ** "Проводить"             - проводить документы.
//             Перед записью и проведением у пользователя запрашивается подтверждение.
//             Необязательный. Значение по умолчанию - "Записывать".
//       * ТребуетсяРаботаСФайлами - Булево - если Истина, то в веб-клиенте предлагается
//             установить расширение для работы с 1С:Предприятием. Необязательный. Значение по умолчанию - Ложь.
//     
//     Настройки обработчика:
//       * Менеджер - Строка - объект, отвечающий за выполнение команды.
//       * ИмяФормы - Строка - имя формы, которую требуется получить для выполнения команды.
//           Если Обработчик не указан, то у формы вызывается метод "Открыть".
//       * ИмяПараметраФормы - Строка - имя параметра формы, в который следует передать ссылку или массив ссылок.
//       * ПараметрыФормы - Неопределено, Структура - параметры формы, указанной в ИмяФормы. Необязательный.
//       * Обработчик - Строка - описание процедуры, обрабатывающей основное действие команды, в виде:
//           "<ИмяОбщегоМодуля>.<ИмяПроцедуры>", если процедура размещена в общем модуле;
//           либо "<ИмяПроцедуры>" - в следующих случаях:
//             - если ИмяФормы заполнено, то в модуле указанной формы ожидается клиентская процедура;
//             - если ИмяФормы не заполнено, то в модуле менеджера этого объекта ожидается серверная процедура.
//       * ДополнительныеПараметры - Структура - параметры обработчика, указанного в Обработчик. Необязательный.
//
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	упоПроектноеБюджетированиеСервер.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);	
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
		МодульИнтеграцияУПФСервер = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУПФСервер");
		МодульИнтеграцияУПФСервер.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);	
	КонецЕсли;         
	
КонецПроцедуры

// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур такого модуля см. в общем модуле ОбновлениеИнформационнойБазыБСП
// (область ПрограммныйИнтерфейс).
// При этом сам модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП
// не требуется явно добавлять в массив МодулиПодсистем.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//                             Например: "ОбновлениеИнформационнойБазыБРО" - библиотека,
//                                       "ОбновлениеИнформационнойБазыБП"  - конфигурация.
//                    
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	 
	Если МодулиПодсистем.Найти("ОбновлениеИнформационнойБазыБСП") = Неопределено Тогда
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБСП");	
	КонецЕсли; 
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPMO() Тогда
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыPMO");				
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыEPM");
		
		Если МодулиПодсистем.Найти("ОбновлениеИнформационнойБазыУП") = Неопределено Тогда
			МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУП");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУПФ");			
	КонецЕсли; 
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыDev2");		
	КонецЕсли;	
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM()
		Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() И МодулиПодсистем.Найти("ОбновлениеИнформационнойБазыБИД") = Неопределено Тогда
		// ИнтеграцияС1СДокументооборот
		МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБИД");
		//Конец ИнтеграцияС1СДокументооборот
	КонецЕсли;	
				
КонецПроцедуры

// Позволяет указать роли, назначение которых будет контролироваться особым образом.
// Большинство ролей конфигурации не требуется здесь указывать, т.к. они предназначены для любых пользователей, 
// кроме внешних пользователей.
//
// Параметры:
//  НазначениеРолей - Структура - со свойствами:
//   * ТолькоДляАдминистраторовСистемы - Массив - имена ролей, которые при выключенном разделении
//     предназначены для любых пользователей, кроме внешних пользователей, а в разделенном режиме
//     предназначены только для администраторов сервиса, например:
//       Администрирование, ОбновлениеКонфигурацииБазыДанных, АдминистраторСистемы,
//     а также все роли с правами:
//       Администрирование,
//       Администрирование расширений конфигурации,
//       Обновление конфигурации базы данных.
//     Такие роли, как правило, существуют только в БСП и не встречаются в прикладных решениях.
//
//   * ТолькоДляПользователейСистемы - Массив - имена ролей, которые при выключенном разделении
//     предназначены для любых пользователей, кроме внешних пользователей, а в разделенном режиме
//     предназначены только для неразделенных пользователей (сотрудников технической поддержки сервиса и
//     администраторов сервиса), например:
//       ДобавлениеИзменениеАдресныхСведений, ДобавлениеИзменениеБанков,
//     а также все роли с правами изменения неразделенных данных и следующими правами:
//       Толстый клиент,
//       Внешнее соединение,
//       Automation,
//       Режим все функции,
//       Интерактивное открытие внешних обработок,
//       Интерактивное открытие внешних отчетов.
//     Такие роли в большей части существует в БСП, но могут встречаться и в прикладных решениях.
//
//   * ТолькоДляВнешнихПользователей - Массив - имена ролей, которые предназначены
//     только для внешних пользователей (роли со специально разработанным набором прав), например:
//       ДобавлениеИзменениеОтветовНаВопросыАнкет, БазовыеПраваВнешнихПользователейБСП.
//     Такие роли существуют и в БСП, и в прикладных решениях (если используются внешние пользователи).
//
//   * СовместноДляПользователейИВнешнихПользователей - Массив - имена ролей, которые предназначены
//     для любых пользователей (и внутренних, и внешних, и неразделенных), например:
//       ЧтениеОтветовНаВопросыАнкет, ДобавлениеИзменениеЛичныхВариантовОтчетов.
//     Такие роли существуют и в БСП, и в прикладных решениях (если используются внешние пользователи).
//
Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
		
	НазначениеРолей.СовместноДляПользователейИВнешнихПользователей.Добавить(
		Метаданные.Роли.упоБазовыеПраваPM.Имя);
	НазначениеРолей.СовместноДляПользователейИВнешнихПользователей.Добавить(
		Метаданные.Роли.упоБазовыеПраваEPM.Имя);	
	
КонецПроцедуры

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
    ВидДоступа.Имя = "упоПроекты";
    ВидДоступа.Представление = НСтр("ru = 'Проекты (PM)'");
    ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Проекты");	
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.Проекты, Истина);
	
	Списки.Вставить(Метаданные.Документы.упоАктуализацияПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоВерсияПланаПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоВозобновлениеПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоЗавершениеПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоЗакрытиеЭтапа, Истина);
	Списки.Вставить(Метаданные.Документы.упоИзменениеРуководителяПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоИзменениеРуководителяПроектнойЗадачи, Истина);
	Списки.Вставить(Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроект, Истина);
	Списки.Вставить(Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу, Истина);
	Списки.Вставить(Метаданные.Документы.упоОстановкаПроектныхРабот, Истина);
	Списки.Вставить(Метаданные.Документы.упоПроектнаяЗадача, Истина);
	Списки.Вставить(Метаданные.Документы.упоРасчетКалендарногоПланаПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоРегистрацияПоказателейПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоРегистрацияПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоРегистрацияФактическиВыполненногоОбъема, Истина);
	Списки.Вставить(Метаданные.Документы.упоРегистрацияФактическихДвиженийДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.упоРегистрацияФактическихДопЗатрат, Истина);
	Списки.Вставить(Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов, Истина);
	Списки.Вставить(Метаданные.Документы.упоРегистрацияФактическихЗатратМатРесурсов, Истина);
	Списки.Вставить(Метаданные.Документы.упоРучнаяАктуализацияПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоСохранениеДанныхПроекта, Истина);
	Списки.Вставить(Метаданные.Документы.упоСтартПроектныхРабот, Истина); 
	Списки.Вставить(Метаданные.Документы.упоУтверждениеПланаПроекта, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.упоВыполнениеПроекта, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.упоДокументыРасчетаПроекта, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.упоПланированиеПроекта, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.упоУправлениеПроектом, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыВыполненияОбъемов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыДвиженийДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыДополнительныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыДоходовИРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыДоходовИРасходовПодразделения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыЗатратМатериальныхРесурсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыТрудозатратПоДнямВерсии, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыТрудозатратСводноВерсии, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоВерсииПроекта, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоВыделенныеТрудовыеРесурсы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановВыпускаСубпродуктов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановДвиженияДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановДополнительныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановДополнительныхЗатратПодразделения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановДоходовИРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановДоходовИРасходовПодразделения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановОбъемовПодразделения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановПотребностейМатериальныхРесурсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПлановТрудозатратРолей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеРаспределенияДоходовПоПериодам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеРаспределенияРасходовПоПериодам, Истина);
	
	Списки.Вставить(Метаданные.РегистрыСведений.упоСвойстваПроектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоЗначенияИндикаторов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоИспользованиеРабочегоВремени, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоИсторияИмпортаПроектовИзMSP, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоКалендариПроектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоКодыСДР, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоНастройкаАналитикиВРазрезеПодразделений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоОперацииБиблиотекиШаблонов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоПредусловияПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоПроцентыГотовностиПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоПроцентыГотовностиПроектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоРасчетныеСрокиПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоРуководителиПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоРуководителиПроектныхЗадачАктуальные, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоРуководителиПроектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоСписокВыбораПроектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоСрокиПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоСтатусыПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоСтатусыПроектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактВыполненияОбъемовПоДням, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактДвиженийДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактДополнительныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактДоходовИРасходовПоДням, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактЗатратМатериальныхРесурсов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактТрудозатратПоДням, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.упоФактТрудозатратСводно, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.упоВыполненныеПринятыеОбъемы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.упоФактВыполненияОбъемовОбороты, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.упоФактДоходовИРасходовОбороты, Истина);
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Списки.Вставить(Метаданные.Справочники.упоРискиПроектов, Истина);
		Списки.Вставить(Метаданные.Справочники.упоФазыПроектов, Истина);
		
		Списки.Вставить(Метаданные.Документы.упоЗаявкаНаПроект, Истина);
		Списки.Вставить(Метаданные.Документы.упоПрогнозТрудозатратПоРолям, Истина);
		Списки.Вставить(Метаданные.Документы.упоРасчетЦеныКонтракта, Истина);
		Списки.Вставить(Метаданные.Документы.упоРегистрацияПоказателейЭффективностиПроекта, Истина);
		Списки.Вставить(Метаданные.Документы.упоСоответствиеСтратегическимЦелям, Истина);
		Списки.Вставить(Метаданные.Документы.упоСтатусОтчетПоПроекту, Истина);
		Списки.Вставить(Метаданные.Документы.упоФормированиеБизнесПлана, Истина);
		
		Списки.Вставить(Метаданные.РегистрыСведений.упоИтоговыйБаллПроектов, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоПрогнозныеСрокиПроектныхЗадач, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоПрогнозныеСрокиПроектов, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоСвойстваРисковПроектовПлан, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоСвойстваРисковПроектовФакт, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоСоответствиеСтратегическимЦелям, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоСтатусыРисковПроектов, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоСтатусыЗаявокНаПроект, Истина);
		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Списки.Вставить(Метаданные.Справочники.упоПроектнаяПродукция, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоДанныеПроектнойПродукции, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоОчередьРасчетаСтатусовПроектнойПродукции, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.упоСтатусыПроектнойПродукции, Истина);
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		Списки.Вставить(Метаданные.Документы.упоСогласованиеТрудозатрат, Истина);
		Списки.Вставить(Метаданные.РегистрыНакопления.упоСогласованныеТрудозатраты, Истина);
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалВерсионированиеДопРеквизитов() Тогда
		Списки.Вставить(Метаданные.РегистрыСведений.упоДополнительныеРеквизитыВерсии, Истина);
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		Списки.Вставить(Метаданные.Документы.упоРаспределениеРасходовПоПроектамФакт, Истина);
	КонецЕсли;

КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа -
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//  ИдентификаторыСлужПрофилей - Соответствие - см. упоИнтеграция.ИдентификаторыСлужебныхПрофилей
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления,
	ИдентификаторыСлужПрофилей) Экспорт

	КонфигурацияПродукта = ПолучитьПризнакиКонфигурацийПродукта();
	
	ДополнитьПрофилиОбязательнымиРолямиРМа(ОписанияПрофилей, ИдентификаторыСлужПрофилей, КонфигурацияПродукта);
	
	ДобавитьПрофиль_упоАдминистраторПроектногоОфиса(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоИсполнительРаботБезФинансов(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоРуководительПроектногоОфиса(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоРуководительПроектовПодразделений(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоРуководительПроектовПодразделенийБезФинансов(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоФинансистПроектногоОфиса(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоОсобыеПраваНаОповещения(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоИспользованиеЗащищенногоФункционала(ОписанияПрофилей, КонфигурацияПродукта);
	ДобавитьПрофиль_упоВыборПроектныхЗадачКакПроекта(ОписанияПрофилей, КонфигурацияПродукта);

	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		ДобавитьПрофиль_упоРаботаСПроектамиДополнительный(ОписанияПрофилей, КонфигурацияПродукта);
	КонецЕсли;
		
КонецПроцедуры

// Возвращает соответствие идентификаторов служебных полей.
//  см.УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа,
//  	см. УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа
// 
// Возвращаемое значение:
//  Соответствие - Набор идентификаторов профилей
//  Ключ - Строка - идентификатор профиля
//  Значение - Булево - Истина
//
Функция ИдентификаторыСлужебныхПрофилей(ОписанияПрофилей) Экспорт
	
	Идентификаторы = Новый Соответствие;
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		Идентификаторы.Вставить(ОписаниеПрофиля.Идентификатор, Истина);
	КонецЦикла;
	
	Возврат Идентификаторы;
	
КонецФункции

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
//
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.Проекты.Чтение.упоПроекты
	|Справочник.Проекты.Изменение.упоПроекты
	|Справочник.упоРискиПроектов.Чтение.упоПроекты
	|Справочник.упоРискиПроектов.Изменение.упоПроекты
	|Справочник.упоФазыПроектов.Чтение.упоПроекты
	|Справочник.упоФазыПроектов.Изменение.упоПроекты
	|Документ.упоАктуализацияПроекта.Чтение.упоПроекты
	|Документ.упоАктуализацияПроекта.Изменение.упоПроекты
	|Документ.упоВерсияПланаПроекта.Чтение.упоПроекты
	|Документ.упоВерсияПланаПроекта.Изменение.упоПроекты
	|Документ.упоВозобновлениеПроекта.Чтение.упоПроекты
	|Документ.упоВозобновлениеПроекта.Изменение.упоПроекты
	|Документ.упоЗавершениеПроекта.Чтение.упоПроекты
	|Документ.упоЗавершениеПроекта.Изменение.упоПроекты
	|Документ.упоЗакрытиеЭтапа.Чтение.упоПроекты
	|Документ.упоЗакрытиеЭтапа.Изменение.упоПроекты
	|Документ.упоИзменениеРуководителяПроекта.Чтение.упоПроекты
	|Документ.упоИзменениеРуководителяПроекта.Изменение.упоПроекты
	|Документ.упоИзменениеРуководителяПроектнойЗадачи.Чтение.упоПроекты
	|Документ.упоИзменениеРуководителяПроектнойЗадачи.Изменение.упоПроекты
	|Документ.упоНазначениеТрудовыхРесурсовНаПроект.Чтение.упоПроекты
	|Документ.упоНазначениеТрудовыхРесурсовНаПроект.Изменение.упоПроекты
	|Документ.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу.Чтение.упоПроекты
	|Документ.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу.Изменение.упоПроекты
	|Документ.упоОстановкаПроектныхРабот.Чтение.упоПроекты
	|Документ.упоОстановкаПроектныхРабот.Изменение.упоПроекты
	|Документ.упоПроектнаяЗадача.Чтение.упоПроекты
	|Документ.упоПроектнаяЗадача.Изменение.упоПроекты
	|Документ.упоРасчетКалендарногоПланаПроекта.Чтение.упоПроекты
	|Документ.упоРасчетКалендарногоПланаПроекта.Изменение.упоПроекты
	|Документ.упоРегистрацияПоказателейПроекта.Чтение.упоПроекты
	|Документ.упоРегистрацияПоказателейПроекта.Изменение.упоПроекты
	|Документ.упоРегистрацияПроекта.Чтение.упоПроекты
	|Документ.упоРегистрацияПроекта.Изменение.упоПроекты
	|Документ.упоРегистрацияФактическиВыполненногоОбъема.Чтение.упоПроекты
	|Документ.упоРегистрацияФактическиВыполненногоОбъема.Изменение.упоПроекты
	|Документ.упоРегистрацияФактическихДвиженийДенежныхСредств.Чтение.упоПроекты
	|Документ.упоРегистрацияФактическихДвиженийДенежныхСредств.Изменение.упоПроекты
	|Документ.упоРегистрацияФактическихДопЗатрат.Чтение.упоПроекты
	|Документ.упоРегистрацияФактическихДопЗатрат.Изменение.упоПроекты
	|Документ.упоРегистрацияФактическихДоходовИРасходов.Чтение.упоПроекты
	|Документ.упоРегистрацияФактическихДоходовИРасходов.Изменение.упоПроекты
	|Документ.упоРегистрацияФактическихЗатратМатРесурсов.Чтение.упоПроекты
	|Документ.упоРегистрацияФактическихЗатратМатРесурсов.Изменение.упоПроекты
	|Документ.упоРучнаяАктуализацияПроекта.Чтение.упоПроекты
	|Документ.упоРучнаяАктуализацияПроекта.Изменение.упоПроекты
	|Документ.упоСохранениеДанныхПроекта.Чтение.упоПроекты
	|Документ.упоСохранениеДанныхПроекта.Изменение.упоПроекты
	|Документ.упоСтартПроектныхРабот.Чтение.упоПроекты
	|Документ.упоСтартПроектныхРабот.Изменение.упоПроекты
	|Документ.упоСтатусОтчетПоПроекту.Чтение.упоПроекты
	|Документ.упоСтатусОтчетПоПроекту.Изменение.упоПроекты
	|Документ.упоУтверждениеПланаПроекта.Чтение.упоПроекты
	|Документ.упоУтверждениеПланаПроекта.Изменение.упоПроекты
	|ЖурналДокументов.упоВыполнениеПроекта.Чтение.упоПроекты
	|ЖурналДокументов.упоДокументыРасчетаПроекта.Чтение.упоПроекты
	|ЖурналДокументов.упоПланированиеПроекта.Чтение.упоПроекты
	|ЖурналДокументов.упоУправлениеПроектом.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыДополнительныхЗатрат.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыДоходовИРасходов.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыЗатратМатериальныхРесурсов.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямВерсии.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыТрудозатратСводноВерсии.Чтение.упоПроекты
	|РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Чтение.упоПроекты
	|РегистрСведений.упоВерсииПроекта.Чтение.упоПроекты
	|РегистрСведений.упоВерсииПроекта.Изменение.упоПроекты
	|РегистрСведений.упоВыделенныеТрудовыеРесурсы.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановДвиженияДенежныхСредств.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановДополнительныхЗатрат.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановДополнительныхЗатратПодразделения.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановДоходовИРасходов.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановОбъемовПодразделения.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.Чтение.упоПроекты
	|РегистрСведений.упоДанныеПлановТрудозатратРолей.Чтение.упоПроекты
	|РегистрСведений.упоДанныеРаспределенияДоходовПоПериодам.Чтение.упоПроекты
	|РегистрСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Чтение.упоПроекты
	|РегистрСведений.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.Чтение.упоПроекты
	|РегистрСведений.упоДанныеРаспределенияРасходовПоПериодам.Чтение.упоПроекты
	|РегистрСведений.упоСвойстваПроектов.Чтение.упоПроекты
	|РегистрСведений.упоЗначенияИндикаторов.Чтение.упоПроекты
	|РегистрСведений.упоИспользованиеРабочегоВремени.Чтение.упоПроекты
	|РегистрСведений.упоИсторияИмпортаПроектовИзMSP.Чтение.упоПроекты
	|РегистрСведений.упоИсторияИмпортаПроектовИзMSP.Изменение.упоПроекты
	|РегистрСведений.упоКалендариПроектов.Чтение.упоПроекты
	|РегистрСведений.упоКодыСДР.Чтение.упоПроекты
	|РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений.Чтение.упоПроекты
	|РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений.Изменение.упоПроекты
	|РегистрСведений.упоОперацииБиблиотекиШаблонов.Чтение.упоПроекты
	|РегистрСведений.упоОперацииБиблиотекиШаблонов.Изменение.упоПроекты
	|РегистрСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач.Чтение.упоПроекты
	|РегистрСведений.упоПредусловияПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоПрогнозныеСрокиПроектов.Чтение.упоПроекты
	|РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоПроцентыГотовностиПроектов.Чтение.упоПроекты
	|РегистрСведений.упоРасчетныеСрокиПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоРуководителиПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоРуководителиПроектныхЗадачАктуальные.Чтение.упоПроекты
	|РегистрСведений.упоРуководителиПроектов.Чтение.упоПроекты
	|РегистрСведений.упоСвойстваПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоСвойстваРисковПроектовПлан.Чтение.упоПроекты
	|РегистрСведений.упоСвойстваРисковПроектовПлан.Изменение.упоПроекты
	|РегистрСведений.упоСвойстваРисковПроектовФакт.Чтение.упоПроекты
	|РегистрСведений.упоСвойстваРисковПроектовФакт.Изменение.упоПроекты
	|РегистрСведений.упоСписокВыбораПроектов.Чтение.упоПроекты
	|РегистрСведений.упоСписокВыбораПроектов.Изменение.упоПроекты
	|РегистрСведений.упоСрокиПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоСтатусыПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоСтатусыПроектов.Чтение.упоПроекты
	|РегистрСведений.упоСтатусыРисковПроектов.Чтение.упоПроекты
	|РегистрСведений.упоСтатусыРисковПроектов.Изменение.упоПроекты
	|РегистрСведений.упоФактВыполненияОбъемовПоДням.Чтение.упоПроекты
	|РегистрСведений.упоФактДвиженийДенежныхСредств.Чтение.упоПроекты
	|РегистрСведений.упоФактДополнительныхЗатрат.Чтение.упоПроекты
	|РегистрСведений.упоФактДоходовИРасходовПоДням.Чтение.упоПроекты
	|РегистрСведений.упоФактЗатратМатериальныхРесурсов.Чтение.упоПроекты
	|РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.Чтение.упоПроекты
	|РегистрСведений.упоФактТрудозатратПоДням.Чтение.упоПроекты
	|РегистрСведений.упоФактТрудозатратСводно.Чтение.упоПроекты
	|РегистрНакопления.упоВыполненныеПринятыеОбъемы.Чтение.упоПроекты
	|РегистрНакопления.упоФактВыполненияОбъемовОбороты.Чтение.упоПроекты
	|РегистрНакопления.упоФактДоходовИРасходовОбороты.Чтение.упоПроекты";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Описание = Описание + "
		|Документ.упоЗаявкаНаПроект.Чтение.упоПроекты
		|Документ.упоЗаявкаНаПроект.Изменение.упоПроекты
		|Документ.упоПрогнозТрудозатратПоРолям.Чтение.упоПроекты
		|Документ.упоПрогнозТрудозатратПоРолям.Изменение.упоПроекты
		|Документ.упоРасчетЦеныКонтракта.Чтение.упоПроекты
		|Документ.упоРасчетЦеныКонтракта.Изменение.упоПроекты
		|Документ.упоРегистрацияПоказателейЭффективностиПроекта.Чтение.упоПроекты
		|Документ.упоРегистрацияПоказателейЭффективностиПроекта.Изменение.упоПроекты
		|Документ.упоСоответствиеСтратегическимЦелям.Чтение.упоПроекты
		|Документ.упоСоответствиеСтратегическимЦелям.Изменение.упоПроекты
		|Документ.упоФормированиеБизнесПлана.Чтение.упоПроекты
		|Документ.упоФормированиеБизнесПлана.Изменение.упоПроекты
		|РегистрСведений.упоИтоговыйБаллПроектов.Чтение.упоПроекты
		|РегистрСведений.упоСоответствиеСтратегическимЦелям.Чтение.упоПроекты
		|РегистрСведений.упоСтатусыЗаявокНаПроект.Чтение.упоПроекты";
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Описание = Описание + "
		|Справочник.упоПроектнаяПродукция.Чтение.упоПроекты
		|Справочник.упоПроектнаяПродукция.Изменение.упоПроекты
		|РегистрСведений.упоДанныеПроектнойПродукции.Чтение.упоПроекты
		|РегистрСведений.упоДанныеПроектнойПродукции.Изменение.упоПроекты
		|РегистрСведений.упоОчередьРасчетаСтатусовПроектнойПродукции.Чтение.упоПроекты
		|РегистрСведений.упоОчередьРасчетаСтатусовПроектнойПродукции.Изменение.упоПроекты
		|РегистрСведений.упоСтатусыПроектнойПродукции.Чтение.упоПроекты
		|РегистрСведений.упоСтатусыПроектнойПродукции.Изменение.упоПроекты";
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		Описание = Описание + "
		|Документ.упоСогласованиеТрудозатрат.Чтение.упоПроекты
		|Документ.упоСогласованиеТрудозатрат.Изменение.упоПроекты
		|РегистрНакопления.упоСогласованныеТрудозатраты.Чтение.упоПроекты";
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалВерсионированиеДопРеквизитов() Тогда
		Описание = Описание + "
		|РегистрСведений.упоДополнительныеРеквизитыВерсии.Чтение.упоПроекты
		|РегистрСведений.упоДополнительныеРеквизитыВерсии.Изменение.упоПроекты";
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		Описание = Описание + "
		|Документ.упоРаспределениеРасходовПоПроектамФакт.Чтение.упоПроекты
		|Документ.упоРаспределениеРасходовПоПроектамФакт.Изменение.упоПроекты";
	КонецЕсли;
	
КонецПроцедуры

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	 
	СписокОбъектов.Добавить(Документы.упоРасчетЦеныКонтракта);
	СписокОбъектов.Добавить(Документы.упоРегистрацияФактическиВыполненногоОбъема);
	СписокОбъектов.Добавить(Документы.упоРегистрацияФактическихДоходовИРасходов);
	СписокОбъектов.Добавить(Документы.упоРегистрацияФактическихЗатратМатРесурсов);
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		СписокОбъектов.Добавить(Документы.упоСтатусОтчетПоПроекту);
		СписокОбъектов.Добавить(Документы.упоСводныйСтатусОтчетПоПроектам);
		
	КонецЕсли; 
	
КонецПроцедуры

// См. ЗагрузкаДанныхИзФайлаПереопределяемый.ПриОпределенииСправочниковДляЗагрузкиДанных()
//
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт
	
	МетаданныеСправочники = Метаданные.Справочники;
	
	//
	
	ДобавляемыеСправочники = Новый Массив;
	ДобавляемыеСправочники.Добавить("упоТрудовыеРесурсы");
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ДобавляемыеСправочники.Добавить("упоПроектнаяПродукция");
	КонецЕсли;
	
	Для Каждого ИмяОбъекта Из ДобавляемыеСправочники Цикл
		ОбъектМетаданныхДляВывода = МетаданныеСправочники[ИмяОбъекта];
		
		Строка = ЗагружаемыеСправочники.Добавить();
		Строка.Представление = ОбъектМетаданныхДляВывода.Представление();
		Строка.ПолноеИмя = ОбъектМетаданныхДляВывода.ПолноеИмя();
	КонецЦикла;
	
	//
	
	УдаляемыеСправочники = Новый Массив;
	УдаляемыеСправочники.Добавить("упоИзбранныеДействия");
	УдаляемыеСправочники.Добавить("упоКлючиАналитикиФактаБДР");
	УдаляемыеСправочники.Добавить("упоКонфигурацияПродуктаPM"); 
	
	Для Каждого ИмяОбъекта Из УдаляемыеСправочники Цикл
		ОбъектМетаданныхДляВывода = МетаданныеСправочники[ИмяОбъекта];
		ПолноеИмя = ОбъектМетаданныхДляВывода.ПолноеИмя();
		
		НайденныйЭлемент = ЗагружаемыеСправочники.Найти(ПолноеИмя, "ПолноеИмя");
		Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
			ЗагружаемыеСправочники.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам()
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеВнешнейКомпоненты(
		"ОбщийМакет.слкКомпонентаЗащиты", НСтр("ru = 'Компонента защиты СЛК.'")));
	ЗапросыРазрешений.Добавить(
		МодульРаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(Разрешения));
	
КонецПроцедуры

// См. ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов
//
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		Объекты.Добавить(Метаданные.Документы.упоРаспределениеРасходовПоПроектамФакт);       
	КонецЕсли;
	
КонецПроцедуры

#Область УправлениеСвойствами

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств()
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалФазыПроекта() Тогда
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьФазыПроектов");
		ДобавитьИспользованиеПреопределенногоНабораСвойств(Наборы, "Справочник_упоФазыПроектов", Использование);
	КонецЕсли;
	
	//  
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРасчетЦеныКонтракта() Тогда
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьРасчетЦеныКонтракта");
		ДобавитьИспользованиеПреопределенногоНабораСвойств(Наборы, "Документ_упоРасчетЦеныКонтракта", Использование);
	КонецЕсли;
	
	//
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьРасчетЦеныКонтракта");
		ДобавитьИспользованиеПреопределенногоНабораСвойств(Наборы, "Документ_упоСогласованиеТрудозатрат", Использование);
	КонецЕсли;
	
	//       
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалЗаявкиНаПроекты() Тогда
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьЗаявкиНаПроекты");
		ИменаНаборов = Новый Массив;
		ИменаНаборов.Добавить("Документ_упоЗаявкаНаПроект");
		ИменаНаборов.Добавить("Документ_упоРасчетИтоговогоБаллаПроектов");
		ИменаНаборов.Добавить("Документ_упоРегистрацияПоказателейЭффективностиПроекта");
		ИменаНаборов.Добавить("Документ_упоСоответствиеСтратегическимЦелям");
		ИменаНаборов.Добавить("Документ_упоФормированиеБизнесПлана");
		ДобавитьИспользованиеПреопределенныхНаборовСвойств(Наборы, ИменаНаборов, Использование);
	КонецЕсли;
	
	//           
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалОтражениеПервичныхДокументовВПроектномБюджетировании() Тогда	
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
		ИменаНаборов = Новый Массив;
		ИменаНаборов.Добавить("Документ_упоОтражениеФактаВПроектномБюджетировании");
		ИменаНаборов.Добавить("Справочник_упоПравилаПолученияФактаДляПроектногоБюджетирования");
		ДобавитьИспользованиеПреопределенныхНаборовСвойств(Наборы, ИменаНаборов, Использование);
	КонецЕсли;
	
	//
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда 
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьПроектнуюПродукцию");
		ИменаНаборов = Новый Массив;
		ИменаНаборов.Добавить("Справочник_упоТипыПроектнойПродукции");
		ИменаНаборов.Добавить("Справочник_упоПроектнаяПродукция");
		ДобавитьИспользованиеПреопределенныхНаборовСвойств(Наборы, ИменаНаборов, Использование);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияРеквизитов

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами()
//
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.Проекты.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	Объекты.Вставить(Метаданные.Справочники.упоЗадания.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	Объекты.Вставить(Метаданные.Справочники.упоСхемыОплаты.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	Объекты.Вставить(Метаданные.Справочники.упоПроектнаяПродукция.ПолноеИмя(), "ПолучитьБлокируемыеРеквизитыОбъекта");
	
КонецПроцедуры

#КонецОбласти

// Определяет доступность системы лицензирования
//
Функция ДоступнаСистемаЛицензирования() Экспорт
	
	ИменаРолей = Новый Массив;
	
	// Роли по умолчанию 
	ИменаРолей.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	ИменаРолей.Добавить("ПолныеПрава");
	
	упоИнтеграцияПереопределяемый.ПриПроверкеДоступностиСистемыЛицензирования(ИменаРолей);
	
	ВсеРолиНедоступны = Истина;
	Для Каждого ИмяРоли Из ИменаРолей Цикл		
		Если РольДоступна(ИмяРоли) Тогда
			ВсеРолиНедоступны = Ложь;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Не ВсеРолиНедоступны;
	
КонецФункции

// Проверяет, является ли хотя бы один тип из переданного массива, интегрируемым с Документооборотом.
//
// Параметры:
//  МассивТипов	 - Массив
// 
// Возвращаемое значение:
//  Булево
//
Функция ТипИнтегрированСДокументооборотом(МассивТипов) Экспорт 
	
	ТипИнтегрирован = Ложь;
	
	ИнтегрированныеТипы = Метаданные.ОпределяемыеТипы.ИнтеграцияС1СДокументооборотВсеСсылкиПереопределяемый.Тип;
	
	Для Каждого ТипИсточника Из МассивТипов Цикл
		
		Если ИнтегрированныеТипы.СодержитТип(ТипИсточника) Тогда
			ТипИнтегрирован = Истина;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат ТипИнтегрирован;
	
КонецФункции

// Возвращает представление переданного объекта.
//
// Параметры:
//	ПараметрОбъект - Строка или ОбъектМетаданных - объект для получения представления
//
// Возвращаемое значение:
//	Строка - представление объекта
//
Функция ПредставлениеОбъекта(ПараметрОбъект) Экспорт
	
	Если ПараметрОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	МетаданныеОбъекта = ?(ТипЗнч(ПараметрОбъект) = Тип("Строка"), Метаданные.НайтиПоПолномуИмени(ПараметрОбъект), ПараметрОбъект);
	
	Представление = Новый Структура("ПредставлениеОбъекта");
	ЗаполнитьЗначенияСвойств(Представление, МетаданныеОбъекта);
	Если Не ПустаяСтрока(Представление.ПредставлениеОбъекта) Тогда
		Возврат Представление.ПредставлениеОбъекта;
	КонецЕсли;
	
	Возврат МетаданныеОбъекта.Представление();
	
КонецФункции

// Выполняет регистрацию изменений для всех объектов с правилами регистрации.
//
// Параметры:
//  УзелПланаОбмена	 - ПланОбменаСсылка	 - узел плана обмена.
//
Процедура ЗарегистрироватьИзмененияДляВсехОбъектовСПравиламиРегистрации(Знач УзелПланаОбмена) Экспорт
	
	ПравилаРегистрации = ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов(УзелПланаОбмена);
	Для Каждого ТекПравило Из ПравилаРегистрации Цикл
		ТекМетаданные = Метаданные.НайтиПоПолномуИмени(ТекПравило.ОбъектМетаданныхИмя);
		Если Не ТекМетаданные = Неопределено Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзелПланаОбмена, ТекМетаданные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. ПодключаемыеКоманды.ПриСозданииНаСервере
//
Процедура ПодключаемыеКомандыПриСозданииНаСервере(Форма, ПараметрыРазмещения) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУХ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУХ");
		МодульИнтеграции.ПодключаемыеКомандыПриСозданииНаСервере(Форма, ПараметрыРазмещения);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУПФСервер");
		МодульИнтеграции.ПодключаемыеКомандыПриСозданииНаСервере(Форма, ПараметрыРазмещения);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает добавление команды открытия проекта формой интегрируемой конфигурации (ERP, УНФ).
//
// Параметры:
//  Форма	 - УправляемаяФорма
//
Процедура ДобавитьКомандуОткрытияЗамененнойФормыПроекта(Форма) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		ДобавитьКомандуОткрытияФормыПроекта(Форма, "Подключаемый_ОткрытьЗамененнуюФормуПроекта",
			НСтр("ru = 'Открыть форму проекта ERP'"));
		
	ИначеЕсли упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		
		ДобавитьКомандуОткрытияФормыПроекта(Форма, "Подключаемый_ОткрытьЗамененнуюФормуПроекта",
			НСтр("ru = 'Открыть форму проекта УНФ'"));
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду открытия формы интегрируемой конфигурации (ERP, УНФ).
//
// Параметры:
//  Форма		 - УправляемаяФорма
//  ИмяКоманды	 - Строка
//  Заголовок	 - Строка
//
Процедура ДобавитьКомандуОткрытияФормыПроекта(Форма, ИмяКоманды, Заголовок) Экспорт
	
	КомандаОткрытьФорму			 = Форма.Команды.Добавить(ИмяКоманды);
	КомандаОткрытьФорму.Действие = ИмяКоманды;
	
	ЭлементОткрытьФорму = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	ЭлементОткрытьФорму.ИмяКоманды 			 = ИмяКоманды;
	ЭлементОткрытьФорму.Заголовок  			 = Заголовок;
	ЭлементОткрытьФорму.ТолькоВоВсехДействиях = Истина;
	
КонецПроцедуры

#Область ПользовательскиеНастройки

// См. ПользователиПереопределяемый.ПриУстановкеНачальныхНастроек
//
Процедура ПриУстановкеНачальныхНастроек(НачальныеНастройки) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУПФСервер");
		МодульИнтеграции.ПриУстановкеНачальныхНастроек(НачальныеНастройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияФорм

// Переопределяемый обработчик события формы "При создании".
//
// Параметры:
//  Форма				 - УправляемаяФорма
//  Отказ				 - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ПриСозданииНаСервере_ИнтегрированнаяКонфигурация(Форма, Отказ, СтандартнаяОбработка);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияEPM") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияEPMСервер");
		МодульИнтеграции.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУПФСервер");
		МодульИнтеграции.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУХ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУХ");
		МодульИнтеграции.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзменения

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = ИмяРазделТрудозатратыФакт();
	Раздел.Идентификатор = Новый УникальныйИдентификатор("136f3b89-154a-11ec-b3e8-000c29a9c311");
	Раздел.Представление = НСтр("ru = 'PM: Факт трудозатрат'");
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = ИмяРазделОбъемыФакт();
	Раздел.Идентификатор = Новый УникальныйИдентификатор("136f3b8a-154a-11ec-b3e8-000c29a9c311");
	Раздел.Представление = НСтр("ru = 'PM: Факт затрат ресурсов и выполнения объемов'");
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = ИмяРазделБДРФакт();
	Раздел.Идентификатор = Новый УникальныйИдентификатор("b9736ea8-1556-11ec-b3e8-000c29a9c311");
	Раздел.Представление = НСтр("ru = 'PM: Факт доходов и расходов'");
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = ИмяРазделДДСФакт();
	Раздел.Идентификатор = Новый УникальныйИдентификатор("b9736ea9-1556-11ec-b3e8-000c29a9c311");
	Раздел.Представление = НСтр("ru = 'PM: Факт движения денежных средств'");
	
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ЗаполнитьИсточникиДанныхДляРазделаОбъемыФакт(ИсточникиДанных);
	ЗаполнитьИсточникиДанныхДляРазделаБДРФакт(ИсточникиДанных);
	ЗаполнитьИсточникиДанныхДляРазделаДДСФакт(ИсточникиДанных);
    ЗаполнитьИсточникиДанныхДляРазделаТрудозатратыФакт(ИсточникиДанных);
			
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойЗапретаИзменения
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.упоРаспределениеРабочегоВремениЗаНеделю") Тогда
		Если Объект.ДополнительныеСвойства.Свойство("РежимЗаписи") И 
			Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			УзелПроверкиЗапретаЗагрузки = Неопределено;
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			МесяцНачала = Месяц(Объект.ДеньНачалаНедели);
			МесяцКонец = Месяц(Объект.ДеньКонецНедели);
			
			Если Не Константы.упоРегистрироватьТрудозатратыПереходящейНеделиДвумяДокументами.Получить() Или
				МесяцНачала = МесяцКонец Тогда
				Возврат;
			КонецЕсли;
			
			ТаблицаДней = Объект.ПолучитьТаблицуДней();
			
			Объект.РассчитатьТрудозатратыНаКаждыйДень(ТаблицаДней);
			
			РезультатСравненияПериодов = Объект.ПроверитьНаличиеДанныхВДвухПериодах(ТаблицаДней, МесяцКонец, МесяцНачала);
			
			Если РезультатСравненияПериодов.ТрудозатратыКонечногоПериода > 0 Тогда
				
				ИмяРаздела = ИмяРазделТрудозатратыФакт();
				ЗапретНайден = ЕстьЗапретПоРазделуНаДату(ИмяРаздела, Объект.ДеньКонецНедели);
				
				Если Не ЗапретНайден Тогда
					ПроверкаЗапретаИзменения = Ложь;
					УзелПроверкиЗапретаЗагрузки = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Отключает контроль запрета изменения по объектам для данных PM.
//
// Параметры:
//  Данные              - СправочникОбъект
//                      - ДокументОбъект
//                      - ПланВидовХарактеристикОбъект
//                      - ПланСчетовОбъект
//                      - ПланВидовРасчетаОбъект
//                      - БизнесПроцессОбъект
//                      - ЗадачаОбъект
//                      - ПланОбменаОбъект
//                      - РегистрСведенийНаборЗаписей
//                      - РегистрНакопленияНаборЗаписей
//                      - РегистрБухгалтерииНаборЗаписей
//                      - РегистрРасчетаНаборЗаписей - проверяемый элемент данных или набор записей.
//                      - Строка - полное имя объекта метаданных, данные которого следует проверить в базе данных.
//                                 Например: "Документ.ПриходнаяНакладная".
//                                 В этом случае следует указать в параметре ИдентификаторДанных,
//                                 какие именно данные требуется прочитать из базы и проверить.
//  БезОбъекта	 - Булево - признак контроля по объектам.
//
Процедура УстановитьРежимБезОбъектаДляДанныхPM(Данные, БезОбъекта) Экспорт

	Если БезОбъекта Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыPM = упоИнтеграцияПовтИсп.ОбъектыСКонтролемДатыЗапретаИзменения();
	
	Если ОбъектыPM[ТипЗнч(Данные)] = Истина Тогда
		БезОбъекта = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

 #Область ИспользованиеФункционала

// Проверяет использование внешнего модуля "Согласование часов". 
// Модуль считается используемым, если есть проведенные документы "Согласование часов".
// 
// Возвращаемое значение:
//  Булево - признак использования модуля.
//
Функция ИспользуетсяМодульСогласованиеЧасов() Экспорт
	
	ПодсистемаСуществует = ОбщегоНазначения.ПодсистемаСуществует("упоСогласованиеЧасов");
	Если Не ПодсистемаСуществует Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РегистрДвижений.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.упоСогласованныеТрудозатраты.Обороты(, , Регистратор, ) КАК РегистрДвижений";
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЕстьПроведенныеДокументы = Не Результат.Пустой();
	
	Возврат ЕстьПроведенныеДокументы;
	
КонецФункции

// Выполняет действия согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак использования.
//
Функция ИспользуетсяМноговалютныйУчет() Экспорт 
	
	МноговалютныйУчет = Ложь;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		МноговалютныйУчет = 
			упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	КонецЕсли;
	
	Возврат МноговалютныйУчет;
	
КонецФункции

#КонецОбласти

// Создает без записи новый элемент справочника и устанавливает ему идентификатор переданного элемента, или получает существующий, если такая ссылка существует.
//  Основное назначение - синхронизация НСИ в интегрированных конфигурациях.
//
// Параметры:
//  МенеджерТипаДанныхНовый	 - СправочникМенеджер, ПланВидовХарактеристикМенеджер	 - менеджер , элемент которого создается.
//  ЭлементИсходный			 - СправочникСсылка, ПланВидовХарактеристикСсылка		 - исходный элемент, идентификатор которого копируется.
//  ЭтоГруппа				 - Булево												 - признак группы.
//  СсылкаНового			 - Неопределено, СправочникСсылка, ПланВидовХарактеристикСсылка	 - возвращаемый параметр ссылки на новый элемент до записи.
// 
// Возвращаемое значение:
//  СправочникОбъект, ПланВидовХарактеристикОбъект - созданный элемент менеджера.
//
Функция НовыйОбъектСИдентификаторомИсходного(МенеджерТипаДанныхНовый, 
	ЭлементИсходный, 
	ЭтоГруппа = Ложь, 
	СсылкаНового = Неопределено) Экспорт

	УИД = ЭлементИсходный.УникальныйИдентификатор();
	СсылкаНового = МенеджерТипаДанныхНовый.ПолучитьСсылку(УИД);
	
	Если ОбщегоНазначения.СсылкаСуществует(СсылкаНового) Тогда
		Возврат СсылкаНового.ПолучитьОбъект();
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		НовыйОбъект = МенеджерТипаДанныхНовый.СоздатьГруппу();
	Иначе
		НовыйОбъект = МенеджерТипаДанныхНовый.СоздатьЭлемент();
	КонецЕсли;
	
	Возврат НовыйОбъект;

КонецФункции

// Заполняет настройки учета по умолчанию для направления деятельности, которое создается для связи
// с проектной задачей.
//
// Параметры:
//	НаправлениеДеятельностиОбъект - СправочникОбъект.НаправленияДеятельности - объект для заполнения.
//  НастройкиЗаполненияНД - см. упоСвязьПроектаСНаправлениемДеятельности.ПолучитьНастройкиЗаполненияСвязанногоНД
//
//
Процедура ЗаполнитьНастройкиУчетаДДСвНаправленииДеятельностиПоУмолчанию(НаправлениеДеятельностиОбъект,
		НастройкиЗаполненияНД) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Если НастройкиЗаполненияНД.УчетДенежныхСредств Тогда
			Возврат;
		КонецЕсли;
		НаправлениеДеятельностиОбъект.УчетДенежныхСредствРаздельно = Ложь;
		НаправлениеДеятельностиОбъект.УчетДенежныхСредствПоКорреспонденции = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПодписок

// Обработчик события, вызываемый при записи ставки НДС.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево - признак отказа от выполнения обработки.
//
Процедура СтавкаНДСПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ИспользуетсяСинхронизацияСтавокНДС() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУПФСервер");
		МодульИнтеграции.СтавкаНДСПриЗаписи(Источник, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПользователиПередЗаписью(Источник, Отказ) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУПФСервер");
		МодульИнтеграции.упоПользователиПередЗаписью(Источник, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый при записи статей доходов и расходов ERP.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево 		- признак отказа от выполнения обработки.
Процедура ПриЗаписиПодразделенияИлиСтруктурыПредприятия(Источник, Отказ) Экспорт
	
	Если (Источник.ДополнительныеСвойства.Свойство("ВыполняетсяОбработчикЗаполнения")
		И Источник.ДополнительныеСвойства.ВыполняетсяОбработчикЗаполнения)
		Или Источник.ОбменДанными.Загрузка Тогда
		
		Возврат;
		
    КонецЕсли;
    
    // Только для ERP+PM.
    // При изменении на закладке "Настройки РМ" формы элемента спр.упоПодразделение не требуется синхронизация.
    // В случае записи на закладке "Настройки РМ", а затем перехода на основную закладку пользователю 
    // будет выдано сообщение, что данные были обновлены.
    Если Источник.ДополнительныеСвойства.Свойство("НеСинхронизироватьСоСтруктураПроекта")
		И Источник.ДополнительныеСвойства.НеСинхронизироватьСоСтруктураПроекта Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВыполняетсяОбработчикЗаполнения = Истина;
	СинхронизироватьПодразделениеИСтруктуруПредприятия(Источник.Ссылка, ВыполняетсяОбработчикЗаполнения);
	
КонецПроцедуры

// Обработчик события, вызываемый при записи статей доходов и расходов.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево - признак отказа от выполнения обработки.
Процедура ПриЗаписиСтатейДР(Источник, Отказ) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.НеобходимаСинхронизацияСтатейДР() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.ДополнительныеСвойства.Свойство("НеСинхронизироватьСтатьиДР")
		И Источник.ДополнительныеСвойства.НеСинхронизироватьСтатьиДР Тогда 
		Возврат;
	КонецЕсли;
	
	СинхронизироватьСтатьиДР(Источник.Ссылка);
	
КонецПроцедуры

Процедура ПользователиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Пользователь", Источник.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГруппыДоступа.Ссылка КАК ГруппаДоступа
		               |ИЗ
		               |	Справочник.ГруппыДоступа КАК ГруппыДоступа
		               |ГДЕ
		               |	ГруппыДоступа.Пользователь = &Пользователь
		               |	И НЕ ГруппыДоступа.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			 Объект = Выборка.ГруппаДоступа.ПолучитьОбъект();
			 Объект.УстановитьПометкуУдаления(Истина);
			
		 КонецЦикла;
		 
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый при записи сценариев.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево 		- признак отказа от выполнения обработки.
Процедура ПриЗаписиСценариев(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ВыполняетсяОбработчикЗаполнения")
		И Источник.ДополнительныеСвойства.ВыполняетсяОбработчикЗаполнения Тогда
		
		Возврат;
		
    КонецЕсли;
    	
	ВыполняетсяОбработчикЗаполнения = Истина;
	СинхронизироватьСценарии(Источник.Ссылка, ВыполняетсяОбработчикЗаполнения);
	
КонецПроцедуры

// Обработчик события, вызываемый перед записью валют, пользователей и групп пользователей.
// Заполнение служебных реквизитов необходимо для перехода на РМ5.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево 		- признак отказа от выполнения обработки.
//
Процедура ЗаполнитьСлужебныеРеквизиты(Источник, Отказ) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Валюты") Тогда
		
		Источник.НеИспользоватьЗагружаетсяИзИнтернета = Источник.ЗагружаетсяИзИнтернета;
		Источник.НеИспользоватьНаименованиеПолное = Источник.НаименованиеПолное;
		Источник.НеИспользоватьНаценка = Источник.Наценка;
		Источник.НеИспользоватьОсновнаяВалюта = Источник.ОсновнаяВалюта;
		Источник.НеИспользоватьПараметрыПрописи = Источник.ПараметрыПрописи;
		Источник.НеИспользоватьФормулаРасчетаКурса = Источник.ФормулаРасчетаКурса;
		Источник.НеИспользоватьСпособУстановкиКурса = Источник.СпособУстановкиКурса;
		НеИспользоватьПредставления = Источник.Представления.Выгрузить();
		Источник.НеИспользоватьПредставления.Загрузить(НеИспользоватьПредставления);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ГруппыПользователей") Тогда
		
		Источник.НеИспользоватьКомментарий = Источник.Комментарий;
		НеИспользоватьСостав = Источник.Состав.Выгрузить();	
		Источник.НеИспользоватьСостав.Загрузить(НеИспользоватьСостав);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи") Тогда
		
		Источник.НеИспользоватьНедействителен = Источник.Недействителен;
		Источник.НеИспользоватьПодразделение = Источник.Подразделение;
		Источник.НеИспользоватьФизическоеЛицо = Источник.ФизическоеЛицо;
		Источник.НеИспользоватьКомментарий = Источник.Комментарий;
		Источник.НеИспользоватьСлужебный = Источник.Служебный;
		Источник.НеИспользоватьПодготовлен = Источник.Подготовлен;
		Источник.НеИспользоватьИдентификаторПользователяИБ = Источник.ИдентификаторПользователяИБ;
		Источник.НеИспользоватьИдентификаторПользователяСервиса = Источник.ИдентификаторПользователяСервиса;
		Источник.НеИспользоватьУдалитьСвойстваПользователяИБ = Источник.УдалитьСвойстваПользователяИБ;
		Источник.НеИспользоватьФотография = Источник.Фотография;
		НеИспользоватьДополнительныеРеквизиты = Источник.ДополнительныеРеквизиты.Выгрузить();
		Источник.НеИспользоватьДополнительныеРеквизиты.Загрузить(НеИспользоватьДополнительныеРеквизиты);
		НеИспользоватьКонтактнаяИнформация = Источник.КонтактнаяИнформация.Выгрузить();
		Источник.НеИспользоватьКонтактнаяИнформация.Загрузить(НеИспользоватьКонтактнаяИнформация);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеДоступом

// Обработчик обновления, заполняет поставляемые группы доступа.
//
Процедура ЗаполнитьПоставляемыеГруппыДоступа(Параметр = Неопределено) Экспорт
	
	СтруктураГруппИПрофилей = ПолучитьСтруктуруТиповыхГруппИПрофилей();
	
	Для Каждого КлючЗначение Из СтруктураГруппИПрофилей Цикл
		Профиль = Справочники.ГруппыДоступа[КлючЗначение.Ключ].Профиль;
		Если Не ЗначениеЗаполнено(Профиль) Или Профиль.ПометкаУдаления Тогда
			Объект = Справочники.ГруппыДоступа[КлючЗначение.Ключ].ПолучитьОбъект();
			Объект.Профиль = Справочники.ПрофилиГруппДоступа[КлючЗначение.Значение];
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьПрофилиОбязательнымиРолямиРМа(ОписанияПрофилей, ИдентификаторыСлужПрофилей, КонфигурацияПродукта)
	
	ДобавитьОграничениеПоВидуДоступа = Истина;		
	Если КонфигурацияПродукта.ЭтоPM_Проф И Не КонфигурацияПродукта.ЭтоУПФ Тогда			
		ДобавитьОграничениеПоВидуДоступа = Ложь;
	КонецЕсли;
		
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Если ИдентификаторыСлужПрофилей[ОписаниеПрофиля.Идентификатор] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОписаниеПрофиля.Свойство("Назначение") И ЗначениеЗаполнено(ОписаниеПрофиля.Назначение) Тогда
			Продолжить;
		КонецЕсли;
		
		// Роли
		Если ОписаниеПрофиля.Свойство("Роли") Тогда
			ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваEPM");
			ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваPM");
			Если КонфигурацияПродукта.ЭтоУПФ Тогда
				ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваУПФ");
			КонецЕсли;
		КонецЕсли;
		
		// Виды доступа
		Если ОписаниеПрофиля.Свойство("ВидыДоступа") Тогда
			Если ДобавитьОграничениеПоВидуДоступа Тогда
				ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеЗапрещены");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоАдминистраторПроектногоОфиса(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Администратор проектного офиса".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоАдминистраторПроектногоОфиса";
	ОписаниеПрофиля.Идентификатор = "d2fd05dd-d39d-11e4-827f-14dae96a654e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администратор НСИ проектного офиса'");
	ОписаниеПрофиля.Описание = 	
		НСтр("ru = 'Назначается пользователю, если ему необходимо выполнять административные функции в рамках '") 
		+ НСтр("ru = 'проектного контура (ввод нормативно-справочной информации).'");
		
	// Роли
	
	ОписаниеПрофиля.Роли.Добавить("Администрирование");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений"); 
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЗапускAutomation");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВнешнегоСоединения");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеУчастниковГруппДоступа");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("слкУправлениеМенеджеромЛицензийСЛК");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваEPM");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваPM");
	ОписаниеПрофиля.Роли.Добавить("упоБезопасноеИспользованиеИзбранныхДействий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсииПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВидовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВидовОпераций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВнепроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДиспетчеров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДокументовОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияДолжностиСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияПозицииСДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИсточниковФинансирования");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКлассификатораИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияДеятельности");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекДереваКлючевыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекМонитораПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастройкиРаспределенияБДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПВХДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПланированияТрудозатратПоТрудовымРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделенийОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПортфелейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилЗаполненияПараметров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинПотерьРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрограммПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейГруппДоступа");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейНастроекПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРабочихКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРабочегоВремениЗаНеделю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииМощностиРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРуководителяПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейОбъектовСистемыИФайлов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСложностиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобственныхСилСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобытийКалендаря"); 
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСообщенийПользователю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДоходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСценариев");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСхемОплаты");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТабеляРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТиповПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТрудовыхРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеОценокИсполнителейПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("упоДоступКоВсемКомпетенциям");
	ОписаниеПрофиля.Роли.Добавить("упоДоступностьФинансовойИнформацииРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	ОписаниеПрофиля.Роли.Добавить("упоНастройкаИзбранныхДействий");
	ОписаниеПрофиля.Роли.Добавить("упоНастройкаПараметровPM");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыборПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыгрузкаЗагрузкаПроектныхДанных");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыгрузкаПоказателейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаГеографияПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаДеревоКлючевыхПоказателейПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаИзменениеТекущегоСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаМоделированиеЭффективностиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаМониторПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаНастройкаУчетаВРазрезеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельСтатусовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПланировщик");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПоискПроблемныхОбъектовИБ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПоискСсылок");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПроверкаСтруктурыПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаРаспределениеБДР");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаРегистрацияСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСверткаРегистровПроцентыСтатусы");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеЗагрузкой");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУпрощенныйВводСтруктурыПроектаПросмотр");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУпрощенныйВводСтруктурыПроектаРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаХозяйственныеОперацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетИспользованиеРабочегоВремениСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетМощностьРолейПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРабочиеКалендариСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСетевойГрафик");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтруктураТрудовыхРесурсовСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЮридическаяСтруктураПредприятияСКД");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСЗаданиямиБазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСПользователямиРолями");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСРискамиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("упоРазделДокументы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаказыИКонтрактация");
	ОписаниеПрофиля.Роли.Добавить("упоРазделМатериальныеИДопЗатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделНормированиеИПроектныеРешения");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОбъемыИВыполнениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОтражениеФактаВПроектномБюджетировании");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОценкаПроектаРасчетЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПортфелиИПрограммы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПредприятиеИРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроектыИФазы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделРискиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделТрудозатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделУправлениеДоговорами");
	ОписаниеПрофиля.Роли.Добавить("упоРазделФинансыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЧасыРаботыИЗадания");
	ОписаниеПрофиля.Роли.Добавить("упоИнструментыИсправленияИОчисткиБазы");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВладенияРесурсами");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВозобновленияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыделенныхТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненныхПринятыхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияДоходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияРасходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовРасчетаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремениРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКалендарейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКодовСДР");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалютДляРасчетовСПерсоналом");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеМощностиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекАналитикиВРазрезеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекЗащитыКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимости");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимостиРесурсовРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОперацийБиблиотекиШаблонов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизационнойСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОстановкиПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОценокИсполнителейПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаВыполненияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаПоставкиМатРесурсовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланированияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановВыпускаСубпродуктовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановОбъемовПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПредусловийПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрогнозныеСроки");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовГотовности");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРазвернутыхСтрокПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРесурсовПоСтатьямЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетныхСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииМощностиРолей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическиВыполненногоОбъема");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихДопЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихЗатратМатРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейВсехТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияПодразделенийИСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоставаПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСохраненияНастроекКолонок");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтартаПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейПрямыхРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейФОТ");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДнямФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФазПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЭкспортВMSProject");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	
	ДополнитьПрофильОбязательнымиролямиEPM(ОписаниеПрофиля, КонфигурацияПродукта);
	
	Если КонфигурацияПродукта.ЭтоEPM Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");//
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная");//
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");//
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");//
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадрыРасширенная");//
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
    	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов"); 
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДДС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры"); 
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрганизационнойСтруктуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилЦенообразования");
		ОписаниеПрофиля.Роли.Добавить("НастройкаНСИ");
		ОписаниеПрофиля.Роли.Добавить("РазделАдминистрирование");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников");//
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРассылкамИОповещениямКлиентам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная");//
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийСотрудников");//
		ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ИначеЕсли КонфигурацияПродукта.ЭтоDev2 Тогда
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("НастройкаНСИ");
		ОписаниеПрофиля.Роли.Добавить("РазделАдминистрирование");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКонтрагентов");
	КонецЕсли;
	
	Если Не КонфигурацияПродукта.ЭтоPM_Проф Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтратегическихЦелей_НСИ");
	КонецЕсли;
	
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
		ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваУПФ");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР"); 
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУчетаВремениЗаПроизвольныйПериод");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОрганизаций");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределениеОПРиОХР");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойПродукции");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсийДополнительныхРеквизитов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзмененияСоответствиеСтатусовПППроцентамГотовности");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСпецификации");
		ОписаниеПрофиля.Роли.Добавить("упоОбработкаРабочееМестоПроектнаяПродукция");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинОтклонений");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеПричинОтклонений");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСогласованияТрудозатрат"); 
		ОписаниеПрофиля.Роли.Добавить("упоОтчетСогласованныеТрудозатраты");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСогласованияТрудозатрат");
	КонецЕсли;

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРасходовПоПроектам");    
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпособовРаспределенияРасходов");
	КонецЕсли;
	
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеРазрешены");
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	КонецЕсли;
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоИсполнительРаботБезФинансов(ОписанияПрофилей, КонфигурацияПродукта)
		
	// Профиль "Исполнитель работ (без доступа к финансовой информации)".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоИсполнительРаботБезФинансов";
	ОписаниеПрофиля.Идентификатор = "d2fd05df-d39d-11e4-827f-14dae96a654e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Исполнитель работ (без доступа к финансовой информации)'");
	ОписаниеПрофиля.Описание = 	
		НСтр("ru = 'Дает пользователю право работать с проектными заданиями, вводить информацию в систему по работам '") 
		+ НСтр("ru = 'на проектах (документ ""Распределение рабочего времени за неделю"", ""Табель учета рабочего времени"") '") 
		+ НСтр("ru = 'и получать отчетность по плановым и фактическим трудозатратам по проектным задачам, '") 
		+ НСтр("ru = 'по которым пользователь является исполнителем.'"); 
		
	// Роли
		
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваPM");
	ОписаниеПрофиля.Роли.Добавить("упоБезопасноеИспользованиеИзбранныхДействий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаданийРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПВХДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилЗаполненияПараметров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРабочегоВремениЗаНеделюРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейОбъектовСистемыИФайлов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобытийКалендаряRLS");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСообщенийПользователю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТабеляРабочегоВремениРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаИзменениеТекущегоСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПланировщик");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетИспользованиеРабочегоВремениСКД");
	
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСЗаданиямиБазовыеПраваРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСОперативнойЗагрузкойСпециалистов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("упоРазделТрудозатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЧасыРаботыИЗадания");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсииПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВидовОпераций");	
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВладенияРесурсами");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВнепроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыделенныхТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДиспетчеров");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЕдиницВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремениРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКалендарейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКлассификатораИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКодовСДР");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекАналитикиВРазрезеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекЗащитыКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимости");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимостиРесурсовРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОперативнойЗагрузкиСпециалистов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПодразделенийОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПричинПотерьРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектнойЗадачиБезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектовБезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовГотовности");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРабочихКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРазвернутыхСтрокПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетныхСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобственныхСилИСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоставаПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСохраненияНастроекКолонок");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейЗатратСвоихТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСценариев");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДнямФактДиспетчеры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	ДополнитьПрофильОбязательнымиролямиEPM(ОписаниеПрофиля, КонфигурацияПродукта);
	
	Если КонфигурацияПродукта.ЭтоEPM Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадачПроектов");
	КонецЕсли;
	
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		// В УНФ редакции 3 роль БазовыеПраваУНФ переименована в БазовыеПраваПриложения.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваПриложения");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
		ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
		ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваУПФ");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектнойПродукции");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийДополнительныхРеквизитов");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствиеСтатусовПППроцентамГотовности");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпецификации");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоОтчетСогласованныеТрудозатратыДиспетчеры");
	КонецЕсли;
	
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеРазрешены");
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоРуководительПроектногоОфиса(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Руководитель проектного офиса".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоРуководительПроектногоОфиса";
	ОписаниеПрофиля.Идентификатор = "d2fd05e0-d39d-11e4-827f-14dae96a654e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Руководитель проектного офиса'");
	ОписаниеПрофиля.Описание = 	
		НСтр("ru = 'Назначается пользователю, который является руководителем проектного офиса, с правом утверждения проектов, '")
		+ НСтр("ru = 'правами руководителя проектов и/или подразделений (с доступом к финансовой информации) и правами ввода '")
		+ НСтр("ru = 'нормативно-справочной информации.'");
		
	// Роли	
		
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваEPM");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваPM");
	ОписаниеПрофиля.Роли.Добавить("упоБезопасноеИспользованиеИзбранныхДействий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеАктуализацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсииПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВидовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВидовОпераций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВнепроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВозобновленияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДиспетчеров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДокументовОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗакрытияЭтапаБезОтменыПроведения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияДолжностиСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияПозицииСДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияРуководителяПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИсточниковФинансирования");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКлассификатораИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКопированияЗадачВСводныйПроект");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНазначенияТрудовыхРесурсовНаПроект");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНазначенияТрудовыхРесурсовНаПроектнуюЗадачу");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияДеятельности");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекДереваКлючевыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекМонитораПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастройкиРаспределенияБДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНормСтоимости");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОстановкиПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПВХДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПланированияТрудозатратПоТрудовымРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделенийОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПортфелейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилЗаполненияПараметров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинПотерьРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрограммПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейНастроекПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРабочегоВремениЗаНеделю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРасчетаЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииМощностиРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРуководителяПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииСтоимостиРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическиВыполненногоОбъема");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДопЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихЗатратМатРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРуководителяПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРучнойАктуализацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСводногоСтатусОтчетПоПроектам");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейОбъектовСистемыИФайлов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейПроектовСНаправлениямиДеятельности");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическиВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСложностиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобственныхСилСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобытийКалендаряRLS");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСообщенийПользователю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСохраненияДанныхПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтартаПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДоходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейЗатратВсехТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусОтчетаПоПроекту");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСценариев");
    ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСхемОплаты");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТабеляРабочегоВремениБезОграничений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТиповПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТрудовыхРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновПроектовИПЗ");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеОценокИсполнителейПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("упоДоступКоВсемКомпетенциям");
	ОписаниеПрофиля.Роли.Добавить("упоДоступностьФинансовойИнформацииРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоДоступностьФинансовойИнформацииРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоИзменениеКонстантаТекущаяДата");
	ОписаниеПрофиля.Роли.Добавить("упоИмпортИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаАнализВыполнимостиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыборПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыгрузкаЗагрузкаПроектныхДанных");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыгрузкаПоказателейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаГеографияПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаДеревоКлючевыхПоказателейПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаЗагрузитьИзПодчиненныхПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаИзменениеТекущегоСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаМоделированиеЭффективностиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаМониторПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаНастройкаСвязей");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельПоказателей");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельСтатусовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПерерасчетСтоимостиРесурсовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПланировщик");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПоискПроблемныхОбъектовИБ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПоискСсылок");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПроверкаСтруктурыПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаРаспределениеБДР");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаРегистрацияСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСверткаРегистровПроцентыСтатусы");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСозданиеПроектаИзШаблона");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСохранениеПроектаВШаблон");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаТабличныйБюджетДДСПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаТабличныйБюджетДРПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУдалениеПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеВерсиямиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеДаннымиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеЗагрузкой");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУпрощенныйВводСтруктурыПроектаРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаХозяйственныеОперацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетSКривая");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализ_БДР_по_БДДССКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализПроектовПоПоказателямСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализШаблонаПроектаСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетБалансПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетБюджетСМРПоГлавамССР");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетВыполненныеИПринятыеОбъемы");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДвиженияДенежныхСредствПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДвижениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДинамикаЭкономикиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДополнительныеЗатратыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДоходыИРасходыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗагрузкаТрудовыхРесурсовПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыМатериальныхРесурсовПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыТрудовыхРесурсовПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетИспользованиеРабочегоВремениСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетМощностьРолейПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыEVA");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныйОбъемТрудозатратСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализБДР_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализПоПортфелю");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализПоПрограмме");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализРаспределенияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРабочиеКалендариСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРесурсыПроектаПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСводныйСтатусПоПродажамПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСетевойГрафик");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДДСПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДРОбъемыБДДС");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДРПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСостояниеПроектныхЗадачСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСравнениеВерсий");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСрокиПроектаПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтоимостьРесурсовПоНормамСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтруктураТрудовыхРесурсовСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетТематическийПлан");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетТрудозатратыПоУровнямПланирования");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЮридическаяСтруктураПредприятияСКД");
	ОписаниеПрофиля.Роли.Добавить("упоПравоНаЗаписьОперативнойЗагрузки");
	ОписаниеПрофиля.Роли.Добавить("упоПравоНаОтменуЗакрытияЭтапа");
	ОписаниеПрофиля.Роли.Добавить("упоПравоНаУстановкаПорядкаЗаданий");
	ОписаниеПрофиля.Роли.Добавить("упоПравоРедактированияБазовойВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоПравоРедактированияДоговорнойВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСЗаданиямиБазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСОперативнойЗагрузкойСпециалистов");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСПоказателямиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСРискамиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("упоРазделДокументы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаказыИКонтрактация");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаявкиНаПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделМатериальныеИДопЗатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделНормированиеИПроектныеРешения");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОбъемыИВыполнениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОтражениеФактаВПроектномБюджетировании");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОценкаПроектаРасчетЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПортфелиИПрограммы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПредприятиеИРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроектыИФазы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделРискиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделСтруктураРаботПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделТрудозатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделУправлениеДоговорами");
	ОписаниеПрофиля.Роли.Добавить("упоРазделФинансыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЧасыРаботыИЗадания");
	ОписаниеПрофиля.Роли.Добавить("упоРедактированиеКарточекПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоТолькоЧтениеРабочихКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРП");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРПО");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВладенияРесурсами");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыделенныхТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненныхПринятыхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияДоходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияРасходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовРасчетаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремениРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКалендарейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКодовСДР");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалютДляРасчетовСПерсоналом");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеМощностиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНазначенияТрудовыхРесурсовНаПроект");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНаправленийИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекАналитикиВРазрезеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекЗащитыКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимостиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОперацийБиблиотекиШаблонов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизационнойСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОценокИсполнителейПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаВыполненияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаПоставкиМатРесурсовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланированияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановВыпускаСубпродуктовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановОбъемовПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПравилОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПредопределенныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПредусловийПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрогнозныеСроки");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовГотовности");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРабочихКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРазвернутыхСтрокПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРесурсовПоСтатьямЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетныхСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейВсехТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРучнойАктуализацияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобственныхСилИСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобытийКалендаря"); 
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияПодразделенийИСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоставаПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСохраненияНастроекКолонок");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейПрямыхРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейФОТ");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДнямФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФазПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЭкспортВMSProject");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	ДополнитьПрофильОбязательнымиролямиEPM(ОписаниеПрофиля, КонфигурацияПродукта);
	
	Если Не КонфигурацияПродукта.ЭтоPM_Проф Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаявокНаПроекты");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИтоговыйБаллПроекта");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПоказателейЭффективностиПроектов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСоответствияСтратегическимЦелям");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтратегическихЦелей_НСИ");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеФормированияБизнесПлана");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСогласованияТрудозатрат"); 
		ОписаниеПрофиля.Роли.Добавить("упоОтчетСогласованныеТрудозатраты");
	КонецЕсли;
	
	// Делаем по аналогии с профилем "Администратор проектного офиса".
	Если КонфигурацияПродукта.ЭтоEPM Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
    	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов"); 
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДДС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрганизационнойСтруктуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилЦенообразования");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеупоДенежныеСредстваКВыплате");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРассылкамИОповещениямКлиентам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ИначеЕсли КонфигурацияПродукта.ЭтоDev2 Тогда
		// Пока пусто
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКонтрагентов");
	КонецЕсли;
	
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		// В УНФ редакции 3 роль БазовыеПраваУНФ переименована в БазовыеПраваПриложения.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваПриложения");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
		ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
		ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваУПФ");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеКонтрагентовРЛС");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизацийРЛС");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");  
		ОписаниеПрофиля.Роли.Добавить("упоОбработкаЗаполнениеДокументовУНФ");  
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУчетаВремениЗаПроизвольныйПериод");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОрганизаций");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоРаботаСДоговорами");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределениеОПРиОХР");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределениеОПРиОХР");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойПродукции");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсийДополнительныхРеквизитов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзмененияСоответствиеСтатусовПППроцентамГотовности");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСпецификации");
		ОписаниеПрофиля.Роли.Добавить("упоОбработкаРабочееМестоПроектнаяПродукция");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеПричинОтклонений");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинОтклонений");
		ОписаниеПрофиля.Роли.Добавить("упоОтчетФакторныйАнализПричинОтклонений");
	КонецЕсли;

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРасходовПоПроектам"); 
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСпособовРаспределенияРасходов");
	КонецЕсли;
	
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеРазрешены");
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	КонецЕсли;
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоРуководительПроектовПодразделений(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Руководитель проектов и/или подразделений (с доступом к финансовой информации)".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоРуководительПроектовПодразделений";
	ОписаниеПрофиля.Идентификатор = "d2fd05e2-d39d-11e4-827f-14dae96a654e";
	ОписаниеПрофиля.Наименование  = 
		НСтр("ru = 'Руководитель проектов и/или подразделений (с доступом к финансовой информации)'");
	ОписаниеПрофиля.Описание = 	
		НСтр("ru = 'Назначается пользователю, который является руководителем, администратором проектов '") 
		+ НСтр("ru = 'или начальником подразделения с правом ввода структуры проекта, планирования трудозатрат, '") 
		+ НСтр("ru = 'назначением исполнителей, планирования и учету фактических объемов, доходов, расходов и ДДС.'"); 
		
	// Роли
		
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов"); 
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваEPM");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваPM");
	ОписаниеПрофиля.Роли.Добавить("упоБезопасноеИспользованиеИзбранныхДействий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеАктуализацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсииПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВнепроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВозобновленияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДокументовОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗакрытияЭтапаБезОтменыПроведения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияПозицииСДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияРуководителяПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКлассификатораИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНазначенияТрудовыхРесурсовНаПроект");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНазначенияТрудовыхРесурсовНаПроектнуюЗадачу");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекДереваКлючевыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекМонитораПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастройкиРаспределенияБДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОстановкиПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПВХДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПланированияТрудозатратПоТрудовымРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилЗаполненияПараметров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПредопределенныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинПотерьРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейНастроекПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРабочегоВремениЗаНеделю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическиВыполненногоОбъема");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДопЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихЗатратМатРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРисковПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРучнойАктуализацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейОбъектовСистемыИФайлов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейПроектовСНаправлениямиДеятельности");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическиВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобственныхСилСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобытийКалендаряRLS");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСообщенийПользователю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСохраненияДанныхПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтартаПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДоходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейЗатратСвоихТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусОтчетаПоПроекту");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСхемОплаты");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСценариевПланирования"); 
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСценариев");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТабеляРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновПроектовИПЗ");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеОценокИсполнителейПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("упоДоступностьФинансовойИнформацииРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоИмпортИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаАнализВыполнимостиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыборПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыгрузкаПоказателейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаГеографияПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаДеревоКлючевыхПоказателейПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаЗагрузитьИзПодчиненныхПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаИзменениеТекущегоСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаМоделированиеЭффективностиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаМониторПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельПоказателей");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельРуководителяПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельСтатусовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПерерасчетСтоимостиРесурсовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПланировщик");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПоискПроблемныхОбъектовИБ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПроверкаСтруктурыПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаРаспределениеБДР");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСозданиеПроектаИзШаблона");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСохранениеПроектаВШаблон");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаТабличныйБюджетДДСПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаТабличныйБюджетДРПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеВерсиямиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеДаннымиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеЗагрузкой");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУпрощенныйВводСтруктурыПроектаРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаХозяйственныеОперацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетSКривая");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализ_БДР_по_БДДССКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализПроектовПоПоказателямСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализШаблонаПроектаСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетБалансПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетБюджетСМРПоГлавамССР");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетВыполненныеИПринятыеОбъемы");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДвиженияДенежныхСредствПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДвижениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДинамикаЭкономикиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДополнительныеЗатратыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДоходыИРасходыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗагрузкаТрудовыхРесурсовПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыМатериальныхРесурсовПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыТрудовыхРесурсовПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетИспользованиеРабочегоВремениСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетМощностьРолейПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыEVA");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныйОбъемТрудозатратСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализБДР_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализПоПортфелю");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализПоПрограмме");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализРаспределенияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРабочиеКалендариСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРесурсыПроектаПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСводныйСтатусПоПродажамПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСетевойГрафик");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДДСПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДРОбъемыБДДС");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДРПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСостояниеПроектныхЗадачСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСравнениеВерсий");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСрокиПроектаПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтоимостьРесурсовПоНормамСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтруктураТрудовыхРесурсовСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетТематическийПлан");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетТрудозатратыПоУровнямПланирования");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЮридическаяСтруктураПредприятияСКД");
	ОписаниеПрофиля.Роли.Добавить("упоПравоРедактированияБазовойВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоПравоРедактированияДоговорнойВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСЗаданиямиБазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСОперативнойЗагрузкойСпециалистов");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСПоказателямиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСРискамиПроектовБазовая");
	ОписаниеПрофиля.Роли.Добавить("упоРазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("упоРазделДокументы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаказыИКонтрактация");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаявкиНаПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделМатериальныеИДопЗатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделНормированиеИПроектныеРешения");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОбъемыИВыполнениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОценкаПроектаРасчетЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПортфелиИПрограммы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПредприятиеИРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроектыИФазы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделРасчетЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделРискиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделСтруктураРаботПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделТрудозатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделУправлениеДоговорами");
	ОписаниеПрофиля.Роли.Добавить("упоРазделФинансыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЧасыРаботыИЗадания");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРП");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРПО");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВидовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВидовОпераций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВладенияРесурсами");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВозобновленияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыделенныхТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненныхПринятыхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияДоходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияРасходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДиспетчеров");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовРасчетаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЕдиницВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремениРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИсточниковФинансирования");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКалендарейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКодовСДР");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалютДляРасчетовСПерсоналом");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеМощностиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНазначенияТрудовыхРесурсовНаПроект");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНаправленийИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекАналитикиВРазрезеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекЗащитыКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимости");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимостиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОперацийБиблиотекиШаблонов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизационнойСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОстановкиПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОценокИсполнителейПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаВыполненияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаПоставкиМатРесурсовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланированияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановВыпускаСубпродуктовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановОбъемовПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПодразделенийОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПортфелейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПравилИнтеграцииС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПравилОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПредопределенныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПредусловийПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрогнозныеСроки");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрограммПроектов");	
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовГотовности");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРабочихКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРазвернутыхСтрокПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРесурсовПоСтатьямЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетаЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетныхСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииМощностиРолей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииРуководителяПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолей");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРучнойАктуализацияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСложностиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобственныхСилИСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобытийКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияПодразделенийИСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоставаПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСохраненияНастроекКолонок");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтартаПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейПрямыхРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейФОТ");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСценариев");
    ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТиповПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДнямФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФазПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЭкспортВMSProject");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	ДополнитьПрофильОбязательнымиролямиEPM(ОписаниеПрофиля, КонфигурацияПродукта);
	
	Если КонфигурацияПродукта.ЭтоEPM Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры"); //
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадрыРасширенная"); //
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры"); //
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадрыРасширенная"); //
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
    	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов"); 
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДДС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрганизационнойСтруктуры");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилЦенообразования");
		ОписаниеПрофиля.Роли.Добавить("НастройкаНСИ");
		ОписаниеПрофиля.Роли.Добавить("РазделАдминистрирование");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеупоДенежныеСредстваКВыплате");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСотрудников"); //
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКадровогоСостоянияРасширенная"); //
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийСотрудников"); //
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ИначеЕсли КонфигурацияПродукта.ЭтоDev2 Тогда
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("НастройкаНСИ");
		ОписаниеПрофиля.Роли.Добавить("РазделАдминистрирование");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеНоменклатуры");
	КонецЕсли;
	
	Если Не КонфигурацияПродукта.ЭтоPM_Проф Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаявокНаПроекты");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПоказателейЭффективностиПроектов");
	КонецЕсли;
	
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		// В УНФ редакции 3 роль БазовыеПраваУНФ переименована в БазовыеПраваПриложения.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваПриложения");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
		ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
		ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваУПФ");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеКонтрагентовРЛС");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизацийРЛС");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР"); 
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетов"); 
		ОписаниеПрофиля.Роли.Добавить("упоОбработкаЗаполнениеДокументовУНФ");	
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщику");		
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУчетаВремениЗаПроизвольныйПериод");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоРаботаСДоговорами");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределениеОПРиОХР");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойПродукции");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсийДополнительныхРеквизитов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСпецификации");
		ОписаниеПрофиля.Роли.Добавить("упоОбработкаРабочееМестоПроектнаяПродукция");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствиеСтатусовПППроцентамГотовности");
	КонецЕсли; 
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеПричинОтклонений");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинОтклонений");
		ОписаниеПрофиля.Роли.Добавить("упоОтчетФакторныйАнализПричинОтклонений");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСогласованияТрудозатрат");	
		ОписаниеПрофиля.Роли.Добавить("упоОтчетСогласованныеТрудозатраты");		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРасходовПоПроектам"); 
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСпособовРаспределенияРасходов");
	КонецЕсли;
	
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеРазрешены");
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	КонецЕсли;
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоРуководительПроектовПодразделенийБезФинансов(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Руководитель проектов и/или подразделений (без доступа к финансовой информации)".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоРуководительПроектовПодразделенийБезФинансов";
	ОписаниеПрофиля.Идентификатор = "d2fd05e1-d39d-11e4-827f-14dae96a654e";
	ОписаниеПрофиля.Наименование  = 
		НСтр("ru = 'Руководитель проектов и/или подразделений (без доступа к финансовой информации)'");
	ОписаниеПрофиля.Описание = 
		НСтр("ru = 'Назначается пользователю, который является руководителем, администратором проектов '") 
		+ НСтр("ru = 'или начальником подразделения с правом ввода структуры проекта, планирования трудозатрат, '") 
		+ НСтр("ru = 'назначения исполнителей, регистрации выполненного объема и фактических затрат материальных ресурсов.'");
		
	// Роли
		
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваEPM");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваPM");
	ОписаниеПрофиля.Роли.Добавить("упоБезопасноеИспользованиеИзбранныхДействий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеАктуализацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсииПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВидовОбъектов");	
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВнепроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВозобновленияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДиспетчеров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗакрытияЭтапаБезОтменыПроведения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияПозицииСДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияРуководителяПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИсточниковФинансирования");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКлассификатораИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНазначенияТрудовыхРесурсовНаПроект");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНазначенияТрудовыхРесурсовНаПроектнуюЗадачу");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНормСтоимости");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОстановкиПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПВХДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПланированияТрудозатратПоТрудовымРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделенийОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПортфелейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилЗаполненияПараметров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПредопределенныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинПотерьРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрограммПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейНастроекПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРабочихКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРабочегоВремениЗаНеделю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииМощностиРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическиВыполненногоОбъема");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРучнойАктуализацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейОбъектовСистемыИФайлов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСложностиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобственныхСилСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобытийКалендаряRLS");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСообщенийПользователю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСохраненияДанныхПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтартаПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусОтчетаПоПроекту");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТабеляРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТиповПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТрудовыхРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновПроектовИПЗ");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеОценокИсполнителейПодрядчиков");
	ОписаниеПрофиля.Роли.Добавить("упоИмпортИзMSProject");
	ОписаниеПрофиля.Роли.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаАнализВыполнимостиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыборПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаЗагрузитьИзПодчиненныхПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаИзменениеТекущегоСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельРуководителяПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельСтатусовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПерерасчетСтоимостиРесурсовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПланировщик");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПоискПроблемныхОбъектовИБ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПроверкаСтруктурыПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаРегистрацияСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСозданиеПроектаИзШаблона");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСохранениеПроектаВШаблон");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеВерсиямиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеДаннымиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеЗагрузкой");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУпрощенныйВводСтруктурыПроектаРедактирование");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализШаблонаПроектаСКДБезФинансов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗагрузкаТрудовыхРесурсовПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыМатериальныхРесурсовПланФактСКДБезФинансов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыТрудовыхРесурсовПланФактСКДБезФинансов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетИспользованиеРабочегоВремениСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетМощностьРолейПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРабочиеКалендариСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСетевойГрафик");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСостояниеПроектныхЗадачСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСрокиПроектаПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтруктураТрудовыхРесурсовСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЮридическаяСтруктураПредприятияСКД");
	ОписаниеПрофиля.Роли.Добавить("упоПравоРедактированияБазовойВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСЗаданиямиБазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСОперативнойЗагрузкойСпециалистов");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСПоказателямиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСРискамиПроектовБазовая");
	ОписаниеПрофиля.Роли.Добавить("упоРазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("упоРазделДокументы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаказыИКонтрактация");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаявкиНаПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделМатериальныеИДопЗатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделНормированиеИПроектныеРешения");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОбъемыИВыполнениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПортфелиИПрограммы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПредприятиеИРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроектыИФазы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделРискиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделСтруктураРаботПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделТрудозатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделУправлениеДоговорами");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЧасыРаботыИЗадания");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРП");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРПО");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВидовОпераций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВладенияРесурсами");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыделенныхТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненныхПринятыхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияДоходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияРасходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДиспетчеров");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовРасчетаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияДолжностиСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремениРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКалендарейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКодовСДР");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалютДляРасчетовСПерсоналом");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеМощностиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНазначенияТрудовыхРесурсовНаПроект");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНаправленийИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекАналитикиВРазрезеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекЗащитыКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастройкиРаспределенияБДР");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимости");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимостиРесурсовРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОперацийБиблиотекиШаблонов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизационнойСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаВыполненияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаПоставкиМатРесурсовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланированияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановВыпускаСубпродуктовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановОбъемовПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПравилОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПредусловийПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрогнозныеСроки");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрофилейРаспределенияДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовГотовности");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРазвернутыхСтрокПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРесурсовПоСтатьямЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетныхСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииРуководителяПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическиВыполненногоОбъема");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихЗатратМатРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРучнойАктуализацияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСинхронизацииФактическиВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобственныхСилИСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобытийКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияПодразделенийИСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоставаПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСохраненияНастроекКолонок");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейДоходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейЗатратСвоихТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейПрямыхРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейФОТ");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСхемОплаты");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСценариев");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДнямФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФазПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЭкспортВMSProject");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	ДополнитьПрофильОбязательнымиролямиEPM(ОписаниеПрофиля, КонфигурацияПродукта);
		
	Если КонфигурацияПродукта.ЭтоEPM ИЛИ КонфигурацияПродукта.ЭтоDev2 Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
		Если КонфигурацияПродукта.ЭтоEPM Тогда
			ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");
			ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
        	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроектов"); 
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрганизационнойСтруктуры");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
		КонецЕсли;
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеНоменклатуры");
	КонецЕсли;
	
	Если Не КонфигурацияПродукта.ЭтоPM_Проф Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаявокНаПроекты");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПоказателейЭффективностиПроектов");
	КонецЕсли;
	
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		// В УНФ редакции 3 роль БазовыеПраваУНФ переименована в БазовыеПраваПриложения.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваПриложения");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
		ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
		ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваУПФ");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеКонтрагентовРЛС");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизацийРЛС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");  
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщику");  
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУчетаВремениЗаПроизвольныйПериод");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОрганизаций");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойПродукции");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсийДополнительныхРеквизитов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСпецификации");
		ОписаниеПрофиля.Роли.Добавить("упоОбработкаРабочееМестоПроектнаяПродукция");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствиеСтатусовПППроцентамГотовности");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеПричинОтклонений");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинОтклонений");
		ОписаниеПрофиля.Роли.Добавить("упоОтчетФакторныйАнализПричинОтклонений");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоОтчетСогласованныеТрудозатраты");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСогласованияТрудозатрат");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРасходовПоПроектам");     
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпособовРаспределенияРасходов");    
	КонецЕсли;
	
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеРазрешены");
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	КонецЕсли;
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоФинансистПроектногоОфиса(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Финансист проектного офиса".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоФинансистПроектногоОфиса";
	ОписаниеПрофиля.Идентификатор = "d2fd05e3-d39d-11e4-827f-14dae96a654e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Экономист проектного офиса'");
	ОписаниеПрофиля.Описание = 
		НСтр("ru = 'Назначается пользователю, который является администратором проектов или начальником подразделения '") 
		+ НСтр("ru = 'с правом ввода фактических объемов, доходов, расходов и ДДС.'"); 
		
	// Роли
		
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваEPM");
	ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваPM");
	ОписаниеПрофиля.Роли.Добавить("упоБезопасноеИспользованиеИзбранныхДействий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВерсииПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВидовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВидовОпераций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВнепроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеВозобновленияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДиспетчеров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДокументовОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЕдиницИзмерения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗавершенияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияДолжностиСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИзмененияПозицииСДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИсточниковФинансирования");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКопированияЗадачВСводныйПроект");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияДеятельности");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНаправленияИнвестиций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастроекКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНастройкиРаспределенияБДР");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеНормСтоимости");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОстановкиПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПВХДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПодразделенийОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПортфелейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПравилЗаполненияПараметров");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПредопределенныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПричинПотерьРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрограммПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПроектнойЗадачи");	
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПрофилейРаспределенияТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРабочихКалендарей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРабочегоВремениЗаНеделю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРасчетаЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииМощностиРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииРуководителяПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииСтоимостиРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическиВыполненногоОбъема");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДопЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРегистрацииФактическихЗатратМатРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРолей");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейОбъектовСистемыИФайлов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСвязейПроектовСНаправлениямиДеятельности");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическиВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСинхронизацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСложностиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияВладельцаРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСмещенияРолейТрудовогоРесурса");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобственныхСилСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСобытийКалендаряRLS");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСообщенийПользователю");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСотрудников");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСохраненияДанныхПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтартаПроектныхРабот");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейДоходов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатейЗатратВсехТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтатусовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСхемОплаты");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТабеляРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеТиповПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеШаблоновКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("упоДоступКоВсемКомпетенциям");
	ОписаниеПрофиля.Роли.Добавить("упоИзменениеКонстантаТекущаяДата");
	ОписаниеПрофиля.Роли.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаВыборПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаИзменениеТекущегоСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаМоделированиеЭффективностиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПанельПоказателей");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПерерасчетСтоимостиРесурсовПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПланировщик");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаПоискСсылок");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаРегистрацияСотрудника");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаСохранениеПроектаВШаблон");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаТабличныйБюджетДДСПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаТабличныйБюджетДРПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеДаннымиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУправлениеЗагрузкой");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаУпрощенныйВводСтруктурыПроектаПросмотр");
	ОписаниеПрофиля.Роли.Добавить("упоОбработкаХозяйственныеОперацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетSКривая");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализ_БДР_по_БДДССКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализПроектовПоПоказателямСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетАнализШаблонаПроектаСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетБалансПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетБюджетСМРПоГлавамССР");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетВыполненныеИПринятыеОбъемы");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДвиженияДенежныхСредствПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДвижениеДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДинамикаЭкономикиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДополнительныеЗатратыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетДоходыИРасходыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗагрузкаТрудовыхРесурсовПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыМатериальныхРесурсовПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЗатратыТрудовыхРесурсовПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетИспользованиеРабочегоВремениСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетМощностьРолейПланСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыEVA");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныеОбъемыПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетОсвоенныйОбъемТрудозатратСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализБДР_Подразделения");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетПланФактныйАнализРаспределенияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРабочиеКалендариСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетРесурсыПроектаПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСводныйСтатусПоПродажамПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСетевойГрафик");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДДСПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДРОбъемыБДДС");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСкользящийБДРПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСостояниеПроектныхЗадачСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСравнениеВерсий");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСрокиПроектаПланФактСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтоимостьРесурсовПоНормамСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетСтруктураТрудовыхРесурсовСКД");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетТематическийПлан");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетТрудозатратыПоУровнямПланирования");
	ОписаниеПрофиля.Роли.Добавить("упоОтчетЮридическаяСтруктураПредприятияСКД");
	ОписаниеПрофиля.Роли.Добавить("упоПравоРедактированияДоговорнойВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоПроектнаяЗадачаРедактированиеТолько_ДР_ДДС");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСЗаданиямиБазовыеПрава");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСПоказателямиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРаботаСРискамиПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("упоРазделДокументы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаказыИКонтрактация");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЗаявкиНаПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделМатериальныеИДопЗатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделНормированиеИПроектныеРешения");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОбъемыИВыполнениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОтражениеФактаВПроектномБюджетировании");
	ОписаниеПрофиля.Роли.Добавить("упоРазделОценкаПроектаРасчетЦеныКонтракта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПечатьШаблонов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПортфелиИПрограммы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПредприятиеИРесурсы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроекты");
	ОписаниеПрофиля.Роли.Добавить("упоРазделПроектыИФазы");
	ОписаниеПрофиля.Роли.Добавить("упоРазделРискиПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделСтруктураРаботПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоРазделТрудозатратыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделУправлениеДоговорами");
	ОписаниеПрофиля.Роли.Добавить("упоРазделФинансыПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоРазделЧасыРаботыИЗадания");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРП");
	ОписаниеПрофиля.Роли.Добавить("упоФормаРабочегоСтолаРПО");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВладенияРесурсами");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыделенныхТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВыполненныхПринятыхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхПлановДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияДоходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДанныхРаспределенияРасходовПоПериодам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДокументовРасчетаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеДопЗатратПроектовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовПлан");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеЗатратРесурсовФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияРуководителяПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИзмененияСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеИспользованияРабочегоВремениРЛС");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКалендарейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКлассификатораИспользованияРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКодовСДР");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеКурсовВалютДляРасчетовСПерсоналом");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеМощностиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекАналитикиВРазрезеПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНастроекЗащитыКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеНормСтоимостиРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОперацийБиблиотекиШаблонов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизационнойСтруктуры");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаВыполненияОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаПоставкиМатРесурсовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланаТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланированияПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПланированияТрудозатратПоТрудовымРесурсам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановВыпускаСубпродуктовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПлановОбъемовПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПравилОтражения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПредусловийПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрогнозныеСроки");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПрофилейНастроекПрогнозаТрудозатратПоРолям");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовГотовности");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроцентовЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРазвернутыхСтрокПользователя");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРесурсовПоСтатьямЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетаКалендарногоПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРасчетныхСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииРабочегоКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииСоставаПодразделения");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическиВыполненногоОбъема");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихДопЗатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРегистрацииФактическихЗатратМатРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейВсехТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРолейТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеРуководителейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСводногоСтатусОтчетПоПроектам");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобственныхСилИСубподряда");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСобытийКалендаря");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСинхронизацииФактическихТрудозатрат");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияПодразделенийИСтруктурыПредприятия");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоставаПодразделений");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСохраненияНастроекКолонок");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпискаПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСроковПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейПрямыхРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатейФОТ");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусОтчетаПоПроекту");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСценариев");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудовыхРесурсов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДням");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеТрудозатратРесурсовПоДнямФакт");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеУтвержденияПланаПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФазПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихВыполненныхОбъемов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДвиженийДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовИРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеФактическихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("упоЭкспортВMSProject");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	ДополнитьПрофильОбязательнымиролямиEPM(ОписаниеПрофиля, КонфигурацияПродукта);
	
	Если КонфигурацияПродукта.ЭтоEPM Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЗарплатаКадры");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДДС");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрганизационнойСтруктуры");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеупоДенежныеСредстваКВыплате");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовВыполненныхРабот");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС"); 
    	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадачПроектов");  
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаКомандировку");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыКонтрагентовБЭД");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПодразделенийОрганизации");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийТоваровУслугВозвратовПоставщикам");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваровУслуг");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ИначеЕсли КонфигурацияПродукта.ЭтоDev2 Тогда
	// По аналогии с профилем "Администратор проектного офиса" делаем проверку,
	// чтобы в Dev2 не попала роль "упоДобавлениеИзменениеКонтрагентов"
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеКонтрагентов");
	КонецЕсли;
	
	Если Не КонфигурацияПродукта.ЭтоPM_Проф Тогда
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеЗаявокНаПроекты");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеИтоговыйБаллПроекта");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеПоказателейЭффективностиПроектов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСоответствияСтратегическимЦелям");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСтратегическихЦелей_НСИ");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеФормированияБизнесПлана");
	КонецЕсли;

	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		// В УНФ редакции 3 роль БазовыеПраваУНФ переименована в БазовыеПраваПриложения.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваПриложения");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
		ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиСМобильнымПриложением");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбсуждений");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеПодключаемогоОборудования");
		ОписаниеПрофиля.Роли.Добавить("РаботаСФайлами");
		ОписаниеПрофиля.Роли.Добавить("упоБазовыеПраваУПФ");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеКонтрагентовРЛС");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеОрганизацийРЛС");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствияСтатейДР");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗапасовИРасчетов");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковРасчетов");  
		ОписаниеПрофиля.Роли.Добавить("упоОбработкаЗаполнениеДокументовУНФ");	
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеУчетаВремениЗаПроизвольныйПериод");
	Иначе
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеДоговоровКонтрагентов");
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеОрганизаций");
		ОписаниеПрофиля.Роли.Добавить("упоРаботаСДоговорами");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределениеОПРиОХР");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектнойПродукции");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийДополнительныхРеквизитов");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСоответствиеСтатусовПППроцентамГотовности");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпецификации");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеПричинОтклонений");
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда 
		ОписаниеПрофиля.Роли.Добавить("упоОтчетСогласованныеТрудозатраты");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСогласованияТрудозатрат");
	КонецЕсли;
		
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда  
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеРаспределенияРасходовПоПроектам");
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеРаспределенияРасходовПоПроектам");          
		ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпособовРаспределенияРасходов");  
		ОписаниеПрофиля.Роли.Добавить("упоДобавлениеИзменениеСпособовРаспределенияРасходов");
	КонецЕсли;
	
	// Виды доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеРазрешены");
	Если КонфигурацияПродукта.ЭтоУПФ Тогда
		ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКонтрагентов", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	КонецЕсли;
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоОсобыеПраваНаОповещения(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Особые права на оповещения".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоОсобыеПраваНаОповещения";
	ОписаниеПрофиля.Идентификатор = "7d76d4f1-5eb7-40ac-aeb5-2831c815f585";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Особые права на оповещения'");
	ОписаниеПрофиля.Описание = 
		НСтр("ru = 'Дополнительный профиль, включает в себя роль ""Особые права на оповещения"", '")
		+ НСтр("ru = 'используется для назначения группам пользователей получателей оповещений.'");
		
	// Роли
	
	ОписаниеПрофиля.Роли.Добавить("упоОсобыеПраваНаОповещения");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоИспользованиеЗащищенногоФункционала(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Использование защищенного функционала".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоИспользованиеЗащищенногоФункционала";
	ОписаниеПрофиля.Идентификатор = "65a8df0a-8ad3-11e6-82fe-14dae96a654e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Использование защищенного функционала'");
	ОписаниеПрофиля.Описание = 
		НСтр("ru = 'Дополнительный профиль, назначается новым профилям РМ. Дает возможность получения лицензии СЛК '")
		+ НСтр("ru = 'для использования защищенного функционала.'"); 
	
	ОписаниеПрофиля.Роли.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоВыборПроектныхЗадачКакПроекта(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Выбор проектной задачи из справочника проекты".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоВыборПроектныхЗадачКакПроекта";
	ОписаниеПрофиля.Идентификатор = "70b1ce0b-6418-11e8-b57e-90e6ba33dee7";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Выбор проектной задачи из справочника проекты'");
	ОписаниеПрофиля.Описание =		
		НСтр("ru = 'Дополнительный профиль, назначается пользователям конфигураций, интегрированных с конфигурацией PM, '") 
		+ НСтр("ru = 'для возможности выбора задач в первичных документах.'"); 
		
	// Роли
	
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПортфелейПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектнойЗадачиБезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектовБезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпискаПроектов");
	
	Если КонфигурацияПродукта.ЭтоEPM Тогда
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадачПроектов");
	КонецЕсли;
	
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("упоПроекты", "ВначалеВсеРазрешены");
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофиль_упоРаботаСПроектамиДополнительный(ОписанияПрофилей, КонфигурацияПродукта)
	
	// Профиль "Работа с проектами контура ""Управление проектами"" (дополнительный)".
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "упоРаботаСПроектамиДополнительный";
	ОписаниеПрофиля.Идентификатор = "c29e8fab-c697-4d7f-afcd-7746d49e59d7";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Работа с проектами контура ""Управление проектами"" (дополнительный)'");
	ОписаниеПрофиля.Описание = 	
		НСтр("ru = 'Назначается пользователю, если ему необходимо работать с типовыми документами, отчетами и '") 
		+ НСтр("ru = 'обработками без возможности просмотра контура ""Управление проектами"".'");
		
	// Роли  
	
	ОписаниеПрофиля.Роли.Добавить("упоИспользованиеЗащищенногоФункционалаРМ");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсийПроекта"); 
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеВерсииПланаПроекта"); 
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПортфелейПроектов");   
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектовБезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектнойЗадачи");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеПроектнойЗадачиБезПросмотра");   
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектов");	
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСвойствПроектныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСпискаПроектов");  
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектов");
	ОписаниеПрофиля.Роли.Добавить("упоЧтениеСтатусовПроектныхЗадач");
	
	//
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДополнитьПрофильОбязательнымиролямиEPM(ОписаниеПрофиля, КонфигурацияПродукта)
	
	Если Не КонфигурацияПродукта.ЭтоEPM
		И Не КонфигурацияПродукта.ЭтоDev2 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьПрофильОбязательнымиРолямиУТ(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования"); // Выбор сценария в отчетах.
	
КонецПроцедуры

Процедура ДополнитьПрофильОбязательнымиРолямиУТ(ОписаниеПрофиля)
	
	МодульУправлениеДоступомУТ = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступомУТ");
	
	Если МодульУправлениеДоступомУТ <> Неопределено Тогда
		МодульУправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	КонецЕсли;
	
КонецПроцедуры

// Может вызываться из модулей обновления интеграционных подсистем (например, из УПФ)
// 
// Возвращаемое значение:
// СтруктураГруппИПрофилей - перечень всех типовых профилей групп доступа, где ключ - наименование группы доступа,
//							 а значение - наименование профиля группы доступа
//
Функция ПолучитьСтруктуруТиповыхГруппИПрофилей() Экспорт
	
	СтруктураГруппИПрофилей = Новый Структура;
	СтруктураГруппИПрофилей.Вставить("упоАдминистраторыПроектногоОфиса", "упоАдминистраторПроектногоОфиса");
	СтруктураГруппИПрофилей.Вставить("упоИсполнителиРабот", "упоИсполнительРаботБезФинансов");
	СтруктураГруппИПрофилей.Вставить("упоРуководителиПроектногоОфиса", "упоРуководительПроектногоОфиса");
	СтруктураГруппИПрофилей.Вставить("упоРуководителиПроектовПодразделений", "упоРуководительПроектовПодразделений");
	СтруктураГруппИПрофилей.Вставить("упоРуководителиПроектовПодразделенийБезФинансов",
		"упоРуководительПроектовПодразделенийБезФинансов");
	СтруктураГруппИПрофилей.Вставить("упоФинансистыПроектногоОфиса", "упоФинансистПроектногоОфиса");
	СтруктураГруппИПрофилей.Вставить("упоОповещения_ИзмененияСтатусовПроектов", "упоОсобыеПраваНаОповещения");
	СтруктураГруппИПрофилей.Вставить("упоИспользованиеЗащищенногоФункционала", "упоИспользованиеЗащищенногоФункционала");
	СтруктураГруппИПрофилей.Вставить("упоВыборПроектныхЗадачКакПроекта", "упоВыборПроектныхЗадачКакПроекта");    
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		СтруктураГруппИПрофилей.Вставить("упоРаботаСПроектамиДополнительный", "упоРаботаСПроектамиДополнительный");    		
	КонецЕсли;	
	
	Возврат СтруктураГруппИПрофилей;
	
КонецФункции

Функция ПолучитьПризнакиКонфигурацийПродукта()
	
	КонфигурацияПродукта = Новый Структура();
	КонфигурацияПродукта.Вставить("ЭтоEPM", упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM());
	КонфигурацияПродукта.Вставить("ЭтоDev2", упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2());
	КонфигурацияПродукта.Вставить("ЭтоPM_Проф", упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф());
	КонфигурацияПродукта.Вставить("ЭтоУПФ", упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ());
	
	Возврат КонфигурацияПродукта;
	
КонецФункции

#КонецОбласти

#Область СвязьПодразделенийИСтруктурыПредприятия

// Создает для каждого подразделения соответствующий элемент структуры предприятия.
Процедура СинхронизироватьВсеПодразделенияИСтруктурыПредприятия() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЭтоУПФ = упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить("ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.упоПодразделения КАК Подразделения");
	Если ЭтоУПФ Тогда
		ЧастиЗапроса.Добавить("
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)");
	Иначе
		ЧастиЗапроса.Добавить("
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ЧастиЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВыполняетсяОбработчикЗаполнения = Истина;
	Пока Выборка.Следующий() Цикл
		СинхронизироватьПодразделениеИСтруктуруПредприятия(Выборка.Ссылка, ВыполняетсяОбработчикЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

Функция СинхронизироватьПодразделениеИСтруктуруПредприятия(ЭлементИсточник, ВыполняетсяОбработчикЗаполнения = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭлементИсточник) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоУПФ = упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2()
		И Не ЭтоУПФ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоУПФ И ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		ТипСтруктурнойЕдиницы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементИсточник, "ТипСтруктурнойЕдиницы", Истина); 
		ТипСтруктурнойЕдиницыПодразделение = 
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ТипыСтруктурныхЕдиниц.Подразделение");
		Если ТипСтруктурнойЕдиницы <> ТипСтруктурнойЕдиницыПодразделение Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.упоПодразделения") Тогда
		Если ЭтоУПФ Тогда
			СправочникМенеджер = Справочники.СтруктурныеЕдиницы;
		Иначе
			СправочникМенеджер = Справочники.СтруктураПредприятия;
		КонецЕсли;
	ИначеЕсли Не ЭтоУПФ И ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.СтруктураПредприятия")
		Или ЭтоУПФ И ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда				
		СправочникМенеджер = Справочники.упоПодразделения;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверный тип параметра ""ЭлементИсточник"" функции
		|""СинхронизироватьПодразделениеИСтруктуруПредприятия"".'");
	КонецЕсли;
	
	ДопИнформацияОбИсточнике 	= Неопределено;
	ЗаписываемыйЭлемент 		= Неопределено;
	НужноЗаписатьСвязь 			= Ложь;
	
	РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементИсточник, 
		"Наименование, ПометкаУдаления, Родитель");
	
	Если ЗначениеЗаполнено(РеквизитыИсточника.Родитель) Тогда
		ЭлементРодитель = СинхронизироватьПодразделениеИСтруктуруПредприятия(РеквизитыИсточника.Родитель, Истина);
	Иначе
		ЭлементРодитель = СправочникМенеджер.ПустаяСсылка();
	КонецЕсли;	
	
	СвязанныйЭлемент = упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСтруктурыИлиПодразделения(
		ЭлементИсточник, 
		ДопИнформацияОбИсточнике);
	
	Если Не ЗначениеЗаполнено(СвязанныйЭлемент) Тогда
		
		ЗаписываемыйЭлемент = НовыйОбъектСИдентификаторомИсходного(СправочникМенеджер, ЭлементИсточник);
		
		Если ЭтоУПФ И СправочникМенеджер = Справочники.СтруктурныеЕдиницы Тогда
			ЗаписываемыйЭлемент.ТипСтруктурнойЕдиницы = 
				ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ТипыСтруктурныхЕдиниц.Подразделение");
			КонецЕсли;
			
		НужноЗаписатьСвязь = Истина;
	Иначе
		ЗаписываемыйЭлемент = СвязанныйЭлемент.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписываемыйЭлемент, РеквизитыИсточника, "Наименование, ПометкаУдаления");
	ЗаписываемыйЭлемент.Родитель = ЭлементРодитель;
	
	Если ЗаписываемыйЭлемент.Модифицированность() Тогда
		ЗаписываемыйЭлемент.ДополнительныеСвойства.Вставить("ВыполняетсяОбработчикЗаполнения", Истина);
		ЗаписываемыйЭлемент.Записать();
	КонецЕсли;
	
	СвязанныйЭлемент = ЗаписываемыйЭлемент.Ссылка;
	
	Если НужноЗаписатьСвязь Тогда
		
		Запись = РегистрыСведений.упоСоответствиеПодразделенийИСтруктурыПредприятия.СоздатьМенеджерЗаписи();
		Если ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.упоПодразделения") Тогда
			Запись.Подразделение 		= ЭлементИсточник;
			Запись.СтруктураПредприятия = СвязанныйЭлемент;
		Иначе // Структура предприятия или структурная единица.
			Запись.Подразделение 		= СвязанныйЭлемент;
			Запись.СтруктураПредприятия = ЭлементИсточник;
		КонецЕсли;
		Запись.Записать();
		
	КонецЕсли;
	
	Возврат СвязанныйЭлемент;
	
КонецФункции

#КонецОбласти

#Область СвязьСтатейБДР_СправочниковУПО_И_ПВХ_ERP

// Синхронизирует все статьи ДР.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция СинхронизироватьВсеСтатьиДР() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СтатьиДоходов.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.СтатьиДоходов КАК СтатьиДоходов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатьиРасходов.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов";
		
	Иначе 
		
		Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Управленческий.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Управленческий КАК Управленческий
		|ГДЕ
		|	Управленческий.ТипСчета <> &ТипСчетаГруппаСчетов";
		
		Запрос.УстановитьПараметр("ТипСчетаГруппаСчетов", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов"));
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СинхронизироватьСтатьиДР(Выборка.Ссылка);
	КонецЦикла;
	
КонецФункции

// Вызывает функцию синхронизации статьи ДР.
//
// Параметры:
//  Статья	 - ПланВидовХарактеристикСсылка.СтатьиРасходов, ПланВидовХарактеристикСсылка.СтатьиДоходов,
//  		   СправочникСсылка.СтатьиЗатрат, СправочникСсылка.упоСтатьиДоходов - статья ERP\PM.
// 
// Возвращаемое значение:
//  СвязаннаяСтатья  - ПланВидовХарактеристикСсылка.СтатьиРасходов, ПланВидовХарактеристикСсылка.СтатьиДоходов,
//  		   СправочникСсылка.СтатьиЗатрат, СправочникСсылка.упоСтатьиДоходов - связанная статья ERP\PM.
//
Функция СинхронизироватьСтатьиДР(Статья) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.НеобходимаСинхронизацияСтатейДР() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статья) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат СоздатьСвязатьСтатьюДР(Статья);
	
КонецФункции 

// Синхронизирует статью ДР.
//
// Параметры:
//  Статья	 - ПланВидовХарактеристикСсылка.СтатьиРасходов, ПланВидовХарактеристикСсылка.СтатьиДоходов,
//  		   СправочникСсылка.СтатьиЗатрат, СправочникСсылка.упоСтатьиДоходов - статья ERP\PM.
// 
// Возвращаемое значение:
//  СвязаннаяСтатья  - ПланВидовХарактеристикСсылка.СтатьиРасходов, ПланВидовХарактеристикСсылка.СтатьиДоходов,
//  		   СправочникСсылка.СтатьиЗатрат, СправочникСсылка.упоСтатьиДоходов - связанная статья ERP\PM.
//
Функция СоздатьСвязатьСтатьюДР(Статья) Экспорт
	
	ТипСтатьи = ТипЗнч(Статья);
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		
		Если ТипСтатьи = Тип("ПланСчетовСсылка.Управленческий") Тогда 
			
			Возврат упоИнтеграцияУПФСервер.СоздатьСвязатьСтатьюДР_изУНФвPM(Статья, Неопределено);
			
		КонецЕсли;
		
	Иначе 
		
		Если ТипСтатьи = Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов") ИЛИ
			ТипСтатьи = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
			
			Возврат упоИнтеграцияEPMСервер.СоздатьСвязатьСтатьюДР_изERPвPM(Статья);
			
		Иначе
			
			Возврат упоИнтеграцияEPMСервер.СоздатьСвязатьСтатьюДР_изPMвERP(Статья);
			
		КонецЕсли;
		
	КонецЕсли; 
		
КонецФункции	

#КонецОбласти

#Область СвязьСценариев

// Создает для каждого сценария ЕРП соответствующий элемент сценария PM.
Процедура СинхронизироватьВсеСценари() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	упоСоответствиеСценариев.СценарийERP КАК СценарийERP
	                      |ПОМЕСТИТЬ втСопоставленныеСценарии
	                      |ИЗ
	                      |	РегистрСведений.упоСоответствиеСценариев КАК упоСоответствиеСценариев
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Сценарии.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Сценарии КАК Сценарии
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втСопоставленныеСценарии КАК втСопоставленныеСценарии
	                      |		ПО Сценарии.Ссылка = втСопоставленныеСценарии.СценарийERP
	                      |ГДЕ
	                      |	втСопоставленныеСценарии.СценарийERP ЕСТЬ NULL
	                      |	И НЕ Сценарии.ПометкаУдаления");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ВыполняетсяОбработчикЗаполнения = Истина;
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			СинхронизироватьСценарии(Выборка.Ссылка, ВыполняетсяОбработчикЗаполнения);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ВызватьИсключение(ТекстОшибки);
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// Создаёт для сценария сквозного версионирования сценарий ERP.
Функция СинхронизироватьСценарии(ЭлементИсточник, ВыполняетсяОбработчикЗаполнения = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭлементИсточник) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоEPM = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();
	Если Не ЭтоEPM Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.упоСценарии") Тогда
		СправочникМенеджер = Справочники.Сценарии;
	ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.Сценарии") Тогда
		СправочникМенеджер = Справочники.упоСценарии;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверный тип параметра ""ЭлементИсточник"" функции
		|""СинхронизироватьСценарии"".'");
	КонецЕсли;
	
	ДопИнформацияОбИсточнике 	= Неопределено;
	ЗаписываемыйЭлемент 		= Неопределено;
	НужноЗаписатьСвязь 			= Ложь;
	
	РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементИсточник, "Наименование, ПометкаУдаления");
	
	СвязанныйЭлемент = упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСценария(ЭлементИсточник, ДопИнформацияОбИсточнике);
	
	Если Не ЗначениеЗаполнено(СвязанныйЭлемент) Тогда
		ЗаписываемыйЭлемент = СправочникМенеджер.СоздатьЭлемент();
		НужноЗаписатьСвязь 	= Истина;
	Иначе
		ЗаписываемыйЭлемент = СвязанныйЭлемент.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписываемыйЭлемент, РеквизитыИсточника);
	
	Если ЗаписываемыйЭлемент.Модифицированность() Тогда
		ЗаписываемыйЭлемент.ДополнительныеСвойства.Вставить("ВыполняетсяОбработчикЗаполнения", Истина);
		ЗаписываемыйЭлемент.Записать();
	КонецЕсли;
	
	СвязанныйЭлемент = ЗаписываемыйЭлемент.Ссылка;
	
	Если НужноЗаписатьСвязь Тогда
		
		Запись = РегистрыСведений.упоСоответствиеСценариев.СоздатьМенеджерЗаписи();
		Если ТипЗнч(ЭлементИсточник) = Тип("СправочникСсылка.упоСценарии") Тогда
			Запись.Сценарий 	= ЭлементИсточник;
			Запись.СценарийERP  = СвязанныйЭлемент;
		Иначе // Сценарий ERP.
			Запись.Сценарий     = СвязанныйЭлемент;
			Запись.СценарийERP  = ЭлементИсточник;
		КонецЕсли;
		Запись.Записать();
		
	КонецЕсли;
	
	Возврат СвязанныйЭлемент;
	
КонецФункции

#КонецОбласти

#Область ДатыЗапретаИзменения

Функция ИмяРазделТрудозатратыФакт()
	
	Возврат "PM_Трудозатраты_Факт";
	
КонецФункции	

Функция ИмяРазделБДРФакт()
	
	Возврат "PM_БДР_Факт";
	
КонецФункции

Функция ИмяРазделДДСФакт()
	
	Возврат "PM_ДДС_Факт";
	
КонецФункции

Функция ИмяРазделОбъемыФакт()
	
	Возврат "PM_ОбъемыРесурсы_Факт";
	
КонецФункции

Процедура ЗаполнитьИсточникиДанныхДляРазделаБДРФакт(ИсточникиДанных)

	ИмяРаздела = ИмяРазделБДРФакт();	
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Доходы.ДатаНачисления", ИмяРаздела);		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Расходы.ДатаНачисления", ИмяРаздела);
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоСинхронизацияФактическихДоходовИРасходов.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Доходы.ДатаНачисления", ИмяРаздела);		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Расходы.ДатаНачисления", ИмяРаздела);

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		ПолноеИмяОбъекта = Метаданные.Документы.упоРаспределениеРасходовПоПроектамФакт.ПолноеИмя();
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "НачалоПериода", ИмяРаздела);		
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ОкончаниеПериода", ИмяРаздела);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляРазделаДДСФакт(ИсточникиДанных)

	ИмяРаздела = ИмяРазделДДСФакт();	
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоРегистрацияФактическихДвиженийДенежныхСредств.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ДвиженияДенежныхСредств.ДатаДвижения",
		ИмяРаздела);
		
	ПолноеИмяОбъекта = Метаданные.Документы.упоСинхронизацияФактическихДвиженийДенежныхСредств.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ДвиженияДенежныхСредств.ДатаДвижения",
		ИмяРаздела);
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляРазделаОбъемыФакт(ИсточникиДанных)

	ИмяРаздела = ИмяРазделОбъемыФакт();
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоРегистрацияФактическиВыполненногоОбъема.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ДоходныеОбъемы.ДатаПоступления", ИмяРаздела);		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "РасходныеОбъемы.ДатаПоступления", ИмяРаздела);
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоРегистрацияФактическихДопЗатрат.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Дата", ИмяРаздела);
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоРегистрацияФактическихЗатратМатРесурсов.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Дата", ИмяРаздела);
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоСинхронизацияФактическиВыполненныхОбъемов.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ДоходныеОбъемы.ДатаПоступления", ИмяРаздела);		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "РасходныеОбъемы.ДатаПоступления", ИмяРаздела);
	
КонецПроцедуры	

Процедура ЗаполнитьИсточникиДанныхДляРазделаТрудозатратыФакт(ИсточникиДанных)

	ИмяРаздела = ИмяРазделТрудозатратыФакт();
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоРаспределениеРабочегоВремениЗаНеделю.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ДеньНачалаНедели", ИмяРаздела);
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоТабельУчетаРабочегоВремени.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Дата", ИмяРаздела);
	
	ПолноеИмяОбъекта = Метаданные.Документы.упоСинхронизацияФактическихТрудозатрат.ПолноеИмя();
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ПроектныеЗадачи.Дата", ИмяРаздела);
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ВнепроектныеЗадачи.Дата", ИмяРаздела);
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "ПотериВремени.Дата", ИмяРаздела);
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалСогласованиеТрудозатрат() Тогда
		ПолноеИмяОбъекта = Метаданные.Документы.упоСогласованиеТрудозатрат.ПолноеИмя();
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, ПолноеИмяОбъекта, "Дата", ИмяРаздела);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет наличие запрета изменения на указанную дату.
//
// Параметры:
//  ДатаПроверки	 - Дата - Проверяемая дата.
//
// Возвращаемое значение:
// Булево - Есть запрет на проверяему дату.
//
Функция ЕстьЗапретПоРазделуНаДату(ИмяРаздела, ДатаПроверки)
	
	ТаблицаДанных = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	СтрокаДанных = ТаблицаДанных.Добавить();
	
	СтрокаДанных.Дата = ДатаПроверки;
	СтрокаДанных.Раздел = ИмяРаздела;
	
	Возврат ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ТаблицаДанных);
	
КонецФункции

#КонецОбласти

#Область УправлениеСвойствами

Процедура ДобавитьИспользованиеПреопределенныхНаборовСвойств(Наборы, ИменаНаборов, Использование)
	
	Для Каждого ИмяНабора Из ИменаНаборов Цикл
		ДобавитьИспользованиеПреопределенногоНабораСвойств(Наборы, ИмяНабора, Использование);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИспользованиеПреопределенногоНабораСвойств(Наборы, ИмяНабора, Использование)
	
	НаборДРС = ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений." + ИмяНабора);
	Если Не ЗначениеЗаполнено(НаборДРС) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = НаборДРС.ИмяПредопределенныхДанных;
	Набор.Идентификатор = НаборДРС.УникальныйИдентификатор();
	Набор.Используется = Использование;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиОбщийСобытийИнтегрированныхКонфигураций

Процедура ПриСозданииНаСервере_ИнтегрированнаяКонфигурация(Форма, Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.Пользователи.Форма.ФормаЭлемента" Тогда
		ДобавитьЭлементы_Пользователи_ФормаЭлемента(Форма);
	ИначеЕсли Форма.ИмяФормы = "Обработка.УдалениеПомеченныхОбъектов.Форма.ОсновнаяФорма" Тогда
		ДобавитьЭлементы_УдалениеПомеченныхОбъектов_ОсновнаяФорма(Форма);
	ИначеЕсли Форма.ИмяФормы = "Обработка.ПанельАдминистрированияБИД.Форма.НастройкаИнтеграцииС1СДокументооборотом" Тогда
		ДобавитьЭлементы_ПанельАдминистрированияБИД_НастройкаИнтеграцииC1СДокументооборотом(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет элементы управления в форму.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма, на которую добавляем.
//
Процедура ДобавитьЭлементы_Пользователи_ФормаЭлемента(ЭтаФорма)
	
	ЕстьПравоДоступа_упоСотрудники = ПравоДоступа("Чтение", Метаданные.Справочники.упоСотрудники);
	Если Не ЕстьПравоДоступа_упоСотрудники Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	// Добавим новый реквизит - динамический список.
	ИмяДССписокПользователей = "ДССписокСотрудниковПользователя";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяДССписокПользователей, 
		Новый ОписаниеТипов("ДинамическийСписок")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СотрудникПоУмолчанию", 
		Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"),,, Истина));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СотрудникПоУмолчаниюДоИзменения", 
		Новый ОписаниеТипов("СправочникСсылка.упоСотрудники")));
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Установим свойства для нового реквизита.
	ЭтаФорма[ИмяДССписокПользователей].ПроизвольныйЗапрос = Истина;
	ЭтаФорма[ИмяДССписокПользователей].ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДиспетчерыСистемы.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(, Пользователь = &Пользователь) КАК ДиспетчерыСистемы
		|ГДЕ
		|	ДиспетчерыСистемы.ФлагУправления";
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма[ИмяДССписокПользователей],
	"Пользователь", ЭтаФорма.Объект.Ссылка);
	
	ЭтаФорма[ИмяДССписокПользователей].ДинамическоеСчитываниеДанных = Ложь;
	ЭтаФорма[ИмяДССписокПользователей].ОсновнаяТаблица = "РегистрСведений.упоДиспетчерыСистемы.СрезПоследних";
	
	// Добавим страницу "Диспетчер".
	НоваяСтрДиспетчер = ЭтаФорма.Элементы.Добавить("СтраницаДиспетчер", Тип("ГруппаФормы"), ЭтаФорма.Элементы.Страницы);
	НоваяСтрДиспетчер.Вид = ВидГруппыФормы.Страница;
	НоваяСтрДиспетчер.Заголовок = НСтр("ru = 'Диспетчер'");
	
	// Добавим поле выбора сотрудника по умолчанию.
	НовыйЭУСотрудникПоУмолчанию = ЭтаФорма.Элементы.Добавить("СотрудникПоУмолчанию", Тип("ПолеФормы"), НоваяСтрДиспетчер);
	НовыйЭУСотрудникПоУмолчанию.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭУСотрудникПоУмолчанию.Заголовок = НСтр("ru = 'Сотрудник по умолчанию'");
	НовыйЭУСотрудникПоУмолчанию.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭУСотрудникПоУмолчанию.ПутьКДанным = "СотрудникПоУмолчанию";
	НовыйЭУСотрудникПоУмолчанию.УстановитьДействие("НачалоВыбора", "Подключаемый_упоСотрудникПоУмолчаниюНачалоВыбора");
	НовыйЭУСотрудникПоУмолчанию.УстановитьДействие("ПриИзменении", "Подключаемый_упоСотрудникПоУмолчаниюПриИзменении");
	НовыйЭУСотрудникПоУмолчанию.РедактированиеТекста = Ложь;
	НовыйЭУСотрудникПоУмолчанию.КнопкаОчистки = Истина;
	НовыйЭУСотрудникПоУмолчанию.КнопкаВыпадающегоСписка = Ложь;
	НовыйЭУСотрудникПоУмолчанию.КнопкаВыбора = Истина;
	НовыйЭУСотрудникПоУмолчанию.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	
	// Установим сотрудника по умолчанию, если он был сохранен ранее.
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда
		СотрудникПользователяПоУмолчанию = упоПользователиВызовСервера.обПолучитьНастройкуПользователя(
			"СотрудникПоУмолчанию", 
			ЭтаФорма.Объект.Ссылка);
	Иначе
		СотрудникПользователяПоУмолчанию = Неопределено
	КонецЕсли;
	
	ЭтаФорма["СотрудникПоУмолчанию"] = ?(СотрудникПользователяПоУмолчанию = Неопределено, 
		Справочники.упоСотрудники.ПустаяСсылка(), СотрудникПользователяПоУмолчанию);
	ЭтаФорма["СотрудникПоУмолчаниюДоИзменения"] = ЭтаФорма["СотрудникПоУмолчанию"];
	
	// Добавим поле выбора основного трудового ресурса.
	НовыйЭУСотрудникПоУмолчанию = ЭтаФорма.Элементы.Добавить("упоОсновнойТрудовойРесурс", 
		Тип("ПолеФормы"), НоваяСтрДиспетчер);
	НовыйЭУСотрудникПоУмолчанию.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭУСотрудникПоУмолчанию.ПутьКДанным = "Объект.упоОсновнойТрудовойРесурс";
	
	// Добавим ЭУ СписокСотрудниковПользователя.
	НовыйЭУТаблицаСотрудников = ЭтаФорма.Элементы.Добавить("СписокСотрудниковПользователя", 
		Тип("ТаблицаФормы"), НоваяСтрДиспетчер);
	НовыйЭУТаблицаСотрудников.ПутьКДанным = ИмяДССписокПользователей;
	
	// Добавим колонку для ЭУ.
	НоваяКолонкаТаблицыСотрудников = ЭтаФорма.Элементы.Добавить("СписокСотрудниковПользователяСотрудник", 
		Тип("ПолеФормы"), НовыйЭУТаблицаСотрудников);
	НоваяКолонкаТаблицыСотрудников.ПутьКДанным = ИмяДССписокПользователей + ".Сотрудник";
	
	// Добавим условное оформление. Текущий сотрудник должен быть жирный.
	НовыйЭлементУсловногоОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", 
		Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина));
	ОформляемоеПоле 	 		 = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле 		 = Новый ПолеКомпоновкиДанных("СписокСотрудниковПользователя");
	ЭлементОтбора 				 = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяДССписокПользователей + ".Сотрудник");
	ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.упоТекущийСотрудник;
	
КонецПроцедуры

Процедура ДобавитьЭлементы_УдалениеПомеченныхОбъектов_ОсновнаяФорма(Форма)
	
	Элементы = Форма.Элементы;
	
	// ******   Группа формы "упоГруппаИнформацияPM"    ***********
	НовыйЭлемент = Элементы.Вставить("упоГруппаИнформацияPM", Тип("ГруппаФормы"), , Элементы.КоманднаяПанельФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Группа Информация PM'");
	НовыйЭлемент.РазрешитьИзменениеСостава = Ложь;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	// ******   Декорация формы "упоНадписьИнформация"    ***********
	НовыйЭлемент = Элементы.Добавить("упоНадписьИнформация", Тип("ДекорацияФормы"), Элементы.упоГруппаИнформацияPM);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.АвтомаксимальнаяШирина = Ложь;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Для удаления проектов следует использовать'");
	
	// ******   Декорация формы "упоНадписьСсылка"    ***********
	НовыйЭлемент = Элементы.Добавить("упоНадписьСсылка", Тип("ДекорацияФормы"), Элементы.упоГруппаИнформацияPM);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.АвтомаксимальнаяШирина = Ложь;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Заголовок = НСтр("ru = 'Удаление проекта и его элементов'");
	НовыйЭлемент.УстановитьДействие("Нажатие","Подключаемый_упоОткрытьОбработкуУдалениеПроектаНажатие");
	
КонецПроцедуры

Процедура ДобавитьЭлементы_ПанельАдминистрированияБИД_НастройкаИнтеграцииC1СДокументооборотом(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("ДекорацияОписаниеНазначенияФормы") <> Неопределено Тогда
		Элементы.ДекорацияОписаниеНазначенияФормы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ТекстПодсказки = НСтр("ru = 'Пользовательская документация по работе с подсистемой ""Интеграция с 1С:Документооборот"" размещена на сайте 1С:ИТС в разделе 
			|""Инструкции по разработке на 1С - Библиотека интеграции с 1С:Документооборотом - Библиотека интеграции с 1С:Документооборотом <Редакция библиотеки> - Пользовательская документация"".
			|Редакция библиотеки указана в файле поставки ""Версии библиотек.txt"", а также в разделе программы 
			|""Администрирование - Параметры подсистемы PM - Версии подсистем конфигурации - БиблиотекаИнтеграцииС1СДокументооборотом"".'");
		Элементы.ДекорацияОписаниеНазначенияФормы.РасширеннаяПодсказка.Заголовок = ТекстПодсказки;
		Элементы.ДекорацияОписаниеНазначенияФормы.РасширеннаяПодсказка.АвтомаксимальнаяШирина = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
