////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, позволяющие идентифицировать конфигурацию.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. упоИнтеграцияВызовСервера.ЭтоУПРОФ
//
Функция ЭтоУПРОФ() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоУПРОФ();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоУПО
//
Функция ЭтоУПО() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоУПО();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоPMO
//
Функция ЭтоPMO() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоPMO();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоPM_Корп
//
Функция ЭтоPM_Корп() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоPM_Корп();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоPM_Проф
//
Функция ЭтоPM_Проф() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоPM_Проф();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоEPM
//
Функция ЭтоEPM() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоEPM();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоEPM_2_5
//
Функция ЭтоEPM_2_5(ЭтоEPM = Неопределено) Экспорт
		
	Возврат упоИнтеграцияВызовСервера.ЭтоEPM_2_5(ЭтоEPM);
	
КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоERPУХ
//
Функция ЭтоERPУХ() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоERPУХ();
	
КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоDev2
//
Функция ЭтоDev2() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоDev2();
	
КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоУПФ
//
Функция ЭтоУПФ() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоУПФ();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоКАPM
//
Функция ЭтоКАPM() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоКАPM();

КонецФункции

// См. упоИнтеграцияВызовСервера.ЭтоЧистыйPM
//
Функция ЭтоЧистыйPM() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ЭтоЧистыйPM();

КонецФункции

// Возвращает имя выбранного пользователем стиля оформления.
//  Или Неопределено, если не выбран.
// 
// Возвращаемое значение:
//  Строка, Неопределено - имя
//
Функция ИмяТекущегоСтиляОформления() Экспорт
	
	Возврат ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("Конфигурация/Оформление", "СтильОформления");
	
КонецФункции

// См. упоИнтеграцияВызовСервера.РасширениеПодключено
//
Функция РасширениеПодключено(Имя) Экспорт 
	
	Возврат упоИнтеграцияВызовСервера.РасширениеПодключено(Имя);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьОписаниеПодсистемыУП() Экспорт
	
	ОписаниеПодсистемы = упоФункцииБСП.ПолучитьСтруктуруОписанияПодсистемы();
	
	ОписаниеПодсистемы.Вставить("Синоним", "1С:ERP Управление предприятием 2");
	
	#Если Сервер Тогда
	МодульОбновлениеИнформационнойБазыУП = ОбщегоНазначения.ОбщийМодуль("ОбновлениеИнформационнойБазыУП");
	МодульОбновлениеИнформационнойБазыУП.ПриДобавленииПодсистемы(ОписаниеПодсистемы);
	#КонецЕсли 
	
	Возврат ОписаниеПодсистемы;
	
КонецФункции

Функция ПолучитьОписаниеОсновнойПодсистемыКонфигурации() Экспорт

	МассивОписанийПодсистем = упоФункцииБСПСерверПовтИсп.ПолучитьМассивОписанийПодсистемКонфигурации();
	
	ОписаниеОсновнойПодсистемы = Неопределено;
	
	Для Каждого ОписаниеПодсистемы Из МассивОписанийПодсистем Цикл
		Если ОписаниеПодсистемы.Свойство("ОсновнаяПодсистема") И ОписаниеПодсистемы.ОсновнаяПодсистема Тогда
			ОписаниеОсновнойПодсистемы = ОписаниеПодсистемы;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеОсновнойПодсистемы;
	
КонецФункции

#КонецОбласти
