
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки
		
		СтруктураОбязательныхПолей.Вставить("Проект");
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадача");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
//
// Параметры:
//  ДанныеДокумента	 - Структура - не используется.
//  Отказ			 - Булево	 - Признак отказа от выполнения операции.
//  Заголовок		 - Строка	 - Содержит заголовок сообщения.
//
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать.
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_".
	
	// Правила для регистра "РуководителиПроектныхЗадач".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоРуководителиПроектныхЗадач.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("СменаРуководителя", ПравилаДвижения);
	
	ПравилаДвижения.Вставить("РуководительПроектнойЗадачи", "РуководительПроектнойЗадачи");
	ПравилаДвижения.Вставить("ПроектнаяЗадача"            , "ПроектнаяЗадача");
	
	Возврат ПравилаНаложения; 

КонецФункции
 
// Получает подготовленные данные для движений по регистрам
//  и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	// Бизнес-логика дополнительной обработки данных движений по регистрам.
	                                     
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание	- Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ДокументОснование = Основание;
		Проект = Основание.Проект;
		ПроектнаяЗадача = Основание;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если АвтоматическоеНазначениеРПЗВключено() Тогда				
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	СнимаетсяТекущийРуководительЗадачи = Не ЗначениеЗаполнено(РуководительПроектнойЗадачи);
	упоИерархияИПолномочияСервер.АктуализироватьРуководителейПроектныхЗадачПоИерархии(ПроектнаяЗадача, 
		РуководительПроектнойЗадачи, СнимаетсяТекущийРуководительЗадачи);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	Если АвтоматическоеНазначениеРПЗВключено() Тогда				
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	упоИерархияИПолномочияСервер.АктуализироватьРуководителейПроектныхЗадачПоИерархии(ПроектнаяЗадача);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Функция АвтоматическоеНазначениеРПЗВключено()
			
	АвтоматическоеНазначениеРПЗВключено = Ложь;
	
	Если ДополнительныеСвойства.Свойство("ОтключитьПроверкуАвтоматическогоНазначенияРПЗ")
		И ДополнительныеСвойства.ОтключитьПроверкуАвтоматическогоНазначенияРПЗ Тогда
		Возврат АвтоматическоеНазначениеРПЗВключено;
	КонецЕсли;
	
	ПроектныеОпции = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	НазначатьРСПОсновнойРолиКакРПЗ = ПроектныеОпции.НазначатьРСПОсновнойРолиКакРПЗ;
			
	Если НазначатьРСПОсновнойРолиКакРПЗ Тогда				
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Версия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
		Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение
		               |ИЗ
		               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		               |			,
		               |			Версия = &Версия
		               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		               |ГДЕ
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Основной";		
		Результат = Запрос.Выполнить();		
		
		АвтоматическоеНазначениеРПЗВключено = Не Результат.Пустой();
		
	КонецЕсли;	
	
	Если АвтоматическоеНазначениеРПЗВключено Тогда
		ТекстСообщения = 
		НСтр("ru = 'Для проектной задачи документа используется автоматическое назначение РПЗ (включена проектная опция 
		|""Автоматически назначать руководителя подразделения основной роли руководителем проектной задачи"" 
		|и назначена основная роль). Ручное изменение руководителя проектной задачи через документ запрещено.'"); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат АвтоматическоеНазначениеРПЗВключено;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли