
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);	
	ДиалогВыбораФайла.Фильтр = "(*.xml)|*.xml";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		 ПоказателиВXML  =  ВыполнитьВыгрузкуПоказателейНаСервере(ПараметрКоманды);

		 ТД = Новый ТекстовыйДокумент;
		 ТД.УстановитьТекст(ПоказателиВXML);
		 ТД.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);
		 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьВыгрузкуПоказателейНаСервере(МассивПоказателей)
	
	ОбработкаВыгрузки = Обработки.упоВыгрузкаПоказателейПроектов.Создать();
	Возврат ОбработкаВыгрузки.ВыполнитьВыгрузкуПоказателей(МассивПоказателей);
	
КонецФункции

#КонецОбласти