////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с пользователями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получить массив диспетчеров сотрудника
//
// Параметры:
//  Сотрудник	 - СправочникСылка.упоСотрудники
// 
// Возвращаемое значение:
//  Массив - пользователи-диспетчеры сотрудника.
//
Функция ПолучитьМассивДиспетчеровСотрудника(Сотрудник) Экспорт
	
	Диспетчеры = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Диспетчеры.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(, Сотрудник = &Сотрудник) КАК Диспетчеры
	               |ГДЕ
	               |	Диспетчеры.ФлагУправления";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Диспетчеры.Добавить(Выборка.Пользователь);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Диспетчеры;
	
КонецФункции

// Получить основной трудовой ресурс пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  СправочникСсылка.упоТрудовыеРесурсы
//
Функция ПолучитьОсновнойТрудовойРесурсПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.упоОсновнойТрудовойРесурс КАК упоОсновнойТрудовойРесурс
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Ссылка = &Пользователь";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		ОсновнойТР = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОсновнойТР = Выборка.упоОсновнойТрудовойРесурс;
	КонецЕсли;
	
	Возврат ОсновнойТР;
	
КонецФункции

// Установить основной трудовой ресурс пользователя
//
// Параметры:
//  Пользователь	 - СправочникСсылка.Пользователи
//  ТрудовойРесурс	 - СправочникСсылка.упоТрудовыеРесурсы
//
Процедура УстановитьОсновнойТрудовойРесурсПользователя(Пользователь, ТрудовойРесурс) Экспорт
	
	ТекТрудовойРесурс = ПолучитьОсновнойТрудовойРесурсПользователя(Пользователь);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТекТрудовойРесурс <> ТрудовойРесурс Тогда
		
		обПользователь = Пользователь.ПолучитьОбъект();
		обПользователь.упоОсновнойТрудовойРесурс = ТрудовойРесурс;
		обПользователь.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает сотрудника пользователя по умолчанию.
//
// Параметры:
//  Сотрудник	 - СправочникСсылка.упоСотрудники	 - сотрудник пользователя по умолчанию.
//  Пользователь - СправочникСсылка.Пользователи	 - пользователь, для которого устанавливается сотрудник по умолчанию.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники - установленный сотрудник пользователя по умолчанию.
//
Функция УстановитьСотрудникаПользователяПоУмолчанию(Сотрудник, Пользователь) Экспорт
	
	Успех = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			Пользователь.ИдентификаторПользователяИБ);
	Исключение
		ПользовательИБ = Неопределено;
	КонецПопытки;
	
	Если ПользовательИБ <> Неопределено Тогда
		СписокСотрудниковПользователя = упоИерархияИПолномочияСервер.СотрудникиДиспетчера(Пользователь);
		Если Не ЗначениеЗаполнено(Сотрудник) 
			Или Не СписокСотрудниковПользователя.НайтиПоЗначению(Сотрудник) = Неопределено Тогда
			ХранилищеОбщихНастроек.Сохранить("НастройкиДиспетчераПользователя", "СотрудникПоУмолчанию", 
				Сотрудник, , ПользовательИБ.Имя);
			Успех = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции

#Область НастройкиПользователя

// Возвращает значение персональной настройки пользователя.
//
// Параметры:
//  Настройка					 - Строка		 - имя настройки.
//  Пользователь				 - СправочникСсылка.Пользователи - пользователь.
//  ОбновитьКэшируемыеЗначения	 - Булево		 - признак необходимости обновления связанных параметров сеанса.
//  	Выставляется в Ложь, если список сотрудников получается не для текущего пользователя системы
// 
// Возвращаемое значение:
//  Произвольный - Значение укзанной настройки пользователя.
//
Функция ПолучитьНастройкуПользователя(Настройка, Пользователь = Неопределено, ОбновитьКэшируемыеЗначения = Истина) Экспорт
	
	ИмяПользователяИБ = Неопределено;
	
	Если Пользователь <> Неопределено Тогда
		Попытка
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
				Пользователь.ИдентификаторПользователяИБ);
			ИмяПользователяИБ = ПользовательИБ.Имя;
		Исключение
		КонецПопытки;
		ПользовательСсылка = Пользователь;
	Иначе
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Настройка = "СотрудникПоУмолчанию" Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		СотрудникПоУмолчанию = ХранилищеОбщихНастроек.Загрузить("НастройкиДиспетчераПользователя", 
			"СотрудникПоУмолчанию",
			, 
			ИмяПользователяИБ);
		
		Если Не ЗначениеЗаполнено(СотрудникПоУмолчанию) Тогда
			
			СписокСотрудников = упоИерархияИПолномочияСервер.СотрудникиДиспетчера(Пользователь, 
				ОбновитьКэшируемыеЗначения);
			
			Если ЗначениеЗаполнено(СписокСотрудников) Тогда
				
				МассивСотрудников = СписокСотрудников.ВыгрузитьЗначения();
				
				СотрудникНайден = упоИерархияИПолномочияВызовСервера.обПодобратьДиспетчераПоИмени(
					МассивСотрудников,
					Пользователь.Наименование, 
					СотрудникПоУмолчанию);
				
				Если Не СотрудникНайден Тогда
					СотрудникПоУмолчанию = СписокСотрудников.Получить(0).Значение;
				КонецЕсли; 
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СотрудникПоУмолчанию) Тогда
				
				ХранилищеОбщихНастроек.Сохранить("НастройкиДиспетчераПользователя", "СотрудникПоУмолчанию", 
					СотрудникПоУмолчанию,,ИмяПользователяИБ); 
				
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат СотрудникПоУмолчанию;
		
	ИначеЕсли Настройка = "НачалоПериодаАнализаПоВехам"
		Или Настройка = "КонецПериодаАнализаПоВехам" Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли Настройка = "СпособПривязкиДопЗатратКПериоду" Тогда 
		
		Возврат Перечисления.упоСпособПривязкиДопЗатрат.КЗавершениюЗадачи;
		
	ИначеЕсли Настройка = "РазрешитьПолучатьЗакрытыеПроектныеЗадачи"
		Или Настройка = "РазрешитьПолучатьЗакрытыеРабочиеЗадания" 
		Или Настройка = "ОткрыватьПоследнийШаблон" Тогда 
		
		Возврат Ложь;
		
	ИначеЕсли Настройка = "ИспользоватьРасшифровкуТрудозатрат" Или Настройка = "ИсключитьПомеченные" Тогда 
		
		Возврат Истина;
		
	ИначеЕсли Настройка = "НачалоПериодаАнализаПоВехам" Или Настройка = "КонецПериодаАнализаПоВехам" Тогда 
		
		Возврат 0;
		
	ИначеЕсли Настройка = "РабочийКалендарьДляРасчетаШаблонов" Тогда 
		
		Возврат Справочники.упоРабочиеКалендари.ПустаяСсылка();
		
	ИначеЕсли Настройка = "упоФорматСуммВСтруктуреПроектаКакВОтчетах" Тогда 
		
		упоФорматСуммВСтруктуреПроектаКакВОтчетах = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоУпрощенныйВводСтруктурыПроекта", 
			"упоФорматСуммВСтруктуреПроектаКакВОтчетах", 
			, 
			ИмяПользователяИБ);
		Если упоФорматСуммВСтруктуреПроектаКакВОтчетах = Неопределено Тогда
			упоФорматСуммВСтруктуреПроектаКакВОтчетах = Истина;
		КонецЕсли;
		
		Возврат упоФорматСуммВСтруктуреПроектаКакВОтчетах;
		
	ИначеЕсли Настройка = "упоФорматСуммВСтруктуреПроекта" Тогда 
		
		упоФорматСуммВСтруктуреПроекта = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоУпрощенныйВводСтруктурыПроекта", 
			"упоФорматСуммВСтруктуреПроекта",
			,
			ИмяПользователяИБ);
		Если упоФорматСуммВСтруктуреПроекта = Неопределено Тогда
			упоФорматСуммВСтруктуреПроекта = "ЧДЦ='2'";
		КонецЕсли;
		
		Возврат упоФорматСуммВСтруктуреПроекта;
		
	ИначеЕсли Настройка = "упоФорматКоличестваВСтруктуреПроектаКакВОтчетах" Тогда 
		
		упоФорматКоличестваВСтруктуреПроектаКакВОтчетах = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоУпрощенныйВводСтруктурыПроекта", 
			"упоФорматКоличестваВСтруктуреПроектаКакВОтчетах", 
			, 
			ИмяПользователяИБ);
		Если упоФорматКоличестваВСтруктуреПроектаКакВОтчетах = Неопределено Тогда
			упоФорматКоличестваВСтруктуреПроектаКакВОтчетах = Истина;
		КонецЕсли;
		
		Возврат упоФорматКоличестваВСтруктуреПроектаКакВОтчетах;
		
	ИначеЕсли Настройка = "упоФорматКоличестваВСтруктуреПроекта" Тогда 
		
		упоФорматКоличестваВСтруктуреПроекта = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоУпрощенныйВводСтруктурыПроекта", 
			"упоФорматКоличестваВСтруктуреПроекта",
			,
			ИмяПользователяИБ);
		Если упоФорматКоличестваВСтруктуреПроекта = Неопределено Тогда
			упоФорматКоличестваВСтруктуреПроекта = "ЧДЦ='2'";
		КонецЕсли;
		
		Возврат упоФорматКоличестваВСтруктуреПроекта;
		
	ИначеЕсли Настройка = "ЗагружатьПоказателиПриОткрытииПанелиРуководителя" Тогда 
		
		ЗагружатьПоказателиПриОткрытииПанелиРуководителя = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоПанельПоказателей", 
			"ЗагружатьПоказателиПриОткрытииПанелиРуководителя",
			,
			ИмяПользователяИБ);
		Если ЗагружатьПоказателиПриОткрытииПанелиРуководителя = Неопределено Тогда
			ЗагружатьПоказателиПриОткрытииПанелиРуководителя = Ложь;
		КонецЕсли;
		
		Возврат ЗагружатьПоказателиПриОткрытииПанелиРуководителя;
		
	ИначеЕсли Настройка = "ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения" Тогда 
		
		ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоПанельРуководителяПодразделения", 
			"ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения", 
			, 
			ИмяПользователяИБ);
		Если ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения = Неопределено Тогда
			ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения = Ложь;
		КонецЕсли;
		
		Возврат ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения;
		
	ИначеЕсли Настройка = "упоМакетОформленияПанелиРуководителяПодразделения" Тогда 
		
		упоМакетОформленияПанелиРуководителяПодразделения = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоПанельРуководителяПодразделения", 
			"упоМакетОформленияПанелиРуководителяПодразделения", 
			, 
			ИмяПользователяИБ);
		Если упоМакетОформленияПанелиРуководителяПодразделения = Неопределено Тогда
			упоМакетОформленияПанелиРуководителяПодразделения = "КакВОтчетах";
		КонецЕсли;
		
		Возврат упоМакетОформленияПанелиРуководителяПодразделения;
		
	ИначеЕсли Настройка = "упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП" Тогда 
		
		упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоПанельРуководителяПодразделения", 
			"упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП", 
			, 
			ИмяПользователяИБ);
		Если упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП = Неопределено Тогда
			упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП = "КакВОтчетах";
		КонецЕсли;
		
		Возврат упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП;
		
	ИначеЕсли Настройка = "упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах" Тогда 
		
		упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоПанельРуководителяПодразделения", 
			"упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах", 
			, 
			ИмяПользователяИБ);
		Если упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах = Неопределено Тогда
			упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах = Истина;
		КонецЕсли;
		
		Возврат упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах;
		
	ИначеЕсли Настройка = "упоФорматКоличестваВПанелиРуководителяПодразделения" Тогда 
		
		упоФорматКоличестваВПанелиРуководителяПодразделения = ХранилищеОбщихНастроек.Загрузить(
			"Обработка.упоПанельРуководителяПодразделения", 
			"упоФорматКоличестваВПанелиРуководителяПодразделения",
			,
			ИмяПользователяИБ);
		Если упоФорматКоличестваВПанелиРуководителяПодразделения = Неопределено Тогда
			упоФорматКоличестваВПанелиРуководителяПодразделения = "ЧДЦ='2'";
		КонецЕсли;
		
		Возврат упоФорматКоличестваВПанелиРуководителяПодразделения;
		
	ИначеЕсли Настройка = "ЗадержкаПересчетаСроковПослеДобавленияЗадачи" Тогда
		
		ЗадержкаПересчетаСроковПослеДобавленияЗадачиЗначениеВБазе = ХранилищеОбщихНастроек.Загрузить(
			"упоУпрощенныйВводСтруктурыПроекта", 
			"ЗадержкаПересчетаСроковПослеДобавленияЗадачи",
			,
			ИмяПользователяИБ);
		Если ЗадержкаПересчетаСроковПослеДобавленияЗадачиЗначениеВБазе = Неопределено Тогда 
			ЗадержкаПересчетаСроковПослеДобавленияЗадачи = 5;
			ХранилищеОбщихНастроек.Сохранить("упоУпрощенныйВводСтруктурыПроекта", 
				"ЗадержкаПересчетаСроковПослеДобавленияЗадачи",
				ЗадержкаПересчетаСроковПослеДобавленияЗадачи,
				,
				ИмяПользователяИБ);
		Иначе
			ЗадержкаПересчетаСроковПослеДобавленияЗадачи = ЗадержкаПересчетаСроковПослеДобавленияЗадачиЗначениеВБазе;
		КонецЕсли;
		
		Возврат ЗадержкаПересчетаСроковПослеДобавленияЗадачи;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
 
// Возращает строку формата из персональной настройки пользователя.
//
// Параметры:
//  ИмяНастройки   - Строка - имя персональной настройки пользователя.
//  ЭтоКолонкиСумм - Булево - признак, что это колонка суммы или колонка количества.
//
// Возвращаемое значение:
//   Строка  - формат колонки из персональной настройки пользователя.
//
Функция ФорматКолонокИзНастроекПользователя(ИмяНастройки, ЭтоКолонкиСумм = Истина) Экспорт
	
	ФорматКолонок = Неопределено;
	ФорматКолонокКакВОтчетах = упоПользователи.ПолучитьНастройкуПользователя(ИмяНастройки + "КакВОтчетах");
	
	Если ФорматКолонокКакВОтчетах Тогда
		СтруктураОформлениеОтчета = упоТиповыеОтчетыСервер.ПолучитьНастройкиОформленияОтчета();
		Если ЭтоКолонкиСумм Тогда
			ФорматКолонок = СтруктураОформлениеОтчета.ФорматСумм;
		Иначе
			ФорматКолонок = СтруктураОформлениеОтчета.ФорматКоличества;
		КонецЕсли;
	Иначе
		ФорматКолонок = упоПользователи.ПолучитьНастройкуПользователя(ИмяНастройки);
	КонецЕсли;
	
	Возврат ФорматКолонок;
	
КонецФункции

// См. Обработки.НастройкиПользователей.ПропуститьНастройку
// Добавляет исключения копирования.
//
// Параметры:
//  ИсключенияПоКлючуОбъекта	 - Массив - Наименования исключаемых объектов настроек
//  ИсключенияПоКлючуНастроек	 - Массив - Наименования исключаемых настроек
//
Процедура ПропуститьНастройкуКопирования(ИсключенияПоКлючуОбъекта, ИсключенияПоКлючуНастроек) Экспорт 
	
	// Исключения. Настройки, которые нельзя копировать.
	ИсключенияПоКлючуОбъекта.Добавить("НастройкиДиспетчераПользователя");
	ИсключенияПоКлючуНастроек.Добавить("СотрудникПоУмолчанию");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписок

// Обработчик события обработка проведения подписки упоИзменениеДиспетчераОбработкаПроведения.
//
// Параметры:
//  Источник  - ДокументОбъект - документ ERP.
//  Отказ  - Булево - флаг отказа.
//  РежимПроведения  - РежимПроведенияДокумента - режим проведения документа.
//
Процедура ИзменениеДиспетчераОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	// Явная запись перед запросом к регистру.
	Источник.Движения.упоДиспетчерыСистемы.Записать();
	
	ОбновитьДиспетчеровВПараметрахСеанса();
	
КонецПроцедуры

// Обработчик события обработка удаления проведения подписки упоИзменениеДиспетчераОбработкаУдаленияПроведения.
//
// Параметры:
//  Источник  - ДокументОбъект - документ ERP.
//  Отказ  - Булево - флаг отказа.
//
Процедура ИзменениеДиспетчераОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ОбновитьДиспетчеровВПараметрахСеанса();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьДиспетчеровВПараметрахСеанса()
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	упоИерархияИПолномочияСервер.СотрудникиДиспетчера(ТекПользователь, Истина);
	
КонецПроцедуры

#КонецОбласти