
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	упоФункцииЗащитыСервер.МожноИспользоватьОбъектИспользующийЗащищенныйКод(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
	// Если документ введен не на основании,
	// то интерфейс должен отработать эту ситуацию.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
	УстановитьВидимость();
	
	// Временная заглушка
	Элементы.СтраницаОшибки.Видимость = Ложь;
	
	УстановитьЗначенияДопКолонокВИсключения();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Отказ Тогда
		ОбновитьДатуДокумента();		
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьЗначенияДопКолонокВИсключения();
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.НадписьДокументОснованиеНажатие(Объект, ЭтаФорма, "Проект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПланироватьОтДатыОкончанияПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьДатуДокументаПриИзменении(Элемент)
	
	ОбновитьДатуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		
		Для каждого ВыбрЗнач Из ВыбранноеЗначение Цикл
						
			ТекЗнач = ВыбрЗнач.Значение;
			
			ИскомыеСтроки = Объект.Исключения.НайтиСтроки(Новый Структура("Задача", ТекЗнач));
			Если ИскомыеСтроки.Количество() = 0 Тогда
				НоваяСтрока = Объект.Исключения.Добавить();
				НоваяСтрока.Задача = ТекЗнач;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьЗначенияДопКолонокВИсключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗначенияДопКолонокВИсключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Задача",
		Объект.Исключения, ЭтаФорма);
	
	УстановитьЗначенияДопКолонокВИсключения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИсключенияПоРучномуВводу(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяТЧ", "Исключения");
	ПараметрыЗаполнения.Вставить("ТипЗаполнения", "ПоПлану");
	ПараметрыЗаполнения.Вставить("ПоДаннымРегистра", Ложь);
	
	ЗаполнитьТабличнуюЧастьДокумента(ПараметрыЗаполнения);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсключенияПоФактуВыполнения(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяТЧ", "Исключения");
	ПараметрыЗаполнения.Вставить("ТипЗаполнения", "ПоФакту");
	ПараметрыЗаполнения.Вставить("ПоДаннымРегистра", Неопределено);
	
	ЗаполнитьТабличнуюЧастьДокумента(ПараметрыЗаполнения);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсключенияПоТекущемуПлану(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяТЧ", "Исключения");
	ПараметрыЗаполнения.Вставить("ТипЗаполнения", "ПоПлану");
	ПараметрыЗаполнения.Вставить("ПоДаннымРегистра", Истина);
	
	ЗаполнитьТабличнуюЧастьДокумента(ПараметрыЗаполнения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодобратьИсключения(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
		  	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(ИмяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	АдресХранилища = "";
	
	Если ИмяКоманды = "ПодобратьИсключения" Тогда
		
		ПараметрыПодбора.ЭлементВладелец = Элементы.Исключения;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Документы.упоПроектнаяЗадача";
        ТаблицаФормы = Объект.Исключения;
	    ИмяКолонки = "Задача"; 
				
	КонецЕсли;
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(ИмяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
			
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
		
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.
	тОбъект = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);
	тОбъект.ОбработкаЗаполнения(ВыбранноеЗначение);
	ЗначениеВДанныеФормы(тОбъект, Объект);
	
	// И приведем гиперссылку в правильный вид.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
	УстановитьДатуРасчетаПроекта();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ГруппаПланироватьОтДатыОкончания.Видимость = Истина;
	Элементы.НадписьИнформационная.Видимость = Истина;
	
	Если Объект.ПланироватьОтДатыОкончания Тогда
		Элементы.НадписьИнформационная.Заголовок = "Все задачи начинаются как можно позже.";
		Элементы.ДатаРасчетаПроекта.Заголовок = "Дата окончания проекта";
	Иначе
		Элементы.НадписьИнформационная.Заголовок = "Все задачи начинаются как можно раньше.";
		Элементы.ДатаРасчетаПроекта.Заголовок = "Дата начала проекта";
	КонецЕсли;
	                  
КонецПроцедуры

// Заполняет таблицу исключений проектными задачами с установленным
// признаком "ручной ввод сроков".
//
// Параметры:
//  ПоДаннымРегистра  - Булево - указывает, на основании каких именно данных
// 						заполнять табличную часть (из документа или из регистра).
//
&НаСервере
Процедура ЗаполнитьТаблицуИсключений(ПараметрыЗаполнения)

	Проект = Объект.Проект;
	
	Если Не ЗначениеЗаполнено(Проект) Тогда      
		обПредупреждение(НСтр("ru = 'Сначала необходимо выбрать проект.'"), 120);
		Возврат;
	КонецЕсли; 
	
	Если ПараметрыЗаполнения.ТипЗаполнения = "ПоПлану" Тогда
		
		ПоДаннымРегистра = ПараметрыЗаполнения.ПоДаннымРегистра;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РегСроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	РегСроки.ДатаНачалаПлан КАК ДатаНачалаРег,
		               |	РегСроки.ДатаЗавершенияПлан КАК ДатаЗавершенияРег
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК РегСроки
		               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = РегСроки.ПроектнаяЗадача
		               |ГДЕ
		               |	(&ПоДаннымРегистра
		               |			ИЛИ упоСвойстваПроектныхЗадачСрезПоследних.РучнойВводСроков)
		               |	И упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проведен";
					   
		ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);					   
					   
		ПараметрыЗапроса = Новый Структура("Проект, ПоДаннымРегистра, ТекВерсия", Проект, ПоДаннымРегистра, ТекВерсия);
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ПЗ = Выборка.ПроектнаяЗадача;
			
			ПараметрыОтбора = Новый Структура("Задача", ПЗ);
			НайденныеСтроки = Объект.Исключения.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()<>0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.Исключения.Добавить();
			НоваяСтрока.Задача = ПЗ;
			    
			НоваяСтрока.ДатаНачала = Выборка.ДатаНачалаРег;
			НоваяСтрока.ДатаЗавершения = Выборка.ДатаЗавершенияРег;
				
		КонецЦикла;
		
	ИначеЕсли ПараметрыЗаполнения.ТипЗаполнения = "ПоФакту" Тогда	
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РегСроки.ПроектнаяЗадача КАК Задача,
		               |	РегСроки.ДатаНачалаПлан КАК ДатаНачала,
		               |	РегСроки.ДатаЗавершенияПлан КАК ДатаЗавершения,
		               |	ИСТИНА КАК Завершенная
		               |ИЗ
		               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК РегСроки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК РегСтатусы
		               |		ПО РегСроки.ПроектнаяЗадача = РегСтатусы.ПроектнаяЗадача
		               |ГДЕ
		               |	(РегСтатусы.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена)
		               |			ИЛИ РегСтатусы.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Закрыта))";
		
		Запрос.УстановитьПараметр("Версия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
		Запрос.УстановитьПараметр("Проект", Проект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПараметрыОтбора = Новый Структура("Задача", Выборка.Задача);
			НайденныеСтроки = Объект.Исключения.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()<>0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.Исключения.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьЗначенияДопКолонокВИсключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДатуДокумента()
	
	Если Объект.ОбновлятьДатуДокумента Тогда      
		Если НЕ ЭтаФорма.ТолькоПросмотр Тогда      
			Объект.Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли; 
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияДопКолонокВИсключения()
	
	Проект = Объект.Проект;
	
	Если НЕ Проект.Пустая() Тогда      
		НужныеТаблицы = Новый Структура("ДанныеЗадачи");
		ДанныеЗадач = упоПроектыИЗадачиВызовСервера.обПолучитьДанныеПроектнойЗадачи(Проект, НужныеТаблицы);
	Иначе
		ДанныеЗадач = Неопределено;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.Исключения Цикл
		
		Задача = СтрокаТЧ.Задача;
		
		ДанныеЗадачи = ДанныеЗадач.Найти(Задача, "ПроектнаяЗадача");
		Если НЕ ДанныеЗадачи = Неопределено Тогда
			СтрокаТЧ.НазваниеЗадачи = ДанныеЗадачи.ДанныеЗадачи.Наименование;
			СтрокаТЧ.КодСДР = ДанныеЗадачи.ДанныеЗадачи.КодСДР;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуРасчетаПроекта()
	
	СрокиПроекта = Справочники.Проекты.ПолучитьСроки(Объект.Проект);
	Объект.ДатаРасчетаПроекта = СрокиПроекта.ДатаНачала;
		
КонецПроцедуры

// Выполняет действия при подборе.
//
// Параметры:
//  НоваяСтрока		 - Произвольный - не используется.
//  ПараметрыПодбора - Произвольный - не используется.
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(НоваяСтрока, ПараметрыПодбора) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПараметрыПодбора = ПодготовитьДопПараметры("ПодобратьИсключения");
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора(ИмяКоманды);
	
	СписокВидимыхКолонок.Добавить("КодСДР", "Код СДР");
	СписокВидимыхКолонок.Добавить("НазваниеПроектнойЗадачи", "Название проектной задачи");
	
	АдресХранилища = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора(имяКоманды)
	
	Перем ТаблицаОтбора;
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	
	НоваяСтрока = ТаблицаОтбора.Добавить();
	НоваяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	НоваяСтрока.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
	НоваяСтрока.Применение =  ТипПримененияОтбораКомпоновкиДанных.Элементы;
	НоваяСтрока.Использование  = Истина;
	НоваяСтрока.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ПЗ.Ссылка
	                |ИЗ
	                |	Документ.упоПроектнаяЗадача КАК ПЗ
	                |ГДЕ
	                |	ПЗ.Проект = &Проект";
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Массив = Таблица.ВыгрузитьКолонку("Ссылка");
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Массив);
	
	НоваяСтрока.ПравоеЗначение = Список;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	  
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьДокумента(ПараметрыЗаполнения)
	
	СтрокаСообщений = "Операция ""Заполнить"" не выполнена: ";
	Результат = упоПроверкаЗаполненияКлиент.ПроверитьЗаполнениеПолейШапки(Объект, ПараметрыЗаполнения.ИмяТЧ, СтрокаСообщений);
	Если Результат = Ложь Тогда
		упоРаботаСДиалогамиКлиент.упоПредупреждение(СтрокаСообщений);
		Возврат;
	КонецЕсли;	
	
	Если Объект[ПараметрыЗаполнения.ИмяТЧ].Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТабличнуюЧастьДокументаЗавершение", ЭтотОбъект,ПараметрыЗаполнения);  
		упоРаботаСДиалогамиКлиент.упоВопрос("Очистить табличную часть перед заполнением?", РежимДиалогаВопрос.ДаНетОтмена,,,,,ОписаниеОповещения);
		
	Иначе
		ЗаполнитьТабличнуюЧастьДокументаЗавершение(Неопределено,ПараметрыЗаполнения);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьДокументаЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		Объект[ДополнительныеПараметры.ИмяТЧ].Очистить();
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура("ТипЗаполнения", ДополнительныеПараметры.ТипЗаполнения);
	ПараметрыЗаполнения.Вставить("ПоДаннымРегистра", ДополнительныеПараметры.ПоДаннымРегистра);
	
	ЗаполнитьТаблицуИсключений(ПараметрыЗаполнения);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти
