
#Область СлужебныйПрограммныйИнтерфейс

// Обработка оповещения отражение зарплаты в финансовом учете.
//
Процедура ОбработкаОповещения_ОтражениеЗарплатыВФинансовомУчете(ИмяСобытия, Параметр, Источник) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыВызовСервера.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ЗагрузкаНачисленийExcel" Тогда
		Источник.Прочитать();
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписанаЗадачаПроекта"
		ИЛИ ИмяСобытия = "ПриЗаписиСтруктурыПроекта" Тогда
		// Обновим кэш представлений способов отражения для проектных задач при их изменении.
		ОповеститьОбИзменении(Тип("СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти