
&После("ПередЗаписью")
Процедура ИКТ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ИКТ_ПроверкаЗаполненияТЧ(Отказ, РежимЗаписи);	КонецПроцедуры

Процедура ИКТ_ПроверкаЗаполненияТЧ(Отказ, РежимЗаписи) 

	Если ИКТ_ЗП_УОС.ЭтоУОС(Организация) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Для Каждого Строка Из Позиции Цикл
			Если Не ЗначениеЗаполнено(Строка.ИКТ_ДолжностьС) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_IDДолжностьС) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_НомерГруппыПодбора) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_ТипПроверкиКандидатовДБ) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_ВидИнцидентаПоКРВ) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_УровеньДоступа) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_Должность) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_Группа) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_Грейд) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_НазваниеРазделаПерсонала) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_ПроцентЗанятости) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_ФункциональныйРуководительФР) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_ВышестоящийРуководительВР) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_СрокДействияСтатусаВакансии) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_БизнесЕдиница) Или
				Не ЗначениеЗаполнено(Строка.ИКТ_Департамент) Или
				Не ЗначениеЗаполнено(Строка.ID_ДолжностьS) Тогда
				//Сообщить("Необходимо заполнить все реквизиты УОС в должности " + Строка.Должность);
				//Отказ = Истина;
			КонецЕсли;				
		КонецЦикла; 		
	КонецЕсли;
	
КонецПроцедуры