#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		
		ТекстСообщения = НСтр("ru = 'Функционал не предназначен для использования в данной конфигурации.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НастроитьЭлементыФормы();

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка, , Ложь);			
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьПоследняяМодификация();
	ОбновитьВидимостьЭлементов();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
			
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьКолонкиПериодовПоТаблицеРасходов();		
	ЗаполнитьКолонкиПериодовПоТаблицеРаспределения();

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
		Объект, 
		Отказ, 
		СтандартнаяОбработка, 
		ЗавершениеРаботы, 
		ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ЗаполнитьКолонкиПериодовПоТаблицеРасходов();		
	ЗаполнитьКолонкиПериодовПоТаблицеРаспределения();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределенныеРасходыПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекДанные = Элементы.РаспределенныеРасходы.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадача) Тогда
		Возврат;
	КонецЕсли;

	МассивПЗ = Новый Массив;
	МассивПЗ.Добавить(ТекДанные.ПроектнаяЗадача);
	НазванияПЗ = упоПроектыИЗадачиВызовСервера.НазванияПроектныхЗадач(МассивПЗ);
	ТекДанные.НазваниеПроектнойЗадачи = НазванияПЗ[ТекДанные.ПроектнаяЗадача];

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПеречитать(Команда)
	
	ЭтотОбъект.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборПериода(Команда)
	
	ВыборПериодаМесяц = Новый ДиалогРедактированияСтандартногоПериода();
	ВыборПериодаМесяц.Период = Новый СтандартныйПериод(Объект.НачалоПериода, Объект.ОкончаниеПериода);
	СтруктураПараметров = Новый Структура("ДиалогВыборПериода", ВыборПериодаМесяц);
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтаФорма, СтруктураПараметров);
	ВыборПериодаМесяц.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроектыОбщефирменнойДеятельности()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Проект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.Компонент = ЗНАЧЕНИЕ(Перечисление.упоКомпоненты.ОбщефирменнаяДеятельность)";	
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Нет проектов с компонентой ""Общефирменная деятельность"".'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СлужебныеПроекты.Добавить();
		НоваяСтрока.Проект = Выборка.Проект;
		НоваяСтрока.Распределять = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСлужебныеПроекты(Команда)

	Объект.СлужебныеПроекты.Очистить(); 
	ЗаполнитьПроектыОбщефирменнойДеятельности();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроектыДляРаспределения()
	
	СхемаКомпоновки     = Документы.упоРаспределениеРасходовПоПроектамФакт.ПолучитьМакет("ПроектыДляРаспределения");
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	Тип					= Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки, , , Тип);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТабЗнач = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТабЗнач);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Для Каждого СтрокаТЗ Из ТабЗнач Цикл
		НоваяСтрока = Объект.ПроектыДляРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);		
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПроектыДляРаспределения(Команда)
	
	Объект.ПроектыДляРаспределения.Очистить();	 
	ЗаполнитьПроектыДляРаспределения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасходыКРаспределению(ТекстЗапроса)
	
	Если Не (ЗначениеЗаполнено(Объект.НачалоПериода) И ЗначениеЗаполнено(Объект.ОкончаниеПериода)) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран период'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	МассивСлужебныхПроектов = МассивПроектов("СлужебныеПроекты"); 

	Если Не ЗначениеЗаполнено(МассивСлужебныхПроектов) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбраны проекты общефирменной деятельности.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.СлужебныеПроекты");
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;	
		
	Запрос.УстановитьПараметр("СлужебныеПроекты", МассивСлужебныхПроектов);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.ОкончаниеПериода));
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Если Результат.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Нет фактических расходов к распределению по проектам общефирменной деятельности.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИндексСтрок = 0;		 
	ВыборкаПодразделения = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПодразделения.Следующий() Цикл			
		
		ВыборкаСтатьиРасходов = ВыборкаПодразделения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтатьиРасходов.Следующий() Цикл
			
			ВыборкаСС_СП = ВыборкаСтатьиРасходов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСС_СП.Следующий() Цикл
				
				ИндексСтрок = ИндексСтрок + 1;
				НоваяСтрока = Объект.РасходыКРаспределению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСС_СП);				
				НоваяСтрока.ИндексСтрокРаспределения = ИндексСтрок;
				ВыборкаПериоды = ВыборкаСС_СП.Выбрать();
				
				Пока ВыборкаПериоды.Следующий() Цикл
					НоваяСтрока = Объект.РасходыКРаспределениюПоПериодам.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПериоды);
					НоваяСтрока.ИндексСтрокиРасходов = ИндексСтрок;				
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПостроитьПериодыРасходовКРаспределению();
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		
		СпособыРаспределения = Объект.РасходыКРаспределению.Выгрузить(, "СпособРаспределенияРасходов");
		МассивСпособов = СпособыРаспределения.ВыгрузитьКолонку("СпособРаспределенияРасходов");
		упоРаспределениеКосвенныхРасходов.ПроверитьСпособыРаспределения(МассивСпособов, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьПериодыРасходовКРаспределению()

	ТаблицаСПериодами = Объект.РасходыКРаспределениюПоПериодам.Выгрузить();	
	ТаблицаИтогов = упоРаботаСФормамиСервер.ПолучитьТаблицуПериодов(ТаблицаПериодов, ТаблицаСПериодами, Истина);
	
	упоРаботаСФормамиСервер.РаспределениеПоПериодам(ЭтаФорма, ТаблицаПериодов, "РасходыКРаспределению", ТаблицаИтогов);
	Элементы.РасходыКРаспределениюСумма.ТекстПодвала = Формат(Объект.РасходыКРаспределению.Итог("Сумма"), "ЧДЦ=2");

КонецПроцедуры

&НаСервере
Процедура ПостроитьПериодыРаспределенныхРасходов()

	ТаблицаСПериодами = Объект.РаспределенныеРасходыПоПериодам.Выгрузить();	
	ТаблицаИтогов = упоРаботаСФормамиСервер.ПолучитьТаблицуПериодов(ТаблицаПериодов, ТаблицаСПериодами, Ложь);

	упоРаботаСФормамиСервер.РаспределениеПоПериодам(ЭтаФорма, ТаблицаПериодов, "РаспределенныеРасходы",	ТаблицаИтогов);
	Элементы.РаспределенныеРасходыСумма.ТекстПодвала = Формат(Объект.РаспределенныеРасходы.Итог("Сумма"), "ЧДЦ=2");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиПериодовПоТаблицеРасходов()

	СоответствиеКолонок = Новый Соответствие;
	СоответствиеКолонок.Вставить("Период", "Сумма");
	СтруктураПараметров = СоздатьСтруктуруПараметров("РасходыКРаспределению", 
		"РасходыКРаспределениюПоПериодам",
		СоответствиеКолонок, 
		"ИндексСтрокРаспределения", 
		"ИндексСтрокиРасходов");
	упоРаботаСФормамиСервер.ЗаполнитьКолонкиПериодовДаннымиНаСервере(Объект, ТаблицаПериодов, СтруктураПараметров); 
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКолонкиПериодовПоТаблицеРаспределения()

	СоответствиеКолонок = Новый Соответствие;
	СоответствиеКолонок.Вставить("Период", "Сумма");
	СтруктураПараметров = СоздатьСтруктуруПараметров("РаспределенныеРасходы", 
		"РаспределенныеРасходыПоПериодам",
		СоответствиеКолонок, 
		"ИндексСтрокиРаспределенияПоПериодам", 
		"ИндексСтрокиРаспределенныхРасходов");
	упоРаботаСФормамиСервер.ЗаполнитьКолонкиПериодовДаннымиНаСервере(Объект, ТаблицаПериодов, СтруктураПараметров); 
	ЗаполнитьНаименованияВТаблицах();

КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнитьРасходыКРаспределению(Команда)
	
	ОчиститьТаблицыРаспределения();
	ТекстЗапроса = ТекстЗапросаРасходыВсе();
	ЗаполнитьРасходыКРаспределению(ТекстЗапроса);
	ЗаполнитьКолонкиПериодовПоТаблицеРасходов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРасходыКРаспределениюФОТ(Команда)
	
	ОчиститьТаблицыРаспределения();
	ТекстЗапроса = ТекстЗапросаРасходыФОТ();
	ЗаполнитьРасходыКРаспределению(ТекстЗапроса);
	ЗаполнитьКолонкиПериодовПоТаблицеРасходов();

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРасходыКРаспределениюБезФОТ(Команда)
	
	ОчиститьТаблицыРаспределения();
	ТекстЗапроса = ТекстЗапросаРасходыБезФОТ();
	ЗаполнитьРасходыКРаспределению(ТекстЗапроса);
	ЗаполнитьКолонкиПериодовПоТаблицеРасходов();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспределенныеРасходы()
	
	Если Не ЗначениеЗаполнено(Объект.РасходыКРаспределению) Тогда
		ТекстСообщения = НСтр("ru = 'Нет расходов к распределению'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.РасходыКРаспределению");
		Возврат;
	КонецЕсли;
	
	МассивПроектыДляРаспределения = МассивПроектов("ПроектыДляРаспределения"); 
	
	Если Не ЗначениеЗаполнено(МассивПроектыДляРаспределения) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбраны проекты для распределения'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ПроектыДляРаспределения");
		Возврат;	
	КонецЕсли;
	
	ТаблицаКосвенныхРасходов = СтруктураТаблицыКосвенныхРасходов();
	
	Для Каждого Строка Из Объект.РасходыКРаспределениюПоПериодам Цикл
		
		СтруктураИндекс = Новый Структура("ИндексСтрокРаспределения", Строка.ИндексСтрокиРасходов);
		НайдСтроки = Объект.РасходыКРаспределению.НайтиСтроки(СтруктураИндекс);
		
		Если НайдСтроки.Количество() > 0 Тогда
			
			Если Не ЗначениеЗаполнено(НайдСтроки[0].СпособРаспределенияРасходов) Тогда
				ТекстСообщения = НСтр("ru = 'Заполните способ распределения расходов у статей затрат'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.РасходыКРаспределению");
				Возврат;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаКосвенныхРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайдСтроки[0]);
			НоваяСтрока.Сумма = Строка.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРаспределение = СтруктураТаблицыРаспределение();
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("МассивПроектыДляРаспределения", МассивПроектыДляРаспределения);
	СтруктураПараметры.Вставить("ДатаНачало", Объект.НачалоПериода);
	СтруктураПараметры.Вставить("ДатаКонец", КонецДня(Объект.ОкончаниеПериода));
	
	упоРаспределениеКосвенныхРасходов.КосвенныеРасходыРаспределить(ТаблицаКосвенныхРасходов, 
		ТаблицаРаспределение, 
		СтруктураПараметры); 
		
	Если Не ЗначениеЗаполнено(ТаблицаРаспределение) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРаспределение.Сортировать("Период Возр");
	Ключ = "ПроектнаяЗадача,Подразделение,СобствСилы_Субподряд,СтатьяРасходов,ИндексСтрокиРасходов,КоэффициентПроекта,КоэффициентПодразделения"; 
	ТаблицаРаспределение.Индексы.Добавить(Ключ);
	
	КопияРаспределение = ТаблицаРаспределение.Скопировать();
	КопияРаспределение.Свернуть(Ключ);
	ИндексСтрок = 0;
	ВалютаУпр = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	Для Каждого Строка Из КопияРаспределение Цикл
		
		ИндексСтрок = ИндексСтрок + 1;
		НоваяСтрока = Объект.РаспределенныеРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);				
		НоваяСтрока.ИндексСтрокиРаспределенияПоПериодам = ИндексСтрок;
		НоваяСтрока.Валюта = ВалютаУпр;
		СтруктураПоиска = ПолучитьСтруктуруПоиска(Строка);
		НайденныеСтроки = ТаблицаРаспределение.НайтиСтроки(СтруктураПоиска);
		Сумма = 0;
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			НоваяСтрокаПериод = Объект.РаспределенныеРасходыПоПериодам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПериод, НайденнаяСтрока);
			НоваяСтрокаПериод.ИндексСтрокиРаспределенныхРасходов = ИндексСтрок;
			Сумма = Сумма + НайденнаяСтрока.Сумма;
			
		КонецЦикла;
		
		НоваяСтрока.Сумма = Сумма;
		
	КонецЦикла;
					
	ПостроитьПериодыРаспределенныхРасходов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРаспределенныеРасходы(Команда)
	
	Объект.РаспределенныеРасходы.Очистить();
	Объект.РаспределенныеРасходыПоПериодам.Очистить();
	ЗаполнитьРаспределенныеРасходы();
	ЗаполнитьКолонкиПериодовПоТаблицеРаспределения();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажкиПроектыДляРаспределения(Команда)
	
	УстановитьСнятьФлажки(Ложь, "ПроектыДляРаспределения");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажкиПроектыДляРаспределения(Команда)
	
	УстановитьСнятьФлажки(Истина, "ПроектыДляРаспределения");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажкиСлужебныеПроекты(Команда)
	
	УстановитьСнятьФлажки(Ложь, "СлужебныеПроекты");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажкиСлужебныеПроекты(Команда)
	
	УстановитьСнятьФлажки(Истина, "СлужебныеПроекты");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьОтбор(Команда)
	
	Элементы.ГруппаУстановитьДополнительныеОтборы.Скрыть();
	Объект.ПроектыДляРаспределения.Очистить();	 
	ЗаполнитьПроектыДляРаспределения();
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, 
	СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, 
		ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	СхемаКомпоновки = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПроектыДляРаспределения");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновки , УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПостроитьПериодыРасходовКРаспределению();
		ПостроитьПериодыРаспределенныхРасходов();
		ЗаполнитьКолонкиПериодовПоТаблицеРасходов();		
		ЗаполнитьКолонкиПериодовПоТаблицеРаспределения();
		УстановитьЗаголовокВыбораПериода();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицыРаспределения()
	
	Объект.РасходыКРаспределению.Очистить();
	Объект.РасходыКРаспределениюПоПериодам.Очистить();
	Объект.РаспределенныеРасходы.Очистить();
	Объект.РаспределенныеРасходыПоПериодам.Очистить();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНаименованияВТаблицах()
	
	МассивПЗ = Новый Массив;

	Для Каждого СтрокаТЧ Из Объект.РаспределенныеРасходы Цикл
		МассивПЗ.Добавить(СтрокаТЧ.ПроектнаяЗадача);
	КонецЦикла;
	
	НазванияПЗ = упоПроектыИЗадачиСервер.НазванияПроектныхЗадач(МассивПЗ);
	
	Для Каждого СтрокаТЧ Из Объект.РаспределенныеРасходы Цикл
		СтрокаТЧ.НазваниеПроектнойЗадачи = НазванияПЗ[СтрокаТЧ.ПроектнаяЗадача];
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция МассивПроектов(ИмяТЧ)
	
	Массив = Новый Массив;
	
	Для Каждого Строка Из Объект[ИмяТЧ] Цикл
		
		Если Строка.Распределять Тогда
			Массив.Добавить(Строка.Проект);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции	

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
    ВыборПериодаМесяц = ДополнительныеПараметры.ДиалогВыборПериода;

    Если ЗначениеЗаполнено(Период) Тогда
        ВыбранныйПериод = ВыборПериодаМесяц.Период;
        Объект.НачалоПериода = НачалоМесяца(ВыбранныйПериод.ДатаНачала);
        Объект.ОкончаниеПериода = КонецМесяца(ВыбранныйПериод.ДатаОкончания);
	КонецЕсли;
	
	УстановитьЗаголовокВыбораПериода();
	ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокВыбораПериода()
	
	Если НачалоМесяца(Объект.НачалоПериода) = НачалоМесяца(Объект.ОкончаниеПериода) Тогда
		
		Элементы.КнопкаВыборПериода.Заголовок = НСтр("ru = 'Период '") + " "  
			+ Формат(Объект.ОкончаниеПериода, НСтр("ru='ДФ=''ММММ гггг ""г.""'''"));
			
	Иначе
										
		Элементы.КнопкаВыборПериода.Заголовок = НСтр("ru = 'Период с'") + " "  
			+ Формат(Объект.НачалоПериода, НСтр("ru='ДФ=''ММММ гггг ""г.""'''"))  
			+  " " + НСтр("ru = 'по'") + " " 
			+ Формат(Объект.ОкончаниеПериода, НСтр("ru='ДФ=''ММММ гггг ""г.""'''"));
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(Пометка, ИмяТЧ)
	
	Для Каждого ТекСтрока Из Объект[ИмяТЧ] Цикл
		ТекСтрока.Распределять = Пометка;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьСтруктуруПараметров(ОсновнаяТаблица, ТаблицаСПериодами, СоответствиеКолонок, ИндексОсновнойТЧ,
	ИндексТЧПериодов)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОсновнаяТаблица", ОсновнаяТаблица);
	СтруктураПараметров.Вставить("ТаблицаСПериодами", ТаблицаСПериодами);
	СтруктураПараметров.Вставить("СоответствиеКолонок", СоответствиеКолонок);
	СтруктураПараметров.Вставить("ИндексОсновнойТЧ", ИндексОсновнойТЧ);
	СтруктураПараметров.Вставить("ИндексТЧПериодов", ИндексТЧПериодов);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаРасходыВсе()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	НАЧАЛОПЕРИОДА(упоФактДоходовИРасходовОборотыОбороты.Период, МЕСЯЦ) КАК Период,
	        |	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья КАК СтатьяРасходов,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья.СпособыРаспределенияРасходовПоПроектам КАК СпособРаспределенияРасходов,
	        |	СУММА(упоФактДоходовИРасходовОборотыОбороты.СуммаОборот) КАК Сумма,
	        |	упоФактДоходовИРасходовОборотыОбороты.СобствСилы_Субподряд КАК СобствСилы_Субподряд
	        |ИЗ
	        |	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	        |			&НачалоПериода,
	        |			&КонецПериода,
	        |			Месяц,
	        |			ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	        |				И ПроектнаяЗадача.Проект В (&СлужебныеПроекты)) КАК упоФактДоходовИРасходовОборотыОбороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НАЧАЛОПЕРИОДА(упоФактДоходовИРасходовОборотыОбороты.Период, МЕСЯЦ),
	        |	упоФактДоходовИРасходовОборотыОбороты.Подразделение,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья.СпособыРаспределенияРасходовПоПроектам,
	        |	упоФактДоходовИРасходовОборотыОбороты.СобствСилы_Субподряд
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Период
	        |ИТОГИ
	        |	СУММА(Сумма)
	        |ПО
	        |	Подразделение,
	        |	СтатьяРасходов,
	        |	СобствСилы_Субподряд";
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаРасходыФОТ()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоСтатьиФОТ.Статья КАК Статья
	        |ПОМЕСТИТЬ ВТ_СтатьиФОТ
	        |ИЗ
	        |	РегистрСведений.упоСтатьиФОТ КАК упоСтатьиФОТ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	НАЧАЛОПЕРИОДА(упоФактДоходовИРасходовОборотыОбороты.Период, МЕСЯЦ) КАК Период,
	        |	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья КАК СтатьяРасходов,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья.СпособыРаспределенияРасходовПоПроектам КАК СпособРаспределенияРасходов,
	        |	СУММА(упоФактДоходовИРасходовОборотыОбороты.СуммаОборот) КАК Сумма,
	        |	упоФактДоходовИРасходовОборотыОбороты.СобствСилы_Субподряд КАК СобствСилы_Субподряд
	        |ИЗ
	        |	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	        |			&НачалоПериода,
	        |			&КонецПериода,
	        |			Месяц,
	        |			ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	        |				И ПроектнаяЗадача.Проект В (&СлужебныеПроекты)
	        |				И Статья В
	        |					(ВЫБРАТЬ
	        |						ВТ_СтатьиФОТ.Статья
	        |					ИЗ
	        |						ВТ_СтатьиФОТ КАК ВТ_СтатьиФОТ)) КАК упоФактДоходовИРасходовОборотыОбороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НАЧАЛОПЕРИОДА(упоФактДоходовИРасходовОборотыОбороты.Период, МЕСЯЦ),
	        |	упоФактДоходовИРасходовОборотыОбороты.Подразделение,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья.СпособыРаспределенияРасходовПоПроектам,
	        |	упоФактДоходовИРасходовОборотыОбороты.СобствСилы_Субподряд
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Период
	        |ИТОГИ
	        |	СУММА(Сумма)
	        |ПО
	        |	Подразделение,
	        |	СтатьяРасходов,
	        |	СобствСилы_Субподряд";
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаРасходыБезФОТ()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоСтатьиФОТ.Статья КАК Статья
	        |ПОМЕСТИТЬ ВТ_СтатьиФОТ
	        |ИЗ
	        |	РегистрСведений.упоСтатьиФОТ КАК упоСтатьиФОТ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	НАЧАЛОПЕРИОДА(упоФактДоходовИРасходовОборотыОбороты.Период, МЕСЯЦ) КАК Период,
	        |	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья КАК СтатьяРасходов,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья.СпособыРаспределенияРасходовПоПроектам КАК СпособРаспределенияРасходов,
	        |	СУММА(упоФактДоходовИРасходовОборотыОбороты.СуммаОборот) КАК Сумма,
	        |	упоФактДоходовИРасходовОборотыОбороты.СобствСилы_Субподряд КАК СобствСилы_Субподряд
	        |ИЗ
	        |	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	        |			&НачалоПериода,
	        |			&КонецПериода,
	        |			Месяц,
	        |			ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	        |				И ПроектнаяЗадача.Проект В (&СлужебныеПроекты)
	        |				И НЕ Статья В
	        |						(ВЫБРАТЬ
	        |							ВТ_СтатьиФОТ.Статья
	        |						ИЗ
	        |							ВТ_СтатьиФОТ КАК ВТ_СтатьиФОТ)) КАК упоФактДоходовИРасходовОборотыОбороты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НАЧАЛОПЕРИОДА(упоФактДоходовИРасходовОборотыОбороты.Период, МЕСЯЦ),
	        |	упоФактДоходовИРасходовОборотыОбороты.Подразделение,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья,
	        |	упоФактДоходовИРасходовОборотыОбороты.Статья.СпособыРаспределенияРасходовПоПроектам,
	        |	упоФактДоходовИРасходовОборотыОбороты.СобствСилы_Субподряд
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Период
	        |ИТОГИ
	        |	СУММА(Сумма)
	        |ПО
	        |	Подразделение,
	        |	СтатьяРасходов,
	        |	СобствСилы_Субподряд";
	
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураТаблицыКосвенныхРасходов()

	ТаблицаКосвенныхРасходов = Новый ТаблицаЗначений;
	ТаблицаКосвенныхРасходов.Колонки.Добавить("Подразделение");
	ТаблицаКосвенныхРасходов.Колонки.Добавить("СобствСилы_Субподряд");
	ТаблицаКосвенныхРасходов.Колонки.Добавить("СтатьяРасходов");
	ТаблицаКосвенныхРасходов.Колонки.Добавить("СпособРаспределенияРасходов");
	ТаблицаКосвенныхРасходов.Колонки.Добавить("Период");
	ТаблицаКосвенныхРасходов.Колонки.Добавить("Сумма");
	ТаблицаКосвенныхРасходов.Колонки.Добавить("ИндексСтрокиРасходов");
	
	Возврат ТаблицаКосвенныхРасходов;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураТаблицыРаспределение()

 	ТаблицаРаспределение = Новый ТаблицаЗначений;
	ТаблицаРаспределение.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	ТаблицаРаспределение.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	ТаблицаРаспределение.Колонки.Добавить("СобствСилы_Субподряд", Новый ОписаниеТипов("СправочникСсылка.упоСобственныеСилыСубподряд"));
	ТаблицаРаспределение.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("СправочникСсылка.упоСтатьиЗатрат"));
	ТаблицаРаспределение.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаРаспределение.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаРаспределение.Колонки.Добавить("КоэффициентПроекта", ОбщегоНазначения.ОписаниеТипаЧисло(15, 4));
	ТаблицаРаспределение.Колонки.Добавить("КоэффициентПодразделения", ОбщегоНазначения.ОписаниеТипаЧисло(15, 4));
	ТаблицаРаспределение.Колонки.Добавить("ИндексСтрокиРасходов", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));

	Возврат ТаблицаРаспределение;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПоиска(Строка)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ПроектнаяЗадача", Строка.ПроектнаяЗадача);
	СтруктураПоиска.Вставить("Подразделение", Строка.Подразделение);
	СтруктураПоиска.Вставить("СобствСилы_Субподряд", Строка.СобствСилы_Субподряд);
	СтруктураПоиска.Вставить("СтатьяРасходов", Строка.СтатьяРасходов);
	СтруктураПоиска.Вставить("ИндексСтрокиРасходов", Строка.ИндексСтрокиРасходов);
	СтруктураПоиска.Вставить("КоэффициентПроекта", Строка.КоэффициентПроекта);
	СтруктураПоиска.Вставить("КоэффициентПодразделения", Строка.КоэффициентПодразделения);
	
	Возврат СтруктураПоиска;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	Отображать = Истина;
	
	Если НачалоМесяца(Объект.НачалоПериода) = НачалоМесяца(Объект.ОкончаниеПериода) Тогда
		Отображать = Ложь;
	КонецЕсли;
	
	Элементы.РасходыКРаспределениюСумма.Видимость = Отображать;
	Элементы.РаспределенныеРасходыСумма.Видимость = Отображать;
		
КонецПроцедуры	

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
