////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры для управления связанными табличными частями.
// Связь между ЭлементВладелец и ЭлементПодчиненный  происходит через реквизиты
// ИндексСтрокРаспределения и ИндексСтрокиВладельца соответсвенно.
// Если Доходы/Расходы по объемам = Ложь, то Доходы/Расходы по натуральным показателям всегда Ложь.
// Если Доходы/Расходы по подразделениям = Ложь, то Доходы/Расходы по объемам всегда Ложь.
// Если ведется бюджет Доходов/Расходов = Ложь, то Доходы/Расходы по подразделениям всегда Ложь.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при активизации строки в ЭлементВладелец, устанавливает отбор в таблице ЭлементПодчиненный.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма.
//  ЭлементВладелец - Строка - имя элемента управления, содержащего распределяемые строки.
//  ЭлементПодчиненный - Строка - имя элемента управления, содержащего распределенные строки.
//  ИмяКолонкиСумма - Строка - имя колонки таблицы, содержащей сумму.
//  ПересчитыватьКоличество - Булево - признак ведения количественного учета.
//  ПересчитыватьОстатокКРаспределению - Булево - признак необходимости пересчета остатка.
//
Процедура СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма,
														  ЭлементВладелец, 
														  ЭлементПодчиненный, 
														  ИмяКолонкиСумма = "Сумма",
														  ПересчитыватьКоличество = Ложь,
														  ПересчитыватьОстатокКРаспределению = Истина) Экспорт 
	
	Если ЭтаФорма.Элементы[ЭлементВладелец].ТекущиеДанные <> Неопределено Тогда
		
		Если  ЭтаФорма.Элементы[ЭлементВладелец].ТекущиеДанные.ИндексСтрокРаспределения = Неопределено Тогда
			ИндексОтбора = -1;
		Иначе
			ИндексОтбора = ЭтаФорма.Элементы[ЭлементВладелец].ТекущиеДанные.ИндексСтрокРаспределения;
		КонецЕсли;
		
		ЭтаФорма.Элементы[ЭлементПодчиненный].ОтборСтрок = Новый ФиксированнаяСтруктура("ИндексСтрокиВладельца", ИндексОтбора);
		
	КонецЕсли;
	
	// Пересчет итогов. При вызове из формы задачи структуры проекта итоги считаются в процедуре формы.
	Если ПересчитыватьОстатокКРаспределению Тогда
		ПересчитатьОстатокКРаспределению(ЭтаФорма, ЭлементВладелец, ЭлементПодчиненный, ИмяКолонкиСумма, ПересчитыватьКоличество);
	КонецЕсли;	
		
КонецПроцедуры

// Пересчитывает итоги в ЭлементПодчиненный в соответсвии с установленным отбором.
//
// Параметры:
//	ЭтаФорма - УправляемаяФорма.
//	ЭлементВладелец - Строка - имя элемента управления, содержащего распределяемые строки.
//	ЭлементПодчиненный - Строка - имя элемента управления, содержащего распределенные строки.
//	ИмяКолонкиСумма - Строка - имя колонки таблицы, содержащей сумму.
//	ПересчитыватьКоличество - Булево - признак ведения количественного учета.
Процедура ПересчитатьОстатокКРаспределению(ЭтаФорма,
										   ЭлементВладелец,
										   ЭлементПодчиненный, 
										   ИмяКолонкиСумма = "Сумма",
										   ПересчитыватьКоличество = Ложь) Экспорт
	
	РаспределеннаяСумма = 0;
	РаспределенноеКоличество = 0;
	
	ТекущиеДанныеВладельца = ЭтаФорма.Элементы[ЭлементВладелец].ТекущиеДанные;
	
	Если ТекущиеДанныеВладельца <> Неопределено Тогда
		
		ПолнаяСуммаКРаспределению = ТекущиеДанныеВладельца[ИмяКолонкиСумма];
	
		ТаблицаПодчиненная = ЭтаФорма.Объект[ЭлементПодчиненный];
		Для Каждого ЭлементРаспределения Из ТаблицаПодчиненная Цикл
			
			Если ЭлементРаспределения.ИндексСтрокиВладельца = ТекущиеДанныеВладельца.ИндексСтрокРаспределения Тогда
				
				РаспределеннаяСумма = РаспределеннаяСумма + ЭлементРаспределения.Сумма;
				
				Если ПересчитыватьКоличество Тогда
					РаспределенноеКоличество = РаспределенноеКоличество + ЭлементРаспределения.Количество;
				КонецЕсли;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
	ЭтаФорма["Распределено" + ЭлементВладелец + "Сумма"] =  Формат(РаспределеннаяСумма, "ЧДЦ=2");
	Если ПересчитыватьКоличество Тогда
		ЭтаФорма["Распределено" + ЭлементВладелец + "Количество"] =  РаспределенноеКоличество;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет итоговые распределенные сумму и количество в ЭлементПодчиненный на равенство с соответствующей строкой
// ЭлементВладелец перед Записью.
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура.
//  ПараметрыТаблиц - массив структур со след. ключами:
//		* ТаблицаВладелец - Строка, Имя элемента управления.
//		* ТаблицаПодчиненная - Строка, Имя элемента управления.
//		* ИмяКолонкиВладелец - Строка, Имя колонки таблицы, содержащей сумму.
//		* ИмяКолонкиПодчиненная - Строка, Имя колонки таблицы, содержащей сумму.
//		* ЕстьКоличество - Булево. Истина означает, что ведется учет по количеству.
//		* ПредставлениеТаблицыРаспределения - Пользовательское представление таблицы.
//  Отказ - Булево - если Истина, то запись не выполняется.
//  ВходящееОписаниеОповещения - ОписаниеОповещения - содержит описание процедуры завершения.
//  ПараметрыПроверки - Структура:
//		* ОбновитьИтогиТаблицыВладельца - Булево.
//		* ОбновитьТрансляцию - Булево. 
//
Процедура ПроверитьРаспределениеПередЗаписью(Объект, ПараметрыТаблиц, Отказ, ВходящееОписаниеОповещения = Неопределено,
	ПараметрыПроверки = Неопределено) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	КолвоВопросов = 0;
	
	Для Каждого Эл Из ПараметрыТаблиц Цикл
		
		ТаблицаВладелец = Эл.ТаблицаВладелец;
		ТаблицаПодчиненная = Эл.ТаблицаПодчиненная;
		ИмяКолонкиВладелец = Эл.ИмяКолонкиВладелец;
		ИмяКолонкиПодчиненная = Эл.ИмяКолонкиПодчиненная;
		ЕстьКоличество = Эл.ЕстьКоличество;
		ЕстьИсточникПлана = Эл.Свойство("ЕстьИсточникПлана") И Эл.ЕстьИсточникПлана = Истина;
		ПредставлениеТаблицыРаспределения = Эл.ПредставлениеТаблицыРаспределения;
		
		Для Каждого СтрокаВладелец Из Объект[ТаблицаВладелец] Цикл
			
			ОтборРаспределения = Новый Структура;
			ОтборРаспределения.Вставить("ИндексСтрокиВладельца", СтрокаВладелец.ИндексСтрокРаспределения);
			
			РаспределенныеСтроки = Объект[ТаблицаПодчиненная].НайтиСтроки(ОтборРаспределения);
			
			Если РаспределенныеСтроки.Количество() > 0 Тогда
				
				СуммаРаспределенная = 0;
				Если ЕстьКоличество Тогда
					КоличествоРаспределенное = 0;
				КонецЕсли;
				
				Для Каждого СтрокаРаспределения Из РаспределенныеСтроки Цикл
					СуммаРаспределенная = СуммаРаспределенная + СтрокаРаспределения[ИмяКолонкиПодчиненная];
					Если ЕстьКоличество Тогда
						КоличествоРаспределенное = КоличествоРаспределенное + СтрокаРаспределения.Количество;
					КонецЕсли;
				КонецЦикла;
				
				Если СуммаРаспределенная <> СтрокаВладелец[ИмяКолонкиВладелец] Тогда
					КолвоВопросов = КолвоВопросов + 1;
				КонецЕсли;
				
				Если ЕстьКоличество И КоличествоРаспределенное <> СтрокаВладелец.Количество Тогда
					КолвоВопросов = КолвоВопросов + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура("ВходящееОписаниеОповещения", ВходящееОписаниеОповещения);
	
	ПараметрыОбъекта = Новый Структура("Результат, КолвоВопросов, КолвоОтветов", Истина, КолвоВопросов, 0);
	ДополнительныеПараметры.Вставить("ПараметрыОбъекта", ПараметрыОбъекта);

	Для Каждого Эл Из ПараметрыТаблиц Цикл
		
		ТаблицаВладелец = Эл.ТаблицаВладелец;
		ТаблицаПодчиненная = Эл.ТаблицаПодчиненная;
		ИмяКолонкиВладелец = Эл.ИмяКолонкиВладелец;
		ИмяКолонкиПодчиненная = Эл.ИмяКолонкиПодчиненная;
		ЕстьКоличество = Эл.ЕстьКоличество;		
		ПредставлениеТаблицыРаспределения = Эл.ПредставлениеТаблицыРаспределения;
		
		ЕстьИсточникПлана = Эл.Свойство("ЕстьИсточникПлана") И Эл.ЕстьИсточникПлана = Истина;
		Если ЕстьИсточникПлана Тогда
			ИсточникТаблицы = упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ТаблицаВладелец);
		КонецЕсли;	
		
		Для Каждого СтрокаВладелец Из Объект[ТаблицаВладелец] Цикл
			
			// Исключаем из проверки строки трансляции, т.к. пользователь не сможет их отредактировать.
			Если ЕстьИсточникПлана Тогда
				
				ЭтоСтрокаТрансляции = упоРаботаСФормамиКлиентСервер.ЭтоСтрокаТрансляции(СтрокаВладелец, 
																						ТаблицаВладелец, 
																						ИсточникТаблицы);				
				Если ЭтоСтрокаТрансляции Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;	
			
			ОтборРаспределения = Новый Структура;
			ОтборРаспределения.Вставить("ИндексСтрокиВладельца", СтрокаВладелец.ИндексСтрокРаспределения);
			
			РаспределенныеСтроки = Объект[ТаблицаПодчиненная].НайтиСтроки(ОтборРаспределения);
			
			Если РаспределенныеСтроки.Количество() > 0 Тогда
				
				ЭтоПроектнаяПродукция = ТаблицаВладелец = "Субпродукты" И Объект.ТипСубпродукта = ПредопределенноеЗначение(
					"Перечисление.упоТипСубпродукта.ПроектнаяПродукция");

				СуммаРаспределенная = 0;
				Если ЕстьКоличество Тогда
					КоличествоРаспределенное = 0;
					Если ЭтоПроектнаяПродукция Тогда				
						НормированиеРаспределенное = 0; 
						ТрудоемкостьРаспределенная = 0;	
					КонецЕсли;		
				КонецЕсли;
																
				СССП_НДС = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС");
				Для Каждого СтрокаРаспределения Из РаспределенныеСтроки Цикл
					Если ЭтоПроектнаяПродукция
						И СтрокаРаспределения.СобствСилы_Субподряд <> СССП_НДС
						И СтрокаРаспределения.ПроцентРаспределения = 0 Тогда
						
						Отказ = Истина;
						
						ТекстСообщения = НСтр("ru = 'В строке №%1 не заполнено значение колонки ""%ТРЗ""'");
						НомерСтроки = Объект[ТаблицаПодчиненная].Индекс(СтрокаРаспределения) + 1;
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомерСтроки);
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
						
						Прервать;
					КонецЕсли;
					
					СуммаРаспределенная = СуммаРаспределенная + СтрокаРаспределения[ИмяКолонкиПодчиненная];
					Если ЕстьКоличество Тогда
						КоличествоРаспределенное = КоличествоРаспределенное + СтрокаРаспределения.Количество;
						Если ЭтоПроектнаяПродукция Тогда
							НормированиеРаспределенное = НормированиеРаспределенное + СтрокаРаспределения.Нормирование;
							ТрудоемкостьРаспределенная = ТрудоемкостьРаспределенная + СтрокаРаспределения.Трудоемкость;
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
				
				Если Отказ Тогда
					Возврат;
				КонецЕсли;
				
				ДополнительныеПараметры.Вставить("СтрокаВладелец", СтрокаВладелец);
				ДополнительныеПараметры.Вставить("ИмяКолонкиВладелец", ИмяКолонкиВладелец);
				ДополнительныеПараметры.Вставить("ТаблицаВладелец", ТаблицаВладелец);
				ДополнительныеПараметры.Вставить("КоличествоРаспределенное", КоличествоРаспределенное);
				ДополнительныеПараметры.Вставить("СуммаРаспределенная", СуммаРаспределенная);
				ДополнительныеПараметры.Вставить("Объект", Объект);
				ДополнительныеПараметры.Вставить("ВходящееДопОписаниеОповещения", Неопределено);
				ДополнительныеПараметры.Вставить("ОчиститьВходящееДопОписаниеОповещения", Ложь);
				ДополнительныеПараметры.Вставить("ЭтоПроектнаяПродукция", ЭтоПроектнаяПродукция);
				ДополнительныеПараметры.Вставить("НормированиеРаспределенное", НормированиеРаспределенное);
				ДополнительныеПараметры.Вставить("ТрудоемкостьРаспределенная", ТрудоемкостьРаспределенная);
				ДополнительныеПараметры.Вставить("ОписаниеОповещенияОбновитьТрансляцию", Неопределено);
				ДополнительныеПараметры.Вставить("ОписаниеОповещенияОбновитьИтогиТаблицыВладельца", Неопределено);
				
				НомерСтроки = Объект[ТаблицаВладелец].Индекс(СтрокаВладелец) + 1;
				
				Если СуммаРаспределенная <> СтрокаВладелец[ИмяКолонкиВладелец] Тогда										
					
					Если ЕстьКоличество И КоличествоРаспределенное <> СтрокаВладелец.Количество Тогда
						
						ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьРаспределениеПередЗаписьюЗавершение1", ЭтотОбъект, ДополнительныеПараметры);
						ДополнительныеПараметры.Вставить("ВходящееДопОписаниеОповещения", ОписаниеОповещения);												
						
						ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Сумма и количество в строке №%1 табличной части ""%2"" не совпадают с распределенными. 
							|Изменить сумму и количество в строке?'"),							
							Формат(НомерСтроки, "ЧГ=0"), ПредставлениеТаблицыРаспределения); 						
						
					Иначе						

						ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Сумма в строке №%1 табличной части ""%2"" не совпадает с распределенной.
							|Изменить сумму в строке?'"),
							Формат(НомерСтроки, "ЧГ=0"), ПредставлениеТаблицыРаспределения);																	
							
					КонецЕсли;
					
					Если ПараметрыПроверки <> Неопределено Тогда
						
                        ДобавитьОповещениеОбновленияИтогов(Объект, ПараметрыПроверки, ДополнительныеПараметры);

						Если ПараметрыПроверки.Свойство("ОбновитьТрансляцию") И ПараметрыПроверки.ОбновитьТрансляцию
							И (ТаблицаВладелец = "МатериальныеРесурсы" Или ТаблицаВладелец = "Субпродукты") Тогда
							
							ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьТрансляциюВФинПланыЗавершение", 
								Объект, ДополнительныеПараметры);
							ДополнительныеПараметры.Вставить("ОписаниеОповещенияОбновитьТрансляцию", ОписаниеОповещения);
							
						КонецЕсли;						
					
					КонецЕсли;
					
					ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьРаспределениеПередЗаписьюЗавершение2", ЭтотОбъект, ДополнительныеПараметры);	
					ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
					
					Отказ = Истина;
					
				ИначеЕсли ЕстьКоличество И КоличествоРаспределенное <> СтрокаВладелец.Количество Тогда
					
					Если ПараметрыПроверки <> Неопределено Тогда
						ДобавитьОповещениеОбновленияИтогов(Объект, ПараметрыПроверки, ДополнительныеПараметры);
					КонецЕсли;
					
					ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Количество в строке №%1 табличной части ""%2"" не совпадает с распределенным.
						|Изменить количество в строке?'"),
						Формат(НомерСтроки, "ЧГ=0"), ПредставлениеТаблицыРаспределения);
							
					ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьРаспределениеПередЗаписьюЗавершение1", ЭтотОбъект, ДополнительныеПараметры);
					ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
					
					Отказ = Истина;
					
				КонецЕсли;
				
				Если Отказ Тогда
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Удаляет строки из ЭлементПодчиненный при удалении строк из ЭлементВладелец.
//
// Параметры:
//  ЭтаФорма			- УправляемаяФорма 		- форма.
//  Объект				- ДанныеФормыСтруктура 	- слепок документа.
//  ТаблицаВладелец 	- Строка 				- имя элемента управления, содержащего распределяемые строки.
//  ТаблицаПодчиненная - Строка 				- имя элемента управления, содержащего распределенные строки.
//  ДополнительныеПарамеры - Структура 			- дополнительные управляющие параметры для идентификаци таблиц.
//
Процедура СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, ТаблицаВладелец, ТаблицаПодчиненная, ДополнительныеПарамеры = Неопределено) Экспорт				
	
	ЕстьТаблицаРаспределенияПоПериодам = ЕстьТаблицаРаспределенияПоПериодам(ДополнительныеПарамеры);
	
	Если ТаблицаВладелец = "Субпродукты" Тогда		
		ИмяКолонкиИндекса =  "ИндексСтрокиРаспределениеПоРолям";
		ИмяТаблицыПериоды = "РаспределениеДоходовПоПериодам";		
	ИначеЕсли ТаблицаВладелец = "ПланДоходов" Тогда		
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияДоходов";
		ИмяТаблицыПериоды = "РаспределениеДоходовПоПериодам";		
	ИначеЕсли ТаблицаВладелец = "МатериальныеРесурсы" Или ТаблицаВладелец = "ДополнительныеЗатраты" Тогда		
		ИмяКолонкиИндекса =  "ИндексСтрокиРаспределениеПоРолям";
		ИмяТаблицыПериоды = "РаспределениеРасходовПоПериодам";				
	ИначеЕсли ТаблицаВладелец = "ПланРасходов" Тогда		
		ИмяКолонкиИндекса =  "ИндексСтрокиРаспределенияРасходов";
		ИмяТаблицыПериоды = "РаспределениеРасходовПоПериодам";			
	КонецЕсли;	
	
	МассивВыделенныхСтрок = ЭтаФорма.Элементы[ТаблицаВладелец].ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрокаВладельца Из МассивВыделенныхСтрок Цикл
		
		ТекущиеДанныеВладельца  = Объект[ТаблицаВладелец].НайтиПоИдентификатору(ВыделеннаяСтрокаВладельца);
		
		Если ТекущиеДанныеВладельца <> Неопределено Тогда
			
			ИндексСтрокРаспределения = ТекущиеДанныеВладельца.ИндексСтрокРаспределения;
			
			Если ИндексСтрокРаспределения <> Неопределено Тогда
				
				МассивСтрокНаУдаление = Новый Массив;
				
				Для Каждого СтрокаРаспределения Из Объект[ТаблицаПодчиненная] Цикл
					Если СтрокаРаспределения.ИндексСтрокиВладельца = ИндексСтрокРаспределения Тогда
						МассивСтрокНаУдаление.Добавить(СтрокаРаспределения);
					КонецЕсли;
				КонецЦикла;			
				
				Для Каждого СтрокаНаУдаление Из МассивСтрокНаУдаление Цикл
					Если ЕстьТаблицаРаспределенияПоПериодам И СтрокаНаУдаление.Свойство("ИндексСтрокРаспределенияПоПериодам") Тогда
						ОчиститьСтрокиРаспределенияПоПериодам(Объект, ЭтаФорма, ТаблицаПодчиненная, ИмяТаблицыПериоды, ИмяКолонкиИндекса,
															  СтрокаНаУдаление); 					
					КонецЕсли;
					Объект[ТаблицаПодчиненная].Удалить(Объект[ТаблицаПодчиненная].Индекс(СтрокаНаУдаление));
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

// Обработчик перед началом добавления строки распределения.
//
// Параметры:
//  ЭлементВладелец	 - ТабличноеПоле, ТаблицаФормы 	- табличная часть, куда добавляется строка.
//  Отказ			 - Булево						- признак отказа добавления строки.
Процедура СтрокиРаспределенияПередНачаломДобавления(ЭлементВладелец, Отказ) Экспорт
	
	Если ЭлементВладелец.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

// Заполняет значения по умолчанию в строке из ЭлементПодчиненный и устанавливает связь 
// ЭлементПодчиненный с ЭлементВладелец.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура, УправляемаяФорма.
//	ЭлементВладелец - Строка - имя элемента управления, содержащего распределяемые строки.
//	ЭлементПодчиненный - Строка - имя элемента управления, содержащего распределенные строки.
//	НоваяСтрока - Булево.
//	Копирование - Булево.
Процедура СтрокиРаспределенияПриНачалеРедактирования(ЭлементВладелец,
													 ЭлементПодчиненный,
													 Объект,
													 НоваяСтрока,
													 Копирование) Экспорт													 												
														
	Если НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаВладельца = упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект[ЭлементВладелец.Имя]);
	
	Если ТекущаяСтрокаВладельца <> Неопределено Тогда
		
		Если ЭлементВладелец.ТекущиеДанные.ИндексСтрокРаспределения <> Неопределено Тогда
			ЭлементПодчиненный.ТекущиеДанные.ИндексСтрокиВладельца = ЭлементВладелец.ТекущиеДанные.ИндексСтрокРаспределения;
		Иначе 
			ЭлементПодчиненный.ТекущиеДанные.ИндексСтрокиВладельца = ТекущаяСтрокаВладельца;
			ЭлементВладелец.ТекущиеДанные.ИндексСтрокРаспределения = ТекущаяСтрокаВладельца;
		КонецЕсли;
		
	КонецЕсли;
	
	//
	
	Если Копирование Тогда
		
		
		
	КонецЕсли;
	
	СтруктураПроверки = Новый Структура("Проект", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, Объект);
			
	ЗаполнитьПараметрыСтрокиРаспределения(ЭлементПодчиненный.ТекущиеДанные, ЭлементПодчиненный.Имя, СтруктураПроверки.Проект, Истина);
		
КонецПроцедуры

// Дозаполняет строку данных значениями распределения для проекта по умолчанию.
//
// Параметры:
//  СтрокаДанных			 - ДанныеФормыКоллекция	 - строка данных.
//  ИмяТЧ					 - Строка	 - имя табличной части - владельца строки.
//  Проект					 - СправочникСсылка.Проекты	 - проект.
//  ЗаполнятьТолькоПустые	 - Булево	 - признак заполнения пустых.
//
Процедура ЗаполнитьПараметрыСтрокиРаспределения(СтрокаДанных, ИмяТЧ, Проект = Неопределено, ЗаполнятьТолькоПустые = Истина) Экспорт
	
	ПараметрыСтрокиПоУмолчанию = ПолучитьПараметрыПоУмолчаниюСтрокиРаспределения(ИмяТЧ, Проект);
	
	Для Каждого КлючЗначение Из ПараметрыСтрокиПоУмолчанию Цикл
		Если Не СтрокаДанных.Свойство(КлючЗначение.Ключ) Тогда
			Продолжить;	
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрокаДанных[КлючЗначение.Ключ]) И ЗаполнятьТолькоПустые Тогда
			Продолжить;	
		КонецЕсли;	
		СтрокаДанных[КлючЗначение.Ключ] = КлючЗначение.Значение;	
	КонецЦикла;
	
КонецПроцедуры

// Готовит структуру параметров для заполнения строк распределения.
//
// Параметры:
//  ИмяТЧ	 - Строка	 - имя табличной части.
//  Проект	 - СправочникСсылка.Проекты	 - проект.
// 
// Возвращаемое значение:
//  Структура - параметры по умолчанию
//
Функция ПолучитьПараметрыПоУмолчаниюСтрокиРаспределения(ИмяТЧ, Проект = Неопределено) Экспорт
	
	Если Проект = Неопределено Тогда
		Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");	
	КонецЕсли;	
	
	СтруктураСвойствПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);
	
	Результат = Новый Структура("Подразделение, Роль, СобствСилы_Субподряд");
	
	ТабличныеЧастиДоходов = Новый Соответствие;
	ТабличныеЧастиДоходов.Вставить("РаспределениеДоходов", Истина);
	ТабличныеЧастиДоходов.Вставить("ПланДоходовПоПодразделениям", Истина);
	ТабличныеЧастиДоходов.Вставить("РаспределениеОбъемов", Истина);
	ТабличныеЧастиДоходов.Вставить("СубпродуктыПоПодразделениям", Истина);
	ТабличныеЧастиДоходов.Вставить("РаспределениеДоходныхОбъемов", Истина);
	ТабличныеЧастиДоходов.Вставить("ДоходныеОбъемы", Истина);
	
	ТабличныеЧастиРасходов = Новый Соответствие;
	ТабличныеЧастиРасходов.Вставить("РаспределениеПотребностей", Истина);
	ТабличныеЧастиРасходов.Вставить("МатериальныеРесурсыПоПодразделениям", Истина);
	ТабличныеЧастиРасходов.Вставить("РаспределениеРасходов", Истина);
	ТабличныеЧастиРасходов.Вставить("ПланРасходовПоПодразделениям", Истина);
	ТабличныеЧастиРасходов.Вставить("РаспределениеРасходныхОбъемов", Истина);
	ТабличныеЧастиРасходов.Вставить("РаспределениеЗатрат", Истина);
	ТабличныеЧастиРасходов.Вставить("РаспределениеДополнительныхЗатрат", Истина);
	ТабличныеЧастиРасходов.Вставить("РасходныеОбъемы", Истина);
	
	Если ТабличныеЧастиДоходов[ИмяТЧ] <> Неопределено Тогда
		
		Результат.Подразделение = СтруктураСвойствПоУмолчанию.ПодразделениеДоходовПоУмолчанию;
		Результат.Роль = СтруктураСвойствПоУмолчанию.РольДоходовПоУмолчанию;
		Результат.СобствСилы_Субподряд = СтруктураСвойствПоУмолчанию.СССП_Доходы;
				
	КонецЕсли;
	
	Если ТабличныеЧастиРасходов[ИмяТЧ] <> Неопределено Тогда
			
		Результат.Подразделение = СтруктураСвойствПоУмолчанию.ПодразделениеРасходовПоУмолчанию;
		Результат.Роль = СтруктураСвойствПоУмолчанию.РольРасходовПоУмолчанию;
		Результат.СобствСилы_Субподряд = СтруктураСвойствПоУмолчанию.СССП_Расходы;
		
	КонецЕсли;
	
	Если ИмяТЧ = "РаспределениеДоходов" Или ИмяТЧ = "ПланДоходовПоПодразделениям" Тогда
		Результат.Вставить("СпособПривязки", 
			ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения"));
		Результат.Вставить("ПрофильРаспределения", СтруктураСвойствПоУмолчанию.ПрофильДоходовПоУмолчанию);
	КонецЕсли;
	
	Если ИмяТЧ = "РаспределениеРасходов" Или ИмяТЧ = "ПланРасходовПоПодразделениям" Тогда
		Результат.Вставить("СпособПривязки", 
			ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения"));
		Результат.Вставить("ПрофильРаспределения", СтруктураСвойствПоУмолчанию.ПрофильРасходовПоУмолчанию);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Копирует строки ЭлементВладелец и связанные строки ЭлементПодчиненный.
//
// Параметры:
//  ЭтаФорма				 - УправляемаяФорма	 - форма.
//  Объект					 - 					 - ДанныеФормыСтруктура
//  ТаблицаВладелец			 - Строка			 - имя элемента управления, содержащего распределяемые строки.
//  ТаблицаПодчиненная		 - Строка			 - имя элемента управления, содержащего распределенные строки.
//  Копирование				 - Булево			 - признак копирования.
//  Отказ					 - Булево			 - признак отказа добавления строки.
//  ДополнительныеПараметры	 - Структура		 - управляющие параметры таблиц распределения.
//
Процедура СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма,
													Объект,
													ТаблицаВладелец,
													ТаблицаПодчиненная,
													Копирование,
													Отказ,
													ДополнительныеПараметры = Неопределено) Экспорт
															
	Если НЕ Отказ И Копирование Тогда				
		
		Отказ = Истина;
		
		ЕстьТаблицаРаспределенияПоПериодам = ЕстьТаблицаРаспределенияПоПериодам(ДополнительныеПараметры);
		
		КопируемаяСтрока = ЭтаФорма.Элементы[ТаблицаВладелец].ТекущиеДанные;
		ТекущийИндекс = КопируемаяСтрока.ИндексСтрокРаспределения;
						
		НовыйИндексСтрокРаспределения = упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект[ТаблицаВладелец]);
		
		СозданнаяСтрока = Объект[ТаблицаВладелец].Добавить();
		ЗаполнитьЗначенияСвойств(СозданнаяСтрока, КопируемаяСтрока, , "ИндексСтрокРаспределения");
		СозданнаяСтрока.ИндексСтрокРаспределения = НовыйИндексСтрокРаспределения;
		
		Если ТаблицаВладелец = "Субпродукты" Тогда
			Если КопируемаяСтрока.Основной Тогда
				СозданнаяСтрока.Основной = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущийИндекс <> Неопределено Тогда
			
			ОтборСтрок = Новый Структура("ИндексСтрокиВладельца", ТекущийИндекс);			
			ТекущиеСтрокиПодчиненные = Объект[ТаблицаПодчиненная].НайтиСтроки(ОтборСтрок);
						
			ПересчитыватьКоличество = КопируемаяСтрока.Свойство("Количество");
			
			имяКолонкиСумма = "Сумма";
			Если КопируемаяСтрока.Свойство("ОбщСтоимость") Тогда			
				имяКолонкиСумма = "ОбщСтоимость";
			ИначеЕсли КопируемаяСтрока.Свойство("Стоимость") Тогда
				имяКолонкиСумма = "Стоимость";
			КонецЕсли;

			Для Каждого КопируемаяСтрокаВладельца Из ТекущиеСтрокиПодчиненные Цикл
				
				НоваяСтрока = Объект[ТаблицаПодчиненная].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КопируемаяСтрокаВладельца);				
				НоваяСтрока.ИндексСтрокиВладельца = СозданнаяСтрока.ИндексСтрокРаспределения;
												
				Если НоваяСтрока.Свойство("ИндексСтрокРаспределенияПоПериодам") Тогда
															
					Если ТаблицаВладелец = "Субпродукты" Тогда
						
						ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
						ИмяТаблицыРаспределенияПоПериодам = "РаспределениеДоходовПоПериодам"; 
						
					ИначеЕсли ТаблицаВладелец = "ПланДоходов" Тогда
						
						ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияДоходов";
						ИмяТаблицыРаспределенияПоПериодам = "РаспределениеДоходовПоПериодам"; 
						
					ИначеЕсли ТаблицаВладелец = "МатериальныеРесурсы" 
						ИЛИ ТаблицаВладелец = "ДополнительныеЗатраты" Тогда
						
						ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
						ИмяТаблицыРаспределенияПоПериодам = "РаспределениеРасходовПоПериодам"; 											
						
					ИначеЕсли ТаблицаВладелец = "ПланРасходов" Тогда
						
						ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияРасходов";
						ИмяТаблицыРаспределенияПоПериодам = "РаспределениеРасходовПоПериодам"; 							
						
					КонецЕсли;
					
					НовыйИндексРаспределения = Неопределено;
					
					// Обработка таблицы периодов. При вызове из структуры отдельной таблицы периодов нет. 
					Если ЕстьТаблицаРаспределенияПоПериодам Тогда														
					
						ОтборСтрокРаспределенияПоПериодам = Новый Структура(ИмяКолонкиИндекса, КопируемаяСтрокаВладельца.ИндексСтрокРаспределенияПоПериодам);					
						НайденныеСтрокиРаспределенияПоПериодам = Объект[ИмяТаблицыРаспределенияПоПериодам].НайтиСтроки(ОтборСтрокРаспределенияПоПериодам);						
						
						НовыйИндексРаспределения = 
							упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект[ТаблицаПодчиненная],
							"ИндексСтрокРаспределенияПоПериодам");	
						
						НоваяСтрока.ИндексСтрокРаспределенияПоПериодам = НовыйИндексРаспределения;
						
						Для Каждого НайденнаяСтрокаРаспрПоПериодам Из НайденныеСтрокиРаспределенияПоПериодам Цикл
							НоваяСтрока = Объект[ИмяТаблицыРаспределенияПоПериодам].Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрокаРаспрПоПериодам);
							НоваяСтрока[ИмяКолонкиИндекса] = НовыйИндексРаспределения;
						КонецЦикла;
					Иначе
												
						Если НоваяСтрока.СпособПривязки =
							ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда							
							НоваяСтрока.ИндексСтрокРаспределенияПоПериодам = 
								упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект[ТаблицаПодчиненная],
								"ИндексСтрокРаспределенияПоПериодам");							
						Иначе							
							НоваяСтрока.ИндексСтрокРаспределенияПоПериодам = НовыйИндексРаспределения;							
						КонецЕсли;
						
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, ТаблицаВладелец, ТаблицаПодчиненная, ИмяКолонкиСумма, 
				ПересчитыватьКоличество, ЕстьТаблицаРаспределенияПоПериодам);
			
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

// Добавляет строку в таблицу ЭлементПодчиненный и заполняет ее значениями из ЭлементВладелец.
//
// Параметры:
//  Форма					 - УправляемаяФорма			 - форма.
//  Объект					 - 							 - ДанныеФормыСтруктура.
//  ТекущаяСтрокаВладельца	 - ДанныеФормыЭлементКоллекции	 - копируемая строка владельца.
//  ТаблицаВладелец			 - Строка						 - имя элемента управления, содержащего распределяемые строки.
//  ТаблицаПодчиненная		 - Строка						 - имя элемента управления, содержащего распределенные строки.
//  ИмяКолонкиСумма			 - Строка						 - имя колонки, содержащей общую сумму по строке.
//  КопироватьКоличество	 - Булево						 - признак ведения количественного учета.
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции, Неопределено - добавленная строка распределения.
//
Функция СкопироватьСтрокуВладельцаВРаспределение(Форма,
												   Объект,
												   ТекущаяСтрокаВладельца, 
												   ТаблицаВладелец,
												   ТаблицаПодчиненная,
												   ИмяКолонкиСумма = "Сумма",
												   КопироватьКоличество = Ложь) Экспорт 
	
	Если ТекущаяСтрокаВладельца = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Форма.Элементы[ТаблицаПодчиненная].ДобавитьСтроку();
	Форма.Элементы[ТаблицаПодчиненная].ЗакончитьРедактированиеСтроки(Ложь);
	НоваяСтрокаРаспр = Форма.Элементы[ТаблицаПодчиненная].ТекущиеДанные;
	
	Если НоваяСтрокаРаспр = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	НоваяСтрокаРаспр.Сумма = ТекущаяСтрокаВладельца[ИмяКолонкиСумма];
	Форма["Распределено" + ТаблицаВладелец + "Сумма"] = Формат(НоваяСтрокаРаспр.Сумма, "ЧДЦ=2");
	
	Если КопироватьКоличество Тогда
		НоваяСтрокаРаспр.Количество = ТекущаяСтрокаВладельца.Количество;		
		Форма["Распределено" + ТаблицаВладелец + "Количество"] = НоваяСтрокаРаспр.Количество;
	КонецЕсли;
		
	КолонкиВладельца = КолонкиВладельца(ТаблицаВладелец);
	
	Если НоваяСтрокаРаспр.Свойство("СпособПривязки") Тогда
						
		Если ТипЗнч(НоваяСтрокаРаспр.СпособПривязки) = Тип("ПеречислениеСсылка.упоСпособПривязкиРаспределения") Тогда			
			НоваяСтрокаРаспр.СпособПривязки = упоАналитикаПоПодразделениямКлиентСервер.
				СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(ТекущаяСтрокаВладельца[КолонкиВладельца.СпособПривязки]);
		Иначе 
			НоваяСтрокаРаспр.СпособПривязки = ТекущаяСтрокаВладельца[КолонкиВладельца.СпособПривязки];
		КонецЕсли;
		НоваяСтрокаРаспр.ПрофильРаспределения = ТекущаяСтрокаВладельца[КолонкиВладельца.ПрофильРаспределения];
		НоваяСтрокаРаспр.ДатаПривязки = ТекущаяСтрокаВладельца[КолонкиВладельца.ДатаПривязки];
		
	КонецЕсли;
	
	ТаблицыИсключения = ТаблицыНеТребующиеЗаполненияКонтрагентаКакПодрядчика();
	Если ТаблицыИсключения.Найти(ТаблицаПодчиненная) = Неопределено Тогда
		Если НоваяСтрокаРаспр.Свойство("КонтрагентПодрядчик") 
			И Не ЗначениеЗаполнено(НоваяСтрокаРаспр.КонтрагентПодрядчик) Тогда
			НоваяСтрокаРаспр.КонтрагентПодрядчик = ТекущаяСтрокаВладельца[КолонкиВладельца.Контрагент];
		КонецЕсли;
		
		Если НоваяСтрокаРаспр.Свойство("ЗаказДоговорПодрядчика") 
			И Не ЗначениеЗаполнено(НоваяСтрокаРаспр.ЗаказДоговорПодрядчика) Тогда
			НоваяСтрокаРаспр.ЗаказДоговорПодрядчика = ТекущаяСтрокаВладельца[КолонкиВладельца.Договор];
		КонецЕсли;
	КонецЕсли;
		
	Если КолонкиВладельца.Свойство("ИсточникПлана") И НоваяСтрокаРаспр.Свойство("ИсточникПлана") Тогда
		НоваяСтрокаРаспр.ИсточникПлана = ТекущаяСтрокаВладельца[КолонкиВладельца.ИсточникПлана];	
	КонецЕсли;	
	
	Если ТаблицаВладелец = "Субпродукты" И 
		Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
		НоваяСтрокаРаспр.ПроцентРаспределения = 100;
	КонецЕсли;
	
	Возврат НоваяСтрокаРаспр;
	
КонецФункции

// Очищает строки распределения, подчиненные строке-владельцу, и после этого добавляет новую подчиненную 
// строку распределения и заполняет ее значениями из строки владельца.
//
// Параметры:
//	Форма - УправляемаяФорма - форма.
//	ИмяОсновнойТаблицы - Строка - имя элемента управления, содержащего распределяемые строки.
//	ИмяТаблицыРаспределения - Строка - имя элемента управления, содержащего распределенные строки.
//	ИмяКолонкиСумма - Строка - имя колонки, содержащей общую сумму по строке.
//	КопироватьКоличество - Булево - признак ведения количественного учета.
//
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции - новая заполненная строка распределения.
//
Процедура СкопироватьСтрокуВладельцаВРаспределениеСОчисткой(Форма, 
															ИмяОсновнойТаблицы, 
															ИмяТаблицыРаспределения, 
															ИмяКолонкиСумма, 
															КопироватьКоличество) Экспорт 
	
	КопироватьКоличество = Истина;				
	
	ТекущаяСтрокаВладельца = Форма.Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;
	Если ТекущаяСтрокаВладельца = Неопределено Тогда
		Возврат; // Возврат.
	КонецЕсли;	
	
	упоРаботаСФормамиКлиент.УдалитьРаспределенныеСтрокиВладельца(Форма.Объект, 
																ИмяТаблицыРаспределения, 
																ТекущаяСтрокаВладельца, 
																Ложь);
	
	СтрокаРаспределения = упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределение(Форма, 
																Форма.Объект, 
																ТекущаяСтрокаВладельца,
																ИмяОсновнойТаблицы, 
																ИмяТаблицыРаспределения, 
																ИмяКолонкиСумма, 
																КопироватьКоличество); 																	
															
	упоАналитикаПоПодразделениямКлиентСервер.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(СтрокаРаспределения);
	
КонецПроцедуры

// Удаляет связанные строки из таблицы распределения по периодам при удалении строк из ЭлементВладелец.
//
// Параметры:
//  Объект						 - ДанныеФормыСтруктура - очищаемый объект.
//  Форма						 - УправляемаяФорма	 - форма объекта.
//  ИмяТаблицыРаспределения		 - Строка			 - имя таблицы распределения.
//  ИмяТаблицыПериоды			 - Строка			 - имя таблицы периоды.
//  ИмяКолонкиИндекса			 - Строка			 - имя колонки, содержащей индекс связи.
//  ТекущаяСтрокаРаспределения	 - ДанныеФормыЭлементКоллекции - строка распределения.
//
Процедура ОчиститьСтрокиРаспределенияПоПериодам(Объект, Форма, ИмяТаблицыРаспределения, ИмяТаблицыПериоды,
	ИмяКолонкиИндекса, ТекущаяСтрокаРаспределения = Неопределено) Экспорт
	
	Если ТекущаяСтрокаРаспределения = Неопределено Тогда		
		ТекущаяСтрокаРаспределения = Форма.Элементы[ИмяТаблицыРаспределения].ТекущиеДанные;	
	КонецЕсли;
	
	Если ТекущаяСтрокаРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИсточникПлана = упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ИмяТаблицыРаспределения);		
	
	ТекущийИндексСтрокРаспределения =  ТекущаяСтрокаРаспределения.ИндексСтрокРаспределенияПоПериодам;
	
	Отбор = Новый Структура(ИмяКолонкиИндекса, ТекущийИндексСтрокРаспределения);
	
	Если ИмяТаблицыПериоды <> "ТрудовыеРесурсыПоПериодам" Тогда
		Отбор.Вставить("ИсточникПлана", ИсточникПлана);	
	КонецЕсли;
	
	СтрокиНаУдаление = Объект[ИмяТаблицыПериоды].НайтиСтроки(Отбор);
	
	Для Каждого СтрокаНаУдаление Из СтрокиНаУдаление Цикл
		Объект[ИмяТаблицыПериоды].Удалить(Объект[ИмяТаблицыПериоды].Индекс(СтрокаНаУдаление));
	КонецЦикла;   
	
КонецПроцедуры

#Область ПроцедурыИФункцииУправленияЭлементамиНастроекПоПодразделениям

// Устанавливает признаки настроек в ЛОЖЬ при изменении значений указанных выше настроек.
//
// Параметры:
//	Элемент - ЭлементУправления - ЭУ формы, содержащий настройку.
//	ЭтаФорма - УправляемаяФорма - формаю
//	Объект - ДанныеФормыСтруктура - Проект или Портфель проектов.
Процедура ДоходыПоПодразделениямПриИзменении(Элемент, ЭтаФорма, Объект) Экспорт
	
	Если Элемент.Имя = "ВедетсяБюджетДоходов" Тогда
		
		Если Объект.ВедетсяБюджетДоходов = Ложь Тогда
			Объект.ДоходыПоПодразделениям = Ложь ;
			Объект.ДоходыПоОбъемам = Ложь;
			Объект.ДоходыПоНатуральнымПоказателям = Ложь;
		КонецЕсли;
	
	ИначеЕсли Элемент.Имя = "ДоходыПоПодразделениям" Тогда
		
		Если Объект.ДоходыПоПодразделениям = Ложь Тогда
			Объект.ДоходыПоОбъемам = Ложь;
			Объект.ДоходыПоНатуральнымПоказателям = Ложь;
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "ДоходыПоОбъемам" Тогда
		
		Если Объект.ДоходыПоОбъемам = Ложь Тогда
			Объект.ДоходыПоНатуральнымПоказателям = Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
	ДоступностьАналитикаВРазрезеПодразделений(ЭтаФорма, Объект);	
	
КонецПроцедуры

// Управление доступностью настроек учета по подразделениям.
//
// Параметры:
//	ЭтаФорма - УправляемаяФорма - форма.
//	Объект - ДанныеФормыСтруктура - Проект или Портфель проектов.
Процедура ДоступностьАналитикаВРазрезеПодразделений(ЭтаФорма, Объект) Экспорт
	
	упоАналитикаПоПодразделениямКлиентСервер.ДоступностьАналитикаВРазрезеПодразделений(ЭтаФорма, Объект);
	
КонецПроцедуры

// Устанавливает признаки настроек в ЛОЖЬ при изменении значений указанных выше настроек.
//
// Параметры:
//	Элемент - ЭлементУправления - элемент управления формы, содержащий настройку.
//	ЭтаФорма - УправляемаяФорма - форма.
//	Объект - ДанныеФормыСтруктура - Проект или Портфель проектов.
Процедура РасходыПоПодразделениямПриИзменении(Элемент, ЭтаФорма, Объект) Экспорт
	
	Если Элемент.Имя = "ВедетсяБюджетРасходов" Тогда
		
		Если Объект.ВедетсяБюджетРасходов = Ложь Тогда
			
			Объект.РасходыПоПодразделениям = Ложь;
			Объект.РасходыПоОбъемам = Ложь;
			Объект.РасходыПоНатуральнымПоказателям = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "РасходыПоПодразделениям" Тогда
		
		Если Объект.РасходыПоПодразделениям = Ложь Тогда
			
			Объект.РасходыПоОбъемам = Ложь;
			Объект.РасходыПоНатуральнымПоказателям = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "РасходыПоОбъемам" Тогда
		
		Если Объект.РасходыПоОбъемам = Ложь Тогда
			
			Объект.РасходыПоНатуральнымПоказателям = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "РасходыПоНатуральнымПоказателям" Тогда
		
		Если Объект.РасходыПоНатуральнымПоказателям = Истина Тогда
			
			Объект.ПланироватьЗатратыНаМатериалы = Истина;
			
		КонецЕсли;
		
	ИначеЕсли Элемент.Имя = "НазначатьРСПОсновнойРолиКакРПЗ" Тогда
		
		Если Объект.УстанавливатьПризнакОсновнаяПриДобавленииРоли = Истина Тогда
			
			Объект.УстанавливатьПризнакОсновнаяПриДобавленииРоли = Ложь;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ДоступностьАналитикаВРазрезеПодразделений(ЭтаФорма, Объект);	
	
КонецПроцедуры

// Вызывает метод упоАналитикаПоПодразделениямКлиентСервер.РаспределениеОбъемовСубподрядСобсСилыПриИзменении
//  для текущей таблицы распределения.
//
// Параметры:
//  ЭлементыФормы						 - ЭлементыФормы
//  ТаблицаРаспределения				 - Строка	 - имя элемента формы, содержащего таблицу распределения.
//  ИспользоватьАналитикуКонтрагентДляСС - Булево	 - признак использования аналитики типа Контрагент
//  	для поля "Собственные силы".
//
Процедура РаспределениеОбъемовСубподрядСобсСилыПриИзменении(ЭлементыФормы, 
	ТаблицаРаспределения, 
	ИспользоватьАналитикуКонтрагентДляСС = Ложь) Экспорт
	
	ТекущиеДанныеРаспределения = ЭлементыФормы[ТаблицаРаспределения].ТекущиеДанные;
	Если ТекущиеДанныеРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	упоАналитикаПоПодразделениямКлиентСервер.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(ТекущиеДанныеРаспределения,
		ИспользоватьАналитикуКонтрагентДляСС);
	
КонецПроцедуры

// Пересчитывает количество при изменении суммы.
//
// Параметры:
//  ЭтаФорма				 - УправляемаяФорма	 - форма.
//  ИмяОсновнойТаблицы		 - Строка			 - имя элемента - Владельца.
//  ИмяТаблицыРаспределения	 - Строка			 - имя элемента - Подчиненного.
//  ТаблицаРаспределения	 - Строка			 - имя таблицы распределения .
//  ИмяКолонкиСумма			 - Строка			 - имя колонки, содержащей общую сумму по строке.
//
Процедура ПересчитатьКоличествоПоДолеСуммы(ЭтаФорма, ИмяОсновнойТаблицы, ИмяТаблицыРаспределения, ТаблицаРаспределения, 
											ИмяКолонкиСумма = "Сумма") Экспорт
	
	ТекущиеДанныеРаспределяемые = ЭтаФорма.Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;
	ТекущиеДанныеРаспределения 	= ЭтаФорма.Элементы[ИмяТаблицыРаспределения].ТекущиеДанные;
	
	Если ТекущиеДанныеРаспределения = Неопределено Тогда
		Возврат; // Возврат.
	КонецЕсли;		
	
	Если ТекущиеДанныеРаспределения.Количество = 0 Тогда
		Возврат; // Возврат.
	КонецЕсли;	
	
	СССП_НДС = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС");
	
	ВРаспределенииМожетБытьНДС = ТекущиеДанныеРаспределения.Свойство("СобствСилы_Субподряд");
	
	ЭтоСтрокаНДС = ВРаспределенииМожетБытьНДС
		И ТекущиеДанныеРаспределения.СобствСилы_Субподряд = СССП_НДС;
		
	Если ЭтоСтрокаНДС Тогда		
		ТекущиеДанныеРаспределения.Количество = 0;
		Возврат; // Возврат.
	КонецЕсли;	
					
	// Если в строках есть НДС, то надо пересчитать сумму НДС и считать долю от суммы без НДС.		
	СуммаНДС = 0;
	
	Если ВРаспределенииМожетБытьНДС Тогда
		Для Каждого СтрокаРаспределения Из ТаблицаРаспределения Цикл			
			Если СтрокаРаспределения.СобствСилы_Субподряд = СССП_НДС Тогда 
				СуммаНДС = СуммаНДС + СтрокаРаспределения.Сумма;		
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	СуммаОбщая = ТекущиеДанныеРаспределяемые[ИмяКолонкиСумма] - СуммаНДС;
	Если СуммаОбщая <> 0 Тогда
		СуммаТекущая = ТекущиеДанныеРаспределения.Сумма;		
		Доля = СуммаТекущая / СуммаОбщая;	
		ТекущиеДанныеРаспределения.Количество = ТекущиеДанныеРаспределяемые.Количество * Доля;
	КонецЕсли;
						

КонецПроцедуры

// Пересчет суммы по количеству в текущей строке активной таблицы формы.
//
// Параметры:
//  Форма					 - УправляемаяФорма
//  ИмяОсновнойТаблицы		 - Строка
//  ИмяТаблицыРаспределения	 - Строка
//
Процедура ПересчитатьСуммуПоКоличеству(Форма, ИмяОсновнойТаблицы, ИмяТаблицыРаспределения) Экспорт
	
	Элементы = Форма.Элементы;
	
	ТекДанныеРаспределяемые = Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;
	Если ТекДанныеРаспределяемые = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеРаспределения = Элементы[ИмяТаблицыРаспределения].ТекущиеДанные;
	Если ТекДанныеРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанныеРаспределения.Сумма = ТекДанныеРаспределения.Количество * ТекДанныеРаспределяемые.Стоимость;
	
КонецПроцедуры

// Обработчик при изменении роли строки распределения.
//
// Параметры:
//	ТекущаяСтрокаРаспределения - ДанныеФормыЭлементКоллекции - структура - данные строки.
Процедура СтрокиРаспределенияРольПриИзменении(ТекущаяСтрокаРаспределения) Экспорт
	
	Если ТекущаяСтрокаРаспределения  <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрокаРаспределения.Роль) Тогда
			ТекущаяСтрокаРаспределения.СобствСилы_Субподряд = упоАналитикаПоПодразделениямСервер.СССП_Роли(ТекущаяСтрокаРаспределения.Роль);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Управление доступностью поля "Договор" при открытии форм с подчинеными таблицами распределения.
//
// Параметры:
//	ТабличнаяЧасть - ДанныеФормыКоллекция - табличная часть формы, для которой устанавливается доступность колонки договора контрагента.
//
Процедура УстановитьДоступностьДоговораИсполнителя(ТабличнаяЧасть) Экспорт
	
	Для Каждого СтрокаРаспределения Из ТабличнаяЧасть Цикл
		упоАналитикаПоПодразделениямКлиентСервер.ЗаполнитьСвойствоИсполнительКонтрагент(СтрокаРаспределения);		
	КонецЦикла	
	
КонецПроцедуры	

// Устанавливает индекс распределения для новой строки.
//
// Параметры:
//	Объект - УправляемаяФорма, ДанныеФормыКоллекция - форма или объект, для табличной части которого устанавливается индекс распределения.
//	СтрокаСДанными -  ДанныеФормыСтруктура, ДанныеФормыЭлементКоллекции - данные строки, для которой устанавливается индекс распределения.
//	ИмяТаблицыСтрокиСДанными -  Строка - имя таблицы с данными строки, для которой устанавливается индекс распределения.
//
Процедура УстановитьИндексСтрокРаспределенияВСтрокеТаблицы(Объект, СтрокаСДанными, ИмяТаблицыСтрокиСДанными) Экспорт
	
	Если СтрокаСДанными.ИндексСтрокРаспределения = Неопределено Тогда
		СтрокаСДанными.ИндексСтрокРаспределения = 
			упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект[ИмяТаблицыСтрокиСДанными]);	
	КонецЕсли;
	
КонецПроцедуры

// Пропорциональное изменение количества и суммы в строке таблице периодов при изменении количества в одном из периодов.
//
// Параметры:
//	Форма - УправляемаяФорма - форма владелец.
//	ИмяРеквизитаТекущее - Строка - имя редактируемой колонки периода.
//	ИмяОсновнойТаблицы - Строка - имя основной таблицы.
//	ИмяТаблицыВладельца - Строка - имя таблицы распределения, в которой редактируется количество в периоде.
//
Процедура РаспределениеПоМесяцамКоличествоПриИзменении(Форма, ИмяРеквизитаТекущее, ИмяОсновнойТаблицы, ИмяТаблицыВладельца,
	ТаблицаРаспределения, ВызовИзСтруктуры = Ложь) Экспорт
	
	Элементы = Форма.Элементы;
	
	ТекущиеДанныеОсновнойТаблицы = Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;
	Если ТекущиеДанныеОсновнойТаблицы <> Неопределено Тогда
		
		СтоимостьТекущаяБезНДС = СтоимостьБезНДС(ТаблицаРаспределения, ТекущиеДанныеОсновнойТаблицы);						
		ТекущиеДанныеРаспределенияПоПериодам = Элементы[ИмяТаблицыВладельца].ТекущиеДанные;
		
		ИмяРеквизитаСумма = СтрЗаменить(ИмяРеквизитаТекущее, "Количество", "Сумма");
		Если СтоимостьТекущаяБезНДС = 0 Тогда
			ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаСумма] = 0;
			Возврат;
		КонецЕсли;
		
		КоличествоТекущее  = ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаТекущее];		
		ОбщСтоимостьТекущая = КоличествоТекущее * СтоимостьТекущаяБезНДС;
		
		Если ВызовИзСтруктуры Тогда
			НеРаспределеноКоличество = ТекущиеДанныеРаспределенияПоПериодам.НеРаспределеноКоличество;
			НеРаспределеноСумма = ТекущиеДанныеРаспределенияПоПериодам.НеРаспределеноСумма;
		Иначе
			НеРаспределеноКоличество =  ТекущиеДанныеРаспределенияПоПериодам.КоличествоОстаток;
			НеРаспределеноСумма = ТекущиеДанныеРаспределенияПоПериодам.СуммаОстаток;			
		КонецЕсли;
		
		ТекущаяСумма = ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаСумма];
		КоличествоБыло = Окр(ТекущаяСумма / СтоимостьТекущаяБезНДС, 3);
		РазницаВКоличестве = КоличествоТекущее - КоличествоБыло;
		
		Если РазницаВКоличестве = НеРаспределеноКоличество Тогда		
			ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаСумма] = ТекущаяСумма + НеРаспределеноСумма;
		Иначе		
			ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаСумма] = ОбщСтоимостьТекущая;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Пропорциональное изменение количества и суммы в строке таблицы периодов при изменении суммы в одном из периодов.
//
// Параметры:
//	Форма - УправляемаяФорма - форма владелец.
//	ИмяРеквизитаТекущее - Строка - имя редактируемой колонки периода.
//	ИмяОсновнойТаблицы - Строка - имя основной таблицы.
//	ИмяТаблицыВладельца - Строка - имя таблицы распределения, в которой редактируется сумма в периоде.
//
Процедура РаспределениеПоМесяцамСуммаПриИзменении(Форма, ИмяРеквизитаТекущее, ИмяОсновнойТаблицы, ИмяТаблицыВладельца, 
	ТаблицаРаспределения) Экспорт
	
	Элементы = Форма.Элементы;
	
	ТекущиеДанныеОсновнойТаблицы = Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;	
	Если ТекущиеДанныеОсновнойТаблицы <> Неопределено Тогда
		
		СССП_НДС = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС");
		
		СтоимостьТекущаяБезНДС = СтоимостьБезНДС(ТаблицаРаспределения, ТекущиеДанныеОсновнойТаблицы);				
		
		ТекущиеДанныеРаспределенияПоПериодам = Элементы[ИмяТаблицыВладельца].ТекущиеДанные;
		ОбщСтоимостьТекущая  = ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаТекущее];
		Если СтоимостьТекущаяБезНДС <> 0 Тогда
			
			Если ТекущиеДанныеРаспределенияПоПериодам.СобствСилы_Субподряд = СССП_НДС Тогда
				КоличествоТекущее = 0;
			Иначе
				КоличествоТекущее = Окр(ОбщСтоимостьТекущая/СтоимостьТекущаяБезНДС, 3);
			КонецЕсли;
		
			ИмяРеквизитаКоличество = СтрЗаменить(ИмяРеквизитаТекущее, "Сумма", "Количество");
			ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаКоличество]  = КоличествоТекущее;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьРаспределениеПередЗаписьюЗавершение1(Ответ, ДополнительныеПараметры) Экспорт
	
	ПараметрыОбъекта = ДополнительныеПараметры.ПараметрыОбъекта;
	ИмяТаблицыВладельца = ДополнительныеПараметры.ТаблицаВладелец;
	
	Если ДополнительныеПараметры.ОчиститьВходящееДопОписаниеОповещения Тогда
		ДополнительныеПараметры.ВходящееДопОписаниеОповещения = Неопределено;
		ДополнительныеПараметры.ОчиститьВходящееДопОписаниеОповещения = Ложь;
	КонецЕсли;
	
	ПараметрыОбъекта.КолвоОтветов = ПараметрыОбъекта.КолвоОтветов + 1;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество в строке не совпадает с распределенным количеством.'");
		ИндексСтроки = ДополнительныеПараметры.Объект[ИмяТаблицыВладельца].Индекс(ДополнительныеПараметры.СтрокаВладелец);		
		Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.%1[%2].Количество",
																		ИмяТаблицыВладельца,
																		Формат(ИндексСтроки,"ЧН=0; ЧГ=0"));						
			
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле);
		
		ПараметрыОбъекта.Результат = Ложь;
		
	Иначе
		
		ДополнительныеПараметры.СтрокаВладелец.Количество = ДополнительныеПараметры.КоличествоРаспределенное;
		Если ИмяТаблицыВладельца = "ЗатратыМатРесурсовФакт" Тогда			
			
			УстановитьСтоимостьПриИзмененииОбщейСтоимостиКоличества(ДополнительныеПараметры);
											
		КонецЕсли;	
		
		Если ДополнительныеПараметры.ЭтоПроектнаяПродукция Тогда
			ДополнительныеПараметры.СтрокаВладелец.Нормирование = ДополнительныеПараметры.НормированиеРаспределенное;
			ДополнительныеПараметры.СтрокаВладелец.Трудоемкость = ДополнительныеПараметры.ТрудоемкостьРаспределенная;			
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры.ПараметрыОбъекта = ПараметрыОбъекта;
	
	Если ПараметрыОбъекта.КолвоОтветов = ПараметрыОбъекта.КолвоВопросов 
		И ДополнительныеПараметры.ВходящееОписаниеОповещения <> Неопределено Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВходящееОписаниеОповещения, ПараметрыОбъекта.Результат);
		
	ИначеЕсли ПараметрыОбъекта.КолвоОтветов <> ПараметрыОбъекта.КолвоВопросов Тогда 
		
		Если ДополнительныеПараметры.ВходящееДопОписаниеОповещения <> Неопределено Тогда		
			ДополнительныеПараметры.ОчиститьВходящееДопОписаниеОповещения = Истина;
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВходящееДопОписаниеОповещения, ПараметрыОбъекта.Результат);
		КонецЕсли;

		Если ДополнительныеПараметры.ОписаниеОповещенияОбновитьИтогиТаблицыВладельца <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОбновитьИтогиТаблицыВладельца,
				ПараметрыОбъекта.Результат);
		КонецЕсли;

	КонецЕсли;
	
	Если ПараметрыОбъекта.Результат И ДополнительныеПараметры.ОписаниеОповещенияОбновитьТрансляцию <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОбновитьТрансляцию, ПараметрыОбъекта.Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьРаспределениеПередЗаписьюЗавершение2(Ответ, ДополнительныеПараметры) Экспорт
	
	ПараметрыОбъекта = ДополнительныеПараметры.ПараметрыОбъекта;
	ИмяТаблицыВладельца = ДополнительныеПараметры.ТаблицаВладелец;
	
	Если ДополнительныеПараметры.ОчиститьВходящееДопОписаниеОповещения Тогда
		ДополнительныеПараметры.ВходящееДопОписаниеОповещения = Неопределено;
		ДополнительныеПараметры.ОчиститьВходящееДопОписаниеОповещения = Ложь;
	КонецЕсли;
	
	ПараметрыОбъекта.КолвоОтветов = ПараметрыОбъекта.КолвоОтветов + 1;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		ТекстСообщения = НСтр("ru = 'Сумма в строке не совпадает с распределенной суммой.'");
		ИндексСтроки = ДополнительныеПараметры.Объект[ИмяТаблицыВладельца].Индекс(ДополнительныеПараметры.СтрокаВладелец);		
		Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.%1[%2].%3",
																		ИмяТаблицыВладельца,
																		Формат(ИндексСтроки,"ЧН=0; ЧГ=0"),
																		ДополнительныеПараметры.ИмяКолонкиВладелец);		
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле);
		
		ПараметрыОбъекта.Результат = Ответ;
		
	Иначе
		
		ДополнительныеПараметры.СтрокаВладелец[ДополнительныеПараметры.ИмяКолонкиВладелец] 
			= ДополнительныеПараметры.СуммаРаспределенная;
		Если ИмяТаблицыВладельца = "МатериальныеРесурсы" 
			Или ИмяТаблицыВладельца = "Субпродукты" 
			Или ИмяТаблицыВладельца = "ЗатратыМатРесурсовФакт" Тогда
			
			УстановитьСтоимостьПриИзмененииОбщейСтоимостиКоличества(ДополнительныеПараметры);
									
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры.ПараметрыОбъекта = ПараметрыОбъекта;
	
	Если ПараметрыОбъекта.КолвоОтветов = ПараметрыОбъекта.КолвоВопросов 
		И ДополнительныеПараметры.ВходящееОписаниеОповещения <> Неопределено Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВходящееОписаниеОповещения, ПараметрыОбъекта.Результат);
		
	ИначеЕсли ПараметрыОбъекта.КолвоОтветов <> ПараметрыОбъекта.КолвоВопросов Тогда
		
		Если ДополнительныеПараметры.ВходящееДопОписаниеОповещения <> Неопределено Тогда
			ДополнительныеПараметры.ОчиститьВходящееДопОписаниеОповещения = Истина;
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВходящееДопОписаниеОповещения, ПараметрыОбъекта.Результат);
		КонецЕсли;

		Если ДополнительныеПараметры.ОписаниеОповещенияОбновитьИтогиТаблицыВладельца <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОбновитьИтогиТаблицыВладельца,
				ПараметрыОбъекта.Результат);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСтоимостьПриИзмененииОбщейСтоимостиКоличества(ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(ДополнительныеПараметры.КоличествоРаспределенное) Тогда
		Стоимость = ДополнительныеПараметры.СуммаРаспределенная;
	Иначе								
		Стоимость = ДополнительныеПараметры.СуммаРаспределенная / ДополнительныеПараметры.КоличествоРаспределенное;
	КонецЕсли;			
	ДополнительныеПараметры.СтрокаВладелец.Стоимость = Стоимость;
	
КонецПроцедуры	

Функция КолонкиВладельца(ИмяТаблицы)
	
	КолонкиСтруктура = Новый Структура("СпособПривязки, ПрофильРаспределения, ДатаПривязки, Контрагент, Договор");
			
	Если ИмяТаблицы = "ДополнительныеЗатраты" Тогда
		КолонкиСтруктура.СпособПривязки = "СпособПривязкиДоходовРасходов";
		КолонкиСтруктура.ПрофильРаспределения = "ПрофильРаспределенияДоходовРасходов";
		КолонкиСтруктура.ДатаПривязки = "ДатаПривязкиДоходовРасходов";
		КолонкиСтруктура.Контрагент = "КонтрагентДоходовРасходов";
		КолонкиСтруктура.Договор = "ДоговорДоходовРасходов";		
	Иначе
		КолонкиСтруктура.СпособПривязки = "СпособПривязки";
		КолонкиСтруктура.ПрофильРаспределения = "ПрофильРаспределения";
		КолонкиСтруктура.ДатаПривязки = "ДатаПривязки";
		КолонкиСтруктура.Контрагент = "Контрагент";
		КолонкиСтруктура.Договор = "Договор";
		Если ИмяТаблицы = "ПланДоходов" Или ИмяТаблицы = "ПланРасходов" Тогда
			КолонкиСтруктура.Вставить("ИсточникПлана", "ИсточникПлана");		
		КонецЕсли;	
	КонецЕсли;
	
	Возврат КолонкиСтруктура;
		
КонецФункции	

Функция ЕстьТаблицаРаспределенияПоПериодам(ПараметрыРаспределения)
	
	ЕстьТаблицаРаспределенияПоПериодам = Истина;
	Если ТипЗнч(ПараметрыРаспределения) = Тип("Структура") 
		И ПараметрыРаспределения.Свойство("ЕстьТаблицаРаспределенияПоПериодам") Тогда
		ЕстьТаблицаРаспределенияПоПериодам = ПараметрыРаспределения.ЕстьТаблицаРаспределенияПоПериодам;
	КонецЕсли;
	
	Возврат ЕстьТаблицаРаспределенияПоПериодам;
	
КонецФункции

Функция ТаблицыНеТребующиеЗаполненияКонтрагентаКакПодрядчика()
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("РаспределениеОбъемов");
	Таблицы.Добавить("СубпродуктыПоПодразделениям");
	Таблицы.Добавить("РаспределениеДоходов");
	Таблицы.Добавить("ПланДоходовПоПодразделениям");
	
	Возврат Таблицы;
	
КонецФункции

Функция СтоимостьБезНДС(ТаблицаРаспределения, ТекущиеДанныеОсновнойТаблицы)

	СССП_НДС = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС");
	
	ОтборСтрокСНДС = Новый Структура("СобствСилы_Субподряд", СССП_НДС); 
	СтрокиНДС = ТаблицаРаспределения.НайтиСтроки(ОтборСтрокСНДС);
	СуммаНДС = 0;
	Для каждого СтрокаНДС Из СтрокиНДС Цикл
		СуммаНДС = СуммаНДС + СтрокаНДС.Сумма;
	КонецЦикла;
	
	СтоимостьБезНДС = (ТекущиеДанныеОсновнойТаблицы.ОбщСтоимость - СуммаНДС) / ТекущиеДанныеОсновнойТаблицы.Количество;
	
    Возврат СтоимостьБезНДС;
	
КонецФункции

Процедура ДобавитьОповещениеОбновленияИтогов(Объект, ПараметрыПроверки, ДополнительныеПараметры)
	
	ОбновитьИтоги = ПараметрыПроверки.Свойство("ОбновитьИтогиТаблицыВладельца") 
		И ПараметрыПроверки.ОбновитьИтогиТаблицыВладельца;
	
	Если Не ОбновитьИтоги Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПроверки.Свойство("Форма") Тогда
		Форма = ПараметрыПроверки.Форма;							
	Иначе
		Форма = Объект;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьИтогиЗавершение", Форма, ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияОбновитьИтогиТаблицыВладельца", ОписаниеОповещения);
								
КонецПроцедуры

#КонецОбласти