
&НаСервере
&ИзменениеИКонтроль("УстановитьДоступностьКоманд")
Процедура Расш1_УстановитьДоступностьКоманд()
	
	#Вставка
	ДоступноРедактированиеФайла = ДоступноРедактированиеФайла(ТипЗнч(ВладелецФайла), Автор);  //[+] ИКТ №20078 (строка ДОБАВЛЕНА), Новоселов, 30.07.2026 
	#КонецВставки
	РедактируетсяДругимПользователем = Редактируется И Не РедактируетсяТекущимПользователем;

	МожноЗахватить = ДоступенЗахватИРедактирование
	И Не РедактируетсяДругимПользователем
	И РазрешеноРедактирование
	И Не Зашифрован
	#Вставка
	И ДоступноРедактированиеФайла  //[+] ИКТ №20078 (строка ДОБАВЛЕНА), Новоселов, 30.07.2026 
	#КонецВставки
	И Не ЕстьПодписи;
	#Удаление
	МожноЗакончитьРедактирование = Существует И РедактируетсяТекущимПользователем И Не Зашифрован И Не ЕстьПодписи;
	#КонецУдаления
	#Вставка
	//{[*] ИКТ №20078 (фрагмент ИЗМЕНЕН), Новоселов, 30.07.2026 
	МожноЗакончитьРедактирование = Существует
		И РедактируетсяТекущимПользователем
		И Не Зашифрован
		И ДоступноРедактированиеФайла
		И Не ЕстьПодписи;
	//[*]} ИКТ №20078
	#КонецВставки

	Элементы.ФормаПоказатьВСписке.Доступность = Существует И Не Зашифрован;
	Элементы.ОткрытьНаЧтение.Доступность = Существует И Не Зашифрован;
	Элементы.ПанельОткрытьНаЧтение.Доступность = Существует И Не Зашифрован;
	Элементы.СохранитьНаДиск.Доступность = Существует И Не Зашифрован;
	Элементы.ПанельСохранитьНаДиск.Доступность = Существует И Не Зашифрован;
	Элементы.ФайловыеОперацииЕще.Доступность = Существует И Не Зашифрован;
	Элементы.ПанельОткрытьКаталогФайла.Доступность = Существует И Не Зашифрован;

	Элементы.ГруппаЭП.Доступность = Существует И Не Зашифрован;
	Элементы.ГруппаКомандыЭП.Доступность = Существует И Не Зашифрован;

	Элементы.ОткрытьДляРедактирования.Доступность = Существует И МожноЗахватить;
	Элементы.ПанельОткрытьДляРедактирования.Доступность = Существует И МожноЗахватить;

	Элементы.ЗакончитьРедактирование.Доступность = МожноЗакончитьРедактирование;
	Элементы.ПанельЗакончитьРедактирование.Доступность = МожноЗакончитьРедактирование;
	Элементы.ПанельСохранитьИзменения.Доступность = МожноЗакончитьРедактирование;
	Элементы.ПанельОтменитьРедактирование.Доступность = МожноЗакончитьРедактирование;

	Элементы.ПанельОбновитьИзФайлаНаДиске.Доступность = Существует И МожноЗахватить;

КонецПроцедуры

//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 30.07.2026 
&НаСервереБезКонтекста
Функция ДоступноРедактированиеФайла(ТипВладельцаФайла, АвторФайла)
	
	Автор = ?(ТипЗнч(АвторФайла) = Тип("Строка"), Справочники.Пользователи.НайтиПоНаименованию(АвторФайла), АвторФайла);
	
	Если Автор = Пользователи.ТекущийПользователь() Тогда
		Возврат Истина;
	ИначеЕсли Автор = Справочники.Пользователи.ПустаяСсылка() Тогда
		Общегоназначения.СообщитьПользователю("Не удалось установить связь автора файла с пользователем системы!");
	КонецЕсли;
	
	Если ТипВладельцаФайла = Тип("СправочникСсылка.Проекты") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектов");
	ИначеЕсли ТипВладельцаФайла = Тип("ДокументСсылка.упоПроектнаяЗадача")
			Или ТипВладельцаФайла = Тип("СправочникСсылка.упоЗадания") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектныхЗадачЗаданий");
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ФайловыеОперацииЕще")
Процедура Расш1_ФайловыеОперацииЕще(Команда)

	Подменю = Новый СписокЗначений;
	Если ДоступенЗахватИРедактирование Тогда
		Подменю.Добавить("ОткрытьКаталогФайла", НСтр("ru = 'Открыть каталог файла';
		|en = 'Open file directory'"),,
		БиблиотекаКартинок.Папка);
	КонецЕсли;
	Если (Не Редактируется Или РедактируетсяТекущимПользователем) И РазрешеноРедактирование И Не ЕстьПодписи Тогда
		Подменю.Добавить("ОбновитьИзФайлаНаДиске", НСтр("ru = 'Обновить из файла на диске';
		|en = 'Update from a file on a hard drive.'"),,
		БиблиотекаКартинок.ОбновитьФайлИзФайлаНаДиске);
	КонецЕсли;
	Если ДоступенЗахватИРедактирование И РедактируетсяТекущимПользователем И Не ЕстьПодписи Тогда
		Подменю.Добавить("ОтменитьРедактирование", НСтр("ru = 'Отменить редактирование';
		|en = 'Cancel editing'"),,
		БиблиотекаКартинок.ОсвободитьФайл);
		Если РазрешеноРедактирование Тогда
			Подменю.Добавить("СохранитьИзменения", НСтр("ru = 'Сохранить изменения';
			|en = 'Save changes'"),,
			БиблиотекаКартинок.ОпубликоватьФайл);
		КонецЕсли;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ФайловыеОперацииЕщеПослеВыбора", ЭтотОбъект);
	ПоказатьВыборИзМеню(ОписаниеОповещения, Подменю, Элементы.ФайловыеОперацииЕще);

КонецПроцедуры

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДоступенЗахватИРедактирование = ДоступенЗахватИРедактирование И ДоступноРедактированиеФайла(ТипЗнч(ВладелецФайла), Автор);
	РазрешеноРедактирование = РазрешеноРедактирование И ДоступноРедактированиеФайла(ТипЗнч(ВладелецФайла), Автор);	
	
КонецПроцедуры
//[+]} ИКТ №20612
