
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
				
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка); 		
	
	Параметры.Свойство("ВидСобытия",ВидСобытия);
	Параметры.Свойство("Источник",Источник);
	
	масВидыПолучателей = Неопределено;
	Параметры.Свойство("масВидыПолучателей",масВидыПолучателей);
	Если ТипЗнч(масВидыПолучателей) = Тип("Массив") Тогда
		Для Каждого Эл Из масВидыПолучателей Цикл
			Элементы.ВидПолучателя.СписокВыбора.Добавить(Эл);	
		КонецЦикла;
		Если масВидыПолучателей.Количество() = 1 Тогда
			ВидПолучателя = масВидыПолучателей[0];
			УстановитьТипПолучателя();
		КонецЕсли;
	КонецЕсли;
	
	масТранспорт = Неопределено;
	Параметры.Свойство("масТранспорт",масТранспорт);
	Если ТипЗнч(масТранспорт) = Тип("Массив") Тогда
		Для Каждого Эл Из масТранспорт Цикл
			Элементы.Транспорт.СписокВыбора.Добавить(Эл);	
		КонецЦикла;
		Если масТранспорт.Количество() = 1 Тогда
			Транспорт = масТранспорт[0];
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Источник) Тогда
		ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(Источник,"Ссылка");
		Если ОписаниеТипаРеквизита <> Неопределено Тогда 
			Элементы.ИсточникСсылка.ОграничениеТипа = ОписаниеТипаРеквизита;
			упоОповещенияВызовСервера.ДобавитьПараметрыВыбораПроектныхЗадачИПроекта(Источник, Элементы.ИсточникСсылка);			
		КонецЕсли;		
	КонецЕсли;
	
	НедоступныеТранспортыПроверкаИТС =
		упоОповещенияВызовСервера.НедоступныеТранспортыОтправкиОповещенийПроверкаИТС();
	ЭтотОбъект.НедоступныеТранспортыОтправкиОповещений.ЗагрузитьЗначения(НедоступныеТранспортыПроверкаИТС);
	
	ВосстановитьПараметры();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
   
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
	СохранитьПараметры(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПолучателяПриИзменении(Элемент)
	УстановитьТипПолучателя();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	НайденноеЗначение = НедоступныеТранспортыОтправкиОповещений.НайтиПоЗначению(Транспорт);
	Если НайденноеЗначение <> Неопределено Тогда
		ШаблонСообщения = НСтр("ru = 'Отправка оповещений через транспорт ""%1"" доступна только при наличии активной подписки ИТС.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(НайденноеЗначение));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщениеОбОшибках, Отправить", "", Истина);
	РезОтправки = упоОповещенияВызовСервера.ДобавитьСообщение(
		ВидСобытия, ИсточникСсылка, ИсточникДопПараметр, ВидПолучателя, Получатель, Транспорт, ДопПараметры);
		
	Если Не ПустаяСтрока(ДопПараметры.СообщениеОбОшибках) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = '" + ДопПараметры.СообщениеОбОшибках + "'");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если РезОтправки <> Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Сообщение было успешно отправлено.'");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщениеВОчередь(Команда)
	
	НайденноеЗначение = НедоступныеТранспортыОтправкиОповещений.НайтиПоЗначению(Транспорт);
	Если НайденноеЗначение <> Неопределено Тогда
		ШаблонСообщения = НСтр("ru = 'Отправка оповещений через транспорт ""%1"" доступна только при наличии активной подписки ИТС.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(НайденноеЗначение));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СообщениеОбОшибках, Отправить", "", Ложь);
	РезОтправки = упоОповещенияВызовСервера.ДобавитьСообщение(
		ВидСобытия, ИсточникСсылка, ИсточникДопПараметр, ВидПолучателя, Получатель, Транспорт, ДопПараметры);
	
	Если Не ПустаяСтрока(ДопПараметры.СообщениеОбОшибках) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = '" + ДопПараметры.СообщениеОбОшибках + "'");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если РезОтправки <> Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Сообщение было успешно добавлено в очередь.'");
		Сообщение.Сообщить();		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПодготовитьСтруктуруНастроек(ЭтаФорма) 
	
	Пар = Новый Структура;
	Пар.Вставить("ВидСобытия",ЭтаФорма.ВидСобытия);
	Пар.Вставить("ИсточникСсылка",ЭтаФорма.ИсточникСсылка);
	Пар.Вставить("ИсточникДопПараметр",ЭтаФорма.ИсточникДопПараметр);
	Пар.Вставить("ВидПолучателя",ЭтаФорма.ВидПолучателя);
	Пар.Вставить("Получатель",ЭтаФорма.Получатель);
	Пар.Вставить("Транспорт",ЭтаФорма.Транспорт);
	
	Возврат Пар;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьПараметры(ЭтаФорма)
	
	Настройки = ПодготовитьСтруктуруНастроек(ЭтаФорма);	
	СохранитьВХранилище(Настройки);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СохранитьВХранилище(Настройки) 
	
	Если ЗначениеЗаполнено(Настройки.ВидСобытия) Тогда
		Ключ = ""+Настройки.ВидСобытия.УникальныйИдентификатор();
	Иначе
		Ключ = "";
	КонецЕсли;
	
	ХранилищеОбщихНастроек.Сохранить("ФормаТестаОтправкиСообщения", Ключ, Настройки);
	
КонецФункции

&НаСервере
Процедура ВосстановитьПараметры()
	
	Если ЗначениеЗаполнено(ВидСобытия) Тогда
		Ключ = ""+ВидСобытия.УникальныйИдентификатор();
	Иначе
		Ключ = "";
	КонецЕсли;
	
	Пар = ХранилищеОбщихНастроек.Загрузить("ФормаТестаОтправкиСообщения", Ключ);

	Если Пар = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсточникСсылка) И ВидСобытия = Пар.ВидСобытия Тогда
		//ИсточникСсылка = Пар.ИсточникСсылка;
		Пар.Свойство("ИсточникСсылка", ИсточникСсылка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсточникДопПараметр) И ВидСобытия = Пар.ВидСобытия Тогда
		//ИсточникСсылка = Пар.ИсточникСсылка;
		Пар.Свойство("ИсточникДопПараметр", ИсточникДопПараметр);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПолучателя) И ВидСобытия = Пар.ВидСобытия Тогда
		//ВидПолучателя = Пар.ВидПолучателя;
		Пар.Свойство("ВидПолучателя", ВидПолучателя);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Получатель) И ВидСобытия = Пар.ВидСобытия И ВидПолучателя = Пар.ВидПолучателя Тогда
		//Получатель = Пар.Получатель;
		Пар.Свойство("Получатель", Получатель);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Транспорт) И ВидСобытия = Пар.ВидСобытия И ВидПолучателя = Пар.ВидПолучателя Тогда
		Пар.Свойство("Транспорт", Транспорт);
		//Транспорт = Пар.Транспорт;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипПолучателя()
	
	ИмяТаблицы = ВидПолучателя.ТаблицаПолучателя;
	ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ИмяТаблицы,"Ссылка");
	Если ОписаниеТипаРеквизита <> Неопределено Тогда
		Элементы.Получатель.ОграничениеТипа = ОписаниеТипаРеквизита;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
