
&После("ОбработкаПроверкиЗаполнения")
Процедура ИКТ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УдалитьНепроверяемыеРеквизиты(ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНепроверяемыеРеквизиты(ПроверяемыеРеквизиты)
	
	Если ИКТ_ЗП_УОС.ЭтоУОС(Владелец) Тогда
		Возврат;
	КонецЕсли;              
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_ДолжностьС");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_IDДолжностьС");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_НомерГруппыПодбора");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_ТипПроверкиКандидатовДБ");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_ВидИнцидентаПоКРВ");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_УровеньДоступа");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_Должность");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_Группа");
	МассивНепроверяемыхРеквизитов.Добавить("ИКТ_Грейд");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ID_ДолжностьS = "";
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура ИКТ_ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда  
		Если Не ЗначениеЗаполнено(ID_ДолжностьS) Тогда
			ID_ДолжностьS = ИКТ_ОбщийМодульСервер.ПолучитьНовыйНомер("SD000000", "SD999999", "ШтатноеРасписание", "ID_ДолжностьS"); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
