#Область ПрограммныйИнтерфейс

// Открывает форму обработки "Упрощенный ввод структуры проекта".
//
// Параметры:
//  ПрограммаПроектаИлиПроектКакПрограмма	 - СправочникСсылка.Проекты, СправочникСсылка.упоПрограммыПроектов	 - проект или программа проекта.
//  	Для программы будет открыта структура проекта программы.
//  ОткрытьПортфель - Булево
//
Процедура ОткрытьСтруктуруПрограммы(ПрограммаПроектаИлиПроектКакПрограмма, ОткрытьПортфель = Ложь) Экспорт
	
	ПрограммаПортфельПроекта = ?(ОткрытьПортфель, 
		ПредопределенноеЗначение("Справочник.упоПортфелиПроектов.ПустаяСсылка"),
		ПредопределенноеЗначение("Справочник.упоПрограммыПроектов.ПустаяСсылка"));			
	
	Если НЕ упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() И ЗначениеЗаполнено(ПрограммаПроектаИлиПроектКакПрограмма) Тогда
					
		Если ТипЗнч(ПрограммаПроектаИлиПроектКакПрограмма) = Тип("СправочникСсылка.Проекты") Тогда
			
			ЗначенияРеквизитовПроекта = упоФункцииБСП.ПолучитьЗначенияРеквизитов(ПрограммаПроектаИлиПроектКакПрограмма, 
				"Компонент, ПрограммаПроектов, ПортфельПроектов");
			
			Если ЗначенияРеквизитовПроекта.Компонент = ПредопределенноеЗначение("Перечисление.упоКомпоненты.ПрограммаПроектов") 
				ИЛИ ЗначенияРеквизитовПроекта.Компонент = ПредопределенноеЗначение("Перечисление.упоКомпоненты.ПортфельПроектов") Тогда
				
				ПрограммаПортфельПроекта = ПрограммаПроектаИлиПроектКакПрограмма;
				
			ИначеЕсли НЕ ОткрытьПортфель И ЗначениеЗаполнено(ЗначенияРеквизитовПроекта.ПрограммаПроектов) Тогда
				
				ПрограммаПортфельПроекта = ЗначенияРеквизитовПроекта.ПрограммаПроектов;
								
			ИначеЕсли ОткрытьПортфель И ЗначениеЗаполнено(ЗначенияРеквизитовПроекта.ПортфельПроектов) Тогда
				
				ПрограммаПортфельПроекта = ЗначенияРеквизитовПроекта.ПортфельПроектов;				
				
			КонецЕсли;
			
		Иначе
			
			ПрограммаПортфельПроекта = ПрограммаПроектаИлиПроектКакПрограмма;			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("ЭтоСтруктураПрограммыИлиПортфеля", Истина);	
	Если ТипЗнч(ПрограммаПортфельПроекта) = Тип("СправочникСсылка.упоПрограммыПроектов") 
		ИЛИ ТипЗнч(ПрограммаПортфельПроекта) = Тип("СправочникСсылка.упоПортфелиПроектов") Тогда
		ПараметрыФормы.Вставить("ПрограммаПортфельПроекта", ПрограммаПортфельПроекта);
	ИначеЕсли ТипЗнч(ПрограммаПортфельПроекта) = Тип("СправочникСсылка.Проекты") Тогда
		ПараметрыФормы.Вставить("ПроектКакПрограммаПроекта", ПрограммаПортфельПроекта);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.упоУпрощенныйВводСтруктурыПроекта.Форма.Форма",
					ПараметрыФормы, , ПрограммаПроектаИлиПроектКакПрограмма);
	
КонецПроцедуры	

// Открывает форму обработки "Упрощенный ввод структуры проекта" с выделением проектной задачи - источника вызова.
//
// Параметры:
//  ВходящийПараметр - ДокументСсылка.упоПроектнаяЗадача, СправочникСсылка.Проекты	 - проектная задача
//  	(документ или зеркало) или проект.
//
Процедура ОткрытьСтруктуруПроекта(ВходящийПараметр = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВходящийПараметр) Тогда
		Возврат;
	КонецЕсли;
	
	упоОтладкаКлиентСервер.ФиксВремя("упоУпрощенныйВводСтруктурыПроекта.Команда.упоУпрощенныйВводСтруктурыПроекта: Перед открытием формы.");	
	
	ПараметрыОткрытия = Новый Структура();
	ПроектнаяЗадачаПриОткрытии = Неопределено;
	Если ТипЗнч(ВходящийПараметр) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда	
		СвойстваЗадачи = упоФункцииОбщегоНазначенияВызовСервера.ПолучитьСвойстваОбъекта(ВходящийПараметр, "Проект");
		Проект = СвойстваЗадачи.Проект;
		ПроектнаяЗадачаПриОткрытии = ВходящийПараметр;
	ИначеЕсли ТипЗнч(ВходящийПараметр) = Тип("СправочникСсылка.Проекты") Тогда
		СвойстваПроекта = упоФункцииОбщегоНазначенияВызовСервера.ПолучитьСвойстваОбъекта(ВходящийПараметр, "ЭтоПроектнаяЗадача, упоКорневойПроект, СсылкаНаПроектнуюЗадачу");	
		Если СвойстваПроекта.ЭтоПроектнаяЗадача Тогда
			Проект = СвойстваПроекта.упоКорневойПроект;
			ПроектнаяЗадачаПриОткрытии = СвойстваПроекта.СсылкаНаПроектнуюЗадачу;
		Иначе
			Проект = ВходящийПараметр;
		КонецЕсли;	
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("Проект", Проект);
	ПараметрыОткрытия.Вставить("ПроектнаяЗадачаПриОткрытии", ПроектнаяЗадачаПриОткрытии);
	ОткрытьФорму("Обработка.упоУпрощенныйВводСтруктурыПроекта.Форма", ПараметрыОткрытия, , Проект);
	
	упоОтладкаКлиентСервер.ФиксВремя("упоУпрощенныйВводСтруктурыПроекта.Команда.упоУпрощенныйВводСтруктурыПроекта: После открытия формы.");	
	
КонецПроцедуры

// Выполняет действия, связанные с именем команды.
//
// Параметры:
//  ИмяКоманды     - Строка - имя команды.
//  СсылкаНаЗадачу - СправочникСсылка.Проект, ДокументСсылка.упоПроектнаяЗадача - проект или проектная задача.
Процедура КомандаСоздатьНаОсновании(ИмяКоманды, СсылкаНаЗадачу) Экспорт
						
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", СсылкаНаЗадачу);
	
	Если ИмяКоманды = "Создать_Документ_ЗаказПокупателя" 
			Или ИмяКоманды = "Создать_Документ_ЗаказПоставщику" Тогда
			
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда		
			МодульИнтеграции = ОбщегоНазначенияКлиент.ОбщийМодуль("упоИнтеграцияУПФКлиент");
			МодульИнтеграции.ДобавитьНаФормуКомандуСоздатьНаОсновании(ИмяКоманды, СсылкаНаЗадачу);   
		КонецЕсли;
	
	ИначеЕсли ИмяКоманды = "КомандаСоздатьНаОснованииЗадание" 
			Или ИмяКоманды = "КомандаСоздатьНаОснованииЗадание_Проект" Тогда
		
		упоЗаданияКлиент.СоздатьЗаданиеСВыборомВидаНаОсновании(СсылкаНаЗадачу);
		
	ИначеЕсли ИмяКоманды = "КомандаСоздатьНаОснованииИзменениеРуководителяПЗ" Тогда  
		
		ОткрытьФорму("Документ.упоИзменениеРуководителяПроектнойЗадачи.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ИмяКоманды = "КомандаСоздатьНаОснованииРучнаяАктуализация" Тогда  
		
		ОткрытьФорму("Документ.упоРучнаяАктуализацияПроекта.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли Найти(ИмяКоманды, "Создать_") <> 0 
		Или Найти(ИмяКоманды, "СоздатьДляПроекта_") <> 0 Тогда
		
		ПолноеИмя = СтрЗаменить(ИмяКоманды, "Создать_", "");
		ПолноеИмя = СтрЗаменить(ПолноеИмя, "СоздатьДляПроекта_", "");
		ПолноеИмя = СтрЗаменить(ПолноеИмя, "_", ".");
		
		ОткрытьФорму(ПолноеИмя + ".ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли СтрНайти(ИмяКоманды, "КомандаСоздатьНаОснованииИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс") <> 0 Тогда
		
		КомандаСоздатьНаОснованииИнтеграцияС1СДокументооборотСоздать("ПроверитьПодключениеДляБизнесПроцессаЗавершение", СсылкаНаЗадачу);				
		
	ИначеЕсли СтрНайти(ИмяКоманды, "КомандаСоздатьНаОснованииИнтеграцияС1СДокументооборотСоздатьПисьмо") <> 0 Тогда
		
		КомандаСоздатьНаОснованииИнтеграцияС1СДокументооборотСоздать("ПроверитьПодключениеДляПисьмаЗавершение", СсылкаНаЗадачу);
	
	ИначеЕсли СтрНайти(ИмяКоманды, "КомандаСоздатьНаОснованииИнтеграцияС1СДокументооборотНачатьОбработку") <> 0 Тогда
	
		КомандаСоздатьНаОснованииИнтеграцияС1СДокументооборотСоздать("ПроверитьПодключениеДляОбработкиЗавершение", СсылкаНаЗадачу);
	
	КонецЕсли;
	
КонецПроцедуры

// Записывает настройку производительности структуры проекта.
//
// Параметры:
//  ИмяНастройки - Строка
//  Значение     - Булево
//
Процедура СохранитьНастройкуПроизводительностиСтруктурыПроекта(ИмяНастройки, Значение) Экспорт
	
	упоСтруктураПроектаВызовСервера.СохранитьНастройкуПроизводительностиСтруктурыПроекта(ИмяНастройки, Значение);
	
КонецПроцедуры

// Получает сохраненные настройки производительности структуры проекта.
// 
// Возвращаемое значение:
//   - Структура: см. ключ упоСтруктураПроектаКлиентСервер.СписокНастроекПроизводительностиСтруктурыПроекта
//
Функция СохраненныеНастройкиПроизводительностиСтруктурыПроекта() Экспорт
	
	ЗначенияНастроек = упоСтруктураПроектаВызовСервера.СохраненныеНастройкиПроизводительностиСтруктурыПроекта();
	Возврат ЗначенияНастроек;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияС1СДокументооборот

Процедура КомандаСоздатьНаОснованииИнтеграцияС1СДокументооборотСоздать(ИмяПроцедуры, ПараметрКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект, ПараметрКоманды);
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПроверитьПодключение(ОписаниеОповещения,,, Истина);
	
КонецПроцедуры	

Процедура ПроверитьПодключениеДляБизнесПроцессаЗавершение(Результат, ПараметрКоманды) Экспорт
	
	Если Результат = Истина Тогда // авторизация успешна
		
		ИнтеграцияС1СДокументооборотКлиент.СоздатьБизнесПроцесс(ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПодключениеДляПисьмаЗавершение(Результат, ОбъектИС) Экспорт
	
	Если Результат = Истина Тогда // авторизация успешна
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПоискСвязанногоОбъектаЗавершение", ЭтотОбъект, ОбъектИС);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.НачатьПоискСвязанногоОбъектаДО(ОбъектИС, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПодключениеДляОбработкиЗавершение(Результат, ОбъектИС) Экспорт
	
	Если Результат = Истина Тогда // авторизация успешна
		ИнтеграцияС1СДокументооборот3Клиент.НачатьОбработку(ОбъектИС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоискСвязанногоОбъектаЗавершение(Результат, ОбъектИС) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Предмет", Результат);
	
	ОткрытьФорму("Обработка.ИнтеграцияС1СДокументооборот.Форма.ИсходящееПисьмо", Параметры);
	
КонецПроцедуры

#КонецОбласти

Функция РассчитатьИтогиПоТаблице(Таблица, ЕстьКолонкиСуммы, ЕстьКолонкиКоличества, ИмяКолонкиСумма) Экспорт
	
	Результат = Новый Структура("Сумма, Количество");
	
	Если ЕстьКолонкиСуммы Тогда
		Соответствие = Новый Соответствие;
		Для Каждого Строка Из Таблица Цикл  
			ДобавитьСуммуВВалюте(Соответствие, Строка.Валюта, Строка[ИмяКолонкиСумма])
		КонецЦикла;	
		
		Результат.Сумма = упоСтруктураПроектаКлиентСервер.СформироватьПредставлениеПоДаннымСоответствия(
													Соответствие, , "ЧДЦ=2");
	КонецЕсли;	
	
	Если ЕстьКолонкиКоличества Тогда
		Соответствие = Новый Соответствие;
		Для Каждого Строка Из Таблица Цикл
			СтрокаСоответствия = Соответствие.Получить(Строка.ЕдиницаНормирования);
			Если СтрокаСоответствия = Неопределено Тогда
				Соответствие.Вставить(Строка.ЕдиницаНормирования, Строка.Количество);
			Иначе
				Соответствие[Строка.ЕдиницаНормирования] = СтрокаСоответствия + Строка.Количество;
			КонецЕсли;
		КонецЦикла;	
		Результат.Количество = упоСтруктураПроектаКлиентСервер.СформироватьПредставлениеПоДаннымСоответствия(
													Соответствие, , "ЧДЦ=3");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтроковоеЗначениеИтогиДДС(Таблица, ИмяКолонкиСумма, НаправлениеДвижения = Неопределено)Экспорт

    СоответствиеПоступление = Новый Соответствие;
	СоответствиеВыплата = Новый Соответствие;
	
	ДобавлятьПоступления = Не ЗначениеЗаполнено(НаправлениеДвижения) 
		Или НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"); 
	
    ДобавлятьВыплаты = Не ЗначениеЗаполнено(НаправлениеДвижения) 
		Или НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата");
		
	Для Каждого Строка Из Таблица Цикл
		
		Если ДобавлятьПоступления И Строка.НаправлениеДвижения = 
			ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление") Тогда 
				ДобавитьСуммуВВалюте(СоответствиеПоступление, Строка.Валюта, Строка[ИмяКолонкиСумма]);
				
		ИначеЕсли ДобавлятьВыплаты И Строка.НаправлениеДвижения = 
			ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата") Тогда 
				ДобавитьСуммуВВалюте(СоответствиеВыплата, Строка.Валюта, Строка[ИмяКолонкиСумма]);
				
		КонецЕсли; 
		
	КонецЦикла;	
	
	СтрокаПоступление = упоСтруктураПроектаКлиентСервер.СформироватьПредставлениеПоДаннымСоответствия(
		СоответствиеПоступление, , "ЧДЦ=2");

	СтрокаВыплата = упоСтруктураПроектаКлиентСервер.СформироватьПредставлениеПоДаннымСоответствия(
		СоответствиеВыплата, , "ЧДЦ=2");
		
	МассивПоступлениеВыплата = Новый Массив;
	ШаблонПоступлениеВыплата = "%1: %2";
	
    Если ЗначениеЗаполнено(СтрокаПоступление) Тогда
		СтрокаПоступление = СтрШаблон(ШаблонПоступлениеВыплата, НСтр("ru = 'Поступления'"), СтрокаПоступление); 
		МассивПоступлениеВыплата.Добавить(СтрокаПоступление);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаВыплата) Тогда
		СтрокаВыплата = СтрШаблон(ШаблонПоступлениеВыплата, НСтр("ru = 'Выплаты'"), СтрокаВыплата); 
		МассивПоступлениеВыплата.Добавить(СтрокаВыплата);
	КонецЕсли;	
	
	СуммаДокументаСтрокой = СтрСоединить(МассивПоступлениеВыплата, " / ");
	
	Возврат СуммаДокументаСтрокой;

КонецФункции  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСуммуВВалюте(Соответствие, Валюта, Сумма)

	СтрокаСоответствия = Соответствие.Получить(Валюта); 
	
	Если СтрокаСоответствия = Неопределено Тогда
		Соответствие.Вставить(Валюта, Сумма);
	Иначе
		Соответствие[Валюта] = СтрокаСоответствия + Сумма;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
