
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроектнаяЗадача", ПроектнаяЗадачаДокумент);
	Параметры.Свойство("Проект", Проект);
	
	Если Не (ЗначениеЗаполнено(Проект) И ЗначениеЗаполнено(ПроектнаяЗадачаДокумент))  Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СоставНазванияЗадачи = Новый Массив;
	СоставНазванияЗадачи.Добавить(упоПроектыИЗадачиВызовСервера.обПолучитьКодСДРПроектнойЗадачи(ПроектнаяЗадачаДокумент));
	СоставНазванияЗадачи.Добавить(" ");
	СоставНазванияЗадачи.Добавить(упоПроектыИЗадачиСервер.НазваниеПроектнойЗадачи(ПроектнаяЗадачаДокумент));
	НазваниеЗадачи = СтрСоединить(СоставНазванияЗадачи);
	
	//
	
	ЗаполнитьТаблицуСПерескакиванием();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НазваниеЗадачиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, ПроектнаяЗадачаДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыпускаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Строка = ТаблицаВыпуска.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не Поле.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;		
	СтандартнаяОбработка = Ложь;	
	ПоказатьЗначение(, Строка.ПроектнаяЗадачаДокумент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ИмяСобытия", "Закрытие_ФормаВыборПланаВыпуска");
	РезультатВыбора.Вставить("ПланВыпуска", Новый Массив);
	Для Каждого СтрокаТаблицы Из ТаблицаВыпуска Цикл
		Если НЕ СтрокаТаблицы.Выбор Тогда Продолжить; КонецЕсли;
		ДанныеСтроки = Новый Структура("ПроектнаяЗадачаДокумент, Номенклатура, Комплектация, Количество");
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТаблицы);
		РезультатВыбора.ПланВыпуска.Добавить(ДанныеСтроки);
	КонецЦикла;
	ОповеститьОВыборе(РезультатВыбора);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьВсе(Команда)
	УстановитьВыборДляВсех(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьВсе(Команда)
	УстановитьВыборДляВсех(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнвертироватьВсе(Команда)
	УстановитьВыборДляВсех(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуСПерескакиванием() 
	
	ПереключательОтбора = "Задача";
	
	ЗаполнитьТаблицу();
	
	Если ТаблицаВыпуска.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
		
	ПереключательОтбора = "Проект";	
	
	ЗаполнитьТаблицу();
	
	Если ТаблицаВыпуска.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПереключательОтбора = "Все";
	
	ЗаполнитьТаблицу();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицу() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадачаДокумент,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура,
	               |	СУММА(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество) КАК Количество,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	               |	Проекты.КодСДР КАК КодСДР
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(, &Отбор) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |		ПО упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |			И упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество <> 0
	               |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная <> 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача,
	               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура,
	               |	упоВерсииПроекта.Проект,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи,
	               |	Проекты.КодСДР
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоВерсииПроекта.Проект,
	               |	КодСДР,
	               |	Количество УБЫВ";
		
	Если ПереключательОтбора = "Задача" Тогда
		Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадачаДокумент);
		ТекстЗаменыОтбора = "ПроектнаяЗадача = &ПроектнаяЗадача";
	ИначеЕсли ПереключательОтбора = "Проект" Тогда
		Запрос.УстановитьПараметр("Проект", Проект);
		ТекстЗаменыОтбора = "Версия.Проект = &Проект";
	ИначеЕсли ПереключательОтбора = "Все" Тогда
		ТекстЗаменыОтбора = "";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отбор", ТекстЗаменыОтбора);
	
	ТаблицаВыпуска.Загрузить(Запрос.Выполнить().Выгрузить());
	
	КэшКомплектаций = Новый Соответствие;
	
	МодульНаборыВызовСервера = ОбщегоНазначения.ОбщийМодуль("НаборыВызовСервера");
	
	Для Каждого СтрокаВыпуска Из ТаблицаВыпуска Цикл
		Комплектация = КэшКомплектаций.Получить(СтрокаВыпуска.Номенклатура);
		Если Комплектация = -1 Тогда
			Продолжить;
		ИначеЕсли Комплектация = Неопределено Тогда
			Комплектация = МодульНаборыВызовСервера.ВариантКомплектацииНоменклатурыПоУмолчанию(СтрокаВыпуска.Номенклатура, Неопределено);	
			Если Не ЗначениеЗаполнено(Комплектация) Тогда
				КэшКомплектаций.Вставить(СтрокаВыпуска.Номенклатура, -1);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		СтрокаВыпуска.Комплектация = Комплектация;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПереключательОтбораПриИзменении(Элемент)
	
	ЗаполнитьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьВыборДляВсех(Выбрано) 
	Для Каждого СтрокаТЧ Из ТаблицаВыпуска Цикл
		Если Выбрано = Неопределено Тогда
			СтрокаТЧ.Выбор = НЕ СтрокаТЧ.Выбор;
		Иначе
			СтрокаТЧ.Выбор = Выбрано;	
		КонецЕсли;
	КонецЦикла;	
КонецФункции

#КонецОбласти


