////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с типовыми отчетами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Скрывает элемент управления на форме.
//
// Параметры:
//  Форма	 - Произвольный - не используется.
//  Элемент	 - Произвольный - элемент управления формы.
//
Процедура СкрытьЭлементУправления(Форма, Элемент) Экспорт
	Элемент.Видимость = Не Элемент.Видимость;	
КонецПроцедуры

// Устанавливает видимость элементов формы "ПериодЗначениеДатаНачала", "ПериодЗначениеДатаОкончания" в зависимости от
// значения параметра и значения дополнительных параметров.
//
// Параметры:
//  ЗначениеПараметра	 - Строка - значение периода. Возможные варианты: "Произвольный период", "Вчера", "Сегодня",
//							"С начала года", "С начала квартала", "С начала месяца", "С начала полугодия", "С начала декады",
//							"С начала недели", "Эта декада", "Эта неделя", "Это полугодие", "Этот год", "Этот квартал", "Этот
//							месяц".
//  ГруппаПараметры		 - ГруппаФормы - группа формы, которой принадлежат элементы управления формы
//							"ПериодЗначениеДатаНачала" и "ПериодЗначениеДатаОкончания".
//  ДопПараметры		 - Структура, Неопределено - по умолчанию = неопределено. Структура с дополнительными свойствами:
//		* ДатаНачалаВидимость		- Булево - признак видимости у реквизита "ПериодЗначениеДатаНачала" формы.
//		* ДатаОкончанияВидимость	- Булево - признак видимости у реквизита "ПериодЗначениеДатаОкончания" формы.
//
Процедура ПараметрДатаПриИзменении(ЗначениеПараметра, ГруппаПараметры, ДопПараметры = Неопределено) Экспорт

	ДатаНачалаВидимость = Истина;
	ДатаОкончанияВидимость = Истина;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		Если ДопПараметры.Свойство("ДатаНачалаВидимость") Тогда
			ДатаНачалаВидимость = ДопПараметры.ДатаНачалаВидимость;
		КонецЕсли;
		Если ДопПараметры.Свойство("ДатаОкончанияВидимость") Тогда
			ДатаОкончанияВидимость = ДопПараметры.ДатаОкончанияВидимость;
		КонецЕсли;
	КонецЕсли;
		
	ГруппаПараметры.ПериодЗначениеДатаНачала.Видимость = ДатаНачалаВидимость;
	ГруппаПараметры.ПериодЗначениеДатаОкончания.Видимость = ДатаОкончанияВидимость;
	
	Если НЕ ГруппаПараметры.ПериодЗначениеДатаНачала.Видимость
		ИЛИ НЕ ГруппаПараметры.ПериодЗначениеДатаОкончания.Видимость Тогда
		ГруппаПараметры.ДекорацияРазделительПериодов.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

// Загружает новые настройки в компоновщик настроек отчета.
//
// Параметры:
//  Отчет				 - ОтчетОбъект 	- отчет, в компоновщик настроек которого буду загружаться новые настройки.
//  СтруктураНастроек	 - Структура	- структура загружаемых настроек.
//
Процедура ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, СтруктураНастроек) Экспорт
	
	ПараметрыОтчета =  Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	
	ПараметрыНастроек = СтруктураНастроек.Параметры;
	мУдалитьПараметры = Новый Массив;
	
	Для Каждого КлючИЗначение Из ПараметрыНастроек Цикл
		
		ПараметрОтчета = ПараметрыОтчета.Найти(КлючИЗначение.Ключ);
		
		Если ПараметрОтчета = Неопределено Тогда  
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(ПараметрОтчета.ИдентификаторПользовательскойНастройки) Тогда
			
			// Чтобы настройка переданного параметра не перебивалась пользовательской изменим ее и удалим ее из параметров,
			// чтоб измененая в дальнейшем пользователем настройка не затиралась переданной при открытии.
			
			ПользовательскийПараметрОтчета = ПользовательскиеНастройки.Найти(ПараметрОтчета.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскийПараметрОтчета) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				
				Если КлючИЗначение.Ключ = "ПериодОтчета" 
						И Не КлючИЗначение.Значение.ДатаОкончания = '30000101235959' Тогда
					
					ЗаполнитьЗначенияСвойств(ПользовательскийПараметрОтчета.Значение, КлючИЗначение.Значение);
					ПользовательскийПараметрОтчета.Использование = Истина;	 
					
				ИначеЕсли КлючИЗначение.Ключ <> "ПериодОтчета" Тогда 
					
					ПользовательскийПараметрОтчета.Значение = КлючИЗначение.Значение;
					ПользовательскийПараметрОтчета.Использование = ПараметрОтчета.Использование;
					мУдалитьПараметры.Добавить(КлючИЗначение.Ключ);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			Если ПараметрОтчета.Значение <> КлючИЗначение.Значение Тогда
				ПараметрОтчета.Значение = КлючИЗначение.Значение;				
			КонецЕсли;
			
			Если Не ПараметрОтчета.Использование Тогда
				ПараметрОтчета.Использование = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого УдалитьПараметр Из мУдалитьПараметры Цикл
		СтруктураНастроек.Параметры.Удалить(УдалитьПараметр);
	КонецЦикла;
	
	СтруктураОтбора = СтруктураНастроек.Отбор;
	
	Для Каждого КлючИЗначниеОтбора Из СтруктураОтбора Цикл
        
        упоФункцииОбщегоНазначенияКлиентСервер.УстановитьОтборПоПолюКомпоновки(Отчет.КомпоновщикНастроек, КлючИЗначниеОтбора.Ключ, КлючИЗначниеОтбора.Значение, Ложь, Истина);
       		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти