#Область ОписаниеПеременных

&НаКлиенте
Перем ИндексГруппыПроектов, ИндексКритерииПроектов; // Переменные для перемещения строк.

&НаКлиенте
Перем ПредыдущиеЗначенияОтборов; // Переменные для возврата значений.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка,,Ложь);			
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИнициализацияФормыНаСервере();	
	КонецЕсли;	
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ИнициализацияФормыНаКлиенте();		
				
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	СохранитьДеревоПроектовВТабличнуюЧасть(ТекущийОбъект);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
			
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	//ДополнитьТаблицуПроектовСтрокамиГруппировки();
	//
	//ОбработатьПопаданиеВКритерий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализацияФормыНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаПроектовПриИзменении(Элемент)
	
	ЗаполнитьОсновнойПоказательИнвестирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПортфельПроектовПриИзменении(Элемент)
	
	ИмяРеквизита = "ПортфельПроектов";		
	ОтборПриИзменении(ИмяРеквизита);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ИмяРеквизита = "Подразделение";		
	ОтборПриИзменении(ИмяРеквизита);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоПроекты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.ЭтоГруппировка Тогда
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектыПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ДеревоПроекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектыЗначениеПоказателяПриИзменении(Элемент)
	
	ОбработатьДеревоПроектов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПеречитать(Команда)
	
	ЭтотОбъект.Прочитать();
	
	ИнициализацияФормыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	ЗаполнитьДеревоПроектовПоКоманде();
	
	ИнициализироватьИдентификаторыГруппировок(ДеревоПроекты, ИдентификаторыГруппировок);
	
	ИнициализацияФормыНаКлиенте();		

	Модифицированность = Истина;
			
КонецПроцедуры
	
&НаКлиенте
Процедура ОпуститьРанг(Команда)
	
	ПоднятьОпуститьРанг(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоднятьРанг(Команда)
		
	ПоднятьОпуститьРанг(Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПортфель(Команда)
	
	Если ЕстьДанныеВТабличнойЧасти() Тогда
		Если ЭтаФорма.Модифицированность Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьПортфельЗавершение", ЭтотОбъект);
			ТекстВопроса = НСтр("ru = 'Для создания бизнес-плана необходимо провести документ. Продолжить?'");
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Иначе
			СоздатьПортфельНаСервере();
		КонецЕсли;
	Иначе
		Текст = НСтр("ru = 'Для создания бизнес-плана необходимо заполнить проекты.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтруктуруПроекта(Команда)
	
	Если ЗначениеЗаполнено(Объект.ПортфельБизнесПлана) Тогда
		упоСтруктураПроектаКлиент.ОткрытьСтруктуруПрограммы(Объект.ПортфельБизнесПлана);
	КонецЕсли;	
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура УстановитьТекущуюСтроку(ТекущаяСтрока = Неопределено)
	
	Элементы.ДеревоПроекты.ТекущаяСтрока = ТекущаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтрокиДереваПроекты()
	
	ЭлементыДерева = ДеревоПроекты.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Элементы.ДеревоПроекты.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ОтметитьСвязанныеПроектыВРазныхГруппах(ДеревоФормы, ТаблицаСвязанныеПроекты)
		
	Для Каждого СтрокаСвязи Из ТаблицаСвязанныеПроекты Цикл
		
		ИсходнаяЗаявка = ДеревоФормы.Строки.НайтиСтроки(Новый Структура("Заявка", СтрокаСвязи.ИсходнаяЗаявка), Истина)[0];
		
		// Список связанных на форме.
		Если ИсходнаяЗаявка.СвязанныеПроекты.НайтиПоЗначению(СтрокаСвязи.СвязанныйПроект) = Неопределено Тогда
			ИсходнаяЗаявка.СвязанныеПроекты.Добавить(СтрокаСвязи.СвязанныйПроект);	
		КонецЕсли;	
		
		СвязаннаяЗаявка = ДеревоФормы.Строки.НайтиСтроки(Новый Структура("Заявка", СтрокаСвязи.СвязаннаяЗаявка), Истина)[0];
		
		Если ИсходнаяЗаявка.ПопаданиеВКритерий <> СвязаннаяЗаявка.ПопаданиеВКритерий Тогда
			Если ИсходнаяЗаявка.ПопаданиеВКритерий Тогда				
				ИсходнаяЗаявка.ЭтоСвязанныйВходящий = Истина;
				СвязаннаяЗаявка.ЭтоСвязанныйНеВходящий = Истина;			
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДеревоПроектов()
	
	ЭлементыДерева = ДеревоПроекты.ПолучитьЭлементы();
	
	ОбработатьДеревоПроектовРекурсивно(ЭлементыДерева);
	
	ГруппаОстатокЛимита = ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.ОстатокЛимита);
	ГруппаВходящие 		= ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.Входящие);
	ГруппаНеВходящие 	= ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.НеВходящие);
	ГруппаИтог          = ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.Итог);
	
	// Поднятые баллы.											
	ЭлементыВходящие = ГруппаВходящие.ПолучитьЭлементы();
	КоличествоЭлементыВходящие = ЭлементыВходящие.Количество();	
	Если КоличествоЭлементыВходящие > 0 Тогда	
		Сч = КоличествоЭлементыВходящие - 2;	
		ПоднятоеЗначение = 0;
		Пока Сч >=0  Цикл
			ТекущийВходящий = ЭлементыВходящие[Сч];
			СледующийВходящий = ЭлементыВходящие[Сч + 1];
			
			Если СледующийВходящий.Балл > ТекущийВходящий.Балл Или ТекущийВходящий.Балл < ПоднятоеЗначение Тогда
				ТекущийВходящий.ЭтоПоднятыйБалл = Истина;			
				ПоднятоеЗначение = ?(СледующийВходящий.Балл > ПоднятоеЗначение, СледующийВходящий.Балл, ПоднятоеЗначение);			
			Иначе
				ТекущийВходящий.ЭтоПоднятыйБалл = Ложь;			
				ПоднятоеЗначение = 0;
			КонецЕсли;	
			
			Сч = Сч - 1;			
		КонецЦикла;	
		ЭлементыВходящие[КоличествоЭлементыВходящие - 1].ЭтоПоднятыйБалл = Ложь;
	КонецЕсли;	
			
	// Итоги.						
	ГруппаОстатокЛимита.ЗначениеПоказателя = ЗначениеОсновногоПоказателяИнвестирования - ГруппаВходящие.ЗначениеПоказателя;
	ГруппаИтог.ЗначениеПоказателя = ГруппаВходящие.ЗначениеПоказателя + ГруппаНеВходящие.ЗначениеПоказателя;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработатьДеревоПроектовРекурсивно(ЭлементыДерева, СвязанныеПроектыВРазныхГруппах = Неопределено)
	
	Если ЭлементыДерева.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Если СвязанныеПроектыВРазныхГруппах = Неопределено Тогда
		СвязанныеПроектыВРазныхГруппах = Новый Соответствие;
	КонецЕсли;	
	
	Родитель = Неопределено;
	НакопленнаяСумма = 0;
	Итог = 0;
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		Если НЕ ЭлементДерева.ЭтоГруппировка Тогда	
			
			Если Родитель = Неопределено Тогда
				Родитель = ЭлементДерева.ПолучитьРодителя();
			КонецЕсли;
			
			Если Родитель <> Неопределено Тогда
				
				Если Родитель.ПопаданиеВКритерий = Истина Тогда						         
					
					// Лимиты.
					ЭлементДерева.ПопаданиеВКритерий = Ложь;
					
					Если ЗначениеЗаполнено(ЭлементДерева.ЗначениеПоказателя) И НакопленнаяСумма < ЗначениеОсновногоПоказателяИнвестирования Тогда													
						НакопленнаяСумма = НакопленнаяСумма + ЭлементДерева.ЗначениеПоказателя;
						Если НакопленнаяСумма <= ЗначениеОсновногоПоказателяИнвестирования Тогда
							ЭлементДерева.ПопаданиеВКритерий = Истина;
						КонецЕсли;											
					КонецЕсли;																			
					
					// Связанные проекты.
					ЭлементДерева.ЭтоСвязанныйНеВходящий = Ложь;
					СвязанныеПроекты = ЭлементДерева.СвязанныеПроекты;
					Если СвязанныеПроекты.Количество() > 0 Тогда
						Для Каждого СвязанныйПроект Из СвязанныеПроекты Цикл
							ЭлементДерева.ЭтоСвязанныйВходящий = НЕ ИндексКритерииПроектов[СвязанныйПроект.Значение];
							Если ЭлементДерева.ЭтоСвязанныйВходящий Тогда								
								СвязанныеПроектыВРазныхГруппах.Вставить(СвязанныйПроект.Значение, Истина);
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;	
					
				Иначе
					
					// Поднятые баллы.
					ЭлементДерева.ЭтоПоднятыйБалл = Ложь;
					
					// Связанные проекты.
					ЭлементДерева.ЭтоСвязанныйВходящий = Ложь;
					ЭлементДерева.ЭтоСвязанныйНеВходящий = СвязанныеПроектыВРазныхГруппах[ЭлементДерева.Проект] <> Неопределено;
										
				КонецЕсли;
			КонецЕсли;	
			
			Итог = Итог + ЭлементДерева.ЗначениеПоказателя;
			
		КонецЕсли;
		
		ОбработатьДеревоПроектовРекурсивно(ЭлементДерева.ПолучитьЭлементы(), СвязанныеПроектыВРазныхГруппах);
	КонецЦикла;				
	
	Если НЕ ЭлементДерева.ЭтоГруппировка Тогда
		Родитель = ЭлементДерева.ПолучитьРодителя();
		Родитель.ЗначениеПоказателя = Итог;
    КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьОсновнойПоказательИнвестирования()
	
	Элементы.ДеревоПроектыЗначениеПоказателя.Заголовок = "";	
	
	ОсновнойПоказательИнвестирования = Неопределено;
	
	ЗначениеОсновногоПоказателяИнвестирования = 0;
	Если НЕ ЗначениеЗаполнено(Объект.ПрограммаПроектов) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПрограммы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПрограммаПроектов, 
		"ОсновнойПоказательИнвестирования, ПроектСтруктуры");
	
	ОсновнойПоказательИнвестирования = РеквизитыПрограммы.ОсновнойПоказательИнвестирования;
	
	Элементы.ДеревоПроектыЗначениеПоказателя.Заголовок = ОсновнойПоказательИнвестирования;
		
	Если ЗначениеЗаполнено(ОсновнойПоказательИнвестирования) 
		И ЗначениеЗаполнено(РеквизитыПрограммы.ПроектСтруктуры) Тогда
		ЗначениеОсновногоПоказателяИнвестирования = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателя(
			ОсновнойПоказательИнвестирования, РеквизитыПрограммы.ПроектСтруктуры); 
	КонецЕсли;
			
	ГруппировкаЛимит = ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.Лимит);
	ГруппировкаЛимит.ЗначениеПоказателя = ЗначениеОсновногоПоказателяИнвестирования;			
	
	ГруппировкаОстатокЛимита	= ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.ОстатокЛимита);
	ГруппировкаВходящие			= ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.Входящие);
	ГруппировкаОстатокЛимита.ЗначениеПоказателя = ГруппировкаЛимит.ЗначениеПоказателя - ГруппировкаВходящие.ЗначениеПоказателя;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормыНаСервере()		
	
	ПоказательБалла = Константы.упоПоказательБалла.Получить();
	
	//
	
	ДеревоФормы = РеквизитФормыВЗначение("ДеревоПроекты");
	
	СоздатьПустоеДеревоПроектов(ДеревоФормы);
			
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьДеревоПроектовПоТабличнойЧасти(ДеревоФормы);			
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоФормы, "ДеревоПроекты");
	
	//
	
	ИдентификаторыГруппировок = Новый Структура;
	ИнициализироватьИдентификаторыГруппировок(ДеревоПроекты, ИдентификаторыГруппировок);
	
	ЗаполнитьОсновнойПоказательИнвестирования();

	ПроверитьНеобходимостьСозданияБизнесПлана(ЭтаФорма, Объект);

КонецПроцедуры	

&НаКлиенте
Процедура ИнициализацияФормыНаКлиенте()		
	
	ИнициализацияПеременныхФормы();
	
	РазвернутьСтрокиДереваПроекты();
	
	УстановитьТекущуюСтроку(ИдентификаторыГруппировок.Итог);
	
КонецПроцедуры

#Область ПеремещениеВДереве

&НаКлиенте
Процедура ИнициализацияПеременныхФормы()
	
	ИндексКритерииПроектов 	= Новый Соответствие;						
	ЗаполнитьИндексКритерииПроектовРекурсивно(ДеревоПроекты.ПолучитьЭлементы());			
	
	ИндексГруппыПроектов = Новый Соответствие;
	
	ГруппировкаВходящие = ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.Входящие);
	ИндексГруппыПроектов.Вставить(ГруппировкаВходящие.ПопаданиеВКритерий, ИдентификаторыГруппировок.Входящие);
	
	ГруппировкаНеВходящие = ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок.НеВходящие);
	ИндексГруппыПроектов.Вставить(ГруппировкаНеВходящие.ПопаданиеВКритерий, ИдентификаторыГруппировок.НеВходящие);
	
	//
		
	ПредыдущиеЗначенияОтборов = Новый Структура;
	ПредыдущиеЗначенияОтборов.Вставить("ПортфельПроектов", 	Объект.ПортфельПроектов);
	ПредыдущиеЗначенияОтборов.Вставить("Подразделение",  	Объект.Подразделение);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИнициализироватьИдентификаторыГруппировок(ДеревоПроекты, ИдентификаторыГруппировок)
	
	ЭлементыДерева = ДеревоПроекты.ПолучитьЭлементы();
	
	ИдентификаторыГруппировок.Вставить("Лимит", 		ЭлементыДерева[0].ПолучитьИдентификатор());
	ИдентификаторыГруппировок.Вставить("ОстатокЛимита", ЭлементыДерева[1].ПолучитьИдентификатор());
	ИдентификаторыГруппировок.Вставить("Входящие", 		ЭлементыДерева[2].ПолучитьИдентификатор());
	ИдентификаторыГруппировок.Вставить("НеВходящие",	ЭлементыДерева[3].ПолучитьИдентификатор());
	ИдентификаторыГруппировок.Вставить("Итог", 			ЭлементыДерева[4].ПолучитьИдентификатор());	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьИндексКритерииПроектовРекурсивно(ЭлементыДерева)
		
	Родитель = Неопределено;
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		Если НЕ ЭлементДерева.ЭтоГруппировка Тогда
			Если Родитель = Неопределено Тогда
				Родитель = ЭлементДерева.ПолучитьРодителя();
			КонецЕсли;
			ИндексКритерииПроектов.Вставить(ЭлементДерева.Проект, Родитель.ПопаданиеВКритерий);			
		КонецЕсли;		
		
		ЗаполнитьИндексКритерииПроектовРекурсивно(ЭлементДерева.ПолучитьЭлементы());
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоднятьОпуститьРанг(Поднять = Истина)
	
	ТекущиеДанные = Элементы.ДеревоПроекты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.ЭтоГруппировка Тогда
		Возврат;
	КонецЕсли;
	
	Сдвиг = ?(Поднять, -1, 1); 
	
	НовыйНомер = ТекущиеДанные.НомерСтроки + Сдвиг;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();			
	ЭлементыГруппы = Родитель.ПолучитьЭлементы();
				
	ПереносСтрокиМеждуГруппами = Ложь;

	Если Поднять И НовыйНомер = 0 Тогда
		Если Родитель.ПопаданиеВКритерий = Истина Тогда			
			Возврат;// Достигли верха списка.
		Иначе
			ПереносСтрокиМеждуГруппами = Истина;
		КонецЕсли;			
	ИначеЕсли НЕ Поднять И НовыйНомер > ЭлементыГруппы.Количество() Тогда		
		Если Родитель.ПопаданиеВКритерий = Ложь Тогда			
			Возврат;// Достигли низа списка.
		Иначе
			ПереносСтрокиМеждуГруппами = Истина;
		КонецЕсли;				
	КонецЕсли;
			
	Если ПереносСтрокиМеждуГруппами Тогда
		
		НовыйРодитель = ДеревоПроекты.НайтиПоИдентификатору(ИндексГруппыПроектов[НЕ Родитель.ПопаданиеВКритерий]);	
						
		ЭлементыНовойГруппы = НовыйРодитель.ПолучитьЭлементы();		
		НовыйНомер = ?(Поднять, ЭлементыНовойГруппы.Количество() + 1, 1);

		НовыеТекущиеДанные = ЭлементыНовойГруппы.Вставить(НовыйНомер - 1);
		ЗаполнитьЗначенияСвойств(НовыеТекущиеДанные, ТекущиеДанные, , "ПопаданиеВКритерий");						
				
		ЭлементыГруппы.Удалить(ТекущиеДанные);
		
		ТекущиеДанные = НовыеТекущиеДанные;	
		
		Если Поднять Тогда 
			ЭлементыГруппыРезерва = ЭлементыГруппы;
			ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаявокНаПроект.НаРассмотрении");			
		Иначе
			ЭлементыГруппыРезерва = ЭлементыНовойГруппы;
			ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаявокНаПроект.ВРезерве");
		КонецЕсли;		
		
		ТекущиеДанные.ПроектБизнесПлана = Поднять;
		
		Для Каждого ЭлементГруппыРезерва Из ЭлементыГруппыРезерва Цикл
			ЭлементГруппыРезерва.НомерСтроки = ЭлементГруппыРезерва.НомерСтроки + Сдвиг;
		КонецЦикла;		
		
		// Связанные проекты.		
		ИндексКритерииПроектов.Вставить(ТекущиеДанные.Проект, НЕ Родитель.ПопаданиеВКритерий);	
				
		УстановитьТекущуюСтроку(ТекущиеДанные.ПолучитьИдентификатор());						
		
	Иначе			
		
		ИсходныйИндекс = ЭлементыГруппы.Индекс(ТекущиеДанные);
					
		ЭлементыГруппы.Сдвинуть(ИсходныйИндекс, Сдвиг);		
		ТекущиеДанные.Ранг = ТекущиеДанные.Ранг + Сдвиг;
		
		СдвинутаяСтрока = ЭлементыГруппы.Получить(ИсходныйИндекс);		
		СдвинутаяСтрока.Ранг = СдвинутаяСтрока.Ранг - Сдвиг;
		СдвинутаяСтрока.НомерСтроки = СдвинутаяСтрока.НомерСтроки - Сдвиг;
					
	КонецЕсли;
		
	ТекущиеДанные.НомерСтроки = НовыйНомер;	
				
	Модифицированность = Истина;	
		
	// Пересчет зеленых лимитов, связанных проектов, обновление итогов.
	ОбработатьДеревоПроектов();
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеДерева

&НаСервере
Процедура СохранитьДеревоПроектовВТабличнуюЧасть(ТекущийОбъект)
	
	ТекущийОбъект.Проекты.Очистить();
	
	СохранитьДеревоПроектовВТабличнуюЧастьРекурсивно(ДеревоПроекты.ПолучитьЭлементы(), ТекущийОбъект.Проекты);	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДеревоПроектовВТабличнуюЧастьРекурсивно(СтрокиДерева, ТабличнаяЧасть)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если НЕ СтрокаДерева.ЭтоГруппировка Тогда
			ЗаполнитьЗначенияСвойств(ТабличнаяЧасть.Добавить(), СтрокаДерева);
		КонецЕсли;
		СохранитьДеревоПроектовВТабличнуюЧастьРекурсивно(СтрокаДерева.ПолучитьЭлементы(), ТабличнаяЧасть)
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область ЗаполнениеДерева 

&НаСервереБезКонтекста
Функция СтруктураОбязательныхРазделовДерева(СтруктураРазделов)
	
	ЗаголовкиРазделов = Новый Массив;
	
	СтруктураРазделов.Вставить("Лимит", 0);		
	ЗаголовкиРазделов.Добавить(НСтр("ru = 'Лимит по инвестициям'"));	
	
	СтруктураРазделов.Вставить("ОстатокЛимита", 1);		
	ЗаголовкиРазделов.Добавить(НСтр("ru = 'Остаток лимита'"));		
	
	СтруктураРазделов.Вставить("Входящие", 2);		
	ЗаголовкиРазделов.Добавить(НСтр("ru = 'Проекты бизнес-плана'"));		
	
	СтруктураРазделов.Вставить("НеВходящие", 3);		
	ЗаголовкиРазделов.Добавить(НСтр("ru = 'Заявки на проекты в резерве'"));		
	
	СтруктураРазделов.Вставить("Итог", 4);		
	ЗаголовкиРазделов.Добавить(НСтр("ru = 'Всего по заявкам'"));		
	
	Возврат ЗаголовкиРазделов;
	
КонецФункции

&НаСервере
Процедура СоздатьПустоеДеревоПроектов(ДеревоФормы)
		
	Если ДеревоФормы.Строки.Количество() > 0 Тогда
		ДеревоФормы.Строки.Очистить();
	КонецЕсли;	
	
	СтруктураОбязательныхРазделов = Новый Структура;
	МассивИмен = СтруктураОбязательныхРазделовДерева(СтруктураОбязательныхРазделов);			
	
	Для Каждого ИмяРаздела Из МассивИмен Цикл
		НоваяГруппировка = ДеревоФормы.Строки.Добавить();
		НоваяГруппировка.Объект = ИмяРаздела;
		НоваяГруппировка.ЭтоГруппировка = Истина;		
	КонецЦикла;	
	
	ГруппировкаВходящие = ДеревоФормы.Строки[СтруктураОбязательныхРазделов.Входящие];
	ГруппировкаВходящие.ПопаданиеВКритерий = Истина;
	
	ГруппировкаЛимит = ДеревоФормы.Строки[СтруктураОбязательныхРазделов.Лимит];
	ГруппировкаЛимит.ЗначениеПоказателя = ЗначениеОсновногоПоказателяИнвестирования;
				
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьПроектыВДереве(ДеревоПроекты, ИдентификаторыГруппировок)
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить("ОстатокЛимита");
	МассивГруппировок.Добавить("Входящие");
	МассивГруппировок.Добавить("НеВходящие");
	МассивГруппировок.Добавить("Итог");
	
	Для Каждого ИмяГруппировки Из МассивГруппировок Цикл
		РазделГруппировки = ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок[ИмяГруппировки]);
		РазделГруппировки.ЗначениеПоказателя = 0;
		
		СтрокиРаздела = РазделГруппировки.ПолучитьЭлементы();
		Если СтрокиРаздела.Количество() > 0 Тогда
			СтрокиРаздела.Очистить();
		КонецЕсли;	
	КонецЦикла;			
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоПоТаблицеПроектов(ДеревоФормы, ТаблицаПроектов, ПересчетПоказателей = Истина)
			
	ГруппировкаЛимит 			= ДеревоФормы.Строки[СтруктураОбязательныхРазделов.Лимит];	
	ГруппировкаОстатокЛимита	= ДеревоФормы.Строки[СтруктураОбязательныхРазделов.ОстатокЛимита];	
	ГруппировкаВходящие			= ДеревоФормы.Строки[СтруктураОбязательныхРазделов.Входящие];
	ГруппировкаНеВходящие 		= ДеревоФормы.Строки[СтруктураОбязательныхРазделов.НеВходящие];
	ГруппировкаИтог 			= ДеревоФормы.Строки[СтруктураОбязательныхРазделов.Итог];
		
	Если ПересчетПоказателей Тогда
		НакопленнаяСумма = 0;
		
		Проекты = ТаблицаПроектов.ВыгрузитьКолонку("Проект");
		Показатели = Новый Массив;
		Показатели.Добавить(ОсновнойПоказательИнвестирования);
		Показатели.Добавить(ПоказательБалла);
		
		ЗначенияПоказателейПроектов =
			упоПоказателиПроектовСервер.ПолучитьЗначенияПоказателей(Показатели, Проекты);

		Для Каждого СтрокаПроект Из ТаблицаПроектов Цикл
			СтрокаПроект.ЗначениеПоказателя = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроектов,
				ОсновнойПоказательИнвестирования, СтрокаПроект.Проект); 
			СтрокаПроект.Балл = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроектов,
				ПоказательБалла, СтрокаПроект.Проект);
		КонецЦикла;
		
		ТаблицаПроектов.Сортировать("Балл УБЫВ, Статус, Заявка");		
	КонецЕсли;	
	
	СчВходящие = 1; СчНеВходящие = 1;	
	Для Каждого СтрокаПроект Из ТаблицаПроектов Цикл
												
		Если ПересчетПоказателей Тогда
			СтрокаПроект.ПопаданиеВКритерий = Ложь;
					
			Если ЗначениеЗаполнено(СтрокаПроект.ЗначениеПоказателя) И НакопленнаяСумма < ЗначениеОсновногоПоказателяИнвестирования Тогда											
				НакопленнаяСумма = НакопленнаяСумма + СтрокаПроект.ЗначениеПоказателя;
				Если НакопленнаяСумма <= ЗначениеОсновногоПоказателяИнвестирования Тогда
					СтрокаПроект.ПопаданиеВКритерий = Истина;
				КонецЕсли;					
			КонецЕсли;
		КонецЕсли;	
				
		Если (ПересчетПоказателей И СтрокаПроект.ПопаданиеВКритерий = Истина) 
			ИЛИ (НЕ ПересчетПоказателей И СтрокаПроект.ПроектБизнесПлана = Истина) Тогда
			НоваяСтрока = ГруппировкаВходящие.Строки.Добавить();
			НоваяСтрока.НомерСтроки = СчВходящие;
			НоваяСтрока.Ранг = СчВходящие;
			НоваяСтрока.ПроектБизнесПлана = Истина;
			СчВходящие = СчВходящие + 1;									
		Иначе	
			НоваяСтрока = ГруппировкаНеВходящие.Строки.Добавить();
			НоваяСтрока.НомерСтроки = СчНеВходящие;
			СчНеВходящие = СчНеВходящие + 1;
		КонецЕсли;	
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПроект, , "ПроектБизнесПлана");					
		НоваяСтрока.Объект = СтрокаПроект.Проект;
		
		Если СтрокаПроект.ПопаданиеВКритерий = Истина Тогда
			Индекс = ГруппировкаВходящие.Строки.Индекс(НоваяСтрока);
			Если Индекс > 0 Тогда
				ПредыдущаяСтрока = ГруппировкаВходящие.Строки[Индекс - 1];
				Если ПредыдущаяСтрока.Балл < НоваяСтрока.Балл Тогда
					ПредыдущаяСтрока.ЭтоПоднятыйБалл = Истина;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;					
	
	Для Каждого СтрокаНеВходящие Из ГруппировкаНеВходящие.Строки Цикл
		СтрокаНеВходящие.Ранг = (СчВходящие - 1) + СтрокаНеВходящие.НомерСтроки; 	
	КонецЦикла;	
	
	// Итоги.
	ГруппировкаЛимит.ЗначениеПоказателя = ЗначениеОсновногоПоказателяИнвестирования;
	ГруппировкаВходящие.ЗначениеПоказателя = ГруппировкаВходящие.Строки.Итог("ЗначениеПоказателя");
	ГруппировкаНеВходящие.ЗначениеПоказателя = ГруппировкаНеВходящие.Строки.Итог("ЗначениеПоказателя");
	ГруппировкаОстатокЛимита.ЗначениеПоказателя = ГруппировкаЛимит.ЗначениеПоказателя - ГруппировкаВходящие.ЗначениеПоказателя;
	ГруппировкаИтог.ЗначениеПоказателя = ГруппировкаВходящие.ЗначениеПоказателя + ГруппировкаНеВходящие.ЗначениеПоказателя;

КонецПроцедуры // ()

&НаСервере
Процедура ЗаполнитьДеревоПроектовПоКоманде()
	
	ОчиститьПроектыВДереве(ДеревоПроекты, ИдентификаторыГруппировок);
	
	Запрос = Новый Запрос;
				
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВложенныйЗапрос.Проект КАК Проект,
	               |	Проекты.Подразделение КАК Подразделение,
	               |	Проекты.ПортфельПроектов КАК ПортфельПроектов,
	               |	Проекты.ПрограммаПроектов КАК ПрограммаПроектов,
	               |	ВложенныйЗапрос.Заявка КАК Заявка,
	               |	ВложенныйЗапрос.Статус КАК Статус
	               |ПОМЕСТИТЬ втПроекты
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		упоЗаявкаНаПроект.Проект КАК Проект,
	               |		упоЗаявкаНаПроект.Ссылка КАК Заявка,
	               |		упоСтатусыЗаявокНаПроектСрезПоследних.Статус КАК Статус
	               |	ИЗ
	               |		РегистрСведений.упоСтатусыЗаявокНаПроект.СрезПоследних(, ) КАК упоСтатусыЗаявокНаПроектСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоЗаявкаНаПроект КАК упоЗаявкаНаПроект
	               |			ПО упоСтатусыЗаявокНаПроектСрезПоследних.ЗаявкаНаПроект = упоЗаявкаНаПроект.Ссылка) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО ВложенныйЗапрос.Проект = Проекты.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПроекты.Проект КАК Проект,
	               |	0 КАК ЗначениеПоказателя,
	               |	0 КАК Балл,
	               |	ЛОЖЬ КАК ПопаданиеВКритерий,
	               |	ЛОЖЬ КАК ПроектБизнесПлана,
	               |	втПроекты.Подразделение КАК Подразделение,
	               |	втПроекты.ПортфельПроектов КАК Портфель,
	               |	втПроекты.ПрограммаПроектов КАК Программа,
	               |	втПроекты.Заявка КАК Заявка,
	               |	втПроекты.Статус КАК Статус
	               |ИЗ
	               |	втПроекты КАК втПроекты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Статус УБЫВ,
	               |	Заявка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗаявкаНаПроектСвязанныеЗаявки.Ссылка КАК ИсходнаяЗаявка,
	               |	упоЗаявкаНаПроектСвязанныеЗаявки.Заявка КАК СвязаннаяЗаявка,
	               |	втПроекты.Проект КАК ИсходныйПроект,
	               |	упоЗаявкаНаПроектСвязанныеЗаявки.Заявка.Проект КАК СвязанныйПроект
	               |ИЗ
	               |	втПроекты КАК втПроекты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоЗаявкаНаПроект.СвязанныеЗаявки КАК упоЗаявкаНаПроектСвязанныеЗаявки
	               |		ПО втПроекты.Заявка = упоЗаявкаНаПроектСвязанныеЗаявки.Ссылка";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
			
	Соединения = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Соединения;	
			
	ПоляОтбора = Новый Массив;
	ПоляОтбора.Добавить("Подразделение");
	ПоляОтбора.Добавить("ПортфельПроектов");
		
	ЕстьОтбор = Ложь;
	ШаблонУсловия = "Проекты.%1 = &%1";
	Для Каждого ПолеОтбора Из ПоляОтбора Цикл		
		Если ЗначениеЗаполнено(Объект[ПолеОтбора]) Тогда
			Запрос.УстановитьПараметр(ПолеОтбора, Объект[ПолеОтбора]);	
			Соединения.Добавить("Проекты", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУсловия, ПолеОтбора));
			ЕстьОтбор = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОтбор Тогда
		Для Каждого Соединение Из Соединения Цикл
			Соединение.ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;
		КонецЦикла;
	КонецЕсли;	
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[1].Пустой() Тогда		
		Объект.СвязанныеЗаявки.Очистить();
		Возврат;			
	КонецЕсли;	
		
	ДеревоФормы = РеквизитФормыВЗначение("ДеревоПроекты");		
	
	ЗаполнитьДеревоПоТаблицеПроектов(ДеревоФормы, Результат[1].Выгрузить());
		
	Если НЕ Результат[2].Пустой() Тогда
		ТаблицаСвязанныеПроекты = Результат[2].Выгрузить();
		Объект.СвязанныеЗаявки.Загрузить(ТаблицаСвязанныеПроекты);
		ОтметитьСвязанныеПроектыВРазныхГруппах(ДеревоФормы, ТаблицаСвязанныеПроекты);
	Иначе
		Объект.СвязанныеЗаявки.Очистить();	
	КонецЕсли;	
	
	ЗначениеВРеквизитФормы(ДеревоФормы, "ДеревоПроекты");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПроектовПоТабличнойЧасти(ДеревоФормы)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоФормированиеБизнесПланаПроекты.Заявка КАК Заявка,
	               |	упоФормированиеБизнесПланаПроекты.Проект КАК Проект,
	               |	упоФормированиеБизнесПланаПроекты.Балл КАК Балл,
	               |	упоФормированиеБизнесПланаПроекты.ЗначениеПоказателя КАК ЗначениеПоказателя,
	               |	упоФормированиеБизнесПланаПроекты.ПопаданиеВКритерий КАК ПопаданиеВКритерий,
	               |	упоФормированиеБизнесПланаПроекты.Ранг КАК Ранг,
	               |	Проекты.Подразделение КАК Подразделение,
	               |	Проекты.ПортфельПроектов КАК Портфель,
	               |	ЕСТЬNULL(упоСтатусыЗаявокНаПроектСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаявокНаПроект.Инициировано)) КАК Статус,
	               |	упоФормированиеБизнесПланаПроекты.ПроектБизнесПлана КАК ПроектБизнесПлана
	               |ИЗ
	               |	Документ.упоФормированиеБизнесПлана.Проекты КАК упоФормированиеБизнесПланаПроекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоФормированиеБизнесПланаПроекты.Проект = Проекты.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыЗаявокНаПроект.СрезПоследних КАК упоСтатусыЗаявокНаПроектСрезПоследних
	               |		ПО упоФормированиеБизнесПланаПроекты.Заявка = упоСтатусыЗаявокНаПроектСрезПоследних.ЗаявкаНаПроект
	               |ГДЕ
	               |	упоФормированиеБизнесПланаПроекты.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоФормированиеБизнесПланаПроекты.НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоФормированиеБизнесПланаСвязанныеЗаявки.ИсходнаяЗаявка КАК ИсходнаяЗаявка,
	               |	упоФормированиеБизнесПланаСвязанныеЗаявки.СвязаннаяЗаявка КАК СвязаннаяЗаявка,
	               |	упоЗаявкаНаПроект.Проект КАК ИсходныйПроект,
	               |	упоЗаявкаНаПроектСвязанная.Проект КАК СвязанныйПроект
	               |ИЗ
	               |	Документ.упоФормированиеБизнесПлана.СвязанныеЗаявки КАК упоФормированиеБизнесПланаСвязанныеЗаявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоЗаявкаНаПроект КАК упоЗаявкаНаПроект
	               |		ПО упоФормированиеБизнесПланаСвязанныеЗаявки.ИсходнаяЗаявка = упоЗаявкаНаПроект.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоЗаявкаНаПроект КАК упоЗаявкаНаПроектСвязанная
	               |		ПО упоФормированиеБизнесПланаСвязанныеЗаявки.СвязаннаяЗаявка = упоЗаявкаНаПроектСвязанная.Ссылка
	               |ГДЕ
	               |	упоФормированиеБизнесПланаСвязанныеЗаявки.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоФормированиеБизнесПланаСвязанныеЗаявки.НомерСтроки";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[0].Пустой() Тогда
		Возврат;
	КонецЕсли;	
		
	ЗаполнитьДеревоПоТаблицеПроектов(ДеревоФормы, Результат[0].Выгрузить(), Ложь);
		
	Если Не Результат[1].Пустой() Тогда
		ОтметитьСвязанныеПроектыВРазныхГруппах(ДеревоФормы, Результат[1].Выгрузить());
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СоздатьПортфельНаСервере()
	
	СрокиПроектов = Новый Соответствие;
	ПроектыБизнесПлана = Новый Массив;
	
	Для Каждого СтрокаПроект Из Объект.Проекты Цикл
		Если НЕ СтрокаПроект.ПроектБизнесПлана Тогда
			Продолжить;
		КонецЕсли;
		ПроектыБизнесПлана.Добавить(СтрокаПроект.Проект);
		
		СрокиПроекта = упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроекта(СтрокаПроект.Проект);
		СрокиПроектов.Вставить(СтрокаПроект.Проект, СрокиПроекта);
	КонецЦикла;
	
	РеквизитыПроектов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПроектыБизнесПлана, "Наименование");
	
	Отказ = Ложь;
	НачатьТранзакцию();
	
	ПортфельБизнесПлана = Справочники.упоПортфелиПроектов.СоздатьЭлемент();
	ПортфельБизнесПлана.Наименование = НСтр("ru = 'Формирование бизнес-плана'");
	ПортфельБизнесПлана.Записать();
	
	ПроектСтруктуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПортфельБизнесПлана.Ссылка, "ПроектСтруктуры");
	
	РегистрацияПроекта = Документы.упоРегистрацияПроекта.СоздатьДокумент();
	РегистрацияПроекта.Дата = ТекущаяДатаСеанса();
	РегистрацияПроекта.Заполнить(ПроектСтруктуры);
	РегистрацияПроекта.Записать(РежимЗаписиДокумента.Проведение);
	
	Для Каждого Проект Из ПроектыБизнесПлана Цикл
		
		СрокиПроекта = СрокиПроектов[Проект];
		РеквизитыПроекта = РеквизитыПроектов[Проект];
		
		ДокЗадача = Документы.упоПроектнаяЗадача.СоздатьДокумент();
		ДокЗадача.Заполнить(ПроектСтруктуры);
		
		ДокЗадача.НазваниеПроектнойЗадачи = РеквизитыПроекта.Наименование;
		ДокЗадача.ПодчиненныйПроект = Проект;
		ДокЗадача.ОбновлятьДатуДокумента = Истина;
		ДокЗадача.РучнойВводСроков = Истина;
		ДокЗадача.ДатаНачалаПлан = СрокиПроекта.ДатаНачалаПлан;
		ДокЗадача.ДатаЗавершенияПлан = СрокиПроекта.ДатаЗавершенияПлан;
		ДокЗадача.ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Этап;
		
		Попытка
			ДокЗадача.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("ОшибкаЗаписиПроектнойЗадачи", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.упоПроектнаяЗадача, , ПредставлениеОшибки);
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось провести документ ""Проектная задача""
						|для бизнес-плана %1'. См. журнал регистрации."), ПроектСтруктуры);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
			Отказ = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Объект.ПортфельБизнесПлана = ПортфельБизнесПлана.Ссылка;
	
	Если Не Записать() Тогда
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОшибкаЗаписиПроектнойЗадачи", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.упоФормированиеБизнесПлана, , ПредставлениеОшибки);
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось провести документ ""Формирование бизнес-плана""
					|для бизнес-плана %1'. См. журнал регистрации."), ПроектСтруктуры);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	ПроверитьНеобходимостьСозданияБизнесПлана(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПортфельЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);		
		Если Записать(ПараметрыЗаписи) Тогда
			СоздатьПортфельНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьНеобходимостьСозданияБизнесПлана(Форма, Объект)
	
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Объект.ПортфельБизнесПлана) Тогда
		Элементы.СтраницыБизнесПлан.ТекущаяСтраница = Элементы.ГруппаБизнесПланЕсть;
	Иначе
		Элементы.СтраницыБизнесПлан.ТекущаяСтраница = Элементы.ГруппаБизнесПланСоздать;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтборПриИзменении(ИмяРеквизита)
	
	Если ЕстьДанныеВТабличнойЧасти() Тогда
				
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтборПриИзмененииЗавершение", ЭтотОбъект, ИмяРеквизита);					
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Табличная часть документа будет очищена. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);		

	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтборПриИзмененииЗавершение(Результат, ИмяРеквизита) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда				
		ОчиститьПроектыВДереве(ДеревоПроекты, ИдентификаторыГруппировок);
				
		ПредыдущиеЗначенияОтборов[ИмяРеквизита] = Объект[ИмяРеквизита];			
	Иначе				
		Объект[ИмяРеквизита] = ПредыдущиеЗначенияОтборов[ИмяРеквизита];		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Функция ЕстьДанныеВТабличнойЧасти()
	
	ЕстьДанные = Ложь;
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить("Входящие");
	МассивГруппировок.Добавить("НеВходящие");
	
	Для Каждого ИмяГруппировки Из МассивГруппировок Цикл		
		РазделГруппировки = ДеревоПроекты.НайтиПоИдентификатору(ИдентификаторыГруппировок[ИмяГруппировки]);		
		СтрокиРаздела = РазделГруппировки.ПолучитьЭлементы();
		Если СтрокиРаздела.Количество() > 0 Тогда
			ЕстьДанные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ЕстьДанные;
	
КонецФункции	

#КонецОбласти
