////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с представлением проектов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Строит список прямых потомков проектной задачи (включая плановые сроки).
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - задача-родитель
// 
// Возвращаемое значение:
//  ТаблицаЗначений - сформированная таблица данных.
//
Функция обПолучитьСписокПрямыхПотомковЗадачи(ПроектнаяЗадача) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	СрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	СрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	               |	ВЫБОР
	               |		КОГДА ПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ ПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности
	               |	КОНЕЦ КАК ПроцентГотовности,
	               |	СвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот,
	               |	СвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	               |	СвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха,
	               |	СвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК СвойстваПроектныхЗадачСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК СрокиПроектныхЗадачСрезПоследних
	               |		ПО СвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = СрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК ПроцентыГотовностиПроектныхЗадачСрезПоследних
	               |		ПО СвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	СвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = &ЗадачаРодитель
	               |	И НЕ СвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПроектнаяЗадача";
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	Запрос.УстановитьПараметр("текВерсия", ТекВерсия);
	Запрос.УстановитьПараметр("ЗадачаРодитель", ПроектнаяЗадача);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();

КонецФункции

// Формирует структуру дерева значений для заполнения исходными
//  данными для построения простой диаграммы Ганта.
// 
// Возвращаемое значение:
//  ДеревоЗначений - сформированная структура дерева значений (пустая).
//
Функция обПолучитьПустоеДеревоДанныхГанта() Экспорт

	// Дерево представляет следующую иерархию:
	//
	// ГлавнаяТочка
	// -- ПодТочка 1
	//    -- Серия 1 (ИмяСерии = "@@")
	// 	     -- Интервал 1 (ЭтоИнтервал = Истина)
	// 	     -- Интервал 2
	//    -- Серия 2
	//    ...
	// -- ПодТочка 2
	// ...
	
	Дерево = Новый ДеревоЗначений();
	
	Дерево.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0))); 
	Дерево.Колонки.Добавить("Объект");	
	Дерево.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Цвет"));
	Дерево.Колонки.Добавить("ЦветПодписи", Новый ОписаниеТипов("Цвет"));
	Дерево.Колонки.Добавить("Подпись", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0))); 
	Дерево.Колонки.Добавить("Начало", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))); 
	Дерево.Колонки.Добавить("Конец", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))); 
	Дерево.Колонки.Добавить("НачалоДоп", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))); 
	Дерево.Колонки.Добавить("КонецДоп", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))); 	
	Дерево.Колонки.Добавить("ПоказыватьКартинку", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("ИмяКартинки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(128)));
	Дерево.Колонки.Добавить("МенятьЦветТекста", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("ЦветТекста", Новый ОписаниеТипов("Цвет"));
	Дерево.Колонки.Добавить("ИмяСерии", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ЭтоИнтервал", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("НеДобавлятьТочку", Новый ОписаниеТипов("Булево"));
	
    Возврат Дерево;
	
КонецФункции

// Формирует структуру таблицы значений для заполнения исходных данных.
//  диаграммы Ганта (а именно, связей между интервалами).
// 
// Возвращаемое значение:
//  ТаблицаЗначений - сформированная пустая таблица.
//
Функция обПолучитьПустуюТаблицуСвязейГанта() Экспорт

	ТЗ = Новый ТаблицаЗначений();
	
	ТЗ.Колонки.Добавить("Откуда");
	ТЗ.Колонки.Добавить("Куда");
	ТЗ.Колонки.Добавить("ТипСвязи");
	ТЗ.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Цвет"));
	
	Возврат ТЗ;

КонецФункции

// На основании дерева значений строит простую диаграмму Ганта (вариант 1).
//  Ограничения этого варианта:
//  - только одна серия;
//  - на каждую точку только один интервал.
//
// Параметры:
//  Диаграмма								 - ДиаграммаГанта	 - диаграмма.
//  ДеревоДанных							 - ДеревоЗначений	 - структура данных для диаграммы.
//  ТаблицаСвязей							 - ТаблицаЗначений	 - структура взаимосвязей между объектами.
//  КоличествоУровней						 - Число			 - количество уровней точек диаграммы (возвращаемый).
//  ВыводитьМетку							 - Булево			 - флаг указывает на необходимость вывести метку
//  			на текущую дату.
//  ВыводитьДатыВДиаграммеГанта				 - Булево
//  РазбиватьНаИнтервалыРодительскуюТочку	 - Булево
//
Процедура обПостроитьПростуюДиаграммуГанта(Диаграмма,
											ДеревоДанных,
											ТаблицаСвязей = Неопределено,
											КоличествоУровней = 0,
											ВыводитьМетку = Ложь,
											ВыводитьДатыВДиаграммеГанта = Ложь,
											РазбиватьНаИнтервалыРодительскуюТочку = Ложь) Экспорт

  	АдаптироватьДеревоВебКлиент(ДеревоДанных);
											
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	// Чтобы потом (если это нужно) строить связи, будем кэшировать
	// соответствие точек Ганта с объектами дерева.
	
	КэшДерева = Новый ТаблицаЗначений();
	КэшДерева.Колонки.Добавить("Объект");
	КэшДерева.Колонки.Добавить("Интервал");
		
	ОбщаяСерия = Диаграмма.Серии.Добавить();
	
	Для каждого СтрокаДерева Из ДеревоДанных.Строки Цикл
		
		Если РазбиватьНаИнтервалыРодительскуюТочку Тогда
			
			ТочкаРодитель = Диаграмма.Точки.Добавить();
			ТочкаРодитель.Значение = СтрокаДерева.Объект;
			ТочкаРодитель.Текст = СтрокаДерева.Имя;
			ТочкаРодитель.Цвет = СтрокаДерева.Цвет;
			Если СтрокаДерева.ЦветТекста <> Неопределено И ТипЗнч(СтрокаДерева.ЦветТекста) = Тип("Цвет") Тогда
				ТочкаРодитель.ЦветТекста = СтрокаДерева.ЦветТекста;
			КонецЕсли;
			
			// Не забудем, что у ТочкаРодитель можеть быть несколько интервалов,
			// причем начало и конец надо посчитать.
			
			Интервал = Неопределено;
			Для каждого СтрокаИнтервал Из СтрокаДерева.Строки Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаИнтервал.Начало)
					И СтрокаИнтервал.Конец = КонецДня(Дата(1, 1, 1)) Тогда
					
					Продолжить;
					
				КонецЕсли; 				
				
				ЗначениеДГ = Диаграмма.ПолучитьЗначение(ТочкаРодитель, ОбщаяСерия);
				ЗначениеДГ.ЦветТекста = СтрокаИнтервал.ЦветПодписи;
				
				// Разобраться с началом и концом, чтоб не было наложений.
				
				Если Интервал = Неопределено
					ИЛИ ((НЕ Интервал = Неопределено) И (НачалоДня(СтрокаИнтервал.Начало) > НачалоДня(Интервал.Конец))) Тогда
					Интервал = ЗначениеДГ.Добавить();
					Интервал.Начало = СтрокаИнтервал.Начало;
					Интервал.Конец = СтрокаИнтервал.Конец;
				ИначеЕсли (НЕ Интервал = Неопределено) 
					И СтрокаИнтервал.Начало >= Интервал.Начало
					И СтрокаИнтервал.Конец <= Интервал.Конец Тогда
					// Не надо указывать конец или начало. Все ок.
				Иначе
					Интервал.Конец = СтрокаИнтервал.Конец;
				КонецЕсли;
				
				Интервал.Цвет = ТочкаРодитель.Цвет;  		
				
				обДобавитьИнтервалПростойДиаграммыГанта(Диаграмма,
														 СтрокаИнтервал,
														 ОбщаяСерия,
														 ТочкаРодитель,
														 КэшДерева,
														 КоличествоУровней,
														 ВыводитьДатыВДиаграммеГанта);
			КонецЦикла;
			
			Диаграмма.РазвернутьТочку(ТочкаРодитель, Истина);
			
		Иначе // Без разбивки родительской точки по интервалам - все одним общим интервалом от и до.
			
			Точка = обДобавитьИнтервалПростойДиаграммыГанта(Диаграмма,
															 СтрокаДерева,
															 ОбщаяСерия,
															 ,
															 КэшДерева,
															 КоличествоУровней,
															 ВыводитьДатыВДиаграммеГанта);
			Диаграмма.РазвернутьТочку(Точка, Истина);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// При необходимости строим связи между интервалами.
	
	Если НЕ ТаблицаСвязей = Неопределено Тогда      
		Для каждого СтрокаСвязь Из ТаблицаСвязей Цикл
			
			СтрокаТочкаОткуда = КэшДерева.Найти(СтрокаСвязь.Откуда, "Объект");
			СтрокаТочкаКуда = КэшДерева.Найти(СтрокаСвязь.Куда, "Объект");
			
			Если СтрокаТочкаОткуда = Неопределено ИЛИ СтрокаТочкаКуда = Неопределено Тогда      
				Продолжить; // Просто нет таких объектов в дереве.
			КонецЕсли; 
			
			// Ищем в кэше интервалы начала и конца.
						
			ИнтервалОткуда = СтрокаТочкаОткуда.Интервал;
			ИнтервалКуда = СтрокаТочкаКуда.Интервал;
			
			Если ИнтервалОткуда = Неопределено ИЛИ ИнтервалКуда = Неопределено Тогда      
				Продолжить; // Искомых интервалов в дереве почему-то не оказалось.
			КонецЕсли; 
			
			Связь = ИнтервалОткуда.Добавить(ИнтервалКуда);
			
			Если ЗначениеЗаполнено(СтрокаСвязь.ТипСвязи) Тогда
				Связь.ТипСвязи = СтрокаСвязь.ТипСвязи;
			Иначе
				Связь.ТипСвязи = ТипСвязиДиаграммыГанта.КонецНачало;
			КонецЕсли;
			
			Если СтрокаСвязь.Цвет.Вид = ВидЦвета.АвтоЦвет Тогда
				Связь.Цвет = упоФункцииОбщегоНазначенияСервер.ПреобразоватьЦвет(ЦветаСтиля.упоЦветДиаграммыГантаСвязиПоУмолчанию,
					ВидЦвета.Абсолютный);
			Иначе
				Связь.Цвет = СтрокаСвязь.Цвет;
			КонецЕсли; 
			
		КонецЦикла; 		
	КонецЕсли; 
	
	ШкалаВремени = Диаграмма.ОбластьПостроения.ШкалаВремени;
	ШкалаВремени.ЦветФона = упоФункцииОбщегоНазначенияСервер.ПреобразоватьЦвет(ЦветаСтиля.упоЦветШкалыВремениГант,
		ВидЦвета.Абсолютный);
	
	// По умолчанию настроим диаграмму на месяцы.
	
	Для каждого ЭлементШкалы Из ШкалаВремени.Элементы Цикл
		
		ЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Месяц;
		ЭлементШкалы.Кратность = 1;
		ЭлементШкалы.ФорматДня = ФорматДняШкалыВремени.ДеньМесяцаДеньНедели;
		
		Если ВыводитьМетку Тогда 
			ЭлементШкалы.Метки.Очистить();
			Метка = ЭлементШкалы.Метки.Добавить(ТекущаяДатаСеанса());
			Метка.ЦветЛинии = упоФункцииОбщегоНазначенияСервер.ПреобразоватьЦвет(ЦветаСтиля.упоЦветМеткиДиаграммыГанта,
				ВидЦвета.Абсолютный);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.РастягиваниеПоВертикали = РастягиваниеПоВертикалиДиаграммыГанта.НеРастягивать;
	
	Диаграмма.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
	
	упоПредставлениеПроектаВызовСервера.обУстановитьПараметрыДиаграммыГанта(Диаграмма);
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

// На основании дерева значений строит простую диаграмму Ганта (вариант 2).
//  Ограничения этого варианта:
//  - только одна серия;
//  - только один уровень дерева (т.е. дерева, как такового, нет).
//  Фичи этого варианта:
//  - на каждую точку может быть любое количество интервалов;
//  - по умолчанию масштабирует диаграмму по дням.
//
// Параметры:
//  Диаграмма		 - ДиаграммаГанта	 - диаграмма.
//  ДеревоДанных	 - ДеревоЗначений	 - структура данных для диаграммы.
//  ВыходныеДни		 - Массив			 - список нерабочих дней для отметки на диаграмме
//  ВыводитьМетку	 - Булево			 - флаг указывает на необходимость вывести метку
//  			на текущую дату.
//
Процедура обПостроитьПростуюДиаграммуГантаСИнтервалами(Диаграмма,
														ДеревоДанных,
														ВыходныеДни = Неопределено,
														ВыводитьМетку = Истина) Экспорт
														
	АдаптироватьДеревоВебКлиент(ДеревоДанных);
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	ОбщаяСерия = Диаграмма.Серии.Добавить();
	
	Для каждого СтрокаДерева Из ДеревоДанных.Строки Цикл
		
		Точка = Диаграмма.Точки.Добавить();
		Точка.Расшифровка = СтрокаДерева.Объект;
		Точка.Значение = СтрокаДерева.Объект;
		Точка.Текст = СтрокаДерева.Имя;
		Точка.Цвет = СтрокаДерева.Цвет;
		
		Если СтрокаДерева.МенятьЦветТекста Тогда      
			Точка.ЦветТекста = СтрокаДерева.ЦветТекста;
		КонецЕсли; 	
		
		Для каждого СтрокаИнтервал Из СтрокаДерева.Строки Цикл        
			
			ЗначениеГант = Диаграмма.ПолучитьЗначение(Точка, ОбщаяСерия);
			ЗначениеГант.Текст = СтрокаИнтервал.Подпись;
			ЗначениеГант.ЦветТекста = СтрокаИнтервал.ЦветПодписи;
			
			Интервал = ЗначениеГант.Добавить();
			Интервал.Начало = СтрокаИнтервал.Начало;
			Интервал.Конец = СтрокаИнтервал.Конец;
			Интервал.Расшифровка = СтрокаИнтервал.Объект;
			Интервал.Цвет = СтрокаИнтервал.Цвет;  		
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	ШкалаВремени = Диаграмма.ОбластьПостроения.ШкалаВремени;
	ШкалаВремени.ЦветФона = ЦветаСтиля.упоЦветШкалыВремениГант;
	
	// По умолчанию масштабируем диаграмму на дни.
	
	упоПредставлениеПроектаВызовСервера.обИзменитьМасштабДиаграммыГанта(Диаграмма, ТипЕдиницыШкалыВремени.День);
	
	// И пометим, какие из дней будут нерабочие.
	
	Если НЕ ВыходныеДни = Неопределено Тогда
		Для каждого ВыходнойДень Из ВыходныеДни Цикл
			ИнтервалФона = Диаграмма.ИнтервалыФона.Добавить(НачалоДня(ВыходнойДень), КонецДня(ВыходнойДень));
			ИнтервалФона.Цвет = Новый Цвет(250, 240, 230);	
		КонецЦикла; 
	КонецЕсли; 
	
	упоПредставлениеПроектаВызовСервера.обУстановитьПараметрыДиаграммыГанта(Диаграмма);
	
	Диаграмма.Обновление = Истина;

КонецПроцедуры

// На основании дерева значений строит простую диаграмму Ганта (вариант 3).
//  Ограничения этого варианта:
//  - только один уровень иерархии Ганта, но можно присоединить к существующей точке;
//  - на каждую точку в одной серии только один интервал;
//  - нет связей между интервалами.
//  Фичи этого варианта:
//  - любое количество серий.
//
// Параметры:
//  Диаграмма		 - ДиаграммаГанта	 - диаграмма.
//  ДеревоДанных	 - ДеревоЗначений	 - структура данных для диаграммы.
//  ВыводитьМетку	 - Булево			 - флаг указывает на необходимость вывести метку
//  			на текущую дату.
//  СерииГанта		 - Массив			 - массив серий.
//  ОсновнаяТочка	 - ТочкаДиаграммыГанта	 - точка диаграммы Ганта.
//
Процедура обПостроитьПростуюДиаграммуГантаССериями(Диаграмма,
													ДеревоДанных,
													ВыводитьМетку = Истина,
													СерииГанта = Неопределено,
													ОсновнаяТочка = Неопределено) Экспорт
													
	АдаптироватьДеревоВебКлиент(ДеревоДанных);												
													
	Если СерииГанта = Неопределено Тогда 
		СерииГанта = Новый Массив();
		Диаграмма.Обновление = Ложь;
		Диаграмма.Очистить();
	КонецЕсли;
	
	Для каждого СтрокаДерева Из ДеревоДанных.Строки Цикл
		Если ОсновнаяТочка = Неопределено Тогда 
			Точка = Диаграмма.Точки.Добавить();
		Иначе 
			Точка = ОсновнаяТочка.Точки.Добавить();
		КонецЕсли;
		Точка.Расшифровка = СтрокаДерева.Объект;
		Точка.Значение = СтрокаДерева.Объект;
		Точка.Текст = СтрокаДерева.Имя;
		Точка.Цвет = СтрокаДерева.Цвет;
		
		Если СтрокаДерева.МенятьЦветТекста Тогда      
			Точка.ЦветТекста = СтрокаДерева.ЦветТекста;
		КонецЕсли; 	
		
		Если СтрокаДерева.ПоказыватьКартинку Тогда      
			Точка.Картинка = БиблиотекаКартинок[СтрокаДерева.ИмяКартинки];
		КонецЕсли; 
		
		СчетчикСерий = 0;
		Для каждого СтрокаИнтервал Из СтрокаДерева.Строки Цикл        
			
			СчетчикСерий = СчетчикСерий + 1;
			
			// Если нужной серии еще нет, добавим ее в массив.
			
			Если СерииГанта.Количество() < СчетчикСерий Тогда      
				НоваяСерия = Диаграмма.Серии.Добавить();
				СерииГанта.Добавить(НоваяСерия);
			КонецЕсли; 
			
			СерияГанта = СерииГанта.Получить(СчетчикСерий - 1);
			
			ЗначениеГант = Диаграмма.ПолучитьЗначение(Точка, СерияГанта);
			ЗначениеГант.Текст = СтрокаИнтервал.Подпись;
			ЗначениеГант.ЦветТекста = СтрокаИнтервал.ЦветПодписи;
			
			Интервал = ЗначениеГант.Добавить();
			Интервал.Начало = СтрокаИнтервал.Начало;
			Интервал.Конец = СтрокаИнтервал.Конец;
			Интервал.Расшифровка = СтрокаИнтервал.Объект;
			Интервал.Цвет = СтрокаИнтервал.Цвет;  		
			Интервал.Текст = " [" + Формат (СтрокаИнтервал.Начало, ФорматДатыВДиаграммеГанта())
				+ "-" + Формат(СтрокаИнтервал.Конец, ФорматДатыВДиаграммеГанта()) + "]";
		КонецЦикла; 
	КонецЦикла;
	
	
	ШкалаВремени = Диаграмма.ОбластьПостроения.ШкалаВремени;
	ШкалаВремени.ЦветФона = ЦветаСтиля.упоЦветШкалыВремениГант;
	
	// По умолчанию настроим диаграмму на месяцы.
	
	Для каждого ЭлементШкалы Из ШкалаВремени.Элементы Цикл
		
		ЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Месяц;
		ЭлементШкалы.Кратность = 1;
		ЭлементШкалы.ФорматДня = ФорматДняШкалыВремени.ДеньМесяцаДеньНедели;
		
		Если ВыводитьМетку Тогда    
			ЭлементШкалы.Метки.Очистить();
			Метка = ЭлементШкалы.Метки.Добавить(ТекущаяДатаСеанса());
			Метка.ЦветЛинии = ЦветаСтиля.упоЦветМеткиДиаграммыГанта;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Диаграмма.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
	Диаграмма.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	
	упоПредставлениеПроектаВызовСервера.обУстановитьПараметрыДиаграммыГанта(Диаграмма);
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

// Изменяет масштаб (по дням, по неделям, etc.) простой диаграммы Ганта.
//
// Параметры:
//  Диаграмма					 - ДиаграммаГанта	 - диаграмма.
//  Период						 - ТипЕдиницыШкалыВремени	 - необходимый период.
//  Регулятор					 - ЭлементФормы				 - регулятор масштаба на форме.
//  СброситьМасштаб				 - Булево					 - флаг установки режима "Все данные".
//  ГруппироватьЭлементыШкалы	 - 							 - Булево
//
Процедура обИзменитьМасштабДиаграммыГанта(Диаграмма,
										   Период,
										   Регулятор = Неопределено,
										   СброситьМасштаб = Ложь,
										   ГруппироватьЭлементыШкалы = Ложь) Экспорт

	Если Период = ТипЕдиницыШкалыВремени.День Тогда  
		обВыделитьВыходныеВДиаграмме(Диаграмма);
	Иначе
		Диаграмма.ИнтервалыФона.Очистить(); 		
	КонецЕсли; 	
	
	Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени;
	
	Если ГруппироватьЭлементыШкалы Тогда				
		
		ТекЕдиница = Неопределено;			
		сч = Шкала.Элементы.Количество() - 1;
	
		Пока сч >= 0 Цикл		
			Если ТекЕдиница = Неопределено Тогда
				Если НЕ СброситьМасштаб Тогда
					ТекЕдиница = Период;
				Иначе
					ТекЕдиница = ТипЕдиницыШкалыВремени.Месяц;
				КонецЕсли;
			Иначе
				ТекЕдиница = ПолучитьСтаршийПериодДляШкалы(ТекЕдиница);						
			КонецЕсли;			
			ЭлементШкалы = Шкала.Элементы[сч];
			ЭлементШкалы.Единица = ТекЕдиница;
			сч = сч -1;		
		КонецЦикла;
	Иначе
		Для каждого Элемент Из Шкала.Элементы Цикл						
			Если НЕ СброситьМасштаб Тогда      
				Элемент.Единица = Период;		
			Иначе
				Элемент.Единица = ТипЕдиницыШкалыВремени.Месяц; // Значение по умолчанию.
			КонецЕсли; 	
		КонецЦикла; 
	КонецЕсли;
	
	Если НЕ СброситьМасштаб Тогда      
		Диаграмма.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
		Если Регулятор <> Неопределено Тогда
			Диаграмма.КратностьПериодическогоВарианта = Регулятор;
		Иначе
			Диаграмма.КратностьПериодическогоВарианта = 10;
		КонецЕсли;
		Диаграмма.ЕдиницаПериодическогоВарианта = Период;
	Иначе
		Диаграмма.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
		Диаграмма.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные; 				
	КонецЕсли;     	
	
	Если НЕ Регулятор = Неопределено Тогда      
		Если НЕ СброситьМасштаб Тогда      
			Регулятор = Диаграмма.КратностьПериодическогоВарианта; 	
		Иначе
			Регулятор = 10;
		КонецЕсли; 		
	КонецЕсли; 

КонецПроцедуры

// Сворачивает сетевую диаграмму до самого верхнего уровня.
//
// Параметры:
//  СетеваяДиаграмма - ПолеТабличногоДокумента	 - на который выведена диаграмма.
//  ДеревоДанных	 - ДеревоЗначений			 - иерархическая структура данных сетевой диаграммы.
//  ТаблицаСвязей	 - ТаблицаЗначений			 - связи между объектами диаграммы.
//  Параметры		 - Структура				 - набор параметров отрисовки диаграммы.
//
Процедура обСвернутьВсюСетевуюДиаграмму(СетеваяДиаграмма, ДеревоДанных, ТаблицаСвязей, Параметры) Экспорт

	ТаблицаИсключений = Новый ТаблицаЗначений();
	ТаблицаИсключений.Колонки.Добавить("Объект");
	
	Для Счетчик = 1 По ДеревоДанных.Строки.Количество() Цикл
		ТаблицаИсключений.Добавить();	
	КонецЦикла; 

	ТаблицаИсключений.ЗагрузитьКолонку(ДеревоДанных.Строки.ВыгрузитьКолонку("Объект"), "Объект");
	
	упоСетевыеГрафикиСервер.СформироватьСетевуюДиаграмму(СетеваяДиаграмма, ДеревоДанных, ТаблицаСвязей, Параметры, ТаблицаИсключений);
	
КонецПроцедуры

// Разворачивает сетевую диаграмму до самого нижнего уровня.
//
// Параметры:
//  СетеваяДиаграмма - ПолеТабличногоДокумента	 - на который выведена диаграмма.
//  ДеревоДанных	 - ДеревоЗначений			 - иерархическая структура данных сетевой диаграммы.
//  ТаблицаСвязей	 - ТаблицаЗначений			 - связи между объектами диаграммы.
//  Параметры		 - Структура				 - набор параметров отрисовки диаграммы.
//
Процедура обРазвернутьВсюСетевуюДиаграмму(СетеваяДиаграмма, ДеревоДанных, ТаблицаСвязей, Параметры) Экспорт

	ТаблицаИсключений = Новый ТаблицаЗначений();
	ТаблицаИсключений.Колонки.Добавить("Объект");
	
	упоСетевыеГрафикиСервер.СформироватьСетевуюДиаграмму(СетеваяДиаграмма, ДеревоДанных, ТаблицаСвязей, Параметры, ТаблицаИсключений);

КонецПроцедуры

// Устанавливает параметры диаграммы Ганта в зависимости от
//  окружения (в частности, меняет окантовку и вид интервалов).
//
// Параметры:
//  Диаграмма	 - ДиаграммаГанта	 - диаграмма
//
Процедура обУстановитьПараметрыДиаграммыГанта(Диаграмма) Экспорт

	#Если Клиент Тогда
	
	Диаграмма.Окантовка = Ложь;
	Диаграмма.ОтображениеИнтервала = ОтображениеИнтервалаДиаграммыГанта.Градиент;
	
	#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выделяет выходные дни цветом на диаграмме Ганта.
//
// Параметры:
//  Диаграмма  – ДиаграммаГанта - собственно диаграмма.
//
Процедура обВыделитьВыходныеВДиаграмме(Диаграмма)
	
	// Выделить выходные дни другим цветом фона.
 
	Неделя = 3600 * 24 * 7; 
	Выходные = 3600 * 48; 
	ТекущаяДата = Диаграмма.НачалоПолногоИнтервала;
	МаксимальнаяДата = Диаграмма.КонецПолногоИнтервала; 
	 
	ИнтервалыФона = Диаграмма.ИнтервалыФона;
	Пока ТекущаяДата <= МаксимальнаяДата Цикл
		Конец = НачалоНедели(ТекущаяДата);     
		Начало = Конец - Выходные;     
		ИнтервалыФона.Добавить(Начало, Конец); 		
		ТекущаяДата = ТекущаяДата + Неделя; 
	КонецЦикла;
	
КонецПроцедуры

// Рекурсивная функция для вывода интервалов на простую
// диаграмму Ганта.
//
// Параметры:
//  Диаграмма  		- ДиаграммаГанта - собственно диаграмма.
//  СтрокаДерева  	– СтрокаДереваЗначений – исходные данные интервала.
//  СерияГанта  	– СерияДиаграммыГанта – общая серия простой диаграммы.
//  ТочкаРодитель  	- ТочкаДиаграммыГанта - точка, которой подчинен интервал.
//  ТаблицаКэш  	- ТаблицаЗначений - служит для сохранения соответствия между точкой и объектом.
//  КоличествоУровней - Число - количество уровней точек диаграммы (возвращаемый).
//
// Возвращаемое значение:
//	ТочкаДиаграммыГанта – точка, добавленная в диаграмму.
//
Функция обДобавитьИнтервалПростойДиаграммыГанта(Диаграмма,
												 СтрокаДерева, 
												 СерияГанта, 
												 ТочкаРодитель = Неопределено,
												 ТаблицаКэш = Неопределено,
												 КоличествоУровней,
												 ВыводитьДатыВДиаграммеГанта)

	Если ТочкаРодитель = Неопределено Тогда      
		Точка = Диаграмма.Точки.Добавить();	
	Иначе
		Точка = ТочкаРодитель.Точки.Добавить();
	КонецЕсли;          	
	
	Если СтрокаДерева.ПоказыватьКартинку Тогда      
		Точка.Картинка = БиблиотекаКартинок[СтрокаДерева.ИмяКартинки];
	КонецЕсли; 
	
	Точка.Расшифровка = СтрокаДерева.Объект;
	Точка.Значение = СтрокаДерева.Объект;
	Точка.Текст = СтрокаДерева.Имя;
	Точка.Цвет = СтрокаДерева.Цвет;
	
	Если СтрокаДерева.МенятьЦветТекста Тогда      
		Точка.ЦветТекста = СтрокаДерева.ЦветТекста;
	КонецЕсли; 
		
	ЗначениеГант = Диаграмма.ПолучитьЗначение(Точка, СерияГанта);
	
	ЗначениеГант.Текст = СтрокаДерева.Подпись;
	
	ЗначениеГант.ЦветТекста = СтрокаДерева.ЦветПодписи;
	Интервал = ЗначениеГант.Добавить();
	Если ВыводитьДатыВДиаграммеГанта Тогда 		
		Интервал.Текст = Интервал.Текст + " ["+Формат(СтрокаДерева.Начало,ФорматДатыВДиаграммеГанта())
			+ "-" + Формат(СтрокаДерева.Конец, ФорматДатыВДиаграммеГанта()) + "]";
	КонецЕсли;	
		
	Интервал.Начало = СтрокаДерева.Начало;
	Если ЗначениеЗаполнено(НачалоДня(СтрокаДерева.Конец)) Тогда      
		Интервал.Конец = СтрокаДерева.Конец;	
	Иначе
		Интервал.Конец = НачалоДня(СтрокаДерева.Конец);
	КонецЕсли; 
	
	Интервал.Расшифровка = СтрокаДерева.Объект;
	Интервал.Цвет = СтрокаДерева.Цвет;

	Если НЕ ТаблицаКэш = Неопределено Тогда      
		СтрокаКэш = ТаблицаКэш.Добавить();
		СтрокаКэш.Объект = СтрокаДерева.Объект;
		СтрокаКэш.Интервал = Интервал;
	КонецЕсли; 
	
	Для каждого СтрокаНиже Из СтрокаДерева.Строки Цикл
		ТочкаНиже = обДобавитьИнтервалПростойДиаграммыГанта(
			Диаграмма, СтрокаНиже, СерияГанта, Точка, ТаблицаКэш, КоличествоУровней, ВыводитьДатыВДиаграммеГанта);
		КоличествоУровней = Макс(КоличествоУровней, ТочкаНиже.Уровень());
	КонецЦикла; 
	
	Возврат Точка;

КонецФункции
 
// Рекурсивная функция для вывода интервалов на диаграмму Ганта.
//
// Параметры:
//  Диаграмма  		- ДиаграммаГанта - собственно диаграмма.
//  СтрокаДерева  	– СтрокаДереваЗначений – исходные данные интервала.
//  СерияГанта  	– СерияДиаграммыГанта – текущая серия ветки дерева.
//  ТочкаРодитель  	- ТочкаДиаграммыГанта - точка, которой подчинен интервал.
//  ТаблицаКэш  	- Соответствие - служит для сохранения соответствия между точкой и объектом и именем серии.
//  КоличествоУровней  - Число - количество уровней точек диаграммы (возвращаемый).
//
// Возвращаемое значение:
//	ТочкаДиаграммыГанта – точка, добавленная в диаграмму.
//
Функция обДобавитьИнтервалДиаграммыГанта(Диаграмма,
										  СтрокаДерева,
										  ТаблицаКэш,
										  КоличествоУровней,
										  СерияГанта = Неопределено,
										  ТочкаРодитель = Неопределено)

	возвращаемоеЗначение = Неопределено;
	Точка = ТочкаРодитель;
	
	Если Не СтрокаДерева.НеДобавлятьТочку Тогда
		// Добавил использование кэша.
		Отбор = Новый Структура;
		Отбор.Вставить("Объект", СтрокаДерева.Объект);
		Отбор.Вставить("ЭтоТочка", Истина);
		Если ЗначениеЗаполнено(СтрокаДерева.Родитель) Тогда
			Отбор.Вставить("Родитель", СтрокаДерева.Родитель.Объект);
		Иначе
			Отбор.Вставить("Родитель", "Верхний уровень");
		КонецЕсли;
		НайденныеТочки = ТаблицаКэш.НайтиСтроки(Отбор);
		Если НайденныеТочки.Количество()=0 Тогда
			Если ТочкаРодитель = Неопределено Тогда
				Точка = Диаграмма.Точки.Добавить();
			Иначе
				Точка = ТочкаРодитель.Точки.Добавить();
			КонецЕсли;
			ЗаписьВКэш = ТаблицаКэш.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьВКэш, Отбор);
			ЗаписьВКэш.Точка = Точка;
		Иначе
			Точка = НайденныеТочки[0].Точка;	
		КонецЕсли;
		
		Если СтрокаДерева.ПоказыватьКартинку Тогда      
			Точка.Картинка = БиблиотекаКартинок[СтрокаДерева.ИмяКартинки];
		КонецЕсли; 
		
		Точка.Расшифровка 	= СтрокаДерева.Объект;
		Точка.Значение 		= СтрокаДерева.Объект;
		Точка.Текст 		= СтрокаДерева.Имя;
		Точка.Цвет 			= СтрокаДерева.Цвет;
		
		Если СтрокаДерева.МенятьЦветТекста Тогда      
			Точка.ЦветТекста = СтрокаДерева.ЦветТекста;
		КонецЕсли;
		
		возвращаемоеЗначение = Точка;
    КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДерева.ИмяСерии) ИЛИ СтрокаДерева.ИмяСерии = "" Тогда
		Отбор = Новый Структура("ЭтоСерия, ИмяСерии", Истина, СтрокаДерева.ИмяСерии); 
		НайденныеСерии = ТаблицаКэш.НайтиСтроки(Отбор);
		Если НайденныеСерии.Количество() = 0 Тогда
			СерияГанта = Неопределено;
		Иначе
			СерияГанта = НайденныеСерии[0].Серия;
		КонецЕсли;		
		
		Если СерияГанта = Неопределено Тогда
			СерияГанта = Диаграмма.Серии.Добавить();
			
			ЗаписьВКэш = ТаблицаКэш.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьВКэш, Отбор);
			ЗаписьВКэш.Серия = СерияГанта;
		КонецЕсли;
		
		Если возвращаемоеЗначение = Неопределено Тогда
			возвращаемоеЗначение = СерияГанта;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДерева.ЭтоИнтервал Тогда
		ЗначениеГант = Диаграмма.ПолучитьЗначение(Точка, СерияГанта);
		ЗначениеГант.Текст = СтрокаДерева.Подпись;
		ЗначениеГант.ЦветТекста = СтрокаДерева.ЦветПодписи;
		
		Интервал = ЗначениеГант.Добавить();
	
		Интервал.Начало = СтрокаДерева.Начало;
		Если ЗначениеЗаполнено(НачалоДня(СтрокаДерева.Конец)) Тогда      
			Интервал.Конец = СтрокаДерева.Конец;	
		Иначе
			Интервал.Конец = НачалоДня(СтрокаДерева.Конец);
		КонецЕсли; 
		
		Интервал.Расшифровка = СтрокаДерева.Объект;
		Интервал.Цвет = СтрокаДерева.Цвет;

		Если НЕ ТаблицаКэш = Неопределено Тогда      
			ЗаписьВКэш = ТаблицаКэш.Добавить();
			ЗаписьВКэш.ИмяСерии = СтрокаДерева.ИмяСерии;
			ЗаписьВКэш.Объект = СтрокаДерева.Объект;
			ЗаписьВКэш.Интервал = Интервал;
			ЗаписьВКэш.ЭтоИнтервал = Истина;
		КонецЕсли;
		
		Если возвращаемоеЗначение = Неопределено Тогда
			возвращаемоеЗначение = Интервал;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаНиже Из СтрокаДерева.Строки Цикл
		НечтоНиже = обДобавитьИнтервалДиаграммыГанта(Диаграмма, СтрокаНиже, ТаблицаКэш, КоличествоУровней, СерияГанта, Точка);
		Если НЕ НечтоНиже = Неопределено Тогда
			КоличествоУровней = Макс(КоличествоУровней, НечтоНиже.Уровень());
		КонецЕсли;
	КонецЦикла; 
	
	Возврат возвращаемоеЗначение;

КонецФункции
 
Функция ПолучитьСтаршийПериодДляШкалы(Период)
		
	Если Период = ТипЕдиницыШкалыВремени.Секунда Тогда
		ТекПериод = ТипЕдиницыШкалыВремени.Минута;
	ИначеЕсли Период = ТипЕдиницыШкалыВремени.Минута Тогда
		ТекПериод = ТипЕдиницыШкалыВремени.Час;
	ИначеЕсли Период = ТипЕдиницыШкалыВремени.Час Тогда
		ТекПериод = ТипЕдиницыШкалыВремени.День;
	ИначеЕсли Период = ТипЕдиницыШкалыВремени.День Тогда
		ТекПериод = ТипЕдиницыШкалыВремени.Месяц;
	ИначеЕсли Период = ТипЕдиницыШкалыВремени.Неделя Тогда
		ТекПериод = ТипЕдиницыШкалыВремени.Месяц;
	ИначеЕсли Период = ТипЕдиницыШкалыВремени.Месяц Тогда
		ТекПериод = ТипЕдиницыШкалыВремени.Год;
	ИначеЕсли Период = ТипЕдиницыШкалыВремени.Квартал Тогда
		ТекПериод = ТипЕдиницыШкалыВремени.Год;
	Иначе
		ТекПериод = Период;
	КонецЕсли;
	
	Возврат ТекПериод;
	
КонецФункции

// Возвращает форматную строку даты.
//
// Возвращаемое значение:
//  Строка – форматная строка даты.
//
Функция ФорматДатыВДиаграммеГанта()
	
	Возврат "ДФ=dd.MM.yy";
	
КонецФункции

// Компенсирует баг веб-клиента на платформе 8.3.9.1850 при отрисовке ДГ: 
// в разрешении 1080 обрезается одна последняя задача, в 780 и ниже - две.
// Добавляются дополнительные пустые строки в дерево.
//
// Параметры:
//  ДеревоДиаграммы 		- ДеревоЗначений - дерево исходных данных для построения диаграммы. 
//  КоличествоПустыхСтрок 	- Число - количество добавляемых пустых строк. 
//
Процедура АдаптироватьДеревоВебКлиент(ДеревоДиаграммы, КоличествоПустыхСтрок = 2)
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда	
		Для сч = 1 По КоличествоПустыхСтрок Цикл
			ДеревоДиаграммы.Строки.Добавить();
		КонецЦикла;			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти