////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с отображением управляемых форм.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет или изменяет функцию для события и сохраняет это соответствие в таблице-реквизите формы.
//
// Параметры:
//	ИмяСобытия 	- Строка - имя события, обработчик должен быть определелен в форме.
//	ИмяФункции	- Строка - имя функции-обработчика из модуля формы.
//	Форма	   	- Форма, УправляемаяФорма - сама форма.
//	ВНачало		- Булево - признак необходимости добавить строку с соответствием в начало таблицы.
//
Процедура ФункцииОтображения_Инициализация_ДобавитьСобытиюФункцию(ИмяСобытия,
																  ИмяФункции,
																  Форма,
																  ВНачало = Ложь) Экспорт
	Если ВНачало Тогда
		ФункцияСтраницы = Форма._ФункцииСобытий.Вставить(0);
	Иначе                                                      
		ФункцияСтраницы = Форма._ФункцииСобытий.Добавить();
	КонецЕсли;
	ФункцияСтраницы.ИмяСобытия = ИмяСобытия;
	ФункцияСтраницы.Функция = ИмяФункции;
	
КонецПроцедуры

// Добавляет или изменяет связку функция-обработчик - страница. 
// Функция должна быть вызвана при активизации определенной страницы, к которой привязана эта функция.
//
// Параметры:
//	ИмяСтраницы	- Строка - имя элемента управления-вкладки, которой нужно сопоставить функцию.
//	ИмяФункции	- Строка - имя функции-обработчика из модуля формы.
//	Форма	   	- Форма, УправляемаяФорма - сама форма.
//	ВНачало		- Булево - признак необходимости добавить строку с соответствием в начало таблицы.
//
Процедура ФункцииОтображения_Инициализация_ДобавитьСтраницеФункцию(ИмяСтраницы,
																   ИмяФункции,
																   Форма,
																   ВНачало = Ложь) Экспорт
	Если ВНачало Тогда
		ФункцияСтраницы = Форма._ФункцииСтраниц.Вставить(0);
	Иначе                                                      
		ФункцияСтраницы = Форма._ФункцииСтраниц.Добавить();
	КонецЕсли;
	ФункцияСтраницы.ИмяСтраницы = ИмяСтраницы;
	ФункцияСтраницы.Функция = ИмяФункции;
	
КонецПроцедуры

// Добавляет функции-обработчики события в пул на выполнение.
//
// Параметры:
//  ИмяСобытия	 - Строка - имя события, функции-обработчики которого надо добавить в пул на выполнение.
//  Форма		 - Форма, УправляемаяФорма - форма, в которой все происходит.
//
Процедура ФункцииОтображения_ДобавитьФункцииСобытияВПулНаВыполнение(ИмяСобытия, Форма) Экспорт
	
	ФункцииСобытия = ФункцииОтображения_ПолучитьФункцииСобытия(ИмяСобытия, Форма);
	Для Каждого ФункцияСобытия Из ФункцииСобытия Цикл
		Форма._ПулФункций.Добавить(ФункцияСобытия); 	
	КонецЦикла;
	
КонецПроцедуры 

// Удаляет функцию из пула функций формы на выполнение.
//
// Параметры:
//  ИмяФункции	 - Строка - имя функции.
//  Форма		 - Форма, УправляемаяФорма - форма, в которой происходит магия.
//
Процедура ФункцииОтображения_УдалитьФункциюИзПулаНаВыполнение(ИмяФункции, Форма) Экспорт
	ЭлементПула = Форма._ПулФункций.НайтиПоЗначению(ИмяФункции);
	Если ЭлементПула <> Неопределено Тогда
		Форма._ПулФункций.Удалить(ЭлементПула);
	КонецЕсли;
КонецПроцедуры 

// Инициирует выполнение функций обновления в зависимости от состава пула и открытых страниц.
//
// Параметры:
//  Форма	 - Форма, УправляемаяФорма - форма, для которой инициируется выполнение функций.
//
Процедура ФункцииОтображения_ВыполнитьФункцииОбновленияВЗависимостиОтПулаИОткрытыхСейчасСтраниц(Знач Форма) Экспорт
	
	МассивОткрытыхСтраниц = ФункцииОтображения_ПолучитьСписокОткрытыхСейчасСтраниц(Форма);
	
	МассивФункцийНаВыполнение = Новый Массив;
	Для Каждого ИмяОткрытойСтраницы Из МассивОткрытыхСтраниц Цикл
		ФункцииОтображения_ДополнитьМассивФункциямиСтраницы(ИмяОткрытойСтраницы, МассивФункцийНаВыполнение, Форма);
	КонецЦикла;

	Для Каждого ИмяВыполняемойФункции Из МассивФункцийНаВыполнение Цикл
		Если Форма._ПулФункций.НайтиПоЗначению(ИмяВыполняемойФункции) <> Неопределено Тогда
			ФункцииОтображения_ПодставитьПараметрыИВыполнить(ИмяВыполняемойФункции, Форма);	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры          

// Добавляет связь в между Знач1 и Знач2 в произвольную таблицу табл.
//
// Параметры:
//  табл	 - Массив - массив, куда надо добавить структуру связей Знач1-Знач2.
//  Знач1	 - Произвольный - значение связи 1.
//  Знач2	 - Произвольный - значение связи 2.
//
Процедура ФункцииОтображения_Инициализация_добавитьСвязь(табл, Знач1, Знач2) Экспорт
	СтруктураЗависимостей = Новый Структура("ЗависимаяФункция, Функция", Знач1, Знач2);
	табл.Добавить(СтруктураЗависимостей);
КонецПроцедуры

// Ищет для выполянемых функций связанные функции и добавляет их в коллекцию связанных с событиями функций.
//
// Параметры:
//  Форма	 - Форма, УправляемаяФорма - форма, для который выполняется действие.
//
Процедура ФункцииОтображения_Инициализация_ДополнитьЗависимыми(Форма) Экспорт
	
	Зависимости = ФункцииОтображения_Инициализация_ПолучитьЗависимостиФункций(Форма);
	ЗависимыеФункции = Новый Соответствие;	
	
	МассивСтраниц = ФункцииОтображения_ПолучитьМассивСтраниц(Форма);	
	
	Для каждого текСтраница Из МассивСтраниц Цикл
		Добавить = Новый Массив;
		
		МассивФункцийСтраницы = Новый Массив;
		ФункцииОтображения_ДополнитьМассивФункциямиСтраницы(текСтраница, МассивФункцийСтраницы, Форма);
		
		Для каждого текФункция Из МассивФункцийСтраницы Цикл
			ДобавитьПоТек = ФункцииОтображения_Инициализация_НайтиЗависимыеФункции(текФункция, Зависимости, ЗависимыеФункции,
				"Предыдущие", Форма);
			
			Для каждого элемент Из ДобавитьПоТек Цикл
			    Добавить.Добавить(элемент);
			КонецЦикла;
		КонецЦикла;
		
		колво = Добавить.Количество();
		Для сч = 1 По колво Цикл
			Если МассивФункцийСтраницы.Найти(Добавить[колво - сч]) = Неопределено Тогда
				МассивФункцийСтраницы.Вставить(0, Добавить[колво - сч]);
				ФункцииОтображения_Инициализация_ДобавитьСтраницеФункцию(текСтраница, Добавить[колво - сч], Форма, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	МассивСобытий = ФункцииОтображения_ПолучитьМассивСобытий(Форма);
	
	Для каждого текСобытие Из МассивСобытий Цикл
		Добавить = Новый Массив;
		
		МассивФункцийСобытия = ФункцииОтображения_ПолучитьФункцииСобытия(текСобытие, Форма);
		
		Для каждого текФункция Из МассивФункцийСобытия Цикл
			ДобавитьПоТек = ФункцииОтображения_Инициализация_НайтиЗависимыеФункции(текФункция, Зависимости, ЗависимыеФункции,
				"Следующие", Форма);
			
			Для каждого элемент Из ДобавитьПоТек Цикл
			    Добавить.Добавить(элемент);
			КонецЦикла;
		КонецЦикла;
		
		колво = Добавить.Количество();
		Для сч = 1 По колво Цикл
			Если МассивФункцийСобытия.Найти(Добавить[колво - сч]) = Неопределено Тогда
				МассивФункцийСобытия.Вставить(0, Добавить[колво - сч]);
				ФункцииОтображения_Инициализация_ДобавитьСобытиюФункцию(текСобытие, Добавить[колво - сч], Форма, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ФункцииОтображения_ПодставитьПараметрыИВыполнить(ИмяВыполняемойФункции, Форма)
	
#Если Сервер Или ТолстыйКлиент Тогда
	ПараметрыФункции = ФункцииОтображения_ПолучитьПараметрыФункции(ИмяВыполняемойФункции, Форма);
	Форма.ВыполнитьКод(ИмяВыполняемойФункции + ПараметрыФункции + ";");
#Иначе
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Метод не предназначен для вызова на клиенте.'"))
#КонецЕсли

КонецПроцедуры

Функция ФункцииОтображения_Инициализация_ПолучитьЗависимостиФункций(Форма)
	
	Зависимости = Новый Массив;

	Форма.ФункцииОтображения_ДобавитьСвязиФункций(Зависимости);
	
	ЗависимостиФункций = Новый Соответствие; // Соответствие, которое для ключа(функции) определяет функции, 
						 					 // которые необходимо выполнить перед запуском функции ключа
						  
	Для каждого связь Из Зависимости Цикл
	    следующие = ЗависимостиФункций[связь.ЗависимаяФункция];
		предыдущие = ЗависимостиФункций[связь.Функция];
		
		Если следующие = Неопределено Тогда
			следующие = Новый Структура("Следующие, Предыдущие", Новый Массив, Новый Массив);
		КонецЕсли;
		Если предыдущие = Неопределено Тогда
			предыдущие = Новый Структура("Следующие, Предыдущие", Новый Массив, Новый Массив);
		КонецЕсли;
		
		следующие.Следующие.Добавить(связь.Функция);
		предыдущие.Предыдущие.Добавить(связь.ЗависимаяФункция);
		
		ЗависимостиФункций.Вставить(связь.ЗависимаяФункция, следующие);
		ЗависимостиФункций.Вставить(связь.Функция, предыдущие);
	КонецЦикла;					  
						  
	Возврат ЗависимостиФункций;
	
КонецФункции 

Функция ФункцииОтображения_Инициализация_НайтиЗависимыеФункции(текФункция,
															   Зависимости,
															   ЗависимыеФункции,
															   Направление,
															   Форма)
	массивНазад = Новый Массив;
	
	зависимые = Зависимости[текФункция];
	Если НЕ зависимые = Неопределено Тогда
		Для каждого зависимаяФунк Из зависимые[Направление] Цикл
			массивОтвет = ЗависимыеФункции[зависимаяФунк];
			Если массивОтвет = Неопределено Тогда
				массивОтвет = ФункцииОтображения_Инициализация_НайтиЗависимыеФункции(
					зависимаяФунк, Зависимости, ЗависимыеФункции, Направление, Форма);
			КонецЕсли;
			
			Для каждого элемент Из массивОтвет Цикл
				Если массивНазад.Найти(элемент) = Неопределено Тогда
					массивНазад.Добавить(элемент);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для каждого зависимаяФунк Из зависимые[Направление] Цикл
			Если массивНазад.Найти(зависимаяФунк) = Неопределено Тогда
				массивНазад.Добавить(зависимаяФунк);
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
	ЗависимыеФункции.Вставить(текФункция, массивНазад);
	
	Возврат массивНазад;
	
КонецФункции 

// Возвращает массив открытых страниц формы.
//
// Параметры:
//  Форма	 - Форма, УправляемаяФорма - форма, для который выполняется действие.
//
Функция ФункцииОтображения_ПолучитьСписокОткрытыхСейчасСтраниц(Форма) Экспорт
	
	КорневаяПанель = Форма.Элементы.СтраницыОсновное;
	МассивЭлементов	= Новый Массив;
	ФункцииОтображения_служебные_ДополнитьМассивОткрытымиСтраницами(КорневаяПанель, МассивЭлементов, Форма);	
	
	Возврат МассивЭлементов;
	
КонецФункции          
                                   
Функция ФункцииОтображения_служебные_ДополнитьМассивОткрытымиСтраницами(КорневойЭлемент, МассивЭлементов, Форма)
	
	Если КорневойЭлемент.Вид = ВидГруппыФормы.Страницы Тогда
		ТекСтраница = КорневойЭлемент.ТекущаяСтраница;
		МассивЭлементов.Добавить(ТекСтраница.Имя);
		ЭлементДляПросмотра = ТекСтраница;
	Иначе
		ЭлементДляПросмотра = КорневойЭлемент;
	КонецЕсли;
	
	Для Каждого ПодчиненныйЭлемент Из ЭлементДляПросмотра.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			ФункцииОтображения_служебные_ДополнитьМассивОткрытымиСтраницами(ПодчиненныйЭлемент, МассивЭлементов, Форма);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ФункцииОтображения_ДополнитьМассивФункциямиСтраницы(ИмяСтраницы, МассивФункций, Форма)
	
	НайденныеСтроки = Форма._ФункцииСтраниц.НайтиСтроки(Новый Структура("ИмяСтраницы", ИмяСтраницы));
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивФункций.Добавить(НайденнаяСтрока.Функция);	
	КонецЦикла;
	
КонецФункции          

Функция ФункцииОтображения_ПолучитьФункцииСобытия(ИмяСобытия, Форма)
	
	МассивФункций = Новый Массив;
	
	НайденныеСтроки = Форма._ФункцииСобытий.НайтиСтроки(Новый Структура("ИмяСобытия", ИмяСобытия));
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивФункций.Добавить(НайденнаяСтрока.Функция);	
	КонецЦикла;
	
	Возврат МассивФункций;
	
КонецФункции    

Функция ФункцииОтображения_ПолучитьПараметрыФункции(ИмяФункции, Форма)
	
	Параметры = "(";
	
	НайденныеСтроки = Форма._ПараметрыФункций.НайтиСтроки(Новый Структура("ИмяФункции", ИмяФункции));
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Параметры = Параметры + НайденнаяСтрока.ПараметрыЧерезЗапятую; 	
		Прервать;
	КонецЦикла;
	
	Возврат ?(Параметры = "(", "()", Параметры+")");
	
КонецФункции 

Функция ФункцииОтображения_ПолучитьМассивСобытий(Форма)
	
	врТ = Форма._ФункцииСобытий.Выгрузить();
	врТ.Свернуть("ИмяСобытия");
	
	Возврат врТ.ВыгрузитьКолонку("ИмяСобытия");
	
КонецФункции 

Функция ФункцииОтображения_ПолучитьМассивСтраниц(Форма)
	
	врТ = Форма._ФункцииСтраниц.Выгрузить();
	врТ.Свернуть("ИмяСтраницы");
	
	Возврат врТ.ВыгрузитьКолонку("ИмяСтраницы");
	
КонецФункции 

#КонецОбласти