////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с ДДС.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Не используется. Рассчитывает задержку в указанное количество дней по рабочему календарю.
//
// Параметры:
//  ДатаНач			 - Дата														 - дата начала отчета.
//  КоличествоДней	 - Число													 - задержка в днях.
//  Календарь		 - СправочникСсылка.упоРабочиеКалендари, СправочникСсылка.Проекты	 - календарь, по которому
//  	производится расчет или проект, для которого делается расчет.
// 
// Возвращаемое значение:
//  Дата - дата с учетом задержки.
//
Функция обРассчитатьЗадержкуПоКалендарюМедленная(ДатаНач, КоличествоДней, Календарь) Экспорт

	Если КоличествоДней = 0 Тогда
		Возврат ДатаНач;	
	КонецЕсли; 
	
	Если ТипЗнч(Календарь) = Тип("СправочникСсылка.Проекты") Тогда
		КалендарьРасчета = упоПроектыИЗадачиВызовСервера.обПолучитьБанковскийКалендарьПроекта(Календарь);
	Иначе
		КалендарьРасчета = Календарь;
	КонецЕсли; 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	РегКалендарь.День КАК РабочийДень
		|ИЗ
		|	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
		|		,
		|		Календарь = &Календарь
		|		    И День <> &ДатаНач) КАК РегКалендарь
		|ГДЕ
		|	РегКалендарь.КоличествоЧасов > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочийДень";
	
	КоличествоЗаписей = Формат(?(КоличествоДней < 0, - КоличествоДней, КоличествоДней), "ЧРГ=.");
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + СтрЗаменить(КоличествоЗаписей, ".", ""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<> &ДатаНач", ?(КоличествоДней < 0, "< &ДатаНач", "> &ДатаНач"));
	ТекстЗапроса = ТекстЗапроса + ?(КоличествоДней < 0, " Убыв", "");
	
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, 
		Новый Структура("Календарь,ДатаНач", КалендарьРасчета, ДатаНач));
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	Если НЕ ТаблицаЗапроса.Количество() = ?(КоличествоДней < 0, -КоличествоДней, КоличествоДней) Тогда
		Возврат Неопределено; // В календаре не хватило дат для отсчета задержки.
	КонецЕсли; 
	
	СтрокаДанных = ТаблицаЗапроса[ТаблицаЗапроса.Количество() - 1];
	
	Возврат СтрокаДанных.РабочийДень;
	
КонецФункции

// Возвращает актуальные данные для расчета плана БДДС проекта/задачи
//
// Параметры:
//  ВхПараметр	 - СправочникСсылка.Проекты, ДокументСсылка.упоПроектнаяЗадача, Массив	 - данные для расчета.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - подготовленные данные плана ДДС.
//
Функция обПолучитьДанныеПланаДДС(ВхПараметр) Экспорт
	
	СписокЗадач = Новый Массив();
	
 	Если ТипЗнч(ВхПараметр) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда      
		СписокЗадач.Добавить(ВхПараметр);
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("СправочникСсылка.Проекты") Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РегЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
			|ИЗ
			|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК РегЗадачи
			|ГДЕ
			|	НЕ РегЗадачи.ЗадачаОтменена";
		
		запрос = Новый Запрос(ТекстЗапроса);
		запрос.УстановитьПараметр("Версия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ВхПараметр));
		РезультатЗапроса = запрос.Выполнить();
		
		СписокЗадач = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("СписокЗначений") Тогда
		СписокЗадач = ВхПараметр.ВыгрузитьЗначения();
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("Массив") Тогда
		СписокЗадач = ВхПараметр;
	Иначе
		Возврат Неопределено; // некорректные входные данные
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегДДС.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	РегДДС.СтатьяДДС КАК СтатьяДДС,
	               |	РегДДС.НаправлениеДвижения КАК НаправлениеДвижения,
	               |	РегДДС.ВидПлатежа КАК ВидПлатежа,
	               |	РегДДС.Контрагент КАК Контрагент,
	               |	РегДДС.Договор КАК Договор,
	               |	РегДДС.СпособПривязки КАК СпособПривязки,
	               |	РегДДС.Задержка КАК Задержка,
	               |	РегДДС.ДатаПривязки КАК ДатаПривязки,
	               |	РегДДС.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	РегДДС.Валюта КАК Валюта,
	               |	РегДДС.Сумма КАК Сумма,
	               |	РегДДС.СуммаВалютная КАК СуммаВалютная,
	               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДДС.ДДС) КАК ИсточникПлана
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановДвиженияДенежныхСредств.СрезПоследних(, ПроектнаяЗадача В (&СписокЗадач)) КАК РегДДС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
	               |		ПО РегДДС.Версия = Версии.Версия
	               |			И (Версии.Текущая)
	               |ГДЕ
	               |	(РегДДС.Сумма <> 0
	               |			ИЛИ РегДДС.СуммаВалютная <> 0)";
	
	запрос = Новый Запрос(ТекстЗапроса);
	запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	
	Возврат запрос.Выполнить().Выгрузить();
 
КонецФункции

// Рассчитывает задержку по календарю от даты.
//
// Параметры:
//  ДатаНач					 - Дата						 - дата начала, от которой считается задержка.
//  КоличествоДней			 - Число					 - количество дней задержки.
//  пКалендарь				 - СправочникСсылка.упоРабочиеКалендари	 - календарь, на основании которого считается задержка.
//  таблицаКалендаря		 - ТаблицаЗначений						 - талица календаря.
//  таблицаКалендаряПолные	 - ТаблицаЗначений						 - талица календаря.
//  ВыводитьСообщения		 - Булево								 - признак необходимости вывода служебных сообщений.
// 
// Возвращаемое значение:
//  Дата, Неопределено - дата, рассчитанная как дата начала плюс количество дней с учетом календаря.
//
Функция обРассчитатьЗадержкуПоКалендарю(ДатаНач,
										КоличествоДней, 
										пКалендарь, 
										таблицаКалендаря = Неопределено, 
										таблицаКалендаряПолные = Неопределено, 
										ВыводитьСообщения = Ложь) Экспорт 
										
	Если НЕ ЗначениеЗаполнено(ДатаНач) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(пКалендарь) = Тип("СправочникСсылка.Проекты") Тогда      
		Календарь = упоПроектыИЗадачиВызовСервера.обПолучитьБанковскийКалендарьПроекта(пКалендарь);
	Иначе
		Календарь = пКалендарь;
	КонецЕсли; 
	
	строкадня = упоУправлениеФормамиСервер.НайтиСтрокуДня(ДатаНач, КоличествоДней, Календарь, таблицаКалендаря, таблицаКалендаряПолные);
	Если строкадня = Неопределено Тогда
		
		Если НЕ упоУправлениеФормамиСервер.УвеличитьКалендарь(ДатаНач, Календарь, таблицаКалендаря, таблицаКалендаряПолные) Тогда
			Если ВыводитьСообщения Тогда
				НСтрока = НСтр("ru = 'Нет календаря на дату: %1 по календарю %2'");
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ДатаНач, Календарь);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Возврат Неопределено;
		КонецЕсли;
		
		строкадня = упоУправлениеФормамиСервер.НайтиСтрокуДня(ДатаНач, КоличествоДней, Календарь, таблицаКалендаря, таблицаКалендаряПолные);
		Если строкадня = Неопределено Тогда
			Если ВыводитьСообщения Тогда
				НСтрока = НСтр("ru = 'Нет календаря на дату: %1 по календарю %2'");
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ДатаНач, Календарь);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	индексСтроки = таблицаКалендаря.Индекс(строкадня);
	НовыйИндекс = индексСтроки + КоличествоДней;
	максИндекс = таблицаКалендаря.Количество() - 1;
	
	множитель = 1;
	Если НовыйИндекс < 0 Тогда
		Пока НовыйИндекс < 0 Цикл
			увеличиваемаяДата = ДобавитьМесяц(строкадня.День, -12 * множитель);
			Если НЕ упоУправлениеФормамиСервер.УвеличитьКалендарь(увеличиваемаяДата , Календарь, таблицаКалендаря, таблицаКалендаряПолные) Тогда
				Если ВыводитьСообщения Тогда
					НСтрока = НСтр("ru = 'Нет календаря на дату: %1 по календарю %2'");
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, увеличиваемаяДата, Календарь);
					Сообщение.Сообщить();
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
		
			индексСтроки = таблицаКалендаря.Индекс(строкадня);
			НовыйИндекс = индексСтроки + КоличествоДней;
			максИндекс = таблицаКалендаря.Количество() - 1;
			
			множитель = множитель + 1;
		КонецЦикла;
		
	ИначеЕсли НовыйИндекс > максИндекс Тогда
		
		Пока НовыйИндекс > максИндекс Цикл
			увеличиваемаяДата = ДобавитьМесяц(строкадня.День, 12 * множитель);
			Если НЕ упоУправлениеФормамиСервер.УвеличитьКалендарь(увеличиваемаяДата, Календарь, таблицаКалендаря, таблицаКалендаряПолные) Тогда
				Если ВыводитьСообщения Тогда
					НСтрока = НСтр("ru = 'Нет календаря на дату: %1 по календарю %2'");
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, увеличиваемаяДата, Календарь);
					Сообщение.Сообщить();
				КонецЕсли;
				Возврат Неопределено;
			КонецЕсли;
			
			индексСтроки = таблицаКалендаря.Индекс(строкадня);
			НовыйИндекс = индексСтроки + КоличествоДней;
			максИндекс = таблицаКалендаря.Количество() - 1;
			
			множитель = множитель + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат таблицаКалендаря[НовыйИндекс].День;
	
КонецФункции

#КонецОбласти