#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты-настройки статьи затрат для отражения в БДР.
//
// Параметры:
//  СтатьяЗатрат - СправочникСсылка.упоСтатьиЗатрат	- статья затрат.
//  Реквизиты	 - Структура, Строка - реквизиты, значения которых получаем на выходе.
// 
// Возвращаемое значение:
//   Структура - значения реквизитов статьи затрат. 
//
Функция НастройкиОтраженияСтатьиВБДР(СтатьяЗатрат, Реквизиты = Неопределено) Экспорт
	
	Если Реквизиты = Неопределено Тогда
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("ПрофильРаспределения", "ПрофильРаспределенияРасходовЗатраты");
		Реквизиты.Вставить("Контрагент", "КонтрагентРасходовЗатраты");
		Реквизиты.Вставить("Договор", "ДоговорРасходовЗатраты");
	КонецЕсли;			
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяЗатрат, Реквизиты);
	
КонецФункции	

// Возвращает значения реквизитов статьи затрат (Способ привязки, Профиль распределения)
//  для использования в связанных объектах.
//
// Параметры:
//  СтатьяЗатрат - СправочникСсылка.упоСтатьиЗатрат
// 
// Возвращаемое значение:
//  Структура - значения реквизитов для заполнения в проектной задаче и других объектах.
//
Функция ЗначенияПоУмолчаниюДляСтатьиЗатрат(СтатьяЗатрат) Экспорт

	Данные = Новый Структура;
	Данные.Вставить("СпособПривязки", "СпособПривязкиРасходовПоУмолчанию");
	Данные.Вставить("ПрофильРаспределения", "ПрофильРаспределенияПоУмолчанию");
	
	ДанныеПоСтатье = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяЗатрат, Данные);
	
	// Переопределение для того, чтобы пустые значения не заменяли значения для проекта по умолчанию.
	Если ЗначениеЗаполнено(ДанныеПоСтатье.СпособПривязки) Тогда
		Возврат ДанныеПоСтатье;
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоСтатьиЗатрат);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли
