
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов объекта.
// Для группы формируется только структура реквизитов шапки,
// для элемента формируется структура реквизитов шапки или табличной части.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ЭтотОбъект.ЭтоГруппа Тогда // для группы
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки
			СтруктураОбязательныхПолей.Вставить("Наименование");
		КонецЕсли;
	Иначе // для элемента
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки
			СтруктураОбязательныхПолей.Вставить("Наименование");
			
			Если СпособПривязкиРасходовТрудозатраты = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения Тогда
				СтруктураОбязательныхПолей.Вставить("ПрофильРаспределенияРасходовТрудозатраты");	
			ИначеЕсли СпособПривязкиРасходовТрудозатраты = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно Тогда 	
				СтруктураОбязательныхПолей.Вставить("ПериодАгрегацииРасходовТрудозатраты");	
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Тип: Булево. Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	Возврат Новый Структура();	
КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры
		
#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоКода модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации кода.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры // ПриУстановкеНовогоКода()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ОбъектКопирования – СправочникОбъект, исходный элемент, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
КонецПроцедуры // ПриКопировании()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

    ПроверитьЗаполнениеСпособовРаспределенияРасходов(Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда 
		Возврат;
	КонецЕсли; 
	
	Если Не ЭтоГруппа И упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		СпособыРаспределенияРасходовПоПроектамРегл = ПредопределенноеЗначение("Справочник.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП");
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи элемента.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		Если СпособПривязкиРасходовТрудозатраты <> Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения Тогда
			ПрофильРаспределенияРасходовТрудозатраты = Неопределено;				
		КонецЕсли;	
		Если СпособПривязкиРасходовТрудозатраты <> Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно Тогда
			ПериодАгрегацииРасходовТрудозатраты = Неопределено;	
		КонецЕсли;
	КонецЕсли; 	
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ);
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ);
КонецПроцедуры // ПередУдалением()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеСпособовРаспределенияРасходов(Отказ, ПроверяемыеРеквизиты)
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаФормироватьНЗП 	= ПредопределенноеЗначение("Справочник.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП");
	ЭтоФормироватьНЗП 		= СпособыРаспределенияРасходовПоПроектам = СсылкаФормироватьНЗП;
	ЭтоФормироватьНЗПРегл 	= СпособыРаспределенияРасходовПоПроектамРегл = СсылкаФормироватьНЗП;
	
	СтатьяРасходовERP = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(Ссылка);
	
	Если ЗначениеЗаполнено(СтатьяРасходовERP) Тогда
		
		ИспользоватьСчетУчета = упоИнтеграцияКлиентСервер.ЕстьРеквизитСчетУчетаВСтатьеРасходов();
		
		мРеквизитыСтатьи = Новый Массив;
		мРеквизитыСтатьи.Добавить("ВариантРаспределенияРасходовРегл");
		мРеквизитыСтатьи.Добавить("ВариантРаспределенияРасходовУпр");
		Если ИспользоватьСчетУчета Тогда
			// Не удалять. Используется для подключаемого модуля Распределение ЗП.
			мРеквизитыСтатьи.Добавить("СчетУчета"); 
		КонецЕсли;
		РеквизитыСтатьиКакСтрока = СтрСоединить(мРеквизитыСтатьи, ",");
		
		ВариантыРаспределенияНеРаспределять = 
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ВариантыРаспределенияРасходов.НеРаспределять");
		Реквизиты__СтатьяРасходовERP = 
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяРасходовERP, РеквизитыСтатьиКакСтрока);
		РаспределятьВручнуюРегл = 
			Реквизиты__СтатьяРасходовERP["ВариантРаспределенияРасходовРегл"] = ВариантыРаспределенияНеРаспределять;
		РаспределятьВручнуюУпр = 
			Реквизиты__СтатьяРасходовERP["ВариантРаспределенияРасходовУпр"] = ВариантыРаспределенияНеРаспределять;
		Если ИспользоватьСчетУчета Тогда
			// Не удалять. Используется для подключаемого модуля Распределение ЗП.
			СчетУчета = Реквизиты__СтатьяРасходовERP["СчетУчета"];
		КонецЕсли;
		
	Иначе
		РаспределятьВручнуюРегл = Ложь;
		РаспределятьВручнуюУпр = Ложь;
	КонецЕсли;
	
	Если РаспределятьВручнуюРегл Тогда
		ПроверяемыеРеквизиты.Добавить("СпособыРаспределенияРасходовПоПроектамРегл");
		
		Если НЕ ЭтоФормироватьНЗПРегл Тогда
			ПроверяемыеРеквизиты.Добавить("СтатьяРаспределенияРасходовРегл");
		КонецЕсли;
	КонецЕсли;
	
	Если РаспределятьВручнуюУпр Тогда
		ПроверяемыеРеквизиты.Добавить("СпособыРаспределенияРасходовПоПроектам");
		
		Если НЕ ЭтоФормироватьНЗП Тогда
			ПроверяемыеРеквизиты.Добавить("СтатьяРаспределенияРасходов");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли