
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает найденный по идентификатору или созданный по параметрам источник данных.
//
// Параметры:
//  Идентификатор	 - Строка - идентификатор источника данных. 
//  Подключение		 - Строка - строка подключения. 
//  Наименование	 - Строка - наименование.
//  Создать			 - Булево - признак необходимости создать новый источник данных, если он не найден.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоИсточникиДанных - источник данных.
//
Функция ИсточникДанныхПоИдентификатору(Идентификатор, Подключение, Наименование, Создать = Истина) Экспорт
	
	Источник = Справочники.упоИсточникиДанных.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	упоИсточникиДанных.Ссылка КАК Источник
	               |ИЗ
	               |	Справочник.упоИсточникиДанных КАК упоИсточникиДанных
	               |ГДЕ
	               |	упоИсточникиДанных.Идентификатор = &Идентификатор
	               |	И НЕ упоИсточникиДанных.ПометкаУдаления";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Источник = Выборка.Источник;
	Иначе
		Если Создать Тогда
			НовыйИсточник = Справочники.упоИсточникиДанных.СоздатьЭлемент();
			НовыйИсточник.Наименование = Наименование;
			НовыйИсточник.Идентификатор = Идентификатор;
			НовыйИсточник.Подключение = Подключение;
			
			Если Не ЗначениеЗаполнено(НовыйИсточник.Наименование) Тогда
				НовыйИсточник.Наименование = НовыйИсточник.Подключение;		
			КонецЕсли; 
			
			НовыйИсточник.Записать();
			
			Источник = НовыйИсточник.Ссылка;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Источник;
		
КонецФункции

#КонецОбласти

#КонецЕсли