
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сворачивает табличные части по ключевым реквизитам и
// рассчитывает итоговые показатели трудозатрат по разделам.
//
Процедура СвернутьТабличныеЧасти() Экспорт
	
	// Сворачиваем табличные части во избежание дублирования
	// записей регистра сведений по одному набору измерений.
	
	СтрокаСуммирования = "Понедельник,Вторник,Среда,Четверг,Пятница,Суббота,Воскресенье,ИтогоПоСтроке";
	
	РабочиеЗадания.Свернуть("РабочееЗадание,Проект,ЭтоПроектнаяЗадача,РольРесурса,Подразделение,Задание", СтрокаСуммирования);
	ВнепроектныеЗадачи.Свернуть("Задача,Роль,Подразделение", СтрокаСуммирования);
	ПотериВремени.Свернуть("Причина", СтрокаСуммирования);
	
	// Рассчитываем итоговые трудозатраты по разделам.
	
	ИтогоРабочиеЗадания = РабочиеЗадания.Итог("ИтогоПоСтроке");
	ИтогоВнепроектныеЗадачи = ВнепроектныеЗадачи.Итог("ИтогоПоСтроке");
	ИтогоПотериВремени = ПотериВремени.Итог("ИтогоПоСтроке");
	
	ИтогоЧасов = ИтогоРабочиеЗадания + ИтогоВнепроектныеЗадачи + ИтогоПотериВремени;	

КонецПроцедуры

// Формирует итоговую таблицу по дням и разделам учета.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - сформированная итоговая таблица.
//
Функция ПолучитьИтоговуюТаблицу() Экспорт

	ТаблицаДанных = ВнепроектныеЗадачи.Выгрузить();
	ТаблицаДанных.Очистить();
	ТаблицаДанных.Колонки.Удалить("Задача");
	ТаблицаДанных.Колонки.Удалить("НомерСтроки");
	ТаблицаДанных.Колонки.Добавить("РазделУчета", Новый ОписаниеТипов("ПеречислениеСсылка.упоРазделУчетаРабочегоВремени"));
	
	// Перекачиваем данные из табличных частей по дням.
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача;
	
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл		
		Если Не Колонка.Имя = "РазделУчета" Тогда
			НоваяСтрока[Колонка.Имя] = ВнепроектныеЗадачи.Итог(Колонка.Имя);
		КонецЕсли; 		
	КонецЦикла; 
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
	
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл		
		Если Не Колонка.Имя = "РазделУчета" Тогда
			НоваяСтрока[Колонка.Имя] = РабочиеЗадания.Итог(Колонка.Имя);
		КонецЕсли; 		
	КонецЦикла; 
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени;
	
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл		
		Если Не Колонка.Имя = "РазделУчета" Тогда
			НоваяСтрока[Колонка.Имя] = ПотериВремени.Итог(Колонка.Имя);
		КонецЕсли; 		
	КонецЦикла; 
	
	Возврат ТаблицаДанных;

КонецФункции

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		СтруктураОбязательныхПолей.Вставить("ТрудовойРесурс");
		СтруктураОбязательныхПолей.Вставить("ДеньНачалаНедели");
	ИначеЕсли ИмяТабличнойЧасти = "РабочиеЗадания" Тогда		
		СтруктураОбязательныхПолей.Вставить("Проект");
		СтруктураОбязательныхПолей.Вставить("РабочееЗадание");
		СтруктураОбязательныхПолей.Вставить("РольРесурса");
	ИначеЕсли ИмяТабличнойЧасти = "ВнепроектныеЗадачи" Тогда		
		СтруктураОбязательныхПолей.Вставить("Задача");
	ИначеЕсли ИмяТабличнойЧасти = "ПотериВремени" Тогда		
		СтруктураОбязательныхПолей.Вставить("Причина");
	КонецЕсли;
	                                        
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры: 
//  ДанныеДокумента - Структура - содержит слепок документа.
//  Отказ           - Булево - Признак отказа от выполнения операции.
//  Заголовок       - Строка - Содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Контроль ввода данных за два периода (месяца).
//
// Параметры:
//	Отказ - Булево - признак отмены транзакции.
//
Процедура ВведеныДанныеЗаДваПериода(Отказ = Ложь) Экспорт

	Если НЕ Константы.упоРегистрироватьТрудозатратыПереходящейНеделиДвумяДокументами.Получить() 
		ИЛИ ПараметрыСеанса.упоОтключитьПроверкуОграничений Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МесяцНачала = Месяц(ДеньНачалаНедели);
	МесяцКонец  = Месяц(ДеньКонецНедели);
	
	Если МесяцНачала = МесяцКонец Тогда
		// Ничего проверять не надо.
		Возврат;
	КонецЕсли;
	
	ТаблицаДней = ПолучитьТаблицуДней();
	
	РассчитатьТрудозатратыНаКаждыйДень(ТаблицаДней);
	
	РезультатСравненияПериодов = ПроверитьНаличиеДанныхВДвухПериодах(ТаблицаДней, МесяцКонец, МесяцНачала);
	
	Если РезультатСравненияПериодов.ДанныеЗаДваПериода Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'В документе допускается ввод данных только за дни одного месяца.'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки для заданной табличной части документа.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для этого документа реализовано ручное управление движениями.
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактТрудозатратСводно.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактТрудозатратПоДням.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоИспользованиеРабочегоВремени.Метаданные().Имя, Правила);
	
	Возврат ПравилаНаложения; 

КонецФункции

// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	ТаблицаДней = Новый ТаблицаЗначений();
	ТаблицаДней.Колонки.Добавить("ИмяДня");
	ТаблицаДней.Колонки.Добавить("Смещение");
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Понедельник";
	СтрокаДня.Смещение = 0;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Вторник";
	СтрокаДня.Смещение = 1;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Среда";
	СтрокаДня.Смещение = 2;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Четверг";
	СтрокаДня.Смещение = 3;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Пятница";
	СтрокаДня.Смещение = 4;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Суббота";
	СтрокаДня.Смещение = 5;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Воскресенье";
	СтрокаДня.Смещение = 6;
	
	// Вначале формируем движения по табличным частям, данные которых
	// не связаны с проектами.
	
	Для Каждого СтрокаДанных Из ДанныеДокумента.ВнепроектныеЗадачи Цикл		
		
		Для Каждого СтрокаДень Из ТаблицаДней Цикл
			
			ТрудозатратыДня = СтрокаДанных[СтрокаДень.ИмяДня];
			РабочийДень = НачалоДня(ДанныеДокумента.ДеньНачалаНедели) + 86400 * СтрокаДень.Смещение;
			
			Если ТрудозатратыДня = 0 Тогда
				Продолжить;
			КонецЕсли;			
			
			Если ДанныеДокумента.ИспользоватьРасшифровкуТрудозатрат Тогда 
				ОтборПоискРасшифровок = Новый Структура();
				ОтборПоискРасшифровок.Вставить("Задача", СтрокаДанных.Задача);
				ОтборПоискРасшифровок.Вставить("ДеньНедели", СтрокаДень.ИмяДня);
				
				СтрокиРасшифровки = ДанныеДокумента.РасшифровкаТрудозатрат.НайтиСтроки(ОтборПоискРасшифровок);
				
				// По проектнойЗадаче нет расшифровок.
				Если СтрокиРасшифровки.Количество() = 0 Тогда 
					ПроведениеБезРасшифровки = Истина;
				Иначе 
					СуммаЗаДеньПоВсемРасшифровкам = 0;
					Для Каждого ЭлементРасшифровки Из СтрокиРасшифровки Цикл
						Если ЭлементРасшифровки.ДеньНедели = СтрокаДень.ИмяДня Тогда
							СуммаЗаДеньПоВсемРасшифровкам = СуммаЗаДеньПоВсемРасшифровкам + ЭлементРасшифровки.ИтогоПоСтроке;
						КонецЕсли;
					КонецЦикла;
					Если СуммаЗаДеньПоВсемРасшифровкам > 0 Тогда 
						ПроведениеБезРасшифровки = Ложь;
					Иначе	                           
						ПроведениеБезРасшифровки = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ВидОперацииПроектнойЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.Задача, "ВидОперации");
			Если ЗначениеЗаполнено(ВидОперацииПроектнойЗадачи) Тогда
				ВидОперации = ВидОперацииПроектнойЗадачи;
			Иначе
				ВидОперации = Справочники.упоВидыОпераций.Явка;
			КонецЕсли; 
			
			Подразделение = ?(ЗначениеЗаполнено(СтрокаДанных.Подразделение), СтрокаДанных.Подразделение, ДанныеДокумента.Подразделение);
			
			Если Не ДанныеДокумента.ИспользоватьРасшифровкуТрудозатрат Тогда
				
				Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
				Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
				Движение.Подразделение = Подразделение;
				Движение.ВидОперации = ВидОперации;				
				Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача;
				Движение.ЗадачаПричина = СтрокаДанных.Задача;
				Если ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда
					Движение.Задание = СтрокаДанных.Задача;	
					Движение.РольРесурса = СтрокаДанных.Роль;
				КонецЕсли;
				Движение.День = РабочийДень;
				Движение.РасшифровкаТрудозатрат = "БезРасшифровки";
				Движение.Трудозатраты = ТрудозатратыДня;	
				
			Иначе
				
				Если ПроведениеБезРасшифровки Тогда  
					
					Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
					Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
					Движение.Подразделение = Подразделение;
					Движение.ВидОперации = ВидОперации;
					Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача;
					Движение.ЗадачаПричина = СтрокаДанных.Задача;
					Если ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда
						Движение.Задание = СтрокаДанных.Задача;	
						Движение.РольРесурса = СтрокаДанных.Роль;	
					КонецЕсли;
					Движение.День = РабочийДень;
					Движение.РасшифровкаТрудозатрат = "БезРасшифровки";
					Движение.Трудозатраты = ТрудозатратыДня;	
					
				Иначе 
					
					Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
						
						Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
						Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
						Движение.Подразделение = Подразделение;
						Движение.ВидОперации = СтрокаРасшифровки.ВидОперации;
						Движение.РольРесурса = ?(ЗначениеЗаполнено(СтрокаРасшифровки.РольРесурса), СтрокаРасшифровки.РольРесурса,
							СтрокаДанных.Роль);
						Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача;
						Движение.ЗадачаПричина = СтрокаРасшифровки.Задача;
						Если ТипЗнч(СтрокаДанных.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда
							Движение.Задание = СтрокаДанных.Задача;	
						КонецЕсли;
						Движение.РасшифровкаТрудозатрат = СтрокаРасшифровки.Расшифровка;
						Движение.День = РабочийДень;
						Движение.Трудозатраты = СтрокаРасшифровки.ИтогоПоСтроке;	
						
					КонецЦикла;  
					
				КонецЕсли; 			
			КонецЕсли; 			
			
		КонецЦикла; 				
	КонецЦикла; 
	
	// Потеря времени.
	
	Для Каждого СтрокаДанных Из ДанныеДокумента.ПотериВремени Цикл		
		
		Для Каждого СтрокаДень Из ТаблицаДней Цикл
			
			ТрудозатратыДня = СтрокаДанных[СтрокаДень.ИмяДня];
			РабочийДень = НачалоДня(ДанныеДокумента.ДеньНачалаНедели) + 86400 * СтрокаДень.Смещение;
			
			Если ТрудозатратыДня = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ДанныеДокумента.ИспользоватьРасшифровкуТрудозатрат Тогда 
				
				ОтборПоискРасшифровок = Новый Структура();
				ОтборПоискРасшифровок.Вставить("Причина", СтрокаДанных.Причина);
				ОтборПоискРасшифровок.Вставить("ДеньНедели", СтрокаДень.ИмяДня);
				
				СтрокиРасшифровки = ДанныеДокумента.РасшифровкаТрудозатрат.НайтиСтроки(ОтборПоискРасшифровок);
				
				// По проектнойЗадаче нет расшифровок.
				Если СтрокиРасшифровки.Количество() = 0  Тогда 
					ПроведениеБезРасшифровки = Истина;
				Иначе 
					СуммаЗаДеньПоВсемРасшифровкам = 0;
					Для Каждого ЭлементРасшифровки Из СтрокиРасшифровки Цикл
						Если ЭлементРасшифровки.ДеньНедели = СтрокаДень.ИмяДня Тогда
							СуммаЗаДеньПоВсемРасшифровкам = СуммаЗаДеньПоВсемРасшифровкам + ЭлементРасшифровки.ИтогоПоСтроке;
						КонецЕсли;
					КонецЦикла;
					Если СуммаЗаДеньПоВсемРасшифровкам > 0 Тогда 
						ПроведениеБезРасшифровки = Ложь;
					Иначе	                           
						ПроведениеБезРасшифровки = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ВидОперацииПричины = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.Причина, "ВидОперации");
			Если ЗначениеЗаполнено(ВидОперацииПричины) Тогда
				ВидОперации = ВидОперацииПричины;
			Иначе
				ВидОперации = Справочники.упоВидыОпераций.ПотеряВремени;
			КонецЕсли;
			
			Если Не ДанныеДокумента.ИспользоватьРасшифровкуТрудозатрат Тогда                       			
				
				Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
				Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
				Движение.Подразделение = ДанныеДокумента.Подразделение;
				Движение.ВидОперации = ВидОперации;				
				Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени;
				Движение.ЗадачаПричина = СтрокаДанных.Причина;
				Движение.День = РабочийДень;
				Движение.РасшифровкаТрудозатрат = "БезРасшифровки";
				Движение.Трудозатраты = ТрудозатратыДня;	
				
			Иначе
				
				Если ПроведениеБезРасшифровки Тогда  
						
					Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
					Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
					Движение.Подразделение = ДанныеДокумента.Подразделение;
					Движение.ВидОперации = ВидОперации;
					Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени;
					Движение.ЗадачаПричина = СтрокаДанных.Причина;
					Движение.День = РабочийДень;
					Движение.РасшифровкаТрудозатрат = "БезРасшифровки";
					Движение.Трудозатраты = ТрудозатратыДня;	
					
				Иначе 
					
					Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
						
						Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
						Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
						Движение.Подразделение = ДанныеДокумента.Подразделение;
						Движение.ВидОперации = СтрокаРасшифровки.ВидОперации;	
						Движение.РольРесурса = СтрокаРасшифровки.РольРесурса;	
						Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени;
						Движение.ЗадачаПричина = СтрокаРасшифровки.Причина;
						Движение.РасшифровкаТрудозатрат = СтрокаРасшифровки.Расшифровка;
						Движение.День = РабочийДень;
						Движение.Трудозатраты = СтрокаРасшифровки.ИтогоПоСтроке;	
						
					КонецЦикла;  
				КонецЕсли; 
			КонецЕсли; 			
		КонецЦикла; 				
	КонецЦикла; 
	
	// Формируем список рабочих заданий, по которым
	// пользователь ввел ненулевые трудозатраты.
		
	СписокРабочихЗаданий = Новый СписокЗначений();	
	СписокНормСтоимости = Новый СписокЗначений();
	СоответствиеСтруктурНастроекПроектов = Новый Соответствие;
	СписокРолейИТрудовыхРесурсовПоПериоду = Новый СписокЗначений();
	
	Для Каждого СтрокаЗадача Из ДанныеДокумента.РабочиеЗадания Цикл
		
		НеПустаяСтрока = СтрокаЗадача.Понедельник Или СтрокаЗадача.Вторник Или 
		СтрокаЗадача.Среда Или СтрокаЗадача.Четверг Или СтрокаЗадача.Пятница Или 
		СтрокаЗадача.Суббота Или СтрокаЗадача.Воскресенье;
		
		Если НеПустаяСтрока Тогда 
			
			СписокРабочихЗаданий.Добавить(СтрокаЗадача.РабочееЗадание);
			
			СтруктураНастроекПроекта = СоответствиеСтруктурНастроекПроектов.Получить(СтрокаЗадача.Проект);
			Если СтруктураНастроекПроекта = Неопределено Тогда
				СтруктураНастроекПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(СтрокаЗадача.Проект);
				СоответствиеСтруктурНастроекПроектов.Вставить(СтрокаЗадача.Проект, СтруктураНастроекПроекта);
			КонецЕсли;
            
            СписокРолейИТрудовыхРесурсовПоПериоду.Добавить(ТрудовойРесурс);
            СписокРолейИТрудовыхРесурсовПоПериоду.Добавить(СтрокаЗадача.РольРесурса);             
			
		КонецЕсли; 
	КонецЦикла; 
	
	Если СписокРабочихЗаданий.Количество() = 0 Тогда      
		Возврат;
	КонецЕсли;
	
	СвойстваПроектныхЗадач = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектныхЗадач(СписокРабочихЗаданий.ВыгрузитьЗначения(), 
															"ВидОперации, НормаСтоимостиТрудовыхРесурсов");
	
	ВидыОпераций = Новый Массив;
	Для Каждого КлючЗначение Из СвойстваПроектныхЗадач Цикл
		СписокНормСтоимости.Добавить(КлючЗначение.Значение.НормаСтоимостиТрудовыхРесурсов);
		ВидыОпераций.Добавить(КлючЗначение.Значение.ВидОперации);
	КонецЦикла;
	
	РазделыУчетаВидовОпераций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВидыОпераций, "РазделУчета", Истина);
	
	Если СписокРолейИТрудовыхРесурсовПоПериоду.Количество() > 0 Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                        |	РегНормы.Ресурс КАК Ресурс,
	                        |	РегНормы.Норма КАК Норма,
	                        |	РегНормы.ЕдиницаНормирования КАК ЕдиницаНормирования,
	                        |	РегНормы.ЕдСтоимость КАК СтоимостьЕдиницы,
	                        |	ВЫБОР
	                        |		КОГДА ВЫРАЗИТЬ(РегНормы.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени) ЕСТЬ NULL
	                        |			ТОГДА 0
	                        |		ИНАЧЕ ВЫБОР
	                        |				КОГДА РегНормы.ЕдиницаНормирования ЕСТЬ NULL
	                        |					ТОГДА 0
	                        |				ИНАЧЕ ВЫБОР
	                        |						КОГДА РегНормы.ЕдиницаНормирования.Коэффициент > 0
	                        |							ТОГДА РегНормы.ЕдСтоимость / РегНормы.ЕдиницаНормирования.Коэффициент
	                        |						ИНАЧЕ 0
	                        |					КОНЕЦ
	                        |			КОНЕЦ
	                        |	КОНЕЦ КАК СтоимостьЧаса,
	                        |	НАЧАЛОПЕРИОДА(РегНормы.Период, ДЕНЬ) КАК ПериодНачала
	                        |ПОМЕСТИТЬ ВТ_РегНормы
	                        |ИЗ
	                        |	РегистрСведений.упоНормыСтоимостиРесурсов КАК РегНормы
	                        |ГДЕ
	                        |	ВЫБОР
	                        |		КОГДА  &МаксимальнаяДата = ДАТАВРЕМЯ(1, 1, 1)
	                        |			ТОГДА ИСТИНА
	                        |		ИНАЧЕ РегНормы.Период <= &МаксимальнаяДата
	                        |	КОНЕЦ
	                        |	И РегНормы.Норма В(&СписокНорм)
	                        |	И РегНормы.Ресурс В(&СписокРесурсов)
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ВТ_РегНормы.Ресурс КАК Ресурс,
	                        |	ВТ_РегНормы.Норма КАК Норма,
	                        |	ВТ_РегНормы.ЕдиницаНормирования КАК ЕдиницаНормирования,
	                        |	ВТ_РегНормы.СтоимостьЕдиницы КАК СтоимостьЕдиницы,
	                        |	ВТ_РегНормы.СтоимостьЧаса КАК СтоимостьЧаса,
	                        |	ВТ_РегНормы.ПериодНачала КАК ПериодНачала,
	                        |	МИНИМУМ(ЕСТЬNULL(ВТ_РегНормы1.ПериодНачала, &МаксимальнаяДата)) КАК ПериодОкончания
	                        |ИЗ
	                        |	ВТ_РегНормы КАК ВТ_РегНормы
	                        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегНормы КАК ВТ_РегНормы1
	                        |		ПО ВТ_РегНормы.Ресурс = ВТ_РегНормы1.Ресурс
	                        |			И ВТ_РегНормы.Норма = ВТ_РегНормы1.Норма
	                        |			И ВТ_РегНормы.ПериодНачала < ВТ_РегНормы1.ПериодНачала
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	ВТ_РегНормы.Норма,
	                        |	ВТ_РегНормы.Ресурс,
	                        |	ВТ_РегНормы.ЕдиницаНормирования,
	                        |	ВТ_РегНормы.ПериодНачала,
	                        |	ВТ_РегНормы.СтоимостьЕдиницы,
	                        |	ВТ_РегНормы.СтоимостьЧаса";

		ПараметрыЗапроса = Новый Структура();
		ПараметрыЗапроса.Вставить("СписокНорм", СписокНормСтоимости.ВыгрузитьЗначения());
		ПараметрыЗапроса.Вставить("СписокРесурсов", СписокРолейИТрудовыхРесурсовПоПериоду.ВыгрузитьЗначения());
		ПараметрыЗапроса.Вставить("ДатаДок", упоРабочиеКалендариВызовСервера.обПолучитьМоментВремениДокумента(ЭтотОбъект));
		ПараметрыЗапроса.Вставить("МаксимальнаяДата", КонецДня(ДеньКонецНедели));
		
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
		ТаблицаНормСтоимостиПоПериоду = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	ИспользоватьСтавкуТрудовогоРесурсаДляПредварительного = Константы.упоИспользоватьСтавкуТрудовогоРесурсаПриРасчетеСтоимостиТрудозатрат.Получить();	
	
	Если ДанныеДокумента.ИспользоватьРасшифровкуТрудозатрат Тогда 
		тзРасшифровкаТрудозатрат = ДанныеДокумента.РасшифровкаТрудозатрат.Скопировать();
		ИменаКолонок = ИменаКолонокДляСворачивания(тзРасшифровкаТрудозатрат);
		тзРасшифровкаТрудозатрат.Свернуть(ИменаКолонок, "ИтогоПоСтроке");
	КонецЕсли;
	
	// Перебираем рабочие задания из табличной части и для каждого
	// формируем свой набор движений, в зависимости от контекста.
	
	ТаблицаФактТрудозатратПоДням = 
		упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоФактТрудозатратПоДням", "День,Стоимость,Период");
	ВидОперацииЯвка = Справочники.упоВидыОпераций.Явка;
	Для Каждого СтрокаЗадача Из ДанныеДокумента.РабочиеЗадания Цикл
		   
		ПустаяСтрока = СтрокаЗадача.Понедельник Или	СтрокаЗадача.Вторник Или 
		СтрокаЗадача.Среда Или СтрокаЗадача.Четверг Или СтрокаЗадача.Пятница Или 
		СтрокаЗадача.Суббота Или СтрокаЗадача.Воскресенье;
		
		Если Не ПустаяСтрока Тогда 
			Продолжить;
		КонецЕсли; 
		
		// Норма стоимости зависит от типа записи - рабочее задание или проектная задача.
		
		СвойстваЗадачи = СвойстваПроектныхЗадач.Получить(СтрокаЗадача.РабочееЗадание);
		Если СвойстваЗадачи = Неопределено Тогда
			НормаСтоимостиФакт = Неопределено;
		Иначе
			НормаСтоимостиФакт = СвойстваЗадачи.НормаСтоимостиТрудовыхРесурсов;
		КонецЕсли;
		
		ВидОперации = ПолучитьВидОперацииИзСвойствПЗ(СвойстваЗадачи, РазделыУчетаВидовОпераций, ВидОперацииЯвка);
		
        ТаблицаНормСтоимости = ТаблицаНормСтоимостиПоПериоду;
        ИтогоНормаСтоимостиПоПериоду = 0;
        ИтогоНормаСтоимостиПоПредварительномуУровнюПоПериоду = 0;
        ДатаИзмененияНормы = Дата(1, 1, 1);
        ДатаИзмененияНормыПоПредварительномуУровню = Дата(1, 1, 1);
		
		//
		
		ОтборПоТрудовомуРесурсу = Новый Структура("Ресурс,Норма", ДанныеДокумента.ТрудовойРесурс, НормаСтоимостиФакт);
		ОтборПоРоли = Новый Структура("Ресурс,Норма", СтрокаЗадача.РольРесурса, НормаСтоимостиФакт);
		
		СтрокиНормыСтоимостиПоТрудовомуРесурсу = ТаблицаНормСтоимости.НайтиСтроки(ОтборПоТрудовомуРесурсу);
		СтрокиНормыСтоимостиПоРоли = ТаблицаНормСтоимости.НайтиСтроки(ОтборПоРоли);

		Если СтрокиНормыСтоимостиПоТрудовомуРесурсу.Количество() = 0 Тогда
			СтрокаНормыСтоимостиПоТрудовомуРесурсу = Неопределено;
		Иначе
			СтрокаНормыСтоимостиПоТрудовомуРесурсу = СтрокиНормыСтоимостиПоТрудовомуРесурсу[0];
		КонецЕсли;
			
		Если СтрокиНормыСтоимостиПоРоли.Количество() = 0 Тогда
			СтрокаНормыСтоимостиПоРоли = Неопределено;
		Иначе
			СтрокаНормыСтоимостиПоРоли = СтрокиНормыСтоимостиПоРоли[0];
		КонецЕсли;

		//
		
		Если ИспользоватьСтавкуТрудовогоРесурсаДляПредварительного 
			И СтрокаНормыСтоимостиПоТрудовомуРесурсу <> Неопределено 
			И СтрокаНормыСтоимостиПоТрудовомуРесурсу.СтоимостьЧаса <> 0 Тогда      
			СтрокаНормыПоПредварительномуУровню = СтрокаНормыСтоимостиПоТрудовомуРесурсу;
			СтрокиНормыСтоимостиПоПредварительномуУровню = СтрокиНормыСтоимостиПоТрудовомуРесурсу;
		Иначе	
			СтрокаНормыПоПредварительномуУровню = СтрокаНормыСтоимостиПоРоли; 
			СтрокиНормыСтоимостиПоПредварительномуУровню = СтрокиНормыСтоимостиПоРоли;
		КонецЕсли;
		
		Если СтрокаНормыСтоимостиПоТрудовомуРесурсу <> Неопределено 
			И СтрокаНормыСтоимостиПоТрудовомуРесурсу.СтоимостьЧаса <> 0 Тогда  
			СтрокаНормыПоОкончательномуУровню = СтрокаНормыСтоимостиПоТрудовомуРесурсу;
			СтрокиНормыСтоимостиПоОкончательномуУровню =  СтрокиНормыСтоимостиПоТрудовомуРесурсу;
		Иначе
			СтрокаНормыПоОкончательномуУровню = СтрокаНормыСтоимостиПоРоли;
			СтрокиНормыСтоимостиПоОкончательномуУровню =  СтрокиНормыСтоимостиПоРоли;
		КонецЕсли;
		
		//
		
		// Кеширование
		мПроектныеЗадачи = Новый Массив;
		Для Каждого СтрокаТаблицы Из РабочиеЗадания Цикл
			Если ТипЗнч(СтрокаТаблицы.РабочееЗадание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
				мПроектныеЗадачи.Добавить(СтрокаТаблицы.РабочееЗадание);
			КонецЕсли;
		КонецЦикла;
		СправочникПроектПоДокументуПЗ = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(мПроектныеЗадачи,, Истина);
		
		Для Каждого СтрокаДень Из ТаблицаДней Цикл
			
			ТрудозатратыДня = СтрокаЗадача[СтрокаДень.ИмяДня];
			РабочийДень = НачалоДня(ДанныеДокумента.ДеньНачалаНедели) + 86400 * СтрокаДень.Смещение;
			
			Если ТрудозатратыДня = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			лЗадачаПричина = Неопределено;
			
			Если ТипЗнч(СтрокаЗадача.РабочееЗадание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
				лЗадачаПричина = СправочникПроектПоДокументуПЗ.Получить(СтрокаЗадача.РабочееЗадание);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(лЗадачаПричина) Тогда
				лЗадачаПричина = СтрокаЗадача.Проект;
			КонецЕсли;
			
			// Ранее если использовали расшифровку, то движения делались только с использованием расшифровки,
			// теперь если за какой-то день по ПЗ есть расшифровка, то пишем в регистр расшифровку, 
			// иначе пишем по вкладке Проектные задачи.
			Если ДанныеДокумента.ИспользоватьРасшифровкуТрудозатрат Тогда 
				
				ОтборПоискРасшифровок = Новый Структура();
				ОтборПоискРасшифровок.Вставить("РабочееЗадание", СтрокаЗадача.РабочееЗадание);
				ОтборПоискРасшифровок.Вставить("Задание", СтрокаЗадача.Задание);
				ОтборПоискРасшифровок.Вставить("Подразделение", СтрокаЗадача.Подразделение);
				ОтборПоискРасшифровок.Вставить("РольРесурса", СтрокаЗадача.РольРесурса);
				ОтборПоискРасшифровок.Вставить("ДеньНедели", СтрокаДень.ИмяДня);
				
				СтрокиРасшифровки = ДанныеДокумента.РасшифровкаТрудозатрат.НайтиСтроки(ОтборПоискРасшифровок);
				
				// По проектной задаче нет расшифровок.
				Если СтрокиРасшифровки.Количество() = 0  Тогда 
					ПроведениеБезРасшифровки = Истина;
				Иначе 
					СуммаЗаДеньПоВсемРасшифровкам = 0;
					Для каждого ЭлементРасшифровки Из СтрокиРасшифровки Цикл
						Если ЭлементРасшифровки.ДеньНедели = СтрокаДень.ИмяДня Тогда
							СуммаЗаДеньПоВсемРасшифровкам = СуммаЗаДеньПоВсемРасшифровкам + ЭлементРасшифровки.ИтогоПоСтроке;
						КонецЕсли;
					КонецЦикла;
					Если СуммаЗаДеньПоВсемРасшифровкам > 0 Тогда 
						ПроведениеБезРасшифровки = Ложь;
					Иначе	                           
						ПроведениеБезРасшифровки = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ДанныеДокумента.ИспользоватьРасшифровкуТрудозатрат Тогда
				
				// ДанныеДвижений.упоФактТрудозатратПоДням - Окончательный уровень.			
				ПараметрыДанных = Новый Структура;
				ПараметрыДанных.Вставить("УровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
				ПараметрыДанных.Вставить("ТрудовойРесурс", 		ДанныеДокумента.ТрудовойРесурс);
				ПараметрыДанных.Вставить("РабочийДень", 		РабочийДень);
				ПараметрыДанных.Вставить("ТрудозатратыДня", 	ТрудозатратыДня);
				ПараметрыДанных.Вставить("ЕстьСтрокаНормы", 	СтрокаНормыПоОкончательномуУровню = Неопределено);
				ПараметрыДанных.Вставить("ДатаИзмененияНормы", 	ДатаИзмененияНормы);
				ПараметрыДанных.Вставить("СтрокиНормыСтоимостиПоРоли", 	СтрокиНормыСтоимостиПоРоли);
				ПараметрыДанных.Вставить("ИтогоНормаСтоимостиПоПериоду", 	ИтогоНормаСтоимостиПоПериоду);
				ПараметрыДанных.Вставить("СтрокиНормыСтоимостиПоУровню", 	СтрокиНормыСтоимостиПоОкончательномуУровню);
				ПараметрыДанных.Вставить("ВидОперации", 		ВидОперации);					
					
				ДобавитьДвижениеВРегистрыФактаТрудозатрат(ДанныеДвижений.упоФактТрудозатратПоДням, СтрокаЗадача, ПараметрыДанных);
				
				ИтогоНормаСтоимостиПоПериоду = ПараметрыДанных.ИтогоНормаСтоимостиПоПериоду;
	                
				// ДанныеДвижений.упоФактТрудозатратПоДням - Предварительный уровень.			
				ПараметрыДанных.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;
				ПараметрыДанных.ЕстьСтрокаНормы = СтрокаНормыПоПредварительномуУровню = Неопределено;
				ПараметрыДанных.ДатаИзмененияНормы = ДатаИзмененияНормыПоПредварительномуУровню;
				ПараметрыДанных.СтрокиНормыСтоимостиПоУровню = СтрокиНормыСтоимостиПоПредварительномуУровню;
				
				ДобавитьДвижениеВРегистрыФактаТрудозатрат(ДанныеДвижений.упоФактТрудозатратПоДням, СтрокаЗадача, ПараметрыДанных);
				
				Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
				Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
				Движение.Подразделение = СтрокаЗадача.Подразделение;
				Движение.РольРесурса = СтрокаЗадача.РольРесурса;
				Движение.ВидОперации = ВидОперации;
				Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
				Движение.ЗадачаПричина = лЗадачаПричина;
				Движение.Задание = СтрокаЗадача.Задание;
				Движение.День = РабочийДень;
				Движение.Трудозатраты = ТрудозатратыДня;
				Движение.РасшифровкаТрудозатрат = "БезРасшифровки";
				Движение.РабочееЗадание = СтрокаЗадача.РабочееЗадание;
				
				Если упоИнтеграцияEPMСервер.ИспользоватьПодсистемуРаспределениеЗарплаты() Тогда
					СтруктураСтроки = Новый Структура("Задача, ПроектнаяЗадача, ВидОперации", 
						СтрокаЗадача.Задание, СтрокаЗадача.РабочееЗадание);
					МодульРаспределениеЗарплатыСервер = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыСервер");
					МодульРаспределениеЗарплатыСервер.ЗаполнитьВидОперацииСтрокиТабеля(СтруктураСтроки);
					Движение.ВидОперации = СтруктураСтроки.ВидОперации;
				КонецЕсли;
				
			Иначе
				
				// Расшифровка "проектных" трудозатрат по дополнительному аналитическому разрезу.
				Если ПроведениеБезРасшифровки Тогда 
					
					// ДанныеДвижений.упоФактТрудозатратПоДням - Окончательный уровень.			
					ПараметрыДанных = Новый Структура;
					ПараметрыДанных.Вставить("УровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
					ПараметрыДанных.Вставить("ТрудовойРесурс", 		ДанныеДокумента.ТрудовойРесурс);
					ПараметрыДанных.Вставить("РабочийДень", 		РабочийДень);
					ПараметрыДанных.Вставить("ТрудозатратыДня", 	ТрудозатратыДня);
					ПараметрыДанных.Вставить("ЕстьСтрокаНормы", 	СтрокаНормыПоОкончательномуУровню = Неопределено);
					ПараметрыДанных.Вставить("ДатаИзмененияНормы", 	ДатаИзмененияНормы);
					ПараметрыДанных.Вставить("СтрокиНормыСтоимостиПоРоли", 	СтрокиНормыСтоимостиПоРоли);
					ПараметрыДанных.Вставить("ИтогоНормаСтоимостиПоПериоду", 	ИтогоНормаСтоимостиПоПериоду);
					ПараметрыДанных.Вставить("СтрокиНормыСтоимостиПоУровню", 	СтрокиНормыСтоимостиПоОкончательномуУровню);
					ПараметрыДанных.Вставить("ВидОперации", 		ВидОперации);					
			   		
					ДобавитьДвижениеВРегистрыФактаТрудозатрат(ДанныеДвижений.упоФактТрудозатратПоДням, СтрокаЗадача, ПараметрыДанных);
					
					ИтогоНормаСтоимостиПоПериоду = ПараметрыДанных.ИтогоНормаСтоимостиПоПериоду;
		                
					// ДанныеДвижений.упоФактТрудозатратПоДням - Предварительный уровень.				
					ПараметрыДанных.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;
					ПараметрыДанных.ЕстьСтрокаНормы = СтрокаНормыПоПредварительномуУровню = Неопределено;
					ПараметрыДанных.ДатаИзмененияНормы = ДатаИзмененияНормыПоПредварительномуУровню;
					ПараметрыДанных.СтрокиНормыСтоимостиПоУровню = СтрокиНормыСтоимостиПоПредварительномуУровню;
					
					ДобавитьДвижениеВРегистрыФактаТрудозатрат(ДанныеДвижений.упоФактТрудозатратПоДням, СтрокаЗадача, ПараметрыДанных);
				
					Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
					Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
					Движение.Подразделение = СтрокаЗадача.Подразделение;
					Движение.ВидОперации = ВидОперации;
					Движение.РольРесурса = СтрокаЗадача.РольРесурса;	
					Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
					Движение.ЗадачаПричина = лЗадачаПричина;
					Движение.Задание = СтрокаЗадача.Задание;
					Движение.День = РабочийДень;
					Движение.Трудозатраты = ТрудозатратыДня;
					Движение.РасшифровкаТрудозатрат = "БезРасшифровки";
					Движение.РабочееЗадание = СтрокаЗадача.РабочееЗадание;
					
					Если упоИнтеграцияEPMСервер.ИспользоватьПодсистемуРаспределениеЗарплаты() Тогда
						
						СтруктураСтроки = Новый Структура;
						СтруктураСтроки.Вставить("Задача", ?(ЗначениеЗаполнено(СтрокаЗадача.Задание) , СтрокаЗадача.Задание, СтрокаЗадача.РабочееЗадание));
						СтруктураСтроки.Вставить("ПроектнаяЗадача", СтрокаЗадача.РабочееЗадание);
						СтруктураСтроки.Вставить("ВидОперации");
						
						МодульРаспределениеЗарплатыСервер = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыСервер");
						МодульРаспределениеЗарплатыСервер.ЗаполнитьВидОперацииСтрокиТабеля(СтруктураСтроки);
						Движение.ВидОперации = СтруктураСтроки.ВидОперации;
						
					КонецЕсли;
					
				Иначе 
					
					Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
						
						ТрудозатратыПоРасшифровке = СтрокаРасшифровки;	
						
						Движение = ДанныеДвижений.упоИспользованиеРабочегоВремени.Добавить();
						Движение.ТрудовойРесурс = ДанныеДокумента.ТрудовойРесурс;
						Движение.Подразделение = СтрокаРасшифровки.Подразделение;
						Движение.ВидОперации = СтрокаРасшифровки.ВидОперации;
			            Движение.РольРесурса = СтрокаРасшифровки.РольРесурса;
						Движение.РазделУчета = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
						Движение.ЗадачаПричина = лЗадачаПричина;
						Движение.Задание = СтрокаЗадача.Задание;
						Движение.День = РабочийДень;
						Движение.РасшифровкаТрудозатрат = СтрокаРасшифровки.Расшифровка;
						Движение.Трудозатраты = СтрокаРасшифровки.ИтогоПоСтроке;
						Движение.РабочееЗадание = СтрокаРасшифровки.РабочееЗадание;
						
					КонецЦикла;
					
					ОтборПоискРасшифровок = Новый Структура();
					ОтборПоискРасшифровок.Вставить("РабочееЗадание", СтрокаЗадача.РабочееЗадание);
					ОтборПоискРасшифровок.Вставить("Задание", СтрокаЗадача.Задание);
					ОтборПоискРасшифровок.Вставить("Подразделение", СтрокаЗадача.Подразделение);
					ОтборПоискРасшифровок.Вставить("РольРесурса", СтрокаЗадача.РольРесурса);
					ОтборПоискРасшифровок.Вставить("ДеньНедели", СтрокаДень.ИмяДня);
					
					СвернутыеСтрокиРасшифровки = тзРасшифровкаТрудозатрат.НайтиСтроки(ОтборПоискРасшифровок);
					
					Для Каждого СтрокаРасшифровки Из СвернутыеСтрокиРасшифровки Цикл
						
						// ДанныеДвижений.упоФактТрудозатратПоДням - Окончательный уровень.			
						ПараметрыДанных = Новый Структура;
						ПараметрыДанных.Вставить("УровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
						ПараметрыДанных.Вставить("ТрудовойРесурс", 		ДанныеДокумента.ТрудовойРесурс);
						ПараметрыДанных.Вставить("РабочийДень", 		РабочийДень);
						ПараметрыДанных.Вставить("ТрудозатратыДня", 	СтрокаРасшифровки.ИтогоПоСтроке);
						ПараметрыДанных.Вставить("ЕстьСтрокаНормы", 	СтрокаНормыПоОкончательномуУровню = Неопределено);
						ПараметрыДанных.Вставить("ДатаИзмененияНормы", 	ДатаИзмененияНормы);
						ПараметрыДанных.Вставить("СтрокиНормыСтоимостиПоРоли", 	СтрокиНормыСтоимостиПоРоли);
						ПараметрыДанных.Вставить("ИтогоНормаСтоимостиПоПериоду", 	ИтогоНормаСтоимостиПоПериоду);
						ПараметрыДанных.Вставить("СтрокиНормыСтоимостиПоУровню", 	СтрокиНормыСтоимостиПоОкончательномуУровню);
						ПараметрыДанных.Вставить("ВидОперации", 		СтрокаРасшифровки.ВидОперации);					
					
						ДобавитьДвижениеВРегистрыФактаТрудозатрат(ДанныеДвижений.упоФактТрудозатратПоДням, СтрокаРасшифровки,
							ПараметрыДанных);
						
						ИтогоНормаСтоимостиПоПериоду = ПараметрыДанных.ИтогоНормаСтоимостиПоПериоду;
			                
						// ДанныеДвижений.упоФактТрудозатратПоДням - Предварительный уровень.						
						ПараметрыДанных.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;
						ПараметрыДанных.ЕстьСтрокаНормы = СтрокаНормыПоПредварительномуУровню = Неопределено;
						ПараметрыДанных.ДатаИзмененияНормы = ДатаИзмененияНормыПоПредварительномуУровню;
						ПараметрыДанных.СтрокиНормыСтоимостиПоУровню = СтрокиНормыСтоимостиПоПредварительномуУровню;
						
						ДобавитьДвижениеВРегистрыФактаТрудозатрат(ДанныеДвижений.упоФактТрудозатратПоДням, СтрокаЗадача, 
							ПараметрыДанных);
				
					КонецЦикла;  
					
				КонецЕсли; 
			КонецЕсли; 			
		КонецЦикла; 		
		
		упоФункцииОбщегоНазначенияСервер.СвернутьТаблицуДвижений(ДанныеДвижений.упоИспользованиеРабочегоВремени,
			"упоИспользованиеРабочегоВремени");
				
	КонецЦикла;  
	
	// По регистру общих фактических затрат трудовых ресурсов
	// движения делаются без разбиения по дням.	
	ЗаполнитьДвиженияПоФактуТрудозатратСводно(ДанныеДвижений);	
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если Основание = Неопределено Тогда 
		
		// Новый документ заполняем связанным трудовым ресурсом для текущего сотрудника
		// текущего пользователя.
		МассивТрудовыхРесурсов = упоРесурсыИРолиСервер.ПолучитьТрудовыеРесурсыТекущегоСотрудника();				
		Если МассивТрудовыхРесурсов.Количество() = 1 Тогда
			ТрудовойРесурс = МассивТрудовыхРесурсов[0];	
		КонецЕсли;		
				
	Иначе
		
		упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
		
		Если ТипЗнч(Основание) = Тип("СправочникСсылка.упоТрудовыеРесурсы") Тогда
			
			// Необходимо выполнить проверку на владение трудовым
			// ресурсом для текущего пользователя.			
			Если упоРесурсыИРолиСервер.РесурсУправляетсяТекущимПользователем(Основание) Тогда
				ТрудовойРесурс = Основание;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	ЭтотОбъект.РабочиеЗадания.Очистить();
	ЭтотОбъект.ВнепроектныеЗадачи.Очистить();
	ЭтотОбъект.ПотериВремени.Очистить();
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ПроверятьРазграничениеДоступа = Не ((ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ЭтотОбъект.ДополнительныеСвойства.НеПроверятьРазграничениеДоступа
		Или ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтложенноеПроведение")));
		
	Если ПроверятьРазграничениеДоступа 
			И Не упоРесурсыИРолиСервер.РесурсУправляетсяТекущимПользователем(ТрудовойРесурс) Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Текущий пользователь не является владельцем выбранного трудового ресурса ""%1"".'"),
			ТрудовойРесурс);
		Отказ = Истина;
	КонецЕсли; 
	
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , ЭтотОбъект.Ссылка, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не Константы.упоИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах.Получить()
		И ИспользоватьРасшифровкуТрудозатрат Тогда
		ИспользоватьРасшифровкуТрудозатрат = Ложь;
	КонецЕсли;
	
	ЕдиницаНормирования = Справочники.упоЕдиницыВремени.Час;
	ДеньКонецНедели = КонецНедели(ДеньНачалаНедели);
	
	СвернутьТабличныеЧасти();
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не ДополнительныеСвойства.Свойство("ОтложенноеПроведение") Тогда
		ПроверитьВозможностьРаспределенияРабочегоВремени(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Контроль ввода данных за два периода (месяца).
	ВведеныДанныеЗаДваПериода(Отказ); 
	ПроверитьРаспределениеРабочегоВремениТрудовогоРесурсаВДругихДокументах(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверятьКоличествоЧасов = НЕ Константы.упоОтключитьПроверкуКоличестваРабочихЧасов.Получить();
	
	Если ПроверятьКоличествоЧасов Тогда 
		
		МассивДниНедели = Новый Массив;
		МассивДниНедели.Добавить("Понедельник");
		МассивДниНедели.Добавить("Вторник");
		МассивДниНедели.Добавить("Среда");
		МассивДниНедели.Добавить("Четверг");
		МассивДниНедели.Добавить("Пятница");
		МассивДниНедели.Добавить("Суббота");
		МассивДниНедели.Добавить("Воскресенье");
		
		ПроверятьКоличествоЧасов = Константы.упоОтключитьПроверкуКоличестваРабочихЧасов.Получить();
		
		ВсегоЧасов = РабочиеЗадания.Итог("ИтогоПоСтроке") 
			+ ВнепроектныеЗадачи.Итог("ИтогоПоСтроке") 
			+ ПотериВремени.Итог("ИтогоПоСтроке");
		Если ВсегоЧасов > 168 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Неделя физически не может содержать более 168 рабочих часов." + Символы.ПС
				+ "Распределено в документе: " + ВсегоЧасов + " ч." + Символы.ПС + Символы.ПС
				+ "Необходимо проверить табличные части документа" + Символы.ПС + "и убрать лишние часы.";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Для Каждого ДеньНедели Из МассивДниНедели Цикл
			
			КоличествоЧасовДень = РабочиеЗадания.Итог(ДеньНедели) 
				+ ВнепроектныеЗадачи.Итог(ДеньНедели) 
				+ ПотериВремени.Итог(ДеньНедели);
			
			Если КоличествоЧасовДень > 24 Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "За день недели """ + ДеньНедели + """ введено больше 24 часов!";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВидОперацииИзСвойствПЗ(СвойстваЗадачи, РазделыУчетаВидовОпераций, ВидОперацииПоУмолчанию)

	ВидОперации = ВидОперацииПоУмолчанию;
	Если СвойстваЗадачи <> Неопределено Тогда
		ВидОперацииЗадачи = СвойстваЗадачи.ВидОперации;
		РазделУчетаВидаОперации = РазделыУчетаВидовОпераций[ВидОперацииЗадачи];
		Если ЗначениеЗаполнено(РазделУчетаВидаОперации) Тогда
			ВидОперации	= ВидОперацииЗадачи;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВидОперации;
	
КонецФункции

Процедура ПроверитьВозможностьРаспределенияРабочегоВремени(Отказ)
	
	// Проведение в привилегированном режиме.
	// Для статусов остановлен отбираем дату статуса с конца недели, для запланирован/утвержден - с начала недели.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДеньНачалаНедели);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = ТекстЗапросаДатаСтатусаВКонцеНедели();
	ТЗ = Запрос.Выполнить().Выгрузить();   
	
	СотрудникТР = упоРесурсыИРолиВызовСервера.обПолучитьТекущегоВладельцаРесурса(ТрудовойРесурс);
	
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоПроектамСУчетомСтатуса(
		ТЗ, СотрудникТР, "Остановлен", Отказ);
		
	Запрос.Текст = ТекстЗапросаДатаСтатусаВНачалеНедели();
	ТЗ = Запрос.Выполнить().Выгрузить(); 	
		
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоПроектамСУчетомСтатуса(
		ТЗ, СотрудникТР, "ЗапланированУтвержден", Отказ);
	
	Если Константы.упоРазрешитьРаспределениеРабочегоВремениПоЗакрытымЗадачам.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПЗ = РабочиеЗадания.ВыгрузитьКолонку("РабочееЗадание");
	МассивЗаданий = РабочиеЗадания.ВыгрузитьКолонку("Задание");
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоЗакрытымЗадачам(
		МассивПЗ,
		МассивЗаданий,
		Отказ);
		
КонецПроцедуры

Процедура ПроверитьРаспределениеРабочегоВремениТрудовогоРесурсаВДругихДокументах(Отказ)
	
	Если Константы.упоОтключитьПроверкуКоличестваРабочихЧасов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	// Проведение в привилегированном режиме.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Ссылка.ДеньНачалаНедели КАК ДеньНачалаНедели,
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Понедельник КАК Понедельник,
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Вторник КАК Вторник,
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Среда КАК Среда,
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Четверг КАК Четверг,
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Пятница КАК Пятница,
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Суббота КАК Суббота,
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Воскресенье КАК Воскресенье
	|ПОМЕСТИТЬ ВсеТрудозатратыДокумента
	|ИЗ
	|	Документ.упоРаспределениеРабочегоВремениЗаНеделю.РабочиеЗадания КАК упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания
	|ГДЕ
	|	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Ссылка.ДеньНачалаНедели,
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Понедельник,
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Вторник,
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Среда,
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Четверг,
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Пятница,
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Суббота,
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Воскресенье
	|ИЗ
	|	Документ.упоРаспределениеРабочегоВремениЗаНеделю.ВнепроектныеЗадачи КАК упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи
	|ГДЕ
	|	упоРаспределениеРабочегоВремениЗаНеделюВнепроектныеЗадачи.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Ссылка.ДеньНачалаНедели,
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Понедельник,
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Вторник,
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Среда,
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Четверг,
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Пятница,
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Суббота,
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Воскресенье
	|ИЗ
	|	Документ.упоРаспределениеРабочегоВремениЗаНеделю.ПотериВремени КАК упоРаспределениеРабочегоВремениЗаНеделюПотериВремени
	|ГДЕ
	|	упоРаспределениеРабочегоВремениЗаНеделюПотериВремени.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТрудозатратыДокумента.ДеньНачалаНедели КАК ДеньНачалаНедели,
	|	СУММА(ВсеТрудозатратыДокумента.Понедельник) КАК Понедельник,
	|	СУММА(ВсеТрудозатратыДокумента.Вторник) КАК Вторник,
	|	СУММА(ВсеТрудозатратыДокумента.Среда) КАК Среда,
	|	СУММА(ВсеТрудозатратыДокумента.Четверг) КАК Четверг,
	|	СУММА(ВсеТрудозатратыДокумента.Пятница) КАК Пятница,
	|	СУММА(ВсеТрудозатратыДокумента.Суббота) КАК Суббота,
	|	СУММА(ВсеТрудозатратыДокумента.Воскресенье) КАК Воскресенье
	|ПОМЕСТИТЬ ТрудозатратыДокумента
	|ИЗ
	|	ВсеТрудозатратыДокумента КАК ВсеТрудозатратыДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеТрудозатратыДокумента.ДеньНачалаНедели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТрудозатратыДокумента.ДеньНачалаНедели КАК День,
	|	ТрудозатратыДокумента.Понедельник КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудозатратыДокументаПоДням
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ТрудозатратыДокумента.ДеньНачалаНедели, ДЕНЬ, 1),
	|	ТрудозатратыДокумента.Вторник
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ТрудозатратыДокумента.ДеньНачалаНедели, ДЕНЬ, 2),
	|	ТрудозатратыДокумента.Среда
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ТрудозатратыДокумента.ДеньНачалаНедели, ДЕНЬ, 3),
	|	ТрудозатратыДокумента.Четверг
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ТрудозатратыДокумента.ДеньНачалаНедели, ДЕНЬ, 4),
	|	ТрудозатратыДокумента.Пятница
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ТрудозатратыДокумента.ДеньНачалаНедели, ДЕНЬ, 5),
	|	ТрудозатратыДокумента.Суббота
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ТрудозатратыДокумента.ДеньНачалаНедели, ДЕНЬ, 6),
	|	ТрудозатратыДокумента.Воскресенье
	|ИЗ
	|	ТрудозатратыДокумента КАК ТрудозатратыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упоИспользованиеРабочегоВремени.Регистратор КАК Регистратор,
	|	упоИспользованиеРабочегоВремени.День КАК День,
	|	СУММА(упоИспользованиеРабочегоВремени.Трудозатраты) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудозатратыВБазеСРегистратором
	|ИЗ
	|	РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
	|ГДЕ
	|	упоИспользованиеРабочегоВремени.Регистратор <> &Ссылка
	|	И упоИспользованиеРабочегоВремени.ТрудовойРесурс = &ТрудовойРесурс
	|	И упоИспользованиеРабочегоВремени.День МЕЖДУ &НачалоНедели И &ОкончаниеНедели
	|
	|СГРУППИРОВАТЬ ПО
	|	упоИспользованиеРабочегоВремени.Регистратор,
	|	упоИспользованиеРабочегоВремени.День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТрудозатратыВБазеСРегистратором.День КАК День,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТрудозатратыВБазеСРегистратором.Регистратор) КАК КоличествоРегистраторов,
	|	СУММА(ТрудозатратыВБазеСРегистратором.Трудозатраты) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудозатратыВБазе
	|ИЗ
	|	ТрудозатратыВБазеСРегистратором КАК ТрудозатратыВБазеСРегистратором
	|
	|СГРУППИРОВАТЬ ПО
	|	ТрудозатратыВБазеСРегистратором.День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТрудозатратыВБазе.День КАК День,
	|	ТрудозатратыДокументаПоДням.Трудозатраты КАК ТрудозатратыДокументаВДень,
	|	ТрудозатратыВБазе.Трудозатраты КАК ТрудозатратыТекущие,
	|	ТрудозатратыВБазе.КоличествоРегистраторов КАК КоличествоРегистраторов,
	|	24 - ТрудозатратыВБазе.Трудозатраты - ТрудозатратыДокументаПоДням.Трудозатраты КАК Превышение
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТрудозатратыДокументаПоДням КАК ТрудозатратыДокументаПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТрудозатратыВБазе КАК ТрудозатратыВБазе
	|		ПО ТрудозатратыДокументаПоДням.День = ТрудозатратыВБазе.День
	|ГДЕ
	|	ТрудозатратыДокументаПоДням.Трудозатраты <> 0
	|	И ТрудозатратыДокументаПоДням.Трудозатраты + ТрудозатратыВБазе.Трудозатраты > 24
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.День КАК День,
	|	ИтоговаяТаблица.ТрудозатратыДокументаВДень КАК ТрудозатратыДокументаВДень,
	|	ИтоговаяТаблица.ТрудозатратыТекущие КАК ТрудозатратыТекущие,
	|	ИтоговаяТаблица.КоличествоРегистраторов КАК КоличествоРегистраторов,
	|	-ИтоговаяТаблица.Превышение КАК Превышение,
	|	ТрудозатратыВБазеСРегистратором.Регистратор КАК Регистратор,
	|	ТрудозатратыВБазеСРегистратором.Трудозатраты КАК Трудозатраты
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТрудозатратыВБазеСРегистратором КАК ТрудозатратыВБазеСРегистратором
	|		ПО (ТрудозатратыВБазеСРегистратором.День = ИтоговаяТаблица.День)
	|
	|УПОРЯДОЧИТЬ ПО
	|	День";
	
	Запрос.УстановитьПараметр("НачалоНедели", ДеньНачалаНедели);
	Запрос.УстановитьПараметр("ОкончаниеНедели", ДеньКонецНедели);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТрудовойРесурс", ТрудовойРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	упоРаспределениеТрудозатратВызовСервера.СообщитьОбОшибкахПроверкиПриПроведении(РезультатЗапроса, ТрудовойРесурс);
	
КонецПроцедуры

// Назначение процедуры понятно из названия
Процедура ДобавитьДвижениеВРегистрыФактаТрудозатрат(ФактТрудозатратПоДням, СтрокаЗадача, ПараметрыДанных)
	
	УровеньПланирования 			= ПараметрыДанных.УровеньПланирования;
	РабочийДень 					= ПараметрыДанных.РабочийДень;
	ТрудозатратыДня 				= ПараметрыДанных.ТрудозатратыДня;
	СтрокиНормыСтоимостиПоРоли 		= ПараметрыДанных.СтрокиНормыСтоимостиПоРоли;
	СтрокиНормыСтоимостиПоУровню	= ПараметрыДанных.СтрокиНормыСтоимостиПоУровню;
	ДатаИзмененияНормы 				= ПараметрыДанных.ДатаИзмененияНормы;
	ИтогоНормаСтоимостиПоПериоду	= ПараметрыДанных.ИтогоНормаСтоимостиПоПериоду;
	ТрудовойРесурс 					= ПараметрыДанных.ТрудовойРесурс;		
	
	СтоимостьЧаса = 0;
        
	Движение = ФактТрудозатратПоДням.Добавить();			
	
	Движение.Операция 			= СтрокаЗадача.РабочееЗадание;			
	Движение.Задание 			= СтрокаЗадача.Задание;			
	Движение.Подразделение 		= СтрокаЗадача.Подразделение;			
	Движение.День 				= РабочийДень;
	Движение.УровеньПланирования = УровеньПланирования;			
	Движение.Трудозатраты 		= ТрудозатратыДня;	
	Если УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный Тогда
		Движение.Роль 			= СтрокаЗадача.РольРесурса;
		Движение.Ресурс 		= ТрудовойРесурс;			    
	Иначе // Предварительный.
		Движение.Ресурс 		= СтрокаЗадача.РольРесурса;			    
	КонецЕсли;	
	Движение.ВидОперации 		= ПараметрыДанных.ВидОперации;			
	
	Если ПараметрыДанных.ЕстьСтрокаНормы Тогда
		
		Если УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный Тогда
			
			// Пробуем найти стоимость по норме роли на текущий день.
			Если ПараметрыДанных.ДатаИзмененияНормы <= НачалоДня(РабочийДень) Тогда
				СтоимостьЧаса = упоРаспределениеТрудозатратВызовСервера.НайтиСтоимостьПоНормеЗаДень(СтрокиНормыСтоимостиПоРоли, 
																									РабочийДень);
			КонецЕсли;
			
			Движение.Стоимость = ТрудозатратыДня * СтоимостьЧаса;
			ПараметрыДанных.ИтогоНормаСтоимостиПоПериоду = ИтогоНормаСтоимостиПоПериоду + Движение.Стоимость;
			
		КонецЕсли;
		
	Иначе
		
		// Найдем стоимость по норме трудового ресурса в текущий день.
		Если ПараметрыДанных.ДатаИзмененияНормы <= НачалоДня(РабочийДень) Тогда
			СтоимостьЧаса = упоРаспределениеТрудозатратВызовСервера.НайтиСтоимостьПоНормеЗаДень(СтрокиНормыСтоимостиПоУровню, 
																								РабочийДень, 
																								ДатаИзмененияНормы);
		КонецЕсли;
		
		// Пробуем найти стоимость по норме роли на текущий день.
		Если СтоимостьЧаса = 0 Тогда
			СтоимостьЧаса = упоРаспределениеТрудозатратВызовСервера.НайтиСтоимостьПоНормеЗаДень(СтрокиНормыСтоимостиПоРоли, 
																								РабочийДень);
		КонецЕсли;
		
		Движение.Стоимость = ТрудозатратыДня * СтоимостьЧаса;
		ПараметрыДанных.ИтогоНормаСтоимостиПоПериоду = ИтогоНормаСтоимостиПоПериоду + Движение.Стоимость;					
		
    КонецЕсли;
		
КонецПроцедуры

// Назначение функции понятно из названия
Функция ИменаКолонокДляСворачивания(РасшифровкаТрудозатрат)
	
	мсИменКолонок = Новый Массив;
	
	Для Каждого тКолонка Из РасшифровкаТрудозатрат.Колонки Цикл
		Если тКолонка.Имя = "НомерСтроки" ИЛИ тКолонка.Имя = "ИтогоПоСтроке" ИЛИ тКолонка.Имя = "Расшифровка" Тогда
			Продолжить;
		КонецЕсли;
		мсИменКолонок.Добавить(тКолонка.Имя);
	КонецЦикла;
	
	Возврат СтрСоединить(мсИменКолонок, ", ");
		
КонецФункции	

Процедура ЗаполнитьДвиженияПоФактуТрудозатратСводно(ДанныеДвижений)

	КолонкиДляКопирования = "Операция, Ресурс, Роль, Подразделение, УровеньПланирования, ВидОперации, Задание, 
		|Трудозатраты, Стоимость";
	ФактТрудозатратСводно = ДанныеДвижений.упоФактТрудозатратПоДням.Скопировать(, КолонкиДляКопирования);	
	КолонкаОперация = ФактТрудозатратСводно.Колонки.Найти("Операция");
	КолонкаОперация.Имя = "ПроектнаяЗадача";
	КолонкаОперация = ФактТрудозатратСводно.Колонки.Найти("Трудозатраты");
	КолонкаОперация.Имя = "КоличествоЧасов";
	
	упоФункцииОбщегоНазначенияСервер.СвернутьТаблицуДвижений(ФактТрудозатратСводно, "упоФактТрудозатратСводно");
	
	ДанныеДвижений.упоФактТрудозатратСводно = ФактТрудозатратСводно;	
	
КонецПроцедуры

// Возвращает структурированную таблицу значений с днями недели.
//
// Возвращаемое значение:
// ТаблицаЗначений:
//		* ИмяДня - Строка - Имя дня недели.
//		* Смещение - Число - Смещение по количеству дней с начала недели.
//		* Трудозатраты - Число - Количество часов за текущий день.
//
Функция ПолучитьТаблицуДней() Экспорт
	
	ТаблицаДней = Новый ТаблицаЗначений();
	ТаблицаДней.Колонки.Добавить("ИмяДня");
	ТаблицаДней.Колонки.Добавить("Смещение");
	ТаблицаДней.Колонки.Добавить("Трудозатраты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 2)));
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Понедельник";
	СтрокаДня.Смещение = 0;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Вторник";
	СтрокаДня.Смещение = 1;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Среда";
	СтрокаДня.Смещение = 2;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Четверг";
	СтрокаДня.Смещение = 3;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Пятница";
	СтрокаДня.Смещение = 4;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Суббота";
	СтрокаДня.Смещение = 5;
	
	СтрокаДня = ТаблицаДней.Добавить();
	СтрокаДня.ИмяДня = "Воскресенье";
	СтрокаДня.Смещение = 6;
	
	Возврат ТаблицаДней;
	
КонецФункции

// Процедура выполняет расчет по всем строкам всех табличных частей в разрезе дней недели.
//
// Параметры:
//  ТаблицаДней	 - ТаблицаЗначений:
//		* ИмяДня		- Строка	- Имя дня недели.
//		* Смещение		- Число		- Смещение по количеству дней с начала недели.
//		* Трудозатраты 	- Число		- Количество часов за текущий день.
//
Процедура РассчитатьТрудозатратыНаКаждыйДень(ТаблицаДней) Экспорт
	
	Для Каждого СтрокаДанных Из РабочиеЗадания Цикл
		
		Для Каждого СтрокаДень Из ТаблицаДней Цикл
			
			СтрокаДень.Трудозатраты = СтрокаДень.Трудозатраты + СтрокаДанных[СтрокаДень.ИмяДня];
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ВнепроектныеЗадачи Цикл
		
		Для Каждого СтрокаДень Из ТаблицаДней Цикл
			
			СтрокаДень.Трудозатраты = СтрокаДень.Трудозатраты + СтрокаДанных[СтрокаДень.ИмяДня];
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ПотериВремени Цикл
		
		Для Каждого СтрокаДень Из ТаблицаДней Цикл
			
			СтрокаДень.Трудозатраты = СтрокаДень.Трудозатраты + СтрокаДанных[СтрокаДень.ИмяДня];
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция выполняет раздельный расчет трудозатрат за каждый период.
//
// Параметры:
//  ТаблицаДней  - ТаблицаЗначений:
//		* ИмяДня		- Строка	- Имя дня недели.
//		* Смещение		- Число		- Смещение по количеству дней с начала недели.
//		* Трудозатраты 	- Число		- Количество часов за текущий день.
//  МесяцКонец	 - Число - Конечный месяц переходящей недели.
//  МесяцНачала	 - Число - Начальный месяц переходящей недели.
//
// Возвращаемое значение:
// 	Структура:
//	 * ДанныеЗаДваПериода - Булево - Наличие данных в двух периодах.
//	 * ТрудозатратыНачальногоПериода - Число - Трудозатраты раннего месяца переходящего периода.
//	 * ТрудозатратыКонечногоПериода - Число - Трудозатраты конечного месяца переходящего периода.
//
Функция ПроверитьНаличиеДанныхВДвухПериодах(ТаблицаДней, МесяцКонец, МесяцНачала) Экспорт
	
	чТрудозатратыМесяцНачала = 0;
	чТрудозатратыМесяцКонец = 0;
	Результат = Новый Структура;
	
	Для Каждого СтрокаДень Из ТаблицаДней Цикл
		
		РабочийДень = НачалоДня(ДеньНачалаНедели) + 86400 * СтрокаДень.Смещение;
		
		чТрудозатратыМесяцНачала = чТрудозатратыМесяцНачала + ?(МесяцНачала = Месяц(РабочийДень), СтрокаДень.Трудозатраты, 0);
		чТрудозатратыМесяцКонец = чТрудозатратыМесяцКонец + ?(МесяцКонец = Месяц(РабочийДень), СтрокаДень.Трудозатраты, 0);
		
	КонецЦикла;
	
	ДанныеЗаДваПериода = чТрудозатратыМесяцНачала <> 0 И чТрудозатратыМесяцКонец <> 0;
	
	Результат.Вставить("ТрудозатратыНачальногоПериода", чТрудозатратыМесяцНачала);
	Результат.Вставить("ТрудозатратыКонечногоПериода", чТрудозатратыМесяцКонец);
	Результат.Вставить("ДанныеЗаДваПериода", ДанныеЗаДваПериода);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаДатаСтатусаВНачалеНедели()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Проект КАК Проект,
	               |	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.РабочееЗадание КАК ПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Понедельник > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Вторник > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 1), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Среда > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 2), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Четверг > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 3), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Пятница > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 4), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Суббота > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 5), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Воскресенье > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 6), ДЕНЬ)
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаСтатуса
	               |ИЗ
	               |	Документ.упоРаспределениеРабочегоВремениЗаНеделю.РабочиеЗадания КАК упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания
	               |ГДЕ
	               |	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДатаСтатусаВКонцеНедели()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Проект КАК Проект,
	               |	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.РабочееЗадание КАК ПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Воскресенье > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 6), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Суббота > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 5), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Пятница > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 4), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Четверг > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 3), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Среда > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 2), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Вторник > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 1), ДЕНЬ)
	               |		КОГДА упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Понедельник > 0
	               |			ТОГДА КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаСтатуса
	               |ИЗ
	               |	Документ.упоРаспределениеРабочегоВремениЗаНеделю.РабочиеЗадания КАК упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания
	               |ГДЕ
	               |	упоРаспределениеРабочегоВремениЗаНеделюРабочиеЗадания.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли