#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)       
    
    УчетВоВнешнейСистеме = упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("УчетВоВнешнейСистеме");    
            
    ОграничениеТипа = ПолучитьОграничениеТипаНачислений(УчетВоВнешнейСистеме);
    Элементы.ТаблицаНачисление.ОграничениеТипа = ОграничениеТипа;
    
    НачисленияБезСоответствияPM = Неопределено;
    Если Параметры.Свойство("НачисленияБезСоответствияPM", НачисленияБезСоответствияPM) 
        И НЕ НачисленияБезСоответствияPM = Неопределено Тогда
        ЗаполнитьТаблицуФормы(НачисленияБезСоответствияPM);
    КонецЕсли;
                        
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПеренестиВДокумент(Команда)
    ПараметрыЗакрытия = Новый Структура("ЗаполнитьНачисленияPM");
    Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
    
    ОчиститьСообщения();
    Результат = ПроверитьЗаполнениеТаблицы();
    
    Если НЕ Результат.Ошибки = Неопределено Тогда
        
        ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Результат.Ошибки);
        
        ДополнительныеПараметры = Новый Структура("Строки", Результат.Строки);
        	
        ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПередСохранениемПроверкаЗаполненияЗавершение", ЭтаФорма, ДополнительныеПараметры);
        ТекстВопроса = НСтр("ru = 'Найдены ошибки заполнения. Продолжить обработку корректно заполненых строк таблицы?'");	
        Кнопки = РежимДиалогаВопрос.ДаНет;	
        	
        ПоказатьВопрос(
            ОписаниеОповещенияОЗавершении,
        	ТекстВопроса,
        	Кнопки
        	);      	                    
            
        Возврат;
        
    КонецЕсли;  
    
    Результат = КомандаСохранитьНаСервере();
    ВывестиРезультатСохраненияПользователю(Результат);    
    
    Оповестить("Обновлено соответствие начислений РМ");
        
КонецПроцедуры

&НаКлиенте
Процедура ПередСохранениемПроверкаЗаполненияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
        
        Строки = ДополнительныеПараметры.Строки;        
        Для Каждого Строка Из Строки Цикл 
        	Строка.Пометка = Ложь;
        КонецЦикла;               
        
        Результат = КомандаСохранитьНаСервере();
        ВывестиРезультатСохраненияПользователю(Результат);
        Оповестить("Обновлено соответствие начислений РМ");
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИПеренести(Команда)
    
    ОчиститьСообщения();
    Результат = ПроверитьЗаполнениеТаблицы();
    
    Если НЕ Результат.Ошибки = Неопределено Тогда
        
        ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Результат.Ошибки);
        
        ДополнительныеПараметры = Новый Структура("Строки", Результат.Строки);
        	
        ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПередСохранениемПроверкаЗаполненияЗавершение", ЭтаФорма, ДополнительныеПараметры);
        ТекстВопроса = НСтр("ru = 'Найдены ошибки заполнения. Продолжить обработку корректно заполненых строк таблицы?'");	
        Кнопки = РежимДиалогаВопрос.ДаНет;	
        	
        ПоказатьВопрос(
            ОписаниеОповещенияОЗавершении,
        	ТекстВопроса,
        	Кнопки
        	);      	                    
            
        Возврат;
        
    КонецЕсли;  
    
    Результат = КомандаСохранитьНаСервере();
    
    Оповестить("Обновлено соответствие начислений РМ");
    
    ПараметрыЗакрытия = Новый Структура("ЗаполнитьНачисленияPM");
    Закрыть(ПараметрыЗакрытия);
    
КонецПроцедуры

&НаСервере
Функция КомандаСохранитьНаСервере()  
    
    Результат = Новый Структура("Сообщения, Ошибки"); 
    
    сч = 0;
    ИмяРегистраСоответствия = ?(УчетВоВнешнейСистеме, "упоСоответствиеВидовНачисленийЗУП_PM", "упоСоответствиеВидовНачисленийERP_PM");
    ИмяИзмерения = ?(УчетВоВнешнейСистеме, "НачислениеЗУП", "НачислениеERP");
    
	ПараметрыОтбора = Новый Структура("Пометка", Истина);
    Найдено = Таблица.НайтиСтроки(ПараметрыОтбора);       
        
    Для Каждого СтрокаНайдено Из Найдено Цикл 
        
        сч = сч + 1;
        СтрокаНайдено.Пометка = Ложь;
        
    	НаборЗаписей = РегистрыСведений[ИмяРегистраСоответствия].СоздатьНаборЗаписей();
        НаборЗаписей.Отбор[ИмяИзмерения].Установить(СтрокаНайдено["Начисление"]);
        
        ЗаписьНабора = НаборЗаписей.Добавить();
        ЗаписьНабора[ИмяИзмерения] = СтрокаНайдено["Начисление"];
        ЗаписьНабора["НачислениеPM"] = СтрокаНайдено["НачислениеPM"];
        
        Попытка
            НаборЗаписей.Записать();        	       
        Исключение
            Инфо = ИнформацияОбОшибке();
            Текст = КраткоеПредставлениеОшибки(Инфо);            
            ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Результат.Ошибки, "", Текст);
        КонецПопытки;
        
    КонецЦикла;
    
    ТекстСообщения = НСтр("ru = 'Выполнено. Обработано строк: %1'");
    ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, сч);
    ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Результат.Сообщения, "", ТекстСообщения);
    
    Возврат Результат;
    
КонецФункции

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
    УстановитьПометкуТаблицы(Истина, "Таблица");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
    УстановитьПометкуТаблицы(Ложь, "Таблица");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьОграничениеТипаНачислений(УчетВоВнешнейСистеме)

    МассивТипов = Новый Массив; 
    
    Если УчетВоВнешнейСистеме Тогда
        МассивТипов.Добавить(Тип("СправочникСсылка.упоНачисленияЗУП"));
    Иначе        
        МассивТипов.Добавить(Тип("ПланВидовРасчетаСсылка.Начисления"));
        МассивТипов.Добавить(Тип("ПланВидовРасчетаСсылка.Удержания"));
    КонецЕсли;  
    
	Возврат Новый ОписаниеТипов(МассивТипов);

КонецФункции 

&НаСервере
Процедура ЗаполнитьТаблицуФормы(Данные)

    СоответствиеНачисленийPM = упоРаспределениеЗарплатыНастройкиСервер.ПолучитьСоответствиеНачисленийPM();
    
    Для Каждого Эл Из Данные Цикл 
        
        НачислениеРМ = СоответствиеНачисленийPM.Получить(Эл);
               
        НоваяСтрока = Таблица.Добавить();               
        НоваяСтрока.Начисление = Эл;        
        НоваяСтрока.НачислениеPM = НачислениеРМ;               
        НоваяСтрока.Пометка = НачислениеРМ = Неопределено;
        НоваяСтрока.ЗапретРедактирования = НЕ НачислениеРМ = Неопределено;
        
    КонецЦикла;                 

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуТаблицы(ЗначениеПометки, ИмяТаблицы, ИмяРеквизита = "Пометка")
    
    ОбратываемаяТаблица = ЭтаФорма[ИмяТаблицы];
    
    Для Каждого СтрокаТаблицы Из ОбратываемаяТаблица Цикл 
    	СтрокаТаблицы[ИмяРеквизита] = ЗначениеПометки;
    КонецЦикла;     
    
КонецПроцедуры    

&НаКлиенте
Функция ПроверитьЗаполнениеТаблицы()   
    
    Результат = Новый Структура("Строки, Ошибки", Новый Массив);
    
    МассивПроверяемыхПолей = Новый Массив;
    МассивПроверяемыхПолей.Добавить( Новый Структура("Имя, Синоним", "Начисление","Начисление") );
    МассивПроверяемыхПолей.Добавить( Новый Структура("Имя, Синоним", "НачислениеPM","Начисление PM") );
    
    НомерСтроки = 0;
    Для Каждого Строка Из Таблица Цикл 
        
        Если НЕ Строка.Пометка Тогда
            НомерСтроки = НомерСтроки + 1;
            Продолжить;
        КонецЕсли;  
        
        СтрокаСОшибкойЗарегестрированна = Ложь;
        
        Для Каждого СвойстваПоля Из МассивПроверяемыхПолей Цикл             
            Если НЕ ЗначениеЗаполнено(Строка[СвойстваПоля.Имя]) Тогда                
                ТекстСообщения = НСтр("ru = 'Не заполнено поле ""%1""'");
                ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СвойстваПоля.Синоним);
                ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Результат.Ошибки,"Таблица[%1]." + СвойстваПоля.Имя,ТекстСообщения,,НомерСтроки);
                
                Если НЕ СтрокаСОшибкойЗарегестрированна Тогда
                    СтрокаСОшибкойЗарегестрированна = Истина;
                    Результат.Строки.Добавить(Строка);
                КонецЕсли;  
            КонецЕсли;
        КонецЦикла;
        
        НомерСтроки = НомерСтроки + 1;
        
    КонецЦикла;                       
    
    Возврат Результат;

КонецФункции 

&НаКлиенте
Процедура ВывестиРезультатСохраненияПользователю(Результат)

	Если НЕ Результат.Ошибки = Неопределено Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Результат.Ошибки);
    КонецЕсли;  
    
    Если НЕ Результат.Сообщения = Неопределено Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Результат.Сообщения);
    КонецЕсли;  

КонецПроцедуры

#КонецОбласти 

