#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УИДСТроки = Параметры.УИДСтроки;	
	Транспорт = Параметры.Транспорт;
	Источник = Параметры.Источник;
	СохраненнаяНастройка = Параметры.Настройка;
	Если СохраненнаяНастройка = Неопределено Тогда
		СохраненнаяНастройка = Новый Структура;	
	КонецЕсли;		
	
	ИмяМодуля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Транспорт, "ИмяМодуляОтправкиСообщений");
	МодульОтправки = Вычислить(ИмяМодуля);
	
	МассивНастроек = МодульОтправки.ПолучитьНастройкиТранспортаДляВидаСобытия();
	
	Для Каждого ЭлементНастроек Из МассивНастроек Цикл
		СтрокаНастройки = ТаблицаНастроек.Добавить();
		СтрокаНастройки.КлючНастройки = ЭлементНастроек.КлючНастройки;
		СтрокаНастройки.ПредставлениеНастройки = ЭлементНастроек.ПредставлениеНастройки;		
		Если СохраненнаяНастройка.Свойство(СтрокаНастройки.КлючНастройки) Тогда
			ЗначениеНастройки = СохраненнаяНастройка[СтрокаНастройки.КлючНастройки];
			СтрокаНастройки.Значение = ЗначениеНастройки.Значение;
			СтрокаНастройки.Кодом = ЗначениеНастройки.Кодом;
			СтрокаНастройки.ВыполняемыйКод = ЗначениеНастройки.ВыполняемыйКод;
			СтрокаНастройки.Использование = ЗначениеНастройки.Использование;
		Иначе
			СтрокаНастройки.Значение = ЭлементНастроек.Значение;
			СтрокаНастройки.Кодом = ЭлементНастроек.Кодом;
			СтрокаНастройки.ВыполняемыйКод = ЭлементНастроек.ВыполняемыйКод;
			СтрокаНастройки.Использование = ЭлементНастроек.Использование;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНастроек

&НаКлиенте
Процедура ТаблицаНастроекВыполняемыйКодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ТаблицаНастроек.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Подсказка = НСтр("ru = '
	|// С помощью дополнительных настроек транспорта можно осуществлять их более тонкую настройку.
	|// Доступные переменные:	""Источник"" - объект, связанный с событием
	|//							""ИсточникДопПараметр"" - дополнительный парметр источника
	|//							""ПараметрыВыполненияКода"" - структура, сгенерированная на основании таблицы ""Параметры выполняемого кода"" 	
	|//							""Результат"" - произвольный тип, переменная в которую необходимо записать значение настройки
	|//'");
			
	ЗаголовокФормыВыполняемогоКода = НСтр("ru = 'Выполняемый код (Определение настройки ""%1"" транспорта ""%2"")'");
	ЗаголовокФормыВыполняемогоКода = СтрШаблон(ЗаголовокФормыВыполняемогоКода, ТекДанные.ПредставлениеНастройки, Транспорт); 
		
	Пар = Новый Структура;
	
	Пар.Вставить("ИмяТабЧасти", "ТаблицаНастроек");
	Пар.Вставить("ВыполняемыйКод", ТекДанные.ВыполняемыйКод);
	Пар.Вставить("Источник", Источник);
	Пар.Вставить("Подсказка", Подсказка);
	Пар.Вставить("ЗаголовокФормы", ЗаголовокФормыВыполняемогоКода);
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаРедактированияКода", Пар, ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаРедактированияКода" Тогда
		
		Если ВыбранноеЗначение.ИмяТабЧасти = "ТаблицаНастроек" Тогда 
			
			ТекДанные = ТаблицаНастроек.НайтиПоИдентификатору(ВыбранноеЗначение.УИстроки);
			
			Если ТекДанные <> Неопределено Тогда
				ТекДанные.ВыполняемыйКод = ВыбранноеЗначение.ВыполняемыйКод;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	Ответ = Новый Структура("УИДСтроки, Настройка", УИДСтроки, Новый Структура);
	
	Для Каждого СтрокаНастройки Из ТаблицаНастроек Цикл
		
		СтруктураНастройки = Новый Структура("КлючНастройки, ПредставлениеНастройки, Использование, Значение, Кодом, ВыполняемыйКод");
		ЗаполнитьЗначенияСвойств(СтруктураНастройки, СтрокаНастройки);
		Ответ.Настройка.Вставить(СтрокаНастройки.КлючНастройки, СтруктураНастройки);
		
	КонецЦикла;
	
	ОповеститьОВыборе(Ответ);
	
КонецПроцедуры

#КонецОбласти
