#Область ОписаниеПеременных

&НаКлиенте
Перем ТекстТ;

&НаКлиенте
Перем СчетчикПопытокПозиционирования;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.упоСписокВыбораПроектов) Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	упоРаботаСФормамиСервер.ДобавитьВызовОтчетовПроектаНаФорму(ЭтаФорма, Элементы.ПодменюОтчеты, "КомандаОтчетаПроекта", "ОткрытьОтчет");
	
	УстановитьНастройкиСписка(Параметры);
	
	УстановитьВидимостьДоступностьЭлементовСервер();				
	
	ЭтоPM_Проф = упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ФормаОбработкаупоДеревоКлючевыхПоказателейПроектаупоСхемаПоказателейПроекта", "Видимость",
		Не ЭтоPM_Проф);
		
	упоИнтеграция.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
			
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Список, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
		
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
		
	УстановитьОтборПоКомпоненту(ОтборПоКомпоненту);
		
	УстановитьГруппировки();
	
	// Примечание: для корректного позиционирования в веб-клиенте определение текущей строки списка 
	// должно идти строго после группировки строк. При нарушении этого порядка элементы группировки 
	// с позиционированием определяются веб-клиентом как пустые группы, и кнопка "Выбрать" 
	// выдает ошибку "Выберите элемент, а не группу!".
	Элементы.Список.ТекущаяСтрока = ?(ЗначениеЗаполнено(упоТекущийПроектПозиционирование), упоТекущийПроектПозиционирование, упоТекущийПроект);
	
	Если Элементы.СписокЭтапов.Видимость И ЗначениеЗаполнено(упоТекущийЭтапПозиционирование) Тогда
		СчетчикПопытокПозиционирования = 0;
		ПодключитьОбработчикОжидания("УстановитьПозиционированиеПоПроектнойЗадаче", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Список, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Список, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Список, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ИзмененСтатусПроекта"
	 ИЛИ ИмяСобытия = "ИзменениеТекущегоПроекта" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Список, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Список, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТЧИКОВ

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// УНИВЕРСАЛЬНЫЕ ОБРАБОТЧИКИ

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П6);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьВидимостьДоступностьЭлементов(ЭтаФорма) 
	ЭтаФорма.Элементы.СкрытьЭтапыПроекта.Пометка = ЭтаФорма.СкрыватьЭтапы;
	ЭтаФорма.Элементы.ГруппаЭтапыПроекта.Видимость = Не ЭтаФорма.СкрыватьЭтапы;	
	
	Видимость = упоИнтеграцияКлиентСервер.ИспользуетсяОтборПоКомпонентамВСпискеПроектов();
	ЭтаФорма.Элементы.ОтборПоКомпоненту.Видимость = Видимость;
КонецФункции

&НаКлиенте
Функция УстановитьОтборЭтаповПоТекущемуПроекту() 
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Проект = Неопределено;
	
	Если ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.Проекты") Тогда
		
		Проект = ТекСтрока;				
					
		ЭлементыОтбора = СписокЭтапов.КомпоновщикНастроек.Настройки.Отбор.Элементы;								
		
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОсновнойОтборПоПроекту" Тогда
				ЭлементОтбора.ПравоеЗначение = Проект;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Проект) И Не СкрыватьЭтапы Тогда
			Элементы.СписокЭтапов.Развернуть(Проект, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьВерсиюВПараметрыСпискаЭтапов(Проект);

КонецФункции

&НаСервере
Функция УстановитьОтборЭтаповПоПроекту(Проект) 
	
	ЭлементыОтбора = СписокЭтапов.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Представление = "ОсновнойОтборПоПроекту" Тогда
			ЭлементОтбора.ПравоеЗначение = Проект;			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура БыстрыйПоискПриИзменении(Элемент)
	УстановитьБыстрыйОтбор(БыстрыйПоиск); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБыстрыйОтбор(пСтрокаОтбора) 
    
    ГруппаОтбора = Неопределено;
	СтрокаОтбора = СокрЛП(пСтрокаОтбора);
	Использование = ЗначениеЗаполнено(СтрокаОтбора);
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") 
			И ЭлементОтбора.Представление = "БыстрыйПоиск" 
			И ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			
			ГруппаОтбора = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
    
    Если ГруппаОтбора = Неопределено Тогда
        Возврат;	
    КонецЕсли;
    
	ГруппаОтбора.Использование = Использование;
	Если Использование Тогда
		Для Каждого ЭлементОтбора Из ГруппаОтбора.Элементы Цикл
			ЭлементОтбора.ПравоеЗначение = СтрокаОтбора;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроектЭтапа(ПроектнаяЗадача)
	
	ПроектЭтапа = Справочники.Проекты.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Проекты.Ссылка
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.СсылкаНаПроектнуюЗадачу = &СсылкаНаПроектнуюЗадачу";
		
	Запрос.УстановитьПараметр("СсылкаНаПроектнуюЗадачу", ПроектнаяЗадача);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
        ПроектЭтапа = Выборка.Ссылка;
	КонецЕсли;  
	
	Возврат ПроектЭтапа;
	
КонецФункции //ПолучитьПроектЭтапа

&НаКлиенте
Функция ВывестиПредупреждение(ТекстПредупреждения, Таймаут = 0, Заголовок = "Предупреждение",
						   СписокПараметровЖурнала = Неопределено)

	ТекстПредупреждения = НСтр("ru = '"+ ТекстПредупреждения +"'");
	упоРаботаСДиалогамиКлиент.упоПредупреждение(ТекстПредупреждения, Таймаут, Заголовок);

КонецФункции

&НаКлиенте
Процедура ОтборПоКомпонентуПриИзменении(Элемент)
	
	УстановитьОтборПоКомпоненту(ОтборПоКомпоненту);
	УстановитьГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКомпоненту(ЗначениеОтбора)
	
	Использование = ЗначениеЗаполнено(ЗначениеОтбора);
	ЭлементОтбора = Неопределено;
	ЕстьОтборПоКомпоненту = Ложь;
	
	// Поиск в фиксированных настройка
	ПолеКомпонент = Новый ПолеКомпоновкиДанных("Компонент");
	ЭлементыОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпонент Тогда
			
			ЕстьОтборПоКомпоненту = Истина;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьОтборПоКомпоненту Тогда 
		ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
				И ЭлементОтбора.Представление = "ОтборПоКомпоненту" 
				И ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
				
				ЕстьОтборПоКомпоненту = Истина;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьОтборПоКомпоненту Тогда
		ЭлементОтбора.Использование = Использование;	
		Если Использование Тогда
			ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;		
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГруппировки()

	Список.Группировка.Элементы.Очистить();
		
	Если Не (упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Корп() 
		И ОтборПоКомпоненту = ПредопределенноеЗначение("Перечисление.упоКомпоненты.ПрограммаПроектов")) Тогда
		
		НоваяГруппировка = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НоваяГруппировка.Использование = Истина;
		НоваяГруппировка.Поле = Новый ПолеКомпоновкиДанных("ПортфельПроектов");;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВерсиюВПараметрыСпискаЭтапов(Проект)
	
	ТекВерсия = Неопределено;
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;	
	
	СписокЭтапов.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяВерсия",	ТекВерсия);	
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьПозиционированиеПоПроектнойЗадаче() 
	
	Если НЕ Элементы.СписокЭтапов.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	// При медленном получении данных установка позиционирования может приводить к зависанию списка. 
	// Если позиционирования не произошло за установленный таймаут (20) попыток, то прекращаем попытки.
	СчетчикПопытокПозиционирования = СчетчикПопытокПозиционирования + 1;
	Если СчетчикПопытокПозиционирования > 20 Тогда
		Возврат;
	КонецЕсли;	
	
	ПоследнийРодитель = Неопределено;
	ПозицияВСписке = упоТекущийЭтапПозиционированиеРаскрыть.Количество()-1;
	Пока ПозицияВСписке >= 0 Цикл
		ЭлементСписка = упоТекущийЭтапПозиционированиеРаскрыть[ПозицияВСписке];
		Если Не Элементы.СписокЭтапов.Развернут(ЭлементСписка.Значение) Тогда
			Элементы.СписокЭтапов.Развернуть(ЭлементСписка.Значение, Ложь);
		КонецЕсли;
		Если Не Элементы.СписокЭтапов.Развернут(ЭлементСписка.Значение) Тогда
			ПодключитьОбработчикОжидания("УстановитьПозиционированиеПоПроектнойЗадаче", 0.1, Истина);	
		КонецЕсли;
		ПоследнийРодитель = ЭлементСписка.Значение;
		ПозицияВСписке = ПозицияВСписке - 1;
	КонецЦикла;
	
	Элементы.СписокЭтапов.ТекущаяСтрока = упоТекущийЭтапПозиционирование;
	
	Если Элементы.СписокЭтапов.ТекущаяСтрока = Неопределено И ПоследнийРодитель <> Неопределено Тогда
		Элементы.СписокЭтапов.ТекущаяСтрока = ПоследнийРодитель;
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиСвязанныйЭлемент(Элемент) 
	Возврат упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(Элемент);
КонецФункции

&НаСервере
Процедура УстановитьНастройкиСписка(Параметры)
	
	СкрыватьЭтапы = Истина;
	ПроектОтбора = Неопределено;
	
	ЭтоФормаВыбораПроектнойЗадачиКакПроекта = Параметры.Свойство("ЭтоФормаВыбораПроектнойЗадачиКакПроекта") И Параметры.ЭтоФормаВыбораПроектнойЗадачиКакПроекта;
	ЭтоФормаВыбораПроектнойЗадачи = ЭтоФормаВыбораПроектнойЗадачиКакПроекта ИЛИ (Параметры.Свойство("ЭтоФормаВыбораПроектнойЗадачи") И Параметры.ЭтоФормаВыбораПроектнойЗадачи);
	ВыбиратьЗадачиИПроекты = Параметры.Свойство("ВыбиратьЗадачиИПроекты") И Параметры.ВыбиратьЗадачиИПроекты;
		
	Если ЭтоФормаВыбораПроектнойЗадачи Тогда
		
		Если Параметры.Свойство("ЭтоФормаВыбораПроектнойЗадачиКонкретногоПроекта") Тогда
			
			Параметры.Отбор.Свойство("Проект", ПроектОтбора);
			Если Не ЗначениеЗаполнено(ПроектОтбора) Тогда
				Параметры.Отбор.Свойство("упоКорневойПроект", ПроектОтбора);
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(ПроектОтбора) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Выберите сначала проект'");
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
				Возврат;
				
			КонецЕсли;
			Элементы.Список.Видимость = Ложь;
			ЭтаФорма.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
			Элементы.Группа1.Видимость = Ложь;
			УстановитьОтборЭтаповПоПроекту(ПроектОтбора);
		КонецЕсли;
		
		СкрыватьЭтапы = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущаяСтрока") И ТипЗнч(Параметры.ТекущаяСтрока) = Тип("ДокументСсылка.упоПроектнаяЗадача")
		И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		
		упоТекущийПроектПозиционирование = Параметры.ТекущаяСтрока.Проект;
		упоТекущийЭтапПозиционирование	 = ПолучитьПроектЭтапа(Параметры.ТекущаяСтрока);
				
	ИначеЕсли Параметры.Свойство("ТекущаяСтрока") И ТипЗнч(Параметры.ТекущаяСтрока) = Тип("СправочникСсылка.Проекты") Тогда   
		
		Если ЭтоФормаВыбораПроектнойЗадачиКакПроекта Тогда
			упоТекущийПроектПозиционирование = ?(ЗначениеЗаполнено(Параметры.ТекущаяСтрока), 
				Параметры.ТекущаяСтрока.упоКорневойПроект, ПроектОтбора);
			упоТекущийЭтапПозиционирование = Параметры.ТекущаяСтрока;
		Иначе
			упоТекущийПроектПозиционирование = Параметры.ТекущаяСтрока;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(упоТекущийЭтапПозиционирование) Тогда
		РаскрытьЭтап = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(упоТекущийЭтапПозиционирование, "Родитель"); 
		Пока ЗначениеЗаполнено(РаскрытьЭтап) Цикл
			упоТекущийЭтапПозиционированиеРаскрыть.Добавить(РаскрытьЭтап);
			РаскрытьЭтап = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РаскрытьЭтап, "Родитель");
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора Тогда
		ЭтоФормаВыбора = Истина;
		СкрыватьЭтапы = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("СкрыватьЭтапы") И Параметры.СкрыватьЭтапы Тогда
		СкрыватьЭтапы = Истина;
	КонецЕсли;
	
	// Отключение режима выбора для основного списка проектов, если должна выбираться проектная задача.
	// (список проектов только для уточнения выбора ПЗ)
	Если ЭтоФормаВыбора И (Не ЭтоФормаВыбораПроектнойЗадачи ИЛИ ВыбиратьЗадачиИПроекты) Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоФормаВыбораПроекта") И НЕ ВыбиратьЗадачиИПроекты Тогда
		СкрыватьЭтапы = Истина;
		Элементы.СкрытьЭтапыПроекта.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Проект") Тогда
		ОтборПоПроекту = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоПроекту.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
		ОтборПоПроекту.ПравоеЗначение = Параметры.Проект;
		Если Параметры.Свойство("ИсключитьПроект") Тогда
			Если ТипЗнч(Параметры.Проект) = Тип("Массив") Тогда
				ОтборПоПроекту.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
			Иначе
				ОтборПоПроекту.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			КонецЕсли;	
		Иначе	
			Если ТипЗнч(Параметры.Проект) = Тип("Массив") Тогда
				ОтборПоПроекту.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				Если Не ЗначениеЗаполнено(упоТекущийПроектПозиционирование) Тогда
					упоТекущийПроектПозиционирование = Параметры.Проект;	
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОтбораПроекта") Тогда
		Заголовок = "" + Параметры.ВидОтбораПроекта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(упоТекущийПроектПозиционирование) Тогда
		упоТекущийПроект = упоТекущийПроектПозиционирование;
	Иначе
		упоТекущийПроект = ПараметрыСеанса.упоТекущийПроект;
	КонецЕсли;
	
	ОтборПоКомпоненту = Перечисления.упоКомпоненты.Проект;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Корп() Тогда
		
		Если Параметры.Свойство("ОтборПоКомпоненту") Тогда
			ОтборПоКомпоненту = Параметры.ОтборПоКомпоненту;
		Иначе
			
			КомпонентТекущегоПроекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(упоТекущийПроект, "Компонент", Истина);
			Если ЗначениеЗаполнено(КомпонентТекущегоПроекта) Тогда
				ОтборПоКомпоненту = КомпонентТекущегоПроекта;
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ОтборПоКомпоненту.ТолькоПросмотр = Параметры.Свойство("ОтборПоКомпоненту");
		
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ЭтоПроектнаяЗадача") Тогда
		 Параметры.Отбор.Удалить("ЭтоПроектнаяЗадача");
	КонецЕсли;
	
	Если упоИнтеграцияВызовСервера.ЭтоERPУХ() Тогда
		Если Параметры.Отбор.Свойство("Проект") И ТипЗнч(Параметры.Отбор.Свойство("Проект")) = Тип("Булево") Тогда
			Параметры.Отбор.Удалить("Проект");
		КонецЕсли;
	КонецЕсли;

	УстановитьВерсиюВПараметрыСпискаЭтапов(упоТекущийПроект);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовСервер()
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ИмяКнопкиДеревоКП = "ФормаОбработкаупоДеревоКлючевыхПоказателейПроектаупоСхемаПоказателейПроекта";	
		Если Элементы.Найти(ИмяКнопкиДеревоКП) <> Неопределено Тогда	
			Элементы[ИмяКнопкиДеревоКП].Видимость = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиКомандФормы
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаСделатьТекущим(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.Свойство("Проект") Тогда
		упоПроектыИЗадачиКлиент.УстановитьПроектТекущим(ТекДанные.Проект, ЭтаФорма);
	Иначе
		ВывестиПредупреждение("Команда не может быть выполнена для указанного объекта!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЭтапыПроекта(Команда)
	
	СкрыватьЭтапы = НЕ СкрыватьЭтапы;
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНастройкиСписка(Команда)
		
	СписокОтбор = Неопределено;
	Для каждого ЭлементПользовательскихНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементПользовательскихНастроек) = Тип("ОтборКомпоновкиДанных") Тогда
			СписокОтбор = ЭлементПользовательскихНастроек;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ СписокОтбор = Неопределено Тогда
		
		Сч = СписокОтбор.Элементы.Количество() - 1;
		Пока Сч >= 0 Цикл 
			ЭлементОтбора = СписокОтбор.Элементы[Сч];
			Если НЕ (ЭлементОтбора.Представление = "БыстрыйПоиск"
				И ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный) Тогда
				СписокОтбор.Элементы.Удалить(ЭлементОтбора);
			КонецЕсли;
			Сч = Сч - 1;	
		КонецЦикла;
		
	КонецЕсли;
	
	Список.УсловноеОформление.Элементы.Очистить();
	Список.Порядок.Элементы.Очистить();
	Список.Группировка.Элементы.Очистить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КНОПОК КОМАНДНОЙ ПАНЕЛИ ФОРМЫ

&НаКлиенте
Функция ОткрытьОтчет(Команда) 
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.Свойство("Проект") Тогда
		упоРаботаСФормамиКлиент.ОткрытьОтчетПроектаПоСлужебнойКоманде(Этаформа, Команда, "КомандаОтчетаПроекта", ТекДанные.Проект);
	Иначе
		ВывестиПредупреждение("Команда не может быть выполнена для указанного объекта!");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЭкспортВMSProject(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.Свойство("Проект") Тогда
		упоЭкспортMSProjectКлиент.ЭкспортВMSProjectКлиент(ТекДанные.Проект);
	Иначе
		ВывестиПредупреждение(НСтр("ru = 'Команда не может быть выполнена для указанного объекта!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортИзMSProject(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.Свойство("Проект") Тогда
		ОткрытьФорму("Обработка.упоИмпортИзMSP.Форма", Новый Структура("Проект", ТекДанные.Проект));
	Иначе
		ВывестиПредупреждение(НСтр("ru = 'Команда не может быть выполнена для указанного объекта!'"));
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область ОбработчикиСобытийСписок

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ СПИСКА

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборЭтаповПоТекущемуПроекту",1,Истина);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭтаповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭтоФормаВыбора Тогда
		СтандартнаяОбработка = Ложь;
		Если ЭтоФормаВыбораПроектнойЗадачи И НЕ ЭтоФормаВыбораПроектнойЗадачиКакПроекта Тогда
			ОповеститьОВыборе(НайтиСвязанныйЭлемент(ВыбраннаяСтрока));
		ИначеЕсли ЭтоФормаВыбораПроектнойЗадачиКакПроекта Тогда
			ТекущиеДанныеЭтапа = Элементы.СписокЭтапов.ТекущиеДанные;
			
			Если ТекущиеДанныеЭтапа = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Если ТекущиеДанныеЭтапа.ЭтоПроектнаяЗадача Тогда 
				ОповеститьОВыборе(ВыбраннаяСтрока);
			КонецЕсли;
		Иначе
			ОповеститьОВыборе(ВыбраннаяСтрока);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭтоФормаВыбора Тогда
		Если НЕ ЭтоФормаВыбораПроектнойЗадачи Тогда
			СтандартнаяОбработка = Ложь;
			ОповеститьОВыборе(ВыбраннаяСтрока);
		КонецЕсли;
	Иначе
		Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(, ВыбраннаяСтрока.Ключ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ Копирование И НЕ Группа Тогда
		Отказ = Истина;
		Основание = Новый Структура;
		Основание.Вставить("Наименование", БыстрыйПоиск);
		Основание.Вставить("Компонент", ОтборПоКомпоненту);
		ПараметрыНового = Новый Структура;
		ПараметрыНового.Вставить("Основание", Основание);
		ОткрытьФорму("Справочник.Проекты.ФормаОбъекта", ПараметрыНового, Элементы.Список);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

