////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции общего назначения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает данные по запросу из динамического списка.
//
// Параметры:
//  ДинамическийСписок	 - ДинамическийСписок - 
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица с результатами запроса.
//
Функция ПолучитьДанныеДинамическогоСписка(ДинамическийСписок) Экспорт
	
	ТекстЗапроса = ?(ЗначениеЗаполнено(ДинамическийСписок.ТекстЗапроса),
					ДинамическийСписок.ТекстЗапроса,
					"ВЫБРАТЬ * ИЗ " + ДинамическийСписок.ОсновнаяТаблица);
						
	ПостроительОтчета = Новый ПостроительОтчета(ТекстЗапроса);
	ПостроительОтчета.ЗаполнитьНастройки();
	
	ОтборыСписка = ДинамическийСписок.Отбор.Элементы;
	Для Каждого текОтборСписка Из ОтборыСписка Цикл
		
		Если Не текОтборСписка.Использование Тогда 
			Продолжить; 
		КонецЕсли;
		ОтборПостроителя = ПостроительОтчета.Отбор.Добавить("" + текОтборСписка.ЛевоеЗначение);
		ОтборПостроителя.Использование = текОтборСписка.Использование;
		ЗаполнитьЗначенияСвойств(ОтборПостроителя, ПолучитьВидСравненияИЗначениеПостроителяПоСКД(текОтборСписка));
		
	КонецЦикла;	
	
	Для Каждого Параметр Из ДинамическийСписок.Параметры.Элементы Цикл
		ИмяПараметра = Строка(Параметр.Параметр);
		ЗначениеПараметра = Параметр.Значение;
		ПостроительОтчета.Параметры.Вставить(ИмяПараметра, ЗначениеПараметра);			
	КонецЦикла;
	
	ПостроительОтчета.Выполнить();
	
	Возврат ПостроительОтчета.Результат.Выгрузить();
	
КонецФункции

// Получает имя пользователя ИБ.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, для которого надо найти соответствующего
//					пользователя ИБ.
//
// Возвращаемое значение:
//	 ПользовательИнформационнойБазы, Неопределено - найденный пользователь ИБ.
//
Функция ПолучитьИмяПользователяИБ(Пользователь) Экспорт
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
	Если ПользовательИБ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПользовательИБ.Имя;
	
КонецФункции

// Сворачивает таблицу движений регистра по измерениям.
//
// Параметры:
//  ТаблицаДвижений	 - ТаблицаЗначений 	- таблица движений регистра.
//  ИмяРегистра		 - Строка 			- имя регистра.
//  РеквизитКакИзмерение - Булево 		- признак добавления реквизитов регистра в поля свертки.
//  СворачиватьПоПериоду - Булево 		- признак включения/исключения поля Период из полей свертки таблицы.
//
Процедура СвернутьТаблицуДвижений(ТаблицаДвижений, ИмяРегистра, РеквизитКакИзмерение = Ложь, СворачиватьПоПериоду = Истина) Экспорт

	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиТаблицы = ТаблицаДвижений.Колонки;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];	
	ЭтоПериодическийРегистр = МетаданныеРегистра.ПериодичностьРегистраСведений 
			<> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
	
	МассивИзмерений = Новый Массив;
	Если ЭтоПериодическийРегистр И Не СворачиватьПоПериоду Тогда
		МассивИзмерений.Добавить("Период");
	КонецЕсли;
	ДобавитьВМассивОбщиеПоляРегистраИТаблицы(МассивИзмерений, КолонкиТаблицы, МетаданныеРегистра.Измерения);
	Если РеквизитКакИзмерение Тогда
		ДобавитьВМассивОбщиеПоляРегистраИТаблицы(МассивИзмерений, КолонкиТаблицы, МетаданныеРегистра.Реквизиты);
	КонецЕсли;	
	
	МассивРесурсов = Новый Массив;
	ДобавитьВМассивОбщиеПоляРегистраИТаблицы(МассивРесурсов, КолонкиТаблицы,  МетаданныеРегистра.Ресурсы);
		
	ТаблицаДвижений.Свернуть(СтрСоединить(МассивИзмерений, ","), СтрСоединить(МассивРесурсов, ","));
	
	// Стандартные реквизиты.
	Если КолонкиТаблицы.Найти("Период") = Неопределено И ЭтоПериодическийРегистр Тогда 
		КолонкиТаблицы.Добавить("Период", МетаданныеРегистра.СтандартныеРеквизиты.Период.Тип);
	КонецЕсли;						
	Если КолонкиТаблицы.Найти("Регистратор") = Неопределено
		И МетаданныеРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда		
		КолонкиТаблицы.Добавить("Регистратор", МетаданныеРегистра.СтандартныеРеквизиты.Регистратор.Тип);			
	КонецЕсли;	
	Если КолонкиТаблицы.Найти("Активность") = Неопределено Тогда
		КолонкиТаблицы.Добавить("Активность", Новый ОписаниеТипов("Булево"));
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	КонецЕсли;
	
КонецПроцедуры

// Получает таблицу значений из табличного документа.
//
// Параметры:
//  ТабличныйДокумент							 - ТабличныйДокумент - таб. док.
//  ФлагПерваяСтрокаСодержитИменаКолонок		 - Булево			 - признак того, что первая строка табличного документа
//													содержит имена колонок.
//  ФлагПытатьсяПолучитьЗначениеТипаБулевоИЧисло - Булево			 - признак того, что необходимо попытаться конвертировать
//													значения в ячейке табличного документа в булево или число при заполнении
//													таблицы значений.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица, полученная из табличного документа.
//
Функция ПолучитьТЗизТабличногоДокумента(ТабличныйДокумент,
										ФлагПерваяСтрокаСодержитИменаКолонок = Истина,
										ФлагПытатьсяПолучитьЗначениеТипаБулевоИЧисло = Истина) Экспорт
	
	Высота = ТабличныйДокумент.ВысотаТаблицы;
	Ширина = ТабличныйДокумент.ШиринаТаблицы;
	
	Таблица = Новый ТаблицаЗначений;
	                                                                     
	СоответствиеПолейИКолонок = Новый Соответствие;
	сч_к = 1;                                         
	Пока сч_к <= Ширина Цикл
		Если ФлагПерваяСтрокаСодержитИменаКолонок Тогда
			ИмяКолонки = Строка(ТабличныйДокумент.Область(1, сч_к).Текст);
			ИмяКолонки = СтрЗаменить(ИмяКолонки, "-", "_");
			ИмяКолонки = СтрЗаменить(ИмяКолонки, " ", "_");
		Иначе
			ИмяКолонки = "Колонка"+сч_к;
		КонецЕсли;
		Попытка
			Колонка = Таблица.Колонки.Добавить(ИмяКолонки);
		Исключение
			Колонка = Таблица.Колонки.Добавить("Колонка"+сч_к);
		КонецПопытки;			
		СоответствиеПолейИКолонок.Вставить(Колонка.Имя, сч_к);
		сч_к = сч_к + 1;
	КонецЦикла;
	
	Если ФлагПерваяСтрокаСодержитИменаКолонок Тогда
		сч_с = 2;
	Иначе
		сч_с = 1;
	КонецЕсли;
	
	Пока сч_с <= Высота Цикл
		
		СтрокаТаблицы = Таблица.Добавить();
		
		Для Каждого КлючЗначение Из СоответствиеПолейИКолонок Цикл
			ТекстЯчейки = Строка(ТабличныйДокумент.Область(сч_с, КлючЗначение.Значение).Текст);
			Если ЗначениеЗаполнено(ТекстЯчейки) Тогда
				Если ФлагПытатьсяПолучитьЗначениеТипаБулевоИЧисло Тогда
					СтрокаТаблицы[КлючЗначение.Ключ] = ВернутьЗначениеЯчейки(ТекстЯчейки);	
				Иначе
					СтрокаТаблицы[КлючЗначение.Ключ] = ТекстЯчейки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	 
		
		сч_с = сч_с+1;
	КонецЦикла;	
	
	Возврат Таблица;
	
КонецФункции

// Выгружает дерево значений в таблицу значений.
//
// Параметры:
//  Дерево							 - ДеревоЗначений - выгружаемое дерево.
//  Таблица							 - ТаблицаЗначений, Неопределено - если передана таблица значений, то добавляет в нее строки.
//										Если неопределено, то возвращает тоблицу значений, сформированную в теле функции.
//  ИсключатьЭлементыИерархииПоПолю	 - Строка, Неопределено - если указана строка, то ищется имя поля,
//										по которому необходимо исключить элементы, в т.ч. и подчиненные.
//
// Возвращаемое значение:
//	ТаблицаЗначений - сформированная таблица.
//
Функция ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево,
												Таблица = Неопределено,
												ИсключатьЭлементыИерархииПоПолю = Неопределено) Экспорт

    Если Таблица = Неопределено Тогда
        Таблица = Новый ТаблицаЗначений;
        Для Каждого Колонка Из Дерево.Колонки Цикл
            Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
        КонецЦикла;
    КонецЕсли;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Если ИсключатьЭлементыИерархииПоПолю <> Неопределено И ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") Тогда
			Если СтрокаДерева[ИсключатьЭлементыИерархииПоПолю] = Дерево[ИсключатьЭлементыИерархииПоПолю] Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
        ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
        ВыгрузитьДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица, ИсключатьЭлементыИерархииПоПолю);
    КонецЦикла;
	
	Возврат Таблица;

КонецФункции 

// На основании таблицы знаечний формрует дерево значений (версия 3).
//
// Параметры:
//  П_ТЗ								 - ТаблицаЗначений 	- таблица, на основании которой надо сформировать дерево значений.
//  ПМассивУровней						 - Массив 			- массив строк с именами уровней, на основании корого определяется основное поле
//											нижнего уровня и строится массив колонок группировок.
//  ПСтруктураУровнейСИерархией			 - Структура 		- набор имен полей, по которым будет идти итоговая группировка
//											в запросе для построения дерева.
//  ПМассивСуммируемыхКолонок			 - Массив 			- имена полей, которые будут участвовать в итогах запроса для построения
//											дерева.
//  ПИмяПоляГруппировки					 - Строка 			- имя поля группировки.
//  ПИмяПоляДляЗаписиИмениГруппировки	 - Строка 			- имя поля для записи группировки.
//  НадоГруппироватьНижнийУровень		 - Булево 			- признак необходимости группировать нижний уровень.
//  ПОтборДляСуммГруппировок			 - Строка, Неопределено - поля, используемые для формирования блока итогов в запросе.
//  ПМассивМаксимумКолонок				 - Массив 			- добавляет поля МАКСИМУМ в итоговые поля запроса.
//
// Возвращаемое значение:
//	ДеревоЗначений - сформированное дерево.
//
Функция ПолучитьДеревоПоТЗ_V3(П_ТЗ,
							  ПМассивУровней,
							  ПСтруктураУровнейСИерархией = Неопределено,
							  ПМассивСуммируемыхКолонок,
							  ПИмяПоляГруппировки = "Группировка",
							  ПИмяПоляДляЗаписиИмениГруппировки = "ИмяГруппировки",
							  НадоГруппироватьНижнийУровень = Ложь,
							  ПОтборДляСуммГруппировок = Неопределено,
							  ПМассивМаксимумКолонок = Неопределено) Экспорт
		
	КоличествоЗаписейМассивУровней = ПМассивУровней.Количество();
	Если КоличествоЗаписейМассивУровней = 1 Тогда
		МассивКолонокГруппировок = ПМассивУровней;
		ОсновноеПолеНижнегоУровня = ПМассивУровней[0];
	Иначе
		ОсновноеПолеНижнегоУровня = ПМассивУровней[КоличествоЗаписейМассивУровней-1];
		сч = 0;
		МассивКолонокГруппировок = Новый Массив;
		Пока сч < КоличествоЗаписейМассивУровней-1 Цикл
			МассивКолонокГруппировок.Добавить(ПМассивУровней[сч]);
			сч = сч + 1;
		КонецЦикла;
	КонецЕсли;
	
	НаборИменПолейГруппировок = "";
	НаборИменПолей = "";
	НаборПолейИменСумм = "";
	
	ПрефиксТЧ = "ТаблицаВходящихДанных";
	
	МассивДопРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из П_ТЗ.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если МассивКолонокГруппировок.Найти(ИмяКолонки) <> 
				Неопределено ИЛИ ПМассивСуммируемыхКолонок.Найти(ИмяКолонки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивДопРеквизитов.Добавить(ИмяКолонки);
	КонецЦикла;
	
	ПервыйЭлемент = Истина;	
	Для Каждого ИмяКолонкиГруппировки Из МассивКолонокГруппировок Цикл
		Если Не ПервыйЭлемент Тогда
			НаборИменПолейГруппировок = НаборИменПолейГруппировок + ", ";	
			НаборИменПолей = НаборИменПолей + ", ";	
		Иначе
			ПервыйЭлемент = Ложь;
		КонецЕсли;
		НаборИменПолейГруппировок = НаборИменПолейГруппировок + ИмяКолонкиГруппировки;
		НаборИменПолей = НаборИменПолей + ПрефиксТЧ + "."+ИмяКолонкиГруппировки;
	КонецЦикла;
	
	ПервыйЭлемент = Истина;	
	НаборИменПолейТЧ1 = НаборИменПолей;
	НаборИменПолейТЧ2 = НаборИменПолей;
	
	НаборИменПолейГруппировокИТОГИ = НаборИменПолейГруппировок;
	
	Для Каждого ИмяКолонки Из МассивДопРеквизитов Цикл
		НаборИменПолейГруппировок = НаборИменПолейГруппировок + ", " + ИмяКолонки;
		СтрокаИменПолей =  ", " + ПрефиксТЧ + "."+ИмяКолонки;	
		НаборИменПолейТЧ1 = НаборИменПолейТЧ1 + СтрокаИменПолей;	
		НаборИменПолейТЧ2 = НаборИменПолейТЧ2 + СтрокаИменПолей;	
	КонецЦикла;
	
	Для Каждого ИмяКолонкиСуммы Из ПМассивСуммируемыхКолонок Цикл
		Если Не ПервыйЭлемент Тогда
			НаборПолейИменСумм = НаборПолейИменСумм + ", ";	
		Иначе
			ПервыйЭлемент = Ложь;
		КонецЕсли;
			
		Если ПОтборДляСуммГруппировок = Неопределено Тогда
			НаборПолейИменСумм = НаборПолейИменСумм + "СУММА(" + ИмяКолонкиСуммы+")";
		Иначе
			НаборПолейИменСумм = НаборПолейИменСумм + "СУММА(ВЫБОР КОГДА " + 
				ПОтборДляСуммГруппировок + " ТОГДА " + ИмяКолонкиСуммы+" ИНАЧЕ 0 КОНЕЦ) КАК " + ИмяКолонкиСуммы;
		КонецЕсли;		
		
		Если НадоГруппироватьНижнийУровень Тогда
			НаборИменПолейТЧ2 = НаборИменПолейТЧ2 + ", СУММА(" + ПрефиксТЧ + "."+ИмяКолонкиСуммы+") КАК "+ИмяКолонкиСуммы;
		Иначе
			НаборИменПолейТЧ2 = НаборИменПолейТЧ2 + ", " + ПрефиксТЧ + "."+ИмяКолонкиСуммы+" КАК "+ИмяКолонкиСуммы;
		КонецЕсли;
		НаборИменПолейТЧ1 = НаборИменПолейТЧ1 + ", " + ПрефиксТЧ + "."+ИмяКолонкиСуммы;
	КонецЦикла;
	
	Если ПМассивМаксимумКолонок <> Неопределено Тогда
		Для Каждого ИмяКолонкиМаксимум Из ПМассивМаксимумКолонок Цикл
			НаборПолейИменСумм = НаборПолейИменСумм + ", МАКСИМУМ(" + ИмяКолонкиМаксимум + ")";		
		КонецЦикла; 		
	КонецЕсли; 
	
	Если ПСтруктураУровнейСИерархией <> Неопределено Тогда
		Для Каждого КлючЗначение Из ПСтруктураУровнейСИерархией Цикл
			НаборИменПолейГруппировокИТОГИ = СтрЗаменить(НаборИменПолейГруппировокИТОГИ,
				КлючЗначение.Ключ, КлючЗначение.Ключ + " " + КлючЗначение.Значение); 
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	"+НаборИменПолейТЧ1+"
		|ПОМЕСТИТЬ ТаблицаВходящихДанных
		|ИЗ
		|	&ВходящиеДанные КАК ТаблицаВходящихДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	"+НаборИменПолейТЧ2+"
		|ИЗ
		|	ТаблицаВходящихДанных КАК ТаблицаВходящихДанных" +
		?(НадоГруппироватьНижнийУровень, "
		|СГРУППИРОВАТЬ ПО
		|	"+НаборИменПолейГруппировок, "
		| ") + "
		|УПОРЯДОЧИТЬ ПО
		|	"+НаборИменПолейГруппировок+"
		|ИТОГИ
		|	"+НаборПолейИменСумм+"
		|ПО
		|	"+НаборИменПолейГруппировокИТОГИ+"
		|";
		
	Запрос.УстановитьПараметр("ВходящиеДанные", П_ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Дерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из П_ТЗ.Колонки Цикл
		Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	ВыборкаВерхнегоУровня = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтрокаДопРеквизитов = "";
	Для Каждого ДопРеквизит Из МассивДопРеквизитов Цикл
		СтрокаДопРеквизитов = СтрокаДопРеквизитов + ?(ЗначениеЗаполнено(СтрокаДопРеквизитов), ", ", "") + ДопРеквизит;
	КонецЦикла;
	
	ВставитьКолонку(Дерево, 0, ПИмяПоляГруппировки);
	ДобавитьКолонкуВТаблицу(Дерево, ПИмяПоляДляЗаписиИмениГруппировки, Новый ОписаниеТипов("Строка"));
	
	РекурсивноПостроитьДерево(ВыборкаВерхнегоУровня,
							  Дерево,
							  МассивКолонокГруппировок,
							  СтрокаДопРеквизитов,
							  ПИмяПоляГруппировки,
							  ПИмяПоляДляЗаписиИмениГруппировки, 
							  ОсновноеПолеНижнегоУровня,
							  ПСтруктураУровнейСИерархией);
	
	Возврат Дерево;
	
КонецФункции

// Вставляет колонку в таблицу значений или дерево.
//
// Параметры:
//  ТаблицаИлиДерево - ТаблицаЗначений, ДеревоЗначений - таблица или дерево, в которое вставляется колонка.
//  ПозицияКолонки	 - Число			- позиция (индекс) добавялемой колонки.
//  ИмяКолонки		 - Строка 			- имя колонки.
//  ОписаниеТипов	 - ОписаниеТипов 	- допустимые типы колонки.
//
Процедура ВставитьКолонку(ТаблицаИлиДерево, ПозицияКолонки, ИмяКолонки, ОписаниеТипов = Неопределено) Экспорт
	
	Колонка = ТаблицаИлиДерево.Колонки.Найти(ИмяКолонки);
	
	Если Колонка = Неопределено Тогда
		Если ОписаниеТипов = Неопределено Тогда
			ТаблицаИлиДерево.Колонки.Вставить(ПозицияКолонки, ИмяКолонки);
		Иначе
			ТаблицаИлиДерево.Колонки.Вставить(ПозицияКолонки, ИмяКолонки, ОписаниеТипов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет колонку в таблицу значений или дерево.
//
// Параметры:
//  ТаблицаИлиДерево - ТаблицаЗначений, ДеревоЗначений - таблица или дерево, в которое вставляется колонка.
//  ИмяКолонки		 - Строка 			- имя колонки.
//  ОписаниеТипов	 - ОписаниеТипов 	- допустимые типы колонки.
//
Процедура ДобавитьКолонкуВТаблицу(ТаблицаИлиДерево, ИмяКолонки, ОписаниеТипов = Неопределено) Экспорт
	
	Колонка = ТаблицаИлиДерево.Колонки.Найти(ИмяКолонки);		
	Если Колонка = Неопределено Тогда
		Если ОписаниеТипов = Неопределено Тогда
			ТаблицаИлиДерево.Колонки.Добавить(ИмяКолонки);
		Иначе
			ТаблицаИлиДерево.Колонки.Добавить(ИмяКолонки, ОписаниеТипов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Загружает дерево значений из источника до определенного уровня, если он указан.
//
// Параметры:
//  Источник	 - ДеревоЗначений, СтрокаДереваЗначений - источник данных для копирования.
//  Назначение	 - ДеревоЗначений, СтрокаДереваЗначений - объект с загруженными из источника данными.
//  ДоУровня	 - Число, Неопределено - если неопределено, то загружается все; иначе - до указанного уровня.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ЗагрузитьДеревоЗначений(Источник, Назначение, ДоУровня = Неопределено) Экспорт
	
	флИдемВГлубь = Истина;
	Если ТипЗнч(Назначение) = Тип("ДеревоЗначений") Тогда
		Назначение.Строки.Очистить();	
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДеревоЗначений") Тогда	
	Иначе
		ЗаполнитьЗначенияСвойств(Назначение, Источник);		
		Если ДоУровня <> Неопределено И Источник.Уровень() = ДоУровня Тогда
			флИдемВГлубь = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если флИдемВГлубь Тогда
		Для Каждого Строка Из Источник.Строки Цикл
			НоваяСтрока = Назначение.Строки.Добавить();
			ЗагрузитьДеревоЗначений(Строка,НоваяСтрока,ДоУровня);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

// Поднимается на указанное число уровней вверх.
//
// Параметры:
//  Строка	 - СтрокаДереваЗначений - исходная строка, от которой надо подняться вверх.
//  Уровней	 - Число 				- количество уровней, на которые надо подняться.
//
// Возвращаемое значение:
//	СтрокаДереваЗначений - строка дерева, полученная после поднятия на определенное число уровней от исходной.
//
Функция ПоднятьсяНаЧислоУровней(Строка, Уровней) Экспорт
	
	Если Уровней > 0 Тогда
		Если Строка.Родитель = Неопределено Тогда
			Возврат Строка.Владелец();
		Иначе	
			Возврат ПоднятьсяНаЧислоУровней(Строка.Родитель, Уровней-1);
		КонецЕсли;
	Иначе
		Возврат Строка;
	КонецЕсли;
	
КонецФункции

// Получает массив строк дерева, находящихся на определенном уровне.
//
// Параметры:
//  ИсходноеДерево	 - ДеревоЗначений, СтрокаДереваЗначений	- дерево.
//  ИмяУровня		 - Строка 								- имя уровня/группировки, строки которого надо получить.
//  МассивСтрок		 - Массив, Неопределено					- если неопределено, то создается новый массив; иначе
//																в переданный массив добавляются строки и он возвращается
//																функцией.
//
// Возвращаемое значение:
//	Массив - массив строк дерева значений.
//
Функция ПолучитьСтрокиУровня(ИсходноеДерево, ИмяУровня, МассивСтрок = Неопределено) Экспорт
	
	Если МассивСтрок = Неопределено Тогда
		МассивСтрок = Новый Массив;
	КонецЕсли;
	
	Для Каждого Строка Из ИсходноеДерево.Строки Цикл
		Если Строка.ИмяГруппировки = ИмяУровня Тогда
			МассивСтрок.Добавить(Строка);
		Иначе
			ПолучитьСтрокиУровня(Строка, ИмяУровня, МассивСтрок);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

// Пересчитывает итоги в дереве значений.
//
// Параметры:
//  Дерево					 - ДеревоЗначений, СтрокаДереваЗначений - дерево, для которого пересчитываются итоги.
//  МассивЧисловыхКолонок	 - Массив - массив имен колонок, для которых надо получить итоги.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ПересчетИтоговДереваЗначений(Дерево, МассивЧисловыхКолонок) Экспорт
	
	Для Каждого Строка Из Дерево.Строки Цикл
		ПересчетИтоговДереваЗначений(Строка, МассивЧисловыхКолонок);
	КонецЦикла;
	
	Если ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") И Дерево.Строки.Количество() Тогда
		Для Каждого ЭлементМассива Из МассивЧисловыхКолонок Цикл
			Дерево[ЭлементМассива] = Дерево.Строки.Итог(ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

// Возвращает цвет в требуемом формате.
//
// Параметры:
//  РИсходныйЦвет  		- Цвет				- исходный объект.                 		 
//  РВидИтоговогоЦвета  - Число  			- вид описания цвета (1 - web-цвет, 2 - RGB, 3 - HEX).
//  ТЦветов  			- ТаблицаЗначений 	- таблица соответствия цветов.                 		
//
// Возвращаемое значение:
//	Цвет - описание цвета в требуемом формате (1 - строка, 2 - Структура(Красный,Синий,Зеленый), 3 - строка).
//
Функция ОписаниеЦвета(РИсходныйЦвет, РВидИтоговогоЦвета, Знач ТЦветов="") Экспорт
	
	Попытка
		
		Если ТипЗнч(РИсходныйЦвет)=Тип("Цвет") Тогда
			
			Если РИсходныйЦвет.Вид=ВидЦвета.ЭлементСтиля Тогда
				
				стрЦвет=ПолучитьЦветИзСтиляПлатформы(РИсходныйЦвет); // Вернет hex, т.е. 16-ричный.
				Если НЕ ПустаяСтрока(стрЦвет) Тогда
					Если РВидИтоговогоЦвета=1 Тогда // Нужен web-цвет.
						Если ТипЗнч(ТЦветов)<>Тип("ТаблицаЗначений") Тогда
							ТЦветов=упоФункцииОбщегоНазначенияКэшируемый.ПрочитатьТаблицуЦветов();
						КонецЕсли;					
						строц=ТЦветов.Найти(стрЦвет,"Шестнадцатиричный");
						Если строц<>Неопределено Тогда 
							Возврат строц.Название;
						КонецЕсли;
					ИначеЕсли РВидИтоговогоЦвета=2 Тогда // Нужен RGB.
						Если ТипЗнч(ТЦветов)<>Тип("ТаблицаЗначений") Тогда
							ТЦветов=упоФункцииОбщегоНазначенияКэшируемый.ПрочитатьТаблицуЦветов();
						КонецЕсли;					
						строц=ТЦветов.Найти(стрЦвет,"Шестнадцатиричный");
						Если строц<>Неопределено Тогда
							Возврат Новый Структура("Красный,Синий,Зеленый",строц.Красный,строц.Синий,строц.Зеленый);
						КонецЕсли;
					ИначеЕсли РВидИтоговогоЦвета=3 Тогда // Нужен 16-ричный.
						Возврат стрЦвет; // Это он и есть.
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли РИсходныйЦвет.Вид=ВидЦвета.WebЦвет Тогда
				
				// Вытащим из скобок англоязычное написание цвета.
				стрЦвет=СокрЛП(Строка(РИсходныйЦвет));
				пози1=Найти(стрЦвет,"(");
				Если пози1<>0 Тогда
					стрЦвет=НРег(СтрЗаменить(Сред(стрЦвет,пози1+1),")",""));
					Если РВидИтоговогоЦвета=1 Тогда // Нужен web-цвет.
						Возврат стрЦвет; // Это он и есть.
					ИначеЕсли РВидИтоговогоЦвета=2 Тогда // Нужен RGB.
						Если ТипЗнч(ТЦветов)<>Тип("ТаблицаЗначений") Тогда
							ТЦветов=упоФункцииОбщегоНазначенияКэшируемый.ПрочитатьТаблицуЦветов(Истина);
						КонецЕсли;					
						строц=ТЦветов.Найти(стрЦвет,"Название");
						Если строц<>Неопределено Тогда
							Возврат Новый Структура("Красный,Синий,Зеленый",строц.Красный,строц.Синий,строц.Зеленый);
						КонецЕсли;
					ИначеЕсли РВидИтоговогоЦвета=3 Тогда // Нужен 16-ричный.
						Если ТипЗнч(ТЦветов)<>Тип("ТаблицаЗначений") Тогда
							ТЦветов=упоФункцииОбщегоНазначенияКэшируемый.ПрочитатьТаблицуЦветов(Истина);
						КонецЕсли;					
						строц=ТЦветов.Найти(стрЦвет,"Название");
						Если строц<>Неопределено Тогда
							Возврат строц.Шестнадцатиричный;
						КонецЕсли;				
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли РИсходныйЦвет.Вид=ВидЦвета.Абсолютный Тогда
				
				Если РВидИтоговогоЦвета=1 Тогда // Нужен web-цвет.
					Если ТипЗнч(ТЦветов)<>Тип("ТаблицаЗначений") Тогда
						ТЦветов=упоФункцииОбщегоНазначенияКэшируемый.ПрочитатьТаблицуЦветов();
					КонецЕсли;					
					отб=Новый Структура("Красный,Синий,Зеленый",РИсходныйЦвет.Красный,РИсходныйЦвет.Синий,РИсходныйЦвет.Зеленый);
					мстроц=ТЦветов.НайтиСтроки(отб);
					Если мстроц.Количество()<>0 Тогда
						Возврат строц.Название;
					КонецЕсли;				
				ИначеЕсли РВидИтоговогоЦвета=2 Тогда // Нужен RGB.
					// Фактически, он и есть.
					Возврат Новый Структура("Красный,Синий,Зеленый",РИсходныйЦвет.Красный,РИсходныйЦвет.Синий,РИсходныйЦвет.Зеленый);
				ИначеЕсли РВидИтоговогоЦвета=3 Тогда // Нужен 16-ричный.
					Если ТипЗнч(ТЦветов)<>Тип("ТаблицаЗначений") Тогда
						ТЦветов=упоФункцииОбщегоНазначенияКэшируемый.ПрочитатьТаблицуЦветов();
					КонецЕсли;					
					отб=Новый Структура("Красный,Синий,Зеленый",РИсходныйЦвет.Красный,РИсходныйЦвет.Синий,РИсходныйЦвет.Зеленый);
					мстроц=ТЦветов.НайтиСтроки(отб);
					Если мстроц.Количество()<>0 Тогда
						Возврат мстроц[0].Шестнадцатиричный;
					КонецЕсли;				
				КонецЕсли;
				
			КонецЕсли; // По вариантам видов цвета как типа Цвет.
			
		ИначеЕсли ТипЗнч(РИсходныйЦвет)=Тип("Строка") Тогда
			
			Если  РВидИтоговогоЦвета=2 Тогда // Нужен RGB.
				Красный = упоФункцииОбщегоНазначенияКлиентСервер.Из_Любой_В_10(Сред(РИсходныйЦвет, 2, 2), 16);
				Синий = упоФункцииОбщегоНазначенияКлиентСервер.Из_Любой_В_10(Сред(РИсходныйЦвет, 6, 2), 16);
				Зеленый = упоФункцииОбщегоНазначенияКлиентСервер.Из_Любой_В_10(Сред(РИсходныйЦвет, 4, 2), 16);
				Возврат Новый Структура("Красный,Синий,Зеленый",Красный,Синий,Зеленый);
			Иначе
				// Ищем во всех колонках таблицы, т.к. заведомо не знаем, какой это цвет.
				Если ТипЗнч(ТЦветов)<>Тип("ТаблицаЗначений") Тогда
					ТЦветов=упоФункцииОбщегоНазначенияКэшируемый.ПрочитатьТаблицуЦветов();
				КонецЕсли;					
				строц=ТЦветов.Найти(СокрЛП(РИсходныйЦвет));
				Если строц<>Неопределено Тогда
					Если РВидИтоговогоЦвета=1 Тогда // Нужен web-цвет.
						Возврат строц.Название;
					ИначеЕсли РВидИтоговогоЦвета=3 Тогда // Нужен 16-ричный.
						Возврат строц.Шестнадцатиричный;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
		
		Возврат Неопределено;
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

// Преобразует исходный цвет в цвет, соответствующий виду, переданному в параметре.
//
// Параметры:
//  РИсходныйЦвет  		- Цвет				- исходный объект.
//  рВидЦвета  - ВидЦвета  		- вид цвета, в который необходимо преобразовать исходный объект
//						  (Web-Цвет или Абсолютный).
//  ТЦветов  			- ТаблицаЗначений 	- таблица соответствия цветов.
//
// Возвращаемое значение:
//  Цвет - преобразованный объект.
//
Функция ПреобразоватьЦвет(Знач РИсходныйЦвет, Знач рВидЦвета, Знач ТЦветов="") Экспорт
	
	Если ТипЗнч(РИсходныйЦвет) = Тип("Строка") Тогда
		РИсходныйЦвет = ЦветаСтиля[РИсходныйЦвет];		
	КонецЕсли;
	
	Если ТипЗнч(рВидЦвета) = Тип("Строка") Тогда
		рВидЦвета = ВидЦвета[рВидЦвета];		
	КонецЕсли;
	
	ОписаниеЦвета =  ОписаниеЦвета(РИсходныйЦвет, ?(рВидЦвета = ВидЦвета.WebЦвет, 1, 2), ТЦветов);
	Если ОписаниеЦвета = Неопределено Тогда
		Возврат РИсходныйЦвет;
	КонецЕсли;
	
	Если рВидЦвета = ВидЦвета.WebЦвет Тогда
		Попытка
			Возврат WebColors[ОписаниеЦвета];
		Исключение
			Возврат РИсходныйЦвет;	
		КонецПопытки;
	Иначе
		Возврат Новый Цвет(ОписаниеЦвета.Красный, ОписаниеЦвета.Синий, ОписаниеЦвета.Зеленый);
	КонецЕсли;
	
КонецФункции

// Функция выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
//
// Параметры:
//  ИсхСумма - распределяемая сумма.
//  МассивКоэф - массив коэффициентов распределения.
//  Точность - точность округления при распределении. Необязателен.
//  ПроверкаНулевыхЗначений	 - Булево	 - признак учета нулевых значений.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//			суммы в соответствии с весом коэффициента (из массива коэффициентов)
//			В случае если распределить не удалось (сумма = 0, кол-во коэф. = 0,
//			или суммарный вес коэф. = 0), тогда возвращается значение Неопределено.
//
Функция РаспределитьПропорционально(Знач ИсхСумма, МассивКоэф, Знач Точность = 2,
	ПроверкаНулевыхЗначений = Истина) Экспорт

	Если МассивКоэф.Количество() = 0 Или (ПроверкаНулевыхЗначений И ИсхСумма = 0) Или ИсхСумма = Null Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Массив коэффициентов необходимо упорядочить, поэтому создадим таблицу для распределения.
    УпорядоченнаяТаблица = Новый ТаблицаЗначений;
	УпорядоченнаяТаблица.Колонки.Добавить("Коэф", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(17, 4)));
	УпорядоченнаяТаблица.Колонки.Добавить("ИсходныйИндекс", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	
	СуммаКоэф = 0;

	Для Ит = 0 По МассивКоэф.Количество() - 1 Цикл
		СуммаКоэф = СуммаКоэф + МассивКоэф[Ит];
		
		СтрокаТаблицы = УпорядоченнаяТаблица.Добавить();
		СтрокаТаблицы.Коэф = МассивКоэф[Ит];
		СтрокаТаблицы.ИсходныйИндекс = Ит;
	КонецЦикла;
	
	Если СуммаКоэф = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УпорядоченнаяТаблица.Сортировать("Коэф Убыв");
	
	МассивСумм = Новый Массив(УпорядоченнаяТаблица.Количество());
	
	Для каждого СтрокаТаблицы Из УпорядоченнаяТаблица Цикл
		// Возвращаемый результат должен быть в том же порядке.
		МассивСумм[СтрокаТаблицы.ИсходныйИндекс] = 
			?(СуммаКоэф <> 0, Окр(ИсхСумма * МассивКоэф[СтрокаТаблицы.ИсходныйИндекс] / СуммаКоэф, Точность, 1), 0);
		
		ИсхСумма = ИсхСумма - МассивСумм[СтрокаТаблицы.ИсходныйИндекс]; 
		СуммаКоэф = СуммаКоэф - МассивКоэф[СтрокаТаблицы.ИсходныйИндекс]; 
	КонецЦикла;

	Возврат МассивСумм;

КонецФункции

// Получить таблицу имен объектов метаданных, которые вводятся на основании объекта.
//
// Параметры:
//  МассивИмен		 - Массив	 - массив полных имен объектов метаданных
//  	Пример: "Массив.Добавить(Справочник.Валюты)"
//  ПолучитьКоманды	 - Булево	 - обрабатывать общие команды и команды объектов.
//  	Значение по умолчанию Ложь.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьТаблицуОбъектовДляВводаНаОсновании(МассивИмен, ПолучитьКоманды = Ложь) Экспорт

	ТаблицаВводНаОсновании = Новый ТаблицаЗначений;
	ТаблицаВводНаОсновании.Колонки.Добавить("ПолноеИмяОбъектаМетаданных", Новый ОписаниеТипов("Строка"));
	ТаблицаВводНаОсновании.Колонки.Добавить("ТаблицаОбъектовВводНаОсновании", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ТаблицаОбъектовВводНаОсновании = Новый ТаблицаЗначений;
	ТаблицаОбъектовВводНаОсновании.Колонки.Добавить("ИмяОбъектаМетаданных", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовВводНаОсновании.Колонки.Добавить("ФунциональныеОпцииОбъектаМетаданных", Новый ОписаниеТипов("Массив"));
	
	КоллекцииОбъектовМетаданных = Новый ТаблицаЗначений;
	КоллекцииОбъектовМетаданных.Колонки.Добавить("Родитель", Новый ОписаниеТипов("Строка"));
	КоллекцииОбъектовМетаданных.Колонки.Добавить("ВводитсяНаОсновании", Новый ОписаниеТипов("Булево"));
	
	НоваяСтрокаКоллекцииОбъектовМетаданных("ОбщиеКоманды", Ложь, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("Справочники", Истина, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("Документы", Истина, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("ПланыВидовХарактеристик", Истина, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("ПланыСчетов", Истина, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("ПланыВидовРасчета", Истина, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("РегистрыСведений", Ложь, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("РегистрыНакопления", Ложь, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("РегистрыБухгалтерии", Ложь, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("РегистрыРасчета", Ложь, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("БизнесПроцессы", Истина, КоллекцииОбъектовМетаданных);
	НоваяСтрокаКоллекцииОбъектовМетаданных("Задачи", Истина, КоллекцииОбъектовМетаданных);
	
	ГруппаСоздатьНаОсновании = СтандартнаяГруппаКоманд.КоманднаяПанельФормыСоздатьНаОсновании;
	
	ФункциональныеОпции = Метаданные.ФункциональныеОпции;
	
	Для Каждого ПолноеИмя Из МассивИмен Цикл
		
		НоваяСтрока = ТаблицаВводНаОсновании.Добавить();
		НоваяСтрока.ПолноеИмяОбъектаМетаданных = ПолноеИмя;
		
		ОбъектыВводНаОсновании = Новый Массив;
		МетаданныеОбъектОснование = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
		
		Если МетаданныеОбъектОснование = Неопределено Тогда
			Возврат ОбъектыВводНаОсновании;
		КонецЕсли;     
		
		// Получить тип объекта метаданных
		
		ТипОбъектаОснование = Неопределено;
		
		Запрос = Новый Запрос("ВЫБРАТЬ ТИП(" + ПолноеИмя + ") КАК Тип");
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТипОбъектаОснование = Выборка.Тип;
		КонецЦикла;
				
		Для Каждого СтрокаКоллекции Из КоллекцииОбъектовМетаданных Цикл
			
			РодительОбъектаМетаданных = СтрокаКоллекции.Родитель;
			
			Для Каждого ОбъектМетаданных Из Метаданные[РодительОбъектаМетаданных] Цикл
				
				ИмяОбъектаМетаданных = Неопределено;
				
				// Общие команды
				Если Метаданные.ОбщиеКоманды.Содержит(ОбъектМетаданных) Тогда
					
					Если НЕ ПолучитьКоманды Тогда
						Продолжить;
					КонецЕсли;
					
					Если ОбъектМетаданных.Группа.Получить() = ГруппаСоздатьНаОсновании
						И ОбъектМетаданных.ТипПараметраКоманды.СодержитТип(ТипОбъектаОснование) Тогда
						
						ИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
						
					КонецЕсли;
					
				Иначе
					
					Если ОбъектМетаданных.ИспользоватьСтандартныеКоманды
						И СтрокаКоллекции.ВводитсяНаОсновании
						И ОбъектМетаданных.ВводитсяНаОсновании.Содержит(МетаданныеОбъектОснование) Тогда
						
						ИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
						
					КонецЕсли; 
					
					// Команды объекта
					Если ПолучитьКоманды Тогда
						
						Для Каждого Команда Из ОбъектМетаданных.Команды Цикл
							Если Команда.Группа.Получить() = ГруппаСоздатьНаОсновании
								И Команда.ТипПараметраКоманды.СодержитТип(ТипОбъектаОснование) Тогда
								
								ИмяОбъектаМетаданных = "Команда." + Команда.Имя;
								
								Если ТаблицаОбъектовВводНаОсновании.Найти(ИмяОбъектаМетаданных, "ИмяОбъектаМетаданных") = Неопределено Тогда
									
									ЗаполнитьФункциональныеОпцииОбъектаМетаданных(ТаблицаОбъектовВводНаОсновании, ФункциональныеОпции, ОбъектМетаданных, ИмяОбъектаМетаданных);
									
								КонецЕсли;
								
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ИмяОбъектаМетаданных = Неопределено 
					И ТаблицаОбъектовВводНаОсновании.Найти(ИмяОбъектаМетаданных, "ИмяОбъектаМетаданных") = Неопределено Тогда
					
					ЗаполнитьФункциональныеОпцииОбъектаМетаданных(ТаблицаОбъектовВводНаОсновании, ФункциональныеОпции, ОбъектМетаданных, ИмяОбъектаМетаданных);
						
				КонецЕсли;				
				
			КонецЦикла;
		КонецЦикла;
		
		НоваяСтрока.ТаблицаОбъектовВводНаОсновании = ТаблицаОбъектовВводНаОсновании.Скопировать();
		
		ТаблицаОбъектовВводНаОсновании.Очистить();
		
	КонецЦикла;
	
	Возврат ТаблицаВводНаОсновании;

КонецФункции

// Ищет документ, аналогичный документу, сруктура свойств которого передается в одном из параметров.
//
// Параметры:
//  Ссылка			 - ДокументСсылка - ссылка на документ, который должен быть исключен из поиска аналога.
//  ИмяДокумента	 - Строка - тип документа.
//  СтруктураАналога - Структура - структура данных аналога.
//
// Возвращаемое значение:
//	Булево - признак того, что аналогичный документ есть.
//
Функция ЕстьАналогичныйДокумент(Ссылка, ИмяДокумента, СтруктураАналога) Экспорт
	
	ТекстУсловия = "";
	Для каждого ЭлементСтруктуры Из СтруктураАналога Цикл
		ТекстУсловия = " И " + ЭлементСтруктуры.Ключ + " = &" + ЭлементСтруктуры.Ключ;
	КонецЦикла;
	
	ЗапросТекст = 	"ВЫБРАТЬ
	              	|	Док.Ссылка
	              	|ИЗ
	              	|	Документ." + ИмяДокумента + " КАК Док
	              	|ГДЕ
	              	|	 Проведен = Истина
					|	И Ссылка <> &Ссылка "
					+ ТекстУсловия;
	
	Запрос = Новый Запрос(ЗапросТекст);
	Для каждого ЭлементСтруктуры Из СтруктураАналога Цикл
		Запрос.УстановитьПараметр(ЭлементСтруктуры.Ключ,ЭлементСтруктуры.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НСтрока = НСтр("ru = 'Уже есть проведенный документ: ""%1""'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, Выборка.Ссылка);
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

// Процедура выполняет сортировку и настраивает интерфейс формы.
//
// Параметры:
//	Таблица					- ТаблицаЗначений 	- или Табличная часть документа. Таблица, которую будем сортировать.
//	ЭлементыФормыТаблица 	- ТабличныйДокумент - из него вы выбираем текущую колонку.
//  ПоВозрастанию 			- Булево 			- по умолчанию - Истина, передает направление сортировки.
//  
Процедура ВыполнитьСортировкуКолонки(Таблица, ЭлементыФормыТаблица, ПоВозрастанию = Истина) Экспорт
	
	Если ПоВозрастанию Тогда
		вНаправлениеСортировки = " Возр";
	Иначе
		вНаправлениеСортировки = " Убыв";
	КонецЕсли;
	
	текКолонка = ЭлементыФормыТаблица.ТекущаяКолонка;
	Если текКолонка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Нужно проверить что такая колонка есть в таблице.
	Если Найти(Строка(ТипЗнч(Таблица)), "табличная часть") <> 0 Тогда
		// Это может быть табличная часть.
		ТаблицаПроверки = Таблица.ВыгрузитьКолонки();
	ИначеЕсли ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		// Или таблица значений.
		ТаблицаПроверки = Таблица.Скопировать();
	Иначе
		Возврат; // А какие еще могут быть варианты?
	КонецЕсли;	
	
	Если ТаблицаПроверки.Колонки.Найти(текКолонка.Имя) = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Таблица.Сортировать(текКолонка.Имя + вНаправлениеСортировки);
	
КонецПроцедуры

// Устанавливает контрагента и договор, по умолчанию установленный в проекте, в строку.
//
// Параметры:
//  Форма			 - УправялемаяФорма 		- форма, из которой будет получена текущая строка и валюта УУ, если они не
//						переданы в соответствующих параметрах.
//  Проект			 - СправочникСсылка.Проект 	– проект документа.
//  ИмяКонтрагента	 - Строка 					- имя контрагента для его установления.
//  ИмяДоговора		 - Строка 					- имя договора для его установления.
//  СтрокаТЧ		 - СтрокаТабличнойЧасти 	– по умолчанию неопределено - тогда берется текущая из табличной части.
//  ИмяТаблицы		 - Строка 					– имя табличной части для установления текущей строки.
//
// Возвращаемое значение:
//	СтрокаТабличнойЧасти - заполненная строка. Если строка была передана в параметре СтрокаТЧ, то дополняется она.
//
Функция ЗаполнитьСтрокуПоУмолчанию(Форма,
								   Проект,
								   ИмяКонтрагента,
								   ИмяДоговора,
								   СтрокаТЧ = Неопределено,
								   ИмяТаблицы = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Возврат СтрокаТЧ;	
	КонецЕсли;
		
	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = Форма.ЭлементыФормы[ИмяТаблицы].ТекущаяСтрока;
	КонецЕсли;
	
	СтруктураСвойствПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);
	
	// Проверим, есть ли в строке поле "ЭтоРольТрудовогоРесурса".
	// Если есть и истина, то заполнять договор и контрагента не нужно.
	СтруктураЭтоРольТрудовогоРесурса = Новый Структура("ЭтоРольТрудовогоРесурса");
	ЗаполнитьЗначенияСвойств(СтруктураЭтоРольТрудовогоРесурса, СтрокаТЧ);
	ЗаполнятьКонтрагентаИДоговор = НЕ (ТипЗнч(СтруктураЭтоРольТрудовогоРесурса.ЭтоРольТрудовогоРесурса) = Тип("Булево")
									И СтруктураЭтоРольТрудовогоРесурса.ЭтоРольТрудовогоРесурса);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Контрагент) И ЗаполнятьКонтрагентаИДоговор Тогда
		СтрокаТЧ.Контрагент = Проект[ИмяКонтрагента];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Договор) Тогда
		
		Если ЗаполнятьКонтрагентаИДоговор Тогда
			
			Договор = ?(ЗначениеЗаполнено(Проект[ИмяДоговора]),
				Проект[ИмяДоговора], ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
				
			Если НЕ ЗначениеЗаполнено(Договор) Тогда
				Если Метаданные.Справочники.Контрагенты.Реквизиты.Найти("упоОсновнойДоговорКонтрагента") <> Неопределено Тогда
					Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Контрагент, "упоОсновнойДоговорКонтрагента");	
				КонецЕсли;
			КонецЕсли; 		
			
			Если Договор = Неопределено Тогда
				Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			
			СтрокаТЧ.Договор = Договор;			
			СтрокаТЧ.Валюта  = упоУправлениеДоговорамиСервер.ВалютаДоговораКонтрагента(Договор);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Валюта) Тогда
		СтрокаТЧ.Валюта = Форма.мВалютаУправленческогоУчета;
	КонецЕсли;
	
	Если ИмяТаблицы = "ПланДоходов" ИЛИ ИмяТаблицы = "ПланРасходов" ИЛИ ИмяТаблицы = "Субпродукты"
		ИЛИ ИмяТаблицы = "МатериальныеРесурсы" Тогда
		
		СтрокаТЧ.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения;
		
	ИначеЕсли ИмяТаблицы = "ДвиженияДенежныхСредств" Тогда
		
		ЕстьПолеСпособПривязки = Ложь;
		
		Если ТипЗнч(СтрокаТЧ) = Тип("Структура") Тогда 
			
			ЕстьПолеСпособПривязки =  СтрокаТЧ.Свойство("СпособПривязки");
			
		Иначе // Проверим, есть ли в СтрокаТЧ поле СпособПривязки.
			
			СтруктураСпособПривязки = Новый Структура("СпособПривязки", Неопределено);
			ЗаполнитьЗначенияСвойств(СтруктураСпособПривязки, СтрокаТЧ);
			ЕстьПолеСпособПривязки = СтруктураСпособПривязки.СпособПривязки <> Неопределено;
			
		КонецЕсли;
		
		Если ЕстьПолеСпособПривязки И Не ЗначениеЗаполнено(СтрокаТЧ.СпособПривязки) Тогда
			
			СтрокаТЧ.СпособПривязки = Перечисления.упоСпособПривязкиДДС.НачалоЗадачи;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяТаблицы = "ПланДоходов"
		Или ИмяТаблицы = "Доходы" 
		Или ИмяТаблицы = "ДоходныеОбъемы" Тогда
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Статья) Тогда
			
			СтрокаТЧ.Статья = СтруктураСвойствПоУмолчанию.СтатьяДоходовПоУмолчанию;
			
		КонецЕсли;	
		
		ПрофильПоУмолчанию = СтруктураСвойствПоУмолчанию.ПрофильДоходовПоУмолчанию;
		
	ИначеЕсли ИмяТаблицы = "Субпродукты" Тогда
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтатьяДоходов) Тогда
			
			СтрокаТЧ.СтатьяДоходов = СтруктураСвойствПоУмолчанию.СтатьяДоходовПоУмолчанию;
			
		КонецЕсли;	
		
		СтрокаТЧ.Коэффициент = 1;
		СтрокаТЧ.Количество = 1;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.СпособПривязкиВыпуска) Тогда
			
			СтрокаТЧ.СпособПривязкиВыпуска = Перечисления.упоСпособПривязкиПоставокИСубпродуктов.ЗавершениеЗадачи;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Ресурс) Тогда
			
			ЭтоПП = упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(СтрокаТЧ.Ресурс);
				
			Если Не ЭтоПП Тогда
				СтрокаТЧ.Ресурс = СтруктураСвойствПоУмолчанию.НатуральныйПоказательДоходовПоУмолчанию;	
				СтрокаТЧ.ЕдиницаНормирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Ресурс, "ЕдиницаИзмерения");
			КонецЕсли;
			
		КонецЕсли;
		
		ПрофильПоУмолчанию = СтруктураСвойствПоУмолчанию.ПрофильДоходовПоУмолчанию;		

	ИначеЕсли ИмяТаблицы = "МатериальныеРесурсы" Тогда
		
		СтрокаТЧ.Количество = 1;
		СтруктураСпособПривязки = Новый Структура("СпособПривязкиПотребности", Неопределено);
		ЗаполнитьЗначенияСвойств(СтруктураСпособПривязки, СтрокаТЧ);
		ЕстьПолеСпособПривязки = СтруктураСпособПривязки.СпособПривязкиПотребности <> Неопределено;
		
		Если ЕстьПолеСпособПривязки И НЕ ЗначениеЗаполнено(СтруктураСпособПривязки.СпособПривязкиПотребности) Тогда			
			СтрокаТЧ.СпособПривязкиПотребности = Перечисления.упоСпособПривязкиПоставокИСубпродуктов.НачалоЗадачи;			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтатьяЗатрат) Тогда
			
			СтрокаТЧ.СтатьяЗатрат = СтруктураСвойствПоУмолчанию.СтатьяЗатратПоУмолчанию;
			
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Ресурс) Тогда
			
			НатуральныйПоказательРасходовПоУмолчанию = СтруктураСвойствПоУмолчанию.НатуральныйПоказательРасходовПоУмолчанию;
			Если ТипЗнч(НатуральныйПоказательРасходовПоУмолчанию) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				СтрокаТЧ.Ресурс = НатуральныйПоказательРасходовПоУмолчанию;
				СтрокаТЧ.ЕдиницаНормирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Ресурс, "ЕдиницаИзмерения");
				
			КонецЕсли;
			
		КонецЕсли;
		ПрофильПоУмолчанию = СтруктураСвойствПоУмолчанию.ПрофильРасходовПоУмолчанию;
	
	ИначеЕсли ИмяТаблицы = "ПланРасходов"
		ИЛИ ИмяТаблицы = "Расходы" 
		ИЛИ ИмяТаблицы = "РасходныеОбъемы" Тогда
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Статья) Тогда
			
			СтрокаТЧ.Статья = СтруктураСвойствПоУмолчанию.СтатьяЗатратПоУмолчанию;
			
		КонецЕсли;	
		
		ПрофильПоУмолчанию = СтруктураСвойствПоУмолчанию.ПрофильРасходовПоУмолчанию;

	КонецЕсли;
	
	Если ТипЗнч(СтрокаТЧ) = Тип("Структура") Тогда
		ЗаполнятьПрофиль = СтрокаТЧ.Свойство("ПрофильРаспределения");
	Иначе
		ЗаполнятьПрофиль = Истина;
	КонецЕсли;
	
	Если ЗаполнятьПрофиль И НЕ ИмяТаблицы = "ДвиженияДенежныхСредств" Тогда
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПрофильРаспределения) Тогда 
			СтрокаТЧ.ПрофильРаспределения =  ПрофильПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаТЧ;
	
КонецФункции

// Преобразовывает таблицу значений в массив структур.
//
// Параметры:
//  ТаблицаЗначений			 - ТаблицаЗначений - преобразуемая таблица.
//  ДополнительныйПараметр	 - Структура - необязательный параметр. Структура, данные которой будут также добавлены
//										   в структуру с данными строки.
//
// Возвращаемое значение:
//	Массив - элементы коллекции имеют тип Структура.
//
Функция ПреобразоватьТаблицуВМассивСтруктур(ТаблицаЗначений, ДополнительныйПараметр = Неопределено) Экспорт

    РезультатМассив = Новый Массив();
	ЕстьДополнительныйПрарметр = (ДополнительныйПараметр <> Неопределено
								  И ТипЗнч(ДополнительныйПараметр) = Тип("Структура"));
								  
	МассивПолейТаблицы = Новый Массив;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		МассивПолейТаблицы.Добавить(Колонка.Имя);
	КонецЦикла;
	Если ЕстьДополнительныйПрарметр Тогда
		Для Каждого КлючЗначение Из ДополнительныйПараметр Цикл
			Если МассивПолейТаблицы.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МассивПолейТаблицы.Добавить(КлючЗначение.Ключ);
		КонецЦикла;
	КонецЕсли;
	СтрокаПолей = СтрСоединить(МассивПолейТаблицы, ",");	
								  
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		СтруктураСтрока = Новый Структура(СтрокаПолей);
        ЗаполнитьЗначенияСвойств(СтруктураСтрока, Строка);
		
		Если ЕстьДополнительныйПрарметр Тогда
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, ДополнительныйПараметр);
		КонецЕсли;
		
        РезультатМассив.Добавить(СтруктураСтрока);
		
    КонецЦикла;

    Возврат РезультатМассив;

КонецФункции

// Преобразовывает таблицу значений в соответствие структур.
//
// Параметры:
//  ТаблицаЗначений			 - ТаблицаЗначений - преобразуемая таблица.
//  ИмяПоляКлюча			 - Строка - имя поля ключа.
//
// Возвращаемое значение:
//	Соответствие - элементы коллекции имеют тип Структура.
//
Функция ПреобразоватьТаблицуВСоответствиеСтруктур(ТаблицаЗначений, ИмяПоляКлюча) Экспорт

    Результат = Новый Соответствие;
	
	МассивПолейТаблицы = Новый Массив;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		МассивПолейТаблицы.Добавить(Колонка.Имя);
	КонецЦикла;
	СтрокаПолей = СтрСоединить(МассивПолейТаблицы, ",");	
								  
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		СтруктураСтрока = Новый Структура(СтрокаПолей);
        ЗаполнитьЗначенияСвойств(СтруктураСтрока, Строка);
				
        Результат.Вставить(Строка[ИмяПоляКлюча], СтруктураСтрока);
		
    КонецЦикла;

    Возврат Результат;

КонецФункции

// Заполняет системные поля таблицы движения регистра сведений.
//
// Параметры:
//  ТаблицаДвижений	 - ТаблицаЗначений - преобразуемая таблица.
//  Регистратор		 - ДокументСсылка - документ регистратор набора записей.
//  Период			 - Дата - период набора записей.
//  Активность		 - Булево - активность набора записей.
//
Процедура ЗаполнитьСистемныеПоляТаблицыДвиженийРегистраСведений(ТаблицаДвижений, Регистратор, Период, Активность = Истина) Экспорт
	
	КолонкиТаблицы = ТаблицаДвижений.Колонки;
	
	Если КолонкиТаблицы.Найти("Регистратор") = Неопределено Тогда
		КолонкиТаблицы.Добавить("Регистратор");
	КонецЕсли;
	Если КолонкиТаблицы.Найти("Активность") = Неопределено Тогда
		КолонкиТаблицы.Добавить("Активность");
	КонецЕсли;
	Если КолонкиТаблицы.Найти("Период") = Неопределено Тогда
		КолонкиТаблицы.Добавить("Период");
	КонецЕсли;

	ТаблицаДвижений.ЗаполнитьЗначения(Регистратор, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Активность, "Активность");
	ТаблицаДвижений.ЗаполнитьЗначения(Период, "Период");
	
КонецПроцедуры

// Возвращает пустую таблицу значений с колонками, соответствующими измерениям и ресурсам регистра сведений или накопления.
//
// Параметры:
//  ИмяРегистра				 - Строка	 - имя регистра.
//  КолонкиИсключения		 - Строка	 - список колонок, исключаемых из результирующей таблицы.
//  ДобавитьПолеРегистратор	 - Булево			 - признак включения в поля шаблон колонки Регистратор.
//  ДобавитьПолеАктивность	 - Булево			 - признак включения в поля шаблона колонки Активность.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица значений.
//
Функция ШаблонТаблицыЗначенийПоРегистру(ИмяРегистра, 
	Знач КолонкиИсключения = "", ДобавитьПолеРегистратор = Ложь, ДобавитьПолеАктивность = Ложь) Экспорт
		
	Регистр = Метаданные.РегистрыСведений.Найти(ИмяРегистра);
	
	Если Регистр = Неопределено Тогда
		Регистр = Метаданные.РегистрыНакопления.Найти(ИмяРегистра);
	КонецЕсли;	
	
	ИскатьИсключения = ЗначениеЗаполнено(КолонкиИсключения);
	МассивИсключений = Новый Массив;
	Если ЗначениеЗаполнено(КолонкиИсключения) Тогда
		МассивИсключений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КолонкиИсключения);	
	КонецЕсли;	
	
	Таблица = Новый ТаблицаЗначений;
	КолонкиТаблицы = Таблица.Колонки;
		
	Для Каждого Измерение Из Регистр.Измерения Цикл				
		Если ИскатьИсключения И МассивИсключений.Найти(Измерение.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		КолонкиТаблицы.Добавить(Измерение.Имя, Измерение.Тип);		
	КонецЦикла;
	
	Для Каждого Ресурс Из Регистр.Ресурсы Цикл				
		Если ИскатьИсключения И МассивИсключений.Найти(Ресурс.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КолонкиТаблицы.Добавить(Ресурс.Имя, Ресурс.Тип);
	КонецЦикла;
	
	КолонкаПериод = "Период";
	Если Не (ИскатьИсключения И МассивИсключений.Найти(КолонкаПериод) <> Неопределено) Тогда
		КолонкиТаблицы.Добавить(КолонкаПериод);	
	КонецЕсли; 
	
	Если ДобавитьПолеРегистратор Тогда
		КолонкиТаблицы.Добавить("Регистратор");
	КонецЕсли;	
	Если ДобавитьПолеАктивность Тогда
		КолонкиТаблицы.Добавить("Активность");
	КонецЕсли;	

	Возврат Таблица;
	
КонецФункции	

// Возвращает отформатированную строку результата поиска при редактировании текста поиска (аналог типового поиска)	
//
// Параметры:
//  ТекстПредставление	 - Строка - Строка, которую неоходимо отформатировать
//  ДлинаСтрокиПоиска	 - Число - Число символов исходной строки, которые надо отформатировать
//  ЦветФорматирования	 - Цвет - Цвет, который будет использоваться в качестве формата переданной строки
// 
// Возвращаемое значение:
//  ОтформатированнаяСтрока - форматированная строка
//
Функция ВернутьОтформатированнуюСтроку(ТекстПредставление, ДлинаСтрокиПоиска, ЦветФорматирования) Экспорт
	
	ФорматированнаяСтрокаПоиска = Новый ФорматированнаяСтрока(Лев(ТекстПредставление, ДлинаСтрокиПоиска) , , ЦветФорматирования);	
	НеформатируемаяЧастьСтроки 	= Сред(ТекстПредставление, ДлинаСтрокиПоиска + 1, СтрДлина(ТекстПредставление) - ДлинаСтрокиПоиска);
	ОтформатированнаяСтрока 	= Новый ФорматированнаяСтрока(ФорматированнаяСтрокаПоиска, НеформатируемаяЧастьСтроки);
	
	Возврат ОтформатированнаяСтрока;
	
КонецФункции

// По параметру ИменаЭлементов находит элементы формы
// и у найденных элементов меняет значение указанного свойства на заданное
//
// Параметры:
//  ИменаЭлементов	 - Массив из Строка - Имена элементов формы
//  Форма			 - ФормаКлиентскогоПриложения - Произвольная форма
//  ИмяСвойства 	 - Строка - имя изменяемого свойсва
//  ЗначениеСвойства - Произвольный - значение изменяемого свойсвта
//
Процедура НайтиЭлементыПоИменамИУстановитьДляНихУказанноеСвойство(ИменаЭлементов, Форма, 
	ИмяСвойства, ЗначениеСвойства) Экспорт
	
	Для Каждого Имя Из ИменаЭлементов Цикл
		
		ЭлементРодитель = Форма.Элементы.Найти(Имя);	
		Если ЭлементРодитель <> Неопределено Тогда
			ЭлементРодитель[ИмяСвойства] = ЗначениеСвойства;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

// Дополнительные реквизиты и сведения не найдены.
// 
// Параметры:
//  Ссылка - Ссылка - ссылка на проверяемый объект (ДокументСсылка.<Имя> и т.п.)
//  ЭтоДополнительноеСведение - Булево
// 
// Возвращаемое значение:
//  Булево - Дополнительные реквизиты и сведения не найдены
Функция ДополнительныеРеквизитыИСведенияНеНайдены(Ссылка, ЭтоДополнительноеСведение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваНаборов.Свойство КАК Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК СвойстваНаборов
	|ГДЕ
	|	СвойстваНаборов.Ссылка = &Ссылка
	|	И НЕ СвойстваНаборов.ПометкаУдаления";
	
	Если ЭтоДополнительноеСведение Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты",
			"Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СвойстваНеНайдены = Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СвойстваНеНайдены;
КонецФункции

// Прокси-метод для платформенного ПолучитьФункциональнуюОпцию().
// Используется для обхода расширенной проверки конфигурации, которая отмечает ошибками использование отсутствующих 
// объектов интеграцоннной конфигурации через ПолучитьФункциональнуюОпцию().
//
// Параметры:
//  Имя - Строка - имя ФО.
// 
// Возвращаемое значение:
//  ЛюбаяСсылка
//
Функция упоПолучитьФункциональнуюОпцию(Имя) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию(Имя);
	
КонецФункции

#Область РаботаСМетаданными

// Получить список реквизитов объекта.
//
// Параметры:
//  СсылкаНаОбъект	 - Произвольный - ссылка на объект.
//
// Возвращаемое значение:
//	СписокЗначений - список, где значение элемента - имя реквизита, представление - синоним.
//
Функция ПолучитьСписокРеквизитовОбъекта(СсылкаНаОбъект) Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	
	Если СсылкаНаОбъект <> Неопределено Тогда
		Для Каждого Реквизит Из СсылкаНаОбъект.Метаданные().Реквизиты Цикл
			СписокЗначений.Добавить(Реквизит.Имя, Реквизит.Синоним);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокЗначений;
	
КонецФункции

// Получает список табличных частей объекта.
//
// Параметры:
//  СсылкаНаОбъект	 - Произвольный - ссылка на объект.
//
// Возвращаемое значение:
//	СписокЗначений - список, где значение элемента - имя таличной части, а представление - ее синоним.
//
Функция ПолучитьСписокТабличныхЧастейОбъекта(СсылкаНаОбъект) Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	
	Если СсылкаНаОбъект <> Неопределено Тогда
		Попытка
			Для Каждого ТабличнаяЧасть Из СсылкаНаОбъект.Метаданные().ТабличныеЧасти Цикл
				СписокЗначений.Добавить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Синоним);
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат СписокЗначений;
	
КонецФункции

// Разбирает строковый путь к объекту метаданных PM и возвращает структуру. 
//
// Параметры:
//  ПутьКДанным	 - Строка - Строковое представление пути к объекту метаданных.
// 
// Возвращаемое значение:
//  Структура - Структура строк пути к объекту метаданных.
//
Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным) Экспорт 
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 По 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 По 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

// Возвращает имя базового типа по переданному значению объекта метаданных.
//  см.ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных	 - объект метаданных, по которому необходимо определить ссылочный тип.
// 
// Возвращаемое значение:
//  Строка - имя ссылочного типа по переданному значению объекта метаданных.
//
Функция ИмяСсылочногоТипаПоОбъектуМетаданных(ОбъектМетаданных) Экспорт
	
	Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат "Документ";
		
	ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат "Справочник";
		
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланОбмена";
		
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланВидовХарактеристик";
		
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		Возврат "БизнесПроцесс";
		
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		Возврат "Задача";
		
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланСчетов";
		
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат "ПланВидовРасчета";
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

// Возвращает имя базового типа по переданному значению объекта метаданных.
//  см.ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных
//
// Параметры:
//  ТипОбъектаМетаданных - ТипОбъектаМетаданных	 - объект метаданных, по которому необходимо определить ссылочный тип.
// 
// Возвращаемое значение:
//  Строка - имя ссылочного типа по переданному значению объекта метаданных.
//
Функция ИмяСсылочногоТипаПоТипуМетаданных(ТипОбъектаМетаданных) Экспорт
	
	Если Метаданные.Документы = ТипОбъектаМетаданных Тогда
		Возврат "Документ";
		
	ИначеЕсли Метаданные.Справочники = ТипОбъектаМетаданных Тогда
		Возврат "Справочник";
		
	ИначеЕсли Метаданные.ПланыОбмена = ТипОбъектаМетаданных Тогда
		Возврат "ПланОбмена";
		
	ИначеЕсли Метаданные.ПланыВидовХарактеристик = ТипОбъектаМетаданных Тогда
		Возврат "ПланВидовХарактеристик";
		
	ИначеЕсли Метаданные.БизнесПроцессы = ТипОбъектаМетаданных Тогда
		Возврат "БизнесПроцесс";
		
	ИначеЕсли Метаданные.Задачи = ТипОбъектаМетаданных Тогда
		Возврат "Задача";
		
	ИначеЕсли Метаданные.ПланыСчетов = ТипОбъектаМетаданных Тогда
		Возврат "ПланСчетов";
		
	ИначеЕсли Метаданные.ПланыВидовРасчета = ТипОбъектаМетаданных Тогда
		Возврат "ПланВидовРасчета";
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

// Возвращает тип объектов метаданных с исключенными объектами, помеченными в синониме как "(не использовать)" и проч.
//
// Параметры:
//  ПроверяемыеМетаданные	 - Массив, КоллекцияОбъектовМетаданных - метаданные, из состава которых 
//  необходимо исключить помеченные объекты.
// 
// Возвращаемое значение:
//  ОписаниеТипов - описание типа для реквизита формы.
//
Функция ТипыМетаданных_УбратьНеиспользуемые(Знач ПроверяемыеМетаданные = Неопределено) Экспорт
	
	МассивТипов = Новый Массив;
	
	ПроверяемыеВставки = ПроверяемыеВставкиСинонимовОбъектовМетаданныхДляИсключения();
	
	Если ПроверяемыеМетаданные = Неопределено Тогда
		мПроверяемыеМетаданные = Новый Массив;
		мПроверяемыеМетаданные.Добавить(Метаданные.Справочники);
		мПроверяемыеМетаданные.Добавить(Метаданные.Документы);
	ИначеЕсли 
		ТипЗнч(ПроверяемыеМетаданные) = Тип("КоллекцияОбъектовМетаданных") Тогда
		мПроверяемыеМетаданные = Новый Массив;
		мПроверяемыеМетаданные.Добавить(ПроверяемыеМетаданные);
	Иначе
		мПроверяемыеМетаданные = ПроверяемыеМетаданные;
	КонецЕсли;
	
	ШаблонТипа = "%1Ссылка.%2";
	
	Для Каждого ТипМетаданных Из мПроверяемыеМетаданные Цикл
		
		ТипМетаданныхСтрокой = упоФункцииОбщегоНазначенияСервер.ИмяСсылочногоТипаПоТипуМетаданных(ТипМетаданных);
		Если Не ЗначениеЗаполнено(ТипМетаданныхСтрокой) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементМетаданных Из ТипМетаданных Цикл
			
			ИспользованиеОбъекта = ИспользованиеОбъектаМетаданныхПоСинониму(ЭлементМетаданных.Синоним, ПроверяемыеВставки);
			
			Если Не ИспользованиеОбъекта Тогда
				Продолжить; // Продолжить
			КонецЕсли;
			
			МассивТипов.Добавить(Тип(СтрШаблон(ШаблонТипа, ТипМетаданныхСтрокой, ЭлементМетаданных.Имя)));
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивТипов;
	
КонецФункции

// Проверяет наличие неиспользуемых фрагментов в синониме элемента метаданных.
// пример: "(не используется)", "(удален)". 
//
// Параметры:
//  СинонимОбъектаМетаданных - Строка - синоним объекта метаданных.
//  ПроверяемыеВставки		 - Соответствие - 
//  	см.упоФункцииОбщегоНазначенияСервер.ПроверяемыеВставкиСинонимовОбъектовМетаданныхДляИсключения.
// 
// Возвращаемое значение:
//  Булево - признак использования.
//
Функция ИспользованиеОбъектаМетаданныхПоСинониму(СинонимОбъектаМетаданных, ПроверяемыеВставки) Экспорт
	
	Для Каждого Вставка Из ПроверяемыеВставки Цикл
		Если Лев(СинонимОбъектаМетаданных, Вставка.Значение) = Вставка.Ключ Тогда
			Возврат Ложь; // Возврат
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ()

// Возвращает набор фрагментов синонимов метаданных, указывающих, что объект перестал использоваться в конфигурации.
// пример: "(не используется)", "(удален)".
// 
// Возвращаемое значение:
//  Соответствие - набор исключаемых фрагментов.
//
Функция ПроверяемыеВставкиСинонимовОбъектовМетаданныхДляИсключения() Экспорт 
	
	ПроверяемыеВставки = Новый Соответствие;
	ПроверяемыеВставки.Вставить("(не используется)", 0);
	ПроверяемыеВставки.Вставить("(удалить)", 0);
	Для Каждого Вставка Из ПроверяемыеВставки Цикл
		ПроверяемыеВставки.Вставить(Вставка.Ключ, СтрДлина(Вставка.Ключ));
	КонецЦикла;
	
	Возврат ПроверяемыеВставки;
	
КонецФункции

#КонецОбласти

#Область РаботаСЗапросами

// Проверяет корректность запроса и возможность его выполнения.
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса.
//  ТекстОшибки	 - Строка - в этот параметр возвращается сообщение об ошибке, если она есть.
//  Показатель	 - СправочникСсылка.упоПоказателиПроектов - показатель, запрос которого проверяется.
//  ЗапретитьРазрешенные - Булево - признак проверки на запрет разрешенных (актуально для показателей).
//
// Возвращаемое значение:
//	Булево - признак успешного выполнения запроса.
//
Функция ПроверитьЗапрос(ТекстЗапроса, ТекстОшибки, Показатель = Неопределено, ЗапретитьРазрешенные = Ложь) Экспорт
	
	ЗапросВыполнен = Ложь;
	ТекстОшибки = "";
	
	МассивОшибок = Новый Массив;
	
	ПостроительОтчета = Новый ПостроительОтчета;
	
	// Проверка запроса построителем.
	
	Попытка
		
		ПостроительОтчета.Текст = ТекстЗапроса;
		ПостроительОтчета.ЗаполнитьНастройки();
		
		ЗапросВыполнен = Истина;
		
	Исключение
		
		ОписаниеОшибки = ОписаниеОшибки();
		Текст = НСтр("ru = 'Ошибка запроса: '") + Сред(ОписаниеОшибки, СтрНайти(ОписаниеОшибки, "(Текст):") + 9);
		МассивОшибок.Добавить(Текст);
		
	КонецПопытки;
	
	// Проверка корректности заполнения полей показателя.
	
	Если Показатель <> Неопределено Тогда
		
		Если СтрНайти(Показатель.ТекстЗапроса, Показатель.ИмяПоляОбъекта) = 0 Тогда
			
			Текст = СтрШаблон(НСтр("ru = 'В запросе не найдено указанное имя поля Проекта ""%1""'"), 
				Показатель.ИмяПоляОбъекта);
			МассивОшибок.Добавить(Текст);
			
			ЗапросВыполнен = Ложь;
			
		КонецЕсли;
		
		Если СтрНайти(Показатель.ТекстЗапроса, Показатель.ИмяПоляЗначения) = 0 Тогда
			
			Текст = СтрШаблон(НСтр("ru = 'В запросе не найдено указанное имя поля Показателя ""%1""'"),
				Показатель.ИмяПоляЗначения);
			МассивОшибок.Добавить(Текст);
			
			ЗапросВыполнен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗапретитьРазрешенные Тогда
		
		Если СтрНайти(ВРЕГ(ТекстЗапроса), " РАЗРЕШЕННЫЕ ") <> 0 Тогда
			
			Текст = НСтр("ru = 'В запросе нельзя использовать ""РАЗРЕШЕННЫЕ""'");
			МассивОшибок.Добавить(Текст);

			ЗапросВыполнен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда
		ТекстОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат ЗапросВыполнен;
	
КонецФункции

// Рекурсивно строит дерево значений.
//
// Параметры:
//  Выборка							 - ВыборкаИзРезультатаЗапроса 			- выборка, на основании которой надо построить дерево.
//  СтрокаДерева					 - ДеревоЗначений, СтрокаДереваЗначений - строимое дерево или добавляемая строка дерева.
//  МассивКолонок					 - Массив 								- массив колонок, на основании которого определяется
//										последний ли это уровень группировки.
//  СтрокаДопРеквизитов				 - Произвольный 						- дополнительные реквизиты. Не используется.
//  ИмяПоляГруппировки				 - Строка								- поле, куда записывается группировка.
//  ИмяПоляДляЗаписиИмениГруппировки - Строка 								- имя поля, куда записывается имя группировки.
//  ОсновноеПолеНижнегоУровня		 - Строка								- имя поля нижнего уровня.
//  СтруктураУровнейСИерархией		 - Произвольный							- необязательный параметр. Не используется.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция РекурсивноПостроитьДерево(Выборка,
								  СтрокаДерева,
								  МассивКолонок, 
								  СтрокаДопРеквизитов, 
								  ИмяПоляГруппировки,
								  ИмяПоляДляЗаписиИмениГруппировки,
								  ОсновноеПолеНижнегоУровня, 
								  СтруктураУровнейСИерархией = Неопределено) Экспорт
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДеревоЗначений") Тогда
		
		ПредУровень = -1;
		ПредСтрока = СтрокаДерева;
		
		Пока Выборка.Следующий() Цикл
			
			РазностьУровней = ПредУровень - Выборка.Уровень() + 1;
			НоваяСтрокаДерева = ПоднятьсяНаЧислоУровней(ПредСтрока, РазностьУровней).Строки.Добавить();		
					
			РекурсивноПостроитьДерево(Выборка,
									  НоваяСтрокаДерева,
									  МассивКолонок,
									  СтрокаДопРеквизитов,
									  ИмяПоляГруппировки,
									  ИмяПоляДляЗаписиИмениГруппировки,
									  ОсновноеПолеНижнегоУровня,
									  СтруктураУровнейСИерархией);
						
			ПредУровень = Выборка.Уровень();     
			ПредСтрока = НоваяСтрокаДерева;
			
		КонецЦикла;
		
	Иначе
		
		Группировка = Выборка.Группировка();
		
		ТекИндексГруппировки = МассивКолонок.Найти(Выборка.Группировка());
		
		ЭтоПоследнийУровень = (ТекИндексГруппировки = МассивКолонок.Количество()) ИЛИ Группировка = "";
		
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
		
		СтрокаДерева[ИмяПоляДляЗаписиИмениГруппировки] = Группировка;
		
		Если Не ЭтоПоследнийУровень Тогда
				
			ТекГруппировка = МассивКолонок[ТекИндексГруппировки];
			СтрокаДерева[ИмяПоляГруппировки] = СтрокаДерева[ТекГруппировка];		
			
			ВыборкаНиже = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			 
			ПредУровень = Выборка.Уровень();
			ПредСтрока = СтрокаДерева;
			
			Пока ВыборкаНиже.Следующий() Цикл
								
				РазностьУровней = ПредУровень - ВыборкаНиже.Уровень() + 1;
				НоваяСтрокаДерева = ПоднятьсяНаЧислоУровней(ПредСтрока, РазностьУровней).Строки.Добавить();		 				
				
				РекурсивноПостроитьДерево(ВыборкаНиже,
										  НоваяСтрокаДерева,
										  МассивКолонок,
										  СтрокаДопРеквизитов,
										  ИмяПоляГруппировки,
										  ИмяПоляДляЗаписиИмениГруппировки, 
										  ОсновноеПолеНижнегоУровня,
										  СтруктураУровнейСИерархией);
								
				ПредУровень = ВыборкаНиже.Уровень();   
				ПредСтрока = НоваяСтрокаДерева;
				
			КонецЦикла;
			
		Иначе
			
			СтрокаДерева[ИмяПоляГруппировки] = СтрокаДерева[ОсновноеПолеНижнегоУровня];
			
		КонецЕсли;	        
		
	КонецЕсли;
	
КонецФункции

// Строит соответствие по результату запроса с одноуровневой группировкой по полю группировки.
//
// Параметры:
//  РезультатЗапроса - РезультатЗапроса
//  ИмяПоляИтогов	 - Строка
//  ИмяПоляВыборки	 - Строка
// 
// Возвращаемое значение:
//  Соответствие
//
Функция СоответствиеПоРезультатуЗапросаСОдноуровневойГруппировкой(РезультатЗапроса, ИмяПоляИтогов, ИмяПоляВыборки) Экспорт
	
	РезультатСоответствие = Новый Соответствие; 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РезультатСоответствие;
	КонецЕсли;
	
	ВыборкаГруппировка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппировка.Следующий() Цикл
		Выборка = ВыборкаГруппировка.Выбрать();
		МассивДеталей = Новый Массив;
		Пока Выборка.Следующий() Цикл
			МассивДеталей.Добавить(Выборка[ИмяПоляВыборки]);
		КонецЦикла;
		РезультатСоответствие.Вставить(ВыборкаГруппировка[ИмяПоляИтогов], МассивДеталей);
	КонецЦикла;
	
	Возврат РезультатСоответствие;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Отладочный метод, позволяющий просмотреть движения документа по регистру.
//
// Параметры:
//  Регистратор	 - ДокументСсылка - документ-регистратор.
//  ИмяРегистра	 - Строка	 - имя регистра движений.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - выгруженная таблица записей регистра.
//
Функция ЗаписиРегистратора(Регистратор, ИмяРегистра) Экспорт
	
	ТаблицаДвижений = упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру(ИмяРегистра);
	Выборка = РегистрыСведений[ИмяРегистра].ВыбратьПоРегистратору(Регистратор);
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат ТаблицаДвижений;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВернутьЗначениеЯчейки(вхТекстЯчейки)
	
	ТекстЯчейкиНРегСокрЛП = НРег(СокрЛП(вхТекстЯчейки));
	Если Не ЗначениеЗаполнено(вхТекстЯчейки) Тогда
		Возврат вхТекстЯчейки;
	ИначеЕсли ТекстЯчейкиНРегСокрЛП = "истина" ИЛИ ТекстЯчейкиНРегСокрЛП = "да" Тогда
		Возврат Истина;
	ИначеЕсли ТекстЯчейкиНРегСокрЛП = "ложь" ИЛИ ТекстЯчейкиНРегСокрЛП = "нет" Тогда
		Возврат Ложь;
	Иначе
		Попытка 
			тЧисло = Число(ТекстЯчейкиНРегСокрЛП);
			Возврат тЧисло;
		Исключение
			Возврат вхТекстЯчейки;
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВидСравненияИЗначениеПостроителяПоСКД(ОтборСКД)
	
	Результат = Новый Структура("ВидСравнения, Значение");
	Если ОтборСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
		Результат.ВидСравнения = ВидСравнения.НеРавно;
		Результат.Значение = упоПроверкаЗаполненияВызовСервера.обПустоеЗначениеТипа(ТипЗнч(ОтборСКД.ПравоеЗначение));
	ИначеЕсли ОтборСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		Результат.ВидСравнения = ВидСравнения.Равно;
		Результат.Значение = упоПроверкаЗаполненияВызовСервера.обПустоеЗначениеТипа(ТипЗнч(ОтборСКД.ПравоеЗначение));
	Иначе
		Результат.ВидСравнения = ВидСравнения[СтрЗаменить(""+ОтборСКД.ВидСравнения, " ","")];
		Если ТипЗнч(ОтборСКД.ПравоеЗначение) = Тип("СтандартнаяДатаНачала") Тогда
			Результат.Значение = ОтборСКД.ПравоеЗначение.Дата;
		Иначе
			Результат.Значение = ОтборСКД.ПравоеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЦветИзСтиляПлатформы(рЦветКакЭлементСтиля)
	
	Попытка
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Область(1, 1, 1, 1).ЦветФона = рЦветКакЭлементСтиля;
		ТемпФайл = ПолучитьИмяВременногоФайла("htm");
		ТабДок.Записать(ТемпФайл, ТипФайлаТабличногоДокумента.HTML);
		
		рКодПоиска = "tr.R0 td.R0C0{ background-color:"; // Если 1С изменит формат, эту строку придется поменять.
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ТемпФайл);
		Текст = ТекстДок.ПолучитьТекст();
		Позиция = Найти(Текст, рКодПоиска);
		Если Позиция<>0 Тогда
			Возврат СокрЛП(ВРег(Сред(Текст, Позиция + СтрДлина(рКодПоиска), 8)));
		КонецЕсли;
		
		Возврат "";
		
	Исключение
		
		НСтрока = НСтр("ru = 'ПолучитьЦветИзСтиляПлатформы, ошибка: %1'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ОписаниеОшибки());
		Сообщение.Сообщить();
		
		Возврат "";
		
	КонецПопытки;
	
КонецФункции

Процедура НоваяСтрокаКоллекцииОбъектовМетаданных(Имя, ВводитсяНаОсновании, Таб)
	
	НоваяСтрока = Таб.Добавить();
	НоваяСтрока.Родитель			= Имя;
	НоваяСтрока.ВводитсяНаОсновании = ВводитсяНаОсновании;
	
КонецПроцедуры

Процедура ЗаполнитьФункциональныеОпцииОбъектаМетаданных(ТаблицаОбъектовВводНаОсновании, ФункциональныеОпции,
													 ОбъектМетаданных, ИмяОбъектаМетаданных)
	
	Строка = ТаблицаОбъектовВводНаОсновании.Добавить();
	Строка.ИмяОбъектаМетаданных = ИмяОбъектаМетаданных;
	
	ФункциональныеОпцииОбъектаМетаданных = Новый Массив;
	Для Каждого ФункциональнаяОпция Из ФункциональныеОпции Цикл
		Если ФункциональнаяОпция.Состав.Найти(ОбъектМетаданных) <> Неопределено Тогда
			ФункциональныеОпцииОбъектаМетаданных.Добавить(ФункциональнаяОпция.Имя);
		КонецЕсли;
	КонецЦикла;	
	
	Строка.ФунциональныеОпцииОбъектаМетаданных = ФункциональныеОпцииОбъектаМетаданных;
	
КонецПроцедуры

Процедура ДобавитьВМассивОбщиеПоляРегистраИТаблицы(МассивКолонок, КолонкиТаблицы, ПоляРегистра)
	
	Для Каждого ПолеРегистра Из ПоляРегистра Цикл	
		Если КолонкиТаблицы.Найти(ПолеРегистра.Имя) <> Неопределено Тогда
			МассивКолонок.Добавить(ПолеРегистра.Имя);
		КонецЕсли;	
	КонецЦикла; 
	
КонецПроцедуры	

#КонецОбласти


