
////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры для получения настроек учета по подразделениям.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует структуру настроек учета (из регистров) по подразделениям для прикладного объекта.
//
// Параметры:
//  СсылкаНаОбъект	 - СправочникСсылка.Проекты, СправочникСсылка.упоПортфелиПроектов	 - проект/портфель.
// 
// Возвращаемое значение:
//  Структура - содержит настройки по подразделениям.
//
Функция ЗаполнитьПараметрыУчетаПоПодразделениям(СсылкаНаОбъект) Экспорт
	
	СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ПолучитьСвойстваУчетаПоУмолчанию();
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		Если ТипЗнч(СтруктураСвойств.НастройкаПоказателейДляКарточкиПроектов) = Тип("Строка") Тогда
			СтруктураСвойств.НастройкаПоказателейДляКарточкиПроектов = ПолучитьИзВременногоХранилища(СтруктураСвойств.НастройкаПоказателейДляКарточкиПроектов);
		КонецЕсли;
		
		Возврат СтруктураСвойств;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Для Каждого КлючЗначение Из СтруктураСвойств Цикл
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ЭтоНовыйОбъект", СсылкаНаОбъект.Пустая());
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.упоПортфелиПроектов") Тогда
		
		Запрос.Текст = упоАналитикаПоПодразделениямСервер.ПолучитьТекстЗапросаДляПортфеля();
		
		СписокПортфелей = Новый СписокЗначений;
		СписокПортфелей.Добавить(СсылкаНаОбъект);	
		
		Запрос.УстановитьПараметр("СписокПортфелей", СписокПортфелей);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Проекты") Тогда
		
		Запрос.Текст =  упоАналитикаПоПодразделениямСервер.ДополнитьЗапросПроектов();
				
		СписокПортфелей = Новый СписокЗначений;
		СписокПортфелей.Добавить(СсылкаНаОбъект.ПортфельПроектов);	
		
		СписокПроектов = Новый СписокЗначений;
		СписокПроектов.Добавить(СсылкаНаОбъект);
		
		СписокОбъектов = Новый СписокЗначений;
		СписокОбъектов.Добавить(СсылкаНаОбъект.ПортфельПроектов);
		СписокОбъектов.Добавить(СсылкаНаОбъект);
		
		Запрос.УстановитьПараметр("СписокПортфелей", СписокПортфелей);
		Запрос.УстановитьПараметр("СписокПроектов", СписокПроектов);
		Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
		
	Иначе
		
		Возврат СтруктураСвойств;
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураСвойств, Выборка);
	
	Если ТипЗнч(СтруктураСвойств.НастройкаПоказателейДляКарточкиПроектов) = Тип("Строка") Тогда
		СтруктураСвойств.НастройкаПоказателейДляКарточкиПроектов = ПолучитьИзВременногоХранилища(СтруктураСвойств.НастройкаПоказателейДляКарточкиПроектов);
	КонецЕсли;
 	
	Возврат СтруктураСвойств;
	
КонецФункции

#КонецОбласти
