
Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ДоступСКУД.ЗоныИТочкиДоступа КАК ИКТ_ДоступСКУДЗоныИТочкиДоступа
	|ГДЕ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.ЗонаДоступа.Ссылка = &Ссылка";
	ЗонаДоступа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка,"Зона"); 
	Запрос.УстановитьПараметр("Ссылка",ЗонаДоступа);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьСпр = Выборка.Ссылка.ПолучитьОбъект();
		МассивСтрок = ЗаписьСпр.ЗоныИТочкиДоступа.НайтиСтроки(Новый Структура("ЗонаДоступа",ЗонаДоступа));
		Для Каждого Стр Из МассивСтрок Цикл
			Если Не ДолжностьСотрудникаСвязанаСЗоной(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка,"Должность"),ЗонаДоступа) Тогда
				ЗаписьСпр.ЗоныИТочкиДоступа.Удалить(Стр);
			КонецЕсли;
		КонецЦикла;
		ЗаписьСпр.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ДолжностьСотрудникаСвязанаСЗоной(Должность, Зона)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ЗоныДолжностей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ЗоныДолжностей КАК ИКТ_ЗоныДолжностей
	|ГДЕ
	|	ИКТ_ЗоныДолжностей.Должность = &Должность
	|	И ИКТ_ЗоныДолжностей.Зона = &Зона";
	Запрос.УстановитьПараметр("Должность",Должность);
	Запрос.УстановитьПараметр("Зона",Зона);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь
	Иначе
		Возврат Истина
	КонецЕсли;
	
КонецФункции