#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветФонаАктивный = ЦветаСтиля.ЦветФонаПодсказки;
	ЦветФона = ЦветаСтиля.ЦветФонаФормы;
	
	ЗаполнитьТаблицуДоступныхСтилей();
	ДобавитьДоступныеСтилиНаФорму();
	
	ТекущийСтиль = упоИнтеграцияКлиентСерверПовтИсп.ИмяТекущегоСтиляОформления();
	
	Если Не ЗначениеЗаполнено(ТекущийСтиль) Тогда
		ТекущийСтиль = "Основной";		
	КонецЕсли;
	
	ВыбранныйСтиль = ТекущийСтиль;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыделитьВыбранныйСтиль();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПерезапуститьСеанс(Команда)
	
	СохранитьВыборСтиля(ВыбранныйСтиль);	
	
	ЗавершитьРаботуСистемы(Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПревьюСтиляНажатие(Элемент)
	ВыборСтиля(Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДоступныхСтилей()

	Для Каждого Стиль Из Метаданные.Стили Цикл
		
		НоваяСтрока = ДоступныеСтили.Добавить();
		НоваяСтрока.Имя = Стиль.Имя;
		НоваяСтрока.Название = Стиль.Синоним;
		
		Если НоваяСтрока.Имя = "Основной" Тогда
			ИмяОбщейКартинки = "упоСтильПревьюОсновной";
		Иначе 
			ИмяОбщейКартинки = "упоСтильПревью" + Стиль.Комментарий;			
		КонецЕсли; 	
		
		Если Метаданные.ОбщиеКартинки.Найти(ИмяОбщейКартинки) = Неопределено Тогда 
			ИмяОбщейКартинки = "";
		КонецЕсли;
		
		НоваяСтрока.ИмяОбщейКартинкиПревью = ИмяОбщейКартинки;
			
	КонецЦикла; 	

КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныеСтилиНаФорму()
	
	ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , 12, Истина);

	Для Каждого ДоступныйСтиль Из ДоступныеСтили Цикл
	
		ГруппаСтиля = Элементы.Добавить(
			"Группа" + ДоступныйСтиль.Имя, 
			Тип("ГруппаФормы"),
			Элементы.ГруппаСтили
			);			
		ГруппаСтиля.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСтиля.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаСтиля.ОтображатьЗаголовок = Ложь;
		ГруппаСтиля.ЦветФона = ЦветФона;
		ГруппаСтиля.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		ЗаголовокСтиля = Новый ФорматированнаяСтрока(
			ДоступныйСтиль.Название,
			ШрифтЗаголовка
			);
		
		ЭлементНазваниеСтиля = Элементы.Добавить(
			"Надпись" + ДоступныйСтиль.Имя,
			Тип("ДекорацияФормы"),
			ГруппаСтиля
			);
		ЭлементНазваниеСтиля.Вид = ВидДекорацииФормы.Надпись;
		ЭлементНазваниеСтиля.Заголовок = ЗаголовокСтиля;
		
		ЭлементПревьюСтиля = Элементы.Добавить(
			ДоступныйСтиль.Имя,
			Тип("ДекорацияФормы"),
			ГруппаСтиля
			);
		ЭлементПревьюСтиля.Вид = ВидДекорацииФормы.Картинка;
		ЭлементПревьюСтиля.Ширина = 45;
		ЭлементПревьюСтиля.Высота = 10;
		ЭлементПревьюСтиля.РазмерКартинки = РазмерКартинки.Пропорционально;
		ЭлементПревьюСтиля.Гиперссылка = Истина;
		ЭлементПревьюСтиля.ТекстНевыбраннойКартинки = НСтр("ru = 'Картинка недоступна.'");
		ЭлементПревьюСтиля.УстановитьДействие("Нажатие", "Подключаемый_ПревьюСтиляНажатие");
		
		Если ПустаяСтрока(ДоступныйСтиль.ИмяОбщейКартинкиПревью) Тогда
			Продолжить;	
		КонецЕсли; 
		
		ЭлементПревьюСтиля.Картинка = БиблиотекаКартинок[ДоступныйСтиль.ИмяОбщейКартинкиПревью];
	
	КонецЦикла; 	

КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура СохранитьВыборСтиля(ВыбранныйСтиль)
	ХранилищеОбщихНастроек.Сохранить("Конфигурация/Оформление", "СтильОформления", ВыбранныйСтиль);
КонецПроцедуры
 
&НаКлиенте
Процедура ВыделитьВыбранныйСтиль()
		
	ГруппаВыбранногоСтиля = Элементы.Найти("Группа" + ВыбранныйСтиль);
	
	Если ГруппаВыбранногоСтиля = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Для Каждого ГруппаЭлементов Из Элементы.ГруппаСтили.ПодчиненныеЭлементы Цикл
		ГруппаЭлементов.ЦветФона = ?(ГруппаЭлементов = ГруппаВыбранногоСтиля,
			ЦветФонаАктивный, ЦветФона);		
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ВыборСтиля(ИмяСтиля)

	ВыбранныйСтиль = ИмяСтиля;
	ВыделитьВыбранныйСтиль();
	ПредложитьПерезапуск();

КонецПроцедуры
 
&НаКлиенте
Процедура ПредложитьПерезапуск()
	
	Видимость = ТекущийСтиль <> ВыбранныйСтиль;
	
	Элементы.ГруппаПерезапуск.ЦветФона = ?(Видимость, ЦветФонаАктивный, ЦветФона);
	Элементы.ГруппаПредложениеПерезапуска.Видимость = Видимость;
	Элементы.ДекорацияОтступ.Видимость = Не Видимость;
	
КонецПроцедуры
  
#КонецОбласти