#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверкаПравДоступа(Отказ);
		
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойств
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	мДоступноРедактированиеПЗ = Не ЗначениеЗаполнено(Объект.ПроектнаяЗадача);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
		ЗаполнитьРеквизитыПоПроектнойЗадаче();
	КонецЕсли;
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача", "");
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	УстановитьВидимостьДоступностьЭлементов();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект); 
	
	ПересчитатьИтогКоэффициентСложности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТипВыбранногоЗначения = ТипЗнч(ВыбранноеЗначение);
	
	Если ТипВыбранногоЗначения = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		ОбработатьВыборПроектнойЗадачи(ВыбранноеЗначение);
		
	ИначеЕсли ТипВыбранногоЗначения = Тип("СправочникСсылка.Проекты") Тогда
		
		ОбработатьВыборПроекта(ВыбранноеЗначение);
		
	КонецЕсли;

	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПроектнойЗадачи(НоваяПроектнаяЗадача)
	
	ТекущаяПроектнаяЗадача = Объект.ПроектнаяЗадача;
	
	Если ТекущаяПроектнаяЗадача = НоваяПроектнаяЗадача Тогда
		Возврат;
	КонецЕсли;
			
	Модифицированность = Истина;
	ОбработатьВыборПроектнойЗадачиНаСервере(НоваяПроектнаяЗадача);
			
КонецПроцедуры //

&НаКлиенте
Процедура ОбработатьВыборПроекта(НовыйПроект)
	
	ТекущиеПроект = Объект.Проект;
	
	Если ТекущиеПроект = НовыйПроект Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Объект.Проект = НовыйПроект;
	
КонецПроцедуры //

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	Если Не ПараметрыЗаписи.Свойство("ЗатратыПроверены") Тогда
		
		ТаблицыРазличны = СравнитьТаблицыССпецификацией();
		
		Если ТаблицыРазличны Тогда
			Отказ = Истина;
			
			ТекстВопроса = НСтр("ru = 'Данные ролей трудовых ресурсов спецификации отличаются от данных проектной продукции. '")
				+ НСтр("ru = 'Перезаполнить данные ролей трудовых ресурсов проектной продукции из спецификации?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьСоответствиеЗатратЗавершение", ЭтотОбъект, ПараметрыЗаписи);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РолиТР)
			И Объект.РолиТР.Итог("Трудоемкость") <> Объект.Трудоемкость Тогда
		
		ТекстСообщения = НСтр("ru = 'Трудоемкость не совпадает с суммой распределения ролей.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.Трудоемкость", , Отказ);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.РолиТР)
			И Объект.РолиТР.Итог("ПроцентРаспределения") <> 100 Тогда
		
		ТекстСообщения = НСтр("ru = 'Процентов распределения трудозатрат по ролям не равен 100%.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.РолиТР)
			И Объект.РолиТР.Итог("Количество") <> Объект.Количество Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество не совпадает с суммой распределения ролей.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.Количество", , Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РолиТР)
			И Объект.РолиТР.Итог("Нормирование") <> Объект.Нормирование Тогда
		
		ТекстСообщения = НСтр("ru = 'Нормирование по продукту не совпадает с распределением по ролям.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.Нормирование", , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ПараметрыЗаписи.Свойство("ЗаписатьИЗакрыть") Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма,
		Объект,
		Отказ,
		СтандартнаяОбработка,
		ЗавершениеРаботы,
		ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
	Если Не Объект.Шаблон Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = нСтр("ru='Поле ""Проект"" не заполнено.'", "ru");
			Сообщение.Поле = "НадписьПроект";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОпределитьСтатус();
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	Записать(Новый Структура("ЗаписатьИЗакрыть", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеИзСпецификации(Команда)
	
	Если ЗначениеЗаполнено(Объект.Спецификация) Тогда
		
		ТекстВопроса = НСтр("ru='Раздел Ресурсы будет перезаполнен по выбранной спецификации.'");
		
	Иначе
		
		ТекстВопроса = НСтр("ru='Все табличные части раздела Ресурсы будут очищены.'");
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьДанныеПоСпецификацииЗавершение", ЭтотОбъект, Объект.Спецификация);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектнаяПродукцияПриИзменении(Элемент)
	
	Если Объект.ПроектнаяПродукция = Объект.Ссылка Тогда
		
		Объект.ПроектнаяПродукция = Объект.ПроектнаяПродукция.Пустая();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Проект", Объект.Проект);
		ПараметрыОткрытия.Вставить("ВозвращатьСсылкуНаЗеркальныйПроект", Ложь);
		Если ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
			ПараметрыОткрытия.Вставить("ТекЗадача", Объект.ПроектнаяЗадача);
		КонецЕсли;
		
		ОткрытьФорму("Обработка.упоВыборПроектнойЗадачи.Форма.ОсновнаяФормаУправляемая", ПараметрыОткрытия, Элемент);
		
	Иначе 
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ПараметрыОткрытия.Вставить("ЭтоФормаВыбораПроектнойЗадачи", Истина); 
			
		ОткрытьФорму("Справочник.Проекты.Форма.упоФормаСпискаУправляемая", ПараметрыОткрытия,  ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработатьВыборПроектнойЗадачи(ВыбранноеЗначение);
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ПроектнаяЗадача = ПредопределенноеЗначение("Документ.упоПроектнаяЗадача.ПустаяСсылка");
	УстановитьВидимостьДоступностьЭлементов();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроектнаяЗадача = Объект.ПроектнаяЗадача;
	Если ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		ПоказатьЗначение( , ПроектнаяЗадача);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПроектнойПродукцииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ШаблонПроектнойПродукции) Тогда
		
		ТекстВопроса = НСтр("ru='Заполнить данные по шаблону?'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьСтруктуруПоШаблонПроектнойПродукцииЗавершение", ЭтотОбъект,
				Объект.ШаблонПроектнойПродукции);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоследовательностьПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудоемкостьПриИзменении(Элемент)
	
	Если Объект.Нормирование = 0 Тогда
		Объект.КоэффициентСложности = 0;
	Иначе
		Объект.КоэффициентСложности = Объект.Трудоемкость / Объект.Нормирование;	
	КонецЕсли;
	
	ЗаполнитьКоэффициентСложностиДляРолей(Объект.РолиТР, Объект.КоэффициентСложности);
	
	РассчитатьРаспределениеНормированияТрудозатрат();

	ПересчитатьИтогКоэффициентСложности();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	РассчитатьРаспределениеКоличества();

	Если Не Объект.Шаблон И ЗначениеЗаполнено(Объект.ШаблонПроектнойПродукции) Тогда
		
		УстановитьНормированиеППНаСервере();
		НормаПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьНормированиеППНаСервере()
	
	ДанныеИзШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ШаблонПроектнойПродукции, "Количество, Нормирование");
	
	Если ДанныеИзШаблона.Количество <> 0 Тогда
		Коэффициент = Объект.Количество / ДанныеИзШаблона.Количество;
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	
	Объект.Нормирование = ДанныеИзШаблона.Нормирование * Коэффициент;
		
КонецПроцедуры //

&НаКлиенте
Процедура НормаПриИзменении(Элемент)
		
	РассчитатьРаспределениеНормированияТрудозатрат();
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентСложностиПриИзменении(Элемент)
	
	ЗаполнитьКоэффициентСложностиДляРолей(Объект.РолиТР, Объект.КоэффициентСложности);
	
	РассчитатьРаспределениеНормированияТрудозатрат();
	
	ПересчитатьИтогКоэффициентСложности();
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогКоэффициентСложности()
	
	СуммаНормирование = Объект.РолиТР.Итог("Нормирование");
	СуммаТрудоемкость = Объект.РолиТР.Итог("Трудоемкость");	
	
	Если СуммаНормирование <> 0 Тогда
		ЭтотОбъект.ИтогКоэффициентСложностиРолей = СуммаТрудоемкость / СуммаНормирование; 
	КонецЕсли;	
	
КонецПроцедуры //

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНормированиеРолей(ТаблицаРоли, ОбщееНормирование)
	
	Если Не ЗначениеЗаполнено(ТаблицаРоли) Тогда
		Возврат;
	КонецЕсли;
	
	Коэффициенты = КоэффициентыРаспределенияРолей(ТаблицаРоли);
	МассивРаспределения = РаспределитьСуммуПропорциональноКоэффициентам(ОбщееНормирование, Коэффициенты);
	
	Индекс = 0;
	Для Каждого Строка Из ТаблицаРоли Цикл
		Если МассивРаспределения = Неопределено Тогда
			Строка.Нормирование = 0;
		Иначе
			Строка.Нормирование = МассивРаспределения[Индекс];
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКоэффициентСложностиДляРолей(ТаблицаРоли, ОбщийКоэффициент)
	
	Если Не ЗначениеЗаполнено(ТаблицаРоли) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаРоли Цикл
		Строка.КоэффициентСложности = ОбщийКоэффициент;
	КонецЦикла;
		
КонецПроцедуры // 

&НаКлиенте
Процедура ПроектОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьПолеПроектнойЗадачи();
	УстановитьВидимостьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ОчиститьПолеПроектнойЗадачи();
	УстановитьВидимостьДоступностьЭлементов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРолиТР

&НаКлиенте
Процедура РолиТРПроцентРаспределенияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.РолиТР) Тогда
		Возврат;
	КонецЕсли;
	
	ИтоговыйПроцент = Объект.РолиТР.Итог("ПроцентРаспределения");
	Разница = 100 - ИтоговыйПроцент;
	Если Разница <> 0 Тогда
		ПоследняяСтрока = Объект.РолиТР[Объект.РолиТР.Количество() - 1];
		ПоследняяСтрока.ПроцентРаспределения = ПоследняяСтрока.ПроцентРаспределения + Разница;
	КонецЕсли;
	
	РассчитатьРаспределениеКоличестваНормированияТрудозатрат();
	
КонецПроцедуры

&НаКлиенте
Процедура РолиТРПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РолиТР.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущийРесурс = ТекущиеДанные.РольТР;
	
	ПараметрыВыбораПоля = Новый Массив;
	
	Если ЗначениеЗаполнено(ТекущийРесурс) Тогда
		ПараметрыВыбораПоля.Добавить(Новый ПараметрВыбора("РесурсПодразделения", ТекущийРесурс));
	КонецЕсли;
	
	НовыеПараметры = Новый ФиксированныйМассив(ПараметрыВыбораПоля);
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиТРНормированиеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РолиТР.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Нормирование = Объект.РолиТР.Итог("Нормирование");
	
	Для Каждого СтрокаРоли Из Объект.РолиТР Цикл
		упоПроектнаяПродукцияКлиент.ПересчитатьДанныеСтрокиРаспределенияПриИзмененииНомирования(СтрокаРоли,
			Объект.Нормирование, Объект.Количество);
	КонецЦикла;
	
	Объект.Трудоемкость = Объект.РолиТР.Итог("Трудоемкость");
		
КонецПроцедуры

&НаКлиенте
Процедура РолиТРКоэффициентСложностиПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.РолиТР.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	РассчитатьФормулыПоСтрокеРоли(ТекущаяСтрока);
	ПересчитатьИтогКоэффициентСложности();
	
	Объект.КоэффициентСложности = ЭтотОбъект.ИтогКоэффициентСложностиРолей;

КонецПроцедуры

&НаКлиенте
Процедура РолиТРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.РолиТР.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если НоваяСтрока И Не Копирование Тогда
		
		ТекущаяСтрока.КоэффициентСложности = Объект.КоэффициентСложности;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиТРТрудоемкостьПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.РолиТР.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Трудоемкость = Объект.РолиТР.Итог("Трудоемкость");
	Если Объект.Нормирование = 0 ИЛИ ТекущиеДанные.ПроцентРаспределения = 0 Тогда
		ТекущиеДанные.КоэффициентСложности = 0;
	Иначе
		ТекущиеДанные.КоэффициентСложности = ТекущиеДанные.Трудоемкость / Объект.Нормирование / (ТекущиеДанные.ПроцентРаспределения / 100);	
	КонецЕсли;
	
	ПересчитатьИтогКоэффициентСложности();
	Объект.КоэффициентСложности = ЭтотОбъект.ИтогКоэффициентСложностиРолей;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиТРРольТРПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.РолиТР.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСтрокиТабличнойЧасти = Неопределено;
	ЗаполнитьСтруктуруСтрокиТЧТрудовыеРесурсы(СтруктураСтрокиТабличнойЧасти);
	
	ЗаполнитьЗначенияСвойств(СтруктураСтрокиТабличнойЧасти, СтрокаТабличнойЧасти);
	РолиТрудовыхРесурсовРольПриИзменении(СтруктураСтрокиТабличнойЧасти);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураСтрокиТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РолиТРПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.РолиТР.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	Для Каждого Стр Из Объект.РолиТР Цикл
		Если Стр.НомерСтроки = ТекДанные.НомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		Стр.ПроцентРаспределения = Стр.ПроцентРаспределения + ТекДанные.ПроцентРаспределения;   
		ТекДанные.ПроцентРаспределения = 0;
		Прервать;
	КонецЦикла;    
	
	РассчитатьРаспределениеКоличестваНормированияТрудозатрат();
	
КонецПроцедуры

&НаКлиенте
Процедура РолиТРПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;     
	
	Если Копирование Тогда  
		Отказ = Истина;
		НоваяСтрока = Объект.РолиТР.Добавить(); 
		НоваяСтрока.РольТР = ТекДанные.РольТР;
		НоваяСтрока.Подразделение = ТекДанные.Подразделение;
		НоваяСтрока.КоэффициентСложности = ТекДанные.КоэффициентСложности;
		НоваяСтрока.ПрофильТрудозатрат = ТекДанные.ПрофильТрудозатрат;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьПолеПроектнойЗадачи()
	
	Объект.ПроектнаяЗадача = Неопределено;
	ЭтотОбъект.НадписьПроектнаяЗадача = "";
	
КонецПроцедуры //

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитов

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
		П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
		П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
		П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4, П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьТрудоемкостьПроектнойПродукции()

	Объект.Трудоемкость = Объект.Количество * Объект.Нормирование;

КонецПроцедуры //

&НаКлиенте
Процедура РассчитатьКоличествоПоСтроке()
	
	Если Не ЗначениеЗаполнено(Объект.РолиТР) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.РолиТР Цикл
		Строка.Количество = Объект.Трудоемкость * Строка.ПроцентРаспределения / 100;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьФормулыПоСтрокеРоли(Строка)
	
	Строка.Трудоемкость = Объект.Нормирование * Строка.КоэффициентСложности * (Строка.ПроцентРаспределения / 100);
	
	Объект.Трудоемкость = Объект.РолиТР.Итог("Трудоемкость");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПроектнойЗадачиНаСервере(ВыбранноеЗначение)
	
	тОбъект = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);
	тОбъект.ОбработкаЗаполнения(ВыбранноеЗначение);
	ЗначениеВДанныеФормы(тОбъект, Объект);
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача");
	
	ЗаполнитьРеквизитыПоПроектнойЗадаче(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруПоШаблону(ШаблонСтруктуры)
	
	Объект.МатериалыИОборудование.Очистить();
	Объект.РолиТР.Очистить();
	Объект.ДополнительныеЗатраты.Очистить();
	ЗаполнитьТабличныеЧастиПоШаблонуНаСервере(ШаблонСтруктуры); 
	
	ПересчитатьИтогКоэффициентСложности();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеЧастиПоШаблонуНаСервере(ШаблонСтруктуры)
	
	Реквизиты = "ТипДокумента, Количество, ЕдиницаИзмерения, Трудоемкость, ЕдиницаИзмеренияВремени, 
		|ВидОперации, МинимальнаяДлительность, СкоростьВыполнения,
		|Нормирование, КоэффициентСложности,
		|Последовательность, ПроектнаяПродукция, Спецификация";
	
	ЗаполнитьЗначенияСвойств(Объект, ШаблонСтруктуры, Реквизиты);
	Объект.ДополнительныеЗатраты.Загрузить(ШаблонСтруктуры.ДополнительныеЗатраты.Выгрузить());
	Объект.РолиТР.Загрузить(ШаблонСтруктуры.РолиТР.Выгрузить());
	Объект.МатериалыИОборудование.Загрузить(ШаблонСтруктуры.МатериалыИОборудование.Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	ДоступностьШаблона 		= Истина;
	ДоступностьПоПЗ 		= Истина;
	ДоступностьПроектнаяПродукция 	= Ложь;
	ДоступностьПоШаблону 	= Не Объект.Шаблон;
	
	Если ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
		
		ДоступностьШаблона 	= Ложь;
		ДоступностьПоПЗ 	= Ложь;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ШаблонПроектнойПродукции) Тогда
		
		ДоступностьШаблона = Ложь;
		
	КонецЕсли;
	
	ПоследовательностьСовместно = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Перечисление.упоПоследовательность.СовместноС");
	
	Если ЗначениеЗаполнено(Объект.Последовательность) И Объект.Последовательность = ПоследовательностьСовместно Тогда
		
		ДоступностьПроектнаяПродукция = Истина;
		
	КонецЕсли;
	
	Элементы.СтраницаДополнительная.Видимость 	= ДоступностьПоШаблону;
	Элементы.НадписьПроектнаяЗадача.Видимость 	= ДоступностьПоШаблону;
	Элементы.Проект.Видимость					= ДоступностьПоШаблону;
	Элементы.ОбъектПП.Видимость 				= ДоступностьПоШаблону;
	Элементы.ШаблонПроектнойПродукции.Видимость = ДоступностьПоШаблону;
	Элементы.ГруппаКодПП.Видимость 				= ДоступностьПоШаблону;
	Элементы.ГруппаПравая.Видимость 			= ДоступностьПоШаблону;
	Элементы.Норма.ТолькоПросмотр 				= ДоступностьПоШаблону;
	Элементы.РолиТРНормирование.ТолькоПросмотр 	= ДоступностьПоШаблону;
	
	Элементы.ПроектнаяПродукция.Видимость 	= ДоступностьПроектнаяПродукция;	
	Элементы.Шаблон.ТолькоПросмотр 			= Не ДоступностьШаблона;
	
	УстановитьЗапретРедактированияЭлементовДляГруппыРекурсивно(Элементы.СтраницаОсновная, Не мДоступноРедактированиеПЗ);
	
	Если Не мДоступноРедактированиеПЗ Тогда	
		Элементы.ГруппаКод.ТолькоПросмотр = 				Истина;
		Элементы.ГруппаПравая.ТолькоПросмотр = 				Истина;
		Элементы.НадписьПроектнаяЗадача.ТолькоПросмотр	= 	Истина;
		Элементы.Проект.ТолькоПросмотр					= 	Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗапретРедактированияЭлементовДляГруппыРекурсивно(Элемент, ЗапрещеноИзменятьЗначение = Истина)
	
	Если ТипЗнч(Элемент) = Тип("ГруппаФормы") И Элемент.ПодчиненныеЭлементы.Количество() Тогда
		Для каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
			УстановитьЗапретРедактированияЭлементовДляГруппыРекурсивно(ПодчиненныйЭлемент, ЗапрещеноИзменятьЗначение);
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
		Элемент.Доступность = Не ЗапрещеноИзменятьЗначение;
	Иначе
		Элемент.ТолькоПросмотр = ЗапрещеноИзменятьЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСпецификации()
	
	Объект.РолиТР.Очистить();
	Объект.МатериалыИОборудование.Очистить();
	Объект.ДополнительныеЗатраты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Спецификация);
	Запрос.УстановитьПараметр("Количество", Объект.Количество);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСпецификацииРолиТР.РольТР КАК РольТР,
		|	упоСпецификацииРолиТР.Подразделение КАК Подразделение,
		|	упоСпецификацииРолиТР.ПроцентРаспределения КАК ПроцентРаспределения,
		|	упоСпецификацииРолиТР.ПрофильТрудозатрат КАК ПрофильТрудозатрат,
		|	&Количество * упоСпецификацииРолиТР.ПроцентРаспределения / 100 КАК Количество
		|ИЗ
		|	Справочник.упоСпецификации.РолиТР КАК упоСпецификацииРолиТР
		|ГДЕ
		|	упоСпецификацииРолиТР.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСпецификацииМатериалыИОборудование.Номенклатура КАК Номенклатура,
		|	упоСпецификацииМатериалыИОборудование.Количество КАК Количество,
		|	упоСпецификацииМатериалыИОборудование.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	упоСпецификацииМатериалыИОборудование.ПрофильРаспределения КАК ПрофильРаспределения
		|ИЗ
		|	Справочник.упоСпецификации.МатериалыИОборудование КАК упоСпецификацииМатериалыИОборудование
		|ГДЕ
		|	упоСпецификацииМатериалыИОборудование.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСпецификацииДополнительныеЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
		|	упоСпецификацииДополнительныеЗатраты.СпособПривязкиДопЗатрат КАК СпособПривязкиДопЗатрат,
		|	упоСпецификацииДополнительныеЗатраты.Стоимость КАК Стоимость,
		|	упоСпецификацииДополнительныеЗатраты.Валюта КАК Валюта
		|ИЗ
		|	Справочник.упоСпецификации.ДополнительныеЗатраты КАК упоСпецификацииДополнительныеЗатраты
		|ГДЕ
		|	упоСпецификацииДополнительныеЗатраты.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[0].Пустой() Тогда
		Объект.РолиТР.Загрузить(РезультатЗапроса[0].Выгрузить());
	КонецЕсли;
	Если Не РезультатЗапроса[1].Пустой() Тогда
		Объект.МатериалыИОборудование.Загрузить(РезультатЗапроса[1].Выгрузить());
	КонецЕсли;
	Если Не РезультатЗапроса[2].Пустой() Тогда
		Объект.ДополнительныеЗатраты.Загрузить(РезультатЗапроса[2].Выгрузить());
	КонецЕсли;
		
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоСпецификацииЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеПоСпецификации();
		
		ЗаполнитьКоэффициентСложностиДляРолей(Объект.РолиТР, Объект.КоэффициентСложности);
		ЭтотОбъект.ИтогКоэффициентСложностиРолей = Объект.КоэффициентСложности;
		
		ЗаполнитьНормированиеРолей(Объект.РолиТР, Объект.Нормирование);
		
		Для Каждого СтрокаТР Из Объект.РолиТР Цикл
			РассчитатьФормулыПоСтрокеРоли(СтрокаТР);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеЗатратЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеПоСпецификации();
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ЗатратыПроверены", Истина);
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Функция СравнитьТаблицыССпецификацией()
	
	ТаблицыРазличны = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РолиТР.РольТР КАК РольТР,
		|	РолиТР.ПроцентРаспределения КАК ПроцентРаспределения,
		|	РолиТР.ПрофильТрудозатрат КАК ПрофильТрудозатрат
		|ПОМЕСТИТЬ РолиТР
		|ИЗ
		|	&РолиТР КАК РолиТР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МатериалыИОборудование.Номенклатура КАК Номенклатура,
		|	МатериалыИОборудование.Количество КАК Количество,
		|	МатериалыИОборудование.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	МатериалыИОборудование.ПрофильРаспределения КАК ПрофильРаспределения
		|ПОМЕСТИТЬ МатериалыИОборудование
		|ИЗ
		|	&МатериалыИОборудование КАК МатериалыИОборудование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ДополнительныеЗатраты.СпособПривязкиДопЗатрат КАК СпособПривязкиДопЗатрат,
		|	ДополнительныеЗатраты.Стоимость КАК Стоимость,
		|	ДополнительныеЗатраты.Валюта КАК Валюта
		|ПОМЕСТИТЬ ДопЗатраты
		|ИЗ
		|	&ДополнительныеЗатраты КАК ДополнительныеЗатраты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Ссылка
		|ИЗ
		|	Справочник.упоСпецификации.ДополнительныеЗатраты КАК упоСпецификацииДополнительныеЗатраты
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДопЗатраты КАК ДопЗатраты
		|		ПО упоСпецификацииДополнительныеЗатраты.СтатьяЗатрат = ДопЗатраты.СтатьяЗатрат
		|			И упоСпецификацииДополнительныеЗатраты.СпособПривязкиДопЗатрат = ДопЗатраты.СпособПривязкиДопЗатрат
		|			И упоСпецификацииДополнительныеЗатраты.Стоимость = ДопЗатраты.Стоимость
		|			И упоСпецификацииДополнительныеЗатраты.Валюта = ДопЗатраты.Валюта
		|ГДЕ
		|	упоСпецификацииДополнительныеЗатраты.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА ДопЗатраты.СтатьяЗатрат ЕСТЬ NULL
		|					ИЛИ упоСпецификацииДополнительныеЗатраты.СтатьяЗатрат ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА
		|ИЗ
		|	Справочник.упоСпецификации.РолиТР КАК упоСпецификацииРолиТР
		|		ПОЛНОЕ СОЕДИНЕНИЕ РолиТР КАК РолиТР
		|		ПО упоСпецификацииРолиТР.РольТР = РолиТР.РольТР
		|			И упоСпецификацииРолиТР.ПроцентРаспределения = РолиТР.ПроцентРаспределения
		|			И упоСпецификацииРолиТР.ПрофильТрудозатрат = РолиТР.ПрофильТрудозатрат
		|ГДЕ
		|	упоСпецификацииРолиТР.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА РолиТР.РольТР ЕСТЬ NULL
		|					ИЛИ упоСпецификацииРолиТР.РольТР ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА
		|ИЗ
		|	Справочник.упоСпецификации.МатериалыИОборудование КАК упоСпецификацииМатериалыИОборудование
		|		ПОЛНОЕ СОЕДИНЕНИЕ МатериалыИОборудование КАК МатериалыИОборудование
		|		ПО упоСпецификацииМатериалыИОборудование.Номенклатура = МатериалыИОборудование.Номенклатура
		|			И упоСпецификацииМатериалыИОборудование.Количество = МатериалыИОборудование.Количество
		|			И упоСпецификацииМатериалыИОборудование.ЕдиницаИзмерения = МатериалыИОборудование.ЕдиницаИзмерения
		|			И упоСпецификацииМатериалыИОборудование.ПрофильРаспределения = МатериалыИОборудование.ПрофильРаспределения
		|ГДЕ
		|	упоСпецификацииМатериалыИОборудование.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА МатериалыИОборудование.Номенклатура ЕСТЬ NULL
		|					ИЛИ упоСпецификацииМатериалыИОборудование.Номенклатура ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Спецификация);
	Запрос.УстановитьПараметр("РолиТР", Объект.РолиТР.Выгрузить());
	Запрос.УстановитьПараметр("ДополнительныеЗатраты", Объект.ДополнительныеЗатраты.Выгрузить());
	Запрос.УстановитьПараметр("МатериалыИОборудование", Объект.МатериалыИОборудование.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицыРазличны = Не РезультатЗапроса.Пустой();
	
	Возврат ТаблицыРазличны;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыПоПроектнойЗадаче()
	
	ПроектнаяЗадача = Объект.ПроектнаяЗадача;
	текВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ПроектнаяПродукция", Объект.Ссылка);
	Запрос.УстановитьПараметр("текВерсия", текВерсия);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Субпродукты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Субпродукты.Количество КАК Количество,
		|	СтруктурыПД.Последовательность КАК Последовательность
		|ИЗ
		|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &Ссылка
		|				И Версия = &текВерсия
		|				И Номенклатура = &ПроектнаяПродукция) КАК Субпродукты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПроектнойПродукции.СрезПоследних(
		|				,
		|				ПроектнаяЗадача = &Ссылка
		|					И Версия = &текВерсия
		|					И ПроектнаяПродукция = &ПроектнаяПродукция) КАК СтруктурыПД
		|		ПО Субпродукты.Номенклатура = СтруктурыПД.ПроектнаяПродукция
		|ГДЕ
		|	(Субпродукты.Количество <> 0
		|			ИЛИ Субпродукты.Сумма <> 0
		|			ИЛИ Субпродукты.СуммаВалютная <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Субпродукты.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Объект, Выборка);
	
	Если мДоступноРедактированиеПЗ Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
			Объект.Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
		КонецЕсли;
		
		Объект.ОбъектПП = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача, 
			"Объект",, текВерсия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьСтатус()
	
	Элементы.НадписьСтатус.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	Если Не ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
		НадписьСтатус = "";
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяПродукция", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", Объект.ПроектнаяЗадача);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоОчередьРасчетаСтатусовПроектнойПродукции.ПроектнаяПродукция КАК ПроектнаяПродукция
		|ИЗ
		|	РегистрСведений.упоОчередьРасчетаСтатусовПроектнойПродукции КАК упоОчередьРасчетаСтатусовПроектнойПродукции
		|ГДЕ
		|	упоОчередьРасчетаСтатусовПроектнойПродукции.ПроектнаяПродукция = &ПроектнаяПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСтатусыПроектнойПродукцииСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.упоСтатусыПроектнойПродукции.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &ПроектнаяЗадача
		|				И ПроектнаяПродукция = &ПроектнаяПродукция) КАК упоСтатусыПроектнойПродукцииСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО упоСтатусыПроектнойПродукцииСрезПоследних.Версия = упоВерсииПроекта.Версия
		|			И (упоВерсииПроекта.Текущая)";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда
		Если РезультатЗапроса[1].Пустой() Тогда
			НадписьСтатус = "";
		Иначе
			Выборка = РезультатЗапроса[1].Выбрать();
			Выборка.Следующий();
			НадписьСтатус = Выборка.Статус;
		КонецЕсли;
	Иначе
		НадписьСтатус = НСтр("ru = 'Статус не актуален: очередь расчета статуса не пустая'");
		Элементы.НадписьСтатус.ЦветТекста = ЦветаСтиля.ПоясняющийОшибкуТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруПоШаблонПроектнойПродукцииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтруктуруПоШаблону(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруСтрокиТЧТрудовыеРесурсы(СтруктураСтрокиТабличнойЧасти)
			
	СтруктураСтрокиТабличнойЧасти = Новый Структура();
	СтруктураСтрокиТабличнойЧасти.Вставить("РольТР");
	СтруктураСтрокиТабличнойЧасти.Вставить("Подразделение");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РолиТрудовыхРесурсовРольПриИзменении(СтруктураСтрокиТрудовогоРесурса)
	
	ДатаПолученияДанных = ТекущаяДатаСеанса();
	СтруктураСтрокиТрудовогоРесурса.Подразделение = 
		упоУправлениеФормамиСервер.ПолучитьПодразделениеРолиВызовСервера(СтруктураСтрокиТрудовогоРесурса.РольТР, 
			ДатаПолученияДанных);

КонецПроцедуры //

&НаКлиентеНаСервереБезКонтекста
Функция КоэффициентыРаспределенияРолей(ТаблицаРолей)
	
	Коэффициенты = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаРолей Цикл
		Коэффициенты.Добавить(СтрокаТаблицы.ПроцентРаспределения);
	КонецЦикла;
	
	Возврат Коэффициенты;
	
КонецФункции

&НаКлиенте
Функция РаспределитьСуммуПропорциональноКоэффициентамРаспределенияРолей(знач СуммаРаспределения)
	
	Коэффициенты = КоэффициентыРаспределенияРолей(Объект.РолиТР);
	
	Возврат РаспределитьСуммуПропорциональноКоэффициентам(СуммаРаспределения, Коэффициенты);
	
КонецФункции

&НаКлиенте
Процедура РассчитатьРаспределениеКоличестваНормированияТрудозатрат()
	
	РассчитатьРаспределениеКоличества();
	РассчитатьРаспределениеНормированияТрудозатрат();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРаспределениеКоличества()
	
	МассивРаспределения = РаспределитьСуммуПропорциональноКоэффициентамРаспределенияРолей(Объект.Количество);
	Индекс = 0;
	Для Каждого Строка Из Объект.РолиТР Цикл
		Если МассивРаспределения = Неопределено Тогда
			Строка.Количество = 0;
		Иначе
			Строка.Количество = МассивРаспределения[Индекс];
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРаспределениеНормированияТрудозатрат()
	
	МассивРаспределения = РаспределитьСуммуПропорциональноКоэффициентамРаспределенияРолей(Объект.Нормирование);
	Индекс = 0;
	Для Каждого Строка Из Объект.РолиТР Цикл
		Если МассивРаспределения = Неопределено Тогда
			Строка.Трудоемкость = 0;
			Строка.Нормирование = 0;
		Иначе
			Строка.Трудоемкость = МассивРаспределения[Индекс] * Строка.КоэффициентСложности;
			Строка.Нормирование = МассивРаспределения[Индекс];
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Объект.Трудоемкость = Объект.РолиТР.Итог("Трудоемкость");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РаспределитьСуммуПропорциональноКоэффициентам(РаспределяемаяСумма, Коэффициенты)
	
	Возврат ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(РаспределяемаяСумма, 
		Коэффициенты);
	
КонецФункции

&НаСервере
Процедура ПроверкаПравДоступа(Отказ)
	
	ЕстьПравоПросмотра = ПравоДоступа("Просмотр", Метаданные.Справочники.упоПроектнаяПродукция)
		И ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.упоДанныеПлановВыпускаСубпродуктов)
		И ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.упоДанныеПроектнойПродукции);	
	
	Если ЕстьПравоПросмотра Тогда
		Возврат;
	КонецЕсли;	
						
	ВызватьИсключение НСтр("ru = 'Недостаточно прав для просмотра'");			
	
КонецПроцедуры

#КонецОбласти 
