
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Список, Отказ, СтандартнаяОбработка); 		 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		лВладелецФормы = упоФункцииОбщегоНазначенияКлиентСервер.ПолучитьФормуЭлементаФормы(ЭтаФорма.ВладелецФормы);
		Если ТипЗнч(лВладелецФормы) = Тип("УправляемаяФорма") И лВладелецФормы.ИмяФормы = "ОбщаяФорма.упоФормаОтчета" Тогда
			УстановитьОтборПоПроектуАналогичныйОтборуОтчета(лВладелецФормы.Отчет, лВладелецФормы.мИмяОтчета);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Список, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Список, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Список, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Список, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Список, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4, П5, П5, П6);
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункцииОбработчиков

&НаКлиенте
Процедура УстановитьОтборПоПроектуАналогичныйОтборуОтчета(Отчет, ИмяОтчета)
	
	Список.Отбор.Элементы.Очистить();	
	
	Поле = Новый ПолеКомпоновкиДанных("Проект");
	ЭлементПН = Неопределено;
	тПравоеЗначение = Неопределено;
	тВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	СгруппироватьПоПроектам = Ложь;
	
	Если ИмяОтчета = "ОтчетОбъект.упоПланФактныйАнализПоПрограмме" 
		Или ИмяОтчета = "ОтчетОбъект.упоПланФактныйАнализПоПортфелю" Тогда
		
		Если ИмяОтчета = "ОтчетОбъект.упоПланФактныйАнализПоПрограмме" Тогда
			ПолеОтбора = Новый ПараметрКомпоновкиДанных("ПрограммаПроектов");
		ИначеЕсли ИмяОтчета = "ОтчетОбъект.упоПланФактныйАнализПоПортфелю" Тогда
			ПолеОтбора = Новый ПараметрКомпоновкиДанных("ПортфельПроектов");
		КонецЕсли;
		
		ПараметрКД = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеОтбора);
		Если ПараметрКД <> Неопределено Тогда
			ЭлементПН = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрКД.ИдентификаторПользовательскойНастройки);
			Если ЭлементПН = Неопределено Тогда 
				ЭлементПН = ПараметрКД;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭлементПН.Значение) Тогда
				тПравоеЗначение = упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(ЭлементПН.Значение, "ПроектСтруктуры");
			Иначе
				СгруппироватьПоПроектам = Истина;
			КонецЕсли;	
		КонецЕсли;
		
	Иначе
		Для Каждого Элемент Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.ЛевоеЗначение = Поле Тогда	
				ЭлементПН = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Элемент.ИдентификаторПользовательскойНастройки);
				Если ЭлементПН = Неопределено Тогда 
					ЭлементПН = Элемент;
				КонецЕсли;
				Если ЭлементПН.Использование Тогда
					тПравоеЗначение = ЭлементПН.ПравоеЗначение;
					тВидСравнения = ЭлементПН.ВидСравнения;
				Иначе
					СгруппироватьПоПроектам = Истина;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла; 
	КонецЕсли;
	
	Если СгруппироватьПоПроектам Тогда
		ГруппировкаСписка = ЭтаФорма.Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ГруппировкаСписка.Использование = Истина;
		ГруппировкаСписка.Поле = Поле;
	ИначеЕсли тПравоеЗначение <> Неопределено Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Поле;
		Отбор.Использование = Истина;
		Отбор.ВидСравнения = тВидСравнения;
		Отбор.ПравоеЗначение = тПравоеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
