
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка);
	
	ТаблицаРаспределения = ПолучитьИзВременногоХранилища(Параметры.АдресТР);
	КолонкаИндекса = Параметры.КолонкаИндекса;
	РаспределятьКоличество = Параметры.РаспределятьКоличество;
	
	СписокПериодов.ЗагрузитьЗначения(Параметры.СписокПериодов.ВыгрузитьЗначения());
	СписокЭлементовДляДобавления = Новый СписокЗначений;
	МассивРеквизитов = Новый Массив;
	
	Если Параметры.РаспределятьКоличество Тогда
		
		Элементы.ГруппаТекущиеДанныеРаспределения.Видимость = Истина;
				
	Иначе 
		
		Элементы.ГруппаТекущиеДанныеРаспределения.Видимость = Ложь;
	
	КонецЕсли;
	
	Для Каждого КолонкаПрограммно Из Параметры.СписокКолонокПрограммно Цикл
		
		КолонкаТаблицы = ТаблицаРаспределения.Колонки.Найти(КолонкаПрограммно.Представление);	 
		НоваяКолонка = Новый РеквизитФормы(КолонкаТаблицы.Имя,КолонкаТаблицы.ТипЗначения,"ТаблицаДоходов",
			КолонкаТаблицы.Заголовок, Истина);
		МассивРеквизитов.Добавить(НоваяКолонка);
		СписокЭлементовДляДобавления.Добавить(КолонкаТаблицы.Имя, КолонкаТаблицы.Заголовок);
		
	КонецЦикла;
	
	МассивТиповЧ = Новый Массив;
	МассивТиповЧ.Добавить(Тип("Число"));
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	
	ОписаниеТиповЧ =  Новый ОписаниеТипов(МассивТиповЧ,,,КЧ);
	
	Для Каждого РеквизитИтогов Из Параметры.СписокКолонокИтогов Цикл
		
		НоваяКолонкаИтогов = Новый РеквизитФормы(РеквизитИтогов.Значение,ОписаниеТиповЧ,,, Истина);	
		МассивРеквизитов.Добавить(НоваяКолонкаИтогов);
		
	КонецЦикла;
		
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);	
	
	Если РаспределятьКоличество Тогда
		
		Для Каждого ЭлементСпискаПериодов Из СписокПериодов Цикл
			
			НоваяГруппа = Элементы.Добавить("Группа_" + Формат(ЭлементСпискаПериодов.Значение,"ДФ=MM_yyyy"),
				Тип("ГруппаФормы"), Элементы.ТаблицаДоходов.ПодчиненныеЭлементы.ТаблицаДоходовГруппаПрограммно);
			НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
			НоваяГруппа.Группировка =  ГруппировкаКолонок.Горизонтальная;
			НоваяГруппа.ОтображатьВШапке = Истина;
			НоваяГруппа.Заголовок=Формат(ЭлементСпискаПериодов.Значение, "ДФ='MMMM yyyy'");
			НоваяГруппа.ЦветФонаЗаголовка = ЦветаСтиля.упоЦветДиаграммыГантаРабочееЗаданиеЗапланировано;
			
			ИмяКолонкиКоличество = "Количество_"+Формат(ЭлементСпискаПериодов.Значение,"ДФ=MM_yyyy");
			
			НоваяКолонкаЭлемент = ЭтаФорма.Элементы.Добавить(ИмяКолонкиКоличество, Тип("ПолеФормы"), НоваяГруппа);			
			НоваяКолонкаЭлемент.ПутьКДанным = "ТаблицаДоходов" + "." + ИмяКолонкиКоличество;
			НоваяКолонкаЭлемент.Доступность = Истина;
			НоваяКолонкаЭлемент.Заголовок = "Количество";
			НоваяКолонкаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НоваяКолонкаЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;		 
			НоваяКолонкаЭлемент.ПутьКДаннымПодвала =  "Всего_" + ИмяКолонкиКоличество;
			НоваяКолонкаЭлемент.ЦветФонаЗаголовка = ЦветаСтиля.упоЦветДиаграммыГантаРабочееЗаданиеЗапланировано;
			
			НоваяКолонкаЭлемент.УстановитьДействие("ПриИзменении", "ТаблицаДоходовКоличествоПриИзменении");
			
			ИмяКолонкиСумма = "Сумма_"+Формат(ЭлементСпискаПериодов.Значение,"ДФ=MM_yyyy");
			
			НоваяКолонкаЭлемент = ЭтаФорма.Элементы.Добавить(ИмяКолонкиСумма, Тип("ПолеФормы"), НоваяГруппа);			
			НоваяКолонкаЭлемент.ПутьКДанным = "ТаблицаДоходов" + "." + ИмяКолонкиСумма;
			НоваяКолонкаЭлемент.Доступность = Истина;
			НоваяКолонкаЭлемент.Заголовок = "Сумма";
			НоваяКолонкаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НоваяКолонкаЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;		 
			НоваяКолонкаЭлемент.ПутьКДаннымПодвала =  "Всего_" + ИмяКолонкиСумма;
			НоваяКолонкаЭлемент.ЦветФонаЗаголовка = ЦветаСтиля.упоЦветДиаграммыГантаРабочееЗаданиеЗапланировано;
		
			НоваяКолонкаЭлемент.УстановитьДействие("ПриИзменении", "ТаблицаДоходовСуммаПриИзменении");
			
		КонецЦикла;
		
	Иначе	 		 
		
		Для Каждого ГодПланирования Из СписокЭлементовДляДобавления Цикл
			
			НоваяКолонкаЭлемент = ЭтаФорма.Элементы.Добавить(ГодПланирования.Значение, Тип("ПолеФормы"),
				Элементы.ТаблицаДоходов.ПодчиненныеЭлементы.ТаблицаДоходовГруппаПрограммно);			
			НоваяКолонкаЭлемент.ПутьКДанным = "ТаблицаДоходов" + "." + ГодПланирования.Значение;
			НоваяКолонкаЭлемент.Доступность = Истина;
			НоваяКолонкаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НоваяКолонкаЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;		 
			НоваяКолонкаЭлемент.УстановитьДействие("ПриИзменении", "ТаблицаДоходовСуммаПриИзменении");
			НоваяКолонкаЭлемент.ПутьКДаннымПодвала =  "Всего_" + ГодПланирования.Значение;
			НоваяКолонкаЭлемент.ЦветФонаЗаголовка = ЦветаСтиля.упоЦветДиаграммыГантаРабочееЗаданиеЗапланировано;
	
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого СтрокаТР Из ТаблицаРаспределения Цикл
		
		НоваяСтрока = ТаблицаДоходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТР);		 
		НоваяСтрока.Роль = СтрокаТР.Роль;
		НоваяСтрока.Подразделение = СтрокаТР.Подразделение;
		НоваяСтрока.ИсходныйНомерСтроки=СтрокаТР.НомерСтроки;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	
	ПересчитатьОстаткиВСтрокахРаспределения();
	
	ПересчитатьИтогиВРаспределенииПоПериодам(РаспределятьКоличество);
	 
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, , Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, , ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, , Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, , Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, , Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, , Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДоходов

&НаСервере
Процедура ПодготовитьРезультатРаспределения(РезультатРаспределения)
	
	РезультатРаспределения = Новый Структура;
	
	ТаблицаРаспределенная = Новый ТаблицаЗначений;
	ТаблицаРаспределенная.Колонки.Добавить("Период");
	ТаблицаРаспределенная.Колонки.Добавить("ИндексСтрокиРаспределениеПоРолям");
	ТаблицаРаспределенная.Колонки.Добавить("ИндексСтрокиРаспределенияДоходов");
	ТаблицаРаспределенная.Колонки.Добавить("ИндексСтрокиРаспределенияРасходов");
	ТаблицаРаспределенная.Колонки.Добавить("Сумма");
	ТаблицаРаспределенная.Колонки.Добавить("Количество");
	
	Для Каждого СтрокаТР Из ТаблицаДоходов Цикл
		
		Для Каждого СтрокаПериода Из СписокПериодов Цикл
			
			НоваяСтрока = ТаблицаРаспределенная.Добавить();
			НоваяСтрока[КолонкаИндекса] = СтрокаТР.ИсходныйНомерСтроки;
			НоваяСтрока.Период = СтрокаПериода.Значение;	
			НоваяСтрока.Сумма = СтрокаТР["Сумма_"+Формат(СтрокаПериода.Значение,"ДФ=MM_yyyy")];
			Если РаспределятьКоличество Тогда
				НоваяСтрока.Количество =СтрокаТР["Количество_"+Формат(СтрокаПериода.Значение,"ДФ=MM_yyyy")];
			Иначе 
				НоваяСтрока.Количество = 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	АдресТР = ПоместитьВоВременноеХранилище(ТаблицаРаспределенная, ЭтаФорма.УникальныйИдентификатор);
	
	РезультатРаспределения.Вставить("АдресТР", АдресТР);
	РезультатРаспределения.Вставить("РаспределениеДоходов", Истина);
	РезультатРаспределения.Вставить("Модифицированность", ЭтаФорма.Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЭтаФорма.Модифицированность = Истина;
	ПересчитатьИтогиВРаспределенииПоПериодам(РаспределятьКоличество);
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоходовКоличествоПриИзменении(Элемент)
	
	Подключаемый_РаспределениеДоходовПоМесяцамКоличествоПриИзменении(Элемент);
	ПересчитатьОстаткиВСтрокахРаспределения(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоходовСуммаПриИзменении(Элемент)
	
	Подключаемый_РаспределениеДоходовПоМесяцамСуммаПриИзменении(Элемент);
	ПересчитатьОстаткиВСтрокахРаспределения();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДоходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте	
Процедура Подключаемый_РаспределениеДоходовПоМесяцамКоличествоПриИзменении(Элемент)
	
	ТекущиеДанныеОбъемов = Элементы.ТаблицаДоходов.ТекущиеДанные;
	
	Если ТекущиеДанныеОбъемов <> Неопределено Тогда
		
		ТекущаяСтоимость = ТекущиеДанныеОбъемов.Стоимость;
				
		ИмяРеквизитаТекущее = Элемент.Имя;
		
		КоличествоТекущее  = ТекущиеДанныеОбъемов[ИмяРеквизитаТекущее];
		ОбщСтоимостьТекущая = КоличествоТекущее * ТекущаяСтоимость;
		
		ИмяРеквизитаСумма = СтрЗаменить(ИмяРеквизитаТекущее,"Количество_"  ,"Сумма_");
		ТекущиеДанныеОбъемов[ИмяРеквизитаСумма]  = ОбщСтоимостьТекущая;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте	
Процедура Подключаемый_РаспределениеДоходовПоМесяцамСуммаПриИзменении(Элемент)
	
	ТекущиеДанныеОбъемов = Элементы.ТаблицаДоходов.ТекущиеДанные;
	
	Если ТекущиеДанныеОбъемов <> Неопределено Тогда
			
		ИмяРеквизитаТекущее = Элемент.Имя;
		
		ТекущиеДанныеРаспределенияПоПериодам = Элементы.ТаблицаДоходов.ТекущиеДанные;
		СтоимостьТекущая = ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаТекущее];
		ТекущаяСтоимость = ТекущиеДанныеОбъемов.Стоимость;
		
		Если ТекущаяСтоимость <> 0 Тогда
			
			КоличествоТекущее = СтоимостьТекущая/ТекущаяСтоимость;			
			ИмяРеквизитаКоличество = СтрЗаменить(ИмяРеквизитаТекущее, "Сумма_","Количество_");
			ТекущиеДанныеРаспределенияПоПериодам[ИмяРеквизитаКоличество]  = КоличествоТекущее;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьИЗакрыть(Команда)
	
	Перем РезультатРаспределения;
	ПодготовитьРезультатРаспределения(РезультатРаспределения);
	
	Отказ = Ложь;
	
	Для Каждого СтрокаДоходов Из ТаблицаДоходов Цикл
		
		Если РаспределятьКоличество Тогда
			
			Если СтрокаДоходов.КоличествоОстаток <> 0 Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Количество, распределенное по месяцам, не соответствует общему количеству'");
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаДоходов.ОстатокКРаспределению <> 0 Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Сумма, распределенная по месяцам, не соответствует общей сумме'");
			Сообщение.Сообщить();
			
			Отказ = Истина;			
		
		КонецЕсли;		
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		ОповеститьОВыборе(РезультатРаспределения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте	
Процедура  ПересчитатьОстаткиВСтрокахРаспределения()
	
	Для Каждого СтрокаРаспределения Из ТаблицаДоходов Цикл
		
		СуммаВсего = СтрокаРаспределения.Сумма;
		СуммаОстаток = 0;
		
		Если РаспределятьКоличество Тогда
			
			КоличествоВсего = СтрокаРаспределения.Количество;
			КоличествоОстаток = 0;
			
		КонецЕсли;
		
		Для Каждого ПериодРаспределения Из СписокПериодов Цикл
			
			ИмяКолонкиСумма =        "Сумма_"+Формат(ПериодРаспределения.Значение,"ДФ=MM_yyyy");
			СуммаОстаток =  СуммаОстаток + СтрокаРаспределения[ИмяКолонкиСумма];
			
			Если РаспределятьКоличество Тогда
				
				ИмяКолонкиКоличество = "Количество_"+Формат(ПериодРаспределения.Значение,"ДФ=MM_yyyy");
				КоличествоОстаток = КоличествоОстаток + СтрокаРаспределения[ИмяКолонкиКоличество];
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаРаспределения.ОстатокКРаспределению = СуммаВсего- СуммаОстаток;
		СтрокаРаспределения.СуммаРаспределено = СуммаОстаток;
		
		Если РаспределятьКоличество Тогда
			
			СтрокаРаспределения.КоличествоОстаток = КоличествоВсего - КоличествоОстаток;
			СтрокаРаспределения.КоличествоРаспределено = КоличествоВсего;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте	
Процедура ПересчитатьИтогиВРаспределенииПоПериодам(РаспределятьКоличество = Ложь)
		
	Если РаспределятьКоличество Тогда
		ЭтаФорма.КоличествоОстатокИтог = 0;
		ЭтаФорма.КоличествоРаспределеноИтог = 0;		 
	КонецЕсли;
		
	ЭтаФорма.СуммаОстатокИтог = 0;
	ЭтаФорма.СуммаРаспределеноИтог = 0;		 
	
		// Вертикальные итоги.
		Для Каждого ЭлементСпискаПрограммно Из Элементы.ТаблицаДоходовГруппаПрограммно.ПодчиненныеЭлементы Цикл
			
			Счетчик = 0;
			ПериодЗашифрованный = ПолучитьЗашифрованныйПериод(ЭлементСпискаПрограммно.Имя);			 
			ИмяКолонкиСумма = "Сумма_"+Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");
			ИмяКолонкиКоличество = "Количество_"+Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");				
			
			ЭтаФорма["Всего_" + ИмяКолонкиСумма] = 0; 
			Если РаспределятьКоличество Тогда
				ЭтаФорма["Всего_" + ИмяКолонкиКоличество] = 0;		 
			КонецЕсли;
					
			Для Каждого СтрокаРаспределения Из ТаблицаДоходов Цикл
				
				Если Счетчик = 0 Тогда
					ЭтаФорма["Всего_" + ИмяКолонкиСумма] = 0;					 
					Если РаспределятьКоличество Тогда
						ЭтаФорма["Всего_" + ИмяКолонкиКоличество] = 0;		 
					КонецЕсли;
					
				КонецЕсли;				
				
				ЭтаФорма["Всего_" + ИмяКолонкиСумма] = ЭтаФорма["Всего_" + ИмяКолонкиСумма] + СтрокаРаспределения[ИмяКолонкиСумма]; 
				
				Если РаспределятьКоличество Тогда
					ЭтаФорма["Всего_" + ИмяКолонкиКоличество] = ЭтаФорма["Всего_" + ИмяКолонкиКоличество] 
						+ СтрокаРаспределения[ИмяКолонкиКоличество];		 
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Горизонтальные итоги.
	
		Для Каждого СтрокаРаспределения Из ТаблицаДоходов Цикл
						
			ВсегоРаспределеноСумма = 0;
			ВсегоРаспределеноКоличество = 0;
			
			Для Каждого ЭлементСпискаПрограммно Из Элементы.ТаблицаДоходовГруппаПрограммно.ПодчиненныеЭлементы Цикл
				
				ПериодЗашифрованный = ПолучитьЗашифрованныйПериод(ЭлементСпискаПрограммно.Имя);			 
				
				Если РаспределятьКоличество Тогда
					
					ИмяКолонкиКоличество = "Количество_"+Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");				
					ВсегоРаспределеноКоличество = ВсегоРаспределеноКоличество + СтрокаРаспределения[ИмяКолонкиКоличество];
					ЭтаФорма["Всего_" + ИмяКолонкиКоличество] = Формат(ТаблицаДоходов.Итог(ИмяКолонкиКоличество),"ЧДЦ=2");
					
				КонецЕсли;
				
				ИмяКолонкиСумма = "Сумма_"+Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");
				ВсегоРаспределеноСумма = ВсегоРаспределеноСумма + СтрокаРаспределения[ИмяКолонкиСумма];
				
				ЭтаФорма["Всего_" + ИмяКолонкиСумма ] = Формат(ТаблицаДоходов.Итог(ИмяКолонкиСумма), "ЧДЦ=2");
				
			КонецЦикла;
			
			СтрокаРаспределения.СуммаРаспределено =  ВсегоРаспределеноСумма;
			Если РаспределятьКоличество Тогда
				СтрокаРаспределения.КоличествоРаспределено  =  ВсегоРаспределеноКоличество;
				СтрокаРаспределения.КоличествоОстаток  =  СтрокаРаспределения.Количество - ВсегоРаспределеноКоличество;
			КонецЕсли;
			
			СтрокаРаспределения.ОстатокКРаспределению =  СтрокаРаспределения.Сумма - ВсегоРаспределеноСумма;
			
			Если РаспределятьКоличество Тогда
				ЭтаФорма.КоличествоОстатокИтог = ЭтаФорма.КоличествоОстатокИтог  + СтрокаРаспределения.КоличествоОстаток;
				ЭтаФорма.КоличествоРаспределеноИтог = ЭтаФорма.КоличествоРаспределеноИтог  + СтрокаРаспределения.КоличествоРаспределено;;		 
			КонецЕсли;
						
			ЭтаФорма.СуммаОстатокИтог = ЭтаФорма.СуммаОстатокИтог + СтрокаРаспределения.ОстатокКРаспределению;
			ЭтаФорма.СуммаРаспределеноИтог = ЭтаФорма.СуммаРаспределеноИтог + СтрокаРаспределения.СуммаРаспределено;		 

		КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте	
Функция ПолучитьЗашифрованныйПериод(Знач ЭлементСпискаПрограммноИмя)
	
	// Например, "Группа_РаспределениеОбъемов_Март_2014".
	Если РаспределятьКоличество Тогда
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Группа_", "");
	Иначе
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Сумма_", "");
	КонецЕсли;

	Позиция_ = Найти(ЭлементСпискаПрограммноИмя, "_");
	
	ПодстрокаМесяц = Лев(ЭлементСпискаПрограммноИмя, Позиция_);
	ПодстрокаГод = СтрЗаменить(ЭлементСпискаПрограммноИмя,  ПодстрокаМесяц, "");
	
	ПодстрокаМесяц = СтрЗаменить(ПодстрокаМесяц, "_", "");	  
	МесяцЧислом = Число(ПодстрокаМесяц);
	ГодЧислом = Число(ПодстрокаГод);
	
	ЗашифрованныйПериод = КонецМесяца(Дата(ГодЧислом, МесяцЧислом, 1));
	
	Возврат ЗашифрованныйПериод;
	
КонецФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти