
&ИзменениеИКонтроль("УровеньДоступаКСвойствамПользователя")
Функция Расш1_УровеньДоступаКСвойствамПользователя(ОписаниеОбъекта, ПараметрыОбработки)

	УровеньДоступа = Новый Структура;

	// Администратор системы (системные данные).
	УровеньДоступа.Вставить("АдминистраторСистемы", Пользователи.ЭтоПолноправныйПользователь(, Истина));

	// Полноправный пользователь (пользовательские данные).
	УровеньДоступа.Вставить("ПолныеПрава", Пользователи.ЭтоПолноправныйПользователь());

	Если ТипЗнч(ОписаниеОбъекта.Ссылка) = Тип("СправочникСсылка.Пользователи") Тогда
		// Ответственный за список пользователей.
		УровеньДоступа.Вставить("УправлениеСписком",
		ПравоДоступа("Добавление", Метаданные.Справочники.Пользователи)
		И (УровеньДоступа.ПолныеПрава
		Или Не Пользователи.ЭтоПолноправныйПользователь(ОписаниеОбъекта.Ссылка)));
		// Пользователь текущего пользователя ИБ.
		УровеньДоступа.Вставить("ИзменениеТекущего",
		УровеньДоступа.ПолныеПрава
		Или ПравоДоступа("Изменение", Метаданные.Справочники.Пользователи)
		И ОписаниеОбъекта.Ссылка = Пользователи.АвторизованныйПользователь());

	ИначеЕсли ТипЗнч(ОписаниеОбъекта.Ссылка) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		// Ответственный за список внешних пользователей.
		УровеньДоступа.Вставить("УправлениеСписком",
		ПравоДоступа("Добавление", Метаданные.Справочники.ВнешниеПользователи)
		И (УровеньДоступа.ПолныеПрава
		Или Не Пользователи.ЭтоПолноправныйПользователь(ОписаниеОбъекта.Ссылка)));
		// Внешний пользователь текущего пользователя ИБ.
		УровеньДоступа.Вставить("ИзменениеТекущего",
		УровеньДоступа.ПолныеПрава
		Или ПравоДоступа("Изменение", Метаданные.Справочники.ВнешниеПользователи)
		И ОписаниеОбъекта.Ссылка = Пользователи.АвторизованныйПользователь());
	КонецЕсли;

	Если ПараметрыОбработки = Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если ЗначениеЗаполнено(ОписаниеОбъекта.ИдентификаторПользователяИБ) Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ОписаниеОбъекта.ИдентификаторПользователяИБ);
		Иначе
			ПользовательИБ = Неопределено;
		КонецЕсли;
		ПользовательБезНастроекДляВходаИлиПодготовлен =
		ПользовательИБ = Неопределено
		Или ОписаниеОбъекта.Подготовлен
		И Не Пользователи.ВходВПрограммуРазрешен(ПользовательИБ);
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		ПользовательБезНастроекДляВходаИлиПодготовлен =
		Не ПараметрыОбработки.СтарыйПользовательИБСуществует
		Или ПараметрыОбработки.СтарыйПользователь.Подготовлен
		И Не Пользователи.ВходВПрограммуРазрешен(ПараметрыОбработки.ОписаниеСтарогоПользователяИБ);
	КонецЕсли;

	УровеньДоступа.Вставить("ИзменениеРазрешенияНаВход",
	УровеньДоступа.АдминистраторСистемы
	Или УровеньДоступа.ПолныеПрава
	И Не Пользователи.ЭтоПолноправныйПользователь(ОписаниеОбъекта.Ссылка, Истина));

	УровеньДоступа.Вставить("ОтключениеРазрешенияНаВход",
	УровеньДоступа.АдминистраторСистемы
	Или УровеньДоступа.ПолныеПрава
	И Не Пользователи.ЭтоПолноправныйПользователь(ОписаниеОбъекта.Ссылка, Истина)
	Или УровеньДоступа.УправлениеСписком);

	УровеньДоступа.Вставить("НастройкиДляВхода",
	УровеньДоступа.АдминистраторСистемы
	Или УровеньДоступа.ПолныеПрава
	И Не Пользователи.ЭтоПолноправныйПользователь(ОписаниеОбъекта.Ссылка, Истина)
	Или УровеньДоступа.УправлениеСписком
	И ПользовательБезНастроекДляВходаИлиПодготовлен);

	УровеньДоступа.Вставить("НетДоступа",
	НЕ УровеньДоступа.АдминистраторСистемы
	И НЕ УровеньДоступа.ПолныеПрава
	И НЕ УровеньДоступа.УправлениеСписком
	И НЕ УровеньДоступа.ИзменениеТекущего
	И НЕ УровеньДоступа.НастройкиДляВхода);

	#Вставка
	// 17162
	Если Не Пользователи.ЭтоПолноправныйПользователь(ОписаниеОбъекта.Ссылка, Истина) 
		И РольДоступна("ИКТ_ДобавлениеИзменениеПользователейБезПолныхПрав") Тогда
		
		УровеньДоступа.Вставить("ИзменениеТекущего",		 Истина);
	  	УровеньДоступа.Вставить("ИзменениеРазрешенияНаВход", Истина);  
	  	УровеньДоступа.Вставить("НастройкиДляВхода", 		 Истина); 
		
	КонецЕсли;
	#КонецВставки
	Возврат УровеньДоступа;

КонецФункции


&ИзменениеИКонтроль("ЗаписатьПользователяИБ")
Процедура Расш1_ЗаписатьПользователяИБ(ПользовательОбъект, ПараметрыОбработки)

	ДополнительныеСвойства = ПользовательОбъект.ДополнительныеСвойства;
	ОписаниеПользователяИБ = ДополнительныеСвойства.ОписаниеПользователяИБ;
	СтарыйПользователь     = ПараметрыОбработки.СтарыйПользователь;
	#Вставка
	Если ПараметрыОбработки.СтарыйПользовательИБСуществует = Ложь Тогда
		ДополнительныеСвойства.РасширенныеСвойстваПользователяИБ.ПотребоватьСменуПароляПриВходе = Истина;
	КонецЕсли;
	#КонецВставки

	Если ОписаниеПользователяИБ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ОписаниеПользователяИБ.Свойство("ПотребоватьСменуПароляПриВходе") Тогда
		ЗаписатьСвойствоПотребоватьСменуПароляПриВходе(СсылкаОбъекта(ПользовательОбъект),
		ОписаниеПользователяИБ.ПотребоватьСменуПароляПриВходе);

		Если ОписаниеПользователяИБ.Количество() = 2 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	СоздатьНовогоПользователяИБ = Ложь;

	Если ОписаниеПользователяИБ.Свойство("УникальныйИдентификатор")
		И ЗначениеЗаполнено(ОписаниеПользователяИБ.УникальныйИдентификатор)
		И ОписаниеПользователяИБ.УникальныйИдентификатор
		<> ПараметрыОбработки.СтарыйПользователь.ИдентификаторПользователяИБ Тогда

		ИдентификаторПользователяИБ = ОписаниеПользователяИБ.УникальныйИдентификатор;

	ИначеЕсли ЗначениеЗаполнено(СтарыйПользователь.ИдентификаторПользователяИБ) Тогда
		ИдентификаторПользователяИБ = СтарыйПользователь.ИдентификаторПользователяИБ;
		СоздатьНовогоПользователяИБ = НЕ ПараметрыОбработки.СтарыйПользовательИБСуществует;
	Иначе
		ИдентификаторПользователяИБ = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
		СоздатьНовогоПользователяИБ = Истина;
	КонецЕсли;

	// Заполнение автоматических свойств пользователя ИБ.
	ОписаниеПользователяИБ.Вставить("ПолноеИмя", ПользовательОбъект.Наименование);

	ХранимыеСвойства = ХранимыеСвойстваПользователяИБ(СсылкаОбъекта(ПользовательОбъект));
	Если ПараметрыОбработки.СтарыйПользовательИБСуществует Тогда
		СтараяАутентификация = ПараметрыОбработки.ОписаниеСтарогоПользователяИБ;
		Если Пользователи.ВходВПрограммуРазрешен(СтараяАутентификация) Тогда
			ХранимыеСвойства.АутентификацияСтандартная    = СтараяАутентификация.АутентификацияСтандартная;
			ХранимыеСвойства.АутентификацияOpenID         = СтараяАутентификация.АутентификацияOpenID;
			ХранимыеСвойства.АутентификацияOpenIDConnect  = СтараяАутентификация.АутентификацияOpenIDConnect;
			ХранимыеСвойства.АутентификацияТокеномДоступа = СтараяАутентификация.АутентификацияТокеномДоступа;
			ХранимыеСвойства.АутентификацияОС             = СтараяАутентификация.АутентификацияОС;
			УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
		КонецЕсли;
	Иначе
		СтараяАутентификация = Новый Структура;
		СтараяАутентификация.Вставить("АутентификацияСтандартная",    Ложь);
		СтараяАутентификация.Вставить("АутентификацияOpenID",         Ложь);
		СтараяАутентификация.Вставить("АутентификацияOpenIDConnect",  Ложь);
		СтараяАутентификация.Вставить("АутентификацияТокеномДоступа", Ложь);
		СтараяАутентификация.Вставить("АутентификацияОС",             Ложь);
		ХранимыеСвойства.АутентификацияСтандартная    = Ложь;
		ХранимыеСвойства.АутентификацияOpenID         = Ложь;
		ХранимыеСвойства.АутентификацияOpenIDConnect  = Ложь;
		ХранимыеСвойства.АутентификацияТокеномДоступа = Ложь;
		ХранимыеСвойства.АутентификацияОС             = Ложь;
		УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
	КонецЕсли;

	Если ОписаниеПользователяИБ.Свойство("АутентификацияСтандартная") Тогда
		ХранимыеСвойства.АутентификацияСтандартная = ОписаниеПользователяИБ.АутентификацияСтандартная;
		УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
	КонецЕсли;

	Если ОписаниеПользователяИБ.Свойство("АутентификацияOpenID") Тогда
		ХранимыеСвойства.АутентификацияOpenID = ОписаниеПользователяИБ.АутентификацияOpenID;
		УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
	КонецЕсли;

	Если ОписаниеПользователяИБ.Свойство("АутентификацияOpenIDConnect") Тогда
		ХранимыеСвойства.АутентификацияOpenIDConnect = ОписаниеПользователяИБ.АутентификацияOpenIDConnect;
		УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
	КонецЕсли;

	Если ОписаниеПользователяИБ.Свойство("АутентификацияТокеномДоступа") Тогда
		ХранимыеСвойства.АутентификацияТокеномДоступа = ОписаниеПользователяИБ.АутентификацияТокеномДоступа;
		УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
	КонецЕсли;

	Если ОписаниеПользователяИБ.Свойство("АутентификацияОС") Тогда
		ХранимыеСвойства.АутентификацияОС = ОписаниеПользователяИБ.АутентификацияОС;
		УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
	КонецЕсли;

	Если СоздатьНовогоПользователяИБ
		И ОписаниеПользователяИБ.Свойство("ТолькоОбновитьПользователяИБ") Тогда

		Если ХранимыеСвойства.ВходВПрограммуРазрешен <> Ложь Тогда
			ХранимыеСвойства.ВходВПрограммуРазрешен = Ложь;
			УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
		КонецЕсли;

		ОписаниеПользователяИБ.Вставить("РезультатДействия", "ПропущеноДобавлениеПользователяИБ");
		ОписаниеПользователяИБ.Вставить("УникальныйИдентификатор",
		ПользовательОбъект.ИдентификаторПользователяИБ);

		Возврат;

	КонецЕсли;

	УстановитьХранимуюАутентификацию = Неопределено;
	Если ОписаниеПользователяИБ.Свойство("ВходВПрограммуРазрешен") Тогда
		УстановитьХранимуюАутентификацию = ОписаниеПользователяИБ.ВходВПрограммуРазрешен = Истина
		Или ОписаниеПользователяИБ.ВходВПрограммуРазрешен <> Ложь
		И Пользователи.ВходВПрограммуРазрешен(СтараяАутентификация);

	ИначеЕсли ОписаниеПользователяИБ.Свойство("АутентификацияСтандартная")
		И ОписаниеПользователяИБ.АутентификацияСтандартная = Истина
		Или ОписаниеПользователяИБ.Свойство("АутентификацияOpenID")
		И ОписаниеПользователяИБ.АутентификацияOpenID = Истина
		Или ОписаниеПользователяИБ.Свойство("АутентификацияOpenIDConnect")
		И ОписаниеПользователяИБ.АутентификацияOpenIDConnect = Истина
		Или ОписаниеПользователяИБ.Свойство("АутентификацияТокеномДоступа")
		И ОписаниеПользователяИБ.АутентификацияТокеномДоступа = Истина
		Или ОписаниеПользователяИБ.Свойство("АутентификацияОС")
		И ОписаниеПользователяИБ.АутентификацияОС = Истина Тогда

		УстановитьХранимуюАутентификацию = Истина;
	КонецЕсли;

	Если УстановитьХранимуюАутентификацию = Неопределено Тогда
		НоваяАутентификация = СтараяАутентификация;
	Иначе
		Если УстановитьХранимуюАутентификацию Тогда
			ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная",    ХранимыеСвойства.АутентификацияСтандартная);
			ОписаниеПользователяИБ.Вставить("АутентификацияOpenID",         ХранимыеСвойства.АутентификацияOpenID);
			ОписаниеПользователяИБ.Вставить("АутентификацияOpenIDConnect",  ХранимыеСвойства.АутентификацияOpenIDConnect);
			ОписаниеПользователяИБ.Вставить("АутентификацияТокеномДоступа", ХранимыеСвойства.АутентификацияТокеномДоступа);
			ОписаниеПользователяИБ.Вставить("АутентификацияОС",             ХранимыеСвойства.АутентификацияОС);
		Иначе
			ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная",    Ложь);
			ОписаниеПользователяИБ.Вставить("АутентификацияOpenID",         Ложь);
			ОписаниеПользователяИБ.Вставить("АутентификацияOpenIDConnect",  Ложь);
			ОписаниеПользователяИБ.Вставить("АутентификацияТокеномДоступа", Ложь);
			ОписаниеПользователяИБ.Вставить("АутентификацияОС",             Ложь);
		КонецЕсли;
		НоваяАутентификация = ОписаниеПользователяИБ;
	КонецЕсли;

	Если ХранимыеСвойства.ВходВПрограммуРазрешен <> Пользователи.ВходВПрограммуРазрешен(НоваяАутентификация) Тогда
		ХранимыеСвойства.ВходВПрограммуРазрешен = Пользователи.ВходВПрограммуРазрешен(НоваяАутентификация);
		УстановитьХранимыеСвойстваПользователяИБ(ПользовательОбъект, ХранимыеСвойства);
	КонецЕсли;

	// Проверка прав на изменение разрешения входа в программу.
	Если Пользователи.ВходВПрограммуРазрешен(НоваяАутентификация)
		<> Пользователи.ВходВПрограммуРазрешен(СтараяАутентификация) Тогда

		Если Пользователи.ВходВПрограммуРазрешен(НоваяАутентификация)
			И Не ПараметрыОбработки.УровеньДоступа.ИзменениеРазрешенияНаВход
			Или Не Пользователи.ВходВПрограммуРазрешен(НоваяАутентификация)
			И Не ПараметрыОбработки.УровеньДоступа.ОтключениеРазрешенияНаВход Тогда

			ВызватьИсключение ПараметрыОбработки.ТекстСообщенияНедостаточноПрав;
		КонецЕсли;
	КонецЕсли;

	ПарольЗадан = ОписаниеПользователяИБ.Свойство("Пароль")
	И ОписаниеПользователяИБ.Пароль <> Неопределено;

	ХешПароляЗадан = ОписаниеПользователяИБ.Свойство("СохраняемоеЗначениеПароля")
	И ОписаниеПользователяИБ.СохраняемоеЗначениеПароля <> Неопределено;

	ПроверитьПустойПароль =
	Не СтараяАутентификация.АутентификацияСтандартная
	И ХранимыеСвойства.АутентификацияСтандартная
	И (    СоздатьНовогоПользователяИБ
	И Не ПарольЗадан
	Или ПараметрыОбработки.СтарыйПользовательИБСуществует
	И Не ПараметрыОбработки.ОписаниеСтарогоПользователяИБ.ПарольУстановлен);

	Если ПарольЗадан Или Не ХешПароляЗадан И ПроверитьПустойПароль Тогда
		ИмяДляВхода = ?(ОписаниеПользователяИБ.Свойство("Имя"),
		ОписаниеПользователяИБ.Имя, ?(ПараметрыОбработки.СтарыйПользовательИБСуществует,
		ПараметрыОбработки.ОписаниеСтарогоПользователяИБ.Имя, ""));
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("Пользователь", ПользовательОбъект);
		ПараметрыВыполнения.Вставить("ИмяДляВхода",  ИмяДляВхода);
		ПараметрыВыполнения.Вставить("НовыйПароль", ?(ПарольЗадан, ОписаниеПользователяИБ.Пароль, ""));
		ПараметрыВыполнения.Вставить("СтарыйПароль", Неопределено);

		ОписаниеПользователяИБ.Свойство("СтарыйПароль", ПараметрыВыполнения.СтарыйПароль);

		ТекстОшибки = ОбработатьНовыйПароль(ПараметрыВыполнения);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;

	ИначеЕсли ОбщегоНазначения.РазделениеВключено()
		И ХешПароляЗадан
		И (Не ПараметрыОбработки.СтарыйПользовательИБСуществует
		Или ПараметрыОбработки.ОписаниеСтарогоПользователяИБ.СохраняемоеЗначениеПароля
		<> ОписаниеПользователяИБ.СохраняемоеЗначениеПароля) Тогда

		ОбновитьСведенияПриСменеХешаПароля(ПользовательОбъект);
	КонецЕсли;

	// Попытка записи пользователя ИБ.
	ПараметрыОбновления = Новый Соответствие(ПараметрыСеанса.ОбновлениеСправочниковПользователей);
	ПараметрыОбновления.Вставить("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	ПараметрыСеанса.ОбновлениеСправочниковПользователей = Новый ФиксированноеСоответствие(ПараметрыОбновления);
	ПараметрыОбновления.Удалить("ИдентификаторПользователяИБ");
	Попытка
		Пользователи.УстановитьСвойстваПользователяИБ(ИдентификаторПользователяИБ, ОписаниеПользователяИБ, 
		СоздатьНовогоПользователяИБ, ТипЗнч(ПользовательОбъект) = Тип("СправочникОбъект.ВнешниеПользователи"));
		ПользовательИБ = ОписаниеПользователяИБ.ПользовательИБ;
	Исключение
		ПараметрыСеанса.ОбновлениеСправочниковПользователей = Новый ФиксированноеСоответствие(ПараметрыОбновления);
		ВызватьИсключение;
	КонецПопытки;
	ПараметрыСеанса.ОбновлениеСправочниковПользователей = Новый ФиксированноеСоответствие(ПараметрыОбновления);

	Если ПользовательОбъект.ДополнительныеСвойства.Свойство("СозданиеАдминистратора")
		И ЗначениеЗаполнено(ПользовательОбъект.ДополнительныеСвойства.СозданиеАдминистратора)
		И Не ПользовательОбъект.ОбменДанными.Загрузка
		И РолиАдминистратораДоступны(ПользовательИБ) Тогда

		ПараметрыОбработки.Вставить("СозданиеАдминистратора",
		ПользовательОбъект.ДополнительныеСвойства.СозданиеАдминистратора);
	КонецЕсли;

	Если СоздатьНовогоПользователяИБ Тогда
		ОписаниеПользователяИБ.Вставить("РезультатДействия", "ДобавленПользовательИБ");
		ИдентификаторПользователяИБ = ОписаниеПользователяИБ.УникальныйИдентификатор;
		ПараметрыОбработки.Вставить("УстановкаПользователяИБ");

		Если Не ПараметрыОбработки.УровеньДоступа.ИзменениеРазрешенияНаВход
			И ПараметрыОбработки.УровеньДоступа.УправлениеСписком
			И Не Пользователи.ВходВПрограммуРазрешен(ПользовательИБ) Тогда

			ПользовательОбъект.Подготовлен = Истина;
			ПараметрыОбработки.БлокируемыеРеквизиты.Подготовлен = Истина;
		КонецЕсли;
	Иначе
		ОписаниеПользователяИБ.Вставить("РезультатДействия", "ИзмененПользовательИБ");

		Если Пользователи.ВходВПрограммуРазрешен(ПользовательИБ) Тогда
			ПользовательОбъект.Подготовлен = Ложь;
			ПараметрыОбработки.БлокируемыеРеквизиты.Подготовлен = Ложь;
		КонецЕсли;
	КонецЕсли;

	ПользовательОбъект.ИдентификаторПользователяИБ = ИдентификаторПользователяИБ;

	ОписаниеПользователяИБ.Вставить("УникальныйИдентификатор", ИдентификаторПользователяИБ);

КонецПроцедуры

