////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции интеграции с УПФ.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область СобытияФорм

// См. ПодключаемыеКоманды.ПриСозданииНаСервере
//
Процедура ПодключаемыеКомандыПриСозданииНаСервере(Форма, ПараметрыРазмещения) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЭлементыПроектаВФорму(Форма);
	ЗаполнитьЗаказ(Форма);
	
КонецПроцедуры

// См. МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	СостИмени = упоФункцииОбщегоНазначенияКлиентСервер.СоставИмениФормы(Форма.ИмяФормы);
	ИмяТипаМетаданных = СостИмени.ТипМетаданных;
	
	Если ИмяТипаМетаданных = "Документ" Тогда
		
		ПриСозданииНаСервере_Документы(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли ИмяТипаМетаданных = "Справочник" Тогда
		
		ПриСозданииНаСервере_Справочники(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли ИмяТипаМетаданных = "ПланСчетов" Тогда
		
		ПриСозданииНаСервере_ПланыСчетов(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли ИмяТипаМетаданных = "Отчет" Тогда
		
		ПриСозданииНаСервере_Отчеты(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли ИмяТипаМетаданных = "Обработка" Тогда
		
		ПриСозданииНаСервере_Обработки(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли ИмяТипаМетаданных = "ОбщаяФорма" Тогда
		
		ПриСозданииНаСервере_ОбщиеФормы(СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписок

// Обработчик события, вызываемый при записи класификатора единиц измерения.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево - признак отказа от выполнения обработки.
//
Процедура КлассификаторЕдиницИзмеренияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ИспользуетсяСинхронизацияЕдиницИзмерения() Тогда
		Возврат;
	КонецЕсли;
	
	Упаковка = УпаковкаЕдИзмСвязаннаяСКлассификаторомЕдИзм(Источник.Ссылка);
	
	НужноСоздаватьСоответствиеЕдИзм = Ложь;
	Если ЗначениеЗаполнено(Упаковка) Тогда
		УпаковкаОбъект = Упаковка.ПолучитьОбъект();	
	Иначе;
		НужноСоздаватьСоответствиеЕдИзм = Истина;
		УпаковкаОбъект = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
	КонецЕсли;
	
	УпаковкаОбъект.Наименование = Источник.Наименование;	
	УпаковкаОбъект.Код = Источник.Код;
	УпаковкаОбъект.ПометкаУдаления = Источник.ПометкаУдаления;
	УпаковкаОбъект.Записать();
	
	Если Не НужноСоздаватьСоответствиеЕдИзм Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлассификаторЕдИзм = Источник.Ссылка;
	МенеджерЗаписи.Упаковка = УпаковкаОбъект.Ссылка;
	МенеджерЗаписи.Записать();
			
КонецПроцедуры

// Обработчик события, вызываемый перед записью договора контрагента.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево - признак отказа от выполнения обработки.
//
Процедура ДоговорыКонтрагентовПередЗаписью(Источник, Отказ) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Источник.Контрагент = Источник.Владелец;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый при записи ставки НДС.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево - признак отказа от выполнения обработки.
//
Процедура СтавкаНДСПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ИспользуетсяСинхронизацияСтавокНДС() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.упоСоответствиеСтавкиНДС.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СтавкаСправочник = Источник.Ссылка;
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		
		ПеречислениеНДС = ПеречислениеНДСПоСправочникуНДС(Источник.Ссылка);			
		
		Если ЗначениеЗаполнено(ПеречислениеНДС) Тогда
			МенеджерЗаписи.СтавкаПеречисление = ПеречислениеНДС;			
			МенеджерЗаписи.Записать();
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый при записи пользователя.
//
// Параметры:
//  Источник - Произвольный - источник события.
//  Отказ	 - Булево - признак отказа от выполнения обработки.
//
Процедура упоПользователиПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	РазрешеноРедактирование = РазрешеноРедактированиеПользователя(Источник.Ссылка);
	
	Отказ = Не РазрешеноРедактирование;
	
КонецПроцедуры

// Обработчик события заполнения заказа поставщику.
//
// Параметры:
//  Источник			 - Произвольный
//  ДанныеЗаполнения	 - Произвольный
//  ТекстЗаполнения		 - Строка
//  СтандартнаяОбработка - Булево
//
Процедура упоОбработкаЗаполненияЗаказаПоставщикуУПФОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения,
		СтандартнаяОбработка) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения = Неопределено Или ТипДанныхЗаполнения <> упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат;
	КонецЕсли;
	
	ПроектЗаказаПокупателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Проект", Истина);
	
	Источник.упоПроектнаяЗадача = ПроектЗаказаПокупателя;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

// Осуществляет заполнение пустой информационной базы.
//
// Параметры:
//  Параметры - Произвольный - параметры.
//
Процедура НачальноеЗаполнение(Параметры = Неопределено) Экспорт
	
	упоИнтеграция.СинхронизироватьВсеСтатьиДР();
	ЗаполнитьНеобходимыеРеквизитыПроектовУНФ();
	СинхронизироватьКлассификаторЕдИзмИУпаковкиЕдИзм();
	ЗаполнитьРеквизитКонтрагентВДоговорах();
	СинхронизироватьСтавкиНДС();
	ЗаполнитьВидРесурсаВНоменклатуре();
	ВключитьИспользованиеПодсистемыУчетПоПроектамУНФ();
	ЗаполнитьНаправлениеДвиженияВПредопределенныхСтатьяхДДС();
	ВключитьИспользованиеПодсистемыРаботы();
	
КонецПроцедуры

// Обработчик обновления, который выполняет заполнение реквизитов Компонент и ТекущаяВерсия проектов,
// которые были созданы до подключения подсистемы РМ.
//
Процедура ЗаполнитьНеобходимыеРеквизитыПроектовУНФ() Экспорт
	
	ЭтоУПФ = упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
	Если Не ЭтоУПФ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	НЕ Проекты.ЭтоПроектнаяЗадача
	|	И Проекты.Компонент = &Компонент";
	
	ПустаяСсылкаКомпонента = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоКомпоненты.ПустаяСсылка");
	
	Запрос.УстановитьПараметр("Компонент", ПустаяСсылкаКомпонента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КомпонентПроект = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоКомпоненты.Проект");
	
	Пока Выборка.Следующий() Цикл
		
		ПроектОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПроектОбъект.Компонент = Перечисления.упоКомпоненты.Проект;
		ПроектОбъект.ТекущаяВерсия = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПроектОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления, который создает по классификатору единиц измерения упаковки единиц измерения.
//
Процедура СинхронизироватьКлассификаторЕдИзмИУпаковкиЕдИзм() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлассификаторЕдиницИзмерения.Код КАК Код,
	|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование,
	|	КлассификаторЕдиницИзмерения.ПометкаУдаления КАК ПометкаУдаления,
	|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отказ = Ложь;
	Пока Выборка.Следующий() Цикл
		
		КлассификаторЕдиницИзмеренияПриЗаписи(Выборка, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления, который перезаписывает договора контрагентов для заполнения реквизита "Контрагент".
//
Процедура ЗаполнитьРеквизитКонтрагентВДоговорах() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Контрагент = &Контрагент";
	
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоговорОбъект = Выборка.Ссылка.ПолучитьОбъект();		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДоговорОбъект);
	КонецЦикла;	
	
КонецПроцедуры	

// Обработчик обновления, который сопоставляет значения справочника СтавкиНДС значениям перечисления СтавкиНДС.
//
Процедура СинхронизироватьСтавкиНДС() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСоответствиеСтавкиНДС.СтавкаСправочник КАК СтавкаСправочник
	               |ПОМЕСТИТЬ СинхронизированныеСтавки
	               |ИЗ
	               |	РегистрСведений.упоСоответствиеСтавкиНДС КАК упоСоответствиеСтавкиНДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтавкиНДС.Ссылка КАК Ссылка,
	               |	СтавкиНДС.Ставка КАК Ставка,
	               |	СтавкиНДС.Расчетная КАК Расчетная,
	               |	СтавкиНДС.ВидСтавкиНДС КАК ВидСтавкиНДС
	               |ИЗ
	               |	Справочник.СтавкиНДС КАК СтавкиНДС
	               |ГДЕ
	               |	НЕ СтавкиНДС.Ссылка В
	               |				(ВЫБРАТЬ
	               |					СинхронизированныеСтавки.СтавкаСправочник
	               |				ИЗ
	               |					СинхронизированныеСтавки)";
	
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		ПеречислениеНДС = ПеречислениеНДСПоСправочникуНДС(Выборка.Ссылка);
				
		Если ЗначениеЗаполнено(ПеречислениеНДС) Тогда
			
			НЗ = РегистрыСведений.упоСоответствиеСтавкиНДС.СоздатьНаборЗаписей();
			НЗ.Отбор.СтавкаСправочник.Установить(Выборка.Ссылка);
			НЗ.Прочитать();
			Запись = НЗ.Добавить();
			Запись.СтавкаСправочник 	= Выборка.Ссылка;
			Запись.СтавкаПеречисление 	= ПеречислениеНДС;					
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НЗ);		
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления, который заполняет реквизит упоВидРесурса в справончике Номенклатура.
//
Процедура ЗаполнитьВидРесурсаВНоменклатуре() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.упоВидРесурса = ЗНАЧЕНИЕ(Перечисление.упоВидРесурса.ПустаяСсылка)
	               |	И НЕ Номенклатура.ЭтоГруппа";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.упоВидРесурса = Перечисления.упоВидРесурса.Материальный;
		Объект.упоВидМатериальногоРесурса = Перечисления.упоВидМатериальногоРесурса.Материал;
					
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления, который включает использование "Учета по проектам" в УНФ.
//
Процедура ВключитьИспользованиеПодсистемыУчетПоПроектамУНФ() Экспорт
	
	МенеджерЗначенияКонстанты = Константы.ФункциональнаяОпцияУчетПоПроектам.СоздатьМенеджерЗначения();
	МенеджерЗначенияКонстанты.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначенияКонстанты);		
	
КонецПроцедуры

// Обработчик обновления, который включает использование подсистемы Работы в УНФ.
//
Процедура ВключитьИспользованиеПодсистемыРаботы() Экспорт
	
	МенеджерЗначенияКонстанты = Константы["ФункциональнаяОпцияИспользоватьПодсистемуРаботы"].СоздатьМенеджерЗначения();
	МенеджерЗначенияКонстанты.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначенияКонстанты);
	
КонецПроцедуры

// Обработчик обновления заполняющий реквизит упоНаправлениеДвижения
// в предопределнных статьях СтатьиДвиженияДенежныхСредств
//
Процедура ЗаполнитьНаправлениеДвиженияВПредопределенныхСтатьяхДДС() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка,
	|	ИСТИНА КАК ЭтоВыплаты
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Родитель = &ОперационныеПлатежи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	|	ИСТИНА
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Родитель = &ФинансовыеПлатежи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	|	ИСТИНА
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Родитель = &ИнвестиционныеПлатежи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Родитель = &ОперационныеПоступления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Родитель = &ФинансовыеПоступления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Родитель = &ИнвестиционныеПоступления";
	
	Запрос.УстановитьПараметр("ИнвестиционныеПлатежи", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПлатежи"));
	Запрос.УстановитьПараметр("ОперационныеПлатежи", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ОперационныеПлатежи"));
	Запрос.УстановитьПараметр("ФинансовыеПлатежи", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ФинансовыеПлатежи"));
	Запрос.УстановитьПараметр("ОперационныеПоступления", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ОперационныеПоступления"));
	Запрос.УстановитьПараметр("ФинансовыеПоступления", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ФинансовыеПоступления"));
	Запрос.УстановитьПараметр("ИнвестиционныеПоступления", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ИнвестиционныеПоступления"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выплата = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Выплата;
	Поступление = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление;
	
	Пока Выборка.Следующий() Цикл
		
		СтатьяОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если Выборка.ЭтоВыплаты Тогда
			СтатьяОбъект.упоНаправлениеДвижения = Выплата;	
		Иначе
			СтатьяОбъект.упоНаправлениеДвижения = Поступление;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СтатьяОбъект);
		
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область СчетаУчета

// Изменяет элементы формы выбора плана счетов "Управленческий".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора плана счетов "Управленческий"
//
Процедура ИзменитьЭлементы_ПланСчета_Управленческий_ФормаВыбора(Форма) Экспорт

	// Добавим реквизит на форму для последующего определения выбранного значения в событии выбора статьи.
	ИмяРеквизита = упоИнтеграцияУПФКлиентСервер.ИмяРеквизитаДляОпределенияВыбораСвязанойСтатьи();
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Булево"));	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если Форма.Параметры.Свойство(ИмяРеквизита) Тогда
		
		// Установим действие выбор у элемента "Список"
		Элементы = Форма.Элементы;
		ЭлементСписок = Элементы.Найти("Список");
		
		Если ЭлементСписок <> Неопределено Тогда

			ЭлементСписок.УстановитьДействие("Выбор", "Подключаемый_упоСписокВыбор");
			Форма[ИмяРеквизита] = Истина;

			ОтборПоСчетамСУказаннойСтатьейДоходовРасходов = Ложь;
			// Если требуется дать возможность выбора только такого элемента плана счетов, у которого есть соответствие со статьей доходов/расходов,
			// необходимо установить отбор дин. списка, отсеивающий элементы, не имеющие такого соотвествия. 
			Если ОтборПоСчетамСУказаннойСтатьейДоходовРасходов Тогда
				ДинамическийСписокФормы = Форма[ЭлементСписок.ПутьКДанным];
				ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ СтатьяИнтеграция ИЗ РегистрСведений.упоСоответствиеСтатейДР";
				ДопустимыеЭлементы = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса).Выгрузить().ВыгрузитьКолонку(0);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписокФормы,
					"Ссылка",
					ДопустимыеЭлементы,
					ВидСравненияКомпоновкиДанных.ВСписке,
					НСтр("ru = 'Выводить только счета, для которых задано соотвествие со статьями доходов/расходов PM'"),
					Истина,
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
			КонецЕсли;	
				
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры	
	
// Возвращает структуру счетов учета, необходимых для создания напрвления деятельности на основании проектной задачи.
//
// Возвращаемое значение:
//  Структура - Счета учета.
//  	* СчетУчетаВыручкиОтПродаж - ПланСчетовСсылка.Управленческий
//  	* СчетУчетаСебестоимостиПродаж - ПланСчетовСсылка.Управленческий
//		* СчетУчетаПрибыли - ПланСчетовСсылка.Управленческий
//
Функция СчетаУчетаНаправленияДеятельностиУПФПоУмолчанию() Экспорт
	
	СчетаУчетаПоУмолчанию = Новый Структура;
	СчетУчетаВыручкиОтПродаж = ОбщегоНазначения.ПредопределенныйЭлемент("ПланСчетов.Управленческий.ВыручкаОтПродаж");
	СчетаУчетаПоУмолчанию.Вставить("СчетУчетаВыручкиОтПродаж", СчетУчетаВыручкиОтПродаж);
	СчетУчетаСебестоимостиПродаж = 
		ОбщегоНазначения.ПредопределенныйЭлемент("ПланСчетов.Управленческий.СебестоимостьПродаж");
	СчетаУчетаПоУмолчанию.Вставить("СчетУчетаСебестоимостиПродаж", СчетУчетаСебестоимостиПродаж); 
	СчетУчетаПрибыли =
		ОбщегоНазначения.ПредопределенныйЭлемент("ПланСчетов.Управленческий.ПрибылиИУбыткиБезНалогаНаПрибыль");
	СчетаУчетаПоУмолчанию.Вставить("СчетУчетаПрибыли", СчетУчетаПрибыли);
	
	Возврат СчетаУчетаПоУмолчанию;
	
КонецФункции

// Синхронизирует счет учета со статьей доходов/затрат
//
// Параметры:
//  Счет - ПланСчетовСсылка.Управленческий - синхронизируемый счет.
//  ТипСчетаДляГруппы - ПеречислениеСсылка.ТипыСчетов - тип счета группа счетов
//
// Возвращаемое значение:
//  СправочникСсылка.упоСтатьиДоходов, СправочникСсылка.упоСтатьиЗатрат, Неопределено - 
//
Функция СоздатьСвязатьСтатьюДР_изУНФвPM(Счет, ТипСчетаДляГруппы) Экспорт
	
	Если Не ЗначениеЗаполнено(Счет) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	ДопИнформацияОСтатьеУПО = Неопределено;
	обСтатьяУПО = Неопределено;
	НужноЗаписатьСвязь = Ложь;
		
	Если Счет.ТипСчета <> 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов") Тогда
		ТипСчетаДляГруппы = Счет.ТипСчета;
	КонецЕсли;
	
	ТипыСчетовВДоходы = ПредопределенныеЗначенияТиповСчетов_Доходы();
	ТипыСчетовВЗатраты = ПредопределенныеЗначенияТиповСчетов_Затраты();
	
	Если Счет.ТипСчета = 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов") 
		И ТипСчетаДляГруппы <> Неопределено Тогда
	
		СправочникМенеджерУПО = СправочникМенеджерПоТипуСчета(ТипСчетаДляГруппы, ТипыСчетовВДоходы, ТипыСчетовВЗатраты);	
		
	Иначе 
		
		СправочникМенеджерУПО = СправочникМенеджерПоТипуСчета(Счет.ТипСчета, ТипыСчетовВДоходы, ТипыСчетовВЗатраты);
		
	КонецЕсли;
	
	Если СправочникМенеджерУПО = Неопределено Тогда
		Возврат Неопределено;		
	КонецЕсли; 
	
	ЭлементРодитель = СправочникМенеджерУПО.ПустаяСсылка();			
	
	РеквизитыСчетУНФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Счет, "Наименование, ПометкаУдаления, Родитель");
	РодительСТипомГруппаСчетов = РодительСТипомГруппаСчетов(Счет, СправочникМенеджерУПО); 
	
	Если ЗначениеЗаполнено(РеквизитыСчетУНФ.Родитель) Тогда		
		
		ЭлементРодитель = СоздатьСвязатьСтатьюДР_изУНФвPM(РодительСТипомГруппаСчетов, ТипСчетаДляГруппы);
		
	КонецЕсли;	
	
	СтатьяУПО = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(Счет, ДопИнформацияОСтатьеУПО);	
	
	Если Не ЗначениеЗаполнено(СтатьяУПО) Тогда
		
		НужноЗаписатьСвязь 	= Истина;

		Если Счет.ТипСчета = 
				упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов") Тогда  
			
			обСтатьяУПО = СправочникМенеджерУПО.СоздатьГруппу();
			
		Иначе
			
			обСтатьяУПО = СправочникМенеджерУПО.СоздатьЭлемент();
			
		КонецЕсли;
		
	Иначе
		
		ДлинаНаименованияУПО = СтатьяУПО.Метаданные().ДлинаНаименования;
		
		Если ДопИнформацияОСтатьеУПО.Наименование <> Лев(РеквизитыСчетУНФ.Наименование, ДлинаНаименованияУПО) 
			ИЛИ ДопИнформацияОСтатьеУПО.ПометкаУдаления <> РеквизитыСчетУНФ.ПометкаУдаления 
			ИЛИ  ДопИнформацияОСтатьеУПО.Родитель <> ЭлементРодитель Тогда
			
			обСтатьяУПО = СтатьяУПО.ПолучитьОбъект();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если обСтатьяУПО <> Неопределено Тогда
		
		обСтатьяУПО.ДополнительныеСвойства.Вставить("НеСинхронизироватьСтатьиДР", Истина);
		обСтатьяУПО.Наименование = РеквизитыСчетУНФ.Наименование;
		обСтатьяУПО.ПометкаУдаления = РеквизитыСчетУНФ.ПометкаУдаления;	 
		обСтатьяУПО.Родитель = ЭлементРодитель;
		обСтатьяУПО.Записать();
		СтатьяУПО = обСтатьяУПО.Ссылка;
		
	КонецЕсли;
	
	Если НужноЗаписатьСвязь Тогда
		
		Запись = РегистрыСведений.упоСоответствиеСтатейДР.СоздатьМенеджерЗаписи();
		Запись.СтатьяИнтеграция = Счет;
		Запись.СтатьяУПО = СтатьяУПО;
		Запись.Записать();
		
	КонецЕсли;
	
	Возврат СтатьяУПО;	
	
КонецФункции

// Возвращает предопределенный список типов счет доходов или расходов
//
// Параметры:
//  ЭтоСтатьяДоходов - Булево - Признак того, что возвращаем типы статей доходов.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ТипыСчетов - 
//
Функция ТипыСчетовДоходыРасходы(ЭтоСтатьяДоходов) Экспорт
	
	Если ЭтоСтатьяДоходов Тогда
		ТипыСчетов = ПредопределенныеЗначенияТиповСчетов_Доходы();			
	Иначе
		ТипыСчетов = ПредопределенныеЗначенияТиповСчетов_Затраты();	
	КонецЕсли;

	// Удалим из типов счетов тип Группа счетов
	ЭлементГруппаСчетов = ТипыСчетов.Найти(упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов"));
	Если ЭлементГруппаСчетов <> Неопределено Тогда
		ТипыСчетов.Удалить(ЭлементГруппаСчетов);	
	КонецЕсли;
	
	Возврат ТипыСчетов;
	
КонецФункции	

// Получает типы счетов в зависимости от признака доходной/расходной статьи и заворачивает в структуру данных 
// для использования в параметрах отбора динамического списка.
//
// Параметры:
//  ЭтоСтатьяДоходов - Булево - признак доходной/расходной статьи.
// 
// Возвращаемое значение:
//  Структура - фиксированный массив в структуре для использования в параметрах отборов динамического списка.
//
Функция ТипыСчетовДоходыРасходы_ДляОтбора(ЭтоСтатьяДоходов) Экспорт
	
	ТипыСчетов = ТипыСчетовДоходыРасходы(ЭтоСтатьяДоходов);
	
	ТипыСчетов = Новый ФиксированныйМассив(ТипыСчетов);
	ОтборПоТипуСчетов = Новый Структура("ТипСчета", ТипыСчетов);
	
	Возврат ОтборПоТипуСчетов;
	
КонецФункции
	
#КонецОбласти

#Область СинхронизацияЕдиницИзмерения

// Возвращает упаковку единиц измерения связанную с классификатором единиц измерения,
// если связанную упаковку найти не удалось, то возращает пустую ссылку на справочник УпаковкиЕдиницыИзмерения.
//
// Параметры:
//  КлассификаторЕдиницИзмерения - СправочникСсылка.КлассификаторЕдиницИзмерения 
//
// Возвращаемое значение:
//	- СправочникСсылка.УпаковкиЕдиницыИзмерения 
//	
Функция УпаковкаЕдИзмСвязаннаяСКлассификаторомЕдИзм(КлассификаторЕдиницИзмерения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм КАК упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм
	|ГДЕ
	|	упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.КлассификаторЕдИзм = &КлассификаторЕдИзм";
	
	Запрос.УстановитьПараметр("КлассификаторЕдИзм", КлассификаторЕдиницИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
	КонецЕсли;	
		
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Упаковка;
	
КонецФункции

#КонецОбласти

#Область ПользовательскиеНастройки

// Устанавливает настройки интерфейса пользователя.
//
// Параметры:
//  НачальныеНастройки	 - Структура
//  СохранятьНастройки	 - Булево
//  ИмяПользователя		 - Строка, Неопределено
//
Процедура ПриУстановкеНачальныхНастроек(НачальныеНастройки, СохранятьНастройки = Ложь, ИмяПользователя = Неопределено) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Право.Очистить();
	
	ПанельРазделов = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов");
	ПанельОткрытых = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых");
	
	НастройкиСостава.Верх.Добавить(ПанельОткрытых);
	НастройкиСостава.Лево.Добавить(ПанельРазделов);
	
	Если СохранятьНастройки Тогда
		Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
		Настройки.УстановитьСостав(НастройкиСостава);
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения",
			"", Настройки, , ИмяПользователя);
	Иначе
		НачальныеНастройки.НастройкиТакси.УстановитьСостав(НастройкиСостава);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Изменяет связи параметров выбора у элементов формы справочника Проекты
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма элемента справочника Проекты
//
Процедура ИзменитьСвязиПараметровВыбораУЭлементовДоговоровКонтрагентов(Форма) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат	
	КонецЕсли;	
	
	Элементы = Форма.Элементы;
	   
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ДоговорДоходов");
	ИменаЭлементов.Добавить("ДоговорЗатрат");
	
	Для Каждого ИмяЭлемента Из ИменаЭлементов Цикл
		НовыеСвязиПарВыбора = Новый Массив;
		Элемент = Элементы[ИмяЭлемента];
		Для Каждого СвязьПараметровВыбора Из Элемент.СвязиПараметровВыбора Цикл
			Если СвязьПараметровВыбора.Имя <> "Отбор.Организация" Тогда
				НовыеСвязиПарВыбора.Добавить(СвязьПараметровВыбора);
			КонецЕсли;			
		КонецЦикла;
		Элемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыеСвязиПарВыбора);
	КонецЦикла;	
	
КонецПроцедуры

// Добавляет отбор по типу структурной единицы в Параметры.
//
// Параметры:
//  Параметры - Структура - Параметры формы.
//
Процедура ДобавитьВПараметрыОтборПоТипуСтруктурнойЕдиницы(Параметры) Экспорт	
	
	Если Не Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);	
	КонецЕсли;
	ТипПодразделение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ТипыСтруктурныхЕдиниц.Подразделение");
	Параметры.Отбор.Вставить("ТипСтруктурнойЕдиницы", ТипПодразделение);	
	Параметры.Вставить("РежимОтображения", 1);

КонецПроцедуры

#Область ЗаполнениеЗаказа

// Получает данные для создания заказов
//
// Параметры:
//	ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача
//	ВидДокумента - Строка
//
// Возвращаемое значение:
//	Структура - Данные для заполнения заказов
//
Функция ПолучитьДанныеДляЗаполненияЗаказов(ПроектнаяЗадача, ВидДокумента) Экспорт
	
	ПараметрыСозданияЗаказов = ПолучитьПараметрыСозданияПоВидуЗаказа(ВидДокумента);
	
	ПараметрыСозданияЗаказов = ДополнитьРеквизитамиШапкиПоУмолчанию(ПроектнаяЗадача, ПараметрыСозданияЗаказов);
	
	ПакетРезультатов = ПолучитьДанныеИзПроектнойЗадачи(ПроектнаяЗадача, ПараметрыСозданияЗаказов);	
	ДанныеЗаказов = ПолучитьДанныеЗаказовИзВыборки(ПакетРезультатов, ПроектнаяЗадача, ПараметрыСозданияЗаказов);
	
	ВозвращаемыеДанные = Новый Структура;	
	ВозвращаемыеДанные.Вставить("ПараметрыСозданияЗаказов", ПараметрыСозданияЗаказов);
	ВозвращаемыеДанные.Вставить("ДанныеЗаказов", ДанныеЗаказов);
	
	Возврат ВозвращаемыеДанные;	
	
КонецФункции

#КонецОбласти

// Выполняет действия согласно наименованию.
//
// Параметры:
//  ДокументОбъект		 - ДокументОбъект
//  ДокументОснование	 - Структура, ДокументОбъект, ДокументСсылка
//
Процедура ЗаполнитьПроектПоДокументуОснованию(ДокументОбъект, ДокументОснование) Экспорт
	
	Если ДокументОснование <> Неопределено 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснование, "Проект") Тогда
		ДокументОбъект.Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Проект");
	КонецЕсли

КонецПроцедуры

// Устанавливает видимость созданных на форме групп отображающих проектные задачи
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Произвольная форма
//
Процедура УстановитьВидимостьОтПользовательскихНастроек(Форма) Экспорт
		
	Элементы = Форма.Элементы;
	
	ИмяГруппы = упоИнтеграцияУПФКлиентСервер.ИмяСоздаваемойГруппыДляНастройкиВидимостиЭлементов(); 
	
	МассивТаблицФормы = ТаблицыФормыСодержащиеПроект(Форма);
	
	ВидимостьГрупп = ОпределитьВидимостьГрупп(Форма);
	
	ЭтоПоложениеВТабличнойЧасти = Форма.Объект.ПоложениеПроекта = 
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти"); 
		
	Элементы[ИмяГруппы].Видимость = ВидимостьГрупп И Не ЭтоПоложениеВТабличнойЧасти;
	
	Для Каждого ТаблицаФормы Из МассивТаблицФормы Цикл   
		ИмяГруппыСПроектом = упоИнтеграцияУПФКлиентСервер.ИмяГруппыТЧПоИмениТЧ(ТаблицаФормы.Имя);
		Элементы[ИмяГруппыСПроектом].Видимость = ВидимостьГрупп И ЭтоПоложениеВТабличнойЧасти;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОтчетПлатежныйКалендарь

Функция СтрокаИерархииПЗ(Выборка, ТекущаяПроектнаяЗадача) Экспорт 
	
	МаксУровеньИерархииВВыборке = 1;
	Иерархия = Новый Массив;
	
	// Получаем максимальный предусмотренный в запросе уровень иерархии
	Пока Истина Цикл
		ТекУровень = МаксУровеньИерархииВВыборке + 1;	
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Выборка, "упоПроектнаяЗадачаРодитель" + ТекУровень) Тогда
			МаксУровеньИерархииВВыборке = ТекУровень;
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(Выборка["упоПроектнаяЗадачаРодитель" + МаксУровеньИерархииВВыборке]) Тогда
		// Заполнен максимально предусмотренный уровень иерархии в выборке, вероятно иерархия еще глубже.
		// Требуется построить полную иерархию ПЗ
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Представление(Проекты.Ссылка) КАК ПредставлениеПЗ
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка = &ТекущаяПроектнаяЗадача
		|ИТОГИ ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
		
		Запрос.УстановитьПараметр("ТекущаяПроектнаяЗадача", ТекущаяПроектнаяЗадача);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		НомерСтрокиВыборки = 1;
				
		Пока ВыборкаСсылка.Следующий() Цикл
			
			// Первый элемент выборки - сам проект, его не нужно включать в иерархию.
			// Последний элемент выборки - сама текущая проектная задача. Она тоже не нужна в иерархии.
			Если НомерСтрокиВыборки = 1  ИЛИ
				НомерСтрокиВыборки = ВыборкаСсылка.Количество() Тогда
				НомерСтрокиВыборки = НомерСтрокиВыборки + 1;
				Продолжить;
			КонецЕсли;	
			
			// Строка иерархии будет построена "снизу-вверх" (т.е. сначала идет ПЗ самого нижнего уровня иерархии, затем более высокого и т.д.,
			// а выборку иерархии обходим в прямом порядке, т.е. "сверху-вниз" - заполняем массив "Иерархия" по методу LIFO (новый элемент вставляется в начало массива)
			Иерархия.Вставить(0, ВыборкаСсылка.ПредставлениеПЗ);
						
			НомерСтрокиВыборки = НомерСтрокиВыборки + 1;
			
		КонецЦикла;
		
		
	Иначе
		
		Для ТекУровень = 1 По МаксУровеньИерархииВВыборке Цикл
			
			УровеньИерархииВыборки = Выборка["упоПроектнаяЗадачаРодитель" + ТекУровень];
			
			Если НЕ ЗначениеЗаполнено (УровеньИерархииВыборки) Тогда
				Прервать;
			КонецЕсли;
						
			ЭтоПроектнаяЗадача = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УровеньИерархииВыборки, "ЭтоПроектнаяЗадача");
			
			// Если родитель ПЗ - Проект, значит получен самый верхний уровень иерархии.
			Если НЕ ЭтоПроектнаяЗадача Тогда
				Прервать;
			КонецЕсли;
			
			ПредставлениеПЗ = Строка(УровеньИерархииВыборки);
			Иерархия.Добавить(ПредставлениеПЗ);
		
		КонецЦикла;
		
	КонецЕсли;
	
	СтрокаИерархии = "";
	
	// Заполнение строки иерархии. 
	// Массив "Иерархия"  заранее сформирован таким образом, что чем больше индекс элемента - тем "выше" по уровню иерархии находится ПЗ
	ЭтоПервыйЭлемент = Истина;
	Для каждого ЭлементИерархии Из Иерархия Цикл
		
		Если ЭтоПервыйЭлемент Тогда
			ЭтоПервыйЭлемент = Ложь;
			СтрокаИерархии = СтрокаИерархии + ЭлементИерархии;
			Продолжить;
		КонецЕсли;	
		
		СтрокаИерархии = СтрокаИерархии + " / " + ЭлементИерархии ;

	КонецЦикла;

	Возврат СтрокаИерархии;

КонецФункции 

Функция ЗаказыДляПерезаполненияПоПроектнойЗадаче(ПроектнаяЗадача) Экспорт 
	
	ЗаказыДляПерезаполнения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПоставщикуПлатежныйКалендарь.ДатаОплаты КАК Дата,
		|	ЗаказПоставщикуПлатежныйКалендарь.СуммаОплаты КАК Сумма,
		|	ЗаказПоставщикуПлатежныйКалендарь.Ссылка.Контрагент КАК Контрагент,
		|	ЗаказПоставщикуПлатежныйКалендарь.Ссылка.Договор КАК Договор,
		|	ЗаказПоставщикуПлатежныйКалендарь.Ссылка КАК Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата) КАК НаправлениеДвижения
		|ИЗ
		|	Документ.ЗаказПоставщику.ПлатежныйКалендарь КАК ЗаказПоставщикуПлатежныйКалендарь
		|ГДЕ
		|	ЗаказПоставщикуПлатежныйКалендарь.Ссылка.Проведен
		|	И ЗаказПоставщикуПлатежныйКалендарь.Ссылка.Проект.СсылкаНаПроектнуюЗадачу = &СсылкаНаПроектнуюЗадачу
		|	И ЗаказПоставщикуПлатежныйКалендарь.СуммаОплаты <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПокупателяПлатежныйКалендарь.ДатаОплаты,
		|	ЗаказПокупателяПлатежныйКалендарь.СуммаОплаты,
		|	ЗаказПокупателяПлатежныйКалендарь.Ссылка.Контрагент,
		|	ЗаказПокупателяПлатежныйКалендарь.Ссылка.Договор,
		|	ЗаказПокупателяПлатежныйКалендарь.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление)
		|ИЗ
		|	Документ.ЗаказПокупателя.ПлатежныйКалендарь КАК ЗаказПокупателяПлатежныйКалендарь
		|ГДЕ
		|	ЗаказПокупателяПлатежныйКалендарь.Ссылка.Проведен
		|	И ЗаказПокупателяПлатежныйКалендарь.Ссылка.Проект.СсылкаНаПроектнуюЗадачу = &СсылкаНаПроектнуюЗадачу
		|	И ЗаказПокупателяПлатежныйКалендарь.СуммаОплаты <> 0";
	
	Запрос.УстановитьПараметр("СсылкаНаПроектнуюЗадачу", ПроектнаяЗадача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		// Пустой массив
		Возврат ЗаказыДляПерезаполнения; 
	КонецЕсли;
	
	ТЗЗаказы = РезультатЗапроса.Выгрузить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент КАК Контрагент,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор КАК Договор,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма КАК Сумма,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения КАК Дата,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.НаправлениеДвижения КАК НаправлениеДвижения
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &СсылкаНаПроектнуюЗадачу
		|				И Версия = &Версия) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
		|ГДЕ
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма <> 0
		|	И упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.НаправлениеДвижения В (ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление), ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата))";
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
	ТекущаяВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	Запрос.УстановитьПараметр("Версия", ТекущаяВерсияПроекта);
	Запрос.УстановитьПараметр("СсылкаНаПроектнуюЗадачу", ПроектнаяЗадача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗПланыДДС = РезультатЗапроса.Выгрузить();
	
	// проверка по датам.
	
	Для каждого СтрокаЗаказов из ТЗЗаказы Цикл
		
		Если ЗаказыДляПерезаполнения.Найти(СтрокаЗаказов.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
	
		ПараметрыОтбора = Новый Структура("Контрагент, Договор, Дата, Сумма");
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаЗаказов);
		СтрокиПланов = ТЗПланыДДС.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиПланов.Количество() = 0 Тогда
			ЗаказыДляПерезаполнения.Добавить(СтрокаЗаказов.Ссылка);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ЗаказыДляПерезаполнения;	
		
КонецФункции 

Процедура ПерезаполнитьЗаказыНаСервере(Заказы) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Заказ из Заказы Цикл
			

			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма КАК СуммаОплаты,
			|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения КАК ДатаОплаты
			|ИЗ
			|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
			|			,
			|			Версия = &ТекущаяВерсия
			|				И Договор = &Договор
			|				И Контрагент = &Контрагент
			|				И НаправлениеДвижения = &НаправлениеДвижения
			|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
			|ГДЕ
			|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма <> 0";
			
			СвойстваЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заказ, "Договор, Контрагент, Проект");
			СвойстваПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СвойстваЗаказа.Проект, "СсылкаНаПроектнуюЗадачу, упоКорневойПроект");
			
			Запрос.УстановитьПараметр("Договор", СвойстваЗаказа.Договор);
			Запрос.УстановитьПараметр("Контрагент", СвойстваЗаказа.Контрагент);
			
			НаправлениеДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.ПустаяСсылка();
			Если ТипЗнч(Заказ) = упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.ЗаказПокупателя") Тогда
				НаправлениеДвижения = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление");
			ИначеЕсли ТипЗнч(Заказ) = упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.ЗаказПоставщику") Тогда
				НаправлениеДвижения = 
					упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата");
			КонецЕсли;
			
			ПроектнаяЗадача = СвойстваПроекта.СсылкаНаПроектнуюЗадачу;
			ТекущаяВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(СвойстваПроекта.упоКорневойПроект);
			
			Запрос.УстановитьПараметр("НаправлениеДвижения", НаправлениеДвижения);
			Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
			Запрос.УстановитьПараметр("ТекущаяВерсия", ТекущаяВерсияПроекта); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект = Заказ.ПолучитьОбъект();
			ДокументОбъект.ПлатежныйКалендарь.Очистить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НоваяСтрокаПлатКалендаря = ДокументОбъект.ПлатежныйКалендарь.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПлатКалендаря, ВыборкаДетальныеЗаписи);
				
				ЗапасыИтог = ДокументОбъект.Запасы.Итог("Всего");
				ПлатежныйКалендарьИтог = ДокументОбъект.ПлатежныйКалендарь.Итог("СуммаОплаты");
				
				Если ПлатежныйКалендарьИтог > ЗапасыИтог Тогда
					НоваяСтрокаПлатКалендаря.СуммаОплаты = НоваяСтрокаПлатКалендаря.СуммаОплаты - (ПлатежныйКалендарьИтог - ЗапасыИтог);
				КонецЕсли;
				
				НоваяСтрокаПлатКалендаря.ПроцентОплаты = ?(ЗапасыИтог = 0, 0, Окр(НоваяСтрокаПлатКалендаря.СуммаОплаты / ЗапасыИтог * 100, 2, 1));
				НоваяСтрокаПлатКалендаря.СуммаНДСОплаты = Окр(ДокументОбъект.Запасы.Итог("СуммаНДС") * НоваяСтрокаПлатКалендаря.ПроцентОплаты / 100, 2, 1);
				
				Если ДокументОбъект.ПлатежныйКалендарь.Итог("ПроцентОплаты") = 100 И ДокументОбъект.ПлатежныйКалендарь.Итог("СуммаОплаты") <> ДокументОбъект.Запасы.Итог("Всего") Тогда
					ТаблицаРаспределения = ДокументОбъект.ПлатежныйКалендарь.Выгрузить();
					Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
						МодульРасчетыПроведениеДокументов = ОбщегоНазначения.ОбщийМодуль("РасчетыПроведениеДокументов");
						МодульРасчетыПроведениеДокументов.РаспределитьСуммуПоКолонкеТаблицы(ДокументОбъект.Запасы.Итог("Всего"), ТаблицаРаспределения,
							"СуммаОплаты", "ПроцентОплаты");
					КонецЕсли; 
					ДокументОбъект.ПлатежныйКалендарь.Загрузить(ТаблицаРаспределения);
				КонецЕсли;
				
			КонецЦикла;

			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
					
	Исключение
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;	

КонецПроцедуры
 
#КонецОбласти

#Область РаспределениеЗарплатыПоЗадачамПроектов

// Получает данные необходимые для распределения суммы зарплаты пропоционально трудозатратам по проектам
//
// Параметры:
//	ДанныеДокумента - Структура - 
//
// Возвращаемое значение:
//	Массив из Структура - 
//
Функция ПолучитьДанныеРаспределенияЗарплатыПоФактуТрудозатрат(ДанныеДокумента) Экспорт
		
	Распределение = ПолучитьПропорциюРаспределенияПоТрудозатратам(ДанныеДокумента);
	ДанныеТЧСРаспределением = ПолучитьДанныеТабЧастиСУчетомРаспределения(ДанныеДокумента, Распределение);
	
	Возврат ДанныеТЧСРаспределением;
	
КонецФункции

#КонецОбласти

// Серверный обработчик события ОбработкаПолученияФормы.
//
Процедура ОбработкаПолученияФормыКонтрагентыДоговоры(Источник, ВидФормы) Экспорт
		
	НеПодменятьФорму = УправлениеДоступом.ЕстьРоль("ДобавлениеИзменениеКонтрагентов");
	Если НеПодменятьФорму Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтоМенеджерСпрКонтрагенты = Ложь;
	Если Источник = Справочники.Контрагенты Тогда
		ЭтоМенеджерСпрКонтрагенты = Истина;
	ИначеЕсли Источник = Справочники.ДоговорыКонтрагентов Тогда
		ЭтоМенеджерСпрКонтрагенты = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПутьКФорме = "Справочник.%1.Форма.";
	
	Если ВидФормы = "ФормаОбъекта" Тогда		
		ИмяФормы = "ФормаЭлементаУправляемая";	
	ИначеЕсли ВидФормы = "ФормаГруппы" Тогда				
		Если ЭтоМенеджерСпрКонтрагенты Тогда
			ИмяФормы = "ФормаГруппыГруппы";
		Иначе
			ИмяФормы = "ФормаГруппыУправляемая";
		КонецЕсли;
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда
		ИмяФормы = "ФормаСпискаУправляемая";
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
		ИмяФормы = "ФормаВыбораУправляемая";
	ИначеЕсли ВидФормы = "ФормаВыбораГруппы" Тогда
		ИмяФормы = "ФормаВыбораГруппыУправляемая";
	КонецЕсли;
	
	ТипСправочника = "ДоговорыКонтрагентов";
	Если ЭтоМенеджерСпрКонтрагенты Тогда
		ТипСправочника = "Контрагенты";	
	КонецЕсли;
	
	ПутьКФорме = "Справочник.%1.Форма.%2";
	ВыбраннаяФорма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПутьКФорме, ТипСправочника, ИмяФормы);
	
КонецПроцедуры

// Функция возвращает процент ставки НДС.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - Ставка НДС.
//
// Возвращаемое значение:
//	Число - Процент ставки НДС.
//
Функция ПеречислениеНДСПоРазмеруСтавки(СтавкаНДС, Расчетная) Экспорт
	
	СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
	
	Если ТипЗнч(СтавкаНДС) = Тип("Число") Тогда
	
		Если СтавкаНДС = 10 Тогда
			
			Если Расчетная Тогда
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110");
			Иначе
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
			КонецЕсли;
			
		ИначеЕсли СтавкаНДС = 20 Тогда
			
			Если Расчетная Тогда
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120");
			Иначе
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
			КонецЕсли;
			
		ИначеЕсли СтавкаНДС = 22 Тогда
			
			Если Расчетная Тогда
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122");
			Иначе
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
			КонецЕсли;
			
		ИначеЕсли СтавкаНДС = 18 Тогда
			
			Если Расчетная Тогда
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118");
			Иначе
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18");
			КонецЕсли;
			
		ИначеЕсли СтавкаНДС = 0 Тогда
			
			Если Расчетная Тогда
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
			Иначе
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
			КонецЕсли;
			
		ИначеЕсли СтавкаНДС = 5 Тогда
			
			Если Расчетная Тогда
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105");
			Иначе
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5");
			КонецЕсли;
			
		ИначеЕсли СтавкаНДС = 7 Тогда
			
			Если Расчетная Тогда
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107");
			Иначе
				СтавкаПеречисление = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтавкаПеречисление;
	
КонецФункции

Функция ПеречислениеНДСПоСправочникуНДС(СправочникНДС) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СправочникНДС, "Ставка, Расчетная, ВидСтавкиНДС");
		
	Если Реквизиты.Ставка = 0 Тогда
		
		Если Реквизиты.ВидСтавкиНДС = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.БезНДС") Тогда
			Расчетная = Ложь;
		Иначе	
			Расчетная = Истина;
		КонецЕсли;
		
	Иначе
		
		Расчетная = Реквизиты.Расчетная;
		
	КонецЕсли;	
		
	ПеречислениеНДС = ПеречислениеНДСПоРазмеруСтавки(Реквизиты.Ставка, Расчетная);
	
	Возврат ПеречислениеНДС;
	
КонецФункции	

Процедура УстановитьВидимостьЭлементовПроектИПроектнаяЗадачаВЗависимостиОтПользовательскихНастроек(Форма) Экспорт
	
	НужнаОбработкаФормыДокумента = Форма.ИмяФормы = "Документ.ПоступлениеНаСчет.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.РасходСоСчета.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.ПоступлениеВКассу.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.РасходИзКассы.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.ПлатежноеПоручение.Форма.ФормаДокумента"; 
	
	Если Не НужнаОбработкаФормыДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ИмяГруппы = упоИнтеграцияУПФКлиентСервер.ИмяСоздаваемойГруппыДляНастройкиВидимостиЭлементов();  
	
	Если Элементы.Найти(ИмяГруппы) = Неопределено Тогда
		НужнаОбработкаФормыДокумента = Ложь;
	КонецЕсли;	  
	
	МассивТаблицФормы = ТаблицыФормыСодержащиеПроект(Форма);     

	Для Каждого ТаблицаФормы Из МассивТаблицФормы Цикл      
		
		ИмяГруппыСПроектом = упоИнтеграцияУПФКлиентСервер.ИмяГруппыТЧПоИмениТЧ(ТаблицаФормы.Имя);
		
		Если Элементы.Найти(ИмяГруппыСПроектом) = Неопределено Тогда
			НужнаОбработкаФормыДокумента = Ложь;
			Прервать;
		КонецЕсли;	 
				
	КонецЦикла;    
	
	Если Не НужнаОбработкаФормыДокумента Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьОтПользовательскихНастроек(Форма);	
	
КонецПроцедуры

Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;

	ЭтоФормаОбъектаИЕстьПрава = НастройкиФормы.ЭтоФормаОбъекта
		И УправлениеДоступом.ЕстьРоль("упоОбработкаЗаполнениеДокументовУНФ");
	
	Если Не ЭтоФормаОбъектаИЕстьПрава Тогда
		Возврат;
	КонецЕсли;
		
	ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.Бюджет");

	Команда = Команды.Добавить();
	Команда.Вид = "ПроектноеБюджетирование";
	Команда.Идентификатор = "ЗаполнитьИзБюджетаПроектов";
	Команда.Представление = НСтр("ru = 'Заполнить из бюджета проектов'");
	Команда.Важность = "Важное";	
	Команда.Порядок = 100;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Текст;
	Команда.ТипПараметра = ТипПараметра;	
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.МножественныйВыбор = Ложь;	
	Команда.Обработчик = "упоИнтеграцияУПФКлиент.Подключаемый_ОткрытьФормуЗаполненияДокументаБюджет";
	
	ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.НачислениеЗарплатыУНФ");
	
	Команда = Команды.Добавить();
	Команда.Вид = "ПроектноеБюджетирование";
	Команда.Идентификатор = "ЗаполнитьПоФактуТрудозатрат";
	Команда.Представление = НСтр("ru = 'Заполнить по факту трудозатрат'");
	Команда.Важность = "Важное";	
	Команда.Порядок = 100;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Текст;
	Команда.ТипПараметра = ТипПараметра;	
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.МножественныйВыбор = Ложь;	
	Команда.Обработчик = "упоИнтеграцияУПФКлиент.Подключаемый_ОткрытьФормуЗаполненияДокументаНачисленияЗП";
	
	Команда = Команды.Добавить();
	Команда.Вид = "ПроектноеБюджетирование";
	Команда.Идентификатор = "РаспределитьПоЗадачамПроектов";
	Команда.Представление = НСтр("ru = 'Распределить по задачам проектов'");
	Команда.Важность = "Важное";	
	Команда.Порядок = 100;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Текст;
	Команда.ТипПараметра = ТипПараметра;	
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.МножественныйВыбор = Ложь;	
	Команда.Обработчик = "упоИнтеграцияУПФКлиент.Подключаемый_РаспределитьПоЗадачамПроектов";
	
КонецПроцедуры

Процедура ДобавитьКомандыСозданияНаОсновании(ТаблицаОбъектовВводНаОсновании) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		СтрокаТаблицы = ТаблицаОбъектовВводНаОсновании.Добавить();
		СтрокаТаблицы.ИмяОбъектаМетаданных = "Документ.ЗаказПокупателя";
		СтрокаТаблицы.ФунциональныеОпцииОбъектаМетаданных = Новый Массив;
		
		СтрокаТаблицы = ТаблицаОбъектовВводНаОсновании.Добавить();
		СтрокаТаблицы.ИмяОбъектаМетаданных = "Документ.ЗаказПоставщику";
		СтрокаТаблицы.ФунциональныеОпцииОбъектаМетаданных = Новый Массив;	
		
		НайденнаяСтрокаКомандыЗадание = ТаблицаОбъектовВводНаОсновании.Найти("Команда.СоздатьЗадание", "ИмяОбъектаМетаданных");
		НайденнаяСтрокаСобытия = ТаблицаОбъектовВводНаОсновании.Найти("Документ.Событие", "имяОбъектаМетаданных");
		Если ЗначениеЗаполнено(НайденнаяСтрокаКомандыЗадание) И ЗначениеЗаполнено(НайденнаяСтрокаСобытия) Тогда
			ИндексСтрокиКомандыЗадание 	= ТаблицаОбъектовВводНаОсновании.Индекс(НайденнаяСтрокаКомандыЗадание);	
			ИндексСтрокиСобытие 		= ТаблицаОбъектовВводНаОсновании.Индекс(НайденнаяСтрокаСобытия);
			СдвигСтроки 				= ИндексСтрокиСобытие - ИндексСтрокиКомандыЗадание - 1;
			ТаблицаОбъектовВводНаОсновании.Сдвинуть(ИндексСтрокиСобытие, -СдвигСтроки);
		Иначе 
			СтрокаТаблицы = ТаблицаОбъектовВводНаОсновании.Добавить(); 
			СтрокаТаблицы.ИмяОбъектаМетаданных = "Документ.Событие";
			СтрокаТаблицы.ФунциональныеОпцииОбъектаМетаданных = Новый Массив;			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервере_Документы(ИмяДокумента, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяДокумента = "ЗаказПоставщику" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_ЗаказПоставщику_ФормаЭлемента(Форма, Отказ);
		ЗаполнитьЗаказ(Форма);
		
	ИначеЕсли ИмяДокумента = "ПеремещениеДСПлан" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьЭлементы_ПроектИПроектнаяЗадача_ФормаЭлемента(Форма, Отказ, "ПраваяКолонка");
		
	ИначеЕсли (ИмяДокумента = "ПоступлениеДСПлан" Или ИмяДокумента = "РасходДСПлан") 
		И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьЭлементы_ПроектИПроектнаяЗадача_ФормаЭлемента(Форма, Отказ, "КолонкаПраво");
		
	ИначеЕсли (ИмяДокумента = "СчетНаОплату" Или ИмяДокумента = "СчетНаОплатуПоставщика") 
		И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьЭлементы_ПроектИПроектнаяЗадача_ФормаЭлемента(Форма, Отказ, "ГруппаДополнительныеРеквизиты");
		
	ИначеЕсли ИмяДокумента = "Событие" И ИмяФормы = "ФормаСписка" Тогда
		
		ДобавитьЭлементы_Событие_ФормаСписка(Форма, Отказ);
		
	ИначеЕсли ИмяДокумента = "НачислениеЗарплаты" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьЭлементы_НачислениеЗарплаты_ФормаДокумента(Форма, Отказ); 
		
	ИначеЕсли ИмяДокумента = "СписаниеЗапасов" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьЭлементы_ПроектИПроектнаяЗадача_ФормаЭлемента(Форма, Отказ, "ГруппаДополнительныеРеквизиты");
		
	ИначеЕсли ИмяДокумента = "упоПроектнаяЗадача" И ИмяФормы = "ФормаСпискаУправляемая" Тогда
		
		ИзменитьЭлементы_упоПроектнаяЗадача_ФормаСпискаУправляемая(Форма, Отказ);
					
	ИначеЕсли ИмяДокумента = "упоПроектнаяЗадача" И ИмяФормы = "ФормаДокументаУправляемая" Тогда  
		
		ИзменитьЭлементы_упоПроектнаяЗадача_ФормаДокументаУправляемая(Форма, Отказ);				
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_Справочники(ИмяСправочника, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяСправочника = "ДоговорыКонтрагентов" И ИмяФормы = "ФормаЭлемента" Тогда
		
		ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаЭлемента(Форма);
		
	ИначеЕсли ИмяСправочника = "Проекты" Тогда
		
		Если ИмяФормы = "ФормаЭлемента" Тогда
			ИзменитьЭлементы_Проекты_ФормаЭлемента(Форма, Отказ); 
		ИначеЕсли ИмяФормы = "упоФормаЭлементаУправляемая" Тогда  
			ИзменитьЭлементы_Проекты_упоФормаЭлементаУправляемая(Форма, Отказ); 
		ИначеЕсли ИмяФормы = "упоФормаСпискаУправляемая" Тогда
			ИзменитьЭлементы_Проекты_упоФормаСпискаУправляемая(Форма, Отказ); 			
		КонецЕсли;
		
	ИначеЕсли ИмяСправочника = "СтатьиДвиженияДенежныхСредств" И ИмяФормы = "ФормаЭлемента" Тогда
		
		упоИнтеграцияEPMСервер.ДобавитьЭлементы_СтатьиДвиженияДенежныхСредств_ФормаЭлемента(Форма);
		
	ИначеЕсли ИмяСправочника = "Пользователи" Тогда
		
		Если ИмяФормы = "ФормаЭлемента" Тогда
			ИзменитьЭлементы_Пользователи_ФормаЭлемента(Форма, Отказ);
		ИначеЕсли ИмяФормы = "ФормаСписка" Тогда
			ИзменитьЭлементы_Пользователи_ФормаСписка(Форма, Отказ);
		КонецЕсли;
		
	ИначеЕсли ИмяСправочника = "СтруктурныеЕдиницы" И ИмяФормы = "ФормаСписка" Тогда
		
		ДобавитьЭлементыФормыВыбораСтруктурныеЕдиницы(Форма, Отказ);
		
	ИначеЕсли ИмяСправочника = "КлассификаторЕдиницИзмерения" И ИмяФормы = "ФормаВыбора" Тогда
		
		ИзменитьЭлементы_КлассификаторЕдиницИзмерения_ФормаВыбора(Форма, Отказ);
		
	ИначеЕсли ИмяСправочника = "упоЗадания" И ИмяФормы = "ФормаЭлемента" Тогда
		
		ИзменитьЭлементы_упоЗадания_ФормаЭлемента(Форма, Отказ);  
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ПланыСчетов(ИмяПланаСчетов, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяПланаСчетов = "Управленческий" И ИмяФормы = "ФормаВыбора" Тогда
		
		ИзменитьЭлементы_ПланСчета_Управленческий_ФормаВыбора(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_Отчеты(ИмяОтчета, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяОтчета = "ПлатежныйКалендарь" И ИмяФормы = "Форма" Тогда
		
		ДобавитьЭлементы_ПлатежныйКалендарь_ФормаОтчета(Форма, Отказ);
		
	ИначеЕсли ИмяОтчета = "АнализБизнеса" И ИмяФормы = "Форма" Тогда
		
		ДобавитьЭлементы_АнализБизнеса_ФормаОтчета(Форма, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_Обработки(ИмяОбработки, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяОбработки = "ПерсональныеНастройки" И ИмяФормы = "МоиНастройки" Тогда 
		
		ДобавитьЭлементы_ПерсональныеНастройки_МоиНастройки(Форма, Отказ);
		
	ИначеЕсли ИмяОбработки = "КонтактЦентр" И ИмяФормы = "Форма" Тогда
		
		ДобавитьЭлементы_КонтактЦентр_Форма(Форма, Отказ);
						
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ОбщиеФормы(ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяФормы = "ПерсональныеНастройки" Тогда 
		
		ИзменитьЭлементы_ОбщаяФорма_ПерсональныеНастройки(Форма, Отказ);
		
	ИначеЕсли ИмяФормы = "упоНастройкаПараметровPM" Тогда	
		
		ИзменитьЭлементы_ОбщаяФорма_упоНастройкаПараметровPM(Форма, Отказ);	
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьЭлементы_Проекты_ФормаЭлемента(Форма, Отказ)
	
	упоИнтеграция.ДобавитьКомандуОткрытияФормыПроекта(Форма, "Подключаемый_упоОткрытьФормуПроектаPM",
		НСтр("ru = 'Открыть форму проекта PM'"));
		
КонецПроцедуры

// Список типов счетов, по которым синхронизируются статьи доходов
//
// Возвращаемое значение:
//  Массив - Список типов счетов
//
Функция ПредопределенныеЗначенияТиповСчетов_Доходы()
	
	МассивСчетовДоходы = Новый Массив();
	МассивСчетовДоходы.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.Доходы"));
	МассивСчетовДоходы.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ПрочиеДоходы"));
	МассивСчетовДоходы.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов"));
	
	Возврат МассивСчетовДоходы;
	
КонецФункции

// Список типов счетов, по которым синхронизируются статьи затрат
//
// Возвращаемое значение:
//  Массив - Список типов счетов
//
Функция ПредопределенныеЗначенияТиповСчетов_Затраты()
	
	МассивСчетовЗатраты = Новый Массив();
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.КосвенныеЗатраты"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.НезавершенноеПроизводство"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ПроцентыПоКредитам"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ПрочиеРасходы"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.Расходы"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.СебестоимостьПродаж"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.АмортизацияВнеоборотныхАктивов"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ВнеоборотныеАктивы"));
	МассивСчетовЗатраты.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ПрочиеОборотныеАктивы"));
	
	Возврат МассивСчетовЗатраты;
	
КонецФункции

Функция РодительСТипомГруппаСчетов(Счет, СтатьяМенеджер)
	
	СчетГруппаСчетов = Неопределено;
	СчетРодитель = Счет.Родитель;
	
	Если Не ЗначениеЗаполнено(Счет.Родитель) Тогда
		Возврат СтатьяМенеджер.ПустаяСсылка();
	КонецЕсли;
	
	Если СчетРодитель.ТипСчета = 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ТипыСчетов.ГруппаСчетов") Тогда
		Возврат СчетРодитель;
	Иначе 
		Возврат РодительСТипомГруппаСчетов(СчетРодитель, СтатьяМенеджер);
	КонецЕсли;
	
КонецФункции
 
Функция СправочникМенеджерПоТипуСчета(ТипСчета, ТипыСчетовВДоходы, ТипыСчетовВЗатраты)
	
	Если ТипыСчетовВДоходы.Найти(ТипСчета) <> Неопределено Тогда
		
		Возврат Справочники.упоСтатьиДоходов;
		
	ИначеЕсли ТипыСчетовВЗатраты.Найти(ТипСчета) <> Неопределено Тогда
		
		Возврат Справочники.упоСтатьиЗатрат;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
		
КонецФункции

Функция ВставитьГруппуРеквизитыPM(Форма, 
									Знач Родитель = Неопределено, 
									Знач ПередЭлементом = Неопределено, 
									Группировка = Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = ПередЭлементом.Родитель;
	КонецЕсли;	
	
	Если Группировка = Неопределено Тогда
		Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;	
	
	ГруппаPM = Форма.Элементы.Вставить("упоГруппаPM", 
										Тип("ГруппаФормы"), 
										Родитель, 
										ПередЭлементом);
			
	ГруппаPM.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаPM.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаPM.Группировка = Группировка;
	ГруппаPM.Заголовок = НСтр("ru = 'Реквизиты PM'");
	ГруппаPM.ОтображатьЗаголовок = Ложь;
	ГруппаPM.РазрешитьИзменениеСостава = Ложь;
		
	Возврат ГруппаPM;	
	
КонецФункции	

Процедура ДобавитьЭлементыПроектаВФорму(Форма)
	
	НужнаОбработкаФормыДокумента = Ложь;
	
	ИмяФормы = Форма.ИмяФормы;
	
	// Параметры добавления и изменения элементов
	Параметры	= СтруктураПараметров();
	ИмяГруппы 	= упоИнтеграцияУПФКлиентСервер.ИмяСоздаваемойГруппыДляНастройкиВидимостиЭлементов(); 
	
	МассивИменФормСПроектом = ПолучитьСписокФормСПроектом();
	
	Для Каждого ИмяФормыСПроектом Из МассивИменФормСПроектом Цикл
		
		Если ИмяФормы <> ИмяФормыСПроектом Тогда
			Продолжить;		
		КонецЕсли;
		
		НужнаОбработкаФормыДокумента = Истина;
		
		Прервать;
		
	КонецЦикла;

	Если Не НужнаОбработкаФормыДокумента Тогда
		Возврат;	
	КонецЕсли;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаЗаказНаряда" Тогда
		Параметры.ИмяСкрываемогоЭлемента = "ЗНПроект";	  
	// Для этих документов в шапку реквизит "Проект" не выводится.
	ИначеЕсли ИмяФормы = "Документ.Бюджет.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.НачислениеЗарплатыУНФ.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.НачисленияПоКредитамИЗаймам.Форма.ФормаДокумента" Тогда
		Параметры.ИмяСкрываемогоЭлемента = "";
	Иначе
		Параметры.ИмяСкрываемогоЭлемента = "Проект";		
	КонецЕсли;
	
	ДобавитьЭлементыПроектаВШапкуТаблицу(Форма, ИмяГруппы, Ложь, Параметры); 
	
	ТаблицыФормы = ТаблицыФормыСодержащиеПроект(Форма);	
	
	Для Каждого Таблица Из ТаблицыФормы Цикл	                                                                
		Параметры = ПараметрыДляДобавленияПроектаВТаблицу(Таблица);  

		Если Параметры.ИмяТабличнойЧасти = "РасшифровкаПлатежа"
			И (ИмяФормы = "Документ.ПоступлениеНаСчет.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.РасходСоСчета.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.ПоступлениеВКассу.Форма.ФормаДокумента"
			Или ИмяФормы = "Документ.РасходИзКассы.Форма.ФормаДокумента" 
			Или ИмяФормы = "Документ.ПлатежноеПоручение.Форма.ФормаДокумента") Тогда  
			
			Параметры.Вставить("ДобавитьВГруппуТЧ", Истина);         
			Параметры.Вставить("БезГруппировкиКолонок", Истина);
			Параметры.Вставить("НеОтображатьВШапке", Истина);
			Параметры.Вставить("НовыйЗаголовокРодителя", НСтр("ru = 'Проектная задача / Проект / Подразделение'"));	
			
		КонецЕсли;

		ИмяТабличнойЧасти = упоИнтеграцияУПФКлиентСервер.ИмяГруппыТЧПоИмениТЧ(Параметры.ИмяТабличнойЧасти);	
		
		ДобавитьЭлементыПроектаВШапкуТаблицу(Форма, ИмяТабличнойЧасти, Истина, Параметры);	
	КонецЦикла;
	
	УстановитьВидимостьЭлементовПроектИПроектнаяЗадачаВЗависимостиОтПользовательскихНастроек(Форма);	
	
КонецПроцедуры

// Добавляет на форму элементы и скрывает указанный в параметрах элемент
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Произвольная форма
//  ИмяСоздаваемойГруппы - Строка - Имя создаваемой группы
//  ЭтоЭлементТЧ - Булево - Определяет, где создаем элементы в табличной части или в группе формы
//  Параметры - Структура - Необходимые параметры
//   * ИмяТабличнойЧасти - Строка - Имя табличной части
//   * ИмяСкрываемогоЭлемента - Строка - Имя скрываемого элемента
//	 * ИмяГруппыВШапке - Строка - Имя группы в шапке
//	 * ПоложениеПроекта - Строка - Положение проекта
//
Процедура ДобавитьЭлементыПроектаВШапкуТаблицу(Форма, ИмяСоздаваемойГруппы, ЭтоЭлементТЧ, Параметры)
	
	Элементы = Форма.Элементы;
	
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	
	ИмяСкрываемогоЭлемента = Параметры.ИмяСкрываемогоЭлемента;   
	
	Если ИмяСкрываемогоЭлемента = "" Тогда
		Возврат;	
	КонецЕсли;         
	
	РодительСкрываемогоЭлемента	= Элементы.Найти(ИмяСкрываемогоЭлемента).Родитель;

	Если ЭтоЭлементТЧ Тогда
		Если Параметры.Свойство("ДобавитьВГруппуТЧ") И Параметры.ДобавитьВГруппуТЧ Тогда
			ГруппаРодитель = РодительСкрываемогоЭлемента;
		Иначе
			ГруппаРодитель = Элементы.Найти(ИмяТабличнойЧасти);
		КонецЕсли;
	Иначе        
		ГруппаРодитель 	= РодительСкрываемогоЭлемента; 		
	КонецЕсли;
	
	Если ГруппаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоЭлементТЧ Тогда
		// Предполагаем, что таб. часть содержит реквизит "Проект"
		ПутьКДанным = Форма.Элементы[ИмяТабличнойЧасти].ПутьКДанным;
	Иначе
		// Предполагаем, что основной реквизит формы называется "Объект".
		ПутьКДанным = "Объект";
	КонецЕсли;  
	
	ПутьКДаннымПроектнойЗадачи = ПутьКДанным + ".Проект";
	ПутьКДаннымПроекта = ПутьКДанным + ".Проект.упоКорневойПроект";
	
	Если Параметры.Свойство("НовыйЗаголовокРодителя") И ЗначениеЗаполнено(Параметры.НовыйЗаголовокРодителя) Тогда
		ГруппаРодитель.Заголовок = Параметры.НовыйЗаголовокРодителя;	
	КонецЕсли;
	
	ОтображатьВШапке = Истина; 
	
	Если Параметры.Свойство("НеОтображатьВШапке") Тогда
		ОтображатьВШапке = Ложь;
	КонецЕсли;
	
	ГруппировкаКолонокВГруппе = Истина;
	
	Если Параметры.Свойство("БезГруппировкиКолонок") Тогда
		ГруппировкаКолонокВГруппе = Ложь;
		ОтображатьВШапке = Ложь;
	КонецЕсли;
	
	ГруппаСоздаваемыхЭлементов = Элементы.Добавить(ИмяСоздаваемойГруппы, Тип("ГруппаФормы"), ГруппаРодитель);  
	
	Если ЭтоЭлементТЧ Тогда
		ГруппаСоздаваемыхЭлементов.Вид = ВидГруппыФормы.ГруппаКолонок; 
		
		Если ГруппировкаКолонокВГруппе Тогда
			ГруппаСоздаваемыхЭлементов.Группировка = ГруппировкаКолонок.Горизонтальная;
		КонецЕсли;  
		
	Иначе
		ГруппаСоздаваемыхЭлементов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСоздаваемыхЭлементов.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСоздаваемыхЭлементов.ОтображатьЗаголовок = Ложь;
		ГруппаСоздаваемыхЭлементов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	СкрываемыйЭлемент = Элементы.Найти(ИмяСкрываемогоЭлемента);
	
	Если СкрываемыйЭлемент <> Неопределено Тогда
		
		Элементы.Переместить(ГруппаСоздаваемыхЭлементов, ГруппаРодитель, СкрываемыйЭлемент);      
		
		ИмяГруппы = упоИнтеграцияУПФКлиентСервер.ИмяГруппыДляСкрытия(ИмяТабличнойЧасти);
		
		// Чтобы внутренняя логика изменения видимости для скрываемого поля не отрабатывала, помещаем его в отдельную группу
		// и делаем эту группу невидимой
		ГруппаСкрываемыхЭлементов = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаРодитель); 
		
		Если ЭтоЭлементТЧ Тогда
			ГруппаСкрываемыхЭлементов.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаСкрываемыхЭлементов.Группировка = ГруппировкаКолонок.Горизонтальная;
		Иначе
			ГруппаСкрываемыхЭлементов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСкрываемыхЭлементов.Отображение = ОтображениеОбычнойГруппы.Нет;
		КонецЕсли; 
		
		Элементы.Переместить(СкрываемыйЭлемент, ГруппаСкрываемыхЭлементов); 
		
		ГруппаСкрываемыхЭлементов.Видимость = Ложь;
		
	КонецЕсли;
	
	Подсказка = НСтр("ru = 'Проект, в рамках которого оформляется документ'");
	
	ИмяЭлемента = "упо&1ПроектнаяЗадача";
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "&1", ИмяТабличнойЧасти);
	
	ПолеПроектнаяЗадача 						= Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаСоздаваемыхЭлементов);
	ПолеПроектнаяЗадача.ПутьКДанным 			= ПутьКДаннымПроектнойЗадачи;
	ПолеПроектнаяЗадача.Вид 					= ВидПоляФормы.ПолеВвода;	
	ПолеПроектнаяЗадача.Заголовок				= НСтр("ru = 'Проектная задача'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ПолеПроектнаяЗадача.ОтображатьВШапке 		= ОтображатьВШапке;
	ПолеПроектнаяЗадача.Подсказка 				= Подсказка; 
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЭтоФормаВыбораПроектнойЗадачиКакПроекта", Истина));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЭтоПроектнаяЗадача", Истина));
	ПолеПроектнаяЗадача.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);	

	ИмяЭлемента = "упо&1Проект";
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "&1", ИмяТабличнойЧасти);
	
	ПолеПроект 			   		= Элементы.Добавить(ИмяЭлемента,Тип("ПолеФормы"), ГруппаСоздаваемыхЭлементов);
	ПолеПроект.ПутьКДанным 		= ПутьКДаннымПроекта;
	ПолеПроект.Заголовок   		= НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ПолеПроект.Вид	       		= ВидПоляФормы.ПолеНадписи;
	ПолеПроект.Гиперссылка 		= Истина;
	ПолеПроект.ОтображатьВШапке = ОтображатьВШапке;
	ПолеПроект.Подсказка 		= Подсказка;
	
КонецПроцедуры

// Роль БазовыеПраваБСП дает право на изменение справочника "Пользователи",
// при этом в УНФ есть подписка "ПриЗаписиПользователей", по которой создается элемент справочника "Сотрудники".
// Роли, которые дают возможность изменения Сотрудников, дают очень много прав,
// поэтому определяем возможность редактирования след. образом.
//
Функция РазрешеноРедактированиеПользователя(ПользовательСсылка)
	
	МожемРедактировать = ПравоДоступа("Добавление", Метаданные.Справочники.Сотрудники);	
	МожемРедактировать = МожемРедактировать Или ЗначениеЗаполнено(ПользовательСсылка);
	
	Возврат МожемРедактировать;
	
КонецФункции

Процедура ИзменитьЭлементы_Пользователи_ФормаЭлемента(Форма, Отказ)
			
	Форма.Доступность = РазрешеноРедактированиеПользователя(Форма.Объект.Ссылка);
	
КонецПроцедуры

Процедура ИзменитьЭлементы_Пользователи_ФормаСписка(Форма, Отказ)
		
	МожемДобавлять = ПравоДоступа("Добавление", Метаданные.Справочники.Сотрудники);	
	
	Элементы = Форма.Элементы;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СоздатьПользователя", "Видимость", МожемДобавлять);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СоздатьГруппуПользователей", "Видимость", МожемДобавлять);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ФормаСкопировать", "Видимость", МожемДобавлять);
		
КонецПроцедуры

// Скопирована из упоИнтеграцияEPMСервер.ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаЭлемента
//
Процедура ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаЭлемента(Форма)
	
	ГруппаЛево = Форма.Элементы.ЛеваяКолонка;		
	ГруппаPM = ВставитьГруппуРеквизитыPM(Форма,  , Форма.Элементы.ГруппаКомментарий);
	
	упоРодитель = Форма.Элементы.Добавить("упоРодитель", Тип("ПолеФормы"), ГруппаЛево);
	упоРодитель.ПутьКДанным = "Объект.Родитель";
	упоРодитель.Вид = ВидПоляФормы.ПолеВвода;
	упоРодитель.КнопкаВыбора = Истина;
	
	Форма.Элементы.Переместить(упоРодитель, ГруппаЛево, Форма.Элементы.Наименование); 
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	упоРодитель.СвязиПараметровВыбора = НовыеСвязи;
	
	ПодключитьОбработчикПриИзменении = Ложь;
	упоИнтеграцияEPMСервер.ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаДокумента_ДобавитьСтатус(Форма, ГруппаPM, ПодключитьОбработчикПриИзменении);
	
	упоСхемаОплаты = Форма.Элементы.Добавить("упоСхемаОплаты", Тип("ПолеФормы"), ГруппаPM);
	упоСхемаОплаты.ПутьКДанным = "Объект.упоСхемаОплаты";
	упоСхемаОплаты.Вид = ВидПоляФормы.ПолеВвода;
	упоСхемаОплаты.КнопкаВыбора = Истина;	
	
КонецПроцедуры	

Процедура ИзменитьЭлементы_ЗаказПоставщику_ФормаЭлемента(Форма, Отказ)
	
	ГруппаДополнительныеРеквизиты = Форма.Элементы.Найти("ГруппаДополнительныеРеквизиты");
	
	Если ГруппаДополнительныеРеквизиты <> Неопределено Тогда
		
		ДобавитьЭлементПроектНаФорму(Форма, ГруппаДополнительныеРеквизиты, "Объект.упоПроектнаяЗадача.упоКорневойПроект"); 	
		ДобавитьЭлементПроектнаяЗадачаНаФорму(Форма, ГруппаДополнительныеРеквизиты, "Объект.упоПроектнаяЗадача"); 

	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЭлементы_ПроектИПроектнаяЗадача_ФормаЭлемента(Форма, Отказ, НаименованиеГруппаРодитель)

	ГруппаРодитель = Форма.Элементы.Найти(НаименованиеГруппаРодитель);
	
	Если ГруппаРодитель <> Неопределено Тогда
		
		ДобавитьЭлементПроектНаФорму(Форма, ГруппаРодитель, "Объект.Проект.упоКорневойПроект"); 	
		ДобавитьЭлементПроектнаяЗадачаНаФорму(Форма, ГруппаРодитель, "Объект.Проект"); 

	КонецЕсли;	
	
КонецПроцедуры
 
Процедура ДобавитьЭлементПроектНаФорму(Форма, ГруппаРодитель, ПутьКДанным)

	ПолеПроект 				= Форма.Элементы.Добавить("упоПроект", Тип("ПолеФормы"), ГруппаРодитель);
	ПолеПроект.ПутьКДанным	= ПутьКДанным;
	ПолеПроект.Заголовок	= НСтр("ru = 'Проект'", ОбщегоНазначения.КодОсновногоЯзыка());
	ПолеПроект.Вид			= ВидПоляФормы.ПолеНадписи;
	ПолеПроект.Гиперссылка	= Истина;
	ПолеПроект.Ширина 		= 28; 
	
КонецПроцедуры

Процедура ДобавитьЭлементПроектнаяЗадачаНаФорму(Форма, ГруппаРодитель, ПутьКДанным)
	
	ПолеПроектнаяЗадача 			= Форма.Элементы.Добавить("упоПроектнаяЗадача", Тип("ПолеФормы"), ГруппаРодитель);
	ПолеПроектнаяЗадача.ПутьКДанным = ПутьКДанным; 
	ПолеПроектнаяЗадача.Заголовок	= НСтр("ru = 'Проектная задача'", ОбщегоНазначения.КодОсновногоЯзыка());		
	ПолеПроектнаяЗадача.Вид 		= ВидПоляФормы.ПолеВвода;
	ПолеПроектнаяЗадача.Ширина 		= 28;
	
КонецПроцедуры    

Процедура ДобавитьЭлементы_ПлатежныйКалендарь_ФормаОтчета(Форма, Отказ)
	
	Элементы = Форма.Элементы;
	
	ДобавляемыеРеквизиты = Новый Массив;	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("упоОтборПроект", Новый ОписаниеТипов("СправочникСсылка.Проекты"), ,
																											"Отбор проект"));	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("упоОтборПЗ", Новый ОписаниеТипов("СправочникСсылка.Проекты"), ,
																											"Отбор проектная задача"));		
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ГруппаРодитель = Элементы.Найти("ГруппаСтрокиЭлементы");
	
	Если ГруппаРодитель <> Неопределено Тогда         
		
		ЭлементОтображатьСтатью = Элементы.Найти("ОтображатьСтатью");
		
		Если ЭлементОтображатьСтатью = Неопределено Тогда
			НовыйЭлементФормы = Элементы.Добавить("упоОтображатьПроект", Тип("ПолеФормы"), ГруппаРодитель);		
		Иначе
			НовыйЭлементФормы = Элементы.Вставить("упоОтображатьПроект", Тип("ПолеФормы"), ГруппаРодитель, 
																						ЭлементОтображатьСтатью);
		КонецЕсли;
		
		НовыйЭлементФормы.ПутьКДанным = "Объект.упоОтображатьПроект"; 
		НовыйЭлементФормы.Заголовок	= НСтр("ru = 'Проект'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементФормы.Вид 		= ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
		НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемые_упоОтображатьПроектПриИзменении");
		
		Если ЭлементОтображатьСтатью = Неопределено Тогда
			НовыйЭлементФормы = Элементы.Добавить("упоОтображатьПроектнуюЗадачу", Тип("ПолеФормы"), ГруппаРодитель);		
		Иначе
			НовыйЭлементФормы = Элементы.Вставить("упоОтображатьПроектнуюЗадачу", Тип("ПолеФормы"), ГруппаРодитель, 
																						ЭлементОтображатьСтатью);
		КонецЕсли;
		
		НовыйЭлементФормы.ПутьКДанным = "Объект.упоОтображатьПроектнуюЗадачу"; 
		НовыйЭлементФормы.Заголовок	= НСтр("ru = 'Проектная задача'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементФормы.Вид 		= ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
		НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемые_упоОтображатьПроектнуюЗадачуПриИзменении");
		
		Элементы.Переместить(ЭлементОтображатьСтатью, ГруппаРодитель, Элементы.упоОтображатьПроект);
		
	КонецЕсли;
	
	ГруппаФильтры = Элементы.Найти("ГруппаФильтры");  
	
	Если ГруппаФильтры <> Неопределено Тогда
		
		ЭлементГруппаОтборСтатья = Элементы.Найти("ОтображатьСтатью");
		
		Если ЭлементГруппаОтборСтатья <> Неопределено Тогда
			НовыйЭлементГруппа = Элементы.Вставить("упоГруппаОтборПроекты", Тип("ГруппаФормы"), ГруппаФильтры, 
																					Элементы.ГруппаОтборСтатья);
		Иначе
			НовыйЭлементГруппа = Элементы.Добавить("упоГруппаОтборПроекты", Тип("ГруппаФормы"), ГруппаФильтры);
		КонецЕсли;
		
		НовыйЭлементГруппа.Заголовок			= НСтр("ru = 'Отбор проект'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементГруппа.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементГруппа.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлементГруппа.Отображение 			= ОтображениеОбычнойГруппы.Нет;
		НовыйЭлементГруппа.ОтображатьЗаголовок 	= Ложь;	           
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЭтоФормаВыбораПроекта", Истина));  
	
		НовыйЭлементФормы = Элементы.Добавить("упоОтборПроект", Тип("ПолеФормы"), НовыйЭлементГруппа);
		НовыйЭлементФормы.ПутьКДанным 			= "упоОтборПроект"; 
		НовыйЭлементФормы.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода; 
		НовыйЭлементФормы.ПодсказкаВвода		= НСтр("ru = 'Проект'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементФормы.КнопкаОткрытия		= Ложь;
	   	НовыйЭлементФормы.ПараметрыВыбора 		= Новый ФиксированныйМассив(ПараметрыВыбора);
		НовыйЭлементФормы.УстановитьДействие("ОбработкаВыбора", "Подключаемые_упоОтборПроектОбработкаВыбора");
		
		Если ЭлементГруппаОтборСтатья <> Неопределено Тогда
			НовыйЭлементГруппа = Элементы.Вставить("упоГруппаОтборПЗ", Тип("ГруппаФормы"), ГруппаФильтры, 
																					Элементы.ГруппаОтборСтатья);
		Иначе
			НовыйЭлементГруппа = Элементы.Добавить("упоГруппаОтборПЗ", Тип("ГруппаФормы"), ГруппаФильтры);
		КонецЕсли;
		
		НовыйЭлементГруппа.Заголовок			= НСтр("ru = 'Отбор проектная задача'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементГруппа.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементГруппа.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлементГруппа.Отображение 			= ОтображениеОбычнойГруппы.Нет;
		НовыйЭлементГруппа.ОтображатьЗаголовок 	= Ложь;	           
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЭтоФормаВыбораПроектнойЗадачиКакПроекта", Истина));  
	
		НовыйЭлементФормы = Элементы.Добавить("упоОтборПЗ", Тип("ПолеФормы"), НовыйЭлементГруппа);
		НовыйЭлементФормы.ПутьКДанным 			= "упоОтборПЗ"; 
		НовыйЭлементФормы.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода; 
		НовыйЭлементФормы.ПодсказкаВвода		= НСтр("ru = 'Проектная задача'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементФормы.КнопкаОткрытия		= Ложь;
	   	НовыйЭлементФормы.ПараметрыВыбора 		= Новый ФиксированныйМассив(ПараметрыВыбора);
		НовыйЭлементФормы.УстановитьДействие("ОбработкаВыбора", "Подключаемые_упоОтборПЗОбработкаВыбора");

		
	КонецЕсли;
	
	ГруппаСтраницаОтбор = Элементы.Найти("ГруппаСтраницаОтбор"); 
	
	Если ГруппаСтраницаОтбор <> Неопределено Тогда
			
			НовыйЭлементФормы = Элементы.Вставить("упоОтражатьДанныеПоПроекту", Тип("ПолеФормы"), ГруппаСтраницаОтбор, 
																										ГруппаФильтры);
			НовыйЭлементФормы.ПутьКДанным = "Объект.упоОтражатьДанныеПоПроекту";																							
			НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлементФормы.ВидФлажка = ВидФлажка.Выключатель;
			НовыйЭлементФормы.Заголовок	= НСтр("ru = 'Отражать данные по проекту'", ОбщегоНазначения.КодОсновногоЯзыка());
			НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
			НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемые_упоОтражатьДанныеПоПроектуПриИзменении"); 
			
			НовыйЭлементФормы = Элементы.Вставить("упоОтражатьИерархиюИСтатус", Тип("ПолеФормы"), ГруппаСтраницаОтбор, 
																										ГруппаФильтры);
			НовыйЭлементФормы.ПутьКДанным = "Объект.упоОтражатьИерархиюИСтатус";																							
			НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлементФормы.ВидФлажка = ВидФлажка.Выключатель;
			НовыйЭлементФормы.Заголовок	= НСтр("ru = 'Отражать иерархию и статус'", ОбщегоНазначения.КодОсновногоЯзыка());
			НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право; 
			НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "Подключаемые_упоОтражатьИерархиюИСтатусПриИзменении");
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьЭлементы_АнализБизнеса_ФормаОтчета(Форма, Отказ)
	
	ЭлементПроект = Форма.Элементы.ОтборПроект;
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЭтоФормаВыбораПроекта", Истина));
	
	ЭлементПроект.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормыВыбораСтруктурныеЕдиницы(Форма, Отказ)
	
	ПараметрыФормы = Форма.Параметры;
	
	Если ПараметрыФормы.Свойство("упоВыборПодразделения") Тогда
		Реквизит_упоВыборПодразделения 			= Новый РеквизитФормы("упоВыборПодразделения", Новый ОписаниеТипов("Булево"));  
		Реквизит_упоАдресПараметровДляОтбора 	= Новый РеквизитФормы("упоАдресПараметровДляОтбора", 
			Новый ОписаниеТипов("Строка"));               
			
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Реквизит_упоВыборПодразделения);
		ДобавляемыеРеквизиты.Добавить(Реквизит_упоАдресПараметровДляОтбора);
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
		
		Форма.упоВыборПодразделения = ПараметрыФормы.упоВыборПодразделения;
		
		Форма.Элементы.Список.УстановитьДействие("ВыборЗначения", "Подключаемый_упоСписокВыборЗначения");	
	КонецЕсли; 
	
	Если ПараметрыФормы.Свойство("РежимОтображения") И ЗначениеЗаполнено(ПараметрыФормы.РежимОтображения) Тогда
		Форма.РежимОтображения 			= ПараметрыФормы.РежимОтображения;       
		Форма.ТекущийРежимОтображения 	= ПараметрыФормы.РежимОтображения;		
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьЭлементы_ПерсональныеНастройки_МоиНастройки(Форма, Отказ)
	
	ИмяГруппы = "ГруппаПрочиеНастройки";
	ГруппаПередКоторойВставитьНовую = Форма.Элементы.Найти(ИмяГруппы);
	
	ИмяНовойГруппы = "НастройкиУправленияПроектов";
	ЗаголовокНовойГруппы = НСтр("ru = 'Настройки управления проектами'");
	
	НовыйЭлементГруппа = Форма.Элементы.Вставить(ИмяНовойГруппы,
												Тип("ГруппаФормы"),
												Форма,
												ГруппаПередКоторойВставитьНовую);
	НовыйЭлементГруппа.Заголовок = ЗаголовокНовойГруппы;
	НовыйЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;

	Гиперссылка = Форма.Элементы.Добавить("УправлениеПроектами",
										  Тип("ДекорацияФормы"),
										  НовыйЭлементГруппа);
	Гиперссылка.Заголовок = Новый ФорматированнаяСтрока(НСтр("ru = 'Управление проектами'"),
														,
														,
														,
														"e1cib/command/ОбщаяКоманда.ПерсональныеНастройки");
		
КонецПроцедуры 

Процедура ИзменитьЭлементы_ОбщаяФорма_ПерсональныеНастройки(Форма, Отказ)
	
	Форма.Заголовок = НСтр("ru = 'Управление проектами'");
	
	ИмяГруппыТиповыхЭлементов = "Группа";
	ГруппаТиповыхЭлементов = Форма.Элементы.Найти(ИмяГруппыТиповыхЭлементов);

	Для каждого Элемент Из ГруппаТиповыхЭлементов.ПодчиненныеЭлементы Цикл
	
		Элемент.Видимость = Ложь;

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьЭлементы_Событие_ФормаСписка(Форма, Отказ)
	
	// Для типового отбора по Проекту установим параметры отбора,
	// необходимо только проекты, без ПЗ.
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЭтоФормаВыбораПроекта", Истина));  
	Форма.Элементы.ОтборПроект.ПараметрыВыбора 		= Новый ФиксированныйМассив(ПараметрыВыбора);
	
	ДобавляемыеРеквизиты = Новый Массив;	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("упоОтборПЗ", 
														Новый ОписаниеТипов("СправочникСсылка.Проекты"), 
														,
														"Отбор проектная задача"));
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);													
	
	ГруппаРодитель = Форма.Элементы.Найти("ГруппаОтборы");
	Если ГруппаРодитель <> Неопределено Тогда
		ГруппаПроекты = Форма.Элементы.Найти("Проекты");
		Если ГруппаПроекты <> Неопределено Тогда
			НовыйЭлементГруппа = Форма.Элементы.Вставить("упоГруппаОтборПЗ", Тип("ГруппаФормы"), ГруппаРодитель, ГруппаПроекты);
			Форма.Элементы.Переместить(ГруппаПроекты, ГруппаРодитель, НовыйЭлементГруппа);
		Иначе	
			НовыйЭлементГруппа = Форма.Элементы.Добавить("упоГруппаОтборПЗ", Тип("ГруппаФормы"), ГруппаРодитель);		
		КонецЕсли;
		
		НовыйЭлементГруппа.Заголовок			= НСтр("ru = 'Отбор проектная задача'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементГруппа.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементГруппа.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлементГруппа.Отображение 			= ОтображениеОбычнойГруппы.Нет;
		НовыйЭлементГруппа.ОтображатьЗаголовок 	= Ложь;	           
		
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ЭтоФормаВыбораПроектнойЗадачиКакПроекта", Истина));  
		
		НовыйЭлементФормы = Форма.Элементы.Добавить("упоОтборПЗ", Тип("ПолеФормы"), НовыйЭлементГруппа);
		НовыйЭлементФормы.ПутьКДанным 			= "упоОтборПЗ"; 
		НовыйЭлементФормы.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода; 
		НовыйЭлементФормы.ПодсказкаВвода		= НСтр("ru = 'Проектная задача'", ОбщегоНазначения.КодОсновногоЯзыка());
		НовыйЭлементФормы.КнопкаОткрытия		= Ложь;
		НовыйЭлементФормы.ПараметрыВыбора 		= Новый ФиксированныйМассив(ПараметрыВыбора);
		НовыйЭлементФормы.УстановитьДействие("ОбработкаВыбора", "Подключаемые_упоОтборПЗОбработкаВыбора");
	КонецЕсли;

	// Изменим текст запроса.
	// 1. Переименуем поле Проект в ПроектнаяЗадача, 
	// т.к. фактически в нем хранится ссылка на ПЗ, по этому полю будет работать
	// новый, добавленный программно выше отбор.
	// 2. Добавим поле Проект.упоКорневойПроект с псевдонимом Проект,
	// чтобы типовой отбор по проекту работал по этому полю.
	Форма.Список.ТекстЗапроса = СтрЗаменить(Форма.Список.ТекстЗапроса, 
									  "КАК Проект", 
									  "КАК ПроектнаяЗадача,
									  |ДокументСобытие.Проект.упоКорневойПроект КАК Проект");
		
КонецПроцедуры 

Функция ОпределитьВидимостьГрупп(Форма)
		
	ВидимостьГрупп = Истина;  
	
	ОбъектФормы = Форма.Объект;
	ИмяФормы 	= Форма.ИмяФормы;    
	
	Если ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаДокумента" Тогда
		
		Если ОбъектФормы.ВидОперации <> 
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы") Тогда
			ВидимостьГрупп = Ложь;
		КонецЕсли;
		
	ИначеЕсли ИмяФормы = "Документ.ПлатежноеПоручение.Форма.ФормаДокумента" Тогда
		
		Если ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПереводНаДругойСчет") 
			//ИЛИ ОбъектФормы.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога") Тогда
			ВидимостьГрупп = Ложь;
		КонецЕсли;	
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеВКассу.Форма.ФормаДокумента" Тогда
		
		Если ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ВозвратЗаймаСотрудником") 
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПокупкаВалюты")
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РозничнаяВыручка")
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПолучениеНаличныхВБанке") Тогда
			ВидимостьГрупп = Ложь;
		КонецЕсли;	
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеНаСчет.Форма.ФормаДокумента" Тогда
		
		Если ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником") 
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВзносНаличными")
			//ИЛИ ОбъектФормы.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПереводСДругогоСчета") 
			//ИЛИ ОбъектФормы.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги 
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам") Тогда
			ВидимостьГрупп = Ложь;
		КонецЕсли;		
		
	ИначеЕсли ИмяФормы = "Документ.РасходИзКассы.Форма.ФормаДокумента" Тогда
		
		Если ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ВыдачаЗаймаСотруднику")
			//ИЛИ ОбъектФормы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.РасчетыПоКредитам
			//ИЛИ ОбъектФормы.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.Налоги 
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ВзносНаличнымиВБанк") 
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ПеремещениеВКассуККМ") Тогда
			ВидимостьГрупп = Ложь;
		КонецЕсли;	
		
	ИначеЕсли ИмяФормы = "Документ.РасходСоСчета.Форма.ФормаДокумента" Тогда
		
		Если ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику") 
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет")
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.СнятиеНаличных")
			//ИЛИ ОбъектФормы.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги 
			ИЛИ ОбъектФормы.ВидОперации = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты") Тогда
			ВидимостьГрупп = Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ВидимостьГрупп;
	
КонецФункции

Функция ПараметрыДляДобавленияПроектаВТаблицу(ТаблицаФормы)
	
	Параметры = СтруктураПараметров();
    ПолеТаблицыСвязанноеСПроектом = ПолеСвязанноеСПроектом(ТаблицаФормы);
	
	Если ПолеТаблицыСвязанноеСПроектом = Неопределено Тогда  
		Возврат Параметры; 	
	КонецЕсли;	         
	
	Параметры.ИмяСкрываемогоЭлемента 	= ПолеТаблицыСвязанноеСПроектом.Имя;
	Параметры.ИмяТабличнойЧасти 		= ТаблицаФормы.Имя;	
	
	Возврат Параметры;
	
КонецФункции

Функция ПолеСвязанноеСПроектом(ТаблицаИлиГруппаФормы, ТаблицаВладелецЭлемента = Неопределено)
	
	Если ТипЗнч(ТаблицаИлиГруппаФормы) = Тип("ТаблицаФормы") Тогда
		ТаблицаВладелецЭлемента = ТаблицаИлиГруппаФормы;
	Иначе
		ТаблицаВладелецЭлемента = ТаблицаВладелецЭлемента;
	КонецЕсли;
	
	Для Каждого ЭлементТаблицы Из ТаблицаИлиГруппаФормы.ПодчиненныеЭлементы Цикл
		
		Если ЭтоПолеСвязанноеСПроектом(ЭлементТаблицы, ТаблицаВладелецЭлемента) Тогда
			Возврат ЭлементТаблицы;
		КонецЕсли;
		
		Если ЭтоГруппаСодержащаяПолеСвязанноеСПроектом(ЭлементТаблицы, ТаблицаИлиГруппаФормы) Тогда
			Возврат ПолеСвязанноеСПроектом(ЭлементТаблицы, ТаблицаВладелецЭлемента);
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСписокФормСПроектом()

	МассивИменФорм = Новый Массив;
	МассивИменФорм.Добавить("Документ.АвансовыйОтчет.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.АктВыполненныхРабот.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ЗаказПокупателя.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ЗаказПокупателя.Форма.ФормаЗаказНаряда");
	МассивИменФорм.Добавить("Документ.НачислениеЗарплатыУНФ.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ОтчетКомиссионера.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ОтчетКомитенту.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ОтчетОПереработке.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ПоступлениеВКассу.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.РасходИзКассы.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ПоступлениеНаСчет.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.РасходСоСчета.Форма.ФормаДокумента"); 
	МассивИменФорм.Добавить("Документ.ПлатежноеПоручение.Форма.ФормаДокумента"); 	
	МассивИменФорм.Добавить("Документ.ПриемИПередачаВРемонт.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ПриходнаяНакладная.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ПрочиеРасходы.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.РасходнаяНакладная.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.Событие.Форма.ФормаСобытия");
	МассивИменФорм.Добавить("Документ.ПеремещениеЗапасов.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.Бюджет.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.НачисленияПоКредитамИЗаймам.Форма.ФормаДокумента");
	МассивИменФорм.Добавить("Документ.ОтчетКомиссионераОСписании.Форма.ФормаДокумента"); 

	Возврат МассивИменФорм;	

КонецФункции

Функция СтруктураПараметров()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяСкрываемогоЭлемента", "");
	Параметры.Вставить("ИмяТабличнойЧасти", "");
	
	Возврат Параметры;   
	
КонецФункции

// Возвращает массив таблиц формы, в которых есть элемент "Проект"
//
// Параметры:
//  Форма	 - форма, из обработчика события которой происходит вызов процедуры 
// 
// Возвращаемое значение:
//  Массив - Массив элементов с типом "Таблица формы"
//
Функция ТаблицыФормыСодержащиеПроект(Форма)
	
	ЭлементыФормы			 = Форма.Элементы;
	ТаблицыСПроектами		 = Новый Массив;
	ЭтаТаблицаСодержитПроект = Ложь;
	
	Для каждого Элемент Из ЭлементыФормы Цикл
		
		ЭтоТаблицаФормы = ТипЗнч(Элемент) = Тип("ТаблицаФормы");
		
		Если ЭтоТаблицаФормы = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ПодчиненныеЭлементыТаблицы = Элемент.ПодчиненныеЭлементы;
		
		Для каждого ЭлементТаблицы Из ПодчиненныеЭлементыТаблицы Цикл
			
			Если ЭтоПолеСвязанноеСПроектом(ЭлементТаблицы, Элемент)
				Или ЭтоГруппаСодержащаяПолеСвязанноеСПроектом(ЭлементТаблицы, Элемент) Тогда
				ЭтаТаблицаСодержитПроект = Истина;
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;
		
		Если ЭтаТаблицаСодержитПроект Тогда
			ТаблицыСПроектами.Добавить(Элемент);
		КонецЕсли;
		
		ЭтаТаблицаСодержитПроект = Ложь;
		
	КонецЦикла;
	
	Возврат ТаблицыСПроектами;
	
КонецФункции
 
Функция ЭтоГруппаСодержащаяПолеСвязанноеСПроектом(ЭлементТаблицы, ТаблицаФормы)
	
	ЭтоГруппаФормы = ТипЗнч(ЭлементТаблицы) = Тип("ГруппаФормы");
	
	Если Не ЭтоГруппаФормы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоГруппаДобавленнаяПрограммноДляОтображенияПроектаИПЗ =
		ВРЕГ(ЭлементТаблицы.Имя) = ВРЕГ(упоИнтеграцияУПФКлиентСервер.ИмяГруппыТЧПоИмениТЧ(ТаблицаФормы.Имя)); 
		
	Если ЭтоГруппаДобавленнаяПрограммноДляОтображенияПроектаИПЗ Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Для Каждого ПодчиненныйЭлемент Из ЭлементТаблицы.ПодчиненныеЭлементы Цикл
		
		Если НЕ (ЭтоПолеСвязанноеСПроектом(ПодчиненныйЭлемент, ТаблицаФормы)
			Или ЭтоГруппаСодержащаяПолеСвязанноеСПроектом(ПодчиненныйЭлемент, ТаблицаФормы)) Тогда
			Продолжить;
		КонецЕсли;	
		
		Возврат Истина; 
		
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоПолеСвязанноеСПроектом(ЭлементТаблицы, ТаблицаФормы) Экспорт
	
	ЭтоПолеФормы = (ТипЗнч(ЭлементТаблицы) = Тип("ПолеФормы"));
	
	Если Не ЭтоПолеФормы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПолеСвязаноСПроектом = ВРЕГ(ЭлементТаблицы.ПутьКДанным) = ВРЕГ(ТаблицаФормы.ПутьКДанным + ".Проект"); 
	
	Возврат ПолеСвязаноСПроектом;

КонецФункции

#Область ЗаполнениеЗаказа

Процедура ЗаполнитьЗаказ(Форма)
	
	Параметры = Форма.Параметры;
	Если Не Параметры.Свойство("упоДанныеЗаполнения") Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыСозданияЗаказов = Параметры.упоДанныеЗаполнения.ПараметрыСозданияЗаказов;
	// Удалим ключи с незаполненными значениями, чтобы не затирать данные, заполненные по умолчанию в УНФ 
	// (см.ОбработкаЗаполнения в заказах).
	УдалитьНезаполненныеЗначенияИзСтруктурыЗаполнения(ПараметрыСозданияЗаказов);
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы <> ПараметрыСозданияЗаказов.ИмяФормы Тогда
		Возврат;		
	КонецЕсли;
	
	БылоЗаполнение = Параметры.упоДанныеЗаполнения.Свойство("БылоЗаполнение");
	Если БылоЗаполнение Тогда 
		Возврат;
	КонецЕсли;
	Параметры.упоДанныеЗаполнения.Вставить("БылоЗаполнение", Истина);
	
	ДанныеЗаказа = Параметры.упоДанныеЗаполнения.ДанныеЗаказа;
		
	ОбъектФормы = Форма.Объект;		
	ЗаполнитьЗначенияСвойств(ОбъектФормы, ПараметрыСозданияЗаказов);
	ШапкаЗаказа = ДанныеЗаказа.ШапкаЗаказа;
	ЗаполнитьЗначенияСвойств(ОбъектФормы, ШапкаЗаказа);
		
	ВидДокументаЗаказПокупателя = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяВидаЗаказаПокупателя();
	ЭтоЗаказПокупателя = ПараметрыСозданияЗаказов.ВидДокумента = ВидДокументаЗаказПокупателя;
	Если ЭтоЗаказПокупателя Тогда
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны", Истина);
	Иначе
		ПараметрыРасчета = Новый Структура;	
	КонецЕсли;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", ОбъектФормы.СуммаВключаетНДС);
	
	ИмяЗаполняемойТабличнойЧасти = ПараметрыСозданияЗаказов.ИмяТабличнойЧасти;
	ТЧЗапасы = ОбъектФормы[ИмяЗаполняемойТабличнойЧасти];
	ТабличнаяЧасть = ДанныеЗаказа.ТабличнаяЧасть;
	Для Каждого СтрокаЗапасов Из ТабличнаяЧасть Цикл
		
		СтрокаТЧЗапасы = ТЧЗапасы.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаТЧЗапасы, СтрокаЗапасов);		
		
		Если ЭтоЗаказПокупателя Тогда
			СтрокаТЧЗапасы.ДатаОтгрузки = СтрокаЗапасов.ДатаНачисления;
		Иначе
			СтрокаТЧЗапасы.ДатаПоступления = СтрокаЗапасов.ДатаНачисления;
		КонецЕсли;
		
		МодульТабличныеЧастиУНФКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ТабличныеЧастиУНФКлиентСервер");
		МодульТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(СтрокаТЧЗапасы, ПараметрыРасчета);
		
	КонецЦикла;
	
	// Платежный календарь 
	УстановитьПривилегированныйРежим(Истина);	    
	
	ПлатежныйКалендарьИспользуется = Константы["ФункциональнаяОпцияПлатежныйКалендарь"].Получить();	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеЗаказа.Свойство("ПлатежныйКалендарь") И ПлатежныйКалендарьИспользуется Тогда	
		
		ЗапланироватьОплату = Ложь;
		
		ВедетсяБюджетДвиженияДенежныхСредств = ПолучитьСвойствоВедетсяБюджетДвиженияДенежныхСредств(ОбъектФормы.Проект);
		
		Если ВедетсяБюджетДвиженияДенежныхСредств Тогда	
			ЗапланироватьОплату = Истина;			
		КонецЕсли;
		
		ОбъектФормы.ЗапланироватьОплату = ЗапланироватьОплату;
		
		Форма.Элементы.РедактироватьСписком.Пометка = Истина;
		ТЧПлатежныйКалендарь = ОбъектФормы.ПлатежныйКалендарь;   
		
		Для Каждого СтрокаПлатежногоКалендаря Из ДанныеЗаказа.ПлатежныйКалендарь Цикл
			СтрокаТЧ = ТЧПлатежныйКалендарь.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаПлатежногоКалендаря);
		

			ЗапасыИтог = ОбъектФормы.Запасы.Итог("Всего");
			ПлатежныйКалендарьИтог = ОбъектФормы.ПлатежныйКалендарь.Итог("СуммаОплаты");
			
			Если ПлатежныйКалендарьИтог > ЗапасыИтог Тогда
				СтрокаТЧ.СуммаОплаты = СтрокаТЧ.СуммаОплаты - (ПлатежныйКалендарьИтог - ЗапасыИтог);
			КонецЕсли;
			
			СтрокаТЧ.ПроцентОплаты = ?(ЗапасыИтог = 0, 0, Окр(СтрокаТЧ.СуммаОплаты / ЗапасыИтог * 100, 2, 1));
			СтрокаТЧ.СуммаНДСОплаты = Окр(ОбъектФормы.Запасы.Итог("СуммаНДС") * СтрокаТЧ.ПроцентОплаты / 100, 2, 1);
			
			Если ОбъектФормы.ПлатежныйКалендарь.Итог("ПроцентОплаты") = 100 И ОбъектФормы.ПлатежныйКалендарь.Итог("СуммаОплаты") <> ОбъектФормы.Запасы.Итог("Всего") Тогда
				ТаблицаРаспределения = ОбъектФормы.ПлатежныйКалендарь.Выгрузить();
				
				Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
					МодульРасчетыПроведениеДокументов = ОбщегоНазначения.ОбщийМодуль("РасчетыПроведениеДокументов");
					МодульРасчетыПроведениеДокументов.РаспределитьСуммуПоКолонкеТаблицы(ОбъектФормы.Запасы.Итог("Всего"), ТаблицаРаспределения,
						"СуммаОплаты", "ПроцентОплаты");
				КонецЕсли;
				
				ОбъектФормы.ПлатежныйКалендарь.Загрузить(ТаблицаРаспределения);
			КонецЕсли;
		

		КонецЦикла;	
	КонецЕсли;	
 	
КонецПроцедуры

Функция ДополнитьРеквизитамиШапкиПоУмолчанию(ПроектнаяЗадача, ПараметрыСозданияЗаказов)
	
	ПараметрыСозданияЗаказов = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыСозданияЗаказов);
		
	ТекДата = ТекущаяДата();
	Дата = НачалоДня(ТекДата);
	ПараметрыСозданияЗаказов.Вставить("Дата", Дата);	
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("Автор", "Автор");
	ИменаРеквизитов.Вставить("Проект", "Проект");
	ИменаРеквизитов.Вставить("Организация", "Проект.Организация");	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроектнаяЗадача, ИменаРеквизитов, Истина);
	Организация = ЗначенияРеквизитов.Организация;
	ПараметрыСозданияЗаказов.Вставить("Организация", Организация);
	
	ПроектнаяЗадачаСправочник = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(ПроектнаяЗадача);
	ПараметрыСозданияЗаказов.Вставить("Проект", ПроектнаяЗадачаСправочник);
	ПараметрыСозданияЗаказов.Вставить("упоПроектнаяЗадача", ПроектнаяЗадачаСправочник);
	
	Проект = ЗначенияРеквизитов.Проект;
	ПроверитьВозможностьПолученияДанныхДляЗаказаПокупателя(Проект, ПараметрыСозданияЗаказов);
	СтруктураНастроек = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	СтруктурнаяЕдиница = ПолучитьСтруктурнуюЕдиницуПоВидуДокумента(Проект, ПараметрыСозданияЗаказов);
	ПараметрыСозданияЗаказов.Вставить(ПараметрыСозданияЗаказов.ИмяРеквизитаСтруктурнойЕдиницы, СтруктурнаяЕдиница);	
	
	ВидСтавкиНДСПоУмолчанию = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВидСтавкиНДСПоУмолчанию", Истина);
	ПараметрыСозданияЗаказов.Вставить("ВидСтавкиНДСПоУмолчанию", ВидСтавкиНДСПоУмолчанию);	
		
	СотрудникиПользователя = 
		РегистрыСведений["СотрудникиПользователя"].ПолучитьСотрудниковПользователя(ЗначенияРеквизитов.Автор);
	Если СотрудникиПользователя.Количество() <> 0 Тогда
		ПараметрыСозданияЗаказов.Вставить("Ответственный", СотрудникиПользователя[0]);
	КонецЕсли; 
	
	Возврат ПараметрыСозданияЗаказов;
	
КонецФункции

Функция ОпределитьИзменениеГруппировочныхПолей(ГруппировочныеПоля, Выборка)
	
	ЕстьИзменения = Ложь;
	Для Каждого ГруппировочноеПоле Из ГруппировочныеПоля Цикл
		ИмяПоля = ГруппировочноеПоле.Ключ;
		ЗначениеПоля = ГруппировочноеПоле.Значение;
		Если Выборка[ИмяПоля] <> ЗначениеПоля Тогда 
			ЕстьИзменения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Функция ПолучитьПараметрыСозданияПоВидуЗаказа(ВидДокумента)
	
	ПараметрыСозданияЗаказов = Новый Структура;
	ПараметрыСозданияЗаказов.Вставить("ВидДокумента", ВидДокумента);
	
	ВидДокументаЗаказПокупателю = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяВидаЗаказаПокупателя();
	Если ВидДокумента = ВидДокументаЗаказПокупателю Тогда		
		ПараметрыСозданияЗаказов.Вставить("ИмяФормы", "Документ.ЗаказПокупателя.Форма.ФормаДокумента");
		ПараметрыСозданияЗаказов.Вставить("ИмяТабличнойЧасти", "Запасы");
		ВидЗаказа = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыЗаказовПокупателей.Основной");
		ПараметрыСозданияЗаказов.Вставить("ВидЗаказа", ВидЗаказа);
		ВидОперации = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу");
		ПараметрыСозданияЗаказов.Вставить("ВидОперации", ВидОперации);
		ПараметрыСозданияЗаказов.Вставить("ИмяРеквизитаСтруктурнойЕдиницы", "СтруктурнаяЕдиницаПродажи");
		ВидЭлемента = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход");
		ПараметрыСозданияЗаказов.Вставить("ВидЭлемента", ВидЭлемента);
		ИсточникПлана = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.Объемы");
		ПараметрыСозданияЗаказов.Вставить("ИсточникПлана", ИсточникПлана);
		ВидОбъема = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЭлементаОбъемов.Доход");
		ПараметрыСозданияЗаказов.Вставить("ВидОбъема", ВидОбъема);
		ПоложениеДатыОтгрузки = 
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
		ПараметрыСозданияЗаказов.Вставить("ПоложениеДатыОтгрузки", ПоложениеДатыОтгрузки);
	Иначе		
		ПараметрыСозданияЗаказов.Вставить("ИмяФормы", "Документ.ЗаказПоставщику.Форма.ФормаДокумента");
		ПараметрыСозданияЗаказов.Вставить("ИмяТабличнойЧасти", "Запасы");
		ВидОперации = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ВидыОперацийЗаказПоставщику.ЗаказНаЗакупку");
		ПараметрыСозданияЗаказов.Вставить("ВидОперации", ВидОперации);
		ПараметрыСозданияЗаказов.Вставить("ИмяРеквизитаСтруктурнойЕдиницы", "СтруктурнаяЕдиница");
		ВидЭлемента = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход");
		ПараметрыСозданияЗаказов.Вставить("ВидЭлемента", ВидЭлемента);
		ИсточникПлана = 
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты");
		ПараметрыСозданияЗаказов.Вставить("ИсточникПлана", ИсточникПлана);
		ВидОбъема = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЭлементаОбъемов.Расход");
		ПараметрыСозданияЗаказов.Вставить("ВидОбъема", ВидОбъема);
		ПоложениеДатыПоступления = 
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
		ПараметрыСозданияЗаказов.Вставить("ПоложениеДатыПоступления", ПоложениеДатыПоступления);
	КонецЕсли;	
	
	Возврат ПараметрыСозданияЗаказов;
	
КонецФункции

Функция ПолучитьДанныеЗаказовИзВыборки(ПакетРезультатов, ПроектнаяЗадача, ПараметрыСозданияЗаказов)
	
	СрокиПЗ = упоПроектыИЗадачиСервер.ПолучитьСрокиПроектнойЗадачи(ПроектнаяЗадача);
	ДатаНачалаПЗ = СрокиПЗ.ДатаНачалаПлан;
	
	ВидСтавкиНДСПоУмолчанию = ПараметрыСозданияЗаказов.ВидСтавкиНДСПоУмолчанию;
	ДанныеЗаказов = Новый Массив;
	ГруппировочныеПоля = Новый Структура("Контрагент, Договор");
	ПоляТЧЗапасов = "Номенклатура, ДатаНачисления, ЕдиницаИзмерения, Количество, Цена, СтавкаНДС";
	
	ВыборкаОсновныеДанные = ПакетРезультатов[ПакетРезультатов.ВГраница()-1].Выбрать();
	
	// Последний элемент пакета результатов запроса содержит данные по данным Платежного календаря.
	ТЗПлатежныйКалендарь = ПакетРезультатов[ПакетРезультатов.ВГраница()].Выгрузить();
	ПоляТЗПлатежныйКалендарь = "СуммаОплаты, ДатаОплаты";
	
	Пока ВыборкаОсновныеДанные.Следующий() Цикл
		НовыйЗаказ = ОпределитьИзменениеГруппировочныхПолей(ГруппировочныеПоля, ВыборкаОсновныеДанные);
		Если НовыйЗаказ Тогда
			ЗаполнитьЗначенияСвойств(ГруппировочныеПоля, ВыборкаОсновныеДанные);
			Заказ = Новый Структура("ШапкаЗаказа, ТабличнаяЧасть");
			ШапкаЗаказа = ОбщегоНазначения.СкопироватьРекурсивно(ГруппировочныеПоля);
			Заказ.ШапкаЗаказа = ШапкаЗаказа;
			ТабличнаяЧасть = Новый Массив;
			Заказ.ТабличнаяЧасть = ТабличнаяЧасть;
			
			// Платежный календарь.
			ТЧПлатежныйКалендарь = Новый Массив;
			СтрокаТЧ = Новый Структура (ПоляТЗПлатежныйКалендарь);
			ПараметрыОтбора = Новый Структура("Контрагент, Договор");
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ВыборкаОсновныеДанные);
			НайденныеСтроки = ТЗПлатежныйКалендарь.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаТЗ из НайденныеСтроки Цикл
				НоваяСтрокаТЧ = Новый Структура(ПоляТЗПлатежныйКалендарь);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТЗ);
				ТЧПлатежныйКалендарь.Добавить(НоваяСтрокаТЧ);
			КонецЦикла;	
			Заказ.Вставить("ПлатежныйКалендарь", ТЧПлатежныйКалендарь);
			
			ДанныеЗаказов.Добавить(Заказ);
			
		КонецЕсли;
		
		СтрокаЗапасов = ПолучитьСтрокуЗапасов(ВыборкаОсновныеДанные, ПоляТЧЗапасов, ВидСтавкиНДСПоУмолчанию);
		
		Если Не ЗначениеЗаполнено(СтрокаЗапасов.ДатаНачисления) Тогда
			СтрокаЗапасов.ДатаНачисления = ДатаНачалаПЗ;	
		КонецЕсли;
		
		ТабличнаяЧасть.Добавить(СтрокаЗапасов);
		
	КонецЦикла;
	
	Возврат ДанныеЗаказов;	
	
КонецФункции	

Функция ПолучитьСтрокуЗапасов(Выборка, ПоляТЧЗапасов, ВидСтавкиНДСПоУмолчанию)
	
	СтрокаЗапасов = Новый Структура(ПоляТЧЗапасов);
	ЗаполнитьЗначенияСвойств(СтрокаЗапасов, Выборка);
	СтрокаЗапасов.Цена = 0;
	Если Выборка.Количество <> 0 Тогда
		СтрокаЗапасов.Цена = Выборка.Сумма / Выборка.Количество;
	КонецЕсли;
	
	МенеджерСтавкиНДС = ОбщегоНазначения.ОбщийМодуль("Справочники.СтавкиНДС");
	
	ДатаОбработки = ТекущаяДатаСеанса();
	Если ЗначениеЗаполнено(СтрокаЗапасов.Номенклатура.ВидСтавкиНДС) Тогда
		СтрокаЗапасов.СтавкаНДС = МенеджерСтавкиНДС.СтавкаНДС(СтрокаЗапасов.Номенклатура.ВидСтавкиНДС, ДатаОбработки);
	Иначе
		СтрокаЗапасов.СтавкаНДС = МенеджерСтавкиНДС.СтавкаНДС(ВидСтавкиНДСПоУмолчанию, ДатаОбработки);
	КонецЕсли;
	
	Возврат СтрокаЗапасов;
	
КонецФункции

Функция ПолучитьДанныеИзПроектнойЗадачи(ПроектнаяЗадача, ПараметрыСозданияЗаказов)
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДанныхПЗ(ПараметрыСозданияЗаказов);	
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ВидЭлемента", ПараметрыСозданияЗаказов.ВидЭлемента);
	Запрос.УстановитьПараметр("ИсточникПлана", ПараметрыСозданияЗаказов.ИсточникПлана);
	Запрос.УстановитьПараметр("ВидОбъема", ПараметрыСозданияЗаказов.ВидОбъема);
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	Запрос.УстановитьПараметр("РасходыПоОбъемам", СвойстваПроекта.РасходыПоОбъемам);
	Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);

	ПакетРезультатов = Запрос.ВыполнитьПакет();


	Возврат ПакетРезультатов;
	
КонецФункции

Функция ПолучитьСвойствоВедетсяБюджетДвиженияДенежныхСредств(ПроектнаяЗадача) Экспорт
 	
	СвойствоВедетсяБюджетДвиженияДенежныхСредств = Истина;

	Если ТипЗнч(ПроектнаяЗадача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Проект = ПроектнаяЗадача.Проект;
	ИначеЕсли ТипЗнч(ПроектнаяЗадача) = Тип("СправочникСсылка.Проекты") Тогда
		КорневойПроект = ПроектнаяЗадача.упоКорневойПроект;
		
		Если ЗначениеЗаполнено(КорневойПроект) Тогда
			Проект = КорневойПроект;	
		Иначе
			Проект = ПроектнаяЗадача;		
		КонецЕсли;   
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляПолученияСвойстваВедетсяБюджетДвиженияДенежныхСредств();	  	
	Запрос.УстановитьПараметр("Проект", Проект);  
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СвойствоВедетсяБюджетДвиженияДенежныхСредств;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		СвойствоВедетсяБюджетДвиженияДенежныхСредств = Выборка.ВедетсяБюджетДвиженияДенежныхСредств;		
		Прервать;
	КонецЦикла;
	
	Возврат	СвойствоВедетсяБюджетДвиженияДенежныхСредств;

КонецФункции  

Функция ПолучитьСтруктурнуюЕдиницуПоВидуДокумента(Проект, ПараметрыСозданияЗаказов)
	
	ЗначенияПоУмолчаниюПроекта =
		упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);	
		
	ВидДокумента = ПараметрыСозданияЗаказов.ВидДокумента;
	ВидДокументаЗаказПокупателю = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяВидаЗаказаПокупателя();
	Если ВидДокумента = ВидДокументаЗаказПокупателю Тогда
		Подразделение = ЗначенияПоУмолчаниюПроекта.ПодразделениеДоходовПоУмолчанию;	
	Иначе
		Подразделение = ЗначенияПоУмолчаниюПроекта.ПодразделениеРасходовПоУмолчанию;	
	КонецЕсли;
		
	СтруктурнаяЕдиница = упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСтруктурыИлиПодразделения(Подразделение);
								
	Возврат СтруктурнаяЕдиница;
	
КонецФункции

Функция ПолучитьТекстЗапросаДанныхПЗДляЗаказаПокупателя()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент КАК Контрагент,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор КАК Договор,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура КАК Номенклатура,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) КАК Сумма,
	|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество) КАК Количество
	|ПОМЕСТИТЬ АктуальныеПланыДоходовИРасходов
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И ПроектнаяЗадача = &ПроектнаяЗадача
	|				И ВидЭлемента = &ВидЭлемента
	|				И ИсточникПлана = &ИсточникПлана) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления
	|
	|ИМЕЮЩИЕ
	|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) <> 0 И
	|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(АктуальныеПланыДоходовИРасходов.Контрагент) <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСтроки
	|ПОМЕСТИТЬ ЕстьСтрокиАктуальныхПлановДР
	|ИЗ
	|	АктуальныеПланыДоходовИРасходов КАК АктуальныеПланыДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент КАК Контрагент,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор КАК Договор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура КАК Номенклатура,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК Сумма,
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК Количество
	|ПОМЕСТИТЬ АктуальныеПланыВыполненияОбъемов
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И ПроектнаяЗадача = &ПроектнаяЗадача
	|				И ВидОбъема = &ВидОбъема
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						т.ЕстьСтроки
	|					ИЗ
	|						ЕстьСтрокиАктуальныхПлановДР КАК т)) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) <> 0 И
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеПланыДоходовИРасходов.Контрагент КАК Контрагент,
	|	АктуальныеПланыДоходовИРасходов.Договор КАК Договор,
	|	АктуальныеПланыДоходовИРасходов.ДатаНачисления КАК ДатаНачисления,
	|	АктуальныеПланыДоходовИРасходов.Номенклатура КАК Номенклатура,
	|	АктуальныеПланыДоходовИРасходов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АктуальныеПланыДоходовИРасходов.Сумма КАК Сумма,
	|	АктуальныеПланыДоходовИРасходов.Количество КАК Количество
	|ПОМЕСТИТЬ ОсновныеДанные
	|ИЗ
	|	АктуальныеПланыДоходовИРасходов КАК АктуальныеПланыДоходовИРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктуальныеПланыВыполненияОбъемов.Контрагент,
	|	АктуальныеПланыВыполненияОбъемов.Договор,
	|	АктуальныеПланыВыполненияОбъемов.ДатаНачисления,
	|	АктуальныеПланыВыполненияОбъемов.Номенклатура,
	|	АктуальныеПланыВыполненияОбъемов.ЕдиницаИзмерения,
	|	АктуальныеПланыВыполненияОбъемов.Сумма,
	|	АктуальныеПланыВыполненияОбъемов.Количество
	|ИЗ
	|	АктуальныеПланыВыполненияОбъемов КАК АктуальныеПланыВыполненияОбъемов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеДанные.Контрагент КАК Контрагент,
	|	ОсновныеДанные.Договор КАК Договор,
	|	ОсновныеДанные.ДатаНачисления КАК ДатаНачисления,
	|	ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.КлассификаторЕдИзм КАК ЕдиницаИзмерения,
	|	ОсновныеДанные.Сумма КАК Сумма,
	|	ОсновныеДанные.Количество КАК Количество
	|ИЗ
	|	ОсновныеДанные КАК ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм КАК упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм
	|		ПО ОсновныеДанные.ЕдиницаИзмерения = упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.Упаковка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма КАК СуммаОплаты,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения КАК ДатаОплаты,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент КАК Контрагент,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И Договор В
	|					(ВЫБРАТЬ
	|						ОсновныеДанные.Договор
	|					ИЗ
	|						ОсновныеДанные)
	|				И Контрагент В
	|					(ВЫБРАТЬ
	|						ОсновныеДанные.Контрагент КАК Контрагент
	|					ИЗ
	|						ОсновныеДанные КАК ОсновныеДанные)
	|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление)
	|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
	|ГДЕ
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДанныхПЗДляЗаказаПоставщику()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьМатРесурсыВПланРасходов КАК Результат
	|ПОМЕСТИТЬ ВключитьМатРесурсыВПланРасходов
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент КАК Контрагент,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор КАК Договор,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура КАК Номенклатура,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество = 0
	|				ТОГДА упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Количество
	|			ИНАЧЕ упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ АктуальныеПланыДоходовИРасходов
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И ПроектнаяЗадача = &ПроектнаяЗадача
	|				И ВидЭлемента = &ВидЭлемента
	|				И ИсточникПлана = &ИсточникПлана
	|				И ИСТИНА В
	|					(ВЫБРАТЬ
	|						ВключитьМатРесурсыВПланРасходов.Результат
	|					ИЗ
	|						ВключитьМатРесурсыВПланРасходов)) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыЗатратМатериальныхРесурсов.СрезПоследних(
	|				,
	|				Версия = &ТекВерсия
	|					И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних
	|		ПО упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура = упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Ресурс
	|
	|СГРУППИРОВАТЬ ПО
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления
	|
	|ИМЕЮЩИЕ
	|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) <> 0 И
	|	СУММА(ВЫБОР
	|			КОГДА упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество = 0
	|				ТОГДА упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Количество
	|			ИНАЧЕ упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество
	|		КОНЕЦ) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(АктуальныеПланыДоходовИРасходов.Контрагент) <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСтроки
	|ПОМЕСТИТЬ ЕстьСтрокиАктуальныхПлановДР
	|ИЗ
	|	АктуальныеПланыДоходовИРасходов КАК АктуальныеПланыДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент КАК Контрагент,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор КАК Договор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура КАК Номенклатура,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК Сумма,
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК Количество
	|ПОМЕСТИТЬ АктуальныеПланыВыполненияОбъемов
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И ПроектнаяЗадача = &ПроектнаяЗадача
	|				И ВидОбъема = &ВидОбъема
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						т.ЕстьСтроки
	|					ИЗ
	|						ЕстьСтрокиАктуальныхПлановДР КАК т)
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						ВключитьМатРесурсыВПланРасходов.Результат
	|					ИЗ
	|						ВключитьМатРесурсыВПланРасходов)
	|				И &РасходыПоНатуральнымПоказателям) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) <> 0 И
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(АктуальныеПланыВыполненияОбъемов.Контрагент) <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСтроки
	|ПОМЕСТИТЬ ЕстьСтрокиАктуальныхПлановОбъемов
	|ИЗ
	|	АктуальныеПланыВыполненияОбъемов КАК АктуальныеПланыВыполненияОбъемов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Контрагент КАК Контрагент,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Договор КАК Договор,
	|	ЕСТЬNULL(ДанныеПлановПотребностейМатериальныхРесурсов.ДатаЗаказа, упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления) КАК ДатаНачисления,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Номенклатура КАК Номенклатура,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ДанныеПлановПотребностейМатериальныхРесурсов.Сумма) КАК Сумма,
	|	СУММА(ДанныеПлановПотребностейМатериальныхРесурсов.Количество) КАК Количество
	|ПОМЕСТИТЬ ДанныеПлановПотребностейМатериальныхРесурсов
	|ИЗ
	|	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И ПроектнаяЗадача = &ПроектнаяЗадача
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						т.ЕстьСтроки
	|					ИЗ
	|						ЕстьСтрокиАктуальныхПлановОбъемов КАК т)
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						т.ЕстьСтроки
	|					ИЗ
	|						ЕстьСтрокиАктуальныхПлановДР КАК т)) КАК ДанныеПлановПотребностейМатериальныхРесурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
	|				,
	|				Версия = &ТекВерсия
	|					И ПроектнаяЗадача = &ПроектнаяЗадача
	|					И ВидОбъема = &ВидОбъема) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	|		ПО (ИСТИНА В
	|				(ВЫБРАТЬ
	|					ВключитьМатРесурсыВПланРасходов.Результат
	|				ИЗ
	|					ВключитьМатРесурсыВПланРасходов))
	|			И ДанныеПлановПотребностейМатериальныхРесурсов.Контрагент = упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент
	|			И ДанныеПлановПотребностейМатериальныхРесурсов.Договор = упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор
	|			И ДанныеПлановПотребностейМатериальныхРесурсов.Номенклатура = упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура
	|			И ДанныеПлановПотребностейМатериальныхРесурсов.ЕдиницаИзмерения = упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения
	|			И ДанныеПлановПотребностейМатериальныхРесурсов.ДатаЗаказа <> упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Контрагент,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Договор,
	|	ЕСТЬNULL(ДанныеПлановПотребностейМатериальныхРесурсов.ДатаЗаказа, упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления),
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Номенклатура,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеПлановПотребностейМатериальныхРесурсов.Сумма) <> 0 И
	|	СУММА(ДанныеПлановПотребностейМатериальныхРесурсов.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(ДанныеПлановПотребностейМатериальныхРесурсов.Контрагент) <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСтроки
	|ПОМЕСТИТЬ ЕстьСтрокиДанныхПлановПотребностейМатериальныхРесурсов
	|ИЗ
	|	ДанныеПлановПотребностейМатериальныхРесурсов КАК ДанныеПлановПотребностейМатериальныхРесурсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Ресурс КАК Номенклатура,
	|	упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.ЕдиницаНормирования КАК ЕдиницаИзмерения,
	|	СУММА(упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Стоимость) КАК Сумма,
	|	СУММА(упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Количество) КАК Количество
	|ПОМЕСТИТЬ АктуальныеПланыЗатратМатериальныхРесурсов
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыЗатратМатериальныхРесурсов.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И ПроектнаяЗадача = &ПроектнаяЗадача
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						т.ЕстьСтроки
	|					ИЗ
	|						ЕстьСтрокиАктуальныхПлановДР КАК т)
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						т.ЕстьСтроки
	|					ИЗ
	|						ЕстьСтрокиАктуальныхПлановОбъемов КАК т)
	|				И ЛОЖЬ В
	|					(ВЫБРАТЬ
	|						т.ЕстьСтроки
	|					ИЗ
	|						ЕстьСтрокиДанныхПлановПотребностейМатериальныхРесурсов КАК т)) КАК упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Ресурс,
	|	упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.ЕдиницаНормирования
	|
	|ИМЕЮЩИЕ
	|	СУММА(упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Стоимость) <> 0 И
	|	СУММА(упоАктуальныеПланыЗатратМатериальныхРесурсовСрезПоследних.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеПланыДоходовИРасходов.Контрагент КАК Контрагент,
	|	АктуальныеПланыДоходовИРасходов.Договор КАК Договор,
	|	АктуальныеПланыДоходовИРасходов.ДатаНачисления КАК ДатаНачисления,
	|	АктуальныеПланыДоходовИРасходов.Номенклатура КАК Номенклатура,
	|	АктуальныеПланыДоходовИРасходов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АктуальныеПланыДоходовИРасходов.Сумма КАК Сумма,
	|	АктуальныеПланыДоходовИРасходов.Количество КАК Количество
	|ПОМЕСТИТЬ ОсновныеДанные
	|ИЗ
	|	АктуальныеПланыДоходовИРасходов КАК АктуальныеПланыДоходовИРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктуальныеПланыВыполненияОбъемов.Контрагент,
	|	АктуальныеПланыВыполненияОбъемов.Договор,
	|	АктуальныеПланыВыполненияОбъемов.ДатаНачисления,
	|	АктуальныеПланыВыполненияОбъемов.Номенклатура,
	|	АктуальныеПланыВыполненияОбъемов.ЕдиницаИзмерения,
	|	АктуальныеПланыВыполненияОбъемов.Сумма,
	|	АктуальныеПланыВыполненияОбъемов.Количество
	|ИЗ
	|	АктуальныеПланыВыполненияОбъемов КАК АктуальныеПланыВыполненияОбъемов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Контрагент,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Договор,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.ДатаНачисления,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Номенклатура,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.ЕдиницаИзмерения,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Сумма,
	|	ДанныеПлановПотребностейМатериальныхРесурсов.Количество
	|ИЗ
	|	ДанныеПлановПотребностейМатериальныхРесурсов КАК ДанныеПлановПотребностейМатериальныхРесурсов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	АктуальныеПланыЗатратМатериальныхРесурсов.Номенклатура,
	|	АктуальныеПланыЗатратМатериальныхРесурсов.ЕдиницаИзмерения,
	|	АктуальныеПланыЗатратМатериальныхРесурсов.Сумма,
	|	АктуальныеПланыЗатратМатериальныхРесурсов.Количество
	|ИЗ
	|	АктуальныеПланыЗатратМатериальныхРесурсов КАК АктуальныеПланыЗатратМатериальныхРесурсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеДанные.Контрагент КАК Контрагент,
	|	ОсновныеДанные.Договор КАК Договор,
	|	ОсновныеДанные.ДатаНачисления КАК ДатаНачисления,
	|	ОсновныеДанные.Номенклатура КАК Номенклатура,
	|	упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.КлассификаторЕдИзм КАК ЕдиницаИзмерения,
	|	ОсновныеДанные.Сумма КАК Сумма,
	|	ОсновныеДанные.Количество КАК Количество
	|ИЗ
	|	ОсновныеДанные КАК ОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм КАК упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм
	|		ПО ОсновныеДанные.ЕдиницаИзмерения = упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.Упаковка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма КАК СуммаОплаты,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения КАК ДатаОплаты,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент КАК Контрагент,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
	|			,
	|			Версия = &ТекВерсия
	|				И Договор В
	|					(ВЫБРАТЬ
	|						ОсновныеДанные.Договор
	|					ИЗ
	|						ОсновныеДанные)
	|				И Контрагент В
	|					(ВЫБРАТЬ
	|						ОсновныеДанные.Контрагент КАК Контрагент
	|					ИЗ
	|						ОсновныеДанные КАК ОсновныеДанные)
	|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата)
	|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
	|ГДЕ
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДанныхПЗ(ПараметрыСозданияЗаказов)
	
	ВидДокумента = ПараметрыСозданияЗаказов.ВидДокумента;
	
	ВидДокументаЗаказПокупателя = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяВидаЗаказаПокупателя();
	Если ВидДокумента = ВидДокументаЗаказПокупателя Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаДанныхПЗДляЗаказаПокупателя();
	Иначе
		ТекстЗапроса = ПолучитьТекстЗапросаДанныхПЗДляЗаказаПоставщику();	
	КонецЕсли;
			
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляПолученияСвойстваВедетсяБюджетДвиженияДенежныхСредств()

	ТекстЗапроса = 	"ВЫБРАТЬ
					|	упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетДвиженияДенежныхСредств КАК ВедетсяБюджетДвиженияДенежныхСредств
					|ИЗ
					|	РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК упоНастройкаАналитикиВРазрезеПодразделений
					|ГДЕ
					|	упоНастройкаАналитикиВРазрезеПодразделений.Объект = &Проект";  
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Процедура ПроверитьВозможностьПолученияДанныхДляЗаказаПокупателя(Проект, ПараметрыСозданияЗаказов)
	
	ВидДокументаЗаказПокупателя = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяВидаЗаказаПокупателя();
	Если ПараметрыСозданияЗаказов.ВидДокумента <> ВидДокументаЗаказПокупателя Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураНастроек = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);	
	
	Если СтруктураНастроек.ДоходыПоНатуральнымПоказателям Тогда
		Возврат;
	КонецЕсли;
	
	ТекстИсключения = 
		НСтр("ru = 'Для создания заказа покупателя необходимо в паспорте проекта включить опцию ""Доходы по натуральным показателям""'");
		
	ВызватьИсключение ТекстИсключения;	
		
КонецПроцедуры

// Удаляет незаполненные значения из структуры заполнения.
//
// Параметры:
//  СтруктураЗаполнения	 - Структура - данные заполнения.
//
Процедура УдалитьНезаполненныеЗначенияИзСтруктурыЗаполнения(СтруктураЗаполнения)
		
	ПараметрыКУдалению = Новый Массив;
	Для Каждого КлючЗначение Из СтруктураЗаполнения Цикл
		Если Не ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
			ПараметрыКУдалению.Добавить(КлючЗначение.Ключ);
		КонецЕсли;	
	КонецЦикла;	

	Для Каждого ПараметрКУдалению Из ПараметрыКУдалению Цикл
		СтруктураЗаполнения.Удалить(ПараметрКУдалению);		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СинхронизацияЕдиницИзмерения

Процедура ИзменитьЭлементы_КлассификаторЕдиницИзмерения_ФормаВыбора(Форма, Отказ)

	ИмяРеквизита = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяРеквизитаДляОпределенияВыбораУпаковки();
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Булево"));	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если Форма.Параметры.Свойство(ИмяРеквизита) Тогда
		
		// Установим действие выбор у элемента "Список".
		Элементы = Форма.Элементы;
		ЭлементСписок = Элементы.Найти("Список");
		
		Если ЭлементСписок <> Неопределено Тогда
			ЭлементСписок.УстановитьДействие("ВыборЗначения", "Подключаемый_упоСписокВыборЗначения");
			Форма[ИмяРеквизита] = Истина;
		КонецЕсли;
	
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

Процедура ДобавитьЭлементы_НачислениеЗарплаты_ФормаДокумента(Форма, Отказ)
	
	Родитель = Форма.Элементы.Найти("СтраховыеВзносыГруппаЗатраты");
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТипПолеФормы = Тип("ПолеФормы");
	
	// Добавление поля "Проектная задача".
	Элемент_упоПроектнаяЗадача = Форма.Элементы.Добавить("упоСтраховыеВзносыПроектнаяЗадача",
			ТипПолеФормы,
			Родитель);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.КнопкаВыбора = Истина;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Взносы.упоПроектнаяЗадача";
	
	// Добавление поля "Проект".
	Элемент_упоПроект = Форма.Элементы.Добавить("упоСтраховыеВзносыПроект",
			ТипПолеФормы,
			Родитель);
	Элемент_упоПроект.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент_упоПроект.ПутьКДанным = "Объект.Взносы.упоПроектнаяЗадача.упоКорневойПроект";
	Элемент_упоПроект.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	// Типовому полю "Аналитика-Направление деятельности" наздначаем обработчик события
	// "ПриИзменении", для автоматического заполнения ПЗ, связанной с выбранным Направлением деятельности.
	Элемент_СтраховыеВзносыНаправлениеДеятельности = Форма.Элементы.Найти("СтраховыеВзносыНаправлениеДеятельности");
	
	Если Элемент_СтраховыеВзносыНаправлениеДеятельности <> Неопределено Тогда 
		Элемент_СтраховыеВзносыНаправлениеДеятельности.УстановитьДействие("ПриИзменении", 
			"Подключаемый_упоСтраховыеВзносыНаправлениеДеятельностиПриИзменении");
	КонецЕсли;	

КонецПроцедуры	

Процедура ИзменитьЭлементы_Проекты_упоФормаЭлементаУправляемая(Форма, Отказ)
	
	ЭлементыФормы = Форма.Элементы;
	
	ДобавитьПодсказкуДляСвойстваВедетсяБюджетДвиженияДенежныхСредств(Форма, Отказ);
	
	СкрытьКомандыСозданияЗаданияНаПланированиеНаПрогноз(ЭлементыФормы);
		
КонецПроцедуры

Процедура ИзменитьЭлементы_Проекты_упоФормаСпискаУправляемая(Форма, Отказ)

	ЭлементыФормы = Форма.Элементы;
	
	СкрытьКомандыСозданияЗаданияНаПланированиеНаПрогноз(ЭлементыФормы);
	
КонецПроцедуры

Процедура ИзменитьЭлементы_упоПроектнаяЗадача_ФормаСпискаУправляемая(Форма, Отказ)

	ЭлементыФормы = Форма.Элементы;
	
	СкрытьКомандыСозданияЗаданияНаПланированиеНаПрогноз(ЭлементыФормы);

	
КонецПроцедуры

Процедура ИзменитьЭлементы_упоПроектнаяЗадача_ФормаДокументаУправляемая(Форма, Отказ)

	ЭлементыФормы = Форма.Элементы;

	СкрытьКомандыСозданияЗаданияНаПланированиеНаПрогноз(ЭлементыФормы);
	
КонецПроцедуры    

Процедура ИзменитьЭлементы_упоЗадания_ФормаЭлемента(Форма, Отказ)

	ЭлементыФормы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, 
		"ГруппаЗаданиеПодразделению", 
		"Видимость",
		Ложь);

	
КонецПроцедуры

Процедура ИзменитьЭлементы_ОбщаяФорма_упоНастройкаПараметровPM(Форма, Отказ)
	
	ДобавитьПодсказкуДляСвойстваВедетсяБюджетДвиженияДенежныхСредств(Форма, Отказ);
	
КонецПроцедуры

Процедура ДобавитьПодсказкуДляСвойстваВедетсяБюджетДвиженияДенежныхСредств(Форма, Отказ)
	
	ВедетсяБюджетДвиженияДенежныхСредств = Неопределено;
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("упоВедетсяБюджетДвиженияДенежныхСредств") <> Неопределено Тогда
		ВедетсяБюджетДвиженияДенежныхСредств = Элементы.упоВедетсяБюджетДвиженияДенежныхСредств;
	ИначеЕсли Элементы.Найти("ВедетсяБюджетДвиженияДенежныхСредств") <> Неопределено Тогда
		ВедетсяБюджетДвиженияДенежныхСредств = Элементы.ВедетсяБюджетДвиженияДенежныхСредств;
	КонецЕсли;

	Если ВедетсяБюджетДвиженияДенежныхСредств = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекстПодсказки = нСтр("ru='Рекомендуется включить опцию ""Платежный календарь"" в подсистеме ""Деньги"" в настройках УНФ'", "ru");
	
	ВедетсяБюджетДвиженияДенежныхСредств.Подсказка 				= ТекстПодсказки;
	ВедетсяБюджетДвиженияДенежныхСредств.ОтображениеПодсказки 	= ОтображениеПодсказки.Кнопка;
	
КонецПроцедуры 

#Область ПолучениеДанныхРаспределенияЗарплаты

Процедура ЗаполнитьПараметрыЗапроса(Запрос, ДанныеДокумента)

	ПериодРегистрации = ДанныеДокумента.ПериодРегистрации;
	НачалоПериода = НачалоМесяца(ПериодРегистрации);
	ОкончаниеПериода = КонецДня(КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	СотрудникиИзТЧ = ПолучитьСотрудниковИзДанныхТабличнойЧасти(ДанныеДокумента);
	Запрос.УстановитьПараметр("Сотрудники", СотрудникиИзТЧ);
	СтруктурнаяЕдиница = ДанныеДокумента.СтруктурнаяЕдиница;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);	
	Запрос.УстановитьПараметр("УровеньПланированияОкончательный", Перечисления.упоУровеньПланирования.Окончательный);
	
КонецПроцедуры	

Процедура ИсправитьСуммуВРаспределенииПослеОкругления(РаспределениеПоПропорции, ОбщаяСумма)
	
	Если РаспределениеПоПропорции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммаСтрокРаспределения = 0;
	Для Каждого	СтрокаРаспределения Из РаспределениеПоПропорции Цикл		
		СуммаСтрокРаспределения = СуммаСтрокРаспределения + СтрокаРаспределения.Сумма;		
	КонецЦикла;
	
	Если СуммаСтрокРаспределения = ОбщаяСумма Тогда
		Возврат;
	КонецЕсли;
	
	Отклонение = ОбщаяСумма - СуммаСтрокРаспределения;
	
	ИндексПоследнегоЭлемента = РаспределениеПоПропорции.ВГраница();
	ПоследниеЭлементРаспределения = РаспределениеПоПропорции[ИндексПоследнегоЭлемента];
	ПоследниеЭлементРаспределения.Сумма = ПоследниеЭлементРаспределения.Сумма + Отклонение;
	
КонецПроцедуры

Функция ПолучитьДанныеТабЧастиСУчетомРаспределения(ДанныеДокумента, Распределение)
		
	НачисленияУдержания = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(ДанныеДокумента.ДанныеТЧНачисленияУдержания);
	
	ИменаПолей = упоИнтеграцияУПФКлиентСервер.ПолучитьИменаРеквизитовДляРаспределенияСуммыЗарплатыПоФактуТрудозатрат();
	
	Для Каждого Строка Из НачисленияУдержания Цикл
		
		Отбор = Новый Структура("Сотрудник", Строка.Сотрудник);
		СтрокиРаспределения = Распределение.НайтиСтроки(Отбор);
		РаспределениеПоПропорции = Новый Массив;
		ОбщаяСумма = Строка.Сумма;
		Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
			СтрокаНачисления = Новый Структура(ИменаПолей);
			ЗаполнитьЗначенияСвойств(СтрокаНачисления, СтрокаРаспределения);
			ПропорциональнаяСумма = ОбщаяСумма * СтрокаРаспределения.Пропорция;
			СтрокаНачисления.Сумма = Окр(ПропорциональнаяСумма, 2);
			РаспределениеПоПропорции.Добавить(СтрокаНачисления);
		КонецЦикла;
		
		ИсправитьСуммуВРаспределенииПослеОкругления(РаспределениеПоПропорции, ОбщаяСумма);
		
		Строка.Вставить("Распределение", РаспределениеПоПропорции);
		
	КонецЦикла;
	
	Возврат НачисленияУдержания;
	
КонецФункции

Функция ПолучитьПропорциюРаспределенияПоТрудозатратам(ДанныеДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляПолученияПропорцииТрудозатрат();	
	ЗаполнитьПараметрыЗапроса(Запрос, ДанныеДокумента);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Распределение = РезультатЗапроса.Выгрузить();
	
	Возврат Распределение;
	
КонецФункции

Функция ПолучитьСотрудниковИзДанныхТабличнойЧасти(ДанныеДокумента)
	
	СотрудникиИзТЧ = Новый Массив;
	Для Каждого Строка Из ДанныеДокумента.ДанныеТЧНачисленияУдержания Цикл
		СотрудникиИзТЧ.Добавить(Строка.Сотрудник);			
	КонецЦикла;
	
	Возврат СотрудникиИзТЧ;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляПолученияПропорцииТрудозатрат()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	упоСоответствиеСотрудниковИТрудовыхРесурсов.ТрудовойРесурс КАК ТрудовойРесурс
	|ПОМЕСТИТЬ ТрудовыеРесурсыСотрудников
	|ИЗ
	|	РегистрСведений.упоСоответствиеСотрудниковИТрудовыхРесурсов КАК упоСоответствиеСотрудниковИТрудовыхРесурсов
	|ГДЕ
	|	упоСоответствиеСотрудниковИТрудовыхРесурсов.Сотрудник В(&Сотрудники)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСоответствиеПодразделенийИСтруктурыПредприятия.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ПодразделенияСтруктурнойЕдиницы
	|ИЗ
	|	РегистрСведений.упоСоответствиеПодразделенийИСтруктурыПредприятия КАК упоСоответствиеПодразделенийИСтруктурыПредприятия
	|ГДЕ
	|	упоСоответствиеПодразделенийИСтруктурыПредприятия.СтруктураПредприятия = &СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСоставПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	упоСоставПодразделенийСрезПоследних.Роль КАК Роль
	|ПОМЕСТИТЬ РолиПодразделения
	|ИЗ
	|	РегистрСведений.упоСоставПодразделений.СрезПоследних(
	|			,
	|			Подразделение В
	|				(ВЫБРАТЬ
	|					ПодразделенияСтруктурнойЕдиницы.Подразделение
	|				ИЗ
	|					ПодразделенияСтруктурнойЕдиницы)) КАК упоСоставПодразделенийСрезПоследних
	|ГДЕ
	|	упоСоставПодразделенийСрезПоследних.ВходитВСостав
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Роль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
	|	упоФактТрудозатратПоДням.Ресурс КАК Ресурс,
	|	СУММА(упоФактТрудозатратПоДням.Трудозатраты) КАК Трудозатраты
	|ПОМЕСТИТЬ ФактТрудозатрат
	|ИЗ
	|	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТрудовыеРесурсыСотрудников КАК ТрудовыеРесурсыСотрудников
	|		ПО упоФактТрудозатратПоДням.Ресурс = ТрудовыеРесурсыСотрудников.ТрудовойРесурс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РолиПодразделения КАК РолиПодразделения
	|		ПО упоФактТрудозатратПоДням.Роль = РолиПодразделения.Роль
	|ГДЕ
	|	упоФактТрудозатратПоДням.День МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И упоФактТрудозатратПоДням.УровеньПланирования = &УровеньПланированияОкончательный
	|
	|СГРУППИРОВАТЬ ПО
	|	упоФактТрудозатратПоДням.Операция,
	|	упоФактТрудозатратПоДням.Ресурс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактТрудозатрат.Ресурс КАК Ресурс,
	|	СУММА(ФактТрудозатрат.Трудозатраты) КАК Трудозатраты
	|ПОМЕСТИТЬ ОбщаяСуммаПоТрудовымРесурсам
	|ИЗ
	|	ФактТрудозатрат КАК ФактТрудозатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактТрудозатрат.Ресурс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСоответствиеСотрудниковИТрудовыхРесурсов.Сотрудник КАК Сотрудник,
	|	упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиЭлемент КАК НаправлениеДеятельности,
	|	Проекты.Ссылка КАК Проект,
	|	ФактТрудозатрат.Трудозатраты / ОбщаяСуммаПоТрудовымРесурсам.Трудозатраты КАК Пропорция
	|ИЗ
	|	ФактТрудозатрат КАК ФактТрудозатрат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбщаяСуммаПоТрудовымРесурсам КАК ОбщаяСуммаПоТрудовымРесурсам
	|		ПО ФактТрудозатрат.Ресурс = ОбщаяСуммаПоТрудовымРесурсам.Ресурс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСотрудниковИТрудовыхРесурсов КАК упоСоответствиеСотрудниковИТрудовыхРесурсов
	|		ПО ФактТрудозатрат.Ресурс = упоСоответствиеСотрудниковИТрудовыхРесурсов.ТрудовойРесурс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО ФактТрудозатрат.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности
	|		ПО ФактТрудозатрат.ПроектнаяЗадача = упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлементПроектнаяЗадача";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

Процедура ДобавитьЭлементы_КонтактЦентр_Форма(Форма, Отказ)
	
	ИмяГруппыСоздать = "ГруппаСоздать";
	ГруппаСоздать = Форма.Элементы.Найти(ИмяГруппыСоздать);
	Если ГруппаСоздать = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	Заголовок = НСтр("ru = 'Задание'");
	
КонецПроцедуры 

Процедура СкрытьКомандыСозданияЗаданияНаПланированиеНаПрогноз(ЭлементыФормы)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, 
		"ФормаОбработкаупоРаботаСЗаданиямиЗаданияНаПланированиеОбъекта", 
		"Видимость",
		Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, 
		"ФормаОбработкаупоРаботаСЗаданиямиЗаданияНаПрогнозОбъекта", 
		"Видимость",
		Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаЗаполнения

// Заполняет реквизит "Проект" переданного объекта по данным документа-основания с учетом размещения
// реквизита либо в шапке, либо в таб. части как в Объекте, так и в ДанныхЗаполнения
//
// Параметры:
//	Объект - ДокументОбъект
//	ДанныеЗаполнения - ДокументСсылка
//
Процедура ЗаполнитьПроект(Объект, ДанныеЗаполнения) Экспорт
	
	// Для определенных типов заполняем реквизит
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упоПроектнаяЗадача")
		И ТипЗнч(Объект) = упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.Событие") Тогда
		Объект.Проект = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(ДанныеЗаполнения);
		Объект.ДокументОснование = ДанныеЗаполнения;
		Возврат;
	КонецЕсли;

	// У некоторых документов имя реквизита, хранящего проект, отличается от стандартного имени "Проект".
	ИмяРеквизитаПроектИсточника = "Проект";
	ИмяРеквизитаПроектПриемника = "Проект";
	
	ТипОбъекта = ТипЗнч(Объект);
	Если упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.ЗаказПоставщику") = ТипОбъекта Тогда 
		ИмяРеквизитаПроектПриемника = "упоПроектнаяЗадача";
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(ДанныеЗаполнения);
	Если упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.ЗаказПоставщику") = ТипИсточника Тогда
		ИмяРеквизитаПроектИсточника = "упоПроектнаяЗадача";
	КонецЕсли;	
	
	// Реквизит, хранящий проект, должен существовать и в приемнике и в источнике.
	УОбъектаЕстьПроект = 
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизитаПроектПриемника);
	УИсточникаЕстьПроект = ЗначениеЗаполнено(ДанныеЗаполнения)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, ИмяРеквизитаПроектИсточника);
	ТипПроектаОбъектаИИсточникаСовпадает = УОбъектаЕстьПроект И УИсточникаЕстьПроект
		И ЗначениеЗаполнено(ДанныеЗаполнения) И (ТипЗнч(Объект[ИмяРеквизитаПроектПриемника]) = ТипЗнч(ДанныеЗаполнения[ИмяРеквизитаПроектИсточника]));
	Если УОбъектаЕстьПроект = Ложь
		Или УИсточникаЕстьПроект = Ложь
		Или ТипПроектаОбъектаИИсточникаСовпадает = Ложь Тогда
		Возврат;
	КонецЕсли;
	// Для правильного заполнения некоторых объектов нужно, чтобы в источнике
	// для всех строк табличной части был указан одинаковый проект (когда проект расположен в таб. части источника).
	КонтрольУникальностиПроектаВТабЧасти = Ложь;
	
	ЭтимОбъектамНуженКонтрольУникальности = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.СчетНаОплату"));
	ЭтимОбъектамНуженКонтрольУникальности.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.ПоступлениеДСПлан"));
	ЭтимОбъектамНуженКонтрольУникальности.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.Событие")); 
	
	ЭтимИсточникамНуженКонтрольУникальности = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.АктВыполненныхРабот"));
	ЭтимИсточникамНуженКонтрольУникальности.Добавить(
		упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.РасходнаяНакладная"));
	
	Если ЗначениеЗаполнено(ЭтимОбъектамНуженКонтрольУникальности.Найти(ТипОбъекта))
		И ЗначениеЗаполнено(ЭтимИсточникамНуженКонтрольУникальности.Найти(ТипИсточника)) Тогда
		КонтрольУникальностиПроектаВТабЧасти = Истина;
	КонецЕсли;	
	
	// Имя табличной части, хранящей значение проекта, для разных объектов отличается.
	ИмяТабЧастиПриемника = "";
	Если упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.ПоступлениеВКассу") = ТипОбъекта
		ИЛИ упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.ПоступлениеНаСчет") = ТипОбъекта 
		ИЛИ упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.РасходИзКассы") = ТипОбъекта
		ИЛИ упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.РасходСоСчета") = ТипОбъекта Тогда
		ИмяТабЧастиПриемника = "РасшифровкаПлатежа";
	ИначеЕсли упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументОбъект.РасходнаяНакладная") = ТипОбъекта Тогда
		ИмяТабЧастиПриемника = "Запасы";
	КонецЕсли;	
	
	// Имя табличной части источника, в которой может храниться проект, для разных документов-источников может быть различным.
	ИмяТабЧастиИсточника = "";
	Если ТипИсточника = упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.АктВыполненныхРабот") Тогда
		ИмяТабЧастиИсточника = "РаботыИУслуги";
	ИначеЕсли ТипИсточника = упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.РасходнаяНакладная") Тогда
		ИмяТабЧастиИсточника = "Запасы";
	КонецЕсли; 
	
	// Возможно два варианта размещения Проекта - в шапке документа либо в таб. части.
	ВШапке = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке");
	ВТЧ = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
	
	// Если у источника нет реквизита ПоложениеПроекта - значит проект расположен в шапке.
	УИсточникаЕстьПоложениеПроекта = ЗначениеЗаполнено(ДанныеЗаполнения)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "ПоложениеПроекта");
	ПоложениеПроектаИсточника = ?(УИсточникаЕстьПоложениеПроекта,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ПоложениеПроекта"),
		ВШапке);              
		
	// Если у Объекта нет реквизита ПоложениеПроекта - значит проект расположен в шапке.
	УОбъектаЕстьПоложениеПроекта = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ПоложениеПроекта");
	ПоложениеПроектаОбъекта = Неопределено;      
	
	// Положение проекта может быть задано в настройках для каждого документа персонально либо для всех документов сразу.   
	ОбщийМодульУправлениеНебольшойФирмойПовтИсп = ОбщегоНазначения.ОбщийМодуль("УправлениеНебольшойФирмойПовтИсп");  
	
	ПоложениеПроектаПоУмолчанию = ОбщийМодульУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		Пользователи.ТекущийПользователь(),
		"ПоложениеПроекта");   
				
	ПоложениеПроектаПоУмолчанию = ?(ЗначениеЗаполнено(ПоложениеПроектаПоУмолчанию), ПоложениеПроектаПоУмолчанию, ВШапке);
	Если УОбъектаЕстьПоложениеПроекта Тогда
		Если Не ЗначениеЗаполнено(Объект.ПоложениеПроекта) Тогда
			Объект.ПоложениеПроекта = ПоложениеПроектаПоУмолчанию;
		КонецЕсли;	
		ПоложениеПроектаОбъекта = Объект.ПоложениеПроекта;
	Иначе
		ПоложениеПроектаОбъекта = ВШапке;
	КонецЕсли;	     
	
	// Структура для передачи параметров в служебные методы.
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяРеквизитаПроектИсточника", ИмяРеквизитаПроектИсточника);
	Параметры.Вставить("ИмяРеквизитаПроектПриемника", ИмяРеквизитаПроектПриемника);
	Параметры.Вставить("КонтрольУникальностиПроектаВТабЧасти", КонтрольУникальностиПроектаВТабЧасти);
	Параметры.Вставить("ИмяТабЧастиПриемника", ИмяТабЧастиПриемника);
	Параметры.Вставить("ИмяТабЧастиИсточника", ИмяТабЧастиИсточника);
	
	Если ПоложениеПроектаИсточника = ВШапке И ПоложениеПроектаОбъекта = ВШапке Тогда
		ИзШапкиВШапку(Объект, ДанныеЗаполнения, Параметры);
	ИначеЕсли ПоложениеПроектаИсточника = ВШапке И ПоложениеПроектаОбъекта = ВТЧ Тогда
		ИзШапкиВТЧ(Объект, ДанныеЗаполнения, Параметры);
	ИначеЕсли ПоложениеПроектаИсточника = ВТЧ И ПоложениеПроектаОбъекта = ВШапке Тогда
		ИзТЧВШапку(Объект, ДанныеЗаполнения, Параметры);
	Иначе // У Источника и Приемника проект в таб. части. 
		ИзТЧВТЧ(Объект, ДанныеЗаполнения, Параметры);
	КонецЕсли;
		
КонецПроцедуры

#Область ЗаданияИКонтактЦентр

// Создает или обновляет элемент справочника ЗаписиКалендаряСотрудника, связанный с 
// элементом справочника упоЗадания.
//
// Параметры:
//	ОбъектупоЗадания - СправочникОбъект.упоЗадания
//
Процедура СоздатьОбновитьСвязанныйЭлементСправочникаЗаписиКалендаряСотрудника(ОбъектупоЗадания) Экспорт
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники["ЗаписиКалендаряСотрудника"]) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураСроки = упоЗаданияСервер.ПолучитьСрокиЗадания(ОбъектупоЗадания.Ссылка);
	СтруктураСроки = ?(СтруктураСроки = Неопределено,
		Новый Структура("ДатаНачалаПлан, ДатаОкончанияПлан, ДатаНачалаФакт, ДатаОкончанияФакт"),
		СтруктураСроки);
	
	ДанныеЗаполнения = Новый Структура("Источник, Начало, Окончание, Наименование, Календарь, КолонкаКалендаря, ОтветственныйИсточника, ПометкаУдаления, Завершено");
	ДанныеЗаполнения.Источник = ОбъектупоЗадания.Ссылка;
	ДанныеЗаполнения.Начало = СтруктураСроки.ДатаНачалаПлан;
	ДанныеЗаполнения.Окончание = СтруктураСроки.ДатаОкончанияПлан;
	ДанныеЗаполнения.Наименование = ОбъектупоЗадания.Наименование;
	ДанныеЗаполнения.ПометкаУдаления = ОбъектупоЗадания.ПометкаУдаления;
	
	
	СтатусыЗаданияПриКоторыхЗКСЗавершено = Новый Массив;
	СтатусыЗаданияПриКоторыхЗКСЗавершено.Добавить(Перечисления.упоСтатусыЗаданий.Завершено);
	СтатусыЗаданияПриКоторыхЗКСЗавершено.Добавить(Перечисления.упоСтатусыЗаданий.Закрыто);
	СтатусыЗаданияПриКоторыхЗКСЗавершено.Добавить(Перечисления.упоСтатусыЗаданий.Отменено);
	
	СтатусЗадания = упоЗаданияСервер.ПолучитьСтатусЗадания(ОбъектупоЗадания.Ссылка);
	
	Если СтатусыЗаданияПриКоторыхЗКСЗавершено.Найти(СтатусЗадания) = Неопределено Тогда
		ДанныеЗаполнения.Завершено = Ложь;
	Иначе
		ДанныеЗаполнения.Завершено = Истина;	
	КонецЕсли;	
	
	СвязанныйЭлементСправочникаЗКС = 
		Справочники["ЗаписиКалендаряСотрудника"].НайтиПоРеквизиту("Источник", ОбъектупоЗадания.Ссылка);
	
	Если СвязанныйЭлементСправочникаЗКС.Пустая() Тогда
		ОбъектСвязанныйЭлементСправочникаЗКС = Справочники["ЗаписиКалендаряСотрудника"].СоздатьЭлемент();
	Иначе
		ОбъектСвязанныйЭлементСправочникаЗКС = СвязанныйЭлементСправочникаЗКС.ПолучитьОбъект();
	КонецЕсли;
	
	СотрудникПользователя = СотрудникУНФпоТрудовомуРесурсуPM(ОбъектупоЗадания.Исполнитель);
	
	ОбщийМодульЗаполнениеОбъектовУНФ = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеОбъектовУНФ");
	
	ДанныеЗаполнения.Календарь = ОбщийМодульЗаполнениеОбъектовУНФ.ПолучитьКалендарьСотрудника(СотрудникПользователя);
	ДанныеЗаполнения.КолонкаКалендаря = Справочники["КолонкиКалендарейСотрудников"].КолонкаНеобработанное(ДанныеЗаполнения.Календарь);
	ДанныеЗаполнения.ОтветственныйИсточника = СотрудникПользователя;
	
	ОбъектСвязанныйЭлементСправочникаЗКС.Заполнить(ДанныеЗаполнения);
	ОбъектСвязанныйЭлементСправочникаЗКС.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти   

#КонецОбласти

#Область СлужебныеОбработкаЗаполнения
 
Процедура ИзШапкиВШапку(Объект, ДанныеЗаполнения, Параметры)
	
	Объект[Параметры.ИмяРеквизитаПроектПриемника] = ДанныеЗаполнения[Параметры.ИмяРеквизитаПроектИсточника];
	
КонецПроцедуры

Процедура ИзТЧВШапку(Объект, ДанныеЗаполнения, Параметры)
	
	Если СтрДлина(Параметры.ИмяТабЧастиИсточника) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.КонтрольУникальностиПроектаВТабЧасти Тогда
		// При контроле уникальности проектов ТЧ источника,
		// если в ТЧ источника во всех строка указан одинаковый проект - переносим его в приемник.
		Проекты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДанныеЗаполнения[Параметры.ИмяТабЧастиИсточника].ВыгрузитьКолонку("Проект"));
		Если Проекты.Количество() = 1 Тогда
			Объект[Параметры.ИмяРеквизитаПроектПриемника] = Проекты[0];
		Иначе
			// Если в ТЧ источника указаны разные проекты - в приемник запишем пустой проект.
			Объект[Параметры.ИмяРеквизитаПроектПриемника] = Справочники.Проекты.ПустаяСсылка();	
		КонецЕсли;	
	Иначе
		// Без контроля уникальности проектов источника перенесём в приемник проект первой строки ТЧ источника
		Объект[Параметры.ИмяРеквизитаПроектПриемника] = ?(ДанныеЗаполнения[Параметры.ИмяТабЧастиИсточника].Количество() > 0,
			ДанныеЗаполнения[Параметры.ИмяТабЧастиИсточника][0].Проект,
			Объект[Параметры.ИмяРеквизитаПроектПриемника]);
	КонецЕсли;
		
КонецПроцедуры

Процедура ИзШапкиВТч(Объект, ДанныеЗаполнения, Параметры)
	// В источнике Проект расположен в шапке, переносим в ТЧ приёмника.
	
	ПроектИсточника = ДанныеЗаполнения[Параметры.ИмяРеквизитаПроектИсточника];
	Если ПроектИсточника.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТабЧастьОбъекта = Объект[Параметры.ИмяТабЧастиПриемника];
	Для Каждого СтрокаТЧ Из ТабЧастьОбъекта Цикл
		СтрокаТЧ.Проект = ПроектИсточника;
	КонецЦикла;

КонецПроцедуры

Процедура ИзТчВТч(Объект, ДанныеЗаполнения, Параметры)
	// В источнике Проект расположен в ТЧ, переносим в ТЧ приёмника проекты из ТЧ источника.
	Если СтрДлина(Параметры.ИмяТабЧастиИсточника) = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения[Параметры.ИмяТабЧастиИсточника].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Если Параметры.КонтрольУникальностиПроектаВТабЧасти Тогда
		// С контролем уникальности проектов тч источника.
		// Если в ТЧ источника во всех строка указан одинаковый проект - переносим его в приемник.
		Проекты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДанныеЗаполнения[Параметры.ИмяТабЧастиИсточника].ВыгрузитьКолонку("Проект"));
		Если Проекты.Количество() = 1 Тогда
			Проект = Проекты[0];
		Иначе
			// Если в ТЧ источника указаны разные проекты, или проектов нет вовсе - в приемник запишем пустой проект.
			Проект = Справочники.Проекты.ПустаяСсылка();	
		КонецЕсли;	
		Для Каждого СтрокаТЧ Из Объект[Параметры.ИмяТабЧастиПриемника] Цикл
			СтрокаТЧ.Проект = Проект;	
		КонецЦикла;	
	Иначе
		// Без контроля уникальности проектов тч источника.
		// Алгоритм нуждается в проработке, для каждой пары приемник-источник состав полей параметров отбора может быть разным.
		Для Каждого СтрокаТЧ Из Объект[Параметры.ИмяТабЧастиПриемника] Цикл
			ПараметрыОтбора = Новый Структура("Номенклатура");
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТЧ);
			СтрокиИсточника = ДанныеЗаполнения[Параметры.ИмяТабЧастиИсточника].НайтиСтроки(ПараметрыОтбора);
			Если СтрокиИсточника.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;	
			СтрокаТЧ.Проект = СтрокиИсточника[0].Проект;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти   

#Область ЗаданияИКонтактЦентр

// Получает сотрудника УНФ по значению Трудового ресурса. 
// Если сотрудника не удалось определенить, будет возвращено Неопределено.
//
// Параметры:
//	ТрудовойРесурс - СправочникаСсылка.упоТрудовыеРесурсы 
//
// Возвращаемое значение:
//	СправочникаСсылка.Сотрудники, Неопределено
//
Функция СотрудникУНФпоТрудовомуРесурсуPM(Знач ТрудовойРесурс)
		
	упоСотрудник = упоРесурсыИРолиВызовСервера.обПолучитьТекущегоВладельцаРесурса(ТрудовойРесурс);
	Если ЗначениеЗаполнено(упоСотрудник) Тогда
		ОтветственныйЗКС = Неопределено;
		//массив диспетчеров сотрудника
		Диспетчеры = упоПользователи.ПолучитьМассивДиспетчеровСотрудника(упоСотрудник);
		
		Если Диспетчеры.Количество() = 0 Тогда
			ОтветственныйЗКС = Пользователи.ТекущийПользователь();
		ИначеЕсли Диспетчеры.Количество() = 1 Тогда
			ОтветственныйЗКС = Диспетчеры[0];
		Иначе // Количество() > 1
			Для Каждого Диспетчер Из Диспетчеры Цикл
				СотрудникПользователяПоУмолчанию = упоПользователиВызовСервера.обПолучитьНастройкуПользователя(
					"СотрудникПоУмолчанию", 
					Диспетчер);
				Если СотрудникПользователяПоУмолчанию = упоСотрудник Тогда
					ОтветственныйЗКС = Диспетчер;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			Если ОтветственныйЗКС = Неопределено Тогда
				ПредставлениеСотрудника = Строка(упоСотрудник); 
				упоИерархияИПолномочияВызовСервера.обПодобратьДиспетчераПоИмени(
					Диспетчеры, ПредставлениеСотрудника, ОтветственныйЗКС)
			КонецЕсли;
		КонецЕсли;	
	Иначе
		ПользовательПоОсновномуТрудовомуРесурсу = 
			Справочники.Пользователи.НайтиПоРеквизиту("упоОсновнойТрудовойРесурс", ТрудовойРесурс);
		Если ПользовательПоОсновномуТрудовомуРесурсу.Пустая() Тогда
			ОтветственныйЗКС = Пользователи.ТекущийПользователь();
		Иначе
			ОтветственныйЗКС = ПользовательПоОсновномуТрудовомуРесурсу;
		КонецЕсли;
	КонецЕсли;	
	
	СотрудникиПользователя = 
		РегистрыСведений["СотрудникиПользователя"].ПолучитьСотрудниковПользователя(ОтветственныйЗКС);
	
	СотрудникУНФ = ?(СотрудникиПользователя.Количество() > 0, СотрудникиПользователя[0], Неопределено);
	Возврат СотрудникУНФ;

КонецФункции

#КонецОбласти

