#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(ПроектныеЗадачи.ПроектнаяЗадача.упоКорневойПроект, NULL КАК ИСТИНА))";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.упоСогласованиеТрудозатрат.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область Проведение

// Возвращает данные для проведения документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.упоСогласованиеЧасов
//
// Возвращаемое значение:
//   Структура: 
//   	* Ключ - Строка - имя регистра.
//   	* Значение - ТаблицаЗначений - данные для проведения документа.
//
Функция ДанныеПроведения(ДокументСсылка) Экспорт
	
	ПериодСогласованияЧасов = Константы.упоПериодСогласованияТрудозатрат.Получить();
	Если ПериодСогласованияЧасов = Перечисления.упоПериодыСогласованияТрудозатрат.Неделя Тогда
		КонецПериода = КонецНедели(ДокументСсылка.НачалоПериода);
	Иначе 
		КонецПериода = КонецМесяца(ДокументСсылка.НачалоПериода);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаДляПроведения();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", КонецПериода);

	Результат = Запрос.Выполнить();
	
	ДанныеПроведения = Новый Структура;
	ДанныеПроведения.Вставить("упоСогласованныеТрудозатраты", Результат.Выгрузить());
	
	Возврат ДанныеПроведения;
	
КонецФункции

#КонецОбласти

#КонецОбласти 

#КонецЕсли

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ТекстЗапросаДляПроведения()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаТрудозатрат.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
	               |	ТаблицаТрудозатрат.Подразделение КАК Подразделение,
	               |	ТаблицаТрудозатрат.Сотрудник КАК Сотрудник,
	               |	ТаблицаТрудозатрат.Роль КАК Роль,
	               |	ТаблицаТрудозатрат.РабочееЗадание КАК РабочееЗадание,
	               |	ТаблицаТрудозатрат.ЧасыПризнОконч КАК ЧасыПризнОконч,
	               |	ТаблицаТрудозатрат.НормаСтоимостиПризнОконч КАК НормаСтоимостиПризнОконч,
	               |	ТаблицаТрудозатрат.СтоимостьПризнОконч КАК СтоимостьПризнОконч,
	               |	ТаблицаТрудозатрат.ЧасыНеПризнОконч КАК ЧасыНеПризнОконч,
	               |	ТаблицаТрудозатрат.НормаСтоимостиНеПризнОконч КАК НормаСтоимостиНеПризнОконч,
	               |	ТаблицаТрудозатрат.СтоимостьНеПризнОконч КАК СтоимостьНеПризнОконч,
	               |	ТаблицаТрудозатрат.СтавкаПризнОконч КАК СтавкаПризнОконч,
	               |	ТаблицаТрудозатрат.ЧасыОтклОконч КАК ЧасыОтклОконч,
	               |	ТаблицаТрудозатрат.СтавкаНеПризнОконч КАК СтавкаНеПризнОконч,
	               |	ТаблицаТрудозатрат.ВидОперации КАК ВидОперации
	               |ПОМЕСТИТЬ втТаблицаТрудозатрат
	               |ИЗ
	               |	Документ.упоСогласованиеТрудозатрат.ПроектныеЗадачи КАК ТаблицаТрудозатрат
	               |ГДЕ
	               |	ТаблицаТрудозатрат.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	ВложенныйЗапрос.Ресурс КАК Ресурс,
	               |	ВложенныйЗапрос.Роль КАК Роль,
	               |	ВложенныйЗапрос.НормаСтоимости КАК НормаСтоимости,
	               |	СУММА(ВложенныйЗапрос.СогласованныеЧасы) КАК СогласованныеЧасы,
	               |	ВложенныйЗапрос.Ставка КАК Ставка,
	               |	ВложенныйЗапрос.Стоимость КАК Стоимость,
	               |	СУММА(ВложенныйЗапрос.ОтклоненныеЧасы) КАК ОтклоненныеЧасы,
	               |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	               |	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
	               |	ВложенныйЗапрос.РабочееЗадание КАК РабочееЗадание,
	               |	ВложенныйЗапрос.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		втТаблицаТрудозатрат.Сотрудник КАК Ресурс,
	               |		втТаблицаТрудозатрат.Роль КАК Роль,
	               |		втТаблицаТрудозатрат.НормаСтоимостиПризнОконч КАК НормаСтоимости,
	               |		втТаблицаТрудозатрат.ЧасыПризнОконч КАК СогласованныеЧасы,
	               |		втТаблицаТрудозатрат.СтавкаПризнОконч КАК Ставка,
	               |		втТаблицаТрудозатрат.СтоимостьПризнОконч КАК Стоимость,
	               |		втТаблицаТрудозатрат.ЧасыОтклОконч КАК ОтклоненныеЧасы,
	               |		втТаблицаТрудозатрат.Подразделение КАК Подразделение,
	               |		втТаблицаТрудозатрат.ВидОперации КАК ВидОперации,
	               |		втТаблицаТрудозатрат.РабочееЗадание КАК РабочееЗадание,
	               |		втТаблицаТрудозатрат.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |	ИЗ
	               |		втТаблицаТрудозатрат КАК втТаблицаТрудозатрат
	               |	ГДЕ
	               |		втТаблицаТрудозатрат.ЧасыПризнОконч > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		втТаблицаТрудозатрат.Сотрудник,
	               |		втТаблицаТрудозатрат.Роль,
	               |		втТаблицаТрудозатрат.НормаСтоимостиНеПризнОконч,
	               |		втТаблицаТрудозатрат.ЧасыНеПризнОконч,
	               |		втТаблицаТрудозатрат.СтавкаНеПризнОконч,
	               |		втТаблицаТрудозатрат.СтоимостьНеПризнОконч,
	               |		0,
	               |		втТаблицаТрудозатрат.Подразделение,
	               |		втТаблицаТрудозатрат.ВидОперации,
	               |		втТаблицаТрудозатрат.РабочееЗадание,
	               |		втТаблицаТрудозатрат.ПроектнаяЗадача
	               |	ИЗ
	               |		втТаблицаТрудозатрат КАК втТаблицаТрудозатрат
	               |	ГДЕ
	               |		втТаблицаТрудозатрат.ЧасыНеПризнОконч > 0) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ресурс,
	               |	ВложенныйЗапрос.НормаСтоимости,
	               |	ВложенныйЗапрос.Ставка,
	               |	ВложенныйЗапрос.Стоимость,
	               |	ВложенныйЗапрос.Подразделение,
	               |	ВложенныйЗапрос.ВидОперации,
	               |	ВложенныйЗапрос.РабочееЗадание,
	               |	ВложенныйЗапрос.ПроектнаяЗадача,
	               |	ВложенныйЗапрос.Роль";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

