
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();

	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Объект.Ссылка.Метаданные());

	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКоманднаяПанель;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЭтоНовый = Не ЗначениеЗаполнено(Объект.Ссылка);	
	
	УстановитьСписокВыбораУровнейГруппировок(ЭтаФорма);

	Если ЭтоНовый Тогда
		
		Если Параметры.Свойство("Основание") И ЗначениеЗаполнено(Параметры.Основание) Тогда
		
			СписокПроектов.ЗагрузитьЗначения(Объект.Проекты.Выгрузить().ВыгрузитьКолонку("Проект"));		
			СписокПодразделений.ЗагрузитьЗначения(Объект.Подразделения.Выгрузить().ВыгрузитьКолонку("Подразделение"));		
			СписокРолей.ЗагрузитьЗначения(Объект.Роли.Выгрузить().ВыгрузитьКолонку("Роль"));		
			НачалоПериодаНаФорме = Объект.НачалоПериода;
			КонецПериодаНаФорме = Объект.КонецПериода;
			
			ЗагрузитьДанныеИзБДВОбъект();
		
		КонецЕсли;
		
		ЭтоКопирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
		
		ИнициализацияФормы(ЭтоКопирование);
		
	Иначе
		
		упоПланированиеТрудозатратКлиентСервер.УстановитьТекущуюСтраницуПанели(ЭтотОбъект, "СтраницаТрудозатраты");	
		
	КонецЕсли;	

	
	ПроверятьРазграничениеДоступа = ЗначениеЗаполнено(Объект.Ссылка) И Объект.Проведен;				
	// Вместо сообщений о разграничении прав доступа может использоваться цветовое выделение в условном оформлении строк.
	// - оставлено оповещение для случая большого количества строк.
	ВыводитьСообщенияОРазграниченииПравДоступа = Истина;
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, 
														Объект, 
														Отказ, 
														СтандартнаяОбработка, 
														ВыводитьСообщенияОРазграниченииПравДоступа, 
														ПроверятьРазграничениеДоступа); 		

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом

КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы(ЭтоКопирование)

	Если мКэшЗначений = Неопределено Тогда
		мКэшЗначений = Новый Структура;
		мКэшЗначений.Вставить("СтрокиПЗ_НижнийУровень", Новый Соответствие);
		мКэшЗначений.Вставить("СтрокиПЗ_УровеньПЗ", Новый Соответствие);
		мКэшЗначений.Вставить("СтрокиРесурса_НижнийУровень", Новый Соответствие);
		
		ЦветДиаграммыЗагрузка = Новый Цвет(182, 162, 255);
		ЦветДиаграммыПерегрузка = Новый Цвет(255, 119, 50);
		ЦветДиаграммыПростой = Новый Цвет(184, 248, 194);
	КонецЕсли;	

	ЗагрузитьДанныеФормыИзОбъекта(, ЭтоКопирование);
	АдаптироватьЭлементы(ЭтаФорма);
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);

КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если СписокПодразделений.Количество() > 0 Тогда
		упоУправлениеФормамиКлиент.СписокРолейПриИзмененииСпискаПодразделений(ЭтаФорма);
	КонецЕсли;

	ОбновитьСоответствиеУровнейДерева();
	РазвернутьДерево();

	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если Не Отказ И НачалоПериодаНаФорме > КонецПериодаНаФорме И ЗначениеЗаполнено(КонецПериодаНаФорме) Тогда
		Сообщение = Новый СообщениеПользователю;
		//Сообщение.УстановитьДанные(Объект);
		//Сообщение.Поле = "НачалоПериода";
		//Сообщение.ПутьКДанным = "Объект";
		Сообщение.Текст = НСтр("ru = 'Начало периода не может быть позже окончания'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;

	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗагрузитьДанныеОбъектаИзФормы(ТекущийОбъект);

	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()

	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()

	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("ВыборПараметровНазначения") Тогда
			
			НазначитьРесурсНаЗадачуСервер(ВыбранноеЗначение.ТрудовойРесурс,
										ВыбранноеЗначение.УИДСтрокиЗадачи, 
										, 
							  			ВыбранноеЗначение);
			ОбновитьСоответствиеУровнейДерева();
			РазвернутьДерево();
			
		КонецЕсли;
		
	КонецЕсли;

	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)

	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)

	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ИнициализацияФормы(Ложь);

	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	                                    
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УдалитьПустыеСтрокиИзСпискаПроектов();
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);

КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)

	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);

КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)

	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	упоОбработчикиСобытийКлиент.ФормаОбработкаНавигационнойСсылки(ЭтаФорма, 
																НавигационнаяСсылкаФорматированнойСтроки, 
																СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПерехода(ОбъектПерехода, СтандартнаяОбработка)

	упоОбработчикиСобытийКлиент.ФормаОбработкаПерехода(ЭтаФорма, ОбъектПерехода, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначения(СтандартнаяОбработка)

	упоОбработчикиСобытийКлиент.ФормаВыборЗначения(ЭтаФорма, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()

	упоОбработчикиСобытийКлиент.ФормаПриИзмененииПараметровЭкрана(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписыватьСрокиЗадач(Команда)
	
	Объект.НеЗаписыватьСрокиЗадач = Не Объект.НеЗаписыватьСрокиЗадач;
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	ЗаписатьНастройкуЗаписыватьСрокиЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ПриИзмененииФильтров(Истина);
	
	РазвернутьДеревоДоУровня();
	
	упоПланированиеТрудозатратКлиентСервер.УстановитьТекущуюСтраницуПанели(ЭтотОбъект, "СтраницаТрудозатраты");	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеречитать(Команда)

	ЭтотОбъект.Прочитать();

	РазвернутьДерево();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСдвинутьНаПериодВправо(Команда)

	СдвинутьНаПериод(Истина);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСдвинутьНаПериодВлево(Команда)

	СдвинутьНаПериод(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписыватьВсе(Команда)
	
	УстановитьПризнакЗаписи(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНеЗаписыватьВсе(Команда)
	
	УстановитьПризнакЗаписи(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	ВыборПериода = Новый СтандартныйПериод(НачалоПериодаНаФорме, КонецПериодаНаФорме);

	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогРедактирования.Период = ВыборПериода;

	ОписаниеОповещенияВыбратьПериодЗавершение = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтаФорма);

	ДиалогРедактирования.Показать(ОписаниеОповещенияВыбратьПериодЗавершение);
	 
КонецПроцедуры    

&НаКлиенте
Процедура КомандаПоказатьДиаграмму(Команда)
	
	Объект.ПоказатьДиаграмму = Не Объект.ПоказатьДиаграмму;
	Элементы.ФормаКомандаПоказатьДиаграмму.Пометка = Объект.ПоказатьДиаграмму; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурсам");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьДиаграммуГанта(Команда)
	
	Объект.ПоказатьДиаграммуГанта = Не Объект.ПоказатьДиаграммуГанта;
	Элементы.ФормаКомандаПоказатьДиаграммуГанта.Пометка = Объект.ПоказатьДиаграммуГанта; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	ПостроитьДиаграммуГанта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьКолонкиРолей(Команда)
	
	Объект.ПоказатьКолонкиРолей = Не Объект.ПоказатьКолонкиРолей;
	//ПоказатьКолонкиРолей = Не ПоказатьКолонкиРолей;
	Элементы.ФормаКомандаПоказатьКолонкиРолей.Пометка = Объект.ПоказатьКолонкиРолей; 
	//Элементы.ФормаКомандаПоказатьКолонкиРолей.Пометка = ПоказатьКолонкиРолей; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьКолонкиФакта(Команда)
	
	Объект.ПоказатьКолонкиФакта = Не Объект.ПоказатьКолонкиФакта;
	Элементы.ФормаКомандаПоказатьКолонкиФакта.Пометка = Объект.ПоказатьКолонкиФакта; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПланЗаПериодом(Команда)
	
	Объект.ПоказатьПланЗаПериодом = Не Объект.ПоказатьПланЗаПериодом;
	Элементы.ФормаКомандаПоказатьПланЗаПериодом.Пометка = Объект.ПоказатьПланЗаПериодом; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказыватьВыходные(Команда)
	
	Объект.ПоказыватьВыходные = Не Объект.ПоказыватьВыходные;
	Элементы.ФормаКомандаПоказыватьВыходные.Пометка = Объект.ПоказыватьВыходные; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	Если Объект.ПоказатьДиаграмму Тогда
		упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурсам");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьКолонкиТекущееЗначение(Команда)
	
	Объект.ПоказатьКолонкиТекущееЗначение = Не Объект.ПоказатьКолонкиТекущееЗначение;
	Элементы.ФормаКомандаПоказатьКолонкиТекущееЗначение.Пометка = Объект.ПоказатьКолонкиТекущееЗначение; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьТекущиеСроки(Команда)
	
	Объект.ПоказатьТекущиеСроки = Не Объект.ПоказатьТекущиеСроки;
	Элементы.ФормаКомандаПоказатьТекущиеСроки.Пометка = Объект.ПоказатьТекущиеСроки; 
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьТекущиеЗначенияНаДГ(Команда)
	
	Объект.ПоказыватьТекущиеЗначенияНаДГ = Не Объект.ПоказыватьТекущиеЗначенияНаДГ;
	Элементы.ФормаКомандаПоказатьТекущиеЗначенияНаДГ.Пометка = Объект.ПоказыватьТекущиеЗначенияНаДГ; 
	ПостроитьДиаграммуГанта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереназначитьЗадачиТР(Команда)
	
	ГруппировкаТРПЗ = 2;
	
	Если НЕ Объект.ПорядокГруппировок = ГруппировкаТРПЗ Тогда
		Возврат;	
	КонецЕсли;	

	ТекДанные = Элементы.ДеревоФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.ТрудовойРесурс) Тогда	
		ПереназначитьЗадачиКлиент(ТекДанные.ТрудовойРесурс);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьУровни(Команда)

	Если СоотвУровняДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;

	упоОперацииСДеревьямиКлиент.СвернутьСтрокиДерева(Элементы.ДеревоФормы, СоотвУровняДерева);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУровни(Команда)

	упоОперацииСДеревьямиКлиент.РазвернутьСтрокиДерева(ЭтаФорма, "ДеревоФормы");

КонецПроцедуры

&НаКлиенте
Процедура КомандаПереместитьЗадачуВверх(Команда)
		
	Направление = -1;
	ПереместитьЗадачуКлиент(Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереместитьЗадачуВниз(Команда)
	
	Направление = 1;
	ПереместитьЗадачуКлиент(Направление);
			
КонецПроцедуры
	
&НаКлиенте
Процедура КомандаПоказатьДГПоРесурсу(Команда)
	
	Объект.ПоказатьДиаграммуГанта = Истина;
	Элементы.ФормаКомандаПоказатьДиаграммуГанта.Пометка = Истина;
	ТекДанные = Элементы.ДеревоФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		РесурсДиаграммыПоРесурсу = ТекДанные.ТрудовойРесурс;
	КонецЕсли;
	УстановитьВидимостьДоступностьЭлементовКлиент();
	ПостроитьДиаграммуГанта(ЭтаФорма);
	упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурам");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьДиаграммуПоРесурсу(Команда)
	
	Объект.ПоказатьДиаграмму = Истина;
	Элементы.ФормаКомандаПоказатьДиаграмму.Пометка = Истина;
	ТекДанные = Элементы.ДеревоФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		РесурсДиаграммыПоРесурсу = ТекДанные.ТрудовойРесурс;
	КонецЕсли;
	УстановитьВидимостьДоступностьЭлементовКлиент();
	упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурсам");
	ПостроитьДиаграммуГанта(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализИзменений(Команда)

	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для формирования отчета документ необходимо записать.'"));
		Возврат;
	КонецЕсли;	

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Документ", Объект.Ссылка);	

	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("ПараметрыОтчета", ПараметрыОтчета);

	ИмяОтчета = "упоАнализИзмененийПоПланированиюТрудозатратПоТрудовымРесурсам";
	Если  Объект.ПорядокГруппировок = 0 Тогда // Трудовой ресурс / Роль / Проект / Задача
		КлючВарианта = "ТрудовойРесурс_Роль_Проект_Задача";	
	ИначеЕсли Объект.ПорядокГруппировок = 1 Тогда // Проект / Задача / Роль / Трудовой ресурс 		
		КлючВарианта = "Проект_Задача_Роль_ТрудовойРесурс";
	Иначе // Трудовой ресурс / Задача
	    КлючВарианта = "ТрудовойРесурс_Задача";
	КонецЕсли;

	ВариантСсылка = упоФункцииБСП.ВариантОтчетаПоИмениОтчетаКлючуВарианта(ИмяОтчета, КлючВарианта);
				
	ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Неопределено, ВариантСсылка, ПараметрыОткрытия);

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)

	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);

КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Диаграмма

&НаКлиенте
Процедура РесурсДиаграммыПоРесурсуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Режим совместимости 8.3.24 или "Не использовать". Примечание: на сервере без контекста значения таблицы так
	// же могут быть недоступны.
	ДанныеВыбора = СписокТрудовыхРесурсовИзТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсДиаграммыПоРесурсуАвтоПодбор(Элемент, Текст, ДанныеВыбора, 
	ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	МассивЭлементовОтбора = Новый Массив;

	СтрокиРесурса_НижнийУровень = ЭтаФорма.мКэшЗначений.СтрокиРесурса_НижнийУровень;

	Для Каждого СтрокаСоответствия Из СтрокиРесурса_НижнийУровень Цикл
		МассивЭлементовОтбора.Добавить(СтрокаСоответствия.Ключ);	
	КонецЦикла; 

	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Отбор", Новый Структура("ОтборПоРолям", МассивЭлементовОтбора));
	СтруктураОтбора.Вставить("СтрокаПоиска", Текст);	

	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.упоРоли"), СтруктураОтбора);

КонецПроцедуры

&НаКлиенте
Процедура РесурсДиаграммыПоРесурсуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, 
	ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ЗначениеДиаграммы) <> Тип("ЗначениеДиаграммы") Тогда
		Возврат;
	КонецЕсли;
	ДатаТочки = ЗначениеДиаграммы.Расшифровка;
	ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(ДатаТочки);
	Элементы.ДеревоФормы.ТекущийЭлемент = Элементы[ИмяКолонки + "НовоеЗначение"];
	Если ЗначениеЗаполнено(РесурсДиаграммыПоРесурсу) Тогда
		мСтрокРесурса = мКэшЗначений.СтрокиРесурса_НижнийУровень.Получить(РесурсДиаграммыПоРесурсу);
		Если ТипЗнч(мСтрокРесурса) = Тип("Массив") И мСтрокРесурса.Количество() > 0 Тогда
			Элементы.ДеревоФормы.ТекущаяСтрока = мСтрокРесурса[0];
		КонецЕсли;	
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.ДеревоФормы;
	Элементы.ДеревоФормы.ИзменитьСтроку();
	
КонецПроцедуры

#КонецОбласти

#Область Настройки

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	НачалоПериодаНаФорме = НачалоМесяца(НачалоПериодаНаФорме);
	Если Не ЗначениеЗаполнено(КонецПериодаНаФорме) И ЗначениеЗаполнено(НачалоПериодаНаФорме) Тогда
		КонецПериодаНаФорме = КонецМесяца(ДобавитьМесяц(НачалоПериодаНаФорме, 5));	
	КонецЕсли;
	ПриИзмененииФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	КонецПериодаНаФорме = КонецМесяца(КонецПериодаНаФорме);
	Если Не ЗначениеЗаполнено(НачалоПериодаНаФорме) И ЗначениеЗаполнено(КонецПериодаНаФорме) Тогда
		НачалоПериодаНаФорме = НачалоМесяца(ДобавитьМесяц(КонецПериодаНаФорме, 5));	
	КонецЕсли;	
	ПриИзмененииФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКолонки(Элемент) 

	ТекДанные = Элементы.ДеревоФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ИмяКолонки = Элемент.Имя;
		Если ТекДанные[ИмяКолонки] < 0 Тогда
			ТекДанные[ИмяКолонки] = ТекДанные[ПолучитьИмяОсновнойКолонкиПоИмениЭлемента(ИмяКолонки) + "ДляРасчетаРазницы"];
			Возврат;
		КонецЕсли;	
		УстановитьТрудозатраты(ЭтаФорма, ТекДанные, ИмяКолонки, , , , , Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокРолейПриИзменении(Элемент)
	
	ПриИзмененииФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроектовПриИзменении(Элемент)
	
	ПриИзмененииФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодразделенийПриИзменении(Элемент)
	
	ПриИзмененииФильтров();
	упоУправлениеФормамиКлиент.СписокРолейПриИзмененииСпискаПодразделений(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокГруппировокПриИзменении(Элемент)
	
	Объект.УровеньГруппировок = -1;
	УстановитьСписокВыбораУровнейГруппировок(ЭтаФорма, Истина);
	ПриИзмененииГруппировокСервер();
	ОбновитьСоответствиеУровнейДерева();
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура УровеньГруппировокПриИзменении(Элемент)

	РазвернутьДеревоДоУровня();

КонецПроцедуры

&НаКлиенте
Процедура НеЗаписыватьСрокиЗадачПриИзменении(Элемент)

	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	ЗаписатьНастройкуЗаписыватьСрокиЗадач();

КонецПроцедуры

&НаКлиенте
Процедура СписокПроектовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйМассив = Новый Массив;							
	НовыйМассив.Добавить(Новый ПараметрВыбора("СкрыватьЭтапы", Истина));	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);	
	
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры
	
#КонецОбласти

#Область ДеревоТрудозатрат

&НаКлиенте
Процедура ДеревоФормыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Не Поле.Имя = "ДеревоФормыГруппировка" Тогда
		Возврат; 
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ДеревоФормы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ВыборИзМеню = Ложь;		
	
	Если ТекДанные.ПоследнийУровень Тогда
		
		ВыборИзМеню = Истина;
		
		Варианты = ВариантыВыбораДляПоследнегоУровня(ТекДанные);									     
		
	ИначеЕсли Объект.ПорядокГруппировок = 2 Тогда
		
		Если ЗначениеЗаполнено(ТекДанные.ТрудовойРесурс) Тогда // И ТекДанные.ИтогНовоеЗначение <> 0 Тогда
			
			ВыборИзМеню = Истина;
						
			Варианты = ВариантыВыбораДляГруппировки(ТекДанные);
																					
		КонецЕсли;
		
	Иначе
		
		ПоказатьЗначение(, ТекДанные[ТекДанные.ИмяГруппировки]);
		
	КонецЕсли;
	
	Если ВыборИзМеню Тогда
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ИдСтроки", ТекДанные.ПолучитьИдентификатор());
		ПараметрыОповещения.Вставить("Поле", Поле);
		ОписаниеОповещенияЗавершениеВыборИзМенюГруппировка = Новый ОписаниеОповещения("ЗавершениеВыборИзМенюГруппировка", 
															ЭтаФорма, ПараметрыОповещения);
															
		ПоказатьВыборИзМеню(ОписаниеОповещенияЗавершениеВыборИзМенюГруппировка, Варианты, Поле);
								
	КонецЕсли;			

КонецПроцедуры

&НаКлиенте
Процедура ДеревоФормыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	СтандартнаяОбработка = Ложь;

	Если ЭтаФорма.ТолькоПросмотр Или Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СтрокаПриемник = ДеревоФормы.НайтиПоИдентификатору(Строка);	
	Если Не СтрокаПриемник.ЕстьПраваНаРедактирование Тогда
		Возврат;	
	КонецЕсли;	

	Значение = ПараметрыПеретаскивания.Значение;

	Если Поле.Имя = "ДеревоФормыГруппировка" Тогда
		
		Если ТипЗнч(Значение) <> Тип("Массив") ИЛИ
			Значение.Количество() = 0  ИЛИ
			СтрНайти(Значение[0], ЭтаФорма.УникальныйИдентификатор) = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрНайти(Значение[0], "НазначитьНаЗадачу") <> 0 Тогда
			ТрудовойРесурс = Значение[1];
			Если Объект.ПорядокГруппировок = 1 Тогда
				Если СтрокаПриемник.ИмяГруппировки = "Роль"	
					Или СтрокаПриемник.ИмяГруппировки = "ТрудовойРесурс" Тогда
					
					НазначитьРесурсНаЗадачуКлиент(Строка, ТрудовойРесурс);
					
				КонецЕсли;	
			ИначеЕсли СтрокаПриемник.ИмяГруппировки = "ПроектнаяЗадачаЗеркало" 
				И ЗначениеЗаполнено(СтрокаПриемник.ПроектнаяЗадачаЗеркало) Тогда
				
				НазначитьРесурсНаЗадачуКлиент(Строка, ТрудовойРесурс);
				
			КонецЕсли;
		ИначеЕсли Найти(Значение[0], "НазначитьРесурс") <> 0 Тогда
			ИдСтрокиПЗ = Значение[1]; 
			Если ЗначениеЗаполнено(СтрокаПриемник.ТрудовойРесурс) Тогда
				
				НазначитьРесурсНаЗадачуКлиент(ИдСтрокиПЗ, СтрокаПриемник.ТрудовойРесурс);
				
			КонецЕсли;
		КонецЕсли;			
		
	Иначе
				
		ПроверитьУстановитьТрудозатратыВСтрокеПоИсточнику(СтрокаПриемник, Значение, Поле.Имя);
					
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоФормыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФормыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)	

	Если ЭтаФорма.ТолькоПросмотр Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;

	ТекСтрока = Элементы.ДеревоФормы.ТекущиеДанные;
	Если Элемент.ТекущийЭлемент = Неопределено ИЛИ ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ТекСтрока.ЕстьПраваНаРедактирование Тогда
		Возврат;
	КонецЕсли;	

	ИмяКолонки = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "ДеревоФормы", "");
	ПараметрыПеретаскивания.Значение.Очистить();
	Если ТекСтрока = Неопределено Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	ИдСтроки = ТекСтрока.ПолучитьИдентификатор();
	Если ТипЗнч(ТекСтрока[ИмяКолонки]) = Тип("Число") Тогда
		ПараметрыПеретаскивания.Значение.Добавить("Перетаскивание" + ЭтаФорма.УникальныйИдентификатор);
		ПараметрыПеретаскивания.Значение.Добавить(ИдСтроки);
		ПараметрыПеретаскивания.Значение.Добавить(ИмяКолонки);
	ИначеЕсли ИмяКолонки = "Группировка" Тогда
		Если ЗначениеЗаполнено(ТекСтрока.ТрудовойРесурс) И НЕ ЗначениеЗаполнено(ТекСтрока.ПроектнаяЗадачаЗеркало) Тогда
			ПараметрыПеретаскивания.Значение.Добавить("НазначитьНаЗадачу" + ЭтаФорма.УникальныйИдентификатор);
			ПараметрыПеретаскивания.Значение.Добавить(ТекСтрока.ТрудовойРесурс);	
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекСтрока.ТрудовойРесурс) И ЗначениеЗаполнено(ТекСтрока.ПроектнаяЗадачаЗеркало) Тогда
			ПараметрыПеретаскивания.Значение.Добавить("НазначитьРесурс" + ЭтаФорма.УникальныйИдентификатор);
			ПараметрыПеретаскивания.Значение.Добавить(ИдСтроки);
			ПараметрыПеретаскивания.Значение.Добавить(ТекСтрока.ПроектнаяЗадачаЗеркало);			
		Иначе
			Выполнение = Ложь;	
		КонецЕсли;
	Иначе
		Выполнение = Ложь;
	КонецЕсли;       

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено)

	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	

КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)

	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);

КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)

	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);

КонецФункции

#КонецОбласти

&НаСервере
Функция ЗаполнитьСервер() 

	ЗагрузитьДанныеИзБДВОбъект();
	ЗагрузитьДанныеФормыИзОбъекта();
	АдаптироватьЭлементы(ЭтаФорма);
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяОсновнойКолонкиПоДате(Дата) 
	
	Возврат "Колонка" + Формат(Дата, "ДФ=yyyyMMdd");	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяОсновнойКолонкиПоИмениЭлемента(ИмяЭлемента) 
	
	Если СтрНайти(ИмяЭлемента, "Колонка") = 0 Тогда
		Возврат Неопределено;
	Иначе
		ИмяПустойКолонки = ПолучитьИмяОсновнойКолонкиПоДате(ПолучитьТекущуюДатуСеанса());
		Индекс = СтрНайти(ИмяПустойКолонки, "Колонка");
		Длина = СтрДлина(ИмяПустойКолонки);
		Возврат Сред(ИмяЭлемента, Индекс, Длина);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьИтоги(ЭтаФорма)

	ЭтаФорма.ОбщийИтогФакт = 0;
	ЭтаФорма.ОбщийИтогПоРоли = 0;

	ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение = 0;
	ЭтаФорма.ОбщийИтогПоПериодуОтклонение = 0;
	ЭтаФорма.ОбщийИтогПоПериодуПоРоли = 0;
	ЭтаФорма.ОбщийИтогПоПериодуТекущееЗначение = 0;
	ЭтаФорма.ОбщийИтогПоПериодуФакт = 0;

	ЭтаФорма.ОбщийИтогТрудозатратыПланПослеПериода = 0;
	ЭтаФорма.ОбщийИтогТрудозатратыПланДоПериода = 0;

	ОбновитьПодвалИтогов(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодвалИтогов(ЭтаФорма) 

	ФорматПодвала = "ЧДЦ=1; ЧН=";

	ЭтаФорма.ПодвалОбщийИтогФакт = Формат(ЭтаФорма.ОбщийИтогФакт, ФорматПодвала); 

	ЭтаФорма.ПодвалОбщийИтогПоРоли = Формат(ЭтаФорма.ОбщийИтогПоРоли, ФорматПодвала); 

	ЭтаФорма.ПодвалОбщийИтогТрудозатратыПланДоПериода = 
		Формат(ЭтаФорма.ОбщийИтогТрудозатратыПланДоПериода, ФорматПодвала); 
	ЭтаФорма.ПодвалОбщийИтогТрудозатратыПланПослеПериода = 
		Формат(ЭтаФорма.ОбщийИтогТрудозатратыПланПослеПериода, ФорматПодвала); 

	ЭтаФорма.ПодвалОбщийИтогПоПериодуНовоеЗначение = Формат(ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение, ФорматПодвала);
	ЭтаФорма.ПодвалОбщийИтогПоПериодуФакт = Формат(ЭтаФорма.ОбщийИтогПоПериодуФакт, ФорматПодвала);
	ЭтаФорма.ПодвалОбщийИтогПоПериодуТекущееЗначение = Формат(ЭтаФорма.ОбщийИтогПоПериодуТекущееЗначение, ФорматПодвала);
	ЭтаФорма.ПодвалОбщийИтогПоПериодуПоРоли = Формат(ЭтаФорма.ОбщийИтогПоПериодуПоРоли, ФорматПодвала);
	ЭтаФорма.ПодвалОбщийИтогПоПериодуОтклонение = Формат(ЭтаФорма.ОбщийИтогПоПериодуОтклонение, ФорматПодвала);

	ЭтаФорма.ПодвалОбщийИтогТекущееЗначение = Формат(ЭтаФорма.ОбщийИтогТекущееЗначение, ФорматПодвала);
	ЭтаФорма.ПодвалОбщийИтогНовоеЗначение = Формат(ЭтаФорма.ОбщийИтогНовоеЗначение, ФорматПодвала);
 	
КонецПроцедуры

&НаСервере
Процедура ВывестиПериодыНаФорму()
	
	МассивУдаляемых = Новый Массив;
	Для Каждого СтрокаКолонки Из КолонкиДат Цикл
		Элементы.Удалить(Элементы[СтрокаКолонки.ИмяКолонки + "Группа"]);
		МассивУдаляемых.Добавить("ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "НовоеЗначение");
		МассивУдаляемых.Добавить("ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "ТекущееЗначение");
		МассивУдаляемых.Добавить("ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "Отклонение");
		МассивУдаляемых.Добавить("ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "ПоРоли");
		МассивУдаляемых.Добавить("ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "ПоКалендарю");
		МассивУдаляемых.Добавить("ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "Факт");
		МассивУдаляемых.Добавить("ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "ДляРасчетаРазницы");		
		МассивУдаляемых.Добавить("ИтогоНовоеЗначение" + СтрокаКолонки.ИмяКолонки);
		МассивУдаляемых.Добавить("ИтогоПоРоли" + СтрокаКолонки.ИмяКолонки);
		МассивУдаляемых.Добавить("ИтогоОтклонение" + СтрокаКолонки.ИмяКолонки);
		МассивУдаляемых.Добавить("ИтогоТекущееЗначение" + СтрокаКолонки.ИмяКолонки);
		МассивУдаляемых.Добавить("ИтогоФакт" + СтрокаКолонки.ИмяКолонки);
		МассивУдаляемых.Добавить("ИтогоПоКалендарю" + СтрокаКолонки.ИмяКолонки);
		//МассивУдаляемых.Добавить("ПодвалНовоеЗначение" + СтрокаКолонки.ИмяКолонки);
		МассивУдаляемых.Добавить("ПодвалПоРоли" + СтрокаКолонки.ИмяКолонки);
		//МассивУдаляемых.Добавить("ПодвалОтклонение" + СтрокаКолонки.ИмяКолонки);
		//МассивУдаляемых.Добавить("ПодвалТекущееЗначение" + СтрокаКолонки.ИмяКолонки);		
		//МассивУдаляемых.Добавить("ПодвалФакт"+СтрокаКолонки.ИмяКолонки);
	КонецЦикла;	
	//Если МассивУдаляемых.Количество() Тогда
	//	ИзменитьРеквизиты(, МассивУдаляемых);
	//КонецЕсли;
	КолонкиДат.Очистить();	
	
	Если ПериодПоДням() Тогда  
		ТекДата = Объект.НачалоПериода;
		//ФорматЗаголовкаКолонки = "ДФ=dd.MM.yy";
		ФорматЗаголовкаКолонки = "ДФ='dd.MM ddd'";
	Иначе		
		ТекДата = НачалоМесяца(Объект.НачалоПериода);
		ФорматЗаголовкаКолонки = "ДФ='MMM yy'";
	КонецЕсли;		
	
	КЧ = Новый КвалификаторыЧисла(15, 2);
	ОписаниеТипаКолонки = Новый ОписаниеТипов("Число", КЧ);
	
	ОписаниеТипаКолонкиСтрока = Новый ОписаниеТипов("Строка");
	
	МассивРеквизитов = Новый Массив;
	Пока ТекДата <= Объект.КонецПериода Цикл
		
		ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(ТекДата);
		
		СтрокаКолонки = КолонкиДат.Добавить();
		СтрокаКолонки.Дата = ТекДата;
		СтрокаКолонки.ИмяКолонки = ИмяКолонки;
		
		СтрокиКалендаря = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", ТекДата));
		СтрокаКолонки.Выходной = СтрокиКалендаря.Количество() = 0 ИЛИ СтрокиКалендаря[0].КоличествоЧасов = 0;
		
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "НовоеЗначение", 
										ОписаниеТипаКолонки, 
										"ДеревоФормы", 
										НСтр("ru = 'Нов.'")); 
		МассивРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "ДляРасчетаРазницы", ОписаниеТипаКолонки, "ДеревоФормы"); 
		МассивРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "ТекущееЗначение", 
										ОписаниеТипаКолонки, 
										"ДеревоФормы", 
										НСтр("ru = 'Тек.'")); 
		МассивРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "Отклонение", 
										ОписаниеТипаКолонки, 
										"ДеревоФормы", 
										НСтр("ru = 'Откл.'")); 
		МассивРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "ПоРоли", 
										ОписаниеТипаКолонки, 
										"ДеревоФормы", 
										НСтр("ru = 'Роль'"));		
		МассивРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "Факт", 
										ОписаниеТипаКолонки, 
										"ДеревоФормы", 
										НСтр("ru = 'Факт'"));		
		МассивРеквизитов.Добавить(Реквизит);	
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "ПоКалендарю", 
										ОписаниеТипаКолонки, 
										"ДеревоФормы", 
										НСтр("ru = 'По календарю'"));		
		МассивРеквизитов.Добавить(Реквизит);			
		Реквизит = Новый РеквизитФормы("ИтогоНовоеЗначение" + ИмяКолонки, ОписаниеТипаКолонки); 
		МассивРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы("ИтогоПоРоли" + ИмяКолонки, ОписаниеТипаКолонки); 
		МассивРеквизитов.Добавить(Реквизит);			
		Реквизит = Новый РеквизитФормы("ИтогоОтклонение" + ИмяКолонки, ОписаниеТипаКолонки); 
		МассивРеквизитов.Добавить(Реквизит);			
		Реквизит = Новый РеквизитФормы("ИтогоТекущееЗначение" + ИмяКолонки, ОписаниеТипаКолонки); 		
		МассивРеквизитов.Добавить(Реквизит);	   
		Реквизит = Новый РеквизитФормы("ИтогоФакт" + ИмяКолонки, ОписаниеТипаКолонки); 		
		МассивРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы("ИтогоПоКалендарю" + ИмяКолонки, ОписаниеТипаКолонки); 		
		МассивРеквизитов.Добавить(Реквизит);
		//Реквизит = Новый РеквизитФормы("ПодвалНовоеЗначение" + ИмяКолонки, ОписаниеТипаКолонкиСтрока); 
		//МассивРеквизитов.Добавить(Реквизит);	
		Реквизит = Новый РеквизитФормы("ПодвалПоРоли" + ИмяКолонки, ОписаниеТипаКолонкиСтрока); 
		МассивРеквизитов.Добавить(Реквизит);	
		//Реквизит = Новый РеквизитФормы("ПодвалОтклонение" + ИмяКолонки, ОписаниеТипаКолонкиСтрока); 
		//МассивРеквизитов.Добавить(Реквизит);	
		//Реквизит = Новый РеквизитФормы("ПодвалТекущееЗначение" + ИмяКолонки, ОписаниеТипаКолонкиСтрока); 		
		//МассивРеквизитов.Добавить(Реквизит);
		//Реквизит = Новый РеквизитФормы("ПодвалФакт" + ИмяКолонки, ОписаниеТипаКолонкиСтрока); 		
		//МассивРеквизитов.Добавить(Реквизит);		
		Если ПериодПоДням() Тогда 
			ТекДата = ТекДата + 3600 * 24;
		Иначе
			ТекДата = ДобавитьМесяц(ТекДата, 1);
		КонецЕсли;
	КонецЦикла;
			
	ИзменитьРеквизиты(МассивРеквизитов, МассивУдаляемых);
	
	ФорматЭлемента = "ЧДЦ=1; ЧГ=";
	ШиринаЭлемента = 6;
	
	Для Каждого СтрокаКолонки Из КолонкиДат Цикл
		
		Группа = Элементы.Добавить(СтрокаКолонки.ИмяКолонки + "Группа", 
									Тип("ГруппаФормы"), 
									Элементы.ДеревоФормыГруппаТрудозатраты);
		Группа.Вид = ВидГруппыФормы.ГруппаКолонок;
		Группа.Заголовок = Формат(СтрокаКолонки.Дата, ФорматЗаголовкаКолонки);
		Группа.Группировка = ГруппировкаКолонок.Горизонтальная;
		Группа.ОтображатьВШапке = Истина;			
		
		Элемент = Элементы.Добавить(СтрокаКолонки.ИмяКолонки + "Факт", Тип("ПолеФормы"), Группа);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПутьКДанным = "ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "Факт";		
		Элемент.Ширина = ШиринаЭлемента;
		Элемент.Формат = ФорматЭлемента;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.ТолькоПросмотр = Истина;			
		//Элемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		//Элемент.ПутьКДаннымПодвала = "ПодвалФакт"+СтрокаКолонки.ИмяКолонки;		
		Элемент.ПутьКДаннымПодвала = "ИтогоФакт" + СтрокаКолонки.ИмяКолонки;		
		
		//Элемент = Элементы.Добавить(СтрокаКолонки.ИмяКолонки+"ПоРоли", Тип("ПолеФормы"), Группа);
		//Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		//Элемент.ПутьКДанным = "ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "ПоРоли";		
		//Элемент.Ширина = ШиринаЭлемента;
		//Элемент.Формат = ФорматЭлемента;
		//Элемент.РастягиватьПоГоризонтали = Ложь;
		//Элемент.ТолькоПросмотр = Истина;			
		////Элемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		////Элемент.ПутьКДаннымПодвала = "ПодвалПоРоли"+СтрокаКолонки.ИмяКолонки;
		//Элемент.ПутьКДаннымПодвала = "ИтогоПоРоли"+СтрокаКолонки.ИмяКолонки;
		
		Элемент = Элементы.Добавить(СтрокаКолонки.ИмяКолонки + "НовоеЗначение", Тип("ПолеФормы"), Группа);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "НовоеЗначение";		
		Элемент.Ширина = ШиринаЭлемента + 6; // обход бага, приводящего к падению
		Элемент.Формат = ФорматЭлемента;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.УстановитьДействие("ПриИзменении", "ПриИзмененииКолонки");
		//Элемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		//Элемент.ПутьКДаннымПодвала = "ПодвалНовоеЗначение"+СтрокаКолонки.ИмяКолонки;
		Элемент.ПутьКДаннымПодвала = "ИтогоНовоеЗначение" + СтрокаКолонки.ИмяКолонки;
		
		Элемент = Элементы.Добавить(СтрокаКолонки.ИмяКолонки + "ТекущееЗначение", Тип("ПолеФормы"), Группа);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПутьКДанным = "ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "ТекущееЗначение";		
		Элемент.Ширина = ШиринаЭлемента;
		Элемент.Формат = ФорматЭлемента;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.ТолькоПросмотр = Истина;		
		//Элемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		//Элемент.ПутьКДаннымПодвала = "ПодвалТекущееЗначение"+СтрокаКолонки.ИмяКолонки;		
		Элемент.ПутьКДаннымПодвала = "ИтогоТекущееЗначение" + СтрокаКолонки.ИмяКолонки;		
		
		Элемент = Элементы.Добавить(СтрокаКолонки.ИмяКолонки + "Отклонение", Тип("ПолеФормы"), Группа);
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПутьКДанным = "ДеревоФормы." + СтрокаКолонки.ИмяКолонки + "Отклонение";		
		Элемент.Ширина = ШиринаЭлемента;
		Элемент.Формат = ФорматЭлемента;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.ТолькоПросмотр = Истина;		
		//Элемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		//Элемент.ПутьКДаннымПодвала = "ПодвалОтклонение"+СтрокаКолонки.ИмяКолонки;
		Элемент.ПутьКДаннымПодвала = "ИтогоОтклонение" + СтрокаКолонки.ИмяКолонки;
		
	КонецЦикла;				

КонецПроцедуры	

&НаСервере
Функция ВыгрузитьРезультатЗапросаВДерево(РезультатЗапроса)
	
	Дерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КЧ = Новый КвалификаторыЧисла(15, 2);
	ОписаниеТипаКолонки = Новый ОписаниеТипов("Число", КЧ);
	
	ОписаниеТипаКолонкиСтрока = Новый ОписаниеТипов("Строка");
	
	Дерево.Колонки.Добавить("Группировка");
	Дерево.Колонки.Добавить("ИндексКартинки", Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("УровеньДерева", Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("ПоследнийУровень", Новый ОписаниеТипов("Булево"));	
	Дерево.Колонки.Добавить("ИмяГруппировки", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ПредставлениеЗадачи", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ИтогПоПериодуПоРоли", ОписаниеТипаКолонки);
	Дерево.Колонки.Добавить("ИтогПоПериодуТекущееЗначение", ОписаниеТипаКолонки);
	Дерево.Колонки.Добавить("ИтогПоПериодуНовоеЗначение", ОписаниеТипаКолонки);
	Дерево.Колонки.Добавить("ИтогПоПериодуОтклонение", ОписаниеТипаКолонки);
	Дерево.Колонки.Добавить("ИтогПоПериодуФакт", ОписаниеТипаКолонки);
	Дерево.Колонки.Добавить("ДатаПервойЗагруки", Новый ОписаниеТипов("Дата"));	

	Для Каждого СтрокаКолонки Из КолонкиДат Цикл
		Дерево.Колонки.Добавить(СтрокаКолонки.ИмяКолонки + "НовоеЗначение", ОписаниеТипаКолонки);	
		Дерево.Колонки.Добавить(СтрокаКолонки.ИмяКолонки + "ДляРасчетаРазницы", ОписаниеТипаКолонки);
		Дерево.Колонки.Добавить(СтрокаКолонки.ИмяКолонки + "ТекущееЗначение", ОписаниеТипаКолонки);
		Дерево.Колонки.Добавить(СтрокаКолонки.ИмяКолонки + "Отклонение", ОписаниеТипаКолонки);
		Дерево.Колонки.Добавить(СтрокаКолонки.ИмяКолонки + "ПоРоли", ОписаниеТипаКолонки);
		Дерево.Колонки.Добавить(СтрокаКолонки.ИмяКолонки + "Факт", ОписаниеТипаКолонки);
		Дерево.Колонки.Добавить(СтрокаКолонки.ИмяКолонки + "ПоКалендарю", ОписаниеТипаКолонки);
	КонецЦикла;

	Возврат Дерево;
	
КонецФункции

&НаСервере
Функция ЗагрузитьДанныеФормыИзОбъекта(ТолькоШапку = Ложь, СниматьПризнакЗаписьДляНедоступныхСтрок = Ложь) 
	
	ИзмененыСроки = КолонкиДат.Количество() = 0 ИЛИ 
		КолонкиДат[0].Дата <> Объект.НачалоПериода ИЛИ 
		КолонкиДат[КолонкиДат.Количество() - 1].Дата <> Объект.КонецПериода;

	НачалоПериодаНаФорме = Объект.НачалоПериода;
	КонецПериодаНаФорме = Объект.КонецПериода;

	УстановитьЗаголовокВыбораПериода(ЭтаФорма);

	МассивРолей = Объект.Роли.Выгрузить().ВыгрузитьКолонку("Роль");
	СписокРолей.ЗагрузитьЗначения(МассивРолей);

	МассивПодразделений = Объект.Подразделения.Выгрузить().ВыгрузитьКолонку("Подразделение");
	СписокПодразделений.ЗагрузитьЗначения(МассивПодразделений);

	МассивПроектов = Объект.Проекты.Выгрузить().ВыгрузитьКолонку("Проект");
	СписокПроектов.ЗагрузитьЗначения(МассивПроектов);

	//

	Если ТолькоШапку Тогда
		Возврат Неопределено;
	КонецЕсли;

	//

	ОчиститьДанные(ЭтаФорма);
	ОчиститьИтоги(ЭтаФорма);		

	Если ИзмененыСроки Тогда
		
		ОбновитьДопДанные();
		
		ВывестиПериодыНаФорму();				
		
		ДобавитьУФ();				
		
	КонецЕсли;
					
	МассивГруппировок = ПолучитьМассивГруппировок(Объект.ПорядокГруппировок);
	
	Отбор = Новый Структура("ТрудовойРесурс, ТипДанных", Справочники.упоТрудовыеРесурсы.ПустаяСсылка(), "НовоеЗначение");
	ТаблицаДанныеПоПериоду = Объект.РаспределениеПоПериоду.Выгрузить(Отбор);
	
	Отбор = Новый Структура("Ресурс", Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
	ТаблицаДанныеЗаПериоду = Объект.ТрудозатратыЗаПериодомПланирования.Выгрузить(Отбор);
	
	Запрос = Новый Запрос;
	УстановитьПараметрыРазграниченияДоступа(Запрос, СниматьПризнакЗаписьДляНедоступныхСтрок);
	Запрос.УстановитьПараметр("ТаблицаДанные", Объект.Данные.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаДанныеПоПериоду", ТаблицаДанныеПоПериоду);	
	Запрос.УстановитьПараметр("ТаблицаДанныеЗаПериоду", ТаблицаДанныеЗаПериоду);								

	Запрос.Текст = ТекстЗапросаДерева(МассивГруппировок);
					   
	РезультатПакета = Запрос.ВыполнитьПакет(); 				   
	
	Дерево = ВыгрузитьРезультатЗапросаВДерево(РезультатПакета[РезультатПакета.Количество()-1]);
	
	ТаблицаПоРолям = РезультатПакета[РезультатПакета.Количество()-2].Выгрузить();

	Если Объект.ПорядокГруппировок = 1 Тогда
		Отбор = Новый Структура("ТрудовойРесурс", Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
		НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
		Для Каждого Строка Из НайденныеСтроки Цикл
			Если Строка.ТрудозатратыПланДоПериода = 0 И Строка.ТрудозатратыПланПослеПериода = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекСтрока = Строка.Родитель;
			Пока ТекСтрока <> Неопределено Цикл
				ТекСтрока.ТрудозатратыПланДоПериода = 
					ТекСтрока.ТрудозатратыПланДоПериода - Строка.ТрудозатратыПланДоПериода;
				ТекСтрока.ТрудозатратыПланПослеПериода = 
					ТекСтрока.ТрудозатратыПланПослеПериода - Строка.ТрудозатратыПланПослеПериода;
				
				ТекСтрока = ТекСтрока.Родитель;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;

	СтрокиДерева = Дерево.Строки;
	ОбщийИтогФакт = СтрокиДерева.Итог("Факт");
	ОбщийИтогТрудозатратыПланДоПериода = СтрокиДерева.Итог("ТрудозатратыПланДоПериода");
	ОбщийИтогТрудозатратыПланПослеПериода = СтрокиДерева.Итог("ТрудозатратыПланПослеПериода");
	НайденныеСтроки = СтрокиДерева.НайтиСтроки(Новый Структура("ТрудовойРесурс", Справочники.упоТрудовыеРесурсы.ПустаяСсылка()));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ОбщийИтогТрудозатратыПланДоПериода = ОбщийИтогТрудозатратыПланДоПериода - НайденнаяСтрока.ТрудозатратыПланДоПериода;
		ОбщийИтогТрудозатратыПланПослеПериода = ОбщийИтогТрудозатратыПланПослеПериода - НайденнаяСтрока.ТрудозатратыПланПослеПериода;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоФормы");

	ОбновитьСтрокиНижнегоУровня(МассивГруппировок);

	Для Каждого КлючЗначение Из ЭтаФорма.мКэшЗначений.СтрокиРесурса_НижнийУровень Цикл
		Для Каждого ИД Из КлючЗначение.Значение Цикл
			СтрокаДерева = ЭтаФорма.ДеревоФормы.НайтиПоИдентификатору(ИД);
			Пока СтрокаДерева <> Неопределено Цикл
				Для Каждого СтрокаДня Из Объект.ДанныеКалендаря Цикл
					ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(СтрокаДня.День);	
					
					СтрокаДерева[ИмяКолонки + "ПоКалендарю"] = СтрокаДня.КоличествоЧасов;
					ЭтаФорма["ИтогоПоКалендарю" + ИмяКолонки] = ЭтаФорма["ИтогоПоКалендарю" + ИмяКолонки] + СтрокаДня.КоличествоЧасов;
				КонецЦикла;
				
				СтрокаДерева = СтрокаДерева.ПолучитьРодителя();
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
			
	РекурсивноЗаполнитьДерево(ЭтаФорма, Объект, ДеревоФормы.ПолучитьЭлементы(), 0, МассивГруппировок);

	СчитатьВычисляемыеИтогиДерева(ЭтаФорма);

	Если Объект.ПорядокГруппировок = 2 Тогда
		ЭлементыДерева = ДеревоФормы.ПолучитьЭлементы();
		Для Каждого Элемент Из ЭлементыДерева Цикл
			Если ЗначениеЗаполнено(Элемент.ТрудовойРесурс) Тогда
				СортроватьСтрокиПоДатеПервойЗагрузки(ЭтаФорма, Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//СтрокиВыходных = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("КоличествоЧасов", 0));
	//Для Каждого СтрокаВыходного Из СтрокиВыходных Цикл
	//	ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(СтрокаВыходного.День);
	//	Элемент = Элементы.Найти(ИмяКолонки+"Группа");
	//	Если Элемент <> Неопределено Тогда
	//		Элемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	//	КонецЕсли;
	//КонецЦикла;	

	ПосчитатьОбщийИтогПоРоли(ТаблицаПоРолям);

	ОбновитьПодвалИтогов(ЭтаФорма);

	упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурсам");
	ПостроитьДиаграммуГанта(ЭтаФорма);

КонецФункции

&НаСервере
Процедура УстановитьПараметрыРазграниченияДоступа(Запрос, Знач СниматьПризнакЗаписьДляНедоступныхСтрок = Ложь)

	ЭтаФорма.ОтключитьРазграничениеДоступаКДокументам = 
		упоРазграничениеДоступаВызовСервера.РазграничениеДоступаОтключено();		
	Если ОтключитьРазграничениеДоступаКДокументам Тогда
		СниматьПризнакЗаписьДляНедоступныхСтрок = Ложь;
	КонецЕсли;	
		
	СписокСотрудниковДиспетчера = ПараметрыСеанса.упоСписокСотрудниковДиспетчера;	

	СтатусыНеРедактируемыхЗадач = Новый Массив;
	СтатусыНеРедактируемыхЗадач.Добавить(ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Завершена"));
	СтатусыНеРедактируемыхЗадач.Добавить(ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта"));		
	СтатусыНеРедактируемыхЗадач.Добавить(ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.ПустаяСсылка"));

	Запрос.УстановитьПараметр("ОтключитьРазграничениеДоступаКДокументам", ОтключитьРазграничениеДоступаКДокументам);					
	Запрос.УстановитьПараметр("СниматьПризнакЗаписьДляНедоступныхСтрок", СниматьПризнакЗаписьДляНедоступныхСтрок);					
	Запрос.УстановитьПараметр("СтатусыНеРедактируемыхЗадач", СтатусыНеРедактируемыхЗадач);					
	Запрос.УстановитьПараметр("СписокСотрудниковДиспетчера", СписокСотрудниковДиспетчера);					

КонецПроцедуры	

&НаСервере
Процедура ПосчитатьОбщийИтогПоРоли(ТаблицаПоРолям) 

	ОбщийИтогПоРоли = 0;
	ТаблицаОбщийИтог = ТаблицаПоРолям.Скопировать();
	ОтборПустойТР = Новый Структура("ТрудовойРесурс", Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
	НайденныеСтроки = ТаблицаОбщийИтог.НайтиСтроки(ОтборПустойТР);
	Для Каждого Строка Из НайденныеСтроки Цикл
		ТаблицаОбщийИтог.Удалить(Строка);
	КонецЦикла;	
	ТаблицаОбщийИтог.Свернуть("Подразделение, Роль, ПроектнаяЗадачаЗеркало, ИтогПоРоли");

	Для Каждого СтрокаТаблицы Из ТаблицаОбщийИтог Цикл
		ОбщийИтогПоРоли = ОбщийИтогПоРоли + СтрокаТаблицы.ИтогПоРоли;	
	КонецЦикла;

	ОбщийИтогПоПериодуПоРоли = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз.Дата КАК Дата,
	               |	тз.Значение КАК Значение,
	               |	тз.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	тз.Роль КАК Роль
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	&тз КАК тз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт.Дата КАК Дата,
	               |	вт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	вт.Роль КАК Роль,
	               |	МАКСИМУМ(вт.Значение) КАК Значение
	               |ПОМЕСТИТЬ вт_ПоРоли
	               |ИЗ
	               |	вт КАК вт
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	вт.Дата,
	               |	вт.ПроектнаяЗадача,
	               |	вт.Роль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(вт_ПоРоли.Значение) КАК Значение
	               |ИЗ
	               |	вт_ПоРоли КАК вт_ПоРоли";
	Запрос.УстановитьПараметр("тз", Объект.РаспределениеПоПериоду.Выгрузить(Новый Структура("ТипДанных", "ПоРоли")));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщийИтогПоПериодуПоРоли = Выборка.Значение;	
	КонецЕсли;

	СопоставитьИтогПоРоли(ДеревоФормы, ТаблицаПоРолям, Новый Структура);																	

КонецПроцедуры

&НаСервере
Процедура СопоставитьИтогПоРоли(ВходящийЭлементДерева, ТаблицаПоРолям, ТекущийОтбор) 

	СтруктураОтборУровня = Новый Структура;
	Для Каждого КлючЗначение Из ТекущийОтбор Цикл
		СтруктураОтборУровня.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
	КонецЦикла;

	ОтборПустойТР = Новый Структура("ТрудовойРесурс", Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
	Для Каждого ЭлементДерева Из ВходящийЭлементДерева.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ПоследнийУровень Тогда
			Прервать;
		КонецЕсли;
		//Если ЭлементДерева.ИмяГруппировки <> "ТрудовойРесурс" Тогда
		СтруктураОтборУровня.Вставить(ЭлементДерева.ИмяГруппировки, ЭлементДерева.Группировка);
		//КонецЕсли;
		//СтрокиОтбора = ТаблицаПоРолям.НайтиСтроки(СтруктураОтборУровня);
		ТаблицаОтбора = ТаблицаПоРолям.Скопировать(СтруктураОтборУровня);
		Если Объект.ПорядокГруппировок = 1 И ЭлементДерева.ИмяГруппировки <> "ТрудовойРесурс" Тогда			
			НайденныеСтроки = ТаблицаОтбора.НайтиСтроки(ОтборПустойТР);
			Для Каждого Строка Из НайденныеСтроки Цикл
				ТаблицаОтбора.Удалить(Строка);
			КонецЦикла;	
		КонецЕсли;
		ТаблицаОтбора.Свернуть("Подразделение, Роль, ПроектнаяЗадачаЗеркало, ИтогПоРоли, Проект");
		ЭлементДерева.ИтогПоРоли = 0;
		Для Каждого СтрокаОтбора Из ТаблицаОтбора Цикл
			ЭлементДерева.ИтогПоРоли = ЭлементДерева.ИтогПоРоли + СтрокаОтбора.ИтогПоРоли;
		КонецЦикла;
		СопоставитьИтогПоРоли(ЭлементДерева, ТаблицаПоРолям, СтруктураОтборУровня);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПостроитьДиаграммуГанта(ЭтаФорма) 

	Если НЕ ЭтаФорма.Объект.ПоказатьДиаграммуГанта Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДеревоФормы.ПолучитьЭлементы()) Тогда
		Возврат;	
	КонецЕсли;

	Диаграмма = ЭтаФорма.ДиаграммаГанта; 	
	Диаграмма.Очистить();	

	Диаграмма.Обновление = Ложь;
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;	
	Диаграмма.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;	
	Диаграмма.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.Право;

	Пока Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Количество() > 1 Цикл
		Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Удалить(Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[1]);
	КонецЦикла;
	Шкала1 = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала1.Единица = ТипЕдиницыШкалыВремени.Неделя;
	Шкала2 = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	Шкала2.Единица = ТипЕдиницыШкалыВремени.День;
	Шкала2.ФорматДня = ФорматДняШкалыВремени.ДеньМесяца;	
		
	СерияНовоеЗначение = Диаграмма.УстановитьСерию(НСтр("ru = 'Новые значения'"));
	СерияНовоеЗначение.Цвет = Новый Цвет(225,255,225);
	Если ЭтаФорма.Объект.ПоказыватьТекущиеЗначенияНаДГ Тогда 		
		СерияТекущееЗначение = Диаграмма.УстановитьСерию(НСтр("ru = 'Текущие значения'"));
		СерияТекущееЗначение.Цвет = Новый Цвет(220,220,220);
	КонецЕсли;

	СписокСтрокПЗ = Новый СписокЗначений;

	Если ЗначениеЗаполнено(ЭтаФорма.РесурсДиаграммыПоРесурсу) И ЭтаФорма.Объект.ПорядокГруппировок = 2 Тогда
		ЭлементыДерева = ЭтаФорма.ДеревоФормы.ПолучитьЭлементы();
		МассивОбрПЗ = Новый Массив;
		Для Каждого Элемент Из ЭлементыДерева Цикл
			Если Элемент.ТрудовойРесурс = ЭтаФорма.РесурсДиаграммыПоРесурсу Тогда
				ЭлементыТР = Элемент.ПолучитьЭлементы();
				Для Каждого ЭлементТР Из ЭлементыТР Цикл
					Если НЕ ЗначениеЗаполнено(ЭлементТР.ПроектнаяЗадача) ИЛИ МассивОбрПЗ.Найти(ЭлементТР.ПроектнаяЗадача) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					СписокСтрокПЗ.Добавить(Новый Структура("ПЗ, ИдСтроки", ЭлементТР.ПроектнаяЗадача, ЭлементТР.ПолучитьИдентификатор()));	
					МассивОбрПЗ.Добавить(ЭлементТР.ПроектнаяЗадача);
				КонецЦикла;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе           		
		Для Каждого КлючЗначение Из ЭтаФорма.мКэшЗначений.СтрокиПЗ_УровеньПЗ Цикл
			ПЗ = КлючЗначение.Ключ;			
			Если Не ЗначениеЗаполнено(ПЗ) Тогда
				Продолжить;
			КонецЕсли;
			ИдСтроки = КлючЗначение.Значение[0];
			СтрокаПЗ = ЭтаФорма.ДеревоФормы.НайтиПоИдентификатору(ИдСтроки);
			СписокСтрокПЗ.Добавить(Новый Структура("ПЗ, ИдСтроки", ПЗ, ИдСтроки), "" + СтрокаПЗ.КодПроекта + СтрокаПЗ.КодСДР);
		КонецЦикла;
		СписокСтрокПЗ.СортироватьПоПредставлению();
	КонецЕсли;

	Для Каждого ДанныеПЗ Из СписокСтрокПЗ Цикл
		
		ПЗ = ДанныеПЗ.Значение.ПЗ;	
		
		ИдСтроки = ДанныеПЗ.Значение.ИдСтроки;
		СтрокаПЗ = ЭтаФорма.ДеревоФормы.НайтиПоИдентификатору(ИдСтроки);
				
		Точка = Диаграмма.УстановитьТочку(СтрокаПЗ.ПроектнаяЗадачаЗеркало);		
		Точка.Текст = "" + СтрокаПЗ.КодСДР + " " + СтрокаПЗ.ПроектнаяЗадачаЗеркало + " ["+СтрокаПЗ.Проект+"]";
		Точка.Расшифровка = СтрокаПЗ.ПроектнаяЗадачаЗеркало;
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, СерияНовоеЗначение);
		Интервал = Значение.Добавить();
		Интервал.Начало = ?(ЗначениеЗаполнено(СтрокаПЗ.ДатаНачалаНП), СтрокаПЗ.ДатаНачалаНП, СтрокаПЗ.ДатаНачалаТП);
		Интервал.Конец = КонецДня(?(ЗначениеЗаполнено(СтрокаПЗ.ДатаЗавершенияНП), СтрокаПЗ.ДатаЗавершенияНП, СтрокаПЗ.ДатаЗавершенияТП));
		Значение.Текст = НСтр("ru = 'Новое значение'")+" ["+Формат(Интервал.Начало, "ДФ=dd.MM.yy")+"-"+Формат(Интервал.Конец, "ДФ=dd.MM.yy")+"]";
		Интервал.Текст = Значение.Текст;      	
		
		Если ЭтаФорма.Объект.ПоказыватьТекущиеЗначенияНаДГ Тогда
			Значение = Диаграмма.ПолучитьЗначение(Точка, СерияТекущееЗначение);
			Интервал = Значение.Добавить();
			Интервал.Начало = СтрокаПЗ.ДатаНачалаТП;
			Интервал.Конец = КонецДня(СтрокаПЗ.ДатаЗавершенияТП);
			Значение.Текст = НСтр("ru = 'Текущее значение'")+" ["+Формат(Интервал.Начало, "ДФ=dd.MM.yy")+"-"+Формат(Интервал.Конец, "ДФ=dd.MM.yy")+"]";
			Интервал.Текст = Значение.Текст;
		КонецЕсли;
				
	КонецЦикла;

	Диаграмма.УстановитьПолныйИнтервал(ЭтаФорма.НачалоПериодаНаФорме, КонецДня(ЭтаФорма.КонецПериодаНаФорме));
	Диаграмма.Обновление = Истина;	

	//упоПечатьДиаграммыГанта.УниверсальноНапечататьДиаграммуГанта(Диаграмма, "", ЭтаФорма.ДГДок);

	//п = ПолучитьИнформациюЭкрановКлиента();

КонецПроцедуры

&НаСервере
Функция ДобавитьУФ() 

	сч = ЭтаФорма.УсловноеОформление.Элементы.Количество() - 1;
	Пока сч >= 0 Цикл
		Элемент = ЭтаФорма.УсловноеОформление.Элементы[сч];
		Если Найти(Элемент.Представление, "#СЛУЖЕБНЫЙ#") <> 0 Тогда
			ЭтаФорма.УсловноеОформление.Элементы.Удалить(Элемент);	
		ИначеЕсли Найти(Элемент.Представление, "#РЕДАКТИРУЕМЫЕКОЛОНКИ#") <> 0 Тогда
			УО_РедактируемыеКолонки = Элемент;
		КонецЕсли;
		сч = сч - 1;
	КонецЦикла;

	ЦветКрасный = Новый Цвет(255, 182, 113);

	Для Каждого СтрокаКолонки Из КолонкиДат Цикл
		
		НовоеПоле = УО_РедактируемыеКолонки.Поля.Элементы.Добавить();
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"НовоеЗначение");

		//
		
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Вставить(0);
		НовыйЭлементУО.Представление = "#СЛУЖЕБНЫЙ#ПерегрузкаНовоеЗначение"; 
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		
		НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ИмяГруппировки");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементУООтбор.ПравоеЗначение = "ТрудовойРесурс";
		
		НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПорядокГруппировок");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлементУООтбор.ПравоеЗначение = 1;		
		
		НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы."+СтрокаКолонки.ИмяКолонки+"НовоеЗначение");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		НовыйЭлементУООтбор.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы."+СтрокаКолонки.ИмяКолонки+"ПоКалендарю");			
		
		НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"НовоеЗначение");	
		
		//
		
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Вставить(0);
		НовыйЭлементУО.Представление = "#СЛУЖЕБНЫЙ#ПерегрузкаТекущееЗначение"; 
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		
		НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ИмяГруппировки");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементУООтбор.ПравоеЗначение = "ТрудовойРесурс";
		
		НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПорядокГруппировок");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлементУООтбор.ПравоеЗначение = 1;		
		
		НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы."+СтрокаКолонки.ИмяКолонки+"ТекущееЗначение");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		НовыйЭлементУООтбор.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы."+СтрокаКолонки.ИмяКолонки+"ПоКалендарю");			
		
		НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"ТекущееЗначение");		
		
		////
		//
		//НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Вставить(0);
		//НовыйЭлементУО.Представление = "#СЛУЖЕБНЫЙ#ЯчейкаВСрокЗадачи"; 
		//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоНебесноГолубой);
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ИмяГруппировки");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлементУООтбор.ПравоеЗначение = "ПроектнаяЗадачаЗеркало";
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ДатаНачалаТП");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		//НовыйЭлементУООтбор.ПравоеЗначение = СтрокаКолонки.Дата;	
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.Редактируется");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлементУООтбор.ПравоеЗначение = Истина;	
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ДатаЗавершенияТП");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		//НовыйЭлементУООтбор.ПравоеЗначение = СтрокаКолонки.Дата;			
		//
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"НовоеЗначение");
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"Отклонение");
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"ПоРоли");
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"ТекущееЗначение");
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"Факт");		
		
		////
		//
		//НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Вставить(0);
		//НовыйЭлементУО.Представление = "#СЛУЖЕБНЫЙ#ЯчейкаЗаполненаЗаСрокамиЗадачи"; 
		//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветКрасный);
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ИмяГруппировки");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлементУООтбор.ПравоеЗначение = "ПроектнаяЗадачаЗеркало";
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ДатаЗавершенияТП");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
		//НовыйЭлементУООтбор.ПравоеЗначение = СтрокаКолонки.Дата;
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.Редактируется");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлементУООтбор.ПравоеЗначение = Истина;			
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы."+СтрокаКолонки.ИмяКолонки+"НовоеЗначение");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		//НовыйЭлементУООтбор.ПравоеЗначение = 0;
		//
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"НовоеЗначение");	
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"Отклонение");
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"ПоРоли");
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"ТекущееЗначение");
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки+"Факт");		
		//
		//
		
		//НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Вставить(0);
		//НовыйЭлементУО.Представление = "#СЛУЖЕБНЫЙ#ЕстьЯчейкиЗаСрокамиЗадачи"; 
		//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ИмяГруппировки");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		//НовыйЭлементУООтбор.ПравоеЗначение = "ПроектнаяЗадачаЗеркало";
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы.ДатаЗавершенияТП");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
		//НовыйЭлементУООтбор.ПравоеЗначение = СтрокаКолонки.Дата;	
		//
		//НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		//НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФормы."+СтрокаКолонки.ИмяКолонки+"НовоеЗначение");
		//НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		//НовыйЭлементУООтбор.ПравоеЗначение = 0;
		//
		//НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		//НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоФормыДатаЗавершенияТП");			
		
	КонецЦикла;				

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеЗадачиВСтрокеДерева(СтрокаДерева) 
	
	ПредставлениеЗадачи = "" + СтрокаДерева.КодСДР + " " + СтрокаДерева.ПроектнаяЗадачаЗеркало;
	//ПредставлениеЗадачи = ПредставлениеЗадачи + " ";
	Если ЗначениеЗаполнено(СтрокаДерева.Роль) Тогда
		ПредставлениеЗадачи = ПредставлениеЗадачи + " (" + СтрокаДерева.Роль + ")";
	КонецЕсли;
	ПредставлениеЗадачи = ПредставлениеЗадачи + " [" + СтрокаДерева.Проект + "]";
	
	Возврат ПредставлениеЗадачи; 	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РекурсивноЗаполнитьДерево(ЭтаФорма, тОбъект, Строки, СчетчикГруппировки, МассивГруппировок, ПоследняяГруппировка = Неопределено) 

	Если ПоследняяГруппировка = Неопределено Тогда
		ПоследняяГруппировка = МассивГруппировок[МассивГруппировок.Количество()-1];
	КонецЕсли;

	ИмяГруппировки = МассивГруппировок[СчетчикГруппировки];

	ЭтоПоследняяГруппировка = ИмяГруппировки = ПоследняяГруппировка; 

	Для Каждого СтрокаДерева Из Строки Цикл	
		
		СтрокаДерева.Группировка = СтрокаДерева[ИмяГруппировки];     
		СтрокаДерева.ИмяГруппировки = ИмяГруппировки;     
		//СтрокаДерева.УровеньДерева = СтрокаДерева.Уровень();
		СтрокаДерева.УровеньДерева = СчетчикГруппировки;
						
		// Сводное выражение УО формы для блеклых строк приведено к логической форме CNF.
		// Не ((Редактируется И НЕ ЕстьПраваНаРедактирование)
		//		ИЛИ (ЭтоСтрокаОстатка И НЕ ЕстьПраваНаРедактирование)
		//		ИЛИ (НЕ Редактируется И НЕ ЭтоСтрокаОстатка));				
		ЯркаяКартинка = СтрокаДерева.ЕстьПраваНаРедактирование 
			И (СтрокаДерева.Редактируется ИЛИ СтрокаДерева.ЭтоСтрокаОстатка);
		
		СтрокаДерева.ИндексКартинки = 
			упоРаботаСФормамиКлиентСервер.ИндексКартинкиДокументаПланирования(ИмяГруппировки, СтрокаДерева, ЯркаяКартинка);
		
		Если ИмяГруппировки = "ПроектнаяЗадачаЗеркало" И ЗначениеЗаполнено(СтрокаДерева.ПроектнаяЗадачаЗеркало) Тогда
			СтрокаДерева.ПредставлениеЗадачи = ПредставлениеЗадачиВСтрокеДерева(СтрокаДерева);  
		КонецЕсли;    
		
		Если (ИмяГруппировки = "ПроектнаяЗадачаЗеркало" ИЛИ ИмяГруппировки = "Проект") И НЕ ЗначениеЗаполнено(СтрокаДерева[ИмяГруппировки]) Тогда
			СтрокаДерева.ПредставлениеЗадачи = НСтр("ru = 'Нет назначенной ПЗ'");
			Если ЗначениеЗаполнено(СтрокаДерева.Роль) Тогда
				СтрокаДерева.ПредставлениеЗадачи = СтрокаДерева.ПредставлениеЗадачи + " (" + СтрокаДерева.Роль + ")";
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоПоследняяГруппировка Тогда
						
			СтрокаДерева.ПоследнийУровень = Истина;
			
			Отбор = Новый Структура("ТрудовойРесурс, Роль, ПроектнаяЗадача, Подразделение");
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаДерева); 
					
			Отбор.Вставить("ТипДанных", "ТекущееЗначение");	
			СтрокиРаспределения = тОбъект.РаспределениеПоПериоду.НайтиСтроки(Отбор);	
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл			
				ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(СтрокаРаспределения.Дата);									
				УстановитьЗначениеЯчейки(ЭтаФорма, СтрокаДерева, ИмяКолонки, "ТекущееЗначение", СтрокаРаспределения.Значение);				
			КонецЦикла;	
			
			//
				
			Отбор.Вставить("ТипДанных", "НовоеЗначение");	
			СтрокиРаспределения = тОбъект.РаспределениеПоПериоду.НайтиСтроки(Отбор);
			СтрокаДерева.ДатаПервойЗагруки = тОбъект.КонецПериода + 24*3600;
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл	
				Если ЗначениеЗаполнено(СтрокаРаспределения.Значение) Тогда
					СтрокаДерева.ДатаПервойЗагруки = Мин(СтрокаРаспределения.Дата, СтрокаДерева.ДатаПервойЗагруки);
				КонецЕсли;
				ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(СтрокаРаспределения.Дата);									
				ЗаполнитьТрудозатраты(ЭтаФорма, СтрокаДерева, ИмяКолонки, СтрокаРаспределения.Значение, Истина, Ложь, Ложь);					
			КонецЦикла;	
			
			//
			
			Отбор.Вставить("ТипДанных", "Факт");	
			СтрокиРаспределения = тОбъект.РаспределениеПоПериоду.НайтиСтроки(Отбор);
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл			
				ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(СтрокаРаспределения.Дата);									
				УстановитьЗначениеЯчейки(ЭтаФорма, СтрокаДерева, ИмяКолонки, "Факт", СтрокаРаспределения.Значение);	
			КонецЦикла;				
				
			//
			
			Отбор = Новый Структура("Роль, ПроектнаяЗадача, Подразделение");
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаДерева);
			Отбор.Вставить("ТипДанных", "ПоРоли");	
			
			Если тОбъект.ПорядокГруппировок = 1 Тогда
				Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
					Родитель = СтрокаДерева.ПолучитьРодителя();
				Иначе
					Родитель = СтрокаДерева.Родитель;
				КонецЕсли;		
				УчитыватьВОбщемИтоге = Родитель.ИтогПоПериодуПоРоли = 0 И ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс);
			Иначе	
				УчитыватьВОбщемИтоге = ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс);
			КонецЕсли;	
			СтрокиРаспределения = тОбъект.РаспределениеПоПериоду.НайтиСтроки(Отбор);						
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
				
				ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(СтрокаРаспределения.Дата);			
				
				УстановитьЗначениеЯчейки(ЭтаФорма, СтрокаДерева, ИмяКолонки, 
													"ПоРоли", СтрокаРаспределения.Значение,,Истина, УчитыватьВОбщемИтоге);
						
			КонецЦикла;																
						
		Иначе
			
			РекурсивноЗаполнитьДерево(ЭтаФорма, тОбъект, СтрокаДерева.ПолучитьЭлементы(), СчетчикГруппировки+1, МассивГруппировок, ПоследняяГруппировка);			
			
		КонецЕсли;
		
		
		СчитатьВычисляемыеИтогиСтроки(СтрокаДерева);
		
	КонецЦикла;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьЗначениеЯчейки(ЭтаФорма, СтрокаДерева, ИмяОсновнойКолонки, ТипКолонки, 
																НовоеЗначение, УчитыватьТекЗначение = Истина, 
																УстанавливатьВГруппировкахТекЗначение = Ложь,
																УчитыватьВОбщемИтоге = Истина) 	
	Если УчитыватьТекЗначение Тогда
		ТекЗначение = СтрокаДерева[ИмяОсновнойКолонки+ТипКолонки];
		Изменение = НовоеЗначение - ТекЗначение; 
	Иначе
		Изменение = НовоеЗначение;
	КонецЕсли;

	ТекСтрока = СтрокаДерева;

	Если УстанавливатьВГруппировкахТекЗначение Тогда
		сч = 0;
	КонецЕсли;
		
	Пока ТекСтрока <> Неопределено Цикл
		
		Если УстанавливатьВГруппировкахТекЗначение И Не ТекСтрока.ПоследнийУровень Тогда 
			
			Если ЭтаФорма.Объект.ПорядокГруппировок = 1 И ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда
				ТекСтрока[ИмяОсновнойКолонки+ТипКолонки] = ТекСтрока[ИмяОсновнойКолонки+ТипКолонки] + Изменение;
				Если ТипКолонки <> "ПоРоли" Или (ТипКолонки = "ПоРоли" И УчитыватьВОбщемИтоге) Тогда
					ТекСтрока["ИтогПоПериоду"+ТипКолонки] = ТекСтрока["ИтогПоПериоду"+ТипКолонки] + Изменение;
				
					Если сч = 0 И УстанавливатьВГруппировкахТекЗначение И УчитыватьВОбщемИтоге Тогда
						ЭтаФорма["Итого"+ТипКолонки+ИмяОсновнойКолонки] = ЭтаФорма["Итого"+ТипКолонки+ИмяОсновнойКолонки] + Изменение;
						ЭтаФорма["ОбщийИтогПоПериоду"+ТипКолонки] = ЭтаФорма["ОбщийИтогПоПериоду"+ТипКолонки] + Изменение;
					КонецЕсли;
				КонецЕсли;	
			ИначеЕсли Не ЭтаФорма.Объект.ПорядокГруппировок = 1 Тогда//И ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда
				ТекСтрока[ИмяОсновнойКолонки+ТипКолонки] = ТекСтрока[ИмяОсновнойКолонки+ТипКолонки] + Изменение;		
				ТекСтрока["ИтогПоПериоду"+ТипКолонки] = ТекСтрока["ИтогПоПериоду"+ТипКолонки] + Изменение;
				
				Если сч = 0 И УстанавливатьВГруппировкахТекЗначение И УчитыватьВОбщемИтоге Тогда
					ЭтаФорма["Итого"+ТипКолонки+ИмяОсновнойКолонки] = ЭтаФорма["Итого"+ТипКолонки+ИмяОсновнойКолонки] + Изменение;
					ЭтаФорма["ОбщийИтогПоПериоду"+ТипКолонки] = ЭтаФорма["ОбщийИтогПоПериоду"+ТипКолонки] + Изменение;
				КонецЕсли;
			КонецЕсли;	
			
			сч = сч + 1;

		Иначе
			
			ТекСтрока[ИмяОсновнойКолонки+ТипКолонки] = ТекСтрока[ИмяОсновнойКолонки+ТипКолонки] + Изменение;	
			ТекСтрока["ИтогПоПериоду"+ТипКолонки] = ТекСтрока["ИтогПоПериоду"+ТипКолонки] + Изменение;	
			
		КонецЕсли;
			
		Если ТипЗнч(ТекСтрока) = Тип("ДанныеФормыЭлементДерева") Тогда
			ТекСтрока = ТекСтрока.ПолучитьРодителя();
		Иначе
			ТекСтрока = ТекСтрока.Родитель;
		КонецЕсли;		
		
	КонецЦикла;	

	Если НЕ УстанавливатьВГруппировкахТекЗначение Тогда	
		ЭтаФорма["Итого"+ТипКолонки+ИмяОсновнойКолонки] = ЭтаФорма["Итого"+ТипКолонки+ИмяОсновнойКолонки] + Изменение;		
		ЭтаФорма["ОбщийИтогПоПериоду"+ТипКолонки] = ЭтаФорма["ОбщийИтогПоПериоду"+ТипКолонки] + Изменение;
	КонецЕсли;

	//ЭтаФорма["Подвал"+ТипКолонки+ИмяОсновнойКолонки] = Формат(ЭтаФорма["Итого"+ТипКолонки+ИмяОсновнойКолонки], "ЧДЦ=1; ЧН=");
	ЭтаФорма["ПодвалОбщийИтогПоПериоду"+ТипКолонки] = Формат(ЭтаФорма["ОбщийИтогПоПериоду"+ТипКолонки], "ЧДЦ=1; ЧН=");	

КонецФункции

&НаКлиенте
Функция РазвернутьДерево() 

	упоОперацииСДеревьямиКлиент.РазвернутьСтрокиДерева(ЭтаФорма, "ДеревоФормы");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТрудозатраты(ЭтаФорма, СтрокаДерева, Знач ИмяКолонки, ЗначениеТрудозатрат = Неопределено,
	СчитатьИтогиСтроки = Истина, СчитатьИтогиДерева = Истина, ИнтерактивноеИзменение = Истина) 
	
	ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоИмениЭлемента(ИмяКолонки);	
	Если ИмяКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеТрудозатрат <> Неопределено Тогда		
		СтрокаДерева[ИмяКолонки+"НовоеЗначение"] = ЗначениеТрудозатрат;
	Иначе
		ЗначениеТрудозатрат = СтрокаДерева[ИмяКолонки+"НовоеЗначение"];
	КонецЕсли;

	ПредыдущееЗначение = СтрокаДерева[ИмяКолонки+"ДляРасчетаРазницы"];
	Разница = ЗначениеТрудозатрат - ПредыдущееЗначение;

	Если Разница = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ИнтерактивноеИзменение Тогда
		Если НужноОбновитьДатыПЗ(ЭтаФорма, СтрокаДерева, ИмяКолонки) Тогда
			ОпределитьНовыеДатыПЗ(ЭтаФорма, СтрокаДерева.ПроектнаяЗадачаЗеркало);			
			СортроватьСтрокиПоДатеПервойЗагрузки(ЭтаФорма, СтрокаДерева.ПолучитьРодителя());
		КонецЕсли;
	КонецЕсли;

	ТекСтрока = СтрокаДерева;

	Пока ТекСтрока <> Неопределено Цикл
		
		Если ТекСтрока.ИмяГруппировки = "ТрудовойРесурс" И ЭтаФорма.Объект.ПорядокГруппировок = 2 И ИнтерактивноеИзменение Тогда

			Превышение = ?(ТекСтрока[ИмяКолонки + "НовоеЗначение"] > ТекСтрока[ИмяКолонки + "ПоКалендарю"],
							ТекСтрока[ИмяКолонки + "НовоеЗначение"] - ТекСтрока[ИмяКолонки + "ПоКалендарю"],
							0);
			Простой = ?(ТекСтрока[ИмяКолонки + "НовоеЗначение"] < ТекСтрока[ИмяКолонки + "ПоКалендарю"],
							ТекСтрока[ИмяКолонки + "ПоКалендарю"] - ТекСтрока[ИмяКолонки + "НовоеЗначение"],
							0);	
			ЭтаФорма.ОбщаяНедозагрузка = Макс(ЭтаФорма.ОбщаяНедозагрузка - Простой, 0);							
	 		ЭтаФорма.ОбщаяПерегрузка = ЭтаФорма.ОбщаяПерегрузка - Превышение;
			
		КонецЕсли;
		
		Если Не ТекСтрока.ПоследнийУровень И Не (ЭтаФорма.Объект.ПорядокГруппировок = 1 И Не ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс)) Тогда
			ТекСтрока[ИмяКолонки+"НовоеЗначение"] = ТекСтрока[ИмяКолонки+"НовоеЗначение"] + Разница;	
		КонецЕсли;		
						
		ТекСтрока[ИмяКолонки+"Отклонение"] = ТекСтрока[ИмяКолонки+"НовоеЗначение"] - ТекСтрока[ИмяКолонки+"ТекущееЗначение"];		
		Если Не (ЭтаФорма.Объект.ПорядокГруппировок = 1 
			И Не ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) 
			И Не ТекСтрока.ПоследнийУровень) Тогда
			
			ТекСтрока[ИмяКолонки+"ДляРасчетаРазницы"] = ТекСтрока[ИмяКолонки+"ДляРасчетаРазницы"] + Разница;		
			ТекСтрока.ИтогПоПериодуНовоеЗначение = ТекСтрока.ИтогПоПериодуНовоеЗначение + Разница;
			
		КонецЕсли;	
		ТекСтрока.ИтогПоПериодуОтклонение =  ТекСтрока.ИтогПоПериодуНовоеЗначение - ТекСтрока.ИтогПоПериодуТекущееЗначение;
		
		Если СчитатьИтогиСтроки Тогда
			СчитатьВычисляемыеИтогиСтроки(ТекСтрока);	
		КонецЕсли;		
		
		Если ТекСтрока.ИмяГруппировки = "ТрудовойРесурс" И ЭтаФорма.Объект.ПорядокГруппировок = 2 Тогда
			Превышение = ?(ТекСтрока[ИмяКолонки+"НовоеЗначение"] > ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							ТекСтрока[ИмяКолонки+"НовоеЗначение"] - ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							0);
			Простой = ?(ТекСтрока[ИмяКолонки+"НовоеЗначение"] < ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							ТекСтрока[ИмяКолонки+"ПоКалендарю"] - ТекСтрока[ИмяКолонки+"НовоеЗначение"],
							0);	
			ЭтаФорма.ОбщаяНедозагрузка = ЭтаФорма.ОбщаяНедозагрузка + Простой;							
			ЭтаФорма.ОбщаяПерегрузка = ЭтаФорма.ОбщаяПерегрузка + Превышение;
		КонецЕсли;
		
		Если ТипЗнч(ТекСтрока) = Тип("ДанныеФормыЭлементДерева") Тогда
			ТекСтрока = ТекСтрока.ПолучитьРодителя();
		Иначе
			ТекСтрока = ТекСтрока.Родитель;
		КонецЕсли;		
		
	КонецЦикла;

	Если ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда 
		ЭтаФорма["ИтогоНовоеЗначение" + ИмяКолонки] = ЭтаФорма["ИтогоНовоеЗначение" + ИмяКолонки] + Разница;						
		ЭтаФорма["ИтогоОтклонение" + ИмяКолонки] = ЭтаФорма["ИтогоНовоеЗначение" + ИмяКолонки] - ЭтаФорма["ИтогоТекущееЗначение" + ИмяКолонки];	
		
		ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение = ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение + Разница; 
		ЭтаФорма.ОбщийИтогПоПериодуОтклонение = ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение - ЭтаФорма.ОбщийИтогПоПериодуТекущееЗначение; 	
	КонецЕсли;	

	Если СчитатьИтогиДерева Тогда 
		СчитатьВычисляемыеИтогиДерева(ЭтаФорма);
		ОбновитьПодвалИтогов(ЭтаФорма);
		упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурсам", ИмяКолонки);		
		ПостроитьДиаграммуГанта(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТрудозатраты(ЭтаФорма, СтрокаДерева, Знач ИмяКолонки, ЗначениеТрудозатрат = Неопределено,
	СчитатьИтогиСтроки = Истина, СчитатьИтогиДерева = Истина, ИнтерактивноеИзменение = Истина, ИзменениеЯчейки = Ложь) 
	
	ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоИмениЭлемента(ИмяКолонки);	
	Если ИмяКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеТрудозатрат <> Неопределено Тогда		
		СтрокаДерева[ИмяКолонки+"НовоеЗначение"] = ЗначениеТрудозатрат;
	Иначе
		ЗначениеТрудозатрат = СтрокаДерева[ИмяКолонки+"НовоеЗначение"];
	КонецЕсли;

	ПредыдущееЗначение = СтрокаДерева[ИмяКолонки+"ДляРасчетаРазницы"];
	Разница = ЗначениеТрудозатрат - ПредыдущееЗначение;

	Если Разница = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ИнтерактивноеИзменение Тогда
		Если НужноОбновитьДатыПЗ(ЭтаФорма, СтрокаДерева, ИмяКолонки) Тогда
			ОпределитьНовыеДатыПЗ(ЭтаФорма, СтрокаДерева.ПроектнаяЗадачаЗеркало);			
			СортроватьСтрокиПоДатеПервойЗагрузки(ЭтаФорма, СтрокаДерева.ПолучитьРодителя());
		КонецЕсли;
	КонецЕсли;

	ТекСтрока = СтрокаДерева;

	Отбор = Новый Структура("ПроектнаяЗадачаЗеркало, Подразделение, Роль, ТрудовойРесурс");
	ЗаполнитьЗначенияСвойств(Отбор, ТекСтрока);
	Отбор.ТрудовойРесурс = ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.ПустаяСсылка");
	ТекСтрокаБезРесурса = ПолучитьСтрокуБезРесурса(Отбор, ДеревоФормы.ПолучитьЭлементы());
	Если ТекСтрокаБезРесурса = Неопределено И ИзменениеЯчейки Тогда
		// Добавляем новую ТекСтрокуБезРесурсов
		ТекСтрокаБезРесурса = ДобавитьСтрокуБезРесурса(ТекСтрока, ИмяКолонки, Разница);
	КонецЕсли;
	Если ТекСтрокаБезРесурса <> Неопределено Тогда
		ТекСтрокаБезРесурса[ИмяКолонки+"НовоеЗначение"] = ТекСтрокаБезРесурса[ИмяКолонки+"НовоеЗначение"] - Разница;
	КонецЕсли;	
		
	Пока ТекСтрока <> Неопределено Цикл
		
		Если ТекСтрока.ИмяГруппировки = "ТрудовойРесурс" И ЭтаФорма.Объект.ПорядокГруппировок = 2 И ИнтерактивноеИзменение Тогда

			Превышение = ?(ТекСтрока[ИмяКолонки+"НовоеЗначение"] > ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							ТекСтрока[ИмяКолонки+"НовоеЗначение"] - ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							0);
			Простой = ?(ТекСтрока[ИмяКолонки+"НовоеЗначение"] < ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							ТекСтрока[ИмяКолонки+"ПоКалендарю"] - ТекСтрока[ИмяКолонки+"НовоеЗначение"],
							0);	
			ЭтаФорма.ОбщаяНедозагрузка = Макс(ЭтаФорма.ОбщаяНедозагрузка - Простой, 0);							
	 		ЭтаФорма.ОбщаяПерегрузка = ЭтаФорма.ОбщаяПерегрузка - Превышение;
		КонецЕсли;
		
		Если Не ТекСтрока.ПоследнийУровень И ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда //Не (ЭтаФорма.Объект.ПорядокГруппировок = 1 И Не ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс)) Тогда
			ТекСтрока[ИмяКолонки+"НовоеЗначение"] = ТекСтрока[ИмяКолонки+"НовоеЗначение"] + Разница;
			Если ТекСтрокаБезРесурса <> Неопределено И ТекСтрокаБезРесурса <> ТекСтрока Тогда
				ТекСтрокаБезРесурса[ИмяКолонки+"НовоеЗначение"] = ТекСтрокаБезРесурса[ИмяКолонки+"НовоеЗначение"] - Разница;
			КонецЕсли;	
		КонецЕсли;		
						
		ТекСтрока[ИмяКолонки+"Отклонение"] = ТекСтрока[ИмяКолонки+"НовоеЗначение"] - ТекСтрока[ИмяКолонки+"ТекущееЗначение"];		
		Если ТекСтрокаБезРесурса <> Неопределено И ТекСтрокаБезРесурса <> ТекСтрока Тогда
			ТекСтрокаБезРесурса[ИмяКолонки+"Отклонение"] = ТекСтрокаБезРесурса[ИмяКолонки+"НовоеЗначение"] - ТекСтрокаБезРесурса[ИмяКолонки+"ТекущееЗначение"];		
		КонецЕсли;	
		Если Не (ЭтаФорма.Объект.ПорядокГруппировок = 1 И Не ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) И Не ТекСтрока.ПоследнийУровень) Тогда
			ТекСтрока[ИмяКолонки+"ДляРасчетаРазницы"] = ТекСтрока[ИмяКолонки+"ДляРасчетаРазницы"] + Разница;		
			ТекСтрока.ИтогПоПериодуНовоеЗначение = ТекСтрока.ИтогПоПериодуНовоеЗначение + Разница;
			Если ТекСтрокаБезРесурса <> Неопределено  И ТекСтрокаБезРесурса <> ТекСтрока Тогда
				ТекСтрокаБезРесурса[ИмяКолонки+"ДляРасчетаРазницы"] = ТекСтрокаБезРесурса[ИмяКолонки+"ДляРасчетаРазницы"] - Разница;		
				ТекСтрокаБезРесурса.ИтогПоПериодуНовоеЗначение = ТекСтрокаБезРесурса.ИтогПоПериодуНовоеЗначение - Разница;
			КонецЕсли;	
		КонецЕсли;	
		ТекСтрока.ИтогПоПериодуОтклонение =  ТекСтрока.ИтогПоПериодуНовоеЗначение - ТекСтрока.ИтогПоПериодуТекущееЗначение;
		Если ТекСтрокаБезРесурса <> Неопределено И ТекСтрокаБезРесурса <> ТекСтрока Тогда
			ТекСтрокаБезРесурса.ИтогПоПериодуОтклонение =  ТекСтрокаБезРесурса.ИтогПоПериодуНовоеЗначение - ТекСтрокаБезРесурса.ИтогПоПериодуТекущееЗначение;
		КонецЕсли;	
		
		Если СчитатьИтогиСтроки Тогда
			СчитатьВычисляемыеИтогиСтроки(ТекСтрока);	
			Если ТекСтрокаБезРесурса <> Неопределено И ТекСтрокаБезРесурса <> ТекСтрока Тогда
				СчитатьВычисляемыеИтогиСтроки(ТекСтрокаБезРесурса);	
			КонецЕсли;	
		КонецЕсли;		
		
		Если ТекСтрока.ИмяГруппировки = "ТрудовойРесурс" И ЭтаФорма.Объект.ПорядокГруппировок = 2 Тогда
			Превышение = ?(ТекСтрока[ИмяКолонки+"НовоеЗначение"] > ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							ТекСтрока[ИмяКолонки+"НовоеЗначение"] - ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							0);
			Простой = ?(ТекСтрока[ИмяКолонки+"НовоеЗначение"] < ТекСтрока[ИмяКолонки+"ПоКалендарю"],
							ТекСтрока[ИмяКолонки+"ПоКалендарю"] - ТекСтрока[ИмяКолонки+"НовоеЗначение"],
							0);	
			ЭтаФорма.ОбщаяНедозагрузка = ЭтаФорма.ОбщаяНедозагрузка + Простой;							
			ЭтаФорма.ОбщаяПерегрузка = ЭтаФорма.ОбщаяПерегрузка + Превышение;
		КонецЕсли;
		
		Если ТипЗнч(ТекСтрока) = Тип("ДанныеФормыЭлементДерева") Тогда
			ТекСтрока = ТекСтрока.ПолучитьРодителя();
			Если ТекСтрокаБезРесурса <> Неопределено Тогда
				ТекСтрокаБезРесурса = ТекСтрокаБезРесурса.ПолучитьРодителя();
			КонецЕсли;	
		Иначе
			ТекСтрока = ТекСтрока.Родитель;
			Если ТекСтрокаБезРесурса <> Неопределено Тогда
				ТекСтрокаБезРесурса = ТекСтрокаБезРесурса.Родитель;
			КонецЕсли;	
		КонецЕсли;		
		
	КонецЦикла;

	Если ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда 
		ЭтаФорма["ИтогоНовоеЗначение" + ИмяКолонки] = ЭтаФорма["ИтогоНовоеЗначение" + ИмяКолонки] + Разница;		
		//ЭтаФорма["ПодвалНовоеЗначение" + ИмяКолонки] = Формат(ЭтаФорма["ИтогоНовоеЗначение" + ИмяКолонки], "ЧДЦ=1; ЧН=");
		
		ЭтаФорма["ИтогоОтклонение" + ИмяКолонки] = ЭтаФорма["ИтогоНовоеЗначение" + ИмяКолонки] - ЭтаФорма["ИтогоТекущееЗначение" + ИмяКолонки]; 			
		//ЭтаФорма["ПодвалОтклонение" + ИмяКолонки] = Формат(ЭтаФорма["ИтогоОтклонение" + ИмяКолонки], "ЧДЦ=1; ЧН=");	
		
		ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение = ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение + Разница; 
		ЭтаФорма.ОбщийИтогПоПериодуОтклонение = ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение - ЭтаФорма.ОбщийИтогПоПериодуТекущееЗначение; 	
	КонецЕсли;	

	Если СчитатьИтогиДерева Тогда 
		СчитатьВычисляемыеИтогиДерева(ЭтаФорма);
		ОбновитьПодвалИтогов(ЭтаФорма);
		упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурсам", ИмяКолонки);		
		ПостроитьДиаграммуГанта(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СортроватьСтрокиПоДатеПервойЗагрузки(ЭтаФорма, СтрокаРодителя)
	
	Если ЭтаФорма.Объект.ПорядокГруппировок <> 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Элементы = СтрокаРодителя.ПолучитьЭлементы();
	КоличествоЭлементов = Элементы.Количество();
	сч = 1;
	БылОбмен = Ложь;
	Пока сч < КоличествоЭлементов Цикл	
		внутр_сч = 1;
		Пока внутр_сч < КоличествоЭлементов Цикл
			Элемент1 = Элементы[внутр_сч-1];
			Элемент2 = Элементы[внутр_сч];	
			Если Элемент1.ДатаПервойЗагруки > Элемент2.ДатаПервойЗагруки Тогда
				Элементы.Сдвинуть(внутр_сч-1, 1);
				БылОбмен = Истина; 	
			КонецЕсли;			
			внутр_сч = внутр_сч + 1;
		КонецЦикла;	
		сч = сч + 1;
		Если Не БылОбмен Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НужноОбновитьДатыПЗ(ЭтаФорма, ТекСтрокаДерева, ИмяИзмененнойКолонки)

	НужноеИзменение = Неопределено;

	НовоеЗначение = ТекСтрокаДерева[ИмяИзмененнойКолонки+"НовоеЗначение"]; 
	ЗначениеДоИзменения = ТекСтрокаДерева[ИмяИзмененнойКолонки+"ДляРасчетаРазницы"]; 

	Если НовоеЗначение = 0 И ЗначениеДоИзменения <> 0 Тогда
		НужноеИзменение = "УбралиЗначение";
	ИначеЕсли НовоеЗначение <> 0 И ЗначениеДоИзменения = 0 Тогда
		НужноеИзменение = "ДобавилиЗначение";
	КонецЕсли;

	Если НужноеИзменение = Неопределено Тогда
		Возврат Ложь;	
	КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьНовыеДатыПЗ(ЭтаФорма, ПроектнаяЗадачаЗеркало) 
	
	СтрокиПЗ_НижнийУровень = ЭтаФорма.мКэшЗначений.СтрокиПЗ_НижнийУровень.Получить(ПроектнаяЗадачаЗеркало);
	СтрокиПЗ_УровеньПЗ = ЭтаФорма.мКэшЗначений.СтрокиПЗ_УровеньПЗ.Получить(ПроектнаяЗадачаЗеркало);

	ТрудозатратыДоПериода = 0;
	ТрудозатратыПослеПериода = 0;

	ПерваяКолонкаСоЗначением = Неопределено;
	ПоследняяКолонкаСоЗначением = Неопределено;
	ДатаПервойКолонки = ЭтаФорма.КонецПериодаНаФорме + 24*3600;
	ДатаПоследнейКолонки = Дата(1,1,1);

	Строка_УровеньПЗ = ЭтаФорма.ДеревоФормы.НайтиПоИдентификатору(СтрокиПЗ_УровеньПЗ[0]);

	Если ЗначениеЗаполнено(Строка_УровеньПЗ.ДатаЗавершенияНП) Тогда
		ДатаЗавершения = Строка_УровеньПЗ.ДатаЗавершенияНП;
	Иначе
		ДатаЗавершения = Строка_УровеньПЗ.ДатаЗавершенияТП;
	КонецЕсли;
	Если ЗначениеЗаполнено(Строка_УровеньПЗ.ДатаНачалаНП) Тогда
		ДатаНачала = Строка_УровеньПЗ.ДатаНачалаНП;
	Иначе
		ДатаНачала = Строка_УровеньПЗ.ДатаНачалаТП;
	КонецЕсли;
		
	МассивСтрокПЗ = Новый Массив;
	Для Каждого ИдСтроки Из СтрокиПЗ_НижнийУровень Цикл
		
		ДатаПервойКолонкиЭтойСтроки = ЭтаФорма.КонецПериодаНаФорме + 24*3600;
		
		СтрокаДерева = ЭтаФорма.ДеревоФормы.НайтиПоИдентификатору(ИдСтроки);
		МассивСтрокПЗ.Добавить(СтрокаДерева);
		
		Если Не ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДерева.ДатаПервойЗагруки = ЭтаФорма.КонецПериодаНаФорме + 24*3600;
		
		ТрудозатратыДоПериода = ТрудозатратыДоПериода + СтрокаДерева.ТрудозатратыПланДоПериода;
		ТрудозатратыПослеПериода = ТрудозатратыПослеПериода + СтрокаДерева.ТрудозатратыПланПослеПериода;
		
		Для Каждого СтрокаКолонок Из ЭтаФорма.КолонкиДат Цикл
			Если ЗначениеЗаполнено(СтрокаДерева[СтрокаКолонок.ИмяКолонки+"НовоеЗначение"]) Тогда
				СтрокаДерева.ДатаПервойЗагруки = Мин(СтрокаДерева.ДатаПервойЗагруки, СтрокаКолонок.Дата);
				Если ДатаПервойКолонки > СтрокаКолонок.Дата Тогда
					ДатаПервойКолонки = СтрокаКолонок.Дата;
					ПоследняяКолонкаСоЗначением = СтрокаКолонок.ИмяКолонки;
				КонецЕсли;
				Если ДатаПоследнейКолонки < СтрокаКолонок.Дата Тогда
					ДатаПоследнейКолонки = СтрокаКолонок.Дата;
					ПерваяКолонкаСоЗначением = СтрокаКолонок.ИмяКолонки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
			
	КонецЦикла;

	ОбновитьПревышениеКрайнегоСрокаПЗ(ЭтаФорма, Строка_УровеньПЗ.ПроектнаяЗадача, ДатаПоследнейКолонки, Строка_УровеньПЗ.КрайнийСрок);

	//Если ДатаПервойКолонки = Строка_УровеньПЗ.ДатаНачалаТП Тогда
	//	ДатаПервойКолонки = Дата(1,1,1);
	//КонецЕсли;
	//Если ДатаПоследнейКолонки = Строка_УровеньПЗ.ДатаЗавершенияТП Тогда
	//	ДатаПоследнейКолонки = Дата(1,1,1);
	//КонецЕсли;

	ИзменитьДатуНачала = НЕ ЗначениеЗаполнено(ТрудозатратыДоПериода) И
						ДатаПервойКолонки <> ДатаНачала И ПерваяКолонкаСоЗначением <> Неопределено;
	ИзменитьДатуЗавершения = НЕ ЗначениеЗаполнено(ТрудозатратыПослеПериода) И
						ДатаПоследнейКолонки <> ДатаЗавершения И ПоследняяКолонкаСоЗначением <> Неопределено;

	Если ИзменитьДатуНачала ИЛИ ИзменитьДатуЗавершения Тогда
		Для Каждого СтрокаДерева Из МассивСтрокПЗ Цикл
			Пока Истина Цикл
				Если СтрокаДерева = Неопределено Тогда
					Прервать;
				КонецЕсли;
				ДатаНачалаУжеИменена = НЕ ИзменитьДатуНачала;
				ДатаЗавершенияУжеИзменена = Не ИзменитьДатуЗавершения;
				Если ИзменитьДатуНачала Тогда		
					Если СтрокаДерева.ДатаНачалаНП = ДатаПервойКолонки Тогда
						ДатаНачалаУжеИзменена = Истина;
					Иначе
						СтрокаДерева.ДатаНачалаНП = ДатаПервойКолонки;
					КонецЕсли;		
				КонецЕсли;
				Если ИзменитьДатуЗавершения Тогда
					Если СтрокаДерева.ДатаЗавершенияНП = ДатаПоследнейКолонки Тогда
						ДатаЗавершенияУжеИзменена = Истина;
					Иначе
						СтрокаДерева.ДатаЗавершенияНП = ДатаПоследнейКолонки;
					КонецЕсли;					
				КонецЕсли;
				СтрокаБылаОбработанаРаньше = ДатаНачалаУжеИменена И ДатаЗавершенияУжеИзменена;
				Если СтрокаБылаОбработанаРаньше Тогда
					Прервать;
				КонецЕсли;
				СтрокаДерева = СтрокаДерева.ПолучитьРодителя();
			КонецЦикла;
		КонецЦикла;				
	КонецЕсли;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьПревышениеКрайнегоСрокаПЗ(ЭтаФорма, ПроектнаяЗадача, Знач ДатаЗавершения, КрайнийСрок) 

	Возврат Неопределено;

	ДатаЗавершения = НачалоДня(ДатаЗавершения);

	Отбор = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
	Строки = ЭтаФорма.ПревышениеКрайнихСроков.НайтиСтроки(Отбор);
	Если Строки.Количество() Тогда
		СтрокаПревышения = Строки[0];
	Иначе
		СтрокаПревышения = ЭтаФорма.ПревышениеКрайнихСроков.Добавить();
		СтрокаПревышения.ПроектнаяЗадача = ПроектнаяЗадача;
	КонецЕсли;

	ЭтаФорма.ОбщееПревышениеКритическихСроков = ЭтаФорма.ОбщееПревышениеКритическихСроков - СтрокаПревышения.Превышение;

	Если ЗначениеЗаполнено(КрайнийСрок) И ДатаЗавершения > КрайнийСрок Тогда
		СтрокаПревышения.Превышение = (ДатаЗавершения - КрайнийСрок) / (24*3600) ;
		ЭтаФорма.ОбщееПревышениеКритическихСроков = ЭтаФорма.ОбщееПревышениеКритическихСроков + СтрокаПревышения.Превышение;
	Иначе
		СтрокаПревышения.Превышение = 0;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ДанныеОбъекта_ОпределитьНовыеДатыПЗ(ПроектнаяЗадача) 
		
	СтрокиПЗ = Объект.Данные.НайтиСтроки(Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача));
	ТрудозатратыПланДоПериода = 0;
	ТрудозатратыПланПослеПериода = 0;
	Для Каждого ТекСтрока Из СтрокиПЗ Цикл
		ТрудозатратыПланДоПериода = ТрудозатратыПланДоПериода + ТекСтрока.ТрудозатратыПланДоПериода;
		ТрудозатратыПланПослеПериода = ТрудозатратыПланПослеПериода + ТекСтрока.ТрудозатратыПланПослеПериода;
	КонецЦикла;	
	СтрокаПЗ = СтрокиПЗ[0];

	СтрокиРаспределенияПЗ = Объект.РаспределениеПоПериоду.Выгрузить(Новый Структура("ПроектнаяЗадача, ТипДанных", ПроектнаяЗадача, "НовоеЗначение"));
	СтрокиРаспределенияПЗ.Сортировать("Дата");

	МаксимальнаяДата = Дата(1,1,1);
	МинимальнаяДата = Объект.КонецПериода + 24*3600;

	Для Каждого СтрокаРаспределения Из СтрокиРаспределенияПЗ Цикл
		Если ЗначениеЗаполнено(СтрокаРаспределения.Значение) Тогда
			МаксимальнаяДата = Макс(МаксимальнаяДата, СтрокаРаспределения.Дата);  
			МинимальнаяДата = Мин(МинимальнаяДата, СтрокаРаспределения.Дата);  
		КонецЕсли;
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(ТрудозатратыПланДоПериода) 
		И МинимальнаяДата <= МаксимальнаяДата
		И СтрокаПЗ.ДатаНачалаНП <> МинимальнаяДата Тогда
		
		Для Каждого ТекСтрока Из СтрокиПЗ Цикл
			ТекСтрока.ДатаНачалаНП = МинимальнаяДата;	
		КонецЦикла;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТрудозатратыПланПослеПериода) 
		И ЗначениеЗаполнено(МаксимальнаяДата)
		И СтрокаПЗ.ДатаЗавершенияНП <> МаксимальнаяДата Тогда
		
		Для Каждого ТекСтрока Из СтрокиПЗ Цикл
			ТекСтрока.ДатаЗавершенияНП = МаксимальнаяДата;	
		КонецЦикла;
		
	КонецЕсли;

	ОбновитьПревышениеКрайнегоСрокаПЗ(ЭтаФорма, СтрокаПЗ.ПроектнаяЗадача, СтрокаПЗ.ДатаЗавершенияНП, СтрокаПЗ.КрайнийСрок);	
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчитатьВычисляемыеИтогиСтроки(СтрокаДерева) 
	
	СтрокаДерева.ИтогНовоеЗначение = СтрокаДерева.ИтогПоПериодуНовоеЗначение + 
			СтрокаДерева.ТрудозатратыПланДоПериода + СтрокаДерева.ТрудозатратыПланПослеПериода;
	Если ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда
		СтрокаДерева.ИтогТекущееЗначение = СтрокаДерева.ИтогПоПериодуТекущееЗначение + 
				СтрокаДерева.ТрудозатратыПланДоПериода + СтрокаДерева.ТрудозатратыПланПослеПериода;			
			КонецЕсли;			
			
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчитатьВычисляемыеИтогиДерева(ЭтаФорма) 
	
	ЭтаФорма.ОбщийИтогТекущееЗначение = ЭтаФорма.ОбщийИтогПоПериодуТекущееЗначение + 
					ЭтаФорма.ОбщийИтогТрудозатратыПланДоПериода + ЭтаФорма.ОбщийИтогТрудозатратыПланПослеПериода;
	ЭтаФорма.ОбщийИтогНовоеЗначение = ЭтаФорма.ОбщийИтогПоПериодуНовоеЗначение + 
					ЭтаФорма.ОбщийИтогТрудозатратыПланДоПериода + ЭтаФорма.ОбщийИтогТрудозатратыПланПослеПериода;
					
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеИзБДВОбъект() 	

	ЗагрузитьДанныеОбъектаИзФормы(Объект, Истина);

	Роли = Объект.Роли.Выгрузить().ВыгрузитьКолонку("Роль"); 
	ВсеРоли = Роли.Количество() = 0;

	Проекты = Объект.Проекты.Выгрузить().ВыгрузитьКолонку("Проект"); 
	ВсеПроекты = Проекты.Количество() = 0;

	Подразделения = Объект.Подразделения.Выгрузить().ВыгрузитьКолонку("Подразделение"); 
	ВсеПодразделения = Подразделения.Количество() = 0;

	Если ВсеПроекты Тогда
		упоРаботаСОчередями.ДобавитьОповещениеПоОчередиТрудозатратПоОтбору(Неопределено, СписокОповещений, Ложь);
	Иначе
		упоРаботаСОчередями.ДобавитьОповещениеПоОчередиТрудозатратПоОтбору(Проекты, СписокОповещений, Ложь);
	КонецЕсли;

	Запрос = Новый Запрос;
	УстановитьПараметрыРазграниченияДоступа(Запрос);
	Запрос.УстановитьПараметр("УровеньПланированияОкончательный", Перечисления.упоУровеньПланирования.Окончательный);
	Запрос.УстановитьПараметр("УровеньПланированияПредварительный", Перечисления.упоУровеньПланирования.Предварительный);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("СписокРолей", Роли);
	Запрос.УстановитьПараметр("ВсеРоли", ВсеРоли);
	Запрос.УстановитьПараметр("СписокПроектов", Проекты);
	Запрос.УстановитьПараметр("ВсеПроекты", ВсеПроекты);
	Запрос.УстановитьПараметр("СписокПодразделений", Подразделения);
	Запрос.УстановитьПараметр("ВсеПодразделения", ВсеПодразделения);
	Запрос.УстановитьПараметр("Календарь", Константы.упоРабочийКалендарьПоУмолчанию.Получить());
		
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс КАК Ресурс,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль КАК Роль,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение КАК Подразделение,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День КАК День,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты КАК Трудозатраты,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция КАК ПроектнаяЗадача,
	               |	ИСТИНА КАК Редактируется
	               |ПОМЕСТИТЬ ТрудозатратыПланТР
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |ГДЕ
	               |	(&ВсеПроекты
	               |			ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция.Проект В (&СписокПроектов))
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланированияОкончательный
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоТрудовыеРесурсы
	               |	И (&ВсеРоли
	               |			ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль В (&СписокРолей))
	               |	И (&ВсеПодразделения
	               |			ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение В (&СписокПодразделений))
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День >= &НачалоПериода
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День <= &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс КАК Ресурс,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль КАК Роль,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение КАК Подразделение,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День КАК День,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты КАК Трудозатраты,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция КАК ПроектнаяЗадача,
	               |	ЛОЖЬ КАК Редактируется
	               |ПОМЕСТИТЬ ТрудозатратыПланТРДопЗагрузка
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТрудозатратыПланТР КАК ТрудозатратыПланТР
	               |		ПО упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс = ТрудозатратыПланТР.Ресурс
	               |			И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция = ТрудозатратыПланТР.ПроектнаяЗадача
	               |			И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение = ТрудозатратыПланТР.Подразделение
	               |			И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль = ТрудозатратыПланТР.Роль
	               |			И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День = ТрудозатратыПланТР.День
	               |ГДЕ
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланированияОкончательный
	               |	И ТрудозатратыПланТР.Ресурс ЕСТЬ NULL
	               |	И (упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс, упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение) В
	               |			(ВЫБРАТЬ
	               |				ТрудозатратыПланТР.Ресурс,
	               |				ТрудозатратыПланТР.Подразделение
	               |			ИЗ
	               |				ТрудозатратыПланТР КАК ТрудозатратыПланТР)
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День >= &НачалоПериода
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День <= &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс КАК Роль,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение КАК Подразделение,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День КАК День,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты КАК Трудозатраты,
	               |	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция КАК ПроектнаяЗадача,
	               |	ЛОЖЬ КАК Редактируется
	               |ПОМЕСТИТЬ ТрудозатратыПланРоли
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |ГДЕ
	               |	(&ВсеПроекты
	               |			ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Проект В (&СписокПроектов))
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланированияОкончательный
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоРоли
	               |	И (&ВсеРоли
	               |			ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс В (&СписокРолей))
	               |	И (&ВсеПодразделения
	               |			ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение В (&СписокПодразделений))
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День >= &НачалоПериода
	               |	И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День <= &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Роль,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Количество * упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент КАК Трудозатраты,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.СпособПривязки КАК СпособПривязки
	               |ПОМЕСТИТЬ ЗадачиВПериоде
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	               |			,
	               |			&ВсеПроекты
	               |				ИЛИ ПроектнаяЗадача.Проект В (&СписокПроектов)) КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |				,
	               |				(&ВсеРоли
	               |					ИЛИ Ресурс В (&СписокРолей))
	               |					И (&ВсеПроекты
	               |						ИЛИ ПроектнаяЗадача.Проект В (&СписокПроектов))
	               |					И (&ВсеПодразделения
	               |						ИЛИ Подразделение В (&СписокПодразделений))) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |				И упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |		ПО упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача
	               |			И упоСрокиПроектныхЗадачСрезПоследних.Версия = упоДанныеПлановТрудозатратРолейСрезПоследних.Версия
	               |ГДЕ
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан <= &КонецПериода
	               |	И упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан >= &НачалоПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс КАК Ресурс,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса КАК РольРесурса,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение КАК Подразделение,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК День,
	               |	0 КАК Трудозатраты,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ИСТИНА КАК Редактируется
	               |ПОМЕСТИТЬ ТРВыделенные
	               |ИЗ
	               |	ЗадачиВПериоде КАК ЗадачиВПериоде
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |				,
	               |				ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						ЗадачиВПериоде.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						ЗадачиВПериоде КАК ЗадачиВПериоде)) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоВыделенныеТрудовыеРесурсыСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО ЗадачиВПериоде.ПроектнаяЗадача = упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача
	               |			И ЗадачиВПериоде.Роль = упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса
	               |			И (упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТрудозатратыПланТР.Ресурс КАК Ресурс,
	               |	ТрудозатратыПланТР.Роль КАК Роль,
	               |	ТрудозатратыПланТР.Подразделение КАК Подразделение,
	               |	ТрудозатратыПланТР.День КАК День,
	               |	ТрудозатратыПланТР.Трудозатраты КАК Значение,
	               |	ТрудозатратыПланТР.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТрудозатратыПланТР.Редактируется КАК Редактируется,
	               |	""ТрудозатратыПлан"" КАК ТипДанных
	               |ПОМЕСТИТЬ ВсеТрудозатратыПлан
	               |ИЗ
	               |	ТрудозатратыПланТР КАК ТрудозатратыПланТР
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТрудозатратыПланТРДопЗагрузка.Ресурс,
	               |	ТрудозатратыПланТРДопЗагрузка.Роль,
	               |	ТрудозатратыПланТРДопЗагрузка.Подразделение,
	               |	ТрудозатратыПланТРДопЗагрузка.День,
	               |	ТрудозатратыПланТРДопЗагрузка.Трудозатраты,
	               |	ТрудозатратыПланТРДопЗагрузка.ПроектнаяЗадача,
	               |	ТрудозатратыПланТРДопЗагрузка.Редактируется,
	               |	""ТрудозатратыПлан""
	               |ИЗ
	               |	ТрудозатратыПланТРДопЗагрузка КАК ТрудозатратыПланТРДопЗагрузка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НЕОПРЕДЕЛЕНО,
	               |	ТрудозатратыПланРоли.Роль,
	               |	ТрудозатратыПланРоли.Подразделение,
	               |	ТрудозатратыПланРоли.День,
	               |	ТрудозатратыПланРоли.Трудозатраты,
	               |	ТрудозатратыПланРоли.ПроектнаяЗадача,
	               |	ТрудозатратыПланРоли.Редактируется,
	               |	""ПоРоли""
	               |ИЗ
	               |	ТрудозатратыПланРоли КАК ТрудозатратыПланРоли
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТРВыделенные.Ресурс,
	               |	ТРВыделенные.РольРесурса,
	               |	ТРВыделенные.Подразделение,
	               |	ТРВыделенные.День,
	               |	ТРВыделенные.Трудозатраты,
	               |	ТРВыделенные.ПроектнаяЗадача,
	               |	ТРВыделенные.Редактируется,
	               |	""ТрудозатратыПлан""
	               |ИЗ
	               |	ТРВыделенные КАК ТРВыделенные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВсеТрудозатратыПлан.Ресурс КАК ТрудовойРесурс,
	               |	ВсеТрудозатратыПлан.Роль КАК Роль,
	               |	ВсеТрудозатратыПлан.Подразделение КАК Подразделение,
	               |	ВсеТрудозатратыПлан.День КАК Дата,
	               |	СУММА(ВсеТрудозатратыПлан.Значение) КАК Значение,
	               |	ВсеТрудозатратыПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВсеТрудозатратыПлан.Редактируется КАК Редактируется,
	               |	ВсеТрудозатратыПлан.ТипДанных КАК ТипДанных
	               |ПОМЕСТИТЬ ВсеТрудозатратыПланСгруппированны
	               |ИЗ
	               |	ВсеТрудозатратыПлан КАК ВсеТрудозатратыПлан
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВсеТрудозатратыПлан.ТипДанных,
	               |	ВсеТрудозатратыПлан.Ресурс,
	               |	ВсеТрудозатратыПлан.Подразделение,
	               |	ВсеТрудозатратыПлан.ПроектнаяЗадача,
	               |	ВсеТрудозатратыПлан.Роль,
	               |	ВсеТрудозатратыПлан.День,
	               |	ВсеТрудозатратыПлан.Редактируется
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоФактТрудозатратСводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоФактТрудозатратСводно.Ресурс КАК ТрудовойРесурс,
	               |	упоФактТрудозатратСводно.Роль КАК Роль,
	               |	СУММА(упоФактТрудозатратСводно.КоличествоЧасов) КАК Трудозатраты
	               |ПОМЕСТИТЬ ТрудозатратыФакт
	               |ИЗ
	               |	РегистрСведений.упоФактТрудозатратСводно КАК упоФактТрудозатратСводно
	               |ГДЕ
	               |	(упоФактТрудозатратСводно.ПроектнаяЗадача, упоФактТрудозатратСводно.Ресурс, упоФактТрудозатратСводно.Роль, упоФактТрудозатратСводно.Подразделение) В
	               |			(ВЫБРАТЬ
	               |				ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача,
	               |				ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс,
	               |				ВсеТрудозатратыПланСгруппированны.Роль,
	               |				ВсеТрудозатратыПланСгруппированны.Подразделение
	               |			ИЗ
	               |				ВсеТрудозатратыПланСгруппированны)
	               |	И упоФактТрудозатратСводно.Ресурс ССЫЛКА Справочник.упоТрудовыеРесурсы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоФактТрудозатратСводно.ПроектнаяЗадача,
	               |	упоФактТрудозатратСводно.Ресурс,
	               |	упоФактТрудозатратСводно.Роль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ТрудозатратыПланТРЗаПериодом.Ресурс КАК Ресурс,
	               |	ТрудозатратыПланТРЗаПериодом.Роль КАК Роль,
	               |	ТрудозатратыПланТРЗаПериодом.Подразделение КАК Подразделение,
	               |	ТрудозатратыПланТРЗаПериодом.Трудозатраты КАК Трудозатраты,
	               |	ТрудозатратыПланТРЗаПериодом.Операция КАК ПроектнаяЗадача,
	               |	ТрудозатратыПланТРЗаПериодом.День КАК Дата
	               |ПОМЕСТИТЬ ТрудозатратыПланТРЗаПериодомПолностью
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс КАК Ресурс,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль КАК Роль,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение КАК Подразделение,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты КАК Трудозатраты,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция КАК Операция,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День КАК День
	               |	ИЗ
	               |		РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеТрудозатратыПланСгруппированны КАК ВсеТрудозатратыПланСгруппированны
	               |			ПО упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция = ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача
	               |				И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс = ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс
	               |				И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль = ВсеТрудозатратыПланСгруппированны.Роль
	               |				И (ВсеТрудозатратыПланСгруппированны.ТипДанных = ""ТрудозатратыПлан"")
	               |	ГДЕ
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланированияОкончательный
	               |		И (упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День < &НачалоПериода
	               |				ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День > &КонецПериода)
	               |		И (упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция, упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс, упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль, упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение) В
	               |				(ВЫБРАТЬ
	               |					ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача,
	               |					ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс,
	               |					ВсеТрудозатратыПланСгруппированны.Роль,
	               |					ВсеТрудозатратыПланСгруппированны.Подразделение
	               |				ИЗ
	               |					ВсеТрудозатратыПланСгруппированны)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция,
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День
	               |	ИЗ
	               |		РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадачиВПериоде КАК ЗадачиВПериоде
	               |			ПО упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция = ЗадачиВПериоде.ПроектнаяЗадача
	               |				И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль = ЗадачиВПериоде.Роль
	               |	ГДЕ
	               |		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланированияОкончательный
	               |		И (упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День < &НачалоПериода
	               |				ИЛИ упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День > &КонецПериода)
	               |		И (упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция, упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль, упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение) В
	               |				(ВЫБРАТЬ
	               |					ЗадачиВПериоде.ПроектнаяЗадача,
	               |					ЗадачиВПериоде.Роль,
	               |					ЗадачиВПериоде.Подразделение
	               |				ИЗ
	               |					ВсеТрудозатратыПланСгруппированны)) КАК ТрудозатратыПланТРЗаПериодом
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТрудозатратыПланТРЗаПериодом.Операция,
	               |	ТрудозатратыПланТРЗаПериодом.День,
	               |	ТрудозатратыПланТРЗаПериодом.Ресурс,
	               |	ТрудозатратыПланТРЗаПериодом.Роль,
	               |	ТрудозатратыПланТРЗаПериодом.Подразделение,
	               |	ТрудозатратыПланТРЗаПериодом.Трудозатраты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Ресурс КАК Ресурс,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Роль КАК Роль,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Подразделение КАК Подразделение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТрудозатратыПланТРЗаПериодомПолностью.Дата < &НачалоПериода
	               |				ТОГДА ТрудозатратыПланТРЗаПериодомПолностью.Трудозатраты
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ДоПериода,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТрудозатратыПланТРЗаПериодомПолностью.Дата > &КонецПериода
	               |				ТОГДА ТрудозатратыПланТРЗаПериодомПолностью.Трудозатраты
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПослеПериода,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ТрудозатратыПланТРЗаПериодом
	               |ИЗ
	               |	ТрудозатратыПланТРЗаПериодомПолностью КАК ТрудозатратыПланТРЗаПериодомПолностью
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Ресурс,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Подразделение,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Роль,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоРолиТрудовыхРесурсовСрезПоследних.Ресурс КАК Ресурс,
	               |	упоРолиТрудовыхРесурсовСрезПоследних.Роль КАК Роль
	               |ПОМЕСТИТЬ ВсеРесурсы
	               |ИЗ
	               |	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(
	               |			,
	               |			Роль В
	               |				(ВЫБРАТЬ
	               |					ВсеТрудозатратыПланСгруппированны.Роль
	               |				ИЗ
	               |					ВсеТрудозатратыПланСгруппированны КАК ВсеТрудозатратыПланСгруппированны)) КАК упоРолиТрудовыхРесурсовСрезПоследних
	               |ГДЕ
	               |	упоРолиТрудовыхРесурсовСрезПоследних.РольНазначена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВсеРесурсы.Ресурс КАК Ресурс,
	               |	ВсеРесурсы.Роль КАК Роль
	               |ПОМЕСТИТЬ РесурсыНеНазначенные
	               |ИЗ
	               |	ВсеРесурсы КАК ВсеРесурсы
	               |ГДЕ
	               |	НЕ (ВсеРесурсы.Ресурс, ВсеРесурсы.Роль) В
	               |				(ВЫБРАТЬ
	               |					ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс,
	               |					ВсеТрудозатратыПланСгруппированны.Роль
	               |				ИЗ
	               |					ВсеТрудозатратыПланСгруппированны КАК ВсеТрудозатратыПланСгруппированны)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СУММА(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов) КАК ИтогПоРоли,
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Подразделение КАК Подразделение,
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Роль,
	               |	ЕСТЬNULL(упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения, НЕОПРЕДЕЛЕНО) КАК ПрофильРаспределения
	               |ПОМЕСТИТЬ ТаблицаИтогПоРоли
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |				,
	               |				Версия В
	               |					(ВЫБРАТЬ
	               |						Версии.Версия
	               |					ИЗ
	               |						РегистрСведений.упоВерсииПроекта КАК Версии
	               |					ГДЕ
	               |						Версии.Текущая)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |		ПО упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача = упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача
	               |			И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс = упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс
	               |			И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования
	               |			И (упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0)
	               |ГДЕ
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = &УровеньПланированияОкончательный
	               |	И (упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача, упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс, упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Подразделение) В
	               |			(ВЫБРАТЬ
	               |				ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача,
	               |				ВсеТрудозатратыПланСгруппированны.Роль,
	               |				ВсеТрудозатратыПланСгруппированны.Подразделение
	               |			ИЗ
	               |				ВсеТрудозатратыПланСгруппированны)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Подразделение,
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача,
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс,
	               |	ЕСТЬNULL(упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения, НЕОПРЕДЕЛЕНО)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЕСТЬNULL(упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) В (&СписокСотрудниковДиспетчера)
	               |		ИЛИ ЕСТЬNULL(упоРуководителиПроектовСрезПоследних.РуководительПроекта, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) В (&СписокСотрудниковДиспетчера) КАК ЕстьДоступРПЗ,
	               |	НЕ ЕСТЬNULL(упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.ПустаяСсылка)) В (&СтатусыНеРедактируемыхЗадач) КАК ЕстьДоступСтатусЗадачи
	               |ПОМЕСТИТЬ ТаблицаДанныеРазграничениеПравДоступа
	               |ИЗ
	               |	ВсеТрудозатратыПланСгруппированны КАК ВсеТрудозатратыПланСгруппированны
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, НЕ &ОтключитьРазграничениеДоступаКДокументам) КАК упоРуководителиПроектовСрезПоследних
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача.Проект = упоРуководителиПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, НЕ &ОтключитьРазграничениеДоступаКДокументам) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСтатусыПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	НЕ &ОтключитьРазграничениеДоступаКДокументам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Ресурс КАК Ресурс,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Роль КАК Роль,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Подразделение КАК Подразделение,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Трудозатраты КАК Трудозатраты,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТрудозатратыПланТРЗаПериодомПолностью.Дата КАК Дата
	               |ИЗ
	               |	ТрудозатратыПланТРЗаПериодомПолностью КАК ТрудозатратыПланТРЗаПериодомПолностью
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРабочиеКалендариСрезПоследних.День КАК День,
	               |	упоРабочиеКалендариСрезПоследних.КоличествоЧасов КАК КоличествоЧасов
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	               |			,
	               |			Календарь = &Календарь
	               |				И День >= &НачалоПериода
	               |				И День <= &КонецПериода) КАК упоРабочиеКалендариСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеРесурсы.Ресурс КАК ТрудовойРесурс,
	               |	ВсеРесурсы.Роль КАК Роль
	               |ИЗ
	               |	ВсеРесурсы КАК ВсеРесурсы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВсеРесурсы.Ресурс.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
	               |	упоФактТрудозатратПоДням.Ресурс КАК ТрудовойРесурс,
	               |	упоФактТрудозатратПоДням.Роль КАК Роль,
	               |	упоФактТрудозатратПоДням.Подразделение КАК Подразделение,
	               |	упоФактТрудозатратПоДням.День КАК Дата,
	               |	СУММА(упоФактТрудозатратПоДням.Трудозатраты) КАК Значение,
	               |	""ТрудозатратыФакт"" КАК ТипДанных
	               |ИЗ
	               |	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	               |ГДЕ
	               |	(упоФактТрудозатратПоДням.Операция, упоФактТрудозатратПоДням.Ресурс, упоФактТрудозатратПоДням.Роль, упоФактТрудозатратПоДням.Подразделение) В
	               |			(ВЫБРАТЬ
	               |				ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача,
	               |				ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс,
	               |				ВсеТрудозатратыПланСгруппированны.Роль,
	               |				ВсеТрудозатратыПланСгруппированны.Подразделение
	               |			ИЗ
	               |				ВсеТрудозатратыПланСгруппированны)
	               |	И упоФактТрудозатратПоДням.Ресурс ССЫЛКА Справочник.упоТрудовыеРесурсы
	               |	И упоФактТрудозатратПоДням.День >= &НачалоПериода
	               |	И упоФактТрудозатратПоДням.День <= &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоФактТрудозатратПоДням.Операция,
	               |	упоФактТрудозатратПоДням.Ресурс,
	               |	упоФактТрудозатратПоДням.День,
	               |	упоФактТрудозатратПоДням.Подразделение,
	               |	упоФактТрудозатратПоДням.Роль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ВсеТрудозатратыПланСгруппированны.Роль КАК Роль,
	               |	ВсеТрудозатратыПланСгруппированны.Подразделение КАК Подразделение,
	               |	ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА ВсеТрудозатратыПланСгруппированны.Редактируется
	               |			ТОГДА ЕСТЬNULL(ТаблицаДанныеРазграничениеПравДоступа.ЕстьДоступСтатусЗадачи, ИСТИНА)
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Редактируется,
	               |	ВЫБОР
	               |		КОГДА НЕ ВсеТрудозатратыПланСгруппированны.Редактируется
	               |			ТОГДА ЛОЖЬ
	               |		КОГДА &ОтключитьРазграничениеДоступаКДокументам
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(ТаблицаДанныеРазграничениеПравДоступа.ЕстьДоступСтатусЗадачи, ИСТИНА)
	               |				И ЕСТЬNULL(ТаблицаДанныеРазграничениеПравДоступа.ЕстьДоступРПЗ, ИСТИНА)
	               |	КОНЕЦ КАК Записывать,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаТП,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияТП,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаНП,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияНП,
	               |	Проекты.Ссылка КАК ПроектнаяЗадачаЗеркало,
	               |	ТрудозатратыФакт.Трудозатраты КАК Факт,
	               |	ТрудозатратыПланТРЗаПериодом.ДоПериода КАК ТрудозатратыПланДоПериода,
	               |	ТрудозатратыПланТРЗаПериодом.ПослеПериода КАК ТрудозатратыПланПослеПериода,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.КрайнийСрок КАК КрайнийСрок,
	               |	ТаблицаИтогПоРоли.ИтогПоРоли КАК ИтогПоРоли,
	               |	ТаблицаИтогПоРоли.ПрофильРаспределения КАК ПрофильРаспределенияРоли
	               |ИЗ
	               |	ВсеТрудозатратыПланСгруппированны КАК ВсеТрудозатратыПланСгруппированны
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТрудозатратыФакт КАК ТрудозатратыФакт
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = ТрудозатратыФакт.ПроектнаяЗадача
	               |			И ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс = ТрудозатратыФакт.ТрудовойРесурс
	               |			И ВсеТрудозатратыПланСгруппированны.Роль = ТрудозатратыФакт.Роль
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТрудозатратыПланТРЗаПериодом КАК ТрудозатратыПланТРЗаПериодом
	               |		ПО ВсеТрудозатратыПланСгруппированны.ТрудовойРесурс = ТрудозатратыПланТРЗаПериодом.Ресурс
	               |			И ВсеТрудозатратыПланСгруппированны.Роль = ТрудозатратыПланТРЗаПериодом.Роль
	               |			И ВсеТрудозатратыПланСгруппированны.Подразделение = ТрудозатратыПланТРЗаПериодом.Подразделение
	               |			И ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = ТрудозатратыПланТРЗаПериодом.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта1
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта1.Версия
	               |				И (упоВерсииПроекта1.Текущая)
	               |		ПО (упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИтогПоРоли КАК ТаблицаИтогПоРоли
	               |		ПО ВсеТрудозатратыПланСгруппированны.Роль = ТаблицаИтогПоРоли.Роль
	               |			И ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = ТаблицаИтогПоРоли.ПроектнаяЗадача
	               |			И ВсеТрудозатратыПланСгруппированны.Подразделение = ТаблицаИтогПоРоли.Подразделение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК упоСтатусыПроектовСрезПоследних
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача.Проект = упоСтатусыПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта2
	               |			ПО упоСтатусыПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта2.Версия
	               |				И (упоВерсииПроекта2.Текущая)
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК упоРуководителиПроектовСрезПоследних
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача.Проект = упоРуководителиПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныеРазграничениеПравДоступа КАК ТаблицаДанныеРазграничениеПравДоступа
	               |		ПО ВсеТрудозатратыПланСгруппированны.ПроектнаяЗадача = ТаблицаДанныеРазграничениеПравДоступа.ПроектнаяЗадача
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РесурсыНеНазначенные.Ресурс,
	               |	РесурсыНеНазначенные.Роль,
	               |	NULL,
	               |	NULL,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РесурсыНеНазначенные КАК РесурсыНеНазначенные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВсеТрудозатратыПлан.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ВсеТрудозатратыПлан.Роль КАК Роль,
	               |	ВсеТрудозатратыПлан.Подразделение КАК Подразделение,
	               |	ВсеТрудозатратыПлан.Дата КАК Дата,
	               |	ВсеТрудозатратыПлан.Значение КАК Значение,
	               |	ВсеТрудозатратыПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВсеТрудозатратыПлан.Редактируется КАК Редактируется,
	               |	ВсеТрудозатратыПлан.ТипДанных КАК ТипДанных
	               |ИЗ
	               |	ВсеТрудозатратыПланСгруппированны КАК ВсеТрудозатратыПлан
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСтатусыПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО ВсеТрудозатратыПлан.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	ВсеТрудозатратыПлан.Значение <> 0
	               |	И ВЫБОР
	               |			КОГДА НЕ &ОтключитьРазграничениеДоступаКДокументам
	               |					И упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи В (&СтатусыНеРедактируемыхЗадач)
	               |					И НЕ ВсеТрудозатратыПлан.Редактируется
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";

	РезультатЗапроса = Запрос.ВыполнитьПакет();				   				  
	ИндексПоследнегоРезультат = РезультатЗапроса.Количество()-1;
		
	Объект.Данные.Очистить();
	Объект.РаспределениеПоПериоду.Очистить();
	Объект.Ресурсы.Очистить();
	Объект.ДанныеКалендаря.Очистить();
	Объект.ТрудозатратыЗаПериодомПланирования.Очистить();
	Объект.ОтменаНазначения.Очистить();

	Если Не РезультатЗапроса[ИндексПоследнегоРезультат-5].Пустой() Тогда 				
		Выборка = РезультатЗапроса[ИндексПоследнегоРезультат-5].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Объект.ТрудозатратыЗаПериодомПланирования.Добавить(), Выборка);				
		КонецЦикла;
	КонецЕсли;
		
	Если Не РезультатЗапроса[ИндексПоследнегоРезультат-4].Пустой() Тогда 			
		Выборка = РезультатЗапроса[ИндексПоследнегоРезультат-4].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Объект.ДанныеКалендаря.Добавить(), Выборка);				
		КонецЦикла;		
	КонецЕсли;

	Если Не РезультатЗапроса[ИндексПоследнегоРезультат-3].Пустой() Тогда					
		Выборка = РезультатЗапроса[ИндексПоследнегоРезультат-3].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Объект.Ресурсы.Добавить(), Выборка);				
		КонецЦикла;			
	КонецЕсли;	

	Если Не РезультатЗапроса[ИндексПоследнегоРезультат-2].Пустой() Тогда		
		Выборка = РезультатЗапроса[ИндексПоследнегоРезультат-2].Выбрать();		
		Пока Выборка.Следующий() Цикл			
			Если Выборка.ТипДанных = "ТрудозатратыФакт" Тогда
				СтрокаРаспределения = Объект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, Выборка);
				СтрокаРаспределения.ТипДанных = "Факт";		
			КонецЕсли;				
		КонецЦикла;		
	КонецЕсли;	

	Если Не РезультатЗапроса[ИндексПоследнегоРезультат-1].Пустой() Тогда		
		Выборка = РезультатЗапроса[ИндексПоследнегоРезультат-1].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Объект.Данные.Добавить(), Выборка);
		КонецЦикла;						
	КонецЕсли;
		
	Если Не РезультатЗапроса[ИндексПоследнегоРезультат].Пустой() Тогда	
		Выборка = РезультатЗапроса[ИндексПоследнегоРезультат].Выбрать();		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ТипДанных = "ПоРоли" Тогда
				СтрокаРаспределения = Объект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, Выборка);
				СтрокаРаспределения.ТипДанных = "ПоРоли";
			ИначеЕсли Выборка.ТипДанных = "ТрудозатратыПлан" Тогда
				СтрокаРаспределения = Объект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, Выборка);
				СтрокаРаспределения.ТипДанных = "НовоеЗначение";	
				СтрокаРаспределения = Объект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, Выборка);
				СтрокаРаспределения.ТипДанных = "ТекущееЗначение";				
			ИначеЕсли Выборка.ТипДанных = "ТрудозатратыФакт" Тогда
				СтрокаРаспределения = Объект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, Выборка);
				СтрокаРаспределения.ТипДанных = "Факт";				
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;
			
	РаспределениеПоПериодуПоСтрокамБезРесурса();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДопДанные(ПоДату = Неопределено) 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Если ПоДату = Неопределено Тогда
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	Иначе
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПоДату));
	КонецЕсли;
	Запрос.УстановитьПараметр("Календарь", Константы.упоРабочийКалендарьПоУмолчанию.Получить());
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРабочиеКалендариСрезПоследних.День,
	               |	упоРабочиеКалендариСрезПоследних.КоличествоЧасов
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	               |			,
	               |			Календарь = &Календарь
	               |				И День >= &НачалоПериода
	               |				И День <= &КонецПериода) КАК упоРабочиеКалендариСрезПоследних";
				   
	РезультатЗапроса = Запрос.Выполнить();				   
	Объект.ДанныеКалендаря.Загрузить(РезультатЗапроса.Выгрузить());
			   	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииГруппировокСервер() 
	
	ЗагрузитьДанныеОбъектаИзФормы(Объект);
	ЗагрузитьДанныеФормыИзОбъекта();
	АдаптироватьЭлементы(ЭтаФорма);
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеОбъектаИзФормы(тОбъект, ТолькоШапку = Ложь) 
	
	ЗагрузитьОтборыИзФормы(тОбъект);
	
	тОбъект.НачалоПериода = НачалоПериодаНаФорме;
	тОбъект.КонецПериода = КонецПериодаНаФорме;
	
	Если ТолькоШапку Тогда
		Возврат;	
	КонецЕсли;
	
	тОбъект.РаспределениеПоПериоду.Очистить();
	тОбъект.Данные.Очистить();
	
	СтрокиНижнегоУровня = ПолучитьСтрокиНижнегоУровня(ДеревоФормы,,,,Истина);
	
	Отбор = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс, Роль");
	
	Для Каждого СрокаДерева Из СтрокиНижнегоУровня Цикл
		
		СтрокаДанных = тОбъект.Данные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СрокаДерева);
		
		Для Каждого СтрокаКолонки Из КолонкиДат Цикл
			
			//Если ЗначениеЗаполнено(СрокаДерева[СтрокаКолонки.ИмяКолонки+"НовоеЗначение"]) 
			//	ИЛИ ЗначениеЗаполнено(СрокаДерева[СтрокаКолонки.ИмяКолонки+"ТекущееЗначение"]) Тогда
			//	
			//	СтрокаРаспределения = тОбъект.РаспределениеПоПериоду.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаРаспределения, СрокаДерева);
			//	СтрокаРаспределения.Дата = СтрокаКолонки.Дата;
			//	СтрокаРаспределения.ТипДанных = "НовоеЗначение";
			//	СтрокаРаспределения.Значение = СрокаДерева[СтрокаКолонки.ИмяКолонки+"НовоеЗначение"];
			//	
			//	СтрокаРаспределения = тОбъект.РаспределениеПоПериоду.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаРаспределения, СрокаДерева);
			//	СтрокаРаспределения.Дата = СтрокаКолонки.Дата;					
			//	СтрокаРаспределения.ТипДанных = "ТекущееЗначение";
			//	СтрокаРаспределения.Значение = СрокаДерева[СтрокаКолонки.ИмяКолонки+"ТекущееЗначение"];
			//	
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(СрокаДерева[СтрокаКолонки.ИмяКолонки+"НовоеЗначение"]) Тогда
				
				СтрокаРаспределения = тОбъект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, СрокаДерева);
				СтрокаРаспределения.Дата = СтрокаКолонки.Дата;
				СтрокаРаспределения.ТипДанных = "НовоеЗначение";
				СтрокаРаспределения.Значение = СрокаДерева[СтрокаКолонки.ИмяКолонки+"НовоеЗначение"];
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СрокаДерева[СтрокаКолонки.ИмяКолонки+"ТекущееЗначение"]) Тогда
				
				СтрокаРаспределения = тОбъект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, СрокаДерева);
				СтрокаРаспределения.Дата = СтрокаКолонки.Дата;
				СтрокаРаспределения.ТипДанных = "ТекущееЗначение";
				СтрокаРаспределения.Значение = СрокаДерева[СтрокаКолонки.ИмяКолонки+"ТекущееЗначение"];
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СрокаДерева[СтрокаКолонки.ИмяКолонки+"ПоРоли"]) Тогда
				
				СтрокаРаспределения = тОбъект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, СрокаДерева);
				СтрокаРаспределения.Дата = СтрокаКолонки.Дата;					
				СтрокаРаспределения.ТипДанных = "ПоРоли";
				СтрокаРаспределения.Значение = СрокаДерева[СтрокаКолонки.ИмяКолонки+"ПоРоли"];
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СрокаДерева[СтрокаКолонки.ИмяКолонки+"Факт"]) Тогда
				
				СтрокаРаспределения = тОбъект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, СрокаДерева);
				СтрокаРаспределения.Дата = СтрокаКолонки.Дата;					
				СтрокаРаспределения.ТипДанных = "Факт";
				СтрокаРаспределения.Значение = СрокаДерева[СтрокаКолонки.ИмяКолонки+"Факт"];
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокиНижнегоУровня(МассивГруппировок)

	ПолучитьСтрокиНижнегоУровня(ДеревоФормы, , -1, МассивГруппировок);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМассивГруппировок(ПорядокГруппировок)

	МассивГруппировок = Новый Массив;
	Если ПорядокГруппировок = 0 Тогда
		МассивГруппировок.Добавить("ТрудовойРесурс");
		МассивГруппировок.Добавить("Роль");	
		МассивГруппировок.Добавить("Проект");
		МассивГруппировок.Добавить("ПроектнаяЗадачаЗеркало");
	ИначеЕсли ПорядокГруппировок = 1 Тогда
		МассивГруппировок.Добавить("Проект");
		МассивГруппировок.Добавить("ПроектнаяЗадачаЗеркало");
		МассивГруппировок.Добавить("Роль");
		МассивГруппировок.Добавить("ТрудовойРесурс");
	ИначеЕсли ПорядокГруппировок = 2 Тогда
		МассивГруппировок.Добавить("ТрудовойРесурс");
		МассивГруппировок.Добавить("ПроектнаяЗадачаЗеркало");
	КонецЕсли;

	Возврат МассивГруппировок;

КонецФункции

&НаСервере
Функция ПолучитьСтрокиНижнегоУровня(Дерево, МассивСтрокНижнегоУровня = Неопределено, СчетчикГруппировки= Неопределено, МассивГруппировок = Неопределено, ТолькоНайтиСтроки = Ложь) 
			
	Если МассивСтрокНижнегоУровня = Неопределено Тогда
		МассивСтрокНижнегоУровня = Новый Массив;
		Если НЕ ТолькоНайтиСтроки Тогда
			мКэшЗначений.СтрокиПЗ_НижнийУровень.Очистить();
			мКэшЗначений.СтрокиПЗ_УровеньПЗ.Очистить();
			мКэшЗначений.СтрокиРесурса_НижнийУровень.Очистить();
		КонецЕсли;
	КонецЕсли;
	 ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Если НЕ ТолькоНайтиСтроки И ТипЗнч(Дерево) <> Тип("ДанныеФормыДерево") Тогда
		Дерево.ИмяГруппировки = МассивГруппировок[СчетчикГруппировки];
		Если Дерево.ИмяГруппировки = "ПроектнаяЗадачаЗеркало" Тогда	
			МассивСтрокПЗ = мКэшЗначений.СтрокиПЗ_УровеньПЗ.Получить(Дерево.ПроектнаяЗадачаЗеркало);
			Если МассивСтрокПЗ = Неопределено Тогда
				МассивСтрокПЗ = Новый Массив;
				ОбновитьПревышениеКрайнегоСрокаПЗ(ЭтаФорма, Дерево.ПроектнаяЗадача, Дерево.ДатаЗавершенияНП, Дерево.КрайнийСрок);
			КонецЕсли;
			МассивСтрокПЗ.Добавить(Дерево.ПолучитьИдентификатор()); 
			мКэшЗначений.СтрокиПЗ_УровеньПЗ.Вставить(Дерево.ПроектнаяЗадачаЗеркало, МассивСтрокПЗ);		
		КонецЕсли;
	КонецЕсли;
	//Если ТипЗнч(Дерево) <> Тип("ДанныеФормыДерево") И Дерево.ИмяГруппировки = "ТрудовойРесурс" Тогда	
	//	Если СписокРесурсов.НайтиПоЗначению(Дерево.ТрудовойРесурс) = Неопределено Тогда
	//	КонецЕсли;
	//КонецЕсли;
	Если ЭлементыДерева.Количество() = 0 Тогда
		Если ТипЗнч(Дерево) <> Тип("ДанныеФормыДерево") Тогда
			
			МассивСтрокНижнегоУровня.Добавить(Дерево);
			
			Если НЕ ТолькоНайтиСтроки Тогда
			
				МассивСтрокПЗ = мКэшЗначений.СтрокиПЗ_НижнийУровень.Получить(Дерево.ПроектнаяЗадачаЗеркало);
				Если МассивСтрокПЗ = Неопределено Тогда
					МассивСтрокПЗ = Новый Массив;
				КонецЕсли;
				МассивСтрокПЗ.Добавить(Дерево.ПолучитьИдентификатор()); 
				мКэшЗначений.СтрокиПЗ_НижнийУровень.Вставить(Дерево.ПроектнаяЗадачаЗеркало, МассивСтрокПЗ);
				
				Если ЗначениеЗаполнено(Дерево.ТрудовойРесурс) Тогда
					МассивСтрокРесурса = мКэшЗначений.СтрокиРесурса_НижнийУровень.Получить(Дерево.ТрудовойРесурс);
					Если МассивСтрокРесурса = Неопределено Тогда
						МассивСтрокРесурса = Новый Массив;
					КонецЕсли;
					МассивСтрокРесурса.Добавить(Дерево.ПолучитьИдентификатор()); 
					мКэшЗначений.СтрокиРесурса_НижнийУровень.Вставить(Дерево.ТрудовойРесурс, МассивСтрокРесурса);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
			Если НЕ ТолькоНайтиСтроки Тогда
				ПолучитьСтрокиНижнегоУровня(ЭлементДерева, МассивСтрокНижнегоУровня, СчетчикГруппировки+1, МассивГруппировок);	
			Иначе
				ПолучитьСтрокиНижнегоУровня(ЭлементДерева, МассивСтрокНижнегоУровня, ,, Истина);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСтрокНижнегоУровня; 

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСписокВыбораУровнейГруппировок(ЭтаФорма, ЗаполнитьУровень = Ложь)

	СписокВыбора = ЭтаФорма.Элементы.УровеньГруппировок.СписокВыбора;
	СписокВыбора.Очистить();

	Если ЭтаФорма.Объект.ПорядокГруппировок = 0 Тогда
		СписокВыбора.Добавить(0, НСтр("ru = 'Трудовые ресурсы'"));
		СписокВыбора.Добавить(1, НСтр("ru = 'Роли'"));
		СписокВыбора.Добавить(2, НСтр("ru = 'Проекты'"));
		СписокВыбора.Добавить(3, НСтр("ru = 'Задачи'"));
	ИначеЕсли ЭтаФорма.Объект.ПорядокГруппировок = 1 Тогда
		СписокВыбора.Добавить(0, НСтр("ru = 'Проекты'"));
		СписокВыбора.Добавить(1, НСтр("ru = 'Задачи'"));
		СписокВыбора.Добавить(2, НСтр("ru = 'Роли'"));
		СписокВыбора.Добавить(3, НСтр("ru = 'Трудовые ресурсы'"));
	ИначеЕсли ЭтаФорма.Объект.ПорядокГруппировок = 2 Тогда
		СписокВыбора.Добавить(0, НСтр("ru = 'Трудовые ресурсы'"));
		СписокВыбора.Добавить(1, НСтр("ru = 'Задачи'"));
	КонецЕсли;

	Если ЗаполнитьУровень Тогда
		ЭтаФорма.Объект.УровеньГруппировок = ?(ЭтаФорма.Объект.ПорядокГруппировок = 2, 0, 3);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоДоУровня()
	
	упоОперацииСДеревьямиКлиент.РазвернутьДеревоДоУровня(Элементы.ДеревоФормы, 
		Объект.УровеньГруппировок, 
		ЭтотОбъект.СоотвУровняДерева);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция АдаптироватьЭлементы(ЭтаФорма) 
	
	Если ЭтаФорма.Объект.ПорядокГруппировок = 0	Тогда
		ЭтаФорма.Элементы.ДеревоФормыГруппировка.Заголовок = 
			НСтр("ru = 'Трудовой ресурс / Роль / Проект / Задача'");
	ИначеЕсли ЭтаФорма.Объект.ПорядокГруппировок = 1 Тогда
		ЭтаФорма.Элементы.ДеревоФормыГруппировка.Заголовок = 
			НСтр("ru = 'Проект / Задача / Роль / Трудовой ресурс'");
	ИначеЕсли ЭтаФорма.Объект.ПорядокГруппировок = 2 Тогда
		ЭтаФорма.Элементы.ДеревоФормыГруппировка.Заголовок = 
			НСтр("ru = 'Трудовой ресурс / Задача'");			
	КонецЕсли;
	ЭтаФорма.Элементы.ФормаКомандаПоказатьДиаграмму.Пометка = ЭтаФорма.Объект.ПоказатьДиаграмму;	
	ЭтаФорма.Элементы.ФормаКомандаПоказатьДиаграммуГанта.Пометка = ЭтаФорма.Объект.ПоказатьДиаграммуГанта;	
	ЭтаФорма.Элементы.ФормаКомандаПоказатьКолонкиРолей.Пометка = ЭтаФорма.Объект.ПоказатьКолонкиРолей;		
	//ЭтаФорма.Элементы.ФормаКомандаПоказатьКолонкиРолей.Пометка = ЭтаФорма.ПоказатьКолонкиРолей;		
	ЭтаФорма.Элементы.ФормаКомандаПоказатьКолонкиФакта.Пометка = ЭтаФорма.Объект.ПоказатьКолонкиФакта;		
	ЭтаФорма.Элементы.ФормаКомандаПоказатьПланЗаПериодом.Пометка = ЭтаФорма.Объект.ПоказатьПланЗаПериодом;		
	ЭтаФорма.Элементы.ФормаКомандаПоказатьКолонкиТекущееЗначение.Пометка = ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение;			
	ЭтаФорма.Элементы.ФормаКомандаПоказатьТекущиеСроки.Пометка = ЭтаФорма.Объект.ПоказатьТекущиеСроки;
	ЭтаФорма.Элементы.ФормаКомандаПоказатьТекущиеЗначенияНаДГ.Пометка = ЭтаФорма.Объект.ПоказыватьТекущиеЗначенияНаДГ;
	ЭтаФорма.Элементы.ФормаКомандаПоказыватьВыходные.Пометка = ЭтаФорма.Объект.ПоказыватьВыходные; 

КонецФункции

&НаКлиенте
Функция ПриИзмененииФильтров(Заполнение = Ложь) 

	Если ДеревоФормы.ПолучитьЭлементы().Количество() Тогда        
		ОписаниеОповещенияВопросОчисткиТаблицыЗавершение = Новый ОписаниеОповещения("ВопросОчисткиТаблицыЗавершение", 
																									ЭтаФорма, Заполнение);
		ТекстВопроса = НСтр("ru = 'Данные таблицы будут очищены. Продолжить?'");	
		ПоказатьВопрос(ОписаниеОповещенияВопросОчисткиТаблицыЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);		
	Иначе
		ВопросОчисткиТаблицыЗавершение(КодВозвратаДиалога.Да, Заполнение);
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ВопросОчисткиТаблицыЗавершение(РезультатВопроса, Заполнение) Экспорт 

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда		
		Если Заполнение Тогда
			ЗаполнитьИзБазыКлиент();
		Иначе
			ОчиститьДанные(ЭтаФорма);
			ОбновитьСоответствиеУровнейДерева();
		КонецЕсли;
	Иначе
		ЗагрузитьДанныеФормыИзОбъекта(Истина);
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ЗаполнитьИзБазыКлиент() 
	
	Если НЕ ПроверитьЗаполнение() Тогда
		ОчиститьДанные(ЭтаФорма);
		Возврат Неопределено;
	КонецЕсли;

	ОчиститьДанные(ЭтаФорма);
	ЗаполнитьСервер();
	ОбновитьСоответствиеУровнейДерева();
	РазвернутьДерево();

	упоРаботаСОчередямиКлиент.ВывестиОповещения(СписокОповещений);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОчиститьДанные(ЭтаФорма) 
	
	ЭтаФорма.ДеревоФормы.ПолучитьЭлементы().Очистить();
	ЭтаФорма.Диаграмма.Очистить();
	ОчиститьИтоги(ЭтаФорма);
	ЭтаФорма.ОбщаяПерегрузка = 0;
	ЭтаФорма.ОбщаяНедозагрузка = 0;
	ЭтаФорма.ОбщееПревышениеКритическихСроков = 0;
	Для Каждого СтрокаКолонок Из ЭтаФорма.КолонкиДат Цикл
		//Элементы[СтрокаКолонок.ИмяКолонки+"Группа"].Видимость = Ложь;
		
		ЭтаФорма["ИтогоНовоеЗначение"+СтрокаКолонок.ИмяКолонки] = 0;
		ЭтаФорма["ИтогоПоРоли"+СтрокаКолонок.ИмяКолонки] = 0;
		ЭтаФорма["ИтогоОтклонение"+СтрокаКолонок.ИмяКолонки] = 0;
		ЭтаФорма["ИтогоТекущееЗначение"+СтрокаКолонок.ИмяКолонки] = 0;
		ЭтаФорма["ИтогоФакт"+СтрокаКолонок.ИмяКолонки] = 0;

	КонецЦикла;
	ЭтаФорма.мКэшЗначений.СтрокиПЗ_НижнийУровень.Очистить();
	ЭтаФорма.мКэшЗначений.СтрокиПЗ_УровеньПЗ.Очистить();
	ЭтаФорма.мКэшЗначений.СтрокиРесурса_НижнийУровень.Очистить();
	
КонецФункции

&НаКлиенте
Функция УстановитьПризнакЗаписи(Признак, Строки = Неопределено) 
	
	Если Строки = Неопределено Тогда
		Строки = ДеревоФормы.ПолучитьЭлементы();
	КонецЕсли;
	ЭтоНижнегоУровняЭлементы = Неопределено;
	Для Каждого Строка Из Строки Цикл 
		СтрокиПодч = Строка.ПолучитьЭлементы();
		Если ЭтоНижнегоУровняЭлементы = Неопределено Тогда
			ЭтоНижнегоУровняЭлементы = СтрокиПодч.Количество() = 0;	
		КонецЕсли;
		Если ЭтоНижнегоУровняЭлементы Тогда
			Если Строка.Редактируется И Строка.ЕстьПраваНаРедактирование Тогда
				Строка.Записывать = Признак;
			КонецЕсли;	
		Иначе
			УстановитьПризнакЗаписи(Признак, СтрокиПодч);
		КонецЕсли;		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт

	Если Период <> Неопределено Тогда
		
		Если ПериодПоДням() Тогда
			НачалоПериодаНаФорме = НачалоДня(Период.ДатаНачала);
			КонецПериодаНаФорме = КонецДня(Период.ДатаОкончания);	
		Иначе
			НачалоПериодаНаФорме = НачалоМесяца(Период.ДатаНачала);
			КонецПериодаНаФорме = КонецМесяца(Период.ДатаОкончания);	
		КонецЕсли;
		
		УстановитьЗаголовокВыбораПериода(ЭтаФорма);
		
		ПриИзмененииФильтров();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокВыбораПериода(ЭтаФорма)

	Если ПериодПоДням() Тогда
		Формат = "ДФ='dd MMMM yyyy'";
	Иначе
		Формат = "ДФ='MMMM yyyy ""г.""'";
	КонецЕсли;

	ЭтаФорма.Элементы.ФормаВыбратьПериод.Заголовок = НСтр("ru = 'Период с'") + " "  
										+ Формат(ЭтаФорма.НачалоПериодаНаФорме, Формат)  
										+  " " + НСтр("ru = 'по'") + " " 
										+ Формат(ЭтаФорма.КонецПериодаНаФорме, Формат);
		
КонецПроцедуры
								
&НаКлиентеНаСервереБезКонтекста
Функция ПериодПоДням() 
	Возврат Истина;
КонецФункции								

&НаКлиенте
Функция УстановитьВидимостьДоступностьЭлементовКлиент() 
	
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма) 	
	
	//ЭтаФорма.Элементы.Диаграмма.Видимость = ЭтаФорма.Объект.ПоказатьДиаграмму;
	//ЭтаФорма.Элементы.РесурсДиаграммыПоРесурсу.Видимость = ЭтаФорма.Объект.ПоказатьДиаграмму;	
	//ЭтаФорма.Элементы.ДиаграммаГанта.Видимость = ЭтаФорма.Объект.ПоказатьДиаграммуГанта;
	//Для Каждого СтрокаКолонок ИЗ ЭтаФорма.КолонкиДат Цикл
	//	ЭтаФорма.Элементы[СтрокаКолонок.ИмяКолонки+"ПоРоли"].Видимость = ЭтаФорма.Объект.ПоказатьКолонкиРолей;
	//	ЭтаФорма.Элементы[СтрокаКолонок.ИмяКолонки+"Факт"].Видимость = ЭтаФорма.Объект.ПоказатьКолонкиФакта;
	//	ЭтаФорма.Элементы[СтрокаКолонок.ИмяКолонки+"ТекущееЗначение"].Видимость = ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение;
	//	ЭтаФорма.Элементы[СтрокаКолонок.ИмяКолонки+"Отклонение"].Видимость = ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение;
	//КонецЦикла;	
	//ЭтаФорма.Элементы.ДеревоФормыФакт.Видимость = ЭтаФорма.Объект.ПоказатьКолонкиФакта;
	//ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуПоРоли.Видимость = ЭтаФорма.Объект.ПоказатьКолонкиРолей;
	//ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуФакт.Видимость = ЭтаФорма.Объект.ПоказатьКолонкиФакта;	
	//ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуТекущееЗначение.Видимость = ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение;	
	//ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуОтклонение.Видимость = ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение;	
	//ЭтаФорма.Элементы.ДеревоФормыИтогТекущееЗначение.Видимость = ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение;		
	//ЭтаФорма.Элементы.ДеревоФормыТрудозатратыПланДоПериода.Видимость = ЭтаФорма.Объект.ПоказатьПланЗаПериодом;
	//ЭтаФорма.Элементы.ДеревоФормыТрудозатратыПланПослеПериода.Видимость = ЭтаФорма.Объект.ПоказатьПланЗаПериодом;	

	МассивКолонок = Новый Массив;
	Для Каждого СтрокаКолонок Из ЭтаФорма.КолонкиДат Цикл
		МассивКолонок.Добавить(СтрокаКолонок.ИмяКолонки);
		ЭтаФорма.Элементы[СтрокаКолонок.ИмяКолонки+"Группа"].Видимость = НЕ СтрокаКолонок.Выходной ИЛИ ЭтаФорма.Объект.ПоказыватьВыходные;
	КонецЦикла;

	ВидимостьЭлемента(ЭтаФорма.Элементы.Диаграмма, ЭтаФорма.Объект.ПоказатьДиаграмму);
	ВидимостьЭлемента(ЭтаФорма.Элементы.РесурсДиаграммыПоРесурсу, ЭтаФорма.Объект.ПоказатьДиаграмму ИЛИ 
																		(ЭтаФорма.Объект.ПоказатьДиаграммуГанта И ЭтаФорма.Объект.ПорядокГруппировок = 2));	
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДиаграммаГанта, ЭтаФорма.Объект.ПоказатьДиаграммуГанта);
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		//ВидимостьЭлемента(ЭтаФорма.Элементы[ИмяКолонки+"ПоРоли"], ЭтаФорма.Объект.ПоказатьКолонкиРолей);
		//ВидимостьЭлемента(ЭтаФорма.Элементы[СтрокаКолонок.ИмяКолонки+"ПоРоли"], ЭтаФорма.ПоказатьКолонкиРолей);
		ВидимостьЭлемента(ЭтаФорма.Элементы[ИмяКолонки+"Факт"], ЭтаФорма.Объект.ПоказатьКолонкиФакта);
		ВидимостьЭлемента(ЭтаФорма.Элементы[ИмяКолонки+"ТекущееЗначение"], ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение);
		ВидимостьЭлемента(ЭтаФорма.Элементы[ИмяКолонки+"Отклонение"], ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение);
	КонецЦикла;	
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыФакт, ЭтаФорма.Объект.ПоказатьКолонкиФакта);
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуПоРоли, ЭтаФорма.Объект.ПоказатьКолонкиРолей);
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыИтогПоРоли, ЭтаФорма.Объект.ПоказатьКолонкиРолей);
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуФакт, ЭтаФорма.Объект.ПоказатьКолонкиФакта);	
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуТекущееЗначение, ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение);	
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыИтогПоПериодуОтклонение, ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение);	
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыИтогТекущееЗначение, ЭтаФорма.Объект.ПоказатьКолонкиТекущееЗначение);		
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыТрудозатратыПланДоПериода, ЭтаФорма.Объект.ПоказатьПланЗаПериодом);
	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыТрудозатратыПланПослеПериода, ЭтаФорма.Объект.ПоказатьПланЗаПериодом);

	ВидимостьЭлемента(ЭтаФорма.Элементы.ДеревоФормыГруппаТекущиеСроки, ЭтаФорма.Объект.ПоказатьТекущиеСроки);

	ЭтаФорма.Элементы.ДеревоФормыКонтекстноеМенюПереместить.Видимость = ЭтаФорма.Объект.ПорядокГруппировок = 2;
	//ЭтаФорма.Элементы.ГруппаСтатистика.Видимость = ЭтаФорма.Объект.ПорядокГруппировок = 2;	
	ЭтаФорма.Элементы.ГруппаСтатистика.Видимость = Ложь;	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьЭлемента(Элемент, Видимость) 
	
	упоРаботаСФормамиКлиентСервер.ВидимостьЭлемента(Элемент, Видимость);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьНаПериод(Вперед = Истина) 
	
	ПоследовательностьКолонок = ПолучитьПоследовательностьКолонок(Вперед);		
	КоличествоКолонок = ПоследовательностьКолонок.Количество();
	МассивВыделенныхСтрок = ПолучитьМассивВыделенныхСтрок();
	Для Каждого ВыделеннаяСтрока Из МассивВыделенныхСтрок Цикл
		Если Не ВыделеннаяСтрока.ЕстьПраваНаРедактирование Тогда
			Продолжить;
		КонецЕсли;	
		сч = ПоследовательностьКолонок.Количество()-1;
		Пока сч >= 1 Цикл			
			ТекКолонка = ПоследовательностьКолонок[сч];
			ПредКолонка = ПоследовательностьКолонок[сч-1];			
			Если ВыделеннаяСтрока[ПредКолонка+"НовоеЗначение"] <> 0 Тогда
				УстановитьТрудозатраты(ЭтаФорма, ВыделеннаяСтрока, ТекКолонка, 
						ВыделеннаяСтрока[ТекКолонка+"НовоеЗначение"] + ВыделеннаяСтрока[ПредКолонка+"НовоеЗначение"]);
				УстановитьТрудозатраты(ЭтаФорма, ВыделеннаяСтрока, ПредКолонка, 0);						
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивВыделенныхСтрок(МассивСтрок = Неопределено, Строка = Неопределено) 

	Если МассивСтрок = Неопределено Тогда
		МассивСтрок = Новый Массив;				
	КонецЕсли;

	Если Строка = Неопределено Тогда
		Для Каждого Ид Из Элементы.ДеревоФормы.ВыделенныеСтроки Цикл
			тСтрока = ДеревоФормы.НайтиПоИдентификатору(Ид);
			ПолучитьМассивВыделенныхСтрок(МассивСтрок, тСтрока);
		КонецЦикла;		
	ИначеЕсли НЕ Строка.ПоследнийУровень Тогда
		тЭлементы = Строка.ПолучитьЭлементы();
		Для Каждого тЭлемент Из тЭлементы Цикл
			ПолучитьМассивВыделенныхСтрок(МассивСтрок, тЭлемент);
		КонецЦикла;
	Иначе
		МассивСтрок.Добавить(Строка);	
	КонецЕсли;

	Возврат МассивСтрок;

КонецФункции

&НаКлиенте
Функция ПолучитьПоследовательностьКолонок(Вперед = Истина, УчитыватьВыходные = Ложь) 
	
	ПоследовательностьКолонок = Новый Массив;
	Если Вперед Тогда
		Для Каждого СтрокаКолонок Из КолонкиДат Цикл
			Если НЕ СтрокаКолонок.Выходной ИЛИ УчитыватьВыходные Тогда
				ПоследовательностьКолонок.Добавить(СтрокаКолонок.ИмяКолонки);
			КонецЕсли;
		КонецЦикла;
	Иначе
		сч = КолонкиДат.Количество() - 1;
		Пока сч >= 0 Цикл
			СтрокаКолонок = КолонкиДат[сч]; 
			Если НЕ СтрокаКолонок.Выходной ИЛИ УчитыватьВыходные Тогда
				ПоследовательностьКолонок.Добавить(СтрокаКолонок.ИмяКолонки);	
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПоследовательностьКолонок;
	
КонецФункции

&НаКлиенте
Процедура РесурсДиаграммыПоРесурсуПриИзменении(Элемент)
	
	упоПланированиеТрудозатратКлиентСервер.ПостроитьДиаграмму(ЭтаФорма, "ПоРесурсам");
	ПостроитьДиаграммуГанта(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьЗадачуСервер(ИдСтрокиНижнегоУровня, Направление) 

	ИдСтроки = ИдСтрокиНижнегоУровня;

	СтрокаДерева = ДеревоФормы.НайтиПоИдентификатору(ИдСтроки);
	ДанныеПЗ = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс, ПроектнаяЗадачаЗеркало, Роль, Подразделение,
					| ДанныеПЗ, ДатаЗавершенияНП, ДатаНачалаТП, ДатаНачалаНП, ИтогПоПериодуПоРоли");
	ЗаполнитьЗначенияСвойств(ДанныеПЗ, СтрокаДерева);

	ЗагрузитьДанныеОбъектаИзФормы(Объект);	

	ГраницыЗагрузки = ДанныеОбъекта_ОпределитьГраницыЗагрузки(ДанныеПЗ.ПроектнаяЗадача, ДанныеПЗ.ТрудовойРесурс, ДанныеПЗ.Роль, "НовоеЗначение", Истина);

	Если ГраницыЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеПредПЗ = ДанныеОбъекта_ОпределитьЗадачуПред(ДанныеПЗ.ТрудовойРесурс, ГраницыЗагрузки.Начало, ГраницыЗагрузки.Конец, Направление, "НовоеЗначение"); 

	Если ДанныеПредПЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ДанныеОбъекта_ДанныеМожноРедактировать(ДанныеПредПЗ.ПроектнаяЗадача, ДанныеПЗ.ТрудовойРесурс, ДанныеПредПЗ.Роль) Тогда
		Возврат;		
	КонецЕсли;

	ГраницыЗагрузкиПредПЗ = ДанныеОбъекта_ОпределитьГраницыЗагрузки(ДанныеПредПЗ.ПроектнаяЗадача, ДанныеПЗ.ТрудовойРесурс, ДанныеПредПЗ.Роль, "НовоеЗначение", Истина);

	Если ГраницыЗагрузкиПредПЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеОбъекта_УдалитьДанныеРаспределения(ДанныеПЗ.ТрудовойРесурс, ДанныеПЗ.ПроектнаяЗадача, "НовоеЗначение", ДанныеПЗ.Роль);
	ДанныеОбъекта_УдалитьДанныеРаспределения(ДанныеПЗ.ТрудовойРесурс, ДанныеПредПЗ.ПроектнаяЗадача, "НовоеЗначение", ДанныеПредПЗ.Роль);

	Если Объект.ДанныеКалендаря.Количество() Тогда
		Объект.ДанныеКалендаря.Сортировать("День"); 
		КалендарьПоДату = Объект.ДанныеКалендаря[Объект.ДанныеКалендаря.Количество()-1]; 
	Иначе
		КалендарьПоДату = Неопределено;
	КонецЕсли;		

	МассивЗагрузкиПервый = ?(Направление = -1, ГраницыЗагрузки.МассивЗагрузки, ГраницыЗагрузкиПредПЗ.МассивЗагрузки);
	МассивЗагрузкиВторой = ?(Направление = 1, ГраницыЗагрузки.МассивЗагрузки, ГраницыЗагрузкиПредПЗ.МассивЗагрузки);

	ДанныеПервой = ?(Направление = -1, ДанныеПЗ, ДанныеПредПЗ);
	ДанныеВторой = ?(Направление = 1, ДанныеПЗ, ДанныеПредПЗ);

	Начало = Мин(ГраницыЗагрузкиПредПЗ.Начало, ГраницыЗагрузки.Начало);
	ПоследняяДата = Начало; 
	сч = 0;

	ТекДата = Начало;

	КалендарьПоДату = Неопределено;

	Пока сч <= МассивЗагрузкиПервый.Количество() - 1 Цикл
		
		СтрокаКалендрая = Неопределено;
		СтрокиКалендаря = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", ТекДата));
		Если СтрокиКалендаря.Количество() = 0 Тогда
			Если КалендарьПоДату = Неопределено ИЛИ КалендарьПоДату < ТекДата Тогда
				КалендарьПоДату = ДобавитьМесяц(ТекДата, 1);
				ОбновитьДопДанные(КалендарьПоДату);
				СтрокиКалендаря = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", ТекДата));
				Если СтрокиКалендаря.Количество() <> 0 Тогда
					СтрокаКалендаря = СтрокиКалендаря[0]; 	
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаКалендаря = СтрокиКалендаря[0]; 	
		КонецЕсли;
		
		Если НЕ СтрокаКалендаря = Неопределено И СтрокаКалендаря.КоличествоЧасов = 0 Тогда
			ТекДата = ТекДата + 24*3600;
			Продолжить;
		КонецЕсли;
			
		СтрокаНов = Объект.РаспределениеПоПериоду.Добавить();
		СтрокаНов.Дата = ТекДата;
		СтрокаНов.Значение = МассивЗагрузкиПервый[сч];
		СтрокаНов.Подразделение = ДанныеПервой.Подразделение;
		СтрокаНов.ТрудовойРесурс = ДанныеПЗ.ТрудовойРесурс;
		СтрокаНов.Роль = ДанныеПервой.Роль;
		СтрокаНов.ПроектнаяЗадача = ДанныеПервой.ПроектнаяЗадача;			
		СтрокаНов.ТипДанных = "НовоеЗначение";
		
		ПоследняяДата = ТекДата;
		сч = сч +1;		
		
		ТекДата = ТекДата + 24*3600;
		
	КонецЦикла;
		
	Начало = ПоследняяДата + 24*3600;
	ПоследняяДата = Начало; 
	ТекДата = Начало;
	сч = 0;

	Пока сч <= МассивЗагрузкиВторой.Количество() - 1 Цикл
				
		СтрокаКалендрая = Неопределено;
		СтрокиКалендаря = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", ТекДата));
		Если СтрокиКалендаря.Количество() = 0 Тогда
			Если КалендарьПоДату = Неопределено ИЛИ КалендарьПоДату < ТекДата Тогда
				КалендарьПоДату = ДобавитьМесяц(ТекДата, 1);
				ОбновитьДопДанные(КалендарьПоДату);
				СтрокиКалендаря = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", ТекДата));
				Если СтрокиКалендаря.Количество() <> 0 Тогда
					СтрокаКалендаря = СтрокиКалендаря[0]; 	
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтрокаКалендаря = СтрокиКалендаря[0]; 	
		КонецЕсли;
			
		Если НЕ СтрокаКалендаря = Неопределено И СтрокаКалендаря.КоличествоЧасов = 0 Тогда
			ТекДата = ТекДата + 24*3600;
			Продолжить;
		КонецЕсли;
			
		СтрокаНов = Объект.РаспределениеПоПериоду.Добавить();
		СтрокаНов.Дата = ТекДата;
		СтрокаНов.Значение = МассивЗагрузкиВторой[сч];
		СтрокаНов.Подразделение = ДанныеВторой.Подразделение;
		СтрокаНов.ТрудовойРесурс = ДанныеПЗ.ТрудовойРесурс;
		СтрокаНов.Роль = ДанныеВторой.Роль;
		СтрокаНов.ПроектнаяЗадача = ДанныеВторой.ПроектнаяЗадача;			
		СтрокаНов.ТипДанных = "НовоеЗначение";
		
		ПоследняяДата = ТекДата;
		сч = сч +1;		
		
		ТекДата = ТекДата + 24*3600;
		
	КонецЦикла;


	Объект.КонецПериода = Макс(Объект.КонецПериода, ПоследняяДата);

	ДанныеОбъекта_ОпределитьНовыеДатыПЗ(ДанныеПЗ.ПроектнаяЗадача);
	ДанныеОбъекта_ОпределитьНовыеДатыПЗ(ДанныеПредПЗ.ПроектнаяЗадача);

	//	

	ЗагрузитьДанныеФормыИзОбъекта();
	АдаптироватьЭлементы(ЭтаФорма);
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЗадачуКлиент(Направление)
	
	ТекДанные = Элементы.ДеревоФормы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ЭтоПоследнийУровеньГруппировки = ТекДанные.ПоследнийУровень 
			И Объект.ПорядокГруппировок = 2 
			И ЗначениеЗаполнено(ТекДанные.ТрудовойРесурс)
			И ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадача);
			
		Если ЭтоПоследнийУровеньГруппировки Тогда
			ПереместитьЗадачуСервер(ТекДанные.ПолучитьИдентификатор(), Направление);
			РазвернутьДерево();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ДанныеОбъекта_ДанныеМожноРедактировать(ПЗ, Ресурс, Роль) 

	СтруктураОтбора = Новый Структура("ТрудовойРесурс, ПроектнаяЗадача, Роль, Редактируется", Ресурс, ПЗ, Роль, Истина);

	Возврат Объект.Данные.НайтиСтроки(СтруктураОтбора).Количество();

КонецФункции

&НаСервере
Функция ДанныеОбъекта_ОпределитьГраницыЗагрузки(ПЗ, Ресурс, Роль, ТипДанных = "НовоеЗначение", ПолучитьМассивЗагрузки = Ложь) 

	Результат = Неопределено;

	СтруктураОтбора = Новый Структура("ТрудовойРесурс, ПроектнаяЗадача, Роль, ТипДанных", Ресурс, ПЗ, Роль, ТипДанных);
	Если ПолучитьМассивЗагрузки Тогда		
		СтрокиРаспределения = Объект.РаспределениеПоПериоду.Выгрузить(СтруктураОтбора);
		СтрокиРаспределения.Сортировать("Дата");
		МассивЗагрузки = Новый Массив;
	Иначе		
		СтрокиРаспределения = Объект.РаспределениеПоПериоду.НайтиСтроки(СтруктураОтбора);
	КонецЕсли;
		
	МаксДата = Дата(1,1,1);
	МинДата = Объект.КонецПериода + 24*3600;

	ПредДата = Неопределено;

	Для Каждого Строка Из СтрокиРаспределения Цикл
		Если ПолучитьМассивЗагрузки Тогда
			Если ПредДата <> Неопределено Тогда
				НоваяОжидаемаяДата = ПредДата + 24*3600;
				Если Строка.Дата > НоваяОжидаемаяДата Тогда
					ДатаДобавленияПустого = НоваяОжидаемаяДата;
					Пока ДатаДобавленияПустого < Строка.Дата Цикл
						СтрокаКалендаря = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", ДатаДобавленияПустого));
						Если СтрокаКалендаря.Количество() И СтрокаКалендаря[0].КоличествоЧасов <> 0 Тогда					
							МассивЗагрузки.Добавить(0);	
						КонецЕсли;
						ДатаДобавленияПустого = ДатаДобавленияПустого + 24 * 3600;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Строка.Значение) Тогда
				МассивЗагрузки.Добавить(Строка.Значение);	
			Иначе
				СтрокаКалендаря = Объект.ДанныеКалендаря.НайтиСтроки(Новый Структура("День", Строка.Дата));
				Если СтрокаКалендаря.Количество() И СтрокаКалендаря[0].КоличествоЧасов <> 0 Тогда					
					МассивЗагрузки.Добавить(Строка.Значение);	
				КонецЕсли;
			КонецЕсли;
			ПредДата = Строка.Дата;
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Значение) Тогда
			МаксДата = Макс(Строка.Дата, МаксДата);
			МинДата = Мин(Строка.Дата, МинДата);
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(МаксДата) Тогда
		Результат = Новый Структура("Начало, Конец", МинДата, МаксДата);
		Если ПолучитьМассивЗагрузки Тогда
			Результат.Вставить("МассивЗагрузки", МассивЗагрузки);
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

&НаСервере
Функция ДанныеОбъекта_ОпределитьЗадачуПред(Ресурс, Начало, Конец, Направление, ТипДанных = "НовоеЗначение") 

	СтруктураОтбора = Новый Структура("ТрудовойРесурс, ТипДанных", Ресурс, ТипДанных);
	СтрокиРаспределения = Объект.РаспределениеПоПериоду.НайтиСтроки(СтруктураОтбора);

	МаксДата = Дата(1,1,1);
	МинДата = Объект.КонецПериода+24*3600;
	ПроектнаяЗадача = Неопределено;
	Роль = Неопределено;
	Подразделение = Неопределено;

	Если Направление = -1 Тогда
		Для Каждого Строка Из СтрокиРаспределения Цикл
			Если НЕ Строка.Дата < Начало ИЛИ НЕ ЗначениеЗаполнено(Строка.Значение) Тогда
				Продолжить;
			КонецЕсли;	
			Если Строка.Дата > МаксДата Тогда
				МаксДата = Строка.Дата;
				ПроектнаяЗадача = Строка.ПроектнаяЗадача;
				Роль = Строка.Роль;
				Подразделение = Строка.Подразделение; 
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Направление = 1 Тогда
		Для Каждого Строка Из СтрокиРаспределения Цикл
			Если Строка.Дата <= Конец ИЛИ НЕ ЗначениеЗаполнено(Строка.Значение) Тогда
				Продолжить;
			КонецЕсли;	
			Если Строка.Дата < МинДата Тогда
				МинДата = Строка.Дата;
				ПроектнаяЗадача = Строка.ПроектнаяЗадача;
				Роль = Строка.Роль;
				Подразделение = Строка.Подразделение; 
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;

	Если ПроектнаяЗадача <> Неопределено Тогда
		Возврат Новый Структура("ПроектнаяЗадача, Роль, Подразделение", 
									ПроектнаяЗадача, Роль, Подразделение);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ЗаписатьНастройкуЗаписыватьСрокиЗадач()
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("Документ.упоПланированиеТрудозатратПоТрудовымРесурсам", 
		"НеЗаписыватьСрокиЗадач", Объект.НеЗаписыватьСрокиЗадач,, ИмяПользователя());
	
КонецПроцедуры

&НаСервере
Процедура РаспределениеПоПериодуПоСтрокамБезРесурса(КонецПериодаНовый = Неопределено)

	Если Объект.Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	

	// Распределение по проектным задачам без ресурсов.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Данные.Подразделение КАК Подразделение,
	               |	Данные.Роль КАК Роль,
	               |	Данные.ПрофильРаспределенияРоли КАК ПрофильРаспределенияРоли,
	               |	Данные.ДатаНачалаТП КАК ДатаНачала,
	               |	Данные.ДатаЗавершенияТП КАК ДатаЗавершения,
	               |	Данные.ИтогПоРоли КАК ИтогПоРоли
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	&Данные КАК Данные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Данные.Подразделение КАК Подразделение,
	               |	Данные.Роль КАК Роль,
	               |	Данные.ПрофильРаспределенияРоли КАК ПрофильРаспределенияРоли,
	               |	Данные.ДатаНачала КАК ДатаНачала,
	               |	Данные.ДатаЗавершения КАК ДатаЗавершения,
	               |	Данные.ИтогПоРоли КАК ИтогПоРоли,
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ ДанныеСВерсией
	               |ИЗ
	               |	Данные КАК Данные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО Данные.ПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДанныеСВерсией.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДанныеСВерсией.Подразделение КАК Подразделение,
	               |	ДанныеСВерсией.Роль КАК Роль,
	               |	ДанныеСВерсией.ПрофильРаспределенияРоли КАК ПрофильРаспределенияРоли,
	               |	МИНИМУМ(ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан, ДанныеСВерсией.ДатаНачала)) КАК ДатаНачала,
	               |	МАКСИМУМ(ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан, ДанныеСВерсией.ДатаЗавершения)) КАК ДатаЗавершения,
	               |	ДанныеСВерсией.ИтогПоРоли КАК ИтогПоРоли,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи, ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
	               |				ТОГДА ЕСТЬNULL(упоКалендариПроектовСрезПоследних.КалендарьПроекта, ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка))
	               |			ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи
	               |		КОНЕЦ) КАК Календарь
	               |ИЗ
	               |	ДанныеСВерсией КАК ДанныеСВерсией
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО ДанныеСВерсией.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК упоКалендариПроектовСрезПоследних
	               |		ПО ДанныеСВерсией.ПроектнаяЗадача.Проект = упоКалендариПроектовСрезПоследних.Проект
	               |			И ДанныеСВерсией.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ПО ДанныеСВерсией.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И ДанныеСВерсией.Версия = упоСрокиПроектныхЗадачСрезПоследних.Версия
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеСВерсией.ПроектнаяЗадача,
	               |	ДанныеСВерсией.Подразделение,
	               |	ДанныеСВерсией.Роль,
	               |	ДанныеСВерсией.ПрофильРаспределенияРоли,
	               |	ДанныеСВерсией.ИтогПоРоли";
	Запрос.УстановитьПараметр("Данные", Объект.Данные.Выгрузить());               

	Выборка = Запрос.Выполнить().Выбрать();

	ТаблицаРесурсов = Новый ТаблицаЗначений;
	ТаблицаРесурсов.Колонки.Добавить("ПрофильРаспределения");
	ТаблицаРесурсов.Колонки.Добавить("ЕдиницаНормирования");
	ТаблицаРесурсов.Колонки.Добавить("Количество");
	ТаблицаРесурсов.Колонки.Добавить("Ресурс");
	ТаблицаРесурсов.Колонки.Добавить("Роль");
	ТаблицаРесурсов.Колонки.Добавить("СпособПривязки");
	ТаблицаРесурсов.Колонки.Добавить("ОбщСтоимость");
	ТаблицаРесурсов.Колонки.Добавить("ОбщВнешняяСтоимость");		
	ТаблицаРесурсов.Колонки.Добавить("Стоимость");
	ТаблицаРесурсов.Колонки.Добавить("ВнешняяСтоимость");
	ТаблицаРесурсов.Колонки.Добавить("УровеньПланирования");
	ТаблицаРесурсов.Колонки.Добавить("Подразделение");
	ТаблицаРесурсов.Колонки.Добавить("ИсточникПлана");
	СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения;;
	УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
	Ресурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	ИсточникПлана = Перечисления.упоИсточникПланаТрудозатратРолей.Трудозатраты;

	Пока Выборка.Следующий() Цикл

		ТаблицаРесурсов.Очистить();
		
		СтрокаРесурсов = ТаблицаРесурсов.Добавить();
		СтрокаРесурсов.ЕдиницаНормирования = Справочники.упоЕдиницыВремени.Час;
		СтрокаРесурсов.Подразделение = Выборка.Подразделение;
		СтрокаРесурсов.Роль = Выборка.Роль;	
		СтрокаРесурсов.Ресурс = Ресурс;	
		СтрокаРесурсов.СпособПривязки = СпособПривязки;
		СтрокаРесурсов.УровеньПланирования = УровеньПланирования;
		СтрокаРесурсов.ОбщСтоимость = 0;
		СтрокаРесурсов.Стоимость = 0;
		СтрокаРесурсов.ОбщВнешняяСтоимость = 0;
		СтрокаРесурсов.ВнешняяСтоимость = 0;		
		СтрокаРесурсов.ПрофильРаспределения = Выборка.ПрофильРаспределенияРоли;
		СтрокаРесурсов.Количество = Выборка.ИтогПоРоли;
		СтрокаРесурсов.ИсточникПлана = ИсточникПлана;
		
		РезультатРаспределения = упоРаспределениеТрудозатратВызовСервера.РаспределитьТрудозатратыПоПрофилям(ТаблицаРесурсов, Выборка.Календарь, Выборка.ДатаНачала, Выборка.ДатаЗавершения, Ложь); 
		
		Если РезультатРаспределения <> Неопределено И РезультатРаспределения.Строки.Количество() > 0 Тогда
			
			Для Каждого СтрокаЗагрузки Из РезультатРаспределения.Строки[0].Строки Цикл
				
				Если КонецПериодаНовый = Неопределено Тогда
					Если СтрокаЗагрузки.День < Объект.НачалоПериода ИЛИ СтрокаЗагрузки.День > Объект.КонецПериода Тогда
						СтрокаНов = Объект.ТрудозатратыЗаПериодомПланирования.Добавить();
						СтрокаНов.Дата = СтрокаЗагрузки.День;
						СтрокаНов.Трудозатраты = СтрокаЗагрузки.Трудозатраты;
						СтрокаНов.Подразделение = Выборка.Подразделение;
						СтрокаНов.Ресурс = Ресурс;
						СтрокаНов.Роль = Выборка.Роль;
						СтрокаНов.ПроектнаяЗадача = Выборка.ПроектнаяЗадача;			
					Иначе	
						СтрокаНов = Объект.РаспределениеПоПериоду.Добавить();
						СтрокаНов.Дата = СтрокаЗагрузки.День;
						СтрокаНов.Значение = СтрокаЗагрузки.Трудозатраты;
						СтрокаНов.Подразделение = Выборка.Подразделение;
						СтрокаНов.ТрудовойРесурс = Ресурс;
						СтрокаНов.Роль = Выборка.Роль;
						СтрокаНов.ПроектнаяЗадача = Выборка.ПроектнаяЗадача;			
						СтрокаНов.ТипДанных = "НовоеЗначение";
					КонецЕсли;
				Иначе
					Если СтрокаЗагрузки.День > Объект.КонецПериода И СтрокаЗагрузки.День <= КонецПериодаНовый Тогда
						СтрокаНов = Объект.РаспределениеПоПериоду.Добавить();
						СтрокаНов.Дата = СтрокаЗагрузки.День;
						СтрокаНов.Значение = СтрокаЗагрузки.Трудозатраты;
						СтрокаНов.Подразделение = Выборка.Подразделение;
						СтрокаНов.ТрудовойРесурс = Ресурс;
						СтрокаНов.Роль = Выборка.Роль;
						СтрокаНов.ПроектнаяЗадача = Выборка.ПроектнаяЗадача;			
						СтрокаНов.ТипДанных = "ПоРоли";
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

	Если КонецПериодаНовый <> Неопределено Тогда
		Возврат;
	КонецЕсли;	

	// Распределение по проектным задачам без ресурсов с учетом назначений.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаспределениеПоПериоду.Дата КАК Дата,
	               |	РаспределениеПоПериоду.Значение КАК Значение,
	               |	РаспределениеПоПериоду.Подразделение КАК Подразделение,
	               |	РаспределениеПоПериоду.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	РаспределениеПоПериоду.Роль КАК Роль,
	               |	РаспределениеПоПериоду.ТипДанных КАК ТипДанных,
	               |	РаспределениеПоПериоду.ТрудовойРесурс КАК ТрудовойРесурс
	               |ПОМЕСТИТЬ РаспределениеПоПериоду
	               |ИЗ
	               |	&РаспределениеПоПериоду КАК РаспределениеПоПериоду
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеПоПериоду.Дата КАК Дата,
	               |	РаспределениеПоПериоду.Значение КАК Значение,
	               |	РаспределениеПоПериоду.Подразделение КАК Подразделение,
	               |	РаспределениеПоПериоду.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	РаспределениеПоПериоду.Роль КАК Роль,
	               |	РаспределениеПоПериоду.ТипДанных КАК ТипДанных,
	               |	РаспределениеПоПериоду.ТрудовойРесурс КАК ТрудовойРесурс
	               |ПОМЕСТИТЬ РаспределениеПоПериодуНеСгруппированное
	               |ИЗ
	               |	РаспределениеПоПериоду КАК РаспределениеПоПериоду
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РаспределениеПоПериоду.Дата,
	               |	-РаспределениеПоПериоду.Значение,
	               |	РаспределениеПоПериоду.Подразделение,
	               |	РаспределениеПоПериоду.ПроектнаяЗадача,
	               |	РаспределениеПоПериоду.Роль,
	               |	РаспределениеПоПериоду.ТипДанных,
	               |	ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |ИЗ
	               |	РаспределениеПоПериоду КАК РаспределениеПоПериоду
	               |ГДЕ
	               |	РаспределениеПоПериоду.ТрудовойРесурс <> ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |	И РаспределениеПоПериоду.ТипДанных <> ""ТекущееЗначение""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеПоПериодуНеСгруппированное.Дата КАК Дата,
	               |	СУММА(РаспределениеПоПериодуНеСгруппированное.Значение) КАК Значение,
	               |	РаспределениеПоПериодуНеСгруппированное.Подразделение КАК Подразделение,
	               |	РаспределениеПоПериодуНеСгруппированное.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	РаспределениеПоПериодуНеСгруппированное.Роль КАК Роль,
	               |	РаспределениеПоПериодуНеСгруппированное.ТипДанных КАК ТипДанных,
	               |	РаспределениеПоПериодуНеСгруппированное.ТрудовойРесурс КАК ТрудовойРесурс
	               |ИЗ
	               |	РаспределениеПоПериодуНеСгруппированное КАК РаспределениеПоПериодуНеСгруппированное
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаспределениеПоПериодуНеСгруппированное.ТипДанных,
	               |	РаспределениеПоПериодуНеСгруппированное.ТрудовойРесурс,
	               |	РаспределениеПоПериодуНеСгруппированное.Дата,
	               |	РаспределениеПоПериодуНеСгруппированное.ПроектнаяЗадача,
	               |	РаспределениеПоПериодуНеСгруппированное.Роль,
	               |	РаспределениеПоПериодуНеСгруппированное.Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТрудозатратыЗаПериодомПланирования.Дата КАК Дата,
	               |	ТрудозатратыЗаПериодомПланирования.Трудозатраты КАК Трудозатраты,
	               |	ТрудозатратыЗаПериодомПланирования.Подразделение КАК Подразделение,
	               |	ТрудозатратыЗаПериодомПланирования.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТрудозатратыЗаПериодомПланирования.Роль КАК Роль,
	               |	ТрудозатратыЗаПериодомПланирования.Ресурс КАК Ресурс
	               |ПОМЕСТИТЬ ТрудозатратыЗаПериодомПланирования
	               |ИЗ
	               |	&ТрудозатратыЗаПериодомПланирования КАК ТрудозатратыЗаПериодомПланирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТрудозатратыЗаПериодомПланирования.Дата КАК Дата,
	               |	ТрудозатратыЗаПериодомПланирования.Трудозатраты КАК Трудозатраты,
	               |	ТрудозатратыЗаПериодомПланирования.Подразделение КАК Подразделение,
	               |	ТрудозатратыЗаПериодомПланирования.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТрудозатратыЗаПериодомПланирования.Роль КАК Роль,
	               |	ТрудозатратыЗаПериодомПланирования.Ресурс КАК Ресурс
	               |ПОМЕСТИТЬ ТрудозатратыЗаПериодомПланированияНеСгруппированная
	               |ИЗ
	               |	ТрудозатратыЗаПериодомПланирования КАК ТрудозатратыЗаПериодомПланирования
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТрудозатратыЗаПериодомПланирования.Дата,
	               |	-ТрудозатратыЗаПериодомПланирования.Трудозатраты,
	               |	ТрудозатратыЗаПериодомПланирования.Подразделение,
	               |	ТрудозатратыЗаПериодомПланирования.ПроектнаяЗадача,
	               |	ТрудозатратыЗаПериодомПланирования.Роль,
	               |	ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |ИЗ
	               |	ТрудозатратыЗаПериодомПланирования КАК ТрудозатратыЗаПериодомПланирования
	               |ГДЕ
	               |	ТрудозатратыЗаПериодомПланирования.Ресурс <> ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Дата КАК Дата,
	               |	СУММА(ТрудозатратыЗаПериодомПланированияНеСгруппированная.Трудозатраты) КАК Трудозатраты,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Подразделение КАК Подразделение,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Роль КАК Роль,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Ресурс КАК Ресурс
	               |ИЗ
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная КАК ТрудозатратыЗаПериодомПланированияНеСгруппированная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Подразделение,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.ПроектнаяЗадача,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Ресурс,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Дата,
	               |	ТрудозатратыЗаПериодомПланированияНеСгруппированная.Роль";
	Запрос.УстановитьПараметр("РаспределениеПоПериоду", Объект.РаспределениеПоПериоду.Выгрузить());
	Запрос.УстановитьПараметр("ТрудозатратыЗаПериодомПланирования", Объект.ТрудозатратыЗаПериодомПланирования.Выгрузить());
	Запрос.УстановитьПараметр("Данные", Объект.Данные.Выгрузить());
	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Объект.РаспределениеПоПериоду.Загрузить(РезультатЗапроса[2].Выгрузить());
	Объект.ТрудозатратыЗаПериодомПланирования.Загрузить(РезультатЗапроса[5].Выгрузить());

	Отбор = Новый Структура("ТрудовойРесурс", Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
	СтрокиБезРесурса = Объект.Данные.НайтиСтроки(Отбор);
	Отбор = Новый Структура("Ресурс, Роль, ПроектнаяЗадача", Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
	Для Каждого Строка Из СтрокиБезРесурса Цикл
		Отбор.ПроектнаяЗадача = Строка.ПроектнаяЗадача;
		Отбор.Роль = Строка.Роль;
		НайденныеСтроки = Объект.ТрудозатратыЗаПериодомПланирования.НайтиСтроки(Отбор);
		ТрудозатратыПланДоПериода = 0;
		ТрудозатратыПланПослеПериода = 0;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если НайденнаяСтрока.Дата < Объект.НачалоПериода Тогда
				ТрудозатратыПланДоПериода = ТрудозатратыПланДоПериода + НайденнаяСтрока.Трудозатраты;
			Иначе	
				ТрудозатратыПланПослеПериода = ТрудозатратыПланПослеПериода + НайденнаяСтрока.Трудозатраты;
			КонецЕсли;	
		КонецЦикла;	
		Строка.ТрудозатратыПланДоПериода = ТрудозатратыПланДоПериода;
		Строка.ТрудозатратыПланПослеПериода = ТрудозатратыПланПослеПериода;
		Строка.ИтогНовоеЗначение = Строка.ИтогПоРоли;
	КонецЦикла;	

КонецПроцедуры	

&НаСервере
Процедура ПересчитатьТрудозатратыПриРасширенииПериода(КонецПериодаНовый)//СтруктураДанных, Ресурс)

	// Заполним распределение по роли для строк без ресурса.
	РаспределениеПоПериодуПоСтрокамБезРесурса(КонецПериодаНовый);

	// Перенесем трудозатраты за периодом в распределение. 
	мУдалить = Новый Массив;
	ОтборТрудозатраты = Новый Структура("Подразделение, ПроектнаяЗадача, Роль, Ресурс");
	ОтборРаспределение = Новый Структура("Дата, Подразделение, ПроектнаяЗадача, Роль, ТрудовойРесурс, ТипДанных");
	ОтборРаспределение.ТипДанных = "НовоеЗначение"; 
		
	Для Каждого СтрокаДанные Из Объект.Данные Цикл
		
		СтрокаДанные.ТрудозатратыПланДоПериода = 0;
		СтрокаДанные.ТрудозатратыПланПослеПериода = 0;
		
		ДатаНачала = Макс(СтрокаДанные.ДатаНачалаНП, Объект.НачалоПериода); 
		ДатаЗавершения = Мин(СтрокаДанные.ДатаЗавершенияНП, КонецПериодаНовый);
		
		ЗаполнитьЗначенияСвойств(ОтборТрудозатраты, СтрокаДанные);
		ОтборТрудозатраты.Ресурс = СтрокаДанные.ТрудовойРесурс;
		НайденныеСтроки = Объект.ТрудозатратыЗаПериодомПланирования.НайтиСтроки(ОтборТрудозатраты);
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			Если Строка.Дата > ДатаЗавершения Тогда
				СтрокаДанные.ТрудозатратыПланПослеПериода = СтрокаДанные.ТрудозатратыПланПослеПериода + Строка.Трудозатраты;
				Продолжить;
			ИначеЕсли Строка.Дата < ДатаНачала Тогда
				СтрокаДанные.ТрудозатратыПланДоПериода = СтрокаДанные.ТрудозатратыПланДоПериода + Строка.Трудозатраты;
				Продолжить;
			КонецЕсли;	
			
			ЗаполнитьЗначенияСвойств(ОтборРаспределение, Строка);
			ОтборРаспределение.ТрудовойРесурс = Строка.Ресурс;
			
			СтрокиРаспределениеПоПериоду = Объект.РаспределениеПоПериоду.НайтиСтроки(ОтборРаспределение);
			Если СтрокиРаспределениеПоПериоду.Количество() > 0 Тогда
				Для Каждого СтрокаРаспределениеПоПериоду Из СтрокиРаспределениеПоПериоду Цикл
					СтрокаРаспределениеПоПериоду.Значение = СтрокаРаспределениеПоПериоду.Значение + Строка.Трудозатраты; 
				КонецЦикла;
			Иначе
				СтрокаРаспределениеПоПериоду = Объект.РаспределениеПоПериоду.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределениеПоПериоду, ОтборРаспределение);
				СтрокаРаспределениеПоПериоду.Значение = Строка.Трудозатраты;
				Если ЗначениеЗаполнено(СтрокаРаспределениеПоПериоду.ТрудовойРесурс) Тогда
					СтрокаРаспределениеПоПериодуТекЗначение = Объект.РаспределениеПоПериоду.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРаспределениеПоПериодуТекЗначение, СтрокаРаспределениеПоПериоду);
					СтрокаРаспределениеПоПериодуТекЗначение.ТипДанных = "ТекущееЗначение";
				КонецЕсли;	
			КонецЕсли;	
			
			мУдалить.Добавить(Строка);
		
		КонецЦикла;

	КонецЦикла;

	Для Каждого Строка Из мУдалить Цикл
		Объект.ТрудозатратыЗаПериодомПланирования.Удалить(Строка);
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуБезРесурса(ПараметрыОтбора, СтрокиПоиска)

	Для Каждого Строка Из СтрокиПоиска Цикл
		Если Строка.ПоследнийУровень Тогда
			СтрокаНайдена = Истина;
			Для Каждого КлючИЗначение Из ПараметрыОтбора Цикл
				Если Строка[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
					СтрокаНайдена = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если СтрокаНайдена Тогда
				Возврат Строка;
			КонецЕсли;
		Иначе
			СтрокаБезРесурса = ПолучитьСтрокуБезРесурса(ПараметрыОтбора, Строка.ПолучитьЭлементы());
			Если СтрокаБезРесурса <> Неопределено Тогда
				Возврат СтрокаБезРесурса;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Функция ДобавитьСтрокуБезРесурса(ИзмененнаяСтрока, ИмяКолонкиИзмененная, РазницаИзменения)
                         
	мСтрок = Новый Массив;
	ТекСтрока = ИзмененнаяСтрока;
	Пока Истина Цикл
		мСтрок.Вставить(0, ТекСтрока);
		ТекСтрока = ТекСтрока.ПолучитьРодителя();
		Если ТекСтрока = Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	СтрокаСвойств = "Группировка, ДатаЗавершенияНП, ДатаЗавершенияТП, ДатаНачалаНП, ДатаНачалаТП, ИмяГруппировки, ИтогПоПериодуПоРоли, ИтогПоРоли, 
					|КодПроекта, КодСДР, КрайнийСрок, Подразделение, ПоследнийУровень, ПредставлениеЗадачи, Проект, ПроектнаяЗадача, ПроектнаяЗадачаЗеркало, 
					|ПрофильРаспределенияРоли, Роль, УровеньДерева";

	СтрокиДерева = ДеревоФормы.ПолучитьЭлементы();
	Отбор = Новый Структура("ПроектнаяЗадачаЗеркало, Подразделение, Роль, ТрудовойРесурс");

	Для Каждого Строка Из мСтрок Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		Отбор.ТрудовойРесурс = ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.ПустаяСсылка");
		
		СтрокаНайдена = Ложь;
		Для Каждого СтрокаДерева Из СтрокиДерева Цикл
			СтрокаНайдена = Истина;
			Для Каждого КлючИЗначение Из Отбор Цикл
				Если СтрокаДерева[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
					СтрокаНайдена = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если СтрокаНайдена Тогда
				СтрокиДерева = СтрокаДерева.ПолучитьЭлементы(); 
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		
		Если Не СтрокаНайдена Тогда
			
			Если СтрокиДерева.Количество() <> 0 И Объект.ПорядокГруппировок <> 1 И Строка.ИмяГруппировки = "ПроектнаяЗадачаЗеркало" Тогда
				Индекс = 0;
				Для Каждого СтрокаПЗ Из СтрокиДерева Цикл
					Если СтрокаПЗ.ПредставлениеЗадачи < Строка.ПредставлениеЗадачи Тогда
						Индекс = Индекс + 1;
					Иначе
						Прервать;
					КонецЕсли;	
				КонецЦикла;	
				НоваяСтрокаДерева = СтрокиДерева.Вставить(Индекс);
			Иначе
				НоваяСтрокаДерева = СтрокиДерева.Добавить();
			КонецЕсли;	
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, Строка, СтрокаСвойств);
			НоваяСтрокаДерева.Записывать = Ложь;
			НоваяСтрокаДерева.Редактируется = Ложь;
			НоваяСтрокаДерева.ТрудовойРесурс = ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.ПустаяСсылка");
			
			СтрокиДерева = НоваяСтрокаДерева.ПолучитьЭлементы();
			
		КонецЕсли;
		
	КонецЦикла;	

	Парам = Новый Структура("ПроектнаяЗадача, Проект, Роль, Подразделение, ПрофильРаспределенияРоли, ИтогПоРоли, ДатаНачалаТП, ДатаЗавершенияТП");
	ЗаполнитьЗначенияСвойств(Парам, НоваяСтрокаДерева);
	Результат = РаспределениеПоПериодуПоСтрокиБезРесурса(Парам);
	Для Каждого СтрокаЗагрузки Из Результат Цикл
		Если СтрокаЗагрузки.День < Объект.НачалоПериода Тогда
			НоваяСтрокаДерева.ТрудозатратыПланДоПериода = НоваяСтрокаДерева.ТрудозатратыПланДоПериода + СтрокаЗагрузки.Трудозатраты;
		ИначеЕсли СтрокаЗагрузки.День > Объект.КонецПериода Тогда
			НоваяСтрокаДерева.ТрудозатратыПланПослеПериода = НоваяСтрокаДерева.ТрудозатратыПланПослеПериода + СтрокаЗагрузки.Трудозатраты;
		Иначе	
			ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоДате(СтрокаЗагрузки.День);
			НоваяСтрокаДерева[ИмяКолонки + "ПоРоли"] = СтрокаЗагрузки.Трудозатраты;
			НоваяСтрокаДерева[ИмяКолонки + "НовоеЗначение"] = СтрокаЗагрузки.Трудозатраты;
			НоваяСтрокаДерева[ИмяКолонки + "Отклонение"] = СтрокаЗагрузки.Трудозатраты;
			НоваяСтрокаДерева[ИмяКолонки + "ДляРасчетаРазницы"] = СтрокаЗагрузки.Трудозатраты;
		КонецЕсли;	
	КонецЦикла;	

	НоваяСтрокаДерева[ИмяКолонкиИзмененная + "НовоеЗначение"] = НоваяСтрокаДерева[ИмяКолонкиИзмененная + "ПоРоли"] + РазницаИзменения;
	НоваяСтрокаДерева[ИмяКолонкиИзмененная + "Отклонение"] = НоваяСтрокаДерева[ИмяКолонкиИзмененная + "НовоеЗначение"];
	НоваяСтрокаДерева[ИмяКолонкиИзмененная + "ДляРасчетаРазницы"] = НоваяСтрокаДерева[ИмяКолонкиИзмененная + "НовоеЗначение"];

	Отбор = Новый Структура("ПроектнаяЗадача, Роль");
	ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрокаДерева);
	РасчитатьНераспределенныйОстатокПоСтрокеБезРесурса(ДеревоФормы.ПолучитьЭлементы(), НоваяСтрокаДерева, Отбор);

	МассивГруппировок = ПолучитьМассивГруппировок(Объект.ПорядокГруппировок);
	ОбновитьСтрокиНижнегоУровня(МассивГруппировок);

	 Если Объект.ПорядокГруппировок = 1 Тогда
		Возврат НоваяСтрокаДерева;
	КонецЕсли;	
		
	ТекСтрока = НоваяСтрокаДерева.ПолучитьРодителя();
	Пока ТекСтрока <> Неопределено Цикл
		Для каждого СтрокаДата Из КолонкиДат Цикл
			ИмяКолонки = СтрокаДата.ИмяКолонки;
			Разница = НоваяСтрокаДерева[ИмяКолонки + "НовоеЗначение"];
			ТекСтрока[ИмяКолонки+"НовоеЗначение"] = ТекСтрока[ИмяКолонки+"НовоеЗначение"] + Разница;	
			ТекСтрока[ИмяКолонки+"Отклонение"] = ТекСтрока[ИмяКолонки+"НовоеЗначение"] - ТекСтрока[ИмяКолонки+"ТекущееЗначение"];		
			ТекСтрока[ИмяКолонки+"ДляРасчетаРазницы"] = ТекСтрока[ИмяКолонки+"ДляРасчетаРазницы"] + Разница;		
			ТекСтрока.ИтогПоПериодуНовоеЗначение = ТекСтрока.ИтогПоПериодуНовоеЗначение + Разница;
			ТекСтрока.ИтогПоПериодуОтклонение =  ТекСтрока.ИтогПоПериодуНовоеЗначение - ТекСтрока.ИтогПоПериодуТекущееЗначение;
		КонецЦикла;
		СчитатьВычисляемыеИтогиСтроки(ТекСтрока);	
		ТекСтрока = ТекСтрока.ПолучитьРодителя();
	КонецЦикла;

	Возврат НоваяСтрокаДерева;

КонецФункции	

&НаКлиенте
Процедура РасчитатьНераспределенныйОстатокПоСтрокеБезРесурса(СтрокиДерева, НоваяСтрокаДерева, Отбор)

	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ПоследнийУровень И ЗначениеЗаполнено(СтрокаДерева.ТрудовойРесурс) Тогда
			СтрокаНайдена = Истина;
			Для Каждого КлючИЗначение Из Отбор Цикл
				Если СтрокаДерева[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
					СтрокаНайдена = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если СтрокаНайдена Тогда
				Для Каждого СтрокаДата Из КолонкиДат Цикл
					ИмяКолонки = СтрокаДата.ИмяКолонки;
					НоваяСтрокаДерева[ИмяКолонки + "НовоеЗначение"] = НоваяСтрокаДерева[ИмяКолонки + "НовоеЗначение"] - СтрокаДерева[ИмяКолонки + "НовоеЗначение"];
					НоваяСтрокаДерева[ИмяКолонки + "Отклонение"] = НоваяСтрокаДерева[ИмяКолонки + "НовоеЗначение"];
					НоваяСтрокаДерева[ИмяКолонки + "ДляРасчетаРазницы"] = НоваяСтрокаДерева[ИмяКолонки + "НовоеЗначение"];
				КонецЦикла;	
			КонецЕсли;	
		Иначе
			РасчитатьНераспределенныйОстатокПоСтрокеБезРесурса(СтрокаДерева.ПолучитьЭлементы(), НоваяСтрокаДерева, Отбор);	
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция РаспределениеПоПериодуПоСтрокиБезРесурса(СтрокаДерева)

	// Распределение по проектным задачам без ресурсов.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ вт_Версия
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Проект = &Проект
	               |	И упоВерсииПроекта.Текущая
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи, ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
	               |				ТОГДА ЕСТЬNULL(упоКалендариПроектовСрезПоследних.КалендарьПроекта, ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка))
	               |			ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи
	               |		КОНЕЦ) КАК Календарь,
	               |	МИНИМУМ(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан) КАК ДатаНачала,
	               |	МАКСИМУМ(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан) КАК ДатаЗавершения
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Версия В
	               |					(ВЫБРАТЬ
	               |						вт_Версия.Версия КАК Версия
	               |					ИЗ
	               |						вт_Версия КАК вт_Версия)) КАК упоСвойстваПроектныхЗадачСрезПоследних,
	               |	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК упоКалендариПроектовСрезПоследних,
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Версия В
	               |					(ВЫБРАТЬ
	               |						вт_Версия.Версия КАК Версия
	               |					ИЗ
	               |						вт_Версия КАК вт_Версия)) КАК упоСрокиПроектныхЗадачСрезПоследних";
	Запрос.УстановитьПараметр("Проект", СтрокаДерева.Проект);               
	Запрос.УстановитьПараметр("ПроектнаяЗадача", СтрокаДерева.ПроектнаяЗадача);               

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Календарь = Выборка.Календарь;
		ДатаНачала= Выборка.ДатаНачала;
		ДатаЗавершения = Выборка.ДатаЗавершения;
	Иначе
		Календарь = Справочники.упоРабочиеКалендари.ПустаяСсылка();
		ДатаНачала = СтрокаДерева.ДатаНачалаТП;
		ДатаЗавершения = СтрокаДерева.ДатаЗавершенияТП;
	КонецЕсли;

	ТаблицаРесурсов = Новый ТаблицаЗначений;
	ТаблицаРесурсов.Колонки.Добавить("ПрофильРаспределения");
	ТаблицаРесурсов.Колонки.Добавить("ЕдиницаНормирования");
	ТаблицаРесурсов.Колонки.Добавить("Количество");
	ТаблицаРесурсов.Колонки.Добавить("Ресурс");
	ТаблицаРесурсов.Колонки.Добавить("Роль");
	ТаблицаРесурсов.Колонки.Добавить("СпособПривязки");
	ТаблицаРесурсов.Колонки.Добавить("ОбщСтоимость");
	ТаблицаРесурсов.Колонки.Добавить("ОбщВнешняяСтоимость");		
	ТаблицаРесурсов.Колонки.Добавить("Стоимость");
	ТаблицаРесурсов.Колонки.Добавить("ВнешняяСтоимость");
	ТаблицаРесурсов.Колонки.Добавить("УровеньПланирования");
	ТаблицаРесурсов.Колонки.Добавить("Подразделение");
	ТаблицаРесурсов.Колонки.Добавить("ИсточникПлана");
	СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения;;
	УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
	Ресурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	ИсточникПлана = Перечисления.упоИсточникПланаТрудозатратРолей.Трудозатраты;
	
	СтрокаРесурсов = ТаблицаРесурсов.Добавить();
	СтрокаРесурсов.ЕдиницаНормирования = Справочники.упоЕдиницыВремени.Час;
	СтрокаРесурсов.Подразделение = СтрокаДерева.Подразделение;
	СтрокаРесурсов.Роль = СтрокаДерева.Роль;	
	СтрокаРесурсов.Ресурс = Ресурс;	
	СтрокаРесурсов.СпособПривязки = СпособПривязки;
	СтрокаРесурсов.УровеньПланирования = УровеньПланирования;
	СтрокаРесурсов.ОбщСтоимость = 0;
	СтрокаРесурсов.Стоимость = 0;
	СтрокаРесурсов.ОбщВнешняяСтоимость = 0;
	СтрокаРесурсов.ВнешняяСтоимость = 0;		
	СтрокаРесурсов.ПрофильРаспределения = СтрокаДерева.ПрофильРаспределенияРоли;
	СтрокаРесурсов.Количество = СтрокаДерева.ИтогПоРоли;
	СтрокаРесурсов.ИсточникПлана = ИсточникПлана;
	
	РезультатРаспределения = упоРаспределениеТрудозатратВызовСервера.РаспределитьТрудозатратыПоПрофилям(ТаблицаРесурсов, Календарь, ДатаНачала, ДатаЗавершения, Ложь); 

	мРезультат = Новый Массив;

	Если РезультатРаспределения <> Неопределено И РезультатРаспределения.Строки.Количество() > 0 Тогда
		Для Каждого СтрокаЗагрузки Из РезультатРаспределения.Строки[0].Строки Цикл
			Структура = Новый Структура("День, Трудозатраты");
			ЗаполнитьЗначенияСвойств(Структура, СтрокаЗагрузки);
			мРезультат.Добавить(Структура);
		КонецЦикла;
	КонецЕсли;

	Возврат мРезультат;

КонецФункции

&НаСервере
Функция ТекстЗапросаДерева(МассивГруппировок)

	Если Объект.ПорядокГруппировок = 0 Тогда
		УпорядочитьПо = "Редактируется УБЫВ, ТрудовойРесурсПредставление, РольПредставление, ПроектПредставление, КодСДР";
	ИначеЕсли Объект.ПорядокГруппировок = 1 Тогда
		УпорядочитьПо = "Редактируется УБЫВ, ПроектПредставление, КодСДР, РольПредставление, ТрудовойРесурсПредставление";
	ИначеЕсли Объект.ПорядокГруппировок = 2 Тогда
		УпорядочитьПо = "Редактируется УБЫВ, ЗаполненТР УБЫВ, ТрудовойРесурсПредставление, ПроектПредставление, ДатаНачалаНП, КодСДР";		
	КонецЕсли;

	ПоследняяГруппировкаВЗапросе = МассивГруппировок.Количество() - 2;
	сч = 0;
	СтрокаГруппировокВЗапросе = "";
	Пока сч <= ПоследняяГруппировкаВЗапросе Цикл
		СтрокаГруппировокВЗапросе = СтрокаГруппировокВЗапросе + ?(ЗначениеЗаполнено(СтрокаГруппировокВЗапросе), ", ", "") + МассивГруппировок[сч];
		сч = сч + 1;
	КонецЦикла;

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫРАЗИТЬ(ТаблицаДанные.ПроектнаяЗадачаЗеркало КАК Справочник.Проекты) КАК ПроектнаяЗадачаЗеркало,
	               |	ТаблицаДанные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВЫРАЗИТЬ(ТаблицаДанные.Роль КАК Справочник.упоРоли) КАК Роль,
	               |	ВЫРАЗИТЬ(ТаблицаДанные.ТрудовойРесурс КАК Справочник.упоТрудовыеРесурсы) КАК ТрудовойРесурс,
	               |	ТаблицаДанные.Факт КАК Факт,
	               |	ТаблицаДанные.ТрудозатратыПланДоПериода КАК ТрудозатратыПланДоПериода,
	               |	ТаблицаДанные.ТрудозатратыПланПослеПериода КАК ТрудозатратыПланПослеПериода,
	               |	ТаблицаДанные.Подразделение КАК Подразделение,
	               |	ТаблицаДанные.Записывать КАК Записывать,
	               |	ТаблицаДанные.Редактируется КАК Редактируется,
	               |	ТаблицаДанные.КрайнийСрок КАК КрайнийСрок,
	               |	ТаблицаДанные.ДатаНачалаТП КАК ДатаНачалаТП,
	               |	ТаблицаДанные.ДатаЗавершенияТП КАК ДатаЗавершенияТП,
	               |	ТаблицаДанные.ДатаНачалаНП КАК ДатаНачалаНП,
	               |	ТаблицаДанные.ИтогНовоеЗначение КАК ИтогНовоеЗначение,
	               |	ТаблицаДанные.ИтогПоРоли КАК ИтогПоРоли,
	               |	ТаблицаДанные.ПрофильРаспределенияРоли КАК ПрофильРаспределенияРоли,
	               |	ТаблицаДанные.ИтогТекущееЗначение КАК ИтогТекущееЗначение,
	               |	ТаблицаДанные.ДатаЗавершенияНП КАК ДатаЗавершенияНП
	               |ПОМЕСТИТЬ ТаблицаДанные
	               |ИЗ
	               |	&ТаблицаДанные КАК ТаблицаДанные
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДанные.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
	               |	ТаблицаДанные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТаблицаДанные.Роль КАК Роль,
	               |	ТаблицаДанные.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ТаблицаДанные.Факт КАК Факт,
	               |	ТаблицаДанные.ТрудозатратыПланДоПериода КАК ТрудозатратыПланДоПериода,
	               |	ТаблицаДанные.ТрудозатратыПланПослеПериода КАК ТрудозатратыПланПослеПериода,
	               |	ТаблицаДанные.Подразделение КАК Подразделение,
	               |	ТаблицаДанные.Записывать КАК Записывать,
	               |	ТаблицаДанные.Редактируется КАК Редактируется,
	               |	ТаблицаДанные.КрайнийСрок КАК КрайнийСрок,
	               |	ТаблицаДанные.ДатаНачалаТП КАК ДатаНачалаТП,
	               |	ТаблицаДанные.ДатаЗавершенияТП КАК ДатаЗавершенияТП,
	               |	ТаблицаДанные.ДатаНачалаНП КАК ДатаНачалаНП,
	               |	ТаблицаДанные.ИтогНовоеЗначение КАК ИтогНовоеЗначение,
	               |	ТаблицаДанные.ИтогПоРоли КАК ИтогПоРоли,
	               |	ТаблицаДанные.ПрофильРаспределенияРоли КАК ПрофильРаспределенияРоли,
	               |	ТаблицаДанные.ИтогТекущееЗначение КАК ИтогТекущееЗначение,
	               |	ТаблицаДанные.ДатаЗавершенияНП КАК ДатаЗавершенияНП,
	               |	Проекты.КодСДР КАК КодСДР,
	               |	КорневойПроект.Код КАК КодПроекта,
	               |	КорневойПроект.Наименование КАК ПроектПредставление,
	               |	Проекты.упоКорневойПроект КАК Проект
	               |ПОМЕСТИТЬ ТаблицаДанныеСДопДанными
	               |ИЗ
	               |	ТаблицаДанные КАК ТаблицаДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК КорневойПроект
	               |			ПО Проекты.упоКорневойПроект = КорневойПроект.Ссылка
	               |		ПО ТаблицаДанные.ПроектнаяЗадачаЗеркало = Проекты.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТаблицаДанные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаДанныеСДопДанными.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ЗадачиРедактируются
	               |ИЗ
	               |	ТаблицаДанныеСДопДанными КАК ТаблицаДанныеСДопДанными
	               |ГДЕ
	               |	ТаблицаДанныеСДопДанными.Редактируется
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаДанныеПоПериоду.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТаблицаДанныеПоПериоду.Роль КАК Роль,
	               |	ТаблицаДанныеПоПериоду.Подразделение КАК Подразделение,
	               |	ТаблицаДанныеПоПериоду.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ТаблицаДанныеПоПериоду.Значение КАК Значение
	               |ПОМЕСТИТЬ ТаблицаДанныеПоПериоду
	               |ИЗ
	               |	&ТаблицаДанныеПоПериоду КАК ТаблицаДанныеПоПериоду
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаДанныеЗаПериоду.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТаблицаДанныеЗаПериоду.Роль КАК Роль,
	               |	ТаблицаДанныеЗаПериоду.Подразделение КАК Подразделение,
	               |	ТаблицаДанныеЗаПериоду.Ресурс КАК Ресурс,
	               |	ТаблицаДанныеЗаПериоду.Трудозатраты КАК Трудозатраты
	               |ПОМЕСТИТЬ ТаблицаДанныеЗаПериоду
	               |ИЗ
	               |	&ТаблицаДанныеЗаПериоду КАК ТаблицаДанныеЗаПериоду
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДанныеПоПериоду.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТаблицаДанныеПоПериоду.Роль КАК Роль,
	               |	ТаблицаДанныеПоПериоду.Подразделение КАК Подразделение,
	               |	ТаблицаДанныеПоПериоду.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ТаблицаДанныеПоПериоду.Значение КАК Трудозатраты
	               |ПОМЕСТИТЬ ТаблицаДанныеНеРаспределенные
	               |ИЗ
	               |	ТаблицаДанныеПоПериоду КАК ТаблицаДанныеПоПериоду
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаДанныеЗаПериоду.ПроектнаяЗадача,
	               |	ТаблицаДанныеЗаПериоду.Роль,
	               |	ТаблицаДанныеЗаПериоду.Подразделение,
	               |	ТаблицаДанныеЗаПериоду.Ресурс,
	               |	ТаблицаДанныеЗаПериоду.Трудозатраты
	               |ИЗ
	               |	ТаблицаДанныеЗаПериоду КАК ТаблицаДанныеЗаПериоду
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДанныеНеРаспределенные.ПроектнаяЗадача КАК ПроектнаяЗадача1,
	               |	ТаблицаДанныеНеРаспределенные.Роль КАК Роль1,
	               |	ТаблицаДанныеНеРаспределенные.Подразделение КАК Подразделение1,
	               |	ТаблицаДанныеНеРаспределенные.ТрудовойРесурс КАК ТрудовойРесурс1,
	               |	СУММА(ТаблицаДанныеНеРаспределенные.Трудозатраты) КАК Трудозатраты
	               |ПОМЕСТИТЬ ТаблицаДанныеНеРаспределенныеСгруппированные
	               |ИЗ
	               |	ТаблицаДанныеНеРаспределенные КАК ТаблицаДанныеНеРаспределенные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаДанныеНеРаспределенные.ПроектнаяЗадача,
	               |	ТаблицаДанныеНеРаспределенные.Роль,
	               |	ТаблицаДанныеНеРаспределенные.Подразделение,
	               |	ТаблицаДанныеНеРаспределенные.ТрудовойРесурс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДанныеСДопДанными.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха
	               |			ТОГДА 5
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипЗадачи,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия
	               |ПОМЕСТИТЬ СвойстваВерсииЗадач
	               |ИЗ
	               |	ТаблицаДанныеСДопДанными КАК ТаблицаДанныеСДопДанными
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |				,
	               |				ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						ТаблицаДанныеСДопДанными.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						ТаблицаДанныеСДопДанными КАК ТаблицаДанныеСДопДанными)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвойстваВерсииЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи,
	               |	ВЫБОР
	               |		КОГДА упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Закрыта)
	               |			ТОГДА 0
	               |		КОГДА упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК НомерСтатусаЗадачи
	               |ПОМЕСТИТЬ СтатусыЗадач
	               |ИЗ
	               |	СвойстваВерсииЗадач КАК СвойстваВерсииЗадач
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |				,
	               |				ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						СвойстваВерсииЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						СвойстваВерсииЗадач КАК СвойстваВерсииЗадач)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ПО СвойстваВерсииЗадач.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И СвойстваВерсииЗадач.Версия = упоСтатусыПроектныхЗадачСрезПоследних.Версия
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ТаблицаДанныеСДопДанными.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЕСТЬNULL(упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) В (&СписокСотрудниковДиспетчера)
	               |		ИЛИ ЕСТЬNULL(упоРуководителиПроектовСрезПоследних.РуководительПроекта, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) В (&СписокСотрудниковДиспетчера) КАК ЕстьДоступРПЗ,
	               |	НЕ ЕСТЬNULL(СтатусыЗадач.СтатусЗадачи, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.ПустаяСсылка)) В (&СтатусыНеРедактируемыхЗадач) КАК ЕстьДоступСтатусЗадачи
	               |ПОМЕСТИТЬ ТаблицаДанныеРазграничениеПравДоступа
	               |ИЗ
	               |	ТаблицаДанныеСДопДанными КАК ТаблицаДанныеСДопДанными
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(
	               |				,
	               |				НЕ &ОтключитьРазграничениеДоступаКДокументам
	               |					И Проект В
	               |						(ВЫБРАТЬ
	               |							ТаблицаДанныеСДопДанными.Проект КАК Проект
	               |						ИЗ
	               |							ТаблицаДанныеСДопДанными КАК ТаблицаДанныеСДопДанными)) КАК упоРуководителиПроектовСрезПоследних
	               |		ПО ТаблицаДанныеСДопДанными.Проект = упоРуководителиПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыЗадач КАК СтатусыЗадач
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = СтатусыЗадач.ПроектнаяЗадача
	               |ГДЕ
	               |	НЕ &ОтключитьРазграничениеДоступаКДокументам
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаДанныеСДопДанными.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
	               |	ТаблицаДанныеСДопДанными.Роль КАК Роль,
	               |	ТаблицаДанныеСДопДанными.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ТаблицаДанныеСДопДанными.ИтогПоРоли КАК ИтогПоРоли,
	               |	ТаблицаДанныеСДопДанными.Проект КАК Проект,
	               |	ТаблицаДанныеСДопДанными.Подразделение КАК Подразделение
	               |ИЗ
	               |	ТаблицаДанныеСДопДанными КАК ТаблицаДанныеСДопДанными
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаДанныеСДопДанными.Роль КАК Роль,
	               |	ТаблицаДанныеСДопДанными.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ТаблицаДанныеСДопДанными.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТаблицаДанныеСДопДанными.КодСДР КАК КодСДР,
	               |	ТаблицаДанныеСДопДанными.Подразделение КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДанныеСДопДанными.Записывать
	               |				И &СниматьПризнакЗаписьДляНедоступныхСтрок
	               |			ТОГДА ЕСТЬNULL(ТаблицаДанныеРазграничениеПравДоступа.ЕстьДоступСтатусЗадачи, ИСТИНА)
	               |					И ЕСТЬNULL(ТаблицаДанныеРазграничениеПравДоступа.ЕстьДоступРПЗ, ИСТИНА)
	               |		ИНАЧЕ ТаблицаДанныеСДопДанными.Записывать
	               |	КОНЕЦ КАК Записывать,
	               |	ТаблицаДанныеСДопДанными.Редактируется КАК Редактируется,
	               |	ТаблицаДанныеСДопДанными.ИтогНовоеЗначение КАК ИтогНовоеЗначение,
	               |	ТаблицаДанныеСДопДанными.ИтогТекущееЗначение КАК ИтогТекущееЗначение,
	               |	ТаблицаДанныеСДопДанными.ИтогПоРоли КАК ИтогПоРоли,
	               |	ТаблицаДанныеСДопДанными.ПрофильРаспределенияРоли КАК ПрофильРаспределенияРоли,
	               |	ТаблицаДанныеСДопДанными.ДатаНачалаТП КАК ДатаНачалаТП,
	               |	ТаблицаДанныеСДопДанными.ДатаЗавершенияТП КАК ДатаЗавершенияТП,
	               |	ТаблицаДанныеСДопДанными.ДатаНачалаНП КАК ДатаНачалаНП,
	               |	ТаблицаДанныеСДопДанными.ДатаЗавершенияНП КАК ДатаЗавершенияНП,
	               |	ТаблицаДанныеСДопДанными.Проект КАК Проект,
	               |	ТаблицаДанныеСДопДанными.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
	               |	ТаблицаДанныеСДопДанными.Факт КАК Факт,
	               |	ВЫБОР
	               |		КОГДА ТаблицаДанныеСДопДанными.ТрудовойРесурс = ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЗаполненТР,
	               |	ТаблицаДанныеСДопДанными.КрайнийСрок КАК КрайнийСрок,
	               |	ТаблицаДанныеСДопДанными.ПроектПредставление КАК ПроектПредставление,
	               |	ТаблицаДанныеСДопДанными.КодПроекта КАК КодПроекта,
	               |	ТаблицаДанныеСДопДанными.Роль.Наименование КАК РольПредставление,
	               |	ТаблицаДанныеСДопДанными.ТрудовойРесурс.Наименование КАК ТрудовойРесурсПредставление,
	               |	ТаблицаДанныеСДопДанными.ТрудозатратыПланПослеПериода КАК ТрудозатратыПланПослеПериода,
	               |	ТаблицаДанныеСДопДанными.ТрудозатратыПланДоПериода КАК ТрудозатратыПланДоПериода,
	               |	ВЫБОР
	               |		КОГДА &ОтключитьРазграничениеДоступаКДокументам
	               |			ТОГДА ИСТИНА
	               |		КОГДА ТаблицаДанныеСДопДанными.ПроектнаяЗадачаЗеркало = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(ТаблицаДанныеРазграничениеПравДоступа.ЕстьДоступСтатусЗадачи, ИСТИНА)
	               |				И ЕСТЬNULL(ТаблицаДанныеРазграничениеПравДоступа.ЕстьДоступРПЗ, ИСТИНА)
	               |	КОНЕЦ КАК ЕстьПраваНаРедактирование,
	               |	СтатусыЗадач.НомерСтатусаЗадачи КАК НомерСтатусаЗадачи,
	               |	ЕСТЬNULL(СвойстваВерсииЗадач.ТипЗадачи, -1) КАК ТипЗадачи,
	               |	ТаблицаДанныеСДопДанными.ТрудовойРесурс = ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |		ИЛИ ТаблицаДанныеСДопДанными.ПроектнаяЗадачаЗеркало = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК ЭтоСтрокаОстатка,
	               |	НЕ ЗадачиРедактируются.ПроектнаяЗадача ЕСТЬ NULL КАК ОстатокРедактируется
	               |ИЗ
	               |	ТаблицаДанныеСДопДанными КАК ТаблицаДанныеСДопДанными
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныеНеРаспределенныеСгруппированные КАК ТаблицаДанныеНеРаспределенныеСгруппированные
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = ТаблицаДанныеНеРаспределенныеСгруппированные.ПроектнаяЗадача1
	               |			И ТаблицаДанныеСДопДанными.Роль = ТаблицаДанныеНеРаспределенныеСгруппированные.Роль1
	               |			И ТаблицаДанныеСДопДанными.Подразделение = ТаблицаДанныеНеРаспределенныеСгруппированные.Подразделение1
	               |			И ТаблицаДанныеСДопДанными.ТрудовойРесурс = ТаблицаДанныеНеРаспределенныеСгруппированные.ТрудовойРесурс1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныеРазграничениеПравДоступа КАК ТаблицаДанныеРазграничениеПравДоступа
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = ТаблицаДанныеРазграничениеПравДоступа.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыЗадач КАК СтатусыЗадач
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = СтатусыЗадач.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СвойстваВерсииЗадач КАК СвойстваВерсииЗадач
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = СвойстваВерсииЗадач.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗадачиРедактируются КАК ЗадачиРедактируются
	               |		ПО ТаблицаДанныеСДопДанными.ПроектнаяЗадача = ЗадачиРедактируются.ПроектнаяЗадача
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТаблицаДанныеСДопДанными.ТрудовойРесурс = ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |					И ЕСТЬNULL(ТаблицаДанныеНеРаспределенныеСгруппированные.Трудозатраты, 0) = 0
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ				   
				   |УПОРЯДОЧИТЬ ПО
	               |	" + УпорядочитьПо + "
	               |ИТОГИ
				   |	МАКСИМУМ(КодСДР),
				   |	МАКСИМУМ(Редактируется),
				   |	МАКСИМУМ(КодПроекта),
	               |	МИНИМУМ(ДатаНачалаТП),
	               |	МАКСИМУМ(ДатаЗавершенияТП),
	               |	МИНИМУМ(ДатаНачалаНП),
	               |	МАКСИМУМ(ДатаЗавершенияНП),	
				   |	МАКСИМУМ(ЗаполненТР),	
	               |	СУММА(Факт),
				   |	СУММА(ИтогПоРоли),
				   |	СУММА(ИтогНовоеЗначение),
				   |	СУММА(ИтогТекущееЗначение),
				   |	СУММА(ТрудозатратыПланДоПериода),
				   |	СУММА(ТрудозатратыПланПослеПериода),
				   |	МАКСИМУМ(ЕстьПраваНаРедактирование),
				   |	МАКСИМУМ(НомерСтатусаЗадачи),
				   |	МИНИМУМ(ТипЗадачи),
				   |	МИНИМУМ(ЭтоСтрокаОстатка),
				   |	МИНИМУМ(ОстатокРедактируется)
	               |ПО
	               |	&СтрокаИтогов";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаИтогов", СтрокаГруппировокВЗапросе);

	Возврат ТекстЗапроса;

КонецФункции		

&НаКлиенте
Процедура ОбновитьСоответствиеУровнейДерева()

	врСоотвУровняДерева = Новый Соответствие;
	КоличествоУровней = упоОперацииСДеревьямиКлиент.ПолучитьКоличествоУровнейДерева(ДеревоФормы,, врСоотвУровняДерева);
	СоотвУровняДерева = Новый ФиксированноеСоответствие(врСоотвУровняДерева);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьПраваНаРедактированиеТекДанных(ЭтаФорма, ТекДанные)
	
	Возврат НЕ ЭтаФорма.ТолькоПросмотр 
			И ТекДанные.ЕстьПраваНаРедактирование;
	
КонецФункции

&НаКлиенте
Функция ВариантыВыбораДляПоследнегоУровня(ТекДанные)
			
	Варианты = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ТекДанные[ТекДанные.ИмяГруппировки]) Тогда
		Варианты.Добавить("Открыть", НСтр("ru = 'Открыть объект'"));
	КонецЕсли;
	
	Если ЕстьПраваНаРедактированиеТекДанных(ЭтаФорма, ТекДанные) Тогда					
		
		Если ЗначениеЗаполнено(ТекДанные.ТрудовойРесурс) И ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадачаЗеркало) 
			И ТекДанные.Редактируется Тогда					
			Варианты.Добавить("ОтменитьНазначение", НСтр("ru = 'Отменить назначение'"));
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекДанные.ТрудовойРесурс) Тогда
			Варианты.Добавить("НазначитьРесурс", НСтр("ru = 'Назначить ресурс'"));
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадачаЗеркало) Тогда
			Варианты.Добавить("НазначитьНаЗадачу", НСтр("ru = 'Назначить на задачу'"));
		КонецЕсли;				
		
	КонецЕсли;
	
	Возврат Варианты;
	
КонецФункции

&НаКлиенте
Функция ВариантыВыбораДляГруппировки(ТекДанные)
	
	Варианты = Новый СписокЗначений;
	
	Варианты.Добавить("Открыть", НСтр("ru = 'Открыть объект'"));
	
	Если ЕстьПраваНаРедактированиеТекДанных(ЭтаФорма, ТекДанные) Тогда
		
		Варианты.Добавить("ПереназначитьЗадачи", НСтр("ru = 'Переназначить задачи'"));
		
	КонецЕсли;
	
	Возврат Варианты;
	
КонецФункции

&НаКлиенте
Функция ЗавершениеВыборИзМенюГруппировка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	СтрокаДерева = ДеревоФормы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдСтроки);
	Если ВыбранныйЭлемент.Значение = "Открыть" Тогда		
		ПоказатьЗначение(, СтрокаДерева[СтрокаДерева.ИмяГруппировки]);
	ИначеЕсли ВыбранныйЭлемент.Значение = "НазначитьРесурс" Тогда
		ВыбратьИНазначитьРесурсНаЗадачу(СтрокаДерева, ДополнительныеПараметры.Поле);	
	ИначеЕсли ВыбранныйЭлемент.Значение = "НазначитьНаЗадачу" Тогда
		ВыбратьЗадачуИНазначитьНаНееРесурс(СтрокаДерева, ДополнительныеПараметры.Поле); 	
	ИначеЕсли ВыбранныйЭлемент.Значение = "ОтменитьНазначение" Тогда
		ОтменитьНазначениеНаЗадачу(СтрокаДерева); 
	ИначеЕсли ВыбранныйЭлемент.Значение = "ПереназначитьЗадачи" Тогда
		ПереназначитьЗадачиКлиент(СтрокаДерева.ТрудовойРесурс);		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьИНазначитьРесурсНаЗадачу(СтрокаДерева, Поле = Неопределено)
	
	// Режим совместимости 8.3.24 или "Не использовать".
	СписокРесурсов = СписокРесурсовПоРолиВДокументе(СтрокаДерева.Роль);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдСтроки", СтрокаДерева.ПолучитьИдентификатор());
	ОписаниеОповещенияЗавершениеВыборТР_Назначение = Новый ОписаниеОповещения("ЗавершениеВыборТР_Назначение",
			ЭтаФорма, ПараметрыОповещения);
	ПоказатьВыборИзМеню(ОписаниеОповещенияЗавершениеВыборТР_Назначение, СписокРесурсов, Поле);
	
КонецПроцедуры

&НаСервере
Функция СписокРесурсовПоРолиВДокументе(Роль)
	
	СписокРесурсов = Новый СписокЗначений;
	СтрокиРесурса = Объект.Ресурсы.НайтиСтроки(Новый Структура("Роль", Роль));
	Для Каждого СтрокаРесурса Из СтрокиРесурса Цикл
		СписокРесурсов.Добавить(СтрокаРесурса.ТрудовойРесурс);
	КонецЦикла;
	
	Возврат СписокРесурсов;
	
КонецФункции

&НаКлиенте
Процедура ОтменитьНазначениеНаЗадачу(СтрокаДерева) 

	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдСтроки", СтрокаДерева.ПолучитьИдентификатор());
	ОписаниеОповещенияЗавершениеОтменитьНазначениеНаЗадачу = Новый ОписаниеОповещения(
																	"ЗавершениеОтменитьНазначениеНаЗадачу", 
																	ЭтаФорма, 
																	ПараметрыОповещения);	
	ПоказатьВопрос(ОписаниеОповещенияЗавершениеОтменитьНазначениеНаЗадачу, 
					НСтр("ru = 'Отменить назначение ресурса на задачу?'"), 
					РежимДиалогаВопрос.ДаНет); 	

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОтменитьНазначениеНаЗадачу(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ОтменитьНазначениеНаЗадачуСервер(ДополнительныеПараметры.ИдСтроки);
	РазвернутьДерево();	

КонецПроцедуры

&НаСервере
Процедура ОтменитьНазначениеНаЗадачуСервер(ИдСтрокиПЗНижнегоУровня) 

	ИдСтроки = ИдСтрокиПЗНижнегоУровня;

	СтрокаДерева = ДеревоФормы.НайтиПоИдентификатору(ИдСтроки);
	СтруктураДанных = Новый Структура("ПроектнаяЗадача, ПроектнаяЗадачаЗеркало, Роль, ТрудовойРесурс, Подразделение,
	| ДатаЗавершенияТП, ДатаЗавершенияНП, ДатаНачалаТП, ДатаНачалаНП, ИтогПоПериодуПоРоли, ПрофильРаспределенияРоли");
	ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаДерева);

	ЗагрузитьДанныеОбъектаИзФормы(Объект);

	Отбор = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс, Роль");
	ЗаполнитьЗначенияСвойств(Отбор, СтруктураДанных);

	Строки = Объект.Данные.НайтиСтроки(Отбор);

	Отбор.ТрудовойРесурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	СтрокиБезРесурса = Объект.Данные.НайтиСтроки(Отбор);
	Если СтрокиБезРесурса.Количество() = 0 И Строки.Количество() > 0 Тогда 
		СтрокаБезРесурса = Объект.Данные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаБезРесурса, Строки[0]);
		СтрокаБезРесурса.ТрудовойРесурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
		СтрокаБезРесурса.Редактируется = Ложь;
		СтрокаБезРесурса.Записывать = Ложь;
		
		Отбор = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс, Роль, ТипДанных");
		ЗаполнитьЗначенияСвойств(Отбор, СтруктураДанных);
		Отбор.ТипДанных = "ПоРоли";
		СтрокиРаспределения = Объект.РаспределениеПоПериоду.НайтиСтроки(Отбор);
		Для Каждого Строка Из СтрокиРаспределения Цикл
			Строка.ТрудовойРесурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
		КонецЦикла;
	Иначе
		СтрокаБезРесурса = СтрокиБезРесурса[0];
	КонецЕсли;		

	Для Каждого Строка Из Строки Цикл
		СтрокаБезРесурса.ИтогНовоеЗначение = СтрокаБезРесурса.ИтогНовоеЗначение + Строка.ИтогНовоеЗначение;
		СтрокаБезРесурса.ТрудозатратыПланДоПериода = СтрокаБезРесурса.ТрудозатратыПланДоПериода 
													+ Строка.ТрудозатратыПланДоПериода;
		СтрокаБезРесурса.ТрудозатратыПланПослеПериода = СтрокаБезРесурса.ТрудозатратыПланПослеПериода 
													+ Строка.ТрудозатратыПланПослеПериода;
		Объект.Данные.Удалить(Строка);		
	КонецЦикла;

	Отбор = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс, Роль");
	ЗаполнитьЗначенияСвойств(Отбор, СтруктураДанных);
	Отбор.Вставить("ТипДанных", "НовоеЗначение");	
	Строки = Объект.РаспределениеПоПериоду.НайтиСтроки(Отбор);
	Отбор.ТрудовойРесурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	Отбор.Вставить("Дата");
	Для Каждого Строка Из Строки Цикл
		Отбор.Дата = Строка.Дата;
		СтрокиБезРесурса = Объект.РаспределениеПоПериоду.НайтиСтроки(Отбор);
		Если СтрокиБезРесурса.Количество() > 0 Тогда
			СтрокиБезРесурса[0].Значение = СтрокиБезРесурса[0].Значение + Строка.Значение;
		Иначе
			СтрокаБезРесурса = Объект.РаспределениеПоПериоду.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаБезРесурса, Отбор);
			СтрокаБезРесурса.Подразделение = Строка.Подразделение;
			СтрокаБезРесурса.Значение = Строка.Значение;
		КонецЕсли;	
		Объект.РаспределениеПоПериоду.Удалить(Строка);		
	КонецЦикла;

	СтрокаОтмены = Объект.ОтменаНазначения.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаОтмены, СтруктураДанных);
	СтрокаОтмены.Записывать = Истина;

	Отбор = Новый Структура("ТрудовойРесурс");
	ЗаполнитьЗначенияСвойств(Отбор, СтруктураДанных);
	Если Объект.Данные.НайтиСтроки(Отбор).Количество() = 0 Тогда
		СтрокаДанных = Объект.Данные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтруктураДанных, "ТрудовойРесурс, Роль, Подразделение");	
		СтрокаДанных.Редактируется = Ложь;
		СтрокаДанных.Записывать = Ложь;		
	КонецЕсли;

	Отбор = Новый Структура("Подразделение, ПроектнаяЗадача, Роль, Ресурс");
	ЗаполнитьЗначенияСвойств(Отбор, СтруктураДанных);
	Отбор.Ресурс = СтруктураДанных.ТрудовойРесурс;
	СтрокиЗаПериодом = Объект.ТрудозатратыЗаПериодомПланирования.НайтиСтроки(Отбор);
	Если СтрокиЗаПериодом.Количество() > 0 Тогда
		Отбор.Ресурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
		Отбор.Вставить("Дата");
		Для Каждого Строка Из СтрокиЗаПериодом Цикл
			Отбор.Дата = Строка.Дата;
			СтрокиЗаПериодомБезРесурса = Объект.ТрудозатратыЗаПериодомПланирования.НайтиСтроки(Отбор);
			Если СтрокиЗаПериодомБезРесурса.Количество() = 0 Тогда
				СтрокаБезРесурса = Объект.ТрудозатратыЗаПериодомПланирования.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаБезРесурса, Отбор);
				СтрокаБезРесурса.Трудозатраты = Строка.Трудозатраты;
			Иначе
				Для Каждого СтрокаБезРесурса Из СтрокиЗаПериодомБезРесурса Цикл
					СтрокаБезРесурса.Трудозатраты = СтрокаБезРесурса.Трудозатраты + Строка.Трудозатраты;
				КонецЦикла;	
			КонецЕсли;	
			Объект.ТрудозатратыЗаПериодомПланирования.Удалить(Строка);
		КонецЦикла;	
	КонецЕсли;	

	ДанныеОбъекта_ОпределитьНовыеДатыПЗ(СтруктураДанных.ПроектнаяЗадача);

	ЗагрузитьДанныеФормыИзОбъекта();
	АдаптироватьЭлементы(ЭтаФорма);
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);	

КонецПроцедуры

&НаКлиенте
Процедура ПереназначитьЗадачиКлиент(ТрудовойРесурс) 

	ПереназначитьЗадачиСервер(ТрудовойРесурс);
	РазвернутьДерево();

КонецПроцедуры

&НаСервере
Процедура ПереназначитьЗадачиСервер(ТрудовойРесурс) 

	Если НЕ Объект.ПорядокГруппировок = 2 Тогда
		Возврат;	
	КонецЕсли;

	МассивДанныхПЗ = Новый Массив;
	МассивСтрок = Новый Массив;

	Для Каждого СтрокаВерхнегоУровня Из ДеревоФормы.ПолучитьЭлементы() Цикл
		Если НЕ СтрокаВерхнегоУровня.ТрудовойРесурс = ТрудовойРесурс Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаПЗ Из СтрокаВерхнегоУровня.ПолучитьЭлементы() Цикл
			Если Не ЗначениеЗаполнено(СтрокаПЗ.ПроектнаяЗадачаЗеркало) Тогда
				Продолжить;
			КонецЕсли;	
			СтруктураДанныхПЗ = ПолучитьСтруктуруДанныхДляНазначенияПоЗадаче();
			ЗаполнитьЗначенияСвойств(СтруктураДанныхПЗ, СтрокаПЗ);
			МассивДанныхПЗ.Добавить(СтруктураДанныхПЗ);
		КонецЦикла;
		Прервать;
	КонецЦикла;

	ПредСчетчик = Неопределено;
	Пока Истина Цикл
		СтрокиРесурса = мКэшЗначений.СтрокиРесурса_НижнийУровень.Получить(ТрудовойРесурс);
		БылаНепустаяСтрока = Ложь;
		Если ПредСчетчик <> Неопределено И ПредСчетчик = СтрокиРесурса.Количество() Тогда
			Прервать;
		КонецЕсли;
		ПредСчетчик = СтрокиРесурса.Количество();
		Для Каждого ИДСтрокиРесурса Из СтрокиРесурса Цикл
			СтрокаРесурса = ДеревоФормы.НайтиПоИдентификатору(ИДСтрокиРесурса);
			Если ЗначениеЗаполнено(СтрокаРесурса.ПроектнаяЗадача) Тогда
				ОтменитьНазначениеНаЗадачуСервер(СтрокаРесурса.ПолучитьИдентификатор());
				БылаНепустаяСтрока = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ БылаНепустаяСтрока Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтруктураДанныхПЗ Из МассивДанныхПЗ Цикл
		НазначитьРесурсНаЗадачуСервер(ТрудовойРесурс, , СтруктураДанныхПЗ);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗадачуИНазначитьНаНееРесурс(СтрокаДерева, Поле = Неопределено)
	
	// Режим совместимости 8.3.24 или "Не использовать".
	СписокПЗ = СписокПроектныхЗадачДляНазначенияТРПоРоли(СтрокаДерева.Роль);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ТрудовойРесурс", СтрокаДерева.ТрудовойРесурс);
	ОписаниеОповещенияЗавершениеВыборПЗ_Назначение = Новый ОписаниеОповещения("ЗавершениеВыборПЗ_Назначение",
			ЭтаФорма, ПараметрыОповещения);
	ПоказатьВыборИзМеню(ОписаниеОповещенияЗавершениеВыборПЗ_Назначение, СписокПЗ, Поле);
	
КонецПроцедуры

&НаСервере
Функция СписокПроектныхЗадачДляНазначенияТРПоРоли(Роль)
	
	СписокПЗ = Новый СписокЗначений;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Роль", Роль);
	Отбор.Вставить("ТрудовойРесурс", ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.ПустаяСсылка"));
	
	СтрокиПЗ = Объект.Данные.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаПЗ Из СтрокиПЗ Цикл
		
		МассивИД = мКэшЗначений.СтрокиПЗ_НижнийУровень.Получить(СтрокаПЗ.ПроектнаяЗадачаЗеркало);
		Для Каждого ИД Из МассивИД Цикл
			
			СтрокаПоИД = ДеревоФормы.НайтиПоИдентификатору(ИД);
			
			РазрешенныйНомерСтатуса = 2; // ПЗ не закрыта и не завершена.
			
			МожноРедактировать = СтрокаПоИД.ЕстьПраваНаРедактирование
				И СтрокаПоИД.НомерСтатусаЗадачи >= РазрешенныйНомерСтатуса;
			ЕстьОстатокПоРоли = (СтрокаПоИД.Роль = Роль)
				И Не ЗначениеЗаполнено(СтрокаПоИД.ТрудовойРесурс);
			
			Если МожноРедактировать И ЕстьОстатокПоРоли Тогда
				СписокПЗ.Добавить(ИД, ПредставлениеЗадачиВСтрокеДерева(СтрокаПоИД));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СписокПЗ;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеВыборТР_Назначение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НазначитьРесурсНаЗадачуКлиент(ДополнительныеПараметры.ИдСтроки, ВыбранныйЭлемент.Значение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыборПЗ_Назначение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НазначитьРесурсНаЗадачуКлиент(ВыбранныйЭлемент.Значение, ДополнительныеПараметры.ТрудовойРесурс);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРесурсНаЗадачуКлиент(УИДСтрокиЗадачи, ТрудовойРесурс)
	
	СтрокаДерева = ДеревоФормы.НайтиПоИдентификатору(УИДСтрокиЗадачи);
	Если СтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТрудовойРесурсНазначенНаРоль = ТрудовойРесурсНазначенНаРоль(ТрудовойРесурс, СтрокаДерева.Роль);
	Если Не ТрудовойРесурсНазначенНаРоль Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ПараметрыНазначения = Новый Структура();
	// Режим совместимости 8.3.24 или "Не использовать".
	ЗаполнитьПараметрыНазначенияРесурсаНаЗадачу(ПараметрыНазначения, УИДСтрокиЗадачи,
		ТрудовойРесурс, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.Форма.ПараметрыНазначения",
		ПараметрыНазначения, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНазначенияРесурсаНаЗадачу(ПараметрыНазначения,
													УИДСтрокиЗадачи,
													ТрудовойРесурс,
													Отказ = Ложь)
	
	СтрокаДерева = ДеревоФормы.НайтиПоИдентификатору(УИДСтрокиЗадачи);
	Если СтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыНазначения.Вставить("УИДСтрокиЗадачи", УИДСтрокиЗадачи);
	ПараметрыНазначения.Вставить("ТрудовойРесурс", ТрудовойРесурс);
	ПараметрыНазначения.Вставить("ПроектнаяЗадачаЗеркало", СтрокаДерева.ПроектнаяЗадачаЗеркало);
	ПараметрыНазначения.Вставить("Роль", СтрокаДерева.Роль);
	ПараметрыНазначения.Вставить("МинимальнаяДатаСтарта", Макс(СтрокаДерева.ДатаНачалаТП, НачалоПериодаНаФорме));
	Если ЗначениеЗаполнено(СтрокаДерева.ПрофильРаспределенияРоли) Тогда
		ПараметрыНазначения.Вставить("ПрофильРаспределения", СтрокаДерева.ПрофильРаспределенияРоли);
	Иначе
		ПараметрыНазначения.Вставить("ПрофильРаспределения", 
			ПредопределенноеЗначение("Справочник.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение"));
	КонецЕсли;
	Отбор = Новый Структура("ПроектнаяЗадача, Роль, ТрудовойРесурс");
	Если Объект.ПорядокГруппировок = 1 И Не ЗначениеЗаполнено(СтрокаДерева.ПроектнаяЗадача) Тогда
		ОтборЗеркало = Новый Структура("ПроектнаяЗадачаЗеркало", СтрокаДерева.ПроектнаяЗадачаЗеркало);
		мНайденныеСтроки = Объект.Данные.НайтиСтроки(ОтборЗеркало); 
		Если мНайденныеСтроки.Количество() = 0 Тогда
			Отказ = Истина;
			Возврат;
		Иначе
			Отбор.ПроектнаяЗадача = мНайденныеСтроки[0].ПроектнаяЗадача;
		КонецЕсли;	
	Иначе	
		Отбор.ПроектнаяЗадача = СтрокаДерева.ПроектнаяЗадача;
	КонецЕсли;	
	Отбор.Роль = СтрокаДерева.Роль;
	Отбор.ТрудовойРесурс = ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.ПустаяСсылка");
	мНайденныеСтроки = Объект.Данные.НайтиСтроки(Отбор);
	Если мНайденныеСтроки.Количество() > 0 Тогда
		ПараметрыНазначения.Вставить("КоличествоЧасовПоРоли", мНайденныеСтроки[0].ИтогПоРоли);
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	мНайденныеСтроки = Объект.РаспределениеПоПериоду.НайтиСтроки(Отбор);
	ИтогПоПериодуНовоеЗначение = 0;

	ИтогПоПериодуПоРоли = 0;
	Для Каждого НайденнаяСтрока Из мНайденныеСтроки Цикл
		Если НайденнаяСтрока.ТипДанных = "НовоеЗначение" Тогда
			ИтогПоПериодуНовоеЗначение = ИтогПоПериодуНовоеЗначение + НайденнаяСтрока.Значение; 	
		ИначеЕсли НайденнаяСтрока.ТипДанных = "ПоРоли" Тогда
			ИтогПоПериодуПоРоли = ИтогПоПериодуПоРоли + НайденнаяСтрока.Значение;
		КонецЕсли;	
	КонецЦикла;	

	ОстатокПоРолиЗаВсеВремя = ПараметрыНазначения.КоличествоЧасовПоРоли;
	мСтрокНижнегоУровня = мКэшЗначений.СтрокиПЗ_НижнийУровень.Получить(СтрокаДерева.ПроектнаяЗадачаЗеркало);
	Для каждого СтрокаНижнегоУровня Из мСтрокНижнегоУровня Цикл
		СтрокаНижнегоУровняДерева = ДеревоФормы.НайтиПоИдентификатору(СтрокаНижнегоУровня);
		Если Не ЗначениеЗаполнено(СтрокаНижнегоУровняДерева.ТрудовойРесурс) 
			И СтрокаНижнегоУровняДерева.Роль = СтрокаДерева.Роль Тогда
			ОстатокПоРолиЗаВсеВремя = СтрокаНижнегоУровняДерева.ИтогНовоеЗначение; 
			Прервать;
		КонецЕсли;	
	КонецЦикла;	

	ПараметрыНазначения.Вставить("КоличествоЧасов", Мин(ИтогПоПериодуНовоеЗначение, ОстатокПоРолиЗаВсеВремя));
	ПараметрыНазначения.Вставить("КоличествоЧасовПоРолиЗаПериод", ИтогПоПериодуПоРоли);

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДанныхДляНазначенияПоЗадаче() 
	
	СтруктураДанных = Новый Структура("ПроектнаяЗадача, ПроектнаяЗадачаЗеркало, Роль, Подразделение,
					| ДатаЗавершенияТП, ДатаЗавершенияНП, ДатаНачалаТП, ДатаНачалаНП, 
					| ИтогПоПериодуПоРоли, ИтогПоПериодуНовоеЗначение, ПрофильРаспределенияРоли");
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервереБезКонтекста
Функция НоваяТаблицаРесурсов()
	
	ТаблицаРесурсов = Новый ТаблицаЗначений;
	ТаблицаРесурсов.Колонки.Добавить("ПрофильРаспределения");
	ТаблицаРесурсов.Колонки.Добавить("ЕдиницаНормирования");
	ТаблицаРесурсов.Колонки.Добавить("Количество");
	ТаблицаРесурсов.Колонки.Добавить("Ресурс");
	ТаблицаРесурсов.Колонки.Добавить("Роль");
	ТаблицаРесурсов.Колонки.Добавить("СпособПривязки");
	ТаблицаРесурсов.Колонки.Добавить("ОбщСтоимость");
	ТаблицаРесурсов.Колонки.Добавить("ОбщВнешняяСтоимость");		
	ТаблицаРесурсов.Колонки.Добавить("Стоимость");
	ТаблицаРесурсов.Колонки.Добавить("ВнешняяСтоимость");
	ТаблицаРесурсов.Колонки.Добавить("УровеньПланирования");
	ТаблицаРесурсов.Колонки.Добавить("Подразделение");
    ТаблицаРесурсов.Колонки.Добавить("ИсточникПлана");

	Возврат ТаблицаРесурсов;
	
КонецФункции	

&НаСервере
Функция НайтиСоздатьСтрокуДанныхРесурса(СтруктураДанных, Ресурс)
	
	СтрокаДанных = Неопределено;
	
	ИтогПоРоли = 0;
	Отбор = Новый Структура("ПроектнаяЗадача, Роль", СтруктураДанных.ПроектнаяЗадача, СтруктураДанных.Роль);
	СтрокиПоПЗ = Объект.Данные.Выгрузить(Отбор, "ИтогПоРоли");
	Если СтрокиПоПЗ.Количество() > 0 Тогда
		СтрокиПоПЗ.Сортировать("ИтогПоРоли Убыв");
		ИтогПоРоли = СтрокиПоПЗ[0].ИтогПоРоли;
	КонецЕсли;
	
	Отбор = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс", СтруктураДанных.ПроектнаяЗадача, Ресурс);
	мНайденныеСтроки = Объект.Данные.НайтиСтроки(Отбор);
	Если мНайденныеСтроки.Количество() = 0 Тогда
		СтрокаДанных = Объект.Данные.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтруктураДанных);
		СтрокаДанных.Редактируется = Истина;
		СтрокаДанных.Записывать = Истина;
		СтрокаДанных.ТрудовойРесурс = Ресурс;
		СтрокаДанных.ИтогПоРоли = ИтогПоРоли;
	Иначе
		Если мНайденныеСтроки[0].Роль <> СтруктураДанных.Роль Тогда
			ШаблонСообщения = НСтр("ru = 'Трудовой ресурс ""%1"" уже выделен на задачу ""%2"" по роли ""%3.""'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
					Ресурс,
					СтруктураДанных.ПроектнаяЗадачаЗеркало,
					мНайденныеСтроки[0].Роль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат СтрокаДанных;
		Иначе
			СтрокаДанных = мНайденныеСтроки[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаДанных;
	
КонецФункции

&НаСервере
Функция ДатаЗавершенияПоПараметрамНазначения(ПараметрыНазначения, ЭтоДобавлениеВОчередь, ДатаЗавершенияТП)
	
	Если ПараметрыНазначения = Неопределено Или ЭтоДобавлениеВОчередь Тогда																																																						
		ДатаЗавершения = Неопределено;																									
	ИначеЕсли ПараметрыНазначения.Свойство("РаспределятьНаПериодПланирования") 
		И ПараметрыНазначения.РаспределятьНаПериодПланирования Тогда
		ДатаЗавершения = Мин(ДатаЗавершенияТП, Объект.КонецПериода);																									
	Иначе																													
		ДатаЗавершения = ДатаЗавершенияТП;																									
	КонецЕсли;
	
	Возврат ДатаЗавершения;
	
КонецФункции

&НаСервере
Функция РассчитатьНазначенныеЧасы(ПараметрыНазначения, СтруктураДанных, Ресурс)
	
	КоличествоЧасовНазначено = 0;
	СтруктураОтбора = Новый Структура("ПроектнаяЗадача, Роль, ТрудовойРесурс, ТипДанных", 
										СтруктураДанных.ПроектнаяЗадача, 
										СтруктураДанных.Роль, 
										Ресурс,
										"НовоеЗначение");
	СтрокиРаспределения = Объект.РаспределениеПоПериоду.НайтиСтроки(СтруктураОтбора);
	Для Каждого Строка Из СтрокиРаспределения Цикл
		КоличествоЧасовНазначено = КоличествоЧасовНазначено + Строка.Значение;	
	КонецЦикла;
	
	НеРаспределятьНаПериодПланирования = ПараметрыНазначения <> Неопределено 
		И ПараметрыНазначения.Свойство("РаспределятьНаПериодПланирования") 
		И Не ПараметрыНазначения.РаспределятьНаПериодПланирования; 
	
	Если НеРаспределятьНаПериодПланирования Тогда
		
		мУдалить = Новый Массив;
		СтруктураОтбора = Новый Структура("ПроектнаяЗадача, Роль, Ресурс", 
											СтруктураДанных.ПроектнаяЗадача, 
											СтруктураДанных.Роль, 
											Ресурс);
		СтрокиРаспределения = Объект.ТрудозатратыЗаПериодомПланирования.НайтиСтроки(СтруктураОтбора);
		СтруктураОтбора = Новый Структура("ПроектнаяЗадача, Роль, Ресурс, Дата", 
											СтруктураДанных.ПроектнаяЗадача, 
											СтруктураДанных.Роль, 
											Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
		Для Каждого Строка Из СтрокиРаспределения Цикл
			Если Строка.Дата > Объект.НачалоПериода Тогда
				КоличествоЧасовНазначено = КоличествоЧасовНазначено + Строка.Трудозатраты;
				СтруктураОтбора.Дата = Строка.Дата;
				СтрокиРаспределенияБезРесурса = Объект.ТрудозатратыЗаПериодомПланирования.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаБезРесурса Из СтрокиРаспределенияБезРесурса Цикл
					СтрокаБезРесурса.Трудозатраты = СтрокаБезРесурса.Трудозатраты + Строка.Трудозатраты;
				КонецЦикла;	
				мУдалить.Добавить(Строка);
			КонецЕсли;	
		КонецЦикла;
		
		Для Каждого Строка Из мУдалить Цикл
			Объект.ТрудозатратыЗаПериодомПланирования.Удалить(Строка);	
		КонецЦикла;	
		
	КонецЕсли;	
	
	Возврат КоличествоЧасовНазначено;
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьСтрокуРесурса(СтрокаРесурсов, СтруктураДанных, Ресурс, ПараметрыНазначения, ЭтоДобавлениеВОчередь)
	
	СтрокаРесурсов.ЕдиницаНормирования = Справочники.упоЕдиницыВремени.Час;

	СтрокаРесурсов.Ресурс = Ресурс;
	СтрокаРесурсов.Роль = СтруктураДанных.Роль;	
	СтрокаРесурсов.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения;
	СтрокаРесурсов.УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
	СтрокаРесурсов.ОбщСтоимость = 0;
	СтрокаРесурсов.Стоимость = 0;
	СтрокаРесурсов.ОбщВнешняяСтоимость = 0;
	СтрокаРесурсов.ВнешняяСтоимость = 0;		
    СтрокаРесурсов.ИсточникПлана = Перечисления.упоИсточникПланаТрудозатратРолей.Трудозатраты;
		
	Если ПараметрыНазначения = Неопределено Тогда 
		СтрокаРесурсов.ПрофильРаспределения = Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение;
		СтрокаРесурсов.Количество = СтруктураДанных.ИтогПоПериодуНовоеЗначение; // ИтогПоПериодуПоРоли
	Иначе
		Если ЭтоДобавлениеВОчередь Тогда
			СтрокаРесурсов.ПрофильРаспределения = Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение;
			СтрокаРесурсов.Количество = ПараметрыНазначения.КоличествоЧасов;
		Иначе	
			СтрокаРесурсов.ПрофильРаспределения = ПараметрыНазначения.ПрофильРаспределения;
						
			КоличествоЧасовНазначено = РассчитатьНазначенныеЧасы(ПараметрыНазначения, СтруктураДанных, Ресурс);												
			СтрокаРесурсов.Количество = ПараметрыНазначения.КоличествоЧасов + КоличествоЧасовНазначено;			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Процедура НазначитьРесурсНаЗадачуСервер(Ресурс, 
									ИдСтрокиПЗНижнегоУровня = Неопределено, 
									СтруктураДанных = Неопределено, 										
									ПараметрыНазначения = Неопределено) 

	Если НЕ ИдСтрокиПЗНижнегоУровня = Неопределено Тогда

		ИдСтроки = ИдСтрокиПЗНижнегоУровня;

		СтрокаДерева = ДеревоФормы.НайтиПоИдентификатору(ИдСтроки);
		Если Объект.ПорядокГруппировок = 1 И СтрокаДерева.ИмяГруппировки = "Роль" Тогда
			ЭлементыСтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
			Если ЭлементыСтрокиДерева.Количество() = 0 Тогда
				Возврат;
			Иначе
				СтрокаДерева = ЭлементыСтрокиДерева[0];
			КонецЕсли;	
		КонецЕсли;	
		СтруктураДанных = ПолучитьСтруктуруДанныхДляНазначенияПоЗадаче();
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаДерева);
		
	ИначеЕсли СтруктураДанных = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;

	ЗагрузитьДанныеОбъектаИзФормы(Объект);

	СтрокаДанных = НайтиСоздатьСтрокуДанныхРесурса(СтруктураДанных, Ресурс);
	Если СтрокаДанных = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;		
	
	СтруктураОтбора = Новый Структура("ТрудовойРесурс, ТипДанных", Ресурс, "НовоеЗначение");
	СтрокиРаспределения = Объект.РаспределениеПоПериоду.НайтиСтроки(СтруктураОтбора);
	
	ЭтоДобавлениеВОчередь = ПараметрыНазначения <> Неопределено И ПараметрыНазначения.ДобавитьВОчередь;		

	Если ПараметрыНазначения = Неопределено Или ЭтоДобавлениеВОчередь Тогда
		МаксДата = Дата(1, 1, 1);
		Для Каждого Строка Из СтрокиРаспределения Цикл
			Если ЗначениеЗаполнено(Строка.Значение) И МаксДата < Строка.Дата Тогда
				МаксДата = Строка.Дата;
			КонецЕсли;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(МаксДата) Тогда
			МаксДата = Объект.НачалоПериода;
		Иначе
			ДеньВСекундах = 24 * 3600;
			МаксДата = МаксДата + ДеньВСекундах;
		КонецЕсли;
	Иначе
		МаксДата = ПараметрыНазначения.ДатаСтарта;
	КонецЕсли;

	ТаблицаРесурсов = НоваяТаблицаРесурсов();
	
	СтрокаРесурсов = ТаблицаРесурсов.Добавить();
	
	ЗаполнитьСтрокуРесурса(СтрокаРесурсов, СтруктураДанных, Ресурс, ПараметрыНазначения, ЭтоДобавлениеВОчередь);

	// 		
	
	КалендарьЗадачи = КалендарьЗадачи(СтруктураДанных.ПроектнаяЗадача);
	
	ДатаЗавершения = ДатаЗавершенияПоПараметрамНазначения(ПараметрыНазначения, 
														ЭтоДобавлениеВОчередь, 
														КонецДня(СтрокаДанных.ДатаЗавершенияТП));	
	
	РезультатРаспределения = упоРаспределениеТрудозатратВызовСервера.РаспределитьТрудозатратыПоПрофилям(ТаблицаРесурсов, 
																										КалендарьЗадачи, 
																										МаксДата, 
																										ДатаЗавершения, 
																										Ложь);		
																										
	ОбработатьРезультатРаспределения(РезультатРаспределения, СтруктураДанных, Ресурс, МаксДата);																				
		
	Если Объект.КонецПериода < МаксДата Тогда
		
		ПересчитатьТрудозатратыПриРасширенииПериода(МаксДата);
		
		Объект.КонецПериода = МаксДата;
		
	КонецЕсли;

	Отбор = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс", СтруктураДанных.ПроектнаяЗадача, Ресурс);	
	СтрокиОтмены = Объект.ОтменаНазначения.НайтиСтроки(Отбор);
	Для Каждого СтрокаОтмены Из СтрокиОтмены Цикл
		Объект.ОтменаНазначения.Удалить(СтрокаОтмены);	
	КонецЦикла;

	ДанныеОбъекта_ОпределитьНовыеДатыПЗ(СтруктураДанных.ПроектнаяЗадача);

	ДанныеОбъекта_УдалитьПустыеДанныеПоТР(Ресурс);

	ЗагрузитьДанныеФормыИзОбъекта();
	АдаптироватьЭлементы(ЭтаФорма);
	УстановитьВидимостьДоступностьЭлементовКлиентСервер(ЭтаФорма);

КонецПроцедуры

&НаСервереБезКонтекста
Функция КалендарьЗадачи(ПроектнаяЗадача)
	
	КалендарьЗадачи = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача, 
																			"КалендарьЗадачи");
	Если ЗначениеЗаполнено(КалендарьЗадачи) Тогда
		Календарь = КалендарьЗадачи;
	Иначе
		ПроектЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
		Календарь = Справочники.Проекты.ПолучитьРабочийКалендарь(ПроектЗадачи);
	КонецЕсли;
	
	Возврат Календарь;
	
КонецФункции

&НаСервере
Процедура ОбработатьРезультатРаспределения(РезультатРаспределения, СтруктураДанных, Ресурс, МаксДата)
	
	Если РезультатРаспределения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если РезультатРаспределения.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
		
	ОтборСтрокиРаспределения = Новый Структура("ПроектнаяЗадача, Роль, Подразделение, ТрудовойРесурс, Дата, ТипДанных");
	ЗаполнитьЗначенияСвойств(ОтборСтрокиРаспределения, СтруктураДанных);
	ОтборСтрокиРаспределения.ТипДанных = "НовоеЗначение";
	ОтборСтрокиРаспределения.ТрудовойРесурс = Ресурс;
	
	ОтборСтрокиБезРесурса = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс, Роль, Подразделение, ТипДанных, Дата");
	ЗаполнитьЗначенияСвойств(ОтборСтрокиБезРесурса, СтруктураДанных);
	ОтборСтрокиБезРесурса.ТрудовойРесурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	ОтборСтрокиБезРесурса.ТипДанных = "НовоеЗначение";	
		
	Для Каждого СтрокаЗагрузки Из РезультатРаспределения.Строки[0].Строки Цикл
		
		Разница = 0;
		ОтборСтрокиРаспределения.Дата = СтрокаЗагрузки.День;
		СтрокиРаспределения = Объект.РаспределениеПоПериоду.НайтиСтроки(ОтборСтрокиРаспределения);
		Если СтрокиРаспределения.Количество() > 0 Тогда
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
				Разница = СтрокаЗагрузки.Трудозатраты - СтрокаРаспределения.Значение;
				СтрокаРаспределения.Значение = СтрокаЗагрузки.Трудозатраты; 
			КонецЦикла;	
		Иначе				
			СтрокаНов = Объект.РаспределениеПоПериоду.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНов, ОтборСтрокиРаспределения);
			СтрокаНов.Значение = СтрокаЗагрузки.Трудозатраты;
			Разница = СтрокаЗагрузки.Трудозатраты;
		КонецЕсли;
		
		МаксДата = Макс(МаксДата, СтрокаЗагрузки.День);
		
		ОтборСтрокиБезРесурса.Дата = СтрокаЗагрузки.День;
		СтрокиБезРесурса = Объект.РаспределениеПоПериоду.НайтиСтроки(ОтборСтрокиБезРесурса);
		Если СтрокиБезРесурса.Количество() > 0 Тогда
			СтрокиБезРесурса[0].Значение = СтрокиБезРесурса[0].Значение - Разница; // СтрокаЗагрузки.Трудозатраты;
		Иначе	
			СтрокаБезРесурсаНов = Объект.РаспределениеПоПериоду.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаБезРесурсаНов, ОтборСтрокиБезРесурса);
			СтрокаБезРесурсаНов.Значение = - Разница; // СтрокаЗагрузки.Трудозатраты;
		КонецЕсли;	
		
	КонецЦикла;			
	
КонецПроцедуры

&НаСервере
Процедура ДанныеОбъекта_УдалитьПустыеДанныеПоТР(Ресурс) 

	СтруктураОтбора = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс", 
									Документы.упоПроектнаяЗадача.ПустаяСсылка(), Ресурс);
	Строки = Объект.РаспределениеПоПериоду.НайтиСтроки(СтруктураОтбора);	
	Для Каждого Строка Из Строки Цикл
		Объект.РаспределениеПоПериоду.Удалить(Строка);	
	КонецЦикла;
	Строки = Объект.Данные.НайтиСтроки(СтруктураОтбора);	
	Для Каждого Строка Из Строки Цикл
		Объект.Данные.Удалить(Строка);	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ДанныеОбъекта_УдалитьДанныеРаспределения(Ресурс, ПроектнаяЗадача, 
	ТипДанных = "НовоеЗначение", Роль = Неопределено) 

	СтруктураОтбора = Новый Структура("ПроектнаяЗадача, ТрудовойРесурс, ТипДанных", ПроектнаяЗадача, Ресурс, ТипДанных);
	Если Роль <> Неопределено Тогда
		СтруктураОтбора.Вставить("Роль", Роль);	
	КонецЕсли;
	Строки = Объект.РаспределениеПоПериоду.НайтиСтроки(СтруктураОтбора);	
	Для Каждого Строка Из Строки Цикл
		Объект.РаспределениеПоПериоду.Удалить(Строка);	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУстановитьТрудозатратыВСтрокеПоИсточнику(СтрокаПриемник, Значение, ИмяПоля)

	Если Не СтрокаПриемник.ЕстьПраваНаРедактирование Тогда
		Возврат;		
	КонецЕсли;

	ИмяКолонки = ПолучитьИмяОсновнойКолонкиПоИмениЭлемента(ИмяПоля); 
	Если ИмяКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПолеПриемник = ИмяКолонки + "НовоеЗначение";

	Если ЯчейкуМожноРедактировать(СтрокаПриемник, ПолеПриемник) Тогда
		РазмерМассиваЗначенияПриПеретаскивании = 3;
		Если ТипЗнч(Значение) = Тип("Массив") 
			И Значение.Количество() = РазмерМассиваЗначенияПриПеретаскивании 
			И Значение[0] = ("Перетаскивание" + ЭтаФорма.УникальныйИдентификатор) Тогда
			
			СтрокаИсточник = ДеревоФормы.НайтиПоИдентификатору(Значение[1]); 
			ПолеИсточник = Значение[2];
			УстановитьТрудозатраты(ЭтаФорма, 
									СтрокаПриемник, 
									ПолеПриемник, 
									СтрокаПриемник[ПолеПриемник] + СтрокаИсточник[ПолеИсточник]);
			Если ЯчейкуМожноРедактировать(СтрокаИсточник, ПолеИсточник) Тогда
				СтрокаИсточник[ПолеИсточник] = 0;	
				УстановитьТрудозатраты(ЭтаФорма, СтрокаИсточник, ПолеИсточник, 0);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Значение) = Тип("Массив") И Значение.Количество() > 0 И ТипЗнч(Значение[0]) = Тип("Число") Тогда
			УстановитьТрудозатраты(ЭтаФорма, СтрокаПриемник, ПолеПриемник, СтрокаПриемник[ПолеПриемник] + Значение[0]);
		ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
			УстановитьТрудозатраты(ЭтаФорма, СтрокаПриемник, ПолеПриемник, СтрокаПриемник[ПолеПриемник] + Значение);
		ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда	
			Попытка
				Значение = Число(Значение);
				УстановитьТрудозатраты(ЭтаФорма, СтрокаПриемник, ПолеПриемник, СтрокаПриемник[ПолеПриемник] + Значение);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Функция ЯчейкуМожноРедактировать(Строка, Поле) 
	
	Возврат Строка.Редактируется 
			И Строка.ПоследнийУровень 
			И Прав(Поле, 13) = "НовоеЗначение";

КонецФункции

&НаКлиенте
Процедура УдалитьПустыеСтрокиИзСпискаПроектов()

	Если Не ЗначениеЗаполнено(СписокПроектов) Тогда
		Возврат;	
	КонецЕсли;
	
	СтрокиКУдалению = Новый Массив;
	
	Для каждого Строка Из СписокПроектов Цикл
		Если Не ЗначениеЗаполнено(Строка.Значение) Тогда
			СтрокиКУдалению.Добавить(Строка);
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого УдалаяемаяСтрока Из СтрокиКУдалению Цикл
		СписокПроектов.Удалить(УдалаяемаяСтрока);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОтборыИзФормы(тОбъект)

	тОбъект.Роли.Очистить();
	Для Каждого ЭлементРоли Из СписокРолей Цикл	
		СтрокаРоли = тОбъект.Роли.Добавить();	
		СтрокаРоли.Роль = ЭлементРоли.Значение;
	КонецЦикла;
	
	тОбъект.Подразделения.Очистить();
	Для Каждого ЭлементПодразделение Из СписокПодразделений Цикл
		СтрокаПроекта = тОбъект.Подразделения.Добавить();	
		СтрокаПроекта.Подразделение = ЭлементПодразделение.Значение;
	КонецЦикла;
	
	тОбъект.Проекты.Очистить();
	Для Каждого ЭлементПроект Из СписокПроектов Цикл
		Если ЗначениеЗаполнено(ЭлементПроект.Значение) Тогда
			СтрокаПроекта = тОбъект.Проекты.Добавить();	
			СтрокаПроекта.Проект = ЭлементПроект.Значение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ТрудовойРесурсНазначенНаРоль(ТрудовойРесурс, Роль)
	
	РолиРесурса = упоРесурсыИРолиВызовСервера.обПолучитьТекщиеРолиТрудовогоРесурса(ТрудовойРесурс);
	ТрудовойРесурсНазначенНаРоль = РолиРесурса.Найти(Роль) <> Неопределено;
	
	Возврат ТрудовойРесурсНазначенНаРоль;
	
КонецФункции

&НаСервере
Функция СписокТрудовыхРесурсовИзТаблицы()
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого Строка Из Объект.Ресурсы Цикл
		Если ДанныеВыбора.НайтиПоЗначению(Строка.ТрудовойРесурс) = Неопределено Тогда
			ДанныеВыбора.Добавить(Строка.ТрудовойРесурс);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти
