
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = ПолучитьПараметрыВидаСобытия(ПараметрКоманды);
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаТестаОтправкиСообщения", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПараметрыВидаСобытия(ВидСобытия)
	
	Пар = Новый Структура;
	Пар.Вставить("Источник",ВидСобытия.Источник);
	Пар.Вставить("ВидСобытия",ВидСобытия);
	
	масВидыПолучателей = Новый Массив;
	Для Каждого СтрТЧ Из ВидСобытия.Получатели Цикл
		масВидыПолучателей.Добавить(СтрТЧ.ВидПолучателя);
	КонецЦикла;
	Пар.Вставить("масВидыПолучателей",масВидыПолучателей);
	
	масТранспорт = Новый Массив;
	Для Каждого СтрТЧ Из ВидСобытия.ТранспортОповещений Цикл
		Если СтрТЧ.Используется Тогда
			масТранспорт.Добавить(СтрТЧ.Транспорт);
		КонецЕсли;
	КонецЦикла;
	Пар.Вставить("масТранспорт",масТранспорт);
	
	Возврат Пар;
	
КонецФункции

#КонецОбласти