////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с ресурсами и нормами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Актуальная зарегистрированная стоимость норм ресурсов.
//
// Параметры:
//  Ресурсы                 - Массив из СправочникСсылка.упоПроектнаяПродукция, СправочникСсылка.Номенклатура,
//                            СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.упоРоли
//  НормыСтоимости          - Массив из СправочникСсылка.упоНормыСтоимости
//  ЭтоПроектнаяПродукция   - Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//      * ЕдиницаНормирования   - СправочникСсылка.упоЕдиницыВремени, СправочникСсылка.УпаковкиЕдиницыИзмерения
//      * ЕдСтоимость           - Число - зарегистрированная стоимость нормы.
//      * Норма                 - СправочникСсылка.упоНормыСтоимости
//      * Ресурс                - СправочникСсылка.упоПроектнаяПродукция, СправочникСсылка.Номенклатура,
//                                СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.упоРоли
//
Функция ЗарегистрированнаяСтоимостьНормРесурсов(Ресурсы, НормыСтоимости, ЭтоПроектнаяПродукция = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Нормы", НормыСтоимости);
	Запрос.УстановитьПараметр("Ресурсы", Ресурсы);
	Если ЭтоПроектнаяПродукция Тогда
		Запрос.Текст = ТекстЗапросаНормыСтоимостиДляПП();
	Иначе
		Запрос.Текст = ТекстЗапросаНормыСтоимости();
	КонецЕсли;
	ДанныеНормСтоимостиРесурса = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеНормСтоимостиРесурса;
	
КонецФункции

#Область РасчетСтоимостиИспользованияОтдельногоРесурса

// Функция рассчитывает стоимость ресурса по норме стоимости и длительности.
//
// Параметры:
//  НормаСтоимости	 - СправочникСсылка.упоНормыСтоимости - ссылка на норму стоимости.
//  Ресурс			 - СправочникСсылка.упоПроектнаяПродукция, СправочникСсылка.Номенклатура, 
// 		СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.упоРоли	 - ресурс
//  Длительность	 - Число
//  Период			 - Дата - период времени, на который необходимо взять норму стоимости.
// 
// Возвращаемое значение:
//  Число - рассчитанная стоимость.
//
Функция обРассчитатьСтоимостьРесурсаПоНорме(НормаСтоимости, Ресурс, Длительность, Период = Неопределено) Экспорт

	// Для полученных ресуросв получим единицу стоимости по норме.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Норма" , НормаСтоимости);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.ЕдСтоимость КАК ЕдСтоимость,
		|	Рег.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(Рег.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени).Коэффициент, 0) КАК Коэффициент
		|ИЗ
		|	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
		|			,
		|			Ресурс = &Ресурс
		|				И Норма = &Норма) КАК Рег";
	
	
	Если НЕ Период = Неопределено И НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Период) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".СрезПоследних(", ".СрезПоследних(&ПериодДействия");
		Запрос.УстановитьПараметр("ПериодДействия", Период);
	КонецЕсли; 
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0; // Нет сведений о норме.
	КонецЕсли;
		
	// Считаем, что длительность для расчета стоимости передали в часах
	// вычисляем стоимость одного часа по норме.
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СтоимостьЧаса = 0;
	
	Если ЗначениеЗаполнено(Выборка.ЕдиницаНормирования) Тогда
		Если НЕ Выборка.Коэффициент = 0 Тогда
			СтоимостьЧаса = Выборка.ЕдСтоимость / Выборка.Коэффициент;
		Иначе
			СтоимостьЧаса = Выборка.ЕдСтоимость;
		КонецЕсли;
	Иначе
		СтоимостьЧаса = Выборка.ЕдСтоимость;
	КонецЕсли; 
	
	Возврат Длительность * СтоимостьЧаса;

КонецФункции

#КонецОбласти

#Область РасчетСтоимостиИспользованияРесурсовДляТЧРесурсы

// Производит групповой перерасчет стоимости ресурсов для табличной части документа.
//
// Параметры:
//  ТабличнаяЧасть	 - ТаблицаЗначений, ТабличнаяЧасть	 - табличная часть документа, подлежащая перерасчету.
//  Объект			 - ДокументОбъект					 - объект-владелец табличной части.
//  НормаСтоимости	 - СправочникСсылка.упоНормыСтоимости	 - норма стоимости.
//
Процедура обРассчитатьСтоимостьРесурсовПоНорме(ТабличнаяЧасть, Объект, НормаСтоимости = Неопределено) Экспорт
	
	// По табличной часте получим список ресурсов.
	СписокРесурсов = ТабличнаяЧасть.ВыгрузитьКолонку("Ресурс");
	
	Нормы = Новый Массив;
	Если НормаСтоимости = Неопределено Тогда
		Нормы.Добавить(Объект.НормаСтоимости);
	Иначе
		Нормы.Добавить(НормаСтоимости);
	КонецЕсли;
	
	// Для полученных ресуросв получим единицу стоимости по норме.
	ТипПП = Тип("СправочникСсылка.упоПроектнаяПродукция");
	Если ЗначениеЗаполнено(СписокРесурсов) И (ТипЗнч(СписокРесурсов[0]) = ТипПП) Тогда
		ЭтоПроектнаяПродукция = Истина;
		ТаблицаСтоимости = ЗарегистрированнаяСтоимостьНормРесурсов(СписокРесурсов, Нормы, ЭтоПроектнаяПродукция);
	Иначе
		ТаблицаСтоимости = ЗарегистрированнаяСтоимостьНормРесурсов(СписокРесурсов, Нормы);
	КонецЕсли;
	
	НужноПересчитатьПоКурсуВалюты = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.упоПроектнаяЗадача")
			И ТипЗнч(ТабличнаяЧасть) = Тип("ДокументТабличнаяЧасть.упоПроектнаяЗадача.МатериальныеРесурсы"), Истина, Ложь);
	Если НужноПересчитатьПоКурсуВалюты Тогда
		ВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
		ПараметрыКурсаВалютыУправленческогоУчета =
			РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУправленческогоУчета, ТекущаяДатаСеанса());
		МассивВалют = ТабличнаяЧасть.ВыгрузитьКолонку("Валюта");
		ТаблицаКурсовВалют = ПолучитьТаблицуКурсовВалют(МассивВалют);
	КонецЕсли;
	
	СтруктураВалюты = Новый Структура;
	СтруктураВалюты.Вставить("ТаблицаКурсовВалют", ТаблицаКурсовВалют);
	СтруктураВалюты.Вставить("ПараметрыКурсаВалютыУправленческогоУчета", ПараметрыКурсаВалютыУправленческогоУчета);
	СтруктураВалюты.Вставить("НужноПересчитатьПоКурсуВалюты", НужноПересчитатьПоКурсуВалюты);
	
	// Для каждого ресурса пересчитаем стоимость по норме.
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаТЧ.Количество) Тогда
			СтрокаТЧ.Количество = 1;
		КонецЕсли;
		
		ДанныеРесурса = ТаблицаСтоимости.Найти(СтрокаТЧ.Ресурс, "Ресурс");
		
		Если ЗначениеЗаполнено(ДанныеРесурса) Тогда
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаТЧ.ЕдиницаНормирования) Тогда
				СтрокаТЧ.ЕдиницаНормирования = ДанныеРесурса.ЕдиницаНормирования;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьСтоимостьРесурсаВСтрокеПоНорме(СтрокаТЧ, ДанныеРесурса, СтруктураВалюты);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПриИзмененииЭлементовСтрокиТЧРесурсы

// Заполняет данные стоимости строки табличной части по выбранным нормам стоимости и
// пересчитывает общую стоимость ресурса, а также устанавливает статью затрат в соответствии с выбранным ресурсом.
// Вызывается при изменении ресурса в строке.
//
// Параметры:
//  СтрокаТабличнойЧасти        - СтрокаТабличнойЧасти
//  Объект                      - ДокументОбъект	 - объект-владелец табличной части.
//  НормаСтоимости              - СправочникСсылка.упоНормыСтоимости, Структура:
//                                                         * <имя реквизита указанной нормы в объекте и его значение>
//                                                         * ...
//  ДозаполнитьСтатьюЗатрат     - Булево - если Истина, то в строку ТЧ подставляется статья затрат по умолчанию.
//  ИмяКолонкиСтатьяЗатрат      - Строка - имя колонки, которую нужно заполнить в случае, если ДозаполнитьСтатьюЗатрат = Истина.
//  ЕстьКолонкаОбщаяСтоимость   - Булево - если Истина, то колоная ОбщаяСтоимость будет заполнена.
//  ОбновлятьКоличество         - Булево
//
Процедура обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти,
		Объект, 
		НормаСтоимости = Неопределено,
		ДозаполнитьСтатьюЗатрат = Ложь, 
		ИмяКолонкиСтатьяЗатрат = "СтатьяЗатрат",
		ЕстьКолонкаОбщаяСтоимость = Ложь,
		ОбновлятьКоличество = Ложь) Экспорт
	
	ЭтоРольТрудовогоРесурса = ТипЗнч(СтрокаТабличнойЧасти.Ресурс) = Тип("СправочникСсылка.упоРоли");
	Если ЭтоРольТрудовогоРесурса Тогда
		обОбработатьИзменениеРолиТабЧасти(СтрокаТабличнойЧасти, Объект, НормаСтоимости, ИмяКолонкиСтатьяЗатрат,
			ЕстьКолонкаОбщаяСтоимость, ОбновлятьКоличество);
	Иначе
		обОбработатьИзменениеРесурсаТабЧасти(СтрокаТабличнойЧасти, Объект, НормаСтоимости, ИмяКолонкиСтатьяЗатрат,
			ЕстьКолонкаОбщаяСтоимость, ОбновлятьКоличество);
	КонецЕсли;
	
	обРассчитатьОбщуюСтоимостьРесурса(СтрокаТабличнойЧасти, ЕстьКолонкаОбщаяСтоимость);
	
	Если ДозаполнитьСтатьюЗатрат Тогда 
		упоПроектыИЗадачиСервер.УстановитьСтатьюЗатратРесурса(СтрокаТабличнойЧасти, , ИмяКолонкиСтатьяЗатрат);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет заданную строку табличной части по стоимости ресурса и пересчитывает общую стоимость ресурса.
//  Вызывается при изменении единицы нормирования в строке.
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти
//  Объект				 - ДокументОбъект	 - объект-владелец табличной части.
//
Процедура обПриИзмененииЕдиницыНормированияТабЧасти(СтрокаТабличнойЧасти, Объект) Экспорт
	
	обЗаполнитьСтоимостьРесурса(СтрокаТабличнойЧасти, Объект);
	
	обРассчитатьОбщуюСтоимостьРесурса(СтрокаТабличнойЧасти);
	
КонецПроцедуры

// Пересчитывает в заданной строке табличной части общую стоимость ресурса.
//  Вызывается при изменении стоимости ресурса в строке.
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти
//  Объект				 - ДокументОбъект		 - объект-владелец табличной части.
//
Процедура обПриИзмененииСтоимостиТабЧасти(СтрокаТабличнойЧасти, Объект) Экспорт
	
	обРассчитатьОбщуюСтоимостьРесурса(СтрокаТабличнойЧасти);
	
КонецПроцедуры

// Пересчитывает в заданной строке табличной части общую стоимость ресурса.
//  Вызывается при изменении количества ресурса в строке.
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти	
//  Объект				 - ДокументОбъект	 - объект-владелец табличной части.
//  ЕстьВнешняяСтоимость - Булево
//
Процедура обПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти, Объект, ЕстьВнешняяСтоимость = Ложь) Экспорт
	
	обРассчитатьОбщуюСтоимостьРесурса(СтрокаТабличнойЧасти, ЕстьВнешняяСтоимость);
	
КонецПроцедуры

// Пересчитывает в заданной строке табличной части стоимость ресурса.
//  Вызывается при изменении общей стоимости ресурса в строке.
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти
//  Объект				 - ДокументОбъект - объект-владелец табличной части.
//
Процедура обПриИзмененииОбщСтоимостиТабЧасти(СтрокаТабличнойЧасти, Объект) Экспорт
	
	обРассчитатьСтоимостьРесурса(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПересчитатьСтоимостьПоКоэффициентуЕдиницыНормирования(ЕдиницаИзмерения, ЕдиницаНормирования, Стоимость)
	
	Если ЕдиницаНормирования.Метаданные().Реквизиты.Найти("Коэффициент") = Неопределено
		Или ЕдиницаИзмерения.Метаданные().Реквизиты.Найти("Коэффициент") = Неопределено Тогда
		Возврат Стоимость;
	КонецЕсли;
	
	КоэффициентЕдиницыНормирования = ?(ЗначениеЗаполнено(ЕдиницаНормирования.Коэффициент), ЕдиницаНормирования.Коэффициент, 1);	
	СтоимостьВБазовойЕдиницеИзмерения = Стоимость / КоэффициентЕдиницыНормирования;
	
	КоэффициентВыбраннойЕдиницыИзмерения = ?(ЗначениеЗаполнено(ЕдиницаИзмерения.Коэффициент), ЕдиницаИзмерения.Коэффициент, 1);
	СтоимостьВВыбраннойЕдиницеИзмерения = СтоимостьВБазовойЕдиницеИзмерения * КоэффициентВыбраннойЕдиницыИзмерения;
	
	Возврат СтоимостьВВыбраннойЕдиницеИзмерения;	

КонецФункции

Процедура ЗаполнитьСтрокуПриОтсутствииДанныхПоНормамСтоимости(СтрокаТабличнойЧасти)
	
	Ресурс = СтрокаТабличнойЧасти.Ресурс;
	ТипРесурса = ТипЗнч(Ресурс);
	СтрокаТабличнойЧасти.Стоимость = 0;
	
	Если ТипРесурса <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ЕдиницаНормирования = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	
	Если Ресурс.упоВидРесурса = Перечисления.упоВидРесурса.Материальный Тогда
		Если Ресурс.упоВидМатериальногоРесурса = Перечисления.упоВидМатериальногоРесурса.Материал Тогда
			СтрокаТабличнойЧасти.ЕдиницаНормирования = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		ИначеЕсли Ресурс.упоВидМатериальногоРесурса = Перечисления.упоВидМатериальногоРесурса.Оборудование Тогда
			СтрокаТабличнойЧасти.ЕдиницаНормирования = Справочники.упоЕдиницыВремени.ПустаяСсылка();
		Иначе
			СтрокаТабличнойЧасти.ЕдиницаНормирования = Неопределено;
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.ЕдиницаНормирования = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Функция НадоУстановитьЕдиницуНормированияПоУмолчанию(СтрокаТабличнойЧасти)
	
	Ресурс = СтрокаТабличнойЧасти.Ресурс;
	ТипРесурса = ТипЗнч(Ресурс); 
    НадоУстановить = Ложь;
	
	Если ТипРесурса <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат НадоУстановить;
	КонецЕсли;	

	НадоУстановить = (Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаНормирования)
						И (Ресурс.упоВидРесурса = Перечисления.упоВидРесурса.Трудовой
							Или	(Ресурс.упоВидРесурса = Перечисления.упоВидРесурса.Материальный 
						И Ресурс.упоВидМатериальногоРесурса = Перечисления.упоВидМатериальногоРесурса.Оборудование)));
		
	Возврат НадоУстановить;
	
КонецФункции

Процедура УстановитьЕдиницуНормированияПоУмолчанию(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.ЕдиницаНормирования = Справочники.упоЕдиницыВремени.Час;
	
КонецПроцедуры

Функция ТекстЗапросаНормыСтоимости()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегНормы.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	РегНормы.ЕдСтоимость КАК ЕдСтоимость,
	               |	РегНормы.Норма КАК Норма,
	               |	РегНормы.Ресурс КАК Ресурс
	               |ИЗ
	               |	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
	               |			,
	               |			Ресурс В (&Ресурсы)
	               |				И Норма В (&Нормы)) КАК РегНормы";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНормыСтоимостиДляПП()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПроектнаяПродукция.Ссылка КАК Ресурс,
	               |	упоПроектнаяПродукция.Шаблон КАК ЭтоШаблон,
	               |	упоПроектнаяПродукция.ШаблонПроектнойПродукции КАК ШаблонПроектнойПродукции
	               |ПОМЕСТИТЬ вт_ПроектнаяПродукция
	               |ИЗ
	               |	Справочник.упоПроектнаяПродукция КАК упоПроектнаяПродукция
	               |ГДЕ
	               |	упоПроектнаяПродукция.Ссылка В(&Ресурсы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_ПроектнаяПродукция.Ресурс КАК ШаблонПроектнойПродукции,
	               |	вт_ПроектнаяПродукция.Ресурс КАК Ресурс
	               |ПОМЕСТИТЬ втШаблоныПП
	               |ИЗ
	               |	вт_ПроектнаяПродукция КАК вт_ПроектнаяПродукция
	               |ГДЕ
	               |	вт_ПроектнаяПродукция.ЭтоШаблон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	вт_ПроектнаяПродукция.ШаблонПроектнойПродукции,
	               |	вт_ПроектнаяПродукция.Ресурс
	               |ИЗ
	               |	вт_ПроектнаяПродукция КАК вт_ПроектнаяПродукция
	               |ГДЕ
	               |	НЕ вт_ПроектнаяПродукция.ЭтоШаблон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РегНормы.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	РегНормы.ЕдСтоимость КАК ЕдСтоимость,
	               |	РегНормы.Норма КАК Норма,
	               |	1 КАК Приоритет,
	               |	втШаблоныПП.Ресурс КАК Ресурс
	               |ПОМЕСТИТЬ ВТ_РегНормы
	               |ИЗ
	               |	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
	               |			,
	               |			Ресурс В
	               |					(ВЫБРАТЬ
	               |						втШаблоныПП.ШаблонПроектнойПродукции КАК ШаблонПроектнойПродукции
	               |					ИЗ
	               |						втШаблоныПП КАК втШаблоныПП)
	               |				И Норма В (&Нормы)) КАК РегНормы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втШаблоныПП КАК втШаблоныПП
	               |		ПО РегНормы.Ресурс = втШаблоныПП.ШаблонПроектнойПродукции
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РегНормы.ЕдиницаНормирования,
	               |	РегНормы.ЕдСтоимость,
	               |	РегНормы.Норма,
	               |	2,
	               |	РегНормы.Ресурс
	               |ИЗ
	               |	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
	               |			,
	               |			Ресурс В (&Ресурсы)
	               |				И Норма В (&Нормы)) КАК РегНормы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РегНормы.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	ВТ_РегНормы.Норма КАК Норма,
	               |	ВТ_РегНормы.Ресурс КАК Ресурс,
	               |	МАКСИМУМ(ВТ_РегНормы.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ ВТ_ОтборРесурсаПоПриоритету
	               |ИЗ
	               |	ВТ_РегНормы КАК ВТ_РегНормы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РегНормы.ЕдиницаНормирования,
	               |	ВТ_РегНормы.Норма,
	               |	ВТ_РегНормы.Ресурс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОтборРесурсаПоПриоритету.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	ВТ_ОтборРесурсаПоПриоритету.Норма КАК Норма,
	               |	ВТ_ОтборРесурсаПоПриоритету.Ресурс КАК Ресурс,
	               |	ВТ_ОтборРесурсаПоПриоритету.Приоритет КАК Приоритет,
	               |	ВТ_РегНормы.ЕдСтоимость КАК ЕдСтоимость
	               |ИЗ
	               |	ВТ_ОтборРесурсаПоПриоритету КАК ВТ_ОтборРесурсаПоПриоритету
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегНормы КАК ВТ_РегНормы
	               |		ПО ВТ_ОтборРесурсаПоПриоритету.Ресурс = ВТ_РегНормы.Ресурс
	               |			И ВТ_ОтборРесурсаПоПриоритету.Норма = ВТ_РегНормы.Норма
	               |			И ВТ_ОтборРесурсаПоПриоритету.Приоритет = ВТ_РегНормы.Приоритет";
	
	Возврат ТекстЗапроса;
	
КонецФункции //

Процедура ЗаполнитьСтрокуПоНесколькимНормамСтоимости(Объект, СтрокаТабличнойЧасти, ДанныеНормСтоимостиРесурса, СоответствиеРеквизитовИНормСтоимости,
		ОбновлятьКоличество)
	
	Для каждого ДанныеНормыСтоимости Из ДанныеНормСтоимостиРесурса Цикл
		КоэфициентЕдВрем = 1;
		ЕдиницаНормирования = ДанныеНормыСтоимости.ЕдиницаНормирования;
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаНормирования)
			И СтрокаТабличнойЧасти.ЕдиницаНормирования <> ЕдиницаНормирования Тогда
			КоэффициентЕдВремСтроки = СтрокаТабличнойЧасти.ЕдиницаНормирования.Коэффициент;
			КоэффициентЕдВремНормы = ЕдиницаНормирования.Коэффициент;
			КоэфициентЕдВрем = КоэффициентЕдВремСтроки / КоэффициентЕдВремНормы;
		Иначе
			СтрокаТабличнойЧасти.ЕдиницаНормирования = ЕдиницаНормирования;
		КонецЕсли;
		
		Для каждого Реквизит Из СоответствиеРеквизитовИНормСтоимости Цикл
			Если Реквизит.Значение = ДанныеНормыСтоимости.Норма Тогда
				СтрокаТабличнойЧасти[Реквизит.Ключ] = ДанныеНормыСтоимости.ЕдСтоимость * КоэфициентЕдВрем;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ОбновлятьКоличество И ТипЗнч(СтрокаТабличнойЧасти.Ресурс) = Тип("СправочникСсылка.Номенклатура")
		Или СтрокаТабличнойЧасти.Количество = Неопределено Тогда
		СтрокаТабличнойЧасти.Количество = 1;
	КонецЕсли;
	
	Если НадоУстановитьЕдиницуНормированияПоУмолчанию(СтрокаТабличнойЧасти) Тогда
		УстановитьЕдиницуНормированияПоУмолчанию(СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПоОднойНормеСтоимости(СтрокаТабличнойЧасти,
		ДанныеНормыСтоимостиРесурса,
		НужноПересчитатьПоКурсуВалюты,
		ОбновлятьКоличество)
	
	ЕдиницаНормирования = ДанныеНормыСтоимостиРесурса[0].ЕдиницаНормирования;
	ЗарегистрированнаяСтоимостьЕдиницы = ДанныеНормыСтоимостиРесурса[0].ЕдСтоимость;
	
	Если НужноПересчитатьПоКурсуВалюты Тогда
		ТекДата = ТекущаяДатаСеанса();
		ВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
		ПараметрыКурсаВалютыУправленческогоУчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУправленческогоУчета, ТекДата);
		ПараметрыКурсаВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаТабличнойЧасти.Валюта, ТекДата);
		СтрокаТабличнойЧасти.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ЗарегистрированнаяСтоимостьЕдиницы,
				ПараметрыКурсаВалютыУправленческогоУчета,
				ПараметрыКурсаВалюты);
	Иначе
		СтрокаТабличнойЧасти.Стоимость = ЗарегистрированнаяСтоимостьЕдиницы;
	КонецЕсли;
	
	Если ОбновлятьКоличество И ТипЗнч(СтрокаТабличнойЧасти.Ресурс) = Тип("СправочникСсылка.Номенклатура")
		Или СтрокаТабличнойЧасти.Количество = Неопределено Тогда
		СтрокаТабличнойЧасти.Количество = 1;
	КонецЕсли;
	
	Если НадоУстановитьЕдиницуНормированияПоУмолчанию(СтрокаТабличнойЧасти) Тогда
		УстановитьЕдиницуНормированияПоУмолчанию(СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

Процедура обОбработатьИзменениеРолиТабЧасти(СтрокаТабличнойЧасти,
		Объект,
		НормыСтоимостиПоКолонкамТабЧасти,
		ИмяКолонкиСтатьяЗатрат,
		ЕстьКолонкаОбщаяСтоимость,
		ОбновлятьКоличество)
	
	Ресурс = СтрокаТабличнойЧасти.Ресурс;
	
	Если Ресурс = Неопределено Тогда
		СтрокаТабличнойЧасти.ЕдиницаНормирования = Неопределено;
		Возврат;
	КонецЕсли;
	
	НужноПересчитатьПоКурсуВалюты = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.упоПроектнаяЗадача"), Истина, Ложь);
	
	Ресурсы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТабличнойЧасти.Ресурс);
	НормыСтоимости = Новый Массив;
	СоответствиеРеквизитовТабЧастиИНормСтоимости = Новый Соответствие;
	
	// Разберем структуру на соответствие и массив для удобства.
	Для каждого КлючИЗначение Из НормыСтоимостиПоКолонкамТабЧасти Цикл
		НормаСтоимостиОбъекта = Объект[КлючИЗначение.Ключ];
		Если ЗначениеЗаполнено(НормаСтоимостиОбъекта) Тогда
			НормыСтоимости.Добавить(НормаСтоимостиОбъекта);
			СоответствиеРеквизитовТабЧастиИНормСтоимости.Вставить(КлючИЗначение.Значение, НормаСтоимостиОбъекта);
		КонецЕсли;
	КонецЦикла;
	
	// Запросим из базы данные по зарегистрированной стоимости ресурса в разрезе норм.
	УстановитьПривилегированныйРежим(Истина);
	ДанныеНормСтоимостиРесурса = ЗарегистрированнаяСтоимостьНормРесурсов(Ресурсы, НормыСтоимости);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеНормСтоимостиРесурса.Количество() Тогда
		ЗаполнитьСтрокуПоНесколькимНормамСтоимости(Объект, СтрокаТабличнойЧасти, ДанныеНормСтоимостиРесурса,
			СоответствиеРеквизитовТабЧастиИНормСтоимости, ОбновлятьКоличество);
	Иначе
		ЗаполнитьСтрокуПриОтсутствииДанныхПоНормамСтоимости(СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

Процедура обОбработатьИзменениеРесурсаТабЧасти(СтрокаТабличнойЧасти,
		Объект,
		НормаСтоимости,
		ИмяКолонкиСтатьяЗатрат,
		ЕстьКолонкаОбщаяСтоимость,
		ОбновлятьКоличество)

	Если НормаСтоимости = Неопределено Тогда
		НормаСтоимости = Объект.НормаСтоимости;
	КонецЕсли;
	
	Ресурс = СтрокаТабличнойЧасти.Ресурс;
	Если Ресурс = Неопределено Тогда
		СтрокаТабличнойЧасти.ЕдиницаНормирования = Неопределено;
		Возврат;
	КонецЕсли;
	
	НужноПересчитатьПоКурсуВалюты = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.упоПроектнаяЗадача"), Истина, Ложь);
	
	// Запросим из базы данные по зарегистрированной стоимости ресурса в разрезе норм.
	Ресурсы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТабличнойЧасти.Ресурс);
	НормыСтоимости =ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НормаСтоимости);
	ДанныеНормСтоимостиРесурса = ЗарегистрированнаяСтоимостьНормРесурсов(Ресурсы, НормыСтоимости);
	
	// Теперь заполним данные строки табличной части.
	Если ДанныеНормСтоимостиРесурса.Количество() Тогда
		ЗаполнитьСтрокуПоОднойНормеСтоимости(СтрокаТабличнойЧасти, ДанныеНормСтоимостиРесурса, НужноПересчитатьПоКурсуВалюты,
			ОбновлятьКоличество);
	Иначе
		ЗаполнитьСтрокуПриОтсутствииДанныхПоНормамСтоимости(СтрокаТабличнойЧасти);
	КонецЕсли;

КонецПроцедуры

// Заполняет общую стоимость ресурса в заданной строке табличной части.
//
// Параметры:
//  СтрокаТабличнойЧасти – СтрокаТабличнойЧасти, собственно строка.
//
Процедура обРассчитатьОбщуюСтоимостьРесурса(СтрокаТабличнойЧасти, ЕстьКолонкаВнСтоимость = Ложь)
	
	Количество = СтрокаТабличнойЧасти.Количество;
	Стоимость  = СтрокаТабличнойЧасти.Стоимость;
	
	СтрокаТабличнойЧасти.ОбщСтоимость = Количество * Стоимость;
	
	Если ЕстьКолонкаВнСтоимость Тогда
			
		ВнешняяСтоимость  = СтрокаТабличнойЧасти.ВнешняяСтоимость;	
		СтрокаТабличнойЧасти.ОбщВнешняяСтоимость = Количество * ВнешняяСтоимость;
				
	КонецЕсли;
	
КонецПроцедуры

// Заполняет стоимость ресурса в заданной строке табличной части
// по формуле ОбщаяСтоимость/Количество.
//
// Параметры:
//  СтрокаТабличнойЧасти – СтрокаТабличнойЧасти, собственно строка.
//
Процедура обРассчитатьСтоимостьРесурса(СтрокаТабличнойЧасти)

	Количество = СтрокаТабличнойЧасти.Количество;
	Если Количество = 0 Тогда
		Количество = 1; 
	КонецЕсли;
	
	ОбщСтоимость  = СтрокаТабличнойЧасти.ОбщСтоимость;
	
	СтрокаТабличнойЧасти.Стоимость = ОбщСтоимость / Количество;
	
КонецПроцедуры

// Заполняет стоимость ресурса в заданной строке табличной части.
//
// Параметры:
//  СтрокаТабличнойЧасти – СтрокаТабличнойЧасти - собственно строка.
//  Объект               – ДокументОбъект - объект-владелец табличной части.
//
Процедура обЗаполнитьСтоимостьРесурса(СтрокаТабличнойЧасти, Объект)

	НужноПересчитатьПоКурсуВалюты = ?(ТипЗнч(Объект) = Тип("ДокументОбъект.упоПроектнаяЗадача"), Истина, Ложь);
	Если НужноПересчитатьПоКурсуВалюты Тогда
		ВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
		ПараметрыКурсаВалютыУправленческогоУчета = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУправленческогоУчета, ТекущаяДатаСеанса());
		МассивВалют = Новый Массив;
		МассивВалют.Добавить(СтрокаТабличнойЧасти.Валюта);
		ТаблицаКурсовВалют = ПолучитьТаблицуКурсовВалют(МассивВалют);
	КонецЕсли;
	
	Нормы   = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.НормаСтоимости);
	Ресурсы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТабличнойЧасти.Ресурс);
	Единица = СтрокаТабличнойЧасти.ЕдиницаНормирования;
	
	ДанныеНормСтоимостиРесурсов = ЗарегистрированнаяСтоимостьНормРесурсов(Ресурсы, Нормы);
	Если ДанныеНормСтоимостиРесурсов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНормСтоимостиРесурса = ДанныеНормСтоимостиРесурсов[0];
	
	СтруктураНормаСтоимости = Новый Структура;
	СтруктураНормаСтоимости.Вставить("ЕдиницаНормирования", ДанныеНормСтоимостиРесурса.ЕдиницаНормирования);
	СтруктураНормаСтоимости.Вставить("ЕдСтоимость", ДанныеНормСтоимостиРесурса.ЕдСтоимость); 
	
	СтруктураВалюты = Новый Структура;
	СтруктураВалюты.Вставить("ТаблицаКурсовВалют", ТаблицаКурсовВалют);
	СтруктураВалюты.Вставить("ПараметрыКурсаВалютыУправленческогоУчета", ПараметрыКурсаВалютыУправленческогоУчета);
	СтруктураВалюты.Вставить("НужноПересчитатьПоКурсуВалюты", НужноПересчитатьПоКурсуВалюты);
	
	ЗаполнитьСтоимостьРесурсаВСтрокеПоНорме(СтрокаТабличнойЧасти, СтруктураНормаСтоимости, СтруктураВалюты);
		
КонецПроцедуры

Процедура ЗаполнитьСтоимостьРесурсаВСтрокеПоНорме(СтрокаТабличнойЧасти, СтруктураНормаСтоимости, СтруктураВалюты)
	
	Если СтруктураНормаСтоимости = Неопределено Тогда // Для ресурса не указана норма стоимости.
		
		СтрокаТабличнойЧасти.Стоимость 		= 0;
		СтрокаТабличнойЧасти.ОбщСтоимость 	= 0;
		
	Иначе	
	
		ЕдВремени = СтруктураНормаСтоимости.ЕдиницаНормирования;
				
		Если СтруктураВалюты.НужноПересчитатьПоКурсуВалюты Тогда
			ПараметрыКурсаВалюты = Новый Структура;
			ПараметрыКурсаВалюты.Вставить("Валюта", СтрокаТабличнойЧасти.Валюта);
			НайденнаяСтрокаКурсВалюты = СтруктураВалюты.ТаблицаКурсовВалют.Найти(СтрокаТабличнойЧасти.Валюта, "Валюта");
			Если НайденнаяСтрокаКурсВалюты <> Неопределено Тогда				
				ПараметрыКурсаВалюты.Вставить("Курс", НайденнаяСтрокаКурсВалюты.Курс);
				ПараметрыКурсаВалюты.Вставить("Кратность", НайденнаяСтрокаКурсВалюты.Кратность);
			Иначе
				ПараметрыКурсаВалюты.Вставить("Курс", 0);
				ПараметрыКурсаВалюты.Вставить("Кратность", 0);
			КонецЕсли;	
			Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтруктураНормаСтоимости.ЕдСтоимость, 
				СтруктураВалюты.ПараметрыКурсаВалютыУправленческогоУчета, 
				ПараметрыКурсаВалюты);
		Иначе
			Стоимость = СтруктураНормаСтоимости.ЕдСтоимость;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Стоимость    = ПересчитатьСтоимостьПоКоэффициентуЕдиницыНормирования(
			СтрокаТабличнойЧасти.ЕдиницаНормирования, 
			ЕдВремени, 
			Стоимость);
		СтрокаТабличнойЧасти.ОбщСтоимость = Окр(СтрокаТабличнойЧасти.Количество, 2) * СтрокаТабличнойЧасти.Стоимость;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьТаблицуКурсовВалют(МассивВалют)

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Валюта,
	               |	КурсыВалютСрезПоследних.Курс,
	               |	КурсыВалютСрезПоследних.Кратность
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта В (&МассивВалют)) КАК КурсыВалютСрезПоследних";
				   
	Запрос.УстановитьПараметр("МассивВалют", МассивВалют);
	
	ТаблицаКурсовВалют = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаКурсовВалют;

КонецФункции

#КонецОбласти