////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для экспорта данных в Microsoft Project.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Осуществляет экспорт выбранного проекта в MS Project.
//
// Параметры:
//  Проект  - СправочникСсылка.Проекты - проект, экспорт которого
//            должен осуществиться в MS Project.
//
Процедура ЭкспортВMSProjectКлиент(Проект) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("Проект", Проект);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭкспортВMSProjectКлиентОсновная", ЭтотОбъект, Контекст);
	ОткрытьФорму("Обработка.упоВыборМетодаВыгрузкиВMSProject.Форма.ФормаУправляемая", Новый Структура("ЭкспортСтруктурыПроекта"), , , , , ОписаниеОповещения);
	
КонецПроцедуры

// Осуществляет экспорт выбранного проекта в MS Project.
//
// Параметры:
//  ПараметрыВыгрузки	 		- Структура: 
//		* ТипВыгрузки - Число - в качестве ресурсов выгрузить роли - 0;
//							    в качестве ресурсов выгрузить исполнителей (трудовые ресурсы) - 1;
//		* ВерсияMSP - Число - версия MS Project для выбора схемы выгрузки данных;
//		* ОткрытьВMSP - Булево - признак необходимости открытия файла в MS Project;
//		* РучныеСроки - Булево - признак установки ручных сроков.
//  ДополнительныеПараметры		- Структура:
//		* Проект - СправочникСсылка.Проекты - проект, экспорт которого должен осуществиться в MS Project.
//
Процедура ЭкспортВMSProjectКлиентОсновная(ПараметрыВыгрузки, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыВыгрузки = Неопределено Или ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("Проект", ДополнительныеПараметры.Проект);
	Ошибка = упоЭкспортMSProject.ПроверитьВыгрузку(ПараметрыВыгрузки);
	
	Если Ошибка Тогда 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыгрузкуПослеВопроса", ЭтотОбъект, ПараметрыВыгрузки);
		ТекстВопроса = НСтр("ru = 'Обнаружены конфликты. Продолжить выгрузку?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыгрузкаВMSProject(ПараметрыВыгрузки);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Продолжить выгрузку после вопроса
//
// Параметры:
//  Результат	 - КодВозвратаДиалога - ответ пользователя;
//  Параметры	 - Структура:
//		* ТипВыгрузки - Число - в качестве ресурсов выгрузить роли - 0;
//							    в качестве ресурсов выгрузить исполнителей (трудовые ресурсы) - 1;
//		* ВерсияMSP - Число - версия MS Project для выбора схемы выгрузки данных;
//		* ОткрытьВMSP - Булево - признак необходимости открытия файла в MS Project;
//		* РучныеСроки - Булево - признак установки ручных сроков;
//		* Проект - СправочникСсылка.Проекты - проект, экспорт которого должен осуществиться в MS Project.
//
Процедура ПродолжитьВыгрузкуПослеВопроса(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузкаВMSProject(Параметры);
	
КонецПроцедуры

// Процедура - Выгрузка ВMSProject
//
// Параметры:
//  Параметры	 - Структура:
//		* ТипВыгрузки - Число - в качестве ресурсов выгрузить роли - 0;
//							    в качестве ресурсов выгрузить исполнителей (трудовые ресурсы) - 1;
//		* УровеньПланированияТрудозатрат - ПеречислениеСсылка.упоУровеньПланирования, Неопределено - учитывается, если
//			параметр ТипВыгрузки 1 или 2;
//		* ВерсияMSP - Число - версия MS Project для выбора схемы выгрузки данных;
//		* ОткрытьВMSP - Булево - признак необходимости открытия файла в MS Project;
//		* РучныеСроки - Булево - признак установки ручных сроков;
//		* Проект - СправочникСсылка.Проекты - проект, экспорт которого должен осуществиться в MS Project.
//
Процедура ВыгрузкаВMSProject(Параметры) Экспорт
	
	АдресФайлаВыгрузкиВоВременномХранилище = упоЭкспортMSProject.ЭкспортВMSProject(Параметры.Проект, 
					Параметры.ТипВыгрузки, Параметры.УровеньПланированияТрудозатрат, Параметры.ВерсияMSP, Параметры.РучныеСроки);
	ОбработатьФайлНаКлиенте(АдресФайлаВыгрузкиВоВременномХранилище, Параметры.ОткрытьВMSP, Параметры.ВерсияMSP);
	
КонецПроцедуры	

// Создает COM-объект MS Project.
//
// Параметры:
//  ВерсияMSProject		- Число - В этом параметр возвращается версия MS Project.
//
// Возвращаемое значение:
//	COM-объект MS Project.
//
Функция ИнициализироватьMSProject(ВерсияMSProject) Экспорт
	
	MSProject = Неопределено;
	
	#Если ТонкийКлиент Или ТолстыйКлиент Тогда
	
	Попытка
		
		MSProject = Новый COMОбъект("MSProject.Application"); 
		ВерсияMSP = Лев(MSProject.Version,2);
		Попытка
			ВерсияMSProject = Число(ВерсияMSP);
		Исключение
			ВерсияMSProject = 0;
		КонецПопытки;
		
	Исключение
		
		МассивТекста = Новый Массив;
		МассивТекста.Добавить(НСтр("ru = 'Ошибка при создании объекта MS Project.'"));
		МассивТекста.Добавить(ОписаниеОшибки());
		ТекстЖурнала = СтрСоединить(МассивТекста, Символы.ПС);
		
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
			НСтр("ru = 'Экспорт в MS Project'"), 
			"Ошибка",
			ТекстЖурнала,, Истина);
		
		ТекстСообщения = НСтр("ru = 'Ошибка открытия MS Project. Убедитесь, что приложение установлено. 
			|Подробнее см. журнал регистрации.'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		MSProject = Неопределено;
		
	КонецПопытки;
	
	#КонецЕсли
	
	Возврат MSProject;
	
КонецФункции

// Обрабатывает файл выгрузки на клиенте и пытается открыть его в MS Project.
//
// Параметры:
//  АдресФайлаВыгрузкиВоВременномХранилище  - Строка - адрес файла выгрузки во временном хранилище.
//  ОткрытьВMSP 							- Булево - признак необходимости открытия файла в MS Project.
//	ВерсияMSProject							- Число - Номер используемой версии MS Project.
//
Процедура ОбработатьФайлНаКлиенте(АдресФайлаВыгрузкиВоВременномХранилище, ОткрытьВMSP = Ложь, ВерсияMSProject = 15) Экспорт
	
	Если ПустаяСтрока(АдресФайлаВыгрузкиВоВременномХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = ПолучитьИзВременногоХранилища(АдресФайлаВыгрузкиВоВременномХранилище);
	Если Не ЗначениеЗаполнено(Файл) Тогда
		ПоказатьПредупреждение( , НСтр("ru ='Не удалось сформировать файл для выгрузки. Повторите попытку.'", "ru"));
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("АдресФайлаВыгрузкиВоВременномХранилище", АдресФайлаВыгрузкиВоВременномХранилище);
	
	Если ОткрытьВMSP Тогда
		MSProject = ИнициализироватьMSProject(ВерсияMSProject);
		Если MSProject = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			ТекстДляПользователя = НСтр("ru ='Не удалось запустить MS Project. Структура проекта доступна только для сохранения (выгрузки в файл).'");
			Сообщение.Текст = ТекстДляПользователя;
			Сообщение.Сообщить();
			Контекст.Вставить("ДопИнформация", ТекстДляПользователя);
			ОткрытьВMSP = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыСохранения = Новый Структура("АдресФайлаВыгрузкиВоВременномХранилище, ОткрытьВMSP, MSProject,
			| ВерсияMSProject", АдресФайлаВыгрузкиВоВременномХранилище, ОткрытьВMSP, MSProject, ВерсияMSProject);
	
	#Если ВебКлиент Тогда
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьПодключениеРасширенияРаботыСФайлами", ЭтотОбъект, ПараметрыСохранения);
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
	#Иначе
	Если ОткрытьВMSP Тогда
		ИмяТемпФайла = ПолучитьИмяВременногоФайла("xml");
		СохранитьФайлНаКлиентССервера(ИмяТемпФайла, ПараметрыСохранения);
	Иначе
		ВызватьДиалогВыбораФайла(ПараметрыСохранения);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры
// Обработчик завершения процедуры "Обработать файл на клиенте".
//
// Параметры:
//  Результат				 - КодВозвратаДиалога	 - не используется.
//  ДополнительныеПараметры	 - Структура			 - параметры.
//
Процедура ОбработатьФайлНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	УдалятьФайлНаКлиенте = Ложь;
	ОткрытьВMSP = ДополнительныеПараметры.ОткрытьВMSP;
	ПутьКФайлу = ДополнительныеПараметры.ПутьКФайлу;

	Если ОткрытьВMSP Тогда
		
		Файл = Новый Файл(ПутьКФайлу);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОпределенияСуществованияФайла", ЭтотОбъект, ДополнительныеПараметры);
		Файл.НачатьПроверкуСуществования(ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает COMОбъект Microsoft Project.
//
// Параметры:
//  ИмяФайлаXML	 - Строка	 - имя файла.
//  Режим		 - Строка	 - режим.
//  MSProject 								- COM-объект MS Project.
//	ВерсияMSProject							- Число - Номер используемой версии MS Project.
//
Процедура ОбработатьCOMОбъектMSProject(ИмяФайлаXML, Режим = "ВыгрузитьMSP", MSProject=Неопределено, Знач ВерсияMSProject=0) Экспорт
	
	Если MSProject = Неопределено Тогда
		MSProject = ИнициализироватьMSProject(ВерсияMSProject);
	КонецЕсли;
	
	Если MSProject = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Если ВерсияMSProject = 0 Тогда
			ВерсияMSP = Лев(MSProject.Version,2);
			Попытка
				ВерсияMSProject = Число(ВерсияMSP);
			Исключение
				ВерсияMSProject = 0;
			КонецПопытки;
		КонецЕсли;
		
		Если ВерсияMSProject >= 15 Тогда
			// В 2013 Project-е не отображаются связи между задачами.
			// Рабочая конструкция.
			// MSProject.FileOpen(ИмяФайлаXML, , 3); // К новому присоединяем наш, с данными: 3 - append, 1 - merge.
			// MSProject.SelectSheet();
			// MSProject.EditDelete();
			// MSProject.FileOpen(ИмяФайлаXML, , 3); // К новому присоединяем наш, с данными: 3 - append, 1 - merge.
			MSProject.WindowState = 3;
			MSProject.AppMaximize();
			MSProject.FileOpen(ИмяФайлаXML, , );
		Иначе
			MSProject.FileNew(False);
			MSProject.FileOpen(ИмяФайлаXML, , 1);
		КонецЕсли;	
		
		MSProject.ZoomTimescale( , Истина, ); // Масштабируем диаграмму Ганта: Весь проект.
			
		Если Режим = "ПредварительныйПросмотрMSP" Тогда
			MSProject.FilePrintPreview(); // Устанавливаем предпросмотр.
		КонецЕсли;
		
		// Добавим вывод Заметок справа от отрезка (для настроек по умолчанию).
		Попытка
			MSProject.GanttBarStyleEdit(1, , , , , , , , , , , , , , , , , , , "Заметки", ); // Обычный отрезок.
			MSProject.GanttBarStyleEdit(4, , , , , , , , , , , , , , , , , , , "Заметки", ); // Веха.
			MSProject.GanttBarStyleEdit(7, , , , , , , , , , , , , , , , , , , "Заметки", ); // Сводный отрезок.
			MSProject.GanttBarStyleEdit(10, , , , , , , , , , , , , , , , , , , "Заметки", ); // Сводная веха.
		Исключение
			
			MSProject.GanttBarStyleEdit(1); // Обычный отрезок.
			MSProject.GanttBarStyleEdit(4); // Веха.
			MSProject.GanttBarStyleEdit(7); // Сводный отрезок.
			MSProject.GanttBarStyleEdit(10); // Сводная веха. 
		КонецПопытки;
		
		
		// Добавим в таблицу колонку СДР для наглядности.
		// expression.TableEdit(Name, TaskTable, Create, OverwriteExisting, NewName, FieldName, NewFieldName, Title,
		// Width, Align, ShowInMenu, LockFirstColumn, DateFormat, RowHeight, ColumnPosition, AlignTitle,
		// HeaderAutoRowHeightAdjustment, HeaderTextWrap).
		Попытка
			MSProject.TableEdit("Ввод", True, , , "", "", "СДР", "СДР", 10, 2, True, True, 255, 1, 1, 1, , );
			MSProject.TableApply("Ввод");
		Исключение
			Попытка
				MSProject.TableEdit("Запись", True, , , "", "", "СДР", "СДР", 10, 2, True, True, 255, 1, 1, 1, , );
				MSProject.TableApply("Запись");	
			Исключение
			КонецПопытки;
		КонецПопытки;	
		
		// Активируем окно Project.
		MSProject.AppMaximize(); 
		MSProject.WindowState = 3;
		
		MSProject.Caption = "Диаграмма Ганта";
		
	Исключение
		
		НСтрока = НСтр("ru = '///////////////////////////////////////////////////////////////
		|Ошибка при открытии MS Project. Возможно, нужно закрыть существующие окна MS Project
		|%1
		|///////////////////////////////////////////////////////////////'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ОписаниеОшибки());
		Сообщение.Сообщить();
		
		MSProject = Неопределено;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьПодключениеРасширенияРаботыСФайлами(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		ВызватьДиалогВыбораФайла(ДополнительныеПараметры);
	Иначе
		НачатьУстановкуРасширенияРаботыСФайлами();
		
		ТекстСообщения = НСтр("ru = 'Повторите экспорт данных после установки расширения работы с файлами.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьФайлНаКлиентССервера(МассивПутей, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(МассивПутей) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(МассивПутей) = Тип("Массив") Тогда
		ПутьКФайлу = МассивПутей[0];
	Иначе
		ПутьКФайлу = МассивПутей;
	КонецЕсли;
	
	АдресФайлаВыгрузкиВоВременномХранилище = ДополнительныеПараметры.АдресФайлаВыгрузкиВоВременномХранилище;
	
	ДополнительныеПараметры.Вставить("ПутьКФайлу", ПутьКФайлу);
	ОбработкаПослеСохраненияФайла = Новый ОписаниеОповещения("ОбработатьФайлНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	НачатьПолучениеФайлаССервера(ОбработкаПослеСохраненияФайла, АдресФайлаВыгрузкиВоВременномХранилище, ПутьКФайлу);
	
КонецПроцедуры

Процедура ПослеОпределенияСуществованияФайла(Существует, ДополнительныеПараметры) Экспорт
	
	MSProject = ДополнительныеПараметры.MSProject;
	ВерсияMSProject = ДополнительныеПараметры.ВерсияMSProject;
	ПутьКФайлу = ДополнительныеПараметры.ПутьКФайлу;

	Если Существует Тогда
		ОбработатьCOMОбъектMSProject(ПутьКФайлу, , MSProject, ВерсияMSProject);
	Иначе
		ПоказатьПредупреждение( , НСтр("ru ='Не обнаружен файл для экспорта в MS Project.'", "ru"));
	КонецЕсли;

	// Уберем мусор после себя.
	Если ЭтоАдресВременногоХранилища(ДополнительныеПараметры.АдресФайлаВыгрузкиВоВременномХранилище) Тогда
		УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресФайлаВыгрузкиВоВременномХранилище);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПутьКФайлу) Тогда
		НачатьУдалениеФайлов(Новый ОписаниеОповещения, ПутьКФайлу);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ВызватьДиалогВыбораФайла(ПараметрыСохранения)
	
	СохранениеФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	СохранениеФайла.ПолноеИмяФайла = "1CToMSProjectExp_" + Строка(Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=yyyyMMddHHmmss")) + ".xml";
	СохранениеФайла.Фильтр = "XML документ (*.xml)|*.xml";
	СохранениеФайла.Заголовок = НСтр("ru ='Выберите каталог сохранения файла экспорта.'");
	
	СохранениеФайла.Показать(Новый ОписаниеОповещения("СохранитьФайлНаКлиентССервера", ЭтотОбъект, ПараметрыСохранения));
	
КонецПроцедуры

#КонецОбласти 

