////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции проверочных механизмов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет поиск проблемных объектов ИБ в соответствии с заданными
//  параметрами.
//
// Параметры:
//  Параметры	 - Структура	 - параметры поиска.
//  Результаты	 - ТаблицаЗначений	 - результаты поиска.
// 
// Возвращаемое значение:
//  Булево - Флаг ненулевого количества найденных объектов.
//
Функция обВыполнитьПоискПроблемныхОбъектов(Параметры, Результаты) Экспорт
	
	Результаты.Очистить();
	
	// Поиск пользователей, которым не назначены сотрудники.
	
	Если Параметры.НайтиПользователейБезСотрудника Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Диспетчеры.Пользователь КАК Пользователь
		               |ПОМЕСТИТЬ втПользователиСДиспетчерами
		               |ИЗ
		               |	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних КАК Диспетчеры
		               |ГДЕ
		               |	Диспетчеры.ФлагУправления
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Пользователи.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Пользователи КАК Пользователи
		               |		ЛЕВОЕ СОЕДИНЕНИЕ втПользователиСДиспетчерами КАК втПользователиСДиспетчерами
		               |		ПО Пользователи.Ссылка = втПользователиСДиспетчерами.Пользователь
		               |ГДЕ
		               |	втПользователиСДиспетчерами.Пользователь ЕСТЬ NULL";
		
		Если Параметры.ИгнорироватьПомеченныеНаУдаление Тогда
			ТекстЗапроса = ТекстЗапроса + " И НЕ Пользователи.ПометкаУдаления";
		КонецЕсли; 
		
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса);
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Результаты.Добавить();
				НоваяСтрока.ОбъектИБ = Выборка.Ссылка;
				НоваяСтрока.ОбъектОбработан = Ложь;
				НоваяСтрока.ВидОбъекта = "Пользователь системы";
				НоваяСтрока.ВидПроблемы = Перечисления.упоВидПроблемногоОбъекта.ПользовательБезСотрудника;
			КонецЦикла
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// Поиск сотрудников, которым не был назначен диспетчер.
	
	Если Параметры.НайтиСотрудниковБезДиспетчера Тогда
		
		СписокАктивныхСотрудников = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВладениеРесурсамиСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.упоВладениеРесурсами.СрезПоследних КАК ВладениеРесурсамиСрезПоследних
		|ГДЕ
		|	ВладениеРесурсамиСрезПоследних.ВладеетРесурсом
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РуководителиПодразделенийСрезПоследних.Руководитель
		|ИЗ
		|	РегистрСведений.упоРуководителиПодразделений.СрезПоследних КАК РуководителиПодразделенийСрезПоследних
		|ГДЕ
		|	РуководителиПодразделенийСрезПоследних.Руководитель <> &ПустойСотрудник
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РуководителиПроектныхЗадачСрезПоследних.РуководительПроектнойЗадачи
		|ИЗ
		|	РегистрСведений.упоРуководителиПроектныхЗадач.СрезПоследних КАК РуководителиПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|				И (упоВерсииПроекта.Текущая)
		|				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		|		ПО РуководителиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|ГДЕ
		|	РуководителиПроектныхЗадачСрезПоследних.РуководительПроектнойЗадачи <> &ПустойСотрудник
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РуководителиПроектовСрезПоследних.РуководительПроекта
		|ИЗ
		|	РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РуководителиПроектовСрезПоследних
		|ГДЕ
		|	РуководителиПроектовСрезПоследних.РуководительПроекта <> &ПустойСотрудник";
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Диспетчеры.Сотрудник КАК Сотрудник
		               |ПОМЕСТИТЬ втСотрудникиСДиспетчерами
		               |ИЗ
		               |	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних КАК Диспетчеры
		               |ГДЕ
		               |	Диспетчеры.ФлагУправления
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |		ЛЕВОЕ СОЕДИНЕНИЕ втСотрудникиСДиспетчерами КАК втСотрудникиСДиспетчерами
		               |		ПО Сотрудники.Ссылка = втСотрудникиСДиспетчерами.Сотрудник
		               |ГДЕ
		               |	втСотрудникиСДиспетчерами.Сотрудник ЕСТЬ NULL";
		
		Если Параметры.ИскатьДействующихСотрудников Тогда      
			ТекстЗапроса = ТекстЗапроса + " И Сотрудники.Ссылка В (" + СписокАктивныхСотрудников + ")";
		КонецЕсли; 
		
		Если Параметры.ИгнорироватьПомеченныеНаУдаление Тогда      
			ТекстЗапроса = ТекстЗапроса + " И НЕ Сотрудники.ПометкаУдаления";
		КонецЕсли; 
		
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, 
			Новый Структура("ПустойСотрудник", Справочники.упоСотрудники.ПустаяСсылка()));
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Результаты.Добавить();
				НоваяСтрока.ОбъектИБ = Выборка.Ссылка;
				НоваяСтрока.ОбъектОбработан = Ложь;
				НоваяСтрока.ВидОбъекта = "Сотрудник предприятия";
				НоваяСтрока.ВидПроблемы = Перечисления.упоВидПроблемногоОбъекта.СотрудникБезДиспетчера;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// Поиск подразделений, которым не назначены руководители
	// несколько более сложный поиск, т.к. нужно учесть иерархию.
	
	Если Параметры.НайтиПодразделенияБезРуководителя Тогда
		
		// Если иерархия не учитывается, поиск производится простым запросом.
		
		Если НЕ Параметры.ИскатьПоИерархииПодразделений Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			               |	РуководителиПодразделенийСрезПоследних.Подразделение КАК Подразделение
			               |ПОМЕСТИТЬ втРуководителиПодразделений
			               |ИЗ
			               |	РегистрСведений.упоРуководителиПодразделений.СрезПоследних КАК РуководителиПодразделенийСрезПоследних
			               |ГДЕ
			               |	НЕ РуководителиПодразделенийСрезПоследних.Руководитель = ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	Подразделения.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.упоПодразделения КАК Подразделения
			               |		ЛЕВОЕ СОЕДИНЕНИЕ втРуководителиПодразделений КАК втРуководителиПодразделений
			               |		ПО Подразделения.Ссылка = втРуководителиПодразделений.Подразделение
			               |ГДЕ
			               |	втРуководителиПодразделений.Подразделение ЕСТЬ NULL";
			
			Если Параметры.ИгнорироватьПомеченныеНаУдаление Тогда
				ТекстЗапроса = ТекстЗапроса + " И Подразделения.ПометкаУдаления = ЛОЖЬ";
			КонецЕсли; 
			
			РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса);
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					НоваяСтрока = Результаты.Добавить();
					НоваяСтрока.ОбъектИБ = Выборка.Ссылка;
					НоваяСтрока.ОбъектОбработан = Ложь;
					НоваяСтрока.ВидОбъекта = "Подразделение предприятия";
					НоваяСтрока.ВидПроблемы = Перечисления.упоВидПроблемногоОбъекта.ПодразделениеБезРуководителя;
				КонецЦикла; 
				
			КонецЕсли;
		Иначе
			
			// В противном случае запрос строить не нужно, а нужно воспользоваться функцией,
			// которая строит список функциональных руководителей по иерархии подразделений
			// результат запроса выполняет роль исходных данных для функции.
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Подразделения.Ссылка
			|ИЗ
			|	Справочник.упоПодразделения КАК Подразделения";
			
			Если Параметры.ИгнорироватьПомеченныеНаУдаление Тогда      
				ТекстЗапроса = ТекстЗапроса + " ГДЕ Подразделения.ПометкаУдаления = ЛОЖЬ";
			КонецЕсли; 
			
			РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса);
			СписокПодразделений = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			СписокРуководителей = упоИерархияИПолномочияВызовСервера.обПолучитьРуководителяПодразделенияПоИерархии(СписокПодразделений);
			
			Для каждого СтрокаСписка Из СписокРуководителей Цикл
				Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаСписка.Руководитель) Тогда
					НоваяСтрока = Результаты.Добавить();
					НоваяСтрока.ОбъектИБ = СтрокаСписка.Подразделение;
					НоваяСтрока.ОбъектОбработан = Ложь;
					НоваяСтрока.ВидОбъекта = "Подразделение предприятия";
					НоваяСтрока.ВидПроблемы = Перечисления.упоВидПроблемногоОбъекта.ПодразделениеБезРуководителя;
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли; 
	КонецЕсли; 
	
	// Поиск трудовых ресурсов, которым не был назначен владелец.
	
	Если Параметры.НайтиТрудовыеРесурсыБезВладельца Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫРАЗИТЬ(ВладениеРесурсамиСрезПоследних.Ресурс КАК Справочник.упоТрудовыеРесурсы) КАК Ресурс
		               |ПОМЕСТИТЬ втВладениеРесурсами
		               |ИЗ
		               |	РегистрСведений.упоВладениеРесурсами.СрезПоследних КАК ВладениеРесурсамиСрезПоследних
		               |ГДЕ
		               |	ВладениеРесурсамиСрезПоследних.ВладеетРесурсом
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		               |	ТрудовыеРесурсы.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.упоТрудовыеРесурсы КАК ТрудовыеРесурсы
		               |		ЛЕВОЕ СОЕДИНЕНИЕ втВладениеРесурсами КАК втВладениеРесурсами
		               |		ПО ТрудовыеРесурсы.Ссылка = втВладениеРесурсами.Ресурс
		               |ГДЕ
		               |	втВладениеРесурсами.Ресурс ЕСТЬ NULL";
		
		Если Параметры.ИгнорироватьПомеченныеНаУдаление Тогда
			ТекстЗапроса = ТекстЗапроса + " И ТрудовыеРесурсы.ПометкаУдаления = ЛОЖЬ";
		КонецЕсли; 
		
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса);
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Результаты.Добавить();
				НоваяСтрока.ОбъектИБ = Выборка.Ссылка;
				НоваяСтрока.ОбъектОбработан = Ложь;
				НоваяСтрока.ВидОбъекта = "Трудовой ресурс";
				НоваяСтрока.ВидПроблемы = Перечисления.упоВидПроблемногоОбъекта.ТрудовойРесурсБезВладельца;
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// Поиск ролей, не входящих в подразделение.
	
	Если Параметры.НайтиРолиБезПодразделения Тогда
		
		ТекстЗапроса = ?(Параметры.ИскатьДействующиеРоли,
		"ВЫБРАТЬ
		|	упоСтатусыПроектовСрезПоследних.Проект КАК Проект
		|ПОМЕСТИТЬ втДействующиеПроекты
		|ИЗ
		|	РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК упоСтатусыПроектовСрезПоследних
		|ГДЕ
		|	упоСтатусыПроектовСрезПоследних.СтатусПроекта <> &ПроектЗакрыт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Ресурс
		|ПОМЕСТИТЬ втДействующиеРоли
		|ИЗ
		|	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		|			,
		|			ПроектнаяЗадача.Проект В
		|				(ВЫБРАТЬ
		|					втДействующиеПроекты.Проект
		|				ИЗ
		|					втДействующиеПроекты КАК втДействующиеПроекты)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		|ГДЕ
		|	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
		|			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0
		|			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость <> 0)" + ";"
		, "");
		
		ТекстЗапроса = ТекстЗапроса + "
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СоставПодразделенийСрезПоследних.Роль
		               |ПОМЕСТИТЬ втРолиВПодразделениях
		               |ИЗ
		               |	РегистрСведений.упоСоставПодразделений.СрезПоследних КАК СоставПодразделенийСрезПоследних
		               |ГДЕ
		               |	СоставПодразделенийСрезПоследних.ВходитВСостав
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоРоли.Ссылка
		               |ИЗ
		               |	Справочник.упоРоли КАК упоРоли
		               |ГДЕ
		               |	НЕ упоРоли.Ссылка В
		               |				(ВЫБРАТЬ
		               |					втРолиВПодразделениях.Роль
		               |				ИЗ
		               |					втРолиВПодразделениях КАК втРолиВПодразделениях)";
		
		ТекстЗапроса = ТекстЗапроса + ?(Параметры.ИскатьДействующиеРоли, "
					   |	И упоРоли.Ссылка В
		               |			(ВЫБРАТЬ
		               |				втДействующиеРоли.Ресурс
		               |			ИЗ
		               |				втДействующиеРоли КАК втДействующиеРоли)", "");
   
		ТекстЗапроса = ТекстЗапроса + ?(Параметры.ИгнорироватьПомеченныеНаУдаление, "
					   |	И НЕ упоРоли.ПометкаУдаления", "");
		
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, 
			Новый Структура("ПроектЗакрыт", Перечисления.упоСостояниеСтатусаПроекта.Завершен));
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Результаты.Добавить();
				НоваяСтрока.ОбъектИБ = Выборка.Ссылка;
				НоваяСтрока.ОбъектОбработан = Ложь;
				НоваяСтрока.ВидОбъекта = "Роль трудового ресурса";
				НоваяСтрока.ВидПроблемы = Перечисления.упоВидПроблемногоОбъекта.РольБезПодразделения;
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Не (Результаты.Количество() = 0);
	
КонецФункции
 
#КонецОбласти