
&ИзменениеИКонтроль("ПередЗаписью")
Процедура ИКТ_ПередЗаписью(Отказ)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	#Удаление
	Если Значение <> ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Константа «%1» - системная, ее переключение недоступно.';
				|en = 'Constant ""%1"" is internal and not switchable.'"),
			Метаданные.Константы.ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы.Синоним);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	#КонецУдаления
	#Вставка
	//{ ИКТ (02.07.2025) 
	//	Примечание: включим подсистему корпоративные подсистемы 
	//} ИКТ
	#КонецВставки

КонецПроцедуры