
//1.Замещение: 

//{
//"ExchangeSysName": "Request",
//"ExchangeRoute": "Substitution",
//"Key": "12345",
//"PERNR": "50133367",
//"PERNR_zam": "50153076",
//"Date_in": "20250601",
//"Date_out": "20250615"
//} 

//Key           - ID Процесса Request 
//PERNR         - ID Физического лица Замещаемого 
//PERNR_zam     - ID Физического лица Заместителя
//Date_in       - дата начала замещения
//Date_out      - дата окончания замещения
//ExchangeRoute - имя маршрута "Substitution" - замещение    

//------------------------------------------------------------------

//2.Увольнение:  

//{
//"ExchangeSysName": "Request",
//"ExchangeRoute": "Dismissal",
//"Key": "1",
//"PERNR": "50153076",
//"OperationStatus": "2",
//"REASON_NAME": "Неисполнение должностных обязанностей", 
//"REASON_CODE": "3"
//}

//PERNR - ID Физического лица
//Key - ID Процесса Request
//OperationStatus - Статус операции
//REASON_NAME - Наименование причины увольнения
//REASON_CODE - Код причины увольнения
//ExchangeRoute - имя маршрута "Dismissal" – увольнение   

//------------------------------------------------------------------
Функция DataExchangePOST(Запрос)  
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();  
	
	Отказ = Ложь;  
	
	МассивОшибок = Новый Массив;
	
	Результат = ОбработатьТелоЗапроса(ТелоЗапроса, Отказ, МассивОшибок);
	
	Возврат ПодготовитьОтветСервиса(Отказ, Результат, МассивОшибок);
	
КонецФункции   

Функция ПодготовитьОтветСервиса(Отказ, Результат, МассивОшибок)
	
	КодСостояния = 200;
	
	Если Отказ = Истина Тогда
		КодСостояния = 400;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Errors", МассивОшибок);
	СтруктураОтвета.Вставить("Result", Результат);
		
	Ответ = Новый HTTPСервисОтвет(КодСостояния); 
	Ответ.УстановитьТелоИзСтроки(ИКТ_RequestСерверСлужебный.СформироватьТекстJSON(СтруктураОтвета));
	
	Возврат Ответ;
	
КонецФункции

Функция ОбработатьТелоЗапроса(ТелоЗапроса, Отказ, МассивОшибок)   
	
	ДанныеЗапроса = ПрочитатьТекстJSON(, ТелоЗапроса);
	
	Если ДанныеЗапроса = Неопределено Тогда
		
		МассивОшибок.Добавить("Empty request body");
		Отказ = Истина;
		Возврат Неопределено;
		
	КонецЕсли; 
	
	КлючиСоответствияВВерхнийРегистрРекурсивно(ДанныеЗапроса);
	
	Если ДанныеЗапроса["VARIABLES"] <> Неопределено Тогда
		ВынестиПеременныеВОсновноеСоответствие(ДанныеЗапроса);
	КонецЕсли;
	
	Если ВРег(ДанныеЗапроса.Получить(ВРег("ExchangeRoute"))) = ВРег("Dismissal") Тогда
		
		Возврат ОбработатьУвольнениеСотрудника(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса);
		
	ИначеЕсли ВРег(ДанныеЗапроса.Получить(ВРег("ExchangeRoute"))) = ВРег("Substitution") Тогда
		
		НекорректнаяСтруктураТелаЗапроса = Ложь;
		
		Если ДанныеЗапроса.Получить("VARIABLES_PERNR") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
            МассивОшибок.Добавить("PERNR not found");
		КонецЕсли;
		
		Если ДанныеЗапроса.Получить("VARIABLES_PERNR_ZAM") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
            МассивОшибок.Добавить("PERNR_zam not found");
		КонецЕсли;
		
		Если ДанныеЗапроса.Получить("VARIABLES_DATE_IN") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
            МассивОшибок.Добавить("Date_in not found");
		КонецЕсли;
		
		Если ДанныеЗапроса.Получить("VARIABLES_DATE_OUT") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
            МассивОшибок.Добавить("Date_out not found");
		КонецЕсли;   		
		
		Если НекорректнаяСтруктураТелаЗапроса Тогда			
			Отказ = Истина;
			Возврат Неопределено;	
		КонецЕсли;		
		
		Возврат ОбработатьЗамещениеСотрудника(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса);
	ИначеЕсли ВРег(ДанныеЗапроса.Получить(ВРег("ExchangeRoute"))) = ВРег("AgreementApproval") Тогда
		
 		НекорректнаяСтруктураТелаЗапроса = Ложь;
		
		Если ДанныеЗапроса.Получить("KEY") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
		    МассивОшибок.Добавить("Key not found");
		КонецЕсли;
		   
		Если ДанныеЗапроса.Получить("STATUS") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
		    МассивОшибок.Добавить("Status not found");
		КонецЕсли;
		
		Если ДанныеЗапроса.Получить("VARIABLES_REQUESTID") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
		    МассивОшибок.Добавить("VARIABLES_RequestId not found");
		КонецЕсли;
		
		Если ДанныеЗапроса.Получить("VARIABLES_STATUS") = Неопределено Тогда			
			НекорректнаяСтруктураТелаЗапроса = Истина;
		    МассивОшибок.Добавить("VARIABLES_Status not found");
		КонецЕсли;
		
		Если НекорректнаяСтруктураТелаЗапроса Тогда			
			Отказ = Истина;
			Возврат Неопределено;	
		КонецЕсли;		
		
		Возврат ОбработатьСтатусДоговора(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса);
	ИначеЕсли ВРег(ДанныеЗапроса.Получить(ВРег("ExchangeRoute"))) = ВРег("ИКТ_128") Тогда   
		Возврат ОбработатьРешениеПоРаботеНеПоГрафику(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса);
	ИначеЕсли ВРег(ДанныеЗапроса.Получить(ВРег("ExchangeRoute"))) = ВРег("ИКТ_176") Тогда //Ответ ДБ при сбое СКУД 
		Возврат ОбработатьТехСбойСКУД(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса);
	Иначе 		
	
		МассивОшибок.Добавить("The exchange route is not set");
		Отказ = Истина;
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции   

Функция ПрочитатьТекстJSON(ИмяФайла = "", ТекстЗапроса = "") Экспорт
	
	Попытка 
		
		ЧтениеJSON = Новый ЧтениеJSON; 
		
		Если ЗначениеЗаполнено(ИмяФайла) Тогда
			ЧтениеJSON.ОткрытьФайл(ИмяФайла);
		ИначеЕсли ЗначениеЗаполнено(ТекстЗапроса) Тогда 
											
			ЧтениеJSON.УстановитьСтроку(ТекстЗапроса);
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
			
		//ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Истина); 
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Истина,,ФорматДатыJSON.Microsoft);
		
		ЧтениеJSON.Закрыть();
		
		Возврат ДанныеЗапроса;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ОбменДаннымиRequest", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки() + Символы.ПС + ?(ЗначениеЗаполнено(ТекстЗапроса), ТекстЗапроса, ИмяФайла)); 
		
	КонецПопытки;
	
КонецФункции

Процедура КлючиСоответствияВВерхнийРегистрРекурсивно(ДанныеЗапроса)
	
	Для каждого стр из ДанныеЗапроса Цикл  
		
		Если ТипЗнч(Стр.Значение) = Тип("Массив") Тогда
			
			МассивЗначений = стр.Значение; 
			
			Для каждого ВложенноеСоответствие из МассивЗначений Цикл
				КлючиСоответствияВВерхнийРегистрРекурсивно(ВложенноеСоответствие);
			КонецЦикла;
			
			ДанныеЗапроса.Вставить(Врег(Стр.Ключ), МассивЗначений);
			ДанныеЗапроса.Удалить(Стр.Ключ);
			
		Иначе   
			
			Если Стр.Ключ = Врег(Стр.Ключ) Тогда
				Продолжить; //Ключ уже в верхнем регистре. Пропускаем
			КонецЕсли;
			
			ДанныеЗапроса.Вставить(Врег(Стр.Ключ), стр.Значение);
			ДанныеЗапроса.Удалить(Стр.Ключ);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВынестиПеременныеВОсновноеСоответствие(ДанныеЗапроса)
	
	Для каждого ДанныеПеременной из ДанныеЗапроса["VARIABLES"] Цикл
		
		ДанныеЗапроса.Вставить(СтрШаблон("VARIABLES_%1",ВРег(ДанныеПеременной["NAME"])), ДанныеПеременной["VALUE"]);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьЗамещениеСотрудника(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса) 
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Структура("Body", ТелоЗапроса));
	
	Попытка 	
		
		Замещаемый_ID                = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_PERNR"));
		Заместитель_ID               = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_PERNR_ZAM"));
		ДатаНачалаЗамещения_Текст    = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_DATE_IN"));
		ДатаОкончанияЗамещения_Текст = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_DATE_OUT"));	
						
		Если НЕ ЗначениеЗаполнено(Замещаемый_ID) Тогда 
			МассивОшибок.Добавить("Substitution error. PERNR empty.");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Заместитель_ID) Тогда 
			МассивОшибок.Добавить("Substitution error. PERNR_zam empty.");
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ДатаНачалаЗамещения_Текст) Тогда 
			МассивОшибок.Добавить("Substitution error. Date_in empty.");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДатаОкончанияЗамещения_Текст) Тогда 
			МассивОшибок.Добавить("Substitution error. Date_out empty.");
		КонецЕсли;
		
		Если МассивОшибок.Количество() = 0 Тогда 
			
			Замещаемый_ФизЛицо          = Справочники.ФизическиеЛица.НайтиПоРеквизиту("ИКТ_ТабельныйНомер",Замещаемый_ID);						
			Заместитель_ФизЛицо         = Справочники.ФизическиеЛица.НайтиПоРеквизиту("ИКТ_ТабельныйНомер",Заместитель_ID);
						
			Если Замещаемый_ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда 
				МассивОшибок.Добавить("Substitution error. The PERNR employee 1C was not found.");
			КонецЕсли;  
			
			Если Заместитель_ФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда 
				МассивОшибок.Добавить("Substitution error. The PERNR_zam employee 1C was not found.");
			КонецЕсли;	
			
		Иначе
			
			Возврат Результат;
			
		КонецЕсли;   		
		
		Если МассивОшибок.Количество() = 0 Тогда 
			
			Замещаемый_Пользователь  = Справочники.Пользователи.НайтиПоРеквизиту("ФизическоеЛицо",Замещаемый_ФизЛицо);
			Заместитель_Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизическоеЛицо",Заместитель_ФизЛицо);
			
			Если Замещаемый_Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда 
				МассивОшибок.Добавить("Substitution error. The PERNR user 1C was not found.");
			КонецЕсли;  
			
			Если Заместитель_Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда 
				МассивОшибок.Добавить("Substitution error. The PERNR_zam user 1C was not found.");
			КонецЕсли;	
			
		Иначе
			
			Возврат Результат;
			
		КонецЕсли;  		
		
		Если МассивОшибок.Количество() = 0 Тогда 
			
			Попытка
				ДатаНачалаЗамещения_Дата = Дата(Прав(ДатаНачалаЗамещения_Текст,4),Сред(ДатаНачалаЗамещения_Текст,4,2),Лев(ДатаНачалаЗамещения_Текст,2),00,00,00);
			Исключение
				Попытка
					ДатаНачалаЗамещения_Дата = Дата(Лев(ДатаНачалаЗамещения_Текст,4),Сред(ДатаНачалаЗамещения_Текст,5,2),Прав(ДатаНачалаЗамещения_Текст,2),00,00,00);
				Исключение
					МассивОшибок.Добавить("Substitution error. Date_in incorrect date format.");
				КонецПопытки;
			КонецПопытки;
			
			Попытка
				ДатаОкончанияЗамещения_Дата = Дата(Прав(ДатаОкончанияЗамещения_Текст,4),Сред(ДатаОкончанияЗамещения_Текст,4,2),Лев(ДатаОкончанияЗамещения_Текст,2),23,59,59);
			Исключение
				Попытка
					ДатаОкончанияЗамещения_Дата = Дата(Лев(ДатаОкончанияЗамещения_Текст,4),Сред(ДатаОкончанияЗамещения_Текст,5,2),Прав(ДатаОкончанияЗамещения_Текст,2),23,59,59);
				Исключение
					МассивОшибок.Добавить("Substitution error. Date_out incorrect date format.");
				КонецПопытки;
			КонецПопытки;
						
		Иначе
			
			Возврат Результат;
			
		КонецЕсли; 		
		
		Если МассивОшибок.Количество() = 0 Тогда 
						
			НаборЗаписей = РегистрыСведений.ИКТ_ЗаместителиRequest.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ЗамещаемыйПользователь.Установить(Замещаемый_Пользователь);			
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			
			НоваяЗапись.ЗамещаемыйПользователь  = Замещаемый_Пользователь;
			НоваяЗапись.ЗаместительПользователь = Заместитель_Пользователь; 
			НоваяЗапись.ДатаНачала              = ДатаНачалаЗамещения_Дата;
			НоваяЗапись.ДатаОкончания           = ДатаОкончанияЗамещения_Дата;

			НоваяЗапись.ЗамещаемыйID            = Замещаемый_ID;
			НоваяЗапись.ЗаместительID           = Заместитель_ID;			
			НоваяЗапись.ЗамещаемыйФизЛицо       = Замещаемый_ФизЛицо;
			НоваяЗапись.ЗаместительФизЛицо      = Заместитель_ФизЛицо; 		
			НоваяЗапись.ДатаЗаписи              = ТекущаяДата();
			
			НаборЗаписей.Записать();
			
		Иначе
			
			Возврат Результат;
			
		КонецЕсли; 
			
	Исключение
		
		МассивОшибок.Добавить("Substitution error. For an unknown reason."); 
		
	КонецПопытки;
	
	Если МассивОшибок.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ОбработатьУвольнениеСотрудника(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса) 
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("OperationStatus", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Key",             Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДанных.Колонки.Добавить("PERNR",           Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДанных.Колонки.Добавить("REASON_CODE",     Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДанных.Колонки.Добавить("REASON_NAME",     Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));   
	
	СтрТЗ = ТаблицаДанных.Добавить();
	СтрТЗ.OperationStatus = Число(ДанныеЗапроса["STATUS"]);
	СтрТЗ.Key             = ДанныеЗапроса["KEY"];
	СтрТЗ.PERNR           = ДанныеЗапроса["VARIABLES_PERNR"];
	СтрТЗ.REASON_CODE     = ДанныеЗапроса["VARIABLES_REASON_CODE"];
	СтрТЗ.REASON_NAME     = ДанныеЗапроса["VARIABLES_REASON_NAME"];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.OperationStatus КАК OperationStatus,
	|	ТаблицаДанных.Key КАК Key,
	|	ТаблицаДанных.PERNR КАК PERNR,
	|	ТаблицаДанных.REASON_CODE КАК REASON_CODE,
	|	ТаблицаДанных.REASON_NAME КАК REASON_NAME
	|ПОМЕСТИТЬ ВТ_ДанныеЗапроса
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ФизическиеЛица.Ссылка) КАК Ссылка,
	|	ФизическиеЛица.ИКТ_ТабельныйНомер КАК ИКТ_ТабельныйНомер
	|ПОМЕСТИТЬ ВТ_ФизическиеЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ИКТ_ТабельныйНомер В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеЗапроса.PERNR КАК PERNR
	|			ИЗ
	|				ВТ_ДанныеЗапроса КАК ВТ_ДанныеЗапроса)
	|
	|СГРУППИРОВАТЬ ПО
	|	ФизическиеЛица.ИКТ_ТабельныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	|	ИКТ_RequestПричиныУвольнения.Ссылка КАК ПричинаУвольнения,
	|	ВТ_ДанныеЗапроса.PERNR КАК IDФизическогоЛица,
	|	ВТ_ДанныеЗапроса.Key КАК IDПроцессаRequest,
	|	ВТ_ДанныеЗапроса.OperationStatus КАК СтатусОперации,
	|	ВТ_ДанныеЗапроса.REASON_NAME КАК НаименованиеПричиныУвольнения,
	|	ВТ_ДанныеЗапроса.REASON_CODE КАК КодПричиныУвольнения,
	|	ИКТ_RequestСобытияУвольнения.Ссылка КАК Ссылка,
	|	ВТ_ДанныеЗапроса.Key КАК Key,
	|	ВТ_ДанныеЗапроса.PERNR КАК PERNR
	|ИЗ
	|	ВТ_ДанныеЗапроса КАК ВТ_ДанныеЗапроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФизическиеЛица КАК ВТ_ФизическиеЛица
	|		ПО ВТ_ДанныеЗапроса.PERNR = ВТ_ФизическиеЛица.ИКТ_ТабельныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИКТ_RequestПричиныУвольнения КАК ИКТ_RequestПричиныУвольнения
	|		ПО ВТ_ДанныеЗапроса.REASON_CODE = ИКТ_RequestПричиныУвольнения.КодПричиныУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИКТ_RequestСобытияУвольнения КАК ИКТ_RequestСобытияУвольнения
	|		ПО ВТ_ДанныеЗапроса.Key = ИКТ_RequestСобытияУвольнения.IDПроцессаRequest";  
	
	Результат = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТЗПричинУвольнения = Новый ТаблицаЗначений;
	ТЗПричинУвольнения.Колонки.Добавить("КодПричиныУвольнения");
	ТЗПричинУвольнения.Колонки.Добавить("Ссылка");
	
	Пока Выборка.Следующий() Цикл
			
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			
			СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
		Иначе
			
			СобытиеОбъект = Справочники.ИКТ_RequestСобытияУвольнения.СоздатьЭлемент();
			
		КонецЕсли;  
		
		ЗаполнитьЗначенияСвойств(СобытиеОбъект, Выборка);
		
		Если Выборка.СтатусОперации = 3 Тогда
			
			СобытиеОбъект.ПометкаУдаления = Истина;
			
		Иначе
			
			СобытиеОбъект.ПометкаУдаления = Ложь;
			
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(Выборка.ПричинаУвольнения) Тогда
			
			СобытиеОбъект.ПричинаУвольнения = Выборка.ПричинаУвольнения;
			
		Иначе
			
			СтрСозданнойПричины = ТЗПричинУвольнения.Найти(Выборка.КодПричиныУвольнения, "КодПричиныУвольнения");
			
			Если СтрСозданнойПричины <> Неопределено Тогда
				
				СобытиеОбъект.ПричинаУвольнения = СтрСозданнойПричины.Ссылка;
				
			Иначе
				
				НоваяПричинаУвольнения = Справочники.ИКТ_RequestПричиныУвольнения.СоздатьЭлемент();
				НоваяПричинаУвольнения.Наименование = Выборка.НаименованиеПричиныУвольнения;
				НоваяПричинаУвольнения.КодПричиныУвольнения = Выборка.КодПричиныУвольнения;
				НоваяПричинаУвольнения.Записать();
				
				ЗаполнитьЗначенияСвойств(ТЗПричинУвольнения.Добавить(), НоваяПричинаУвольнения); 
				
				СобытиеОбъект.ПричинаУвольнения = НоваяПричинаУвольнения.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СобытиеОбъект.Записать(); 
		
		Результат.Добавить(Новый Структура("Key,PERNR,XX__CUR_KEY", Выборка.Key, Выборка.PERNR, Строка(СобытиеОбъект.Ссылка.УникальныйИдентификатор())));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьСтатусДоговора(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса) 
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Структура("Body", ТелоЗапроса));
	
	Попытка 	
		
		GUIDСобытия   = СокрЛП(ДанныеЗапроса.Получить("KEY"));
		ID_Статус     = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_STATUS"));  
		
		ID_Request          = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_REQUESTID"));
		CFO_Request         = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_CFO_NUM"));
		Budget_code_Request = СокрЛП(ДанныеЗапроса.Получить("VARIABLES_BUDGET_CODE"));
		
		СоответствиеСтатусов = Новый Соответствие;
		СоответствиеСтатусов.Вставить("1",Перечисления.СостоянияСогласования.Черновик);
		СоответствиеСтатусов.Вставить("2",Перечисления.СостоянияСогласования.НаУтверждении);
		СоответствиеСтатусов.Вставить("3",Перечисления.СостоянияСогласования.Утверждена);
		СоответствиеСтатусов.Вставить("4",Перечисления.СостоянияСогласования.Отклонено);
		СоответствиеСтатусов.Вставить("5",Перечисления.СостоянияСогласования.Возвращена);
		
		Если НЕ ЗначениеЗаполнено(GUIDСобытия) Тогда 
			МассивОшибок.Добавить("Substitution error. Key empty.");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ID_Статус) Тогда 
			МассивОшибок.Добавить("Substitution error. Status empty.");
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ID_Request) Тогда 
			МассивОшибок.Добавить("Substitution error. RequestId empty.");
		КонецЕсли; 
		
		Если МассивОшибок.Количество() > 0 Тогда
			Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		СтатусВ1С = СоответствиеСтатусов.Получить(Строка(ID_Статус));
		
		СсылкаСобытия = Справочники.ИКТ_СобытияОбменаRequest.ПолучитьСсылку(Новый УникальныйИдентификатор(GUIDСобытия));
		
		ОснованиеСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаСобытия, "ОснованиеСобытия"); 
		
		Если Не ЗначениеЗаполнено(ОснованиеСобытия) Тогда
			МассивОшибок.Добавить("Substitution error. The key agreement was not found."); 
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтатусВ1С) Тогда
			МассивОшибок.Добавить("Substitution error. The status is uncertain."); 
		КонецЕсли;    
		
		Если МассивОшибок.Количество() > 0 Тогда
			Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(ОснованиеСобытия, СтатусВ1С); 
		
		Если ДанныеЗапроса["FILES"] <> Неопределено И СтатусВ1С = Перечисления.СостоянияСогласования.Утверждена Тогда
			ПрикрепитьФайлыКДоговору(ДанныеЗапроса["FILES"], ОснованиеСобытия, Отказ, МассивОшибок);
		КонецЕсли;		
		
		Если СтатусВ1С = Перечисления.СостоянияСогласования.Утверждена Тогда 
			
			Если ЗначениеЗаполнено(ОснованиеСобытия) Тогда
				
				Если ДанныеЗапроса["FILES"] <> Неопределено Тогда
					ПрикрепитьФайлыКДоговору(ДанныеЗапроса["FILES"], ОснованиеСобытия, Отказ, МассивОшибок);
				КонецЕсли;
				
				ДоговорСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеСобытия, "ДоговорКонтрагента"); 
				
				Если ЗначениеЗаполнено(ДоговорСсылка) Тогда 
					ДоговорОбъект = ДоговорСсылка.ПолучитьОбъект();
					ДоговорОбъект.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
					ДоговорОбъект.Записать();  
				КонецЕсли;
				
			КонецЕсли; 
			
			ВерсияСоглашенияКоммерческийДоговорОбъект = ОснованиеСобытия.ПолучитьОбъект();
			
			ПерезаписатьВерсию = Ложь;
			
			Если ЗначениеЗаполнено(ID_Request) Тогда 
				ВерсияСоглашенияКоммерческийДоговорОбъект.ИКТ_НомерЗадачиRequest = ID_Request; 
				ПерезаписатьВерсию = Истина;
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(Budget_code_Request) Тогда
				
				Попытка 
					Budget_code_Request_ЧИСЛО = Число(Budget_code_Request);	
				Исключение
					Budget_code_Request_ЧИСЛО = Budget_code_Request;
				КонецПопытки;
				
				ВерсияСоглашенияКоммерческийДоговорОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоРеквизиту("ИКТ_КодSAP",Budget_code_Request_ЧИСЛО);
				ПерезаписатьВерсию = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(CFO_Request) Тогда
				ВерсияСоглашенияКоммерческийДоговорОбъект.ОсновнойЦФО = Справочники.Организации.НайтиПоНаименованию(CFO_Request,Истина);
				ПерезаписатьВерсию = Истина;
			КонецЕсли;
			
			Если ПерезаписатьВерсию Тогда 
				ВерсияСоглашенияКоммерческийДоговорОбъект.Записать(); 
			КонецЕсли;
			
		КонецЕсли;  	
		
		//После ответа при повторном проведении нужно новое событие для согласования договора
		СобытиеОбъект = СсылкаСобытия.ПолучитьОбъект();
		СобытиеОбъект.ПометкаУдаления = Истина;
		СобытиеОбъект.Записать();
		
		Возврат Результат;
					
	Исключение
		
		Отказ = Истина;
		МассивОшибок.Добавить("Substitution error. For an unknown reason. " + ОписаниеОшибки()); 
		
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции

Процедура ПрикрепитьФайлыКДоговору(МассивОписанийФайлов, ВКДСсылка, Отказ, МассивОшибок)
	
	ДоговорСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКДСсылка, "ДоговорКонтрагента");
	
	ТЗФайлов = Новый ТаблицаЗначений;
	ТЗФайлов.Колонки.Добавить("Строка_Base64", Новый ОписаниеТипов("Строка"));
	ТЗФайлов.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТЗФайлов.Колонки.Добавить("РасширениеФайла", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)));
	
	Для каждого ДанныеФайла из МассивОписанийФайлов Цикл
		
		СтрТЗ = ТЗФайлов.Добавить();
		СтрТЗ.Строка_Base64 = ДанныеФайла.Получить("FILE"); 
		СтрТЗ.ИмяФайла = ДанныеФайла.Получить("FILENAME");
		СтрТЗ.РасширениеФайла = ДанныеФайла.Получить("FILEEXTENSION");
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗФайлов.Строка_Base64 КАК Строка_Base64,
		|	ПОДСТРОКА(ТЗФайлов.ИмяФайла, 1, 150) КАК ИмяФайла,
		|	ПОДСТРОКА(ТЗФайлов.РасширениеФайла, 1, 10) КАК РасширениеФайла
		|ПОМЕСТИТЬ ВТ_ТЗФайлов
		|ИЗ
		|	&ТЗФайлов КАК ТЗФайлов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентовПрисоединенныеФайлы.Наименование КАК Наименование,
		|	ДоговорыКонтрагентовПрисоединенныеФайлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК ДоговорыКонтрагентовПрисоединенныеФайлы
		|ГДЕ
		|	(ДоговорыКонтрагентовПрисоединенныеФайлы.Наименование, ДоговорыКонтрагентовПрисоединенныеФайлы.Расширение, ДоговорыКонтрагентовПрисоединенныеФайлы.ПометкаУдаления, ДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла) В
		|			(ВЫБРАТЬ
		|				ВТ_ТЗФайлов.ИмяФайла КАК ИмяФайла,
		|				ВТ_ТЗФайлов.РасширениеФайла КАК РасширениеФайла,
		|				ЛОЖЬ КАК ПометкаУдаления,
		|				&ДоговорСсылка КАК ДоговорСсылка
		|			ИЗ
		|				ВТ_ТЗФайлов КАК ВТ_ТЗФайлов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЗФайлов.Строка_Base64 КАК Строка_Base64,
		|	ВТ_ТЗФайлов.ИмяФайла КАК ИмяФайла,
		|	ВТ_ТЗФайлов.РасширениеФайла КАК РасширениеФайла
		|ИЗ
		|	ВТ_ТЗФайлов КАК ВТ_ТЗФайлов";
	
	Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
	Запрос.УстановитьПараметр("ТЗФайлов", ТЗФайлов);
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатКУдалению = ПакетыЗапроса[1];
	
	РезультатКДобавлению = ПакетыЗапроса[2];
	
	Выборка = РезультатКДобавлению.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка 
			ДДФ = Base64Значение(Выборка.Строка_Base64);
		Исключение
			Отказ = Истина;
			МассивОшибок.Добавить(СтрШаблон("Invalid base64 string for the %1 file", Выборка.ИмяФайла));
			Продолжить;
		КонецПопытки; 
		
		ОписаниеФайла = РаботаСФайлами.ПараметрыДобавленияФайла();		
		ОписаниеФайла.Автор = ПараметрыСеанса.ТекущийПользователь;
		ОписаниеФайла.ВладелецФайлов = ДоговорСсылка;
		ОписаниеФайла.ИмяБезРасширения = Выборка.ИмяФайла;
		ОписаниеФайла.РасширениеБезТочки = Выборка.РасширениеФайла;
		
		АдресВХ = ПоместитьВоВременноеХранилище(ДДФ);
		
		РаботаСФайлами.ДобавитьФайл(ОписаниеФайла, АдресВХ);
		
	КонецЦикла; 
	
	Выборка = РезультатКУдалению.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ФайлОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ФайлОбъект.ПометкаУдаления = Истина;
		ФайлОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьРешениеПоРаботеНеПоГрафику(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса)
	
	НекорректнаяСтруктураТелаЗапроса = Ложь;
		
	Если ДанныеЗапроса.Получить("KEY") = Неопределено Тогда			
		НекорректнаяСтруктураТелаЗапроса = Истина;
	    МассивОшибок.Добавить("Key not found");
	КонецЕсли;
	   
	Если ДанныеЗапроса.Получить("STATUS") = Неопределено Тогда			
		НекорректнаяСтруктураТелаЗапроса = Истина;
	    МассивОшибок.Добавить("Status not found");
	КонецЕсли;
		
	Если НекорректнаяСтруктураТелаЗапроса Тогда			
		Отказ = Истина;
		Возврат Неопределено;	
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Структура("Body", ТелоЗапроса));
	
	Попытка 	
		
		GUIDСобытия   = СокрЛП(ДанныеЗапроса.Получить("KEY"));
			
		ID_Статус     = СокрЛП(ДанныеЗапроса.Получить(ВРег("VARIABLES_I_Event")));		
		ID_Сотрудника = СокрЛП(ДанныеЗапроса.Получить(ВРег("VARIABLES_I_PERNR")));
		I_BDATE       = СокрЛП(ДанныеЗапроса.Получить(ВРег("VARIABLES_I_BDATE")));
		I_EDATE       = СокрЛП(ДанныеЗапроса.Получить(ВРег("VARIABLES_I_EDATE")));
        I_DATE        = СокрЛП(ДанныеЗапроса.Получить(ВРег("VARIABLES_I_DATE"))); 
		
		ДатаНачалаОтсутствия = '00010101';
		ДатаОкончанияОтсутствия = '00010101';
		Попытка
			ДатаНачалаОтсутствия = Дата(Прав(I_BDATE,4),Сред(I_BDATE,4,2),Лев(I_BDATE,2),00,00,00);
		Исключение
			Попытка
				ДатаНачалаОтсутствия = Дата(Лев(I_BDATE,4),Сред(I_BDATE,5,2),Прав(I_BDATE,2),00,00,00);
			Исключение    
				Если ЗначениеЗаполнено(I_BDATE) Тогда
					МассивОшибок.Добавить("Substitution error. I_BDATE incorrect date format.");					
				КонецЕсли;
			КонецПопытки;
		КонецПопытки;
		
		Попытка
			ДатаОкончанияОтсутствия = Дата(Прав(I_EDATE,4),Сред(I_EDATE,4,2),Лев(I_EDATE,2),00,00,00);
		Исключение
			Попытка
				ДатаОкончанияОтсутствия = Дата(Лев(I_EDATE,4),Сред(I_EDATE,5,2),Прав(I_EDATE,2),00,00,00);
			Исключение
				Если ЗначениеЗаполнено(I_EDATE) Тогда
					МассивОшибок.Добавить("Substitution error. I_BDATE incorrect date format."); 
				КонецЕсли;
			КонецПопытки;
		КонецПопытки;
		
	    СоответствиеСтатусов = Новый Соответствие;
		СоответствиеСтатусов.Вставить("N",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ТехСобойСКУД);
		СоответствиеСтатусов.Вставить("M",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.УходПослеПолуночи);
		СоответствиеСтатусов.Вставить("L",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.Удаленка75);
		СоответствиеСтатусов.Вставить("D",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ОтпускПолДня_ДоОбеда);
		СоответствиеСтатусов.Вставить("E",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ОтпускПолДня_ПослеОбеда);
		СоответствиеСтатусов.Вставить("G",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ЕжегодныйОтпуск);
		СоответствиеСтатусов.Вставить("F",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ОтпускВЧестьДР);
		СоответствиеСтатусов.Вставить("1",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.БольничныйНеподтвержденный);//K
		СоответствиеСтатусов.Вставить("2",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.Командировка);
		СоответствиеСтатусов.Вставить("4",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ОтпускЗаСвойСчет);
		СоответствиеСтатусов.Вставить("K",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.РабочийНеоплачиваемыйДень);
		СоответствиеСтатусов.Вставить("6",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.Опоздал_УшелРаньше);
		СоответствиеСтатусов.Вставить("7",	Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.Отгул);
				
		Если НЕ ЗначениеЗаполнено(GUIDСобытия) Тогда 
			МассивОшибок.Добавить("Substitution error. Key empty.");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ID_Статус) Тогда 
			МассивОшибок.Добавить("Substitution error. Status empty.");
		КонецЕсли; 
		
		Если МассивОшибок.Количество() > 0 Тогда
			Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		РешениеRequest = СоответствиеСтатусов.Получить(Строка(ID_Статус));
		
		СсылкаСобытия = Справочники.ИКТ_СобытияОбменаRequest.ПолучитьСсылку(Новый УникальныйИдентификатор(GUIDСобытия));
		
		ОснованиеСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаСобытия, "ОснованиеСобытия"); 
		
		Если Не ЗначениеЗаполнено(ОснованиеСобытия) Тогда
			МассивОшибок.Добавить("Substitution error. The key agreement was not found."); 
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(РешениеRequest) Тогда
			МассивОшибок.Добавить("Substitution error. The status is uncertain."); 
		КонецЕсли;    
		
		Если МассивОшибок.Количество() > 0 Тогда
			Отказ = Истина;
			Возврат Результат;
		КонецЕсли; 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	&РешениеRequest КАК РешениеRequest
			|ПОМЕСТИТЬ ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени.ВидРабочегоВремени КАК ВидРабочегоВремени,
			|	ВТ.РешениеRequest КАК РешениеRequest,
			|	НЕ ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени.ВидРабочегоВремени ЕСТЬ NULL КАК ОтразитьВТабеле,
			|	ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени.СостояниеСотрудника КАК СостояниеСотрудника
			|ИЗ
			|	ВТ КАК ВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени КАК ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени
			|		ПО ВТ.РешениеRequest = ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени.РешениеRequest";
		
		Запрос.УстановитьПараметр("РешениеRequest", РешениеRequest);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДокОбъект = ОснованиеСобытия.ПолучитьОбъект(); 
		ДокОбъект.ДатаНачалаОтсутствия = ?(ЗначениеЗаполнено(ДатаНачалаОтсутствия), ДатаНачалаОтсутствия, ДокОбъект.ДатаИнцидента);
		ДокОбъект.ДатаОкончанияОтсутствия = ?(ЗначениеЗаполнено(ДатаОкончанияОтсутствия), ДатаОкончанияОтсутствия, ДокОбъект.ДатаИнцидента);
		ЗаполнитьЗначенияСвойств(ДокОбъект, Выборка);
		ДокОбъект.ДополнительныеСвойства.Вставить("ИКТ_ЗагрузкаДанных",Истина);
		
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОбъект.Записать();
		КонецЕсли;
		
		Возврат Результат;
					
	Исключение
		
		Отказ = Истина;
		МассивОшибок.Добавить("Substitution error. For an unknown reason. " + ОписаниеОшибки()); 
		
	КонецПопытки;
		
	Возврат Результат;
		
КонецФункции

Функция ОбработатьТехСбойСКУД(ДанныеЗапроса, Отказ, МассивОшибок, ТелоЗапроса)
	
	НекорректнаяСтруктураТелаЗапроса = Ложь;
		
	Если ДанныеЗапроса.Получить("KEY") = Неопределено Тогда			
		НекорректнаяСтруктураТелаЗапроса = Истина;
	    МассивОшибок.Добавить("Key not found");
	КонецЕсли;
	
	Если НекорректнаяСтруктураТелаЗапроса Тогда			
		Отказ = Истина;
		Возврат Неопределено;	
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Структура("Body", ТелоЗапроса));
	
	Попытка 	
		
		GUIDСобытия   = СокрЛП(ДанныеЗапроса.Получить("KEY"));
		ID_Статус     = СокрЛП(ДанныеЗапроса.Получить(ВРег("VARIABLES_STATUS")));		
		
		Если НЕ ЗначениеЗаполнено(GUIDСобытия) Тогда 
			МассивОшибок.Добавить("Substitution error. Key empty.");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ID_Статус) Тогда 
			МассивОшибок.Добавить("Substitution error. Status empty.");
		КонецЕсли; 
		
		Если МассивОшибок.Количество() > 0 Тогда
			Отказ = Истина;
			Возврат Результат;
		КонецЕсли;
		
		СсылкаСобытия = Справочники.ИКТ_СобытияОбменаRequest.ПолучитьСсылку(Новый УникальныйИдентификатор(GUIDСобытия));
		
		ОснованиеСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаСобытия, "ОснованиеСобытия"); 
		
		Если Не ЗначениеЗаполнено(ОснованиеСобытия) Тогда
			МассивОшибок.Добавить("Substitution error. The key agreement was not found."); 
		КонецЕсли;
		
		Если МассивОшибок.Количество() > 0 Тогда
			Отказ = Истина;
			Возврат Результат;
		КонецЕсли; 
				
		СправочникОбъект = ОснованиеСобытия.ПолучитьОбъект(); 
		СправочникОбъект.ДополнительныеСвойства.Вставить("ИКТ_ЗагрузкаДанных",Истина);
		СправочникОбъект.ПодтвержденоДБ = ID_Статус <> "3";
		СправочникОбъект.Записать();
		
		Возврат Результат;
					
	Исключение
		
		Отказ = Истина;
		МассивОшибок.Добавить("Substitution error. For an unknown reason. " + ОписаниеОшибки()); 
		
	КонецПопытки;
		
	Возврат Результат;
		
КонецФункции
