&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Расш1_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Файл = Параметры.Файл;
	ДанныеФайла = Параметры.ДанныеФайла;
	ИмяОткрываемогоФайла = Параметры.ИмяОткрываемогоФайла;
	ИдентификаторВладельца = Параметры.ИдентификаторВладельца;

	Если Не ЗначениеЗаполнено(ИдентификаторВладельца) Тогда
		ИдентификаторВладельца = УникальныйИдентификатор;
	КонецЕсли;

	Если ДанныеФайла.ФайлРедактируетТекущийПользователь Тогда
		РежимРедактирования = Истина;
	КонецЕсли;
	
	Если ДанныеФайла.Версия <> ДанныеФайла.ТекущаяВерсия Тогда
		РежимРедактирования = Ложь;
	КонецЕсли;
	
	#Удаление
	ТолькоПросмотр = Не ПравоДоступа("Редактирование", Файл.Метаданные());
    #КонецУдаления
	#Вставка
	ТолькоПросмотр = Не ПравоДоступа("Редактирование", Файл.Метаданные()) Или Не ДоступноРедактированиеФайла(ТипЗнч(ДанныеФайла.Владелец), ДанныеФайла.Автор);  //[+] ИКТ №20078 (строка ДОБАВЛЕНА), Новоселов, 29.07.2026
	#КонецВставки
	
	Элементы.Текст.ТолькоПросмотр                = Не РежимРедактирования;
	Элементы.ПоказатьОтличия.Видимость           = ОбщегоНазначения.ЭтоWindowsКлиент();
	Элементы.ПоказатьОтличия.Доступность         = РежимРедактирования;
	Элементы.Редактировать.Доступность           = Не РежимРедактирования И Не ТолькоПросмотр;
	Элементы.ЗакончитьРедактирование.Доступность = РежимРедактирования;
	Элементы.ЗаписатьИЗакрыть.Доступность        = РежимРедактирования;
	Элементы.Записать.Доступность                = РежимРедактирования;

	Если ДанныеФайла.Версия <> ДанныеФайла.ТекущаяВерсия
		ИЛИ ДанныеФайла.Служебный Тогда
		Элементы.Редактировать.Доступность = Ложь;
	КонецЕсли;

	ЗаголовокСтрока = ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(
	ДанныеФайла.ПолноеНаименованиеВерсии, ДанныеФайла.Расширение);

	Если Не РежимРедактирования Тогда
		ЗаголовокСтрока = ЗаголовокСтрока + " " + НСтр("ru = '(только просмотр)';
		|en = '(Read-only)'");
	КонецЕсли;
	Заголовок = ЗаголовокСтрока;

	Если ДанныеФайла.Свойство("Кодировка") Тогда
		КодировкаТекстаФайла = ДанныеФайла.Кодировка;
	КонецЕсли;

	Если ЗначениеЗаполнено(КодировкаТекстаФайла) Тогда
		СписокКодировок = РаботаСФайламиСлужебный.Кодировки();
		ЭлементСписка = СписокКодировок.НайтиПоЗначению(КодировкаТекстаФайла);
		Если ЭлементСписка = Неопределено Тогда
			КодировкаПредставление = КодировкаТекстаФайла;
		Иначе
			КодировкаПредставление = ЭлементСписка.Представление;
		КонецЕсли;
	Иначе
		КодировкаПредставление = НСтр("ru = 'По умолчанию';
		|en = 'Default'");
	КонецЕсли;

КонецПроцедуры

//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 29.07.2026 
&НаСервереБезКонтекста
Функция ДоступноРедактированиеФайла(ТипВладельцаФайла, АвторФайла)
	
	Автор = ?(ТипЗнч(АвторФайла) = Тип("Строка"), Справочники.Пользователи.НайтиПоНаименованию(АвторФайла), АвторФайла);
	
	Если Автор = Пользователи.ТекущийПользователь() Тогда
		Возврат Истина;
	ИначеЕсли Автор = Справочники.Пользователи.ПустаяСсылка() Тогда
		Общегоназначения.СообщитьПользователю("Не удалось установить связь автора файла с пользователем системы!");
	КонецЕсли;
	
	Если ТипВладельцаФайла = Тип("СправочникСсылка.Проекты") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектов");
	ИначеЕсли ТипВладельцаФайла = Тип("ДокументСсылка.упоПроектнаяЗадача")
			Или ТипВладельцаФайла = Тип("СправочникСсылка.упоЗадания") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектныхЗадачЗаданий");
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции
//[+]} ИКТ №20612