
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Возвращает данные для проведения документа.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
// Возвращаемое значение:
//   Структура: 
//   	* Ключ - Строка - имя регистра.
//   	* Значение - ТаблицаЗначений - данные для проведения документа.
//
Функция ДанныеПроведения(ДокументСсылка) Экспорт
			
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);		
	Запрос.Текст = ТекстПроведение();
			
	Результат = Запрос.Выполнить();
			
	ДанныеПроведения = Новый Структура;
	ДанныеПроведения.Вставить("упоИтоговыйБаллПроектов", Результат.Выгрузить());
		
	Возврат ДанныеПроведения;
		
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРасчетИтоговогоБаллаПроектов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ТекстПроведение()
			
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРасчетИтоговогоБаллаПроектовПроекты.Ссылка КАК Регистратор,
	               |	упоРасчетИтоговогоБаллаПроектов.Дата КАК Период,
	               |	упоРасчетИтоговогоБаллаПроектовПроекты.Проект КАК Проект,
	               |	упоРасчетИтоговогоБаллаПроектовПроекты.ЗаявкаНаПроект КАК ЗаявкаНаПроект,
	               |	упоРасчетИтоговогоБаллаПроектовПроекты.Балл КАК Балл
	               |ИЗ
	               |	Документ.упоРасчетИтоговогоБаллаПроектов.Проекты КАК упоРасчетИтоговогоБаллаПроектовПроекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРасчетИтоговогоБаллаПроектов КАК упоРасчетИтоговогоБаллаПроектов
	               |		ПО упоРасчетИтоговогоБаллаПроектовПроекты.Ссылка = упоРасчетИтоговогоБаллаПроектов.Ссылка
	               |ГДЕ
	               |	упоРасчетИтоговогоБаллаПроектовПроекты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли