
Функция ПолучитьМассивВыгружаемыхСобытийПоТипуОбъекту(ТипОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_УправлениеОбменомRequest.ТипСобытия КАК ТипСобытия
		|ИЗ
		|	РегистрСведений.ИКТ_УправлениеОбменомRequest КАК ИКТ_УправлениеОбменомRequest
		|ГДЕ
		|	ИКТ_УправлениеОбменомRequest.ТипОбъекта = &ТипОбъекта
		|	И ИКТ_УправлениеОбменомRequest.ВыгружатьДанные";
	
	Запрос.УстановитьПараметр("ТипОбъекта", Строка(ТипОбъекта));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипСобытия")
	
КонецФункции