
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
		
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	упоПроектыИЗадачиСервер.ПроверкаВозможностиИзмененияСтатусаПроекта(ЭтотОбъект, Отказ, Заголовок);
			
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	
	Правила = Новый Структура();
	
	// Правила для регистра "СтатусыПроектов"
	ПравилаНаложения.Вставить(Движения.упоСтатусыПроектов.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ФиксацияСтатуса", ПравилаДвижения);
	
	ПравилаДвижения.Вставить("Проект", "Проект");
		
	// Для устранения ошибки потери данных базовый планов
	// сохраняем данный документ в качестве регистратора плановых регистров.
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДополнительныхЗатрат.Метаданные().Имя, Правила);	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСвойстваПроектныхЗадач.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСрокиПроектныхЗадач.Метаданные().Имя, Правила);
	
	Возврат ПравилаНаложения; 

КонецФункции
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	// Бизнес-логика дополнительной обработки данных движений по регистрам
	ТаблицаДвижений = ДанныеДвижений[Движения.упоСтатусыПроектов.Метаданные().Имя];
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.упоСостояниеСтатусаПроекта.Утвержден, "СтатусПроекта");

КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	ДокументОснование = Основание;
	
	Если ТипЗнч(Основание) = Тип("Структура") 
		И Основание.Свойство("Проект") Тогда
		
		Проект = Основание.Проект;
		
	Иначе
		
		Проект = ДокументОснование.Проект;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения); 
	
	// если в этом месяце уже есть проведенный документ - еще один сделать не можем :(
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СтруктураАналога = Новый Структура("Проект",Проект);
		Отказ = упоФункцииОбщегоНазначенияСервер.ЕстьАналогичныйДокумент(Ссылка, "упоУтверждениеПланаПроекта", СтруктураАналога);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ	(ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);	
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, РежимЗаписиДокумента.Проведение,
			Отказ, Заголовок, Истина);
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	СохранитьБазовыйПланПроекта(Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	упоВерсионирование.УдалитьБазовуюВерсиюПроекта(Проект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сохранение базового плана проекта.
// Берется актуальный срез данных некоторых регистров и переписывается этим документом.
Процедура СохранитьБазовыйПланПроекта(Отказ)
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	упоВерсионирование.ОбновитьБазовуюВерсиюПроекта(Проект);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
