
&НаСервере
//{[+] ИКТ №8340 (фрагмент ДОБАВЛЕН), Селивёрстов Д., 30-05-2025 
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПереместитьДопРеквизитНаФорме();
	
КонецПроцедуры
//[+]} ИКТ №8340

&НаСервере
//{[+] ИКТ №8340 (фрагмент ДОБАВЛЕН), Селивёрстов Д., 30-05-2025 
Процедура ПереместитьДопРеквизитНаФорме()
	
	СписокДополнительныхРеквизитов = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов;
	ИКТ_ДепартаментИлиБюджетодержатель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ИКТ_ДепартаментИлиБюджетодержатель");
	Если ЗначениеЗаполнено(ИКТ_ДепартаментИлиБюджетодержатель) Тогда
		НайденныеСтроки = СписокДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", ИКТ_ДепартаментИлиБюджетодержатель));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Попытка	
				ПолеИКТ_ДепартаментИлиБюджетодержатель = НайденныеСтроки[0];
				ГруппаСтраницаОсновное = ЭтаФорма.Элементы.Найти("ГруппаСтраницаОсновное"); 
				ПолеФормы = ЭтаФорма.Элементы[ПолеИКТ_ДепартаментИлиБюджетодержатель.ИмяРеквизитаЗначение];
				Если не ПолеФормы = Неопределено Тогда
					ЭтаФорма.Элементы.Переместить(ПолеФормы, ГруппаСтраницаОсновное); 
				КонецЕсли; 
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
//[+]} ИКТ №8340
