//ИКТ_Новоселов_Добавлена возможность открытия формы РаспределениеРасходовНаПоступления из документа ПриобретениеТоваровУслуг_Задача№11252_20.11.2025<<
&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура ИКТ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыНаФорму()
	
КонецПроцедуры
 
&наСервере
Процедура ДобавитьРеквизитыНаФорму()
	
	// Добавление реквизита Номенклатура
	ДобавляемыеРеквизиты = Новый Массив();
	РеквизитНоменклатура = Новый РеквизитФормы(
	    "Номенклатура",
	    Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
	    "СписокДокументов"
	);
	ДобавляемыеРеквизиты.Добавить(РеквизитНоменклатура);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавление колонки Номенклатура в ТЧ СписокДокументов
	НовыйЭлемент = Элементы.Вставить("Номенклатура", Тип("ПолеФормы"), Элементы.СписокДокументов, Элементы.СписокДокументовПартнер);       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "СписокДокументов.Номенклатура"; 
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьРеквизитыДокумента")
Процедура Расш1_ЗаполнитьРеквизитыДокумента()

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	Строки.АналитикаРасходов КАК Ссылка,
	|	Строки.Содержание        КАК Содержание,
	#Вставка
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	#КонецВставки
	|	Строки.Количество        КАК Количество,
	|	Строки.Сумма             КАК Сумма,
	|	Строки.СтавкаНДС         КАК СтавкаНДС,
	|	Строки.Подразделение     КАК Подразделение,
	|	Строки.СтатьяРасходов    КАК СтатьяРасходов
	|ПОМЕСТИТЬ ВтМассивСтрок
	|ИЗ
	|	&МассивСтрок КАК Строки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.АналитикаРасходов) 
	|		= ТИП(Документ.ПриобретениеТоваровУслуг)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	Строки.Ссылка            КАК Ссылка,
	|	Строки.Содержание        КАК Содержание,
	#Вставка
	|	Строки.Номенклатура         КАК Номенклатура,
	#КонецВставки
	|	Строки.Количество        КАК Количество,
	|	Строки.Сумма             КАК Сумма,
	|	Строки.СтавкаНДС         КАК СтавкаНДС,
	|	Строки.Подразделение     КАК Подразделение,
	|	Строки.СтатьяРасходов    КАК СтатьяРасходов
	|ПОМЕСТИТЬ МассивСтрок
	|ИЗ
	|	ВтМассивСтрок КАК Строки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.Ссылка) 
	|		= ТИП(Документ.ПриобретениеТоваровУслуг)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Строки.Сумма) КАК Сумма
	|ИЗ
	|	МассивСтрок КАК Строки
	|;
	|////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Строки.Содержание     КАК Содержание,
	|	Строки.Количество     КАК Количество,
	|	Строки.СтавкаНДС      КАК СтавкаНДС,
	|	Строки.Подразделение  КАК Подразделение,
	|	Строки.СтатьяРасходов КАК СтатьяРасходов
	|ПОМЕСТИТЬ СодержаниеРасходов
	|ИЗ
	|	МассивСтрок КАК Строки
	|ГДЕ
	|	Строки.Содержание <> НЕОПРЕДЕЛЕНО
	|;
	|////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Строки.Содержание     КАК Содержание,
	|	Строки.Количество     КАК Количество,
	|	Строки.СтавкаНДС      КАК СтавкаНДС,
	|	Строки.Подразделение  КАК Подразделение,
	|	Строки.СтатьяРасходов КАК СтатьяРасходов
	|ИЗ
	|	СодержаниеРасходов КАК Строки
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента КАК НомерСтрокиДокумента
	|ИЗ ВтМассивСтрок КАК Строки
	|ГДЕ
	|	Строки.Ссылка = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|;
	|////////////////////////////
	|ВЫБРАТЬ
	|	Строки.НомерСтрокиДокумента                     КАК НомерСтрокиДокумента,
	#Вставка
	|	Строки.Номенклатура КАК Номенклатура,
	#КонецВставки
	|	Себестоимость.Регистратор                       КАК АналитикаРасходов,
	|	Себестоимость.Организация                       КАК Организация,
	|	Себестоимость.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	Текст.Содержание                                КАК Содержание,
	|	Текст.Количество                                КАК Количество,
	|	Текст.СтавкаНДС                                 КАК СтавкаНДС,
	|	Текст.Подразделение                             КАК Подразделение,
	|	Текст.СтатьяРасходов                            КАК СтатьяРасходов,
	|	СУММА(Себестоимость.Количество)                 КАК КоэффициентКоличество,
	|	СУММА(Себестоимость.Стоимость)                  КАК КоэффициентСумма,
	|	СУММА(Себестоимость.Количество * &ТекстЗапросаВесУпаковки)   	  КАК КоэффициентВес,
	|	СУММА(Себестоимость.Количество * &ТекстЗапросаОбъемУпаковки) 	  КАК КоэффициентОбъем,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаВесУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                        КАК ОшибкаКоэффициентВес,
	|	МАКСИМУМ(ВЫБОР КОГДА &ТекстЗапросаОбъемУпаковки = 0
	|		ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ)                                        КАК ОшибкаКоэффициентОбъем
	|ИЗ
	|	МассивСтрок КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|		ПО Строки.Ссылка = Себестоимость.Регистратор
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ СодержаниеРасходов КАК Текст
	|		ПО ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	#Вставка
	|	Строки.Номенклатура,
	#КонецВставки
	|	Строки.НомерСтрокиДокумента,
	|	Себестоимость.Регистратор,
	|	Себестоимость.Период,
	|	Себестоимость.Организация,
	|	Себестоимость.АналитикаУчетаПоПартнерам.Партнер,
	|	Текст.Содержание,
	|	Текст.Количество,
	|	Текст.СтавкаНДС,
	|	Текст.Подразделение,
	|	Текст.СтатьяРасходов
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.Количество) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДокумента
	|";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ТекстЗапросаВесУпаковки",
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
								"&ТекстЗапросаОбъемУпаковки",
								Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения",
									"Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура"));
								
	#Вставка
	ТаблицаСтрок = ПолучитьИзВременногоХранилища(Параметры.ТаблицаСтрок);
	
	Если ТаблицаСтрок.Колонки.Найти("Номенклатура") <> Неопределено Тогда
	    ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура",
									"Строки.Номенклатура КАК Номенклатура");
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивСтрок", ТаблицаСтрок);
	#КонецВставки

	Запрос.Текст = ТекстЗапроса;
		
	#Удаление
	Запрос.УстановитьПараметр("МассивСтрок", ПолучитьИзВременногоХранилища(Параметры.ТаблицаСтрок));
	#КонецУдаления
	Результат = Запрос.ВыполнитьПакет();

	Выборка = Результат[2].Выбрать();
	Выборка.Следующий();
	СуммаКРаспределению = Выборка.Сумма;

	Выборка = Результат[4].Выбрать();
	Выборка.Следующий();

	Содержание = Выборка.Содержание;
	Количество = Выборка.Количество;
	СтавкаНДС = Выборка.СтавкаНДС;
	Подразделение = Выборка.Подразделение;
	СтатьяРасходов = Выборка.СтатьяРасходов;

	СтрокиКУдалению.Загрузить(Результат[5].Выгрузить());
	СписокДокументов.Загрузить(Результат[6].Выгрузить());

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПоместитьРезультатВоВременноеХранилище")
Функция Расш1_ПоместитьРезультатВоВременноеХранилище()

	ВыгружаемыеПоля = "
	|НомерСтрокиДокумента, 
	|Сумма,
	#Вставка
	|Номенклатура,
	#КонецВставки
	|Содержание,
	|КомментарийРаспределения,
	|Количество,
	|СтавкаНДС,
	|Подразделение,
	|АналитикаРасходов,
	|СтатьяРасходов
	|";
	ПараметрыЗакрытия = Новый Структура("АдресВоВременномХранилище, СтрокиКУдалению",
	ПоместитьВоВременноеХранилище(СписокДокументов.Выгрузить(,ВыгружаемыеПоля), АдресВоВременномХранилище),
	ПоместитьВоВременноеХранилище(СтрокиКУдалению.Выгрузить(,"НомерСтрокиДокумента"), АдресСтрокКУдалению));
	Возврат ПараметрыЗакрытия;

КонецФункции
//>>ИКТ_Новоселов_Задача№11252_20.11.2025


