
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ИКТ_ДобавлениеИзменениеРеквизитовФормы();
	
	ДобавитьРеквизитыНаФорму(); 	

КонецПроцедуры


&НаСервере
Процедура ИКТ_ДобавлениеИзменениеРеквизитовФормы()
	
	ГруппаФормыКомандыФИО = Элементы.Найти("КомандыФИО");
	
	Если ГруппаФормыКомандыФИО = Неопределено Тогда 
		Сообщить("Не найден элемент формы: " + "<КомандыФИО>");
		Возврат;
	КонецЕсли;
	
	ЭлементФормыИзменитьФИО = Элементы.Найти("ИзменитьФИО");
	
	Если ЭлементФормыИзменитьФИО = Неопределено Тогда 
		Сообщить("Не найден элемент формы: " + "<ИзменитьФИО>");
		Возврат;
	КонецЕсли;
		
    ДобавляемыеРеквизиты = Новый Массив;
		
    Реквизит_ИКТ_ТабельныйНомер = Новый РеквизитФормы("ИКТ_ТабельныйНомер",Новый ОписаниеТипов("Строка"),, "Таб.номер УУ");
		
	ЭлементФормы_ИКТ_ТабельныйНомер = Элементы.Найти("ИКТ_ТабельныйНомер");
	
	Если ЭлементФормы_ИКТ_ТабельныйНомер = Неопределено Тогда 
		ДобавляемыеРеквизиты.Добавить(Реквизит_ИКТ_ТабельныйНомер);  
	КонецЕсли; 

	ИзменитьРеквизиты(ДобавляемыеРеквизиты); 	
		
	Если ЭлементФормы_ИКТ_ТабельныйНомер = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("ИКТ_ТабельныйНомер", Тип("ПолеФормы"), ГруппаФормыКомандыФИО,ЭлементФормыИзменитьФИО);
		НовыйЭлемент.ПутьКДанным            = "ФизическоеЛицо.ИКТ_ТабельныйНомер";		
		НовыйЭлемент.Вид                    = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ЦветТекста             = WebЦвета.Красный;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;     
			
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;  
		
	КонецЕсли;
	
	НоваяКоманда = Команды.Добавить("КомандаОткрытьФизЛицо");
	НоваяКоманда.Действие = "ОткрытьФизическоеЛицо";
	НоваяКоманда.Заголовок = "Физическое лицо";	
	
	НовыйЭлемент = Элементы.Добавить("СсылкаФизЛицо", Тип("КнопкаФормы"), Элементы.ГруппаДополнительныеДанные);
	НовыйЭлемент.ИмяКоманды = "КомандаОткрытьФизЛицо";
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	
	ИКТ_ДобавитьКнопкиПропуска();
	
	Если РольДоступна("ИКТ_RequestПолныеПрава") Тогда
		Если Сотрудник.ГоловнаяОрганизация.ИКТ_УУ Тогда 
			НовыйЭлемент = Элементы.Добавить("ИКТ_НеСоздаватьИнцидентыКРВ", Тип("ПолеФормы"), Элементы.ГруппаДатаРожденияПол);
			НовыйЭлемент.ПутьКДанным            = "Сотрудник.ИКТ_НеСоздаватьИнцидентыКРВ";		
			НовыйЭлемент.Вид                    = ВидПоляФормы.ПолеФлажка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФизическоеЛицо(Команда)	
	
	//ПараметрОткрытия = Новый Структура; 
	//Отбор = Новый Структура; 
	//Отбор.Вставить("ФизЛицо", ФизическоеЛицо.Ссылка); 
	//ПараметрОткрытия.Вставить("Отбор", Отбор); 
	// 
	//ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрОткрытия); 
	ОткрытьЗначение(ФизическоеЛицо.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()  

	УстановитьПривилегированныйРежим(Истина);
	
	Элементы.Код.Ширина = 10;
	Элементы.Код.РастягиватьПоГоризонтали = Ложь;  
	
	НайденнаяКоманда = Команды.Найти("ОткрытьСвязанныйОбъект");   
	
	Если НайденнаяКоманда = Неопределено Тогда
	
		Команда = Команды.Добавить("ОткрытьСвязанныйОбъект"); 
		Команда.Заголовок = "ОткрытьСвязанныйОбъект";
		Команда.Действие  = "ОткрытьСвязанныйОбъект"; 
	
	КонецЕсли;    
	
	ЭтоБухгалтерскаяОрганизация = ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Сотрудник.ГоловнаяОрганизация);
	ЭтоУОС = ИКТ_ЗП_УОС.ЭтоУОС(Сотрудник.ГоловнаяОрганизация);
	
	Если ЭтоУОС Тогда
		
		Элемент = Элементы.Найти("ГруппаРеквизитыУОС"); 
		Если Элемент = Неопределено Тогда
			ГруппаУОС = ЭтаФорма.Элементы.Добавить("ГруппаРеквизитыУОС", Тип("ГруппаФормы"), Элементы.ГруппаДатаРожденияПолИННСНИЛС);
			ГруппаУОС.Вид = ВидГруппыФормы.ОбычнаяГруппа;	
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_ДолжностьS"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ДолжностьS", Тип("ПолеФормы"), ГруппаУОС);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТекущаяДолжностьПоШтатномуРасписанию.Ссылка";
			НовыйЭлемент.Заголовок = "Должность S";
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		Иначе                     
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ДолжностьS",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_АдминистративныйРуководительАР"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_АдминистративныйРуководительАР", Тип("ПолеФормы"), ГруппаУОС);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТекущаяДолжностьПоШтатномуРасписанию.ИКТ_АдминистративныйРуководительАР";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_АдминистративныйРуководительАР",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_ФункциональныйРуководительФР"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ФункциональныйРуководительФР", Тип("ПолеФормы"), ГруппаУОС);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТекущаяДолжностьПоШтатномуРасписанию.ИКТ_ФункциональныйРуководительФР";  
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ФункциональныйРуководительФР",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_ВышестоящийРуководительВР"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ВышестоящийРуководительВР", Тип("ПолеФормы"), ГруппаУОС);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТекущаяДолжностьПоШтатномуРасписанию.ИКТ_ВышестоящийРуководительВР";  
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ВышестоящийРуководительВР",
			"Видимость",
			Истина);
		КонецЕсли;
				
	Иначе             
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ДолжностьS",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_АдминистративныйРуководительАР",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ФункциональныйРуководительФР",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ВышестоящийРуководительВР",
		"Видимость",
		Ложь);
				
	КонецЕсли;  
	
	Элемент = Элементы.Найти("ИКТ_СвязанныйСотрудник"); 
	
	Если Элемент = Неопределено Тогда  
	
		Если ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС Тогда
		
//{{MRG[ <-> ]
			СвязанныйСотрудник = ИКТ_ЗП_УОС.ПолучитьСвязанныйОбъект(Сотрудник.ГоловнаяОрганизация, Сотрудник.Ссылка);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			СвязанныйСотрудник = ИКТ_РаботаСУОС.ПолучитьСвязанныйОбъект(Сотрудник.ГоловнаяОрганизация, Сотрудник.Ссылка);
//}}MRG[ <-> ]
		
			Если СвязанныйСотрудник <> Неопределено Тогда
			
				НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СвязанныйСотрудник", Тип("КнопкаФормы"), Элементы.ФИОНомер);
				НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка; 
				НовыйЭлемент.Заголовок = СтрШаблон("%1 %2", ?(ЭтоУОС, "ЮОС", "УОС"), СвязанныйСотрудник);
				НовыйЭлемент.ИмяКоманды = "ОткрытьСвязанныйОбъект";
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"ИКТ_СвязанныйСотрудник",
	"Видимость",
	ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС);
	
	ИКТ_RequestСерверПривилегированный.ИКТ_ДобавитьЭлементыСостоянияРеквестНаФорму(ЭтаФорма, Элементы.СписокГруппСотрудниковГруппа); 	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере(); 

КонецПроцедуры

&НаКлиенте
Процедура ГоловнаяОрганизацияПриИзменении(Элемент)
	ДобавитьРеквизитыНаФорму(); 
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьСвязанныйОбъект()
		
	СвязанныйОбъект = ПолучитьСвязанныйОбъект();    
	
	ПараметрыФормы = Новый Структура("Ключ", СвязанныйОбъект); 
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);

КонецПроцедуры    

&НаСервере
Функция ПолучитьСвязанныйОбъект()

	Возврат ИКТ_ЗП_УОС.ПолучитьСвязанныйОбъект(Сотрудник.ГоловнаяОрганизация, Сотрудник.Ссылка); 

КонецФункции

&НаСервере
Процедура ИКТ_ДобавитьКнопкиПропуска()
	
	НовоеПодменю = Элементы.Добавить("ПодменюПропуск", Тип("ГруппаФормы"), ЭтаФорма.КоманднаяПанель);
	НовоеПодменю.Заголовок = "Пропуск";
	НовоеПодменю.Вид = ВидГруппыФормы.Подменю;
	
	НоваяКомандаВыдатьПропуск = ЭтаФорма.Команды.Добавить("ВыдатьПропуск");
	НоваяКомандаВыдатьПропуск.Действие = "ИКТ_ВыдатьПропускСотруднику";
	НоваяКнопкаВыдатьПропуск = ЭтаФорма.Элементы.Добавить("КнопкаВыдатьПропуск",Тип("КнопкаФормы"),НовоеПодменю);
	НоваяКнопкаВыдатьПропуск.Вид=ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопкаВыдатьПропуск.ИмяКоманды = "ВыдатьПропуск";
	НоваяКнопкаВыдатьПропуск.Заголовок = "Выдать пропуск"; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_Пропуска.IDПропуска КАК IDПропуска
	|ИЗ
	|	РегистрСведений.ИКТ_Пропуска КАК ИКТ_Пропуска
	|ГДЕ
	|	ИКТ_Пропуска.Сотрудник = &СотрудникСсылка
	|	И ИКТ_Пропуска.Действует = &Действует";
	Запрос.УстановитьПараметр("СотрудникСсылка",Сотрудник.Ссылка);
	Запрос.УстановитьПараметр("Действует",Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		НоваяКнопкаВыдатьПропуск.Заголовок = "Код пропуска";
	КонецЕсли;
	
	НоваяКомандаЗаблокироватьПропуск = ЭтаФорма.Команды.Добавить("ЗаблокироватьПропуск");
	НоваяКомандаЗаблокироватьПропуск.Действие = "ИКТ_ЗаблокироватьПропускСотруднику";
	НоваяКнопкаЗаблокироватьПропуск = ЭтаФорма.Элементы.Добавить("КнопкаЗаблокироватьПропуск",Тип("КнопкаФормы"),НовоеПодменю);
	НоваяКнопкаЗаблокироватьПропуск.Вид=ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопкаЗаблокироватьПропуск.ИмяКоманды = "ЗаблокироватьПропуск";
	НоваяКнопкаЗаблокироватьПропуск.Заголовок = "Заблокировать пропуск";
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ВыдатьПропускСотрудникуНаСервере()	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_Пропуска.ЗначениеКарты КАК ЗначениеКарты,
	|	ИКТ_Пропуска.IDПропуска КАК IDПропуска,
	|	ИКТ_Пропуска.ФорматированноеЗначениеКарты КАК ФорматированноеЗначениеКарты
	|ИЗ
	|	РегистрСведений.ИКТ_Пропуска КАК ИКТ_Пропуска
	|ГДЕ
	|	ИКТ_Пропуска.Сотрудник = &СотрудникСсылка
	|	И ИКТ_Пропуска.Действует = &Действует";
	Запрос.УстановитьПараметр("СотрудникСсылка",Сотрудник.Ссылка);
	Запрос.УстановитьПараметр("Действует",Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Запрос.УстановитьПараметр("СотрудникСсылка",Справочники.Сотрудники.ПустаяСсылка());
		Запрос.УстановитьПараметр("Действует",Ложь);
		РезЗапросаСвободныеПропуска = Запрос.Выполнить();
		
		Если Не РезЗапросаСвободныеПропуска.Пустой() Тогда
			Выборка = РезЗапросаСвободныеПропуска.Выбрать();
			Выборка.Следующий();
			ЗаписьДоступСКУД = ИКТ_СКУД.НайтиЗаписьСправочникаСКУД(Сотрудник.Ссылка);
			Если ЗаписьДоступСКУД = Неопределено Тогда		
				ЗаписьДоступСКУД = ИКТ_СКУД.ЗаписатьСотрудникаВСправочникИТК_ДоступСКУД(Сотрудник.Ссылка);
			КонецЕсли;
				
			ИКТ_СКУД.СоздатьПропускДляСотрудника(Выборка.ЗначениеКарты,Выборка.ФорматированноеЗначениеКарты,Сотрудник.Ссылка,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьДоступСКУД,"IDСотрудника"));
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не найдено свободных пропусков!");		
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Код пропуска сотрудника № %1", Формат(РезультатЗапроса.Выгрузить()[0].ЗначениеКарты, "ЧГ=0")));
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ИКТ_ВыдатьПропускСотруднику(Команда)	
	ИКТ_ВыдатьПропускСотрудникуНаСервере();			
КонецПроцедуры

&НаСервере
Процедура ИКТ_ЗаблокироватьПропускСотрудникуНаСервере()	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_Пропуска.ЗначениеКарты КАК ЗначениеКарты,
	|	ИКТ_Пропуска.IDПропуска КАК IDПропуска
	|ИЗ
	|	РегистрСведений.ИКТ_Пропуска КАК ИКТ_Пропуска
	|ГДЕ
	|	ИКТ_Пропуска.Сотрудник.Ссылка = &СотрудникСсылка
	|	И ИКТ_Пропуска.Действует = &Действует";
	Запрос.УстановитьПараметр("СотрудникСсылка",Сотрудник.Ссылка);
	Запрос.УстановитьПараметр("Действует",Истина);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет действующих пропусков у сотрудника.");
		Возврат
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Попытка
		ЗаписьДоступСКУД = ИКТ_СКУД.НайтиЗаписьСправочникаСКУД(Сотрудник.Ссылка);
		Если ЗаписьДоступСКУД = Неопределено Тогда		
			ЗаписьДоступСКУД = ИКТ_СКУД.ЗаписатьСотрудникаВСправочникИТК_ДоступСКУД(Сотрудник.Ссылка);
		КонецЕсли;
		ИКТ_СКУД.ОтвязатьПропускОтСотрудника(Выборка.ЗначениеКарты,Выборка.IDПропуска,Сотрудник.Ссылка,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьДоступСКУД,"IDСотрудника"));
		
		Элементы.КнопкаВыдатьПропуск.Заголовок = "Выдать пропуск";
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());		
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ЗаблокироватьПропускСотруднику(Команда)	
	ИКТ_ЗаблокироватьПропускСотрудникуНаСервере();				
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквест()
	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере()
	
	Если ЗначениеЗаполнено(Сотрудник.Ссылка) Тогда
		
		Если Сотрудник.ГоловнаяОрганизация.ИКТ_УУ Тогда 
			
			Результат = ИКТ_RequestСерверПривилегированный.ПолучитьСоостояниеОбменаСРеквестПоОбъекту(Сотрудник.Ссылка);
			
			Если Не ЗначениеЗаполнено(Результат.Период) Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Не выполнялся";
				
			ИначеЕсли Результат.Ошибка = Ложь и Результат.Выгружен = Ложь Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Объект в очереди на выгрузку";  
				
			ИначеЕсли Результат.Ошибка = Истина Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = СтрШаблон("Ошибка обмена. Дата выгрузки %1", Результат.Период);
				
			Иначе 
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен выполнен";
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен будет выполнен после записи объекта";
		
	КонецЕсли;
	
КонецПроцедуры


