////////////////////////////////////////////////////////////////////////////////
// Обработчики событий.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Производит "зеркалирование" структуры проектных задач, заданных массивом документов
//  Проектная задача, на иерархию справочника Проекты.
//
// Параметры:
//  Источник - ДокументОбъект.упоПроектнаяЗадача - проектная задача.
//  Отказ	 - Булево							 - флаг отказа от проведения документа.
//
Процедура упоПроектнаяЗадача_ПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("НеЗеркалировать") 
		И Источник.ДополнительныеСвойства.НеЗеркалировать Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Отказ = упоПроектыИЗадачиСервер.СоздатьОбновитьСвязанныйЭлементСправочникаПроекты(Источник);
	
КонецПроцедуры

#КонецОбласти