////////////////////////////////////////////////////////////////////////////////
// Во ввод на основании и в тип параметра команды "Создать задание"
// добавлены документы подсистемы "упоИнтеграцияEPM".
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийСервер.ОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
	ПроверитьЗаполнениеОбъекта(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	ЗаполнитьДополнительныеСвойстваОбъекта();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПроектнуюЗадачуВПодчиненныхЗаданиях();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗадачиДляСозданияПоручения = Неопределено;
		Если ДанныеЗаполнения.Свойство("ДанныеПроектнойЗадачиДляСозданияПоручения", ДанныеЗадачиДляСозданияПоручения) Тогда
			
			ЗаполнитьПоручениеПоДаннымПроектнойЗадачи(ДанныеЗадачиДляСозданияПоручения);
			
			Если ДанныеЗаполнения.Свойство("Исполнитель") И ДанныеЗаполнения.Свойство("ЭтоОсновноеЗадание") Тогда
				
				Исполнитель = ДанныеЗаполнения.Исполнитель;
				ЭтоОсновноеЗаданиеПроектнойЗадачи = ДанныеЗаполнения.ЭтоОсновноеЗадание;
				Если ДанныеЗаполнения.ВидЗаданияПодразделению = Неопределено Тогда
					ЭтоЗаданиеПодразделению = Ложь;
				Иначе
					ЭтоЗаданиеПодразделению = Истина;
					ВидЗаданияПодразделению = ДанныеЗаполнения.ВидЗаданияПодразделению;
				КонецЕсли;
				Если ДанныеЗадачиДляСозданияПоручения.Свойство("ЭтоЗаданиеИсполнителяПроектнойЗадачи") Тогда
					ЭтоЗаданиеИсполнителяПроектнойЗадачи = ДанныеЗадачиДляСозданияПоручения.ЭтоЗаданиеИсполнителяПроектнойЗадачи;
				КонецЕсли;
				
				СсылкаНаПроектнуюЗадачу = ДанныеЗадачиДляСозданияПоручения.ОбъектБазы;
				ЗаполнитьРольИПодразделениеПоУмолчанию(СсылкаНаПроектнуюЗадачу);
				
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("Основание") Тогда
			
			Если ДанныеЗаполнения.Свойство("ЭтоПроектноеРешениеПроектнойЗадачи") 
				И ДанныеЗаполнения.ЭтоПроектноеРешениеПроектнойЗадачи Тогда
				СтруктураЗаполнения = ПолучитьСтруктуруЗаполненияПроектногоРешенияПроектнойЗадачи(ДанныеЗаполнения.Основание);
			Иначе
				СтруктураЗаполнения = ПолучитьСтруктуруЗаполнения(ДанныеЗаполнения.Основание);
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураЗаполнения); 
			
		ИначеЕсли ДанныеЗаполнения.Свойство("ПроектнаяЗадача") И Не ДанныеЗаполнения.Свойство("Проект") Тогда
			
			ПроектЗадачи = упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(ДанныеЗаполнения.ПроектнаяЗадача, "упоКорневойПроект");
			Если ЗначениеЗаполнено(ПроектЗадачи) Тогда
				ДанныеЗаполнения.Вставить("Проект", ПроектЗадачи);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			
		Иначе
			
			ИсключаемоеСвойство = "";
			Если ДанныеЗаполнения.Свойство("АвторСотрудник")Тогда
				ИсключаемоеСвойство = "АвторСотрудник";
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , ИсключаемоеСвойство);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		ДанныеЗадачи = упоЗадания.ПолучитьДанныеПоПроектнойЗадачеДляЗаполненияПоручения(ДанныеЗаполнения);
		ЗаполнитьПоручениеПоДаннымПроектнойЗадачи(ДанныеЗадачи);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АвторСотрудник) Тогда
		АвторСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
		Если Контролеры.Количество() = 0 Тогда
			СтрокаКонтролер = Контролеры.Добавить();
			СтрокаКонтролер.Контролер = АвторСотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидЗадания) Тогда
		ВидЗадания = Справочники.упоВидыЗаданий.Поручение;
	КонецЕсли;
	
	Если ВидЗадания = Справочники.упоВидыЗаданий.Согласование И НЕ ЗначениеЗаполнено(ВидСогласования)Тогда
		ВидСогласования = Перечисления.упоВидыСогласований.Параллельное;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтоОсновноеЗаданиеПроектнойЗадачи = Ложь;
	АвторСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	Исполнитель = Справочники.упоСотрудники.ПустаяСсылка();
	
	Если ЭтоОповещение Тогда
		ЭтотОбъект.ЭтоОповещение = Ложь;
	КонецЕсли;
	
	Контролеры.Очистить();
	СтрокаКонтролер = Контролеры.Добавить();
	СтрокаКонтролер.Контролер = АвторСотрудник;
	
	Для Каждого СтрокаСогласующий Из СогласующиеЛица Цикл
		СтрокаСогласующий.Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.ПустаяСсылка");
	КонецЦикла;
	
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Справочники.Проекты) Тогда
		Проект = Справочники.Проекты.ПустаяСсылка();
		ПроектнаяЗадача = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Документы.упоПроектнаяЗадача) Тогда
		ПроектнаяЗадача = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ВидЗадания = Справочники.упоВидыЗаданий.Согласование Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Исполнитель");
		ПроверяемыеРеквизиты.Добавить("ВидСогласования"); 	
	КонецЕсли;	
	
	НужноУказатьПроектнуюЗадачу = Ложь;
	Если ВидЗадания = Справочники.упоВидыЗаданий.Обсуждение Тогда
		НужноУказатьПроектнуюЗадачу = упоЗаданияСерверПовтИсп.ПроверитьОбязательностьУказанияПроектнойЗадачиВОбсуждении(Проект);
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Проект");
	КонецЕсли;
	Если НЕ НужноУказатьПроектнуюЗадачу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПроектнаяЗадача");
	КонецЕсли;
	
	Если Не ЭтоЗаданиеПодразделению Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидЗаданияПодразделению");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	Если ЗначениеЗаполнено(Проект) Тогда
		СтрокаТаб.ЗначениеДоступа = Проект;
	Иначе
		СтрокаТаб.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьПоручениеПоДаннымПроектнойЗадачи(ДанныеПроектнойЗадачи)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПроектнойЗадачи);
	Если Не ЗначениеЗаполнено(АвторСотрудник) Тогда
		АвторСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидЗадания) Тогда
		ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение");
	КонецЕсли;
	Если Не ДанныеПроектнойЗадачи.Свойство("ЭтоЗаданиеИсполнителяПроектнойЗадачи") Тогда
		ЭтоЗаданиеИсполнителяПроектнойЗадачи = Истина;
	КонецЕсли;
	
	Если ДанныеПроектнойЗадачи.Свойство("Контролер") И ЗначениеЗаполнено(ДанныеПроектнойЗадачи.Контролер) Тогда
		
		Если Не ЗначениеЗаполнено(АвторСотрудник) Тогда
			АвторСотрудник = ДанныеПроектнойЗадачи.Контролер;
		КонецЕсли;
		
		СтрокаКонтролер = Контролеры.Добавить();
		СтрокаКонтролер.Контролер = ДанныеПроектнойЗадачи.Контролер;
		
	КонецЕсли;
	
	ЗаполнитьРольИПодразделениеПоУмолчанию(ДанныеПроектнойЗадачи.ОбъектБазы);
	
КонецПроцедуры

Процедура ЗаполнитьРольИПодразделениеПоУмолчанию(Задача)
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат;
	КонецЕсли;
	
	РольИПодразделениеИсполнителя = упоРесурсыИРолиСервер.РольПодразделениеТрудовогоРесурсаПоЗадаче(Исполнитель,
		Задача);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РольИПодразделениеИсполнителя);
	
КонецПроцедуры

Функция ПолучитьСтруктуруЗаполнения(ПараметрКоманды)

	Результат = Новый Структура("Проект, ПроектнаяЗадача, ПортфельПроекта");
	ВозможныеРеквизиты = Новый Структура("Проект, ПроектнаяЗадача, ПортфельПроекта, ПортфельПроектов");
	
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить("ПортфельПроектов", "ПортфельПроекта");
	
	// Заполнение из параметра команды.
	Для Каждого Реквизит Из ВозможныеРеквизиты Цикл
		Ключ = СоответствиеРеквизитов.Получить(Реквизит.Ключ);
		Если Ключ = Неопределено Тогда
			Ключ = Реквизит.Ключ;
		КонецЕсли;
		Попытка
			Результат.Вставить(Ключ, ПараметрКоманды[Реквизит.Ключ]);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Проекты") Тогда
		Результат.Вставить("Проект", ПараметрКоманды);
	КонецЕсли;
	
	Если ТипЗнч(Результат.ПроектнаяЗадача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Результат.Вставить("ПроектнаяЗадача", 
			упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(Результат.ПроектнаяЗадача));
		Результат.Вставить("ОписаниеРезультата", 
			упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(Результат.ПроектнаяЗадача, "ОписаниеРезультата"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Проект) И Не ЗначениеЗаполнено(Результат.ПортфельПроекта) Тогда
		Результат.Вставить("ПортфельПроекта", 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Проект, "ПортфельПроектов"));
	КонецЕсли;
	
	Результат.Вставить("АвторСотрудник", ПараметрыСеанса.упоТекущийСотрудник);
	Результат.Вставить("ОбъектБазы", ПараметрКоманды);
	
	Возврат Результат;

КонецФункции

Функция ПолучитьСтруктуруЗаполненияПроектногоРешенияПроектнойЗадачи(Основание)

	Структура = Новый Структура;

	Структура.Вставить("ВидЗадания", ПредопределенноеЗначение("Справочник.упоВидыЗаданий.ПроектноеРешение"));
	Структура.Вставить("Проект", Основание.Проект);
	Структура.Вставить("ПортфельПроекта", Основание.Проект.ПортфельПроектов);
	Структура.Вставить("ПроектнаяЗадача", упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(Основание));
	Структура.Вставить("АвторСотрудник", ПараметрыСеанса.упоТекущийСотрудник);
	Структура.Вставить("ОбъектБазы", Основание);
	
	Возврат Структура;

КонецФункции

Процедура ЗаполнитьДополнительныеСвойстваОбъекта()
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписанныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Проект, ПроектнаяЗадача, СогласующиеЛица");
	
	Если ЗначениеЗаполнено(СогласующиеЛица) Тогда
		
		Если ВидСогласования = Перечисления.упоВидыСогласований.Последовательное 
			И ЗаписанныеРеквизиты.СогласующиеЛица.Пустой() Тогда
			
			мСогласующиеЛица = Новый Массив;
			мСогласующиеЛица.Добавить(СогласующиеЛица[0].СогласующееЛицо);
			ДополнительныеСвойства.Вставить("НовыеСогласующиеЛица", мСогласующиеЛица);
			
		ИначеЕсли ВидСогласования = Перечисления.упоВидыСогласований.Параллельное Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	упоЗаданияСогласующиеЛица.СогласующееЛицо КАК СогласующееЛицо
			|ПОМЕСТИТЬ СогласующиеЛицаЗапись
			|ИЗ
			|	Справочник.упоЗадания.СогласующиеЛица КАК упоЗаданияСогласующиеЛица
			|ГДЕ
			|	упоЗаданияСогласующиеЛица.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СогласующиеЛица.СогласующееЛицо КАК СогласующееЛицо
			|ПОМЕСТИТЬ СогласующиеЛицаТекущие
			|ИЗ
			|	&СогласующиеЛица КАК СогласующиеЛица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СогласующиеЛицаТекущие.СогласующееЛицо КАК СогласующееЛицо
			|ИЗ
			|	СогласующиеЛицаТекущие КАК СогласующиеЛицаТекущие
			|		ЛЕВОЕ СОЕДИНЕНИЕ СогласующиеЛицаЗапись КАК СогласующиеЛицаЗапись
			|		ПО СогласующиеЛицаТекущие.СогласующееЛицо = СогласующиеЛицаЗапись.СогласующееЛицо
			|ГДЕ
			|	СогласующиеЛицаЗапись.СогласующееЛицо ЕСТЬ NULL";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("СогласующиеЛица", СогласующиеЛица);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				мСогласующиеЛица = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СогласующееЛицо");
				ДополнительныеСвойства.Вставить("НовыеСогласующиеЛица", мСогласующиеЛица);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Сохраним текущие значения проекта и проектной задачи, если они изменились.
	// Изменим их у подчиненных Заданий (при записи).
	ДополнительныеСвойства.Вставить("текПроект", ЗаписанныеРеквизиты.Проект);
	ДополнительныеСвойства.Вставить("текПроектнаяЗадача", ЗаписанныеРеквизиты.ПроектнаяЗадача);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеОбъекта(Отказ)
	
	ПроверитьОдноОсновноеЗаданиеВида(Отказ);
	
	ПроверитьПометкуУдаления(Отказ);
	
КонецПроцедуры

// Установка пометки удаления доступна полноправному пользователю и пользователю 
// с установленным текущим сотрудником, от имени которого было выдано задание (АвторСотрудник задания).
//
Процедура ПроверитьПометкуУдаления(Отказ)
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	Если АвторСотрудник = ПараметрыСеанса.упоТекущийСотрудник Тогда
		Возврат;
	КонецЕсли;
	
	ПометкаУдаленияВБазе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
	Если ПометкаУдаления = ПометкаУдаленияВБазе Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Изменение пометки на удаление доступно сотруднику %1.'"),
		АвторСотрудник);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	Отказ = Истина;
	
КонецПроцедуры

// У проектной задачи может быть только одно основное задание одного вида.
//
Процедура ПроверитьОдноОсновноеЗаданиеВида(Отказ)
	
	Если Не ЭтоОсновноеЗаданиеПроектнойЗадачи Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	упоЗадания.Ссылка,
	|	упоЗадания.Исполнитель
	|ИЗ
	|	РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК упоЗадания
	|		ПО упоЗаданияСтатусыСрезПоследних.Задание = упоЗадания.Ссылка
	|ГДЕ
	|	упоЗадания.ЭтоОсновноеЗаданиеПроектнойЗадачи
	|	И упоЗадания.ВидЗадания = &ВидЗадания
	|	И упоЗадания.ПроектнаяЗадача = &ПроектнаяЗадача
	|	И НЕ упоЗадания.ПометкаУдаления
	|	И НЕ упоЗадания.Ссылка = &Ссылка
	|	И НЕ упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Отменено)");
	Запрос.УстановитьПараметр("ВидЗадания", ВидЗадания);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	ШаблонТекста = НСтр("ru = 'У проектной задачи ""%1"" уже существует основное задание с видом ""%2""'");
	МассивСтрок.Добавить(СтрШаблон(ШаблонТекста, ПроектнаяЗадача, ВидЗадания));
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонТекста = НСтр("ru = '""%1"" (исполнитель %2)'");
		МассивСтрок.Добавить(СтрШаблон(ШаблонТекста, Выборка.Ссылка, Выборка.Исполнитель));
	КонецЦикла;
	ОбщегоНазначения.СообщитьПользователю(СтрСоединить(МассивСтрок, Символы.ПС));
	
	Отказ = Истина;
	
КонецПроцедуры

Процедура ОбновитьПроектнуюЗадачуВПодчиненныхЗаданиях()
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	НадоОбновлятьПодчиненные = Ложь;
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		НадоОбновлятьПодчиненные = Проект <> ДополнительныеСвойства.текПроект
			Или ПроектнаяЗадача <> ДополнительныеСвойства.текПроектнаяЗадача;
	КонецЕсли;
	Если Не НадоОбновлятьПодчиненные Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	упоЗадания.Ссылка
	|ИЗ
	|	Справочник.упоЗадания КАК упоЗадания
	|ГДЕ
	|	упоЗадания.Ссылка В ИЕРАРХИИ(&Ссылка)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Вызов из обработчика ПриЗаписи. Неявная транзакция.
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = Ссылка Тогда
			Продолжить;
		КонецЕсли;
		ЗаданиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаданиеОбъект.Проект = Проект;
		ЗаданиеОбъект.ПроектнаяЗадача = ПроектнаяЗадача;
		ЗаданиеОбъект.Записать();
	КонецЦикла;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ()
		И ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУПФ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУПФСервер");
		МодульИнтеграции.СоздатьОбновитьСвязанныйЭлементСправочникаЗаписиКалендаряСотрудника(ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли