
&ИзменениеИКонтроль("ДобавитьПКО_Документ_ОтчетОРозничныхПродажах_Получение")
Процедура ИКТ_ДобавитьПКО_Документ_ОтчетОРозничныхПродажах_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Документ_ОтчетОРозничныхПродажах_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Документы.ОтчетОРозничныхПродажах;
	ПравилоКонвертации.ОбъектФормата                = "Документ.ОтчетОРозничныхПродажах"; //@NON-NLS-1
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных      = "ОтложеннаяОбработка_ОтчетОРозничныхПродажах";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	#Вставка
	ПространствоИмен = "http://v8.1c.ru/edi/edi_ext_ikt/EnterpriseData/1.20";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации,ПространствоИмен);
	#КонецВставки
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Валюта",             "", 1);
	ДобавитьПКС(СвойстваШапки, "ВидЦены",            "ТипЦен", , "Справочник_ТипыЦен");
	ДобавитьПКС(СвойстваШапки, "Дата",               "Дата");
	ДобавитьПКС(СвойстваШапки, "КассаККМ",           "КассаККМ", , "Справочник_КассыККМ_Получение");
	ДобавитьПКС(СвойстваШапки, "КассоваяСмена",      "КассоваяСмена", , "Документ_КассоваяСменаОткрытие_Получение");
	ДобавитьПКС(СвойстваШапки, "Комментарий",        "Комментарий");
	ДобавитьПКС(СвойстваШапки, "НалогообложениеНДС", "", 1);
	ДобавитьПКС(СвойстваШапки, "Номер",              "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",        "Организация", , "Справочник_Организации_Получение");
	ДобавитьПКС(СвойстваШапки, "Ответственный",      "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "Подразделение",      "Подразделение", , "Справочник_Подразделения_Получение");
	ДобавитьПКС(СвойстваШапки, "Проведен",           "", 1);
	ДобавитьПКС(СвойстваШапки, "Склад",              "Склад", , "Справочник_Склады_Получение");
	ДобавитьПКС(СвойстваШапки, "СуммаДокумента",     "", 1);
	ДобавитьПКС(СвойстваШапки, "ЦенаВключаетНДС",    "СуммаВключаетНДС");

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "НачислениеБонусныхБаллов", "НачислениеБонусныхБаллов");
	ДобавитьПКС(СвойстваТЧ, "БонуснаяПрограммаЛояльности", "ПрограммаЛояльности", , "Справочник_ПрограммыЛояльности");
	ДобавитьПКС(СвойстваТЧ, "ДатаНачисления",              "ДатаНачисления");
	ДобавитьПКС(СвойстваТЧ, "ДатаСписания",                "ДатаСписания");
	ДобавитьПКС(СвойстваТЧ, "Партнер",                     "Контрагент", , "Справочник_ПартнерИзКонтрагента_Получение");
	ДобавитьПКС(СвойстваТЧ, "СуммаБонусныхБаллов",         "СуммаБонусныхБаллов");

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ОплатаБонуснымиБаллами",   "ОплатаБонуснымиБаллами");
	ДобавитьПКС(СвойстваТЧ, "БонуснаяПрограммаЛояльности", "ПрограммаЛояльности", , "Справочник_ПрограммыЛояльности");
	ДобавитьПКС(СвойстваТЧ, "ДатаОплаты",                  "", 1);
	ДобавитьПКС(СвойстваТЧ, "Партнер",                     "Контрагент", , "Справочник_ПартнерИзКонтрагента_Получение");
	ДобавитьПКС(СвойстваТЧ, "СуммаБонусныхБаллов",         "СуммаБонусныхБаллов");

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "АкцизныеМарки",            "");
	ДобавитьПКС(СвойстваТЧ, "АкцизнаяМарка", "", 1);

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ОплатаПлатежнымиКартами",  "");
	ДобавитьПКС(СвойстваТЧ, "ВидОплаты",             "", 1, "ТипыПлатежнойСистемыККТ");
	ДобавитьПКС(СвойстваТЧ, "НомерПлатежнойКарты",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",                 "", 1);
	ДобавитьПКС(СвойстваТЧ, "ЭквайринговыйТерминал", "", 1);
	#Вставка
	//26.03.25 - 6360 фикс бага с выгрузкой договоров
	ДобавитьПКС(СвойстваТЧ, "ДоговорПодключения",	 "ДоговорЭквайринга", 1, "Справочник_ДоговорыЭквайринга_Получение",ПространствоИмен);
	#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ПодарочныеСертификаты",    "");
	ДобавитьПКС(СвойстваТЧ, "ПодарочныйСертификат", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",                "", 1);

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "Товары",                   "");
	ДобавитьПКС(СвойстваТЧ, "Количество",          "", 1);
	ДобавитьПКС(СвойстваТЧ, "КоличествоУпаковок",  "", 1);
	ДобавитьПКС(СвойстваТЧ, "Номенклатура",        "", 1, "Справочник_Номенклатура_Получение");
	ДобавитьПКС(СвойстваТЧ, "ПроцентРучнойСкидки", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Серия",               "", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "СтавкаНДС",           "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",               "", 1);
	ДобавитьПКС(СвойстваТЧ, "СуммаНДС",            "", 1);
	ДобавитьПКС(СвойстваТЧ, "СуммаРучнойСкидки",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "Упаковка",            "", 1, "Справочник_Упаковки");
	ДобавитьПКС(СвойстваТЧ, "Характеристика",      "", 1, "Справочник_ХарактеристикиНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "Цена",                "", 1);

	ПравилоКонвертации.ПоляПоиска.Добавить("Дата,Номер");
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПриКонвертацииДанныхXDTO")
Процедура ИКТ_ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	ПолученныеДанные.Проведен = Истина;

	Номер = ДанныеXDTO.КлючевыеСвойства.Номер;
	Если СтрНайти(Номер,"-") = 0 Тогда
		ПолученныеДанные.Номер = "";
	КонецЕсли;

	ДобавитьВалютуВДопСвойства(ПолученныеДанные, ДанныеXDTO);
	Если НЕ ЗначениеЗаполнено(ПолученныеДанные.ВидЦены) И ЗначениеЗаполнено(ПолученныеДанные.Склад) Тогда
		ПолученныеДанные.ВидЦены = ПолученныеДанные.Склад.РозничныйВидЦены;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПолученныеДанные.ВидЦены) И НЕ КомпонентыОбмена.ПараметрыКонвертации.ВидыЦенНоменклатуры = Неопределено 
		И КомпонентыОбмена.ПараметрыКонвертации.ВидыЦенНоменклатуры.Количество() > 0 Тогда
		ПолученныеДанные.ВидЦены = КомпонентыОбмена.ПараметрыКонвертации.ВидыЦенНоменклатуры[0].Значение; 
	КонецЕсли;

	ЗаполнитьНалогообложениеНДСПоПолученнымДанным(КомпонентыОбмена, ПолученныеДанные, ДанныеXDTO, Ложь);

	ЗагрузитьДополнительныеРеквизиты(ПолученныеДанные, ДанныеXDTO, КомпонентыОбмена);

	ПравилаЗаполнения = Новый Соответствие;
	ПравилаЗаполнения.Вставить("Номенклатура",  "Номенклатура");
	ПравилаЗаполнения.Вставить("Количество",    "Количество");
	ПравилаЗаполнения.Вставить("Сумма",         "Сумма");
	ПравилаЗаполнения.Вставить("Цена",          "Цена");
	ПравилаЗаполнения.Вставить("СтавкаНДС",     "СтавкаНДС");
	ПравилаЗаполнения.Вставить("СуммаНДС",      "СуммаНДС");
	ПравилаЗаполнения.Вставить("ПроцентСкидки", "ПроцентРучнойСкидки");
	ПравилаЗаполнения.Вставить("СуммаСкидки",   "СуммаРучнойСкидки");
	Если ЗначениеФО("ИспользоватьХарактеристикиНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Характеристика",     "Характеристика");
	КонецЕсли;
	Если ЗначениеФО("ИспользоватьУпаковкиНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Упаковка",           "Упаковка");
		ПравилаЗаполнения.Вставить("КоличествоУпаковок", "КоличествоУпаковок");
	КонецЕсли;
	Если ЗначениеФО("ИспользоватьСерииНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Серия",              "Серия");
	КонецЕсли;

	// Товары 
	МассивСтрокТовары = Новый Массив;
	Если ДанныеXDTO.Свойство("Товары")
		И ЗначениеЗаполнено(ДанныеXDTO.Товары) Тогда

		Для Каждого Строка Из ДанныеXDTO.Товары Цикл
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);

			Если СтруктураДанныхСтроки.Свойство("СтавкаНДС") И ЗначениеЗаполнено(СтруктураДанныхСтроки.СтавкаНДС) Тогда
				СтруктураДанныхСтроки.СтавкаНДС = СправочникПоПеречислениюСтавкиНДС(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДС);
			КонецЕсли;

			Если НЕ СтруктураДанныхСтроки.Свойство("КоличествоУпаковок") Тогда
				СтруктураДанныхСтроки.Вставить("КоличествоУпаковок", СтруктураДанныхСтроки.Количество);
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("Сумма") Тогда
				СтруктураДанныхСтроки.Вставить("Цена", СтруктураДанныхСтроки.Сумма / СтруктураДанныхСтроки.КоличествоУпаковок);
			КонецЕсли;

			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;

	СуммаДокумента = 0;

	Если ДанныеXDTO.Свойство("ТоварыПродажа")
		И ЗначениеЗаполнено(ДанныеXDTO.ТоварыПродажа) Тогда

		Для Каждого Строка Из ДанныеXDTO.ТоварыПродажа Цикл
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);

			Если СтруктураДанныхСтроки.Свойство("СтавкаНДС") И ЗначениеЗаполнено(СтруктураДанныхСтроки.СтавкаНДС) Тогда
				СтруктураДанныхСтроки.СтавкаНДС = СправочникПоПеречислениюСтавкиНДС(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДС);
			КонецЕсли;
			Если НЕ СтруктураДанныхСтроки.Свойство("КоличествоУпаковок") Тогда
				СтруктураДанныхСтроки.Вставить("КоличествоУпаковок", СтруктураДанныхСтроки.Количество);
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("Сумма") Тогда
				СтруктураДанныхСтроки.Вставить("Цена", СтруктураДанныхСтроки.Сумма / СтруктураДанныхСтроки.КоличествоУпаковок);
				СуммаДокумента = СуммаДокумента + СтруктураДанныхСтроки.Сумма;
			КонецЕсли;

			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;

	// Услуги загружаются в ТЧ Товары
	Если ДанныеXDTO.Свойство("Услуги")
		И ЗначениеЗаполнено(ДанныеXDTO.Услуги) Тогда

		Для Каждого Строка Из ДанныеXDTO.Услуги Цикл
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);

			Если СтруктураДанныхСтроки.Свойство("СтавкаНДС") И ЗначениеЗаполнено(СтруктураДанныхСтроки.СтавкаНДС) Тогда
				СтруктураДанныхСтроки.СтавкаНДС = СправочникПоПеречислениюСтавкиНДС(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДС);
			КонецЕсли;

			СтруктураДанныхСтроки.Вставить("КоличествоУпаковок", СтруктураДанныхСтроки.Количество);
			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);

			Если СтруктураДанныхСтроки.Свойство("Сумма") Тогда
				СуммаДокумента = СуммаДокумента + СтруктураДанныхСтроки.Сумма;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

	Если ДанныеXDTO.Свойство("ТоварыВозвратПродажи")И ЗначениеЗаполнено(ДанныеXDTO.ТоварыВозвратПродажи) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("СуммаДокумента", СуммаДокумента);
	ИначеЕсли ДанныеXDTO.Свойство("Сумма") И ЗначениеЗаполнено(ДанныеXDTO.Сумма) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("СуммаДокумента", ДанныеXDTO.Сумма);
	КонецЕсли;

	Если МассивСтрокТовары.Количество() > 0 Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Товары", МассивСтрокТовары);
	КонецЕсли;

	//Оплата платежными картами
	МассивСтрокОплатаПК = Новый Массив;

	Если ДанныеXDTO.Свойство("ОплатаПлатежнымиКартами")
		И ЗначениеЗаполнено(ДанныеXDTO.ОплатаПлатежнымиКартами) Тогда

		Для Каждого Строка Из ДанныеXDTO.ОплатаПлатежнымиКартами Цикл
			Если Строка.СуммаОплаты <= 0 Тогда
				Продолжить;
			КонецЕсли;
			СтруктураДанныхСтроки = Новый Структура;
			СтруктураДанныхСтроки.Вставить("Сумма", Строка.СуммаОплаты);
			СтруктураДанныхСтроки.Вставить("НомерПлатежнойКарты", Строка.НомерКарты);

#Удаление
			Если ЗначениеЗаполнено(Строка.ЭквайринговыйТерминал) Тогда
				спрЭквайринговыйТерминал = Строка.ЭквайринговыйТерминал;
				Если спрЭквайринговыйТерминал.Свойство("Номер") И Не Пустаястрока(спрЭквайринговыйТерминал.Номер) Тогда
					Инструкция = Новый Структура;
					Инструкция.Вставить("Значение", Строка.ЭквайринговыйТерминал);
					Инструкция.Вставить("ИмяПКО", "Справочник_ЭквайринговыеТерминалы_Получение");

					СтруктураДанныхСтроки.Вставить("ЭквайринговыйТерминал", Инструкция);
				КонецЕсли;
			КонецЕсли;
#КонецУдаления
#Вставка
//{[+] ИКТ №9642 (фрагмент ДОБАВЛЕН), Селиверстов Д.Н., 03.09.2025 13:00 
			Если ЗначениеЗаполнено(Строка.ЭквайринговыйТерминал) Тогда
				Инструкция = Новый Структура;
				Инструкция.Вставить("Значение", Строка.ЭквайринговыйТерминал);
				Инструкция.Вставить("ИмяПКО", "Справочник_ЭквайринговыеТерминалы_Получение");
				СтруктураДанныхСтроки.Вставить("ЭквайринговыйТерминал", Инструкция);
			КонецЕсли;
//[+]} ИКТ №9642
#КонецВставки

			Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.11") Тогда  
				СтруктураДанныхСтроки.Вставить("ВидОплаты", Строка.ТипыПлатежнойСистемыККТ);
			КонецЕсли;
			
			#Вставка
			//26.03.25 - 6360 фикс бага с выгрузкой договоров (
			Если Не ДанныеXDTO.ОплатаПлатежнымиКартами.Колонки.Найти("ДоговорЭквайринга") = Неопределено И ЗначениеЗаполнено(Строка.ДоговорЭквайринга) Тогда
				Инструкция = Новый Структура;
				Инструкция.Вставить("Значение", Строка.ДоговорЭквайринга);
				Инструкция.Вставить("ИмяПКО", "Справочник_ДоговорыЭквайринга_Получение");
				
				СтруктураДанныхСтроки.Вставить("ДоговорПодключения", Инструкция);
			ИначеЕсли Не ДанныеXDTO.ОплатаПлатежнымиКартами.Колонки.Найти("ДоговорЭквайрера") = Неопределено И ЗначениеЗаполнено(Строка.ДоговорЭквайрера) Тогда
				Инструкция = Новый Структура;
				Инструкция.Вставить("Значение", Строка.ДоговорЭквайрера);
				Инструкция.Вставить("ИмяПКО", "Справочник_ДоговорыЭквайринга_Получение");
				
				СтруктураДанныхСтроки.Вставить("ДоговорПодключения", Инструкция);
			КонецЕсли;
			//26.03.25 - 6360 фикс бага с выгрузкой договоров )
			#КонецВставки

			МассивСтрокОплатаПК.Добавить(СтруктураДанныхСтроки);

		КонецЦикла;

		ПолученныеДанные.ДополнительныеСвойства.Вставить("ОплатаПлатежнымиКартами", МассивСтрокОплатаПК);	
	КонецЕсли;

	//Подарочные сертификаты
	МассивСтрокПС = Новый Массив; 

	Если ДанныеXDTO.Свойство("ОплатаСертификатами")
		И ЗначениеЗаполнено(ДанныеXDTO.ОплатаСертификатами) Тогда

		Для каждого Строка Из ДанныеXDTO.ОплатаСертификатами Цикл
			СтруктураДанныхСтроки = Новый Структура;
			СтруктураДанныхСтроки.Вставить("Сумма", Строка.Сумма);

			Если ЗначениеЗаполнено(Строка.Штрихкод) Тогда
				// Готовим инструкцию для конвертации подарочного сертификата.
				Инструкция = Новый Структура;
				СтруктураПодарочногоСертификата = Новый Структура;
				СтруктураПодарочногоСертификата.Вставить("Штрихкод", Строка.Штрихкод);
				СтруктураПодарочногоСертификата.Вставить("МагнитныйКод", Строка.МагнитныйКод);
				СтруктураПодарочногоСертификата.Вставить("СерийныйНомер", Строка.СерийныйНомер);

				Инструкция.Вставить("ИмяПКО", "Справочник_ПодарочныеСертификаты");
				СтруктураПодарочногоСертификата.Вставить("ВидПодарочногоСертификата", Строка.ВидПодарочногоСертификата);

				Инструкция.Вставить("Значение", СтруктураПодарочногоСертификата);
				СтруктураДанныхСтроки.Вставить("ПодарочныйСертификат", Инструкция);
			КонецЕсли;
			МассивСтрокПС.Добавить(СтруктураДанныхСтроки);

		КонецЦикла;

		ПолученныеДанные.ДополнительныеСвойства.Вставить("ПодарочныеСертификаты", МассивСтрокПС);	
	КонецЕсли;

	Для Каждого СтрокаТЧ из ПолученныеДанные.ОплатаБонуснымиБаллами Цикл
		СтрокаТЧ.ДатаОплаты = ПолученныеДанные.Дата;
	КонецЦикла;

	// Штрихкоды упаковок.
	ЗагрузитьШтрихкодыУпаковок(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена, "АкцизныеМарки", "АкцизнаяМарка");
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПередЗаписьюПолученныхДанных")
Процедура ИКТ_ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	ЗаполнитьСкладПоУмолчанию(ПолученныеДанные, ДанныеИБ, КомпонентыОбмена);
	Для Каждого Строка Из ПолученныеДанные.Товары Цикл
		Строка.Партнер = Справочники.Партнеры.РозничныйПокупатель;
	КонецЦикла;

	// Подразделение
	ЗаполнитьПодразделениеПоУмолчанию(ПолученныеДанные, ДанныеИБ, КомпонентыОбмена, Истина);
	ЗагрузитьДополнительныеСведения(?(ДанныеИБ = Неопределено, ПолученныеДанные.ПолучитьСсылкуНового(), ДанныеИБ.Ссылка), 
	ПолученныеДанные.ДополнительныеСвойства, КомпонентыОбмена);

	// В случае наличия объекта в базе он и будет записан (а не ПолученныеДанные).
	// Шапка и табличная часть предварительно переносятся из ПолученныеДанные в ДанныеИБ:
	// шапка - в составе свойств из ПКС, табличная часть - полностью берется из полученных данных.
	Если ДанныеИБ <> Неопределено Тогда
		ДанныеИБСклад = ДанныеИБ.Склад;

		// Переносим те свойства, которые указаны в ПКС.
		ЗаполнитьСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ);

		Если НЕ КомпонентыОбмена.ПараметрыКонвертации.ВыгружатьАналитикуПоСкладам Тогда
			// Восстанавливаем склад из первоначального документа.
			ДанныеИБ.Склад = ДанныеИБСклад;
		КонецЕсли;

		// Табличные части
		ДанныеИБ.Товары.Загрузить(ПолученныеДанные.Товары.Выгрузить());
		// Если количество строк и сумма ТЧ ОплатаПлатежнымиКартами не изменилась, то табличную часть не перезаписываем,
		// чтобы не затереть терминал и номер карты.
		Если Не (ДанныеИБ.ОплатаПлатежнымиКартами.Количество() = ПолученныеДанные.ОплатаПлатежнымиКартами.Количество()
			И ДанныеИБ.ОплатаПлатежнымиКартами.Итог("Сумма") = ПолученныеДанные.ОплатаПлатежнымиКартами.Итог("Сумма")) Тогда
			ДанныеИБ.ОплатаПлатежнымиКартами.Загрузить(ПолученныеДанные.ОплатаПлатежнымиКартами.Выгрузить());
		КонецЕсли;
		#Вставка
		//26.03.25 - 6360 фикс бага с выгрузкой договоров
		ИндОпл = 0;
		#КонецВставки
		Для каждого Строчка Из ДанныеИБ.ОплатаПлатежнымиКартами Цикл
			Если Не ЗначениеЗаполнено(Строчка.ВидОплаты) Тогда
				Строчка.ВидОплаты = Перечисления.ТипыПлатежнойСистемыККТ.ПлатежнаяКарта;
			КонецЕсли;
			#Вставка
			//26.03.25 - 6360 фикс бага с выгрузкой договоров
			Если Не ЗначениеЗаполнено(Строчка.ДоговорПодключения) Тогда
				Строчка.ДоговорПодключения = ПолученныеДанные.ОплатаПлатежнымиКартами[ИндОпл].ДоговорПодключения;
			КонецЕсли;
			
			ИндОпл = ИндОпл + 1;
			#КонецВставки
		КонецЦикла;
		ДанныеИБ.ПодарочныеСертификаты.Загрузить(ПолученныеДанные.ПодарочныеСертификаты.Выгрузить());
		ДанныеИБ.НачислениеБонусныхБаллов.Загрузить(ПолученныеДанные.НачислениеБонусныхБаллов.Выгрузить());
		ДанныеИБ.ОплатаБонуснымиБаллами.Загрузить(ПолученныеДанные.ОплатаБонуснымиБаллами.Выгрузить());

		ДопСвойства = ПолученныеДанные.ДополнительныеСвойства;
		Для каждого ЭлементСтруктуры Из ДопСвойства Цикл
			ДанныеИБ.ДополнительныеСвойства.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
		КонецЦикла;

		ПолученныеДанные = Неопределено;
		ДанныеДляЗаписиВИБ = ДанныеИБ;

	Иначе
		ДанныеДляЗаписиВИБ = ПолученныеДанные;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.КассаККМ) И Не ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.Склад) Тогда
		ДанныеДляЗаписиВИБ.Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляЗаписиВИБ.КассаККМ, "Склад");
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.КассаККМ) И Не ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.ВидЦены) Тогда
		ДанныеДляЗаписиВИБ.ВидЦены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляЗаписиВИБ.КассаККМ, "Склад.РозничныйВидЦены");
	КонецЕсли;

	ТаблЧасти = Новый Структура;
	Для каждого ТЧ Из ДанныеДляЗаписиВИБ.Метаданные().ТабличныеЧасти Цикл
		ТаблЧасти.Вставить(ТЧ.Имя, ДанныеДляЗаписиВИБ[ТЧ.Имя].Выгрузить());
	КонецЦикла;
	ДанныеДляЗаписиВИБ.ДополнительныеСвойства.Вставить("ТаблЧасти", ТаблЧасти);
	УстановитьОтменуМеханическойЧисткиДвижений(ДанныеИБ);
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Справочник_Номенклатура_Получение_ПередЗаписьюПолученныхДанных")
Процедура ИКТ_ПКО_Справочник_Номенклатура_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если Не ДанныеИБ = Неопределено Тогда
		ЗаполнитьРеквизиты(ПолученныеДанные, ДанныеИБ, "СтавкаНДС, ГруппаАналитическогоУчета");
	КонецЕсли;

	ДанныеДляЗаписиВИБ = ?(ДанныеИБ = Неопределено, ПолученныеДанные, ДанныеИБ);
	#Вставка
	//{[+] ИКТ №7646 (фрагмент ДОБАВЛЕН), Гаев ЕА, 28.04.2025 11:36:00
	РодительТНП = РодительТоварНаПродажу();
	Если ЗначениеЗаполнено(РодительТНП) 
		И ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.ВидНоменклатуры)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляЗаписиВИБ.ВидНоменклатуры,"Родитель") = РодительТНП Тогда 
		ГФУ = ГруппаФинансовогоУчетаТовары41();
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДляЗаписиВИБ,"ГруппаФинансовогоУчета") Тогда
			ДанныеДляЗаписиВИБ.ГруппаФинансовогоУчета = ГФУ;
		Иначе
			ДанныеДляЗаписиВИБ.Вставить("ГруппаФинансовогоУчета",ГФУ);
		КонецЕсли;
	КонецЕсли;
	//[+]} ИКТ №7646
	#КонецВставки

	Если ПолученныеДанные.АлкогольнаяПродукция Тогда
		ДанныеДляЗаписиВИБ.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция;
	КонецЕсли;

	//++ Локализация
	Если Не ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.СтавкаНДС) Тогда
		ДанныеДляЗаписиВИБ.СтавкаНДС = УчетНДСРФВызовСервера.СтавкаНДСПоЗначениюПеречисления(Перечисления.СтавкиНДС.НДС20);
	КонецЕсли;
	//-- Локализация

	Если ДанныеДляЗаписиВИБ.ВесИспользовать И (
		Не ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.ВесЗнаменатель)
		Или Не ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.ВесЧислитель)) Тогда

		ДанныеДляЗаписиВИБ.ВесЗнаменатель      = 1;
		ДанныеДляЗаписиВИБ.ВесЧислитель        = 1;
		ДанныеДляЗаписиВИБ.ВесЕдиницаИзмерения = НоменклатураСервер.ЕдиницаИзмеренияПоУмолчанию("Вес");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДанныеДляЗаписиВИБ.ТипНоменклатуры) Тогда
		ДанныеДляЗаписиВИБ.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	КонецЕсли;

	Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ЕдиницаИзмеренияСрокаГодности")
		И ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ЕдиницаИзмеренияСрокаГодности) Тогда 
		ДанныеДляЗаписиВИБ.ЕдиницаИзмеренияСрокаГодности = ПолученныеДанные.ДополнительныеСвойства.ЕдиницаИзмеренияСрокаГодности;
	КонецЕсли;

	ЗагрузитьДополнительныеСведения(?(ДанныеИБ = Неопределено, ПолученныеДанные.ПолучитьСсылкуНового(), ДанныеИБ.Ссылка), 
	ПолученныеДанные.ДополнительныеСвойства, КомпонентыОбмена);
КонецПроцедуры

//{[+] ИКТ №9558 (фрагмент ДОБАВЛЕН), Бабуров Никита, 07.07.2025 10:24:12 
//[+]} ИКТ №9558 

//{[+] ИКТ №7646 (фрагмент ДОБАВЛЕН), Гаев ЕА, 28.04.2025 11:36:00
Функция РодительТоварНаПродажу()
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	СОКРЛП(ВидыНоменклатуры.Наименование) = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","Товар на продажу");
	
	Результат = ОбменДаннымиСлужебный.РезультатЗапросаВСтруктуру(Запрос.Выполнить()).Ссылка;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	Иначе
		Возврат Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("399f784f-4667-11ee-80c6-00155d008615"));
	КонецЕсли;
	
КонецФункции

Функция ГруппаФинансовогоУчетаТовары41()
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ГруппыФинансовогоУчетаНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФинансовогоУчетаНоменклатуры
	|ГДЕ
	|	СОКРЛП(ГруппыФинансовогоУчетаНоменклатуры.Наименование) = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","Товары (41)");
	
	Результат = ОбменДаннымиСлужебный.РезультатЗапросаВСтруктуру(Запрос.Выполнить()).Ссылка;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	Иначе
		Возврат Справочники.ГруппыФинансовогоУчетаНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("d39414d6-262f-11ee-9227-00155d275002"));
	КонецЕсли;
	
КонецФункции
//{[+] ИКТ №7646

&ИзменениеИКонтроль("ОтложеннаяОбработка_ОтчетОРозничныхПродажах")
Процедура ИКТ_ОтложеннаяОбработка_ОтчетОРозничныхПродажах(Объект, КомпонентыОбмена)
	Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) И ЗначениеЗаполнено(Объект.Склад) Тогда
		РозничныйВидЦены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "РозничныйВидЦены");
		Если ЗначениеЗаполнено(РозничныйВидЦены) Тогда 
			Объект.ВидЦены = РозничныйВидЦены;
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьТипНалогообложенияПоУмолчанию(Объект);

	Если Объект.ДополнительныеСвойства.Свойство("ТаблЧасти") Тогда
		Для каждого ТЧ Из Объект.ДополнительныеСвойства.ТаблЧасти Цикл
			Если ЗначениеЗаполнено(Объект.ДополнительныеСвойства.ТаблЧасти[ТЧ.Ключ]) Тогда
				Объект[ТЧ.Ключ].Загрузить(Объект.ДополнительныеСвойства.ТаблЧасти[ТЧ.Ключ]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		ЗаполнитьКассуККМПоВалютеСкладуИОрганизации(Объект, КомпонентыОбмена);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
		ДокументыСПодарочнымиСертификатами = КомпонентыОбмена.ПараметрыКонвертации.ДокументыСПодарочнымиСертификатами; // ТаблицаЗначений

		НоваяСтрока = ДокументыСПодарочнымиСертификатами.Добавить();
		НоваяСтрока.ДокументСсылка   = Объект.Ссылка;
		НоваяСтрока.ДатаДокумента    = Объект.Дата;
		НоваяСтрока.ОчередьДокумента = 1;

		ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект, "КассаККМ, Организация, Валюта");
	КонецЕсли;

	ЗаполнитьСтатусыУказанияСерий(Объект, КомпонентыОбмена);

#Удаление
	// Эквайринговый терминал в ТЧ ОплатаПлатежнымиКартами
	ЭквайринговыйТерминал = ЭлементПоУмолчанию(КомпонентыОбмена, "ЭквайринговыйТерминал");

	Для Каждого Строка Из Объект.ОплатаПлатежнымиКартами Цикл
		Если Не ЗначениеЗаполнено(Строка.ЭквайринговыйТерминал) Тогда
			Строка.ЭквайринговыйТерминал = ЭквайринговыйТерминал; 
		КонецЕсли;
	КонецЦикла;
#КонецУдаления

	//++ Локализация
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "АкцизныеМарки") Тогда
		Для каждого Строка Из Объект.АкцизныеМарки Цикл
			Если Не ЗначениеЗаполнено(Строка.АкцизнаяМарка) И НЕ ПустаяСтрока(Строка.КодАкцизнойМарки) Тогда
				Строка.АкцизнаяМарка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", Строка.КодАкцизнойМарки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

&ИзменениеИКонтроль("ПОД_Справочник_ЭквайринговыеТерминалы_Получение_ПриОбработке")
Процедура ИКТ_ПОД_Справочник_ЭквайринговыеТерминалы_Получение_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	#Удаление
	Если ДанныеXDTO.Свойство("Номер") И НЕ ЗначениеЗаполнено(ДанныеXDTO.Номер) Тогда
		ОчиститьИспользованиеПКО(ИспользованиеПКО);
	КонецЕсли;
	#КонецУдаления
КонецПроцедуры


&ИзменениеИКонтроль("ПереопределитьПоляПоискаКонтрагентов")
Процедура ИКТ_ПереопределитьПоляПоискаКонтрагентов(КомпонентыОбмена, ДанныеXDTO)
	//  Если контрагент является индивидуальным предпринимателем или физ. лицом, то необходимо переопределить поля поиска,
	//	так как в приложении могут быть записаны два контрагента с одинаковыми ключевыми полями: ИНН + Наименование, но с разным видом ЮрФизЛицо

	ПравилаКонвертацииКонтрагентов = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_Контрагенты_Получение", "ИмяПКО");
	Если ПравилаКонвертацииКонтрагентов = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КлючевыеСвойства = Неопределено;
	Если Не ДанныеXDTO.Свойство("КлючевыеСвойства", КлючевыеСвойства) Тогда
		КлючевыеСвойства = ДанныеXDTO;
	КонецЕсли;

#Удаление
	Если Не (КлючевыеСвойства.Свойство("ЮридическоеФизическоеЛицо") И 
		КлючевыеСвойства.ЮридическоеФизическоеЛицо.Значение = "ФизическоеЛицо") Тогда

		Возврат;

	КонецЕсли;
#КонецУдаления
#Вставка
//{[+] ИКТ №9642 (фрагмент ДОБАВЛЕН), Селиверстов Д.Н., 03.09.2025 13:00
	Если Не (КлючевыеСвойства.Свойство("ЮридическоеФизическоеЛицо") И 
		КлючевыеСвойства.ЮридическоеФизическоеЛицо = "ФизическоеЛицо") Тогда

		Возврат;

	КонецЕсли;
//[+]} ИКТ №9642
#КонецВставки

	ПоляПоиска = ПравилаКонвертацииКонтрагентов.ПоляПоиска;
	ПоляПоиска.Очистить();

	ИННЗаполнен = КлючевыеСвойства.Свойство("ИНН") И ЗначениеЗаполнено(КлючевыеСвойства.ИНН);

	Если ИННЗаполнен Тогда
		ПоляПоиска.Добавить("ИНН, ЮрФизЛицо");
	Иначе
		ПоляПоиска.Добавить("НаименованиеПолное,ЮрФизЛицо");
		ПоляПоиска.Добавить("Наименование,ЮрФизЛицо");
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_КорректировкаПоступленияТоваров_Получение_ПриКонвертацииДанныхXDTO")
Процедура ИКТ_ПКО_Документ_КорректировкаПоступленияТоваров_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
		"Документ_КорректировкаПоступленияТоваров_Получение", 
		"Товары", 
		"НомерГТД",
		Ложь,
		"Справочник_НомераГТД_ПолучениеЭлемента");
	КонецЕсли;

	ПолученныеДанные.Проведен    = Истина;
	ПолученныеДанные.Согласован  = Истина;
	ПолученныеДанные.ДатаПлатежа = ПолученныеДанные.Дата;

	ДобавитьВалютуВДопСвойства(ПолученныеДанные, ДанныеXDTO);
	ДобавитьДоговорВДопСвойства(ПолученныеДанные, ДанныеXDTO, КомпонентыОбмена);

	ДокументПоступленияДанные = Неопределено;
	ИмяПКО = "";
	ДанныеXDTO.Свойство("ИсправляемыйДокументПоступления", ДокументПоступленияДанные);
	Если ДокументПоступленияДанные = Неопределено Тогда
		ДанныеXDTO.Свойство("ДокументПоступления", ДокументПоступленияДанные);
	КонецЕсли;
	Если ДокументПоступленияДанные <> Неопределено И ТипЗнч(ДокументПоступленияДанные) = Тип("Структура") Тогда
		ТипЗначенияДокумент = ДокументПоступленияДанные.ТипЗначения;
		Если Найти(ТипЗначенияДокумент, "ПоступлениеТоваровУслуг") Тогда // @Non-NLS-1
			ИмяПКО = "Документ_ПоступлениеТоваровУслуг_Получение";
		КонецЕсли; 
	КонецЕсли;
	Если ИмяПКО <> "" Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ДокументОснование", Новый Структура("Значение, ИмяПКО",ДокументПоступленияДанные,ИмяПКО));
	КонецЕсли;

	Если ДанныеXDTO.ВидОперации.Значение = "ИсправлениеОшибки" Тогда
		ПолученныеДанные.ВидКорректировки = Перечисления.ХозяйственныеОперации.ИсправлениеОшибок;
	Иначе
		ПолученныеДанные.ВидКорректировки = Перечисления.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон;
	КонецЕсли;
	ПолученныеДанные.ТипКорректировки = Перечисления.ТипыКорректировки.ОбычнаяКорректировка;
	#Область Товары

	ПравилаЗаполнения = Новый Соответствие;
	ПравилаЗаполнения.Вставить("Номенклатура", "Номенклатура");
	ПравилаЗаполнения.Вставить("Количество",   "Количество");
	ПравилаЗаполнения.Вставить("Сумма",        "Сумма");
	ПравилаЗаполнения.Вставить("Цена",         "Цена");
	ПравилаЗаполнения.Вставить("СтавкаНДС",    "СтавкаНДС");
	ПравилаЗаполнения.Вставить("СуммаНДС",     "СуммаНДС");
	Если ЗначениеФО("ИспользоватьХарактеристикиНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Характеристика",     "Характеристика");
	КонецЕсли;
	Если ЗначениеФО("ИспользоватьСерииНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Серия",              "Серия");
	КонецЕсли;
	Если ЗначениеФО("ИспользоватьУпаковкиНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Упаковка",           "Упаковка");
		ПравилаЗаполнения.Вставить("КоличествоУпаковок", "КоличествоУпаковок");
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		ПравилаЗаполнения.Вставить("КоличествоРНПТ", "КоличествоПоРНПТ");
	КонецЕсли;
	ВерсияФормата17ИВыше = ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17");
	МассивСтрокТовары = Новый Массив;
	Если ДанныеXDTO.Свойство("Товары")
		И ЗначениеЗаполнено(ДанныеXDTO.Товары) Тогда

		Для Каждого Строка Из ДанныеXDTO.Товары Цикл
			Если Не ЗначениеЗаполнено(Строка.Количество) Или Строка.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			#Вставка
			//{[+] ИКТ №11390 (фрагмент ДОБАВЛЕН), Селиверстов Д.Н., 10.09.2025 07:10
			Если Не ЗначениеЗаполнено(Строка.Цена) Тогда
				Строка.Цена = 0;
			КонецЕсли;
			//[+]} ИКТ №11390
			//{[+] ИКТ №11984 (фрагмент ДОБАВЛЕН), Селиверстов Д.Н., 29.09.2025 14:00
			Если Не ЗначениеЗаполнено(Строка.КоличествоДоИзменения) Тогда
				Строка.КоличествоДоИзменения = 0;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.КоличествоДоКорректировки) Тогда
				Строка.КоличествоДоКорректировки = 0;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.КоличествоУпаковок) Тогда
				Строка.КоличествоУпаковок = 0;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.КоличествоУпаковокДоКорректировки) Тогда
				Строка.КоличествоУпаковокДоКорректировки = 0;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.КоличествоУпаковокДоИзменения) Тогда
				Строка.КоличествоУпаковокДоИзменения = 0;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.СуммаДоИзменения) Тогда
				Строка.СуммаДоИзменения = 0;
			КонецЕсли;  
			Если Не ЗначениеЗаполнено(Строка.ЦенаДоИзменения) Тогда
				Строка.ЦенаДоИзменения = 0;
			КонецЕсли;
			//[+]} ИКТ №11984
			#КонецВставки

			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);
			Если СтруктураДанныхСтроки.Свойство("Количество") И СтруктураДанныхСтроки.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;

			Если СтруктураДанныхСтроки.Свойство("СтавкаНДС") И ЗначениеЗаполнено(СтруктураДанныхСтроки.СтавкаНДС) Тогда
				СтруктураДанныхСтроки.СтавкаНДС = СправочникПоПеречислениюСтавкиНДС(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДС);
			КонецЕсли;

			Если ЗначениеЗаполнено(Строка.НомерГТД) Тогда
				Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
					СтруктураДанныхСтроки.Вставить("НомерГТД", Строка.НомерГТД);
				Иначе
					СтруктураДанныхСтроки.Вставить("НомерГТД", Новый Структура("НомерГТД, СтранаПроисхождения", Строка.НомерГТД, Строка.СтранаПроисхождения));
				КонецЕсли;
			КонецЕсли;

			СуммаСНДС = Строка.Сумма;
			Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
				СуммаСНДС = СуммаСНДС + СтруктураДанныхСтроки.СуммаНДС;
			КонецЕсли;

			СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);

			ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации,ВерсияФормата17ИВыше);
			СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
			Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
				СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
			КонецЕсли;
			СтруктураДанныхСтроки.Вставить("Склад", ПолученныеДанные.Склад);

			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;

	// Услуги добавляем в товары.
	Если ДанныеXDTO.Свойство("Услуги")
		И ЗначениеЗаполнено(ДанныеXDTO.Услуги) Тогда

		Для Каждого Строка Из ДанныеXDTO.Услуги Цикл
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);
			Если СтруктураДанныхСтроки.Свойство("Количество") И СтруктураДанныхСтроки.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			СуммаСНДС = Строка.Сумма;
			Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
				СуммаСНДС = СуммаСНДС + СтруктураДанныхСтроки.СуммаНДС
			КонецЕсли;

			СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);
			ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации, ВерсияФормата17ИВыше);
			Если ЗначениеЗаполнено(Строка.Содержание) Тогда
				СтруктураДанныхСтроки.Вставить("Содержание", Строка.Содержание);
			КонецЕсли;
			СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
			Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
				СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
			КонецЕсли;
			Если НЕ СтруктураДанныхСтроки.Свойство("Количество") ИЛИ СтруктураДанныхСтроки.Количество = Неопределено Тогда
				СтруктураДанныхСтроки.Вставить("Количество", 1); 
			КонецЕсли;	 
			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;

	Если МассивСтрокТовары.Количество() > 0 Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Товары", МассивСтрокТовары);
	КонецЕсли;

	#КонецОбласти
	#Область Расхождения
	ПравилаЗаполнения = Новый Соответствие;
	ПравилаЗаполнения.Вставить("Номенклатура", "Номенклатура");
	ПравилаЗаполнения.Вставить("Количество",   "Количество");  
	ПравилаЗаполнения.Вставить("Сумма",        "Сумма");  
	ПравилаЗаполнения.Вставить("Цена",         "Цена"); 

	ПравилаЗаполнения.Вставить("СтавкаНДС",    "СтавкаНДС");

	ПравилаЗаполнения.Вставить("СуммаНДС", "СуммаНДС"); 

	Если ЗначениеФО("ИспользоватьХарактеристикиНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Характеристика",     "Характеристика");
	КонецЕсли;
	Если ЗначениеФО("ИспользоватьСерииНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Серия",              "Серия");
	КонецЕсли;
	Если ЗначениеФО("ИспользоватьУпаковкиНоменклатуры", КомпонентыОбмена) Тогда
		ПравилаЗаполнения.Вставить("Упаковка",           "Упаковка");
		ПравилаЗаполнения.Вставить("КоличествоУпаковок", "КоличествоУпаковок");
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		ПравилаЗаполнения.Вставить("КоличествоРНПТ", "КоличествоПоРНПТ");
	КонецЕсли;
	МассивСтрокРасхождение = Новый Массив;
	Если ДанныеXDTO.Свойство("Товары")
		И ЗначениеЗаполнено(ДанныеXDTO.Товары) Тогда 
		Для Каждого Строка Из ДанныеXDTO.Товары Цикл
			Если Не ЗначениеЗаполнено(Строка.Количество) И Не ЗначениеЗаполнено(Строка.КоличествоДоИзменения) Тогда
				Продолжить;
			КонецЕсли;  	
			Если Не ЗначениеЗаполнено(Строка.Количество) Тогда
				Строка.Количество = 0;
			КонецЕсли;  

			Если Не ЗначениеЗаполнено(Строка.Сумма) Тогда
				Строка.Сумма = 0;
			КонецЕсли;  

			Если ВерсияФормата17ИВыше И НЕ Строка.СтавкаНДС.Свойство("Ставка") Тогда
				Строка.СтавкаНДС.Вставить("Ставка", "0");
			КонецЕсли; 
			Если ВерсияФормата17ИВыше 
				И ЗначениеЗаполнено(Строка.СтавкаНДСДоИзменения) И НЕ Строка.СтавкаНДСДоИзменения.Свойство("Ставка") Тогда
				Строка.СтавкаНДСДоИзменения.Вставить("Ставка", "0");
			КонецЕсли; 

			Если НЕ Строка.ЕстьВДокументеПоступленияРеализации 
				ИЛИ ЗначениеЗаполнено(Строка.СтавкаНДСДоИзменения) И (Не ВерсияФормата17ИВыше И Строка.СтавкаНДС.Значение <> Строка.СтавкаНДСДоИзменения.Значение
				ИЛИ ВерсияФормата17ИВыше И Строка.СтавкаНДС.Ставка <> Строка.СтавкаНДСДоИзменения.Ставка)
				Или НЕ ((Строка.НомерГТД = Неопределено И Строка.НомерГТДДоИзменения = Неопределено)
				Или (ТипЗнч(Строка.НомерГТД) = Тип("Структура") И ТипЗнч(Строка.НомерГТДДоИзменения) = Тип("Структура")
				И (Строка.НомерГТД.Свойство("Ссылка") И Строка.НомерГТД.Ссылка.Значение = Строка.НомерГТДДоИзменения.Ссылка.Значение)))
				Или НЕ ((Строка.СтранаПроисхождения = Неопределено И Строка.СтранаПроисхожденияДоИзменения = Неопределено)
				Или (ТипЗнч(Строка.СтранаПроисхождения) = Тип("Структура") И ТипЗнч(Строка.СтранаПроисхождения) = Тип("Структура")
				И (Не Строка.СтранаПроисхожденияДоИзменения = Неопределено И Строка.СтранаПроисхождения.Ссылка.Значение = Строка.СтранаПроисхожденияДоИзменения.Ссылка.Значение )))
				Тогда
				// Две строки старая минусом новая плюсом.
				СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);
				Если ЗначениеЗаполнено(Строка.НомерГТД) Тогда
					Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
						СтруктураДанныхСтроки.Вставить("НомерГТД", Строка.НомерГТД);
					Иначе
						СтруктураДанныхСтроки.Вставить("НомерГТД", Новый Структура("НомерГТД, СтранаПроисхождения", Строка.НомерГТД, Строка.СтранаПроисхождения));
					КонецЕсли;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("СтавкаНДС") И ЗначениеЗаполнено(СтруктураДанныхСтроки.СтавкаНДС) Тогда
					СтруктураДанныхСтроки.СтавкаНДС = СправочникПоПеречислениюСтавкиНДС(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДС);
				КонецЕсли;
				СуммаСНДС = Строка.Сумма;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
					СуммаСНДС = СуммаСНДС + СтруктураДанныхСтроки.СуммаНДС;
				КонецЕсли;

				СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);

				ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации,ВерсияФормата17ИВыше);
				СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
					СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
				КонецЕсли;
				СтруктураДанныхСтроки.Вставить("Склад", ПолученныеДанные.Склад);
				Если НЕ СтруктураДанныхСтроки.Количество = 0 Тогда
					МассивСтрокРасхождение.Добавить(СтруктураДанныхСтроки);
				КонецЕсли;

				Если НЕ Строка.ЕстьВДокументеПоступленияРеализации Тогда
					Продолжить;
				КонецЕсли;
				// Данные до изменения отразить минусом.
				СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);
				СтруктураДанныхСтроки.Количество = (-1) * Строка.КоличествоДоИзменения;
				Если Не СтруктураДанныхСтроки.Свойство("Сумма") Тогда
					СтруктураДанныхСтроки.Вставить("Сумма");
				КонецЕсли;
				СтруктураДанныхСтроки.Сумма = (-1) * Строка.СуммаДоИзменения;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И ЗначениеЗаполнено(Строка.СуммаНДСДоИзменения) Тогда
					СтруктураДанныхСтроки.СуммаНДС = (-1) * Строка.СуммаНДСДоИзменения;
				КонецЕсли;
				СтруктураДанныхСтроки.СтавкаНДС = Строка.СтавкаНДСДоИзменения; 
				Если Не СтруктураДанныхСтроки.Свойство("Цена") Тогда
					СтруктураДанныхСтроки.Вставить("Цена");
				КонецЕсли;
				СтруктураДанныхСтроки.Цена = Строка.ЦенаДоИзменения; 
				Если СтруктураДанныхСтроки.Свойство("КоличествоПоРНПТ") Тогда
					СтруктураДанныхСтроки.КоличествоПоРНПТ = (-1) * Строка.КоличествоРНПТДоИзменения;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("КоличествоУпаковок") Тогда
					СтруктураДанныхСтроки.КоличествоУпаковок = (-1) * Строка.КоличествоУпаковокДоИзменения;
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка.НомерГТД) Тогда
					Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
						СтруктураДанныхСтроки.Вставить("НомерГТД", Строка.НомерГТДДоИзменения);
					Иначе
						СтруктураДанныхСтроки.Вставить("НомерГТД", Новый Структура("НомерГТД, СтранаПроисхождения", Строка.НомерГТДДоИзменения, Строка.СтранаПроисхожденияДоИзменения));
					КонецЕсли;
				КонецЕсли;
				СуммаСНДС = Строка.Сумма;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
					СуммаСНДС = СуммаСНДС - СтруктураДанныхСтроки.СуммаНДС;
				КонецЕсли;

				СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);

				ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации, ВерсияФормата17ИВыше);
				СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
					СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
				КонецЕсли;
				СтруктураДанныхСтроки.Вставить("Склад", ПолученныеДанные.Склад);
				МассивСтрокРасхождение.Добавить(СтруктураДанныхСтроки);

			ИначеЕсли Строка.Количество <> Строка.КоличествоДоИзменения Или Строка.Сумма <> Строка.СуммаДоИзменения Или Строка.СуммаНДС <> Строка.СуммаНДСДоИзменения Тогда
				СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения); 

				СтруктураДанныхСтроки.Количество = ?(ЗначениеЗаполнено(Строка.Количество), 
				Строка.Количество - Строка.КоличествоДоИзменения, (-1) * Строка.КоличествоДоИзменения);
				СтруктураДанныхСтроки.Сумма = ?(ЗначениеЗаполнено(Строка.Сумма), 
				Строка.Сумма - Строка.СуммаДоИзменения, (-1) * Строка.СуммаДоИзменения);

				СуммаНДСДоИзменения = ?(ЗначениеЗаполнено(Строка.СуммаНДСДоИзменения),Строка.СуммаНДСДоИзменения, 0); 
				СуммаНДС = ?(ЗначениеЗаполнено(Строка.СуммаНДС), Строка.СуммаНДС - СуммаНДСДоИзменения, (-1) * СуммаНДСДоИзменения);

				СтруктураДанныхСтроки.Вставить("СуммаНДС", СуммаНДС);

				Если НЕ СтруктураДанныхСтроки.Свойство("Цена") Тогда
					СтруктураДанныхСтроки.Вставить("Цена");
				КонецЕсли;
				СтруктураДанныхСтроки.Цена = ?(НЕ Строка.Цена = Неопределено, Строка.Цена, 0) - ?(НЕ Строка.ЦенаДоИзменения = Неопределено, Строка.ЦенаДоИзменения, 0); 
				Если СтруктураДанныхСтроки.Свойство("КоличествоПоРНПТ") Тогда
					СтруктураДанныхСтроки.КоличествоПоРНПТ = ?(ЗначениеЗаполнено(СтруктураДанныхСтроки.КоличествоПоРНПТ), 
					СтруктураДанныхСтроки.КоличествоПоРНПТ- Строка.КоличествоРНПТДоИзменения, (-1) * Строка.КоличествоРНПТДоИзменения);
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("КоличествоУпаковок") Тогда
					СтруктураДанныхСтроки.КоличествоУпаковок = ?(ЗначениеЗаполнено(СтруктураДанныхСтроки.КоличествоУпаковок), 
					СтруктураДанныхСтроки.КоличествоУпаковок - Строка.КоличествоУпаковокДоИзменения, (-1) * Строка.КоличествоУпаковокДоИзменения);
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка.НомерГТД) Тогда
					Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
						СтруктураДанныхСтроки.Вставить("НомерГТД", Строка.НомерГТД);
					Иначе
						СтруктураДанныхСтроки.Вставить("НомерГТД", Новый Структура("НомерГТД, СтранаПроисхождения", Строка.НомерГТД, Строка.СтранаПроисхождения));
					КонецЕсли;
				КонецЕсли;
				СуммаСНДС = СтруктураДанныхСтроки.Сумма;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
					СуммаСНДС = СуммаСНДС + СтруктураДанныхСтроки.СуммаНДС;
				КонецЕсли;

				СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);

				ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации, ВерсияФормата17ИВыше);
				//СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
				СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", СтруктураДанныхСтроки.СуммаСНДС);
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
					СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
				КонецЕсли;
				СтруктураДанныхСтроки.Вставить("Склад", ПолученныеДанные.Склад);
				МассивСтрокРасхождение.Добавить(СтруктураДанныхСтроки);

			Иначе
				// Нет изменений - пропускаем.
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ДанныеXDTO.Свойство("Услуги")
		И ЗначениеЗаполнено(ДанныеXDTO.Услуги) Тогда
		Для Каждого Строка Из ДанныеXDTO.Услуги Цикл
			Если ВерсияФормата17ИВыше И НЕ Строка.СтавкаНДС.Свойство("Ставка") Тогда
				Строка.СтавкаНДС.Вставить("Ставка", "0");
			КонецЕсли; 
			Если ВерсияФормата17ИВыше 
				И ЗначениеЗаполнено(Строка.СтавкаНДСДоИзменения) И НЕ Строка.СтавкаНДСДоИзменения.Свойство("Ставка") Тогда
				Строка.СтавкаНДСДоИзменения.Вставить("Ставка", "0");
			КонецЕсли; 
			Если Не ЗначениеЗаполнено(Строка.Количество) Тогда
				Строка.Количество = 1;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(Строка.КоличествоДоИзменения) Тогда
				Строка.КоличествоДоИзменения = 0;
			КонецЕсли;

			Если НЕ Строка.ЕстьВДокументеПоступленияРеализации
				Или ЗначениеЗаполнено(Строка.СтавкаНДСДоИзменения) И (Не ВерсияФормата17ИВыше И Строка.СтавкаНДС.Значение <> Строка.СтавкаНДСДоИзменения.Значение
				Или ВерсияФормата17ИВыше И Строка.СтавкаНДС.Ставка <> Строка.СтавкаНДСДоИзменения.Ставка)
				Или Строка.Содержание <> Строка.СодержаниеДоИзменения Тогда
				// Две строки старая минусом новая плюсом.
				СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);
				Если ЗначениеЗаполнено(Строка.Содержание) Тогда
					СтруктураДанныхСтроки.Вставить("Содержание", Строка.Содержание);
				КонецЕсли;
				СуммаСНДС = Строка.Сумма;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
					СуммаСНДС = СуммаСНДС + СтруктураДанныхСтроки.СуммаНДС
				КонецЕсли;

				СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);
				ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации, ВерсияФормата17ИВыше);
				Если ЗначениеЗаполнено(Строка.Содержание) Тогда
					СтруктураДанныхСтроки.Вставить("Содержание", Строка.Содержание);
				КонецЕсли;
				СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
					СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
				КонецЕсли;
				МассивСтрокРасхождение.Добавить(СтруктураДанныхСтроки); 

				Если НЕ Строка.ЕстьВДокументеПоступленияРеализации Тогда
					Продолжить;
				КонецЕсли;

				СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);
				Количество =  (-1) * ?(Строка.КоличествоДоИзменения = Неопределено, 0,Строка.КоличествоДоИзменения);
				Сумма = (-1) * ?(Строка.СуммаДоИзменения = Неопределено, 0,Строка.СуммаДоИзменения);
				Цена = ?(Строка.ЦенаДоИзменения = Неопределено, 0,Строка.ЦенаДоИзменения);
				СтруктураДанныхСтроки.Вставить("Количество", Количество);
				СтруктураДанныхСтроки.Вставить("Сумма", Сумма);
				СтруктураДанныхСтроки.Вставить("Цена", Цена);
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И ЗначениеЗаполнено(Строка.СуммаНДСДоИзменения) Тогда
					СтруктураДанныхСтроки.СуммаНДС = (-1) * Строка.СуммаНДСДоИзменения;
				КонецЕсли;
				СтруктураДанныхСтроки.СтавкаНДС = Строка.СтавкаНДСДоИзменения;
				СтруктураДанныхСтроки.Цена = Строка.ЦенаДоИзменения; 
				Если ЗначениеЗаполнено(Строка.СодержаниеДоИзменения) Тогда
					СтруктураДанныхСтроки.Вставить("Содержание", Строка.СодержаниеДоИзменения);
				КонецЕсли;
				СуммаСНДС = Строка.Сумма;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
					СуммаСНДС = СуммаСНДС + СтруктураДанныхСтроки.СуммаНДС
				КонецЕсли;

				СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);
				ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации, ВерсияФормата17ИВыше);
				Если ЗначениеЗаполнено(Строка.Содержание) Тогда
					СтруктураДанныхСтроки.Вставить("Содержание", Строка.Содержание);
				КонецЕсли;
				СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
					СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
				КонецЕсли;
				МассивСтрокРасхождение.Добавить(СтруктураДанныхСтроки);

			ИначеЕсли Строка.Количество <> ?(ЗначениеЗаполнено(Строка.КоличествоДоИзменения), Строка.КоличествоДоИзменения, 0) Или Строка.Сумма <> Строка.СуммаДоИзменения Или Строка.СуммаНДС <> Строка.СуммаНДСДоИзменения Тогда
				СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(Строка, ПравилаЗаполнения);
				Если ЗначениеЗаполнено(Строка.Количество) И ЗначениеЗаполнено(Строка.КоличествоДоИзменения) Тогда
					СтруктураДанныхСтроки.Количество = Строка.Количество - ?(НЕ Строка.КоличествоДоИзменения = Неопределено,Строка.КоличествоДоИзменения, 0);
				КонецЕсли; 
				Если СтруктураДанныхСтроки.Свойство("Сумма") Тогда 
					СуммаДоИзменения = ?(Строка.СуммаДоИзменения = Неопределено, 0, Строка.СуммаДоИзменения);
					СтруктураДанныхСтроки.Сумма = ?(ЗначениеЗаполнено(Строка.Сумма),Строка.Сумма - СуммаДоИзменения, 0);
					СуммаСНДС = Строка.Сумма;
				Иначе
					СуммаСНДС = 0;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И Строка.СуммаНДСДоИзменения <> Неопределено Тогда
					СтруктураДанныхСтроки.СуммаНДС = Строка.СуммаНДС - ?(ЗначениеЗаполнено(Строка.СуммаНДСДоИзменения), Строка.СуммаНДСДоИзменения, 0); 
				ИначеЕсли СтруктураДанныхСтроки.Свойство("СуммаНДС") тогда
					СтруктураДанныхСтроки.СуммаНДС = 0;	
				КонецЕсли;    
				Если СтруктураДанныхСтроки.Свойство("Цена") Тогда
					СтруктураДанныхСтроки.Цена = Строка.Цена - ?(ЗначениеЗаполнено(Строка.ЦенаДоИзменения),Строка.ЦенаДоИзменения, 0); 
				КонецЕсли;	
				Если ЗначениеЗаполнено(Строка.Содержание) Тогда
					СтруктураДанныхСтроки.Вставить("Содержание", Строка.Содержание);
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") И НЕ ПолученныеДанные.ЦенаВключаетНДС Тогда
					СуммаСНДС = СуммаСНДС + СтруктураДанныхСтроки.СуммаНДС
				КонецЕсли;

				СтруктураДанныхСтроки.Вставить("СуммаСНДС", СуммаСНДС);
				ОбработатьСтавкуНДСПриПолучении(КомпонентыОбмена, Строка, СтруктураДанныхСтроки, ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации, ВерсияФормата17ИВыше);
				Если ЗначениеЗаполнено(Строка.Содержание) Тогда
					СтруктураДанныхСтроки.Вставить("Содержание", Строка.Содержание);
				КонецЕсли;
				СтруктураДанныхСтроки.Вставить("СуммаВзаиморасчетов", Строка.Сумма);
				Если СтруктураДанныхСтроки.Свойство("СуммаНДС") Тогда
					СтруктураДанныхСтроки.Вставить("СуммаНДСВзаиморасчетов", СтруктураДанныхСтроки.СуммаНДС);
				КонецЕсли;
				МассивСтрокРасхождение.Добавить(СтруктураДанныхСтроки);

			Иначе
				// Нет изменений - пропускаем.
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	Если МассивСтрокРасхождение.Количество() > 0 Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Расхождения", МассивСтрокРасхождение);
	КонецЕсли;
	#КонецОбласти
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Справочник_НоменклатураПоставщиков_Получение_ПриКонвертацииДанныхXDTO")
Процедура ИКТ_ПКО_Справочник_НоменклатураПоставщиков_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	Владелец = Справочники.Партнеры.НеизвестныйПартнер;
	Если ДанныеXDTO.КлючевыеСвойства.Свойство("Владелец") 
		И ЗначениеЗаполнено(ДанныеXDTO.КлючевыеСвойства.Владелец) Тогда

		Контрагент = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена,
		ДанныеXDTO.КлючевыеСвойства.Владелец,
		ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Контрагенты_Получение"), 
		"ПолучитьСсылку");

		Если ТипЗнч(Контрагент) = Тип("СправочникОбъект.Контрагенты") Тогда
			Контрагент = Контрагент.Ссылка;
		КонецЕсли;

		ПолученныеДанные.ДополнительныеСвойства.Вставить("Контрагент", Контрагент);

		Если ЗначениеЗаполнено(Контрагент) И ОбщегоНазначения.СсылкаСуществует(Контрагент) Тогда
			Владелец = ДенежныеСредстваСервер.ПолучитьПартнераПоКонтрагенту(Контрагент);
		КонецЕсли;
	КонецЕсли; 

	ПолученныеДанные.ДополнительныеСвойства.Вставить("Владелец", Владелец);

	Если ДанныеXDTO.КлючевыеСвойства.Свойство("УпаковкаНоменклатуры") 
		И ЗначениеЗаполнено(ДанныеXDTO.КлючевыеСвойства.УпаковкаНоменклатуры) Тогда

		ПравилаЗаполнения = Новый Соответствие;
		ПравилаЗаполнения.Вставить("ЕдиницаИзмерения", "ЕдиницаИзмерения");
		ПравилаЗаполнения.Вставить("Коэффициент", "Коэффициент");
		ПравилаЗаполнения.Вставить("Наименование", "НаименованиеУпаковки");
		ДанныеУпаковки = ДанныеКоллекцииВВидеСтруктуры(ДанныеXDTO.КлючевыеСвойства.УпаковкаНоменклатуры, ПравилаЗаполнения);

		ПолученныеДанные.НаименованиеУпаковки = ДанныеУпаковки.НаименованиеУпаковки;
		#Вставка
		Если Не ДанныеУпаковки.Свойство("Коэффициент") Тогда
			
			ДанныеУпаковки.Вставить("Коэффициент", Неопределено);
			
		КонецЕсли;
		#КонецВставки

		Если НЕ ДанныеУпаковки.Свойство("Коэффициент") ИЛИ 
			(ДанныеУпаковки.Свойство("Коэффициент") И Не ЗначениеЗаполнено(ДанныеУпаковки.Коэффициент)) Тогда
			ПолученныеДанные.КоличествоУпаковок = 1;
			ПолученныеДанные.КоличествоБазовойЕдиницыИзмерения = 1;
		ИначеЕсли ДанныеУпаковки.Свойство("Коэффициент") Тогда
			ПолученныеДанные.КоличествоУпаковок = 1;
			ПолученныеДанные.КоличествоБазовойЕдиницыИзмерения = ДанныеУпаковки.Коэффициент;	
		КонецЕсли;

		Если ЗначениеЗаполнено(ДанныеУпаковки.ЕдиницаИзмерения) Тогда
			ПравилаЗаполнения = Новый Соответствие;
			ПравилаЗаполнения.Вставить("Код", "КодОКЕИБазовойЕдиницыИзмерения");
			ПравилаЗаполнения.Вставить("Наименование", "НаименованиеБазовойЕдиницыИзмерения");
			ДанныеЕдиницыИзмерения = ДанныеКоллекцииВВидеСтруктуры(ДанныеУпаковки.ЕдиницаИзмерения, ПравилаЗаполнения);

			ЗаполнитьЗначенияСвойств(ПолученныеДанные, ДанныеЕдиницыИзмерения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#Область ИКТ_РегистрСведений_ИКТ_СобытияПроходаСКУД
//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ДобавитьПОД_ИКТ_СобытияПроходаСКУД_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "ИКТ_СобытияПроходаСКУД_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.ИКТ_СобытияПроходаСКУД";
	ПравилоОбработки.ПриОбработке            = "ПОД_ИКТ_СобытияПроходаСКУД_Получение_ПриОбработке";
КонецПроцедуры //[+]} ИКТ №16316                                         

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ДобавитьПКО_ИКТ_СобытияПроходаСКУД_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "ИКТ_СобытияПроходаСКУД_Получение";
	ПравилоКонвертации.ОбъектДанных      			= Метаданные.РегистрыСведений.ИТК_СобытияПроходаСКУД;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ИКТ_СобытияПроходаСКУД";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ИКТ_СобытияПроходаСКУД_Получение_ПриКонвертацииДанныхXDTO";
	
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());

КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ПОД_ИКТ_СобытияПроходаСКУД_Получение_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	
	СвойстваОтбор = ДанныеXDTO;
	
	Если ДанныеXDTO.Свойство("КлючевыеСвойства") Тогда
		СвойстваОтбор = ДанныеXDTO.КлючевыеСвойства;
	КонецЕсли;
	
	ID_ПроходаОтбор = Неопределено;
	
	СвойстваОтбор.Свойство("ID_ПроходаОтбор", ID_ПроходаОтбор);
	
	ПравилоКонвертацииСотрудники = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Сотрудники_Получение");
	
	ИТК_СобытияПроходаСКУД = РегистрыСведений.ИТК_СобытияПроходаСКУД.СоздатьНаборЗаписей();
	ИТК_СобытияПроходаСКУД.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	Если ЗначениеЗаполнено(ID_ПроходаОтбор) Тогда
		ИТК_СобытияПроходаСКУД.Отбор.ID_Прохода.Установить(Формат(ID_ПроходаОтбор, "ЧГ=0"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИТК_СобытияПроходаСКУД.Отбор.ID_Прохода.Значение) Тогда
		Возврат;
	КонецЕсли;         
		
	Если ДанныеXDTO.Свойство("Записи")
		И ЗначениеЗаполнено(ДанныеXDTO.Записи) Тогда
	
		Для Каждого СтрокаЗаписи Из ДанныеXDTO.Записи Цикл
			ЗаписьИТК_СобытияПроходаСКУД = ИТК_СобытияПроходаСКУД.Добавить();
			
			ЗаполнитьЗначенияСвойств(ЗаписьИТК_СобытияПроходаСКУД, СтрокаЗаписи, "ID_ТочкиДоступа, internalEmpId, ВремяПрохода, ЗначениеПропуска, Сотрудник, ТипПрохода");
						
			Если ЗначениеЗаполнено(СтрокаЗаписи.Сотрудник) Тогда
				ЗаписьИТК_СобытияПроходаСКУД.Сотрудник = ОбменДаннымиXDTOСервер.СсылкаОбъектаПоУИДОбъектаXDTO(СтрокаЗаписи.Сотрудник.Значение, Тип("СправочникСсылка.Сотрудники"), КомпонентыОбмена);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЗаписи.ТипПрохода) Тогда
				ЗаписьИТК_СобытияПроходаСКУД.ТипПрохода = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ИТК_ТипПроходаТочекДоступа." + СтрокаЗаписи.ТипПрохода.Значение);
			КонецЕсли;
			
			ЗаписьИТК_СобытияПроходаСКУД.ID_Прохода = Формат(СтрокаЗаписи.ID_Прохода, "ЧГ=0");
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИТК_СобытияПроходаСКУД.ОбменДанными.Загрузка = Истина;
	ИТК_СобытияПроходаСКУД.Записать(Истина);

КонецПроцедуры //[+]} ИКТ №16316
#КонецОбласти

#Область ИКТ_ДокументВедомостьВКассу
//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ДобавитьПКО_ДокументВедомостьВКассу_Получение(ПравилаКонвертации)
		
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ВедомостьВКассу_Получение";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ВедомостьНаВыплатуЗарплаты";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Документ_ВедомостьВКассу_Получение_ПриКонвертацииДанныхXDTO";  
	ПравилоКонвертации.ВариантИдентификации         = "ПоПолямПоиска"; 
	ПравилоКонвертации.ПоляПоиска.Добавить("Дата,Номер,Организация");
	
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_ВедомостьВКассу_Получение_ПередЗаписьюПолученныхДанных";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",              "ДатаВедомости");
	ДобавитьПКС(СвойстваШапки, "",                  "Комментарий", 1);
	ДобавитьПКС(СвойстваШапки, "Номер",             "НомерВедомости");
	ДобавитьПКС(СвойстваШапки, "Организация",       "Организация", , "Справочник_Организации_Получение");
	ДобавитьПКС(СвойстваШапки, "ПериодРегистрации", "ПериодВыплаты");
	ДобавитьПКС(СвойстваШапки, "Подразделение",     "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Получение");
	ДобавитьПКС(СвойстваШапки, "",                  "СпособВыплаты", 1);
	ДобавитьПКС(СвойстваШапки, "",                  "СпособРасчетов", 1);
	ДобавитьПКС(СвойстваШапки, "СуммаПоДокументу",  "СуммаДокумента");
	//{[+] ИКТ №17494 (фрагмент ДОБАВЛЕН), Воробьев, 12.04.2026)
	ДобавитьПКС(СвойстваШапки, "Проведен",             "", 1);
	//[+]} ИКТ №17494
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Зарплата");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Получение");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "НДФЛ");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаСПревышения", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Получение");

КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ПКО_Документ_ВедомостьВКассу_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	
	ПолученныеДанные.Проведен = Истина;
	
	ЗарплатаXDTO = Неопределено;
	ПравилоКонвертацииФизическиеЛица = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ФизическиеЛица_Получение"); 
	ПравилоКонвертацииСотрудники = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Сотрудники_Получение");
	
	ПолученныеДанные.Зарплата.Очистить();
	ПолученныеДанные.Состав.Очистить();
	ПолученныеДанные.ФизическиеЛица.Очистить(); 
	
	Если ДанныеXDTO.Свойство("AdditionalInfo") И ДанныеXDTO.AdditionalInfo.Свойство("ЭтоУУ") Тогда  
		ИспользоватьЕдиногоСотрудникаУУВВедомостях = ИКТ_ДополнительныеНастройкиСистемы.ПолучитьЗначение("ИспользоватьЕдиногоСотрудникаУУВВедомостях"); 
		ЭтоУУ = ДанныеXDTO.AdditionalInfo.ЭтоУУ И ИспользоватьЕдиногоСотрудникаУУВВедомостях;
	Иначе 
		ЭтоУУ = Ложь;
	КонецЕсли;
	
	Если ЭтоУУ Тогда 
		
		СотрудникУУ = ИКТ_ДополнительныеНастройкиСистемы.ПолучитьЗначение("СотрудникУУ");
		
		НоваяСтрокаЗарплата = ПолученныеДанные.Зарплата.Добавить();
		НоваяСтрокаЗарплата.Сотрудник = СотрудникУУ;
		НоваяСтрокаЗарплата.ФизическоеЛицо = СотрудникУУ.ФизическоеЛицо; 
		НоваяСтрокаЗарплата.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаЗарплата.КВыплате = ДанныеXDTO.СуммаДокумента; 
		НоваяСтрокаЗарплата.ПериодВзаиморасчетов = ПолученныеДанные.ПериодРегистрации;
		
		НоваяСтрокаСостав = ПолученныеДанные.Состав.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСостав, НоваяСтрокаЗарплата); 
		
		НоваяСтрокаФизическиеЛица = ПолученныеДанные.ФизическиеЛица.Добавить();
		НоваяСтрокаФизическиеЛица.ФизическоеЛицо = СотрудникУУ.ФизическоеЛицо;
		
	Иначе 
		
		Если ДанныеXDTO.Свойство("Зарплата", ЗарплатаXDTO)
			И ЗначениеЗаполнено(ЗарплатаXDTO) Тогда
			
			Для Каждого СтрокаЗарплатаXDTO Из ЗарплатаXDTO Цикл
				СтрокаЗарплата = Новый Структура("ИдентификаторСтроки, КВыплате, ФизическоеЛицо, Сотрудник");
				
				ЗаполнитьЗначенияСвойств(СтрокаЗарплата, СтрокаЗарплатаXDTO);
				
				Если ЗначениеЗаполнено(СтрокаЗарплатаXDTO.Сотрудник)
					И ТипЗнч(СтрокаЗарплатаXDTO.Сотрудник) = Тип("Структура") Тогда
					СтрокаЗарплата.Сотрудник = ОбменДаннымиXDTOСервер.СсылкаОбъектаПоУИДОбъектаXDTO(СтрокаЗарплатаXDTO.Сотрудник.Значение, Тип("СправочникСсылка.Сотрудники"), КомпонентыОбмена);	
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрокаЗарплатаXDTO.ФизическоеЛицо)
					И ТипЗнч(СтрокаЗарплатаXDTO.ФизическоеЛицо) = Тип("Структура") Тогда					
					СтрокаЗарплата.ФизическоеЛицо = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, СтрокаЗарплатаXDTO.ФизическоеЛицо, ПравилоКонвертацииФизическиеЛица, "ПолучитьСсылку").Ссылка;
				КонецЕсли;
				
				
				СтрокаЗарплата.КВыплате = СтрокаЗарплатаXDTO.Сумма;
				СтрокаЗарплата.ИдентификаторСтроки = Новый УникальныйИдентификатор(СтрокаЗарплатаXDTO.ИдентификаторСтроки);
								
				НоваяСтрокаЗарплата = ПолученныеДанные.Зарплата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЗарплата, СтрокаЗарплата);
				НоваяСтрокаЗарплата.ПериодВзаиморасчетов = ПолученныеДанные.ПериодРегистрации;                                             
				
				НайденнаяСтрокаСостав = ПолученныеДанные.Состав.Найти(НоваяСтрокаЗарплата.ФизическоеЛицо); 
				Если Не ЗначениеЗаполнено(НайденнаяСтрокаСостав) Тогда 
					НоваяСтрокаСостав = ПолученныеДанные.Состав.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСостав, НоваяСтрокаЗарплата);
				КонецЕсли;
				
				НайденнаяСтрокаФЛ = ПолученныеДанные.ФизическиеЛица.Найти(НоваяСтрокаЗарплата.ФизическоеЛицо); 
				Если Не ЗначениеЗаполнено(НайденнаяСтрокаФЛ) Тогда 
					НоваяСтрокаФизическиеЛица = ПолученныеДанные.ФизическиеЛица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаФизическиеЛица, НоваяСтрокаЗарплата);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	ПолученныеДанные.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.НайтиПоНаименованию("Зарплата за месяц", Истина);
	ПолученныеДанные.Округление = Справочники.СпособыОкругленияПриРасчетеЗарплаты.НайтиПоНаименованию("Без округления", Истина); 
	ПолученныеДанные.ПроцентВыплаты = 100;
	ПолученныеДанные.КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудниковПоСпискуФизическихЛиц(ПолученныеДанные.ФизическиеЛица.ВыгрузитьКолонку("ФизическоеЛицо"), ПолученныеДанные.ПериодРегистрации);

КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ПКО_Документ_ВедомостьВКассу_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	
	Если  ДанныеИБ <> Неопределено Тогда 
		
		ДанныеИБ.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.НайтиПоНаименованию("Зарплата за месяц", Истина);
		ДанныеИБ.Округление = Справочники.СпособыОкругленияПриРасчетеЗарплаты.НайтиПоНаименованию("Без округления", Истина); 
		ДанныеИБ.ПроцентВыплаты = 100;
		
		ДанныеИБ.Зарплата.Очистить(); 
		ДанныеИБ.Состав.Очистить();
		ДанныеИБ.ФизическиеЛица.Очистить();
		
		Для Каждого СтрокаПолученныеДанныеЗарплата Из ПолученныеДанные.Зарплата Цикл 
			СтрокаЗарплата = ДанныеИБ.Зарплата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗарплата, СтрокаПолученныеДанныеЗарплата); 
			СтрокаЗарплата.ПериодВзаиморасчетов = ДанныеИБ.ПериодРегистрации;
			
			НайденнаяСтрокаСостав = ДанныеИБ.Состав.Найти(СтрокаПолученныеДанныеЗарплата.ФизическоеЛицо); 
			Если Не ЗначениеЗаполнено(НайденнаяСтрокаСостав) Тогда 
				НоваяСтрокаСостав = ДанныеИБ.Состав.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСостав, СтрокаПолученныеДанныеЗарплата);
			КонецЕсли;
			
			НайденнаяСтрокаФЛ = ДанныеИБ.ФизическиеЛица.Найти(СтрокаПолученныеДанныеЗарплата.ФизическоеЛицо); 
			Если Не ЗначениеЗаполнено(НайденнаяСтрокаФЛ) Тогда 
				НоваяСтрокаФизическиеЛица = ДанныеИБ.ФизическиеЛица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаФизическиеЛица, СтрокаПолученныеДанныеЗарплата);
			КонецЕсли;
		КонецЦикла;  
		
		ДанныеИБ.КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудниковПоСпискуФизическихЛиц(ДанныеИБ.ФизическиеЛица.ВыгрузитьКолонку("ФизическоеЛицо"), ДанныеИБ.ПериодРегистрации);

	КонецЕсли;
	
КонецПроцедуры //[+]} ИКТ №16316
#КонецОбласти                   

#Область ИКТ_ДокументВедомостьВБанк

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ДобавитьПКО_ДокументВедомостьВБанк_Получение(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ВедомостьВБанк_Получение";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВБанк;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ВедомостьНаВыплатуЗарплаты";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Документ_ВедомостьВБанк_Получение_ПриКонвертацииДанныхXDTO";  
	ПравилоКонвертации.ВариантИдентификации         = "ПоПолямПоиска"; 
	ПравилоКонвертации.ПоляПоиска.Добавить("Дата,Номер,Организация");
	
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_ВедомостьВБанк_Получение_ПередЗаписьюПолученныхДанных";
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",              "ДатаВедомости");
	ДобавитьПКС(СвойстваШапки, "",                  "Комментарий", 1);
	ДобавитьПКС(СвойстваШапки, "Номер",             "НомерВедомости");
	ДобавитьПКС(СвойстваШапки, "Организация",       "Организация", , "Справочник_Организации_Получение");
	ДобавитьПКС(СвойстваШапки, "ПериодРегистрации", "ПериодВыплаты");
	ДобавитьПКС(СвойстваШапки, "Подразделение",     "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Получение");
	ДобавитьПКС(СвойстваШапки, "",                  "СпособВыплаты", 1);
	ДобавитьПКС(СвойстваШапки, "",                  "СпособРасчетов", 1);
	ДобавитьПКС(СвойстваШапки, "СуммаПоДокументу",  "СуммаДокумента");
	//{[+] ИКТ №17494 (фрагмент ДОБАВЛЕН), Воробьев, 12.04.2026)
	ДобавитьПКС(СвойстваШапки, "Проведен",             "", 1);
	//[+]} ИКТ №17494
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Зарплата");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Получение");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "НДФЛ");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаСПревышения", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Получение");

КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ПКО_Документ_ВедомостьВБанк_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	
	ПолученныеДанные.Проведен = Истина;
	
	ЗарплатаXDTO = Неопределено;
	ПравилоКонвертацииФизическиеЛица = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ФизическиеЛица_Получение"); 
	ПравилоКонвертацииСотрудники = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Сотрудники_Получение");
	
	ПолученныеДанные.Зарплата.Очистить();
	ПолученныеДанные.Состав.Очистить();
	ПолученныеДанные.ФизическиеЛица.Очистить(); 
	
	Если ДанныеXDTO.Свойство("AdditionalInfo") И ДанныеXDTO.AdditionalInfo.Свойство("ЭтоУУ") Тогда  
		ИспользоватьЕдиногоСотрудникаУУВВедомостях = ИКТ_ДополнительныеНастройкиСистемы.ПолучитьЗначение("ИспользоватьЕдиногоСотрудникаУУВВедомостях"); 
		ЭтоУУ = ДанныеXDTO.AdditionalInfo.ЭтоУУ И ИспользоватьЕдиногоСотрудникаУУВВедомостях;
	Иначе 
		ЭтоУУ = Ложь;
	КонецЕсли;
		
	Если ЭтоУУ Тогда 
		
		СотрудникУУ = ИКТ_ДополнительныеНастройкиСистемы.ПолучитьЗначение("СотрудникУУ");
		
		НоваяСтрокаЗарплата = ПолученныеДанные.Зарплата.Добавить();
		НоваяСтрокаЗарплата.Сотрудник = СотрудникУУ;
		НоваяСтрокаЗарплата.ФизическоеЛицо = СотрудникУУ.ФизическоеЛицо; 
		НоваяСтрокаЗарплата.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаЗарплата.КВыплате = ДанныеXDTO.СуммаДокумента;
		
		НоваяСтрокаСостав = ПолученныеДанные.Состав.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСостав, НоваяСтрокаЗарплата); 
		
		НоваяСтрокаФизическиеЛица = ПолученныеДанные.ФизическиеЛица.Добавить();
		НоваяСтрокаФизическиеЛица.ФизическоеЛицо = СотрудникУУ.ФизическоеЛицо;
		
	Иначе 
		
		Если ДанныеXDTO.Свойство("Зарплата", ЗарплатаXDTO)
			И ЗначениеЗаполнено(ЗарплатаXDTO) Тогда
			
			Для Каждого СтрокаЗарплатаXDTO Из ЗарплатаXDTO Цикл
				СтрокаЗарплата = Новый Структура("ИдентификаторСтроки, КВыплате, ФизическоеЛицо, Сотрудник");
				
				ЗаполнитьЗначенияСвойств(СтрокаЗарплата, СтрокаЗарплатаXDTO);
				
				
				Если ЗначениеЗаполнено(СтрокаЗарплатаXDTO.Сотрудник)
					И ТипЗнч(СтрокаЗарплатаXDTO.Сотрудник) = Тип("Структура") Тогда
					СтрокаЗарплата.Сотрудник = ОбменДаннымиXDTOСервер.СсылкаОбъектаПоУИДОбъектаXDTO(СтрокаЗарплатаXDTO.Сотрудник.Значение, Тип("СправочникСсылка.Сотрудники"), КомпонентыОбмена);	
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(СтрокаЗарплатаXDTO.ФизическоеЛицо)
					И ТипЗнч(СтрокаЗарплатаXDTO.ФизическоеЛицо) = Тип("Структура") Тогда					
					СтрокаЗарплата.ФизическоеЛицо = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, СтрокаЗарплатаXDTO.ФизическоеЛицо, ПравилоКонвертацииФизическиеЛица, "ПолучитьСсылку").Ссылка;
				КонецЕсли;
				
				
				СтрокаЗарплата.КВыплате = СтрокаЗарплатаXDTO.Сумма;
				СтрокаЗарплата.ИдентификаторСтроки = Новый УникальныйИдентификатор(СтрокаЗарплатаXDTO.ИдентификаторСтроки);
				
				НоваяСтрокаЗарплата = ПолученныеДанные.Зарплата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаЗарплата, СтрокаЗарплата);
				НоваяСтрокаЗарплата.ПериодВзаиморасчетов = ПолученныеДанные.ПериодРегистрации;                                             
				
				НайденнаяСтрокаСостав = ПолученныеДанные.Состав.Найти(НоваяСтрокаЗарплата.ФизическоеЛицо); 
				Если Не ЗначениеЗаполнено(НайденнаяСтрокаСостав) Тогда 
					НоваяСтрокаСостав = ПолученныеДанные.Состав.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСостав, НоваяСтрокаЗарплата);
				КонецЕсли;
				
				НайденнаяСтрокаФЛ = ПолученныеДанные.ФизическиеЛица.Найти(НоваяСтрокаЗарплата.ФизическоеЛицо); 
				Если Не ЗначениеЗаполнено(НайденнаяСтрокаФЛ) Тогда 
					НоваяСтрокаФизическиеЛица = ПолученныеДанные.ФизическиеЛица.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаФизическиеЛица, НоваяСтрокаЗарплата);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПолученныеДанные.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.НайтиПоНаименованию("Зарплата за месяц", Истина);
	ПолученныеДанные.Округление = Справочники.СпособыОкругленияПриРасчетеЗарплаты.НайтиПоНаименованию("Без округления", Истина); 
	ПолученныеДанные.ПроцентВыплаты = 100;
	ПолученныеДанные.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ДоходыБезОграниченияВзысканий;		 
	ПолученныеДанные.КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудниковПоСпискуФизическихЛиц(ПолученныеДанные.ФизическиеЛица.ВыгрузитьКолонку("ФизическоеЛицо"), ПолученныеДанные.ПериодРегистрации);
	 
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ПКО_Документ_ВедомостьВБанк_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	
	Если ДанныеИБ <> Неопределено Тогда 
		
		ДанныеИБ.СпособВыплаты = Справочники.СпособыВыплатыЗарплаты.НайтиПоНаименованию("Зарплата за месяц", Истина);
		ДанныеИБ.Округление = Справочники.СпособыОкругленияПриРасчетеЗарплаты.НайтиПоНаименованию("Без округления", Истина); 
		ДанныеИБ.ПроцентВыплаты = 100; 
		ДанныеИБ.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ДоходыБезОграниченияВзысканий;

		
		ДанныеИБ.Зарплата.Очистить(); 
		ДанныеИБ.Состав.Очистить();
		ДанныеИБ.ФизическиеЛица.Очистить();
		
		Для Каждого СтрокаПолученныеДанныеЗарплата Из ПолученныеДанные.Зарплата Цикл 
			СтрокаЗарплата = ДанныеИБ.Зарплата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗарплата, СтрокаПолученныеДанныеЗарплата); 
			СтрокаЗарплата.ПериодВзаиморасчетов = ДанныеИБ.ПериодРегистрации;
			
			НайденнаяСтрокаСостав = ДанныеИБ.Состав.Найти(СтрокаПолученныеДанныеЗарплата.ФизическоеЛицо); 
			Если Не ЗначениеЗаполнено(НайденнаяСтрокаСостав) Тогда 
				НоваяСтрокаСостав = ДанныеИБ.Состав.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСостав, СтрокаПолученныеДанныеЗарплата);
			КонецЕсли;
			
			НайденнаяСтрокаФЛ = ДанныеИБ.ФизическиеЛица.Найти(СтрокаПолученныеДанныеЗарплата.ФизическоеЛицо); 
			Если Не ЗначениеЗаполнено(НайденнаяСтрокаФЛ) Тогда 
				НоваяСтрокаФизическиеЛица = ДанныеИБ.ФизическиеЛица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаФизическиеЛица, СтрокаПолученныеДанныеЗарплата);
			КонецЕсли;
		КонецЦикла;  
		
		ДанныеИБ.КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудниковПоСпискуФизическихЛиц(ДанныеИБ.ФизическиеЛица.ВыгрузитьКолонку("ФизическоеЛицо"), ДанныеИБ.ПериодРегистрации);

	КонецЕсли;
	
КонецПроцедуры //[+]} ИКТ №16316
#КонецОбласти

#Область ИКТ_ПереопределениеОбщихПроцедурЗарплатыНаВыплату

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&ИзменениеИКонтроль("ДобавитьПОД_Документ_ВедомостьНаВыплатуЗарплаты_Получение")
Процедура ИКТ_ДобавитьПОД_Документ_ВедомостьНаВыплатуЗарплаты_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ВедомостьНаВыплатуЗарплаты_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Документ.ВедомостьНаВыплатуЗарплаты"; //@NON-NLS-1
	ПравилоОбработки.ПриОбработке            = "ПОД_Документ_ВедомостьНаВыплатуЗарплаты_Получение_ПриОбработке";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьВЗаявку_Выплата_Получение");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьВЗаявку_НДФЛ_Получение");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьВЗаявку_НДФЛСПревыш_Получение");  
	#Вставка  
	//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьВКассу_Получение");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьВБанк_Получение");
	//[+]} ИКТ №16316
	#КонецВставки
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ПОД_Документ_ВедомостьНаВыплатуЗарплаты_Получение_ПриОбработке")
Процедура ИКТ_ПОД_Документ_ВедомостьНаВыплатуЗарплаты_Получение_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	
	Если ТипЗнч(ДанныеXDTO.СпособВыплаты) = Тип("Структура") 
		И ДанныеXDTO.СпособВыплаты.Значение = "ЧерезКассу" Тогда 
		ИспользованиеПКО["Документ_ВедомостьВКассу_Получение"] = Истина; 
		ИспользованиеПКО["Документ_ВедомостьВБанк_Получение"] = Ложь;
	ИначеЕсли ТипЗнч(ДанныеXDTO.СпособВыплаты) = Тип("Структура") 
		И ДанныеXDTO.СпособВыплаты.Значение = "ЧерезБанк" Тогда 
		ИспользованиеПКО["Документ_ВедомостьВКассу_Получение"] = Ложь; 
		ИспользованиеПКО["Документ_ВедомостьВБанк_Получение"] = Истина;
	Иначе 
		ИспользованиеПКО["Документ_ВедомостьВКассу_Получение"] = Ложь; 
		ИспользованиеПКО["Документ_ВедомостьВБанк_Получение"] = Ложь;
	КонецЕсли;

КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура ИКТ_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)
	ДобавитьПКО_Справочник_ГрафикиРаботыСотрудников(ПравилаКонвертации);
	Если НаправлениеОбмена = "Получение" Тогда
		ДобавитьПКО_ДокументВедомостьВКассу_Получение(ПравилаКонвертации);
		ДобавитьПКО_ДокументВедомостьВБанк_Получение(ПравилаКонвертации);
		ДобавитьПКО_РегистрСведений_ГрафикРаботыСотрудников_Получение(ПравилаКонвертации); 
	ИначеЕсли НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПКО_Документ_ДанныеДляРасчетаЗарплаты(ПравилаКонвертации);
	КонецЕсли;                                 
	ДобавитьПКО_Справочник_ПоказателиРасчетаЗарплаты(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты(ПравилаКонвертации);
КонецПроцедуры //[+]} ИКТ №16316
 
//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ЗаполнитьПравилаОбработкиДанных")
Процедура ИКТ_ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных)
	Если НаправлениеОбмена = "Получение" Тогда
		ДобавитьПОД_ИКТ_СобытияПроходаСКУД_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГрафикиРаботыСотрудников_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГрафикРаботыСотрудников_Получение(ПравилаОбработкиДанных);  
		ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Получение(ПравилаОбработкиДанных);
	ИначеЕсли НаправлениеОбмена = "Отправка" Тогда   
		ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ДанныеДляРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ВыполнитьПроцедуруМодуляМенеджера")
Процедура ИКТ_ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "ПОД_ИКТ_СобытияПроходаСКУД_Получение_ПриОбработке" Тогда 
		ПОД_ИКТ_СобытияПроходаСКУД_Получение_ПриОбработке(
		Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена); 
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьВКассу_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Документ_ВедомостьВКассу_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена); 
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьВБанк_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Документ_ВедомостьВБанк_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);

    ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьВКассу_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_ВедомостьВКассу_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьВБанк_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_ВедомостьВБанк_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Справочник_ГрафикРаботыСотрудников_Получение_ПриОбработке" Тогда 
		ПОД_Справочник_ГрафикРаботыСотрудников_Получение_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
    КонецЕсли;
КонецПроцедуры //[+]} ИКТ №16316
#КонецОбласти

#Область ИКТ_УниверальныйПроцедурыИФункции
//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Функция ИКТ_ПространствоИмен() Экспорт  
	Возврат "http://v8.1c.ru/edi/edi_ext_ikt/EnterpriseData/1.20";
КонецФункции //[+]} ИКТ №16316
#КонецОбласти   

#Область ИКТ_СправочникГрафикиРаботыСотрудников
Процедура ДобавитьПОД_Справочник_ГрафикиРаботыСотрудников_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ГрафикиРаботыСотрудников_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.ГрафикиРаботыСотрудников";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ГрафикиРаботыСотрудников");
КонецПроцедуры                                                                       

Процедура ДобавитьПКО_Справочник_ГрафикиРаботыСотрудников(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_ГрафикиРаботыСотрудников";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.ГрафикиРаботыСотрудников;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ГрафикиРаботыСотрудников";
	//ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ГрафикиРаботыСотрудников_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации         = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование"); 
	
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
КонецПроцедуры  

//Процедура ПКО_Справочник_ГрафикиРаботыСотрудников_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
//	Если НЕ ДанныеИБ = Неопределено Тогда
//		 //ДанныеИБ.ТипРезерва = ПредопределенноеЗначение("Перечисление.ТипыРезервовПредстоящихРасходов.ОплатаТруда");
//	ИначеЕсли НЕ ПолученныеДанные = Неопределено Тогда	
//		 //ПолученныеДанные.ТипРезерва = ПредопределенноеЗначение("Перечисление.ТипыРезервовПредстоящихРасходов.ОплатаТруда");
//	КонецЕсли;
//КонецПроцедуры
#КонецОбласти 

#Область ИКТ_РегистрСведенийГрафикиРаботы

Процедура ДобавитьПОД_Справочник_ГрафикРаботыСотрудников_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ГрафикРаботыСотрудников_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.ГрафикРаботыСотрудников"; //@NON-NLS-1
	ПравилоОбработки.ПриОбработке            = "ПОД_Справочник_ГрафикРаботыСотрудников_Получение_ПриОбработке";
КонецПроцедуры

Процедура ПОД_Справочник_ГрафикРаботыСотрудников_Получение_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	Период = ДанныеXDTO.КлючевыеСвойства.Дата;
	МассивСтрок = Новый Массив; 
	
	Если ДанныеXDTO.Свойство("Записи")
		И ЗначениеЗаполнено(ДанныеXDTO.Записи) Тогда
		ПКООрганизация    				= ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Организации_Получение");
		ПКОССотрудник     				= ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Сотрудники_Получение");
		ПКОГрафикиРаботыСотрудников     = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ГрафикиРаботыСотрудников");
		Для каждого Строка Из ДанныеXDTO.Записи Цикл
			СтруктураДанныхСтроки = Новый Структура; 
	
			СтруктураДанныхСтроки.Вставить("ДействуетДо", Строка.ДействуетДо); 
			СтруктураДанныхСтроки.Вставить("Период", Строка.ДатаСобытия);						 
			ГоловнаяОрганизация = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(
				КомпонентыОбмена, 
				Строка.ГоловнаяОрганизация, 
				ПКООрганизация, 
				"ПолучитьСсылку");
	        СтруктураДанныхСтроки.Вставить("ГоловнаяОрганизация", ГоловнаяОрганизация.Ссылка);
				
			ГрафикРаботы = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(
				КомпонентыОбмена, 
				Строка.ГрафикРаботы, 
				ПКОГрафикиРаботыСотрудников, 
				"ПолучитьСсылку");
	        СтруктураДанныхСтроки.Вставить("ГрафикРаботы", ГрафикРаботы.Ссылка);	
				
			Сотрудник = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(
				КомпонентыОбмена, 
				Строка.Сотрудник, 
				ПКОССотрудник, 
				"ПолучитьСсылку");
	        СтруктураДанныхСтроки.Вставить("Сотрудник", Сотрудник.Ссылка); 
				
			МассивСтрок.Добавить(СтруктураДанныхСтроки);
			
		КонецЦикла;
			
	КонецЕсли;      
	СсылкаНаДокумент = ДанныеXDTO.КлючевыеСвойства.Ссылка; 
	СтрукутраРеквизитов = Новый Структура;
	СтрукутраРеквизитов.Вставить("Период", Период);
	СтрукутраРеквизитов.Вставить("ГоловнаяОрганизация", ГоловнаяОрганизация);
	СтрукутраРеквизитов.Вставить("СсылкаНаДокумент", СсылкаНаДокумент); 
	СтрукутраРеквизитов.Вставить("УзелКорреспондента", КомпонентыОбмена.УзелКорреспондента); 
	ИмяРегистраКадровыхДанных = "ГрафикРаботыСотрудников";
	ЗаписатьДвиженияКадровогоУчета(МассивСтрок, СтрукутраРеквизитов, ИмяРегистраКадровыхДанных);
	ПолученныеДанные = Неопределено;
КонецПроцедуры

Процедура ДобавитьПКО_РегистрСведений_ГрафикРаботыСотрудников_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "РегистрСведений_ГрафикРаботыСотрудников_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.РегистрыСведений.ГрафикРаботыСотрудников;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ГрафикРаботыСотрудников"; //@NON-NLS-1
	ПравилоКонвертации.ВариантИдентификации         = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "Дата", 1);
	ДобавитьПКС(СвойстваШапки, "", "Номер", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Записи");
	ДобавитьПКС(СвойстваТЧ, "ГрафикРаботы",        "ГрафикиРаботыСотрудников", 1, "Справочник_ГрафикиРаботыСотрудников", ИКТ_ПространствоИмен());
	ДобавитьПКС(СвойстваТЧ, "ГоловнаяОрганизация", "ГоловнаяОрганизация", 1, "Справочник_Организации_Получение");
	ДобавитьПКС(СвойстваТЧ, "ДействуетДо",         "ДействуетДо", 1); 
	ДобавитьПКС(СвойстваТЧ, "ДатаСобытия",         "ДатаСобытия", 1);
	ДобавитьПКС(СвойстваТЧ, "Сотрудник",           "Сотрудник", 1, "Справочник_Сотрудники_Получение");
	
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());

КонецПроцедуры

&ИзменениеИКонтроль("ЗаписатьДвиженияКадровогоУчета")
Процедура ИКТ_ЗаписатьДвиженияКадровогоУчета(МассивСтрок, СтрукутраРеквизитов, ИмяРегистраКадровыхДанных)
	ТаблицаИзменяемыхДанных = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", СтрукутраРеквизитов.УзелКорреспондента);
	Запрос.УстановитьПараметр("Идентификатор", СтрукутраРеквизитов.СсылкаНаДокумент.Значение);
	Запрос.Текст = "ВЫБРАТЬ
	|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|ГДЕ
	|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор = &Идентификатор
	|	И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Документ = Выборка.Ссылка;
	КонецЕсли;

	КадровыеДанныеСотрудников = РегистрыСведений[ИмяРегистраКадровыхДанных].СоздатьНаборЗаписей(); 
	КадровыеДанныеСотрудников.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	Если Документ = Неопределено Тогда
		ДокументОбъект = Документы.ПереносДанных.СоздатьДокумент();
		ДокументОбъект.Дата = КонецДня(СтрукутраРеквизитов.Период);
		ДокументОбъект.Комментарий = "Создан при обмене с ЗУП.";
		ДокументОбъект.ПериодРегистрации = НачалоДня(СтрукутраРеквизитов.Период);
		ДокументОбъект.Организация = СтрукутраРеквизитов.ГоловнаяОрганизация;
		ДокументОбъект.УстановитьНовыйНомер(); 
	Иначеесли ЗначениеЗаполнено(Документ) Тогда  
		ДокументОбъект = Документ.ПолучитьОбъект();
	КонецЕсли;

	Если ДокументОбъект.ТаблицаРегистров.Найти(ИмяРегистраКадровыхДанных, "Имя") = Неопределено Тогда
		ДокументОбъект.ТаблицаРегистров.Добавить().Имя = ИмяРегистраКадровыхДанных;
		ДокументОбъект.Записать();
		СтруктураЗаписи = Новый Структура; 
		СтруктураЗаписи.Вставить("Идентификатор", СтрукутраРеквизитов.СсылкаНаДокумент.Значение);
		СтруктураЗаписи.Вставить("Ссылка", ДокументОбъект.Ссылка); 
		СтруктураЗаписи.Вставить("УзелИнформационнойБазы", СтрукутраРеквизитов.УзелКорреспондента);
		ОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "ПубличныеИдентификаторыСинхронизируемыхОбъектов", Истина);
	КонецЕсли;

	КадровыеДанныеСотрудников.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
	Для Каждого Запись Из МассивСтрок Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыеДанные.Регистратор КАК Регистратор, 
		|	КадровыеДанные.Период КАК Период
		|ИЗ
		|	РегистрКадровыхДанных КАК КадровыеДанные
		|ГДЕ
		|	КадровыеДанные.Сотрудник = &Сотрудник
		|	И КадровыеДанные.Период = &Период
		|	И КадровыеДанные.ФизическоеЛицо = &ФизическоеЛицо
		|	И КадровыеДанные.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И КадровыеДанные.Регистратор <> &Регистратор";                     
		#Вставка                         
		//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 29.03.2026)
		Если ИмяРегистраКадровыхДанных = "ГрафикРаботыСотрудников" Тогда 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КадровыеДанные.Регистратор КАК Регистратор, 
			|	КадровыеДанные.Период КАК Период
			|ИЗ
			|	РегистрКадровыхДанных КАК КадровыеДанные
			|ГДЕ
			|	КадровыеДанные.Сотрудник = &Сотрудник
			|	И КадровыеДанные.Период = &Период
			|	И КадровыеДанные.ГоловнаяОрганизация = &ГоловнаяОрганизация
			|	И КадровыеДанные.Регистратор <> &Регистратор";
		КонецЕсли;
		//[+]} ИКТ №16316
		#КонецВставки

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрКадровыхДанных", "РегистрСведений." + строка(ИмяРегистраКадровыхДанных) + ".СрезПоследних");
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", Запись.ГоловнаяОрганизация);
		Запрос.УстановитьПараметр("Период", Запись.Период);
		Запрос.УстановитьПараметр("Сотрудник", Запись.Сотрудник);
		#Удаление
		Запрос.УстановитьПараметр("ФизическоеЛицо", Запись.ФизическоеЛицо);  
		#КонецУдаления
		#Вставка                         
		//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 29.03.2026)
		Если ИмяРегистраКадровыхДанных <> "ГрафикРаботыСотрудников" Тогда 
			Запрос.УстановитьПараметр("ФизическоеЛицо", Запись.ФизическоеЛицо);
		КонецЕсли;
		//[+]} ИКТ №16316
		#КонецВставки
		Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка =  РезультатЗапроса.Выгрузить();
		Если РезультатЗапроса.Пустой() Тогда
			ЗаполнитьЗначенияСвойств(КадровыеДанныеСотрудников.Добавить(), Запись);
		КонецЕсли;
	КонецЦикла;
	Попытка
		КадровыеДанныеСотрудников.Записать(Истина);  
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти  

#Область ИКТ_СправочникПоказателиРасчетаЗарплаты
Процедура ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ПоказателиРасчетаЗарплаты_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.ПоказателиРасчетаЗарплаты";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ПоказателиРасчетаЗарплаты");
КонецПроцедуры                                                                       

Процедура ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ПоказателиРасчетаЗарплаты_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ПоказателиРасчетаЗарплаты;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ПоказателиРасчетаЗарплаты");
КонецПроцедуры                                                                       

Процедура ДобавитьПКО_Справочник_ПоказателиРасчетаЗарплаты(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_ПоказателиРасчетаЗарплаты";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.ПоказателиРасчетаЗарплаты;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ПоказателиРасчетаЗарплаты";
	//ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ПоказателиРасчетаЗарплаты_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
	ДобавитьПКС(СвойстваШапки, "Идентификатор", "Идентификатор");
	ДобавитьПКС(СвойстваШапки, "КраткоеНаименование", "КраткоеНаименование");
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Идентификатор");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
	
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
КонецПроцедуры  
#КонецОбласти   

#Область ИКТ_ВидыДокументовВводДанныхДляРасчетаЗарплаты 
Процедура ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты");
КонецПроцедуры                                                                       

Процедура ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты");
КонецПроцедуры 

Процедура ДобавитьПКО_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");

	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры

#КонецОбласти

#Область ИКТ_ДанныеДляРасчетаЗарплаты                                                                      

Процедура ДобавитьПОД_Документ_ДанныеДляРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ДанныеДляРасчетаЗарплаты_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ДанныеДляРасчетаЗарплаты;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ДанныеДляРасчетаЗарплаты");
КонецПроцедуры                                                                       

Процедура ДобавитьПКО_Документ_ДанныеДляРасчетаЗарплаты(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ДанныеДляРасчетаЗарплаты";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ДанныеДляРасчетаЗарплаты;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ДанныеДляРасчетаЗарплаты";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",                                 "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий",                          "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Номер",                                "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",                          "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "Период",            		           "Период");
   	ДобавитьПКС(СвойстваШапки, "ПериодОкончания",                      "ПериодОкончания");
	ДобавитьПКС(СвойстваШапки, "Подразделение",                        "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Отправка");
	ДобавитьПКС(СвойстваШапки, "ПодразделениеУчетаЗатрат",             "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Отправка");
	ДобавитьПКС(СвойстваШапки, "ВидДокумента",			               "ВидДокумента", , "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты");
	ДобавитьПКС(СвойстваШапки, "КраткийСоставДокумента",               "КраткийСоставДокумента"); 
	ДобавитьПКС(СвойстваШапки, "Сотрудник",				               "Сотрудник", , "Справочник_Сотрудники_Отправка");    
	ДобавитьПКС(СвойстваШапки, "СпособОтраженияЗарплатыВБухучете", "СпособОтраженияЗарплатыВБухучете", , "Справочник_СпособыОтраженияЗарплатыВБухУчете");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ЗначенияПоказателей", "ЗначенияПоказателей");
	
	ДобавитьПКС(СвойстваТЧ, "Объект", "Объект", , "Справочник_Сотрудники_Отправка"); 
	ДобавитьПКС(СвойстваТЧ, "Показатель", "Показатель", , "Справочник_ПоказателиРасчетаЗарплаты"); 
	ДобавитьПКС(СвойстваТЧ, "Значение", "Значение");
	ДобавитьПКС(СвойстваТЧ, "Период", "Период");
	ДобавитьПКС(СвойстваТЧ, "ПериодОкончания", "ПериодОкончания");
	ДобавитьПКС(СвойстваТЧ, "Коэффициент", "Коэффициент");  
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ФизическиеЛица", "ФизическиеЛица");	
	ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "ФизическоеЛицо", , "Справочник_ФизическиеЛица_Отправка"); 

	
КонецПроцедуры

#КонецОбласти 