#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение И упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() 
		И Не Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		МенеджерЗначенияКонстанты = 
			Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.СоздатьМенеджерЗначения();
		МенеджерЗначенияКонстанты.Значение = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначенияКонстанты);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли