&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	///ИТК Ал_ 24.07.2025
	//Задача № 9296
	
	НовыйЭлемент = Элементы.Добавить("ИКТ_СкопироватьФайлыИзЗаказа", Тип("КнопкаФормы"), Элементы.ПодменюДобавить);
	НовыйЭлемент.ИмяКоманды = "ИКТ_СкопироватьФайлыИзЗаказа";
	
	ВладелецЗРДС = ТипЗнч(Владелец)=Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств");	
	ДокументОснование = Неопределено;
	
	Если ВладелецЗРДС Тогда	
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ДокументОснование");
	КонецЕсли;
	
	НовыйЭлемент.Видимость = ВладелецЗРДС И ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказПоставщику");	
	
	///Ал__ 24.07.2025
	
	//{[+] ИКТ №20864 (фрагмент ДОБАВЛЕН), Новоселов, 12.08.2026
	ДобавитьИзменитьРеквизиты();
	
	УстановитьУсловноеОформление();  //[+] ИКТ №21032 (строка ДОБАВЛЕНА), Новоселов, 20.08.2026 
	
	// Отсекаем все не упошное
	Если НЕ (ТипЗнч(Владелец) = Тип("СправочникСсылка.Проекты")
			ИЛИ ТипЗнч(Владелец) = Тип("ДокументСсылка.упоПроектнаяЗадача")
			ИЛИ ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания")) Тогда 
		Возврат;
	КонецЕсли;
	//[+]} ИКТ №20864
	
	//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 30.07.2026 
	Если (ТипЗнч(Параметры.ВладелецФайла) = Тип("СправочникСсылка.Проекты")
				И Не Пользователи.РолиДоступны("ИКТ_ПросмотрДобавлениеПрисоединенныхФайловПроектов, ИКТ_РедактированиеПрисоединенныхФайловПроектов")) 
			ИЛИ ((ТипЗнч(Параметры.ВладелецФайла) = Тип("ДокументСсылка.упоПроектнаяЗадача")
				ИЛИ ТипЗнч(Параметры.ВладелецФайла) = Тип("СправочникСсылка.упоЗадания"))
					И Не Пользователи.РолиДоступны("ИКТ_ПросмотрДобавлениеПрисоединенныхФайловПроектныхЗадачЗаданий, ИКТ_РедактированиеПрисоединенныхФайловПроектныхЗадачЗаданий")) Тогда
		ВызватьИсключение("Данному пользователю недоступен просмотр файлов проектов");
	КонецЕсли;
	//[+]} ИКТ №20612
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзменитьРеквизиты()
	
	//{[+] ИКТ №20864 (фрагмент ДОБАВЛЕН), Новоселов, 12.08.2026 
	ДобавляемыеРеквизиты = Новый Массив;
	
	НовРеквизит = Новый РеквизитФормы(
		"ВладелецФайла",
		Новый ОписаниеТипов(),
		"ДеревоФайлов",
		"Размещение");
	ДобавляемыеРеквизиты.Добавить(НовРеквизит);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Вставить("ДеревоФайловВладелецФайла", Тип("ПолеФормы"), Элементы.ДеревоФайлов, Элементы.СписокГруппаИмяОписание);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "ДеревоФайлов.ВладелецФайла";
	НовыйЭлемент.Заголовок = "Размещение";
	
	ДеревоФайловОписание = Элементы.ДеревоФайловОписание;
	Элементы.Переместить(ДеревоФайловОписание, Элементы.ДеревоФайлов);
	ДеревоФайловОписание.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	//[+]} ИКТ №20864

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//{[+] ИКТ №21032 (фрагмент ДОБАВЛЕН), Новоселов, 20.08.2026 Для файлов из документооборота размещение пустое, заполняем строкой "Документооборот"
	ЭлементОформления = ЭтаФорма.УсловноеОформление.Элементы.Добавить();

	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоФайлов.ВладелецФайла");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Документооборот");

	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоФайловВладелецФайла");
	//[+]} ИКТ №21032

КонецПроцедуры

#Область Задача9296
///ИТК Ал_ 28.07.2025

&НаКлиенте
Процедура ИКТ_СкопироватьФайлыИзЗаказаПосле(Команда)
	
	ВладелецПрисоединенныхФайлов = ИКТ_ВернутьЗаказПоставщику(Владелец);	
	
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = Неопределено;
	
	ИспользоватьДОДляХраненияФайловОбъекта =
		РаботаСФайламиСлужебныйКлиент.Используется1СДокументооборотДляХраненияФайловОбъекта(
			ВладелецПрисоединенныхФайлов,
			Неопределено,
			Команда,
			МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент);
			
	Если ИспользоватьДОДляХраненияФайловОбъекта Тогда
						
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		ПараметрыОткрытия = МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыОткрытияСпискаФайлов();
				
		ПараметрыОткрытия.Вставить("ВладелецФайла", ВладелецПрисоединенныхФайлов);
	
		//ВладелецФормы = ПараметрыОткрытия.ВладелецФормы;
		ПараметрыОткрытия.Удалить("ВладелецФормы");
	
		//Окно = ПараметрыОткрытия.Окно;
		ПараметрыОткрытия.Удалить("Окно");
	
		Если ЗначениеЗаполнено(ПараметрыОткрытия.Уникальность) Тогда
			Уникальность = ПараметрыОткрытия.Уникальность;
		Иначе
			Уникальность = ВладелецПрисоединенныхФайлов;
		КонецЕсли;
		
		ОткрытьФорму(
			"Обработка.ИнтеграцияС1СДокументооборот3.Форма.ИКТ_ВыборФайловДляКопирования",
			ПараметрыОткрытия,
			ВладелецФормы,
			Уникальность,
			,,
			Новый ОписаниеОповещения("ИКТ_ПослеВыбораФайловДляКопирования", ЭтотОбъект), 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИКТ_ВернутьЗаказПоставщику(Владелец)
		
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ДокументОснование");
	
КонецФункции

&НаКлиенте
Процедура ИКТ_ПослеВыбораФайловДляКопирования(Результат, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Массив") Тогда		
		Возврат;	
	КонецЕсли;
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ИКТ_ПослеВыбораФайловДляКопированияЗавершение", ЭтотОбъект, Результат);
	Если ЗначениеЗаполнено(ID) Тогда // Связанный объект уже известен.
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Неопределено);
	Иначе // Связанный объект следует найти или создать.
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.НачатьПоискСвязанногоОбъектаДО(
			Владелец,
			ОписаниеОповещения,,,
			Ложь);
	КонецЕсли;
	
	//ИКТ_СкопироватьФайлыНаСервере(Результат);
	
	ОбновитьСписокФайловКлиент();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИКТ_ПослеВыбораФайловДляКопированияЗавершение(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ID = Результат.ID;
		Тип = Результат.type;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ID) Тогда
		Возврат;
	КонецЕсли;
	
	ИКТ_СкопироватьФайлыНаСервере(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_СкопироватьФайлыНаСервере(МассивФайлов)
	
	Для Каждого стр Из МассивФайлов Цикл
		Если НЕ ЗначениеЗаполнено(стр) Тогда
			ПРодолжить;
		КонецЕсли;
		
		АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(
			Неопределено,
			УникальныйИдентификатор);
			
		ОписаниеФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОписаниеФайла(
			стр,,
			АдресВременногоХранилищаФайла);
			
		ИКТ_СоздатьИзОригинала(ОписаниеФайла, АдресВременногоХранилищаФайла);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_СоздатьИзОригинала(ОписаниеФайла, АдресВременногоХранилищаФайла)
	
	ДанныеФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(
		ОписаниеФайла.Наименование,
		Неопределено,
		"DMFile",
		ОписаниеФайла.Расширение,
		ОписаниеФайла.РольФайлаID);
	ДанныеФайла.Описание = ОписаниеФайла.Описание;
	ДанныеФайла.Размер = ОписаниеФайла.Размер;
	//ДанныеФайла.ДатаМодификации = ОписаниеФайла.ДатаМодификации;
	//ДанныеФайла.ДатаМодификацииУниверсальная = ОписаниеФайла.ДатаМодификацииУниверсальная;
	
	ПараметрыСоздания = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НовыеПараметрыСозданияФайла(ДанныеФайла);
	ПараметрыСоздания.АдресВременногоХранилищаФайла = АдресВременногоХранилищаФайла;
	ПараметрыСоздания.Владелец = Владелец;
	//ПараметрыСоздания.ЯвляетсяСканКопией = ЯвляетсяОригиналом;
	
	НовыйФайлID = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьФайлВДокументообороте(
		ПараметрыСоздания,
		ID,
		Тип,
		Строка(Владелец));
		
КонецПроцедуры
///Ал__ 28.07.2025

#КонецОбласти

&НаКлиенте
&ИзменениеИКонтроль("УстановитьДоступностьКомандСпискаФайлов")
Процедура Расш1_УстановитьДоступностьКомандСпискаФайлов()

	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или Не ОбновлениеУспешноЗавершено
		Или (ТекущиеДанные <> Неопределено И ТекущиеДанные.Тип = "DMFileRole") Тогда

		УбратьДоступностьКоманд();

	Иначе
		
		#Вставка
		//{[+] ИКТ №20078 (форгмент ДОБАВЛЕН), Новоселов, 30.07.2026
		ДоступноРедактированиеФайла = ДоступноРедактированиеФайла(
			ТипЗнч(?(ТекущиеДанные.ВладелецФайла = Неопределено, Владелец, ТекущиеДанные.ВладелецФайла)),
			ТекущиеДанные.Автор);
		//[+] ИКТ №20078
		#КонецВставки
		Редактируется = ТекущиеДанные.Редактируется;
		РедактируетсяТекущимПользователем = ТекущиеДанные.РедактируетсяТекущимПользователем;
		ЕстьПодписи = ТекущиеДанные.ПодписанЭП;
		Зашифрован = ТекущиеДанные.Зашифрован;

		РедактируетсяДругимПользователем =
		Редактируется
		И Не РедактируетсяТекущимПользователем;
		МожноЗахватить =
		СостояниеРазрешаетРедактированиеФайла
		И Не РедактируетсяДругимПользователем
		И Не Зашифрован
		#Вставка
		И ДоступноРедактированиеФайла  //[+] ИКТ №20078 (строка ДОБАВЛЕНА), Новоселов, 30.07.2026 
		#КонецВставки
		И Не ЕстьПодписи;
		МожноОтпустить =
		СостояниеРазрешаетРедактированиеФайла
		И РедактируетсяТекущимПользователем
		И Не Зашифрован
		#Вставка
		И ДоступноРедактированиеФайла  //[+] ИКТ №20078 (строка ДОБАВЛЕНА), Новоселов, 30.07.2026 
		#КонецВставки
		И Не ЕстьПодписи;

		Элементы.ОткрытьНаЧтение.Доступность = Не Зашифрован;
		Элементы.КонтекстОткрытьНаЧтение.Доступность = Не Зашифрован;
		Элементы.ОткрытьДляРедактирования.Доступность = МожноЗахватить;
		Элементы.КонтекстОткрытьДляРедактирования.Доступность = МожноЗахватить;
		Элементы.ЗакончитьРедактирование.Доступность = МожноОтпустить;
		Элементы.КонтекстЗакончитьРедактирование.Доступность = МожноОтпустить;
		Элементы.СохранитьИзменения.Доступность = МожноОтпустить;
		Элементы.ОтменитьРедактирование.Доступность = МожноОтпустить;
		Элементы.ОтменитьРедактированиеКонтекст.Доступность = МожноОтпустить;
		Элементы.СохранитьНаДиск.Доступность = Не Зашифрован;
		Элементы.СохранитьНаДискКонтекст.Доступность = Не Зашифрован;
		Элементы.ОбновитьИзФайлаНаДиске.Доступность = МожноЗахватить;
		Элементы.ОбновитьИзФайлаНаДискеКонтекст.Доступность = МожноЗахватить;
		Элементы.ОткрытьКарточку.Доступность = Истина;
		Элементы.ОткрытьКарточкуКонтекст.Доступность = Истина;
		Элементы.Удалить.Доступность = Не Редактируется И СостояниеРазрешаетУдалениеФайла;
		Элементы.УдалитьКонтекст.Доступность = Не Редактируется И СостояниеРазрешаетУдалениеФайла;
		Элементы.ПодменюПечать.Доступность = Не Зашифрован;
		Элементы.Отправить.Доступность = Истина;
		Элементы.ГруппаЭП.Доступность = СостояниеРазрешаетИзменениеЭП;
		Элементы.ГруппаЭПКонтекст.Доступность = СостояниеРазрешаетИзменениеЭП;
		Элементы.ФормаГруппаДополнительно.Доступность = Истина;
		Элементы.ВыбратьРольФайлаКонтекст.Доступность = СостояниеРазрешаетДобавлениеФайла;
		Элементы.Скопировать.Доступность = СостояниеРазрешаетДобавлениеФайла;
		Элементы.СкопироватьКонтекст.Доступность = СостояниеРазрешаетДобавлениеФайла;
		Элементы.ОткрытьКаталогФайлаКонтекст.Доступность = Истина;
		Элементы.СохранитьВместеСЭП.Доступность = ЕстьПодписи;
		Элементы.СохранитьВместеСЭПКонтекст.Доступность = ЕстьПодписи;

	КонецЕсли;

КонецПроцедуры

//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 30.07.2026 
&НаСервереБезКонтекста
Функция ДоступноРедактированиеФайла(ТипВладельцаФайла, АвторФайла)
	
	Автор = ?(ТипЗнч(АвторФайла) = Тип("Строка"), Справочники.Пользователи.НайтиПоНаименованию(АвторФайла), АвторФайла);
	
	Если Автор = Пользователи.ТекущийПользователь() Тогда
		Возврат Истина;
	ИначеЕсли Автор = Справочники.Пользователи.ПустаяСсылка() Тогда
		Общегоназначения.СообщитьПользователю("Не удалось установить связь автора файла с пользователем системы!");
	КонецЕсли;
	
	Если ТипВладельцаФайла = Тип("СправочникСсылка.Проекты") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектов");
	ИначеЕсли ТипВладельцаФайла = Тип("ДокументСсылка.упоПроектнаяЗадача")
			Или ТипВладельцаФайла = Тип("СправочникСсылка.упоЗадания") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектныхЗадачЗаданий");
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции
//[+]} ИКТ №20612

#Область Задача20864

#Область ДобавлениеВДеревоДополнительныхФайлов

&НаКлиенте
&После("ОбновлениеФайловЗавершение")
Процедура Расш1_ОбновлениеФайловЗавершение(Результат, ПараметрыОбновления)
	
	//{[+] ИКТ №20864 (фрагмент ДОБАВЛЕН), Новоселов, 12.08.2026 
	Если НЕ ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания") Тогда  //[+] ИКТ №19162 (строка ДОБАВЛЕНА), Новоселов, 15.07.2026 
		Возврат;
	КонецЕсли;
	
	ДобавитьФайлыДополнительныхВладельцевНаСервере();
	//[+]} ИКТ №20864
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФайлыДополнительныхВладельцевНаСервере()

	ДополнительныеВладельцы = ПолучитьВладельцевФайлов();
	
	Для Каждого Строка Из ДополнительныеВладельцы Цикл
			
		ВыборкаФайлов = Неопределено;
		
		// Ветвление в зависимости от типа владельца
		Если Строка.ТипВладельцаФайла = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			ВыборкаФайлов = ВернутьПрисоединенныеФайлыПроектнаяЗадача(Строка.ВладелецФайла);
			
		ИначеЕсли Строка.ТипВладельцаФайла = Тип("СправочникСсылка.Проекты") Тогда
			ВыборкаФайлов = ВернутьПрисоединенныеФайлыПроект(Строка.ВладелецФайла);
			
		КонецЕсли;
		
		Если ВыборкаФайлов <> Неопределено Тогда
			ДобавитьФайлыВДерево(ВыборкаФайлов, Владелец);
			
		КонецЕсли;
		
		Если Строка.ТипВладельцаФайла = Тип("СправочникСсылка.упоЗадания") Тогда
			ДобавитьФайлыЗаданийВДерево(Строка.ВладелецФайла);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВладельцевФайлов()
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Проект", Владелец.Метаданные())
			И НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Проект")) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	упоПроектнаяЗадача.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ОтмененныеЗадачи
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		|		ПО (упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка)
		|			И (упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		|ГДЕ
		|	упоПроектнаяЗадача.Проект = &Проект
		|	И упоПроектнаяЗадача.Ссылка <> &ОсновнойВладелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Проект КАК ВладелецФайла,
		|	ТИП(Справочник.Проекты) КАК ТипВладельцаФайла
		|ГДЕ
		|	&Проект <> &ОсновнойВладелец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	упоПроектнаяЗадача.Ссылка,
		|	ТИП(Документ.упоПроектнаяЗадача)
		|ИЗ
		|	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененныеЗадачи КАК ВТ_ОтмененныеЗадачи
		|		ПО (ВТ_ОтмененныеЗадачи.Ссылка = упоПроектнаяЗадача.Ссылка)
		|ГДЕ
		|	упоПроектнаяЗадача.Проект = &Проект
		|	И упоПроектнаяЗадача.Ссылка <> &ОсновнойВладелец
		|	И ВТ_ОтмененныеЗадачи.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	упоЗадания.Ссылка,
		|	ТИП(Справочник.упоЗадания)
		|ИЗ
		|	Справочник.упоЗадания КАК упоЗадания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененныеЗадачи КАК ВТ_ОтмененныеЗадачи
		|		ПО (ВТ_ОтмененныеЗадачи.Ссылка = упоЗадания.ОбъектБазы)
		|ГДЕ
		|	упоЗадания.Проект = &Проект
		|	И упоЗадания.Ссылка <> &ОсновнойВладелец
		|	И ВТ_ОтмененныеЗадачи.Ссылка ЕСТЬ NULL");
	Запрос.УстановитьПараметр("ОсновнойВладелец", Владелец);
	Запрос.УстановитьПараметр("Проект",
		?(ТипЗнч(Владелец) = Тип("СправочникСсылка.Проекты"),
			Владелец,
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Проект"))); 
			
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ДобавитьФайлыВДерево(ВыборкаФайлов, Владелец)
	
	Пока ВыборкаФайлов.Следующий() Цикл
		
		Если ВыборкаФайлов.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДеревоФайлов.ПолучитьЭлементы().Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаФайлов);
		НоваяСтрока.ДатаМодификации = ВыборкаФайлов.ДатаИзменения; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВернутьПрисоединенныеФайлыПроектнаяЗадача(ВладелецФайлов)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА Файлы.ПометкаУдаления = ИСТИНА
		|			ТОГДА ЕСТЬNULL(Файлы.ИндексКартинки, 2) + 1
		|		ИНАЧЕ ЕСТЬNULL(Файлы.ИндексКартинки, 2)
		|	КОНЕЦ КАК ИндексКартинки,
		|	Файлы.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)) КАК Описание,
		|	Файлы.Автор,
		|	Файлы.ДатаСоздания,
		|	Файлы.Изменил КАК Отредактировал,
		|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени) КАК ДатаИзменения,
		|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)) КАК Размер,
		|	Файлы.ПодписанЭП,
		|	Файлы.Зашифрован,
		|	ВЫБОР
		|		КОГДА Файлы.ПодписанЭП
		|				И Файлы.Зашифрован
		|			ТОГДА 2
		|		КОГДА Файлы.Зашифрован
		|			ТОГДА 1
		|		КОГДА Файлы.ПодписанЭП
		|			ТОГДА 0
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК НомерКартинкиПодписанЗашифрован,
		|	ВЫБОР
		|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФайлРедактируется,
		|	ВЫБОР
		|		КОГДА Файлы.Редактирует = &ТекущийПользователь
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФайлРедактируетТекущийПользователь,
		|	ВЫБОР
		|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
		|				И Файлы.Редактирует <> &ТекущийПользователь
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФайлРедактируетДругойПользователь,
		|	Файлы.Расширение КАК Расширение,
		|	ВЫБОР
		|		КОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись <> НЕОПРЕДЕЛЕНО
		|				И Файлы.Редактирует = НЕОПРЕДЕЛЕНО
		|			ТОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись
		|		ИНАЧЕ Файлы.Редактирует
		|	КОНЕЦ КАК Редактирует,
		|	Файлы.Редактирует КАК РедактируетПользователь,
		|	ЛОЖЬ КАК ЭтоГруппа,
		|	Файлы.Служебный КАК Служебный,
		|	НЕОПРЕДЕЛЕНО КАК ГруппаФайла,
		|	Файлы.ВладелецФайла КАК ВладелецФайла,
		|	Файлы.ХранитьВерсии КАК ХранитьВерсии
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСинхронизацииФайловСОблачнымСервисом КАК СтатусыСинхронизацииФайловСОблачнымСервисом
		|		ПО Файлы.Ссылка = СтатусыСинхронизацииФайловСОблачнымСервисом.Файл
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайлов");
	Запрос.УстановитьПараметр("ВладелецФайлов", ВладелецФайлов);
	Запрос.УстановитьПараметр("СекундДоМестногоВремени",
		МестноеВремя(ТекущаяДатаСеанса(), ЧасовойПоясСеанса()) - ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());

	ПустыеПользователи = Новый Массив;
	ПустыеПользователи.Добавить(Неопределено);
	ПустыеПользователи.Добавить(Справочники.Пользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.ВнешниеПользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.УчетныеЗаписиСинхронизацииФайлов.ПустаяСсылка());

	Запрос.УстановитьПараметр("ПустыеПользователи",  ПустыеПользователи);
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

&НаСервере
Функция ВернутьПрисоединенныеФайлыПроект(ВладелецФайлов)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА Файлы.ПометкаУдаления = ИСТИНА
		|			ТОГДА ЕСТЬNULL(Файлы.ИндексКартинки, 2) + 1
		|		ИНАЧЕ ЕСТЬNULL(Файлы.ИндексКартинки, 2)
		|	КОНЕЦ КАК ИндексКартинки,
		|	Файлы.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)) КАК Описание,
		|	Файлы.Автор,
		|	Файлы.ДатаСоздания,
		|	Файлы.Изменил КАК Отредактировал,
		|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени) КАК ДатаИзменения,
		|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)) КАК Размер,
		|	Файлы.ПодписанЭП,
		|	Файлы.Зашифрован,
		|	ВЫБОР
		|		КОГДА Файлы.ПодписанЭП
		|				И Файлы.Зашифрован
		|			ТОГДА 2
		|		КОГДА Файлы.Зашифрован
		|			ТОГДА 1
		|		КОГДА Файлы.ПодписанЭП
		|			ТОГДА 0
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК НомерКартинкиПодписанЗашифрован,
		|	ВЫБОР
		|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФайлРедактируется,
		|	ВЫБОР
		|		КОГДА Файлы.Редактирует = &ТекущийПользователь
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФайлРедактируетТекущийПользователь,
		|	ВЫБОР
		|		КОГДА НЕ Файлы.Редактирует В (&ПустыеПользователи)
		|				И Файлы.Редактирует <> &ТекущийПользователь
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ФайлРедактируетДругойПользователь,
		|	Файлы.Расширение КАК Расширение,
		|	ВЫБОР
		|		КОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись <> НЕОПРЕДЕЛЕНО
		|				И Файлы.Редактирует = НЕОПРЕДЕЛЕНО
		|			ТОГДА СтатусыСинхронизацииФайловСОблачнымСервисом.УчетнаяЗапись
		|		ИНАЧЕ Файлы.Редактирует
		|	КОНЕЦ КАК Редактирует,
		|	Файлы.Редактирует КАК РедактируетПользователь,
		|	Файлы.ЭтоГруппа КАК ЭтоГруппа,
		|	ЛОЖЬ КАК Служебный,
		|	Файлы.Родитель КАК ГруппаФайла,
		|	Файлы.ВладелецФайла КАК ВладелецФайла,
		|	Файлы.ХранитьВерсии КАК ХранитьВерсии
		|ИЗ
		|	Справочник.ПроектыПрисоединенныеФайлы КАК Файлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыСинхронизацииФайловСОблачнымСервисом КАК СтатусыСинхронизацииФайловСОблачнымСервисом
		|		ПО Файлы.Ссылка = СтатусыСинхронизацииФайловСОблачнымСервисом.Файл
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайлов");
	Запрос.УстановитьПараметр("ВладелецФайлов", ВладелецФайлов);
	Запрос.УстановитьПараметр("СекундДоМестногоВремени",
		МестноеВремя(ТекущаяДатаСеанса(), ЧасовойПоясСеанса()) - ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());

	ПустыеПользователи = Новый Массив;
	ПустыеПользователи.Добавить(Неопределено);
	ПустыеПользователи.Добавить(Справочники.Пользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.ВнешниеПользователи.ПустаяСсылка());
	ПустыеПользователи.Добавить(Справочники.УчетныеЗаписиСинхронизацииФайлов.ПустаяСсылка());

	Запрос.УстановитьПараметр("ПустыеПользователи",  ПустыеПользователи);
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

&НаСервере
Процедура ДобавитьФайлыЗаданийВДерево(ВладелецФайлов)
		
	Правила = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.НайтиСоздатьПодходящиеПравила(
	ВладелецФайлов);
	Если Правила.Количество() > 0 Тогда
		ПравилоИнтеграции = Правила[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	ТипСтроки = ПравилоИнтеграции.ТипОбъектаДО;
	ТипВидаДокумента = ПравилоИнтеграции.ТипВидаДокумента;
	ИдентификаторВидаДокумента = ПравилоИнтеграции.ИдентификаторВидаДокумента;
	ИспользоватьЭлектронныеПодписиИС = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьЭлектронныеЦифровыеПодписи();
	ВладелецМетаданные = ВладелецФайлов.Метаданные();
	ТипСправочникаСФайлами = ВладелецМетаданные.ПолноеИмя();
	ТипОбъектаМассив = СтрРазделить(ТипСправочникаСФайлами, ".");
	
	Если ТипОбъектаМассив[0] = "Справочник" Тогда
		ПредставлениеТипаВладельца = "справочника";
	ИначеЕсли ТипОбъектаМассив[0] = "Документ" Тогда
		ПредставлениеТипаВладельца = "документа";
	КонецЕсли;
	
	ОбъектДО = РегистрыСведений.ОбъектыИнтегрированныеС1СДокументооборотом.ДанныеОбъектаДОПоВнешнемуОбъекту(ВладелецФайлов);
	Если ОбъектДО = Неопределено И НЕ ЗначениеЗаполнено(ОбъектДО.ID)Тогда
		Возврат;
	КонецЕсли;
	IDСтроки = ОбъектДО.ID;
	ТипСтроки = ОбъектДО.type;
	Если ЗначениеЗаполнено(IDСтроки) Тогда
		ПолучаемыеПоля = Новый Массив;
		ПолучаемыеПоля.Добавить("files");
		ПолучаемыеПоля.Добавить("documentType");
		ПолучаемыеПоля.Добавить("enabledProperties");
		ПолучаемыеПоля.Добавить("htmlView");
		//ПолучаемыеПоля.Добавить("ignoreDeletionMark");
		Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
		ОбъектXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПолучитьОбъект(
			Прокси,
			ТипСтроки,
			IDСтроки,
			ПолучаемыеПоля,
			ПравилоИнтеграции.Ссылка,
			ВладелецФайлов);
		Для Каждого Ф Из ОбъектXDTO.files Цикл
			
			НоваяСтрока	  = ДеревоФайлов.ПолучитьЭлементы().Добавить();
			ОписаниеФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ОписаниеФайла(Ф.objectID.id);
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеФайла);
			НоваяСтрока.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ИндексПиктограммыФайла(НоваяСтрока.Расширение);
			Если НоваяСтрока.ПометкаУдаления Тогда
				НоваяСтрока.ИндексКартинки = НоваяСтрока.ИндексКартинки + 2;
			КонецЕсли;
			НоваяСтрока.Отредактировал = ОписаниеФайла.АвторМодификации;
			НоваяСтрока.Тип = "DMFile";

		КонецЦикла;
	КонецЕсли;		

КонецПроцедуры

#КонецОбласти

#Область ИзмененияПроцедурКоманд

&НаКлиенте
&Вместо("ОткрытьТекущийФайлНаЧтение")
Процедура Расш1_ОткрытьТекущийФайлНаЧтение()
	
	Если НЕ (ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания")) Тогда 
		ПродолжитьВызов();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущиеДанные.Тип <> "DMFile" Тогда
		Структура = Новый Структура("Автор, Наименование, ДатаСоздания");
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		
		Ссылка = ПолучитьСсылкуНаФайлИзЕРП(Структура);
		Если Ссылка <> Неопределено Тогда
			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Ссылка, Неопределено, Неопределено);
			РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, ТекущиеДанные.Редактируется);
			
		КонецЕсли;
	Иначе
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
			ТекущиеДанные.ID,
			ТекущиеДанные.Наименование,
			ТекущиеДанные.Расширение,
			УникальныйИдентификатор); 
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
&Вместо("ОткрытьТекущийФайлДляРедактирования")
Процедура Расш1_ОткрытьТекущийФайлДляРедактирования()
	
	Если НЕ (ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания")) Тогда 
		ПродолжитьВызов();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущиеДанные.Тип <> "DMFile" Тогда
		Структура = Новый Структура("Автор, Наименование, ДатаСоздания");
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		
		Ссылка = ПолучитьСсылкуНаФайлИзЕРП(Структура);
		Если Ссылка <> Неопределено Тогда
			РаботаСФайламиСлужебныйКлиент.РедактироватьСОповещением(Неопределено, Ссылка);
			
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ВладелецФайла) Тогда
		ОбъектДО = ПолучитьОбъектДОПоВнешнемуОбъекту(ТекущиеДанные.ВладелецФайла);
		Если ОбъектДО = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить объект ДО!");
			Возврат;
		КонецЕсли;
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
			ТекущиеДанные.ID,
			ТекущиеДанные.Наименование,
			ТекущиеДанные.Расширение,
			УникальныйИдентификатор,
			Ложь,,
			ОбъектДО.ID);
		ТекущиеДанные.РедактируетсяТекущимПользователем = Истина;
		
	Иначе
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФайл(
			ТекущиеДанные.ID,
			ТекущиеДанные.Наименование,
			ТекущиеДанные.Расширение,
			УникальныйИдентификатор,
			Ложь,,
			ID);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
&Вместо("ОткрытьКарточку")
Процедура Расш1_ОткрытьКарточку()
	
	Если НЕ (ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания")) Тогда 
		ПродолжитьВызов();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	
	ИначеЕсли ТекущиеДанные.Тип <> "DMFile" Тогда
		Структура = Новый Структура("Автор, Наименование, ДатаСоздания");
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		
		Ссылка = ПолучитьСсылкуНаФайлИзЕРП(Структура);
		Если Ссылка <> Неопределено Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ",			  Ссылка);
			ПараметрыФормы.Вставить("ТолькоПросмотр",	ТолькоПросмотр);
			// ПараметрыФормы.Вставить("ПараметрыОтправки", ПараметрыОтправки);
			
			РаботаСФайламиКлиент.ОткрытьФормуФайла(Ссылка,, ПараметрыФормы);
		КонецЕсли;
		
	Иначе
		ДополнительныеПараметры = Новый Структура("РазрешеноРедактирование", СостояниеРазрешаетРедактированиеФайла);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьОбъект(
			ТекущиеДанные.Тип,
			ТекущиеДанные.ID,
			ЭтотОбъект,
			ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&Вместо("ОбновитьИзФайлаНаДиске")
Процедура Расш1_ОбновитьИзФайлаНаДиске(Команда)
	
	Если НЕ (ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания")) Тогда 
		ПродолжитьВызов(Команда);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	
	ИначеЕсли ТекущиеДанные.Тип <> "DMFile" Тогда
		Структура = Новый Структура("Автор, Наименование, ДатаСоздания");
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		
		Ссылка = ПолучитьСсылкуНаФайлИзЕРП(Структура);
		Если Ссылка <> Неопределено Тогда
			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаИРабочийКаталог(Ссылка);
			РаботаСФайламиСлужебныйКлиент.ОбновитьИзФайлаНаДискеСОповещением(Неопределено, ДанныеФайла, УникальныйИдентификатор);
	
		КонецЕсли;
		
	Иначе
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОбновитьИзФайлаНаДиске(
			ТекущиеДанные.ID,
			ТекущиеДанные.Наименование,
			ТекущиеДанные.Расширение,
			ТекущиеДанные.ДатаМодификации,
			УникальныйИдентификатор,,
			ID);
	КонецЕсли;
	
	// ПродолжитьВызов(Команда);
	
КонецПроцедуры

&НаКлиенте
&Вместо("ДеревоФайловПередУдалением")
Процедура Расш1_ДеревоФайловПередУдалением(Элемент, Отказ)
	
	Если НЕ (ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания")) Тогда 
		ПродолжитьВызов(Элемент, Отказ);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеУдаленияФайлов", ЭтотОбъект);
	
	Если ТекущиеДанные.Тип <> "DMFile" Тогда
		
		Структура = Новый Структура("Автор, Наименование, ДатаСоздания");
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		
		Ссылка = ПолучитьСсылкуНаФайлИзЕРП(Структура);
		Если Ссылка <> Неопределено Тогда
			
			Файлы = Новый Массив;
			Файлы.Добавить(Ссылка);
			
			ДополнительныеПараметры = Новый Структура("Файлы", Файлы);
			ОповещениеВопрос = Новый ОписаниеОповещения("УстановитьПометкуУдаленияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ШаблонВопроса = ?(ТекущиеДанные.ПометкаУдаления,
				НСтр("ru = 'Снять с ""%1"" пометку на удаление?';
					|en = 'Do you want to clear the deletion mark from ""%1""?'"),
				НСтр("ru = 'Пометить ""%1"" на удаление?';
					|en = 'Do you want to mark ""%1"" for deletion?'"));
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВопроса, ТекущиеДанные.Наименование);
			ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ВладелецФайла) Тогда
		ОбъектДО = ПолучитьОбъектДОПоВнешнемуОбъекту(ТекущиеДанные.ВладелецФайла);
		Если ОбъектДО = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить объект ДО!");
			Возврат;
		КонецЕсли;
		
		ВыделенныеСтроки = Новый Массив;
		ВыделенныеСтроки.Добавить(Элементы.ДеревоФайлов.ТекущаяСтрока);
		
		ВыделенныеФайлы = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыделенныеФайлы(
			ДеревоФайлов,
			ВыделенныеСтроки);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПометитьНаУдалениеСнятьПометкуФайлов(
			ВыделенныеФайлы,
			ТекущиеДанные.ПометкаУдаления,
			Оповещение,
			ОбъектДО.ID,
			УникальныйИдентификатор);
			
	Иначе
		ВыделенныеСтроки = Новый Массив;
		ВыделенныеСтроки.Добавить(Элементы.ДеревоФайлов.ТекущаяСтрока);
		
		ВыделенныеФайлы = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыделенныеФайлы(
			ДеревоФайлов,
			ВыделенныеСтроки);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПометитьНаУдалениеСнятьПометкуФайлов(
			ВыделенныеФайлы,
			ТекущиеДанные.ПометкаУдаления,
			Оповещение,
			ID,
			УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьСнятьПометкуУдаления(ДополнительныеПараметры.Файлы);
	КонецЕсли;
	
	ОбновитьСписокФайловКлиент();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСнятьПометкуУдаления(Файлы)
	
	ПометкаУдаления = Неопределено;
	Для каждого ФайлСсылка Из Файлы Цикл
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить(ФайлСсылка.Метаданные().ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ФайлСсылка);
			Блокировка.Заблокировать();

			ФайлОбъект = ФайлСсылка.ПолучитьОбъект();
			Если ПометкаУдаления = Неопределено Тогда
				ПометкаУдаления = Не ФайлОбъект.ПометкаУдаления;
			КонецЕсли;
			ФайлОбъект.УстановитьПометкуУдаления(ПометкаУдаления);

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
&Вместо("СохранитьНаДиск")
Процедура Расш1_СохранитьНаДиск(Команда)
	
	Если НЕ (ТипЗнч(Владелец) = Тип("СправочникСсылка.упоЗадания")) Тогда 
		ПродолжитьВызов(Команда);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	
	ИначеЕсли ТекущиеДанные.Тип <> "DMFile" Тогда
		Структура = Новый Структура("Автор, Наименование, ДатаСоздания");
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные);
		
		Ссылка = ПолучитьСсылкуНаФайлИзЕРП(Структура);
		Если Ссылка <> Неопределено Тогда
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляСохранения(Ссылка, , Неопределено);
			РаботаСФайламиСлужебныйКлиент.СохранитьКак(Неопределено, ДанныеФайла, Неопределено);
		КонецЕсли;
		
	Иначе
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.НачатьСохранениеВыделенныхФайлов(
			ДеревоФайлов,
			Элементы.ДеревоФайлов.ВыделенныеСтроки,
			УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаФайлИзЕРП(ТекущиеДанные)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Наименование = &Наименование
		|	И Файлы.Автор = &Автор
		|	И Файлы.ДатаСоздания = &ДатаСоздания
		|	И ТИПЗНАЧЕНИЯ(Файлы.ВладелецФайла) В (ТИП(Справочник.упоЗадания), ТИП(Документ.упоПроектнаяЗадача))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Файлы.Ссылка
		|ИЗ
		|	Справочник.ПроектыПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	Файлы.Наименование = &Наименование
		|	И Файлы.Автор = &Автор
		|	И Файлы.ДатаСоздания = &ДатаСоздания
		|	И ТИПЗНАЧЕНИЯ(Файлы.ВладелецФайла) = ТИП(Справочник.Проекты)");
	Запрос.УстановитьПараметр("Автор", Справочники.Пользователи.НайтиПоНаименованию(ТекущиеДанные.Автор));
	Запрос.УстановитьПараметр("Наименование", ТекущиеДанные.Наименование);
	Запрос.УстановитьПараметр("ДатаСоздания", ТекущиеДанные.ДатаСоздания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю("Не удалось однозначно определить файл в ЕРП");
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбъектДОПоВнешнемуОбъекту(ВнешнийОбъект)
	
	Возврат РегистрыСведений.ОбъектыИнтегрированныеС1СДокументооборотом.ДанныеОбъектаДОПоВнешнемуОбъекту(ВнешнийОбъект);

КонецФункции

#КонецОбласти

#КонецОбласти