
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗаполнитьНаименованияВТаблицах();
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	упоАналитикаПоПодразделениямКлиент.УстановитьДоступностьДоговораИсполнителя(Объект.ДоходныеОбъемы);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	//ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьНаименованияВТаблицах();
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
			
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоходныеОбъемы

&НаКлиенте
Процедура ДоходныеОбъемыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.ДоходныеОбъемы.ТекущиеДанные;	  
	           
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ДоходныеОбъемы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущиеДанные.ЕдиницаИзмерения = упоЗаполнениеИПодборКлиент.ПолучитьЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыСуммаПриИзменении(Элемент)
	
	КоличествоСуммаПриИзменении(Элементы.ДоходныеОбъемы.ТекущиеДанные, "Сумма");

КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДоходныеОбъемы.ТекущиеДанные;	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Стоимость = ЗаполнитьСтоимостьНоменклатуры(ТекущаяСтрока.ПроектнаяЗадача, ТекущаяСтрока.Номенклатура);
	КоличествоСуммаПриИзменении(ТекущаяСтрока, "Количество");
		
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "ДоходныеОбъемы"); 
	ДоходныеОбъемыДоговорПриИзменении(Элемент);  
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыДоговорПриИзменении(Элемент)
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма, "ДоходныеОбъемы"); 
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.ДоходныеОбъемы.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыКонтрагентПодрядчикПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "ДоходныеОбъемы", "КонтрагентПодрядчик", "ЗаказДоговорПодрядчика");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадачи = ПолучитьОсновныеПараметрыЗадачи(ТекДанные.ПроектнаяЗадача);
	
	упоАналитикаПоПодразделениямКлиент.ЗаполнитьПараметрыСтрокиРаспределения(ТекДанные, "ДоходныеОбъемы", ПараметрыЗадачи.Проект, Истина); 	
	
	ЗаполнитьНаименованиеВСтрокеТЧ(ТекДанные, ПараметрыЗадачи);

КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыСтоимостьПриИзменении(Элемент)
	
	КоличествоСуммаПриИзменении(Элементы.ДоходныеОбъемы.ТекущиеДанные, "Стоимость");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходныеОбъемы

&НаКлиенте
Процедура РасходныеОбъемыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.РасходныеОбъемы.ТекущиеДанные;	  
	           
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "РасходныеОбъемы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	ТекущиеДанные.ЕдиницаИзмерения = упоЗаполнениеИПодборКлиент.ПолучитьЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыСуммаПриИзменении(Элемент)
	
	КоличествоСуммаПриИзменении(Элементы.РасходныеОбъемы.ТекущиеДанные, "Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыКоличествоПриИзменении(Элемент)
	
	КоличествоСуммаПриИзменении(Элементы.РасходныеОбъемы.ТекущиеДанные, "Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "РасходныеОбъемы"); 
	РасходныеОбъемыДоговорПриИзменении(Элемент);  
		
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыДоговорПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма, "РасходныеОбъемы");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РасходныеОбъемы.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыСобствСилы_СубподрядПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РасходныеОбъемы");
	
КонецПроцедуры 

&НаКлиенте
Процедура РасходныеОбъемыПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадачи = ПолучитьОсновныеПараметрыЗадачи(ТекДанные.ПроектнаяЗадача);
	
	упоАналитикаПоПодразделениямКлиент.ЗаполнитьПараметрыСтрокиРаспределения(ТекДанные, "РасходныеОбъемы", ПараметрыЗадачи.Проект, Истина); 	
	
	ЗаполнитьНаименованиеВСтрокеТЧ(ТекДанные, ПараметрыЗадачи);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыСтоимостьПриИзменении(Элемент)
	
	КоличествоСуммаПриИзменении(Элементы.РасходныеОбъемы.ТекущиеДанные, "Стоимость");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте	
Процедура КоличествоСуммаПриИзменении(ТекущаяСтрокаРегистрацииФакта, ИзменяемаяКолонка)
	
	Если ТекущаяСтрокаРегистрацииФакта <> Неопределено 
		И ТекущаяСтрокаРегистрацииФакта.Стоимость > 0 Тогда
		
		Если ИзменяемаяКолонка = "Количество" Или ИзменяемаяКолонка = "Стоимость" Тогда
			
			  ТекущаяСтрокаРегистрацииФакта.Сумма = ТекущаяСтрокаРегистрацииФакта.Количество * ТекущаяСтрокаРегистрацииФакта.Стоимость;
			
		ИначеЕсли ИзменяемаяКолонка = "Сумма" Тогда
			
			 ТекущаяСтрокаРегистрацииФакта.Количество = ТекущаяСтрокаРегистрацииФакта.Сумма/ТекущаяСтрокаРегистрацииФакта.Стоимость;			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ЗаполнитьСтоимостьНоменклатуры(ПроектнаяЗадача, Номенклатура)
	 
	 ЗапросСтоимости = Новый Запрос;
	 ЗапросСтоимости.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                         |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Цена КАК Цена,
	                         |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура
	                         |ИЗ
	                         |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
	                         |			,
	                         |			ПроектнаяЗадача = &ПроектнаяЗадача
	                         |				И Номенклатура = &Номенклатура) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
	                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	                         |		ПО (упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Версия = упоВерсииПроекта.Версия
	                         |				И упоВерсииПроекта.Текущая)
	                         |ГДЕ
	                         |	(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество <> 0
	                         |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма <> 0
	                         |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная <> 0)";	 
	 ЗапросСтоимости.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	 ЗапросСтоимости.УстановитьПараметр("Номенклатура", Номенклатура);
	 Результат = ЗапросСтоимости.Выполнить();
	 
	 Если Результат.Пустой() = Ложь Тогда
		 
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
		 
		 Возврат Выборка.Цена;
		 
	 Иначе
		 
		 Возврат 0;
		 
	 КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подготавливает доп. параметры структуры подбора.
//
// Параметры:
//  ПараметрыПодбораСтруктура	 - 	 - 
//  ИмяТЧ						 - 	 - 
//
&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ) Экспорт
	
	ПараметрыПодбораСтруктура= Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных =  ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("СтруктураСтрокиТЧ", Новый Структура);
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураСтрокиТЧ, ИмяТЧ);
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)

	// Перенести код в модуль с повторным использованием значений.
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоСинхронизацияФактическиВыполненныхОбъемов.Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);
		
	Иначе 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоСинхронизацияФактическиВыполненныхОбъемов.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованияВТаблицах()
		
	Для Каждого СтрокаТЧ Из Объект.ДоходныеОбъемы Цикл
		ЗаполнитьНаименованиеВСтрокеТЧ(СтрокаТЧ);	
	КонецЦикла;
	Для Каждого СтрокаТЧ Из Объект.РасходныеОбъемы Цикл
		ЗаполнитьНаименованиеВСтрокеТЧ(СтрокаТЧ);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьНаименованиеВСтрокеТЧ(СтрокаТЧ, ПараметрыЗадачи = Неопределено)
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ПроектнаяЗадача) Тогда
		Если ПараметрыЗадачи = Неопределено Тогда
			СтрокаТЧ.НазваниеПроектнойЗадачи = упоПроектыИЗадачиВызовСервера.НазваниеПроектнойЗадачи(СтрокаТЧ.ПроектнаяЗадача);
		Иначе
			СтрокаТЧ.НазваниеПроектнойЗадачи = ПараметрыЗадачи.НазваниеЗадачи;
		КонецЕсли;
	Иначе
		СтрокаТЧ.НазваниеПроектнойЗадачи = "";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОсновныеПараметрыЗадачи(ПроектнаяЗадача) 
	
	Результат = Новый Структура("Проект, НазваниеЗадачи");
	
	Если Не ЗначениеЗаполнено(ПроектнаяЗадача) Тогда		
		Возврат Результат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВерсииПроекта.Проект КАК Проект,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти