////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с диалогами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
	
// Функция спрашивает пользователя записать ли объект, или нет, если он новый.
//
// Параметры:
//  ФормаОбъекта - Форма - форма объекта, из которой пытаются произвести действия.
//
// Возвращаемое значение:
//   Булево - Объект записан или нет.
//
Функция обЗаписатьНовыйОбъектВФорме(ФормаОбъекта) Экспорт

	Если ФормаОбъекта.ЭтоНовый() Тогда
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ФормаОбъекта.ЭтотОбъект.Ссылка)) Тогда
			ТекстВопроса = НСтр("ru = 'Для выполнения данной операции необходимо записать документ. Записать?'");
		Иначе // Справочник.
			ТекстВопроса = НСтр("ru = 'Для выполнения данной операции необходимо записать элемент. Записать?'");
		КонецЕсли; 
		
		Ответ = обВопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 120, );
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			
			Возврат Ложь;
			
		Иначе
			
			Попытка
				
				Возврат ФормаОбъекта.ЗаписатьВФорме();
				
			Исключение
				
				ТекстСообщения = СформироватьТекстСообщения(ОписаниеОшибки());
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				
				Возврат Ложь;
				
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли; 
	
КонецФункции

#КонецЕсли

#Если НЕ ТонкийКлиент И НЕ ВебКлиент Тогда

#Область Сообщений

// Выводит текст сообщения об ошибке в окно сообщений.
//
// Параметры:
//  ТекстСообщения							 - Строка
//  Отказ									 - Булево	 - Признак отказа от выполнения операции.
//  Заголовок								 - Строка
//  СписокПараметровЖурнала					 - Структура - структура параметров для записи в ЖР.
//  СтруктураПолейСообщения					 - Структура - Содержит параметры объекта "СообщениеПользователю".
//  ВыводитьСообщенияОбОшибкеПользователю	 - Булево
//
Процедура обСообщитьОбОшибке(ТекстСообщения, Отказ = Ложь, Заголовок = "", СписокПараметровЖурнала = Неопределено,
	СтруктураПолейСообщения = Неопределено, ВыводитьСообщенияОбОшибкеПользователю = Истина) Экспорт

	Отказ = Истина;
	
#Если ВнешнееСоединение Тогда
	
	Если ЗначениеЗаполнено(Заголовок) Тогда
		ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
		Заголовок = "";
	КонецЕсли;
	
	ВызватьИсключение (ТекстСообщения);
	
#Иначе
	
	Если ЗначениеЗаполнено(Заголовок) Тогда
		обСообщить(Заголовок, , СписокПараметровЖурнала,,ВыводитьСообщенияОбОшибкеПользователю);
		Заголовок = "";
	КонецЕсли;
	
	обСообщить(ТекстСообщения, , СписокПараметровЖурнала, СтруктураПолейСообщения, 
		ВыводитьСообщенияОбОшибкеПользователю);
	
#КонецЕсли
	
КонецПроцедуры

// Выводит текст сообщения в окно сообщений.
//
// Параметры:
//  ТекстСообщения					 - Строка	 - содержит текст сообщения.
//  Статус							 - Строка	 - Статус сообщения. Определяет вид пиктограммы.
//  СписокПараметровЖурнала			 - Структура - структура параметров для записи в ЖР.
//  СтруктураПолейСообщения			 - Структура - содержит параметры объекта "СообщениеПользователю".
//  ВыводитьСообщениеПользователю	 - Булево	 - признак необходимости выводить сообщение пользователю.
//
Процедура обСообщить(ТекстСообщения,
					 Статус = Неопределено,
					 СписокПараметровЖурнала = Неопределено,
					 СтруктураПолейСообщения = Неопределено,
					 ВыводитьСообщениеПользователю = Истина) Экспорт
	
	Если ВыводитьСообщениеПользователю Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Если НЕ СтруктураПолейСообщения = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Сообщение, СтруктураПолейСообщения);
		КонецЕсли;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
				
	КонецЕсли;
	
	Если Не СписокПараметровЖурнала = Неопределено Тогда
		упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(СписокПараметровЖурнала);
	КонецЕсли;
	
КонецПроцедуры

// См. упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации
//
Процедура обЗаписатьВЖурналРегистрации(СписокПараметров) Экспорт
	
	упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(СписокПараметров);
	
КонецПроцедуры 

// Выводит на экран окно предупреждения.
//
// Параметры:
//  ТекстПредупреждения		 - Строка	 - текст предупреждения.
//  Таймаут					 - Число	 - интервал времени в секундах,
//  	в течение которого система будет ожидать ответа пользователя.
//  Заголовок				 - Строка	 - текст заголовка окна предупреждения.
//  СписокПараметровЖурнала	 - Структура - структура параметров для записи в ЖР.
//
Процедура обПредупреждение(ТекстПредупреждения, Таймаут = 0, Заголовок = "Предупреждение",
						   СписокПараметровЖурнала = Неопределено) Экспорт
	
	Если НЕ СписокПараметровЖурнала = Неопределено Тогда
		упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(СписокПараметровЖурнала);
	КонецЕсли;
	
#Если Клиент Тогда
	ПоказатьПредупреждение(,ТекстПредупреждения, Таймаут, Заголовок);	
#ИначеЕсли Сервер Тогда
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстПредупреждения;
	Сообщение.Сообщить();
#КонецЕсли
	
КонецПроцедуры

// Выводит на экран окно вопроса. Выбранный ответ обрабатывается в процедуре "обВопросЗавершение()".
//
// Параметры:
//  ТекстВопроса			 - Строка		 - Текст задаваемого вопроса.
//  Режим					 - РежимДиалогаВопрос	 - Задает состав кнопок диалога и возможные варианты ответов.
//  Таймаут					 - Число				 - Интервал времени в секундах,
//  				в течение которого система будет ожидать ответа пользователя.
//  КнопкаПоУмолчанию		 - КодВозвратаДиалога	 - Определяет кнопку,
//  	которая должна быть назначена кнопкой по умолчанию.
//  Заголовок				 - Строка				 - Содержит заголовок окна вопроса.
//  СписокПараметровЖурнала	 - Структура			 - структура параметров для записи в ЖР.
//  ОбработкаОповещения		 - ОписаниеОповещения	 - Содержит имя процедуры, которая должна быть выполнена
//  	после выбора варианта ответа.
// 
// Возвращаемое значение:
//  КодВозвратаДиалога, Неопределено 
//
Функция обВопрос(ТекстВопроса, Режим, Таймаут = 0,
	КнопкаПоУмолчанию = Неопределено, Заголовок = "",
	СписокПараметровЖурнала = Неопределено,ОбработкаОповещения=Неопределено) Экспорт
	
	Если НЕ СписокПараметровЖурнала = Неопределено Тогда
		упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(СписокПараметровЖурнала);
	КонецЕсли;
	
	#Если Клиент Тогда
		Контекст = Новый Структура("СледующееОповещение", ОбработкаОповещения);
		ОписаниеОповещения = Новый ОписаниеОповещения("обВопросЗавершение", , Контекст);
		ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, Режим, Таймаут, КнопкаПоУмолчанию, Заголовок);
	#КонецЕсли
	
КонецФункции

// Обработчик завершения функции обВопрос().
//
// Параметры:
//  Результат				 - КодВозвратаДиалога	 - ответ.
//  ДополнительныеПараметры	 - Структура			 - параметры.
//
Процедура обВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
#Если Клиент Тогда
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.СледующееОповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.СледующееОповещение, Результат);
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

// Выводит сообщение в строку состояния главного окна.
//
// Параметры:
//  ТекстСообщения	 - Строка	 - текст сообщения.
//
Процедура обСостояние(ТекстСообщения) Экспорт

#Если Клиент Тогда
		
	Состояние(ТекстСообщения);
		
#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработкиПечати

// Процедура выводит на печать подготовленный макет.
// Можно направить печать на экран или принтер,
// а также распечатать необходимое количество копий.
// 
// Параметры:
//  ПечДокумент           - ТабличыйДокумент - Макет на печать.
//  КоличествоЭкземпляров - Число - Количество экземпляров на печать.
//  НаПринтер             - Булево - Признак печати сразу на принтер.
//  Заголовок             - Строка - Заголовок окна табличного документа.
// 
Процедура обНапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "") Экспорт

	Если ПечДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Получить необходимое количество копий.
	Если КоличествоЭкземпляров < 1 Тогда
		ПечДокумент.КоличествоЭкземпляров = 1;
	Иначе
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;

	Если НаПринтер Тогда
		ПечДокумент.Напечатать();
	Иначе
		// Отобразить печатный документ на экране.
		ПечДокумент.ОтображатьЗаголовки = Ложь;
		ПечДокумент.ОтображатьСетку     = Ложь;
		ПечДокумент.Защита              = Истина; 
		ПечДокумент.ТолькоПросмотр      = Истина;
		ПечДокумент.Показать(Заголовок);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СообщенияОбОшибках

// См. упоРаботаСДиалогамиСервер.СформироватьЗаголовокОшибкиПриЗаписи
// 
Функция обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект) Экспорт
	
	Возврат упоРаботаСДиалогамиСервер.СформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
КонецФункции

// Функция формирует заголовок для сообщения об ошибке заполнения.
//
// Параметры:
//  ЭтотОбъект	 - ДокументОбъект
// 
// Возвращаемое значение:
//  Строка - заголовок сообщению.
//
Функция обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект) Экспорт
	
	Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоПроектнаяЗадача") Тогда
		Возврат "Операция проведения проектной задачи """ + СокрЛП(ЭтотОбъект.НазваниеПроектнойЗадачи) 
			+ """ (номер документа """+ЭтотОбъект.Номер+""") не выполнена!";
	Иначе
		Возврат "Операция проведения документа """ + СокрЛП(ЭтотОбъект.Ссылка) + """ не выполнена!";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОтладочныеСообщения

// Выводит отладочный текст сообщения в окно сообщений.
//
// Параметры:
//  ТекстСообщения			 - Строка	 - текст сообщения.
//  Статус					 - Строка	 -  Статус сообщения. Определяет вид пиктограммы.
//  СписокПараметровЖурнала	 - Структура			 - структура параметров для записи в ЖР.
//
Процедура обСообщитьОтладка(ТекстСообщения, Статус = Неопределено, СписокПараметровЖурнала = Неопределено) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Если Не СписокПараметровЖурнала = Неопределено Тогда
		упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(СписокПараметровЖурнала);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
	
// Функция убирает из текста сообщения слущебную информацию.
//
// Параметры:
//  ТекстСообщения - Строка - исходный текст сообщения.
//
// Возвращаемое значение:
//   Строка - очищенная строка.
//
Функция СформироватьТекстСообщения(Знач ТекстСообщения)

	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	
	Если ОкончаниеСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения < ОкончаниеСлужебногоСообщения Тогда
		
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1))
		                 + Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
						 
	КонецЕсли;
	
	Возврат СокрЛП(ТекстСообщения);

КонецФункции

#КонецЕсли

#КонецОбласти