////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с файлами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Если Клиент Тогда

// Получает идентификатор типа файла и возвращает строку фильтра
//  для диалога выбора файлов.
//
// Параметры:
//  ТипФайла - Строка	 - идентификатор типа файла ("MXL", "XLS", etc.).
// 
// Возвращаемое значение:
//  Строка - сформированная строка фильтра для диалога выбора файла.
//
Функция обФильтрДляФайла(ТипФайла = "") Экспорт

	ТипФайла = ВРег(ТипФайла);
	
	Если ТипФайла = "XML" Тогда
		ИмяТипа = "XML документ";
	ИначеЕсли ТипФайла = "MPP" Тогда
		ИмяТипа = "Файл MS Project";
	ИначеЕсли ТипФайла = "TXT" Тогда
		ИмяТипа = "Текстовый документ";
	ИначеЕсли ТипФайла = "MXL" Тогда
		ИмяТипа = "Табличный документ";
	ИначеЕсли ТипФайла = "XLS" Тогда
		ИмяТипа = "Документ MS Excel";
	ИначеЕсли ТипФайла = "CSV" Тогда
		ИмяТипа = "Файл CSV";
	Иначе
		ИмяТипа = "Все файлы";
		ТипФайла = "*";
	КонецЕсли; 		
	
	Возврат ИмяТипа + " (*." + НРег(ТипФайла) + ")|*." + НРег(ТипФайла);

КонецФункции

// Вызывает диалог выбора файла в режиме сохранения и
//  возвращает флаг успешности записи.
//
// Параметры:
//  Форма		 - Форма - откуда производится вызов (опционально).
//  Заголовок	 - Строка	 - заголовок диалога выбора файла.
//  ТипФайла	 - Строка	 - идентификатор типа файлов.
// 
// Возвращаемое значение:
//  Строка - Полный путь к выбранному файлу.
//
Функция обСохранитьФайл(Форма = Неопределено, Заголовок = "", ТипФайла = "") Экспорт

	Фильтр = обФильтрДляФайла(ТипФайла);	

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок = Заголовок;
	ДиалогВыбора.Фильтр = Фильтр;

	Если ДиалогВыбора.Выбрать() Тогда      
		Возврат ДиалогВыбора.ПолноеИмяФайла;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецЕсли

#КонецОбласти