
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НаименованиеЗадания = ЗапуститьДетектор(ПараметрКоманды);
	
	Если ЗначениеЗаполнено(НаименованиеЗадания) Тогда
		
		ПоказатьОповещениеПользователя(
		НСтр("ru = 'Запущена процедура регламентного задания'"), ,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1.
		|Процедура запущена в фоновом задани'"),
		НаименованиеЗадания),
		БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗапуститьДетектор(ВидСобытия) 
	
	УИ = ВидСобытия.УникальныйИдентификатор();
	
	Отбор = Новый Структура("Метаданные, Ключ", Метаданные.РегламентныеЗадания.упоОбработкаДетекторовСобытий, УИ);
	ЗаданияСобытия = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	НаименованиеЗадания = "";
	
	Для Каждого Задание Из ЗаданияСобытия Цикл
		НаименованиеЗадания = Задание.Наименование;
		РегламентныеЗаданияСлужебный.ВыполнитьРегламентноеЗаданиеВручную(Задание.УникальныйИдентификатор);
		Прервать;
	КонецЦикла;

	Возврат НаименованиеЗадания;
	
КонецФункции

#КонецОбласти