////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции обновления списка проектов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обновляет данные проекта.
//
// Параметры:
//  Источник - ДокументСсылка - источник, на основании движений которого нужно обновить данные проекта.
//  Отказ	 - Булево - признак отказа.
//  Параметр - Строка - "ОтменаПроведения" или "Проведение".
//
Процедура ОбновитьДанные(Источник, Отказ = Ложь, Параметр = Неопределено) Экспорт
	
	Данные = Новый Структура;
	Если Не Отказ Тогда
		Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Проекты") Тогда
			Если Не Источник.ЭтоПроектнаяЗадача Тогда
				ПолучитьДанныеПроекта(Источник, Данные);	
				ЗаписатьДанные(Источник, Данные);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.упоРегистрацияПроекта") Тогда
			ЗаписатьДвижения(Источник.Движения.упоРуководителиПроектов, Параметр);
			ЗаписатьДвижения(Источник.Движения.упоСтатусыПроектов, Параметр);
			ПолучитьДанныеРП(Источник, Данные);
			ПолучитьДанныеСП(Источник, Данные);
			ЗаписатьДанные(Источник.Проект, Данные);
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.упоИзменениеРуководителяПроекта") Тогда
			ЗаписатьДвижения(Источник.Движения.упоРуководителиПроектов, Параметр);	
			ПолучитьДанныеРП(Источник, Данные);
			ЗаписатьДанные(Источник.Проект, Данные);
		Иначе  //все остальные документы регистраторы регистра сведений "упоСтатусыПроектов"
			ЗаписатьДвижения(Источник.Движения.упоСтатусыПроектов, Параметр);
			ПолучитьДанныеСП(Источник, Данные);
			ЗаписатьДанные(Источник.Проект, Данные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается в случае проведения проекта для обновления данных по нему.
//
// Параметры:
//  Источник		 - ДокументСсылка - проводимый документ.
//  Отказ			 - Булево - признак отказа.
//  РежимПроведения	 - Произвольный - не используется.
//
Процедура упоПроведениеПоПроектуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ОбновитьДанные(Источник, Отказ, "Проведение");
	
КонецПроцедуры

// Вызывается в случае отмены проведения проекта для обновления данных по нему.
//
// Параметры:
//  Источник - ДокументСсылка - проводимый документ.
//  Отказ	 - Булево - признак отказа. 
//
Процедура упоПроведениеПоПроектуОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ОбновитьДанные(Источник, Отказ, "ОтменаПроведения");
	
КонецПроцедуры

// Вызывается при записи проекта для обновления данных по нему.
//
// Параметры:
//  Источник		 - ДокументСсылка - проводимый документ.
//  Отказ			 - Булево - признак отказа. 
Процедура упоЗаписьПроектаПриЗаписи(Источник, Отказ) Экспорт
	
	ОбновитьДанные(Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДанные(Проект, Данные)
	
	Запись = РегистрыСведений.упоСписокВыбораПроектов.СоздатьМенеджерЗаписи();
	Запись.Ссылка = Проект.Ссылка;
	Запись.Прочитать();
	ЗаполнитьЗначенияСвойств(Запись, Данные);
	Запись.Записать();
	
КонецПроцедуры

Процедура ЗаписатьДвижения(ТаблДвиж, Параметр)
	
	Если Параметр = "ОтменаПроведения" Тогда
		ТаблДвиж.Очистить();
		ТаблДвиж.Записать();
	ИначеЕсли Параметр = "Проведение" Тогда
		ТаблДвиж.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьДанныеПроекта (Проект, Данные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Ссылка,
	               |	Проекты.Код КАК Код,
	               |	Проекты.Наименование КАК Наименование,
	               |	Проекты.ПолноеНаименование КАК ПолноеНаименование,
	               |	Проекты.Организация КАК Организация,
	               |	Проекты.ПортфельПроектов КАК ПортфельПроектов,
	               |	Проекты.ПрограммаПроектов КАК ПрограммаПроектов,
	               |	Проекты.Подразделение КАК Подразделение,
	               |	Проекты.Компонент КАК Компонент,
	               |	Проекты.ПометкаУдаления КАК ПометкаУдаления,
	               |	ПРЕДСТАВЛЕНИЕ(Проекты.ПортфельПроектов) КАК ПортфельНаименование,
	               |	ПРЕДСТАВЛЕНИЕ(Проекты.ПрограммаПроектов) КАК ПрограммаНаименование,
	               |	Проекты.упоШифр КАК Шифр
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ЭтоПроектнаяЗадача
	               |	И Проекты.Ссылка = &Проект";
	Запрос.УстановитьПараметр("Проект", Проект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Данные.Вставить("Ссылка");
	Данные.Вставить("Код"); 
	Данные.Вставить("Наименование"); 
	Данные.Вставить("ПолноеНаименование"); 
	Данные.Вставить("Организация"); 
	Данные.Вставить("ПортфельПроектов"); 
	Данные.Вставить("ПрограммаПроектов"); 
	Данные.Вставить("Подразделение"); 
	Данные.Вставить("Компонент");
	Данные.Вставить("ПометкаУдаления"); 
	Данные.Вставить("ПортфельНаименование"); 
	Данные.Вставить("ПрограммаНаименование");
	Данные.Вставить("Шифр");
	
	ЗаполнитьЗначенияСвойств(Данные, Выборка);
	
КонецПроцедуры
		
Процедура ПолучитьДанныеРП(Источник, Данные)
	
	Проект = Источник.Проект;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(Руководители.РуководительПроекта, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) КАК РуководительПроекта,
	               |	ПРЕДСТАВЛЕНИЕ(Руководители.РуководительПроекта) КАК РуководительПроектаНаименование,
	               |	ЕСТЬNULL(Руководители.КураторПроекта, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) КАК КураторПроекта,
	               |	ПРЕДСТАВЛЕНИЕ(Руководители.КураторПроекта) КАК КураторПроектаНаименование
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК Руководители";
	Запрос.УстановитьПараметр("Проект", Проект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Данные.Вставить("РуководительПроектаНаименование");
	Данные.Вставить("РуководительПроекта");		
	Данные.Вставить("КураторПроектаНаименование");
	Данные.Вставить("КураторПроекта");			
	
	ЗаполнитьЗначенияСвойств(Данные, Выборка);
	
КонецПроцедуры
	
Процедура ПолучитьДанныеСП(Источник, Данные)
	
	Проект = Источник.Проект;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(Статусы.СтатусПроекта, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.ПустаяСсылка)) КАК СтатусПроекта,
	               |	ПРЕДСТАВЛЕНИЕ(Статусы.СтатусПроекта) КАК СтатусПроектаНаименование
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Статусы";					   
	Запрос.УстановитьПараметр("Проект", Проект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Данные.Вставить("СтатусПроектаНаименование"); 
	Данные.Вставить("СтатусПроекта");
	
	ЗаполнитьЗначенияСвойств(Данные, Выборка);
		
КонецПроцедуры	

#КонецОбласти