
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	Проект = Объект.Проект;
	
	ОграничитьВыборПроектнойПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	упоАналитикаПоПодразделениямКлиент.УстановитьДоступностьДоговораИсполнителя(Объект.РаспределениеДоходов);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
	УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПрограммно(РежимЗаписи,Закрыть)
	
	Отказ = Ложь;
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписи);
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Объект.Доходы.Количество() = 0 
		И Объект.Расходы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не введено ни одной строки в таблице ""Фактические доходы"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.Доходы",, Отказ);
		ТекстСообщения = НСтр("ru = 'Не введено ни одной строки в таблице ""Фактические расходы"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.Расходы",, Отказ);
	КонецЕсли;
	
	КлючиТаблиц = "ТаблицаВладелец,ТаблицаПодчиненная,ИмяКолонкиВладелец,ИмяКолонкиПодчиненная,ЕстьКоличество,ПредставлениеТаблицыРаспределения";
	ПараметрыТаблиц = Новый Массив;
	ПараметрыТаблиц.Добавить(Новый Структура(КлючиТаблиц, "Доходы", "РаспределениеДоходов", "Сумма", "Сумма", Истина, "'Доходы'"));
	ПараметрыТаблиц.Добавить(Новый Структура(КлючиТаблиц, "Расходы", "РаспределениеРасходов", "Сумма", "Сумма", Истина, "'Расходы'"));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РежимЗаписи", РежимЗаписи);
	ДопПараметры.Вставить("Закрыть", Закрыть);

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьПрограммноЗавершение", ЭтотОбъект, ДопПараметры);
	
	упоАналитикаПоПодразделениямКлиент.ПроверитьРаспределениеПередЗаписью(Объект, ПараметрыТаблиц, Отказ, ОписаниеОповещения);
	
	Если Не Отказ Тогда
		ЗаписатьПрограммноЗавершение(Истина,ДопПараметры);	
	КонецЕсли;
	
КонецПроцедуры

// Завершение обработчика события завершения "Записать программно".
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
&НаКлиенте
Процедура ЗаписатьПрограммноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи",ДополнительныеПараметры.РежимЗаписи);
		
		Записать(ПараметрыЗаписи);
		Если ДополнительныеПараметры.Закрыть Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ, "");	

	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "СменаНастроекУчетаПодразделений" Тогда
		УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Проект = Объект.Проект;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	АдресХранилища = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если Объект.Доходы.Количество() > 0 Или Объект.Расходы.Количество() > 0  Тогда
		ОписаниеОповещенияВопросОчисткиТаблицыЗавершение = Новый ОписаниеОповещения("ВопросОчисткиТаблицыЗавершение", 
																									ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Данные таблиц будут очищены. Продолжить?'");	
		ПоказатьВопрос(ОписаниеОповещенияВопросОчисткиТаблицыЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	Иначе
		Объект.Проект = Проект;
		УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоходы

&НаКлиенте
Процедура ДоходыПроектнаяЗадачаПроектОчистка(Элемент, СтандартнаяОбработка)
	
	ПриИзмененииПЗСервер("Доходы");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПроектнаяЗадачаПроектПриИзменении(Элемент)
	
	ПриИзмененииПЗСервер("Доходы");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПроектнаяЗадачаПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)		
	
	ТекДанные = Элементы.Доходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
			
	упоПроектыИЗадачиКлиент.УстановитьПараметрыВыбораПроектнойЗадачи(Элемент, 
													Объект.Проект, 
													ТекДанные.ПроектнаяЗадачаПроект, 
													СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект, "Доходы",
		"РаспределениеДоходов", Копирование, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Доходы",
		"РаспределениеДоходов", , Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "Доходы", "РаспределениеДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля = "Контрагент";
		Иначе 
			имяПоля = "Статья";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Доходы");		
		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля, Объект.Доходы, ЭтаФорма,
			Истина, ПараметрыПодбораСтруктура, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля = "Контрагент";
		Иначе 
			имяПоля = "Статья";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Доходы");		
		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.Доходы, ЭтаФорма, Истина, ПараметрыПодбораСтруктура, Истина);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.Доходы.ТекущиеДанные;
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Доходы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "Доходы"); 
	ДоходыДоговорПриИзменении(Элемент);  

КонецПроцедуры

&НаКлиенте
Процедура ДоходыДоговорПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма, "Доходы"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Доходы.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = упоЗаполнениеИПодборКлиент.ПолучитьЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Доходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Сумма");
	
	Если Не ЕстьРаспределениеДоходов Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "Доходы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ДоходыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Доходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Количество");
	
	Если Не ЕстьРаспределениеДоходов Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "Доходы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ДоходыСтоимостьПриИзменении(Элемент)
	
	ТекДанные = Элементы.Доходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Стоимость");	
	
	Если Не ЕстьРаспределениеДоходов Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "Доходы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеДоходов

&НаКлиенте
Процедура РаспределениеДоходовСобствСилы_СубподрядПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеДоходов", 
																						ИспользоватьАналитикуКонтрагентДляСС);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеДоходов.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.Доходы, Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.Доходы, 
		Элементы.РаспределениеДоходов, Объект, НоваяСтрока, Копирование);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовКоличествоПриИзменении(Элемент)
		
	ПриИзмененииКоличестваВРаспределении("Доходы", "РаспределениеДоходов");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура РасходыПроектнаяЗадачаПроектПриИзменении(Элемент)
	
	ПриИзмененииПЗСервер("Расходы");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПроектнаяЗадачаПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	упоПроектыИЗадачиКлиент.УстановитьПараметрыВыбораПроектнойЗадачи(Элемент, 
													Объект.Проект, 
													ТекДанные.ПроектнаяЗадачаПроект, 
													СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПроектнаяЗадачаПроектОчистка(Элемент, СтандартнаяОбработка)
	
	ПриИзмененииПЗСервер("Расходы");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля = "Контрагент";
		Иначе 
			имяПоля = "Статья";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Расходы");	
		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля,
			Объект.Расходы, ЭтаФорма, Истина, ПараметрыПодбораСтруктура, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля = "Контрагент";
		Иначе 
			имяПоля = "Статья";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Расходы");	
		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.Расходы, ЭтаФорма, Истина, ПараметрыПодбораСтруктура, Истина);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Расходы",
		"РаспределениеРасходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект,
		"Расходы", "РаспределениеРасходов", Копирование, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.Расходы.ТекущиеДанные;	
	
	Если Копирование Тогда
		ТекСтрока.ИндексСтрокРаспределения = 0;
	КонецЕсли;     
	           
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Расходы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасходыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(
		ЭтаФорма, Объект, "Расходы", "РаспределениеРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "Расходы"); 
	РасходыДоговорПриИзменении(Элемент);  
		
КонецПроцедуры

&НаКлиенте
Процедура РасходыДоговорПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма, "Расходы"); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = упоЗаполнениеИПодборКлиент.ПолучитьЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Сумма");
	
	Если Не ЕстьРаспределениеРасходов Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "Расходы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура РасходыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Количество");
	
	Если Не ЕстьРаспределениеРасходов Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "Расходы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура РасходыСтоимостьПриИзменении(Элемент)
	
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Стоимость");
	
	Если Не ЕстьРаспределениеРасходов Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "Расходы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеРасходов

&НаКлиенте
Процедура РаспределениеРасходовСобствСилы_СубподрядПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеРасходов.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.Расходы, Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.Расходы,
		Элементы.РаспределениеРасходов, Объект, НоваяСтрока, Копирование);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Расходы", "РаспределениеРасходов", , Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Расходы",
		"РаспределениеРасходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Расходы", "РаспределениеРасходов", , Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Расходы",
		"РаспределениеРасходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовКоличествоПриИзменении(Элемент)
	
	ПриИзмененииКоличестваВРаспределении("Расходы", "РаспределениеРасходов");	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборВТЧФормы(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных, ПараметрыПодбора.ЭлементВладелец,
		ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		
	
КонецПроцедуры

&НаКлиенте	
Процедура ЗаполнитьТЧФормы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Вначале необходимо выбрать проект.'");
		Сообщение.Поле = "Проект";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	Если Команда.Имя = "ЗаполнитьПоТекПлануДоходы" Тогда
		
		ЗаполнитьТабличнуюЧастьПоВерсии(, "Доходы");
		
	ИначеЕсли Команда.Имя = "ЗаполнитьПоУтвержденномуПлануДоходы" Тогда
		
		ЗаполнитьТабличнуюЧасть("По версии", ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход"));
		
	ИначеЕсли Команда.Имя = "ЗаполнитьПоТекПлануРасход" Тогда
		
		ЗаполнитьТабличнуюЧастьПоВерсии(, "Расходы");
		
	ИначеЕсли Команда.Имя = "ЗаполнитьПоУтвержденномуПлануРасход" Тогда
		
		ЗаполнитьТабличнуюЧасть("По версии", ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход"));
		
	ИначеЕсли Команда.Имя = "ЗаполнитьПоВыполненнымОбъемамДоходы" Тогда
		
		ЗаполнитьПоВыполненнымОбъемам("Доходы");
		
	ИначеЕсли Команда.Имя = "ЗаполнитьПоВыполненнымОбъемамРасходы" Тогда
		
		ЗаполнитьПоВыполненнымОбъемам("Расходы");
		
	КонецЕсли;
	
	Если Объект.Доходы.Количество() > 0 Тогда
		
		Элементы.Доходы.ТекущаяСтрока = 0;
		
	КонецЕсли;
	
	Если Объект.Расходы.Количество() > 0 Тогда
		
		Элементы.Расходы.ТекущаяСтрока = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте	
Процедура КомандаКопироватьСтрокуВладельцаВРаспределение(Команда)
	
	Результат = НастройкиПоИмениКоманды(Команда.Имя);	
	Если Результат = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;	

	ИмяОсновнойТаблицы		= Результат.ИмяОсновнойТаблицы;
	ИмяТаблицыРаспределения = Результат.ИмяТаблицыРаспределения;
	ИмяКолонкиСумма 		= Результат.ИмяКолонкиСумма;
	УчитыватьКоличество		= Результат.УчитыватьКоличество;
				
	упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределениеСОчисткой(ЭтаФорма, 
																						ИмяОсновнойТаблицы, 
																						ИмяТаблицыРаспределения, 
																						ИмяКолонкиСумма, 
																						УчитыватьКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыделитьНДС(Команда)
	
	Результат = НастройкиПоИмениКоманды(Команда.Имя);	
	Если Результат = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;	
	
	ИмяОсновнойТаблицы		= Результат.ИмяОсновнойТаблицы;
	ИмяТаблицыРаспределения = Результат.ИмяТаблицыРаспределения;
	ИмяКолонкиСумма 		= Результат.ИмяКолонкиСумма;
	УчитыватьКоличество		= Результат.УчитыватьКоличество;		
			
	ТекущиеДанные = Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;		
	
	// Заполнение по умолчанию.
	СтрокиРаспределенияПоПодразделениям = упоПроектыИЗадачиОбщие.ПолучитьСтрокиРаспределенияПоПодразделениям(
																								ТекущиеДанные, 
																								Объект[ИмяТаблицыРаспределения], 
																								Истина);
	Если СтрокиРаспределенияПоПодразделениям.Количество() = 0 Тогда									
		упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределениеСОчисткой(ЭтаФорма, 
																								ИмяОсновнойТаблицы, 
																								ИмяТаблицыРаспределения, 
																								ИмяКолонкиСумма, 
																								УчитыватьКоличество);
	КонецЕсли;					
	
	// НДС.
	СтрокаВладелец = Новый Структура;
	СтрокаВладелец.Вставить("Валюта", ТекущиеДанные.Валюта); 
	СтрокаВладелец.Вставить("Договор", ТекущиеДанные.Договор);
	СтрокаВладелец.Вставить("ИндексСтрокРаспределения", ТекущиеДанные.ИндексСтрокРаспределения);
	СтрокаВладелец.Вставить("Сумма", ТекущиеДанные[ИмяКолонкиСумма]);			
						
	ВыделитьНДС(СтрокаВладелец, ИмяОсновнойТаблицы);		
	
	// Итоги.
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, 
																		ИмяОсновнойТаблицы, 
																		ИмяТаблицыРаспределения, 
																		ИмяКолонкиСумма);
			
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросОчисткиТаблицыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Проект = Объект.Проект;
		Возврат;
	КонецЕсли;
	
	Объект.Доходы.Очистить();
	Объект.РаспределениеДоходов.Очистить();
	Объект.Расходы.Очистить();
	Объект.РаспределениеРасходов.Очистить();
	Объект.Проект = Проект;
	УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	
КонецПроцедуры

// Производит автоматическое заполнение табличной части.
//
// Параметры:
//  РежимЗаполнения  – Строка - указывает на источник данных.
//  ВидЭлемента  - Перечисление.ВидЭлементаПланаДоходовИРасходов
//                 указывает, какую именно табличную часть заполняем.
//
&НаКлиенте
Процедура ЗаполнитьТабличнуюЧасть(РежимЗаполнения, ВидЭлемента)
	
	// проверим, выбрана ли проектная задача
	
	Если ВидЭлемента = ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход") Тогда
		ТабЧасть = "Доходы";
		ЭлементВладелец = Элементы.Доходы;
	ИначеЕсли ВидЭлемента = ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход") Тогда
		ТабЧасть = "Расходы";
		ЭлементВладелец = Элементы.Расходы;
	КонецЕсли; 
	
	Если РежимЗаполнения = "По плану" Тогда
		ЗаполнитьТабличнуюЧастьНаСервере(ТабЧасть, РежимЗаполнения, ВидЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьНаСервере(имяТабЧасти, РежимЗаполнения, ВидЭлемента)
	
	ТабЧасть = Объект[имяТабЧасти];
	ТабЧасть.Очистить(); 
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	ПараметрыЗапроса = Новый Структура("ТекВерсия,ПроектнаяЗадача,ВидЭлемента", ТекВерсия, Объект.ПроектнаяЗадача, ВидЭлемента);
	
	// Простой режим - забираем данные из текущего плана.
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РегПлан.Статья,
	               |	РегПлан.ДатаНачисления,
	               |	СУММА(РегПлан.СуммаВалютная) КАК Сумма,
	               |	РегПлан.Контрагент,
	               |	РегПлан.Договор,
	               |	РегПлан.Валюта
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(
	               |			,
	               |			Версия = &ТекВерсия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И ВидЭлемента = &ВидЭлемента) КАК РегПлан
	               |ГДЕ
	               |	РегПлан.СуммаВалютная > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РегПлан.Статья,
	               |	РегПлан.ДатаНачисления,
	               |	РегПлан.Валюта,
	               |	РегПлан.Контрагент,
	               |	РегПлан.Договор";
	
	// извлекаем данные запросом
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	// и переливаем их в табличную часть	
	Для Каждого СтрокаТЗ Из ТаблицаЗапроса Цикл
		НоваяСтрока = ТабЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьПоВерсии(текВерсия = Неопределено, ТаблицаВладелец)
			
	Если ТекВерсия = Неопределено Тогда
		текВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	КонецЕсли;
			
	ЗаполнятьДоходы = ТаблицаВладелец = "Доходы";	
	ЗаполнятьРасходы = ТаблицаВладелец = "Расходы";
	
	Документы.упоРегистрацияФактическихДоходовИРасходов.ЗаполнитьОбъектПоОснованию(Объект, текВерсия, ЗаполнятьДоходы, ЗаполнятьРасходы); 
	
	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоВыполненнымОбъемам(ТаблицаВладелец)
	
	ЗаполнятьДоходы = ТаблицаВладелец = "Доходы";
	ЗаполнятьРасходы = ТаблицаВладелец = "Расходы";
	Документы.упоРегистрацияФактическихДоходовИРасходов.ЗаполнитьОбъектПоОснованию(Объект, "ПоВыполненнымОбъемам",
		ЗаполнятьДоходы, ЗаполнятьРасходы);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

// Подготавливает доп. параметры структуры подбора.
//
// Параметры:
//  ПараметрыПодбораСтруктура	 - 	 - 
//  ИмяТЧ						 - 	 - 
//
&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ) Экспорт
	
	ПараметрыПодбораСтруктура= Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных =  ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("СтруктураСтрокиТЧ", Новый Структура);
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураСтрокиТЧ, ИмяТЧ);
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)
	
	// Перенести код в модуль с повторным использованием значений.
	
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов.Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);
		
	Иначе 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
		
		Объект.Проект = ВыбранноеЗначение;
		упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Объект.Проект = ВыбранноеЗначение.Проект;
		упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	АдресХранилища = "";
	
	Если имяКоманды = "ДействиеПодобрать_ПланДоходов_ПоСтатьям" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.Доходы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.упоСтатьиДоходов";
		ТаблицаФормы = Объект.Доходы;
		ИмяКолонки = "Статья";
		ПараметрыПодбора.ДопПараметры.ПовторныйВыбор = Истина;
		
	ИначеЕсли  имяКоманды = "ДействиеПодобрать_ПланДоходов_ПоКонтрагентам" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.Доходы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.Контрагенты";
		ТаблицаФормы = Объект.Доходы;
		ИмяКолонки = "Контрагент";
		ПараметрыПодбора.ДопПараметры.ПовторныйВыбор = Истина;
		
	ИначеЕсли  имяКоманды = "ДействиеПодобрать_ПланРасходов_ПоСтатьям" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.Расходы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.упоСтатьиЗатрат";
		ТаблицаФормы = Объект.Расходы;
		ИмяКолонки = "Статья";
		ПараметрыПодбора.ДопПараметры.ПовторныйВыбор = Истина;
		
	ИначеЕсли  имяКоманды = "ДействиеПодобрать_ПланРасходов_ПоКонтрагентам" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.Расходы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.Контрагенты";
		ТаблицаФормы = Объект.Расходы;
		ИмяКолонки = "Контрагент";
		ПараметрыПодбора.ДопПараметры.ПовторныйВыбор = Истина;
		
	КонецЕсли;
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки, 
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
	
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ПолучитьПЗПоПроекту(ПроектПЗ)
	
	Возврат ПроектПЗ.СсылкаНаПроектнуюЗадачу;
	
КонецФункции

&НаКлиенте	
Процедура ПриИзмененииПЗСервер(ТЧОбъекта)
	
	ТекущиеДанные = Элементы[ТЧОбъекта].ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ПроектнаяЗадачаПроект) Тогда
			
			ТекущиеДанные.ПроектнаяЗадача = ПолучитьПЗПоПроекту(ТекущиеДанные.ПроектнаяЗадачаПроект);
			
		Иначе 
			
			ТекущиеДанные.ПроектнаяЗадача = ПредопределенноеЗначение("Документ.упоПроектнаяЗадача.ПустаяСсылка");
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// Выполнить действия при подборе.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура - строка данных, над которой выполняются действия.
//  ПараметрыПодбора	 - Структура - параметры подбора.
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	Если ТипЗнч(ПараметрыПодбора) = Тип("Структура") Тогда
		
		Если ПараметрыПодбора.Свойство("ПараметрыПодбораСписок") Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыПодбора.СтруктураСтроки, СтрокаТабличнойЧасти);			
			упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбора.СтруктураСтроки,
				ПараметрыПодбора.ПараметрыПодбораСписок, ПараметрыПодбора.СвойстваОбъекта);
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ПараметрыПодбора.СтруктураСтроки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям()
	
	СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	ИспользоватьАналитикуКонтрагентДляСС = СтруктураСвойств.ИспользоватьАналитикуКонтрагентДляСС;
	
	ЕстьРаспределениеДоходов = СтруктураСвойств.ДоходыПоПодразделениям;
	ЕстьРаспределениеРасходов = СтруктураСвойств.РасходыПоПодразделениям;
	ДоходыПоНатуральнымПоказателям = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	РасходыПоНатуральнымПоказателям =  СтруктураСвойств.РасходыПоНатуральнымПоказателям;

	Элементы.РаспределениеДоходов.Видимость = ЕстьРаспределениеДоходов;
	
	Элементы.ДоходыНоменклатура.Видимость = ДоходыПоНатуральнымПоказателям;
	Элементы.ДоходыЕдиницаИзмерения.Видимость = ДоходыПоНатуральнымПоказателям;
	Элементы.ДоходыКоличество.Видимость = ДоходыПоНатуральнымПоказателям;
	Элементы.ДоходыСтоимость.Видимость = ДоходыПоНатуральнымПоказателям;
	
	Элементы.РаспределениеРасходов.Видимость = ЕстьРаспределениеРасходов;
	
	Элементы.РасходыНоменклатура.Видимость = РасходыПоНатуральнымПоказателям;
	Элементы.РасходыЕдиницаИзмерения.Видимость = РасходыПоНатуральнымПоказателям;
	Элементы.РасходыКоличество.Видимость = РасходыПоНатуральнымПоказателям;
	Элементы.РасходыСтоимость.Видимость = РасходыПоНатуральнымПоказателям;
	
	Элементы.РаспределениеРасходовКоличество.Видимость = РасходыПоНатуральнымПоказателям;
	Элементы.РаспределениеДоходовКоличество.Видимость = ДоходыПоНатуральнымПоказателям;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура РаспределениеДоходовКонтрагентПодрядчикПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "РаспределениеДоходов", "КонтрагентПодрядчик", "ЗаказДоговорПодрядчика"); 

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровестиИЗакрыть(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровести(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗаписать(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Запись, Ложь);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста	
Процедура КоличествоСуммаПриИзменении(ТекущаяСтрокаРегистрацииФакта, ИзменяемаяКолонка)
	
	упоРаботаСФормамиКлиентСервер.КоличествоСуммаПриИзменении(ТекущаяСтрокаРегистрацииФакта, ИзменяемаяКолонка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличестваВРаспределении(ИмяТаблицы, ИмяТаблицыРаспределения)
	
	ТекущаяСтрока = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Или ТекущаяСтрока.Количество = 0 
		Или ТекущаяСтрока.Стоимость = 0 И ТекущаяСтрока.Сумма <> 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущаяСтрокаРаспределения = Элементы[ИмяТаблицыРаспределения].ТекущиеДанные;		
		
	ТекущаяСтрокаРаспределения.Сумма = ТекущаяСтрока.Стоимость * ТекущаяСтрокаРаспределения.Количество;
		
КонецПроцедуры

&НаСервере
Процедура ВыделитьНДС(СтрокаВладелец, ИмяТаблицы)
			
	ПараметрыРаспределения = упоДоходыИРасходыСервер.ПараметрыВыделенияНДСВРаспределенииПоУмолчанию();
	ПараметрыРаспределения.Проект 		= Объект.Проект;
	ПараметрыРаспределения.СтавкаНДС 	= упоДоходыИРасходыСервер.ЗначениеСтавкиНДС(СтрокаВладелец.Договор, Объект.Проект);
	
	упоДоходыИРасходыСервер.ВыделитьНДСВРаспределении(Объект, 
													СтрокаВладелец, 
													ИмяТаблицы,
													, 
													ПараметрыРаспределения);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОсновнойТаблицыПоИмениКоманды(ИмяКоманды)
			
	Если ИмяКоманды = "ВыделитьНДСДоходы"
		Или ИмяКоманды = "ЗаполнитьПоВладельцуДоходы" Тогда				
		ИмяТаблицы = "Доходы";										
	ИначеЕсли ИмяКоманды = "ВыделитьНДСРасходы"
		Или ИмяКоманды = "ЗаполнитьПоВладельцуРасходы" Тогда 	
		ИмяТаблицы = "Расходы";					
	Иначе
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Возврат ИмяТаблицы;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция ИменаТаблицРеквизитовПоИмениОсновнойТаблицы(ИмяОсновнойТаблицы)			
		
	ИмяКолонкиСумма = "Сумма";
	
	Если ИмяОсновнойТаблицы = "Доходы" Тогда						
		ИмяТаблицыРаспределения = "РаспределениеДоходов";		
	ИначеЕсли ИмяОсновнойТаблицы = "Расходы" Тогда 			
		ИмяТаблицыРаспределения = "РаспределениеРасходов";
	Иначе
		Возврат Неопределено; // Возврат.
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицыРаспределения", 	ИмяТаблицыРаспределения);
	Результат.Вставить("ИмяКолонкиСумма", 			ИмяКолонкиСумма);	
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиПоИмениКоманды(ИмяКоманды)
		
	ИмяОсновнойТаблицы = ИмяОсновнойТаблицыПоИмениКоманды(ИмяКоманды);
	Если ИмяОсновнойТаблицы = Неопределено Тогда
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Результат = ИменаТаблицРеквизитовПоИмениОсновнойТаблицы(ИмяОсновнойТаблицы);	
	Если Результат = Неопределено Тогда
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Результат.Вставить("ИмяОсновнойТаблицы", 	ИмяОсновнойТаблицы);
	Результат.Вставить("УчитыватьКоличество", 	Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОграничитьВыборПроектнойПродукции ()
	
	ППДоступна = упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция();
		
	Если ППДоступна Тогда
		Возврат;
	КонецЕсли;	
		
	ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДоходыНоменклатура", "ОграничениеТипа", ОграничениеТипа);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДоходыНоменклатура", "ВыбиратьТип", Ложь);	
	
КонецПроцедуры	

&НаКлиенте
Процедура РаспределениеСтоимостиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	Если (ДополнительныеПараметры.ИмяТаблицыВладельца = "Доходы" И Не ДоходыПоНатуральнымПоказателям)
		Или (ДополнительныеПараметры.ИмяТаблицыВладельца = "Расходы" И Не РасходыПоНатуральнымПоказателям) Тогда
		ДополнительныеПараметры.Вставить("ПересчитыватьКоличество", Ложь);
	КонецЕсли;

	упоРаботаСФормамиКлиент.ПересчитатьТаблицуРаспределенияЗавершение(ДополнительныеПараметры);			
	
	ВосстановитьОбнуленныйНДСПослеПересчета(ДополнительныеПараметры.ТаблицаРаспределения,
											ДополнительныеПараметры.ТекДанные,
											ДополнительныеПараметры.ИмяТаблицыВладельца);

	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, 
																		ДополнительныеПараметры.ИмяТаблицыВладельца, 
																		ДополнительныеПараметры.ИмяТаблицыРаспределения, 
																		ДополнительныеПараметры.ИмяКолонкиОбщСтоимость,
																		ДополнительныеПараметры.ПересчитыватьКоличество);
																		
КонецПроцедуры 
																	
// Если в подчиненных строках был НДС, его сумма обнулится при пересчете по коэффициентам, т.к. в строке НДС Количество = 0. 
// Для восстановления делаем пересчет НДС.
&НаКлиенте
Процедура ВосстановитьОбнуленныйНДСПослеПересчета(ТаблицаРаспределения, СтрокаВладелец, ИмяТаблицыВладельца)
	
	СтруктураСтрокаВладелец = упоРаботаСФормамиКлиент.СтруктураСтрокиДляРасчетаНДС(ТаблицаРаспределения, СтрокаВладелец, 
		ИмяТаблицыВладельца);
		
	Если Не ЗначениеЗаполнено(СтруктураСтрокаВладелец) Тогда
		Возврат;
	КонецЕсли;
	
	ВыделитьНДС(СтруктураСтрокаВладелец, ИмяТаблицыВладельца);
		
КонецПроцедуры

#КонецОбласти
