////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с отправкой сообщений по Telegram.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает информацию по версии модуля.
// 
// Возвращаемое значение:
//  Структура
//
Функция Информация() Экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("ИмяМодуля", НСтр("ru = 'Модуль транспорта подсистемы оповещений для отправки сообщений в Telegram'"));
	Ответ.Вставить("ВерсияМодуля", "1.0");
	
	Возврат Ответ;
	
КонецФункции 

// Отправляет сообщение.
//
// Параметры:
//  ПарОтправки	 - Структура
// 
// Возвращаемое значение:
//  Структура - см. упоРаботаCTelegram.ОтправитьСообщениеПользователю
//
Функция ОтправитьСообщение(ПарОтправки) Экспорт
	
	Если ПустаяСтрока(ПарОтправки.Кому) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = упоРаботаCTelegram.ОтправитьСообщениеПользователю(, ПарОтправки.Кому, ПарОтправки.Тело);
	
	Возврат Результат;
	
КонецФункции

// Получает настройки транспорта.
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьНастройкиТранспорта() Экспорт
	
	Рез = Новый Структура;
	Рез.Вставить("ДоступнаТемаСообщения", Ложь);
	Рез.Вставить("ДоступенТекстСообщенияВHTML", Ложь);
	Рез.Вставить("ДоступнаНастройкаДляВидаСобытия", Ложь);
	
	ПарТраспорта = Новый Структура;
	
	Рез.Вставить("ПараметрыТранспорта", ПарТраспорта);
	
	Возврат Рез;
	
КонецФункции

// Выводит на форму дополнительную информацию.
//
// Параметры:
//  Форма	 - УправляемаяФорма
//
Процедура ВыводНаФормуДополнительнойИнформации(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Команда = Форма.Команды.Добавить("ОткрытьНастройкиTelegram");
	Команда.Заголовок = "e1cib/app/ОбщаяФорма.упоНастройкиТранспортаОповещенийTelegram";
	Команда.Действие = "Подключаемый_ОткрытьНавигационнуюСсылкуПоЗаголовкуКоманды";
	
	Элемент = Элементы.Добавить("ОткрытьНастройкиTelegram", Тип("КнопкаФормы"), Элементы.ГруппаНастроек);
	Элемент.Заголовок = НСтр("ru = 'Настройки отправки сообщений в Telegram'");
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = Команда.Имя;
	
	СтрокаЭлемента = Форма.ДобавленныеЭлементы.Добавить();
	СтрокаЭлемента.Имя = Команда.Имя;
	СтрокаЭлемента.Тип = "команда";
	
	СтрокаЭлемента = Форма.ДобавленныеЭлементы.Добавить();
	СтрокаЭлемента.Имя = Элемент.Имя;
	СтрокаЭлемента.Тип = "элемент";
	
	//
	
	Команда = Форма.Команды.Добавить("ОткрытьМониторИТС");
	Команда.Заголовок = "e1cib/app/Обработка.МониторПортала1СИТС";
	Команда.Действие = "Подключаемый_ОткрытьНавигационнуюСсылкуПоЗаголовкуКоманды";
	СтрокаЭлемента = Форма.ДобавленныеЭлементы.Добавить();
	СтрокаЭлемента.Имя = Команда.Имя;
	СтрокаЭлемента.Тип = "команда";
	
	Элемент = Элементы.Вставить("ГруппаФункциональностьДоступна", Тип("ГруппаФормы"), Элементы.ГруппаИнформацияОМодуле, Элементы.ИмяМодуля);
	Элемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Элемент.РазрешитьИзменениеСостава = Ложь;
	Элемент.ОтображатьЗаголовок = Ложь;
	Элемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элемент.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
	Элемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	СтрокаЭлемента = Форма.ДобавленныеЭлементы.Добавить();
	СтрокаЭлемента.Имя = Элемент.Имя;
	СтрокаЭлемента.Тип = "элемент";
	
	Элемент = Элементы.Добавить("НадписьФункциональностьДоступна_", Тип("ДекорацияФормы"), Элементы["ГруппаФункциональностьДоступна"]);
	Элемент.Заголовок = НСтр("ru = 'Функциональность доступна при наличии активной подписки ИТС.'");
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	СтрокаЭлемента = Форма.ДобавленныеЭлементы.Добавить();
	СтрокаЭлемента.Имя = Элемент.Имя;
	СтрокаЭлемента.Тип = "элемент";
	
	Элемент = Элементы.Добавить("МониторИТС", Тип("КнопкаФормы"), Элементы["ГруппаФункциональностьДоступна"]);
	Элемент.Заголовок = НСтр("ru = 'Монитор Портала 1С:ИТС'");
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = Команда.Имя;
	СтрокаЭлемента = Форма.ДобавленныеЭлементы.Добавить();
	СтрокаЭлемента.Имя = Элемент.Имя;
	СтрокаЭлемента.Тип = "элемент";
	
КонецПроцедуры

#КонецОбласти
