
&НаСервере
Процедура ЗаписатьНаСервере()
	
	ПараметрыСоединения = Новый Структура; 
	
	Для каждого реквизит Из Метаданные.Обработки.ИКТ_RequestПараметрыСоединения.Реквизиты Цикл  
		
		ПараметрыСоединения.Вставить(Реквизит.Имя, Объект[Реквизит.Имя]);   
		
	КонецЦикла;
	
	Константы.ИКТ_RequestПараметрыСоединения.Установить(Новый ХранилищеЗначения(ПараметрыСоединения));
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();   
	ЭтаФорма.Закрыть();
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСоединения = Обработки.ИКТ_RequestПараметрыСоединения.ПолучитьПараметрыСоединенияСRequest();
	
	Если ПараметрыСоединения <> Неопределено 
		И ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСоединения);
		
	КонецЕсли;
	
КонецПроцедуры


