#Область ПрограммныйИнтерфейс

// Обрабатывает команду открытия формы движений документа в проектном бюджетировании.
//
// Параметры:
//  ПараметрКоманды				 - ДокументСсылка - документ-источник команды.
//  ПараметрыВыполненияКоманды	 - ПараметрыВыполненияКоманды	 -  параметр выполнения команды.
//
Процедура Подключаемый_ОткрытьФормуОтраженияВПроектномБюджетировании(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура("ДокументОснование", ПараметрКоманды);
	ОткрытьФорму("Обработка.упоОтражениеДокументовВПроектномБюджетировании.Форма.ФормаДвижений", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Форма.Окно, 
		ПараметрыВыполненияКоманды.Форма.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
