////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с заданиями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Синхронизирует поручения с проектными задачами.
//
// Параметры:
//  ПроектИлиЗадача		 - СправочникСсылка.Проект, ДокументСсылка.упоПроектнаяЗадача, Массив
//  ЗадачиДляСоздания	 - Неопределено, Массив
//
Процедура СинхронизироватьПорученияЗадач(ПроектИлиЗадача, ЗадачиДляСоздания = Неопределено, Версия = Неопределено) Экспорт
	
	ТипЗнчМассивЗадачДляСоздания = ТипЗнч(ЗадачиДляСоздания);
	
	Если ТипЗнчМассивЗадачДляСоздания = Тип("СправочникСсылка.Проекты") Тогда
		МассивЗадачДляСоздания = ПолучитьМассивЗадачДляСозданияПоручений(ЗадачиДляСоздания);
		ТипЗнчМассивЗадачДляСоздания = ТипЗнч(МассивЗадачДляСоздания);
	Иначе 
		МассивЗадачДляСоздания = ЗадачиДляСоздания;
	КонецЕсли;
	
	Если упоЗаданияСерверПовтИсп.ОтложеннаяСинхронизацияПорученийЗадач() Тогда
		
		Если ТипЗнчМассивЗадачДляСоздания = Тип("Массив") Тогда
			Для Каждого Задача Из МассивЗадачДляСоздания Цикл
				ДобавитьВОчередьСинхронизацииПоручений(Задача, Истина);
			КонецЦикла;
		ИначеЕсли ТипЗнчМассивЗадачДляСоздания = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			ДобавитьВОчередьСинхронизацииПоручений(МассивЗадачДляСоздания, Истина);
		КонецЕсли;
		
		Если ТипЗнч(ПроектИлиЗадача) = Тип("Массив") Тогда
			Для Каждого ЭлементМассива Из ПроектИлиЗадача Цикл
				ДобавитьВОчередьСинхронизацииПоручений(ЭлементМассива, Ложь);
			КонецЦикла;
		Иначе	
			ДобавитьВОчередьСинхронизацииПоручений(ПроектИлиЗадача, Ложь);
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнчМассивЗадачДляСоздания = Тип("Массив") Тогда
			Для Каждого Задача Из МассивЗадачДляСоздания Цикл
				СоздатьПорученияДляНазначенныхНаЗадачуИсполнителей(Задача);
			КонецЦикла;
		ИначеЕсли ТипЗнчМассивЗадачДляСоздания = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			СоздатьПорученияДляНазначенныхНаЗадачуИсполнителей(МассивЗадачДляСоздания);
		КонецЕсли;	
		
		АктуализироватьСтатусыСвойстваСрокиПорученийЗадач(ПроектИлиЗадача, Версия);
		
	КонецЕсли;
	
КонецПроцедуры

// Получает данные по проектной задаче.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача	 - ПЗ.
// 
// Возвращаемое значение:
//  Структура - данные по ПЗ.
//
Функция ПолучитьДанныеПоПроектнойЗадачеДляЗаполненияПоручения(ПроектнаяЗадача) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПроектнаяЗадача.Проект КАК Проект,
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ втТекущиеВерсии
	               |ИЗ
	               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |ГДЕ
	               |	упоПроектнаяЗадача.Ссылка = &ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаОкончанияПлан,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втСрокиПроектнойЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Версия В
	               |					(ВЫБРАТЬ
	               |						втТекущиеВерсии.Версия
	               |					ИЗ
	               |						втТекущиеВерсии КАК втТекущиеВерсии)) КАК упоСрокиПроектныхЗадачСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК СсылкаНаПроект,
	               |	Проекты.упоКорневойПроект КАК упоКорневойПроект,
	               |	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу
	               |ПОМЕСТИТЬ втПроект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.СсылкаНаПроектнуюЗадачу = &ПроектнаяЗадача
	               |	И НЕ Проекты.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ОписаниеРезультата КАК ОписаниеРезультата,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации КАК ВидОперации
	               |ПОМЕСТИТЬ втСвойстваПроектнойЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Версия В
	               |					(ВЫБРАТЬ
	               |						втТекущиеВерсии.Версия
	               |					ИЗ
	               |						втТекущиеВерсии КАК втТекущиеВерсии)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РуководительПроектнойЗадачи,
	               |	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втРуководительПроектнойЗадачи
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	               |ГДЕ
	               |	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача = &ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРуководителиПроектовСрезПоследних.РуководительПроекта КАК РуководительПроекта,
	               |	упоРуководителиПроектовСрезПоследних.Проект КАК Проект
	               |ПОМЕСТИТЬ втРуководителиПроектов
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних(
	               |			,
	               |			Проект В
	               |				(ВЫБРАТЬ
	               |					втТекущиеВерсии.Проект
	               |				ИЗ
	               |					втТекущиеВерсии КАК втТекущиеВерсии)) КАК упоРуководителиПроектовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втСвойстваПроектнойЗадачи.НазваниеЗадачи КАК Наименование,
	               |	втСвойстваПроектнойЗадачи.ВидОперации КАК ВидОперации,
	               |	втСвойстваПроектнойЗадачи.ОписаниеРезультата КАК ОписаниеРезультата,
	               |	втСрокиПроектнойЗадачи.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	втСрокиПроектнойЗадачи.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	втПроект.СсылкаНаПроект КАК ПроектнаяЗадача,
	               |	втПроект.упоКорневойПроект КАК Проект,
	               |	втПроект.упоКорневойПроект.ПортфельПроектов КАК ПортфельПроекта,
	               |	втСвойстваПроектнойЗадачи.ПроектнаяЗадача КАК ОбъектБазы,
	               |	ВЫБОР
	               |		КОГДА втРуководительПроектнойЗадачи.РуководительПроектнойЗадачи = ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)
	               |				ИЛИ втРуководительПроектнойЗадачи.РуководительПроектнойЗадачи ЕСТЬ NULL
	               |			ТОГДА втРуководителиПроектов.РуководительПроекта
	               |		ИНАЧЕ втРуководительПроектнойЗадачи.РуководительПроектнойЗадачи
	               |	КОНЕЦ КАК Контролер
	               |ИЗ
	               |	втСвойстваПроектнойЗадачи КАК втСвойстваПроектнойЗадачи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСрокиПроектнойЗадачи КАК втСрокиПроектнойЗадачи
	               |		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = втСрокиПроектнойЗадачи.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втПроект КАК втПроект
	               |		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = втПроект.СсылкаНаПроектнуюЗадачу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРуководительПроектнойЗадачи КАК втРуководительПроектнойЗадачи
	               |		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = втРуководительПроектнойЗадачи.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРуководителиПроектов КАК втРуководителиПроектов
	               |		ПО (ИСТИНА)";
				   
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);

	ТаблицаПроектнаяЗадача = Запрос.Выполнить().Выгрузить();
	
	ДанныеЗадачи = Новый Структура;
	
	Для Каждого Колонка Из ТаблицаПроектнаяЗадача.Колонки Цикл
		ДанныеЗадачи.Вставить(Колонка.Имя);
	КонецЦикла;
	Если ТаблицаПроектнаяЗадача.Количество() Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеЗадачи, ТаблицаПроектнаяЗадача[0]);
	КонецЕсли;
	
	Возврат ДанныеЗадачи;

КонецФункции

// Вызывает отложенную синхронизацию поручений задач.
//
Процедура упоСинхронизацияПорученийЗадач() Экспорт
	
	Если НЕ упоЗаданияСерверПовтИсп.ОтложеннаяСинхронизацияПорученийЗадач() Тогда
		Возврат;
	КонецЕсли;	
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.упоСинхронизацияПорученийЗадач);
	
	ОбработатьПорциюОчередиСинхронизацииПоручений();

КонецПроцедуры

// Создает поручение по переданной задаче.
//
// Параметры:
//  ДанныеЗадачи			 - Структура													 - данные проектной задачи, по которой создается поручение.
//  Исполнитель				 - СправочникСсылка.упоТрудовыеРесурсы							 - исполнитель.
//  ЭтоОсновноеЗадание		 - Булево														 - признак основного задания по задаче.
//  ВидЗаданияПодразделению	 - ПеречислениеСсылка.упоВидыЗаданияПодразделению, Неопределено	 - вид задания подразделению
// 
// Возвращаемое значение:
//  СправочникСсылка.упоЗадания - созданное задание.
//
Функция СоздатьПоручениеЗадачи(ДанныеЗадачи, 
	Исполнитель, 
	ЭтоОсновноеЗадание, 
	ВидЗаданияПодразделению = Неопределено) Экспорт

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДанныеПроектнойЗадачиДляСозданияПоручения", ДанныеЗадачи);
	ДанныеЗаполнения.Вставить("Исполнитель", Исполнитель);
	ДанныеЗаполнения.Вставить("ЭтоОсновноеЗадание", ЭтоОсновноеЗадание);
	ДанныеЗаполнения.Вставить("ВидЗаданияПодразделению", ВидЗаданияПодразделению);
	
	НовоеЗадание = Справочники.упоЗадания.СоздатьЭлемент();
	
	НовоеЗадание.Заполнить(ДанныеЗаполнения);
	
	НовоеЗадание.Записать();
	
	упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(НовоеЗадание.Ссылка, 
		ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выдано"), "");
	
	Если ТипЗнч(ДанныеЗадачи) = Тип("Структура") 
		И ДанныеЗадачи.Свойство("ДатаНачалаПлан") 
		И ДанныеЗадачи.Свойство("ДатаОкончанияПлан") Тогда
		
		упоЗаданияСервер.ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(НовоеЗадание.Ссылка, 
				ДанныеЗадачи.ДатаНачалаПлан, ДанныеЗадачи.ДатаОкончанияПлан)
	КонецЕсли;
	
	Возврат НовоеЗадание.Ссылка;
	
КонецФункции

#Область ЗаданияПодразделению

// Отправка заданий подразделениям фоновым заданием.
//
// Параметры:
//  Параметры				 - Структура - параметры метода отправки, см.ОтправитьЗаданияПодразделению
//  АдресХранилищаРезультата - Строка	 
//
Процедура ОтправитьЗаданияПодразделениюВФоне(Знач Параметры, АдресХранилищаРезультата = "") Экспорт
	
	Результат = ОтправитьЗаданияПодразделению(Параметры.ЗадачиРПЗ, 
		Параметры.ПредставленияЗадач, 
		Параметры.РабочийКалендарьПроекта, 
		Параметры.ВидЗаданияПодразделению);
	
	Если АдресХранилищаРезультата = "" Тогда
		АдресХранилищаРезультата = ПоместитьВоВременноеХранилище(Результат);
	Иначе
		ПоместитьВоВременноеХранилище(Результат, АдресХранилищаРезультата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОчередьОтраженияПлановыхТрудозатрат

Процедура ОбработатьПорциюОчередиСинхронизацииПоручений()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 300
	               |	упоОчередьСинхронизацииПорученийЗадач.ПроектИлиЗадача КАК ПроектИлиЗадача,
	               |	упоОчередьСинхронизацииПорученийЗадач.Создать КАК Создать
	               |ИЗ
	               |	РегистрСведений.упоОчередьСинхронизацииПорученийЗадач КАК упоОчередьСинхронизацииПорученийЗадач
	               |ГДЕ
	               |	НЕ упоОчередьСинхронизацииПорученийЗадач.Ошибка
	               |
				   |УПОРЯДОЧИТЬ ПО
				   |	упоОчередьСинхронизацииПорученийЗадач.ДатаВМиллиСекундах";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПроектИлиЗадача = Выборка.ПроектИлиЗадача;
		Попытка 
			УдалитьИзОчередиСинхронизацииПоручений(Выборка.ПроектИлиЗадача, Выборка.Создать);
			Если Выборка.Создать Тогда
				СоздатьПорученияДляНазначенныхНаЗадачуИсполнителей(Выборка.ПроектИлиЗадача);
			Иначе
				АктуализироватьСтатусыСвойстваСрокиПорученийЗадач(Выборка.ПроектИлиЗадача);
			КонецЕсли;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписатьОшибкуВОчередьСинхронизацииПоручений(Выборка.ПроектИлиЗадача, Выборка.Создать, ОписаниеОшибки);
			ВызватьИсключение ОписаниеОшибки;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВОчередьСинхронизацииПоручений(ПроектИлиЗадача, Создать = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.упоОчередьСинхронизацииПорученийЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроектИлиЗадача.Установить(ПроектИлиЗадача);
	НаборЗаписей.Отбор.Создать.Установить(Создать);
	НаборЗаписей.Прочитать();
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Не Запись.Ошибка Тогда
			Возврат
		КонецЕсли;
	КонецЦикла;
	Запись = НаборЗаписей.Добавить();	
	ЗаполнитьНовуюЗаписьВОчередиСинхронизацииПоручений(Запись, ПроектИлиЗадача, Создать);
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры 

Процедура ЗаполнитьНовуюЗаписьВОчередиСинхронизацииПоручений(Запись, ПроектИлиЗадача, Создать)
	
	Дата = ТекущаяДата();
	ДатаВМиллиСекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() + (ТекущаяДата() - ТекущаяУниверсальнаяДата());
	
	Запись.ПроектИлиЗадача = ПроектИлиЗадача;
	Запись.Создать = Создать;
	Запись.Дата = Дата;
	Запись.ДатаВМиллиСекундах = ДатаВМиллиСекундах;
	Запись.Ошибка = Ложь;
	Запись.ОписаниеОшибки = "";
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВОчередьСинхронизацииПоручений(ПроектИлиЗадача, Создать, ОписаниеОшибки) 
	
	// Привилегированный режим в методе вызова.
	
	НаборЗаписей = РегистрыСведений.упоОчередьСинхронизацииПорученийЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроектИлиЗадача.Установить(ПроектИлиЗадача);
	НаборЗаписей.Отбор.Создать.Установить(Создать);
	НаборЗаписей.Отбор.Ошибка.Установить(Истина); 
	Запись = НаборЗаписей.Добавить();	
	ЗаполнитьНовуюЗаписьВОчередиСинхронизацииПоручений(Запись, ПроектИлиЗадача, Создать);
	Запись.Ошибка = Истина;
	Запись.ОписаниеОшибки = ОписаниеОшибки;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры 

Процедура УдалитьИзОчередиСинхронизацииПоручений(ПроектИлиЗадача, Создать) 
	
	// Привилегированный режим в методе вызова.
	
	НаборЗаписей =  РегистрыСведений.упоОчередьСинхронизацииПорученийЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроектИлиЗадача.Установить(ПроектИлиЗадача);
	НаборЗаписей.Отбор.Создать.Установить(Создать);
	НаборЗаписей.Отбор.Ошибка.Установить(Ложь);
	НаборЗаписей.Записать();
	
КонецПроцедуры 

#КонецОбласти

#Область ЗаданияПодразделению

Функция БлижайшийРабочийДень(Знач ИсходнаяДата, Увеличение, Календарь)
	
	ИсходнаяДата = ИсходнаяДата + Увеличение * 84600;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	упоРабочиеКалендариСрезПоследних.День КАК День
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	               |			,
	               |			Календарь = &Календарь
	               |				И День >= &День) КАК упоРабочиеКалендариСрезПоследних
	               |ГДЕ
	               |	упоРабочиеКалендариСрезПоследних.КоличествоЧасов > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	День";
	Запрос.УстановитьПараметр("Календарь", Календарь);
	Запрос.УстановитьПараметр("День", ИсходнаяДата);
	РезультатЗапрос = Запрос.Выполнить();
	Если РезультатЗапрос.Пустой() Тогда
		Возврат ИсходнаяДата;
	Иначе
		Выборка = РезультатЗапрос.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.День;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьСвоиОтменитьЧужиеВыданныеЗадания(ЗадачаРПЗ, ЗаданияНаПланированиеПоПЗ, МассивТР)
	
	ЕстьВыданноеЗадание = Ложь;
	
	ЗаданиеНаПланированиеПоИсполнителям = ЗаданияНаПланированиеПоПЗ.Получить(ЗадачаРПЗ.Ключ);
	Если ЗаданиеНаПланированиеПоИсполнителям = Неопределено Тогда
		Возврат ЕстьВыданноеЗадание;
	КонецЕсли;
	
	Для Каждого ЗаданиеИсполнителяНаПланирование Из ЗаданиеНаПланированиеПоИсполнителям Цикл
		Если МассивТР.Найти(ЗаданиеИсполнителяНаПланирование.Ключ) = Неопределено Тогда
			упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(ЗаданиеИсполнителяНаПланирование.Значение, 
			Перечисления.упоСтатусыЗаданий.Отменено, НСтр("ru = 'Исполнитель снят с задачи.'"));
		Иначе
			ЕстьВыданноеЗадание = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьВыданноеЗадание;
	
КонецФункции

Функция ЗаданияНаПланирование(ЗадачиРПЗ)
	
	ЗаданияПоПЗ = Новый Соответствие; 
	
	МассивПЗ = Новый Массив;
	Для Каждого ЗадачаРПЗ Из ЗадачиРПЗ Цикл
		МассивПЗ.Добавить(ЗадачаРПЗ.Ключ);
	КонецЦикла; 
	
	СтатусыЗаданийНеВРаботе = Новый Массив;
	СтатусыЗаданийНеВРаботе.Добавить(Перечисления.упоСтатусыЗаданий.Отменено);
	СтатусыЗаданийНеВРаботе.Добавить(Перечисления.упоСтатусыЗаданий.Закрыто);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектныеЗадачи", МассивПЗ);
	Запрос.УстановитьПараметр("СтатусыЗаданийНеВРаботе", СтатусыЗаданийНеВРаботе);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоЗадания.Ссылка КАК Задание,
	|	упоЗадания.Исполнитель КАК Исполнитель,
	|	упоЗадания.ОбъектБазы КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ втЗаданияПоПЗ
	|ИЗ
	|	Справочник.упоЗадания КАК упоЗадания
	|ГДЕ
	|	упоЗадания.ОбъектБазы В(&ПроектныеЗадачи)
	|	И упоЗадания.ЭтоЗаданиеПодразделению
	|	И НЕ упоЗадания.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Задание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втЗаданияПоПЗ.Задание КАК Задание,
	|	втЗаданияПоПЗ.Исполнитель КАК Исполнитель,
	|	втЗаданияПоПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
	|			,
	|			Задание В
	|				(ВЫБРАТЬ
	|					втЗаданияПоПЗ.Задание КАК Задание
	|				ИЗ
	|					втЗаданияПоПЗ КАК втЗаданияПоПЗ)) КАК упоЗаданияСтатусыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗаданияПоПЗ КАК втЗаданияПоПЗ
	|		ПО упоЗаданияСтатусыСрезПоследних.Задание = втЗаданияПоПЗ.Задание
	|			И (НЕ упоЗаданияСтатусыСрезПоследних.Статус В (&СтатусыЗаданийНеВРаботе))";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗаданияПоПЗ.Получить(Выборка.ПроектнаяЗадача) = Неопределено Тогда
				ЗаданияПоПЗ.Вставить(Выборка.ПроектнаяЗадача, Новый Соответствие);
			КонецЕсли;
			ЗаданияПоПЗ[Выборка.ПроектнаяЗадача].Вставить(Выборка.Исполнитель, Выборка.Задание);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЗаданияПоПЗ;
	
КонецФункции

Функция ТекстЗаданияНаПланирование(ВидЗаданияПодразделению)
	
	Если ВидЗаданияПодразделению = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидыЗаданияПодразделению.НаПланирование") Тогда
		ТекстЗадания = НСтр("ru = 'Необходимо произвести планирование этапа:
		|- Декомпозировать по работам с указанием плановых сроков.
		|- Распределить трудозатраты подразделения по работам на окончательном уровне планирования.
		|На предварительном уровне планирования указан первоначальный план трудозатрат подразделения.'");
	Иначе
		ТекстЗадания = НСтр("ru = 'Необходимо провести актуализацию работы:
		|- Указать фактические трудозатраты подразделения.
		|- Актуализировать плановую загрузку ролей и исполнителей подразделения по фактическим данным.'");
	КонецЕсли;
	
	Возврат ТекстЗадания;
	
КонецФункции

Функция ТрудовыеРесурсыРПЗ(ЗадачиРПЗ)
	
	МассивСотрудников = Новый Массив;
	Для Каждого ЗадачаРПЗ Из ЗадачиРПЗ Цикл
		МассивСотрудников.Добавить(ЗадачаРПЗ.Значение);
	КонецЦикла;
	
	ТРСотрудников = упоЗаданияСервер.ТрудовыеРесурсыСотрудников(МассивСотрудников);
	
	Возврат ТРСотрудников;
	
КонецФункции

Функция ОтправитьЗаданияПодразделению(ЗадачиРПЗ, ПредставленияЗадач, РабочийКалендарьПроекта, ВидЗаданияПодразделению)
	
	РезультатВыполнения = Новый Структура("ЕстьНовыеЗадания, ОшибкиПользователю",
		Ложь, Неопределено);
	
	ДатаНачалаПрогноз = ТекущаяДатаСеанса();
	ДатаОкончанияПрогноз = БлижайшийРабочийДень(ДатаНачалаПрогноз, 29, РабочийКалендарьПроекта);
	
	ЗаданияНаПланированиеПоПЗ = ЗаданияНаПланирование(ЗадачиРПЗ);
	ТрудовыеРесурсыСотрудников = ТрудовыеРесурсыРПЗ(ЗадачиРПЗ);
	
	ШаблонСообщения1 = НСтр("ru = '- Задача %1: для сотрудника %2 не назначены трудовые ресурсы. Задание %3 не выдано.'");
	ШаблонСообщения2 = НСтр("ru = '- Задача %1: для сотрудника %2 назначено более одного трудового ресурса. 
		|	Задание %3 выдано на трудовой ресурс %4.'");
	ТекстЗамены = ?(ВидЗаданияПодразделению = Перечисления.упоВидыЗаданияПодразделению.НаПланирование, 
		НСтр("ru = 'на планирование'"), НСтр("ru = 'на прогноз'"));
	ТекстЗадания = ТекстЗаданияНаПланирование(ВидЗаданияПодразделению);
	
	НачатьТранзакцию();
	
	Для Каждого ЗадачаРПЗ Из ЗадачиРПЗ Цикл
		
		МассивТР = ТрудовыеРесурсыСотрудников.Получить(ЗадачаРПЗ.Значение);
		ПредставлениеЗадачи = ПредставленияЗадач.Получить(ЗадачаРПЗ.Ключ);
		Если Не ЗначениеЗаполнено(МассивТР) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения1,
				ПредставлениеЗадачи, ЗадачаРПЗ.Значение, ТекстЗамены);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(РезультатВыполнения.ОшибкиПользователю, 
				"", ТекстСообщения);
			Продолжить; // Продолжить
		КонецЕсли;
		
		// Отмена заданий, выданных другим исполнителям по этой ПЗ.
		ЕстьВыданноеЗадание = ПроверитьСвоиОтменитьЧужиеВыданныеЗадания(ЗадачаРПЗ, ЗаданияНаПланированиеПоПЗ, МассивТР);
		Если ЕстьВыданноеЗадание Тогда
			Продолжить;
		КонецЕсли;
		
		// Назначение новых заданий.
		Если МассивТР.Количество() > 1 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения2,
				ПредставлениеЗадачи, ЗадачаРПЗ.Значение, ТекстЗамены, МассивТР[0]);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(РезультатВыполнения.ОшибкиПользователю, 
				"", ТекстСообщения);
		КонецЕсли;
		
		ДанныеЗадачи = упоЗадания.ПолучитьДанныеПоПроектнойЗадачеДляЗаполненияПоручения(ЗадачаРПЗ.Ключ);
		ДанныеЗадачи.Вставить("ДатаНачалаПрогноз", ДатаНачалаПрогноз);
		ДанныеЗадачи.Вставить("ДатаНачалаПлан", ДатаНачалаПрогноз);
		ДанныеЗадачи.Вставить("ДатаОкончанияПлан", ДатаОкончанияПрогноз);
		ДанныеЗадачи.Вставить("ЭтоЗаданиеИсполнителяПроектнойЗадачи", Ложь);
		ДанныеЗадачи.Вставить("ОписаниеЗадания", ТекстЗадания);
		ДанныеЗадачи.Контролер = ПараметрыСеанса.упоТекущийСотрудник;
		упоЗадания.СоздатьПоручениеЗадачи(ДанныеЗадачи, МассивТР[0], Ложь, ВидЗаданияПодразделению);
		
		РезультатВыполнения.ЕстьНовыеЗадания = Истина;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат РезультатВыполнения;
	
Конецфункции

#КонецОбласти

// Получает проектные задачи по проекту для которых необходимо создать поручения
Функция ПолучитьМассивЗадачДляСозданияПоручений(Проект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ вт_ВерсияПроекта
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Проект = &Проект
	               |	И упоВерсииПроекта.Текущая
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |			,
	               |			Версия В
	               |				(ВЫБРАТЬ
	               |					вт_ВерсияПроекта.Версия КАК Версия
	               |				ИЗ
	               |					вт_ВерсияПроекта КАК вт_ВерсияПроекта)) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
	КонецЕсли;	
	
КонецФункции	

// Создает задания для исполнителей проектной задачи при проведении документа
// "Назначение трудовых ресурсов на проектную задачу".
//
// Параметры:
//  ДанныеДокумента - Структура - Ключи:
//   * ДокументНазначение	 - ДокументСсылка.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу.
//   * Проект	 - СправочникСсылка.Проекты.
//   * ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача.
//
Процедура СоздатьПорученияДляНазначенныхНаЗадачуИсполнителей(ПроектнаяЗадача) 
	
	Если Не ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	СоздаватьЗаданияПриНазначенииРесурсов = 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект.СоздаватьЗаданияПриНазначенииРесурсов");
	
	Если Не СоздаватьЗаданияПриНазначенииРесурсов Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача));
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗадания.Ссылка КАК Задание,
	               |	упоЗадания.Исполнитель КАК Исполнитель,
	               |	упоЗадания.ЭтоОсновноеЗаданиеПроектнойЗадачи КАК ЭтоОсновноеЗаданиеПроектнойЗадачи,
	               |	упоЗадания.ЭтоЗаданиеИсполнителяПроектнойЗадачи
	               |		ИЛИ упоЗадания.ЗавершеноЗакрытоВручную КАК ЭтоЗаданиеИсполнителяПроектнойЗадачиИлиЗавершеноЗакрытоВручную
	               |ПОМЕСТИТЬ втПорученияИсполнителей
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания
	               |ГДЕ
	               |	НЕ упоЗадания.ПометкаУдаления
	               |	И упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу = &ПроектнаяЗадача
	               |	И упоЗадания.ВидЗадания = ЗНАЧЕНИЕ(Справочник.упоВидыЗаданий.Поручение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втПорученияИсполнителей.Исполнитель КАК Исполнитель,
	               |	втПорученияИсполнителей.ЭтоОсновноеЗаданиеПроектнойЗадачи КАК ЭтоОсновноеЗаданиеПроектнойЗадачи,
	               |	втПорученияИсполнителей.ЭтоЗаданиеИсполнителяПроектнойЗадачиИлиЗавершеноЗакрытоВручную КАК ЭтоЗаданиеИсполнителяПроектнойЗадачиИлиЗавершеноЗакрытоВручную
	               |ПОМЕСТИТЬ втСуществующиеЗаданияИсполнителей
	               |ИЗ
	               |	втПорученияИсполнителей КАК втПорученияИсполнителей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
	               |				,
	               |				Задание В
	               |					(ВЫБРАТЬ
	               |						Т.Задание КАК Задание
	               |					ИЗ
	               |						втПорученияИсполнителей КАК Т)) КАК упоЗаданияСтатусыСрезПоследних
	               |		ПО втПорученияИсполнителей.Задание = упоЗаданияСтатусыСрезПоследних.Задание
	               |			И (НЕ упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Отменено))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	втСуществующиеЗаданияИсполнителей.ЭтоОсновноеЗаданиеПроектнойЗадачи КАК ЭтоОсновноеЗаданиеПроектнойЗадачи
	               |ИЗ
	               |	втПорученияИсполнителей КАК втСуществующиеЗаданияИсполнителей
	               |ГДЕ
	               |	втСуществующиеЗаданияИсполнителей.ЭтоОсновноеЗаданиеПроектнойЗадачи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВыделенныеТрудовыеРесурсы.Ресурс КАК Ресурс
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |			,
	               |			Версия = &ТекВерсия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоВыделенныеТрудовыеРесурсы
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсы.РесурсВыделен
	               |	И НЕ упоВыделенныеТрудовыеРесурсы.Ресурс В
	               |				(ВЫБРАТЬ
	               |					втСуществующиеЗаданияИсполнителей.Исполнитель
	               |				ИЗ
	               |					втСуществующиеЗаданияИсполнителей КАК втСуществующиеЗаданияИсполнителей
	               |				ГДЕ
	               |					втСуществующиеЗаданияИсполнителей.ЭтоЗаданиеИсполнителяПроектнойЗадачиИлиЗавершеноЗакрытоВручную)";
	
	Результат = Запрос.ВыполнитьПакет();
	ИндексПоследнего = Результат.ВГраница();
	
	УжеСуществуетОсновноеЗадание = Не Результат[ИндексПоследнего - 1].Пустой();
	
	ВыборкаИсполнители = Результат[ИндексПоследнего].Выбрать();

	ДанныеЗадачи = ПолучитьДанныеПоПроектнойЗадачеДляЗаполненияПоручения(ПроектнаяЗадача);
	
	ЭтоОсновное = Неопределено;
	
	Пока ВыборкаИсполнители.Следующий() Цикл
		
		Если ЭтоОсновное = Неопределено Тогда
			ЭтоОсновное = Не УжеСуществуетОсновноеЗадание;
		КонецЕсли;
		
		НовоеЗадание = СоздатьПоручениеЗадачи(ДанныеЗадачи, ВыборкаИсполнители.Ресурс, ЭтоОсновное);
		упоЗаданияСервер.ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(НовоеЗадание, 
			ДанныеЗадачи.ДатаНачалаПлан, 
			ДанныеЗадачи.ДатаОкончанияПлан);
		
		ЭтоОсновное = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

// Актуализирует статусы, свойства и сроки поручений задач.
//
// Параметры:
//  ПроектИлиЗадача	 - СправочникСсылка.Проект, ДокументСсылка.упоПроектнаяЗадача,
//  	Массив Из ДокументСсылка.упоПроектнаяЗадача - задачи для актуализации поручений.
//
Процедура АктуализироватьСтатусыСвойстваСрокиПорученийЗадач(ПроектИлиЗадача, Знач Версия = Неопределено)
	
	Если Не ЗначениеЗаполнено(ПроектИлиЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЗадания", Справочники.упоВидыЗаданий.Поручение);
	
	МассивТекстов = Новый Массив;
	
	ТипПараметра = ТипЗнч(ПроектИлиЗадача);
	
	Если ТипПараметра = Тип("СправочникСсылка.Проекты") Тогда
		
		Если Версия = Неопределено Тогда
			Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектИлиЗадача);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Проект", ПроектИлиЗадача);
		Запрос.УстановитьПараметр("ТекВерсия", Версия);
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоПроектнаяЗадача.Ссылка КАК ПроектнаяЗадача
		               |ПОМЕСТИТЬ втПроектныеЗадачи
		               |ИЗ
		               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		               |ГДЕ
		               |	упоПроектнаяЗадача.Проект = &Проект
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ПроектнаяЗадача";
		
		МассивТекстов.Добавить(ТекстЗапроса);
		
		ТекстОтбораПоПроектнойЗадаче = "В
	               |				(ВЫБРАТЬ
	               |					втПроектныеЗадачи.ПроектнаяЗадача
	               |				ИЗ
	               |					втПроектныеЗадачи КАК втПроектныеЗадачи)";
		ТекстОтбораПоВерсии = "Версия = &ТекВерсия";
	
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Если Версия = Неопределено Тогда
			Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектИлиЗадача);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектИлиЗадача);
		Запрос.УстановитьПараметр("ТекВерсия", Версия);
		
		ТекстОтбораПоПроектнойЗадаче = "= &ПроектнаяЗадача";
		ТекстОтбораПоВерсии = "Версия = &ТекВерсия";
		
	Иначе
		
		ЭтоМассивПЗ = ТипПараметра = Тип("Массив") 
			И ТипЗнч(ПроектИлиЗадача[0]) = Тип("ДокументСсылка.упоПроектнаяЗадача");
			
		Если ЭтоМассивПЗ Тогда
			
			Запрос.УстановитьПараметр("МассивЗадач", ПроектИлиЗадача);
			
			ТекстОтбораПоПроектнойЗадаче = "В (&МассивЗадач)";
			ТекстОтбораПоВерсии = "ИСТИНА";
			
		Иначе
			
			Возврат; // Возврат
			
		КонецЕсли;
		
	КонецЕсли;

	ОсновнойТекстЗапроса = ТекстЗапроса_АктуализацияПоручений(ТекстОтбораПоВерсии, ТекстОтбораПоПроектнойЗадаче);
	
	МассивТекстов.Добавить(ОсновнойТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(МассивТекстов, ";");
	
	//
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИндексПоследнего = Результат.ВГраница();
	
	ОбновитьСвойстваСтатусыПоручений(Результат[ИндексПоследнего - 1]);
	
	ОбновитьСрокиПоручений(Результат[ИндексПоследнего]);
	
КонецПроцедуры

Функция ТекстЗапроса_АктуализацияПоручений(ТекстОтбораПоВерсии, ТекстОтбораПоПроектнойЗадаче)

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
                   |    упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
                   |    упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена КАК ЗадачаОтменена
                   |ПОМЕСТИТЬ втСвойстваЗадач
                   |ИЗ
                   |    РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
                   |            ,
                   |            &УсловиеПоВерсии
                   |                И ПроектнаяЗадача = &УсловиеПоЗадаче) КАК упоСвойстваПроектныхЗадачСрезПоследних
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
                   |        ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
                   |            И (упоВерсииПроекта.Текущая)
                   |
                   |ИНДЕКСИРОВАТЬ ПО
                   |    Версия,
                   |    ПроектнаяЗадача
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс КАК Ресурс,
                   |    упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
                   |ПОМЕСТИТЬ ВыделенныеРесурсы
                   |ИЗ
                   |    РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(, &УсловиеПоВерсии) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСвойстваЗадач КАК втСвойстваЗадач
                   |        ПО упоВыделенныеТрудовыеРесурсыСрезПоследних.Версия = втСвойстваЗадач.Версия
                   |            И упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача = втСвойстваЗадач.ПроектнаяЗадача
                   |            И (упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен)
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи
                   |ПОМЕСТИТЬ втСтатусыЗадач
                   |ИЗ
                   |    РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, &УсловиеПоВерсии) КАК упоСтатусыПроектныхЗадачСрезПоследних
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСвойстваЗадач КАК втСвойстваЗадач
                   |        ПО упоСтатусыПроектныхЗадачСрезПоследних.Версия = втСвойстваЗадач.Версия
                   |            И упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача = втСвойстваЗадач.ПроектнаяЗадача
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    НАЧАЛОПЕРИОДА(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан, ДЕНЬ) КАК ДатаНачалаПлан,
                   |    НАЧАЛОПЕРИОДА(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан, ДЕНЬ) КАК ДатаЗавершенияПлан
                   |ПОМЕСТИТЬ втСрокиПроектныхЗадач
                   |ИЗ
                   |    РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, &УсловиеПоВерсии) КАК упоСрокиПроектныхЗадачСрезПоследних
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСвойстваЗадач КАК втСвойстваЗадач
                   |        ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = втСвойстваЗадач.Версия
                   |            И упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = втСвойстваЗадач.ПроектнаяЗадача
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоЗадания.Ссылка КАК Ссылка,
                   |    упоЗадания.Наименование КАК Наименование,
                   |    упоЗадания.Проект КАК Проект,
                   |    упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадачаЗадания,
                   |    упоЗадания.Исполнитель КАК Исполнитель,
                   |    упоЗадания.ОбъектБазы КАК ОбъектБазы,
                   |    упоЗадания.ПроектнаяЗадача.упоКорневойПроект КАК ПроектЗадачи
                   |ПОМЕСТИТЬ втЗадания
                   |ИЗ
                   |    Справочник.упоЗадания КАК упоЗадания
                   |ГДЕ
                   |    НЕ упоЗадания.ПометкаУдаления
                   |    И упоЗадания.ВидЗадания = &ВидЗадания
                   |    И упоЗадания.ЭтоЗаданиеИсполнителяПроектнойЗадачи
                   |    И упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу = &УсловиеПоЗадаче
                   |
                   |ИНДЕКСИРОВАТЬ ПО
                   |    ПроектнаяЗадачаЗадания
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    втЗадания.Ссылка КАК Ссылка,
                   |    упоЗаданияСтатусыСрезПоследних.Статус КАК СтатусЗадания,
                   |    втЗадания.ПроектЗадачи КАК ПроектЗадачи,
                   |    втСтатусыЗадач.СтатусЗадачи КАК СтатусЗадачи,
                   |    ВыделенныеРесурсы.ПроектнаяЗадача ЕСТЬ NULL КАК РесурсСнят,
                   |    втЗадания.Наименование КАК НаименованиеЗадания,
                   |    втЗадания.Проект КАК ПроектЗадания,
                   |    втЗадания.ОбъектБазы КАК ОбъектБазы,
                   |    ЕСТЬNULL(втСвойстваЗадач.НазваниеЗадачи, """") КАК НаименованиеЗадачи,
                   |    ЕСТЬNULL(втСвойстваЗадач.ЗадачаОтменена, ИСТИНА) КАК ЗадачаОтменена
                   |ИЗ
                   |    втЗадания КАК втЗадания
                   |        ЛЕВОЕ СОЕДИНЕНИЕ ВыделенныеРесурсы КАК ВыделенныеРесурсы
                   |        ПО втЗадания.ПроектнаяЗадачаЗадания = ВыделенныеРесурсы.ПроектнаяЗадача
                   |            И втЗадания.Исполнитель = ВыделенныеРесурсы.Ресурс
                   |        ЛЕВОЕ СОЕДИНЕНИЕ втСтатусыЗадач КАК втСтатусыЗадач
                   |        ПО втЗадания.ПроектнаяЗадачаЗадания = втСтатусыЗадач.ПроектнаяЗадача
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
                   |        ПО втЗадания.Ссылка = упоЗаданияСтатусыСрезПоследних.Задание
                   |        ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваЗадач КАК втСвойстваЗадач
                   |        ПО втЗадания.ПроектнаяЗадачаЗадания = втСвойстваЗадач.ПроектнаяЗадача
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    ВложенныйЗапрос.Задание КАК Задание,
                   |    ВложенныйЗапрос.ДатаНачалаПлан КАК ДатаНачалаПлан,
                   |    ВложенныйЗапрос.ДатаОкончанияПлан КАК ДатаОкончанияПлан
                   |ИЗ
                   |    (ВЫБРАТЬ
                   |        втЗадания.Ссылка КАК Задание,
                   |        втСрокиПроектныхЗадач.ДатаНачалаПлан КАК ДатаНачалаПлан,
                   |        втСрокиПроектныхЗадач.ДатаЗавершенияПлан КАК ДатаОкончанияПлан,
                   |        НЕ упоСрокиЗаданий.ДатаНачалаПлан = втСрокиПроектныхЗадач.ДатаНачалаПлан КАК ДатаНачалаИзменена,
                   |        НЕ упоСрокиЗаданий.ДатаОкончанияПлан = втСрокиПроектныхЗадач.ДатаЗавершенияПлан КАК ДатаЗавершенияИзменена
                   |    ИЗ
                   |        втЗадания КАК втЗадания
                   |            ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСрокиПроектныхЗадач КАК втСрокиПроектныхЗадач
                   |            ПО втЗадания.ПроектнаяЗадачаЗадания = втСрокиПроектныхЗадач.ПроектнаяЗадача
                   |            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
                   |            ПО втЗадания.Ссылка = упоСрокиЗаданий.Задание) КАК ВложенныйЗапрос
                   |ГДЕ
                   |    (ВложенныйЗапрос.ДатаНачалаИзменена
                   |            ИЛИ ВложенныйЗапрос.ДатаЗавершенияИзменена)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "= &УсловиеПоЗадаче", ТекстОтбораПоПроектнойЗадаче);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоВерсии", ТекстОтбораПоВерсии);
	
	Возврат ТекстЗапроса;

КонецФункции // ()

Процедура ОбновитьСвойстваСтатусыПоручений(РезультатЗапроса)

	Если РезультатЗапроса.Пустой() Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	СтатусЗадания_Отменено = Перечисления.упоСтатусыЗаданий.Отменено;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектЗадание = Неопределено;
		ЭтоЗаданиеПроектнойПродукции = упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Выборка.ОбъектБазы);
		Если ЗначениеЗаполнено(Выборка.НаименованиеЗадачи) 
			И Выборка.НаименованиеЗадания <> Выборка.НаименованиеЗадачи И Не ЭтоЗаданиеПроектнойПродукции Тогда
			ОбъектЗадание = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектЗадание.Наименование = Выборка.НаименованиеЗадачи;
		КонецЕсли;
		Если Выборка.ПроектЗадания <> Выборка.ПроектЗадачи Тогда
			Если ОбъектЗадание = Неопределено Тогда
				ОбъектЗадание = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			ОбъектЗадание.Проект = Выборка.ПроектЗадачи;
		КонецЕсли;
		Если ОбъектЗадание <> Неопределено Тогда
			ОбъектЗадание.ОбменДанными.Загрузка = Истина;
			ОбъектЗадание.Записать();
		КонецЕсли;
		
		Если Выборка.РесурсСнят И Не ЭтоЗаданиеПроектнойПродукции Тогда
			
			Если Не Выборка.СтатусЗадания = СтатусЗадания_Отменено Тогда
				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
					СтатусЗадания_Отменено, 
					НСтр("ru = 'Исполнитель снят с задачи.'"));
			КонецЕсли;
				
		Иначе
			
			Если Выборка.СтатусЗадания = СтатусЗадания_Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗадачаЗавершенаЗакрыта = 
				Выборка.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Завершена 
					Или Выборка.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта;
			
			Если Выборка.ЗадачаОтменена Тогда
				
				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
					СтатусЗадания_Отменено, 
					НСтр("ru = 'Задача отменена.'"));
					
			ИначеЕсли ЗадачаЗавершенаЗакрыта
				И Не Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Закрыто Тогда
				
				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
					Перечисления.упоСтатусыЗаданий.Закрыто, 
					НСтр("ru = 'Задача завершена.'"));
					
			ИначеЕсли ЗначениеЗаполнено(Выборка.СтатусЗадачи) 
				И Не ЗадачаЗавершенаЗакрыта
				И Не (Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Выдано
					Или Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Уточняется
					Или Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Выполняется) Тогда
					
				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
					Перечисления.упоСтатусыЗаданий.Выдано, 
					НСтр("ru = 'Выполнение задачи продолжается.'"));
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСрокиПоручений(РезультатЗапроса)
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		упоЗаданияСервер.ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(Выборка.Задание, 
			Выборка.ДатаНачалаПлан, 
			Выборка.ДатаОкончанияПлан);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
