
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ПроцедурыФункцииПроверкиДанных

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки.
		СтруктураОбязательныхПолей.Вставить("ДатаАктуализации");
		СтруктураОбязательныхПолей.Вставить("Проект");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры: 
//	ДанныеДокумента - Произвольный - данные дкоумента.
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФункцииПечати

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФункцииПроведения

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать.
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСрокиПроектныхЗадач.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоПроцентыГотовностиПроектныхЗадач.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоПроцентыГотовностиПроектов.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСтатусыПроектныхЗадач.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоРасчетныеСрокиПроектныхЗадач.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДвиженийДенежныхСредств.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДоходовИРасходов.Метаданные().Имя, Правила);	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДоходовИРасходовПодразделения.Метаданные().Имя, Правила);	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыВыполненияОбъемов.Метаданные().Имя, Правила);
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСвойстваПроектов.Метаданные().Имя, Правила);	
	
	Возврат ПравилаНаложения; 

КонецФункции
 
// Получает подготовленные данные для движений по регистрам
//  и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//  Префикс      - Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования - ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Основание    - Произвольный 	- значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда
		Проект = ПараметрыСеанса.упоТекущийПроект;
		Возврат;
	КонецЕсли;
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = Основание;
		упоПроектыИЗадачиСервер.ПроверитьТипПроекта(Проект);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоФункцииЗащитыСервер.МожноИспользоватьОбъектИспользующийЗащищенныйКод(, Отказ);
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево 			- признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   	- ДокументОбъект - содержит сам объект.
//  Отказ       	- Булево - признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	Параметры = Новый Структура;
	
	ДанныеДокумента = упоПроведениеДокументовВызовСервера.обПолучитьДанныеДокумента(Ссылка);
	
	текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ДанныеДокумента.Проект);
	
	СтруктураНастроекПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ДанныеДокумента.Проект);
	
	Параметры.Вставить("ТекущаяВерсия"                       , текущаяВерсия);
	Параметры.Вставить("Проект"                              , ДанныеДокумента.Проект);
	Параметры.Вставить("УчитыватьТрудозатратыПриРасчетеГотовности", ДанныеДокумента.УчитыватьТрудозатратыПриРасчетеГотовности);
	Параметры.Вставить("НастройкаУровняПланированияПриРасчетеГотовностиПроектов", СтруктураНастроекПроекта.НастройкаУровняПланированияПриРасчетеГотовностиПроектов);
	
	Результат = упоАктуализацияПроектаВызовСервера.обАктуализацияГотовностиПроектныхЗадач(Параметры);
	
	ТаблицаДвиженияГотПЗ   			= Движения.упоПроцентыГотовностиПроектныхЗадач;
	ТаблицаДвиженияСтатПЗ  			= Движения.упоСтатусыПроектныхЗадач;
	
	Для Каждого ТекЗадача Из Результат.ДанныеЗадач Цикл
		
		Движение = ТаблицаДвиженияГотПЗ.Добавить();
		Движение.Период            = ДанныеДокумента.Дата;
		Движение.Версия = ТекущаяВерсия;
		Движение.ПроектнаяЗадача   = ТекЗадача.Задача;
		Движение.ПроцентГотовности = ТекЗадача.Готовность;
		
		Движение = ТаблицаДвиженияСтатПЗ.Добавить();
		Движение.Период            = ДанныеДокумента.Дата;
		Движение.Версия = ТекущаяВерсия;
		Движение.ПроектнаяЗадача   = ТекЗадача.Задача;
		Движение.СтатусЗадачи      = ТекЗадача.Статус;
		
	КонецЦикла;
	
	Движение = Движения.упоПроцентыГотовностиПроектов.Добавить();
	Движение.Период            	= ДанныеДокумента.Дата;
	Движение.Версия 			= ТекущаяВерсия;
	Движение.Проект   			= ДанныеДокумента.Проект;
	Движение.ПроцентГотовности	= Результат.ГотовностьПроекта;
	
	упоЗакрытиеЭтапа.УдалитьИзДвиженийСтатусовИПроцентовЗакрытыеЗадачи(ЭтотОбъект);
		
	Движения.Записать();
	
	Если ПровестиРасчетКалендарногоПлана Тогда
		ТекстОшибкиРасчетКалендарногоПлана = "";
		упоПроектыИЗадачиСервер.ПровестиРасчетКалендарногоПланаПроекта(Проект, ТекстОшибкиРасчетКалендарногоПлана);	
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект  	- содержит сам объект.
//  Отказ        - Булево			- признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли