
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дерево = упоПечатьШаблоновСерверПовтИсп.ЗаполнитьДеревоРеквизитовДляВыбора();	
	ЗначениеВРеквизитФормы(Дерево, "ОбъектДеревоРеквизитов");	
	Параметры.Свойство("ЗначениеРеквизита", ЗначениеРеквизита);
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		Элементы.ДеревоРеквизитов.ТекущаяСтрока = ПолучитьСтрокуПоПолномуИмени(ЗначениеРеквизита);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработатьВыборЭлемента(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Тип) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДерева = ОбъектДеревоРеквизитов.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	Если ЭлементДерева <> Неопределено Тогда
		ОповеститьОВыборе(Элемент.ТекущиеДанные);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоРеквизитов

&НаКлиенте
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборЭлемента(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборЭлемента(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСтрокуПоПолномуИмени(ПолноеИмя, ЭлементыДерева = Неопределено)
	Если ЭлементыДерева = Неопределено Тогда
		ЭлементыДерева = ОбъектДеревоРеквизитов.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого Элемент Из ЭлементыДерева Цикл
		Если Элемент.ПолноеИмя = ПолноеИмя Тогда
			Возврат Элемент.ПолучитьИдентификатор();
		КонецЕсли;
		Если Элемент.ПолучитьЭлементы().Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ИД = ПолучитьСтрокуПоПолномуИмени(ПолноеИмя, Элемент.ПолучитьЭлементы());
		Если ЗначениеЗаполнено(ИД) Тогда
			Возврат ИД;
		КонецЕсли;
	КонецЦикла;	

КонецФункции

#КонецОбласти
