////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры для получения настроек учета по подразделениям.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует текст запроса для получения настроек учета по подразделениям для портфеля проектов.
// 
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаДляПортфеля() Экспорт
	
	Текст ="ВЫБРАТЬ
	       |	&ДоходыПоНатуральнымПоказателям КАК ДоходыПоНатуральнымПоказателям,
	       |	&ДоходыПоОбъемам КАК ДоходыПоОбъемам,
	       |	&ДоходыПоПодразделениям КАК ДоходыПоПодразделениям,
	       |	&РасходыПоНатуральнымПоказателям КАК РасходыПоНатуральнымПоказателям,
	       |	&РасходыПоОбъемам КАК РасходыПоОбъемам,
	       |	&РасходыПоПодразделениям КАК РасходыПоПодразделениям,
	       |	&ВедетсяБюджетДоходов КАК ВедетсяБюджетДоходов,
	       |	&ВедетсяБюджетРасходов КАК ВедетсяБюджетРасходов,
	       |	&ПланироватьТрудозатратыПоРолям КАК ПланироватьТрудозатратыПоРолям,
	       |	&ВыделятьНаВыполнениеРаботРесурсы КАК ВыделятьНаВыполнениеРаботРесурсы,
	       |	&ПланироватьЗатратыНаМатериалы КАК ПланироватьЗатратыНаМатериалы,
	       |	&ПланироватьДополнительныеЗатратыПоЗадаче КАК ПланироватьДополнительныеЗатратыПоЗадаче,
	       |	&ИспользоватьАналитикуКонтрагентДляСС КАК ИспользоватьАналитикуКонтрагентДляСС,
	       |	&ПланироватьТрудозатратыПоПроекту КАК ПланироватьТрудозатратыПоПроекту,
		   |	&УказыватьПодразделениеРолиПриПланированииТР КАК УказыватьПодразделениеРолиПриПланированииТР,
	       |	&РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи КАК РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи,
	       |	&ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF КАК ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF,
	       |	&ВедетсяБюджетДвиженияДенежныхСредств КАК ВедетсяБюджетДвиженияДенежныхСредств,
	       |	&РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен,
		   |	&РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден,
		   |	&НастройкаПоказателейДляКарточкиПроектов КАК НастройкаПоказателейДляКарточкиПроектов,
	       |	&НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
	       |	&ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
	       |	&НастройкаДереваКлючевыхПоказателей КАК НастройкаДереваКлючевыхПоказателей,
	       |	&ЗапретитьРПЗИзменятьСрокиЧужихЗадач КАК ЗапретитьРПЗИзменятьСрокиЧужихЗадач,
	       |	&НастройкаУровняПланированияПриРасчетеГотовностиПроектов КАК НастройкаУровняПланированияПриРасчетеГотовностиПроектов,
	       |	&УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат КАК УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат,
	       |	&НаследоватьЗначениеПоляОбъектИзЗадачиРодителя КАК НаследоватьЗначениеПоляОбъектИзЗадачиРодителя,
		   |	&НастройкаРаспределенияБДР КАК НастройкаРаспределенияБДР,
		   |	&НазначатьРСПОсновнойРолиКакРПЗ КАК НазначатьРСПОсновнойРолиКакРПЗ,
		   |	&УстанавливатьПризнакОсновнаяПриДобавленииРоли КАК УстанавливатьПризнакОсновнаяПриДобавленииРоли,
		   |	&ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки КАК ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки,
           |    &РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам КАК РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам 
	       |ПОМЕСТИТЬ ВТ_Константы
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	       |	упоПортфелиПроектов.Ссылка КАК Объект,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоПодразделениям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ДоходыПоПодразделениям
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоПодразделениям
	       |	КОНЕЦ КАК ДоходыПоПодразделениям,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоОбъемам ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ДоходыПоОбъемам
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоОбъемам
	       |	КОНЕЦ КАК ДоходыПоОбъемам,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ДоходыПоНатуральнымПоказателям
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоНатуральнымПоказателям
	       |	КОНЕЦ КАК ДоходыПоНатуральнымПоказателям,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоПодразделениям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РасходыПоПодразделениям
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоПодразделениям
	       |	КОНЕЦ КАК РасходыПоПодразделениям,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоОбъемам ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РасходыПоОбъемам
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоОбъемам
	       |	КОНЕЦ КАК РасходыПоОбъемам,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РасходыПоНатуральнымПоказателям
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоНатуральнымПоказателям
	       |	КОНЕЦ КАК РасходыПоНатуральнымПоказателям,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.Объект ЕСТЬ NULL
	       |			ТОГДА ИСТИНА
	       |		ИНАЧЕ ЛОЖЬ
	       |	КОНЕЦ КАК ИсточникКонстанта,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетДоходов ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВедетсяБюджетДоходов
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетДоходов
	       |	КОНЕЦ КАК ВедетсяБюджетДоходов,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетРасходов ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВедетсяБюджетРасходов
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетРасходов
	       |	КОНЕЦ КАК ВедетсяБюджетРасходов,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьТрудозатратыПоРолям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьТрудозатратыПоРолям
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьТрудозатратыПоРолям
	       |	КОНЕЦ КАК ПланироватьТрудозатратыПоРолям,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ВыделятьНаВыполнениеРаботРесурсы ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВыделятьНаВыполнениеРаботРесурсы
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ВыделятьНаВыполнениеРаботРесурсы
	       |	КОНЕЦ КАК ВыделятьНаВыполнениеРаботРесурсы,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьТрудозатратыПоПроекту ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьТрудозатратыПоПроекту
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьТрудозатратыПоПроекту
	       |	КОНЕЦ КАК ПланироватьТрудозатратыПоПроекту,
		   |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.УказыватьПодразделениеРолиПриПланированииТР ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.УказыватьПодразделениеРолиПриПланированииТР
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.УказыватьПодразделениеРолиПриПланированииТР
	       |	КОНЕЦ КАК УказыватьПодразделениеРолиПриПланированииТР,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьЗатратыНаМатериалы ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьЗатратыНаМатериалы
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьЗатратыНаМатериалы
	       |	КОНЕЦ КАК ПланироватьЗатратыНаМатериалы,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьДополнительныеЗатратыПоЗадаче ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьДополнительныеЗатратыПоЗадаче
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьДополнительныеЗатратыПоЗадаче
	       |	КОНЕЦ КАК ПланироватьДополнительныеЗатратыПоЗадаче,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ИспользоватьАналитикуКонтрагентДляСС ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ИспользоватьАналитикуКонтрагентДляСС
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ИспользоватьАналитикуКонтрагентДляСС
	       |	КОНЕЦ КАК ИспользоватьАналитикуКонтрагентДляСС,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи
	       |	КОНЕЦ КАК РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF ЕСТЬ NULL
	       |				И &ЭтоНовыйОбъект
	       |			ТОГДА ВТ_Константы.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF
	       |	КОНЕЦ КАК ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетДвиженияДенежныхСредств ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВедетсяБюджетДвиженияДенежныхСредств
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетДвиженияДенежныхСредств
	       |	КОНЕЦ КАК ВедетсяБюджетДвиженияДенежныхСредств,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	       |	КОНЕЦ КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен,
		   |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	       |	КОНЕЦ КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.НастройкаПоказателейДляКарточкиПроектов ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НастройкаПоказателейДляКарточкиПроектов
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.НастройкаПоказателейДляКарточкиПроектов
	       |	КОНЕЦ КАК НастройкаПоказателейДляКарточкиПроектов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(упоНастройкаАналитикиВРазрезеПодразделений.НормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |			ТОГДА ВТ_Константы.НормаСтоимостиТрудовыхРесурсов
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.НормаСтоимостиТрудовыхРесурсов
	       |	КОНЕЦ КАК НормаСтоимостиТрудовыхРесурсов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(упоНастройкаАналитикиВРазрезеПодразделений.ВнешняяНормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |			ТОГДА ВТ_Константы.ВнешняяНормаСтоимостиТрудовыхРесурсов
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ВнешняяНормаСтоимостиТрудовыхРесурсов
	       |	КОНЕЦ КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(упоНастройкаАналитикиВРазрезеПодразделений.НастройкаДереваКлючевыхПоказателей, ЗНАЧЕНИЕ(Справочник.упоНастройкиДереваКлючевыхПоказателей.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНастройкиДереваКлючевыхПоказателей.ПустаяСсылка)
	       |			ТОГДА ВТ_Константы.НастройкаДереваКлючевыхПоказателей
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.НастройкаДереваКлючевыхПоказателей
	       |	КОНЕЦ КАК НастройкаДереваКлючевыхПоказателей,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ЗапретитьРПЗИзменятьСрокиЧужихЗадач ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ЗапретитьРПЗИзменятьСрокиЧужихЗадач
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ЗапретитьРПЗИзменятьСрокиЧужихЗадач
	       |	КОНЕЦ КАК ЗапретитьРПЗИзменятьСрокиЧужихЗадач, 
           |	ВЫБОР
           |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам ЕСТЬ NULL
           |			ТОГДА ВТ_Константы.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам
           |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам
           |	КОНЕЦ КАК РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам, 
           |	ВЫБОР
           |		КОГДА ЕСТЬNULL(упоНастройкаАналитикиВРазрезеПодразделений.НастройкаУровняПланированияПриРасчетеГотовностиПроектов, ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)
           |			ТОГДА ВТ_Константы.НастройкаУровняПланированияПриРасчетеГотовностиПроектов
           |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.НастройкаУровняПланированияПриРасчетеГотовностиПроектов
	       |	КОНЕЦ КАК НастройкаУровняПланированияПриРасчетеГотовностиПроектов,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат
	       |	КОНЕЦ КАК УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат,
	       |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя
	       |	КОНЕЦ КАК НаследоватьЗначениеПоляОбъектИзЗадачиРодителя,
		   |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.НастройкаРаспределенияБДР ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НастройкаРаспределенияБДР
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.НастройкаРаспределенияБДР
	       |	КОНЕЦ КАК НастройкаРаспределенияБДР,
		   |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.НазначатьРСПОсновнойРолиКакРПЗ ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НазначатьРСПОсновнойРолиКакРПЗ
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.НазначатьРСПОсновнойРолиКакРПЗ
	       |	КОНЕЦ КАК НазначатьРСПОсновнойРолиКакРПЗ,
		   |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.УстанавливатьПризнакОсновнаяПриДобавленииРоли ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.УстанавливатьПризнакОсновнаяПриДобавленииРоли
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.УстанавливатьПризнакОсновнаяПриДобавленииРоли
	       |	КОНЕЦ КАК УстанавливатьПризнакОсновнаяПриДобавленииРоли,
		   |	ВЫБОР
	       |		КОГДА упоНастройкаАналитикиВРазрезеПодразделений.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |		ИНАЧЕ упоНастройкаАналитикиВРазрезеПодразделений.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |	КОНЕЦ КАК ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |ИЗ
	       |	Справочник.упоПортфелиПроектов КАК упоПортфелиПроектов
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Константы КАК ВТ_Константы
	       |		ПО (ИСТИНА)
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК упоНастройкаАналитикиВРазрезеПодразделений
	       |		ПО упоПортфелиПроектов.Ссылка = упоНастройкаАналитикиВРазрезеПодразделений.Объект
	       |ГДЕ
	       |	упоПортфелиПроектов.Ссылка В(&СписокПортфелей)";
	
	Возврат Текст;
	
КонецФункции

// Формирует текст запроса для получения настроек учета по подразделениям для проекта.
// 
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ДополнитьЗапросПроектов() Экспорт
	
	Текст ="ВЫБРАТЬ
	       |	&ДоходыПоНатуральнымПоказателям КАК ДоходыПоНатуральнымПоказателям,
	       |	&ДоходыПоОбъемам КАК ДоходыПоОбъемам,
	       |	&ДоходыПоПодразделениям КАК ДоходыПоПодразделениям,
	       |	&РасходыПоНатуральнымПоказателям КАК РасходыПоНатуральнымПоказателям,
	       |	&РасходыПоОбъемам КАК РасходыПоОбъемам,
	       |	&РасходыПоПодразделениям КАК РасходыПоПодразделениям,
	       |	&ВедетсяБюджетДоходов КАК ВедетсяБюджетДоходов,
	       |	&ВедетсяБюджетРасходов КАК ВедетсяБюджетРасходов,
	       |	&ПланироватьТрудозатратыПоРолям КАК ПланироватьТрудозатратыПоРолям,
	       |	&ВыделятьНаВыполнениеРаботРесурсы КАК ВыделятьНаВыполнениеРаботРесурсы,
	       |	&ПланироватьЗатратыНаМатериалы КАК ПланироватьЗатратыНаМатериалы,
	       |	&ПланироватьДополнительныеЗатратыПоЗадаче КАК ПланироватьДополнительныеЗатратыПоЗадаче,
	       |	&ИспользоватьАналитикуКонтрагентДляСС КАК ИспользоватьАналитикуКонтрагентДляСС,
	       |	&ПланироватьТрудозатратыПоПроекту КАК ПланироватьТрудозатратыПоПроекту,
		   |	&УказыватьПодразделениеРолиПриПланированииТР КАК УказыватьПодразделениеРолиПриПланированииТР,
	       |	&РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи КАК РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи,
	       |	&ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF КАК ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF,
	       |	&ВедетсяБюджетДвиженияДенежныхСредств КАК ВедетсяБюджетДвиженияДенежныхСредств,
	       |	&РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен,
		   |	&РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден,
		   |	&НастройкаПоказателейДляКарточкиПроектов КАК НастройкаПоказателейДляКарточкиПроектов,
	       |	&НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
	       |	&ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
	       |	&НастройкаДереваКлючевыхПоказателей КАК НастройкаДереваКлючевыхПоказателей,
	       |	&ЗапретитьРПЗИзменятьСрокиЧужихЗадач КАК ЗапретитьРПЗИзменятьСрокиЧужихЗадач,
	       |	&НастройкаУровняПланированияПриРасчетеГотовностиПроектов КАК НастройкаУровняПланированияПриРасчетеГотовностиПроектов,
	       |	&УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат КАК УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат,
	       |	&НаследоватьЗначениеПоляОбъектИзЗадачиРодителя КАК НаследоватьЗначениеПоляОбъектИзЗадачиРодителя,
		   |	&НастройкаРаспределенияБДР КАК НастройкаРаспределенияБДР,
		   |	&НазначатьРСПОсновнойРолиКакРПЗ КАК НазначатьРСПОсновнойРолиКакРПЗ,
		   |	&УстанавливатьПризнакОсновнаяПриДобавленииРоли КАК УстанавливатьПризнакОсновнаяПриДобавленииРоли,
		   |	&ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки КАК ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки,
           |    &РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам КАК РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам 
	       |ПОМЕСТИТЬ ВТ_Константы
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	       |	упоНастройкаАналитикиВРазрезеПодразделений.Объект КАК Объект,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоПодразделениям КАК ДоходыПоПодразделениям,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоОбъемам КАК ДоходыПоОбъемам,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ДоходыПоНатуральнымПоказателям КАК ДоходыПоНатуральнымПоказателям,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоПодразделениям КАК РасходыПоПодразделениям,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоОбъемам КАК РасходыПоОбъемам,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.РасходыПоНатуральнымПоказателям КАК РасходыПоНатуральнымПоказателям,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетДоходов КАК ВедетсяБюджетДоходов,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетРасходов КАК ВедетсяБюджетРасходов,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьТрудозатратыПоРолям КАК ПланироватьТрудозатратыПоРолям,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ВыделятьНаВыполнениеРаботРесурсы КАК ВыделятьНаВыполнениеРаботРесурсы,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьЗатратыНаМатериалы КАК ПланироватьЗатратыНаМатериалы,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьДополнительныеЗатратыПоЗадаче КАК ПланироватьДополнительныеЗатратыПоЗадаче,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ИспользоватьАналитикуКонтрагентДляСС КАК ИспользоватьАналитикуКонтрагентДляСС,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ПланироватьТрудозатратыПоПроекту КАК ПланироватьТрудозатратыПоПроекту,
		   |	упоНастройкаАналитикиВРазрезеПодразделений.УказыватьПодразделениеРолиПриПланированииТР КАК УказыватьПодразделениеРолиПриПланированииТР,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи КАК РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF КАК ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ВедетсяБюджетДвиженияДенежныхСредств КАК ВедетсяБюджетДвиженияДенежныхСредств,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен,
		   |	упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден,
		   |	упоНастройкаАналитикиВРазрезеПодразделений.НастройкаПоказателейДляКарточкиПроектов КАК НастройкаПоказателейДляКарточкиПроектов,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.НастройкаДереваКлючевыхПоказателей КАК НастройкаДереваКлючевыхПоказателей,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.ЗапретитьРПЗИзменятьСрокиЧужихЗадач КАК ЗапретитьРПЗИзменятьСрокиЧужихЗадач,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам КАК РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.НастройкаУровняПланированияПриРасчетеГотовностиПроектов КАК НастройкаУровняПланированияПриРасчетеГотовностиПроектов,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат КАК УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат,
	       |	упоНастройкаАналитикиВРазрезеПодразделений.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя КАК НаследоватьЗначениеПоляОбъектИзЗадачиРодителя,
		   |	упоНастройкаАналитикиВРазрезеПодразделений.НастройкаРаспределенияБДР КАК НастройкаРаспределенияБДР,
		   |	упоНастройкаАналитикиВРазрезеПодразделений.НазначатьРСПОсновнойРолиКакРПЗ КАК НазначатьРСПОсновнойРолиКакРПЗ,
		   |	упоНастройкаАналитикиВРазрезеПодразделений.УстанавливатьПризнакОсновнаяПриДобавленииРоли КАК УстанавливатьПризнакОсновнаяПриДобавленииРоли,
		   |	упоНастройкаАналитикиВРазрезеПодразделений.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки КАК ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |ПОМЕСТИТЬ ВТ_НастройкиПоПодразделениям
	       |ИЗ
	       |	РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК упоНастройкаАналитикиВРазрезеПодразделений
	       |ГДЕ
	       |	упоНастройкаАналитикиВРазрезеПодразделений.Объект В(&СписокОбъектов)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	упоПортфелиПроектов.Ссылка КАК Объект,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ДоходыПоПодразделениям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ДоходыПоПодразделениям
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ДоходыПоПодразделениям
	       |	КОНЕЦ КАК ДоходыПоПодразделениям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ДоходыПоОбъемам ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ДоходыПоОбъемам
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ДоходыПоОбъемам
	       |	КОНЕЦ КАК ДоходыПоОбъемам,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ДоходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ДоходыПоНатуральнымПоказателям
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ДоходыПоНатуральнымПоказателям
	       |	КОНЕЦ КАК ДоходыПоНатуральнымПоказателям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РасходыПоПодразделениям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РасходыПоПодразделениям
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РасходыПоПодразделениям
	       |	КОНЕЦ КАК РасходыПоПодразделениям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РасходыПоОбъемам ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РасходыПоОбъемам
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РасходыПоОбъемам
	       |	КОНЕЦ КАК РасходыПоОбъемам,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РасходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РасходыПоНатуральнымПоказателям
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РасходыПоНатуральнымПоказателям
	       |	КОНЕЦ КАК РасходыПоНатуральнымПоказателям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.Объект ЕСТЬ NULL
	       |			ТОГДА ИСТИНА
	       |		ИНАЧЕ ЛОЖЬ
	       |	КОНЕЦ КАК ИсточникКонстанта,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДоходов ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВедетсяБюджетДоходов
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДоходов
	       |	КОНЕЦ КАК ВедетсяБюджетДоходов,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВедетсяБюджетРасходов ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВедетсяБюджетРасходов
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВедетсяБюджетРасходов
	       |	КОНЕЦ КАК ВедетсяБюджетРасходов,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоПроекту ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьТрудозатратыПоПроекту
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоПроекту
	       |	КОНЕЦ КАК ПланироватьТрудозатратыПоПроекту,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.УказыватьПодразделениеРолиПриПланированииТР ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.УказыватьПодразделениеРолиПриПланированииТР
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.УказыватьПодразделениеРолиПриПланированииТР
	       |	КОНЕЦ КАК УказыватьПодразделениеРолиПриПланированииТР,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоРолям ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьТрудозатратыПоРолям
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоРолям
	       |	КОНЕЦ КАК ПланироватьТрудозатратыПоРолям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВыделятьНаВыполнениеРаботРесурсы ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВыделятьНаВыполнениеРаботРесурсы
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВыделятьНаВыполнениеРаботРесурсы
	       |	КОНЕЦ КАК ВыделятьНаВыполнениеРаботРесурсы,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьЗатратыНаМатериалы ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьЗатратыНаМатериалы
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьЗатратыНаМатериалы
	       |	КОНЕЦ КАК ПланироватьЗатратыНаМатериалы,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьДополнительныеЗатратыПоЗадаче ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ПланироватьДополнительныеЗатратыПоЗадаче
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьДополнительныеЗатратыПоЗадаче
	       |	КОНЕЦ КАК ПланироватьДополнительныеЗатратыПоЗадаче,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ИспользоватьАналитикуКонтрагентДляСС ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ИспользоватьАналитикуКонтрагентДляСС
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ИспользоватьАналитикуКонтрагентДляСС
	       |	КОНЕЦ КАК ИспользоватьАналитикуКонтрагентДляСС,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи
	       |	КОНЕЦ КАК РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF ЕСТЬ NULL
	       |				И &ЭтоНовыйОбъект
	       |			ТОГДА ВТ_Константы.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF
	       |	КОНЕЦ КАК ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДвиженияДенежныхСредств ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ВедетсяБюджетДвиженияДенежныхСредств
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДвиженияДенежныхСредств
	       |	КОНЕЦ КАК ВедетсяБюджетДвиженияДенежныхСредств,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	       |	КОНЕЦ КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	       |	КОНЕЦ КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НастройкаПоказателейДляКарточкиПроектов ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НастройкаПоказателейДляКарточкиПроектов
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаПоказателейДляКарточкиПроектов
	       |	КОНЕЦ КАК НастройкаПоказателейДляКарточкиПроектов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.НормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |			ТОГДА ВТ_Константы.НормаСтоимостиТрудовыхРесурсов
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НормаСтоимостиТрудовыхРесурсов
	       |	КОНЕЦ КАК НормаСтоимостиТрудовыхРесурсов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.ВнешняяНормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |			ТОГДА ВТ_Константы.ВнешняяНормаСтоимостиТрудовыхРесурсов
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВнешняяНормаСтоимостиТрудовыхРесурсов
	       |	КОНЕЦ КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.НастройкаДереваКлючевыхПоказателей, ЗНАЧЕНИЕ(Справочник.упоНастройкиДереваКлючевыхПоказателей.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНастройкиДереваКлючевыхПоказателей.ПустаяСсылка)
	       |			ТОГДА ВТ_Константы.НастройкаДереваКлючевыхПоказателей
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаДереваКлючевыхПоказателей
	       |	КОНЕЦ КАК НастройкаДереваКлючевыхПоказателей,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ЗапретитьРПЗИзменятьСрокиЧужихЗадач ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ЗапретитьРПЗИзменятьСрокиЧужихЗадач
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ЗапретитьРПЗИзменятьСрокиЧужихЗадач
	       |	КОНЕЦ КАК ЗапретитьРПЗИзменятьСрокиЧужихЗадач,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам
	       |	КОНЕЦ КАК РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.НастройкаУровняПланированияПриРасчетеГотовностиПроектов, ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)
	       |			ТОГДА ВТ_Константы.НастройкаУровняПланированияПриРасчетеГотовностиПроектов
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаУровняПланированияПриРасчетеГотовностиПроектов
	       |	КОНЕЦ КАК НастройкаУровняПланированияПриРасчетеГотовностиПроектов,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат
	       |	КОНЕЦ КАК УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя
	       |	КОНЕЦ КАК НаследоватьЗначениеПоляОбъектИзЗадачиРодителя,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НастройкаРаспределенияБДР ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НастройкаРаспределенияБДР
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаРаспределенияБДР
	       |	КОНЕЦ КАК НастройкаРаспределенияБДР,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НазначатьРСПОсновнойРолиКакРПЗ ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.НазначатьРСПОсновнойРолиКакРПЗ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НазначатьРСПОсновнойРолиКакРПЗ
	       |	КОНЕЦ КАК НазначатьРСПОсновнойРолиКакРПЗ,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.УстанавливатьПризнакОсновнаяПриДобавленииРоли ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.УстанавливатьПризнакОсновнаяПриДобавленииРоли
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.УстанавливатьПризнакОсновнаяПриДобавленииРоли
	       |	КОНЕЦ КАК УстанавливатьПризнакОсновнаяПриДобавленииРоли,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки ЕСТЬ NULL
	       |			ТОГДА ВТ_Константы.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |	КОНЕЦ КАК ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |ПОМЕСТИТЬ ВТ_Портфели
	       |ИЗ
	       |	Справочник.упоПортфелиПроектов КАК упоПортфелиПроектов
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Константы КАК ВТ_Константы
	       |		ПО (ИСТИНА)
	       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиПоПодразделениям КАК ВТ_НастройкиПоПодразделениям
	       |		ПО упоПортфелиПроектов.Ссылка = ВТ_НастройкиПоПодразделениям.Объект
	       |ГДЕ
	       |	упоПортфелиПроектов.Ссылка В(&СписокПортфелей)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	Проекты.Ссылка КАК Объект,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ДоходыПоПодразделениям ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ДоходыПоПодразделениям ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ДоходыПоПодразделениям
	       |					ИНАЧЕ ВТ_Портфели.ДоходыПоПодразделениям
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ДоходыПоПодразделениям
	       |	КОНЕЦ КАК ДоходыПоПодразделениям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ДоходыПоОбъемам ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ДоходыПоОбъемам ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ДоходыПоОбъемам
	       |					ИНАЧЕ ВТ_Портфели.ДоходыПоОбъемам
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ДоходыПоОбъемам
	       |	КОНЕЦ КАК ДоходыПоОбъемам,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ДоходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ДоходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ДоходыПоНатуральнымПоказателям
	       |					ИНАЧЕ ВТ_Портфели.ДоходыПоНатуральнымПоказателям
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ДоходыПоНатуральнымПоказателям
	       |	КОНЕЦ КАК ДоходыПоНатуральнымПоказателям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РасходыПоПодразделениям ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.РасходыПоПодразделениям ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.РасходыПоПодразделениям
	       |					ИНАЧЕ ВТ_Портфели.РасходыПоПодразделениям
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РасходыПоПодразделениям
	       |	КОНЕЦ КАК РасходыПоПодразделениям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РасходыПоОбъемам ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.РасходыПоОбъемам ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.РасходыПоОбъемам
	       |					ИНАЧЕ ВТ_Портфели.РасходыПоОбъемам
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РасходыПоОбъемам
	       |	КОНЕЦ КАК РасходыПоОбъемам,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РасходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.РасходыПоНатуральнымПоказателям ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.РасходыПоНатуральнымПоказателям
	       |					ИНАЧЕ ВТ_Портфели.РасходыПоНатуральнымПоказателям
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РасходыПоНатуральнымПоказателям
	       |	КОНЕЦ КАК РасходыПоНатуральнымПоказателям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.Объект ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.Объект ЕСТЬ NULL
	       |						ТОГДА ИСТИНА
	       |					ИНАЧЕ ВТ_Портфели.ИсточникКонстанта
	       |				КОНЕЦ
	       |		ИНАЧЕ ЛОЖЬ
	       |	КОНЕЦ КАК ИсточникКонстанта,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.Объект ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.Объект ЕСТЬ NULL
	       |						ТОГДА ЛОЖЬ
	       |					ИНАЧЕ НЕ ВТ_Портфели.ИсточникКонстанта
	       |				КОНЕЦ
	       |		ИНАЧЕ ЛОЖЬ
	       |	КОНЕЦ КАК ИсточникПортфель,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДоходов ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ВедетсяБюджетДоходов ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ВедетсяБюджетДоходов
	       |					ИНАЧЕ ВТ_Портфели.ВедетсяБюджетДоходов
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДоходов
	       |	КОНЕЦ КАК ВедетсяБюджетДоходов,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВедетсяБюджетРасходов ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ВедетсяБюджетРасходов ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ВедетсяБюджетРасходов
	       |					ИНАЧЕ ВТ_Портфели.ВедетсяБюджетРасходов
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВедетсяБюджетРасходов
	       |	КОНЕЦ КАК ВедетсяБюджетРасходов,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоРолям ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ПланироватьТрудозатратыПоРолям ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ПланироватьТрудозатратыПоРолям
	       |					ИНАЧЕ ВТ_Портфели.ПланироватьТрудозатратыПоРолям
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоРолям
	       |	КОНЕЦ КАК ПланироватьТрудозатратыПоРолям,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.УказыватьПодразделениеРолиПриПланированииТР ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.УказыватьПодразделениеРолиПриПланированииТР ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.УказыватьПодразделениеРолиПриПланированииТР
	       |					ИНАЧЕ ВТ_Портфели.УказыватьПодразделениеРолиПриПланированииТР
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.УказыватьПодразделениеРолиПриПланированииТР
	       |	КОНЕЦ КАК УказыватьПодразделениеРолиПриПланированииТР,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоПроекту ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ПланироватьТрудозатратыПоПроекту ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ПланироватьТрудозатратыПоПроекту
	       |					ИНАЧЕ ВТ_Портфели.ПланироватьТрудозатратыПоПроекту
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьТрудозатратыПоПроекту
	       |	КОНЕЦ КАК ПланироватьТрудозатратыПоПроекту,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВыделятьНаВыполнениеРаботРесурсы ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ВыделятьНаВыполнениеРаботРесурсы ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ВыделятьНаВыполнениеРаботРесурсы
	       |					ИНАЧЕ ВТ_Портфели.ВыделятьНаВыполнениеРаботРесурсы
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВыделятьНаВыполнениеРаботРесурсы
	       |	КОНЕЦ КАК ВыделятьНаВыполнениеРаботРесурсы,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьЗатратыНаМатериалы ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ПланироватьЗатратыНаМатериалы ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ПланироватьЗатратыНаМатериалы
	       |					ИНАЧЕ ВТ_Портфели.ПланироватьЗатратыНаМатериалы
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьЗатратыНаМатериалы
	       |	КОНЕЦ КАК ПланироватьЗатратыНаМатериалы,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ПланироватьДополнительныеЗатратыПоЗадаче ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ПланироватьДополнительныеЗатратыПоЗадаче ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ПланироватьДополнительныеЗатратыПоЗадаче
	       |					ИНАЧЕ ВТ_Портфели.ПланироватьДополнительныеЗатратыПоЗадаче
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ПланироватьДополнительныеЗатратыПоЗадаче
	       |	КОНЕЦ КАК ПланироватьДополнительныеЗатратыПоЗадаче,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ИспользоватьАналитикуКонтрагентДляСС ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ИспользоватьАналитикуКонтрагентДляСС ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ИспользоватьАналитикуКонтрагентДляСС
	       |					ИНАЧЕ ВТ_Портфели.ИспользоватьАналитикуКонтрагентДляСС
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ИспользоватьАналитикуКонтрагентДляСС
	       |	КОНЕЦ КАК ИспользоватьАналитикуКонтрагентДляСС,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи
	       |					ИНАЧЕ ВТ_Портфели.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи
	       |	КОНЕЦ КАК РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF ЕСТЬ NULL
	       |				И &ЭтоНовыйОбъект
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF
	       |					ИНАЧЕ ВТ_Портфели.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF
	       |	КОНЕЦ КАК ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДвиженияДенежныхСредств ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ВедетсяБюджетДвиженияДенежныхСредств ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ВедетсяБюджетДвиженияДенежныхСредств
	       |					ИНАЧЕ ВТ_Портфели.ВедетсяБюджетДвиженияДенежныхСредств
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВедетсяБюджетДвиженияДенежныхСредств
	       |	КОНЕЦ КАК ВедетсяБюджетДвиженияДенежныхСредств,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	       |					ИНАЧЕ ВТ_Портфели.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	       |	КОНЕЦ КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	       |					ИНАЧЕ ВТ_Портфели.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	       |	КОНЕЦ КАК РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НастройкаПоказателейДляКарточкиПроектов ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.НастройкаПоказателейДляКарточкиПроектов ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.НастройкаПоказателейДляКарточкиПроектов
	       |					ИНАЧЕ ВТ_Портфели.НастройкаПоказателейДляКарточкиПроектов
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаПоказателейДляКарточкиПроектов
	       |	КОНЕЦ КАК НастройкаПоказателейДляКарточкиПроектов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.НормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |			ТОГДА ВЫБОР
	       |					КОГДА ЕСТЬNULL(ВТ_Портфели.НормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |						ТОГДА ВТ_Константы.НормаСтоимостиТрудовыхРесурсов
	       |					ИНАЧЕ ВТ_Портфели.НормаСтоимостиТрудовыхРесурсов
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НормаСтоимостиТрудовыхРесурсов
	       |	КОНЕЦ КАК НормаСтоимостиТрудовыхРесурсов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.ВнешняяНормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |			ТОГДА ВЫБОР
	       |					КОГДА ЕСТЬNULL(ВТ_Портфели.ВнешняяНормаСтоимостиТрудовыхРесурсов, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |						ТОГДА ВТ_Константы.ВнешняяНормаСтоимостиТрудовыхРесурсов
	       |					ИНАЧЕ ВТ_Портфели.ВнешняяНормаСтоимостиТрудовыхРесурсов
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ВнешняяНормаСтоимостиТрудовыхРесурсов
	       |	КОНЕЦ КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.НастройкаДереваКлючевыхПоказателей, ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНормыСтоимости.ПустаяСсылка)
	       |			ТОГДА ВЫБОР
	       |					КОГДА ЕСТЬNULL(ВТ_Портфели.НастройкаДереваКлючевыхПоказателей, ЗНАЧЕНИЕ(Справочник.упоНастройкиДереваКлючевыхПоказателей.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоНастройкиДереваКлючевыхПоказателей.ПустаяСсылка)
	       |						ТОГДА ВТ_Константы.НастройкаДереваКлючевыхПоказателей
	       |					ИНАЧЕ ВТ_Портфели.НастройкаДереваКлючевыхПоказателей
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаДереваКлючевыхПоказателей
	       |	КОНЕЦ КАК НастройкаДереваКлючевыхПоказателей,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ЗапретитьРПЗИзменятьСрокиЧужихЗадач ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ЗапретитьРПЗИзменятьСрокиЧужихЗадач ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ЗапретитьРПЗИзменятьСрокиЧужихЗадач
	       |					ИНАЧЕ ВТ_Портфели.ЗапретитьРПЗИзменятьСрокиЧужихЗадач
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ЗапретитьРПЗИзменятьСрокиЧужихЗадач
	       |	КОНЕЦ КАК ЗапретитьРПЗИзменятьСрокиЧужихЗадач,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам
	       |					ИНАЧЕ ВТ_Портфели.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам
	       |	КОНЕЦ КАК РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам,
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВТ_НастройкиПоПодразделениям.НастройкаУровняПланированияПриРасчетеГотовностиПроектов, ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)
	       |			ТОГДА ВЫБОР
	       |					КОГДА ЕСТЬNULL(ВТ_Портфели.НастройкаУровняПланированияПриРасчетеГотовностиПроектов, ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.ПустаяСсылка)
	       |						ТОГДА ВТ_Константы.НастройкаУровняПланированияПриРасчетеГотовностиПроектов
	       |					ИНАЧЕ ВТ_Портфели.НастройкаУровняПланированияПриРасчетеГотовностиПроектов
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаУровняПланированияПриРасчетеГотовностиПроектов
	       |	КОНЕЦ КАК НастройкаУровняПланированияПриРасчетеГотовностиПроектов,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат
	       |					ИНАЧЕ ВТ_Портфели.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат
	       |	КОНЕЦ КАК УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат,
	       |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя
	       |					ИНАЧЕ ВТ_Портфели.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя
	       |	КОНЕЦ КАК НаследоватьЗначениеПоляОбъектИзЗадачиРодителя,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НастройкаРаспределенияБДР ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.НастройкаРаспределенияБДР ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.НастройкаРаспределенияБДР
	       |					ИНАЧЕ ВТ_Портфели.НастройкаРаспределенияБДР
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НастройкаРаспределенияБДР
	       |	КОНЕЦ КАК НастройкаРаспределенияБДР,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.НазначатьРСПОсновнойРолиКакРПЗ ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.НазначатьРСПОсновнойРолиКакРПЗ ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.НазначатьРСПОсновнойРолиКакРПЗ
	       |					ИНАЧЕ ВТ_Портфели.НазначатьРСПОсновнойРолиКакРПЗ
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.НазначатьРСПОсновнойРолиКакРПЗ
	       |	КОНЕЦ КАК НазначатьРСПОсновнойРолиКакРПЗ,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.УстанавливатьПризнакОсновнаяПриДобавленииРоли ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.УстанавливатьПризнакОсновнаяПриДобавленииРоли ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.УстанавливатьПризнакОсновнаяПриДобавленииРоли
	       |					ИНАЧЕ ВТ_Портфели.УстанавливатьПризнакОсновнаяПриДобавленииРоли
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.УстанавливатьПризнакОсновнаяПриДобавленииРоли
	       |	КОНЕЦ КАК УстанавливатьПризнакОсновнаяПриДобавленииРоли,
		   |	ВЫБОР
	       |		КОГДА ВТ_НастройкиПоПодразделениям.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки ЕСТЬ NULL
	       |			ТОГДА ВЫБОР
	       |					КОГДА ВТ_Портфели.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки ЕСТЬ NULL
	       |						ТОГДА ВТ_Константы.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |					ИНАЧЕ ВТ_Портфели.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |				КОНЕЦ
	       |		ИНАЧЕ ВТ_НастройкиПоПодразделениям.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |	КОНЕЦ КАК ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки
	       |ИЗ
	       |	Справочник.Проекты КАК Проекты
	       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиПоПодразделениям КАК ВТ_НастройкиПоПодразделениям
	       |		ПО Проекты.Ссылка = ВТ_НастройкиПоПодразделениям.Объект
	       |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Портфели КАК ВТ_Портфели
	       |		ПО Проекты.ПортфельПроектов = ВТ_Портфели.Объект
	       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Константы КАК ВТ_Константы
	       |		ПО (ИСТИНА)
	       |ГДЕ
	       |	Проекты.Ссылка В(&СписокПроектов)";
	
	Возврат Текст;
	
КонецФункции

// Формирует записи в регистре настроек учета по подразделениям для Проекта/Портфеля.
//
// Параметры:
//	ЭтаФорма - УправляемаяФорма.
//	Объект - ДанныеФормыСтруктура.
//
Процедура ОбъектНастроекПослеЗаписиНаСервере(ЭтаФорма, Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрСведенийКЗ = РегистрыСведений.упоНастройкаАналитикиВРазрезеПодразделений.СоздатьНаборЗаписей();
	РегистрСведенийКЗ.Отбор.Объект.Установить(Объект.Ссылка);
	
	НоваяСтрока = РегистрСведенийКЗ.Добавить();
	НоваяСтрока.Объект = Объект.Ссылка;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтаФорма, ,"Объект");
	НоваяСтрока.НастройкаПоказателейДляКарточкиПроектов = 
		Новый ХранилищеЗначения(ЭтаФорма.упоНастройкаПоказателейДляКарточкиПроектовНастройка);
	
	РегистрСведенийКЗ.Записать(Истина);
	
КонецПроцедуры

// Формирует структуру, содержащую значения по умолчанию для подстановки в реквизиты объекта.
//
// Параметры:
//	Проект - СправочникСсылка.Проекты - проект.
// 
// Возвращаемое значение:
//	Структура - структура.
Функция ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект) Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("СтатьяДоходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("НатуральныйПоказательДоходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("РольДоходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("ПодразделениеДоходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("ПрофильДоходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("КонтрагентДоходов");
	СтруктураРеквизитов.Вставить("ДоговорДоходов");
	СтруктураРеквизитов.Вставить("СтатьяЗатратПоУмолчанию");
	СтруктураРеквизитов.Вставить("РольРасходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("ПодразделениеРасходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("ПрофильРасходовПоУмолчанию");
	СтруктураРеквизитов.Вставить("КонтрагентЗатрат");
	СтруктураРеквизитов.Вставить("ДоговорЗатрат");
	СтруктураРеквизитов.Вставить("НатуральныйПоказательРасходовПоУмолчанию");
	
	РеквизитыПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Проект, СтруктураРеквизитов);
	
	СтруктураСвойствПоУмолчанию = Новый Структура;
	
	// Доходы.
	СтруктураСвойствПоУмолчанию.Вставить("СтатьяДоходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.СтатьяДоходовПоУмолчанию),
			РеквизитыПроекта.СтатьяДоходовПоУмолчанию,
			Константы.упоСтатьяДоходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("НатуральныйПоказательДоходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.НатуральныйПоказательДоходовПоУмолчанию),
			РеквизитыПроекта.НатуральныйПоказательДоходовПоУмолчанию,
			Константы.упоНатуральныйПоказательДоходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("РольДоходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.РольДоходовПоУмолчанию),
			РеквизитыПроекта.РольДоходовПоУмолчанию,
			Константы.упоРольДоходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("ПодразделениеДоходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.ПодразделениеДоходовПоУмолчанию),
			РеквизитыПроекта.ПодразделениеДоходовПоУмолчанию,
			Константы.упоПодразделениеДоходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("ПрофильДоходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.ПрофильДоходовПоУмолчанию),
			РеквизитыПроекта.ПрофильДоходовПоУмолчанию,
			Константы.упоПрофильДоходовПоУмолчанию.Получить())); 
	СтруктураСвойствПоУмолчанию.Вставить("КонтрагентДоходовПоУмолчанию", РеквизитыПроекта.КонтрагентДоходов);		
	СтруктураСвойствПоУмолчанию.Вставить("ДоговорДоходовПоУмолчанию", РеквизитыПроекта.ДоговорДоходов);
	
	Если ЗначениеЗаполнено(СтруктураСвойствПоУмолчанию.РольДоходовПоУмолчанию)
		И ЗначениеЗаполнено(СтруктураСвойствПоУмолчанию.РольДоходовПоУмолчанию.СобствСилы_Субподряд) Тогда		
		СССП_Доходы = СтруктураСвойствПоУмолчанию.РольДоходовПоУмолчанию.СобствСилы_Субподряд;	
	Иначе		
		СССП_Доходы = Справочники.упоСобственныеСилыСубподряд.СобственныеСилы;		
	КонецЕсли;	
	СтруктураСвойствПоУмолчанию.Вставить("СССП_Доходы", СССП_Доходы);
	
	// Расходы.
	СтруктураСвойствПоУмолчанию.Вставить("СтатьяЗатратПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.СтатьяЗатратПоУмолчанию),
			РеквизитыПроекта.СтатьяЗатратПоУмолчанию,
			Константы.упоСтатьяЗатратПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("НатуральныйПоказательРасходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.НатуральныйПоказательРасходовПоУмолчанию),
			РеквизитыПроекта.НатуральныйПоказательРасходовПоУмолчанию,
			Константы.упоНатуральныйПоказательРасходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("РольРасходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.РольРасходовПоУмолчанию),
			РеквизитыПроекта.РольРасходовПоУмолчанию,
			Константы.упоРольРасходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("ПодразделениеРасходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.ПодразделениеРасходовПоУмолчанию),
			РеквизитыПроекта.ПодразделениеРасходовПоУмолчанию,
			Константы.упоПодразделениеРасходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("ПрофильРасходовПоУмолчанию",
		?(ЗначениеЗаполнено(РеквизитыПроекта.ПрофильРасходовПоУмолчанию),
			РеквизитыПроекта.ПрофильРасходовПоУмолчанию,
			Константы.упоПрофильРасходовПоУмолчанию.Получить()));
	СтруктураСвойствПоУмолчанию.Вставить("КонтрагентЗатратПоУмолчанию", РеквизитыПроекта.КонтрагентЗатрат);
	СтруктураСвойствПоУмолчанию.Вставить("ДоговорЗатратПоУмолчанию", РеквизитыПроекта.ДоговорЗатрат);
		
	Если ЗначениеЗаполнено(СтруктураСвойствПоУмолчанию.РольРасходовПоУмолчанию)
		И ЗначениеЗаполнено(СтруктураСвойствПоУмолчанию.РольРасходовПоУмолчанию.СобствСилы_Субподряд) Тогда	
		СССП_Расходы = СтруктураСвойствПоУмолчанию.РольРасходовПоУмолчанию.СобствСилы_Субподряд;	
	Иначе	
		СССП_Расходы = Справочники.упоСобственныеСилыСубподряд.СобственныеСилы;		
	КонецЕсли;	
	СтруктураСвойствПоУмолчанию.Вставить("СССП_Расходы", СССП_Расходы);
	
	Возврат СтруктураСвойствПоУмолчанию;
	
КонецФункции

// Формирует дополнительную структуру настоек учета по подразделениям.
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект - объект.
//	СтруктураПроведения - Структура - структура.
//
// Возвращаемое значение:
//	Структура – содержит настройки по подразделениям.
Процедура ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(ЭтотОбъект, СтруктураПроведения) Экспорт
	
	СтруктураПроведения.Вставить("НатуральныйПоказательДоходов", Константы.упоНатуральныйПоказательДоходовПоУмолчанию.Получить());
	СтруктураПроведения.Вставить("РольДоходов", Константы.упоРольДоходовПоУмолчанию.Получить());
	СтруктураПроведения.Вставить("ПодразделениеДоходов", Константы.упоПодразделениеДоходовПоУмолчанию.Получить());
	
	СтруктураПроведения.Вставить("НатуральныйПоказательРасходов", Константы.упоНатуральныйПоказательРасходовПоУмолчанию.Получить());
	СтруктураПроведения.Вставить("РольРасходов", Константы.упоРольРасходовПоУмолчанию.Получить());
	СтруктураПроведения.Вставить("ПодразделениеРасходов", Константы.упоПодразделениеРасходовПоУмолчанию.Получить());
	
КонецПроцедуры

// Формирует структуру настоек учета (из регистров) по подразделениям для прикладного объекта.
//
// Параметры:
//  СсылкаНаОбъект	 - СправочникСсылка.Проекты, СправочникСсылка.упоПортфелиПроектов	 - проект/портфель.
// 
// Возвращаемое значение:
//  Структура - содержит настройки по подразделениям.
//
Функция ЗаполнитьПараметрыУчетаПоПодразделениям(СсылкаНаОбъект) Экспорт
	
	Возврат упоАналитикаПоПодразделениямПовтИспВызов.ЗаполнитьПараметрыУчетаПоПодразделениям(СсылкаНаОбъект);
	
КонецФункции

// Устарела. см. упоПроектыИЗадачиОбщие.УстановитьВидимостьЭлементовФормыПроектнойЗадачи()
// Устанавливает видимость элементов управления формы ПЗ в зависимости от настроек учета.
//
// Параметры:
//	Форма - УправляемаяФорма - форма.
//	Объект - ДанныеФормыСтруктура - слепок объекта.
Процедура ВидимостьЭлементовПЗ(Форма, Объект) Экспорт
	
	упоПроектыИЗадачиОбщие.УстановитьВидимостьЭлементовФормыПроектнойЗадачи(Объект, Форма);
	
КонецПроцедуры

// Перепроводит проектные задачи, у которых заполнена табличная часть МатериальныеРесурсы.
Процедура ПерезаписатьАктуальныеПланыДоходовРасходовПоПодразделениям() Экспорт

	Если Метаданные.Константы.Найти("ПрименятьДатуЗапретаДляПолныхПрав") <> Неопределено Тогда
		
		ЗначениеКонстантыСтарое = Константы["ПрименятьДатуЗапретаДляПолныхПрав"].Получить();
		Константы["ПрименятьДатуЗапретаДляПолныхПрав"].Установить(Ложь);
		
	КонецЕсли;
	
	СтароеЗначениеПараметраСеансаОтключитьПроверкуОграничений = ПараметрыСеанса.упоОтключитьПроверкуОграничений;
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыДоходовИРасходов.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ втДвиженияАктуальныеПланыДоходовРасходов
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов КАК упоАктуальныеПланыДоходовИРасходов
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоПроектнаяЗадачаМатериальныеРесурсы.Ссылка КАК ПроектнаяЗадача
	               |ИЗ
	               |	Документ.упоПроектнаяЗадача.МатериальныеРесурсы КАК упоПроектнаяЗадачаМатериальныеРесурсы
	               |ГДЕ
	               |	упоПроектнаяЗадачаМатериальныеРесурсы.Ссылка.Проведен
	               |	И НЕ упоПроектнаяЗадачаМатериальныеРесурсы.Ссылка.ВключитьМатРесурсыВПланРасходов
	               |	И упоПроектнаяЗадачаМатериальныеРесурсы.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втДвиженияАктуальныеПланыДоходовРасходов.Регистратор
	               |			ИЗ
	               |				втДвиженияАктуальныеПланыДоходовРасходов КАК втДвиженияАктуальныеПланыДоходовРасходов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ПроектнаяЗадачаОбъект = Выборка.ПроектнаяЗадача.ПолучитьОбъект();
			ПроектнаяЗадачаОбъект.Дата = ТекущаяДатаСеанса();
			ПроектнаяЗадачаОбъект.ПолучитьДанныеВерсии(Неопределено);
			ПроектнаяЗадачаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ПараметрыОшибки = Новый Структура;
			ПараметрыОшибки.Вставить("Событие", "Проведение документа " + Выборка.ПроектнаяЗадача);
			ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
			ПараметрыОшибки.Вставить("ОбъектМетаданных", Метаданные.Документы.упоПроектнаяЗадача);
			ПараметрыОшибки.Вставить("Данные", Выборка.ПроектнаяЗадача);
			ПараметрыОшибки.Вставить("Комментарий", ОписаниеОшибки());			
			упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(ПараметрыОшибки);
		КонецПопытки;		
	
	КонецЦикла;
	
	Если Метаданные.Константы.Найти("ПрименятьДатуЗапретаДляПолныхПрав") <> Неопределено Тогда
		
		Константы["ПрименятьДатуЗапретаДляПолныхПрав"].Установить(ЗначениеКонстантыСтарое);
		
	КонецЕсли;
	
	ПараметрыСеанса.упоОтключитьПроверкуОграничений = СтароеЗначениеПараметраСеансаОтключитьПроверкуОграничений;

КонецПроцедуры

#Область ОбработчикиПроведенияПЗИДокументовРегистрацииФакта

// Основная процедура - обработчик проведения по регистрам учета по подразделениям.
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект.
//	ДанныеДвижений - Структура - содержит таблицы движений.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	СвойстваПроведения - Структура - содержит дополнительные настройки учета по подразделениям.
//	Отказ - Булево - признак отказа от проведения.
//
Процедура ПодготовитьТаблицыДвижений(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ) Экспорт
	
	Если СвойстваПроекта.ДоходыПоПодразделениям
		Или СвойстваПроекта.РасходыПоПодразделениям Тогда
		// В противном случае учет по подразделениям не ведется.
		
		Если ДанныеДвижений.Свойство("упоАктуальныеПланыВыполненияОбъемов") Тогда
			ЗаполнитьДвиженияПлановыеОбъемы(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);			
		КонецЕсли;
		
		Если ДанныеДвижений.Свойство("упоФактВыполненияОбъемовОбороты") Тогда
			ЗаполнитьДвиженияФактическиеОбъемы(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);			
		КонецЕсли;
		
		Если ДанныеДвижений.Свойство("упоВыполненныеПринятыеОбъемы") Тогда			
			ЗаполнитьДвиженияВыполненныеПринятыеОбъемы(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);									
		КонецЕсли;
		
	КонецЕсли;	
	
	// Данные формируются вне зависимости от того, ведутся ли доходы/расходы в разрезе подразделений, или нет.
	
	Если ДанныеДвижений.Свойство("упоФактДоходовИРасходовОбороты") Тогда
		ЗаполнитьДвиженияДоходыРасходы(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);
	КонецЕсли;
	
	Если ДанныеДвижений.Свойство("упоАктуальныеПланыДоходовИРасходовПодразделения") Тогда
		ЗаполнитьДвиженияПланДоходовИРасходов(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Актуализирует таблицу движений регистра упоАктуальныеПланыДоходовИРасходовПодразделения при актуализации
//  календарного плана проекта.
//
// Параметры:
//  ЭтотОбъект								 - ДокументОбъект	 - объект.
//  ДанныеДокумента							 - Структура		 - данные документа проведения.
//  ТаблицаСроковЗадач						 - ТаблицаЗначений	 - сроки задач.
//  СоответствиеСроковЗадач					 - Соответствие		
//  ТаблицаДвиженийПланБДРПоПодразделениям	 - ТаблицаЗначений	 - исходная таблица с профилями.
//  СвойстваПроведения						 - Структура		 - содержит дополнительные настройки учета по подразделениям.
//  Отказ									 - Булево			 - признак отказа от проведения.
//
Процедура АктуализацияДанныхДоходовРасходов(ЭтотОбъект, 
											ДанныеДокумента,
											ТаблицаСроковЗадач,
											СоответствиеСроковЗадач,
											ТаблицаДвиженийПланБДРПоПодразделениям,
											СвойстваПроведения, 
											Отказ) Экспорт
	
	ТекстЗапроса =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Версия КАК Версия,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья КАК Статья,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент КАК Контрагент,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор КАК Договор,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта КАК Валюта,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура КАК Номенклатура,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сценарий КАК Сценарий,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	                 |	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) КАК Сумма,
	                 |	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
	                 |	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество) КАК Количество,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПериодАгрегации КАК ПериодАгрегации,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана
	                 |ИЗ
	                 |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	                 |			,
	                 |			Версия = &Версия
	                 |				И ПроектнаяЗадача В
	                 |					(ВЫБРАТЬ
	                 |						ВТ_ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	                 |					ИЗ
	                 |						ВТ_ПроектныеЗадачи КАК ВТ_ПроектныеЗадачи)
	                 |				И ИсточникПлана В (&ИсточникиПлана)) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Версия,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сценарий,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПериодАгрегации,
	                 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана";
	
	// Все источники,за исключением Трудозатрат.
	ИсточникиПлана = Новый Массив;
	ИсточникиПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ПустаяСсылка());
	ИсточникиПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты);
	ИсточникиПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
	ИсточникиПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты);
	ИсточникиПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.Объемы);
	
	ЗапросНеАктуализированных = Новый Запрос(ТекстЗапроса);
	ЗапросНеАктуализированных.МенеджерВременныхТаблиц = СвойстваПроведения.МВТ;
	ЗапросНеАктуализированных.УстановитьПараметр("Версия", СвойстваПроведения.текВерсия);
	ЗапросНеАктуализированных.УстановитьПараметр("ИсточникиПлана", ИсточникиПлана);
	
	ТаблицаНеАктуализированных = ЗапросНеАктуализированных.Выполнить().Выгрузить();
	
	ЗаполнитьРаспределениеВТаблицеДоходовРасходов(ТаблицаДвиженийПланБДРПоПодразделениям, 
		ТаблицаНеАктуализированных, ТаблицаСроковЗадач);
	
	КолонкиСуммы = Новый Соответствие;
	КолонкиСуммы.Вставить("Сумма", Истина);
	КолонкиСуммы.Вставить("СуммаВалютная", Истина);
	КолонкиСуммы.Вставить("Количество", Истина);
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДвиженийПланБДРПоПодразделениям, КолонкиСуммы);
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийПланБДРПоПодразделениям, , Ложь);
	
	// Зануление.
	
	МассивЗадач = ТаблицаНеАктуализированных.ВыгрузитьКолонку("ПроектнаяЗадача");
	
	ДанныеАктуализацииРегистра = Новый Структура("Регистратор, Период, МассивЗадач, ИмяРегистра",
		ЭтотОбъект.Ссылка, 
		упоРабочиеКалендариВызовСервера.обПолучитьМоментВремениДокумента(ЭтотОбъект), 
		МассивЗадач);
	УсловиеОтбора = "Версия = &Версия И НЕ ИсточникПлана = &ИсточникПлана";
	ПараметрОтбора = Новый Структура("Версия, ИсточникПлана", 
		СвойстваПроведения.текВерсия, Перечисления.упоИсточникПланаДоходовИРасходов.Трудозатраты);
	
	ДанныеАктуализацииРегистра.ИмяРегистра = "упоАктуальныеПланыДоходовИРасходовПодразделения";
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ТаблицаДвиженийПланБДРПоПодразделениям, ДанныеАктуализацииРегистра,,,
		УсловиеОтбора, ПараметрОтбора, Ложь);
	
КонецПроцедуры

// Актуализирует таблицу движений регистра упоАктуальныеПланыВыполненияОбъемов при актуализации
//  календарного плана проекта.
//
// Параметры:
//  ЭтотОбъект								 - ДокументОбъект	 - объект.
//  ДанныеДокумента							 - Структура		 - данные документа проведения.
//  ТаблицаСроковЗадач						 - ТаблицаЗначений	 - сроки задач.
//  СоответствиеСроковЗадач					 - Соответствие
//  ТаблицаДвиженийПланБДРПоПодразделениям	 - ТаблицаЗначений	 - исходная таблица с профилями.
//  СвойстваПроведения						 - Структура		 - содержит дополнительные настройки учета по подразделениям.
//  Отказ									 - Булево			 - признак отказа от проведения.
//
Процедура АктуализацияПлановыхОбъемов(ЭтотОбъект,
									  ДанныеДокумента,
									  ТаблицаСроковЗадач,
									  СоответствиеСроковЗадач,
									  ТаблицаДвиженийПланБДРПоПодразделениям,
									  СвойстваПроведения,
									  Отказ) Экспорт
	
	ТекстЗапроса =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Версия КАК Версия,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья КАК Статья,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема КАК ВидОбъема,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент КАК Контрагент,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор КАК Договор,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта КАК Валюта,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение КАК Подразделение,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль КАК Роль,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура КАК Номенклатура,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сценарий КАК Сценарий,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СпособПривязки КАК СпособПривязки,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	                |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК Сумма,
	                |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
	                |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК Количество
	                |ИЗ
	                |	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
	                |			,
	                |			Версия = &Версия
	                |				И ПроектнаяЗадача В
	                |					(ВЫБРАТЬ
	                |						ВТ_ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	                |					ИЗ
	                |						ВТ_ПроектныеЗадачи КАК ВТ_ПроектныеЗадачи)) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	                |ГДЕ
	                |	(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество <> 0
	                |			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная <> 0)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Версия,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сценарий,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СпособПривязки,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПрофильРаспределения,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик,
	                |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ИсточникПлана";
	
	ЗапросНеАктуализированных = Новый Запрос(ТекстЗапроса);
	ЗапросНеАктуализированных.МенеджерВременныхТаблиц = СвойстваПроведения.МВТ;
	ЗапросНеАктуализированных.УстановитьПараметр("Версия", СвойстваПроведения.текВерсия);
	
	Результат = ЗапросНеАктуализированных.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат; // Возврат
	КонецЕсли;
	
	ТаблицаНеАктуализированных = Результат.Выгрузить();
	
	Отбор = Новый Структура("СпособПривязки", Перечисления.упоСпособПривязкиДоходаРасхода.НаДату);
	ТаблицаНеАктуализированных_НаДату = ТаблицаНеАктуализированных.Скопировать(Отбор);
	
	Для Каждого СтрокаНеАктуализированных_НаДату Из ТаблицаНеАктуализированных_НаДату Цикл
		
		НоваяСтрока = ТаблицаДвиженийПланБДРПоПодразделениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеАктуализированных_НаДату);
		
	КонецЦикла;
	
	Отбор = Новый Структура("СпособПривязки", Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения);
	ТаблицаНеАктуализированных_ПоПрофилю = ТаблицаНеАктуализированных.Скопировать(Отбор);
	
	Для Каждого СтрокаНеАктуализированных_ПоПрофилю Из ТаблицаНеАктуализированных_ПоПрофилю Цикл
		
		НоваяСтрока =  ТаблицаДвиженийПланБДРПоПодразделениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеАктуализированных_ПоПрофилю);
		
		НоваяСтрока.Сумма = 0;
		НоваяСтрока.СуммаВалютная = 0;
		НоваяСтрока.Количество = 0;
		
	КонецЦикла;
	
	МассивИсключаемыхКолонок = Новый Массив;
	МассивИсключаемыхКолонок.Добавить("ДатаНачисления");
	МассивИсключаемыхКолонок.Добавить("Сумма");
	МассивИсключаемыхКолонок.Добавить("СуммаВалютная");
	МассивИсключаемыхКолонок.Добавить("Количество");
	
	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из ТаблицаНеАктуализированных_ПоПрофилю.Колонки Цикл
		Если МассивИсключаемыхКолонок.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	СтрокаКолонок = СтрСоединить(МассивКолонок, ",");
	
	КолонкиСуммированияСтрокой = "Сумма,СуммаВалютная,Количество";
	
	ТаблицаНеАктуализированных_ПоПрофилю.Свернуть(СтрокаКолонок, КолонкиСуммированияСтрокой);
		
	Для Каждого СтрокаНеАктуализированных_ПоПрофилю Из ТаблицаНеАктуализированных_ПоПрофилю Цикл
		
		Если ТипЗнч(ТаблицаСроковЗадач) = Тип("ТаблицаЗначений") Тогда
			
			СтрокаЗадача = ТаблицаСроковЗадач.Найти(СтрокаНеАктуализированных_ПоПрофилю.ПроектнаяЗадача, "Задача");
			
		Иначе 
			
			СтрокаЗадача = ТаблицаСроковЗадач[СтрокаНеАктуализированных_ПоПрофилю.ПроектнаяЗадача];
			
		КонецЕсли;
		
		Если СтрокаЗадача <> Неопределено Тогда
			
			ТаблицаРаспределенная = обРаспределитьДоходыИРасходыПоПрофилю(
				СтрокаНеАктуализированных_ПоПрофилю.ПрофильРаспределения, 
				СтрокаЗадача.Результат.ДатаНачала, 
				СтрокаЗадача.Результат.ДатаЗавершения, 
				СтрокаНеАктуализированных_ПоПрофилю.СуммаВалютная);
			
			Счетчик = 1;
			КоличествоРаспределенных = ТаблицаРаспределенная.Количество();
			ИтогПоКолву = 0;
			
			Для Каждого СтрокаРаспределенная Из ТаблицаРаспределенная Цикл
				
				НоваяСтрока = ТаблицаДвиженийПланБДРПоПодразделениям.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеАктуализированных_ПоПрофилю,, КолонкиСуммированияСтрокой);
				
				ДоляКоличества = СтрокаРаспределенная.Сумма 
					/ ?(СтрокаНеАктуализированных_ПоПрофилю.СуммаВалютная = 0, 1, СтрокаНеАктуализированных_ПоПрофилю.СуммаВалютная);
				
				НоваяСтрока.СуммаВалютная = СтрокаРаспределенная.Сумма;
				НоваяСтрока.ДатаНачисления = СтрокаРаспределенная.Период;
				
				Если Счетчик = КоличествоРаспределенных Тогда
					
					НоваяСтрока.Количество =  СтрокаНеАктуализированных_ПоПрофилю.Количество - ИтогПоКолву;
					
				Иначе
					
					НоваяСтрока.Количество = СтрокаНеАктуализированных_ПоПрофилю.Количество * ДоляКоличества;
					ИтогПоКолву = ИтогПоКолву + НоваяСтрока.Количество;
					
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КолонкиСуммы = Новый Соответствие;
	КолонкиСуммы.Вставить("Сумма", 			Истина);
	КолонкиСуммы.Вставить("СуммаВалютная", 	Истина);
	КолонкиСуммы.Вставить("Количество", 	Истина);
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДвиженийПланБДРПоПодразделениям, КолонкиСуммы);
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийПланБДРПоПодразделениям, , Ложь);
	
КонецПроцедуры

// Возвращает значение реквизита СобствСилы_Субподряд элемента справочника "Роли".
//
// Параметры: 
//	Роль - СправочникСсылка.упоРоли - роль.
//
// Возвращаемое значение:
//	СправочникСсылка.упоСобственныеСилыСубподряд - значение реквизита. 
Функция СССП_Роли(Роль) Экспорт
	
	СССП = Справочники.упоСобственныеСилыСубподряд.ПустаяСсылка();	
	Если ЗначениеЗаполнено(Роль) Тогда
		СССП = Роль.СобствСилы_Субподряд;
	КонецЕсли;
	
	Возврат СССП;
	
КонецФункции

// Получает стоимость номенклатуры по плановым данным.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - проектная задача.
//  Номенклатура	 - СправочникСсылка.Номенклатура 	 - номенклатура.
//  ВидЭлемента		 - Строка - "Доход" или "Расход".
//
// Возвращаемое значение:
//	Число - стоимость номенклатуры.
Функция ПолучитьСтоимостьНоменклатурыПоПлановымДанным(ПроектнаяЗадача, Номенклатура, ВидЭлемента = "Расход") Экспорт
	
	Стоимость = 0;
	
	ВходящиеДанныеЗаполнены = ЗначениеЗаполнено(ПроектнаяЗадача)
		И ЗначениеЗаполнено(Номенклатура);
	
	Если Не ВходящиеДанныеЗаполнены Тогда
		Возврат Стоимость; // Возврат
	КонецЕсли;
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДанныеПланов.Цена КАК Цена,
	               |	ДанныеПланов.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
	               |			,
	               |			Версия = &ТекВерсия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Номенклатура = &Номенклатура) КАК ДанныеПланов
	               |ГДЕ
	               |	(ДанныеПланов.Количество <> 0
	               |			ИЛИ ДанныеПланов.СуммаВалютная <> 0)
	               |	И ДанныеПланов.Цена > 0";

	Если ВидЭлемента = "Расход" Тогда
		ИмяРегистраДоход = "упоДанныеПлановВыпускаСубпродуктов";
		ИмяРегистраРасход = "упоДанныеПлановПотребностейМатериальныхРесурсов";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИмяРегистраДоход, ИмяРегистраРасход);
	КонецЕсли;
	
	ЗапросСтоимости = Новый Запрос(ТекстЗапроса);
	ЗапросСтоимости.УстановитьПараметр("ТекВерсия", 		ТекВерсия);
	ЗапросСтоимости.УстановитьПараметр("ПроектнаяЗадача", 	ПроектнаяЗадача);
	ЗапросСтоимости.УстановитьПараметр("Номенклатура", 		Номенклатура);
	
	Результат = ЗапросСтоимости.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Стоимость; // Возврат
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Стоимость = Выборка.Цена;
	
	Возврат Стоимость;
	
КонецФункции

// Процедура заполняет таблицу движений регистра упоАктуальныеПланыДоходовИРасходовПодразделения.
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект - объект.
//	ДанныеДвижений - Структура - содержит таблицы движений.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	СвойстваПроведения - Структура - содержит дополнительные настройки учета по подразделениям.
//	Отказ - Булево - признак отказа от проведения.
Процедура ЗаполнитьДвиженияПланДоходовИРасходов(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, Знач СвойстваПроведения,
	Отказ) Экспорт
	
	Перем ТаблицаДоходов, ТаблицаРасходов;
	
	ЭтоПроектнаяЗадача = ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.упоПроектнаяЗадача");		
	
	// Свойства проектной задачи используются при проведении одиночной ПЗ.
	СтрокаСвойствПроектнойЗадачи = "ВключитьМатРесурсыВПланРасходов, ВключитьДопЗатратыВПланРасходов, ВключитьСубпродуктыВПланДоходов";
	СвойстваЗадачи = Новый Структура(СтрокаСвойствПроектнойЗадачи);
	Если ЭтоПроектнаяЗадача Тогда
		СвойстваЗадачи = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектнойЗадачи(СвойстваПроведения.ПроектнаяЗадача, 
			СтрокаСвойствПроектнойЗадачи);
		СвойстваПроведения.Вставить("СвойстваЗадачи", СвойстваЗадачи);		
	КонецЕсли;			
	
	СвойстваПроведения.Вставить("СвойстваПроекта", СвойстваПроекта);	
	
	Если СвойстваПроекта.ДоходыПоПодразделениям = Ложь Тогда
		
		ТаблицаДоходов = ПолучитьТаблицуДвиженийДляЦелейУчетаПоПодразделениям(ЭтотОбъект, 
			"Доход", СвойстваПроведения, Ложь, Ложь, ЭтоПроектнаяЗадача);
		
	ИначеЕсли СвойстваПроекта.ДоходыПоПодразделениям = Истина
		И СвойстваПроекта.ДоходыПоОбъемам = Ложь 
		И СвойстваПроекта.ДоходыПоНатуральнымПоказателям = Ложь Тогда
		
		ТаблицаДоходов = ПолучитьТаблицуДвиженийДляЦелейУчетаПоПодразделениям(ЭтотОбъект, 
			"Доход", СвойстваПроведения, Истина, Ложь, ЭтоПроектнаяЗадача);
		
	ИначеЕсли СвойстваПроекта.ДоходыПоПодразделениям = Истина
		И СвойстваПроекта.ДоходыПоОбъемам = Истина 
		И СвойстваПроекта.ДоходыПоНатуральнымПоказателям = Ложь Тогда
		
		ТаблицаДоходов = ПолучитьТаблицуДвиженийДляЦелейУчетаПоПодразделениям(ЭтотОбъект,
			"Доход", СвойстваПроведения, Истина, Истина, ЭтоПроектнаяЗадача);
		
	ИначеЕсли СвойстваПроекта.ДоходыПоПодразделениям = Истина
		И СвойстваПроекта.ДоходыПоОбъемам = Истина 
		И СвойстваПроекта.ДоходыПоНатуральнымПоказателям = Истина Тогда
						
		ТаблицаДоходов = ПолучитьТаблицуДвиженийДляЦелейУчетаПоПодразделениям(ЭтотОбъект, 
			"Доход", СвойстваПроведения, СвойстваЗадачи.ВключитьСубпродуктыВПланДоходов, Истина, ЭтоПроектнаяЗадача);
		
	КонецЕсли;		
		
	ТаблицаРасходов = ПолучитьТаблицуДвиженийДляЦелейУчетаПоПодразделениям(ЭтотОбъект, 
		"Расход", СвойстваПроведения, Неопределено, СвойстваПроекта.РасходыПоНатуральнымПоказателям, ЭтоПроектнаяЗадача);		
		
	Для Каждого СтрокаТД Из ТаблицаДоходов Цикл
		
		НоваяСтрока = ДанныеДвижений.упоАктуальныеПланыДоходовИРасходовПодразделения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТД);
		
		Если СвойстваПроекта.ДоходыПоНатуральнымПоказателям = Ложь Тогда		
			НоваяСтрока.Количество = 0;			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТР Из ТаблицаРасходов Цикл
		
		НоваяСтрока = ДанныеДвижений.упоАктуальныеПланыДоходовИРасходовПодразделения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТР);
		
		Если СвойстваПроекта.РасходыПоНатуральнымПоказателям = Ложь Тогда			
			НоваяСтрока.Количество = 0;			
		КонецЕсли;
		
	КонецЦикла;
	
	// Зануление.
	
	ДанныеОбработки = Новый Структура ("Регистратор, Период, МассивЗадач, ИмяРегистра",
		ЭтотОбъект.Ссылка, , СвойстваПроведения.ПроектнаяЗадача, "упоАктуальныеПланыДоходовИРасходовПодразделения");
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений.упоАктуальныеПланыДоходовИРасходовПодразделения, ДанныеОбработки,,,
		"Версия = &Версия И ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты)", 
		Новый Структура("Версия", СвойстваПроведения.Версия), 
		Ложь);
	
КонецПроцедуры

// Процедура заполняет таблицу движений регистра упоАктуальныеПланыВыполненияОбъемов.
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект - объект.
//	ДанныеДвижений - Структура - содержит таблицы движений.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	СвойстваПроведения - Структура - содержит дополнительные настройки учета по подразделениям.
//	Отказ - Булево - признак отказа от проведения.
Процедура ЗаполнитьДвиженияПлановыеОбъемы(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения,
	Отказ) Экспорт
			
	ТаблицаДвижений = ДанныеДвижений.упоАктуальныеПланыВыполненияОбъемов.СкопироватьКолонки();
	
	ЭтоПроектнаяЗадача = ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.упоПроектнаяЗадача");		
		
	Если ЭтоПроектнаяЗадача Тогда
		СрокиЗадачи = Новый Структура("ДатаНачала, ДатаЗавершения", СвойстваПроведения.НачДата, СвойстваПроведения.КонДата);
		СрокиЗадач = Новый Соответствие;
		СрокиЗадач.Вставить(ЭтотОбъект.Ссылка, Новый Структура("Результат", СрокиЗадачи));	
	Иначе
		СрокиЗадач = СвойстваПроведения.СрокиЗадач;		
	КонецЕсли;	
	
	// Доходы.
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
	Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательДоходов);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Неопределено", Неопределено);
	
	Если ЭтоПроектнаяЗадача Тогда
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);		
	Иначе	
		Запрос.УстановитьПараметр("СписокЗадач", СвойстваПроведения.ПроектнаяЗадача);
	КонецЕсли;	
	
	Если СвойстваПроекта.ДоходыПоПодразделениям И СвойстваПроекта.ДоходыПоОбъемам Тогда
		
		Если Не СвойстваПроекта.ДоходыПоНатуральнымПоказателям Тогда			
			// Движения по данным ТЧ "План доходов".			
			Если ЭтоПроектнаяЗадача Тогда 
				
				ТаблицаРаспределениеДоходовПоПериодам = ЭтотОбъект.РаспределениеДоходовПоПериодам;
				ТаблицаПланДоходов = ЭтотОбъект.ПланДоходов;
				ТаблицаРаспределениеДоходов = ЭтотОбъект.РаспределениеДоходов;
				
				Запрос.УстановитьПараметр("ТаблицаПланДоходов", ТаблицаПланДоходов);				
				Запрос.УстановитьПараметр("ТаблицаРаспределениеДоходов", ТаблицаРаспределениеДоходов);
				Запрос.УстановитьПараметр("ТаблицаРаспределениеДоходовПоПериодам", ТаблицаРаспределениеДоходовПоПериодам);
			
				ТекстЗапроса = ТекстДоходыПоОбъемам_ДанныеДокумента();
			Иначе
				ТекстЗапроса = ТекстДоходыПоОбъемам_ДанныеРегистров();
			КонецЕсли;										
		Иначе	
		    // Движения по данным ТЧ "Субпродукты".
			Если ЭтоПроектнаяЗадача Тогда 
				
				ТаблицаРаспределениеДоходовПоПериодам = ЭтотОбъект.РаспределениеДоходовПоПериодам;
				ТаблицаРаспределениеОбъемов = ЭтотОбъект.РаспределениеОбъемов;
				ТаблицаСубпродукты = ЭтотОбъект.Субпродукты;
				
				Запрос.УстановитьПараметр("ТаблицаРаспределениеОбъемов", ТаблицаРаспределениеОбъемов);
				Запрос.УстановитьПараметр("ТаблицаСубпродукты", ТаблицаСубпродукты);
				Запрос.УстановитьПараметр("ТаблицаРаспределениеДоходовПоПериодам", ТаблицаРаспределениеДоходовПоПериодам);
				Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.Объемы);
		
				ТекстЗапроса = ТекстДоходыПоНатуральнымПоказателям_ДанныеДокумента();
			Иначе
				ТекстЗапроса = ТекстДоходыПоНатуральнымПоказателям_ДанныеРегистров();
			КонецЕсли;																					
		КонецЕсли;	
		
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();		
		ЗаполнитьТаблицуДвиженийАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(ТаблицаДвижений, РезультатЗапроса, СрокиЗадач);
		
	КонецЕсли;
	
	// Расходы.
	
	Запрос = Новый Запрос;
	
	Если ЭтоПроектнаяЗадача Тогда
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Иначе	
		Запрос.УстановитьПараметр("СписокЗадач", СвойстваПроведения.ПроектнаяЗадача);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
	Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательРасходов);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("КонтрагентЗатрат", СвойстваПроведения.КонтрагентЗатрат);
	Запрос.УстановитьПараметр("ДоговорЗатрат",СвойстваПроведения.ДоговорЗатрат);
	
	Если СвойстваПроекта.РасходыПоПодразделениям И СвойстваПроекта.РасходыПоОбъемам Тогда
		
		Если НЕ СвойстваПроекта.РасходыПоНатуральнымПоказателям Тогда
		
			Если ЭтоПроектнаяЗадача Тогда 
				
				ТаблицаРаспределениеРасходовПоПериодам = ЭтотОбъект.РаспределениеРасходовПоПериодам;
				ТаблицаПланРасходов = ЭтотОбъект.ПланРасходов;
				ТаблицаРаспределениеРасходов = ЭтотОбъект.РаспределениеРасходов;
				
				Запрос.УстановитьПараметр("ТаблицаРаспределениеРасходовПоПериодам",ТаблицаРаспределениеРасходовПоПериодам);	
				Запрос.УстановитьПараметр("ТаблицаПланРасходов", ТаблицаПланРасходов);
				Запрос.УстановитьПараметр("ТаблицаРаспределениеРасходов", ТаблицаРаспределениеРасходов);
	
				ТекстЗапроса = ТекстРасходыПоОбъемам_ДанныеДокумента();
			Иначе
				ТекстЗапроса = ТекстРасходыПоОбъемам_ДанныеРегистров();
			КонецЕсли;
		    Запрос.Текст = ТекстЗапроса;
							  		
			Запрос.УстановитьПараметр("РасходыПоОбъемам",  СвойстваПроекта.РасходыПоОбъемам);
			Запрос.УстановитьПараметр("Неопределено",  Неопределено);	
			
			РезультатЗапроса = Запрос.Выполнить();		
			ЗаполнитьТаблицуДвиженийАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(ТаблицаДвижений, РезультатЗапроса, СрокиЗадач);
			
		КонецЕсли;	
	
		//////// Данные трансляции ////////
		
		Если ЭтоПроектнаяЗадача Тогда
			ВключитьДопЗатратыВПланРасходов = ЭтотОбъект.ВключитьДопЗатратыВПланРасходов;
			ВключитьМатРесурсыВПланРасходов = ЭтотОбъект.ВключитьМатРесурсыВПланРасходов;
		Иначе	
			// Флаги включения выставляем для попадания в условия, задачи отбираются в МВТ.
			ВключитьДопЗатратыВПланРасходов = Истина;	
			ВключитьМатРесурсыВПланРасходов = Истина;
			
			МВТ = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьМатРесурсыВПланРасходов КАК ВключитьМатРесурсыВПланРасходов,
			               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьДопЗатратыВПланРасходов КАК ВключитьДопЗатратыВПланРасходов
			               |ПОМЕСТИТЬ ВТ_ЗадачиТрансляции
			               |ИЗ
			               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ПроектнаяЗадача";
			Запрос.МенеджерВременныхТаблиц = МВТ;
			Запрос.Выполнить();
		КонецЕсли;	
		
		Если ВключитьДопЗатратыВПланРасходов И НЕ СвойстваПроекта.РасходыПоНатуральнымПоказателям Тогда
				
			Если ЭтоПроектнаяЗадача Тогда
				
				ТаблицаРаспределениеРасходовПоПериодам = ЭтотОбъект.РаспределениеРасходовПоПериодам;
				ТаблицаДополнительныеЗатраты = ЭтотОбъект.ДополнительныеЗатраты;
				ТаблицаРаспределениеДополнительныхЗатрат = ЭтотОбъект.РаспределениеДополнительныхЗатрат;
				
				Запрос.УстановитьПараметр("ТаблицаРаспределениеРасходовПоПериодам",ТаблицаРаспределениеРасходовПоПериодам);	
				Запрос.УстановитьПараметр("ТаблицаДополнительныеЗатраты", ТаблицаДополнительныеЗатраты);
				Запрос.УстановитьПараметр("ТаблицаРаспределениеДополнительныхЗатрат", ТаблицаРаспределениеДополнительныхЗатрат);
			
				ТекстЗапроса = ТекстРасходыТрансляцияДопзатрат_ДанныеДокумента();
			Иначе
				ТекстЗапроса = ТекстРасходыТрансляцияДопзатрат_ДанныеРегистров();
			КонецЕсли;
			
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("РасходыПоОбъемам",  СвойстваПроекта.РасходыПоОбъемам);
			Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
			Запрос.УстановитьПараметр("ИсточникПлана",  Перечисления.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты);
			Запрос.УстановитьПараметр("Неопределено",  Неопределено);
					
			РезультатЗапроса = Запрос.Выполнить();
			ЗаполнитьТаблицуДвиженийАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(ТаблицаДвижений, РезультатЗапроса, СрокиЗадач);
			
		КонецЕсли;
	
		Если ВключитьМатРесурсыВПланРасходов Или СвойстваПроекта.РасходыПоНатуральнымПоказателям Тогда
			
			Если ЭтоПроектнаяЗадача Тогда
				
				ТаблицаРаспределениеРасходовПоПериодам = ЭтотОбъект.РаспределениеРасходовПоПериодам;
				ТаблицаМатериальныеРесурсы = ЭтотОбъект.МатериальныеРесурсы;
				ТаблицаРаспределениеПотребностей = ЭтотОбъект.РаспределениеПотребностей;
				
				Запрос.УстановитьПараметр("ТаблицаРаспределениеРасходовПоПериодам",ТаблицаРаспределениеРасходовПоПериодам);	
				Запрос.УстановитьПараметр("ТаблицаМатериальныеРесурсы", ТаблицаМатериальныеРесурсы);
				Запрос.УстановитьПараметр("ТаблицаРаспределениеПотребностей", ТаблицаРаспределениеПотребностей);	
				
				ТекстЗапроса = ТекстРасходыПоНатуральнымПоказателям_ДанныеДокумента();
			Иначе
				ТекстЗапроса = ТекстРасходыПоНатуральнымПоказателям_ДанныеРегистров();
			КонецЕсли;
			
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям",  СвойстваПроекта.РасходыПоНатуральнымПоказателям);
			Запрос.УстановитьПараметр("РасходыПоОбъемам",  СвойстваПроекта.РасходыПоОбъемам);
			Запрос.УстановитьПараметр("ИсточникПлана",  Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты);
			Запрос.УстановитьПараметр("Неопределено",  Неопределено);			
			
			РезультатЗапроса = Запрос.Выполнить();
			ЗаполнитьТаблицуДвиженийАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(ТаблицаДвижений, РезультатЗапроса, СрокиЗадач);
			
		КонецЕсли;
		
	КонецЕсли;	
				
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвижений);
	
	Для Каждого СтрокаДвижений Из ТаблицаДвижений Цикл		
		НоваяСтрока = ДанныеДвижений.упоАктуальныеПланыВыполненияОбъемов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижений);		
	КонецЦикла;
			
	ДанныеОбработки = Новый Структура("Регистратор, Период, МассивЗадач, ИмяРегистра",
		ЭтотОбъект.Ссылка, 
		, 
		СвойстваПроведения.ПроектнаяЗадача, 
		"упоАктуальныеПланыВыполненияОбъемов");		
	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений.упоАктуальныеПланыВыполненияОбъемов, ДанныеОбработки,,,
		"Версия = &Версия", 
		Новый Структура("Версия", СвойстваПроведения.Версия), 
		Ложь);
					
КонецПроцедуры

#Область  ПроверкаЗаполненияОбъектов
	
// Добавляет наличие строк распределения в таблицах распределения доходных и расходных объемов
//  и доп.затрат. При отсутствии добавляет строки распределения и заполняет по умолчанию.
//
// Параметры:
//  ЭтотОбъект							 - ДокументОбъект, УправляемаяФорма	 - объект.
//  ДополнительныеПараметрыРаспределения - Ссруктура						 - настройки распределения.
//  СвойстваПроекта						 - Структура						 - содержит настройки учета по подразделениям.
//  ТаблицыПроверки						 - Неопределено, Структура			 - содержит перечень таблиц проверки.
//  Отказ								 - Булево							 - признак отказа от проведения.
//
Процедура ПроверитьЗаполнитьТабличныеЧастиРаспределений(ЭтотОбъект, ДополнительныеПараметрыРаспределения, СвойстваПроекта = Неопределено, 
	ТаблицыПроверки = Неопределено, Отказ) Экспорт		
	
	Если СвойстваПроекта = Неопределено Тогда
		СвойстваПроекта = ЗаполнитьПараметрыУчетаПоПодразделениям(ЭтотОбъект.Проект);	
	КонецЕсли;	
	
	СтруктураСвойствПоУмолчанию = ПолучитьЗначенияДляПодстановкиПоУмолчанию(ЭтотОбъект.Проект);							
			
	ПроверитьЗаполнитьРаспределениеОбъемов(ЭтотОбъект, ДополнительныеПараметрыРаспределения, СвойстваПроекта,
		СтруктураСвойствПоУмолчанию, ТаблицыПроверки, Отказ);
		
	Если ДополнительныеПараметрыРаспределения.Свойство("ПроверятьРаспределениеДопЗатрат") 
		И ДополнительныеПараметрыРаспределения.ПроверятьРаспределениеДопЗатрат Тогда
		ПроверитьЗаполнитьРаспределениеДопЗатрат(ЭтотОбъект, СвойстваПроекта, СтруктураСвойствПоУмолчанию, Отказ);
	КонецЕсли;	
	
КонецПроцедуры	
// Заполнение распределения в таблице доходов расходов.
//
// Параметры:
//  ТаблицаДвиженийПланБДРПоПодразделениям	 - ТаблицаЗначений	 - исходная таблица с профилями.
//  ТаблицаНеАктуализированных				 - ТаблицаЗначений	 - таблица для актуализации.
//  ТаблицаСроковЗадач						 - ТаблицаЗначений	 - сроки задач
//
Процедура ЗаполнитьРаспределениеВТаблицеДоходовРасходов(ТаблицаДвиженийПланБДРПоПодразделениям, 
	ТаблицаНеАктуализированных, ТаблицаСроковЗадач) Экспорт
	
	Для Каждого СтрокаНеАктуализированных Из ТаблицаНеАктуализированных Цикл
		
		Если СтрокаНеАктуализированных.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.НаДату Тогда
			
			НоваяСтрока = ТаблицаДвиженийПланБДРПоПодразделениям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеАктуализированных);
			
		ИначеЕсли СтрокаНеАктуализированных.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно Тогда
			
			Если ТипЗнч(ТаблицаСроковЗадач) = Тип("ТаблицаЗначений") Тогда 				
				СтрокаЗадача = ТаблицаСроковЗадач.Найти(СтрокаНеАктуализированных.ПроектнаяЗадача, "Задача");
			Иначе 				
				СтрокаЗадача =  ТаблицаСроковЗадач[СтрокаНеАктуализированных.ПроектнаяЗадача];
			КонецЕсли;		  
			
			Если СтрокаЗадача <> Неопределено Тогда
				
				Если ТипЗнч(ТаблицаСроковЗадач) = Тип("ТаблицаЗначений") Тогда
					РезультатРасчета = СтрокаЗадача;
				Иначе 
					РезультатРасчета = СтрокаЗадача.Результат;  					
				КонецЕсли;
				
				ТаблицаРаспределенная = упоРаспределениеТрудозатратВызовСервера.ПолучитьТаблицуРаспределенияПоПериодамСводно(
					СтрокаНеАктуализированных.ПериодАгрегации, 
					РезультатРасчета.ДатаЗавершения, 
					СтрокаНеАктуализированных.СуммаВалютная); 
				
				Для Каждого СтрокаРаспределенная Из ТаблицаРаспределенная Цикл
					
					НоваяСтрока = ТаблицаДвиженийПланБДРПоПодразделениям.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеАктуализированных);
					НоваяСтрока.СуммаВалютная = СтрокаРаспределенная.Сумма;
					НоваяСтрока.ДатаНачисления = СтрокаРаспределенная.Период;
					
				КонецЦикла;
				
			КонецЕсли;				
			
		ИначеЕсли СтрокаНеАктуализированных.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения Тогда
			
			Если ТипЗнч(ТаблицаСроковЗадач) = Тип("ТаблицаЗначений") Тогда 				
				СтрокаЗадача = ТаблицаСроковЗадач.Найти(СтрокаНеАктуализированных.ПроектнаяЗадача, "Задача");
			Иначе 				
				СтрокаЗадача =  ТаблицаСроковЗадач[СтрокаНеАктуализированных.ПроектнаяЗадача];
			КонецЕсли;		  
			
			Если СтрокаЗадача <> Неопределено Тогда
				
				Если ТипЗнч(ТаблицаСроковЗадач) = Тип("ТаблицаЗначений") Тогда
					РезультатРасчета = СтрокаЗадача;
				Иначе 
					РезультатРасчета = СтрокаЗадача.Результат;  					
				КонецЕсли;
				
				ТаблицаРаспределенная = обРаспределитьДоходыИРасходыПоПрофилю(
				СтрокаНеАктуализированных.ПрофильРаспределения, 
				РезультатРасчета.ДатаНачала, 
				РезультатРасчета.ДатаЗавершения, 
				СтрокаНеАктуализированных.СуммаВалютная);
				
				Счетчик = 1;
				КоличествоРаспределенных = ТаблицаРаспределенная.Количество();
				ИтогПоКолву = 0;
				
				Для Каждого СтрокаРаспределенная Из ТаблицаРаспределенная Цикл
					
					НоваяСтрока = ТаблицаДвиженийПланБДРПоПодразделениям.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеАктуализированных,,"Сумма, СуммаВалютная, Количество"); 
					Если СтрокаНеАктуализированных.СуммаВалютная = 0 Тогда
						ДоляКоличества = 0;	
					Иначе
						ДоляКоличества = СтрокаРаспределенная.Сумма/СтрокаНеАктуализированных.СуммаВалютная;
					КонецЕсли;
					
					НоваяСтрока.СуммаВалютная = СтрокаРаспределенная.Сумма;
					НоваяСтрока.ДатаНачисления = СтрокаРаспределенная.Период;
					
					Если Счетчик = КоличествоРаспределенных Тогда
						
						НоваяСтрока.Количество =  СтрокаНеАктуализированных.Количество - ИтогПоКолву;
						
					Иначе
						
						НоваяСтрока.Количество = СтрокаНеАктуализированных.Количество * ДоляКоличества;
						ИтогПоКолву = ИтогПоКолву + НоваяСтрока.Количество;
						
					КонецЕсли;
					
					Счетчик = Счетчик + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока =  ТаблицаДвиженийПланБДРПоПодразделениям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеАктуализированных);
							
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверка заполнения способа привязки и связанных с ним реквизитов в табличных частях распределения.
// В т.ч. проверяется распределение по периодам.
//
// Параметры:
//  ЭтотОбъект		 - ДокументОбъект, СправочникОбъект - объект.
//  ПроверяемыеТЧ	 - СписокЗначений 					- содержит перечень таблиц проверки. 
//  Отказ			 - Булево    						- признак отказа от проведения.
//  СвойстваПроекта	 - Неопределено, Структура			- содержит настройки учета по подразделениям (для проектной задачи).
//
Процедура ПроверитьЗаполнениеТабличныхЧастей(ЭтотОбъект, ПроверяемыеТЧ, Отказ, СвойстваПроекта = Неопределено) Экспорт

	Для Каждого ПроверяемаяТЧ Из ПроверяемыеТЧ Цикл
		
		ИмяТаблицыРаспределения = ПроверяемаяТЧ.Значение;
		
		НадоФормироватьНомерПодчиненнойСтрокиДляСобщения = 
			НадоФормироватьНомерПодчиненнойСтрокиДляСобщения(ИмяТаблицыРаспределения);
		Если НадоФормироватьНомерПодчиненнойСтрокиДляСобщения Тогда
			СоответствиеНомераСтрок = Новый Соответствие;
		КонецЕсли;
		
		Для каждого стрПроверяемойТЧ Из ЭтотОбъект[ИмяТаблицыРаспределения] Цикл
			
			// Способ привязки
			упоПроектыИЗадачиОбщие.ПроверитьЗаполнениеСпособаПривязки(ЭтотОбъект, стрПроверяемойТЧ, ИмяТаблицыРаспределения, 
				ПроверяемаяТЧ.Представление, Отказ);
			
			// Распределение по периодам
			НомерСтрокиДляСообщения = НомерСтрокиДляСообщения(стрПроверяемойТЧ, СоответствиеНомераСтрок, 
				НадоФормироватьНомерПодчиненнойСтрокиДляСобщения);
                
            ИмяКолонкиСпособПривязки = "СпособПривязки";               
                
            Если ПроверяемаяТЧ.Значение = "ДополнительныеЗатраты" Тогда
                ИмяКолонкиСпособПривязки = "СпособПривязкиДоходовРасходов";	
            КонецЕсли; 
            
            ПроверитьЗаполнениеРаспределенияПоПериодам(ЭтотОбъект, СвойстваПроекта, стрПроверяемойТЧ, ПроверяемаяТЧ, 
				ИмяКолонкиСпособПривязки, НомерСтрокиДляСообщения, Отказ);
			
		КонецЦикла;
			
	КонецЦикла;
		
КонецПроцедуры

// Формировние параметров для проверки распределения по периодам и вызов метода проверки распределния по периодам.
//
// Параметры:
//  ЭтотОбъект		 		 - ДокументОбъект, СправочникОбъект - объект. 
//  СвойстваПроекта			 - Неопределено, Структура			- содержит настройки учета по подразделениям (для проектной задачи). 
//  СтрокаРаспределения		 - ДокументТабличнаяЧастьСтрока 	- Строка табличной части.
//  ПроверяемаяТЧ			 - ЭлементСпискаЗначений			- Проверяемая табличная часть.
//  ИмяКолонкиСпособПривязки - Строка	 						- Имя колонки способа привязки.
//  НомерСтрокиДляСообщения	 - Число							- Номер строки для сообщения.
//  Отказ					 - Булево 							- признак отказа от проведения. 
//
Процедура ПроверитьЗаполнениеРаспределенияПоПериодам(ЭтотОбъект, СвойстваПроекта, СтрокаРаспределения, ПроверяемаяТЧ, 
        ИмяКолонкиСпособПривязки, НомерСтрокиДляСообщения, Отказ)
        
	Если Не СтрокаРаспределения[ИмяКолонкиСпособПривязки] = Перечисления.упоСпособПривязкиРаспределения.Вручную Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыРаспределения = ПроверяемаяТЧ.Значение;
	ИсточникПлана = Неопределено;
	
	ПараметрыПроверки = Новый Структура();
	ПараметрыПроверки.Вставить("ПроверяемаяТЧ", ПроверяемаяТЧ);
	ПараметрыПроверки.Вставить("СтрокаТЧ", СтрокаРаспределения);
	ПараметрыПроверки.Вставить("ИмяИндексаТаблицыПоПериодам", "ИндексСтрокиРаспределениеПоРолям");
	ПараметрыПроверки.Вставить("НомерСтроки", НомерСтрокиДляСообщения);
	
	ЭтоПроектнаяЗадача = ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоПроектнаяЗадача");

	Если ИмяТаблицыРаспределения = "ТрудовыеРесурсы" Тогда
		
		ПараметрыПроверки.Вставить("ИмяПроверяемойТЧПоПериодам", ИмяТаблицыРаспределения + "ПоПериодам");
		
		ПроверятьСумму = Ложь;
		ПроверятьКоличество = Истина;
	
	ИначеЕсли ИмяТаблицыРаспределения = "РаспределениеРасходов" Тогда
		
		ПараметрыПроверки.Вставить("ИмяИндексаТаблицыПоПериодам", "ИндексСтрокиРаспределенияРасходов");
		ПараметрыПроверки.Вставить("ИмяПроверяемойТЧПоПериодам", ИмяТаблицыРаспределения + "ПоПериодам");
		ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы;
		
		ПроверятьСумму = Истина;
		ПроверятьКоличество = Ложь;
		
	ИначеЕсли ИмяТаблицыРаспределения = "РаспределениеПотребностей" Тогда
		
		ПараметрыПроверки.Вставить("ИмяПроверяемойТЧПоПериодам", "РаспределениеРасходовПоПериодам");
		ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты;
		
		ПроверятьСумму = Ложь;
		ПроверятьКоличество = Ложь;
		Если ЗначениеЗаполнено(СвойстваПроекта) Тогда			
			Если СвойстваПроекта.РасходыПоНатуральнымПоказателям 
				Или (СвойстваПроекта.РасходыПоОбъемам И ЭтотОбъект.ВключитьМатРесурсыВПланРасходов) Тогда
				ПроверятьСумму = Истина;
				ПроверятьКоличество = Истина;
			КонецЕсли;
		Иначе
			ПроверятьСумму = Истина;
			ПроверятьКоличество = Истина;
		КонецЕсли;
	
	ИначеЕсли ИмяТаблицыРаспределения = "РаспределениеОбъемов"  Тогда
		
		ПараметрыПроверки.Вставить("ИмяПроверяемойТЧПоПериодам", "РаспределениеДоходовПоПериодам");
		
		// Проверка на источник плана добавляется только для проектной задачи, 
		// т.к. в шаблонах в распределении объемов источник плана не заполняется.
		Если ЭтоПроектнаяЗадача Тогда
			ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.Объемы;
		КонецЕсли;
	
		ПроверятьСумму = Истина;
		ПроверятьКоличество = Истина;
		
	ИначеЕсли ИмяТаблицыРаспределения = "РаспределениеДоходов" Тогда
		
		ПараметрыПроверки.Вставить("ИмяИндексаТаблицыПоПериодам", "ИндексСтрокиРаспределенияДоходов");
		ПараметрыПроверки.Вставить("ИмяПроверяемойТЧПоПериодам", "РаспределениеДоходовПоПериодам");
		ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы;
		
		ПроверятьСумму = Истина;
		ПроверятьКоличество = Ложь;
		
	ИначеЕсли ИмяТаблицыРаспределения = "РаспределениеДополнительныхЗатрат" Тогда
		
		ПараметрыПроверки.Вставить("ИмяПроверяемойТЧПоПериодам", "РаспределениеРасходовПоПериодам");
		ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты;
		
		ПроверятьСумму = Ложь;
		ПроверятьКоличество = Ложь;
		Если ЗначениеЗаполнено(СвойстваПроекта) Тогда			
			Если Не СвойстваПроекта.РасходыПоНатуральнымПоказателям 
				И СвойстваПроекта.РасходыПоОбъемам И ЭтотОбъект.ВключитьДопЗатратыВПланРасходов Тогда
				ПроверятьСумму = Истина;
			КонецЕсли;
		Иначе
			ПроверятьСумму = Истина;
		КонецЕсли;
	
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсточникПлана) Тогда
		ПараметрыПроверки.Вставить("ИсточникПлана", ИсточникПлана);			
	КонецЕсли;
	
	ПроверитьРаспределениеПоПериодамПоСтроке(ЭтотОбъект, ПараметрыПроверки, ПроверятьСумму, ПроверятьКоличество, Отказ);
	
КонецПроцедуры

// Проверяет распределение по периодам по строке.
//
// Параметры:
//  ЭтотОбъект		  - ДокументОбъект, СправочникОбъект - объект. 
//  ПараметрыПроверки - Структура:		
//   	* ИмяИндексаТаблицыПоПериодам	- Строка.
//      * ИмяПроверяемойТЧПоПериодам	- Строка.
//      * ИсточникПлана 				- ПеречислениеСсылка.
//      * НомерСтроки					- Число.
//      * ПроверяемаяТЧ 				- ЭлементСпискаЗначений.
//      * СтрокаТЧ 						- ДокументТабличнаяЧастьСтрока.
//  ПроверятьСумму		 - Булево	 	- признак нужно ли проверять сумму. 
//  ПроверятьКоличество	 - Булево	 	- признак нужно ли проверять количество.
//  Отказ				 - Булево	 	- признак отказа от проведения. 
//
Процедура ПроверитьРаспределениеПоПериодамПоСтроке(ЭтотОбъект, ПараметрыПроверки, ПроверятьСумму, ПроверятьКоличество, Отказ)
	
	СтрокаТЧ = ПараметрыПроверки.СтрокаТЧ;
	ПроверяемаяТЧ = ПараметрыПроверки.ПроверяемаяТЧ;
	ИндексСтрокиРаспределения = СтрокаТЧ.ИндексСтрокРаспределенияПоПериодам;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить(ПараметрыПроверки.ИмяИндексаТаблицыПоПериодам, ИндексСтрокиРаспределения);
	Если ПараметрыПроверки.Свойство("ИсточникПлана") И ЗначениеЗаполнено(ПараметрыПроверки.ИсточникПлана) Тогда
		ПараметрыОтбора.Вставить("ИсточникПлана", ПараметрыПроверки.ИсточникПлана);
	КонецЕсли;	
	ТЗСОтбором = ЭтотОбъект[ПараметрыПроверки.ИмяПроверяемойТЧПоПериодам].Выгрузить(ПараметрыОтбора);
	
	Если ПараметрыПроверки.ИмяПроверяемойТЧПоПериодам = "ТрудовыеРесурсыПоПериодам" Тогда
		МассивСтрокПоУровнюПланирования = ЭтотОбъект["ТрудовыеРесурсы"].НайтиСтроки(
			Новый Структура("УровеньПланирования", СтрокаТЧ.УровеньПланирования));	
		НомерСтрокиДляСообщения = МассивСтрокПоУровнюПланирования.Найти(СтрокаТЧ) + 1;
		Если СтрокаТЧ.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный Тогда
			ТекстУровеньПланирования = НСтр("ru = 'для уровня планирования ""Предварительный""'");
		Иначе
			ТекстУровеньПланирования = НСтр("ru = 'для уровня планирования ""Окончательный""'");	
		КонецЕсли;	
	Иначе
		НомерСтрокиДляСообщения = ПараметрыПроверки.НомерСтроки;
		ТекстУровеньПланирования = "";
	КонецЕсли; 
	
	Если ПроверятьСумму Тогда
		
		СуммаРаспределенное = ТЗСОтбором.Итог("Сумма");
		
		Если СуммаРаспределенное <> СтрокаТЧ.Сумма Тогда
			Если ПроверятьКоличество Тогда
				КолвоРаспределенное = ТЗСОтбором.Итог("Количество");
				Если КолвоРаспределенное <> СтрокаТЧ.Количество Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'В строке №%1 табличной части ""%2"" %3 сумма и количество, распределенные по месяцам, не соответствуют общей сумме и общему количеству.'"),
									НомерСтрокиДляСообщения, ПроверяемаяТЧ.Представление, ТекстУровеньПланирования);
				Иначе
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'В строке №%1 табличной части ""%2"" %3 сумма, распределенная по месяцам, не соответствует общей сумме.'"),
									НомерСтрокиДляСообщения, ПроверяемаяТЧ.Представление, ТекстУровеньПланирования);					
				КонецЕсли;
			Иначе	
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'В строке №%1 табличной части ""%2"" %3 сумма, распределенная по месяцам, не соответствует общей сумме.'"),
									НомерСтрокиДляСообщения, ПроверяемаяТЧ.Представление, ТекстУровеньПланирования);
			КонецЕсли;	
			СформироватьСообщениеПользователю(ЭтотОбъект, ТекстСообщения, ПроверяемаяТЧ.Значение, СтрокаТЧ, "Сумма", Отказ);
		КонецЕсли;
		
	ИначеЕсли ПроверятьКоличество Тогда
		
		КолвоРаспределенное = ТЗСОтбором.Итог("Количество");
		
	 	Если КолвоРаспределенное <> СтрокаТЧ.Количество Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'В строке №%1 табличной части ""%2"" %3 количество, распределенное по месяцам, не соответствует общему количеству.'"),
								НомерСтрокиДляСообщения, ПроверяемаяТЧ.Представление, ТекстУровеньПланирования);
			СформироватьСообщениеПользователю(ЭтотОбъект, ТекстСообщения, ПроверяемаяТЧ.Значение, СтрокаТЧ, "Количество", Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует структуру настроек учета по подразделениям для проекта.
//
// Возвращаемое значение:
//	Структура – содержит настройки по подразделениям.
Функция ПолучитьСтруктуруСвойствУчета() Экспорт
	
	СтруктураСвойств = Новый Структура;
	
	СтруктураСвойств.Вставить("ВедетсяБюджетДоходов", Ложь);	
	СтруктураСвойств.Вставить("ДоходыПоПодразделениям", Ложь);
	СтруктураСвойств.Вставить("ДоходыПоОбъемам", Ложь);	
	СтруктураСвойств.Вставить("ДоходыПоНатуральнымПоказателям", Ложь);
	
	СтруктураСвойств.Вставить("ВедетсяБюджетРасходов", Ложь);	
	СтруктураСвойств.Вставить("РасходыПоПодразделениям", Ложь);
	СтруктураСвойств.Вставить("РасходыПоОбъемам", Ложь);
	СтруктураСвойств.Вставить("РасходыПоНатуральнымПоказателям", Ложь);
	
	СтруктураСвойств.Вставить("НастройкаРаспределенияБДР", Справочники.упоНастройкиРаспределенияБДР.ПустаяСсылка());
	
	СтруктураСвойств.Вставить("ПланироватьТрудозатратыПоРолям", Ложь);	
	СтруктураСвойств.Вставить("ВыделятьНаВыполнениеРаботРесурсы", Ложь);
	СтруктураСвойств.Вставить("ПланироватьТрудозатратыПоПроекту", Ложь);   
	СтруктураСвойств.Вставить("УказыватьПодразделениеРолиПриПланированииТР", Ложь);
	СтруктураСвойств.Вставить("ПланироватьЗатратыНаМатериалы", Ложь);
	СтруктураСвойств.Вставить("ПланироватьДополнительныеЗатратыПоЗадаче", Ложь);
	СтруктураСвойств.Вставить("ИспользоватьАналитикуКонтрагентДляСС", Ложь);	
	СтруктураСвойств.Вставить("РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи", Ложь);
	
	СтруктураСвойств.Вставить("ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF", Ложь);
	
	СтруктураСвойств.Вставить("ВедетсяБюджетДвиженияДенежныхСредств", Ложь);
	
	СтруктураСвойств.Вставить("РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен", Ложь);
	СтруктураСвойств.Вставить("РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден", Ложь);
	
	СтруктураСвойств.Вставить("НастройкаПоказателейДляКарточкиПроектов", Неопределено);
	
	СтруктураСвойств.Вставить("ЗапретитьРПЗИзменятьСрокиЧужихЗадач", Ложь);
    
	СтруктураСвойств.Вставить("РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам", Ложь);
	
	СтруктураСвойств.Вставить("НормаСтоимостиТрудовыхРесурсов", Справочники.упоНормыСтоимости.ПустаяСсылка());
	СтруктураСвойств.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", Справочники.упоНормыСтоимости.ПустаяСсылка());
	СтруктураСвойств.Вставить("НастройкаДереваКлючевыхПоказателей", Справочники.упоНастройкиДереваКлючевыхПоказателей.ПустаяСсылка());
	
	СтруктураСвойств.Вставить("НастройкаУровняПланированияПриРасчетеГотовностиПроектов", Неопределено);
	
	СтруктураСвойств.Вставить("УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат", Ложь); 
	СтруктураСвойств.Вставить("НаследоватьЗначениеПоляОбъектИзЗадачиРодителя", Ложь);
	СтруктураСвойств.Вставить("НазначатьРСПОсновнойРолиКакРПЗ", Ложь);
	СтруктураСвойств.Вставить("УстанавливатьПризнакОсновнаяПриДобавленииРоли", Ложь);
	СтруктураСвойств.Вставить("ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки", Ложь);
	  	  
	Возврат СтруктураСвойств;
	
КонецФункции

// Формирует общую (из констант) структуру настоек учета по подразделениям.
//
// Возвращаемое значение:
//	Структура – содержит настройки по подразделениям.
Функция ПолучитьСвойстваУчетаПоУмолчанию() Экспорт
	
	СтруктураСвойств = ПолучитьСтруктуруСвойствУчета();
	
	СтруктураСвойств.ВедетсяБюджетДоходов = Константы.упоВедетсяБюджетДоходов.Получить();	
	СтруктураСвойств.ДоходыПоПодразделениям = Константы.упоДоходыПоПодразделениям.Получить();
	СтруктураСвойств.ДоходыПоОбъемам = Константы.упоДоходыПоОбъемам.Получить();	
	СтруктураСвойств.ДоходыПоНатуральнымПоказателям = Константы.упоДоходыПоНатуральнымПоказателям.Получить();
	
	СтруктураСвойств.ВедетсяБюджетРасходов = Константы.упоВедетсяБюджетРасходов.Получить();	
	СтруктураСвойств.РасходыПоПодразделениям = Константы.упоРасходыПоПодразделениям.Получить();
	СтруктураСвойств.РасходыПоОбъемам = Константы.упоРасходыПоОбъемам.Получить();
	СтруктураСвойств.РасходыПоНатуральнымПоказателям = Константы.упоРасходыПоНатуральнымПоказателям.Получить();
	
	СтруктураСвойств.НастройкаРаспределенияБДР = Константы.упоНастройкаРаспределенияБДРПоУмолчанию.Получить();
	
	СтруктураСвойств.ПланироватьТрудозатратыПоРолям = Ложь;	
	СтруктураСвойств.ВыделятьНаВыполнениеРаботРесурсы = Ложь;
	СтруктураСвойств.ПланироватьТрудозатратыПоПроекту = Константы.упоПланироватьТрудозатратыПоПроекту.Получить();
	СтруктураСвойств.УказыватьПодразделениеРолиПриПланированииТР = 
		Константы.упоУказыватьПодразделениеРолиПриПланированииТР.Получить();
	СтруктураСвойств.ПланироватьЗатратыНаМатериалы = Константы.упоПланироватьЗатратыНаМатериалы.Получить();
	СтруктураСвойств.ПланироватьДополнительныеЗатратыПоЗадаче = Константы.упоПланироватьДополнительныеЗатратыПоЗадаче.Получить();
	СтруктураСвойств.ИспользоватьАналитикуКонтрагентДляСС = Константы.упоИспользоватьАналитикуКонтрагентДляСС.Получить();			
	
	СтруктураСвойств.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи = Константы.упоРазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи.Получить();
	
	СтруктураСвойств.ИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF = Константы.упоИспользоватьЗначенияДляПроектныхЗадачВРасчетахСПоказателямиGGF.Получить();
	
	СтруктураСвойств.ВедетсяБюджетДвиженияДенежныхСредств = Константы.упоВедетсяБюджетДвиженияДенежныхСредств.Получить();
	
	СтруктураСвойств.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен = Константы.упоРазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен.Получить();
	СтруктураСвойств.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден = Константы.упоРазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден.Получить();
	
	СтруктураСвойств.НормаСтоимостиТрудовыхРесурсов = Константы.упоНормаСтоимостиПоУмолчанию.Получить();
	СтруктураСвойств.ВнешняяНормаСтоимостиТрудовыхРесурсов = Константы.упоНормаСтоимостиПоУмолчаниюВнешняя.Получить();
	СтруктураСвойств.НастройкаДереваКлючевыхПоказателей = Константы.упоНастройкаДереваКлючевыхПоказателей.Получить();
	
	упоНастройкаПоказателейДляКарточкиПроектов = Константы.упоНастройкаПоказателейДляКарточкиПроектов.Получить(); 
	Адрес = ПоместитьВоВременноеХранилище(упоНастройкаПоказателейДляКарточкиПроектов);
	СтруктураСвойств.НастройкаПоказателейДляКарточкиПроектов = Адрес;
	
	СтруктураСвойств.НастройкаУровняПланированияПриРасчетеГотовностиПроектов = Константы.упоНастройкаУровняПланированияПриРасчетеГотовностиПроектов.Получить(); 
	СтруктураСвойств.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат = Константы.упоУчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат.Получить(); 
	СтруктураСвойств.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя = Константы.упоНаследоватьЗначениеПоляОбъектИзЗадачиРодителя.Получить(); 

	СтруктураСвойств.ЗапретитьРПЗИзменятьСрокиЧужихЗадач = Константы.упоЗапретитьРПЗИзменятьСрокиЧужихЗадач.Получить();
    
	СтруктураСвойств.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам = Константы.упоРассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам.Получить();
	
	СтруктураСвойств.НазначатьРСПОсновнойРолиКакРПЗ = Константы.упоНазначатьРСПОсновнойРолиКакРПЗ.Получить();
	СтруктураСвойств.УстанавливатьПризнакОсновнаяПриДобавленииРоли = Константы.упоУстанавливатьПризнакОсновнаяПриДобавленииРоли.Получить();
	СтруктураСвойств.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки =
		Константы.упоХранитьВВерсияхПроцентыГотовСтатусыИФактСроки.Получить();
	
	СтруктураСвойств.Вставить("ИспользоватьЗаказыКлиентов", Ложь);
	СтруктураСвойств.Вставить("ИспользоватьЗаказыПоставщикам", Ложь);
	Если упоИнтеграцияКлиентСервер.ИнтеграцияСЗаказамиПоставщикамКлиентам() Тогда
		СтруктураСвойств.ИспользоватьЗаказыКлиентов = 
			упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
		СтруктураСвойств.ИспользоватьЗаказыПоставщикам = 
			упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам");
	КонецЕсли;
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Процедура заполняет таблицу движений регистра упоФактДоходовИРасходовОбороты.
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект - объект.
//	ДанныеДвижений - Структура - содержит таблицы движений.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	СвойстваПроведения - Структура - содержит дополнительные настройки учета по подразделениям.
//	Отказ - Булево - признак отказа от проведения.
Процедура ЗаполнитьДвиженияДоходыРасходы(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ)
	
	Перем ТаблицаДоходов, ТаблицаРасходов, ТекстЗапроса;
	
	Запрос = Новый Запрос;
	
	ТипОбъекта = ТипЗнч(ЭтотОбъект);
	Если ТипОбъекта = Тип("ДокументОбъект.упоРегистрацияФактическихДоходовИРасходов")
		Или ТипОбъекта = Тип("ДокументОбъект.упоРегистрацияФактическихЗатратМатРесурсов") Тогда
	
		// Доходы.
		Если  СвойстваПроекта.ДоходыПоПодразделениям = Ложь Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК ТекущаяВерсия,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Договор КАК Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Валюта КАК Валюта,
			               |	СУММА(упоРегистрацияФактическихДоходовИРасходовДоходы.Сумма) КАК Сумма,
			               |	СУММА(упоРегистрацияФактическихДоходовИРасходовДоходы.Сумма) КАК СуммаВалютная,
			               |	0 КАК Количество,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Статья КАК Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ДатаНачисления КАК Период
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихДоходовИРасходов.Доходы КАК упоРегистрацияФактическихДоходовИРасходовДоходы
			               |ГДЕ
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ДатаНачисления";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
			ТаблицаДоходов = Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли  СвойстваПроекта.ДоходыПоПодразделениям = Истина Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение КАК Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ КАК Номенклатура,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Договор КАК Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Валюта КАК Валюта,
			               |	СУММА(ВЫБОР
			               |			КОГДА &ДоходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Количество, упоРегистрацияФактическихДоходовИРасходовДоходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоРегистрацияФактическихДоходовИРасходовДоходы.Сумма)) КАК Сумма,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоРегистрацияФактическихДоходовИРасходовДоходы.Сумма)) КАК СуммаВалютная,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ДатаНачисления КАК Период,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Статья КАК Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихДоходовИРасходов.Доходы КАК упоРегистрацияФактическихДоходовИРасходовДоходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическихДоходовИРасходов.РаспределениеДоходов КАК упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов
			               |		ПО упоРегистрацияФактическихДоходовИРасходовДоходы.Ссылка = упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Ссылка
			               |			И упоРегистрацияФактическихДоходовИРасходовДоходы.ИндексСтрокРаспределения = упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Роль,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ДатаНачисления,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ПодразделениеПоУмолчанию", СвойстваПроведения.ПодразделениеДоходов);
			Запрос.УстановитьПараметр("РольПоУмолчанию", СвойстваПроведения.РольДоходов);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательДоходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
			
			ТаблицаДоходов = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
		Если ТаблицаДоходов <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДоходов);
			
			Для Каждого СтрокаДоходов Из ТаблицаДоходов Цикл
				НоваяСтрока = ДанныеДвижений.упоФактДоходовИРасходовОбороты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоходов);
			КонецЦикла;
			
		КонецЕсли;
		
		ТекстЗапроса = Неопределено;
		
		Если  СвойстваПроекта.РасходыПоПодразделениям = Ложь Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК ТекущаяВерсия,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор КАК Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта КАК Валюта,
			               |	СУММА(упоРегистрацияФактическихДоходовИРасходовРасходы.Сумма) КАК Сумма,
			               |	СУММА(упоРегистрацияФактическихДоходовИРасходовРасходы.Сумма) КАК СуммаВалютная,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления КАК Период,
			               |	0 КАК Количество,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья КАК Статья
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихДоходовИРасходов.Расходы КАК упоРегистрацияФактическихДоходовИРасходовРасходы
			               |ГДЕ
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	&ТекущаяВерсия,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка.ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход),
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	СУММА(упоРегистрацияФактическихДоходовИРасходовРасходы.ОбщСтоимость),
			               |	СУММА(упоРегистрацияФактическихДоходовИРасходовРасходы.ОбщСтоимость),
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления,
			               |	0,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихЗатратМатРесурсов.ЗатратыМатРесурсовФакт КАК упоРегистрацияФактическихДоходовИРасходовРасходы
			               |ГДЕ
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка.ПроектнаяЗадача,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
			ТаблицаРасходов = Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли  СвойстваПроекта.РасходыПоПодразделениям = Истина Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение КАК Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ КАК Номенклатура,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор КАК Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта КАК Валюта,
			               |	СУММА(ВЫБОР
			               |			КОГДА &РасходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Количество, упоРегистрацияФактическихДоходовИРасходовРасходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоРегистрацияФактическихДоходовИРасходовРасходы.Сумма)) КАК Сумма,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоРегистрацияФактическихДоходовИРасходовРасходы.Сумма)) КАК СуммаВалютная,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления КАК Период,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья КАК Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент КАК КонтрагентПодрядчик,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихДоходовИРасходов.Расходы КАК упоРегистрацияФактическихДоходовИРасходовРасходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическихДоходовИРасходов.РаспределениеРасходов КАК упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов
			               |		ПО упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка = упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Ссылка
			               |			И упоРегистрацияФактическихДоходовИРасходовРасходы.ИндексСтрокРаспределения = упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Роль,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	&ТекущаяВерсия,
			               |	ТаблицаВладелец.Ссылка.ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход),
			               |	ТаблицаРаспределения.Подразделение,
			               |	ТаблицаРаспределения.Роль,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА ТаблицаВладелец.Ресурс
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА ТаблицаВладелец.ЕдиницаНормирования
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ТаблицаВладелец.Контрагент,
			               |	ТаблицаВладелец.Договор,
			               |	ТаблицаВладелец.Валюта,
			               |	СУММА(ВЫБОР
			               |			КОГДА &РасходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(ТаблицаРаспределения.Количество, ТаблицаВладелец.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ),
			               |	СУММА(ЕСТЬNULL(ТаблицаРаспределения.Сумма, ТаблицаВладелец.ОбщСтоимость)),
			               |	СУММА(ЕСТЬNULL(ТаблицаРаспределения.Сумма, ТаблицаВладелец.ОбщСтоимость)),
			               |	ТаблицаВладелец.ДатаНачисления,
			               |	ТаблицаВладелец.Статья,
			               |	ТаблицаВладелец.Договор,
			               |	ТаблицаВладелец.Контрагент,
			               |	ТаблицаРаспределения.СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихЗатратМатРесурсов.ЗатратыМатРесурсовФакт КАК ТаблицаВладелец
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическихЗатратМатРесурсов.РаспределениеЗатрат КАК ТаблицаРаспределения
			               |		ПО ТаблицаВладелец.Ссылка = ТаблицаРаспределения.Ссылка
			               |			И ТаблицаВладелец.ИндексСтрокРаспределения = ТаблицаРаспределения.ИндексСтрокиВладельца
			               |ГДЕ
			               |	ТаблицаВладелец.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ТаблицаВладелец.Ссылка.ПроектнаяЗадача,
			               |	ТаблицаРаспределения.Подразделение,
			               |	ТаблицаРаспределения.Роль,
			               |	ТаблицаВладелец.Контрагент,
			               |	ТаблицаВладелец.Договор,
			               |	ТаблицаВладелец.Валюта,
			               |	ТаблицаВладелец.ДатаНачисления,
			               |	ТаблицаВладелец.Статья,
			               |	ТаблицаРаспределения.СобствСилы_Субподряд,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА ТаблицаВладелец.Ресурс
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА ТаблицаВладелец.ЕдиницаНормирования
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ТаблицаВладелец.Договор,
			               |	ТаблицаВладелец.Контрагент";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
			
			ТаблицаРасходов = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
		Если ТаблицаРасходов <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаРасходов);
			
			Для Каждого СтрокаРасходов Из ТаблицаРасходов Цикл
				НоваяСтрока = ДанныеДвижений.упоФактДоходовИРасходовОбороты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасходов);
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.упоСинхронизацияФактическихДоходовИРасходов") Тогда
		
		// Доходы.
		Если СвойстваПроекта.ДоходыПоПодразделениям = Ложь Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК ТекущаяВерсия,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Договор КАК Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Валюта КАК Валюта,
			               |	СУММА(упоСинхронизацияФактическихДоходовИРасходовДоходы.Сумма) КАК Сумма,
			               |	СУММА(упоСинхронизацияФактическихДоходовИРасходовДоходы.Сумма) КАК СуммаВалютная,
			               |	0 КАК Количество,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Статья КАК Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ДатаНачисления КАК Период
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическихДоходовИРасходов.Доходы КАК упоСинхронизацияФактическихДоходовИРасходовДоходы
			               |ГДЕ
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическихДоходовИРасходовДоходы.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ДатаНачисления";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			
			ТаблицаДоходов = Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли  СвойстваПроекта.ДоходыПоПодразделениям = Истина Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ КАК Номенклатура,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Договор КАК Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Валюта КАК Валюта,
			               |	СУММА(ВЫБОР
			               |			КОГДА &ДоходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Количество, упоСинхронизацияФактическихДоходовИРасходовДоходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовДоходы.Сумма)) КАК Сумма,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовДоходы.Сумма)) КАК СуммаВалютная,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ДатаНачисления КАК Период,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Статья КАК Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическихДоходовИРасходов.Доходы КАК упоСинхронизацияФактическихДоходовИРасходовДоходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоСинхронизацияФактическихДоходовИРасходов.РаспределениеДоходов КАК упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов
			               |		ПО упоСинхронизацияФактическихДоходовИРасходовДоходы.Ссылка = упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Ссылка
			               |			И упоСинхронизацияФактическихДоходовИРасходовДоходы.ИндексСтрокРаспределения = упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическихДоходовИРасходовДоходы.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Роль,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ДатаНачисления,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ПодразделениеПоУмолчанию", СвойстваПроведения.ПодразделениеДоходов);
			Запрос.УстановитьПараметр("РольПоУмолчанию", СвойстваПроведения.РольДоходов);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательДоходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			
			ТаблицаДоходов = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
		Если ТаблицаДоходов <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДоходов);
			
			ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, 
				"НомерДокумента, ДатаДокумента, СсылкаНаРегистратор, ИсточникДанных");
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НомерДокумента", ДанныеПервичногоДокумента.НомерДокумента);
			СтруктураПараметров.Вставить("ДатаДокумента", ДанныеПервичногоДокумента.ДатаДокумента);
			СтруктураПараметров.Вставить("СсылкаНаДокумент", ДанныеПервичногоДокумента.СсылкаНаРегистратор);
			СтруктураПараметров.Вставить("ИсточникДанных", ДанныеПервичногоДокумента.ИсточникДанных);
			КлючАналитики = Справочники.упоКлючиАналитикиФактаБДР.НайтиСоздатьКлючАналитики(СтруктураПараметров);
			
			Для Каждого СтрокаДоходов Из ТаблицаДоходов Цикл
				НоваяСтрока = ДанныеДвижений.упоФактДоходовИРасходовОбороты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоходов);
				НоваяСтрока.КлючАналитики = КлючАналитики;
			КонецЦикла;
			
		КонецЕсли;
		
		// Расходы.
		Если СвойстваПроекта.РасходыПоПодразделениям = Ложь Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК ТекущаяВерсия,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор КАК Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Валюта КАК Валюта,
			               |	СУММА(упоСинхронизацияФактическихДоходовИРасходовРасходы.Сумма) КАК Сумма,
			               |	СУММА(упоСинхронизацияФактическихДоходовИРасходовРасходы.Сумма) КАК СуммаВалютная,
			               |	0 КАК Количество,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Статья КАК Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ДатаНачисления КАК Период
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическихДоходовИРасходов.Расходы КАК упоСинхронизацияФактическихДоходовИРасходовРасходы
			               |ГДЕ
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическихДоходовИРасходовРасходы.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ДатаНачисления";
			
			Запрос.Текст = ТекстЗапроса;			   
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			
			ТаблицаРасходов = Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли СвойстваПроекта.РасходыПоПодразделениям = Истина Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ КАК Номенклатура,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор КАК Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Валюта КАК Валюта,
			               |	СУММА(ВЫБОР
			               |			КОГДА &РасходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Количество, упоСинхронизацияФактическихДоходовИРасходовРасходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовРасходы.Сумма)) КАК Сумма,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовРасходы.Сумма)) КАК СуммаВалютная,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ДатаНачисления КАК Период,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Статья КАК Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент КАК КонтрагентПодрядчик,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическихДоходовИРасходов.Расходы КАК упоСинхронизацияФактическихДоходовИРасходовРасходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоСинхронизацияФактическихДоходовИРасходов.РаспределениеРасходов КАК упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов
			               |		ПО упоСинхронизацияФактическихДоходовИРасходовРасходы.Ссылка = упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Ссылка
			               |			И упоСинхронизацияФактическихДоходовИРасходовРасходы.ИндексСтрокРаспределения = упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическихДоходовИРасходовРасходы.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Роль,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ДатаНачисления,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			               |	КОНЕЦ";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			
			ТаблицаРасходов = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
		Если ТаблицаРасходов <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаРасходов);
			
			ДанныеПервичногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, 
				"НомерДокумента, ДатаДокумента, СсылкаНаРегистратор, ИсточникДанных");
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НомерДокумента", ДанныеПервичногоДокумента.НомерДокумента);
			СтруктураПараметров.Вставить("ДатаДокумента", ДанныеПервичногоДокумента.ДатаДокумента);
			СтруктураПараметров.Вставить("СсылкаНаДокумент", ДанныеПервичногоДокумента.СсылкаНаРегистратор);
			СтруктураПараметров.Вставить("ИсточникДанных", ДанныеПервичногоДокумента.ИсточникДанных);
			КлючАналитики = Справочники.упоКлючиАналитикиФактаБДР.НайтиСоздатьКлючАналитики(СтруктураПараметров);
			
			Для Каждого СтрокаРасходов Из ТаблицаРасходов Цикл
				НоваяСтрока = ДанныеДвижений.упоФактДоходовИРасходовОбороты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасходов);
				НоваяСтрока.КлючАналитики = КлючАналитики;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет таблицу движений регистра упоВыполненныеПринятыеОбъемы.
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект - объект.
//	ДанныеДвижений - Структура - содержит таблицы движений.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	СвойстваПроведения - Структура - содержит дополнительные настройки учета по подразделениям.
//	Отказ - Булево - признак отказа от проведения.
Процедура ЗаполнитьДвиженияВыполненныеПринятыеОбъемы(ЭтотОбъект,
													 ДанныеДвижений,
													 СвойстваПроекта,
													 СвойстваПроведения,
													 Отказ)
	
	Перем ТаблицаДвиженийДоход, ТаблицаДвиженийРасход, ТекстЗапроса;
	Запрос  = Новый запрос;
	
	Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоРегистрацияФактическиВыполненногоОбъема")  Тогда
		
		Если СвойстваПроекта.ДоходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоРегистрацияФактическиВыполненногоОбъема.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Договор КАК Договор,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Валюта КАК Валюта,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Подразделение КАК Подразделение,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Сумма, упоРегистрацияФактическиВыполненногоОбъема.Сумма)) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &ДоходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Количество, упоРегистрацияФактическиВыполненногоОбъема.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоРегистрацияФактическиВыполненногоОбъема.ДатаПоступления КАК Период,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Сумма, упоРегистрацияФактическиВыполненногоОбъема.Сумма)) КАК СуммаВалютная,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Статья КАК Статья,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.КонтрагентПодрядчик КАК КонтрагентПодрядчик
			               |ИЗ
			               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.ДоходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъема
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическиВыполненногоОбъема.РаспределениеДоходныхОбъемов КАК упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов
			               |		ПО упоРегистрацияФактическиВыполненногоОбъема.Ссылка = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Ссылка
			               |			И упоРегистрацияФактическиВыполненногоОбъема.ИндексСтрокРаспределения = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоРегистрацияФактическиВыполненногоОбъема.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическиВыполненногоОбъема.ПроектнаяЗадача,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Контрагент,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Договор,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Валюта,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Подразделение,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Роль,
			               |	упоРегистрацияФактическиВыполненногоОбъема.ДатаПоступления,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Статья,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.СобствСилы_Субподряд,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.ЗаказДоговорПодрядчика,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.КонтрагентПодрядчик,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ";
			
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательДоходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
			
			Запрос.УстановитьПараметр("КонтрагентЗатрат", СвойстваПроведения.КонтрагентЗатрат);
			Запрос.УстановитьПараметр("ДоговорЗатрат", СвойстваПроведения.ДоговорЗатрат);
			
			ТаблицаДвиженийДоход = Запрос.Выполнить().Выгрузить();  
			
		КонецЕсли;
		
		Если ТаблицаДвиженийДоход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийДоход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийДоход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ТекстЗапроса = Неопределено;
		
		Если СвойстваПроекта.РасходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоРегистрацияФактическиВыполненногоОбъема.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Договор КАК Договор,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Валюта КАК Валюта,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Подразделение КАК Подразделение,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Сумма, упоРегистрацияФактическиВыполненногоОбъема.Сумма)) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &РасходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Количество, упоРегистрацияФактическиВыполненногоОбъема.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоРегистрацияФактическиВыполненногоОбъема.ДатаПоступления КАК Период,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Сумма, упоРегистрацияФактическиВыполненногоОбъема.Сумма)) КАК СуммаВалютная,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Статья КАК Статья,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Контрагент КАК КонтрагентПодрядчик,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.РасходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъема
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическиВыполненногоОбъема.РаспределениеРасходныхОбъемов КАК упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов
			               |		ПО упоРегистрацияФактическиВыполненногоОбъема.Ссылка = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Ссылка
			               |			И упоРегистрацияФактическиВыполненногоОбъема.ИндексСтрокРаспределения = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоРегистрацияФактическиВыполненногоОбъема.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическиВыполненногоОбъема.ПроектнаяЗадача,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Контрагент,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Договор,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Валюта,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Подразделение,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Роль,
			               |	упоРегистрацияФактическиВыполненногоОбъема.ДатаПоступления,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Статья,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Договор,
			               |	упоРегистрацияФактическиВыполненногоОбъема.Контрагент,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.СобствСилы_Субподряд,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъема.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ";
			
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательРасходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
			
			Запрос.УстановитьПараметр("КонтрагентЗатрат", СвойстваПроведения.КонтрагентЗатрат);
			Запрос.УстановитьПараметр("ДоговорЗатрат", СвойстваПроведения.ДоговорЗатрат);
			
			ТаблицаДвиженийРасход = Запрос.Выполнить().Выгрузить();  
			
		КонецЕсли;
		
		Если ТаблицаДвиженийРасход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийРасход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийРасход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоСинхронизацияФактическиВыполненныхОбъемов") Тогда	
		
		Если СвойстваПроекта.ДоходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Договор КАК Договор,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Валюта КАК Валюта,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Сумма) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &ДоходыПоНатуральнымПоказателям
			               |				ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Количество
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ДатаПоступления КАК Период,
			               |	СУММА(упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Сумма) КАК СуммаВалютная,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Статья КАК Статья,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.КонтрагентПодрядчик КАК КонтрагентПодрядчик
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическиВыполненныхОбъемов.ДоходныеОбъемы КАК упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы
			               |ГДЕ
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Контрагент,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Договор,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Валюта,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Подразделение,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Роль,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ДатаПоступления,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Статья,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.СобствСилы_Субподряд,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЗаказДоговорПодрядчика,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.КонтрагентПодрядчик,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ";
			
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательДоходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
			
			Запрос.УстановитьПараметр("КонтрагентЗатрат", СвойстваПроведения.КонтрагентЗатрат);
			Запрос.УстановитьПараметр("ДоговорЗатрат", СвойстваПроведения.ДоговорЗатрат);
			
			ТаблицаДвиженийДоход = Запрос.Выполнить().Выгрузить();  
			
		КонецЕсли;
		
		Если ТаблицаДвиженийДоход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийДоход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийДоход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ТекстЗапроса = Неопределено;
		
		Если СвойстваПроекта.РасходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Договор КАК Договор,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Валюта КАК Валюта,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Сумма) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &РасходыПоНатуральнымПоказателям
			               |				ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Количество
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ДатаПоступления КАК Период,
			               |	СУММА(упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Сумма) КАК СуммаВалютная,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Статья КАК Статья,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Контрагент КАК КонтрагентПодрядчик,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическиВыполненныхОбъемов.РасходныеОбъемы КАК упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы
			               |ГДЕ
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ПроектнаяЗадача.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Контрагент,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Договор,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Валюта,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Подразделение,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Роль,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ДатаПоступления,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Статья,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Договор,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Контрагент,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.СобствСилы_Субподряд,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ЕдиницаИзмерения
			               |		ИНАЧЕ &ЕдиницаИзмеренияПоУмолчанию
			               |	КОНЕЦ";
			
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательРасходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
			
			Запрос.УстановитьПараметр("КонтрагентЗатрат", СвойстваПроведения.КонтрагентЗатрат);
			Запрос.УстановитьПараметр("ДоговорЗатрат", СвойстваПроведения.ДоговорЗатрат);
			
			ТаблицаДвиженийРасход = Запрос.Выполнить().Выгрузить();  
			
		КонецЕсли;
		
		Если ТаблицаДвиженийРасход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийРасход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийРасход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЭтотОбъект) = тип("ДокументОбъект.упоРегистрацияФактическихДоходовИРасходов") Тогда
		
		Если СвойстваПроекта.ДоходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Договор КАК Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Валюта КАК Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение КАК Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоРегистрацияФактическихДоходовИРасходовДоходы.Сумма)) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &ДоходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Количество, упоРегистрацияФактическихДоходовИРасходовДоходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ДатаНачисления КАК Период,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоРегистрацияФактическихДоходовИРасходовДоходы.Сумма)) КАК СуммаВалютная,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Статья КАК Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихДоходовИРасходов.Доходы КАК упоРегистрацияФактическихДоходовИРасходовДоходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическихДоходовИРасходов.РаспределениеДоходов КАК упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов
			               |		ПО упоРегистрацияФактическихДоходовИРасходовДоходы.Ссылка = упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Ссылка
			               |			И упоРегистрацияФактическихДоходовИРасходовДоходы.ИндексСтрокРаспределения = упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.Роль,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.ДатаНачисления,
			               |	упоРегистрацияФактическихДоходовИРасходовДоходы.Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ";
			
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательДоходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
			
			ТаблицаДвиженийДоход = Запрос.Выполнить().Выгрузить();  
			
		КонецЕсли;
		
		Если ТаблицаДвиженийДоход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийДоход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийДоход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ТекстЗапроса = Неопределено;
		
		Если СвойстваПроекта.РасходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор КАК Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта КАК Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение КАК Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоРегистрацияФактическихДоходовИРасходовРасходы.Сумма)) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &РасходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Количество, упоРегистрацияФактическихДоходовИРасходовРасходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления КАК Период,
			               |	СУММА(ЕСТЬNULL(упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоРегистрацияФактическихДоходовИРасходовРасходы.Сумма)) КАК СуммаВалютная,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья КАК Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент КАК КонтрагентПодрядчик,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоРегистрацияФактическихДоходовИРасходов.Расходы КАК упоРегистрацияФактическихДоходовИРасходовРасходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическихДоходовИРасходов.РаспределениеРасходов КАК упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов
			               |		ПО упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка = упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Ссылка
			               |			И упоРегистрацияФактическихДоходовИРасходовРасходы.ИндексСтрокРаспределения = упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.Роль,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.ДатаНачисления,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Статья,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоРегистрацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоРегистрацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоРегистрацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ";
		
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательРасходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
			
			ТаблицаДвиженийРасход = Запрос.Выполнить().Выгрузить();  
			
		КонецЕсли;
		
		Если ТаблицаДвиженийРасход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийРасход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийРасход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоСинхронизацияФактическихДоходовИРасходов") Тогда
		
		Если СвойстваПроекта.ДоходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Договор КАК Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Валюта КАК Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовДоходы.Сумма)) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &ДоходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Количество, упоСинхронизацияФактическихДоходовИРасходовДоходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ДатаНачисления КАК Период,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовДоходы.Сумма)) КАК СуммаВалютная,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Статья КАК Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическихДоходовИРасходов.Доходы КАК упоСинхронизацияФактическихДоходовИРасходовДоходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоСинхронизацияФактическихДоходовИРасходов.РаспределениеДоходов КАК упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов
			               |		ПО упоСинхронизацияФактическихДоходовИРасходовДоходы.Ссылка = упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Ссылка
			               |			И упоСинхронизацияФактическихДоходовИРасходовДоходы.ИндексСтрокРаспределения = упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическихДоходовИРасходовДоходы.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.Роль,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.ДатаНачисления,
			               |	упоСинхронизацияФактическихДоходовИРасходовДоходы.Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.СобствСилы_Субподряд,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.ЗаказДоговорПодрядчика,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеДоходов.КонтрагентПодрядчик,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовДоходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ";
			
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательДоходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			
			ТаблицаДвиженийДоход = Запрос.Выполнить().Выгрузить();  
			
		КонецЕсли;
		
		Если ТаблицаДвиженийДоход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийДоход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийДоход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ТекстЗапроса = Неопределено;
		
		Если СвойстваПроекта.РасходыПоОбъемам Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор КАК Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Валюта КАК Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК Номенклатура,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовРасходы.Сумма)) КАК Сумма,
			               |	СУММА(ВЫБОР
			               |			КОГДА &РасходыПоНатуральнымПоказателям
			               |				ТОГДА ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Количество, упоСинхронизацияФактическихДоходовИРасходовРасходы.Количество)
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Количество,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ДатаНачисления КАК Период,
			               |	СУММА(ЕСТЬNULL(упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Сумма, упоСинхронизацияФактическихДоходовИРасходовРасходы.Сумма)) КАК СуммаВалютная,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Статья КАК Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент КАК КонтрагентПодрядчик,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическихДоходовИРасходов.Расходы КАК упоСинхронизацияФактическихДоходовИРасходовРасходы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоСинхронизацияФактическихДоходовИРасходов.РаспределениеРасходов КАК упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов
			               |		ПО упоСинхронизацияФактическихДоходовИРасходовРасходы.Ссылка = упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Ссылка
			               |			И упоСинхронизацияФактическихДоходовИРасходовРасходы.ИндексСтрокРаспределения = упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическихДоходовИРасходовРасходы.Проект = &Проект
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ПроектнаяЗадача,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Валюта,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Подразделение,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.Роль,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.ДатаНачисления,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Статья,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Договор,
			               |	упоСинхронизацияФактическихДоходовИРасходовРасходы.Контрагент,
			               |	упоСинхронизацияФактическихДоходовИРасходовРаспределениеРасходов.СобствСилы_Субподряд,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.Номенклатура
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическихДоходовИРасходовРасходы.ЕдиницаИзмерения
			               |		ИНАЧЕ &НоменклатураПоУмолчанию
			               |	КОНЕЦ";
			
		КонецЕсли;
		
		Если ТекстЗапроса <> Неопределено Тогда
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
			Запрос.УстановитьПараметр("НоменклатураПоУмолчанию", СвойстваПроведения.НатуральныйПоказательРасходов);
			Запрос.УстановитьПараметр("ЕдиницаИзмеренияПоУмолчанию", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
			Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
			Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
			
			ТаблицаДвиженийРасход = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
		Если ТаблицаДвиженийРасход <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийРасход);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДвиженийРасход Цикл
				
				НоваяСтрока = ДанныеДвижений.упоВыполненныеПринятыеОбъемы.Добавить();
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

// Процедура заполняет таблицу движений регистра упоФактВыполненияОбъемовОбороты.
//
// Параметры:
//	ЭтотОбъект - ДокументОбъект - объект.
//	ДанныеДвижений - Структура - содержит таблицы движений.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	СвойстваПроведения - Структура - содержит дополнительные настройки учета по подразделениям.
//	Отказ - Булево - признак отказа от проведения.
Процедура ЗаполнитьДвиженияФактическиеОбъемы(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ)
	
	Перем ТаблицаДоходныхОбъемов, ТаблицаРасходныхОбъемов, ТекстЗапроса;
	
	Запрос = Новый Запрос;
	ИмяДокумента = ЭтотОбъект.Метаданные().Имя;
	
	Если СвойстваПроекта.ДоходыПоОбъемам Тогда
		
		Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоРегистрацияФактическиВыполненногоОбъема") Тогда
		
			ТекстЗапроса = "ВЫБРАТЬ
		               |	&ТекущаяВерсия КАК Версия,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ПроектнаяЗадача,
		               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Контрагент,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Договор,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Валюта,
		               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Подразделение,
		               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Роль,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура КАК Номенклатура,
		               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Сумма,
		               |	ВЫБОР
		               |		КОГДА &ДоходыПоНатуральнымПоказателям
		               |			ТОГДА ВЫБОР
		               |					КОГДА упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Количество ЕСТЬ NULL 
		               |						ТОГДА упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Количество
		               |					ИНАЧЕ упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Количество
		               |				КОНЕЦ
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Количество,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ДатаПоступления КАК Период,
		               |	ВЫБОР
		               |		КОГДА упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Сумма ЕСТЬ NULL 
		               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Сумма
		               |		ИНАЧЕ упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Сумма
		               |	КОНЕЦ КАК СуммаВалютная,
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Статья,
		               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.СобствСилы_Субподряд,
		               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
		               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.КонтрагентПодрядчик
		               |ИЗ
		               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.ДоходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическиВыполненногоОбъема.РаспределениеДоходныхОбъемов КАК упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов
		               |		ПО упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.Ссылка
		               |			И упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ИндексСтрокРаспределения = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеДоходныхОбъемов.ИндексСтрокиВладельца
		               |ГДЕ
		               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка = &Ссылка";
		
			Если ТекстЗапроса <> Неопределено Тогда
				
				Запрос.Текст = ТекстЗапроса;
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
				Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
				
				ТаблицаДоходныхОбъемов = Запрос.Выполнить().Выгрузить();  
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоСинхронизацияФактическиВыполненныхОбъемов") Тогда	
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Договор КАК Договор,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Валюта КАК Валюта,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Роль КАК Роль,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Номенклатура КАК Номенклатура,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Сумма КАК Сумма,
			               |	ВЫБОР
			               |		КОГДА &ДоходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Количество
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК Количество,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ДатаПоступления КАК Период,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Сумма КАК СуммаВалютная,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Статья КАК Статья,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.КонтрагентПодрядчик КАК КонтрагентПодрядчик
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическиВыполненныхОбъемов.ДоходныеОбъемы КАК упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы
			               |ГДЕ
			               |	упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическиВыполненныхОбъемовДоходныеОбъемы.ПроектнаяЗадача.Проект = &Проект";
		
			Если ТекстЗапроса <> Неопределено Тогда
				
				Запрос.Текст = ТекстЗапроса;
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
				Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
				Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
				
				ТаблицаДоходныхОбъемов = Запрос.Выполнить().Выгрузить();  
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТаблицаДоходныхОбъемов <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДоходныхОбъемов);
			
			Для Каждого СтркоаОбъемов Из ТаблицаДоходныхОбъемов Цикл
				
				НоваяСтрока = ДанныеДвижений.упоФактВыполненияОбъемовОбороты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстЗапроса = Неопределено;
	
	Если СвойстваПроекта.РасходыПоОбъемам Тогда
		
		Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоРегистрацияФактическиВыполненногоОбъема") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Контрагент КАК Контрагент,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Договор КАК Договор,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Валюта КАК Валюта,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Подразделение КАК Подразделение,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Роль КАК Роль,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Номенклатура КАК Номенклатура,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Сумма КАК Сумма,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА ВЫБОР
			               |					КОГДА упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Количество ЕСТЬ NULL
			               |						ТОГДА упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Количество
			               |					ИНАЧЕ упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Количество
			               |				КОНЕЦ
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК Количество,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.ДатаПоступления КАК Период,
			               |	ВЫБОР
			               |		КОГДА упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Сумма ЕСТЬ NULL
			               |			ТОГДА упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Сумма
			               |		ИНАЧЕ упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Сумма
			               |	КОНЕЦ КАК СуммаВалютная,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Статья КАК Статья,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Контрагент КАК КонтрагентПодрядчик,
			               |	упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.РасходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоРегистрацияФактическиВыполненногоОбъема.РаспределениеРасходныхОбъемов КАК упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов
			               |		ПО упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Ссылка = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.Ссылка
			               |			И упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.ИндексСтрокРаспределения = упоРегистрацияФактическиВыполненногоОбъемаРаспределениеРасходныхОбъемов.ИндексСтрокиВладельца
			               |ГДЕ
			               |	упоРегистрацияФактическиВыполненногоОбъемаРасходныеОбъемы.Ссылка = &Ссылка";
			
			
			Если ТекстЗапроса <> Неопределено Тогда
				
				Запрос.Текст = ТекстЗапроса;
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
				Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
				
				ТаблицаРасходныхОбъемов = Запрос.Выполнить().Выгрузить();  
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоСинхронизацияФактическиВыполненныхОбъемов") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Контрагент КАК Контрагент,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Договор КАК Договор,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Валюта КАК Валюта,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Подразделение КАК Подразделение,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Роль КАК Роль,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Номенклатура КАК Номенклатура,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Сумма КАК Сумма,
			               |	ВЫБОР
			               |		КОГДА &РасходыПоНатуральнымПоказателям
			               |			ТОГДА упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Количество
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК Количество,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ДатаПоступления КАК Период,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Сумма КАК СуммаВалютная,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Статья КАК Статья,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Контрагент КАК КонтрагентПодрядчик,
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.СобствСилы_Субподряд КАК СобствСилы_Субподряд
			               |ИЗ
			               |	Документ.упоСинхронизацияФактическиВыполненныхОбъемов.РасходныеОбъемы КАК упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы
			               |ГДЕ
			               |	упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.Ссылка = &Ссылка
			               |	И упоСинхронизацияФактическиВыполненныхОбъемовРасходныеОбъемы.ПроектнаяЗадача.Проект = &Проект";
					
			Если ТекстЗапроса <> Неопределено Тогда
				
				Запрос.Текст = ТекстЗапроса;
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("Проект", СвойстваПроведения.Проект);
				Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
				Запрос.УстановитьПараметр("РасходыПоНатуральнымПоказателям", СвойстваПроекта.РасходыПоНатуральнымПоказателям);
				
				ТаблицаРасходныхОбъемов = Запрос.Выполнить().Выгрузить();  
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТаблицаРасходныхОбъемов <> Неопределено Тогда
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаРасходныхОбъемов);
			
			Для Каждого СтркоаОбъемов Из ТаблицаРасходныхОбъемов Цикл
				
				НоваяСтрока = ДанныеДвижений.упоФактВыполненияОбъемовОбороты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтркоаОбъемов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//

// Добавляет обязательные строки по умолчанию в распределение доходных и расходных объемов.
// Параметры:
//	ЭтотОбъект - ДокументОбъект, УправляемаяФорма - объект.
//  ДополнительныеПараметрыРаспределения - Структура - параметры обработки таблиц распределения.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	ТаблицыПроверки - Неопределено, Структура - содержит перечень таблиц проверки.
//	Отказ - Булево - признак отказа от проведения.
//
Процедура ПроверитьЗаполнитьРаспределениеОбъемов(ЭтотОбъект, ДополнительныеПараметрыРаспределения, 
	СвойстваПроекта = Неопределено, СтруктураСвойствПоУмолчанию = Неопределено, ТаблицыПроверки = Неопределено, Отказ) Экспорт							
	
	Если СвойстваПроекта = Неопределено Тогда
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ЭтотОбъект.Проект);	
	КонецЕсли;	
	
	СтруктураСвойствПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(ЭтотОбъект.Проект);	
		
	ПроверятьСубпродукты = ТаблицыПроверки = Неопределено Или ТаблицыПроверки.Свойство("Субпродукты");
	ПроверятьМатРесурсы = ТаблицыПроверки = Неопределено Или ТаблицыПроверки.Свойство("МатериальныеРесурсы");
	ПроверятьПланДоходов = ТаблицыПроверки = Неопределено Или ТаблицыПроверки.Свойство("ПланДоходов");
	ПроверятьПланРасходов = ТаблицыПроверки = Неопределено Или ТаблицыПроверки.Свойство("ПланРасходов");
	
	Если ПроверятьСубпродукты Тогда
				
		ТаблицаПоПодразделениям = Неопределено;
		ДополнительныеПараметрыРаспределения.Свойство("СубпродуктыТаблицаРаспределения", ТаблицаПоПодразделениям);
		
		ПроверитьЗаполнитьТаблицуРаспределения(ЭтотОбъект, ДополнительныеПараметрыРаспределения, СвойстваПроекта,
			СтруктураСвойствПоУмолчанию, "Субпродукты", ТаблицаПоПодразделениям, Отказ);
				
	КонецЕсли;
		
	Если ПроверятьМатРесурсы Тогда
					
		ТаблицаПоПодразделениям = Неопределено;
		ДополнительныеПараметрыРаспределения.Свойство("МатериальныеРесурсыТаблицаРаспределения", ТаблицаПоПодразделениям);
		
		ПроверитьЗаполнитьТаблицуРаспределения(ЭтотОбъект, ДополнительныеПараметрыРаспределения, СвойстваПроекта,
			СтруктураСвойствПоУмолчанию, "МатериальныеРесурсы", ТаблицаПоПодразделениям, Отказ); 
		
	КонецЕсли;	
	
	Если ПроверятьПланДоходов Тогда
		
		ТаблицаПоПодразделениям = Неопределено;
		ДополнительныеПараметрыРаспределения.Свойство("ПланДоходовТаблицаРаспределения", ТаблицаПоПодразделениям);				
		
		ПроверитьЗаполнитьТаблицуРаспределения(ЭтотОбъект, ДополнительныеПараметрыРаспределения, СвойстваПроекта,
			СтруктураСвойствПоУмолчанию, "ПланДоходов", ТаблицаПоПодразделениям, Отказ);                                  
		
	КонецЕсли;
	
	Если ПроверятьПланРасходов Тогда
		
		ТаблицаПоПодразделениям = Неопределено;
		ДополнительныеПараметрыРаспределения.Свойство("ПланРасходовТаблицаРаспределения", ТаблицаПоПодразделениям);				
		
		ПроверитьЗаполнитьТаблицуРаспределения(ЭтотОбъект, ДополнительныеПараметрыРаспределения, СвойстваПроекта,
			СтруктураСвойствПоУмолчанию, "ПланРасходов", ТаблицаПоПодразделениям, Отказ); 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыПроверкиТаблицыРаспределения(ИмяТаблицыРаспределения, СвойстваПроекта, ЭтоПроектнаяЗадача)
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("РаспределениеОбъемов", 		Ложь);
	ПараметрыПроверки.Вставить("РаспределениеПотребностей", Ложь);
	ПараметрыПроверки.Вставить("РаспределениеДоходов", 		Ложь);
	ПараметрыПроверки.Вставить("РаспределениеРасходов", 	Ложь);
	ПараметрыПроверки.Вставить("ПроверитьЗаполнениеСпособаПривязки", Ложь);
	ПараметрыПроверки.Вставить("ПредставлениеТЧРаспределения", "");
	
	ПараметрыПроверки.РаспределениеОбъемов = 	ИмяТаблицыРаспределения = "РаспределениеОбъемов" 
													Или ИмяТаблицыРаспределения = "СубпродуктыПоПодразделениям";
	ПараметрыПроверки.РаспределениеПотребностей = ИмяТаблицыРаспределения = "РаспределениеПотребностей" 
													Или ИмяТаблицыРаспределения = "МатериальныеРесурсыПоПодразделениям";
	ПараметрыПроверки.РаспределениеДоходов = 	ИмяТаблицыРаспределения = "РаспределениеДоходов" 
													Или ИмяТаблицыРаспределения = "ПланДоходовПоПодразделениям";
	ПараметрыПроверки.РаспределениеРасходов =	ИмяТаблицыРаспределения = "РаспределениеРасходов" 
													Или ИмяТаблицыРаспределения = "ПланРасходовПоПодразделениям";	
													
	Если ПараметрыПроверки.РаспределениеОбъемов Тогда
		ПараметрыПроверки.ПроверитьЗаполнениеСпособаПривязки = СвойстваПроекта.ДоходыПоНатуральнымПоказателям;		
	ИначеЕсли ПараметрыПроверки.РаспределениеПотребностей Тогда
		ПараметрыПроверки.ПроверитьЗаполнениеСпособаПривязки = СвойстваПроекта.РасходыПоНатуральнымПоказателям;		
	КонецЕсли; 													
	
	ПараметрыПроверки.ПредставлениеТЧРаспределения = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(
																							ИмяТаблицыРаспределения, 
																							ЭтоПроектнаяЗадача);
	
	Возврат ПараметрыПроверки;
	
КонецФункции

Процедура ПроверитьЗаполнитьТаблицуРаспределения(ЭтотОбъект, 
												ДополнительныеПараметрыРаспределения,
												СвойстваПроекта, 
												СтруктураСвойствПоУмолчанию, 
												ОсновнаяТаблица, 
												ИмяТаблицыРаспределения, 
												Отказ)
	
	Если ИмяТаблицыРаспределения = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ЭтоПроектнаяЗадача = ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоПроектнаяЗадача");
		
	ПараметрыПроверки = ПараметрыПроверкиТаблицыРаспределения(ИмяТаблицыРаспределения, 
																СвойстваПроекта, 
																ЭтоПроектнаяЗадача);	
		 		 		  	
	Если ((ПараметрыПроверки.РаспределениеПотребностей Или ПараметрыПроверки.РаспределениеРасходов) 
			И Не СвойстваПроекта.РасходыПоПодразделениям)
		Или (ПараметрыПроверки.РаспределениеДоходов И Не СвойстваПроекта.ДоходыПоПодразделениям) Тогда
		ЭтотОбъект[ИмяТаблицыРаспределения].Очистить();
	КонецЕсли;	
	
	// Временно закомментировано todo
	// ПериодыЗапланированныхТрудозатратПодразделениям = Новый Соответствие;
	
	Если ИмяТаблицыРаспределения = "РаспределениеПотребностей" Тогда
		
		ЗаписыватьРаспределениеПотребностей = СвойстваПроекта.РасходыПоОбъемам
			Или (СвойстваПроекта.РасходыПоПодразделениям И ЭтотОбъект.ВключитьМатРесурсыВПланРасходов);
			
		Если Не ЗаписыватьРаспределениеПотребностей Тогда
			ЭтотОбъект[ИмяТаблицыРаспределения].Очистить();
			Возврат;
		КонецЕсли;		
		
	КонецЕсли;

	Отбор = Новый Структура("ИндексСтрокиВладельца");
	
	Для Каждого СтрокаОсновнойТаблицы Из ЭтотОбъект[ОсновнаяТаблица] Цикл
		
		Если СтрокаОсновнойТаблицы.ИндексСтрокРаспределения = Неопределено Тогда
			СтрокаОсновнойТаблицы.ИндексСтрокРаспределения = 
				упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(ЭтотОбъект[ОсновнаяТаблица]);	
		КонецЕсли;
		
		Отбор.ИндексСтрокиВладельца = СтрокаОсновнойТаблицы.ИндексСтрокРаспределения;
		СтрокиРаспределения = ЭтотОбъект[ИмяТаблицыРаспределения].НайтиСтроки(Отбор);
		
		// Добавляем строки распределения по умолчанию.
				
		Если СтрокиРаспределения.Количество() = 0 Тогда
										
			ПараметрыПривязки = СпособПривязкиПрофильПоПараметрамПроверки(СтрокаОсновнойТаблицы, 
																			ПараметрыПроверки, 
																			СтруктураСвойствПоУмолчанию,
																			Отказ);
			
			Если Отказ Тогда				
				Прервать;				
			КонецЕсли;			
			
			НоваяСтрокаРаспр = ЭтотОбъект[ИмяТаблицыРаспределения].Добавить();
			
			ЗаполнитьСтрокуРаспределенияПоУмолчанию(СтрокаОсновнойТаблицы, 
													НоваяСтрокаРаспр,
													ПараметрыПроверки,
													ПараметрыПривязки,
													СтруктураСвойствПоУмолчанию,
													СвойстваПроекта);
																																		
		КонецЕсли; 			
		
		// Временно закомментировано todo
		// // Проверим запланированы ли трудозатраты по подразделениям в указанном периоде
		// ПроверитьРаспределениеТрудозатратПоПериодамПоПодразделениям(ОсновнаяТаблица, СтрокаОсновнойТаблицы,
		//	 СтрокиРаспределения, НоваяСтрокаРаспр, ЭтотОбъект, ПериодыЗапланированныхТрудозатратПодразделениям, Отказ);
		//
		// Если Отказ Тогда			
		//	 Прервать;			
		// КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Функция СпособПривязкиПрофильПоПараметрамПроверки(СтрокаОсновнойТаблицы, 
													ПараметрыПроверки, 
													СтруктураСвойствПоУмолчанию,
													Отказ)
			
	// Для включенных доходов/расходов по натуральным показателям необходимо обеспечить 
	// заполнение способа привязки/профиля в добавляемой строке распределения.			
	СпособПривязкиДР = СтрокаОсновнойТаблицы.СпособПривязки;
	ПрофильДР = СтрокаОсновнойТаблицы.ПрофильРаспределения;
	
	Результат = Новый Структура;
	Результат.Вставить("СпособПривязкиДР", 	СпособПривязкиДР);
	Результат.Вставить("ПрофильДР", 		ПрофильДР);
	
	Если Не ПараметрыПроверки.ПроверитьЗаполнениеСпособаПривязки Тогда
		Возврат Результат;
	КонецЕсли;	
		
	Если Не ЗначениеЗаполнено(СпособПривязкиДР) Тогда
		СпособПривязкиДР = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения;
		Результат.СпособПривязкиДР = СпособПривязкиДР;
	КонецЕсли;
			
	Если СпособПривязкиДР <> Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения Тогда					
		Возврат Результат;
	КонецЕсли;	
	
	//
	
	ЭтоРасход = ПараметрыПроверки.РаспределениеПотребностей 
				Или ПараметрыПроверки.РаспределениеРасходов;					
															
	Если Не ЗначениеЗаполнено(ПрофильДР) Тогда
		
		Если ЭтоРасход Тогда			
			ПрофильДРПоУмолчанию = СтруктураСвойствПоУмолчанию.ПрофильРасходовПоУмолчанию; 
		Иначе
			ПрофильДРПоУмолчанию = СтруктураСвойствПоУмолчанию.ПрофильДоходовПоУмолчанию;
		КонецЕсли;	
										
		ПрофильДР = ПрофильДРПоУмолчанию;
		
		Результат.ПрофильДР = ПрофильДР;
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ПрофильДР) Тогда
						
		ТекстСообщения = НСтр("ru = 'Для проведения задачи необходимо заполнить реквизит проекта ""%1"" '")
						+ НСтр("ru = 'или вручную добавить строки в таблице ""%2"".'"); 
 		
		Если ЭтоРасход Тогда
			СинонимРеквизитаПроекта = 
				Метаданные.Справочники.Проекты.Реквизиты.ПрофильРасходовПоУмолчанию.Синоним;	
		Иначе
			СинонимРеквизитаПроекта = 
				Метаданные.Справочники.Проекты.Реквизиты.ПрофильДоходовПоУмолчанию.Синоним;
		КонецЕсли;						
						
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
			СинонимРеквизитаПроекта,
			ПараметрыПроверки.ПредставлениеТЧРаспределения);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	КонецЕсли;
										
	Возврат Результат;
	
КонецФункции // ()

Функция ЗаполнитьСтрокуРаспределенияПоУмолчанию(СтрокаОсновнойТаблицы, 
												СтрокаРаспределения, 
												ПараметрыПроверки, 
												ПараметрыПривязки, 
												СтруктураСвойствПоУмолчанию,
												СвойстваПроекта)				
	
	ДанныеОсновнойТаблицы = Новый Структура();
					
	ДанныеСтрокиРаспределения = Новый Структура;
	ДанныеСтрокиРаспределения.Вставить("ИндексСтрокиВладельца", СтрокаОсновнойТаблицы.ИндексСтрокРаспределения);
	ДанныеСтрокиРаспределения.Вставить("ПрофильРаспределения",	ПараметрыПривязки.ПрофильДР);
	ДанныеСтрокиРаспределения.Вставить("ДатаПривязки", 			СтрокаОсновнойТаблицы.ДатаПривязки);												
	
	СпособПривязкиРаспределения = 
		СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(ПараметрыПривязки.СпособПривязкиДР);
	ДанныеСтрокиРаспределения.Вставить("СпособПривязки", СпособПривязкиРаспределения);
					
	Если ПараметрыПроверки.РаспределениеОбъемов Тогда
		
		ДанныеСтрокиРаспределения.Вставить("Сумма",  				СтрокаОсновнойТаблицы.ОбщСтоимость);
		ДанныеСтрокиРаспределения.Вставить("Роль", 					СтруктураСвойствПоУмолчанию.РольДоходовПоУмолчанию);
		ДанныеСтрокиРаспределения.Вставить("СобствСилы_Субподряд", 	СтруктураСвойствПоУмолчанию.СССП_Доходы);
		ДанныеСтрокиРаспределения.Вставить("Подразделение", 		СтруктураСвойствПоУмолчанию.ПодразделениеДоходовПоУмолчанию);
		ДанныеСтрокиРаспределения.Вставить("Количество",  			СтрокаОсновнойТаблицы.Количество);
			
	ИначеЕсли ПараметрыПроверки.РаспределениеПотребностей Тогда
		
		ДанныеСтрокиРаспределения.Вставить("Сумма",  				СтрокаОсновнойТаблицы.ОбщСтоимость);
		ДанныеСтрокиРаспределения.Вставить("Роль", 					СтруктураСвойствПоУмолчанию.РольРасходовПоУмолчанию);
		ДанныеСтрокиРаспределения.Вставить("СобствСилы_Субподряд", 	СтруктураСвойствПоУмолчанию.СССП_Расходы);
		ДанныеСтрокиРаспределения.Вставить("Подразделение", 		СтруктураСвойствПоУмолчанию.ПодразделениеРасходовПоУмолчанию);
		ДанныеСтрокиРаспределения.Вставить("Количество",  			СтрокаОсновнойТаблицы.Количество);
						
	ИначеЕсли ПараметрыПроверки.РаспределениеДоходов Тогда				
				
		ДанныеСтрокиРаспределения.Вставить("Сумма",  				СтрокаОсновнойТаблицы.Сумма);
		ДанныеСтрокиРаспределения.Вставить("Роль", 					СтруктураСвойствПоУмолчанию.РольДоходовПоУмолчанию);
		ДанныеСтрокиРаспределения.Вставить("Подразделение", 		СтруктураСвойствПоУмолчанию.ПодразделениеДоходовПоУмолчанию);
		ДанныеСтрокиРаспределения.Вставить("СобствСилы_Субподряд", 	СтруктураСвойствПоУмолчанию.СССП_Доходы);				
		ДанныеСтрокиРаспределения.Вставить("ИсточникПлана", 		СтрокаОсновнойТаблицы.ИсточникПлана);
							
	ИначеЕсли ПараметрыПроверки.РаспределениеРасходов Тогда
		
		ДанныеСтрокиРаспределения.Вставить("Сумма",  				СтрокаОсновнойТаблицы.Сумма);
		ДанныеСтрокиРаспределения.Вставить("Роль", 					СтруктураСвойствПоУмолчанию.РольРасходовПоУмолчанию);
		ДанныеСтрокиРаспределения.Вставить("СобствСилы_Субподряд", 	СтруктураСвойствПоУмолчанию.СССП_Расходы);
		ДанныеСтрокиРаспределения.Вставить("Подразделение", 		СтруктураСвойствПоУмолчанию.ПодразделениеРасходовПоУмолчанию);				
		ДанныеСтрокиРаспределения.Вставить("ИсточникПлана", 		СтрокаОсновнойТаблицы.ИсточникПлана);
		
	КонецЕсли;
	
	упоАналитикаПоПодразделениямКлиентСервер.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(ДанныеСтрокиРаспределения, 
																						СвойстваПроекта.ИспользоватьАналитикуКонтрагентДляСС);																																															
																							
	ЗаполнитьЗначенияСвойств(СтрокаРаспределения, ДанныеСтрокиРаспределения);
			
КонецФункции

Процедура ПроверитьРаспределениеТрудозатратПоПериодамПоПодразделениям(ОсновнаяТаблица, СтрокаОсновнойТаблицы,
	СтрокиРаспределения, НоваяСтрокаРаспр, ЭтотОбъект, ПериодыЗапланированныхТрудозатратПодразделениям, Отказ)
	
	// Проверяем строки только плана доходов, добавленные в ручную и со способом привязки на дату
	Если ОсновнаяТаблица <> "ПланДоходов" 
		Или СтрокаОсновнойТаблицы.ИндексСтрокРаспределенияИсходнойТЧ <> Неопределено
		Или СтрокаОсновнойТаблицы.СпособПривязки <> 
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда		
		Возврат;		
	КонецЕсли;	
		
	Если СтрокиРаспределения.Количество() = 0 И НоваяСтрокаРаспр <> Неопределено Тогда
		СтрокиРаспределения = Новый Массив;
		СтрокиРаспределения.Добавить(НоваяСтрокаРаспр);							
	КонецЕсли;
	
	Для Каждого Строка Из СтрокиРаспределения Цикл
		
		ПериодыТрудозатратПодразделения = 
			ПолучитьПериодыТрудозатратПодразделения(Строка, ЭтотОбъект, Отказ, ПериодыЗапланированныхТрудозатратПодразделениям);
			
		Если Отказ Тогда
			Прервать;		
		КонецЕсли;
			
		Если ПериодыТрудозатратПодразделения = Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		ДатаПопалаВПериод = ДатаСодержитсяВПериода(СтрокаОсновнойТаблицы, ПериодыТрудозатратПодразделения);		
		Если Не ДатаПопалаВПериод Тогда
			ТекстСообщения = НСтр("ru = 'В плане доходов для подразделения ""%1"" не запланированы трудозатраты на дату %2.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
				Строка.Подразделение, Формат(СтрокаОсновнойТаблицы.ДатаПривязки, "ДФ=dd.MM.yyyy"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;			
			
КонецПроцедуры

Функция ПолучитьПериодыТрудозатратПодразделения(Строка, ЭтотОбъект, Отказ,
		ПериодыЗапланированныхТрудозатратПодразделениям)
	
	ПериодыТрудозатратПодразделения = ПериодыЗапланированныхТрудозатратПодразделениям[Строка.Подразделение];
	
	Если ПериодыТрудозатратПодразделения <> Неопределено Тогда
		Возврат ПериодыТрудозатратПодразделения;
	КонецЕсли;
	
	ПроверкаИзДокумента = ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоПроектнаяЗадача");
	СтрокиТР = ПолучитьСтрокиТРСПодразделением(ПроверкаИзДокумента, Строка, ЭтотОбъект);
	
	Если СтрокиТР.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Для подразделения ""%1"" не запланированы трудозатраты.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			Строка.Подразделение);					
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);					
		Возврат Истина;
		
	КонецЕсли;
	
	ПоПрофилюРаспределения = Ложь;				
	МассивПериодов = Новый Массив;
	ПолучитьПериодыТР(ПроверкаИзДокумента, ПоПрофилюРаспределения, МассивПериодов, СтрокиТР, ЭтотОбъект);
	
	Если ПоПрофилюРаспределения Тогда
		// Если хоть одно подразделение распределено по профилю, то проверку не делаем.
		ПериодыЗапланированныхТрудозатратПодразделениям.Вставить(Строка.Подразделение, Истина);
		Возврат Истина;
	КонецЕсли;
	
	МассивПериодовУникальный = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПериодовУникальный, МассивПериодов, Истина);
	
	ПериодыЗапланированныхТрудозатратПодразделениям.Вставить(Строка.Подразделение, МассивПериодовУникальный);
	
	Возврат МассивПериодовУникальный;	
	
КонецФункции

Процедура ПолучитьПериодыТР(ПроверкаИзДокумента, ПоПрофилюРаспределения, МассивПериодов, СтрокиТР, ЭтотОбъект)
	
	Для Каждого СтрокаТР Из СтрокиТР Цикл
		
		Если СтрокаТР.СпособПривязки =
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения") Тогда
			
			ПоПрофилюРаспределения = Истина;
			Прервать;
			
		ИначеЕсли СтрокаТР.СпособПривязки =
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
			
			ЗаполнитьМассивПериодов(ПроверкаИзДокумента, МассивПериодов, СтрокаТР, ЭтотОбъект);			
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМассивПериодов(ПроверкаИзДокумента, МассивПериодов, СтрокаТР, ЭтотОбъект)
	
	Если ПроверкаИзДокумента Тогда
		
		НайденныеСтроки = ЭтотОбъект.ТрудовыеРесурсыПоПериодам.НайтиСтроки(
			Новый Структура("ИндексСтрокиРаспределениеПоРолям", СтрокаТР.ИндексСтрокРаспределенияПоПериодам));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивПериодов.Добавить(НайденнаяСтрока.Период);
		КонецЦикла;
		
	Иначе
		
		Для Каждого НайденнаяСтрока Из СтрокаТР.РаспределениеПоПериодам Цикл
			МассивПериодов.Добавить(НайденнаяСтрока.Период);
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтрокиТРСПодразделением(ПроверкаИзДокумента, Строка, ЭтотОбъект)
	
	Если ПроверкаИзДокумента Тогда
		СтрокиТР = ЭтотОбъект.ТрудовыеРесурсы.НайтиСтроки(Новый Структура("Подразделение", Строка.Подразделение));
	Иначе						
		СтрокиТР = Новый Массив;
		Трудозатраты = ЭтотОбъект.СвойстваТрудозатратДляПроверкиПланаДР;
		Если Трудозатраты <> Неопределено Тогда
			Для Каждого СтрокаТЗ Из Трудозатраты.СвойстваТрудозатратДляПроверкиПланаДР Цикл
				Если СтрокаТЗ.Подразделение = Строка.Подразделение Тогда
					СтрокиТР.Добавить(СтрокаТЗ);	
				КонецЕсли;
			КонецЦикла;							
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтрокиТР;
	
КонецФункции

Функция ДатаСодержитсяВПериода(СтрокаОсновнойТаблицы, ПериодыТрудозатратПодразделения)
	
	Для Каждого Период Из ПериодыТрудозатратПодразделения Цикл
		
		Если СтрокаОсновнойТаблицы.ДатаПривязки >= НачалоМесяца(Период) 
			И СтрокаОсновнойТаблицы.ДатаПривязки <= КонецМесяца(Период) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

// Добавляет обязательные строки по умолчанию в распределение доп.затрат.
// Параметры:
//	ЭтотОбъект - ДокументОбъект, УправляемаяФорма - объект.
//	СвойстваПроекта - Структура - содержит настройки учета по подразделениям.
//	ТаблицыПроверки - Неопределено, Структура - содержит перечень таблиц проверки.
//	Отказ - Булево - признак отказа от проведения.
//
Процедура ПроверитьЗаполнитьРаспределениеДопЗатрат(ЭтотОбъект, СвойстваПроекта = Неопределено, СтруктураСвойствПоУмолчанию = Неопределено, Отказ)
	
	Если СвойстваПроекта = Неопределено Тогда
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ЭтотОбъект.Проект);	
	КонецЕсли;	
	
	Если СтруктураСвойствПоУмолчанию = Неопределено Тогда
		СтруктураСвойствПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(ЭтотОбъект.Проект);							
	КонецЕсли;	
	
	Если ЭтотОбъект.ВключитьДопЗатратыВПланРасходов Тогда
		
		Если Не СвойстваПроекта.РасходыПоПодразделениям Тогда
			ЭтотОбъект.РаспределениеДополнительныхЗатрат.Очистить();
		КонецЕсли;	
		
		Для Каждого СтрокаДополнительныеЗатраты Из ЭтотОбъект.ДополнительныеЗатраты Цикл
			
			Если СтрокаДополнительныеЗатраты.ИндексСтрокРаспределения = Неопределено Тогда
				СтрокаДополнительныеЗатраты.ИндексСтрокРаспределения = 
				упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(ЭтотОбъект.ДополнительныеЗатраты);	
			КонецЕсли;
			
			Если ЭтотОбъект.РаспределениеДополнительныхЗатрат.Найти(СтрокаДополнительныеЗатраты.ИндексСтрокРаспределения, "ИндексСтрокиВладельца") = Неопределено Тогда
				
				НоваяСтрокаРаспр = ЭтотОбъект.РаспределениеДополнительныхЗатрат.Добавить();
				НоваяСтрокаРаспр.Сумма = СтрокаДополнительныеЗатраты.Стоимость;				
				НоваяСтрокаРаспр.ИндексСтрокиВладельца = СтрокаДополнительныеЗатраты.ИндексСтрокРаспределения;
								
				СпособПривязкиРаспределения = СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(
					СтрокаДополнительныеЗатраты.СпособПривязкиДоходовРасходов);
				НоваяСтрокаРаспр.СпособПривязки = СпособПривязкиРаспределения;
											
				НоваяСтрокаРаспр.ПрофильРаспределения = СтрокаДополнительныеЗатраты.ПрофильРаспределенияДоходовРасходов;
				НоваяСтрокаРаспр.ДатаПривязки = СтрокаДополнительныеЗатраты.ДатаПривязкиДоходовРасходов;
				НоваяСтрокаРаспр.Подразделение = СтруктураСвойствПоУмолчанию.ПодразделениеРасходовПоУмолчанию;
				НоваяСтрокаРаспр.Роль = СтруктураСвойствПоУмолчанию.РольРасходовПоУмолчанию;
				НоваяСтрокаРаспр.СобствСилы_Субподряд = СтруктураСвойствПоУмолчанию.СССП_Расходы;
				
				упоПроектыИЗадачиОбщие.ПроверитьЗаполнениеСпособаПривязки(ЭтотОбъект, НоваяСтрокаРаспр, "РаспределениеДополнительныхЗатрат", 
						НСтр("ru = 'Распределение доп.затрат по подразделениям'"), Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;						
	
КонецПроцедуры

// Получает таблицу движений для целей учета по подразделениям.
//
// Параметры:
//  ВидДвижения						 - Строка - "Доход" или "Расход".
//  СвойстваПроведения				 - Структура - свойства проведения.
//  РаспределениеБДР				 - Булево - признак распределения БДР.
//  РаспределениеНатурПоказателей	 - Булево - признак распределения натуральных показателей.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица движений.
//
Функция ПолучитьТаблицуДвиженийДляЦелейУчетаПоПодразделениям(ЭтотОбъект, ВидДвижения, Знач СвойстваПроведения, РаспределениеБДР,
	РаспределениеНатурПоказателей, ЭтоПроектнаяЗадача)  
	
	ТаблицаДвижений = упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоАктуальныеПланыДоходовИРасходовПодразделения");
	
	ТаблицаКопия = ТаблицаДвижений.Скопировать();		
	
	Если ЭтоПроектнаяЗадача Тогда
		СрокиЗадач = Новый Соответствие;			
		СтруктураСроки = Новый Структура("ДатаНачала, ДатаЗавершения", СвойстваПроведения.НачДата, СвойстваПроведения.КонДата);
		СрокиЗадач.Вставить(СвойстваПроведения.ПроектнаяЗадача, Новый Структура("Результат", СтруктураСроки));
    Иначе
		СрокиЗадач = СвойстваПроведения.СрокиЗадач;
		
		СвойстваПроведения.Вставить("ЗадачиВключитьМатРесурсыВПланРасходов", Новый Массив);
		СвойстваПроведения.Вставить("ЗадачиВключитьДопЗатратыВПланРасходов", Новый Массив);
		СвойстваПроведения.Вставить("ЗадачиВключитьСубпродуктыВПланДоходов", Новый Массив);
		ЗаполнитьМассивыЗадачТрансляции(СвойстваПроведения.ЗадачиВключитьМатРесурсыВПланРасходов, 
			СвойстваПроведения.ЗадачиВключитьДопЗатратыВПланРасходов, 
			СвойстваПроведения.ЗадачиВключитьСубпродуктыВПланДоходов, 
			СвойстваПроведения.Версия, СвойстваПроведения.ПроектнаяЗадача);		
	КонецЕсли;		
		
	Если ВидДвижения = "Доход" Тогда
		Если ЭтоПроектнаяЗадача Тогда		
			ЗаполнитьТаблицуДвиженийДоходПоДаннымПЗ(ЭтотОбъект, ТаблицаКопия, СвойстваПроведения, РаспределениеБДР,
				РаспределениеНатурПоказателей);
		Иначе
			ЗаполнитьТаблицуДвиженийДоходПоДаннымРегистров(ТаблицаКопия, СвойстваПроведения, РаспределениеБДР, РаспределениеНатурПоказателей);
		КонецЕсли;	
	ИначеЕсли ВидДвижения = "Расход" Тогда
		Если ЭтоПроектнаяЗадача Тогда		
			ЗаполнитьТаблицуДвиженийРасходПоДаннымПЗ(ЭтотОбъект, ТаблицаКопия, СвойстваПроведения,
				СвойстваПроведения.СвойстваПроекта);
		Иначе
			ЗаполнитьТаблицуДвиженийРасходПоДаннымРегистров(ТаблицаКопия, СвойстваПроведения, 
				СвойстваПроведения.СвойстваПроекта);
		КонецЕсли;	
	КонецЕсли;
	
	упоАналитикаПоПодразделениямСервер.ЗаполнитьРаспределениеВТаблицеДоходовРасходов(ТаблицаДвижений, ТаблицаКопия, СрокиЗадач);				
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
		
КонецФункции

Процедура ЗаполнитьТаблицуДвиженийРасходПоДаннымПЗ(ЭтотОбъект, ТаблицаДвижений, СвойстваПроведения, СвойстваПроекта)
	
	ТаблицаПланРасходов = ЭтотОбъект.ПланРасходов;
	ТаблицаРаспределениеРасходов = ЭтотОбъект.РаспределениеРасходов;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", СвойстваПроведения.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
	Запрос.УстановитьПараметр("ТаблицаПланРасходов", ТаблицаПланРасходов);	
	Запрос.УстановитьПараметр("ТаблицаРаспределениеРасходов", ТаблицаРаспределениеРасходов);	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПланРасходов.Статья КАК Статья,
	               |	ТаблицаПланРасходов.Контрагент КАК Контрагент,
	               |	ТаблицаПланРасходов.Договор КАК Договор,
	               |	ТаблицаПланРасходов.Валюта КАК Валюта,
	               |	ТаблицаПланРасходов.Сумма КАК Сумма,
	               |	ТаблицаПланРасходов.ДатаПривязки КАК ДатаПривязки,
	               |	ТаблицаПланРасходов.СпособПривязки КАК СпособПривязки,
	               |	ТаблицаПланРасходов.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТаблицаПланРасходов.ИсточникПлана КАК ИсточникПлана,
	               |	ТаблицаПланРасходов.ПериодАгрегации КАК ПериодАгрегации,
	               |	ТаблицаПланРасходов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
	               |ПОМЕСТИТЬ ВТ_ПланРасходов
	               |ИЗ
	               |	&ТаблицаПланРасходов КАК ТаблицаПланРасходов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРаспределениеРасходов.Подразделение КАК Подразделение,
	               |	ТаблицаРаспределениеРасходов.Роль КАК Роль,
	               |	ТаблицаРаспределениеРасходов.Сумма КАК Сумма,
	               |	ТаблицаРаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ТаблицаРаспределениеРасходов.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
	               |ПОМЕСТИТЬ ВТ_РаспределениеРасходов
	               |ИЗ
	               |	&ТаблицаРаспределениеРасходов КАК ТаблицаРаспределениеРасходов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекущаяВерсия КАК Версия,
	               |	&Ссылка КАК ПроектнаяЗадача,
	               |	ВТ_ПланРасходов.Статья КАК Статья,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
	               |	ВТ_ПланРасходов.Валюта КАК Валюта,
	               |	ВТ_РаспределениеРасходов.Подразделение КАК Подразделение,
	               |	ВТ_РаспределениеРасходов.Роль КАК Роль,
	               |	ВЫБОР
	               |		КОГДА ВТ_РаспределениеРасходов.Сумма ЕСТЬ NULL
	               |			ТОГДА ВТ_ПланРасходов.Сумма
	               |		ИНАЧЕ ВТ_РаспределениеРасходов.Сумма
	               |	КОНЕЦ КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ВТ_РаспределениеРасходов.Сумма ЕСТЬ NULL
	               |			ТОГДА ВТ_ПланРасходов.Сумма
	               |		ИНАЧЕ ВТ_РаспределениеРасходов.Сумма
	               |	КОНЕЦ КАК СуммаВалютная,
	               |	0 КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПланРасходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	               |			ТОГДА ВТ_ПланРасходов.ДатаПривязки
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаНачисления,
	               |	ВТ_ПланРасходов.СпособПривязки КАК СпособПривязки,
	               |	ВТ_ПланРасходов.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_РаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_ПланРасходов.Контрагент КАК КонтрагентПодрядчик,
	               |	ВТ_ПланРасходов.Договор КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_ПланРасходов.Контрагент КАК Контрагент,
	               |	ВТ_ПланРасходов.Договор КАК Договор,
	               |	ВТ_ПланРасходов.ИсточникПлана КАК ИсточникПлана,
	               |	ВТ_ПланРасходов.ПериодАгрегации КАК ПериодАгрегации
	               |ПОМЕСТИТЬ ВТ_Сводно
	               |ИЗ
	               |	ВТ_ПланРасходов КАК ВТ_ПланРасходов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеРасходов КАК ВТ_РаспределениеРасходов
	               |		ПО ВТ_ПланРасходов.ИндексСтрокРаспределения = ВТ_РаспределениеРасходов.ИндексСтрокиВладельца
	               |ГДЕ
	               |	ВТ_ПланРасходов.ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Сводно.Версия КАК Версия,
	               |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_Сводно.Статья КАК Статья,
	               |	ВТ_Сводно.ВидЭлемента КАК ВидЭлемента,
	               |	ВТ_Сводно.Валюта КАК Валюта,
	               |	ВТ_Сводно.Подразделение КАК Подразделение,
	               |	ВТ_Сводно.Роль КАК Роль,
	               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	               |	СУММА(ВТ_Сводно.Количество) КАК Количество,
	               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.Контрагент КАК Контрагент,
	               |	ВТ_Сводно.Договор КАК Договор,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сводно.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |		ИНАЧЕ ВТ_Сводно.ИсточникПлана
	               |	КОНЕЦ КАК ИсточникПлана,
	               |	ВТ_Сводно.ПериодАгрегации КАК ПериодАгрегации
	               |ИЗ
	               |	ВТ_Сводно КАК ВТ_Сводно
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Сводно.Версия,
	               |	ВТ_Сводно.ПроектнаяЗадача,
	               |	ВТ_Сводно.Статья,
	               |	ВТ_Сводно.ВидЭлемента,
	               |	ВТ_Сводно.Валюта,
	               |	ВТ_Сводно.Подразделение,
	               |	ВТ_Сводно.Роль,
	               |	ВТ_Сводно.ДатаНачисления,
	               |	ВТ_Сводно.СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.Контрагент,
	               |	ВТ_Сводно.Договор,
	               |	ВТ_Сводно.ПериодАгрегации,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сводно.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |		ИНАЧЕ ВТ_Сводно.ИсточникПлана
	               |	КОНЕЦ";
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = ТаблицаДвижений.Добавить();			
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
	КонецЦикла;
	
	Если СвойстваПроекта.РасходыПоПодразделениям Тогда	
		
		Если СвойстваПроведения.СвойстваЗадачи.ВключитьМатРесурсыВПланРасходов Тогда 	
			
			ТаблицаМатериальныеРесурсы = ЭтотОбъект.МатериальныеРесурсы;
			ТаблицаРаспределениеПотребностей = ЭтотОбъект.РаспределениеПотребностей;
			
			Запрос.УстановитьПараметр("ТаблицаМатериальныеРесурсы", ТаблицаМатериальныеРесурсы);
			Запрос.УстановитьПараметр("ТаблицаРаспределениеПотребностей", ТаблицаРаспределениеПотребностей);
	
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТаблицаМатериальныеРесурсы.Контрагент КАК Контрагент,
			               |	ТаблицаМатериальныеРесурсы.Договор КАК Договор,
			               |	ТаблицаМатериальныеРесурсы.Валюта КАК Валюта,
			               |	ТаблицаМатериальныеРесурсы.Ресурс КАК Ресурс,
			               |	ТаблицаМатериальныеРесурсы.ЕдиницаНормирования КАК ЕдиницаНормирования,
			               |	ТаблицаМатериальныеРесурсы.ОбщСтоимость КАК ОбщСтоимость,
			               |	ТаблицаМатериальныеРесурсы.Количество КАК Количество,
			               |	ТаблицаМатериальныеРесурсы.ДатаПривязки КАК ДатаПривязки,
			               |	ТаблицаМатериальныеРесурсы.СтатьяЗатрат КАК СтатьяЗатрат,
			               |	ТаблицаМатериальныеРесурсы.СпособПривязки КАК СпособПривязки,
			               |	ТаблицаМатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	ТаблицаМатериальныеРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
			               |ПОМЕСТИТЬ ВТ_МатериальныеРесурсы
			               |ИЗ
			               |	&ТаблицаМатериальныеРесурсы КАК ТаблицаМатериальныеРесурсы
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаРаспределениеПотребностей.Подразделение КАК Подразделение,
			               |	ТаблицаРаспределениеПотребностей.Роль КАК Роль,
			               |	ТаблицаРаспределениеПотребностей.Сумма КАК Сумма,
			               |	ТаблицаРаспределениеПотребностей.Количество КАК Количество,
			               |	ТаблицаРаспределениеПотребностей.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ТаблицаРаспределениеПотребностей.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
			               |ПОМЕСТИТЬ ВТ_РаспределениеПотребностей
			               |ИЗ
			               |	&ТаблицаРаспределениеПотребностей КАК ТаблицаРаспределениеПотребностей
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_МатериальныеРесурсы.Контрагент КАК КонтрагентПодрядчик,
			               |	ВТ_МатериальныеРесурсы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	ВТ_МатериальныеРесурсы.Валюта КАК Валюта,
			               |	ВТ_РаспределениеПотребностей.Подразделение КАК Подразделение,
			               |	ВТ_РаспределениеПотребностей.Роль КАК Роль,
			               |	ВТ_МатериальныеРесурсы.Ресурс КАК Номенклатура,
			               |	ВТ_МатериальныеРесурсы.ЕдиницаНормирования КАК ЕдиницаИзмерения,
			               |	ВЫБОР
			               |		КОГДА ВТ_РаспределениеПотребностей.Сумма ЕСТЬ NULL
			               |			ТОГДА ВТ_МатериальныеРесурсы.ОбщСтоимость
			               |		ИНАЧЕ ВТ_РаспределениеПотребностей.Сумма
			               |	КОНЕЦ КАК Сумма,
			               |	ВЫБОР
			               |		КОГДА ВТ_РаспределениеПотребностей.Сумма ЕСТЬ NULL
			               |			ТОГДА ВТ_МатериальныеРесурсы.ОбщСтоимость
			               |		ИНАЧЕ ВТ_РаспределениеПотребностей.Сумма
			               |	КОНЕЦ КАК СуммаВалютная,
			               |	ВЫБОР
			               |		КОГДА ВТ_РаспределениеПотребностей.Количество ЕСТЬ NULL
			               |			ТОГДА ВТ_МатериальныеРесурсы.Количество
			               |		ИНАЧЕ ВТ_РаспределениеПотребностей.Количество
			               |	КОНЕЦ КАК Количество,
			               |	ВТ_МатериальныеРесурсы.ДатаПривязки КАК ДатаНачисления,
			               |	ВТ_МатериальныеРесурсы.СтатьяЗатрат КАК Статья,
			               |	ВТ_МатериальныеРесурсы.СпособПривязки КАК СпособПривязки,
			               |	ВТ_МатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	ВТ_РаспределениеПотребностей.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ВТ_МатериальныеРесурсы.Контрагент КАК Контрагент,
			               |	ВТ_МатериальныеРесурсы.Договор КАК Договор
			               |ПОМЕСТИТЬ ВТ_Сводно
			               |ИЗ
			               |	ВТ_МатериальныеРесурсы КАК ВТ_МатериальныеРесурсы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПотребностей КАК ВТ_РаспределениеПотребностей
			               |		ПО ВТ_МатериальныеРесурсы.ИндексСтрокРаспределения = ВТ_РаспределениеПотребностей.ИндексСтрокиВладельца
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	&Ссылка КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
			               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	ВТ_Сводно.Валюта КАК Валюта,
			               |	ВТ_Сводно.Подразделение КАК Подразделение,
			               |	ВТ_Сводно.Роль КАК Роль,
			               |	ВТ_Сводно.Номенклатура КАК Номенклатура,
			               |	ВТ_Сводно.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
			               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
			               |	СУММА(ВТ_Сводно.Количество) КАК Количество,
			               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
			               |	ВТ_Сводно.Статья КАК Статья,
			               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
			               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ВТ_Сводно.Контрагент КАК Контрагент,
			               |	ВТ_Сводно.Договор КАК Договор,
			               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты) КАК ИсточникПлана
			               |ИЗ
			               |	ВТ_Сводно КАК ВТ_Сводно
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ_Сводно.КонтрагентПодрядчик,
			               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
			               |	ВТ_Сводно.Валюта,
			               |	ВТ_Сводно.Подразделение,
			               |	ВТ_Сводно.Роль,
			               |	ВТ_Сводно.Номенклатура,
			               |	ВТ_Сводно.ЕдиницаИзмерения,
			               |	ВТ_Сводно.ДатаНачисления,
			               |	ВТ_Сводно.Статья,
			               |	ВТ_Сводно.СпособПривязки,
			               |	ВТ_Сводно.ПрофильРаспределения,
			               |	ВТ_Сводно.СобствСилы_Субподряд,
			               |	ВТ_Сводно.Контрагент,
			               |	ВТ_Сводно.Договор";
			
			Выборка = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;	
		
		Если СвойстваПроведения.СвойстваЗадачи.ВключитьДопЗатратыВПланРасходов Тогда 	
			
			ТаблицаДополнительныеЗатраты = ЭтотОбъект.ДополнительныеЗатраты;
			ТаблицаРаспределениеДополнительныхЗатрат = ЭтотОбъект.РаспределениеДополнительныхЗатрат;
			
			Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
			Запрос.УстановитьПараметр("ТаблицаДополнительныеЗатраты", ТаблицаДополнительныеЗатраты);
			Запрос.УстановитьПараметр("ТаблицаРаспределениеДополнительныхЗатрат", ТаблицаРаспределениеДополнительныхЗатрат);

			Запрос.Текст = "ВЫБРАТЬ
			               |	ТаблицаДополнительныеЗатраты.КонтрагентДоходовРасходов КАК КонтрагентДоходовРасходов,
			               |	ТаблицаДополнительныеЗатраты.ДоговорДоходовРасходов КАК ДоговорДоходовРасходов,
			               |	ТаблицаДополнительныеЗатраты.Стоимость КАК Стоимость,
			               |	ТаблицаДополнительныеЗатраты.ДатаПривязкиДоходовРасходов КАК ДатаПривязкиДоходовРасходов,
			               |	ТаблицаДополнительныеЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
			               |	ТаблицаДополнительныеЗатраты.СпособПривязкиДоходовРасходов КАК СпособПривязкиДоходовРасходов,
			               |	ТаблицаДополнительныеЗатраты.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределенияДоходовРасходов,
			               |	ТаблицаДополнительныеЗатраты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
			               |ПОМЕСТИТЬ ВТ_ДополнительныеЗатраты
			               |ИЗ
			               |	&ТаблицаДополнительныеЗатраты КАК ТаблицаДополнительныеЗатраты
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаРаспределениеДополнительныхЗатрат.Подразделение КАК Подразделение,
			               |	ТаблицаРаспределениеДополнительныхЗатрат.Роль КАК Роль,
			               |	ТаблицаРаспределениеДополнительныхЗатрат.Сумма КАК Сумма,
			               |	ТаблицаРаспределениеДополнительныхЗатрат.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ТаблицаРаспределениеДополнительныхЗатрат.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
			               |ПОМЕСТИТЬ ВТ_РаспределениеДополнительныхЗатрат
			               |ИЗ
			               |	&ТаблицаРаспределениеДополнительныхЗатрат КАК ТаблицаРаспределениеДополнительныхЗатрат
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ДополнительныеЗатраты.КонтрагентДоходовРасходов КАК КонтрагентПодрядчик,
			               |	ВТ_ДополнительныеЗатраты.ДоговорДоходовРасходов КАК Заказ_ДоговорПодрядчика,
			               |	&ВалютаУправленческогоУчета КАК Валюта,
			               |	ВТ_РаспределениеДополнительныхЗатрат.Подразделение КАК Подразделение,
			               |	ВТ_РаспределениеДополнительныхЗатрат.Роль КАК Роль,
			               |	ВЫБОР
			               |		КОГДА ВТ_РаспределениеДополнительныхЗатрат.Сумма ЕСТЬ NULL
			               |			ТОГДА ВТ_ДополнительныеЗатраты.Стоимость
			               |		ИНАЧЕ ВТ_РаспределениеДополнительныхЗатрат.Сумма
			               |	КОНЕЦ КАК Сумма,
			               |	ВЫБОР
			               |		КОГДА ВТ_РаспределениеДополнительныхЗатрат.Сумма ЕСТЬ NULL
			               |			ТОГДА ВТ_ДополнительныеЗатраты.Стоимость
			               |		ИНАЧЕ ВТ_РаспределениеДополнительныхЗатрат.Сумма
			               |	КОНЕЦ КАК СуммаВалютная,
			               |	0 КАК Количество,
			               |	ВТ_ДополнительныеЗатраты.ДатаПривязкиДоходовРасходов КАК ДатаНачисления,
			               |	ВТ_ДополнительныеЗатраты.СтатьяЗатрат КАК Статья,
			               |	ВТ_ДополнительныеЗатраты.СпособПривязкиДоходовРасходов КАК СпособПривязки,
			               |	ВТ_ДополнительныеЗатраты.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределения,
			               |	ВТ_РаспределениеДополнительныхЗатрат.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ВТ_ДополнительныеЗатраты.КонтрагентДоходовРасходов КАК Контрагент,
			               |	ВТ_ДополнительныеЗатраты.ДоговорДоходовРасходов КАК Договор
			               |ПОМЕСТИТЬ ВТ_Сводно
			               |ИЗ
			               |	ВТ_ДополнительныеЗатраты КАК ВТ_ДополнительныеЗатраты
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеДополнительныхЗатрат КАК ВТ_РаспределениеДополнительныхЗатрат
			               |		ПО ВТ_ДополнительныеЗатраты.ИндексСтрокРаспределения = ВТ_РаспределениеДополнительныхЗатрат.ИндексСтрокиВладельца
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	&Ссылка КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
			               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	ВТ_Сводно.Валюта КАК Валюта,
			               |	ВТ_Сводно.Подразделение КАК Подразделение,
			               |	ВТ_Сводно.Роль КАК Роль,
			               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
			               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
			               |	СУММА(ВТ_Сводно.Количество) КАК Количество,
			               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
			               |	ВТ_Сводно.Статья КАК Статья,
			               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
			               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ВТ_Сводно.Контрагент КАК Контрагент,
			               |	ВТ_Сводно.Договор КАК Договор,
			               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты) КАК ИсточникПлана
			               |ИЗ
			               |	ВТ_Сводно КАК ВТ_Сводно
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ_Сводно.КонтрагентПодрядчик,
			               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
			               |	ВТ_Сводно.Валюта,
			               |	ВТ_Сводно.Подразделение,
			               |	ВТ_Сводно.Роль,
			               |	ВТ_Сводно.ДатаНачисления,
			               |	ВТ_Сводно.Статья,
			               |	ВТ_Сводно.СпособПривязки,
			               |	ВТ_Сводно.ПрофильРаспределения,
			               |	ВТ_Сводно.СобствСилы_Субподряд,
			               |	ВТ_Сводно.Контрагент,
			               |	ВТ_Сводно.Договор";
						
			Выборка = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Если СвойстваПроведения.СвойстваЗадачи.ВключитьМатРесурсыВПланРасходов Тогда
			
			ТаблицаМатериальныеРесурсы = ЭтотОбъект.МатериальныеРесурсы;			
			Запрос.УстановитьПараметр("ТаблицаМатериальныеРесурсы", ТаблицаМатериальныеРесурсы);
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	&Ссылка КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	ТаблицаМатериальныеРесурсы.Контрагент КАК Контрагент,
			               |	ТаблицаМатериальныеРесурсы.Договор КАК Договор,
			               |	ТаблицаМатериальныеРесурсы.Валюта КАК Валюта,
			               |	ТаблицаМатериальныеРесурсы.Ресурс КАК Номенклатура,
			               |	ТаблицаМатериальныеРесурсы.ЕдиницаНормирования КАК ЕдиницаИзмерения,
			               |	ТаблицаМатериальныеРесурсы.Количество КАК Количество,
			               |	ТаблицаМатериальныеРесурсы.ДатаПривязки КАК ДатаНачисления,
			               |	ТаблицаМатериальныеРесурсы.СтатьяЗатрат КАК Статья,
			               |	ТаблицаМатериальныеРесурсы.СпособПривязки КАК СпособПривязки,
			               |	ТаблицаМатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	ТаблицаМатериальныеРесурсы.ОбщСтоимость КАК СуммаВалютная,
			               |	ТаблицаМатериальныеРесурсы.ОбщСтоимость КАК Сумма
			               |ПОМЕСТИТЬ ВТ_сводно
			               |ИЗ
			               |	&ТаблицаМатериальныеРесурсы КАК ТаблицаМатериальныеРесурсы
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_сводно.Версия КАК Версия,
			               |	ВТ_сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ВТ_сводно.ВидЭлемента КАК ВидЭлемента,
			               |	ВТ_сводно.Контрагент КАК Контрагент,
			               |	ВТ_сводно.Договор КАК Договор,
			               |	ВТ_сводно.Валюта КАК Валюта,
			               |	ВТ_сводно.Номенклатура КАК Номенклатура,
			               |	ВТ_сводно.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	СУММА(ВТ_сводно.Количество) КАК Количество,
			               |	ВТ_сводно.ДатаНачисления КАК ДатаНачисления,
			               |	ВТ_сводно.Статья КАК Статья,
			               |	ВТ_сводно.СпособПривязки КАК СпособПривязки,
			               |	ВТ_сводно.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	СУММА(ВТ_сводно.СуммаВалютная) КАК СуммаВалютная,
			               |	СУММА(ВТ_сводно.Сумма) КАК Сумма,
			               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты) КАК ИсточникПлана
			               |ИЗ
			               |	ВТ_сводно КАК ВТ_сводно
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ_сводно.Версия,
			               |	ВТ_сводно.ВидЭлемента,
			               |	ВТ_сводно.ПроектнаяЗадача,
			               |	ВТ_сводно.Контрагент,
			               |	ВТ_сводно.Договор,
			               |	ВТ_сводно.Валюта,
			               |	ВТ_сводно.Номенклатура,
			               |	ВТ_сводно.ЕдиницаИзмерения,
			               |	ВТ_сводно.ДатаНачисления,
			               |	ВТ_сводно.Статья,
			               |	ВТ_сводно.СпособПривязки,
			               |	ВТ_сводно.ПрофильРаспределения";
			
			Выборка  = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;
		
		Если СвойстваПроведения.СвойстваЗадачи.ВключитьДопЗатратыВПланРасходов Тогда
			
			ТаблицаДополнительныеЗатраты = ЭтотОбъект.ДополнительныеЗатраты;
			
			Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
			Запрос.УстановитьПараметр("ТаблицаДополнительныеЗатраты", ТаблицаДополнительныеЗатраты);
	
			Запрос.Текст = "ВЫБРАТЬ
			               |	&ТекущаяВерсия КАК Версия,
			               |	&Ссылка КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	ТаблицаДополнительныеЗатраты.КонтрагентДоходовРасходов КАК Контрагент,
			               |	ТаблицаДополнительныеЗатраты.ДоговорДоходовРасходов КАК Договор,
			               |	&ВалютаУправленческогоУчета КАК Валюта,
			               |	ТаблицаДополнительныеЗатраты.ДатаПривязкиДоходовРасходов КАК ДатаНачисления,
			               |	ТаблицаДополнительныеЗатраты.СтатьяЗатрат КАК Статья,
			               |	ТаблицаДополнительныеЗатраты.СпособПривязкиДоходовРасходов КАК СпособПривязки,
			               |	ТаблицаДополнительныеЗатраты.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределения,
			               |	ТаблицаДополнительныеЗатраты.Стоимость КАК СуммаВалютная,
			               |	ТаблицаДополнительныеЗатраты.Стоимость КАК Сумма
			               |ПОМЕСТИТЬ ВТ_сводно
			               |ИЗ
			               |	&ТаблицаДополнительныеЗатраты КАК ТаблицаДополнительныеЗатраты
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_сводно.Версия КАК Версия,
			               |	ВТ_сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ВТ_сводно.ВидЭлемента КАК ВидЭлемента,
			               |	ВТ_сводно.Контрагент КАК Контрагент,
			               |	ВТ_сводно.Договор КАК Договор,
			               |	ВТ_сводно.Валюта КАК Валюта,
			               |	ВТ_сводно.ДатаНачисления КАК ДатаНачисления,
			               |	ВТ_сводно.Статья КАК Статья,
			               |	ВТ_сводно.СпособПривязки КАК СпособПривязки,
			               |	ВТ_сводно.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	СУММА(ВТ_сводно.СуммаВалютная) КАК СуммаВалютная,
			               |	СУММА(ВТ_сводно.Сумма) КАК Сумма,
			               |	0 КАК Количество,
			               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты) КАК ИсточникПлана
			               |ИЗ
			               |	ВТ_сводно КАК ВТ_сводно
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВТ_сводно.Версия,
			               |	ВТ_сводно.ВидЭлемента,
			               |	ВТ_сводно.ПроектнаяЗадача,
			               |	ВТ_сводно.Контрагент,
			               |	ВТ_сводно.Договор,
			               |	ВТ_сводно.Валюта,
			               |	ВТ_сводно.ДатаНачисления,
			               |	ВТ_сводно.Статья,
			               |	ВТ_сводно.СпособПривязки,
			               |	ВТ_сводно.ПрофильРаспределения";
						
			Выборка  = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуДвиженийДоходПоДаннымПЗ(ЭтотОбъект, ТаблицаДвижений, СвойстваПроведения, РаспределениеБДР, 
	РаспределениеНатурПоказателей)
	
	ТаблицаПланДоходов = ЭтотОбъект.ПланДоходов;
	ТаблицаРаспределениеДоходов = ЭтотОбъект.РаспределениеДоходов;
	ТаблицаРаспределениеОбъемов = ЭтотОбъект.РаспределениеОбъемов;
	ТаблицаСубпродукты = ЭтотОбъект.Субпродукты;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", СвойстваПроведения.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
	Запрос.УстановитьПараметр("ТаблицаПланДоходов", ТаблицаПланДоходов);	
	Запрос.УстановитьПараметр("ТаблицаРаспределениеДоходов", ТаблицаРаспределениеДоходов);	
	Запрос.УстановитьПараметр("ТаблицаРаспределениеОбъемов", ТаблицаРаспределениеОбъемов);
	Запрос.УстановитьПараметр("ТаблицаСубпродукты", ТаблицаСубпродукты);
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПланДоходов.Статья КАК Статья,
	               |	ТаблицаПланДоходов.Контрагент КАК Контрагент,
	               |	ТаблицаПланДоходов.Договор КАК Договор,
	               |	ТаблицаПланДоходов.Валюта КАК Валюта,
	               |	ТаблицаПланДоходов.Сумма КАК Сумма,
	               |	ТаблицаПланДоходов.ДатаПривязки КАК ДатаПривязки,
	               |	ТаблицаПланДоходов.СпособПривязки КАК СпособПривязки,
	               |	ТаблицаПланДоходов.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТаблицаПланДоходов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	ТаблицаПланДоходов.ИсточникПлана КАК ИсточникПлана
	               |ПОМЕСТИТЬ ВТ_ПланДоходов
	               |ИЗ
	               |	&ТаблицаПланДоходов КАК ТаблицаПланДоходов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРаспределениеДоходов.Подразделение КАК Подразделение,
	               |	ТаблицаРаспределениеДоходов.Роль КАК Роль,
	               |	ТаблицаРаспределениеДоходов.Сумма КАК Сумма,
	               |	ТаблицаРаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ТаблицаРаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ТаблицаРаспределениеДоходов.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	ТаблицаРаспределениеДоходов.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
	               |ПОМЕСТИТЬ ВТ_РаспределениеДоходов
	               |ИЗ
	               |	&ТаблицаРаспределениеДоходов КАК ТаблицаРаспределениеДоходов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекущаяВерсия КАК Версия,
	               |	&Ссылка КАК ПроектнаяЗадача,
	               |	ВТ_ПланДоходов.Статья КАК Статья,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
	               |	ВТ_ПланДоходов.Контрагент КАК Контрагент,
	               |	ВТ_ПланДоходов.Договор КАК Договор,
	               |	ВТ_ПланДоходов.Валюта КАК Валюта,
	               |	ВТ_РаспределениеДоходов.Подразделение КАК Подразделение,
	               |	ВТ_РаспределениеДоходов.Роль КАК Роль,
	               |	ВЫБОР
	               |		КОГДА ВТ_РаспределениеДоходов.Сумма ЕСТЬ NULL
	               |			ТОГДА ВТ_ПланДоходов.Сумма
	               |		ИНАЧЕ ВТ_РаспределениеДоходов.Сумма
	               |	КОНЕЦ КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ВТ_РаспределениеДоходов.Сумма ЕСТЬ NULL
	               |			ТОГДА ВТ_ПланДоходов.Сумма
	               |		ИНАЧЕ ВТ_РаспределениеДоходов.Сумма
	               |	КОНЕЦ КАК СуммаВалютная,
	               |	0 КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПланДоходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	               |			ТОГДА ВТ_ПланДоходов.ДатаПривязки
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаНачисления,
	               |	ЛОЖЬ КАК ЭтоРесурс,
	               |	ВТ_ПланДоходов.СпособПривязки КАК СпособПривязки,
	               |	ВТ_ПланДоходов.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_РаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_РаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ВТ_РаспределениеДоходов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_ПланДоходов.ИсточникПлана КАК ИсточникПлана
	               |ПОМЕСТИТЬ ВТ_Сводно
	               |ИЗ
	               |	ВТ_ПланДоходов КАК ВТ_ПланДоходов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеДоходов КАК ВТ_РаспределениеДоходов
	               |		ПО ВТ_ПланДоходов.ИндексСтрокРаспределения = ВТ_РаспределениеДоходов.ИндексСтрокиВладельца
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Сводно.Версия КАК Версия,
	               |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_Сводно.Статья КАК Статья,
	               |	ВТ_Сводно.ВидЭлемента КАК ВидЭлемента,
	               |	ВТ_Сводно.Контрагент КАК Контрагент,
	               |	ВТ_Сводно.Договор КАК Договор,
	               |	ВТ_Сводно.Валюта КАК Валюта,
	               |	ВТ_Сводно.Подразделение КАК Подразделение,
	               |	ВТ_Сводно.Роль КАК Роль,
	               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	               |	СУММА(ВТ_Сводно.Количество) КАК Количество,
	               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	               |	ВТ_Сводно.ЭтоРесурс КАК ЭтоРесурс,
	               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сводно.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |		ИНАЧЕ ВТ_Сводно.ИсточникПлана
	               |	КОНЕЦ КАК ИсточникПлана
	               |ИЗ
	               |	ВТ_Сводно КАК ВТ_Сводно
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Сводно.КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.Версия,
	               |	ВТ_Сводно.ПроектнаяЗадача,
	               |	ВТ_Сводно.Статья,
	               |	ВТ_Сводно.ВидЭлемента,
	               |	ВТ_Сводно.Контрагент,
	               |	ВТ_Сводно.Договор,
	               |	ВТ_Сводно.Валюта,
	               |	ВТ_Сводно.Подразделение,
	               |	ВТ_Сводно.Роль,
	               |	ВТ_Сводно.ДатаНачисления,
	               |	ВТ_Сводно.ЭтоРесурс,
	               |	ВТ_Сводно.СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сводно.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |		ИНАЧЕ ВТ_Сводно.ИсточникПлана
	               |	КОНЕЦ";
	
	Выборка  = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаДвижений.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
	КонецЦикла;
	
	Если РаспределениеНатурПоказателей = Истина
		И РаспределениеБДР И СвойстваПроведения.СвойстваПроекта.ДоходыПоНатуральнымПоказателям Тогда
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСубпродукты.Контрагент КАК Контрагент,
	               |	ТаблицаСубпродукты.Договор КАК Договор,
	               |	ТаблицаСубпродукты.Валюта КАК Валюта,
	               |	ТаблицаСубпродукты.Ресурс КАК Ресурс,
	               |	ТаблицаСубпродукты.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	ТаблицаСубпродукты.СтатьяДоходов КАК СтатьяДоходов,
	               |	ТаблицаСубпродукты.ОбщСтоимость КАК ОбщСтоимость,
	               |	ТаблицаСубпродукты.Количество КАК Количество,
	               |	ТаблицаСубпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТаблицаСубпродукты.ДатаПривязки КАК ДатаПривязки,
	               |	ТаблицаСубпродукты.СпособПривязки КАК СпособПривязки,
	               |	ТаблицаСубпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
	               |ПОМЕСТИТЬ ВТ_Субпродукты
	               |ИЗ
	               |	&ТаблицаСубпродукты КАК ТаблицаСубпродукты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаРаспределениеОбъемов.Подразделение КАК Подразделение,
	               |	ТаблицаРаспределениеОбъемов.Роль КАК Роль,
	               |	ТаблицаРаспределениеОбъемов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ТаблицаРаспределениеОбъемов.Сумма КАК Сумма,
	               |	ТаблицаРаспределениеОбъемов.Количество КАК Количество,
	               |	ТаблицаРаспределениеОбъемов.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТаблицаРаспределениеОбъемов.ДатаПривязки КАК ДатаПривязки,
	               |	ТаблицаРаспределениеОбъемов.СпособПривязки КАК СпособПривязки,
	               |	ТаблицаРаспределениеОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ТаблицаРаспределениеОбъемов.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	ТаблицаРаспределениеОбъемов.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	               |	ТаблицаРаспределениеОбъемов.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам
	               |ПОМЕСТИТЬ ВТ_РаспределениеОбъемов
	               |ИЗ
	               |	&ТаблицаРаспределениеОбъемов КАК ТаблицаРаспределениеОбъемов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекущаяВерсия КАК Версия,
	               |	&Ссылка КАК ПроектнаяЗадача,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
	               |	ВТ_Субпродукты.Контрагент КАК Контрагент,
	               |	ВТ_Субпродукты.Договор КАК Договор,
	               |	ВТ_Субпродукты.Валюта КАК Валюта,
	               |	ВТ_РаспределениеОбъемов.Подразделение КАК Подразделение,
	               |	ВТ_РаспределениеОбъемов.Роль КАК Роль,
	               |	ВТ_Субпродукты.Ресурс КАК Номенклатура,
	               |	ВТ_Субпродукты.ЕдиницаНормирования КАК ЕдиницаИзмерения,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_РаспределениеОбъемов.Сумма ЕСТЬ NULL
	               |				ТОГДА ВТ_Субпродукты.ОбщСтоимость
	               |			ИНАЧЕ ВТ_РаспределениеОбъемов.Сумма
	               |		КОНЕЦ) КАК Сумма,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_РаспределениеОбъемов.Сумма ЕСТЬ NULL
	               |				ТОГДА ВТ_Субпродукты.ОбщСтоимость
	               |			ИНАЧЕ ВТ_РаспределениеОбъемов.Сумма
	               |		КОНЕЦ) КАК СуммаВалютная,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_РаспределениеОбъемов.Количество ЕСТЬ NULL
	               |				ТОГДА ВТ_Субпродукты.Количество
	               |			ИНАЧЕ ВТ_РаспределениеОбъемов.Количество
	               |		КОНЕЦ) КАК Количество,
	               |	ВТ_Субпродукты.ДатаПривязки КАК ДатаНачисления,
	               |	ВТ_Субпродукты.СтатьяДоходов КАК Статья,
	               |	ВТ_Субпродукты.СпособПривязки КАК СпособПривязки,
	               |	ВТ_Субпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_РаспределениеОбъемов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_РаспределениеОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_РаспределениеОбъемов.КонтрагентПодрядчик КАК КонтрагентПодрядчик
	               |ПОМЕСТИТЬ ВТ_Сводно
	               |ИЗ
	               |	ВТ_Субпродукты КАК ВТ_Субпродукты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеОбъемов КАК ВТ_РаспределениеОбъемов
	               |		ПО ВТ_Субпродукты.ИндексСтрокРаспределения = ВТ_РаспределениеОбъемов.ИндексСтрокиВладельца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Субпродукты.Контрагент,
	               |	ВТ_Субпродукты.Договор,
	               |	ВТ_Субпродукты.Валюта,
	               |	ВТ_Субпродукты.Ресурс,
	               |	ВТ_Субпродукты.ЕдиницаНормирования,
	               |	ВТ_Субпродукты.ДатаПривязки,
	               |	ВТ_Субпродукты.СтатьяДоходов,
	               |	ВТ_Субпродукты.СпособПривязки,
	               |	ВТ_Субпродукты.ПрофильРаспределения,
	               |	ВТ_РаспределениеОбъемов.ЗаказДоговорПодрядчика,
	               |	ВТ_РаспределениеОбъемов.СобствСилы_Субподряд,
	               |	ВТ_РаспределениеОбъемов.КонтрагентПодрядчик,
	               |	ВТ_РаспределениеОбъемов.Подразделение,
	               |	ВТ_РаспределениеОбъемов.Роль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Сводно.Версия КАК Версия,
	               |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_Сводно.ВидЭлемента КАК ВидЭлемента,
	               |	ВТ_Сводно.Контрагент КАК Контрагент,
	               |	ВТ_Сводно.Договор КАК Договор,
	               |	ВТ_Сводно.Валюта КАК Валюта,
	               |	ВТ_Сводно.Подразделение КАК Подразделение,
	               |	ВТ_Сводно.Роль КАК Роль,
	               |	ВТ_Сводно.Номенклатура КАК Номенклатура,
	               |	ВТ_Сводно.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	               |	СУММА(ВТ_Сводно.Количество) КАК Количество,
	               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	               |	ВТ_Сводно.Статья КАК Статья,
	               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Объемы) КАК ИсточникПлана
	               |ИЗ
	               |	ВТ_Сводно КАК ВТ_Сводно
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Сводно.Версия,
	               |	ВТ_Сводно.ПроектнаяЗадача,
	               |	ВТ_Сводно.ВидЭлемента,
	               |	ВТ_Сводно.ДатаНачисления,
	               |	ВТ_Сводно.Статья,
	               |	ВТ_Сводно.СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик,
	               |	ВТ_Сводно.Контрагент,
	               |	ВТ_Сводно.Договор,
	               |	ВТ_Сводно.Валюта,
	               |	ВТ_Сводно.Подразделение,
	               |	ВТ_Сводно.Роль,
	               |	ВТ_Сводно.Номенклатура,
	               |	ВТ_Сводно.ЕдиницаИзмерения";
		
		Выборка  = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ТаблицаДвижений.Добавить();				
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВключитьСубпродуктыВПланДоходов = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(
		СвойстваПроведения.ПроектнаяЗадача, "ВключитьСубпродуктыВПланДоходов", Ложь);
	
	Если ВключитьСубпродуктыВПланДоходов 
		И РаспределениеНатурПоказателей = Ложь Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаСубпродукты.Контрагент КАК Контрагент,
		               |	ТаблицаСубпродукты.Договор КАК Договор,
		               |	ТаблицаСубпродукты.Валюта КАК Валюта,
		               |	ТаблицаСубпродукты.Ресурс КАК Ресурс,
		               |	ТаблицаСубпродукты.ЕдиницаНормирования КАК ЕдиницаНормирования,
		               |	ТаблицаСубпродукты.СтатьяДоходов КАК СтатьяДоходов,
		               |	ТаблицаСубпродукты.ОбщСтоимость КАК ОбщСтоимость,
		               |	ТаблицаСубпродукты.Количество КАК Количество,
		               |	ТаблицаСубпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
		               |	ТаблицаСубпродукты.ДатаПривязки КАК ДатаПривязки,
		               |	ТаблицаСубпродукты.СпособПривязки КАК СпособПривязки,
		               |	ТаблицаСубпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
		               |ПОМЕСТИТЬ ВТ_Субпродукты
		               |ИЗ
		               |	&ТаблицаСубпродукты КАК ТаблицаСубпродукты
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&ТекущаяВерсия КАК Версия,
		               |	&Ссылка КАК ПроектнаяЗадача,
		               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
		               |	ВТ_Субпродукты.Контрагент КАК Контрагент,
		               |	ВТ_Субпродукты.Договор КАК Договор,
		               |	ВТ_Субпродукты.Валюта КАК Валюта,
		               |	ВТ_Субпродукты.Ресурс КАК Номенклатура,
		               |	ВТ_Субпродукты.ЕдиницаНормирования КАК ЕдиницаИзмерения,
		               |	ВТ_Субпродукты.Количество КАК Количество,
		               |	ВТ_Субпродукты.ДатаПривязки КАК ДатаНачисления,
		               |	ВТ_Субпродукты.СтатьяДоходов КАК Статья,
		               |	ВТ_Субпродукты.СпособПривязки КАК СпособПривязки,
		               |	ВТ_Субпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
		               |	ВТ_Субпродукты.ОбщСтоимость КАК СуммаВалютная,
		               |	ВТ_Субпродукты.ОбщСтоимость КАК Сумма
		               |ПОМЕСТИТЬ ВТ_Сводно
		               |ИЗ
		               |	ВТ_Субпродукты КАК ВТ_Субпродукты
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Сводно.Версия КАК Версия,
		               |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	ВТ_Сводно.ВидЭлемента КАК ВидЭлемента,
		               |	ВТ_Сводно.Контрагент КАК Контрагент,
		               |	ВТ_Сводно.Договор КАК Договор,
		               |	ВТ_Сводно.Валюта КАК Валюта,
		               |	ВТ_Сводно.Номенклатура КАК Номенклатура,
		               |	ВТ_Сводно.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	СУММА(ВТ_Сводно.Количество) КАК Количество,
		               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
		               |	ВТ_Сводно.Статья КАК Статья,
		               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
		               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
		               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
		               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
		               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Объемы) КАК ИсточникПлана
		               |ИЗ
		               |	ВТ_Сводно КАК ВТ_Сводно
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Сводно.Договор,
		               |	ВТ_Сводно.Валюта,
		               |	ВТ_Сводно.Номенклатура,
		               |	ВТ_Сводно.ЕдиницаИзмерения,
		               |	ВТ_Сводно.ДатаНачисления,
		               |	ВТ_Сводно.Статья,
		               |	ВТ_Сводно.СпособПривязки,
		               |	ВТ_Сводно.ПрофильРаспределения,
		               |	ВТ_Сводно.Версия,
		               |	ВТ_Сводно.ПроектнаяЗадача,
		               |	ВТ_Сводно.ВидЭлемента,
		               |	ВТ_Сводно.Контрагент";
		
		Выборка  = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ТаблицаДвижений.Добавить();				
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

//

Процедура ЗаполнитьМассивыЗадачТрансляции(ЗадачиВключитьМатРесурсыВПланРасходов, ЗадачиВключитьДопЗатратыВПланРасходов, 
		ЗадачиВключитьСубпродуктыВПланДоходов, Версия, СписокЗадач)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущаяВерсия", Версия);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьМатРесурсыВПланРасходов КАК ВключитьМатРесурсыВПланРасходов,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьДопЗатратыВПланРасходов КАК ВключитьДопЗатратыВПланРасходов,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьСубпродуктыВПланДоходов КАК ВключитьСубпродуктыВПланДоходов
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &ТекущаяВерсия
	               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	(упоСвойстваПроектныхЗадачСрезПоследних.ВключитьДопЗатратыВПланРасходов
	               |			ИЛИ упоСвойстваПроектныхЗадачСрезПоследних.ВключитьМатРесурсыВПланРасходов
	               |			ИЛИ упоСвойстваПроектныхЗадачСрезПоследних.ВключитьСубпродуктыВПланДоходов)";							
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВключитьМатРесурсыВПланРасходов Тогда
				ЗадачиВключитьМатРесурсыВПланРасходов.Добавить(Выборка.ПроектнаяЗадача);
			КонецЕсли;	
			Если Выборка.ВключитьДопЗатратыВПланРасходов Тогда
				ЗадачиВключитьДопЗатратыВПланРасходов.Добавить(Выборка.ПроектнаяЗадача);
			КонецЕсли;
			Если Выборка.ВключитьСубпродуктыВПланДоходов Тогда
				ЗадачиВключитьСубпродуктыВПланДоходов.Добавить(Выборка.ПроектнаяЗадача);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;			
	
КонецПроцедуры	

Процедура ЗаполнитьТаблицуДвиженийРасходПоДаннымРегистров(ТаблицаДвижений, СвойстваПроведения, СвойстваПроекта)
	
	ЗадачиВключитьМатРесурсыВПланРасходов = СвойстваПроведения.ЗадачиВключитьМатРесурсыВПланРасходов;
	ЗадачиВключитьДопЗатратыВПланРасходов = СвойстваПроведения.ЗадачиВключитьДопЗатратыВПланРасходов;	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("СписокЗадач", СвойстваПроведения.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Статья КАК Статья,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
				   |	ЕСТЬNULL(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма, упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма) КАК Сумма,
	               |	ЕСТЬNULL(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная, упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
				   |	ВЫБОР
				   |		КОГДА упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
				   |			ТОГДА упоДанныеПлановДоходовИРасходовСрезПоследних.ДатаПривязки
				   |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				   |	КОНЕЦ КАК ДатаНачисления,
				   |	упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки КАК СпособПривязки,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Контрагент КАК КонтрагентПодрядчик,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Договор КАК Заказ_ДоговорПодрядчика,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Контрагент КАК Контрагент,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Договор КАК Договор,
	               |	&ИсточникПлана КАК ИсточникПлана,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПериодАгрегации КАК ПериодАгрегации
	               |ПОМЕСТИТЬ ВТ_Сводно
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
	               |			,
	               |			Версия = &ТекущаяВерсия
	               |				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	               |				И ПроектнаяЗадача В (&СписокЗадач)
	               |				И (ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |					ИЛИ ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка))) КАК упоДанныеПлановДоходовИРасходовСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
	               |				,
	               |				Версия = &ТекущаяВерсия
	               |					И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	               |					И ПроектнаяЗадача В (&СписокЗадач)
	               |					И (ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |						ИЛИ ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка))) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
	               |		ПО упоДанныеПлановДоходовИРасходовСрезПоследних.ИндексСтрокРаспределения = упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца
	               |			И упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача = упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача
	               |			И (упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
	               |				ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0
	               |				ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0)
	               |ГДЕ
	               |	(упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма <> 0
	               |			ИЛИ упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная <> 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекущаяВерсия КАК Версия,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
	               |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_Сводно.Статья КАК Статья,
	               |	ВТ_Сводно.Валюта КАК Валюта,
	               |	ВТ_Сводно.Подразделение КАК Подразделение,
	               |	ВТ_Сводно.Роль КАК Роль,
	               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.Контрагент КАК Контрагент,
	               |	ВТ_Сводно.Договор КАК Договор,
	               |	ВТ_Сводно.ИсточникПлана КАК ИсточникПлана,
	               |	0 КАК Количество,
	               |	ВТ_Сводно.ПериодАгрегации КАК ПериодАгрегации
	               |ИЗ
	               |	ВТ_Сводно КАК ВТ_Сводно
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Сводно.Статья,
	               |	ВТ_Сводно.Валюта,
	               |	ВТ_Сводно.Подразделение,
	               |	ВТ_Сводно.Роль,
	               |	ВТ_Сводно.ДатаНачисления,
	               |	ВТ_Сводно.СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.Контрагент,
	               |	ВТ_Сводно.Договор,
	               |	ВТ_Сводно.ИсточникПлана,
	               |	ВТ_Сводно.ПроектнаяЗадача,
	               |	ВТ_Сводно.ПериодАгрегации";
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = ТаблицаДвижений.Добавить();			
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
	КонецЦикла;
	
	Если СвойстваПроекта.РасходыПоПодразделениям Тогда	
		
		Если ЗадачиВключитьМатРесурсыВПланРасходов.Количество() > 0 Тогда 	
			
			Запрос.УстановитьПараметр("СписокЗадач", ЗадачиВключитьМатРесурсыВПланРасходов);
			Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Номенклатура КАК Номенклатура,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Контрагент КАК Контрагент,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Договор КАК Договор,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Валюта КАК Валюта,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Версия КАК Версия,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязкиРасхода КАК СпособПривязкиРасхода,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество КАК Количество,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма КАК Сумма,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная КАК СуммаВалютная,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ВидОперации КАК ВидОперации
			               |ПОМЕСТИТЬ втМатериальныеРесурсы
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних
			               |ГДЕ
			               |	(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество <> 0
			               |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма <> 0
			               |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная <> 0)
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ПроектнаяЗадача
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма КАК Сумма,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество КАК Количество
			               |ПОМЕСТИТЬ втМатериальныеРесурсыПоПодразделениям
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)
			               |				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
			               |ГДЕ
			               |	(упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
			               |			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0
			               |			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество <> 0)
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ПроектнаяЗадача
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	втМатериальныеРесурсы.Версия КАК Версия,
			               |	втМатериальныеРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	втМатериальныеРесурсы.Номенклатура КАК Номенклатура,
			               |	втМатериальныеРесурсы.Контрагент КАК КонтрагентПодрядчик,
			               |	втМатериальныеРесурсы.Договор КАК Заказ_ДоговорПодрядчика,
			               |	втМатериальныеРесурсы.Валюта КАК Валюта,
			               |	втМатериальныеРесурсыПоПодразделениям.Подразделение КАК Подразделение,
			               |	втМатериальныеРесурсыПоПодразделениям.Роль КАК Роль,
			               |	втМатериальныеРесурсы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	СУММА(ЕСТЬNULL(втМатериальныеРесурсыПоПодразделениям.Сумма, втМатериальныеРесурсы.Сумма)) КАК Сумма,
			               |	СУММА(ЕСТЬNULL(втМатериальныеРесурсыПоПодразделениям.СуммаВалютная, втМатериальныеРесурсы.СуммаВалютная)) КАК СуммаВалютная,
			               |	СУММА(ЕСТЬNULL(втМатериальныеРесурсыПоПодразделениям.Количество, втМатериальныеРесурсы.Количество)) КАК Количество,
			               |	втМатериальныеРесурсы.ДатаПривязки КАК ДатаНачисления,
			               |	втМатериальныеРесурсы.СтатьяЗатрат КАК Статья,
			               |	втМатериальныеРесурсы.СпособПривязкиРасхода КАК СпособПривязки,
			               |	втМатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	втМатериальныеРесурсыПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	втМатериальныеРесурсы.Контрагент КАК Контрагент,
			               |	втМатериальныеРесурсы.Договор КАК Договор,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	&ИсточникПлана КАК ИсточникПлана
			               |ИЗ
			               |	втМатериальныеРесурсы КАК втМатериальныеРесурсы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ втМатериальныеРесурсыПоПодразделениям КАК втМатериальныеРесурсыПоПодразделениям
			               |		ПО втМатериальныеРесурсы.ПроектнаяЗадача = втМатериальныеРесурсыПоПодразделениям.ПроектнаяЗадача
			               |			И втМатериальныеРесурсы.ИндексСтрокРаспределения = втМатериальныеРесурсыПоПодразделениям.ИндексСтрокиВладельца
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	втМатериальныеРесурсы.Версия,
			               |	втМатериальныеРесурсы.Контрагент,
			               |	втМатериальныеРесурсы.Договор,
			               |	втМатериальныеРесурсы.Валюта,
			               |	втМатериальныеРесурсыПоПодразделениям.Подразделение,
			               |	втМатериальныеРесурсыПоПодразделениям.Роль,
			               |	втМатериальныеРесурсы.ЕдиницаИзмерения,
			               |	втМатериальныеРесурсы.ДатаПривязки,
			               |	втМатериальныеРесурсы.СтатьяЗатрат,
			               |	втМатериальныеРесурсы.ПрофильРаспределения,
			               |	втМатериальныеРесурсыПоПодразделениям.СобствСилы_Субподряд,
			               |	втМатериальныеРесурсы.ПроектнаяЗадача,
			               |	втМатериальныеРесурсы.Номенклатура,
			               |	втМатериальныеРесурсы.СпособПривязкиРасхода,
			               |	втМатериальныеРесурсы.Контрагент,
			               |	втМатериальныеРесурсы.Договор";							
			
			Выборка = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;	
		
		Если ЗадачиВключитьДопЗатратыВПланРасходов.Количество() > 0 Тогда 	
			
			Запрос.УстановитьПараметр("СписокЗадач", ЗадачиВключитьДопЗатратыВПланРасходов);
			Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.КонтрагентДоходовРасходов КАК КонтрагентДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДоговорДоходовРасходов КАК ДоговорДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СпособПривязкиДоходовРасходов КАК СпособПривязкиДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределенияДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДатаПривязкиДоходовРасходов КАК ДатаПривязкиДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма КАК Сумма
			               |ПОМЕСТИТЬ ВТ_ДополнительныеЗатраты
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановДополнительныхЗатрат.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДополнительныхЗатратСрезПоследних
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Подразделение КАК Подразделение,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Роль КАК Роль,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
			               |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Сумма КАК Сумма
			               |ПОМЕСТИТЬ ВТ_РаспределениеПоПодразделениям
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановДополнительныхЗатратПодразделения.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ДополнительныеЗатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ВТ_ДополнительныеЗатраты.КонтрагентДоходовРасходов КАК КонтрагентПодрядчик,
			               |	ВТ_ДополнительныеЗатраты.ДоговорДоходовРасходов КАК Заказ_ДоговорПодрядчика,
			               |	ВТ_РаспределениеПоПодразделениям.Подразделение КАК Подразделение,
			               |	ВТ_РаспределениеПоПодразделениям.Роль КАК Роль,
			               |	ВТ_ДополнительныеЗатраты.ДатаПривязкиДоходовРасходов КАК ДатаНачисления,
			               |	ВТ_ДополнительныеЗатраты.СтатьяЗатрат КАК Статья,
			               |	ВТ_ДополнительныеЗатраты.СпособПривязкиДоходовРасходов КАК СпособПривязки,
			               |	ВТ_ДополнительныеЗатраты.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределения,
			               |	ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ВТ_ДополнительныеЗатраты.КонтрагентДоходовРасходов КАК Контрагент,
			               |	ВТ_ДополнительныеЗатраты.ДоговорДоходовРасходов КАК Договор,
			               |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.Сумма, ВТ_ДополнительныеЗатраты.Сумма) КАК Сумма,
			               |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.Сумма, ВТ_ДополнительныеЗатраты.Сумма) КАК СуммаВалютная
			               |ПОМЕСТИТЬ ВТ_Сводно
			               |ИЗ
			               |	ВТ_ДополнительныеЗатраты КАК ВТ_ДополнительныеЗатраты
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
			               |		ПО ВТ_ДополнительныеЗатраты.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
			               |			И ВТ_ДополнительныеЗатраты.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
						   |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	&ТекущаяВерсия КАК Версия,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
			               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	&ВалютаУправленческогоУчета КАК Валюта,
			               |	ВТ_Сводно.Подразделение КАК Подразделение,
			               |	ВТ_Сводно.Роль КАК Роль,
			               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
			               |	ВТ_Сводно.Статья КАК Статья,
			               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
			               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	ВТ_Сводно.Контрагент КАК Контрагент,
			               |	ВТ_Сводно.Договор КАК Договор,
			               |	&ИсточникПлана КАК ИсточникПлана,
			               |	0 КАК Количество,
			               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
			               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная
			               |ИЗ
			               |	ВТ_Сводно КАК ВТ_Сводно
			               |
			               |СГРУППИРОВАТЬ ПО
						   |	ВТ_Сводно.ПроектнаяЗадача,
			               |	ВТ_Сводно.КонтрагентПодрядчик,
			               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
			               |	ВТ_Сводно.Подразделение,
			               |	ВТ_Сводно.Роль,
			               |	ВТ_Сводно.ДатаНачисления,
			               |	ВТ_Сводно.Статья,
			               |	ВТ_Сводно.СпособПривязки,
			               |	ВТ_Сводно.ПрофильРаспределения,
			               |	ВТ_Сводно.СобствСилы_Субподряд,
			               |	ВТ_Сводно.Контрагент,
			               |	ВТ_Сводно.Договор";						
			
			Выборка = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗадачиВключитьМатРесурсыВПланРасходов.Количество() > 0 Тогда
			
			Запрос.УстановитьПараметр("ПроектнаяЗадача", ЗадачиВключитьМатРесурсыВПланРасходов);			
			Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
			               |ПОМЕСТИТЬ втПроектныеЗадачиТрансляции
			               |ИЗ
			               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
			               |ГДЕ
			               |	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьМатРесурсыВПланРасходов
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ПроектнаяЗадача
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Номенклатура КАК Номенклатура,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Контрагент КАК Контрагент,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Договор КАК Договор,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Валюта КАК Валюта,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Версия КАК Версия,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязкиРасхода КАК СпособПривязкиРасхода,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество КАК Количество,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма КАК Сумма,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная КАК СуммаВалютная,
			               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ВидОперации КАК ВидОперации
			               |ПОМЕСТИТЬ втМатериальныеРесурсы
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних
			               |ГДЕ
			               |	(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество <> 0
			               |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма <> 0
			               |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная <> 0)
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ПроектнаяЗадача
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	втМатериальныеРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	втМатериальныеРесурсы.Номенклатура КАК Номенклатура,
			               |	втМатериальныеРесурсы.Контрагент КАК Контрагент,
			               |	втМатериальныеРесурсы.Договор КАК Договор,
			               |	втМатериальныеРесурсы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	втМатериальныеРесурсы.Валюта КАК Валюта,
			               |	втМатериальныеРесурсы.Версия КАК Версия,
			               |	втМатериальныеРесурсы.ВидОперации КАК ВидОперации,
			               |	втМатериальныеРесурсы.СтатьяЗатрат КАК Статья,
			               |	втМатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	втМатериальныеРесурсы.СпособПривязкиРасхода КАК СпособПривязки,
			               |	втМатериальныеРесурсы.ДатаПривязки КАК ДатаПривязки,
			               |	СУММА(втМатериальныеРесурсы.Количество) КАК Количество,
			               |	СУММА(втМатериальныеРесурсы.Сумма) КАК Сумма,
			               |	СУММА(втМатериальныеРесурсы.СуммаВалютная) КАК СуммаВалютная,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	&ИсточникПлана КАК ИсточникПлана
			               |ИЗ
			               |	втМатериальныеРесурсы КАК втМатериальныеРесурсы
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	втМатериальныеРесурсы.ПроектнаяЗадача,
			               |	втМатериальныеРесурсы.Номенклатура,
			               |	втМатериальныеРесурсы.Контрагент,
			               |	втМатериальныеРесурсы.Договор,
			               |	втМатериальныеРесурсы.ЕдиницаИзмерения,
			               |	втМатериальныеРесурсы.Валюта,
			               |	втМатериальныеРесурсы.Версия,
			               |	втМатериальныеРесурсы.ВидОперации,
			               |	втМатериальныеРесурсы.СтатьяЗатрат,
			               |	втМатериальныеРесурсы.ПрофильРаспределения,
			               |	втМатериальныеРесурсы.СпособПривязкиРасхода,
			               |	втМатериальныеРесурсы.ДатаПривязки";
			Выборка  = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗадачиВключитьДопЗатратыВПланРасходов.Количество() > 0 Тогда
			
			Запрос.УстановитьПараметр("ПроектнаяЗадача", ЗадачиВключитьДопЗатратыВПланРасходов);
			Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СтатьяЗатрат КАК Статья,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.КонтрагентДоходовРасходов КАК Контрагент,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДоговорДоходовРасходов КАК Договор,
			               |	&ВалютаУправленческогоУчета КАК Валюта,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СпособПривязкиДоходовРасходов КАК СпособПривязки,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределения,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДатаПривязкиДоходовРасходов КАК ДатаНачисления,
			               |	СУММА(упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма) КАК Сумма,
			               |	СУММА(упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма) КАК СуммаВалютная,
			               |	0 КАК Количество,
			               |	&ИсточникПлана КАК ИсточникПлана
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановДополнительныхЗатрат.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДополнительныхЗатратСрезПоследних
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СтатьяЗатрат,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.КонтрагентДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДоговорДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СпособПривязкиДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПрофильРаспределенияДоходовРасходов,
			               |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДатаПривязкиДоходовРасходов";
									
			Выборка  = Запрос.Выполнить().Выбрать();			
			Пока Выборка.Следующий() Цикл				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуДвиженийДоходПоДаннымРегистров(ТаблицаДвижений, СвойстваПроведения, Знач РаспределениеБДР, 
	РаспределениеНатурПоказателей)
	
	ЗадачиВключитьСубпродуктыВПланДоходов = СвойстваПроведения.ЗадачиВключитьСубпродуктыВПланДоходов;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("СписокЗадач", СвойстваПроведения.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваПроведения.Версия);
	Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Статья КАК Статья,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	               |	ЕСТЬNULL(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма, упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма) КАК Сумма,
	               |	ЕСТЬNULL(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная, упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
				   |	ВЫБОР
				   |		КОГДА упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
				   |			ТОГДА упоДанныеПлановДоходовИРасходовСрезПоследних.ДатаПривязки
				   |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
				   |	КОНЕЦ КАК ДатаНачисления,
				   |	упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки КАК СпособПривязки,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
				   |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
				   |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Контрагент КАК Контрагент,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Договор КАК Договор,
	               |	&ИсточникПлана КАК ИсточникПлана
	               |ПОМЕСТИТЬ ВТ_Сводно
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
	               |			,
	               |			Версия = &ТекущаяВерсия
	               |				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	               |				И ПроектнаяЗадача В (&СписокЗадач)
	               |				И (ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |					ИЛИ ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка))) КАК упоДанныеПлановДоходовИРасходовСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
	               |				,
	               |				Версия = &ТекущаяВерсия
	               |					И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	               |					И ПроектнаяЗадача В (&СписокЗадач)
	               |					И (ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	               |						ИЛИ ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка))) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
	               |		ПО упоДанныеПлановДоходовИРасходовСрезПоследних.ИндексСтрокРаспределения = упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца
	               |			И упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача = упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача
	               |			И (упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
	               |				ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0
	               |				ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0)
	               |ГДЕ
	               |	(упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма <> 0
	               |			ИЛИ упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная <> 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ТекущаяВерсия КАК Версия,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
	               |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_Сводно.Статья КАК Статья,
	               |	ВТ_Сводно.Валюта КАК Валюта,
	               |	ВТ_Сводно.Подразделение КАК Подразделение,
	               |	ВТ_Сводно.Роль КАК Роль,
	               |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	               |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	               |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	               |	ВТ_Сводно.СпособПривязки КАК СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.Контрагент КАК Контрагент,
	               |	ВТ_Сводно.Договор КАК Договор,
	               |	ЛОЖЬ КАК ЭтоРесурс,
	               |	ВТ_Сводно.ИсточникПлана КАК ИсточникПлана,
	               |	0 КАК Количество
	               |ИЗ
	               |	ВТ_Сводно КАК ВТ_Сводно
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Сводно.Статья,
	               |	ВТ_Сводно.Валюта,
	               |	ВТ_Сводно.Подразделение,
	               |	ВТ_Сводно.Роль,
	               |	ВТ_Сводно.ДатаНачисления,
	               |	ВТ_Сводно.СпособПривязки,
	               |	ВТ_Сводно.ПрофильРаспределения,
	               |	ВТ_Сводно.СобствСилы_Субподряд,
	               |	ВТ_Сводно.КонтрагентПодрядчик,
	               |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	               |	ВТ_Сводно.Контрагент,
	               |	ВТ_Сводно.Договор,
	               |	ВТ_Сводно.ИсточникПлана,
	               |	ВТ_Сводно.ПроектнаяЗадача";
	
	Выборка  = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл				
		ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Выборка);		
	КонецЦикла;			
	
	Если РаспределениеНатурПоказателей Тогда		
		
		Если РаспределениеБДР = Неопределено Тогда // Определялось из свойств ПЗ.
			РаспределениеБДР = ЗадачиВключитьСубпродуктыВПланДоходов.Количество() > 0;
			Запрос.УстановитьПараметр("СписокЗадач", ЗадачиВключитьСубпродуктыВПланДоходов);
			Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.Объемы);
		КонецЕсли;	 
		
		Если РаспределениеБДР И СвойстваПроведения.СвойстваПроекта.ДоходыПоНатуральнымПоказателям Тогда
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	&ТекущаяВерсия КАК Версия,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент КАК Контрагент,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор КАК Договор,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта КАК Валюта,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов КАК Статья,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов КАК СпособПривязки,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки КАК ДатаНачисления,
			               |	СУММА(ЕСТЬNULL(упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество, упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество)) КАК Количество,
			               |	СУММА(ЕСТЬNULL(упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма, упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма)) КАК Сумма,
			               |	СУММА(ЕСТЬNULL(упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная, упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная)) КАК СуммаВалютная,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
			               |	&ИсточникПлана КАК ИсточникПлана
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
			               |				,
			               |				Версия = &ТекущаяВерсия
			               |					И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)
			               |					И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
			               |		ПО упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача = упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПроектнаяЗадача
			               |			И упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ИндексСтрокРаспределения = упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца
			               |			И (упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
			               |				ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0
			               |				ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество <> 0)
			               |ГДЕ
			               |	(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма <> 0
			               |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество <> 0
			               |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная <> 0)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ЕдиницаИзмерения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд,
			               |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.КонтрагентПодрядчик";						
			
			Выборка  = Запрос.Выполнить().Выбрать();		
			Пока Выборка.Следующий() Цикл						
				ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Выборка);			
			КонецЦикла;	
			
		КонецЕсли;	
		
	Иначе
		
		Если ЗадачиВключитьСубпродуктыВПланДоходов.Количество() > 0 Тогда
			
			Запрос.УстановитьПараметр("СписокЗадач", ЗадачиВключитьСубпродуктыВПланДоходов);
			//Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.Объемы);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	&ТекущаяВерсия КАК Версия,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
			               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент КАК Контрагент,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор КАК Договор,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта КАК Валюта,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов КАК Статья,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов КАК СпособПривязки,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
			               |	СУММА(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество) КАК Количество,
			               |	СУММА(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма) КАК Сумма,
			               |	СУММА(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
			               |	&ИсточникПлана КАК ИсточникПлана
			               |ИЗ
			               |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
			               |			,
			               |			Версия = &ТекущаяВерсия
			               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
			               |ГДЕ
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма <> 0
			               |	И упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество <> 0
			               |	И упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная <> 0
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ЕдиницаИзмерения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов,
			               |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки";
			
			Выборка  = Запрос.Выполнить().Выбрать();		
			Пока Выборка.Следующий() Цикл						
				ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Выборка);			
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

//

Процедура ЗаполнитьТаблицуДвиженийАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(ТаблицаДвижений, РезультатЗапроса, СрокиЗадач)
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДоходРасход = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДоходРасход.Следующий() Цикл
		
		Если ВыборкаДоходРасход.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.НаДату Тогда					
			НоваяСтрока = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДоходРасход);					
		ИначеЕсли ВыборкаДоходРасход.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения Тогда
			
			СрокиЗадачи = СрокиЗадач[ВыборкаДоходРасход.ПроектнаяЗадача].Результат;
			
			Если ЗначениеЗаполнено(СрокиЗадачи.ДатаНачала) Тогда
				Если ВыборкаДоходРасход.СуммаВалютная = 0 Тогда
					ТаблицаРаспределенная = обРаспределитьДоходыИРасходыПоПрофилю(ВыборкаДоходРасход.ПрофильРаспределения,
						СрокиЗадачи.ДатаНачала,
						СрокиЗадачи.ДатаЗавершения,					
						ВыборкаДоходРасход.Количество,
						Истина);
					ЗаполнитьСтрокуДвиженияАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(
						ТаблицаРаспределенная, 
						ТаблицаДвижений, 
						ВыборкаДоходРасход, 
						Ложь);
				Иначе
					ТаблицаРаспределенная = обРаспределитьДоходыИРасходыПоПрофилю(ВыборкаДоходРасход.ПрофильРаспределения,
						СрокиЗадачи.ДатаНачала,
						СрокиЗадачи.ДатаЗавершения,
						ВыборкаДоходРасход.СуммаВалютная);
					ЗаполнитьСтрокуДвиженияАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(
						ТаблицаРаспределенная, 
						ТаблицаДвижений, 
						ВыборкаДоходРасход);	
				КонецЕсли;
			Иначе						
				НоваяСтрока = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДоходРасход);						
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстДоходыПоОбъемам_ДанныеДокумента()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаРаспределениеДоходовПоПериодам.НомерСтроки КАК НомерСтроки,
	        |	ТаблицаРаспределениеДоходовПоПериодам.Период КАК Период,
	        |	ТаблицаРаспределениеДоходовПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	ТаблицаРаспределениеДоходовПоПериодам.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
	        |	ТаблицаРаспределениеДоходовПоПериодам.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеДоходовПоПериодам.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоМесяцам
	        |ИЗ
	        |	&ТаблицаРаспределениеДоходовПоПериодам КАК ТаблицаРаспределениеДоходовПоПериодам
	        |ГДЕ
	        |	ТаблицаРаспределениеДоходовПоПериодам.ИндексСтрокиРаспределениеПоРолям = &Неопределено
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаПланДоходов.Контрагент КАК Контрагент,
	        |	ТаблицаПланДоходов.Договор КАК Договор,
	        |	ТаблицаПланДоходов.Валюта КАК Валюта,
	        |	ТаблицаПланДоходов.Сумма КАК Сумма,
	        |	ТаблицаПланДоходов.Статья КАК Статья,
	        |	ТаблицаПланДоходов.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаПланДоходов.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаПланДоходов.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаПланДоходов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	        |	ТаблицаПланДоходов.ИсточникПлана КАК ИсточникПлана
	        |ПОМЕСТИТЬ ВТ_ПланДоходов
	        |ИЗ
	        |	&ТаблицаПланДоходов КАК ТаблицаПланДоходов
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаРаспределениеДоходов.Подразделение КАК Подразделение,
	        |	ТаблицаРаспределениеДоходов.Роль КАК Роль,
	        |	ТаблицаРаспределениеДоходов.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеДоходов.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаРаспределениеДоходов.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаРаспределениеДоходов.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаРаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ТаблицаРаспределениеДоходов.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	        |	ТаблицаРаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ТаблицаРаспределениеДоходов.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	        |	ТаблицаРаспределениеДоходов.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам
	        |ПОМЕСТИТЬ ВТ_РаспределениеДоходов
	        |ИЗ
	        |	&ТаблицаРаспределениеДоходов КАК ТаблицаРаспределениеДоходов
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	&Ссылка КАК ПроектнаяЗадача,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
	        |	ВТ_ПланДоходов.Контрагент КАК Контрагент,
	        |	ВТ_ПланДоходов.Договор КАК Договор,
	        |	ВТ_ПланДоходов.Валюта КАК Валюта,
	        |	ВТ_РаспределениеДоходов.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеДоходов.Роль КАК Роль,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеДоходов.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланДоходов.Сумма
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТ_ПланДоходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |					ТОГДА 0
	        |				ИНАЧЕ ВТ_РаспределениеДоходов.Сумма
	        |			КОНЕЦ
	        |	КОНЕЦ КАК Сумма,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеДоходов.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланДоходов.Сумма
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТ_РаспределениеДоходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |					ТОГДА 0
	        |				ИНАЧЕ ВТ_РаспределениеДоходов.Сумма
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаВалютная,
	        |	0 КАК Количество,
	        |	ВТ_ПланДоходов.Статья КАК Статья,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеДоходов.ПрофильРаспределения ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланДоходов.ПрофильРаспределения
	        |		ИНАЧЕ ВТ_РаспределениеДоходов.ПрофильРаспределения
	        |	КОНЕЦ КАК ПрофильРаспределения,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеДоходов.ДатаПривязки ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланДоходов.ДатаПривязки
	        |		ИНАЧЕ ВТ_РаспределениеДоходов.ДатаПривязки
	        |	КОНЕЦ КАК ДатаНачисления,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеДоходов.СпособПривязки ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланДоходов.СпособПривязки
	        |		ИНАЧЕ ВТ_РаспределениеДоходов.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_РаспределениеДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_РаспределениеДоходов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеДоходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВыводитьВРезультат,
	        |	ВТ_ПланДоходов.ИсточникПлана КАК ИсточникПлана
	        |ПОМЕСТИТЬ ВТ_СводнаяТаблица
	        |ИЗ
	        |	ВТ_ПланДоходов КАК ВТ_ПланДоходов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеДоходов КАК ВТ_РаспределениеДоходов
	        |		ПО ВТ_ПланДоходов.ИндексСтрокРаспределения = ВТ_РаспределениеДоходов.ИндексСтрокиВладельца
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия,
	        |	&Ссылка,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход),
	        |	ВТ_ПланДоходов.Контрагент,
	        |	ВТ_ПланДоходов.Договор,
	        |	ВТ_ПланДоходов.Валюта,
	        |	ВТ_РаспределениеДоходов.Подразделение,
	        |	ВТ_РаспределениеДоходов.Роль,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Количество,
	        |	ВТ_ПланДоходов.Статья,
	        |	ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка),
	        |	ВТ_РаспределениеПоМесяцам.Период,
	        |	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату),
	        |	ВТ_РаспределениеДоходов.СобствСилы_Субподряд,
	        |	ВТ_РаспределениеДоходов.ЗаказДоговорПодрядчика,
	        |	ВТ_РаспределениеДоходов.КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеДоходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ,
	        |	ВТ_ПланДоходов.ИсточникПлана
	        |ИЗ
	        |	ВТ_ПланДоходов КАК ВТ_ПланДоходов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеДоходов КАК ВТ_РаспределениеДоходов
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоМесяцам КАК ВТ_РаспределениеПоМесяцам
	        |			ПО (ВТ_РаспределениеДоходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
	        |				И ВТ_РаспределениеДоходов.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоМесяцам.ИндексСтрокиРаспределенияДоходов
	        |		ПО ВТ_ПланДоходов.ИндексСтрокРаспределения = ВТ_РаспределениеДоходов.ИндексСтрокиВладельца
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СводнаяТаблица.Версия КАК Версия,
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_СводнаяТаблица.ВидОбъема КАК ВидОбъема,
	        |	ВТ_СводнаяТаблица.Контрагент КАК Контрагент,
	        |	ВТ_СводнаяТаблица.Договор КАК Договор,
	        |	ВТ_СводнаяТаблица.Валюта КАК Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	        |	ВТ_СводнаяТаблица.Роль КАК Роль,
	        |	СУММА(ВТ_СводнаяТаблица.Сумма) КАК Сумма,
	        |	СУММА(ВТ_СводнаяТаблица.СуммаВалютная) КАК СуммаВалютная,
	        |	СУММА(ВТ_СводнаяТаблица.Количество) КАК Количество,
	        |	ВТ_СводнаяТаблица.Статья КАК Статья,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления КАК ДатаНачисления,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_СводнаяТаблица.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_СводнаяТаблица.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	        |		ИНАЧЕ ВТ_СводнаяТаблица.ИсточникПлана
	        |	КОНЕЦ КАК ИсточникПлана
	        |ИЗ
	        |	ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица
	        |ГДЕ
	        |	ВТ_СводнаяТаблица.ВыводитьВРезультат
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_СводнаяТаблица.Версия,
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача,
	        |	ВТ_СводнаяТаблица.ВидОбъема,
	        |	ВТ_СводнаяТаблица.Контрагент,
	        |	ВТ_СводнаяТаблица.Договор,
	        |	ВТ_СводнаяТаблица.Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение,
	        |	ВТ_СводнаяТаблица.Роль,
	        |	ВТ_СводнаяТаблица.Статья,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_СводнаяТаблица.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ВТ_СводнаяТаблица.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	        |		ИНАЧЕ ВТ_СводнаяТаблица.ИсточникПлана
	        |	КОНЕЦ";

КонецФункции	

Функция ТекстДоходыПоОбъемам_ДанныеРегистров()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоМесяцам
	        |ИЗ
	        |	РегистрСведений.упоДанныеРаспределенияДоходовПоПериодам.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеРаспределенияДоходовПоПериодамСрезПоследних
	        |ГДЕ
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям = &Неопределено
	        |	И (упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Количество <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество КАК Количество,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
	        |	ВЫБОР
	        |		КОГДА упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВыводитьВРезультат,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	        |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПодразделениям
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	        |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
	        |ГДЕ
	        |	(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0
	        |			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.Статья КАК Статья,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки КАК СпособПривязки,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.Контрагент КАК Контрагент,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.Договор КАК Договор,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная КАК СуммаВалютная,
	        |	упоДанныеПлановДоходовИРасходовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
	        |ПОМЕСТИТЬ ВТ_ПланДоходов
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	        |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДоходовИРасходовСрезПоследних
	        |ГДЕ
	        |	(упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПланДоходов.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_ПланДоходов.Статья КАК Статья,
	        |	ВТ_ПланДоходов.Контрагент КАК Контрагент,
	        |	ВТ_ПланДоходов.Договор КАК Договор,
	        |	ВТ_ПланДоходов.Валюта КАК Валюта,
	        |	ВТ_РаспределениеПоПодразделениям.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеПоПодразделениям.Роль КАК Роль,
	        |	ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланДоходов.Сумма
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |					ТОГДА 0
	        |				ИНАЧЕ ВТ_РаспределениеПоПодразделениям.Сумма
	        |			КОНЕЦ
	        |	КОНЕЦ КАК Сумма,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.СуммаВалютная ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланДоходов.СуммаВалютная
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |					ТОГДА 0
	        |				ИНАЧЕ ВТ_РаспределениеПоПодразделениям.СуммаВалютная
	        |			КОНЕЦ
	        |	КОНЕЦ КАК СуммаВалютная,
	        |	0 КАК Количество,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.СпособПривязки, ВТ_ПланДоходов.СпособПривязки) КАК СпособПривязки,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ПрофильРаспределения, ВТ_ПланДоходов.ПрофильРаспределения) КАК ПрофильРаспределения,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ДатаНачисления, ВТ_ПланДоходов.ДатаПривязки) КАК ДатаНачисления,
	        |	ВТ_РаспределениеПоПодразделениям.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВыводитьВРезультат
	        |ПОМЕСТИТЬ ВТ_СводнаяТаблица
	        |ИЗ
	        |	ВТ_ПланДоходов КАК ВТ_ПланДоходов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	        |		ПО ВТ_ПланДоходов.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	        |			И ВТ_ПланДоходов.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ПланДоходов.ПроектнаяЗадача,
	        |	ВТ_ПланДоходов.Статья,
	        |	ВТ_ПланДоходов.Контрагент,
	        |	ВТ_ПланДоходов.Договор,
	        |	ВТ_ПланДоходов.Валюта,
	        |	ВТ_РаспределениеПоПодразделениям.Подразделение,
	        |	ВТ_РаспределениеПоПодразделениям.Роль,
	        |	ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Количество,
	        |	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату),
	        |	ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка),
	        |	ВТ_РаспределениеПоМесяцам.Период,
	        |	ВТ_РаспределениеПоПодразделениям.Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеПоПодразделениям.КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ
	        |ИЗ
	        |	ВТ_ПланДоходов КАК ВТ_ПланДоходов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоМесяцам КАК ВТ_РаспределениеПоМесяцам
	        |			ПО (ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
	        |				И ВТ_РаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоМесяцам.ИндексСтрокиРаспределенияДоходов
	        |				И ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача = ВТ_РаспределениеПоМесяцам.ПроектнаяЗадача
	        |		ПО ВТ_ПланДоходов.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	        |			И ВТ_ПланДоходов.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
	        |	ВТ_СводнаяТаблица.Статья КАК Статья,
	        |	ВТ_СводнаяТаблица.Контрагент КАК Контрагент,
	        |	ВТ_СводнаяТаблица.Договор КАК Договор,
	        |	ВТ_СводнаяТаблица.Валюта КАК Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	        |	ВТ_СводнаяТаблица.Роль КАК Роль,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	СУММА(ВТ_СводнаяТаблица.Сумма) КАК Сумма,
	        |	СУММА(ВТ_СводнаяТаблица.СуммаВалютная) КАК СуммаВалютная,
	        |	СУММА(ВТ_СводнаяТаблица.Количество) КАК Количество,
	        |	ВЫБОР
	        |		КОГДА ВТ_СводнаяТаблица.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик КАК КонтрагентПодрядчик
	        |ИЗ
	        |	ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица
	        |ГДЕ
	        |	ВТ_СводнаяТаблица.ВыводитьВРезультат
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача,
	        |	ВТ_СводнаяТаблица.Статья,
	        |	ВТ_СводнаяТаблица.Контрагент,
	        |	ВТ_СводнаяТаблица.Договор,
	        |	ВТ_СводнаяТаблица.Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение,
	        |	ВТ_СводнаяТаблица.Роль,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд,
	        |	ВЫБОР
	        |		КОГДА ВТ_СводнаяТаблица.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	        |	КОНЕЦ,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик,
	        |	ВТ_СводнаяТаблица.ВыводитьВРезультат";
	
КонецФункции	

Функция ТекстДоходыПоНатуральнымПоказателям_ДанныеДокумента()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаРаспределениеДоходовПоПериодам.НомерСтроки КАК НомерСтроки,
	        |	ТаблицаРаспределениеДоходовПоПериодам.Период КАК Период,
	        |	ТаблицаРаспределениеДоходовПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	ТаблицаРаспределениеДоходовПоПериодам.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
	        |	ТаблицаРаспределениеДоходовПоПериодам.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеДоходовПоПериодам.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоМесяцам
	        |ИЗ
	        |	&ТаблицаРаспределениеДоходовПоПериодам КАК ТаблицаРаспределениеДоходовПоПериодам
	        |ГДЕ
	        |	ТаблицаРаспределениеДоходовПоПериодам.ИндексСтрокиРаспределенияДоходов = &Неопределено
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаСубпродукты.Контрагент КАК Контрагент,
	        |	ТаблицаСубпродукты.Договор КАК Договор,
	        |	ТаблицаСубпродукты.Валюта КАК Валюта,
	        |	ТаблицаСубпродукты.Ресурс КАК Ресурс,
	        |	ТаблицаСубпродукты.ЕдиницаНормирования КАК ЕдиницаНормирования,
	        |	ТаблицаСубпродукты.СтатьяДоходов КАК СтатьяДоходов,
	        |	ТаблицаСубпродукты.ОбщСтоимость КАК ОбщСтоимость,
	        |	ТаблицаСубпродукты.Количество КАК Количество,
	        |	ТаблицаСубпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаСубпродукты.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаСубпродукты.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаСубпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
	        |ПОМЕСТИТЬ ВТ_Субпродукты
	        |ИЗ
	        |	&ТаблицаСубпродукты КАК ТаблицаСубпродукты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаРаспределениеОбъемов.Подразделение КАК Подразделение,
	        |	ТаблицаРаспределениеОбъемов.Роль КАК Роль,
	        |	ТаблицаРаспределениеОбъемов.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	        |	ТаблицаРаспределениеОбъемов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ТаблицаРаспределениеОбъемов.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеОбъемов.Количество КАК Количество,
	        |	ТаблицаРаспределениеОбъемов.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаРаспределениеОбъемов.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаРаспределениеОбъемов.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаРаспределениеОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ТаблицаРаспределениеОбъемов.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	        |	ТаблицаРаспределениеОбъемов.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам
	        |ПОМЕСТИТЬ ВТ_РаспределениеОбъемов
	        |ИЗ
	        |	&ТаблицаРаспределениеОбъемов КАК ТаблицаРаспределениеОбъемов
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	&Ссылка КАК ПроектнаяЗадача,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
	        |	ВТ_Субпродукты.Контрагент КАК Контрагент,
	        |	ВТ_Субпродукты.Договор КАК Договор,
	        |	ВТ_Субпродукты.Валюта КАК Валюта,
	        |	ВТ_РаспределениеОбъемов.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеОбъемов.Роль КАК Роль,
	        |	ВТ_Субпродукты.Ресурс КАК Номенклатура,
	        |	ВТ_Субпродукты.ЕдиницаНормирования КАК ЕдиницаИзмерения,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеОбъемов.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_Субпродукты.ОбщСтоимость
	        |		ИНАЧЕ ВТ_РаспределениеОбъемов.Сумма
	        |	КОНЕЦ КАК Сумма,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеОбъемов.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_Субпродукты.ОбщСтоимость
	        |		ИНАЧЕ ВТ_РаспределениеОбъемов.Сумма
	        |	КОНЕЦ КАК СуммаВалютная,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеОбъемов.Количество ЕСТЬ NULL
	        |			ТОГДА ВТ_Субпродукты.Количество
	        |		ИНАЧЕ ВТ_РаспределениеОбъемов.Количество
	        |	КОНЕЦ КАК Количество,
	        |	ВТ_Субпродукты.СтатьяДоходов КАК Статья,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеОбъемов.ПрофильРаспределения ЕСТЬ NULL
	        |			ТОГДА ВТ_Субпродукты.ПрофильРаспределения
	        |		ИНАЧЕ ВТ_РаспределениеОбъемов.ПрофильРаспределения
	        |	КОНЕЦ КАК ПрофильРаспределения,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеОбъемов.ДатаПривязки ЕСТЬ NULL
	        |			ТОГДА ВТ_Субпродукты.ДатаПривязки
	        |		ИНАЧЕ ВТ_РаспределениеОбъемов.ДатаПривязки
	        |	КОНЕЦ КАК ДатаНачисления,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеОбъемов.СпособПривязки ЕСТЬ NULL
	        |			ТОГДА ВТ_Субпродукты.СпособПривязки
	        |		ИНАЧЕ ВТ_РаспределениеОбъемов.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_РаспределениеОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_РаспределениеОбъемов.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеОбъемов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеОбъемов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВыводитьВРезультат
	        |ПОМЕСТИТЬ ВТ_СводнаяТаблица
	        |ИЗ
	        |	ВТ_Субпродукты КАК ВТ_Субпродукты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеОбъемов КАК ВТ_РаспределениеОбъемов
	        |		ПО ВТ_Субпродукты.ИндексСтрокРаспределения = ВТ_РаспределениеОбъемов.ИндексСтрокиВладельца
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия,
	        |	&Ссылка,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход),
	        |	ВТ_Субпродукты.Контрагент,
	        |	ВТ_Субпродукты.Договор,
	        |	ВТ_Субпродукты.Валюта,
	        |	ВТ_РаспределениеОбъемов.Подразделение,
	        |	ВТ_РаспределениеОбъемов.Роль,
	        |	ВТ_Субпродукты.Ресурс,
	        |	ВТ_Субпродукты.ЕдиницаНормирования,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Количество,
	        |	ВТ_Субпродукты.СтатьяДоходов,
	        |	ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка),
	        |	ВТ_РаспределениеПоМесяцам.Период,
	        |	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату),
	        |	ВТ_РаспределениеОбъемов.СобствСилы_Субподряд,
	        |	ВТ_РаспределениеОбъемов.ЗаказДоговорПодрядчика,
	        |	ВТ_РаспределениеОбъемов.КонтрагентПодрядчик,
	        |	ИСТИНА
	        |ИЗ
	        |	ВТ_Субпродукты КАК ВТ_Субпродукты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеОбъемов КАК ВТ_РаспределениеОбъемов
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоМесяцам КАК ВТ_РаспределениеПоМесяцам
	        |			ПО ВТ_РаспределениеОбъемов.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоМесяцам.ИндексСтрокиРаспределениеПоРолям
	        |		ПО ВТ_Субпродукты.ИндексСтрокРаспределения = ВТ_РаспределениеОбъемов.ИндексСтрокиВладельца
	        |ГДЕ
	        |	ВТ_РаспределениеОбъемов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СводнаяТаблица.Версия КАК Версия,
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_СводнаяТаблица.ВидОбъема КАК ВидОбъема,
	        |	ВТ_СводнаяТаблица.Контрагент КАК Контрагент,
	        |	ВТ_СводнаяТаблица.Договор КАК Договор,
	        |	ВТ_СводнаяТаблица.Валюта КАК Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	        |	ВТ_СводнаяТаблица.Роль КАК Роль,
	        |	ВТ_СводнаяТаблица.Номенклатура КАК Номенклатура,
	        |	ВТ_СводнаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	СУММА(ВТ_СводнаяТаблица.Сумма) КАК Сумма,
	        |	СУММА(ВТ_СводнаяТаблица.СуммаВалютная) КАК СуммаВалютная,
	        |	СУММА(ВТ_СводнаяТаблица.Количество) КАК Количество,
	        |	ВТ_СводнаяТаблица.Статья КАК Статья,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
			|	&ИсточникПлана КАК ИсточникПлана,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_СводнаяТаблица.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки
	        |ИЗ
	        |	ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица
	        |ГДЕ
	        |	ВТ_СводнаяТаблица.ВыводитьВРезультат
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_СводнаяТаблица.Версия,
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача,
	        |	ВТ_СводнаяТаблица.ВидОбъема,
	        |	ВТ_СводнаяТаблица.Контрагент,
	        |	ВТ_СводнаяТаблица.Договор,
	        |	ВТ_СводнаяТаблица.Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение,
	        |	ВТ_СводнаяТаблица.Роль,
	        |	ВТ_СводнаяТаблица.Номенклатура,
	        |	ВТ_СводнаяТаблица.ЕдиницаИзмерения,
	        |	ВТ_СводнаяТаблица.Статья,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_СводнаяТаблица.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	        |	КОНЕЦ";
	
КонецФункции

Функция ТекстДоходыПоНатуральнымПоказателям_ДанныеРегистров()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоМесяцам
	        |ИЗ
	        |	РегистрСведений.упоДанныеРаспределенияДоходовПоПериодам.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В (&СписокЗадач)
	        |				И ИндексСтрокиРаспределенияДоходов = &Неопределено) КАК упоДанныеРаспределенияДоходовПоПериодамСрезПоследних
	        |ГДЕ
	        |	(упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Количество <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПодразделениям
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)
	        |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
	        |ГДЕ
	        |	(упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0
	        |			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент КАК Контрагент,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор КАК Договор,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта КАК Валюта,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов КАК СтатьяДоходов,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов КАК СпособПривязки,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество КАК Количество,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Коэффициент КАК Коэффициент,
	        |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная КАК СуммаВалютная
	        |ПОМЕСТИТЬ ВТ_Субпродукты
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
	        |ГДЕ
	        |	(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество <> 0
	        |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Субпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_Субпродукты.Контрагент КАК Контрагент,
	        |	ВТ_Субпродукты.Договор КАК Договор,
	        |	ВТ_Субпродукты.Валюта КАК Валюта,
	        |	ВТ_РаспределениеПоПодразделениям.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеПоПодразделениям.Роль КАК Роль,
	        |	ВТ_Субпродукты.Номенклатура КАК Номенклатура,
	        |	ВТ_Субпродукты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.Сумма, ВТ_Субпродукты.Сумма) КАК Сумма,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.СуммаВалютная, ВТ_Субпродукты.СуммаВалютная) КАК СуммаВалютная,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.Количество ЕСТЬ NULL
	        |			ТОГДА ВТ_Субпродукты.Количество
	        |		ИНАЧЕ ВТ_РаспределениеПоПодразделениям.Количество
	        |	КОНЕЦ КАК Количество,
	        |	ВТ_Субпродукты.СтатьяДоходов КАК Статья,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ПрофильРаспределения, ВТ_Субпродукты.ПрофильРаспределения) КАК ПрофильРаспределения,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ДатаНачисления, ВТ_Субпродукты.ДатаПривязки) КАК ДатаНачисления,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.СпособПривязки, ВТ_Субпродукты.СпособПривязки) КАК СпособПривязки,
	        |	ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_РаспределениеПоПодразделениям.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВыводитьВРезультат
	        |ПОМЕСТИТЬ ВТ_СводнаяТаблица
	        |ИЗ
	        |	ВТ_Субпродукты КАК ВТ_Субпродукты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	        |		ПО ВТ_Субпродукты.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	        |			И ВТ_Субпродукты.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_Субпродукты.ПроектнаяЗадача,
	        |	ВТ_Субпродукты.Контрагент,
	        |	ВТ_Субпродукты.Договор,
	        |	ВТ_Субпродукты.Валюта,
	        |	ВТ_РаспределениеПоПодразделениям.Подразделение,
	        |	ВТ_РаспределениеПоПодразделениям.Роль,
	        |	ВТ_Субпродукты.Номенклатура,
	        |	ВТ_Субпродукты.ЕдиницаИзмерения,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Сумма,
	        |	ВТ_РаспределениеПоМесяцам.Количество,
	        |	ВТ_Субпродукты.СтатьяДоходов,
	        |	ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка),
	        |	ВТ_РаспределениеПоМесяцам.Период,
	        |	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату),
	        |	ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд,
	        |	ВТ_РаспределениеПоПодразделениям.Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеПоПодразделениям.КонтрагентПодрядчик,
	        |	ИСТИНА
	        |ИЗ
	        |	ВТ_Субпродукты КАК ВТ_Субпродукты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоМесяцам КАК ВТ_РаспределениеПоМесяцам
	        |			ПО ВТ_РаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоМесяцам.ИндексСтрокиРаспределениеПоРолям
	        |				И ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача = ВТ_РаспределениеПоМесяцам.ПроектнаяЗадача
	        |		ПО ВТ_Субпродукты.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	        |			И ВТ_Субпродукты.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	        |ГДЕ
	        |	ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
	        |	ВТ_СводнаяТаблица.Контрагент КАК Контрагент,
	        |	ВТ_СводнаяТаблица.Договор КАК Договор,
	        |	ВТ_СводнаяТаблица.Валюта КАК Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	        |	ВТ_СводнаяТаблица.Роль КАК Роль,
	        |	ВТ_СводнаяТаблица.Номенклатура КАК Номенклатура,
	        |	ВТ_СводнаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	СУММА(ВТ_СводнаяТаблица.Сумма) КАК Сумма,
	        |	СУММА(ВТ_СводнаяТаблица.СуммаВалютная) КАК СуммаВалютная,
	        |	СУММА(ВТ_СводнаяТаблица.Количество) КАК Количество,
	        |	ВТ_СводнаяТаблица.Статья КАК Статья,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВЫБОР
	        |		КОГДА ВТ_СводнаяТаблица.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки
	        |ИЗ
	        |	ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица
	        |ГДЕ
	        |	ВТ_СводнаяТаблица.ВыводитьВРезультат
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_СводнаяТаблица.ПроектнаяЗадача,
	        |	ВТ_СводнаяТаблица.Контрагент,
	        |	ВТ_СводнаяТаблица.Договор,
	        |	ВТ_СводнаяТаблица.Валюта,
	        |	ВТ_СводнаяТаблица.Подразделение,
	        |	ВТ_СводнаяТаблица.Роль,
	        |	ВТ_СводнаяТаблица.Номенклатура,
	        |	ВТ_СводнаяТаблица.ЕдиницаИзмерения,
	        |	ВТ_СводнаяТаблица.Статья,
	        |	ВТ_СводнаяТаблица.ПрофильРаспределения,
	        |	ВТ_СводнаяТаблица.ДатаНачисления,
	        |	ВТ_СводнаяТаблица.СобствСилы_Субподряд,
	        |	ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика,
	        |	ВТ_СводнаяТаблица.КонтрагентПодрядчик,
	        |	ВТ_СводнаяТаблица.СпособПривязки";
КонецФункции	

Функция ТекстРасходыПоОбъемам_ДанныеДокумента()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаРаспределениеРасходовПоПериодам.НомерСтроки КАК НомерСтроки,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Период КАК Период,
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_ТаблицаРаспределенияПоПериодам
	        |ИЗ
	        |	&ТаблицаРаспределениеРасходовПоПериодам КАК ТаблицаРаспределениеРасходовПоПериодам
	        |ГДЕ
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределениеПоРолям = &Неопределено
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаПланРасходов.Статья КАК Статья,
	        |	ТаблицаПланРасходов.Валюта КАК Валюта,
	        |	ТаблицаПланРасходов.Сумма КАК Сумма,
	        |	ТаблицаПланРасходов.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаПланРасходов.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаПланРасходов.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаПланРасходов.Контрагент КАК Контрагент,
	        |	ТаблицаПланРасходов.Договор КАК Договор,
	        |	ТаблицаПланРасходов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	        |	ТаблицаПланРасходов.ИсточникПлана КАК ИсточникПлана
	        |ПОМЕСТИТЬ ВТ_ПланРасходов
	        |ИЗ
	        |	&ТаблицаПланРасходов КАК ТаблицаПланРасходов
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаРаспределениеРасходов.Подразделение КАК Подразделение,
	        |	ТаблицаРаспределениеРасходов.Роль КАК Роль,
	        |	ТаблицаРаспределениеРасходов.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеРасходов.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаРаспределениеРасходов.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаРаспределениеРасходов.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаРаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ТаблицаРаспределениеРасходов.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	        |	ТаблицаРаспределениеРасходов.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
	        |ПОМЕСТИТЬ ВТ_РаспределениеРасходов
	        |ИЗ
	        |	&ТаблицаРаспределениеРасходов КАК ТаблицаРаспределениеРасходов
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	&Ссылка КАК ПроектнаяЗадача,
	        |	ВТ_ПланРасходов.Статья КАК Статья,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
	        |	ВТ_ПланРасходов.Валюта КАК Валюта,
	        |	ВТ_РаспределениеРасходов.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеРасходов.Роль КАК Роль,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеРасходов.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланРасходов.Сумма
	        |		ИНАЧЕ ВТ_РаспределениеРасходов.Сумма
	        |	КОНЕЦ КАК Сумма,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеРасходов.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_ПланРасходов.Сумма
	        |		ИНАЧЕ ВТ_РаспределениеРасходов.Сумма
	        |	КОНЕЦ КАК СуммаВалютная,
	        |	0 КАК Количество,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеРасходов.СпособПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_ПланРасходов.СпособПривязки
	        |					ИНАЧЕ ВТ_РаспределениеРасходов.СпособПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ПланРасходов.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеРасходов.ПрофильРаспределения ЕСТЬ NULL
	        |						ТОГДА ВТ_ПланРасходов.ПрофильРаспределения
	        |					ИНАЧЕ ВТ_РаспределениеРасходов.ПрофильРаспределения
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ПланРасходов.ПрофильРаспределения
	        |	КОНЕЦ КАК ПрофильРаспределения,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеРасходов.ДатаПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_ПланРасходов.ДатаПривязки
	        |					ИНАЧЕ ВТ_РаспределениеРасходов.ДатаПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ПланРасходов.ДатаПривязки
	        |	КОНЕЦ КАК ДатаНачисления,
	        |	ВТ_ПланРасходов.Контрагент КАК КонтрагентПодрядчик,
	        |	ВТ_РаспределениеРасходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_ПланРасходов.Договор КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_ПланРасходов.Контрагент КАК Контрагент,
	        |	ВТ_ПланРасходов.Договор КАК Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеРасходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК Выводить,
	        |	ВТ_ПланРасходов.ИсточникПлана КАК ИсточникПлана
	        |ПОМЕСТИТЬ ВТ_Сводно
	        |ИЗ
	        |	ВТ_ПланРасходов КАК ВТ_ПланРасходов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеРасходов КАК ВТ_РаспределениеРасходов
	        |		ПО ВТ_ПланРасходов.ИндексСтрокРаспределения = ВТ_РаспределениеРасходов.ИндексСтрокиВладельца
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия,
	        |	&Ссылка,
	        |	ВТ_ПланРасходов.Статья,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход),
	        |	ВТ_ПланРасходов.Валюта,
	        |	ВТ_РаспределениеРасходов.Подразделение,
	        |	ВТ_РаспределениеРасходов.Роль,
	        |	ВТ_ТаблицаРаспределенияПоПериодам.Сумма,
	        |	ВТ_ТаблицаРаспределенияПоПериодам.Сумма,
	        |	0,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеРасходов.СпособПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_ПланРасходов.СпособПривязки
	        |					ИНАЧЕ ВТ_РаспределениеРасходов.СпособПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ПланРасходов.СпособПривязки
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеРасходов.ПрофильРаспределения ЕСТЬ NULL
	        |						ТОГДА ВТ_ПланРасходов.ПрофильРаспределения
	        |					ИНАЧЕ ВТ_РаспределениеРасходов.ПрофильРаспределения
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ПланРасходов.ПрофильРаспределения
	        |	КОНЕЦ,
	        |	ВТ_ТаблицаРаспределенияПоПериодам.Период,
	        |	ВТ_ПланРасходов.Контрагент,
	        |	ВТ_РаспределениеРасходов.СобствСилы_Субподряд,
	        |	ВТ_ПланРасходов.Договор,
	        |	ВТ_ПланРасходов.Контрагент,
	        |	ВТ_ПланРасходов.Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеРасходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ,
	        |	ВТ_ПланРасходов.ИсточникПлана
	        |ИЗ
	        |	ВТ_ПланРасходов КАК ВТ_ПланРасходов
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеРасходов КАК ВТ_РаспределениеРасходов
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРаспределенияПоПериодам КАК ВТ_ТаблицаРаспределенияПоПериодам
	        |			ПО (ВТ_РаспределениеРасходов.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
	        |				И ВТ_РаспределениеРасходов.ИндексСтрокРаспределенияПоПериодам = ВТ_ТаблицаРаспределенияПоПериодам.ИндексСтрокиРаспределенияРасходов
	        |		ПО ВТ_ПланРасходов.ИндексСтрокРаспределения = ВТ_РаспределениеРасходов.ИндексСтрокиВладельца
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Сводно.Версия КАК Версия,
	        |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_Сводно.Статья КАК Статья,
	        |	ВТ_Сводно.ВидОбъема КАК ВидОбъема,
	        |	ВТ_Сводно.Валюта КАК Валюта,
	        |	ВТ_Сводно.Подразделение КАК Подразделение,
	        |	ВТ_Сводно.Роль КАК Роль,
	        |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	        |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	        |	СУММА(ВТ_Сводно.Количество) КАК Количество,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Сводно.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.Контрагент КАК Контрагент,
	        |	ВТ_Сводно.Договор КАК Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_Сводно.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	        |		ИНАЧЕ ВТ_Сводно.ИсточникПлана
	        |	КОНЕЦ КАК ИсточникПлана
	        |ИЗ
	        |	ВТ_Сводно КАК ВТ_Сводно
	        |ГДЕ
	        |	ВТ_Сводно.Выводить
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Сводно.Версия,
	        |	ВТ_Сводно.ПроектнаяЗадача,
	        |	ВТ_Сводно.Статья,
	        |	ВТ_Сводно.ВидОбъема,
	        |	ВТ_Сводно.Валюта,
	        |	ВТ_Сводно.Подразделение,
	        |	ВТ_Сводно.Роль,
	        |	ВТ_Сводно.ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления,
	        |	ВТ_Сводно.КонтрагентПодрядчик,
	        |	ВТ_Сводно.СобствСилы_Субподряд,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.Контрагент,
	        |	ВТ_Сводно.Договор,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Сводно.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ВТ_Сводно.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы)
	        |		ИНАЧЕ ВТ_Сводно.ИсточникПлана
	        |	КОНЕЦ";
	
КонецФункции	

Функция ТекстРасходыПоОбъемам_ДанныеРегистров()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|   упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
	|   упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	|   упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	|   упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма КАК Сумма,
	|   упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_РаспределениеПоМесяцам
	|ИЗ
	|   РегистрСведений.упоДанныеРаспределенияРасходовПоПериодам.СрезПоследних(
	|           ,
	|           Версия = &ТекущаяВерсия
	|               И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеРаспределенияРасходовПоПериодамСрезПоследних
	|ГДЕ
	|   упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям = &Неопределено
	|   И (упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма <> 0
	|           ИЛИ упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество КАК Количество,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма КАК Сумма,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
	|   ВЫБОР
	|       КОГДА упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ КАК ВыводитьВРезультат,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	|   упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам
	|ПОМЕСТИТЬ ВТ_РаспределениеПоПодразделениям
	|ИЗ
	|   РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
	|           ,
	|           Версия = &ТекущаяВерсия
	|               И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	|               И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
	|ГДЕ
	|   (упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
	|           ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0
	|           ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.Статья КАК Статья,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки КАК СпособПривязки,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.Контрагент КАК Контрагент,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.Договор КАК Договор,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма КАК Сумма,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная КАК СуммаВалютная,
	|   упоДанныеПлановДоходовИРасходовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
	|ПОМЕСТИТЬ ВТ_ПланРасходов
	|ИЗ
	|   РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
	|           ,
	|           Версия = &ТекущаяВерсия
	|               И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	|               И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДоходовИРасходовСрезПоследних
	|ГДЕ
	|   (упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма <> 0
	|           ИЛИ упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   ВТ_ПланРасходов.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|   ВТ_ПланРасходов.Статья КАК Статья,
	|   ВТ_ПланРасходов.Контрагент КАК Контрагент,
	|   ВТ_ПланРасходов.Договор КАК Договор,
	|   ВТ_ПланРасходов.Валюта КАК Валюта,
	|   ВТ_РаспределениеПоПодразделениям.Подразделение КАК Подразделение,
	|   ВТ_РаспределениеПоПодразделениям.Роль КАК Роль,
	|   ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|   ВЫБОР
	|       КОГДА ВТ_РаспределениеПоПодразделениям.Сумма ЕСТЬ NULL
	|           ТОГДА ВТ_ПланРасходов.Сумма
	|       ИНАЧЕ ВЫБОР
	|               КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	|                   ТОГДА 0
	|               ИНАЧЕ ВТ_РаспределениеПоПодразделениям.Сумма
	|           КОНЕЦ
	|   КОНЕЦ КАК Сумма,
	|   ВЫБОР
	|       КОГДА ВТ_РаспределениеПоПодразделениям.СуммаВалютная ЕСТЬ NULL
	|           ТОГДА ВТ_ПланРасходов.СуммаВалютная
	|       ИНАЧЕ ВЫБОР
	|               КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	|                   ТОГДА 0
	|               ИНАЧЕ ВТ_РаспределениеПоПодразделениям.СуммаВалютная
	|           КОНЕЦ
	|   КОНЕЦ КАК СуммаВалютная,
	|   0 КАК Количество,
	|   ВЫБОР
	|       КОГДА &РасходыПоОбъемам
	|           ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.СпособПривязки, ВТ_ПланРасходов.СпособПривязки)
	|       ИНАЧЕ ВТ_ПланРасходов.СпособПривязки
	|   КОНЕЦ КАК СпособПривязки,
	|   ВЫБОР
	|       КОГДА &РасходыПоОбъемам
	|           ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ПрофильРаспределения, ВТ_ПланРасходов.ПрофильРаспределения)
	|       ИНАЧЕ ВТ_ПланРасходов.ПрофильРаспределения
	|   КОНЕЦ КАК ПрофильРаспределения,
	|   ВЫБОР
	|       КОГДА &РасходыПоОбъемам
	|           ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ДатаНачисления, ВТ_ПланРасходов.ДатаПривязки)
	|       ИНАЧЕ ВТ_ПланРасходов.ДатаПривязки
	|   КОНЕЦ КАК ДатаНачисления,
	|   ВТ_ПланРасходов.Договор КАК Заказ_ДоговорПодрядчика,
	|   ВТ_ПланРасходов.Контрагент КАК КонтрагентПодрядчик,
	|   ВЫБОР
	|       КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	|           ТОГДА ЛОЖЬ
	|       ИНАЧЕ ИСТИНА
	|   КОНЕЦ КАК ВыводитьВРезультат
	|ПОМЕСТИТЬ ВТ_СводнаяТаблица
	|ИЗ
	|   ВТ_ПланРасходов КАК ВТ_ПланРасходов
	|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	|       ПО ВТ_ПланРасходов.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	|           И ВТ_ПланРасходов.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ВТ_ПланРасходов.ПроектнаяЗадача,
	|   ВТ_ПланРасходов.Статья,
	|   ВТ_ПланРасходов.Контрагент,
	|   ВТ_ПланРасходов.Договор,
	|   ВТ_ПланРасходов.Валюта,
	|   ВТ_РаспределениеПоПодразделениям.Подразделение,
	|   ВТ_РаспределениеПоПодразделениям.Роль,
	|   ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд,
	|   ВТ_РаспределениеПоМесяцам.Сумма,
	|   ВТ_РаспределениеПоМесяцам.Сумма,
	|   ВТ_РаспределениеПоМесяцам.Количество,
	|   ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату),
	|   ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка),
	|   ВТ_РаспределениеПоМесяцам.Период,
	|   ВТ_РаспределениеПоПодразделениям.Заказ_ДоговорПодрядчика,
	|   ВТ_РаспределениеПоПодразделениям.КонтрагентПодрядчик,
	|   ВЫБОР
	|       КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	|           ТОГДА ИСТИНА
	|       ИНАЧЕ ЛОЖЬ
	|   КОНЕЦ
	|ИЗ
	|   ВТ_ПланРасходов КАК ВТ_ПланРасходов
	|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	|           ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоМесяцам КАК ВТ_РаспределениеПоМесяцам
	|           ПО (ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
	|               И ВТ_РаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоМесяцам.ИндексСтрокиРаспределенияРасходов
	|               И ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача = ВТ_РаспределениеПоМесяцам.ПроектнаяЗадача
	|       ПО ВТ_ПланРасходов.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	|           И ВТ_ПланРасходов.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   &ТекущаяВерсия КАК Версия,
	|   ВТ_СводнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|   ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
	|   ВТ_СводнаяТаблица.Статья КАК Статья,
	|   ВТ_СводнаяТаблица.Контрагент КАК Контрагент,
	|   ВТ_СводнаяТаблица.Договор КАК Договор,
	|   ВТ_СводнаяТаблица.Валюта КАК Валюта,
	|   ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	|   ВТ_СводнаяТаблица.Роль КАК Роль,
	|   ВТ_СводнаяТаблица.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|   СУММА(ВТ_СводнаяТаблица.Сумма) КАК Сумма,
	|   СУММА(ВТ_СводнаяТаблица.СуммаВалютная) КАК СуммаВалютная,
	|   СУММА(ВТ_СводнаяТаблица.Количество) КАК Количество,
	|   ВЫБОР
	|       КОГДА ВТ_СводнаяТаблица.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	|           ТОГДА ВЫБОР
	|                   КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	|                           ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	|                       ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	|                   ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	|               КОНЕЦ
	|       ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	|   КОНЕЦ КАК СпособПривязки,
	|   ВТ_СводнаяТаблица.ПрофильРаспределения КАК ПрофильРаспределения,
	|   ВТ_СводнаяТаблица.ДатаНачисления КАК ДатаНачисления,
	|   ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	|   ВТ_СводнаяТаблица.КонтрагентПодрядчик КАК КонтрагентПодрядчик
	|ИЗ
	|   ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица
	|ГДЕ
	|   ВТ_СводнаяТаблица.ВыводитьВРезультат
	|
	|СГРУППИРОВАТЬ ПО
	|   ВТ_СводнаяТаблица.ПроектнаяЗадача,
	|   ВТ_СводнаяТаблица.Статья,
	|   ВТ_СводнаяТаблица.Контрагент,
	|   ВТ_СводнаяТаблица.Договор,
	|   ВТ_СводнаяТаблица.Валюта,
	|   ВТ_СводнаяТаблица.Подразделение,
	|   ВТ_СводнаяТаблица.Роль,
	|   ВТ_СводнаяТаблица.СобствСилы_Субподряд,
	|   ВТ_СводнаяТаблица.ПрофильРаспределения,
	|   ВТ_СводнаяТаблица.ДатаНачисления,
	|   ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика,
	|   ВТ_СводнаяТаблица.КонтрагентПодрядчик,
	|   ВЫБОР
	|       КОГДА ВТ_СводнаяТаблица.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	|           ТОГДА ВЫБОР
	|                   КОГДА ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	|                           ИЛИ ВТ_СводнаяТаблица.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	|                       ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	|                   ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	|               КОНЕЦ
	|       ИНАЧЕ ВТ_СводнаяТаблица.СпособПривязки
	|   КОНЕЦ";
	
КонецФункции

Функция ТекстРасходыПоНатуральнымПоказателям_ДанныеДокумента()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаРаспределениеРасходовПоПериодам.НомерСтроки КАК НомерСтроки,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Период КАК Период,
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПериодам
	        |ИЗ
	        |	&ТаблицаРаспределениеРасходовПоПериодам КАК ТаблицаРаспределениеРасходовПоПериодам
	        |ГДЕ
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределенияРасходов = &Неопределено
	        |	И ТаблицаРаспределениеРасходовПоПериодам.ИсточникПлана = &ИсточникПлана
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаМатериальныеРесурсы.Валюта КАК Валюта,
	        |	ТаблицаМатериальныеРесурсы.Ресурс КАК Ресурс,
	        |	ТаблицаМатериальныеРесурсы.ЕдиницаНормирования КАК ЕдиницаНормирования,
	        |	ТаблицаМатериальныеРесурсы.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	ТаблицаМатериальныеРесурсы.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаМатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаМатериальныеРесурсы.ОбщСтоимость КАК ОбщСтоимость,
	        |	ТаблицаМатериальныеРесурсы.Количество КАК Количество,
	        |	ТаблицаМатериальныеРесурсы.Контрагент КАК Контрагент,
	        |	ТаблицаМатериальныеРесурсы.Договор КАК Договор,
	        |	ТаблицаМатериальныеРесурсы.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаМатериальныеРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
	        |ПОМЕСТИТЬ ВТ_МатериальныеРесурсы
	        |ИЗ
	        |	&ТаблицаМатериальныеРесурсы КАК ТаблицаМатериальныеРесурсы
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаРаспределениеПотребностей.Подразделение КАК Подразделение,
	        |	ТаблицаРаспределениеПотребностей.Роль КАК Роль,
	        |	ТаблицаРаспределениеПотребностей.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаРаспределениеПотребностей.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаРаспределениеПотребностей.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеПотребностей.Количество КАК Количество,
	        |	ТаблицаРаспределениеПотребностей.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ТаблицаРаспределениеПотребностей.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаРаспределениеПотребностей.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	        |	ТаблицаРаспределениеПотребностей.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
	        |ПОМЕСТИТЬ ВТ_РаспределениеПотребностей
	        |ИЗ
	        |	&ТаблицаРаспределениеПотребностей КАК ТаблицаРаспределениеПотребностей
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	&Ссылка КАК ПроектнаяЗадача,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
	        |	ВТ_МатериальныеРесурсы.Валюта КАК Валюта,
	        |	ВТ_РаспределениеПотребностей.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеПотребностей.Роль КАК Роль,
	        |	ВТ_МатериальныеРесурсы.Ресурс КАК Номенклатура,
	        |	ВТ_МатериальныеРесурсы.ЕдиницаНормирования КАК ЕдиницаИзмерения,
	        |	ВТ_РаспределениеПоПериодам.Сумма КАК Сумма,
	        |	ВТ_РаспределениеПоПериодам.Сумма КАК СуммаВалютная,
	        |	ВТ_РаспределениеПоПериодам.Количество КАК Количество,
	        |	ВТ_МатериальныеРесурсы.СтатьяЗатрат КАК Статья,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеПотребностей.СпособПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_МатериальныеРесурсы.СпособПривязки
	        |					ИНАЧЕ ВТ_РаспределениеПотребностей.СпособПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеПотребностей.ПрофильРаспределения ЕСТЬ NULL
	        |						ТОГДА ВТ_МатериальныеРесурсы.ПрофильРаспределения
	        |					ИНАЧЕ ВТ_РаспределениеПотребностей.ПрофильРаспределения
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.ПрофильРаспределения
	        |	КОНЕЦ КАК ПрофильРаспределения,
	        |	ВТ_РаспределениеПоПериодам.Период КАК ДатаНачисления,
	        |	ВТ_МатериальныеРесурсы.Контрагент КАК КонтрагентПодрядчик,
	        |	ВТ_МатериальныеРесурсы.Договор КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеПотребностей.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_МатериальныеРесурсы.Контрагент КАК Контрагент,
	        |	ВТ_МатериальныеРесурсы.Договор КАК Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПотребностей.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК Выводить
	        |ПОМЕСТИТЬ ВТ_Сводно
	        |ИЗ
	        |	ВТ_МатериальныеРесурсы КАК ВТ_МатериальныеРесурсы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПотребностей КАК ВТ_РаспределениеПотребностей
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПериодам КАК ВТ_РаспределениеПоПериодам
	        |			ПО ВТ_РаспределениеПотребностей.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоПериодам.ИндексСтрокиРаспределениеПоРолям
	        |		ПО ВТ_МатериальныеРесурсы.ИндексСтрокРаспределения = ВТ_РаспределениеПотребностей.ИндексСтрокиВладельца
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия,
	        |	&Ссылка,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход),
	        |	ВТ_МатериальныеРесурсы.Валюта,
	        |	ВТ_РаспределениеПотребностей.Подразделение,
	        |	ВТ_РаспределениеПотребностей.Роль,
	        |	ВТ_МатериальныеРесурсы.Ресурс,
	        |	ВТ_МатериальныеРесурсы.ЕдиницаНормирования,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПотребностей.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_МатериальныеРесурсы.ОбщСтоимость
	        |		ИНАЧЕ ВТ_РаспределениеПотребностей.Сумма
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПотребностей.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_МатериальныеРесурсы.ОбщСтоимость
	        |		ИНАЧЕ ВТ_РаспределениеПотребностей.Сумма
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПотребностей.Количество ЕСТЬ NULL
	        |			ТОГДА ВТ_МатериальныеРесурсы.Количество
	        |		ИНАЧЕ ВТ_РаспределениеПотребностей.Количество
	        |	КОНЕЦ,
	        |	ВТ_МатериальныеРесурсы.СтатьяЗатрат,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеПотребностей.СпособПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_МатериальныеРесурсы.СпособПривязки
	        |					ИНАЧЕ ВТ_РаспределениеПотребностей.СпособПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.СпособПривязки
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеПотребностей.ПрофильРаспределения ЕСТЬ NULL
	        |						ТОГДА ВТ_МатериальныеРесурсы.ПрофильРаспределения
	        |					ИНАЧЕ ВТ_РаспределениеПотребностей.ПрофильРаспределения
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.ПрофильРаспределения
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеПотребностей.ДатаПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_МатериальныеРесурсы.ДатаПривязки
	        |					ИНАЧЕ ВТ_РаспределениеПотребностей.ДатаПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.ДатаПривязки
	        |	КОНЕЦ,
	        |	ВТ_МатериальныеРесурсы.Контрагент,
	        |	ВТ_МатериальныеРесурсы.Договор,
	        |	ВТ_РаспределениеПотребностей.СобствСилы_Субподряд,
	        |	ВТ_МатериальныеРесурсы.Контрагент,
	        |	ВТ_МатериальныеРесурсы.Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПотребностей.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ
	        |ИЗ
	        |	ВТ_МатериальныеРесурсы КАК ВТ_МатериальныеРесурсы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПотребностей КАК ВТ_РаспределениеПотребностей
	        |		ПО ВТ_МатериальныеРесурсы.ИндексСтрокРаспределения = ВТ_РаспределениеПотребностей.ИндексСтрокиВладельца
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Сводно.Версия КАК Версия,
	        |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_Сводно.ВидОбъема КАК ВидОбъема,
	        |	ВТ_Сводно.Валюта КАК Валюта,
	        |	ВТ_Сводно.Подразделение КАК Подразделение,
	        |	ВТ_Сводно.Роль КАК Роль,
	        |	ВТ_Сводно.Номенклатура КАК Номенклатура,
	        |	ВТ_Сводно.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	        |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	        |	СУММА(ВТ_Сводно.Количество) КАК Количество,
	        |	ВТ_Сводно.Статья КАК Статья,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Сводно.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_Сводно.Контрагент КАК Контрагент,
	        |	ВТ_Сводно.Договор КАК Договор,
	        |	&ИсточникПлана КАК ИсточникПлана
	        |ИЗ
	        |	ВТ_Сводно КАК ВТ_Сводно
	        |ГДЕ
	        |	ВТ_Сводно.Выводить
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Сводно.КонтрагентПодрядчик,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.СобствСилы_Субподряд,
	        |	ВТ_Сводно.Контрагент,
	        |	ВТ_Сводно.Договор,
	        |	ВТ_Сводно.Номенклатура,
	        |	ВТ_Сводно.ЕдиницаИзмерения,
	        |	ВТ_Сводно.Статья,
	        |	ВТ_Сводно.ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления,
	        |	ВТ_Сводно.Версия,
	        |	ВТ_Сводно.ПроектнаяЗадача,
	        |	ВТ_Сводно.ВидОбъема,
	        |	ВТ_Сводно.Валюта,
	        |	ВТ_Сводно.Подразделение,
	        |	ВТ_Сводно.Роль,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Сводно.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ";	
	
КонецФункции

Функция ТекстРасходыПоНатуральнымПоказателям_ДанныеРегистров()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПериодам
	        |ИЗ
	        |	РегистрСведений.упоДанныеРаспределенияРасходовПоПериодам.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЗадачиТрансляции.ПроектнаяЗадача КАК ПроектнаяЗадача
	        |					ИЗ
	        |						ВТ_ЗадачиТрансляции КАК ВТ_ЗадачиТрансляции
	        |					ГДЕ
	        |						(&РасходыПоНатуральнымПоказателям
	        |							ИЛИ ВТ_ЗадачиТрансляции.ВключитьМатРесурсыВПланРасходов))) КАК упоДанныеРаспределенияРасходовПоПериодамСрезПоследних
	        |ГДЕ
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияРасходов = &Неопределено
	        |	И упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИсточникПлана = &ИсточникПлана
	        |	И (упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
	        |	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПодразделениям
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЗадачиТрансляции.ПроектнаяЗадача КАК ПроектнаяЗадача
	        |					ИЗ
	        |						ВТ_ЗадачиТрансляции КАК ВТ_ЗадачиТрансляции
	        |					ГДЕ
	        |						(&РасходыПоНатуральнымПоказателям
	        |							ИЛИ ВТ_ЗадачиТрансляции.ВключитьМатРесурсыВПланРасходов))) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
	        |ГДЕ
	        |	(упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0
	        |			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Номенклатура КАК Номенклатура,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Контрагент КАК Контрагент,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Договор КАК Договор,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязки КАК СпособПривязки,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Валюта КАК Валюта,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Версия КАК Версия,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязкиРасхода КАК СпособПривязкиРасхода,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество КАК Количество,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная КАК СуммаВалютная
	        |ПОМЕСТИТЬ ВТ_МатериальныеРесурсы
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЗадачиТрансляции.ПроектнаяЗадача КАК ПроектнаяЗадача
	        |					ИЗ
	        |						ВТ_ЗадачиТрансляции КАК ВТ_ЗадачиТрансляции
	        |					ГДЕ
	        |						(&РасходыПоНатуральнымПоказателям
	        |							ИЛИ ВТ_ЗадачиТрансляции.ВключитьМатРесурсыВПланРасходов))) КАК упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних
	        |ГДЕ
	        |	(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество <> 0
	        |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_МатериальныеРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_МатериальныеРесурсы.Валюта КАК Валюта,
	        |	ВТ_РаспределениеПоПодразделениям.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеПоПодразделениям.Роль КАК Роль,
	        |	ВТ_МатериальныеРесурсы.Номенклатура КАК Номенклатура,
	        |	ВТ_МатериальныеРесурсы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.Сумма, ВТ_МатериальныеРесурсы.Сумма)
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.Сумма
	        |	КОНЕЦ КАК Сумма,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.СуммаВалютная, ВТ_МатериальныеРесурсы.СуммаВалютная)
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.СуммаВалютная
	        |	КОНЕЦ КАК СуммаВалютная,
	        |	ВТ_РаспределениеПоПодразделениям.Количество КАК Количество,
	        |	ВТ_МатериальныеРесурсы.СтатьяЗатрат КАК Статья,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.СпособПривязки, ВТ_МатериальныеРесурсы.СпособПривязки)
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ПрофильРаспределения, ВТ_МатериальныеРесурсы.ПрофильРаспределения)
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.ПрофильРаспределения
	        |	КОНЕЦ КАК ПрофильРаспределения,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениям.ДатаНачисления, ВТ_МатериальныеРесурсы.ДатаПривязки)
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.ДатаПривязки
	        |	КОНЕЦ КАК ДатаНачисления,
	        |	ВТ_МатериальныеРесурсы.Контрагент КАК КонтрагентПодрядчик,
	        |	ВТ_МатериальныеРесурсы.Договор КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_МатериальныеРесурсы.Контрагент КАК Контрагент,
	        |	ВТ_МатериальныеРесурсы.Договор КАК Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК Выводить
	        |ПОМЕСТИТЬ ВТ_Сводно
	        |ИЗ
	        |	ВТ_МатериальныеРесурсы КАК ВТ_МатериальныеРесурсы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	        |		ПО ВТ_МатериальныеРесурсы.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	        |			И ВТ_МатериальныеРесурсы.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_МатериальныеРесурсы.ПроектнаяЗадача,
	        |	ВТ_МатериальныеРесурсы.Валюта,
	        |	ВТ_РаспределениеПоПодразделениям.Подразделение,
	        |	ВТ_РаспределениеПоПодразделениям.Роль,
	        |	ВТ_МатериальныеРесурсы.Номенклатура,
	        |	ВТ_МатериальныеРесурсы.ЕдиницаИзмерения,
	        |	ВТ_РаспределениеПоПериодам.Сумма,
	        |	ВТ_РаспределениеПоПериодам.Сумма,
	        |	ВТ_РаспределениеПоПериодам.Количество,
	        |	ВТ_МатериальныеРесурсы.СтатьяЗатрат,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_МатериальныеРесурсы.СпособПривязки
	        |					ИНАЧЕ ВТ_РаспределениеПоПодразделениям.СпособПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.СпособПривязки
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_РаспределениеПоПодразделениям.ПрофильРаспределения ЕСТЬ NULL
	        |						ТОГДА ВТ_МатериальныеРесурсы.ПрофильРаспределения
	        |					ИНАЧЕ ВТ_РаспределениеПоПодразделениям.ПрофильРаспределения
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_МатериальныеРесурсы.ПрофильРаспределения
	        |	КОНЕЦ,
	        |	ВТ_РаспределениеПоПериодам.Период,
	        |	ВТ_МатериальныеРесурсы.Контрагент,
	        |	ВТ_МатериальныеРесурсы.Договор,
	        |	ВТ_РаспределениеПоПодразделениям.СобствСилы_Субподряд,
	        |	ВТ_МатериальныеРесурсы.Контрагент,
	        |	ВТ_МатериальныеРесурсы.Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ
	        |ИЗ
	        |	ВТ_МатериальныеРесурсы КАК ВТ_МатериальныеРесурсы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениям КАК ВТ_РаспределениеПоПодразделениям
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПериодам КАК ВТ_РаспределениеПоПериодам
	        |			ПО ВТ_РаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоПериодам.ИндексСтрокиРаспределениеПоРолям
	        |				И ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача = ВТ_РаспределениеПоПериодам.ПроектнаяЗадача
	        |				И (ВТ_РаспределениеПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
	        |		ПО ВТ_МатериальныеРесурсы.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениям.ИндексСтрокиВладельца
	        |			И ВТ_МатериальныеРесурсы.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениям.ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	ВТ_Сводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
	        |	ВТ_Сводно.Валюта КАК Валюта,
	        |	ВТ_Сводно.Подразделение КАК Подразделение,
	        |	ВТ_Сводно.Роль КАК Роль,
	        |	ВТ_Сводно.Номенклатура КАК Номенклатура,
	        |	ВТ_Сводно.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	        |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	        |	СУММА(ВТ_Сводно.Количество) КАК Количество,
	        |	ВТ_Сводно.Статья КАК Статья,
	        |	ВЫБОР
	        |		КОГДА ВТ_Сводно.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_Сводно.Контрагент КАК Контрагент,
	        |	ВТ_Сводно.Договор КАК Договор
	        |ИЗ
	        |	ВТ_Сводно КАК ВТ_Сводно
	        |ГДЕ
	        |	ВТ_Сводно.Выводить
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Сводно.КонтрагентПодрядчик,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.СобствСилы_Субподряд,
	        |	ВТ_Сводно.Контрагент,
	        |	ВТ_Сводно.Договор,
	        |	ВТ_Сводно.Номенклатура,
	        |	ВТ_Сводно.ЕдиницаИзмерения,
	        |	ВТ_Сводно.Статья,
	        |	ВТ_Сводно.ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления,
	        |	ВТ_Сводно.ПроектнаяЗадача,
	        |	ВТ_Сводно.Валюта,
	        |	ВТ_Сводно.Подразделение,
	        |	ВТ_Сводно.Роль,
	        |	ВЫБОР
	        |		КОГДА ВТ_Сводно.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ";
	
КонецФункции

Функция ТекстРасходыТрансляцияДопзатрат_ДанныеДокумента()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаДополнительныеЗатраты.СтатьяЗатрат КАК Статья,
	        |	ТаблицаДополнительныеЗатраты.Стоимость КАК Стоимость,
	        |	ТаблицаДополнительныеЗатраты.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределения,
	        |	ТаблицаДополнительныеЗатраты.КонтрагентДоходовРасходов КАК Контрагент,
	        |	ТаблицаДополнительныеЗатраты.ДоговорДоходовРасходов КАК Договор,
	        |	ТаблицаДополнительныеЗатраты.СпособПривязкиДоходовРасходов КАК СпособПривязки,
	        |	ТаблицаДополнительныеЗатраты.ДатаПривязкиДоходовРасходов КАК ДатаПривязки,
	        |	ТаблицаДополнительныеЗатраты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	        |	ЛОЖЬ КАК Отмена
	        |ПОМЕСТИТЬ ВТ_ДопЗатраты
	        |ИЗ
	        |	&ТаблицаДополнительныеЗатраты КАК ТаблицаДополнительныеЗатраты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаРаспределениеДополнительныхЗатрат.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.СпособПривязки КАК СпособПривязки,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.ДатаПривязки КАК ДатаПривязки,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.Роль КАК Роль,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.Подразделение КАК Подразделение,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеДополнительныхЗатрат.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	        |	ЛОЖЬ КАК Отмена
	        |ПОМЕСТИТЬ ВТ_ДопЗатратыПоПодразделениям
	        |ИЗ
	        |	&ТаблицаРаспределениеДополнительныхЗатрат КАК ТаблицаРаспределениеДополнительныхЗатрат
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ТаблицаРаспределениеРасходовПоПериодам.Период КАК Период,
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Сумма КАК Сумма,
	        |	ТаблицаРаспределениеРасходовПоПериодам.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПериодам
	        |ИЗ
	        |	&ТаблицаРаспределениеРасходовПоПериодам КАК ТаблицаРаспределениеРасходовПоПериодам
	        |ГДЕ
	        |	ТаблицаРаспределениеРасходовПоПериодам.ИндексСтрокиРаспределенияРасходов = &Неопределено
			|	И ТаблицаРаспределениеРасходовПоПериодам.ИсточникПлана = &ИсточникПлана
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДопЗатраты.Статья КАК Статья,
	        |	ВТ_ДопЗатратыПоПодразделениям.Подразделение КАК Подразделение,
	        |	ВТ_ДопЗатратыПоПодразделениям.Роль КАК Роль,
	        |	ВТ_РаспределениеПоПериодам.Сумма КАК Сумма,
	        |	ВТ_РаспределениеПоПериодам.Сумма КАК СуммаВалютная,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_ДопЗатратыПоПодразделениям.СпособПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_ДопЗатраты.СпособПривязки
	        |					ИНАЧЕ ВТ_ДопЗатратыПоПодразделениям.СпособПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ДопЗатраты.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_ДопЗатратыПоПодразделениям.ПрофильРаспределения ЕСТЬ NULL
	        |						ТОГДА ВТ_ДопЗатраты.ПрофильРаспределения
	        |					ИНАЧЕ ВТ_ДопЗатратыПоПодразделениям.ПрофильРаспределения
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ДопЗатраты.ПрофильРаспределения
	        |	КОНЕЦ КАК ПрофильРаспределения,
	        |	ВТ_РаспределениеПоПериодам.Период КАК ДатаНачисления,
	        |	ВТ_ДопЗатраты.Контрагент КАК КонтрагентПодрядчик,
	        |	ВТ_ДопЗатраты.Договор КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_ДопЗатратыПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_ДопЗатраты.Контрагент КАК Контрагент,
	        |	ВТ_ДопЗатраты.Договор КАК Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_ДопЗатратыПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК Выводить
	        |ПОМЕСТИТЬ ВТ_Сводно
	        |ИЗ
	        |	ВТ_ДопЗатраты КАК ВТ_ДопЗатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопЗатратыПоПодразделениям КАК ВТ_ДопЗатратыПоПодразделениям
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПериодам КАК ВТ_РаспределениеПоПериодам
	        |			ПО ВТ_ДопЗатратыПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоПериодам.ИндексСтрокиРаспределениеПоРолям
	        |		ПО ВТ_ДопЗатраты.ИндексСтрокРаспределения = ВТ_ДопЗатратыПоПодразделениям.ИндексСтрокиВладельца
	        |			И ВТ_ДопЗатраты.Отмена = ВТ_ДопЗатратыПоПодразделениям.Отмена
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ДопЗатраты.Статья,
	        |	ВТ_ДопЗатратыПоПодразделениям.Подразделение,
	        |	ВТ_ДопЗатратыПоПодразделениям.Роль,
	        |	ВЫБОР
	        |		КОГДА ВТ_ДопЗатратыПоПодразделениям.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_ДопЗатраты.Стоимость
	        |		ИНАЧЕ ВТ_ДопЗатратыПоПодразделениям.Сумма
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ВТ_ДопЗатратыПоПодразделениям.Сумма ЕСТЬ NULL
	        |			ТОГДА ВТ_ДопЗатраты.Стоимость
	        |		ИНАЧЕ ВТ_ДопЗатратыПоПодразделениям.Сумма
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_ДопЗатратыПоПодразделениям.СпособПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_ДопЗатраты.СпособПривязки
	        |					ИНАЧЕ ВТ_ДопЗатратыПоПодразделениям.СпособПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ДопЗатраты.СпособПривязки
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_ДопЗатратыПоПодразделениям.ПрофильРаспределения ЕСТЬ NULL
	        |						ТОГДА ВТ_ДопЗатраты.ПрофильРаспределения
	        |					ИНАЧЕ ВТ_ДопЗатратыПоПодразделениям.ПрофильРаспределения
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ДопЗатраты.ПрофильРаспределения
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_ДопЗатратыПоПодразделениям.ДатаПривязки ЕСТЬ NULL
	        |						ТОГДА ВТ_ДопЗатраты.ДатаПривязки
	        |					ИНАЧЕ ВТ_ДопЗатратыПоПодразделениям.ДатаПривязки
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_ДопЗатраты.ДатаПривязки
	        |	КОНЕЦ,
	        |	ВТ_ДопЗатраты.Контрагент,
	        |	ВТ_ДопЗатраты.Договор,
	        |	ВТ_ДопЗатратыПоПодразделениям.СобствСилы_Субподряд,
	        |	ВТ_ДопЗатраты.Контрагент,
	        |	ВТ_ДопЗатраты.Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_ДопЗатратыПоПодразделениям.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ
	        |ИЗ
	        |	ВТ_ДопЗатраты КАК ВТ_ДопЗатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопЗатратыПоПодразделениям КАК ВТ_ДопЗатратыПоПодразделениям
	        |		ПО ВТ_ДопЗатраты.ИндексСтрокРаспределения = ВТ_ДопЗатратыПоПодразделениям.ИндексСтрокиВладельца
	        |			И ВТ_ДопЗатраты.Отмена = ВТ_ДопЗатратыПоПодразделениям.Отмена
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	&Ссылка КАК ПроектнаяЗадача,
	        |	ВТ_Сводно.Статья КАК Статья,
	        |	ВТ_Сводно.Подразделение КАК Подразделение,
	        |	ВТ_Сводно.Роль КАК Роль,
	        |	СУММА(ВТ_Сводно.Сумма) КАК Сумма,
	        |	СУММА(ВТ_Сводно.СуммаВалютная) КАК СуммаВалютная,
	        |	0 КАК Количество,
	        |	&ВалютаУправленческогоУчета КАК Валюта,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Сводно.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_Сводно.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_Сводно.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВТ_Сводно.Контрагент КАК Контрагент,
	        |	ВТ_Сводно.Договор КАК Договор,
	        |	&ИсточникПлана КАК ИсточникПлана,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема
	        |ИЗ
	        |	ВТ_Сводно КАК ВТ_Сводно
	        |ГДЕ
	        |	ВТ_Сводно.Выводить
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Сводно.КонтрагентПодрядчик,
	        |	ВТ_Сводно.Заказ_ДоговорПодрядчика,
	        |	ВТ_Сводно.СобствСилы_Субподряд,
	        |	ВТ_Сводно.Контрагент,
	        |	ВТ_Сводно.Договор,
	        |	ВТ_Сводно.ПрофильРаспределения,
	        |	ВТ_Сводно.ДатаНачисления,
	        |	ВТ_Сводно.Статья,
	        |	ВТ_Сводно.Подразделение,
	        |	ВТ_Сводно.Роль,
	        |	ВЫБОР
	        |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_Сводно.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиРаспределения)
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_Сводно.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_Сводно.СпособПривязки
	        |	КОНЕЦ";
			
КонецФункции			

Функция ТекстРасходыТрансляцияДопзатрат_ДанныеРегистров()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма КАК Сумма,
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество КАК Количество
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПериодамДопЗатраты
	        |ИЗ
	        |	РегистрСведений.упоДанныеРаспределенияРасходовПоПериодам.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЗадачиТрансляции.ПроектнаяЗадача КАК ПроектнаяЗадача
	        |					ИЗ
	        |						ВТ_ЗадачиТрансляции КАК ВТ_ЗадачиТрансляции
	        |					ГДЕ
	        |						ВТ_ЗадачиТрансляции.ВключитьДопЗатратыВПланРасходов)) КАК упоДанныеРаспределенияРасходовПоПериодамСрезПоследних
	        |ГДЕ
	        |	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияРасходов = &Неопределено
	        |	И упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИсточникПлана = &ИсточникПлана
	        |	И (упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма <> 0
	        |			ИЛИ упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ВидОперации КАК ВидОперации,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.КонтрагентДоходовРасходов КАК Контрагент,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДоговорДоходовРасходов КАК Договор,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.СпособПривязкиДоходовРасходов КАК СпособПривязки,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределения,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДатаПривязкиДоходовРасходов КАК ДатаПривязки,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ДопЗатраты
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановДополнительныхЗатрат.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЗадачиТрансляции.ПроектнаяЗадача КАК ПроектнаяЗадача
	        |					ИЗ
	        |						ВТ_ЗадачиТрансляции КАК ВТ_ЗадачиТрансляции
	        |					ГДЕ
	        |						ВТ_ЗадачиТрансляции.ВключитьДопЗатратыВПланРасходов)) КАК упоДанныеПлановДополнительныхЗатратСрезПоследних
	        |ГДЕ
	        |	упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Роль КАК Роль,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Сумма КАК Сумма
	        |ПОМЕСТИТЬ ВТ_РаспределениеПоПодразделениямДопЗатраты
	        |ИЗ
	        |	РегистрСведений.упоДанныеПлановДополнительныхЗатратПодразделения.СрезПоследних(
	        |			,
	        |			Версия = &ТекущаяВерсия
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						ВТ_ЗадачиТрансляции.ПроектнаяЗадача КАК ПроектнаяЗадача
	        |					ИЗ
	        |						ВТ_ЗадачиТрансляции КАК ВТ_ЗадачиТрансляции
	        |					ГДЕ
	        |						ВТ_ЗадачиТрансляции.ВключитьДопЗатратыВПланРасходов)) КАК упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних
	        |ГДЕ
	        |	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Сумма <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДопЗатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ВТ_РаспределениеПоПодразделениямДопЗатраты.Подразделение КАК Подразделение,
	        |	ВТ_РаспределениеПоПодразделениямДопЗатраты.Роль КАК Роль,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениямДопЗатраты.Сумма, ВТ_ДопЗатраты.Сумма) КАК Сумма,
	        |	ЕСТЬNULL(ВТ_РаспределениеПоПодразделениямДопЗатраты.Сумма, ВТ_ДопЗатраты.Сумма) КАК СуммаВалютная,
	        |	ВТ_ДопЗатраты.СтатьяЗатрат КАК Статья,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениямДопЗатраты.ДатаНачисления, ВТ_ДопЗатраты.ДатаПривязки)
	        |		ИНАЧЕ ВТ_ДопЗатраты.ДатаПривязки
	        |	КОНЕЦ КАК ДатаНачисления,
	        |	ВТ_РаспределениеПоПодразделениямДопЗатраты.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениямДопЗатраты.СпособПривязки, ВТ_ДопЗатраты.СпособПривязки)
	        |		ИНАЧЕ ВТ_ДопЗатраты.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениямДопЗатраты.ПрофильРаспределения, ВТ_ДопЗатраты.ПрофильРаспределения)
	        |		ИНАЧЕ ВТ_ДопЗатраты.ПрофильРаспределения
	        |	КОНЕЦ КАК ПрофильРаспределения,
	        |	ВТ_ДопЗатраты.Контрагент КАК КонтрагентПодрядчик,
	        |	ВТ_ДопЗатраты.Договор КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_ДопЗатраты.Контрагент КАК Контрагент,
	        |	ВТ_ДопЗатраты.Договор КАК Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениямДопЗатраты.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК Выводить
	        |ПОМЕСТИТЬ ВТ_СводноДопЗатраты
	        |ИЗ
	        |	ВТ_ДопЗатраты КАК ВТ_ДопЗатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениямДопЗатраты КАК ВТ_РаспределениеПоПодразделениямДопЗатраты
	        |		ПО ВТ_ДопЗатраты.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениямДопЗатраты.ИндексСтрокиВладельца
	        |			И ВТ_ДопЗатраты.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениямДопЗатраты.ПроектнаяЗадача
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ДопЗатраты.ПроектнаяЗадача,
	        |	ВТ_РаспределениеПоПодразделениямДопЗатраты.Подразделение,
	        |	ВТ_РаспределениеПоПодразделениямДопЗатраты.Роль,
	        |	ВТ_РаспределениеПоПериодамДопЗатраты.Сумма,
	        |	ВТ_РаспределениеПоПериодамДопЗатраты.Сумма,
	        |	ВТ_ДопЗатраты.СтатьяЗатрат,
	        |	ВТ_РаспределениеПоПериодамДопЗатраты.Период,
	        |	ВТ_РаспределениеПоПодразделениямДопЗатраты.СобствСилы_Субподряд,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениямДопЗатраты.СпособПривязки, ВТ_ДопЗатраты.СпособПривязки)
	        |		ИНАЧЕ ВТ_ДопЗатраты.СпособПривязки
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА &РасходыПоОбъемам
	        |			ТОГДА ЕСТЬNULL(ВТ_РаспределениеПоПодразделениямДопЗатраты.ПрофильРаспределения, ВТ_ДопЗатраты.ПрофильРаспределения)
	        |		ИНАЧЕ ВТ_ДопЗатраты.ПрофильРаспределения
	        |	КОНЕЦ,
	        |	ВТ_ДопЗатраты.Контрагент,
	        |	ВТ_ДопЗатраты.Договор,
	        |	ВТ_ДопЗатраты.Контрагент,
	        |	ВТ_ДопЗатраты.Договор,
	        |	ВЫБОР
	        |		КОГДА ВТ_РаспределениеПоПодразделениямДопЗатраты.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ
	        |ИЗ
	        |	ВТ_ДопЗатраты КАК ВТ_ДопЗатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПодразделениямДопЗатраты КАК ВТ_РаспределениеПоПодразделениямДопЗатраты
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспределениеПоПериодамДопЗатраты КАК ВТ_РаспределениеПоПериодамДопЗатраты
	        |			ПО ВТ_РаспределениеПоПодразделениямДопЗатраты.ИндексСтрокРаспределенияПоПериодам = ВТ_РаспределениеПоПериодамДопЗатраты.ИндексСтрокиРаспределениеПоРолям
	        |				И ВТ_РаспределениеПоПодразделениямДопЗатраты.ПроектнаяЗадача = ВТ_РаспределениеПоПериодамДопЗатраты.ПроектнаяЗадача
	        |				И (ВТ_РаспределениеПоПодразделениямДопЗатраты.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
	        |		ПО ВТ_ДопЗатраты.ИндексСтрокРаспределения = ВТ_РаспределениеПоПодразделениямДопЗатраты.ИндексСтрокиВладельца
	        |			И ВТ_ДопЗатраты.ПроектнаяЗадача = ВТ_РаспределениеПоПодразделениямДопЗатраты.ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&ТекущаяВерсия КАК Версия,
	        |	ВТ_СводноДопЗатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
	        |	&ВалютаУправленческогоУчета КАК Валюта,
	        |	ВТ_СводноДопЗатраты.Подразделение КАК Подразделение,
	        |	ВТ_СводноДопЗатраты.Роль КАК Роль,
	        |	ВТ_СводноДопЗатраты.Статья КАК Статья,
	        |	ВТ_СводноДопЗатраты.ДатаНачисления КАК ДатаНачисления,
	        |	ВТ_СводноДопЗатраты.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	        |	ВЫБОР
	        |		КОГДА ВТ_СводноДопЗатраты.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводноДопЗатраты.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводноДопЗатраты.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводноДопЗатраты.СпособПривязки
	        |	КОНЕЦ КАК СпособПривязки,
	        |	ВТ_СводноДопЗатраты.ПрофильРаспределения КАК ПрофильРаспределения,
	        |	ВТ_СводноДопЗатраты.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	        |	ВТ_СводноДопЗатраты.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	        |	ВТ_СводноДопЗатраты.Контрагент КАК Контрагент,
	        |	ВТ_СводноДопЗатраты.Договор КАК Договор,
	        |	&ИсточникПлана КАК ИсточникПлана,
	        |	СУММА(ВТ_СводноДопЗатраты.Сумма) КАК Сумма,
	        |	СУММА(ВТ_СводноДопЗатраты.СуммаВалютная) КАК СуммаВалютная,
	        |	0 КАК Количество,
	        |	ВТ_СводноДопЗатраты.Выводить КАК Выводить
	        |ИЗ
	        |	ВТ_СводноДопЗатраты КАК ВТ_СводноДопЗатраты
	        |ГДЕ
	        |	ВТ_СводноДопЗатраты.Выводить
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_СводноДопЗатраты.СобствСилы_Субподряд,
	        |	ВТ_СводноДопЗатраты.Статья,
	        |	ВТ_СводноДопЗатраты.ДатаНачисления,
	        |	ВТ_СводноДопЗатраты.ПроектнаяЗадача,
	        |	ВТ_СводноДопЗатраты.Подразделение,
	        |	ВТ_СводноДопЗатраты.Роль,
	        |	ВТ_СводноДопЗатраты.ПрофильРаспределения,
	        |	ВТ_СводноДопЗатраты.КонтрагентПодрядчик,
	        |	ВТ_СводноДопЗатраты.Заказ_ДоговорПодрядчика,
	        |	ВТ_СводноДопЗатраты.Контрагент,
	        |	ВТ_СводноДопЗатраты.Договор,
	        |	ВТ_СводноДопЗатраты.Выводить,
	        |	ВЫБОР
	        |		КОГДА ВТ_СводноДопЗатраты.СпособПривязки ССЫЛКА Перечисление.упоСпособПривязкиРаспределения
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_СводноДопЗатраты.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	        |							ИЛИ ВТ_СводноДопЗатраты.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную)
	        |						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	        |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	        |				КОНЕЦ
	        |		ИНАЧЕ ВТ_СводноДопЗатраты.СпособПривязки
	        |	КОНЕЦ";							
	
КонецФункции

// Прокси для упоАналитикаПоПодразделениямКлиентСервер.
//		СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода()
//
Функция СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(СпособПривязкиДоходаРасхода)
		
	Возврат упоАналитикаПоПодразделениямКлиентСервер.
		СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(СпособПривязкиДоходаРасхода); 

КонецФункции

Процедура ЗаполнитьСтрокуДвиженияАктуальныеПланыВыполненияОбъемовПоДаннымВыборки(
			ТаблицаРаспределенная, ТаблицаДвижений, ВыборкаДоходРасход, РаспределятьКоличество = Истина)

	ОбщееКоличество = 0;					
	Для Каждого СтрокаРаспределенная Из ТаблицаРаспределенная Цикл
		
		НоваяСтрока = ТаблицаДвижений.Добавить();							
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДоходРасход);
		НоваяСтрока.ДатаНачисления = СтрокаРаспределенная.Период;
		
		Если Не РаспределятьКоличество Тогда
			НоваяСтрока.Количество = СтрокаРаспределенная.Количество;
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока.СуммаВалютная = СтрокаРаспределенная.Сумма;
		
		Если ВыборкаДоходРасход.СуммаВалютная <> 0 Тогда
			Доля = СтрокаРаспределенная.Сумма / ВыборкаДоходРасход.СуммаВалютная;
		Иначе
			Доля = 0;
		КонецЕсли;
		
		ОстатокРаспределения = ВыборкаДоходРасход.Количество - ОбщееКоличество;
		Если ОстатокРаспределения > 0 Тогда
			КоличествоРаспределенное = Окр(Доля * НоваяСтрока.Количество, 3);
			Если КоличествоРаспределенное <> 0 Тогда
				НоваяСтрока.Количество = Мин(КоличествоРаспределенное, ОстатокРаспределения);
			ИначеЕсли Доля <> 0 Тогда
				НоваяСтрока.Количество = Мин(0.001, ОстатокРаспределения);
			Иначе
				НоваяСтрока.Количество = ОстатокРаспределения;
			КонецЕсли;
			ОбщееКоличество = ОбщееКоличество + НоваяСтрока.Количество;
		Иначе
			НоваяСтрока.Количество = 0;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Функция НадоФормироватьНомерПодчиненнойСтрокиДляСобщения(ИмяТаблицыРаспределения)
	
	Возврат ИмяТаблицыРаспределения = "РаспределениеПотребностей"
		Или ИмяТаблицыРаспределения = "РаспределениеОбъемов" 
		Или ИмяТаблицыРаспределения = "РаспределениеРасходов"
		Или ИмяТаблицыРаспределения = "РаспределениеДоходов";
	
КонецФункции

Процедура СформироватьСообщениеПользователю(ЭтотОбъект, ТекстСообщения, ИмяПроверяемойТЧ, стрПроверяемойТЧ, ПолеИмя, Отказ)
	
	Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.%1[%2].%3Остаток", 
								ИмяПроверяемойТЧ, 
								Формат(ЭтотОбъект[ИмяПроверяемойТЧ].Индекс(стрПроверяемойТЧ), "ЧН=0; ЧГ=0"),
								ПолеИмя);
								
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);	
	
КонецПроцедуры

Функция НомерСтрокиДляСообщения(СтрокаРаспределения, СоответствиеНомераСтрок, НадоФормироватьНомерПодчиненнойСтрокиДляСобщения)
	
	Если НадоФормироватьНомерПодчиненнойСтрокиДляСобщения Тогда
		ИндексСтрокиВладельца = СтрокаРаспределения.ИндексСтрокиВладельца;
		Если ИндексСтрокиВладельца <> Неопределено Тогда
			НомерСтроки = СоответствиеНомераСтрок.Получить(ИндексСтрокиВладельца);
			Если НомерСтроки = Неопределено Тогда
				СоответствиеНомераСтрок.Вставить(ИндексСтрокиВладельца, 1);
				НомерСтроки = 1;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЕсли;
	Иначе
		НомерСтроки = СтрокаРаспределения.НомерСтроки;
	КонецЕсли;
	
	Возврат НомерСтроки;
	
КонецФункции

#КонецОбласти