
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
 	
	ОписаниеТиповМатериальныеРесурсы = Новый ОписаниеТипов(МассивТипов); 	
	Элементы.ОборудованиеПродаваемоеОборудование.ОграничениеТипа  = ОписаниеТиповМатериальныеРесурсы;
	СтрокаПараметр = ТаблицаПараметры.Добавить();
	СтрокаПараметр.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПирНир");
	СтрокаПараметр.ИмяСтраницы = "ПИРНИР"; 
	СтрокаПараметр = ТаблицаПараметры.Добавить();
	СтрокаПараметр.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Оборудование");
	СтрокаПараметр.ИмяСтраницы = "Оборудование";
	СтрокаПараметр = ТаблицаПараметры.Добавить();
	СтрокаПараметр.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПНР");
	СтрокаПараметр.ИмяСтраницы = "ПНР";
	СтрокаПараметр = ТаблицаПараметры.Добавить();
	СтрокаПараметр.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.СМР");
	СтрокаПараметр.ИмяСтраницы = "СМР";
	СтрокаПараметр = ТаблицаПараметры.Добавить();
	СтрокаПараметр.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Прочие");
	СтрокаПараметр.ИмяСтраницы = "Прочие";
	
	УстановитьВидимостьЭлементов();	
	
	УстановитьДоступностьКнопкиПересчитатьСуммуКонтрактаПоВнешнейСтавке(Объект.ПараметрыРасчета, 
		Элементы.ПересчитатьСуммуКонтрактаПоВнешнейСтавке);
		
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("ТаблицаПараметры") Тогда
			ОбновитьПараметрыРасчета(ВыбранноеЗначение);
			ПересчитатьСуммыПараметровРасчета();
			СортироватьСтрокиПоВидамОпераций();
		ИначеЕсли ВыбранноеЗначение.Свойство("СписокСтатей") Тогда
			Элементы[ВыбранноеЗначение.ИмяТабличнойЧасти].ТекущиеДанные.СтатьиЗатрат = ВыбранноеЗначение.СписокСтатей;
		КонецЕсли;
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ, "");
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоправкаНаИнфляциюПриИзменении(Элемент)
	
	ПересчитатьОбщуюСуммуОтклонение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитКонкурсаПриИзменении(Элемент)
	
	ПересчитатьОтклонениеОтЛимита();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыПоСтавкам(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
    ПересчитатьСуммуПоВнутреннейСтавке(ТекущиеДанные);
	ПересчитатьСуммуПоВнешнейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВнутреннююСтавку(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные; 
	ТекущиеДанные.СтавкаВнутренняя = ?(ТекущиеДанные.КоличествоЧасов = 0, 0,
		ТекущиеДанные.СуммаПоВнутреннейСтавке / ТекущиеДанные.КоличествоЧасов);
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВнешнююСтавку(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные; 
	ТекущиеДанные.СтавкаВнешняя = ?(ТекущиеДанные.КоличествоЧасов = 0, 0,
		ТекущиеДанные.СуммаПоВнешнейСтавке / ТекущиеДанные.КоличествоЧасов);
		
КонецПроцедуры											

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыРасчета

&НаКлиенте
Процедура ПараметрыРасчетаПроцентНаценкиРедактируетсяВручнуюПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыРасчета.ТекущиеДанные;
	ТекущиеДанные.СуммаКонтрактаРедактируетсяВручную = НЕ ТекущиеДанные.ПроцентНаценкиРедактируетсяВручную;
	
	УстановитьДоступностьКнопкиПересчитатьСуммуКонтрактаПоВнешнейСтавке(Объект.ПараметрыРасчета, 
		Элементы.ПересчитатьСуммуКонтрактаПоВнешнейСтавке);

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетаСуммаКонтрактаРедактируетсяВручнуюПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыРасчета.ТекущиеДанные;
	ТекущиеДанные.ПроцентНаценкиРедактируетсяВручную = НЕ ТекущиеДанные.СуммаКонтрактаРедактируетсяВручную;
	
	УстановитьДоступностьКнопкиПересчитатьСуммуКонтрактаПоВнешнейСтавке(Объект.ПараметрыРасчета, 
		Элементы.ПересчитатьСуммуКонтрактаПоВнешнейСтавке);

	Если ТекущиеДанные.СуммаКонтрактаРедактируетсяВручную Тогда
				
		ТекстВопроса = "";
		ДополнительныеПараметры = Новый Структура("ТекущиеДанные", ТекущиеДанные);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПересчитатьСуммуКонтрактаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		Если ТекущиеДанные.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Оборудование") Тогда
			ТекстВопроса = НСтр("ru = 'Пересчитать сумму контракта по данным стоимости продажи CIP и перевыставляемых дополнительных затрат?'");	
		Иначе
			ТекстВопроса = НСтр("ru = 'Пересчитать сумму контракта по данным внешней ставки и перевыставляемых дополнительных затрат?'");
		КонецЕсли;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		 
		ТекущиеДанные.ПересчитыватьСУчетомПеревыставляемыхДопЗатрат = Ложь;
		ПересчитатьСуммуКонтрактаПоВидуОперацииТекДанных(ТекущиеДанные);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетаПроцентНаценкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыРасчета.ТекущиеДанные;
	ПересчитатьСуммуКонтрактаВСтроке(ТекущиеДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетаСуммаКонтрактаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыРасчета.ТекущиеДанные;
	ПересчитатьСуммуПроцентНаценкиВСтроке(ТекущиеДанные);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасчетаПриИзменении(Элемент)
	
	ПересчитатьОбщуюСуммуОтклонение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТрудозатратыПирнир

&НаКлиенте
Процедура ТрудозатратыПИРНИРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПирНир");	
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеТрудозатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПИРНИРСпециальностьПриИзменении(Элемент)
	
	 ЗаполнитьСтавкиПоСпециальности(Элемент);
	 ЗаполнитьПодразделение(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПИРНИРКоличествоЧасовПриИзменении(Элемент)
	
	ПересчитатьСуммыПоСтавкам(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПИРНИРСтавкаВнутренняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;;
   	ПересчитатьСуммуПоВнутреннейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПИРНИРСтавкаВнешняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;; 
	ПересчитатьСуммуПоВнешнейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПИРНИРСуммаПоВнутреннейСтавкеПриИзменении(Элемент)
	
	ПересчитатьВнутреннююСтавку(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПИРНИРСуммаПоВнешнейСтавкеПриИзменении(Элемент)
	ПересчитатьВнешнююСтавку(Элемент);
КонецПроцедуры
									
&НаКлиенте
Процедура ТрудозатратыПИРНИРПриИзменении(Элемент)
	
	ЗатратыПриИзменении("ПИРНИР");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеЗатратыПирнир

&НаКлиенте
Процедура ДополнительныеЗатратыПИРНИРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПирНир");
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеДополнительныеЗатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПИРНИРТипРасчетаПриИзменении(Элемент)
	
	ПриИзмененииТипаРасчета("ДополнительныеЗатратыПИРНИР", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПИРНИРГруппаСтатейЗатратПриИзменении(Элемент)
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыПИРНИР", ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПИРНИРПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыПИРНИР", ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПИРНИРКоличествоЧасовПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасовДополнительныеЗатраты(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПИРНИРПриИзменении(Элемент)
	
	ЗатратыПриИзменении("ПИРНИР", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПИРНИРВидОперацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыПИРНИР", ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТрудозатратыПнр

&НаКлиенте
Процедура ТрудозатратыПНРПриИзменении(Элемент)
	
	ЗатратыПриИзменении("ПНР");
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПНРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПНР");	
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеТрудозатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);

КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПНРСпециальностьПриИзменении(Элемент)
	
	ЗаполнитьСтавкиПоСпециальности(Элемент);
	ЗаполнитьПодразделение(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПНРКоличествоЧасовПриИзменении(Элемент)
	
	ПересчитатьСуммыПоСтавкам(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПНРСтавкаВнутренняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
   	ПересчитатьСуммуПоВнутреннейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПНРСуммаПоВнутреннейСтавкеПриИзменении(Элемент)
	
	ПересчитатьВнутреннююСтавку(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПНРСтавкаВнешняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные; 
	ПересчитатьСуммуПоВнешнейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПНРСуммаПоВнешнейСтавкеПриИзменении(Элемент)
	
	ПересчитатьВнешнююСтавку(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеЗатратыПнр

&НаКлиенте
Процедура ДополнительныеЗатратыПНРПриИзменении(Элемент)
	
	ЗатратыПриИзменении("ПНР", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПНРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПНР");
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеДополнительныеЗатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПНРТипРасчетаПриИзменении(Элемент)
	
	ПриИзмененииТипаРасчета("ДополнительныеЗатратыПНР", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПНРГруппаСтатейЗатратПриИзменении(Элемент)
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыПНР", ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПНРПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыПНР", ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПНРКоличествоЧасовПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасовДополнительныеЗатраты(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТрудозатратыСмр

&НаКлиенте
Процедура ТрудозатратыСМРПриИзменении(Элемент)
	
	ЗатратыПриИзменении("СМР");
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыСМРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.СМР");	
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеТрудозатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыСМРСпециальностьПриИзменении(Элемент)
	
	ЗаполнитьСтавкиПоСпециальности(Элемент);
	ЗаполнитьПодразделение(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыСМРКоличествоЧасовПриИзменении(Элемент)
	
	ПересчитатьСуммыПоСтавкам(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыСМРСтавкаВнутренняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
   	ПересчитатьСуммуПоВнутреннейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыСМРСуммаПоВнутреннейСтавкеПриИзменении(Элемент)
	
	ПересчитатьВнутреннююСтавку(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыСМРСтавкаВнешняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуПоВнешнейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыСМРСуммаПоВнешнейСтавкеПриИзменении(Элемент)
	
	ПересчитатьВнешнююСтавку(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеЗатратыСмр

&НаКлиенте
Процедура ДополнительныеЗатратыСМРПриИзменении(Элемент)
	
	ЗатратыПриИзменении("СМР", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыСМРПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.СМР");
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеДополнительныеЗатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыСМРТипРасчетаПриИзменении(Элемент)
	
	ПриИзмененииТипаРасчета("ДополнительныеЗатратыСМР", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыСМРГруппаСтатейЗатратПриИзменении(Элемент)
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыСМР", ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыСМРПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыСМР", ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыСМРКоличествоЧасовПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасовДополнительныеЗатраты(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТрудозатратыПрочие

&НаКлиенте
Процедура ТрудозатратыПрочиеПриИзменении(Элемент)
	
	ЗатратыПриИзменении("Прочие");
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПрочиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Прочие");	
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеТрудозатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПрочиеСпециальностьПриИзменении(Элемент)
	
	ЗаполнитьСтавкиПоСпециальности(Элемент);
	ЗаполнитьПодразделение(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПрочиеКоличествоЧасовПриИзменении(Элемент)
	
	ПересчитатьСуммыПоСтавкам(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПрочиеСуммаПоВнутреннейСтавкеПриИзменении(Элемент)
	
	ПересчитатьВнутреннююСтавку(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПрочиеСтавкаВнутренняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
   	ПересчитатьСуммуПоВнутреннейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПрочиеСтавкаВнешняяПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные; 
	ПересчитатьСуммуПоВнешнейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыПрочиеСуммаПоВнешнейСтавкеПриИзменении(Элемент)
	
	ПересчитатьВнешнююСтавку(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеЗатратыПрочие

&НаКлиенте
Процедура ДополнительныеЗатратыПрочиеКоличествоЧасовПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасовДополнительныеЗатраты(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПрочиеПриИзменении(Элемент)
	
	ЗатратыПриИзменении("Прочие", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПрочиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Прочие");
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеДополнительныеЗатраты(Элемент, НоваяСтрока, Копирование, ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПрочиеТипРасчетаПриИзменении(Элемент)
	
	ПриИзмененииТипаРасчета("ДополнительныеЗатратыПрочие", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПрочиеГруппаСтатейЗатратПриИзменении(Элемент)
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыПрочие", ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПрочиеПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;;
	ПересчитатьСуммуДополнительныхЗатрат("ДополнительныеЗатратыПрочие", ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОборудованиеПродаваемое

&НаКлиенте
Процедура ОборудованиеПродаваемоеКоличествоПриИзменении(Элемент)
	ПересчитатьСтоимостьЗакупкиEXW();
	ПересчитатьСтоимостьПродажиEXW();
	ПересчитатьТаможеннуюСтоимостьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПродаваемоеЦенаЗакупкиПриИзменении(Элемент)
	ПересчитатьСтоимостьЗакупкиEXW();
	ПересчитатьЦенуПродажи();
	ПересчитатьТаможеннуюСтоимостьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПродаваемоеНаценкаСкидкаПриИзменении(Элемент)
	ПересчитатьЦенуПродажи();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПродаваемоеПроцентДоставкиПриИзменении(Элемент)
	ПересчитатьСтоимостьЗакупкиCIP();
	ПересчитатьСтоимостьПродажиCIP();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПродаваемоеПроцентТаможеннойСтоимостиПриИзменении(Элемент)
	ПересчитатьТаможеннуюСтоимостьЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПродаваемоеСтавкаНДСПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ПересчитатьСуммуНДС(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПродаваемоеТаможеннаяПошлинаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ПересчитатьСтоимостьПошлины(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПродаваемоеПриИзменении(Элемент)
	ПересчитатьОбщиеСуммы("Оборудование");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеЗатратыОборудование

&НаКлиенте
Процедура ДополнительныеЗатратыОборудованиеПриИзменении(Элемент)
	ПересчитатьОбщиеСуммы("Оборудование");
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыОборудованиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ЗаполнитьЗначенияПоУмолчаниюВСтрокеДополнительныеЗатраты(Элемент, НоваяСтрока, Копирование);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИтогиКонкурса

&НаКлиенте
Процедура СписокУчастниковМестоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокУчастников.ТекущиеДанные;
	Если ТекущиеДанные.Место = 1 Тогда
		Объект.Победитель = ТекущиеДанные.Контрагент;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПараметры(Команда)
	
	ПараметрыФормы = Новый Структура("ТаблицаПараметры", ТаблицаПараметры);
	ОткрытьФорму("Документ.упоРасчетЦеныКонтракта.Форма.ФормаПараметры", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьДопЗатраты(Команда)
		
	ИмяСтраницы = СтрЗаменить(Команда.Имя, "ПересчитатьДопЗатраты", "");  	
	ИмяТабличнойЧасти = "ДополнительныеЗатраты" + ИмяСтраницы;
	
	ПересчитатьДопЗатратыНаСервере(ИмяТабличнойЧасти);	
	
	Элементы["НадписьИзмененыДанные" + ИмяСтраницы].Видимость = Ложь;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ПересчитатьСуммуКонтрактаПоВнешнейСтавке(Команда)
	
	ПараметрыОтбора = Новый Структура("СуммаКонтрактаРедактируетсяВручную", Истина);
	СтрокиДляПерерасчета = Объект.ПараметрыРасчета.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ПересчитываемаяСтрока Из СтрокиДляПерерасчета Цикл
		ПересчитываемаяСтрока.ПересчитыватьСУчетомПеревыставляемыхДопЗатрат	= Истина;
		ПересчитатьСуммуКонтрактаПоВидуОперацииТекДанных(ПересчитываемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуКонтрактаПоВнешнейСтавкеДляТекущейСтроки(Команда)
	
	ТекущиеДанные = Элементы.ПараметрыРасчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ
		 ТекущиеДанные.СуммаКонтрактаРедактируетсяВручную = Ложь Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные.ПересчитыватьСУчетомПеревыставляемыхДопЗатрат	= Истина;
	ПересчитатьСуммуКонтрактаПоВидуОперацииТекДанных(ТекущиеДанные);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗатратыПриИзменении(ИмяСтраницы, ЭтоДопЗатраты = Ложь) 
	
	// Определяем видимость надписи "Данные изменены. Необходим пересчет".
	
	ТаблицаДопЗатраты = Объект["ДополнительныеЗатраты" + ИмяСтраницы];
	
	НуженПересчетДопЗатрат = Ложь;
	// Если меньше 20 строк, то обходим их и проверяем необходимость пересчета, 
	// если больше 20 строк, то ставим флаг "Нужен пересчет" в любом случае.
	Если ТаблицаДопЗатраты.Количество() < 20 Тогда
		ТекущиеДанные = Элементы["ДополнительныеЗатраты" + ИмяСтраницы].ТекущиеДанные;
		Для Каждого СтрокаДопЗатраты Из ТаблицаДопЗатраты Цикл
			// Учитываем строки с типами расчета "Процент от группы затрат", "Процент от собственных трудозатрат"
			// и "Ставка часа от собственных трудозатрат".
			// Исключение - если в доп. затратах одна строка, которую пользователь редактирует в данный момент.
			ЭтоТекущаяСтрока = ?(ТекущиеДанные = Неопределено, Ложь, СтрокаДопЗатраты.НомерСтроки = ТекущиеДанные.НомерСтроки); 
			Если (НЕ ЭтоТекущаяСтрока ИЛИ НЕ ЭтоДопЗатраты) 
				И (СтрокаДопЗатраты.ТипРасчета = ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.ПроцентОтГруппыЗатрат")
				ИЛИ СтрокаДопЗатраты.ТипРасчета = ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.ПроцентОтСобственныхТрудозатрат")
				ИЛИ СтрокаДопЗатраты.ТипРасчета = ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.СтавкаЧасаОтСобственныхТрудозатрат")) Тогда
				
				НуженПересчетДопЗатрат = Истина;
				
			КонецЕсли;			
		КонецЦикла;
	Иначе
		НуженПересчетДопЗатрат = Истина;
	КонецЕсли;
	
	Если НуженПересчетДопЗатрат Тогда
		ПоказатьСкрытьНадписьИзмененыДанные(ИмяСтраницы, Истина);
	КонецЕсли;
	
	// Пересчет сумм на закладке "Параметры расчета".
	
	ПересчитатьОбщиеСуммы(ИмяСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьНадписьИзмененыДанные(ИмяСтраницы, Показать) 
	
	Элементы["НадписьИзмененыДанные" + ИмяСтраницы].Видимость = Показать; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ОбновитьПараметрыРасчета(ВыбранноеЗначение)
	
	ТаблицаПараметры.Загрузить(ВыбранноеЗначение.ТаблицаПараметры.Выгрузить());  
	Для Каждого СтрокаПараметр Из ТаблицаПараметры Цикл 
		НайденныеСтроки = Объект.ПараметрыРасчета.НайтиСтроки(Новый Структура("ВидОперации", СтрокаПараметр.ВидОперации));
		Если СтрокаПараметр.Пометка И НайденныеСтроки.Количество() = 0 Тогда
			СтрокаПараметрРасчета = Объект.ПараметрыРасчета.Добавить();
			СтрокаПараметрРасчета.ВидОперации = СтрокаПараметр.ВидОперации;
			СтрокаПараметрРасчета.ПроцентНаценкиРедактируетсяВручную = Истина;
		ИначеЕсли НЕ СтрокаПараметр.Пометка И НайденныеСтроки.Количество() > 0 Тогда
			Объект.ПараметрыРасчета.Удалить(НайденныеСтроки[0]);
		КонецЕсли;
		Элементы["Страница" + Строка(СтрокаПараметр.ИмяСтраницы)].Видимость = СтрокаПараметр.Пометка;
	КонецЦикла; 
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтавкиПоСпециальности(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ТекущиеДанные.СтавкаВнутренняя = ПолучитьСтавкуПоНорме(ТекущиеДанные.Специальность, Объект.НормаСтоимостиВнутренняя);
	ТекущиеДанные.СтавкаВнешняя = ПолучитьСтавкуПоНорме(ТекущиеДанные.Специальность, Объект.НормаСтоимостиВнешняя);
	ПересчитатьСуммуПоВнутреннейСтавке(ТекущиеДанные);
	ПересчитатьСуммуПоВнешнейСтавке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодразделение(Элемент) 
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	ТекущиеДанные.Подразделение = ПолучитьПодразделениеДляРоли(ТекущиеДанные.Специальность);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодразделениеДляРоли(Роль)	
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	упоСоставПодразделенийСрезПоследних.Подразделение
	               |ИЗ
	               |	РегистрСведений.упоСоставПодразделений.СрезПоследних(, Роль = &Роль) КАК упоСоставПодразделенийСрезПоследних
	               |ГДЕ
	               |	упоСоставПодразделенийСрезПоследних.ВходитВСостав";
				   
	Запрос.УстановитьПараметр("Роль", Роль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Подразделение = Выборка.Подразделение;
	Иначе
		Подразделение = ПредопределенноеЗначение("Справочник.упоПодразделения.ПустаяСсылка");
	КонецЕсли;
	
	Возврат Подразделение;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтавкуПоНорме(Роль, НормаСтоимости)

	Ставка = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоНормыСтоимостиРесурсовСрезПоследних.ЕдСтоимость
	               |ИЗ
	               |	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
	               |			,
	               |			Норма = &НормаСтоимости
	               |				И Ресурс = &Роль) КАК упоНормыСтоимостиРесурсовСрезПоследних";
				   
	Запрос.УстановитьПараметр("НормаСтоимости", НормаСтоимости);
	Запрос.УстановитьПараметр("Роль", Роль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ставка = Выборка.ЕдСтоимость;
	КонецЕсли;
	
	Возврат Ставка;   	

КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммуПоВнешнейСтавке(ТекущиеДанные)
	
	ТекущиеДанные.СуммаПоВнешнейСтавке = ТекущиеДанные.СтавкаВнешняя * ТекущиеДанные.КоличествоЧасов;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуПоВнутреннейСтавке(ТекущиеДанные)
	
	ТекущиеДанные.СуммаПоВнутреннейСтавке = ТекущиеДанные.СтавкаВнутренняя * ТекущиеДанные.КоличествоЧасов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТипаРасчета(ИмяТабличнойЧасти, Элемент)
	
	ТекущиеДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;	
	ПересчитатьСуммуДополнительныхЗатрат(ИмяТабличнойЧасти, ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуТрудозатратПоОтбору(ИмяТабличнойЧасти, ПараметрыОтбора, ИмяКолонки)
	
	НайденныеСтроки = Объект[СтрЗаменить(ИмяТабличнойЧасти, "ДополнительныеЗатраты", "Трудозатраты")].НайтиСтроки(ПараметрыОтбора);
	СуммаПоКолонке = 0;
	Для Каждого СтрокаТрудозатраты Из НайденныеСтроки Цикл
		СуммаПоКолонке = СуммаПоКолонке + СтрокаТрудозатраты[ИмяКолонки];
	КонецЦикла;	
	Возврат СуммаПоКолонке;
	
КонецФункции

&НаСервере
Функция РассчитатьПроцентОтГруппыЗатрат(ИмяТабличнойЧасти, НомерТекущейСтроки, ГруппаСтатейЗатрат, ВидОперации)
	
	СуммаБаза = 0;
	
	Если ИмяТабличнойЧасти = "ДополнительныеЗатратыОборудование" Тогда
		ТаблицаЗатраты = Объект.ОборудованиеПродаваемое.Выгрузить();
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоСобственныеСилыСубподряд"));
		ТаблицаЗатраты.Колонки.Добавить("СобственныеСилыСубподряд", Новый ОписаниеТипов(МассивТипов));
		ТаблицаЗатраты.ЗаполнитьЗначения(ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы"),
			"СобственныеСилыСубподряд");
		ИмяРеквизитаСумма  = "СтоимостьЗакупкиCIP";
	Иначе	
		ТаблицаЗатраты = Объект[СтрЗаменить(ИмяТабличнойЧасти, "ДополнительныеЗатраты", "Трудозатраты")].Выгрузить();
		ИмяРеквизитаСумма = "СуммаПоВнутреннейСтавке";
	КонецЕсли;	
	
	// Добавление дополнительных затрат.
	Для Каждого СтрокаДопЗатраты Из Объект[ИмяТабличнойЧасти] Цикл
		Если СтрокаДопЗатраты.НомерСтроки <> НомерТекущейСтроки Тогда
			СтрокаЗатраты = ТаблицаЗатраты.Добавить();
			СтрокаЗатраты.СтатьяЗатрат = СтрокаДопЗатраты.СтатьяЗатрат;
			СтрокаЗатраты.СобственныеСилыСубподряд = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы");
			СтрокаЗатраты.СуммаПоВнутреннейСтавке = СтрокаДопЗатраты.Сумма;
		КонецЕсли;
	КонецЦикла;	
	
	// Расчет суммы.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаТрудозатраты.СтатьяЗатрат,
				   |	ТаблицаТрудозатраты.ВидОперации,
	               |	ТаблицаТрудозатраты.СобственныеСилыСубподряд,
	               |	ТаблицаТрудозатраты." + ИмяРеквизитаСумма
				   + ?(ИмяТабличнойЧасти = "ДополнительныеЗатратыОборудование", ",
				   |ТаблицаТрудозатраты.СуммаТаможенныхПлатежей", "") + "
	               |ПОМЕСТИТЬ втТрудозатраты
	               |ИЗ
	               |	&ТаблицаТрудозатраты КАК ТаблицаТрудозатраты
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппаСтатейЗатрат.СтатьяЗатрат
				   |ПОМЕСТИТЬ втСтатьиЗатрат
	               |ИЗ
	               |	Справочник.упоГруппыСтатейЗатрат.СтатьиЗатрат КАК ГруппаСтатейЗатрат
	               |ГДЕ
	               |	ГруппаСтатейЗатрат.Ссылка = &ГруппаСтатейЗатрат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(втТрудозатраты." + ИмяРеквизитаСумма + "), 0)" + ?(ИмяТабличнойЧасти = "ДополнительныеЗатратыОборудование", " + ЕСТЬNULL(СУММА(втТрудозатраты.СуммаТаможенныхПлатежей), 0)", "") + " КАК Сумма
	               |ИЗ
	               |	втТрудозатраты КАК втТрудозатраты
	               |ГДЕ
	               |	втТрудозатраты.СобственныеСилыСубподряд = &СобственныеСилы
	               |	И втТрудозатраты.СтатьяЗатрат В ИЕРАРХИИ(Выбрать СтатьяЗатрат ИЗ втСтатьиЗатрат КАК втСтатьиЗатрат)
				   |	И втТрудозатраты.ВидОперации = &ВидОперации";
				   
	Запрос.УстановитьПараметр("ТаблицаТрудозатраты", ТаблицаЗатраты);
	Запрос.УстановитьПараметр("СобственныеСилы", ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы"));
	Запрос.УстановитьПараметр("ГруппаСтатейЗатрат", ГруппаСтатейЗатрат);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаБаза = Выборка.Сумма;
	КонецЕсли;	
	
	Возврат СуммаБаза;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьОбщиеСуммы(СтрокаВидОперации)
	
	Если СтрокаВидОперации = "Оборудование" Тогда
		
		ТЧЗатраты = Объект["ОборудованиеПродаваемое"]; 
		СуммаЗатраты  = ТЧЗатраты.Итог("СтоимостьЗакупкиCIP") + ТЧЗатраты.Итог("СуммаТаможенныхПлатежей");
		
	Иначе
		
		СуммаЗатраты = Объект["Трудозатраты" + СтрокаВидОперации].Итог("СуммаПоВнутреннейСтавке");
		
	КонецЕсли;
	
	СуммаДопЗатраты = Объект["ДополнительныеЗатраты" + СтрокаВидОперации].Итог("Сумма");
	
	ПараметрыОтбора = Новый Структура("ВидОперации", ПредопределенноеЗначение("Справочник.упоВидыОпераций." + СтрокаВидОперации));
	НайденныеСтроки = Объект.ПараметрыРасчета.НайтиСтроки(ПараметрыОтбора);
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	НайденнаяСтрока = НайденныеСтроки[0];
	
	НайденнаяСтрока.Затраты = СуммаЗатраты + СуммаДопЗатраты;
	
	Если НайденнаяСтрока.ПроцентНаценкиРедактируетсяВручную Тогда
		ПересчитатьСуммуКонтрактаВСтроке(НайденнаяСтрока);	
	ИначеЕсли НайденнаяСтрока.СуммаКонтрактаРедактируетсяВручную Тогда
		Если НайденнаяСтрока.ПересчитыватьСУчетомПеревыставляемыхДопЗатрат Тогда
			ПересчитатьСуммуКонтрактаВСтроке(НайденнаяСтрока);	
		КонецЕсли;	
		ПересчитатьСуммуПроцентНаценкиВСтроке(НайденнаяСтрока);
	КонецЕсли;
	
	ПересчитатьОбщуюСуммуОтклонение();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуКонтрактаВСтроке(Строка)
	
	Если Строка.ПересчитыватьСУчетомПеревыставляемыхДопЗатрат Тогда
		
		ПараметрыОтбора = Новый Структура("ВидОперации", Строка.ВидОперации);
		НайденныеСтроки = ТаблицаПараметры.НайтиСтроки(ПараметрыОтбора);
		
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Возврат;
		КонецЕсли;
		СтрокаВидОперации = НайденныеСтроки[0].ИмяСтраницы;
		
		СуммаЗатраты = 0;
		Если СтрокаВидОперации = "Оборудование" Тогда
			
			ТЧЗатраты = Объект["ОборудованиеПродаваемое"]; 
			СуммаЗатраты  = ТЧЗатраты.Итог("СтоимостьПродажиCIP"); //{Вопрос аналитику, надо ли таможенные платежи вклчать?} + ТЧЗатраты.Итог("СуммаТаможенныхПлатежей");
			
		Иначе
			
			СуммаЗатраты = Объект["Трудозатраты" + СтрокаВидОперации].Итог("СуммаПоВнешнейСтавке");
			
		КонецЕсли;
		
		СуммаДопЗатраты = 0;
		ПараметрыОтбора = Новый Структура("Перевыставляемые", Истина);
		СтрокиПеревыставляемыеДопЗатраты = Объект["ДополнительныеЗатраты" + СтрокаВидОперации].НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого СтрокаПеревыставляемыеДопЗатраты из СтрокиПеревыставляемыеДопЗатраты Цикл
			СуммаДопЗатраты = СуммаДопЗатраты +	СтрокаПеревыставляемыеДопЗатраты.Сумма;	
		КонецЦикла;
		
		Строка.СуммаКонтракта = СуммаЗатраты + СуммаДопЗатраты;
				
	Иначе	
		Строка.СуммаКонтракта = Строка.Затраты + Строка.Затраты * Строка.ПроцентНаценки / 100;
	КонецЕсли;
	
	Строка.СуммаНаценки = Строка.СуммаКонтракта - Строка.Затраты;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуПроцентНаценкиВСтроке(Строка)
	
	Строка.СуммаНаценки = Строка.СуммаКонтракта - Строка.Затраты;
	Если Строка.Затраты = 0 Тогда 
		Строка.ПроцентНаценки = 0;
	Иначе
		Строка.ПроцентНаценки = 100 * Строка.СуммаНаценки / Строка.Затраты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбщуюСуммуОтклонение()
	
	КоэффициентПоправкаНаИнфляцию = Объект.ПоправкаНаИнфляцию / 100;
	ИтогСуммаКонтракта = Объект.ПараметрыРасчета.Итог("СуммаКонтракта");
	Объект.СуммаКонтракта = ИтогСуммаКонтракта + ИтогСуммаКонтракта * КоэффициентПоправкаНаИнфляцию;
	ПересчитатьОтклонениеОтЛимита();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОтклонениеОтЛимита()
	Объект.ОтклонениеОтЛимита = Объект.ЛимитКонкурса - Объект.СуммаКонтракта;	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДополнительныхЗатрат(ИмяТабличнойЧасти, ТекущиеДанные)
	
	Если ТекущиеДанные.ТипРасчета = ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.Вручную") Тогда
		
		ТекущиеДанные.КоличествоЧасов = 0;

	ИначеЕсли ТекущиеДанные.ТипРасчета = 
		ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.СтавкаЧаса") Тогда 
		
		ТекущиеДанные.Сумма = ТекущиеДанные.Показатель * ТекущиеДанные.КоличествоЧасов;
		
	ИначеЕсли ТекущиеДанные.ТипРасчета = 
		ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.СтавкаЧасаОтСобственныхТрудозатрат") Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("КоличествоЧасов", ТекущиеДанные.КоличествоЧасов);
		СтруктураДанных.Вставить("Показатель", ТекущиеДанные.Показатель);
		СтруктураДанных.Вставить("Сумма");
		СтруктураДанных.Вставить("ВидОперации", ТекущиеДанные.ВидОперации);
				
		ПересчитатьСуммуПоСтавкеЧасаОтСобственныхТрудозатрат(СтруктураДанных, ИмяТабличнойЧасти);
		ТекущиеДанные.Сумма = СтруктураДанных.Сумма;
		ТекущиеДанные.КоличествоЧасов = СтруктураДанных.КоличествоЧасов;
		
	ИначеЕсли ТекущиеДанные.ТипРасчета =
		ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.ПроцентОтСобственныхТрудозатрат") Тогда	
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("КоличествоЧасов", ТекущиеДанные.КоличествоЧасов);
		СтруктураДанных.Вставить("Показатель", ТекущиеДанные.Показатель);
		СтруктураДанных.Вставить("Сумма");
		СтруктураДанных.Вставить("ВидОперации", ТекущиеДанные.ВидОперации);
				
		ПересчитатьСуммуПоПроцентуОтСобственныхТрудозатрат(СтруктураДанных, ИмяТабличнойЧасти);
		ТекущиеДанные.Сумма = СтруктураДанных.Сумма;
		ТекущиеДанные.КоличествоЧасов = 0;
		
	ИначеЕсли ТекущиеДанные.ТипРасчета = 
		ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.ПроцентОтГруппыЗатрат") Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("КоличествоЧасов", ТекущиеДанные.КоличествоЧасов);
		СтруктураДанных.Вставить("Показатель", ТекущиеДанные.Показатель);
		СтруктураДанных.Вставить("НомерСтроки", ТекущиеДанные.НомерСтроки);
		СтруктураДанных.Вставить("ГруппаСтатейЗатрат", ТекущиеДанные.ГруппаСтатейЗатрат);
		СтруктураДанных.Вставить("ВидОперации", ТекущиеДанные.ВидОперации);
		СтруктураДанных.Вставить("Сумма");   		
		
		ПересчитатьСуммуПоПроцентуОтГруппыСтатейЗатрат(СтруктураДанных, ИмяТабличнойЧасти);
		ТекущиеДанные.Сумма = СтруктураДанных.Сумма;
		ТекущиеДанные.КоличествоЧасов = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличестваЧасовДополнительныеЗатраты(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекущиеДанные.ТипРасчета =
		ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.СтавкаЧасаОтСобственныхТрудозатрат") Тогда
		
		ТекущиеДанные.ТипРасчета = ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.СтавкаЧаса");
		
	КонецЕсли;
	ПересчитатьСуммуДополнительныхЗатрат(Элемент.Родитель.Имя, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначенияПоУмолчаниюВСтрокеТрудозатраты(Элемент, НоваяСтрока, Копирование, ВидОперации)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.ВидОперации = ВидОперации;
		ТекущиеДанные.СобственныеСилыСубподряд = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы");
		НайденныеСтроки = ТаблицаПараметры.НайтиСтроки(Новый Структура("ВидОперации", ВидОперации)); 	
		ТекущиеДанные.СтатьяЗатрат = НайденныеСтроки[0].СтатьяЗатрат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначенияПоУмолчаниюВСтрокеДополнительныеЗатраты(Элемент, НоваяСтрока, Копирование, ВидОперации = Неопределено)
	
	Если НоваяСтрока И НЕ Копирование Тогда	
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ВидОперации <> Неопределено Тогда
			ТекущиеДанные.ВидОперации = ВидОперации;
		КонецЕсли;	
		ТекущиеДанные.ТипРасчета = ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.Вручную");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьЗакупкиEXW() 
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ТекущиеДанные.СтоимостьЗакупкиEXW = ТекущиеДанные.ЦенаЗакупки * ТекущиеДанные.Количество;
	ПересчитатьСтоимостьЗакупкиCIP();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуПродажи() 
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ТекущиеДанные.ЦенаПродажи = ТекущиеДанные.ЦенаЗакупки + ТекущиеДанные.ЦенаЗакупки * ТекущиеДанные.НаценкаСкидка / 100;
	ПересчитатьСтоимостьПродажиEXW();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьПродажиEXW() 
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ТекущиеДанные.СтоимостьПродажиEXW = ТекущиеДанные.ЦенаПродажи * ТекущиеДанные.Количество;
	ПересчитатьСтоимостьПродажиCIP();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьЗакупкиCIP() 
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ТекущиеДанные.СтоимостьЗакупкиCIP = ТекущиеДанные.СтоимостьЗакупкиEXW + ТекущиеДанные.СтоимостьЗакупкиEXW * ТекущиеДанные.ПроцентДоставки / 100;	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьПродажиCIP() 
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ТекущиеДанные.СтоимостьПродажиCIP = ТекущиеДанные.СтоимостьПродажиEXW + ТекущиеДанные.СтоимостьПродажиEXW * ТекущиеДанные.ПроцентДоставки / 100;	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаможеннуюСтоимостьЗакупки() 
	ТекущиеДанные = Элементы.ОборудованиеПродаваемое.ТекущиеДанные;
	ТекущиеДанные.ТаможеннаяСтоимостьЗакупки = ТекущиеДанные.ЦенаЗакупки * ТекущиеДанные.Количество * ТекущиеДанные.ПроцентТаможеннойСтоимости / 100;
	ПересчитатьСтоимостьОформления(ТекущиеДанные);
	ПересчитатьСтоимостьПошлины(ТекущиеДанные);
	ПересчитатьСуммуНДС(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьОформления(Строка) 
	Строка.СтоимостьОформления = Строка.ТаможеннаяСтоимостьЗакупки * Объект.СтавкаТаможенногоОформления / 100;
	ПересчитатьСуммуНДС(Строка);   
	ПересчитатьСуммуТаможенныхПлатежей(Строка);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаТаможенногоОформленияПриИзменении(Элемент)
	ОборудованиеПродаваемое = Объект.ОборудованиеПродаваемое;
	Для Каждого СтрокаОборудование Из ОборудованиеПродаваемое Цикл
		ПересчитатьСтоимостьОформления(СтрокаОборудование);	
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьПошлины(ТекущиеДанные) 
	ТекущиеДанные.СтоимостьПошлины = ТекущиеДанные.ТаможеннаяСтоимостьЗакупки * ТекущиеДанные.ТаможеннаяПошлина / 100;
	ПересчитатьСуммуНДС(ТекущиеДанные);
	ПересчитатьСуммуТаможенныхПлатежей(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДС(Строка) 
	СтавкаНДСЧислом = упоФункцииОбщегоНазначенияКлиентСервер.ПолучитьСтавкуНДСЧислом(Строка.СтавкаНДС);
	Строка.СуммаНДС = (Строка.ТаможеннаяСтоимостьЗакупки + Строка.СтоимостьОформления + Строка.СтоимостьПошлины) * СтавкаНДСЧислом;
	ПересчитатьСуммуТаможенныхПлатежей(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуТаможенныхПлатежей(Строка) 
	Строка.СуммаТаможенныхПлатежей = Строка.СтоимостьОформления + Строка.СтоимостьПошлины + Строка.СуммаНДС;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыПараметровРасчета() 
	Для Каждого СтрокаПараметрРасчета Из ТаблицаПараметры Цикл
		Если СтрокаПараметрРасчета.Пометка Тогда
			ПересчитатьОбщиеСуммы(СтрокаПараметрРасчета.ИмяСтраницы);
		КонецЕсли;	
	КонецЦикла;
	ПересчитатьОбщуюСуммуОтклонение();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьСтрокиПоВидамОпераций() 
	
	Для Каждого СтрокаПараметрРасчета Из Объект.ПараметрыРасчета Цикл
		Если СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПИРНИР") Тогда
			СтрокаПараметрРасчета.Порядок = 1;
		ИначеЕсли СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Оборудование") Тогда
			СтрокаПараметрРасчета.Порядок = 2; 
		ИначеЕсли СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПНР") Тогда
			СтрокаПараметрРасчета.Порядок = 3; 
		ИначеЕсли СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.СМР") Тогда
			СтрокаПараметрРасчета.Порядок = 4; 	
		ИначеЕсли СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Прочие") Тогда
			СтрокаПараметрРасчета.Порядок = 5;
		КонецЕсли;	
	КонецЦикла;
	Объект.ПараметрыРасчета.Сортировать("Порядок");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроект(Команда)  	
	
	Если Модифицированность Тогда 		
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьПроектЗавершение",ЭтотОбъект);
		Режим = РежимДиалогаВопрос.ДаНет;
		
		ПоказатьВопрос(ОписаниеОповещения,НСтр("ru = 'Документ изменен. Записать изменения?';"
		     + " en = 'Do you want to continue?'"), Режим, 0);
			 
	Иначе
			 
		СоздатьПроектЗавершение(Неопределено,Неопределено);	 
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроектЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Модифицированность Тогда 		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Записать();	
		Иначе
			Возврат;
		КонецЕсли; 		
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СохранитьСоответствие", Истина);
	ПараметрыФормы.Вставить("КоэффициентМасштабирования", 1);
	ПараметрыФормы.Вставить("ОткрытьПанельПроекта", Истина);
	ПараметрыФормы.Вставить("РасчетЦеныКонтракта", Объект.Ссылка);
	
	ОткрытьФорму("Обработка.упоСозданиеПроектаИзШаблона.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуКонтрактаЗавершение(Ответ, ДополнительныеПараметры) Экспорт  	
	
	ДополнительныеПараметры.ТекущиеДанные.ПересчитыватьСУчетомПеревыставляемыхДопЗатрат = Ответ = КодВозвратаДиалога.Да;
	ПересчитатьСуммуКонтрактаПоВидуОперацииТекДанных(ДополнительныеПараметры.ТекущиеДанные);
	
КонецПроцедуры
 
 &НаКлиенте
Процедура ПересчитатьСуммуКонтрактаПоВидуОперацииТекДанных(ТекущиеДанные) Экспорт  	

	ПараметрыОтбора = Новый Структура("ВидОперации", ТекущиеДанные.ВидОперации);

	НайденныеСтроки = ТаблицаПараметры.НайтиСтроки(ПараметрыОтбора);
	
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	СтрокаВидОперации = НайденныеСтроки[0].ИмяСтраницы;
	
	ПересчитатьОбщиеСуммы(СтрокаВидОперации);

	ТекущиеДанные.ПересчитыватьСУчетомПеревыставляемыхДопЗатрат = Ложь;
	 
КонецПроцедуры 

&НаСервере
Процедура ПересчитатьДопЗатратыНаСервере(ИмяТабличнойЧасти)
	
	ТаблицаДопЗатраты = Объект[ИмяТабличнойЧасти];
	
	Для Каждого СтрокаДопЗатраты Из ТаблицаДопЗатраты Цикл
		
		Если СтрокаДопЗатраты.ТипРасчета = 
			ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.СтавкаЧасаОтСобственныхТрудозатрат") Тогда
			ПересчитатьСуммуПоСтавкеЧасаОтСобственныхТрудозатрат(СтрокаДопЗатраты, ИмяТабличнойЧасти)
			
		ИначеЕсли СтрокаДопЗатраты.ТипРасчета =
			ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.ПроцентОтСобственныхТрудозатрат") Тогда	
			ПересчитатьСуммуПоПроцентуОтСобственныхТрудозатрат(СтрокаДопЗатраты, ИмяТабличнойЧасти);
			
		ИначеЕсли СтрокаДопЗатраты.ТипРасчета = 
			ПредопределенноеЗначение("Перечисление.упоТипыРасчетаЦеныКонтракта.ПроцентОтГруппыЗатрат") Тогда
			ПересчитатьСуммуПоПроцентуОтГруппыСтатейЗатрат(СтрокаДопЗатраты, ИмяТабличнойЧасти);
			
		КонецЕсли;
		
	КонецЦикла; 	
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПоСтавкеЧасаОтСобственныхТрудозатрат(Данные, ИмяТабличнойЧасти)
	
	ПараметрыОтбора = Новый Структура("СобственныеСилыСубподряд",
		ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы"));
		
	Если ЗначениеЗаполнено(Данные.ВидОперации) Тогда
		ПараметрыОтбора.Вставить("ВидОперации", Данные.ВидОперации); 	
	КонецЕсли;

	Данные.КоличествоЧасов = ПолучитьСуммуТрудозатратПоОтбору(ИмяТабличнойЧасти, ПараметрыОтбора, "КоличествоЧасов");
	Данные.Сумма = Данные.Показатель * Данные.КоличествоЧасов;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПоПроцентуОтСобственныхТрудозатрат(Данные, ИмяТабличнойЧасти)
	
	ПараметрыОтбора = Новый Структура("СобственныеСилыСубподряд",
		ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы"));
		
	Если ЗначениеЗаполнено(Данные.ВидОперации) Тогда
		ПараметрыОтбора.Вставить("ВидОперации", Данные.ВидОперации); 	
	КонецЕсли;

	СуммаБаза = ПолучитьСуммуТрудозатратПоОтбору(ИмяТабличнойЧасти, ПараметрыОтбора, "СуммаПоВнутреннейСтавке");
	Данные.Сумма = СуммаБаза * Данные.Показатель / 100;
	Данные.КоличествоЧасов = 0;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуПоПроцентуОтГруппыСтатейЗатрат(Данные, ИмяТабличнойЧасти)
	
	СуммаБаза = РассчитатьПроцентОтГруппыЗатрат(ИмяТабличнойЧасти,
												Данные.НомерСтроки, 
												Данные.ГруппаСтатейЗатрат,
												Данные.ВидОперации);		
	Данные.Сумма = СуммаБаза * Данные.Показатель / 100;
	Данные.КоличествоЧасов = 0;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Для Каждого СтрокаПараметр Из ТаблицаПараметры Цикл 
		НайденныеСтроки = Объект.ПараметрыРасчета.НайтиСтроки(Новый Структура("ВидОперации", СтрокаПараметр.ВидОперации));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			СтрокаПараметр.Пометка = Истина;
			СтрокаПараметр.СтатьяЗатрат = НайденнаяСтрока.СтатьяЗатрат; 
		КонецЕсли;
		Элементы["Страница" + Строка(СтрокаПараметр.ИмяСтраницы)].Видимость = СтрокаПараметр.Пометка;
	КонецЦикла;
	
	Элементы.НадписьИзмененыДанныеПИРНИР.Видимость = Ложь;
	Элементы.НадписьИзмененыДанныеПНР.Видимость = Ложь;
	Элементы.НадписьИзмененыДанныеСМР.Видимость = Ложь;
	Элементы.НадписьИзмененыДанныеПрочие.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопкиПересчитатьСуммуКонтрактаПоВнешнейСтавке(ПараметрыРасчета, ЭлементФормы)
	
	ПараметрыОтбора = Новый Структура("СуммаКонтрактаРедактируетсяВручную", Истина);
	СтрокиДляПерерасчета = ПараметрыРасчета.НайтиСтроки(ПараметрыОтбора);
	
	Если ЗначениеЗаполнено(СтрокиДляПерерасчета) Тогда
		ЭлементФормы.Доступность = Истина;
	Иначе
		ЭлементФормы.Доступность = Ложь;
	КонецЕсли;		
			
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти
