
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Открыть отчет по очереди по области отчета.
//
// Параметры:
//  Область				 - ОбластьЯчеекТабличногоДокумента 	 - Область.
//  СтандартнаяОбработка - Булево	 - СтандартнаяОбработка.
// 
// Возвращаемое значение:
//  Булево - Открыт или нет отчет.
//
Функция ОткрытьОтчетПоОчередиПоОбластиОтчета(Область, СтандартнаяОбработка) Экспорт
	
	Если Область = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОткрытьОтчетПоОчередиПоРасшифровкеОтчета(Область.Расшифровка, СтандартнаяОбработка);
	
КонецФункции

// Функция - Открыть отчет по очереди по расшифровке отчета.
//
// Параметры:
//  Расшифровка			 - Произвольный	 - Расшифровка.
//  СтандартнаяОбработка - Булево	 - СтандартнаяОбработка.
// 
// Возвращаемое значение:
//  Булево - Открыт или нет отчет.
//
Функция ОткрытьОтчетПоОчередиПоРасшифровкеОтчета(Расшифровка, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Расшифровка) <> Тип("Строка") ИЛИ Лев(Расшифровка, 15) <> "ОткрытьОчередь_" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОчереди = Сред(Расшифровка, 16);
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьОтчетПоОчереди(ИмяОчереди);

	Возврат Истина;
	
КонецФункции

// Процедура - Открыть отчет по очереди.
//
// Параметры:
//  ИмяОчереди	 - Строка	- Имя очереди.
//
Процедура ОткрытьОтчетПоОчереди(ИмяОчереди) Экспорт 
	
	ОткрытьФорму("Обработка.упоРаботаСОчередями.Форма.Отчет", Новый Структура("ИмяОчереди", ИмяОчереди));
	
КонецПроцедуры

// Процедура - Оповестить пользователя о состоянии очереди распределения трудозатрат.
//
// Параметры:
//  Проект	 - СписокЗначений, Массив, СправочникСсылка.Проекты, Неопределено	 - Проект отбора, если необходимо. 
//
Процедура ОповеститьПользователяОСостоянииОчередиРаспределенияТрудозатрат(Проект = Неопределено) Экспорт 
	
	СостояниеОчереди = упоРаботаСОчередямиВызовСервера.ПолучитьСостояниеОчередиРаспределенияТрудозатрат(Проект);
	
	Если СостояниеОчереди.Очередь > 0 ИЛИ СостояниеОчереди.Ошибок > 0 Тогда
		
		//ТекстОповещения = НСтр("ru = 'Очередь отложенного отражения плановых трудозатрат'");
		ТекстОповещения = НСтр("ru = 'Важно'");
		
		//ТекстПояснения =  НСтр("ru = '%1 задач и %2 ошибок в очереди отложенного отражения плановых трудозатрат.'");
		ТекстПояснения =  НСтр("ru = '%1 задач в очереди отложенного отражения плановых трудозатрат.'");
		//ТекстПояснения = СтрШаблон(ТекстПояснения, СостояниеОчереди.Очередь, СостояниеОчереди.Ошибок);
		ТекстПояснения = СтрШаблон(ТекстПояснения, СостояниеОчереди.Всего);
		
		ПараметрыОповещения = Новый Структура("ИмяОчереди", "упоОчередьОтраженияПлановыхТрудозатратЗадач");
		ОповещениеОНажатии = Новый ОписаниеОповещения("ОбработатьНажатиеНаОповещениеОСостоянииОчереди", ЭтотОбъект, ПараметрыОповещения);
		
		ПоказатьОповещениеПользователя(ТекстОповещения, ОповещениеОНажатии, ТекстПояснения); 
		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Обработать нажатие на оповещение о состоянии очереди.
//
// Параметры:
//  ДополнительныеПараметры	 - Структура	 - Дополнительные параметры оповещения.
//
Процедура ОбработатьНажатиеНаОповещениеОСостоянииОчереди(ДополнительныеПараметры) Экспорт 	
		
	упоРаботаСОчередямиКлиент.ОткрытьОтчетПоОчереди(ДополнительныеПараметры.ИмяОчереди);
	
КонецПроцедуры

// Процедура - Вывести оповещения.
//
// Параметры:
//  СписокОповещений - СписокЗначений	 - Список оповещений.
//
Процедура ВывестиОповещения(СписокОповещений) Экспорт
		
	ВывестиСразу = Истина;
	
	Если ВывестиСразу Тогда
		
		Для Каждого ЭлементСписка Из СписокОповещений Цикл
			
			ДанныеОповещения = ЭлементСписка.Значение;
			
			ОповещениеОНажатии = Новый ОписаниеОповещения(ДанныеОповещения.ИмяПроцедуры, ЭтотОбъект, ДанныеОповещения.ПараметрыОповещения);
			
			ПоказатьОповещениеПользователя(ДанныеОповещения.ТекстОповещения, ОповещениеОНажатии, ДанныеОповещения.ТекстПояснения); 
			
		КонецЦикла;
		
		СписокОповещений.Очистить();
		
	Иначе
		
		СписокОповещенийВСистеме = ПолучитьСписокОповещенийОСостоянииОчередей();
		
		Для Каждого НовыйЭлемент Из СписокОповещений Цикл
			СписокОповещенийВСистеме.Добавить(НовыйЭлемент.Значение);
		КонецЦикла;
		
		ПодключитьОбработчикОжидания("ВывестиОповещенияИзОбщегоСписка", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Вывести оповещения из общего списка.
//
Процедура ВывестиОповещенияИзОбщегоСписка() Экспорт  
	
	СписокОповещений = ПолучитьСписокОповещенийОСостоянииОчередей();
	
	Для Каждого ЭлементСписка Из СписокОповещений Цикл
		
		ДанныеОповещения = ЭлементСписка.Значение;
		
		ОповещениеОНажатии = Новый ОписаниеОповещения(ДанныеОповещения.ИмяПроцедуры, ЭтотОбъект, ДанныеОповещения.ПараметрыОповещения);
		
		ПоказатьОповещениеПользователя(ДанныеОповещения.ТекстОповещения, ОповещениеОНажатии, ДанныеОповещения.ТекстПояснения); 
		
	КонецЦикла;
	
	СписокОповещений.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокОповещенийОСостоянииОчередей() 
	
	ИмяПременной = ИмяПеременнойСписокОповещений();
	
	СписокОповещенийВСистеме = ПараметрыПриложения.Получить(ИмяПременной);
	Если СписокОповещенийВСистеме = Неопределено Тогда
		СписокОповещенийВСистеме = Новый СписокЗначений;
		ПараметрыПриложения.Вставить(ИмяПременной, СписокОповещенийВСистеме);
	КонецЕсли;
	
	Возврат СписокОповещенийВСистеме;
	
КонецФункции

Функция ИмяПеременнойСписокОповещений()
	
	Возврат "УправлениеПроектами.СписокОповещенийОСостоянииОчередей";	
	
КонецФункции 

#КонецОбласти