
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Возвращает данные для проведения документа.
//
// Параметры:
//   ДокументСсылка  - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
// Возвращаемое значение:
//  Структура: 
//   	* Ключ - Строка - имя регистра.
//   	* Значение - ТаблицаЗначений - данные для проведения документа.
//
Функция ДанныеПроведения(ДокументСсылка) Экспорт
	
	ДанныеПроведения = Новый Структура;
	
	ИспользоватьОценкуИсполнителейПодрядчиков = ПолучитьФункциональнуюОпцию("упоИспользоватьОценкуИсполнителейПодрядчиков");
	
	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗадачиЭтапа());
	ТекстыЗапроса.Добавить(ТекстПроведение());
	Если ИспользоватьОценкуИсполнителейПодрядчиков Тогда
		ТекстыЗапроса.Добавить(ТекстПроведениеИспользоватьОценку());
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ПроектнаяЗадача, Проект");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ТекВерсия", 
		упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(РеквизитыДокумента.Проект));
	Запрос.УстановитьПараметр("ПроектнаяЗадача", РеквизитыДокумента.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("Зеркало", 
		упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(РеквизитыДокумента.ПроектнаяЗадача));
	Запрос.УстановитьПараметр("СтатусПроектнойЗадачи", Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
	Если ИспользоватьОценкуИсполнителейПодрядчиков Тогда
		Запрос.УстановитьПараметр("РольПодрядчик", Перечисления.упоПредметыОценки.Подрядчик);
	КонецЕсли;
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Результат = Запрос.ВыполнитьПакет();
	
	Последний = Результат.ВГраница();
	ПакетыОценки = 0;
	Если ИспользоватьОценкуИсполнителейПодрядчиков Тогда
		ДанныеПроведения.Вставить("упоОценкаИсполнителейПодрядчиков", Результат[Последний - 1].Выгрузить());
		ДанныеПроведения.Вставить("упоКТУИсполнителей", Результат[Последний].Выгрузить());
		ПакетыОценки = 3;
	КонецЕсли;
	ДанныеПроведения.Вставить("упоСтатусыПроектныхЗадач", Результат[Последний - ПакетыОценки - 1].Выгрузить());
	ДанныеПроведения.Вставить("упоПроцентыГотовностиПроектныхЗадач", Результат[Последний - ПакетыОценки].Выгрузить());
	ДанныеПроведения.Вставить("МассивЗадачЭтапа", 
		ДанныеПроведения.упоПроцентыГотовностиПроектныхЗадач.ВыгрузитьКолонку("ПроектнаяЗадача"));
		
	Возврат ДанныеПроведения;
		
КонецФункции

#КонецОбласти

#Область ОценкаИсполнителейПодрядчиков

// Проверяет заполнение показателя сложности.
//
// Параметры:
//  ПоказательСложность  - СправочникСсылка.упоПоказателиПроектов - показатель Сложность.
//
// Возвращаемое значение:
//   Булево - правильность заполнения показателя.
//
Функция ПоказательСложностьЗаполненПравильно(ПоказательСложность) Экспорт
	
	МассивОшибок = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ПоказательСложность) Тогда
		
		МассивОшибок.Добавить(НСтр("ru = 'Не установлен показатель сложности задач.'"));
		
	Иначе	
		
		РеквизитыПоказателя = упоФункцииБСП.ЗначенияРеквизитовОбъектаВызовСервера(ПоказательСложность, 
			"ПринадлежностьПоказателя, ВидЗаполнения, ТипЗаполнения, ИмяПоляОбъектаПЗ, ИмяПоляЗначенияПЗ, ТипИндикатора");
		
		Если НЕ(РеквизитыПоказателя.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий
			ИЛИ РеквизитыПоказателя.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи) Тогда
 			МассивОшибок.Добавить(НСтр("ru = 'Показатель сложности не может быть получен для проектной задачи.'")); 		
        Иначе			 			
			Если РеквизитыПоказателя.ВидЗаполнения <> Перечисления.упоВидЗаполненияИндикатора.Вручную 
				И РеквизитыПоказателя.ТипЗаполнения = 0 Тогда
				Если НЕ ЗначениеЗаполнено(РеквизитыПоказателя.ИмяПоляОбъектаПЗ) Тогда
					МассивОшибок.Добавить(НСтр("ru = 'В показателе сложности не заполнено имя поля задачи.'")); 	
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(РеквизитыПоказателя.ИмяПоляЗначенияПЗ) Тогда
		 			МассивОшибок.Добавить(НСтр("ru = 'В показателе сложности не заполнено имя поля показателя задачи.'")); 
				КонецЕсли;
			КонецЕсли;	
			Если РеквизитыПоказателя.ТипИндикатора <> Перечисления.упоТипИндикатора.Число Тогда
	 			МассивОшибок.Добавить(НСтр("ru = 'Тип показателя сложности не является числовым.'")); 
			КонецЕсли;			
		КонецЕсли;							
		
	КонецЕсли;	
	
	ПоказательЗаполненПравильно = МассивОшибок.Количество() = 0;
	
	Если Не ПоказательЗаполненПравильно Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрСоединить(МассивОшибок, Символы.ПС));		
	КонецЕсли;	
	
	Возврат ПоказательЗаполненПравильно;
	
КонецФункции	

// Получает значение показателя сложности для проектной задачи.
//
// Параметры:
//  ПроектнаяЗадача  - ДокументСсылка.упоПроектнаяЗадача - проектная задача.
//
// Возвращаемое значение:
//   Число - значение показателя.
//
Функция ЗначениеПоказателяСложность(ПроектнаяЗадача) Экспорт
	
	Сложность = 0;
	
	Если ПолучитьФункциональнуюОпцию("упоИспользоватьОценкуИсполнителейПодрядчиков") 
		И ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
	
		ПоказательСложность = Константы.упоПоказательСложности.Получить();
		
		Если НЕ ПоказательСложностьЗаполненПравильно(ПоказательСложность) Тогда
			Возврат Сложность;
		КонецЕсли;	
			
		ТекстОшибки = "";
		Сложность = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателя(ПоказательСложность, 
			упоПроектыИЗадачиВызовСервера.обПолучитьСвязанныйЭлементПроекта(ПроектнаяЗадача),, ТекстОшибки);
			
		Если ТекстОшибки <> "" Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Сложность", "Объект.Сложность");
		КонецЕсли;
		
	КонецЕсли;	
		
	Возврат Сложность;
	
КонецФункции	

// Формирует таблицы оценок и трудозатрат для заполнения документа оценки.
//
// Параметры:
//  ПроектнаяЗадачаЭтап  - ДокументСсылка.упоПроектнаяЗадача - проектная задача (оцениваемый этап).
//  ТаблицыОценокИТрудозатрат  - Структура: - передается для сохранения заполненных значений на форме.
//		* Оценки - ТаблицаЗначений - таблица оценок из документа оценки.
//		* Трудозатраты - ТаблицаЗначений - таблица трудозатрат из документа оценки.		
//  ТолькоНаличие  - Булево - признак необходимости проверки наличия трудозатрат по проектной задаче без возврата 
//   таблицы значений. Используется при проведении документа с константой упоОбязательнаяОценкаИсполнителейПодрядчиков.
//
// Возвращаемое значение:
//   Структура, Булево - структура с таблицами значений таблица оценок исполнителей и трудозатрат 
//		или признак наличия трудозатрат по проектной задаче.
//
Функция ТаблицыОценокИТрудозатрат(ПроектнаяЗадачаЭтап, Знач ТаблицыОценокИТрудозатрат, ТолькоНаличие = Ложь) Экспорт
		
	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("Зеркало", упоПроектыИЗадачиВызовСервера.обПолучитьСвязанныйЭлементПроекта(ПроектнаяЗадачаЭтап));
	Запрос.УстановитьПараметр("РольПодрядчик", Перечисления.упоПредметыОценки.Подрядчик);				
	ПакетТрудозатраты = 0;
	Запрос.Текст = ТекстЗаполнение(ТаблицыОценокИТрудозатрат, Запрос, ПакетТрудозатраты);

	Результат = Запрос.ВыполнитьПакет();
	
	ИндексТрудозатраты = Результат.ВГраница();
	ИндексОценки = ИндексТрудозатраты - ПакетТрудозатраты;
		
	ЕстьОценки = НЕ Результат[ИндексОценки].Пустой();
	
	Если ТолькоНаличие Тогда
		
		Возврат ЕстьОценки;
		
	Иначе		
		
		РезультатСтруктура = Новый Структура("Оценки, Трудозатраты",
			Новый ТаблицаЗначений, Новый ТаблицаЗначений);
								
		Если ЕстьОценки Тогда			
			РезультатСтруктура.Оценки = Результат[ИндексОценки].Выгрузить();						
		КонецЕсли;
		
		// Трудозатрат может не быть, если задача полностью отдана на субподряд. 		
		Если НЕ Результат[ИндексТрудозатраты].Пустой() Тогда
			ТаблицаТрудозатрат = Результат[ИндексТрудозатраты].Выгрузить();
			
			МассивРаспределения = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(100, 
				ТаблицаТрудозатрат.ВыгрузитьКолонку("Трудозатраты"));			
			ТаблицаТрудозатрат.ЗагрузитьКолонку(МассивРаспределения, "ТрудозатратыПроцент");
										
			РезультатСтруктура.Трудозатраты = ТаблицаТрудозатрат;							
		КонецЕсли;	
						
		Возврат РезультатСтруктура;
		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти 

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоЗакрытиеЭтапа);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Возвращает текст запроса для получения подчиненных задач этапа.
//
// Параметры:
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ТекстЗадачиЭтапа()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
	               |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втПроектныеЗадачиЭтапа
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО Проекты.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |ГДЕ
	               |	Проекты.Ссылка В ИЕРАРХИИ(&Зеркало)
	               |	И НЕ Проекты.ПометкаУдаления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПроведение()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоЗакрытиеЭтапа.Ссылка КАК Регистратор,
	               |	упоЗакрытиеЭтапа.Дата КАК Дата,
				   |	упоЗакрытиеЭтапа.ДатаМодификации КАК ДатаМодификации
	               |ПОМЕСТИТЬ втДанныеШапки
	               |ИЗ
	               |	Документ.упоЗакрытиеЭтапа КАК упоЗакрытиеЭтапа
	               |ГДЕ
	               |	упоЗакрытиеЭтапа.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеШапки.Регистратор КАК Регистратор,
	               |	втДанныеШапки.ДатаМодификации КАК Период,
				   |	втПроектныеЗадачиЭтапа.Версия КАК Версия,
	               |	втПроектныеЗадачиЭтапа.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	&СтатусПроектнойЗадачи КАК СтатусЗадачи
	               |ИЗ
	               |	втДанныеШапки КАК втДанныеШапки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПроектныеЗадачиЭтапа КАК втПроектныеЗадачиЭтапа
	               |		ПО (ИСТИНА)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеШапки.Регистратор КАК Регистратор,
	               |	втДанныеШапки.ДатаМодификации КАК Период,
				   |	втПроектныеЗадачиЭтапа.Версия КАК Версия,
				   |	втПроектныеЗадачиЭтапа.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	100 КАК ПроцентГотовности
	               |ИЗ
	               |	втДанныеШапки КАК втДанныеШапки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПроектныеЗадачиЭтапа КАК втПроектныеЗадачиЭтапа
	               |		ПО (ИСТИНА)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПроведениеИспользоватьОценку()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоФактТрудозатратСводноСрезПоследних.Ресурс КАК Ресурс,
	               |	упоФактТрудозатратСводноСрезПоследних.Роль КАК Роль,
	               |	упоФактТрудозатратСводноСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втИсполнителиЗадачЭтапа
	               |ИЗ
	               |	РегистрСведений.упоФактТрудозатратСводно.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					втПроектныеЗадачиЭтапа.ПроектнаяЗадача
	               |				ИЗ
	               |					втПроектныеЗадачиЭтапа КАК втПроектныеЗадачиЭтапа)) КАК упоФактТрудозатратСводноСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоФактДвиженийДенежныхСредствСрезПоследних.Контрагент,
	               |	&РольПодрядчик,
	               |	упоФактДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоФактДвиженийДенежныхСредств.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					втПроектныеЗадачиЭтапа.ПроектнаяЗадача
	               |				ИЗ
	               |					втПроектныеЗадачиЭтапа КАК втПроектныеЗадачиЭтапа)) КАК упоФактДвиженийДенежныхСредствСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Роль,
	               |	Ресурс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеШапки.Регистратор КАК Регистратор,
	               |	втДанныеШапки.Дата КАК Период,
	               |	втИсполнителиЗадачЭтапа.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.Роль КАК Роль,
	               |	упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.ИсполнительПодрядчик КАК ИсполнительПодрядчик,
	               |	упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.Оценка КАК Оценка,
	               |	НЕ втИсполнителиЗадачЭтапа.ПроектнаяЗадача = &ПроектнаяЗадача КАК Косвенная,
	               |	упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.ЗначениеОценки КАК ЗначениеОценки,
	               |	упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.Вес КАК Вес
	               |ИЗ
	               |	втДанныеШапки КАК втДанныеШапки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоЗакрытиеЭтапа.ОценкиИсполнителейПодрядчиков КАК упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИсполнителиЗадачЭтапа КАК втИсполнителиЗадачЭтапа
	               |			ПО упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.Роль = втИсполнителиЗадачЭтапа.Роль
	               |				И упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.ИсполнительПодрядчик = втИсполнителиЗадачЭтапа.Ресурс
	               |		ПО втДанныеШапки.Регистратор = упоЗакрытиеЭтапаОценкиИсполнителейПодрядчиков.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеШапки.Регистратор КАК Регистратор,
	               |	втДанныеШапки.Дата КАК Период,
	               |	втИсполнителиЗадачЭтапа.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоЗакрытиеЭтапаТрудозатраты.Роль КАК Роль,
	               |	упоЗакрытиеЭтапаТрудозатраты.ИсполнительПодрядчик КАК Ресурс,
	               |	упоЗакрытиеЭтапаТрудозатраты.КТУ КАК КТУ
	               |ИЗ
	               |	втДанныеШапки КАК втДанныеШапки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоЗакрытиеЭтапа.Трудозатраты КАК упоЗакрытиеЭтапаТрудозатраты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИсполнителиЗадачЭтапа КАК втИсполнителиЗадачЭтапа
	               |			ПО упоЗакрытиеЭтапаТрудозатраты.Роль = втИсполнителиЗадачЭтапа.Роль
	               |				И упоЗакрытиеЭтапаТрудозатраты.ИсполнительПодрядчик = втИсполнителиЗадачЭтапа.Ресурс
	               |				И (НЕ упоЗакрытиеЭтапаТрудозатраты.Роль = &РольПодрядчик)
	               |		ПО втДанныеШапки.Регистратор = упоЗакрытиеЭтапаТрудозатраты.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

Функция ТекстЗаполнение(ТаблицыОценок, Запрос, ПакетТрудозатраты)
	
	ТекстыЗапроса = Новый Массив;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втПроектныеЗадачиЭтапа
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |		ПО Проекты.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	Проекты.Ссылка В ИЕРАРХИИ(&Зеркало)
	               |	И НЕ Проекты.ПометкаУдаления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоФактТрудозатратСводно.Ресурс КАК Ресурс,
	               |	упоФактТрудозатратСводно.Роль КАК Роль,
	               |	СУММА(упоФактТрудозатратСводно.КоличествоЧасов) КАК Трудозатраты
	               |ПОМЕСТИТЬ втИсполнителиЗадачЭтапа
	               |ИЗ
	               |	РегистрСведений.упоФактТрудозатратСводно КАК упоФактТрудозатратСводно
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПроектныеЗадачиЭтапа КАК втПроектныеЗадачиЭтапа
	               |		ПО упоФактТрудозатратСводно.ПроектнаяЗадача = втПроектныеЗадачиЭтапа.ПроектнаяЗадача
	               |			И (упоФактТрудозатратСводно.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоФактТрудозатратСводно.Ресурс,
	               |	упоФактТрудозатратСводно.Роль
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоФактДвиженийДенежныхСредствСрезПоследних.Контрагент,
	               |	&РольПодрядчик,
	               |	СУММА(упоФактДвиженийДенежныхСредствСрезПоследних.Сумма)
	               |ИЗ
	               |	РегистрСведений.упоФактДвиженийДенежныхСредств.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В
	               |				(ВЫБРАТЬ
	               |					втПроектныеЗадачиЭтапа.ПроектнаяЗадача
	               |				ИЗ
	               |					втПроектныеЗадачиЭтапа КАК втПроектныеЗадачиЭтапа)) КАК упоФактДвиженийДенежныхСредствСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоФактДвиженийДенежныхСредствСрезПоследних.Контрагент";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	Если ТаблицыОценок.Свойство("Оценки") И ТаблицыОценок.Оценки <> Неопределено Тогда
		
		ТекстЗначенияОценок = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	втИсполнителиЗадачЭтапа.Ресурс КАК ИсполнительПодрядчик,
		                      |	втИсполнителиЗадачЭтапа.Роль КАК Роль,
		                      |	упоНастройкиОценки.Оценка КАК Оценка,
		                      |	упоНастройкиОценки.Вес КАК Вес
		                      |ПОМЕСТИТЬ втТаблицаНастроек
		                      |ИЗ
		                      |	втИсполнителиЗадачЭтапа КАК втИсполнителиЗадачЭтапа
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкиОценки КАК упоНастройкиОценки
		                      |		ПО втИсполнителиЗадачЭтапа.Роль = упоНастройкиОценки.ПредметОценки
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТаблицаОценок.ИсполнительПодрядчик КАК ИсполнительПодрядчик,
		                      |	ТаблицаОценок.Роль КАК Роль,
		                      |	ТаблицаОценок.Оценка КАК Оценка,
		                      |	ТаблицаОценок.ЗначениеОценки КАК ЗначениеОценки,
		                      |	ТаблицаОценок.Вес КАК Вес
		                      |ПОМЕСТИТЬ втТаблицаОценок
		                      |ИЗ
		                      |	&ТаблицаОценок КАК ТаблицаОценок
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	втТаблицаНастроек.ИсполнительПодрядчик КАК ИсполнительПодрядчик,
		                      |	втТаблицаНастроек.Роль КАК Роль,
		                      |	втТаблицаНастроек.Оценка КАК Оценка,
		                      |	втТаблицаНастроек.Вес КАК Вес,
		                      |	ЕСТЬNULL(втТаблицаОценок.ЗначениеОценки, 0) КАК ЗначениеОценки
		                      |ИЗ
		                      |	втТаблицаНастроек КАК втТаблицаНастроек
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаОценок КАК втТаблицаОценок
		                      |		ПО втТаблицаНастроек.Роль = втТаблицаОценок.Роль
		                      |			И втТаблицаНастроек.ИсполнительПодрядчик = втТаблицаОценок.ИсполнительПодрядчик
		                      |			И втТаблицаНастроек.Оценка = втТаблицаОценок.Оценка";							
		Запрос.УстановитьПараметр("ТаблицаОценок", ТаблицыОценок.Оценки);
		
	Иначе
		
		ТекстЗначенияОценок = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	втИсполнителиЗадачЭтапа.Ресурс КАК ИсполнительПодрядчик,
		                      |	втИсполнителиЗадачЭтапа.Роль КАК Роль,
		                      |	упоНастройкиОценки.Оценка КАК Оценка,
		                      |	упоНастройкиОценки.Вес КАК Вес,
		                      |	0 КАК ЗначениеОценки
		                      |ИЗ
		                      |	втИсполнителиЗадачЭтапа КАК втИсполнителиЗадачЭтапа
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкиОценки КАК упоНастройкиОценки
		                      |		ПО втИсполнителиЗадачЭтапа.Роль = упоНастройкиОценки.ПредметОценки";		
		
	КонецЕсли;	
	
	Если ТаблицыОценок.Свойство("Трудозатраты") И ТаблицыОценок.Трудозатраты <> Неопределено Тогда
		
		ТекстТрудозатраты =  "ВЫБРАТЬ
		                     |	втИсполнителиЗадачЭтапа.Ресурс КАК ИсполнительПодрядчик,
		                     |	втИсполнителиЗадачЭтапа.Роль КАК Роль,
		                     |	втИсполнителиЗадачЭтапа.Трудозатраты КАК Трудозатраты
		                     |ПОМЕСТИТЬ втТаблицаИсполнители
		                     |ИЗ
		                     |	втИсполнителиЗадачЭтапа КАК втИсполнителиЗадачЭтапа
		                     |ГДЕ
		                     |	ТИПЗНАЧЕНИЯ(втИсполнителиЗадачЭтапа.Ресурс) = ТИП(Справочник.упоТрудовыеРесурсы)
		                     |;
		                     |
		                     |////////////////////////////////////////////////////////////////////////////////
		                     |ВЫБРАТЬ
		                     |	ТаблицаТрудозатрат.ИсполнительПодрядчик КАК ИсполнительПодрядчик,
		                     |	ТаблицаТрудозатрат.Роль КАК Роль,
		                     |	ТаблицаТрудозатрат.КТУ КАК КТУ
		                     |ПОМЕСТИТЬ втТаблицаТрудозатрат
		                     |ИЗ
		                     |	&ТаблицаТрудозатрат КАК ТаблицаТрудозатрат
		                     |;
		                     |
		                     |////////////////////////////////////////////////////////////////////////////////
		                     |ВЫБРАТЬ
		                     |	втТаблицаИсполнители.ИсполнительПодрядчик КАК ИсполнительПодрядчик,
		                     |	втТаблицаИсполнители.Роль КАК Роль,
		                     |	втТаблицаИсполнители.Трудозатраты КАК Трудозатраты,
		                     |	0 КАК ТрудозатратыПроцент,
		                     |	ЕСТЬNULL(втТаблицаТрудозатрат.КТУ, 0) КАК КТУ
		                     |ИЗ
		                     |	втТаблицаИсполнители КАК втТаблицаИсполнители
		                     |		ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаТрудозатрат КАК втТаблицаТрудозатрат
		                     |		ПО втТаблицаИсполнители.Роль = втТаблицаТрудозатрат.Роль
		                     |			И втТаблицаИсполнители.ИсполнительПодрядчик = втТаблицаТрудозатрат.ИсполнительПодрядчик";		
		ПакетТрудозатраты = 3;
		Запрос.УстановитьПараметр("ТаблицаТрудозатрат", ТаблицыОценок.Трудозатраты);
		
	Иначе
		
		ТекстТрудозатраты = "ВЫБРАТЬ
		                    |	втИсполнителиЗадачЭтапа.Ресурс КАК ИсполнительПодрядчик,
		                    |	втИсполнителиЗадачЭтапа.Роль КАК Роль,
		                    |	втИсполнителиЗадачЭтапа.Трудозатраты КАК Трудозатраты,
		                    |	0 КАК ТрудозатратыПроцент,
		                    |	0 КАК КТУ
		                    |ИЗ
		                    |	втИсполнителиЗадачЭтапа КАК втИсполнителиЗадачЭтапа
		                    |ГДЕ
		                    |	ТИПЗНАЧЕНИЯ(втИсполнителиЗадачЭтапа.Ресурс) = ТИП(Справочник.упоТрудовыеРесурсы)";
		ПакетТрудозатраты = 1;
		
	КонецЕсли;	
	
	ТекстыЗапроса.Добавить(ТекстЗначенияОценок);
	ТекстыЗапроса.Добавить(ТекстТрудозатраты);
				
	Возврат СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции	

#КонецОбласти

#КонецЕсли