
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		КонтролироватьУровеньЭтапа = Ложь;
		
		Если НЕ КонтролироватьУровеньЭтапа ИЛИ упоЗакрытиеЭтапа.ЭтоЭтапВторогоУровня(ДанныеЗаполнения) Тогда
			ПроектнаяЗадача = ДанныеЗаполнения;
			Проект = ПроектнаяЗадача.Проект;
		Иначе	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Задача не является этапом второго уровня проекта.'");
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьРазграничениеДоступа(Отказ);
	
	ПроверитьОбязательнуюОценкуИсполнителейПодрядчиков(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	упоПроведениеДокументовСервер.ПодготовитьДвиженияКРегистрации(ЭтотОбъект);
	
	ДополнительныйРезультат = Новый Структура("МассивЗадачЭтапа");
	упоПроведениеДокументовСервер.ПровестиДокумент(ЭтотОбъект, ДополнительныйРезультат);
	
	упоПроведениеДокументовСервер.АвтоматическийРасчетГотовности(ЭтотОбъект, Отказ, РежимПроведения, ДатаМодификации);
	
	упоЗакрытиеЭтапа.УдалитьИзДвиженийСтатусовИПроцентовЗакрытыеЗадачи(ЭтотОбъект, 
		ДополнительныйРезультат.МассивЗадачЭтапа);
		
	упоПроведениеДокументовСервер.РасчетФактическихДатНачалаИОкончанияПроектныхЗадач(ЭтотОбъект, Отказ, ДатаЗакрытияЭтапа);
	
	Движения.упоПроцентыГотовностиПроектныхЗадач.ДополнительныеСвойства.Вставить("упоНеПроверятьЗакрытыеЭтапы", Истина);
	Движения.упоСтатусыПроектныхЗадач.ДополнительныеСвойства.Вставить("упоНеПроверятьЗакрытыеЭтапы", Истина);
	Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.ДополнительныеСвойства.Вставить(
		"упоНеПроверятьЗакрытыеЭтапы", Истина);
	
	Движения.Записать();
	
	упоЗадания.СинхронизироватьПорученияЗадач(Проект, Неопределено);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЕстьОграничениеПраваОтменыЗакрытия() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОтключитьСтрогийКонтрольИзмененияЗакрытыхЭтапов(Движения);
	
	ОтключитьПроверкуРазграниченияДоступа();
	
	//
	
	упоПроведениеДокументовВызовСервера.обУдалитьДвиженияДокумента(Отказ, ЭтотОбъект);
	
	упоЗадания.СинхронизироватьПорученияЗадач(Проект, Неопределено);
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;    
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	Дата = ДатаМодификации;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
 
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
 
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьОграничениеПраваОтменыЗакрытия()
	
	ЕстьОграничение = Не РольДоступна("упоПравоНаОтменуЗакрытияЭтапа") И Не РольДоступна("ПолныеПрава");
	Если ЕстьОграничение Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Недостаточно прав на открытие этапа.'"));
	КонецЕсли;
	
	Возврат ЕстьОграничение;
	
КонецФункции

Процедура ОтключитьСтрогийКонтрольИзмененияЗакрытыхЭтапов(Движения)
	
	Если Не упоЗакрытиеЭтапаПовтИспСеанс.СтрогийКонтрольИзмененияЗакрытыхЭтапов() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Движение Из Движения Цикл
		Движение.ДополнительныеСвойства.Вставить("упоНеПроверятьЗакрытыеЭтапы", Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьПроверкуРазграниченияДоступа()
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
	
КонецПроцедуры

Процедура ПроверитьРазграничениеДоступа(Отказ)
	
	НеПроверятьРазграничениеДоступа = ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ЭтотОбъект.ДополнительныеСвойства.НеПроверятьРазграничениеДоступа;
	
	Если НеПроверятьРазграничениеДоступа Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);
	упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, 
		РежимЗаписиДокумента.Проведение, Отказ, Заголовок, Истина);
	
КонецПроцедуры

Процедура ПроверитьОбязательнуюОценкуИсполнителейПодрядчиков(Отказ)
	
	Если Не ПолучитьФункциональнуюОпцию("упоИспользоватьОценкуИсполнителейПодрядчиков") Тогда
		Возврат;
	КонецЕсли;
	
	ОбязательнаяОценка = Константы.упоОбязательнаяОценкаИсполнителейПодрядчиков.Получить();
	Если Не ОбязательнаяОценка Тогда
		Возврат;
	КонецЕсли;
	
	ОценкиЗаполнены = ЗначениеЗаполнено(ОценкиИсполнителейПодрядчиков);
	Если ОценкиЗаполнены Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыОценок = Новый Структура;
	ЕстьОценки = Документы.упоЗакрытиеЭтапа.ТаблицыОценокИТрудозатрат(ПроектнаяЗадача, ТаблицыОценок, Истина);
	Если ЕстьОценки = Истина Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена обязательная оценка исполнителей/подрядчиков'"); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ОценкиИсполнителейПодрядчиков", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли