
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем мСтруктураНастроек;

&НаКлиенте	
Перем ПеременныеКлиента;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдетОткрытие = Истина;
	
	Если Параметры.Свойство("СформироватьПриОткрытии") Тогда
		ФормироватьПриОткрытии = Параметры.СформироватьПриОткрытии;
	КонецЕсли;
	Если Параметры.Свойство("ФормироватьПриОткрытии") Тогда
		ФормироватьПриОткрытии = Параметры.ФормироватьПриОткрытии;
	КонецЕсли;

	ОбработкаПараметровКомандОтчетовБСП(Параметры);

	РежимРасшифровки = (Параметры.Свойство("Расшифровка") И Параметры.Расшифровка <> Неопределено);
	
	мКэш = Новый Структура;
		
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Попытка
		врИмяОтчета = ОтчетОбъект.ИмяОтчетаВМетаданных();
	Исключение
		врИмяОтчета = ОтчетОбъект.Метаданные().Имя;
	КонецПопытки;	
	
	мКэшМетаданных = Новый Структура;
	мКэшМетаданных.Вставить("ПолноеИмяОтчета", Строка(ОтчетОбъект));
	мКэшМетаданных.Вставить("ИмяОтчета", врИмяОтчета);
	мКэшМетаданных.Вставить("СинонимОтчета", ОтчетОбъект.Метаданные().Синоним);
	мКэшМетаданных.Вставить("ИмяОбъекта", ?(Найти(мКэшМетаданных.ПолноеИмяОтчета, "ВнешнийОтчет"), "ВнешнийОтчет", "Отчет"));
	
	мИмяОтчета =  мКэшМетаданных.ИмяОбъекта + "Объект." + мКэшМетаданных.ИмяОтчета;
	
	// Определение настроек отчета.
	Если Параметры.Отчет = Неопределено 
		Или ВариантыОтчетовКлиентСервер.ТипОтчетаСтрокой(Параметры.Отчет, Истина) = Неопределено Тогда		
		Информация      = ВариантыОтчетов.ИнформацияОбОтчете(ОтчетОбъект.Метаданные().ПолноеИмя());
		Параметры.Отчет = Информация.Отчет;
	КонецЕсли;
	
	ПараметрыВарианта = Новый Структура;		
	ПараметрыВарианта.Вставить("ОтчетСсылка",  Параметры.Отчет);
	ПараметрыВарианта.Вставить("Внешний",      ТипЗнч(ПараметрыВарианта.ОтчетСсылка) = Тип("Строка"));
	
	ОбновитьИнформациюОВариантеОтчета();
	
	//
	
	упоТиповыеОтчетыСервер.ИнициализироватьСКДиКомпоновщикНастроекОтчета(ОтчетОбъект, Отчет.КомпоновщикНастроек);
	ДобавитьИзменитьНастройкиПоУмолчанию(ОтчетОбъект);
	
	URLСхемы = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	// Необходима повторная инициализация компоновщика настроек после загрузки настроек по умолчанию
	// (см. метод ДобавитьИзменитьНастройкиПоУмолчанию()).
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
	
	ДобавлениеИзменениеЭлементовФормы(ОтчетОбъект);
	
	упоТиповыеОтчетыСервер.УстановитьНаФормеНастройкуПериодаПоУмолчанию(Отчет, ЭтаФорма);
			
	// Заполнение мКэш.
	ЗаполнитьСтруктуруПараметровФормы();
	
	упоТиповыеОтчетыСервер.ДобавитьКнопкуОткрытияНовогоОтчета(ЭтаФорма, Элементы.КнопкиУправленияРезультатом);
	
	УстановитьУсловноеОформлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мСтруктураНастроек = Новый Структура;
	
	мСтруктураНастроек.Вставить("Параметры");
	мСтруктураНастроек.Параметры = Новый Структура;
	мСтруктураНастроек.Параметры.Вставить("ПериодОтчета");
	
	мСтруктураНастроек.Вставить("Отбор");
	мСтруктураНастроек.Отбор = Новый Структура;
	
	//
	
	КлючУникальности = Новый УникальныйИдентификатор;
	
	упоТиповыеОтчетыКлиент.ПараметрДатаПриИзменении(ВыборТипаДаты,
		Элементы.СтраницаПроизвольныйПериод.ПодчиненныеЭлементы, НастройкиПериодаОтчета);
	
	КолонкиОтборИспользование = Элементы.Отбор.ПодчиненныеЭлементы.Найти("ОтборГруппаКолонок1");
	Если НЕ КолонкиОтборИспользование = Неопределено Тогда
		КолонкиОтборИспользование.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьПанелей();
	
	ОбновитьПериодНаФорме();
	
	Проект = Неопределено;
	ОтключитьДругиеОтборы = мКэш.Свойство("ОткрытПоСлужебнойКоманде");
	ИерархическийОтбор = мКэш.Свойство("ИерархическийОтбор") И мКэш.ИерархическийОтбор;
	Если ЗначениеЗаполнено(мКэш.ЭтапЗеркало) И ПолеДоступноДляОтбора("ПроектнаяЗадача") Тогда
		УстановитьОтборПоПолю("ПроектнаяЗадача", мКэш.ЭтапЗеркало, ОтключитьДругиеОтборы, Истина, , ИерархическийОтбор);
		Этап = Неопределено;
		Если ТипЗнч(мКэш.ЭтапЗеркало) = Тип("Массив")
			И мКэш.ЭтапЗеркало.Количество() Тогда
			Этап = мКэш.ЭтапЗеркало[0];
		ИначеЕсли ТипЗнч(мКэш.ЭтапЗеркало) = Тип("СправочникСсылка.Проекты") Тогда
			Этап = мКэш.ЭтапЗеркало;
		КонецЕсли;
		Если ЗначениеЗаполнено(Этап) Тогда
			Проект = упоФункцииБСП.ПолучитьЗначениеРеквизита(Этап, "упоКорневойПроект");
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(мКэш.Этап)
		И ЕстьПоле(Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы, "Этап") Тогда
		УстановитьОтборПоПолю("Этап", мКэш.Этап, ОтключитьДругиеОтборы, , , ИерархическийОтбор);
		Проект = упоФункцииБСП.ПолучитьЗначениеРеквизита(мКэш.Этап, "Проект");
	КонецЕсли;
	Если ЗначениеЗаполнено(мКэш.Проект) Тогда
		УстановитьОтборПоПолю("Проект", мКэш.Проект, ОтключитьДругиеОтборы, , , ИерархическийОтбор);
		Проект = мКэш.Проект;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Проект)
		И Не мКэш.ОтключитьОтборПоКомпоненту Тогда
		Если ТипЗнч(Проект) = Тип("СписокЗначений") Тогда
			МассивСсылок = Проект.ВыгрузитьЗначения();
			
			СоответствиеРезультат = ЗначениеРеквизитаОбъектов(МассивСсылок, "Компонент");
			
			ЗначениеЭлементаОтбора = Новый СписокЗначений;
			
			Для Каждого текЭл Из СоответствиеРезультат Цикл
				Если ЗначениеЭлементаОтбора.НайтиПоЗначению(текЭл.Значение) = Неопределено Тогда
					ЗначениеЭлементаОтбора.Добавить(текЭл.Значение);
				КонецЕсли;
			КонецЦикла;
		Иначе // 1 Проект
			Если ТипЗнч(Проект) = Тип("Массив") Тогда
				ЗначениеЭлементаОтбора = ПредопределенноеЗначение("Перечисление.упоКомпоненты.ПустаяСсылка");
			Иначе
				ЗначениеЭлементаОтбора = упоФункцииБСП.ПолучитьЗначениеРеквизита(Проект, "Компонент");
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначениеЭлементаОтбора) Тогда
			УстановитьОтборПоПолю("Проект.Компонент", ЗначениеЭлементаОтбора, ОтключитьДругиеОтборы, , , ИерархическийОтбор);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОтчета = Неопределено;
	Если мКэш.Свойство("ПараметрыОтчета", ПараметрыОтчета) Тогда
		Если Элементы.Найти("Актуальность") <> Неопределено И ПараметрыОтчета.Свойство("Актуальность") Тогда
			ЭтотОбъект.Актуальность = ПараметрыОтчета.Актуальность;
		КонецЕсли;
		
		Если ПараметрыОтчета.Свойство("ОтчетФормируетсяИзПанелиKPI") Тогда
			Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ОтчетФормируетсяИзПанелиKPI");
		КонецЕсли;
		
		ПараметрыДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
			НайденныйПараметр = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ПараметрОтчета.Ключ));
			Если НайденныйПараметр <> Неопределено Тогда
				мСтруктураНастроек.Параметры.Вставить(ПараметрОтчета.Ключ, ПараметрОтчета.Значение);
			КонецЕсли;
			Если ПараметрОтчета.Ключ = "ПериодОтчета"
				И ТипЗнч(ПараметрОтчета.Значение) = Тип("СтандартныйПериод") Тогда
				
				ПериодИспользование = Истина;
				ПериодЗначение = ПараметрОтчета.Значение;
				
				ЗаполнитьПользовательскуюНастройкуПериодОтчетаИзРеквизитовФормы();
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОтборыОтчета = Неопределено;
	Если мКэш.Свойство("ОтборыОтчета ", ОтборыОтчета) Тогда
		Если ТипЗнч(ОтборыОтчета) = Тип("НастройкиКомпоновкиДанных") Тогда
			упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);
			упоТиповыеОтчетыСервер.ДополнитьОтборКомпоновщика(Отчет.КомпоновщикНастроек, ОтборыОтчета);
		Иначе
			Для Каждого ОтборОтчета Из ОтборыОтчета Цикл
				мСтруктураНастроек.Отбор.Вставить(ОтборОтчета.Ключ, ОтборОтчета.Значение);
			КонецЦикла;
			упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.ВариантМодифицирован = Ложь;
	Если ФормироватьПриОткрытии Тогда
		ВывестиРезультат();
	КонецЕсли;
	
	Если ЭтаФорма.ПериодЗначение.ДатаНачала = Дата(3000, 1, 1) Тогда
		ЭтаФорма.ПериодЗначение.ДатаОкончания = Дата(1, 1, 1);
	КонецЕсли;
	
	#Если ВебКлиент Тогда
	// Отображение заголовков не работает в веб клиенте.
	Элементы.КомандаОтображатьЗаголовоки.Видимость = Ложь;
	#КонецЕсли
	
	Элементы.ОтборРежимОтображения.Видимость = Ложь;
	
	ДополнитьДанныеПоПериоду();
	
	ИдетОткрытие = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьПоле(Коллекция,ИмяПоля)
	
	ЕстьПоле = Ложь;
	искПоле = Новый ПолеКомпоновкиДанных(ИмяПоля); 
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Если ЭлементКоллекции.ЛевоеЗначение = искПоле Тогда
			ЕстьПоле = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьПоле; 
	
КонецФункции

&НаКлиенте
Функция ПолеДоступноДляОтбора(ИмяПоля)
	
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);	
	
	Возврат Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Поле) <> Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ВладелецФормы = ЭтаФорма Тогда
		
		ВыбранныеНастройки = ПолучитьНастройкиНаСервере(ВыбранноеЗначение);
		
		Если ВыбранныеНастройки <> Неопределено Тогда
			
			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ВыбранныеНастройки);
			
			ВыбранныйПериод = ВыбранныеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(
								Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
								
			Если ВыбранныйПериод <> Неопределено Тогда
									
				ПериодИспользование = ВыбранныйПериод.Использование;									
				ЗаполнитьЗначенияСвойств(ПериодЗначение, ВыбранныйПериод.Значение);
				
				ЗаполнитьПользовательскуюНастройкуПериодОтчетаИзРеквизитовФормы();

				Элементы.ВидыПериодаСтраницы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйПериод;
				ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод");
				
			КонецЕсли; 
			
		КонецЕсли;
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
			
			Если ВыбранноеЗначение.Свойство("ВариантМодифицирован")
					И ВыбранноеЗначение.ВариантМодифицирован Тогда
					
				ВариантМодифицирован = Истина;	
			
			КонецЕсли; 
			
			Если ВыбранноеЗначение.Свойство("ПользовательскиеНастройкиМодифицированы")
					И ВыбранноеЗначение.ПользовательскиеНастройкиМодифицированы Тогда
					
				ПользовательскиеНастройкиМодифицированы = Истина;	
			
			КонецЕсли;    
			
		КонецЕсли; 
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииВариантаНаСервере(Настройки)
	
	Если Настройки <> Неопределено Тогда 
		
		Если ЗначениеЗаполнено(ПериодВид) Тогда
			Настройки.ДополнительныеСвойства.Вставить("ПериодЗначение", ПериодЗначение);
			Настройки.ДополнительныеСвойства.Вставить("ПериодВид", ПериодВид);			
			Настройки.ДополнительныеСвойства.Вставить("ПериодИспользование", ПериодИспользование);			
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");   
		ОтчетОбъект.ПриСохраненииВариантаНаСервере(ЭтаФорма, Настройки);
		//РеквизитФормыВЗначение("Отчет", ОтчетОбъект);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	ОбновитьИнформациюОВариантеОтчета();
	УстановитьНавигационнуюСсылкуЗаголовок();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	Попытка
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");   
		ОтчетОбъект.ПередЗагрузкойВариантаНаСервере(ЭтаФорма, Настройки);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	ПеренестиИлиЗаполнитьПрограммныеПараметрыСКДВВарианте(Отчет.КомпоновщикНастроек.Настройки, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Если Настройки <> Неопределено Тогда
		
		ОбновитьИнформациюОВариантеОтчета();
		
		УстановитьРеквизитыФормы(Настройки);
		
		СохранятьТекущийПериодПриЗагрузкеВариантаОтчета = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСОтчетами", 
																					"упоСохранятьТекущийПериодПриЗагрузкеВариантаОтчета");
		// Опция может быть равна Неопределено, если форма персональных настроек ни разу не открывалась пользователем (начальное
		// значение в этом случае не было установлено в хранилище общих настроек).
		Если СохранятьТекущийПериодПриЗагрузкеВариантаОтчета = Неопределено Тогда
			СохранятьТекущийПериодПриЗагрузкеВариантаОтчета = Ложь;
		КонецЕсли;
		ЗагрузитьПериодИзВарианта = СохранятьТекущийПериодПриЗагрузкеВариантаОтчета = Ложь;
		
		ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
		Если ПараметрПериод <> Неопределено Тогда
			
			Если ЗагрузитьПериодИзВарианта Тогда
				ПериодЗначение = ПараметрПериод.Значение;
			КонецЕсли;
			Если ЗагрузитьПериодИзВарианта ИЛИ ИдетОткрытие Тогда
				ПериодИспользование = ПараметрПериод.Использование;	
			КонецЕсли;
			
		КонецЕсли;			
		
		Если ЗагрузитьПериодИзВарианта И Настройки.ДополнительныеСвойства.Свойство("ДатаНачала") Тогда
			
			ПериодВид = Перечисления.ДоступныеПериодыОтчета.ПроизвольныйПериод;
			ПериодЗначение.ДатаНачала = Настройки.ДополнительныеСвойства.ДатаНачала;
			ПериодЗначение.ДатаОкончания = Настройки.ДополнительныеСвойства.ДатаОкончания;
			
		КонецЕсли;
		
		Если Настройки.ДополнительныеСвойства.Свойство("ПериодВид")
			И ТипЗнч(Настройки.ДополнительныеСвойства.ПериодВид) = Тип("ПеречислениеСсылка.ДоступныеПериодыОтчета") Тогда
			
			Если ЗагрузитьПериодИзВарианта Тогда
				ПериодВид = Настройки.ДополнительныеСвойства.ПериодВид;
				ПериодЗначение = Настройки.ДополнительныеСвойства.ПериодЗначение;
			КонецЕсли;
			Если ЗагрузитьПериодИзВарианта ИЛИ ИдетОткрытие Тогда
				ПериодИспользование = Настройки.ДополнительныеСвойства.ПериодИспользование;
			КонецЕсли;
			
		КонецЕсли;			
		
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыВарианта) = Тип("Структура") И ЭтоПредопределенныйВариант Тогда		
		упоТиповыеОтчетыСервер.ДобавитьДополнительныеНастройкиВКомпоновщик(Отчет.КомпоновщикНастроек, НастройкиОбъекта);				
	КонецЕсли;
	
	// Если установлен фиксированный отбор, убираем соответствующие поля из отбора на форме.
	ПроверитьФиксированныйОтбор();
	
	упоТиповыеОтчетыСервер.ЗагрузитьНастройкиКомпоновщикаВФормуОтчета(Параметры, ЭтотОбъект, Отчет);
	
	ПеренестиПоляСроковВДополнительнуюИнформацию();
	
	ПереключитьПериодИЕгоПредставление(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	// Для предопределенного варианта перезаполняем выбранные пользовательские настройки из настроек варианта.
	// см.упоТиповыеОтчетыСервер.ПеренестиЗначениеПараметрДанныхВПользовательскиеНастройки().
	ПредзаполненныеНастройки = Неопределено;
	Если ЭтоПредопределенныйВариант 
		И Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство(
			"НеЗагружатьПользовательскиеНастройкиДляЭлементов", ПредзаполненныеНастройки) Тогда
		
		Для Каждого КлючЗначение Из ПредзаполненныеНастройки Цикл 
			
			НастройкаВарианта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КлючЗначение.Ключ);
			НастройкаПользователя = Настройки.Элементы.Найти(КлючЗначение.Ключ);			
			Если НастройкаВарианта <> Неопределено И НастройкаПользователя <> Неопределено Тогда							
				ЗаполнитьЗначенияСвойств(НастройкаПользователя, НастройкаВарианта, "Использование, Значение");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
	
	ПараметрПериодОтчета = ОтчетыКлиентСервер.НайтиПараметр(Неопределено, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодОтчета");
	Если ПараметрПериодОтчета <> Неопределено Тогда
		
		ПериодИспользование = ПараметрПериодОтчета.Использование;
        ЗаполнитьЗначенияСвойств(ПериодЗначение, ПараметрПериодОтчета.Значение);
		
		//
		
		ПериодПредставлениеИмя  = "ПериодПредставление";
		
		Представление = упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(ПериодЗначение, ПериодВид);
		ЭтаФорма[ПериодПредставлениеИмя] = Представление;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
	ПодключитьОбработчикОжидания("Подключаемый_РассчитатьСуммуЯчеек", ИнтервалОжидания, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если упоРаботаСОчередямиКлиент.ОткрытьОтчетПоОчередиПоРасшифровкеОтчета(Расшифровка, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
		                                    		
	Если НЕ ЭтоАдресВременногоХранилища(АдресДанныхРасшифровки) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(АдресДанныхРасшифровки,
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
	
	ДоступныеДействия = Новый Массив;
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);               
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);               
	
	Контекст = Новый Структура;
	Контекст.Вставить("Расшифровка",Расшифровка);
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатОбработкаРасшифровкиЗавершение",ЭтотОбъект,Контекст);
	
	ОбработкаРасшифровки.ПоказатьВыборДействия(ОписаниеОповещения,Расшифровка,ДоступныеДействия);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказатели

&НаКлиенте
Процедура ПоказателиПриИзменении(Элемент)
	
	ОбновитьПериодНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиИспользованиеПриИзменении(Элемент)
	
	ИзмененныйЭлемент = 
		Отчет.КомпоновщикНастроек.Настройки.Выбор.ПолучитьОбъектПоИдентификатору(Элемент.Родитель.ТекущаяСтрока);
		
	Если ТипЗнч(ИзмененныйЭлемент) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
		
		НовоеЗначение = ИзмененныйЭлемент.Использование;
		УстановитьФлажкиВПолях(НовоеЗначение, ИзмененныйЭлемент.Элементы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте	
Процедура УстановитьФлажкиВПолях(НовоеЗначение, ЭлементыВыбранныхПолей)
	
	Для Каждого ЭлементКУстановке Из ЭлементыВыбранныхПолей Цикл
		
		ЭлементКУстановке.Использование = НовоеЗначение;
		
		Если ТипЗнч(ЭлементКУстановке) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			
			   УстановитьФлажкиВПолях(НовоеЗначение, ЭлементКУстановке.Элементы);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроек

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ИмяЭлементаПоляГруппировки = "ЭлементПоляГруппировки";
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные[ИмяЭлементаПоляГруппировки] <> Неопределено Тогда
		ПоляГруппировки = ТекущиеДанные[ИмяЭлементаПоляГруппировки].Элементы;
		Если ПоляГруппировки.Количество() > 0 Тогда
			ПриИзмененииСоставаГруппировок(ПоляГруппировки[0].Поле);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.СтруктураОтчета = "Таблица" Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекПользовательскиеНастройкиПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.Имя <> "КомпоновщикНастроекПользовательскиеНастройки" Тогда
		Возврат;
	КонецЕсли;	
	
	ТекЭлемент = Элементы.КомпоновщикНастроекПользовательскиеНастройки.ТекущийЭлемент;
	Если ТекЭлемент.Имя <> "КомпоновщикНастроекПользовательскиеНастройкиЗначение" Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанные = Элементы.КомпоновщикНастроекПользовательскиеНастройки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекДанные.Значение) = Тип("ДокументСсылка.упоВерсияПланаПроекта")
		Или ТипЗнч(ТекДанные.Значение) = Тип("ДокументСсылка.упоУтверждениеПланаПроекта") Тогда
		
		Элементы.КомпоновщикНастроекПользовательскиеНастройкиЗначение.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтображатьЗаголовоки(Команда)
	
	ОтображатьЗаголовки = Элементы.КомандаОтображатьЗаголовоки.Пометка; 
	
	ОтображатьЗаголовки = Не ОтображатьЗаголовки;
	
	Элементы.КомандаОтображатьЗаголовоки.Пометка = ОтображатьЗаголовки;	
	Элементы.Результат.ОтображатьЗаголовки = ОтображатьЗаголовки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьСумму(Команда)
	
	// Кнопка "сумма" как в отчетах УНФ.
	СуммаВыделенныхЯчеек = ВычислитьСуммуСервер(Результат, ВыделенныеОбласти());
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки(Команда)
	мСкрыватьНастройки = Не мСкрыватьНастройки;
	Элементы.СкрытьНастройки.Пометка = Не мСкрыватьНастройки;
	УпоТиповыеОтчетыКлиент.СкрытьЭлементУправления(ЭтаФорма,ЭтаФорма.Элементы.ГруппаНастройки);	
КонецПроцедуры

&НаКлиенте
Процедура СкомпоноватьРезультатПоНовымНастройкам(Команда)
	
	ОчиститьСообщения();
	
	// Исторически неустановленный параметр "ПериодОтчета" в наших отчетах не поддерживается, 
	// поэтому устанавливаем фиктивный параметр "от начала существования до 3000 года", а затем восстанавливаем параметры.
	ПараметрПериодОтчета = ОтчетыКлиентСервер.НайтиПараметр(Неопределено, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодОтчета");
	Если ПараметрПериодОтчета <> Неопределено И Не ПериодИспользование Тогда  
		ПараметрПериодОтчета.Использование = Истина;
		ЗаполнитьЗначенияСвойств(ПараметрПериодОтчета.Значение, Новый СтандартныйПериод('00010101', '30000101235959'));
	КонецЕсли;
	
	НастройкиКомпоновкиДанных = Отчет.КомпоновщикНастроек.Настройки;
	ВыводитьСообщениеОКонфликтеНастроекОтбора = Истина;
	ПроверитьОдновременноеИспользованиеОтбораНаПроектИПроектнуюЗадачу(НастройкиКомпоновкиДанных,
		ВыводитьСообщениеОКонфликтеНастроекОтбора);
	
	ВывестиРезультат();
	
	// Выключим отображение состояния на время восстановления пользовательской настройки периода,
	// чтобы не появился запрос на переформирование отчета.
	ЭтаФорма.АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.НеОтображать;  
	
	ЗаполнитьПользовательскуюНастройкуПериодОтчетаИзРеквизитовФормы();
	
	ЭтаФорма.АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.Авто;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПользовательскуюНастройкуПериодОтчетаИзРеквизитовФормы()
	
	ПараметрПериодОтчета = ОтчетыКлиентСервер.НайтиПараметр(Неопределено, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки, "ПериодОтчета");
	Если ПараметрПериодОтчета <> Неопределено Тогда  
		ПараметрПериодОтчета.Использование = ПериодИспользование;
		ЗаполнитьЗначенияСвойств(ПараметрПериодОтчета.Значение, ПериодЗначение);
	КонецЕсли;                                                                    

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуОтчета(Команда)
	
	ОткрытьСправку(СтрЗаменить(мИмяОтчета, "Объект", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВариантОтчета(Команда)
	
	ПараметрПериодОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	Если ПараметрПериодОтчета <> Неопределено 
			И Не ЗначениеЗаполнено(ПараметрПериодОтчета.ИдентификаторПользовательскойНастройки) Тогда
			
		Если ПараметрПериодОтчета.Использование <> ПериодИспользование Тогда
			ПараметрПериодОтчета.Использование = ПериодИспользование;			
		КонецЕсли;
		Если ПараметрПериодОтчета.Значение <> ПериодЗначение Тогда
			ЗаполнитьЗначенияСвойств(ПараметрПериодОтчета.Значение, ПериодЗначение);		
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Вариант",                               Отчет.КомпоновщикНастроек.Настройки);
	ПараметрыФормы.Вставить("КлючВарианта",                          Строка(КлючТекущегоВарианта));
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",             Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("ПредставлениеВарианта",                 Строка(НаименованиеТекущегоВарианта));
	ПараметрыФормы.Вставить("ПредставлениеПользовательскихНастроек", "");
	НастройкиОтчета = Новый Структура;
	НастройкиОтчета.Вставить("СхемаМодифицирована",				 	 Истина);
	НастройкиОтчета.Вставить("АдресСхемы",							 URLСхемы);
	ПараметрыФормы.Вставить("НастройкиОтчета",                       НастройкиОтчета);
	
	ОткрытьФорму(мКэшМетаданных.ИмяОбъекта + "." + мКэшМетаданных.ИмяОтчета + ".ФормаВарианта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьНовыйОтчет(Команда)
			
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЕстьОткрытиеНовогоОтчета", Истина);
	ПараметрыФормы.Вставить("НастройкиКомпоновщика", упоТиповыеОтчетыСервер.СохранитьНастройкиКомпоновщика(Отчет.КомпоновщикНастроек));
	ПараметрыФормы.Вставить("НастройкиДопКомпоновщика", Неопределено);
	Если ПериодИспользование Тогда
		ПараметрыФормы.Вставить("ПериодИспользование", ПериодИспользование);
		ПараметрыФормы.Вставить("ПериодВид", ПериодВид);
		ПараметрыФормы.Вставить("ПериодЗначение", ПериодЗначение);
	КонецЕсли;
			
	ОткрытьФорму(мКэшМетаданных.ИмяОбъекта + "." + мКэшМетаданных.ИмяОтчета + ".Форма", ПараметрыФормы, , Новый УникальныйИдентификатор);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытий(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено,
	П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.ОбработчикСобытийФормы(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ИдентификаторОтчета", мКэшМетаданных.ИмяОтчета);
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыОтчета.Вставить("НастройкиОбъекта", НастройкиОбъекта);
	
	ИБФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	Если мКэшМетаданных.ИмяОбъекта = "ВнешнийОтчет" Тогда
		ЭтаФорма.СкомпоноватьРезультат();
		
		Если Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("АдресДанныхРасшифровки") Тогда
			АдресДанныхРасшифровки = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.АдресДанныхРасшифровки;
		КонецЕсли;
		
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	ИдентификаторЗадания = Неопределено;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"упоТиповыеОтчетыСервер.СформироватьОтчет",
			ПараметрыОтчета);
		
	АдресХранилища = РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			ЗагрузитьПодготовленныеДанные();
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат         = РезультатВыполнения.Результат;
	ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;
	АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, УникальныйИдентификатор);
	
	ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры

&НаСервере
Процедура ДобавлениеИзменениеЭлементовФормы(ОтчетОбъект)
	
	// Кнопка задается программно, т. к. без режима совместимости она автоматически не появляется
	// и при обновлении PMO кнопка пропадает.
	Попытка
		ОтчетОбъект.ДобавлениеДопНастроекНаФорму(ЭтаФорма);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;	
	
КонецПроцедуры

// Удаляет элемент отбора из настроек компоновщика, если для этого поля установлен фиксированный отбор.
&НаСервере
Процедура ПроверитьФиксированныйОтбор()
	
	ФиксированныйОтбор = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	Отбор =  Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	МассивЭлементовДляУдаления = Новый Массив;
	
	Для каждого ЭлементФиксированногоОтбора Из ФиксированныйОтбор Цикл
		Если ЭлементФиксированногоОтбора.Использование Тогда
			Для Каждого ЭлементОтбора Из Отбор Цикл
				Если ЭлементОтбора.ЛевоеЗначение = ЭлементФиксированногоОтбора.ЛевоеЗначение Тогда
					МассивЭлементовДляУдаления.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 	
	КонецЦикла;
	
	Для каждого ЭлементОтбора Из МассивЭлементовДляУдаления Цикл	
		Отбор.Удалить(ЭлементОтбора); 	
	КонецЦикла;
	
КонецПроцедуры

// Заполняет структуру мКэш.
&НаСервере
Процедура ЗаполнитьСтруктуруПараметровФормы()
	
	НуженОтборПоПроекту = Истина;
	Если Параметры.Свойство("ОтключитьОтборПоПроекту") Тогда
		НуженОтборПоПроекту = НЕ Параметры.ОтключитьОтборПоПроекту;	
	КонецЕсли;
	
	Если НуженОтборПоПроекту И Параметры.Свойство("Проект") И ЗначениеЗаполнено(Параметры.Проект) Тогда
		мКэш.Вставить("Проект", Параметры.Проект);
	Иначе
		мКэш.Вставить("Проект", Неопределено);
	КонецЕсли;
	
	НуженОтборПоЭтапу = Истина;
	Если Параметры.Свойство("ОтключитьОтборПоЭтапу") Тогда
		НуженОтборПоЭтапу = НЕ Параметры.ОтключитьОтборПоЭтапу;	
	КонецЕсли;
	
	Если НуженОтборПоЭтапу И Параметры.Свойство("Этап") Тогда 
		мКэш.Вставить("Этап", Параметры.Этап);
		ЭтапыЗеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(Параметры.Этап);
		мКэш.Вставить("ЭтапЗеркало", ЭтапыЗеркало);		
	Иначе 
		мКэш.Вставить("Этап", Неопределено);		
		мКэш.Вставить("ЭтапЗеркало", Неопределено);
	КонецЕсли;
	
	Если Параметры.Свойство("ОткрытПоСлужебнойКоманде") Тогда
		мКэш.Вставить("ОткрытПоСлужебнойКоманде", Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрыОтчета") Тогда
		мКэш.Вставить("ПараметрыОтчета", Параметры.ПараметрыОтчета);
	КонецЕсли; 
	
	мКэш.Вставить("ОтключитьОтборПоКомпоненту", Параметры.ОтключитьОтборПоКомпоненту);
	
	Если Параметры.Свойство("ИерархическийОтбор") Тогда
		мКэш.Вставить("ИерархическийОтбор", Параметры.ИерархическийОтбор);
	КонецЕсли;

    Если Параметры.Свойство("ОтборыОтчета") Тогда
		мКэш.Вставить("ОтборыОтчета", Параметры.ОтборыОтчета);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПериодНаФорме()
	
	Если ПериодИспользование И ЗначениеЗаполнено(ПериодЗначение.ДатаОкончания) Тогда
		мСтруктураНастроек.Параметры.ПериодОтчета = ПериодЗначение;
	Иначе
		СтандартныйПериод = Новый СтандартныйПериод;
		Если ПериодИспользование Тогда
			СтандартныйПериод.ДатаНачала = ПериодЗначение.ДатаНачала;
		КонецЕсли;
		СтандартныйПериод.ДатаОкончания = Дата(3000, 1, 1);
		мСтруктураНастроек.Параметры.ПериодОтчета = СтандартныйПериод;
	КонецЕсли;
	
КонецПроцедуры

// Выводит результат компоновки в соответствии с выбранным режимом.
//
// Параметры:
//  РежимКомпоновки	 - РежимКомпоновкиРезультата - режим формирования результата.
//
&НаКлиенте
Процедура ВывестиРезультат(РежимКомпоновки	= Неопределено) Экспорт
	
	// Установка параметра ПериодОтчета.
	ОбновитьПериодНаФорме();
	
	Если РежимКомпоновки = Неопределено Тогда
		РежимКомпоновки = РежимКомпоновкиРезультата.Непосредственно;
	КонецЕсли;
	
	ВариантИзменен = ЭтаФорма.ВариантМодифицирован;
	
	НастройкиКомпоновкиДанных = Отчет.КомпоновщикНастроек.Настройки;
	
	Для Каждого Элемент Из Элементы.ГруппаРеквизитовОбъектаОтчета.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			НастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
		КонецЕсли;
		
	КонецЦикла;
	
	Если РеквизитыВДопНастройки <> Неопределено Тогда
		Для Каждого ЭлементРеквизит Из РеквизитыВДопНастройки Цикл
			ИмяРеквизита = ЭлементРеквизит.Значение;
			НастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить(ИмяРеквизита, ЭтаФорма[ИмяРеквизита]);	
		КонецЦикла;
	КонецЕсли;
		
	НастройкиКомпоновкиДанных.ДополнительныеСвойства.Вставить("УникальныйИдентификаторФормы",
		ЭтаФорма.УникальныйИдентификатор);
	ЭтаФорма.ВариантМодифицирован = ВариантИзменен;
	
	// Фоновое формирование.
	
	ЭтаФорма.ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ЭтаФорма.ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
		
	Если Элементы.ГруппаНастройки.Видимость И мСкрыватьНастройкиПриФормированииОтчета Тогда
		СкрытьНастройки(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает отбор по проекту.
//
// Параметры:
//  ИмяПоля					 - Строка - Имя поля отбора.
//  ЗначениеПоля			 - Произвольный - значение поля отбора.
//  ОтключитьДругиеОтборы	 - Булево - признак необходимости отключить другие отборы.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
&НаКлиенте
Функция УстановитьОтборПоПолю(ИмяПоля, ЗначениеПоля, ОтключитьДругиеОтборы = Ложь, ДобавитьНовый = Ложь,
	РодительскоеПоле = Неопределено, ИерархическийОтбор = Ложь)
	
	ОтборУстановлен = упоФункцииОбщегоНазначенияКлиентСервер.УстановитьОтборПоПолюКомпоновки(Отчет.КомпоновщикНастроек, ИмяПоля,
		ЗначениеПоля, ОтключитьДругиеОтборы, ДобавитьНовый, РодительскоеПоле, ИерархическийОтбор);
		
	// Отключение других отборов должно происходить однократно, иначе каждый последующий отбор будет отключать предыдущие.	
	Если ОтключитьДругиеОтборы И ОтборУстановлен Тогда
		ОтключитьДругиеОтборы = Ложь;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьПанелей()
	
	Элементы.ГруппаНастройки.Видимость = Не мСкрыватьНастройки;
	Элементы.СкрытьНастройки.Пометка = Не мСкрыватьНастройки;
	
КонецПроцедуры 

&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение(ВыполненноеДействие,ПараметрВыполненногоДействия,ДополнительныеПараметры) Экспорт
	
	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		
		ПоказатьЗначение(,ПараметрВыполненногоДействия);
		
	ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать
		ИЛИ ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
		
		Настройки = ПолучитьНастройкиДляРасшифровки(ДополнительныеПараметры.Расшифровка, АдресДанныхРасшифровки, ПараметрВыполненногоДействия);
				
		Если Настройки <> Неопределено Тогда
						
			врИмяОтчета = мКэшМетаданных.ИмяОтчета;
			
			// Необходимо отключить отбор для скрытия дублей элементов иерархии в отчете упоСрокиПроектаПланФактСКД,
			// чтобы избежать ошибки "Выражение не может быть вычислено "LevelInGroup"".
			Если врИмяОтчета = "упоСрокиПроектаПланФактСКД" Тогда
				ИмяНастройкиОтбораДляПоиска = "Не выводить элемент иерархии в подчиненных";
				НастройкиОтбора = Настройки.Отбор.Элементы;
				Для Каждого Отбор Из НастройкиОтбора Цикл
					Если Отбор.Представление = ИмяНастройкиОтбораДляПоиска Тогда
						Отбор.Использование = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ПроверитьОдновременноеИспользованиеОтбораНаПроектИПроектнуюЗадачу(Настройки);
			
			ПараметрыФормы = Новый Структура("КлючВарианта, Расшифровка", КлючТекущегоВарианта, Истина);			
			врФорма = ПолучитьФорму(мКэшМетаданных.ИмяОбъекта + "." + врИмяОтчета + ".Форма", ПараметрыФормы, , Истина);
			
			врОтчет = врФорма.Отчет;
			врОтчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);		
			
			Если ПериодИспользование Тогда
				врФорма.ПериодИспользование = ПериодИспользование;
				врФорма.ПериодВид = ПериодВид;
				врФорма.ПериодЗначение = ПериодЗначение;
				
				врФорма.ПериодПредставление = 
					упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(ПериодЗначение, ПериодВид);
			КонецЕсли;
				
			врФорма.Открыть();     

			Если врФорма.ИмяФормы = "ОбщаяФорма.упоФормаОтчета" Тогда
			    врФорма.ВывестиРезультат();
			ИначеЕсли ТипЗнч(врФорма) = Тип("УправляемаяФорма") Тогда
				врОтчет.СкомпоноватьРезультат(врФорма.Элементы.Результат, врФорма.АдресДанныхРасшифровки);				
			Иначе
				врОтчет.СкомпоноватьРезультат(врФорма.ЭлементыФормы.Результат, врФорма.ДанныеРасшифровки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиДляРасшифровки(Расшифровка, АдресРасшифровки, ПараметрВыполненногоДействия)

	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(АдресРасшифровки,
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
	
	Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка, ПараметрВыполненногоДействия);
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииСоставаГруппировок(ПолеКомпоновки)
	
	Если ТипЗнч(ПолеКомпоновки) <> Тип("ПолеКомпоновкиДанных") Тогда 
		Возврат;
	КонецЕсли;
		
	ЭлементыПорядка = Отчет.КомпоновщикНастроек.Настройки.Порядок.Элементы;
	
	Для каждого ЭлементПорядка Из ЭлементыПорядка Цикл
		Если ТипЗнч(ЭлементПорядка) = Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементПорядка.Поле = ПолеКомпоновки Тогда
			Возврат;	
		КонецЕсли;  		      	
	КонецЦикла;
	
	НовыйЭлемент = ЭлементыПорядка.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйЭлемент.Поле = ПолеКомпоновки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиНаСервере(КомпоновщикНастроек)
	
	Настройки = Неопределено;
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Возврат КомпоновщикНастроек.ПолучитьНастройки();
	ИначеЕсли ТипЗнч(КомпоновщикНастроек) = Тип("Структура")
		И КомпоновщикНастроек.Свойство("ВариантМодифицирован")
		И КомпоновщикНастроек.ВариантМодифицирован Тогда 
		Возврат КомпоновщикНастроек.КомпоновщикНастроекКД.Настройки;
	КонецЕсли; 
	
КонецФункции 

&НаСервереБезКонтекста
Функция ВычислитьСуммуСервер(Знач ОтчетТабличныйДокумент, Знач ВыделенныеОбласти)
	
	// Кнопка "сумма" как в отчетах УНФ.
	Сумма = РассчитатьСуммуВыделенныхЯчеек(ОтчетТабличныйДокумент, ВыделенныеОбласти);
	
	Возврат Формат(Сумма, "ЧН=0");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьСуммуВыделенныхЯчеек(ТабличныйДокумент, ВыделенныеОбласти)
	
	// Кнопка "сумма" как в отчетах УНФ.
#Если Клиент Тогда
	ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
#КонецЕсли
	
#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
	КоличествоВыделенныхОбластей = ВыделенныеОбласти.Количество();
	Если КоличествоВыделенныхОбластей = 0 Тогда
		Возврат 0;
	ИначеЕсли КоличествоВыделенныхОбластей >= 100 Тогда
		Возврат Неопределено; // Нужен вызов сервера.
	КонецЕсли;
	КоличествоВыделенныхЯчеек = 0;
#КонецЕсли
	
	Сумма = 0;
	ПроверенныеЯчейки = Новый Соответствие;
	
	Для Каждого ВыделеннаяОбласть Из ВыделенныеОбласти Цикл
#Если Клиент Тогда
		Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
#КонецЕсли
		
		ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Верх;
		ВыделеннаяОбластьНиз = ВыделеннаяОбласть.Низ;
		ВыделеннаяОбластьЛево = ВыделеннаяОбласть.Лево;
		ВыделеннаяОбластьПраво = ВыделеннаяОбласть.Право;
		
		Если ВыделеннаяОбластьВерх = 0 Тогда
			ВыделеннаяОбластьВерх = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьНиз = 0 Тогда
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбластьЛево = 0 Тогда
			ВыделеннаяОбластьЛево = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьПраво = 0 Тогда
			ВыделеннаяОбластьПраво = ТабличныйДокумент.ШиринаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
			ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Низ;
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		ВыделеннаяОбластьВысота = ВыделеннаяОбластьНиз   - ВыделеннаяОбластьВерх;
		ВыделеннаяОбластьШирина = ВыделеннаяОбластьПраво - ВыделеннаяОбластьЛево;
		
#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
		КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек + ВыделеннаяОбластьШирина * ВыделеннаяОбластьВысота;
		Если КоличествоВыделенныхЯчеек >= 1000 Тогда
			Возврат Неопределено; // Нужен вызов сервера.
		КонецЕсли;
#КонецЕсли
		
		Для НомерКолонки = ВыделеннаяОбластьЛево По ВыделеннаяОбластьПраво Цикл
			Для НомерСтроки = ВыделеннаяОбластьВерх По ВыделеннаяОбластьНиз Цикл
				
				// Если в выделение попало поле группировки колонок - не обрабатываем.
				Если НомерСтроки = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
					ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
				Иначе
					Продолжить;
				КонецЕсли;
								
				Если Ячейка.Видимость = Истина Тогда
					Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
						Сумма = Сумма + Ячейка.Значение;
					ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
						Сумма = Сумма + СтрокаВЧисло(Ячейка.Текст);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаВЧисло(ИсходнаяСтрока)
	
	// Кнопка "сумма" как в отчетах УНФ.
	// Превращает строку в число без вызова исключений. Стандартная функция преобразования
	// Число() строго контролирует отсутствие каких-либо символов кроме числовых.
	
	Результат = 0;
	ЗнаковПослеЗапятой = -1;
	ЗнакОтрицательный = Ложь;
	Для НомерСимвола = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		КодСимвола = КодСимвола(ИсходнаяСтрока, НомерСимвола);
		Если КодСимвола = 32 Или КодСимвола = 160 Тогда // Пробел или неразрывный пробел.
			// Пропуск (действие не требуется).
		ИначеЕсли КодСимвола = 45 Тогда // Минус.
			Если Результат <> 0 Тогда
				Возврат 0;
			КонецЕсли;
			ЗнакОтрицательный = Истина;
		ИначеЕсли КодСимвола = 44 Или КодСимвола = 46 Тогда // Запятая или точка.
			ЗнаковПослеЗапятой = 0; // Запуск отсчета знаков после запятой.
		ИначеЕсли КодСимвола > 47 И КодСимвола < 58 Тогда // Число.
			Если ЗнаковПослеЗапятой <> -1 Тогда
				ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
			КонецЕсли;
			Число = КодСимвола - 48;
			Результат = Результат * 10 + Число;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗнаковПослеЗапятой > 0 Тогда
		Результат = Результат / Pow(10, ЗнаковПослеЗапятой);
	КонецЕсли;
	Если ЗнакОтрицательный Тогда
		Результат = -Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыделенныеОбласти()
	
	// Кнопка "сумма" как в отчетах УНФ.
	масРезультат = Новый Массив;
	Для Каждого ВыделеннаяОбласть Из Результат.ВыделенныеОбласти Цикл
		Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		Структура = Новый Структура("Верх, Низ, Лево, Право, ТипОбласти");
		ЗаполнитьЗначенияСвойств(Структура, ВыделеннаяОбласть);
		масРезультат.Добавить(Структура);
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_РассчитатьСуммуЯчеек()
	
	// Кнопка "сумма" как в отчетах УНФ.
	Сумма = РассчитатьСуммуВыделенныхЯчеек(Результат, Неопределено);
	Если ТипЗнч(Сумма) = Тип("Число") Тогда
		СуммаВыделенныхЯчеек = Формат(Сумма, "ЧН=0");
	Иначе
		СуммаВыделенныхЯчеек = "-";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитыФормы(Настройки)
	
	Если НастройкиОбъекта.Свойство("ВыборВерсии") Тогда
		
		КоличествоВерсий = НастройкиОбъекта.ВыборВерсии.КоличествоВерсий;
		
		Для НомерВерсии = 1 По КоличествоВерсий Цикл
			ИмяЭлемента = "Версия" + Строка(НомерВерсии);
			
			ЗначениеПараметраВерсия = Настройки.ПараметрыДанных.Элементы.Найти(ИмяЭлемента);
			ЭлементФормыВерсия 		= Элементы.Найти(ИмяЭлемента);
			
			Если НЕ (ЗначениеПараметраВерсия = Неопределено Или ЭлементФормыВерсия = Неопределено) Тогда 
				ЭтаФорма[ИмяЭлемента] = ЗначениеПараметраВерсия.Значение;
				Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(ЭлементФормыВерсия), ЭлементФормыВерсия.Имя);	
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	УстановитьНавигационнуюСсылкуЗаголовок();

КонецПроцедуры

&НаСервере
Процедура УстановитьНавигационнуюСсылкуЗаголовок()
	
	НаименованиеТекущегоВарианта = СокрЛП(НаименованиеТекущегоВарианта);
	
	Если ЗначениеЗаполнено(НаименованиеТекущегоВарианта) Тогда
		Заголовок = НаименованиеТекущегоВарианта;
	КонецЕсли;
	
	Если РежимРасшифровки Тогда
		Заголовок = Заголовок + " (" + НСтр("ru = 'Расшифровка'") + ")";
	КонецЕсли;
	
	НавигационнаяСсылка = "";
	Если ЗначениеЗаполнено(ПараметрыВарианта.ВариантСсылка)
		И Не ПараметрыВарианта.Внешний Тогда
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ПараметрыВарианта.ВариантСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОВариантеОтчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВариантыОтчетов.Ссылка КАК ВариантСсылка,
	|	ВариантыОтчетов.ПредопределенныйВариант.КлючЗамеров КАК КлючЗамеров,
	|	ВариантыОтчетов.ПредопределенныйВариант КАК ПредопределенныйСсылка,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.Пользовательский
	|				ИЛИ ВариантыОтчетов.Родитель.КлючВарианта ЕСТЬ NULL 
	|			ТОГДА ВариантыОтчетов.КлючВарианта
	|		ИНАЧЕ ВариантыОтчетов.Родитель.КлючВарианта
	|	КОНЕЦ КАК ИмяИсходногоВарианта,
	|	ВариантыОтчетов.Пользовательский КАК Пользовательский
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет = &Отчет
	|	И ВариантыОтчетов.КлючВарианта = &КлючВарианта";
	Запрос.УстановитьПараметр("Отчет", ПараметрыВарианта.ОтчетСсылка);
	Запрос.УстановитьПараметр("КлючВарианта", КлючТекущегоВарианта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПараметрыВарианта.Вставить("ВариантСсылка",          Выборка.ВариантСсылка);
		ПараметрыВарианта.Вставить("КлючЗамеров",            Выборка.КлючЗамеров);
		ПараметрыВарианта.Вставить("ПредопределенныйСсылка", Выборка.ПредопределенныйСсылка);
		ПараметрыВарианта.Вставить("ИмяИсходногоВарианта",   ?(Выборка.Пользовательский, Выборка.ИмяИсходногоВарианта, КлючТекущегоВарианта));
		ПараметрыВарианта.Вставить("Пользовательский",       Выборка.Пользовательский);
	Иначе
		ПараметрыВарианта.Вставить("ВариантСсылка",          Неопределено);
		ПараметрыВарианта.Вставить("КлючЗамеров",            Неопределено);
		ПараметрыВарианта.Вставить("ПредопределенныйСсылка", Неопределено);
		ПараметрыВарианта.Вставить("ИмяИсходногоВарианта",   Неопределено);
		ПараметрыВарианта.Вставить("Пользовательский",       Неопределено);
	КонецЕсли;
	
	ЭтоПредопределенныйВариант = ЗначениеЗаполнено(ПараметрыВарианта.ПредопределенныйСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПараметровКомандОтчетовБСП(Параметры)
	
	Если Не Параметры.Свойство("ПараметрКоманды") Тогда
		Возврат;
	КонецЕсли;
		
	Если Параметры.ОписаниеКоманды.ДополнительныеПараметры.ИмяКоманды = "упоРезультатРаспределения" Тогда    
		Параметры.Отбор.Вставить("РаспределениеРасходовПоПроектамФакт", Параметры.ПараметрКоманды)
	КонецЕсли;
	
КонецПроцедуры

#Область ПодключаемыеВыборВерсии

&НаКлиенте
Процедура Подключаемый_ВыборВерсии_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.упоВерсияПланаПроекта.ФормаВыбора",,Элемент);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборВерсии_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Массив = Новый Массив;
	Массив.Добавить(ВыбранноеЗначение);
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(Массив);
	
	Представление = упоВерсионирование.ПолучитьНаименованиеВерсии(ВыбранноеЗначение);
	Для Каждого ЭлементКоллекции Из Элемент.СписокВыбора Цикл
		ЭлементКоллекции.Представление = Представление;
	КонецЦикла;
	
	ИзменитьОтображениеСостояния();
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеСтандартныйПериод

&НаКлиентеНаСервереБезКонтекста
Функция ПереключитьПериодИЕгоПредставление(ЭтаФорма)
		
	ВидПериодаИмя = "ПериодВид";
	
	СтраницыИмя             = "ВидыПериодаСтраницы";	
	ПериодЗначениеИмя       = "ПериодЗначение";
	ПериодПредставлениеИмя  = "ПериодПредставление";
	СтраницаПроизвольныйИмя = "СтраницаПроизвольныйПериод";
	СтраницаСтандартныйИмя  = "СтраницаСтандартныйПериод";
	
	Значение = ЭтаФорма[ПериодЗначениеИмя];
	
	// Отработаем с периодом в случае, когда дата начала не должна участвовать в отчете.
	Если НЕ ЭтаФорма.Элементы.ПериодЗначениеДатаНачала.Видимость ИЛИ НЕ ЭтаФорма.Элементы.ПериодЗначениеДатаОкончания.Видимость Тогда
		
		Если Не ЗначениеЗаполнено(ЭтаФорма.ФиксированныйВидПериода) Тогда
			
			ЭтаФорма[ВидПериодаИмя] = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод");
			
			Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
			
			Если НЕ ЭтаФорма.Элементы.ПериодЗначениеДатаНачала.Видимость Тогда
				
				Значение.ДатаНачала = Дата(1, 1, 1);
				
			Иначе
				
				Значение.ДатаОкончания = Дата(3000, 1, 1);
				
			КонецЕсли;
			
		КонецЕсли;						
		
	КонецЕсли;
	
	ВидПериода = ЭтаФорма[ВидПериодаИмя];
	ВыбранПроизвольный = ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод");
	
	// Стандартная работа с периодом.
	Если ВыбранПроизвольный Тогда
		
		// Переключение страницы.
		ЭтаФорма.Элементы[СтраницыИмя].ТекущаяСтраница = ЭтаФорма.Элементы[СтраницаПроизвольныйИмя];
		
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		
	Иначе
		
		// Переключение страницы.
		ЭтаФорма.Элементы[СтраницыИмя].ТекущаяСтраница = ЭтаФорма.Элементы[СтраницаСтандартныйИмя];
		
		// Приведение значения периода в соответствие с выбранным видом.
		НачалоПериода = НачалоДня(Значение.ДатаНачала);
		Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
			НачалоПериода = НачалоДня(ПолучитьТекущуюДатуСеанса());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидПериода) Тогда
			
			НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ВидПериода, НачалоПериода);
			КонецПериода  = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ВидПериода, НачалоПериода);
			
		Иначе
			
			Если ЗначениеЗаполнено(Значение.ДатаОкончания) ИЛИ НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
				КонецПериода = Значение.ДатаОкончания;
			Иначе
				КонецПериода = КонецДня(НачалоПериода);
			КонецЕсли;				
			
		КонецЕсли;
		
		Значение.ДатаНачала    = НачалоПериода;
		Значение.ДатаОкончания = КонецПериода;
		
	КонецЕсли;
	
	Представление = упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(Значение, ВидПериода);
	ЭтаФорма[ПериодПредставлениеИмя] = Представление;
	ЭтаФорма[ПериодЗначениеИмя]      = Значение;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_Вид_ПриИзменении(Элемент)
	
	ПереключитьПериодИЕгоПредставление(ЭтаФорма);
	
	ИспользованиеИмя        = "ПериодИспользование";
	ПериодЗначениеИмя       = "ПериодЗначение";
	Значение = ЭтаФорма[ПериодЗначениеИмя];

	Если ЗначениеЗаполнено(Значение.ДатаНачала) И ЗначениеЗаполнено(Значение.ДатаОкончания) Тогда
		ЭтаФорма[ИспользованиеИмя] = Истина;
	КонецЕсли;
		
	ОбновитьПериодНаФорме();
	
	Если ЭтаФорма[ИспользованиеИмя] Тогда
		упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);	
	КонецЕсли;
	
	ИзменитьОтображениеСостояния();
	
	Если ПериодИспользование Тогда
		упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_Значение_НачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Формирование сведений по элементу.
	ПериодПредставлениеИмя = "ПериодПредставление";
	
	ПериодЗначениеИмя = "ПериодЗначение";
	ВидПериодаИмя     = "ПериодВид";
	ИспользованиеИмя  = "ПериодИспользование";
	
	Значение   = ЭтаФорма[ПериодЗначениеИмя];
	ВидПериода = ЭтаФорма[ВидПериодаИмя];
	
	НачалоПериода = Значение.ДатаНачала;
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ВидПериода,
			ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	// Параметры для чтения из обработчиков.
	ПараметрыВыбора = Новый Структура;
	// Для выбора значения.
	ПараметрыВыбора.Вставить("Значение",               Значение);
	ПараметрыВыбора.Вставить("Элемент",                Элемент);
	// Для загрузки значения.
	ПараметрыВыбора.Вставить("ПериодПредставлениеИмя", ПериодПредставлениеИмя);
	ПараметрыВыбора.Вставить("ПериодЗначениеИмя",      ПериодЗначениеИмя);
	ПараметрыВыбора.Вставить("ИспользованиеИмя",       ИспользованиеИмя);
	ПараметрыВыбора.Вставить("ВидПериода",             ВидПериода);
	
	ВыборПериодаИзВыпадающегоСписка(-1, ПараметрыВыбора);
	
	ОбновитьПериодНаФорме();
		
	Если ПериодИспользование Тогда
		упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);	
	КонецЕсли;

	ИзменитьОтображениеСостояния();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора)
	
	Если Результат = Неопределено Тогда
		Возврат; // Отмена выбора.
	КонецЕсли;
	
	Если Результат = -1 Тогда // Начало выбора.
		// Чтение параметров для формирования списка из сохраненного значения периода.
		ПараметрыВыбора.Вставить("НачалоПериода", ПараметрыВыбора.Значение.ДатаНачала);
		ПараметрыВыбора.Вставить("Вариант",       ПараметрыВыбора.Значение.Вариант);
		ИндексНачальногоЗначения = Неопределено;
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("Структура") Тогда
		// Чтение параметров для формирования списка из выбранного значения.
		ПараметрыВыбора.Вставить("НачалоПериода", Результат.Значение.НачалоПериода);
		ПараметрыВыбора.Вставить("Вариант",       Результат.Значение.Вариант);
		ИндексНачальногоЗначения = Результат.Значение.ИндексНачальногоЗначения;
	Иначе
		// Загрузка результата выбора.
		ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора);
		Возврат;
	КонецЕсли;
	
	// Формирование списка выбора.
	
	Если ПараметрыВыбора.Вариант = Неопределено Или ПараметрыВыбора.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		
		СписокПериодов = упоФункцииБСПКлиентСервер.СписокФиксированныхПериодов(
			ПараметрыВыбора.НачалоПериода, ПараметрыВыбора.ВидПериода);
		
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбора.НачалоПериода);
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[0].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 0);
		СписокПериодов[0].Значение = ОписаниеНавигационногоЭлемента;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[8].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 8);
		СписокПериодов[8].Значение = ОписаниеНавигационногоЭлемента;
		
		Если Не ПараметрыВыбора.Свойство("ВариантСтандартногоПериодаПоВиду") Тогда
			ПараметрыВыбора.Вставить("ВариантСтандартногоПериодаПоВиду",
				ВариантСтандартногоПериодаПоВиду(ПараметрыВыбора.ВидПериода));
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода", ПараметрыВыбора.НачалоПериода);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",  
			ПараметрыВыбора.ВариантСтандартногоПериодаПоВиду);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", Неопределено);
		СписокПериодов.Добавить(ОписаниеНавигационногоЭлемента, НСтр("ru = 'Относительный...'"));
		
	Иначе
		
		СписокПериодов = упоФункцииБСПКлиентСервер.СписокВычисляемыхПериодов(ПараметрыВыбора.ВидПериода);
		
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбора.Вариант);
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            ПараметрыВыбора.НачалоПериода);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", Неопределено);
		СписокПериодов.Добавить(ОписаниеНавигационногоЭлемента, НСтр("ru = 'Фиксированный...'"));
		
		КонецЕсли;
		
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	
	Если ПеременныеКлиента = Неопределено Тогда
		ПеременныеКлиента = Новый Структура;
	КонецЕсли;
	
	ПеременныеКлиента.Вставить("ВыборПериодаИзВыпадающегоСписка", Новый Структура);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ПараметрыВыбора", ПараметрыВыбора);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("СписокПериодов", СписокПериодов);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ИндексНачальногоЗначения", ИндексНачальногоЗначения);
	Если Результат = -1 Тогда
		НачатьВыборПериодаИзВыпадающегоСписка();
	Иначе
		ПодключитьОбработчикОжидания("НачатьВыборПериодаИзВыпадающегоСписка", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВариантСтандартногоПериодаПоВиду(ВидПериода)
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Возврат ВариантСтандартногоПериода.Сегодня;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаНеделя;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Декада") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаДекада;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотМесяц;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Квартал") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотКвартал;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Полугодие") Тогда
		Возврат ВариантСтандартногоПериода.ЭтоПолугодие;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Год") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотГод;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСписка()
	Если ПеременныеКлиента.Свойство("ВыборПериодаИзВыпадающегоСписка") Тогда
		Контекст = ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка;
		ПеременныеКлиента.Удалить("ВыборПериодаИзВыпадающегоСписка");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыВыбора",Контекст.ПараметрыВыбора);
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыборПериодаИзВыпадающегоСпискаЗавершение",ЭтотОбъект,ДополнительныеПараметры); 
		ПоказатьВыборИзСписка(ОписаниеОповещения,Контекст.СписокПериодов, Контекст.ПараметрыВыбора.Элемент, Контекст.ИндексНачальногоЗначения);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСпискаЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт
	ВыборПериодаИзВыпадающегоСписка(ВыбранныйЭлемент, ДополнительныеПараметры.ПараметрыВыбора);	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_НачалоПериода_ПриИзменении(Элемент)
	
	// Формирование сведений по элементу.
	ПериодНачалоИмя = "ПериодЗначениеДатаНачала";
	ПериодЗначениеИмя = "ПериодЗначение";
	ИспользованиеИмя  = "ПериодИспользование";
	
	Значение = ЭтаФорма[ПериодЗначениеИмя];
	
	Если Значение.ДатаНачала <> '00010101' Тогда
		Значение.ДатаНачала = НачалоДня(Значение.ДатаНачала);
	КонецЕсли;
	
	// Запись значения в пользовательские настройки компоновки данных.
	
	Если Значение.ДатаНачала <> '00010101' И Элементы.Найти(ИспользованиеИмя) <> Неопределено Тогда
		ЭтаФорма[ИспользованиеИмя] = Истина;
	КонецЕсли;
	
	ОбновитьПериодНаФорме();
	
	Если ПериодИспользование Тогда
		упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);	
	КонецЕсли;
	
	ИзменитьОтображениеСостояния();	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_КонецПериода_ПриИзменении(Элемент)
	
	// Формирование сведений по элементу.
	ПериодОкончаниеИмя = "ПериодЗначениеДатаОкончания";
	
	ПериодЗначениеИмя = "ПериодЗначение";
	ИспользованиеИмя  = "ПериодИспользование";
	
	Значение = ЭтаФорма[ПериодЗначениеИмя];
	
	Если Значение.ДатаОкончания <> '00010101' Тогда
		Значение.ДатаОкончания = КонецДня(Значение.ДатаОкончания);
	КонецЕсли;
	
	// Запись значения в пользовательские настройки компоновки данных.
	
	Если Значение.ДатаОкончания <> '00010101' И Элементы.Найти(ИспользованиеИмя) <> Неопределено Тогда
		ЭтаФорма[ИспользованиеИмя] = Истина;
	КонецЕсли;
	
	ОбновитьПериодНаФорме();
	
	Если ПериодИспользование Тогда
		упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);	
	КонецЕсли;

	ИзменитьОтображениеСостояния();	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_Значение_Очистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора)
	Значение = ПараметрыВыбора.Значение;
	
	// Запись результата выбора в данные формы и пользовательские настройки КД.
	Если ТипЗнч(Результат.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		ЭтаФорма[ПараметрыВыбора.ПериодПредставлениеИмя] = ?(ПустаяСтрока(Результат.Представление), Строка(Результат.Значение), Результат.Представление);
		Значение.Вариант = Результат.Значение;
	Иначе
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ПараметрыВыбора.ВидПериода, Результат.Значение);
		КонецПериода  = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ПараметрыВыбора.ВидПериода, Результат.Значение);
		
		ЭтаФорма[ПараметрыВыбора.ПериодПредставлениеИмя] = Результат.Представление;
		
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Значение.ДатаНачала    = НачалоПериода;
		Значение.ДатаОкончания = КонецПериода;
	КонецЕсли;
	
	ЭтаФорма[ПараметрыВыбора.ПериодЗначениеИмя] = Значение;
		
	Если Элементы.Найти(ПараметрыВыбора.ИспользованиеИмя) <> Неопределено Тогда
		ЭтаФорма[ПараметрыВыбора.ИспользованиеИмя] = Истина;
	КонецЕсли;
		
	Если ПериодИспользование Тогда
		упоТиповыеОтчетыКлиент.ЗагрузитьНовыеНастройкиВКомпоновщик(Отчет, мСтруктураНастроек);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодИспользованиеПриИзменении(Элемент)
	
	ИзменитьОтображениеСостояния();
	
	ЗаполнитьПользовательскуюНастройкуПериодОтчетаИзРеквизитовФормы();
	
КонецПроцедуры

&НаКлиенте	
Процедура ИзменитьОтображениеСостояния()
	
	Элементы.Результат.ОтображениеСостояния.Текст =
		НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета'");
	Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = 
		ДополнительныйРежимОтображения.Неактуальность;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = Ложь;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЛевоеЗначение) 
		И (Элемент.ТекущиеДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект") ИЛИ Элемент.ТекущиеДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроектнаяЗадача")) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		ЭлементОтбора.ПравоеЗначение = ВыбранноеЗначение;
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборПравоеЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЭтаФорма.ОтобразитьИзменениеДанных(ВыбранноеЗначение, ВидИзмененияДанных.Удаление);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоКомпонентуПроекта(НастройкиПоУмолчанию)
	
	// Процедура связана с упоТиповыеОтчетыСервер.ДобавитьДополнительныеНастройкиВКомпоновщик
	// С кодом упоФункцииОбщегоНазначенияКлиентСервер.УстановитьОтборПоПолюКомпоновки
	
	ЭлементОтбораНайден = Ложь;
	Поле = Новый ПолеКомпоновкиДанных("Проект.Компонент");	
	Для Каждого Элемент Из НастройкиПоУмолчанию.Отбор.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.ЛевоеЗначение = Поле Тогда				
			ЭлементОтбораНайден = Истина;	
			Прервать;
		КонецЕсли;
		
	КонецЦикла;   
	
	Если ЭлементОтбораНайден Тогда			
		Возврат;
	КонецЕсли;
	
	ЭлементПН = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементПН.ЛевоеЗначение = Поле;
	ЭлементПН.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементПН.ПравоеЗначение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоКомпоненты.Проект");
	ЭлементПН.Использование = Истина;				
	
КонецПроцедуры

// Добавляет/устанавливает параметры, программно добавленные в СКД, в параметры варианта отчета.
//
&НаСервере
Процедура ПеренестиИлиЗаполнитьПрограммныеПараметрыСКДВВарианте(НастройкиСКД, НастройкиВарианта)
	
	Если НастройкиОбъекта.Свойство("ТипПлана") Тогда
		Если НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ТипПлана") = Неопределено Тогда
			ПараметрДанныхТипПлана = НастройкиСКД.ПараметрыДанных.Элементы.Найти("ТипПлана");
			Если ПараметрДанныхТипПлана <> Неопределено Тогда
				НовыйПараметр = НастройкиВарианта.ПараметрыДанных.Элементы.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйПараметр, ПараметрДанныхТипПлана);
			КонецЕсли;
		Иначе
			ЗаполнитьДобавленныйПараметрСКДВВарианте(НастройкиСКД, НастройкиВарианта, "ТипПлана");
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиОбъекта.Свойство("ВыборВерсии") Тогда
		КоличествоВерсий = НастройкиОбъекта.ВыборВерсии.КоличествоВерсий;
		Для НомерВерсии = 1 По КоличествоВерсий Цикл
			ИмяПараметраКД = "Версия" + Строка(НомерВерсии);
			Если НастройкиВарианта.ПараметрыДанных.Элементы.Найти(ИмяПараметраКД) = Неопределено Тогда
				ПараметрДанныхТипПлана = НастройкиСКД.ПараметрыДанных.Элементы.Найти(ИмяПараметраКД);
				Если ПараметрДанныхТипПлана <> Неопределено Тогда
					НовыйПараметр = НастройкиВарианта.ПараметрыДанных.Элементы.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйПараметр, ПараметрДанныхТипПлана);
				КонецЕсли;
			Иначе
				ЗаполнитьДобавленныйПараметрСКДВВарианте(НастройкиСКД, НастройкиВарианта, ИмяПараметраКД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныйПараметрСКДВВарианте(НастройкиСКД, НастройкиВарианта, ИмяПараметраКД)
	
	ПараметрКД = Новый ПараметрКомпоновкиДанных(ИмяПараметраКД);	
	
	ПараметрСКД = НастройкиСКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКД);
	
	ПараметрВарианта = Неопределено;
	Если НастройкиВарианта <> Неопределено Тогда
		ПараметрВарианта = НастройкиВарианта.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКД);
	КонецЕсли;
	
	Если ПараметрСКД <> Неопределено 
		И ПараметрВарианта <> Неопределено
		И Не ЗначениеЗаполнено(ПараметрВарианта.Значение) Тогда		
	   	ЗаполнитьЗначенияСвойств(ПараметрВарианта, ПараметрСКД);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные = Ложь, КодЯзыка = Неопределено)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);
	
КонецФункции

&НаКлиенте
Процедура ДополнитьДанныеПоПериоду()
	
	// Если период в отчете не используется, то скрываем соответсвующие поля.
	ПараметрыДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрПериод = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
	Если ПараметрПериод = Неопределено Тогда
		Элементы.ГруппаВыборПериода.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПериодВид) Тогда
		ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод");
	КонецЕсли;
	
	Если ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
		Элементы.ВидыПериодаСтраницы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйПериод;
	КонецЕсли;
	
	Если НЕ Элементы.ПериодЗначениеДатаНачала.Видимость Тогда
		Если ЭтаФорма.ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
			ЭтаФорма.ПериодЗначение.ДатаНачала = Дата(1, 1, 1);
		КонецЕсли;
		// Не дадим переключить вид пеиода, т.к. оперируем одной датой.
		Элементы.ВидПериода.Доступность = Ложь;
	КонецЕсли;
	Если НЕ Элементы.ПериодЗначениеДатаОкончания.Видимость Тогда
		Если ЭтаФорма.ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.ПроизвольныйПериод") Тогда
			ЭтаФорма.ПериодЗначение.ДатаОкончания = Дата(3000, 1, 1);
		КонецЕсли;
		// Не дадим переключить вид пеиода, т.к. оперируем одной датой.
		Элементы.ВидПериода.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзменитьНастройкиПоУмолчанию(ОтчетОбъект)
	
	СКД = ОтчетОбъект.СхемаКомпоновкиДанных;
	
	НастройкиОбъекта = Новый Структура;
	Попытка
		НастройкиОбъекта = ОтчетОбъект.ПолучитьНастройкиОтчета();
	Исключение
	КонецПопытки;
	
	НастройкиПоУмолчанию = СКД.НастройкиПоУмолчанию;
	упоТиповыеОтчетыСервер.УстановитьФорматированиеСуммовыхПолейИзНастроекПользователя(НастройкиПоУмолчанию,
		НастройкиОбъекта);
	упоТиповыеОтчетыСервер.ДобавитьФорматированиеПоказателейИОтборПоРуководителюИСтатусуПроекта(НастройкиПоУмолчанию,
		НастройкиОбъекта);
	
	Если ТипЗнч(НастройкиОбъекта) = Тип("Структура") Тогда
		Если НастройкиОбъекта.Свойство("НастройкиПериода") Тогда
			НастройкиПериодаОтчета = НастройкиОбъекта.НастройкиПериода;
		КонецЕсли;
		Если НастройкиОбъекта.Свойство("ФиксированныйВидПериода", ФиксированныйВидПериода) Тогда
			ПериодВид = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета." + ФиксированныйВидПериода);
			Элементы.ВидПериода.Доступность = Ложь;
		КонецЕсли;
		Если НастройкиОбъекта.Свойство("ОтключитьОтборПоКомпоненту") Тогда
			Параметры.ОтключитьОтборПоКомпоненту = НастройкиОбъекта.ОтключитьОтборПоКомпоненту;
			Если Не НастройкиОбъекта.ОтключитьОтборПоКомпоненту Тогда
				УстановитьОтборПоКомпонентуПроекта(НастройкиПоУмолчанию);
			КонецЕсли;
		Иначе
			УстановитьОтборПоКомпонентуПроекта(НастройкиПоУмолчанию);
		КонецЕсли;
		Если НастройкиОбъекта.Свойство("УстановитьПараметрыПоУмолчаниюИзОтчета") Тогда
			Попытка
				ОтчетОбъект.УстановитьПараметрыПоУмолчанию(НастройкиОбъекта);
			Исключение
			КонецПопытки;
		КонецЕсли;
		НастройкиОбъекта.Свойство("РеквизитыВДопНастройки", РеквизитыВДопНастройки);
	КонецЕсли;
	
	// Загрузка настроек нужна для применения добавленных параметров СКД.
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиПоляСроковВДополнительнуюИнформацию()
	
	Если Не НастройкиОбъекта.Свойство("ВыводитьДатыПЗКакДополнительнуюИнформацию") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоПредопределенныйВариант Тогда
		Возврат;
	КонецЕсли;
	
	упоТиповыеОтчетыСервер.ПеренестиПоляСроковВДополнительнуюИнформацию(Отчет.КомпоновщикНастроек.Настройки, НастройкиОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлементаУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("КомпоновщикНастроекПользовательскиеНастройки");
	
	ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Настройка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Период отчета";
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОдновременноеИспользованиеОтбораНаПроектИПроектнуюЗадачу(НастройкиКомпоновкиДанных, ВыводитьСообщение = Ложь)
	
	ОтборыПоПроекту = Новый Массив;
	ОтборыПоПроектнойЗадаче = Новый Массив;
	
	ЭлементыОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы;
	
	НайтиУстановленныеОтборыПоПроектуИПроектнойЗадаче(ЭлементыОтбора, ОтборыПоПроекту, ОтборыПоПроектнойЗадаче);
	ИспользуетсяОтборПоПроектуИПроектнойЗадаче = ОтборыПоПроекту.Количество() И ОтборыПоПроектнойЗадаче.Количество();
	
	Если НЕ ИспользуетсяОтборПоПроектуИПроектнойЗадаче Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Отбор Из ОтборыПоПроекту Цикл
		Отбор.Использование = Ложь;
	КонецЦикла;
	
	Если ВыводитьСообщение Тогда
		ТекстСообщения = НСтр("ru = 'Обнаружен конфликт настроек отбора: отбор по проекту и проектной задаче в группе ""И"" недопустим.
				|Отбор по проекту был отключен.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиУстановленныеОтборыПоПроектуИПроектнойЗадаче(ЭлементыОтбора, ОтборыПоПроекту, ОтборыПоПроектнойЗадаче)
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = "Проект" И ЭлементОтбора.Использование Тогда
			ОтборыПоПроекту.Добавить(ЭлементОтбора);
		КонецЕсли;
		
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = "ПроектнаяЗадача" И ЭлементОтбора.Использование Тогда
			ОтборыПоПроектнойЗадаче.Добавить(ЭлементОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
