#Область ПрограммныйИнтерфейс

// Функция - Получить общее количество элементов в очереди.
//
// Параметры:
//  ИмяРегистраОчереди	 - Строка	 - Имя регистра сведений очереди.
//  БезПроверкиПрав		 - Булево
// 
// Возвращаемое значение:
//  Число - число элементов.
//
Функция ПолучитьКоличествоЭлементовВОчереди(ИмяРегистраОчереди, БезПроверкиПрав = Истина) Экспорт
	
	Если БезПроверкиПрав Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ISNULL(Сумма(1), 0) КАК КоличествоЭлементовВОчереди
	               |ИЗ
	               |	РегистрСведений."+ИмяРегистраОчереди;
	
	Возврат Запрос.Выполнить().Выгрузить()[0].КоличествоЭлементовВОчереди;
	
КонецФункции

// Функция - Получить состояние очереди распределения трудозатрат.
//
// Параметры:
//  Проект	 - СписокЗначений, Массив, СправочникСсылка.Проекты, Неопределено	 - Проект отбора, если необходимо. 
//  БезПроверкиПрав	 - Булево - признак получения данных в привилегированном режиме.
//  ПроектныеЗадачи	 - Массив (ДокументСсылка.упоПроектнаяЗадача) - проектные задачи отбора. 
//  ДокументИсточник - ДокументСсылка - документ-источник записи очереди, который не надо учитывать при проверке очереди.
// 
// Возвращаемое значение:
//  Структура - Данные очереди. 
//
Функция ПолучитьСостояниеОчередиРаспределенияТрудозатрат(Проект = Неопределено, 
														БезПроверкиПрав = Ложь, 
														Знач ПроектныеЗадачи = Неопределено,
														ДокументИсточник = Неопределено) Экспорт 
		
	Если БезПроверкиПрав Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(СУММА(1), 0) КАК Количество
	               |ИЗ
	               |	РегистрСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач КАК Таблица
	               |ГДЕ
	               |	НЕ Таблица.Ошибка
	               |	И &УсловиеОтбораПоЗадачам
	               |	И &УсловиеОтбораПоИсточнику
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЕСТЬNULL(СУММА(1), 0) КАК Количество
	               |ИЗ
	               |	РегистрСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач КАК Таблица
	               |ГДЕ
	               |	Таблица.Ошибка
	               |	И &УсловиеОтбораПоЗадачам
	               |	И &УсловиеОтбораПоИсточнику";
	
	УсловиеОтбораПоЗадачам =  "&УсловиеОтбораПоЗадачам";
	УсловиеОтбораПоИсточнику = "&УсловиеОтбораПоИсточнику"; 
		
	Если ПроектныеЗадачи <> Неопределено Тогда				
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеОтбораПоЗадачам, 
											"Таблица.ПроектнаяЗадача В (&ПроектныеЗадачи)");
		Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	ИначеЕсли ТипЗнч(Проект) = Тип("СписокЗначений") ИЛИ ТипЗнч(Проект) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеОтбораПоЗадачам, 
											"Таблица.ПроектнаяЗадача.Проект В (&СписокПроектов)");		
		Запрос.УстановитьПараметр("СписокПроектов", Проект);
	ИначеЕсли Проект = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеОтбораПоЗадачам, "ИСТИНА");		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеОтбораПоЗадачам, 
											"Таблица.ПроектнаяЗадача.Проект = &Проект");
		Запрос.УстановитьПараметр("Проект", Проект);
	КонецЕсли;
	
	Если ДокументИсточник = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеОтбораПоИсточнику, 
											"ИСТИНА");
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, УсловиеОтбораПоИсточнику, 
											"НЕ Таблица.Источник = &Источник");
		Запрос.УстановитьПараметр("Источник", ДокументИсточник);
	КонецЕсли;	
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("Очередь", РезультатПакета[0].Выгрузить()[0].Количество);
	Результат.Вставить("Ошибок", РезультатПакета[1].Выгрузить()[0].Количество);
	Результат.Вставить("Всего", Результат.Очередь + Результат.Ошибок);
	
	Возврат Результат;
	
КонецФункции

// Функция - Использовать отложенное отражение плановых трудозатрат.
// 
// Возвращаемое значение:
//  Булево - Значение константы.
//
Функция ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат() Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.упоОтложенноеОтражениеПлановыхТрудозатратЗадач.Получить();
КонецФункции

// Функция - Возможность действий очередь распределения трудозатрат.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - Отбор по проекту.
// 
// Возвращаемое значение:
//  Булево - Возможность действий.
//
Функция ВозможностьДействий_ОчередьРаспределенияТрудозатрат(Проект) Экспорт
	
	Если упоРаботаСОчередямиВызовСервера.ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат() Тогда
		
		СостояниеОчереди = упоРаботаСОчередямиВызовСервера.ПолучитьСостояниеОчередиРаспределенияТрудозатрат(Проект, Истина);
		КоличествоЭлементовВОчереди = СостояниеОчереди.Всего;
		Если КоличествоЭлементовВОчереди > 0 Тогда
			
			СтрокаСостояниеОчереди = 
				НСтр("ru = 'По проекту ""%2"" в очереди отложенного отражения плановых трудозатрат сейчас задач: %1.'");
			СтрокаСостояниеОчереди = СтрШаблон(СтрокаСостояниеОчереди, КоличествоЭлементовВОчереди, Проект);
			ТекстСообщения = СтрокаСостояниеОчереди + Символы.ПС + 
				НСтр("ru = 'Для выполнения операции необходимо дождаться завершения обработки очереди по проекту.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

// Проверяет, находится переданный список ПЗ в очереди отложенного отражения трудозатрат или нет.
//
// Параметры:
//  ПроектныеЗадачи										 - Массив	 - масив проектных задач для проверки в очереди.
//  ДокументОтбора										 - ДокументСсылка
//  ВыводитьСообщениеПользователю						 - Булево
//  ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат	 - Булево
// 
// Возвращаемое значение:
//  Булево - есть/нет отложеные трудозатраты по переданным задачам.
//
Функция ЕстьОтложенныеТрудозатраты(Знач ПроектныеЗадачи, 
	ДокументОтбора = Неопределено,
	ВыводитьСообщениеПользователю = Ложь,
	Знач ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат = Неопределено) Экспорт
	
	мЕстьОтложенныеТрудозатраты = Ложь;
	
	Если ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат = Неопределено Тогда
		ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат = 
			упоРаботаСОчередямиВызовСервера.ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат();
	КонецЕсли;
	
	Если Не ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат Тогда
		Возврат мЕстьОтложенныеТрудозатраты;
	КонецЕсли;
	
	Если ТипЗнч(ПроектныеЗадачи) = Тип("Массив") И ЗначениеЗаполнено(ПроектныеЗадачи) Тогда
		Если ТипЗнч(ПроектныеЗадачи[0]) = Тип("СправочникСсылка.Проекты") Тогда
			ПроектныеЗадачи = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(ПроектныеЗадачи);
		КонецЕсли;
	КонецЕсли;
	
	СостояниеОчереди = упоРаботаСОчередямиВызовСервера.ПолучитьСостояниеОчередиРаспределенияТрудозатрат(
		, 
		Истина,
		ПроектныеЗадачи,
		ДокументОтбора);
	
	мЕстьОтложенныеТрудозатраты = СостояниеОчереди.Всего > 0;
	
	Если ВыводитьСообщениеПользователю И мЕстьОтложенныеТрудозатраты Тогда
		ТекстСообщения = НСтр("ru = 'По задачам документа есть отложенные трудозатраты.
		|Необходимо выполнить регламентное задание по отражению трудозатрат.'"); 
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат мЕстьОтложенныеТрудозатраты;
	
КонецФункции

#Область ФоновыеЗадания

// Запускает фоновое задание с передачей результата на клиент.
//
// Параметры:
//  ИмяПроцедуры				 - Строка		 - имя экспортной процедуры, которую необходимо выполнить в фоне.
//  ПараметрыПроцедуры			 - Структура	 - произвольные параметры вызова процедуры ИмяПроцедуры.
//  ИдентификаторФормы			 - УникальныйИдентификатор	 - уникальный идентификатор формы,
//  	во временное хранилище которой надо поместить результат выполнения процедуры.
//  НаименованиеФоновогоЗадания	 - Строка					 - наименование фонового задания.
//  КлючФоновогоЗадания			 - Строка					 - ключ фонового задания.
// 
// Возвращаемое значение:
//  Структура - результат выполнения задания (см.ДлительныеОперации.ВыполнитьВФоне()).
//
Функция ЗапуститьФоновоеЗаданиеКонтекстКлиента(ИмяПроцедуры, 
												Знач ПараметрыПроцедуры,
												Знач ИдентификаторФормы,
												Знач НаименованиеФоновогоЗадания = "",
												Знач КлючФоновогоЗадания = "") Экспорт
		
	ПараметрыЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыЗапуска.КлючФоновогоЗадания = КлючФоновогоЗадания;
	ПараметрыЗапуска.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;

	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыЗапуска);
	
КонецФункции

// Запускает фоновое задание.
//
// Параметры:
//  ИмяПроцедуры				 - Строка	 - имя экспортной процедуры, которую необходимо выполнить в фоне.
//  ПараметрыПроцедуры			 - Массив	 - произвольные параметры вызова процедуры ИмяПроцедуры.
//  НаименованиеФоновогоЗадания	 - Строка	 - наименование фонового задания.
//  КлючФоновогоЗадания			 - Строка	 - ключ фонового задания.
//  ОжидатьЗавершения			 - Булево	 - флаг ожидания.
//
Процедура ЗапуститьФоновоеЗаданиеКонтекстСервера(ИмяПроцедуры, 
												ПараметрыПроцедуры = Неопределено, 
												НаименованиеФоновогоЗадания = "", 
												КлючФоновогоЗадания = "", 
												ОжидатьЗавершения = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(КлючФоновогоЗадания) Тогда
		Отбор = Новый Структура("Ключ, Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно);
		АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		Если АктивныеЗадания.Количество() > 0 Тогда
			Для Каждого АктивноеЗадание Из АктивныеЗадания Цикл
				АктивноеЗадание.Отменить();
			КонецЦикла;
		КонецЕсли;
		
		АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		Если АктивныеЗадания.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить(ИмяПроцедуры,
		ПараметрыПроцедуры, 
		КлючФоновогоЗадания,
		НаименованиеФоновогоЗадания);
	
	Если ОжидатьЗавершения Тогда
		Задание.ОжидатьЗавершенияВыполнения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Вывести информацию по очереди трудозатрат.
//
// Параметры:
//  ОбъектОтчета		 - ОтчетОбъект	 - Объект отчета. 
//  ДокументРезультат	 - ТабличныйДокумент	 - Документ результата.
//  БезПроверкиПрав		 - Булево	 - Необходимость установки привилегированного режима.
//
Процедура ВывестиВОтчетИнформациюПоОчередиТрудозатрат(ОбъектОтчета, ДокументРезультат, БезПроверкиПрав = Ложь) Экспорт
	
	Если БезПроверкиПрав Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НастройкиКомпоновщика = ОбъектОтчета.КомпоновщикНастроек.ПолучитьНастройки();
					
	КоличествоЭлементовВОчереди = упоРаботаСОчередями.ПолучитьКоличествоВОчередиТрудозатратПоНастройкамКомпоновки(НастройкиКомпоновщика, БезПроверкиПрав);	
	
	Если КоличествоЭлементовВОчереди = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МакетПредупреждения = Обработки.упоРаботаСОчередями.ПолучитьМакет("ПредупреждениеДляОтчетов");
	ОбластьМакет = МакетПредупреждения.ПолучитьОбласть("Предупреждение");
	ОбластьМакет.Параметры.КоличествоЗадач = Формат(КоличествоЭлементовВОчереди, "ЧН=; ЧГ="); 	
	ОбластьМакет.Параметры.ИмяОчереди = "ОткрытьОчередь_упоОчередьОтраженияПлановыхТрудозатратЗадач"; 	
	
	ДокументРезультат.Вывести(ОбластьМакет);
	
КонецПроцедуры

Функция РазделительСеансовыхДанных() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий") Тогда
			МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");		
			РазделительСеанса = МодульРаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
		КонецЕсли;
	КонецЕсли;	
	
	Возврат РазделительСеанса;
	
КонецФункции

#КонецОбласти
