////////////////////////////////////////////////////////////////////////////////
// Содержит обработчики базовых событий формы и универсальные 
// обработчики действий.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
 
// Обработчик события, вызываемый на клиенте при открытии формы до показа окна пользователю. 
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ОбъектФормы			 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//  СброситьЗаголовок	 - Булево - признак необходимости сбросить заголовок формы.
// 
Процедура ФормаПриОткрытии(ЭтаФорма, ОбъектФормы = Неопределено, СброситьЗаголовок = Истина) Экспорт	
	
	мУстановитьТекущуюСтраницуСДанными = Ложь;
	
	Если ЭтаФорма.ИмяФормы = "Документ.упоРегистрацияФактическиВыполненногоОбъема.Форма.ФормаДокументаУправляемая" 
		Или ЭтаФорма.ИмяФормы = "Документ.упоСинхронизацияФактическиВыполненныхОбъемов.Форма.ФормаДокументаУправляемая" Тогда	
		
		мУстановитьТекущуюСтраницуСДанными = Истина;
		ПроверяемыеДанные = Новый Структура("ПерваяТаблица, ВтораяТаблица, СтраницаВторойТаблицы",
											ОбъектФормы.ДоходныеОбъемы, 
											ОбъектФормы.РасходныеОбъемы, 
											ЭтаФорма.Элементы.ГруппаРасходныеОбъемы);
											
	ИначеЕсли ЭтаФорма.ИмяФормы = "Документ.упоРегистрацияФактическихДоходовИРасходов.Форма.ФормаДокументаУправляемая"										
		Или ЭтаФорма.ИмяФормы = "Документ.упоСинхронизацияФактическихДоходовИРасходов.Форма.ФормаДокумента" Тогда	
		
		мУстановитьТекущуюСтраницуСДанными = Истина;
		ПроверяемыеДанные = Новый Структура("ПерваяТаблица, ВтораяТаблица, СтраницаВторойТаблицы",
											ОбъектФормы.Доходы, 
											ОбъектФормы.Расходы, 
											ЭтаФорма.Элементы.СтраницаРасходы);
																						
	КонецЕсли;	
	
	Если мУстановитьТекущуюСтраницуСДанными Тогда
		УстановитьТекущуюСтраницуСДанными(ПроверяемыеДанные.ПерваяТаблица, 
											ПроверяемыеДанные.ВтораяТаблица, 
											ПроверяемыеДанные.СтраницаВторойТаблицы);
	КонецЕсли;										
		
КонецПроцедуры 

// Обработчик события, вызываемый на клиенте при повторном открытии формы.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ОбъектФормы			 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//  СтандартнаяОбработка - Булево - признак стандартной обработки события формы.
//
Процедура ФормаПриПовторномОткрытии(ЭтаФорма, ОбъектФормы = Неопределено, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры 

// Обработчик события, вызываемый на клиенте перед закрытием формы, а также при закрытии модальной формы по таймауту.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма										 - форма, для который вызывается обработчик.
//  ОбъектФормы			 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект	 - основной реквизит формы.
//  Отказ				 - Булево															 - признак отказа от закрытия формы.
//  СтандартнаяОбработка - Булево															 - признак стандартной обработки события.
//  ЗавершениеРаботы	 - Булево															 - признак завершения работы системы.
//  ТекстПредупреждения	 - Строка															 - текст предупреждения о завершении работы.
//
Процедура ФормаПередЗакрытием(ЭтаФорма, 
								ОбъектФормы = Неопределено, 
								Отказ, 
								СтандартнаяОбработка, 
								ЗавершениеРаботы = Ложь, 
								ТекстПредупреждения = "") Экспорт
	
КонецПроцедуры 

// Обработчик события, вызываемый на клиенте при закрытии формы.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ОбъектФормы	 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//
Процедура ФормаПриЗакрытии(ЭтаФорма, ОбъектФормы = Неопределено) Экспорт
	
	
	
КонецПроцедуры 
 
// Обработчик события, вызываемый на клиенте во всех созданных формах при вызове метода Оповестить. 
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ОбъектФормы	 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//  ИмяСобытия	 - Строка - имя события, может быть использовано для идентификации сообщений принимающими их формами.
//  Параметр	 - Произвольный - параметр сообщения. Могут быть переданы любые необходимые данные.
//  Источник	 - Произвольный - источник события. Например, в качестве источника может быть указана другая форма.
//
Процедура ФормаОбработкаОповещения(ЭтаФорма, ОбъектФормы = Неопределено, ИмяСобытия, Параметр, Источник) Экспорт
	
	ФормаМодифицирована = ЭтаФорма.Модифицированность;
	
	Если ИмяСобытия = "ИзменениеТекущегоПроекта" Тогда
		упоФункцииОбщегоНазначенияКлиентСервер.ЗаполнитьСвойствоЕслиЕсть(ЭтаФорма, "упоТекущийПроект", Параметр);
	КонецЕсли;
	
	Если ИмяСобытия = "ПроверитьРедактированиеПроекта" Тогда
		
		Если Не ФормаМодифицирована Тогда
			Возврат; // Возврат
		КонецЕсли;
		
		ФормаСодержитДанныеПроекта = ФормаСодержитДанныеПроекта(ОбъектФормы, Параметр.Проект);
		
		Если ФормаСодержитДанныеПроекта Тогда 
			Параметр.КоличествоФормКЗаписи = Параметр.КоличествоФормКЗаписи + 1;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписатьИзмененияПроекта" Тогда
		
		Если Не ФормаМодифицирована Тогда
			Возврат; // Возврат
		КонецЕсли;
		
		ФормаСодержитДанныеПроекта = ФормаСодержитДанныеПроекта(ОбъектФормы, Параметр.Проект);
		
		Если ФормаСодержитДанныеПроекта Тогда 
			ИзмененияДанныхФормыЗаписаны = Истина;
			Попытка
				ИзмененияДанныхФормыЗаписаны = ЭтаФорма.Записать();
			Исключение
				ИзмененияДанныхФормыЗаписаны = Ложь;
			КонецПопытки;
			Параметр.ВсеИзмененияЗаписаны = Параметр.ВсеИзмененияЗаписаны И ИзмененияДанныхФормыЗаписаны;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "упоРегистрацияКалендаря" Тогда
		
		Если ОбъектФормы = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		СостИмени = упоФункцииОбщегоНазначенияКлиентСервер.СоставИмениФормы(ЭтаФорма.ИмяФормы);
		
		Если Не упоРаботаСФормамиКлиентСервер.ЭтоФормаРабочегоКалендаря(СостИмени) Тогда
			Возврат;
		КонецЕсли;
		
		ИмяРеквизитаКалендарь = упоРаботаСФормамиКлиентСервер.ИмяРеквизитаКалендарь(СостИмени);
		Календарь = ОбъектФормы[ИмяРеквизитаКалендарь];
		Если Параметр = Календарь Тогда
			ИмяКоманды = упоРаботаСФормамиКлиентСервер.ИмяЭлемента_КомандаОптимизироватьРабочиеКалендари();
			НуженРасчетСдвигов = упоРабочиеКалендариВызовСервера.НуженРасчетСдвигов(Календарь);
			ЭтаФорма.Элементы[ИмяКоманды].Видимость = НуженРасчетСдвигов;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

// Обработчик события, вызываемый на клиенте при обработка события от внешнего компонента.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ОбъектФормы	 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//  Источник	 - Строка - источник внешнего события.
//  Событие		 - Строка - наименование события.
//  Данные		 - Строка - данные для события.
// 
Процедура ФормаВнешнееСобытие(ЭтаФорма, ОбъектФормы = Неопределено, Источник, Событие, Данные) Экспорт
	
	
	
КонецПроцедуры 

// Обработчик события, вызываемый на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  ЭтаФорма		 - УправляемаяФорма - форма, для который вызывается обработчик. 
//  Отказ			 - Булево - признак отказа от записи.
//  ПараметрыЗаписи	 - Структура - структура, содержащая параметры записи.
//
Процедура ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи = Неопределено) Экспорт
	
	ОчиститьСообщения();
	
	Если ПараметрыЗаписи.Свойство("РежимЗаписи") И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если ТипЗнч(ЭтаФорма.Объект.Ссылка) = Тип("ДокументСсылка.упоУтверждениеПланаПроекта") Тогда
			
			Проект = ЭтаФорма.Объект.Проект;
			// Проверка корректности заполнения данных проекта.
			МассивыСтруктурОшибок = упоПроектыИЗадачиВызовСервера.ДанныеПроверкиСтруктурыПроекта(Проект, Отказ);
			Если ТипЗнч(МассивыСтруктурОшибок) = Тип("Массив") И Отказ Тогда
				
				СтруктураПараметров = Новый Структура();
				СтруктураПараметров.Вставить("МассивыСтруктурОшибок", МассивыСтруктурОшибок);
				СтруктураПараметров.Вставить("Проект", Проект);
				
				ОткрытьФорму("Обработка.упоПроверкаСтруктурыПроекта.Форма.ФормаСпискаОшибокУправляемая", СтруктураПараметров);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(, "Интерактивная.ПроведениеДокумента:"+ТипЗнч(ЭтаФорма.Объект.Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры 

// Обработчик события, вызываемый на клиенте после записи объекта.
//
// Параметры:
//  ЭтаФорма		 - УправляемаяФорма	 - форма, для который вызывается обработчик.
//  ПараметрыЗаписи	 - Структура
//
Процедура ФормаПослеЗаписи(ЭтаФорма, ПараметрыЗаписи = Неопределено) Экспорт
	
	упоПроектыИЗадачиКлиент.ОповеститьОСменеСтатусаПроекта(ЭтаФорма);
	
	ВызватьОповещениеОбИзменении(ЭтаФорма);
	
КонецПроцедуры 

// Обработчик события, вызываемый на клиенте при выборе объекта в одной из подчиненных форм или при вызове в одной
// из подчиненных форм метода ОповеститьОВыборе.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ВыбранноеЗначение	 - Произвольный - результат выбора в подчиненной форме. В случае множественного выбора
//										  возвращается массив выбранных значений.
//  ИсточникВыбора		 - Произвольный - форма, где осуществлен выбор.
//
Процедура ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый на клиенте в подчиненной форме, если в форме-владельце изменился активный объект
// или в форме-владельце был вызван метод ОповеститьОбАктивизации.
//
// Параметры:
//  ЭтаФорма		 - УправляемаяФорма - форма, для который вызывается обработчик.
//  АктивныйОбъект	 - Произвольный - активный объект.
//  Источник		 - УправляемаяФорма, Форма - источник сообщения.
//
Процедура ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый на клиенте при записи объекта в одной из подчиненных форм или при вызове в одной из
// подчиненных форм метода ОповеститьОЗаписиНового. 
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - форма, для который вызывается обработчик.
//  НовыйОбъект			 - Произвольный - добавленный в подчиненной форме объект.
//  Источник			 - УправляемаяФорма, Форма - источник сообщения.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Универсальный обработчик событий формы на клиенте.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма, для который вызывается обработчик.
//  П1		 - Произвольный		 - не используется, зарезервирован.
//  П2		 - Произвольный		 - не используется, зарезервирован.
//  П3		 - Произвольный		 - не используется, зарезервирован.
//  П4		 - Произвольный		 - не используется, зарезервирован.
//  П5		 - Произвольный		 - не используется, зарезервирован.
//  П6		 - Произвольный		 - не используется, зарезервирован.
//  П7		 - Произвольный		 - не используется, зарезервирован.
//  П8		 - Произвольный		 - не используется, зарезервирован.
//
Процедура ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма,
	П1, П2, П3, П4, П5, П6, П7 = Неопределено, П8 = Неопределено) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда 
		
		Если ТипЗнч(П1) = Тип("КомандаФормы") И Найти(П1.Имя, "КомандаСППР") <> Неопределено Тогда
			МодульИнтеграцияССППРКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияССППРКлиент");
			МодульИнтеграцияССППРКлиент.ВыполнитьКомандуИнтеграцииССППР(ЭтаФорма, П1, Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый на клиенте при возникновении в форме события ОбработкаПерехода.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма	 - форма, для который вызывается обработчик.
//  ОбъектПерехода		 - ЛюбаяСсылка		 - ссылка на объект информационной базы. Объект, к которому требуется перейти.
//  СтандартнаяОбработка - Булево			 - признак выполнения стандартной (системной) обработки события.
//
Процедура ФормаОбработкаПерехода(ЭтаФорма, ОбъектПерехода, СтандартнаяОбработка) Экспорт	
	
КонецПроцедуры

// Обработчик события, вызываемый на клиенте при возникновении в форме события ВыборЗначения.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - форма, для который вызывается обработчик.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ФормаВыборЗначения(ЭтаФорма, СтандартнаяОбработка) Экспорт	
	
КонецПроцедуры

// Обработчик события, вызываемый на клиенте при возникновении в форме события ОбработкаНавигационнойСсылки.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма	 - форма, для который вызывается обработчик.
//  НавигационнаяСсылка	 - Строка			 - Значение гиперссылки форматированной строки. Параметр передается по ссылке.
//  СтандартнаяОбработка - Булево			 - признак выполнения стандартной (системной) обработки события.
//
Процедура ФормаОбработкаНавигационнойСсылки(ЭтаФорма, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт	
	
КонецПроцедуры

// Обработчик события, вызываемый на клиенте при возникновении в форме события ПриИзмененииПараметровЭкрана. 
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - форма, для который вызывается обработчик.
//
Процедура ФормаПриИзмененииПараметровЭкрана(ЭтаФорма) Экспорт	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВызватьОповещениеОбИзменении(ЭтаФорма)
	
	РегистраторыОповещения = Новый Массив;
	РегистраторыОповещения.Добавить("упоРегистрацияРолейТрудовогоРесурса");
	РегистраторыОповещения.Добавить("упоРегистрацияСтоимостиРесурса");
	РегистраторыОповещения.Добавить("упоРегистрацияСтоимостиРесурсов");
	РегистраторыОповещения.Добавить("упоСмещениеРолейТрудовогоРесурса");
	РегистраторыОповещения.Добавить("упоИзменениеСоставаПодразделения");
	РегистраторыОповещения.Добавить("упоРегистрацияСоставаПодразделения");
	
	Для Каждого РегистраторОповещения Из  РегистраторыОповещения Цикл
		Если НЕ Найти(ЭтаФорма.ИмяФормы, РегистраторОповещения) = 0 Тогда
			ОповеститьОбИзменении(ЭтаФорма.Объект.Ссылка);	
			Прервать;
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры

// Переключает текущую страницу на форме на вторую, если в таблице первой страницы нет данных, 
// а в таблице второй страницы данные есть.
//
// Параметры:
//  ПерваяТаблица	 - ДанныеФормыКоллекция - таблица формы - источник данных для первой страницы.
//  ВтораяТаблица	 - ДанныеФормыКоллекция - таблица формы - источник данных для второй страницы.
//  СтраницаВторойТаблицы - ЭлементФормы - страница второй таблицы.
//
Процедура УстановитьТекущуюСтраницуСДанными(ПерваяТаблица, ВтораяТаблица, СтраницаВторойТаблицы)
	
	Если ВтораяТаблица.Количество() > 0 
		И ПерваяТаблица.Количество() = 0 Тогда		
		
		Если СтраницаВторойТаблицы.Родитель <> Неопределено Тогда
			СтраницаВторойТаблицы.Родитель.ТекущаяСтраница = СтраницаВторойТаблицы;
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры	

Функция СвойствоСуществуетИЗаполнено(Объект, ИмяСвойства)

	Возврат упоФункцииОбщегоНазначенияКлиентСервер.СвойствоСуществуетИЗаполнено(Объект, ИмяСвойства);
	
КонецФункции

Функция ФормаСодержитДанныеПроекта(Объект, ПроверяемыйПроект)
	
	ЕстьЗаполненныйРеквизитПроект = СвойствоСуществуетИЗаполнено(Объект, "Проект");
	ЕстьЗаполненныйРеквизитСсылка = СвойствоСуществуетИЗаполнено(Объект, "Ссылка");
	
	ФормаСодержитДанныеПроекта = (ЕстьЗаполненныйРеквизитПроект И Объект.Проект = ПроверяемыйПроект)
		Или (ЕстьЗаполненныйРеквизитСсылка И Объект.Ссылка = ПроверяемыйПроект);
		
	Возврат ФормаСодержитДанныеПроекта;
		
КонецФункции

#КонецОбласти
