
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Справочники.упоСобытияКалендаря.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоИзменениеВладельцаРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРаспределениеРабочегоВремениЗаНеделю.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияВладельцаРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияРолейТрудовогоРесурса.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияСтоимостиРесурса.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияСтоимостиРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоСмещениеВладельцаРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоСмещениеРолейТрудовогоРесурса.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоТрудовыеРесурсы);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	ОтборНаложен = Ложь;
	МассивРолей	= Неопределено;
	
	Если Параметры.Отбор.Количество() Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Роль") Тогда
				
		СтруктураПараметровПодбора = Новый Структура("СтрокаПоиска, Роль, МассивВыбораТрудовыхРесурсов", "");
		ЗаполнитьЗначенияСвойств(СтруктураПараметровПодбора, Параметры);
		
		ДанныеВыбора.ЗагрузитьЗначения(упоРесурсыИРолиСервер.ПолучитьТрудовыеРесурсыПоРоли(СтруктураПараметровПодбора.Роль, 
											СтруктураПараметровПодбора.МассивВыбораТрудовыхРесурсов, 
											СтруктураПараметровПодбора.СтрокаПоиска));
		ОтборНаложен = Истина; 
		
	КонецЕсли;	
	
	Если Не ОтборНаложен Тогда
		
		ДанныеВыбора.ЗагрузитьЗначения(РесурсыОбщегоПодбора(Параметры.СтрокаПоиска));
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Функция РесурсыОбщегоПодбора(СтрокаПоиска = "")
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоТрудовыеРесурсы.Ссылка КАК ТрудовойРесурс
	               |ИЗ
	               |	Справочник.упоТрудовыеРесурсы КАК упоТрудовыеРесурсы
	               |ГДЕ
	               |	НЕ упоТрудовыеРесурсы.НеОтображать
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоСтроке
	               |				ТОГДА упоТрудовыеРесурсы.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	МассивРесурсов = ВыполнитьЗапросВыбораРесурсов(ТекстЗапроса, СтрокаПоиска);
	
	Возврат МассивРесурсов;
	
КонецФункции

Функция ВыполнитьЗапросВыбораРесурсов(ТекстЗапроса, СтрокаПоиска, ПараметрыЗапроса = Неопределено)
	
	МассивРесурсов = Новый Массив;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтборПоСтроке", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");

	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивРесурсов = Результат.Выгрузить().ВыгрузитьКолонку("ТрудовойРесурс");
	КонецЕсли;
	
	Возврат МассивРесурсов;
	
КонецФункции 

#КонецОбласти  
