// Типы элементов:
// 0 - Модель
// 1 - Этап
// 2 - Пакет
// 3 - Доход
// 4 - Расход
// 5 - Поступление
// 6 - Выплата

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	// Если документ введен не на основании,
	// то интерфейс должен отработать эту ситуацию.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ДокументОснование");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИнициализацияФормы();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	упоУправлениеДоговорамиКлиент.ПересчитатьИтогиВсегоГрафикаДляУсловногоОформления(Объект);
	ТекущийТипЮрУсловийДоговора = Объект.ТипЮридическихУсловийДоговора;
	РазвернутьДерево();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	ОбновитьСуммуДоговора(ДеревоЭтапов, Объект);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОшибкуВЖурналРегистрации(Ссылка, ОписаниеОшибки)

	ЗаписьЖурналаРегистрации("Ошибка выполнения",
								 УровеньЖурналаРегистрации.Ошибка,
								 Метаданные.Документы.упоРегистрацияЮридическихУсловийДоговора,
								 Ссылка,
								 ОписаниеОшибки);	

КонецПроцедуры // ЗаписатьОшибкуВЖурналРегистраци()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	Если Объект.ЭтоДополнительноеСоглашение Тогда
		КолонкиДляСверки = Новый Соответствие;
		КолонкиДляСверки.Вставить("УдаленныйЭтапВКалендарномПлане", Истина);
	Иначе
		КолонкиДляСверки = Неопределено;
	КонецЕсли;

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если НеобходимоСверитьЭтапы Тогда
		ПроверитьИзмененныеУдаленныеЭтапы();
	КонецЕсли;
	
	СтруктураДляНовыхЭтапов = Новый Структура();
	ТекущийПОльзователь = ПользователиКлиентСервер.ТекущийПользователь();
	СтруктураДляНовыхЭтапов.Вставить("Автор", ТекущийПользователь);
	СтруктураДляНовыхЭтапов.Вставить("АвторИзменений", ТекущийПользователь);
	СтруктураДляНовыхЭтапов.Вставить("ДатаМодификации", ТекущаяДатаСеанса());
	//СтруктураДляНовыхЭтапов.Вставить("Комментарий");
	СтруктураДляНовыхЭтапов.Вставить("Наименование");
	СтруктураДляНовыхЭтапов.Вставить("ПолноеНаименование");
	//СтруктураДляНовыхЭтапов.Вставить("НомерЭтапа");
	СтруктураДляНовыхЭтапов.Вставить("ЮридическоеУсловиеДоговора", ?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка), ТекущийОбъект.Ссылка, ТекущийОбъект.ПолучитьСсылкуНового()));
	Попытка
		упоУправлениеДоговорамиКлиентСервер.СохранитьДеревоВТаблицу(ДеревоЭтапов, ТекущийОбъект,,, КолонкиДляСверки, СтруктураДляНовыхЭтапов);
	Исключение
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();	
		ЗаписатьОшибкуВЖурналРегистрации(Объект.Ссылка, ОписаниеОшибки());
	КонецПопытки;

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	//ЭтапыПроектаКоллекция = ДеревоЭтапов.ПолучитьЭлементы();
	//ЗаписатьИзмененияЭтапов(ЭтапыПроектаКоллекция);	
	//ЗаполнитьДеревоЭтаповСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияЭтапов(ЭтапыПроектаКоллекция)
	
	Для Каждого ЭтапПодчиненный Из ЭтапыПроектаКоллекция Цикл
		
		ПодчиненныеЭтапы = ЭтапПодчиненный.ПолучитьЭлементы();
		ЗаписатьИзмененияЭтапов(ПодчиненныеЭтапы);

		Если ЭтапПодчиненный.ЭтапМодифицирован Тогда
			
			ЭтапОбъект = ЭтапПодчиненный.Этап.ПолучитьОбъект();
			ЭтапОбъект.Наименование = ЭтапПодчиненный.ПредставлениеЭтапа;
			ЭтапОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	упоУправлениеДоговорамиКлиент.ПересчитатьИтогиВсегоГрафикаДляУсловногоОформления(Объект);
	РазвернутьДерево();
	Если Объект.ЭтоДополнительноеСоглашение Тогда
		Заголовок = НСтр("ru = 'Дополнительное соглашение %1 от %2'");
	Иначе	
		Заголовок = НСтр("ru = 'Регистрация юридических условий договора %1 от %2'");
	КонецЕсли;	
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, СокрЛП(Объект.Номер), Строка(Объект.Дата));
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "ИзменениеДоговора" И Параметры.Ключ = Параметр Тогда 
		ОбработкаОповещения_ИзменениеДоговора_Сервер();
		упоУправлениеДоговорамиКлиент.ПересчитатьИтогиВсегоГрафикаДляУсловногоОформления(Объект);
	КонецЕсли;
	
	Если ИмяСобытия = "ЗаписьДокумента_упоИзменениеСтатусаДоговора" И Параметры.Ключ = Параметр.ДокументОснование Тогда 
		СтатусДоговора = упоУправлениеДоговорамиСервер.ПолучитьСтатусДоговора(Параметры.Ключ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИнициализацияФормы();
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1,
		П2, П3, П4, П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	ИзменениеПредставлениеДоговора("Номер");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ИзменениеПредставлениеДоговора("Дата");
КонецПроцедуры

&НаКлиенте
Процедура ТипЮридическихУсловийДоговораПриИзменении(Элемент)
	
	Доходный = УсловияДоговораДоходные(Объект.ТипЮридическихУсловийДоговора);
	Расходный = УсловияДоговораРасходные(Объект.ТипЮридическихУсловийДоговора);
	
	Если Объект.Этапы.Количество() > 0 И Не (Доходный И Расходный) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ТипЮридическихУсловийДоговораПриИзмененииЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Изменение типа юридических условий договора приведет к очищению этапов договора. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 120,
			КодВозвратаДиалога.Нет);
			
	Иначе
			
		ТипЮридическихУсловийДоговораПриИзмененииЗавершение(Неопределено, Неопределено);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипЮридическихУсловийДоговораПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьДеревоЭтапов();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.ТипЮридическихУсловийДоговора = ТекущийТипЮрУсловийДоговора;
		Возврат;
	КонецЕсли;
	
	ТекущийТипЮрУсловийДоговора = Объект.ТипЮридическихУсловийДоговора;
	УстановитьВидимостьПолей(Истина);
	
КонецПроцедуры	

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если КонтрагентДоИзменения <> Объект.Контрагент
		И (Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагенту")
			Или Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагентуИДоговору")
			Или Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйПоКонтрагенту")
			Или Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйПоКонтрагентуИДоговору")
			Или Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.РасходныйПоКонтрагенту")
			Или Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.РасходныйПоКонтрагентуИДоговору"))
		И (ДеревоЭтапов.ПолучитьЭлементы().Количество() > 0) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("КонтрагентПриИзмененииЗавершение", ЭтотОбъект);
		
		Если Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагенту") 
				Или Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйПоКонтрагенту")
				Или Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.РасходныйПоКонтрагенту") Тогда
			ТекстЗаполнения = НСтр("ru = 'по контрагенту %1'");
		Иначе
			ТекстЗаполнения = НСтр("ru = 'по контрагенту %1 и договору %2'");
		КонецЕсли;
		ТекстЗаполнения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаполнения, Объект.КонтрагентЗаполнения, Объект.ДоговорКонтрагентаЗаполнения);
		
		ТекстВопроса = НСтр("ru = 'Таблица этапов заполнена %1. 
									|Необходимо ли очистить таблицу этапов для новых условий заполнения?'");
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ТекстЗаполнения);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 120, КодВозвратаДиалога.Нет, НСтр("ru = 'Внимание'"));
		Возврат;
		
	Иначе
		
		КонтрагентПриИзмененииЗавершение(КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура КонтрагентПриИзмененииЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Объект.Контрагент = КонтрагентДоИзменения;
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда 
		Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходный");
		Объект.КонтрагентЗаполнения = Неопределено;
		Объект.ДоговорКонтрагентаЗаполнения = Неопределено;
		КонтрагентДоИзменения = Объект.Контрагент;
		
		ОчиститьДеревоЭтапов();
	КонецЕсли;
	
	ИзменениеПредставлениеДоговора("Контрагент");
	УстановитьВидимостьПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметДоговораПриИзменении(Элемент)
	ИзменениеПредставлениеДоговора("ПредметДоговора");
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ИзменениеПредставлениеДоговора("ВидДоговора");
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ИзменениеПредставлениеДоговора("Валюта");
КонецПроцедуры

&НаКлиенте
Процедура СхемаОплатыПриИзменении(Элемент) 	
	
	Если Объект.ГрафикНачислений.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СхемаОплатыПриИзмененииЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Данные графика оплаты будут обновлены. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 120,
			КодВозвратаДиалога.Нет);
			
	Иначе
			
		СхемаОплатыПриИзмененииЗавершение(КодВозвратаДиалога.Да,Неопределено);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СхемаОплатыПриИзмененииЗавершение(Ответ,ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.СхемаОплаты = СтараяСхемаОплаты;
		Возврат;
	КонецЕсли;
	
	ПроверяемыКолонки = Новый Массив;
	ПроверяемыКолонки.Добавить("Статья");
	//ПроверяемыКолонки.Добавить("Этап");
	//ПроверяемыКолонки.Добавить("ПредставлениеЭтапа");
	
	упоОперацииСДеревьямиКлиент.ПроставитьРеквизитВДереве(ДеревоЭтапов.ПолучитьЭлементы(),
		Новый Структура("СхемаОплаты",Объект.СхемаОплаты), ПроверяемыКолонки);
		
	Если Объект.ЭтоДополнительноеСоглашение Тогда
		КолонкиДляСверки = Новый Соответствие;
		КолонкиДляСверки.Вставить("УдаленныйЭтапВКалендарномПлане", Истина);
	Иначе
		КолонкиДляСверки = Неопределено;
	КонецЕсли;
	
	упоУправлениеДоговорамиКлиентСервер.СохранитьДеревоВТаблицу(ДеревоЭтапов, Объект,,, КолонкиДляСверки);
	
	КомандаРассчитатьНаСервере();	
	
	ИзменениеПредставлениеДоговора("СхемаОплаты");
	
	РазвернутьДерево();	
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	Для Каждого СтрокаДерева Из ДеревоЭтапов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоЭтапов.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьЭтапыПриИзменении(Элемент)
	
	УстановитьВидимостьПолей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЭтапов

&НаКлиенте
Процедура ДеревоЭтаповПриИзменении(Элемент)
	
	НеобходимоСверитьЭтапы = Истина;
	Если НеобходимоСверитьЭтапы И Объект.ТолькоИзмененныеЭтапы Тогда
		ПроверитьИзмененныеУдаленныеЭтапы();
		РазвернутьДерево();	
	КонецЕсли;

	ОбновитьСуммуДоговора(ДеревоЭтапов, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущаяСтрока = Элементы.ДеревоЭтапов.ТекущиеДанные;
		ТекущаяСтрока.ТипЭлемента = ТипДобавленногоЭлемента;
		Если ТипДобавленногоЭлемента = 0 Тогда
			ТекущаяСтрока.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
		ИначеЕсли ТипДобавленногоЭлемента = 1 Тогда
			ТекущаяСтрока.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Этап");  			
		КонецЕсли;	
	КонецЕсли;
	
	Если Копирование Тогда
		
		ТекущаяСтрока = Элементы.ДеревоЭтапов.ТекущиеДанные;
		ТекущаяСтрока.Этап = ПредопределенноеЗначение("Справочник.упоЭтапыДоговоров.ПустаяСсылка");
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ПоляГруппировки = Новый Соответствие;
	ПоляГруппировки.Вставить("ЭтапРодитель", "Этап");
	ПоляГруппировки.Вставить("ИндексСвязиЭтапаРодитель", "ИндексСвязиЭтапа");
	упоОперацииСДеревьямиКлиент.ДеревоЭтаповПеретаскивание(Элементы, Этаформа, "ДеревоЭтапов", "ДеревоЭтапов",
		//Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, "ЭтапРодитель");
		Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, ПоляГруппировки);
		
	НеобходимоСверитьЭтапы = Истина;
	Если НеобходимоСверитьЭтапы И Объект.ТолькоИзмененныеЭтапы Тогда
		ПроверитьИзмененныеУдаленныеЭтапы();
		РазвернутьДерево();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоУправлениеДоговорамиКлиент.ДеревоЭтаповПроверкаПеретаскивания(ЭтаФорма,Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПредставлениеЭтапаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры,
	СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Элемент.Родитель.ТекущиеДанные.Этап) Тогда
			Элемент.Родитель.ТекущиеДанные.ПредставлениеЭтапа = Текст;
	Иначе	
		Элемент.Родитель.ТекущиеДанные.ЭтапМодифицирован = Истина;
		Элемент.Родитель.ТекущиеДанные.ПредставлениеЭтапа = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	упоУправлениеДоговорамиКлиент.ДеревоЭтаповПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования,
		Отказ, Объект.СхемаОплаты);
		
	Если НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтапМодифицирован Или Не ЗначениеЗаполнено(ТекущиеДанные.Этап) Тогда
		Возврат;
	КонецЕсли;
		
	НовоеПредставление = ЗначениеРеквизитаОбъекта(ТекущиеДанные.Этап, "Наименование");
	Если ТекущиеДанные.ПредставлениеЭтапа <> НовоеПредставление Тогда 
		ТекущиеДанные.ПредставлениеЭтапа = НовоеПредставление;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПослеУдаления(Элемент)
	ИндексСвязиЭтапов = 0;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповДатаНачалаПриИзменении(Элемент)
	
	упоУправлениеДоговорамиКлиентСервер.ПересчитатьВетвьДрева(ДеревоЭтапов.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповДатаОкончанияПриИзменении(Элемент)
	
	упоУправлениеДоговорамиКлиентСервер.ПересчитатьВетвьДрева(ДеревоЭтапов.ПолучитьЭлементы());
	
	упоУправлениеДоговорамиКлиентСервер.ПересчитатьДатаНачисленияОплаты(ДеревоЭтапов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПредставлениеЭтапаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипЭлемента = 3 Тогда
		ОткрытьФорму("Справочник.упоСтатьиДоходов.ФормаВыбора", , Элемент);
	ИначеЕсли ТекущиеДанные.ТипЭлемента = 4 Тогда		
		ОткрытьФорму("Справочник.упоСтатьиЗатрат.ФормаВыбора", , Элемент);
	ИначеЕсли ТекущиеДанные.ТипЭлемента = 5 ИЛИ ТекущиеДанные.ТипЭлемента = 6 Тогда	
		Если ТекущиеДанные.ТипЭлемента = 5 Тогда
			НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление");	
		Иначе
			НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата");
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;			
		Отбор = Новый Структура("упоНаправлениеДвижения", НаправлениеДвижения);
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаВыбора", ПараметрыФормы, Элемент);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПредставлениеЭтапаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Типы элементов:
	// 0 - Модель
	// 1 - Этап
	// 2 - Пакет
	// 3 - Доход
	// 4 - Расход
	// 5 - Поступление
	// 6 - Выплата
	
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные;
	ТекущиеДанные.Статья = ВыбранноеЗначение;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	упоУправлениеДоговорамиКлиентСервер.ЗаполнитьВидДвиженияПоСтатье(ТекущиеДанные);
	Если ТекущиеДанные.ТипЭлемента = 3 ИЛИ ТекущиеДанные.ТипЭлемента = 4 Тогда
		ТекущиеДанные.Этап = ТекущиеДанные.Статья;
		
		Если Не Родитель = Неопределено Тогда
			ТекущиеДанные.ЭтапРодитель = Родитель.Этап;
			ТекущиеДанные.ДатаНачисленияОплаты = Родитель.ДатаОкончания;
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанные.ТипЭлемента = 5 ИЛИ ТекущиеДанные.ТипЭлемента = 6 Тогда
		ТекущиеДанные.Этап = ТекущиеДанные.Статья;
		
		Если Не Родитель = Неопределено Тогда
			ТекущиеДанные.ЭтапРодитель = Родитель.Этап;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ДеревоЭтаповСхемаОплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные;
	ПодчиненныеСтроки = ТекущиеДанные.ПолучитьЭлементы();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные",ТекущиеДанные);
	ДополнительныеПараметры.Вставить("ПодчиненныеСтроки",ПодчиненныеСтроки);
	
	Если ПодчиненныеСтроки.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДеревоЭтаповСхемаОплатыПриИзмененииЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Данные графика оплаты для текущей строки будут обновлены. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 120,
			КодВозвратаДиалога.Нет);
			
	Иначе
			
		 ДеревоЭтаповСхемаОплатыПриИзмененииЗавершение("безответа",ДополнительныеПараметры);
		 
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповСхемаОплатыПриИзмененииЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если НЕ Ответ = КодВозвратаДиалога.Да И НЕ Ответ = "безответа" Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	ДополнительныеПараметры.ПодчиненныеСтроки.Очистить();

	Если Объект.ЭтоДополнительноеСоглашение Тогда
		КолонкиДляСверки = Новый Соответствие;
		КолонкиДляСверки.Вставить("УдаленныйЭтапВКалендарномПлане", Истина);
	Иначе
		КолонкиДляСверки = Неопределено;
	КонецЕсли;

	упоУправлениеДоговорамиКлиентСервер.СохранитьДеревоВТаблицу(ДеревоЭтапов, Объект,,, КолонкиДляСверки);
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("Этап", ТекущиеДанные.ЭтапРодитель);
	СтруктураСтроки.Вставить("ИндексСвязиЭтапа", ТекущиеДанные.ИндексСвязиЭтапаРодитель);
	СтруктураСтроки.Вставить("Статья", ТекущиеДанные.Статья);
	СтруктураСтроки.Вставить("СхемаОплаты", ТекущиеДанные.СхемаОплаты);
	СтруктураСтроки.Вставить("Сумма", ТекущиеДанные.СуммаБДР);

	ДеревоЭтаповСхемаОплатыПриИзмененииНаСервере(СтруктураСтроки);
	РазвернутьДерево();
	
КонецПроцедуры

&НаСервере
Процедура ДеревоЭтаповСхемаОплатыПриИзмененииНаСервере(СтруктураСтроки)
	
	ГрафикОплаты = Объект.ГрафикОплаты;
	ДанныеПроекта = упоУправлениеДоговорамиСервер.ПолучитьДатыНачалаИОкончанияПроекта(Объект);
	Если ЗначениеЗаполнено(СтруктураСтроки.Этап) Тогда
		РезПоискаЭтапа =  Объект.Этапы.НайтиСтроки(Новый Структура("Этап", СтруктураСтроки.Этап));
	Иначе
		РезПоискаЭтапа =  Объект.Этапы.НайтиСтроки(Новый Структура("ИндексСвязиЭтапа", СтруктураСтроки.ИндексСвязиЭтапа));
	КонецЕсли;	
	Если РезПоискаЭтапа.Количество() > 0 Тогда
		ДанныеЭтапа = РезПоискаЭтапа[0];
	Иначе
		Возврат;
	КонецЕсли;
	упоУправлениеДоговорамиСервер.РассчитатьГрафикПлатежейВСтроке(Объект, ГрафикОплаты, ДанныеПроекта, ДанныеЭтапа, СтруктураСтроки);
	
	ЗаполнитьДеревоЭтаповСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтрокаРодитель = Элемент.ТекущиеДанные;
	СтруктураТипЭлемента = Новый Структура("ТипЭлемента", ТипДобавленногоЭлемента);
	
	упоУправлениеДоговорамиКлиент.ПроверитьВозможностьПодчинения(СтруктураТипЭлемента, СтрокаРодитель, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДереваЭтапов = Элементы.ДеревоЭтапов.ТекущийЭлемент;
	ИмяТекущегоЭлемента = ЭлементДереваЭтапов.Имя;
	Если СтрНайти(ИмяТекущегоЭлемента, "ПредставлениеЭтапа") Тогда
		Если ТекущиеДанные.ТипЭлемента = 3 
			Или ТекущиеДанные.ТипЭлемента = 4 
			Или ТекущиеДанные.ТипЭлемента = 5 
			ИЛИ ТекущиеДанные.ТипЭлемента = 6 Тогда	
		
			ЭлементДереваЭтапов.РедактированиеТекста = Ложь;
		Иначе 
			ЭлементДереваЭтапов.РедактированиеТекста = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭтаповПредставлениеЭтапаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Этап) Тогда 
		ПоказатьЗначение(, ТекущиеДанные.Этап);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеСоглашения

&НаКлиенте
Процедура ДополнительныеСоглашенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеСоглашения.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоПроектуТолькоСтруктуру(Команда)
		
	Режим = 1;
	РежимДоходыРасходы = Неопределено; // Только структура
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуДоходРасход(Команда)
	
	Режим = 1;
	РежимДоходыРасходы = 0; // Доходы+Расходы
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуДоход(Команда)
	
	Режим = 1;
	РежимДоходыРасходы = 1; // Доходы
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуРасход(Команда)
		
	Режим = 1;
	РежимДоходыРасходы = 2; // Расходы
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуПоКонтрагенту(Команда)
	
	Режим = 1;
	ДоговорДоходный = УсловияДоговораДоходные(Объект.ТипЮридическихУсловийДоговора);
	ДоговорРасходный = УсловияДоговораРасходные(Объект.ТипЮридическихУсловийДоговора);
	Если ДоговорДоходный И ДоговорРасходный Тогда
		РежимДоходыРасходы = 0; 
	ИначеЕсли ДоговорДоходный Тогда
		РежимДоходыРасходы = 1; 
	ИначеЕсли ДоговорРасходный Тогда 
		РежимДоходыРасходы = 2; 
	КонецЕсли;

	Объект.КонтрагентЗаполнения = Объект.Контрагент;           
	Если Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходный") Тогда
		Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагенту");
	ИначеЕсли Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.Доходный") Тогда
		Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйПоКонтрагенту");
	ИначеЕсли Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.Расходный") Тогда
		Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.РасходныйПоКонтрагенту");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Контрагент", Объект.КонтрагентЗаполнения);
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы, ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуПоКонтрагентуИДоговору(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоПроектуПоКонтрагентуИДоговоруЗавершение", ЭтотОбъект);
	ПараметрыФормыВыбора = Новый Структура;	
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект.ДоговорВзаиморасчетов);
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	ПараметрыФормыВыбора.Вставить("ЗаголовокФормыПодбора", НСтр("ru = 'Подбор договора контрагента'"));
	
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных;
	ЭлементНастройки = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементНастройки.ПравоеЗначение = Объект.Контрагент;
	ЭлементНастройки.Использование = Истина;
	ЭлементНастройки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ПараметрыФормыВыбора.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);

	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормыВыбора, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ПоказатьВводЗначения(ОписаниеОповещения, Объект.ДоговорВзаиморасчетов);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуПоКонтрагентуИДоговоруЗавершение(ДоговорВзаиморасчетов, ДополнительныеПараметры = Неопределено) Экспорт

	Если ДоговорВзаиморасчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Режим = 1;
	ДоговорДоходный = УсловияДоговораДоходные(Объект.ТипЮридическихУсловийДоговора);
	ДоговорРасходный = УсловияДоговораРасходные(Объект.ТипЮридическихУсловийДоговора);
	Если ДоговорДоходный И ДоговорРасходный Тогда
		РежимДоходыРасходы = 0; 
	ИначеЕсли ДоговорДоходный Тогда
		РежимДоходыРасходы = 1; 
	ИначеЕсли ДоговорРасходный Тогда 
		РежимДоходыРасходы = 2; 
	КонецЕсли;
	
	Объект.КонтрагентЗаполнения = Объект.Контрагент;
	Объект.ДоговорКонтрагентаЗаполнения = ДоговорВзаиморасчетов;
        
	Если Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходный") Тогда
		Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагентуИДоговору");
	ИначеЕсли Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.Доходный") Тогда
		Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйПоКонтрагентуИДоговору");
	ИначеЕсли Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.Расходный") Тогда
		Объект.ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.РасходныйПоКонтрагентуИДоговору");
	КонецЕсли;

	Если Не (ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) И Объект.ДетализацияПоДоговорамВзаиморасчетов) Тогда
		Объект.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
		Объект.ПоКаждомуЭтапуОтдельныйДоговорВзаиморасчетов = Ложь;
		Объект.ДетализацияПоДоговорамВзаиморасчетов = Истина;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура("Контрагент, ДоговорКонтрагента", Объект.КонтрагентЗаполнения, Объект.ДоговорКонтрагентаЗаполнения);
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуДоход(Команда)
	
	Режим = 2;
	РежимДоходыРасходы = 1; // Доходы
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуРасход(Команда)
		
	Режим = 2;
	РежимДоходыРасходы = 2; // Расходы
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуДоходРасход(Команда)
		
	Режим = 2;
	РежимДоходыРасходы = 0; // Доходы+Расходы
	ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаПонизитьУровеньЗадачи(Команда)
	
	Отказ = Ложь;
	ПроверитьВозможностьИзмененияУровня(Элементы, ДеревоЭтапов, 2, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	упоУправлениеДоговорамиКлиент.КомандаПонизитьУровеньЗадачи(Элементы, ДеревоЭтапов); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПовыситьУровеньЗадачи(Команда)
	
	Отказ = Ложь;
	ПроверитьВозможностьИзмененияУровня(Элементы, ДеревоЭтапов, 1, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	упоУправлениеДоговорамиКлиент.КомандаПовыситьУровеньЗадачи(Элементы, ДеревоЭтапов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьИзмененияУровня(Элементы, Дерево, Направление, Отказ) 
	
	ПерваяВыделенняСтрока = Элементы.ДеревоЭтапов.ВыделенныеСтроки[0];
	ПервыйСдвигаемыйЭлемент = Дерево.НайтиПоИдентификатору(ПерваяВыделенняСтрока);
	
	старыйРодитель = ПервыйСдвигаемыйЭлемент.ПолучитьРодителя();
		
	Если Направление = 1 Тогда
		новыйРодитель = Неопределено;		
		Если НЕ старыйРодитель = Неопределено Тогда
			новыйРодитель = старыйРодитель.ПолучитьРодителя();
			Если новыйРодитель = Неопределено Тогда
				новыйРодитель = Дерево;
			КонецЕсли; 			
			идВставки = новыйРодитель.ПолучитьЭлементы().Индекс(старыйРодитель) + 1;
		КонецЕсли;
	ИначеЕсли Направление = 2 Тогда
		новыйРодитель = упоОперацииСДеревьямиКлиент.ОпределитьПредыдущуюСтроку(Дерево, ПервыйСдвигаемыйЭлемент, СтарыйРодитель);
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоЭтапов.ВыделенныеСтроки Цикл
	
		СдвигаемыйЭлемент = Дерево.НайтиПоИдентификатору(ВыделеннаяСтрока); 
		
		Если НовыйРодитель <> Неопределено Тогда
			упоУправлениеДоговорамиКлиент.ПроверитьВозможностьПодчинения(СдвигаемыйЭлемент, НовыйРодитель, Отказ);
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтруктуруДоговора(Команда)
	
	Если Объект.ЭтоДополнительноеСоглашение Тогда
		КолонкиДляСверки = Новый Соответствие;
		КолонкиДляСверки.Вставить("УдаленныйЭтапВКалендарномПлане", Истина);
	Иначе
		КолонкиДляСверки = Неопределено;
	КонецЕсли;
	
	упоУправлениеДоговорамиКлиентСервер.СохранитьДеревоВТаблицу(ДеревоЭтапов, Объект,,, КолонкиДляСверки);
	
	ПараметрыФормы = Новый Структура("ОбъектДляИзменения", Объект);
	ПараметрыФормы.Вставить("ДоговорДоходный", УсловияДоговораДоходные(Объект.ТипЮридическихУсловийДоговора));
	ПараметрыФормы.Вставить("ДоговорРасходный", УсловияДоговораРасходные(Объект.ТипЮридическихУсловийДоговора)); 
	
	ОткрытьФорму("Обработка.упоНастройкаСвязей.Форма.НастройкиСвязей", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМодель(Команда)
	
	ДобавитьСтрокуЭтапа(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭтап(Команда)
	
	ДобавитьСтрокуЭтапа(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСравнениеВерсий(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Проект", Объект.Проект);
	
	ОткрытьФорму("Отчет.упоСравнениеВерсий.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСкользящийБДРОбъемыБДДС(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Проект", Объект.Проект);
	
	ОткрытьФорму("Отчет.упоСкользящийБДРОбъемыБДДС.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьДеревоЭтапов()
	
	Объект.Этапы.Очистить();
	Объект.ГрафикНачислений.Очистить();
	Объект.ГрафикОплаты.Очистить();
	Объект.СвязиЭтаповДоговораСПроектнымКонтуром.Очистить();
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДеревоЭтаповСервер()
	
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
	ДеревоДляЗаполнения = ДанныеФормыВЗначение(ДеревоЭтапов, Тип("ДеревоЗначений")); 
	Дерево = упоОперацииСДеревьямиСервер.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.Этапы, ДеревоДляЗаполнения,
		"ИндексСвязиЭтапа", "ИндексСвязиЭтапаРодитель", "Этап", "ЭтапРодитель");
	упоУправлениеДоговорамиСервер.ДобавитьВДеревоБДРиБДДС(Дерево, Объект.ГрафикНачислений, Объект.ГрафикОплаты);
	
	упоУправлениеДоговорамиСервер.ПроставитьКартинкиЭтапов(Дерево);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоЭтапов");
	
	ОбновитьСуммуДоговора(ДеревоЭтапов, Объект);
	
	Если Объект.ЭтоДополнительноеСоглашение Тогда
		ПроверитьИзмененныеУдаленныеЭтапы(Истина, Ложь);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.
	тОбъект = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);
	тОбъект.ОбработкаЗаполнения(ВыбранноеЗначение);
	ЗначениеВДанныеФормы(тОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция ОбработкаОповещения_ИзменениеДоговора_Сервер()
	
	ЭтаФорма.Прочитать();
	ЗаполнитьДеревоЭтаповСервер();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьУсловноеОформлениеФильтраИзмененныхЭтапов(Форма, ЭтоДополнительноеСоглашение, УсловноеОформлениеДляФильтраИзменений, ТолькоИзмененныеЭтапы)
	
	Если ЭтоДополнительноеСоглашение Тогда
		
		Если ЗначениеЗаполнено(УсловноеОформлениеДляФильтраИзменений) Тогда
			Для Каждого ЭлементУО Из УсловноеОформлениеДляФильтраИзменений Цикл
				Форма.УсловноеОформление.Элементы.Удалить(ЭлементУО.Значение);
			КонецЦикла;
		КонецЕсли;
		
		УсловноеОформление = Форма.УсловноеОформление;
		Элементы = Форма.Элементы;
		
		// Оформление для скрытия неизменнных этапов проекта в календарном плане.
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЭтапов.НеизмененныйЭтапВКалендарномПлане"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Истина;	
		ЭлементОтбора.Использование = Истина;
	
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЭтапов.Имя);
		ПолеОформления.Использование = Истина;
		СоздатьСписокПодчиненныхПолей(Элементы.ДеревоЭтапов, ЭлементОформления.Поля.Элементы);
		
		ЭлементОформления.Использование = ТолькоИзмененныеЭтапы;
		УсловноеОформлениеДляФильтраИзменений.Добавить(УсловноеОформление.Элементы.Индекс(ЭлементОформления));
		
		// Оформление для выделение серым удаленных этапов проекта в календарном плане.
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЭтапов.УдаленныйЭтапВКалендарномПлане");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Истина;	
		ЭлементОтбора.Использование = Истина;
	
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЭтапов.Имя);
		ПолеОформления.Использование = Истина;
		СоздатьСписокПодчиненныхПолей(Элементы.ДеревоЭтапов, ЭлементОформления.Поля.Элементы);
		
		ЭлементОформления.Использование = Не ТолькоИзмененныеЭтапы;
		УсловноеОформлениеДляФильтраИзменений.Добавить(УсловноеОформление.Элементы.Индекс(ЭлементОформления));

		// Оформление для скрытия удаленных этапов проекта в календарном плане.
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЭтапов.УдаленныйЭтапВКалендарномПлане");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Истина;	
		ЭлементОтбора.Использование = Истина;
	
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЭтапов.Имя);
		ПолеОформления.Использование = Истина;
		СоздатьСписокПодчиненныхПолей(Элементы.ДеревоЭтапов, ЭлементОформления.Поля.Элементы);
		
		ЭлементОформления.Использование = ТолькоИзмененныеЭтапы;
		УсловноеОформлениеДляФильтраИзменений.Добавить(УсловноеОформление.Элементы.Индекс(ЭлементОформления));

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура СоздатьСписокПодчиненныхПолей(ЭлементФормы, СписокПолей)

	Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда		
			ПолеОформления = СписокПолей.Добавить();

			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элемент.Имя);
			ПолеОформления.Использование = Истина;
		Иначе
			СоздатьСписокПодчиненныхПолей(Элемент, СписокПолей);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолей(РегулированиеТолькоПоТипуДоговора = Ложь)
		
	ДоговорДоходный = УсловияДоговораДоходные(Объект.ТипЮридическихУсловийДоговора);
	ДоговорРасходный = УсловияДоговораРасходные(Объект.ТипЮридическихУсловийДоговора);
						
	Элементы.ДеревоЭтаповДобавитьСтатьюБДР.Видимость = ДоговорДоходный;
	Элементы.ДеревоЭтаповДобавитьСтатьюПоступлений.Видимость = ДоговорДоходный;
	Элементы.ФормаЗаполнитьПоПроектуДоход.Видимость = ДоговорДоходный;
	Элементы.ФормаЗаполнитьПоШаблонуДоход.Видимость = ДоговорДоходный;
	
	Элементы.ДеревоЭтаповДобавитьСтатьюРасходов.Видимость = ДоговорРасходный;
	Элементы.ДеревоЭтаповДобавитьСтатьюВыплат.Видимость = ДоговорРасходный;
	Элементы.ФормаЗаполнитьПоПроектуРасход.Видимость = ДоговорРасходный;
	Элементы.ФормаЗаполнитьПоШаблонуРасход.Видимость = ДоговорРасходный;
	
	Элементы.ФормаЗаполнитьПоПроектуДоходРасход.Видимость = ДоговорДоходный И ДоговорРасходный;
	Элементы.ФормаЗаполнитьПоШаблонуДоходРасход.Видимость = ДоговорДоходный И ДоговорРасходный;
	
	Элементы.ФормаЗаполнитьПоПроектуПоКонтрагенту.Видимость = ДоговорДоходный Или ДоговорРасходный;
	ВведенКонтрагент = ЗначениеЗаполнено(Объект.Контрагент);
	Элементы.ФормаЗаполнитьПоПроектуПоКонтрагентуИДоговору.Видимость = ВведенКонтрагент И (ДоговорДоходный Или ДоговорРасходный);
	
	УстановитьДоступностьЭлементаИПодчиненных(Элементы.Заполнить, Объект.ИспользоватьЭтапы);
	
	Если РегулированиеТолькоПоТипуДоговора Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЭтоДополнительноеСоглашение Тогда
		Элементы.Группа1.Видимость = Ложь;	
		Элементы.ОсновныеШапка.Видимость = Ложь;
		Элементы.СтраницаДокументы.Видимость = Ложь;
		Элементы.ПоследнееДополнительноеСоглашение.Видимость = Ложь;
		
		ЭУСоздатьРегистрациюЮрУсловийНаОсновании = Элементы.Найти("ФормаДокументупоРегистрацияЮридическихУсловийДоговораСоздатьНаОсновании");
		Если НЕ ЭУСоздатьРегистрациюЮрУсловийНаОсновании = Неопределено Тогда
			ЭУСоздатьРегистрациюЮрУсловийНаОсновании.Видимость = Ложь;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = НСтр("ru = 'Дополнительное соглашение (создание)'");
		Иначе
			Заголовок = НСтр("ru = 'Дополнительное соглашение %1 от %2'");
		КонецЕсли;
	Иначе
		
		Элементы.ГруппаПроекта.Видимость = Ложь;
		Элементы.ТолькоИзмененныеЭтапы.Видимость = Ложь;
		
		ДокОснованиеЗаполнен = ЗначениеЗаполнено(Параметры.Ключ);
		ДополнительныеСоглашения.Параметры.УстановитьЗначениеПараметра("Договор", Параметры.Ключ);
		ДополнительныеСоглашения.Параметры.УстановитьЗначениеПараметра("ДокОснованиеЗаполнен", ДокОснованиеЗаполнен);
		
		ПоследнееДополнительноеСоглашение = Документы.упоРегистрацияЮридическихУсловийДоговора.ПолучитьПоследнийАктуальныйДокументИзмененияДоговора(Параметры.Ключ);
		ЕстьДопСоглашение = ЗначениеЗаполнено(ПоследнееДополнительноеСоглашение);
		
		Элементы.ИспользоватьЭтапы.Доступность = НЕ ЕстьДопСоглашение;
		Элементы.ДеревоЭтаповГруппаКоманд.Доступность = НЕ ЕстьДопСоглашение;
		Элементы.Добавить.Доступность = НЕ ЕстьДопСоглашение;
		Элементы.ДеревоЭтаповГруппаУровень.Доступность = НЕ ЕстьДопСоглашение;
		Элементы.Заполнить.Доступность = НЕ ЕстьДопСоглашение; 		
		Элементы.ПоследнееДополнительноеСоглашение.Видимость = ЕстьДопСоглашение;
		Элементы.ДеревоЭтапов.КоманднаяПанель.ТолькоПросмотр = ЕстьДопСоглашение;
		Элементы.ДеревоЭтапов.ТолькоПросмотр = ЕстьДопСоглашение;
		Элементы.ПараметрыГрафика.ТолькоПросмотр = ЕстьДопСоглашение;
		Элементы.ТипЮридическихУсловийДоговора.ТолькоПросмотр = ЕстьДопСоглашение;
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = НСтр("ru = 'Регистрация юридических условий договора (создание)'");
		Иначе
			Заголовок = НСтр("ru = 'Регистрация юридических условий договора %1 от %2'");
		КонецЕсли;	
		
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, СокрЛП(Объект.Номер), Строка(Объект.Дата));
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 
		ИспользоватьЭтапыОснование = Объект.ДокументОснование.ИспользоватьЭтапы;
	Иначе
		ИспользоватьЭтапыОснование = Ложь;
	КонецЕсли;
	
	Элементы.СуммаДоговора.Доступность 			= НЕ Объект.ИспользоватьЭтапы;
	Элементы.СуммаДоговораДопСоглашение.Доступность = НЕ ИспользоватьЭтапыОснование;
	Элементы.ЭтапыОсновногоДоговора.Видимость	= Объект.ИспользоватьЭтапы ИЛИ ИспользоватьЭтапыОснование;
	Элементы.ТолькоИзмененныеЭтапы.Пометка = Объект.ТолькоИзмененныеЭтапы;

КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ЗаполнитьПоПроектуШаблонуНаСервере(ДополнительныеПараметры)
	
	
	СтруктураДоговора = Новый Структура;
	Для Каждого ДопПараметр Из ДополнительныеПараметры Цикл
		Если ДопПараметр.Ключ = "Режим" Тогда
			Режим = ДополнительныеПараметры.Режим;
		ИначеЕсли ДопПараметр.Ключ = "ПроектШаблон" Тогда
			ПроектШаблон = ДополнительныеПараметры.ПроектШаблон;
		ИначеЕсли ДопПараметр.Ключ = "РежимДоходыРасходы" Тогда 
			РежимДоходыРасходы = ДополнительныеПараметры.РежимДоходыРасходы;
		Иначе
			СтруктураДоговора.Вставить(ДопПараметр.Ключ, ДопПараметр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДоговора.Вставить("Проект", Объект.Проект);
	СтруктураДоговора.Вставить("ДатаДокумента", Объект.Дата);
	СтруктураДоговора.Вставить("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
	СтруктураДоговора.Вставить("Валюта", Объект.Валюта);
	СтруктураДоговора.Вставить("Этапы", Объект.Этапы.Выгрузить());
	СтруктураДоговора.Вставить("ГрафикНачислений", Объект.ГрафикНачислений.Выгрузить());
	СтруктураДоговора.Вставить("ГрафикОплаты", Объект.ГрафикОплаты.Выгрузить());
	СтруктураДоговора.Вставить("СвязиЭтаповДоговораСПроектнымКонтуром", Объект.СвязиЭтаповДоговораСПроектнымКонтуром.Выгрузить());
	СтруктураДоговора.Вставить("РежимЗаполнения", РежимДоходыРасходы); // Непоределено - только структура; 0 - дходы+расходы; 1 - доходы; 2 - расходы;

	Если Режим = 1 Тогда
		упоУправлениеДоговорамиСервер.ЗаполнитьЮридическиеУсловияПоПроекту(ПроектШаблон, СтруктураДоговора);
	ИначеЕсли Режим = 2 Тогда
		упоУправлениеДоговорамиСервер.ЗаполнитьДоговорПоШаблону(ПроектШаблон, СтруктураДоговора);
	КонецЕсли;
	
	ДоговорОбъект = РеквизитФормыВЗначение("Объект");
	
	ДоговорОбъект.СхемаОплаты = Справочники.упоСхемыОплаты.ПустаяСсылка();
	ДоговорОбъект.Этапы.Загрузить(СтруктураДоговора.Этапы);	
	ДоговорОбъект.ГрафикНачислений.Загрузить(СтруктураДоговора.ГрафикНачислений);
	ДоговорОбъект.ГрафикОплаты.Загрузить(СтруктураДоговора.ГрафикОплаты); 	
	ДоговорОбъект.СвязиЭтаповДоговораСПроектнымКонтуром.Загрузить(СтруктураДоговора.СвязиЭтаповДоговораСПроектнымКонтуром);
	
	ЗначениеВРеквизитФормы(ДоговорОбъект, "Объект");

	ЗаполнитьДеревоЭтаповСервер();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуШаблону(Режим, РежимДоходыРасходы, ДопПараметры = Неопределено)
	
	Если НЕ Объект.ИспользоватьЭтапы И НЕ ИспользоватьЭтапыОснование Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Загрузка невозможна! В документе не используются этапы!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 	
	
	МассивТипов = Новый Массив;
	Если Режим = 1 Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Проекты"));
		Подсказка = НСтр("ru = 'Выберите проект'");
	ИначеЕсли Режим = 2 Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.упоШаблоныПроектов"));
		Подсказка = НСтр("ru = 'Выберите шаблон'");
	КонецЕсли;
	
	ПроектШаблон = Неопределено;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Режим",Режим);
	ДополнительныеПараметры.Вставить("РежимДоходыРасходы",РежимДоходыРасходы);
	ДополнительныеПараметры.Вставить("ПроектШаблон",ПроектШаблон);
	Если ДопПараметры <> Неопределено Тогда
		Для Каждого ДопЭлемент Из ДопПараметры Цикл
			ДополнительныеПараметры.Вставить(ДопЭлемент.Ключ, ДопЭлемент.Значение);
		КонецЦикла;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоПроектуШаблонуЗавершение",ЭтотОбъект,ДополнительныеПараметры);
	
	Если Объект.ЭтоДополнительноеСоглашение И Режим = 1 Тогда
	
		ПараметрыВыбораЗадачи = Новый Структура;
		ПараметрыВыбораЗадачи.Вставить("РежимВыбора", Истина);
		ПараметрыВыбораЗадачи.Вставить("ВыбиратьЗадачиИПроекты", Истина);
		ПараметрыВыбораЗадачи.Вставить("Отбор", Новый Структура("Организация", ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Организация")));

		ОткрытьФорму("Справочник.Проекты.ФормаСписка", ПараметрыВыбораЗадачи,,,,,ОписаниеОповещения);
		
	Иначе
		ПоказатьВводЗначения(ОписаниеОповещения, ПроектШаблон, Подсказка, Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуШаблонуЗавершение(ПроектШаблон, ДополнительныеПараметры) Экспорт
	
	Если ПроектШаблон = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Режим = 1 Тогда
		Если ЗначениеРеквизитаОбъекта(ПроектШаблон, "ЭтоПроектнаяЗадача") Тогда
			ПроектШаблон = ЗначениеРеквизитаОбъекта(ПроектШаблон, "упоКорневойПроект");
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ПроектШаблон", ПроектШаблон);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоПроектуШаблонуЗавершение2",ЭтотОбъект,ДополнительныеПараметры);
	ТекстВопроса = НСтр("ru = 'Графики будут перезаполнены. Продолжить?'");
	
	ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Да);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПроектуШаблонуЗавершение2(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоПроектуШаблонуНаСервере(ДополнительныеПараметры);
	
	упоУправлениеДоговорамиКлиент.ПересчитатьИтогиВсегоГрафикаДляУсловногоОформления(Объект);
	
	Модифицированность = Истина;
	
	Если ДополнительныеПараметры.Режим = 1 И НЕ Объект.ДоговорСвязанСНесколькимиПроектами Тогда
		Объект.Проект = ДополнительныеПараметры.ПроектШаблон;
	КонецЕсли;
	
	ОбновитьСуммуДоговора(ДеревоЭтапов, Объект);
		
	Если Не Объект.ЭтоДополнительноеСоглашение Тогда
		Если ДополнительныеПараметры.Режим = 1 Тогда
			Объект.Организация = ЗначениеРеквизитаОбъекта(ДополнительныеПараметры.ПроектШаблон, "Организация"); 
		Иначе
			Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	РазвернутьДерево();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуЭтапа(ТипЭлемента)
	
	// 0 - Модель
	// 1 - Этап
	// 2 - Пакет
	// 3 - Доход
	// 4 - Расход
	// 5 - Поступление
	// 6 - Выплата
	
	ТипДобавленногоЭлемента = ТипЭлемента;
	ТекущиеДанные = Элементы.ДеревоЭтапов.ТекущиеДанные; 
	
	Если ТекущиеДанные = Неопределено Тогда	
		Элементы.ДеревоЭтапов.ДобавитьСтроку();  
		Если ТекущиеДанные <> Элементы.ДеревоЭтапов.ТекущиеДанные Тогда
			НоваяСтрока = Элементы.ДеревоЭтапов.ТекущиеДанные;
			Если НоваяСтрока = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТекущиеДанные.ТипЭлемента = 1 И ТипДобавленногоЭлемента < 5
				Или ТекущиеДанные.ТипЭлемента = 0 И (ТипДобавленногоЭлемента = 3 Или ТипДобавленногоЭлемента = 4)
				Или ТекущиеДанные.ТипЭлемента = 3 И ТипДобавленногоЭлемента = 5 
				Или ТекущиеДанные.ТипЭлемента = 4 И ТипДобавленногоЭлемента = 6 Тогда
		НоваяСтрока = ТекущиеДанные.ПолучитьЭлементы().Добавить();
	Иначе
		Возврат;
	КонецЕсли;
	НоваяСтрока.ТипЭлемента = ТипДобавленногоЭлемента;
	Если ТипДобавленногоЭлемента = 0 Тогда
		НоваяСтрока.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
	ИначеЕсли ТипДобавленногоЭлемента = 1 Тогда
		НоваяСтрока.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Этап");  			
	КонецЕсли;
	НоваяСтрока.ИндексСвязиЭтапаРодитель = ?(ТекущиеДанные = Неопределено, 0, ТекущиеДанные.ИндексСвязиЭтапа);
	Если ТипДобавленногоЭлемента < 3 Тогда
		НоваяСтрока.ИндексСвязиЭтапа = НайтиМаксимальныйИндексСвязиЭтапов(ДеревоЭтапов.ПолучитьЭлементы()) + 1;
		ИндексСвязиЭтапов = НоваяСтрока.ИндексСвязиЭтапа;
	Иначе
		НоваяСтрока.ИндексСвязиЭтапа = НоваяСтрока.ИндексСвязиЭтапаРодитель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиМаксимальныйИндексСвязиЭтапов(СтрокиДерева)
	
	Если ИндексСвязиЭтапов > 0 Тогда
		Возврат ИндексСвязиЭтапов;
	КонецЕсли;
	
	МаксимальныИндекс = 0;
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		МаксимальныИндекс = Макс(МаксимальныИндекс, СтрокаДерева.ИндексСвязиЭтапа, НайтиМаксимальныйИндексСвязиЭтапов(СтрокаДерева.ПолучитьЭлементы()));
	КонецЦикла;
	
	Возврат МаксимальныИндекс;

КонецФункции	

&НаСервере
Функция ИзменениеПредставлениеДоговора(ИмяИзменяемогоРеквизита)
	
	// Обработчик механизма "Свойства"
	ОбновитьЭлементыДополнительныхРеквизитов();
	
	упоУправлениеДоговорамиСервер.УстановитьПредставлениеДоговора(Объект, ИмяИзменяемогоРеквизита);
	
КонецФункции

&НаСервере
Процедура КомандаРассчитатьНаСервере()
	
	упоУправлениеДоговорамиСервер.РассчитатьГрафикПлатежей(Объект);
	ЗаполнитьДеревоЭтаповСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатьюДоходов(Команда)
	
	ДобавитьСтрокуЭтапа(3);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатьюРасходов(Команда)
	
	ДобавитьСтрокуЭтапа(4);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатьюПоступления(Команда)
	
	ДобавитьСтрокуЭтапа(5);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтатьюВыплат(Команда)
	
	ДобавитьСтрокуЭтапа(6);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДокументОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.НадписьДокументОснованиеНажатие(Объект, ЭтаФорма, "ДокументОснование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоИзмененныеЭтапы(Команда)
	
	Объект.ТолькоИзмененныеЭтапы = Не Объект.ТолькоИзмененныеЭтапы;
	Элементы.ТолькоИзмененныеЭтапы.Пометка = Объект.ТолькоИзмененныеЭтапы;
	ПоказатьТолькоИзмененныеЭтапыНаСервере();
	 
	Если НеобходимоСверитьЭтапы И Элементы.ТолькоИзмененныеЭтапы.Пометка Тогда
		ПроверитьИзмененныеУдаленныеЭтапы(Истина);
		РазвернутьДерево();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьДеревоДляСверки(СтрокиДерева)
	
	Индекс = СтрокиДерева.Количество() - 1;	
	Пока Индекс >= 0 Цикл
		СтрокаДерева = СтрокиДерева.Получить(Индекс);
		Если СтрокаДерева.НеизмененныйЭтапВКалендарномПлане Тогда
			 СтрокаДерева.НеизмененныйЭтапВКалендарномПлане = Ложь;
		КонецЕсли;
		Если СтрокаДерева.УдаленныйЭтапВКалендарномПлане Тогда
			СтрокиДерева.Удалить(Индекс);
		Иначе
			ОчиститьДеревоДляСверки(СтрокаДерева.Строки)
		КонецЕсли;	
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИзмененныеУдаленныеЭтапы(ПересчитатьВетвиДерева = Ложь, ОчиститьДеревоДляСверки = Истина)
	
	ДеревоДляЗаполнения = ДанныеФормыВЗначение(ДеревоЭтапов, Тип("ДеревоЗначений")); 
	Если ОчиститьДеревоДляСверки Тогда
		ОчиститьДеревоДляСверки(ДеревоДляЗаполнения.Строки);
	КонецЕсли;
	
	ТаблицаСверкиЭтапов = Неопределено;
	ТаблицаСверкиГрафикОплаты = Неопределено;
	ТаблицаСверкиГрафикНачислений = Неопределено;

	КолонкиСверки = Новый Соответствие;
	КолонкиСверки.Вставить("ДатаНачала", Истина);
	КолонкиСверки.Вставить("ДатаОкончания", Истина);
	КолонкиСверки.Вставить("Сумма", Истина);

	ПолучитьТаблицаСверкиИзмененыхУдаленныхЭтапов(ТаблицаСверкиЭтапов, ТаблицаСверкиГрафикОплаты, ТаблицаСверкиГрафикНачислений);
	ДеревоДляЗаполнения = упоОперацииСДеревьямиСервер.ВыгрузитьТаблицуЗначенийВДеревоЗначений(ТаблицаСверкиЭтапов, ДеревоДляЗаполнения,
		"ИндексСвязиЭтапа", "ИндексСвязиЭтапаРодитель", "Этап", "ЭтапРодитель", КолонкиСверки, "НеизмененныйЭтапВКалендарномПлане");
	
	КолонкиСверкиБДР = Новый Соответствие;
	КолонкиСверкиБДР.Вставить("СхемаОплаты", Истина);
	КолонкиСверкиБДР.Вставить("Сумма", Истина);
	КолонкиСверкиБДР.Вставить("ДатаНачисления", Истина);
	
	КолонкиСверкиБДДС = Новый Соответствие;
	КолонкиСверкиБДДС.Вставить("СхемаОплаты", Истина);
	КолонкиСверкиБДДС.Вставить("Сумма", Истина);
	КолонкиСверкиБДДС.Вставить("ДатаОплаты", Истина);
	КолонкиСверкиБДДС.Вставить("Задержка", Истина);
	КолонкиСверкиБДДС.Вставить("ВидПривязки", Истина);

	СверкаВДеревеБДРиБДДС(ДеревоДляЗаполнения, ТаблицаСверкиГрафикНачислений, ТаблицаСверкиГрафикОплаты, "НеизмененныйЭтапВКалендарномПлане", "УдаленныйЭтапВКалендарномПлане", КолонкиСверкиБДР, КолонкиСверкиБДДС);
	ПроверитьИзмененияРодителейПоДетям(ДеревоДляЗаполнения.Строки);
	НеобходимоСверитьЭтапы = Ложь;
	
	упоУправлениеДоговорамиСервер.ПроставитьКартинкиЭтапов(ДеревоДляЗаполнения);
	ЗначениеВРеквизитФормы(ДеревоДляЗаполнения, "ДеревоЭтапов");
	
	Если ПересчитатьВетвиДерева Тогда
		упоУправлениеДоговорамиКлиентСервер.ПересчитатьВетвьДрева(ДеревоЭтапов.ПолучитьЭлементы())
	КонецЕсли;

	ДеревоДляЗаполнения = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИзмененияРодителейПоДетям(Дерево, Неизмененные = Истина)
	
	Для Каждого СтрокаДерева Из Дерево Цикл	
		Проверка = СтрокаДерева.НеизмененныйЭтапВКалендарномПлане;
		ПроверитьИзмененияРодителейПоДетям(СтрокаДерева.Строки, Проверка);
		Неизмененные = СтрокаДерева.НеизмененныйЭтапВКалендарномПлане И Неизмененные;		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Дерево.Родитель) Тогда
		Дерево.Родитель.НеизмененныйЭтапВКалендарномПлане = Дерево.Родитель.НеизмененныйЭтапВКалендарномПлане И Неизмененные;
		Неизмененные = Истина;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьТолькоИзмененныеЭтапыНаСервере()
	
	Для Каждого ЭлементСписка Из УсловноеОформлениеДляФильтраИзменений Цикл
		
		ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Получить(ЭлементСписка.Значение);
		ЭлементУО.Использование = Не ЭлементУО.Использование;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицаСверкиИзмененыхУдаленныхЭтапов(Этапы, ГрафикиОплаты, ГрафикНачислений)
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Договор = Документы.упоРегистрацияЮридическихУсловийДоговора.ПолучитьПоследнийАктуальныйДокументИзмененияДоговора(Объект.ДокументОснование, Объект.Ссылка);
	Иначе
		Договор = Документы.упоРегистрацияЮридическихУсловийДоговора.ПолучитьПоследнийАктуальныйДокументИзмененияДоговора(Объект.ДокументОснование);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Договор = Объект.ДокументОснование;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("СвязиЭтаповДоговораСПроектнымКонтуром", Объект.СвязиЭтаповДоговораСПроектнымКонтуром.Выгрузить());

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора КАК ЭтапДоговора,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.Проект КАК Проект,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ИндексСвязиЭтапа КАК ИндексСвязиЭтапа
	|ПОМЕСТИТЬ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром
	|ИЗ
	|	&СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Этапы.Этап КАК Этап,
	|	Этапы.ДатаНачала КАК ДатаНачала,
	|	Этапы.ДатаОкончания КАК ДатаОкончания,
	|	Этапы.Сумма КАК Сумма,
	|	Этапы.ЭтапРодитель КАК ЭтапРодитель,
	|	Этапы.ТипПроектнойЗадачи КАК ТипПроектнойЗадачи,
	|	ИСТИНА КАК УдаленныйЭтапВКалендарномПлане,
	|	Этапы.Ссылка КАК Ссылка,
	|	Этапы.ИндексСвязиЭтапа КАК ИндексСвязиЭтапа,
	|	Этапы.ИндексСвязиЭтапаРодитель КАК ИндексСвязиЭтапаРодитель
	|ПОМЕСТИТЬ Этапы
	|ИЗ
	|	Документ.упоРегистрацияЮридическихУсловийДоговора.Этапы КАК Этапы
	|ГДЕ
	|	Этапы.Ссылка В(&Договор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикНачислений.Этап КАК Этап,
	|	ГрафикНачислений.Статья КАК Статья,
	|	ГрафикНачислений.ВидДвижения КАК ВидДвижения,
	|	ГрафикНачислений.СхемаОплаты КАК СхемаОплаты,
	|	ГрафикНачислений.Сумма КАК Сумма,
	|	ГрафикНачислений.ДатаНачисления КАК ДатаНачисления,
	|	ГрафикНачислений.Примечание КАК Примечание,
	|	ГрафикНачислений.Ссылка КАК Ссылка,
	|	ГрафикНачислений.ИндексСвязиЭтапа КАК ИндексСвязиЭтапа
	|ПОМЕСТИТЬ ГрафикНачислений
	|ИЗ
	|	Документ.упоРегистрацияЮридическихУсловийДоговора.ГрафикНачислений КАК ГрафикНачислений
	|ГДЕ
	|	ГрафикНачислений.Ссылка В(&Договор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикОплаты.Этап КАК Этап,
	|	ГрафикОплаты.СтатьяБДР КАК СтатьяБДР,
	|	ГрафикОплаты.СхемаОплаты КАК СхемаОплаты,
	|	ГрафикОплаты.Статья КАК Статья,
	|	ГрафикОплаты.ВидДвижения КАК ВидДвижения,
	|	ГрафикОплаты.Сумма КАК Сумма,
	|	ГрафикОплаты.ДатаОплаты КАК ДатаОплаты,
	|	ГрафикОплаты.Задержка КАК Задержка,
	|	ГрафикОплаты.Примечание КАК Примечание,
	|	ГрафикОплаты.ВидПривязки КАК ВидПривязки,
	|	ГрафикОплаты.Ссылка КАК Ссылка,
	|	ГрафикОплаты.ИндексСвязиЭтапа КАК ИндексСвязиЭтапа
	|ПОМЕСТИТЬ ГрафикОплаты
	|ИЗ
	|	Документ.упоРегистрацияЮридическихУсловийДоговора.ГрафикОплаты КАК ГрафикОплаты
	|ГДЕ
	|	ГрафикОплаты.Ссылка В(&Договор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора КАК ЭтапДоговора,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.Проект КАК Проект,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.Ссылка КАК Ссылка,
	|	СвязиЭтаповДоговораСПроектнымКонтуром.ИндексСвязиЭтапа КАК ИндексСвязиЭтапа
	|ПОМЕСТИТЬ СвязиЭтаповДоговораСПроектнымКонтуром
	|ИЗ
	|	Документ.упоРегистрацияЮридическихУсловийДоговора.СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром
	|ГДЕ
	|	СвязиЭтаповДоговораСПроектнымКонтуром.Ссылка В(&Договор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА Этапы.Этап
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|	КОНЕЦ КАК Этап,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ИндексСвязиЭтапа
	|	КОНЕЦ КАК ИндексСвязиЭтапа,
	|	Этапы.ДатаНачала КАК ДатаНачала,
	|	Этапы.ДатаОкончания КАК ДатаОкончания,
	|	Этапы.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром1.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА Этапы.ЭтапРодитель
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром1.ЭтапДоговора
	|	КОНЕЦ КАК ЭтапРодитель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром1.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром1.ИндексСвязиЭтапа
	|	КОНЕЦ КАК ИндексСвязиЭтапаРодитель,
	|	Этапы.ТипПроектнойЗадачи КАК ТипПроектнойЗадачи,
	|	Этапы.УдаленныйЭтапВКалендарномПлане КАК УдаленныйЭтапВКалендарномПлане
	|ИЗ
	|	Этапы КАК Этапы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО Этапы.Ссылка = СвязиЭтаповДоговораСПроектнымКонтуром.Ссылка
	|			И Этапы.Этап = СвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром1
	|		ПО Этапы.Ссылка = СвязиЭтаповДоговораСПроектнымКонтуром1.Ссылка
	|			И Этапы.ЭтапРодитель = СвязиЭтаповДоговораСПроектнымКонтуром1.ЭтапДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром КАК ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО (СвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача = ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром КАК ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром1
	|		ПО (СвязиЭтаповДоговораСПроектнымКонтуром1.ПроектнаяЗадача = ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром1.ПроектнаяЗадача)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА ГрафикНачислений.Этап
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|	КОНЕЦ КАК Этап,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ИндексСвязиЭтапа
	|	КОНЕЦ КАК ИндексСвязиЭтапа,
	|	ГрафикНачислений.Статья КАК Статья,
	|	ГрафикНачислений.ВидДвижения КАК ВидДвижения,
	|	ГрафикНачислений.СхемаОплаты КАК СхемаОплаты,
	|	ГрафикНачислений.Сумма КАК Сумма,
	|	ГрафикНачислений.ДатаНачисления КАК ДатаНачисления,
	|	ГрафикНачислений.Примечание КАК Примечание,
	|	ГрафикНачислений.Ссылка КАК Ссылка
	|ИЗ
	|	ГрафикНачислений КАК ГрафикНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО ГрафикНачислений.Ссылка = СвязиЭтаповДоговораСПроектнымКонтуром.Ссылка
	|			И ГрафикНачислений.Этап = СвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром КАК ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО (СвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача = ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА ГрафикОплаты.Этап
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|	КОНЕЦ КАК Этап,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ИндексСвязиЭтапа
	|	КОНЕЦ КАК ИндексСвязиЭтапа,
	|	ГрафикОплаты.СтатьяБДР КАК СтатьяБДР,
	|	ГрафикОплаты.СхемаОплаты КАК СхемаОплаты,
	|	ГрафикОплаты.Статья КАК Статья,
	|	ГрафикОплаты.ВидДвижения КАК ВидДвижения,
	|	ГрафикОплаты.Сумма КАК Сумма,
	|	ГрафикОплаты.ДатаОплаты КАК ДатаОплаты,
	|	ГрафикОплаты.Задержка КАК Задержка,
	|	ГрафикОплаты.Примечание КАК Примечание,
	|	ГрафикОплаты.ВидПривязки КАК ВидПривязки,
	|	ГрафикОплаты.Ссылка КАК Ссылка
	|ИЗ
	|	ГрафикОплаты КАК ГрафикОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО ГрафикОплаты.Ссылка = СвязиЭтаповДоговораСПроектнымКонтуром.Ссылка
	|			И ГрафикОплаты.Этап = СвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром КАК ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО (СвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача = ТекущиеСвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача)";

	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Этапы = РезультатЗапроса[5].Выгрузить();
	ГрафикНачислений = РезультатЗапроса[6].Выгрузить();	
	ГрафикиОплаты = РезультатЗапроса[7].Выгрузить();	

КонецПроцедуры

&НаСервере
Процедура СверкаВДеревеБДРиБДДС(Дерево, ТаблицаБДР, ТаблицаБДДС, КолонкаРезультатаСравнения, КолонкаРезультатаПоиска, КолонкиСверкиБДР, КолонкиСверкиБДДС)
	
	// Дополняем дерево данными БДР и БДДС.
	
	// Типы элементов:
	// 0 - Модель
	// 1 - Этап
	// 2 - Пакет
	// 3 - Доход
	// 4 - Расход
	// 5 - Поступление
	// 6 - Выплата.

	// Заполнять будем с конца таблицы, потому что строки будут вставляться непосредственно под родителя,
	// таким образом порядок строк будет сохранен.
	СписокИндексовДляПовторногоПросмотра = Новый Массив;
	МассивПросмотренныхЭлементов = Новый Массив;
	ОтборСравнения = Новый Структура("Статья, ТипЭлемента, ВидДвижения, УдаленныйЭтапВКалендарномПлане");

	КоличествоПрогонов = ?(ЗначениеЗаполнено(КолонкаРезультатаСравнения) И ЗначениеЗаполнено(КолонкаРезультатаПоиска), 2, 1);
	
	Для Сч = 1 По КоличествоПрогонов Цикл
		Индекс = ТаблицаБДР.Количество() - 1;
		Пока Индекс >= 0 Цикл
			
			Если Сч > 1 И СписокИндексовДляПовторногоПросмотра.Найти(Индекс) = Неопределено Тогда
				Индекс = Индекс - 1;
				Продолжить;
			КонецЕсли;
			
			СтрокаБДР = ТаблицаБДР[Индекс];
			
			Отбор = Новый Структура();
			Если ЗначениеЗаполнено(СтрокаБДР.Этап) Тогда
				Отбор.Вставить("Этап", СтрокаБДР.Этап);
			Иначе
				Отбор.Вставить("ИндексСвязиЭтапа", СтрокаБДР.ИндексСвязиЭтапа);
			КонецЕсли;
			Отбор.Вставить("ТипЭлемента", 0);

			НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);  	
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Вставить("ТипЭлемента", 1);
				НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина); 
			КонецЕсли;
			Если НайденныеСтроки.Количество() = 0 Тогда
				РодительскаяСтрокаДерева = Дерево;
			Иначе	
				РодительскаяСтрокаДерева = НайденныеСтроки[0];	
			КонецЕсли;
			ДобавлениеНового = Истина;

			Если ЗначениеЗаполнено(КолонкаРезультатаСравнения) И ЗначениеЗаполнено(КолонкаРезультатаПоиска) Тогда 
				ОтборСравнения.Статья = СтрокаБДР.Статья;
				ОтборСравнения.УдаленныйЭтапВКалендарномПлане = Ложь;
				Если СтрокаБДР.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
					ОтборСравнения.ТипЭлемента = 3;
				Иначе
					ОтборСравнения.ТипЭлемента = 4;
				КонецЕсли;
				ОтборСравнения.ВидДвижения = СтрокаБДР.ВидДвижения;
				
				РезультатПоискаСравнения = РодительскаяСтрокаДерева.Строки.НайтиСтроки(ОтборСравнения, Ложь);
				СтрокаРассмотрена = Ложь;
				Для Каждого СтрокаПоиска Из РезультатПоискаСравнения Цикл
					Если СтрокаПоиска[КолонкаРезультатаСравнения] Или МассивПросмотренныхЭлементов.Найти(СтрокаПоиска) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					РезультатСравнения = Истина;
					
					ДобавлениеНового = Ложь;
					Если Сч = 1 Тогда
						Для Каждого ИмяКолонки Из КолонкиСверкиБДР Цикл
							Если ИмяКолонки.Ключ = "Сумма" Тогда
								ДопИмяКолонки = "СуммаБДР";
							ИначеЕсли ИмяКолонки.Ключ = "ДатаНачисления" Тогда
								ДопИмяКолонки = "ДатаНачисленияОплаты";
							Иначе
								ДопИмяКолонки = ИмяКолонки.Ключ;
							КонецЕсли;

							РезультатСравнения = РезультатСравнения И 
											Не (СтрокаПоиска[ДопИмяКолонки] <> СтрокаБДР[ИмяКолонки.Ключ] 
												И (ЗначениеЗаполнено(СтрокаПоиска[ДопИмяКолонки]) Или ЗначениеЗаполнено(СтрокаБДР[ИмяКолонки.Ключ])));
						КонецЦикла;	
						СтрокаПоиска[КолонкаРезультатаСравнения] = РезультатСравнения;	
						СтрокаРассмотрена = СтрокаРассмотрена Или РезультатСравнения;
					Иначе
						СтрокаРассмотрена = Истина;
						МассивПросмотренныхЭлементов.Вставить(СтрокаПоиска);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Не (СтрокаРассмотрена Или ДобавлениеНового) Тогда
					СписокИндексовДляПовторногоПросмотра.Вставить(Индекс);
				КонецЕсли;
			КонецЕсли;		
						
			Если ДобавлениеНового Тогда
				
				НоваяСтрока = РодительскаяСтрокаДерева.Строки.Вставить(0);
				
				НоваяСтрока.Этап = СтрокаБДР.Статья;
				НоваяСтрока.ЭтапРодитель = СтрокаБДР.Этап;
				НоваяСтрока.ИндексСвязиЭтапаРодитель = СтрокаБДР.ИндексСвязиЭтапа;
				НоваяСтрока.ПредставлениеЭтапа = СтрокаБДР.Статья;
				НоваяСтрока.Статья = СтрокаБДР.Статья;
				Если СтрокаБДР.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
					НоваяСтрока.ТипЭлемента = 3;
				Иначе
					НоваяСтрока.ТипЭлемента = 4;
				КонецЕсли;
				НоваяСтрока.ВидДвижения = СтрокаБДР.ВидДвижения;
				НоваяСтрока.СуммаБДР = СтрокаБДР.Сумма;
				НоваяСтрока.СхемаОплаты = СтрокаБДР.СхемаОплаты;
				НоваяСтрока.ДатаНачисленияОплаты = СтрокаБДР.ДатаНачисления;
				НоваяСтрока.Примечание = СтрокаБДР.Примечание;
				НоваяСтрока.ИндексСвязиЭтапа = СтрокаБДР.ИндексСвязиЭтапа;

				Если ЗначениеЗаполнено(КолонкаРезультатаПоиска) Тогда
			    	НоваяСтрока[КолонкаРезультатаПоиска] = Истина;
				КонецЕсли;
				
			КонецЕсли;
			Индекс = Индекс - 1;
				
		КонецЦикла;  	
	КонецЦикла;
	
	СписокИндексовДляПовторногоПросмотра = Новый Массив;
	МассивПросмотренныхЭлементов = Новый Массив;
	ОтборСравнения = Новый Структура("Статья, ТипЭлемента, ВидДвижения, УдаленныйЭтапВКалендарномПлане");
	Для Сч = 1 По КоличествоПрогонов Цикл

		Для Каждого СтрокаБДДС Из ТаблицаБДДС Цикл
			
			Если Сч > 1 И СписокИндексовДляПовторногоПросмотра.Найти(ТаблицаБДДС.Индекс(СтрокаБДДС)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Отбор = Новый Структура();
			Если ЗначениеЗаполнено(СтрокаБДДС.СтатьяБДР) Тогда
				Если ЗначениеЗаполнено(СтрокаБДДС.Этап) Тогда 
					Отбор.Вставить("ЭтапРодитель", СтрокаБДДС.Этап);
				Иначе
					Отбор.Вставить("ИндексСвязиЭтапаРодитель", СтрокаБДДС.ИндексСвязиЭтапа);
				КонецЕсли;
				Отбор.Вставить("Статья", СтрокаБДДС.СтатьяБДР);
				//Отбор.Вставить("СхемаОплаты", СтрокаБДДС.СхемаОплаты);
				Отбор.Вставить("ТипЭлемента", 3);
				НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);      
				Если ЗначениеЗаполнено(СтрокаБДДС.СтатьяБДР) И НайденныеСтроки.Количество() = 0 Тогда
					Отбор.Вставить("ТипЭлемента", 4);
				    НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(СтрокаБДДС.Этап) Тогда 
					Отбор.Вставить("Этап", СтрокаБДДС.Этап);
				Иначе
					Отбор.Вставить("ИндексСвязиЭтапа", СтрокаБДДС.ИндексСвязиЭтапа);
				КонецЕсли;
				Отбор.Вставить("ТипЭлемента", 0);
				НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);      
				Если НайденныеСтроки.Количество() = 0 Тогда
					Отбор.Вставить("ТипЭлемента", 1);
				    НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
				КонецЕсли;
			КонецЕсли;	
				
			Если НайденныеСтроки.Количество() = 0 Тогда
				РодительскаяСтрокаДерева = Дерево;
			Иначе
				РодительскаяСтрокаДерева = НайденныеСтроки[0];
			КонецЕсли;	
			ДобавлениеНового = Истина;

			// Если строка оплаты на одном уровне с этапами, то передвигаем ее вверх.
			Для ИндексДляВставки = 0 По РодительскаяСтрокаДерева.Строки.Количество() - 1 Цикл
				СоседняяСтрока = РодительскаяСтрокаДерева.Строки[ИндексДляВставки];
				Если СоседняяСтрока.ТипЭлемента = 0 ИЛИ СоседняяСтрока.ТипЭлемента = 1 Тогда
					Прервать;	
				КонецЕсли;
			КонецЦикла;
			
		    Если ЗначениеЗаполнено(КолонкаРезультатаСравнения) И ЗначениеЗаполнено(КолонкаРезультатаПоиска) Тогда 
				
				ОтборСравнения.Статья = СтрокаБДДС.Статья;
				ОтборСравнения.УдаленныйЭтапВКалендарномПлане = Ложь;
				Если СтрокаБДДС.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход 
					ИЛИ СтрокаБДДС.ВидДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление Тогда 
					ОтборСравнения.ТипЭлемента = 5;
				Иначе 
					ОтборСравнения.ТипЭлемента = 6;
				КонецЕсли;
				ОтборСравнения.ВидДвижения = СтрокаБДДС.ВидДвижения;
				
				РезультатПоискаСравнения = РодительскаяСтрокаДерева.Строки.НайтиСтроки(ОтборСравнения, Ложь);
				СтрокаРассмотрена = Ложь;

				Для Каждого СтрокаПоиска Из РезультатПоискаСравнения Цикл
					Если СтрокаПоиска[КолонкаРезультатаСравнения] Или МассивПросмотренныхЭлементов.Найти(СтрокаПоиска) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					РезультатСравнения = Истина;
					ДобавлениеНового = Ложь;
					Если Сч = 1 Тогда
						Для Каждого ИмяКолонки Из КолонкиСверкиБДДС Цикл
							Если ИмяКолонки.Ключ = "Сумма" Тогда
								ДопИмяКолонки = "СуммаБДДС";
							ИначеЕсли ИмяКолонки.Ключ = "ДатаОплаты" Тогда
								ДопИмяКолонки = "ДатаНачисленияОплаты";
							Иначе
								ДопИмяКолонки = ИмяКолонки.Ключ;
							КонецЕсли;
							
							РезультатСравнения = РезультатСравнения И 
											Не (СтрокаПоиска[ДопИмяКолонки] <> СтрокаБДДС[ИмяКолонки.Ключ] 
												И (ЗначениеЗаполнено(СтрокаПоиска[ДопИмяКолонки]) Или ЗначениеЗаполнено(СтрокаБДДС[ИмяКолонки.Ключ])));
						КонецЦикла;	
						СтрокаПоиска[КолонкаРезультатаСравнения] = РезультатСравнения;
						СтрокаРассмотрена = СтрокаРассмотрена Или РезультатСравнения;
					Иначе
						СтрокаРассмотрена = Истина;
						МассивПросмотренныхЭлементов.Вставить(СтрокаПоиска);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Не (СтрокаРассмотрена Или ДобавлениеНового) Тогда
					СписокИндексовДляПовторногоПросмотра.Вставить(ТаблицаБДДС.Индекс(СтрокаБДДС));
				КонецЕсли;
			КонецЕсли;		
						
			Если ДобавлениеНового Тогда
				НоваяСтрока = РодительскаяСтрокаДерева.Строки.Вставить(ИндексДляВставки);

				НоваяСтрока.Этап = СтрокаБДДС.Статья;
				НоваяСтрока.ЭтапРодитель = СтрокаБДДС.СтатьяБДР;
				НоваяСтрока.ПредставлениеЭтапа = СтрокаБДДС.Статья;
				НоваяСтрока.Статья = СтрокаБДДС.Статья;
				
				НоваяСтрока.ВидДвижения = СтрокаБДДС.ВидДвижения;
				Если СтрокаБДДС.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход 
					ИЛИ СтрокаБДДС.ВидДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление Тогда 
					НоваяСтрока.ТипЭлемента = 5;
				Иначе 
					НоваяСтрока.ТипЭлемента = 6;
				КонецЕсли;
					
				НоваяСтрока.СуммаБДДС = СтрокаБДДС.Сумма;
				НоваяСтрока.СхемаОплаты = СтрокаБДДС.СхемаОплаты;
				НоваяСтрока.ДатаНачисленияОплаты = СтрокаБДДС.ДатаОплаты;
				НоваяСтрока.Задержка = СтрокаБДДС.Задержка;
				НоваяСтрока.Примечание = СтрокаБДДС.Примечание;
				НоваяСтрока.ВидПривязки = СтрокаБДДС.ВидПривязки;
				НоваяСтрока.ИндексСвязиЭтапа = СтрокаБДДС.ИндексСвязиЭтапа;

				Если ЗначениеЗаполнено(КолонкаРезультатаПоиска) Тогда
			    	НоваяСтрока[КолонкаРезультатаПоиска] = Истина;
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Объект, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, ИмяРеквизита);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УсловияДоговораДоходные(ТипЮридическихУсловийДоговора) Экспорт
	
	Возврат ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходный")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.Доходный")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагенту")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагентуИДоговору")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйПоКонтрагенту")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйПоКонтрагентуИДоговору");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УсловияДоговораРасходные(ТипЮридическихУсловийДоговора) Экспорт
	
	Возврат ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходный") 
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.Расходный")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагенту")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.ДоходныйРасходныйПоКонтрагентуИДоговору")
	        Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.РасходныйПоКонтрагенту")
			Или ТипЮридическихУсловийДоговора = ПредопределенноеЗначение("Перечисление.упоТипыЮридическихУсловийДоговора.РасходныйПоКонтрагентуИДоговору");

КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементаИПодчиненных(Элемент, НовоеЗначение)
	
	Элемент.Доступность = НовоеЗначение;
	Если Элемент.Вид = ВидГруппыФормы.Подменю Тогда
		Для каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
			УстановитьДоступностьЭлементаИПодчиненных(ПодчиненныйЭлемент, НовоеЗначение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСуммуДоговора(ДеревоЭтапов, Объект)

	Если Не Объект.ИспользоватьЭтапы Тогда
		Возврат;
	КонецЕсли;	

	Объект.СуммаДоговора =
		упоУправлениеДоговорамиКлиентСервер.ПересчитатьВетвьДрева(ДеревоЭтапов.ПолучитьЭлементы())["СуммаБДР"];
    
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы()

	СтатусДоговора = упоУправлениеДоговорамиСервер.ПолучитьСтатусДоговора(Параметры.Ключ);	
	КонтрагентДоИзменения = Объект.Контрагент;
	
	ЗаполнитьДеревоЭтаповСервер();
	УстановитьВидимостьПолей();
	
	ЗаполнитьУсловноеОформлениеФильтраИзмененныхЭтапов(ЭтаФорма, Объект.ЭтоДополнительноеСоглашение, 
		УсловноеОформлениеДляФильтраИзменений, Объект.ТолькоИзмененныеЭтапы);
		
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		Объект.Валюта = ПараметрыСеанса.упоВалютаУправленческогоУчета;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаДоговора) Тогда
			Объект.ДатаДоговора = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтараяСхемаОплаты = Объект.СхемаОплаты;
	
КонецПроцедуры

#КонецОбласти
