
#Область ПрограммныйИнтерфейс

// Объединенная функция расчета смещения и проверки итогового результата.
//
// Параметры:
//  Календарь	 - СправочникСсылка.упоРабочиеКалендари - рабочий календарь.
// 
// Возвращаемое значение:
//  Булево - проверка результата пересчета.
//
Функция РассчитатьСмещенияДляКалендаряСПроверкой(Календарь) Экспорт 
	
	РассчитатьСмещенияДляКалендаря(Календарь);
	
	НуженРасчетСдвигов = НуженРасчетСдвигов(Календарь);
	
	Возврат НуженРасчетСдвигов;
	
КонецФункции

// Функция возвращает рабочий календарь на год, количество рабочих часов в дне.
//
// Параметры:
//  Календарь		 - СправочникСсылка.упоРабочиеКалендари	 - запрашиваемый календарь.
//  ТолькоРабочиеДни - Булево	 - флаг указывает на необходимость извлечь данные
//  	только по рабочим дням (ненулевое количество рабочих часов).
//  Смещения		 - Булево	 - флаг указывает на необходимость получать смещения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - колонки: День (Дата), КоличествоЧасов (Число).
//  Неопределено – нет сведений о календаре на запрашиваемый год.
//
Функция ПолучитьПолныйРабочийКалендарь(Календарь, ТолькоРабочиеДни = Ложь, Смещения = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Календарь) Тогда      
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь" , Календарь);
	Запрос.Текст = упоРабочиеКалендариСерверПовтИспСеанс.ПолучитьТекстЗапросаРабочегоКалендаря(Ложь, ТолькоРабочиеДни, Смещения);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено; // нет сведений
	КонецЕсли;
	
	ТаблицаДней = Результат.Выгрузить();
	ТаблицаДней.Индексы.Добавить("День");
	
	Возврат ТаблицаДней; 
	
КонецФункции

// Функция возвращает текст запроса рабочего календаря.
//
// Параметры:
//  ОтборПоПериоду    	- Булево - флаг указыват на необходимость отбора по периоду.
//  ТолькоРабочиеДни    - Булево - флаг указыват на необходимость извлечь данные
//						только по рабочим дням (ненулевое количество рабочих часов).
//  Смещения    		- Булево - флаг указыват на необходимость получать смещения.
//  
// Возвращаемое значение:
//	Строка - Текст запроса.
//
Функция ПолучитьТекстЗапросаРабочегоКалендаря(ОтборПоПериоду = Ложь, ТолькоРабочиеДни = Ложь, Смещения = Ложь) Экспорт
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Рег.День КАК День,
	               |	Рег.КоличествоЧасов КАК КоличествоЧасов
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	               |			,
	               |			Календарь = &Календарь
	               |				И (День МЕЖДУ &НачПериода И &КонПериода)) КАК Рег";
	
	Если Не ОтборПоПериоду Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (День МЕЖДУ &НачПериода И &КонПериода)", "");	
	КонецЕсли;
		
	Если Смещения Тогда
		МассивСтрок = Новый Массив;
		Для Каждого Ресурс Из Метаданные.РегистрыСведений.упоРабочиеКалендари.Ресурсы Цикл
			МассивСтрок.Добавить(Ресурс.Имя);	
		КонецЦикла;
		СтрокаСмещений = СтрСоединить(МассивСтрок, ", ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Рег.КоличествоЧасов КАК КоличествоЧасов", СтрокаСмещений); 
	КонецЕсли;
	
	Если ТолькоРабочиеДни Тогда
		ТекстЗапроса = ТекстЗапроса+ Символы.ПС + "ГДЕ Рег.КоличествоЧасов <> 0";		
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "УПОРЯДОЧИТЬ ПО День";

	Возврат ТекстЗапроса;
	
КонецФункции 

// Функция возвращает рабочий календарь на год, количество рабочих часов в дне.
//
// Параметры:
//  Календарь		 - СправочникСсылка.упоРабочиеКалендари	 - запрашиваемый календарь.
//  ГодКалендаря	 - Дата		 - день на год, кот. возвращается календарь.
//  ТолькоРабочиеДни - Булево	 - флаг указыват на необходимость извлечь данные
//  	только по рабочим дням (ненулевое количество рабочих часов).
//  Смещения		 - Булево	 - флаг указыват на необходимость получать смещения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - колонки: День (Дата), КоличествоЧасов (Число).
//  Неопределено – нет сведений о календаре на запрашиваемый год.
//
Функция ПолучитьРабочийКалендарь(Календарь, ГодКалендаря, ТолькоРабочиеДни = Ложь, Смещения = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ГодКалендаря) ИЛИ Не ЗначениеЗаполнено(Календарь) Тогда      
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь" , Календарь);
	Запрос.УстановитьПараметр("НачПериода", НачалоГода(ГодКалендаря));
	Запрос.УстановитьПараметр("КонПериода", КонецГода(ГодКалендаря));
	Запрос.Текст = упоРабочиеКалендариСерверПовтИспСеанс.ПолучитьТекстЗапросаРабочегоКалендаря(Истина, ТолькоРабочиеДни, Смещения);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено; // нет сведений
	КонецЕсли;
	
	ТаблицаДней = Результат.Выгрузить();
	ТаблицаДней.Индексы.Добавить("День");
	
	Возврат ТаблицаДней; 
	
КонецФункции

// Функция возвращает рабочий календарь на период, количество рабочих часов в дне.
//
// Параметры:
//  Календарь		 - СправочникСсылка.упоРабочиеКалендари	 - запрашиваемый календарь.
//  НачПериода		 - Дата									 - дата начала периода.
//  КонПериода		 - Дата									 - дата завершения периода.
//  ТолькоРабочиеДни - Булево								 - флаг указыват на необходимость извлечь данные
//  								только по рабочим дням (ненулевое количество рабочих часов).
//  Смещения		 - Булево								 - флаг указыват на необходимость получать смещения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений, Неопределено - структура колонок:
//  * День - Дата
//  * КоличествоЧасов - Число
//
Функция ПолучитьРабочийКалендарьНаПериод(Календарь, НачПериода, КонПериода, ТолькоРабочиеДни = Ложь, Смещения = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь" , Календарь);
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода", НачалоДня(КонПериода));
	Запрос.Текст = упоРабочиеКалендариСерверПовтИспСеанс.ПолучитьТекстЗапросаРабочегоКалендаря(Истина, ТолькоРабочиеДни, Смещения);
		
	Результат = Запрос.Выполнить();	
	Если Результат.Пустой() Тогда
		Возврат Неопределено; // нет сведений
	КонецЕсли;
	
	Возврат Результат.Выгрузить(); // таблица календаря на год
	
КонецФункции

#Область ОбработчикиРегламентныхЗаданий

// Обработчик регламентного задания расчета календарных сдвигов
// РегламентныеЗадания.упоОптимизацияРабочихКалендарей.
//
Процедура РассчитатьКалендарныеСдвигиПоЗаданию() Экспорт
	
	РЗ_ОптимизацияРабочихКалендарей = Метаданные.РегламентныеЗадания.упоОптимизацияРабочихКалендарей;
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РЗ_ОптимизацияРабочихКалендарей);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   упоРабочиеКалендари.Ссылка КАК Ссылка
	|ИЗ
	|   Справочник.упоРабочиеКалендари КАК упоРабочиеКалендари";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НужноРассчитатьСдвиги = НуженРасчетСдвигов(ВыборкаДетальныеЗаписи.Ссылка);
		Если НужноРассчитатьСдвиги Тогда
			РассчитатьСмещенияДляКалендаря(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура РассчитатьСмещенияДляКалендаря(Календарь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивЧасов = ПолучитьМассивЧасовСмещенийДляКалендаря(Календарь);
	
	ДоКонкретногоВремени = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь", Календарь);
	Запрос.Текст = "ВЫБРАТЬ
	|	упоРабочиеКалендариСрезПоследних.День КАК День,
	|	упоРабочиеКалендариСрезПоследних.Календарь КАК Календарь,
	|	упоРабочиеКалендариСрезПоследних.КоличествоЧасов КАК КоличествоЧасов,
	|	упоРабочиеКалендариСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
	|ГДЕ
	|	упоРабочиеКалендариСрезПоследних.Календарь = &Календарь
	|
	|УПОРЯДОЧИТЬ ПО
	|	День";
	
	Таблица = Запрос.Выполнить().Выгрузить();		
	
	счКолонок = 1;
	Для Каждого КоличествоЧасов Из МассивЧасов Цикл
		Таблица.Колонки.Добавить("Вперед" + Формат(счКолонок, "ЧН=; ЧГ=") + "Часы");
		Таблица.Колонки.Добавить("Вперед" + Формат(счКолонок, "ЧН=; ЧГ=") + "Дата");
		Таблица.Колонки.Добавить("Назад" + Формат(счКолонок, "ЧН=; ЧГ=") + "Часы");
		Таблица.Колонки.Добавить("Назад" + Формат(счКолонок, "ЧН=; ЧГ=") + "Дата");
		счКолонок = счКолонок + 1;
	КонецЦикла;
	
	ТаблицаРегистраторов = Таблица.Скопировать(, "Регистратор");
	ТаблицаРегистраторов.Свернуть("Регистратор");
	МассивРегистраторов = ТаблицаРегистраторов.ВыгрузитьКолонку("Регистратор");
	
	СделатьПроходПоТаблицеРасчетаСмещений(Таблица, МассивЧасов, 1, ДоКонкретногоВремени);
	СделатьПроходПоТаблицеРасчетаСмещений(Таблица, МассивЧасов, -1, ДоКонкретногоВремени);
	
	Для Каждого Регистратор Из МассивРегистраторов Цикл
		ТаблицаРегистратора = Таблица.Скопировать(Новый Структура("Регистратор", Регистратор));
		ТаблицаРегистратора.Колонки.Добавить("Период");
		ТаблицаРегистратора.Колонки.Добавить("Активность");
		ТаблицаРегистратора.ЗаполнитьЗначения(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "Дата"), "Период");
		ТаблицаРегистратора.ЗаполнитьЗначения(Истина, "Активность");
		НаборЗаписей = РегистрыСведений.упоРабочиеКалендари.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(ТаблицаРегистратора);
		НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьСмещенияДляВсехКалендарей() Экспорт
	
	Выборка = Справочники.упоРабочиеКалендари.Выбрать();
	Пока Выборка.Следующий() Цикл
		РассчитатьСмещенияДляКалендаря(Выборка.Ссылка);	
	КонецЦикла;
		
КонецПроцедуры

Процедура УдалитьДанныеСмещенийДляКалендаря(Календарь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивПолей = Новый Массив;
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.упоРабочиеКалендари.Ресурсы Цикл
		Если Ресурс.Имя = "КоличествоЧасов" Тогда 
			Продолжить;
		КонецЕсли;
		МассивПолей.Добавить(Ресурс.Имя);
	КонецЦикла;
	СтрокаПолей = СтрСоединить(МассивПолей, ", ");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь", Календарь);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоРабочиеКалендариСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
	               |ГДЕ
	               |	упоРабочиеКалендариСрезПоследних.Календарь = &Календарь
	               |	И упоРабочиеКалендариСрезПоследних.Вперед1Часы <> 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.упоРабочиеКалендари.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Таблица = НаборЗаписей.Выгрузить();
		Таблица.ЗаполнитьЗначения(Неопределено, СтрокаПолей);
		НаборЗаписей.Загрузить(Таблица);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция НуженРасчетСдвигов(Календарь) Экспорт
	
	Если Не ЗначениеЗаполнено(Календарь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь", Календарь);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	упоРабочиеКалендариСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
	               |ГДЕ
	               |	упоРабочиеКалендариСрезПоследних.Календарь = &Календарь
	               |	И упоРабочиеКалендариСрезПоследних.Вперед1Часы <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	упоРабочиеКалендариСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
	               |ГДЕ
	               |	упоРабочиеКалендариСрезПоследних.Календарь = &Календарь";
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	СдвигиРассчитаны = Не РезультатПакета[0].Пустой();
	СуществуетЗапись = Не РезультатПакета[1].Пустой();
	
	Возврат СуществуетЗапись И Не СдвигиРассчитаны;
	
КонецФункции

// Функция возвращает момент времени документа.
// 
// Параметры:
//  ДокументОбъект - ДокумнетОбъект - собственно, документ.
// 
// Возвращаемое значение:
//  Дата, МоментВремени - '00010101', если документ новый; МоментВремени, если документ уже записан.
// 
Функция обПолучитьМоментВремениДокумента(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.ЭтоНовый() Тогда
		Возврат '00010101'; // актуальная дата
	Иначе
		Возврат ДокументОбъект.МоментВремени(); // момент времени документа
	КонецЕсли;

КонецФункции

// Функция проверяет количество часов в сутках на корректность
// и в случае неверного значения ограничевает пользователя правильным диапазоном.
//
// Параметры:
//  КоличествоЧасов – Число - заданное пользователем количество часов в сутках.
//  
// Возвращаемое значение:
//   Число – откорректированное количество часов в сутках.
//
Функция обКонтролироватьКоличествоЧасовВСутках(Знач КоличествоЧасов) Экспорт

	// Ограничем пользователя правильным количеством часов в сутках.
	Если КоличествоЧасов > 24 Тогда // перебор
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введены некорректные данные! Количество часов не может быть больше 24.";
		Сообщение.Сообщить();
		Возврат 24;
	ИначеЕсли КоличествоЧасов < 0 Тогда // недобор
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введены некорректные данные! Количество часов не может быть меньше 0.";
		Сообщение.Сообщить();
		Возврат 0;
	Иначе // все хорошо
		Возврат КоличествоЧасов;
	КонецЕсли;

КонецФункции

// Функция пересчитывает количество из заданной единицы времени в часы
//
// Параметры:
//  Значение  – Число - значение заданной ед. времени.
//  ЕдВремени - СправочникСсылка.упоЕдиницыВремени - ссылка на заданную ед. времени.
//  
// Возвращаемое значение:
//   Число – пересчитанное количество заданной ед. времени в часы.
//
Функция обПересчитатьЕдВремениВЧасы(Значение, ЕдВремени) Экспорт
	
	Если Справочники.упоЕдиницыВремени.Час.Коэффициент <> 0 Тогда
		ЕдиницаИзмеренияЧас	= Справочники.упоЕдиницыВремени.Час;
		КоэффициентЕдиницаИзмеренияЧас = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмеренияЧас, "Коэффициент");	
		Возврат Окр(ЕдВремени.Коэффициент * Значение / КоэффициентЕдиницаИзмеренияЧас);
	Иначе
		Возврат 0; // на всякий пожарный.
	КонецЕсли;
	
КонецФункции

// Функция пересчитывает количество часов в заданную единицу времени
//
// Параметры:
//  Значение  – Число - значение в часах
//  ЕдВремени - СправочникСсылка.упоЕдиницыВремени - ссылка на заданную ед. времени.
//  
// Возвращаемое значение:
//   Число – пересчитанное количество заданной ед. времени в часы.
//
Функция обПересчитатьЕдВремениИзЧасов(Значение, ЕдВремени) Экспорт
	
	Если ЕдВремени.Коэффициент <> 0 Тогда
		ЕдиницаИзмеренияЧас	= Справочники.упоЕдиницыВремени.Час;
		КоэффициентЕдиницаИзмеренияЧас = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмеренияЧас, "Коэффициент");	
		Возврат  (Значение / ЕдВремени.Коэффициент) * КоэффициентЕдиницаИзмеренияЧас;
	Иначе
		Возврат 0; // на всякий пожарный.
	КонецЕсли;
	
КонецФункции

// Функция возвращает рабочий календарь на год, количество рабочих часов в дне.
//
// Параметры:
//  Календарь    		– СправочникСсылка.упоРабочиеКалендари - запрашиваемый календарь.
//  ГодКалендаря 		– Дата - день на год, кот. возвращается календарь.
//  ТолькоРабочиеДни    - Булево - флаг указыват на необходимость извлечь данные
//						только по рабочим дням (ненулевое количество рабочих часов).
//  
// Возвращаемое значение:
//	ТаблицаЗначений – струкутра колонок: День (Дата), КоличествоЧасов (Число).
//		Неопределено – нет сведений о календаре на запрашиваемый год.
//
Функция обПолучитьРабочийКалендарь(Календарь, ГодКалендаря, ТолькоРабочиеДни = Ложь) Экспорт
	
	Возврат упоРабочиеКалендариСерверПовтИспВыз.ПолучитьРабочийКалендарь(Календарь, НачалоГода(ГодКалендаря), ТолькоРабочиеДни);  
		
КонецФункции

// Функция возвращает рабочий календарь на период, количество рабочих часов в дне.
//
// Параметры:
//  Календарь			– СправочникСсылка.упоРабочиеКалендари - запрашиваемый календарь.
//  НачПериода			– Дата - дата начала периода.
//  КонПериода			– Дата - дата завершения периода.
//  ТолькоРабочиеДни    - Булево - флаг указыват на необходимость извлечь данные
//						только по рабочим дням (ненулевое количество рабочих часов).
//  
// Возвращаемое значение:
//	ТаблицаЗначений – струкутра колонок: День (Дата), КоличествоЧасов (Число).
//		Неопределено – нет сведений о календаре на запрашиваемый год.
//
Функция обПолучитьРабочийКалендарьНаПериод(Календарь, НачПериода, КонПериода, ТолькоРабочиеДни = Ложь) Экспорт
	
	Возврат упоРабочиеКалендариСерверПовтИспВыз.ПолучитьРабочийКалендарьНаПериод(Календарь, НачПериода, КонПериода, ТолькоРабочиеДни);
	
КонецФункции

// Функция добавляет к заданной дате заданное количество часов по заданному календарю.
// Внутри функция использует, подаваемый на вход, кэш данных дней календаря.
// При отсутствии необходимых данных, функция сама добавляет их в заданный кэш.
// 
// Параметры:
//  Календарь       – СправочникСсылка.упоРабочиеКалендари - рабочий календарь.
//  ДанныеКалендаря - ТаблицаЗначений - кэш данных календаря.
//  Дата            – Дата  дата к которой прибавляются часы.
//  КолЧасов        – Число - количество прибавляемых часов.
// 
// Возвращаемое значение:
//  Дата, новая дата, полученная в результате расчета.
//  Неопределено, нет календаря на запрашиваемый год.
// 
Функция обДобавитьКДатеПоКалендарю(Календарь, ДанныеКалендаря, Дата, Знач КолЧасов) Экспорт
	
	ДлинаСуток = 24 * 60 * 60;
	
	НоваяДата = Дата;
	
	Пока КолЧасов > 0 Цикл
	
		День = НачалоДня(НоваяДата);
		
		ДанныеДня = ДанныеКалендаря.Найти(День, "День");
		
		Если ДанныеДня = Неопределено Тогда
			
			ТаблицаКалендаря = упоРабочиеКалендариВызовСервера.обПолучитьРабочийКалендарь(Календарь, НачалоГода(День));
				
			Если ТаблицаКалендаря = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
				
			Для Каждого СтрокаТаблицы Из ТаблицаКалендаря Цикл
				НоваяСтрока = ДанныеКалендаря.Добавить();
				НоваяСтрока.День            = СтрокаТаблицы.День;
				НоваяСтрока.КоличествоЧасов = СтрокаТаблицы.КоличествоЧасов;
			КонецЦикла;
		
			ДанныеДня = ДанныеКалендаря.Найти(День, "День");
			
			Если ДанныеДня = Неопределено Тогда 
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		КолЧасовДня = ДанныеДня.КоличествоЧасов;
		
		Если КолЧасов > КолЧасовДня Тогда
			НоваяДата = НоваяДата + ДлинаСуток; // следующий день
			
			КолЧасов = КолЧасов - КолЧасовДня;
		Иначе
			КолЧасов = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат День;
	
КонецФункции

// Заменяет значение года в заданной дате на новое.
// 
// Параметры:
//  Дата – Дата - Дата, год которой подлежит замене.
//  Год  – Число- Год на который, изменяется значение даты.
//
// Возвращаемое значение:
//  Дата - полученная даты с новымзначение года.
// 
Функция обПолучитьДатуСНовымЗначениеГода(СтараяДата, НовоеЗначениеГода) Экспорт

	РазницаГодов = НовоеЗначениеГода - Год(СтараяДата);
	Возврат ДобавитьМесяц(СтараяДата, РазницаГодов * 12);

КонецФункции

// Функция возвращает дату завершения периода по заданной дате начала периода,
// по заданной длительности периода в часах, по заданному календарю.
//
// Параметры:
//  Календарь    – СправочникСсылка.упоРабочиеКалендари - запрашиваемый календарь.
//  НачПериода   – Дата - дата начала периода.
//  Длительность – Число - количество часов в периоде.
//  
// Возвращаемое значение:
//   Дата – дата завершения периода.
//   Неопределено – нет сведений о календаре на некоторый год в заданном периоде.
//
Функция обПолучитьКонецПериода(Календарь, НачПериода, Длительность) Экспорт
	
	ДлинаСуток = 24 * 60 * 60;
	
	День       = НачалоДня(НачПериода);
	ТекПериод  = '00010101';
	
	КолЧасов = Длительность;
	
	Пока КолЧасов > 0 Цикл
	
		Если ТекПериод <> НачалоГода(День) Тогда
			
			ТекПериод = НачалоГода(День);
			
			ТаблицаКалендаря = упоРабочиеКалендариВызовСервера.обПолучитьРабочийКалендарь(Календарь, ТекПериод);
			
			Если ТаблицаКалендаря = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
		
		КонецЕсли;
		
		СтрокаКалендаря = ТаблицаКалендаря.Найти(День, "День");
		
		Если Не СтрокаКалендаря = Неопределено Тогда 
			КолЧасовДня = СтрокаКалендаря.КоличествоЧасов;
		Иначе		
			КолЧасовДня = 0;
		КонецЕсли;
		
		Если КолЧасов > КолЧасовДня Тогда
			День = День + ДлинаСуток; // следующий день
			
			КолЧасов = КолЧасов - КолЧасовДня;
		Иначе
			День = День + КолЧасов * 60 * 60;
			КолЧасов = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат День;
	
КонецФункции

// Сервисная функция, добавляет к заданной дате один полный день.
// 
// Параметры:
//  Дата – Дата, дата к которой прибавляются сутки.
// 
// Возвращаемое значение:
//  Дата, новая дата, полученная в результате расчета.
// 
Функция обДобавитьДень(Дата) Экспорт
	
	Возврат Дата + 60 * 60 * 24;
	
КонецФункции

// Рассчитывает количество рабочих дней и рабочих часов по 
// указанному рабочему календарю за период.
//
// Параметры:
//  РабочийКалендарь  – Справочник.упоРабочиеКалендари - собственно календарь.
//  ДатаНачала		  – Дата - начало периода.
//  ДатаКонца		  – Дата - конец периода.
//
// Возвращаемое значение:
//   Структура   – содержит поля с количеством часов и дней.
//
Функция обКоличествоРабочихДнейИЧасовВПериоде(РабочийКалендарь, ДатаНачала, ДатаКонца) Экспорт

	Результат = Новый Структура();
	Результат.Вставить("КоличествоДней", 0);
	Результат.Вставить("КоличествоЧасов", 0);
	
	КолСекундВЧасе = 3600;

	КолЧасовПоКалендарю_ДатаКонца = КоличествоРабочихЧасовВДне(РабочийКалендарь, ДатаКонца);
		
	Если НачалоДня(ДатаНачала) = НачалоДня(ДатаКонца) Тогда 
		
		Если КолЧасовПоКалендарю_ДатаКонца <> 0 Тогда
			Результат.КоличествоЧасов = (ДатаКонца - НачалоДня(ДатаКонца)) / КолСекундВЧасе;
			Результат.КоличествоДней = Результат.КоличествоЧасов / КолЧасовПоКалендарю_ДатаКонца;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	КонецДняДоДатыЗавершения = НачалоДня(ДатаКонца)-1; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегКалендарь.Календарь КАК РабочийКалендарь,
	               |	СУММА(РегКалендарь.КоличествоЧасов) КАК КоличествоЧасов,
	               |	КОЛИЧЕСТВО(РегКалендарь.День) КАК КоличествоДней
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	               |			,
	               |			Календарь = &РабочийКалендарь
	               |				И (День МЕЖДУ &ДатаНачала И &ДатаКонца)) КАК РегКалендарь
	               |ГДЕ
	               |	РегКалендарь.КоличествоЧасов > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РегКалендарь.Календарь";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("РабочийКалендарь", РабочийКалендарь);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДняДоДатыЗавершения);	
			
	Если КолЧасовПоКалендарю_ДатаКонца = 0 Тогда
		ЧасыКДобавлению = 0;
	Иначе
		ЧасыКДобавлению = Окр((ДатаКонца - НачалоДня(ДатаКонца)) / КолСекундВЧасе, 2);
	КонецЕсли;
	
	Если ЧасыКДобавлению > КолЧасовПоКалендарю_ДатаКонца Тогда
		ЧасыКДобавлению = КолЧасовПоКалендарю_ДатаКонца;	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕдиницаИзмеренияДень = Справочники.упоЕдиницыВремени.РабочийДень;
	КоэффициентЕдиницаИзмеренияДень	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмеренияДень, "Коэффициент");
	
	Если КоэффициентЕдиницаИзмеренияДень = 0 Тогда
		ТекстИсключения = НСтр("ru = 'Не установлен коэффициент предопределенной единицы времени ""Рабочий день"".'");		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.КоличествоДней = ЧасыКДобавлению / КоэффициентЕдиницаИзмеренияДень;
		Результат.КоличествоЧасов = ЧасыКДобавлению;	
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат.КоличествоДней = Выборка.КоличествоДней + ЧасыКДобавлению / КоэффициентЕдиницаИзмеренияДень;
		Результат.КоличествоЧасов = Выборка.КоличествоЧасов + ЧасыКДобавлению;		
	КонецЕсли;	 
	
	Возврат Результат;
	
КонецФункции
 
// Функция распределяет некое числовое значение по профилу с учетом календаря.
//
// Параметры:
//	Значение 				- Число 		– некое значение, которое необходимо распределить по периоду.
//	ПрофильРаспределения 	- Неизвестно	– описаниеПараметра.
//	Календарь 				- СправочникСсылка.упоРабочиеКалендари – календарь.
//	ДатаНачала 				- Дата			– начало периода.
//	ДатаЗавершения 			- Дата 			– конец периода.
//
// Возвращаемое значение:
//	ТаблицаЗначений – таблица, где по каждому дню выполнено распределение числового значения. Колонки:
//		* День			- Дата  - день
//		* Количество 	- Число - количество.
//
Функция обРаспределитьПоПрофилю(Знач Значение,
								Знач Календарь,
								ДатаНачала,
								ДатаЗавершения,
								ПрофильРаспределения = Неопределено) Экспорт 
								
	РезультатРаспределения = Новый ТаблицаЗначений;
	РезультатРаспределения.Колонки.Добавить("День");
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);

	РезультатРаспределения.Колонки.Добавить("Количество", ОписаниеТиповЧ);
	Ошибки = Неопределено;
	
	Если ПрофильРаспределения = Неопределено Тогда // выполним равномерное распределение
		
		новСтрока = Неопределено;
		
		ДанныеПериода = упоРабочиеКалендариВызовСервера.обКоличествоРабочихДнейИЧасовВПериоде(Календарь, ДатаНачала, ДатаЗавершения);
		ОбщееКоличествоЧасов = ДанныеПериода.КоличествоЧасов;
		
		ТаблицаКалендаря = упоРабочиеКалендариСерверПовтИспВыз.ПолучитьРабочийКалендарь(Календарь, ДатаНачала, Ложь, Ложь);
		Если ТаблицаКалендаря = Неопределено Тогда
			Возврат Новый ТаблицаЗначений;
		КонецЕсли;
		
		строкадня = ТаблицаКалендаря.Найти(НачалоДня(ДатаНачала), "День");
		индексСтроки = ТаблицаКалендаря.Индекс(строкадня);
		
		ОстатокКРаспределению = Значение;
		
		Пока строкадня.День <= ДатаЗавершения И (ОстатокКРаспределению >0) Цикл
			Если строкадня.КоличествоЧасов > 0 Тогда
				новСтрока = РезультатРаспределения.Добавить();
				новСтрока.День = строкадня.День;
				КоличествоКРаспределению = Мин(Значение / ОбщееКоличествоЧасов * строкадня.КоличествоЧасов,ОстатокКРаспределению);
				
				новСтрока.Количество = КоличествоКРаспределению;
				
				ОстатокКРаспределению = ОстатокКРаспределению - новСтрока.Количество;
			КонецЕсли;
			
			индексСтроки = индексСтроки + 1;
			Если индексСтроки > ТаблицаКалендаря.Количество() - 1 Тогда
				сохрДень = строкадня.День;
				Если НЕ упоРасчетКалендарныхСроковРедакция3Сервер.временноУвеличитьКалендарь(ТаблицаКалендаря,
					ДобавитьМесяц(строкадня.День, 1), Календарь, Ошибки) Тогда
					
					Возврат Новый ТаблицаЗначений;
					
				КонецЕсли;
				
				строкадня = ТаблицаКалендаря.Найти(сохрДень, "День");
				Если строкадня = Неопределено Тогда
					Возврат Новый ТаблицаЗначений;
				КонецЕсли;
				индексСтроки = ТаблицаКалендаря.Индекс(строкадня) + 1;
			КонецЕсли;
			строкаДня = ТаблицаКалендаря.Получить(индексСтроки);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОстатокКРаспределению) И ЗначениеЗаполнено(новСтрока) Тогда
			новСтрока.Количество = новСтрока.Количество + ОстатокКРаспределению;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатРаспределения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМассивЧасовСмещенийДляКалендаря(Календарь)
	
	СписокЧасов = Новый Массив;
	
	СписокЧасов.Добавить(40);	
	СписокЧасов.Добавить(80);	
	СписокЧасов.Добавить(160);	
	СписокЧасов.Добавить(320);	
	
	Возврат СписокЧасов;

КонецФункции 

Процедура СделатьПроходПоТаблицеРасчетаСмещений(Таблица, МассивЧасов, Направление = 1, ДоКонкретногоВремени) 
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиВОбработке = Новый Массив;
	
	Если Направление = 1 Тогда
		Префикс = "Вперед";
		ТекИндекс = 0; 
		КонечныйИндекс = Таблица.Количество();
	Иначе
		Префикс = "Назад";
		ТекИндекс = Таблица.Количество() - 1;
		КонечныйИндекс = -1;
	КонецЕсли;
	
	
	Пока ТекИндекс <> КонечныйИндекс Цикл	
		
		СтрокаТаблицы = Таблица[ТекИндекс];
		
		Если НЕ СтрокаТаблицы.КоличествоЧасов = 0 Тогда
			
			УдалитьИзОбработки = Новый Массив;
			
			счОбработка = СтрокиВОбработке.ВГраница();
			
			Пока счОбработка >= 0 Цикл
				
				ДанныеСтроки = СтрокиВОбработке[счОбработка]; 
				
				Если СтрокаТаблицы.КоличествоЧасов >= ДанныеСтроки.Часы Тогда
					
					Если ДоКонкретногоВремени Тогда
						КоличествоЧасов = ДанныеСтроки.ВсегоЧасов;
						Если Направление = 1 Тогда
							НужнаяДата = СтрокаТаблицы.День + 3600 * ДанныеСтроки.Часы;  
						Иначе
							НужнаяДата = СтрокаТаблицы.День + 3600 * (СтрокаТаблицы.КоличествоЧасов - ДанныеСтроки.Часы);
						КонецЕсли;
					Иначе  
						НужнаяДата = СтрокаТаблицы.День; 
						Если Направление = 1 Тогда						 
							КоличествоЧасов = ДанныеСтроки.ВсегоЧасов - ДанныеСтроки.Часы;  
						Иначе
							КоличествоЧасов = ДанныеСтроки.ВсегоЧасов + (СтрокаТаблицы.КоличествоЧасов - ДанныеСтроки.Часы);
						КонецЕсли;
					КонецЕсли;
					
					ДанныеСтроки.Строка[Префикс + Формат(ДанныеСтроки.НомерПоля, "ЧН=; ЧГ=") + "Дата"] = НужнаяДата;
					ДанныеСтроки.Строка[Префикс + Формат(ДанныеСтроки.НомерПоля, "ЧН=; ЧГ=") + "Часы"] = КоличествоЧасов;
					
					СтрокиВОбработке.Удалить(счОбработка);
					
				Иначе
					
					ДанныеСтроки.Часы = ДанныеСтроки.Часы - СтрокаТаблицы.КоличествоЧасов;	
					
				КонецЕсли;
				
				счОбработка = счОбработка - 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		счКолонок = 1;
		Для Каждого КоличествоЧасов Из МассивЧасов Цикл
			Если Направление = 1 Тогда
				СтрокиВОбработке.Добавить(Новый Структура("Строка, Часы, ВсегоЧасов, НомерПоля", СтрокаТаблицы, КоличествоЧасов - СтрокаТаблицы.КоличествоЧасов, КоличествоЧасов, счКолонок));	
			Иначе
				СтрокиВОбработке.Добавить(Новый Структура("Строка, Часы, ВсегоЧасов, НомерПоля", СтрокаТаблицы, КоличествоЧасов, КоличествоЧасов, счКолонок));	
			КонецЕсли;
			счКолонок = счКолонок + 1;
		КонецЦикла;
		
		ТекИндекс = ТекИндекс + Направление;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КоличествоРабочихЧасовВДне(РабочийКалендарь, Дата)
		
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегКалендарь.КоличествоЧасов КАК КоличествоЧасов
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	               |			,
	               |			Календарь = &РабочийКалендарь
	               |				И День = &Дата) КАК РегКалендарь";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
    Запрос.УстановитьПараметр("РабочийКалендарь", РабочийКалендарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()Тогда
		КоличествоРабЧасов = 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		КоличествоРабЧасов = Выборка.КоличествоЧасов;
	КонецЕсли;
	
	Возврат КоличествоРабЧасов;
	
КонецФункции

#КонецОбласти
