////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции подбора в ТЧ.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму подбора в табличную часть произвольного объекта.
//
// Параметры:
//  ПолноеИмяОбъекта	 - Строка	 	- имя подбираемого объекта. Шаблон строки: "Справочники.упоШаблоныПроектныхЗадач".
//  ВладелецФормы		 - Произвольный	- элемент управления-таблица формы, в которую осуществляется подбор.
//  РасширенныеПараметры - Строка		- содержит адрес временного хранилища, полученный при помощи метода 
//										  "ПоместитьВоВременноеХранилище". Содержит параметры, которые нельзя
//										  передать с клиента на сервер. Необязательный.
//  КлючФормы			 - УникальныйИдентификатор - уникальный идентификатор формы-владельца.
//  	  
Процедура ПодборВТабличнуюЧасть(ПолноеИмяОбъекта, ВладелецФормы, РасширенныеПараметры = "", КлючФормы) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	
	Если РасширенныеПараметры <> "" Тогда
		ПараметрыФормы.Вставить("РасширенныеПараметры", РасширенныеПараметры);
	КонецЕсли;
	ОкнаКлиентскогоПриложения = ПолучитьОкна();
	
	ОкноНайдено = Ложь;
	ПерерисоватьОкно = Ложь;   
	
	Для Каждого ОткрытоеОкно Из ОкнаКлиентскогоПриложения Цикл
		
		Если ОткрытоеОкно.Основное Тогда
			
			// Главное окно нам точно не нужно.
			Продолжить;
			
		КонецЕсли;
		
		СодержимоеОкна = ОткрытоеОкно.ПолучитьСодержимое();
		
		Если СодержимоеОкна <> Неопределено Тогда
			
			Если СодержимоеОкна.КлючУникальности = КлючФормы Тогда
				
				ПозицияТочка = Найти(ПолноеИмяОбъекта, ".");
				НовоеИмяОбъектаПодбора =  Сред(ПолноеИмяОбъекта, ПозицияТочка + 1);
				
				Если СодержимоеОкна.ВладелецФормы <> ВладелецФормы
					Или СодержимоеОкна.ИмяОбъектаПодбора <>  НовоеИмяОбъектаПодбора Тогда
					
					ПерерисоватьОкно = Истина;
					
				КонецЕсли;
				
				ОкноНайдено = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОкноНайдено = Ложь Тогда
		
		ОткрытьФорму("Обработка.упоПодборТабличнойЧасти.Форма.ФормаУправляемая", ПараметрыФормы, ВладелецФормы, КлючФормы);
		
	Иначе
		
		Если ПерерисоватьОкно Тогда
			ПараметрыФормы.Вставить("ВладелецФормы", ВладелецФормы);		 
			Оповестить("СменаВладельцаФормыПодбора", ПараметрыФормы,  СодержимоеОкна);
		КонецЕсли;
		
		ОткрытьФорму(СодержимоеОкна, ОткрытоеОкно);		
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка выбора табличной части, в которую осуществляется подбор.
//
// Параметры:
//  ВыбранноеЗначение	 - СписокЗначений	 - совпадает с аналогичным параметром события "Обработка выбора" ТЧ.
//  ИмяКолонки			 - Строка			 - имя колонки табличной части, в которую осуществляется подбор.
//  ТаблицаОбъекта		 - ДанныеФормыКоллекция	 - таблица объекта, в которую осуществляется подбор.
//  Форма				 - УправляемаяФорма		 - владелец элемента управления.
//  ДовыполнитьПодбор	 - Булево				 - признак необходимости довыполнить подбор, используя экспортную процедуру
//  	ВыполнитьДействияПриПодборе формы, которая вызывается для каждого значения из ВыбранноеЗначение.
//  ПараметрыПодбора	 - Произвольный			 - параметры, используемые для дополнительного подбора.
//  ПовторныйВыбор		 - Булево				 - признак необходимости проверять выбирается ли значение повторно и добавлять его.
//  ДопОтбор			 - Структура, Неопределенно
//
Процедура ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение,
										ИмяКолонки,
										ТаблицаОбъекта,
										Форма,
										ДовыполнитьПодбор = Ложь,
										ПараметрыПодбора = Неопределено,
										ПовторныйВыбор = Ложь,
										ДопОтбор = Неопределено) Экспорт 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		
		МассивИндексовНаУдаление = Новый Массив;
		МассивЭлементовНаУдаление = Новый Массив;
		
		Для Каждого ЭлементНаУдаление Из ВыбранноеЗначение Цикл
			
			Если ЭлементНаУдаление.Пометка = Ложь И ТипЗнч(ЭлементНаУдаление.Значение) = Тип("Число") Тогда
				
				СтрокаНаУдаление = ТаблицаОбъекта.НайтиПоИдентификатору(ЭлементНаУдаление.Значение);
				
				МассивИндексовНаУдаление.Добавить(СтрокаНаУдаление);
				МассивЭлементовНаУдаление.Добавить(ЭлементНаУдаление);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ИндексНаУдаление Из МассивИндексовНаУдаление Цикл
			
			ТаблицаОбъекта.Удалить(ТаблицаОбъекта.Индекс(ИндексНаУдаление));
			
		КонецЦикла;
		
		Для Каждого ЭлементНаУдаление Из МассивЭлементовНаУдаление Цикл
			
			ВыбранноеЗначение.Удалить(ЭлементНаУдаление);
			
		КонецЦикла;
		
		Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
			
			Если упоПодборВТабличнуюЧастьСервер.ЭтоНеГруппа(ВыбранныйЭлемент.Значение) Тогда
				
				Добавлять = Истина;
				
				Если НЕ ПовторныйВыбор Тогда
					
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить(ИмяКолонки, ВыбранныйЭлемент.Значение);
					Если ТипЗнч(ДопОтбор) = Тип("Структура") Тогда
						Для Каждого СтрокаОтбора Из ДопОтбор Цикл
							СтруктураОтбора.Вставить(СтрокаОтбора.Ключ, СтрокаОтбора.Значение);
						КонецЦикла;	
					КонецЕсли;	
					
					Добавлять = ТаблицаОбъекта.НайтиСтроки(СтруктураОтбора).Количество() = 0;
					
				КонецЕсли;
				
				Если Добавлять Тогда
					
					НоваяСтрока = ТаблицаОбъекта.Добавить();
					НоваяСтрока[ИмяКолонки]= ВыбранныйЭлемент.Значение;
					Форма.Модифицированность = Истина;
					
					Если ДовыполнитьПодбор Тогда
						
						Форма.ВыполнитьДействияПриПодборе(НоваяСтрока, ПараметрыПодбора);
						
					КонецЕсли;
					
				КонецЕсли;		
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает при окончании перетаскивания в поле приемнике данных.
//
// Параметры:
//  ЗначениеПеретаскивания	- Произвольный 			- значение перетаскивания.
//  ИмяКолонки				- Строка 				- имя колонки табличной части, в которую осуществляется перетаскивание.
//  ТаблицаОбъекта			- ДанныеФормыКоллекция 	- таблица объекта, в которую осуществляется перетаскивание.
//  Форма					- УправляемаяФорма 		- владелец элемента управления.
//  ДовыполнитьПодбор	 	- Булево 				- признак необходимости довыполнить подбордля каждого значения 
//													  из ЗначениеПеретаскивания.
//  ПараметрыПодбора	 	- Произвольный 			- параметры, используемые для дополнительного подбора.
//  ПовторныйВыбор		 	- Булево 				- признак необходимости проверять выбирается ли значение повторно и добавлять его.
//
Процедура ТабличнаяЧастьПеретаскивание(ЗначениеПеретаскивания,
									   ИмяКолонки,
									   ТаблицаОбъекта,
									   Форма,
									   ДовыполнитьПодбор = Ложь,
									   ПараметрыПодбора = Неопределено,
									   ПовторныйВыбор = Ложь) Экспорт 
	
	ВыбранноеЗначение = Новый СписокЗначений;
	
	Если ТипЗнч(ЗначениеПеретаскивания) = Тип("Массив") Тогда
		Для каждого стрЗначениеПеретаскивания Из ЗначениеПеретаскивания Цикл
			Если ТипЗнч(стрЗначениеПеретаскивания) = Тип("Число") Тогда
				ВыбранноеЗначение.Добавить(ТаблицаОбъекта.НайтиПоИдентификатору(стрЗначениеПеретаскивания)[ИмяКолонки], , Истина);
			Иначе
				ВыбранноеЗначение.Добавить(стрЗначениеПеретаскивания);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если ТипЗнч(стрЗначениеПеретаскивания) = Тип("Число") Тогда
			ВыбранноеЗначение.Добавить(ТаблицаОбъекта.НайтиПоИдентификатору(ЗначениеПеретаскивания)[ИмяКолонки], , Истина);
		Иначе
			ВыбранноеЗначение.Добавить(ЗначениеПеретаскивания);
		КонецЕсли;
	КонецЕсли;
	
	КоличествоДоПеретаскивания = ТаблицаОбъекта.Количество();
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение,
		ИмяКолонки, ТаблицаОбъекта, Форма, ДовыполнитьПодбор, ПараметрыПодбора, ПовторныйВыбор);	
	
	КоличествоПослеПеретаскивания = ТаблицаОбъекта.Количество();
	
	Если КоличествоДоПеретаскивания <> КоличествоПослеПеретаскивания Тогда
		
		СтруктураПеретаскивания = Новый Структура;
		СтруктураПеретаскивания.Вставить("ТаблицаОбъекта",  ТаблицаОбъекта);
		СтруктураПеретаскивания.Вставить("ИмяКолонки",  ИмяКолонки);
		Оповестить("упоПодборВТабличнуюЧастьКлиентПеретаскивание", СтруктураПеретаскивания, Форма);
		
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает структуру параметров для подбора.
//
// Параметры:
//  ПараметрыПодбора - Произвольный - по заверешении процедуры в параметре возвращается подготовленная структура.
//
Процедура ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ИмяОбъектаВМетаданных");
	ПараметрыПодбора.Вставить("ЭлементВладелец");
	ПараметрыПодбора.Вставить("ДопПараметры", Новый Структура);
	ПараметрыПодбора.ДопПараметры.Вставить("СписокВидимыхКолонок", Новый СписокЗначений);
	ПараметрыПодбора.ДопПараметры.Вставить("ВыбранныеЗначения");
	ПараметрыПодбора.ДопПараметры.Вставить("ТаблицаОтбор");
	ПараметрыПодбора.ДопПараметры.Вставить("ДеревоОтбор");
	ПараметрыПодбора.ДопПараметры.Вставить("ПовторныйВыбор", Ложь);
	ПараметрыПодбора.ДопПараметры.Вставить("КоллекцияДоступныеДляВыбора");
	ПараметрыПодбора.ДопПараметры.Вставить("ШаблонТекстаОшибки");
	ПараметрыПодбора.ДопПараметры.Вставить("СтруктураВыбораПроизвольная", Ложь);
	
КонецПроцедуры

// Подготовить доп. параметры структуры подбора.
//
// Параметры:
//  Форма						 - УправляемаяФорма
//  ПараметрыПодбораСтруктура	 - Структура
//  ИмяТЧ						 - Строка
//  СтруктураДанных				 - Структура
//
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(Форма, ПараметрыПодбораСтруктура,
		ИмяТЧ, СтруктураДанных) Экспорт
	
	Элементы = Форма.Элементы;
		
	Если ПараметрыПодбораСтруктура = Неопределено Тогда
		ПараметрыПодбораСтруктура = Новый Структура;
	КонецЕсли;	
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");		
	
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
	Если ИмяТЧ = "ДвиженияДенежныхСредств" Тогда
		
		Если Элементы.ДДС_ПараметрыПодбора_НаправлениеПоступление.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"),"НаправлениеДвижения");
			
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_НаправлениеВыплата.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата"), "НаправлениеДвижения");
			
		КонецЕсли;
		
		Если Элементы.ДДС_ПараметрыПодбора_ПривязкаКНачалу.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоЗадачи"),"СпособПривязки");
			
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_ПривязкаКЗавершению.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеЗадачи"), "СпособПривязки");
				
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_ПривязкаКНачалуПроекта.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоПроекта"), "СпособПривязки");
				
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_ПривязкаКЗавершениюПроекта.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеПроекта"), "СпособПривязки");
			
		КонецЕсли;
		
	ИначеЕсли ИмяТЧ = "ТрудовыеРесурсы" Тогда		
		
		ПараметрыПодбораСтруктура.Вставить("УровеньПланированияТР", ПолучитьТекущийУровеньПланированияТР(Форма));
		ПараметрыПодбораСтруктура.Вставить("ЕдиницаНормирования", ЕдИзмеренияТрудоемкостиПоУмолчанию(Форма));
		Если Форма.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда
			СтрокаПоляИсключенияЗаполнения = "";
			ПоляИсключенияЗаполнения = Новый Массив();
			Если ПараметрыПодбораСтруктура.Свойство("ПоляИсключенияЗаполнения", СтрокаПоляИсключенияЗаполнения) Тогда
				ПоляИсключенияЗаполнения.Добавить(СтрокаПоляИсключенияЗаполнения);
			КонецЕсли;
			ПоляИсключенияЗаполнения.Добавить("Стоимость");
			ПоляИсключенияЗаполнения.Добавить("ОбщСтоимость");
			ПоляИсключенияЗаполнения.Добавить("ВнешняяСтоимость");
			ПоляИсключенияЗаполнения.Добавить("ОбщВнешняяСтоимость");
			ПараметрыПодбораСтруктура.Вставить("ПоляИсключенияЗаполнения", СтрСоединить(ПоляИсключенияЗаполнения, ", ")); 
		КонецЕсли;
		
	ИначеЕсли ИмяТЧ = "ТрудовыеРесурсыРоли" Тогда		
		
		ПараметрыПодбораСтруктура.Вставить("УровеньПланированияТР", Форма.УровеньПланированияТрудовыхРесурсов);
		ПараметрыПодбораСтруктура.Вставить("ЕдиницаНормирования", ЕдИзмеренияТрудоемкостиПоУмолчанию(Форма));
		
		Если Форма.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда
			СтрокаПоляИсключенияЗаполнения = "";
			ПоляИсключенияЗаполнения = Новый Массив();
			Если ПараметрыПодбораСтруктура.Свойство("ПоляИсключенияЗаполнения", СтрокаПоляИсключенияЗаполнения) Тогда
				ПоляИсключенияЗаполнения.Добавить(СтрокаПоляИсключенияЗаполнения);
			КонецЕсли;
			ПоляИсключенияЗаполнения.Добавить("Стоимость");
			ПоляИсключенияЗаполнения.Добавить("ОбщСтоимость");
			ПараметрыПодбораСтруктура.Вставить("ПоляИсключенияЗаполнения", СтрСоединить(ПоляИсключенияЗаполнения, ", ")); 
		КонецЕсли; 
		
	КонецЕсли;
		
КонецПроцедуры

// Процедура для вызова при подборе ресурсов.
//
// Параметры:
//  СтрокаТабличнойЧасти			 - ДанныеФормыЭлементКоллекции, Структура							 - данные строки.
//  ПараметрыПодбора				 - СписокЗначений													 - список параметров подбора.
//  Объект							 - СправочникСсылка, ДокументСсылка, СправочникОбъект, ДокументОбъект, ДанныеФормыСтруктура	 - объект.
//  ДополнительныеПараметрыИсточника - Структура	 - дополнительные данные формы.
// 
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции, Структура - строка, дополненная данными в соответствии с параметрами ПараметрыПодбора.
//
Функция ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено, Объект, 
	ДополнительныеПараметрыИсточника = Неопределено) Экспорт
		
	ДопПараметрыПодбора = упоУправлениеФормамиСервер.ДозаполнитьПараметрыПодбора();
		
	ДопПараметрыПодбора.Вставить("мВалютаУправленческогоУчета", ДопПараметрыПодбора.ВалютаУправленческогоУчета);

	Если ДопПараметрыПодбора.РежимИнтеграции_УПО Тогда		
		имяРеквизитаВалютыДоговора = упоУправлениеДоговорамиКлиентСервер.ИмяРеквизитаВалютыДоговора();
		ДопПараметрыПодбора.Вставить("имяРеквизитаВалютыДоговора", имяРеквизитаВалютыДоговора);		
	КонецЕсли;
	
	ДопПараметрыПодбора.Вставить("ПараметрПодбора");
	
	Если Не ПараметрыПодбора = Неопределено И Не ПараметрыПодбора.Количество() = 0 Тогда
		
		Если Объект.Свойство("Проект") Тогда
			Проект = Объект.Проект;
		ИначеЕсли Объект.Свойство("ПроектнаяЗадача") Тогда			
			Проект = упоФункцииБСП.ПолучитьЗначениеРеквизита(Объект.ПроектнаяЗадача, "Проект");
		ИначеЕсли СтрокаТабличнойЧасти.Свойство("Проект") Тогда
			Проект = СтрокаТабличнойЧасти.Проект;
		ИначеЕсли СтрокаТабличнойЧасти.Свойство("ПроектнаяЗадача") Тогда	
			Проект = упоФункцииБСП.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.ПроектнаяЗадача, "Проект");
		Иначе
			Проект = Неопределено;			
		КонецЕсли;
		
		Для Каждого ПараметрПодбора Из ПараметрыПодбора Цикл
			
			ДопПараметрыПодбора.ПараметрПодбора = Новый Структура;
			ДопПараметрыПодбора.ПараметрПодбора.Вставить("Значение", ПараметрПодбора.Значение);
			ДопПараметрыПодбора.ПараметрПодбора.Вставить("Представление", ПараметрПодбора.Представление);
			
			Если ПараметрПодбора.Представление = "ИмяТабличнойЧасти" Тогда
				
				ДопПараметрыПодбора.Вставить("имяТабличнойЧасти",  ПараметрПодбора.Значение);
				
				Если ПараметрПодбора.Значение = "ДвиженияДенежныхСредств" 
					Или  ПараметрПодбора.Значение = "ПланДоходов" 
					Или ПараметрПодбора.Значение = "Доходы" 
					Или ПараметрПодбора.Значение = "Расходы" 
					Или ПараметрПодбора.Значение = "ПланРасходов" 
					Или ПараметрПодбора.Значение = "ДоходныеОбъемы" 
					Или ПараметрПодбора.Значение = "РасходныеОбъемы" Тогда
					
					ЗаполнитьФинансовуюИнформациюВСтроке(СтрокаТабличнойЧасти,
														 ПараметрыПодбора,
														 Проект,
														 ДопПараметрыПодбора);
					
					Если ДополнительныеПараметрыИсточника <> Неопределено Тогда
						упоПроектыИЗадачиОбщие.ОбновитьДатуПривязкиВСтроке(ДополнительныеПараметрыИсточника, Проект, СтрокаТабличнойЧасти);
					КонецЕсли;					
					
				ИначеЕсли ПараметрПодбора.Значение = "ТрудовыеРесурсы" Или ПараметрПодбора.Значение = "ТрудовыеРесурсыРоли" Тогда
					
					ДатаАктуальности = Неопределено;
					Если ДополнительныеПараметрыИсточника <> Неопределено 
						И ДополнительныеПараметрыИсточника.Свойство("НачалоПлан", ДатаАктуальности)	Тогда
						ДопПараметрыПодбора.Вставить("ДатаНачалаПлан", ДатаАктуальности);
					КонецЕсли;	
					
					ЗаполнитьИнформациюТрудовыеРесурыВСтроке(СтрокаТабличнойЧасти,
															 ПараметрыПодбора,
															 Объект,															 
															 ДопПараметрыПодбора);											
					
				ИначеЕсли ПараметрПодбора.Значение = "Субпродукты" Тогда
					
					ЗаполнитьСтрокуСубпродукты(СтрокаТабличнойЧасти,
											   ПараметрыПодбора, 
											   Объект, 											    
											   ДопПараметрыПодбора);
					
				ИначеЕсли ПараметрПодбора.Значение = "МатериальныеРесурсы" Тогда
					
					ЗаполнитьСтрокуМатРесурсы(СтрокаТабличнойЧасти, ПараметрыПодбора, Объект, 
						ДополнительныеПараметрыИсточника, ДопПараметрыПодбора);
					
				ИначеЕсли ПараметрПодбора.Значение = "ЗатратыМатРесурсовФакт" Тогда
					
					ЗаполнитьСтрокуЗатратыМатРесурсовФакт(СтрокаТабличнойЧасти,
														  ПараметрыПодбора,
														  Проект, 														   
														  ДопПараметрыПодбора);
														  
				ИначеЕсли ПараметрПодбора.Значение = "ПроектныеЗадачи" Тогда   				
					
					ЗаполнитьСтрокуПроектныеЗадачиВРучнойАктуализацииПроекта(СтрокаТабличнойЧасти, Объект); 									  
														  
				КонецЕсли; 			
				
			КонецЕсли; 		
				
		КонецЦикла; 
			
	Иначе
		
		упоУправлениеФормамиСервер.ПриИзмененииРесурсаТабЧастиВызовСервера(СтрокаТабличнойЧасти, Объект);
		
	КонецЕсли; 
	
	Возврат СтрокаТабличнойЧасти;
	
КонецФункции

// Выполняет общие действия при редактировании проектной задачи в документе и в форме задачи структуры проекта.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура - строка данных.
//  ПараметрыПодбора	 - Структура - параметры подбора в строку данных.
//  ДополнительныеПараметры	 - Структура - значения реквизитов формы-источника (сроки).
//
Процедура ВыполнитьДействияПриПодбореВПроектнойЗадаче(СтрокаТабличнойЧасти, ПараметрыПодбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ПараметрыПодбора) <> Тип("Структура") Тогда		
		Возврат;
	КонецЕсли;	
	
	//
	
	ПоляИсключенияЗаполнения = "";
	Если ПараметрыПодбора.Свойство("ПоляИсключенияЗаполнения") Тогда
		ПоляИсключенияЗаполнения = ПараметрыПодбора.ПоляИсключенияЗаполнения;
	КонецЕсли;
	
	Если ПараметрыПодбора.Свойство("УровеньПланированияТР") Тогда
		СтрокаТабличнойЧасти.УровеньПланирования = ПараметрыПодбора.УровеньПланированияТР;	
	КонецЕсли;
	
	Если ПараметрыПодбора.Свойство("ДобавлениеПредшественника") Тогда
		
		СтрокаТабличнойЧасти.ТипСвязи = ПредопределенноеЗначение("Перечисление.упоТипСвязи.ОкончаниеНачало");
		СтрокаТабличнойЧасти.ЕдиницаНормированияДлительности = ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.Час");
		
		Если ПараметрыПодбора.Свойство("СвязьМеждуПроектами") Тогда
			СтрокаТабличнойЧасти.СвязьМеждуПроектами = ПараметрыПодбора.СвязьМеждуПроектами;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыПодбора.Свойство("ЕдиницаНормирования") 
		И Не СтрНайти(ПоляИсключенияЗаполнения, "ЕдиницаНормирования") Тогда
		СтрокаТабличнойЧасти.ЕдиницаНормирования = ПараметрыПодбора.ЕдиницаНормирования;
	КонецЕсли;  
	
	Если ПараметрыПодбора.Свойство("ПараметрыПодбораСписок") Тогда
		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбора.СтруктураСтроки, СтрокаТабличнойЧасти);			
		
		// В веб-клиенте при передаче структуры в параметре значения не сохраняются.
		СтруктураДанныеСтроки = упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбора.СтруктураСтроки,
			ПараметрыПодбора.ПараметрыПодбораСписок, 
			ПараметрыПодбора.СвойстваОбъекта, 
			ДополнительныеПараметры);
		// В веб-клиенте при передаче структуры в параметре значения не сохраняются, причем очень непонятно.
		// Например, свойство СпособПривязки не заполняется точно.
		
		Если ПараметрыПодбора.Свойство("Субпродукты")
			И упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(СтруктураДанныеСтроки.Ресурс) Тогда
			
			СвойстваОбъекта = ПараметрыПодбора.СвойстваОбъекта;
			ЭтоШаблон = СвойстваОбъекта.Свойство("ЭтоШаблон") И СвойстваОбъекта.ЭтоШаблон; 
			
			Если ЭтоШаблон Тогда
				Проект = Неопределено;
				ПрофильДоходовПоУмолчанию = СтруктураДанныеСтроки.ПрофильРаспределения;	
			Иначе
				Проект = ПараметрыПодбора.СвойстваОбъекта.Проект;
				ПрофильДоходовПоУмолчанию = Неопределено;
			КонецЕсли;
			
			МассивРаспределенияОбъемов = Новый Массив;   
			
			МодульупоПроектнаяПродукция = ОбщегоНазначенияКлиент.ОбщийМодуль("упоПроектнаяПродукцияВызовСервера");
			МодульупоПроектнаяПродукция.ЗаполнитьПланВыпускаПоПроектнойПродукции(СтруктураДанныеСтроки, МассивРаспределенияОбъемов);
				
			ПараметрыПодбора.Вставить("МассивРаспределенияОбъемов", МассивРаспределенияОбъемов);
			
			СубпродуктыЗаполнитьРаспределениеОбъемовПП(СтруктураДанныеСтроки, МассивРаспределенияОбъемов,
				ПараметрыПодбора.РаспределениеОбъемов, ПараметрыПодбора.Субпродукты, Проект);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанныеСтроки, , ПоляИсключенияЗаполнения);
		
		Если ПараметрыПодбора.Свойство("Субпродукты") Тогда
			упоРаботаСФормамиКлиент.ПересчитатьДлительностьПоПроектнойПродукции(СтрокаТабличнойЧасти);
        КонецЕсли;

	КонецЕсли;	
			
	Если ПараметрыПодбора.Свойство("СтруктураСтроки") Тогда 
		
		Если ПараметрыПодбора.СтруктураСтроки.Свойство("НаправлениеДвижения") Тогда 
			СтрокаТабличнойЧасти.НаправлениеДвижения = СтруктураДанныеСтроки.НаправлениеДвижения;
			упоРаботаСФормамиКлиент.УстановитьИконкуНаправленияВТаблицеДДС(СтрокаТабличнойЧасти);
		КонецЕсли;
		
		Если ПараметрыПодбора.СтруктураСтроки.Свойство("ДатаПривязки") Тогда 
			СтрокаТабличнойЧасти.ДатаПривязки = СтруктураДанныеСтроки.ДатаПривязки;
		КонецЕсли;
		
	КонецЕсли;
	
 КонецПроцедуры

// Выполняет распределение объемов проектной продукции при редактировании табличной части Субпродукты проектной задачи в документе
//	и в форме задачи структуры проекта.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура - строка данных.
//	МассивРаспределенияОбъемов - Массив - Распределяемые объемы.
//  РаспределениеОбъемов - ДанныеФормыКоллекция.
//  ОбъектРаспределения	 - ДанныеФормыКоллекция, ТабличнаяЧасть, ТаблицаЗначений, Массив - Строка, объемы которой необходимо распределить.
//	Проект - СправочникСсылка.
//
Процедура СубпродуктыЗаполнитьРаспределениеОбъемовПП(СтрокаТабличнойЧасти,	
	МассивРаспределенияОбъемов,	
	РаспределениеОбъемов,
	ОбъектРаспределения,
	Проект = Неопределено) Экспорт
	
	Если Проект = Неопределено Тогда
		Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ПересчитатьДлительностьПоПроектнойПродукции(СтрокаТабличнойЧасти);
	
	Если СтрокаТабличнойЧасти.ИндексСтрокРаспределения = Неопределено Тогда
		СтрокаТабличнойЧасти.ИндексСтрокРаспределения = 
		упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(ОбъектРаспределения); 
	КонецЕсли;
	
	Отбор = Новый Структура("ИндексСтрокиВладельца", СтрокаТабличнойЧасти.ИндексСтрокРаспределения);
	НайденныеСтроки = РаспределениеОбъемов.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		РаспределениеОбъемов.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	ПрофильДоходовПоУмолчанию = Неопределено;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ПрофильРаспределения) Тогда
		ПрофильДоходовПоУмолчанию = СтрокаТабличнойЧасти.ПрофильРаспределения;
	КонецЕсли;

	СвойстваПоУмолчанию = СвойстваПоУмолчаниюДляЗаполненияРаспределенияПланаВыпускаПоПроектнойПродукции(Проект);
		
	Если Не ЗначениеЗаполнено(МассивРаспределенияОбъемов) Тогда
	
		НоваяСтрока = РаспределениеОбъемов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		НоваяСтрока.ИндексСтрокиВладельца = СтрокаТабличнойЧасти.ИндексСтрокРаспределения;
		НоваяСтрока.ПроцентРаспределения = СвойстваПоУмолчанию.ПроцентРаспределения;
		НоваяСтрока.Роль = СвойстваПоУмолчанию.РольДоходовПоУмолчанию;
		НоваяСтрока.Подразделение = СвойстваПоУмолчанию.ПодразделениеДоходовПоУмолчанию;
		НоваяСтрока.СобствСилы_Субподряд = СвойстваПоУмолчанию.СССП_Доходы;
		НоваяСтрока.Количество = СтрокаТабличнойЧасти.Количество;
		НоваяСтрока.Сумма = НоваяСтрока.Количество * СтрокаТабличнойЧасти.Стоимость;
		Если СтрокаТабличнойЧасти.СпособПривязки =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
			НоваяСтрока.СпособПривязки =
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
			НоваяСтрока.ПрофильРаспределения = ПрофильДоходовПоУмолчанию;	
		ИначеЕсли СтрокаТабличнойЧасти.СпособПривязки =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда
			НоваяСтрока.СпособПривязки =
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРаспределенияОбъемов Из МассивРаспределенияОбъемов Цикл
		НоваяСтрока = РаспределениеОбъемов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределенияОбъемов);
		НоваяСтрока.ИндексСтрокиВладельца = СтрокаТабличнойЧасти.ИндексСтрокРаспределения;
		НоваяСтрока.Сумма = НоваяСтрока.Количество * СтрокаТабличнойЧасти.Стоимость;
		Если СтрокаТабличнойЧасти.СпособПривязки =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
			НоваяСтрока.СпособПривязки =
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
			НоваяСтрока.ПрофильРаспределения = ПрофильДоходовПоУмолчанию;	
		ИначеЕсли СтрокаТабличнойЧасти.СпособПривязки =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда
			НоваяСтрока.СпособПривязки =
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕдИзмеренияТрудоемкостиПоУмолчанию(ЭтаФорма)
	
	Если ЗначениеЗаполнено(ЭтаФорма.ЕдиницаТрудоемкостиПоУмолчанию) Тогда
		Возврат ЭтаФорма.ЕдиницаТрудоемкостиПоУмолчанию;
	Иначе
		Возврат ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.Час");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТекущийУровеньПланированияТР(ЭтаФорма) 
	
	Если ЭтаФорма.УровеньПланированияОкончательный Тогда
		Возврат ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Окончательный");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Предварительный");
	КонецЕсли;	
	
КонецФункции

Процедура ЗаполнитьИнформациюТрудовыеРесурыВСтроке(СтрокаТабличнойЧасти,
												   ПараметрыПодбора, 
												   Объект,												   
												   ДопПараметрыПодбора)
		
	СтруктСоответствиеРеквизитовНормСтоимостиШапкиИТЧ = Новый Структура();
	СтруктСоответствиеРеквизитовНормСтоимостиШапкиИТЧ.Вставить("НормаСтоимостиТрудовыхРесурсов", "Стоимость");
	ЕстьКолонкаВнСтоимость = ДопПараметрыПодбора.ПараметрПодбора.Значение = "ТрудовыеРесурсы";
	Если ЕстьКолонкаВнСтоимость Тогда
		СтруктСоответствиеРеквизитовНормСтоимостиШапкиИТЧ.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", "ВнешняяСтоимость");
	КонецЕсли;
	
	СтрокаТабличнойЧастиЗаполненная = упоУправлениеФормамиСервер.ПриИзмененииРесурсаТабЧастиВызовСервера(
		СтрокаТабличнойЧасти, Объект, СтруктСоответствиеРеквизитовНормСтоимостиШапкиИТЧ, ЕстьКолонкаВнСтоимость);
		
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТабличнойЧастиЗаполненная);
		
	СтрокаТабличнойЧасти.ПрофильРаспределения =
		ПредопределенноеЗначение("Справочник.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение");
	СтрокаТабличнойЧасти.СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
	
	ПодразделенияРоли = упоРесурсыИРолиСервер.ПолучитьМассивПодразделенийРоли(СтрокаТабличнойЧасти.Ресурс, ,
		ДопПараметрыПодбора.ДатаНачалаПлан);
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Подразделение)
		Или ПодразделенияРоли.Найти(СтрокаТабличнойЧасти.Подразделение) = Неопределено Тогда
		ДатаАктуальности = Неопределено;
		ДопПараметрыПодбора.Свойство("ДатаНачалаПлан", ДатаАктуальности);
		
		СтрокаТабличнойЧасти.Подразделение = 
			упоУправлениеФормамиСервер.ПолучитьПодразделениеРолиВызовСервера(СтрокаТабличнойЧасти.Ресурс, ДатаАктуальности);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьФинансовуюИнформациюВСтроке(СтрокаТабличнойЧасти,
											   ПараметрыПодбора,
											   Проект,
											   ДопПараметрыПодбора)
	
	// Попробуем определить договор контрагента по умолчанию.
	
	ПараметрПодбора = ДопПараметрыПодбора.ПараметрПодбора;
	
	ЗаполнитьДоговорВалютуПоКонтрагенту(СтрокаТабличнойЧасти, ДопПараметрыПодбора);
 		
	// Добавлены условия для вызова процедуры из документа "Регистрация факт доходов и расходов".
	Если НЕ ПараметрПодбора.Значение = "ДвиженияДенежныхСредств"
		И НЕ ПараметрПодбора.Значение = "Доходы"
		И НЕ ПараметрПодбора.Значение = "Расходы"
		И НЕ ПараметрПодбора.Значение = "ДоходныеОбъемы" 
		И НЕ ПараметрПодбора.Значение = "РасходныеОбъемы" Тогда 
		
		СтрокаТабличнойЧасти.СпособПривязки =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения");
		
	Иначе
		
		// Устанавливаем только те колонки, которые еще не были заполнены пользователем.
		
		НаправлениеПоУмолчанию = ПараметрыПодбора.НайтиПоЗначению(
			ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата"));
		
		Если НаправлениеПоУмолчанию = Неопределено Тогда
			
			НаправлениеПоУмолчанию = ПараметрыПодбора.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"));
			
		КонецЕсли;
		
		Если НаправлениеПоУмолчанию <> Неопределено Тогда
			
			НаправлениеДДС = упоУправлениеФормамиСервер.ПолучитьНаправлениеДДС(СтрокаТабличнойЧасти.СтатьяДДС);
			НаправлениеПоУмолчаниюЗначение = НаправлениеПоУмолчанию.Значение;
			Если НЕ упоУправлениеФормамиСервер.ЗначениеНеЗаполненоВызовСервера(СтрокаТабличнойЧасти.СтатьяДДС) 
				И НЕ упоУправлениеФормамиСервер.ЗначениеНеЗаполненоВызовСервера(НаправлениеДДС) Тогда
				СтрокаТабличнойЧасти.НаправлениеДвижения = НаправлениеДДС;
			Иначе
				СтрокаТабличнойЧасти[НаправлениеПоУмолчанию.Представление]	= НаправлениеПоУмолчанию.Значение;
			КонецЕсли; 					
			
		КонецЕсли;
		
		СпособПривязкиПоУмолчанию =
			ПараметрыПодбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоЗадачи"));
		
		Если СпособПривязкиПоУмолчанию = Неопределено Тогда
			
			СпособПривязкиПоУмолчанию = 
				ПараметрыПодбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеЗадачи"));
				
		КонецЕсли;
			
		Если СпособПривязкиПоУмолчанию = Неопределено Тогда
			
			СпособПривязкиПоУмолчанию = 
				ПараметрыПодбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоПроекта"));
				
		КонецЕсли;
		
		Если СпособПривязкиПоУмолчанию = Неопределено Тогда
			
			СпособПривязкиПоУмолчанию = 
				ПараметрыПодбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеПроекта"));
				
		КонецЕсли;	
		
		Если СпособПривязкиПоУмолчанию <> Неопределено Тогда
					
			СтрокаТабличнойЧасти[СпособПривязкиПоУмолчанию.Представление]	= СпособПривязкиПоУмолчанию.Значение;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НЕ ПараметрПодбора.Значение = "ДвиженияДенежныхСредств" Тогда  
		
		Если ПараметрПодбора.Значение = "ПланДоходов"
			Или ПараметрПодбора.Значение = "Доходы" Тогда
			
			имяПолеКонтрагент 	=  "КонтрагентДоходов";
			имяПолеДоговор 		=  "ДоговорДоходов";
			
		Иначе		
			
			имяПолеКонтрагент 	=  "КонтрагентЗатрат";
			имяПолеДоговор 		=  "ДоговорЗатрат";	
			
		КонецЕсли;
		
	Иначе 
		
		Если ЗначениеЗаполнено(НаправлениеДДС) Тогда 
			Если НаправлениеДДС =
					ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление") Тогда 
				
				имяПолеКонтрагент 	=  "КонтрагентДоходов";
				имяПолеДоговор 		=  "ДоговорДоходов";
				
			Иначе
				
				имяПолеКонтрагент 	=  "КонтрагентЗатрат";
				имяПолеДоговор 		=  "ДоговорЗатрат";	
				
			КонецЕсли;
			
		Иначе
			
			Если НаправлениеПоУмолчаниюЗначение =
					ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление") Тогда 
				
				имяПолеКонтрагент 	=  "КонтрагентДоходов";
				имяПолеДоговор 		=  "ДоговорДоходов";
				
			Иначе
				
				имяПолеКонтрагент 	=  "КонтрагентЗатрат";
				имяПолеДоговор 		=  "ДоговорЗатрат";	
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТабличнойЧастиЗаполненная = упоФункцииОбщегоНазначенияВызовСервера.ЗаполнитьСтрокуПоУмолчанию(
		ДопПараметрыПодбора,
		Проект,
		имяПолеКонтрагент, 
		имяПолеДоговор, 
		СтрокаТабличнойЧасти,
		ПараметрПодбора.Значение);
		
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТабличнойЧастиЗаполненная);
		
КонецПроцедуры

Процедура ЗаполнитьДоговорВалютуПоКонтрагенту(СтрокаТабличнойЧасти, ДопПараметрыПодбора)
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Контрагент) 
		И Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда      
		СтрокаТабличнойЧасти.Договор =
			упоУправлениеФормамиСервер.ОсновнойДоговорКонтрагента(СтрокаТабличнойЧасти.Контрагент);
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.Свойство("Договор") И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда
		
		СтрокаТабличнойЧасти.Валюта =
			упоУправлениеФормамиСервер.ПолучитьВалютуДоговораКонтрагента(СтрокаТабличнойЧасти.Договор);
		
	Иначе
		
		СтрокаТабличнойЧасти.Валюта = ДопПараметрыПодбора.ВалютаУправленческогоУчета;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуСубпродукты(СтрокаТабличнойЧасти,
	ПараметрыПодбора,
	Объект,
	ДопПараметрыПодбора)
	
	ЭтоШаблон = Объект.Свойство("ЭтоШаблон") И Объект.ЭтоШаблон;
	
	Если Не ЭтоШаблон Тогда
		
		СтрокаТабличнойЧастиЗаполненная = упоФункцииОбщегоНазначенияВызовСервера.ЗаполнитьСтрокуПоУмолчанию(
			ДопПараметрыПодбора,
			Объект.Проект,
			"КонтрагентДоходов", 
			"ДоговорДоходов",
			СтрокаТабличнойЧасти,
			ПараметрыПодбора.Получить(0).Значение);
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТабличнойЧастиЗаполненная);
		
	КонецЕсли;

	ЗаполнитьДоговорВалютуПоКонтрагенту(СтрокаТабличнойЧасти, ДопПараметрыПодбора);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СпособПривязки) Тогда
		СтрокаТабличнойЧасти.СпособПривязки =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СпособПривязкиВыпуска) Тогда
		СтрокаТабличнойЧасти.СпособПривязкиВыпуска =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиПоставокИСубпродуктов.ЗавершениеЗадачи");
	КонецЕсли;
	
	Если Не ЭтоШаблон Тогда
		
		СтруктураСроки  = Новый Структура;
		Если Объект.Свойство("ДатаНачалаПлан") Тогда
			СтруктураСроки.Вставить("НачалоПлан", Объект.ДатаНачалаПлан);
		Иначе // вызов из структуры
			СтруктураСроки.Вставить("НачалоПлан", Объект.ДатаНачала);
		КонецЕсли;
		Если Объект.Свойство("ДатаЗавершенияПлан") Тогда
			СтруктураСроки.Вставить("ЗавершениеПлан", Объект.ДатаЗавершенияПлан);
		Иначе // вызов из структуры
			СтруктураСроки.Вставить("ЗавершениеПлан", Объект.ДатаЗавершения);
		КонецЕсли;
		упоУправлениеФормамиКлиент.ОбновитьДатуВыпускаВСтроке(СтруктураСроки, Объект.Проект, СтрокаТабличнойЧасти);
	
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
		СтрокаТабличнойЧасти.Количество = 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Коэффициент) Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	КонецЕсли;
	
	упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти, Объект, Объект.НормаСтоимостиОбъемы);
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаНормирования) Тогда
		СтрокаТабличнойЧасти.ЕдиницаНормирования =
			упоУправлениеФормамиСервер.ПолучитьЕдиницуИзмТЧ(СтрокаТабличнойЧасти.Ресурс, ДопПараметрыПодбора);
	КонецЕсли;
	
	ЭтоПП = Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
	Если ТипЗнч(СтрокаТабличнойЧасти) = Тип("Структура")
			И Не СтрокаТабличнойЧасти.Свойство("ЭтоПП") Тогда
			
		СтрокаТабличнойЧасти.Вставить("ЭтоПП", ЭтоПП);		
			
	ИначеЕсли СтрокаТабличнойЧасти.Свойство("ЭтоПП") Тогда   	
		
		СтрокаТабличнойЧасти.ЭтоПП = ЭтоПП;
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуМатРесурсы(СтрокаТабличнойЧасти,
									ПараметрыПодбора,
									Объект,
									Сроки,
									ДопПараметрыПодбора)
	
	СтрокаТабличнойЧастиЗаполненная = упоФункцииОбщегоНазначенияВызовСервера.ЗаполнитьСтрокуПоУмолчанию(
		ДопПараметрыПодбора, 
		Объект.Проект,
		"КонтрагентЗатрат",
		"ДоговорЗатрат",
		СтрокаТабличнойЧасти,
		ПараметрыПодбора.Получить(0).Значение);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТабличнойЧастиЗаполненная);
	
	ЗаполнитьДоговорВалютуПоКонтрагенту(СтрокаТабличнойЧасти, ДопПараметрыПодбора);		
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СпособПривязки) Тогда
		СтрокаТабличнойЧасти.СпособПривязки =
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СпособПривязкиПотребности) Тогда
		СтрокаТабличнойЧасти.СпособПривязкиПотребности = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиПоставокИСубпродуктов.НачалоЗадачи");
	КонецЕсли;
			
	упоУправлениеФормамиКлиент.ОбновитьДатуЗаказаПотребностиВСтроке(Сроки, Объект.Проект, СтрокаТабличнойЧасти);
	
	// Значение по умолчанию для Статьи затрат ресурса.
	ЗатиратьТекущееЗначениеСтатьиЗатратРесурса = Ложь;
	упоПроектыИЗадачиВызовСервера.УстановитьСтатьюЗатратРесурса(СтрокаТабличнойЧасти,
														  ЗатиратьТекущееЗначениеСтатьиЗатратРесурса);
	упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти, Объект);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаНормирования) Тогда	
		СтрокаТабличнойЧасти.ЕдиницаНормирования = 
			упоУправлениеФормамиСервер.ПолучитьЕдиницуИзмТЧ(СтрокаТабличнойЧасти.Ресурс, ДопПараметрыПодбора);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
		СтрокаТабличнойЧасти.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуЗатратыМатРесурсовФакт(СтрокаТабличнойЧасти,
												ПараметрыПодбора,
												Проект,												
												ДопПараметрыПодбора)
												
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЕдиницаНормирования) Тогда	
		СтрокаТабличнойЧасти.ЕдиницаНормирования =
			упоУправлениеФормамиСервер.ПолучитьЕдиницуИзмТЧ(СтрокаТабличнойЧасти.Ресурс, ДопПараметрыПодбора);			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
		СтрокаТабличнойЧасти.Количество = 1;
	КонецЕсли;
	
	СтрокаТабличнойЧастиЗаполненная = упоФункцииОбщегоНазначенияВызовСервера.ЗаполнитьСтрокуПоУмолчанию(
		ДопПараметрыПодбора,
		Проект,
		"КонтрагентЗатрат",
		"ДоговорЗатрат",
		СтрокаТабличнойЧасти);
	
	ЗатиратьТекущееЗначениеСтатьиЗатратРесурса = Ложь;
	упоПроектыИЗадачиВызовСервера.УстановитьСтатьюЗатратРесурса(СтрокаТабличнойЧастиЗаполненная,
														  ЗатиратьТекущееЗначениеСтатьиЗатратРесурса,
														  "Статья");
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТабличнойЧастиЗаполненная);
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПроектныеЗадачиВРучнойАктуализацииПроекта(СтрокаТабличнойЧасти, Объект)

	упоПроектыИЗадачиВызовСервера.ЗаполнитьСтрокуСвойствамиПроектнойЗадачи(СтрокаТабличнойЧасти, Объект);
	
КонецПроцедуры

// Получает свойства по умолчанию для новой строки распределения плана выпуска при выборе/подборе
// проектной продукции.
//
// Параметры:
//  Проект     - СправочникСсылка.Проекты - источник свойств по умолчанию.
// 
// Возвращаемое значение:
//  Структура
//
Функция СвойстваПоУмолчаниюДляЗаполненияРаспределенияПланаВыпускаПоПроектнойПродукции(Проект)
	
	СвойстваПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);
	СвойстваПоУмолчанию.Вставить("ПроцентРаспределения", 100);
	
	Возврат СвойстваПоУмолчанию;
	
КонецФункции

#КонецОбласти


