////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, позволяющие идентифицировать конфигурацию.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверка: функциональность проектного бюджетирования доступна.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ФункционалПроектногоБюджетированияДоступен() Экспорт
	
	ФункционалДоступен = Истина;
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() 
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		ФункционалДоступен = Ложь;
	КонецЕсли; 
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Возвращает признак того, используется ли механизм синхронизации с УФ из PM.
//
// Возвращаемое значение:
//   Булево   - признак того, что механизм используется.
//
Функция ИспользуетсяСинхронизацияЧерезУниверсальныйФорматPM() Экспорт
	
	Возврат упоИнтеграцияВызовСервера.ИспользуетсяСинхронизацияЧерезУниверсальныйФорматPM();
	
КонецФункции

// Возвращает признак того, что можно использовать настройку стилей. 
// (Текущая платформа >= 8.3.13).
//
//
// Возвращаемое значение:
//   Булево   - <описание возвращаемого значения>
//
Функция ДоступнаНастройкаСтилей() Экспорт 
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.13.0") > 0;
		
КонецФункции

// Возвращает признак того, что можно использовать положение кнопки в командной панели. 
// (Текущая платформа >= 8.3.15).
//
//
// Возвращаемое значение:
//   Булево   - <описание возвращаемого значения>
//
Функция ДоступноПоложениеКнопкиВКоманднойПанели() Экспорт 
	
	Возврат ТекущаяПлатформаВыше8_3_15();
		
КонецФункции

// Возвращает признак того, что можно использовать картинки в условном оформлении СКД. 
// (Текущая платформа >= 8.3.15).
//
//
// Возвращаемое значение:
//   Булево   - <описание возвращаемого значения>
//
Функция ДоступноУсловноеОформлениеКартинкой() Экспорт
	
	Возврат ТекущаяПлатформаВыше8_3_15();
	
КонецФункции

// Возвращает признак того, что можно использовать свойства АвтоМинимальноеЗначение и АвтоМаксимальноеЗначение у Диаграммы. 
// (Текущая платформа < 8.3.20).
//
//
// Возвращаемое значение:
//   Булево   - <описание возвращаемого значения>
//
Функция ДоступныСвойстваДиаграммыДляРасчетаМаксИМинЗначения() Экспорт 
	
	Возврат ТекущаяПлатформаНиже8_3_20();
		
КонецФункции

// Возвращает признак того, что текущая версия платформы больше 8.3.15. 
//
// Возвращаемое значение:
//   Булево   - текущая версия платформы больше 8.3.15.
//
Функция ТекущаяПлатформаВыше8_3_15() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.15.0") > 0;
	
КонецФункции

// Возвращает признак того, что текущая версия платформы меньше 8.3.20. 
//
// Возвращаемое значение:
//   Булево   - текущая версия платформы меньше 8.3.20.
//
Функция ТекущаяПлатформаНиже8_3_20() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.20.0") < 0;
	
КонецФункции

// Функция - Используется стиль оформления ITLand
// 
// Возвращаемое значение:
//  Булево  - Да или нет
//
Функция ИспользуетсяСтильОформленияITLand() Экспорт
	
	Возврат (упоИнтеграцияКлиентСерверПовтИсп.ИмяТекущегоСтиляОформления() = "упоСтильITLand");
	
КонецФункции 

// Функция - Имя макета оформления СКД соответствующего стилю оформления
// 
// Возвращаемое значение:
//  Строка - Имя макета
//
Функция ИмяМакетаОформленияСКДСоответствующегоСтилюОформления() Экспорт
	
	Если упоИнтеграцияКлиентСервер.ИспользуетсяСтильОформленияITLand() Тогда
		Возврат "Арктика";
	Иначе
		Возврат "ОформлениеОтчетовБежевый";
	КонецЕсли;
	
КонецФункции 

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалРаспределенияОПРОХР() Экспорт 
	
	ФункционалДоступен = Ложь;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
		Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли; 
	
	Возврат ФункционалДоступен;
	
КонецФункции 

#Область ПроектнаяПродукция

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалПроектнаяПродукция() Экспорт 
	
	ФункционалДоступен = Ложь;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ИспользуетсяФункционалПроектнаяПродукция() Экспорт 
	
	ФункционалИспользуется = ДоступенФункционалПроектнаяПродукция();
	Если Не ФункционалИспользуется Тогда
		Возврат ФункционалИспользуется;
	КонецЕсли;
	
	ФункционалИспользуется = 
		упоИнтеграцияВызовСервера.ПолучитьФункциональнуюОпциюВызовСервера("упоИспользоватьПроектнуюПродукцию");
	
	Возврат ФункционалИспользуется;
	
КонецФункции

// Проверяет, является ли проектной продукцией проверяемый объект.
//
// Параметры:
//  ПроверяемыйОбъект	 - СправочникСсылка - проверяемый объект.
// 
// Возвращаемое значение:
//  Булево - результат проверки
//
Функция ЭтоПроектнаяПродукция(ПроверяемыйОбъект) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоПП = ТипЗнч(ПроверяемыйОбъект) = Тип("СправочникСсылка.упоПроектнаяПродукция");
	
	Возврат ЭтоПП;
	
КонецФункции

// Возвращает тип субпродукта перечисление по номеру переключателя на форме.
//
// Параметры:
//  Номер	 - Число - номер переключателя на форме.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.упоТипСубпродукта - тип субпродукта.
//
Функция ТипСубпродуктаПеречислениеПоНомеру(Номер) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.Номенклатура");
	КонецЕсли;
	
	Если Номер = 1 Тогда
		ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
	Иначе
		ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.Номенклатура");
	КонецЕсли;
		
	Возврат ТипСубпродукта;
	
КонецФункции

// Возвращает номер типа субпродукта по перечислению для отображения переключателя на форме.
//
// Параметры:
//  ТипСубпродукта	 - ПеречислениеСсылка.упоТипСубпродукта - тип субпродукта.
// 
// Возвращаемое значение:
//  Число - номер для переключателя на форме.
//
Функция НомерТипаСубпродуктаПоПеречислению(ТипСубпродукта) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
		Номер = 1;
	Иначе
		Номер = 0;
	КонецЕсли;
		
	Возврат Номер;
	
КонецФункции

#КонецОбласти

#Область ПричиныОтклонений

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалПричиныОтклонений() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф()Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ИспользуетсяФункционалПричиныОтклонений() Экспорт 
	
	ФункционалИспользуется = ДоступенФункционалПричиныОтклонений();
	Если Не ФункционалИспользуется Тогда
		Возврат ФункционалИспользуется;
	КонецЕсли;
	
	ФункционалИспользуется = 
		упоИнтеграцияВызовСервера.ПолучитьФункциональнуюОпциюВызовСервера("упоИспользоватьПричиныОтклонений");
	
	Возврат ФункционалИспользуется;
	
КонецФункции

#КонецОбласти

#Область СогласованиеТрудозатрат

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалСогласованиеТрудозатрат() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ИспользуетсяФункционалСогласованиеТрудозатрат() Экспорт 
	
	ФункционалИспользуется = ДоступенФункционалСогласованиеТрудозатрат();
	Если Не ФункционалИспользуется Тогда
		Возврат ФункционалИспользуется;
	КонецЕсли;
	
	ФункционалИспользуется = упоИнтеграцияВызовСервера.ПолучитьФункциональнуюОпциюВызовСервера(
		"упоИспользоватьПодсистемуСогласованиеТрудозатрат");
	
	Возврат ФункционалИспользуется;
	
КонецФункции

#КонецОбласти

#Область РасчетЦеныКонтракта

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалРасчетЦеныКонтракта() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

#КонецОбласти

#Область ЗаявкиНаПроекты

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалЗаявкиНаПроекты() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

#КонецОбласти

#Область ОтражениеПервичныхДокументовВПроектномБюджетировании

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалОтражениеПервичныхДокументовВПроектномБюджетировании() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

#КонецОбласти

#Область ПрогнозныеСроки

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалПрогнозныхСроков() Экспорт
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалПрогнозТрудозатратПоРолям() Экспорт
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

#КонецОбласти

#Область ФазыПроекта

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалФазыПроекта() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф()Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

#КонецОбласти

#Область РаспределениеКосвенныхРасходов

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалРаспределениеКосвенныхРасходов() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф()Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

#КонецОбласти

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалРаспределенияЗарплатыПоПроектам() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалПланированияНакладныхРасходовПоБюджету() Экспорт 
	
	ФункционалДоступен = Ложь;
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ФункционалДоступен = Истина;
	КонецЕсли;
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак необходимости синхронизации.
//
Функция НеобходимаСинхронизацияСтатейДР() Экспорт 
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() 
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();		
	
КонецФункции
 
// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак интеграции с документами Заказ поставщику, Заказ покупателя.
//
Функция ИнтеграцияСЗаказамиПоставщикамКлиентам() Экспорт 
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2();			
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак интеграции с документами Заказ на производство.
//
Функция ИнтеграцияСЗаказамиНаПроизводство() Экспорт
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2();			
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак интеграции с платежными документами.
//
Функция ИнтеграцияСПлатежнымиДокументами() Экспорт 
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2();		
			
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак интеграции с первичными документами.
//
Функция ИнтеграцияСПервичнымиДокументами() Экспорт 
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() 
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();		
			
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак синхронизации справочников Единицы измерения.
//
Функция ИспользуетсяСинхронизацияЕдиницИзмерения() Экспорт 
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();		
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак синхронизации перечисления СтавкиНДС и справоочника СтавкиНДС.
//
Функция ИспользуетсяСинхронизацияСтавокНДС() Экспорт 
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак использования отбора по компонентам в справочнике Проекты.
//
Функция ИспользуетсяОтборПоКомпонентамВСпискеПроектов() Экспорт 
	
	Возврат Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф();
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак наличия реквизита в справочнике Упаковки.
//
Функция ЕстьРеквизитыЧислительЗнаменательВСправочникеУпаковки() Экспорт
	
	Возврат упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак наличия реквизита СчетУчета в ПВХ СтатьяРасходов.
//
Функция ЕстьРеквизитСчетУчетаВСтатьеРасходов() Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5() Тогда
		Результат = Истина;
	ИначеЕсли упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
		Результат = Истина;
	Иначе 
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак наличия реквизита в справочнике НастройкиХозяйственныхОпераций.
//
Функция ЕстьРеквизитПредставлениеДокументаВСправочникеНастройкиХозяйственныхОпераций() Экспорт
	
	Возврат Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5();
	
КонецФункции

// Выполняет проверку согласно наименованию. Используется для интерфейсного скрытия метода оперативного планирования 
// в упоРегистрацияПроекта.ФормаДокументаУправляемая и общей форме упоНастройкаПараметровPM.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ИспользоватьМетодОперативногоПланированияРесурсовНаПроект() Экспорт 
	
	Возврат Ложь;
	
КонецФункции 

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак использования функционала.
//
Функция ИспользуетсяФункционалЗаказыПокупателей() Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат упоИнтеграцияEPMСервер.ИспользуетсяФункционалЗаказыПокупателей();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак использования функционала.
//
Функция ИспользуетсяФункционалЗаказыПоставщикам() Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат упоИнтеграцияEPMСервер.ИспользуетсяФункционалЗаказыПоставщикам();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак использования функционала.
//
Функция ИспользуетсяФункционалЗаказыНаПроизводство() Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоКАPM() Тогда
		Возврат упоИнтеграцияEPMСервер.ИспользуетсяФункционалЗаказыНаПроизводство();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак использования функционала.
//
Функция ИспользуетсяФункционалЗаказыНаПроизводство2_2() Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоКАPM() Тогда
		Возврат упоИнтеграцияEPMСервер.ИспользуетсяФункционалЗаказыНаПроизводство2_2();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак использования функционала.
//
Функция ДоступенФункционалЗаказыНаПроизводствоERP() Экспорт
	
	ФункционалДоступен = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоКАPM()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2();
	
	Возврат ФункционалДоступен;
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Строка - заголовок страницы.
//
Функция ЗаголовокСтраницыЗаказыПокупателей() Экспорт
	
	Возврат НСтр("ru = 'Заказы клиентов'");
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Строка - заголовок страницы.
//
Функция ЗаголовокСтраницыЗаказыПоставщикам() Экспорт
	
	Возврат НСтр("ru = 'Заказы поставщикам'");
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Строка - заголовок страницы.
//
Функция ЗаголовокСтраницыЗаказыНаПроизводство() Экспорт
	
	Возврат НСтр("ru = 'Заказы на производство (версия 2.1)'");
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Строка - заголовок страницы.
//
Функция ЗаголовокСтраницыЗаказыНаПроизводство2_2() Экспорт
	
	Возврат НСтр("ru = 'Заказы на производство (версия 2.2)'");
	
КонецФункции

// Выполняет проверку согласно наименованию.
// 
// Возвращаемое значение:
//  Булево - признак доступности функционала.
//
Функция ДоступенФункционалВерсионированиеДопРеквизитов() Экспорт 
	
	Возврат ДоступенФункционалПроектнаяПродукция();
	
КонецФункции

// Префикс подсистемы PM.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПрефиксПодсистемыPM() Экспорт
	
	Возврат "упо";
	
КонецФункции

#КонецОбласти
