////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции интеграции с EPM.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработчикиПодписок

// Трансляция плана доходов и расходов в обороты бюджетов.
//
// Параметры:
//  Источник		 - Произвольный	 - источник события.
//  Отказ			 - Булево 	 - признак отказа от выполнения обработки.
//  РежимПроведения	 - РежимПроведенияДокумента	 - режим проведения.
//
Процедура упоТрансляцияПланаДоходаРасходовВОборотыБюджетов(Источник, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

// Обработчик события "Перед записью" справочника "Номенклатура"
//
// Параметры:
//  Источник - СправочникОбъект.Номенклатура - элемент справочника номенклатура, который нужно отработать.
//  Отказ	 - Булево						 - флаг отказа от проведения документа.
//
Процедура упоНоменклатураПередЗаписью(Источник, Отказ) Экспорт
	
	Если НЕ Источник.ЭтоГруппа Тогда
		Источник.упоВидРесурса = Перечисления.упоВидРесурса.Материальный;
		Источник.упоВидМатериальногоРесурса = Перечисления.упоВидМатериальногоРесурса.Материал;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события обработка проведения.
//
// Параметры:
//  Источник		 - Произвольный				 - источник события.
//  Отказ			 - Булево 	 				 - признак отказа от выполнения обработки.
//  РежимПроведения	 - РежимПроведенияДокумента	 - режим проведения.
//
Процедура ОтражениеПервичныхДокументовERP_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ЭтоEPM = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();
	ЭтоDev2 = упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2();
	
	Если Отказ
		Или (Не ЭтоEPM И Не ЭтоDev2) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоEPM_2_5 = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5(ЭтоEPM);
	
	ОтражатьДоходы = Ложь;
	ОтражатьРасходы = Ложь;
	ОтражатьДДС = Ложь;
	
	упоОтражатьФактДоходовПервичнымиДокументами = ИспользуетсяОтражениеФактаДоходовПервичнымиДокументами();
	упоОтражатьФактРасходовПервичнымиДокументами = ИспользуетсяОтражениеФактаРасходовПервичнымиДокументами();
	упоОтражатьФактДДСПервичнымиДокументами = ИспользуетсяОтражениеФактаДДСПервичнымиДокументами();
	
	ЗапросБДР = Новый Запрос;
	ЗапросДДС = Новый Запрос;
	ЗапросПринятныеОбъемы = Новый Запрос;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.АктВыполненныхРабот") Тогда
		
		ОтражатьДоходы = Истина;
		ЗапросБДР.Текст = ТекстЗапросаФактическиеДвиженияБДР_АктВыполненныхРабот();
		УстановитьПараметрыЗапросаФактическиеДвиженияБДР_АктВыполненныхРабот(ЗапросБДР,
			Источник.Ссылка);
		
		ЗапросПринятныеОбъемы.Текст = ТекстЗапросаПринятыеОбъемы_АктВыполненныхРабот();
		УстановитьПараметрыЗапросаПринятыеОбъемы_АктВыполненныхРабот(ЗапросПринятныеОбъемы,
			Источник.Ссылка);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств")
		И Источник.ПроведеноБанком Тогда
		
		ОтражатьДДС = Истина;
		ЗапросДДС.Текст = ТекстЗапросаФактическиеДвиженияДСПоступлениеБезналичных(ЭтоEPM_2_5);
		УстановитьПараметрыЗапросаФактическиеДвиженияДС_ПоступлениеБезналичных(ЗапросДДС,
			Источник.Ссылка);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
		
		ОтражатьРасходы = Истина;
		ЗапросБДР.Текст = ТекстЗапросаФактическиеДвиженияБДР_ПриобретениеТоваровУслуг();
		УстановитьПараметрыЗапросаФактическиеДвиженияБДР_ПриобретениеТоваровУслуг(ЗапросБДР,
			Источник.Ссылка);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		
		ОтражатьДДС = Истина;
		ЗапросДДС.Текст = ТекстЗапросаФактическиеДвиженияДСПриходныйКО(ЭтоEPM_2_5);
		УстановитьПараметрыЗапросаФактическиеДвиженияДС_ПриходныйКО(ЗапросДДС, Источник.Ссылка);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		
		ОтражатьДДС = Истина;
		ДанныеВШапкеДокумента = ИспользоватьДанныеШапкиФинансовогоДокумента(Источник);
		ЗапросДДС.Текст = ТекстЗапросаФактическиеДвиженияДСРасходныйКО(ЭтоEPM_2_5, ДанныеВШапкеДокумента);
		УстановитьПараметрыЗапросаФактическиеДвиженияДС_РасходныйКО(ЗапросДДС, Источник.Ссылка);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		ОтражатьДоходы = Истина;
		ЗапросБДР.Текст = ТекстЗапросаФактическиеДвиженияБДР_РеализацияТоваровУслуг();
		УстановитьПараметрыЗапросаФактическиеДвиженияБДР_РеализацияТоваровУслуг(ЗапросБДР,
			Источник.Ссылка);
		
		ЗапросПринятныеОбъемы.Текст = ТекстЗапросаПринятыеОбъемы_РеализацияТоваровУслуг();
		УстановитьПараметрыЗапросаПринятыеОбъемы_РеализацияТоваровУслуг(ЗапросПринятныеОбъемы,
			Источник.Ссылка);
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств")
		И Источник.ПроведеноБанком Тогда
		
		ОтражатьДДС = Истина;
		ДанныеВШапкеДокумента = ИспользоватьДанныеШапкиФинансовогоДокумента(Источник);
		ЗапросДДС.Текст = ТекстЗапросаФактическиеДвиженияДССписаниеБезналичных(ЭтоEPM_2_5, ДанныеВШапкеДокумента);
		УстановитьПараметрыЗапросаФактическиеДвиженияДС_СписаниеБезналичных(ЗапросДДС,
			Источник.Ссылка);
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ОчиститьРегистрФактДоходовИРасходов  = Ложь;
		
	Если (ОтражатьДоходы И упоОтражатьФактДоходовПервичнымиДокументами)
		Или (ОтражатьРасходы И упоОтражатьФактРасходовПервичнымиДокументами) Тогда
		
		РезультатЗапроса = ЗапросБДР.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОчиститьРегистрФактДоходовИРасходов = Истина;
		Иначе
			тзРезультат = РезультатЗапроса.Выгрузить();
			
			СтрокиКЗаполнениюСуммыУпрУчета = СтрокиКЗаполнениюСуммыУправленческогоУчета(тзРезультат);
			
			упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(СтрокиКЗаполнениюСуммыУпрУчета);
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СтрокиКЗаполнениюСуммыУпрУчета, тзРезультат);
			
			//упоФактДоходовИРасходовОбороты
			ДвиженияФактБДР = Источник.Движения.упоФактДоходовИРасходовОбороты;
			ДвиженияФактБДР.Записывать = Истина;
			ДвиженияФактБДР.Загрузить(тзРезультат);
			
			тзРезультат.Свернуть("Период, ПроектнаяЗадача, Статья, ВидЭлемента, Контрагент, Договор, ДатаНачисления, Валюта",
				"Сумма, СуммаВалютная");
			
			// упоФактДоходовИРасходовПоДням
			ДвиженияФакт = Источник.Движения.упоФактДоходовИРасходовПоДням;
			ДвиженияФакт.Записывать = Истина;
			ДвиженияФакт.Загрузить(тзРезультат);
		КонецЕсли;
	КонецЕсли;
	
	Если (ОтражатьДоходы И Не упоОтражатьФактДоходовПервичнымиДокументами)
		Или (ОтражатьРасходы И Не упоОтражатьФактРасходовПервичнымиДокументами) 
		Или ОчиститьРегистрФактДоходовИРасходов Тогда
		упоПроведениеДокументовСервер.ОчиститьНаборЗаписей("РегистрНакопления", "упоФактДоходовИРасходовОбороты", 
			Источник.Ссылка); 
		упоПроведениеДокументовСервер.ОчиститьНаборЗаписей("РегистрСведений", "упоФактДоходовИРасходовПоДням", 
			Источник.Ссылка);	
	КонецЕсли;

	Если ОтражатьДДС Тогда
		
		ОчиститьРегистрФактДДС = Истина;
		
		Если упоОтражатьФактДДСПервичнымиДокументами Тогда
			РезультатЗапроса = ЗапросДДС.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				тзРезультат = РезультатЗапроса.Выгрузить();
				
				тзРезультат.Свернуть("Период, ПроектнаяЗадача, СтатьяДДС, НаправлениеДвижения, Контрагент, Договор, ДатаДвижения,
				|Валюта, ДатаПлатежногоДокумента, НомерПлатежногоДокумента, КомментарийДвижения", "Сумма, СуммаВалютная");
				
				СтрокиКЗаполнениюСуммыУпрУчета = СтрокиКЗаполнениюСуммыУправленческогоУчета(тзРезультат);
				
				упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(СтрокиКЗаполнениюСуммыУпрУчета);
				
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СтрокиКЗаполнениюСуммыУпрУчета, тзРезультат);
				
				ДвиженияФакт = Источник.Движения.упоФактДвиженийДенежныхСредств;
				ДвиженияФакт.Записывать = Истина;
				ДвиженияФакт.Загрузить(тзРезультат);
				
				ОчиститьРегистрФактДДС = Ложь;			
			КонецЕсли;
		КонецЕсли;
		
		Если ОчиститьРегистрФактДДС Тогда 
			упоПроведениеДокументовСервер.ОчиститьНаборЗаписей("РегистрСведений", "упоФактДвиженийДенежныхСредств", 
				Источник.Ссылка);				
		КонецЕсли;
	КонецЕсли;
	
	Если ОтражатьДоходы Тогда
		
		ОчиститьВыполненныеПринятыеОбъемы = Истина;
				
		Если упоОтражатьФактДоходовПервичнымиДокументами Тогда
			РезультатЗапроса = ЗапросПринятныеОбъемы.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				тзРезультат = РезультатЗапроса.Выгрузить();
				
				СтрокиКЗаполнениюСуммыУпрУчета = СтрокиКЗаполнениюСуммыУправленческогоУчета(тзРезультат);
				
				упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(СтрокиКЗаполнениюСуммыУпрУчета);
				
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СтрокиКЗаполнениюСуммыУпрУчета, тзРезультат);
				
				// РН. Выполненные и принятые объемы (Остатки)
				ДвиженияОбъемы = Источник.Движения.упоВыполненныеПринятыеОбъемы;
				ДвиженияОбъемы.Записывать = Истина;
				ДвиженияОбъемы.Загрузить(тзРезультат);
				
				ОчиститьВыполненныеПринятыеОбъемы = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ОчиститьВыполненныеПринятыеОбъемы Тогда 
			упоПроведениеДокументовСервер.ОчиститьНаборЗаписей("РегистрНакопления", "упоВыполненныеПринятыеОбъемы", 
				Источник.Ссылка); 
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

// Обработчик события обработка заполнения.
//
// Параметры:
//  Источник				 - Произвольный	- источник события.
//  ДанныеЗаполнения 		 - Произвольный - данные заполнения.
//  ТекстЗаполнения	 		 - Строка	    - Текст, используемый для заполнения документа.
//  СтандартнаяОбработка	 - Булево	    - Признак стандартной обработки события.
//
Процедура упоОбработкаЗаполненияДокументовERPОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения,
		СтандартнаяОбработка) Экспорт
	
	ОбработкаЗаполнения(ДанныеЗаполнения, Источник);
	
КонецПроцедуры

// Обработчик события обработка проведения.
//
// Параметры:
//  Источник  - ДокументОбъект - документ ERP.
//  Отказ  - Булево - флаг отказа.
//  РежимПроведения  - РежимПроведенияДокумента - режим проведения документа.
//
Процедура упоОбработкаПроведенияДокументовERP(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		ОбработкаПроведения_ЗаявкаНаРасходованиеДенежныхСредств(Источник, РежимПроведения)
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		ОбработкаПроведения_СписаниеБезналичныхДенежныхСредств(Источник, РежимПроведения)
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ОбработкаПроведения_РасходныйКассовыйОрдер(Источник, РежимПроведения)
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПрочиеДоходыРасходы") Тогда
		ОбработкаПроведения_ПрочиеДоходыРасходы(Источник, Отказ, РежимПроведения);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события обработка удаления проведения.
//
// Параметры:
//  Источник  - ДокументОбъект - документ ERP.
//  Отказ  - Булево - флаг отказа.
//
Процедура упоОбработкаУдаленияПроведенияДокументовERP(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

// Обработчик события обработка удаления проведения.
//
// Параметры:
//  Источник			 - ДокументОбъект	 - документ ERP.
//  Отказ				 - Булево			 - флаг отказа.
//  ПроверяемыеРеквизиты - Массив
//
Процедура упоОбработкаПроверкиЗаполненияДокументовERPОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаПроизводство2_2") Тогда
		
		Если ЗначениеЗаполнено(Источник.ДатаПотребности) И ЗначениеЗаполнено(Источник.НачатьНеРанее)
			И Источник.ДатаПотребности < Источник.НачатьНеРанее Тогда
			
			ТекстОшибки = НСтр("ru = 'Желаемая дата выпуска меньше даты начала производства';
					|en = 'Желаемая дата выпуска меньше даты начала производства'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки, ,
				"ДатаПотребности",
				"Объект",
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОсновныеФункцииДвиженийДляДокументовERP

// Отражает фактические движения БДР в регистрах.
//
// Параметры:
//  ДополнительныеСвойства	 - Структура	 	 - структура доп. свойств.
//  Движения				 - КоллекцияДвижений - движения.
//  Отказ					 - Булево	 	 	 - признак отказа от отражения движений.
//
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
Функция ОтразитьФактическиеДвиженияБДР(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВхТаблицаДвиженияФактБДР = ДополнительныеСвойства.ТаблицыДляДвижений.упоТаблицаДвиженияФактБДР;
	ТаблицаДвиженияФактБДР = ВхТаблицаДвиженияФактБДР.Скопировать();
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженияФактБДР);
	
	ДвиженияФактБДР = Движения.упоФактДоходовИРасходовОбороты;
	ДвиженияФактБДР.Записывать = Истина;
	ДвиженияФактБДР.Загрузить(ТаблицаДвиженияФактБДР);
	
	ТаблицаДвиженияФактБДР.Свернуть("Период, ПроектнаяЗадача, Статья, ВидЭлемента, Контрагент, Договор, ДатаНачисления, Валюта", "Сумма, СуммаВалютная");
	
	ДвиженияФактБДР = Движения.упоФактДоходовИРасходовПоДням;
	ДвиженияФактБДР.Записывать = Истина;
	ДвиженияФактБДР.Загрузить(ТаблицаДвиженияФактБДР);
	
КонецФункции

// Процедура формирования движений по регистру "Фактические движения денежных средств".
//
// Параметры:
//  ДополнительныеСвойства	 - Структура - дополнительные свойства объекта при проведении.
//  Движения				 - Движения	 - набор движений документа.
//  Отказ					 - Булево	 - Признак отказа от проведения документа.
//
Процедура ОтразитьФактическиеДвиженияДенежныхСредств(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	вхТаблицаДенежныеСредства = ДополнительныеСвойства.ТаблицыДляДвижений.упоТаблицаФактическиеДвиженияДенежныхСредств;
	
	ТаблицаДенежныеСредства = вхТаблицаДенежныеСредства.Скопировать();
	ТаблицаДенежныеСредства.Свернуть("Период, ПроектнаяЗадача, СтатьяДДС, НаправлениеДвижения, Контрагент, Договор, ДатаДвижения, Валюта",
		"Сумма, СуммаВалютная");
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДенежныеСредства);
	
	ДвиженияДенежныеСредства = Движения.упоФактДвиженийДенежныхСредств;
	ДвиженияДенежныеСредства.Записывать = Истина;
	ДвиженияДенежныеСредства.Загрузить(ТаблицаДенежныеСредства);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСтатейДДС

// Заполнить направление движения статей ДДС
//
// Параметры:
//  НачальноеЗаполнение	 - Булево	 - признак начального заполнения базы.
//
Процедура ЗаполнитьНаправлениеДвиженияСтатейДДС(НачальноеЗаполнение = Ложь) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат;
	КонецЕсли;
	
	Выплата = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Выплата;
	Поступление = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление;
	
	СтатьиДДС = Справочники.СтатьиДвиженияДенежныхСредств;
	
	СоответствиеСтатьиИНаправленияДвижения = Новый Соответствие;
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ВозвратДенежныхСредствОтДругойОрганизации"], Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ВозвратДенежныхСредствОтПоставщика"], Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ВозвратОплатыКлиенту"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ВыдачаДенежныхСредствВДругуюКассу"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ВыдачаДенежныхСредствВКассуККМ"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ВыплатаЗаработнойПлаты"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["КурсовыеРазницыПрибыль"], Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["КурсовыеРазницыУбыток"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ОплатаДенежныхСредствВДругуюОрганизацию"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ОплатаПоставщику"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ПеречислениеДенежныхСредствНаДругойСчет"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ПоступлениеДенежныхСредствИзБанка"], Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ПоступлениеДенежныхСредствИзБанкаВИностраннойВалюте"],
		Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ПоступлениеДенежныхСредствИзКассыККМ"], Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ПоступлениеДенежныхСредствОтДругойОрганизации"], Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["ПоступлениеОплатыОтКлиента"], Поступление);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["СдачаДенежныхСредствВБанк"], Выплата);
	СоответствиеСтатьиИНаправленияДвижения.Вставить(СтатьиДДС["СдачаДенежныхСредствВБанкВИностраннойВалюте"], Выплата);
	
	Для Каждого Элемент Из СоответствиеСтатьиИНаправленияДвижения Цикл
		
		Если Не НачальноеЗаполнение И ЗначениеЗаполнено(Элемент.Ключ.упоНаправлениеДвижения) Тогда
			Продолжить;
		КонецЕсли;
		
		СтатьяДДСОбъект = Элемент.Ключ.ПолучитьОбъект();
		СтатьяДДСОбъект.упоНаправлениеДвижения = Элемент.Значение;
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СтатьяДДСОбъект);
		Исключение
			ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Справочник %1 не записан, произошли ошибки при записи!';
						|en = 'The %1 catalog was not saved. Errors occurred during saving.'",
						ОбщегоНазначения.КодОсновногоЯзыка()), СтатьяДДСОбъект);
			ОписаниеОшибки = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки.Описание);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Проверяет использование подсистемы "Распределение зарплаты".
//
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ИспользоватьПодсистемуРаспределениеЗарплаты() Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияЗарплатыПоПроектам() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоРаспределениеЗарплатыПоПроектам") Тогда
		МодульРаспределениеЗарплатыНастройки = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыНастройкиСервер");
		Результат = МодульРаспределениеЗарплатыНастройки.ИспользоватьПодсистему();
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет реквизит "Проектная задача" в табличной части документа "Заявка на расходование денежных средств".
//
// Параметры:
//  КоллекцияФормы	 - ДанныеФормыКоллекция - Данные формы табличной части РасшифровкаПлатежа.
//
Процедура ЗаполнитьПроектныеЗадачиВТЧЗаявкиНаРасходованияДС(КоллекцияФормы) Экспорт
	
	МассивОбъектов = Новый Массив;
	СоответствиеСтрокОбъектов = Новый Соответствие;
	Для Каждого СтрокаДанных Из КоллекцияФормы Цикл
		МассивОбъектов.Добавить(СтрокаДанных.ОбъектРасчетов);
		СоответствиеСтрокОбъектов.Вставить(СтрокаДанных.ОбъектРасчетов, СтрокаДанных);
	КонецЦикла;
	
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивОбъектов, "Объект", Истина);
	
    ТекстЗапроса = ТекстЗапросаПроектныхЗадачТабличнойЧасти(ОбъектыРасчетов);
	Если ТекстЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаОбработки = СоответствиеСтрокОбъектов.Получить(Выборка.ОбъектРасчетов);
		СтрокаОбработки.упоПроектнаяЗадача = Выборка.упоПроектнаяЗадача;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ИзменениеЭлементовФорм

// Изменяет элементы на форме документа "Приобретение товаров услуг".
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма.
//
// Возвращаемое значение:
//  Непределено - не возвращает значение.
Функция ИзменитьЭлементы_ПриобретениеТоваровУслуг_ФормаДокумента(ЭтаФорма) Экспорт
	
	Если Не ИспользуетсяОтражениеФактаРасходовПервичнымиДокументами() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипПолеФормы = Тип("ПолеФормы");
	ТипКнопкаФормы = Тип("КнопкаФормы");
	
	НоваяКомандаФормы = ЭтаФорма.Команды.Добавить("упоТоварыЗаполнитьПроектныеЗадачи");
	НоваяКомандаФормы.Действие = "Подключаемый_упоТоварыЗаполнитьПроектныеЗадачи";
	НоваяКомандаФормы.Заголовок = НСтр("ru = 'Заполнить проектные задачи'");
	НоваяКомандаФормы.Картинка = БиблиотекаКартинок.упоВыполнить;
	НоваяКомандаФормы.Подсказка = НСтр("ru = 'Заполнить проектными задачами на основании заказа'");
	НоваяКомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("упоТоварыЗаполнитьПроектныеЗадачи",
			ТипКнопкаФормы,
			ЭтаФорма.Элементы.ТоварыЗаполнить);
	Элемент_упоПроектнаяЗадача.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Элемент_упоПроектнаяЗадача.ИмяКоманды = "упоТоварыЗаполнитьПроектныеЗадачи";
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("ТоварыупоПроектнаяЗадача",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.КнопкаВыбора = Истина;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Товары.упоПроектнаяЗадача";
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("ТоварыупоПроект",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Товары.упоПроектнаяЗадача.упоКорневойПроект";
	Элемент_упоПроектнаяЗадача.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("ТоварыупоПодразделение",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Товары.упоПодразделение";
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("ТоварыупоРоль",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Товары.упоРоль";
	
КонецФункции

// Изменяет элементы формы документа "Заказ клиента", "Заказ на производство" и "Заказ поставщику".
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - форма.
//
// Возвращаемое значение:
//  Непределено - не возвращает значение.
Функция ИзменитьЭлементы_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику_ФормаДокумента(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	ДобавитьЭлементПроектВШапку_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику(ЭлементыФормы);
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ГруппаТоварыЗаполнить = ЭлементыФормы.Найти("ГруппаТоварыЗаполнить");
		ТоварыПодобратьНоменклатуру = ЭлементыФормы.Найти("ТоварыПодобратьНоменклатуру");
		
		Если ГруппаТоварыЗаполнить <> Неопределено Тогда
			упоКоманда = Форма.Команды.Добавить("упоКомандаЗаполнитьНазначениеПоНД");
			упоКоманда.Заголовок = НСтр("ru = 'Заполнить назначение по НД'");
			упоКоманда.Действие = "Подключаемый_упоКомандаЗаполнитьНазначениеПоНД";
			упоКоманда.Подсказка = НСтр("ru = 'Заполнить назначение по направлению деятельности'");
			упоГруппа = Форма.Элементы.Вставить(упоКоманда.Имя + "Группа", Тип("ГруппаФормы"), 
				ГруппаТоварыЗаполнить, ТоварыПодобратьНоменклатуру);
			упоГруппа.Вид = ВидГруппыФормы.ГруппаКнопок;
			упоЭлемент = Форма.Элементы.Добавить(упоКоманда.Имя, Тип("КнопкаФормы"), упоГруппа);
			упоЭлемент.ИмяКоманды = упоКоманда.Имя;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Изменяет элементы на форме документа "Реализация товаров услуг".
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - Форма.
// Возвращаемое значение:
//  Непределено - не возвращает значение.
Функция ИзменитьЭлементы_РеализацияТоваровУслуг_ФормаДокумента(ЭтаФорма) Экспорт
	
	Если Не ИспользуетсяОтражениеФактаДоходовПервичнымиДокументами() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипКнопкаФормы = Тип("КнопкаФормы");
	ТипПолеФормы = Тип("ПолеФормы");
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"ТоварыГруппаРаспределить",
			ТипГруппаФормы,
			ЭтаФорма.Элементы.ТоварыГруппаЗаполнить,
			ВидГруппыФормы.ГруппаКнопок);
	
	НоваяКомандаФормы = ДобавитьКомандуФормы(ЭтаФорма,
			"упоТоварыРаспределитьПоПодразделениям",
			"Подключаемый_упоТоварыРаспределитьПоПодразделениям",
			НСтр("ru = 'Распределить по подразделениям'"), ,
			Истина);
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"упоТоварыРаспределитьПоПодразделениям",
			ТипКнопкаФормы,
			Элемент_упоПроектнаяЗадача,
			ВидКнопкиФормы.КнопкаКоманднойПанели, ,
			"упоТоварыРаспределитьПоПодразделениям");
	
	НоваяКомандаФормы = ДобавитьКомандуФормы(ЭтаФорма,
			"упоТоварыЗаполнитьПроектныеЗадачи",
			"Подключаемый_упоТоварыЗаполнитьПроектныеЗадачи",
			НСтр("ru = 'Заполнить проектные задачи'"),
			НСтр("ru = 'Заполнить проектные задачи из заказов.'"),
			Истина);
	НоваяКомандаФормы.Картинка = БиблиотекаКартинок.упоВыполнить;
	
	НоваяКомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"упоТоварыЗаполнитьПроектныеЗадачи",
			ТипКнопкаФормы,
			ЭтаФорма.Элементы.ТоварыГруппаЗаполнить,
			ВидКнопкиФормы.КнопкаКоманднойПанели, ,
			"упоТоварыЗаполнитьПроектныеЗадачи");
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"ТоварыупоПроектнаяЗадача",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары,
			ВидПоляФормы.ПолеВвода,
			"Объект.Товары.упоПроектнаяЗадача");
	Элемент_упоПроектнаяЗадача.КнопкаВыбора = Истина;
	
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"ТоварыупоПроект",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары,
			ВидПоляФормы.ПолеНадписи,
			"Объект.Товары.упоПроектнаяЗадача.упоКорневойПроект", ,
			НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()));
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"ТоварыупоПодразделение",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары,
			ВидПоляФормы.ПолеВвода,
			"Объект.Товары.упоПодразделение");
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"ТоварыупоРоль",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары,
			ВидПоляФормы.ПолеВвода,
			"Объект.Товары.упоРоль");
	
	Элемент_упоПроектнаяЗадача = ДобавитьЭлементФормы(ЭтаФорма,
			"ТоварыупоСтатьяДоходов",
			ТипПолеФормы,
			ЭтаФорма.Элементы.Товары,
			ВидПоляФормы.ПолеВвода,
			"Объект.Товары.упоСтатьяДоходов");

	УстановитьОтметкуНезаполненногоСтатьиДоходов(ЭтаФорма);
			
КонецФункции

// Изменяет элементы на форме документа "Акт выполненных работ".
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - Форма.
// Возвращаемое значение:
//  Непределено - не возвращает значение.
Функция ИзменитьЭлементы_АктВыполненныхРабот_ФормаДокумента(ЭтаФорма) Экспорт
	
	Если Не ИспользуетсяОтражениеФактаДоходовПервичнымиДокументами() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("УслугиупоПроектнаяЗадача", Тип("ПолеФормы"), ЭтаФорма.Элементы.Услуги);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.КнопкаВыбора = Истина;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Услуги.упоПроектнаяЗадача";
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("УслугиупоПроект", Тип("ПолеФормы"), ЭтаФорма.Элементы.Услуги);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Услуги.упоПроектнаяЗадача.упоКорневойПроект";
	Элемент_упоПроектнаяЗадача.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("УслугиупоПодразделение", Тип("ПолеФормы"), ЭтаФорма.Элементы.Услуги);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Услуги.упоПодразделение";
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("УслугиупоРоль", Тип("ПолеФормы"), ЭтаФорма.Элементы.Услуги);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Услуги.упоРоль";
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("УслугиупоСтатьяДоходов", Тип("ПолеФормы"), ЭтаФорма.Элементы.Услуги);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.Услуги.упоСтатьяДоходов";
	
	НоваяКомандаФормы = ЭтаФорма.Команды.Добавить("упоУслугиЗаполнитьПроектныеЗадачи");
	НоваяКомандаФормы.Действие = "Подключаемый_упоУслугиЗаполнитьПроектныеЗадачи";
	НоваяКомандаФормы.Заголовок = НСтр("ru = 'Заполнить проектные задачи'");
	НоваяКомандаФормы.Картинка = БиблиотекаКартинок.упоВыполнить;
	НоваяКомандаФормы.Подсказка = НСтр("ru = 'Заполнить проектными задачами на основании заказа'");
	НоваяКомандаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("упоУслугиЗаполнитьПроектныеЗадачи",
			Тип("КнопкаФормы"),
			ЭтаФорма.Элементы.УслугиГруппаЗаполнить);
	Элемент_упоПроектнаяЗадача.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Элемент_упоПроектнаяЗадача.ИмяКоманды = "упоУслугиЗаполнитьПроектныеЗадачи";
	
КонецФункции

// Изменить элементы договоры контрагентов форма документа добавить статус.
//
// Параметры:
//  ЭтаФорма - 	 -
// Возвращаемое значение:
//  Непределено - не возвращает значение.
Функция ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаДокумента_ДобавитьСтатус(ЭтаФорма, ГруппаФормы, ПодключитьОбработчикПриИзменении = Истина) Экспорт
	
	Если ГруппаФормы = Неопределено Тогда
		ГруппаФормы = ЭтаФорма;
	КонецЕсли;
	
	ЭлементСтатусДоговора = ЭтаФорма.Элементы.Добавить("упоСтатусДоговора", Тип("ПолеФормы"), ГруппаФормы);
	ЭлементСтатусДоговора.ПутьКДанным = "Объект.упоСтатусДоговора";
	ЭлементСтатусДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтатусДоговора.Ширина = 20;
	ЭлементСтатусДоговора.РастягиватьПоГоризонтали = Ложь;
	ЭлементСтатусДоговора.РедактированиеТекста = Ложь;
	
	Если ПодключитьОбработчикПриИзменении Тогда
		ЭлементСтатусДоговора.УстановитьДействие("ПриИзменении", "Подключаемый_упоСтатусДоговораПриИзменении");
	КонецЕсли;
	
	МассивСтатусов = упоИнтеграцияEPMСервер.ПолучитьМассивСтатусовДоговоров();
	ЭлементСтатусДоговора.СписокВыбора.ЗагрузитьЗначения(МассивСтатусов);
	ЭлементСтатусДоговора.РежимВыбораИзСписка = Истина;
	
КонецФункции

// Возвращает массив доступных для договоров статусов
//
// Возвращаемое значение:
//  Массив - Массив статусов договоров.
//
Функция ПолучитьМассивСтатусовДоговоров() Экспорт
	
	Список = Новый Массив;
	Список.Добавить(Справочники.упоСтатусыОбъектов.Запланирован);
	Список.Добавить(Справочники.упоСтатусыОбъектов.НаСогласовании);
	Список.Добавить(Справочники.упоСтатусыОбъектов.Подписан);
	Список.Добавить(Справочники.упоСтатусыОбъектов.Выполняется);
	Список.Добавить(Справочники.упоСтатусыОбъектов.Приостановлен);
	Список.Добавить(Справочники.упоСтатусыОбъектов.Закрыт);
	
	Возврат Список;
	
КонецФункции

// Изменяет элементы в формах платежных документов, имеющих ТЧ Расшифровка платежа
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма.
//
Процедура ДобавитьЭлементыПроектПроектнаяЗадачаВПлатежныеДокументы(ЭтаФорма) Экспорт
	
	Элемент_упоПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("упоПроектнаяЗадача", Тип("ПолеФормы"), ЭтаФорма.Элементы.РасшифровкаБезРазбиения);
	Элемент_упоПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	Элемент_упоПроектнаяЗадача.КнопкаВыбора = Истина;
	Элемент_упоПроектнаяЗадача.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	Элемент_упоПроектнаяЗадача.ПутьКДанным = "Объект.РасшифровкаПлатежа.упоПроектнаяЗадача";
	
	Элемент_упоПроект = ЭтаФорма.Элементы.Добавить("упоПроект", Тип("ПолеФормы"), ЭтаФорма.Элементы.РасшифровкаБезРазбиения);
	Элемент_упоПроект.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент_упоПроект.ПутьКДанным = "Объект.РасшифровкаПлатежа.упоПроектнаяЗадача.упоКорневойПроект";
	Элемент_упоПроект.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецПроцедуры

// Добавляет в таблицу Расшифровка платежа колонки Проектная задача и Проект в ТЧ Расшифровка платежа.
//
// Параметры:
//	Форма - Управляемая форма - Форма, на которую добавляются колонки.
//
Процедура ДобавитьКолонкиПроектПроектнаяЗадачаВРасшифровкаПлатежа(ЭтаФорма) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ИнтеграцияСПервичнымиДокументами() Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("упоРасшифровкаПлатежаПроектнаяЗадача",
			Тип("ПолеФормы"),
			ЭтаФорма.Элементы.РасшифровкаПлатежа);
	КолонкаПроектнаяЗадача.ПутьКДанным = "Объект.РасшифровкаПлатежа.упоПроектнаяЗадача";
	КолонкаПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	КолонкаПроектнаяЗадача.КнопкаВыбора = Истина;
	
	КолонкаПроект = ЭтаФорма.Элементы.Добавить("упоРасшифровкаПлатежаПроект",
			Тип("ПолеФормы"),
			ЭтаФорма.Элементы.РасшифровкаПлатежа);
	КолонкаПроект.Вид = ВидПоляФормы.ПолеНадписи;
	КолонкаПроект.ПутьКДанным = "Объект.РасшифровкаПлатежа.упоПроектнаяЗадача.упоКорневойПроект";
	КолонкаПроект.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДобавитьЭлементыПроектПроектнаяЗадачаВПлатежныеДокументы(ЭтаФорма);
	
	ДобавитьЭлементыПроектПроектнаяЗадачаВШапкуДокумента(ЭтаФорма);
	УстановитьВидимостьЭлементовФинансовыхДокументов(ЭтаФорма);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("упоУправлениеПроектамиPM.упоИнтеграцияУХ") Тогда
		МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль("упоИнтеграцияУХ");
		МодульИнтеграции.ИзменитьВидимостьЭлементовПроектаУХи(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить элементы на форму контрагентов.
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - Форма элемента контрагентов.
//  Отказ	 - Булево			 - Отказ создания формы.
//
Процедура ДобавитьЭлементыФормыКонтрагентов(Форма, Отказ) Экспорт
	
	Если Найти(Форма.ИмяФормы, "Справочник.Контрагенты.") <> 0 И Найти(Форма.ИмяФормы, "ФормаЭлемента") <> 0 Тогда
		
		// Оповещения PM
		упоОповещенияВызовСервера.ДобавитьЭлементыПодписки(Форма, Форма.Объект);
		// Конец Оповещения PM
		
		ДобавитьЭлементыМоделированиеЭффективностиСпрКонтрагенты(Форма);
		
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
			
			Если Форма.Элементы.Найти("СтраницаОсновное") <> Неопределено Тогда
				Родитель = Форма.Элементы.СтраницаОсновное;
			Иначе
				Родитель = Форма;
			КонецЕсли;
			
			Элемент_упоОсновнойДоговорКонтрагента = Форма.Элементы.Добавить("упоОсновнойДоговорКонтрагента", Тип("ПолеФормы"), Родитель);
			Элемент_упоОсновнойДоговорКонтрагента.Вид = ВидПоляФормы.ПолеВвода;
			Элемент_упоОсновнойДоговорКонтрагента.КнопкаВыбора = Истина;
			Элемент_упоОсновнойДоговорКонтрагента.ПутьКДанным = "Объект.упоОсновнойДоговорКонтрагента";
			
			Элемент_упоНаправлениеДеятельности = Форма.Элементы.Добавить("упоНаправлениеДеятельности", Тип("ПолеФормы"), Родитель);
			Элемент_упоНаправлениеДеятельности.Вид = ВидПоляФормы.ПолеВвода;
			Элемент_упоНаправлениеДеятельности.КнопкаВыбора = Истина;
			Элемент_упоНаправлениеДеятельности.ПутьКДанным = "Объект.упоНаправлениеДеятельности";
			
			упоСхемаОплаты = Форма.Элементы.Добавить("упоСхемаОплаты", Тип("ПолеФормы"), Родитель);
			упоСхемаОплаты.ПутьКДанным = "Объект.упоСхемаОплаты";
			упоСхемаОплаты.Вид = ВидПоляФормы.ПолеВвода;
			упоСхемаОплаты.КнопкаВыбора = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет на форму элементы необходимые для моделирования эффективности проекта.
//
// Параметры:
//  Форма	 - Форма элемента справочника Контрагенты.
//
Процедура ДобавитьЭлементыМоделированиеЭффективностиСпрКонтрагенты(Форма) Экспорт
	
	Если НЕ Константы.упоИспользоватьНормированиеИПроектныеРешения.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаПоказатели = Форма.Элементы.Добавить("упоГруппаПоказатели", Тип("ГруппаФормы"), Форма.Элементы.СтраницыФормы);
	ГруппаПоказатели.Вид = ВидГруппыФормы.Страница;
	ГруппаПоказатели.Заголовок = НСтр("ru = 'Компетенции'");
	
	ТаблицаПоказателей = Форма.Элементы.Добавить("упоПоказатели", Тип("ТаблицаФормы"), ГруппаПоказатели);
	ТаблицаПоказателей.ПутьКДанным = "Объект.упоПоказатели";
	
	Для Каждого Реквизит Из Метаданные.Справочники.Контрагенты.ТабличныеЧасти.упоПоказатели.СтандартныеРеквизиты Цикл
		НоваяКолонка = Форма.Элементы.Добавить("упоПоказатели" + Реквизит.Имя, Тип("ПолеФормы"), ТаблицаПоказателей);
		НоваяКолонка.ПутьКДанным = "Объект.упоПоказатели." + Реквизит.Имя;
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Видимость = Ложь;
	КонецЦикла;
	
	Для Каждого Реквизит Из Метаданные.Справочники.Контрагенты.ТабличныеЧасти.упоПоказатели.Реквизиты Цикл
		НоваяКолонка = Форма.Элементы.Добавить("упоПоказатели" + Реквизит.Имя, Тип("ПолеФормы"), ТаблицаПоказателей);
		НоваяКолонка.ПутьКДанным = "Объект.упоПоказатели." + Реквизит.Имя;
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет на форму элементы партнеров.
//
// Параметры:
//  Форма	 - Форма элемента справочника Партнеры.
//
Процедура ДобавитьЭлементыСпрПартнеровКакКонтрагентов(Форма) Экспорт
	
	Если Не Константы["ИспользоватьПартнеровИКонтрагентов"].Получить() Тогда
		
		НовыеРеквизиты = Новый Массив;
		
		НовыеРеквизиты.Добавить(
			Новый РеквизитФормы(
				"упоОсновнойДоговорКонтрагента",
				Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"),
				,
				"Основной договор контрагента (PM)",
				Истина));
		
		НовыеРеквизиты.Добавить(
			Новый РеквизитФормы(
				"упоНаправлениеДеятельности",
				Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"),
				,
				"Направление деятельности (PM)",
				Истина));
		
		НовыеРеквизиты.Добавить(
			Новый РеквизитФормы(
				"упоСхемаОплаты",
				Новый ОписаниеТипов("СправочникСсылка.упоСхемыОплаты"),
				,
				"Схема оплаты (PM)",
				Истина));
		
		Форма.ИзменитьРеквизиты(НовыеРеквизиты);
		
		Если Форма.Элементы.Найти("ГруппаОбщаяИнформация") <> Неопределено Тогда
			Родитель = Форма.Элементы.ГруппаОбщаяИнформация;
		Иначе
			Родитель = Форма;
		КонецЕсли;
		
		Элемент_упоОсновнойДоговорКонтрагента = Форма.Элементы.Добавить("упоОсновнойДоговорКонтрагента", Тип("ПолеФормы"), Родитель);
		Элемент_упоОсновнойДоговорКонтрагента.Вид = ВидПоляФормы.ПолеВвода;
		Элемент_упоОсновнойДоговорКонтрагента.КнопкаВыбора = Истина;
		Элемент_упоОсновнойДоговорКонтрагента.ПутьКДанным = "упоОсновнойДоговорКонтрагента";
		
		Элемент_упоНаправлениеДеятельности = Форма.Элементы.Добавить("упоНаправлениеДеятельности", Тип("ПолеФормы"), Родитель);
		Элемент_упоНаправлениеДеятельности.Вид = ВидПоляФормы.ПолеВвода;
		Элемент_упоНаправлениеДеятельности.КнопкаВыбора = Истина;
		Элемент_упоНаправлениеДеятельности.ПутьКДанным = "упоНаправлениеДеятельности";
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", "КонтрагентПартнера");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элемент_упоОсновнойДоговорКонтрагента.СвязиПараметровВыбора = НовыеСвязи;
		
		упоСхемаОплаты = Форма.Элементы.Добавить("упоСхемаОплаты", Тип("ПолеФормы"), Родитель);
		упоСхемаОплаты.ПутьКДанным = "упоСхемаОплаты";
		упоСхемаОплаты.Вид = ВидПоляФормы.ПолеВвода;
		упоСхемаОплаты.КнопкаВыбора = Истина;
		
		Если ЗначениеЗаполнено(Форма.КонтрагентПартнера) Тогда
			ЗаполнитьЗначенияСвойств(Форма, Форма.КонтрагентПартнера,
				"упоОсновнойДоговорКонтрагента, упоНаправлениеДеятельности, упоСхемаОплаты");
		КонецЕсли;
		
	КонецЕсли;
	
	ДобавитьЭлементыМоделированиеЭффективностиСпрПартнеровКакКонтрагентов(Форма);
	
КонецПроцедуры

// Процедура добавляет на форму элементы партнеров.
//
// Параметры:
//  Форма	 - Форма элемента справочника Партнеры.
//
Процедура ДобавитьЭлементыМоделированиеЭффективностиСпрПартнеровКакКонтрагентов(Форма) Экспорт
	
	Если НЕ Константы.упоИспользоватьНормированиеИПроектныеРешения.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("упоПоказатели", Новый ОписаниеТипов("ТаблицаЗначений"), "", "упоПоказатели"));
	
	Для Каждого Реквизит Из Метаданные.Справочники.Контрагенты.ТабличныеЧасти.упоПоказатели.СтандартныеРеквизиты Цикл
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Имя, Реквизит.Тип, "упоПоказатели", Реквизит.Синоним));
	КонецЦикла;
	
	Для Каждого Реквизит Из Метаданные.Справочники.Контрагенты.ТабличныеЧасти.упоПоказатели.Реквизиты Цикл
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Имя, Реквизит.Тип, "упоПоказатели", Реквизит.Синоним));
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	ГруппаПоказатели = Форма.Элементы.Добавить("упоГруппаПоказатели", Тип("ГруппаФормы"), Форма.Элементы.ГруппаСтраницы);
	ГруппаПоказатели.Вид = ВидГруппыФормы.Страница;
	ГруппаПоказатели.Заголовок = НСтр("ru = 'Компетенции'");
	
	ТаблицаПоказателей = Форма.Элементы.Добавить("упоПоказатели", Тип("ТаблицаФормы"), ГруппаПоказатели);
	ТаблицаПоказателей.ПутьКДанным = "упоПоказатели";
	
	Для Каждого Реквизит Из Метаданные.Справочники.Контрагенты.ТабличныеЧасти.упоПоказатели.СтандартныеРеквизиты Цикл
		НоваяКолонка = Форма.Элементы.Добавить("упоПоказатели" + Реквизит.Имя, Тип("ПолеФормы"), ТаблицаПоказателей);
		НоваяКолонка.ПутьКДанным = "упоПоказатели." + Реквизит.Имя;
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Видимость = Ложь;
	КонецЦикла;
	
	Для Каждого Реквизит Из Метаданные.Справочники.Контрагенты.ТабличныеЧасти.упоПоказатели.Реквизиты Цикл
		НоваяКолонка = Форма.Элементы.Добавить("упоПоказатели" + Реквизит.Имя, Тип("ПолеФормы"), ТаблицаПоказателей);
		НоваяКолонка.ПутьКДанным = "упоПоказатели." + Реквизит.Имя;
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Форма.КонтрагентПартнера) Тогда
		Возврат;
	КонецЕсли;
	
	тзПоказатели = Форма.КонтрагентПартнера.упоПоказатели.Выгрузить();
	Для Каждого СтрТз Из тзПоказатели Цикл
		новстр = Форма.упоПоказатели.Добавить();
		ЗаполнитьЗначенияСвойств(новстр, СтрТз);
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет на форму элемент направления движения.
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма элемента справочника СтатьиДвиженияДенежныхСредств.
//
Процедура ДобавитьЭлементы_СтатьиДвиженияДенежныхСредств_ФормаЭлемента(ЭтаФорма) Экспорт
	
	ЭлементНаправлениеДвижения = ЭтаФорма.Элементы.Добавить("НаправлениеДвижения", Тип("ПолеФормы"));
	ЭлементНаправлениеДвижения.ПутьКДанным = "Объект.упоНаправлениеДвижения";
	ЭлементНаправлениеДвижения.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

// Ограничивает видимость элементов форм Справочник.упоСтатьиЗатрат, Справочник.упоСтатьиДоходов,
// Справочник.упоПодразделения группой элементов "ГруппаРежимаИнтеграции" при вызове формы PM
// из связанных элементов интегрированной конфигурации.
//
Процедура УстановитьВидимостьЭлементовВРежимеИнтеграции(ЭтаФорма) Экспорт
	
	Если Не ЭтаФорма.Параметры.Свойство("РежимИнтеграции") Тогда
		Возврат;
	КонецЕсли;
	
	ПодчиненныеЭлементы = ЭтаФорма.ПодчиненныеЭлементы;
	Для Каждого Элемент Из ПодчиненныеЭлементы Цикл
		Если Элемент.Имя = "ГруппаРежимаИнтеграции" 
			Или Элемент.Имя = "Наименование" 
			Или Элемент.Имя = "Код" Тогда
			Продолжить; // Продолжить
		КонецЕсли;
		Если Элемент.Видимость Тогда
			Элемент.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Отображение кода и наименования.
	Элементы = ЭтаФорма.Элементы;
	Элементы.Переместить(Элементы.Наименование, Элементы.ГруппаАдаптация);
	Элементы.Переместить(Элементы.Код, Элементы.ГруппаАдаптация);
	
КонецПроцедуры

// Изменяет видимость полей Проект и Проектная задача на форме финансовых документов.
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма финансового документа.
//
Процедура УстановитьВидимостьЭлементовФинансовыхДокументов(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Если Не Объект.Свойство("упоПроектнаяЗадача") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы = Форма.Элементы;
	
	ОтображатьПоля = ИспользоватьДанныеШапкиФинансовогоДокумента(Объект);
	
	Если Не ОтображатьПоля Тогда
		Объект.упоПроектнаяЗадача = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы,
		"упоШапкаПроектнаяЗадача",
		"Видимость",
		ОтображатьПоля);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы,
		"упоШапкаПроект",
		"Видимость",
		ОтображатьПоля);
	
КонецПроцедуры

// Изменяет элементы в справочнике "Сценарии" в форме выбора.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма.
//
// Возвращаемое значение:
//  Непределено - не возвращает значение.
Функция ИзменитьЭлементы_Сценарии_ФормаВыбора(ЭтаФорма) Экспорт
	
	Если ЭтаФорма.Параметры.Свойство("упоВыборСценария") Тогда
		ЭтаФорма.Элементы.Список.УстановитьДействие("ВыборЗначения", "Подключаемый_упоСписокВыборЗначения");
	КонецЕсли;
	
КонецФункции

// Изменяет элементы формы документа "Заявка на командировку".
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - форма.
//
Функция ИзменитьЭлементы_ЗаявкаНаКомандировку_ФормаДокумента(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	ПолеПроектнаяЗадача = ЭлементыФормы.Добавить("упоПроектнаяЗадача", Тип("ПолеФормы"), ЭлементыФормы.ГруппаЛево);
	ПолеПроектнаяЗадача.ПутьКДанным = "Объект.упоПроектнаяЗадача";
	ПолеПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПроектнаяЗадача.Ширина = 28;
	
	ПолеПроект = ЭлементыФормы.Добавить("упоПроект", Тип("ПолеФормы"), ЭлементыФормы.ГруппаПраво);
	ПолеПроект.ПутьКДанным = "Объект.упоПроектнаяЗадача.упоКорневойПроект";
	ПолеПроект.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ПолеПроект.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеПроект.Гиперссылка = Истина;
	ПолеПроект.Ширина = 33;
	
КонецФункции

#КонецОбласти

#Область ЭтапыОплаты

Процедура ЭтапыОплатыКлиентом_ПриСозданииНаСервере(Форма) Экспорт
	
	Если НЕ (Форма.Параметры.Свойство("Ключ") И ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.ЗаказКлиента")) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтапыОплатыДобавитьКнопку(Форма);
	
КонецПроцедуры

Процедура ЭтапыОплатыКлиентом_ЗаполнитьПоДаннымPMСервер(ПараметрыОбработки) Экспорт
	
	ВидыПлатежейPM = Перечисления.упоВидыПлатежей;
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5() Тогда
		ВидыПлатежейERP = Перечисления["ВариантыКонтроляОплатыКлиентом"];
	Иначе
		ВидыПлатежейERP = Перечисления["ВариантыОплатыКлиентом"];
	КонецЕсли;
	
	СоответствиеВидов = Новый Соответствие;
	СоответствиеВидов.Вставить(ВидыПлатежейPM.Аванс, ВидыПлатежейERP.АвансДоОбеспечения);
	СоответствиеВидов.Вставить(ВидыПлатежейPM.Оплата, ВидыПлатежейERP.ПредоплатаДоОтгрузки);
	СоответствиеВидов.Вставить(ВидыПлатежейPM.Расчет, ВидыПлатежейERP.КредитПослеОтгрузки);
	
	ЗаполнитьЭтапыОплатыПоДаннымPM(ПараметрыОбработки,
		Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление,
		СоответствиеВидов);
	
КонецПроцедуры

Процедура ЭтапыОплатыПоставщику_ПриСозданииНаСервере(Форма) Экспорт
	
	Если НЕ (Форма.Параметры.Свойство("Ключ") И ТипЗнч(Форма.Параметры.Ключ) = Тип("ДокументСсылка.ЗаказПоставщику")) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтапыОплатыДобавитьКнопку(Форма);
	
КонецПроцедуры

Процедура ЭтапыОплатыПоставщику_ЗаполнитьПоДаннымPMСервер(ПараметрыОбработки) Экспорт
	
	ВидыПлатежейPM = Перечисления.упоВидыПлатежей;
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5() Тогда
		ВидыПлатежейERP = Перечисления["ВариантыКонтроляОплатыПоставщику"];
	Иначе
		ВидыПлатежейERP = Перечисления["ВариантыОплатыПоставщику"];
	КонецЕсли;
	
	СоответствиеВидов = Новый Соответствие;
	СоответствиеВидов.Вставить(ВидыПлатежейPM.Аванс, ВидыПлатежейERP.ПредоплатаДоПоступления);
	СоответствиеВидов.Вставить(ВидыПлатежейPM.Оплата, ВидыПлатежейERP.КредитПослеПоступления);
	СоответствиеВидов.Вставить(ВидыПлатежейPM.Расчет, ВидыПлатежейERP.КредитСдвиг);
	
	ЗаполнитьЭтапыОплатыПоДаннымPM(ПараметрыОбработки,
		Перечисления.упоНаправлениеДвиженияДенежныхСредств.Выплата,
		СоответствиеВидов);
	
КонецПроцедуры

#КонецОбласти

#Область ИспользованиеЗаказовERP

// см.наименование
//
// Возвращаемое значение:
//  Булево - признак использования функционала.
//
Функция ИспользуетсяФункционалЗаказыПокупателей() Экспорт
	
	Возврат упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	
КонецФункции

// см.наименование
//
// Возвращаемое значение:
//  Булево - признак использования функционала.
//
Функция ИспользуетсяФункционалЗаказыПоставщикам() Экспорт
	
	Возврат упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьЗаказыПоставщикам");
	
КонецФункции

// Аннотация не требуется, см. имя метода.
//
// Возвращаемое значение:
//		Булево - признак использования подсистемы производство.
//
Функция ИспользуетсяФункционалЗаказыНаПроизводство() Экспорт
	
	Используется = Ложь;
	
	Если (упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() ИЛИ упоИнтеграцияКлиентСерверПовтИсп.ЭтоERPУХ())
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоКАPM() Тогда
		Используется = 
			упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством");
	КонецЕсли;
	
	Возврат Используется;
	
КонецФункции

// Аннотация не требуется, см. имя метода.
//
// Возвращаемое значение:
//		Булево - признак использования подсистемы производство версии 2.2.
//
Функция ИспользуетсяФункционалЗаказыНаПроизводство2_2() Экспорт
	
	Используется = Ложь;
	
	Если (упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() ИЛИ упоИнтеграцияКлиентСерверПовтИсп.ЭтоERPУХ()) 
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоКАPM() Тогда
		Используется = 
			упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2");
	КонецЕсли;
	
	Возврат Используется;
	
КонецФункции

#КонецОбласти

#Область УправлениеДоговорами

Функция СтатусERPПоСтатусуPM(СтатусДоговораPM) Экспорт
	
	
	СоответствиеСтатусов = Новый Соответствие();
	СоответствиеСтатусов.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыОбъектов.НаСогласовании"),
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован"));
	СоответствиеСтатусов.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыОбъектов.Выполняется"),
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Действует"));
	СоответствиеСтатусов.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыОбъектов.Закрыт"),
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт"));
	СоответствиеСтатусов.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыОбъектов.Запланирован"),
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован"));
	СоответствиеСтатусов.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыОбъектов.Подписан"),
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Действует"));
	СоответствиеСтатусов.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыОбъектов.Приостановлен"),
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Действует"));
	
	Возврат СоответствиеСтатусов.Получить(СтатусДоговораPM);
	
КонецФункции

#КонецОбласти

#Область СобытияФормERP

// Обработчик события "При создании на сервере".
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - форма
//  Отказ				 - Булево			 - признак отказа от создания.
//  СтандартнаяОбработка - Булево			 - признак стандартной обработки.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
		Возврат;
	КонецЕсли;
	
	СостИмени = упоФункцииОбщегоНазначенияКлиентСервер.СоставИмениФормы(Форма.ИмяФормы);
	ИмяТипаМетаданных = СостИмени.ТипМетаданных;
	
	Если ИмяТипаМетаданных = "Документ" Тогда
		
		ПриСозданииНаСервере_Документы(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли ИмяТипаМетаданных = "Справочник" Тогда
		
		ПриСозданииНаСервере_Справочники(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	ИначеЕсли ИмяТипаМетаданных = "ПланВидовХарактеристик" Тогда
		
		ПриСозданииНаСервере_ПВХ(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_НаправленияДеятельности(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.Объект.упоПроектнаяЗадачаЗеркало) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементПоследователь = Форма.Элементы.Найти("Родитель");
	Если ЭлементПоследователь <> Неопределено Тогда
		ЭлементГруппа = ЭлементПоследователь.Родитель;
		ЭлементПоследовательВГруппе = Истина;
	Иначе
		ЭлементГруппа = Форма;
		ЭлементПоследовательВГруппе = Ложь;
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ()
		И ЭлементПоследовательВГруппе Тогда
		ЭлементПоследователь = ЭлементГруппа;
		ЭлементГруппа = ЭлементПоследователь.Родитель;
		
	КонецЕсли;
	
	Элемент = Форма.Элементы.Вставить("упоПроектнаяЗадачаЗеркало", Тип("ПолеФормы"), ЭлементГруппа, ЭлементПоследователь);
	Элемент.Вид = ВидПоляФормы.ПолеНадписи;
	Элемент.Гиперссылка = Истина;
	Элемент.ПутьКДанным = "Объект.упоПроектнаяЗадачаЗеркало";
	Элемент.Заголовок = НСтр("ru = 'Связано с проектной задачей'");
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьСвязиПараметровВыбораДоговораКонтрагента(ЭлементУправленияДоговор, ПутьКДаннымКонтрагента) Экспорт
	
	// В PM справочник "Договоры контрагентов" подчинен справочнику "Контрагенты".
	// В ERP связь надо устнавливать по значению реквизита объекта "Контрагент".
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
		Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", ПутьКДаннымКонтрагента);
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		
		Для каждого ЭлСвязьПараметровВыбора Из ЭлементУправленияДоговор.СвязиПараметровВыбора Цикл
			Если ЭлСвязьПараметровВыбора.Имя = "Отбор.Владелец" Тогда
				Продолжить;
			КонецЕсли;
			НовыйМассив.Добавить(ЭлСвязьПараметровВыбора);
		КонецЦикла;
		
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		ЭлементУправленияДоговор.СвязиПараметровВыбора = НовыеСвязи;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьХозОперациюФактДоходовРасходовПроектногоБюджетирования(Параметры = Неопределено) Экспорт
	
	МенеджерНастроекОпераций = Справочники["НастройкиХозяйственныхОпераций"];
	НастройкаОперации = МенеджерНастроекОпераций["упоФактПроектногоБюджетирования"].ПолучитьОбъект();
	
	НастройкаОперации["ИсточникДанных"] = "упоФактДоходовИРасходовОбороты";
	НастройкаОперации["ПредставлениеИсточникаДанных"] = "Факт доходов и расходов (Обороты)";
	НастройкаОперации["ИспользоватьВМеждународномУчете"] = Истина;
	НастройкаОперации["ХозяйственнаяОперация"] = Перечисления.ХозяйственныеОперации.упоФактПроектногоБюджетирования;
	
	НастройкаОперации["ПоказателиРегистра"].Очистить();
	ТипыПоказателей = Новый Массив;
	ТипыПоказателей.Добавить(упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ПоказателиАналитическихРегистров.Сумма"));
	ТипыПоказателей.Добавить(упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ПоказателиАналитическихРегистров.СуммаВВалюте"));
	Для Каждого ТипПоказателя Из ТипыПоказателей Цикл
		Показатель = НастройкаОперации["ПоказателиРегистра"].Добавить();
		Показатель.Показатель = ТипПоказателя;
		Показатель.Использование = Истина;
	КонецЦикла;
	
	НастройкаОперации["Документы"].Очистить();
	Документ = НастройкаОперации["Документы"].Добавить();
	Документ.ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Документы.упоОтражениеФактаВПроектномБюджетировании);
	Если упоИнтеграцияКлиентСервер.ЕстьРеквизитПредставлениеДокументаВСправочникеНастройкиХозяйственныхОпераций() Тогда
		Документ.ПредставлениеДокумента = Документ.ИдентификаторОбъектаМетаданных.Синоним;
	КонецЕсли;
	
	НастройкаОперации["ФункциональныеОпции"].Очистить();
	ФО = НастройкаОперации["ФункциональныеОпции"].Добавить();
	ФО.ИмяФункциональнойОпции = "упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании";
	
	НастройкаОперации.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьВладельцаУпаковкиЕдИзмерения(Объект) Экспорт
	
	Если НЕ (упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() ИЛИ упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2()) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Владелец = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Знач ДанныеЗаполнения, Объект) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗНЧ(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ЗаявкаНаРасходованиеДенежныхСредств") Тогда
			ДанныеЗаполнения = ДанныеЗаполнения.ЗаявкаНаРасходованиеДенежныхСредств;
			
			РасшифровкаЗаполнена = ЗаполнитьРасшифровкуПоРегистру_упоДенежныеСредстваКВыплате(Объект, ДанныеЗаполнения);
			Если РасшифровкаЗаполнена Тогда
				Возврат; // Возврат.
			КонецЕсли;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ДанныеЗаполнения = ДанныеЗаполнения.ДокументОснование;	
		КонецЕсли;

	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Если ДанныеЗаполнения.Количество() = 1 Тогда
			ДанныеЗаполнения = ДанныеЗаполнения[0];
		КонецЕсли;
	КонецЕсли;
	
	ПроектнаяЗадачаЗеркало = ПроектнаяЗадачаПоДаннымЗаполнения(ДанныеЗаполнения);
	Если Не ЗначениеЗаполнено(ПроектнаяЗадачаЗеркало) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОснования = РеквизитыОснования(ДанныеЗаполнения);
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадачаЗеркало, "упоКорневойПроект");
	
	ЗаполнениеУспешно = ЗаполнитьРеквизитыШапки(Объект, Проект, ПроектнаяЗадачаЗеркало, РеквизитыОснования);
	Если ЗаполнениеУспешно Тогда
		ЗаполнитьРеквизитыТабличныхЧастей(Объект, Проект, ПроектнаяЗадачаЗеркало);
	КонецЕсли;
	
КонецПроцедуры

Функция ОтражатьФактРасходаПриПриобретенииТоваров() Экспорт
	Возврат Константы.упоОтражатьФактРасходаПриПриобретенииТоваров.Получить();
КонецФункции

Функция СтатьяРасходовПриПриобретенииТоваров() Экспорт
	Возврат Константы.упоСтатьяРасходовПриПриобретенииТоваров.Получить();
КонецФункции

Функция НазначениеПоНаправлениюДеятельности(НаправлениеДеятельности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Назначения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Назначения КАК Назначения
		|ГДЕ
		|	Назначения.НаправлениеДеятельности = &НаправлениеДеятельности
		|
		|УПОРЯДОЧИТЬ ПО
		|	Назначения.Заказ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура РассчитатьЭлементыСпискаБюджетаКДобавлению(ДобавляемыеКолонки) Экспорт
	
	Для Каждого ДобавляемаяКолонка Из ДобавляемыеКолонки Цикл
		Если ДобавляемаяКолонка.Имя = "Проекты" Тогда
			ДобавляемаяКолонка.Вставить("ПараметрыВыбора", Новый Структура("Отбор, Значение", "ЭтоГруппа", Ложь));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура сохраняет показатели.
//
// Параметры:
//  Форма	 - Форма элемента справочника.
//
Процедура СохранитьРеквизитыКонтрагентаПартнера(Форма) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.КонтрагентПартнера) Тогда
		Возврат;
	КонецЕсли;
	
	КонтрагентОбъект = Форма.КонтрагентПартнера.ПолучитьОбъект();
	
	Если Константы.упоИспользоватьНормированиеИПроектныеРешения.Получить() Тогда
		
		КонтрагентОбъект.упоПоказатели.Очистить();
		
		Для Каждого СтрТз Из Форма.упоПоказатели Цикл
			НовСтр = КонтрагентОбъект.упоПоказатели.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрТз);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не Константы["ИспользоватьПартнеровИКонтрагентов"].Получить() Тогда
		ЗаполнитьЗначенияСвойств(КонтрагентОбъект, Форма,
			"упоОсновнойДоговорКонтрагента, упоНаправлениеДеятельности, упоСхемаОплаты");
	КонецЕсли;
	
	КонтрагентОбъект.Записать();
	
КонецПроцедуры

Функция СоздатьСвязатьСтатьюДР_изERPвPM(СтатьяИнтеграция) Экспорт
	
	ДопИнформацияОСтатьеУПО = Неопределено;
	обСтатьяУПО = Неопределено;
	НужноЗаписатьСвязь = Ложь;
	
	Если ТипЗнч(СтатьяИнтеграция) = Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов") Тогда
		СправочникМенеджерУПО = Справочники.упоСтатьиДоходов;
	Иначе
		СправочникМенеджерУПО = Справочники.упоСтатьиЗатрат;
	КонецЕсли;
	
	ЭлементРодитель = СправочникМенеджерУПО.ПустаяСсылка();
	
	РеквизитыСтатьиИнтеграция = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяИнтеграция,
			"Наименование, ПометкаУдаления, ЭтоГруппа, Родитель");
	
	Если ЗначениеЗаполнено(РеквизитыСтатьиИнтеграция.Родитель) Тогда
		ЭлементРодитель = упоИнтеграция.СоздатьСвязатьСтатьюДР(РеквизитыСтатьиИнтеграция.Родитель);
	КонецЕсли;
	
	СтатьяУПО = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(СтатьяИнтеграция, ДопИнформацияОСтатьеУПО);
	
	Если Не ЗначениеЗаполнено(СтатьяУПО) Тогда
		
		обСтатьяУПО = упоИнтеграция.НовыйОбъектСИдентификаторомИсходного(СправочникМенеджерУПО,
				СтатьяИнтеграция,
				РеквизитыСтатьиИнтеграция.ЭтоГруппа);
		
		НужноЗаписатьСвязь = Истина;
		
	Иначе
		
		ДлинаНаименованияУПО = СтатьяУПО.Метаданные().ДлинаНаименования;
		
		Если ДопИнформацияОСтатьеУПО.Наименование <> Лев(РеквизитыСтатьиИнтеграция.Наименование, ДлинаНаименованияУПО)
			ИЛИ ДопИнформацияОСтатьеУПО.ПометкаУдаления <> РеквизитыСтатьиИнтеграция.ПометкаУдаления
			ИЛИ ДопИнформацияОСтатьеУПО.Родитель <> ЭлементРодитель Тогда
			
			обСтатьяУПО = СтатьяУПО.ПолучитьОбъект();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если обСтатьяУПО <> Неопределено Тогда
		
		обСтатьяУПО.ДополнительныеСвойства.Вставить("НеСинхронизироватьСтатьиДР", Истина);
		обСтатьяУПО.Наименование = РеквизитыСтатьиИнтеграция.Наименование;
		обСтатьяУПО.ПометкаУдаления = РеквизитыСтатьиИнтеграция.ПометкаУдаления;
		обСтатьяУПО.Родитель = ЭлементРодитель;
		обСтатьяУПО.Записать();
		СтатьяУПО = обСтатьяУПО.Ссылка;
		
	КонецЕсли;
	
	Если НужноЗаписатьСвязь Тогда
		
		Запись = РегистрыСведений.упоСоответствиеСтатейДР.СоздатьМенеджерЗаписи();
		Запись.СтатьяИнтеграция = СтатьяИнтеграция;
		Запись.СтатьяУПО = СтатьяУПО;
		Запись.Записать();
		
	КонецЕсли;
	
	Возврат СтатьяУПО;
	
КонецФункции

Функция СоздатьСвязатьСтатьюДР_изPMвERP(СтатьяPM) Экспорт
	
	СсылкаНаСтатью = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(СтатьяPM);
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаСтатью) Тогда
		
		Если ТипЗнч(СтатьяPM) = Тип("СправочникСсылка.упоСтатьиДоходов") Тогда
			ПВХМенеджер = ПланыВидовХарактеристик.СтатьиДоходов;
		Иначе
			ПВХМенеджер = ПланыВидовХарактеристик.СтатьиРасходов;
		КонецЕсли;
		
		НоваяСсылка = Неопределено;
		НоваяСтатья = упоИнтеграция.НовыйОбъектСИдентификаторомИсходного(ПВХМенеджер,
				СтатьяPM,
				СтатьяPM.ЭтоГруппа,
				НоваяСсылка);
		
		НоваяСтатья.Наименование = СтатьяPM.Наименование;
		НоваяСтатья.ПометкаУдаления = СтатьяPM.ПометкаУдаления;
		НоваяСтатья.Код = СтатьяPM.Код;
		
		Если ЗначениеЗаполнено(СтатьяPM.Родитель) Тогда
			РодительERP = СоздатьСвязатьСтатьюДР_изPMвERP(СтатьяPM.Родитель);
			НоваяСтатья.Родитель = РодительERP;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.упоСоответствиеСтатейДР.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.СтатьяИнтеграция = НоваяСсылка;
		МенеджерЗаписи.СтатьяУПО = СтатьяPM;
		
		НоваяСтатья.ДополнительныеСвойства.Вставить("НеСинхронизироватьСтатьиДР", Истина);
		
		НачатьТранзакцию();
		
		МенеджерЗаписи.Записать();
		НоваяСтатья.Записать();
		
		ЗафиксироватьТранзакцию();
		
		СсылкаНаСтатью = НоваяСтатья.Ссылка;
		
	КонецЕсли;
	
	Возврат СсылкаНаСтатью;
	
КонецФункции

// Заполняет проектными задачами табличные части документов.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Данные формы документов "Реализация товаров и услуг",
//			"Приобретение товаров и услуг" или "Акт выполненных работ".
//
Процедура ТоварыУслугиЗаполнитьПроектныеЗадачи(Объект) Экспорт
	
	ИменаМетаданных = ИменаМетаданныхДокументаДляЗаполненияПроектныхЗадач(Объект);
	
	ИмяТЧ = ИменаМетаданных.ИмяТабличнойЧасти;
	ИмяДокументаЗаказа = ИменаМетаданных.ИмяРеквизита;
	
	МассивЗаказов = Новый Массив;
	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТЧ] Цикл
		ДокументЗаказ = СтрокаТабличнойЧасти[ИмяДокументаЗаказа];
		Если Не ЗначениеЗаполнено(ДокументЗаказ) Тогда
			Продолжить;
		КонецЕсли;
		МассивЗаказов.Добавить(ДокументЗаказ);
	КонецЦикла;
	
	Если МассивЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеПЗиЗаказов = ПолучитьСоответствиеПЗиЗаказов(ИмяДокументаЗаказа, МассивЗаказов);
	
	ЗаполнитьПроектныеЗадачиПоЗаказамВТабличнойЧасти(Объект, СоответствиеПЗиЗаказов, ИмяДокументаЗаказа, ИмяТЧ);
	
КонецПроцедуры

Функция ИменаМетаданныхДокументаДляЗаполненияПроектныхЗадач(Объект)
	
	СоответствиеТипаДокументаИменамМетаданных = Новый Соответствие;
	СоответствиеТипаДокументаИменамМетаданных.Вставить(Тип("ДокументСсылка.РеализацияТоваровУслуг"),
		Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита", "Товары", "ЗаказКлиента"));
	СоответствиеТипаДокументаИменамМетаданных.Вставить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"),
		Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита", "Товары", "ЗаказПоставщику"));
	СоответствиеТипаДокументаИменамМетаданных.Вставить(Тип("ДокументСсылка.АктВыполненныхРабот"),
		Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита", "Услуги", "ЗаказКлиента"));
	
	ТипДокумента = ТипЗнч(Объект.Ссылка);
	
	ИменаМетаданных = СоответствиеТипаДокументаИменамМетаданных.Получить(ТипДокумента);
	
	Если ИменаМетаданных = Неопределено Тогда
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Заполнение проектными задачами табличной части документа ""%1"" не поддерживается.'"),
			ТипДокумента);
		ВызватьИсключение(ТекстИсключения);
	КонецЕсли;
	
	Возврат ИменаМетаданных;
		
КонецФункции

Функция ПолучитьПодстрокуОбъектаРасчетовДляЗапроса()
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5() Тогда
		Подстрока = "РасшифровкаПлатежа.ОбъектРасчетов.Договор";
	Иначе
		Подстрока = "РасшифровкаПлатежа.Заказ.Договор";
	КонецЕсли;
	
	Возврат Подстрока;
	
КонецФункции

// Поиск проектной задачи в данных заполнения.
Функция ПроектнаяЗадачаПоДаннымЗаполнения(ДанныеЗаполнения) Экспорт 
	
	ПроектнаяЗадачаЗеркало = Неопределено;
	
	Если ТипЗНЧ(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		
		ПроектнаяЗадачаЗеркало = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗНЧ(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		НаправлениеДеятельности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "НаправлениеДеятельности");
		ПроектнаяЗадачаЗеркало = упоСвязьПроектаСНаправлениемДеятельности.ПолучитьЭлементПоНаправлениюДеятельности(НаправлениеДеятельности);
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		
		МетаданныеОснования = ДанныеЗаполнения.Метаданные();
		
		Если ТипЗНЧ(ДанныеЗаполнения) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			ПроектнаяЗадачаЗеркало = ДанныеЗаполнения;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("упоПроектнаяЗадача", МетаданныеОснования) Тогда
			ПроектнаяЗадачаЗеркало = ДанныеЗаполнения.упоПроектнаяЗадача;
		ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ДокументОснование", МетаданныеОснования)
			И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование)
			И ОбщегоНазначения.ЕстьРеквизитОбъекта("упоПроектнаяЗадача", ДанныеЗаполнения.ДокументОснование.Метаданные()) Тогда
			ПроектнаяЗадачаЗеркало = ДанныеЗаполнения.ДокументОснование.упоПроектнаяЗадача;
		Иначе
			Для Каждого ТабличнаяЧасть Из МетаданныеОснования.ТабличныеЧасти Цикл
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("упоПроектнаяЗадача", ТабличнаяЧасть) И ДанныеЗаполнения[ТабличнаяЧасть.Имя].Количество() > 0 Тогда
					
					ТаблицаПЗ = ДанныеЗаполнения[ТабличнаяЧасть.Имя].Выгрузить( , "упоПроектнаяЗадача");
					ТаблицаПЗ.Свернуть("упоПроектнаяЗадача");
					ТаблицаПЗ.Сортировать("упоПроектнаяЗадача Убыв");
					
					ПроектнаяЗадачаЗеркало = ТаблицаПЗ[0].упоПроектнаяЗадача;
					Если ЗначениеЗаполнено(ПроектнаяЗадачаЗеркало) Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПроектнаяЗадачаЗеркало;
	
КонецФункции

Процедура ЗаполнитьДанныеКонтрагентаПартнераPM(Приемник, Партнер) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка КАК КонтрагентПартнера,
	               |	Контрагенты.упоОсновнойДоговорКонтрагента КАК упоОсновнойДоговорКонтрагента,
	               |	Контрагенты.упоНаправлениеДеятельности КАК упоНаправлениеДеятельности,
	               |	Контрагенты.упоСхемаОплаты КАК упоСхемаОплаты,
	               |	Контрагенты.упоПроектнаяЗадачаПоУмолчаниюДДС КАК упоПроектнаяЗадачаПоУмолчаниюДДС
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер",Партнер);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();

	Если Выборка.Следующий() Тогда
	
		ЗаполнитьЗначенияСвойств(Приемник, Выборка);
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтражениеФактаДоходовРасходов

Функция ИспользуетсяОтражениеФактаДоходовПервичнымиДокументами()
	
	Если Не упоИнтеграцияКлиентСервер.ИнтеграцияСПервичнымиДокументами() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Константы.упоОтражатьФактДоходовПервичнымиДокументами.Получить();
КонецФункции

Функция ИспользуетсяОтражениеФактаРасходовПервичнымиДокументами()
	Возврат Константы.упоОтражатьФактРасходовПервичнымиДокументами.Получить();
КонецФункции

Функция ИспользуетсяОтражениеФактаДДСПервичнымиДокументами()
	Возврат Константы.упоОтражатьФактДДСПервичнымиДокументами.Получить();
КонецФункции

Функция ВключатьНДСВФактДоходовПервичныхДокументов()
	Возврат Константы.упоВключатьНДСВФактДоходовПервичныхДокументов.Получить();
КонецФункции

Функция ВключатьНДСВФактРасходовПервичныхДокументов()
	Возврат Константы.упоВключатьНДСВФактРасходовПервичныхДокументов.Получить();
КонецФункции

Функция СтрокиКЗаполнениюСуммыУправленческогоУчета(ТаблицаИсточник)
	
	Строки = ТаблицаИсточник.СкопироватьКолонки();
	
	// Удалим строки с отсутствующей суммой упр. учета.
	СтрокиКУдалениюВИсточнике = Новый Массив;
	Для каждого СтрокаИсточник Из ТаблицаИсточник Цикл
		Если СтрокаИсточник.Сумма = 0 Тогда
			НоваяСтрока = Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
			СтрокиКУдалениюВИсточнике.Добавить(СтрокаИсточник);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из СтрокиКУдалениюВИсточнике Цикл
		ТаблицаИсточник.Удалить(Строка);
	КонецЦикла;
		
	Возврат Строки;
	
КонецФункции

#КонецОбласти

#Область ЗапросыДР

// Текст запроса фактические движения БДР поступление товаров услуг.
//
// Возвращаемое значение:
//  Строка - текст запроса.
Функция ТекстЗапросаФактическиеДвиженияБДР_ПриобретениеТоваровУслуг()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   СуммыДокументовВВалютахУчетаСрезПоследних.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДС
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС
		|   КОНЕЦ КАК СуммаВалютная,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДСУпр
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр
		|   КОНЕЦ КАК СуммаВзаиморасчетов
		|ПОМЕСТИТЬ ВТ_ДанныеВалютныхСуммДокумента
		|ИЗ
		|   РегистрСведений.СуммыДокументовВВалютахУчета.СрезПоследних(, (ВЫРАЗИТЬ(Регистратор КАК Документ.ПриобретениеТоваровУслуг)) = &Ссылка) КАК СуммыДокументовВВалютахУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ПриобретениеТоваровУслугТовары.упоПроектнаяЗадача КАК упоПроектнаяЗадача,
		|   ПриобретениеТоваровУслугТовары.упоРоль КАК упоРоль,
		|   ПриобретениеТоваровУслугТовары.упоПодразделение КАК упоПодразделение,
		|   ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|   ВЫБОР
		|       КОГДА ПриобретениеТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|           ТОГДА ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
		|       ИНАЧЕ ПриобретениеТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
		|   КОНЕЦ КАК Упаковка,
		|   ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
		|   ПриобретениеТоваровУслугТовары.СтатьяРасходов КАК СтатьяРасходов,
		|   ПриобретениеТоваровУслугТовары.СуммаСНДС КАК СуммаСНДС,
		|   ПриобретениеТоваровУслугТовары.Сумма КАК Сумма,
		|   ПриобретениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|   ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|   ПриобретениеТоваровУслугТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|   Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|   ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
		|   И ПриобретениеТоваровУслугТовары.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|   И ПриобретениеТоваровУслугТовары.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|   ПриобретениеТоваровУслугТовары.упоПроектнаяЗадача,
		|   ПриобретениеТоваровУслугТовары.упоРоль,
		|   ПриобретениеТоваровУслугТовары.упоПодразделение,
		|   ПриобретениеТоваровУслугТовары.Номенклатура,
		|   ВЫБОР
		|       КОГДА ПриобретениеТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|           ТОГДА ПриобретениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
		|       ИНАЧЕ ПриобретениеТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
		|   КОНЕЦ,
		|   ПриобретениеТоваровУслугТовары.Ссылка,
		|   ВЫБОР
		|       КОГДА ПриобретениеТоваровУслугТовары.Номенклатура.упоСтатьяРасходовПриПриобретенииТоваров = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|           ТОГДА &упоСтатьяРасходовПриПриобретенииТоваров
		|       ИНАЧЕ ПриобретениеТоваровУслугТовары.Номенклатура.упоСтатьяРасходовПриПриобретенииТоваров
		|   КОНЕЦ,
		|   ПриобретениеТоваровУслугТовары.СуммаСНДС,
		|   ПриобретениеТоваровУслугТовары.Сумма,
		|   ПриобретениеТоваровУслугТовары.СуммаНДС,
		|   ПриобретениеТоваровУслугТовары.КоличествоУпаковок,
		|   ПриобретениеТоваровУслугТовары.ИдентификаторСтроки
		|ИЗ
		|   Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|   ПриобретениеТоваровУслугТовары.Ссылка = &Ссылка
		|   И ПриобретениеТоваровУслугТовары.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|   И ПриобретениеТоваровУслугТовары.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
		|   И &упоОтражатьФактРасходаПриПриобретенииТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТТовары.Ссылка.Дата КАК Период,
		|   ВТТовары.Ссылка.Дата КАК ДатаНачисления,
		|   ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
		|   ВТТовары.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|   упоСоответствиеСтатейДР.СтатьяУПО КАК Статья,
		|   ВТТовары.упоРоль КАК Роль,
		|   ВТТовары.упоПодразделение КАК Подразделение,
		|   ВТТовары.Номенклатура КАК Номенклатура,
		|   ВТТовары.Упаковка КАК ЕдиницаИзмерения,
		|   ВТТовары.Ссылка.Контрагент КАК Контрагент,
		|   ВТТовары.Ссылка.Договор КАК Договор,
		|   ВТТовары.Ссылка.Валюта КАК Валюта,
		|   ВТТовары.упоРоль.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   ВТТовары.Ссылка.Контрагент КАК КонтрагентПодрядчик,
		|   ВТТовары.Ссылка.Договор КАК Заказ_ДоговорПодрядчика,
		|   ЕСТЬNULL(ВЫБОР
		|       КОГДА ВТТовары.Ссылка.Валюта = &ВалютаУправленческогоУчета
		|           ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная
		|       ИНАЧЕ ВЫБОР
		|               КОГДА ВТТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|                   ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВзаиморасчетов
		|               ИНАЧЕ 0
		|           КОНЕЦ
		|   КОНЕЦ, 0) КАК Сумма,
		|   ЕСТЬNULL(ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная, ВЫБОР
		|           КОГДА &ВключатьНДСВФактДоходовРасходов
		|               ТОГДА ВТТовары.СуммаСНДС
		|           ИНАЧЕ ВТТовары.СуммаСНДС - ВТТовары.СуммаНДС
		|       КОНЕЦ) КАК СуммаВалютная,
		|   ВТТовары.КоличествоУпаковок КАК Количество
		|ИЗ
		|   ВТТовары КАК ВТТовары
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСтатейДР КАК упоСоответствиеСтатейДР
		|       ПО ВТТовары.СтатьяРасходов = упоСоответствиеСтатейДР.СтатьяИнтеграция
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеВалютныхСуммДокумента КАК ВТ_ДанныеВалютныхСуммДокумента
		|       ПО ВТТовары.ИдентификаторСтроки = ВТ_ДанныеВалютныхСуммДокумента.ИдентификаторСтроки";
	
	ИмяТаблицы = "ВТТовары";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса фактические движения БДР реализация товаров услуг.
//
// Возвращаемое значение:
//  Строка - текст запроса.
Функция ТекстЗапросаФактическиеДвиженияБДР_РеализацияТоваровУслуг()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   СуммыДокументовВВалютахУчетаСрезПоследних.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДС
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС
		|   КОНЕЦ КАК СуммаВалютная,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДСУпр
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр
		|   КОНЕЦ КАК СуммаВзаиморасчетов
		|ПОМЕСТИТЬ ВТ_ДанныеВалютныхСуммДокумента
		|ИЗ
		|   РегистрСведений.СуммыДокументовВВалютахУчета.СрезПоследних(, ВЫРАЗИТЬ(Регистратор КАК Документ.РеализацияТоваровУслуг) = &Ссылка) КАК СуммыДокументовВВалютахУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   РеализацияТоваровУслугТовары.Ссылка.Дата КАК Период,
		|   РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаНачисления,
		|   ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
		|   РеализацияТоваровУслугТовары.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|   упоСоответствиеСтатейДР.СтатьяУПО КАК Статья,
		|   РеализацияТоваровУслугТовары.упоРоль КАК Роль,
		|   РеализацияТоваровУслугТовары.упоРоль.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   РеализацияТоваровУслугТовары.упоПодразделение КАК Подразделение,
		|   РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|   ВЫБОР
		|       КОГДА РеализацияТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|           ТОГДА РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
		|       ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
		|   КОНЕЦ КАК ЕдиницаИзмерения,
		|   РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
		|   РеализацияТоваровУслугТовары.Ссылка.Договор КАК Договор,
		|   РеализацияТоваровУслугТовары.Ссылка.Валюта КАК Валюта,
		|   РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК КонтрагентПодрядчик,
		|   РеализацияТоваровУслугТовары.Ссылка.Договор КАК Заказ_ДоговорПодрядчика,
		|   ЕСТЬNULL(ВЫБОР
		|       КОГДА РеализацияТоваровУслугТовары.Ссылка.Валюта = &ВалютаУправленческогоУчета
		|           ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная
		|       ИНАЧЕ ВЫБОР
		|               КОГДА РеализацияТоваровУслугТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|                   ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВзаиморасчетов
		|               ИНАЧЕ 0
		|           КОНЕЦ
		|   КОНЕЦ, 0) КАК Сумма,
		|   ЕСТЬNULL(ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная, ВЫБОР
		|           КОГДА &ВключатьНДСВФактДоходовРасходов
		|               ТОГДА РеализацияТоваровУслугТовары.СуммаСНДС
		|           ИНАЧЕ РеализацияТоваровУслугТовары.СуммаСНДС - РеализацияТоваровУслугТовары.СуммаНДС
		|       КОНЕЦ) КАК СуммаВалютная,
		|   РеализацияТоваровУслугТовары.КоличествоУпаковок КАК Количество
		|ИЗ
		|   Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСтатейДР КАК упоСоответствиеСтатейДР
		|       ПО РеализацияТоваровУслугТовары.упоСтатьяДоходов = упоСоответствиеСтатейДР.СтатьяИнтеграция
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеВалютныхСуммДокумента КАК ВТ_ДанныеВалютныхСуммДокумента
		|       ПО РеализацияТоваровУслугТовары.ИдентификаторСтроки = ВТ_ДанныеВалютныхСуммДокумента.ИдентификаторСтроки
		|ГДЕ
		|   РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|   И РеализацияТоваровУслугТовары.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
	
	ИмяТаблицы = "РеализацияТоваровУслугТовары";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса фактические движения БДР акт выполненных работ.
//
// Возвращаемое значение:
//  Строка - текст запроса.
Функция ТекстЗапросаФактическиеДвиженияБДР_АктВыполненныхРабот()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   СуммыДокументовВВалютахУчетаСрезПоследних.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДС
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС
		|   КОНЕЦ КАК СуммаВалютная,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДСУпр
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр
		|   КОНЕЦ КАК СуммаВзаиморасчетов
		|ПОМЕСТИТЬ ВТ_ДанныеВалютныхСуммДокумента
		|ИЗ
		|   РегистрСведений.СуммыДокументовВВалютахУчета.СрезПоследних(, (ВЫРАЗИТЬ(Регистратор КАК Документ.АктВыполненныхРабот)) = &Ссылка) КАК СуммыДокументовВВалютахУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   АктВыполненныхРаботУслуги.Ссылка.Дата КАК Период,
		|   АктВыполненныхРаботУслуги.Ссылка.Дата КАК ДатаНачисления,
		|   ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
		|   АктВыполненныхРаботУслуги.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|   упоСоответствиеСтатейДР.СтатьяУПО КАК Статья,
		|   АктВыполненныхРаботУслуги.упоРоль КАК Роль,
		|   АктВыполненныхРаботУслуги.упоРоль.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   АктВыполненныхРаботУслуги.упоПодразделение КАК Подразделение,
		|   АктВыполненныхРаботУслуги.Номенклатура КАК Номенклатура,
		|   АктВыполненныхРаботУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|   АктВыполненныхРаботУслуги.Ссылка.Контрагент КАК Контрагент,
		|   АктВыполненныхРаботУслуги.Ссылка.Договор КАК Договор,
		|   АктВыполненныхРаботУслуги.Ссылка.Валюта КАК Валюта,
		|   АктВыполненныхРаботУслуги.Ссылка.Контрагент КАК КонтрагентПодрядчик,
		|   АктВыполненныхРаботУслуги.Ссылка.Договор КАК Заказ_ДоговорПодрядчика,
		|   ЕСТЬNULL(ВЫБОР
		|       КОГДА АктВыполненныхРаботУслуги.Ссылка.Валюта = &ВалютаУправленческогоУчета
		|           ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная
		|       ИНАЧЕ ВЫБОР
		|               КОГДА АктВыполненныхРаботУслуги.Ссылка.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|                   ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВзаиморасчетов
		|               ИНАЧЕ 0
		|           КОНЕЦ
		|   КОНЕЦ, 0) КАК Сумма,
		|   ЕСТЬNULL(ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная, ВЫБОР
		|           КОГДА &ВключатьНДСВФактДоходовРасходов
		|               ТОГДА АктВыполненныхРаботУслуги.СуммаСНДС
		|           ИНАЧЕ АктВыполненныхРаботУслуги.СуммаСНДС - АктВыполненныхРаботУслуги.СуммаНДС
		|       КОНЕЦ) КАК СуммаВалютная,
		|   АктВыполненныхРаботУслуги.Количество КАК Количество
		|ИЗ
		|   Документ.АктВыполненныхРабот.Услуги КАК АктВыполненныхРаботУслуги
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСтатейДР КАК упоСоответствиеСтатейДР
		|       ПО АктВыполненныхРаботУслуги.упоСтатьяДоходов = упоСоответствиеСтатейДР.СтатьяИнтеграция
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеВалютныхСуммДокумента КАК ВТ_ДанныеВалютныхСуммДокумента
		|       ПО АктВыполненныхРаботУслуги.ИдентификаторСтроки = ВТ_ДанныеВалютныхСуммДокумента.ИдентификаторСтроки
		|ГДЕ
		|   АктВыполненныхРаботУслуги.Ссылка = &Ссылка
		|   И АктВыполненныхРаботУслуги.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
	
	ИмяТаблицы = "АктВыполненныхРаботУслуги";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса принятые объемы акт выполненных работ.
//
// Возвращаемое значение:
//  Строка - текст запроса.
Функция ТекстЗапросаПринятыеОбъемы_АктВыполненныхРабот()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   СуммыДокументовВВалютахУчетаСрезПоследних.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДС
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС
		|   КОНЕЦ КАК СуммаВалютная,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДСУпр
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр
		|   КОНЕЦ КАК СуммаВзаиморасчетов
		|ПОМЕСТИТЬ ВТ_ДанныеВалютныхСуммДокумента
		|ИЗ
		|   РегистрСведений.СуммыДокументовВВалютахУчета.СрезПоследних(, (ВЫРАЗИТЬ(Регистратор КАК Документ.АктВыполненныхРабот)) = &Источник) КАК СуммыДокументовВВалютахУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   АВР.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|   АВР.Ссылка.Контрагент КАК Контрагент,
		|   АВР.Ссылка.Договор КАК Договор,
		|   АВР.Ссылка.Валюта КАК Валюта,
		|   АВР.Ссылка.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|   АВР.упоПодразделение КАК Подразделение,
		|   АВР.упоРоль КАК Роль,
		|   АВР.Номенклатура КАК Номенклатура,
		|   упоСоответствиеСтатейДР.СтатьяУПО КАК Статья,
		|   АВР.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|   АВР.Ссылка.Дата КАК Период,
		|   &Расход КАК ВидДвижения,
		|   &Источник КАК Регистратор,
		|   ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
		|   АВР.упоРоль.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   АВР.Ссылка.Контрагент КАК КонтрагентПодрядчик,
		|   АВР.Ссылка.Договор КАК Заказ_ДоговорПодрядчика,
		|   АВР.СуммаВзаиморасчетов КАК Сумма,
		|   АВР.Сумма КАК СуммаВалютная,
		|   АВР.СуммаНДС КАК СуммаНДС,
		|   АВР.СуммаСНДС КАК СуммаСНДС,
		|   АВР.Количество КАК Количество,
		|   АВР.упоПроектнаяЗадача.упоКорневойПроект КАК Проект,
		|   АВР.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТ_АВР
		|ИЗ
		|   Документ.АктВыполненныхРабот.Услуги КАК АВР
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСтатейДР КАК упоСоответствиеСтатейДР
		|       ПО АВР.упоСтатьяДоходов = упоСоответствиеСтатейДР.СтатьяИнтеграция
		|ГДЕ
		|   АВР.Ссылка = &Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_АВР.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_АВР.Контрагент КАК Контрагент,
		|   ВТ_АВР.Договор КАК Договор,
		|   ВТ_АВР.Валюта КАК Валюта,
		|   ВТ_АВР.Подразделение КАК Подразделение,
		|   ВТ_АВР.Роль КАК Роль,
		|   ВТ_АВР.Номенклатура КАК Номенклатура,
		|   ВТ_АВР.Статья КАК Статья,
		|   ВТ_АВР.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|   ВТ_АВР.Период КАК Период,
		|   ВТ_АВР.ВидДвижения КАК ВидДвижения,
		|   ВТ_АВР.Регистратор КАК Регистратор,
		|   ВТ_АВР.ВидОбъема КАК ВидОбъема,
		|   ВТ_АВР.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   ВТ_АВР.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|   ВТ_АВР.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
		|   ЕСТЬNULL(ВЫБОР
		|       КОГДА ВТ_АВР.Валюта = &ВалютаУправленческогоУчета
		|           ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная
		|       ИНАЧЕ ВЫБОР
		|               КОГДА ВТ_АВР.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|                   ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВзаиморасчетов
		|               ИНАЧЕ 0
		|           КОНЕЦ
		|   КОНЕЦ, 0) КАК Сумма,
		|   ЕСТЬNULL(ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная, ВЫБОР
		|           КОГДА &ВключатьНДСВФактДоходовРасходов
		|               ТОГДА ВТ_АВР.СуммаСНДС
		|           ИНАЧЕ ВТ_АВР.СуммаСНДС - ВТ_АВР.СуммаНДС
		|       КОНЕЦ) КАК СуммаВалютная,
		|   ВТ_АВР.Количество КАК Количество,
		|   ВТ_АВР.Номенклатура КАК Субпродукт,
		|   ВТ_АВР.Период КАК День,
		|   ВТ_АВР.Проект КАК Проект,
		|   1 КАК Коэффициент
		|ИЗ
		|   ВТ_АВР КАК ВТ_АВР
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеВалютныхСуммДокумента КАК ВТ_ДанныеВалютныхСуммДокумента
		|       ПО ВТ_АВР.ИдентификаторСтроки = ВТ_ДанныеВалютныхСуммДокумента.ИдентификаторСтроки
		|ГДЕ
		|   ВТ_АВР.ПроектнаяЗадача <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса принятые объемы реализация товаров и услуг.
//
// Возвращаемое значение:
//  Строка - текст запроса.
Функция ТекстЗапросаПринятыеОбъемы_РеализацияТоваровУслуг()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   СуммыДокументовВВалютахУчетаСрезПоследних.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДС
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДС
		|   КОНЕЦ КАК СуммаВалютная,
		|   ВЫБОР
		|       КОГДА &ВключатьНДСВФактДоходовРасходов
		|           ТОГДА СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр + СуммыДокументовВВалютахУчетаСрезПоследних.СуммаНДСУпр
		|       ИНАЧЕ СуммыДокументовВВалютахУчетаСрезПоследних.СуммаБезНДСУпр
		|   КОНЕЦ КАК СуммаВзаиморасчетов
		|ПОМЕСТИТЬ ВТ_ДанныеВалютныхСуммДокумента
		|ИЗ
		|   РегистрСведений.СуммыДокументовВВалютахУчета.СрезПоследних(, (ВЫРАЗИТЬ(Регистратор КАК Документ.РеализацияТоваровУслуг)) = &Источник) КАК СуммыДокументовВВалютахУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   РТУ.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|   РТУ.Ссылка.Контрагент КАК Контрагент,
		|   РТУ.Ссылка.Договор КАК Договор,
		|   РТУ.Ссылка.Валюта КАК Валюта,
		|   РТУ.Ссылка.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|   РТУ.упоПодразделение КАК Подразделение,
		|   РТУ.упоРоль КАК Роль,
		|   РТУ.Номенклатура КАК Номенклатура,
		|   упоСоответствиеСтатейДР.СтатьяУПО КАК Статья,
		|   ВЫБОР
		|       КОГДА РТУ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|           ТОГДА РТУ.Номенклатура.ЕдиницаИзмерения
		|       ИНАЧЕ РТУ.Упаковка.ЕдиницаИзмерения
		|   КОНЕЦ КАК ЕдиницаИзмерения,
		|   РТУ.Ссылка.Дата КАК Период,
		|   &Расход КАК ВидДвижения,
		|   &Источник КАК Регистратор,
		|   ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
		|   РТУ.упоРоль.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   РТУ.Ссылка.Контрагент КАК КонтрагентПодрядчик,
		|   РТУ.Ссылка.Договор КАК Заказ_ДоговорПодрядчика,
		|   РТУ.СуммаВзаиморасчетов КАК Сумма,
		|   РТУ.Сумма КАК СуммаВалютная,
		|   РТУ.СуммаНДС КАК СуммаНДС,
		|   РТУ.СуммаСНДС КАК СуммаСНДС,
		|   РТУ.Количество КАК Количество,
		|   РТУ.упоПроектнаяЗадача.упоКорневойПроект КАК Проект,
		|   РТУ.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|   Документ.РеализацияТоваровУслуг.Товары КАК РТУ
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСтатейДР КАК упоСоответствиеСтатейДР
		|       ПО РТУ.упоСтатьяДоходов = упоСоответствиеСтатейДР.СтатьяИнтеграция
		|ГДЕ
		|   РТУ.Ссылка = &Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_РТУ.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_РТУ.Контрагент КАК Контрагент,
		|   ВТ_РТУ.Договор КАК Договор,
		|   ВТ_РТУ.Валюта КАК Валюта,
		|   ВТ_РТУ.Подразделение КАК Подразделение,
		|   ВТ_РТУ.Роль КАК Роль,
		|   ВТ_РТУ.Номенклатура КАК Номенклатура,
		|   ВТ_РТУ.Статья КАК Статья,
		|   ВТ_РТУ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|   ВТ_РТУ.Период КАК Период,
		|   ВТ_РТУ.ВидДвижения КАК ВидДвижения,
		|   ВТ_РТУ.Регистратор КАК Регистратор,
		|   ВТ_РТУ.ВидОбъема КАК ВидОбъема,
		|   ВТ_РТУ.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   ВТ_РТУ.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|   ВТ_РТУ.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
		|   ЕСТЬNULL(ВЫБОР
		|       КОГДА ВТ_РТУ.Валюта = &ВалютаУправленческогоУчета
		|           ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная
		|       ИНАЧЕ ВЫБОР
		|               КОГДА ВТ_РТУ.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
		|                   ТОГДА ВТ_ДанныеВалютныхСуммДокумента.СуммаВзаиморасчетов
		|               ИНАЧЕ 0
		|           КОНЕЦ
		|   КОНЕЦ, 0) КАК Сумма,
		|   ЕСТЬNULL(ВТ_ДанныеВалютныхСуммДокумента.СуммаВалютная, ВЫБОР
		|           КОГДА &ВключатьНДСВФактДоходовРасходов
		|               ТОГДА ВТ_РТУ.СуммаСНДС
		|           ИНАЧЕ ВТ_РТУ.СуммаСНДС - ВТ_РТУ.СуммаНДС
		|       КОНЕЦ) КАК СуммаВалютная,
		|   ВТ_РТУ.Количество КАК Количество,
		|   ВТ_РТУ.Проект КАК Проект,
		|   ВТ_РТУ.Период КАК День,
		|   ВТ_РТУ.Номенклатура КАК Субпродукт,
		|   1 КАК Коэффициент
		|ИЗ
		|   ВТ_РТУ КАК ВТ_РТУ
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеВалютныхСуммДокумента КАК ВТ_ДанныеВалютныхСуммДокумента
		|       ПО ВТ_РТУ.ИдентификаторСтроки = ВТ_ДанныеВалютныхСуммДокумента.ИдентификаторСтроки
		|ГДЕ
		|   ВТ_РТУ.ПроектнаяЗадача <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПараметрыЗапросовДР

// Установить параметры запроса фактические движения БДР поступление товаров услуг.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
Процедура УстановитьПараметрыЗапросаФактическиеДвиженияБДР_ПриобретениеТоваровУслуг(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("упоОтражатьФактРасходаПриПриобретенииТоваров",
		ОтражатьФактРасходаПриПриобретенииТоваров());
	Запрос.УстановитьПараметр("упоСтатьяРасходовПриПриобретенииТоваров",
		СтатьяРасходовПриПриобретенииТоваров());
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("ВключатьНДСВФактДоходовРасходов", ВключатьНДСВФактРасходовПервичныхДокументов());
	
КонецПроцедуры

// Установить параметры запроса фактические движения БДР реализация товаров услуг.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
Процедура УстановитьПараметрыЗапросаФактическиеДвиженияБДР_РеализацияТоваровУслуг(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("ВключатьНДСВФактДоходовРасходов", ВключатьНДСВФактДоходовПервичныхДокументов());
	
КонецПроцедуры

// Установить параметры запроса фактические движения БДР акт выполненных работ.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
Процедура УстановитьПараметрыЗапросаФактическиеДвиженияБДР_АктВыполненныхРабот(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("ВключатьНДСВФактДоходовРасходов", ВключатьНДСВФактДоходовПервичныхДокументов());
	
КонецПроцедуры

// Установить параметры запроса для формирования движений упоВыполненныеПринятыеОбъемы акт выполненных работ.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
Процедура УстановитьПараметрыЗапросаПринятыеОбъемы_АктВыполненныхРабот(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Источник", ДокументСсылка);
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("ВключатьНДСВФактДоходовРасходов", ВключатьНДСВФактДоходовПервичныхДокументов());
	
КонецПроцедуры

// Установить параметры запроса для формирования движений упоВыполненныеПринятыеОбъемы реализация товаров услуг.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
Процедура УстановитьПараметрыЗапросаПринятыеОбъемы_РеализацияТоваровУслуг(Запрос, ДокументСсылка)
	Запрос.УстановитьПараметр("Источник", ДокументСсылка);
	Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("ВключатьНДСВФактДоходовРасходов", ВключатьНДСВФактДоходовПервичныхДокументов());
КонецПроцедуры

#КонецОбласти

#Область ЗапросыДДС

// Возвращает текст запроса для движений по регистру Фактические движения денежных средств
//  документа Поступление безналичных денежных средств.
//
// Параметры:
//  ЭтоEPM_2_5	 - Булево	 - признак интеграции с ERP 2.5.
// 
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ТекстЗапросаФактическиеДвиженияДСПоступлениеБезналичных(ЭтоEPM_2_5 = Ложь)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   ВЫБОР
		|       КОГДА НЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ПроведеноБанком
		|               ИЛИ НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком
		|           ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата
		|       ИНАЧЕ КОНЕЦПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком, ДЕНЬ)
		|   КОНЕЦ КАК Период,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.упоНаправлениеДвижения КАК НаправлениеДвижения,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
		|   ВЫБОР
		|       КОГДА НЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ПроведеноБанком
		|               ИЛИ НАЧАЛОПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком
		|           ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата
		|       ИНАЧЕ КОНЕЦПЕРИОДА(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком, ДЕНЬ)
		|   КОНЕЦ КАК ДатаДвижения,
		|   ВЫБОР
		|       КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|           ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта
		|       ИНАЧЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ВалютаВзаиморасчетов
		|   КОНЕЦ КАК Валюта,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта КАК ВалютаДокумента,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма КАК Сумма,
		|   ВЫБОР
		|       КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СуммаВзаиморасчетов = 0
		|           ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма
		|       ИНАЧЕ ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СуммаВзаиморасчетов
		|   КОНЕЦ КАК СуммаВалютная,
		|   &СтрокаДоговор КАК Договор,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаВходящегоДокумента КАК ДатаПлатежногоДокумента,
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.НомерВходящегоДокумента КАК НомерПлатежногоДокумента,
		|   """" КАК КомментарийДвижения
		|ПОМЕСТИТЬ ВТ_ДанныеРасшифровки
		|ИЗ
		|   Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|ГДЕ
		|   ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = &Ссылка
		|   И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ДанныеРасшифровки.Период КАК Период,
		|   ВТ_ДанныеРасшифровки.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_ДанныеРасшифровки.СтатьяДДС КАК СтатьяДДС,
		|   ВТ_ДанныеРасшифровки.НаправлениеДвижения КАК НаправлениеДвижения,
		|   ВТ_ДанныеРасшифровки.Контрагент КАК Контрагент,
		|   ВТ_ДанныеРасшифровки.ДатаДвижения КАК ДатаДвижения,
		|   ВТ_ДанныеРасшифровки.Валюта КАК Валюта,
		|   ВЫБОР
		|       КОГДА ВТ_ДанныеРасшифровки.Валюта = &ВалютаУправленческогоУчета
		|           ТОГДА ВТ_ДанныеРасшифровки.СуммаВалютная
		|       ИНАЧЕ ВЫБОР
		|               КОГДА ВТ_ДанныеРасшифровки.ВалютаДокумента = &ВалютаУправленческогоУчета
		|                   ТОГДА ВТ_ДанныеРасшифровки.Сумма
		|               ИНАЧЕ 0
		|           КОНЕЦ
		|   КОНЕЦ КАК Сумма,
		|   ВТ_ДанныеРасшифровки.СуммаВалютная КАК СуммаВалютная,
		|   ВТ_ДанныеРасшифровки.Договор КАК Договор,
		|   ВТ_ДанныеРасшифровки.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
		|   ВТ_ДанныеРасшифровки.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
		|   ВТ_ДанныеРасшифровки.КомментарийДвижения КАК КомментарийДвижения
		|ИЗ
		|   ВТ_ДанныеРасшифровки КАК ВТ_ДанныеРасшифровки";
	
	Если ЭтоEPM_2_5 Тогда
		СтрокаДоговор = "ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Договор";
	Иначе
		СтрокаДоговор = "ВЫБОР
			|		КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ ССЫЛКА Справочник.ДоговорыКонтрагентов
			|			ТОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ
			|		ИНАЧЕ ЕСТЬNULL(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
			|	КОНЕЦ"
		КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаДоговор", СтрокаДоговор);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса для движений по регистру Фактические движения денежных средств
//  документа Приходный кассовый ордер.
//
// Параметры:
//  ЭтоEPM_2_5	 - Булево	 - признак интеграции с ERP 2.5.
// 
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ТекстЗапросаФактическиеДвиженияДСПриходныйКО(ЭтоEPM_2_5 = Ложь)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК Период,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.упоНаправлениеДвижения КАК НаправлениеДвижения,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК ДатаДвижения,
		|   ВЫБОР
		|       КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|           ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта
		|       ИНАЧЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.ВалютаВзаиморасчетов
		|   КОНЕЦ КАК Валюта,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Валюта КАК ВалютаДокумента,
		|   0 КАК Сумма,
		|   ВЫБОР
		|       КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов = 0
		|           ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Сумма
		|       ИНАЧЕ ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов
		|   КОНЕЦ КАК СуммаВалютная,
		|   &СтрокаДоговор КАК Договор,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК ДатаПлатежногоДокумента,
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Номер КАК НомерПлатежногоДокумента,
		|   """" КАК КомментарийДвижения
		|ПОМЕСТИТЬ ВТ_ДанныеРасшифровки
		|ИЗ
		|   Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		|ГДЕ
		|   ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &Ссылка
		|   И ПриходныйКассовыйОрдерРасшифровкаПлатежа.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ДанныеРасшифровки.Период КАК Период,
		|   ВТ_ДанныеРасшифровки.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_ДанныеРасшифровки.СтатьяДДС КАК СтатьяДДС,
		|   ВТ_ДанныеРасшифровки.НаправлениеДвижения КАК НаправлениеДвижения,
		|   ВТ_ДанныеРасшифровки.Контрагент КАК Контрагент,
		|   ВТ_ДанныеРасшифровки.ДатаДвижения КАК ДатаДвижения,
		|   ВТ_ДанныеРасшифровки.Валюта КАК Валюта,
		|   ВЫБОР
		|       КОГДА ВТ_ДанныеРасшифровки.Валюта = &ВалютаУправленческогоУчета
		|           ТОГДА ВТ_ДанныеРасшифровки.СуммаВалютная
		|       ИНАЧЕ ВЫБОР
		|               КОГДА ВТ_ДанныеРасшифровки.ВалютаДокумента = &ВалютаУправленческогоУчета
		|                   ТОГДА ВТ_ДанныеРасшифровки.Сумма
		|               ИНАЧЕ 0
		|           КОНЕЦ
		|   КОНЕЦ КАК Сумма,
		|   ВТ_ДанныеРасшифровки.СуммаВалютная КАК СуммаВалютная,
		|   ВТ_ДанныеРасшифровки.Договор КАК Договор,
		|   ВТ_ДанныеРасшифровки.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
		|   ВТ_ДанныеРасшифровки.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
		|   ВТ_ДанныеРасшифровки.КомментарийДвижения КАК КомментарийДвижения
		|ИЗ
		|   ВТ_ДанныеРасшифровки КАК ВТ_ДанныеРасшифровки";
	
	Если ЭтоEPM_2_5 Тогда
		СтрокаДоговор = "ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОбъектРасчетов.Договор";
	Иначе
		СтрокаДоговор = "ВЫБОР
			|		КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ ССЫЛКА Справочник.ДоговорыКонтрагентов
			|			ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ
			|		ИНАЧЕ ЕСТЬNULL(ПриходныйКассовыйОрдерРасшифровкаПлатежа.Заказ.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
			|	КОНЕЦ"
		КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаДоговор", СтрокаДоговор);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса фактические движения ДССписание безналичных.
//
// Параметры:
//  ЭтоEPM_2_5				 - Булево - Параметр интеграции с ERP 2.5.
//  ДанныеВШапкеДокумента	 - Булево - Параметр источника данных.
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаФактическиеДвиженияДССписаниеБезналичных(ЭтоEPM_2_5 = Ложь, ДанныеВШапкеДокумента = Ложь)
	
	Если ДанныеВШапкеДокумента Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|   ВЫБОР
			|       КОГДА НЕ СписаниеБезналичныхДенежныхСредств.ПроведеноБанком
			|               ИЛИ НАЧАЛОПЕРИОДА(СписаниеБезналичныхДенежныхСредств.Дата, ДЕНЬ) = СписаниеБезналичныхДенежныхСредств.ДатаПроведенияБанком
			|           ТОГДА СписаниеБезналичныхДенежныхСредств.Дата
			|       ИНАЧЕ КОНЕЦПЕРИОДА(СписаниеБезналичныхДенежныхСредств.ДатаПроведенияБанком, ДЕНЬ)
			|   КОНЕЦ КАК Период,
			|   СписаниеБезналичныхДенежныхСредств.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|   СписаниеБезналичныхДенежныхСредств.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
			|   СписаниеБезналичныхДенежныхСредств.СтатьяДвиженияДенежныхСредств.упоНаправлениеДвижения КАК НаправлениеДвижения,
			|   СписаниеБезналичныхДенежныхСредств.Контрагент КАК Контрагент,
			|   ВЫБОР
			|       КОГДА НЕ СписаниеБезналичныхДенежныхСредств.ПроведеноБанком
			|               ИЛИ НАЧАЛОПЕРИОДА(СписаниеБезналичныхДенежныхСредств.Дата, ДЕНЬ) = СписаниеБезналичныхДенежныхСредств.ДатаПроведенияБанком
			|           ТОГДА СписаниеБезналичныхДенежныхСредств.Дата
			|       ИНАЧЕ КОНЕЦПЕРИОДА(СписаниеБезналичныхДенежныхСредств.ДатаПроведенияБанком, ДЕНЬ)
			|   КОНЕЦ КАК ДатаДвижения,
			|   ВЫБОР
			|       КОГДА СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
			|           ТОГДА СписаниеБезналичныхДенежныхСредств.БанковскийСчет.ВалютаДенежныхСредств
			|       КОГДА СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
			|               ИЛИ СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет)
			|               ИЛИ СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту)
			|               ИЛИ СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета)
			|           ТОГДА СписаниеБезналичныхДенежныхСредств.Валюта
			|       ИНАЧЕ СписаниеБезналичныхДенежныхСредств.Валюта
			|   КОНЕЦ КАК Валюта,
			|   СписаниеБезналичныхДенежныхСредств.Валюта КАК ВалютаДокумента,
			|   СписаниеБезналичныхДенежныхСредств.Договор КАК Договор,
			|   0 КАК Сумма,
			|   ВЫБОР
			|       КОГДА СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
			|           ТОГДА СписаниеБезналичныхДенежныхСредств.СуммаДокумента
			|       КОГДА СписаниеБезналичныхДенежныхСредств.СуммаКонвертации = 0
			|           ТОГДА СписаниеБезналичныхДенежныхСредств.СуммаДокумента
			|       ИНАЧЕ СписаниеБезналичныхДенежныхСредств.СуммаКонвертации
			|   КОНЕЦ КАК СуммаВалютная,
			|   СписаниеБезналичныхДенежныхСредств.ДатаВходящегоДокумента КАК ДатаПлатежногоДокумента,
			|   СписаниеБезналичныхДенежныхСредств.НомерВходящегоДокумента КАК НомерПлатежногоДокумента,
			|   ВЫРАЗИТЬ(СписаниеБезналичныхДенежныхСредств.Комментарий КАК СТРОКА(1000)) КАК КомментарийДвижения
			|ПОМЕСТИТЬ ВТ_ДанныеДокумента
			|ИЗ
			|   Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
			|ГДЕ
			|   СписаниеБезналичныхДенежныхСредств.Ссылка = &Ссылка
			|   И СписаниеБезналичныхДенежныхСредств.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|   ВТ_ДанныеДокумента.Период КАК Период,
			|   ВТ_ДанныеДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|   ВТ_ДанныеДокумента.СтатьяДДС КАК СтатьяДДС,
			|   ВТ_ДанныеДокумента.НаправлениеДвижения КАК НаправлениеДвижения,
			|   ВТ_ДанныеДокумента.Контрагент КАК Контрагент,
			|   ВТ_ДанныеДокумента.ДатаДвижения КАК ДатаДвижения,
			|   ВТ_ДанныеДокумента.Валюта КАК Валюта,
			|   ВТ_ДанныеДокумента.Договор КАК Договор,
			|   ВЫБОР
			|       КОГДА ВТ_ДанныеДокумента.Валюта = &ВалютаУправленческогоУчета
			|           ТОГДА ВТ_ДанныеДокумента.СуммаВалютная
			|       ИНАЧЕ ВЫБОР
			|               КОГДА ВТ_ДанныеДокумента.ВалютаДокумента = &ВалютаУправленческогоУчета
			|                   ТОГДА ВТ_ДанныеДокумента.Сумма
			|               ИНАЧЕ 0
			|           КОНЕЦ
			|   КОНЕЦ КАК Сумма,
			|   ВТ_ДанныеДокумента.СуммаВалютная КАК СуммаВалютная,
			|   ВТ_ДанныеДокумента.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
			|   ВТ_ДанныеДокумента.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
			|   ВТ_ДанныеДокумента.КомментарийДвижения КАК КомментарийДвижения
			|ИЗ
			|   ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
		
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ
			|   ВЫБОР
			|       КОГДА НЕ РасшифровкаПлатежа.Ссылка.ПроведеноБанком
			|               ИЛИ НАЧАЛОПЕРИОДА(РасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком
			|           ТОГДА РасшифровкаПлатежа.Ссылка.Дата
			|       ИНАЧЕ КОНЕЦПЕРИОДА(РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком, ДЕНЬ)
			|   КОНЕЦ КАК Период,
			|   РасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|   РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
			|   РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.упоНаправлениеДвижения КАК НаправлениеДвижения,
			|   РасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
			|   ВЫБОР
			|       КОГДА НЕ РасшифровкаПлатежа.Ссылка.ПроведеноБанком
			|               ИЛИ НАЧАЛОПЕРИОДА(РасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком
			|           ТОГДА РасшифровкаПлатежа.Ссылка.Дата
			|       ИНАЧЕ КОНЕЦПЕРИОДА(РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком, ДЕНЬ)
			|   КОНЕЦ КАК ДатаДвижения,
			|   ВЫБОР
			|       КОГДА РасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
			|           ТОГДА РасшифровкаПлатежа.Ссылка.БанковскийСчет.ВалютаДенежныхСредств
			|       КОГДА РасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
			|               ИЛИ РасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет)
			|               ИЛИ РасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту)
			|               ИЛИ РасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета)
			|           ТОГДА РасшифровкаПлатежа.Ссылка.Валюта
			|       ИНАЧЕ РасшифровкаПлатежа.ВалютаВзаиморасчетов
			|   КОНЕЦ КАК Валюта,
			|   РасшифровкаПлатежа.Ссылка.Валюта КАК ВалютаДокумента,
			|   &СтрокаДоговор КАК Договор,
			|   0 КАК Сумма,
			|   ВЫБОР
			|       КОГДА РасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику)
			|           ТОГДА РасшифровкаПлатежа.Сумма
			|       КОГДА РасшифровкаПлатежа.СуммаВзаиморасчетов = 0
			|           ТОГДА РасшифровкаПлатежа.Сумма
			|       ИНАЧЕ РасшифровкаПлатежа.СуммаВзаиморасчетов
			|   КОНЕЦ КАК СуммаВалютная,
			|   РасшифровкаПлатежа.Ссылка.ДатаВходящегоДокумента КАК ДатаПлатежногоДокумента,
			|   РасшифровкаПлатежа.Ссылка.НомерВходящегоДокумента КАК НомерПлатежногоДокумента,
			|   ВЫРАЗИТЬ(РасшифровкаПлатежа.Комментарий КАК СТРОКА(1000)) КАК КомментарийДвижения
			|ПОМЕСТИТЬ ВТ_ДанныеРасшифровки
			|ИЗ
			|   Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК РасшифровкаПлатежа
			|ГДЕ
			|   РасшифровкаПлатежа.Ссылка = &Ссылка
			|   И РасшифровкаПлатежа.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|   ВТ_ДанныеРасшифровки.Период КАК Период,
			|   ВТ_ДанныеРасшифровки.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|   ВТ_ДанныеРасшифровки.СтатьяДДС КАК СтатьяДДС,
			|   ВТ_ДанныеРасшифровки.НаправлениеДвижения КАК НаправлениеДвижения,
			|   ВТ_ДанныеРасшифровки.Контрагент КАК Контрагент,
			|   ВТ_ДанныеРасшифровки.ДатаДвижения КАК ДатаДвижения,
			|   ВТ_ДанныеРасшифровки.Валюта КАК Валюта,
			|   ВТ_ДанныеРасшифровки.ВалютаДокумента КАК ВалютаДокумента,
			|   ВТ_ДанныеРасшифровки.Договор КАК Договор,
			|   ВЫБОР
			|       КОГДА ВТ_ДанныеРасшифровки.Валюта = &ВалютаУправленческогоУчета
			|           ТОГДА ВТ_ДанныеРасшифровки.СуммаВалютная
			|       ИНАЧЕ ВЫБОР
			|               КОГДА ВТ_ДанныеРасшифровки.ВалютаДокумента = &ВалютаУправленческогоУчета
			|                   ТОГДА ВТ_ДанныеРасшифровки.Сумма
			|               ИНАЧЕ 0
			|           КОНЕЦ
			|   КОНЕЦ КАК Сумма,
			|   ВТ_ДанныеРасшифровки.СуммаВалютная КАК СуммаВалютная,
			|   ВТ_ДанныеРасшифровки.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
			|   ВТ_ДанныеРасшифровки.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
			|   ВТ_ДанныеРасшифровки.КомментарийДвижения КАК КомментарийДвижения
			|ИЗ
			|   ВТ_ДанныеРасшифровки КАК ВТ_ДанныеРасшифровки";
		
		Если ЭтоEPM_2_5 Тогда
			СтрокаДоговор = "РасшифровкаПлатежа.ОбъектРасчетов.Договор";
		Иначе
			СтрокаДоговор = "ВЫБОР
				|		КОГДА РасшифровкаПлатежа.Заказ ССЫЛКА Справочник.ДоговорыКонтрагентов
				|			ТОГДА РасшифровкаПлатежа.Заказ
				|		ИНАЧЕ ЕСТЬNULL(РасшифровкаПлатежа.Заказ.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
				|	КОНЕЦ";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаДоговор", СтрокаДоговор);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Текст запроса фактические движения ДСРасходный КО.
//
// Параметры:
//  ЭтоEPM_2_5				 - Булево - признак интеграции с ERP 2.5.
//  ДанныеВШапкеДокумента	 - Булево - параметр источника данных.
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаФактическиеДвиженияДСРасходныйКО(ЭтоEPM_2_5 = Ложь, ДанныеВШапкеДокумента = Ложь)
	Если ДанныеВШапкеДокумента Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ
			|   РасходныйКассовыйОрдер.Дата КАК Период,
			|   РасходныйКассовыйОрдер.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|   РасходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
			|   РасходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств.упоНаправлениеДвижения КАК НаправлениеДвижения,
			|   РасходныйКассовыйОрдер.Контрагент КАК Контрагент,
			|   РасходныйКассовыйОрдер.Дата КАК ДатаДвижения,
			|   ВЫБОР
			|       КОГДА РасходныйКассовыйОрдер.ВалютаКонвертации = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
			|           ТОГДА РасходныйКассовыйОрдер.Валюта
			|       ИНАЧЕ РасходныйКассовыйОрдер.ВалютаКонвертации
			|   КОНЕЦ КАК Валюта,
			|   РасходныйКассовыйОрдер.Валюта КАК ВалютаДокумента,
			|   РасходныйКассовыйОрдер.Договор КАК Договор,
			|   0 КАК Сумма,
			|   ВЫБОР
			|       КОГДА РасходныйКассовыйОрдер.СуммаКонвертации = 0
			|           ТОГДА РасходныйКассовыйОрдер.СуммаДокумента
			|       ИНАЧЕ РасходныйКассовыйОрдер.СуммаКонвертации
			|   КОНЕЦ КАК СуммаВалютная,
			|   РасходныйКассовыйОрдер.Дата КАК ДатаПлатежногоДокумента,
			|   РасходныйКассовыйОрдер.Номер КАК НомерПлатежногоДокумента,
			|   ВЫРАЗИТЬ(РасходныйКассовыйОрдер.Комментарий КАК СТРОКА(1000)) КАК КомментарийДвижения
			|ПОМЕСТИТЬ ВТ_ДанныеДокумента
			|ИЗ
			|   Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
			|ГДЕ
			|   РасходныйКассовыйОрдер.Ссылка = &Ссылка
			|   И РасходныйКассовыйОрдер.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|   ВТ_ДанныеДокумента.Период КАК Период,
			|   ВТ_ДанныеДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|   ВТ_ДанныеДокумента.СтатьяДДС КАК СтатьяДДС,
			|   ВТ_ДанныеДокумента.НаправлениеДвижения КАК НаправлениеДвижения,
			|   ВТ_ДанныеДокумента.Контрагент КАК Контрагент,
			|   ВТ_ДанныеДокумента.ДатаДвижения КАК ДатаДвижения,
			|   ВТ_ДанныеДокумента.Валюта КАК Валюта,
			|   ВТ_ДанныеДокумента.ВалютаДокумента КАК ВалютаДокумента,
			|   ВТ_ДанныеДокумента.Договор КАК Договор,
			|   ВЫБОР
			|       КОГДА ВТ_ДанныеДокумента.Валюта = &ВалютаУправленческогоУчета
			|           ТОГДА ВТ_ДанныеДокумента.СуммаВалютная
			|       ИНАЧЕ ВЫБОР
			|               КОГДА ВТ_ДанныеДокумента.ВалютаДокумента = &ВалютаУправленческогоУчета
			|                   ТОГДА ВТ_ДанныеДокумента.Сумма
			|               ИНАЧЕ 0
			|           КОНЕЦ
			|   КОНЕЦ КАК Сумма,
			|   ВТ_ДанныеДокумента.СуммаВалютная КАК СуммаВалютная,
			|   ВТ_ДанныеДокумента.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
			|   ВТ_ДанныеДокумента.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
			|   ВТ_ДанныеДокумента.КомментарийДвижения КАК КомментарийДвижения
			|ИЗ
			|   ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
		
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ
			|   РасшифровкаПлатежа.Ссылка.Дата КАК Период,
			|   РасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|   РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
			|   РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.упоНаправлениеДвижения КАК НаправлениеДвижения,
			|   РасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
			|   РасшифровкаПлатежа.Ссылка.Дата КАК ДатаДвижения,
			|   ВЫБОР
			|       КОГДА РасшифровкаПлатежа.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
			|           ТОГДА РасшифровкаПлатежа.Ссылка.Валюта
			|       ИНАЧЕ РасшифровкаПлатежа.ВалютаВзаиморасчетов
			|   КОНЕЦ КАК Валюта,
			|   РасшифровкаПлатежа.Ссылка.Валюта КАК ВалютаДокумента,
			|   &СтрокаДоговор КАК Договор,
			|   0 КАК Сумма,
			|   ВЫБОР
			|       КОГДА РасшифровкаПлатежа.СуммаВзаиморасчетов = 0
			|           ТОГДА РасшифровкаПлатежа.Сумма
			|       ИНАЧЕ РасшифровкаПлатежа.СуммаВзаиморасчетов
			|   КОНЕЦ КАК СуммаВалютная,
			|   РасшифровкаПлатежа.Ссылка.Дата КАК ДатаПлатежногоДокумента,
			|   РасшифровкаПлатежа.Ссылка.Номер КАК НомерПлатежногоДокумента,
			|   ВЫРАЗИТЬ(РасшифровкаПлатежа.Комментарий КАК СТРОКА(1000)) КАК КомментарийДвижения
			|ПОМЕСТИТЬ ВТ_ДанныеРасшифровки
			|ИЗ
			|   Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасшифровкаПлатежа
			|ГДЕ
			|   РасшифровкаПлатежа.Ссылка = &Ссылка
			|   И РасшифровкаПлатежа.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|   ВТ_ДанныеРасшифровки.Период КАК Период,
			|   ВТ_ДанныеРасшифровки.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|   ВТ_ДанныеРасшифровки.СтатьяДДС КАК СтатьяДДС,
			|   ВТ_ДанныеРасшифровки.НаправлениеДвижения КАК НаправлениеДвижения,
			|   ВТ_ДанныеРасшифровки.Контрагент КАК Контрагент,
			|   ВТ_ДанныеРасшифровки.ДатаДвижения КАК ДатаДвижения,
			|   ВТ_ДанныеРасшифровки.Валюта КАК Валюта,
			|   ВТ_ДанныеРасшифровки.ВалютаДокумента КАК ВалютаДокумента,
			|   ВТ_ДанныеРасшифровки.Договор КАК Договор,
			|   ВЫБОР
			|       КОГДА ВТ_ДанныеРасшифровки.Валюта = &ВалютаУправленческогоУчета
			|           ТОГДА ВТ_ДанныеРасшифровки.СуммаВалютная
			|       ИНАЧЕ ВЫБОР
			|               КОГДА ВТ_ДанныеРасшифровки.ВалютаДокумента = &ВалютаУправленческогоУчета
			|                   ТОГДА ВТ_ДанныеРасшифровки.Сумма
			|               ИНАЧЕ 0
			|           КОНЕЦ
			|   КОНЕЦ КАК Сумма,
			|   ВТ_ДанныеРасшифровки.СуммаВалютная КАК СуммаВалютная,
			|   ВТ_ДанныеРасшифровки.ДатаПлатежногоДокумента КАК ДатаПлатежногоДокумента,
			|   ВТ_ДанныеРасшифровки.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
			|   ВТ_ДанныеРасшифровки.КомментарийДвижения КАК КомментарийДвижения
			|ИЗ
			|   ВТ_ДанныеРасшифровки КАК ВТ_ДанныеРасшифровки";
		
		Если ЭтоEPM_2_5 Тогда
			СтрокаДоговор = "РасшифровкаПлатежа.ОбъектРасчетов.Договор";
		Иначе
			СтрокаДоговор = "ВЫБОР
				|		КОГДА РасшифровкаПлатежа.Заказ ССЫЛКА Справочник.ДоговорыКонтрагентов
				|			ТОГДА РасшифровкаПлатежа.Заказ
				|		ИНАЧЕ ЕСТЬNULL(РасшифровкаПлатежа.Заказ.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
				|	КОНЕЦ";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтрокаДоговор", СтрокаДоговор);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПараметрыЗапросовДДС

// Установить параметры запроса фактические движения ДС поступление безналичных.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция УстановитьПараметрыЗапросаФактическиеДвиженияДС_ПоступлениеБезналичных(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("упоОтражатьФактДДСПервичнымиДокументами",
		ИспользуетсяОтражениеФактаДДСПервичнымиДокументами());
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецФункции

// Установить параметры запроса фактические движения ДС приходный КО.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция УстановитьПараметрыЗапросаФактическиеДвиженияДС_ПриходныйКО(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("упоОтражатьФактДДСПервичнымиДокументами",
		ИспользуетсяОтражениеФактаДДСПервичнымиДокументами());
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецФункции

// Установить параметры запроса фактические движения ДС расходный КО.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция УстановитьПараметрыЗапросаФактическиеДвиженияДС_РасходныйКО(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("упоОтражатьФактДДСПервичнымиДокументами",
		ИспользуетсяОтражениеФактаДДСПервичнымиДокументами());
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецФункции

// Установить параметры запроса фактические движения ДС списание безналичных.
//
// Параметры:
//  Запрос			 - Запрос
//  ДокументСсылка	 - ДокументСсылка
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция УстановитьПараметрыЗапросаФактическиеДвиженияДС_СписаниеБезналичных(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("упоОтражатьФактДДСПервичнымиДокументами",
		ИспользуетсяОтражениеФактаДДСПервичнымиДокументами());
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецФункции

#КонецОбласти

Функция ИспользоватьДанныеШапкиФинансовогоДокумента(Объект)
	
	Результат = Ложь;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет")
		Или ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		
		ПроверяемыеХозОперации = Новый Соответствие;
		
		ПроверяемыеХозОперации.Вставить(
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты"),
			Истина);
		ПроверяемыеХозОперации.Вставить(
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета"),
			Истина);
		ПроверяемыеХозОперации.Вставить(
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту"),
			Истина);
		ПроверяемыеХозОперации.Вставить(
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаботнику"),
			Истина);
		ПроверяемыеХозОперации.Вставить(
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыРаздатчиком"),
			Истина);
		ПроверяемыеХозОперации.Вставить(
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу"),
			Истина);
		
		Результат = ПроверяемыеХозОперации.Получить(Объект.ХозяйственнаяОперация) <> Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьЗапросПроектныеЗадачиПоЗаказам(ИмяДокументаЗаказа)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Заказ.Ссылка КАК ДокументЗаказ,
		|	Заказ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		|ИЗ
		|	Документ.&ИмяДокументаЗаказа КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка В (&МассивЗаказов)";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяДокументаЗаказа", ИмяДокументаЗаказа);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьСоответствиеПЗиЗаказов(ИмяДокументаЗаказа, МассивЗаказов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.Текст = СформироватьЗапросПроектныеЗадачиПоЗаказам(ИмяДокументаЗаказа);
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаПЗ = РезультатЗапроса.Выбрать();
	Пока ВыборкаПЗ.Следующий() Цикл
		Результат.Вставить(ВыборкаПЗ.ДокументЗаказ, ВыборкаПЗ.упоПроектнаяЗадача);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПроектныеЗадачиПоЗаказамВТабличнойЧасти(Объект, СоответствиеПЗиЗаказов, ИмяДокументаЗаказа, ИмяТабличнойЧасти)
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТабличнойЧасти] Цикл
		СтрокаТЧ.упоПроектнаяЗадача = СоответствиеПЗиЗаказов.Получить(СтрокаТЧ[ИмяДокументаЗаказа]);
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработкаЗаполнения

Функция РеквизитыОснования(ДанныеЗаполнения)
	
	РеквизитыОснования = Новый Структура("Организация, Подразделение, НаправлениеДеятельности");
	
	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		Возврат РеквизитыОснования;
	КонецЕсли;
	
	МетаданныеОснования = ДанныеЗаполнения.Метаданные();
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеОснования) Тогда
		РеквизитыОснования.Организация = ДанныеЗаполнения.Организация;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", МетаданныеОснования) Тогда
		РеквизитыОснования.Подразделение = ДанныеЗаполнения.Подразделение;
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НаправлениеДеятельности", МетаданныеОснования) Тогда
		РеквизитыОснования.НаправлениеДеятельности = ДанныеЗаполнения.НаправлениеДеятельности;
	КонецЕсли;
	
	Возврат РеквизитыОснования;
	
КонецФункции

Процедура ЗаполнитьРеквизитыТабличныхЧастей(Объект, Проект, ПроектнаяЗадачаЗеркало)
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	ПроектЗначенияПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);
	упоСтатьяДоходов = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(ПроектЗначенияПоУмолчанию.СтатьяДоходовПоУмолчанию);
	
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		НужноЗаполнитьЗадачу = ОбщегоНазначения.ЕстьРеквизитОбъекта("упоПроектнаяЗадача", ТабличнаяЧасть);
		НужноЗаполнитьСтатьюДоходов = ОбщегоНазначения.ЕстьРеквизитОбъекта("упоСтатьяДоходов", ТабличнаяЧасть);
		НужненОбход = НужноЗаполнитьЗадачу ИЛИ НужноЗаполнитьСтатьюДоходов;
		Если Не НужненОбход Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаТЧ Из Объект[ТабличнаяЧасть.Имя] Цикл
			Если НужноЗаполнитьЗадачу Тогда
				СтрокаТЧ.упоПроектнаяЗадача = ПроектнаяЗадачаЗеркало;
			КонецЕсли;
			Если НужноЗаполнитьСтатьюДоходов Тогда
				СтрокаТЧ.упоСтатьяДоходов = упоСтатьяДоходов;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьРеквизитыШапки(Объект, Проект, ПроектнаяЗадачаЗеркало, РеквизитыОснования)
	
	ЗаполнениеУспешно = Истина;
	
	ПроектнаяЗадачаСсылкаНаДокумент =
		упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(ПроектнаяЗадачаЗеркало);
	
	Если НЕ ЗначениеЗаполнено(ПроектнаяЗадачаСсылкаНаДокумент) Тогда
		ЗаполнениеУспешно = Ложь;
		Возврат ЗаполнениеУспешно;
	КонецЕсли;
	
	//
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	РеквизитыПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Проект, "Организация, Подразделение");
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("упоПроектнаяЗадача", МетаданныеОбъекта) Тогда
		Объект.упоПроектнаяЗадача = ПроектнаяЗадачаЗеркало;
	КонецЕсли;
	
	РеквизитыЗаполнения = Новый Массив;
	РеквизитыЗаполнения.Добавить("Организация");
	РеквизитыЗаполнения.Добавить("Подразделение");
	РеквизитыЗаполнения.Добавить("НаправлениеДеятельности");
	
	Для Каждого РеквизитЗаполнения Из РеквизитыЗаполнения Цикл
		
		Если Не ЕстьНезаполненныйРеквизит(МетаданныеОбъекта, Объект, РеквизитЗаполнения) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнятьИзДанныхЗаполнения = ЗаполнятьИзДанныхЗаполнения(МетаданныеОбъекта.Реквизиты[РеквизитЗаполнения],
				РеквизитыОснования[РеквизитЗаполнения]);
		Если ЗаполнятьИзДанныхЗаполнения Тогда
			Объект[РеквизитЗаполнения] = РеквизитыОснования[РеквизитЗаполнения];
		Иначе
			Если РеквизитЗаполнения = "Организация" Тогда
				Объект[РеквизитЗаполнения] = РеквизитыПроекта[РеквизитЗаполнения];
			ИначеЕсли РеквизитЗаполнения = "Подразделение" Тогда
				Объект[РеквизитЗаполнения] =
					упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСтруктурыИлиПодразделения(РеквизитыПроекта[РеквизитЗаполнения]);
			ИначеЕсли РеквизитЗаполнения = "НаправлениеДеятельности" Тогда
				Объект[РеквизитЗаполнения] =
					упоСвязьПроектаСНаправлениемДеятельности.ПолучитьНаправлениеДеятельностиПоПроектнойЗадаче(
						ПроектнаяЗадачаСсылкаНаДокумент);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗаполнениеУспешно;
	
КонецФункции

Функция ЗаполнятьИзДанныхЗаполнения(РеквизитМетаданных, ЗначениеЗаполнения)
	
	Возврат РеквизитМетаданных.ЗаполнятьИзДанныхЗаполнения
	И ЗначениеЗаполнено(ЗначениеЗаполнения);
	
КонецФункции

Функция ЕстьНезаполненныйРеквизит(МетаданныеОбъекта, Объект, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОбъекта)
	И Не ЗначениеЗаполнено(Объект[ИмяРеквизита]);
	
КонецФункции

// Разбивает строку расшифровки платежа заполняемого объекта по остаткам сумм проектных задач
// РН упоДенежныеСредстваКВыплате.
//
// Параметры:
//  ЗаявкаНаРасходованиеДС - ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств - Заявка-основание заполнения.
//  Объект - ДокументОбъект - заполняемый объект.
//
// Возвращаемое значение:
//   Булево  - признак успешного заполнения.
//
Функция ЗаполнитьРасшифровкуПоРегистру_упоДенежныеСредстваКВыплате(Объект, ЗаявкаНаРасходованиеДС)
	
	РасшифровкаЗаполнена = Ложь;
	
	// Расшифровку по регистру делаем только для типов регистраторов.
	ТипыРегистраторовСРасшифровкой =
		Метаданные.РегистрыНакопления.упоДенежныеСредстваКВыплате.СтандартныеРеквизиты.Регистратор.Тип;
	Если Не ТипыРегистраторовСРасшифровкой.СодержитТип(ТипЗнч(Объект.Ссылка)) Тогда
		Возврат РасшифровкаЗаполнена; // Возврат.
	КонецЕсли;
	
	// Иногда в строках таблицы расшифровки платежа может быть не заполнена валюта (указана в шапке).
	Для Каждого СтрокаРасшифровки Из Объект.РасшифровкаПлатежа Цикл
		Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ВалютаВзаиморасчетов) Тогда
			СтрокаРасшифровки.ВалютаВзаиморасчетов = Объект.Валюта;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заявка", ЗаявкаНаРасходованиеДС);
	Запрос.УстановитьПараметр("ТаблицаРасшифровкаПлатежа", Объект.РасшифровкаПлатежа);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    Проекты.Ссылка КАК упоПроектнаяЗадача,
		|    упоДенежныеСредстваКВыплатеОстатки.СуммаОстаток КАК Сумма,
		|    упоДенежныеСредстваКВыплатеОстатки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|    упоДенежныеСредстваКВыплатеОстатки.Договор КАК Договор,
		|    ЕСТЬNULL(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов, ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)) КАК ОбъектРасчетов
		|ПОМЕСТИТЬ ВТ_РасшифровкаПоЗадачам
		|ИЗ
		|    РегистрНакопления.упоДенежныеСредстваКВыплате.Остатки(, ЗаявкаНаРасходованиеДенежныхСредств = &Заявка) КАК упоДенежныеСредстваКВыплатеОстатки
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|        ПО упоДенежныеСредстваКВыплатеОстатки.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|        ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
		|        ПО упоДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходованиеДенежныхСредств = ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка
		|            И упоДенежныеСредстваКВыплатеОстатки.СтатьяДвиженияДенежныхСредств = ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
		|            И (Проекты.Ссылка = ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.упоПроектнаяЗадача)
		|            И упоДенежныеСредстваКВыплатеОстатки.Договор = ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Договор
		|            И упоДенежныеСредстваКВыплатеОстатки.СуммаОстаток = ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Сумма
		|ГДЕ
		|	НЕ Проекты.СсылкаНаПроектнуюЗадачу = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
		|	И НЕ Проекты.ПометкаУдаления
		|	И НЕ Проекты.ЗадачаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВЫРАЗИТЬ(ТаблицаРасшифровкаПлатежа.ОбъектРасчетов КАК Справочник.ОбъектыРасчетов) КАК ОбъектРасчетов,
		|    ТаблицаРасшифровкаПлатежа.Сумма КАК Сумма,
		|    ТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
		|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежаПромежуточная
		|ИЗ
		|    &ТаблицаРасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВТ_РасшифровкаПлатежаПромежуточная.ОбъектРасчетов КАК ОбъектРасчетов,
		|    ВТ_РасшифровкаПлатежаПромежуточная.Сумма КАК Сумма,
		|    ВТ_РасшифровкаПлатежаПромежуточная.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|    ЕСТЬNULL(ВТ_РасшифровкаПлатежаПромежуточная.ОбъектРасчетов.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор
		|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
		|ИЗ
		|    ВТ_РасшифровкаПлатежаПромежуточная КАК ВТ_РасшифровкаПлатежаПромежуточная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВТ_РасшифровкаПоЗадачам.упоПроектнаяЗадача КАК упоПроектнаяЗадача,
		|    ВТ_РасшифровкаПлатежа.ОбъектРасчетов КАК ОбъектРасчетов,
		|    ВТ_РасшифровкаПлатежа.Сумма КАК Сумма,
		|    ВТ_РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
		|ИЗ
		|    ВТ_РасшифровкаПлатежа КАК ВТ_РасшифровкаПлатежа
		|        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасшифровкаПоЗадачам КАК ВТ_РасшифровкаПоЗадачам
		|        ПО ВТ_РасшифровкаПлатежа.Сумма = ВТ_РасшифровкаПоЗадачам.Сумма
		|            И ВТ_РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = ВТ_РасшифровкаПоЗадачам.СтатьяДвиженияДенежныхСредств
		|            И ВТ_РасшифровкаПлатежа.Договор = ВТ_РасшифровкаПоЗадачам.Договор
		|            И ВТ_РасшифровкаПлатежа.ОбъектРасчетов = ВТ_РасшифровкаПоЗадачам.ОбъектРасчетов";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат РасшифровкаЗаполнена; // Возврат.
	КонецЕсли;
	
	РасшифровкаПоЗадачам = Результат.Выгрузить();
	
	ДанныеВШапке = ИспользоватьДанныеШапкиФинансовогоДокумента(Объект);
	Если ДанныеВШапке Тогда
		ЗаполнитьЗначенияСвойств(Объект, РасшифровкаПоЗадачам[0], "упоПроектнаяЗадача");
		РасшифровкаЗаполнена = Истина;
		Возврат РасшифровкаЗаполнена;
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровки Из РасшифровкаПоЗадачам Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Сумма", СтрокаРасшифровки.Сумма);
		ПараметрыОтбора.Вставить("СтатьяДвиженияДенежныхСредств", СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств);
		ПараметрыОтбора.Вставить("ОбъектРасчетов", СтрокаРасшифровки.ОбъектРасчетов);
		СтрокиЗаполнения = Объект.РасшифровкаПлатежа.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиЗаполнения.Количество() = 1 Тогда
			СтрокаЗаполнения = СтрокиЗаполнения[0];
			ЗаполнитьЗначенияСвойств(СтрокаЗаполнения, СтрокаРасшифровки, "упоПроектнаяЗадача");
			
			Если Не ЗначениеЗаполнено(СтрокаЗаполнения.упоПроектнаяЗадача)
				И ТипЗнч(ЗаявкаНаРасходованиеДС) = Тип("ДокументСсылка.ЗаявкаНаКомандировку") Тогда
				ЗаполнитьЗначенияСвойств(СтрокаЗаполнения, ЗаявкаНаРасходованиеДС, "упоПроектнаяЗадача");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	РасшифровкаЗаполнена = Истина;
	
	Возврат РасшифровкаЗаполнена;
	
КонецФункции

Функция ТекстЗапросаПроектныхЗадачТабличнойЧасти(ОбъектыРасчетов)
	
	МассивТекстаЗапроса = Новый Массив;
	
	ШаблонЗапроса = "ВЫБРАТЬ
					|	СправочникОбъектыРасчетов.ОбъектРасчетов КАК ОбъектРасчетов,
					|	ДокументОбъектаРасчетов.упоПроектнаяЗадача КАК упоПроектнаяЗадача
					|ИЗ
					|	%1 КАК ДокументОбъектаРасчетов
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СправочникОбъектыРасчетов КАК СправочникОбъектыРасчетов
					|		ПО ДокументОбъектаРасчетов.Ссылка = СправочникОбъектыРасчетов.Объект";
	
	Для Каждого КлючЗначение Из ОбъектыРасчетов Цикл
		МД = КлючЗначение.Значение.Метаданные();
		ИмяМД = МД.ПолноеИмя();
		Если МД.Реквизиты.Найти("упоПроектнаяЗадача") <> Неопределено Тогда
			МассивТекстаЗапроса.Добавить(СтрШаблон(ШаблонЗапроса, ИмяМД));
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(МассивТекстаЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Разделитель = "
				|ОБЪЕДИНИТЬ
				|";
	
	ТекстЗапроса = СтрСоединить(МассивТекстаЗапроса, Разделитель);
	
	МассивТекстаЗапроса.Очистить();
	
	ТекстЗапросаВТ = "ВЫБРАТЬ
					|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
					|	ОбъектыРасчетов.Объект КАК Объект
					|ПОМЕСТИТЬ СправочникОбъектыРасчетов
					|ИЗ
					|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
					|ГДЕ
					|	ОбъектыРасчетов.Ссылка В(&МассивОбъектов)";
	
	МассивТекстаЗапроса.Добавить(ТекстЗапросаВТ);
	МассивТекстаЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(МассивТекстаЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ИзменениеЭлементовФорм

Процедура ПриСозданииНаСервере_Документы(ИмяДокумента, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяДокумента = "ЗаказКлиента" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику_ФормаДокумента(Форма);
		
	ИначеЕсли ИмяДокумента = "ЗаказПоставщику" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику_ФормаДокумента(Форма);
		
	ИначеЕсли ИмяДокумента = "ЗаказНаПроизводство" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику_ФормаДокумента(Форма);
		
	ИначеЕсли ИмяДокумента = "ЗаказНаПроизводство2_2" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику_ФормаДокумента(Форма);
		
	ИначеЕсли ИмяДокумента = "РеализацияТоваровУслуг" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_РеализацияТоваровУслуг_ФормаДокумента(Форма);
		
	ИначеЕсли ИмяДокумента = "ПриобретениеТоваровУслуг" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_ПриобретениеТоваровУслуг_ФормаДокумента(Форма);
		
	ИначеЕсли ИмяДокумента = "АктВыполненныхРабот" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_АктВыполненныхРабот_ФормаДокумента(Форма);
		
	ИначеЕсли ИмяДокумента = "ПоступлениеБезналичныхДенежныхСредств" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьКолонкиПроектПроектнаяЗадачаВРасшифровкаПлатежа(Форма);
		
	ИначеЕсли ИмяДокумента = "ПрочиеДоходыРасходы" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьЭлементы_Документ_ПрочиеДоходыРасходы_ФормаЭлемента(Форма);
		
	ИначеЕсли ИмяДокумента = "ПриходныйКассовыйОрдер" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьКолонкиПроектПроектнаяЗадачаВРасшифровкаПлатежа(Форма);
		
	ИначеЕсли ИмяДокумента = "РасходныйКассовыйОрдер" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьКолонкиПроектПроектнаяЗадачаВРасшифровкаПлатежа(Форма);
		
	ИначеЕсли ИмяДокумента = "СписаниеБезналичныхДенежныхСредств" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьКолонкиПроектПроектнаяЗадачаВРасшифровкаПлатежа(Форма);
		
	ИначеЕсли ИмяДокумента = "ЗаявкаНаРасходованиеДенежныхСредств" И ИмяФормы = "ФормаДокумента" Тогда
		
		ДобавитьКолонкиПроектПроектнаяЗадачаВРасшифровкаПлатежа(Форма);
		
	ИначеЕсли ИмяДокумента = "ОтражениеЗарплатыВФинансовомУчете" 
		И (ИмяФормы = "ФормаДокумента" Или ИмяФормы = "ФормаСпискаФизическихЛиц") Тогда
		
		ПриСозданииНаСервере_Документы_РаспределениеЗарплаты(Форма, ИмяФормы);
		
	ИначеЕсли ИмяДокумента = "ЗаявкаНаКомандировку" И ИмяФормы = "ФормаДокумента" Тогда
		
		ИзменитьЭлементы_ЗаявкаНаКомандировку_ФормаДокумента(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_Справочники(ИмяСправочника, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяСправочника = "ДоговорыКонтрагентов" Тогда
		
		Если ИмяФормы = "ФормаЭлемента" Тогда
			ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаЭлемента(Форма);
		ИначеЕсли ИмяФормы = "ФормаСписка" Тогда
			Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
		ИначеЕсли ИмяФормы = "ФормаВыбора" Тогда
			Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
		КонецЕсли;
		
	ИначеЕсли ИмяСправочника = "СтатьиДвиженияДенежныхСредств" И ИмяФормы = "ФормаЭлемента" Тогда
		
		ДобавитьЭлементы_СтатьиДвиженияДенежныхСредств_ФормаЭлемента(Форма);
		
	ИначеЕсли ИмяСправочника = "Контрагенты" И ИмяФормы = "ФормаЭлемента" Тогда
		
		ДобавитьЭлементыФормыКонтрагентов(Форма, Отказ);
		
	ИначеЕсли ИмяСправочника = "Партнеры" И ИмяФормы = "ФормаЭлементаРеквизитыКонтрагента" Тогда
		
		ДобавитьЭлементыСпрПартнеровКакКонтрагентов(Форма);
		
	ИначеЕсли ИмяСправочника = "СтруктураПредприятия" И ИмяФормы = "ФормаВыбора" Тогда
		
		ДобавитьЭлементыФормыВыбораСтруктураПредприятия(Форма, Отказ);
		
	ИначеЕсли ИмяСправочника = "Сценарии" И ИмяФормы = "ФормаВыбора" Тогда
		
		ИзменитьЭлементы_Сценарии_ФормаВыбора(Форма);
		
	ИначеЕсли ИмяСправочника = "Номенклатура" И ИмяФормы = "ФормаЭлемента" Тогда
		
		ИзменитьЭлементы_Номенклатура_ФормаЭлемента(Форма, Отказ);
		
	ИначеЕсли ИмяСправочника = "Проекты" И ИмяФормы = "ФормаЭлемента" Тогда
		
		ИзменитьЭлементы_Проекты_ФормаЭлемента(Форма, Отказ);
		
	ИначеЕсли ИмяСправочника = "упоВидыОпераций" И ИмяФормы = "ФормаЭлементаУправляемая" Тогда
		
		ИзменитьРеквизиты_упоВидыОпераций_ФормаЭлемента(Форма, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ПВХ(ИмяПВХ, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	Если ИмяПВХ = "СтатьиДоходов" И ИмяФормы = "ФормаЭлемента" Тогда
		
		ИзменитьЭлементы_ПВХ_СтатьиДоходов_ФормаЭлемента(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормыВыбораСтруктураПредприятия(Форма, Отказ)
	
	Если Форма.Параметры.Свойство("упоВыборПодразделения") Тогда
		Форма.Элементы.Список.УстановитьДействие("ВыборЗначения", "Подключаемый_упоСписокВыборЗначения");
	КонецЕсли;
	
	упоИнтеграцияВызовСервера.НастроитьОтображениеСпискаПодразделений(Форма);
	
КонецПроцедуры

Процедура ИзменитьЭлементы_Номенклатура_ФормаЭлемента(Форма, Отказ)
	
	Если НЕ ОтражатьФактРасходаПриПриобретенииТоваров() Тогда
		Возврат;
	КонецЕсли;
	
	СворачиваемаяГруппаРегламентированныйУчет = Форма.Элементы.Найти("СворачиваемаяГруппаРегламентированныйУчет");
	Если СворачиваемаяГруппаРегламентированныйУчет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	упоСтатьяРасходовПриПриобретенииТоваров = Форма.Элементы.Добавить("упоСтатьяРасходовПриПриобретенииТоваров",
			Тип("ПолеФормы"), СворачиваемаяГруппаРегламентированныйУчет);
	упоСтатьяРасходовПриПриобретенииТоваров.ПутьКДанным = "Объект.упоСтатьяРасходовПриПриобретенииТоваров";
	упоСтатьяРасходовПриПриобретенииТоваров.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

Процедура ИзменитьЭлементы_ПВХ_СтатьиДоходов_ФормаЭлемента(Форма)
	
	Форма.УстановитьДействие("ПослеЗаписи", "ПослеЗаписи");
	
КонецПроцедуры

Процедура ДобавитьЭлементы_Документ_ПрочиеДоходыРасходы_ФормаЭлемента(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Форма.Объект.ХозяйственнаяОперация = 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов") Тогда
		
		ЭлементРодитель = Элементы.Найти("ГруппаШапкаЛево");
		Если ЭлементРодитель = Неопределено Тогда
			ЭлементРодитель = Форма;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить("упоОтражениеФинансовогоРезультата", Тип("ПолеФормы"), ЭлементРодитель);
		НовыйЭлемент.ПутьКДанным = "Объект.упоОтражениеФинансовогоРезультата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		
	ИначеЕсли Форма.Объект.ХозяйственнаяОперация = 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеклассификацияРасходов") Тогда
		
		ЭлементРодитель = Элементы.Найти("ГруппаШапкаЛево");
		Если ЭлементРодитель = Неопределено Тогда
			ЭлементРодитель = Форма;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить("упоОтражениеРаспределенияРасходовОПРиОХР", Тип("ПолеФормы"), ЭлементРодитель);
		НовыйЭлемент.ПутьКДанным = "Объект.упоОтражениеРаспределенияРасходовОПРиОХР";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаЭлемента(Форма)
	
	упоРодитель = Форма.Элементы.Добавить("упоРодитель", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	упоРодитель.ПутьКДанным = "Объект.Родитель";
	упоРодитель.Вид = ВидПоляФормы.ПолеВвода;
	упоРодитель.КнопкаВыбора = Истина;
	
	Форма.Элементы.Переместить(упоРодитель, Форма.Элементы.ГруппаШапкаЛево, Форма.Элементы.Наименование);
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	упоРодитель.СвязиПараметровВыбора = НовыеСвязи;
	
	ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаДокумента_ПодменитьСтатус(Форма);
	
	упоСхемаОплаты = Форма.Элементы.Добавить("упоСхемаОплаты", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	упоСхемаОплаты.ПутьКДанным = "Объект.упоСхемаОплаты";
	упоСхемаОплаты.Вид = ВидПоляФормы.ПолеВвода;
	упоСхемаОплаты.КнопкаВыбора = Истина;
	
КонецПроцедуры

Процедура ДобавитьЭлементыПроектПроектнаяЗадачаВШапкуДокумента(ЭтаФорма)
	
	Если Не ЭтаФорма.Объект.Свойство("упоПроектнаяЗадача") Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаРодитель = ЭтаФорма.Элементы.Найти("ГруппаДополнительныеРеквизитыШапки"); // Списание безналичных ДС
	Если ГруппаРодитель = Неопределено Тогда
		ГруппаРодитель = ЭтаФорма.Элементы.Найти("ГруппаШапкаПраво"); // Списание Заявка на расходование ДС
	КонецЕсли;
	Если ГруппаРодитель = Неопределено Тогда
		ГруппаРодитель = ЭтаФорма.Элементы.Найти("ГруппаПраво"); // РКО
	КонецЕсли;
	Если ГруппаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипПолеФормы = Тип("ПолеФормы");
	
	ЭлементПроектнаяЗадача = ЭтаФорма.Элементы.Добавить("упоШапкаПроектнаяЗадача",
			ТипПолеФормы,
			ГруппаРодитель);
	ЭлементПроектнаяЗадача.ПутьКДанным = "Объект.упоПроектнаяЗадача";
	ЭлементПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПроектнаяЗадача.КнопкаВыбора = Истина;
	
	ЭлементПроект = ЭтаФорма.Элементы.Добавить("упоШапкаПроект",
			ТипПолеФормы,
			ГруппаРодитель);
	ЭлементПроект.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементПроект.ПутьКДанным = "Объект.упоПроектнаяЗадача.упоКорневойПроект";
	ЭлементПроект.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецПроцедуры

Процедура ИзменитьЭлементы_Проекты_ФормаЭлемента(Форма, Отказ)
	
	упоИнтеграция.ДобавитьКомандуОткрытияФормыПроекта(Форма, "Подключаемый_упоОткрытьФормуПроектаPM",
		НСтр("ru = 'Открыть форму проекта PM'"));
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Родитель");
	ИменаЭлементов.Добавить("Проект");
	Если ЗначениеЗаполнено(Форма.Объект.СсылкаНаПроектнуюЗадачу) Тогда
		ИменаЭлементов.Добавить("Наименование");
	КонецЕсли;
	
	упоФункцииОбщегоНазначенияСервер.НайтиЭлементыПоИменамИУстановитьДляНихУказанноеСвойство(ИменаЭлементов, Форма,
		"ТолькоПросмотр", Истина);
	
КонецПроцедуры

Функция ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаДокумента_ПодменитьСтатус(ЭтаФорма)
	
	ГруппаФормы = ЭтаФорма.Элементы.Найти("ГруппаШапкаПраво");
	
	ИзменитьЭлементы_ДоговорыКонтрагентов_ФормаДокумента_ДобавитьСтатус(ЭтаФорма, ГруппаФормы);
	
	// Скроем стандартный реквизит.
	ЭтаФорма.Элементы.Статус.Видимость = Ложь;
	
КонецФункции

Функция ДобавитьЭлементПроектВШапку_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику(ЭлементыФормы)
	
	МассивИменЭлементов = ИменаЭлементовФорм_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику();
	ГруппаРодитель = ПоискЭлементаФормыПоПриоритету(ЭлементыФормы, МассивИменЭлементов);
	
	ПолеПроектнаяЗадача = ЭлементыФормы.Добавить("упоПроектнаяЗадача", Тип("ПолеФормы"), ГруппаРодитель);
	ПолеПроектнаяЗадача.ПутьКДанным = "Объект.упоПроектнаяЗадача";
	ПолеПроектнаяЗадача.Вид = ВидПоляФормы.ПолеВвода;
	ПолеПроектнаяЗадача.Ширина = 28;
	
	
	ПолеПроект = ЭлементыФормы.Добавить("упоПроект", Тип("ПолеФормы"), ГруппаРодитель);
	ПолеПроект.ПутьКДанным = "Объект.упоПроектнаяЗадача.упоКорневойПроект";
	ПолеПроект.Заголовок = НСтр("ru = 'Проект'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ПолеПроект.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеПроект.Гиперссылка = Истина;
	ПолеПроект.Ширина = 33;
	
КонецФункции

// Определяет порядок имен групп элементов формы, в котором будет идти поиск группы 
// для размещения элементов Проектная задача/Проект.
// 
// Возвращаемое значение:
//  Массив - имена элементов поиска.
//
Функция ИменаЭлементовФорм_ЗаказКлиентаЗаказНаПроизводствоИЗаказПоставщику()
	
	МассивИменЭлементов = Новый Массив;
	МассивИменЭлементов.Добавить("ГруппаСтатусПриоритет");
	МассивИменЭлементов.Добавить("ГруппаШапка");
	МассивИменЭлементов.Добавить("Шапка");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

Функция ПоискЭлементаФормыПоПриоритету(ЭлементыФормы, МассивИменЭлементов)
	
	Элемент = Неопределено;
	
	Для Каждого ИмяЭлемента Из МассивИменЭлементов Цикл
		Элемент = ЭлементыФормы.Найти(ИмяЭлемента);
		Если Элемент <> Неопределено Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Элемент;
	
КонецФункции

// Создаёт и возвращает элемент формы на основе передаваемых данных.
//
// Параметры:
//  ЭтотОбъект	 	 - ФормаКлиентскогоПриложения - Форма документа.
//  Имя				 - Строка - Имя добавляемого элемента.
//  Тип				 - Тип - Тип добавляемого элемента.
//  Родитель		 - ГруппаФормы, ТаблицаФормы, ФормаКлиентскогоПриложения - Родитель элемента.
//  Вид				 - ВидПоляФормы - Способ представления данных реквизита в форме.
//  ПутьКДанным		 - Строка - Путь к связанному реквизиту.
//  ИмяКоманды		 - Строка - Имя связанной команды. Только для кнопок.
//  Заголовок		 - Строка - Отображаемый заголовок элемента.
//  СмещаемыйЭлемент - ДекорацияФормы, ГруппаФормы, ТаблицаФормы, ФормаКлиентскогоПриложения - Элемент, перед которым
//							необходимо вставить новый элемент.
//
// Возвращаемое значение:
// ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы - Элемент, созданный согласно переданным данным.
//
Функция ДобавитьЭлементФормы(ЭтотОбъект, Имя, Тип, Родитель, Вид, ПутьКДанным = "", ИмяКоманды = "", Заголовок = "",
		СмещаемыйЭлемент = Неопределено)
	
	Элементы = ЭтотОбъект.Элементы;
	
	ЭлементФормы = Элементы.Вставить(Имя, Тип, Родитель, СмещаемыйЭлемент);
	ЭлементФормы.Вид = Вид;
	Если Не ПустаяСтрока(ПутьКДанным) Тогда
		ЭлементФормы.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	Если Не ПустаяСтрока(ИмяКоманды) Тогда
		ЭлементФормы.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	Если Не ПустаяСтрока(Заголовок) Тогда
		ЭлементФормы.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат ЭлементФормы;
	
КонецФункции

// Создаёт и возвращает команду формы на основании переданных параметров.
//
// Параметры:
//  ЭтотОбъект				  - ФормаКлиентскогоПриложения - Форма документа.
//  Имя						  - Строка - Имя добавляемой команды.
//  Действие				  - Строка - Имя процедуры обработчика команды.
//  Заголовок				  - Строка - Отображаемый текст команды.
//  Подсказка				  - Строка - Подсказка команды.
//  ИзменяетСохраняемыеДанные - Булево - Признак необходимости сохранения данных после вызова команды.
//
// Возвращаемое значение:
// КомандаФормы - Команда формы, созданная согласно переданным параметрам.
//
Функция ДобавитьКомандуФормы(ЭтотОбъект, Имя, Действие, Заголовок,
		Подсказка = "", ИзменяетСохраняемыеДанные = Ложь)
	
	Команды = ЭтотОбъект.Команды;
	
	Команда = Команды.Добавить(Имя);
	Команда.Действие = Действие;
	Команда.Заголовок = Заголовок;
	Если Не ПустаяСтрока(Подсказка) Тогда
		Команда.Подсказка = Подсказка;
	КонецЕсли;
	Если ИзменяетСохраняемыеДанные Тогда
		Команда.ИзменяетСохраняемыеДанные = ИзменяетСохраняемыеДанные;
	КонецЕсли;
	
	Возврат Команда;
	
КонецФункции

Процедура УстановитьОтметкуНезаполненногоСтатьиДоходов(ЭтаФорма)

	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
				
	ГруппаОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.упоПроектнаяЗадача");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.упоСтатьяДоходов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
				
	НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыупоСтатьяДоходов");

КонецПроцедуры

#Область РаспределениеЗарплатыПоПроектам

Процедура ПриСозданииНаСервере_Документы_РаспределениеЗарплаты(Форма, ИмяФормы)
	
	МодульупоРаспределениеЗарплатыНастройкиСервер = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыНастройкиСервер");
	ИспользоватьПодсистему = 
		МодульупоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему();
	Если Не ИспользоватьПодсистему ТОгда
		Возврат;
	КонецЕсли;
	
	МодульупоРаспределениеЗарплатыСервер = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыСервер");
	МодульупоРаспределениеЗарплатыСервер.ДобавитьКомандыНаФорму_ОтражениеЗарплатыВФинансовомУчете(Форма);
	МодульупоРаспределениеЗарплатыСервер.ДобавитьОтчетНаФорму_ОтражениеЗарплатыВФинансовомУчете(Форма);
	
	Если ИмяФормы = "ФормаСпискаФизическихЛиц" Тогда
		ИзменитьЭлементы_ФормаСпискаФизическихЛиц(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Изменяет элементы в документе "ОтражениеЗарплатыВФинансовомУчете" в форме списка физ. лиц.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма.
//
// Возвращаемое значение:
//  Непределено - не возвращает значение.
Процедура ИзменитьЭлементы_ФормаСпискаФизическихЛиц(ЭтаФорма)
	// {Распределение зарплаты}
	
	МодульупоРаспределениеЗарплатыНастройкиСервер = 
		ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыНастройкиСервер");
	
	УчетВоВнешнейСистеме = 
		МодульупоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("УчетВоВнешнейСистеме");
	
	Элементы = ЭтаФорма.Элементы;
	
	///////////////////////////////////////////////////////////////
	ДобавляемыеРеквизиты = Новый Массив;
	
	ИмяТаблицы = "НачисленнаяЗарплатаИВзносы";
	МетаданныеОбъекта = Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете;
	ТабличнаяЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти("НачисленнаяЗарплатаИВзносыПоФизлицам");
	РеквизитыТабЧасти = ТабличнаяЧасть.Реквизиты;
	
	ИмяРеквизита = "упоНачислениеPM";
	РеквизитФормы = РеквизитыТабЧасти.Найти(ИмяРеквизита);
	НовыйРеквизит = Новый РеквизитФормы(РеквизитФормы.Имя, РеквизитФормы.Тип, ИмяТаблицы, РеквизитФормы.Синоним, Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизита = "упоЧасы";
	РеквизитФормы = РеквизитыТабЧасти.Найти(ИмяРеквизита);
	НовыйРеквизит = Новый РеквизитФормы(РеквизитФормы.Имя, РеквизитФормы.Тип, ИмяТаблицы, РеквизитФормы.Синоним, Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизита = "упоКоэффициент";
	РеквизитФормы = РеквизитыТабЧасти.Найти(ИмяРеквизита);
	НовыйРеквизит = Новый РеквизитФормы(РеквизитФормы.Имя, РеквизитФормы.Тип, ИмяТаблицы, РеквизитФормы.Синоним, Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИмяРеквизита = ?(УчетВоВнешнейСистеме, "упоНачислениеЗУП", "упоНачислениеERP");
	РеквизитФормы = РеквизитыТабЧасти.Найти(ИмяРеквизита);
	НовыйРеквизит = Новый РеквизитФормы(РеквизитФормы.Имя, РеквизитФормы.Тип, ИмяТаблицы, РеквизитФормы.Синоним, Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	///////////////////////////////////////////////////////////////
	ТипПолеФормы = Тип("ПолеФормы");
	
	ШаблонРеквизита = "%1.%2";
	Если УчетВоВнешнейСистеме Тогда
		ИмяЭлемента = "упоНачислениеЗУП";
		Элемент = Элементы.Добавить(ИмяЭлемента, ТипПолеФормы, Элементы.НачисленнаяЗарплатаИВзносы);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = СтрШаблон(ШаблонРеквизита, ИмяТаблицы, ИмяЭлемента);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Иначе
		ИмяЭлемента = "упоНачислениеERP";
		Элемент = Элементы.Добавить(ИмяЭлемента, ТипПолеФормы, Элементы.НачисленнаяЗарплатаИВзносы);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = СтрШаблон(ШаблонРеквизита, ИмяТаблицы, ИмяЭлемента);
	КонецЕсли;
	
	Элемент.УстановитьДействие("ПриИзменении",
		"упоПодключаемый_НачисленнаяЗарплатаИВзносыПоФизлицамУпоНачислениеERP_ЗУППриИзменении");
	
	ИмяЭлемента = "упоНачислениеPM";
	Элемент = Элементы.Добавить(ИмяЭлемента, ТипПолеФормы, Элементы.НачисленнаяЗарплатаИВзносы);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = СтрШаблон(ШаблонРеквизита, ИмяТаблицы, ИмяЭлемента);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.АвтоОтметкаНезаполненного = Истина;
	
	ИмяЭлемента = "упоЧасы";
	Элемент = Элементы.Добавить(ИмяЭлемента, ТипПолеФормы, Элементы.НачисленнаяЗарплатаИВзносы);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = СтрШаблон(ШаблонРеквизита, ИмяТаблицы, ИмяЭлемента);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
	ИмяЭлемента = "упоКоэффициент";
	Элемент = Элементы.Добавить(ИмяЭлемента, ТипПолеФормы, Элементы.НачисленнаяЗарплатаИВзносы);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = СтрШаблон(ШаблонРеквизита, ИмяТаблицы, ИмяЭлемента);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	// {/Распределение зарплаты}
КонецПроцедуры

Процедура ИзменитьРеквизиты_упоВидыОпераций_ФормаЭлемента(Форма, Отказ)
	
	Элементы = Форма.Элементы;
	
	Группа = Элементы.Вставить("РаспределениеЗП", Тип("ГруппаФормы"), Форма);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.Заголовок = НСтр("ru = 'Распределение зарплаты'");
	Группа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	Группа.ОтображатьЗаголовок = Истина;
	
	ЭлементВидНачисленияPM = Элементы.Вставить("ВидНачисленияPM", Тип("ПолеФормы"), Группа);
	ЭлементВидНачисленияPM.ПутьКДанным = "Объект.ВидНачисленияPM";
	ЭлементВидНачисленияPM.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементВидНачисленияPM.Ширина = 28;
	ЭлементВидНачисленияPM.Заголовок = НСтр("ru = 'Вид начисления PM'");
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.НеОтражатьЧасы", Ложь);
	МассивПараметрыВыбора = Новый Массив;
	МассивПараметрыВыбора.Добавить(ПараметрВыбора);
	ЭлементВидНачисленияPM.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметрыВыбора);
	
	Элемент = Элементы.Вставить("СпособОтраженияЗарплаты", Тип("ПолеФормы"), Группа);
	Элемент.ПутьКДанным = "Объект.СпособОтраженияЗарплаты";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.Ширина = 28;
	Элемент.Заголовок = НСтр("ru = 'Способ отражения'");
	
	Элемент = Элементы.Вставить("Служебный", Тип("ПолеФормы"), Группа, ЭлементВидНачисленияPM);
	Элемент.ПутьКДанным = "Объект.Служебный";
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.Заголовок = НСтр("ru = 'Служебный'");
	
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_СлужебныйПриИзменении");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроведениеПервичныхДокументов

Процедура ОбработкаПроведения_ЗаявкаНаРасходованиеДенежныхСредств(Источник, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	
	ДанныеВШапкеДокумента = ИспользоватьДанныеШапкиФинансовогоДокумента(Источник);
	
	Если ДанныеВШапкеДокумента Тогда
		ТекстЗапроса = "ВЫБРАТЬ
			|	ФинансовыйДокумент.ДатаПлатежа КАК Период,
			|	&ВидДвижения КАК ВидДвижения,
			|	ФинансовыйДокумент.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ФинансовыйДокумент.Организация КАК Организация,
			|	ФинансовыйДокумент.Подразделение КАК Подразделение,
			|	ФинансовыйДокумент.Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
			|	ФинансовыйДокумент.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|	ФинансовыйДокумент.Контрагент КАК Контрагент,
			|	ФинансовыйДокумент.Договор КАК Договор,
			|	ФинансовыйДокумент.Валюта КАК Валюта,
			|	СУММА(ФинансовыйДокумент.СуммаДокумента) КАК Сумма
			|ИЗ
			|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ФинансовыйДокумент
			|ГДЕ
			|	ФинансовыйДокумент.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ФинансовыйДокумент.ДатаПлатежа,
			|	ФинансовыйДокумент.СтатьяДвиженияДенежныхСредств,
			|	ФинансовыйДокумент.Организация,
			|	ФинансовыйДокумент.Подразделение,
			|	ФинансовыйДокумент.Ссылка,
			|	ФинансовыйДокумент.Контрагент,
			|	ФинансовыйДокумент.Договор,
			|	ФинансовыйДокумент.Валюта,
			|	ФинансовыйДокумент.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу";
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
			|    РасшифровкаПлатежа.Ссылка КАК Ссылка,
			|    РасшифровкаПлатежа.Сумма КАК Сумма,
			|    РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|    &ПодстрокаОбъектаРасчетов КАК Договор,
			|    Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу
			|ПОМЕСТИТЬ ВТ_РасшифровкаПлатежа
			|ИЗ
			|    Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК РасшифровкаПлатежа
			|        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
			|        ПО РасшифровкаПлатежа.упоПроектнаяЗадача = Проекты.Ссылка
			|ГДЕ
			|    РасшифровкаПлатежа.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|    РасшифровкаПлатежа.Сумма,
			|    РасшифровкаПлатежа.Ссылка,
			|    РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
			|    Проекты.СсылкаНаПроектнуюЗадачу,
			|    &ПодстрокаОбъектаРасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|    ЗаявкаНаРасходованиеДенежныхСредств.ДатаПлатежа КАК Период,
			|    &ВидДвижения КАК ВидДвижения,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Организация КАК Организация,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Подразделение КАК Подразделение,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Контрагент КАК Контрагент,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Валюта КАК Валюта,
			|    ВТ_РасшифровкаПлатежа.Сумма КАК Сумма,
			|    ВТ_РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|    ВТ_РасшифровкаПлатежа.Договор КАК Договор,
			|    ВТ_РасшифровкаПлатежа.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
			|ИЗ
			|    ВТ_РасшифровкаПлатежа КАК ВТ_РасшифровкаПлатежа
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
			|        ПО ВТ_РасшифровкаПлатежа.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|    ЗаявкаНаРасходованиеДенежныхСредств.ДатаПлатежа,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Организация,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Подразделение,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Ссылка,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Контрагент,
			|    ЗаявкаНаРасходованиеДенежныхСредств.Валюта,
			|    ВТ_РасшифровкаПлатежа.Сумма,
			|    ВТ_РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
			|    ВТ_РасшифровкаПлатежа.Договор,
			|    ВТ_РасшифровкаПлатежа.СсылкаНаПроектнуюЗадачу";
		
		ПодстрокаОбъектаРасчетов = ПолучитьПодстрокуОбъектаРасчетовДляЗапроса();
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПодстрокаОбъектаРасчетов", ПодстрокаОбъектаРасчетов);
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ДенежныеСредстваКВыплате = Источник.Движения.упоДенежныеСредстваКВыплате;
	ДенежныеСредстваКВыплате.Записывать = Истина;
	ДенежныеСредстваКВыплате.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

Процедура ОбработкаПроведения_СписаниеБезналичныхДенежныхСредств(Источник, РежимПроведения)
	
	Если Не Источник.ПроведеноБанком Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	ДанныеВШапкеДокумента = ИспользоватьДанныеШапкиФинансовогоДокумента(Источник);
	
	Если ДанныеВШапкеДокумента Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
			|	&ВидДвижения КАК ВидДвижения,
			|	ВЫБОР
			|		КОГДА НЕ ФинансовыйДокумент.ПроведеноБанком
			|				ИЛИ НАЧАЛОПЕРИОДА(ФинансовыйДокумент.Дата, ДЕНЬ) = ФинансовыйДокумент.ДатаПроведенияБанком
			|			ТОГДА ФинансовыйДокумент.Дата
			|		ИНАЧЕ КОНЕЦПЕРИОДА(ФинансовыйДокумент.ДатаПроведенияБанком, ДЕНЬ)
			|	КОНЕЦ КАК Период,
			|	ФинансовыйДокумент.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ФинансовыйДокумент.Организация КАК Организация,
			|	ФинансовыйДокумент.Подразделение КАК Подразделение,
			|	ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
			|	ФинансовыйДокумент.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|	ФинансовыйДокумент.Контрагент КАК Контрагент,
			|	ФинансовыйДокумент.Договор КАК Договор,
			|	ФинансовыйДокумент.Валюта КАК Валюта,
			|	СУММА(ФинансовыйДокумент.СуммаДокумента) КАК Сумма
			|ИЗ
			|	Документ.СписаниеБезналичныхДенежныхСредств КАК ФинансовыйДокумент
			|ГДЕ
			|	ФинансовыйДокумент.Ссылка = &Ссылка
			|	И ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
			|	И НЕ ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
			|	И ФинансовыйДокумент.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств,
			|	ФинансовыйДокумент.Контрагент,
			|	ФинансовыйДокумент.Валюта,
			|	ФинансовыйДокумент.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу,
			|	ФинансовыйДокумент.Подразделение,
			|	ФинансовыйДокумент.Организация,
			|	ФинансовыйДокумент.СтатьяДвиженияДенежныхСредств,
			|	ВЫБОР
			|		КОГДА НЕ ФинансовыйДокумент.ПроведеноБанком
			|				ИЛИ НАЧАЛОПЕРИОДА(ФинансовыйДокумент.Дата, ДЕНЬ) = ФинансовыйДокумент.ДатаПроведенияБанком
			|			ТОГДА ФинансовыйДокумент.Дата
			|		ИНАЧЕ КОНЕЦПЕРИОДА(ФинансовыйДокумент.ДатаПроведенияБанком, ДЕНЬ)
			|	КОНЕЦ,
			|	ФинансовыйДокумент.Договор";
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
			|	&ВидДвижения КАК ВидДвижения,
			|	ВЫБОР
			|		КОГДА НЕ РасшифровкаПлатежа.Ссылка.ПроведеноБанком
			|				ИЛИ НАЧАЛОПЕРИОДА(РасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком
			|			ТОГДА РасшифровкаПлатежа.Ссылка.Дата
			|		ИНАЧЕ КОНЕЦПЕРИОДА(РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком, ДЕНЬ)
			|	КОНЕЦ КАК Период,
			|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	РасшифровкаПлатежа.Ссылка.Организация КАК Организация,
			|	РасшифровкаПлатежа.Ссылка.Подразделение КАК Подразделение,
			|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
			|	РасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|	РасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
			|	&ПодстрокаОбъектаРасчетов КАК Договор,
			|	РасшифровкаПлатежа.Ссылка.Валюта КАК Валюта,
			|	СУММА(РасшифровкаПлатежа.Сумма) КАК Сумма
			|ИЗ
			|	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК РасшифровкаПлатежа
			|ГДЕ
			|	РасшифровкаПлатежа.Ссылка = &Ссылка
			|	И РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
			|	И НЕ РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	&ПодстрокаОбъектаРасчетов,
			|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
			|	РасшифровкаПлатежа.Ссылка.Организация,
			|	РасшифровкаПлатежа.Ссылка.Подразделение,
			|	РасшифровкаПлатежа.Ссылка.Контрагент,
			|	РасшифровкаПлатежа.Ссылка.Валюта,
			|	РасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу,
			|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств,
			|	ВЫБОР
			|		КОГДА НЕ РасшифровкаПлатежа.Ссылка.ПроведеноБанком
			|				ИЛИ НАЧАЛОПЕРИОДА(РасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ) = РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком
			|			ТОГДА РасшифровкаПлатежа.Ссылка.Дата
			|		ИНАЧЕ КОНЕЦПЕРИОДА(РасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком, ДЕНЬ)
			|	КОНЕЦ";
		
		ПодстрокаОбъектаРасчетов = ПолучитьПодстрокуОбъектаРасчетовДляЗапроса();
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПодстрокаОбъектаРасчетов", ПодстрокаОбъектаРасчетов);
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ДенежныеСредстваКВыплате = Источник.Движения.упоДенежныеСредстваКВыплате;
	ДенежныеСредстваКВыплате.Записывать = Истина;
	ДенежныеСредстваКВыплате.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

Процедура ОбработкаПроведения_РасходныйКассовыйОрдер(Источник, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	ДанныеВШапкеДокумента = ИспользоватьДанныеШапкиФинансовогоДокумента(Источник);
	
	Если ДанныеВШапкеДокумента Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
			|	&ВидДвижения КАК ВидДвижения,
			|	ФинансовыйДокумент.Дата КАК Период,
			|	ФинансовыйДокумент.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ФинансовыйДокумент.Организация КАК Организация,
			|	ФинансовыйДокумент.Подразделение КАК Подразделение,
			|	ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
			|	ФинансовыйДокумент.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|	ФинансовыйДокумент.Контрагент КАК Контрагент,
			|	ФинансовыйДокумент.Договор КАК Договор,
			|	ФинансовыйДокумент.Валюта КАК Валюта,
			|	СУММА(ФинансовыйДокумент.СуммаДокумента) КАК Сумма
			|ИЗ
			|	Документ.РасходныйКассовыйОрдер КАК ФинансовыйДокумент
			|ГДЕ
			|	ФинансовыйДокумент.Ссылка = &Ссылка
			|	И ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
			|	И НЕ ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
			|	И ФинансовыйДокумент.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ФинансовыйДокумент.ЗаявкаНаРасходованиеДенежныхСредств,
			|	ФинансовыйДокумент.Контрагент,
			|	ФинансовыйДокумент.Договор,
			|	ФинансовыйДокумент.Валюта,
			|	ФинансовыйДокумент.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу,
			|	ФинансовыйДокумент.Подразделение,
			|	ФинансовыйДокумент.Организация,
			|	ФинансовыйДокумент.СтатьяДвиженияДенежныхСредств,
			|	ФинансовыйДокумент.Дата";
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
			|	&ВидДвижения КАК ВидДвижения,
			|	РасшифровкаПлатежа.Ссылка.Дата КАК Период,
			|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	РасшифровкаПлатежа.Ссылка.Организация КАК Организация,
			|	РасшифровкаПлатежа.Ссылка.Подразделение КАК Подразделение,
			|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
			|	РасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
			|	РасшифровкаПлатежа.Ссылка.Контрагент КАК Контрагент,
			|	&ПодстрокаОбъектаРасчетов КАК Договор,
			|	РасшифровкаПлатежа.Ссылка.Валюта КАК Валюта,
			|	СУММА(РасшифровкаПлатежа.Сумма) КАК Сумма
			|ИЗ
			|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасшифровкаПлатежа
			|ГДЕ
			|	РасшифровкаПлатежа.Ссылка = &Ссылка
			|	И РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
			|	И НЕ РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
			|	РасшифровкаПлатежа.Ссылка.Организация,
			|	РасшифровкаПлатежа.Ссылка.Подразделение,
			|	РасшифровкаПлатежа.Ссылка.Контрагент,
			|	&ПодстрокаОбъектаРасчетов,
			|	РасшифровкаПлатежа.Ссылка.Валюта,
			|	РасшифровкаПлатежа.упоПроектнаяЗадача.СсылкаНаПроектнуюЗадачу,
			|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств,
			|	РасшифровкаПлатежа.Ссылка.Дата";
		
		ПодстрокаОбъектаРасчетов = ПолучитьПодстрокуОбъектаРасчетовДляЗапроса();
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПодстрокаОбъектаРасчетов", ПодстрокаОбъектаРасчетов);
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ДенежныеСредстваКВыплате = Источник.Движения.упоДенежныеСредстваКВыплате;
	ДенежныеСредстваКВыплате.Записывать = Истина;
	ДенежныеСредстваКВыплате.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

Процедура ОбработкаПроведения_ПрочиеДоходыРасходы(Источник, Отказ, РежимПроведения)
	
	ОбработкаПроведения_ПрочиеДоходыРасходы_РаспределениеРеклассификацииОПРиОХР(Источник, Отказ, РежимПроведения);
	ОбработкаПроведения_ПрочиеДоходыРасходы_ФинансовыеРезультаты(Источник, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроведения_ПрочиеДоходыРасходы_РаспределениеРеклассификацииОПРиОХР(Источник, Отказ, РежимПроведения)
	
	Если НЕ Источник.ХозяйственнаяОперация = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеклассификацияРасходов") Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеИменРеквизитов = Новый Структура;
	СоответствиеИменРеквизитов.Вставить("СпособыРаспределенияРасходовПоПроектам", "упоСпособыРаспределенияРасходовПоПроектам");
	СоответствиеИменРеквизитов.Вставить("КоэфНД", "упоКоэфНД");
	СоответствиеИменРеквизитов.Вставить("КоэфПодразделение", "упоКоэфПодразделение");
	СоответствиеИменРеквизитов.Вставить("НДНеРаспределено", "упоНДНеРаспределено");
	СоответствиеИменРеквизитов.Вставить("ПодразделенияНеРаспределено", "упоПодразделенияНеРаспределено");
	
	ПериодРегистрации = НачалоМесяца(Источник.Дата);
	ДокументРегистратор = Источник.Ссылка;
	Организация = Источник.Организация;
	
	НаборЗаписей = РегистрыСведений.упоРаспределениеРеклассификацииОПРиОХР.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПериодРегистрации.Установить(ПериодРегистрации);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.ДокументРегистратор.Установить(ДокументРегистратор);
	
	Если Источник.упоОтражениеРаспределенияРасходовОПРиОХР Тогда
		
		НомерСтроки = 1;
		ПрочиеРасходы = Источник.ПрочиеРасходы;
		
		Для Каждого СтрокаДвижений Из ПрочиеРасходы Цикл
			
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижений);
			
			НоваяСтрока.ПериодРегистрации = ПериодРегистрации;
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.ДокументРегистратор = ДокументРегистратор;
			НоваяСтрока.Номер = НомерСтроки;
			
			Для Каждого ЭлСоответствия Из СоответствиеИменРеквизитов Цикл
				НоваяСтрока[ЭлСоответствия.Ключ] = СтрокаДвижений[ЭлСоответствия.Значение];
			КонецЦикла;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецПопытки;
	
КонецПроцедуры // ОтразитьупоРаспределениеРеклассификацииОПРиОХР()

Процедура ОбработкаПроведения_ПрочиеДоходыРасходы_ФинансовыеРезультаты(Источник, РежимПроведения)
	
	Если НЕ Источник.ХозяйственнаяОперация = 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.упоОтражениеФинансовогоРезультата Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	 &Период КАК Период, 
		|	 &Ссылка КАК Регистратор,
		|    ПрочиеДоходыРасходыПрочиеРасходы.Ссылка.Организация КАК Организация,
		|    ПрочиеДоходыРасходыПрочиеРасходы.Подразделение КАК Подразделение,
		|    ПрочиеДоходыРасходыПрочиеРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|    НЕОПРЕДЕЛЕНО КАК СтатьяДоходов,
		|    ПрочиеДоходыРасходыПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
		|    0 КАК Доходы,
		|    СУММА(ПрочиеДоходыРасходыПрочиеРасходы.Сумма) КАК Расходы
		|ИЗ
		|    Документ.ПрочиеДоходыРасходы.ПрочиеРасходы КАК ПрочиеДоходыРасходыПрочиеРасходы
		|ГДЕ
		|    ПрочиеДоходыРасходыПрочиеРасходы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|    ПрочиеДоходыРасходыПрочиеРасходы.Ссылка.Организация,
		|    ПрочиеДоходыРасходыПрочиеРасходы.Подразделение,
		|    ПрочиеДоходыРасходыПрочиеРасходы.НаправлениеДеятельности,
		|    ПрочиеДоходыРасходыПрочиеРасходы.СтатьяРасходов";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.Текст = ТекстЗапроса;
	ТаблицаФинансовыеРезультаты = Запрос.Выполнить().Выгрузить();
	
	ФинансовыеРезультаты = Источник.Движения.ФинансовыеРезультаты;
	ФинансовыеРезультаты.Записывать = Истина;
	ФинансовыеРезультаты.Загрузить(ТаблицаФинансовыеРезультаты);
	
КонецПроцедуры

#КонецОбласти

#Область ЭтапыОплаты

Процедура ЭтапыОплатыДобавитьКнопку(Форма)
	
	упоПроектнаяЗадача = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Параметры.Ключ, "упоПроектнаяЗадача");
	
	Если НЕ ЗначениеЗаполнено(упоПроектнаяЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("упоПроектнаяЗадачаЗеркало", Новый ОписаниеТипов("СправочникСсылка.Проекты")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("упоПроектнаяЗадачаДокумент", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача")));
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	Форма.упоПроектнаяЗадачаЗеркало = упоПроектнаяЗадача;
	Форма.упоПроектнаяЗадачаДокумент = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(упоПроектнаяЗадача);
	упоКоманда = Форма.Команды.Добавить("упоКомандаЗаполнитьПоДаннымPM");
	упоКоманда.Заголовок = НСтр("ru = 'Заполнить по данным РМ'");
	упоКоманда.Действие = "Подключаемый_упоКомандаЗаполнитьПоДаннымPM";
	упоКоманда.ИзменяетСохраняемыеДанные = Истина;
	упоЭлемент = Форма.Элементы.Добавить(упоКоманда.Имя, Тип("КнопкаФормы"), Форма.Элементы.ЭтапыГрафикаОплаты.КоманднаяПанель);
	упоЭлемент.ИмяКоманды = упоКоманда.Имя;
	
КонецПроцедуры

Процедура ЗаполнитьЭтапыОплатыПоДаннымPM(ПараметрыОбработки, НаправлениеДвижения, СоответствиеВидов)
	
	ПараметрыОбработкиЛокальные = Новый Структура("Заказ, Контрагент, ПроектнаяЗадачаДокумент, 
			|СуммаОплатыПоДокументу");
	
	ПодготовитьЛокальныеПараметрыОбработки(ПараметрыОбработки, ПараметрыОбработкиЛокальные);
	
	Заказ = ПараметрыОбработкиЛокальные.Заказ;
	Контрагент = ПараметрыОбработкиЛокальные.Контрагент;
	ПроектнаяЗадачаДокумент = ПараметрыОбработкиЛокальные.ПроектнаяЗадачаДокумент;
	СуммаОплатыПоДокументу = ПараметрыОбработкиЛокальные.СуммаОплатыПоДокументу;
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадачаДокумент);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадачаДокумент", ПроектнаяЗадачаДокумент);
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	Запрос.УстановитьПараметр("НаправлениеДвижения", НаправлениеДвижения);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.ВидПлатежа КАК ВидПлатежа,
		|	СУММА(Т.Сумма) КАК Сумма,
		|	Т.ДатаДвижения КАК ДатаДвижения
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
		|			,
		|			Версия = &ТекВерсия
		|				И ПроектнаяЗадача = &ПроектнаяЗадачаДокумент) КАК Т
		|ГДЕ
		|	Т.НаправлениеДвижения = &НаправлениеДвижения
		|	И Т.Контрагент = &ДоговорКонтрагент
		|	И Т.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.ВидПлатежа,
		|	Т.ДатаДвижения
		|ИТОГИ ПО
		|	ОБЩИЕ";
	
	ДоговорКонтрагента = Заказ.Договор;
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".Контрагент", ".Договор");
		Запрос.УстановитьПараметр("ДоговорКонтрагент", ДоговорКонтрагента);
	Иначе
		Запрос.УстановитьПараметр("ДоговорКонтрагент", Контрагент);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультат = Результат.Выгрузить();
	
	СуммаБаза = ТаблицаРезультат[0].Сумма;
	ТаблицаРезультат.Удалить(0);
	
	Заказ.ЭтапыГрафикаОплаты.Очистить();
	
	ОстатокБазы = СуммаБаза;
	ПроцентовРаспределено = 0;
	СуммаРаспределено = 0;
	
	ДатаОтгрузки = Заказ.ДатаОтгрузки;
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		
		ДатаПлатежа = СтрокаТаблицы.ДатаДвижения;
		
		тЭтапГрафикаОплаты = Заказ.ЭтапыГрафикаОплаты.Добавить();
		тЭтапГрафикаОплаты.ВариантОплаты = СоответствиеВидов.Получить(СтрокаТаблицы.ВидПлатежа);
		тЭтапГрафикаОплаты.ДатаПлатежа = ДатаПлатежа;
		
		Если ДатаПлатежа < ДатаОтгрузки Тогда
			тЭтапГрафикаОплаты.ВариантОтсчета = 
				упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ДоДатыОтгрузки");
		Иначе
			тЭтапГрафикаОплаты.ВариантОтсчета = 
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки");
		КонецЕсли;
		
		ЗаполнитьОтсрочкуПлатежа(тЭтапГрафикаОплаты, Заказ);
		
		ОстатокБазы = ОстатокБазы - СтрокаТаблицы.Сумма;
		Если ОстатокБазы = 0 Тогда
			тЭтапГрафикаОплаты.ПроцентПлатежа = 100 - ПроцентовРаспределено;
			тЭтапГрафикаОплаты.СуммаПлатежа = СуммаОплатыПоДокументу - СуммаРаспределено;
		Иначе
			тЭтапГрафикаОплаты.ПроцентПлатежа = СтрокаТаблицы.Сумма * 100 / СуммаБаза;
			тЭтапГрафикаОплаты.СуммаПлатежа = тЭтапГрафикаОплаты.ПроцентПлатежа * СуммаОплатыПоДокументу / 100;
		КонецЕсли;
		ПроцентовРаспределено = ПроцентовРаспределено + тЭтапГрафикаОплаты.ПроцентПлатежа;
		СуммаРаспределено = СуммаРаспределено + тЭтапГрафикаОплаты.СуммаПлатежа;
		
		Если ОстатокБазы = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьЛокальныеПараметрыОбработки(ПараметрыОбработки, ПараметрыОбработкиЛокальные)
	
	Если ПараметрыОбработки.Свойство("Заказ") Тогда
		ПараметрыОбработкиЛокальные.Заказ = ПараметрыОбработки.Заказ;
		ПараметрыОбработкиЛокальные.Контрагент = ПараметрыОбработки.Заказ.Контрагент;
		ПараметрыОбработкиЛокальные.ПроектнаяЗадачаДокумент = ПараметрыОбработки.ДокументОснование;
		ПараметрыОбработкиЛокальные.СуммаОплатыПоДокументу = ПараметрыОбработки.СуммаПоДокументу;
	ИначеЕсли ПараметрыОбработки.Свойство("Форма") Тогда
		ПараметрыОбработкиЛокальные.Заказ = ПараметрыОбработки.Форма;
		ПараметрыОбработкиЛокальные.Контрагент = ПараметрыОбработки.Контрагент;
		ПараметрыОбработкиЛокальные.ПроектнаяЗадачаДокумент = ПараметрыОбработкиЛокальные.Заказ.упоПроектнаяЗадачаДокумент;
		ПараметрыОбработкиЛокальные.СуммаОплатыПоДокументу = ПараметрыОбработкиЛокальные.Заказ.СуммаОплатыПоДокументу;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтсрочкуПлатежа(тЭтапГрафикаОплаты, Заказ)
	
	Если ТипЗнч(Заказ) = Тип("ДокументОбъект.ЗаказКлиента")
		Или ТипЗнч(Заказ) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		ДатаЗаказа = Заказ.Дата;
		ДатаПереходаПраваСобственности = Дата("00010101");
	Иначе
		ДатаЗаказа = Заказ.ДатаЗаказа;
		ДатаПереходаПраваСобственности = Заказ.ДатаПереходаПраваСобственности;
	КонецЕсли;
	
	ЭтапыОплатыКлиентСерверМодуль = ОбщегоНазначения.ОбщийМодуль("ЭтапыОплатыКлиентСервер");
	ЭтапыОплатыВызовСервераМодуль = ОбщегоНазначения.ОбщийМодуль("ЭтапыОплатыВызовСервера");
	
	РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Заказ.Соглашение,
			"СрокПереходаПраваСобственности,Календарь");
	СрокПереходаПраваСобственности = РеквизитыСоглашения.СрокПереходаПраваСобственности;
	Календарь = РеквизитыСоглашения.Календарь;
	
	СтруктураПараметров = ЭтапыОплатыКлиентСерверМодуль.ПараметрыРасчетаДатыПлатежа();
	СтруктураПараметров.ВариантОтсчета = тЭтапГрафикаОплаты.ВариантОтсчета;
	СтруктураПараметров.ДатаПлатежа = тЭтапГрафикаОплаты.ДатаПлатежа;
	СтруктураПараметров.ДатаЗаказа = ДатаЗаказа;
	СтруктураПараметров.ДатаСогласования = Заказ.ДатаСогласования;
	СтруктураПараметров.ДатаОтгрузки = Заказ.ДатаОтгрузки;
	СтруктураПараметров.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
	СтруктураПараметров.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
	СтруктураПараметров.Календарь = Календарь;
	
	Если ЗначениеЗаполнено(Календарь) Тогда
		тЭтапГрафикаОплаты.Сдвиг = ЭтапыОплатыВызовСервераМодуль.СдвигПоКалендарю(СтруктураПараметров);
	Иначе
		тЭтапГрафикаОплаты.Сдвиг = ЭтапыОплатыКлиентСерверМодуль.СдвигБезКалендаря(СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
