#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	УстановитьСвойстваЭлементовРаспределенияРасходов();
	
	ОбновитьУточнениеПривязкиТрудозатрат(ЭтаФорма, Объект);
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьОбъектПоДаннымФормы_ОПРОХР();
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
	Объект, 
	Отказ, 
	СтандартнаяОбработка, 
	ЗавершениеРаботы, 
	ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();    
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПривязкиРасходовТрудозатратыПриИзменении(Элемент)
	
	ОбновитьУточнениеПривязкиТрудозатрат(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыРаспределенияРасходовПоПроектамРеглПриИзменении(Элемент)
	
	ФормироватьНЗП = ПредопределенноеЗначение("Справочник.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП");
	Элементы.СтатьяРаспределенияРасходовРегл.Доступность = НЕ Объект.СпособыРаспределенияРасходовПоПроектамРегл = ФормироватьНЗП;
	
	Если Объект.СпособыРаспределенияРасходовПоПроектамРегл = СпособыРаспределенияРасходовПоПроектам Тогда
		Элементы.СтатьяРаспределенияРасходов.Доступность = НЕ Объект.СпособыРаспределенияРасходовПоПроектамРегл = ФормироватьНЗП;
	Иначе
		Элементы.СтатьяРаспределенияРасходов.Доступность = НЕ СпособыРаспределенияРасходовПоПроектам = ФормироватьНЗП;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыРаспределенияРасходовПоПроектамПриИзменении(Элемент)
	
	ФормироватьНЗП = ПредопределенноеЗначение("Справочник.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП");
	Элементы.СтатьяРаспределенияРасходовРегл.Доступность = НЕ Объект.СпособыРаспределенияРасходовПоПроектамРегл = ФормироватьНЗП;
	
	Если Объект.СпособыРаспределенияРасходовПоПроектамРегл = СпособыРаспределенияРасходовПоПроектам Тогда
		Элементы.СтатьяРаспределенияРасходов.Доступность = НЕ Объект.СпособыРаспределенияРасходовПоПроектамРегл = ФормироватьНЗП;
	Иначе
		Элементы.СтатьяРаспределенияРасходов.Доступность = НЕ СпособыРаспределенияРасходовПоПроектам = ФормироватьНЗП;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4, П5, П5, П6);
	
КонецФункции

#КонецОбласти

#Область Распределение_ОПРОХР

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР()
		И Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		Возврат;
	КонецЕсли;
	
	СтатьяРасходовERP = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(СтатьяРасходовERP)  Тогда
		ВариантыРаспределенияНеРаспределять = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
			"Перечисление.ВариантыРаспределенияРасходов.НеРаспределять");            
		Реквизиты__СтатьяРасходовERP = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяРасходовERP, "ВариантРаспределенияРасходовРегл");
		РаспределятьВручнуюРегл = Реквизиты__СтатьяРасходовERP["ВариантРаспределенияРасходовРегл"] = ВариантыРаспределенияНеРаспределять;        
	Иначе        
		РаспределятьВручнуюРегл = Ложь;        
	КонецЕсли; 
	
	Если РаспределятьВручнуюРегл Тогда
		
		Если Объект.СпособыРаспределенияРасходовПоПроектамРегл = Объект.СпособыРаспределенияРасходовПоПроектам Тогда
			СпособыРаспределенияРасходовПоПроектам = ПредопределенноеЗначение("Справочник.упоСпособыРаспределенияРасходовПоПроектам.ПустаяСсылка");
		Иначе
			СпособыРаспределенияРасходовПоПроектам = Объект.СпособыРаспределенияРасходовПоПроектам;;
		КонецЕсли;
		
		Если Объект.СтатьяРаспределенияРасходовРегл = Объект.СтатьяРаспределенияРасходов Тогда
			СтатьяРаспределенияРасходов = Справочники.упоСтатьиЗатрат.ПустаяСсылка();
		Иначе
			СтатьяРаспределенияРасходов = Объект.СтатьяРаспределенияРасходов;;
		КонецЕсли;    
		
	Иначе
		
		СпособыРаспределенияРасходовПоПроектам = Объект.СпособыРаспределенияРасходовПоПроектам;;
		СтатьяРаспределенияРасходов = Объект.СтатьяРаспределенияРасходов;;
		
	КонецЕсли;      
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовРаспределенияРасходов_ОПРОХР()

	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		
		Элементы.НастройкиРаспределениеРасходов.Видимость = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ФормироватьНЗП = ПредопределенноеЗначение("Справочник.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП");
	СтатьяРасходовERP = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(Объект.Ссылка);
	
	Если ЗначениеЗаполнено(СтатьяРасходовERP)  Тогда
		
		ВариантыРаспределенияНеРаспределять = 
			упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
				"Перечисление.ВариантыРаспределенияРасходов.НеРаспределять");
		Реквизиты__СтатьяРасходовERP = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяРасходовERP, 
		"ВариантРаспределенияРасходовРегл, ВариантРаспределенияРасходовУпр");
		РаспределятьВручнуюРегл = 
		Реквизиты__СтатьяРасходовERP["ВариантРаспределенияРасходовРегл"] = ВариантыРаспределенияНеРаспределять;
		РаспределятьВручнуюУпр = 
		Реквизиты__СтатьяРасходовERP["ВариантРаспределенияРасходовУпр"] = ВариантыРаспределенияНеРаспределять;
		
	Иначе
		
		РаспределятьВручнуюРегл = Ложь;
		РаспределятьВручнуюУпр = Ложь;
		
	КонецЕсли; 
	
	Элементы.СпособыРаспределенияРасходовПоПроектамРегл.Видимость = РаспределятьВручнуюРегл;
	Элементы.СпособыРаспределенияРасходовПоПроектамРеглНадпись.Видимость = НЕ РаспределятьВручнуюРегл;
	Элементы.СтатьяРаспределенияРасходовРегл.Видимость = РаспределятьВручнуюРегл;
	Элементы.СтатьяРаспределенияРасходовРеглНадпись.Видимость = НЕ РаспределятьВручнуюРегл;
	
	Элементы.СтатьяРаспределенияРасходовРегл.Доступность = 
	НЕ Объект.СпособыРаспределенияРасходовПоПроектамРегл = ФормироватьНЗП;
	
	Элементы.СпособыРаспределенияРасходовПоПроектам.Видимость = РаспределятьВручнуюУпр;
	Элементы.СпособыРаспределенияРасходовПоПроектамНадпись.Видимость = НЕ РаспределятьВручнуюУпр;
	Элементы.СтатьяРаспределенияРасходов.Видимость = РаспределятьВручнуюУпр;
	Элементы.СтатьяРаспределенияРасходовНадпись.Видимость = НЕ РаспределятьВручнуюУпр;
	
	Если Объект.СпособыРаспределенияРасходовПоПроектамРегл = СпособыРаспределенияРасходовПоПроектам Тогда
		Элементы.СтатьяРаспределенияРасходов.Доступность = 
		НЕ Объект.СпособыРаспределенияРасходовПоПроектамРегл = ФормироватьНЗП;
	Иначе
		Элементы.СтатьяРаспределенияРасходов.Доступность = НЕ СпособыРаспределенияРасходовПоПроектам = ФормироватьНЗП;
	КонецЕсли;
	
	Если РаспределятьВручнуюРегл И РаспределятьВручнуюУпр Тогда
		ТекстПодсказка = НСтр("ru = ' так же как в регл. учете'");
		Элементы.СпособыРаспределенияРасходовПоПроектам.ПодсказкаВвода = ТекстПодсказка; 
		Элементы.СтатьяРаспределенияРасходов.ПодсказкаВвода = ТекстПодсказка; 
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьСвойстваЭлементовРаспределенияРасходов()
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
		
		УстановитьСвойстваЭлементовРаспределенияРасходов_ОПРОХР();
		Возврат;
		
	КонецЕсли;
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		
		Элементы.НастройкиРаспределениеРасходов.Видимость = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Элементы.НастройкиРаспределениеРасходов.Видимость = Истина;
	Элементы.НастройкиРаспределениеРасходовУпр.Видимость = Истина;
	
	Элементы.СпособыРаспределенияРасходовПоПроектамРегл.Видимость = Ложь;
	Элементы.СпособыРаспределенияРасходовПоПроектамРеглНадпись.Видимость = Ложь;
	Элементы.СтатьяРаспределенияРасходовРегл.Видимость = Ложь;
	Элементы.СтатьяРаспределенияРасходовРеглНадпись.Видимость = Ложь;
	
	Элементы.СпособыРаспределенияРасходовПоПроектамНадпись.Видимость = Ложь;
	Элементы.СтатьяРаспределенияРасходовНадпись.Видимость = Ложь;
	Элементы.СпособыРаспределенияРасходовПоПроектам.Видимость = Истина;
	Элементы.СтатьяРаспределенияРасходов.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбъектПоДаннымФормы_ОПРОХР()
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР()
		И Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СпособыРаспределенияРасходовПоПроектам = СпособыРаспределенияРасходовПоПроектам;
	
	Объект.СтатьяРаспределенияРасходов = СтатьяРаспределенияРасходов;
	
	СпособыРаспределенияРегл = Элементы.СпособыРаспределенияРасходовПоПроектамРегл.Видимость;
	СпособыРаспределения = Элементы.СпособыРаспределенияРасходовПоПроектам.Видимость;
	
	Если СпособыРаспределенияРегл И СпособыРаспределения Тогда
		Если НЕ ЗначениеЗаполнено(Объект.СпособыРаспределенияРасходовПоПроектам) Тогда
			Объект.СпособыРаспределенияРасходовПоПроектам = Объект.СпособыРаспределенияРасходовПоПроектамРегл;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.СтатьяРаспределенияРасходов) Тогда
			Объект.СтатьяРаспределенияРасходов = Объект.СтатьяРаспределенияРасходовРегл;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьУточнениеПривязкиТрудозатрат(Форма, Объект)
	
	Элементы = Форма.Элементы;
	
	Если Объект.СпособПривязкиРасходовТрудозатраты = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно") Тогда
		Элементы.УточнениеПривязки.ТекущаяСтраница = Элементы.СтраницаПериодАгрегации;
	ИначеЕсли Объект.СпособПривязкиРасходовТрудозатраты = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
		Элементы.УточнениеПривязки.ТекущаяСтраница = Элементы.СтраницаПрофильПривязки;
	Иначе
		Элементы.УточнениеПривязки.ТекущаяСтраница = Элементы.СтраницаПусто;
	КонецЕсли;		
	
КонецПроцедуры	

#КонецОбласти
