
#Область ПодпискиНаСобытие

Процедура ИКТ_RequestПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт 
	
	Источник.ДополнительныеСвойства.Вставить("ИКТ_РежимЗаписи", РежимЗаписи); 
	Источник.ДополнительныеСвойства.Вставить("ИКТ_Модифицированность", Источник.Модифицированность()); 
	Источник.ДополнительныеСвойства.Вставить("ИКТ_ЭтоУдаление", Ложь); 
	
КонецПроцедуры   

Процедура ИКТ_RequestПередЗаписьюСправочника(Источник, Отказ) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ИКТ_Модифицированность", Источник.Модифицированность()); 
	Источник.ДополнительныеСвойства.Вставить("ИКТ_ЭтоУдаление", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПометкаУдаления") = Ложь И Источник.ПометкаУдаления = Истина);
	
КонецПроцедуры  

Процедура ИКТ_RequestПриЗаписиСвязанногоСправочника(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ИКТ_Модифицированность") И Источник.ДополнительныеСвойства.ИКТ_Модифицированность Тогда 
		
		Если ТипЗнч(Источник) = Тип("СправочникОбъект.ФизическиеЛица") Тогда
			ОбработкаЗаписиФизическогоЛица(Источник.Ссылка); 
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры 

Процедура ИКТ_RequestПриЗаписиНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	//Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДокументыФизическихЛиц") Тогда
	//	
	//	МассивФизЛиц = Новый Массив;
	//	
	//	Для каждого запись из Источник Цикл   
	//		Если Запись.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ
	//			ИЛИ Запись.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение Тогда
	//			
	//				МассивФизЛиц.Добавить(Запись.Физлицо); 
	//				
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	Если МассивФизЛиц.Количество() > 0 Тогда
	//		
	//		ОбработкаЗаписиФизическогоЛица(МассивФизЛиц);
	//		
	//	КонецЕсли; 
	//	
	//ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ГрафикРаботыСотрудников") Тогда
	//	
	//	ТЗНабора = Источник.Выгрузить();
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("ТЗНабора", ТЗНабора);
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ВЫРАЗИТЬ(ТЗНабора.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
	//	|	ТЗНабора.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	//	|	ТЗНабора.ГрафикРаботы КАК ГрафикРаботы,
	//	|	ТЗНабора.Период КАК Период
	//	|ПОМЕСТИТЬ ВТ_ТЗНабора
	//	|ИЗ
	//	|	&ТЗНабора КАК ТЗНабора
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ИКТ_СоответствиеОбъектов.ОбъектУУ КАК ОбъектУУ
	//	|ПОМЕСТИТЬ ВТ_ОрганизацииУОС
	//	|ИЗ
	//	|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
	//	|ГДЕ
	//	|	ИКТ_СоответствиеОбъектов.ОбъектБУ ССЫЛКА Справочник.Организации
	//	|	И ИКТ_СоответствиеОбъектов.ОбъектУУ ССЫЛКА Справочник.Организации
	//	|	И ИКТ_СоответствиеОбъектов.ОбъектУУ <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ТЗНабора.Сотрудник КАК Сотрудник,
	//	|	ВТ_ТЗНабора.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	//	|	ВТ_ТЗНабора.ГрафикРаботы КАК ГрафикРаботы,
	//	|	ВТ_ТЗНабора.Период КАК Период
	//	|ПОМЕСТИТЬ ВТ_НаборПоОрганизацииУУ
	//	|ИЗ
	//	|	ВТ_ТЗНабора КАК ВТ_ТЗНабора
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОрганизацииУОС КАК ВТ_ОрганизацииУОС
	//	|		ПО ВТ_ТЗНабора.ГоловнаяОрганизация = ВТ_ОрганизацииУОС.ОбъектУУ
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ГрафикРаботыСотрудников.Период КАК Период,
	//	|	ГрафикРаботыСотрудников.Сотрудник КАК Сотрудник,
	//	|	ГрафикРаботыСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	//	|	ГрафикРаботыСотрудников.ГрафикРаботы КАК ГрафикРаботы
	//	|ПОМЕСТИТЬ ВТ_ВсеГрафикиСотрудников
	//	|ИЗ
	//	|	РегистрСведений.ГрафикРаботыСотрудников КАК ГрафикРаботыСотрудников
	//	|ГДЕ
	//	|	(ГрафикРаботыСотрудников.Сотрудник, ГрафикРаботыСотрудников.ГоловнаяОрганизация) В
	//	|			(ВЫБРАТЬ
	//	|				ВТ_НаборПоОрганизацииУУ.Сотрудник КАК Сотрудник,
	//	|				ВТ_НаборПоОрганизацииУУ.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	//	|			ИЗ
	//	|				ВТ_НаборПоОрганизацииУУ КАК ВТ_НаборПоОрганизацииУУ)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ВсеГрафикиСотрудников.Сотрудник КАК Сотрудник,
	//	|	ВТ_ВсеГрафикиСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	//	|	МАКСИМУМ(ВТ_ВсеГрафикиСотрудников.Период) КАК Период
	//	|ПОМЕСТИТЬ ВТ_ДатаПредыдущегоГрафика
	//	|ИЗ
	//	|	ВТ_НаборПоОрганизацииУУ КАК ВТ_НаборПоОрганизацииУУ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеГрафикиСотрудников КАК ВТ_ВсеГрафикиСотрудников
	//	|		ПО ВТ_НаборПоОрганизацииУУ.Сотрудник = ВТ_ВсеГрафикиСотрудников.Сотрудник
	//	|			И ВТ_НаборПоОрганизацииУУ.ГоловнаяОрганизация = ВТ_ВсеГрафикиСотрудников.ГоловнаяОрганизация
	//	|			И ВТ_НаборПоОрганизацииУУ.Период > ВТ_ВсеГрафикиСотрудников.Период
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_ВсеГрафикиСотрудников.Сотрудник,
	//	|	ВТ_ВсеГрафикиСотрудников.ГоловнаяОрганизация
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ВсеГрафикиСотрудников.Сотрудник КАК Сотрудник,
	//	|	ВТ_ВсеГрафикиСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	//	|	ВТ_ВсеГрафикиСотрудников.ГрафикРаботы КАК ГрафикРаботы
	//	|ПОМЕСТИТЬ ВТ_ПредыдущийГрафикСотрудника
	//	|ИЗ
	//	|	ВТ_ДатаПредыдущегоГрафика КАК ВТ_ДатаПредыдущегоГрафика
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеГрафикиСотрудников КАК ВТ_ВсеГрафикиСотрудников
	//	|		ПО ВТ_ДатаПредыдущегоГрафика.Сотрудник = ВТ_ВсеГрафикиСотрудников.Сотрудник
	//	|			И ВТ_ДатаПредыдущегоГрафика.ГоловнаяОрганизация = ВТ_ВсеГрафикиСотрудников.ГоловнаяОрганизация
	//	|			И ВТ_ДатаПредыдущегоГрафика.Период = ВТ_ВсеГрафикиСотрудников.Период
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_НаборПоОрганизацииУУ.Сотрудник КАК Сотрудник,
	//	|	ВТ_НаборПоОрганизацииУУ.ГрафикРаботы КАК ГрафикРаботы,
	//	|	ВТ_НаборПоОрганизацииУУ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	//	|	ВТ_ПредыдущийГрафикСотрудника.ГрафикРаботы КАК ПредыдущийГрафикРаботы,
	//	|	ВТ_НаборПоОрганизацииУУ.Период КАК Период,
	//	|	ВТ_НаборПоОрганизацииУУ.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
	//	|ИЗ
	//	|	ВТ_НаборПоОрганизацииУУ КАК ВТ_НаборПоОрганизацииУУ
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредыдущийГрафикСотрудника КАК ВТ_ПредыдущийГрафикСотрудника
	//	|		ПО ВТ_НаборПоОрганизацииУУ.Сотрудник = ВТ_ПредыдущийГрафикСотрудника.Сотрудник
	//	|			И ВТ_НаборПоОрганизацииУУ.ГоловнаяОрганизация = ВТ_ПредыдущийГрафикСотрудника.ГоловнаяОрганизация
	//	|ГДЕ
	//	|	(ВТ_НаборПоОрганизацииУУ.ГрафикРаботы <> ВТ_ПредыдущийГрафикСотрудника.ГрафикРаботы
	//	|			ИЛИ ВТ_ПредыдущийГрафикСотрудника.ГрафикРаботы ЕСТЬ NULL)"; 
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	
	//	ТаблицаФизЛиц = Новый ТаблицаЗначений;
	//	ТаблицаФизЛиц.Колонки.Добавить("ФизическоеЛицо",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	//	ТаблицаФизЛиц.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата"));
	//	ТаблицаФизЛиц.Колонки.Добавить("ГрафикРаботы",Новый ОписаниеТипов("СправочникСсылка.ГрафикиРаботыСотрудников"));
	//	
	//	Пока Выборка.Следующий() Цикл  
	//		
	//		ЗаполнитьЗначенияСвойств(ТаблицаФизЛиц.Добавить(), Выборка);
	//		
	//		ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ИзменениеГрафикаРаботы;
	//		
	//		РезультатСобытияОбмена = ПолучитьСобытияПоОбъектуИАналитике(Выборка.ГрафикРаботы, ТипСобытия, Выборка.Сотрудник); 
	//		
	//		ГрафикОбъект = Выборка.ГрафикРаботы.ПолучитьОбъект(); 
	//		ГрафикОбъект.ДополнительныеСвойства.Вставить("ИКТ_Модифицированность", Истина); 
	//		ГрафикОбъект.ДополнительныеСвойства.Вставить("ИКТ_ЭтоУдаление", Ложь);

	//		СоздатьОбновитьСобытиеРеквестПриНеобходимости(РезультатСобытияОбмена, ГрафикОбъект, ТипСобытия, Выборка.ГоловнаяОрганизация, Выборка.Период, Выборка.Сотрудник, "ИзменениеГрафикаРаботы"); 
	//		
	//	КонецЦикла;  
	//	
	//	Если ТаблицаФизЛиц.Количество() > 0 Тогда
	//		ВыполнитьРассылкуSMSУведомленийИзмененийГрафика(ТаблицаФизЛиц);
	//	КонецЕсли;
	//			
	//КонецЕсли;
				
КонецПроцедуры   

Процедура ВыполнитьРассылкуSMSУведомленийИзмененийГрафика(ТаблицаФизЛиц)  
	
	Если НЕ Константы.ИКТ_ВыполнятьОтправкуСМССотрудникам.Получить() Тогда 
		Возврат;	
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОтправкаSMS.ДоступнаОтправкаSMS() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаФизЛиц", ТаблицаФизЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаФизЛиц.ГрафикРаботы КАК ГрафикРаботы,
		|	НАЧАЛОПЕРИОДА(ТаблицаФизЛиц.Период, ДЕНЬ) КАК Период
		|ПОМЕСТИТЬ ВТ_ТаблицаФизЛиц
		|ИЗ
		|	&ТаблицаФизЛиц КАК ТаблицаФизЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ИсточникКонтактнойИнформации,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК НомерТелефона,
		|	ПРЕДСТАВЛЕНИЕ(ФизическиеЛицаКонтактнаяИнформация.Ссылка) КАК Представление
		|ПОМЕСТИТЬ ВТ_ТелефоныФизЛиц
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	(ФизическиеЛицаКонтактнаяИнформация.Ссылка, ФизическиеЛицаКонтактнаяИнформация.Вид) В
		|			(ВЫБРАТЬ
		|				ВТ_ТаблицаФизЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|				ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица)
		|			ИЗ
		|				ВТ_ТаблицаФизЛиц КАК ВТ_ТаблицаФизЛиц)
		|	И ФизическиеЛицаКонтактнаяИнформация.Представление <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаФизЛиц.Период КАК Период,
		|	ВТ_ТелефоныФизЛиц.ИсточникКонтактнойИнформации КАК ИсточникКонтактнойИнформации,
		|	ВТ_ТелефоныФизЛиц.НомерТелефона КАК НомерТелефона,
		|	ВТ_ТелефоныФизЛиц.Представление КАК Представление,
		|	ВТ_ТаблицаФизЛиц.ГрафикРаботы КАК ГрафикРаботы
		|ИЗ
		|	ВТ_ТаблицаФизЛиц КАК ВТ_ТаблицаФизЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТелефоныФизЛиц КАК ВТ_ТелефоныФизЛиц
		|		ПО ВТ_ТаблицаФизЛиц.ФизическоеЛицо = ВТ_ТелефоныФизЛиц.ИсточникКонтактнойИнформации
		|ИТОГИ ПО
		|	ГрафикРаботы,
		|	Период";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГрафикРаботы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГрафикРаботы.Следующий() Цикл
		
		ВыборкаПериод = ВыборкаГрафикРаботы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПериод.Следующий() Цикл
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Вам установлен новый график работы ""%1"" начиная с даты %2'; en = 'You have a new work schedule set for ""%1"" starting from date %2'"),
				ВыборкаПериод.ГрафикРаботы,
				Формат(ВыборкаПериод.Период, "ДФ=dd.MM.yyyy"));
				
			Сообщение = Новый Структура;
			Сообщение.Вставить("Текст", ТекстСообщения);
			Сообщение.Вставить("ДополнительныеПараметры", Новый Структура);
			Сообщение.ДополнительныеПараметры.Вставить("Наименование", ""); 
			Сообщение.ДополнительныеПараметры.Вставить("ПеревестиВТранслит", Ложь); 
			Сообщение.Вставить("Получатель", Новый Массив);
			
			Выборка = ВыборкаПериод.Выбрать();
			
			Пока Выборка.Следующий() Цикл  
				
				АдресатSMS = Новый Структура("ИсточникКонтактнойИнформации,Представление,НомерТелефона");
				
				ЗаполнитьЗначенияСвойств(АдресатSMS, Выборка);
				
				Сообщение.Получатель.Добавить(АдресатSMS);  
				
			КонецЦикла; 
			
			Если Сообщение.Получатель.Количество() <> 0 Тогда  
				
				Взаимодействия.СоздатьИОтправитьСообщениеSMS(Сообщение);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаписиФизическогоЛица(ФизическоеЛицо)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ КАК ОбъектУУ
		|ПОМЕСТИТЬ ВТ_ОрганизацииУОС
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
		|ГДЕ
		|	ИКТ_СоответствиеОбъектов.ОбъектБУ ССЫЛКА Справочник.Организации
		|	И ИКТ_СоответствиеОбъектов.ОбъектУУ ССЫЛКА Справочник.Организации
		|	И ИКТ_СоответствиеОбъектов.ОбъектУУ <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ФизическоеЛицо В(&ФизическоеЛицо)
		|	И Сотрудники.ГоловнаяОрганизация В
		|			(ВЫБРАТЬ
		|				ВТ_ОрганизацииУОС.ОбъектУУ КАК ОбъектУУ
		|			ИЗ
		|				ВТ_ОрганизацииУОС КАК ВТ_ОрганизацииУОС)";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		СотрудникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		СотрудникОбъект.ДополнительныеСвойства.Вставить("ИКТ_Модифицированность", Истина); 
		СотрудникОбъект.ДополнительныеСвойства.Вставить("ИКТ_ЭтоУдаление", Ложь); 
		
		Отказ = Ложь; 
		
		ИКТ_RequestПриЗаписиСправочника(СотрудникОбъект, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИКТ_RequestПриЗаписиСправочника(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ИКТ_ЗагрузкаДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если ИКТ_RequestСерверСлужебный.ИспользоватьОбменСРексвест() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	МассивТиповСобытий = ПолучитьМассивСобытийДляОбъекта(ТипЗнч(Источник));
	
	Если МассивТиповСобытий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ОтправлятьСобытиеВРеквест(Источник) Тогда
		
		Возврат;
		
	КонецЕсли;

	Организация = Неопределено;

	МассивТиповБезКонтроляУОС = ПолучитьМассивТиповБезКонтроляУОС();
	
	Если МассивТиповБезКонтроляУОС.Найти(ТипЗнч(Источник)) = Неопределено Тогда
		
		ЭтоСобытиеУОС = СобытиеПоОрганизацииУОС(Источник, Организация);
		
		Если Не ЭтоСобытиеУОС Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;   
	
	Если Не ЭтоСобытиеУОС Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТипСобытия из МассивТиповСобытий Цикл
		
		Если Источник.Метаданные().Реквизиты.Найти("Сотрудник") <> Неопределено Тогда  
			
			РезультатСобытияОбмена = ПолучитьСобытияПоОбъектуИАналитике(Источник.Ссылка, ТипСобытия, Источник.Сотрудник); 
			
			СоздатьОбновитьСобытиеРеквестПриНеобходимости(РезультатСобытияОбмена, Источник, ТипСобытия, Организация, ТекущаяДатаСеанса(), Источник.Сотрудник); 
			
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ШтатноеРасписание") Тогда  
			
			РезультатСобытияОбмена = ПолучитьСобытияПоОбъектуИАналитике(Источник.Ссылка, ТипСобытия, Источник.Ссылка); 
			
			СоздатьОбновитьСобытиеРеквестПриНеобходимости(РезультатСобытияОбмена, Источник, ТипСобытия, Организация, ТекущаяДатаСеанса(), Источник.Ссылка); 
						
		Иначе
			
			РезультатСобытияОбмена = ПолучитьСобытияПоОбъектуИАналитике(Источник.Ссылка, ТипСобытия); 
			
			СоздатьОбновитьСобытиеРеквестПриНеобходимости(РезультатСобытияОбмена, Источник, ТипСобытия, Организация, ТекущаяДатаСеанса()); 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры   

Процедура ИКТ_RequestОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ИКТ_ЗагрузкаДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если ИКТ_RequestСерверСлужебный.ИспользоватьОбменСРексвест() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	МассивТиповСобытий = ПолучитьМассивСобытийДляОбъекта(ТипЗнч(Источник));
	
	Если МассивТиповСобытий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ОтправлятьСобытиеВРеквест(Источник) Тогда
		
		Возврат;
		
	КонецЕсли;
		
	Организация = Неопределено;  

	МассивТиповБезКонтроляУОС = ПолучитьМассивТиповБезКонтроляУОС();
	
	Если МассивТиповБезКонтроляУОС.Найти(ТипЗнч(Источник)) = Неопределено Тогда
		
		ЭтоСобытиеУОС = СобытиеПоОрганизацииУОС(Источник, Организация);
		
		Если Не ЭтоСобытиеУОС Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;   
	
	МассивДопАналитик = ПолучитьМассивДопАналитикПоДокументу(Источник); 
	
	Для каждого ТипСобытия из МассивТиповСобытий Цикл
	
		Для каждого ДопАналитика Из МассивДопАналитик Цикл
			
			РезультатСобытияОбмена = ПолучитьСобытияПоОбъектуИАналитике(Источник.Ссылка, ТипСобытия, ДопАналитика);
				
			СоздатьОбновитьСобытиеРеквестПриНеобходимости(РезультатСобытияОбмена, Источник, ТипСобытия, Организация, Источник.Дата, ДопАналитика);
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ИКТ_RequestОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если ИКТ_RequestСерверСлужебный.ИспользоватьОбменСРексвест() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	МассивТиповСобытий = ПолучитьМассивСобытийДляОбъекта(ТипЗнч(Источник));
	
	Если МассивТиповСобытий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
		
	Организация = Неопределено;
	ЭтоСобытиеУОС = СобытиеПоОрганизацииУОС(Источник, Организация);
	
	Если Не ЭтоСобытиеУОС Тогда
		Возврат;
	КонецЕсли;  
	
	УдаляемыеСобытия = Новый Массив;
	УдаляемыеСобытия.Добавить(Перечисления.ИКТ_RequestТипыСобытий.РаботаНеПоГрафику);
	УдаляемыеСобытия.Добавить(Перечисления.ИКТ_RequestТипыСобытий.KPI);
	
	МассивДопАналитик = ПолучитьМассивДопАналитикПоДокументу(Источник); 
	
	Для каждого ТипСобытия из МассивТиповСобытий Цикл 
		
		Если УдаляемыеСобытия.Найти(ТипСобытия) <> Неопределено Тогда
			Источник.ДополнительныеСвойства.ИКТ_ЭтоУдаление = Истина; 
		КонецЕсли;
	
		Для каждого ДопАналитика Из МассивДопАналитик Цикл
			
			РезультатСобытияОбмена = ПолучитьСобытияПоОбъектуИАналитике(Источник.Ссылка, ТипСобытия, ДопАналитика);
				
			СоздатьОбновитьСобытиеРеквестПриНеобходимости(РезультатСобытияОбмена, Источник, ТипСобытия, Организация, Источник.Дата, ДопАналитика);
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьМассивДопАналитикПоДокументу(Источник) 
	
	ДокументыСДопАналиткойСотрудник = Новый Массив;
	ДокументыСДопАналиткойСотрудник.Добавить(Тип("ДокументОбъект.ПриемНаРаботу"));
	ДокументыСДопАналиткойСотрудник.Добавить(Тип("ДокументОбъект.КадровыйПеревод"));
	ДокументыСДопАналиткойСотрудник.Добавить(Тип("ДокументОбъект.Увольнение"));
	ДокументыСДопАналиткойСотрудник.Добавить(Тип("ДокументОбъект.ИКТ_RequestРаботаНеПоГрафику"));
	
	ДокументыСДопАналиткойСотрудники = Новый Массив;
	ДокументыСДопАналиткойСотрудники.Добавить(Тип("ДокументОбъект.ПриемНаРаботуСписком"));
	ДокументыСДопАналиткойСотрудники.Добавить(Тип("ДокументОбъект.КадровыйПереводСписком"));
	ДокументыСДопАналиткойСотрудники.Добавить(Тип("ДокументОбъект.УвольнениеСписком"));   
	
	ДокументыСДопАналиткойПозицияШР = Новый Массив;
	ДокументыСДопАналиткойПозицияШР.Добавить(Тип("ДокументОбъект.УтверждениеШтатногоРасписания"));
	ДокументыСДопАналиткойПозицияШР.Добавить(Тип("ДокументОбъект.ИзменениеШтатногоРасписания"));
	
	ДокументыСДопАналиткойСостав = Новый Массив;
	
	ОбъектыБезДопАналитики = Новый Массив;
	Результат = Новый Массив;
	
	Если ДокументыСДопАналиткойСотрудник.Найти(ТипЗнч(Источник)) <> Неопределено Тогда
		Результат.Добавить(Источник.Сотрудник);
	ИначеЕсли ДокументыСДопАналиткойСотрудники.Найти(ТипЗнч(Источник)) <> Неопределено Тогда
		Результат = Источник.Сотрудники.ВыгрузитьКолонку("Сотрудник");
	ИначеЕсли ДокументыСДопАналиткойСостав.Найти(ТипЗнч(Источник)) <> Неопределено Тогда 
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЛC_ВводПланаKPI") Тогда 
			ТЗСостав = Источник.Состав.Выгрузить(); 
			ТЗСостав.Свернуть("Сотрудник");
			Результат = ТЗСостав.ВыгрузитьКолонку("Сотрудник");
		КонецЕсли;
	ИначеЕсли ДокументыСДопАналиткойПозицияШР.Найти(ТипЗнч(Источник)) <> Неопределено Тогда
		Результат = Источник.Позиции.ВыгрузитьКолонку("Позиция");  
	ИначеЕсли ОбъектыБезДопАналитики.Найти(ТипЗнч(Источник)) <> Неопределено Тогда
		Результат.Добавить(Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивСобытийДляОбъекта(ТипОбъекта) Экспорт
	
	Результат = Новый Массив;  
	
	ТаблицаСобытий = ПолучитьТаблицуСобытийОбъектов();    
	
    СтрокиСобытийДляТипа = ТаблицаСобытий.НайтиСтроки(Новый Структура("ТипОбъекта",ТипОбъекта));
	
	МассивВыгружаемыхСобытий = РегистрыСведений.ИКТ_УправлениеОбменомRequest.ПолучитьМассивВыгружаемыхСобытийПоТипуОбъекту(ТипОбъекта);
	
	Для каждого СтрокаСобытия из СтрокиСобытийДляТипа Цикл
		
		Если МассивВыгружаемыхСобытий.Найти(СтрокаСобытия.ТипСобытия) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(СтрокаСобытия.ТипСобытия);
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьТаблицуСобытийОбъектов() Экспорт
	
	ТаблицаСобытий = Новый ТаблицаЗначений;
	ТаблицаСобытий.Колонки.Добавить("ТипОбъекта");
	ТаблицаСобытий.Колонки.Добавить("ТипСобытия");
	
	//Сотрудники
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.ПриемНаРаботу"),Перечисления.ИКТ_RequestТипыСобытий.Сотрудники));
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.ПриемНаРаботуСписком"),Перечисления.ИКТ_RequestТипыСобытий.Сотрудники));
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.КадровыйПеревод"),Перечисления.ИКТ_RequestТипыСобытий.Сотрудники));
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.КадровыйПереводСписком"),Перечисления.ИКТ_RequestТипыСобытий.Сотрудники));
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.Увольнение"),Перечисления.ИКТ_RequestТипыСобытий.Сотрудники));
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.УвольнениеСписком"),Перечисления.ИКТ_RequestТипыСобытий.Сотрудники)); 
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("СправочникОбъект.Сотрудники"),Перечисления.ИКТ_RequestТипыСобытий.Сотрудники));  	
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("СправочникОбъект.ИКТ_Руководители"),Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей));
	
	//Штатное расписания
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("СправочникОбъект.ШтатноеРасписание"),Перечисления.ИКТ_RequestТипыСобытий.ШтатноеРасписание));
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.УтверждениеШтатногоРасписания"),Перечисления.ИКТ_RequestТипыСобытий.ШтатноеРасписание));
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.ИзменениеШтатногоРасписания"),Перечисления.ИКТ_RequestТипыСобытий.ШтатноеРасписание));
	
	//Должности
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("СправочникОбъект.ИКТ_ДолжностиС"),Перечисления.ИКТ_RequestТипыСобытий.Должности));
	
	//Работа не по графику
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("ДокументОбъект.ИКТ_RequestРаботаНеПоГрафику"),Перечисления.ИКТ_RequestТипыСобытий.РаботаНеПоГрафику));
		
	ЗаполнитьЗначенияСвойств(ТаблицаСобытий.Добавить(), Новый Структура("ТипОбъекта,ТипСобытия",Тип("СправочникОбъект.ИКТ_СобытияТехСбойСКУД"),Перечисления.ИКТ_RequestТипыСобытий.ТехСбойСКУД));
	
	Возврат ТаблицаСобытий;
	
КонецФункции

Функция ПолучитьСобытияПоОбъектуИАналитике(ОснованиеСобытия, ТипСобытия, ДопАналитика = Неопределено) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СобытияОбменаRequestПоОбъекту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИКТ_СобытияОбменаRequest КАК ИКТ_СобытияОбменаRequestПоОбъекту
		|ГДЕ
		|	ИКТ_СобытияОбменаRequestПоОбъекту.ОснованиеСобытия = &ОснованиеСобытия
		|	И ИКТ_СобытияОбменаRequestПоОбъекту.ТипСобытия = &ТипСобытия
		|	И ИКТ_СобытияОбменаRequestПоОбъекту.ПометкаУдаления = ЛОЖЬ
		|	И ИКТ_СобытияОбменаRequestПоОбъекту.ДопАналитика = &ДопАналитика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИКТ_СобытияОбменаRequest.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИКТ_СобытияОбменаRequest КАК ИКТ_СобытияОбменаRequest
		|ГДЕ
		|	ИКТ_СобытияОбменаRequest.ТипСобытия = &ТипСобытия
		|	И ИКТ_СобытияОбменаRequest.ПометкаУдаления = ЛОЖЬ
		|	И ИКТ_СобытияОбменаRequest.ДопАналитика = &ДопАналитика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИКТ_СобытияОбменаRequest.Ссылка
		|ИЗ
		|	Справочник.ИКТ_СобытияОбменаRequest КАК ИКТ_СобытияОбменаRequest
		|ГДЕ
		|	ИКТ_СобытияОбменаRequest.ТипСобытия = &ТипСобытия
		|	И ИКТ_СобытияОбменаRequest.ПометкаУдаления = ЛОЖЬ
		|	И ИКТ_СобытияОбменаRequest.ДопАналитика = &ОснованиеСобытия";
	
	Запрос.УстановитьПараметр("ОснованиеСобытия", ОснованиеСобытия);
	Запрос.УстановитьПараметр("ТипСобытия", ТипСобытия);
	Запрос.УстановитьПараметр("ДопАналитика", ДопАналитика);
	
	Если Не ЗначениеЗаполнено(Запрос.Параметры.ДопАналитика) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИКТ_СобытияОбменаRequestПоОбъекту.ДопАналитика = &ДопАналитика", "Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИКТ_СобытияОбменаRequest.ДопАналитика = &ДопАналитика", "Ложь");
	КонецЕсли;
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПоСобытию = ПакетыЗапроса[0].Выбрать();
	ВыборкаПоАналитике = ПакетыЗапроса[1].Выбрать();
	
	Результат = Новый Структура("СобытиеПоОбъекту,СобытиеПоАналитике", Справочники.ИКТ_СобытияОбменаRequest.ПустаяСсылка(), Справочники.ИКТ_СобытияОбменаRequest.ПустаяСсылка());
	
	Пока ВыборкаПоСобытию.Следующий() Цикл
		Результат.СобытиеПоОбъекту = ВыборкаПоСобытию.Ссылка;
	КонецЦикла;
	Пока ВыборкаПоАналитике.Следующий() Цикл
		Результат.СобытиеПоАналитике = ВыборкаПоАналитике.Ссылка; //не важно какая ссылка, важно наличие записи по доп. аналитике
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Процедура СоздатьОбновитьСобытиеРеквестПриНеобходимости(РезультатСобытияОбмена, ОснованиеСобытияОбъект, ТипСобытия, Организация, ДатаСобытия, ДопАналитика = Неопределено, ИмяСобытия = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	СтатусОбмена = Неопределено;    
	
	ТипыДопАналитик = Метаданные.Справочники.ИКТ_СобытияОбменаRequest.Реквизиты.ДопАналитика.Тип; 
	
	СобытиеСсылка = РезультатСобытияОбмена.СобытиеПоОбъекту;
	
	Если Не ЗначениеЗаполнено(РезультатСобытияОбмена.СобытиеПоОбъекту) Тогда  
		
		Если ТипыДопАналитик.СодержитТип(ТипЗнч(ОснованиеСобытияОбъект.Ссылка))
			И Не ЗначениеЗаполнено(РезультатСобытияОбмена.СобытиеПоАналитике) Тогда
			
			//Записывается тип, который создается при проведении документа. При этом изменяться или добавляться может и самостоятельно
			Возврат;
			
		КонецЕсли;
		
		СобытиеОбъект = Справочники.ИКТ_СобытияОбменаRequest.СоздатьЭлемент();
		СобытиеОбъект.ТипСобытия = ТипСобытия;
		СобытиеОбъект.ОснованиеСобытия = ОснованиеСобытияОбъект.Ссылка; 
		СобытиеОбъект.ДопАналитика = ДопАналитика;
		СобытиеОбъект.ДатаСобытия = ДатаСобытия;
		СобытиеОбъект.Записать(); 
		
		СобытиеСсылка = СобытиеОбъект.Ссылка;
		
		Если Не ЗначениеЗаполнено(РезультатСобытияОбмена.СобытиеПоАналитике) Тогда
			
			//нет события по объекту записи и по его аналитике. Идет добавление
			ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Добавление; 
			
		Иначе
			
			//Запись доп. аналитики уже была. Идет изменение
			ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Изменение;
			
		КонецЕсли;
		
	ИначеЕсли ОснованиеСобытияОбъект.ДополнительныеСвойства.ИКТ_ЭтоУдаление = Истина Тогда
		
		ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Удаление;       
		
	ИначеЕсли ОснованиеСобытияОбъект.ДополнительныеСвойства.ИКТ_Модифицированность Тогда
		
		ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Изменение;
		
	КонецЕсли; 
	
	Если ДействиеОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Если ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Изменение Тогда
		
		//При неправильном формировании данных могло не быть сообщения, а событие добавилось. Необходимо проверить дополнительно журнал
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИКТ_RequestЖурналОбменаСобытиями.Событие КАК Событие
			|ИЗ
			|	РегистрСведений.ИКТ_RequestЖурналОбменаСобытиями КАК ИКТ_RequestЖурналОбменаСобытиями
			|ГДЕ
			|	ИКТ_RequestЖурналОбменаСобытиями.Событие = &Событие";
		
		Запрос.УстановитьПараметр("Событие", СобытиеСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Если НЕ ТипЗнч(СобытиеСсылка.ОснованиеСобытия) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
				ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Добавление;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСообщения = ИКТ_RequestСерверСлужебный.ПодготовитьПараметрыСообщения();
	ПараметрыСообщения.ДействиеОбмена         = ДействиеОбмена;
	ПараметрыСообщения.ОснованиеСобытияОбъект = ОснованиеСобытияОбъект;
	ПараметрыСообщения.ДопАналитика           = ДопАналитика;
	ПараметрыСообщения.ИмяСобытия             = ИмяСобытия;
	ПараметрыСообщения.СобытиеСсылка          = СобытиеСсылка;
	
	СообщениеОбмена = ИКТ_RequestСерверСлужебный.ПодготовитьСообщениеОбменаПоОснованиюСобытия(ПараметрыСообщения, Отказ);

	Если Не ЗначениеЗаполнено(СообщениеОбмена) Тогда  
		
		Отказ = Истина;  
		
	КонецЕсли;
	
	Если Отказ = Ложь Тогда
		
		РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.ДобавитьЗаписьВЖурналОбмена(ТекущаяДатаСеанса(), СобытиеСсылка, ДействиеОбмена, СообщениеОбмена,,,,,ИмяСобытия);
		
	КонецЕсли; 
	
КонецПроцедуры  

Процедура ПроверитьВозможностьПроведенияУвольнения(Источник, Отказ)
	
	МассивСотрудников = Новый Массив;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Увольнение") Тогда
		
		МассивСотрудников.Добавить(Источник.Сотрудник);
		
	Иначе
		
		МассивСотрудников = Источник.Сотрудники.ВыгрузитьКолонку("Сотрудник");
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_УвольняемыеФизЛица
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&МассивСотрудников)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Представление(ВТ_УвольняемыеФизЛица.ФизическоеЛицо) КАК ФизическоеЛицо
		|ИЗ
		|	ВТ_УвольняемыеФизЛица КАК ВТ_УвольняемыеФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИКТ_RequestСобытияУвольнения КАК ИКТ_RequestСобытияУвольнения
		|		ПО ВТ_УвольняемыеФизЛица.ФизическоеЛицо = ИКТ_RequestСобытияУвольнения.ФизическоеЛицо
		|			И (ИКТ_RequestСобытияУвольнения.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	ИКТ_RequestСобытияУвольнения.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		//Отказ = Истина; //Временно
		
		ШаблонСообщения = НСтр("ru = 'Для сотрудника %1 не найден процесс увольнения в Request'");
	
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Выборка.ФизическоеЛицо));
		КонецЦикла;
	
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьСоостояниеОбменаСРеквестПоОбъекту(ОбъектСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.ИнформацияОбОшибке КАК ИнформацияОбОшибке,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Выгружен КАК Выгружен,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Ошибка КАК Ошибка,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Период КАК Период,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Действие КАК Действие
		|ПОМЕСТИТЬ ВТ_ЖурналСобытий
		|ИЗ
		|	РегистрСведений.ИКТ_RequestЖурналОбменаСобытиями.СрезПоследних(
		|			,
		|			Событие.ОснованиеСобытия = &ОбъектСсылка
		|				И Событие.ПометкаУдаления = ЛОЖЬ) КАК ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.ИнформацияОбОшибке,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Выгружен,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Ошибка,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Период,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Действие
		|ИЗ
		|	РегистрСведений.ИКТ_RequestЖурналОбменаСобытиями.СрезПоследних(
		|			,
		|			Событие.ДопАналитика = &ОбъектСсылка
		|				И Событие.ПометкаУдаления = ЛОЖЬ) КАК ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ЖурналСобытий.ИнформацияОбОшибке КАК ИнформацияОбОшибке,
		|	ВТ_ЖурналСобытий.Выгружен КАК Выгружен,
		|	ВТ_ЖурналСобытий.Ошибка КАК Ошибка,
		|	ВТ_ЖурналСобытий.Период КАК Период,
		|	ВТ_ЖурналСобытий.Действие КАК Действие
		|ИЗ
		|	ВТ_ЖурналСобытий КАК ВТ_ЖурналСобытий
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	
	Результат = Новый Структура("Период,Действие,Выгружен,Ошибка,ИнформацияОбОшибке",
		'00010101',
		Перечисления.ИКТ_ДействияОбмена.ПустаяСсылка(),
		Ложь,
		Ложь,
		"");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;;
	
	Возврат Результат;
	
КонецФункции

Процедура ИКТ_ДобавитьЭлементыСостоянияРеквестНаФорму(Форма, ЭлементДляСвязи = Неопределено, Родитель = Неопределено) Экспорт 
	
	Если Форма.Элементы.найти("ИКТ_СостояниеОбменаRequest") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИКТ_СостояниеОбменаRequest", Новый ОписаниеТипов("Строка"),,"Обмен с Request"));
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ЭлементДляСвязи = Неопределено И Родитель = Неопределено Тогда
		НовыйЭлемент = Форма.Элементы.Добавить("ИКТ_СостояниеОбменаRequest", Тип("ПолеФормы"), Форма);
	ИначеЕсли ЭлементДляСвязи = Неопределено И Родитель <> Неопределено Тогда
		НовыйЭлемент = Форма.Элементы.Добавить("ИКТ_СостояниеОбменаRequest", Тип("ПолеФормы"), Родитель);
	Иначе 
		НовыйЭлемент = Форма.Элементы.Вставить("ИКТ_СостояниеОбменаRequest", Тип("ПолеФормы"), ЭлементДляСвязи.Родитель, ЭлементДляСвязи);
	КонецЕсли;       
	
	НовыйЭлемент.ПутьКДанным = "ИКТ_СостояниеОбменаRequest";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Гиперссылка = Истина;
	
КонецПроцедуры

Функция ПолучитьМассивТиповБезКонтроляУОС()
	
	Результат = Новый Массив;
	//Результат.Добавить(Тип("ДокументОбъект.ВерсияСоглашенияКоммерческийДоговор"));
	
	Возврат Результат;
	
КонецФункции

Функция ОтправлятьСобытиеВРеквест(Источник) 
	
	Результат = Истина;
	
	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.ВерсияСоглашенияКоммерческийДоговор") Тогда
	//	
	//	Если Источник.ВидДоговораУХ <> ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.СПоставщиком") Тогда
	//		Результат = Ложь;
	//	ИначеЕсли Источник.ДополнительныеСвойства.Свойство("ИКТ_ОтправкаПоКоманде") = ЛОЖЬ Тогда
	//		Результат = Ложь;
	//	КонецЕсли; 
	//	
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#Область РегламентныеЗадания

Процедура ИКТ_RequestОбменДанными() Экспорт
	
	ПараметрыСоединения = Обработки.ИКТ_RequestПараметрыСоединения.ПолучитьПараметрыСоединенияСRequest();
	
	Если ПараметрыСоединения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие КАК Событие,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие.ТипСобытия КАК ТипСобытия,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие.ОснованиеСобытия КАК ОснованиеСобытия,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Действие КАК Действие,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.СообщениеОбмена КАК СообщениеОбмена,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.ИнформацияОбОшибке КАК ИнформацияОбОшибке,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.КоличествоПопыток КАК КоличествоПопыток,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Период КАК Период,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие.ДопАналитика КАК СобытиеДопАналитика,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.ИмяСобытия КАК ИмяСобытия
		|ПОМЕСТИТЬ ВТ_СобытияВОчереди
		|ИЗ
		|	РегистрСведений.ИКТ_RequestЖурналОбменаСобытиями.СрезПоследних КАК ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних
		|ГДЕ
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Выгружен = ЛОЖЬ
		|	И ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Ошибка = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие.ТипСобытия,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие.ОснованиеСобытия,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Действие,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.СообщениеОбмена,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.ИнформацияОбОшибке,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.КоличествоПопыток,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Период,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Событие.ДопАналитика,
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.ИмяСобытия
		|ИЗ
		|	РегистрСведений.ИКТ_RequestЖурналОбменаСобытиями.СрезПоследних КАК ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних
		|ГДЕ
		|	ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Выгружен = ЛОЖЬ
		|	И ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.Ошибка = ИСТИНА
		|	И ИКТ_RequestЖурналОбменаСобытиямиСрезПоследних.КоличествоПопыток < 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СобытияВОчереди.Событие КАК Событие,
		|	ВТ_СобытияВОчереди.ТипСобытия КАК ТипСобытия,
		|	ВТ_СобытияВОчереди.ОснованиеСобытия КАК ОснованиеСобытия,
		|	ВТ_СобытияВОчереди.Действие КАК Действие,
		|	ВТ_СобытияВОчереди.СообщениеОбмена КАК СообщениеОбмена,
		|	ВТ_СобытияВОчереди.ИнформацияОбОшибке КАК ИнформацияОбОшибке,
		|	ВТ_СобытияВОчереди.КоличествоПопыток КАК КоличествоПопыток,
		|	ВТ_СобытияВОчереди.СобытиеДопАналитика КАК ДопАналитика,
		|	ВТ_СобытияВОчереди.ИмяСобытия КАК ИмяСобытия
		|ИЗ
		|	ВТ_СобытияВОчереди КАК ВТ_СобытияВОчереди
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_СобытияВОчереди.Период";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТокенАвторизации = ПолучитьТокенАвторизации(ПараметрыСоединения, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСобытий = РезультатЗапроса.Выбрать();  
	
	Пока ВыборкаСобытий.Следующий() Цикл
		
		ВыполнитьОтправкуСобытия(ПараметрыСоединения, ТокенАвторизации, ВыборкаСобытий);
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура ИКТ_RequestОбновлениеСправочниковДляОбмена() Экспорт
	
	//Временный обмен (на время тестирования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДолжностиС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИКТ_ДолжностиС КАК ДолжностиС
	               |ГДЕ
	               |	ДолжностиС.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтравочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтравочникОбъект.Наименование = СокрЛП(Выборка.Ссылка.Наименование); 
		СтравочникОбъект.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШТ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ШтатноеРасписание КАК ШТ
	               |ГДЕ
	               |	ШТ.ПометкаУдаления = ЛОЖЬ
	               |	И ШТ.Владелец.ИКТ_УУ = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтравочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтравочникОбъект.Наименование = СокрЛП(Выборка.Ссылка.Наименование); 
		СтравочникОбъект.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Стр.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Стр
	               |ГДЕ
	               |	Стр.ПометкаУдаления = ЛОЖЬ
	               |	И Стр.ГоловнаяОрганизация.ИКТ_УУ = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтравочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтравочникОбъект.Наименование = СокрЛП(Выборка.Ссылка.Наименование); 
		СтравочникОбъект.Записать();
	КонецЦикла; 
		
КонецПроцедуры 

Процедура ИКТ_RequestФормированиеНезависимыхСообщенийОбмена() Экспорт
	
	Отказ = Ложь;
	
	//Руководители.
	
	ДействиеОбмена   = Перечисления.ИКТ_ДействияОбмена.Добавление;
	СобытиеСсылка    = Справочники.ИКТ_СобытияОбменаRequest.НайтиПоКоду("00000000001");
	ОснованиеСобытия = СобытиеСсылка;
	ИмяСобытия       = "ИКТ_Руководители";
	
	ПараметрыСообщения = ИКТ_RequestСерверСлужебный.ПодготовитьПараметрыСообщения();
	ПараметрыСообщения.ДействиеОбмена         = ДействиеОбмена;
	ПараметрыСообщения.ОснованиеСобытияОбъект = ОснованиеСобытия;
	ПараметрыСообщения.ИмяСобытия             = ИмяСобытия;
	ПараметрыСообщения.СобытиеСсылка          = СобытиеСсылка;
	
	СообщениеОбмена = ИКТ_RequestСерверСлужебный.ПодготовитьСообщениеОбменаПоОснованиюСобытия(ПараметрыСообщения, Отказ);
	
	Если Не ЗначениеЗаполнено(СообщениеОбмена) Тогда		
		Отказ = Истина;     	
	КонецЕсли;
	
	Если Отказ = Ложь Тогда 	
		РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.ДобавитьЗаписьВЖурналОбмена(ТекущаяДатаСеанса(), СобытиеСсылка, ДействиеОбмена, СообщениеОбмена,,,,,ИмяСобытия); 	
	КонецЕсли; 
	
	//Замещения.
	
	ДействиеОбмена   = Перечисления.ИКТ_ДействияОбмена.Добавление;
	СобытиеСсылка    = Справочники.ИКТ_СобытияОбменаRequest.НайтиПоКоду("00000000002"); 
	ОснованиеСобытия = СобытиеСсылка;
	ИмяСобытия       = "Замещения";
	
	ПараметрыСообщения = ИКТ_RequestСерверСлужебный.ПодготовитьПараметрыСообщения();
	ПараметрыСообщения.ДействиеОбмена         = ДействиеОбмена;
	ПараметрыСообщения.ОснованиеСобытияОбъект = ОснованиеСобытия;
	ПараметрыСообщения.ИмяСобытия             = ИмяСобытия;
	ПараметрыСообщения.СобытиеСсылка          = СобытиеСсылка;
	
	СообщениеОбмена = ИКТ_RequestСерверСлужебный.ПодготовитьСообщениеОбменаПоОснованиюСобытия(ПараметрыСообщения, Отказ);
	
	Если Не ЗначениеЗаполнено(СообщениеОбмена) Тогда		
		Отказ = Истина;     	
	КонецЕсли;
	
	Если Отказ = Ложь Тогда 	
		РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.ДобавитьЗаписьВЖурналОбмена(ТекущаяДатаСеанса(), СобытиеСсылка, ДействиеОбмена, СообщениеОбмена,,,,,ИмяСобытия); 	
	КонецЕсли;  
	
КонецПроцедуры    

Процедура ВыполнитьОтправкуСобытия(ПараметрыСоединения, ТокенАвторизации, ДанныеСобытия)
	
	Соединение = Новый HTTPСоединение(ПараметрыСоединения.АдресСервера);  
	
	ПараметрыСообщения                        = ИКТ_RequestСерверСлужебный.ПодготовитьПараметрыСообщения();
	ПараметрыСообщения.ДействиеОбмена         = ДанныеСобытия.Действие;
	ПараметрыСообщения.ОснованиеСобытияОбъект = ДанныеСобытия.ОснованиеСобытия;
	ПараметрыСообщения.ДопАналитика           = ДанныеСобытия.ДопАналитика;
	ПараметрыСообщения.ИмяСобытия             = ДанныеСобытия.ИмяСобытия;
	ПараметрыСообщения.СобытиеСсылка          = ДанныеСобытия.Событие;
	
	Отказ = Ложь;
	
	СообщениеОбмена = ИКТ_RequestСерверСлужебный.ПодготовитьСообщениеОбменаПоОснованиюСобытия(ПараметрыСообщения, Отказ);
	
	Если Отказ ИЛИ Не ЗначениеЗаполнено(СообщениеОбмена) Тогда 
		
		РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.ДобавитьЗаписьВЖурналОбмена(
			ТекущаяДатаСеанса(),
			ДанныеСобытия.Событие,
			ДанныеСобытия.Действие,
			СообщениеОбмена,
			"Не удалось сформировать сообщение обмена в базе 1С",
			ДанныеСобытия.КоличествоПопыток + 1,
			,
			Истина,
			ДанныеСобытия.ИмяСобытия); 
			
		Возврат; 
		
	КонецЕсли;
	
	Запрос = ПолучитьHTTPЗапросПоТипуСобытия(ДанныеСобытия.ТипСобытия, СообщениеОбмена, ТокенАвторизации); 
	
	Если Запрос = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		
		СообщениеОтвет = Ответ.ПолучитьТелоКакСтроку(); 
		ДанныеСообщения = ИКТ_RequestСерверСлужебный.ПрочитатьТекстJSON(, СообщениеОтвет);
		КлючСообщения = ДанныеСообщения.Получить("key");
			
		Если Не ЗначениеЗаполнено(КлючСообщения) И ДанныеСообщения.Получить("value") <> Неопределено Тогда
			
			ИнформацияОбОшибке = "Код состояния: " + Ответ.КодСостояния;
			ИнформацияОбОшибке = ИнформацияОбОшибке + символы.ПС + ДанныеСообщения.Получить("value");
			
			РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.ДобавитьЗаписьВЖурналОбмена(
				ТекущаяДатаСеанса(),
				ДанныеСобытия.Событие,
				ДанныеСобытия.Действие,
				СообщениеОбмена,
				ИнформацияОбОшибке,
				ДанныеСобытия.КоличествоПопыток + 1,
				,
				Истина,
				ДанныеСобытия.ИмяСобытия,
				СообщениеОтвет); 

		Иначе				
							
			РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.ДобавитьЗаписьВЖурналОбмена(
				ТекущаяДатаСеанса(),
				ДанныеСобытия.Событие,
				ДанныеСобытия.Действие,
				СообщениеОбмена,
				,
				ДанныеСобытия.КоличествоПопыток + 1,
				Истина,
				,
				ДанныеСобытия.ИмяСобытия,
				СообщениеОтвет); 
				
		КонецЕсли;			
			
	Иначе  
			
		ИнформацияОбОшибке = "Код состояния: " + Ответ.КодСостояния;
		ИнформацияОбОшибке = ИнформацияОбОшибке + символы.ПС + Ответ.ПолучитьТелоКакСтроку();
		
		РегистрыСведений.ИКТ_RequestЖурналОбменаСобытиями.ДобавитьЗаписьВЖурналОбмена(
			ТекущаяДатаСеанса(),
			ДанныеСобытия.Событие,
			ДанныеСобытия.Действие,
			СообщениеОбмена,
			ИнформацияОбОшибке,
			ДанныеСобытия.КоличествоПопыток + 1,
			,
			Истина,
			ДанныеСобытия.ИмяСобытия);
			
	КонецЕсли;
			
	
КонецПроцедуры

Функция ПолучитьHTTPЗапросПоТипуСобытия(ТипСобытия, ТелоЗапроса, ТокенАвторизации)
	
	Результат = Неопределено;
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Должности Тогда  
		
		Результат = Новый HTTPЗапрос("api/v1/Dictionary/Positions");
		Результат.Заголовки.Вставить("accept","text/plain");
		Результат.Заголовки.Вставить("Content-Type","application/json-patch+json"); 
		Результат.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации)); 
		
		Результат.УстановитьТелоИзСтроки(ТелоЗапроса);
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ШтатноеРасписание Тогда 
		
		Результат = Новый HTTPЗапрос("api/v1/Dictionary/StaffStructure");
		Результат.Заголовки.Вставить("accept","text/plain");
		Результат.Заголовки.Вставить("Content-Type","application/json-patch+json"); 
		Результат.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации)); 
		
		Результат.УстановитьТелоИзСтроки(ТелоЗапроса);
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Сотрудники Тогда
		
		Результат = Новый HTTPЗапрос("api/v1/Dictionary/Users");
		Результат.Заголовки.Вставить("accept","text/plain");
		Результат.Заголовки.Вставить("Content-Type","application/json-patch+json"); 
		Результат.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации)); 
		
		Результат.УстановитьТелоИзСтроки(ТелоЗапроса);
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда
		
		Результат = Новый HTTPЗапрос("api/v1/Dictionary/PositionsRel");
		Результат.Заголовки.Вставить("accept","text/plain");
		Результат.Заголовки.Вставить("Content-Type","application/json-patch+json"); 
		Результат.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации)); 
		
		Результат.УстановитьТелоИзСтроки(ТелоЗапроса);  
			
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Замещения Тогда
		
		Результат = Новый HTTPЗапрос("api/v1/Dictionary/Deputies");
		Результат.Заголовки.Вставить("accept","text/plain");
		Результат.Заголовки.Вставить("Content-Type","application/json-patch+json"); 
		Результат.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации)); 
		
		Результат.УстановитьТелоИзСтроки(ТелоЗапроса);
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.СозданиеИзменениеДоговора Тогда
		
		Результат = Новый HTTPЗапрос("api/v1/Process/EventWithFilesAsync");
		Результат.Заголовки.Вставить("accept","text/plain");
		Результат.Заголовки.Вставить("Content-Type","application/json-patch+json"); 
		Результат.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации)); 
		
		Результат.УстановитьТелоИзСтроки(ТелоЗапроса);
		
	Иначе
		
		//Событие формата Event
		
		Результат = Новый HTTPЗапрос("api/v1/Process/Event");
		Результат.Заголовки.Вставить("accept","text/plain");
		Результат.Заголовки.Вставить("Content-Type","application/json-patch+json"); 
		Результат.Заголовки.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации)); 
		
		Результат.УстановитьТелоИзСтроки(ТелоЗапроса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТокенАвторизации(ПараметрыСоединения, Отказ)
	
	Результат = "";
	
	Соединение = Новый HTTPСоединение(ПараметрыСоединения.АдресСервера);
	
	АдресЗапроса = СтрШаблон("api/v1/Users/Authenticate?username=%1&password=%2", ПараметрыСоединения.Логин, ПараметрыСоединения.Пароль);
	
	Запрос = Новый HTTPЗапрос(АдресЗапроса);
	Запрос.Заголовки.Вставить("accept", "text/plain");
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		
	Если Ответ.КодСостояния = 200 Тогда
		
		ДанныеАвторизаци = ИКТ_RequestСерверСлужебный.ПрочитатьТекстJSON(,Ответ.ПолучитьТелоКакСтроку());
		
		Результат = ДанныеАвторизаци["token"];
		
	Иначе
		
		Отказ = Истина;
		ЗаписьЖурналаРегистрации("ОбменДаннымиRequest", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка авторизации. Код состовния: " + Ответ.КодСостояния);
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти  

Функция ЭтоТипСобытияСОжиданиемРешения(ТипСобытия) 
	
	МассивТиповСобытийСОжиданиемРешения = Новый Массив;
	МассивТиповСобытийСОжиданиемРешения.Добавить(Перечисления.ИКТ_RequestТипыСобытий.СозданиеИзменениеДоговора);
	МассивТиповСобытийСОжиданиемРешения.Добавить(Перечисления.ИКТ_RequestТипыСобытий.РаботаНеПоГрафику);
	
	Возврат МассивТиповСобытийСОжиданиемРешения.Найти(ТипСобытия) <> Неопределено
	
КонецФункции

Функция СобытиеПоОрганизацииУОС(Источник, Организация)
	
	Результат = Истина;
	
	Организация = Неопределено;
	
	Если Источник.Метаданные().Реквизиты.Найти("Организация") <> Неопределено Тогда
		
		Если Не ИКТ_ЗП_УОС.ЭтоУОС(Источник.Организация) Тогда
			Результат = Ложь;
		КонецЕсли; 
		
		Организация = Источник.Организация;
		
	ИначеЕсли Источник.Метаданные().Реквизиты.Найти("ГоловнаяОрганизация") <> Неопределено Тогда
		
		Если Не ИКТ_ЗП_УОС.ЭтоУОС(Источник.ГоловнаяОрганизация) Тогда
			Результат = Ложь;
		КонецЕсли; 
		
		Организация = Источник.ГоловнаяОрганизация;
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Процедура ИКТ_RequestОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Увольнение") 
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.УвольнениеСписком") Тогда 
		
		Если ИКТ_ЗП_УОС.ЭтоУОС(Источник.Организация) Тогда

			ПроверитьВозможностьПроведенияУвольнения(Источник, Отказ);
			
		КонецЕсли
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ИКТ_RequestПроверкаВремениРаботыСотрудников() Экспорт
	
	ДатаОкончания = НачалоДня(ТекущаяДатаСеанса()) - 1;
	ДатаНачала = НачалоДня(ДатаОкончания - 3600 * 24 * 6);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Сотрудник", Неопределено);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИКТ_СоответствиеОбъектов.ОбъектУУ КАК ОбъектУУ
	               |ПОМЕСТИТЬ ВТ_ОрганизацииУОС
	               |ИЗ
	               |	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
	               |ГДЕ
	               |	ИКТ_СоответствиеОбъектов.ОбъектБУ ССЫЛКА Справочник.Организации
	               |	И ИКТ_СоответствиеОбъектов.ОбъектУУ ССЫЛКА Справочник.Организации
	               |	И ИКТ_СоответствиеОбъектов.ОбъектУУ <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СостоянияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	               |	МАКСИМУМ(СостоянияСотрудниковСрезПоследних.Период) КАК Период
	               |ПОМЕСТИТЬ ВТ_ДатаПоследнегоСостояния
	               |ИЗ
	               |	РегистрСведений.СостоянияСотрудников.СрезПоследних(
	               |			&ДатаОкончания,
	               |			Сотрудник.ГоловнаяОрганизация В
	               |					(ВЫБРАТЬ
	               |						ВТ_ОрганизацииУОС.ОбъектУУ
	               |					ИЗ
	               |						ВТ_ОрганизацииУОС)
	               |				И Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Работа), ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Увольнение))) КАК СостоянияСотрудниковСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СостоянияСотрудниковСрезПоследних.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СостоянияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	               |	&ДатаНачала КАК ДатаНачала,
	               |	&ДатаОкончания КАК ДатаОкончания 
	               |ПОМЕСТИТЬ ВТСотрудники
	               |ИЗ
	               |	РегистрСведений.СостоянияСотрудников.СрезПоследних(
	               |			&ДатаОкончания,
	               |			Сотрудник.ГоловнаяОрганизация В
	               |					(ВЫБРАТЬ
	               |						ВТ_ОрганизацииУОС.ОбъектУУ
	               |					ИЗ
	               |						ВТ_ОрганизацииУОС)
	               |				И Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Работа), ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Увольнение))) КАК СостоянияСотрудниковСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДатаПоследнегоСостояния КАК ВТ_ДатаПоследнегоСостояния
	               |		ПО (ВТ_ДатаПоследнегоСостояния.Период = СостоянияСотрудниковСрезПоследних.Период)
	               |			И (ВТ_ДатаПоследнегоСостояния.Сотрудник = СостоянияСотрудниковСрезПоследних.Сотрудник)
	               |ГДЕ
	               |	СостоянияСотрудниковСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Работа)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СостоянияСотрудниковСрезПоследних.Сотрудник";
	
	Запрос.Выполнить();
	
	ПараметрыЗаполнения = УчетРабочегоВремениРасширенный.ПараметрыДляЗапросВТДанныеУчетаВремениИСостоянийСотрудников();
	ПараметрыЗаполнения.ИмяВТСотрудники = "ВТСотрудники";
	ПараметрыЗаполнения.ИмяВТРезультат = "ВТДанныеУчетаВремени";
	ПараметрыЗаполнения.РассчитыватьПлановоеВремя = Ложь;
	ПараметрыЗаполнения.ДатаАктуальности  = ДатаОкончания;
	ПараметрыЗаполнения.ДатаНачала = ДатаНачала;
	ПараметрыЗаполнения.ДатаОкончания = ДатаОкончания;
	ПараметрыЗаполнения.МесяцДатаНачала = НачалоМесяца(ПараметрыЗаполнения.ДатаНачала);
	ПараметрыЗаполнения.МесяцДатаОкончания = КонецМесяца(ПараметрыЗаполнения.ДатаОкончания);
	ПараметрыЗаполнения.ВыделятьВыходныеВПериодыОтклонений = Ложь;
	ПараметрыЗаполнения.ПолучатьУсловияТрудаИТерритории = Истина;
	УчетРабочегоВремениРасширенный.СоздатьВТДанныеУчетаВремениИСостоянийСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыЗаполнения);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТДанныеУчетаВремениПоСостояниям.ВидУчетаВремени КАК ВидУчетаВремени,
	|	ВТДанныеУчетаВремениПоСостояниям.Дата КАК Дата,
	|	ВТДанныеУчетаВремениПоСостояниям.Дни КАК Дни,
	|	ВТДанныеУчетаВремениПоСостояниям.НормаЧасов КАК НормаЧасов,
	|	ВТДанныеУчетаВремениПоСостояниям.Отклонение КАК Отклонение,
	|	ВТДанныеУчетаВремениПоСостояниям.ПереходящаяЧастьПредыдущейСмены КАК ПереходящаяЧастьПредыдущейСмены,
	|	ВТДанныеУчетаВремениПоСостояниям.ПереходящаяЧастьТекущейСмены КАК ПереходящаяЧастьТекущейСмены,
	|	ВТДанныеУчетаВремениПоСостояниям.Смена КАК Смена,
	|	ВЫРАЗИТЬ(ВТДанныеУчетаВремениПоСостояниям.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
	|	ВТДанныеУчетаВремениПоСостояниям.Территория КАК Территория,
	|	ВТДанныеУчетаВремениПоСостояниям.УсловияТруда КАК УсловияТруда,
	|	ВТДанныеУчетаВремениПоСостояниям.Часы КАК Часы
	|ПОМЕСТИТЬ ВТ_ДниРаботыСотрудникаБезГруппировки
	|ИЗ
	|	ВТДанныеУчетаВремениПоСостояниям КАК ВТДанныеУчетаВремениПоСостояниям
	|ГДЕ
	|	ВТДанныеУчетаВремениПоСостояниям.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДниРаботыСотрудникаБезГруппировки.Дата КАК Дата,
	|	ВЫРАЗИТЬ(ВТ_ДниРаботыСотрудникаБезГруппировки.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ДниРаботыСотрудника
	|ИЗ
	|	ВТ_ДниРаботыСотрудникаБезГруппировки КАК ВТ_ДниРаботыСотрудникаБезГруппировки
	|ГДЕ
	|	ВТ_ДниРаботыСотрудникаБезГруппировки.ВидУчетаВремени В(&ВидУчетаВремениРаботаВОфисе)
	|	И ВТ_ДниРаботыСотрудникаБезГруппировки.Сотрудник.ИКТ_НеСоздаватьИнцидентыКРВ = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ВТ_ДниРаботыСотрудникаБезГруппировки.Сотрудник КАК Справочник.Сотрудники),
	|	ВТ_ДниРаботыСотрудникаБезГруппировки.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДниРаботыСотрудникаБезГруппировки.Дата КАК Дата,
	|	ВЫРАЗИТЬ(ВТ_ДниРаботыСотрудникаБезГруппировки.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ДниОтсутсвияСотрудника
	|ИЗ
	|	ВТ_ДниРаботыСотрудникаБезГруппировки КАК ВТ_ДниРаботыСотрудникаБезГруппировки
	|ГДЕ
	|	НЕ ВТ_ДниРаботыСотрудникаБезГруппировки.ВидУчетаВремени В (&ВидУчетаВремениРаботаВОфисе)
	|	И ВТ_ДниРаботыСотрудникаБезГруппировки.Сотрудник.ИКТ_НеСоздаватьИнцидентыКРВ = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ВТ_ДниРаботыСотрудникаБезГруппировки.Сотрудник КАК Справочник.Сотрудники),
	|	ВТ_ДниРаботыСотрудникаБезГруппировки.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИТК_ВводДанныхСКУДВходыВыходы.Ссылка.Организация КАК Организация,
	|	ИТК_ВводДанныхСКУДВходыВыходы.Сотрудник КАК Сотрудник,
	|	ИТК_ВводДанныхСКУДВходыВыходы.Дата КАК Дата,
	|	ИТК_ВводДанныхСКУДВходыВыходы.ПервыйВход КАК ПервыйВход,
	|	ИТК_ВводДанныхСКУДВходыВыходы.ПоследнийВыход КАК ПоследнийВыход,
	|	КОНЕЦПЕРИОДА(ИТК_ВводДанныхСКУДВходыВыходы.Дата, ДЕНЬ) КАК КонецДня,
	|	ИТК_ВводДанныхСКУДВходыВыходы.ОтработаноЧасов + ИТК_ВводДанныхСКУДВходыВыходы.ЧасыВнеОфиса КАК ОтработаноЧасов,
	|	ИТК_ВводДанныхСКУДВходыВыходы.ЧасыВнеОфиса КАК ЧасыВнеОфиса,
	|	ИТК_ВводДанныхСКУДВходыВыходы.ОтработаноВремени КАК ОтработаноВремени
	|ПОМЕСТИТЬ ВТ_ДанныеСКУД
	|ИЗ
	|	Документ.ИТК_ВводДанныхСКУД.ВходыВыходы КАК ИТК_ВводДанныхСКУДВходыВыходы
	|ГДЕ
	|	ИТК_ВводДанныхСКУДВходыВыходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ИТК_ВводДанныхСКУДВходыВыходы.Ссылка.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ГрафикРаботыСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ГрафикРаботыСотрудников.Период КАК Период,
	|	ГрафикРаботыСотрудников.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ГрафикиРаботы
	|ИЗ
	|	РегистрСведений.ГрафикРаботыСотрудников КАК ГрафикРаботыСотрудников
	|ГДЕ
	|	(ГрафикРаботыСотрудников.Сотрудник, ГрафикРаботыСотрудников.ГоловнаяОрганизация) В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеСКУД.Сотрудник,
	|				ВТ_ДанныеСКУД.Организация
	|			ИЗ
	|				ВТ_ДанныеСКУД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСКУД.Организация КАК Организация,
	|	ВТ_ДанныеСКУД.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеСКУД.Дата КАК Дата,
	|	ВТ_ДанныеСКУД.ПервыйВход КАК ПервыйВход,
	|	ВТ_ДанныеСКУД.ПоследнийВыход КАК ПоследнийВыход,
	|	ВТ_ДанныеСКУД.КонецДня КАК КонецДня,
	|	МАКСИМУМ(ВТ_ГрафикиРаботы.Период) КАК Период,
	|	ВТ_ДанныеСКУД.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВТ_ДанныеСКУД.ЧасыВнеОфиса КАК ЧасыВнеОфиса,
	|	ВТ_ДанныеСКУД.ОтработаноВремени КАК ОтработаноВремени
	|ПОМЕСТИТЬ ВТ_ДанныеСКУД_ДатаГрафика
	|ИЗ
	|	ВТ_ДанныеСКУД КАК ВТ_ДанныеСКУД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботы КАК ВТ_ГрафикиРаботы
	|		ПО (ВТ_ГрафикиРаботы.Сотрудник = ВТ_ДанныеСКУД.Сотрудник)
	|			И (ВТ_ГрафикиРаботы.ГоловнаяОрганизация = ВТ_ДанныеСКУД.Организация)
	|			И (ВТ_ГрафикиРаботы.Период < ВТ_ДанныеСКУД.КонецДня)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеСКУД.Организация,
	|	ВТ_ДанныеСКУД.Сотрудник,
	|	ВТ_ДанныеСКУД.Дата,
	|	ВТ_ДанныеСКУД.ПервыйВход,
	|	ВТ_ДанныеСКУД.ПоследнийВыход,
	|	ВТ_ДанныеСКУД.КонецДня,
	|	ВТ_ДанныеСКУД.ОтработаноЧасов,
	|	ВТ_ДанныеСКУД.ЧасыВнеОфиса,
	|	ВТ_ДанныеСКУД.ОтработаноВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСКУД_ДатаГрафика.Организация КАК Организация,
	|	ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеСКУД_ДатаГрафика.Дата КАК Дата,
	|	ВТ_ДанныеСКУД_ДатаГрафика.ПервыйВход КАК ПервыйВход,
	|	ВТ_ДанныеСКУД_ДатаГрафика.ПоследнийВыход КАК ПоследнийВыход,
	|	ВТ_ДанныеСКУД_ДатаГрафика.КонецДня КАК КонецДня,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ВремяНачалаРаботы = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ИКТ_ВремяНачалаРаботы
	|		ИНАЧЕ ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ВремяНачалаРаботы
	|	КОНЕЦ КАК ИКТ_ВремяНачалаРаботы,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ВремяОкончанияРаботы = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ИКТ_ВремяОкончанияРаботы
	|		ИНАЧЕ ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ВремяОкончанияРаботы
	|	КОНЕЦ КАК ИКТ_ВремяОкончанияРаботы,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ОбщаяДлительностьПерерывов = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ИКТ_ОбщаяДлительностьПерерывов
	|		ИНАЧЕ ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ОбщаяДлительностьПерерывов
	|	КОНЕЦ КАК ИКТ_ОбщаяДлительностьПерерывов,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ДопустимоеОтклонение = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ИКТ_ДопустимоеОтклонение
	|		ИНАЧЕ ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник.ИКТ_ДопустимоеОтклонение
	|	КОНЕЦ КАК ИКТ_ДопустимоеОтклонение,
	|	ВТ_ДанныеСКУД_ДатаГрафика.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВТ_ДанныеСКУД_ДатаГрафика.ЧасыВнеОфиса КАК ЧасыВнеОфиса,
	|	ВТ_ГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ДанныеСКУД_ДатаГрафика.ОтработаноВремени КАК ОтработаноВремени
	|ПОМЕСТИТЬ ВТ_ДанныеСКУД_ДанныеГрафика
	|ИЗ
	|	ВТ_ДанныеСКУД_ДатаГрафика КАК ВТ_ДанныеСКУД_ДатаГрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГрафикиРаботы КАК ВТ_ГрафикиРаботы
	|		ПО (ВТ_ГрафикиРаботы.Сотрудник = ВТ_ДанныеСКУД_ДатаГрафика.Сотрудник)
	|			И (ВТ_ГрафикиРаботы.ГоловнаяОрганизация = ВТ_ДанныеСКУД_ДатаГрафика.Организация)
	|			И (ВТ_ГрафикиРаботы.Период = ВТ_ДанныеСКУД_ДатаГрафика.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Организация КАК Организация,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Дата КАК ДатаИнцидента,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПервыйВход КАК ПервыйВход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПоследнийВыход КАК ПоследнийВыход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ГрафикРаботы КАК ГрафикРаботы,
	|	ЗНАЧЕНИЕ(Перечисление.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Опоздание) КАК ВидИнцидента,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноВремени КАК ОтработаноВремени
	|ПОМЕСТИТЬ ВТ_ДанныеИнцидентов
	|ИЗ
	|	ВТ_ДанныеСКУД_ДанныеГрафика КАК ВТ_ДанныеСКУД_ДанныеГрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДниРаботыСотрудника КАК ВТ_ДниРаботыСотрудника
	|		ПО ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник = ВТ_ДниРаботыСотрудника.Сотрудник
	|			И ВТ_ДанныеСКУД_ДанныеГрафика.Дата = ВТ_ДниРаботыСотрудника.Дата
	|ГДЕ
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ДанныеСКУД_ДанныеГрафика.ПервыйВход, ДЕНЬ), ВТ_ДанныеСКУД_ДанныеГрафика.ПервыйВход, СЕКУНДА) > РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТ_ДанныеСКУД_ДанныеГрафика.ИКТ_ВремяНачалаРаботы, СЕКУНДА) + РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТ_ДанныеСКУД_ДанныеГрафика.ИКТ_ДопустимоеОтклонение, СЕКУНДА)
	|	И ВТ_ДанныеСКУД_ДанныеГрафика.ЧасыВнеОфиса = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Организация,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Дата,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПервыйВход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПоследнийВыход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноЧасов,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ГрафикРаботы,
	|	ЗНАЧЕНИЕ(Перечисление.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.УходРаньше),
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноВремени
	|ИЗ
	|	ВТ_ДанныеСКУД_ДанныеГрафика КАК ВТ_ДанныеСКУД_ДанныеГрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДниРаботыСотрудника КАК ВТ_ДниРаботыСотрудника
	|		ПО ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник = ВТ_ДниРаботыСотрудника.Сотрудник
	|			И ВТ_ДанныеСКУД_ДанныеГрафика.Дата = ВТ_ДниРаботыСотрудника.Дата
	|ГДЕ
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ДанныеСКУД_ДанныеГрафика.ПоследнийВыход, ДЕНЬ), ВТ_ДанныеСКУД_ДанныеГрафика.ПоследнийВыход, СЕКУНДА) < РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТ_ДанныеСКУД_ДанныеГрафика.ИКТ_ВремяОкончанияРаботы, СЕКУНДА) - РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТ_ДанныеСКУД_ДанныеГрафика.ИКТ_ДопустимоеОтклонение, СЕКУНДА)
	|	И ВТ_ДанныеСКУД_ДанныеГрафика.ЧасыВнеОфиса = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Организация,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Дата,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПервыйВход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПоследнийВыход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноЧасов,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ГрафикРаботы,
	|	ЗНАЧЕНИЕ(Перечисление.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Недоработка),
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноВремени
	|ИЗ
	|	ВТ_ДанныеСКУД_ДанныеГрафика КАК ВТ_ДанныеСКУД_ДанныеГрафика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДниРаботыСотрудника КАК ВТ_ДниРаботыСотрудника
	|		ПО ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник = ВТ_ДниРаботыСотрудника.Сотрудник
	|			И ВТ_ДанныеСКУД_ДанныеГрафика.Дата = ВТ_ДниРаботыСотрудника.Дата
	|ГДЕ
	|	РАЗНОСТЬДАТ(ВТ_ДанныеСКУД_ДанныеГрафика.ИКТ_ВремяНачалаРаботы, ВТ_ДанныеСКУД_ДанныеГрафика.ИКТ_ВремяОкончанияРаботы, СЕКУНДА) / 3600 > ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноЧасов + РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ВТ_ДанныеСКУД_ДанныеГрафика.ИКТ_ОбщаяДлительностьПерерывов, СЕКУНДА) / 3600
	|	И ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДниРаботыСотрудника.Сотрудник.ГоловнаяОрганизация,
	|	ВТ_ДниРаботыСотрудника.Сотрудник,
	|	ВТ_ДниРаботыСотрудника.Дата,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Перечисление.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Отсутствие),
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	ВТ_ДниРаботыСотрудника КАК ВТ_ДниРаботыСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеСКУД_ДанныеГрафика КАК ВТ_ДанныеСКУД_ДанныеГрафика
	|		ПО ВТ_ДниРаботыСотрудника.Дата = ВТ_ДанныеСКУД_ДанныеГрафика.Дата
	|			И ВТ_ДниРаботыСотрудника.Сотрудник = ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник
	|ГДЕ
	|	ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДниОтсутсвияСотрудника.Сотрудник.ГоловнаяОрганизация,
	|	ВТ_ДниОтсутсвияСотрудника.Сотрудник,
	|	ВТ_ДниОтсутсвияСотрудника.Дата,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПервыйВход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ПоследнийВыход,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноЧасов,
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ГрафикРаботы,
	|	ЗНАЧЕНИЕ(Перечисление.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.ПриходСОтсутствием),
	|	ВТ_ДанныеСКУД_ДанныеГрафика.ОтработаноВремени
	|ИЗ
	|	ВТ_ДниОтсутсвияСотрудника КАК ВТ_ДниОтсутсвияСотрудника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеСКУД_ДанныеГрафика КАК ВТ_ДанныеСКУД_ДанныеГрафика
	|		ПО ВТ_ДниОтсутсвияСотрудника.Дата = ВТ_ДанныеСКУД_ДанныеГрафика.Дата
	|			И ВТ_ДниОтсутсвияСотрудника.Сотрудник = ВТ_ДанныеСКУД_ДанныеГрафика.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоСотрудниковСВыходомПоГрафику.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	КоличествоСотрудниковСВыходомПоГрафику.Дата КАК Дата
	|ПОМЕСТИТЬ ВТ_ПроверкаТехСбояСКУД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ДниРаботыСотрудника.Дата КАК Дата,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДниРаботыСотрудника.Сотрудник) КАК КоличествоСотрудников,
	|		ВТ_ДниРаботыСотрудника.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|	ИЗ
	|		ВТ_ДниРаботыСотрудника КАК ВТ_ДниРаботыСотрудника
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ДниРаботыСотрудника.Дата,
	|		ВТ_ДниРаботыСотрудника.Сотрудник.ГоловнаяОрганизация) КАК КоличествоСотрудниковСВыходомПоГрафику
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ДанныеИнцидентов.Организация КАК Организация,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДанныеИнцидентов.Сотрудник) КАК КоличествоСотрудников,
	|			ВТ_ДанныеИнцидентов.ДатаИнцидента КАК ДатаИнцидента
	|		ИЗ
	|			ВТ_ДанныеИнцидентов КАК ВТ_ДанныеИнцидентов
	|		ГДЕ
	|			ВТ_ДанныеИнцидентов.ВидИнцидента В (ЗНАЧЕНИЕ(Перечисление.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Опоздание), ЗНАЧЕНИЕ(Перечисление.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Отсутствие))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ДанныеИнцидентов.ДатаИнцидента,
	|			ВТ_ДанныеИнцидентов.Организация) КАК ВЗ_КоличествоСотрудниковСИнцидентами
	|		ПО (НАЧАЛОПЕРИОДА(КоличествоСотрудниковСВыходомПоГрафику.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВЗ_КоличествоСотрудниковСИнцидентами.ДатаИнцидента, ДЕНЬ))
	|			И КоличествоСотрудниковСВыходомПоГрафику.ГоловнаяОрганизация = ВЗ_КоличествоСотрудниковСИнцидентами.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИКТ_СобытияТехСбойСКУД КАК ИКТ_СобытияТехСбойСКУД
	|		ПО КоличествоСотрудниковСВыходомПоГрафику.Дата = ИКТ_СобытияТехСбойСКУД.ДатаСобытия
	|			И КоличествоСотрудниковСВыходомПоГрафику.ГоловнаяОрганизация = ИКТ_СобытияТехСбойСКУД.Организация
	|			И (ИКТ_СобытияТехСбойСКУД.ПодтвержденоДБ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА КоличествоСотрудниковСВыходомПоГрафику.КоличествоСотрудников = 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ВЗ_КоличествоСотрудниковСИнцидентами.КоличествоСотрудников, 0) / КоличествоСотрудниковСВыходомПоГрафику.КоличествоСотрудников
	|		КОНЕЦ * 100 >= &ПроцентИцидентов
	|
	|СГРУППИРОВАТЬ ПО
	|	КоличествоСотрудниковСВыходомПоГрафику.ГоловнаяОрганизация,
	|	КоличествоСотрудниковСВыходомПоГрафику.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеИнцидентов.Организация КАК Организация,
	|	ВТ_ДанныеИнцидентов.Сотрудник КАК Сотрудник,
	|	&ТекущаяДатаСеанса КАК Дата,
	|	ВТ_ДанныеИнцидентов.ДатаИнцидента КАК ДатаИнцидента,
	|	ВТ_ДанныеИнцидентов.ПервыйВход КАК ПервыйВход,
	|	ВТ_ДанныеИнцидентов.ПоследнийВыход КАК ПоследнийВыход,
	|	ВТ_ДанныеИнцидентов.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВТ_ДанныеИнцидентов.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ_ДанныеИнцидентов.ВидИнцидента КАК ВидИнцидента,
	|	ВТ_ДанныеИнцидентов.ОтработаноВремени КАК ОтработаноВремени
	|ИЗ
	|	ВТ_ДанныеИнцидентов КАК ВТ_ДанныеИнцидентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИКТ_RequestРаботаНеПоГрафику КАК ИКТ_RequestРаботаНеПоГрафику
	|		ПО ВТ_ДанныеИнцидентов.Организация = ИКТ_RequestРаботаНеПоГрафику.Организация
	|			И ВТ_ДанныеИнцидентов.Сотрудник = ИКТ_RequestРаботаНеПоГрафику.Сотрудник
	|			И ВТ_ДанныеИнцидентов.ДатаИнцидента = ИКТ_RequestРаботаНеПоГрафику.ДатаИнцидента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроверкаТехСбояСКУД КАК ВТ_ПроверкаТехСбояСКУД
	|		ПО ВТ_ДанныеИнцидентов.ДатаИнцидента = ВТ_ПроверкаТехСбояСКУД.Дата
	|			И ВТ_ДанныеИнцидентов.Организация = ВТ_ПроверкаТехСбояСКУД.ГоловнаяОрганизация
	|ГДЕ
	|	ИКТ_RequestРаботаНеПоГрафику.Ссылка ЕСТЬ NULL
	|	И ВТ_ПроверкаТехСбояСКУД.ГоловнаяОрганизация ЕСТЬ NULL
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(ПервыйВход),
	|	МАКСИМУМ(ПоследнийВыход),
	|	МАКСИМУМ(ОтработаноЧасов),
	|	МАКСИМУМ(ГрафикРаботы),
	|	МАКСИМУМ(ОтработаноВремени)
	|ПО
	|	Организация,
	|	Сотрудник,
	|	ДатаИнцидента"; 
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПроцентИцидентов", Константы.ИКТ_ПроцентИнцидентовТехСбойСКУД.Получить());
	
	Запрос.УстановитьПараметр("ИКТ_ВремяНачалаРаботы", Константы.ИКТ_ВремяНачалаРаботы.Получить());
	Запрос.УстановитьПараметр("ИКТ_ВремяОкончанияРаботы", Константы.ИКТ_ВремяОкончанияРаботы.Получить());
	Запрос.УстановитьПараметр("ИКТ_ОбщаяДлительностьПерерывов", Константы.ИКТ_ОбщаяДлительностьПерерывов.Получить());
	Запрос.УстановитьПараметр("ИКТ_ДопустимоеОтклонение", Константы.ИКТ_ДопустимоеОтклонение.Получить());
	
	ВидУчетаВремениРаботаВОфисе = Новый Массив;
	ВидУчетаВремениРаботаВОфисе.Добавить(Справочники.ВидыИспользованияРабочегоВремени.Явка);
	ВидУчетаВремениРаботаВОфисе.Добавить(Справочники.ВидыИспользованияРабочегоВремени.РабочееВремя);
	ВидУчетаВремениРаботаВОфисе.Добавить(Справочники.ВидыИспользованияРабочегоВремени.РаботаВРежимеНеполногоВремени);
	ВидУчетаВремениРаботаВОфисе.Добавить(Справочники.ВидыИспользованияРабочегоВремени.РаботаВечерниеЧасы);
	ВидУчетаВремениРаботаВОфисе.Добавить(Справочники.ВидыИспользованияРабочегоВремени.РаботаНочныеЧасы);
	
	Запрос.УстановитьПараметр("ВидУчетаВремениРаботаВОфисе", ВидУчетаВремениРаботаВОфисе);
	 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаСотрудник = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСотрудник.Следующий() Цикл
			
			ВыборкаДата = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДата.Следующий() Цикл
				
				ДокИнцидента = Документы.ИКТ_RequestРаботаНеПоГрафику.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокИнцидента, ВыборкаДата);   
				
				Выборка = ВыборкаДата.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ДокИнцидента.ВидыИнцидентов.Добавить().ВидИнцидента = Выборка.ВидИнцидента;
					
				КонецЦикла; 
				
				ДокИнцидента.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры