
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Возвращает данные для проведения документа.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
// Возвращаемое значение:
//   Структура: 
//   	* Ключ - Строка - имя регистра.
//   	* Значение - ТаблицаЗначений - данные для проведения документа.
//
Функция ДанныеПроведения(ДокументСсылка) Экспорт
	
	ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	
	Запрос.Текст = ТекстПроведение();
	
	Результат = Запрос.ВыполнитьПакет();
	ИндексПоследнего = Результат.ВГраница();
	
	ДанныеПроведения = Новый Структура;
	ДанныеПроведения.Вставить("упоФактТрудозатратПоДням", Результат[ИндексПоследнего - 2].Выгрузить());
	ДанныеПроведения.Вставить("упоФактТрудозатратСводно", Результат[ИндексПоследнего - 1].Выгрузить());
	ДанныеПроведения.Вставить("упоИспользованиеРабочегоВремени", Результат[ИндексПоследнего].Выгрузить());
	
	Возврат ДанныеПроведения;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(ПроектныеЗадачи.ПроектнаяЗадача.Проект, NULL КАК ИСТИНА))";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт

КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, 
		Метаданные.Документы.упоСинхронизацияФактическихТрудозатрат);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ТекстПроведение()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.Дата КАК Дата,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.ВидОперации КАК ВидОперации,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.Роль КАК Роль,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.Ресурс КАК Ресурс,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.Подразделение КАК Подразделение,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.Расшифровка КАК Расшифровка,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.КоличествоОкончательный КАК КоличествоОкончательный,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.СуммаОкончательный КАК СуммаОкончательный,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.КоличествоПредварительный КАК КоличествоПредварительный,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.СуммаПредварительный КАК СуммаПредварительный,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.Задание КАК Задание,
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ втПроектныеЗадачи
	               |ИЗ
	               |	Документ.упоСинхронизацияФактическихТрудозатрат.ПроектныеЗадачи КАК упоСинхронизацияФактическихТрудозатратПроектныеЗадачи
	               |ГДЕ
	               |	упоСинхронизацияФактическихТрудозатратПроектныеЗадачи.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПроектныеЗадачи.ПроектнаяЗадача КАК Операция,
	               |	втПроектныеЗадачи.Роль КАК Ресурс,
	               |	НЕОПРЕДЕЛЕНО КАК Роль,
	               |	втПроектныеЗадачи.Подразделение КАК Подразделение,
	               |	втПроектныеЗадачи.Дата КАК День,
	               |	ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный) КАК УровеньПланирования,
	               |	втПроектныеЗадачи.ВидОперации КАК ВидОперации,
	               |	втПроектныеЗадачи.КоличествоПредварительный КАК Трудозатраты,
	               |	втПроектныеЗадачи.СуммаПредварительный КАК Стоимость,
	               |	втПроектныеЗадачи.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ втФактТрудозатратПоДням
	               |ИЗ
	               |	втПроектныеЗадачи КАК втПроектныеЗадачи
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	втПроектныеЗадачи.ПроектнаяЗадача,
	               |	втПроектныеЗадачи.Ресурс,
	               |	втПроектныеЗадачи.Роль,
	               |	втПроектныеЗадачи.Подразделение,
	               |	втПроектныеЗадачи.Дата,
	               |	ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный),
	               |	втПроектныеЗадачи.ВидОперации,
	               |	втПроектныеЗадачи.КоличествоОкончательный,
	               |	втПроектныеЗадачи.СуммаОкончательный,
	               |	втПроектныеЗадачи.НомерСтроки
	               |ИЗ
	               |	втПроектныеЗадачи КАК втПроектныеЗадачи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втФактТрудозатратПоДням.Операция КАК Операция,
	               |	втФактТрудозатратПоДням.Ресурс КАК Ресурс,
	               |	втФактТрудозатратПоДням.Роль КАК Роль,
	               |	втФактТрудозатратПоДням.Подразделение КАК Подразделение,
	               |	втФактТрудозатратПоДням.День КАК День,
	               |	втФактТрудозатратПоДням.УровеньПланирования КАК УровеньПланирования,
	               |	втФактТрудозатратПоДням.ВидОперации КАК ВидОперации,
	               |	СУММА(втФактТрудозатратПоДням.Трудозатраты) КАК Трудозатраты,
	               |	СУММА(втФактТрудозатратПоДням.Стоимость) КАК Стоимость,
	               |	&Ссылка КАК Регистратор,
	               |	&Период КАК Период,
	               |	МАКСИМУМ(втФактТрудозатратПоДням.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	втФактТрудозатратПоДням КАК втФактТрудозатратПоДням
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втФактТрудозатратПоДням.Операция,
	               |	втФактТрудозатратПоДням.Ресурс,
	               |	втФактТрудозатратПоДням.Роль,
	               |	втФактТрудозатратПоДням.Подразделение,
	               |	втФактТрудозатратПоДням.День,
	               |	втФактТрудозатратПоДням.УровеньПланирования,
	               |	втФактТрудозатратПоДням.ВидОперации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
	               |	втФактТрудозатратПоДням.Ресурс КАК Ресурс,
	               |	втФактТрудозатратПоДням.Роль КАК Роль,
	               |	втФактТрудозатратПоДням.Подразделение КАК Подразделение,
	               |	втФактТрудозатратПоДням.УровеньПланирования КАК УровеньПланирования,
	               |	втФактТрудозатратПоДням.ВидОперации КАК ВидОперации,
	               |	СУММА(втФактТрудозатратПоДням.Трудозатраты) КАК КоличествоЧасов,
	               |	СУММА(втФактТрудозатратПоДням.Стоимость) КАК Стоимость,
	               |	&Ссылка КАК Регистратор,
	               |	&Период КАК Период,
	               |	МАКСИМУМ(втФактТрудозатратПоДням.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	втФактТрудозатратПоДням КАК втФактТрудозатратПоДням
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втФактТрудозатратПоДням.Операция,
	               |	втФактТрудозатратПоДням.Ресурс,
	               |	втФактТрудозатратПоДням.Роль,
	               |	втФактТрудозатратПоДням.Подразделение,
	               |	втФактТрудозатратПоДням.УровеньПланирования,
	               |	втФактТрудозатратПоДням.ВидОперации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПроектныеЗадачи.Ресурс КАК ТрудовойРесурс,
	               |	ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача) КАК РазделУчета,
	               |	Проекты.Ссылка КАК ЗадачаПричина,
	               |	втПроектныеЗадачи.Дата КАК День,
	               |	втПроектныеЗадачи.ПроектнаяЗадача КАК РабочееЗадание,
	               |	втПроектныеЗадачи.Расшифровка КАК РасшифровкаТрудозатрат,
	               |	втПроектныеЗадачи.Подразделение КАК Подразделение,
	               |	втПроектныеЗадачи.Роль КАК РольРесурса,
	               |	втПроектныеЗадачи.ВидОперации КАК ВидОперации,
	               |	втПроектныеЗадачи.Задание КАК Задание,
	               |	СУММА(втПроектныеЗадачи.КоличествоПредварительный) КАК Трудозатраты,
	               |	&Ссылка КАК Регистратор,
	               |	&Период КАК Период,
	               |	МАКСИМУМ(втПроектныеЗадачи.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	втПроектныеЗадачи КАК втПроектныеЗадачи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО втПроектныеЗадачи.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |			И (Проекты.ЭтоПроектнаяЗадача)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втПроектныеЗадачи.Ресурс,
	               |	втПроектныеЗадачи.Дата,
	               |	втПроектныеЗадачи.Расшифровка,
	               |	втПроектныеЗадачи.Подразделение,
	               |	втПроектныеЗадачи.Роль,
	               |	втПроектныеЗадачи.ВидОперации,
	               |	втПроектныеЗадачи.Задание,
	               |	Проекты.Ссылка,
	               |	втПроектныеЗадачи.ПроектнаяЗадача
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Ресурс,
	               |	ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача),
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Задача,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Дата,
	               |	NULL,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Расшифровка,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Подразделение,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Роль,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.ВидОперации,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Задание,
	               |	СУММА(упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Количество),
	               |	&Ссылка,
	               |	&Период,
	               |	МАКСИМУМ(упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.НомерСтроки)
	               |ИЗ
	               |	Документ.упоСинхронизацияФактическихТрудозатрат.ВнепроектныеЗадачи КАК упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи
	               |ГДЕ
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Ресурс,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Задача,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Дата,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Расшифровка,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Подразделение,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Роль,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.ВидОперации,
	               |	упоСинхронизацияФактическихТрудозатратВнепроектныеЗадачи.Задание
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Ресурс,
	               |	ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени),
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Причина,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Дата,
	               |	NULL,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Расшифровка,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Подразделение,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Роль,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.ВидОперации,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Задание,
	               |	СУММА(упоСинхронизацияФактическихТрудозатратПотериВремени.Количество),
	               |	&Ссылка,
	               |	&Период,
	               |	МАКСИМУМ(упоСинхронизацияФактическихТрудозатратПотериВремени.НомерСтроки)
	               |ИЗ
	               |	Документ.упоСинхронизацияФактическихТрудозатрат.ПотериВремени КАК упоСинхронизацияФактическихТрудозатратПотериВремени
	               |ГДЕ
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Ресурс,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Причина,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Дата,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Расшифровка,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Подразделение,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Роль,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.ВидОперации,
	               |	упоСинхронизацияФактическихТрудозатратПотериВремени.Задание
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли