
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки
	ИначеЕсли ИмяТабличнойЧасти = "Доходы"
		Или ИмяТабличнойЧасти = "Расходы" Тогда
		СтруктураОбязательныхПолей.Вставить("Статья");
		СтруктураОбязательныхПолей.Вставить("ДатаНачисления");
		СтруктураОбязательныхПолей.Вставить("Сумма");
		СтруктураОбязательныхПолей.Вставить("Валюта");	
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьДанныеПередЗаписью()

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
//  Заголовок    - Строка - содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки для заданной табличной части документа.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - готовая таблица значений.
// 

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	СозданПриЗагрузкеДанных = Ложь;
	ПодключениеКИсточникуДанных = "";
	ИсточникДанных = "";
	СсылкаНаРегистратор = "";
	НомерДокумента = "";
	ДатаДокумента = Дата(1, 1, 1);
	Проверено = Ложь;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не(ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, 
			РежимЗаписиДокумента.Проведение, Отказ, Заголовок, Истина);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	упоПроведениеДокументовСервер.ПодготовитьДвиженияКРегистрации(ЭтотОбъект);
	упоПроведениеДокументовСервер.ПровестиДокумент(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = Справочники.Проекты.ПустаяСсылка();
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли