#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОткрытьНаРедактирование(Команда)
	
	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если Ссылка = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ЭтоГруппа Тогда
		ПоказатьЗначение(, Ссылка);
		Возврат;
	КонецЕсли;	
	
	ОткрытьФорму("Справочник.упоИзбранныеДействия.ФормаОбъекта", Новый Структура("Ключ, Редактирование", Ссылка, Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьВИзбранное(Команда)
	
	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.ЭтоГруппа Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Группу действий нельзя добавлять в избранное.'"));
		Возврат;
	КонецЕсли;	
	
	ДобавитьВИзбранное(Ссылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьИзбранное(Команда)	
		
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ДобавитьВИзбранное(Ссылка)
		
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Ссылка);
		
	Избранное = ХранилищеСистемныхНастроек.Загрузить("Общее/ИзбранноеРаботыПользователя");
	
	Если Избранное = Неопределено Тогда
		Избранное = Новый ИзбранноеРаботыПользователя;
	КонецЕсли;
	
	Элемент = Новый ЭлементИзбранногоРаботыПользователя;
	Элемент.НавигационнаяСсылка = НавигационнаяСсылка;
	Избранное.Добавить(Элемент);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/ИзбранноеРаботыПользователя", , Избранное);
	
КонецПроцедуры 

#КонецОбласти
