
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если РольДоступна("ПолныеПрава") Тогда
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СинхронизироватьСДО", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
		НовыйЭлемент.Заголовок = "Синхронизировать с ДО";
		НовыйЭлемент.ИмяКоманды = "СинхронизироватьСДО";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИКТ_СинхронизироватьСДОПослеНаСервере()
	Определение = Новый WSОпределения(Константы.АдресВебСервиса1СДокументооборот.Получить() + "ws\ikt_ERP.1cws?wsdl",
	Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить(), Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить(),,120);
    
    Прокси = Новый WSПрокси(Определение, "www.IKT.ru", "ikt_ERP", "ikt_ERPSoap");
	Прокси.Пользователь	= Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить();
	Прокси.Пароль 		= Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка,
	|	СтатьиДвиженияДенежныхСредств.Код КАК Код,
	|	СтатьиДвиженияДенежныхСредств.Наименование КАК Наименование,
	|	СтатьиДвиженияДенежныхСредств.ПометкаУдаления КАК ПометкаУдаления,
	|	СтатьиДвиженияДенежныхСредств.Родитель КАК Родитель,
	|	СтатьиДвиженияДенежныхСредств.ЭтоГруппа КАК ЭтоГруппа,
	|Выбор 
	|Когда СтатьиДвиженияДенежныхСредств.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 1
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 2
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 3
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 4
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 5
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 6
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 7
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 8
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 9
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 10
	|Когда СтатьиДвиженияДенежныхСредств.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = Значение(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) Тогда 10 Конец Как Порядок
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|	Упорядочить По Порядок
	|");
	Рез = Запрос.Выполнить().Выбрать();
	СтатьиДДС = Новый Массив();
	Пока Рез.Следующий() Цикл
		СтатьиДДС.Добавить(Новый Структура("УИД, Родитель, Наименование, ПометкаУдаления, ЭтоГруппа, Код", 
		Рез.Ссылка.УникальныйИдентификатор(), Рез.Родитель.УникальныйИдентификатор(), Рез.Наименование, Рез.ПометкаУдаления, Рез.ЭтоГруппа, Рез.Код));
	КонецЦикла;
    Параметр = Новый Структура("Команда, СтатьиДДС, База", "СинхронизироватьДДС", СтатьиДДС, "Стройка");        
    Результат = Прокси.Exec(Новый ХранилищеЗначения(Параметр, Новый СжатиеДанных(6)), 
	Истина).Получить();
	Если Результат.Свойство("Ошибка") Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Сообщить("Готово");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_СинхронизироватьСДОПосле(Команда)
	ИКТ_СинхронизироватьСДОПослеНаСервере();
КонецПроцедуры
