#Область СлужебныеПроцедурыИФункции

#Область ДанныеКолонокРасширяемый

Функция ПолучитьМассивАбсолютныхОтклонений() Экспорт
	
	МассивКолонокВыполнимости = Новый Массив;
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Значение1, Значение2",
		"ОтклонениеПоОкончанию", "ДатаЗавершенияБазовый", "ДатаЗавершения"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Значение1, Значение2",
		"ОтклонениеПоОкончаниюДП", "ДатаЗавершенияДоговорной", "ДатаЗавершения"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Значение1, Значение2",
		"ОтклонениеПоНачалуБП", "ДатаНачалаБазовый", "ДатаНачала"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Значение1, Значение2",
		"ОтклонениеПоНачалуДП", "ДатаНачалаДоговорной", "ДатаНачала"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Значение1, Значение2",
		"ОтклонениеПоНачалуОтВерсии", "ДатаНачалаВерсия", "ДатаНачала"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Значение1, Значение2",
		"ОтклонениеПоОкончаниюОтВерсии", "ДатаЗавершенияВерсия", "ДатаЗавершения"));
	
	Возврат МассивКолонокВыполнимости;	
	
КонецФункции

Функция СтруктураВыводимыхКолонокОтклонения() Экспорт
	
	Возврат Новый Структура("ОтклонениеПоОкончанию, ДатаЗавершенияБазовый, ДатаЗавершения");
	
КонецФункции	

Функция СтруктураВыводимыхКолонокОтклоненияДП() Экспорт
	
	Возврат Новый Структура("ОтклонениеПоОкончаниюДП, ДатаЗавершенияДоговорной, ДатаЗавершения");
	
КонецФункции

Функция СтруктураВыводимыхКолонокОтклоненияПоНачалуБП() Экспорт

	Возврат Новый Структура("ОтклонениеПоНачалуБП, ДатаНачалаБазовый, ДатаНачала");
	
КонецФункции

Функция СтруктураВыводимыхКолонокОтклоненияПоНачалуДП() Экспорт

	Возврат Новый Структура("ОтклонениеПоНачалуДП, ДатаНачалаДоговорной, ДатаНачала");
	
КонецФункции

Функция СтруктураВыводимыхКолонокОтклоненияПоНачалуОтВерсии() Экспорт

	Возврат Новый Структура("ОтклонениеПоНачалуОтВерсии, ДатаНачалаВерсия, ДатаНачала");
	
КонецФункции

Функция СтруктураВыводимыхКолонокОтклоненияПоОкончаниюОтВерсии() Экспорт

	Возврат Новый Структура("ОтклонениеПоОкончаниюОтВерсии, ДатаЗавершенияВерсия, ДатаЗавершения");
	
КонецФункции

Функция ПолучитьСтруктуруЗависимостей() Экспорт
	
	пСтруктура = Новый Структура;
	пСтруктура.Вставить("ВыполнимостьПоступления", "ПоступленияПлан, ПоступленияФакт");
	пСтруктура.Вставить("ВыполнимостьДоход", "ДоходФакт, ДоходПлан");
	пСтруктура.Вставить("ВыполнимостьРасход", "РасходПлан, РасходФакт");
	пСтруктура.Вставить("ВыполнимостьОбъемы", "ОбъемыПлан, ОбъемыФакт");
	пСтруктура.Вставить("ВыполнимостьОбъемыV", "ОбъемыПланV, ОбъемыФактV");
	пСтруктура.Вставить("ВыполнимостьВыплаты", "ВыплатыПлан, ВыплатыФакт");
	пСтруктура.Вставить("ВыполнимостьОбъемыV_Р", "ОбъемыФактV_Р, ОбъемыПланV_Р");	
	пСтруктура.Вставить("ВыполнимостьКоличествоОбъемыV_Р", "ОбъемыКоличествоФактV_Р, ОбъемыКоличествоПланV_Р");	
	пСтруктура.Вставить("ВыполнимостьФОТ", "ФОТФакт, ФОТПлан");
	пСтруктура.Вставить("ВыполнимостьФОТРасчетный", "ФОТФакт, ФОТРасчетный");
	пСтруктура.Вставить("ФОТРасчетный", "ПланПоСтатьямПрямыхРасходов, ФактПоСтатьямПрямыхРасходов, ДоходПланЗаВычетомСССП, ОбъемыПланЗаВычетомСССП");
	пСтруктура.Вставить("ФОТФакт", "ФОТФактПоТабелю, ФОТФактПоБДР");
	пСтруктура.Вставить("ВыполнимостьТрудозатраты", "ТрудозатратыФ, ТрудозатратыТП");
	пСтруктура.Вставить("ВыполнимостьТрудозатратыОкончТР", "ТрудозатратыФ, ТрудозатратыТП_ОкончТР");
	пСтруктура.Вставить("ВыполнимостьТрудозатратыОкончРоли", "ТрудозатратыФ, ТрудозатратыТП_ОкончРоли");
	пСтруктура.Вставить("ВыполнимостьКоличествоОбъемы", "ОбъемыКоличествоФакт, ОбъемыКоличествоПлан");
	пСтруктура.Вставить("ВыполнимостьКоличествоОбъемыV", "ОбъемыКоличествоФактV, ОбъемыКоличествоПланV");
	пСтруктура.Вставить("ТрудозатратыФОбъемыПланV", "ОбъемыКоличествоПланVчас, ТрудозатратыФ");
	пСтруктура.Вставить("ОтклонениеПоОкончанию", "ДатаЗавершения, ДатаЗавершенияБазовый");
	пСтруктура.Вставить("ОтклонениеПоОкончаниюДП", "ДатаЗавершения, ДатаЗавершенияДоговорной");
	пСтруктура.Вставить("ОтклонениеПоНачалуБП", "ДатаНачала, ДатаНачалаБазовый");
	пСтруктура.Вставить("ОтклонениеПоНачалуДП", "ДатаНачала, ДатаНачалаДоговорной");
	пСтруктура.Вставить("ОтклонениеПоНачалуОтВерсии", "ДатаНачала, ДатаНачалаВерсия");
	пСтруктура.Вставить("ОтклонениеПоОкончаниюОтВерсии", "ДатаЗавершения, ДатаЗавершенияВерсия");	
	пСтруктура.Вставить("РасходВыполнимостьТ", "РасходФакт, РасходПланТ");
	пСтруктура.Вставить("ОбъемВыполнимостьТ", "ОбъемПланТ, ОбъемыФактV");	
	
	пСтруктура.Вставить("МесяцНачалаПоПредварительномуУровнюРолейОтклонение", "МесяцНачалаПоПредварительномуУровнюРолей");
	пСтруктура.Вставить("МесяцОкончанияПоПредварительномуУровнюРолейОтклонение", "МесяцОкончанияПоПредварительномуУровнюРолей");
	пСтруктура.Вставить("МесяцНачалаПоОкончательномуУровнюРолейОтклонение", "МесяцНачалаПоОкончательномуУровнюРолей");
	пСтруктура.Вставить("МесяцОкончанияПоОкончательномуУровнюРолейОтклонение", "МесяцОкончанияПоОкончательномуУровнюРолей");		
	
	пСтруктура.Вставить("МесяцНачалаПоПредварительномуУровнюРолей", "МесяцНачалаПоПредварительномуУровнюРолейОтклонение, МесяцОкончанияПоПредварительномуУровнюРолейОтклонение");
	пСтруктура.Вставить("МесяцОкончанияПоПредварительномуУровнюРолей", "МесяцНачалаПоПредварительномуУровнюРолейОтклонение, МесяцОкончанияПоПредварительномуУровнюРолейОтклонение");
	
	пСтруктура.Вставить("МесяцНачалаПоОкончательномуУровнюРолей", "МесяцНачалаПоОкончательномуУровнюРолейОтклонение, МесяцОкончанияПоОкончательномуУровнюРолейОтклонение");
	пСтруктура.Вставить("МесяцОкончанияПоОкончательномуУровнюРолей", "МесяцНачалаПоОкончательномуУровнюРолейОтклонение, МесяцОкончанияПоОкончательномуУровнюРолейОтклонение");		
	
	пСтруктура.Вставить("НачалоРаботТРОтклонение", "НачалоРаботТР");	
	пСтруктура.Вставить("ОкончаниеРаботТРОтклонение", "ОкончаниеРаботТР");
	
	пСтруктура.Вставить("НачалоРаботТР", "НачалоРаботТРОтклонение, ОкончаниеРаботТРОтклонение");	
	пСтруктура.Вставить("ОкончаниеРаботТР", "НачалоРаботТРОтклонение, ОкончаниеРаботТРОтклонение");
	
	пСтруктура.Вставить("ОбъемыКоличествоФактV", "ОбъемыФактV");
	пСтруктура.Вставить("ОтставаниеОтТекПлана", "Статус");
	пСтруктура.Вставить("ОтставаниеОтВерсии", "ДатаЗавершенияВерсия, Статус");
	пСтруктура.Вставить("ОтставаниеОтБазПлана", "ДатаЗавершенияБазовый, Статус");
	пСтруктура.Вставить("ОтставаниеОтДогПлана", "ДатаЗавершенияДоговорной, Статус");
	пСтруктура.Вставить("ОтставаниеОтДогПланаАкт", "ДатаЗавершенияДоговорной, Статус");
	пСтруктура.Вставить("ОтклонениеПоДлительностиОтБазПлана", "ДатаНачалаБазовый, ДатаЗавершенияБазовый, Статус");
	пСтруктура.Вставить("ОтклонениеПоДлительностиОтДогПлана", "ДатаНачалаДоговорной, ДатаЗавершенияДоговорной, Статус");
	пСтруктура.Вставить("ОтклонениеПоДлительностиОтДогПланаАкт", "ДатаНачалаДоговорной, ДатаЗавершенияДоговорной, Статус");
	пСтруктура.Вставить("ДатаНачалаФакт", "ДатаЗавершенияФакт");
	пСтруктура.Вставить("ДатаЗавершенияФакт", "ДатаНачалаФакт");
	пСтруктура.Вставить("ТрудовыеРесурсыРолиОтклонение", "ТрудовыеРесурсыРолиОкончательныйКоличество, ТрудовыеРесурсыРолиПредварительныйКоличество");
	пСтруктура.Вставить("ТрудозатратыТП_ОтклонениеТРотОкончРоли", "ТрудозатратыТП_ОкончТР, ТрудозатратыТП_ОкончРоли");
	пСтруктура.Вставить("EV", "РасходПлан, ПроцентГотовности");
	пСтруктура.Вставить("CPI", "EV, РасходФакт");
	пСтруктура.Вставить("SPI", "EV, РасходПланТ");
	пСтруктура.Вставить("TCPI", "EV, РасходФакт");
	
	пСтруктура.Вставить("ПланБДРДоход", "ПланВыпускаКоличество");	
	пСтруктура.Вставить("ПланБДРРасход", "ПланПотребностейКоличество, ТрудовыеРесурсыРолиПредварительный, ТрудовыеРесурсыРолиОкончательный");	
	
	пСтруктура.Вставить("ПланДДСПоступления", "ПланВыпускаКоличество, ПланБДРДоход");	
	пСтруктура.Вставить("ПланДДСВыплаты", "ПланПотребностейКоличество, ТрудовыеРесурсыРолиПредварительный, ТрудовыеРесурсыРолиОкончательный, ПланБДРРасход");	
	
	пСтруктура.Вставить("ПодчиненнаяПроектнаяЗадача", "ПодчиненныйПроект");
	
	пСтруктура.Вставить("ЗаданиеПодразделению", "СтатусЗаданияПодразделению, ЗаданиеПодразделениюСсылка, ВидЗаданияПодразделению");
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		пСтруктура.Вставить("ДатаНачалаПрогноз", "ДатаЗавершенияПрогноз, СтатусСроков");
		пСтруктура.Вставить("ДатаЗавершенияПрогноз", "ДатаНачалаПрогноз, СтатусСроков");
		пСтруктура.Вставить("СтатусСроков", "ДатаНачалаПрогноз, ДатаЗавершенияПрогноз, ОтставаниеОтТекПлана");	
	КонецЕсли;

	Возврат пСтруктура;
	
КонецФункции

Функция ПолучитьМассивКолонокВыполнимости(СтруктураВыводимыхДопКолонок = Неопределено) Экспорт
	
	МассивКолонокВыполнимости = Новый Массив;
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьДоход", "ДоходФакт", "ДоходПлан"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьРасход", "РасходФакт", "РасходПлан"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьПоступления", "ПоступленияФакт", "ПоступленияПлан"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьФОТ", "ФОТФакт", "ФОТПлан"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьФОТРасчетный", "ФОТФакт", "ФОТРасчетный"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьОбъемы", "ОбъемыФакт", "ОбъемыПлан"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьВыплаты", "ВыплатыФакт", "ВыплатыПлан"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьКоличествоОбъемы", "ОбъемыКоличествоФакт", "ОбъемыКоличествоПлан"));	 
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьТрудозатраты", "ТрудозатратыФ", "ТрудозатратыТП"));	
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьТрудозатратыОкончТР", "ТрудозатратыФ", "ТрудозатратыТП_ОкончТР"));	
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьТрудозатратыОкончРоли", "ТрудозатратыФ", "ТрудозатратыТП_ОкончРоли"));			
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьКоличествоОбъемыV", "ОбъемыКоличествоФактV", "ОбъемыКоличествоПланV"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьОбъемыV", "ОбъемыФактV", "ОбъемыПланV"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ТрудозатратыФОбъемыПланV", "ТрудозатратыФ", "ОбъемыКоличествоПланVчас"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"РасходВыполнимостьТ", "РасходФакт", "РасходПланТ"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ОбъемВыполнимостьТ", "ОбъемыФактV", "ОбъемПланТ"));		
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьОбъемыV_Р", "ОбъемыФактV_Р", "ОбъемыПланV_Р"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"ВыполнимостьКоличествоОбъемыV_Р", "ОбъемыКоличествоФактV_Р", "ОбъемыКоличествоПланV_Р"));
	
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"CPI", "EV", "РасходФакт"));
	МассивКолонокВыполнимости.Добавить(Новый Структура("Результат, Числитель, Знаменатель",
		"SPI", "EV", "РасходПланТ"));
		
	Если СтруктураВыводимыхДопКолонок <> Неопределено Тогда
		сч = МассивКолонокВыполнимости.Количество() - 1;
		Пока сч >= 0 Цикл
			Колонка = МассивКолонокВыполнимости[сч];
			Если НЕ СтруктураВыводимыхДопКолонок.Свойство(Колонка.Результат) Тогда
				МассивКолонокВыполнимости.Удалить(сч);		
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивКолонокВыполнимости;	
	
КонецФункции

Функция ПолучитьМассивКолонокРазности(СтруктураВыводимыхДопКолонок = Неопределено) Экспорт
	
	МассивКолонокРазности = Новый Массив;
	МассивКолонокРазности.Добавить(Новый Структура("Результат, ПервыйЧлен, ВторойЧлен",
											"ТрудозатратыТП_ОтклонениеТРотОкончРоли", "ТрудозатратыТП_ОкончТР", "ТрудозатратыТП_ОкончРоли"));
			
	Если СтруктураВыводимыхДопКолонок <> Неопределено Тогда
		сч = МассивКолонокРазности.Количество() - 1;
		Пока сч >= 0 Цикл
			Колонка = МассивКолонокРазности[сч];
			Если НЕ СтруктураВыводимыхДопКолонок.Свойство(Колонка.Результат) Тогда
				МассивКолонокРазности.Удалить(сч);		
			КонецЕсли;
			сч = сч - 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивКолонокРазности;	
	
КонецФункции

Функция ПолучитьМассивКолонокИсключаемыхИзРасчетаИтогов()
	
	Массив = Новый Массив; 
	Массив.Добавить("ВыполнимостьКоличествоОбъемы");
	Массив.Добавить("ВыполнимостьКоличествоОбъемыV");
	Массив.Добавить("ПланБДРДоход");
	Массив.Добавить("ПланБДРРасход");
	Массив.Добавить("ПланДДСПоступления");
	Массив.Добавить("ПланДДСВыплаты");
	
	Возврат Массив;
		
КонецФункции

Функция ПолучитьМассивИсключаемыхСвойствПриКопировании() Экспорт
	
	СписокРеквизитовБазыДляУсловногоОформления = ПолучитьСписокРеквизитовБазыДляУсловногоОформления();
	
	МассивИсключаемыхСвойствПриКопировании = СписокРеквизитовБазыДляУсловногоОформления.ВыгрузитьЗначения();
	МассивИсключаемыхСвойствПриКопировании.Добавить("ДатаНачалаФакт");
	МассивИсключаемыхСвойствПриКопировании.Добавить("ДатаЗавершенияФакт");
	МассивИсключаемыхСвойствПриКопировании.Добавить("РуководительПЗ");
	МассивИсключаемыхСвойствПриКопировании.Добавить("ЭтоЧужаяЗадача");	
	
	Возврат МассивИсключаемыхСвойствПриКопировании;
	
КонецФункции

Функция ПолучитьСписокРеквизитовБазыДляУсловногоОформления() Экспорт
	
	СписокРеквизитовБазыДляУсловногоОформления = Новый СписокЗначений;
	
	СписокРеквизитовБазыДляУсловногоОформления.Добавить("База_Статус", "Статус");
	СписокРеквизитовБазыДляУсловногоОформления.Добавить("База_ДатаНачала", "ДатаНачала");
	СписокРеквизитовБазыДляУсловногоОформления.Добавить("База_ДатаЗавершения", "ДатаЗавершения");
	СписокРеквизитовБазыДляУсловногоОформления.Добавить("База_Длительность", "Длительность");

	Возврат СписокРеквизитовБазыДляУсловногоОформления;
	
КонецФункции

#Область ПрограммныеКолонки

Функция ПолучитьСоответствиеПрограммныхКолонок(УчитыватьТрудозатратыПриРасчетеГотовности = Истина,
	ДопИнформация = Ложь) Экспорт
	
	СоответствиеКолонок = Новый Соответствие;
	СоответствиеКолонок.Вставить("_ДопИнформация", Новый Структура("ПорядокДобавления", Новый Массив));
	
	ОпцииДоступности = ОпцииДоступностиКолонок();
	ОпцииДоступности.Вставить("УчитыватьТрудозатратыПриРасчетеГотовности", УчитыватьТрудозатратыПриРасчетеГотовности);
	
	ОписанияТипов = ОписанияЧастыхТиповКолонок();
	ОписанияФорматов = ОписанияФорматовКолонок();
	
	ШаблонСПереносом = "%1" + Символы.ПС + "%2";
	
	//
	
	ДополнитьГруппу_Основные(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДополнитьГруппу_Сроки(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДополнитьГруппу_РасчетСроков(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДополнитьГруппу_Дополнительные(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	//
	
	ДобавитьГруппу_ТрудовыеРесурсыРоли(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_НазначенныеРесурсы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_Объемы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_ОбъемыДоходов(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_ОбъемыРасходов(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
		
	ДобавитьГруппу_Доходы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_Поступления(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_Расходы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_Выплаты(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_ФОТ(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
		
	ДобавитьГруппу_ПрогнозныеСроки(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_Трудозатраты(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_СтруктураСтоимости(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
	
	ДобавитьГруппу_ОсвоенныеОбъемы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, 
		ШаблонСПереносом);
		
	// Процедура добавления колонок для новых показателей из расширения.
	ДобавитьКолонкуПрограммноПереопределяемый(СоответствиеКолонок, УчитыватьТрудозатратыПриРасчетеГотовности, 
		ДопИнформация);
	
	Если Не ДопИнформация Тогда
		СоответствиеКолонок.Удалить("_ДопИнформация");
	КонецЕсли;
	
	Возврат СоответствиеКолонок;
	
КонецФункции

Функция ОписанияФорматовКолонок()
	
	ФорматКолонокСумм = упоПользователиВызовСервера.ФорматКолонокИзНастроекПользователя("упоФорматСуммВСтруктуреПроекта", Истина);
	ФорматКолонокКоличества = упоПользователиВызовСервера.ФорматКолонокИзНастроекПользователя("упоФорматКоличестваВСтруктуреПроекта", Ложь);
	ОписанияФорматов = Новый Структура;
	ОписанияФорматов.Вставить("ФорматКолонокСумм", 			ФорматКолонокСумм);
	ОписанияФорматов.Вставить("ФорматКолонокКоличества", 	ФорматКолонокКоличества);
	ОписанияФорматов.Вставить("ФорматНуля", 				"ЧН=' '");
	
	Возврат ОписанияФорматов;
	
КонецФункции

Функция ОписанияЧастыхТиповКолонок()
	
	ОписанияТипов = Новый Структура;
	ОписанияТипов.Вставить("ТипЧисло15_2", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ОписанияТипов.Вставить("ТипЧисло10_0", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	ОписанияТипов.Вставить("ТипЧисло3_0", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0)));
	ОписанияТипов.Вставить("ТипДатаБезВремени", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	Возврат ОписанияТипов;
	
КонецФункции

Функция ОпцииДоступностиКолонок()
	
	ДоступностьФинИнфо = упоРазграничениеДоступаВызовСервера.обДоступностьФинансовойИнформации();
	ДоступКФинИнфоОтсутствует 	= ДоступностьФинИнфо = "Отсутствует";
	ДоступнаФинИнформация 		= Не ДоступКФинИнфоОтсутствует;
	ДоступКФинИнфоПросмотр 		= ДоступностьФинИнфо = "Просмотр";
	ДоступНаРедактированиеКолонок = ДоступнаФинИнформация И Не ДоступКФинИнфоПросмотр;
	
	ЭтоPM_Проф = упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф();
	
	ОпцииДоступности = Новый Структура;
	ОпцииДоступности.Вставить("ЭтоPM_Проф", ЭтоPM_Проф);
	ОпцииДоступности.Вставить("ДоступКФинИнфоОтсутствует", ДоступКФинИнфоОтсутствует);
	ОпцииДоступности.Вставить("ДоступнаФинИнформация", ДоступнаФинИнформация);
	ОпцииДоступности.Вставить("ДоступКФинИнфоПросмотр", ДоступКФинИнфоПросмотр);
	ОпцииДоступности.Вставить("ДоступНаРедактированиеКолонок", ДоступНаРедактированиеКолонок);
	
	Возврат ОпцииДоступности;
	
КонецФункции

Процедура ДополнитьГруппу_Основные(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ИмяГруппы = "Основные";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "КодПроектногоДокумента", НСтр("ru = 'Код ПД'"),, 
		Ложь, 6, ИмяГруппы, "КодСДР", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(25)),, Ложь);
		
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "Последователи", НСтр("ru = 'Последователи'"),, 
		Ложь, 12, ИмяГруппы, "Связи", Новый ОписаниеТипов("Строка"),, Ложь);

КонецПроцедуры

Процедура ДополнитьГруппу_Сроки(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ТипЧисло15_2 = ОписанияТипов.ТипЧисло15_2;
	ТипЧисло10_0 = ОписанияТипов.ТипЧисло10_0;
	ТипЧисло3_0 = ОписанияТипов.ТипЧисло3_0;
	ТипДатаБезВремени = ОписанияТипов.ТипДатаБезВремени;
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	ФорматНуля = ОписанияФорматов.ФорматНуля;
	
	ИмяГруппы = "ГруппаСроки";
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Календарных'"), НСтр("ru = 'дней'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ДлительностьКалендарныеДни", 
		Заголовок,, Ложь, 6, ИмяГруппы, "Длительность", ТипЧисло15_2,, Ложь,,, Ложь);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отставание'"), НСтр("ru = 'от ТП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтставаниеОтТекПлана", 
		Заголовок,, Ложь, 6, ИмяГруппы, "ДатаЗавершения", ТипЧисло15_2,, Ложь,,, Ложь, "ЧН=0");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начало'"), НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюКолонкуДаты(СоответствиеКолонок, "ДатаНачалаВерсия", Заголовок, ИмяГруппы, "^");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Окончание'"), НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюКолонкуДаты(СоответствиеКолонок, "ДатаЗавершенияВерсия", Заголовок, ИмяГруппы, "^");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отставание'"), НСтр("ru = 'от версии'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтставаниеОтВерсии", Заголовок,,  
		Ложь, 6, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по окончанию БП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоОкончанию", Заголовок,,  
		Ложь, 6, ИмяГруппы, "^", ТипЧисло10_0,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по окончанию ДП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоОкончаниюДП", Заголовок,,  
		Ложь, 6, ИмяГруппы, "^", ТипЧисло10_0,, Ложь,,, Ложь, ФорматНуля);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по началу БП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоНачалуБП", Заголовок,,  
		Ложь, 6, ИмяГруппы, "^", ТипЧисло10_0,, Ложь,,, Ложь, ФорматНуля);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по началу ДП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоНачалуДП", Заголовок,,  
		Ложь, 6, ИмяГруппы, "^", ТипЧисло10_0,, Ложь,,, Ложь, ФорматНуля);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по началу от версии'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоНачалуОтВерсии", Заголовок,,  
		Ложь, 6, ИмяГруппы, "^", ТипЧисло10_0,, Ложь,,, Ложь, ФорматНуля);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по окончанию от версии'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоОкончаниюОтВерсии", Заголовок,,  
		Ложь, 6, ИмяГруппы, "^", ТипЧисло10_0,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начало'"), НСтр("ru = 'по БП'"));
	ДобавитьСтандартнуюКолонкуДаты(СоответствиеКолонок, "ДатаНачалаБазовый", Заголовок, ИмяГруппы, "^");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Окончание'"), НСтр("ru = 'по БП'"));
	ДобавитьСтандартнуюКолонкуДаты(СоответствиеКолонок, "ДатаЗавершенияБазовый", Заголовок, ИмяГруппы, "^");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отставание'"), НСтр("ru = 'от БП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтставаниеОтБазПлана", 
		Заголовок, , Ложь, 6, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по длительности БП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоДлительностиОтБазПлана", 
		Заголовок, , Ложь, 6, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматНуля);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ДатаНачалаФакт", НСтр("ru = 'Начало факт'"),, 
		Ложь, 10, ИмяГруппы, "^",  ТипДатаБезВремени,, Истина, Истина,, Истина, "ДФ=dd.MM.yyyy",, Истина);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "ДатаНачалаФакт", 
		НСтр("ru = 'Разрешено редактирование, если процент готовности проектной задачи не равен 0%.'"));
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ДатаЗавершенияФакт", НСтр("ru = 'Окончание факт'"),, 
		Ложь, 10, ИмяГруппы, "^",  ТипДатаБезВремени,, Истина, Истина,, Истина, "ДФ=dd.MM.yyyy",, Истина);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "ДатаЗавершенияФакт", 
		НСтр("ru = 'Разрешено редактирование, если процент готовности проектной задачи равен 100%.'"));
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начало'"), НСтр("ru = 'по ДП'"));
	ДобавитьСтандартнуюКолонкуДаты(СоответствиеКолонок, "ДатаНачалаДоговорной", 
		Заголовок, ИмяГруппы, "ДатаЗавершенияФакт");
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "ДатаНачалаДоговорной", 
		НСтр("ru = 'Дата начала по договорному плану.'"));
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Окончание'"), НСтр("ru = 'по ДП'"));
	ДобавитьСтандартнуюКолонкуДаты(СоответствиеКолонок, "ДатаЗавершенияДоговорной", Заголовок, 
		ИмяГруппы, "^");
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "ДатаЗавершенияДоговорной", 
		НСтр("ru = 'Дата завершения по договорному плану.'"));
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отставание'"), НСтр("ru = 'от ДП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтставаниеОтДогПлана", Заголовок,, 
		Ложь, 6, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отставание'"), НСтр("ru = 'от ДП (акт.)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтставаниеОтДогПланаАкт", Заголовок,, 
		Ложь, 6, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по длительности ДП'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоДлительностиОтДогПлана", Заголовок,, 
		Ложь, 6, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'по длительности ДП (акт.)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОтклонениеПоДлительностиОтДогПланаАкт", Заголовок,, 
		Ложь, 6, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматНуля);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество дней'"), НСтр("ru = 'просрочки'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "КоличествоДнейПросрочки", 
		Заголовок,, 
		Ложь, 10, ИмяГруппы, "^", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0)),, Ложь,,, Ложь, ФорматНуля);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "КоличествоДнейПросрочки", 
		НСтр("ru = 'Количество дней просрочки (считаются по текущему плану относительно договорного плана).'"));
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "СуммаСанкций", НСтр("ru = 'Сумма санкций'"),,  
		Ложь, 8, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,, Ложь, ФорматКолонокСумм);
	
	Подсказка = СтрШаблон(ШаблонСПереносом, 
		НСтр("ru = 'Сумма санкций за дни просрочки (дни просрочки считаются по текущему плану относительно договорного плана;'"), 
		НСтр("ru = 'при отсутствии договорного плана сумма санкций не рассчитывается).'"));
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "СуммаСанкций",Подсказка);
	
	//
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Окончание работ'"), НСтр("ru = '(роли предв. ур.)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцОкончанияПоПредварительномуУровнюРолей", Заголовок,, 
		Ложь, 12, ИмяГруппы, "^",  ТипДатаБезВремени,, Ложь,,,, "ДФ=MM.yyy");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начало работ'"), НСтр("ru = '(роли предв. ур.)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцНачалаПоПредварительномуУровнюРолей", Заголовок,, 
		Ложь, 12, ИмяГруппы, "^",  ТипДатаБезВремени,, Ложь,,,, "ДФ=MM.yyy");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение окончания'"), НСтр("ru = '(роли предв. ур.), мес.'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцОкончанияПоПредварительномуУровнюРолейОтклонение", Заголовок,, 
		Ложь, 12, ИмяГруппы, "^",  ТипЧисло3_0,, Ложь,,,, "ДФ=MM.yyy");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение начала'"), НСтр("ru = '(роли предв. ур.), мес.'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцНачалаПоПредварительномуУровнюРолейОтклонение", Заголовок,, 
		Ложь, 12, ИмяГруппы, "^",  ТипЧисло3_0,, Ложь,,,, "ДФ=MM.yyy");
	
	//
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Окончание работ'"), НСтр("ru = '(роли оконч. ур.)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцОкончанияПоОкончательномуУровнюРолей", Заголовок,, 
	Ложь, 12, ИмяГруппы, "^",  ТипДатаБезВремени,, Ложь,,,, "ДФ=MM.yyy");
	
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начало работ'"), НСтр("ru = '(роли оконч. ур.)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцНачалаПоОкончательномуУровнюРолей", Заголовок,, 
			Ложь, 12, ИмяГруппы, "^",  ТипДатаБезВремени,, Ложь,,,, "ДФ=MM.yyy");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение окончания'"), НСтр("ru = '(роли оконч. ур.), мес.'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцОкончанияПоОкончательномуУровнюРолейОтклонение", Заголовок,, 
		Ложь, 12, ИмяГруппы, "^",  ТипЧисло3_0,, Ложь,,,, "");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение начала'"), НСтр("ru = '(роли оконч. ур.), мес.'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "МесяцНачалаПоОкончательномуУровнюРолейОтклонение", Заголовок,, 
		Ложь, 12, ИмяГруппы, "^",  ТипЧисло3_0,, Ложь,,,, "");
	
	//
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начало'"), НСтр("ru = 'работ (ТР)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "НачалоРаботТР", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^",  ТипДатаБезВремени,, Ложь,,,, "ДФ=dd.MM.yyyy");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Окончание'"), НСтр("ru = 'работ (ТР)'")); 
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОкончаниеРаботТР", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^",  ТипДатаБезВремени,, Ложь,,,, "ДФ=dd.MM.yyyy");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'начала (ТР), дн.'")); 
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "НачалоРаботТРОтклонение", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^",  ТипЧисло10_0,, Ложь,,,, "");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение'"), НСтр("ru = 'окончания (ТР), дн.'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОкончаниеРаботТРОтклонение", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^",  ТипЧисло10_0,, Ложь,,,, "");
	
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПричиныОтклонений() Тогда
		
		Заголовок = НСтр("ru = 'Причины отклонений'");
		ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПричиныОтклонений", Заголовок,, 
			Ложь, 10, ИмяГруппы, "^", Новый ОписаниеТипов("Строка"),, Истина,,,, "",, Истина);
		
	КонецЕсли;
	
	//
	
	ИспользуетсяФункционалЗаказыНаПроизводство = упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыНаПроизводство()
		Или упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыНаПроизводство2_2();
		
	Если ИспользуетсяФункционалЗаказыНаПроизводство Тогда
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начать'"), НСтр("ru = 'не ранее'"));
		ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "НачатьНеРанее", Заголовок,, 
			Ложь, 10, ИмяГруппы, "^", ТипДатаБезВремени,, Ложь,,,, "",, Ложь);
			
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Желаемая'"), НСтр("ru = 'дата выпуска'"));
		ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ЖелаемаяДатаВыпуска", Заголовок,, 
			Ложь, 10, ИмяГруппы, "^", ТипДатаБезВремени,, Ложь,,,, "",, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьГруппу_РасчетСроков(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ИмяГруппы = "ГруппаРасчетСроков";
	
	ТипКолонки = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "БуферПозднийСтартРаннийСтарт", НСтр("ru = 'Буфер'"),, 
		Ложь, 6, ИмяГруппы, "ГруппаРасчетСроков", ТипКолонки,, Ложь,,, Ложь);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "БуферПозднийСтартРаннийСтарт", 
		НСтр("ru = '[Поздний старт] - [ранний старт]'"));
	
КонецПроцедуры

Процедура ДополнитьГруппу_Дополнительные(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ТипЧисло10_0 = ОписанияТипов.ТипЧисло10_0;
	ТипЗадание = Новый ОписаниеТипов("СправочникСсылка.упоЗадания");
	ТипСтатусЗадания = Новый ОписаниеТипов("ПеречислениеСсылка.упоСтатусыЗаданий");
	
	ИмяГруппы = "ГруппаДополнительные";
	
	ТипКолонки = Новый ОписаниеТипов("Строка, СправочникСсылка.Номенклатура");
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "Результат", НСтр("ru = 'Результат'"),, 
		Ложь, 10, ИмяГруппы, "ГруппаДополнительные", ТипКолонки,, Ложь,,,,,, Истина);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОписаниеРезультата", НСтр("ru = 'Описание результата'"),, 
		Ложь, 14, ИмяГруппы, "ГруппаДополнительные", Новый ОписаниеТипов("Строка"),, Истина,,,,,, Истина);
		
	ТипКолонки = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(999, ДопустимаяДлина.Переменная));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "КритерийРезультата", НСтр("ru = 'Критерий результата'"),, 
		Ложь, 14, ИмяГруппы, "ГруппаДополнительные", ТипКолонки,, Истина,,,,,, Истина);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Основная'"), НСтр("ru = 'роль'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОсновнаяРоль", Заголовок,, 
		Ложь, 10, ИмяГруппы, "ВидОперации", Новый ОписаниеТипов("СправочникСсылка.упоРоли"),, Ложь);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПодразделениеОсновнойРоли", НСтр("ru = 'Подразделение'"),, 
		Ложь, 12, ИмяГруппы, "^", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"),, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество'"), НСтр("ru = 'ролей'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "КоличествоРолей", Заголовок,, 
		Ложь, 9, ИмяГруппы, "^", ТипЧисло10_0,, Ложь);
		
	ТипКолонки = Новый ОписаниеТипов("СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.упоРоли");
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Основной'"), НСтр("ru = 'исполнитель'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "Исполнитель", Заголовок,, 
		Ложь, 12, ИмяГруппы, "^", ТипКолонки,, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество'"), НСтр("ru = 'исполнителей'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "КоличествоИсполнителей", Заголовок,, 
		Ложь, 9, ИмяГруппы, "^", ТипЧисло10_0,, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Основное'"), НСтр("ru = 'поручение'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ОсновноеЗадание", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^", ТипЗадание,, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Статус основного'"), НСтр("ru = 'поручения'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "СтатусОсновногоЗадания", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^", ТипСтатусЗадания,, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Задание'"), НСтр("ru = 'подразделению'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ЗаданиеПодразделениюСсылка", Заголовок, Истина, 
		Ложь, 10, ИмяГруппы, "^", ТипЗадание,, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Вид задания'"), НСтр("ru = 'подразделению'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВидЗаданияПодразделению", Заголовок, Истина, 
		Ложь, 10, ИмяГруппы, "^", Новый ОписаниеТипов("ПеречислениеСсылка.упоВидыЗаданияПодразделению"),, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Статус задания'"), НСтр("ru = 'подразделению'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "СтатусЗаданияПодразделению", Заголовок, Истина, 
		Ложь, 10, ИмяГруппы, "^", ТипСтатусЗадания,, Ложь);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Задание'"), НСтр("ru = 'подразделению'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ЗаданиеПодразделению", Заголовок,, 
		Ложь, 10, ИмяГруппы, "СтатусОсновногоЗадания", Новый ОписаниеТипов("Строка"),, Ложь);
		
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВключитьДопЗатратыВПланРасходов", 
		НСтр("ru = 'Включить доп. затраты в план расходов'"), Истина, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("Булево"),,,,, Истина);
	
КонецПроцедуры

Процедура ДобавитьГруппу_ТрудовыеРесурсыРоли(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ТипЧисло15_2 = ОписанияТипов.ТипЧисло15_2;
	ТипНормаСтоимости = Новый ОписаниеТипов("СправочникСсылка.упоНормыСтоимости");
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	ДоступКФинИнфоОтсутствует = ОпцииДоступности.ДоступКФинИнфоОтсутствует;
	ДоступНаРедактированиеКолонок = ОпцииДоступности.ДоступНаРедактированиеКолонок;
	
	ИмяГруппы = "ТрудовыеРесурсыРоли";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Планирование трудозатрат'"),, Истина,,, "ПрогнозныеСрокиПроектныхЗадач",, Ложь,,);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ТрудовыеРесурсыРолиПредварительный", 
		НСтр("ru = 'Роли (предварительный)'"),, Ложь, 12, ИмяГруппы, "^", ТипСтрока,, Истина,,,,, Ложь);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ТрудовыеРесурсыРолиПредварительныйКоличество", 
		НСтр("ru = 'Роли (предв.), ч.'"),, Ложь, 10, ИмяГруппы, "^", ТипЧисло15_2,, Истина,,,,, Ложь);
		
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ТрудовыеРесурсыРолиОкончательный", 
		НСтр("ru = 'Роли (окончательный)'"),, Ложь, 12, ИмяГруппы, "^", ТипСтрока,, Истина,,,,, Ложь);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ТрудовыеРесурсыРолиОкончательныйКоличество", 
		НСтр("ru = 'Роли (оконч.), ч.'"),, Ложь, 10, ИмяГруппы, "^", ТипЧисло15_2,, Истина,,,,, Ложь);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Роли (отклонение'"), НСтр("ru = 'предв. от оконч.), ч.'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ТрудовыеРесурсыРолиОтклонение", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,,,, Ложь);
		
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "НормаСтоимостиТрудовыхРесурсов", 
		НСтр("ru = 'Норма стоимости ролей'"), ДоступКФинИнфоОтсутствует, 
		Ложь, 9, ИмяГруппы, "^", ТипНормаСтоимости,, ДоступНаРедактированиеКолонок,,, Истина,,, Истина);
	
	Заголовок = НСтр("ru = 'Внешняя норма'") + Символы.ПС + НСтр("ru = 'стоимости ролей'");
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВнешняяНормаСтоимостиТрудовыхРесурсов", 
		Заголовок, ДоступКФинИнфоОтсутствует, 
		Ложь, 9, ИмяГруппы, "^", ТипНормаСтоимости,, ДоступНаРедактированиеКолонок,,, Истина,,, Истина);
		
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВключитьТрудРесурсыВПланРасходов", 
		НСтр("ru = 'Включить труд. ресурсы в БДР'"), Истина, Ложь, 9, ИмяГруппы, "^", ТипБулево,,,,, Истина);
		
	ТипКолонки = Новый ОписаниеТипов("ПеречислениеСсылка.упоУровеньПланированияТрудозатратДляБДР");
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "УровеньПланированияТрудозатратДляБДР", 
		НСтр("ru = 'Уровень планирования трудозатрат для БДР'"), Истина, 
		Ложь, 9, ИмяГруппы, "^", ТипКолонки,,,,, Истина);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланРасходовНеАктуален", 
		НСтр("ru = 'План расходов не актуален'"), Истина, Ложь, 9, ИмяГруппы, "^", ТипБулево,,,,, Истина);
	
КонецПроцедуры

Процедура ДобавитьГруппу_НазначенныеРесурсы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ИмяГруппы = "ГруппаТрудовыеРесурсы";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Трудовые ресурсы'"),, Истина,,, "ТрудовыеРесурсыРоли",, Ложь,,);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "НазначенныеТрудовыеРесурсы", НСтр("ru = 'Назначенные ТР'"),, 
		Ложь, 12, ИмяГруппы, "ГруппаТрудовыеРесурсы", Новый ОписаниеТипов("Строка"),, Истина,,,,, Ложь);
	
КонецПроцедуры

Процедура ДобавитьГруппу_Объемы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	ФорматКолонокКоличества = ОписанияФорматов.ФорматКолонокКоличества;
	ФорматНуля = ОписанияФорматов.ФорматНуля;
	
	ДоступнаФинИнформация = ОпцииДоступности.ДоступнаФинИнформация;
	
	ИмяГруппы = "ГруппаОбъемов";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Объемы'"),, Истина,,, "ГруппаДополнительные",, Ложь,,);
	
	Заголовок = СтрШаблон(ШаблонСПереносом,  НСтр("ru = 'Количество'") + Символы.ПС + НСтр("ru = 'план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПлан",Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество'") + Символы.ПС + НСтр("ru = 'по БП'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланБазовый", Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество V'") + Символы.ПС + НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланВерсия", Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество V'") + Символы.ПС + НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоФакт", Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество'") + Символы.ПС + НСтр("ru = '%V'"));
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьКоличествоОбъемы", Заголовок, ИмяГруппы, "^");
	
	Если ДоступнаФинИнформация Тогда
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы'") + Символы.ПС + НСтр("ru = 'план'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПлан", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм);
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы'") + Символы.ПС + НСтр("ru = 'по БП'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланБазовый", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм);
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы'") + Символы.ПС + НСтр("ru = 'по версии'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланВерсия", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм); 
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы'") + Символы.ПС + НСтр("ru = 'факт'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыФакт", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм); 
		
		ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьОбъемы", НСтр("ru = '%V'"), ИмяГруппы, "^");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьГруппу_ОбъемыДоходов(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	ФорматКолонокКоличества = ОписанияФорматов.ФорматКолонокКоличества;
	
	ДоступнаФинИнформация = ОпцииДоступности.ДоступнаФинИнформация;
	ДоступНаРедактированиеКолонок = ОпцииДоступности.ДоступНаРедактированиеКолонок;
	
	ИмяГруппы = "ГруппаОбъемов_V";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Объемы доходов (V)'"),, Истина,,, "ГруппаОбъемов",, Ложь,,);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланВыпускаКоличество", НСтр("ru = 'План выпуска'"),, Ложь,, 
		ИмяГруппы, "^", Новый ОписаниеТипов("Строка"),, ДоступНаРедактированиеКолонок,,,,, Ложь);	
	
	Если ДоступнаФинИнформация Тогда
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'доход план'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланV", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм); 
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'доход БП'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланБазовыйV", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм); 
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'доход по версии'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланВерсияV", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм);
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'доход факт'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыФактV", Заголовок, 
			ИмяГруппы,, "^",, ФорматКолонокСумм);
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = '%V (V)'"), НСтр("ru = 'доход'"));
		ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьОбъемыV", Заголовок, ИмяГруппы, "^");
		
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемПланТ", НСтр("ru = 'Объемы Д (Т)'"), ИмяГруппы,, "^"); 
		
		ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ОбъемВыполнимостьТ", 
			НСтр("ru = '%V Д (Т)'"), ИмяГруппы, "^");
		
	КонецЕсли;
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'доход план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланV", Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'доход БП'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланБазовыйV", Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'доход по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланВерсияV", Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'доход факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоФактV", Заголовок, 
		ИмяГруппы,, "^",, ФорматКолонокКоличества);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'доход %V'"));
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьКоличествоОбъемыV", Заголовок, ИмяГруппы, "^");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Норма стоимости'"), НСтр("ru = 'объемов'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "НормаСтоимостиОбъемы", Заголовок, Истина, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("СправочникСсылка.упоНормыСтоимости"),,,,, Истина);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Включить субпродукты'"), НСтр("ru = 'в план доходов'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВключитьСубпродуктыВПланДоходов", Заголовок, Истина, 
		Ложь, 9, ИмяГруппы, "^", ТипБулево,,,,, Истина);
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Заполнить'"), НСтр("ru = 'затраты'"));
		ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ТранслироватьЗатратыПоСубпродуктам", Заголовок, Истина, 
			Ложь, 9, ИмяГруппы, "^", ТипБулево,,,,, Истина);
		
		ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ТипСубпродукта", НСтр("ru = 'Тип субпродукта'"), Истина, 
			Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("ПеречислениеСсылка.упоТипСубпродукта"),,,,, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьГруппу_ОбъемыРасходов(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	ФорматКолонокКоличества = ОписанияФорматов.ФорматКолонокКоличества;
	
	ДоступнаФинИнформация = ОпцииДоступности.ДоступнаФинИнформация;
	ДоступНаРедактированиеКолонок = ОпцииДоступности.ДоступНаРедактированиеКолонок;
	
	ИмяГруппы = "ГруппаОбъемов_V_Р";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, НСтр("ru = 'Объемы расходов (V)'"),, Истина,,, "ГруппаОбъемов_V",, Ложь,,);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланПотребностейКоличество", НСтр("ru = 'План потребностей'"),, Ложь,, 
		ИмяГруппы,, Новый ОписаниеТипов("Строка"),, Истина,,,,, Ложь);	
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'расход план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланV_Р", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокКоличества); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'расход БП'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланБазовыйV_Р", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокКоличества); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'расход по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланВерсияV_Р", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокКоличества); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'расход факт'"),);
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоФактV_Р", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокКоличества); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Количество (V)'"), НСтр("ru = 'расход %V'"));
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьКоличествоОбъемыV_Р", Заголовок, ИмяГруппы);
	
	Если ДоступнаФинИнформация Тогда
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'расход план'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланV_Р", Заголовок, 
			ИмяГруппы,,,, ФорматКолонокСумм); 
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'расход БП'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланБазовыйV_Р", Заголовок, 
			ИмяГруппы,,,, ФорматКолонокСумм); 
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'расход по версии'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланВерсияV_Р", Заголовок, 
			ИмяГруппы,,,, ФорматКолонокСумм); 
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'расход факт'"));
		ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыФактV_Р", Заголовок, 
			ИмяГруппы,,,, ФорматКолонокСумм); 
		
		Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = '%V (V)'"), НСтр("ru = 'расход'"));
		ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьОбъемыV_Р", Заголовок, ИмяГруппы);
		
	КонецЕсли;
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Норма стоимости'"), НСтр("ru = 'потребностей'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "НормаСтоимости", Заголовок, Истина, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("СправочникСсылка.упоНормыСтоимости"),,,,, Истина);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Включить мат. ресурсы'"), НСтр("ru = 'в план расходов'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВключитьМатРесурсыВПланРасходов", Заголовок, Истина, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("Булево"),,,,, Истина);
	
КонецПроцедуры

Процедура ДобавитьГруппу_Доходы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если Не ОпцииДоступности.ДоступнаФинИнформация Тогда
		Возврат;
	КонецЕсли;
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	
	ИмяГруппы = "ГруппаДоходов";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Доходы'"),, Истина,,, "ГруппаОбъемов_V_Р",, Ложь,,);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'План БДР'"), НСтр("ru = '(доходы)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланБДРДоход", Заголовок,, 
		Ложь,, ИмяГруппы,, Новый ОписаниеТипов("Строка"),, Истина,,,,, Ложь);	
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВключитьПланДоходовВБДДС", НСтр("ru = 'Вкл. доходы в БДДС'"),, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("Булево"),, Истина,,, Истина);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доход'"), НСтр("ru = 'план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходПлан", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доход'"), НСтр("ru = 'по БП'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходПланБазовый", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доход'"), НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходПланВерсия", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доход'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходФакт", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьДоход", НСтр("ru = '%Д'"), ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Схема оплаты по умолчанию'"), НСтр("ru = 'доходы'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "СхемаОплатыПоУмолчаниюДоходы", Заголовок, Истина, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("СправочникСсылка.упоСхемыОплаты"),,,,, Истина);
	
КонецПроцедуры

Процедура ДобавитьГруппу_Расходы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если Не ОпцииДоступности.ДоступнаФинИнформация Тогда
		Возврат;
	КонецЕсли;
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	
	ИмяГруппы = "ГруппаРасходов";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Расходы'"),, Истина,,, "ГруппаПоступлений",, Ложь,,);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'План БДР'"), НСтр("ru = '(расходы)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланБДРРасход", Заголовок,, 
		Ложь,, ИмяГруппы,, Новый ОписаниеТипов("Строка"),, Истина,,,,, Ложь);
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ВключитьПланРасходовВБДДС", НСтр("ru = 'Вкл. расходы в БДДС'"),, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("Булево"),, Истина,,, Истина);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Расход'"), НСтр("ru = 'план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "РасходПлан", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Расход'"), НСтр("ru = 'по БП'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "РасходПланБазовый", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Расход'"), НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "РасходПланВерсия", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Расход'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "РасходФакт", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьРасход", НСтр("ru = '%Р'"), ИмяГруппы);
	
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "РасходПланТ", НСтр("ru = 'Расходы (Т) PV'"), 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "РасходВыполнимостьТ", НСтр("ru = '% Р (Т)'"), ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Схема оплаты по умолчанию'"), НСтр("ru = 'расходы'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "СхемаОплатыПоУмолчаниюРасходы", Заголовок, Истина, 
		Ложь, 9, ИмяГруппы, "^", Новый ОписаниеТипов("СправочникСсылка.упоСхемыОплаты"),,,,, Истина);
		
	//ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "РасходПланEV","",Истина, 
	//	Ложь, , ИмяГруппы, "^", Новый ОписаниеТипов("Число"));
	
КонецПроцедуры

Процедура ДобавитьГруппу_Поступления(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если Не ОпцииДоступности.ДоступнаФинИнформация Тогда
		Возврат;
	КонецЕсли;
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	
	ИмяГруппы = "ГруппаПоступлений";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Поступления'"),, Истина,,, "ГруппаДоходов",, Ложь,,);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'План ДДС'"), НСтр("ru = '(поступления)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланДДСПоступления", Заголовок,, 
		Ложь,, ИмяГруппы,, Новый ОписаниеТипов("Строка"),, Истина,,,,, Ложь);	
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Поступления'"), НСтр("ru = 'план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ПоступленияПлан", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Поступления'"), НСтр("ru = 'по БП'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ПоступленияПланБазовый", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Поступления'"), НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ПоступленияПланВерсия", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Поступления'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ПоступленияФакт", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм); 
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьПоступления", НСтр("ru = '%П'"), ИмяГруппы);
	
КонецПроцедуры

Процедура ДобавитьГруппу_Выплаты(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если Не ОпцииДоступности.ДоступнаФинИнформация Тогда
		Возврат;
	КонецЕсли;
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	
	ИмяГруппы = "ГруппаВыплат";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Выплаты'"),, Истина,,, "ГруппаРасходов",, Ложь,,);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'План ДДС'"), НСтр("ru = '(выплаты)'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланДДСВыплаты", Заголовок,, 
		Ложь,, ИмяГруппы,, Новый ОписаниеТипов("Строка"),, Истина,,,,, Ложь);	
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Выплаты'"), НСтр("ru = 'план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ВыплатыПлан", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Выплаты'"), НСтр("ru = 'по БП'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ВыплатыПланБазовый", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Выплаты'"), НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ВыплатыПланВерсия", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Выплаты'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ВыплатыФакт", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьВыплаты", НСтр("ru = '%В'"), ИмяГруппы);
	
КонецПроцедуры

Процедура ДобавитьГруппу_ФОТ(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если Не ОпцииДоступности.ДоступнаФинИнформация Тогда
		Возврат;
	КонецЕсли;
	
	ТипЧисло15_2 = ОписанияТипов.ТипЧисло15_2;
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	
	ИмяГруппы = "ГруппаФОТ";
		
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'ФОТ'"),, Истина,,, "ГруппаВыплат");
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'ФОТ'"), НСтр("ru = 'план'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ФОТПлан", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'ФОТ'"), НСтр("ru = 'по версии'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ФОТПланВерсия", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'ФОТ'"), НСтр("ru = 'расчетный'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ФОТРасчетный", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'ФОТ'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ФОТФакт", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = '%ФОТ'"), НСтр("ru = 'расчетный'"));
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьФОТРасчетный", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = '%ФОТ'"), НСтр("ru = 'план'"));
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьФОТ", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'ФОТ по БДР'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ФОТФактПоБДР", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'ФОТ по табелю'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ФОТФактПоТабелю", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'План по статьям'"), НСтр("ru = 'прямых расходов'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ПланПоСтатьямПрямыхРасходов", Заголовок,, 
		Ложь,, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Факт по статьям'"), НСтр("ru = 'прямых расходов'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ФактПоСтатьямПрямыхРасходов", Заголовок,, 
		Ложь,, ИмяГруппы, "^", ТипЧисло15_2,, Ложь,,,, ФорматКолонокСумм);
	
КонецПроцедуры

Процедура ДобавитьГруппу_ПрогнозныеСроки(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если ОпцииДоступности.ЭтоPM_Проф Тогда
		Возврат;
	КонецЕсли;
	
	ИмяГруппы = "ПрогнозныеСрокиПроектныхЗадач";
	
	ТипДатаБезВремени = ОписанияТипов.ТипДатаБезВремени;
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Прогнозные сроки'"),, Истина,,, "ГруппаРасчетСроков",, Ложь,,);
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Начало'"), НСтр("ru = 'прогноз'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ДатаНачалаПрогноз", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^", ТипДатаБезВремени,, Истина, Истина,,, "ДФ=dd.MM.yyyy",, Истина);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "ДатаНачалаПрогноз", 
		НСтр("ru = 'Прогнозная дата начала задачи.'"));
		
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Завершение'"), НСтр("ru = 'прогноз'"));
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "ДатаЗавершенияПрогноз", Заголовок,, 
		Ложь, 10, ИмяГруппы, "^", ТипДатаБезВремени,, Истина, Истина,,, "ДФ=dd.MM.yyyy",, Истина);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "ДатаЗавершенияПрогноз", 
		НСтр("ru = 'Прогнозная дата завершения задачи.'"));
	
	ТипКолонки = Новый ОписаниеТипов("ПеречислениеСсылка.упоСтатусОтчетыСтатусыСроков");
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, "СтатусСроков", НСтр("ru = 'Статус сроков'"),, 
		Ложь, 12, ИмяГруппы, "^", ТипКолонки,, Истина, Истина,,,,, Истина);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "СтатусСроков", 
		НСтр("ru = 'Оценка соответствия прогнозных и плановых сроков.'"));
		
КонецПроцедуры

Процедура ДобавитьГруппу_Трудозатраты(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	УчитыватьТрудозатратыПриРасчетеГотовности = ОпцииДоступности.УчитыватьТрудозатратыПриРасчетеГотовности;
	
	ИмяГруппы = "Трудозатраты";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Трудозатраты (Часы)'"),, Истина,,, "ГруппаТрудовыеРесурсы",, Ложь,,);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты план'"), НСтр("ru = 'по ролям (предв.)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыТП", Заголовок, 
		ИмяГруппы, УчитыватьТрудозатратыПриРасчетеГотовности);
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьТрудозатраты", 
		НСтр("ru = '%Т по Р (предв.)'"), ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты'"), НСтр("ru = 'план по ролям (оконч.)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыТП_ОкончРоли", Заголовок, 
		ИмяГруппы, УчитыватьТрудозатратыПриРасчетеГотовности);
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьТрудозатратыОкончРоли", 
		НСтр("ru = '%Т по Р (оконч.)'"), ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты'"), НСтр("ru = 'план по ТР'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыТП_ОкончТР", Заголовок, ИмяГруппы);
	
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ВыполнимостьТрудозатратыОкончТР", 
		НСтр("ru = '%Т по ТР'"), ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Отклонение, ч'"), НСтр("ru = '(Роли оконч. ур. от ТР)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыТП_ОтклонениеТРотОкончРоли", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты БП'"), НСтр("ru = 'по ролям (предв.)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыБП", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты БП'"), НСтр("ru = 'по ролям (оконч.)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыБП_ОкончРоли", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты БП'"), НСтр("ru = 'по ТР'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыБП_ОкончТР", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты версии'"), НСтр("ru = 'по ролям (предв.)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыВерсия", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты версии'"), НСтр("ru = 'по ролям (оконч.)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыВерсия_ОкончРоли", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты версии'"), НСтр("ru = 'по ТР'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыВерсия_ОкончТР", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (V)'"), НСтр("ru = 'план, ч'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыКоличествоПланVчас", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = '% от Объема V '"), НСтр("ru = 'план ч.'"));
	ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, "ТрудозатратыФОбъемыПланV", Заголовок, ИмяГруппы);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Трудозатраты'"), НСтр("ru = 'факт'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ТрудозатратыФ", Заголовок, ИмяГруппы);
	
КонецПроцедуры

Процедура ДобавитьГруппу_СтруктураСтоимости(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если Не ОпцииДоступности.ДоступнаФинИнформация Тогда
		Возврат;
	КонецЕсли;
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	
	ИмяГруппы = "СтруктураСтоимости";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Структура стоимости'"),, Истина,,, "Трудозатраты",, Ложь,,);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доход план'"), НСтр("ru = 'Произв'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходПланЗаВычетомСССП", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объем план'"), НСтр("ru = 'Произв'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланЗаВычетомСССП", Заголовок, 
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доходы (П)'"), НСтр("ru = 'резерв РПО'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходПланРезервРПО", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (П)'"), НСтр("ru = 'резерв РПО'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланРезервРПО", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доходы (П)'"), НСтр("ru = 'резерв РК'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходПланРезервРК", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (П)'"), НСтр("ru = 'резерв РК'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланРезервРК", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доходы (П)'"), НСтр("ru = 'резерв Прочие'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходПланРезервПрочие", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (П)'"), НСтр("ru = 'резерв Прочие'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыПланРезервПрочие", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доход факт'"), НСтр("ru = 'Произв'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходФактЗаВычетомСССП", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объем факт'"), НСтр("ru = 'Произв'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыФактЗаВычетомСССП", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доходы (Ф)'"), НСтр("ru = 'резерв РПО'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходФактРезервРПО", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (Ф)'"), НСтр("ru = 'резерв РПО'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыФактРезервРПО", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доходы (Ф)'"), НСтр("ru = 'резерв РК'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходФактРезервРК", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (Ф)'"), НСтр("ru = 'резерв РК'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыФактРезервРК", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Доходы (Ф)'"), НСтр("ru = 'резерв Прочие'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ДоходФактРезервПрочие", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
	Заголовок = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Объемы (Ф)'"), НСтр("ru = 'резерв Прочие'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "ОбъемыФактРезервПрочие", Заголовок,
		ИмяГруппы,,,, ФорматКолонокСумм);
	
КонецПроцедуры

Процедура ДобавитьГруппу_ОсвоенныеОбъемы(СоответствиеКолонок, ОпцииДоступности, ОписанияТипов, ОписанияФорматов, ШаблонСПереносом)
	
	Если Не ОпцииДоступности.ДоступнаФинИнформация Тогда
		Возврат;
	КонецЕсли;
	
	ФорматКолонокСумм = ОписанияФорматов.ФорматКолонокСумм;
	
	ИмяГруппы = "ГруппаОсвоенныеОбъемы";
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, ИмяГруппы, 
		НСтр("ru = 'Освоенные объемы'"),, Истина,,, "СтруктураСтоимости",, Ложь,,);
	
	Подсказка = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'EV - Плановая стоимость выполненных работ'"), 
		НСтр("ru = '(Расход план (BAC) * % гот.)'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "EV", НСтр("ru = 'EV'"), ИмяГруппы,,,, ФорматКолонокСумм);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "EV", Подсказка);
	
	Подсказка = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Индекс выполнения стоимости'"), 
		НСтр("ru = '(EV / Расход факт (AC))'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "CPI", НСтр("ru = 'CPI, %'"), ИмяГруппы);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "CPI", Подсказка);
	
	Подсказка = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Индекс выполнения сроков'"), 
		НСтр("ru = '(EV / Расход (Т) (PV))'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "SPI", НСтр("ru = 'SPI, %'"), ИмяГруппы);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "SPI", Подсказка);
	
	Подсказка = СтрШаблон(ШаблонСПереносом, НСтр("ru = 'Индекс производительности до завершения'"),
		НСтр("ru = '(Расход план (BAC) – EV)/(Расход план (BAC) – Расход факт (AC) )'"));
	ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, "TCPI", НСтр("ru = 'TCPI, %'"), ИмяГруппы);
	ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, "TCPI", Подсказка);
	
КонецПроцедуры

// Добавляет колонку структуры проекта в расширении.
//
// Параметры:
//  СоответствиеКолонок							 - Соответствие	- добавляемые колонки.
//  УчитыватьТрудозатратыПриРасчетеГотовности	 - Булево	 - 
//  ДопИнформация								 - Структура - 
//
Процедура ДобавитьКолонкуПрограммноПереопределяемый(СоответствиеКолонок, УчитыватьТрудозатратыПриРасчетеГотовности, 
																										ДопИнформация)	
КонецПроцедуры

// Возвращает перечень колонок, содержимое которых является финансовой информацией 
// и нуждается в дополнительном контроля прав при выводе на формы.
//
// Параметры:
//  ДоступнаФинИнформация	 - Булево - признако полной доступности всей финансовой информации. 
// 
// Возвращаемое значение:
//   - Соответствие
//
Функция КолонкиФинансовойИнформации(ДоступнаФинИнформация = Ложь) Экспорт
	
	КолонкиФин = Новый Соответствие;
	
	Если ДоступнаФинИнформация Тогда
		Возврат КолонкиФин;
	КонецЕсли;	
	
	КолонкиФин.Вставить("CPI", 						Истина);
	КолонкиФин.Вставить("EV", 						Истина);
	КолонкиФин.Вставить("SPI", 						Истина);
	КолонкиФин.Вставить("TCPI", 					Истина);
	КолонкиФин.Вставить("ВключитьПланДоходовВБДДС", 	Истина);
	КолонкиФин.Вставить("ВключитьПланРасходовВБДДС", 	Истина);
	КолонкиФин.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", Истина);
	КолонкиФин.Вставить("ВыплатыПлан", 				Истина);
	КолонкиФин.Вставить("ВыплатыПланБазовый", 		Истина);
	КолонкиФин.Вставить("ВыплатыПланВерсия", 		Истина);
	КолонкиФин.Вставить("ВыплатыФакт", 				Истина);
	КолонкиФин.Вставить("ВыполнимостьВыплаты", 		Истина);
	КолонкиФин.Вставить("ВыполнимостьДоход", 		Истина);
	КолонкиФин.Вставить("ВыполнимостьОбъемы", 		Истина);
	КолонкиФин.Вставить("ВыполнимостьОбъемыV", 		Истина);
	КолонкиФин.Вставить("ВыполнимостьОбъемыV_Р", 	Истина);
	КолонкиФин.Вставить("ВыполнимостьПоступления", 	Истина);
	КолонкиФин.Вставить("ВыполнимостьРасход", 		Истина);
	КолонкиФин.Вставить("ВыполнимостьФОТ", 			Истина);
	КолонкиФин.Вставить("ВыполнимостьФОТРасчетный", Истина);
	КолонкиФин.Вставить("ДоходПлан", 				Истина);
	КолонкиФин.Вставить("ДоходПланБазовый", 		Истина);
	КолонкиФин.Вставить("ДоходПланВерсия", 			Истина);
	КолонкиФин.Вставить("ДоходПланЗаВычетомСССП", 	Истина);
	КолонкиФин.Вставить("ДоходПланРезервПрочие", 	Истина);
	КолонкиФин.Вставить("ДоходПланРезервРК", 		Истина);
	КолонкиФин.Вставить("ДоходПланРезервРПО", 		Истина);
	КолонкиФин.Вставить("ДоходФакт", 				Истина);
	КолонкиФин.Вставить("ДоходФактЗаВычетомСССП", 	Истина);
	КолонкиФин.Вставить("ДоходФактРезервПрочие", 	Истина);
	КолонкиФин.Вставить("ДоходФактРезервРК", 		Истина);
	КолонкиФин.Вставить("ДоходФактРезервРПО", 		Истина);
	КолонкиФин.Вставить("НормаСтоимостиТрудовыхРесурсов", Истина);
	КолонкиФин.Вставить("ОбъемВыполнимостьТ", 		Истина);
	КолонкиФин.Вставить("ОбъемПланТ", 				Истина);
	КолонкиФин.Вставить("ОбъемыПланV_Р", 			Истина);
	КолонкиФин.Вставить("ОбъемыПланБазовый", 		Истина);
	КолонкиФин.Вставить("ОбъемыПланБазовыйV", 		Истина);
	КолонкиФин.Вставить("ОбъемыПланБазовыйV_Р", 	Истина);
	КолонкиФин.Вставить("ОбъемыПланВерсия", 		Истина);
	КолонкиФин.Вставить("ОбъемыПланВерсияV", 		Истина);
	КолонкиФин.Вставить("ОбъемыПланВерсияV_Р", 		Истина);
	КолонкиФин.Вставить("ОбъемыПланЗаВычетомСССП", 	Истина);
	КолонкиФин.Вставить("ОбъемыПланРезервПрочие", 	Истина);
	КолонкиФин.Вставить("ОбъемыПланРезервРК", 		Истина);
	КолонкиФин.Вставить("ОбъемыПланРезервРПО", 		Истина);
	КолонкиФин.Вставить("ОбъемыФакт", 				Истина);
	КолонкиФин.Вставить("ОбъемыФактV", 				Истина);
	КолонкиФин.Вставить("ОбъемыФактV_Р", 			Истина);
	КолонкиФин.Вставить("ОбъемыФактЗаВычетомСССП", 	Истина);
	КолонкиФин.Вставить("ОбъемыФактРезервПрочие", 	Истина);
	КолонкиФин.Вставить("ОбъемыФактРезервРК", 		Истина);
	КолонкиФин.Вставить("ОбъемыФактРезервРПО", 		Истина);
	КолонкиФин.Вставить("ПланБДРДоход", 			Истина);
	КолонкиФин.Вставить("ПланБДРРасход", 			Истина);
	КолонкиФин.Вставить("ПланДДСВыплаты", 			Истина);
	КолонкиФин.Вставить("ПланДДСПоступления", 		Истина);
	КолонкиФин.Вставить("ПланПоСтатьямПрямыхРасходов", Истина);
	КолонкиФин.Вставить("ПоступленияПлан", 			Истина);
	КолонкиФин.Вставить("ПоступленияПланБазовый", 	Истина);
	КолонкиФин.Вставить("ПоступленияПланВерсия", 	Истина);
	КолонкиФин.Вставить("ПоступленияФакт", 			Истина);
	КолонкиФин.Вставить("РасходВыполнимостьТ", 		Истина);
	КолонкиФин.Вставить("РасходПлан", 				Истина);
	КолонкиФин.Вставить("РасходПланБазовый", 		Истина);
	КолонкиФин.Вставить("РасходПланВерсия", 		Истина);
	КолонкиФин.Вставить("РасходПланТ", 				Истина);
	КолонкиФин.Вставить("РасходФакт", 				Истина);
	КолонкиФин.Вставить("ФактПоСтатьямПрямыхРасходов", Истина);
	КолонкиФин.Вставить("ФОТПлан", 					Истина);
	КолонкиФин.Вставить("ФОТПланВерсия", 			Истина);
	КолонкиФин.Вставить("ФОТРасчетный", 			Истина);
	КолонкиФин.Вставить("ФОТФакт", 					Истина);
	КолонкиФин.Вставить("ФОТФактПоБДР", 			Истина);
	КолонкиФин.Вставить("ФОТФактПоТабелю", 			Истина);
	
	Возврат КолонкиФин;
	
КонецФункции

Функция КолонкаДоступна(ИмяКолонки, КолонкиПроверки, ОтключитьПроверку)
		
	Если ОтключитьПроверку Тогда
		Результат = Истина;
	Иначе
		Результат = КолонкиПроверки.Получить(ИмяКолонки) <> Неопределено;
	КонецЕсли;	
	
	Возврат Результат; 
	
КонецФункции	

#КонецОбласти

#Область РасчетЗначенийОсобыхКолонок

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиент  Тогда

Функция ПолучитьСписокИзменяемыхРеквизитов() Экспорт
	
	// Список реквизитов, которые пользователь может изменить и записать в базу.  	
	СписокИзменяемыхРеквизитов = Новый СписокЗначений;
	
	// Свойства проектных задач.
	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПроектныеЗадачи";
	СписокЭлементовТаблицы = Новый СписокЗначений;
	НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
	СписокЭлементовТаблицы.Добавить("НазваниеЗадачи", "НазваниеЗадачи");
	СписокЭлементовТаблицы.Добавить("РежимВвода", "РучнойВводСроков");
	СписокЭлементовТаблицы.Добавить("Длительность", "ДлительностьМоделиПакетаРабот");
	СписокЭлементовТаблицы.Добавить("ПодчиненныйПроект", "ПодчиненныйПроект");
	СписокЭлементовТаблицы.Добавить("ПодчиненнаяПроектнаяЗадача", "ПодчиненнаяПроектнаяЗадача");
	СписокЭлементовТаблицы.Добавить("ЕдиницаИзмерения", "ЕдиницаНормированияДлительности");
	СписокЭлементовТаблицы.Добавить("ВидОперации", "ВидОперации");	
	СписокЭлементовТаблицы.Добавить("ИДРодителя", "ЗадачаРодитель");
	СписокЭлементовТаблицы.Добавить("ТипЗадачи", "ЭтоМодельПакетаРабот");
	СписокЭлементовТаблицы.Добавить("ТипЗадачи", "ЭтоПакетРабот");
	СписокЭлементовТаблицы.Добавить("ТипЗадачи", "ЭтоВеха");
	СписокЭлементовТаблицы.Добавить("Объект", "Объект");
	СписокЭлементовТаблицы.Добавить("НормаСтоимостиТрудовыхРесурсов", "НормаСтоимостиТрудовыхРесурсов");
	СписокЭлементовТаблицы.Добавить("ЭтоАктируемаяЗадача", "ЭтоАктируемаяЗадача");
	СписокЭлементовТаблицы.Добавить("КритерийРезультата", "КритерийРезультата");
	СписокЭлементовТаблицы.Добавить("ОписаниеРезультата", "ОписаниеРезультата");
	СписокЭлементовТаблицы.Добавить("КалендарьЗадачи", "КалендарьЗадачи");
	СписокЭлементовТаблицы.Добавить("ДлительностьБезУчетаКалендаряПроекта", "ДлительностьБезУчетаКалендаряПроекта");
	СписокЭлементовТаблицы.Добавить("ВключитьТрудРесурсыВПланРасходов", "ВключитьТрудРесурсыВПланРасходов");
	СписокЭлементовТаблицы.Добавить("УровеньПланированияТрудозатратДляБДР", "УровеньПланированияТрудозатратДляБДР");
	СписокЭлементовТаблицы.Добавить("ВключитьМатРесурсыВПланРасходов", "ВключитьМатРесурсыВПланРасходов");
	СписокЭлементовТаблицы.Добавить("ВключитьСубпродуктыВПланДоходов", "ВключитьСубпродуктыВПланДоходов");
	СписокЭлементовТаблицы.Добавить("НормаСтоимости", "НормаСтоимости");
	СписокЭлементовТаблицы.Добавить("НормаСтоимостиОбъемы", "НормаСтоимостиОбъемы");
	СписокЭлементовТаблицы.Добавить("ВключитьПланДоходовВБДДС", "ВключитьПланДоходовВБДДС");
	СписокЭлементовТаблицы.Добавить("ВключитьПланРасходовВБДДС", "ВключитьПланРасходовВБДДС");
	СписокЭлементовТаблицы.Добавить("СхемаОплатыПоУмолчаниюРасходы", "СхемаОплатыПоУмолчаниюРасходы");
	СписокЭлементовТаблицы.Добавить("СхемаОплатыПоУмолчаниюДоходы", "СхемаОплатыПоУмолчаниюДоходы");
	СписокЭлементовТаблицы.Добавить("ВнешняяНормаСтоимостиТрудовыхРесурсов", "ВнешняяНормаСтоимостиТрудовыхРесурсов");
	СписокЭлементовТаблицы.Добавить("ТранслироватьЗатратыПоСубпродуктам", "ТранслироватьЗатратыПоСубпродуктам");
	СписокЭлементовТаблицы.Добавить("ТипСубпродукта", "ТипСубпродукта");
				
	// Связи	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "Связи";
	
	// Сроки	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "Сроки";
	СписокЭлементовТаблицы = Новый СписокЗначений();
	НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
	СписокЭлементовТаблицы.Добавить("ДатаНачала", "ДатаНачалаПлан");
	СписокЭлементовТаблицы.Добавить("ДатаЗавершения", "ДатаЗавершенияПлан");
			
	// Расчетные сроки	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "РасчетныеСроки";
	СписокЭлементовТаблицы = Новый СписокЗначений();
	НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
	СписокЭлементовТаблицы.Добавить("РаннийСтарт", "ДатаРаннегоСтарта");
	СписокЭлементовТаблицы.Добавить("ПозднийСтарт", "ДатаПозднегоСтарта");
	СписокЭлементовТаблицы.Добавить("РаннийФиниш", "ДатаРаннегоФиниша");
	СписокЭлементовТаблицы.Добавить("ПозднийФиниш", "ДатаПозднегоФиниша");
		
	// Фактические сроки	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ФактическиеСроки";
	СписокЭлементовТаблицы = Новый СписокЗначений();
	НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
	СписокЭлементовТаблицы.Добавить("ДатаНачалаФакт", "ДатаНачала");
	СписокЭлементовТаблицы.Добавить("ДатаЗавершенияФакт", "ДатаЗавершения");
		
	// Проценты готовности	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПроцентыГотовности";
	СписокЭлементовТаблицы = Новый СписокЗначений();
	НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
	СписокЭлементовТаблицы.Добавить("ПроцентГотовности", "ПроцентГотовности");
		
	// Статусы	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "Статусы";
	СписокЭлементовТаблицы = Новый СписокЗначений();
	НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
	СписокЭлементовТаблицы.Добавить("Статус", "СтатусЗадачи");
	
	// ТрудовыеРесурсыРоли	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ТрудовыеРесурсыРоли";
	
	// ТрудовыеРесурсыРолиПоПериодам	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ТрудовыеРесурсыРолиПоПериодам";
	
	// НазначенныеТрудовыеРесурсы	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "НазначенныеТрудовыеРесурсы";
	
	// МатериальныеРесурсы	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "МатериальныеРесурсы";	
	// МатериальныеРесурсыПоПодразделениям	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "МатериальныеРесурсыПоПодразделениям";	
	// РаспределениеРасходовПоПериодам	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "МатериальныеРесурсыПоПериодам";
	
	// Субпродукты
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "Субпродукты";	
	// СубпродуктыПоПодразделениям	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "СубпродуктыПоПодразделениям";	
	// РаспределениеДоходовПоПериодам	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "СубпродуктыПоПериодам";
	// ПроектнаяПродукция
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция() Тогда
		НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
		НовыйЭлементСписка.Представление = "ПроектнаяПродукция";
	КонецЕсли;
	
	// Причины отклонений
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПричиныОтклонений() Тогда
		НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
		НовыйЭлементСписка.Представление = "ПричиныОтклонений";
	КонецЕсли;
	
	// ПланДоходов
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПланДоходов";	
	// ПланДоходовПоПодразделениям	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПланДоходовПоПодразделениям";	
	// РаспределениеДоходовПоПериодам	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПланДоходовПоПериодам";
	
	// ПланРасходов
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПланРасходов";	
	// ПланРасходовПоПодразделениям	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПланРасходовПоПодразделениям";	
	// РаспределениеРасходовПоПериодам	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ПланРасходовПоПериодам";
	
	// ДвиженияДенежныхСредств
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "ДвиженияДенежныхСредств";	
	
	// РуководителиПроектныхЗадач	
	НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
	НовыйЭлементСписка.Представление = "РуководителиПроектныхЗадач";
	СписокЭлементовТаблицы = Новый СписокЗначений();
	НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
	СписокЭлементовТаблицы.Добавить("РуководительПЗ", "РуководительПроектнойЗадачи");
	
	// ПрогнозныеСрокиПроектныхЗадач
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
	
		НовыйЭлементСписка = СписокИзменяемыхРеквизитов.Добавить();
		НовыйЭлементСписка.Представление = "ПрогнозныеСрокиПроектныхЗадач";
		СписокЭлементовТаблицы = Новый СписокЗначений();
		НовыйЭлементСписка.Значение = СписокЭлементовТаблицы;
		СписокЭлементовТаблицы.Добавить("ДатаНачалаПрогноз", "ДатаНачалаПрогноз");
		СписокЭлементовТаблицы.Добавить("ДатаЗавершенияПрогноз", "ДатаЗавершенияПрогноз");
		СписокЭлементовТаблицы.Добавить("СтатусСроков", "СтатусСроков");
	
	КонецЕсли;
	
	Возврат СписокИзменяемыхРеквизитов;
	
КонецФункции
	
#КонецЕсли
	
#КонецОбласти

#Область РасчетОтклоненийПриРасчетеИтогов

Функция НужноСчитатьОтклоненияПриРасчетеИтогов(СписокКолонок) Экспорт
	
	Результат = Новый Структура;
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("МесяцНачалаПоПредварительномуУровнюРолейОтклонение");
	МассивКолонок.Добавить("МесяцОкончанияПоПредварительномуУровнюРолейОтклонение");
	МассивКолонок.Добавить("МесяцНачалаПоПредварительномуУровнюРолей");
	МассивКолонок.Добавить("МесяцОкончанияПоПредварительномуУровнюРолей");
	Результат.Вставить("НужноСчитатьОтклонениеСроковПоПредварительномуУровню", 
		ИспользуетсяКолонкаИзМассива(СписокКолонок, МассивКолонок));
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("МесяцНачалаПоОкончательномуУровнюРолейОтклонение");
	МассивКолонок.Добавить("МесяцОкончанияПоОкончательномуУровнюРолейОтклонение");
	МассивКолонок.Добавить("МесяцНачалаПоОкончательномуУровнюРолей");
	МассивКолонок.Добавить("МесяцОкончанияПоОкончательномуУровнюРолей");
	Результат.Вставить("НужноСчитатьОтклонениеСроковПоОкончательномуУровню", 
		ИспользуетсяКолонкаИзМассива(СписокКолонок, МассивКолонок));
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("НачалоРаботТР");
	МассивКолонок.Добавить("ОкончаниеРаботТР");
	МассивКолонок.Добавить("НачалоРаботТРОтклонение");
	МассивКолонок.Добавить("ОкончаниеРаботТРОтклонение");
	Результат.Вставить("НужноСчитатьОтклонениеСроковПоТР", 
		ИспользуетсяКолонкаИзМассива(СписокКолонок, МассивКолонок));
	
	Возврат Результат;
	
КонецФункции

Процедура ПосчитатьОтклонениеСроков(НужноСчитатьОтклонения, СтрокаДерева) Экспорт
	
	Если НужноСчитатьОтклонения.НужноСчитатьОтклонениеСроковПоПредварительномуУровню Тогда
		
		Если ЗначениеЗаполнено(СтрокаДерева.МесяцНачалаПоПредварительномуУровнюРолей) Тогда
			СтрокаДерева.МесяцНачалаПоПредварительномуУровнюРолейОтклонение = 
				упоФункцииОбщегоНазначенияКлиентСервер.РазностьДатВМесяцах(СтрокаДерева.МесяцНачалаПоПредварительномуУровнюРолей, СтрокаДерева.ДатаНачала);
		Иначе
			СтрокаДерева.МесяцНачалаПоПредварительномуУровнюРолейОтклонение = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДерева.МесяцОкончанияПоПредварительномуУровнюРолей) Тогда
			СтрокаДерева.МесяцОкончанияПоПредварительномуУровнюРолейОтклонение = 
				упоФункцииОбщегоНазначенияКлиентСервер.РазностьДатВМесяцах(СтрокаДерева.МесяцОкончанияПоПредварительномуУровнюРолей, СтрокаДерева.ДатаЗавершения);
		Иначе
			СтрокаДерева.МесяцОкончанияПоПредварительномуУровнюРолейОтклонение = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НужноСчитатьОтклонения.НужноСчитатьОтклонениеСроковПоОкончательномуУровню Тогда
		
		Если ЗначениеЗаполнено(СтрокаДерева.МесяцНачалаПоОкончательномуУровнюРолей) Тогда
			СтрокаДерева.МесяцНачалаПоОкончательномуУровнюРолейОтклонение = 
				упоФункцииОбщегоНазначенияКлиентСервер.РазностьДатВМесяцах(СтрокаДерева.МесяцНачалаПоОкончательномуУровнюРолей, СтрокаДерева.ДатаНачала);
		Иначе
			СтрокаДерева.МесяцНачалаПоОкончательномуУровнюРолейОтклонение = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДерева.МесяцОкончанияПоОкончательномуУровнюРолей) Тогда
			СтрокаДерева.МесяцОкончанияПоОкончательномуУровнюРолейОтклонение = 
				упоФункцииОбщегоНазначенияКлиентСервер.РазностьДатВМесяцах(СтрокаДерева.МесяцОкончанияПоОкончательномуУровнюРолей, СтрокаДерева.ДатаЗавершения);
		Иначе
			СтрокаДерева.МесяцОкончанияПоОкончательномуУровнюРолейОтклонение = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НужноСчитатьОтклонения.НужноСчитатьОтклонениеСроковПоТР Тогда
		
		Если ЗначениеЗаполнено(СтрокаДерева.НачалоРаботТР) Тогда
			СтрокаДерева.НачалоРаботТРОтклонение = Цел((НачалоДня(СтрокаДерева.НачалоРаботТР) - НачалоДня(СтрокаДерева.ДатаНачала)) / (24*3600));
		Иначе
			СтрокаДерева.НачалоРаботТРОтклонение = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДерева.ОкончаниеРаботТР) Тогда
			СтрокаДерева.ОкончаниеРаботТРОтклонение = Цел((НачалоДня(СтрокаДерева.ОкончаниеРаботТР) - НачалоДня(СтрокаДерева.ДатаЗавершения)) / (24*3600));
		Иначе
			СтрокаДерева.ОкончаниеРаботТРОтклонение = 0;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РасчетЗначенийОсобыхКолонок

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиент Тогда

Процедура РассчитатьАбсолютныеОтклонения(ДеревоЗначений, СтруктураВыводимыхКолонок,
													РабочийКалендарьПроекта, МенеджерыВременныхТаблиц) Экспорт
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		РассчитатьАбсолютныеОтклонения(Строка, СтруктураВыводимыхКолонок, РабочийКалендарьПроекта, МенеджерыВременныхТаблиц);	
	КонецЦикла;
	
	Если ТипЗнч(ДеревоЗначений) = Тип("СтрокаДереваЗначений") Тогда
		РассчитатьАбсолютныеОтклоненияВСтроке(ДеревоЗначений, Истина, СтруктураВыводимыхКолонок, РабочийКалендарьПроекта, МенеджерыВременныхТаблиц, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьАбсолютныеОтклоненияВСтроке(СтрокаДерева, ПересчитыватьБуфер,
								СтруктураВыводимыхКолонок, РабочийКалендарьПроекта, 
								МенеджерыВременныхТаблиц, ОтклонениеИзменилось, 
								ЕдиницаВремениПоУмолчанию = Неопределено) Экспорт
								
	Если ЗначениеЗаполнено(СтрокаДерева.ЕдиницаИзмерения) Тогда
		ЕдиницаИзмерения = СтрокаДерева.ЕдиницаИзмерения;
	Иначе
		ЕдиницаИзмерения = ЕдиницаВремениПоУмолчанию;		
	КонецЕсли; 								
								
	Если НЕ (ПересчитыватьБуфер И ЗначениеЗаполнено(ЕдиницаИзмерения)) Тогда
		Возврат;
	КонецЕсли;
	
	МассивАбсОтклонений = упоСтруктураПроектаКолонкиКлиентСервер.ПолучитьМассивАбсолютныхОтклонений();
	Для Каждого СтруктураВыполнимости Из МассивАбсОтклонений Цикл
		
		Значение1 = СтруктураВыполнимости.Значение1;
		Значение2 = СтруктураВыполнимости.Значение2;
		Результат = СтруктураВыполнимости.Результат;
		
		Если СтруктураВыводимыхКолонок.Свойство(Результат) 
			И СтруктураВыводимыхКолонок.Свойство(Значение1) 
			И СтруктураВыводимыхКолонок.Свойство(Значение2) Тогда
			
			Если ЗначениеЗаполнено(СтрокаДерева[Значение1])
				И ЗначениеЗаполнено(СтрокаДерева[Значение2]) Тогда
				
				РезультатДо = СтрокаДерева[Результат];
				
				Если Результат = "ОтклонениеПоОкончанию" 
					Или Результат = "ОтклонениеПоОкончаниюДП" 
					Или Результат = "ОтклонениеПоНачалуБП" 
					Или Результат = "ОтклонениеПоНачалуДП"
					Или Результат = "ОтклонениеПоНачалуОтВерсии"
					Или Результат = "ОтклонениеПоОкончаниюОтВерсии"Тогда
					
					Дата1 = НачалоДня(СтрокаДерева[Значение2]);
					Дата2 = НачалоДня(СтрокаДерева[Значение1]);
					
					Если Дата1 = Дата2 Тогда
						СтрокаДерева[Результат] = 0;
					Иначе
						ЗнакОтклонения = -1;
						
						Если Дата2 < Дата1 Тогда
							ТемпДата = Неопределено;
							ТемпДата = Дата2;
							Дата2 = Дата1;
							Дата1 = ТемпДата;
							ЗнакОтклонения = 1;
						КонецЕсли;	
						
						СтрокаДерева[Результат] = ЗнакОтклонения * упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьДлительность
						(Дата1, Дата2,
							ЕдиницаИзмерения, СтрокаДерева.КалендарьЗадачи, РабочийКалендарьПроекта, 
							СтрокаДерева.ДлительностьБезУчетаКалендаряПроекта,
							МенеджерыВременныхТаблиц);
					КонецЕсли;
					
				Иначе
					
					СтрокаДерева[Результат] = СтрокаДерева[Значение2] - СтрокаДерева[Значение1];
					
				КонецЕсли;
				
				Если Не ОтклонениеИзменилось Тогда
					ОтклонениеИзменилось = РезультатДо <> СтрокаДерева[Результат];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли
		
	КонецЦикла;
		
КонецПроцедуры

Процедура РассчитатьСтатусСроков(СтрокаДерева, ПересчитыватьСтатусСроков, НачалоТекущегоДня, ЭтоВеха) Экспорт
	
	Если Не ПересчитыватьСтатусСроков Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДерева.ПроцентГотовности = 100 Тогда
		
		СтрокаДерева.СтатусСроков = ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыСроков.Выполнено");
		
	ИначеЕсли НачалоДня(СтрокаДерева.ДатаНачала) > НачалоТекущегоДня Тогда
		
		СтрокаДерева.СтатусСроков = ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыСроков.План");
		
	Иначе
		
		Если ЭтоВеха И НачалоТекущегоДня >= СтрокаДерева.ДатаЗавершения Тогда
				
			СтрокаДерева.СтатусСроков = ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыСроков.Задержка");	
			Возврат;
			
		КонецЕсли;
		
		Если СтрокаДерева.Длительность = 0 Тогда
			Возврат;
		КонецЕсли;
		
		РПВ = (1 + (СтрокаДерева.ОтставаниеОтТекПлана / СтрокаДерева.Длительность)) * 100;
		
		Если РПВ - СтрокаДерева.ПроцентГотовности > 25 Тогда 
			
		 	СтрокаДерева.СтатусСроков = ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыСроков.Срыв");
			
		ИначеЕсли РПВ <= СтрокаДерева.ПроцентГотовности Тогда
			
			СтрокаДерева.СтатусСроков = ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыСроков.ПоГрафику");
			
		Иначе
			
			СтрокаДерева.СтатусСроков = ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыСроков.Задержка");
			
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

Функция РассчитатьОтклонениеПоДлительностиОтПоДатам(СтрокаДерева,
	КолонкаДатаНачала, 
	КолонкаДатаЗавершения, 
	ПараметрыРасчета, 
	МенеджерыВременныхТаблиц = Неопределено) Экспорт
	
	ЕдиницаВремениПоУмолчанию = ПараметрыРасчета.ЕдиницаВремениПоУмолчанию;
	РабочийКалендарьПроекта = ПараметрыРасчета.РабочийКалендарьПроекта;
	
	ЗадачаКРасчетуПоСтатусуИАктируемости = ЭтоЗадачаКРасчетуПоСтатусуИАктируемости(СтрокаДерева, ПараметрыРасчета);
	ЗадачаКРасчетуПоДатеНачала = ЗначениеЗаполнено(СтрокаДерева[КолонкаДатаНачала]);
	
	НуженРасчет = ЗадачаКРасчетуПоСтатусуИАктируемости 
		И ЗадачаКРасчетуПоДатеНачала;
	
	Если Не НуженРасчет Тогда
		Возврат 0; // Возврат
	КонецЕсли;
		
	Если ЗначениеЗаполнено(СтрокаДерева.ЕдиницаИзмерения) Тогда
		ЕдИзм = СтрокаДерева.ЕдиницаИзмерения;
	Иначе 
		ЕдИзм = ЕдиницаВремениПоУмолчанию;
	КонецЕсли;
	
	ДлительностьПоВерсии = упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьДлительность(
		СтрокаДерева[КолонкаДатаНачала], 
		СтрокаДерева[КолонкаДатаЗавершения], 
		ЕдИзм, 
		СтрокаДерева.КалендарьЗадачи, 
		РабочийКалендарьПроекта, 
		СтрокаДерева.ДлительностьБезУчетаКалендаряПроекта,
		МенеджерыВременныхТаблиц);
		
	Возврат СтрокаДерева.Длительность - ДлительностьПоВерсии;
	
КонецФункции

Функция РассчитатьДлительностьКалендарныеДни(СтрокаДерева, ПересчитыватьДлительностьКалендарныеДни) Экспорт
	
	Если ПересчитыватьДлительностьКалендарныеДни 
		И ЗначениеЗаполнено(СтрокаДерева.ДатаЗавершения) 
		И ЗначениеЗаполнено(СтрокаДерева.ДатаНачала) Тогда
		
		СтрокаДерева.ДлительностьКалендарныеДни = 1 +((НачалоДня(СтрокаДерева.ДатаЗавершения) - НачалоДня(СтрокаДерева.ДатаНачала)) / 86400);
		
	КонецЕсли; 	
	
КонецФункции

Процедура РассчитатьБуферПозднийСтартРаннийСтарт(СтрокаДерева, ПересчитыватьБуфер, РабочийКалендарьПроекта, МенеджерыВременныхТаблиц) Экспорт
	
	Если ПересчитыватьБуфер И ЗначениеЗаполнено(СтрокаДерева.ЕдиницаИзмерения) 
		И ЗначениеЗаполнено(СтрокаДерева.ПозднийСтарт) И ЗначениеЗаполнено(СтрокаДерева.РаннийСтарт) Тогда
		
		ПозднийСтартРасчет = СтрокаДерева.ПозднийСтарт;
		РаннийСтартРасчет = СтрокаДерева.РаннийСтарт;
		
		СтрокаДерева.БуферПозднийСтартРаннийСтарт = упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьДлительность(
			РаннийСтартРасчет, ПозднийСтартРасчет, СтрокаДерева.ЕдиницаИзмерения, СтрокаДерева.КалендарьЗадачи, 
			РабочийКалендарьПроекта, СтрокаДерева.ДлительностьБезУчетаКалендаряПроекта,
			МенеджерыВременныхТаблиц);
		
	КонецЕсли;	
		
КонецПроцедуры

Процедура РассчитатьОтставаниеОтТекПлана(СтрокаДерева, ПересчитыватьОтставаниеОтТекПлана, РабочийКалендарьПроекта,
	МенеджерыВременныхТаблиц, ЕдиницаВремениПоУмолчанию, НачалоТекущегоДня) Экспорт
	
	Если Не ПересчитыватьОтставаниеОтТекПлана Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ЕдиницаВремениПоУмолчанию", ЕдиницаВремениПоУмолчанию);
	ПараметрыРасчета.Вставить("НачалоТекущегоДня", НачалоТекущегоДня);
	ПараметрыРасчета.Вставить("РабочийКалендарьПроекта", РабочийКалендарьПроекта);
	ПараметрыРасчета.Вставить("ТолькоАктируемые", Ложь);
	
	РассчитатьОтставаниеОтПлана(СтрокаДерева, "ОтставаниеОтТекПлана", "ДатаЗавершения", 
		ПараметрыРасчета, МенеджерыВременныхТаблиц);
	
КонецПроцедуры

Процедура РассчитатьОтставаниеОтПлана(СтрокаДерева, 
	ИмяКолонкиОтставание, 
	ИмяКолонкиДатаЗавершения,
	ПараметрыРасчета, 
	МенеджерыВременныхТаблиц) Экспорт
	
	ЕдиницаВремениПоУмолчанию = ПараметрыРасчета.ЕдиницаВремениПоУмолчанию;
	НачалоТекущегоДня = ПараметрыРасчета.НачалоТекущегоДня;
	РабочийКалендарьПроекта = ПараметрыРасчета.РабочийКалендарьПроекта;
	
	ЗадачаКРасчетуПоСтатусуИАктируемости = ЭтоЗадачаКРасчетуПоСтатусуИАктируемости(СтрокаДерева, ПараметрыРасчета);
	ЗадачаКРасчетуПоДатеЗавершения = ЗначениеЗаполнено(СтрокаДерева[ИмяКолонкиДатаЗавершения]) 
		И НачалоДня(СтрокаДерева[ИмяКолонкиДатаЗавершения]) <> НачалоТекущегоДня;
	
	НуженРасчет = ЗадачаКРасчетуПоСтатусуИАктируемости 
		И ЗадачаКРасчетуПоДатеЗавершения;
		
	Если Не НуженРасчет Тогда
		СтрокаДерева[ИмяКолонкиОтставание] = 0;
		Возврат; // Возврат
	КонецЕсли;
	
	Если СтрокаДерева[ИмяКолонкиДатаЗавершения] > НачалоТекущегоДня Тогда
		ЗнакОтклонения = -1;
		СуткиВСекундах = 86400; // 24ч
		ДатаНачала = НачалоТекущегоДня + СуткиВСекундах;
		ДатаЗавершения = СтрокаДерева[ИмяКолонкиДатаЗавершения];
	Иначе
		ЗнакОтклонения = 1;
		ДатаНачала = НачалоДня(СтрокаДерева[ИмяКолонкиДатаЗавершения]);
		ДатаЗавершения = НачалоТекущегоДня;
	КонецЕсли;
	
	ЕдИзм = ?(ЗначениеЗаполнено(СтрокаДерева.ЕдиницаИзмерения), СтрокаДерева.ЕдиницаИзмерения, ЕдиницаВремениПоУмолчанию);
	
	Длительность = упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьДлительность(
			ДатаНачала, 
			ДатаЗавершения, 
			ЕдИзм, 
			СтрокаДерева.КалендарьЗадачи, 
			РабочийКалендарьПроекта, 
			СтрокаДерева.ДлительностьБезУчетаКалендаряПроекта,
			МенеджерыВременныхТаблиц);
	
	СтрокаДерева[ИмяКолонкиОтставание] = ЗнакОтклонения * Длительность;
	
КонецПроцедуры

Функция ВыведенныеКолонкиОтставания(СтруктураВыводимыхКолонок, СравниватьСПоказателямиПоВерсии) Экспорт
	
	ВыведенныеКолонки = Новый Массив;
	
	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить(СтруктураКолонкиОтставание("ОтставаниеОтТекПлана", "ДатаЗавершения"));
	Если СравниватьСПоказателямиПоВерсии Тогда
		ИменаКолонок.Добавить(СтруктураКолонкиОтставание("ОтставаниеОтВерсии", "ДатаЗавершенияВерсия"));
	КонецЕсли;
	ИменаКолонок.Добавить(СтруктураКолонкиОтклонениеОтставаниеОтБП("ОтставаниеОтБазПлана"));
	ИменаКолонок.Добавить(СтруктураКолонкиОтклонениеОтставаниеОтДП("ОтставаниеОтДогПлана"));
	ИменаКолонок.Добавить(СтруктураКолонкиОтклонениеОтставаниеОтДП("ОтставаниеОтДогПланаАкт", Истина));
	
	Для Каждого Колонка Из ИменаКолонок Цикл
		Если СтруктураВыводимыхКолонок.Свойство(Колонка.ИмяКолонки) Тогда
			ВыведенныеКолонки.Добавить(Колонка);
		КонецЕсли;
	КонецЦикла;

	Возврат ВыведенныеКолонки;
	
КонецФункции

Функция ВыведенныеКолонкиОтклонения(СтруктураВыводимыхКолонок) Экспорт
	
	ВыведенныеКолонки = Новый Массив;
	
	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить(СтруктураКолонкиОтклонениеОтставаниеОтБП("ОтклонениеПоДлительностиОтБазПлана"));
	ИменаКолонок.Добавить(СтруктураКолонкиОтклонениеОтставаниеОтДП("ОтклонениеПоДлительностиОтДогПлана"));
	ИменаКолонок.Добавить(СтруктураКолонкиОтклонениеОтставаниеОтДП("ОтклонениеПоДлительностиОтДогПланаАкт", Истина));

	Для Каждого Колонка Из ИменаКолонок Цикл
		Если СтруктураВыводимыхКолонок.Свойство(Колонка.ИмяКолонки) Тогда
			ВыведенныеКолонки.Добавить(Колонка);
		КонецЕсли;
	КонецЦикла;

	Возврат ВыведенныеКолонки;
	
КонецФункции

Функция СтруктураКолонкиОтклонениеОтставаниеОтДП(ИмяКолонкиОтставаниеОтклонение, ТолькоАктируемые = Ложь) Экспорт
	
	Возврат СтруктураКолонкиОтставание(ИмяКолонкиОтставаниеОтклонение, 
		"ДатаЗавершенияДоговорной", "ДатаНачалаДоговорной", ТолькоАктируемые);
	
КонецФункции

Функция СтруктураКолонкиОтклонениеОтставаниеОтБП(ИмяКолонкиОтставаниеОтклонение) Экспорт
	
	Возврат СтруктураКолонкиОтставание(ИмяКолонкиОтставаниеОтклонение, 
		"ДатаЗавершенияБазовый", "ДатаНачалаБазовый");
	
КонецФункции

Функция СтруктураКолонкиОтставание(ИмяКолонки, ИмяКолонкиДатаЗавершения, ИмяКолонкиДатаНачала = "", ТолькоАктируемые = Ложь)
	
	СтруктураКолонки = Новый Структура;
	СтруктураКолонки.Вставить("ИмяКолонки", 				ИмяКолонки);
	СтруктураКолонки.Вставить("ИмяКолонкиДатаЗавершения", 	ИмяКолонкиДатаЗавершения);
	СтруктураКолонки.Вставить("ИмяКолонкиДатаНачала", 		ИмяКолонкиДатаНачала);
	СтруктураКолонки.Вставить("ТолькоАктируемые", 			ТолькоАктируемые);
	
	Возврат СтруктураКолонки;
	
КонецФункции

Функция ЭтоЗадачаКРасчетуПоСтатусуИАктируемости(СтрокаДерева, ПараметрыРасчета)
	
	ЗадачаКРасчетуПоСтатусу = 
		Не (СтрокаДерева.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Завершена")
			Или СтрокаДерева.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта"));
	ЗадачаКРасчетуПоАктируемости = Не ПараметрыРасчета.ТолькоАктируемые Или СтрокаДерева.ЭтоАктируемаяЗадача;
	
	НуженРасчет = ЗадачаКРасчетуПоСтатусу 
		И ЗадачаКРасчетуПоАктируемости;
		
	Возврат НуженРасчет;
		
КонецФункции

#КонецЕсли

#КонецОбласти

#Область ДополнениеТекстаЗапросаПолученияДанныхДляСтруктура

Функция ДобавитьПоказателиВЗапрос(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, пТекстПостроителя, пПараметры) Экспорт
	
	Если СтруктураВыводимыхДопКолонок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДополнитьСтруктуруКолонокЗависимостями(СтруктураВыводимыхДопКолонок);
	
	ДополнитьСтруктуруКолонокИтогов(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов);
	
	ТекстыЗамены = Новый Структура;
	ТекстыЗамены.Вставить("ПоказателиВИтоговойВыборкеДляПЗ", "");
	ТекстыЗамены.Вставить("ПоказателиВИтоговойВыборкеНеПЗ", "");
	ТекстыЗамены.Вставить("ТекстыЗапросов", "");
	ТекстыЗамены.Вставить("СоединенияТаблицДопПоказателей", "");
	
	ДоступностьФинИнфо = упоРазграничениеДоступаВызовСервера.обДоступностьФинансовойИнформации();
	
	ДоступКФинИнфеОтсутствует = ДоступностьФинИнфо = "Отсутствует";
	ДоступнаФинИнформация = Не ДоступКФинИнфеОтсутствует;
	
	Если ДоступнаФинИнформация Тогда
		ДобавитьПоказателиВЗапрос_ДоходРасход(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены);
		ДобавитьПоказателиВЗапрос_ПоступленияВыплаты(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены);
		ДобавитьПоказателиВЗапрос_СтруктураСтоимости(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены);
		ДобавитьПоказателиВЗапрос_ФОТ(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены);
		ДобавитьПоказателиВЗапрос_ПрямыеРасходы(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены);
	КонецЕсли;
	ДобавитьПоказателиВЗапрос_Объемы(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены, ДоступнаФинИнформация);
	ДобавитьПоказателиВЗапрос_ОбъемыV(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены, ДоступнаФинИнформация);
	ДобавитьПоказателиВЗапрос_ОбъемыV_Р(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены, ДоступнаФинИнформация);
	ДобавитьПоказателиВЗапрос_ДатаНачалаОкончания(СтруктураВыводимыхДопКолонок, ТекстыЗамены, пПараметры);
	ДобавитьПоказателиВЗапрос_Трудозатраты(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены, пПараметры);
	ДобавитьПоказателиВЗапрос_Результат(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	ДобавитьПоказателиВЗапрос_ОсновноеЗадание(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	ДобавитьПоказателиВЗапрос_ЗаданияПодразделениям(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	ДобавитьПоказателиВЗапрос_ОсновнаяРоль(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	ДобавитьПоказателиВЗапрос_КоличествоРолей(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	ДобавитьПоказателиВЗапрос_КоличествоИсполнителей(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	ДобавитьПоказателиВЗапрос_ФактическиеСроки(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	ДобавитьПоказателиВЗапрос_СрокиПоЗагрузкеРолей(СтруктураВыводимыхДопКолонок, ТекстыЗамены, пПараметры);       
	ДобавитьПоказателиВЗапрос_СрокиПоЗагрузкеТР(СтруктураВыводимыхДопКолонок, ТекстыЗамены, пПараметры);       
	ДобавитьПоказателиВЗапрос_ПрогнозныеСрокиПроектныхЗадач(СтруктураВыводимыхДопКолонок, ТекстыЗамены);
	
	// Процедура для добавления текста запроса по новым показателям из расширения
	ДобавитьПоказателиВЗапрос_Переопределяемый(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены, пПараметры);
	
	Если ЗначениеЗаполнено(ТекстыЗамены.ТекстыЗапросов) Тогда
		
		ТекстыЗамены.ТекстыЗапросов  = ТекстыЗамены.ТекстыЗапросов + " ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ ";
		ТекстыЗамены.СоединенияТаблицДопПоказателей = "ПО ПЗы.Ссылка = ВР_ДопДанные.Ссылка " + Символы.ПС 
			+ ТекстыЗамены.СоединенияТаблицДопПоказателей; 	
		ТекстПостроителя = пТекстПостроителя;
		ТекстПостроителя = СтрЗаменить(ТекстПостроителя, "ВР_ДопДанные.Ссылка КАК ВР_ДопДанныеСсылка",
		ТекстыЗамены.ПоказателиВИтоговойВыборкеДляПЗ);
		Если ЗначениеЗаполнено(ТекстыЗамены.ПоказателиВИтоговойВыборкеНеПЗ) Тогда
			ТекстПостроителя = СтрЗаменить(ТекстПостроителя, """Доп""", ТекстыЗамены.ПоказателиВИтоговойВыборкеНеПЗ);
		КонецЕсли;
		ТекстПостроителя = СтрЗаменить(ТекстПостроителя, "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ", ТекстыЗамены.ТекстыЗапросов);
		ТекстПостроителя = СтрЗаменить(ТекстПостроителя, "ПО ПЗы.Ссылка = ВР_ДопДанные.Ссылка",
															ТекстыЗамены.СоединенияТаблицДопПоказателей);
		пТекстПостроителя = ТекстПостроителя;
		
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьПоказателиВЗапрос_Трудозатраты(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
																					Знач ТекстыЗамены, пПараметры)
    
	Перем МассивПоказателей, ТекстЗапроса;	
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыТП") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыБП") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыВерсия") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТаблицаПоказателя.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(ТаблицаПоказателя.КоличествоЧасов) КАК _Трудозатраты_
		               |ПОМЕСТИТЬ _ВТ_
		               |ИЗ
		               |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК ТаблицаПоказателя
		               |ГДЕ
		               |	ТаблицаПоказателя.Проект = &Проект
		               |	И ТаблицаПоказателя.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаПоказателя.ПроектнаяЗадача";
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыТП") Тогда
			
			имяВТ = "ВТ_ТрудозатратыТП";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.текВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &текВерсия");
			КонецЕсли; 
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыТП");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
																			"ТрудозатратыТП", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыБП") Тогда
			
			имяВТ = "ВТ_ТрудозатратыБП";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.БазоваяВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &БазоваяВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыБП");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
																			"ТрудозатратыБП", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыВерсия") Тогда
			
			имяВТ = "ВТ_ТрудозатратыВерсия";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.выбВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &выбВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыВерсия");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
																		"ТрудозатратыВерсия", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыТП_ОкончРоли") 
	 ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыТП_ОкончТР") 
	 ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыБП_ОкончРоли") 
	 ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыБП_ОкончТР") 
	 ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыВерсия_ОкончРоли") 
	 ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыВерсия_ОкончТР") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТаблицаПоказателя.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(ТаблицаПоказателя.КоличествоЧасов) КАК _Трудозатраты_
		               |ПОМЕСТИТЬ _ВТ_
		               |ИЗ
		               |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК ТаблицаПоказателя
		               |ГДЕ
		               |	ТаблицаПоказателя.Проект = &Проект
		               |	И ТаблицаПоказателя.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
		               |	И &ОтборПоРесурсу
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаПоказателя.ПроектнаяЗадача";
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыТП_ОкончРоли") Тогда
			
			имяВТ = "ВТ_ТрудозатратыТП_ОкончРоли";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.текВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &текВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыТП_ОкончРоли");
			СоответствиеДляЗамены.Вставить("&ОтборПоРесурсу", "ТаблицаПоказателя.Ресурс Ссылка Справочник.упоРоли");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ТрудозатратыТП_ОкончРоли", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
			
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыТП_ОкончТР") Тогда
			
			имяВТ = "ВТ_ТрудозатратыТП_ОкончТР";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.текВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &текВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыТП_ОкончТР");
			СоответствиеДляЗамены.Вставить("&ОтборПоРесурсу", "ТаблицаПоказателя.Ресурс Ссылка Справочник.упоТрудовыеРесурсы");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ТрудозатратыТП_ОкончТР", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;	
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыБП_ОкончРоли") Тогда
			
			имяВТ = "ВТ_ТрудозатратыБП_ОкончРоли";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.БазоваяВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &БазоваяВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыБП_ОкончРоли");
			СоответствиеДляЗамены.Вставить("&ОтборПоРесурсу", "ТаблицаПоказателя.Ресурс Ссылка Справочник.упоРоли");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ТрудозатратыБП_ОкончРоли", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
			
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыБП_ОкончТР") Тогда
			
			имяВТ = "ВТ_ТрудозатратыБП_ОкончТР";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.БазоваяВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &БазоваяВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыБП_ОкончТР");
			СоответствиеДляЗамены.Вставить("&ОтборПоРесурсу", "ТаблицаПоказателя.Ресурс Ссылка Справочник.упоТрудовыеРесурсы");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ТрудозатратыБП_ОкончТР", имяВТ, СтруктураКолонокИтогов);
			
			КонецЕсли;	
			
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыВерсия_ОкончРоли") Тогда
			
			имяВТ = "ВТ_ТрудозатратыВерсия_ОкончРоли";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.выбВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &выбВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыВерсия_ОкончРоли");
			СоответствиеДляЗамены.Вставить("&ОтборПоРесурсу", "ТаблицаПоказателя.Ресурс Ссылка Справочник.упоРоли");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ТрудозатратыВерсия_ОкончРоли", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
			
		Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыВерсия_ОкончТР") Тогда
			
			имяВТ = "ВТ_ТрудозатратыВерсия_ОкончТР";
			
			СоответствиеДляЗамены = Новый Соответствие;
			Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.выбВерсия Тогда
				СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "упоАктуальныеПланыТрудозатратСводноВерсии");
				СоответствиеДляЗамены.Вставить("ТаблицаПоказателя.Проект = &Проект", "ТаблицаПоказателя.Версия = &выбВерсия");
			КонецЕсли;
			СоответствиеДляЗамены.Вставить("_Трудозатраты_", "ТрудозатратыВерсия_ОкончТР");
			СоответствиеДляЗамены.Вставить("&ОтборПоРесурсу", "ТаблицаПоказателя.Ресурс Ссылка Справочник.упоТрудовыеРесурсы");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ТрудозатратыВерсия_ОкончТР", имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыФ") Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоФактТрудозатратСводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(упоФактТрудозатратСводно.КоличествоЧасов) КАК ТрудозатратыФ
		               |ПОМЕСТИТЬ ВТ_ТрудозатратыФ
		               |ИЗ
		               |	РегистрСведений.упоФактТрудозатратСводно КАК упоФактТрудозатратСводно
		               |ГДЕ
		               |	упоФактТрудозатратСводно.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный)
		               |	И упоФактТрудозатратСводно.ПроектнаяЗадача.Проект = &Проект
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упоФактТрудозатратСводно.ПроектнаяЗадача";
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ТрудозатратыФ");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ТрудозатратыФ", СтруктураКолонокИтогов);
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьТрудозатраты") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьТрудозатраты", "", , """""");
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ТрудозатратыФОбъемыПланV") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ТрудозатратыФОбъемыПланV", "", , """""");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ОбъемыV(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены, ДоступнаФинИнформация)
    
    Перем имяВТ, МассивПоказателей, СоответствиеДляЗамены, ТекстЗапроса;
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланV")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовыйV")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсияV") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланV")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовыйV")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсияV") Тогда
        
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК _ОбъемыV_,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК _ОбъемыКоличествоV_
		|ПОМЕСТИТЬ _ВТ_
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
		|			,
		|			Версия = &_Версия_
		|				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача";
        
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланV")
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланV") Тогда
            
            имяВТ = "ВТ_ОбъемыПлан_V";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
			СоответствиеДляЗамены.Вставить("_ОбъемыV_", "ОбъемыПланV");
			СоответствиеДляЗамены.Вставить("_ОбъемыКоличествоV_", "ОбъемыКоличествоПланV");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланV") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПланV");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланV") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПланV");
			КонецЕсли;
            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовыйV")
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовыйV") Тогда
            
            имяВТ = "ВТ_ОбъемыПлан_БазовыйV";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
            СоответствиеДляЗамены.Вставить("_ОбъемыV_", "ОбъемыПланБазовыйV");
            СоответствиеДляЗамены.Вставить("_ОбъемыКоличествоV_", "ОбъемыКоличествоПланБазовыйV");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовыйV") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПланБазовыйV");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовыйV") Тогда
				МассивПоказателей.Добавить("ОбъемыКоличествоПланБазовыйV");
			КонецЕсли;
            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсияV")
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсияV") Тогда
            
            имяВТ = "ВТ_ОбъемыПлан_ВерсияV";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
            СоответствиеДляЗамены.Вставить("_ОбъемыV_", "ОбъемыПланВерсияV");
            СоответствиеДляЗамены.Вставить("_ОбъемыКоличествоV_", "ОбъемыКоличествоПланВерсияV");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсияV") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПланВерсияV");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсияV") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПланВерсияV");
			КонецЕсли;
            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
    КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланVчас") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК ОбъемыКоличествоПланVчас
		|ПОМЕСТИТЬ _ВТ_
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
		|			,
		|			Версия = &_Версия_
		|				И ЕдиницаИзмерения = &ЕдиницаИзмеренияЧас) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача";
		
		
		имяВТ = "ВТ_ОбъемыКоличествоVчас";
		
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
		СоответствиеДляЗамены.Вставить("_ОбъемыКоличествоПланVчас_", "ОбъемыКоличествоПланVчас");
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ОбъемыКоличествоПланVчас");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
		МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
		
    КонецЕсли;
	
    Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактV") Тогда   		
        
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоФактВыполненияОбъемовОборотыОбороты.СуммаВалютнаяОборот) КАК ОбъемыФактV,
		|	СУММА(упоФактВыполненияОбъемовОборотыОбороты.КоличествоОборот) КАК ОбъемыКоличествоФактV
		|ПОМЕСТИТЬ ВТ_ОбъемыФакт_V
		|ИЗ
		|	РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(
		|			,
		|			,
		|			,
		|			ПроектнаяЗадача.Проект = &Проект
		|				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)) КАК упоФактВыполненияОбъемовОборотыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача";		
        МассивПоказателей = Новый Массив;
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактV") И ДоступнаФинИнформация Тогда
			МассивПоказателей.Добавить("ОбъемыФактV");
		КонецЕсли;
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоФактV") Тогда
			МассивПоказателей.Добавить("ОбъемыКоличествоФактV");
		КонецЕсли;
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ОбъемыФакт_V",
			СтруктураКолонокИтогов); 
        
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемПланТ") И ДоступнаФинИнформация Тогда   		
        
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК ОбъемПланТ,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК ОбъемПланТКоличество
		|ПОМЕСТИТЬ ВТ_ОбъемПланТ
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
		|			,
		|			Версия = &ТекВерсия
		|				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
		|ГДЕ ДатаНачисления <= &КонецТекДня 
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача";
		
        МассивПоказателей = Новый Массив;
        МассивПоказателей.Добавить("ОбъемПланТ");
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ОбъемПланТ",
			СтруктураКолонокИтогов);
		
	КонецЕсли;
		
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемВыполнимостьТ") И ДоступнаФинИнформация Тогда
        ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ОбъемВыполнимостьТ", "", , """""");
    КонецЕсли;	
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьОбъемыV") И ДоступнаФинИнформация Тогда
        ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьОбъемыV", "", , """""");
    КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ОбъемыV_Р(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены, ДоступнаФинИнформация)
    
    Перем имяВТ, МассивПоказателей, СоответствиеДляЗамены, ТекстЗапроса;
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланV_Р")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовыйV_Р")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсияV_Р") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланV_Р") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовыйV_Р") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсияV_Р")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоФактV_Р") Тогда
        
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК _ОбъемыV_Р_,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК _ОбъемыКоличествоV_Р_
		|ПОМЕСТИТЬ _ВТ_
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
		|			,
		|			Версия = &_Версия_
		|				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача";
        
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланV_Р")
			Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланV_Р") Тогда
            
            имяВТ = "ВТ_ОбъемыПлан_V_Р";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
            СоответствиеДляЗамены.Вставить("_ОбъемыV_Р_", "ОбъемыПланV_Р");
            СоответствиеДляЗамены.Вставить("_ОбъемыКоличествоV_Р_", "ОбъемыКоличествоПланV_Р");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланV_Р") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПланV_Р");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланV_Р") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПланV_Р");
			КонецЕсли;
            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовыйV_Р")
			Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовыйV_Р") Тогда
            
            имяВТ = "ВТ_ОбъемыПлан_БазовыйV_Р";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
            СоответствиеДляЗамены.Вставить("_ОбъемыV_Р_", "ОбъемыПланБазовыйV_Р");
            СоответствиеДляЗамены.Вставить("_ОбъемыКоличествоV_Р_", "ОбъемыКоличествоПланБазовыйV_Р");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовыйV_Р") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПланБазовыйV_Р");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовыйV_Р") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПланБазовыйV_Р");
			КонецЕсли;

            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсияV_Р")
			Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсияV_Р") Тогда
            
            имяВТ = "ВТ_ОбъемыПлан_ВерсияV_Р";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
            СоответствиеДляЗамены.Вставить("_ОбъемыV_Р_", "ОбъемыПланВерсияV_Р");
            СоответствиеДляЗамены.Вставить("_ОбъемыКоличествоV_Р_", "ОбъемыКоличествоПланВерсияV_Р");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсияV_Р") Тогда
            	МассивПоказателей.Добавить("ОбъемыПланВерсияV_Р");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсияV_Р") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПланВерсияV_Р");
			КонецЕсли;
            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
    КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактV_Р") 
		Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоФактV_Р") Тогда   		
        
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоФактВыполненияОбъемовОборотыОбороты.СуммаВалютнаяОборот) КАК ОбъемыФактV_Р,
		|	СУММА(упоФактВыполненияОбъемовОборотыОбороты.КоличествоОборот) КАК ОбъемыКоличествоФактV_Р
		|ПОМЕСТИТЬ ВТ_ОбъемыФакт_V_Р
		|ИЗ
		|	РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(
		|			,
		|			,
		|			,
		|			ПроектнаяЗадача.Проект = &Проект
		|				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)) КАК упоФактВыполненияОбъемовОборотыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача";		
        МассивПоказателей = Новый Массив;
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактV_Р") И ДоступнаФинИнформация Тогда
			МассивПоказателей.Добавить("ОбъемыФактV_Р");
		КонецЕсли;
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоФактV_Р") Тогда
			МассивПоказателей.Добавить("ОбъемыКоличествоФактV_Р");
		КонецЕсли;
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ОбъемыФакт_V_Р",
		СтруктураКолонокИтогов); 
        
    КонецЕсли;	
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьОбъемыV_Р") И ДоступнаФинИнформация Тогда
        ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьОбъемыV_Р", "", , """""");
    КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ПрямыеРасходы(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены)
    
    Перем имяВТ, СоответствиеДляЗамены, ТекстЗапроса;
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ПланПоСтатьямПрямыхРасходов")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ПланПоСтатьямПрямыхРасходовБазовый")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ПланПоСтатьямПрямыхРасходовВерсия") Тогда   	
        
        ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                       |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                       |	СУММА(упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма) КАК _ПланПоСтатьямПрямыхРасходов_
                       |ПОМЕСТИТЬ _ВТ_
                       |ИЗ
                       |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(, Версия = &_Версия_) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатьиПрямыхРасходов КАК упоСтатьиПрямыхРасходов
                       |		ПО упоАктуальныеПланыДоходовИРасходовСрезПоследних.Статья = упоСтатьиПрямыхРасходов.Статья
                       |			И (упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма <> 0)
                       |
                       |СГРУППИРОВАТЬ ПО
                       |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача";
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ПланПоСтатьямПрямыхРасходов") Тогда
            
            имяВТ = "ВТ_ПланПоСтатьямПрямыхРасходов";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
            СоответствиеДляЗамены.Вставить("_ПланПоСтатьямПрямыхРасходов_", "ПланПоСтатьямПрямыхРасходов");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ПланПоСтатьямПрямыхРасходов", имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ПланПоСтатьямПрямыхРасходовБазовый") Тогда
            
            имяВТ = "ВТ_ПланПоСтатьямПрямыхРасходовБазовый";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
            СоответствиеДляЗамены.Вставить("_ПланПоСтатьямПрямыхРасходов_", "ПланПоСтатьямПрямыхРасходовБазовый");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ПланПоСтатьямПрямыхРасходовБазовый", имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ПланПоСтатьямПрямыхРасходовВерсия") Тогда
            
            имяВТ = "ВТ_ПланПоСтатьямПрямыхРасходовВерсия";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
            СоответствиеДляЗамены.Вставить("_ПланПоСтатьямПрямыхРасходов_", "ПланПоСтатьямПрямыхРасходовВерсия");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ПланПоСтатьямПрямыхРасходовВерсия", имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
    КонецЕсли;

	Если СтруктураВыводимыхДопКолонок.Свойство("ФактПоСтатьямПрямыхРасходов") Тогда   	
        
        ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                       |	упоФактДоходовИРасходовПоДням.ПроектнаяЗадача КАК ПроектнаяЗадача,
                       |	СУММА(упоФактДоходовИРасходовПоДням.Сумма) КАК ФактПоСтатьямПрямыхРасходов
                       |ПОМЕСТИТЬ ВТ_ФактПоСтатьямПрямыхРасходов
                       |ИЗ
                       |	РегистрСведений.упоФактДоходовИРасходовПоДням КАК упоФактДоходовИРасходовПоДням
                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатьиПрямыхРасходов КАК упоСтатьиПрямыхРасходов
                       |		ПО упоФактДоходовИРасходовПоДням.Статья = упоСтатьиПрямыхРасходов.Статья
                       |			И (упоФактДоходовИРасходовПоДням.Сумма <> 0)
                       |
                       |СГРУППИРОВАТЬ ПО
                       |	упоФактДоходовИРасходовПоДням.ПроектнаяЗадача";
        
        МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ФактПоСтатьямПрямыхРасходов");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ФактПоСтатьямПрямыхРасходов", СтруктураКолонокИтогов);
                
    КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ФОТ(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены)
    
    Перем имяВТ, СоответствиеДляЗамены, ТекстЗапроса;
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ФОТПлан")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ФОТПланБазовый") 
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ФОТПланВерсия") Тогда   	
        
        ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача,
	        |	СУММА(упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма) КАК _ФОТ_
	        |ПОМЕСТИТЬ _ВТ_
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(, Версия = &_Версия_) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатьиФОТ КАК упоСтатьиФОТ
	        |		ПО упоАктуальныеПланыДоходовИРасходовСрезПоследних.Статья = упоСтатьиФОТ.Статья
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача";
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ФОТПлан") Тогда
            
            имяВТ = "ВТ_ФОТПлан";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
            СоответствиеДляЗамены.Вставить("_ФОТ_", "ФОТПлан");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), "ФОТПлан", имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ФОТПланБазовый") Тогда
            
            имяВТ = "ВТ_ФОТПланБазовый";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
            СоответствиеДляЗамены.Вставить("_ФОТ_", "ФОТПланБазовый");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ФОТПланБазовый", имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ФОТПланВерсия") Тогда
            
            имяВТ = "ВТ_ФОТПланВерсия";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
            СоответствиеДляЗамены.Вставить("_ФОТ_", "ФОТПланВерсия");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				"ФОТПланВерсия", имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
    КонецЕсли;
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ФОТФактПоБДР") Тогда   	
        
        ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоФактДоходовИРасходовПоДням.ПроектнаяЗадача,
	        |	СУММА(упоФактДоходовИРасходовПоДням.Сумма) КАК ФОТФактПоБДР
	        |ПОМЕСТИТЬ ВТ_ФОТФактПоБДР
	        |ИЗ
	        |	РегистрСведений.упоФактДоходовИРасходовПоДням КАК упоФактДоходовИРасходовПоДням
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатьиФОТ КАК упоСтатьиФОТ
	        |		ПО упоФактДоходовИРасходовПоДням.Статья = упоСтатьиФОТ.Статья
	        |ГДЕ упоФактДоходовИРасходовПоДням.ПроектнаяЗадача.Проект = &Проект
	        |СГРУППИРОВАТЬ ПО
	        |	упоФактДоходовИРасходовПоДням.ПроектнаяЗадача";
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, "ФОТФактПоБДР", "ВТ_ФОТФактПоБДР",
			СтруктураКолонокИтогов);
        
    КонецЕсли;		
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ФОТФактПоТабелю") Тогда   	
        
        ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВЫБОР
	        |		КОГДА упоФактТрудозатратПоДням.Операция ССЫЛКА Документ.упоПроектнаяЗадача
	        |			ТОГДА упоФактТрудозатратПоДням.Операция
	        |		ИНАЧЕ упоФактТрудозатратПоДням.Операция.ПроектнаяЗадача
	        |	КОНЕЦ КАК ПроектнаяЗадача,
	        |	СУММА(упоФактТрудозатратПоДням.Стоимость) КАК ФОТФактПоТабелю
	        |ПОМЕСТИТЬ ВТ_ФОТФактПоТабелю
	        |ИЗ
	        |	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	        |ГДЕ
	        |	упоФактТрудозатратПоДням.День >= &ТекДата
	        |	И упоФактТрудозатратПоДням.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВЫБОР
	        |		КОГДА упоФактТрудозатратПоДням.Операция ССЫЛКА Документ.упоПроектнаяЗадача
	        |			ТОГДА упоФактТрудозатратПоДням.Операция
	        |		ИНАЧЕ упоФактТрудозатратПоДням.Операция.ПроектнаяЗадача
	        |	КОНЕЦ";
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, "ФОТФактПоТабелю", "ВТ_ФОТФактПоТабелю",
			СтруктураКолонокИтогов);
        
    КонецЕсли;	
    
    Если СтруктураВыводимыхДопКолонок.Свойство("ФОТФакт") Тогда   	
        
        ТекстЗапроса ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ФактФОТпоБДР.ПроектнаяЗадача,
	        |	ФактФОТпоБДР.ФОТФактПоБДР КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ФОТФактРазгр
	        |ИЗ
	        |	ВТ_ФОТФактПоБДР КАК ФактФОТпоБДР
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ФактФОТпоЧасам.ПроектнаяЗадача,
	        |	ФактФОТпоЧасам.ФОТФактПоТабелю
	        |ИЗ
	        |	ВТ_ФОТФактПоТабелю КАК ФактФОТпоЧасам
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВТ_ФОТФактРазгр.ПроектнаяЗадача,
	        |	СУММА(ВТ_ФОТФактРазгр.Сумма) КАК ФОТФакт
	        |ПОМЕСТИТЬ ВТ_ФОТФакт
	        |ИЗ
	        |	ВТ_ФОТФактРазгр КАК ВТ_ФОТФактРазгр
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ФОТФактРазгр.ПроектнаяЗадача";
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, "ФОТФакт", "ВТ_ФОТФакт", СтруктураКолонокИтогов);			
        
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьФОТ") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьФОТ", "", , """""");
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьФОТРасчетный") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьФОТРасчетный", "", , """""");
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ФОТРасчетный") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ФОТРасчетный", "", СтруктураКолонокИтогов);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_Объемы(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены, ДоступнаФинИнформация)
    
    Перем имяВТ, МассивПоказателей, СоответствиеДляЗамены, ТекстЗапроса;
    
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПлан")
	    Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПлан") 	
		Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовый") 
		Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсия") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	СУММА(Таблица.Сумма) КАК _Объемы_,
			|	СУММА(Таблица.Количество) КАК _ОбъемыКоличество_
			|ПОМЕСТИТЬ _ВТ_
			|ИЗ
			|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(, Версия = &_Версия_) КАК Таблица
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ПроектнаяЗадача
			|";	
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПлан")
			Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПлан") Тогда
			
			имяВТ = "ВТ_ОбъемыПлан";
			
			СоответствиеДляЗамены = Новый Соответствие;
			СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
			СоответствиеДляЗамены.Вставить("_Объемы_", "ОбъемыПлан");
			СоответствиеДляЗамены.Вставить("_ОбъемыКоличество_", "ОбъемыКоличествоПлан");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			
			МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПлан") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПлан");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПлан") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПлан");
			КонецЕсли;
			ДобавитьПоказательВЗапрос(ТекстыЗамены,
			ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
			
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовый") 
			Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовый") Тогда
            
            имяВТ = "ВТ_ОбъемыПланБазовый";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
            СоответствиеДляЗамены.Вставить("_Объемы_", "ОбъемыПланБазовый");
            СоответствиеДляЗамены.Вставить("_ОбъемыКоличество_", "ОбъемыКоличествоПланБазовый");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланБазовый") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПланБазовый");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланБазовый") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПланБазовый");
			КонецЕсли;

            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсия") 
			Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсия") Тогда
            
            имяВТ = "ВТ_ОбъемыПланВерсия";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
            СоответствиеДляЗамены.Вставить("_Объемы_", "ОбъемыПланВерсия");
            СоответствиеДляЗамены.Вставить("_ОбъемыКоличество_", "ОбъемыКоличествоПланВерсия");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
            
            МассивПоказателей = Новый Массив;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланВерсия") И ДоступнаФинИнформация Тогда
            	МассивПоказателей.Добавить("ОбъемыПланВерсия");
			КонецЕсли;
			Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоПланВерсия") Тогда
            	МассивПоказателей.Добавить("ОбъемыКоличествоПланВерсия");
			КонецЕсли;
            ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса),
				МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
            
        КонецЕсли;
        
    КонецЕсли;			
    
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФакт") 
		Или СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоФакт") Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(Таблица.Сумма) КАК ОбъемыФакт,
		               |	СУММА(Таблица.Количество) КАК ОбъемыКоличествоФакт
		               |ПОМЕСТИТЬ ВТ_ОбъемыФакт
		               |ИЗ
		               |	РегистрСведений.упоФактВыполненияОбъемовПоДням КАК Таблица
		               |ГДЕ Таблица.Проект = &Проект
		               |СГРУППИРОВАТЬ ПО
		               |	Таблица.ПроектнаяЗадача";
        МассивПоказателей = Новый Массив;
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФакт") И ДоступнаФинИнформация Тогда
			МассивПоказателей.Добавить("ОбъемыФакт");
		КонецЕсли;
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыКоличествоФакт") Тогда
			МассивПоказателей.Добавить("ОбъемыКоличествоФакт");
		КонецЕсли;
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ОбъемыФакт", СтруктураКолонокИтогов);
        
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьОбъемы") И ДоступнаФинИнформация Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьОбъемы", "", , """""");
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ПоступленияВыплаты(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены)
	
	Перем имяВТ, СоответствиеДляЗамены, ТекстЗапроса;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПлан")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПлан")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПланБазовый")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПланБазовый")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПланВерсия")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПланВерсия") Тогда     
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	СУММА(ВЫБОР
			|			КОГДА Таблица.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление)
			|				ТОГДА Таблица.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК _Поступления_,
			|	СУММА(ВЫБОР
			|			КОГДА Таблица.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата)
			|				ТОГДА Таблица.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК _Выплаты_
			|ПОМЕСТИТЬ _ВТ_
			|ИЗ
			|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
			|			,
			|			Версия = &_Версия_) КАК Таблица
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ПроектнаяЗадача";
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПлан") 
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПлан") Тогда
			
			имяВТ = "ВТ_ВыплатыПоступленияПлан";
			
			СоответствиеДляЗамены = Новый Соответствие;
			СоответствиеДляЗамены.Вставить("_Поступления_", "ПоступленияПлан"); 
			СоответствиеДляЗамены.Вставить("_Выплаты_", "ВыплатыПлан");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
			
			Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПлан") Тогда     
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ПоступленияПлан", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;		
			
			Если СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПлан") Тогда     				
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыплатыПлан", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;				
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПланБазовый") 
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПланБазовый") Тогда
			
			имяВТ = "ВТ_ВыплатыПоступленияПланБазовый";
			
			СоответствиеДляЗамены = Новый Соответствие;
			СоответствиеДляЗамены.Вставить("_Поступления_", "ПоступленияПланБазовый"); 
			СоответствиеДляЗамены.Вставить("_Выплаты_", "ВыплатыПланБазовый");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
			
			Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПланБазовый") Тогда     
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ПоступленияПланБазовый", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;		
			
			Если СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПланБазовый") Тогда     				
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыплатыПланБазовый", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;				
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПланВерсия") 
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПланВерсия") Тогда
			
			имяВТ = "ВТ_ВыплатыПоступленияПланВерсия";
			
			СоответствиеДляЗамены = Новый Соответствие;
			СоответствиеДляЗамены.Вставить("_Поступления_", "ПоступленияПланВерсия"); 
			СоответствиеДляЗамены.Вставить("_Выплаты_", "ВыплатыПланВерсия");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
			
			Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияПланВерсия") Тогда     
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ПоступленияПланВерсия", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;		
			
			Если СтруктураВыводимыхДопКолонок.Свойство("ВыплатыПланВерсия") Тогда     				
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыплатыПланВерсия", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;				
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияФакт")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ВыплатыФакт") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(Таблица.НаправлениеДвижения, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление)
			|				ТОГДА Таблица.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ПоступленияФакт,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(Таблица.НаправлениеДвижения, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата)
			|				ТОГДА Таблица.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ВыплатыФакт
			|ПОМЕСТИТЬ ВТ_ВыплатыПоступленияФакт
			|ИЗ
			|	РегистрСведений.упоФактДвиженийДенежныхСредств КАК Таблица
			|ГДЕ Таблица.ПроектнаяЗадача.Проект = &Проект
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ПроектнаяЗадача";
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, , "ВТ_ВыплатыПоступленияФакт");
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ПоступленияФакт") Тогда     
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ПоступленияФакт", "ВТ_ВыплатыПоступленияФакт",
				СтруктураКолонокИтогов);
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ВыплатыФакт") Тогда     			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыплатыФакт", "ВТ_ВыплатыПоступленияФакт",
				СтруктураКолонокИтогов);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьПоступления") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьПоступления", "", , """""");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ДоходРасход(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены)
    
    Перем имяВТ, СоответствиеДляЗамены, ТекстЗапроса;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("СуммаСанкций") ИЛИ СтруктураВыводимыхДопКолонок.Свойство("КоличествоДнейПросрочки") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДогупоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
		               |	ДогупоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПоДоговору,
		               |	ТекупоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПоТекПлан,
		               |	ТекупоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект,
		               |	ВЫБОР
		               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		               |			ТОГДА упоКалендариПроектовСрезПоследних.КалендарьПроекта
		               |		ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи
		               |	КОНЕЦ КАК КалендарьПроекта,
		               |	упоСвойстваПроектныхЗадачСрезПоследних.СуммаСанкцийЗаДеньЗадержки
		               |ПОМЕСТИТЬ СрокиПросрочки
		               |ИЗ
		               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК ТекупоСрокиПроектныхЗадачСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &ДоговорнаяВерсия) КАК ДогупоСрокиПроектныхЗадачСрезПоследних
		               |		ПО ТекупоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ДогупоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК упоКалендариПроектовСрезПоследних
		               |		ПО ТекупоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект = упоКалендариПроектовСрезПоследних.Проект
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |		ПО ТекупоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |ГДЕ
		               |	ДогупоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан < ТекупоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СрокиПросрочки.ПроектнаяЗадача,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоРабочиеКалендариСрезПоследних.День) КАК КоличествоДнейПросрочки,
		               |	МАКСИМУМ(СрокиПросрочки.СуммаСанкцийЗаДеньЗадержки) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоРабочиеКалендариСрезПоследних.День) КАК СуммаСанкций
		               |ПОМЕСТИТЬ ВТ_СуммаСанкций
		               |ИЗ
		               |	СрокиПросрочки КАК СрокиПросрочки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
		               |		ПО СрокиПросрочки.КалендарьПроекта = упоРабочиеКалендариСрезПоследних.Календарь
		               |ГДЕ
		               |	упоРабочиеКалендариСрезПоследних.День <= СрокиПросрочки.ДатаЗавершенияПоТекПлан
		               |	И упоРабочиеКалендариСрезПоследних.День > СрокиПросрочки.ДатаЗавершенияПоДоговору
		               |	И упоРабочиеКалендариСрезПоследних.КоличествоЧасов <> 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СрокиПросрочки.ПроектнаяЗадача";
					   
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, , "ВТ_СуммаСанкций");
		    
		Если СтруктураВыводимыхДопКолонок.Свойство("СуммаСанкций") Тогда     
		      ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "СуммаСанкций", "ВТ_СуммаСанкций", СтруктураКолонокИтогов);
		КонецЕсли;	
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "КоличествоДнейПросрочки", "ВТ_СуммаСанкций");
			
	КонецЕсли;
	
    Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПлан") 
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("РасходПлан") 
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДоходПланБазовый")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("РасходПланБазовый") 
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДоходПланВерсия")
        ИЛИ СтруктураВыводимыхДопКолонок.Свойство("РасходПланВерсия") Тогда
        		
		ТекстЗапроса = 
	        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	СУММА(ВЫБОР
	        |			КОГДА ЕСТЬNULL(упоАктуальныеПланыДоходовИРасходовСрезПоследних.ВидЭлемента, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	        |				ТОГДА упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК _Доход_,
	        |	СУММА(ВЫБОР
	        |			КОГДА ЕСТЬNULL(упоАктуальныеПланыДоходовИРасходовСрезПоследних.ВидЭлемента, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	        |				ТОГДА упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК _Расход_
	        |ПОМЕСТИТЬ _ВТ_
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(, Версия = &_Версия_) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	        |ГДЕ
	        |	(упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма <> 0
	        |			ИЛИ упоАктуальныеПланыДоходовИРасходовСрезПоследних.СуммаВалютная <> 0)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача";
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПлан") 
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("РасходПлан") Тогда
			
			имяВТ = "ВТ_ДР";
			
			СоответствиеДляЗамены = Новый Соответствие;
			СоответствиеДляЗамены.Вставить("_Доход_", "ДоходПлан"); 
			СоответствиеДляЗамены.Вставить("_Расход_", "РасходПлан");
			СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");
			
			ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
			
			Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПлан") Тогда     
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходПлан", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;
			
			Если СтруктураВыводимыхДопКолонок.Свойство("РасходПлан") Тогда
				ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "РасходПлан", имяВТ, СтруктураКолонокИтогов);
			КонецЕсли;
			
		КонецЕсли;
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланБазовый") 
            ИЛИ СтруктураВыводимыхДопКолонок.Свойство("РасходПланБазовый") Тогда
            
            имяВТ = "ВТ_ДР_Базовый";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Доход_", "ДоходПланБазовый"); 
            СоответствиеДляЗамены.Вставить("_Расход_", "РасходПланБазовый");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
            
            Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланБазовый") Тогда     
                ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходПланБазовый", имяВТ, СтруктураКолонокИтогов);
            КонецЕсли;		
            
            Если СтруктураВыводимыхДопКолонок.Свойство("РасходПланБазовый") Тогда     				
                ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "РасходПланБазовый", имяВТ, СтруктураКолонокИтогов);
            КонецЕсли;				
        КонецЕсли;
        
        Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланВерсия") 
            ИЛИ СтруктураВыводимыхДопКолонок.Свойство("РасходПланВерсия") Тогда
            
            имяВТ = "ВТ_ДР_Версия";
            
            СоответствиеДляЗамены = Новый Соответствие;
            СоответствиеДляЗамены.Вставить("_Доход_", "ДоходПланВерсия"); 
            СоответствиеДляЗамены.Вставить("_Расход_", "РасходПланВерсия");
            СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
			СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
            
            ДобавитьПоказательВЗапрос(ТекстыЗамены,
				ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
            
            Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланВерсия") Тогда     
                ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходПланВерсия", имяВТ, СтруктураКолонокИтогов);
            КонецЕсли;		
            
            Если СтруктураВыводимыхДопКолонок.Свойство("РасходПланВерсия") Тогда     				
                ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "РасходПланВерсия", имяВТ, СтруктураКолонокИтогов);
            КонецЕсли;				
        КонецЕсли;
        
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДоходФакт")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("РасходФакт") Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(Таблица.ВидЭлемента, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
			|				ТОГДА Таблица.СуммаОборот
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ДоходФакт,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(Таблица.ВидЭлемента, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
			|				ТОГДА Таблица.СуммаОборот
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК РасходФакт
			|ПОМЕСТИТЬ ВТ_ДР_Факт
			|ИЗ
			|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(, , , ПроектнаяЗадача.Проект = &Проект) КАК Таблица
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ПроектнаяЗадача";
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, , "ВТ_ДР_Факт");
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДоходФакт") Тогда     
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходФакт", "ВТ_ДР_Факт", СтруктураКолонокИтогов);
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("РасходФакт") Тогда     			
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "РасходФакт", "ВТ_ДР_Факт", СтруктураКолонокИтогов);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("РасходПланТ") Тогда   		
        
        ТекстЗапроса = 
	        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	СУММА(ВЫБОР
	        |			КОГДА ЕСТЬNULL(упоАктуальныеПланыДоходовИРасходовСрезПоследних.ВидЭлемента, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	        |				ТОГДА упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК РасходПланТ
	        |ПОМЕСТИТЬ ВТ_РасходПланТ
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(, Версия = &ТекВерсия) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	        |ГДЕ
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ДатаНачисления <= &КонецТекДня
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача";	
		
        МассивПоказателей = Новый Массив;
        МассивПоказателей.Добавить("РасходПланТ");
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_РасходПланТ",
			СтруктураКолонокИтогов); 
        
	КонецЕсли;
		
	Если СтруктураВыводимыхДопКолонок.Свойство("РасходВыполнимостьТ") Тогда
        ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "РасходВыполнимостьТ", "", , """""");
    КонецЕсли;	
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьДоход") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьДоход", "", , """""");
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ВыполнимостьРасход") Тогда
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ВыполнимостьРасход", "", , """""");
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ДатаНачалаОкончания(Знач СтруктураВыводимыхДопКолонок, 
	Знач ТекстыЗамены, 
	пПараметры)
	
	Перем ТекстЗапроса;
	
	СравниватьСПоказателямиПоВерсии = пПараметры.Свойство("СравниватьСПоказателямиПоВерсии") 
		И пПараметры.СравниватьСПоказателямиПоВерсии;
	
	ЕстьПоказатели_ДатаНачалаОкончания = СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаБазовый")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияБазовый")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаВерсия")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияВерсия")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаДоговорной")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияДоговорной")
		ИЛИ СравниватьСПоказателямиПоВерсии;
	
	Если Не ЕстьПоказатели_ДатаНачалаОкончания Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Таблица.ДатаНачалаПлан КАК _ДатаНачала_,
		|	Таблица.ДатаЗавершенияПлан КАК _ДатаЗавершения_
		|ПОМЕСТИТЬ _ВТ_
		|ИЗ
		|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &_Версия_) КАК Таблица";
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаБазовый")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияБазовый") Тогда
		
		имяВТ = "ВТ_СрокиПЗ_Базовый";
		
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_ДатаНачала_", "ДатаНачалаБазовый");
		СоответствиеДляЗамены.Вставить("_ДатаЗавершения_", "ДатаЗавершенияБазовый");
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
		СоответствиеДляЗамены.Вставить("_Версия_", "БазоваяВерсия");
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены,
			ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаБазовый") Тогда
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДатаНачалаБазовый", имяВТ, , "ДатаВремя(1, 1, 1)");
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияБазовый") Тогда
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДатаЗавершенияБазовый", имяВТ, , "ДатаВремя(1, 1, 1)");
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаДоговорной")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияДоговорной") Тогда
		
		имяВТ = "ВТ_СрокиПЗ_Договорной";
		
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_ДатаНачала_", "ДатаНачалаДоговорной");
		СоответствиеДляЗамены.Вставить("_ДатаЗавершения_", "ДатаЗавершенияДоговорной");
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
		СоответствиеДляЗамены.Вставить("_Версия_", "ДоговорнаяВерсия");
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены,
			ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаДоговорной") Тогда
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДатаНачалаДоговорной", имяВТ, , "ДатаВремя(1, 1, 1)");
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияДоговорной") Тогда
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДатаЗавершенияДоговорной", имяВТ, , "ДатаВремя(1, 1, 1)");
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаВерсия")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияВерсия") 
		ИЛИ СравниватьСПоказателямиПоВерсии Тогда
		
		имяВТ = "ВТ_СрокиПЗ_Версия";
		
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_ДатаНачала_", "ДатаНачалаВерсия");
		СоответствиеДляЗамены.Вставить("_ДатаЗавершения_", "ДатаЗавершенияВерсия");
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);
		СоответствиеДляЗамены.Вставить("_Версия_", "выбВерсия");
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены,
			ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаВерсия") ИЛИ СравниватьСПоказателямиПоВерсии Тогда
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДатаНачалаВерсия", имяВТ, , "ДатаВремя(1, 1, 1)");
		КонецЕсли;
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияВерсия") ИЛИ СравниватьСПоказателямиПоВерсии Тогда
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДатаЗавершенияВерсия", имяВТ, , "ДатаВремя(1, 1, 1)");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_СтруктураСтоимости(Знач СтруктураВыводимыхДопКолонок, Знач СтруктураКолонокИтогов,
	Знач ТекстыЗамены)
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланЗаВычетомСССП") Тогда   		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) КАК ДоходПланЗаВычетомСССП
		|ПОМЕСТИТЬ ВТ_ДоходПланЗаВычетомСССП
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|				И Версия = &ТекВерсия) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		|		ПО упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		|ГДЕ
		|	упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача";	
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ДоходПланЗаВычетомСССП");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ДоходПланЗаВычетомСССП",
		СтруктураКолонокИтогов); 
		
	КонецЕсли;	
				
	Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланРезервРПО") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДоходПланРезервРК") Тогда	
			
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(ВЫБОР
		|			КОГДА упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		|				ТОГДА упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоходПланРезервРК,
		|	СУММА(ВЫБОР
		|			КОГДА упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)
		|				ТОГДА упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоходПланРезервРПО
		|ПОМЕСТИТЬ _ВТ_
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|				И Версия = &ТекВерсия) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
		|ГДЕ
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ДоходПланРезерв_РКО_РП";
		
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);  
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены,
		ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланРезервРПО") Тогда     
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходПланРезервРПО", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;		
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланРезервРК") Тогда     				
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходПланРезервРК", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДоходПланРезервПрочие") Тогда   		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) КАК ДоходПланРезервПрочие
		|ПОМЕСТИТЬ ВТ_ДоходПланРезервПрочие
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|				И Версия = &ТекВерсия
		|				И СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		|				И СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		|		ПО упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача";	
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ДоходПланРезервПрочие");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ДоходПланРезервПрочие", 
		СтруктураКолонокИтогов); 
		
	КонецЕсли;
	
	//
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланЗаВычетомСССП") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК ОбъемыПланЗаВычетомСССП
		|ПОМЕСТИТЬ ВТ_ОбъемыПланЗаВычетомСССП
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(, Версия = &ТекВерсия И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		|		ПО упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		|ГДЕ
		|	упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ОбъемыПланЗаВычетомСССП";
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ОбъемыПланЗаВычетомСССП");
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
		
	КонецЕсли;	

	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланРезервРПО") 
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланРезервРК") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(ВЫБОР
		               |			КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		               |				ТОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ОбъемыПланРезервРК,
		               |	СУММА(ВЫБОР
		               |			КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)
		               |				ТОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ОбъемыПланРезервРПО
		               |ПОМЕСТИТЬ _ВТ_
		               |ИЗ
		               |	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(, Версия = &ТекВерсия И (СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК) ИЛИ СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО))) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ОбъемыПланРезервРК_РПО";
				
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);  
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены,
		ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланРезервРПО") Тогда     
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ОбъемыПланРезервРПО", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;		
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланРезервРК") Тогда     				
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ОбъемыПланРезервРК", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыПланРезервПрочие") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма) КАК ОбъемыПланРезервПрочие
		               |ПОМЕСТИТЬ ВТ_ОбъемыПланРезервПрочие
		               |ИЗ
		               |	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
		               |			,
		               |			Версия = &ТекВерсия
		               |				И СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		               |				И СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		               |		ПО упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ОбъемыПланРезервПрочие";
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ОбъемыПланРезервПрочие");
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
		
	КонецЕсли;	
	
	//
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДоходФактЗаВычетомСССП") Тогда   		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоФактДоходовИРасходовОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоФактДоходовИРасходовОбороты.Сумма) КАК ДоходФактЗаВычетомСССП
		|ПОМЕСТИТЬ ВТ_ДоходФактЗаВычетомСССП
		|ИЗ
		|	РегистрНакопления.упоФактДоходовИРасходовОбороты КАК упоФактДоходовИРасходовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		|		ПО упоФактДоходовИРасходовОбороты.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		|ГДЕ
		|	упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд ЕСТЬ NULL
		|	И упоФактДоходовИРасходовОбороты.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|
		|СГРУППИРОВАТЬ ПО
		|	упоФактДоходовИРасходовОбороты.ПроектнаяЗадача";	
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ДоходФактЗаВычетомСССП");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ДоходФактЗаВычетомСССП",
		СтруктураКолонокИтогов); 
		
	КонецЕсли;	
				
	Если СтруктураВыводимыхДопКолонок.Свойство("ДоходФактРезервРПО") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ДоходФактРезервРК") Тогда	
			
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоФактДоходовИРасходовОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(ВЫБОР
		|			КОГДА упоФактДоходовИРасходовОбороты.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		|				ТОГДА упоФактДоходовИРасходовОбороты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоходФактРезервРК,
		|	СУММА(ВЫБОР
		|			КОГДА упоФактДоходовИРасходовОбороты.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)
		|				ТОГДА упоФактДоходовИРасходовОбороты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДоходФактРезервРПО
		|ПОМЕСТИТЬ _ВТ_
		|ИЗ
		|	РегистрНакопления.упоФактДоходовИРасходовОбороты КАК упоФактДоходовИРасходовОбороты
		|ГДЕ
		|	упоФактДоходовИРасходовОбороты.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|
		|СГРУППИРОВАТЬ ПО
		|	упоФактДоходовИРасходовОбороты.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ДоходФактРезерв_РКО_РП";
		
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);  
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены,
		ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДоходФактРезервРПО") Тогда     
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходФактРезервРПО", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;		
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ДоходФактРезервРК") Тогда     				
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ДоходФактРезервРК", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДоходФактРезервПрочие") Тогда   		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоФактДоходовИРасходовОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоФактДоходовИРасходовОбороты.Сумма) КАК ДоходФактРезервПрочие
		|ПОМЕСТИТЬ ВТ_ДоходФактРезервПрочие
		|ИЗ
		|	РегистрНакопления.упоФактДоходовИРасходовОбороты КАК упоФактДоходовИРасходовОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		|		ПО упоФактДоходовИРасходовОбороты.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		|ГДЕ
		|	упоФактДоходовИРасходовОбороты.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) И упоФактДоходовИРасходовОбороты.СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		|				И упоФактДоходовИРасходовОбороты.СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)
		|СГРУППИРОВАТЬ ПО
		|	упоФактДоходовИРасходовОбороты.ПроектнаяЗадача";	
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ДоходФактРезервПрочие");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ДоходФактРезервПрочие", 
		СтруктураКолонокИтогов); 
		
	КонецЕсли;

	//
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактЗаВычетомСССП") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СУММА(упоФактВыполненияОбъемовОбороты.Сумма) КАК ОбъемыФактЗаВычетомСССП
		|ПОМЕСТИТЬ ВТ_ОбъемыФактЗаВычетомСССП
		|ИЗ
		|	РегистрНакопления.упоФактВыполненияОбъемовОбороты КАК упоФактВыполненияОбъемовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		|		ПО упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		|ГДЕ
		|	упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ОбъемыФактЗаВычетомСССП";
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ОбъемыФактЗаВычетомСССП");
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
		
	КонецЕсли;	

	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактРезервРПО") 
			ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактРезервРК") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(ВЫБОР
		               |			КОГДА упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		               |				ТОГДА упоФактВыполненияОбъемовОбороты.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ОбъемыФактРезервРК,
		               |	СУММА(ВЫБОР
		               |			КОГДА упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)
		               |				ТОГДА упоФактВыполненияОбъемовОбороты.Сумма
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ОбъемыФактРезервРПО
		               |ПОМЕСТИТЬ _ВТ_
		               |ИЗ
		               |	РегистрНакопления.упоФактВыполненияОбъемовОбороты КАК упоФактВыполненияОбъемовОбороты
		               |		ГДЕ упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО) ИЛИ упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд = ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		               |СГРУППИРОВАТЬ ПО
		               |	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ОбъемыФактРезервРК_РПО";
				
		СоответствиеДляЗамены = Новый Соответствие;
		СоответствиеДляЗамены.Вставить("_ВТ_", имяВТ);  
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены,
		ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), , имяВТ);
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактРезервРПО") Тогда     
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ОбъемыФактРезервРПО", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;		
		
		Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактРезервРК") Тогда     				
			ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ОбъемыФактРезервРК", имяВТ, СтруктураКолонокИтогов);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОбъемыФактРезервПрочие") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	СУММА(упоФактВыполненияОбъемовОбороты.Сумма) КАК ОбъемыФактРезервПрочие
		               |ПОМЕСТИТЬ ВТ_ОбъемыФактРезервПрочие
		               |ИЗ
		               |	РегистрНакопления.упоФактВыполненияОбъемовОбороты КАК упоФактВыполненияОбъемовОбороты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСССПИсключаемыеИзФОТ КАК упоСССПИсключаемыеИзФОТ
		               |		ПО упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд = упоСССПИсключаемыеИзФОТ.СобствСилы_Субподряд
		               |ГДЕ
		               |	упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РК)
		               |	И упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд <> ЗНАЧЕНИЕ(Справочник.упоСобственныеСилыСубподряд.РПО)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача";	
		
		имяВТ = "ВТ_ОбъемыФактРезервПрочие";
		
		МассивПоказателей = Новый Массив;
		МассивПоказателей.Добавить("ОбъемыФактРезервПрочие");
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, имяВТ, СтруктураКолонокИтогов);
		
	КонецЕсли;		
		
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_Результат(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
	
    Перем ТекстЗапроса;
    
    Если СтруктураВыводимыхДопКолонок.Свойство("Результат") Тогда		
        
        ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                       |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                       |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура,
                       |	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Комментарий КАК Комментарий
                       |ПОМЕСТИТЬ ОсновныеРезультатыПолныеДанные
                       |ИЗ
                       |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
                       |			,
                       |			Версия = &_Версия_
                       |				И Основной) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
                       |;
                       |
                       |////////////////////////////////////////////////////////////////////////////////
                       |ВЫБРАТЬ
                       |	ОсновныеРезультатыПолныеДанные.ПроектнаяЗадача КАК ПроектнаяЗадача,
                       |	МАКСИМУМ(ВЫБОР
                       |			КОГДА ЕСТЬNULL(ОсновныеРезультатыПолныеДанные.Комментарий, """") <> """"
                       |				ТОГДА ЕСТЬNULL(ОсновныеРезультатыПолныеДанные.Комментарий, """")
                       |			ИНАЧЕ ЕСТЬNULL(ОсновныеРезультатыПолныеДанные.Номенклатура, НЕОПРЕДЕЛЕНО)
                       |		КОНЕЦ) КАК Результат
                       |ПОМЕСТИТЬ ВТ_Результат
                       |ИЗ
                       |	ОсновныеРезультатыПолныеДанные КАК ОсновныеРезультатыПолныеДанные
                       |
                       |СГРУППИРОВАТЬ ПО
                       |	ОсновныеРезультатыПолныеДанные.ПроектнаяЗадача";	
					   
		СоответствиеДляЗамены = Новый Соответствие;
        СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");			   
					   
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), "Результат", "ВТ_Результат",,"""""");
        
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ОсновноеЗадание(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОсновноеЗадание") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("СтатусОсновногоЗадания")
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("Исполнитель") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	МАКСИМУМ(упоЗадания.Ссылка) КАК ОсновноеЗадание,
		               |	упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу
		               |ПОМЕСТИТЬ ОсновныеЗадания
		               |ИЗ
		               |	Справочник.упоЗадания КАК упоЗадания
		               |ГДЕ
		               |	НЕ упоЗадания.ПометкаУдаления
		               |	И упоЗадания.ЭтоОсновноеЗаданиеПроектнойЗадачи
		               |	И упоЗадания.ВидЗадания = ЗНАЧЕНИЕ(Справочник.упоВидыЗаданий.Поручение)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ОсновноеЗадание
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоЗаданияСтатусыСрезПоследних.Задание КАК Задание,
		               |	упоЗаданияСтатусыСрезПоследних.Статус
		               |ПОМЕСТИТЬ СтатусыЗаданий
		               |ИЗ
		               |	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
		               |			,
		               |			Задание В
		               |				(ВЫБРАТЬ
		               |					ОсновныеЗадания.ОсновноеЗадание
		               |				ИЗ
		               |					ОсновныеЗадания КАК ОсновныеЗадания)) КАК упоЗаданияСтатусыСрезПоследних
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Задание
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ОсновныеЗадания.ОсновноеЗадание,
		               |	ОсновныеЗадания.ОсновноеЗадание.Исполнитель КАК Исполнитель,
		               |	ОсновныеЗадания.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		               |	СтатусыЗаданий.Статус КАК СтатусОсновногоЗадания
		               |ПОМЕСТИТЬ ВТ_ОсновноеЗадание
		               |ИЗ
		               |	ОсновныеЗадания КАК ОсновныеЗадания
		               |		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыЗаданий КАК СтатусыЗаданий
		               |		ПО ОсновныеЗадания.ОсновноеЗадание = СтатусыЗаданий.Задание
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ПроектнаяЗадача";
		
		МассивПоказателей = Новый Массив;
		Если СтруктураВыводимыхДопКолонок.Свойство("ОсновноеЗадание") Тогда
			МассивПоказателей.Добавить("ОсновноеЗадание");
		КонецЕсли;
		Если СтруктураВыводимыхДопКолонок.Свойство("Исполнитель") Тогда
			МассивПоказателей.Добавить("Исполнитель");
		КонецЕсли;
		Если СтруктураВыводимыхДопКолонок.Свойство("СтатусОсновногоЗадания") Тогда
			МассивПоказателей.Добавить("СтатусОсновногоЗадания");
		КонецЕсли;	
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ОсновноеЗадание");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ЗаданияПодразделениям(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
		
	Если Не СтруктураВыводимыхДопКолонок.Свойство("ЗаданиеПодразделению") Тогда
		Возврат;
	КонецЕсли;	
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗаданияСтатусыСрезПоследних.Задание КАК Задание,
	               |	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус,
	               |	упоЗаданияСтатусыСрезПоследних.Задание.ВидЗаданияПодразделению КАК ВидЗаданияПодразделению,
	               |	упоЗаданияСтатусыСрезПоследних.Задание.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ЗаданиеПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Выдано)
	               |			ТОГДА 1
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Уточняется)
	               |			ТОГДА 2
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Выполняется)
	               |			ТОГДА 3
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Завершено)
	               |			ТОГДА 4
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Закрыто)
	               |			ТОГДА 5
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Отменено)
	               |			ТОГДА 6
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолеСортировки
	               |ПОМЕСТИТЬ ВсеСтатусыЗаданийПодразделению
	               |ИЗ
	               |	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
	               |			,
	               |			Задание.ЭтоЗаданиеПодразделению
	               |				И Задание.Проект = &Проект
	               |				И НЕ Задание.ПометкаУдаления) КАК упоЗаданияСтатусыСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Задание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МинимальноеЗадание.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВсеСтатусыЗаданийПодразделению.Статус КАК СтатусЗаданияПодразделению,
	               |	ВсеСтатусыЗаданийПодразделению.ВидЗаданияПодразделению КАК ВидЗаданияПодразделению,
	               |	МинимальноеЗадание.ЗаданиеПодразделениюСсылка КАК ЗаданиеПодразделениюСсылка
	               |ПОМЕСТИТЬ ВТ_ЗаданияПодразделению
	               |ИЗ
	               |	ВсеСтатусыЗаданийПодразделению КАК ВсеСтатусыЗаданийПодразделению
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МинимальныйСтатус.ЗаданиеПроектнаяЗадача КАК ПроектнаяЗадача,
	               |			МИНИМУМ(ВсеСтатусыЗаданийПодразделению.Задание) КАК ЗаданиеПодразделениюСсылка
	               |		ИЗ
	               |			ВсеСтатусыЗаданийПодразделению КАК ВсеСтатусыЗаданийПодразделению
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					ВсеСтатусыЗаданийПодразделению.ЗаданиеПроектнаяЗадача КАК ЗаданиеПроектнаяЗадача,
	               |					МИНИМУМ(ВсеСтатусыЗаданийПодразделению.ПолеСортировки) КАК ПолеСортировки
	               |				ИЗ
	               |					ВсеСтатусыЗаданийПодразделению КАК ВсеСтатусыЗаданийПодразделению
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ВсеСтатусыЗаданийПодразделению.ЗаданиеПроектнаяЗадача) КАК МинимальныйСтатус
	               |				ПО ВсеСтатусыЗаданийПодразделению.ЗаданиеПроектнаяЗадача = МинимальныйСтатус.ЗаданиеПроектнаяЗадача
	               |					И ВсеСтатусыЗаданийПодразделению.ПолеСортировки = МинимальныйСтатус.ПолеСортировки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			МинимальныйСтатус.ЗаданиеПроектнаяЗадача) КАК МинимальноеЗадание
	               |		ПО ВсеСтатусыЗаданийПодразделению.ЗаданиеПроектнаяЗадача = МинимальноеЗадание.ПроектнаяЗадача
	               |			И ВсеСтатусыЗаданийПодразделению.Задание = МинимальноеЗадание.ЗаданиеПодразделениюСсылка";
		
		
	МассивПоказателей = Новый Массив;		
	МассивПоказателей.Добавить("СтатусЗаданияПодразделению");
	МассивПоказателей.Добавить("ВидЗаданияПодразделению");
	МассивПоказателей.Добавить("ЗаданиеПодразделениюСсылка");
	
	ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ЗаданияПодразделению");
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ОсновнаяРоль(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ОсновнаяРоль") ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ПодразделениеОсновнойРоли") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача,
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК ПодразделениеОсновнойРоли,
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК ОсновнаяРоль
		               |ПОМЕСТИТЬ ВТ_ОсновнаяРоль
		               |ИЗ
		               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, Версия = &_Версия_) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		               |ГДЕ
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Основной
		               |	И (упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
		               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0
		               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость <> 0)";
	
		СоответствиеДляЗамены = Новый Соответствие;
        СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");			   
					   
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), "ОсновнаяРоль", "ВТ_ОсновнаяРоль");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ПодразделениеОсновнойРоли", "ВТ_ОсновнаяРоль");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_СрокиПоЗагрузкеРолей(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены, пПараметры)
	
	Если НЕ (СтруктураВыводимыхДопКолонок.Свойство("МесяцНачалаПоПредварительномуУровнюРолей") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("МесяцОкончанияПоПредварительномуУровнюРолей")  
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("МесяцНачалаПоОкончательномуУровнюРолей") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("МесяцОкончанияПоОкончательномуУровнюРолей")) 
		Тогда
			Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаСроковПоЗагрузке.Операция КАК ПроектнаяЗадача,
	               |	МАКСИМУМ(ТаблицаСроковПоЗагрузке.День) КАК Окончание,
	               |	МИНИМУМ(ТаблицаСроковПоЗагрузке.День) КАК Начало
	               |ПОМЕСТИТЬ _ВР_Пром1_
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК ТаблицаСроковПоЗагрузке
	               |ГДЕ
	               |	ТаблицаСроковПоЗагрузке.УровеньПланирования = &УровеньПланирования
	               |	И ТаблицаСроковПоЗагрузке.Проект = &Проект
	               |	И ТаблицаСроковПоЗагрузке.Ресурс ССЫЛКА Справочник.упоРоли
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСроковПоЗагрузке.Операция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	_ВР_Пром1_.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	НАЧАЛОПЕРИОДА(_ВР_Пром1_.Окончание, МЕСЯЦ) КАК _ПоказательОкончания_,
	               |	НАЧАЛОПЕРИОДА(_ВР_Пром1_.Начало, МЕСЯЦ) КАК _ПоказательНачала_
	               |ПОМЕСТИТЬ _ВР_Пром2_
	               |ИЗ
	               |	_ВР_Пром1_ КАК _ВР_Пром1_";
	
	Если СтруктураВыводимыхДопКолонок.Свойство("МесяцНачалаПоПредварительномуУровнюРолей") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("МесяцОкончанияПоПредварительномуУровнюРолей") Тогда
		
		СоответствиеДляЗамены = Новый Соответствие;
		Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.текВерсия Тогда
			СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", "упоАктуальныеПланыТрудозатратПоДнямВерсии");
			СоответствиеДляЗамены.Вставить("ТаблицаСроковПоЗагрузке.Проект = &Проект", "ТаблицаСроковПоЗагрузке.Версия = &текВерсия");
		КонецЕсли;
		СоответствиеДляЗамены.Вставить("_ВР_Пром1_", "ВР_Пром1_Предварительный"); 
		СоответствиеДляЗамены.Вставить("_ВР_Пром2_", "ВТ_СрокиПоПредварительномуУровню");
		СоответствиеДляЗамены.Вставить("_ПоказательНачала_", "МесяцНачалаПоПредварительномуУровнюРолей");  
		СоответствиеДляЗамены.Вставить("_ПоказательОкончания_", "МесяцОкончанияПоПредварительномуУровнюРолей");
		СоответствиеДляЗамены.Вставить("&УровеньПланирования", "Значение(Перечисление.упоУровеньПланирования.Предварительный)");
            
		ПравильныйТекстЗапроса = ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса);				
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ПравильныйТекстЗапроса, "МесяцНачалаПоПредварительномуУровнюРолей", "ВТ_СрокиПоПредварительномуУровню");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "МесяцОкончанияПоПредварительномуУровнюРолей", "ВТ_СрокиПоПредварительномуУровню");
		
	КонецЕсли;
	
	
	Если СтруктураВыводимыхДопКолонок.Свойство("МесяцНачалаПоОкончательномуУровнюРолей") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("МесяцОкончанияПоОкончательномуУровнюРолей") Тогда
		
		СоответствиеДляЗамены = Новый Соответствие;
		Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.текВерсия Тогда
			СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", "упоАктуальныеПланыТрудозатратПоДнямВерсии");
			СоответствиеДляЗамены.Вставить("ТаблицаСроковПоЗагрузке.Проект = &Проект", "ТаблицаСроковПоЗагрузке.Версия = &текВерсия");
		КонецЕсли;
		СоответствиеДляЗамены.Вставить("_ВР_Пром1_", "ВР_Пром1_Окончательный"); 
		СоответствиеДляЗамены.Вставить("_ВР_Пром2_", "ВТ_СрокиПоОкончательномуУровню");
		СоответствиеДляЗамены.Вставить("_ПоказательНачала_", "МесяцНачалаПоОкончательномуУровнюРолей");  
		СоответствиеДляЗамены.Вставить("_ПоказательОкончания_", "МесяцОкончанияПоОкончательномуУровнюРолей");
		СоответствиеДляЗамены.Вставить("&УровеньПланирования", "Значение(Перечисление.упоУровеньПланирования.Окончательный)");

		ПравильныйТекстЗапроса = ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса);				
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ПравильныйТекстЗапроса, "МесяцНачалаПоОкончательномуУровнюРолей", "ВТ_СрокиПоОкончательномуУровню");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "МесяцОкончанияПоОкончательномуУровнюРолей", "ВТ_СрокиПоОкончательномуУровню");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_СрокиПоЗагрузкеТР(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены, пПараметры)
	
	Если НЕ (СтруктураВыводимыхДопКолонок.Свойство("НачалоРаботТР") 
		ИЛИ СтруктураВыводимыхДопКолонок.Свойство("ОкончаниеРаботТР"))  
		Тогда
			Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаСроковПоЗагрузке.Операция КАК ПроектнаяЗадача,
	               |	МАКСИМУМ(ТаблицаСроковПоЗагрузке.День) КАК Окончание,
	               |	МИНИМУМ(ТаблицаСроковПоЗагрузке.День) КАК Начало
	               |ПОМЕСТИТЬ _ВР_Пром1_
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК ТаблицаСроковПоЗагрузке
	               |ГДЕ
				   |	ТаблицаСроковПоЗагрузке.Проект = &Проект
	               |	И ТаблицаСроковПоЗагрузке.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)	               
	               |	И ТаблицаСроковПоЗагрузке.Ресурс ССЫЛКА Справочник.упоТрудовыеРесурсы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаСроковПоЗагрузке.Операция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	_ВР_Пром1_.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	НАЧАЛОПЕРИОДА(_ВР_Пром1_.Окончание, ДЕНЬ) КАК _ПоказательОкончания_,
	               |	НАЧАЛОПЕРИОДА(_ВР_Пром1_.Начало, ДЕНЬ) КАК _ПоказательНачала_
	               |ПОМЕСТИТЬ _ВР_Пром2_
	               |ИЗ
	               |	_ВР_Пром1_ КАК _ВР_Пром1_";
	
	
	СоответствиеДляЗамены = Новый Соответствие;
	Если пПараметры.ТекущаяВерсияПроектаВСистеме <> пПараметры.текВерсия Тогда
		СоответствиеДляЗамены.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", "упоАктуальныеПланыТрудозатратПоДнямВерсии");
		СоответствиеДляЗамены.Вставить("ТаблицаСроковПоЗагрузке.Проект = &Проект", "ТаблицаСроковПоЗагрузке.Версия = &текВерсия");
	КонецЕсли;	
	СоответствиеДляЗамены.Вставить("_ВР_Пром1_", "ВР_Пром1_ТР"); 
	СоответствиеДляЗамены.Вставить("_ВР_Пром2_", "ВТ_СрокиПоТР");
	СоответствиеДляЗамены.Вставить("_ПоказательНачала_", "НачалоРаботТР");  
	СоответствиеДляЗамены.Вставить("_ПоказательОкончания_", "ОкончаниеРаботТР");
        
	ПравильныйТекстЗапроса = ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса);				
	
	ДобавитьПоказательВЗапрос(ТекстыЗамены, ПравильныйТекстЗапроса, "НачалоРаботТР", "ВТ_СрокиПоТР");
	ДобавитьПоказательВЗапрос(ТекстыЗамены, "", "ОкончаниеРаботТР", "ВТ_СрокиПоТР");
		
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_КоличествоРолей(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
	
	Если СтруктураВыводимыхДопКолонок.Свойство("КоличествоРолей") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс) КАК КоличествоРолей
		               |ПОМЕСТИТЬ ВТ_КоличествоРолей
		               |ИЗ
		               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, Версия = &_Версия_) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		               |ГДЕ
		               |	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
		               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0
		               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость <> 0)
		               |СГРУППИРОВАТЬ ПО
		               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача";
	
		СоответствиеДляЗамены = Новый Соответствие;
        СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");			   
					   
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), "КоличествоРолей", "ВТ_КоличествоРолей");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_КоличествоИсполнителей(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
	
	Если СтруктураВыводимыхДопКолонок.Свойство("КоличествоИсполнителей") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс) КАК КоличествоИсполнителей
		               |ПОМЕСТИТЬ ВТ_КоличествоИсполнителей
		               |ИЗ
		               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
		               |			,
		               |			Версия = &_Версия_
		               |				И Проект = &Проект) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
		               |ГДЕ
		               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача";
	
		СоответствиеДляЗамены = Новый Соответствие;
        СоответствиеДляЗамены.Вставить("_Версия_", "ТекВерсия");			   
					   
        ДобавитьПоказательВЗапрос(ТекстыЗамены, ВыполнитьПодменуВТекстеЗапроса(СоответствиеДляЗамены, ТекстЗапроса), "КоличествоИсполнителей", "ВТ_КоличествоИсполнителей");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ФактическиеСроки(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
    
	Перем ТекстЗапроса;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаФакт")
		Или СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияФакт") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.ПроектнаяЗадача,
		|	Таблица.ДатаНачала КАК ДатаНачалаФакт,
		|	Таблица.ДатаЗавершения КАК ДатаЗавершенияФакт
		|ПОМЕСТИТЬ ВТ_ФактическиеСроки
		|ИЗ
		|	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &текВерсия) КАК Таблица
		| ";	
		
		МассивПоказателей = Новый Массив;
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаФакт") Тогда
			МассивПоказателей.Добавить("ДатаНачалаФакт");
		КонецЕсли;
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияФакт") Тогда
			МассивПоказателей.Добавить("ДатаЗавершенияФакт");
		КонецЕсли;
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_ФактическиеСроки", , "ДАТАВРЕМЯ(1, 1, 1)");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_ПрогнозныеСрокиПроектныхЗадач(Знач СтруктураВыводимыхДопКолонок, Знач ТекстыЗамены)
    
	Перем ТекстЗапроса;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат;	
	КонецЕсли;
	
	Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаПрогноз")
		Или СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияПрогноз")
		Или СтруктураВыводимыхДопКолонок.Свойство("СтатусСроков") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.ПроектнаяЗадача,
		|	Таблица.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
		|	Таблица.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
		|	Таблица.СтатусСроков КАК СтатусСроков
		|ПОМЕСТИТЬ ВТ_СтатусСроков
		|ИЗ
		|	РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &текВерсия) КАК Таблица
		| ";	
		
		МассивПоказателей = Новый Массив;
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаНачалаПрогноз") Тогда
			МассивПоказателей.Добавить("ДатаНачалаПрогноз");
		КонецЕсли;
		Если СтруктураВыводимыхДопКолонок.Свойство("ДатаЗавершенияПрогноз") Тогда
			МассивПоказателей.Добавить("ДатаЗавершенияПрогноз");
		КонецЕсли;
		
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, МассивПоказателей, "ВТ_СтатусСроков", , "ДАТАВРЕМЯ(1, 1, 1)");
		ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапроса, "СтатусСроков", "ВТ_СтатусСроков", , "Неопределено");
		
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоказателиВЗапрос_Переопределяемый(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов, ТекстыЗамены, пПараметры)
		
КонецПроцедуры

Процедура ДополнитьСтруктуруКолонокИтогов(СтруктураВыводимыхДопКолонок, СтруктураКолонокИтогов)
	
	// Добавляем в итоги расчетные показатели, которые после построчного расчета
	// будут собираться для элементов иерархии простым суммированием.
	
	Если СтруктураВыводимыхДопКолонок.Свойство("EV") Тогда
		СтруктураКолонокИтогов.Вставить("EV");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция КолонкаОтмеченаВСпискеКолонок(СписокКолонок, ИмяКолонки) Экспорт
	Колонка = СписокКолонок.НайтиПоЗначению(ИмяКолонки);		
	Если Колонка = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Колонка.Пометка;
	КонецЕсли;
КонецФункции

#КонецОбласти

Функция ИспользуетсяКолонкаИзМассива(СписокКолонок, МассивКолонок)
	
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		Колонка = СписокКолонок.НайтиПоЗначению(ИмяКолонки);
		Если Колонка <> Неопределено И Колонка.Пометка Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#Область ДополнениеТекстаЗапросаПолученияДанныхДляСтруктураСлужебная

// Экспорт функции для использования в расширении
Функция ВыполнитьПодменуВТекстеЗапроса(Знач СоответствиеДляЗамены, Знач ТекстЗапроса) Экспорт
	
	Для каждого ЭлементПодмены Из СоответствиеДляЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЭлементПодмены.Ключ, ЭлементПодмены.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Экспорт функции для использования в расширении
Функция ДобавитьПоказательВЗапрос(ТекстыЗамены, ТекстЗапросаПоказателя, ИмяПоказателя = Неопределено,
	ИмяТаблицы = Неопределено, СтруктураКолонокИтогов = Неопределено, ПустоеЗначение = "0") Экспорт
	
	// Обрабатываем ситуацию, когда в запросе несколько колонок - ресурсов.
	
	Если ТипЗнч(ИмяПоказателя) = Тип("Строка") Тогда
		
		МассивИменПоказателей = Новый Массив;
		МассивИменПоказателей.Добавить(ИмяПоказателя);
		
	ИначеЕсли ТипЗнч(ИмяПоказателя) = Тип("Массив") Тогда
		
		МассивИменПоказателей = ИмяПоказателя;
		
	Иначе 
		
		МассивИменПоказателей = Новый Массив;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстЗапросаПоказателя) И ЗначениеЗаполнено(ИмяТаблицы) Тогда
		
		ТекстСоединения = "ЛЕВОЕ СОЕДИНЕНИЕ " + ИмяТаблицы + " КАК " + ИмяТаблицы + " ПО "+ИмяТаблицы + ".ПроектнаяЗадача = ПЗы.Ссылка";
		
		Если Найти(ТекстыЗамены.СоединенияТаблицДопПоказателей, ТекстСоединения) = 0 Тогда
			ТекстыЗамены.ТекстыЗапросов = ТекстыЗамены.ТекстыЗапросов + ТекстЗапросаПоказателя + Символы.ПС + ";" + Символы.ПС;		
			ТекстыЗамены.СоединенияТаблицДопПоказателей = ТекстыЗамены.СоединенияТаблицДопПоказателей + Символы.ПС + ТекстСоединения;
		КонецЕсли;
	КонецЕсли;
	
	МассивКолонокИсключаемыхИзРасчетаИтогов = ПолучитьМассивКолонокИсключаемыхИзРасчетаИтогов();
	
	Для Каждого СтрокаПоказатель Из МассивИменПоказателей Цикл		
		
		Если ЗначениеЗаполнено(СтрокаПоказатель) Тогда
			Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
				Поле = " ISNULL("+ИмяТаблицы+"."+СтрокаПоказатель+", "+ПустоеЗначение+")";
			Иначе
				Поле = "(" + ПустоеЗначение + ")";
			КонецЕсли;
			ТекстыЗамены.ПоказателиВИтоговойВыборкеДляПЗ = ТекстыЗамены.ПоказателиВИтоговойВыборкеДляПЗ 
				+ ?(ЗначениеЗаполнено(ТекстыЗамены.ПоказателиВИтоговойВыборкеДляПЗ), ", ", "") + Поле + " КАК " + СтрокаПоказатель;
			ТекстыЗамены.ПоказателиВИтоговойВыборкеНеПЗ = ТекстыЗамены.ПоказателиВИтоговойВыборкеНеПЗ 
				+ ?(ЗначениеЗаполнено(ТекстыЗамены.ПоказателиВИтоговойВыборкеНеПЗ), ", ", "") + ПустоеЗначение;
		КонецЕсли; 	
		
		Если СтруктураКолонокИтогов <> Неопределено И ЗначениеЗаполнено(СтрокаПоказатель) 
			И МассивКолонокИсключаемыхИзРасчетаИтогов.Найти(СтрокаПоказатель) = Неопределено Тогда
			
			СтруктураКолонокИтогов.Вставить(СтрокаПоказатель);
			
		КонецЕсли; 
		
	КонецЦикла;
		
КонецФункции

Функция ДополнитьСтруктуруКолонокЗависимостями(СтруктураКолонок, СтруктураЗависимостей = Неопределено, КолонкиУжеОбошли = Неопределено) Экспорт
	
	Если СтруктураЗависимостей = Неопределено Тогда
		СтруктураЗависимостей = ПолучитьСтруктуруЗависимостей();
		КолонкиУжеОбошли = Новый Массив;
	КонецЕсли;
	
	КопияСтруктураКолонок = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураКолонок);
	Для Каждого КлючЗначение Из КопияСтруктураКолонок Цикл
		ЗначениеСтруктурыЗависимостей = Неопределено;
		Если СтруктураЗависимостей.Свойство(КлючЗначение.Ключ, ЗначениеСтруктурыЗависимостей) Тогда
			Если КолонкиУжеОбошли.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				Продолжить;
			Иначе
				КолонкиУжеОбошли.Добавить(КлючЗначение.Ключ);
			КонецЕсли;
			СтруктураПодч = Новый Структура(ЗначениеСтруктурыЗависимостей);
			ДополнитьСтруктуруКолонокЗависимостями(СтруктураПодч, СтруктураЗависимостей, КолонкиУжеОбошли);
			Для Каждого КлючЗначениеПодч Из СтруктураПодч Цикл
				Если Не СтруктураКолонок.Свойство(КлючЗначениеПодч.Ключ) Тогда
					СтруктураКолонок.Вставить(КлючЗначениеПодч.Ключ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ПрограммныеКолонкиСлужебная

Процедура ДобавитьПодсказкуПрограммнойКолонке(СоответствиеКолонок, ИмяКолонки, ТекстПодсказки)
	
	ДанныеКолонки = СоответствиеКолонок.Получить(ИмяКолонки);
	ДанныеКолонки.Вставить("Подсказка", ТекстПодсказки);
	СоответствиеКолонок.Вставить(ИмяКолонки, ДанныеКолонки);
	
КонецПроцедуры

Процедура ДобавитьСтандартнуюКолонкуВыполнимости(СоответствиеКолонок, Имя, Представление, ИмяГруппы, ПослеЭлемента = "^")
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, Имя, Представление,, 
														Ложь, 4, ИмяГруппы, ПослеЭлемента,  Новый ОписаниеТипов("Строка, Число", Новый КвалификаторыЧисла(10, 0)),, Ложь);	
														
КонецПроцедуры

Процедура ДобавитьСтандартнуюЧисловуюКолонку(СоответствиеКолонок, Имя, Представление, ИмяГруппы, Обязательна = Ложь, ПослеЭлемента = "^", Редактирование = Ложь, Формат = "")
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, Имя, Представление,, 
		Ложь, 9, ИмяГруппы, ПослеЭлемента,  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),, Редактирование,,, Обязательна, Формат);

														
КонецПроцедуры   

Процедура ДобавитьСтандартнуюКолонкуДаты(СоответствиеКолонок, Имя, Представление, ИмяГруппы, ПослеЭлемента = "^")
	
	ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, Имя, Представление,, 
														Ложь, 10, ИмяГруппы, ПослеЭлемента,  Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)),, Ложь,,,, "ДФ=dd.MM.yyyy");
													
КонецПроцедуры

Процедура ДобавитьПараметрыПрограммнойКолонки(СоответствиеКолонок, Имя, Представление, БезОтображения = Ложь, ЭтоГруппа = Истина, ШиринаЭлемента = 0, ГруппаПоУмолчанию = "", ПослеЭлемента = "^",
											ОписаниеТипов = Неопределено, Зависимости = Неопределено, Редактирование = Ложь, ХранитьДанныеБазы = Ложь, 
											ВидимаПоУмолчанию = Ложь, Обязательна = Ложь, Формат = "", ЭтоПолеВвода = Истина, СобытияИзменений = Ложь)
											
	ПараметрыКолонки = Новый Структура("Имя, Представление, БезОтображения, ЭтоГруппа, ГруппаПоУмолчанию, ПослеЭлемента, ОписаниеТипов"
					+ ", Зависимости, Редактирование, ХранитьДанныеБазы, ВидимаПоУмолчанию, Обязательна, ШиринаЭлемента"
					+ ", Формат, ЭтоПолеВвода, СобытияИзменений",  
					Имя, Представление, БезОтображения, ЭтоГруппа, ГруппаПоУмолчанию, ПослеЭлемента, ОписаниеТипов,
					Зависимости, Редактирование, ХранитьДанныеБазы, ВидимаПоУмолчанию, Обязательна, ШиринаЭлемента,
					Формат, ЭтоПолеВвода, СобытияИзменений);		 					
					
	СоответствиеКолонок.Вставить(Имя, ПараметрыКолонки);					
	ДопИнформация = СоответствиеКолонок.Получить("_ДопИнформация");
	ДопИнформация.ПорядокДобавления.Добавить(Имя);	
	
	Если ПослеЭлемента = "^" Тогда
		ПараметрыКолонки.Вставить("ПослеЭлемента", ДопИнформация.ПорядокДобавления[ДопИнформация.ПорядокДобавления.Количество()-2]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
