
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	// Если документ введен не на основании,
	// то интерфейс должен отработать эту ситуацию.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача");
	
	ИнициализироватьРеквизиты();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Перем ПроектнаяЗадача;
	
	ТипЗначения = ТипЗнч(ВыбранноеЗначение);
	Если ТипЗначения = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ПроектнаяЗадача = ВыбранноеЗначение;
	ИначеЕсли ТипЗначения = Тип("СписокЗначений") 
	 		И ВыбранноеЗначение.Количество() <> 0
	  		И ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ПроектнаяЗадача = ВыбранноеЗначение[0].Значение;
	ИначеЕсли ТипЗначения = Тип("Массив")
			И ВыбранноеЗначение.Количество() <> 0
	  		И ТипЗнч(ВыбранноеЗначение[0]) = Тип("ДокументСсылка.упоПроектнаяЗадача")  Тогда
		ПроектнаяЗадача = ВыбранноеЗначение[0];
	КонецЕсли;
	
	ОбработкаВыбораНаСервере(ПроектнаяЗадача);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ПроектнаяЗадача, ИсточникВыбора);
	
	АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ = 
		ДоступныеРолиПЗ(Объект.ПроектнаяЗадача, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	Оповестить("НазначениеТрудовыхРесурсов", Объект.ПроектнаяЗадача, Объект.Ссылка);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.НадписьДокументОснованиеНажатие(Объект, ЭтаФорма, "Проект");
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.НадписьДокументОснованиеНажатие(Объект, ЭтаФорма, "ПроектнаяЗадача");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыделяемыеРесурсы

&НаКлиенте
Процедура ВыделяемыеРесурсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		
		Отказ = Истина;
		
		Если ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
			ПараметрыПодбора = ПодготовитьДопПараметры();
			упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
			ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
		Иначе 
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите проектную задачу'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделяемыеРесурсыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УдалитьДублиРесурсовИзВыбранныхЗначений(ВыбранноеЗначение);
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Ресурс", Объект.ВыделяемыеРесурсы, ЭтаФорма);
	
	ПараметрыПодбора = Новый СписокЗначений;
	ПараметрыПодбора.Добавить(АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
	
	ЗаполнитьДопДанныеВыделяемыхРесурсов(ВыбранноеЗначение, ПараметрыПодбора);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыделяемыеРесурсыРольРесурсаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ВыделяемыеРесурсы.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		
		РольРесурса = ТекДанные.РольРесурса;
		
		МассивПодразделений = ПолучитьМассивПодразделений(РольРесурса, АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
		КоличествоПодразделений = МассивПодразделений.Количество();
		Если КоличествоПодразделений > 0
			И МассивПодразделений.Найти(ТекДанные.Подразделение) = Неопределено Тогда
			
			ПодобранноеПодразделение = МассивПодразделений[0];
			
			//ТекстСообщения = НСтр("ru='Выбранное подразделение " + ТекДанные.Подразделение 
			//	+ " не соответствует подразделениям, определенным в проектной задаче для роли " 
			//	+ ТекДанные.РольРесурса + "
			//	|Системой было автоматически установлено подразделение " + ПодобранноеПодразделение + "'");
			//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
			ТекДанные.Подразделение = ПодобранноеПодразделение;
			
		ИначеЕсли КоличествоПодразделений > 0
			И (НЕ МассивПодразделений.Найти(ТекДанные.Подразделение) = Неопределено) Тогда
			
			// Все ок, оставляем
			
		Иначе // Если в плане ПЗ нет подходящих подразделений, подбираем по дате регистрации.
			
			ТекДанные.Подразделение = ПодразделениеРолиПроектнойЗадачи(РольРесурса, Объект.ПроектнаяЗадача);
								
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодразделениеРолиПроектнойЗадачи(Роль, ПроектнаяЗадача)
	
	СрокиПЗ = упоПроектыИЗадачиСервер.ПолучитьСрокиПроектнойЗадачи(ПроектнаяЗадача);
	
	Подразделение = упоРесурсыИРолиВызовСервера.обПолучитьПодразделениеРоли(Роль, СрокиПЗ.ДатаНачалаПлан);
	
	Возврат Подразделение;
	
КонецФункции	


&НаКлиенте
Процедура ВыделяемыеРесурсыВариантРаспределенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыделяемыеРесурсы.ТекущиеДанные;
	Если ТекущиеДанные.ВариантРаспределения = ПредопределенноеЗначение("Перечисление.упоВариантыРаспределенияТрудозатрат.ПоОперативнойЗагрузке") Тогда
		ТекущиеДанные.ДоляТрудозатрат = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделяемыеРесурсыРольРесурсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ВыделяемыеРесурсы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда      
		Возврат;
	КонецЕсли; 
	
	ОткрытьПодборРолиРесурса(ТекДанные.Ресурс, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделяемыеРесурсыПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ВыделяемыеРесурсы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборПодразделенияРолиРесурса(ТекДанные.РольРесурса, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделяемыеРесурсыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ВыбранноеЗначение = ПараметрыПеретаскивания.Значение;
	
	МассивРесурсов = Новый СписокЗначений;
	
	ТипВыбранногоЗначения = ТипЗнч(ВыбранноеЗначение);
	Если ТипВыбранногоЗначения = Тип("СписокЗначений") Тогда
		МассивРесурсов = ВыбранноеЗначение.ВыгрузитьЗначения();
	ИначеЕсли ТипВыбранногоЗначения = Тип("Массив") Тогда
		МассивРесурсов = ВыбранноеЗначение;
	Иначе
		МассивРесурсов.Добавить(ВыбранноеЗначение);
	КонецЕсли;
	
	ИмяКолонки = "Ресурс";
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(МассивРесурсов, ИмяКолонки, Объект.ВыделяемыеРесурсы, ЭтаФорма);
	
	ПараметрыПодбора = Новый СписокЗначений;
	ПараметрыПодбора.Добавить(АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
	
	ЗаполнитьДопДанныеВыделяемыхРесурсов(МассивРесурсов, ПараметрыПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделяемыеРесурсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ИмяПоля = СтрЗаменить(Поле.Имя, Элемент.Имя, "");
	Если ИмяПоля = "Ресурс" Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаТаблицы = Объект.ВыделяемыеРесурсы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда
			ПоказатьЗначение(, СтрокаТаблицы[ИмяПоля]);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура ВыделяемыеРесурсыАктивизироватьСтроку()
	
	// После добавления строк - ни одна из них не активна, при этом заголовки колонок выглядят некорректно.
	Если (Объект.ВыделяемыеРесурсы.Количество() > 0) И (Элементы.ВыделяемыеРесурсы.ТекущаяСтрока = Неопределено) Тогда
		Элементы.ВыделяемыеРесурсы.ТекущаяСтрока = Объект.ВыделяемыеРесурсы[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсвобождаемыеРесурсы

&НаКлиенте
Процедура ОсвобождаемыеРесурсыРольРесурсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ОсвобождаемыеРесурсы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда      
		Возврат;
	КонецЕсли; 
	
	ОткрытьПодборРолиРесурса(ТекДанные.Ресурс, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвобождаемыеРесурсыПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ОсвобождаемыеРесурсы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПодборПодразделенияРолиРесурса(ТекДанные.РольРесурса, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвобождаемыеРесурсыРесурсПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОсвобождаемыеРесурсы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтруктураДанныхСтроки = ПолучитьСтруктуруДанныхСтрокиОсвобождаемыеРесурсы();
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, ТекДанные);
		
		ПараметрыПодбора = Новый СписокЗначений;
		ПараметрыПодбора.Добавить(АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
		ДополнитьСтрокуОсвобождаемыеРесурсы(СтруктураДанныхСтроки, ПараметрыПодбора);
		
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураДанныхСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвобождаемыеРесурсыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Ресурс = Элемент.ТекущиеДанные.Ресурс;
	ПроверитьДублиРесурсов(Ресурс, Объект.ОсвобождаемыеРесурсы, Объект.ВыделяемыеРесурсы, ОтменаРедактирования, Отказ);
	
	Если Не Отказ Тогда
		Возврат;
	КонецЕсли;

	НайденнаяСтрока = Объект.ОсвобождаемыеРесурсы.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	Если НайденнаяСтрока <> Неопределено Тогда
		НайденнаяСтрока.Ресурс = Неопределено;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьТР(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите проектную задачу'"));
		Возврат;
	КонецЕсли;
	ПараметрыПодбора = ПодготовитьДопПараметры();
		  	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
	
	ВыделяемыеРесурсыАктивизироватьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсвобождаемыеТР(Команда)
	
	ИмяТЧ = "ОсвобождаемыеРесурсы";
	
	Контекст = Новый Структура("ИмяТЧ",ИмяТЧ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьОсвобождаемыеТРЗавершение", ЭтотОбъект, Контекст);	
	
	упоЗаполнениеИПодборКлиент.НадоЗаполнятьТабличнуюЧастьДокумента(ЭтаФорма, Объект, ИмяТЧ, Объект[ИмяТЧ],,,ОписаниеОповещения);
	
КонецПроцедуры     

&НаКлиенте
Процедура ЗаполнитьОсвобождаемыеТРЗавершение(НадоЗаполнять, ДополнительныеПараметры) Экспорт
	
	Если НадоЗаполнять Тогда
		ЗаполнитьТабличнуюЧастьДокумента(ДополнительныеПараметры.ИмяТЧ);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНазначаемыеТР(Команда)
	
	ИмяТЧ = "ВыделяемыеРесурсы";
	
	Контекст = Новый Структура("ИмяТЧ", ИмяТЧ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьНазначаемыеТРЗавершение", ЭтотОбъект, Контекст);	
	
	упоЗаполнениеИПодборКлиент.НадоЗаполнятьТабличнуюЧастьДокумента(ЭтаФорма, Объект, ИмяТЧ, Объект[ИмяТЧ],,,ОписаниеОповещения);
	
	ВыделяемыеРесурсыАктивизироватьСтроку();
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьНазначаемыеТРЗавершение(НадоЗаполнять, ДополнительныеПараметры) Экспорт
	
	Если НадоЗаполнять Тогда
		ЗаполнитьТабличнуюЧастьДокумента(ДополнительныеПараметры.ИмяТЧ);	
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
// Конец СтандартныеПодсистемы.Свойства

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено,
	П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, 
	П3 = Неопределено, П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ИнициализироватьРеквизиты()
	
	АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ = 
		ДоступныеРолиПЗ(Объект.ПроектнаяЗадача, ЭтотОбъект.УникальныйИдентификатор);
	
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	
	УказыватьПодразделениеРолиПриПланированииТР = СвойстваПроекта.УказыватьПодразделениеРолиПриПланированииТР;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.
	тОбъект = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);
	тОбъект.ОбработкаЗаполнения(ВыбранноеЗначение);
	ЗначениеВДанныеФормы(тОбъект, Объект);
	
	// И приведем гиперссылку в правильный вид.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача");
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабличнуюЧастьДокумента(ИмяТЧ)
	
	ТаблицаДанных = Документы[Объект.Ссылка.Метаданные().Имя].СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект, ИмяТЧ);
	Объект[ИмяТЧ].Загрузить(ТаблицаДанных);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДопДанныеВыделяемыхРесурсов(СписокРесурсов, ПараметрыПодбора)
	
	Если ПараметрыПодбора.Количество() > 0 Тогда
		
		ТЗПараметры = ПолучитьИзВременногоХранилища(ПараметрыПодбора[0].Значение);
		
		Если НЕ ТипЗнч(ТЗПараметры) = Тип("ТаблицаЗначений") Тогда
			ВызватьИсключение НСтр("ru = 'НЕ ТипЗнч(ТЗПараметры) = Тип(""ТаблицаЗначений"")'");
			Возврат;
		КонецЕсли;
		
		Если ТЗПараметры.Количество() > 0 Тогда
			
			Для Каждого СтрокаТЧ Из Объект.ВыделяемыеРесурсы Цикл
				Если СписокРесурсов.НайтиПоЗначению(СтрокаТЧ.Ресурс) = Неопределено Тогда
					Продолжить;					
				КонецЕсли;	
				ЗаполнитьСтрокуВыделяемыеРесурсы(СтрокаТЧ, ТЗПараметры);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборРолиРесурса(Ресурс, РодительскийЭлементУправления)
		
	МассивРолей = ПолучитьМассивРолейТР(Ресурс, АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
	СписокРолей = Новый СписокЗначений();
	СписокРолей.ЗагрузитьЗначения(МассивРолей);
	
	СтруктураОтбора = Новый Структура("Ссылка", СписокРолей);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	СтруктураПараметров.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.упоРоли.ФормаВыбора", СтруктураПараметров, РодительскийЭлементУправления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПодразделенияРолиРесурса(РольРесурса, РодительскийЭлементУправления)
	
	МассивПодразделений = ПолучитьМассивПодразделений(РольРесурса, АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
	
	СтруктураОтбора = Новый Структура("Ссылка", МассивПодразделений);
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	СтруктураПараметров.Вставить("РежимОтображенияТаблицы", "Список");
	ОткрытьФорму("Справочник.упоПодразделения.ФормаВыбора", СтруктураПараметров, РодительскийЭлементУправления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры()
	
	Перем ПараметрыПодбора;
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	ПараметрыПодбора.ЭлементВладелец = Элементы.ВыделяемыеРесурсы;
	ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.упоТрудовыеРесурсы";
    ТаблицаФормы = Объект.ВыделяемыеРесурсы;
	ИмяКолонки = "Ресурс"; 
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(ТаблицаФормы, ИмяКолонки, ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
			
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	ПараметрыПодбора.ДопПараметры.КоллекцияДоступныеДляВыбора = СтруктураДоп.АдресХранилищаДоступныеДляВыбора;
	ПараметрыПодбора.ДопПараметры.ШаблонТекстаОшибки = СтруктураДоп.ШаблонТекстаОшибки;
		
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыПодбора(ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп = Новый Структура;
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	СтруктураДоп.Вставить("АдресХранилищаДоступныеДляВыбора");
	СтруктураДоп.Вставить("ШаблонТекстаОшибки",
		НСтр("ru = 'Трудовому ресурсу %1 не назначена ни одна роль текущей проектной задачи.'"));
	
	СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора();

	АдресХранилища = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	СтруктураДоп.АдресХранилищаДоступныеДляВыбора = ПодготовитьТаблицуДоступныхРесурсов();
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора()
	
	АдресВХ = Документы.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу.ПодготовитьТаблицуТрудовыхРесурсовПроектнойЗадачи(
		Объект.ПроектнаяЗадача, ЭтаФорма.УникальныйИдентификатор);
		
	Возврат АдресВХ;
	  
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуДоступныхРесурсов()
	
	МассивРесурсов = Новый Массив;
	
	ИмяКолонки = "Ресурс";
	
	ТЗРесурсыИРоли = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
	
	ВХранилищеЕстьДанные = ЗначениеЗаполнено(ТЗРесурсыИРоли)
		И ТЗРесурсыИРоли.Колонки.Найти(ИмяКолонки) <> Неопределено;
	
	Если ВХранилищеЕстьДанные Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Роли.Ресурс КАК Ресурс
			|ИЗ
			|	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(, Роль В (&СписокРолей)) КАК Роли
			|ГДЕ
			|	Роли.РольНазначена";
		Запрос.УстановитьПараметр("СписокРолей", ТЗРесурсыИРоли.ВыгрузитьКолонку(ИмяКолонки));
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивРесурсов.Добавить(Выборка.Ресурс);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(МассивРесурсов);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеРолиПЗ(ПроектнаяЗадача, Адрес)
	
	Если Не ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Сначала необходимо указать проектную задачу.'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Рег.Ресурс КАК Ресурс,
	               |	Рег.Подразделение КАК Подразделение,
	               |	Рег.УровеньПланирования КАК УровеньПланирования,
	               |	упоРолиТрудовыхРесурсовСрезПоследних.Ресурс КАК ТрудовойРесурс
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |			,
	               |			Версия = &ТекВерсия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК Рег
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних КАК упоРолиТрудовыхРесурсовСрезПоследних
	               |		ПО Рег.Ресурс = упоРолиТрудовыхРесурсовСрезПоследних.Роль
	               |			И (упоРолиТрудовыхРесурсовСрезПоследних.РольНазначена)
	               |ГДЕ
	               |	(Рег.Количество <> 0
	               |			ИЛИ Рег.Стоимость <> 0
	               |			ИЛИ Рег.ВнешняяСтоимость <> 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Рег.Ресурс";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоступныхРолей = РезультатЗапроса.Выгрузить();
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаДоступныхРолей, Адрес);
	
	Возврат АдресХранилища;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСтрокуВыделяемыеРесурсы(СтрокаТабличнойЧасти, ТЗПараметры)
	
	СтрокаТабличнойЧасти.ВариантРаспределения = ПредопределенноеЗначение("Перечисление.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат");
	СтрокаТабличнойЧасти.ДоляТрудозатрат = 100;
	СтрокаТабличнойЧасти.ДоляТрудозатратПоУровнюПланирования = Перечисления.упоУровеньПланирования.Окончательный;
	
	Если НЕ СтрокаТабличнойЧасти.РольРесурса.Пустая() И НЕ СтрокаТабличнойЧасти.Подразделение.Пустая() Тогда
		Возврат;	   
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТрудовойРесурс", СтрокаТабличнойЧасти.Ресурс);
	Отбор.Вставить("УровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
	
	Роль = Неопределено;
	Подразделение = Неопределено;
	ПоУровнюПланирования = Неопределено;
	
	НайденныеСтроки = ТЗПараметры.НайтиСтроки(Отбор); 
	Если НайденныеСтроки.Количество() Тогда
		Роль = НайденныеСтроки[0].Ресурс;
		Подразделение = НайденныеСтроки[0].Подразделение;
		ПоУровнюПланирования = НайденныеСтроки[0].УровеньПланирования;
	Иначе
		Отбор.Вставить("УровеньПланирования", Перечисления.упоУровеньПланирования.Предварительный);
		НайденныеСтроки = ТЗПараметры.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Роль = НайденныеСтроки[0].Ресурс;
			Подразделение = НайденныеСтроки[0].Подразделение;
			ПоУровнюПланирования = НайденныеСтроки[0].УровеньПланирования;				
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.РольРесурса = Роль;
	СтрокаТабличнойЧасти.Подразделение = Подразделение;
	СтрокаТабличнойЧасти.ДоляТрудозатратПоУровнюПланирования = ПоУровнюПланирования;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьСтрокуОсвобождаемыеРесурсы(ДанныеСтроки, ПараметрыПодбора)
	
	ТаблицаДоступныхРолей = ПолучитьИзВременногоХранилища(ПараметрыПодбора[0].Значение); // ПараметрыПодбора[0].Значение - это
																						 // АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ
	Если НЕ ТипЗнч(ТаблицаДоступныхРолей) = Тип("ТаблицаЗначений") Тогда
		ВызватьИсключение НСтр("ru = 'НЕ ТипЗнч(ТаблицаДоступныхРолей) = Тип(""ТаблицаЗначений"")'");
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ТрудовойРесурс", ДанныеСтроки.Ресурс);
	НайденныеСтроки = ТаблицаДоступныхРолей.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		ДанныеСтроки.Подразделение = НайденныеСтроки[0].Подразделение;
		ДанныеСтроки.РольРесурса = НайденныеСтроки[0].Ресурс;
	Иначе
		ДанныеСтроки.Подразделение = Справочники.упоПодразделения.ПустаяСсылка();
		ДанныеСтроки.РольРесурса = Справочники.упоРоли.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивРолейТР(ТрудовойРесурс, АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ)
	
	ТаблицаДоступныхРолей = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
	МассивРолей = ?(ЗначениеЗаполнено(ТрудовойРесурс),
					ТаблицаДоступныхРолей.Скопировать(Новый Структура("ТрудовойРесурс", ТрудовойРесурс)).ВыгрузитьКолонку("Ресурс"),
					ТаблицаДоступныхРолей.ВыгрузитьКолонку("Ресурс"));
					
	Возврат МассивРолей;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивПодразделений(РольРесурса, АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ)
	
	МассивПодразделений = Новый Массив;
	
	ТаблицаДоступныхРолей = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаДанныеОДоступныхРоляхПЗ);
	
	Если ЗначениеЗаполнено(РольРесурса) Тогда
		НайденныеСтроки = ТаблицаДоступныхРолей.НайтиСтроки(Новый Структура("Ресурс", РольРесурса));
		Для каждого СтрокаДанные Из НайденныеСтроки Цикл
			Подразделение = СтрокаДанные.Подразделение;
			Если МассивПодразделений.Найти(Подразделение) = Неопределено Тогда
				МассивПодразделений.Добавить(Подразделение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивПодразделений = ТаблицаДоступныхРолей.ВыгрузитьКолонку("Подразделение");
	КонецЕсли;
	
	Возврат МассивПодразделений;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруДанныхСтрокиОсвобождаемыеРесурсы()
	
	Возврат Новый Структура("НомерСтроки, Ресурс, РольРесурса, Подразделение");
	
КонецФункции

&НаКлиенте
Процедура ПроверитьДублиРесурсов(Ресурс, ПроверяемаяТаблица1, ПроверяемаяТаблица2, ОтменаРедактирования, Отказ)

	упоРаботаСФормамиКлиент.ПроверитьДублиРесурсов("Ресурс", Ресурс, ПроверяемаяТаблица1, ОтменаРедактирования, Отказ);			
	упоРаботаСФормамиКлиент.ПроверитьДублиРесурсов("Ресурс", Ресурс, ПроверяемаяТаблица2, ОтменаРедактирования, 
		Отказ, , Истина);	
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДублиРесурсовИзВыбранныхЗначений(ВыбранноеЗначение)

	ДублиРесурсов = Новый Массив;
	Для каждого Ресурс Из ВыбранноеЗначение Цикл
		Отказ = Ложь;
		ПроверитьДублиРесурсов(Ресурс.Значение, Объект.ВыделяемыеРесурсы, Объект.ОсвобождаемыеРесурсы, Ложь, Отказ);
		Если Отказ Тогда
			ДублиРесурсов.Добавить(Ресурс.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ДубльРесурса Из ДублиРесурсов Цикл
		НайденныйТР = ВыбранноеЗначение.НайтиПоЗначению(ДубльРесурса);	
		ВыбранноеЗначение.Удалить(НайденныйТР);
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти
