////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с иерархией и полномочиями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПолучениеИнформацииОДиспетчерахИСотрудниках

// Подбирает сотрудника для диспетчера (или наоборот, диспетчера для сотрудника) по совпадающему началу наименования.
//
// Параметры:
//  СписокДляПоиска	 - Массив			 - элементы справочника для поиска.
//  ИмяДляПоиска	 - Строка			 - имя сопоставляемого объекта.
//  НайденныйОбъект	 - СправочникСсылка	 - сопоставленный объект.
// 
// Возвращаемое значение:
//  Булево - флаг успешного сопоставления.
//
Функция обПодобратьДиспетчераПоИмени(СписокДляПоиска, Знач ИмяДляПоиска, НайденныйОбъект = Неопределено) Экспорт
	
	Для Счетчик = 1 По СтрДлина(ИмяДляПоиска) Цикл
		
		Метка = СтрДлина(ИмяДляПоиска) + 1 - Счетчик;					
		ТекИмяПользователя = Лев(ИмяДляПоиска, Метка);
		
		Для каждого СотрудникДляПоиска Из СписокДляПоиска Цикл
			СтрокаДляПоиска = СотрудникДляПоиска.Наименование;
			Если СтрДлина(СтрокаДляПоиска) < СтрДлина(ИмяДляПоиска) Тогда      
				ИмяДляПоиска = Лев(ИмяДляПоиска, СтрДлина(СтрокаДляПоиска));
			КонецЕсли; 
			Если Лев(СтрокаДляПоиска, СтрДлина(ИмяДляПоиска)) = ИмяДляПоиска Тогда      
				НайденныйОбъект = СотрудникДляПоиска;
				Возврат Истина;
			КонецЕсли; 				
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции

// см. упоИерархияИПолномочияСервер.СотрудникиДиспетчера
//
Функция обПолучитьСписокСотрудниковДиспетчера(Диспетчер, ОбновитьКэшируемыеЗначения = Истина) Экспорт
	
	Возврат упоИерархияИПолномочияСервер.СотрудникиДиспетчера(Диспетчер, ОбновитьКэшируемыеЗначения);
	
КонецФункции

// Проверяет доступность сотрудника для текущего пользователя,
//  и если сотрудник доступен, устанавливает его текущим.
//
// Параметры:
//  Сотрудник	 - СправочникСсылка.упоСотрудники	 - выбранный в качестве текущего.
//
Процедура обУстановитьДиспетчеруТекущегоСотрудника(Сотрудник = Неопределено) Экспорт
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	СписокСотрудников = упоИерархияИПолномочияВызовСервера.обПолучитьСписокСотрудниковДиспетчера(ТекПользователь);
	Если Не ЗначениеЗаполнено(СписокСотрудников) Тогда
		Возврат;
	КонецЕсли; 
	
	// Если сотрудник прямо не указан, попробуем извлечь его из персональной настройки текущего пользователя.
	Если Сотрудник = Неопределено Тогда
		
		СотрудникНайден = Ложь;
		
		Сотрудник = упоПользователиВызовСервера.обПолучитьНастройкуПользователя("СотрудникПоУмолчанию");
		
		Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Сотрудник) Тогда
			// Указанный в настройке сотрудник должен быть в списке доступных.
			Если Не СписокСотрудников.НайтиПоЗначению(Сотрудник) = Неопределено Тогда
				СотрудникНайден = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Не СотрудникНайден Тогда
			// Если сотрудник не указан и в настройке, можно взять первого попавшегося.
			// Попробуем искать по наименованию.
			СотрудникНайден = упоИерархияИПолномочияВызовСервера.обПодобратьДиспетчераПоИмени(
				СписокСотрудников.ВыгрузитьЗначения(), 
				ТекПользователь.Наименование, 
				Сотрудник);
			Если Не СотрудникНайден Тогда
				Сотрудник = СписокСотрудников.Получить(0).Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокСотрудников.НайтиПоЗначению(Сотрудник) = Неопределено Тогда
		ТекСотрудник = Справочники.упоСотрудники.ПустаяСсылка();
	Иначе
		ТекСотрудник = Сотрудник;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.упоТекущийСотрудник = Сотрудник;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеИнформацииОМатричнойСтруктуреУправления

// Строит полный список подразделений и определяет для каждого из них текущего руководителя.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - подразделения и руководители.
//
Функция обПолучитьФункциональныхРуководителей() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Подразделения.Ссылка КАК Подразделение,
	               |	Подразделения.Родитель КАК Родитель,
	               |	РуководителиПодразделенийСрезПоследних.Руководитель КАК Руководитель
	               |ИЗ
	               |	Справочник.упоПодразделения КАК Подразделения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПодразделений.СрезПоследних КАК РуководителиПодразделенийСрезПоследних
	               |		ПО Подразделения.Ссылка = РуководителиПодразделенийСрезПоследних.Подразделение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РуководителиПодразделенийСрезПоследних.Руководитель,
	               |	Подразделения.Ссылка,
	               |	Подразделения.Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Подразделение ИЕРАРХИЯ";
	
	Результат = Запрос.Выполнить();       	
	ТаблицаДанных = Результат.Выгрузить();	
		
	// Таблица построена (упорядочиванием по иерархии) таким образом
	// что при проходе строки уже известно, что ее родитель в любом 
	// случае уже был пройден
	// поэтому сложного обхода таблицы делать не надо, достаточно простого.
	
	Для каждого СтрокаВыборки Из ТаблицаДанных Цикл
		
		
		Если НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаВыборки.Руководитель) Тогда      
			// руководитель был назначен явным образом, оставляем его			
			Продолжить;                                              			
		КонецЕсли; 
		
		// Если руководителя нет, значит, нужно брать того сотрудника,
		// который руководит подразделением-родителем.
		
		СтрокаРодитель = ТаблицаДанных.Найти(СтрокаВыборки.Родитель, "Подразделение");
		Если НЕ СтрокаРодитель = Неопределено Тогда      
			СтрокаВыборки.Руководитель = СтрокаРодитель.Руководитель;
		КонецЕсли; 
		
	КонецЦикла; 
	
    Возврат ТаблицаДанных;
	
КонецФункции

// Возвращает руководителя подразделения, согласно иерархической структуры справочника Подразделения.
//
// Параметры:
//  ВхДанные - Массив, СправочникСсылка.Подразделения	 - подразделение
//  	(или список подразделений), для которого необходимо
//  	определить текущего руководителя.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники, ТаблицаЗначений - найденные руководители.
//
Функция обПолучитьРуководителяПодразделенияПоИерархии(ВхДанные) Экспорт

	// разбираем входные данные и генерируем структуру выходных
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
		
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;		
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			НоваяСтрока = Результат.Добавить();		
			НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();
		КонецЦикла; 
		Результат.ЗагрузитьКолонку(ВхДанные, "Подразделение");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоПодразделения") Тогда
		
		ЭтоМассив = Ложь;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Подразделение = ВхДанные;
		НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	// получаем полный список руководителей подразделений
	
	ТаблицаРуководителей = упоИерархияИПолномочияВызовСервера.обПолучитьФункциональныхРуководителей();
		
	// и для каждого из заданных подразделений возвращаем руководителя	
	
	Для каждого СтрокаРезультат Из Результат Цикл
		
		СтрокаРуководитель = ТаблицаРуководителей.Найти(СтрокаРезультат.Подразделение, "Подразделение");
		Если НЕ СтрокаРуководитель = Неопределено Тогда      
			СтрокаРезультат.Руководитель = СтрокаРуководитель.Руководитель;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// возвращаем результат в зависимости от типа входных данных
	
	Если ЭтоМассив Тогда      
		Возврат Результат;
	Иначе
		Возврат Результат[0].Руководитель;
	КонецЕсли; 

КонецФункции

// Возвращает список подразделений руководителя (или группы руководителей) исходя из иерархии подразделений.
//
// Параметры:
//  ВхДанные		 - Массив, СправочникСсылка.упоСотрудники	 - сотрудник (или список сотрудников)
//  	для которого необходимо найти подразделения
//  ВернутьМассив	 - Булево									 - флаг указывает на необходимость вернуть не дерево значений,
//  	а массив с общим списком найденных проектных задач.
// 
// Возвращаемое значение:
//  Массив, ДеревоЗначений - найденные подразделения.
//
Функция обПолучитьПодразделенияРуководителяПоИерархии(ВхДанные, ВернутьМассив = Ложь) Экспорт

	// Разбираем входные данные и генерируем структуру выходных
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ДеревоЗначений();
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;	
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Строки.Добавить();		
		КонецЦикла; 		
		Результат.Строки.ЗагрузитьКолонку(ВхДанные, "Руководитель");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоСотрудники") Тогда
		
		ЭтоМассив = Ложь;         		
		НоваяСтрока = Результат.Строки.Добавить();
		НоваяСтрока.Руководитель = ВхДанные;
	
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
	// Получаем полный список руководителей подразделений
	
	ТаблицаРуководителей = упоИерархияИПолномочияВызовСервера.обПолучитьФункциональныхРуководителей();
	
	// И для каждого из заданных руководителей строим список подразделений
	
	МассивПодразделений = Новый Массив();
	
	Для каждого СтрокаРезультат Из Результат.Строки Цикл
		
		СтрокиДанных = ТаблицаРуководителей.НайтиСтроки(Новый Структура("Руководитель", СтрокаРезультат.Руководитель));
		Для каждого СтрокаДанных Из СтрокиДанных Цикл
			НоваяСтрока = СтрокаРезультат.Строки.Добавить();
			НоваяСтрока.Руководитель = СтрокаРезультат.Руководитель;
			НоваяСтрока.Подразделение = СтрокаДанных.Подразделение;
			МассивПодразделений.Добавить(СтрокаДанных.Подразделение);
		КонецЦикла; 
		
	КонецЦикла; 

	// Возвращаем результат в зависимости от типа входных данных
	
	Если ЭтоМассив Тогда      
		Если ВернутьМассив Тогда      
			Возврат МассивПодразделений;
		Иначе
			Возврат Результат;
		КонецЕсли; 	
	Иначе
		Возврат Результат.Строки[0].Строки.ВыгрузитьКолонку("Подразделение");
	КонецЕсли; 

КонецФункции

// Возвращает список подразделений руководителя (или группы руководителей),
//  но только тех, для которых руководитель указан напрямую (без учета иерархии).
//
// Параметры:
//  ВхДанные - Массив, СправочникСсылка.упоСотрудники	 - сотрудник (или список сотрудников)
//  	для которого необходимо найти подразделения.
// 
// Возвращаемое значение:
//  Массив, ДеревоЗначений - найденные подразделения.
//
Функция обПолучитьПодразделенияРуководителяБезИерархии(ВхДанные) Экспорт

	// разбираем входные данные и генерируем структуру выходных
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ДеревоЗначений();
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;	
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Строки.Добавить();		
		КонецЦикла; 		
		Результат.Строки.ЗагрузитьКолонку(ВхДанные, "Руководитель");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоСотрудники") Тогда
		
		ЭтоМассив = Ложь;         		
		НоваяСтрока = Результат.Строки.Добавить();
		НоваяСтрока.Руководитель = ВхДанные;
	
	Иначе		
		Возврат Неопределено;
	КонецЕсли; 
	
    // Извлекаем запросом список подразделений
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РегФМ.Подразделение,
	               |	РегФМ.Руководитель
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПодразделений.СрезПоследних КАК РегФМ
	               |ГДЕ
	               |	РегФМ.Руководитель В(&СписокСотрудников)";
	
	Запрос.УстановитьПараметр("СписокСотрудников", ВхДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СтрокаДанных = Результат.Строки.Найти(Выборка.Руководитель, "Руководитель");
		Если НЕ СтрокаДанных = Неопределено Тогда      
			НоваяСтрока = СтрокаДанных.Строки.Добавить();
			НоваяСтрока.Подразделение = Выборка.Подразделение;
		КонецЕсли; 
	
	КонецЦикла;
	
	Если ЭтоМассив Тогда      
		Возврат Результат;
	Иначе
		Возврат Результат.Строки[0].Строки.ВыгрузитьКолонку("Подразделение");
	КонецЕсли; 
	
КонецФункции
 
// Строит полный список проектных задач по ряду проектов и определяет
//  для каждого из них текущего руководителя с учетом проектной иерархии.
//
// Параметры:
//  СписокПроектов	 - Массив							 - список проектов, для которых необходимо найти проектных руководителей.
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - передается в случае,
//  когда проектная задача проверяется в момент проведения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - проектные задачи и руководители.
//
Функция обПолучитьПроектныхРуководителей(СписокПроектов, ПроектнаяЗадача = Неопределено) Экспорт
	
	Возврат упоИерархияИПолномочияСервер.ПолучитьПроектныхРуководителей(СписокПроектов, ПроектнаяЗадача);
	
КонецФункции

// Возвращает руководителя проектной задачи, согласно иерархической структуре проекта.
//
// Параметры:
//  ВхДанные - Массив, ДокументСсылка.упоПроектнаяЗадача - проектная задача (или список задач),
//  для которой необходимо определить текущего руководителя.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники, ТаблицаЗначений - найденные руководители.
//
Функция обПолучитьРуководителяПроектнойЗадачиПоИерархии(ВхДанные) Экспорт

	// разбираем входные данные и генерируем структуру выходных
	ЭтоМассив = Неопределено;
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
		
    Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		ЭтоМассив = Истина;
		Для Сч = 0 По ВхДанные.ВГраница() Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.ПроектнаяЗадача = ВхДанные[Сч];
		КонецЦикла; 		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ЭтоМассив = Ложь;
	Иначе
		Возврат Неопределено;		
	КонецЕсли; 
	
	// Прежде, чем вызывать построитель проектной матрицы руководителей,
	// необходимо построить список проектов, которые мы анализируем.
	
	Если ЭтоМассив Тогда
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Задачи.ПроектнаяЗадача.Проект КАК Проект
			|ИЗ
			|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&СписокЗадач)) КАК Задачи
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
			|		ПО Задачи.Версия = Версии.Версия
			|ГДЕ
			|	Версии.Текущая";
		
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, Новый Структура("СписокЗадач", ВхДанные));
		СписокПроектов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Проект");
		
		// Ставим заплатку на случай, если попытка получить РПЗ производится
		// в момент проведения документа "Проектная задача", в этом случае
		// в регистре сведений может "не быть" данных, т.к. в момент транзакции
		// движения документа самому документу недоступны.
		
		// если по каким-то причинам проектов ноль, не будем делать лишних запросов
		
		Если СписокПроектов.Количество() = 0 Тогда      
			Возврат Результат;
		КонецЕсли; 
		
		ТаблицаДанных = упоИерархияИПолномочияВызовСервера.обПолучитьПроектныхРуководителей(СписокПроектов);
		
		// для каждой из переданных на вход задач определяем текущего руководителя
		Для каждого СтрокаРезультат Из Результат Цикл
			СтрокаДанных = ТаблицаДанных.Найти(СтрокаРезультат.ПроектнаяЗадача, "ПроектнаяЗадача");
			Если НЕ СтрокаДанных = Неопределено Тогда      
				СтрокаРезультат.Руководитель = СтрокаДанных.Руководитель;
			КонецЕсли; 
		КонецЦикла;
		
		Возврат Результат;
	Иначе // Если Это НЕ Массив
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РП.РуководительПроекта КАК РП,
			|	Проекты.СтатусПроекта КАК СтатусПроекта
			|ИЗ
			|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Проекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК РП
			|		ПО Проекты.Проект = РП.Проект";
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Проект", ВхДанные.Проект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Завершен Тогда
				Возврат Справочники.упоСотрудники.ПустаяСсылка();
			КонецЕсли;
			РП = Выборка.РП;
		Иначе
			Возврат Справочники.упоСотрудники.ПустаяСсылка();
		КонецЕсли;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	Свойства.ЗадачаРодитель КАК ЗадачаРодитель
		               |ПОМЕСТИТЬ Свойства
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК Свойства
		               |ГДЕ
		               |	НЕ Свойства.ЗадачаОтменена
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	Свойства.ЗадачаРодитель КАК ЗадачаРодитель,
		               |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РПЗ
		               |ИЗ
		               |	Свойства КАК Свойства
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
		               |		ПО Свойства.ПроектнаяЗадача = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача";
	
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ВхДанные.Проект));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Родители = Новый Соответствие;
		РПЗы = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			Родители.Вставить(Выборка.ПроектнаяЗадача, Выборка.ЗадачаРодитель);
			РПЗы.Вставить(Выборка.ПроектнаяЗадача, Выборка.РПЗ);
		КонецЦикла;
		
		Возврат ПоискРуководителяПоРодителю(ВхДанные, Родители, РПЗы, РП);
	КонецЕсли;
	
КонецФункции

// Возвращает список проектных задач, руководимых указанным сотрудником
//  с учетом иерархии СДР и того, что задачи могут принадлежать разным проектам.
//
// Параметры:
//  ВхДанные			 - Массив, СправочникСсылка.упоСотрудники	 - сотрудник (или список сотрудников),
//  	для которого нужно определить руководимые им задачи.
//  МетодПланирования	 - ПеречислениеСсылка.МетодПланированияПроекта	 - используется для того,
//  	чтобы отобрать только проекты с указанным методом планирования.
//  ВернутьМассив		 - Булево	 - флаг указывает на необходимость вернуть не дерево значений,
//  	а массив с общим списком найденных проектных задач.
// 
// Возвращаемое значение:
//  Массив, ДеревоЗначений - найденные проектные задачи руководителя.
//
Функция обПолучитьПроектныеЗадачиРуководителяПоИерархии(ВхДанные, МетодПланирования = Неопределено,
	ВернутьМассив = Ложь) Экспорт

	// Разбираем входные данные и генерируем структуру выходных.
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ДеревоЗначений();
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	Результат.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;	
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Строки.Добавить();		
		КонецЦикла; 		
		Результат.Строки.ЗагрузитьКолонку(ВхДанные, "Руководитель");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоСотрудники") Тогда
		
		ЭтоМассив = Ложь;         		
		НоваяСтрока = Результат.Строки.Добавить();
		НоваяСтрока.Руководитель = ВхДанные;
	
	Иначе		
		Возврат Неопределено;
	КонецЕсли; 
	
	// Прежде, чем вызывать построитель таблицы проектных руководителей 
	// нужно определить доступные проекты.
	
	// Доступность проектов может зависеть от метода планирования
	
	Запрос = Новый Запрос;
	
	Если МетодПланирования = Неопределено Тогда      
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	РегРП.Проект КАК Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РегРП
		               |ГДЕ
		               |	РегРП.РуководительПроекта В(&СписокСотрудников)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРП.Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегРПЗ.ПроектнаяЗадача.Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РегРПЗ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		               |				И (упоВерсииПроекта.Текущая)
		               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		               |		ПО РегРПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |ГДЕ
		               |	РегРПЗ.РуководительПроектнойЗадачи В(&СписокСотрудников)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРПЗ.ПроектнаяЗадача.Проект";
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	РегРП.Проект КАК Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РегРП
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК РегСвойства
		               |		ПО РегРП.Проект = РегСвойства.Проект
		               |ГДЕ
		               |	РегРП.РуководительПроекта В(&СписокСотрудников)
		               |	И РегСвойства.МетодОперативногоПланирования = &МетодПланирования
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРП.Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегРПЗ.ПроектнаяЗадача.Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РегРПЗ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК РегСвойства
		               |		ПО РегРПЗ.ПроектнаяЗадача.Проект = РегСвойства.Проект
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		               |				И (упоВерсииПроекта.Текущая)
		               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		               |		ПО РегРПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |ГДЕ
		               |	РегРПЗ.РуководительПроектнойЗадачи В(&СписокСотрудников)
		               |	И РегСвойства.МетодОперативногоПланирования = &МетодПланирования
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРПЗ.ПроектнаяЗадача.Проект";
		
		Запрос.УстановитьПараметр("МетодПланирования", МетодПланирования);
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("СписокСотрудников", ВхДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	СписокПроектов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Проект");
	
	// Получаем полный список задач и их руководителей
	
	ТаблицаДанных = упоИерархияИПолномочияВызовСервера.обПолучитьПроектныхРуководителей(СписокПроектов);
	
	// Проходим дерево сотрудников и для каждого их них находим руководимые им задачи
	// если в результате нужен список, сразу заполняем его.
	
	МассивЗадач = Новый Массив(); 	
	
	Для каждого СтрокаРезультат Из Результат.Строки Цикл			
		СтрокиДанных = ТаблицаДанных.НайтиСтроки(Новый Структура("Руководитель", СтрокаРезультат.Руководитель));
		Для каждого СтрокаДанных Из СтрокиДанных Цикл		
			НоваяСтрока = СтрокаРезультат.Строки.Добавить();
			НоваяСтрока.Руководитель = СтрокаДанных.Руководитель;			
			НоваяСтрока.ПроектнаяЗадача = СтрокаДанных.ПроектнаяЗадача;
			МассивЗадач.Добавить(СтрокаДанных.ПроектнаяЗадача);
		КонецЦикла; 
	КонецЦикла; 
		
	Если ЭтоМассив Тогда      
		Если ВернутьМассив Тогда      
			Возврат МассивЗадач;
		Иначе
			Возврат Результат;	
		КонецЕсли; 		
	Иначе
	    Возврат Результат.Строки[0].Строки.ВыгрузитьКолонку("ПроектнаяЗадача");
	КонецЕсли; 
	
КонецФункции

// Возвращает список руководителей проекта (или нескольких проектов) в том числе и закрытых.
//
// Параметры:
//  ВхДанные - СправочникСсылка.Проекты, Массив	 - проект или список
//  	проектов, для которых надо получить руководителя.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники, Массив - найденные руководители проектов.
//
Функция обПолучитьРуководителяПроекта(ВхДанные) Экспорт

	// разбираем входные данные и строим структуру выходных
	
	ЭтоМассив = Неопределено;
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();		
		КонецЦикла; 
		Результат.ЗагрузитьКолонку(ВхДанные, "Проект");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.Проекты") Тогда
		
		ЭтоМассив = Ложь;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();
		НоваяСтрока.Проект = ВхДанные;
		
	Иначе
		Возврат Неопределено;		
	КонецЕсли;   	

	// запросом получаем руководителей нужных проектов
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РуководителиПроектовСрезПоследних.РуководительПроекта,
	|	РуководителиПроектовСрезПоследних.Проект
	|ИЗ
	|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект В (&СписокПроектов)) КАК РуководителиПроектовСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	РуководителиПроектовСрезПоследних.РуководительПроекта,
	|	РуководителиПроектовСрезПоследних.Проект";
	
	Запрос.УстановитьПараметр("СписокПроектов", ВхДанные);	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	// и записываем результат в итоговую таблицу
	
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		СтрокаРезультата = Результат.Найти(СтрокаДанных.Проект, "Проект");
		Если НЕ СтрокаРезультата = Неопределено Тогда      
			СтрокаРезультата.Руководитель = СтрокаДанных.РуководительПроекта;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// возвращаем данные в нужном виде
	
	Если ЭтоМассив Тогда      		
		Возврат Результат;
	Иначе
		Возврат Результат[0].Руководитель;
	КонецЕсли;            	
	
КонецФункции // обПолучитьРуководителяПроекта()

// Возвращает руководителя подразделения.
//
// Параметры:
//  Подразделение - СправочникСсылка.упоПодразделения - подразделение,
//					 для которого надо получить руководителя.
//
// Возвращаемое значение:
//   СправочникСсылка.упоСотрудники - найденный руководитель подразделения.
//
Функция НепосредственныйРуководительПодразделения(Подразделение) Экспорт
		
	РСП = Справочники.упоСотрудники.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат РСП;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегФМ.Руководитель КАК Руководитель
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПодразделений.СрезПоследних(, Подразделение = &Подразделение) КАК РегФМ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		РСП = Выборка.Руководитель;
	КонецЕсли;
	
	Возврат РСП;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
// Рекурсивная функция.
//
Функция ПоискРуководителяПоРодителю(текЗадача, Родители, РПЗы, РП)
	
	РПЗ = РПЗы[текЗадача];
	
	Если ЗначениеЗаполнено(РПЗ) Тогда
		Возврат РПЗ;
	Иначе
		Отец = Родители[текЗадача];
		Если ЗначениеЗаполнено(Отец) Тогда
			РПЗ_Отца = РПЗы[Отец];
			Если ЗначениеЗаполнено(РПЗ_Отца) Тогда
				Возврат РПЗ_Отца;
			Иначе
				Возврат ПоискРуководителяПоРодителю(Отец, Родители, РПЗы, РП);
			КонецЕсли;
		Иначе
			Возврат РП;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти