
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура Расш1_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	СуммаПроцентов = 0;
	Для Каждого ЭтапГрафика Из ЭтапыГрафикаОплаты Цикл
		Если Не ЭтапГрафика.ЭтоЗалогЗаТару Тогда
			СуммаПроцентов = СуммаПроцентов + ЭтапГрафика.ПроцентПлатежа;
		КонецЕсли;
	КонецЦикла;

	// Процент платежа по всем этапам должен быть 100%
	Если СуммаПроцентов <> 100 Тогда

		ТекстОшибки = НСтр("ru = 'Процент платежей по всем этапам должен быть равен 100%';
		|en = 'Payment percentage at all stages should be equal to 100 %'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ЭтапыГрафикаОплаты",
		,
		Отказ);
        #Вставка
		Отказ = Ложь; //<=ИКТ_Новоселов_11.02.2026_Задача№13500 Сохранение документа с процентом платежа по всем этапам не равным 100% разрешено	
		#КонецВставки
	КонецЕсли;
    #Удаление
	СуммаЭтаповОплаты = ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
	#КонецУдаления
	#Вставка
	//{[+] ИКТ №17954 (фрагмент ДОБАВЛЕН), Новоселов, 27.04.2026 
	ЕстьСтрокаОплата = Ложь;
	СуммаЭтаповОплаты = 0;
	Для каждого Строка Из ЭтапыГрафикаОплаты Цикл
		Если Строка.ИКТ_ТипПлатежа = Перечисления.ИКТ_ТипПлатежа.Оплата Тогда
			СуммаЭтаповОплаты = СуммаЭтаповОплаты + Строка.СуммаПлатежа;
			ЕстьСтрокаОплата = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьСтрокаОплата Тогда
		СуммаЭтаповОплаты = ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
	КонецЕсли;
	//[+]} ИКТ №17954
	#КонецВставки
	Если СуммаЭтаповОплаты > 0 И СуммаДокумента <> СуммаЭтаповОплаты Тогда

		ТекстОшибки = НСтр("ru = 'Сумма документа не должна отличаться от суммы этапов оплаты';
		|en = 'Document amount should not differ from payment milestones amount'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"СуммаДокумента",
		,
		Отказ);

	КонецЕсли;

	Если ТипЗнч(ДокументОснование) <> Тип("СправочникСсылка.ДоговорыКонтрагентов") И НЕ Аннулирован Тогда

		ВалютаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Валюта");

		СуммаОснования = Документы.СчетНаОплатуКлиенту.ПолучитьСуммуДокументаОснования(ДокументОснование);

		Если СуммаДокумента > СуммаОснования Тогда

			ТекстОшибки = НСтр("ru = 'Сумма документа не может быть больше суммы документа-основания ""%СуммаОснования% %ВалютаОснования%""';
			|en = 'Document amount cannot be greater than the amount of the base document ""%СуммаОснования% %ВалютаОснования%""'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки,"%СуммаОснования%", Формат(СуммаОснования, "ЧДЦ=2"));
			ТекстОшибки = СтрЗаменить(ТекстОшибки,"%ВалютаОснования%",ВалютаОснования);

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"СуммаДокумента",
			,
			Отказ);

		КонецЕсли;

	КонецЕсли;

	МассивНепроверяемыхРеквизитов.Добавить("ЭтапыГрафикаОплаты.ПроцентПлатежа");
	Для Каждого ЭтапГрафика Из ЭтапыГрафикаОплаты Цикл

		Если Не ЗначениеЗаполнено(ЭтапГрафика.ПроцентПлатежа) И Не ЭтапГрафика.ЭтоЗалогЗаТару Тогда

			ТекстОшибки = НСтр("ru = 'Не заполнена колонка ""Процент платежа"" в строке %НомерСтроки% списка ""Этапы графика оплаты""';
			|en = 'Column ""Payment percentage"" is not populated in line %НомерСтроки% of the ""Payment milestones"" list'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки,"%НомерСтроки%",ЭтапГрафика.НомерСтроки);

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ЭтапыГрафикаОплаты", ЭтапГрафика.НомерСтроки, "ПроцентПлатежа"),
			,
			Отказ);

		КонецЕсли;

	КонецЦикла;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	СчетНаОплатуКлиентуЛокализация.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры

