
&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.Ответственный = ?(ЗначениеЗаполнено(Объект.Ответственный),Объект.Ответственный,Пользователи.ТекущийПользователь());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ЭтоНовый() И ПараметрыЗаписи.РежимЗаписи= РежимЗаписиДокумента.Проведение Тогда
		ТекущийОбъект.Действует = Истина;	
	КонецЕсли;
КонецПроцедуры
