#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("Редактирование") Тогда
		Редактирование = Параметры.Редактирование;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Редактирование = Истина;
	КонецЕсли;
	
	ДоступенПроизвольныйКод = Справочники.упоИзбранныеДействия.ДоступенТипДействияПроизвольныйКод();
	
	ТолькоПросмотр = Не Объект.ЭтоГруппа И Редактирование И ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.Автор <> ПользователиКлиентСервер.АвторизованныйПользователь() И Не ДоступенПроизвольныйКод;			
		
	ЗаполнитьТипыДействий(ДоступенПроизвольныйКод);
	
	Если НЕ Редактирование Тогда
		ВыполнитьНаСервере(Отказ);		
	Иначе
		УстановитьСтраницу(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Редактирование Тогда
		Отказ = Истина;
		ВыполнитьНаКлиенте(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗапись", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДействияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДействияПриИзменении(Элемент)
	
	УстановитьСтраницу(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяОбработкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = Объект.ВнешняяОбработка;
	Диалог.МножественныйВыбор = Ложь;
	Если Элемент.Имя = "ВнешняяОбработка" Тогда
		Диалог.Фильтр = "*.epf\.erf|*.epf;*.erf";  
	Иначе
		Диалог.Фильтр = "*.*|*.*";  
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыбораФайла", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НазваниеНастройкиПанелиРуководителяПодразделенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючСтандартнойНастройки", "СтандартнаяНастройка");
	ПараметрыОткрытия.Вставить("ПредставлениеСтандартнойНастройки", НСтр("ru = 'Стандартная настройка'"));
	ПараметрыОткрытия.Вставить("КлючОбъекта", "Обработка.упоПанельРуководителяПодразделения");	
	ПараметрыОткрытия.Вставить("ПрефиксКлючНастроек", "ПользовательскиеНастройки");	
	ПараметрыОткрытия.Вставить("ПоказыватьНастройкиВсехПользователей", "ПоказыватьНастройкиВсехПользователей"); 
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НазваниеНастройки", "НазваниеНастройкиПанелиРуководителяПодразделения");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнениеНазванияНастройки", ЭтаФорма, ДополнительныеПараметры);

	ОткрытьФорму("Обработка.упоПанельРуководителяПодразделения.Форма.ФормаЗагрузкиНастройки", ПараметрыОткрытия,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеНастройкиПанелиРуководителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОбъекта", "Обработка.упоПанельПоказателей");
	ПараметрыОткрытия.Вставить("КлючНастроек","НастройкиОбработки");
	ПараметрыОткрытия.Вставить("ПоказыватьНастройкиВсехПользователей", "ПоказыватьНастройкиВсехПользователей"); 
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НазваниеНастройки", "НазваниеНастройкиПанелиРуководителя");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнениеНазванияНастройки", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.упоПанельПоказателей.Форма.ФормаЗагрузкиНастройки", ПараметрыОткрытия,,,,,ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура НазваниеНастройкиСтруктурыПроектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючОбъекта", "Обработка.упоУпрощенныйВводСтруктурыПроекта");
	ПараметрыОткрытия.Вставить("КлючНастроек","НастройкиОбработки");
	ПараметрыОткрытия.Вставить("ПоказыватьНастройкиВсехПользователей", "ПоказыватьНастройкиВсехПользователей"); 
	ПараметрыОткрытия.Вставить("Проект", Объект.Проект);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НазваниеНастройки", "НазваниеНастройкиСтруктурыПроекта");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнениеНазванияНастройки", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.упоУпрощенныйВводСтруктурыПроекта.Форма.ФормаЗагрузкиНастройки", ПараметрыОткрытия,,,,,ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыполнитьКод(Команда)
	
	 КодНаСервере();
	 Выполнить(Объект.ВыполняемыйКодКлиент);
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтраницу(ЭтаФорма) 
	
	Если ЭтаФорма.Объект.ТипДействия = "ВариантОтчета" Тогда
		
		ИмяСтраницы = "ГруппаВариантОтчет";
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "ДопОбработка" Тогда
		
		ИмяСтраницы = "ГруппаДопОбработка";	
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "НастройкаПанелиРуководителя" Тогда
		
		ИмяСтраницы = "ГруппаПанельРуководителя";		
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "НастройкаСтруктурыПроекта" Тогда
		
		ИмяСтраницы = "ГруппаСтруктураПроекта";
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "ВнешняяОбработка" Тогда
		
		ИмяСтраницы = "ГруппаВнешняяОбработка";	
				
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "ЗапускПриложения" Тогда
		
		ИмяСтраницы = "ГруппаЗапускПриложения";	
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "ПроизвольныйКод" Тогда
		
		ИмяСтраницы = "ГруппаПроизвольныйКод";	
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "НавигационнаяСсылка" Тогда
		
		ИмяСтраницы = "ГруппаНавигационнаяСсылка";	
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "ПроизвольнаяСсылка" Тогда
		
		ИмяСтраницы = "ГруппаПроизвольнаяСсылка";	
		
	ИначеЕсли ЭтаФорма.Объект.ТипДействия = "НастройкаПанелиРуководителяПодразделения" Тогда
		
		ИмяСтраницы = "ГруппаПанельРуководителяПодразделения";	
		
	Иначе
		
		ЭтаФорма.Объект.ТипДействия = "";
		Возврат;
		
	КонецЕсли;
	
	ЭтаФорма.Элементы.ГруппаСтраницы.ТекущаяСтраница = ЭтаФорма.Элементы[ИмяСтраницы];
 
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере(Отказ)
	
	Если Объект.ТипДействия = "ВариантОтчета" Тогда
		
	ИначеЕсли Объект.ТипДействия = "ДопОбработка" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Объект.ДопОбработка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка,
		               |	ДополнительныеОтчетыИОбработкиКоманды.ВариантЗапуска КАК ВариантЗапуска,
		               |	ДополнительныеОтчетыИОбработкиКоманды.Ссылка.Вид КАК Вид,
		               |	ДополнительныеОтчетыИОбработкиКоманды.Ссылка.Представление КАК Представление,
		               |	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор КАК Идентификатор
		               |ИЗ
		               |	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		               |ГДЕ
		               |	ДополнительныеОтчетыИОбработкиКоманды.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ВыполняемаяКоманда = Новый Структура;
		ВыполняемаяКоманда.Вставить("Ссылка", Объект.ДопОбработка);
		ВыполняемаяКоманда.Вставить("Представление", Выборка.Представление);
		ВыполняемаяКоманда.Вставить("Идентификатор", Выборка.Идентификатор);
		ВыполняемаяКоманда.Вставить("ОбъектыНазначения", Неопределено);
		ВыполняемаяКоманда.Вставить("Модификатор", Неопределено);
		ВыполняемаяКоманда.Вставить("ЭтоОтчет",  Выборка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет 
												ИЛИ Выборка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет);
		ВыполняемаяКоманда.Вставить("Вид", Выборка.Вид);
		ВыполняемаяКоманда.Вставить("ВариантЗапуска", Выборка.ВариантЗапуска);
		
		Переменная1 = ВыполняемаяКоманда;
				
	ИначеЕсли Объект.ТипДействия = "НастройкаПанелиРуководителя" Тогда
		
		ПредставлениеНужнойНастройки = Объект.НазваниеНастройкиПанелиРуководителя;	
		
		КлючОбъекта = "Обработка.упоПанельПоказателей";
		КлючНастроек = "НастройкиОбработки";
		
		Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
		
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
		Пока Выборка.Следующий() Цикл
			Если Найти(Выборка.КлючНастроек, КлючНастроек) <> 0 Тогда
							
				Если Выборка.Представление = ПредставлениеНужнойНастройки Тогда
					Переменная1 = Выборка.КлючНастроек;
					Переменная2 = Объект.АвторТекущейНастройки;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	ИначеЕсли Объект.ТипДействия = "НастройкаПанелиРуководителяПодразделения" Тогда
		
		ПредставлениеНужнойНастройки = Объект.НазваниеНастройкиПанелиРуководителяПодразделения;	
		
		КлючОбъекта = "Обработка.упоПанельРуководителяПодразделения";  
		КлючНастроек = "ПользовательскиеНастройки";
		
		Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
		
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
		Пока Выборка.Следующий() Цикл
			Если Найти(Выборка.КлючНастроек, КлючНастроек) <> 0 Тогда
				
				Если Выборка.Представление = ПредставлениеНужнойНастройки Тогда
					Переменная1 = Выборка.КлючНастроек;
					Переменная2 = Объект.АвторТекущейНастройки;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
	
	ИначеЕсли Объект.ТипДействия = "НастройкаСтруктурыПроекта" Тогда
		
		ПредставлениеНужнойНастройки = Объект.НазваниеНастройкиСтруктурыПроекта;	
		
		КлючОбъекта = "Обработка.упоУпрощенныйВводСтруктурыПроекта";
		КлючНастроек = "НастройкиОбработки";
		
		Отбор = Новый Структура("КлючОбъекта", КлючОбъекта);
		
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = ХранилищеОбщихНастроек.Выбрать(Отбор);
		Пока Выборка.Следующий() Цикл
			Если Найти(Выборка.КлючНастроек, КлючНастроек) <> 0 Тогда
				
				Если Выборка.Представление = ПредставлениеНужнойНастройки Тогда
					Переменная1 = Выборка.КлючНастроек;
					Переменная2 = Выборка.КлючОбъекта;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	ИначеЕсли Объект.ТипДействия = "ВнешняяОбработка" Тогда	
		
		Если Не РольДоступна("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок") Тогда
			ТекстСообщение = НСтр(
			"ru = 'Невозможно выполнить действие, так как нет прав на интерактивное открытие внешних отчетов и обработок.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщение, , , , Отказ);
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипДействия = "ПроизвольныйКод" Тогда
		
		КодНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНаКлиенте()
	
	Если Объект.ТипДействия = "ВариантОтчета" Тогда
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ФормироватьПриОткрытии", Истина);
		Если ЗначениеЗаполнено(Объект.Проект) Тогда
			ДополнительныеПараметры.Вставить("Проект", Объект.Проект);
		КонецЕсли;
		ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Неопределено, Объект.ВариантОтчета, ДополнительныеПараметры);
		
	ИначеЕсли Объект.ТипДействия = "ДопОбработка" Тогда	
		
		ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(Переменная1, ЭтаФорма, Неопределено);
		
	ИначеЕсли Объект.ТипДействия = "НастройкаПанелиРуководителя" Тогда
		
		ОткрытьФорму("Обработка.упоПанельПоказателей.Форма", 
						Новый Структура("КлючНастройкиПриОткрытии, КлючИмяПользователя", 
						Переменная1, Переменная2),,Переменная1); 
		
	ИначеЕсли Объект.ТипДействия = "НастройкаПанелиРуководителяПодразделения" Тогда
		
		ОткрытьФорму("Обработка.упоПанельРуководителяПодразделения.Форма", 
						Новый Структура("КлючНастройкиПриОткрытии, КлючИмяПользователя", 
						Переменная1, Переменная2),, Переменная1); 
						
	ИначеЕсли Объект.ТипДействия = "НастройкаСтруктурыПроекта" Тогда
		
		ОткрытьФорму("Обработка.упоУпрощенныйВводСтруктурыПроекта.Форма", 
						Новый Структура("КлючНастройкиПриОткрытии, КлючОбъектаНастройкиПриОткрытии, Проект, ОткрытиеИзИзбранныхДействий", 
						Переменная1, Переменная2, Объект.Проект, Истина),, Переменная1); 
		
	ИначеЕсли Объект.ТипДействия = "ВнешняяОбработка" Тогда	
		
		Если ПустаяСтрока(Объект.ВнешняяОбработка) Тогда
			Возврат;
		КонецЕсли;
		
		ПроверитьСуществованиеВнешнейОбработкиИлиОтчета();
		
	ИначеЕсли Объект.ТипДействия = "ЗапускПриложения" Тогда	
		
		ЗапуститьПриложение(Объект.ВнешняяОбработка);
		
	ИначеЕсли Объект.ТипДействия = "ПроизвольныйКод" Тогда
		
		КодНаКлиенте();	
		
	ИначеЕсли Объект.ТипДействия = "НавигационнаяСсылка" Тогда	
		
		ПерейтиПоНавигационнойСсылке(Объект.НавигационнаяСсылка);
		
	ИначеЕсли Объект.ТипДействия = "ПроизвольнаяСсылка" Тогда	
		
		ПоказатьЗначение(, Объект.ПроизвольнаяСсылка);
			
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяОбработки(ДвоичныеДанныеФайла, ЭтоОтчет)
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанныеФайла.Записать(ИмяФайла);
	
	Если ЭтоОтчет Тогда
		МенеджерВнешОбработкиОтчета = ВнешниеОтчеты;
	Иначе    
		МенеджерВнешОбработкиОтчета = ВнешниеОбработки;		
	КонецЕсли;	
	
	ОписаниеЗащитыОтОпасныхДействий  = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	СозданнаяВнешняяОбработка = МенеджерВнешОбработкиОтчета.Создать(ИмяФайла, Ложь, ОписаниеЗащитыОтОпасныхДействий);		
	
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Избранные действия. Удаление временного файла.'"), 
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат СозданнаяВнешняяОбработка.Метаданные().Имя;	
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСуществованиеВнешнейОбработкиИлиОтчета()
	
	ПроверяемыйФайл = Новый Файл(Объект.ВнешняяОбработка);	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьСуществованиеОбработкиИлиОтчетаЗавершение", ЭтотОбъект);
	ПроверяемыйФайл.НачатьПроверкуСуществования(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСуществованиеОбработкиИлиОтчетаЗавершение(Существует, ДополнительныеПараметры) Экспорт
	
	Если Не Существует Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Не удалось найти указанный отчет / обработку.
		|Проверьте, правильно ли указан путь к файлу отчета / обработки.'"));
		Возврат;
	КонецЕсли;
	
	ЭтоОтчет = Ложь;
	Если Прав(Объект.ВнешняяОбработка, 3) = "erf" Тогда
		ЭтоОтчет = Истина;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Объект.ВнешняяОбработка);
	
	Переменная2 = ПолучитьИмяОбработки(ДвоичныеДанныеФайла, ЭтоОтчет);
	
	ИмяФормыОбрОтч = "";
	
	Если ЭтоОтчет Тогда
		ИмяФормыОбрОтч = "ВнешнийОтчет.%1.Форма";					
	Иначе
		ИмяФормыОбрОтч = "ВнешняяОбработка.%1.Форма";					
	КонецЕсли;
	
	ИмяФормыОбрОтч = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИмяФормыОбрОтч, Переменная2); 
	
	ОткрытьФорму(ИмяФормыОбрОтч);
	
КонецПроцедуры

&НаСервере
Функция КодНаСервере() 
	
	Выполнить(Объект.ВыполняемыйКодСервер);
	
КонецФункции     

&НаКлиенте
Функция КодНаКлиенте() 
	
	Выполнить(Объект.ВыполняемыйКодКлиент);	
	
КонецФункции

&НаСервере
Функция ЗаполнитьТипыДействий(ДоступенПроизвольныйКод) 
	
	Элементы.ТипДействия.СписокВыбора.Добавить("ВариантОтчета", НСтр("ru = 'Открыть вариант отчета'"));
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") Тогда
		Элементы.ТипДействия.СписокВыбора.Добавить("ДопОбработка", НСтр("ru = 'Дополнительная обработка или отчет'"));
	КонецЕсли;
	Элементы.ТипДействия.СписокВыбора.Добавить("НастройкаПанелиРуководителя", НСтр("ru = 'Открыть панель руководителя с настройкой'"));
	Элементы.ТипДействия.СписокВыбора.Добавить("НастройкаПанелиРуководителяПодразделения", НСтр("ru = 'Открыть панель руководителя подразделения с настройкой'"));
	Элементы.ТипДействия.СписокВыбора.Добавить("НастройкаСтруктурыПроекта", НСтр("ru = 'Открыть структуру проекта с настройкой'"));
	Элементы.ТипДействия.СписокВыбора.Добавить("ВнешняяОбработка", НСтр("ru = 'Внешняя обработка или отчет'"));
	Элементы.ТипДействия.СписокВыбора.Добавить("ЗапускПриложения", НСтр("ru = 'Запуск внешнего приложения'"));
	Если ДоступенПроизвольныйКод Тогда
		Элементы.ТипДействия.СписокВыбора.Добавить("ПроизвольныйКод", НСтр("ru = 'Произвольный код'"));
	КонецЕсли;
	Элементы.ТипДействия.СписокВыбора.Добавить("НавигационнаяСсылка", НСтр("ru = 'Навигационная ссылка'"));
	Элементы.ТипДействия.СписокВыбора.Добавить("ПроизвольнаяСсылка", НСтр("ru = 'Произвольная ссылка'"));
		
КонецФункции

&НаКлиенте
Функция ЗавершениеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.ВнешняяОбработка = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеНазванияНастройки(ВыбраннаяНастройка, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяНастройка <> Неопределено  Тогда
		
		НазваниеНастройки = ДополнительныеПараметры.НазваниеНастройки;
		Объект[НазваниеНастройки] = ВыбраннаяНастройка.ИмяНастройки;
		
		Если НазваниеНастройки = "НазваниеНастройкиПанелиРуководителя" ИЛИ 
			НазваниеНастройки = "НазваниеНастройкиПанелиРуководителяПодразделения" Тогда
			Объект.АвторТекущейНастройки = ВыбраннаяНастройка.Пользователь;	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
