
&После("ЗаполнитьРеквизитыСтрокиТовара2_5")
Процедура Расш1_ЗаполнитьРеквизитыСтрокиТовара2_5(СтрокаТовары, ПрослеживаемыеТовары, ОбластьМакета, НомерСтроки, ПараметрыПечати, ВыводитьКодНоменклатуры, ВыводитьКодТНВД, ВыводитьСерии)
	
	//{[+] ИКТ №8166 (фрагмент ДОБАВЛЕН), Селиверстов Д.Н., 06.06.2025 09:55:00
	Если НЕ ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) Тогда
		ОбластьМакета.Параметры.Количество = "";
		ОбластьМакета.Параметры.Цена = "";
	КонецЕсли;
	//[+]} ИКТ №8166
	
КонецПроцедуры
