
#Область ПрограммныйИнтерфейс

// Возвращает использование указанной подсистемы.
// 
// Возвращаемое значение:
//  Булево - результат выполнения проверки.
//
Функция ИспользоватьПодсистему() Экспорт
	
	Возврат упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("ИспользоватьПодсистему");
	
КонецФункции

// Возвращает список физ. лиц, по которым есть трудозатраты за указанный период.
//
// Параметры:
//  Документ - ДокументСсылка.ОтражениеЗарплатыВФинансовомУчете
//  ПериодРегистрации  - Дата
//
// Возвращаемое значение:
//   Массив
//
Функция ФизЛицаКРаспределениюЗПЗаПериод(Документ, ПериодРегистрации) Экспорт
	
	ФизЛица = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|   НачисленнаяЗарплатаИВзносыПоФизлицам.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_ФизЛицаСНезаполненнымиНачислениями
		|ИЗ
		|   Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносыПоФизлицам КАК НачисленнаяЗарплатаИВзносыПоФизлицам
		|ГДЕ
		|   НачисленнаяЗарплатаИВзносыПоФизлицам.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|   упоИспользованиеРабочегоВремени.ТрудовойРесурс.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_ФизЛицаКРаспределению
		|ИЗ
		|   РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
		|ГДЕ
		|   упоИспользованиеРабочегоВремени.День МЕЖДУ &НачалоПериода И &КонецПериода
		|   И НЕ упоИспользованиеРабочегоВремени.ТрудовойРесурс.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ФизЛицаСНезаполненнымиНачислениями.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|   ВТ_ФизЛицаСНезаполненнымиНачислениями КАК ВТ_ФизЛицаСНезаполненнымиНачислениями
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ФизЛицаКРаспределению КАК ВТ_ФизЛицаКРаспределению
		|       ПО ВТ_ФизЛицаСНезаполненнымиНачислениями.ФизическоеЛицо = ВТ_ФизЛицаКРаспределению.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ФизЛица;
	КонецЕсли;
	
	ФизЛица = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	Возврат ФизЛица;
	
КонецФункции

// См. упоРаспределениеЗарплатыНастройкиСервер.ПолучитьСоответствиеНачисленийPM
//
Функция ПолучитьСоответствиеНачисленийPM() Экспорт
	
	Возврат упоРаспределениеЗарплатыНастройкиСервер.ПолучитьСоответствиеНачисленийPM();
	
КонецФункции

#КонецОбласти