
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем мТаблицаОшибки;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки.
		СтруктураОбязательныхПолей.Вставить("Проект");
		СтруктураОбязательныхПолей.Вставить("ДатаРасчетаПроекта");
	ИначеЕсли ИмяТабличнойЧасти = "Исключения" Тогда
		СтруктураОбязательныхПолей.Вставить("Задача");
		СтруктураОбязательныхПолей.Вставить("ДатаНачала");
		СтруктураОбязательныхПолей.Вставить("ДатаЗавершения");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры: 
//  ДанныеДокумента - Структура - содержит слепок документа.
//  Отказ           - Булево 	- Признак отказа от выполнения операции.
//  Заголовок       - Строка	- Содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПроверки = Новый Структура;
	СтруктураПроверки.Вставить("Проект"                        , Проект);
	СтруктураПроверки.Вставить("ПроверятьСтруктуруЗадач"       , Ложь);
	СтруктураПроверки.Вставить("ПроверятьСрокиЗадач"           , Ложь);
	СтруктураПроверки.Вставить("ПроверятьЗаполнениеСроковЗадач", Ложь);
	СтруктураПроверки.Вставить("ПроверятьПредУсловияЗадач"     , Ложь);
	СтруктураПроверки.Вставить("ПроверятьЗацикливание"         , Истина);
	
	ТаблицаОшибок = упоПроектыИЗадачиВызовСервера.обКомплекснаяПроверкаСтруктурыПроекта(СтруктураПроверки, Истина);
	
	Если Не ТаблицаОшибок = Неопределено Тогда
		Если ТаблицаОшибок.Задачи.Количество() = 0 И ТаблицаОшибок.Общие.Количество() = 0 Тогда
			
			Возврат;
			
		КонецЕсли;
	Иначе
		СтрокаСообщения = "Не выбран проект!";
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		Возврат;
	КонецЕсли;
	
	СтрокаСообщения = "При проверке проекта """ + ДанныеДокумента.Проект + """ обнаружены ошибки!";
	обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
	
	упоПроектыИЗадачиВызовСервера.обОтобразитьСписокОшибок(ТаблицаОшибок, Проект);
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Правила для регистра "СрокиПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСрокиПроектныхЗадач.Метаданные().Имя, Правила);
	
	// Правила для регистра "РасчетныеСрокиПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоРасчетныеСрокиПроектныхЗадач.Метаданные().Имя, Правила);
		
	// Правила для финансовых регистров (актуальные планы БДР и БДДС).
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДвиженийДенежныхСредств.Метаданные().Имя, Правила);
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДоходовИРасходов.Метаданные().Имя, Правила);
		
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДоходовИРасходовПодразделения.Метаданные().Имя, Правила);
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыВыполненияОбъемов.Метаданные().Имя, Правила);
	
	// Правила для регистра "упоСвойстваПроектов"
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСвойстваПроектов.Метаданные().Имя, Правила);
	 	
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("упоСвойстваПроектов", ПравилаДвижения);
	
	ТекВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ДанныеДокумента.Проект);
	
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", ТекВерсияПроекта));
	ПравилаДвижения.Вставить("Проект", "Шапка_Проект");
	ПравилаДвижения.Вставить("ДатаСтарта", "Шапка_ДатаРасчетаПроекта");
	
	// Правила для регистра "ПланПоставкиМатРесурсовПроектныхЗадач"
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановПотребностейМатериальныхРесурсов.Метаданные().Имя, Правила);
	
	Возврат ПравилаНаложения; 

КонецФункции
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	текущаяВерсияПроекта   = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	ТаблицаТекущихСроковПЗ = ПолучитьТекущиеСрокиПроектныхЗадач(Проект, текущаяВерсияПроекта);
	РуководительПроекта	   = ПолучитьРуководителяПроекта(Проект);
	РуководителиПЗ		   = упоИерархияИПолномочияСервер.ПолучитьРуководителейПроектныхЗадачПроекта(Проект);
	СписокСотрудников 	   = упоИерархияИПолномочияВызовСервера.обПолучитьСписокСотрудниковДиспетчера(
		ПользователиКлиентСервер.АвторизованныйПользователь());
	
	// Сформируем таблицу задач.
	ТаблицаЗадач = упоРасчетКалендарныхСроковРедакция3Сервер.ПодготовитьТаблицуЗадач(Проект);
	
	ТаблицаЗадач.ЗаполнитьЗначения(Ложь, "ЭтоИсключение");
	Для Каждого СтрокаИсключения Из Исключения Цикл
		СтрокаЗадачи = ТаблицаЗадач.Найти(СтрокаИсключения.Задача, "ЭлементПроекта");		
		Если СтрокаЗадачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаЗадачи.ЭтоИсключение = Истина;
		СтрокаЗадачи.ДатаНачала = СтрокаИсключения.ДатаНачала;
		СтрокаЗадачи.ДатаЗавершения = СтрокаИсключения.ДатаЗавершения;
	КонецЦикла;
	
	// Сформируем структуру параметров для расчета.
	СтруктураДанных = упоРасчетКалендарныхСроковРедакция3Сервер.ПодготовитьСтруктуруДанныхПроекта(Проект, ДатаРасчетаПроекта,
																										ПланироватьОтДатыОкончания);																									
	//
	
	ТаблицаПредусловий = упоРасчетКалендарныхСроковРедакция3Сервер.ПодготовитьТаблицуПредусловий(Проект);
	
	СвойстваЭлеменов = Новый Соответствие;
	ПредшественникиМеждуПроектами = упоРасчетКалендарныхСроковРедакция3Сервер.ПолучитьДанныеПредусловийМеждуПроектами(ТаблицаПредусловий, СвойстваЭлеменов);
	Для Каждого КлючЗначение Из СвойстваЭлеменов Цикл
		НоваяСтрока = ТаблицаЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючЗначение.Значение);	
		НоваяСтрока.ЭлементПроекта = КлючЗначение.Ключ;
		НоваяСтрока.НазваниеПЗ = КлючЗначение.Значение.НазваниеЗадачи;
		НоваяСтрока.ЭтоИсключение = Истина;
		НоваяСтрока.ЭтоФантом = Истина;
		Если ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
			НоваяСтрока.Длительность = НоваяСтрока.Длительность * НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		Иначе
			НоваяСтрока.Длительность = 0;
		КонецЕсли;
	КонецЦикла;
	
	//																										
	
	ТаблицаИсключений = упоРасчетКалендарныхСроковРедакция3Сервер.ПолучитьТаблицуИсключенийПоТаблицеЭлементов(ТаблицаЗадач);
	
	//
		
	Ошибки      = Неопределено;
	ТекстОшибки = "";
	
	СоответствиеСроковЗадач = упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьСрокиЗадачEx(ТаблицаЗадач, ТаблицаИсключений,
																								ТаблицаПредусловий, СтруктураДанных, Ошибки);
		
	Если ТипЗнч(СоответствиеСроковЗадач) = Тип("Дата") Тогда
		
		мТаблицаОшибки = Ошибки;
		
		ТекстОшибки = НСтр("ru = 'Календарный день, необходимый для расчета, не был найден в рабочем календаре. 
                            |Корректный расчет невозможен: %1'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Формат(СоответствиеСроковЗадач, "ДФ=dd.MM.yyyy"));
		обСообщитьОбОшибке(ТекстОшибки, Отказ, НСтр("ru = 'Операция не выполнена'"));
		
		Возврат;
		
	ИначеЕсли (НЕ Ошибки = Неопределено) И 
			(Ошибки.НайтиСтроки(Новый Структура("ТипОшибки", "Ошибка")).Количество() > 0) Тогда      		
			
			обСообщитьОбОшибке(НСтр("ru = 'В проекте обнаружен конфликт сроков, корректный расчет невозможен'"),
				Отказ, НСтр("ru = 'Операция не выполнена'"));
			
			ТекстОшибки = "";
			ТекстОшибки = упоРасчетКалендарныхСроковРедакция3Сервер.СобратьСообщениеОбОшибке(ТекстОшибки, Ошибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
			Возврат;
			
	ИначеЕсли (НЕ Ошибки = Неопределено) И (Ошибки.Количество() > 0) Тогда
			
			ТекстОшибки = "";
			ТекстОшибки = упоРасчетКалендарныхСроковРедакция3Сервер.СобратьСообщениеОбОшибке(ТекстОшибки, Ошибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			
	КонецЕсли;
	Если Не (ДополнительныеСвойства.Свойство("ОтложенноеПроведение") Или ОбменДанными.Загрузка) Тогда
		ПроверитьИзменениеСроковЗапрещенныхНаРедактированиеЗадач(СоответствиеСроковЗадач, ТаблицаТекущихСроковПЗ,
			РуководительПроекта, РуководителиПЗ, СписокСотрудников, Отказ, ТекстОшибки);
	КонецЕсли;
		
	Если Отказ Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Проект);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли; 
	
	ТаблицаДвиженияСроки          = ДанныеДвижений[Движения.упоСрокиПроектныхЗадач.Метаданные().Имя];
	ТаблицаДвиженияРасчетныеСроки = ДанныеДвижений[Движения.упоРасчетныеСрокиПроектныхЗадач.Метаданные().Имя];      
		
	Для Каждого СтрокаДанных Из СоответствиеСроковЗадач Цикл
		
		рассчитанныеПоказатели = СтрокаДанных.Значение.Результат;
		
		// Сроки записываются только для ПЗ.
		
		Если ТипЗнч(СтрокаДанных.Ключ) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			Движение = ТаблицаДвиженияСроки.Добавить();
			Движение.Версия    			= текущаяВерсияПроекта;
			Движение.ПроектнаяЗадача    = СтрокаДанных.Ключ;
			Движение.ДатаНачалаПлан     = рассчитанныеПоказатели.ДатаНачала;
			Движение.ДатаЗавершенияПлан = рассчитанныеПоказатели.ДатаЗавершения;
		КонецЕсли; 
		
		// Расчетные сроки могут быть записаны и для операций.
		
		Движение = ТаблицаДвиженияРасчетныеСроки.Добавить();
		Движение.Версия    			= текущаяВерсияПроекта;
		Движение.ПроектнаяЗадача    = СтрокаДанных.Ключ;
		Движение.ДатаРаннегоСтарта  = рассчитанныеПоказатели.РаннийСтарт;
		Движение.ДатаРаннегоФиниша  = рассчитанныеПоказатели.РаннийФиниш;
		Движение.ДатаПозднегоСтарта = рассчитанныеПоказатели.ПозднийСтарт;
		Движение.ДатаПозднегоФиниша = рассчитанныеПоказатели.ПозднийФиниш;
		
	КонецЦикла;							   										   	
	
	// Актуализация финансовых планов проекта.
	
	упоАктуализацияПроектаВызовСервера.РассчитатьФинансовыеПланы(ЭтотОбъект,
																  ДанныеДвижений,
																  ДанныеДокумента,
																  СоответствиеСроковЗадач,
																  Неопределено,																
																  ТекущаяВерсияПроекта,
																  Отказ); 
																  													  
	// Бизнес-логика дополнительной обработки данных движения по регистру "ТрудозатратыРесурсовПоДням".
		
	МассивЗадач = ТаблицаЗадач.ВыгрузитьКолонку("ЭлементПроекта");
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(МассивЗадач, ЭтотОбъект.Ссылка);
																		  
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	ОбновлятьДатуДокумента = Истина;
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда
		Проект = ПараметрыСеанса.упоТекущийПроект;
		Возврат;	
	КонецЕсли;
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = Основание;
		упоПроектыИЗадачиСервер.ПроверитьТипПроекта(Проект);
		ДатаРасчетаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(Проект, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево		  - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	упоФункцииЗащитыСервер.МожноИспользоватьОбъектИспользующийЗащищенныйКод(,Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
	// Необходимо оповестить форму панели проекта.
#Если Клиент Тогда
	Оповестить("ПанельПроекта_ЗадачаЗакрыта", Истина, Ссылка);	
#КонецЕсли

КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов =
		Константы.упоАвтоматическийРасчетСроковСвязанныхПроектов.Получить();
	Если Не ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов Тогда
		Возврат;
	КонецЕсли;
	ПроектныеЗадачиСНовымиСроками = Движения.упоСрокиПроектныхЗадач.ВыгрузитьКолонку("ПроектнаяЗадача");
	упоРасчетКалендарныхСроковРедакция3Сервер.ПриИзмененииСроковЗадачНеобходимоПересчитатьПроекты(ПроектныеЗадачиСНовымиСроками);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ 
	               |	упоСрокиПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач КАК упоСрокиПроектныхЗадач
	               |ГДЕ
	               |	упоСрокиПроектныхЗадач.Регистратор = &Регистратор";
	
	МассивЗадач = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(МассивЗадач, ЭтотОбъект.Ссылка);
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Функция ПолучитьТекущиеСрокиПроектныхЗадач(Проект, ВерсияПроекта)
	
	ТаблицаРезультат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан
	|ИЗ
	|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	|			,
	|			ПроектнаяЗадача.Проект = &Проект
	|				И Версия = &Версия) КАК упоСрокиПроектныхЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Версия", ВерсияПроекта);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ТаблицаРезультат = Результат.Выгрузить();		
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
		
КонецФункции

Функция ПолучитьРуководителяПроекта(Проект)
	
	РуководительПроекта = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	РуководителиПроектов.РуководительПроекта
	|ИЗ
	|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(&Дата, Проект = &Проект) КАК РуководителиПроектов";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Дата"  , '00010101');
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		РуководительПроекта = Результат.Выгрузить()[0].РуководительПроекта;
	КонецЕсли;
	
	Возврат РуководительПроекта;
	
КонецФункции

Процедура ПроверитьИзменениеСроковЗапрещенныхНаРедактированиеЗадач(СоответствиеСроковЗадач, ТаблицаТекущихСроковПЗ,
																   РуководительПроекта, РуководителиПЗ, СписокСотрудников,
																   Отказ, ТекстОшибки)
																   
	Если СписокСотрудников.НайтиПоЗначению(РуководительПроекта) <> Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаголовокТекстаОшибки = НСтр("ru = 'В проекте ""%1"" обнаружены ошибки:
								 |При расчете календарного плана затронуты сроки следующих задач,
								 |на изменение которых у текущего пользователя нет полномочий:
								 |'");
																	   
	Для Каждого СтрокаДанных Из СоответствиеСроковЗадач Цикл
		
		РассчитанныеПоказатели = СтрокаДанных.Значение.Результат;
		
		Если ТипЗнч(СтрокаДанных.Ключ) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			
			Если ТипЗнч(ТаблицаТекущихСроковПЗ) = Тип("ТаблицаЗначений") Тогда
				СтрокаПредСроков = ТаблицаТекущихСроковПЗ.Найти(СтрокаДанных.Ключ, "ПроектнаяЗадача");
			Иначе
				СтрокаПредСроков = Неопределено;
			КонецЕсли;
			РуководительПЗ = ?(РуководителиПЗ = Неопределено, Неопределено,
				РуководителиПЗ.Найти(СтрокаДанных.Ключ, "ПроектнаяЗадача"));
			
			ПользовательЯвляетсяРуководителемПЗ = РуководительПЗ <> Неопределено И
				СписокСотрудников.НайтиПоЗначению(РуководительПЗ.РуководительПроектнойЗадачи) <> Неопределено;
			
			Если Не ПользовательЯвляетсяРуководителемПЗ
				И (СтрокаПредСроков = Неопределено
					Или НачалоДня(РассчитанныеПоказатели.ДатаНачала) <> НачалоДня(СтрокаПредСроков.ДатаНачалаПлан)
					Или НачалоДня(РассчитанныеПоказатели.ДатаЗавершения) <> НачалоДня(СтрокаПредСроков.ДатаЗавершенияПлан)) Тогда
				
				Отказ = Истина;
				
				СвязанныйЭлементПроекта = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(СтрокаДанных.Ключ);
				
				ТекстОшибки = ТекстОшибки + "
					|" + СвязанныйЭлементПроекта.КодСДР + " " + СтрокаДанных.Ключ.НазваниеПроектнойЗадачи;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		ТекстОшибки = ЗаголовокТекстаОшибки + ТекстОшибки;			
	КонецЕсли; 
	
КонецПроцедуры
 
#КонецОбласти

#Область Инициализация

мТаблицаОшибки = Неопределено;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли