&ИзменениеИКонтроль("ОбновитьШтатноеРасписаниеПоДаннымДокумента")
Процедура ИКТ_ОбновитьШтатноеРасписаниеПоДаннымДокумента(Организация, ДатаВступленияВСилу, Позиции, ЕжегодныеОтпуска, СтрокиСНовымиПозициями, СведенияОНаименованиях)

	ФОИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании =
	ПолучитьФункциональнуюОпцию("ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании");

	Для каждого СтрокаПозиции Из Позиции Цикл

		ПозицияШтатногоРасписанияОбъект = Неопределено;
		СозданаПозиция = Ложь;

		Наименование = Неопределено;
		Если ТипЗнч(СведенияОНаименованиях) = Тип("Соответствие") Тогда
			Наименование = СведенияОНаименованиях.Получить(СтрокаПозиции.ИдентификаторСтрокиПозиции);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаПозиции.Позиция) Тогда

			Если Наименование = Неопределено Тогда
				#Удаление
				Продолжить;
				#КонецУдаления 
				#Вставка	
				#КонецВставки
			КонецЕсли;

			ПозицияШтатногоРасписанияОбъект = СтрокаПозиции.Позиция.ПолучитьОбъект();

		КонецЕсли;

		Если ПозицияШтатногоРасписанияОбъект = Неопределено Тогда

			СозданаПозиция = Истина;
			ПозицияШтатногоРасписанияОбъект = Справочники.ШтатноеРасписание.СоздатьЭлемент();
			ПозицияШтатногоРасписанияОбъект.Владелец = Организация;
			ПозицияШтатногоРасписанияОбъект.Утверждена = Истина;
			ПозицияШтатногоРасписанияОбъект.ДатаУтверждения = ДатаВступленияВСилу;

			СтрокиОтпусков = ЕжегодныеОтпуска.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПозиции", СтрокаПозиции.ИдентификаторСтрокиПозиции));
			Для Каждого СтрокаОтпуска Из СтрокиОтпусков Цикл

				Если ЗначениеЗаполнено(СтрокаОтпуска.ВидЕжегодногоОтпуска) И СтрокаОтпуска.КоличествоДнейВГод > 0 Тогда
					ЗаполнитьЗначенияСвойств(ПозицияШтатногоРасписанияОбъект.ЕжегодныеОтпуска.Добавить(), СтрокаОтпуска);
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ПозицияШтатногоРасписанияОбъект, СтрокаПозиции);

		Если Наименование <> Неопределено Тогда
			Если ТипЗнч(Наименование) = Тип("Структура") Тогда
				ПозицияШтатногоРасписанияОбъект.Наименование = Наименование.Наименование;
				ПозицияШтатногоРасписанияОбъект.НаименованиеПолное = Наименование.НаименованиеПолное;
			Иначе
				ПозицияШтатногоРасписанияОбъект.Наименование = Наименование;
			КонецЕсли;
			СведенияОНаименованиях.Удалить(СтрокаПозиции.ИдентификаторСтрокиПозиции);

		Иначе

			ДополнительныеПараметры = Новый Структура("ПолноеНаименованиеДолжности, ПолноеНаименованиеПодразделения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПозиции.Должность, "НаименованиеДляЗаписейОТрудовойДеятельности"), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПозиции.Подразделение, "НаименованиеДляЗаписейОТрудовойДеятельности"));
			Если ФОИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании Тогда
				ДополнительныеПараметры.Вставить("РазрядКатегория", СтрокаПозиции.РазрядКатегория);
			КонецЕсли;

			НаименованиеПозиции = УправлениеШтатнымРасписаниемКлиентСервер.НаименованиеПозицииШтатногоРасписания(
			СтрокаПозиции.Подразделение,
			СтрокаПозиции.Должность,
			ДополнительныеПараметры);

			ПозицияШтатногоРасписанияОбъект.Наименование = НаименованиеПозиции.Наименование;
			ПозицияШтатногоРасписанияОбъект.НаименованиеПолное = НаименованиеПозиции.НаименованиеПолное;


		КонецЕсли;

		ОтключитьОбновлениеСтруктурыШтатногоРасписания(ПозицияШтатногоРасписанияОбъект);
		ОтключитьОбновлениеНастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда(ПозицияШтатногоРасписанияОбъект);
		ПозицияШтатногоРасписанияОбъект.Записать();

		ПозицияШтатногоРасписания = ПозицияШтатногоРасписанияОбъект.Ссылка;

		СтрокаТЧПозиции = Позиции.Найти(СтрокаПозиции.НомерСтроки, "НомерСтроки");

		Если СтрокаТЧПозиции <> Неопределено Тогда
			СтрокаТЧПозиции.Позиция = ПозицияШтатногоРасписания;
			#Вставка
			Попытка
				СтрокаТЧПозиции.ID_ДолжностьS = ПозицияШтатногоРасписания.ID_ДолжностьS;	
			Исключение
			КонецПопытки;
			#КонецВставки
		КонецЕсли;

		Если СозданаПозиция Тогда
			СтрокиСНовымиПозициями.Добавить(СтрокаТЧПозиции);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры


&ИзменениеИКонтроль("АвтозаполнениеТекущимиДаннымиШтатногоРасписания")
Процедура ИКТ_АвтозаполнениеТекущимиДаннымиШтатногоРасписания(ДокументШтатногоРасписанияОбъект, ДатаВступленияВСилу, ПроверятьЗаполненностьПодразделения)

	Подразделение = Неопределено;
	Если ДокументШтатногоРасписанияОбъект.Метаданные().Реквизиты.Найти("Подразделение") <> Неопределено Тогда

		Если Не ПроверятьЗаполненностьПодразделения Или ЗначениеЗаполнено(ДокументШтатногоРасписанияОбъект.Подразделение) Тогда
			Подразделение = ДокументШтатногоРасписанияОбъект.Подразделение;
		КонецЕсли;

	КонецЕсли;

	РезультатЗапросаДанныхДляЗаполнения = СформироватьЗапросПоТекущемуСостояниюШтатногоРасписания(
	ДокументШтатногоРасписанияОбъект.Ссылка, 
	ДокументШтатногоРасписанияОбъект.Организация, 
	ДатаВступленияВСилу, 
	Подразделение);

	ДанныеДляЗаполнения = РезультатЗапросаДанныхДляЗаполнения.Выбрать();

	ИдентификаторСтрокиПозиции = МаксимальныйИдентификаторСтроки(ДокументШтатногоРасписанияОбъект.Позиции, "ИдентификаторСтрокиПозиции") + 1;
	ИдентификаторСтрокиВидаРасчета = МаксимальныйИдентификаторСтроки(ДокументШтатногоРасписанияОбъект.Начисления, "ИдентификаторСтрокиВидаРасчета") + 1;
	ИдентификаторСтрокиУправленческогоВидаРасчета = МаксимальныйИдентификаторСтроки(ДокументШтатногоРасписанияОбъект.УправленческиеНачисления, "ИдентификаторСтрокиВидаРасчета") + 1;

	КоллекцияНаименований = Новый Соответствие;

	Пока ДанныеДляЗаполнения.СледующийПоЗначениюПоля("Позиция") Цикл

		СтруктураПоиска = Новый Структура("Позиция", ДанныеДляЗаполнения.Позиция);

		СтрокиПозиции = ДокументШтатногоРасписанияОбъект.Позиции.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПозиции.Количество() = 0 Тогда

			ПозицияШР = ДокументШтатногоРасписанияОбъект.Позиции.Добавить();

			ПозицияШР.ИдентификаторСтрокиПозиции = ИдентификаторСтрокиПозиции;
			ИдентификаторСтрокиПозиции = ИдентификаторСтрокиПозиции + 1;
			#Вставка   
			Если ТипЗнч(ДокументШтатногоРасписанияОбъект) = Тип("ДокументОбъект.ИзменениеШтатногоРасписания") И ЗначениеЗаполнено(ПозицияШР.Позиция) Тогда   
				
				ИменаРеквизитов = 
				"ИКТ_ДолжностьС,ИКТ_IDДолжностьС,ИКТ_НомерГруппыПодбора,ИКТ_ТипПроверкиКандидатовДБ,ИКТ_ВидИнцидентаПоКРВ,ИКТ_УровеньДоступа,ИКТ_Должность," + 
				"ИКТ_Группа,ИКТ_Грейд,ИКТ_НазваниеРазделаПерсонала,ИКТ_ПроцентЗанятости";
				
				РеквизитыШР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПозицияШР.Позиция, ИменаРеквизитов);
				
				ЗаполнитьЗначенияСвойств(ПозицияШР, РеквизитыШР, ИменаРеквизитов); 
			
			КонецЕсли;
			#КонецВставки

			ЗаполнитьЗначенияСвойств(ПозицияШР, ДанныеДляЗаполнения);

			КоллекцияНаименований.Вставить(ПозицияШР.ИдентификаторСтрокиПозиции,
			Новый Структура("Наименование,НаименованиеПолное",
			ДанныеДляЗаполнения.Наименование,
			ДанныеДляЗаполнения.НаименованиеПолное));

		Иначе

			Если Не ЗначениеЗаполнено(ДанныеДляЗаполнения.ДатаУтверждения) Тогда
				Продолжить;
			КонецЕсли;

			ПозицияШР = СтрокиПозиции[0];

		КонецЕсли;

		Пока ДанныеДляЗаполнения.СледующийПоЗначениюПоля("Начисление") Цикл

			НезависимыйПоказатель = Не ЗначениеЗаполнено(ДанныеДляЗаполнения.Начисление);
			УправленческиеНачисленияПозиции = Ложь;

			Если Не НезависимыйПоказатель Тогда

				Если ДанныеДляЗаполнения.ПлановыеНачисления = Истина Тогда
					НачислениеПоШР = ДокументШтатногоРасписанияОбъект.Начисления.Добавить();
				Иначе
					НачислениеПоШР = ДокументШтатногоРасписанияОбъект.УправленческиеНачисления.Добавить();
					УправленческиеНачисленияПозиции = Истина;
				КонецЕсли;

				НачислениеПоШР.ИдентификаторСтрокиПозиции = ПозицияШР.ИдентификаторСтрокиПозиции;
				ЗаполнитьЗначенияСвойств(НачислениеПоШР, ДанныеДляЗаполнения);

				Если ДанныеДляЗаполнения.ПлановыеНачисления = Истина Тогда
					НачислениеПоШР.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
				Иначе
					НачислениеПоШР.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиУправленческогоВидаРасчета;
				КонецЕсли;

			КонецЕсли;

			Если ЗначениеЗаполнено(ДанныеДляЗаполнения.Показатель) Тогда 

				Пока ДанныеДляЗаполнения.СледующийПоЗначениюПоля("Показатель") Цикл

					Если ДанныеДляЗаполнения.ПлановыеНачисления = Истина Тогда
						ПоказательНачисления = ДокументШтатногоРасписанияОбъект.Показатели.Добавить();
					Иначе
						ПоказательНачисления = ДокументШтатногоРасписанияОбъект.УправленческиеПоказатели.Добавить();
					КонецЕсли;

					ПоказательНачисления.ИдентификаторСтрокиВидаРасчета = ?(НезависимыйПоказатель, 0, НачислениеПоШР.ИдентификаторСтрокиВидаРасчета);
					ПоказательНачисления.ИдентификаторСтрокиПозиции = ПозицияШР.ИдентификаторСтрокиПозиции;
					ЗаполнитьЗначенияСвойств(ПоказательНачисления, ДанныеДляЗаполнения);

				КонецЦикла;

			КонецЕсли;

			Если Не НезависимыйПоказатель Тогда
				Если ДанныеДляЗаполнения.ПлановыеНачисления = Истина Тогда
					ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета + 1;
				Иначе
					ИдентификаторСтрокиУправленческогоВидаРасчета = ИдентификаторСтрокиУправленческогоВидаРасчета + 1;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;

		Если УправленческиеНачисленияПозиции Тогда
			ПозицияШР.ИспользоватьУправленческиеНачисления = Истина;
		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(КоллекцияНаименований) Тогда
		ДокументШтатногоРасписанияОбъект.ДополнительныеСвойства.Вставить("КоллекцияНаименований", КоллекцияНаименований);
	КонецЕсли;

	ОстаткиОтпусков.ЗаполнитьЕжегоднымиОтпускамиШтатногоРасписания(ДокументШтатногоРасписанияОбъект, ДатаВступленияВСилу);

	ЗаполнитьСпециальностямиШтатногоРасписания(ДокументШтатногоРасписанияОбъект, ДатаВступленияВСилу);

КонецПроцедуры

