////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с сообщениями пользователю.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает структуру системных сообщений.
//
// Возвращаемое значение:
//	Структура - структура системных сообщений: ключ - Строка - код сообщения, значение - Строка - текст сообщения.
//
Функция ПолучитьСтруктуруСообщений() Экспорт
	
	ТекстыСообщений = Новый Структура;
	
	ТекстыСообщений.Вставить("_00001", "ru = ""Объект заблокирован для использования упрощенного ввода структуры проекта
		| - Возможная причина: неким другим пользователем уже редактируется структура проекта. Более подробная информация о данном виде блокировки можно найти в справочной информации обработки """"Упрощенный ввод структуры проекта"""" в разделе """"Основные особенности\Вызов панели и взаимодействие с системой""""
		| - Блокировку можно снять в регистре сведений """"Заблокированные объекты проекта""""""; en = ""Error. Please, read instructions.""");	
	
	ДополнитьСтруктуруСообщений(ТекстыСообщений);
	
	Возврат ТекстыСообщений;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополняет типовую структуру сообщений.
//
Процедура ДополнитьСтруктуруСообщений(ТекстыСообщений)
	
	ТекстыСообщений.Вставить("_demo", "ru = ""Сообщение, которое демонстрирует значения параметров. 1: %1; 2: %2;""");	
	
КонецПроцедуры

#КонецОбласти