// Обработчик подписки на событие ИКТ_ОбменСЕРПУАТРегистрацияНабора
// 
// Параметры:
//  Источник 	- СправочникОбъект.Сотрудники, СправочникОбъект.ФизическиеЛица 	- Источник
//  Отказ 		- Булево 														- Признак отказа от действия
//
Процедура ИКТ_ОбменСЕРПУАТРегистрацияНабораПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не СтрокаСоединенияИнформационнойБазы() = "Srvr=""SND-1C"";Ref=""w_SND_HRM"";" Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ФИОФизическихЛиц") Тогда   
		// При изменении регистра ФИОФизическихЛиц зарегистрируем физлицо к обмену 
		ФизическиеЛицаИзНабора = Новый Массив;
		Для Каждого Запись Из Источник Цикл 
			ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(Запись.ФизическоеЛицо, "ИКТ_ОбменЗУПЕРП"); 
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудниковИнтервальный") Тогда 
		// Зарегистрируем физлиц к обмену при приеме на работу, т.к. необходимо передавать с сотрудником дату приема 
		ОбработанныеСотрудники = Новый Массив; // Исключим формирование дублей сообщений по одиним и тем же сотрудникам из набора
		Для Каждого Запись Из Источник Цикл   
			Если ОбработанныеСотрудники.Найти(Запись.ФизическоеЛицо) = Неопределено Тогда
				ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(Запись.ФизическоеЛицо, "ИКТ_ОбменЗУПЕРП"); 
				ОбработанныеСотрудники.Добавить(Запись.ФизическоеЛицо);
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ГрафикРаботыСотрудниковИнтервальный") Тогда 
		// Зарегистрируем сотрудников к обмену при изменении графика работы, т.к. необходимо по графику пересчитывать тарифную ставку в оклад
		ОбработанныеСотрудники = Новый Массив; // Исключим формирование дублей сообщений по одиним и тем же сотрудникам из набора
		Для Каждого Запись Из Источник Цикл   
			Если ОбработанныеСотрудники.Найти(Запись.Сотрудник.ФизическоеЛицо) = Неопределено Тогда
				ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(Запись.Сотрудник.ФизическоеЛицо, "ИКТ_ОбменЗУПЕРП"); 
				ОбработанныеСотрудники.Добавить(Запись.Сотрудник.ФизическоеЛицо);
			КонецЕсли;
		КонецЦикла;			
	КонецЕсли;
КонецПроцедуры

// Обработчик подписки на событие ИКТ_ОбменЕРПУАТРегистрацияПриЗаписи
// 
// Параметры:
//  Источник 	- СправочникОбъект.ФизическиеЛица 	- Источник
//  Отказ 		- Булево 							- Признак отказа от действия
//
Процедура ИКТ_ОбменЕРПУАТРегистрацияПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Если Не СтрокаСоединенияИнформационнойБазы() = "Srvr=""SND-1C"";Ref=""w_SND_HRM"";" Тогда
	//	Возврат;
	//КонецЕсли;  
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ГоловнаяОрганизация") Тогда 
		Организация = Источник.ГоловнаяОрганизация;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "Организация") Тогда 
		Организация = Источник.ГоловнаяОрганизация;
	Иначе 
		Организация = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И Организация.ИКТ_УУ Тогда 
		Возврат
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Или Источник.ДополнительныеСвойства.Свойство("ОтложеннаяЗапись") Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(Источник.Ссылка, "ИКТ_ОбменЗУПЕРП"); 
	
КонецПроцедуры

Процедура ИКТ_ОбменЕРПУАТРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Если Не СтрокаСоединенияИнформационнойБазы() = "Srvr=""SND-1C"";Ref=""dev_hrm_1"";" Тогда
	//	МассивТипов = Новый Массив;
	//	МассивТипов.Добавить(Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплатыВКассу"));
	//	МассивТипов.Добавить(Тип("ДокументОбъект.ОтражениеЗарплатыВБухучете"));
	//	
	//	Если МассивТипов.Найти(ТипЗнч(Источник)) = Неопределено Тогда
	//		Возврат;
	//	КонецЕсли;
	//Иначе
	//	
	//	//Не регистрируем документы
	//	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплатыВКассу")
	//		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ОтражениеЗарплатыВБухучете") Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;  
	
	Если Источник.Организация.ИКТ_УУ Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплатыВКассу"));
		МассивТипов.Добавить(Тип("ДокументОбъект.ОтражениеЗарплатыВБухучете"));
		
		Если МассивТипов.Найти(ТипЗнч(Источник)) = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплатыВКассу"));
		МассивТипов.Добавить(Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплатыВБанк"));
		МассивТипов.Добавить(Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплатыПеречислением"));
		
		Если МассивТипов.Найти(ТипЗнч(Источник)) = Неопределено Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;  
	
	Если Источник.ОбменДанными.Загрузка Или Источник.ДополнительныеСвойства.Свойство("ОтложеннаяЗапись") Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ИКТ_ОбменЗУПЕРП", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ИКТ_РегистрацияНабора_ИКТ_ОбменЗУПЕРППередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник.Отбор, "Сотрудник") Тогда 
		Организация = Источник.Отбор.Сотрудник.Значение.ГоловнаяОрганизация;
	Иначе 
		Организация = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И Организация.ИКТ_УУ Тогда 
		Возврат
	КонецЕсли; 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник.Отбор, "Регистратор") Тогда 
		Организация = Источник.Отбор.Регистратор.Значение.Организация;
	Иначе 
		Организация = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И Организация.ИКТ_УУ Тогда 
		Возврат
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не СтрокаСоединенияИнформационнойБазы() = "Srvr=""SND-1C"";Ref=""w_SND_HRM"";" Тогда
	//	Возврат;
	//КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ИКТ_ОбменЗУПЕРП", Источник, Отказ, Замещение);
	
КонецПроцедуры
