////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с закрытыми этапами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. упоЗакрытиеЭтапаПовтИспВызов.ЭтоЭтапВерхнегоУровня
//
Функция ЭтоЭтапВерхнегоУровня(Задача) Экспорт
	Возврат упоЗакрытиеЭтапаПовтИспВызов.ЭтоЭтапВерхнегоУровня(Задача);
КонецФункции

// См. упоЗакрытиеЭтапаПовтИспВызов.ЭтоЭтапВерхнегоУровня
//
Функция ЭтоЭтапВторогоУровня(Задача) Экспорт
	Возврат упоЗакрытиеЭтапаПовтИспВызов.ЭтоЭтапВторогоУровня(Задача);
КонецФункции

// Проверка: задача является закрытой.
//
// Параметры:
//  пЗадача				 - СправочникСсылка.Проекты, ДокументСсылка.упоПроектнаяЗадача	
//  пКэшПроверки		 - Соответствие	 - кэш ранее проверенных задач.
//  ОпределятьПоРодителю - Булево	 - признак проверки закрытия задачи по родителю.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЗадачаЗакрыта(пЗадача, пКэшПроверки = Неопределено, ОпределятьПоРодителю = Ложь, Версия = Неопределено)  Экспорт
	ЗадачаЗакрыта = Неопределено;
	Если пКэшПроверки <> Неопределено Тогда
		ЗадачаЗакрыта = пКэшПроверки.Получить(пЗадача);
	КонецЕсли;
	Если ЗадачаЗакрыта = Неопределено Тогда
		ЗадачаЗакрыта = упоЗакрытиеЭтапаПовтИспВызов.ЗадачаЗакрыта(пЗадача, ОпределятьПоРодителю, Версия);
		Если пКэшПроверки <> Неопределено Тогда
			пКэшПроверки.Вставить(пЗадача, ЗадачаЗакрыта);
		КонецЕсли;
	КонецЕсли;
	Возврат ЗадачаЗакрыта;
КонецФункции

// Удаляет движений статусов и процентов закрытые задачи.
//
// Параметры:
//  ЭтотОбъект		 - ДокументОбъект - документ, который проводится.
//  МассивИсключений - Массив	 - задачи, которые необходимо проверить по статусу и удалить закрытые.
//
Процедура УдалитьИзДвиженийСтатусовИПроцентовЗакрытыеЗадачи(ЭтотОбъект, МассивИсключений = Неопределено) Экспорт
		
	МассивЗакрытыхЗадач = Новый Массив;
	
	//
	
	ПозицияСтатусов = ЭтотОбъект.Движения.упоСтатусыПроектныхЗадач.Количество() - 1;
	
	Пока ПозицияСтатусов >= 0 Цикл
		Запись = ЭтотОбъект.Движения.упоСтатусыПроектныхЗадач[ПозицияСтатусов];
		Если МассивИсключений <> Неопределено  И МассивИсключений.Найти(Запись.ПроектнаяЗадача) <> Неопределено Тогда 
			ПозицияСтатусов = ПозицияСтатусов - 1;
			Продолжить;	
		КонецЕсли;
		Если Запись.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта Тогда	
			МассивЗакрытыхЗадач.Добавить(Запись.ПроектнаяЗадача);
			ЭтотОбъект.Движения.упоСтатусыПроектныхЗадач.Удалить(ПозицияСтатусов);
		КонецЕсли;
		ПозицияСтатусов = ПозицияСтатусов - 1;
	КонецЦикла;
	
	//
	
	ПозицияПроцентов = ЭтотОбъект.Движения.упоПроцентыГотовностиПроектныхЗадач.Количество() - 1;
	
	Пока ПозицияПроцентов >= 0 Цикл
		Запись = ЭтотОбъект.Движения.упоПроцентыГотовностиПроектныхЗадач[ПозицияПроцентов];	
		Если МассивЗакрытыхЗадач.Найти(Запись.ПроектнаяЗадача) <> Неопределено Тогда	
			ЭтотОбъект.Движения.упоПроцентыГотовностиПроектныхЗадач.Удалить(ПозицияПроцентов);
		КонецЕсли;
		ПозицияПроцентов = ПозицияПроцентов - 1;
	КонецЦикла;
	
КонецПроцедуры

// Проверка: в переданном массиве есть закрытая задача.
//
// Параметры:
//  МассивЗадач			 - Массив - проверяемые задачи.
//  ОпределятьПоРодителю - Булево	 - признак проверки закрытия задачи по родителю.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЕстьЗакрытаяЗадача(МассивЗадач,  ОпределятьПоРодителю = Ложь) Экспорт
	
	Результат = Ложь;
	
	Если Не МассивЗадач.Количество() Тогда
		Возврат Результат; 
	КонецЕсли;
	
	Если ОпределятьПоРодителю Тогда
		
		Для Каждого Задача Из МассивЗадач Цикл
			Результат = Результат ИЛИ упоЗакрытиеЭтапаПовтИспВызов.ЗадачаЗакрыта(Задача, ОпределятьПоРодителю);	
			Если Результат Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
				
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоПроектнаяЗадача.Ссылка КАК ПроектнаяЗадача,
		               |	упоПроектнаяЗадача.Проект КАК Проект
		               |ПОМЕСТИТЬ ПроектныеЗадачи
		               |ИЗ
		               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		               |ГДЕ
		               |	упоПроектнаяЗадача.Ссылка В(&МассивЗадач)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	упоВерсииПроекта.Версия КАК Версия
		               |ПОМЕСТИТЬ ПроектныеЗадачиСТекущимиВерсиями
		               |ИЗ
		               |	ПроектныеЗадачи КАК ПроектныеЗадачи
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |		ПО ПроектныеЗадачи.Проект = упоВерсииПроекта.Проект
		               |ГДЕ
		               |	упоВерсииПроекта.Текущая
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи
		               |ИЗ
		               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
		               |			,
		               |			(Версия, ПроектнаяЗадача) В
		               |				(ВЫБРАТЬ
		               |					ПроектныеЗадачиСТекущимиВерсиями.Версия,
		               |					ПроектныеЗадачиСТекущимиВерсиями.ПроектнаяЗадача
		               |				ИЗ
		               |					ПроектныеЗадачиСТекущимиВерсиями)) КАК упоСтатусыПроектныхЗадачСрезПоследних
		               |ГДЕ
		               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусазадачи.Закрыта)";
		
		Запрос.УстановитьПараметр("МассивЗадач", МассивЗадач);				   
		РезультатЗапроса = Запрос.Выполнить();
		
		Результат = Не РезультатЗапроса.Пустой();
			
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Обработчик подписки упоЗакрытиеЭтапа_ПроверкаПередЗаписьюВРегистр. Проверка закрытых задач перед записью в регистры.
//
// Параметры:
//  Источник	 - РегистрСведенийНаборЗаписей, РегистрНакопленияНаборЗаписей	 - набор записей регистра.
//  Отказ		 - Булево	 - флаг отказа, если проверка не пройдена. 
//  Замещение	 - Булево	 - режим записи регистра.
//
Процедура упоЗакрытиеЭтапа_ПроверкаПередЗаписьюВРегистрПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ упоЗакрытиеЭтапаПовтИспСеанс.СтрогийКонтрольИзмененияЗакрытыхЭтапов() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	Если Источник.ДополнительныеСвойства.Свойство("упоУдалениеЛишнихДвиженийВерсии") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("упоНеПроверятьЗакрытыеЭтапы") 
							И Источник.ДополнительныеСвойства.упоНеПроверятьЗакрытыеЭтапы Тогда
		Возврат;
	КонецЕсли;
		
	Если Источник.ДополнительныеСвойства.Свойство("упоПроверкаНаЗакрытыеЭтапыПройдена") 
							И Источник.ДополнительныеСвойства.упоПроверкаНаЗакрытыеЭтапыПройдена Тогда
		Возврат;
	КонецЕсли;
		
	//
	
	СтруктураРегистров = упоЗакрытиеЭтапаПовтИспСеанс.ПолучитьСтруктуруПроверяемыхРегистров();
	
	МетаданныеРегистра = Источник.Метаданные();	
	ИмяРегистра = Источник.Метаданные().Имя;
	
	//
	
	ПараметрыПроверкиРегистра = Неопределено;
	
	Если Не СтруктураРегистров.Свойство(ИмяРегистра, ПараметрыПроверкиРегистра) Тогда
		Возврат;
	КонецЕсли;	
	
	//
	
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеРегистра) Тогда
		ТипРегистра = "РегистрСведений";
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаданныеРегистра) Тогда
		ТипРегистра = "РегистрНакопления";
	Иначе
		ТипРегистра = "РегистрБухгалтерии";
	КонецЕсли;
	
	//
	
	Если ПараметрыПроверкиРегистра.Свойство("ИмяПоляВерсии")  Тогда
		ПроверкаПередЗаписьюРегистра(ИмяРегистра, ТипРегистра, Источник, Отказ, Замещение, 
									ПараметрыПроверкиРегистра.ИмяПоляЗадачи,, ПараметрыПроверкиРегистра.ИмяПоляВерсии);
	Иначе		
		ПроверкаПередЗаписьюРегистра(ИмяРегистра, ТипРегистра, Источник, Отказ, Замещение, 
									ПараметрыПроверкиРегистра.ИмяПоляЗадачи);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик подписки документа упоПроектнаяЗадача ПередЗаписью.
//
// Параметры:
//  Источник		 - ДокументОбъект.упоПроектнаяЗадача
//  Отказ			 - Булево	 - флаг отказа, если проверка не пройдена. 
//  РежимЗаписи		 - РежимЗаписиДокумента
//  РежимПроведения	 - РежимПроведенияДОкумента
//
Процедура ПроверкаПередЗаписью_упоПроектнаяЗадачаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ упоЗакрытиеЭтапаПовтИспСеанс.СтрогийКонтрольИзмененияЗакрытыхЭтапов() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов Тогда
		Возврат;
	КонецЕсли;

	//
	
	Если Источник.ДополнительныеСвойства.Свойство("упоУдалениеЛишнихДвиженийВерсии") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("упоНеПроверятьЗакрытыеЭтапы") 
							И Источник.ДополнительныеСвойства.упоНеПроверятьЗакрытыеЭтапы Тогда
		Возврат;
	КонецЕсли;
		
	Если Источник.ДополнительныеСвойства.Свойство("упоПроверкаНаЗакрытыеЭтапыПройдена") 
							И Источник.ДополнительныеСвойства.упоПроверкаНаЗакрытыеЭтапыПройдена Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	ЗадачаЗакрыта = Ложь;
	
	Если Не Отказ Тогда
		
		Версия = Неопределено;
		Источник.ДополнительныеСвойства.Свойство("Версия", Версия);
		
		Если НЕ ЗадачаЗакрыта И ЗначениеЗаполнено(Источник.Ссылка) Тогда
			ЗадачаЗакрыта = ЗадачаЗакрыта(Источник.Ссылка, , , Версия);
		КонецЕсли;
		Если НЕ ЗадачаЗакрыта И ЗначениеЗаполнено(Источник.ЗадачаРодитель) Тогда
			ЗадачаЗакрыта = ЗадачаЗакрыта(Источник.ЗадачаРодитель, , , Версия);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗадачаЗакрыта Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'Попытка записать задачу ""%1"" закрытого этапа.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Источник.НазваниеПроектнойЗадачи);
	 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
	Иначе
		Источник.ДополнительныеСвойства.Вставить("упоПроверкаНаЗакрытыеЭтапыПройдена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик подписки справочника Проекты перед записью.
//
// Параметры:
//  Источник - СправочникОбъект.Проекты
//  Отказ	 - Булево
//
Процедура ПроверкаПередЗаписью_ПроектыПередЗаписью(Источник, Отказ) Экспорт
	
	Если НЕ упоЗакрытиеЭтапаПовтИспСеанс.СтрогийКонтрольИзмененияЗакрытыхЭтапов() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов Тогда
		Возврат;
	КонецЕсли;

	//
	
	Если Источник.ДополнительныеСвойства.Свойство("упоУдалениеЛишнихДвиженийВерсии") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("упоНеПроверятьЗакрытыеЭтапы") 
		И Источник.ДополнительныеСвойства.упоНеПроверятьЗакрытыеЭтапы Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("упоПроверкаНаЗакрытыеЭтапыПройдена") 
		И Источник.ДополнительныеСвойства.упоПроверкаНаЗакрытыеЭтапыПройдена Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	Если Не Источник.ЭтоПроектнаяЗадача Тогда
		Возврат;
	КонецЕсли;
	
	//
		
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, "Родитель, КодСДР");
	
	ПредыдущийКодСДР = ЗначенияРеквизитов.КодСДР;
	ПредыдущийРодитель = ЗначенияРеквизитов.Родитель;
	
	Если ПредыдущийРодитель <> Источник.Родитель Тогда
		
		ЗадачаЗакрыта = Ложь;
		
		Если НЕ ЗадачаЗакрыта И ЗначениеЗаполнено(Источник.Родитель) Тогда
			ЗадачаЗакрыта = ЗадачаЗакрыта(Источник.Родитель);	
		КонецЕсли;		
		
		Если НЕ ЗадачаЗакрыта И ЗначениеЗаполнено(ПредыдущийРодитель) И ПредыдущийРодитель <> Источник.Родитель Тогда
			ЗадачаЗакрыта = ЗадачаЗакрыта(ПредыдущийРодитель);	
		КонецЕсли;		
		
		Если ЗадачаЗакрыта Тогда
			
			Отказ = Истина;
			
			ТекстСообщения = НСтр("ru = 'Попытка создать\перенести задачу ""%1"" в\из закрытого этапа.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Источник.Ссылка);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаПередЗаписьюРегистра(ИмяРегистра, ТипРегистра, Источник, Отказ, Замещение, 
	ПолеПроектнойЗадачи = Неопределено, ПолеЗеркальногоПроекта = Неопределено, ПолеВерсии = Неопределено)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = Источник.Отбор.Регистратор.Значение;
	
	ТаблицаЗадач = Новый ТаблицаЗначений;
	ТаблицаЗадач.Колонки.Добавить("ПроектнаяЗадача");
	ТаблицаЗадач.Колонки.Добавить("Версия");
	
	ВыгружаемоеПоле = ПолеПроектнойЗадачи;
	Если ВыгружаемоеПоле = Неопределено Тогда
		ВыгружаемоеПоле = ПолеЗеркальногоПроекта;
	КонецЕсли;
	
	///
	
	Если ПолеВерсии <> Неопределено Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаРегистра.%3 КАК ПроектнаяЗадача,
		|	ТаблицаРегистра.%4 КАК Версия
		|ИЗ
		|	%1.%2 КАК ТаблицаРегистра
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО ТаблицаРегистра.%4 = упоВерсииПроекта.Версия
		|ГДЕ
		|	ТаблицаРегистра.Регистратор = &Регистратор";
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаРегистра.%3 КАК ПроектнаяЗадача
		|ИЗ
		|	%1.%2 КАК ТаблицаРегистра
		|ГДЕ
		|	ТаблицаРегистра.Регистратор = &Регистратор";
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, 
		ТипРегистра, 
		ИмяРегистра,
		ВыгружаемоеПоле,
		ПолеВерсии);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ПроектнаяЗадача) Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаЗадач.Добавить(), Выборка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	///
	
	Если Источник.Количество() > 0 Тогда
		Для Каждого Запись Из Источник Цикл
			Если ПолеВерсии <> Неопределено Тогда
				Если НЕ упоЗакрытиеЭтапаПовтИспВызов.ЭтоТекущаяВерсия(Запись[ПолеВерсии]) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока = ТаблицаЗадач.Добавить();
			НоваяСтрока.ПроектнаяЗадача = Запись[ВыгружаемоеПоле];
			Если ПолеВерсии <> Неопределено Тогда
				НоваяСтрока.Версия = Запись[ПолеВерсии];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	///
	
	ТаблицаЗадач.Свернуть("ПроектнаяЗадача, Версия");
	
	ЗакрытыеЗадачи = Новый Массив;
	Для Каждого СтрокаЗадач Из ТаблицаЗадач Цикл
		Закрыта = ЗадачаЗакрыта(СтрокаЗадач.ПроектнаяЗадача, ,, СтрокаЗадач.Версия);
		Если Закрыта Тогда
			ЗакрытыеЗадачи.Добавить(СтрокаЗадач.ПроектнаяЗадача);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		
		ТекстСообщения = ТекстОшибкиИзменениеЗадачЗакрытогоЭтапа(ЗакрытыеЗадачи);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ТекстИсключения = НСтр("ru = 'Не удалось провести ""%1""! Попытка изменить данные закрытого этапа.'"); 
		ТекстИсключения = СтрШаблон(ТекстИсключения, Регистратор);
		ВызватьИсключение(ТекстИсключения);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстОшибкиИзменениеЗадачЗакрытогоЭтапа(ЗакрытыеЗадачи)
	
	КоличествоЗакрытых = ЗакрытыеЗадачи.Количество();
	
	ТекстыЗадач = Новый Массив;
	НазванияЗакрытыхЗадач = упоПроектыИЗадачиСервер.НазванияПроектныхЗадач(ЗакрытыеЗадачи, Истина);
	Для Каждого КлючЗначение Из НазванияЗакрытыхЗадач Цикл
		ТекстыЗадач.Добавить(КлючЗначение.Значение);
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru = 'Попытка изменить данные %1 закрытого этапа:
		|%2 '");
		ТекстЗадача = ?(КоличествоЗакрытых = 1, НСтр("ru = 'проектной задачи'"), НСтр("ru = 'проектных задач'"));
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
		ТекстЗадача, 
		СтрСоединить(ТекстыЗадач, Символы.ПС));
		
	Возврат ТекстСообщения;
	
КонецФункции

#КонецОбласти
