////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с версиями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает наименование базовой версии.
// 
// Возвращаемое значение:
//  Строка - наименование базовой версии.
//
Функция ПолучитьНаименованиеБазовойВерсии() Экспорт
	
	Возврат НСтр("ru = 'Утвержденная версия'");
	
КонецФункции

// Функция возвращает наименование базовой версии для проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проект, для которого нужно верунть наименование базовой версии.
// 
// Возвращаемое значение:
//  Строка - наименование базовой версии.
//
Функция ПолучитьНаименованиеНовойВерсии(Проект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(упоВерсииПроекта.Версия) КАК КоличествоВерсий
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Проект = &Проект
	               |	И НЕ упоВерсииПроекта.Системная
	               |	И НЕ упоВерсииПроекта.Текущая";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	КоличествоВерсий = 0;
	Если Выборка.Следующий() Тогда
		КоличествоВерсий = Выборка.КоличествоВерсий;
	КонецЕсли;
	
	Возврат НСтр("ru = 'Версия N'")+" "+Формат(КоличествоВерсий + 1, "ЧГ=0");
	
КонецФункции

// Получает наименование версии.
//
// Параметры:
//  Версия	 - ДокументСсылка.упоВерсияПланаПроекта - версия, для которой надо получить наименование.
//
// Возвращаемое значение:
//	Строка, Неопределено - наименование версии или Неопределено, если не нашли.
//
Функция ПолучитьНаименованиеВерсии(Версия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоВерсииПроекта.НаименованиеВерсии
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Версия = &Версия";
	Запрос.УстановитьПараметр("Версия", Версия);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе     
		Возврат РезультатЗапроса.Выгрузить()[0].НаименованиеВерсии;
	КонецЕсли;
	
КонецФункции 

// Возвращает свойства версии.
//
// Параметры:
//  Версия	 -ДокументСсылка.упоВерсияПланаПроекта 	 - версия проекта.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - свойства версии
//
Функция ПолучитьДанныеВерсии(Версия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоВерсииПроекта.Проект КАК Проект,
	               |	упоВерсииПроекта.Текущая КАК Текущая,
	               |	упоВерсииПроекта.Системная КАК Системная,
	               |	упоВерсииПроекта.Базовая КАК Базовая,
	               |	упоВерсииПроекта.НаименованиеВерсии КАК НаименованиеВерсии,
	               |	упоВерсииПроекта.Автор КАК Автор,
	               |	упоВерсииПроекта.ДатаОбновления КАК ДатаОбновления,
	               |	упоВерсииПроекта.Договорная КАК Договорная,
	               |	упоВерсииПроекта.ДатаСоздания КАК ДатаСоздания,
	               |	упоВерсииПроекта.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Версия = &Версия";
	
	ТаблицаВерсия = Запрос.Выполнить().Выгрузить();
	
	Результат = Новый Структура;
	Для Каждого Колонка Из ТаблицаВерсия.Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	Если Результат.Количество() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ТаблицаВерсия[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает текущую версию проекта или проектной задачи.
//
// Параметры:
//  Проект						 - СправочникСсылка.Проекты, ДокументСсылка.упоПроектнаяЗадача - 
//											проект или проектная задача, для которого нужно получить версию.
//  НеопределеноКогдаНеНайдено - Булево - признак того, что надо возвращать из функции Неопределено в случае,
//											когда текущая версия проекта не найдена. Если = Ложь, то возвращает
//											пустую ссылку ДокументСсылка.упоВерсияПланаПроекта.
//
// Возвращаемое значение:
//  ДокументСсылка.упоВерсияПланаПроекта, Неопределено - текущая версия проекта. Либо пустая ссылка или Неопределено,
//														 если установлен признак флНеопределеноКогдаНеНайдено.
//    
Функция ПолучитьТекущуюВерсиюПроекта(Проект, НеопределеноКогдаНеНайдено = Истина) Экспорт
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ПустаяВерсия = Документы.упоВерсияПланаПроекта.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Проект) = Тип("СправочникСсылка.Проекты") Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Версия
		|ИЗ
		|	РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
		|ГДЕ
		|	Проект = &Проект
		|	И Текущая";
		
	ИначеЕсли ТипЗнч(Проект) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВерсииПроекта.Версия КАК Версия
		|ИЗ
		|	РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &Проект) КАК упоСвойстваПроектныхЗадач
		|		ПО ВерсииПроекта.Версия = упоСвойстваПроектныхЗадач.Версия
		|			И (ВерсииПроекта.Текущая)";
		
	Иначе
		
		Результат = НеопределеноКогдаНеНайдено(ПустаяВерсия, НеопределеноКогдаНеНайдено);
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Версия;
	Иначе
		
		Результат = НеопределеноКогдаНеНайдено(ПустаяВерсия, НеопределеноКогдаНеНайдено);
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

// Возвращает базовую версию проекта.
//
// Параметры:
//  Проект						- СправочникСсылка.Проекты - проект, для которого нужно получить версию. 
//  НеопределеноКогдаНеНайдено 	- Булево - признак того, что надо возвращать из функции Неопределено в случае,
//											когда базовая версия проекта не найдена. Если = Ложь, то возвращает
//											пустую ссылку ДокументСсылка.упоВерсияПланаПроекта. 
//
// Возвращаемое значение:
//	ДокументСсылка.упоВерсияПланаПроекта, Неопределено - базовая версия проекта. Либо пустая ссылка или Неопределено,
//														 если установлен признак флНеопределеноКогдаНеНайдено.
//
Функция ПолучитьБазовуюВерсиюПроекта(Проект, НеопределеноКогдаНеНайдено = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Версия
		|ИЗ
		|	РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
		|ГДЕ
		|	Проект = &Проект
		|	И Базовая";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Версия;
	Иначе
		Если НеопределеноКогдаНеНайдено Тогда
			Возврат Неопределено;
		Иначе
			Возврат Документы.упоВерсияПланаПроекта.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Возвращает договорную версию проекта.
//
// Параметры:
//  Проект						- СправочникСсылка.Проекты - проект, для которого нужно получить версию. 
//  НеопределеноКогдаНеНайдено 	- Булево - признак того, что надо возвращать из функции Неопределено в случае,
//											когда договорная версия проекта не найдена. Если = Ложь, то возвращает
//											пустую ссылку ДокументСсылка.упоВерсияПланаПроекта. 
//
// Возвращаемое значение:
//	ДокументСсылка.упоВерсияПланаПроекта, Неопределено - договорная версия проекта. Либо пустая ссылка или Неопределено,
//														 если установлен признак флНеопределеноКогдаНеНайдено.
//
Функция ПолучитьДоговорнуюВерсиюПроекта(Проект, НеопределеноКогдаНеНайдено = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Версия
		|ИЗ
		|	РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
		|ГДЕ
		|	Проект = &Проект
		|	И Договорная";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Версия;
	Иначе
		Если НеопределеноКогдаНеНайдено Тогда
			Возврат Неопределено;
		Иначе
			Возврат Документы.упоВерсияПланаПроекта.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Проверяет соответствие проекта и версии.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты				 - проект, для которого нужно проверить версию.
//  Версия	 - ДокументСсылка.упоВерсияПланаПроекта	 - версия, которую нужно проверить на принадлежность проекту.
// 
// Возвращаемое значение:
//  Булево - соответствие версии и проекта.
//
Функция ВерсияСоответствуетПроекту(Проект, Версия) Экспорт
	
	Если Не ЗначениеЗаполнено(Проект) Или НЕ ЗначениеЗаполнено(Версия) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИСТИНА КАК Соответствует
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Проект = &Проект
	               |	И упоВерсииПроекта.Версия = &Версия";
	Запрос.УстановитьПараметр("Проект", Проект);				   
	Запрос.УстановитьПараметр("Версия", Версия);
	
	Возврат Не Запрос.Выполнить().Пустой();	
	
КонецФункции 

// Записывает версию проекта.
//
// Параметры:
//  Проект				 - СправочникСсылка.Проекты - проект, для которого нужно фиксировать версию.
//  ДопПараметры         - Структура:
//      * НаименованиеВерсии    - Строка
//      * Комментарий           - Строка
//      * Сценарий              - Массив из СправочникСсылка.упоСценарии 
//
// Возвращаемое значение:
//	Строка - пустая строка в случае успешного выполнения. Сообщение ошибки в случае, если не удалось зафиксировать.
//
Функция ЗафиксироватьВерсию(Проект, ДопПараметры = Неопределено) Экспорт
    
    ПроектныеОпции = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	ТекущаяВерсияПроекта = ПолучитьТекущуюВерсиюПроекта(Проект);
    
    НаименованиеВерсии = "";
    Комментарий = "";
    Сценарии = Неопределено;
    
    Если ДопПараметры <> Неопределено Тогда                                  
        ДопПараметры.Свойство("НаименованиеВерсии", НаименованиеВерсии);
        ДопПараметры.Свойство("Комментарий", Комментарий);  
        ДопПараметры.Свойство("Сценарии", Сценарии);
    КонецЕсли;
    
    ДанныеЗаполнения = ДанныеЗаполненияВерсииПоУмолчанию(Проект, ТекущаяВерсияПроекта); 
    
    ДопДанныеЗаполнения = Новый Структура("НаименованиеВерсии, Комментарий,
        |Сценарии, ВерсияВключаетДанныеВыполнения", НаименованиеВерсии, Комментарий, 
        Сценарии, ПроектныеОпции.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки);
        
    ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ДопДанныеЗаполнения);
    
    НоваяВерсия = КопироватьВерсию(ДанныеЗаполнения);
    
	Возврат НоваяВерсия;
	
КонецФункции

// Восстанавливает версию проекта.
//
// Параметры:
//  Проект									 - СправочникСсылка.Проекты	 - проект, для которого нужно восстановить версию.
//  ВосстанавливаемаяВерсия					 - ДокументСсылка.упоВерсияПланаПроекта, ДокументСсылка.упоУтверждениеПланаПроекта	 - версия плана проекта.
//  ПроверкаТекВерсииПроектаНаЗакрытыеЭтапы	 - Булево					 - признак необходимости проверки на закрытые этапы.
//
Процедура ВосстановитьВерсию(Проект, ВосстанавливаемаяВерсия, ПроверкаТекВерсииПроектаНаЗакрытыеЭтапы = Истина) Экспорт
	
	Если ПроверкаТекВерсииПроектаНаЗакрытыеЭтапы Тогда
		
		ЕстьЗакрытыеЭтапыВТекВерсииПроекта = упоПроектыИЗадачиСервер.ЕстьЗакрытыеЭтапыВТекущейВерсииПроекта(Проект);
		
		Если ЕстьЗакрытыеЭтапыВТекВерсииПроекта Тогда
			ТекстСообщения = НСтр("ru = 'В текущей версии проекта есть закрытые этапы. Загрузка в текущую версию невозможна.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	текВерсия = упоЗаписьИПроведениеПривилегированный.СоздатьТекущуюВерсиюПроекта(Проект, ВосстанавливаемаяВерсия);
	
	// Необходимо создать зеркалирование ПЗ на проекты и настроить коды СДР.
	ПерестроитьИерархиюПЗ(Проект, текВерсия);
	ОбновитьКодСДРдляВерсионирования(Проект, ВосстанавливаемаяВерсия);
	ОбновитьСвойстваЗеркалПроектныхЗадач(текВерсия);
	
	упоИерархияИПолномочияСервер.АктуализироватьРуководителейВсехПроектныхЗадачПроекта(Проект);
	
	упоЗадания.СинхронизироватьПорученияЗадач(Проект, Проект);
	
	ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов =
		Константы.упоАвтоматическийРасчетСроковСвязанныхПроектов.Получить();
	Если ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов Тогда
		упоРасчетКалендарныхСроковРедакция3Сервер.ПриИзмененииСроковЗадачНеобходимоПересчитатьПроекты(Проект, Истина);
	КонецЕсли;
	
	СнятиеПометкиУдаленияЗадачЗагруженныхИзВерсии(текВерсия);
	
КонецПроцедуры

// Копирует версию проекта и создает новую.
//
// Параметры:
//  ДанныеЗаполнения - Структура:
//  	* Проект				 - СправочникСсылка.Проекты - проект, для которого нужно сделать копию версии.
//  	* ВерсияОснование        - ДокументСсылка.упоВерсияПланаПроекта
//  	* НаименованиеВерсии	 - Строка - имя новой версии.
//  	* Системная			     - Булево - признак того, что новая версия системная.
//  	* Базовая				 - Булево - признак того, что новая версия базовая.
//  	* Текущая				 - Булево - признак того, что новая версия текущая.
// 
// Возвращаемое значение:
//  ДокументСсылка.упоВерсияПланаПроекта - ссылка на созданную версию.
//
Функция КопироватьВерсию(ДанныеЗаполнения) Экспорт
	
	ВерсияОснование = Неопределено;
	
	Если Не ДанныеЗаполнения.Свойство("ВерсияОснование", ВерсияОснование) 
		И Не ЗначениеЗаполнено(ВерсияОснование) Тогда
		// КопируемаяВерсия обязательна для создания версии.
		ТекстСообщения = НСтр(
			"ru = 'Ошибка фиксации версии: Обратитесь к разработчику. {Пустое значение ""ВерсияОснование""}'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат Документы.упоВерсияПланаПроекта.ПустаяСсылка();
	КонецЕсли;
	
	новаяВерсия = Документы.упоВерсияПланаПроекта.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(новаяВерсия, ДанныеЗаполнения);
	
	ЗаписатьВерсию(новаяВерсия);
	
	Сценарии = Неопределено;
	Если ДанныеЗаполнения.Свойство("Сценарии", Сценарии) И ЗначениеЗаполнено(Сценарии) Тогда
		ОбновитьСоздатьСвязьСценариевСВерсией(новаяВерсия.Ссылка, Сценарии);
	КонецЕсли;
	
	Возврат новаяВерсия.Ссылка;
	
КонецФункции

// Процедура делает копию текущей версии проекта.
//
// Параметры:
//  Проект				 - СправочникСсылка.Проекты	 - Проект, по которому делается копия версии.
//  НаименованиеВерсии	 - Строка					 - Наименование для новой версии проекта
// 
// Возвращаемое значение:
//  ДокументСсылка.упоВерсияПланаПроекта - версия проекта.
//
Функция КопироватьТекущуюВерсиюПроекта(Проект, НаименованиеВерсии = "") Экспорт

	ТекущаяВерсияПроекта = ПолучитьТекущуюВерсиюПроекта(Проект);
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("Проект", Проект);
	ПараметрыСоздания.Вставить("ВерсияОснование", ТекущаяВерсияПроекта);
	ПараметрыСоздания.Вставить("НаименованиеВерсии", НаименованиеВерсии);
	ПараметрыСоздания.Вставить("ВерсияВключаетДанныеВыполнения", Истина);
	
	НоваяВерсия = КопироватьВерсию(ПараметрыСоздания);
	
	Возврат НоваяВерсия;

КонецФункции //

// Возвращает структуру данных по умолчанию для заполнения нового документа версии на основании указанной.
//
// Параметры:
//  Проект             - СправочникСсылка.Проекты
//  ВерсияОснование     - ДокументСсылка.упоВерсияПланаПроекта
// 
// Возвращаемое значение:
//   Структура
//
Функция ДанныеЗаполненияВерсииПоУмолчанию(Проект = Неопределено, ВерсияОснование = Неопределено) Экспорт
    
    ДанныеЗаполнения = Новый Структура;
    ДанныеЗаполнения.Вставить("ВерсияОснование", ВерсияОснование);
    ДанныеЗаполнения.Вставить("ВерсияВключаетДанныеВыполнения", Ложь);
    ДанныеЗаполнения.Вставить("Комментарий", "");
    ДанныеЗаполнения.Вставить("НаименованиеВерсии", "");
    ДанныеЗаполнения.Вставить("Проект", Проект);
    ДанныеЗаполнения.Вставить("Сценарии", Новый Массив); 
    
    ДанныеЗаполнения.Вставить("Базовая", Ложь); 
    ДанныеЗаполнения.Вставить("Системная", Ложь); 
    ДанныеЗаполнения.Вставить("Текущая", Ложь); 
    
    Возврат ДанныеЗаполнения;

КонецФункции

// Редактировать свойства версии.
//
// Параметры:
//  Проект			 - 			 - СправочникСсылка.Проекты
//  Версия			 - 			 - ДокументСсылка.упоВерсияПланаПроекта
//  НовыеСвойства	 - Структура - свойства версии.
//
Процедура УстановитьСвойстваВерсииПроекта(Проект, Версия, НовыеСвойства) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.упоВерсииПроекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Проект = Проект;
	МенеджерЗаписи.Версия = Версия;
	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НовыеСвойства);
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Удаляет версию проекта.
//
// Параметры:
//  Проект			 - СправочникСсылка.Проекты - проект, для которого надо удалить версию.
//  УдаляемаяВерсия	 - ДокументСсылка.упоВерсияПланаПроекта - удаляемая версия.
//
// Возвращаемое значение:
//	Неопределено - не возвращает никакого значения.
//
Функция УдалитьВерсию(Проект, УдаляемаяВерсия) Экспорт
	
	упоЗаписьИПроведениеПривилегированный.УдалитьВерсиюПроекта(Проект, УдаляемаяВерсия);
	
КонецФункции

// Проверяет, есть ли у проекта текущая версия. Если нет, то создает ее.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - проект, для которого надо проверить текущую версию. 
//
// Возвращаемое значение:
//	Документы.упоВерсияПланаПроекта - версия проекта.
//
Функция ПроверитьТекущуюВерсиюПроекта(Проект) Экспорт
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Возврат Документы.упоВерсияПланаПроекта.ПустаяСсылка();
	КонецЕсли;	
	
	// Проверим, что еще нет текущей версии.
	текущаяВерсия = ПолучитьТекущуюВерсиюПроекта(Проект);
	
	Если текущаяВерсия = Неопределено Тогда
		текущаяВерсия = упоЗаписьИПроведениеПривилегированный.СоздатьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	Возврат текущаяВерсия;
	
КонецФункции

// Устанавливает версию для проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - проект, для которого надо установить версию.
//  Версия	 - ДокументСсылка.упоВерсияПланаПроекта - устанавливаемая версия.
//
// Возвращаемое значение:
//	Булево - результат установки.
//
Функция ОбновитьВерсиюПроекта(Проект, Версия) Экспорт
	
	Если ЗначениеЗаполнено(Версия) Тогда
		текВерсия = ПолучитьТекущуюВерсиюПроекта(Проект);
		Если текВерсия = Версия Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Невозможно обновить текущую версию проекта саму собой!'");
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;
		
		ВерсияОбъект = Версия.ПолучитьОбъект();
		ВерсияОбъект.ВерсияОснование = текВерсия;
		// Т.к. у текущей версии реквизит ВерсияВключаетДанныеВыполнения всегда Истина,
		// то и при обновлении версии из текущей этот реквизит должен стать Истина.		
		ВерсияОбъект.ВерсияВключаетДанныеВыполнения = Истина;
		
		ЗаписатьВерсию(ВерсияОбъект);
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции 

// Обновляет базовую версию проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - проект, для которого обновляется базовая версия.
//
Процедура ОбновитьБазовуюВерсиюПроекта(Проект) Экспорт
	
	упоЗаписьИПроведениеПривилегированный.ОбновитьБазовуюВерсиюПроекта(Проект);	
	
КонецПроцедуры

// Помечает на удаление базовую версию проекта, удаляет запись с этой версией из регистра "Версии проектов".
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - проект, для которого необходимо выполнить действия.
//
// Возвращаемое значение:
//	Неопределено - не возвращает никакого значения.
//
Функция УдалитьБазовуюВерсиюПроекта(Проект) Экспорт

	БазоваяВерсия = ПолучитьБазовуюВерсиюПроекта(Проект);
	
	Если БазоваяВерсия <> Неопределено Тогда
		
		упоЗаписьИПроведениеПривилегированный.УдалитьВерсиюПроекта(Проект, БазоваяВерсия);
		
	КонецЕсли;
	
КонецФункции

// Обновить коды СДР по проекту для версии.
//
// Параметры:
//  Проект		 - СправочникСсылка.Проекты - проект, для которого необходимо выполнить действия. 
//  ВосВерсия	 - ДокументСсылка.упоВерсияПланаПроекта - версия проекта, для которой нужно обновить коды СДР.
//
// Возвращаемое значение:
//	Соответствие - в качестве ключа элемента выступает значение типа ДокументСсылка.упоПроектнаяЗадача,
//				   а в качестве значения значения элемента соответствия - тип Строка.
//
Функция ОбновитьКодСДРдляВерсионирования(Проект, ВосВерсия) Экспорт

	// Возвращает соответствие ссылка -> КодСДР (новый).
	ТемпИзмененныеКодыСДР = Новый Соответствие;
	ТемпКодыСДР = Новый Соответствие;
	ТемпИерархия = Новый Соответствие;
	
	Направление = Перечисления.упоНаправлениеДвиженияПоСДР.НеПеремещать;
	записыватьИзменения = Истина;
	
	// Получим иерархию задач по родителям.
	
	упоПроектыИЗадачиВызовСервера.ЗаполнитьИерархию(Проект, ТемпИерархия, ТемпКодыСДР);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоКодыСДРСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоКодыСДРСрезПоследних.КодСДР КАК КодСДР
	               |ИЗ
	               |	РегистрСведений.упоКодыСДР.СрезПоследних(, Версия = &Версия) КАК упоКодыСДРСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО упоКодыСДРСрезПоследних.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
	
	Запрос.УстановитьПараметр("Версия", ВосВерсия);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТемпКодыСДР.Вставить(Выборка.ПроектнаяЗадача, Выборка.КодСДР);
	КонецЦикла;
	
	упоПроектыИЗадачиВызовСервера.ЗаполнитьКодыСДР(Проект , ТемпИерархия, ТемпКодыСДР, ТемпИзмененныеКодыСДР, Неопределено, Направление, "", Истина);
	
	Если записыватьИзменения Тогда
		Для каждого ТемпЭлемент Из ТемпИзмененныеКодыСДР Цикл
			Попытка
				Об = ТемпЭлемент.Ключ.ПолучитьОбъект();
				Об.КодСДР = ТемпЭлемент.Значение;
				Об.Записать();
			Исключение
				НСтрока = НСтр("ru = 'Неудачная попытка обновления кода СДР для элемента ""%1"".
                                |Описание ошибки: %2.'");
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ТемпЭлемент.Ключ, ОписаниеОшибки());
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТемпИзмененныеКодыСДР;
	
КонецФункции

// Редактировать связь сценариев с версией.
//
// Параметры: 
//  Сценарии        - Массив из СправочникСсылка.упоСценарии - если значение не указано, все связи версии будут очищены. 
//  Версия          - ДокументСсылка.упоВерсияПланаПроекта
//
Процедура ОбновитьСоздатьСвязьСценариевСВерсией(Версия, Сценарии = Неопределено) Экспорт
    
    Если Сценарии = Неопределено Тогда
        Сценарии = Новый Массив;    	
    КонецЕсли;
    
    НаборЗаписейМенеджер = РегистрыСведений.упоСценарииВерсий.СоздатьНаборЗаписей();
	НаборЗаписейМенеджер.Отбор.Версия.Установить(Версия);    
    
    // Очистим все связи, если не указаны сценарии.
    Если Не Сценарии.Количество() Тогда
        ЗаписатьНаборЗаписейРегистраСценариевВерсий(Версия, НаборЗаписейМенеджер);
        Возврат;	
    КонецЕсли;
    
    // Иначе создадим/обновим их.
    Для каждого Сценарий Из Сценарии Цикл
        Запись = НаборЗаписейМенеджер.Добавить();
        Запись.Версия = Версия;
        Запись.Сценарий = Сценарий;
    КонецЦикла;
    
    ЗаписатьНаборЗаписейРегистраСценариевВерсий(Версия, НаборЗаписейМенеджер);
                
КонецПроцедуры 

// Удалить связь сценария с версией.
//
// Параметры:
//  Версия      - ДокументСсылка.упоВерсияПланаПроекта
//  Сценарий    - СправочникСсылка.упоСценарии 
//
Процедура УдалитьСвязьСценарияСВерсией(Версия, Сценарий) Экспорт

    МенеджерЗаписи = РегистрыСведений.упоСценарииВерсий.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Версия = Версия;
    МенеджерЗаписи.Сценарий = Сценарий;
    МенеджерЗаписи.Прочитать();             
    
    Попытка
        Если МенеджерЗаписи.Выбран() Тогда
            МенеджерЗаписи.Удалить();	
        КонецЕсли;
    Исключение 
        ВерсияНаименование = упоВерсионирование.ПолучитьНаименованиеВерсии(Версия);
        СценарийНаименование = Строка(Сценарий);
        ПроектНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Версия.Проект, "Наименование");
        
        Сообщение = НСтр("ru = 'Ошибка удаления записи сценария %1 версии %2 для проекта %3.'"); 
        СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, СценарийНаименование, 
            ВерсияНаименование, ПроектНаименование); 
            
        ЗаписьЖурналаРегистрации(Сообщение, УровеньЖурналаРегистрации.Ошибка, , , 
            НСтр("ru = 'Во время выполнения действия произошла ошибка.'") + Символы.ПС +
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
            
        ТекстСообщения = НСтр("ru = 'Не удалось стереть предыдущую связь указанного сценария у версии %1 проекта: %2.'");
        СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВерсияНаименование, 
            ПроектНаименование); 
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
    КонецПопытки;

КонецПроцедуры

// Установить новое наименование версии очищаемой связи.
//
// Параметры:
//  Проект                  - СправочникСсылка.Проекты  
//  Версия                  - ДокументСсылка.упоВерсияПланаПроекта
//  НаименованиеСценария    - Строка
//
Процедура УстановитьНовоеНаименованиеОчищаемойСвязи(Проект, Версия, НаименованиеСценария) Экспорт

    НаименованиеВерсииТекСвязи = упоВерсионирование.ПолучитьНаименованиеВерсии(Версия);
    НаименованиеВерсииТекСвязи = СтрЗаменить(НаименованиеВерсииТекСвязи, "; ", ";");
    НаименованиеВерсииВМассиве = СтрРазделить(НаименованиеВерсииТекСвязи, ";", Ложь);
    
    Если Не НаименованиеВерсииВМассиве.Количество() Тогда
        Возврат;	
    КонецЕсли;
    
    АдресПодстроки = НаименованиеВерсииВМассиве.Найти(НаименованиеСценария);
    
    Если АдресПодстроки = Неопределено Тогда
        Возврат;    
    КонецЕсли;

    НаименованиеВерсииВМассиве.Удалить(АдресПодстроки);
    
    Если Не НаименованиеВерсииВМассиве.Количество() Тогда
        НовоеЗначение = Новый Структура("НаименованиеВерсии", упоВерсионирование.ПолучитьНаименованиеНовойВерсии(Проект));
        упоВерсионирование.УстановитьСвойстваВерсииПроекта(Проект, Версия, НовоеЗначение);
        Возврат;
    КонецЕсли; 
    
    НовоеЗначение = Новый Структура("НаименованиеВерсии", СтрСоединить(НаименованиеВерсииВМассиве, "; "));
    упоВерсионирование.УстановитьСвойстваВерсииПроекта(Проект, Версия, НовоеЗначение);

КонецПроцедуры

// Получить сценарии указанной версии.
//
// Параметры:
//  Версия      - ДокументСсылка.упоВерсияПланаПроекта
// 
// Возвращаемое значение:
//	Массив из ДокументСсылка.упоСценарии.
//
Функция СценарииВерсии(Версия) Экспорт
    
    МассивСценариев = Новый Массив;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   упоСценарииВерсий.Сценарий КАК Сценарий
        |ИЗ
        |   РегистрСведений.упоСценарииВерсий КАК упоСценарииВерсий
        |ГДЕ
        |   упоСценарииВерсий.Версия = &Версия";
    
    Запрос.УстановитьПараметр("Версия", Версия);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат МассивСценариев;
    КонецЕсли;
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        МассивСценариев.Добавить(ВыборкаДетальныеЗаписи.Сценарий);        	
    КонецЦикла;
    
    Возврат МассивСценариев;
    
КонецФункции 

// Получить версии проектов по указанному сценарию.
//
// Параметры:
//  Сценарий - СправочникСсылка.упоСценарии 
//  
// Возвращаемое значение:
//	Массив
//
Функция ВерсииПроектовПоСценарию(Сценарий) Экспорт
	
    МассивВерсий = Новый Массив;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   упоСценарииВерсий.Версия КАК Версия
        |ИЗ
        |   РегистрСведений.упоСценарииВерсий КАК упоСценарииВерсий
        |ГДЕ
        |   упоСценарииВерсий.Сценарий = &Сценарий";
    
    Запрос.УстановитьПараметр("Сценарий", Сценарий);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат Неопределено;	
    КонецЕсли;
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        МассивВерсий.Добавить(ВыборкаДетальныеЗаписи.Версия);    
    КонецЦикла;
        
    Возврат МассивВерсий;
    
КонецФункции

// Получить версю проекта по указанному сценарию.
//
// Параметры:
//	Проект	- СправочникСсылка.Проект
//  Сценарий - СправочникСсылка.упоСценарии
//	
// Возвращаемое значение:
//	Неопределено, ДокументСсылка.упоВерсияПланаПроекта
//
Функция ВерсияПроектаПоСценарию(Проект, Сценарий) Экспорт
	
    ВерсияПроекта = Неопределено;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   упоСценарииВерсий.Версия КАК Версия
        |ИЗ
        |   РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСценарииВерсий КАК упоСценарииВерсий
        |       ПО упоВерсииПроекта.Версия = упоСценарииВерсий.Версия
        |ГДЕ
        |   упоСценарииВерсий.Сценарий = &Сценарий
        |   И упоВерсииПроекта.Проект = &Проект";
    
    Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("Проект", Проект);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ВерсияПроекта = ВыборкаДетальныеЗаписи.Версия;
		
    КонецЕсли;
    
	Возврат ВерсияПроекта;
	
КонецФункции

// Возвращает текущие версии переданных задач. Используется для отборов по версии. 
// Пример использования см. упоПроектыИЗадачиСервер.СрокиПроектныхЗадач.
//
// Параметры:
//  ПроектныеЗадачи	 - Массив Из ДокументСсылка.упоПроектнаяЗадача	- проектные задачи, по которым получаем версию.
// 
// Возвращаемое значение:
//  Массив - текущие версии.
//
Функция ТекущиеВерсии(ПроектныеЗадачи) Экспорт
	
	ТекущиеВерсии = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВерсииПроекта.Версия КАК Версия
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСвойстваПроектныхЗадач
	               |		ПО ВерсииПроекта.Версия = упоСвойстваПроектныхЗадач.Версия
	               |			И (ВерсииПроекта.Текущая)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущиеВерсии.Добавить(Выборка.Версия);
	КонецЦикла;
	
	Возврат ТекущиеВерсии;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьВерсию(Версия)
	
	Версия.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции

Функция ПерестроитьИерархиюПЗ(Проект, текВерсия)
	
	СброситьРеквизитОтбораУПроекта(Проект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты1.Ссылка КАК Ссылка,
	               |	Проекты1.Родитель КАК СтарыйРодитель,
	               |	ЕСТЬNULL(Проекты2.Ссылка, Задачи.ПроектнаяЗадача.Проект) КАК НовыйРодитель
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК Задачи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты1
	               |		ПО Задачи.ПроектнаяЗадача = Проекты1.СсылкаНаПроектнуюЗадачу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты2
	               |		ПО (Задачи.ЗадачаРодитель <> &ПустаяСсылкаНаПЗ)
	               |			И Задачи.ЗадачаРодитель = Проекты2.СсылкаНаПроектнуюЗадачу
	               |			И (Проекты2.ЭтоПроектнаяЗадача)
	               |ГДЕ
	               |	НЕ Задачи.ЗадачаОтменена";
	
	Запрос.УстановитьПараметр("текВерсия", текВерсия);
	Запрос.УстановитьПараметр("ПустаяСсылкаНаПЗ", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	
	Результат = Запрос.Выполнить();
	ТаблицаЗадач = Результат.Выгрузить();
	
	// 1. Сначала проверим возможное зацикливание.
	// Если обнаружим, то надо избавиться от него.
	ТаблицаСвязей = Новый ТаблицаЗначений;
	ТаблицаСвязей.Колонки.Добавить("Объект");
	ТаблицаСвязей.Колонки.Добавить("ОбъектСвязи");
	Для Каждого СтрокаЗадач Из ТаблицаЗадач Цикл
		
		Если НЕ СтрокаЗадач.СтарыйРодитель = СтрокаЗадач.НовыйРодитель Тогда
			
			СтрокаТаблицы = ТаблицаСвязей.Найти(СтрокаЗадач.НовыйРодитель, "Объект");
			Если СтрокаТаблицы = Неопределено Тогда
				СтрокаТаблицы = ТаблицаСвязей.Добавить();
			КонецЕсли;
			СтрокаТаблицы.Объект      = СтрокаЗадач.НовыйРодитель;
			СтрокаТаблицы.ОбъектСвязи = СтрокаЗадач.Ссылка;
			
			СтрокаТаблицы = ТаблицаСвязей.Найти(СтрокаЗадач.СтарыйРодитель, "Объект");
			Если СтрокаТаблицы = Неопределено Тогда
				СтрокаТаблицы = ТаблицаСвязей.Добавить();
			КонецЕсли;
			СтрокаТаблицы.Объект      = СтрокаЗадач.СтарыйРодитель;
			СтрокаТаблицы.ОбъектСвязи = СтрокаЗадач.Ссылка;
				
		КонецЕсли;
		
	КонецЦикла;
	
	МассивЗацикленных = Новый Массив;
	ЕстьЗацикливание = ЕстьЗацикливаниеСвязей(ТаблицаСвязей, МассивЗацикленных);
	Если ЕстьЗацикливание Тогда
		
		НачатьТранзакцию();
		
		БылаОшибкаЗаписи = Ложь;
		Для Каждого СсылкаНаЗачищаемый Из МассивЗацикленных Цикл
			ОбжЗачищаемый = СсылкаНаЗачищаемый.ПолучитьОбъект();
			ОбжЗачищаемый.Родитель = Справочники.Проекты.ПустаяСсылка();
			Попытка
				ОбжЗачищаемый.Записать();
			Исключение
				БылаОшибкаЗаписи = Истина;
				ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());   
				ЗаписьЖурналаРегистрации("ОшибкаОбновленияСтруктурыПроектаПослеВосстановленияВерсии", УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Обработки.упоУпрощенныйВводСтруктурыПроекта, , ПредставлениеОшибки);						
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Неудачная попытка обновления структуры проекта после восстановления версии.
                                        |Подробнее см. журнал регистрации.'");
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
		
		Если НЕ БылаОшибкаЗаписи Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// 2. Ошибок с восстановлением из-за зацикливания теперь быть не должно.
	Для Каждого СтрокаЗадач Из ТаблицаЗадач Цикл
		
		Если НЕ СтрокаЗадач.СтарыйРодитель = СтрокаЗадач.НовыйРодитель Тогда
			
			// Надо поменять родителя.
			ЗаписываемыйОбъект = СтрокаЗадач.Ссылка.ПолучитьОбъект();
			ЗаписываемыйОбъект.ТекущаяВерсия = Истина;
			ЗаписываемыйОбъект.Родитель = СтрокаЗадач.НовыйРодитель;
			Попытка
				ЗаписываемыйОбъект.Записать();
			Исключение
				НСтрока = НСтр("ru = 'Неудачная попытка обновления структуры проекта после восстановления версии.
                                |Описание ошибки: %1'");
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ОписаниеОшибки());
				Сообщение.Сообщить();
			КонецПопытки;
			
		Иначе 
			
			ЗаписываемыйОбъект = СтрокаЗадач.Ссылка.ПолучитьОбъект();
			ЗаписываемыйОбъект.ТекущаяВерсия = Истина;
			Попытка
				ЗаписываемыйОбъект.Записать();
			Исключение
				НСтрока = НСтр("ru = 'Неудачная попытка обновления структуры проекта после восстановления версии.
                                |Описание ошибки: %1'");
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ОписаниеОшибки());
				Сообщение.Сообщить();
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Аналог функции обНайтиСвязь общего модуля упоПроектыИЗадачи,
// дублирует (!) одноименную ф-ю упоУпрощенныйВводСтруктурыПроекта.
//
// Параметры:
//  ТаблицаСвязейВх	 - ТаблицаЗначений	 - таблица связей.
// 
// Возвращаемое значение:
//  Булево - признак того, что есть зацикливание.
//
Функция ЕстьЗацикливаниеСвязей(ТаблицаСвязейВх, МассивЗацикленных)
	
	Если ТаблицаСвязейВх.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаСвязей = ТаблицаСвязейВх.Скопировать();
	
	ОтборПоСвязи   = Новый Структура;
	ОтборПоОбъекту = Новый Структура;
		
	Пока Истина Цикл
		
		ЭтоПроход = Ложь;
		
		Для Каждого ДанныеСвязи Из ТаблицаСвязей Цикл
			
			ОтборПоСвязи.Вставить("ОбъектСвязи", ДанныеСвязи.Объект);
			НайденныеСвязи = ТаблицаСвязей.НайтиСтроки(ОтборПоСвязи);
			Если НайденныеСвязи.Количество() = 0 Тогда
				ОтборПоОбъекту.Вставить("Объект", ДанныеСвязи.Объект);
				НайденныеСтроки = ТаблицаСвязей.НайтиСтроки(ОтборПоОбъекту);
				Для Каждого ТекСтрока Из НайденныеСтроки Цикл
					ТаблицаСвязей.Удалить(ТекСтрока);
					ЭтоПроход = Истина;
				КонецЦикла;
				Прервать; // На следующий проход.
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаСвязей.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ЭтоПроход = Ложь Тогда
			МассивЗацикленных = ТаблицаСвязей.ВыгрузитьКолонку("Объект");
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Процедура СброситьРеквизитОтбораУПроекта(Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка,
	               |	Проекты.ТекущаяВерсия
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.Ссылка В ИЕРАРХИИ(&Проект)
	               |	И Проекты.ЭтоПроектнаяЗадача" ;
	Запрос.УстановитьПараметр("Проект",Проект);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ОбъектСправочника  = Результат.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.ТекущаяВерсия = Ложь;
		Попытка
			ОбъектСправочника.записать();
		Исключение
			НСтрока = НСтр("ru = 'Неудачная попытка обновления структуры проекта после восстановления версии.
                            |Описание ошибки: %1'");
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ОписаниеОшибки());
			Сообщение.Сообщить();
				
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура СнятиеПометкиУдаленияЗадачЗагруженныхИзВерсии(Версия)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втЗадачиСПометкой
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЗадачиСПометкой.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	втЗадачиСПометкой КАК втЗадачиСПометкой
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ 
	               |	Проекты.Ссылка КАК ПроектнаяЗадача
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.СсылкаНаПроектнуюЗадачу В
	               |			(ВЫБРАТЬ
	               |				втЗадачиСПометкой.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |			ИЗ
	               |				втЗадачиСПометкой КАК втЗадачиСПометкой)
	               |	И Проекты.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ 
	               |	втЗадачиСПометкой.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	втЗадачиСПометкой КАК втЗадачиСПометкой
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ПО втЗадачиСПометкой.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если Не РезультатЗапроса[1].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			Документ = Выборка.ПроектнаяЗадача.ПолучитьОбъект();
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен = Истина;
			Документ.ДополнительныеСвойства.Вставить("НеЗеркалировать", Истина);
			Документ.Записать(РежимЗаписиДокумента.Запись);
		КонецЦикла;
	КонецЕсли;	
	
	Если Не РезультатЗапроса[2].Пустой() Тогда
		Выборка = РезультатЗапроса[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Справочник = Выборка.ПроектнаяЗадача.ПолучитьОбъект();
			Справочник.ПометкаУдаления = Ложь;
			Справочник.Записать();
		КонецЦикла;
	КонецЕсли;	
	
	Если Не РезультатЗапроса[3].Пустой() Тогда
		Период = ТекущаяДатаСеанса();
		Выборка = РезультатЗапроса[3].Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.упоСтатусыПроектныхЗадач.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.ПроектнаяЗадача);
			Запись = НаборЗаписей.Добавить();
			Запись.Период = Период;
			Запись.Версия = Версия;
			Запись.ПроектнаяЗадача = Выборка.ПроектнаяЗадача;
			Запись.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Запланирована;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Функция НеопределеноКогдаНеНайдено(ПустаяВерсия, НеопределеноКогдаНеНайдено)
	
	Если НеопределеноКогдаНеНайдено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПустаяВерсия;	
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьНаборЗаписейРегистраСценариевВерсий(Версия, НаборЗаписейМенеджер)

    Попытка
        НаборЗаписейМенеджер.Записать();   
    Исключение  
        Сообщение = НСтр("ru = 'Ошибка записи сценариев версии %1 для проекта %2.'"); 
        Сообщение = СтрШаблон(Сообщение, Строка(Версия), 
            ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Версия.Проект, "Наименование")); 
            
        ЗаписьЖурналаРегистрации(Сообщение, УровеньЖурналаРегистрации.Ошибка, , , 
            НСтр("ru = 'Во время выполнения действия произошла ошибка.'") + Символы.ПС +
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
            
        Сообщение = НСтр("ru = 'Не удалось привязать указанные сценарии к версии. 
            |Выберите созданную версию и попробуйте установить сценарий вручную'");
        ОбщегоНазначения.СообщитьПользователю(Сообщение);
    КонецПопытки; 

КонецПроцедуры

Процедура ОбновитьСвойстваЗеркалПроектныхЗадач(текВерсия)
	
	ПроектныеЗадачи = СписокПроектныхЗадачПоВерсии(текВерсия);
	
	Для Каждого ПроектнаяЗадача Из ПроектныеЗадачи Цикл
		упоПроектыИЗадачиСервер.СоздатьОбновитьСвязанныйЭлементСправочникаПроекты(ПроектнаяЗадача);
	КонецЦикла;
	
КонецПроцедуры

Функция СписокПроектныхЗадачПоВерсии(Версия)
	
	ПроектныеЗадачи = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК Ссылка,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель,
		|   упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеПроектнойЗадачи,
		|   Проекты.упоКорневойПроект КАК Проект,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена КАК ЗадачаОтменена
		|ИЗ
		|   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|           ,
		|           Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|       ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу";
	
	РезультатЗапроса = Запрос.Выполнить();
	ПроектныеЗадачиВерсииВыборка = РезультатЗапроса.Выбрать();
	
	Пока ПроектныеЗадачиВерсииВыборка.Следующий() Цикл
		СтруктураСвойств = Новый Структура("Ссылка, ЗадачаРодитель, НазваниеПроектнойЗадачи, Проект, Проведен, ПометкаУдаления,
				| ДополнительныеСвойства, ЭтоАктируемаяЗадача, ЗадачаОтменена");
		
		ЗаполнитьЗначенияСвойств(СтруктураСвойств, ПроектныеЗадачиВерсииВыборка);
		
		СтруктураСвойств.Вставить("Проведен", Истина);
		СтруктураСвойств.Вставить("ПометкаУдаления", Ложь);
		СтруктураСвойств.Вставить("ДополнительныеСвойства", Новый Структура("НеИзменятьКодСДР", Истина));
		
		ПроектныеЗадачи.Добавить(СтруктураСвойств);
	КонецЦикла;
	
	Возврат ПроектныеЗадачи;
	
КонецФункции

#КонецОбласти