
&После("ЗаписатьВРегистрСтатусЗадания")
Процедура Расш1_ЗаписатьВРегистрСтатусЗадания(пЗадание, пСтатус, пКомментарий, пАвтор)
	
	//{[+] ИКТ №18794 (фрагмент ДОБАВЛЕН), Новоселов, 17.06.2026 
	Если пЗадание.ЭтоОсновноеЗаданиеПроектнойЗадачи 
		И ТипЗнч(пЗадание.ОбъектБазы) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
	
		ПроектнаяЗадача = пЗадание.ОбъектБазы;
		
		// Определяем статус и процент
		Если пСтатус = Перечисления.упоСтатусыЗаданий.Выдано
			ИЛИ пСтатус = Перечисления.упоСтатусыЗаданий.ИКТ_Запланировано Тогда
			СтатусПЗ  = Перечисления.упоСостояниеСтатусаЗадачи.Запланирована;
			ПроцентПЗ = 0;
		ИначеЕсли пСтатус = Перечисления.упоСтатусыЗаданий.Закрыто Тогда
			СтатусПЗ  = Перечисления.упоСостояниеСтатусаЗадачи.Завершена;
			ПроцентПЗ = 100;
		Иначе
			СтатусПЗ  = Перечисления.упоСостояниеСтатусаЗадачи.Выполняется;
			ПроцентПЗ = 50;
		КонецЕсли;
		
		// Обновляем статусы
		ОбновитьДанныеПроектнойЗадачи(
			ПроектнаяЗадача,
			СтатусПЗ,
			"упоСтатусыПроектныхЗадач",
			"Статусы",
			"СтатусЗадачи",
			"ПерезаписатьСтатусыЗадач");
		
		// Обновляем проценты готовности
		ОбновитьДанныеПроектнойЗадачи(
			ПроектнаяЗадача,
			ПроцентПЗ,
			"упоПроцентыГотовностиПроектныхЗадач",
			"ПроцентыГотовности",
			"ПроцентГотовности",
			"ПерезаписатьПроцентГотовности");
			
		Если пСтатус = Перечисления.упоСтатусыЗаданий.Закрыто Тогда	
			ВыдатьСледующееЗадание(ПроектнаяЗадача);
		//{[+] ИКТ №20184 (фрагмент ДОБАВЛЕН), Новоселов, 20.07.2026 
		ИначеЕсли пСтатус = Перечисления.упоСтатусыЗаданий.Выдано Тогда
			ДобавитьОповещения(пЗадание);
		//[+]} ИКТ №20184
		КонецЕсли;
		
	КонецЕсли;
	//[+]} ИКТ №18794
	
КонецПроцедуры

//{[+] ИКТ №18794 (фрагмент ДОБАВЛЕН), Новоселов, 17.06.2026 
Процедура ОбновитьДанныеПроектнойЗадачи(ПроектнаяЗадача, ЗначениеПЗ, ИмяРегистра, ИмяТЧ, ИмяПоляТЧ, ИмяФлага)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Регистр.Регистратор КАК Ссылка
		|ИЗ
		|	РегистрСведений." + ИмяРегистра + " КАК Регистр
		|ГДЕ
		|	Регистр.ПроектнаяЗадача = &ПроектнаяЗадача
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистр.Период УБЫВ");
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.упоСохранениеДанныхПроекта") Тогда
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если НЕ ДокументОбъект[ИмяФлага] Тогда
				ДокументОбъект[ИмяФлага] = Истина;
			КонецЕсли;
			
			// Обновляем табличную часть документа
			СтруктураОтбора = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
			МассивСтрок = ДокументОбъект[ИмяТЧ].НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() = 0 Тогда
				НоваяСтрока = ДокументОбъект[ИмяТЧ].Добавить();
				НоваяСтрока.ПроектнаяЗадача = ПроектнаяЗадача;
				НоваяСтрока[ИмяПоляТЧ] = ЗначениеПЗ;
			КонецЕсли;
			
			Для каждого СтрокаМассива Из МассивСтрок Цикл
				СтрокаМассива[ИмяПоляТЧ] = ЗначениеПЗ;
			КонецЦикла;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не определен регистратор для автоматической установки статусов задач: %1'", Выборка.Ссылка)));
		КонецЕсли;
			
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		// Обновляем записи регистра сведений
		НаборЗаписей = Вычислить("РегистрыСведений." + ИмяРегистра + ".СоздатьНаборЗаписей()");;
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			Если Запись.ПроектнаяЗадача = ПроектнаяЗадача Тогда
				Запись[ИмяПоляТЧ] = ЗначениеПЗ;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыдатьСледующееЗадание(ПроектнаяЗадача)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	упоПроектнаяЗадачаПредусловияЗадачи.Ссылка КАК СледующаяЗадача
		|ПОМЕСТИТЬ ВТ_СледующиеПоследовательныеЗадачи
		|ИЗ
		|	Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упоПроектнаяЗадачаПредусловияЗадачи
		|ГДЕ
		|	упоПроектнаяЗадачаПредусловияЗадачи.ЗадачаПредшественник = &ПроектнаяЗадача
		|	И упоПроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.ОкончаниеНачало)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СледующиеПоследовательныеЗадачи.СледующаяЗадача КАК СледующаяЗадача,
		|	МАКСИМУМ(упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи <> ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена)) КАК ЕстьНезавершенныеПредшествующиеПоследовательныеЗадачи
		|ПОМЕСТИТЬ ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЗадачи КАК ВТ_СледующиеПоследовательныеЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упоПроектнаяЗадачаПредусловияЗадачи
		|		ПО (упоПроектнаяЗадачаПредусловияЗадачи.Ссылка = ВТ_СледующиеПоследовательныеЗадачи.СледующаяЗадача)
		|			И (упоПроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.ОкончаниеНачало))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК упоСтатусыПроектныхЗадачСрезПоследних
		|		ПО (упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоПроектнаяЗадачаПредусловияЗадачи.ЗадачаПредшественник)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СледующиеПоследовательныеЗадачи.СледующаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче.СледующаяЗадача КАК СледующаяЗадача
		|ПОМЕСТИТЬ ВТ_СледующиеЗадачиГотовыеКВыдаче
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче КАК ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче
		|ГДЕ
		|	НЕ ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче.ЕстьНезавершенныеПредшествующиеПоследовательныеЗадачи
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	упоПроектнаяЗадачаПредусловияЗадачи.Ссылка
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче КАК ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упоПроектнаяЗадачаПредусловияЗадачи
		|		ПО (упоПроектнаяЗадачаПредусловияЗадачи.ЗадачаПредшественник = ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче.СледующаяЗадача)
		|			И (упоПроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.НачалоНачало))
		|ГДЕ
		|	НЕ ВТ_СледующиеПоследовательныеЗадачиГотовыеКВыдаче.ЕстьНезавершенныеПредшествующиеПоследовательныеЗадачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СледующиеЗадачиГотовыеКВыдаче.СледующаяЗадача КАК СледующаяЗадача,
		|	упоЗадания.Ссылка КАК СледующееЗадание
		|ИЗ
		|	ВТ_СледующиеЗадачиГотовыеКВыдаче КАК ВТ_СледующиеЗадачиГотовыеКВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК упоЗадания
		|		ПО ВТ_СледующиеЗадачиГотовыеКВыдаче.СледующаяЗадача = упоЗадания.ОбъектБазы");
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);

	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			Если ТипЗнч(Выборка.СледующееЗадание) = Тип("Null")  // Если у следующей проектной задачи нет задания, то это веха или этап
					И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СледующаяЗадача, "ЭтоМодельПакетаРабот") Тогда  //[+] ИКТ №20758 (строка ДОБАВЛЕНА), Новоселов, 03.09.2026 Может быть так, что у следующих задач нет заданий
	
				ЭтоЭтап = ВыдатьЗаданияСледующихЭтапов(ПроектнаяЗадача);  //[+] ИКТ №18794 (строка ДОБАВЛЕНА), Новоселов, 15.07.2026 У вехи нет дочерних задач, у этапа есть
				Если Не ЭтоЭтап Тогда
					ОбновитьДанныеПроектнойЗадачи(
						Выборка.СледующаяЗадача,
						Перечисления.упоСостояниеСтатусаЗадачи.Завершена,
						"упоСтатусыПроектныхЗадач",
						"Статусы",
						"СтатусЗадачи",
						"ПерезаписатьСтатусыЗадач");
					ОбновитьДанныеПроектнойЗадачи(
						Выборка.СледующаяЗадача,
						100,
						"упоПроцентыГотовностиПроектныхЗадач",
						"ПроцентыГотовности",
						"ПроцентГотовности",
						"ПерезаписатьПроцентГотовности");
						
					ВыдатьСледующееЗадание(Выборка.СледующаяЗадача);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Выборка.СледующееЗадание) <> Тип("Null") Тогда
				ЗаписатьВРегистрСтатусЗадания(Выборка.СледующееЗадание, Перечисления.упоСтатусыЗаданий.Выдано,,);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Успешно = ВыдатьЗаданияСледующихЭтапов(ПроектнаяЗадача.ЗадачаРодитель);  // Если у задачи нет следующих, эта задача последняя в этапе
	КонецЕсли;

КонецПроцедуры

Функция ВыдатьЗаданияСледующихЭтапов(ТекущийЭтап)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	упоПроектнаяЗадача.Ссылка КАК Этап
		|ПОМЕСТИТЬ ВТ_ТекущийЗавершенныйЭтап
		|ИЗ
		|	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК СтатусыПроектныхЗадачСрезПоследних
		|		ПО (СтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка)
		|			И (СтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена))
		|ГДЕ
		|	упоПроектнаяЗадача.Ссылка = &ТекущийЭтап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упоПроектнаяЗадачаПредусловияЗадачи.Ссылка КАК Этап
		|ПОМЕСТИТЬ ВТ_СледующиеПоследовательныеЭтапы
		|ИЗ
		|	ВТ_ТекущийЗавершенныйЭтап КАК ВТ_ТекущийЗавершенныйЭтап
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упоПроектнаяЗадачаПредусловияЗадачи
		|		ПО ВТ_ТекущийЗавершенныйЭтап.Этап = упоПроектнаяЗадачаПредусловияЗадачи.ЗадачаПредшественник
		|			И (упоПроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.ОкончаниеНачало))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СледующиеПоследовательныеЭтапы.Этап КАК Этап
		|ПОМЕСТИТЬ ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЭтапы КАК ВТ_СледующиеПоследовательныеЭтапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упоПроектнаяЗадачаПредусловияЗадачи
		|		ПО ВТ_СледующиеПоследовательныеЭтапы.Этап = упоПроектнаяЗадачаПредусловияЗадачи.Ссылка
		|			И (упоПроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.ОкончаниеНачало))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК СтатусыПроектныхЗадачСрезПоследних
		|		ПО (СтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ВТ_СледующиеПоследовательныеЭтапы.Этап)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СледующиеПоследовательныеЭтапы.Этап
		|
		|ИМЕЮЩИЕ
		|	НЕ ЕСТЬNULL(МАКСИМУМ(СтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена)), ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту.Этап КАК Этап
		|ПОМЕСТИТЬ ВТ_СледующиеЭтапы
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту КАК ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	упоПроектнаяЗадачаПредусловияЗадачи.Ссылка
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту КАК ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упоПроектнаяЗадачаПредусловияЗадачи
		|		ПО ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту.Этап = упоПроектнаяЗадачаПредусловияЗадачи.Ссылка
		|			И (упоПроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.НачалоНачало))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упоПроектнаяЗадача.Ссылка КАК Задача
		|ПОМЕСТИТЬ ВТ_ЗадачиСледующихЭтаповБезПредусловий
		|ИЗ
		|	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СледующиеЭтапы КАК ВТ_СледующиеЭтапы
		|		ПО (ВТ_СледующиеЭтапы.Этап = упоПроектнаяЗадача.ЗадачаРодитель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упопроектнаяЗадачаПредусловияЗадачи
		|		ПО (упопроектнаяЗадачаПредусловияЗадачи.Ссылка = упоПроектнаяЗадача.Ссылка)
		|ГДЕ
		|	упопроектнаяЗадачаПредусловияЗадачи.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадачиСледующихЭтаповБезПредусловий.Задача КАК Задача
		|ПОМЕСТИТЬ ВТ_ЗадачиСледующихЭтаповГотовыеКВыдаче
		|ИЗ
		|	ВТ_ЗадачиСледующихЭтаповБезПредусловий КАК ВТ_ЗадачиСледующихЭтаповБезПредусловий
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	упопроектнаяЗадачаПредусловияЗадачи.ЗадачаПредшественник
		|ИЗ
		|	ВТ_ЗадачиСледующихЭтаповБезПредусловий КАК ВТ_ЗадачиСледующихЭтаповБезПредусловий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упопроектнаяЗадачаПредусловияЗадачи
		|		ПО (упопроектнаяЗадачаПредусловияЗадачи.Ссылка = ВТ_ЗадачиСледующихЭтаповБезПредусловий.Задача)
		|			И (упопроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТИпСвязи.НачалоНачало))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	упопроектнаяЗадачаПредусловияЗадачи.Ссылка
		|ИЗ
		|	ВТ_ЗадачиСледующихЭтаповБезПредусловий КАК ВТ_ЗадачиСледующихЭтаповБезПредусловий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упопроектнаяЗадачаПредусловияЗадачи
		|		ПО (упопроектнаяЗадачаПредусловияЗадачи.ЗадачаПредшественник = ВТ_ЗадачиСледующихЭтаповБезПредусловий.Задача)
		|			И (упопроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТИпСвязи.НачалоНачало))
		|
		|ОБЪЕДИНИТЬ
		//{[+] ИКТ №18794 (фрагмент ДОБАВЛЕН), Новоселов, 15.07.2026 Родительский этап завершенной задачи может напрямую идти в следующую задачу, в таком случае задача будет в ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту
		|
		|ВЫБРАТЬ
		|	ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту.Этап
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту КАК ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК упоЗадания
		|		ПО (упоЗадания.ОбъектБазы = ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту.Этап)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	упоПроектнаяЗадачаПредусловияЗадачи.Ссылка
		|ИЗ
		|	ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту КАК ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК упоПроектнаяЗадачаПредусловияЗадачи
		|		ПО ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту.Этап = упоПроектнаяЗадачаПредусловияЗадачи.Ссылка
		|			И (упоПроектнаяЗадачаПредусловияЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.НачалоНачало))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК упоЗадания
		|		ПО (упоЗадания.ОбъектБазы = ВТ_СледующиеПоследовательныеЭтапыГотовыеКСтарту.Этап)
		//[+]} ИКТ №18794
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадачиСледующихЭтаповГотовыеКВыдаче.Задача КАК СледующаяЗадача,
		|	упоЗадания.Ссылка КАК СледующееЗадание
		|ИЗ
		|	ВТ_ЗадачиСледующихЭтаповГотовыеКВыдаче КАК ВТ_ЗадачиСледующихЭтаповГотовыеКВыдаче
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК упоЗадания
		|		ПО (упоЗадания.ОбъектБазы = ВТ_ЗадачиСледующихЭтаповГотовыеКВыдаче.Задача)");
	Запрос.УстановитьПараметр("ТекущийЭтап", ТекущийЭтап);
	
	ТекущийЭтоЭтап = Ложь;  //[+] ИКТ №18794 (строка ДОБАВЛЕНА), Новоселов, 15.07.2026
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекущийЭтоЭтап = Истина;		
		Если ТипЗнч(Выборка.СледующееЗадание) = Тип("Null")  // Если у следующей проектной задачи нет задания, то это веха или этап
				И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СледующаяЗадача, "ЭтоМодельПакетаРабот") Тогда  //[+] ИКТ №20758 (строка ДОБАВЛЕНА), Новоселов, 03.09.2026 Может быть так, что у следующих задач нет заданий
				
			ЭтоЭтап = ВыдатьЗаданияСледующихЭтапов(Выборка.СледующаяЗадача);  //[+] ИКТ №18794 (строка ДОБАВЛЕНА), Новоселов, 15.07.2026 У этапов есть дочерние задачи, у вех их нет
			Если Не ЭтоЭтап Тогда
				ОбновитьДанныеПроектнойЗадачи(
					Выборка.СледующаяЗадача,
					Перечисления.упоСостояниеСтатусаЗадачи.Завершена,
					"упоСтатусыПроектныхЗадач",
					"Статусы",
					"СтатусЗадачи",
					"ПерезаписатьСтатусыЗадач");
				ОбновитьДанныеПроектнойЗадачи(
					Выборка.СледующаяЗадача,
					100,
					"упоПроцентыГотовностиПроектныхЗадач",
					"ПроцентыГотовности",
					"ПроцентГотовности",
					"ПерезаписатьПроцентГотовности");
					
				ВыдатьСледующееЗадание(Выборка.СледующаяЗадача);
			КонецЕсли;
				
		ИначеЕсли ТипЗнч(Выборка.СледующееЗадание) <> Тип("Null") Тогда
			ЗаписатьВРегистрСтатусЗадания(Выборка.СледующееЗадание, Перечисления.упоСтатусыЗаданий.Выдано,,);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекущийЭтоЭтап;  //[+] ИКТ №18794 (строка ДОБАВЛЕНА), Новоселов, 15.07.2026 Процедура стала функцией
	
КонецФункции
//[+]} ИКТ №18794

Процедура ДобавитьОповещения(Ссылка) Экспорт
	
	//{[*] ИКТ №20184 (фрагмент ИЗМЕНЕН), Новоселов, 20.07.2026 Была отправка только исполнителю
	СтатусЗадания = упоЗаданияСервер.ПолучитьСтатусЗадания(Ссылка);
	 
	Если СтатусЗадания = Перечисления.упоСтатусыЗаданий.ИКТ_Запланировано
			Или СтатусЗадания = Перечисления.упоСтатусыЗаданий.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	ЗаполнитьПараметрыОповещения(Параметры, СтатусЗадания = Перечисления.упоСтатусыЗаданий.Выдано);
	
	НедоступныеТранспортыОтправкиОповещений = Новый СписокЗначений;
	НедоступныеТранспортыПроверкаИТС = упоОповещенияВызовСервера.НедоступныеТранспортыОтправкиОповещенийПроверкаИТС();
	НедоступныеТранспортыОтправкиОповещений.ЗагрузитьЗначения(НедоступныеТранспортыПроверкаИТС);
	
	НайденноеЗначение = НедоступныеТранспортыОтправкиОповещений.НайтиПоЗначению(Параметры.Транспорт);
	Если НайденноеЗначение <> Неопределено Тогда
		ШаблонСообщения = НСтр("ru = 'Отправка оповещений через транспорт ""%1"" доступна только при наличии активной подписки ИТС.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(НайденноеЗначение));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ОтправлятьОповещениеАвторуИКонтролерам = (СтатусЗадания = Перечисления.упоСтатусыЗаданий.Завершено)
												Или (СтатусЗадания = Перечисления.упоСтатусыЗаданий.Выполняется);
	Запрос = ?(ОтправлятьОповещениеАвторуИКонтролерам, ЗапросПолучателиКураторРПКонтролеры(Ссылка), ЗапросПолучателиИсполнители(Ссылка));	
	//[*]} ИКТ №20184
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		ДопПараметры = Новый Структура("СообщениеОбОшибках, Отправить", "", Ложь);
		РезОтправки = упоОповещенияВызовСервера.ДобавитьСообщение(
			Параметры.ВидСобытия, Ссылка, Неопределено, Параметры.ВидПолучателя, Выборка.Получатель, Параметры.Транспорт, ДопПараметры);
		
		Если Не ПустаяСтрока(ДопПараметры.СообщениеОбОшибках) Тогда
			ОбщегоНазначения.СообщитьПользователю(ДопПараметры.СообщениеОбОшибках);
		КонецЕсли;
		
		Если РезОтправки <> Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Сообщение для пользователя %1 было успешно добавлено в очередь.'"), Выборка.Получатель));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//{[+] ИКТ №17652 (фрагмент ДОБАВЛЕН), Новоселов, 04.05.2026
Процедура ЗаполнитьПараметрыОповещения(Параметры, НовоеЗадание)

	Параметры.Вставить("ВидСобытия",	?(НовоеЗадание, Справочники.упоВидыСобытий.НовоеЗадание, Справочники.упоВидыСобытий.НайтиПоНаименованию("Статус задания изменен")));  //[*] ИКТ №20184 (строка ИЗМЕНЕНА), Новоселов, 17.07.2026 Было только новое задание
	Параметры.Вставить("ВидПолучателя",	Справочники.упоВидыПолучателейОповещений.Пользователи);
	Параметры.Вставить("Транспорт",		Справочники.упоТранспортОповещений.Email);
	
	Если Параметры.ВидСобытия = Справочники.упоВидыСобытий.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю("Письма об изменении статуса не могут быть созданы, т.к. отсутствует соответствующий вид события ""Статус задания изменен"" в справочнике ""Виды событий""!");
	КонецЕсли;

КонецПроцедуры
//[+]} ИКТ №17652

//{[+] ИКТ №20184 (фрагмент ДОБАВЛЕН), Новоселов, 17.07.2026 
Функция ЗапросПолучателиИсполнители(Ссылка)
 	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Получатель
		|ИЗ
		|	Справочник.упоЗадания КАК упоЗадания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО упоЗадания.Исполнитель = Пользователи.упоОсновнойТрудовойРесурс
		|ГДЕ
		|	упоЗадания.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросПолучателиКураторРПКонтролеры(Ссылка)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Данные.РуководительПроекта КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_Контролеры
		|ИЗ
		|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК Данные
		|
		|ОБЪЕДИНИТЬ
		|
		//|ВЫБРАТЬ
		//|	Данные.КураторПроекта
		//|ИЗ
		//|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК Данные
		//|
		//|ОБЪЕДИНИТЬ
		//|
		|ВЫБРАТЬ
		|	упоЗаданияКонтролеры.Контролер
		|ИЗ
		|	Справочник.упоЗадания.Контролеры КАК упоЗаданияКонтролеры
		|ГДЕ
		|	упоЗаданияКонтролеры.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	упоДиспетчерыСистемы.Пользователь КАК Получатель
		|ИЗ
		|	ВТ_Контролеры КАК ВТ_Контролеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоДиспетчерыСистемы КАК упоДиспетчерыСистемы
		|		ПО ВТ_Контролеры.Сотрудник = упоДиспетчерыСистемы.Сотрудник");
	Запрос.УстановитьПараметр("Проект", Ссылка.Проект);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос;

КонецФункции

Процедура ПроверкаОпозданийПоЗаданиям() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	упоЗадания.Ссылка КАК Ссылка,
		|	Пользователи.Ссылка КАК Получатель
		|	
		|ИЗ
		|	Справочник.упоЗадания КАК упоЗадания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
		|		ПО (упоЗаданияСтатусыСрезПоследних.Задание = упоЗадания.Ссылка
		|			И упоЗаданияСтатусыСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Выдано), ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Выполняется)))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
		|		ПО (упоСрокиЗаданий.Задание = упоЗадания.Ссылка)
		|			И упоСрокиЗаданий.ДатаОкончанияПлан <= &ТекущаяДата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО упоЗадания.Исполнитель = Пользователи.упоОсновнойТрудовойРесурс");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	ДопПараметры = Новый Структура("СообщениеОбОшибках, Отправить", "", Ложь);
	Транспорт = Справочники.упоТранспортОповещений.Email;
	
	НедоступныеТранспортыОтправкиОповещений = Новый СписокЗначений;
	НедоступныеТранспортыПроверкаИТС = упоОповещенияВызовСервера.НедоступныеТранспортыОтправкиОповещенийПроверкаИТС();
	НедоступныеТранспортыОтправкиОповещений.ЗагрузитьЗначения(НедоступныеТранспортыПроверкаИТС);
	
	НайденноеЗначение = НедоступныеТранспортыОтправкиОповещений.НайтиПоЗначению(Транспорт);
	Если НайденноеЗначение <> Неопределено Тогда
		ШаблонСообщения = НСтр("ru = 'Отправка оповещений через транспорт ""%1"" доступна только при наличии активной подписки ИТС.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(НайденноеЗначение));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВидПолучателя = Справочники.упоВидыПолучателейОповещений.Пользователи;
	ВидСобытия = Справочники.упоВидыСобытий.НайтиПоНаименованию("Задание просрочено");
	
	СписокОшибок = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДопПараметры.СообщениеОбОшибках = "";
		РезОтправки = упоОповещенияВызовСервера.ДобавитьСообщение(
			ВидСобытия, Выборка.Ссылка, Неопределено, ВидПолучателя, Выборка.Получатель, Транспорт, ДопПараметры);
		
		Если Не ПустаяСтрока(ДопПараметры.СообщениеОбОшибках) Тогда
			СписокОшибок = СтрШаблон(
				"%1
				|
				|%2",
				СписокОшибок,
				ДопПараметры.СообщениеОбОшибках);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СписокОшибок) Тогда
		ВызватьИсключение(СписокОшибок);
	КонецЕсли;
	
КонецПроцедуры
//[+]} ИКТ №20184

//{[+] ИКТ №20758 (фрагмент ДОБАВЛЕН), Новоселов, 08.09.2026 Перенес из ИКТ_ДополнительныеНастройкиСистемы,
// Доработал: присваиваемый статус устанавливался хардкодом, добавил в параметры функции,
// запись в регистр производилась набором записей, исправил на типовую функцию, расширил действие функции аналогично действиям при смене статуса из формы
Процедура УстановитьСтатусЗаданияИзДО(Задание, Статус) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
		|ГДЕ
		|	упоЗаданияСтатусыСрезПоследних.Задание = &Задание");
	Запрос.УстановитьПараметр("Задание", Задание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Статус = Выборка.Статус Тогда
			Возврат;
		КонецЕсли;
	
		Успешно = упоЗаданияСервер.УстановитьСтатусЗадания(Задание, Статус,, Ложь, Ложь);
		ЗаданиеОбъект = Задание.ПолучитьОбъект();
        Модифицированность = Ложь;
		
		Если Не Успешно Тогда
			Прервать;
		
		КонецЕсли;
		
		Если Задание.ЭтоЗаданиеИсполнителяПроектнойЗадачи 
			И (Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто")
			   Или Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено")) Тогда
			   
			ЗаданиеОбъект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = Ложь;
			ЗаданиеОбъект.ЗавершеноЗакрытоВручную = Истина;
			Модифицированность = Истина;
			
		ИначеЕсли Не Задание.ЭтоЗаданиеИсполнителяПроектнойЗадачи И Задание.ЗавершеноЗакрытоВручную
			И (Выборка.Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено") 
			   И Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выполняется") 
				Или Выборка.Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто") 
					И Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выдано")) Тогда
			
			ЗаданиеОбъект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = Истина;
			ЗаданиеОбъект.ЗавершеноЗакрытоВручную = Ложь;
			Модифицированность = Истина;		
			
		КонецЕсли;
			
		Если Модифицированность Тогда
			Попытка
				ЗаданиеОбъект.Записать();
			Исключение				
				ЗаписьЖурналаРегистрации(
					"Данные.Изменение",
					УровеньЖурналаРегистрации.Ошибка,
					Справочники.упоЗадания.Метаданные(),
					ЗаданиеОбъект,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
//[+]} ИКТ №20758