#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьСписокПрофилей();
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Неопределено, Отказ, СтандартнаяОбработка); 		
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаНавигационнойСсылки(ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПерехода(ОбъектПерехода, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаПерехода(ЭтаФорма, ОбъектПерехода, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	упоОбработчикиСобытийКлиент.ФормаПриИзмененииПараметровЭкрана(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.СписокПользователей.ТекущиеДанные; 
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.Значение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДобавить(Команда)
	
	СписокИсключаемых = СписокПользователейСУжеЗаданнымиОграничениямиДоступа();	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СкрываемыеПользователи", СписокИсключаемых);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокПользователей);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	СписокИсключаемых = СписокПользователейСУжеЗаданнымиОграничениямиДоступа();	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СкрываемыеПользователи", СписокИсключаемых);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокПользователей);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПользователейВГруппах = ПользователиНаходятсяВСоставеГрупп(СписокПользователей);
	
	Если МассивПользователейВГруппах.Количество() Тогда
		
		СоставВопроса = Новый Массив;
		
		
		СоставВопроса.Добавить(НСтр("ru = 'Пользователи уже участвуют в группах доступа:'"));
		СоставВопроса.Добавить(Символы.ПС);
		Для Каждого Пользователь Из МассивПользователейВГруппах Цикл			
			СоставВопроса.Добавить(Символы.ПС);
			СоставВопроса.Добавить(Строка(Пользователь));				
		КонецЦикла;
		СоставВопроса.Добавить(Символы.ПС);
		СоставВопроса.Добавить(Символы.ПС);
		СоставВопроса.Добавить(НСтр("ru = 'Продолжить?'"));
		
		ТекстВопроса = СтрСоединить(СоставВопроса);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	Иначе
		
		КомандаВыполнитьЗавершение(КодВозвратаДиалога.Да,  Неопределено);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КомандаВыполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВыполнитьНаСервере() Тогда
		Оповестить("Запись_упоОграниченияДоступаПоПроектам");
		Закрыть();
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Функция ОбновитьСписокПрофилей() 
	
	Элементы.Профиль.СписокВыбора.Очистить();
	
	ТаблицаПрофилей = ПолучитьПрофилиСОграничениямиПоПроектам();
	Для Каждого СтрокаПрофиля Из ТаблицаПрофилей Цикл
		Элементы.Профиль.СписокВыбора.Добавить(СтрокаПрофиля.Профиль,
					?(СтрокаПрофиля.Предопределенный, "", "*") 
					+ СтрокаПрофиля.Наименование);	
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПрофилиСОграничениямиПоПроектам() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	ВидДоступаПроекты = упоОграниченияДоступаПоПроектам.ПолучитьВидДоступаПроекты();
	Запрос.УстановитьПараметр("ВидДоступа", ВидДоступаПроекты);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПрофилиГруппДоступаВидыДоступа.Ссылка КАК Профиль,
	               |	ПрофилиГруппДоступаВидыДоступа.Ссылка.Наименование КАК Наименование,
	               |	ПрофилиГруппДоступаВидыДоступа.Ссылка.Предопределенный КАК Предопределенный
	               |ИЗ
	               |	Справочник.ПрофилиГруппДоступа.ВидыДоступа КАК ПрофилиГруппДоступаВидыДоступа
	               |ГДЕ
	               |	ПрофилиГруппДоступаВидыДоступа.ВидДоступа = &ВидДоступа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПрофилиГруппДоступаВидыДоступа.Ссылка.Предопределенный Убыв,
	               |	ПрофилиГруппДоступаВидыДоступа.Ссылка.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПользователиНаходятсяВСоставеГрупп(СписокПользователей) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокПользователей", СписокПользователей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыПользователейСостав.Ссылка КАК ГруппаПользователей,
	               |	ГруппыПользователейСостав.Пользователь
	               |ПОМЕСТИТЬ ГруппыПользователей
	               |ИЗ
	               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |ГДЕ
	               |	ГруппыПользователейСостав.Пользователь В(&СписокПользователей)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыДоступаПользователи.Пользователь,
	               |	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа,
	               |	ЛОЖЬ КАК ИзГруппыПользователей,
	               |	ГруппыДоступаПользователи.Пользователь.Наименование КАК ПользовательНаименование
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |ГДЕ
	               |	ГруппыДоступаПользователи.Пользователь В(&СписокПользователей)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ГруппыПользователей.Пользователь,
	               |	ГруппыДоступаПользователи.Ссылка,
	               |	ИСТИНА,
	               |	ГруппыДоступаПользователи.Пользователь.Наименование
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыПользователей КАК ГруппыПользователей
	               |		ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователей.ГруппаПользователей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПользовательНаименование";
	
	МассивПользователейВГруппах = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	МассивПользователейВГруппах = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПользователейВГруппах);	
	
	Возврат МассивПользователейВГруппах;
	
КонецФункции

&НаСервере
Функция ВыполнитьНаСервере() 
	
	Успех = Истина;
	
	ПапкаГрупп = Константы.упоПапкаГруппДоступаАвтоматическихОграниченийПоПроектам.Получить();
	
	МассивПользователей = СписокПользователей.ВыгрузитьЗначения();
	МассивПользователей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПользователей);
	
	ВидДоступаПроекты = упоОграниченияДоступаПоПроектам.ПолучитьВидДоступаПроекты();
		
	НачатьТранзакцию();
	
	Для Каждого Пользователь Из МассивПользователей Цикл
		
		обГруппаДоступа = Справочники.ГруппыДоступа.СоздатьЭлемент();
		обГруппаДоступа.Родитель = ПапкаГрупп;
		обГруппаДоступа.Наименование = Пользователь;
		обГруппаДоступа.Профиль = Профиль;
		
		обГруппаДоступа.Пользователи.Добавить().Пользователь = Пользователь;
		обГруппаДоступа.Пользователь = Пользователь;
		
		СтрокаВидовДоступа = обГруппаДоступа.ВидыДоступа.Добавить();
		СтрокаВидовДоступа.ВидДоступа = ВидДоступаПроекты;
		СтрокаВидовДоступа.ВсеРазрешены = Ложь;	
				
		Попытка
			обГруппаДоступа.Записать();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ограничения доступа по проектам'"), УровеньЖурналаРегистрации.Ошибка,, ТекстОшибки);
			ТекстСообщения = НСтр("ru = 'При записи группы доступа произошла ошибка. Подробности в журнале регистрации.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Успех = Ложь;
			Прервать;
		КонецПопытки;	
		
		обОграничениеДоступа = Справочники.упоОграниченияДоступаПоПроектам.СоздатьЭлемент();
		обОграничениеДоступа.Пользователь = Пользователь; 
		обОграничениеДоступа.ГруппаДоступа = обГруппаДоступа.Ссылка;
		
		Попытка
			обОграничениеДоступа.Записать();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ограничения доступа по проектам'"), УровеньЖурналаРегистрации.Ошибка,, ТекстОшибки);
			ТекстСообщения = НСтр("ru = 'При записи ограничения доступа произошла ошибка. Подробности в журнале регистрации.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Успех = Ложь;
			Прервать;
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не Успех Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокПользователейСУжеЗаданнымиОграничениямиДоступа() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоОграниченияДоступаПоПроектам.Пользователь
	               |ИЗ
	               |	Справочник.упоОграниченияДоступаПоПроектам КАК упоОграниченияДоступаПоПроектам
	               |ГДЕ
	               |	НЕ упоОграниченияДоступаПоПроектам.ПометкаУдаления";
	МассивПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	СписокПользователей = Новый СписокЗначений;
	СписокПользователей.ЗагрузитьЗначения(МассивПользователей);
	
	Возврат СписокПользователей;
	
КонецФункции

#КонецОбласти
