
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ТипДействия = "ВариантОтчета";
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ПустаяСтрока(ТипДействия) Тогда
			ТипДействия = "ВариантОтчета";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.ПометкаУдаления = ПометкаУдаления 
		И Не (ДополнительныеСвойства.Свойство("РазрешитьЗапись") И ДополнительныеСвойства.РазрешитьЗапись) Тогда
		ТекстСообщение = НСтр("ru = 'Редактирование объекта запрещено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщение,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если ТипДействия = "ПроизвольныйКод" И НЕ Справочники.упоИзбранныеДействия.ДоступенТипДействияПроизвольныйКод() Тогда
		ТекстСообщение = НСтр("ru = 'Недостаточно прав для редактирования текущего типа действия'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщение,,,, Отказ);
		Возврат; 	
	КонецЕсли;			
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПользователиКлиентСервер.АвторизованныйПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Автор = Неопределено;
	
	Если ТипДействия = "ПроизвольныйКод" И НЕ Справочники.упоИзбранныеДействия.ДоступенТипДействияПроизвольныйКод() Тогда
		ТекстСообщение = НСтр("ru = 'Недостаточно прав для копирования элемента с типом действия ""Произвольный код"".
		|Тип действия изменен на ""Открыть вариант отчета""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщение);
		ТипДействия = "ВариантОтчета"; 	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли