#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РезультатЗапроса = ДанныеДляПроведения();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Движения.ИКТ_ДопускиКРаботе.Записывать = Истина;
		Движения.ИКТ_ДопускиКРаботеПоВидам.Записывать = Истина;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Движения.ИКТ_ДопускиКРаботе.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		
		НоваяЗапись = Движения.ИКТ_ДопускиКРаботеПоВидам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ДопускКРаботеСотрудники.Ссылка.Организация КАК Организация,
	|	ИКТ_ДопускКРаботеСотрудники.Ссылка.ДействуетС КАК Период,
	|	ИКТ_ДопускКРаботеСотрудники.Сотрудник КАК Сотрудник,
	|	ИКТ_ДопускКРаботеСотрудники.Удостоверение КАК Удостоверение,
	|	ИКТ_ДопускКРаботеСотрудники.ГруппаДопуска КАК ГруппаДопуска,
	|	ИКТ_ДопускКРаботеСотрудники.Удостоверение.ВидУдостоверения КАК ВидУдостоверения,
	|	ИКТ_ДопускКРаботеСотрудники.СрокДействия КАК СрокДействия
	|ИЗ
	|	Документ.ИКТ_ДопускКРаботе.Сотрудники КАК ИКТ_ДопускКРаботеСотрудники
	|ГДЕ
	|	ИКТ_ДопускКРаботеСотрудники.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		
		новстр = Сотрудники.Добавить();
		новстр.Сотрудник = ДанныеЗаполнения.Сотрудник;
		
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
