////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с ДДС.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. упоИнтеграцияEPMСервер.ОтразитьФактическиеДвиженияДенежныхСредств
//
Процедура ОтразитьФактическиеДвиженияДенежныхСредств(ДополнительныеСвойства, Движения, Отказ) Экспорт

	упоИнтеграцияEPMСервер.ОтразитьФактическиеДвиженияДенежныхСредств(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры

#Область ЗаполнениеДДСпоДаннымБДР

// Устарела. Не используется. Формирует таблицу с параметрами схем оплат для использования в приоритетах Контрагент-Договор-Схема
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача	 - проектная задача.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица схем оплат.
//
Функция ТаблицаСхемОплатДДСпоРегиструБДР(ПроектнаяЗадача) Экспорт	
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");		
	СхемыПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Проект, "упоСхемаОплатыПоУмолчаниюДоходы, упоСхемаОплатыПоУмолчаниюРасходы");		
	СхемыЗадачи = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектнойЗадачи(ПроектнаяЗадача, "СхемаОплатыПоУмолчаниюДоходы, СхемаОплатыПоУмолчаниюРасходы");	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);	
	Запрос.УстановитьПараметр("ПустаяСхема", Справочники.упоСхемыОплаты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидЭлементаРасход", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход);	
	Запрос.УстановитьПараметр("СхемаЗадачиРасход", СхемыЗадачи.СхемаОплатыПоУмолчаниюРасходы);
	Запрос.УстановитьПараметр("СхемаПроектаРасход", СхемыПроекта.упоСхемаОплатыПоУмолчаниюРасходы);	
	Запрос.УстановитьПараметр("СхемаРасход", Константы.упоСхемаОплатыПоУмолчаниюРасходы.Получить());	
	Запрос.УстановитьПараметр("СхемаЗадачиДоход", СхемыЗадачи.СхемаОплатыПоУмолчаниюДоходы);
	Запрос.УстановитьПараметр("СхемаПроектаДоход", СхемыПроекта.упоСхемаОплатыПоУмолчаниюДоходы);
	Запрос.УстановитьПараметр("СхемаДоход", Константы.упоСхемаОплатыПоУмолчаниюДоходы.Получить());	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоВерсииПроекта.Версия КАК Версия
	|ПОМЕСТИТЬ втТекущаяВерсия
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	|		ПО упоВерсииПроекта.Проект = упоПроектнаяЗадача.Проект
	|			И (упоПроектнаяЗадача.Ссылка = &ПроектнаяЗадача)
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоходыРасходы.Контрагент КАК Контрагент,
	|	ДоходыРасходы.Договор КАК Договор,
	|	ДоходыРасходы.Статья КАК Статья,
	|	ДоходыРасходы.СуммаВалютная КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДоходыРасходы.ВидЭлемента = &ВидЭлементаРасход
	|			ТОГДА ВЫБОР
	|					КОГДА &СхемаЗадачиРасход = &ПустаяСхема
	|						ТОГДА ВЫБОР
	|								КОГДА &СхемаПроектаРасход = &ПустаяСхема
	|									ТОГДА &СхемаРасход
	|								ИНАЧЕ &СхемаПроектаРасход
	|							КОНЕЦ
	|					ИНАЧЕ &СхемаЗадачиРасход
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &СхемаЗадачиДоход = &ПустаяСхема
	|					ТОГДА ВЫБОР
	|							КОГДА &СхемаПроектаДоход = &ПустаяСхема
	|								ТОГДА &СхемаДоход
	|							ИНАЧЕ &СхемаПроектаДоход
	|						КОНЕЦ
	|				ИНАЧЕ &СхемаЗадачиДоход
	|			КОНЕЦ
	|	КОНЕЦ КАК СхемаПоУмолчанию
	|ПОМЕСТИТЬ ВТИсходная
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	|			,
	|			Версия В
	|					(ВЫБРАТЬ
	|						втТекущаяВерсия.Версия КАК Версия
	|					ИЗ
	|						втТекущаяВерсия КАК втТекущаяВерсия)
	|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК ДоходыРасходы
	|ГДЕ
	|	ДоходыРасходы.СуммаВалютная <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТИсходная.Договор КАК Договор,
	|	ВТИсходная.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТИсходная.Договор.упоСхемаОплаты, &ПустаяСхема) = &ПустаяСхема
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТИсходная.Контрагент.упоСхемаОплаты, &ПустаяСхема) = &ПустаяСхема
	|						ТОГДА ВЫБОР
	|								КОГДА ЕСТЬNULL(ВТИсходная.Статья.упоСхемаОплаты, &ПустаяСхема) = &ПустаяСхема
	|									ТОГДА ВТИсходная.СхемаПоУмолчанию
	|								ИНАЧЕ ВТИсходная.Статья.упоСхемаОплаты
	|							КОНЕЦ
	|					ИНАЧЕ ВТИсходная.Контрагент.упоСхемаОплаты
	|				КОНЕЦ
	|		ИНАЧЕ ВТИсходная.Договор.упоСхемаОплаты
	|	КОНЕЦ КАК СхемаОплаты,
	|	ВТИсходная.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ДанныеБДР
	|ИЗ
	|	ВТИсходная КАК ВТИсходная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеБДР.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА СУММА(ДанныеБДР.Сумма) < 0
	|			ТОГДА СУММА(ДанныеБДР.Сумма) * -1
	|		ИНАЧЕ СУММА(ДанныеБДР.Сумма)
	|	КОНЕЦ КАК Сумма,
	|	ДанныеБДР.СхемаОплаты КАК СхемаОплаты,
	|	ДанныеБДР.Контрагент КАК Контрагент
	|ИЗ
	|	ДанныеБДР КАК ДанныеБДР
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеБДР.Договор,
	|	ДанныеБДР.СхемаОплаты,
	|	ДанныеБДР.Контрагент";				   
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

// Заполняет план ДДС данными плана доходов и расходов. Используется для отображения данных на форме ПЗ
//  при включении опции ВключитьПланРасходовВБДДС или ВключитьПланДоходовВБДДС,
//  а также при отложенном проведении трудозатрат при включенной опции ПЗ ВключитьТрудРесурсыВПланРасходов.
//
// Параметры:
//  ДанныеПланаДДС		 - ДанныеФормыКоллекция, ТаблицаЗначений - таблица ДДС - приемник данных трансляции.
//  ТаблицаДвиженийБДР	 - ТаблицаЗначений	 - таблица БДР - источник данных трансляции.
//  ПараметрыРасчетаДДС	 - Структура		 - настройки расчета,
//  	см. упоДвиженияДенежныхСредствКлиентСервер.ПараметрыРасчетаДДСПоБДР.
//  ОтборСтрокБДР		 - Структура		 - отбор строк для таблицы - источника БДР.
//
Процедура ДополнитьДанныеПланаДДСДаннымиПланаБДР(ДанныеПланаДДС, ТаблицаДвиженийБДР, ПараметрыРасчетаДДС, 
	ОтборСтрокБДР = Неопределено) Экспорт
	
	ТаблицаДДС = ТаблицаСхемОплатДДСПоТаблицеБДР(ТаблицаДвиженийБДР, ПараметрыРасчетаДДС, ОтборСтрокБДР);
	
	Если ПараметрыРасчетаДДС.ЭтоОтражениеТрудозатрат Тогда
		ТаблицаДДС.ЗаполнитьЗначения(Перечисления.упоИсточникПланаДДС.Трудозатраты, "ИсточникПлана");
	КонецЕсли;
	
	Для Каждого СтрокаПлана Из ТаблицаДДС Цикл
		ЗаполнитьЗначенияСвойств(ДанныеПланаДДС.Добавить(), СтрокаПлана);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет БДДС данными плана ДДС.
//
// Параметры:
//  ТаблицаДвиженийБДДС	 - НаборЗаписей - распределенные данные планов ДДС с данными.
//  ДанныеПланаДДС		 - ТаблицаЗначений	 - нераспределенные данные планов ДДС с профилями.
//  ТаблицаЗадач		 - ТаблицаЗначений	 - задачи документа
//  ДанныеДокумента		 - Структура		 - слепок документа.
//  ЭтоПроектнаяЗадача	 - Булево			 - признак заполнения таблицы для документа "Проектная задача".
//
Процедура ЗаполнитьТаблицуБДДСПоДаннымПланаДДС(ТаблицаДвиженийБДДС, ДанныеПланаДДС, ТаблицаЗадач, ДанныеДокумента, ЭтоПроектнаяЗадача) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеПланаДДС) Тогда
		Возврат;
	КонецЕсли;
	
	естьВалютнаяСумма = НЕ (ДанныеПланаДДС.Колонки.Найти("СуммаВалютная") = Неопределено);
	
	АктуальныеСроки = упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроектаСУчетомТекущихДанных(
							ДанныеДокумента.Проект,
							ТаблицаЗадач);														
		
	Для каждого СтрокаДанных Из ДанныеПланаДДС Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.ИсточникПлана) Тогда
			СтрокаДанных.ИсточникПлана = Перечисления.упоИсточникПланаДДС.ДДС;	
		КонецЕсли;	
		
		Если СтрокаДанных.СпособПривязки = Перечисления.упоСпособПривязкиДДС.ПоПрофилюРаспределения Тогда
			
			Если ТипЗнч(ТаблицаЗадач) = Тип("ТаблицаЗначений") Тогда
				Если НЕ ЭтоПроектнаяЗадача Тогда      
					СтрокаЗадача = ТаблицаЗадач.Найти(СтрокаДанных.ПроектнаяЗадача, "Задача");
				Иначе
					СтрокаЗадача = ТаблицаЗадач.Найти(ДанныеДокумента.Ссылка, "Задача");	
				КонецЕсли; 
				
				Если СтрокаЗадача = Неопределено Тогда      
					Продолжить;
				КонецЕсли; 
				
				ДатаНачала = СтрокаЗадача.ДатаНачала;
				ДатаЗавершения = СтрокаЗадача.ДатаЗавершения; 			

			Иначе
				Если НЕ ЭтоПроектнаяЗадача Тогда      
					СтрокаЗадача = ТаблицаЗадач[СтрокаДанных.ПроектнаяЗадача];
				Иначе
					СтрокаЗадача = ТаблицаЗадач[ДанныеДокумента.Ссылка];	
				КонецЕсли; 
				
				Если СтрокаЗадача = Неопределено Тогда      
					Продолжить;
				КонецЕсли; 				
				
				ДатаНачала = СтрокаЗадача.Результат.ДатаНачала;
				ДатаЗавершения = СтрокаЗадача.Результат.ДатаЗавершения;

			КонецЕсли;	
				 
			ТаблицаРаспределение = упоДоходыИРасходыСервер.РаспределитьДоходыИРасходыПоПрофилю(СтрокаДанных.ПрофильРаспределения,
				ДатаНачала, ДатаЗавершения, ?(естьВалютнаяСумма, СтрокаДанных.СуммаВалютная, СтрокаДанных.Сумма));	 
				
			Для каждого СтрокаРаспределение Из ТаблицаРаспределение Цикл        
			
				Движение = ТаблицаДвиженийБДДС.Добавить();
				
				Движение.ДатаДвижения 			= СтрокаРаспределение.Период;
				Движение.НаправлениеДвижения 	= СтрокаДанных.НаправлениеДвижения;
				Движение.ИсточникПлана  		= СтрокаДанных.ИсточникПлана;
				Движение.ВидПлатежа  			= СтрокаДанных.ВидПлатежа;
				
				Если НЕ ЭтоПроектнаяЗадача Тогда      
					Движение.ПроектнаяЗадача = СтрокаДанных.ПроектнаяЗадача;
				Иначе
					Движение.ПроектнаяЗадача = ДанныеДокумента.ПроектнаяЗадача;
				КонецЕсли; 
				
				Движение.СтатьяДДС				= СтрокаДанных.СтатьяДДС;
				Движение.СуммаВалютная 			= СтрокаРаспределение.Сумма;
				Движение.Контрагент 			= СтрокаДанных.Контрагент;
				Движение.Договор 				= СтрокаДанных.Договор;
				Движение.Валюта 				= СтрокаДанных.Валюта;
				Движение.Период 				= ДанныеДокумента.Дата;
				
			КонецЦикла;	  				
			
		Иначе
			
			Движение = ТаблицаДвиженийБДДС.Добавить();
			
			Движение.ДатаДвижения 			= СтрокаДанных.ДатаПривязки;
			Движение.Договор	 			= СтрокаДанных.Договор;
			Движение.Контрагент 			= СтрокаДанных.Контрагент;
			Движение.НаправлениеДвижения 	= СтрокаДанных.НаправлениеДвижения;
			Движение.ВидПлатежа  			= СтрокаДанных.ВидПлатежа;
			Движение.Период 				= ДанныеДокумента.Дата;
			
			Если НЕ ЭтоПроектнаяЗадача Тогда      
				Движение.ПроектнаяЗадача 	= СтрокаДанных.ПроектнаяЗадача;
			Иначе
				Движение.ПроектнаяЗадача 	= ДанныеДокумента.Ссылка;
			КонецЕсли; 		
			
			Движение.ИсточникПлана  		= СтрокаДанных.ИсточникПлана;
			Движение.СтатьяДДС 				= СтрокаДанных.СтатьяДДС;
			Движение.Валюта 				= СтрокаДанных.Валюта;
			
			Если естьВалютнаяСумма Тогда
				Движение.СуммаВалютная 		= СтрокаДанных.СуммаВалютная;
				Движение.Сумма 				= СтрокаДанных.Сумма;
			Иначе
				Движение.СуммаВалютная 		= СтрокаДанных.Сумма;
			КонецЕсли;
			
		КонецЕсли;	
			
	КонецЦикла; 
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженийБДДС, , Ложь);		
	
КонецПроцедуры

// Возвращает пусту таблицу-шаблона для заполнения плана ДДС.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - пустая таблица ДДС.
//
Функция ШаблонПланаДДС() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("ПроектнаяЗадача");
	Таблица.Колонки.Добавить("СхемаОплаты");
	Таблица.Колонки.Добавить("СтатьяДДС");
	Таблица.Колонки.Добавить("Контрагент");
	Таблица.Колонки.Добавить("Договор");
	Таблица.Колонки.Добавить("НаправлениеДвижения");
	Таблица.Колонки.Добавить("ВидПлатежа");
	Таблица.Колонки.Добавить("СпособПривязки");
	Таблица.Колонки.Добавить("Задержка");
	Таблица.Колонки.Добавить("Сумма");
	Таблица.Колонки.Добавить("СуммаВалютная");
	Таблица.Колонки.Добавить("ДатаПривязки");
	Таблица.Колонки.Добавить("Валюта");
	Таблица.Колонки.Добавить("ПрофильРаспределения");
	Таблица.Колонки.Добавить("ИсточникПлана");
	
	Возврат Таблица;
	
КонецФункции

// Возвращает сроки проектных задач в формате для расчета привязок ДДС.
//
// Параметры:
//  Проект			 - СправочникСсылка.Проекты	 - проект проектных задач.
//  ПроектныеЗадачи	 - Массив Из ДокументСсылка.упоПроектнаяЗадача	 - проектные задачи проекта.
// 
// Возвращаемое значение:
//  Соответствие - структура сроков проектных задач.
//
Функция СрокиПроектныхЗадачДляРасчетаДДС(Проект, ПроектныеЗадачи) Экспорт
	
	СрокиПроектныхЗадач = упоПроектыИЗадачиСервер.СрокиПроектныхЗадач(ПроектныеЗадачи);
	СрокиПроекта = упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроектаСУчетомТекущихДанных(Проект, 
		СрокиПроектныхЗадач);
	
	СрокиДляРасчетаДДС = Новый Соответствие;
	Для Каждого КлючЗначение Из СрокиПроектныхЗадач Цикл
		
		СрокиЗадачи = КлючЗначение.Значение;
		
		СтруктураСроки = упоПроектыИЗадачиОбщие.СтруктураСроки(СрокиЗадачи.ДатаНачалаПлан, СрокиЗадачи.ДатаЗавершенияПлан);
		СтруктураСроки.Вставить("НачалоПланПроект", СрокиПроекта.ДатаНачалаПлан);
		СтруктураСроки.Вставить("ЗавершениеПланПроект", СрокиПроекта.ДатаЗавершенияПлан);
		
		СрокиДляРасчетаДДС.Вставить(КлючЗначение.Ключ, СтруктураСроки);
		
	КонецЦикла;
	
	Возврат СрокиДляРасчетаДДС;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Применяет схемы оплаты БДР для БДДС, транслирует таблицу БДР в БДДС.
//
// Параметры:
//  ТаблицаДвиженийБДР	 - ТаблицаЗначений	 - таблица БДР.
//  ПараметрыРасчетаДДС	 - Структура - см. упоДвиженияДенежныхСредствКлиентСервер.ПараметрыРасчетаДДСПоБДР.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица ДДС с примененными схемами оплат.
//
Функция ТаблицаСхемОплатДДСпоТаблицеБДР(ТаблицаДвиженийБДР,
			ПараметрыРасчетаДДС,
			ОтборСтрокБДРДляДДС = Неопределено)
	
	ТаблицаДДС = ШаблонПланаДДС();
	
	Если Не ЗначениеЗаполнено(ТаблицаДвиженийБДР) Тогда
		Возврат ТаблицаДДС;
	КонецЕсли;
	
	ПроектнаяЗадача = Неопределено;
	мВалютаУправленческогоУчета = Неопределено;
	СоответствиеСхемОплаты = Неопределено;
	СхемаОплатыПЗ_Доходы = Неопределено;
	СхемаОплатыПЗ_Расходы = Неопределено;
	Проект = Неопределено;
	ЭтоОбновлениеТрансляции = Неопределено;
	Календарь = Неопределено;
	
	ПараметрыРасчетаДДС.Свойство("ВалютаУпрУчета",         мВалютаУправленческогоУчета);
	ПараметрыРасчетаДДС.Свойство("ПроектнаяЗадача",        ПроектнаяЗадача);
	ПараметрыРасчетаДДС.Свойство("СоответствиеСхемОплаты", СоответствиеСхемОплаты);
	ПараметрыРасчетаДДС.Свойство("СхемаОплатыПЗ_Доходы",   СхемаОплатыПЗ_Доходы);
	ПараметрыРасчетаДДС.Свойство("СхемаОплатыПЗ_Расходы",  СхемаОплатыПЗ_Расходы);
	ПараметрыРасчетаДДС.Свойство("Проект",                 Проект);
	ПараметрыРасчетаДДС.Свойство("ЭтоОбновлениеТрансляции", ЭтоОбновлениеТрансляции);
	ПараметрыРасчетаДДС.Свойство("КалендарьЗадачи", 		Календарь);

	Если мВалютаУправленческогоУчета = Неопределено Тогда
		мВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	КонецЕсли;		
	
	КолонкиКопирования = "Контрагент, Договор, Статья, Сумма, СуммаВалютная, ВидЭлемента, Валюта";
	Если ПроектнаяЗадача = Неопределено Тогда
		КолонкиКопирования = КолонкиКопирования + ",ПроектнаяЗадача";
	КонецЕсли;
	
	ТаблицаБДРДляДДС = ТаблицаДвиженийБДР.Скопировать(ОтборСтрокБДРДляДДС, КолонкиКопирования);
	
	КолонкиСуммы = Новый Соответствие;
	КолонкиСуммы.Вставить("Сумма", Истина);
	КолонкиСуммы.Вставить("СуммаВалютная", Истина);
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаБДРДляДДС, КолонкиСуммы);
	
	// Порядок использования схем оплаты: договор, контрагент, статья, ПЗ, проект.
	МассивСхем = Новый Массив;
	
	//
	
	МассивКонтрагентов = Новый Массив;
	МассивДоговоров = Новый Массив;
	Для Каждого СтрокаБДР Из ТаблицаБДРДляДДС Цикл
		МассивКонтрагентов.Добавить(СтрокаБДР.Контрагент);
		МассивДоговоров.Добавить(СтрокаБДР.Договор);
	КонецЦикла;
	
	СхемыДоговоров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивДоговоров, "упоСхемаОплаты");
	Для Каждого СхемаДоговора Из СхемыДоговоров Цикл
		Если ЗначениеЗаполнено(СхемаДоговора.Значение) Тогда
			МассивСхем.Добавить(СхемаДоговора.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СхемыКонтрагентов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивКонтрагентов, "упоСхемаОплаты");
	Для Каждого СхемаКонтрагента Из СхемыКонтрагентов Цикл
		Если ЗначениеЗаполнено(СхемаКонтрагента.Значение) Тогда
			МассивСхем.Добавить(СхемаКонтрагента.Значение);
		КонецЕсли;
	КонецЦикла;
	
	//
	
	СхемыСтатей = Новый Соответствие;
	Запрос = Новый Запрос("ВЫБРАТЬ 
	                      |	упоСтатьиЗатрат.упоСхемаОплаты КАК упоСхемаОплаты,
	                      |	упоСтатьиЗатрат.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.упоСтатьиЗатрат КАК упоСтатьиЗатрат
	                      |ГДЕ
	                      |	упоСтатьиЗатрат.Ссылка В(&Ссылка)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	упоСтатьиДоходов.упоСхемаОплаты,
	                      |	упоСтатьиДоходов.Ссылка
	                      |ИЗ
	                      |	Справочник.упоСтатьиДоходов КАК упоСтатьиДоходов
	                      |ГДЕ
	                      |	упоСтатьиДоходов.Ссылка В(&Ссылка)");
	Запрос.УстановитьПараметр("Ссылка", ТаблицаБДРДляДДС.ВыгрузитьКолонку("Статья"));
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивСхем.Добавить(Выборка.упоСхемаОплаты);
			СхемыСтатей.Вставить(Выборка.Ссылка, Выборка.упоСхемаОплаты);
		КонецЦикла;
	КонецЕсли;
	
	СхемаОплатыПоУмолчаниюДоходы = Новый Соответствие;
	СхемаОплатыПоУмолчаниюРасходы = Новый Соответствие;
	ПроектныеЗадачи = Новый Массив;
	Если ПроектнаяЗадача = Неопределено Тогда
		ПроектныеЗадачи = ТаблицаБДРДляДДС.ВыгрузитьКолонку("ПроектнаяЗадача")
	Иначе
		ПроектныеЗадачи.Добавить(ПроектнаяЗадача);
	КонецЕсли;
	
	СхемыОплатыПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Проект, 
		"упоСхемаОплатыПоУмолчаниюДоходы, упоСхемаОплатыПоУмолчаниюРасходы");
	
	КонстантаДоходы = Константы.упоСхемаОплатыПоУмолчаниюДоходы.Получить();
	КонстантаРасходы = Константы.упоСхемаОплатыПоУмолчаниюРасходы.Получить();
	
	СхемыНаследования = Новый Структура;
	СхемыНаследования.Вставить("СхемаОплатыПроектаДоходы", СхемыОплатыПроекта.упоСхемаОплатыПоУмолчаниюДоходы);
	СхемыНаследования.Вставить("СхемаОплатыПроектаРасходы", СхемыОплатыПроекта.упоСхемаОплатыПоУмолчаниюРасходы);
	СхемыНаследования.Вставить("КонстантаСхемаОплатыДоходы", КонстантаДоходы);
	СхемыНаследования.Вставить("КонстантаСхемаОплатыРасходы", КонстантаРасходы); 

	Если ЗначениеЗаполнено(СоответствиеСхемОплаты) Тогда
		Для каждого ПЗ Из ПроектныеЗадачи Цикл
			СхемаОплатыДоход_ПЗ = СоответствиеСхемОплаты[ПЗ].СхемаОплатыПоУмолчаниюДоходы;
			СхемаОплатыРасход_ПЗ = СоответствиеСхемОплаты[ПЗ].СхемаОплатыПоУмолчаниюРасходы;
			
			ЗаполнитьСхемыДоходовРасходовЗадачи(ПЗ, СхемаОплатыПоУмолчаниюДоходы, СхемаОплатыПоУмолчаниюРасходы, МассивСхем,
				СхемаОплатыДоход_ПЗ, СхемаОплатыРасход_ПЗ, СхемыНаследования);
		КонецЦикла;
	Иначе
		ЗаполнитьСхемыДоходовРасходовЗадачи(ПроектнаяЗадача, СхемаОплатыПоУмолчаниюДоходы, СхемаОплатыПоУмолчаниюРасходы,
			МассивСхем, СхемаОплатыПЗ_Доходы, СхемаОплатыПЗ_Расходы, СхемыНаследования);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСхем", МассивСхем);
	Запрос.Текст = "ВЫБРАТЬ 
	               |	упоСхемыОплатыПараметрыРасчета.Ссылка КАК СхемаОплаты,
	               |	упоСхемыОплатыПараметрыРасчета.Статья КАК Статья,
	               |	упоСхемыОплатыПараметрыРасчета.ВидПлатежа КАК ВидПлатежа,
	               |	упоСхемыОплатыПараметрыРасчета.Доля КАК Доля,
	               |	упоСхемыОплатыПараметрыРасчета.Задержка КАК Задержка,
	               |	упоСхемыОплатыПараметрыРасчета.ВидПривязки КАК ВидПривязки,
	               |	упоСхемыОплатыПараметрыРасчета.ДатаПривязки КАК ДатаПривязки,
	               |	упоСхемыОплатыПараметрыРасчета.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	СтатьиДвиженияДенежныхСредств.упоНаправлениеДвижения КАК НаправлениеДвижения
	               |ИЗ
	               |	Справочник.упоСхемыОплаты.ПараметрыРасчета КАК упоСхемыОплатыПараметрыРасчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	               |		ПО упоСхемыОплатыПараметрыРасчета.Статья = СтатьиДвиженияДенежныхСредств.Ссылка
	               |ГДЕ
	               |	упоСхемыОплатыПараметрыРасчета.Ссылка В(&МассивСхем)";
	
	ТаблицаСхем = Запрос.Выполнить().Выгрузить();
	ТаблицаСхем.Индексы.Добавить("СхемаОплаты");
	
	СпособПривязкиДДСПоСпособуПривязкиСхемыОплаты = 
		упоДвиженияДенежныхСредствКлиентСервер.ПолучитьСоответствиеВидовПривязкиДДСИСхемыОплаты();
	ИсточникПланаПоВидуЭлемента = ИсточникПланаПоВидуЭлемента();
	
	Сроки = СрокиПроектныхЗадачДляРасчетаДДС(Проект, ПроектныеЗадачи);
	
	СтруктураСхемОплаты = Новый Структура;
	СтруктураСхемОплаты.Вставить("СхемыДоговоров", 			СхемыДоговоров);
	СтруктураСхемОплаты.Вставить("СхемыКонтрагентов", 		СхемыКонтрагентов);
	СтруктураСхемОплаты.Вставить("СхемыСтатей", 			СхемыСтатей);
	СтруктураСхемОплаты.Вставить("СоответствиеСхемОплаты", 	СоответствиеСхемОплаты);
	СтруктураСхемОплаты.Вставить("СхемыЗадачДоходы", 		СхемаОплатыПоУмолчаниюДоходы);
	СтруктураСхемОплаты.Вставить("СхемыЗадачРасходы", 		СхемаОплатыПоУмолчаниюРасходы);
		
	Если ЭтоОбновлениеТрансляции Тогда
		КалендариСхемОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСхем, "Календарь");
	КонецЕсли;
	
	Для Каждого СтрокаБДР Из ТаблицаБДРДляДДС Цикл
		
		// Если таблица по одной ПЗ, то в ней нет колонки ПроектнаяЗадача.
		ПЗ = ?(ПроектнаяЗадача = Неопределено, СтрокаБДР.ПроектнаяЗадача, ПроектнаяЗадача); 
		
		СхемаОплаты = СхемаОплатыПоПриоритетам(СтрокаБДР, СтруктураСхемОплаты, ПЗ);
		
		Если ЭтоОбновлениеТрансляции Тогда
			КалендарьСхемыОплаты = КалендариСхемОплаты[СхемаОплаты];
			Если ЗначениеЗаполнено(КалендарьСхемыОплаты) Тогда
				Календарь = КалендарьСхемыОплаты;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Календарь) Тогда
			Календарь = упоПроектыИЗадачиСервер.КалендарьПоИерархииОбъектовДДС(ПЗ, Проект);
        КонецЕсли;

		Отбор = Новый Структура("СхемаОплаты", СхемаОплаты);
		ПараметрыСхемы = ТаблицаСхем.НайтиСтроки(Отбор);
		Если Не ЗначениеЗаполнено(ПараметрыСхемы) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКоэффициентов = Новый Массив;
		Для Каждого ПараметрСхемы Из ПараметрыСхемы Цикл
			МассивКоэффициентов.Добавить(ПараметрСхемы.Доля);
		КонецЦикла;
		МассивСумм = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СтрокаБДР.СуммаВалютная, МассивКоэффициентов);
		
		КоличествоСтрок = ПараметрыСхемы.Количество();
		
		Для Индекс = 0 По КоличествоСтрок - 1 Цикл
			
			СтрокаДДС = ТаблицаДДС.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаДДС, СтрокаБДР);
			
			ПараметрСхемы = ПараметрыСхемы[Индекс];
			
			Если ТипЗнч(ПараметрСхемы.Статья) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда
				СтрокаДДС.НаправлениеДвижения = ПараметрСхемы.НаправлениеДвижения;
			КонецЕсли;
			СтрокаДДС.СхемаОплаты = ПараметрСхемы.СхемаОплаты;
			СтрокаДДС.Контрагент = СтрокаБДР.Контрагент;
			СтрокаДДС.Договор = СтрокаБДР.Договор;
			СтрокаДДС.СтатьяДДС = ПараметрСхемы.Статья;
			СтрокаДДС.СпособПривязки = СпособПривязкиДДСПоСпособуПривязкиСхемыОплаты[ПараметрСхемы.ВидПривязки];
			СтрокаДДС.ДатаПривязки = ПараметрСхемы.ДатаПривязки;
			СтрокаДДС.Задержка = ПараметрСхемы.Задержка;
			СтрокаДДС.ВидПлатежа = ПараметрСхемы.ВидПлатежа;
			СтрокаДДС.ПрофильРаспределения = ПараметрСхемы.ПрофильРаспределения;
			СтрокаДДС.Валюта = СтрокаБДР.Валюта;
			Если МассивСумм <> Неопределено Тогда
				СтрокаДДС.Сумма = МассивСумм[Индекс];
				// СуммаВалютная используется при проведении; Сумма используется для показа в форме ПЗ.
				СтрокаДДС.СуммаВалютная = СтрокаДДС.Сумма;
			КонецЕсли;
			СтрокаДДС.ИсточникПлана = ИсточникПланаПоВидуЭлемента[СтрокаБДР.ВидЭлемента];
			
			Если Не ЗначениеЗаполнено(СтрокаДДС.ДатаПривязки) Тогда
				СрокиЗадачи = Сроки.Получить(ПЗ);
				упоПроектыИЗадачиОбщие.ОбновитьДатуПривязкиВСтроке(СрокиЗадачи, Календарь, СтрокаДДС);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДДС, КолонкиСуммы);
	
	Возврат ТаблицаДДС;
	
КонецФункции

Функция СхемаОплатыПоПриоритетам(СтрокаБДР, СтруктураСхемОплаты, ПроектнаяЗадача)
	
	СхемыДоговоров 			= СтруктураСхемОплаты.СхемыДоговоров;
	СхемыКонтрагентов 		= СтруктураСхемОплаты.СхемыКонтрагентов;
	СхемыСтатей 			= СтруктураСхемОплаты.СхемыСтатей;
	СоответствиеСхемОплаты 	= СтруктураСхемОплаты.СоответствиеСхемОплаты;
	СхемыЗадачДоходы 		= СтруктураСхемОплаты.СхемыЗадачДоходы;
	СхемыЗадачРасходы 		= СтруктураСхемОплаты.СхемыЗадачРасходы;
	
	СхемаОплаты = Справочники.упоСхемыОплаты.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(СтрокаБДР.Договор) И ЗначениеЗаполнено(СхемыДоговоров[СтрокаБДР.Договор]) Тогда
		СхемаОплаты = СхемыДоговоров[СтрокаБДР.Договор];
	ИначеЕсли ЗначениеЗаполнено(СтрокаБДР.Контрагент) И ЗначениеЗаполнено(СхемыКонтрагентов[СтрокаБДР.Контрагент]) Тогда
		СхемаОплаты = СхемыКонтрагентов[СтрокаБДР.Контрагент];
	ИначеЕсли ЗначениеЗаполнено(СтрокаБДР.Статья) И ЗначениеЗаполнено(СхемыСтатей[СтрокаБДР.Статья]) Тогда
		СхемаОплаты = СхемыСтатей[СтрокаБДР.Статья];
	Иначе 
		Если ПроектнаяЗадача <> Неопределено Тогда
			Если СтрокаБДР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
				СхемаОплаты = СхемыЗадачДоходы[ПроектнаяЗадача];
			Иначе
				СхемаОплаты = СхемыЗадачРасходы[ПроектнаяЗадача];
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СоответствиеСхемОплаты) Тогда 
			Если СтрокаБДР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
				СхемаОплатыПЗ = СоответствиеСхемОплаты[СтрокаБДР.ПроектнаяЗадача].СхемаОплатыПоУмолчаниюДоходы;
				СхемаОплаты = ?(ЗначениеЗаполнено(СхемаОплатыПЗ), СхемаОплатыПЗ, СхемыЗадачДоходы[СтрокаБДР.ПроектнаяЗадача]);
			Иначе
				СхемаОплатыПЗ = СоответствиеСхемОплаты[СтрокаБДР.ПроектнаяЗадача].СхемаОплатыПоУмолчаниюРасходы;
				СхемаОплаты = ?(ЗначениеЗаполнено(СхемаОплатыПЗ), СхемаОплатыПЗ, СхемыЗадачРасходы[СтрокаБДР.ПроектнаяЗадача]);
			КонецЕсли;
		Иначе
			Если СтрокаБДР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
				СхемаОплаты = СхемыЗадачДоходы[СтрокаБДР.ПроектнаяЗадача];
			Иначе
				СхемаОплаты = СхемыЗадачРасходы[СтрокаБДР.ПроектнаяЗадача];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СхемаОплаты;
	
КонецФункции

Процедура ЗаполнитьСхемыДоходовРасходовЗадачи(ПроектнаяЗадача, СхемыЗадачДоходы, СхемыЗадачРасходы, МассивСхем,
	СхемаОплатыДоход_ПЗ, СхемаОплатыРасход_ПЗ, СхемыНаследования); 
			
	Если СхемыЗадачДоходы[ПроектнаяЗадача] = Неопределено Тогда
		
		ЗаполнитьСхемыЗадач(ПроектнаяЗадача, СхемаОплатыДоход_ПЗ, СхемыНаследования.СхемаОплатыПроектаДоходы,
			СхемыНаследования.КонстантаСхемаОплатыДоходы, СхемыЗадачДоходы, МассивСхем);
			
	КонецЕсли;	 
	                                                                                          
	Если СхемыЗадачРасходы[ПроектнаяЗадача] = Неопределено Тогда
		
		ЗаполнитьСхемыЗадач(ПроектнаяЗадача, СхемаОплатыРасход_ПЗ, СхемыНаследования.СхемаОплатыПроектаРасходы,
			СхемыНаследования.КонстантаСхемаОплатыРасходы, СхемыЗадачРасходы, МассивСхем);

	КонецЕсли;	
	
КонецПроцедуры   

Процедура ЗаполнитьСхемыЗадач(ПроектнаяЗадача, СхемаОплатыПЗ, СхемаОплатыПроекта, КонстантаСхемаОплаты, 
	СхемыЗадач, МассивСхем) 
	
	Если ЗначениеЗаполнено(СхемаОплатыПЗ) Тогда
		СхемаОплаты = СхемаОплатыПЗ;
	ИначеЕсли ЗначениеЗаполнено(СхемаОплатыПроекта) Тогда
		СхемаОплаты = СхемаОплатыПроекта 
	Иначе
		СхемаОплаты = КонстантаСхемаОплаты; 
	КонецЕсли;
	
	СхемыЗадач.Вставить(ПроектнаяЗадача, СхемаОплаты);
	МассивСхем.Добавить(СхемаОплаты);

КонецПроцедуры

Функция ИсточникПланаПоВидуЭлемента()
	
	ИсточникПланаПоВидуЭлемента = Новый Соответствие;
	ИсточникПланаПоВидуЭлемента.Вставить(Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход, 
		Перечисления.упоИсточникПланаДДС.Доходы);
	ИсточникПланаПоВидуЭлемента.Вставить(Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход, 
		Перечисления.упоИсточникПланаДДС.Расходы);
	
	Возврат ИсточникПланаПоВидуЭлемента;
	
КонецФункции

#КонецОбласти
