////////////////////////////////////////////////////////////////////////////////
// Распределение трудозатрат по профилям и перерасчеты трудозатрат.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. упоРаспределениеТрудозатратВызовСервера.ПолучитьТаблицыРаспределенияТрудозатрат
//
Функция ПолучитьТаблицыРаспределенияТрудозатрат(ВхДанные) Экспорт
	
	Возврат упоРаспределениеТрудозатратВызовСервера.ПолучитьТаблицыРаспределенияТрудозатрат(ВхДанные);
	
КонецФункции

#КонецОбласти
