
&Перед("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
//{[+] ИКТ №17638 (фрагмент ДОБАВЛЕН), Селиверстов Д.Н., 07.04.2026 16:40
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И не ЭтотОбъект.ДополнительныеСвойства.Свойство("БезПроверкиВЧеромСеромСписках")
		И ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
		ЧерныйСписок = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
		|ИЗ
		|	РегистрСведений.ИКТ_НедобросовестныеКонтрагенты КАК ИКТ_НедобросовестныеКонтрагенты
		|ГДЕ
		|	(ИКТ_НедобросовестныеКонтрагенты.Контрагент = &Контрагент
		|			ИЛИ ИКТ_НедобросовестныеКонтрагенты.ИНН = &ИНН)
		|	И ИКТ_НедобросовестныеКонтрагенты.Список = &Черный";	
		Запрос.УстановитьПараметр("ИНН", ЭтотОбъект.Контрагент.ИНН);
		Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
		Запрос.УстановитьПараметр("Черный", Перечисления.ИКТ_ВариантыСписковКонтрагентов.Черный);	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 0 Тогда	
			ОбщегоНазначения.СообщитьПользователю("Контрагент находится в черном списке. Работа с ним запрещена ДБ (СЭБ)");
			Отказ = Истина;
			ЧерныйСписок = Истина;
		ИначеЕсли Ложь Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
			|ИЗ
			|	РегистрСведений.ИКТ_НедобросовестныеКонтрагенты КАК ИКТ_НедобросовестныеКонтрагенты
			|ГДЕ
			|	ИКТ_НедобросовестныеКонтрагенты.Список = &Черный
			|	И ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента ПОДОБНО &НаименованиеКонтрагента";		
			Запрос.УстановитьПараметр("НаименованиеКонтрагента", ИКТ_ДополнительныеНастройкиСистемы.ИКТ_НаименованиеКонтрагента(ЭтотОбъект.Контрагент));
			Запрос.УстановитьПараметр("Черный", Перечисления.ИКТ_ВариантыСписковКонтрагентов.Черный);
			Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда
				ЧерныйСписок = Истина;
				ОбщегоНазначения.СообщитьПользователю("Контрагент возможно находится в черном списке. Работа с ним запрещена ДБ (СЭБ).");
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЧерныйСписок Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
			|ИЗ
			|	РегистрСведений.ИКТ_НедобросовестныеКонтрагенты КАК ИКТ_НедобросовестныеКонтрагенты
			|ГДЕ
			|	(ИКТ_НедобросовестныеКонтрагенты.Контрагент = &Контрагент
			|			ИЛИ ИКТ_НедобросовестныеКонтрагенты.ИНН = &ИНН)
			|	И ИКТ_НедобросовестныеКонтрагенты.Список = &Серый";	
			Запрос.УстановитьПараметр("ИНН", ЭтотОбъект.Контрагент.ИНН);
			Запрос.УстановитьПараметр("Серый", Перечисления.ИКТ_ВариантыСписковКонтрагентов.Серый);
			Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
			РезультатЗапроса = Запрос.Выполнить();	
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
			Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда	
				ОбщегоНазначения.СообщитьПользователю("Контрагент находится в сером списке ДБ (СЭБ). Работа с ним разрешена только по постоплате.");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
//[+]} ИКТ №17638
	
КонецПроцедуры
