
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияЗарплатыПоПроектам() Тогда
		упоФункцииОбщегоНазначенияКлиентСервер.Исключение_ЭтоОбъектДругойКонфигурации();
	КонецЕсли;
	
	ПрочитатьЗначенияНастроек();
	ЗагрузитьЗначениеНастроекНаФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяПарам = "ИспользоватьСоответствиеНачислений";
	Элементы[ИмяПарам].Видимость = Ложь;
	Если ЭтаФорма[ИмяПарам] Тогда
		ОбновитьЗначениеНастройки(ИмяПарам, Ложь);
		УстановитьВидимостьСпискаСоответствийНачислений();
	КонецЕсли;
	
	УстановитьВидимостьГруппыВзносы();
	УстановитьВидимостьСпискаСоответствийНачислений();
	УстановитьВидимостьСпискаСоответствияВидовНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НРег(ИмяСобытия) = НРег("Обновлено соответствие начислений РМ") Тогда
		ИмяСписка = ?(НЕ УчетВоВнешнейСистеме, "СоответствиеВидовНачисленийERP_PM", "СоответствиеВидовНачисленийЗУП_PM");
		Элементы[ИмяСписка].Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если РежимУчетаВзносов = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("СтатьяРасходовВзносов");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьСпособыОтраженияПроектныхЗадач(Команда)
	ОткрытьФорму("Обработка.упоСозданиеСпособовОтраженияПроектныхЗадач.Форма.Форма");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ИспользоватьПодсистемуПриИзменении(Элемент)
	ОбновитьЗначениеНастройки(Элемент.Имя, ИспользоватьПодсистему);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСоответствиеНачисленийПриИзменении(Элемент)
	ОбновитьЗначениеНастройки(Элемент.Имя, ИспользоватьСоответствиеНачислений);
	УстановитьВидимостьСпискаСоответствийНачислений();
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьНеактируемыеТрудозатратыПриИзменении(Элемент)
	ОбновитьЗначениеНастройки(Элемент.Имя, ОтражатьНеактируемыеТрудозатраты);
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовРаспределенияПриИзменении(Элемент)
	ОбновитьЗначениеНастройки(Элемент.Имя, СтатьяРасходовРаспределения);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаАрхивНаправленийДеятельностиПриИзменении(Элемент)
	ОбновитьЗначениеНастройки(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
КонецПроцедуры

&НаКлиенте
Процедура УчетВоВнешнейСистемыПриИзменении(Элемент)
	ОбновитьЗначениеНастройки(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
	УстановитьВидимостьСпискаСоответствияВидовНачислений();
КонецПроцедуры

&НаКлиенте
Процедура РежимУчетаВзносовПриИзменении(Элемент)
	
	СтатьяРасходовВзносов = ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
	УстановитьВидимостьГруппыВзносы();
	
	ОбновитьЗначениеНастройки(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
	ОбновитьЗначениеНастройки("СтатьяРасходовВзносов", ЭтаФорма["СтатьяРасходовВзносов"]);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовВзносовПриИзменении(Элемент)
	
	ОбновитьЗначениеНастройки(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовВзносовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовВзносовВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", СтатьяРасходовВзносов);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
	
	ИмяФормыВыбораСтатьи = "ОбщаяФорма.ФормаВыбораСтатьи";
	ОткрытьФорму(ИмяФормыВыбораСтатьи, ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовВзносовВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтатьяРасходовВзносов = Результат;
	ОбновитьЗначениеНастройки("СтатьяРасходовВзносов", ЭтаФорма["СтатьяРасходовВзносов"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСогласованныеЧасыПриИзменении(Элемент)
	
	ОбновитьЗначениеНастройки(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЗначениеНастройки(Имя, Значение)
	
	Результат = ОбновитьЗначениеНастройкиНаСервере(Имя, Значение);
	
	Если Результат.Отказ Тогда
		ЭтаФорма[Имя] = Результат.ПредыдущееЗначение;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьЗначениеНастройкиНаСервере(Имя, Значение)
	
	Результат = Новый Структура("Отказ", Ложь);
	
	Попытка
		
		Об = СсылкаНаЭлементСправочникаНастройки.ПолучитьОбъект();
		Об[Имя] = Значение;
		
		Об.Записать();
		
		СтруктураНастроек[Имя] = Значение;
		
	Исключение
		
		Результат.Отказ = Истина;
		Результат.Вставить("ТекстОшибки", ОписаниеОшибки());
		Результат.Вставить("ПредыдущееЗначение", СтруктураНастроек[Имя]);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьЗначениеНастроекНаФорму()
	
	Для Каждого ТекНастройка Из СтруктураНастроек Цикл
		ЭтаФорма[ТекНастройка.Ключ] = ТекНастройка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗначенияНастроек()
	
	СсылкаНаЭлементСправочникаНастройки = ПолучитьЭлементСправочникаНастройки();
	СтруктураНастроек = упоРаспределениеЗарплатыНастройкиСервер.ПустыеЗначенияНастройкиПоУмолчанию();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, СсылкаНаЭлементСправочникаНастройки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСпискаСоответствийНачислений()
	
	Элементы.СоответствиеНачислений.Видимость = ИспользоватьСоответствиеНачислений;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЭлементСправочникаНастройки()
	
	СсылкаНаЭлемент = Справочники.упоНастройкиРаспределенияЗарплаты.НастройкиРаспределениеЗарплатыПоПроектам;
	
	Возврат СсылкаНаЭлемент;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьСпискаСоответствияВидовНачислений()
	
	Элементы.СоответствиеВидовНачисленийERP_PM.Видимость = НЕ УчетВоВнешнейСистеме;
	Элементы.СоответствиеВидовНачисленийЗУП_PM.Видимость = УчетВоВнешнейСистеме;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГруппыВзносы()
	
	Элементы.ГруппаВзносы.Видимость = РежимУчетаВзносов = 1;
	
КонецПроцедуры

#КонецОбласти