
Процедура ИКТ_ПриЗаписиДанныхДляСКУДПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Константы.ИКТ_ИспользоватьОбменСоСКУД.Получить() Тогда	
		Возврат;
	КонецЕсли;	
		
	//Справочники
	Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Должности") Тогда
		
		IDДолжности = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Неопределено,Источник.Ссылка);
		Если IDДолжности = Неопределено Тогда	
			Если Не Источник.ПометкаУдаления Тогда
				СоздатьДолжностьВСКУД(Источник.Ссылка);
			КонецЕсли;
		Иначе
			ИзменитьПодразделениеИлиДолжностьВСКУД(,IDДолжности);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		IDПодразделения = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Источник.Ссылка,Неопределено);
		Если IDПодразделения = Неопределено Тогда		
			СоздатьПодразделениеВСКУД(Источник.Ссылка);
		Иначе
			ИзменитьПодразделениеИлиДолжностьВСКУД(IDПодразделения,);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Сотрудники") Тогда	
		ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Источник.Ссылка);
		Если ЗаписьСправочникаСКУД = Неопределено Тогда		
			ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Источник.Ссылка)	
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ИКТ_ЗоныДолжностей") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ИКТ_ДоступСКУД.Ссылка КАК Ссылка,
		|	ИКТ_ДоступСКУД.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ИКТ_ДоступСКУД КАК ИКТ_ДоступСКУД
		|ГДЕ
		|	ИКТ_ДоступСКУД.Должность.Ссылка = &Ссылка";
		Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Должность"); 
		Запрос.УстановитьПараметр("Ссылка",Должность);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл	
			ЗаписьДоступСКУД = Выборка.Ссылка.ПолучитьОбъект();
			ЗаписьДоступСКУД.ЗоныИТочкиДоступа.Загрузить(ПолучитьСвязанныеЗоныИТочки(Должность, Выборка.Подразделение));
			ЗаписьДоступСКУД.Записать();
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.ИКТ_ЗоныПодразделений") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ИКТ_ДоступСКУД.Ссылка КАК Ссылка,
		|	ИКТ_ДоступСКУД.Должность КАК Должность
		|ИЗ
		|	Справочник.ИКТ_ДоступСКУД КАК ИКТ_ДоступСКУД
		|ГДЕ
		|	ИКТ_ДоступСКУД.Подразделение.Ссылка = &Ссылка";
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Подразделение"); 
		Запрос.УстановитьПараметр("Ссылка",Подразделение);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаписьДоступСКУД = Выборка.Ссылка.ПолучитьОбъект();
			ЗаписьДоступСКУД.ЗоныИТочкиДоступа.Загрузить(ПолучитьСвязанныеЗоныИТочки(Выборка.Должность,Подразделение));
			ЗаписьДоступСКУД.Записать();
		КонецЦикла;		
	//Справочники
	
	//Документы
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда	
		
		ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Источник.Сотрудник);
		Если ЗаписьСправочникаСКУД = Неопределено Тогда		
			ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Источник.Сотрудник);
		КонецЕсли;
		
		//Создание подразделения, должности, сотрудника в СКУД (
		IDСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьСправочникаСКУД,"IDСотрудника");
		Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Должность");
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Подразделение");
		Если Не ЗначениеЗаполнено(IDСотрудника) Тогда
			IdПодразделения = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Подразделение,Неопределено);
			IdДолжности = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Неопределено,Должность);
			Если Не ЗначениеЗаполнено(IdПодразделения) Тогда
				СоздатьПодразделениеВСКУД(Подразделение);	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(IdДолжности) Тогда
				СоздатьДолжностьВСКУД(Должность);	
			КонецЕсли;
			Если ЗначениеЗаполнено(IdДолжности) И ЗначениеЗаполнено(IdПодразделения) Тогда 
				СоздатьСотрудникаВСКУД(ЗаписьСправочникаСКУД, IdПодразделения,IdДолжности)
			КонецЕсли;
		КонецЕсли;
		//Создание подразделения, должности, сотрудника в СКУД )
		
		ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Источник.Сотрудник); 
		НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
		Если ПроверитьАктуальностьДанных(Источник.Сотрудник, Источник.Дата, Перечисления.ВидыКадровыхСобытий.Прием) Тогда
			ГрафикРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"ГрафикРаботы");
			
			//Зоны и точки доступа (
			СвязанныеЗоныИТочки = ПолучитьСвязанныеЗоныИТочки(Должность, Подразделение);
			Если СвязанныеЗоныИТочки <> Неопределено Тогда
				НоваяЗаписьСправочникаСКУД.ЗоныИТочкиДоступа.Загрузить(СвязанныеЗоныИТочки);
			КонецЕсли;
			//Зоны и точки доступа )
			
			НоваяЗаписьСправочникаСКУД.Должность = Должность;
			НоваяЗаписьСправочникаСКУД.Подразделение = Подразделение;
			НоваяЗаписьСправочникаСКУД.ГрафикРаботы = ГрафикРаботы;
		КонецЕсли;
		НоваяЗаписьСправочникаСКУД.ПриемНаРаботу = Источник.Ссылка;
		
		//Статусы
		НоваяЗаписьСправочникаСКУД = ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Источник.Сотрудник);
		
		НоваяЗаписьСправочникаСКУД.Записать();
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда
		
		Для Каждого Строка Из Источник.Сотрудники Цикл
		
			ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Строка.Сотрудник);
			Если ЗаписьСправочникаСКУД = Неопределено Тогда		
				ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Строка.Сотрудник);
			КонецЕсли;
			
			//Создание подразделения, должности, сотрудника в СКУД (
			IDСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьСправочникаСКУД,"IDСотрудника");
			Должность = Строка.Должность;
			Подразделение = Строка.Подразделение;
			Если Не ЗначениеЗаполнено(IDСотрудника) Тогда
				IdПодразделения = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Подразделение,Неопределено);
				IdДолжности = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Неопределено,Должность);
				Если Не ЗначениеЗаполнено(IdПодразделения) Тогда
					СоздатьПодразделениеВСКУД(Подразделение);	
				КонецЕсли;
				Если Не ЗначениеЗаполнено(IdДолжности) Тогда
					СоздатьДолжностьВСКУД(Должность);	
				КонецЕсли;
				Если ЗначениеЗаполнено(IdДолжности) И ЗначениеЗаполнено(IdПодразделения) Тогда 
					СоздатьСотрудникаВСКУД(ЗаписьСправочникаСКУД, IdПодразделения,IdДолжности)
				КонецЕсли;
			КонецЕсли;
			//Создание подразделения, должности, сотрудника в СКУД )
			
			ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Строка.Сотрудник);
			НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();	
			Если ПроверитьАктуальностьДанных(Строка.Сотрудник, Источник.Дата, Перечисления.ВидыКадровыхСобытий.Прием) Тогда
				
				//Зоны и точки доступа (
				СвязанныеЗоныИТочки = ПолучитьСвязанныеЗоныИТочки(Строка.Должность, Строка.Подразделение);
				Если СвязанныеЗоныИТочки <> Неопределено Тогда
					НоваяЗаписьСправочникаСКУД.ЗоныИТочкиДоступа.Загрузить(СвязанныеЗоныИТочки);
				КонецЕсли;
				//Зоны и точки доступа )
				
				НоваяЗаписьСправочникаСКУД.Должность = Строка.Должность;
				НоваяЗаписьСправочникаСКУД.Подразделение = Строка.Подразделение;
				НоваяЗаписьСправочникаСКУД.ГрафикРаботы = Строка.ГрафикРаботы;;
			КонецЕсли;
			НоваяЗаписьСправочникаСКУД.ПриемНаРаботу = Источник.Ссылка;
			
			//Статусы
			НоваяЗаписьСправочникаСКУД = ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Строка.Сотрудник);

			НоваяЗаписьСправочникаСКУД.Записать();
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КадровыйПеревод") Тогда	
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"ДатаНачала") > НачалоДня(ТекущаяДатаСеанса()) Тогда
			ЗаписатьДанныеВ_РС_ИКТ_ДанныеКадровыхДокументовДляСКУД(Источник.Ссылка);
			Возврат;
		КонецЕсли;
		
		ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Источник.Сотрудник);
		Если ЗаписьСправочникаСКУД = Неопределено Тогда		
			ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Источник.Сотрудник);
		КонецЕсли;
		
		//Создание подразделения, должности, сотрудника в СКУД (
		IDСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьСправочникаСКУД,"IDСотрудника");
		Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Должность");
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Подразделение");
		IdПодразделения = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Подразделение,Неопределено);
		IdДолжности = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Неопределено,Должность);
		
		Если Не ЗначениеЗаполнено(IDСотрудника) Тогда
			Если Не ЗначениеЗаполнено(IdПодразделения) Тогда
				СоздатьПодразделениеВСКУД(Подразделение);	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(IdДолжности) Тогда
				СоздатьДолжностьВСКУД(Должность);	
			КонецЕсли;
			Если ЗначениеЗаполнено(IdДолжности) И ЗначениеЗаполнено(IdПодразделения) Тогда 
				СоздатьСотрудникаВСКУД(ЗаписьСправочникаСКУД, IdПодразделения,IdДолжности)
			КонецЕсли;
		КонецЕсли;
		//Создание подразделения, должности, сотрудника в СКУД )
		
		НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
		Если ПроверитьАктуальностьДанных(Источник.Сотрудник, Источник.Дата, Перечисления.ВидыКадровыхСобытий.Перемещение) Тогда	
			Если Источник.ИзменитьПодразделениеИДолжность Тогда
				
				ОтветСКУД = ИзменитьПодразделениеИДолжностьСотрудникаВСКУД(IDСотрудника,IDПодразделения,IDДолжности);
				Если Не ОтветСКУД.Выполнено Тогда
					Возврат
				КонецЕсли;
				
				//Зоны и точки доступа (	
				СвязанныеЗоныИТочки = ПолучитьСвязанныеЗоныИТочки(Должность, Подразделение);
				Если СвязанныеЗоныИТочки <> Неопределено Тогда
					НоваяЗаписьСправочникаСКУД.ЗоныИТочкиДоступа.Загрузить(СвязанныеЗоныИТочки);
				КонецЕсли;
				//Зоны и точки доступа )
				
				НоваяЗаписьСправочникаСКУД.Должность = Должность;
				НоваяЗаписьСправочникаСКУД.Подразделение = Подразделение;		
			КонецЕсли;
			ГрафикРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"ГрафикРаботы");
			Если ЗначениеЗаполнено(ГрафикРаботы) Тогда
				ГрафикРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"ГрафикРаботы");	
				НоваяЗаписьСправочникаСКУД.ГрафикРаботы = ГрафикРаботы;		
			КонецЕсли;
		КонецЕсли;
		НоваяЗаписьСправочникаСКУД.КадровыйПеревод = Источник.Ссылка;
		
		//Статусы
		НоваяЗаписьСправочникаСКУД = ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Источник.Сотрудник);
		
		НоваяЗаписьСправочникаСКУД.Записать();
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
				
		Для Каждого Строка Из Источник.Сотрудники Цикл
			
			Если Строка.ДатаНачала > НачалоДня(ТекущаяДатаСеанса()) Тогда
				ЗаписатьДанныеВ_РС_ИКТ_ДанныеКадровыхДокументовДляСКУД(Источник.Ссылка);
				Продолжить;
			КонецЕсли;
			
			ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Строка.Сотрудник);
			Если ЗаписьСправочникаСКУД = Неопределено Тогда		
				ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Строка.Сотрудник);
			КонецЕсли;
			
			//Создание подразделения, должности, сотрудника в СКУД (
			IDСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьСправочникаСКУД,"IDСотрудника");
			Должность = Строка.Должность;
			Подразделение = Строка.Подразделение;
			IdПодразделения = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Подразделение,Неопределено);
			IdДолжности = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Неопределено,Должность);
			
			Если Не ЗначениеЗаполнено(IDСотрудника) Тогда
				Если Не ЗначениеЗаполнено(IdПодразделения) Тогда
					СоздатьПодразделениеВСКУД(Подразделение);	
				КонецЕсли;
				Если Не ЗначениеЗаполнено(IdДолжности) Тогда
					СоздатьДолжностьВСКУД(Должность);	
				КонецЕсли;
				Если ЗначениеЗаполнено(IdДолжности) И ЗначениеЗаполнено(IdПодразделения) Тогда 
					СоздатьСотрудникаВСКУД(ЗаписьСправочникаСКУД, IdПодразделения,IdДолжности)
				КонецЕсли;
			КонецЕсли;
			//Создание подразделения, должности, сотрудника в СКУД )
			
			НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
			Если ПроверитьАктуальностьДанных(Строка.Сотрудник, Источник.Дата, Перечисления.ВидыКадровыхСобытий.Перемещение) Тогда
				Если Строка.ИзменитьПодразделениеИДолжность Тогда
						
					ОтветСКУД = ИзменитьПодразделениеИДолжностьСотрудникаВСКУД(IDСотрудника,IDПодразделения,IDДолжности);
					Если Не ОтветСКУД.Выполнено Тогда
						Возврат
					КонецЕсли;
					
					//Зоны и точки доступа (	
					СвязанныеЗоныИТочки = ПолучитьСвязанныеЗоныИТочки(Должность, Подразделение);
					Если СвязанныеЗоныИТочки <> Неопределено Тогда
						НоваяЗаписьСправочникаСКУД.ЗоныИТочкиДоступа.Загрузить(СвязанныеЗоныИТочки);
					КонецЕсли;
					//Зоны и точки доступа )
					
					НоваяЗаписьСправочникаСКУД.Должность = Должность;
					НоваяЗаписьСправочникаСКУД.Подразделение = Подразделение;		
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка.ГрафикРаботы) Тогда	
					НоваяЗаписьСправочникаСКУД.ГрафикРаботы = Строка.ГрафикРаботы;		
				КонецЕсли;
			КонецЕсли;
			НоваяЗаписьСправочникаСКУД.КадровыйПеревод = Источник.Ссылка;
			
			//Статусы
			НоваяЗаписьСправочникаСКУД = ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Строка.Сотрудник);
			
			НоваяЗаписьСправочникаСКУД.Записать();
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РаботаВВыходныеИПраздничныеДни") Тогда
		
		Если (Источник.Проведен И Не Источник.ИКТ_ВыгруженоИзЕРП) Или (Не Источник.Проведен И Источник.ИКТ_ВыгруженоИзЕРП) Тогда
		
			Для Каждого Строка Из Источник.Сотрудники Цикл
				
				ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Строка.Сотрудник);
				Если ЗаписьСправочникаСКУД = Неопределено Тогда		
					Возврат;
				КонецЕсли;
				
				НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
				Если Источник.ПометкаУдаления = Ложь Тогда 
					НоваяЗаписьСправочникаСКУД.РаботаВВыходныеИПраздничныеДни = Источник.Ссылка;
				Иначе
					НоваяЗаписьСправочникаСКУД.РаботаВВыходныеИПраздничныеДни = Документы.РаботаВВыходныеИПраздничныеДни.ПустаяСсылка();
				КонецЕсли;
				НоваяЗаписьСправочникаСКУД.Записать();
				
			КонецЦикла;
		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Увольнение") Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"ДатаУвольнения") > НачалоДня(ТекущаяДатаСеанса()) Тогда
			ЗаписатьДанныеВ_РС_ИКТ_ДанныеКадровыхДокументовДляСКУД(Источник.Ссылка);
			Возврат;
		КонецЕсли;
		
		ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Источник.Сотрудник);
		Если ЗаписьСправочникаСКУД = Неопределено Тогда		
			ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Источник.Сотрудник);
		КонецЕсли;
		
		НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Проведен") Тогда
			НоваяЗаписьСправочникаСКУД.Увольнение = Источник.Ссылка;
		Иначе
			НоваяЗаписьСправочникаСКУД.Увольнение = Документы.Увольнение.ПустаяСсылка();	
		КонецЕсли;
		НоваяЗаписьСправочникаСКУД = ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Источник.Сотрудник);
		НоваяЗаписьСправочникаСКУД.Записать();
		
		//23.05.24 Без делегации проходов - сотрудник блокируется в СИГУР (
		ЗаблокироватьСотрудникаВСКУД(НоваяЗаписьСправочникаСКУД.IDСотрудника);
		//23.05.24 Без делегации проходов - сотрудник блокируется в СИГУР )
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
		
		Для Каждого Строка Из Источник.Сотрудники Цикл 
			
			Если Строка.ДатаУвольнения > НачалоДня(ТекущаяДатаСеанса()) Тогда
				ЗаписатьДанныеВ_РС_ИКТ_ДанныеКадровыхДокументовДляСКУД(Источник.Ссылка);
				Продолжить;
			КонецЕсли;
			
			ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Строка.Сотрудник);
			Если ЗаписьСправочникаСКУД = Неопределено Тогда		
				ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Строка.Сотрудник);
			КонецЕсли;
			
			НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Проведен") Тогда
				НоваяЗаписьСправочникаСКУД.Увольнение = Источник.Ссылка;
			Иначе
				НоваяЗаписьСправочникаСКУД.Увольнение = Документы.УвольнениеСписком.ПустаяСсылка();	
			КонецЕсли;
			НоваяЗаписьСправочникаСКУД = ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Строка.Сотрудник);
			НоваяЗаписьСправочникаСКУД.Записать();
			
			//23.05.24 Без делегации проходов - сотрудник блокируется в СИГУР (
			ЗаблокироватьСотрудникаВСКУД(НоваяЗаписьСправочникаСКУД.IDСотрудника);
			//23.05.24 Без делегации проходов - сотрудник блокируется в СИГУР )
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаключениеМедицинскогоОсмотра") Тогда
		
		Если Константы.ИКТ_ИспользоватьЗаключениеМедицинскогоОсмотраСКУД.Получить() Тогда 
			Сотрудник = НайтиСотрудникаПоФизЛицу(Источник.ФизическоеЛицо);
			ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Сотрудник);
			Если ЗаписьСправочникаСКУД = Неопределено Тогда		
				ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Сотрудник);
			КонецЕсли;
			
			НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
			НоваяЗаписьСправочникаСКУД.ЗаключениеМедицинскогоОсмотра = Источник.Ссылка;
			НоваяЗаписьСправочникаСКУД.Записать();
			
			//Статусы
			НоваяЗаписьСправочникаСКУД = ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Сотрудник);
			НоваяЗаписьСправочникаСКУД.Записать();
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИКТ_ДопускКРаботе") Тогда
		
		Для Каждого Строка Из Источник.Сотрудники Цикл	
			ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Строка.Сотрудник);
			Если ЗаписьСправочникаСКУД = Неопределено Тогда		
				ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Строка.Сотрудник)	
			КонецЕсли;
			НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
			
			АктуальноеУдостоверение = ПолучитьАктуальноеУдостоверениеСотрудника(Строка.Сотрудник);
			НоваяЗаписьСправочникаСКУД.Удостоверение = ?(ЗначениеЗаполнено(АктуальноеУдостоверение),
			АктуальноеУдостоверение,
			Строка.Удостоверение);	                                       
			НоваяЗаписьСправочникаСКУД.Записать();
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИКТ_ОграничениеВЗоныДоступа") Тогда
		
		Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Сотрудник");
		ЗаписьСправочникаСКУД = НайтиЗаписьСправочникаСКУД(Сотрудник);	
		Действует = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Действует");
		
		Если ЗаписьСправочникаСКУД = Неопределено Тогда		
			ЗаписьСправочникаСКУД = ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Сотрудник)	
		КонецЕсли;
		
		НоваяЗаписьСправочникаСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
		НоваяЗаписьСправочникаСКУД.ОграничениеДоступа = ?(Действует,Источник.Ссылка,Документы.ИКТ_ОграничениеВЗоныДоступа.ПустаяСсылка());
		НоваяЗаписьСправочникаСКУД.Записать();
	КонецЕсли;
	//Документы
	
КонецПроцедуры

Функция ИдентификаторСотрудникаИзСКУД(ФИО)
	
	//Параметры запроса
	QueryParameters = Новый Массив;
	
	//name
	nameМассив = Новый Массив;
	nameМассив.Добавить(ФИО);
	QueryParameters.Добавить(Новый Структура("name",nameМассив));
	
	//sortBy
	sortByМассив = Новый Массив;
	sortByМассив.Добавить("id");
	QueryParameters.Добавить(Новый Структура("sortBy",sortByМассив));
	
	//sortOrder
	sortOrderМассив = Новый Массив;
	sortOrderМассив.Добавить("DESC");
	QueryParameters.Добавить(Новый Структура("sortOrder",sortOrderМассив));
	
	QueryParameters = ИКТ_SigurApi.ЗадатьQueryParameters(QueryParameters);
	
	Ответ = ИКТ_SigurApi.Получить("employees",,QueryParameters,,10);
	Если ТипЗнч(Ответ) = Тип("Число") Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось получить идентификатор сотрудника СКУД. Код ошибки:"+Ответ);
		Возврат 0;
	Иначе
		Если Ответ.Количество() Тогда
			Возврат Ответ[0].id;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Функция - Проверить наличие доступа
// Проверяет в справочнике ИКТ_ДоступСКУД может ли сотрудник с таким значением карты пройти в такую точку
// Параметры:
//  keyHex		Значение карты - Строка - Hex значение карты доступа 
//  accessPoint	Точка доступа - Строка - Номер точки доступа
// 
// Возвращаемое значение:
//  Булево 
//
Функция ПроверитьНаличиеДоступа(keyHex,accessPoint) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ИКТ_Пропуска.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ Пропуск
		|ИЗ
		|	РегистрСведений.ИКТ_Пропуска КАК ИКТ_Пропуска
		|ГДЕ
		|	ИКТ_Пропуска.ЗначениеКарты = &ЗначениеКарты
		|	И ИКТ_Пропуска.Действует = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИКТ_ДоступСКУД.IDСотрудника КАК IDСотрудника,
		|	ИКТ_ДоступСКУД.Должность КАК Должность,
		|	ИКТ_ДоступСКУД.Подразделение КАК Подразделение,
		|	ИКТ_ДоступСКУД.ПриемНаРаботу КАК ПриемНаРаботу,
		|	ИКТ_ДоступСКУД.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра,
		|	ИКТ_ДоступСКУД.ГрафикРаботы КАК ГрафикРаботы,
		|	ИКТ_ДоступСКУД.РаботаВВыходныеИПраздничныеДни КАК РаботаВВыходныеИПраздничныеДни,
		|	ИКТ_ДоступСКУД.Увольнение КАК Увольнение,
		|	ИКТ_ДоступСКУД.ЗоныИТочкиДоступа.(
		|		ЗонаДоступа.ТребуетсяДопуск КАК ЗонаДоступаТребуетсяДопуск,
		|		ЗонаДоступа.ГруппаДопуска КАК ЗонаДоступаГруппаДопуска,
		|		ЗонаДоступа.НуженМедосмотр КАК ЗонаДоступаНуженМедосмотр,
		|		ЗонаДоступа.Ссылка КАК ЗонаДоступаСсылка
		|	) КАК ЗоныИТочкиДоступа,
		|	ИКТ_ДоступСКУД.Сотрудник КАК Сотрудник,
		|	ИКТ_ДоступСКУД.СтатусыДоступа.(
		|		Статус КАК Статус
		|	) КАК СтатусыДоступа,
		|	ИКТ_ДоступСКУД.ОграничениеДоступа КАК ОграничениеДоступа
		|ИЗ
		|	Пропуск КАК Пропуск
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИКТ_ДоступСКУД КАК ИКТ_ДоступСКУД
		|		ПО Пропуск.Сотрудник.Ссылка = ИКТ_ДоступСКУД.Сотрудник.Ссылка";
		Запрос.УстановитьПараметр("ЗначениеКарты",keyHex);	
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Не ЗначениеЗаполнено(Выборка.IDСотрудника)
				Или Не ЗначениеЗаполнено(Выборка.Должность)
				Или Не ЗначениеЗаполнено(Выборка.Подразделение)
				Или Не ЗначениеЗаполнено(Выборка.ПриемНаРаботу)
				Или Не ЗначениеЗаполнено(Выборка.ГрафикРаботы)
				Или Не ЗначениеЗаполнено(Выборка.ЗоныИТочкиДоступа) Тогда
				Возврат Ложь
			Иначе
				
				//Пропуск на вход предприятия, если сотрудник не уволен (
				Если Не ЗначениеЗаполнено(Выборка.Увольнение)
				И ЗначениеЗаполнено(Выборка.ГрафикРаботы) Тогда	
					Если ЭтоТочкаВходаПредприятия(accessPoint) Тогда			
						Если Не ТекущееВремяСовпадаетСоСменой(Выборка.ГрафикРаботы) Тогда				
							Если ЗначениеЗаполнено(Выборка.РаботаВВыходныеИПраздничныеДни) Тогда
								Если ТекущаяДатаСовпадаетСРаботойВВыходной(Выборка.РаботаВВыходныеИПраздничныеДни, Выборка.Сотрудник) Тогда
									Возврат Истина;
								Иначе
									Возврат Ложь;
								КонецЕсли;
							Иначе
								Возврат Ложь;
							КонецЕсли;
						Иначе
							Возврат Истина;	
						КонецЕсли;
					КонецЕсли;
				Иначе
					Возврат Ложь;
				КонецЕсли;
				//Пропуск на вход предприятия, если сотрудник не уволен )
	
				Если Выборка.СтатусыДоступа.Пустой() Тогда
					Возврат Ложь
				КонецЕсли;
				
				СотрудникИмеетДоступКТочке = Ложь;
				ВыборкаЗоныТочки = Выборка.ЗоныИТочкиДоступа.Выбрать();
				Пока ВыборкаЗоныТочки.Следующий() Цикл
					
					ТЧТочкиДоступа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаЗоныТочки.ЗонаДоступаСсылка,"ТочкиДоступа");
					ТЗТочкиДоступа = ТЧТочкиДоступа.Выгрузить();
					////Изменил 18.12 (
					//МассТочек = ТЗТочкиДоступа.НайтиСтроки(Новый Структура("Код,ТипПрохода",accessPoint,Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход));
					МассТочек = ТЗТочкиДоступа.НайтиСтроки(Новый Структура("Код,ТипПрохода",accessPoint,Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход));
					////Изменил 18.12 )
					
					Если МассТочек.Количество() Тогда
						//Если нужен допуск на точку 05.12.23 (
						Если Константы.ИКТ_ИспользоватьБлокировкуПоДопускамСКУД.Получить() И ВыборкаЗоныТочки.ЗонаДоступаТребуетсяДопуск Тогда
							Если Не ПроверитьДопуск(Выборка.Сотрудник, ВыборкаЗоныТочки.ЗонаДоступаГруппаДопуска) Тогда
								Возврат Ложь;
							КонецЕсли;
						КонецЕсли;
						//Если нужен допуск на точку 05.12.23 )
						
						//Если нужен меодсмотр (
						Если Константы.ИКТ_ИспользоватьЗаключениеМедицинскогоОсмотраСКУД.Получить()
							И ВыборкаЗоныТочки.ЗонаДоступаНуженМедосмотр Тогда
							Если Не ЗначениеЗаполнено(Выборка.ЗаключениеМедицинскогоОсмотра) Тогда
								Возврат Ложь
							ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ЗаключениеМедицинскогоОсмотра,"РезультатОсмотра") =
								Перечисления.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания Тогда
								Возврат Ложь
							КонецЕсли;
						КонецЕсли;
						//Если нужен меодсмотр )
						
						//Ограничение доступа (
						Если ЗначениеЗаполнено(Выборка.ОграничениеДоступа) Тогда
							ТЧОграниченныеЗоны = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ОграничениеДоступа,"ЗоныДоступа").Выгрузить();
						    МассивОграниченныхЗон = ТЧОграниченныеЗоны.НайтиСтроки(Новый Структура("Зона",ВыборкаЗоныТочки.ЗонаДоступаСсылка));
							Если МассивОграниченныхЗон.Количество() Тогда
								Возврат Ложь		
							КонецЕсли;
						КонецЕсли;
						//Ограничение доступа )
						
						СотрудникИмеетДоступКТочке = Истина;
						Прервать;	
					КонецЕсли;
				КонецЦикла;
				
				Если Не СотрудникИмеетДоступКТочке Тогда
					Возврат Ложь
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.Увольнение) Тогда
					Если ТипЗнч(Выборка.Увольнение) = Тип("ДокументСсылка.Увольнение") Тогда
						Если ТекущаяДатаСеанса() > КонецДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Увольнение,"ДатаУвольнения")) Тогда
							Возврат Ложь
						КонецЕсли;
					Иначе
						СтрСотрудник = Выборка.Увольнение.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник",Выборка.Сотрудник));
						Если ТекущаяДатаСеанса() > КонецДня(СтрСотрудник[0].ДатаУвольнения) Тогда
							Возврат Ложь
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если Не ТекущееВремяСовпадаетСоСменой(Выборка.ГрафикРаботы) Тогда
					Если ЗначениеЗаполнено(Выборка.РаботаВВыходныеИПраздничныеДни)
					И ТекущаяДатаСовпадаетСРаботойВВыходной(Выборка.РаботаВВыходныеИПраздничныеДни, Выборка.Сотрудник) Тогда
						Возврат Истина;
					Иначе
						Возврат Ложь;	
					КонецЕсли;
				Иначе
					Возврат Истина;
				КонецЕсли;
								
			КонецЕсли;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Проверка доступа",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	КонецПопытки;
КонецФункции

// Процедура - Записать события прохода
// Делает записи в РС ИКТ_СобытияПроходаСКУД о фактических проходах зарегистрированных в СКУД
// Параметры:
// СобытияПрохода События прохода - Массив - События прохода собранные в массив из СКУД
// 
//// Возвращаемое значение:
////  logid - id последней записи о совершенном проходе для СКУД
////
Процедура ЗаписатьСобытияПрохода(СобытияПрохода) Экспорт
	
	//Для запроса данных о событиях прохода из 1С по запросу /api/v1/events
	Попытка
		КолВоСобытий = СобытияПрохода.Количество();
		Если КолВоСобытий = 0 Тогда
			Возврат
		КонецЕсли;
		
		ЗапросТипыСобытий = Новый Запрос;
		ЗапросТипыСобытий.Текст=
		"ВЫБРАТЬ
		|	ИКТ_ТипыСобытийСКУД.id КАК id,
		|	ИКТ_ТипыСобытийСКУД.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИКТ_ТипыСобытийСКУД КАК ИКТ_ТипыСобытийСКУД";
		РезультатЗапроса = ЗапросТипыСобытий.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ТзТипыСобытий = РезультатЗапроса.Выгрузить();
		Иначе
			ТзТипыСобытий = Новый ТаблицаЗначений;
		КонецЕсли;
		
		Для Каждого Событие из СобытияПрохода Цикл

			//Если проход неопределен accessObjectId = 0
			Если Событие.accessObjectId = 0 Тогда
				//Чтобы события двигались дальше, а не застревали на lastId
				ИндЭл = СобытияПрохода.Найти(Событие);
				Если ИндЭл = КолВоСобытий - 1 Тогда
					НаборЗаписей = РегистрыСведений.ИКТ_СобытияПроходаСКУД.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ID_Прохода.Установить(Событие.id);
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.ID_Прохода = Событие.id;
					НаборЗаписей.Записать();
				КонецЕсли;
				Продолжить;
			Иначе
				//Если сотрудник Глобальных напитков, то делаем запись
				//т.к. сотрудники других организаций нам не нужны
				СотрудникСобытияГН = ПолучитьСотрудникаПоID(Событие.accessObjectId);
				Если Не ЗначениеЗаполнено(СотрудникСобытияГН) Тогда
					//Чтобы события двигались дальше, а не застревали на lastId
					ИндЭл = СобытияПрохода.Найти(Событие);
					Если ИндЭл = КолВоСобытий - 1 Тогда
						НаборЗаписей = РегистрыСведений.ИКТ_СобытияПроходаСКУД.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.ID_Прохода.Установить(Событие.id);
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.ID_Прохода = Событие.id;
						НаборЗаписей.Записать();
					КонецЕсли;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ИКТ_СобытияПроходаСКУД.СоздатьНаборЗаписей();
			//22.05 убрал (Строка(Событие.id)
			НаборЗаписей.Отбор.ID_Прохода.Установить(Событие.id);
			НоваяЗапись = НаборЗаписей.Добавить();
			//22.05 убрал (Строка(Событие.id)
			НоваяЗапись.ID_Прохода = Событие.id;
			НоваяЗапись.ВремяПрохода = TimestampВДату(Событие.timestamp);
			НоваяЗапись.internalEmpId = Событие.accessObjectId;
			//22.05 убрал Строка(Событие.accessPointId)
			НоваяЗапись.ID_ТочкиДоступа = Событие.accessPointId;
			Если Событие.direction = "OUT" Тогда
				НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход;
			ИначеЕсли Событие.direction = "IN" Тогда
				НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход;	
			Иначе
				НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.ПустаяСсылка();	
			КонецЕсли;
	//		22.05 убрал Строка(Событие.accessObjectId)
			НоваяЗапись.Сотрудник = СотрудникСобытияГН;
			Если ТзТипыСобытий.Количество() Тогда
				МассивНайденныхСтрок = ТзТипыСобытий.НайтиСтроки(Новый Структура("id",Событие.type));
				Если МассивНайденныхСтрок.Количество() Тогда
					НоваяЗапись.ТипСобытия = МассивНайденныхСтрок[0].Наименование;
				КонецЕсли;
			КонецЕсли;
			
			НаборЗаписей.Записать();
			 
		КонецЦикла;
		
	Исключение
		ЗаписьЖурналаРегистрации("Запись событий прохода",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	КонецПопытки;
	
	//Не работает, нет соединения с сервисом
	////Для запроса данных о событиях прохода из 1С по запросу /api/v1/events/parsed
	//Попытка
	//	Если СобытияПрохода.Количество() = 0 Тогда
	//		Возврат
	//	КонецЕсли;
	//	
	//	Для Каждого Событие из СобытияПрохода Цикл
	//		
	//		НаборЗаписей = РегистрыСведений.ИКТ_СобытияПроходаСКУД.СоздатьНаборЗаписей();
	//		//22.05 убрал Установить(Строка(Событие.id))
	//		//22.05 убрал ID_Прохода = Строка(Событие.id);
	//		НаборЗаписей.Отбор.ID_Прохода.Установить(Событие.id);
	//		НоваяЗапись = НаборЗаписей.Добавить();
	//		НоваяЗапись.ID_Прохода = Событие.id;
	//		
	//		СтрукData = Событие.data;
	//		//22.05 убрал Строка(СтрукData.accessPointId);
	//		НоваяЗапись.ID_ТочкиДоступа = СтрукData.accessPointId;
	//		Если СтрукData.direction = "OUT" Тогда
	//			НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход;
	//		ИначеЕсли СтрукData.direction = "IN" Тогда
	//			НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход;	
	//		Иначе
	//			НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.ПустаяСсылка();	
	//		КонецЕсли;
	//		//22.05 убрал ПолучитьСотрудникаПоID(Строка(СтрукData.employeeId))
	//		НоваяЗапись.Сотрудник = ПолучитьСотрудникаПоID(СтрукData.employeeId);
	//		НоваяЗапись.internalEmpId = СтрукData.employeeId;
	//		НоваяЗапись.ЗначениеПропуска = СтрукData.cardKey;
	//		НоваяЗапись.zoneId = СтрукData.zoneId; 
	//		НоваяЗапись.ТипСобытия = Событие.eventType;
	//		НоваяЗапись.ВремяПрохода = Дата("19700101") + Число(Событие.timestamp);
	//		
	//		НаборЗаписей.Записать();
	//		 
	//	КонецЦикла;
	//	
	//Исключение
	//	ЗаписьЖурналаРегистрации("Запись событий прохода",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	//КонецПопытки;
	
	//Функция для СКУД с отдельным сервером, когда 1С - только принимающая запросы сторона
	//Попытка
	//	Если СобытияПрохода.logs.Количество() = 0 Тогда
	//		Возврат Неопределено
	//	КонецЕсли;
	//	
	//	Для Каждого Событие из СобытияПрохода.logs Цикл
	//		
	//		НаборЗаписей = РегистрыСведений.ИКТ_СобытияПроходаСКУД.СоздатьНаборЗаписей();
	//		НаборЗаписей.Отбор.ID_Прохода.Установить(Событие.logId);
	//		НоваяЗапись = НаборЗаписей.Добавить();
	//		НоваяЗапись.ID_Прохода = Событие.logId;
	//		НоваяЗапись.ВремяПрохода = МестноеВремя('19700101' + Событие.time);
	//		НоваяЗапись.internalEmpId = Событие.internalEmpId;
	//		НоваяЗапись.ID_ТочкиДоступа = Событие.accessPoint;
	//		Если Событие.direction = 1 Тогда
	//			НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход;
	//		ИначеЕсли Событие.direction = 2 Тогда
	//			НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход;	
	//		Иначе
	//			НоваяЗапись.ТипПрохода = Перечисления.ИКТ_ТипПроходаТочекДоступа.ПустаяСсылка();	
	//		КонецЕсли;
	//		НоваяЗапись.ЗначениеПропуска = Событие.keyHex;
	//		22.05 убрал Строка(Событие.internalEmpId)
	//		НоваяЗапись.Сотрудник = ПолучитьСотрудникаПоID(Событие.internalEmpId);
	//		НаборЗаписей.Записать();
	//		
	//		logid = Событие.logId; 
	//	КонецЦикла;
	//	
	//	Возврат logid
	//Исключение
	//	ЗаписьЖурналаРегистрации("Запись событий прохода",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	//КонецПопытки;
	
КонецПроцедуры

// Процедура - Получить новые пропуска
// Получает список пропусков из файла формата xls
Процедура ПолучитьНовыеПропуска() Экспорт
	
	//{ИКТ 21.04.2024
	// Примечание: для подчиненного узла не нужно выполнять процедуру
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда 
		Возврат
	КонецЕсли;
	//}ИКТ
	
	ТЗПропуска = ПолучитьСписокПропусковИзФайла();
	Если ТЗПропуска.Количество() Тогда 
		
		ЗапросРСПропуска = Новый Запрос;
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		ЗапросРСПропуска.МенеджерВременныхТаблиц = МенеджерВТ;
		ЗапросРСПропуска.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТзПропуска.ИдентификаторКарты КАК СТРОКА(10)) КАК ИдентификаторКарты
		|ПОМЕСТИТЬ ВТПропуска
		|ИЗ
		|	&ТзПропуска КАК ТзПропуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПропуска.ИдентификаторКарты КАК ИдентификаторКарты
		|ИЗ
		|	ВТПропуска КАК ВТПропуска
		|ГДЕ
		|	ВТПропуска.ИдентификаторКарты Не В
		|				(ВЫБРАТЬ
		|					ИКТ_Пропуска.ЗначениеКарты КАК ЗначениеКарты
		|				ИЗ
		|					РегистрСведений.ИКТ_Пропуска КАК ИКТ_Пропуска)";
		ЗапросРСПропуска.УстановитьПараметр("ТзПропуска",ТЗПропуска);
		РезультатЗапроса = ЗапросРСПропуска.Выполнить(); 	
		Если РезультатЗапроса.Пустой() Тогда
			Возврат
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИдентификаторКарты = СокрП(Выборка.ИдентификаторКарты);
			НаборЗаписей = РегистрыСведений.ИКТ_Пропуска.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗначениеКарты.Установить(ИдентификаторКарты);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ЗначениеКарты = ИдентификаторКарты;
			НаборЗаписей.Записать();
		КонецЦикла;
		
	КонецЕсли;	
		
КонецПроцедуры                             

#Область СлужебныеПроцедурыИФункции

Функция НайтиЗаписьСправочникаСКУД(Сотрудник) Экспорт
	
	ЗапросСотрудник = Новый Запрос;
	ЗапросСотрудник.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ДоступСКУД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ДоступСКУД КАК ИКТ_ДоступСКУД
	|ГДЕ
	|	ИКТ_ДоступСКУД.Сотрудник.Ссылка = &Ссылка";
	ЗапросСотрудник.УстановитьПараметр("Ссылка",Сотрудник);
	РезультатЗапроса = ЗапросСотрудник.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьСотрудникаВСправочникИКТ_ДоступСКУД(Сотрудник) Экспорт
	
	НоваяЗапись = Справочники.ИКТ_ДоступСКУД.СоздатьЭлемент();
	НоваяЗапись.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник,"Наименование");
	НоваяЗапись.Сотрудник = Сотрудник;
	НоваяЗапись.IDСотрудника = ИдентификаторСотрудникаИзСКУД(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник,"Наименование"));
	НоваяЗапись.Записать();
	Возврат НоваяЗапись.Ссылка;
	
КонецФункции

// Процедура - Создать сотрудника ВСКУД
// При записи нового сотрудника создаёт его в СКУД путём http запроса
// Параметры:
//  ЗаписьСправочникаСКУД	Ссылка на элемент - СправочникСсылка.ИКТ_ДоступСКУД - Ссылка на элемент справочника ИКТ_ДоступСКУД
//  IdПодразделения			ID Подразделения - Строка - ID Подразделения 1С под которым числится объект в СКУД
//  IdДолжности				ID Должности - Строка - ID Должности 1С под которым числится объект в СКУД
//
Процедура СоздатьСотрудникаВСКУД(ЗаписьСправочникаСКУД, IdПодразделения=Неопределено,IdДолжности=Неопределено)

	//Сотрудники грузятся из САП в СКУД
	ЗаписьСКУД = ЗаписьСправочникаСКУД.ПолучитьОбъект();
	Id = ИдентификаторСотрудникаИзСКУД(ЗаписьСКУД.Наименование);
	ЗаписьСКУД.IDСотрудника = Id;
	ЗаписьСКУД.Записать();
	Возврат;
	
	Если ЗначениеЗаполнено(IdПодразделения) Тогда 
		
		НоваяЗапись = ЗаписьСправочникаСКУД.ПолучитьОбъект();
		СтрукСотрудника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяЗапись.Сотрудник,"Наименование,Код,ФизическоеЛицо");
		ФИО = СтрукСотрудника.Наименование;
		ТабНомер = СтрукСотрудника.Код;
		ФизическоеЛицо = СтрукСотрудника.ФизическоеЛицо;
		
		СотрудникСКУДСтрук = Новый Структура;
		СотрудникСКУДСтрук.Вставить("name",ФИО);
		СотрудникСКУДСтрук.Вставить("departmentId",IdПодразделения);
		Если ЗначениеЗаполнено(IdДолжности) Тогда
			СотрудникСКУДСтрук.Вставить("positionId",IdДолжности);
		КонецЕсли;
		//22.05.24 (
		//Фото
		ЗапросФото = Новый Запрос;
		ЗапросФото.Текст = 
		"ВЫБРАТЬ
		|	ФотографииФизическихЛиц.Фотография КАК Фотография
		|ИЗ
		|	РегистрСведений.ФотографииФизическихЛиц КАК ФотографииФизическихЛиц
		|ГДЕ
		|	ФотографииФизическихЛиц.ФизическоеЛицо.Ссылка = &Ссылка";
		ЗапросФото.УстановитьПараметр("Ссылка",ФизическоеЛицо);
		РезЗапросаФото = ЗапросФото.Выполнить();
		Если Не РезЗапросаФото.Пустой() Тогда
			ВыборкаФото = РезЗапросаФото.Выбрать();
			ВыборкаФото.Следующий();
			Попытка
				СотрудникСКУДСтрук.Вставить("photo",Base64Строка(ВыборкаФото.Фотография));
			Исключение
				ЗаписьЖурналаРегистрации("Регистрация сотрудника СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		//Контактные данные
		МассивТиповКИ = Новый Массив;
		МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		МассивВидовКИ = Новый Массив;
		МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
		МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
		МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
		КИСотрудника = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(ФизическоеЛицо,МассивТиповКИ,МассивВидовКИ,ТекущаяДатаСеанса());
		
		Если КИСотрудника.Количество() Тогда
			КИСотрудника.Сортировать("Дата Убыв");
			contactDetails = Новый Массив;
			//Телефон
			СтрукОтбораТелефон = Новый Структура;
			СтрукОтбораТелефон.Вставить("Вид",МассивВидовКИ[1]);
			СтрукОтбораТелефон.Вставить("Тип",МассивТиповКИ[0]);
			МассТелефонРабочий = КИСотрудника.НайтиСтроки(СтрукОтбораТелефон);
			Если МассТелефонРабочий.Количество() Тогда
				СтрукТелефон = Новый Структура;
				СтрукТелефон.Вставить("type","SMS");
				СтрукТелефон.Вставить("value",МассТелефонРабочий[0].Представление);
				contactDetails.Добавить(СтрукТелефон);
			Иначе
				СтрукОтбораТелефон.Вставить("Вид",МассивВидовКИ[2]);
				МассТелефонМобильный = КИСотрудника.НайтиСтроки(СтрукОтбораТелефон);
				Если МассТелефонМобильный.Количество() Тогда
					СтрукТелефон = Новый Структура;
					СтрукТелефон.Вставить("type","SMS");
					СтрукТелефон.Вставить("value",МассТелефонМобильный[0].Представление);
					contactDetails.Добавить(СтрукТелефон);	
				КонецЕсли;
			КонецЕсли;
			
			//EMAIL
			СтрукОтбораEMAIL = Новый Структура;
			СтрукОтбораEMAIL.Вставить("Вид",МассивВидовКИ[0]);
			СтрукОтбораEMAIL.Вставить("Тип",МассивТиповКИ[1]);
			МассEMAIL = КИСотрудника.НайтиСтроки(СтрукОтбораEMAIL);
			Если МассEMAIL.Количество() Тогда
				СтрукEMAIL = Новый Структура;
				СтрукEMAIL.Вставить("type","EMAIL");
				СтрукEMAIL.Вставить("value",МассEMAIL[0].Представление);
				contactDetails.Добавить(СтрукEMAIL);
			КонецЕсли;
		КонецЕсли;
		
		//Табельный номер
		Если ЗначениеЗаполнено(ТабНомер) Тогда
			СотрудникСКУДСтрук.Вставить("tabId",ТабНомер);
		КонецЕсли;
		//22.05.24 )
		
		Попытка
			
			ОтветСотрудник = ИКТ_SigurApi.Отправить("employees",,СотрудникСКУДСтрук);
			Если ТипЗнч(ОтветСотрудник) = Тип("Число") Тогда
				ВызватьИсключение("Ошибка при отправке данных сотрудника "+ФИО+". Сотрудник в СКУД не создан! Код ошибки: "+ОтветСотрудник);
			Иначе
				НоваяЗапись.IDСотрудника = ОтветСотрудник.id;
				НоваяЗапись.Записать();
			КонецЕсли;
			
		Исключение
			ЗаписьЖурналаРегистрации("Регистрация сотрудника СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
		КонецПопытки;
	Иначе
		ЗаписьЖурналаРегистрации("Регистрация сотрудника СКУД",УровеньЖурналаРегистрации.Ошибка,,"Нет кода подразделения сотрудника "+ФИО+". Сотрудник в СКУД не создан!");
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить список пропусков из файла
// Получает набор пропусков: идентификатор - ФИО.
// Возвращаемое значение:
// СтрукСтрок - Структура 
//
Функция ПолучитьСписокПропусковИзФайла()
	
	//Обработка через Excel
	//Читаем excel документ
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(Константы.ИКТ_ПутьКФайлуСПропусками.Получить()+".xls", СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецПопытки;
	
	//Переводим Табличный документ в ТЗ
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИдентификаторКарты",Новый ОписаниеТипов("Строка"));
	//ТЗ.Колонки.Добавить("ФИ",Новый ОписаниеТипов("Строка"));
	
	//Определяем количество строк
	КоличествоПропусков = Число(СтрРазделить(ТабДок.ПолучитьОбласть("R" + Формат(4, "ЧГ=0") + "C" + 11).ТекущаяОбласть.Текст,"")[0]);
	//8 - строка с которой начинаются считаться пропуска
	КолСтр = 8+КоличествоПропусков-1;
	//Для "Wiegand 34 НомерКолонкиПропуска = 9 
	НомерКолонкиПропуска = 9;
	//НомерКолонкиФамилия = 14;
	//НомерКолонкиИмя = 15;
	Для Сч = 8 по КолСтр Цикл
		Попытка
			ТБ = ТЗ.Добавить();
			//Обращаемся к ячейки и забираем данные
			ТБ.ИдентификаторКарты = Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + НомерКолонкиПропуска).ТекущаяОбласть.Текст);		
			//Фамилия = Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + НомерКолонкиФамилия).ТекущаяОбласть.Текст);
			//Имя = Строка(ТабДок.ПолучитьОбласть("R" + Формат(Сч, "ЧГ=0") + "C" + НомерКолонкиИмя).ТекущаяОбласть.Текст);	
			//ТБ.ФИ = Фамилия+" "+Имя; 
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось загрузить строку "+Строка(Сч);
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	Возврат ТЗ 
		
КонецФункции

// Процедура - Создать пропуск для сотрудника
// Создаёт пропуск в ЗУП и СКУД
// Параметры:
//  ПропускаСотрудника	Пропуска - Массив - массив пропусков сотрудника из файла с пропусками
//  Сотрудник			Сотрудник - СправочникСсылка.Сотрудники - Ссылка на сотрудника из справочника Сотрудники
//  IDСотрудника		Id сотрудника - Строка - Id сотрудника из СКУД
//
Процедура СоздатьПропускДляСотрудника(ЗначениеПропуска,Сотрудник,IDСотрудника) Экспорт
	
	СтрукПропуска = Новый Структура;
	//Формат карты шестнадцатеричный
	СтрукПропуска.Вставить("value",ЗначениеПропуска);
	//Формат карты - идентификатор W26
	//СтрукПропуска.Вставить("format","W34");
	СтрукПропуска.Вставить("format","W26");
	
	Попытка
		Ответ = ИКТ_SigurApi.Отправить("cards",,СтрукПропуска);
		Если ТипЗнч(Ответ) = Тип("Число") Тогда
			ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник,"Наименование");
			ВызватьИсключение("СКУД вернул код ошибки: "+Ответ+". Пропуск по сотруднику "+ФИО+" в СКУД не создан!");
		Иначе
			IDКарты = Ответ.id;
		КонецЕсли;
		
		СтрукПривязки = Новый Структура;
		СтрукПривязки.Вставить("employeeId",IDСотрудника);
		СтрукПривязки.Вставить("cardId",IDКарты);
		//Формат карты - идентификатор W26
		//СтрукПривязки.Вставить("format","W34");
		СтрукПривязки.Вставить("format","W26");
		МассивПривязки = Новый Массив;
		МассивПривязки.Добавить(СтрукПривязки);
		
		ОтветПривязка = ИКТ_SigurApi.Отправить("bindings/employees-cards",,МассивПривязки);
		Если ОтветПривязка = 204 Тогда
			НаборЗаписей = РегистрыСведений.ИКТ_Пропуска.СоздатьНаборЗаписей();
			//НаборЗаписей.Отбор.IDПропуска.Установить(IDКарты);
			НаборЗаписей.Отбор.ЗначениеКарты.Установить(ЗначениеПропуска);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.IDПропуска = IDКарты;
			НоваяЗапись.ЗначениеКарты = ЗначениеПропуска;
			НоваяЗапись.Сотрудник = Сотрудник;
			НоваяЗапись.Действует = Истина;
			НаборЗаписей.Записать();
			ОбщегоНазначения.СообщитьПользователю("Пропуск выдан сотруднику.");
		ИначеЕсли Ответ = 422 Тогда
			ЗаписьЖурналаРегистрации("Регистрация пропуска СКУД",УровеньЖурналаРегистрации.Информация,,"Привязка карты к сотруднику уже была создана");
			ОбщегоНазначения.СообщитьПользователю("Привязка карты к сотруднику уже была создана");
		Иначе
			ВызватьИсключение("СКУД вернул код ошибки: "+Ответ+". Привязка пропуска по сотруднику "+ФИО+" в СКУД не создана!");	
		КонецЕсли;
		
	Исключение
		ЗаписьЖурналаРегистрации("Регистрация пропуска СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Процедура - Отвязать пропуск от сотрудника
// Отвязываем пропуск от сотрудника в СКУД
// Параметры:
//  ЗначениеПропуска - Строка - Идентификатор физического пропуска
//  Сотрудник		 - СправочникСсылка.Сотрудники - Ссылка на сотрудника
//  IDСотрудника	 - Число - ID сотрудника в Сигур
//
Процедура ОтвязатьПропускОтСотрудника(ЗначениеПропуска,IDПропуска,Сотрудник,IDСотрудника) Экспорт
	СтрукПривязки = Новый Структура;
	СтрукПривязки.Вставить("employeeId",IDСотрудника);
	СтрукПривязки.Вставить("cardId",IDПропуска);
	//Формат карты - идентификатор W26
	//СтрукПривязки.Вставить("format","W34");
	СтрукПривязки.Вставить("format","W26");
	МассивПривязки = Новый Массив;
	МассивПривязки.Добавить(СтрукПривязки);
	
	Ответ = ИКТ_SigurApi.Отправить("bindings/employees-cards/delete",,МассивПривязки);
	Если Ответ = 204 Тогда
		НаборЗаписей = РегистрыСведений.ИКТ_Пропуска.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗначениеКарты.Установить(ЗначениеПропуска);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ЗначениеКарты = ЗначениеПропуска;
		НоваяЗапись.Сотрудник = Сотрудник;
		НоваяЗапись.IDПропуска = IDПропуска;
		НоваяЗапись.Действует = Ложь;
		НаборЗаписей.Записать();
		ОбщегоНазначения.СообщитьПользователю("Пропуск для сотрудника заблокирован");
	ИначеЕсли Ответ = 422 Тогда
		ЗаписьЖурналаРегистрации("Регистрация пропуска СКУД",УровеньЖурналаРегистрации.Информация,,"Привязка карты к сотруднику уже была создана");
		ОбщегоНазначения.СообщитьПользователю("Привязка карты к сотруднику уже была создана");
	Иначе
		ЗаписьЖурналаРегистрации("Регистрация пропуска СКУД",УровеньЖурналаРегистрации.Ошибка,,"СКУД вернул код ошибки: "+Ответ+". Привязка пропуска по сотруднику в СКУД не создана!");
		ОбщегоНазначения.СообщитьПользователю("СКУД вернул код ошибки: "+Ответ+". Привязка пропуска по сотруднику в СКУД не создана!");	
	КонецЕсли;
КонецПроцедуры

// Функция - Проверить актуальность данных
// Проверяет является ли самым последним по времени регистрации Кадровый документ
// Параметры:
//  Сотрудник				Сотрудник - СправочникСсылка.Сотрудники - Сотрудник документа
//  ДатаДокументаИсточника	Дата документа - Дата - Дата документа по которому получаем данные
//  ВидСобытия				Вид события - Перечисления.ВидыКадровыхСобытий - Прием, Перемещение, Увольнение
// 
// Возвращаемое значение:
//   Булево 
//
Функция ПроверитьАктуальностьДанных(Сотрудник, ДатаДокументаИсточника,ВидСобытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДляПодбораСотрудников.Начало КАК Начало,
	|	ДанныеДляПодбораСотрудников.ВидСобытия КАК ВидСобытия
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	|ГДЕ
	|	ДанныеДляПодбораСотрудников.Сотрудник.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начало УБЫВ";
	Запрос.УстановитьПараметр("Ссылка",Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ВидСобытия = ВидСобытия И НачалоДня(Выборка.Начало) = НачалоДня(ДатаДокументаИсточника) Тогда	
		Возврат Истина;
	ИначеЕсли Выборка.Начало <= ДатаДокументаИсточника Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция НайтиСотрудникаПоФизЛицу(ФизЛицо)

	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеДляПодбораСотрудников.Сотрудник.Ссылка КАК СотрудникСсылка
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	|ГДЕ
	|	ДанныеДляПодбораСотрудников.ФизическоеЛицо.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СотрудникСсылка; 
	
КонецФункции

// Функция - Получить связанные зоны и точки
// Получает все зоны и точки доступа по набору должность - зоны, подразделение - зоны
// Параметры:
//  Должность		Должность - СправочникСсылка.Должности - Должность сотрудника
//  Подразделение	Подразделение - СправочникСсылка.ПодразделенияОрганизаций - Подразделение сотрудника
// 
// Возвращаемое значение:
//  Таблица с набором зон и точек доступа - Таблица значений Или Неопределено 
//
Функция ПолучитьСвязанныеЗоныИТочки(Должность, Подразделение)

	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ЗоныДолжностей.Зона.Ссылка КАК Зона
	|ПОМЕСТИТЬ ЗоныДолжностейИПодразделений
	|ИЗ
	|	Справочник.ИКТ_ЗоныДолжностей КАК ИКТ_ЗоныДолжностей
	|ГДЕ
	|	ИКТ_ЗоныДолжностей.Должность.Ссылка = &СсылкаД
	|	И ИКТ_ЗоныДолжностей.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ИКТ_ЗоныДолжностей.Зона.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ИКТ_ЗоныДолжностей.Зона.ТочкиДоступа.Ссылка) > 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИКТ_ЗоныПодразделений.Зона.Ссылка
	|ИЗ
	|	Справочник.ИКТ_ЗоныПодразделений КАК ИКТ_ЗоныПодразделений
	|ГДЕ
	|	ИКТ_ЗоныПодразделений.Подразделение.Ссылка = &СсылкаП
	|	И ИКТ_ЗоныПодразделений.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ИКТ_ЗоныПодразделений.Зона.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ИКТ_ЗоныПодразделений.Зона.ТочкиДоступа.Ссылка) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИКТ_ЗоныДоступаТочкиДоступа.Ссылка КАК ЗонаДоступа,
	|	ИКТ_ЗоныДоступаТочкиДоступа.Точка КАК ТочкаДоступа
	|ИЗ
	|	ЗоныДолжностейИПодразделений КАК ЗоныДолжностейИПодразделений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИКТ_ЗоныДоступа.ТочкиДоступа КАК ИКТ_ЗоныДоступаТочкиДоступа
	|		ПО ЗоныДолжностейИПодразделений.Зона.Ссылка = ИКТ_ЗоныДоступаТочкиДоступа.Ссылка";
	Запрос.УстановитьПараметр("СсылкаД",Должность);
	Запрос.УстановитьПараметр("СсылкаП",Подразделение);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаТЧ = РезультатЗапроса.Выгрузить();
		ВыборкаТЧ.Свернуть("ЗонаДоступа,ТочкаДоступа");
		Возврат ВыборкаТЧ;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет зон и точек доступа по подразделению и должности!";
	    Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Подразделение,Должность)

	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_IDОбъектовСКУД.ID КАК ID
	|ИЗ
	|	РегистрСведений.ИКТ_IDОбъектовСКУД КАК ИКТ_IDОбъектовСКУД";
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.Текст = Запрос.Текст+"
	|ГДЕ
	|	ИКТ_IDОбъектовСКУД.Подразделение.Ссылка = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Иначе
		Запрос.Текст = Запрос.Текст+"
	|ГДЕ
	|	ИКТ_IDОбъектовСКУД.Должность.Ссылка = &Должность";
		Запрос.УстановитьПараметр("Должность",Должность);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ID
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции	

// Функция - Создать должность ВСКУД
// Создаёт должность в СКУД путём http запроса
// Параметры:
//  Должность	Должность - СправочникСсылка.Должности - Должность
// 
// Возвращаемое значение:
//   Ссылка на запись в справочнике ИКТ_IDОбъектовСКУД Или Неопределено 
//
Функция СоздатьДолжностьВСКУД(Должность)

	//Должность грузится из САП в СКУД
	Возврат Неопределено;
	
	НаименованиеДолжности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Должность,"Наименование");
	ДолжностьСтрук = Новый Структура;
	ДолжностьСтрук.Вставить("name",НаименованиеДолжности);
	
	Попытка
		ОтветДолжность = ИКТ_SigurApi.Отправить("positions",,ДолжностьСтрук);
		Если ТипЗнч(ОтветДолжность) = Тип("Число") Тогда
			ВызватьИсключение("Ошибка при отправке данных должности "+НаименованиеДолжности+". Должность в СКУД не создана! Код ошибки: "+ОтветДолжность);
		Иначе	
			НаборЗаписей = РегистрыСведений.ИКТ_IDОбъектовСКУД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Должность.Установить(Должность);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ID = ОтветДолжность.id;
			НоваяЗапись.Должность = Должность;
			НаборЗаписей.Записать();
			Возврат НоваяЗапись.ID;
		КонецЕсли;
	Исключение 
		ЗаписьЖурналаРегистрации("Регистрация должность СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
		Возврат Неопределено
	КонецПопытки;
	
КонецФункции

// Функция - Создать подразделение ВСКУД
//
// Параметры:
//  Подразделение	Подразделение - СправочникСсылка.ПодразделенияОрганизаций - Подразделение
// 
// Возвращаемое значение:
//   Ссылка на запись в справочнике ИКТ_IDОбъектовСКУД Или Неопределено 
//
Функция СоздатьПодразделениеВСКУД(Подразделение)

	//Подразделение грузится из САП в СКУД
	Возврат Неопределено;
	
	НаименованиеПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение,"Наименование");
	ПодразделениеСтрук = Новый Структура;
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение,"Родитель");
	Если ЗначениеЗаполнено(Родитель) Тогда
		parentId = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Родитель,Неопределено);
		parentId = ?(ЗначениеЗаполнено(parentId),parentId,СоздатьПодразделениеВСКУД(Подразделение));
		ПодразделениеСтрук.Вставить("parentId",parentId);
	Иначе //22.05.24 В Сигур есть подразделение ГН с ID = 7276. Под него грузим все подразделения без родителя
		ПодразделениеСтрук.Вставить("parentId",7276);
	КонецЕсли;
	ПодразделениеСтрук.Вставить("name",НаименованиеПодразделения);
	
	Попытка
		ОтветПодразделение = ИКТ_SigurApi.Отправить("departments",,ПодразделениеСтрук);
		Если ТипЗнч(ОтветПодразделение) = Тип("Число") Тогда
			ВызватьИсключение("Ошибка при отправке данных подразделения "+НаименованиеПодразделения+". Подразделение в СКУД не создано! Код ошибки: "+ОтветПодразделение);
		Иначе	
			НаборЗаписей = РегистрыСведений.ИКТ_IDОбъектовСКУД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Подразделение.Установить(Подразделение);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ID = ОтветПодразделение.id;
			НоваяЗапись.Подразделение = Подразделение;
			НаборЗаписей.Записать();
			Возврат НоваяЗапись.ID; 
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Регистрация подразделения СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
		Возврат Неопределено
	КонецПопытки;	
		
КонецФункции

// Процедура - Изменить подразделение или должность ВСКУД
// Меняет информацию о подразделении или должности в СКУД
// Параметры:
//  IDПодразделения	Id подразделения - Строка - Id подразделение СКУД
//  IDДолжности		Id должности - Строка - Id должности СКУД 
//
Процедура ИзменитьПодразделениеИлиДолжностьВСКУД(IDПодразделения=Неопределено,IDДолжности=Неопределено)

	//Меняется из САП в СКУД
	Возврат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИКТ_IDОбъектовСКУД.Подразделение КАК Подразделение,
	|	ИКТ_IDОбъектовСКУД.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.ИКТ_IDОбъектовСКУД КАК ИКТ_IDОбъектовСКУД
	|ГДЕ
	|	ИКТ_IDОбъектовСКУД.ID = &ID";
	ID = ?(ЗначениеЗаполнено(IDПодразделения),IDПодразделения,IDДолжности);
	Запрос.УстановитьПараметр("ID",ID);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(IDПодразделения) И Не ЗначениеЗаполнено(Выборка.Должность) Тогда
			Продолжить	
		ИначеЕсли Не ЗначениеЗаполнено(IDПодразделения) И ЗначениеЗаполнено(Выборка.Должность) Тогда
			ТелоЗапроса = Новый Структура;
			ТелоЗапроса.Вставить("name",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Должность,"Наименование"));
			ИКТ_SigurApi.Изменить("positions",IDДолжности,ТелоЗапроса);	
		ИначеЕсли ЗначениеЗаполнено(Выборка.Подразделение) Тогда
			ТелоЗапроса = Новый Структура;
			ТелоЗапроса.Вставить("name",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Подразделение,"Наименование"));
			ИКТ_SigurApi.Изменить("departments",IDПодразделения,ТелоЗапроса);	
		Иначе
			Продолжить
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция - Найти пропуск
// Ищет существующий пропуск в РС ИКТ_Пропуска
// Параметры:
//  CardValue	Значение пропуска - Строка - Значение пропуска в hex данных 
// 
// Возвращаемое значение:
//   ID пропуска - Строка или Неопределено 
//
Функция НайтиПропуск(CardValue)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_Пропуска.IDПропуска КАК IDПропуска
	|ИЗ
	|	РегистрСведений.ИКТ_Пропуска КАК ИКТ_Пропуска
	|ГДЕ
	|	ИКТ_Пропуска.ЗначениеКарты = &ЗначениеКарты";
	Запрос.УстановитьПараметр("ЗначениеКарты",CardValue);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.IDПропуска 
	КонецЕсли;
	
КонецФункции

// Функция - Изменить подразделение и должность сотрудника ВСКУД
// При записи кадрового перевода меняет подразделение и должность сотрудника в СКУД путём http запроса
// Параметры:
//  IDСотрудника	ID сотрудника - Строка - ID сотрудника СКУД
//  IDПодразделения	ID подразделения - Строка - ID подразделения СКУД
//  IDДолжности		ID Должности -	Строка - ID Должности СКУД 
// 
// Возвращаемое значение:
//   Булево 
//
Функция ИзменитьПодразделениеИДолжностьСотрудникаВСКУД(IDСотрудника,IDПодразделения,IDДолжности)
	
	//Меняется из САП в СКУД
	СтрукОтвета = Новый Структура;
	СтрукОтвета.Вставить("Выполнено",Истина);
	СтрукОтвета.Вставить("ПричинаОшибки","Меняется из САП в СКУД");
	Возврат СтрукОтвета;
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("departmentId",IDПодразделения);
	СтруктураЗапроса.Вставить("positionId",IDДолжности);
	
	СтрукОтвета = Новый Структура;
	Попытка
		Ответ = ИКТ_SigurApi.Изменить("employees",IDСотрудника,СтруктураЗапроса);
		Если ТипЗнч(Ответ) = Тип("Число") Тогда
			ВызватьИсключение("Ошибка изменения должности подразделения сотрудника ID: "+IDСотрудника+". Код ошибки: "+Ответ);
		КонецЕсли;
		СтрукОтвета.Вставить("Выполнено",Истина);
		Возврат СтрукОтвета
	Исключение
		ЗаписьЖурналаРегистрации("Изменение подразделения и должности СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
		СтрукОтвета.Вставить("Выполнено",Ложь);
		СтрукОтвета.Вставить("ПричинаОшибки",ОписаниеОшибки());
		Возврат СтрукОтвета 
	КонецПопытки;
	
КонецФункции

// Функция - Изменить статусы записи справочника доступ СКУД
// Изменение в таблице Статусы доступов
// Параметры:
//  НоваяЗаписьСправочникаСКУД	Элемент справочника ИКТ_ДоступСКУД - СправочникОбъект.ИКТ_ДоступСКУД - Элемент справочника полученный как объект
//  ВидДокументаСтрокой			Вид документа - Строка - вид документа строкой нижнего регистра, например "кадровый перевод" 
//  Источник					Документ источник - ДокументОбъект - Документ вызываемы в ИКТ_ПриЗаписиДанныхДляСКУДПриЗаписи 
// 
// Возвращаемое значение:
//  НоваяЗаписьСправочникаСКУД - СправочникОбъект.ИКТ_ДоступСКУД 
//
Функция ИзменитьСтатусыЗаписиСправочникаДоступСКУД(НоваяЗаписьСправочникаСКУД, Источник, Сотрудник) Экспорт

	ЗаключениеМедицинскогоОсмотра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяЗаписьСправочникаСКУД.Ссылка,"ЗаключениеМедицинскогоОсмотра");
	Если Константы.ИКТ_ИспользоватьЗаключениеМедицинскогоОсмотраСКУД.Получить() И ЗначениеЗаполнено(ЗаключениеМедицинскогоОсмотра) Тогда
		
		СтрокиТЧСтатусыМед = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.НайтиСтроки(Новый Структура("ДокументОснование",ЗаключениеМедицинскогоОсмотра));
		Если СтрокиТЧСтатусыМед.Количество() = 0 Тогда
			НоваяСтрокаСтатусы = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Добавить();
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаключениеМедицинскогоОсмотра,"РезультатОсмотра") =
				Перечисления.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания Тогда
				НоваяСтрокаСтатусы.Статус = Перечисления.ИКТ_СтатусыДоступаСКУД.НеДействует;
				НоваяСтрокаСтатусы.Комментарий = "Сотрудник имеет противопоказания";
				НоваяСтрокаСтатусы.ДокументОснование = ЗаключениеМедицинскогоОсмотра;
				АктуализироватьТЧСтатусыДоступа("Доступ сотруднику разрешен",НоваяЗаписьСправочникаСКУД);
			Иначе
				НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Очистить();
			КонецЕсли;
		Иначе
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаключениеМедицинскогоОсмотра,"РезультатОсмотра") =
				Перечисления.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания Тогда
				Если Не СтрокиТЧСтатусыМед[0].Комментарий = "Сотрудник имеет противопоказания" Тогда
					СтрокиТЧСтатусыМед[0].Статус = Перечисления.ИКТ_СтатусыДоступаСКУД.НеДействует;
					СтрокиТЧСтатусыМед[0].Комментарий = "Сотрудник имеет противопоказания";
					СтрокиТЧСтатусыМед[0].ДокументОснование = ЗаключениеМедицинскогоОсмотра;
					АктуализироватьТЧСтатусыДоступа("Доступ сотруднику разрешен",НоваяЗаписьСправочникаСКУД);
				КонецЕсли;
			Иначе
				НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Очистить();	
			КонецЕсли;
		КонецЕсли;
		НоваяЗаписьСправочникаСКУД = АктуализироватьТЧСтатусыДоступа("Нет документа медицинского заключения",НоваяЗаписьСправочникаСКУД);
	ИначеЕсли Константы.ИКТ_ИспользоватьЗаключениеМедицинскогоОсмотраСКУД.Получить() Тогда
		СтрокиТЧ = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.НайтиСтроки(Новый Структура("Комментарий","Нет документа медицинского заключения"));
		Если СтрокиТЧ.Количество() = 0 Тогда
			НоваяСтрокаСтатусы = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Добавить();
			НоваяСтрокаСтатусы.Статус = Перечисления.ИКТ_СтатусыДоступаСКУД.НеДействует;
			НоваяСтрокаСтатусы.Комментарий = "Нет документа медицинского заключения";
			НоваяСтрокаСтатусы.ДокументОснование = Неопределено;
			АктуализироватьТЧСтатусыДоступа("Доступ сотруднику разрешен",НоваяЗаписьСправочникаСКУД);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Увольнение") Или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
		СтрокиТЧСтатусы = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.НайтиСтроки(Новый Структура("ДокументОснование",Источник.Ссылка));	
		Если СтрокиТЧСтатусы.Количество() = 0 Тогда
			НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Очистить();
			НоваяСтрокаСтатусы = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Добавить();
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка,"Проведен") Тогда
				НоваяСтрокаСтатусы.Статус = Перечисления.ИКТ_СтатусыДоступаСКУД.Уволен;
				НоваяСтрокаСтатусы.Комментарий = "Имеется увольнение";
				НоваяСтрокаСтатусы.ДокументОснование = Источник.Ссылка;
			Иначе
				НоваяСтрокаСтатусы.Статус = Перечисления.ИКТ_СтатусыДоступаСКУД.Действует;
				НоваяСтрокаСтатусы.Комментарий = "Доступ сотруднику разрешен";
				СтрукКадровыхДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяЗаписьСправочникаСКУД.Ссылка,"ПриемНаРаботу,КадровыйПеревод",Истина);
				НоваяСтрокаСтатусы.ДокументОснование = ?(ЗначениеЗаполнено(СтрукКадровыхДокументов.КадровыйПеревод),
				СтрукКадровыхДокументов.КадровыйПеревод,
				СтрукКадровыхДокументов.ПриемНаРаботу);
			КонецЕсли;
		КонецЕсли;
	//Если есть все необходимые документы для доступа - определяем допуск по последнему документы приема/перевода
	ИначеЕсли НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Количество() = 0 Тогда
		НоваяСтрокаСтатусы = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Добавить();
		НоваяСтрокаСтатусы.Статус = Перечисления.ИКТ_СтатусыДоступаСКУД.Действует;
		НоваяСтрокаСтатусы.Комментарий = "Доступ сотруднику разрешен";
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КадровыйПеревод") 
		Или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КадровыйПереводСписком")
		Или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботу")
		Или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда
			ВидСобытия = ?(ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаПриема",Источник.Метаданные()),Перечисления.ВидыКадровыхСобытий.Прием,
			Перечисления.ВидыКадровыхСобытий.Перемещение); 
			Если ПроверитьАктуальностьДанных(Сотрудник,Источник.Дата,ВидСобытия) Тогда
				НоваяСтрокаСтатусы.ДокументОснование = Источник.Ссылка;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(НоваяЗаписьСправочникаСКУД.КадровыйПеревод) Тогда
			НоваяСтрокаСтатусы.ДокументОснование = НоваяЗаписьСправочникаСКУД.КадровыйПеревод;
		ИначеЕсли ЗначениеЗаполнено(НоваяЗаписьСправочникаСКУД.ПриемНаРаботу) Тогда
			НоваяСтрокаСтатусы.ДокументОснование = НоваяЗаписьСправочникаСКУД.ПриемНаРаботу;
		КонецЕсли;
	ИначеЕсли НоваяЗаписьСправочникаСКУД.СтатусыДоступа[0].Статус = Перечисления.ИКТ_СтатусыДоступаСКУД.Действует Тогда
		ВидСобытия = ?(ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаПриема",Источник.Метаданные()),Перечисления.ВидыКадровыхСобытий.Прием,
		Перечисления.ВидыКадровыхСобытий.Перемещение);
		Если ПроверитьАктуальностьДанных(Сотрудник,Источник.Дата,ВидСобытия) Тогда
			 НоваяЗаписьСправочникаСКУД.СтатусыДоступа[0].ДокументОснование = Источник.Ссылка;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат НоваяЗаписьСправочникаСКУД
	
КонецФункции

Функция АктуализироватьТЧСтатусыДоступа(Комментарий,НоваяЗаписьСправочникаСКУД)

	СтрокиТЧ = НоваяЗаписьСправочникаСКУД.СтатусыДоступа.НайтиСтроки(Новый Структура("Комментарий",Комментарий));	
	Если СтрокиТЧ.Количество() > 0 Тогда
		НоваяЗаписьСправочникаСКУД.СтатусыДоступа.Удалить(СтрокиТЧ[0]);		
	КонецЕсли;
	Возврат НоваяЗаписьСправочникаСКУД
	
КонецФункции

// Функция - Получить актуальное удостоверение сотрудника
// Возвращает ссылку на акутальное удостоверение сотрудника по ссылке сотрудника
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники - Ссылка на сотрудника
// 
// Возвращаемое значение:
//  Удостоверение - СправочникСсылка.ИКТ_Удостоверение Или Неопределено
//
Функция ПолучитьАктуальноеУдостоверениеСотрудника(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ДопускиКРаботеСрезПоследних.Удостоверение КАК Удостоверение
	|ИЗ
	|	РегистрСведений.ИКТ_ДопускиКРаботе.СрезПоследних(
	|			&ТекущаяДата,
	|			Сотрудник.Ссылка = &Сотрудник
	|				И (СрокДействия >= &ТекущаяДата
	|					И Период <= &ТекущаяДата)
	|				И Удостоверение.ВидУдостоверения.ТипДопуска.Ссылка = &ТипДопускаУдостоверение) КАК ИКТ_ДопускиКРаботеСрезПоследних";
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ТипДопускаУдостоверение",Справочники.ИКТ_ТипыДопуска.Удостоверение.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Удостоверение	
	КонецЕсли;
	
КонецФункции

// Процедура - Заблокировать сотрудника ВСКУД
//
// Параметры:
//  IDСотрудника - Число - ID сотрудника в СКУД
//
Процедура ЗаблокироватьСотрудникаВСКУД(IDСотрудника)
	Если Не ЗначениеЗаполнено(IDСотрудника) Или IDСотрудника = 0 Тогда
		Возврат
	КонецЕсли;
	
	Попытка
		ОтветБлокировкаДоступа = ИКТ_SigurApi.Соединиться("PUT","employees/"+Формат(IDСотрудника,"ЧГ=0")+"/block");
		Если ТипЗнч(ОтветБлокировкаДоступа) = Тип("Число") Тогда
			ВызватьИсключение("Ошибка блокировки сотрудника ID: "+IDСотрудника+". Код ошибки: "+ОтветБлокировкаДоступа);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Блокировка сотрудника в СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ДелегацияПроходаСлужебныеПроцедурыИФункции

Функция ПроверитьДопуск(Сотрудник, ГруппаДопускаЗоныДоступа)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ДопускиКРаботеСрезПоследних.Удостоверение КАК Удостоверение
	|ИЗ
	|	РегистрСведений.ИКТ_ДопускиКРаботе.СрезПоследних(
	|			&ТекущаяДата,
	|			Сотрудник.Ссылка = &Сотрудник
	|				И ГруппаДопуска.ЧисловоеПредставление >= &ЧисловоеПредставлениеГруппыДопускаЗоны
	|				И (СрокДействия >= &ТекущаяДата
	|					И Период <= &ТекущаяДата)
	|				И Удостоверение.ВидУдостоверения.ТипДопуска.Ссылка = &ТипДопускаУдостоверение) КАК ИКТ_ДопускиКРаботеСрезПоследних";
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ЧисловоеПредставлениеГруппыДопускаЗоны",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаДопускаЗоныДоступа,"ЧисловоеПредставление"));
	Запрос.УстановитьПараметр("ТипДопускаУдостоверение",Справочники.ИКТ_ТипыДопуска.Удостоверение.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь
	Иначе
		Возврат Истина
	КонецЕсли;
КонецФункции

Функция ТекущееВремяСовпадаетСоСменой(ГрафикРаботы)
	
	ТекущееВремя = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ГрафикиРаботыПоВидамВремени.Смена КАК Смена
	|ПОМЕСТИТЬ ДниРаботы
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы.Ссылка = &ГрафикРаботы
	|	И ГрафикиРаботыПоВидамВремени.Дата = &Дата
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СменыРаботыСотрудниковРасписание.ВремяНачала КАК ВремяНачала,
	|	СменыРаботыСотрудниковРасписание.ВремяОкончания КАК ВремяОкончания,
	|	СменыРаботыСотрудниковРасписание.ПереходящиеЧасы КАК ПереходящиеЧасы
	|ИЗ
	|	ДниРаботы КАК ДниРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СменыРаботыСотрудников.Расписание КАК СменыРаботыСотрудниковРасписание
	|		ПО ДниРаботы.Смена.Ссылка = СменыРаботыСотрудниковРасписание.Ссылка";
	Запрос.УстановитьПараметр("ГрафикРаботы",ГрафикРаботы);
	Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущееВремя));
	Запрос.УстановитьПараметр("Ссылка",Справочники.ВидыИспользованияРабочегоВремени.НайтиПоНаименованию("Явка"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь
	Иначе
		ДопустимоеОтклонение = Константы.ИКТ_ВремяОтклоненияОтГрафикаСотрудникаВМин.Получить()*60;
		
		//Обед = 25 час, далее в коде подменяется временем из 24 формата времени
		Обед = 25;
		Доступ = Ложь;
		НачалоТекущегоДня = НачалоДня(ТекущееВремя); 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПереходящиеЧасы = 0 Тогда
				
				Если (НачалоТекущегоДня + (Час(Выборка.ВремяНачала)*3600)) - ДопустимоеОтклонение <= ТекущееВремя И ТекущееВремя <= (НачалоТекущегоДня + (Час(Выборка.ВремяОкончания)*3600)) + ДопустимоеОтклонение Тогда
					Доступ = Истина;
					Прервать;
				//Время обеда	
				ИначеЕсли ТипЗнч(Обед) = Тип("Число") И Час(ТекущееВремя) >= Обед И (НачалоТекущегоДня + (Час(Выборка.ВремяНачала)*3600)) >= ТекущееВремя Тогда
						Доступ = Истина;
						Прервать;
				ИначеЕсли ТипЗнч(Обед) = Тип("Дата") И ТекущееВремя >= Обед И (НачалоТекущегоДня + (Час(Выборка.ВремяНачала)*3600)) >= ТекущееВремя Тогда
					Доступ = Истина;
					Прервать;
				Иначе
					Обед = НачалоТекущегоДня + (Час(Выборка.ВремяОкончания)*3600);
					Выборка.Следующий();
					//Время обеда
					Если ТекущееВремя >= Обед И НачалоТекущегоДня + (Час(Выборка.ВремяОкончания)*3600) >= ТекущееВремя Тогда
						Доступ = Истина;
					Прервать;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				СледующийДень = КонецДня(ТекущееВремя) + 1;
				
				Если НачалоТекущегоДня + (Час(Выборка.ВремяНачала)*3600) - ДопустимоеОтклонение <= ТекущееВремя Тогда
					Доступ = Истина;
					Прервать;
				ИначеЕсли ТекущееВремя <= СледующийДень + (Час(Выборка.ВремяОкончания)*3600) + ДопустимоеОтклонение Тогда
					Доступ = Истина;
					Прервать;
				ИначеЕсли Выборка.Количество() > 1 Тогда
					Если ТипЗнч(Обед) = Тип("Число") И Обед = Час(Выборка.ВремяОкончания) Тогда 
						Выборка.Следующий();
						//Время обеда
						Если Час(ТекущееВремя) >= Обед И СледующийДень + (Час(Выборка.ВремяНачала)*3600) <= ТекущееВремя Тогда
							Доступ = Истина;
						Прервать;
						КонецЕсли;
					Иначе  
						Обед = СледующийДень + (Час(Выборка.ВремяОкончания)*3600); 
						Выборка.Следующий();
						//Время обеда
						Если ТекущееВремя >= Обед И СледующийДень + (Час(Выборка.ВремяНачала)*3600) <= ТекущееВремя Тогда
							Доступ = Истина;
						Прервать;	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		
		Возврат Доступ
	КонецЕсли;
	
КонецФункции	

Функция ТекущаяДатаСовпадаетСРаботойВВыходной(РаботаВВыходныеИПраздничныеДни,Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаботаВВыходныеИПраздничныеДни.Сотрудники КАК РаботаВВыходныеИПраздничныеДниСотрудники
	|ГДЕ
	|	РаботаВВыходныеИПраздничныеДниСотрудники.Дата = &Дата
	|	И РаботаВВыходныеИПраздничныеДниСотрудники.НеРаботал = ЛОЖЬ
	|	И РаботаВВыходныеИПраздничныеДниСотрудники.Сотрудник.Ссылка = &СсылкаСотрудник
	|	И РаботаВВыходныеИПраздничныеДниСотрудники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СсылкаСотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Ссылка",РаботаВВыходныеИПраздничныеДни);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь
	Иначе 
		Возврат Истина
	КонецЕсли;	
		
КонецФункции

Функция ЭтоТочкаВходаПредприятия(accessPoint)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ЗонаВходаНаПредприятие.Значение.ТочкиДоступа.(
	|		Точка.Код КАК Код
	|	) КАК Значение
	|ИЗ
	|	Константа.ИКТ_ЗонаВходаНаПредприятие КАК ИКТ_ЗонаВходаНаПредприятие";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Доступ = Ложь;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ВыборкаЗначениеКонстанты = Выборка.Значение.Выбрать();
		Пока ВыборкаЗначениеКонстанты.Следующий() Цикл	
			Если ВыборкаЗначениеКонстанты.Код = accessPoint Тогда 
				Доступ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат Доступ;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПолучитьДанныеSigurСлужебныеПроцедурыИФункции

Процедура ИзменитьЗоныДоступа(ОтветЗоныДоступа) Экспорт
	
	//Пометка на удаление недействительных зон (
	ЗапросЗоны = Новый Запрос;
	ЗапросЗоны.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ЗоныДоступа.Ссылка КАК Ссылка,
	|	ИКТ_ЗоныДоступа.Код КАК Код
	|ИЗ
	|	Справочник.ИКТ_ЗоныДоступа КАК ИКТ_ЗоныДоступа
	|ГДЕ
	|	ИКТ_ЗоныДоступа.ПометкаУдаления = ЛОЖЬ";
	ВыборкаЗоны = ЗапросЗоны.Выполнить().Выбрать();	
	Пока ВыборкаЗоны.Следующий() Цикл
		ЗонаСуществует = Ложь;
		Для Каждого СтрокаМассива Из ОтветЗоныДоступа Цикл
			Если СтрокаМассива.id = ВыборкаЗоны.Код Тогда
				ЗонаСуществует = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЗонаСуществует Тогда
			ЗонаНаУдаление = ВыборкаЗоны.Ссылка.ПолучитьОбъект();
			ЗонаНаУдаление.ПометкаУдаления = Истина;
			ЗонаНаУдаление.Записать();
		КонецЕсли;
	КонецЦикла;
	//Пометка на удаление недействительных зон )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИКТ_ЗоныДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ЗоныДоступа КАК ИКТ_ЗоныДоступа
	|ГДЕ
	|	ИКТ_ЗоныДоступа.Код = &Код";
	Для Каждого Строка Из ОтветЗоныДоступа Цикл
		Запрос.УстановитьПараметр("Код", Строка.id);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			НоваяЗапись = Справочники.ИКТ_ЗоныДоступа.СоздатьЭлемент();
			НоваяЗапись.Код = Строка.id;
			НоваяЗапись.Наименование = Строка.name;
			Для Каждого Стр Из Строка.accessPoints Цикл
				МассивСтрок = НоваяЗапись.ТочкиДоступа.НайтиСтроки(Новый Структура("Код",Стр.id));
				Если МассивСтрок.Количество() = 0 Тогда
					ТочкаДоступа = НоваяЗапись.ТочкиДоступа.Добавить();
					ТочкаДоступа.Точка = НайтиСсылкуНаТочкуДоступа(Стр.id);
					ТочкаДоступа.Код = Стр.id;	
					ТочкаДоступа.ТипПрохода = ?(Стр.direction="IN",Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход,Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход);
				КонецЕсли;
			КонецЦикла;
			НоваяЗапись.Записать();
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗД = Выборка.Ссылка.ПолучитьОбъект();
			ЗД.Наименование = Строка.name;
			ЗД.ПометкаУдаления = Ложь;
			
			ЗД.ТочкиДоступа.Очистить();
			Для Каждого Стр Из Строка.accessPoints Цикл
				ТочкаДоступа = ЗД.ТочкиДоступа.Добавить();
				ТочкаДоступа.Точка = НайтиСсылкуНаТочкуДоступа(Стр.id);
				ТочкаДоступа.Код = Стр.id;	
				ТочкаДоступа.ТипПрохода = ?(Стр.direction="IN",Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход,Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход);
			КонецЦикла;	
			ЗД.Записать();
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ИзменитьТочкиДоступа(ОтветТочкиДоступа) Экспорт
	
	//Пометка на удаление недействительных точек (
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ТочкиДоступа.Ссылка КАК Ссылка,
	|	ИКТ_ТочкиДоступа.Код КАК Код
	|ИЗ
	|	Справочник.ИКТ_ТочкиДоступа КАК ИКТ_ТочкиДоступа
	|ГДЕ
	|	ИКТ_ТочкиДоступа.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТочкаСуществует = Ложь;
		Для Каждого СтрокаМассива Из ОтветТочкиДоступа Цикл
			Если СтрокаМассива.id = Выборка.Код Тогда
				ТочкаСуществует = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ТочкаСуществует Тогда
			ТочкаНаУдаление = Выборка.Ссылка.ПолучитьОбъект();
			ТочкаНаУдаление.ПометкаУдаления = Истина;
			ТочкаНаУдаление.Записать();	
		КонецЕсли;
	КонецЦикла;
	//Пометка на удаление недействительных точек )
	
	Для Каждого Строка Из ОтветТочкиДоступа Цикл
		ТочкаДоступаСсылка = НайтиСсылкуНаТочкуДоступа(Строка.id);
		Если ТочкаДоступаСсылка = Неопределено Тогда
			НоваяЗапись = Справочники.ИКТ_ТочкиДоступа.СоздатьЭлемент();
			НоваяЗапись.Код = Строка.id;
			НоваяЗапись.Наименование = Строка.name;
			НоваяЗапись.Записать();
		Иначе
			ТД = ТочкаДоступаСсылка.ПолучитьОбъект();
			ТД.Наименование = Строка.name;
			ТД.ПометкаУдаления = Ложь;
			ТД.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСсылкуНаТочкуДоступа(id)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ТочкиДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ТочкиДоступа КАК ИКТ_ТочкиДоступа
	|ГДЕ
	|	ИКТ_ТочкиДоступа.Код = &Код";
	Запрос.УстановитьПараметр("Код", id);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка
	Иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции

Функция ID_ПоследнегоСобытия() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИКТ_СобытияПроходаСКУД.ID_Прохода КАК ID_Прохода
	|ИЗ
	|	РегистрСведений.ИКТ_СобытияПроходаСКУД КАК ИКТ_СобытияПроходаСКУД
	|
	|УПОРЯДОЧИТЬ ПО
	|	ID_Прохода УБЫВ";
	Рез = ОбменДаннымиСлужебный.РезультатЗапросаВСтруктуру(Запрос.Выполнить());
	Возврат ?(Рез = Неопределено,Неопределено,Формат(Рез.ID_Прохода,"ЧГ=0"));
КонецФункции

Процедура ЗаписатьТипыСобытий(ОтветТипыСобытий) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("id",ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ТЗ.Колонки.Добавить("name",ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТЗ.Колонки.Добавить("description",ОбщегоНазначения.ОписаниеТипаСтрока(300));
	
	Для Каждого ТипСобытия Из ОтветТипыСобытий Цикл
		НоваяСтрока = ТЗ.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, ТипСобытия);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ТипыСобытийСКУД.Ссылка КАК Ссылка,
	|	ИКТ_ТипыСобытийСКУД.Наименование КАК Наименование,
	|	ИКТ_ТипыСобытийСКУД.id КАК id,
	|	ИКТ_ТипыСобытийСКУД.ОписаниеСобытия КАК ОписаниеСобытия
	|ИЗ
	|	Справочник.ИКТ_ТипыСобытийСКУД КАК ИКТ_ТипыСобытийСКУД";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ТЗВыборки = РезультатЗапроса.Выгрузить();
		Для Каждого СтрТЗ Из ТЗ Цикл
			МассивНайденныхСтрок = ТЗВыборки.НайтиСтроки(Новый Структура("id",СтрТЗ.id));
			Если МассивНайденныхСтрок.Количество() Тогда
				Если МассивНайденныхСтрок[0].Наименование <> СтрТЗ.name
				ИЛИ МассивНайденныхСтрок[0].ОписаниеСобытия <> СтрТЗ.description Тогда
					ОбъектСпр = МассивНайденныхСтрок[0].Ссылка.ПолучитьОбъект();
					ОбъектСпр.Наименование = СтрТЗ.name;
					ОбъектСпр.ОписаниеСобытия = СтрТЗ.description;
				КонецЕсли;	
			Иначе
				НоваяЗаписьСпр = Справочники.ИКТ_ТипыСобытийСКУД.СоздатьЭлемент();
				НоваяЗаписьСпр.id = СтрТЗ.id;
				НоваяЗаписьСпр.Наименование = СтрТЗ.name;
				НоваяЗаписьСпр.ОписаниеСобытия = СтрТЗ.description;
				НоваяЗаписьСпр.Записать();
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрТЗ Из ТЗ Цикл
			НоваяЗаписьСпр = Справочники.ИКТ_ТипыСобытийСКУД.СоздатьЭлемент();
			НоваяЗаписьСпр.id = СтрТЗ.id;
			НоваяЗаписьСпр.Наименование = СтрТЗ.name;
			НоваяЗаписьСпр.ОписаниеСобытия = СтрТЗ.description;
			НоваяЗаписьСпр.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция TimestampВДату(ДатаТС)
	Попытка
		Если ДатаТС = Неопределено Тогда
			ВызватьИсключение("Нет даты");
		КонецЕсли;
		МассДата = СтрРазделить(ДатаТС,"T");
		ВсяДата = МассДата[0];
		МассВремя = СтрРазделить(МассДата[1],"+");
		СтроковаяДата = ВсяДата+" "+МассВремя[0];
		СтроковаяДата = СтрЗаменить(СтроковаяДата , "-","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
		СтроковаяДата = СтрЗаменить(СтроковаяДата , " ","");
		Возврат Дата(СтроковаяДата);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
#КонецОбласти

#Область ОбработкаКадровыхПереводовДляСКУД

Процедура ОбработатьРС_ИКТ_ДанныеКадровыхДокументовДляСКУД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.Сотрудник КАК Сотрудник,
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.Должность КАК Должность,
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.Подразделение КАК Подразделение,
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.ГрафикРаботы КАК ГрафикРаботы,
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.КадровыйДокумент КАК КадровыйДокумент,
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД КАК ИКТ_ДанныеКадровыхДокументовДляСКУД
	|ГДЕ
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.Дата = &Дата";
	Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Пока Выборка.Следующий() Цикл
			ЗаписьСКУД = НайтиЗаписьСправочникаСКУД(Выборка.Сотрудник);
			Если Не ЗначениеЗаполнено(ЗаписьСКУД) Тогда
				Продолжить
			КонецЕсли;
			НоваяЗаписьСКУД = ЗаписьСКУД.ПолучитьОбъект();
			
			//Отправка в СКУД
			Если ТипЗнч(Выборка.КадровыйДокумент) = Тип("ДокументСсылка.КадровыйПеревод")
				Или	ТипЗнч(Выборка.КадровыйДокумент) = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда 
				Если ЗначениеЗаполнено(Выборка.Должность) Тогда 
					IdПодразделения = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Выборка.Подразделение,Неопределено);
					IdДолжности = НайтиПодразделениеИлиДолжностьВ_РС_ИКТ_IDОбъектовСКУД(Неопределено,Выборка.Должность);
					IDСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьСКУД,"IDСотрудника"); 
					ОтветСКУД = ИзменитьПодразделениеИДолжностьСотрудникаВСКУД(IDСотрудника,IDПодразделения,IDДолжности);
					Если ОтветСКУД.Выполнено Тогда
						//Запись в Справочник ИКТ_ДоступСКУД
						НоваяЗаписьСКУД.Должность = ?(ЗначениеЗаполнено(Выборка.Должность),Выборка.Должность,НоваяЗаписьСКУД.Должность);
						НоваяЗаписьСКУД.Подразделение = ?(ЗначениеЗаполнено(Выборка.Подразделение),Выборка.Подразделение,НоваяЗаписьСКУД.Подразделение); 
						//Изменение зон и точек доступа
						Если ЗначениеЗаполнено(Выборка.Должность) Тогда	
							СвязанныеЗоныИТочки = ПолучитьСвязанныеЗоныИТочки(Выборка.Должность, Выборка.Подразделение);
							Если СвязанныеЗоныИТочки <> Неопределено Тогда
								НоваяЗаписьСКУД.ЗоныИТочкиДоступа.Загрузить(СвязанныеЗоныИТочки);
							КонецЕсли;
						КонецЕсли;
						
						//Запись в РС ИКТ_ДанныеКадровыхДокументовДляСКУД
						НаборЗаписей = РегистрыСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.Сотрудник = Выборка.Сотрудник;
						НоваяЗапись.КадровыйДокумент = Выборка.КадровыйПеревод;
						НоваяЗапись.Дата = Выборка.Дата;
						НоваяЗапись.Обработано = Истина;
						НоваяЗапись.ПричинаОшибки = "";
						НоваяЗапись.Должность = ?(ЗначениеЗаполнено(Выборка.Должность),Выборка.Должность,Справочники.Должности.ПустаяСсылка());
						НоваяЗапись.Подразделение = ?(ЗначениеЗаполнено(Выборка.Подразделение),Выборка.Подразделение,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
						НоваяЗапись.ГрафикРаботы = ?(ЗначениеЗаполнено(Выборка.ГрафикРаботы),Выборка.ГрафикРаботы,Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка());
						НаборЗаписей.Записать();
					Иначе
						//Запись в РС необработанных записей
						НаборЗаписей = РегистрыСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.Сотрудник = Выборка.Сотрудник;
						НоваяЗапись.КадровыйДокумент = Выборка.КадровыйПеревод;
						НоваяЗапись.Дата = Выборка.Дата;
						НоваяЗапись.Обработано = Ложь;
						НоваяЗапись.ПричинаОшибки = ОтветСКУД.ПричинаОшибки;
						НоваяЗапись.Должность = ?(ЗначениеЗаполнено(Выборка.Должность),Выборка.Должность,Справочники.Должности.ПустаяСсылка());
						НоваяЗапись.Подразделение = ?(ЗначениеЗаполнено(Выборка.Подразделение),Выборка.Подразделение,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
						НоваяЗапись.ГрафикРаботы = ?(ЗначениеЗаполнено(Выборка.ГрафикРаботы),Выборка.ГрафикРаботы,Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка());
						НаборЗаписей.Записать();
					КонецЕсли;
				КонецЕсли;
				НоваяЗаписьСКУД.ГрафикРаботы = ?(ЗначениеЗаполнено(Выборка.ГрафикРаботы),Выборка.ГрафикРаботы,НоваяЗаписьСКУД.ГрафикРаботы);
				
			ИначеЕсли ТипЗнч(Выборка.КадровыйДокумент) = Тип("ДокументСсылка.Увольнение")
				Или	ТипЗнч(Выборка.КадровыйДокумент) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
				НоваяЗаписьСКУД.Увольнение = Выборка.КадровыйДокумент;
				//Запись в РС ИКТ_ДанныеКадровыхДокументовДляСКУД
				НаборЗаписей = РегистрыСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Сотрудник = Выборка.Сотрудник;
				НоваяЗапись.КадровыйДокумент = Выборка.КадровыйПеревод;
				НоваяЗапись.Дата = Выборка.Дата;
				НоваяЗапись.Обработано = Истина;
				НоваяЗапись.ПричинаОшибки = "";
				НоваяЗапись.Должность = ?(ЗначениеЗаполнено(Выборка.Должность),Выборка.Должность,Справочники.Должности.ПустаяСсылка());
				НоваяЗапись.Подразделение = ?(ЗначениеЗаполнено(Выборка.Подразделение),Выборка.Подразделение,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
				НоваяЗапись.ГрафикРаботы = ?(ЗначениеЗаполнено(Выборка.ГрафикРаботы),Выборка.ГрафикРаботы,Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка());
				НаборЗаписей.Записать();	
			КонецЕсли;
			НоваяЗаписьСКУД.Записать();
		КонецЦикла;
	КонецЕсли;
	
	//Очистка старых записей
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД КАК ИКТ_ДанныеКадровыхДокументовДляСКУД
	|ГДЕ
	|	ИКТ_ДанныеКадровыхДокументовДляСКУД.Дата <= &Дата";
	Запрос.УстановитьПараметр("Дата",ТекущаяДатаСеанса()-1209600);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьДанныеВ_РС_ИКТ_ДанныеКадровыхДокументовДляСКУД(КадровыйДокумент)
	
	Если ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.КадровыйПеревод")
	Или ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.Увольнение") Тогда
	
		Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"Сотрудник");
		Если ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.КадровыйПеревод") Тогда 
		   	Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"Должность");
			Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"Подразделение");
			ГрафикРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"ГрафикРаботы");
			ДатаНачалаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"ДатаНачала");
		ИначеЕсли ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.Увольнение") Тогда 
			Должность = Справочники.Должности.ПустаяСсылка();
			Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			ГрафикРаботы = Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка();
			ДатаНачалаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"ДатаУвольнения");
		КонецЕсли;	
		
		НаборЗаписей = РегистрыСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"Проведен") Тогда 
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Сотрудник = Сотрудник;
			НоваяЗапись.КадровыйДокумент = КадровыйДокумент;
			НоваяЗапись.Дата = ДатаНачалаДействия;
			НоваяЗапись.Обработано = Ложь;
			НоваяЗапись.Должность = ?(ЗначениеЗаполнено(Должность),Должность,Справочники.Должности.ПустаяСсылка());
			НоваяЗапись.Подразделение = ?(ЗначениеЗаполнено(Подразделение),Подразделение,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
			НоваяЗапись.ГрафикРаботы = ?(ЗначениеЗаполнено(ГрафикРаботы),ГрафикРаботы,Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка());
		КонецЕсли;
		НаборЗаписей.Записать();
			
	ИначеЕсли ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.КадровыйПереводСписком") 
	Или ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.УвольнениеСписком") Тогда 	
		Для Каждого Строка Из КадровыйДокумент.Сотрудники Цикл
			Если ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.УвольнениеСписком")
				И Строка.ДатаУвольнения <= ТекущаяДатаСеанса() Тогда
				Продолжить
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ИКТ_ДанныеКадровыхДокументовДляСКУД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сотрудник.Установить(Строка.Сотрудник);
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыйДокумент,"Проведен") Тогда 
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Сотрудник = Строка.Сотрудник;
				НоваяЗапись.КадровыйДокумент = КадровыйДокумент;
				НоваяЗапись.Обработано = Ложь;
				Если ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда 
					НоваяЗапись.Должность = ?(ЗначениеЗаполнено(Строка.Должность),Строка.Должность,Справочники.Должности.ПустаяСсылка());
					НоваяЗапись.Подразделение = ?(ЗначениеЗаполнено(Строка.Подразделение),Строка.Подразделение,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
					НоваяЗапись.ГрафикРаботы = ?(ЗначениеЗаполнено(Строка.ГрафикРаботы),Строка.ГрафикРаботы,Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка());
					НоваяЗапись.Дата = Строка.ДатаУвольнения;
				ИначеЕсли ТипЗнч(КадровыйДокумент) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
					НоваяЗапись.Должность = Справочники.Должности.ПустаяСсылка();
					НоваяЗапись.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
					НоваяЗапись.ГрафикРаботы = Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка();
					НоваяЗапись.Дата = Строка.ДатаУвольнения;
				КонецЕсли;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СобытияПроходаСлужебныеПроцедурыИФункции

Функция ПолучитьСотрудникаПоID(IDСотрудника)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИКТ_ДоступСКУД.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.ИКТ_ДоступСКУД КАК ИКТ_ДоступСКУД
	|ГДЕ
	|	ИКТ_ДоступСКУД.IDСотрудника = &IDСотрудника";
	Запрос.УстановитьПараметр("IDСотрудника",IDСотрудника);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка()
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Сотрудник 
	КонецЕсли;		
КонецФункции
#КонецОбласти