#Область ПрограммныйИнтерфейс

// См. упоПроектнаяПродукция.ПроектнаяПродукцияЕстьВПланеВыпуска
//
Функция ПроектнаяПродукцияЕстьВПланеВыпуска(Знач ПроектнаяПродукция, Знач ПроектнаяЗадача, Знач Версия) Экспорт
	
	Возврат упоПроектнаяПродукция.ПроектнаяПродукцияЕстьВПланеВыпуска(ПроектнаяПродукция, ПроектнаяЗадача, Версия);
	
КонецФункции //

// См. упоПроектнаяПродукция.ЕстьВыполненныйОбъемПоПроектнойПродукции
//
Функция ЕстьВыполненныйОбъемПоПроектнойПродукции(Знач ПроектнаяПродукция) Экспорт
	
	Возврат упоПроектнаяПродукция.ЕстьВыполненныйОбъемПоПроектнойПродукции(ПроектнаяПродукция);
	
КонецФункции

// См. упоПроектнаяПродукция.ЗаполнитьПланВыпускаПоПроектнойПродукции
//
Процедура ЗаполнитьПланВыпускаПоПроектнойПродукции(СтрокаСубпродукты, 
	МассивРаспределенияОбъемов, Версия = Неопределено, ЭтоШаблон = Ложь) Экспорт

	упоПроектнаяПродукция.ЗаполнитьПланВыпускаПоПроектнойПродукции(СтрокаСубпродукты, 
		МассивРаспределенияОбъемов, 
		Версия,
		ЭтоШаблон);	

КонецПроцедуры

// Сообщает пользователю ошибки заполнения распределения проектной продукции перед трансляцией в трудозатраты.
//
// Параметры:
//  ПроектнаяПродукция              - ДанныеФормыКоллекция - основная таблица проектной продукции.
//  СубпродуктыПоПодразделениям     - ДанныеФормыКоллекция - таблица распределения проектной продукции.
//  Отказ                           - Булево
//  ЭтоСтруктураПроекта             - Булево
//
Процедура ПроверитьЗаполнениеРаспределенияПроектнойПродукцииПередТрансляцией(Знач ПроектнаяПродукция, Знач РаспределениеПроектнойПродукции,
		Отказ, ЭтоСтруктураПроекта = Ложь) Экспорт
	
	Если ЭтоСтруктураПроекта Тогда
		ИмяТаблицыФормы = "СубпродуктыПоПодразделениям";
		ПутьКДанным = "";
	Иначе
		ИмяТаблицыФормы = "РаспределениеОбъемов";
		ПутьКДанным = "Объект";
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Не заполнено поле ""%1"" в строке №%2 распределения проектной продукции ""%3"". Трансляция трудозатрат невозможна.'");
	
	СССП_НДС = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС");
	Для Каждого Строка Из РаспределениеПроектнойПродукции Цикл
		
		Если Строка.СобствСилы_Субподряд = СССП_НДС Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИндексСтрокРаспределения", Строка.ИндексСтрокиВладельца);
		СтрокаВладелец = ПроектнаяПродукция.НайтиСтроки(ПараметрыОтбора)[0];
		НеЗаполненныеПоля = Новый Массив;
		
		Если Не ЗначениеЗаполнено(Строка.Роль) Тогда
			ИмяПоля = "Роль";
			НеЗаполненныеПоля.Добавить(ИмяПоля);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.Трудоемкость) Тогда
			ИмяПоля = "Трудоемкость";
			НеЗаполненныеПоля.Добавить(ИмяПоля);
		КонецЕсли;
		
		Для каждого НеЗаполненноеПоле Из НеЗаполненныеПоля Цикл
			ТекстСообщения = СтрШаблон(ШаблонСообщения, НеЗаполненноеПоле, Строка.ПолучитьИдентификатор() + 1, СтрокаВладелец.Ресурс);
			Поле = СтрШаблон("%1[%2].%3", ИмяТаблицыФормы, Строка.ПолучитьИдентификатор(), НеЗаполненноеПоле);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, ПутьКДанным, Отказ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет трансляцию трудозатрат проектной продукции на дубли.
//
// Параметры:
//  ТрудовыеРесурсы     - ДанныеФормыКоллекция, ТабличнаяЧасть
//  Отказ               - Булево
//  ЭтоСтруктураПроекта - Булево
//
Процедура СообщитьОшибкиТрансляцииПроектнойПродукции(Знач ТрудовыеРесурсы, Отказ, ЭтоСтруктураПроекта = Ложь) Экспорт
	
	ОшибкиПроектнойПродукции = Неопределено;
	
	ОбработанныеРесурсыОбъемов = Новый Соответствие;
	ИсточникОбъемы = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаТрудозатратРолей.Объемы");
	
	ШаблонОшибки = нСтр("ru='Для транслируемого из проектной продукции ресурса ""%1"" в строке №%2 уже указаны трудозатраты по подразделению ""%3"".'", "ru");
	
	Для Каждого СтрокаТрудовойРесурс Из ТрудовыеРесурсы Цикл
		
		Если СтрокаТрудовойРесурс.ИсточникПлана <> ИсточникОбъемы Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбработанныеРесурсыОбъемов[СтрокаТрудовойРесурс.Ресурс] = Неопределено Тогда
			ОбработанныеРесурсыОбъемов.Вставить(СтрокаТрудовойРесурс.Ресурс, СтрокаТрудовойРесурс.Подразделение);
		Иначе
			Если ЭтоСтруктураПроекта Тогда
				ИмяТаблицыТрудозатрат = "ТрудовыеРесурсыРоли";
				НомерСтроки = ТрудовыеРесурсы.Индекс(СтрокаТрудовойРесурс) + 1;
			Иначе
				ИмяТаблицыТрудозатрат = "ТрудовыеРесурсы";
				НомерСтроки = СтрокаТрудовойРесурс.НомерСтроки;
			КонецЕсли;
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, 
				СтрокаТрудовойРесурс.Ресурс, НомерСтроки, ОбработанныеРесурсыОбъемов[СтрокаТрудовойРесурс.Ресурс]);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПроектнойПродукции,
				ИмяТаблицыТрудозатрат + "[%1].Ресурс",
				ТекстОшибки, 
				ИмяТаблицыТрудозатрат,
				НомерСтроки,
				ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиПроектнойПродукции, Отказ);
	
КонецПроцедуры

// См. имя метода.
//
// Параметры:
//  ПроектнаяПродукция     - СправочникСсылка.упоПроектнаяПродукция
// 
// Возвращаемое значение:
//  ЭтоШаблон - Булево
//
Функция ЭтоШаблонПроектнойПродукции(ПроектнаяПродукция) Экспорт
	
	ЭтоШаблон = Ложь;
	
	Если Не ЗначениеЗаполнено(ПроектнаяПродукция) Тогда
		Возврат ЭтоШаблон;
	КонецЕсли;
	
	ЭтоШаблон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяПродукция, "Шаблон");
	Возврат ЭтоШаблон;
	
КонецФункции

#КонецОбласти