////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки УправлениеНашейИнжиниринговойФирмой.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область СведенияОБиблиотекеИлиКонфигурации

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                  Обработчики обновления таких библиотек должны быть вызваны ранее
//                                  обработчиков обновления данной библиотеки.
//                                  При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                  порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                  в процедуре ПриДобавленииПодсистем общего модуля
//									ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "УправлениеПроектнойФирмой";
	Описание.Версия = "3.0.9.137";
	Описание.ИдентификаторИнтернетПоддержки = "SmallBusinessPM";
	Описание.Вставить("ОсновнаяПодсистема", упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновленияИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список.
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУПФ.ПереносТиповыхПрофилейГруппДоступаВПапкуУправлениеПроектами"; 

	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.0.0.1";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "упоИнтеграцияУПФСервер.НачальноеЗаполнение";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "1.6.23.88";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУПФ.ПереносДанныхДокументаЗаказПоставщкуИзРеквизитаУпоПроектнаяЗадачаВПроект";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "3.0.1.230";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУПФ.УстановитьВариантОтображенияСообщенийОбОшибках";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.179";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУПФ.ОбновитьПредопределенныеПравилаПолученияФакта_302179";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7b76b09e-c572-4b44-8159-cbe6222e7ea8");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление правил получения факта проектного бюджетирования из поставляемых макетов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "3.0.5.191";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУПФ.ДобавитьВДополнительнуюГруппуДоступаПрофиль";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Версия = "3.0.6.127";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура = 
		"ОбновлениеИнформационнойБазыУПФ.ВключитьИспользованиеПредопределенныхДополнительныхРеквизитов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.137";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыУПФ.ОбновитьПредопределенныеПравилаПолученияФакта_309137";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("73a3e17c-1f77-40cc-9bed-82db03b5c83e");
	Обработчик.Комментарий = 
		НСтр("ru = 'Обновление правил получения факта проектного бюджетирования из поставляемых макетов.'");
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
			
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//									ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список.
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        	Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации,
//			следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт 	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Перенос типовых профилей групп доступа РМ в папку "Управление проектами"
Процедура ПереносТиповыхПрофилейГруппДоступаВПапкуУправлениеПроектами(Параметры = Неопределено) Экспорт
	
	МассивПрофилейГруппДоступа = Новый Массив;
	РодительСсылка = Справочники.ПрофилиГруппДоступа.упоУправлениеПроектами; 
	
	СтруктураГруппИПрофилей = упоИнтеграция.ПолучитьСтруктуруТиповыхГруппИПрофилей();
	
	Для Каждого КлючЗначение Из СтруктураГруппИПрофилей Цикл
		МассивПрофилейГруппДоступа.Добавить(СтруктураГруппИПрофилей[КлючЗначение.Ключ]);	
	КонецЦикла;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СписокТиповыхПрофилей", МассивПрофилейГруппДоступа);
	Запрос.УстановитьПараметр("Родитель", РодительСсылка);
  	Запрос.Текст = 	"ВЫБРАТЬ
  	               	|	ПрофилиГруппДоступа.Ссылка КАК Ссылка
  	               	|ИЗ
  	               	|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
  	               	|ГДЕ
  	               	|	ПрофилиГруппДоступа.ИмяПредопределенныхДанных В(&СписокТиповыхПрофилей)
  	               	|	И ПрофилиГруппДоступа.Предопределенный
  	               	|	И НЕ ПрофилиГруппДоступа.ЭтоГруппа
  	               	|	И ПрофилиГруппДоступа.Родитель <> &Родитель";    
	
	Результат = Запрос.Выполнить();	
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;                   
		
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Родитель = РодительСсылка;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

// Перенос данных документа "Заказ поставзику" из реквизита "упоПроектнаяЗадача" в реквизит "Проект"
Процедура ПереносДанныхДокументаЗаказПоставщкуИзРеквизитаУпоПроектнаяЗадачаВПроект(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	ЗаказПоставщику.Ссылка КАК Ссылка,
					|	ЗаказПоставщику.упоПроектнаяЗадача КАК упоПроектнаяЗадача
					|ИЗ
					|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
					|ГДЕ
					|	ЗаказПоставщику.упоПроектнаяЗадача <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";

	РезультатЗапроса = Запрос.Выполнить();	 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Проект = Выборка.упоПроектнаяЗадача;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла;
	
КонецПроцедуры

// Установка варианта отображения сообщений об ошибке, отличающегося от значения по умолчанию.
Процедура УстановитьВариантОтображенияСообщенийОбОшибках(Параметры = Неопределено) Экспорт
	
	ОбщиеНастройкиОбработкиОшибок = ОбработкаОшибок.ПолучитьОбщиеНастройки();
	ОбщиеНастройкиОбработкиОшибок.ВариантОтображенияСообщения = 
		ВариантОтображенияСообщенияОбОшибке.КраткоеПредставлениеОшибки;
	ОбработкаОшибок.УстановитьОбщиеНастройки(ОбщиеНастройкиОбработкиОшибок);
	
КонецПроцедуры

// Установка в предопределенную группу доступа "упоРаботаСПроектамиДополнительный"
// профиля группы доступа "упоРаботаСПроектамиДополнительный"
Процедура ДобавитьВДополнительнуюГруппуДоступаПрофиль(Параметры = Неопределено) Экспорт
	
	СправочникОбъект = Справочники.ГруппыДоступа["упоРаботаСПроектамиДополнительный"].ПолучитьОбъект();
	СправочникОбъект.Профиль = Справочники.ПрофилиГруппДоступа["упоРаботаСПроектамиДополнительный"];
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
КонецПроцедуры

// Установка признака "Используется" у предопределенных дополнительных реквизитов подсистемы РМ
Процедура ВключитьИспользованиеПредопределенныхДополнительныхРеквизитов(Параметры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	НаборыДополнительныхРеквизитовИСведений.Ссылка КАК Ссылка,
					|	НаборыДополнительныхРеквизитовИСведений.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
					|ИЗ
					|	Справочник.НаборыДополнительныхРеквизитовИСведений КАК НаборыДополнительныхРеквизитовИСведений
					|ГДЕ
					|	НаборыДополнительныхРеквизитовИСведений.Предопределенный";     
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Предопределенные наборы доп. реквизитов для объектов, которых нет в РМ Проф
	СтруктураИсключений = Новый Структура;          

	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		СтруктураИсключений.Вставить("Справочник_упоВидДоговора");  
		СтруктураИсключений.Вставить("Документ_упоСогласованиеТрудозатрат");
		СтруктураИсключений.Вставить("Документ_упоРегистрацияЮридическихУсловийДоговора");
		СтруктураИсключений.Вставить("Справочник_упоРискиПроектов");
		СтруктураИсключений.Вставить("Справочник_упоШаблоныРисковПроектов");
		СтруктураИсключений.Вставить("Документ_упоЗаявкаНаПроект");
		СтруктураИсключений.Вставить("Справочник_упоПравилаЗаполненияПараметров");
		СтруктураИсключений.Вставить("Справочник_упоПравилаФормированияНаименованийДоговоров");
		СтруктураИсключений.Вставить("Справочник_упоПроектнаяПродукция");
		СтруктураИсключений.Вставить("Документ_упоРасчетИтоговогоБаллаПроектов");
		СтруктураИсключений.Вставить("Документ_упоРасчетЦеныКонтракта");
		СтруктураИсключений.Вставить("Документ_упоРегистрацияПоказателейЭффективностиПроекта");
		СтруктураИсключений.Вставить("Справочник_упоСвязиОбъектовСистемыИФайлов");
		СтруктураИсключений.Вставить("Документ_упоСоответствиеСтратегическимЦелям");
		СтруктураИсключений.Вставить("Справочник_упоПрофилиНастроекПрогнозаТрудозатратПоРолям");
		СтруктураИсключений.Вставить("Справочник_упоСтатусыОбъектов");
		СтруктураИсключений.Вставить("Справочник_упоФазыПроектов");
		СтруктураИсключений.Вставить("Документ_упоФормированиеБизнесПлана");
		СтруктураИсключений.Вставить("Справочник_упоЭтапыДоговоров");   
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СтрНайти(Выборка.ИмяПредопределенныхДанных, "_упо") = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Используется = Истина;
		
		Если СтруктураИсключений.Свойство(Выборка.ИмяПредопределенныхДанных) Тогда
			Используется = Ложь;	
		КонецЕсли;
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Используется = Используется;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПравилаПолученияФакта

Процедура ОбновитьПредопределенныеПравилаПолученияФакта_302179(Параметры = Неопределено) Экспорт
	
	упоПроектноеБюджетированиеСервер.ОбновитьПредопределенныеПравилаПолученияФакта();
	
КонецПроцедуры

Процедура ОбновитьПредопределенныеПравилаПолученияФакта_309137(Параметры = Неопределено) Экспорт
	
	упоПроектноеБюджетированиеСервер.ОбновитьПредопределенныеПравилаПолученияФакта("УПФ_РасходыУслугиНЗП");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
