
#Область ОписаниеПеременных

&НаКлиенте	
Перем ПеременныеКлиента;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	упоАналитикаПоПодразделениямКлиент.УстановитьДоступностьДоговораИсполнителя(Объект.РаспределениеДоходныхОбъемов);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПрограммно(РежимЗаписи,Закрыть)
	
	Отказ = Ложь;
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи",РежимЗаписи);
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Объект.ДоходныеОбъемы.Количество() = 0 
		И Объект.РасходныеОбъемы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не введено ни одной строки в таблице ""Доходные объемы"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ДоходныеОбъемы",, Отказ);
		ТекстСообщения = НСтр("ru = 'Не введено ни одной строки в таблице ""Расходные объемы"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.РасходныеОбъемы",, Отказ);
	КонецЕсли;

	КлючиТаблиц = "ТаблицаВладелец,ТаблицаПодчиненная,ИмяКолонкиВладелец,ИмяКолонкиПодчиненная,ЕстьКоличество,ПредставлениеТаблицыРаспределения";
	ПараметрыТаблиц = Новый Массив;
	ПараметрыТаблиц.Добавить(Новый Структура(КлючиТаблиц,"ДоходныеОбъемы","РаспределениеДоходныхОбъемов","Сумма","Сумма",Истина,"'Доходные объемы'"));
	ПараметрыТаблиц.Добавить(Новый Структура(КлючиТаблиц,"РасходныеОбъемы","РаспределениеРасходныхОбъемов","Сумма","Сумма",Истина,"'Расходные объемы'"));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РежимЗаписи",РежимЗаписи);
	ДопПараметры.Вставить("Закрыть",Закрыть);

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьПрограммноЗавершение", ЭтотОбъект, ДопПараметры);
	
	упоАналитикаПоПодразделениямКлиент.ПроверитьРаспределениеПередЗаписью(Объект, ПараметрыТаблиц, Отказ, ОписаниеОповещения);
	
	Если Не Отказ Тогда
		ЗаписатьПрограммноЗавершение(Истина,ДопПараметры);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПрограммноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи",ДополнительныеПараметры.РежимЗаписи);
		
		Записать(ПараметрыЗаписи);
		Если ДополнительныеПараметры.Закрыть Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ, "");
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ТекущийОбъект.ЗаписыватьПроцентГотовности Тогда
		
		СтатусПроекта = упоПроектыИЗадачиСервер.ПолучитьСтатусПроекта(ТекущийОбъект.Проект);
		Если СтатусПроекта <> Перечисления.упоСостояниеСтатусаПроекта.Выполняется Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Для установки процента готовности необходимо, чтобы проект ""%1"" находился в статусе ""Выполняется"".'"),
				ТекущийОбъект.Проект);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманд
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "СменаНастроекУчетаПодразделений" Тогда
		УстановитьЗначенияИВидимостьПроектныхОпцийВДокументе();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Проект = Объект.Проект;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДоходныеОбъемы) Или ЗначениеЗаполнено(Объект.РасходныеОбъемы) Тогда
		ОписаниеОповещенияВопросОчисткиТаблицыЗавершение = 
			Новый ОписаниеОповещения("ВопросОчисткиТаблицыЗавершение", ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Данные таблиц будут очищены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещенияВопросОчисткиТаблицыЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		Объект.Проект = Проект;
		ОбработатьЗаполнениеПроекта();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура РегистрироватьПроектнуюПродукциюПриИзменении(Элемент)
	
	Объект.РегистрацияПроектнойПродукции = Не РегистрацияНоменклатуры;
	
	Если ЗначениеЗаполнено(Объект.ДоходныеОбъемы) Или ЗначениеЗаполнено(Объект.РасходныеОбъемы) Тогда
		ОписаниеОповещенияВопросОчисткиТаблицыЗавершение = 
			Новый ОписаниеОповещения("РегистрироватьПроектнуюПродукциюПриИзмененииЗавершение", ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Данные таблиц будут очищены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещенияВопросОчисткиТаблицыЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		Объект.Проект = Проект;
		ИзменитьЭлементыПриИзмененииППНоменклатура(ЭтотОбъект, Объект.РегистрацияПроектнойПродукции);
		ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоходныеОбъемы

&НаКлиенте
Процедура ДоходныеОбъемыНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ДоходныеОбъемыДанныеЗаполнения();
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ТекДанные);
	
	ДоходныеОбъемыНоменклатураПриИзмененииСервер(ДанныеЗаполнения);
	
	ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеЗаполнения, "ЕдиницаИзмерения, Стоимость, Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипСубпродукта = ТипСубпродуктаПоТипуРегистрации(Объект.РегистрацияПроектнойПродукции);
	
	ОпцииВыбора = упоРаботаСФормамиКлиент.КонструкторОпцииВыборПроектнойПродукции(Объект.Проект);

	упоРаботаСФормамиКлиент.УстановитьПараметрыВыбораРесурсаСубпродуктов(Элемент,
		ТипСубпродукта, ОпцииВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Сумма");
	
	ИмяТаблицы = "ДоходныеОбъемы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыСтоимостьПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСуммаПриИзменении(ТекДанные, "Стоимость");
	
	ИмяТаблицы = "ДоходныеОбъемы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	КоличествоСуммаПриИзменении(ТекДанные, "Количество");
	
	ИмяТаблицы = "ДоходныеОбъемы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПроектнаяЗадачаПроектОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанные.ПроектнаяЗадача = Неопределено;		
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПроектнаяЗадачаПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
			
	упоПроектыИЗадачиКлиент.УстановитьПараметрыВыбораПроектнойЗадачи(Элемент, 
													Объект.Проект, 
													ТекДанные.ПроектнаяЗадачаПроект, 
													СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ДоходныеОбъемы", "РаспределениеДоходныхОбъемов",,Истина) ;	

КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект, "ДоходныеОбъемы","РаспределениеДоходныхОбъемов",Копирование, Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "ДоходныеОбъемы", "РаспределениеДоходныхОбъемов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.ДоходныеОбъемы.ТекущиеДанные;	  
	           
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ДоходныеОбъемы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыПроектнаяЗадачаПроектПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДоходныеОбъемы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ДоходныеОбъемыДанныеЗаполнения();
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ТекДанные);
	
	ДоходныеОбъемыПроектнаяЗадачаПриИзмененииСервер(ДанныеЗаполнения); 
	
	ЗаполнитьЗначенияСвойств(ТекДанные,ДанныеЗаполнения, "ПроектнаяЗадача, Стоимость, Сумма");
			
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма,"ДоходныеОбъемы"); 
	ДоходныеОбъемыДоговорПриИзменении(Элемент);  
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходныеОбъемыДоговорПриИзменении(Элемент)
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма,"ДоходныеОбъемы"); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеДоходныхОбъемов

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовСобствСилы_СубподрядПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеДоходныхОбъемов", 
																						ИспользоватьАналитикуКонтрагентДляСС);

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеДоходныхОбъемов.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ДоходныеОбъемы", "РаспределениеДоходныхОбъемов",,Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ДоходныеОбъемы", "РаспределениеДоходныхОбъемов",,Истина) ;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.ДоходныеОбъемы, Отказ);	

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.ДоходныеОбъемы, Элементы.РаспределениеДоходныхОбъемов,Объект, НоваяСтрока, Копирование);	

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ДоходныеОбъемы", "РаспределениеДоходныхОбъемов",,Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ДоходныеОбъемы", "РаспределениеДоходныхОбъемов",,Истина) ;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовКоличествоПриИзменении(Элемент)
	 		
	упоАналитикаПоПодразделениямКлиент.ПересчитатьСуммуПоКоличеству(ЭтотОбъект, 
																	"ДоходныеОбъемы", 
																	"РаспределениеДоходныхОбъемов");	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовСуммаПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.ПересчитатьКоличествоПоДолеСуммы(ЭтотОбъект, 
																		"ДоходныеОбъемы", 
																		"РаспределениеДоходныхОбъемов", 
																		Объект.РаспределениеДоходныхОбъемов);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходныхОбъемовКонтрагентПодрядчикПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма,"РаспределениеДоходныхОбъемов","КонтрагентПодрядчик", "ЗаказДоговорПодрядчика"); 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходныеОбъемы

&НаКлиенте
Процедура РасходныеОбъемыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = упоЗаполнениеИПодборКлиент.ПолучитьЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Сумма");
	
	ИмяТаблицы = "РасходныеОбъемы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыСтоимостьПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Стоимость");
	
	ИмяТаблицы = "РасходныеОбъемы";	
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КоличествоСуммаПриИзменении(ТекДанные, "Количество");
	
	ИмяТаблицы = "РасходныеОбъемы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "РасходныеОбъемы", "РаспределениеРасходныхОбъемов");

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.РасходныеОбъемы.ТекущиеДанные;	  
	           
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "РасходныеОбъемы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "РасходныеОбъемы", "РаспределениеРасходныхОбъемов",,Истина) ;	
	
	мТекущаяСтрокаРасходныеОбъемы = Элемент.ТекущиеДанные;
	Если Не мТекущаяСтрокаРасходныеОбъемы  = Неопределено
		И мТекущаяСтрокаРасходныеОбъемы.Номенклатура = Неопределено Тогда
		
		мТекущаяСтрокаРасходныеОбъемы.Номенклатура = Элементы.РасходныеОбъемыНоменклатура.ОграничениеТипа.ПривестиЗначение(мТекущаяСтрокаРасходныеОбъемы.Номенклатура);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект, "РасходныеОбъемы","РаспределениеРасходныхОбъемов",Копирование, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыПроектнаяЗадачаПроектПриИзменении(Элемент)
	
	ТекДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанные.ПроектнаяЗадача = ДокументПЗПоПроектуПЗ(ТекДанные.ПроектнаяЗадачаПроект);
				
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыПроектнаяЗадачаПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
			
	упоПроектыИЗадачиКлиент.УстановитьПараметрыВыбораПроектнойЗадачи(Элемент, 
													Объект.Проект, 
													ТекДанные.ПроектнаяЗадачаПроект, 
													СтандартнаяОбработка);	

КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыПроектнаяЗадачаПроектОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.РасходныеОбъемы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанные.ПроектнаяЗадача = Неопределено;
		
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма,"РасходныеОбъемы"); 
	РасходныеОбъемыДоговорПриИзменении(Элемент);  
		
КонецПроцедуры

&НаКлиенте
Процедура РасходныеОбъемыДоговорПриИзменении(Элемент)
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма,"РасходныеОбъемы"); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеРасходныхОбъемов

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.РасходныеОбъемы, Отказ);	

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.РасходныеОбъемы, Элементы.РаспределениеРасходныхОбъемов,Объект, НоваяСтрока, Копирование);	

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "РасходныеОбъемы", "РаспределениеРасходныхОбъемов",,Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "РасходныеОбъемы", "РаспределениеРасходныхОбъемов",,Истина) ;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "РасходныеОбъемы", "РаспределениеРасходныхОбъемов",,Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "РасходныеОбъемы", "РаспределениеРасходныхОбъемов",,Истина) ;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеРасходныхОбъемов.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовСобствСилы_СубподрядПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеРасходныхОбъемов");

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовКоличествоПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.ПересчитатьСуммуПоКоличеству(ЭтотОбъект, 
																	"РасходныеОбъемы", 
																	"РаспределениеРасходныхОбъемов");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходныхОбъемовСуммаПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьКоличествоПоДолеСуммы(ЭтотОбъект, 
																		"РасходныеОбъемы", 
																		"РаспределениеРасходныхОбъемов", 
																		Объект.РаспределениеРасходныхОбъемов);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте	
Процедура КомандаКопироватьСтрокуВладельцаВРаспределение(Команда)
	
	Результат = НастройкиПоИмениКоманды(Команда.Имя);
	Если Результат = Неопределено Тогда
		Возврат; // Возврат
	КонецЕсли;

	ИмяОсновнойТаблицы		= Результат.ИмяОсновнойТаблицы;
	ИмяТаблицыРаспределения = Результат.ИмяТаблицыРаспределения;
	ИмяКолонкиСумма 		= Результат.ИмяКолонкиСумма;
	УчитыватьКоличество		= Результат.УчитыватьКоличество;
	
	упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределениеСОчисткой(ЭтаФорма, 
		ИмяОсновнойТаблицы, 
		ИмяТаблицыРаспределения, 
		ИмяКолонкиСумма, 
		УчитыватьКоличество);
	
КонецПроцедуры

&НаКлиенте	
Процедура КомандаЗаполнитьОбъемы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите проект'"), , "Проект");
		Возврат; // Возврат
	КонецЕсли;
	
	//
	
	Если Команда.Имя  = "ЗаполнитьДоходныеОбъемыПоТекущемуПлануБДР"
		Или Команда.Имя  = "ЗаполнитьРасходныеОбъемыПоТекущемуПлануБДР" Тогда
		
		ТаблицаОбъекта = ?(Команда.Имя  = "ЗаполнитьДоходныеОбъемыПоТекущемуПлануБДР", "ДоходныеОбъемы", "РасходныеОбъемы");
		ЗаполнитьПоТекущемуПлану(,ТаблицаОбъекта);
		
	ИначеЕсли Команда.Имя  = "ЗаполнитьДоходныеОбъемыОстатковОбъемов"
		Или Команда.Имя = "ЗаполнитьРасходныеОбъемыОстатковОбъемов" Тогда
		
		ТаблицаОбъекта = ?(Команда.Имя  = "ЗаполнитьДоходныеОбъемыОстатковОбъемов", "ДоходныеОбъемы", "РасходныеОбъемы");
		ЗаполнитьОстаткамиОбъемов(ТаблицаОбъекта);
		
	Иначе
		
		ЗаполнитьВыполненнойПроектнойПродукциейНаДату();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДоходныеОбъемы) Тогда
		Элементы.ДоходныеОбъемы.ТекущаяСтрока = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РасходныеОбъемы) Тогда
		Элементы.РасходныеОбъемы.ТекущаяСтрока = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыделитьНДС(Команда)
	
	Результат = НастройкиПоИмениКоманды(Команда.Имя);	
	Если Результат = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;	
	
	ИмяОсновнойТаблицы		= Результат.ИмяОсновнойТаблицы;
	ИмяТаблицыРаспределения = Результат.ИмяТаблицыРаспределения;
	ИмяКолонкиСумма 		= Результат.ИмяКолонкиСумма;
	УчитыватьКоличество		= Результат.УчитыватьКоличество;
			
	ТекущиеДанные = Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;		
	
	// Заполнение по умолчанию.
	СтрокиРаспределенияПоПодразделениям = упоПроектыИЗадачиОбщие.ПолучитьСтрокиРаспределенияПоПодразделениям(
																								ТекущиеДанные, 
																								Объект[ИмяТаблицыРаспределения], 
																								Истина);
	Если СтрокиРаспределенияПоПодразделениям.Количество() = 0 Тогда									
		упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределениеСОчисткой(ЭтаФорма, 
																							ИмяОсновнойТаблицы, 
																							ИмяТаблицыРаспределения, 
																							ИмяКолонкиСумма, 
																							УчитыватьКоличество);		
	КонецЕсли;					
	
	// НДС.
	СтрокаВладелец = Новый Структура;
	СтрокаВладелец.Вставить("Валюта", ТекущиеДанные.Валюта); 
	СтрокаВладелец.Вставить("Договор", ТекущиеДанные.Договор);
	СтрокаВладелец.Вставить("ИндексСтрокРаспределения", ТекущиеДанные.ИндексСтрокРаспределения);
	СтрокаВладелец.Вставить("Сумма", ТекущиеДанные[ИмяКолонкиСумма]);			
						
	ВыделитьНДС(СтрокаВладелец, ИмяОсновнойТаблицы);		
	
	// Итоги.
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, 
																		ИмяОсновнойТаблицы, 
																		ИмяТаблицыРаспределения, 
																		ИмяКолонкиСумма,
																		Истина);
			
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровестиИЗакрыть(Команда)
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровести(Команда)
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗаписать(Команда)
	ЗаписатьПрограммно(РежимЗаписиДокумента.Запись,Ложь);
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подготавливает доп. параметры структуры подбора.
//
// Параметры:
//  ПараметрыПодбораСтруктура	 - 	 - 
//  ИмяТЧ						 - 	 - 
//
&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ) Экспорт
	
	ПараметрыПодбораСтруктура= Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных =  ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("СтруктураСтрокиТЧ", Новый Структура);
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураСтрокиТЧ, ИмяТЧ);
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)

	// Перенести код в модуль с повторным использованием значений.
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическиВыполненногоОбъема.Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);
		
	Иначе 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическиВыполненногоОбъема.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства


#Область ПодключаемыеСтандартныйПериод
 
&НаКлиенте
Процедура Подключаемый_СтандартныйПериод_Значение_НачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Формирование сведений по элементу.
	ПериодПредставлениеИмя = "ПериодПредставление";
	
	ПериодЗначениеИмя = "ПериодЗначение";
	
	Значение   = ЭтаФорма[ПериодЗначениеИмя];
	ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц");
	
	НачалоПериода = Значение.ДатаНачала;
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ВидПериода, 
			НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса()) - 1);
	КонецЕсли;
	
	// Параметры для чтения из обработчиков.
	ПараметрыПериода = Новый Структура;
	// Для выбора значения.
	ПараметрыПериода.Вставить("Значение",               Значение);
	ПараметрыПериода.Вставить("Элемент",                Элемент);
	// Для загрузки значения.
	ПараметрыПериода.Вставить("ПериодПредставлениеИмя", ПериодПредставлениеИмя);
	ПараметрыПериода.Вставить("ПериодЗначениеИмя",      ПериодЗначениеИмя);
	ПараметрыПериода.Вставить("ВидПериода",             ВидПериода);
	
	ВыборПериодаИзВыпадающегоСписка(-1, ПараметрыПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаИзВыпадающегоСписка(Результат, ПараметрыПериода)
	
	Если Результат = Неопределено Тогда
		Возврат; // Отмена выбора.
	КонецЕсли;
	
	Если Результат = -1 Тогда // Начало выбора.
		// Чтение параметров для формирования списка из сохраненного значения периода.
		ПараметрыПериода.Вставить("НачалоПериода", ПараметрыПериода.Значение.ДатаНачала);
		ПараметрыПериода.Вставить("Вариант",       ПараметрыПериода.Значение.Вариант);
		ИндексНачальногоЗначения = Неопределено;
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("Структура") Тогда
		// Чтение параметров для формирования списка из выбранного значения.
		ПараметрыПериода.Вставить("НачалоПериода", Результат.Значение.НачалоПериода);
		ПараметрыПериода.Вставить("Вариант",       Результат.Значение.Вариант);
		ИндексНачальногоЗначения = Результат.Значение.ИндексНачальногоЗначения;
	Иначе
		// Загрузка результата выбора.
		ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыПериода);
		Возврат;
	КонецЕсли;
	
	// Формирование списка выбора.
		
	СписокПериодов = упоФункцииБСПКлиентСервер.СписокФиксированныхПериодов(
		ПараметрыПериода.НачалоПериода, ПараметрыПериода.ВидПериода);
	
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыПериода.НачалоПериода);
	КонецЕсли;
	
	ОписаниеНавигационногоЭлемента = Новый Структура;
	ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[0].Значение);
	ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
	ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 0);
	СписокПериодов[0].Значение = ОписаниеНавигационногоЭлемента;
	
	ОписаниеНавигационногоЭлемента = Новый Структура;
	ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода",            СписокПериодов[8].Значение);
	ОписаниеНавигационногоЭлемента.Вставить("Вариант",                  Неопределено);
	ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 8);
	СписокПериодов[8].Значение = ОписаниеНавигационногоЭлемента;
	
	Если Не ПараметрыПериода.Свойство("ВариантСтандартногоПериодаПоВиду") Тогда
		ПараметрыПериода.Вставить("ВариантСтандартногоПериодаПоВиду",
			ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"));
	КонецЕсли;
		
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	Если ПеременныеКлиента = Неопределено Тогда
		ПеременныеКлиента = Новый Структура;
	КонецЕсли;
		
	ПеременныеКлиента.Вставить("ВыборПериодаИзВыпадающегоСписка", Новый Структура);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ПараметрыВыбора", ПараметрыПериода);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("СписокПериодов", СписокПериодов);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ИндексНачальногоЗначения", ИндексНачальногоЗначения);
	Если Результат = -1 Тогда
		НачатьВыборПериодаИзВыпадающегоСписка();
	Иначе
		ПодключитьОбработчикОжидания("НачатьВыборПериодаИзВыпадающегоСписка", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыПериода)
	
	Значение = ПараметрыПериода.Значение;
	
	// Запись результата выбора в данные формы и пользовательские настройки КД.
	Если ТипЗнч(Результат.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		ЭтаФорма[ПараметрыПериода.ПериодПредставлениеИмя] = ?(ПустаяСтрока(Результат.Представление), Строка(Результат.Значение), Результат.Представление);
		Значение.Вариант = Результат.Значение;
	Иначе
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ПараметрыПериода.ВидПериода, Результат.Значение);
		КонецПериода  = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ПараметрыПериода.ВидПериода, Результат.Значение);
		
		ЭтаФорма[ПараметрыПериода.ПериодПредставлениеИмя] = Результат.Представление;
		
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Значение.ДатаНачала    = НачалоПериода;
		Значение.ДатаОкончания = КонецПериода;
	КонецЕсли;
	
	ЭтаФорма[ПараметрыПериода.ПериодЗначениеИмя] = Значение;
	Объект.ПериодРегистрации = Значение.ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСписка()
	Если ПеременныеКлиента.Свойство("ВыборПериодаИзВыпадающегоСписка") Тогда
		Контекст = ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка;
		ПеременныеКлиента.Удалить("ВыборПериодаИзВыпадающегоСписка");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыВыбора",Контекст.ПараметрыВыбора);
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыборПериодаИзВыпадающегоСпискаЗавершение",ЭтотОбъект,ДополнительныеПараметры); 
		ПоказатьВыборИзСписка(ОписаниеОповещения,Контекст.СписокПериодов, Контекст.ПараметрыВыбора.Элемент, Контекст.ИндексНачальногоЗначения);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСпискаЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт
	ВыборПериодаИзВыпадающегоСписка(ВыбранныйЭлемент, ДополнительныеПараметры.ПараметрыВыбора);	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПереключитьПериодИЕгоПредставление(ЭтаФорма)
		
	ВидПериодаИмя = "ПериодВид";
	
	ПериодЗначениеИмя       = "ПериодЗначение";
	ПериодПредставлениеИмя  = "ПериодПредставление";
	
	Значение = ЭтаФорма[ПериодЗначениеИмя];
	
	ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц");
		
	// Приведение значения периода в соответствие с выбранным видом.
	НачалоПериода = НачалоДня(Значение.ДатаНачала);
	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = НачалоДня(ПолучитьТекущуюДатуСеанса());
	КонецЕсли;
	
	НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ВидПериода, НачалоПериода);
	КонецПериода  = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ВидПериода, НачалоПериода);
		
	Значение.ДатаНачала    = НачалоПериода;
	Значение.ДатаОкончания = КонецПериода;
	
	
	Представление = упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(Значение, ВидПериода);
	ЭтаФорма[ПериодПредставлениеИмя] = Представление;
	ЭтаФорма[ПериодЗначениеИмя]      = Значение;

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначенияПериода(ЭтотОбъект, РегистрацияПП)
	
	Если РегистрацияПП Тогда
		ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц");
		Если ЗначениеЗаполнено(ЭтотОбъект.Объект.ПериодРегистрации) Тогда
			НеобходимыйПериод = ЭтотОбъект.Объект.ПериодРегистрации;
		Иначе
			НеобходимыйПериод = НачалоМесяца(ПолучитьТекущуюДатуСеанса()) - 1;
		КонецЕсли;
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ВидПериода, НеобходимыйПериод);
		КонецПериода = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ВидПериода, НеобходимыйПериод);
	Иначе
		НачалоПериода = '00010101';
		КонецПериода = НачалоПериода;
	КонецЕсли;
	
	ЭтотОбъект.Объект.ПериодРегистрации = НачалоПериода;
	ЭтотОбъект.ПериодЗначение.ДатаНачала = НачалоПериода;
	ЭтотОбъект.ПериодЗначение.ДатаОкончания = КонецПериода;
	
КонецПроцедуры

#КонецОбласти

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ИнициализацияФормы()
	
	ЗаполнитьОбработатьЗаполнениеРеквизитовФормы();
	
	УстановитьДоступКФинансовойИнформации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбработатьЗаполнениеРеквизитовФормы()
	
	Проект = Объект.Проект;
	ОбработатьЗаполнениеПроекта(Истина);
	
	//
	
	РегистрацияНоменклатуры = Не Объект.РегистрацияПроектнойПродукции;
	ИзменитьЭлементыПриИзмененииППНоменклатура(ЭтотОбъект, Объект.РегистрацияПроектнойПродукции);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступКФинансовойИнформации()
	
	ДоступКФинИнформации = упоРазграничениеДоступаВызовСервера.обДоступностьФинансовойИнформации();
	Если ДоступКФинИнформации = "Отсутствует" Тогда
		СкрытьФинансовуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьФинансовуюИнформацию()
	
	КолонкиСОграничениемДоступа = Новый Массив;
	
	ИмяТЧ = "ДоходныеОбъемы";
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Стоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Сумма");
	
	ИмяТЧ = "РаспределениеДоходныхОбъемов";
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Сумма");
		
	ИмяТЧ = "РасходныеОбъемы";
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Стоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Сумма");
	
	ИмяТЧ = "РаспределениеРасходныхОбъемов";
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Сумма");
	
	упоРазграничениеДоступаВызовСервера.УстановитьДоступККолонкамТабличнойЧасти(Элементы,
		КолонкиСОграничениемДоступа,
		"Отсутствует");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьВсеТабличныеЧасти(Объект)
	
	Объект.ДоходныеОбъемы.Очистить();
	Объект.РаспределениеДоходныхОбъемов.Очистить();
	Объект.РасходныеОбъемы.Очистить();
	Объект.РаспределениеРасходныхОбъемов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрироватьПроектнуюПродукциюПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Объект.Проект = Проект;
		Объект.РегистрацияПроектнойПродукции = РегистрацияНоменклатуры;
		РегистрацияНоменклатуры = Не РегистрацияНоменклатуры;
		Возврат;
	КонецЕсли;
	Объект.РегистрацияПроектнойПродукции = Не РегистрацияНоменклатуры;
	ОчиститьВсеТабличныеЧасти(Объект);
	ИзменитьЭлементыПриИзмененииППНоменклатура(ЭтотОбъект, Объект.РегистрацияПроектнойПродукции);
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчисткиТаблицыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Проект = Объект.Проект;
		Возврат;
	КонецЕсли;
	
	ОчиститьВсеТабличныеЧасти(Объект);
	
	Объект.Проект = Проект;
	ОбработатьЗаполнениеПроекта();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоТекущемуПлану(ТекВерсия = Неопределено, ТаблицаОбъекта)
		
	Если ТекВерсия = Неопределено Тогда
		ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	КонецЕсли;
	
	ЭтоДоход = (ТаблицаОбъекта = "ДоходныеОбъемы"); 
	
	Документы.упоРегистрацияФактическиВыполненногоОбъема.ЗаполнитьОбъектПоОснованию(
		Объект, ТекВерсия, ЭтоДоход, Не ЭтоДоход);
	
	Если ЗначениеЗаполнено(Объект.ДоходныеОбъемы) Тогда
		Элементы.ДоходныеОбъемы.ТекущаяСтрока = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РасходныеОбъемы) Тогда
		Элементы.РасходныеОбъемы.ТекущаяСтрока = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиОбъемов(ТаблицаОбъекта)
	
	ЭтоДоход = (ТаблицаОбъекта = "ДоходныеОбъемы"); 
	
	Документы.упоРегистрацияФактическиВыполненногоОбъема.ЗаполнитьОбъектПоОснованию(
		Объект, "ОстаткиОбъемов", ЭтоДоход, Не ЭтоДоход);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыполненнойПроектнойПродукциейНаДату()
	
	Документы.упоРегистрацияФактическиВыполненногоОбъема.ЗаполнитьОбъектПоОснованию(
		Объект, "ВыполненнаяПроектнаяПродукцияНаДату", Истина, Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста	
Процедура КоличествоСуммаПриИзменении(ТекущаяСтрока, ИзменяемаяКолонка)
	
	упоРаботаСФормамиКлиентСервер.КоличествоСуммаПриИзменении(ТекущаяСтрока, ИзменяемаяКолонка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьЭлементыПриИзмененииППНоменклатура(ЭтотОбъект, РегистрацияПП)
	
	Элементы = ЭтотОбъект.Элементы;
	
	ЭлементыВключитьВидимостьПП = Новый Массив;
	ЭлементыВключитьВидимостьПП.Добавить("ДоходныеОбъемыЗаполнитьДоходныеОбъемыОборотамиЗаПериод");
	ЭлементыВключитьВидимостьПП.Добавить("ПериодРегистрации");
	упоФункцииБСПКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ЭлементыВключитьВидимостьПП, "Видимость", РегистрацияПП);
	
	ЭлементыВыключитьВидимостьПП = Новый Массив;
	
	ЭлементыВыключитьВидимостьПП.Добавить("ДоходныеОбъемыЗаполнитьДоходныеОбъемыОстатковОбъемов");
	ЭлементыВыключитьВидимостьПП.Добавить("ДоходныеОбъемыЗаполнитьДоходныеОбъемыПоТекущемуПлануБДР");
	упоФункцииБСПКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ЭлементыВыключитьВидимостьПП, "Видимость", Не РегистрацияПП);
	
	УстановитьЗначенияПериода(ЭтотОбъект, РегистрацияПП);
	
	Если РегистрацияПП Тогда
		ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.упоПроектнаяПродукция");
		ЗаголовокНоменклатуры = НСтр("ru = 'Проектная продукция'");
		ПереключитьПериодИЕгоПредставление(ЭтотОбъект);
	Иначе
		ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		ЗаголовокНоменклатуры = НСтр("ru = 'Номенклатура'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДоходныеОбъемыНоменклатура", "ОграничениеТипа", ОграничениеТипа);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДоходныеОбъемыНоменклатура", "Заголовок", ЗаголовокНоменклатуры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияИВидимостьПроектныхОпцийВДокументе(ОткрытиеФормы = Ложь)
	
	СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	ИспользоватьАналитикуКонтрагентДляСС = СтруктураСвойств.ИспользоватьАналитикуКонтрагентДляСС;
	
	ДоходыПоНатуральнымПоказателям = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	РасходыПоНатуральнымПоказателям = СтруктураСвойств.РасходыПоНатуральнымПоказателям;
	
	Элементы.ДоходныеОбъемыНоменклатура.Видимость = ДоходыПоНатуральнымПоказателям;
	Элементы.ДоходныеОбъемыЕдиницаИзмерения.Видимость = ДоходыПоНатуральнымПоказателям;
	Элементы.ДоходныеОбъемыКоличество.Видимость = ДоходыПоНатуральнымПоказателям;
	Элементы.ДоходныеОбъемыСтоимость.Видимость = ДоходыПоНатуральнымПоказателям;
	
	Элементы.РаспределениеДоходныхОбъемовКоличество.Видимость = ДоходыПоНатуральнымПоказателям;
	
	Элементы.РасходныеОбъемыНоменклатура.Видимость = РасходыПоНатуральнымПоказателям;
	Элементы.РасходныеОбъемыЕдиницаИзмерения.Видимость = РасходыПоНатуральнымПоказателям;
	Элементы.РасходныеОбъемыКоличество.Видимость = РасходыПоНатуральнымПоказателям;
	Элементы.РасходныеОбъемыСтоимость.Видимость = РасходыПоНатуральнымПоказателям;
	
	Элементы.РаспределениеРасходныхОбъемовКоличество.Видимость = РасходыПоНатуральнымПоказателям;
	
	Если Не ОткрытиеФормы Тогда
		Объект.ЗаписыватьПроцентГотовности = СтруктураСвойств.РассчитыватьПроцентГотовностиПоФактическимДоходнымОбъемам; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере	
Процедура ДоходныеОбъемыПроектнаяЗадачаПриИзмененииСервер(ДанныеЗаполнения)
							
	ДанныеЗаполнения.ПроектнаяЗадача = ДокументПЗПоПроектуПЗ(ДанныеЗаполнения.ПроектнаяЗадачаПроект);
			
	ПроектнаяЗадачаНоменклатураПриИзмененииВДоходныхОбъемах(ДанныеЗаполнения);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ДокументПЗПоПроектуПЗ(ПроектнаяЗадачаПроект)
	
	ПроектнаяЗадача = Неопределено;
	Если ЗначениеЗаполнено(ПроектнаяЗадачаПроект) Тогда		
		ПроектнаяЗадача = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадачаПроект, "СсылкаНаПроектнуюЗадачу");			
	КонецЕсли;
		
	Возврат ПроектнаяЗадача;
	
КонецФункции

&НаСервереБезКонтекста 
Функция ЗаполнитьСтоимостьНоменклатуры(ПроектнаяЗадача, Номенклатура, ТекущаяВерсия)
	 
	 ЗапросСтоимости = Новый Запрос;
	 ЗапросСтоимости.Текст = "ВЫБРАТЬ
	                         |	ИсточникЦенНоменклатуры.Цена КАК Цена,
	                         |	ИсточникЦенНоменклатуры.Номенклатура КАК Номенклатура
	                         |ИЗ
	                         |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
	                         |			,
	                         |			Версия = &ТекущаяВерсия
	                         |				И ПроектнаяЗадача = &ПроектнаяЗадача
	                         |				И Номенклатура = &Номенклатура) КАК ИсточникЦенНоменклатуры
	                         |ГДЕ
	                         |	(ИсточникЦенНоменклатуры.Количество <> 0
	                         |			ИЛИ ИсточникЦенНоменклатуры.Сумма <> 0
	                         |			ИЛИ ИсточникЦенНоменклатуры.СуммаВалютная <> 0)";
	 
	 ЗапросСтоимости.УстановитьПараметр("ТекущаяВерсия", 	ТекущаяВерсия);
	 ЗапросСтоимости.УстановитьПараметр("ПроектнаяЗадача", 	ПроектнаяЗадача);
	 ЗапросСтоимости.УстановитьПараметр("Номенклатура", 	Номенклатура);
	 
	 Результат = ЗапросСтоимости.Выполнить();	 
	 
	 Если Не Результат.Пустой() Тогда
		 
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
		 
		 Возврат Выборка.Цена;
		 
	 Иначе
		 
		 Возврат 0;
		 
	 КонецЕсли;	

КонецФункции

&НаСервере
Процедура ВыделитьНДС(СтрокаВладелец, ИмяТаблицы)
			
	ПараметрыРаспределения = упоДоходыИРасходыСервер.ПараметрыВыделенияНДСВРаспределенииПоУмолчанию();
	ПараметрыРаспределения.Проект 		= Объект.Проект;
	ПараметрыРаспределения.СтавкаНДС 	= упоДоходыИРасходыСервер.ЗначениеСтавкиНДС(СтрокаВладелец.Договор, Объект.Проект);
	
	упоДоходыИРасходыСервер.ВыделитьНДСВРаспределении(Объект, 
													СтрокаВладелец, 
													ИмяТаблицы,
													, 
													ПараметрыРаспределения);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОсновнойТаблицыПоИмениКоманды(ИмяКоманды)
			
	Если ИмяКоманды = "ВыделитьНДСДоходныеОбъемы"
		Или ИмяКоманды = "ЗаполнитьПоВладельцуДоходныеОбъемы" Тогда				
		ИмяТаблицы = "ДоходныеОбъемы";										
	ИначеЕсли ИмяКоманды = "ВыделитьНДСРасходныеОбъемы"
		Или ИмяКоманды = "ЗаполнитьПоВладельцуРасходныеОбъемы" Тогда 	
		ИмяТаблицы = "РасходныеОбъемы";					
	Иначе
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Возврат ИмяТаблицы;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция ИменаТаблицРеквизитовПоИмениОсновнойТаблицы(ИмяОсновнойТаблицы)			
		
	ИмяКолонкиСумма = "Сумма";
	
	Если ИмяОсновнойТаблицы = "ДоходныеОбъемы" Тогда						
		ИмяТаблицыРаспределения = "РаспределениеДоходныхОбъемов";		
	ИначеЕсли ИмяОсновнойТаблицы = "РасходныеОбъемы" Тогда 			
		ИмяТаблицыРаспределения = "РаспределениеРасходныхОбъемов";
	Иначе
		Возврат Неопределено; // Возврат.
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицыРаспределения", 	ИмяТаблицыРаспределения);
	Результат.Вставить("ИмяКолонкиСумма", 			ИмяКолонкиСумма);	
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиПоИмениКоманды(ИмяКоманды)
		
	ИмяОсновнойТаблицы = ИмяОсновнойТаблицыПоИмениКоманды(ИмяКоманды);
	Если ИмяОсновнойТаблицы = Неопределено Тогда
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Результат = ИменаТаблицРеквизитовПоИмениОсновнойТаблицы(ИмяОсновнойТаблицы);	
	Если Результат = Неопределено Тогда
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Результат.Вставить("ИмяОсновнойТаблицы", 	ИмяОсновнойТаблицы);
	Результат.Вставить("УчитыватьКоличество", 	Истина);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьТекущуюВерсию(Проект)

	Если ЗначениеЗаполнено(Проект) Тогда
		ЭтотОбъект.ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	Иначе
		ЭтотОбъект.ТекущаяВерсия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Если в проекте нет запланированной проектной продукции, то тип номенклатуры факта будет ограничен типом Номенклатура.
// Иначе при ручном добавлении пользователю необходимо будет выбрать тип номенклатуры: 
// Номенклатура или Проектная продукция.
//
&НаСервере
Процедура ОбновитьТипНоменклатуры()
	
	ВидимостьЭлементовПП = упоРаботаСФормамиСервер.ВидимостьЭлементовПроектнаяПродукция(Объект.РегистрацияПроектнойПродукции);
	
	Если Не ВидимостьЭлементовПП Тогда
		УстановитьВидимостьЭлементовПроектнаяПродукция();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекВерсия", ТекущаяВерсия);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоДанныеПроектнойПродукции.СрезПоследних(, Версия = &ТекВерсия) КАК Таблица";
	Результат = Запрос.Выполнить();
	
	ВыбиратьТип = Не Результат.Пустой();
	
	упоРаботаСФормамиКлиентСервер.УстановитьТипСубпродуктаДляЭлемента(Элементы.ДоходныеОбъемыНоменклатура, , ВыбиратьТип);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПроектнаяПродукция()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаППНоменклатура", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДоходныеОбъемыЗаполнитьДоходныеОбъемыОборотамиЗаПериод", "Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ДоходныеОбъемыНоменклатураПриИзмененииСервер(ДанныеЗаполнения);
	
	ДанныеЗаполнения.ЕдиницаИзмерения = 
		упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры(ДанныеЗаполнения.Номенклатура);
	
	ПроектнаяЗадачаНоменклатураПриИзмененииВДоходныхОбъемах(ДанныеЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаполнениеПроекта(ОткрытиеФормы = Ложь)
	
	УстановитьЗначенияИВидимостьПроектныхОпцийВДокументе(ОткрытиеФормы);
	ОбновитьТекущуюВерсию(Проект);
	ОбновитьТипНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ПроектнаяЗадачаНоменклатураПриИзмененииВДоходныхОбъемах(ТекДанные)
	
	Если ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадача) И ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		ТекДанные.Стоимость = ЗаполнитьСтоимостьНоменклатуры(ТекДанные.ПроектнаяЗадача, 
			ТекДанные.Номенклатура,
			ЭтотОбъект.ТекущаяВерсия);
		
		КоличествоСуммаПриИзменении(ТекДанные, "Стоимость");
	КонецЕсли
	
КонецПроцедуры	

&НаКлиенте
Функция ДоходныеОбъемыДанныеЗаполнения()
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ПроектнаяЗадачаПроект");
	ДанныеЗаполнения.Вставить("ПроектнаяЗадача");
	ДанныеЗаполнения.Вставить("ЕдиницаИзмерения");
	ДанныеЗаполнения.Вставить("Номенклатура");
	ДанныеЗаполнения.Вставить("Количество");
	ДанныеЗаполнения.Вставить("Стоимость");
	ДанныеЗаполнения.Вставить("Сумма");
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипСубпродуктаПоТипуРегистрации(РегистрацияПроектнойПродукции)
	
	Если РегистрацияПроектнойПродукции Тогда
		ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
	Иначе
		ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.Номенклатура");
	КонецЕсли;
	
	Возврат ТипСубпродукта;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура РаспределениеСтоимостиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	Если (ДополнительныеПараметры.ИмяТаблицыВладельца = "ДоходныеОбъемы" И Не ДоходыПоНатуральнымПоказателям)
		Или (ДополнительныеПараметры.ИмяТаблицыВладельца = "РасходныеОбъемы" И Не РасходыПоНатуральнымПоказателям) Тогда
		ДополнительныеПараметры.Вставить("ПересчитыватьКоличество", Ложь);
	КонецЕсли;

	упоРаботаСФормамиКлиент.ПересчитатьТаблицуРаспределенияЗавершение(ДополнительныеПараметры);			
	
	ВосстановитьОбнуленныйНДСПослеПересчета(ДополнительныеПараметры.ТаблицаРаспределения,
											ДополнительныеПараметры.ТекДанные,
											ДополнительныеПараметры.ИмяТаблицыВладельца);

	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, 
																		ДополнительныеПараметры.ИмяТаблицыВладельца, 
																		ДополнительныеПараметры.ИмяТаблицыРаспределения, 
																		ДополнительныеПараметры.ИмяКолонкиОбщСтоимость,
																		ДополнительныеПараметры.ПересчитыватьКоличество);																	
КонецПроцедуры 

// Если в подчиненных строках был НДС, его сумма обнулится при пересчете по коэффициентам, т.к. в строке НДС Количество = 0. 
// Для восстановления делаем пересчет НДС.
&НаКлиенте
Процедура ВосстановитьОбнуленныйНДСПослеПересчета(ТаблицаРаспределения, СтрокаВладелец, ИмяТаблицыВладельца)
	
	СтруктураСтрокаВладелец = упоРаботаСФормамиКлиент.СтруктураСтрокиДляРасчетаНДС(ТаблицаРаспределения, СтрокаВладелец, 
		ИмяТаблицыВладельца);
		
	Если Не ЗначениеЗаполнено(СтруктураСтрокаВладелец) Тогда
		Возврат;
	КонецЕсли;
	
	ВыделитьНДС(СтруктураСтрокаВладелец, ИмяТаблицыВладельца);
		
КонецПроцедуры

#КонецОбласти																	
