
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОповещенияВызовСервера.ПриСозданииНаСервереФормТиповыхОповещений(ЭтаФорма, Объект);
	
	Элементы.ГруппаПодсказаПредопределенные.Видимость = Объект.Предопределенный;
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 			
	
	ПодсказкаДетектораТекст = НСтр("ru = '
	|// Проверка выполнения условия осуществляется регламентным заданием ""Обработка детекторов событий"".
	|// Если код детектора возвращает Истину, то еще дополнительно проверяются Условия регистрации события.
	|// Доступные переменные:	""Источник"" - любая ссылка или массив ссылок, в которую(ый) возвращается объект(ы), связанный(ые) с событием
	|//							""ПараметрыВозврата"" - структура
	|//							""ПараметрыВыполненияКода"" - структура, сгенерированная на основании таблицы ""Параметры выполняемого кода""
	|//							""Результат"" - булевая переменная. Если в ней возвращается Истина, то регистрируется событие(ия)
	|//'");		
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Используется = Истина;
	КонецЕсли;
	
	масТранспорт = Новый Массив;
	Для Каждого СтрТЧ Из Объект.ТранспортОповещений Цикл
		Если СтрТЧ.Используется Тогда
			масТранспорт.Добавить(СтрТЧ.Транспорт);
		КонецЕсли;
	КонецЦикла;
	ПарТранспорта = ПолучитьПараметрыТранспорта(масТранспорт);
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ПарТранспорта);
	
	УправлениеДоступностью(ЭтаФорма);
	
	ОпределитьДоступныеТаблицыИсточника();
	ОпределитьВариантыИзмененияОбъекта();
	
	ТемаПисьмаФорматированныйДокумент.Добавить(Объект.ШаблонТемы);
	СтруктураВложений = Новый Структура;
	Если Не Объект.Ссылка.Пустая() Тогда
		Если Не ПустаяСтрока(Объект.ШаблонТекстаHTML) Тогда
			
			Объект.ШаблонТекстаHTML = упоОповещенияВызовСервера.ОбработатьТекстHTMLДляФорматированногоДокумента(Объект.Ссылка,Объект.ШаблонТекстаHTML,СтруктураВложений);
			
		КонецЕсли;
	КонецЕсли;
	ТекстПисьмаФорматированныйДокумент.УстановитьHTML(Объект.ШаблонТекстаHTML,СтруктураВложений);
	
	УстановитьОформление(ЭтаФорма);
	
	ЗаполнитьПолеНужнаДополнительнаяНастройкаДляТраспорта();
	
	ОтобразитьПредупреждениеИспользованияРегистров(Объект.ВариантИзмененияОбъекта,
		Элементы.ПредупреждениеВариантИзмененияОбъектаТекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ЗаполнитьСписокДоступныхРеквизитов();
	Элементы.ПоказатьПодсказкуДетектора.Пометка = НЕ ПодсказкаДетектораОтжата;
	Элементы.ГруппаПодсказкаДетоктора.Видимость = НЕ ПодсказкаДетектораОтжата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаТэга" Тогда
		
		СтрокиТэгов = Объект.Тэги.НайтиСтроки(Новый Структура("Представление", ВыбранноеЗначение.Представление));
		
		Если ВыбранноеЗначение.Свойство("Идентификатор") ИЛИ НЕ СтрокиТэгов.Количество() Тогда
			
			Если ВыбранноеЗначение.Свойство("Идентификатор") Тогда
				СтрокаТэгов = Объект.Тэги.НайтиПоИдентификатору(ВыбранноеЗначение.Идентификатор); 
			Иначе
				СтрокаТэгов = Объект.Тэги.Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаТэгов, ВыбранноеЗначение);
			СтрокаТэгов.УсловиеЧитаемое = Новый Структура;
			СтрокаТэгов.УсловиеЧитаемое.Вставить("ДопРеквЗначениеУсловия", ВыбранноеЗначение.ДопРеквЗначениеУсловия);
			СтрокаТэгов.УсловиеЧитаемое.Вставить("ДопРеквИмяТаблицы", ВыбранноеЗначение.ДопРеквИмяТаблицы);
			СтрокаТэгов.УсловиеЧитаемое.Вставить("ДопРеквПолеЗначения", ВыбранноеЗначение.ДопРеквПолеЗначения);
			СтрокаТэгов.УсловиеЧитаемое.Вставить("ДопРеквПолеСвязи", ВыбранноеЗначение.ДопРеквПолеСвязи);
			СтрокаТэгов.УсловиеЧитаемое.Вставить("ДопРеквПолеУсловия", ВыбранноеЗначение.ДопРеквПолеУсловия);
			СтрокаТэгов.УсловиеЧитаемое.Вставить("ИмяТаблицыИсточника", ВыбранноеЗначение.ИмяТаблицыИсточника);
				
		Иначе	
		
			ВыбранноеЗначение.Вставить("Источник", Объект.Источник);
			
			ФормаТэга = ПолучитьФорму("Справочник.упоВидыСобытий.Форма.ФормаТэга", ВыбранноеЗначение, ЭтаФорма);		
			ФормаТэга.Открыть();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.ИдентификаторНазначения = ФормаТэга.УникальныйИдентификатор;
			Сообщение.Текст = НСтр("ru = 'Тэг с таким представлением уже существует'");
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаВводаПериода" Тогда
		
		ТекДанные = Объект.УсловияРегистрацииСобытия.НайтиПоИдентификатору(ВыбранноеЗначение.УИстроки);
		
		Если ТекДанные <> Неопределено Тогда
			ТекДанные.ЗначениеУсловияЧитаемое = Новый СписокЗначений; 
			ТекДанные.ЗначениеУсловияЧитаемое.Добавить(ВыбранноеЗначение.НачалоПериода);
			ТекДанные.ЗначениеУсловияЧитаемое.Добавить(ВыбранноеЗначение.КонецПериода);
			ОбновитьПредставлениеЗначенияВУсловиях(ТекДанные);
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаПодбораСсылок" Тогда
		
		ТекДанные = Объект.УсловияРегистрацииСобытия.НайтиПоИдентификатору(ВыбранноеЗначение.УИстроки);
		
		Если ТекДанные <> Неопределено Тогда
			ТекДанные.ЗначениеУсловияЧитаемое = Новый СписокЗначений; 
			ТекДанные.ЗначениеУсловияЧитаемое.ЗагрузитьЗначения(ВыбранноеЗначение.ВыбЗначения);
			ОбновитьПредставлениеЗначенияВУсловиях(ТекДанные);
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаРедактированияКода" Тогда
		
		Если ВыбранноеЗначение.ИмяТабЧасти = "Получатели" Тогда
			
			ТекДанные = Объект.Получатели.НайтиПоИдентификатору(ВыбранноеЗначение.УИстроки);
			
			Если ТекДанные <> Неопределено Тогда
				ТекДанные.ДопУсловие = ВыбранноеЗначение.ВыполняемыйКод;
			КонецЕсли;
			
		ИначеЕсли ВыбранноеЗначение.ИмяТабЧасти = "КодОпределенияДопПараметра" Тогда
					
			Объект.КодОпределенияДопПараметра = ВыбранноеЗначение.ВыполняемыйКод;
			
		Иначе
			
			ТекДанные = Объект.УсловияРегистрацииСобытия.НайтиПоИдентификатору(ВыбранноеЗначение.УИстроки);
			
			Если ТекДанные <> Неопределено Тогда
				ТекДанные.ВыполняемыйКод = ВыбранноеЗначение.ВыполняемыйКод;
				ТекДанные.ПроверкаПоКоду = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаВыбораРеквизитаИсточника" Тогда
		
		ТекДанные = Объект.УсловияРегистрацииСобытия.НайтиПоИдентификатору(ВыбранноеЗначение.УИстроки);
		
		Если ТекДанные <> Неопределено Тогда     
			Если ТекДанные.РеквизитОбъекта <> ВыбранноеЗначение.ПолноеИмя Тогда
				ТекДанные.ЗначениеУсловияЧитаемое = Неопределено;	
				ОбновитьПредставлениеЗначенияВУсловиях(ТекДанные);
			КонецЕсли;
			ТекДанные.ПредставлениеРеквизита = ВыбранноеЗначение.ПолноеПредставление; 
			ТекДанные.РеквизитОбъекта = ВыбранноеЗначение.ПолноеИмя; 
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаНастроекТранспорта" Тогда
		
		ТекДанные = Объект.ТранспортОповещений.НайтиПоИдентификатору(ВыбранноеЗначение.УИДСтроки);
		
		Если ТекДанные = Неопределено Тогда     
			Возврат;
		КонецЕсли;
		
		ТекДанные.НастройкаЧитаемая = ВыбранноеЗначение.Настройка; 
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ИспользоватьДляАнализаПредыдущиеЗначения = Объект.ИспользоватьДляАнализаПредыдущиеЗначения И
	МожноИспользоватьДляАнализаПредыдущиеЗначения(Объект);
	
	Если Не ЗначениеЗаполнено(Объект.ШаблонТекста) 
		И Не ЗначениеЗаполнено(ТекстПисьмаФорматированныйДокумент.ПолучитьТекст()) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Задайте шаблон текста сообщения'");
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	тз = Объект.УсловияРегистрацииСобытия.Выгрузить();
	ТекущийОбъект.УсловияРегистрацииСобытия.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = ТекущийОбъект.УсловияРегистрацииСобытия.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТз);
		НовСтр.ЗначениеУсловия = Новый ХранилищеЗначения(СтрТз.ЗначениеУсловияЧитаемое);	
	КонецЦикла;
	
	тз = Объект.Тэги.Выгрузить();
	ТекущийОбъект.Тэги.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = ТекущийОбъект.Тэги.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТз);
		НовСтр.УсловиеХЗ = Новый ХранилищеЗначения(СтрТз.УсловиеЧитаемое);	
	КонецЦикла;
	
	тз = Объект.ТранспортОповещений.Выгрузить();
	ТекущийОбъект.ТранспортОповещений.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = ТекущийОбъект.ТранспортОповещений.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТз);
		НовСтр.НастройкаХЗ = Новый ХранилищеЗначения(СтрТз.НастройкаЧитаемая);	
	КонецЦикла;
	
	ТекущийОбъект.РасписаниеДетектора = Новый ХранилищеЗначения(РасписаниеДетектора);
	
	// Подготовим документ HTML из содержимого форматированного документа.
	
	ТаблицаСоответствийИменВложенийИдентификаторам.Очистить();
	
	СтруктураВложений = Новый Структура;
	ТекстПисьмаФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.ШаблонТекстаHTML, СтруктураВложений);
	Для каждого Вложение Из СтруктураВложений Цикл
		
		НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
		НоваяСтрока.ИмяФайла = Вложение.Ключ;
		НоваяСтрока.ИдентификаторФайлаДляHTML = Новый УникальныйИдентификатор;
		НоваяСтрока.Картинка = Вложение.Значение;
		
	КонецЦикла;
	
	Если ТаблицаСоответствийИменВложенийИдентификаторам.Количество() > 0 Тогда
		
		ДокументHTML = упоОповещенияВызовСервера.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекущийОбъект.ШаблонТекстаHTML);
		упоОповещенияВызовСервера.ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML( ДокументHTML, ТаблицаСоответствийИменВложенийИдентификаторам.Выгрузить());
		ТекущийОбъект.ШаблонТекстаHTML = упоОповещенияВызовСервера.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	ОбновитьПовторноИспользуемыеЗначения();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "упоОбновленоСостояниеВидаОповещения" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();		
		УстановитьОформление(ЭтаФорма);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	тз = ТекущийОбъект.УсловияРегистрацииСобытия.Выгрузить();
	Объект.УсловияРегистрацииСобытия.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = Объект.УсловияРегистрацииСобытия.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТз);
		НовСтр.ЗначениеУсловияЧитаемое = СтрТз.ЗначениеУсловия.Получить();	
		ОбновитьПредставлениеЗначенияВУсловиях(НовСтр);
	КонецЦикла;
	
	тз = ТекущийОбъект.Тэги.Выгрузить();
	Объект.Тэги.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = Объект.Тэги.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТз);
		НовСтр.УсловиеЧитаемое = СтрТз.УсловиеХЗ.Получить();	
	КонецЦикла;
	
	тз = ТекущийОбъект.ТранспортОповещений.Выгрузить();
	Объект.ТранспортОповещений.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = Объект.ТранспортОповещений.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТз);
		НовСтр.НастройкаЧитаемая = СтрТз.НастройкаХЗ.Получить();	
	КонецЦикла;
	
	РасписаниеДетектора = ТекущийОбъект.РасписаниеДетектора.Получить();
	Если РасписаниеДетектора = Неопределено Тогда
		РасписаниеДетектора = упоОповещенияВызовСервера.РасписаниеПоУмолчанию();
	КонецЕсли;
	
	ПредШаблонТекста = ТекущийОбъект.ШаблонТекста;
	ПредТекстПисьмаФорматированныйДокумент = ТекстПисьмаФорматированныйДокумент;

КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
	П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортОповещенийТранспортПриИзменении(Элемент)
	
	ЗаполнитьПолеНужнаДополнительнаяНастройкаДляТраспорта();
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортОповещенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ТранспортОповещенийНастройка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЭтаФорма.ТолькоПросмотр Тогда
			Возврат;
		КонецЕсли;
		
		ТекДанные = Объект.ТранспортОповещений.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если Не ТекДанные.НужнаДополнительнаяНастройка Тогда
			Возврат;
		КонецЕсли;
				
		ПараметрыФормыНастроек = Новый Структура;
		ПараметрыФормыНастроек.Вставить("Транспорт", ТекДанные.Транспорт);
		ПараметрыФормыНастроек.Вставить("Источник", Объект.Источник);
		ПараметрыФормыНастроек.Вставить("Настройка", ТекДанные.НастройкаЧитаемая);
		ПараметрыФормыНастроек.Вставить("УИДСтроки", ТекДанные.ПолучитьИдентификатор());
		
		ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаНастроекТранспорта", ПараметрыФормыНастроек, 
																				ЭтаФорма,
																				,,,,
																				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
																			
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиВидПолучателяПриИзменении(Элемент)
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.Получатель = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекстПисьмаФорматированныйДокументПриИзменении(Элемент)
	
	Если СокрЛП(ПредШаблонТекста) = СокрЛП(ПредТекстПисьмаФорматированныйДокумент.ПолучитьТекст()) ИЛИ НЕ ЗначениеЗаполнено(Объект.ШаблонТекста) Тогда
		Объект.ШаблонТекста = ТекстПисьмаФорматированныйДокумент.ПолучитьТекст();
	КонецЕсли;
	
	ПредШаблонТекста = Объект.ШаблонТекста;
	ПредТекстПисьмаФорматированныйДокумент = ТекстПисьмаФорматированныйДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияЗначениеУсловияПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;           
	ТекДанные = Элементы.УсловияРегистрацииСобытия.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЗначениеУсловия = Неопределено;  		
		ОбновитьПредставлениеЗначенияВУсловиях(ТекДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияЗначениеУсловияПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.УсловияРегистрацииСобытия.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ТекДанные.ЗначениеУсловияЧитаемое);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияПредставлениеРеквизитаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СпособОтслеживанияСобытияПриИзменении(Элемент)
	УправлениеДоступностью(ЭтаФорма);
	ОпределитьДоступныеТаблицыИсточника();
	ОпределитьВариантыИзмененияОбъекта();
КонецПроцедуры

&НаКлиенте
Процедура ВариантИзмененияОбъектаПриИзменении(Элемент)
	УправлениеДоступностью(ЭтаФорма);
	ОпределитьДоступныеТаблицыИсточника();
	СформироватьНаименованиеЕслиПустое();
	ОтобразитьПредупреждениеИспользованияРегистров(Объект.ВариантИзмененияОбъекта,
		Элементы.ПредупреждениеВариантИзмененияОбъектаТекст);
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование Тогда
		Отказ = Истина;
		НовСтр = Объект.УсловияРегистрацииСобытия.Добавить();
		НовСтр.Используется = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортОповещенийПриИзменении(Элемент)
	
	масТранспорт = Новый Массив;
	Для Каждого СтрТЧ Из Объект.ТранспортОповещений Цикл
		Если СтрТЧ.Используется Тогда
			масТранспорт.Добавить(СтрТЧ.Транспорт);
		КонецЕсли;
	КонецЦикла;
	ЕстьИзменения = Ложь;
	ПарТранспорта = ПолучитьПараметрыТранспорта(масТранспорт);                                          
	Если ПарТранспорта.ДоступенТекстСообщенияВHTML <> ДоступенТекстСообщенияВHTML Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если ПарТранспорта.ДоступнаТемаСообщения <> ДоступнаТемаСообщения Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;                                                                                                  
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ПарТранспорта);
	Если ЕстьИзменения Тогда
		УправлениеДоступностью(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортОповещенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование Тогда
		Отказ = Истина;
		НовСтр = Объект.ТранспортОповещений.Добавить();
		НовСтр.Используется = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	УправлениеДоступностью(ЭтаФорма);
	ЗаполнитьСписокДоступныхРеквизитов();
	ОпределитьВариантыИзмененияОбъекта();
	СформироватьНаименованиеЕслиПустое();
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияПредставлениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.УсловияРегистрацииСобытия.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Пар = Новый Структура;
	Пар.Вставить("Источник", Объект.Источник);
	Пар.Вставить("УИстроки", ТекДанные.ПолучитьИдентификатор());
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаВыбораРеквизитаИсточника", Пар, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПриИзменении(Элемент)
	УстановитьОформление(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.УсловияРегистрацииСобытия.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВидовСравнений = упоОповещенияВызовСервера.ПолучитьСписокДоступныхВидовСравненийДляРеквизита(ТекДанные.РеквизитОбъекта,Объект.Источник);
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Эл Из СписокВидовСравнений Цикл
		ДанныеВыбора.Добавить(Эл.Значение,Эл.Представление);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияЗначениеУсловияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.УсловияРегистрацииСобытия.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизитаИсточника(ТекДанные.РеквизитОбъекта,Объект.Источник);
	ВидСравненияИнтервал = ПредопределенноеЗначение("Перечисление.упоВидыСравнения.Интервал");
	ВидСравненияИнтервалВклГр = ПредопределенноеЗначение("Перечисление.упоВидыСравнения.ИнтервалВключаяГраницы");
	ВидСравненияВСписке = ПредопределенноеЗначение("Перечисление.упоВидыСравнения.ВСписке");
	ВидСравненияВСпискеПоИерархии = ПредопределенноеЗначение("Перечисление.упоВидыСравнения.ВСпискеПоИерархии");
	ВидСравненияНеВСписке = ПредопределенноеЗначение("Перечисление.упоВидыСравнения.НеВСписке");
	ВидСравненияНеВСпискеПоИерархии = ПредопределенноеЗначение("Перечисление.упоВидыСравнения.НеВСпискеПоИерархии");
	
	Если ТекДанные.ВидСравнения = ВидСравненияВСписке ИЛИ ТекДанные.ВидСравнения = ВидСравненияВСпискеПоИерархии
		ИЛИ ТекДанные.ВидСравнения = ВидСравненияНеВСписке ИЛИ ТекДанные.ВидСравнения = ВидСравненияНеВСпискеПоИерархии Тогда
		
		Пар = Новый Структура("УИстроки,ПолноеИмяРеквизита,ВыбЗначения",ТекДанные.ПолучитьИдентификатор(),ТекДанные.РеквизитОбъекта,Новый Массив);
		Пар.Вставить("ОписаниеТипаРеквизита",ОписаниеТипаРеквизита);
		Если ТипЗнч(ТекДанные.ЗначениеУсловияЧитаемое) = Тип("СписокЗначений") Тогда
			Пар.Вставить("ВыбЗначения",ТекДанные.ЗначениеУсловияЧитаемое.ВыгрузитьЗначения());	
		КонецЕсли;
		
		ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаПодбораСсылок",Пар,ЭтаФорма);
		
	ИначеЕсли ОписаниеТипаРеквизита.СодержитТип(Тип("Дата")) 
		И (ТекДанные.ВидСравнения = ВидСравненияИнтервал ИЛИ ТекДанные.ВидСравнения = ВидСравненияИнтервалВклГр) Тогда
		
		Пар = Новый Структура("УИстроки,НачалоПериода,КонецПериода",ТекДанные.ПолучитьИдентификатор());
		Если ТипЗнч(ТекДанные.ЗначениеУсловияЧитаемое) = Тип("СписокЗначений") И ТекДанные.ЗначениеУсловияЧитаемое.Количество() = 2 Тогда
			Пар.Вставить("НачалоПериода", ТекДанные.ЗначениеУсловияЧитаемое[0].Значение);
			Пар.Вставить("КонецПериода", ТекДанные.ЗначениеУсловияЧитаемое[1].Значение);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаВводаПериода",Пар,ЭтаФорма);
		
	ИначеЕсли ОписаниеТипаРеквизита <> Неопределено Тогда
		
		Пар = Новый Структура("УИстроки",ТекДанные.ПолучитьИдентификатор());
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения",ЭтаФорма, Пар);
		
		ПоказатьВводЗначения(Оповещение,ТекДанные.ЗначениеУсловияЧитаемое,"Введите значение условия",ОписаниеТипаРеквизита);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияРегистрацииСобытияВыполняемыйКодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.УсловияРегистрацииСобытия.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Подсказка = НСтр("ru = '
	|// Доступные переменные:	""Источник"" - объект, связанный с событием
	|//							""ИсточникДопПараметр"" - дополнительный параметр источника
	|//							""ПараметрыВозврата"" - структура
	|//							""ДанныеДоИзменения"" - структура или Неопределено 	
	|//							""ПараметрыВыполненияКода"" - структура, сгенерированная на основании таблицы ""Параметры выполняемого кода"" 	
	|//							""Результат"" - булевая переменная. Если в ней возвращается Истина, то условие выполнено
	|//'");
	
	Пар = Новый Структура;
	Пар.Вставить("УИстроки", ТекДанные.ПолучитьИдентификатор());
	Пар.Вставить("ВыполняемыйКод", ТекДанные.ВыполняемыйКод);
	Пар.Вставить("Источник", Объект.Источник);
	Пар.Вставить("Подсказка", Подсказка);
	Пар.Вставить("ЗаголовокФормы", НСтр("ru = 'Выполняемый код (Условие регистрации события)'"));
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаРедактированияКода",Пар,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТекстаПисьмаПриИзменении(Элемент)
	УправлениеДоступностью(ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ТэгиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Пар = Новый Структура;
	Пар.Вставить("Источник", Объект.Источник);
	
	Если Копирование Тогда
			
		ТекДанные = Элементы.Тэги.ТекущиеДанные;
		
		Если ТекДанные <> Неопределено Тогда
			
			ПараметрыСтроки = ПолучитьСтруктуруПараметровСтрокиТэгов(ТекДанные);
			ПараметрыСтроки.Представление = ПараметрыСтроки.Представление + НСтр("ru = '.Копия'"); 
			ПараметрыСтроки.Удалить("Идентификатор");
			
			Для Каждого КлючЗначение Из ПараметрыСтроки Цикл  
				
				Пар.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаТэга", Пар, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТэгиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Истина;	
	
	ТекДанные = Объект.Тэги.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПараметрыСтроки = ПолучитьСтруктуруПараметровСтрокиТэгов(ТекДанные);
	ПараметрыСтроки.Вставить("Источник", Объект.Источник);
		
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаТэга", ПараметрыСтроки, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТэгиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТега = Объект.Тэги.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]);
	ПараметрыПеретаскивания.Значение = "["+ СтрокаТега.Представление+"]";
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонТемыПриИзменении(Элемент)
	Объект.ШаблонТемы = СокрЛП(ТемаПисьмаФорматированныйДокумент.ПолучитьТекст());
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ВидПолучателя) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = ПолучитьИмяТаблицыПолучателя(ТекДанные.ВидПолучателя);
	
	ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ИмяТаблицы,"Ссылка");
	Если ОписаниеТипаРеквизита <> Неопределено Тогда
		Элементы.ПолучателиПолучатель.ОграничениеТипа = ОписаниеТипаРеквизита;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиДопУсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Получатели.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Подсказка = НСтр("ru = '
	|// Доступные переменные:	
	|// 						""Источник"" - объект, связанный с событием
	|// 						""ИсточникДопПараметр"" - дополнительный параметр источника	
	|// 						""МасПолучатели"" - массив получателей, можно задать новый, вместо найденного системой
	|// 						""ПараметрыВыполненияКода"" - структура, сгенерированная на основании таблицы ""Параметры выполняемого кода""	
	|// 						""Результат"" - булевая переменная. Если в ней возвращается Истина, то условие выполнено
	|//'");							
	
	Пар = Новый Структура;
	Пар.Вставить("ИмяТабЧасти", "Получатели");
	Пар.Вставить("УИстроки", ТекДанные.ПолучитьИдентификатор());
	Пар.Вставить("ВыполняемыйКод", ТекДанные.ДопУсловие);
	Пар.Вставить("Источник", Объект.Источник);
	Пар.Вставить("Подсказка", Подсказка);
	Пар.Вставить("ЗаголовокФормы", НСтр("ru = 'Выполняемый код (Доп. условие получателя)'"));
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаРедактированияКода", Пар, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОпределенияДопПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Подсказка = НСтр("ru = '
	|// Доп. параметр источника служит как дополнительное измерение для регистрации событий. 
	|// Т.е. по одному объекту можно зарегистрировать несколько событий в зависимости от значений этого параметра.
	|// Например, документ: ""Назначение трудовых ресурсов на проектную задачу"" и значения параметра ""Овечкин А.И."" и ""Петров З.К""
	|// Доступные переменные:	
	|//							""ИсточникДопПараметр"" - в него нужно записать ""Неопределено"", ""Любая ссылка"", ""Число"", ""Строка"", ""Дата"" 
	|//							или массив этих значений. В случае массива будет зарегистрировано столько событий, сколько элементов в массиве.
	|//							""Источник"" - объект, связанный с событием.
	|//							""ПараметрыВыполненияКода"" - структура, сгенерированная на основании таблицы ""Параметры выполняемого кода"". 	
	|//'");
	
	Пар = Новый Структура;
	
	Пар.Вставить("ИмяТабЧасти", "КодОпределенияДопПараметра");
	Пар.Вставить("ВыполняемыйКод", Объект.КодОпределенияДопПараметра);
	Пар.Вставить("Источник", Объект.Источник);
	Пар.Вставить("Подсказка", Подсказка);
	Пар.Вставить("ЗаголовокФормы", НСтр("ru = 'Выполняемый код (Определение доп. параметров источника)'"));
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаРедактированияКода", Пар, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьРасписаниеВыполнить()

	Если РасписаниеДетектора = Неопределено Тогда
		РасписаниеДетектора = упоОповещенияВызовСервера.РасписаниеПоУмолчанию();
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеДетектора);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытьРасписаниеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование(Команда)
	Объект.Наименование = СгенерироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКодДетектора(Команда)
	
	ОчиститьСообщения();
	
	ТекстУспешногоЗавершения = "";
	Если упоОповещенияВызовСервера.ПроверитьКод(Объект.ДетекторСобытия, ТекстУспешногоЗавершения) Тогда
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ТекстУспешногоЗавершения);
		ТекстовыйДокумент.Показать(НСтр("ru = 'Результат выполнения выражения на встроенном языке'"));
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодсказкуДетектора(Команда)
	ПодсказкаДетектораОтжата = НЕ ПодсказкаДетектораОтжата;
	Элементы.ПоказатьПодсказкуДетектора.Пометка = НЕ ПодсказкаДетектораОтжата;
	Элементы.ГруппаПодсказкаДетоктора.Видимость = НЕ ПодсказкаДетектораОтжата;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьРасписаниеЗавершение(НовоеРасписание, Неопределен) Экспорт

	Если НовоеРасписание <> Неопределено Тогда
		РасписаниеДетектора = НовоеРасписание;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СгенерироватьНаименование() 
	Возврат Объект.Источник + ",  " + Объект.ВариантИзмененияОбъекта;	
КонецФункции

&НаКлиенте
Функция СформироватьНаименованиеЕслиПустое() 
	Если ЗначениеЗаполнено(Объект.Источник) И ЗначениеЗаполнено(Объект.ВариантИзмененияОбъекта) И НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СгенерироватьНаименование();
	КонецЕсли;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.Объект.СпособОтслеживанияСобытия = ПредопределенноеЗначение("Перечисление.упоСпособыОтслеживанияСобытий.ПриЗаписиОбъекта") Тогда
		Элементы.ВариантИзмененияОбъекта.Видимость = Истина;
		Элементы.СформироватьНаименование.Видимость = Истина;
		Элементы.СтраницаДетектор.Видимость = Ложь;
		Элементы.НастроитьРасписание.Видимость = Ложь;
	ИначеЕсли Форма.Объект.СпособОтслеживанияСобытия = ПредопределенноеЗначение("Перечисление.упоСпособыОтслеживанияСобытий.ПоРасписанию") Тогда
		Элементы.ВариантИзмененияОбъекта.Видимость = Ложь;
		Элементы.СформироватьНаименование.Видимость = Ложь;
		Элементы.СтраницаДетектор.Видимость = Истина;
		Элементы.НастроитьРасписание.Видимость = Истина;
	Иначе
		Элементы.ВариантИзмененияОбъекта.Видимость = Ложь;
		Элементы.СформироватьНаименование.Видимость = Ложь;
		Элементы.СтраницаДетектор.Видимость = Ложь;
		Элементы.НастроитьРасписание.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаТема.Видимость = Форма.ДоступнаТемаСообщения;
	
	Если Форма.ДоступенТекстСообщенияВHTML Тогда
		Элементы.ТипТекстаПисьма.Видимость = Истина;
		Если Форма.ТипТекстаПисьма = 0 Тогда
			Элементы.СтраницыТекстПисьма.ТекущаяСтраница = Элементы.СтраницаТекстПисьмаHTML;
		Иначе
			Элементы.СтраницыТекстПисьма.ТекущаяСтраница = Элементы.СтраницаТекстПисьмаОбычный;
		КонецЕсли;
	Иначе
		Элементы.ТипТекстаПисьма.Видимость = Ложь;
		Элементы.СтраницыТекстПисьма.ТекущаяСтраница = Форма.Элементы.СтраницаТекстПисьмаОбычный;
	КонецЕсли;
	
	ДоступностьЭлемента = ЗначениеЗаполнено(Форма.Объект.Источник);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ГруппаУсловияИсточника", "Доступность", ДоступностьЭлемента);
	
	ВидимостьЭлемента = МожноИспользоватьДляАнализаПредыдущиеЗначения(Форма.Объект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ИспользоватьДляАнализаПредыдущиеЗначения", "Видимость", ВидимостьЭлемента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьОформление(ЭтаФорма)    
	Если ЭтаФорма.Объект.Используется Тогда
		//ЦветФона = WebЦвета.Роса;
		ЦветФона = Новый Цвет;
	Иначе
		ЦветФона = WebЦвета.ТусклоРозовый;
	КонецЕсли;
	ЭтаФорма.Элементы.ГруппаОбщая.ЦветФона = ЦветФона; 	
КонецФункции

&НаСервере
Функция ОпределитьВариантыИзмененияОбъекта() 
	
	Элементы.ВариантИзмененияОбъекта.СписокВыбора.Очистить();
	Элементы.ВариантИзмененияОбъекта.РежимВыбораИзСписка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Источник) Тогда
		
		ИменаТаблиц = упоОповещенияВызовСервера.РазобратьИмяТаблицы(Объект.Источник);		
		ВидТаблицы = ИменаТаблиц.ВидТаблицы;
		
		// Закомментировано отображение регистров для дальнейшей доработки.
		//Если Найти(ВидТаблицы, "Регистр") <> 0 Тогда
		//	Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьВРегистр);	
		Если Найти(ВидТаблицы, "Справочник") <> 0 ИЛИ Найти(ВидТаблицы, "План") <> 0 ИЛИ Найти(ВидТаблицы, "Задача") <> 0  ИЛИ Найти(ВидТаблицы, "БизнесПроцесс") <> 0 Тогда
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьНовогоОбъекта);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьОбъекта);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьСуществующегоОбъекта);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ПометкаОбъектаНаУдаление);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.СнятиеПометкиНаУдалениеСОбъекта);	
		ИначеЕсли Найти(ВидТаблицы, "Документ") <> 0 Тогда
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьНовогоОбъекта);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьОбъекта);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ЗаписьСуществующегоОбъекта);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ПометкаОбъектаНаУдаление);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.СнятиеПометкиНаУдалениеСОбъекта);	
			
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ПроведениеНового);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.Проведение);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.Перепроведение);	
			Элементы.ВариантИзмененияОбъекта.СписокВыбора.Добавить(Перечисления.упоВариантыИзмененияОбъектов.ОтменаПроведения);	
		КонецЕсли;		
		
	КонецЕсли;	
	
	Если Элементы.ВариантИзмененияОбъекта.СписокВыбора.Количество() Тогда
		Элементы.ВариантИзмененияОбъекта.РежимВыбораИзСписка = Истина; 
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОпределитьДоступныеТаблицыИсточника()
	
	Элементы.Источник.СписокВыбора.Очистить();
	
	масНужныеТипы = Новый Массив;
	
	Если Объект.СпособОтслеживанияСобытия = Перечисления.упоСпособыОтслеживанияСобытий.ПоРасписанию
		ИЛИ Не ЗначениеЗаполнено(Объект.ВариантИзмененияОбъекта) Тогда
		
		масНужныеТипы.Добавить("Справочники");
		масНужныеТипы.Добавить("Документы");
		масНужныеТипы.Добавить("ПланыВидовХарактеристик");
		масНужныеТипы.Добавить("Задачи");
		масНужныеТипы.Добавить("БизнесПроцессы");
		// Закомментировано отображение регистров для дальнейшей доработки.
		//масНужныеТипы.Добавить("РегистрыСведений");
		//масНужныеТипы.Добавить("РегистрыНакопления");
		//масНужныеТипы.Добавить("РегистрыБухгалтерии");
		//масНужныеТипы.Добавить("РегистрыРасчета");
		
	ИначеЕсли Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ПроведениеНового
		ИЛИ Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.Проведение
		ИЛИ Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.Перепроведение
		ИЛИ Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ОтменаПроведения Тогда
		
		масНужныеТипы.Добавить("Документы");
		
	ИначеЕсли Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ЗаписьНовогоОбъекта
		ИЛИ Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ЗаписьОбъекта
		ИЛИ Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ЗаписьСуществующегоОбъекта
		ИЛИ Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ПометкаОбъектаНаУдаление
		ИЛИ Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.СнятиеПометкиНаУдалениеСОбъекта Тогда
		
		масНужныеТипы.Добавить("Справочники");
		масНужныеТипы.Добавить("Документы");
		масНужныеТипы.Добавить("ПланыВидовХарактеристик");
		масНужныеТипы.Добавить("Задачи");
		масНужныеТипы.Добавить("БизнесПроцессы");
		
	// Закомментировано отображение регистров для дальнейшей доработки.
	//ИначеЕсли Объект.ВариантИзмененияОбъекта = Перечисления.упоВариантыИзмененияОбъектов.ЗаписьВРегистр Тогда
		//
		//	масНужныеТипы.Добавить("РегистрыСведений");
		//	масНужныеТипы.Добавить("РегистрыНакопления");
		//	масНужныеТипы.Добавить("РегистрыБухгалтерии");
		//	масНужныеТипы.Добавить("РегистрыРасчета");
		
	КонецЕсли;
	
	Пар = Новый Структура("масНужныеТипы", масНужныеТипы);
	Спис = упоОповещенияВызовСервера.ПолучитьСписокДоступныхТаблиц(Пар, Истина);
	
	Для Каждого Эл Из Спис Цикл
		Элементы.Источник.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыТранспорта(масТранспорт)
	
	ДоступенТекстСообщенияВHTML = Ложь;
	ДоступнаТемаСообщения = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	упоТранспортОповещений.ДоступнаТемаСообщения,
					|	упоТранспортОповещений.ДоступенТекстСообщенияВHTML
					|ИЗ
					|	Справочник.упоТранспортОповещений КАК упоТранспортОповещений
					|ГДЕ
					|	упоТранспортОповещений.Ссылка В (&масТранспорт)";
	Запрос.УстановитьПараметр("масТранспорт",масТранспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДоступенТекстСообщенияВHTML Тогда
			ДоступенТекстСообщенияВHTML = Истина;
		КонецЕсли;
		Если Выборка.ДоступнаТемаСообщения Тогда
			ДоступнаТемаСообщения = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Новый Структура("ДоступенТекстСообщенияВHTML, ДоступнаТемаСообщения",
		ДоступенТекстСообщенияВHTML, ДоступнаТемаСообщения);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокДоступныхРеквизитов()
	
	//Элементы.УсловияРегистрацииСобытияРеквизитОбъекта.СписокВыбора.Очистить();
	//Если ПустаяСтрока(Объект.Источник) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Спис = упоОповещенияВызовСервера.ПолучитьСписокРеквизитовДляОповещений(Объект.Источник);
	//Для Каждого Эл Из Спис Цикл
	//	Элементы.УсловияРегистрацииСобытияРеквизитОбъекта.СписокВыбора.Добавить(Объект.Источник + "." + Эл.Имя,Объект.Источник + "." + Эл.Представление);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеЗначенияУсловия(Значение) 
	Представление = "";
	Если ТипЗнч(Значение) = Тип("СписокЗначений") 
		И Значение.Количество() = 2 
		И ТипЗнч(Значение[0].Значение) = Тип("Дата") 
		И ТипЗнч(Значение[1].Значение) = Тип("Дата") 
		Тогда
			Представление = ""+Значение[0].Значение + "-" + Значение[1].Значение;
	ИначеЕсли ЗначениеЗаполнено(Значение) Тогда
		Представление = ""+Значение;
	Иначе
		Представление = "";
	КонецЕсли;
	Возврат Представление;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьПредставлениеЗначенияВУсловиях(СтрокаУсловий) 
	СтрокаУсловий.ЗначениеУсловияПредставление = ПолучитьПредставлениеЗначенияУсловия(СтрокаУсловий.ЗначениеУсловияЧитаемое);
КонецФункции

&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗначение,Параметры) Экспорт
	
	ТекДанные = Объект.УсловияРегистрацииСобытия.НайтиПоИдентификатору(Параметры.УИстроки);
	
	Если ТекДанные <> Неопределено И ВыбЗначение <> Неопределено Тогда
		ТекДанные.ЗначениеУсловияЧитаемое = ВыбЗначение;
		ОбновитьПредставлениеЗначенияВУсловиях(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяТаблицыПолучателя(ВидПолучателя)
	
	Если ЗначениеЗаполнено(ВидПолучателя) Тогда
		Возврат ВидПолучателя.ТаблицаПолучателя;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МожноИспользоватьДляАнализаПредыдущиеЗначения(Объект)
	
	Если Объект.СпособОтслеживанияСобытия <> ПредопределенноеЗначение("Перечисление.упоСпособыОтслеживанияСобытий.ПриЗаписиОбъекта") Тогда
		Возврат Ложь;
	КонецЕсли;
	                                     	
	МассивПравильных = Новый Массив;	
	МассивПравильных.Добавить(ПредопределенноеЗначение("Перечисление.упоВариантыИзмененияОбъектов.ЗаписьОбъекта"));
	МассивПравильных.Добавить(ПредопределенноеЗначение("Перечисление.упоВариантыИзмененияОбъектов.ЗаписьСуществующегоОбъекта"));
	МассивПравильных.Добавить(ПредопределенноеЗначение("Перечисление.упоВариантыИзмененияОбъектов.Перепроведение"));
	МассивПравильных.Добавить(ПредопределенноеЗначение("Перечисление.упоВариантыИзмененияОбъектов.Проведение"));
	
	Если МассивПравильных.Найти(Объект.ВариантИзмененияОбъекта) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруПараметровСтрокиТэгов(СтрокаТэгов) 
	
	Пар = Новый Структура;
	
	Пар.Вставить("Условие", СтрокаТэгов.Условие);
	Пар.Вставить("ТипТэга", СтрокаТэгов.ТипТэга);		
	Пар.Вставить("Представление", СтрокаТэгов.Представление);	
	Пар.Вставить("Значение", СтрокаТэгов.Значение);		
	Пар.Вставить("Идентификатор", СтрокаТэгов.ПолучитьИдентификатор());
	
	Если ТипЗнч(СтрокаТэгов.УсловиеЧитаемое) = Тип("Структура") Тогда
		Пар.Вставить("ДопРеквЗначениеУсловия", СтрокаТэгов.УсловиеЧитаемое.ДопРеквЗначениеУсловия);
		Пар.Вставить("ДопРеквИмяТаблицы", СтрокаТэгов.УсловиеЧитаемое.ДопРеквИмяТаблицы);
		Пар.Вставить("ДопРеквПолеЗначения", СтрокаТэгов.УсловиеЧитаемое.ДопРеквПолеЗначения);
		Пар.Вставить("ДопРеквПолеСвязи", СтрокаТэгов.УсловиеЧитаемое.ДопРеквПолеСвязи);
		Пар.Вставить("ДопРеквПолеУсловия", СтрокаТэгов.УсловиеЧитаемое.ДопРеквПолеУсловия);		
	КонецЕсли;
	
	Возврат Пар;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПолеНужнаДополнительнаяНастройкаДляТраспорта()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоТранспортОповещений.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.упоТранспортОповещений КАК упоТранспортОповещений
	               |ГДЕ
	               |	упоТранспортОповещений.ДоступнаНастройкаДляВидаСобытия";
	
	МассивДоступнаНастройкаДляВидаСобытия = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Для Каждого СтрокаТранспорта Из Объект.ТранспортОповещений Цикл
		СтрокаТранспорта.НужнаДополнительнаяНастройка = МассивДоступнаНастройкаДляВидаСобытия.Найти(СтрокаТранспорта.Транспорт) <> Неопределено; 
		Если СтрокаТранспорта.НужнаДополнительнаяНастройка Тогда
			СтрокаТранспорта.Настройка = НСтр("ru = 'Двойной клик'");		
		Иначе
			СтрокаТранспорта.Настройка = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьПредупреждениеИспользованияРегистров(ВариантИзмененияОбъекта, Элемент)
	
	Если ВариантИзмененияОбъекта =
		ПредопределенноеЗначение("Перечисление.упоВариантыИзмененияОбъектов.ЗаписьВРегистр") Тогда
		Элемент.Видимость = Истина;
	Иначе
		Элемент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
