
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРегистрацияСтоимостиРесурсов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

// Возвращает вид ресурса номенклатура
//
// Возвращаемое значение:
//  Строка -
//
Функция ВидРесурсаНоменклатура() Экспорт
	
	Возврат "Номенклатура";
	
КонецФункции

// Возвращает вид ресурса Структура ПД
//
// Возвращаемое значение:
//  Строка -
//
Функция ВидРесурсаПроектнаяПродукция() Экспорт
	
	Возврат "упоПроектнаяПродукция";
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьМассивВозможныхВидовРесурсов() Экспорт
	
	РегистрацияМенеджер = Документы.упоРегистрацияСтоимостиРесурсов;
		
	МассивТипов = Новый Массив;
	
	ВидРесурсаНоменклатура 	= РегистрацияМенеджер.ВидРесурсаНоменклатура();
	МассивТипов.Добавить(ВидРесурсаНоменклатура);
	
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция() Тогда
		ВидРесурсаПП 			= РегистрацияМенеджер.ВидРесурсаПроектнаяПродукция();
		МассивТипов.Добавить(ВидРесурсаПП);	
	КонецЕсли;
	
	МассивТипов.Добавить("упоТрудовыеРесурсы");
	МассивТипов.Добавить("упоРоли");
	
	Возврат МассивТипов;
	
КонецФункции

Функция ПолучитьПредставленияВидовРесурсов() Экспорт
	
	Результат = Новый Соответствие;
	
	ВидыРесурсов = ПолучитьМассивВозможныхВидовРесурсов();
	
	Для Каждого ВидРесурса Из ВидыРесурсов Цикл
		Представление = Метаданные.Справочники[ВидРесурса].Представление();
		Результат.Вставить(ВидРесурса, Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеВидовЕдиницНормирования() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Номенклатура", "УпаковкиЕдиницыИзмерения");
	Результат.Вставить("упоТрудовыеРесурсы", "упоЕдиницыВремени");
	Результат.Вставить("упоРоли", "упоЕдиницыВремени");
	Результат.Вставить("упоПроектнаяПродукция", "УпаковкиЕдиницыИзмерения");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти