////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с ресурсами и ролями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает массив подразделений, в состав которых входит указанная роль.
//
// Параметры:
//  Роль			 - СправочникСсылка.упоРоли	 - роль.
//  СтрокаПоиска	 - Строка					 - введенное значение подбора.
//  ДатаАктуальности - Дата, Неопределено		 - дата, в соответствии с которой будут отсортированы
//  	подразделения по их дате регистрации.
// 
// Возвращаемое значение:
//  Массив - (СправочникСсылка.Подразделения)подразделения роли.
//
Функция ПолучитьМассивПодразделенийРоли(Роль, СтрокаПоиска = "", Знач ДатаАктуальности = Неопределено) Экспорт
	
	массивПодразделений = Новый Массив;
		
	ДатаАктуальности = ПриведеннаяДатаАктуальности(ДатаАктуальности);
	
	ЕстьПоискПоСтроке = Не ПустаяСтрока(СтрокаПоиска);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("УсловиеПоискаПоСтроке", Не ЕстьПоискПоСтроке);
	
	// Первым должно выбираться последнее зарегистрированное подразделение.
	ТекстЗапроса = ТекстПодразделенияРолей();
	
	Если ЕстьПоискПоСтроке Тогда
		ОтборПоСтроке = "Рег.Подразделение.Наименование ПОДОБНО &СтрокаПоиска";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоискаПоСтроке", ОтборПоСтроке);
		
		Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			массивПодразделений.Добавить(Выборка.Подразделение);
		КонецЦикла;
	КонецЕсли;
	
    Возврат массивПодразделений;
	
КонецФункции

// Функция возвращает соответствие Роль - массив подразделений, в состав которых входит указанная роль.
//
// Параметры:
//  Роли			 - Массив, СписокЗначений	 - (СправочникСсылка.упоРоли) роли.
//  ДатаАктуальности - Дата, Неопределено		 - дата, в соответствии с которой будут отсортированы
//  		подразделения по их дате регистрации.
// 
// Возвращаемое значение:
//  Соответствие - подразделения ролей.
//
Функция ПолучитьПодразделенияРолей(Роли = Неопределено, Знач ДатаАктуальности = Неопределено) Экспорт
	
	ДатаАктуальности = ПриведеннаяДатаАктуальности(ДатаАктуальности);

	ПодразделенияРолей = Новый Соответствие;
	
	ТекстЗапроса = ТекстПодразделенияРолей();
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить("Рег.Роль");
	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Удалить(1); // &УсловиеПоискаПоСтроке
	
	Если ЗначениеЗаполнено(Роли) Тогда
		ПараметрыОтбора = "Роль В (&СписокРолей)";
	Иначе
		ПараметрыОтбора = "Истина";
	КонецЕсли;
	Выражение = Новый ВыражениеСхемыЗапроса(ПараметрыОтбора);
	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[1].Выражение = Выражение;
	
	СхемаЗапроса.ПакетЗапросов[0].КонтрольныеТочкиИтогов.Добавить("Роль"); // Итоги
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокРолей", Роли);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	ДеревоРолей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для Каждого СтрокаРоли Из ДеревоРолей.Строки Цикл
		СписокПодразделений = Новый СписокЗначений;
		Для Каждого СтрокаПодразделения Из СтрокаРоли.Строки Цикл
			СписокПодразделений.Добавить(СтрокаПодразделения.Подразделение);
		КонецЦикла;
		ПодразделенияРолей.Вставить(СтрокаРоли.Роль, СписокПодразделений);
	КонецЦикла;
	
	Возврат ПодразделенияРолей;
	
КонецФункции

// Функция возвращает массив трудовых ресурсов, которыми владеет текущий сотрудник текущего пользователя.
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.упоТрудовыеРесурсы - трудовые ресурсы сотрудника.
//
Функция ПолучитьТрудовыеРесурсыТекущегоСотрудника() Экспорт
	
	МассивТрудовыхРесурсов = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.упоТекущийСотрудник);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВладениеРесурсамиСрезПоследних.Ресурс
	               |ИЗ
	               |	РегистрСведений.упоВладениеРесурсами.СрезПоследних(, Сотрудник = &Сотрудник) КАК ВладениеРесурсамиСрезПоследних
	               |ГДЕ
	               |	ВладениеРесурсамиСрезПоследних.ВладеетРесурсом";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивТрудовыхРесурсов = Результат.Выгрузить().ВыгрузитьКолонку("Ресурс");
	КонецЕсли;	
	
	Возврат МассивТрудовыхРесурсов;
	
КонецФункции

// Возвращает список трудовых ресурсов на заданную роль.
//
// Параметры:
//  Роль					 - СправочникСсылка.упоРоли
//  СписокТрудовыхРесурсов	 - СписокЗначений Из СправочникСсылка.упоТрудовыеРесурсы, Неопределено	 - список трудовых ресурсов роли.
//  СтрокаПоиска			 - Строка						 - строка поиска в подборе.
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.упоТрудовыеРесурсы - список трудовых ресурсов роли.
//
Функция ПолучитьТрудовыеРесурсыПоРоли(Роль, СписокТрудовыхРесурсов = Неопределено, СтрокаПоиска = "") Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("ОтборПоРесурсам", ЗначениеЗаполнено(СписокТрудовыхРесурсов));
	Запрос.УстановитьПараметр("СписокРесурсов", СписокТрудовыхРесурсов);
	Запрос.УстановитьПараметр("ОтборПоНаименованию", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.Ресурс
		|ИЗ
		|	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(
		|			,
		|			Роль = &Роль
		|				И ВЫБОР
		|					КОГДА &ОтборПоРесурсам
		|						ТОГДА Ресурс В (&СписокРесурсов)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК Рег
		|ГДЕ
		|	Рег.РольНазначена = ИСТИНА
		|	И ВЫБОР
		|			КОГДА &ОтборПоНаименованию
		|				ТОГДА Рег.Ресурс.Наименование ПОДОБНО &СтрокаПоиска
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ресурс");

КонецФункции

// Возвращает подразделение и роль трудового ресурса на заданную дату.
//
// Параметры:
//  ТрудовойРесурс	 - СправочникСсылка.упоТрудовыеРесурсы	 - Трудовой ресурс, для которого ищем подразделение.
//  Дата			 - Дата									 - Дата, на которую ищем подразделение и роль.
// 
// Возвращаемое значение:
//  Структура - Найденные значения.
//  * Подразделение - СправочникСсылка.упоПодразделения
//  * Роль - СправочникСсылка.упоРоли
//
Функция ПодразделениеИРольТрудовогоРесурсаНаЗаданнуюДату(ТрудовойРесурс, Дата) Экспорт
	
	ДатаАктуальности = КонецДня(Дата) + 1;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТрудовойРесурс", ТрудовойРесурс);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	// Последнее подразделение последней назначенной роли.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоРолиТрудовыхРесурсовСрезПоследних.Роль КАК Роль,
	|	упоРолиТрудовыхРесурсовСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ РолиРесурса
	|ИЗ
	|	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(&ДатаАктуальности, Ресурс = &ТрудовойРесурс) КАК упоРолиТрудовыхРесурсовСрезПоследних
	|ГДЕ
	|	упоРолиТрудовыхРесурсовСрезПоследних.РольНазначена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	упоСоставПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	упоСоставПодразделенийСрезПоследних.Роль КАК Роль,
	|	упоСоставПодразделенийСрезПоследних.Период КАК ПериодРегистрацииРолиВПодразделении,
	|	РолиРесурса.Период КАК ПериодРегистрацииТРПоРоли
	|ИЗ
	|	РегистрСведений.упоСоставПодразделений.СрезПоследних(
	|			&ДатаАктуальности,
	|			Роль В
	|				(ВЫБРАТЬ
	|					РолиРесурса.Роль
	|				ИЗ
	|					РолиРесурса)) КАК упоСоставПодразделенийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РолиРесурса КАК РолиРесурса
	|		ПО упоСоставПодразделенийСрезПоследних.Роль = РолиРесурса.Роль
	|ГДЕ
	|	упоСоставПодразделенийСрезПоследних.ВходитВСостав
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРегистрацииТРПоРоли УБЫВ,
	|	ПериодРегистрацииРолиВПодразделении УБЫВ";	
	
	Результат = Запрос.Выполнить();
	
	ПолученныеЗначения = Новый Структура("Подразделение, Роль");		
	
	Если Результат.Пустой() Тогда
		
		ПустоеПодразделение = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоПодразделения.ПустаяСсылка");		
		ПустаяРоль = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоРоли.ПустаяСсылка");
		ПолученныеЗначения.Подразделение = ПустоеПодразделение;
		ПолученныеЗначения.Роль = ПустаяРоль;
		
		Возврат ПолученныеЗначения;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ПолученныеЗначения.Подразделение = Выборка.Подразделение;
	ПолученныеЗначения.Роль = Выборка.Роль;	
	
	Возврат ПолученныеЗначения;
	
КонецФункции

// Проверяет, является ли текущий пользователь системы представителем
//  владельца текущего трудового ресурса.
//
// Параметры:
//  ТрудовойРесурс	 -СправочникСсылка.упоТрудовыеРесурсы
// 
// Возвращаемое значение:
//  Булево - признак того, что трудовой ресурс управляется текущим пользователем системы.
//
Функция РесурсУправляетсяТекущимПользователем(ТрудовойРесурс) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	РегТР.Ресурс КАК Ресурс
	               |ИЗ
	               |	РегистрСведений.упоВладениеРесурсами.СрезПоследних(
	               |			,
	               |			Сотрудник В (&СписокСотрудников)
	               |				И Ресурс = &ТрудовойРесурс) КАК РегТР
	               |ГДЕ
	               |	РегТР.ВладеетРесурсом";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокСотрудников", ПараметрыСеанса.упоСписокСотрудниковДиспетчера);
	Запрос.УстановитьПараметр("ТрудовойРесурс", ТрудовойРесурс);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();

КонецФункции

// Находит роль и подразделение назначенного исполнителя на задачу.
//
// Параметры:
//  Исполнитель         - СправочникСсылка.упоТрудовыеРесурсы
//  ПроектнаяЗадача     - ДокументСсылка.упоПроектнаяЗадача
//
// Возвращаемое значение:
//  Cтруктура:
//       * Роль - СправочникСсылка.упоРоли
//       * Подразделение - СправочникСсылка.упоПодразделения
//
Функция РольПодразделениеТрудовогоРесурсаПоЗадаче(Исполнитель, ПроектнаяЗадача) Экспорт
	
	Результат = Новый Структура("Роль, Подразделение");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса КАК Роль,
		|	упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
		|			,
		|			Версия = &Версия
		|				И Ресурс = &Исполнитель
		|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних";
	
	Запрос.УстановитьПараметр("Версия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача));
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Приводит пустое входящее значение к дате, а непустое - к концу дня.
//
// Параметры:
//  ДатаАктуальности - неприведенная дата актуальности.
// 
// Возвращаемое значение:
//  Дата - приведенная дата актуальности.
//
Функция ПриведеннаяДатаАктуальности(Знач ДатаАктуальности)
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = Дата(1,1,1);
	Иначе
		ДатаАктуальности = КонецДня(ДатаАктуальности);
	КонецЕсли;
	
	Возврат ДатаАктуальности;
	
КонецФункции

Функция ТекстПодразделенияРолей()
	
	// Первым должно выбираться последнее зарегистрированное подразделение.
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Рег.Подразделение КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА Рег.Период > &ДатаАктуальности
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		ИНАЧЕ Рег.Период
	               |	КОНЕЦ КАК Период
	               |ИЗ
	               |	РегистрСведений.упоСоставПодразделений.СрезПоследних(, Роль = &Роль) КАК Рег
	               |ГДЕ
	               |	Рег.ВходитВСостав
	               |	И &УсловиеПоискаПоСтроке
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ,
	               |	Подразделение";
	 
	Возврат ТекстЗапроса; 
	
КонецФункции

#КонецОбласти