
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Устанавливает значение устаревших реквизитов
// (требуются для совместимости с функционалом редакции 1)
// по значению реквизита ТипПроектнойЗадачи.
//
Процедура ЗаписатьТипЗадачи() Экспорт
	
	Если ЭтоМодельПакетаРабот = Ложь
		И ЭтоПакетРабот = Ложь
		И ЭтоВеха = Ложь Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Этап;	
		
	ИначеЕсли ЭтоМодельПакетаРабот = Ложь
		И ЭтоПакетРабот = Истина
		И ЭтоВеха = Ложь Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.ПакетРабот;
		
	ИначеЕсли ЭтоМодельПакетаРабот = Истина
		И ЭтоПакетРабот = Истина
		И ЭтоВеха = Ложь Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.МодельПакетаРабот;
		
	ИначеЕсли ЭтоМодельПакетаРабот = Ложь
		И ЭтоПакетРабот = Ложь
		И ЭтоВеха = Истина Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Веха;
		
	КонецЕсли;

КонецПроцедуры // ЗаписатьТипЗадачи()

// Функция формирует структуру обязательных реквизитов объекта.
// Для группы формируется только структура реквизитов шапки,
// для элемента формируется структура реквизитов шапки или табличной части.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	ЭтоEPM = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();
	
	// Формирование структуры обязательных реквизитов шапки
	Если ИмяТабличнойЧасти = Неопределено Тогда
		
		Если Не РучнойВводСроков И ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.МодельПакетаРабот Тогда 
			СтруктураОбязательныхПолей.Вставить("ДлительностьМоделиПакетаРабот");
			СтруктураОбязательныхПолей.Вставить("ЕдиницаНормированияДлительности");
		КонецЕсли;
		
	ИначеЕсли ЭтоВеха И (Не ИмяТабличнойЧасти = Неопределено) Тогда
				 
	// Формирование структуры обязательных реквизитов табличных частей
	ИначеЕсли ИмяТабличнойЧасти = "ПредУсловия" Тогда
		СтруктураОбязательныхПолей.Вставить("ЗадачаПредшественник");
	ИначеЕсли ИмяТабличнойЧасти = "МатериальныеРесурсы" Тогда
		СтруктураОбязательныхПолей.Вставить("Ресурс");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		СтруктураОбязательныхПолей.Вставить("Количество");
		СтруктураОбязательныхПолей.Вставить("ЕдиницаНормирования");
		Если ЭтоEPM Тогда
			СтруктураОбязательныхПолей.Вставить("СпособПривязкиПотребности");
		КонецЕсли;	
		Если ВключитьМатРесурсыВПланРасходов Тогда
			СтруктураОбязательныхПолей.Вставить("СпособПривязки");
			СтруктураОбязательныхПолей.Вставить("СтатьяЗатрат");
		КонецЕсли;		
	ИначеЕсли ИмяТабличнойЧасти = "ДополнительныеЗатраты" Тогда
		СтруктураОбязательныхПолей.Вставить("СтатьяЗатрат");
		СтруктураОбязательныхПолей.Вставить("Стоимость");
	ИначеЕсли ИмяТабличнойЧасти = "ПланДоходов" Или ИмяТабличнойЧасти = "ПланРасходов" Тогда
		СтруктураОбязательныхПолей.Вставить("Статья");
		СтруктураОбязательныхПолей.Вставить("Сумма");
		СтруктураОбязательныхПолей.Вставить("СпособПривязки");
	ИначеЕсли ИмяТабличнойЧасти = "ПланПоступлений" Или ИмяТабличнойЧасти = "ПланВыплат" Тогда
		СтруктураОбязательныхПолей.Вставить("Статья");
		СтруктураОбязательныхПолей.Вставить("Сумма");
		СтруктураОбязательныхПолей.Вставить("СпособПривязки");
	ИначеЕсли ИмяТабличнойЧасти = "Субпродукты" Тогда
		СтруктураОбязательныхПолей.Вставить("Ресурс");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		Если ЭтоEPM Тогда
			СтруктураОбязательныхПолей.Вставить("СпособПривязкиВыпуска");
		КонецЕсли;
		Если ВключитьСубпродуктыВПланДоходов Тогда
			СтруктураОбязательныхПолей.Вставить("СтатьяДоходов");
			СтруктураОбязательныхПолей.Вставить("СпособПривязки");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Тип: Булево. Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	// Наименование заполняется для целей корректного формирования заголовка сообщения при отказе записи.
	Наименование = ПолноеНаименование;
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Тип: Булево. Признак отказа от выполнения операции.
// 
// Возвращаемое значение:
//  Нет.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
	упоПроектыИЗадачиВызовСервера.обПроверитьДопустимостьЗаписиШаблонаЗадачи(ЭтотОбъект, Отказ, Заголовок);
	упоПроектыИЗадачиВызовСервера.обПроверитьПредусловияШаблонаЗадачи(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьДанныеПередЗаписью()

#Область ПроцедурыИФункцииПодбора

// Процедура для вызова при подборе ресурсов.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура 	- данные строки.
//  ПараметрыПодбора	 - СписокЗначений 							- список параметров подбора.
//
Процедура ВыполнитьДействияПриПодборе(Знач СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт

	Если НЕ ПараметрыПодбора = Неопределено И НЕ ПараметрыПодбора.Количество() = 0 Тогда      
		Для каждого ПараметрПодбора Из ПараметрыПодбора Цикл
			
			// прямое обращение к реквизитам на всякий случай оборачиваем в try
			Попытка 				
				Если ПараметрПодбора.Представление = "ИмяТабличнойЧасти" Тогда      					
					Если ПараметрПодбора.Значение = "ПланПоступлений" ИЛИ ПараметрПодбора.Значение = "ПланВыплат"
						ИЛИ ПараметрПодбора.Значение = "ПланДоходов" ИЛИ ПараметрПодбора.Значение = "ПланРасходов" Тогда     
						
						// попробуем определить договор контрагента по умолчанию
						
						Если НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаТабличнойЧасти.Контрагент) Тогда      
							СтрокаТабличнойЧасти.Договор = СтрокаТабличнойЧасти.Контрагент.упоОсновнойДоговорКонтрагента;
						КонецЕсли; 							
					ИначеЕсли ПараметрПодбора.Значение = "ТрудовыеРесурсы" Тогда
						
						упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, НормаСтоимостиТрудовыхРесурсов);				
						
					КонецЕсли; 			
					
					Продолжить;				
				КонецЕсли; 
				
			// устанавливаем только те колонки, которые еще не были заполнены пользователем
				
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаТабличнойЧасти[ПараметрПодбора.Представление]) Тогда      
				СтрокаТабличнойЧасти[ПараметрПодбора.Представление]	= ПараметрПодбора.Значение;	
			КонецЕсли; 			
				
			Исключение
				// некорректное имя колонки
			КонецПопытки;
			
		КонецЦикла; 

	Иначе
	     упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры // ЗаписатьСсылку()

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура();

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

			
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоКода модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации кода.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоКода()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ОбъектКопирования – СправочникОбъект, исходный элемент, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	упоПроектыИЗадачиОбщие.ЗаписатьТипЗадачи(ЭтотОбъект);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Этап;
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда 
		Возврат;	
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	// Примечание: в веб-клиенте принудительно заполняется поле "Родитель" при ручном создании элемента,
	// поэтому его необходимо очищать.
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		ПоляИсключения = ?(ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент(), "Родитель", "");		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, , ПоляИсключения);
	КонецЕсли;
	
	упоПроектыИЗадачиОбщие.ЗаписатьТипЗадачи(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи элемента.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
	ПроверитьДанныеПередЗаписью(Отказ);

	Если НЕ Отказ Тогда
		
		Наименование 		   	= ПолноеНаименование;
		НазваниеПроектнойЗадачи = ПолноеНаименование;
		
		упоПроектыИЗадачиОбщие.ЗаписатьТипЗадачи(ЭтотОбъект);
		ДлительностьМоделиПакетаРаботВЧасах = ДлительностьМоделиПакетаРабот * ЕдиницаНормированияДлительности.Коэффициент;
		
		Для каждого предусловие Из ПредУсловия Цикл
		    Если НЕ ЗначениеЗаполнено(предусловие.ТипСвязи) Тогда
				предусловие.ТипСвязи = Перечисления.упоТипСвязи.ОкончаниеНачало;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(предусловие.ЕдиницаНормированияДлительности) Тогда
				предусловие.ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.Час;
			КонецЕсли;
			
			предусловие.ЗадержкаВЧасах = предусловие.Задержка * предусловие.ЕдиницаНормированияДлительности.Коэффициент;
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();	
	
	МассивНепроверяемыхРеквизитов.Добавить("Наименование"); 
	
	Если НЕ РучнойВводСроков Тогда 
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаПлан"); 
		МассивНепроверяемыхРеквизитов.Добавить("ДатаЗавершенияПлан");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ПроверяемыеТЧ = ПроверяемыеТабличныеЧасти();
	
	упоАналитикаПоПодразделениямСервер.ПроверитьЗаполнениеТабличныхЧастей(ЭтотОбъект, ПроверяемыеТЧ, Отказ);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = Справочники.Проекты.ПустаяСсылка();
		
КонецПроцедуры

Функция ПроверяемыеТабличныеЧасти()
	
	МассивПроверяемыхТЧ = Новый Массив;
	МассивПроверяемыхТЧ.Добавить("ПланРасходов");
	МассивПроверяемыхТЧ.Добавить("ТрудовыеРесурсы");
	МассивПроверяемыхТЧ.Добавить("ПланДоходов");
	МассивПроверяемыхТЧ.Добавить("РаспределениеОбъемов");
	Если ВключитьСубпродуктыВПланДоходов Тогда
		МассивПроверяемыхТЧ.Добавить("Субпродукты");
	КонецЕсли;
	МассивПроверяемыхТЧ.Добавить("РаспределениеДоходов");
	МассивПроверяемыхТЧ.Добавить("РаспределениеРасходов");
	Если ВключитьМатРесурсыВПланРасходов Тогда
		МассивПроверяемыхТЧ.Добавить("МатериальныеРесурсы");
	КонецЕсли;
	Если ВключитьДопЗатратыВПланРасходов Тогда
		МассивПроверяемыхТЧ.Добавить("ДополнительныеЗатраты");
	КонецЕсли;
    МассивПроверяемыхТЧ.Добавить("РаспределениеДополнительныхЗатрат");
	МассивПроверяемыхТЧ.Добавить("РаспределениеПотребностей");
	
	ПроверяемыеТЧ = Новый СписокЗначений;
	Для Каждого ПроверямаяТЧ Из МассивПроверяемыхТЧ Цикл
		ПроверяемыеТЧ.Добавить(ПроверямаяТЧ, 
			упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ПроверямаяТЧ));
	КонецЦикла;
	
	Возврат ПроверяемыеТЧ;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли