////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с ДДС.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает таблицу дней рабочего календаря за указанный год.
//
// Параметры:
//  Календарь	 - СправочникСсылка.упоРабочиеКалендари	 - календарь.
//  ГодКалендаря - Дата									 - год календаря.
//  БезВыходных	 - Булево								 - признак получения календаря без выходных.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица дней календаря.
//
Функция ПолучитьРабочийКалендарь(Календарь, ГодКалендаря, БезВыходных = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ГодКалендаря) ИЛИ НЕ ЗначениеЗаполнено(Календарь) Тогда      
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Календарь" , Календарь);
	Запрос.УстановитьПараметр("НачПериода", НачалоГода(ГодКалендаря));
	Запрос.УстановитьПараметр("КонПериода", КонецГода(ГодКалендаря));
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.День,
		|	Рег.КоличествоЧасов
		|ИЗ
		|	РегистрСведений.упоРабочиеКалендари.СрезПоследних(,
		|		Календарь = &Календарь
		|		И (День МЕЖДУ &НачПериода И &КонПериода)
		|	) КАК Рег";
	
	Если БезВыходных Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "ГДЕ Рег.КоличествоЧасов > 0";		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено; // нет сведений
	КонецЕсли;
	
	Возврат Результат.Выгрузить(); // таблица календаря на год
	
КонецФункции

#КонецОбласти
