
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Предопределенный Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);           
	
	Элементы.ТаблицаПолучателя.СписокВыбора.Очистить();
	масНужныеТипы = Новый Массив;
	масНужныеТипы.Добавить("Справочники");
	Пар = Новый Структура("масНужныеТипы",масНужныеТипы);
	Спис = упоОповещенияВызовСервера.ПолучитьСписокДоступныхТаблиц(Пар);
	Для Каждого Эл Из Спис Цикл
		Элементы.ТаблицаПолучателя.СписокВыбора.Добавить(Эл.Значение,Эл.Представление);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ПрочитатьПараметрыАдресаОтправки(Параметры.ЗначениеКопирования);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.упоВидыПолучателейОповещений.Форма.ФормаВводаПоляАдреса" Тогда
		
		ТекДанные = Объект.АдресаОтправки.НайтиПоИдентификатору(ВыбранноеЗначение.УИстроки);
		
		Если ТекДанные <> Неопределено Тогда
			ТекДанные.ПолеАдресаПараметры = Новый Структура();
			Для Каждого Эл Из ВыбранноеЗначение Цикл
				Если НЕ Эл.Ключ = "УИстроки" И НЕ Эл.Ключ = "ПредставлениеПоляАдреса" Тогда
					ТекДанные.ПолеАдресаПараметры.Вставить(Эл.Ключ,Эл.Значение);	
				КонецЕсли;
			КонецЦикла;
			ТекДанные.ПолеАдреса = ВыбранноеЗначение.ПредставлениеПоляАдреса;
			ТекДанные.ОписаниеХраненияАдреса = ВыбранноеЗначение.ОписаниеХраненияАдреса;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	тз = Объект.АдресаОтправки.Выгрузить();
	ТекущийОбъект.АдресаОтправки.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = ТекущийОбъект.АдресаОтправки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрТз);
		НовСтр.ПолеАдресаХЗ = Новый ХранилищеЗначения(СтрТз.ПолеАдресаПараметры);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ПрочитатьПараметрыАдресаОтправки(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);          
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);          
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);     
	
	ПрочитатьПараметрыАдресаОтправки(ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);     
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);     
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
	П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресаОтправкиПолеАдресаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.АдресаОтправки.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ВариантХраненияПоляАдреса) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Укажите где хранится поле адреса'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ВариантХраненияПоляАдреса = ПредопределенноеЗначение("Перечисление.упоВариантыХраненияПоляАдреса.ВПолучателе") Тогда
		СписокРеквизитовОбъекта = упоОповещенияВызовСервера.ПолучитьСписокВозможныхРеквизитовДляХраненияАдресов(Объект.ТаблицаПолучателя);
		ДанныеВыбора = Новый СписокЗначений;
		Для Каждого Эл Из СписокРеквизитовОбъекта Цикл
			ДанныеВыбора.Добавить(Эл.Значение,Эл.Представление);	
		КонецЦикла;
	Иначе
		
		Пар = Новый Структура;
		Пар.Вставить("ТаблицаПолучателя",Объект.ТаблицаПолучателя);
		Пар.Вставить("ВариантХраненияПоляАдреса",ТекДанные.ВариантХраненияПоляАдреса);
		Пар.Вставить("УИстроки",ТекДанные.ПолучитьИдентификатор());
		Пар.Вставить("ОписаниеХраненияАдреса",ТекДанные.ОписаниеХраненияАдреса);
		
		ПолеАдресаПараметры = ТекДанные.ПолеАдресаПараметры;
		Если ТипЗнч(ПолеАдресаПараметры) = Тип("Структура") Тогда
			Для Каждого Эл Из ПолеАдресаПараметры Цикл 
				Пар.Вставить(Эл.Ключ,Эл.Значение);
			КонецЦикла;
		КонецЕсли;
		
		ОткрытьФорму("Справочник.упоВидыПолучателейОповещений.Форма.ФормаВводаПоляАдреса",Пар,ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПрочитатьПараметрыАдресаОтправки(ТекущийОбъект) 
	
	тз = ТекущийОбъект.АдресаОтправки.Выгрузить();
	Объект.АдресаОтправки.Очистить();
	Для Каждого СтрТз Из тз Цикл
		НовСтр = Объект.АдресаОтправки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрТз);
		НовСтр.ПолеАдресаПараметры = СтрТз.ПолеАдресаХЗ.Получить();	
	КонецЦикла;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
