////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с деревьями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПовышениеПонижениеУровняЗадачи

// Повышает уровень задачи в дереве.
//
// Параметры:
//  Элементы		 - Произвольный	 - коллекция элементов формы.
//  Дерево			 - ДанныеФормыДерево - дерево значений.
//  ИмяЭлементаФормы - Строка			 - имя элемента формы-дерева.
//  КлючРодитель	 - Строка			 - имя колонки, содержащей ссылку на родителя.
//  Ключ			 - Строка			 - имя колонки, содержащей ссылку на нового родителя.
//  ЗаполнятьИндекс	 - Булево
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ПовыситьУровеньЗадачи(Элементы, Дерево, ИмяЭлементаФормы, КлючРодитель = "ЭтапРодитель", Ключ = "Этап", ЗаполнятьИндекс = Ложь) Экспорт
	
	новыеРодители = Новый Соответствие;
	старыеРодители = Новый Соответствие;
	
	сдвигаемыеСтроки = Новый Массив;
	
	Для каждого ид Из Элементы[ИмяЭлементаФормы].ВыделенныеСтроки Цикл
		строкаДерева = Дерево.НайтиПоИдентификатору(ид);
		сдвигаемыеСтроки.Добавить(строкаДерева);
	КонецЦикла;
	
	Для каждого сдвигаемыйЭлемент Из сдвигаемыеСтроки Цикл
		старыйРодитель = сдвигаемыйЭлемент.ПолучитьРодителя();
		новыйРодитель = Неопределено;
		
		Если НЕ старыйРодитель = Неопределено Тогда
			новыйРодитель = старыйРодитель.ПолучитьРодителя();
			Если новыйРодитель = Неопределено Тогда
				новыйРодитель = Дерево;
			КонецЕсли;
			
			идВставки = новыйРодитель.ПолучитьЭлементы().Индекс(старыйРодитель) + 1;
		КонецЕсли;
		
		Если НЕ новыйРодитель = Неопределено Тогда
			новыеДети = новыеРодители[новыйРодитель];
			Если новыеДети = Неопределено Тогда
				новыеДети = Новый Массив;
			КонецЕсли;
			новыеДети.Добавить(Новый Структура("элемент, индексВставки", сдвигаемыйЭлемент, идВставки));
			новыеРодители.Вставить(новыйРодитель, новыеДети);
			
			старыеДети = старыеРодители[старыйРодитель];
			Если старыеДети = Неопределено Тогда
				старыеДети = Новый Массив;
			КонецЕсли;
			старыеДети.Добавить(сдвигаемыйЭлемент);
			старыеРодители.Вставить(старыйРодитель, старыеДети);
			
		КонецЕсли;
		
		Если ТипЗнч(сдвигаемыйЭлемент) = ТипЗнч(новыйРодитель) Тогда 
			сдвигаемыйЭлемент[КлючРодитель] 	= новыйРодитель[Ключ];
			Если ЗаполнятьИндекс Тогда
				сдвигаемыйЭлемент["ИндексСвязиЭтапаРодитель"] 	= новыйРодитель["ИндексСвязиЭтапа"];
			КонецЕсли;
		Иначе
			сдвигаемыйЭлемент[КлючРодитель] 	= Неопределено;	
			Если ЗаполнятьИндекс Тогда
				сдвигаемыйЭлемент["ИндексСвязиЭтапаРодитель"] 	= Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого КиЗ Из новыеРодители Цикл
		лКоличествоПодчиненных = 0;
		колво = КиЗ.Значение.Количество();
		Для сч = 1 По колво Цикл
			лЭлемент = КиЗ.Значение[колво - сч];
			новаяСтрока = КиЗ.Ключ.ПолучитьЭлементы().Вставить(лЭлемент.индексВставки);
			ЗаполнитьЗначенияСвойств(новаяСтрока, лЭлемент.элемент);
			СкопироватьВРодителя(лЭлемент.элемент.ПолучитьЭлементы(), новаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Для каждого КиЗ Из старыеРодители Цикл
		лЭлементы = КиЗ.Ключ.ПолучитьЭлементы();
		Для каждого удаляемыйЭлемент Из КиЗ.Значение Цикл
			лЭлементы.Удалить(удаляемыйЭлемент);
		КонецЦикла;
	КонецЦикла;
	
	Для каждого новыйРодитель Из новыеРодители Цикл
		Если НЕ новыйРодитель.Ключ = Дерево Тогда
			Элементы[ИмяЭлементаФормы].Развернуть(новыйРодитель.Ключ.ПолучитьИдентификатор(), Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Понижает уровень задачи в дереве.
//
// Параметры:
//  Элементы		 - Произвольный	 - коллекция элементов формы.
//  Дерево			 - ДанныеФормыДерево - дерево значений.
//  ИмяЭлементаФормы - Строка			 - имя элемента формы-дерева.
//  КлючРодитель	 - Строка			 - имя колонки, содержащей ссылку на родителя.
//  Ключ			 - Строка			 - имя колонки, содержащей ссылку на нового родителя.
//  ЗаполнятьИндекс	 - Булево
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ПонизитьУровеньЗадачи(Элементы, Дерево, ИмяЭлементаФормы, КлючРодитель = "ЭтапРодитель", Ключ = "Этап", ЗаполнятьИндекс = Ложь) Экспорт
	
	новыеРодители 		= Новый Соответствие;
	СтарыеРодители 		= Новый Соответствие;
	СдвигаемыеЭлементы 	= Новый Соответствие;
	СдвигаемыеСтроки 	= Новый Массив;
	
	Для каждого ид Из Элементы[ИмяЭлементаФормы].ВыделенныеСтроки Цикл
		строкаДерева = Дерево.НайтиПоИдентификатору(ид);
		сдвигаемыеСтроки.Добавить(строкаДерева);
	КонецЦикла;
	
	Для каждого сдвигаемыйЭлемент Из сдвигаемыеСтроки Цикл
		сдвигаемыеЭлементы.Вставить(сдвигаемыйЭлемент, Истина);
	КонецЦикла;
	
	Для каждого сдвигаемыйЭлемент Из сдвигаемыеСтроки Цикл
		старыйРодитель = сдвигаемыйЭлемент.ПолучитьРодителя();
		новыйРодитель = ОпределитьПредыдущуюСтроку(Дерево, сдвигаемыйЭлемент, старыйРодитель);
		
		Если НЕ новыйРодитель = Неопределено Тогда
			РодительСдвигаемого = сдвигаемыеЭлементы[новыйРодитель];
			Если НЕ РодительСдвигаемого = Неопределено Тогда
				Если НЕ РодительСдвигаемого = Истина Тогда
					новыйРодитель = РодительСдвигаемого;
				КонецЕсли;
			КонецЕсли;
			
			новыеДети = новыеРодители[новыйРодитель];
			Если новыеДети = Неопределено Тогда
				новыеДети = Новый Массив;
			КонецЕсли;
			новыеДети.Добавить(сдвигаемыйЭлемент);
			новыеРодители.Вставить(новыйРодитель, новыеДети);
			
			старыеДети = старыеРодители[старыйРодитель];
			Если старыеДети = Неопределено Тогда
				старыеДети = Новый Массив;
			КонецЕсли;
			старыеДети.Добавить(сдвигаемыйЭлемент);
			старыеРодители.Вставить(старыйРодитель, старыеДети);
			сдвигаемыеЭлементы.Вставить(сдвигаемыйЭлемент, новыйРодитель);
			сдвигаемыйЭлемент[КлючРодитель] = новыйРодитель[Ключ];   
			Если ЗаполнятьИндекс Тогда
				сдвигаемыйЭлемент["ИндексСвязиЭтапаРодитель"] = новыйРодитель["ИндексСвязиЭтапа"];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого КиЗ Из новыеРодители Цикл
		лКоличествоПодчиненных = 0;
		СкопироватьВРодителя(КиЗ.Значение, КиЗ.Ключ);
	КонецЦикла;
	
	Для каждого КиЗ Из старыеРодители Цикл
		лКоличествоПодчиненных = 0;
		
		лЭлементы = КиЗ.Ключ.ПолучитьЭлементы();
		
		Для каждого удаляемыйЭлемент Из КиЗ.Значение Цикл
			лЭлементы.Удалить(удаляемыйЭлемент);
		КонецЦикла;
	КонецЦикла;
	
	Для каждого новыйРодитель Из новыеРодители Цикл
		Элементы[ИмяЭлементаФормы].Развернуть(новыйРодитель.Ключ.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецФункции

// Определяет предыдущую строку.
//
// Параметры:
//  Дерево			 - ДеревоЗадач	 		 - дерево.
//  НекаяСтрока		 - СтрокаДереваЗначений  - строка.
//  родительСтроки	 - СтрокаДереваЗначений, ДеревоЗначений	 - строка.
// 
// Возвращаемое значение:
//  СтрокаДереваЗначений - строка.
//
Функция ОпределитьПредыдущуюСтроку(Дерево, НекаяСтрока, родительСтроки) Экспорт
	
	Если родительСтроки = Неопределено Тогда
		родительСтроки = Дерево;
	КонецЕсли;
	
	лЭлементы = родительСтроки.ПолучитьЭлементы();
	индексВРодителе = лЭлементы.Индекс(некаяСтрока);
	Если индексВРодителе = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат лЭлементы[индексВРодителе-1];
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПеретаскиваниеЗадач

// Обработчик, вызываемый при окончании перетаскивания в поле - приемнике данных.
//
// Параметры:
//  Элементы				 - Произвольный 	- коллекция элементов формы.
//  Этаформа				 - УправляемаяФорма - форма, которой принадлежит дерево.
//  ИмяРеквизита			 - Строка 			- имя реквизита формы-дерева.
//  ИмяЭлементаФормы		 - Строка 			- имя элемента формы-дерева.
//  Элемент					 - Произвольный 	- не используется.
//  ПараметрыПеретаскивания	 - Произвольный 	- содержит перетаскиваемое значение.
//  СтандартнаяОбработка	 - Булево			- признак стандартной обработки.
//  Строка					 - Строка 			- содержит ИД приемника.
//  Поле					 - Произвольный 	- не используется.
//  ПолеГруппировки			 - Соответствие		- имена поляей группировки.
//
Процедура ДеревоЭтаповПеретаскивание(Элементы, Этаформа, ИмяРеквизита, ИмяЭлементаФормы,
	Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, ПолеГруппировки) Экспорт
	
	СтандартнаяОбработка 	= Ложь;
	РеквизитДерево 			= ЭтаФорма[ИмяРеквизита];
	ИДПриемник 				= Строка;
	Приемник 				= ?(ИДПриемник = Неопределено, Неопределено, РеквизитДерево.НайтиПоИдентификатору(ИДПриемник));
	МассивИДИсточник 		= ПараметрыПеретаскивания.Значение;
	
	Для Каждого ИДИсточник Из МассивИДИсточник Цикл 
		
		Источник 	= РеквизитДерево.НайтиПоИдентификатору(ИДИсточник); 
		НоваяСтрока = СкопироватьСтрокуДерева(РеквизитДерево, Приемник, Источник, ПолеГруппировки);
		
		Если Приемник = Неопределено И НоваяСтрока<>Неопределено Тогда
			Элементы[ИмяЭлементаФормы].Развернуть(НоваяСтрока.ПолучитьИдентификатор(), Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Приемник = Неопределено Тогда
		Элементы[ИмяЭлементаФормы].Развернуть(ИДПриемник, Истина);
	КонецЕсли;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		упоУправлениеДоговорамиКлиентСервер.ПересчитатьВетвьДрева(ЭтаФорма[ИмяРеквизита].ПолучитьЭлементы());
		упоУправлениеДоговорамиКлиент.ПроставитьКартинкиЭтапов(ЭтаФорма[ИмяРеквизита].ПолучитьЭлементы());	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаРеквизитов 

// Заполняет колонки в дереве соответствующими значениями из параметра-структуры.
//
// Параметры:
//  СтрокиДерева				 - КоллекцияСтрокДереваЗначений - строки дерева, значения которых надо заполнить.
//  СтруктураЗаполняемыхДанных	 - Структура 					- коллекция элементов ключ-значение, на основании которых
//									надо заполнить значения соответствующих колонок строк дерева.
//  СписокПроверяемыхКолонок 	 - Массив 						- именя колонок для проверки заполнения перед заполнением
//
Процедура ПроставитьРеквизитВДереве(СтрокиДерева, СтруктураЗаполняемыхДанных, СписокПроверяемыхКолонок = Неопределено) Экспорт
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ИндексКартинки = 0 Тогда 
			ВыполнитьЗаполнение = Истина;
			Если СписокПроверяемыхКолонок <> Неопределено Тогда	
				ВыполнитьЗаполнение = Ложь;
				Для Каждого ИмяКолонки Из СписокПроверяемыхКолонок Цикл
					ВыполнитьЗаполнение = ВыполнитьЗаполнение Или ЗначениеЗаполнено(СтрокаДерева[ИмяКолонки]);
				КонецЦикла;
			КонецЕсли;
			Если ВыполнитьЗаполнение Тогда
				ЗаполнитьЗначенияСвойств(СтрокаДерева,СтруктураЗаполняемыхДанных);
			КонецЕсли;
		КонецЕсли;
		СтрокиДереве = СтрокаДерева.ПолучитьЭлементы();
		Если СтрокиДереве.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ПроставитьРеквизитВДереве(СтрокиДереве, СтруктураЗаполняемыхДанных, СписокПроверяемыхКолонок);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СворачиваниеРазворачиваниеДерева

Процедура СвернутьСтрокиДерева(ЭлементДерево, СоотвУровняДерева, КолвоУровней = Неопределено) Экспорт
	
	КоличествоУровнейДерева = СоотвУровняДерева.Количество();
	Если КоличествоУровнейДерева = 0 Тогда
		КолвоУровней = 0;
		Возврат;
	КонецЕсли;
	
	сч = КоличествоУровнейДерева - 1;
	Если КолвоУровней = Неопределено Тогда
		КолвоУровней = 0;
	КонецЕсли;
	
	СписокУИДСтрокДляСворачивания = Новый СписокЗначений;
	Пока сч >= КолвоУровней Цикл
		СписокУИДСтрок = СоотвУровняДерева[сч];
		Для Каждого ЭлементУИД Из СписокУИДСтрок Цикл
			СписокУИДСтрокДляСворачивания.Добавить(ЭлементУИД.Значение);
		КонецЦикла;
		сч = сч - 1;
	КонецЦикла;	
	
	СписокУИДСтрокДляСворачивания.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	Для Каждого ЭлементУИД Из СписокУИДСтрокДляСворачивания Цикл
		Если ЭлементДерево.Развернут(ЭлементУИД.Значение) Тогда
			ЭлементДерево.Свернуть(ЭлементУИД.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СвернутьСтрокиДереваПервогоУровня(Форма, ИмяРеквизитаДерева) Экспорт
	
	ЭлементДерево = Форма.Элементы[ИмяРеквизитаДерева];
	ЭлементыДерева = Форма[ИмяРеквизитаДерева].ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл	
		ЭлементДерево.Свернуть(СтрокаДерева.ПолучитьИдентификатор());			
	КонецЦикла;
	
КонецПроцедуры	

Процедура РазвернутьСтрокиДерева(Форма, ИмяРеквизитаДерева, СПодчиненными = Истина) Экспорт
	
	ЭлементДерево = Форма.Элементы[ИмяРеквизитаДерева];
	ЭлементыДерева = Форма[ИмяРеквизитаДерева].ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл	
		ЭлементДерево.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), СПодчиненными);			
	КонецЦикла;
	
КонецПроцедуры

Процедура РазвернутьДеревоДоУровня(ЭлементДерево, Знач Уровень, СоотвУровняДерева) Экспорт
	
	СвернутьСтрокиДерева(ЭлементДерево, СоотвУровняДерева, Уровень);
	
	Если Уровень = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СписокИДСтрокТекущегоУровня = СоотвУровняДерева[Уровень-1];
	Для Каждого ЭлеменСписка Из СписокИДСтрокТекущегоУровня Цикл
		ЭлементДерево.Развернуть(ЭлеменСписка.Значение);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКоличествоУровнейДерева(Дерево, Знач Уровень = 0, врСоотвУровняДерева, ТекУровень = Неопределено) Экспорт
	
	// Добавить возможность быстро свернуть\развернуть дерево до определенного уровня.
	Если ТекУровень = Неопределено Тогда
		ТекУровень = 0;
	КонецЕсли;
	Элементы = Дерево.ПолучитьЭлементы();
	Если Элементы.Количество() = 0 Тогда
		Возврат Уровень;
	КонецЕсли;
	СписокСтрок = Новый СписокЗначений;
	Для каждого Элемент Из Элементы Цикл
		Уровень = ПолучитьКоличествоУровнейДерева(Элемент, Уровень, врСоотвУровняДерева, ТекУровень + 1);
		СписокСтрок.Добавить(Элемент.ПолучитьИдентификатор());
		максУровень = Макс(Уровень, ТекУровень);
	КонецЦикла;
	
	СписокИДСтрок = врСоотвУровняДерева[ТекУровень];
	Если СписокИДСтрок = Неопределено Тогда
		врСоотвУровняДерева.Вставить(ТекУровень, СписокСтрок);
	Иначе
		Для каждого ИДСтроки Из СписокСтрок Цикл
			СписокИДСтрок.Добавить(ИДСтроки.Значение);
		КонецЦикла;
	КонецЕсли;

	Возврат максУровень;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкопироватьСтрокуДерева(РеквизитДерево, Приемник, Источник, ПолеГруппировки)
	
	Если Источник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Приемник = Неопределено Тогда 
		НоваяСтрока = РеквизитДерево.ПолучитьЭлементы().Добавить();	
	Иначе
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Источник);
	Если Не Приемник = Неопределено Тогда 
		//НоваяСтрока[ПолеГруппировки] = Приемник.Этап;
		Для Каждого Колонка Из ПолеГруппировки Цикл
			НоваяСтрока[Колонка.Ключ] = Приемник[Колонка.Значение];
		КонецЦикла;
		
	Иначе
		//НоваяСтрока[ПолеГруппировки] = Неопределено;
		Для Каждого Колонка Из ПолеГруппировки Цикл
			НоваяСтрока[Колонка.Ключ] = Неопределено;
		КонецЦикла;
	КонецЕсли;
	КолПодчиненныхСтрок 		= Источник.ПолучитьЭлементы().Количество();
	Для ОбратныйИндекс = 1 По КолПодчиненныхСтрок Цикл
		ПодчиненнаяСтрока = Источник.ПолучитьЭлементы()[КолПодчиненныхСтрок - ОбратныйИндекс];
		СкопироватьСтрокуДерева(РеквизитДерево, НоваяСтрока, ПодчиненнаяСтрока, ПолеГруппировки);
	КонецЦикла;
	
	Если Источник.ПолучитьРодителя() = Неопределено Тогда
		РеквизитДерево.ПолучитьЭлементы().Удалить(Источник);
	Иначе
		Источник.ПолучитьРодителя().ПолучитьЭлементы().Удалить(Источник);
	КонецЕсли; 
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура СкопироватьВРодителя(пСтроки, новыйРодитель, пНовыйЭлемент = Ложь)
	
	лЭлементы = новыйРодитель.ПолучитьЭлементы();
	
	Для каждого добавляемыйЭлемент Из пСтроки Цикл
		новаяСтрока = лЭлементы.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, добавляемыйЭлемент);
		
		Если пНовыйЭлемент Тогда
			предРодитель = Ложь;
			Если лЭлементы.Количество() = 1 Тогда
				предЭлемент = новыйРодитель;
				предРодитель = Истина;
			Иначе
				предЭлемент = лЭлементы[лЭлементы.Количество() - 2];
			КонецЕсли;
		КонецЕсли;
		СкопироватьВРодителя(добавляемыйЭлемент.ПолучитьЭлементы(), новаяСтрока, пНовыйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


