
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	ОбработатьЗаполнение(); 
	
КонецПроцедуры


&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыНаФорму(); 

КонецПроцедуры


&НаКлиенте
Процедура ИКТ_ПриОткрытииПосле(Отказ)
	
	ОбработатьОткрытие(); 
	
КонецПроцедуры


&НаКлиенте
Процедура ИКТ_ПослеЗаписиПосле(ПараметрыЗаписи)

	ПроверитьНаличиеДокументаУОС();
	
КонецПроцедуры


&НаКлиенте
Процедура ИКТ_ОрганизацияПриИзмененииПосле(Элемент)    
	
	ДобавитьРеквизитыНаФорму(); 
	
КонецПроцедуры


#Область ДоработкиЛС
&НаСервере
Процедура ДобавитьРеквизитыНаФорму()  
	
	Если ИКТ_ЗП_УОС.ЕстьПраваУОС() Тогда
		НайденнаяКоманда = Команды.Найти("ОткрытьСвязанныйДокумент");   
		Если НайденнаяКоманда = Неопределено Тогда
			Команда = Команды.Добавить("ОткрытьСвязанныйДокумент"); 
			Команда.Заголовок = "ОткрытьСвязанныйДокумент";
			Команда.Действие  = "ОткрытьСвязанныйДокумент"; 
		КонецЕсли;
		
		НайденнаяКоманда = Команды.Найти("СоздатьСвязанныйДокумент");   
		Если НайденнаяКоманда = Неопределено Тогда
			Команда = Команды.Добавить("СоздатьСвязанныйДокумент"); 
			Команда.Заголовок = "СоздатьСвязанныйДокумент";
			Команда.Действие  = "СоздатьСвязанныйДокумент"; 
		КонецЕсли;
		
		ЭтоБухгалтерскаяОрганизация = ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Объект.Организация);
		ЭтоУОС = ИКТ_ЗП_УОС.ЭтоУОС(Объект.Организация);
		
		Элемент = Элементы.Найти("ИКТ_СоздатьСвязанныйДокумент"); 
		
		Если Элемент = Неопределено Тогда  
			
			Если ЭтоБухгалтерскаяОрганизация Тогда
				
				СвязанныйДокумент = ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка);
				
				Если НЕ ЗначениеЗаполнено(СвязанныйДокумент) Тогда
					НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СоздатьСвязанныйДокумент", Тип("КнопкаФормы"), Элементы.Шапка);
					НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка; 
					НовыйЭлемент.Заголовок = "Создать документ УОС";
					НовыйЭлемент.ИмяКоманды = "СоздатьСвязанныйДокумент";
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			Если ЭтоБухгалтерскаяОрганизация Тогда
				Элемент.Видимость = Истина;
			Иначе
				Элемент.Видимость = Ложь; 
			КонецЕсли;
			
		КонецЕсли;      
		
		Элемент = Элементы.Найти("ИКТ_СвязанныйДокумент"); 
		
		Если Элемент = Неопределено Тогда  
			
			Если ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС Тогда
				
				СвязанныйДокумент = ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка);
				
				Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда
					НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СвязанныйДокумент", Тип("КнопкаФормы"), Элементы.Шапка);
					НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка; 
					НовыйЭлемент.Заголовок = СтрШаблон("%1 %2", ?(ЭтоУОС, "БУ", "УОС"), СвязанныйДокумент);
					НовыйЭлемент.ИмяКоманды = "ОткрытьСвязанныйДокумент";
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС Тогда
				Элемент.Видимость = Истина;
			Иначе
				Элемент.Видимость = Ложь; 
			КонецЕсли;
			
		КонецЕсли;   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвязанныйДокумент()
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПолучитьСвязанныйДокумент());
	
	ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);

КонецПроцедуры    

&НаСервере
Функция ПолучитьСвязанныйДокумент()

	Возврат ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка); 

КонецФункции

&НаКлиенте
Процедура СоздатьСвязанныйДокумент()  
	
	Если НЕ Объект.Проведен ИЛИ Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед вводом документа УОС требуется провести документ.");
	
	Иначе
	
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("УОС", Истина);
		ПараметрыФормы.Вставить("ДокументИсточник", Объект.Ссылка);
		
		ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ОбработатьЗаполнение()
	
	Если Параметры.Свойство("УОС") И Параметры.УОС = Истина Тогда
			
		ОбъектДляКопирования = ИКТ_ЗП_УОС.СоздатьСвязанныйДокумент(Параметры.ДокументИсточник);
		ЗначениеВРеквизитФормы(ОбъектДляКопирования, "Объект");
		Объект.ИКТ_ДокументИсточник = Параметры.ДокументИсточник;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеДокументаУОС()
	
	Если ИКТ_ЗП_УОС.ЕстьПраваУОС() Тогда
		
		Оповестить("ИКТ_ЗаписанДокумент");
		
		Если НЕ ЭтоБухгалтерскаяОрганизация(Объект.Организация) ИЛИ НЕ Объект.Проведен Тогда
			Возврат;
		КонецЕсли;
		
		ЕстьДокументУОС = ЕстьДокументУОС();
		
		Если ЕстьДокументУОС Тогда
			Возврат;
		КонецЕсли;  
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
		
		ПоказатьВопрос(Оповещение, "Создать документ?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Не найден документ УОС.");    	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЭтоБухгалтерскаяОрганизация(Организация)

	Возврат ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Объект.Организация);	

КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("УОС", Истина);
		ПараметрыФормы.Вставить("ДокументИсточник", Объект.Ссылка);
		
		ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);

	КонецЕсли;	
 
КонецПроцедуры   

&НаСервере
Функция ЕстьДокументУОС()   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
		|ГДЕ
		|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
	
	Запрос.УстановитьПараметр("ДокументБУ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Возврат ?(ЗначениеЗаполнено(Выборка.ДокументУУ), Истина, Ложь);	
	
	КонецЦикла;
	
    Возврат Ложь;

КонецФункции    

&НаСервере
Функция ТипДокумента(Документ) 
	
	Возврат Документ.Метаданные().Имя;

КонецФункции

&НаКлиенте
Функция ОбработатьОткрытие()
	
	Если ЗначениеЗаполнено(Объект.ИКТ_ДокументИсточник) Тогда
		
		СотрудникПриИзменении("");
		
	КонецЕсли;
	
КонецФункции   

#КонецОбласти 


