
&НаКлиенте
&Вместо("СменитьСтатусЗаданияЗавершение")
Процедура Расш1_СменитьСтатусЗаданияЗавершение(Ответ, ДополнительныеПараметры)
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	//{[*] ИКТ №20184 (фрагмент ИЗМЕНЕН), Новоселов, 20.07.2026 Поменял очередность записи задания и записи статуса задания
	// Статус задания
	КомментарийЗадания = СтрЗаменить(ПолеКомментария, Символы.ПС, "<br>");
	ПолеКомментария = "";
	
	Успешно = упоЗаданияСервер.УстановитьСтатусЗадания(Объект.Ссылка, ДополнительныеПараметры.НовыйСтатус, КомментарийЗадания,, Ложь);
	
	// Задание
	Если Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи 
		И (ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто")
		   Или ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено")) Тогда
		   
		Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = Ложь;
		Объект.ЗавершеноЗакрытоВручную = Истина;
		Модифицированность = Истина;
		
	ИначеЕсли Не Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи И Объект.ЗавершеноЗакрытоВручную
		И (ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено") 
		   И ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выполняется") 
			Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто") 
				И ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выдано")) Тогда
		
		Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = Истина;
		Объект.ЗавершеноЗакрытоВручную = Ложь;
		Модифицированность = Истина;		
		
	КонецЕсли;
		
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	// Статус задания продолжение
	клОбновитьОписание();
	
	Если Успешно Тогда
		ПараметрыОповещения = Новый Структура ("Проект, ЭтоЗаданиеПодразделению,Статус, Закрытие, Задание", 
		                            Объект.Проект,
									Объект.ЭтоЗаданиеПодразделению,
									ДополнительныеПараметры.НовыйСтатус,
									ДополнительныеПараметры.ЗакрытьПослеСменыСтатуса,
									Объект.Ссылка);
		Оповестить("Задания_СтатусЗаданияИзменен", ПараметрыОповещения, ЭтаФорма); 
							
		Если ДополнительныеПараметры.ЗакрытьПослеСменыСтатуса Тогда							
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	//ПродолжитьВызов(Ответ, ДополнительныеПараметры);
	//[*]} ИКТ №20184
	
КонецПроцедуры

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьИзменитьРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзменитьРеквизиты()

	НовыйЭлемент = Элементы.Вставить("ИКТ_ТипЗадания", Тип("ПолеФормы"), Элементы.Группа12, Элементы.Группа6);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ТипЗадания";

КонецПроцедуры

