
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Аннотация не требуется, см. наименование.
//
// Параметры:
//  СтруктураПараметров	 - Структура - параметры для создания ключей аналитики.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоКлючиАналитикиФактаБДР - ключ аналитики.
//
Функция НайтиСоздатьКлючАналитики(СтруктураПараметров) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоКлючиАналитикиФактаБДР.Ссылка КАК КлючАналитики
	               |ИЗ
	               |	Справочник.упоКлючиАналитикиФактаБДР КАК упоКлючиАналитикиФактаБДР
	               |ГДЕ
	               |	упоКлючиАналитикиФактаБДР.НомерДокумента = &НомерДокумента
	               |	И упоКлючиАналитикиФактаБДР.ДатаДокумента = &ДатаДокумента
	               |	И упоКлючиАналитикиФактаБДР.СсылкаНаДокумент = &СсылкаНаДокумент
	               |	И упоКлючиАналитикиФактаБДР.ИсточникДанных = &ИсточникДанных";
	Запрос.УстановитьПараметр("НомерДокумента",   СтруктураПараметров.НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", 	  СтруктураПараметров.ДатаДокумента);
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СтруктураПараметров.СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ИсточникДанных",   СтруктураПараметров.ИсточникДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КлючАналитики;
	Иначе
		Возврат СоздатьКлючАналитики(СтруктураПараметров);
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция СоздатьКлючАналитики(СтруктураПараметров)
	
	НовыйЭлемент = Справочники.упоКлючиАналитикиФактаБДР.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, СтруктураПараметров);
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
		
КонецФункции

#КонецОбласти

#КонецЕсли
 
