
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Наименование = СформироватьНаименованиеАналитики();		

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьНаименованиеАналитики()
	
	НаименованиеАналитики = ""; 
	
	КлючевыеСвойства = Новый СписокЗначений;
	КлючевыеСвойства.Добавить("НомерДокумента", "Номер");
	КлючевыеСвойства.Добавить("ДатаДокумента", "Дата");
	КлючевыеСвойства.Добавить("СсылкаНаДокумент", "Ссылка");
	КлючевыеСвойства.Добавить("ИсточникДанных", "ИсточникДанных");
	
	Для Каждого ТекСвойство Из КлючевыеСвойства Цикл
		НаименованиеАналитики = НаименованиеАналитики
			+ ?(НаименованиеАналитики = "", "", "; ")
			+ ТекСвойство.Представление + ": " 
			+ ЭтотОбъект[ТекСвойство.Значение];
	КонецЦикла;
	
	Возврат НаименованиеАналитики;
		
КонецФункции 
 
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
