
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// В конец процедуры.
	// {УПФ}	
	МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// {/УПФ}
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_упоСписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// {УПФ}
	СтандартнаяОбработка = Ложь;
	
	ТекЗначение = Элементы.Список.ТекущаяСтрока;
	
	Если ЗначениеЗаполнено(ТекЗначение) Тогда
		ПодмененныйЭлемент = упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСтруктурыИлиПодразделения(ТекЗначение);
		ОповеститьОВыборе(ПодмененныйЭлемент);
	КонецЕсли;
	// {/УПФ}
КонецПроцедуры

#КонецОбласти
