#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьСобытие(ВидыСобытий, ИсточникСсылка = Неопределено, ИсточникДопПараметр = Неопределено, 
	Знач ИсточникИмяОбъекта = Неопределено, КонтекстСобытия = Неопределено, Автор = Неопределено, Датасобытия = Неопределено) Экспорт
	
	Если Не упоОповещенияПовтИсп.ПолучитьИспользоватьСобытия() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	Если Датасобытия = Неопределено	Тогда
		ДатаСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ИсточникИмяОбъекта = Неопределено И ИсточникСсылка <> Неопределено Тогда
		ИсточникИмяОбъекта = ИсточникСсылка.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	Если ТипЗнч(ВидыСобытий) = Тип("Массив") Тогда
		
		Для каждого Эл Из ВидыСобытий Цикл
			
			Если Не ВозможностьРегистрации(Эл, ИсточникСсылка, ИсточникДопПараметр) Тогда
				Продолжить;
			КонецЕсли;
			
			НовЭл = Справочники.упоПроизошедшиеСобытия.СоздатьЭлемент();
			НовЭл.Автор = Автор;
			НовЭл.Дата = ДатаСобытия;
			НовЭл.ВидСобытия = Эл;
			НовЭл.Источник = ИсточникСсылка;
			НовЭл.ИсточникИмяОбъекта = ИсточникИмяОбъекта;
			НовЭл.ИсточникДопПараметр = ИсточникДопПараметр;
			Если КонтекстСобытия <> Неопределено Тогда
				НовЭл.КонтекстСобытия = КонтекстСобытия;
			КонецЕсли;
			НовЭл.Записать();
						
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВидыСобытий) = Тип("СправочникСсылка.упоВидыСобытий") Тогда
		
		Если Не ВозможностьРегистрации(ВидыСобытий, ИсточникСсылка, ИсточникДопПараметр) Тогда
			Возврат;
		КонецЕсли;
		
		НовЭл = Справочники.упоПроизошедшиеСобытия.СоздатьЭлемент();
		НовЭл.Автор = Автор;
		НовЭл.Дата = ДатаСобытия;
		НовЭл.ВидСобытия = ВидыСобытий;
		НовЭл.Источник = ИсточникСсылка;
		НовЭл.ИсточникИмяОбъекта = ИсточникИмяОбъекта;
		НовЭл.ИсточникДопПараметр = ИсточникДопПараметр;
		Если КонтекстСобытия <> Неопределено Тогда
			НовЭл.КонтекстСобытия = КонтекстСобытия;
		КонецЕсли;
		НовЭл.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВозможностьРегистрации(ВидСобытия, ИсточникСсылка, ИсточникДопПараметр)
	
	Возможность = Истина;
	
	Если ЗначениеЗаполнено(ИсточникСсылка) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	упоОтправленныеСообщения.Идентификатор,
		               |	NULL КАК Ссылка
		               |ИЗ
		               |	РегистрСведений.упоОтправленныеСообщения КАК упоОтправленныеСообщения
		               |ГДЕ
		               |	упоОтправленныеСообщения.ВидСобытия = &ВидСобытия
		               |	И упоОтправленныеСообщения.Источник = &Источник
		               |	И упоОтправленныеСообщения.ВидСобытия.НеРегистрироватьПовторно
		               |	И упоОтправленныеСообщения.ИсточникДопПараметр = &ИсточникДопПараметр
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	NULL,
		               |	упоПроизошедшиеСобытия.Ссылка
		               |ИЗ
		               |	Справочник.упоПроизошедшиеСобытия КАК упоПроизошедшиеСобытия
		               |ГДЕ
		               |	упоПроизошедшиеСобытия.ВидСобытия = &ВидСобытия
		               |	И упоПроизошедшиеСобытия.Источник = &Источник
		               |	И упоПроизошедшиеСобытия.ВидСобытия.НеРегистрироватьПовторно
		               |	И НЕ упоПроизошедшиеСобытия.ВидСобытия.ПометкаУдаления
		               |	И упоПроизошедшиеСобытия.ИсточникДопПараметр = &ИсточникДопПараметр";
		
		Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);				   
		Запрос.УстановитьПараметр("Источник", ИсточникСсылка);
		Запрос.УстановитьПараметр("ИсточникДопПараметр", ИсточникДопПараметр);
			
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Возможность = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Возможность;
	
КонецФункции

#КонецОбласти

#КонецЕсли