
&НаСервере
&ИзменениеИКонтроль("РазрешеноИзменениеСоставаПользователейГруппы")
Функция Расш1_РазрешеноИзменениеСоставаПользователейГруппы(ГруппаДоступа)

	#Вставка
	//{[+] 17162 (фрагмент ДОБАВЛЕН), Буцких, 20.02.2025 11:14:32
	Если ОбщегоНазначения.ЕстьРоль("ИКТ_ДобавлениеИзменениеПользователейБезПолныхПрав") Тогда
		Возврат Истина;
	КонецЕсли;
	//[+]} 17162 Буцких
	#КонецВставки
	Если ПользовательИБПолноправный Тогда
		Возврат Истина;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаДоступа",              ГруппаДоступа);
	Запрос.УстановитьПараметр("АвторизованныйПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	|		ПО (СоставыГруппПользователей.Пользователь = &АвторизованныйПользователь)
	|			И (СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступа.Ответственный)
	|			И (ГруппыДоступа.Ссылка = &ГруппаДоступа)";

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции
