#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ИнициализацияФормыСервер();
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	Элементы.Владелец.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Владелец);
	// определяем видимость элементов управления	
	УстановитьВидимость(); 	
	
	УстановитьОтметкуНезаполненного(Не Объект.РучнойВводСроков);
	
	Если ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам = Неопределено Тогда	
		ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам = Новый Структура;
	КонецЕсли;
		
	ПроверятьОбъемы = Истина;
	ПроверятьДоходы = Истина;
	ПроверятьПотребности = Истина;
	ПроверятьРасходы = Истина;
	ПроверятьРолиТрудовыхРесурсов = Истина;
	ПроверятьДопЗатраты = Истина;
	СоздатьДопЭлементыРаспределенияДоходов(ПроверятьОбъемы, ПроверятьДоходы, ПроверятьПотребности, 
		ПроверятьРасходы, ПроверятьРолиТрудовыхРесурсов, ПроверятьДопЗатраты);
		
	Доступ = упоРазграничениеДоступаВызовСервера.обДоступностьФинансовойИнформации();
	Если Доступ = "Отсутствует" Тогда
		СкрытьФинИнформацию_ДоступОтсутствует();
	ИначеЕсли Доступ = "Просмотр" Тогда
		СкрытьФинИнформацию_ДоступНаПросмотр();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	ИнициализацияФормыКлиент(Истина);
	
	Если Объект.РучнойВводСроков Тогда 		
		ВыборРежимаВводаСроков = 1;  		
	Иначе      		
		ВыборРежимаВводаСроков = 2;  		
	КонецЕсли;
	
	УстановитьДоступностьСроков();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	ПроверитьЗаполнениеТаблиц(Отказ);
		
	ПроверитьРаспределение(Отказ);
				
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	СоздатьДопЭлементыРаспределенияДоходов(Истина, Истина, Истина, Истина, Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ДозаполнитьТЧСубпродукты();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СоздатьДопЭлементыРаспределенияДоходов(Истина, Истина, Истина, Истина, Истина, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначениевТЧ(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначениевТЧОбщая(ИмяКоманды)
	
	ДозаполнитьДоговор = Ложь;
	
	Если ИмяКоманды = "МатериалыИОборудование_СпособПривязки" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.упоСпособПривязкиПоставокИСубпродуктов"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "СпособПривязкиПотребности";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_ЗадержкаЗаказа" Тогда
		
		ОписаниеТиповП= Новый КвалификаторыЧисла(10,0, ДопустимыйЗнак.Любой);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "ЗадержкаЗаказа";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_СтатьяЗатрат" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.упоСтатьиЗатрат"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "СтатьяЗатрат";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_ПрофильРаспределения" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_Контрагент" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.Контрагенты"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "Контрагент";
		ДозаполнитьДоговор = Истина;
		
	ИначеЕсли ИмяКоманды = "Субпродукты_СпособПривязки" Тогда

		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("ПеречислениеСсылка.упоСпособПривязкиПоставокИСубпродуктов"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "СпособПривязкиВыпуска";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_ЗадержкаЗаказа" Тогда
		
		ОписаниеТиповП= Новый КвалификаторыЧисла(10,0, ДопустимыйЗнак.Любой);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "ЗадержкаЗаказа";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_СтатьяДоходов" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоСтатьиДоходов"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "СтатьяДоходов";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_ПрофильРаспределения" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_Контрагент" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "Контрагент";
		ДозаполнитьДоговор = Истина;
		
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ИмяТЧ",ИмяТЧ);
	Контекст.Вставить("ИмяКолонки",ИмяКолонки);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЗначениевТЧОбщаяЗавершение",ЭтотОбъект,Контекст);
	
	упоРаботаСФормамиКлиент.ЗаполнитьЗначениеВТЧ(Объект, ИмяТЧ, ИмяКолонки, ОписаниеТиповП,
		ДозаполнитьДоговор,,,,ОписаниеОповещения);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьЗначениевТЧОбщаяЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	ВведенноеЗначение = Результат;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПроектнойЗадачиПриИзменении(Элемент)
	
	упоПроектыИЗадачиОбщие.ЗаписатьТипЗадачи(Объект);	
	УстановитьВидимость();  	
	УстановитьДоступностьСроков();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРежимаВводаСроковПриИзменении(Элемент)
	
	Если ВыборРежимаВводаСроков = 1 Тогда
		Объект.РучнойВводСроков = Истина;
	Иначе
		Объект.РучнойВводСроков = Ложь;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
	УстановитьОтметкуНезаполненного(Не Объект.РучнойВводСроков);
	
	УстановитьДоступностьСроков();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПланПриИзменении(Элемент)
	
	ПриИзмененииСроков();
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗавершенияПланПриИзменении(Элемент)
	
	ПриИзмененииСроков();
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьМоделиПакетаРаботПриИзменении(Элемент)
	
	Новый_ПриИзмененииДлительности_Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаНормированияДлительностиПриИзменении(Элемент)
		
	Если Не ЗначениеЗаполнено(Объект.ЕдиницаНормированияДлительности) Тогда
		Возврат;
	КонецЕсли;
	
	Новый_ПодсчитатьДлительность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредусловия

&НаКлиенте
Процедура ПредУсловияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ДобавлениеПредшественника", Истина);
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "ЗадачаПредшественник",
		Объект.ПредУсловия, ЭтаФорма, Истина, ПараметрыПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредУсловияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
		
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "ЗадачаПредшественник",
		Объект.ПредУсловия, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредУсловияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПодборВТЧФормы(Команды.Найти("ПредшественницыПодобрать"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТрудовыеРесурсы

&НаКлиенте
Процедура ТрудовыеРесурсыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ТрудовыеРесурсы", Истина);
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Ресурс",
		Объект.ТрудовыеРесурсы, ЭтаФорма, Истина, ПараметрыПодбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
		
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Ресурс",
		Объект.ТрудовыеРесурсы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТрудовыеРесурсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПодборВТЧФормы(Команды.Найти("РолиТрудовыхРесурсовПодобрать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыРесурсПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТрудовыеРесурсы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти <> Неопределено И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Ресурс) Тогда
		СтрокаТабличнойЧасти.Подразделение = упоУправлениеФормамиСервер.ПолучитьПодразделениеРолиВызовСервера(СтрокаТабличнойЧасти.Ресурс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТрудовыеРесурсы.ТекущиеДанные;	
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти);
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти, ,"ВнешняяСтоимость",
		"ОбщВнешняяСтоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыСтоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТрудовыеРесурсы.ТекущиеДанные;	
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыОбщСтоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТрудовыеРесурсы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Таблица_ПриИзмененииОбщСтоимости(СтрокаТабличнойЧасти, "Стоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыВнешняяСтоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТрудовыеРесурсы.ТекущиеДанные;	
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти,
		"Количество", "ВнешняяСтоимость", "ОбщВнешняяСтоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыОбщВнешняяСтоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТрудовыеРесурсы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Таблица_ПриИзмененииОбщСтоимости(СтрокаТабличнойЧасти, "ВнешняяСтоимость");

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТрудовыеРесурсыПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущийРесурс = Элементы.ТрудовыеРесурсы.ТекущиеДанные.Ресурс;
	
	Если ТекущийРесурс <> Неопределено Тогда
		
		УстановитьПараметрыВыбораПодразделенияРоли(ТекущийРесурс, Элемент);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораПодразделенияРоли(ТекущийРесурс, ТекущийЭлементТабл)
		
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(Новый ПараметрВыбора("РесурсПодразделения", ТекущийРесурс));
	НовыйМассив.Добавить(Новый ПараметрВыбора("ДатаАктуальности", Объект.ДатаНачалаПлан));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	ТекущийЭлементТабл.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТрудовыеРесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущийРесурс = Элементы.ТрудовыеРесурсы.ТекущиеДанные.Ресурс;
	
	Если ТекущийРесурс <> Неопределено Тогда
		УстановитьПараметрыВыбораПодразделенияРоли(ТекущийРесурс, Элементы.ТрудовыеРесурсыПодразделение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТрудовыеРесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "ТрудовыеРесурсы", , , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериальныеРесурсы

&НаКлиенте
Процедура МатериальныеРесурсыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("МатериальныеРесурсы", Истина);
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Ресурс",
		Объект.МатериальныеРесурсы, ЭтаФорма, Истина, ПараметрыПодбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
		
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Ресурс",
		Объект.МатериальныеРесурсы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    
    Если Не Отказ Тогда
        упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтотОбъект, Объект, 
            "МатериальныеРесурсы", "РаспределениеПотребностей", Копирование, Отказ);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыЕдиницаНормированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.МатериальныеРесурсы.ТекущиеДанные;
	
	МассивТипов = Новый Массив;
	
	ВидМатериальногоРесурса = ПолучитьВидМатериальногоРесурса(СтрокаТабличнойЧасти.Ресурс);
	
	Если ВидМатериальногоРесурса = ПредопределенноеЗначение("Перечисление.упоВидМатериальногоРесурса.Материал") Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ИначеЕсли ВидМатериальногоРесурса = ПредопределенноеЗначение("Перечисление.упоВидМатериальногоРесурса.Оборудование") Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.упоЕдиницыВремени"));
	Иначе
		МассивТипов.Добавить(Тип("СправочникСсылка.упоЕдиницыВремени"));
		МассивТипов.Добавить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	КонецЕсли;
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.МатериальныеРесурсы.ТекущиеДанные;
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти);
	
	ИмяТаблицы = "МатериальныеРесурсы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, СтрокаТабличнойЧасти, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыСтоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.МатериальныеРесурсы.ТекущиеДанные;
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти);
	
	ИмяТаблицы = "МатериальныеРесурсы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, СтрокаТабличнойЧасти, ИмяТаблицы);

КонецПроцедуры
  
&НаКлиенте
Процедура МатериальныеРесурсыОбщСтоимостьПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.МатериальныеРесурсы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Таблица_ПриИзмененииОбщСтоимости(СтрокаТабличнойЧасти, "Стоимость");
	
	ИмяТаблицы = "МатериальныеРесурсы";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, СтрокаТабличнойЧасти, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыРесурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыРесурсПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.МатериальныеРесурсы.ТекущиеДанные;
	ЗаполнитьЕдиницуНормированияСтрокиТабЧасти(СтрокаТабличнойЧасти);
	
	Если СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Количество = 1;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект,
		"МатериальныеРесурсы", "РаспределениеПотребностей");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма,
		"МатериальныеРесурсы", "РаспределениеПотребностей","ОбщСтоимость", Истина);
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеПотребностей",
		"МатериальныеРесурсы");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьОграничениеТиповМатериальныеРесурсы();
	 
	ТекСтрока = Элементы.МатериальныеРесурсы.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		
		СтрокаТЧ = Неопределено;		
		ПодготовитьКопиюДанныхОбъекта(СтрокаТЧ, "МатериальныеРесурсы");
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтрока);
        упоФункцииОбщегоНазначенияВызовСервера.ЗаполнитьСтрокуПоУмолчанию(Новый Структура("мВалютаУправленческогоУчета",
			мВалютаУправленческогоУчета), Неопределено, "КонтрагентЗатрат", "ДоговорЗатрат", СтрокаТЧ, "МатериальныеРесурсы");
		ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаТЧ);
        		
	КонецЕсли;
	
	УстановитьТолькоПросмотрВалюте("ПланРасходов", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)
	
	// Перенести код в модуль с повторным использованием значений.
	
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Справочники.упоШаблоныПроектныхЗадач.Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);
		
	Иначе 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Справочники.упоШаблоныПроектныхЗадач.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеЗатраты

&НаКлиенте
Процедура ДополнительныеЗатратыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "СтатьяЗатрат",
		Объект.ДополнительныеЗатраты, ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "СтатьяЗатрат",
		Объект.ДополнительныеЗатраты, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ДополнительныеЗатраты",
		"РаспределениеДополнительныхЗатрат", "Стоимость");	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеДополнительныхЗатрат", 
		"ДополнительныеЗатраты", , Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ПодборВТЧФормы(Команды.Найти("ДопзатратыПодобрать"));
    КонецЕсли;
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма,
		Объект,
		"ДополнительныеЗатраты",
		"РаспределениеДополнительныхЗатрат",
		Копирование,
		Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    
    ТекСтрока = Элементы.ДополнительныеЗатраты.ТекущиеДанные;
    
    Если Копирование Тогда
        ТекСтрока.ИндексСтрокРаспределения = Неопределено;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеЗатратыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект,
		"ДополнительныеЗатраты", "РаспределениеДополнительныхЗатрат");		

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланДоходов

&НаКлиенте
Процедура ПланДоходовСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПланДоходов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СформироватьИтогПоФинПланам(ЭтаФорма);
	
	ИмяТаблицы = "ПланДоходов";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовПослеУдаления(Элемент)
	
	СформироватьИтогПоФинПланам(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.ПланДоходов.ТекущиеДанные;
	Если ТекСтрока <> Неопределено И НоваяСтрока И (НЕ Копирование) Тогда
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ПланДоходов");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);
				  
		СтруктураДанныеСтроки = упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки,
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
			
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);
		ЗаполнитьЗначенияСвойств(ТекСтрока, СтруктураДанныеСтроки, "СпособПривязки");  
        		
	КонецЕсли;
	
	УстановитьТолькоПросмотрВалюте("ПланДоходов", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СформироватьИтогПоФинПланам(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовПриАктивизацииСтроки(Элемент)
	
	УстановитьТолькоПросмотрВалюте("ПланДоходов", Ложь);	
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ПланДоходов",
		"РаспределениеДоходов") ;	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеДоходов", "ПланДоходов",
		"ИндексСтрокиРаспределенияДоходов", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "ПланДоходов",
		"РаспределениеДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Отказ Тогда 
		упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект, "ПланДоходов",
			"РаспределениеДоходов",Копирование, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля, Объект.ПланДоходов, ЭтаФорма);		

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	   Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.ПланДоходов, ЭтаФорма);		

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланРасходов

&НаКлиенте
Процедура ПланРасходовСуммаПриИзменении(Элемент)
			
	ТекДанные = Элементы.ПланРасходов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СформироватьИтогПоФинПланам(ЭтаФорма);
		
	ИмяТаблицы = "ПланРасходов";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СформироватьИтогПоФинПланам(ЭтаФорма);
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ПланРасходов", "РаспределениеРасходов");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовПриАктивизацииСтроки(Элемент)
	
	УстановитьТолькоПросмотрВалюте("ПланРасходов", Ложь);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ПланРасходов",
		"РаспределениеРасходов");	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеРасходов", 
		"ПланРасходов",	"ИндексСтрокиРаспределенияРасходов", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовПослеУдаления(Элемент)
	
	СформироватьИтогПоФинПланам(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.ПланРасходов.ТекущиеДанные;
	                 
	Если ТекСтрока <> Неопределено И НоваяСтрока И (НЕ Копирование) Тогда
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ПланРасходов");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);			
		
		СтруктураДанныеСтроки = упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки,
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
			
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);
		ЗаполнитьЗначенияСвойств(ТекСтрока, СтруктураДанныеСтроки, "СпособПривязки"); 
				
	КонецЕсли;
	
	УстановитьТолькоПросмотрВалюте("ПланРасходов", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "ПланРасходов",
		"РаспределениеРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Отказ Тогда 
		упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект,
			"ПланРасходов", "РаспределениеРасходов", Копирование, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.ОчиститьСтрокиРаспределенияПоПериодам(Объект, ЭтаФорма,
		"РаспределениеРасходов", "РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределенияРасходов");

КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	 Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля, Объект.ПланРасходов, ЭтаФорма);		

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРасходовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	  Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.ПланРасходов, ЭтаФорма);		

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланПоступлений

&НаКлиенте
Процедура ПланПоступленийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	 Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля, Объект.ПланПоступлений, ЭтаФорма);		

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПоступленийПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	 Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.ПланПоступлений, ЭтаФорма);		

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланВыплат

&НаКлиенте
Процедура ПланВыплатОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	  Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля, Объект.ПланВыплат, ЭтаФорма);		

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланВыплатПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.упоШаблоныКонтрагентов") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "Статья";
		КонецЕсли;
					
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.ПланВыплат, ЭтаФорма);		

	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСубродукты

&НаКлиенте
Процедура СубпродуктыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ИмяТабличнойЧасти = "Субпродукты";
	ПараметрыПодбораСтруктура = Неопределено;
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьДопПараметрыСтруктурыПодбора(ЭтаФорма, ПараметрыПодбораСтруктура, ИмяТабличнойЧасти, 
		ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТабличнойЧасти));
		
	ПараметрыПодбораСтруктура.Вставить("ЭтоСубпродукты", Истина);	
	Если ВключенПереключательПроектнаяПродукция() Тогда
		ПараметрыПодбораСтруктура.Вставить("РаспределениеОбъемов", Объект.РаспределениеОбъемов);
		ПараметрыПодбораСтруктура.Вставить("Субпродукты", Объект.Субпродукты);  
	КонецЕсли;		
	
			
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение,
																 "Ресурс",
																 Объект.Субпродукты,
																 ЭтаФорма,
																 Истина,
																 ПараметрыПодбораСтруктура);
																 
	упоРаботаСФормамиКлиент.ПроверитьНоменклатуруСтрокиНаЗаполнениеЕдИзмВТаблице(Объект, ИмяТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Ресурс",
		Объект.Субпродукты, ЭтаФорма);	

КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыСтоимостьПриИзменении(Элемент)
	
	ТекДанные = Элементы.Субпродукты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(Элементы.Субпродукты.ТекущиеДанные);

	ИмяТаблицы = "Субпродукты";
			
	Если ТекДанные.ЭтоПП Тогда
		упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределенияПроектнойПродукции(ЭтаФорма, ТекДанные,
			ИмяТаблицы);
	Иначе
		упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Субпродукты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(ТекДанные);
	
	ИмяТаблицы = "Субпродукты";
	
	Если ТекДанные.ЭтоПП Тогда
		упоРаботаСФормамиКлиент.ПересчитатьДлительностьПоПроектнойПродукции(ТекДанные);
		упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределенияПроектнойПродукции(ЭтаФорма, ТекДанные,
			ИмяТаблицы);
	Иначе
		упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура СубпродуктыОбщСтоимостьПриИзменении(Элемент)
	
	ТекДанные = Элементы.Субпродукты.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Таблица_ПриИзмененииОбщСтоимости(ТекДанные, "Стоимость");
	
	ИмяТаблицы = "Субпродукты";
		
	Если ТекДанные.ЭтоПП Тогда
		упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределенияПроектнойПродукции(ЭтаФорма, ТекДанные,
			ИмяТаблицы);

	Иначе
		упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, ТекДанные, ИмяТаблицы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ПодборВТЧФормы(Команды.Найти("СубпродуктыПодобрать"));
    Иначе
        упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтотОбъект, Объект, "Субпродукты",
            "РаспределениеОбъемов", Копирование, Отказ);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Субпродукты",
		"РаспределениеОбъемов","ОбщСтоимость", Истина);	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеОбъемов", "Субпродукты");
	
	ПересчитатьИтогиКолонокПП();

КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "Субпродукты",
		"РаспределениеОбъемов");

	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеОбъемов", "Субпродукты", 
		"ИндексСтрокиРаспределениеПоРолям", Истина, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.Субпродукты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		
		СтрокаТЧ = Неопределено;		
		ПодготовитьКопиюДанныхОбъекта(СтрокаТЧ, "Субпродукты");
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтрока);
		упоФункцииОбщегоНазначенияВызовСервера.ЗаполнитьСтрокуПоУмолчанию(Новый Структура("мВалютаУправленческогоУчета",
			мВалютаУправленческогоУчета), Неопределено, "КонтрагентДоходов", "ДоговорДоходов", СтрокаТЧ, "Субпродукты");
		ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаТЧ);
        		
		ОбновитьДатуВыпускаПланВыпуска(ТекСтрока);
	КонецЕсли;
	
	УстановитьТолькоПросмотрВалюте("Субпродукты");	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСубпродуктаПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ТипСубпродуктаПриИзменении(ЭтотОбъект);
	
	упоРаботаСФормамиКлиентСервер.УстановитьВидимостьСтраницЗаказовВыпускаПоТипуСубпродукта(Элементы, 
		Объект.ТипСубпродукта);
	
КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыТрудоемкостьПриИзменении(Элемент)

	ТекущиеДанные = ЭтотОбъект.Элементы.Субпродукты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииТрудоемкостиПроектногоПродукта(ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииТрудоемкостиПроектногоПродукта(СтрокаТабличнойЧасти)
	
	Если СтрокаТабличнойЧасти.Нормирование = 0 Тогда
		СтрокаТабличнойЧасти.КоэффициентСложности = 0;
	Иначе
		СтрокаТабличнойЧасти.КоэффициентСложности = СтрокаТабличнойЧасти.Трудоемкость / СтрокаТабличнойЧасти.Нормирование;
	КонецЕсли;
	
	ЗаполнитьКоэффициентСложностиДляРолей(ЭтотОбъект.Объект["РаспределениеОбъемов"], СтрокаТабличнойЧасти, СтрокаТабличнойЧасти.КоэффициентСложности); 
	
	Для Каждого СтрокаРоли Из ЭтотОбъект.Объект["РаспределениеОбъемов"] Цикл	
		Если СтрокаРоли.ИндексСтрокиВладельца <> СтрокаТабличнойЧасти.ИндексСтрокРаспределения Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРоли.Трудоемкость = СтрокаТабличнойЧасти.Трудоемкость * (СтрокаРоли.ПроцентРаспределения / 100);	
	КонецЦикла;
	
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Трудоемкость");
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "КоэффициентСложности");
		
КонецПроцедуры //

&НаКлиенте
Процедура СубпродуктыКоэффициентСложностиПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтотОбъект.Элементы.Субпродукты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПриИзмененииКоэффициентаСложностиПроектногоПродукта(ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКоэффициентаСложностиПроектногоПродукта(СтрокаТабличнойЧасти);
	
	ЗаполнитьКоэффициентСложностиДляРолей(ЭтотОбъект.Объект["РаспределениеОбъемов"], СтрокаТабличнойЧасти, СтрокаТабличнойЧасти.КоэффициентСложности);
	
	Для Каждого СтрокаРоли Из ЭтотОбъект.Объект["РаспределениеОбъемов"] Цикл
		Если СтрокаРоли.ИндексСтрокиВладельца <> СтрокаТабличнойЧасти.ИндексСтрокРаспределения Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРоли.Трудоемкость = СтрокаТабличнойЧасти.Нормирование * СтрокаРоли.КоэффициентСложности * (СтрокаРоли.ПроцентРаспределения/100);
	КонецЦикла; 

	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Трудоемкость");
	СтрокаТабличнойЧасти.Трудоемкость = ИтогРаспределенияПП_Трудоемкость;
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "КоэффициентСложности");
	
КонецПроцедуры //

&НаКлиенте
Процедура СубпродуктыРесурсПриИзменении(Элемент)
	
	ТекДанные = Элементы.Субпродукты.ТекущиеДанные;
		
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СтруктураСтрокиСубпродукты = Новый Структура;
	СтруктураСтрокиСубпродукты.Вставить("Ресурс", 				ТекДанные.Ресурс);
	СтруктураСтрокиСубпродукты.Вставить("Количество", 			ТекДанные.Количество);
	СтруктураСтрокиСубпродукты.Вставить("Стоимость", 			ТекДанные.Стоимость);
	СтруктураСтрокиСубпродукты.Вставить("ОбщСтоимость", 		ТекДанные.ОбщСтоимость);
	СтруктураСтрокиСубпродукты.Вставить("ЕдиницаНормирования", 	ТекДанные.ЕдиницаНормирования);
	СтруктураСтрокиСубпродукты.Вставить("ЭтоПП", ТекДанные.ЭтоПП);
	Если ДоступенФункционалПроектнаяПродукция Тогда
		СтруктураСтрокиСубпродукты.Вставить("СкоростьВыполнения", ТекДанные.СкоростьВыполнения);
		СтруктураСтрокиСубпродукты.Вставить("Трудоемкость", ТекДанные.Трудоемкость);
		СтруктураСтрокиСубпродукты.Вставить("Нормирование", ТекДанные.Нормирование);
		СтруктураСтрокиСубпродукты.Вставить("КоэффициентСложности", ТекДанные.КоэффициентСложности);
	КонецЕсли;
	
	МассивРаспределенияОбъемов = Новый Массив;
	СубпродуктыРесурсПриИзмененииНаСервере(СтруктураСтрокиСубпродукты, МассивРаспределенияОбъемов);
	
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтруктураСтрокиСубпродукты);	

	ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураСтрокиСубпродукты);
	
	Если ТекДанные.ЭтоПП Тогда
		упоПодборВТабличнуюЧастьКлиент.СубпродуктыЗаполнитьРаспределениеОбъемовПП(ТекДанные,
			МассивРаспределенияОбъемов,	Объект.РаспределениеОбъемов, Объект.Субпродукты);

		ПересчитатьИтогиПоТаблицеПП();
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ПроверитьНоменклатуруСтрокиНаЗаполнениеЕдИзмВТаблице(Объект, "Субпродукты", ТекДанные);
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Субпродукты",
			"РаспределениеОбъемов","ОбщСтоимость", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.Субпродукты.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИсточник = "Субпродукты";
	
	СтрокиНайдены = Ложь;

	Если НоваяСтрока Или Не СтрокиНайдены Тогда
		
		упоАналитикаПоПодразделениямКлиент.УстановитьИндексСтрокРаспределенияВСтрокеТаблицы(Объект, ТекДанные, ТаблицаИсточник);
		
		упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Субпродукты",
			"РаспределениеОбъемов","ОбщСтоимость", Истина);
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыСкоростьВыполненияПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Субпродукты.ТекущиеДанные;
	упоРаботаСФормамиКлиент.ПересчитатьДлительностьПоПроектнойПродукции(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура МатериалыИОборудование_ЗадержкаЗаказа(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыИОборудование_Контрагент(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыИОборудование_ПрофильРаспределения(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыИОборудование_СпособПривязки(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыИОборудование_СтатьяЗатрат(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтоимостьТрудовыхРесурсов(Команда)
	
	ПересчитатьПоНормеТрудовыеРесурсыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВТЧФормы(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
		  	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		
	  
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСменитьРодителя(Команда)
	
	ВыбратьЗадачуРодителя();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаУдалитьРодителя(Команда)
	
	Объект.Родитель = ПредопределенноеЗначение("Справочник.упоШаблоныПроектныхЗадач.ПустаяСсылка");
		
КонецПроцедуры

&НаКлиенте
Процедура ТрудовыеРесурсыУстановитьОбщийПрофиль(Команда)
	
	УстановитьОбщийПрофильКлиент("ТрудовыеРесурсы");
	
КонецПроцедуры

&НаКлиенте
Процедура МатРесурсыПересчитатьПоНорме(Команда)
	
	МатРесурсы_ПересчитатьПоНормеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Субпродукты_ПересчитатьПоНорме(Команда)
	
	Субпродукты_ПересчитатьПоНормеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьДлительностьПоРолям(Команда)

	Новый_ЗаполнитьДлительностьПоПлануРолей();
	Новый_ПриИзмененииДлительности_Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьДлительностьПоСубпродуктам(Команда)
	
	упоПроектыИЗадачиКлиент.ЗаполнитьДлительностьПоОсвоенномуОбъему(ЭтаФорма, Истина);
	Новый_ПриИзмененииДлительности_Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура РолиТрудовыхРесурсовУстановитьОсновнуюРоль(Команда)
	
	упоРаботаСФормамиКлиент.СделатьТекущуюСтрокуТаблицыОсновной(Элементы.ТрудовыеРесурсы, Объект.ТрудовыеРесурсы);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоПериодам(Команда)
	
	ПараметрыКоманды = НастройкиПоИмениКоманды(Команда.Имя);
	Если ПараметрыКоманды = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.РаспределитьПоПериодам(ЭтаФорма, Объект, ПараметрыКоманды);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеПотребностей

&НаКлиенте
Процедура РаспределениеПотребностейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.МатериальныеРесурсы, Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.МатериальныеРесурсы, 
		Элементы.РаспределениеПотребностей,Объект,НоваяСтрока, Копирование);	
	
	 Если Копирование Тогда
		
		Элементы.РаспределениеПотребностей.ТекущиеДанные.ИндексСтрокРаспределенияПоПериодам = Неопределено;
		СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеОбъемов.ТекущиеДанные, "РаспределениеПотребностей",
			"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма,"МатериальныеРесурсы",
		"РаспределениеПотребностей", "ОбщСтоимость", Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "МатериальныеРесурсы",
		"РаспределениеПотребностей", "ОбщСтоимость");
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеПотребностей");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма,"МатериальныеРесурсы",
		"РаспределениеПотребностей", "ОбщСтоимость", Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "МатериальныеРесурсы",
		"РаспределениеПотребностей", "ОбщСтоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеПотребностей.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейСпособПривязкиПриИзменении(Элемент)
	
	СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеПотребностей.ТекущиеДанные, "РаспределениеПотребностей",
		"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");
		
	СоздатьДопЭлементыРаспределенияДоходов(Ложь, Ложь, Истина, Ложь, Ложь, Ложь);
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеПотребностей");
	
КонецПроцедуры

&НаКлиенте	
Процедура СтрокаРаспределенияСпособПривязкиПриИзменении(ТекущаяСтрокаРаспределения, ИмяТаблицыРаспределения,
	ИмяТаблицыПериоды, ИмяКолонкиИндекса)
	
	упоРаботаСФормамиКлиент.СтрокаРаспределенияСпособПривязкиПриИзменении(ЭтаФорма, ТекущаяСтрокаРаспределения, 
		ИмяТаблицыРаспределения, , ИмяТаблицыПериоды, ИмяКолонкиИндекса); 
		
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейСобствСилы_СубподрядПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеПотребностей");	
		
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейКоличествоПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.ПересчитатьСуммуПоКоличеству(ЭтотОбъект, 
																	"МатериальныеРесурсы", 
																	"РаспределениеПотребностей");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПотребностейПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.ОчиститьСтрокиРаспределенияПоПериодам(Объект, ЭтаФорма, "РаспределениеПотребностей",
		"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеДоходов

&НаКлиенте
Процедура РаспределениеДоходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.ПланДоходов, Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.ОчиститьСтрокиРаспределенияПоПериодам(Объект,ЭтаФорма, "РаспределениеДоходов",
		"РаспределениеДоходовПоПериодам","ИндексСтрокиРаспределенияДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ПланДоходов", "РаспределениеДоходов");	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ПланДоходов",
		"РаспределениеДоходов");	
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеДоходов", 
		"ИндексСтрокиРаспределенияДоходов", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЭтаФорма.Модифицированность = ЭтаФорма.Модифицированность Или ВыбранноеЗначение.Модифицированность;
	ОбработатьВыборРаспределения(ВыбранноеЗначение, "ИндексСтрокиРаспределенияДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ПланДоходов", "РаспределениеДоходов");	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ПланДоходов",
		"РаспределениеДоходов");	
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеДоходов", 
		"ИндексСтрокиРаспределенияДоходов", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеДоходов.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовСобствСилы_СубподрядПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеДоходов", 
																						ИспользоватьАналитикуКонтрагентДляСС);	

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовСпособПривязкиПриИзменении(Элемент)
	
	СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеДоходов.ТекущиеДанные, "РаспределениеДоходов",
		"РаспределениеДоходовПоПериодам","ИндексСтрокиРаспределенияДоходов");	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(объект, ЭтаФорма, "РаспределениеДоходов",
		"ПланДоходов", "ИндексСтрокиРаспределенияДоходов", Ложь);
	
	СоздатьДопЭлементыРаспределенияДоходов(Ложь, Истина, Ложь, Ложь, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.ПланДоходов,
		Элементы.РаспределениеДоходов, Объект, НоваяСтрока, Копирование);	
	Если Копирование Тогда 
		Элементы.РаспределениеДоходов.ТекущиеДанные.ИндексСтрокРаспределенияПоПериодам = Неопределено;
		СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеДоходов.ТекущиеДанные, "РаспределениеДоходов",
			"РаспределениеДоходовПоПериодам","ИндексСтрокиРаспределенияДоходов");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте	
Процедура Подключаемый_РаспределениеДоходовПоМесяцамКоличествоПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеПоМесяцамКоличествоПриИзменении(ЭтаФорма, Элемент.Имя, 
		"Субпродукты", "РаспределениеОбъемов", Объект.РаспределениеОбъемов);
		
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, 
		"РаспределениеОбъемов", "Субпродукты", "ИндексСтрокиРаспределениеПоРолям", Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте	
Процедура Подключаемый_РаспределениеТрудовыхРесурсовПоМесяцамКоличествоПриИзменении(Элемент)
			
КонецПроцедуры

&НаКлиенте	
Процедура Подключаемый_РаспределениеДоходовПоМесяцамСуммаПриИзменении(Элемент)
	
	 упоАналитикаПоПодразделениямКлиент.РаспределениеПоМесяцамСуммаПриИзменении(ЭтаФорма, Элемент.Имя, 
		"Субпродукты", "РаспределениеОбъемов", Объект.РаспределениеОбъемов);
		
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, 
		"РаспределениеОбъемов", "Субпродукты", "ИндексСтрокиРаспределениеПоРолям", Истина, Ложь);
		
КонецПроцедуры	

&НаКлиенте	
Процедура Подключаемый_РаспределениеРасходовПоМесяцамСуммаПриИзменении(Элемент)
					
	упоАналитикаПоПодразделениямКлиент.РаспределениеПоМесяцамСуммаПриИзменении(ЭтаФорма, Элемент.Имя, 
		"МатериальныеРесурсы", "РаспределениеПотребностей", Объект.РаспределениеПотребностей);
		
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, 
		"РаспределениеПотребностей", "МатериальныеРесурсы", "ИндексСтрокиРаспределениеПоРолям", Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте	
Процедура Подключаемый_РаспределениеРасходовПоМесяцамКоличествоПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеПоМесяцамКоличествоПриИзменении(ЭтаФорма, Элемент.Имя, 
		"МатериальныеРесурсы", "РаспределениеПотребностей", Объект.РаспределениеПотребностей);
	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, 
		"РаспределениеПотребностей", "МатериальныеРесурсы", "ИндексСтрокиРаспределениеПоРолям", Истина, Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеРасходов

&НаКлиенте
Процедура РаспределениеРасходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.ПланРасходов, Отказ);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.ПланРасходов,
		Элементы.РаспределениеРасходов, Объект, НоваяСтрока, Копирование);		
	
	Если Копирование Тогда
		Элементы.РаспределениеРасходов.ТекущиеДанные.ИндексСтрокРаспределенияПоПериодам = Неопределено;
		СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеОбъемов.ТекущиеДанные, "РаспределениеРасходов",
			"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределенияРасходов");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ПланРасходов", "РаспределениеРасходов");	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ПланРасходов",
		"РаспределениеРасходов");		
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеРасходов", 
		"ИндексСтрокиРаспределенияРасходов", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ПланРасходов", "РаспределениеРасходов");	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ПланРасходов", "РаспределениеРасходов") ;		

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеРасходов.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовСобствСилы_СубподрядПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеРасходов");		
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовСпособПривязкиПриИзменении(Элемент)
	
	СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеРасходов.ТекущиеДанные, "РаспределениеРасходов",
		"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределенияРасходов");	
		
	СоздатьДопЭлементыРаспределенияДоходов(Ложь, Ложь, Ложь, Истина, Ложь, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеОбъемов

&НаКлиенте
Процедура РаспределениеОбъемовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.Субпродукты, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.ОчиститьСтрокиРаспределенияПоПериодам(Объект,ЭтаФорма, "РаспределениеОбъемов",
		"РаспределениеДоходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.Субпродукты,
		Элементы.РаспределениеОбъемов, Объект,НоваяСтрока, Копирование);
	
	Если Копирование Тогда
		Элементы.РаспределениеОбъемов.ТекущиеДанные.ИндексСтрокРаспределенияПоПериодам = Неопределено;
		СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеОбъемов.ТекущиеДанные, "РаспределениеОбъемов",
		 "РаспределениеДоходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов",
		"ОбщСтоимость", Истина);		
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Субпродукты",
		"РаспределениеОбъемов", "ОбщСтоимость");	
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеОбъемов",,,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЭтаФорма.Модифицированность = ЭтаФорма.Модифицированность Или ВыбранноеЗначение.Модифицированность;
	ОбработатьВыборРаспределения(ВыбранноеЗначение, "ИндексСтрокиРаспределениеПоРолям");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов",
		"ОбщСтоимость", Истина);		
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Субпродукты",
		"РаспределениеОбъемов", "ОбщСтоимость");	
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеОбъемов",,,Ложь);
	
	Если Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
		ПересчитатьИтогиКолонокПП();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеОбъемов.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовСобствСилы_СубподрядПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеОбъемов", 
																						ИспользоватьАналитикуКонтрагентДляСС);	

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовКоличествоПриИзменении(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.ПересчитатьСуммуПоКоличеству(ЭтотОбъект, 
																	"Субпродукты", 
																	"РаспределениеОбъемов");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовСуммаПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьКоличествоПоДолеСуммы(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов",
		Объект.РаспределениеОбъемов, "ОбщСтоимость");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовСпособПривязкиПриИзменении(Элемент)
	
	СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеОбъемов.ТекущиеДанные, "РаспределениеОбъемов",
		"РаспределениеДоходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеОбъемов", "Субпродукты");	
	Если Элементы.РаспределениеОбъемов.ТекущиеДанные <> Неопределено 
		И Элементы.РаспределениеОбъемов.ТекущиеДанные.СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
		
		СоздатьДопЭлементыРаспределенияДоходов(Истина, Ложь, Ложь, Ложь, Ложь, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьЗадачиПриИзменении(Элемент)
	
	Если Объект.РучнойВводСроков Тогда
		Новый_ПриИзмененииДаты_Клиент("ДатаЗавершенияПлан");
	Иначе
		Новый_ПриИзмененииДлительности_Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьБезУчетаКалендаряПроектаПриИзменении(Элемент)

	Если Объект.РучнойВводСроков Тогда
		Новый_ПриИзмененииДаты_Клиент("ДатаЗавершенияПлан");
	Иначе
		Новый_ПриИзмененииДлительности_Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовНормированиеПриИзменении(Элемент)

	ТекущиеДанные = ЭтотОбъект.Элементы.РаспределениеОбъемов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьТрудоемкостьРаспределенияОбъемов(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовКоэффициентСложностиПриИзменении(Элемент)

	ПриИзмененииРаспределениеОбъемовКоэффициентСложности();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовТрудоемкостьПриИзменении(Элемент)
	
	ПриИзмененииРаспределениеОбъемовТрудоемкость();
	
КонецПроцедуры 

&НаКлиенте
Процедура РаспределениеОбъемовПроцентРаспределенияПриИзменении(Элемент)

 	ПриИзмененииРаспределениеОбъемовПроцентТрудоемкости();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеДополнительныхЗатрат

&НаКлиенте
Процедура РаспределениеДополнительныхЗатратПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.ДополнительныеЗатраты, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДополнительныхЗатратПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.ДополнительныеЗатраты,
		Элементы.РаспределениеДополнительныхЗатрат, Объект,НоваяСтрока, Копирование);
	
	Если Копирование Тогда
		ТекущиеДанные = Элементы.РаспределениеДополнительныхЗатрат.ТекущиеДанные;
		ТекущиеДанные.ИндексСтрокРаспределенияПоПериодам = Неопределено;
		СтрокаРаспределенияСпособПривязкиПриИзменении(ТекущиеДанные, "РаспределениеДополнительныхЗатрат",
			"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДополнительныхЗатратПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ДополнительныеЗатраты", 
		"РаспределениеДополнительныхЗатрат", "Стоимость");		
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ДополнительныеЗатраты",
		"РаспределениеДополнительныхЗатрат", "Стоимость");	
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеДополнительныхЗатрат", 
		"ИндексСтрокиРаспределениеПоРолям", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДополнительныхЗатратПослеУдаления(Элемент)
		
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ДополнительныеЗатраты", 
		"РаспределениеДополнительныхЗатрат", "Стоимость");		
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ДополнительныеЗатраты",
		"РаспределениеДополнительныхЗатрат", "Стоимость");	
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеДополнительныхЗатрат", 
		"ИндексСтрокиРаспределениеПоРолям", Ложь);

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДополнительныхЗатратПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.ОчиститьСтрокиРаспределенияПоПериодам(Объект, ЭтаФорма, "РаспределениеДополнительныхЗатрат",
		"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");			

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДополнительныхЗатратСпособПривязкиПриИзменении(Элемент)
	
	СтрокаРаспределенияСпособПривязкиПриИзменении(Элементы.РаспределениеДополнительныхЗатрат.ТекущиеДанные, "РаспределениеДополнительныхЗатрат",
		"РаспределениеРасходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям");
		
	СоздатьДопЭлементыРаспределенияДоходов(Ложь, Ложь, Ложь, Ложь, Ложь, Истина);
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, "РаспределениеДополнительныхЗатрат", 
		"ИндексСтрокиРаспределениеПоРолям", Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СкрытьФинИнформацию_ДоступОтсутствует()
	
	Элементы.СтраницаФинПланы.Видимость = Ложь;
	Элементы.СтраницаСубпродукты.Видимость = Ложь;
	Элементы.ДопЗатраты.Видимость = Ложь;
	Элементы.ГруппаРаспределениеПотребностей.Видимость = Ложь;
	
	Элементы.НормаСтоимостиНастройка.Видимость = Ложь;
		
	Элементы.ГруппаНастройкаМатРесурсов.Видимость = Ложь;
	
	Элементы.МатериалыИОборудование_Заполнить.Доступность = Ложь;
			
	//
	
	КолонкиСОграничениемДоступа = Новый Массив;
	
	ИмяТЧ = "ТрудовыеРесурсы"; 
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Стоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ОбщСтоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ВнешняяСтоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ОбщВнешняяСтоимость");
	
	ИмяТЧ = "МатериальныеРесурсы";
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "СпособПривязкиПотребности");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Стоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ОбщСтоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ЗадержкаЗаказа");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Валюта");	
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Контрагент");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Договор");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "СпособПривязки");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "СтатьяЗатрат");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ПрофильРаспределения");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ДатаПривязки");
			
	упоРазграничениеДоступаВызовСервера.УстановитьДоступККолонкамТабличнойЧасти(Элементы, 
																				КолонкиСОграничениемДоступа, 
																				"Отсутствует");
	
КонецФункции

&НаСервере
Функция СкрытьФинИнформацию_ДоступНаПросмотр()
	
	Элементы.СтраницаФинПланы.ТолькоПросмотр = Истина;
	Элементы.ПланДоходов.КоманднаяПанель.Доступность = Ложь;
	Элементы.РаспределениеДоходов.КоманднаяПанель.Доступность = Ложь;
	Элементы.ПланРасходов.КоманднаяПанель.Доступность = Ложь;
	Элементы.РаспределениеРасходов.КоманднаяПанель.Доступность = Ложь;
	
	Элементы.СтраницаСубпродукты.ТолькоПросмотр = Истина;
	Элементы.ПересчитатьСтоимостьТрудовыхРесурсов.Доступность = Ложь;
	Элементы.МатРесурсыПересчитатьПоНорме.Доступность = Ложь;
	
КонецФункции	

&НаКлиенте
Процедура ВыбратьЗадачуРодителя()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыбиратьТолькоЭтапы", Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Объект.Владелец);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьЗадачуРодителяОсновная",ЭтотОбъект);
	ОткрытьФорму("Справочник.упоШаблоныПроектныхЗадач.ФормаВыбора", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗадачуРодителяОсновная(ВыбранныйРодитель,ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйРодитель) Тогда
		Если ВыбранныйРодитель = Объект.Ссылка Тогда
			Сообщение = НСтр("ru = 'Нельзя выбрать в качестве родителя эту же проектную задачу!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);
		Иначе
			Объект.Родитель = ВыбранныйРодитель;     
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПоНормеТрудовыеРесурсыСервер()
	
	Если ЗначениеЗаполнено(Объект.НормаСтоимостиТрудовыхРесурсов) Тогда      
		
		ТрудовыеРесурсыКопия = Объект.ТрудовыеРесурсы.Выгрузить();
		
		упоРесурсыИНормыВызовСервера.обРассчитатьСтоимостьРесурсовПоНорме(ТрудовыеРесурсыКопия, Объект, Объект.НормаСтоимостиТрудовыхРесурсов);
		Объект.ТрудовыеРесурсы.Загрузить(ТрудовыеРесурсыКопия);

	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ВнешняяНормаСтоимостиТрудовыхРесурсов) Тогда
		
		ТрудовыеРесурсы = Объект.ТрудовыеРесурсы.Выгрузить(); 
		
		КолонкаСтоимость =  ТрудовыеРесурсы.Колонки.Найти("Стоимость");
		КолонкаСтоимость.Имя =  "Стоимость1";
		
		КолонкаОбщСтоимость = ТрудовыеРесурсы.Колонки.Найти("ОбщСтоимость");
		КолонкаОбщСтоимость.Имя = "ОбщСтоимость1";
		
		КолонкаСтоимостьВн =  ТрудовыеРесурсы.Колонки.Найти("ВнешняяСтоимость");
		КолонкаСтоимостьВн.Имя = "Стоимость";
		КолонкаОбщСтоимостьВн =  ТрудовыеРесурсы.Колонки.Найти("ОбщВнешняяСтоимость");
		КолонкаОбщСтоимостьВн.Имя = "ОбщСтоимость";
		
		упоРесурсыИНормыВызовСервера.обРассчитатьСтоимостьРесурсовПоНорме(ТрудовыеРесурсы, Объект, Объект.ВнешняяНормаСтоимостиТрудовыхРесурсов);		
		
		КолонкаСтоимостьВн.Имя =  "ВнешняяСтоимость";
		КолонкаОбщСтоимостьВн.Имя = "ОбщВнешняяСтоимость";
		КолонкаСтоимость.Имя =  "Стоимость";
		КолонкаОбщСтоимость.Имя = "ОбщСтоимость";
		
		Объект.ТрудовыеРесурсы.Загрузить(ТрудовыеРесурсы);
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧФинПланы(ИмяКоманды)

	Если ИмяКоманды.Имя = "ПланДоходовУстановитьКонтрагента" Тогда
		
		// начало.доходы
		ИмяФормыВыбора = "Справочник.упоШаблоныКонтрагентов.ФормаВыбора";
		ТабличнаяЧасть = "ПланДоходов";
		ИмяРеквизита =  "Контрагент";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоШаблоныКонтрагентов"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);

	ИначеЕсли ИмяКоманды.Имя = "ПланДоходовУстановитьПрофиль" Тогда
		
		ИмяФормыВыбора = "Справочник.упоПрофилиРаспределенияДоходовИРасходов.ФормаВыбора";
		ТабличнаяЧасть = "ПланДоходов";	
		ИмяРеквизита =  "ПрофильРаспределения";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		
		// конец.доходы
	ИначеЕсли ИмяКоманды.Имя = "ПланРасходовУстановитьКонтрагента" Тогда
		
		// начало.расходы
		ИмяФормыВыбора = "Справочник.упоШаблоныКонтрагентов.ФормаВыбора";
		ТабличнаяЧасть = "ПланРасходов";
		ИмяРеквизита =  "Контрагент";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоШаблоныКонтрагентов"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		
	ИначеЕсли ИмяКоманды.Имя = "ПланРасходовУстановитьПрофиль" Тогда
		
		ИмяФормыВыбора = "Справочник.упоПрофилиРаспределенияДоходовИРасходов.ФормаВыбора";
		ТабличнаяЧасть = "ПланРасходов";
		ИмяРеквизита =  "ПрофильРаспределения";

		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		
		// конец.расходы
		
	ИначеЕсли ИмяКоманды.Имя = "ПланПоступленийУстановитьКонтрагента" Тогда
		
		// начало.ПланПоступлений
		ИмяФормыВыбора = "Справочник.упоШаблоныКонтрагентов.ФормаВыбора";
		ТабличнаяЧасть = "ПланПоступлений";
		ИмяРеквизита =  "Контрагент";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоШаблоныКонтрагентов"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		
	ИначеЕсли ИмяКоманды.Имя = "ПланПоступленийУстановитьСпособПривязки" Тогда
		
		ИмяФормыВыбора = "Перечисление.упоСпособПривязкиДДС.ФормаВыбора";
		ТабличнаяЧасть = "ПланПоступлений";
		ИмяРеквизита =  "СпособПривязки";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.упоСпособПривязкиДДС"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		
		// конец.ПланПоступлений
		
	ИначеЕсли ИмяКоманды.Имя = "ПланВыплатУстановитьКонтрагента" Тогда
		
		// начало.ПланВыплат
		ИмяФормыВыбора = "Справочник.упоШаблоныКонтрагентов.ФормаВыбора";
		ТабличнаяЧасть = "ПланВыплат";	
		ИмяРеквизита =  "Контрагент";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоШаблоныКонтрагентов"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		
	ИначеЕсли ИмяКоманды.Имя = "ПланВыплатУстановитьСпособПривязки" Тогда
		
		ИмяФормыВыбора = "Перечисление.упоСпособПривязкиДДС.ФормаВыбора";
		ТабличнаяЧасть = "ПланВыплат";	
		ИмяРеквизита =  "СпособПривязки";
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.упоСпособПривязкиДДС"));	
		ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		
		// конец.ПланВыплат

	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТЧФинПланыЗавершение",ЭтотОбъект);
	
	упоРаботаСФормамиКлиент.ЗаполнитьЗначениеВТЧ(Объект, ТабличнаяЧасть, ИмяРеквизита,
		ОписаниеТиповЗначения,,,,,ОписаниеОповещения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьТЧФинПланыЗавершение(Результат,ДополнительныеПараметры) Экспорт
	
	РезультатВыбора = Результат;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидМатериальногоРесурса(Ресурс)
	
	Возврат Ресурс.упоВидМатериальногоРесурса;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Функция УстановитьОтметкуНезаполненного(Отметка = Истина)
	
	Элементы.ДлительностьМоделиПакетаРабот.АвтоОтметкаНезаполненного 	= Отметка;
	Элементы.ЕдиницаНормированияДлительности.АвтоОтметкаНезаполненного  = Отметка;
	Элементы.ДлительностьМоделиПакетаРабот.ОтметкаНезаполненного		= Отметка;
	Элементы.ЕдиницаНормированияДлительности.ОтметкаНезаполненного		= Отметка;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОбщийПрофильКлиент(ИмяТаблицы)
	
	ТабличнаяЧасть = Неопределено;
	
	Если ИмяТаблицы = "ТрудовыеРесурсы" Тогда
		ТабличнаяЧасть = Объект.ТрудовыеРесурсы;
	Иначе
		Возврат;
	КонецЕсли; 
	
	Если ТабличнаяЧасть.Количество() = 0 Тогда      
		Возврат;
	КонецЕсли; 
	
	 // Выбираем профиль распределения.
	 
	 Контекст = Новый Структура;
	 Контекст.Вставить("ИмяТаблицы",ИмяТаблицы);
	 ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьОбщийПрофильКлиентОсновная",ЭтотОбъект,Контекст);
	 ОткрытьФорму("Справочник.упоПрофилиРаспределенияТрудозатрат.ФормаВыбора",,,,,,ОписаниеОповещения);
	 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийПрофильКлиентОсновная(ОбщийПрофиль,ДополнительныеПараметры) Экспорт
	
	Если ОбщийПрофиль <> Неопределено Тогда
		
		ТабличнаяЧасть = Неопределено;
		
		Если ДополнительныеПараметры.ИмяТаблицы = "ТрудовыеРесурсы" Тогда
			ТабличнаяЧасть = Объект.ТрудовыеРесурсы;
		Иначе
			Возврат;
		КонецЕсли; 
		
		Если ТабличнаяЧасть.Количество() = 0 Тогда      
			Возврат;
		КонецЕсли; 
		
		
		Для каждого СтрокаДанных Из ТабличнаяЧасть Цикл
			СтрокаДанных.ПрофильРаспределения = ОбщийПрофиль;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура МатРесурсы_ПересчитатьПоНормеСервер()
	
	упоРаботаСФормамиСервер.ТаблицаРесурсов_ПересчитатьПоНормеСервер(Объект, "МатериальныеРесурсы");
	
КонецПроцедуры

&НаСервере
Процедура Субпродукты_ПересчитатьПоНормеСервер()
	
	упоРаботаСФормамиСервер.ТаблицаРесурсов_ПересчитатьПоНормеСервер(Объект, "Субпродукты", "НормаСтоимостиОбъемы",
		Истина, "РаспределениеОбъемов"); 
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	 		
	АдресХранилища = "";
	
	Если имяКоманды = "ПредшественницыПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПредУсловия;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоШаблоныПроектныхЗадач";
        ТаблицаФормы = Объект.ПредУсловия;
	    ИмяКолонки = "ЗадачаПредшественник";
					
				
	ИначеЕсли  имяКоманды = "РолиТрудовыхРесурсовПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ТрудовыеРесурсы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоРоли";
		ТаблицаФормы = Объект.ТрудовыеРесурсы;
		ИмяКолонки = "Ресурс";		
				
	ИначеЕсли  имяКоманды = "ДопЗатратыПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ДополнительныеЗатраты;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоСтатьиЗатрат";
		ТаблицаФормы = Объект.ДополнительныеЗатраты;
		ИмяКолонки = "СтатьяЗатрат";		
		
	ИначеЕсли  имяКоманды = "ПланДоходовПодобратьПоКонтрагентам" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланДоходов;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоШаблоныКонтрагентов";
		ТаблицаФормы = Объект.ПланДоходов;
		ИмяКолонки = "Контрагент";		
		
	ИначеЕсли  имяКоманды = "ПланДоходовПодобратьПостатьямДохода" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланДоходов;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоСтатьиДоходов";
		ТаблицаФормы = Объект.ПланДоходов;
		ИмяКолонки = "Статья";		
		
	ИначеЕсли  имяКоманды = "ПланРасходовПодобратьПоКонтрагентам" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланРасходов;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоШаблоныКонтрагентов";
		ТаблицаФормы = Объект.ПланРасходов;
		ИмяКолонки = "Контрагент";		
		
	ИначеЕсли  имяКоманды = "ПланРасходовПодобратьПоСтатьям" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланРасходов;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоСтатьиЗатрат";
		ТаблицаФормы = Объект.ПланРасходов;
		ИмяКолонки = "Статья";		
		
	ИначеЕсли  имяКоманды = "ПланПоступленийПодобратьПоСтатьям" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланПоступлений;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.СтатьиДвиженияДенежныхСредств";
		ТаблицаФормы = Объект.ПланПоступлений;
		ИмяКолонки = "Статья";		
		
	ИначеЕсли  имяКоманды = "ПланПоступленийПодобратьПоКонтрагентам" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланПоступлений;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоШаблоныКонтрагентов";
		ТаблицаФормы = Объект.ПланПоступлений;
		ИмяКолонки = "Контрагент";				
		
	ИначеЕсли  имяКоманды = "МатериалыИДопОборудованиеПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.МатериальныеРесурсы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.Номенклатура";
		ТаблицаФормы = Объект.МатериальныеРесурсы;
		ИмяКолонки = "Ресурс";				
		
	ИначеЕсли  имяКоманды = "ПланВыплатПодобратьПоСтатьям" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланВыплат;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.СтатьиДвиженияДенежныхСредств";
		ТаблицаФормы = Объект.ПланВыплат;
		ИмяКолонки = "Статья";				
		
	ИначеЕсли  имяКоманды = "ПланВыплатПодобратьПоКонтрагентам" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПланВыплат;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоШаблоныКонтрагентов";
		ТаблицаФормы = Объект.ПланВыплат;
		ИмяКолонки = "Контрагент";				
		
	ИначеЕсли  имяКоманды = "СубпродуктыПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.Субпродукты;
		Если Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
			ИмяОбъектаВМетаданных =  "Справочники.упоПроектнаяПродукция";
			ПараметрыПодбора.ДопПараметры.Вставить("УстановитьПользовательскиеНастройки", Истина);
		Иначе
			ИмяОбъектаВМетаданных =  "Справочники.Номенклатура";
		КонецЕсли;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = ИмяОбъектаВМетаданных;
		ТаблицаФормы = Объект.Субпродукты;
		ИмяКолонки = "Ресурс";				
				
	КонецЕсли;
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
	
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
    ПараметрыПодбора.ДопПараметры.ДеревоОтбор = СтруктураДоп.АдресХранилищаДеревоОтбора;

	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	СтруктураДоп.Вставить("АдресХранилищаДеревоОтбора");
	
	Если имяКоманды = "ПредшественницыПодобрать" Тогда
		
		СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора(имяКоманды);
		
	ИначеЕсли имяКоманды = "СубпродуктыПодобрать"
				И Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
		
		СтруктураДоп.АдресХранилищаДеревоОтбора = ПодготовитьДеревоОтбораПодбора(имяКоманды);

	КонецЕсли;
		
	АдресХранилища = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора(имяКоманды)
	
	Перем ТаблицаОтбора;
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	
	Если имяКоманды = "ПредшественницыПодобрать" Тогда
		
		НоваяСтрока 					=  ТаблицаОтбора.Добавить();
		НоваяСтрока.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Ссылка");
		НоваяСтрока.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
		НоваяСтрока.Применение 			= ТипПримененияОтбораКомпоновкиДанных.Элементы;
		НоваяСтрока.Использование  		= Истина;
		НоваяСтрока.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
		
		ЗапросПЗ = Новый Запрос;
		ЗапросПЗ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                 |	упоШаблоныПроектныхЗадач.Ссылка КАК ПроектнаяЗадача
		                 |ИЗ
		                 |	Справочник.упоШаблоныПроектныхЗадач КАК упоШаблоныПроектныхЗадач
		                 |ГДЕ
		                 |	упоШаблоныПроектныхЗадач.Владелец = &Владелец
		                 |	И НЕ упоШаблоныПроектныхЗадач.Ссылка = &Ссылка";
		
		ЗапросПЗ.УстановитьПараметр("Владелец", Объект.Владелец);
		ЗапросПЗ.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		ТаблицаПЗ = ЗапросПЗ.Выполнить().Выгрузить();
		
		МассивПЗ = ТаблицаПЗ.ВыгрузитьКолонку("ПроектнаяЗадача");
		
		СписокЗадач = Новый СписокЗначений;
		СписокЗадач.ЗагрузитьЗначения(МассивПЗ);
		
		НоваяСтрока.ПравоеЗначение = СписокЗадач;
				
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ПодготовитьДеревоОтбораПодбора(имяКоманды)
	
	ДеревоОтбора = упоПодборВТабличнуюЧастьСервер.НовоеДеревоОтбора();	  
	
	Если имяКоманды = "СубпродуктыПодобрать"
				И Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
			
		ОтборПометкаУдаления = ДеревоОтбора.Строки.Добавить();
		ОтборПометкаУдаления.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ОтборПометкаУдаления.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПометкаУдаления.Использование  = Истина;
		ОтборПометкаУдаления.ПравоеЗначение = Ложь;
		ОтборПометкаУдаления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		НоваяСтрокаШаблон = ДеревоОтбора.Строки.Добавить();
		НоваяСтрокаШаблон.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Шаблон");
		НоваяСтрокаШаблон.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НоваяСтрокаШаблон.Использование = Истина;
		НоваяСтрокаШаблон.ПравоеЗначение = Истина;
		НоваяСтрокаШаблон.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		НоваяСтрокаШаблон.ИмяПоля = "Шаблон";
							
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ДеревоОтбора, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимость()

	ЭтоПР = Объект.ЭтоПакетРабот;
	ЭтоМПР = Объект.ЭтоМодельПакетаРабот;
	ЭтоВеха = (Не ЭтоПР) И (Не ЭтоМПР) И Объект.ЭтоВеха;
	
	Элементы.ДлительностьМоделиПакетаРабот.Видимость = ЭтоМПР;
	Элементы.ЕдиницаНормированияДлительности.Видимость = ЭтоМПР;
	Элементы.ДлительностьБезУчетаКалендаряПроекта.Видимость = ЭтоМПР;
	Элементы.ГруппаЗаполнитьДлительность.Видимость = ЭтоМПР;
				
КонецПроцедуры

&НаКлиенте
Процедура НадписьЗадачаРодительНажатие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда
		
		ПоказатьЗначение(,Объект.Родитель);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСроков() 
	
	Элементы.ДатаНачалаПлан.ТолькоПросмотр = Объект.ЭтоВеха ИЛИ НЕ Объект.РучнойВводСроков;	
	Элементы.ДатаНачалаПлан.АвтоОтметкаНезаполненного = НЕ Элементы.ДатаНачалаПлан.ТолькоПросмотр;
	Если Элементы.ДатаНачалаПлан.ТолькоПросмотр Тогда
		Элементы.ДатаНачалаПлан.ОтметкаНезаполненного = Ложь;
	КонецЕсли;	
	
	Элементы.ДатаЗавершенияПлан.ТолькоПросмотр = НЕ Объект.РучнойВводСроков;
	Элементы.ДатаЗавершенияПлан.АвтоОтметкаНезаполненного = НЕ Элементы.ДатаНачалаПлан.ТолькоПросмотр;
	Если Элементы.ДатаЗавершенияПлан.ТолькоПросмотр Тогда
		Элементы.ДатаЗавершенияПлан.ОтметкаНезаполненного = Ложь;
	КонецЕсли;	

	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ ФОРМЫ ПРОЕКТНОЙ ЗАДАЧИ


&НаСервере
Процедура СоздатьДопЭлементыРаспределенияДоходов(ПроверятьОбъемы, ПроверятьДоходы, ПроверятьПотребности,
	ПроверятьРасходы, ПроверятьРолиТрудовыхРесурсов, ПроверятьДопЗатраты, СоздатьДопКолонки = Неопределено)
	
	Перем ПараметрыРаспределения;
	
	Если ПроверятьОбъемы Тогда
		
		Если СоздатьДопКолонки = Неопределено Тогда
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("СпособПривязки", Перечисления.упоСпособПривязкиРаспределения.Вручную);
			НеобходимоСоздатьДопКолонки = Объект.РаспределениеОбъемов.НайтиСтроки(ОтборСтрок).Количество() > 0;
		Иначе
			НеобходимоСоздатьДопКолонки = СоздатьДопКолонки;
		КонецЕсли;
		
		Если НеобходимоСоздатьДопКолонки Тогда
			Элементы.РаспределениеОбъемовГруппаКоличествоСуммаРаспределение.Видимость = Истина;
			ПодготовитьПараметрыРаспределенияПоПериодам(ПараметрыРаспределения, "РаспределениеОбъемов",
				"РаспределениеДоходовПоПериодам", "ИндексСтрокиРаспределениеПоРолям", Истина);
		Иначе
			Элементы.РаспределениеОбъемовГруппаКоличествоСуммаРаспределение.Видимость = Ложь;
		КонецЕсли;
		
		ДобавитьУдалитьДопЭлементыФормы(ПараметрыРаспределения, "РаспределениеОбъемов", НеобходимоСоздатьДопКолонки);	
		
	КонецЕсли;
	
	Если ПроверятьРолиТрудовыхРесурсов Тогда
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("СпособПривязки", Перечисления.упоСпособПривязкиРаспределения.Вручную);	
		НеобходимоСоздатьДопКолонки = Объект.ТрудовыеРесурсы.НайтиСтроки(ОтборСтрок).Количество() > 0;
		
		Если НеобходимоСоздатьДопКолонки Тогда
			Элементы.ТрудовыеРесурсыГруппаКоличествоРаспределение.Видимость = Истина;
			ПодготовитьПараметрыРаспределенияПоПериодам(ПараметрыРаспределения, "ТрудовыеРесурсы",
				"ТрудовыеРесурсыПоПериодам", "ИндексСтрокиРаспределениеПоРолям", Истина);
		Иначе
			Элементы.ТрудовыеРесурсыГруппаКоличествоРаспределение.Видимость = Ложь;
		КонецЕсли;
		
		ДобавитьУдалитьДопЭлементыФормы(ПараметрыРаспределения, "ТрудовыеРесурсы", НеобходимоСоздатьДопКолонки);
		
	КонецЕсли;
	
	Если ПроверятьДоходы Тогда
		
		ПараметрыРаспределения = Неопределено;
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("СпособПривязки", Перечисления.упоСпособПривязкиРаспределения.Вручную);	
		НеобходимоСоздатьДопКолонки = Объект.РаспределениеДоходов.НайтиСтроки(ОтборСтрок).Количество() > 0;
		
		Если НеобходимоСоздатьДопКолонки Тогда
			ПодготовитьПараметрыРаспределенияПоПериодам(ПараметрыРаспределения, "РаспределениеДоходов",
				"РаспределениеДоходовПоПериодам", "ИндексСтрокиРаспределенияДоходов", Ложь);
			Элементы.РаспределениеДоходовГруппаСуммаКоличествоРаспределено.Видимость = Истина;
		Иначе
			Элементы.РаспределениеДоходовГруппаСуммаКоличествоРаспределено.Видимость = Ложь;
		КонецЕсли;
		
		ДобавитьУдалитьДопЭлементыФормы(ПараметрыРаспределения, "РаспределениеДоходов", НеобходимоСоздатьДопКолонки);	
		
	КонецЕсли;
	
	Если ПроверятьПотребности Тогда
		
		ПараметрыРаспределения = Неопределено;
		
		Если СоздатьДопКолонки = Неопределено Тогда
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("СпособПривязки", Перечисления.упоСпособПривязкиРаспределения.Вручную);	
			НеобходимоСоздатьДопКолонки = Объект.РаспределениеПотребностей.НайтиСтроки(ОтборСтрок).Количество() > 0;
		Иначе
			НеобходимоСоздатьДопКолонки = СоздатьДопКолонки;
		КонецЕсли;
		
		Если НеобходимоСоздатьДопКолонки Тогда
			ПодготовитьПараметрыРаспределенияПоПериодам(ПараметрыРаспределения, "РаспределениеПотребностей", 
				"РаспределениеРасходовПоПериодам","ИндексСтрокиРаспределениеПоРолям", Истина, Истина);
			Элементы.РаспределениеПотребностейГруппаКоличествоСуммаРаспределение.Видимость = Истина;
		Иначе
			Элементы.РаспределениеПотребностейГруппаКоличествоСуммаРаспределение.Видимость = Ложь;
		КонецЕсли;
		
		ДобавитьУдалитьДопЭлементыФормы(ПараметрыРаспределения, "РаспределениеПотребностей", НеобходимоСоздатьДопКолонки);	
		
	КонецЕсли;
	
	Если ПроверятьРасходы Тогда
		
		ПараметрыРаспределения = Неопределено;
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("СпособПривязки", Перечисления.упоСпособПривязкиРаспределения.Вручную);	
		НеобходимоСоздатьДопКолонки = Объект.РаспределениеРасходов.НайтиСтроки(ОтборСтрок).Количество() > 0;
		
		Если НеобходимоСоздатьДопКолонки Тогда
			ПодготовитьПараметрыРаспределенияПоПериодам(ПараметрыРаспределения, "РаспределениеРасходов", 
				"РаспределениеРасходовПоПериодам","ИндексСтрокиРаспределенияРасходов", Ложь, Истина);
			Элементы.РаспределениеРасходовГруппаСуммаКоличествоРаспределено.Видимость = Истина;
		Иначе
			Элементы.РаспределениеРасходовГруппаСуммаКоличествоРаспределено.Видимость = Ложь;
		КонецЕсли;
		
		ДобавитьУдалитьДопЭлементыФормы(ПараметрыРаспределения, "РаспределениеРасходов", НеобходимоСоздатьДопКолонки);	
		
	КонецЕсли;

	Если ПроверятьДопЗатраты Тогда
		
		ПараметрыРаспределения = Неопределено;
		
		Если СоздатьДопКолонки = Неопределено Тогда
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("СпособПривязки", Перечисления.упоСпособПривязкиРаспределения.Вручную);	
			НеобходимоСоздатьДопКолонки = Объект.РаспределениеДополнительныхЗатрат.НайтиСтроки(ОтборСтрок).Количество() > 0;
		Иначе
			НеобходимоСоздатьДопКолонки = СоздатьДопКолонки;
		КонецЕсли;
		
		Если НеобходимоСоздатьДопКолонки Тогда
			ПодготовитьПараметрыРаспределенияПоПериодам(ПараметрыРаспределения, "РаспределениеДополнительныхЗатрат", 
				"РаспределениеРасходовПоПериодам","ИндексСтрокиРаспределениеПоРолям", Ложь, Истина);
			Элементы.РаспределениеДополнительныхЗатратГруппаКоличествоСуммаРаспределение.Видимость = Истина;
		Иначе
			Элементы.РаспределениеДополнительныхЗатратГруппаКоличествоСуммаРаспределение.Видимость = Ложь;
		КонецЕсли;
		
		ДобавитьУдалитьДопЭлементыФормы(ПараметрыРаспределения, "РаспределениеДополнительныхЗатрат", НеобходимоСоздатьДопКолонки);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПараметрыРаспределенияПоПериодам(ПараметрыРаспределения, ТаблицаРаспределения, ТаблицаПериоды,
	КолонкаИндекса, РаспределятьКоличество, ПроверятьИсточникПлана = Ложь)
	
	ПараметрыРаспределения = Новый Структура;
	
	МассивСтрок = Новый Массив;
	СписокКолонокПрограммно = Новый СписокЗначений;
	СписокКолонокИтогов = Новый СписокЗначений;
	
	Для каждого СтрокаРаспределения Из Объект[ТаблицаРаспределения] Цикл 
		
		Если СтрокаРаспределения.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.Вручную Тогда
			
			МассивСтрок.Добавить(СтрокаРаспределения);
			
		КонецЕсли;
		
	КонецЦикла;
	                     
	ТаблицаДляРаспределения = Объект[ТаблицаРаспределения].Выгрузить(МассивСтрок);	 
	
	Если ПроверятьИсточникПлана Тогда
		ИсточникПлана = упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ТаблицаРаспределения);
	КонецЕсли;

	МассивСтрокРаспределенияПоПериодам = Новый Массив;
	
	Для каждого СтрокаРаспределеннаяПоМесяцам Из Объект[ТаблицаПериоды] Цикл
		
		Если СтрокаРаспределеннаяПоМесяцам[КолонкаИндекса] <> Неопределено Тогда
			
			Если ПроверятьИсточникПлана И СтрокаРаспределеннаяПоМесяцам.ИсточникПлана <> ИсточникПлана Тогда
				Продолжить;
			КонецЕсли;
			МассивСтрокРаспределенияПоПериодам.Добавить(СтрокаРаспределеннаяПоМесяцам);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	СрокиЗадачи = Новый Структура;
	
	СрокиЗадачи.Вставить("ДатаНачала", Объект.ДатаНачалаПлан);
	СрокиЗадачи.Вставить("ДатаОкончания", Объект.ДатаЗавершенияПлан);
	
	ТаблицаРаспределениеПоПериодам = Объект[ТаблицаПериоды].Выгрузить(МассивСтрокРаспределенияПоПериодам);
	
	Если ТаблицаРаспределениеПоПериодам.Количество() > 0 Тогда
		
		ТаблицаРаспределениеПоПериодам.Сортировать("Период убыв");
		КрайнийСрокКонец = ТаблицаРаспределениеПоПериодам.Получить(0).Период;
		ТаблицаРаспределениеПоПериодам.Сортировать("Период возр");
		КрайнийСрокНачало = ТаблицаРаспределениеПоПериодам.Получить(0).Период;
		
		Если КрайнийСрокКонец > Объект.ДатаЗавершенияПлан Тогда
			
			СрокиЗадачи.Вставить("ДатаОкончания", КрайнийСрокКонец);
			
		КонецЕсли;
		
		Если КрайнийСрокНачало < Объект.ДатаНачалаПлан Тогда
			
			СрокиЗадачи.Вставить("ДатаНачала", КрайнийСрокНачало);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	Если Не ЗначениеЗаполнено(СрокиЗадачи.ДатаНачала) Тогда
		СрокиЗадачи.ДатаНачала = ТекДата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СрокиЗадачи.ДатаОкончания) Тогда
		СрокиЗадачи.ДатаОкончания = ТекДата;
	КонецЕсли;
	
	КонецМесяцаНачало = КонецМесяца(СрокиЗадачи.ДатаНачала);
	КонецМесяцаКонец = КонецМесяца(СрокиЗадачи.ДатаОкончания);
	
	СписокПериодов = Новый СписокЗначений;
	
	СчетчикПериодов = КонецМесяцаНачало;
	
	Пока СчетчикПериодов <= КонецМесяцаКонец Цикл
		
		СписокПериодов.Добавить(СчетчикПериодов);
		СчетчикПериодов = КонецМесяца(СчетчикПериодов + 1);
		
	КонецЦикла;
	
	МассивТиповКолво = Новый Массив;
	МассивТиповКолво.Добавить(Тип("Число"));
	
	Если ТаблицаРаспределения <> "ТрудовыеРесурсы" Тогда 
		Точность = 3;
	Иначе
		Точность = 2;
	КонецЕсли;
	КЧКоличество = Новый КвалификаторыЧисла(15, Точность, ДопустимыйЗнак.Неотрицательный);
	ОписаниеТиповКоличество = Новый ОписаниеТипов(МассивТиповКолво, , , КЧКоличество);
	
	КЧСумма = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой);
	ОписаниеТиповСумма = Новый ОписаниеТипов(МассивТиповКолво, , , КЧСумма);
				
	Для каждого СтрокаСпискаПериодов Из СписокПериодов Цикл
		
		Если РаспределятьКоличество Тогда
			
			ИмяКолонкиКоличество = "Количество_" + ТаблицаРаспределения + "_" 
				+ Формат(СтрокаСпискаПериодов.Значение, "ДФ=MM_yyyy");
			Если ТаблицаДляРаспределения.Колонки.Найти(ИмяКолонкиКоличество) = Неопределено Тогда
				НоваяКолонка = ТаблицаДляРаспределения.Колонки.Добавить(ИмяКолонкиКоличество, ОписаниеТиповКоличество,
					Формат(СтрокаСпискаПериодов.Значение,"ДФ='MMMM yyyy'") + "(кол.)");
			КонецЕсли;
			
			СписокКолонокИтогов.Добавить("Всего_" + ИмяКолонкиКоличество);		
			СписокКолонокПрограммно.Добавить(СтрокаСпискаПериодов.Значение, ИмяКолонкиКоличество);
			
		КонецЕсли;
		
		Если ТаблицаРаспределения <> "ТрудовыеРесурсы" Тогда

			ИмяКолонкиСумма = "Сумма_" + ТаблицаРаспределения + "_" + Формат(СтрокаСпискаПериодов.Значение, "ДФ=MM_yyyy");		
			Если ТаблицаДляРаспределения.Колонки.Найти(ИмяКолонкиСумма) = Неопределено Тогда
				НоваяКолонка = ТаблицаДляРаспределения.Колонки.Добавить(ИмяКолонкиСумма, ОписаниеТиповСумма,
					Формат(СтрокаСпискаПериодов.Значение, "ДФ='MMMM yyyy'"));
			КонецЕсли;
			
			СписокКолонокПрограммно.Добавить(СтрокаСпискаПериодов.Значение, ИмяКолонкиСумма);
			
			СписокКолонокИтогов.Добавить("Всего_" + ИмяКолонкиСумма);
				
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаРаспределеннаяПоПериодам Из ТаблицаРаспределениеПоПериодам Цикл
		
		НайденнаяСтрока = ТаблицаДляРаспределения.Найти(СтрокаРаспределеннаяПоПериодам[КолонкаИндекса],
			"ИндексСтрокРаспределенияПоПериодам");
		
		Если НайденнаяСтрока <> Неопределено Тогда
			Если РаспределятьКоличество Тогда
				ИмяКолонки = "Количество_" + ТаблицаРаспределения + "_" 
					+ Формат(СтрокаРаспределеннаяПоПериодам.Период, "ДФ=MM_yyyy");
				НайденнаяСтрока[ИмяКолонки]  =  СтрокаРаспределеннаяПоПериодам.Количество;
			КонецЕсли;
			Если ТаблицаРаспределения <> "ТрудовыеРесурсы" Тогда
				ИмяКолонки = "Сумма_" + ТаблицаРаспределения + "_" + Формат(СтрокаРаспределеннаяПоПериодам.Период, "ДФ=MM_yyyy");
				НайденнаяСтрока[ИмяКолонки] = СтрокаРаспределеннаяПоПериодам.Сумма;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыРаспределения.Вставить("СрокиЗадачи", СрокиЗадачи);
	ПараметрыРаспределения.Вставить("АдресТР", ТаблицаДляРаспределения);
	ПараметрыРаспределения.Вставить("РаспределятьКоличество", РаспределятьКоличество);
	ПараметрыРаспределения.Вставить("СписокКолонокПрограммно", СписокКолонокПрограммно);
	ПараметрыРаспределения.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыРаспределения.Вставить("СписокПериодов", СписокПериодов);
	ПараметрыРаспределения.Вставить("КолонкаИндекса", КолонкаИндекса);
	ПараметрыРаспределения.Вставить("РаспределятьКоличество", РаспределятьКоличество);
	ПараметрыРаспределения.Вставить("СписокКолонокИтогов", СписокКолонокИтогов);
	
	Если ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам = Неопределено Тогда	
		ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам = Новый Структура;
	КонецЕсли;

	Если Не ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам.Свойство(ТаблицаРаспределения) Тогда
		ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам.Вставить(ТаблицаРаспределения);
	КонецЕсли;
	ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам[ТаблицаРаспределения] = СписокКолонокПрограммно;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдалитьДопЭлементыФормы(ПараметрыРаспределения, ИмяТаблицыРаспределения,
	НеобходимоСоздатьДопКолонки = Истина)
	
	Если НеобходимоСоздатьДопКолонки Тогда
		
		ТаблицаРаспределения  = ПараметрыРаспределения.АдресТР;
		
	КонецЕсли;
	
	СписокЭлементовДляДобавления = Новый СписокЗначений;
	МассивРеквизитов = Новый Массив;
	
	МассивРеквизитовНаУдаление = Новый Массив;
	СписокЭлементовДляУдаления = Новый СписокЗначений;
	
	ПрограммноСозданныеЭлементы = упоРаботаСФормамиКлиентСервер.ПолучитьЭлементыРаспределенияПоПериодам(ЭтаФорма, ИмяТаблицыРаспределения);
	Для Каждого ЭлементПрограммно Из ПрограммноСозданныеЭлементы Цикл
		
		СписокЭлементовДляУдаления.Добавить(ЭлементПрограммно);		
		
		Если ЭлементПрограммно.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
			
			Для Каждого ЭлементПодчиненный Из ЭлементПрограммно.ПодчиненныеЭлементы Цикл
				
				МассивРеквизитовНаУдаление.Добавить(ЭлементПодчиненный.ПутьКДанным);
				
				Если СтрДлина(ЭлементПодчиненный.ПутьКДаннымПодвала) > 0 Тогда
					
					МассивРеквизитовНаУдаление.Добавить(ЭлементПодчиненный.ПутьКДаннымПодвала);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			МассивРеквизитовНаУдаление.Добавить(ЭлементПрограммно.ПутьКДанным);
			
			Если СтрДлина(ЭлементПрограммно.ПутьКДаннымПодвала) > 0 Тогда
				
				МассивРеквизитовНаУдаление.Добавить(ЭлементПрограммно.ПутьКДаннымПодвала);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НеобходимоСоздатьДопКолонки Тогда
		Для Каждого КолонкаПрограммно Из ПараметрыРаспределения.СписокКолонокПрограммно Цикл
			
			КолонкаТаблицы = ТаблицаРаспределения.Колонки.Найти(КолонкаПрограммно.Представление);	 
			НоваяКолонка = Новый РеквизитФормы(КолонкаТаблицы.Имя, КолонкаТаблицы.ТипЗначения, "Объект." 
				+ ИмяТаблицыРаспределения, КолонкаТаблицы.Заголовок, Истина);
			МассивРеквизитов.Добавить(НоваяКолонка);
			СписокЭлементовДляДобавления.Добавить(КолонкаТаблицы.Имя, КолонкаТаблицы.Заголовок);
			
		КонецЦикла;
		
		МассивТиповЧисло = Новый Массив;
		МассивТиповЧисло.Добавить(Тип("Число"));
		
		Если ТаблицаРаспределения <> "ТрудовыеРесурсы" Тогда 
			Точность = 3;
		Иначе
			Точность = 2;
		КонецЕсли;
		
		КЧ = Новый КвалификаторыЧисла(15, Точность);
		ОписаниеТиповКоличество = Новый ОписаниеТипов(МассивТиповЧисло, , , КЧ);
		
		КЧ = Новый КвалификаторыЧисла(15, 2);
		ОписаниеТиповСумма = Новый ОписаниеТипов(МассивТиповЧисло, , , КЧ);
		
		Для Каждого КолонкаИтогов Из ПараметрыРаспределения.СписокКолонокИтогов Цикл
			
			Если ИмяТаблицыРаспределения <> "ТрудовыеРесурсы" И СтрНайти(КолонкаИтогов.Значение, "Количество") > 0 Тогда
				ОписаниеТиповЧ = ОписаниеТиповКоличество;
			Иначе
				ОписаниеТиповЧ = ОписаниеТиповСумма;
			КонецЕсли;
			
			НоваяКолонкаИтогов = Новый РеквизитФормы(КолонкаИтогов.Значение, ОписаниеТиповЧ, , Истина);
			МассивРеквизитов.Добавить(НоваяКолонкаИтогов);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов,МассивРеквизитовНаУдаление);	
	
	Для Каждого ЭлементНаУдаление Из СписокЭлементовДляУдаления Цикл
		
		Элементы.Удалить(ЭлементНаУдаление.Значение);
		
	КонецЦикла;
	
	Если НеобходимоСоздатьДопКолонки Тогда
		Если ПараметрыРаспределения.РаспределятьКоличество Тогда
			
			Если  ИмяТаблицыРаспределения = "РаспределениеОбъемов" Тогда
				ЭлементВладелец = Элементы.РаспределениеОбъемов;
			ИначеЕсли ИмяТаблицыРаспределения = "ТрудовыеРесурсы" Тогда
				ЭлементВладелец = Элементы.ТрудовыеРесурсы;
			Иначе
				ЭлементВладелец = Элементы.РаспределениеПотребностей;
			КонецЕсли;
			
			Для Каждого ЭлементСпискаПериодов Из ПараметрыРаспределения.СписокПериодов Цикл
				
				НоваяГруппа = Элементы.Добавить("Группа_" + ИмяТаблицыРаспределения + "_" 
					+ Формат(ЭлементСпискаПериодов.Значение, "ДФ=MM_yyyy"), Тип("ГруппаФормы"), ЭлементВладелец);
				НоваяГруппа.Вид = ВидГруппыФормы.ГруппаКолонок;
				НоваяГруппа.Группировка =  ГруппировкаКолонок.Горизонтальная;
				НоваяГруппа.ОтображатьВШапке = Истина;
				НоваяГруппа.Заголовок=Формат(ЭлементСпискаПериодов.Значение, "ДФ='MMMM yyyy'");
				
				ИмяКолонкиКоличество = "Количество_" + ИмяТаблицыРаспределения + "_"
					+ Формат(ЭлементСпискаПериодов.Значение, "ДФ=MM_yyyy");
				
				НоваяКолонкаЭлемент = ЭтаФорма.Элементы.Добавить(ИмяКолонкиКоличество, Тип("ПолеФормы"), НоваяГруппа);			
				НоваяКолонкаЭлемент.ПутьКДанным = "Объект." + ИмяТаблицыРаспределения + "." + ИмяКолонкиКоличество;
				НоваяКолонкаЭлемент.Доступность = Истина;
				НоваяКолонкаЭлемент.Заголовок = "Количество";
				НоваяКолонкаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НоваяКолонкаЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;		 
				НоваяКолонкаЭлемент.ПутьКДаннымПодвала = "Всего_" + ИмяКолонкиКоличество;
				НоваяКолонкаЭлемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
				
				Если ИмяТаблицыРаспределения = "РаспределениеОбъемов" Тогда
					
					ИмяОбработчика1 = "Подключаемый_РаспределениеДоходовПоМесяцамКоличествоПриИзменении";
					ИмяОбработчика2 = "Подключаемый_РаспределениеДоходовПоМесяцамСуммаПриИзменении";
					
				ИначеЕсли ИмяТаблицыРаспределения = "ТрудовыеРесурсы" Тогда
					
					ИмяОбработчика1 = "Подключаемый_РаспределениеТрудовыхРесурсовПоМесяцамКоличествоПриИзменении";
					
				Иначе
					
					ИмяОбработчика1 = "Подключаемый_РаспределениеРасходовПоМесяцамКоличествоПриИзменении";
					ИмяОбработчика2 = "Подключаемый_РаспределениеРасходовПоМесяцамСуммаПриИзменении";      
					
				КонецЕсли;
			
				НоваяКолонкаЭлемент.УстановитьДействие("ПриИзменении", ИмяОбработчика1);
				
				Если ИмяТаблицыРаспределения <> "ТрудовыеРесурсы" Тогда

					ИмяКолонкиСумма = "Сумма_" + ИмяТаблицыРаспределения + "_"
						+ Формат(ЭлементСпискаПериодов.Значение, "ДФ=MM_yyyy");
					
					НоваяКолонкаЭлемент = ЭтаФорма.Элементы.Добавить(ИмяКолонкиСумма, Тип("ПолеФормы"), НоваяГруппа);			
					НоваяКолонкаЭлемент.ПутьКДанным = "Объект." + ИмяТаблицыРаспределения + "." + ИмяКолонкиСумма;
					НоваяКолонкаЭлемент.Доступность = Истина;
					НоваяКолонкаЭлемент.Заголовок = "Сумма";
					НоваяКолонкаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
					НоваяКолонкаЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;		 
					НоваяКолонкаЭлемент.ПутьКДаннымПодвала = "Всего_" + ИмяКолонкиСумма;
					НоваяКолонкаЭлемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
									
					НоваяКолонкаЭлемент.УстановитьДействие("ПриИзменении", ИмяОбработчика2);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе	 		 
			
			Если ИмяТаблицыРаспределения = "РаспределениеДоходов" Тогда
				ЭлементВладелец = Элементы.РаспределениеДоходов;
			ИначеЕсли ИмяТаблицыРаспределения = "ТрудовыеРесурсы" Тогда
				ЭлементВладелец = Элементы.СтраницаТрудовыеРесурсы;
			ИначеЕсли ИмяТаблицыРаспределения = "РаспределениеДополнительныхЗатрат" Тогда
				ЭлементВладелец = Элементы.РаспределениеДополнительныхЗатрат;	
			Иначе
				ЭлементВладелец = Элементы.РаспределениеРасходов;			
			КонецЕсли;
			
			Для Каждого ЭлементСпискаПериодов Из ПараметрыРаспределения.СписокПериодов Цикл
				
				ИмяКолонкиСумма = "Сумма_" + ИмяТаблицыРаспределения + "_"
					+ Формат(ЭлементСпискаПериодов.Значение, "ДФ=MM_yyyy");
				
				НоваяКолонкаЭлемент = ЭтаФорма.Элементы.Добавить(ИмяКолонкиСумма, Тип("ПолеФормы"), ЭлементВладелец);			
				НоваяКолонкаЭлемент.ПутьКДанным = "Объект." + ИмяТаблицыРаспределения + "." + ИмяКолонкиСумма;
				НоваяКолонкаЭлемент.Доступность = Истина;
				НоваяКолонкаЭлемент.Заголовок = Формат(ЭлементСпискаПериодов.Значение, "ДФ='MMMM yyyy'");
				НоваяКолонкаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НоваяКолонкаЭлемент.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;		 
				
				НоваяКолонкаЭлемент.ПутьКДаннымПодвала = "Всего_" + ИмяКолонкиСумма;
				НоваяКолонкаЭлемент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
			
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого СтрокаРаспределения Из Объект[ИмяТаблицыРаспределения] Цикл
			
			НайденнаяСтрока = ТаблицаРаспределения.Найти(СтрокаРаспределения.ИндексСтрокРаспределенияПоПериодам,
				"ИндексСтрокРаспределенияПоПериодам");
			
			Если НайденнаяСтрока <> Неопределено Тогда 
				
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденнаяСтрока);
				
			КонецЕсли;		 
			
		КонецЦикла;
		
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", истина);
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ВыделятьОтрицательные", Истина);
		
		НовыйЭлементУООтбор = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТаблицыРаспределения 
			+ ".СпособПривязки");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлементУООтбор.ПравоеЗначение = Перечисления.упоСпособПривязкиРаспределения.Вручную;
		
		Для Каждого НоваяКолонка Из СписокЭлементовДляДобавления Цикл
			
			НовоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(НоваяКолонка.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборРаспределения(ВыбранноеЗначение, КолонкаИндекса)
	
	ТаблицаРаспределенная = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТР);
	
	МассивСтрокНаУдаление = Новый Массив;
	
	Для Каждого СтрокаТР Из Объект.РаспределениеДоходовПоПериодам Цикл
		
		Если СтрокаТР[КолонкаИндекса] <> Неопределено Тогда
			
			МассивСтрокНаУдаление.Добавить(СтрокаТР);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаНаУдаление Из МассивСтрокНаУдаление Цикл
		
		Объект.РаспределениеДоходовПоПериодам.Удалить(Объект.РаспределениеДоходовПоПериодам.Индекс(СтрокаНаУдаление));
		
	КонецЦикла;
	
	Для Каждого ВыбраннаяСтрока Из ТаблицаРаспределенная Цикл
		
		НоваяСтрока =  Объект.РаспределениеДоходовПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыбраннаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РаспределениеОбъемовЗаполнитьКоличествоСуммуСервер()
	
	Для Каждого СтрокаОбъемы Из Объект.Субпродукты Цикл
		
		СуммаОбщая = СтрокаОбъемы.ОбщСтоимость;
		КоличествоОбщее = СтрокаОбъемы.Количество;
		
		ОтборСтрокРаспределения = Новый Структура;
		ОтборСтрокРаспределения.Вставить("ИндексСтрокиВладельца", СтрокаОбъемы.ИндексСтрокРаспределения);
		
		НайденныеСтроки = Объект.РаспределениеОбъемов.НайтиСтроки(ОтборСтрокРаспределения);
		КоличествоНайденных = НайденныеСтроки.Количество();
		
		Счетчик = 1;
		
		РаспределенноеКолво = 0;
		РаспределеннаяСумма = 0;
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если Счетчик = КоличествоНайденных Тогда
				
				НайденнаяСтрока.Количество =  КоличествоОбщее - РаспределенноеКолво;
				НайденнаяСтрока.Сумма =  СуммаОбщая - РаспределеннаяСумма;
				
			Иначе
				
				НайденнаяСтрока.Количество =  КоличествоОбщее/КоличествоНайденных;
				НайденнаяСтрока.Сумма =  СуммаОбщая/КоличествоНайденных;
				РаспределенноеКолво = РаспределенноеКолво +  НайденнаяСтрока.Количество;
				РаспределеннаяСумма = РаспределеннаяСумма +  НайденнаяСтрока.Сумма;
				
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспределениеОбъемовПоРолямСервер()
	
	Объект.РаспределениеОбъемов.Очистить();
	ЗначенияПроектаПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);
	
	КопияРолей = Объект.ТрудовыеРесурсы.Выгрузить();
	Счетчик = 0;
	
	Если КопияРолей.Количество() > 0 Тогда
		
		Для Каждого СтрокаОбъемов Из Объект.Субпродукты Цикл
			
			СтрокаОбъемов.ИндексСтрокРаспределения = Счетчик;
			
			Для Каждого СтрокаРоли Из КопияРолей Цикл
				
				НоваяСтрока = Объект.РаспределениеОбъемов.Добавить();
				НоваяСтрока.ИндексСтрокиВладельца = Счетчик;
				НоваяСтрока.Роль =  СтрокаРоли.Ресурс;
				НоваяСтрока.Подразделение =  СтрокаРоли.Подразделение;
				НоваяСтрока.СобствСилы_Субподряд =  СтрокаРоли.Ресурс.СобствСилы_Субподряд;
				НоваяСтрока.Количество = СтрокаРоли.Количество;
				НоваяСтрока.Сумма =  СтрокаРоли.ОбщВнешняяСтоимость;
				
			КонецЦикла;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьСтрокуВладельцаВРаспределение(Команда)
			
	ИмяКоманды = Команда.Имя;
	
	ДополнительныеПараметрыОбработкиФормы = 
		упоАналитикаПоПодразделениямКлиентСервер.ПараметрыОбработкиДанныхРаспределения(Ложь);
	ДополнительныеПараметрыОбработкиФормы.Вставить("ИспользоватьАналитикуКонтрагентДляСС", 
													ИспользоватьАналитикуКонтрагентДляСС);
	ПараметрыКопирования = упоРаботаСФормамиКлиент.КопироватьСтрокуВладельцаВРаспределение(Объект, 
																		ЭтаФорма, 
																		ИмяКоманды, 
																		ДополнительныеПараметрыОбработкиФормы);
		
	ПроверятьИсточникПлана = Истина;	
	Если ПараметрыКопирования.ТаблицаВладелец = "Субпродукты" Или ПараметрыКопирования.ТаблицаВладелец = "ТрудовыеРесурсы" Тогда
		ПроверятьИсточникПлана = Ложь;
	КонецЕсли;	
		
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, 
																		ЭтаФорма, 
																		ПараметрыКопирования.ТаблицаПодчиненная, 
																		, 
																		ПараметрыКопирования.КопироватьКоличество, 
																		ПроверятьИсточникПлана);
			
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовЗаполнитьПоРолям(Команда)
	
	Если Объект.РаспределениеОбъемов.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("РаспределениеОбъемовЗаполнитьПоРолямЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения,"Табличная часть 'Распределение объемов' уже содержит данные. Очистить?",
			РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);		
		
	Иначе
		
		РаспределениеОбъемовЗаполнитьПоРолямЗавершение("БезОтвета",Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовЗаполнитьСССП(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовЗаполнитьКоличествоСумму(Команда)
	
	РаспределениеОбъемовЗаполнитьКоличествоСуммуСервер();
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Субпродукты",
		"РаспределениеОбъемов", "ОбщСтоимость", Истина);		
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеОбъемовЗаполнитьПоРолямЗавершение(ОтветПользователя,ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя = КодВозвратаДиалога.Да
		Или ОтветПользователя = "БезОтвета" Тогда
		ЗаполнитьРаспределениеОбъемовПоРолямСервер();
	КонецЕсли;
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Субпродукты",
	"РаспределениеОбъемов", "ОбщСтоимость", Истина);			
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Субпродукты",
	"РаспределениеОбъемов", "ОбщСтоимость");
	
КонецПроцедуры

&НаКлиенте	
Процедура УстановитьОграничениеТиповМатериальныеРесурсы()
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	ОписаниеТиповМатериальныеРесурсы = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.МатериальныеРесурсыРесурс.ОграничениеТипа  = ОписаниеТиповМатериальныеРесурсы;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТолькоПросмотрВалюте(имяТаблицы, естьДоговор = Неопределено)
	
	текДанные = Элементы[имяТаблицы].ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если естьДоговор = Неопределено Тогда
		естьДоговор = ЗначениеЗаполнено(текДанные.Договор);
	КонецЕсли;
	
	Элементы[имяТаблицы+"Валюта"].ТолькоПросмотр = естьДоговор;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормыСервер(ПервыйЗапуск = Истина)
	
	мВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;	
	
	КалендарьДляСверки = Константы.упоРабочийКалендарьПоУмолчанию.Получить();	
	
	ИнициализацияФормыСерверEPM();
	
	// Проектная продукция.
	
	ДоступенФункционалПроектнаяПродукция = упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция();
	
	упоРаботаСФормамиСервер.ЗаполнитьРеквизитыТипПродукта(Объект.ТипСубпродукта, ЭтотОбъект.ТипПродуктаЧисло);
	упоРаботаСФормамиКлиентСервер.НастроитьСубпродуктыНаФормеПоТипуСубпродукта(Элементы, 
		Объект.ТипСубпродукта);

КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормыСерверEPM()
	
	Если НЕ упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат;
	КонецЕсли;			
	
	Элементы.МатериальныеРесурсыСвязьСЗаказом.Видимость = Истина;
	Элементы.СубпродуктыСвязьСЗаказом.Видимость = Истина;	
		
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияФормыКлиент(ПриОткрытии = Ложь)
	
	Если ДоступенФункционалПроектнаяПродукция Тогда
		ДозаполнитьТЧСубпродукты();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДатуВыпускаПланВыпуска(ТекСтрока = Неопределено)
	
	СтруктураСроки  = упоПроектыИЗадачиОбщие.СтруктураСроки(Объект.ДатаНачалаПлан, Объект.ДатаЗавершенияПлан);
	
	Если ТекСтрока = Неопределено Тогда
		Для каждого лСтрока Из Объект.Субпродукты Цикл
			упоУправлениеФормамиКлиент.ОбновитьДатуВыпускаПланаВыпускаВСтроке(СтруктураСроки, Проект, лСтрока);
		КонецЦикла;
	Иначе
		упоУправлениеФормамиКлиент.ОбновитьДатуВыпускаПланаВыпускаВСтроке(СтруктураСроки, Проект, ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьИтогПоФинПланам(ЭтаФорма)
	
	ЭтаФорма.ИтогоДоходы = ЭтаФорма.Объект.ПланДоходов.Итог("Сумма");
	ЭтаФорма.ИтогоРасходы = ЭтаФорма.Объект.ПланРасходов.Итог("Сумма");
	
	Если ЭтаФорма.Объект.ВключитьСубпродуктыВПланДоходов Тогда
		ЭтаФорма.ИтогоДоходы = ЭтаФорма.ИтогоДоходы + ЭтаФорма.Объект.Субпродукты.Итог("ОбщСтоимость");
	КонецЕсли;
	Если ЭтаФорма.Объект.ВключитьМатРесурсыВПланРасходов Тогда
		ЭтаФорма.ИтогоРасходы = ЭтаФорма.ИтогоРасходы + ЭтаФорма.Объект.МатериальныеРесурсы.Итог("ОбщСтоимость");
	КонецЕсли;
	Если Ложь И ЭтаФорма.Объект.ВключитьТрудРесурсыВПланРасходов Тогда // Пока что данный функционал не запущен 
		ЭтаФорма.ИтогоРасходы = ЭтаФорма.ИтогоРасходы + ЭтаФорма.Объект.ТрудовыеРесурсы.Итог("ОбщСтоимость");
	КонецЕсли;
	
	ИтогоВыплаты = 0;
	ИтогоПоступления = 0;
	
	Для каждого СтрокаДДС Из ЭтаФорма.Объект.ДвиженияДенежныхСредств Цикл
		Если СтрокаДДС.НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата") Тогда
			ЭтаФорма.ИтогоВыплаты = ЭтаФорма.ИтогоВыплаты + СтрокаДДС.Сумма;
		ИначеЕсли СтрокаДДС.НаправлениеДвижения = 
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление") Тогда
			ЭтаФорма.ИтогоПоступления = ЭтаФорма.ИтогоПоступления + СтрокаДДС.Сумма;
		КонецЕсли; 
	КонецЦикла; 
	
	ЭтаФорма.ИтогоРасходы = ЭтаФорма.ИтогоРасходы * - 1;
	ЭтаФорма.ИтогоВыплаты = ЭтаФорма.ИтогоВыплаты * - 1;
	
	ЭтаФорма.ИтогоБДР = ЭтаФорма.ИтогоДоходы + ЭтаФорма.ИтогоРасходы;
	ЭтаФорма.ИтогоБДДС = ЭтаФорма.ИтогоПоступления + ЭтаФорма.ИтогоВыплаты;
	
	ЭтаФорма.ИтогоРазностьДоходы = ЭтаФорма.ИтогоДоходы - ЭтаФорма.ИтогоПоступления;
	ЭтаФорма.ИтогоРазностьРасходы = ЭтаФорма.ИтогоРасходы - ЭтаФорма.ИтогоВыплаты;
	ЭтаФорма.ИтогоРазностьБДР = ЭтаФорма.ИтогоБДР - ЭтаФорма.ИтогоБДДС;
	
	ЭтаФорма.ИтогоРазностьПоступления = ЭтаФорма.ИтогоПоступления - ЭтаФорма.ИтогоДоходы;
	ЭтаФорма.ИтогоРазностьВыплаты = ЭтаФорма.ИтогоВыплаты - ЭтаФорма.ИтогоРасходы;
	ЭтаФорма.ИтогоРазностьБДДС = ЭтаФорма.ИтогоБДДС - ЭтаФорма.ИтогоБДР;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ)
	
	ПараметрыПодбораСтруктура= Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных = ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	ПараметрыПодбораСтруктура.СвойстваОбъекта.Вставить("Проект", Проект);
	
	Если ИмяТЧ = "ДвиженияДенежныхСредств" Тогда
		
		Если Элементы.ДДС_ПараметрыПодбора_НаправлениеПоступление.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"),"НаправлениеДвижения");
			
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_НаправлениеВыплата.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата"), "НаправлениеДвижения");
			
		КонецЕсли;
		
		Если Элементы.ДДС_ПараметрыПодбора_ПривязкаКНачалу.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоЗадачи"),"СпособПривязки");
			
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_ПривязкаКЗавершению.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеЗадачи"), "СпособПривязки");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("СтруктураСтрокиТЧ", Новый Структура);
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураСтрокиТЧ, ИмяТЧ);
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	ДопПараметры.СтруктураОбъекта.Вставить("ЭтоШаблон", Истина);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииСроков()
	
	Новый_ПриИзмененииДаты_Клиент("ДатаЗавершенияПлан");
	УстановитьДоступностьСроков();
	
КонецПроцедуры

&НаКлиенте
Функция Новый_ПриИзмененииДаты_Клиент(ИзмениласьДата) 
	
	Если НЕ Объект.РучнойВводСроков Тогда
		ВызватьИсключение НСтр("ru = 'Изменение сроков вручную возможно только в режиме ручного ввода сроков.'");
	КонецЕсли;
	
	Новый_ПриИзмененииДаты(ИзмениласьДата);
	
	Если ИзмениласьДата = "ДатаНачалаПлан" Тогда
		
		Новый_ОбновитьДатуЗавершения();
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Новый_ПриИзмененииДаты(ИзмениласьДата)
	
	Если ИзмениласьДата <> "ДатаЗавершенияПлан" И ИзмениласьДата <> "ДатаНачалаПлан" Тогда
		Возврат;
	КонецЕсли;
	
	КалендарьДляПересчета = ПолучитьКалендарьЗадачи();
	
	Если ИзмениласьДата = "ДатаНачалаПлан" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПлан) Тогда
			Объект.ДатаНачалаПлан = ТекущаяДата();
		КонецЕсли;
		Объект.ДатаНачалаПлан = НачалоДня(Объект.ДатаНачалаПлан);	
		
		Если Объект.ЭтоВеха Тогда
			Объект.ДатаЗавершенияПлан = Объект.ДатаНачалаПлан;	
			Возврат;
		КонецЕсли;	
		
		ДлительностьДляПересчета = ПолучитьДлительностьВЧасах();
		
		Объект.ДатаЗавершенияПлан = ДобавитьЧасыКДате(Объект.ДатаНачалаПлан, ДлительностьДляПересчета, 
												КалендарьДляПересчета, Объект.ДлительностьБезУчетаКалендаряПроекта); 
					
	Иначе
			
		Если Не ЗначениеЗаполнено(Объект.ДатаЗавершенияПлан) Тогда
			Объект.ДатаЗавершенияПлан = Объект.ДатаНачалаПлан;
		КонецЕсли;	
		
		Если Объект.ДатаНачалаПлан > Объект.ДатаЗавершенияПлан Тогда
			Объект.ДатаНачалаПлан = Объект.ДатаЗавершенияПлан;	
		КонецЕсли;
		
		Если Объект.ЭтоВеха Тогда
			Объект.ДатаНачалаПлан = Объект.ДатаЗавершенияПлан;	
			Возврат;
		КонецЕсли;
			
		Объект.ДатаНачалаПлан = НачалоДня(Объект.ДатаНачалаПлан);
		
		Объект.ДатаЗавершенияПлан = КалендарныйКонецДня(НачалоДня(Объект.ДатаЗавершенияПлан), 
												КалендарьДляПересчета, Объект.ДлительностьБезУчетаКалендаряПроекта);
										
		Новый_ПодсчитатьДлительность();								
			
	КонецЕсли;
					
КонецПроцедуры

&НаКлиенте
Процедура Новый_ПодсчитатьДлительность()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаПлан) И НЕ ЗначениеЗаполнено(Объект.ДатаЗавершенияПлан) Тогда
		Объект.ДлительностьМоделиПакетаРабот = 0;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаПлан) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаЗавершенияПлан) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка расчета длительности задачи.'"));
		Возврат;	
	КонецЕсли;
		
	Если Объект.ДлительностьБезУчетаКалендаряПроекта Тогда
		Объект.ДлительностьМоделиПакетаРабот = ПересчитатьЕдВремениИзЧасов(
			(КонецДня(Объект.ДатаЗавершенияПлан) - НачалоДня(Объект.ДатаНачалаПлан)) / 3600, 
			Объект.ЕдиницаНормированияДлительности); 
	Иначе
		КалендарьДляПересчета = ПолучитьКалендарьЗадачи();
		Ответ = КоличествоРабочихДнейИЧасовВПериоде(КалендарьДляПересчета, Объект.ДатаНачалаПлан, Объект.ДатаЗавершенияПлан);
		Объект.ДлительностьМоделиПакетаРабот = ПересчитатьЕдВремениИзЧасов(Ответ.КоличествоЧасов,
																			Объект.ЕдиницаНормированияДлительности);
	КонецЕсли;
																		
КонецПроцедуры

&НаКлиенте
Процедура Новый_ОбновитьДатуЗавершения()
	
	ДлительностьДляПересчета = ПолучитьДлительностьВЧасах();	
	КалендарьДляПересчета = ПолучитьКалендарьЗадачи();
			
	Если Объект.ДлительностьБезУчетаКалендаряПроекта Тогда
		ДатаЗавершения = Объект.ДатаНачалаПлан + ДлительностьДляПересчета * 3600;;
	Иначе
		ДатаЗавершения = ДобавитьЧасыКДате(Объект.ДатаНачалаПлан, ДлительностьДляПересчета, 
														КалендарьДляПересчета, Объект.ДлительностьБезУчетаКалендаряПроекта); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция Новый_ПриИзмененииДлительности_Клиент() 
	
	Новый_ПриИзмененииДлительности();
	Новый_ОбновитьДатуЗавершения();
	
КонецФункции

&НаКлиенте
Процедура Новый_ПриИзмененииДлительности()
	
	Если Объект.ЭтоВеха Тогда
		Объект.ДлительностьМоделиПакетаРабот = 0;
		Объект.ДатаЗавершенияПлан = Объект.ДатаНачалаПлан;
		Возврат;
	КонецЕсли;
	
	Если Объект.ДлительностьМоделиПакетаРабот <= 0 Тогда
		Объект.ДлительностьМоделиПакетаРабот = 1;
	КонецЕсли;
		
	ДлительностьВЧасах = ПолучитьДлительностьВЧасах();
	КалендарьДляПересчета = ПолучитьКалендарьЗадачи();
							
	ДатаОшибки = Неопределено;
	ОшибкиИПредупреждения = Неопределено;
	
	Объект.ДатаЗавершенияПлан = ДобавитьЧасыКДате(Объект.ДатаНачалаПлан, 
						ДлительностьВЧасах, КалендарьДляПересчета, Объект.ДлительностьБезУчетаКалендаряПроекта);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКалендарьЗадачи() 
	
	Если ЗначениеЗаполнено(Объект.КалендарьЗадачи) Тогда
		КалендарьЗадачи = Объект.КалендарьЗадачи;	
	Иначе		
		КалендарьЗадачи = КалендарьДляСверки;
	КонецЕсли;
	
	Возврат КалендарьЗадачи;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДлительностьВЧасах() 

	Возврат ПересчитьЕдВремениВЧасы(Объект.ДлительностьМоделиПакетаРабот,
						?(Не ЗначениеЗаполнено(Объект.ЕдиницаНормированияДлительности),
						упоПроектыИЗадачиОбщие.ЕдИзмеренияПоУмолчанию(ЭтаФорма, Истина),
						Объект.ЕдиницаНормированияДлительности));	
	
КонецФункции
					
&НаСервереБезКонтекста
Функция ПересчитьЕдВремениВЧасы(Знач Значение, Знач ЕдВремени) 
	
	Возврат упоРабочиеКалендариВызовСервера.обПересчитатьЕдВремениВЧасы(Значение, ЕдВремени);	
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьЧасыКДате(Знач Дата, Знач Длительность, Знач КалендарьДляПересчета, Знач ДлительностьБезУчетаКалендаряПроекта) 
	
	ДатаОшибки = Неопределено;
	ОшибкиИПредупреждения = Неопределено;
	
	НоваяДата = упоРасчетКалендарныхСроковРедакция3Сервер.ДобавитьЧасыКДате(Дата, Длительность,
			, КалендарьДляПересчета, ДатаОшибки, Истина, ДлительностьБезУчетаКалендаряПроекта, ОшибкиИПредупреждения);

	 Если ОшибкиИПредупреждения <> Неопределено Тогда
		Для Каждого СтрокаОшибки Из ОшибкиИПредупреждения Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки.ТекстОшибки);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НоваяДата;
	
КонецФункции

&НаСервереБезКонтекста
Функция КалендарныйКонецДня(Знач Дата, Знач КалендарьДляПересчета, Знач ДлительностьБезУчетаКалендаряПроекта) 
	
	ДатаОшибки = Неопределено;
	ОшибкиИПредупреждения = Неопределено;

	Если Не ЗначениеЗаполнено(Дата) Тогда
		
		НоваяДата = Дата;
		
	ИначеЕсли ДлительностьБезУчетаКалендаряПроекта Тогда
		
		НоваяДата = КонецДня(Дата);
		
	Иначе
	
	 	НоваяДата = упоРасчетКалендарныхСроковРедакция3Сервер.КалендарныйКонецДня(
								НачалоДня(Дата), , КалендарьДляПересчета, ДатаОшибки, ОшибкиИПредупреждения);
								
	КонецЕсли;

	 Если ОшибкиИПредупреждения <> Неопределено Тогда
		Для Каждого СтрокаОшибки Из ОшибкиИПредупреждения Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки.ТекстОшибки);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НоваяДата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПересчитатьЕдВремениИзЧасов(Знач Часы, Знач ЕдиницаНормированияДлительности) 
	
	Возврат упоРабочиеКалендариВызовСервера.обПересчитатьЕдВремениИзЧасов(
			Часы, 
			ЕдиницаНормированияДлительности); 
	
КонецФункции

&НаСервереБезКонтекста
Функция КоличествоРабочихДнейИЧасовВПериоде(Знач КалендарьДляПересчета, Знач ДатаНачала, Знач ДатаЗавершения) 
	
	Возврат упоРабочиеКалендариВызовСервера.обКоличествоРабочихДнейИЧасовВПериоде(КалендарьДляПересчета, ДатаНачала, ДатаЗавершения);	
	
КонецФункции

&НаКлиенте
Процедура Новый_ЗаполнитьДлительностьПоПлануРолей()
	
	Если Объект.ЭтоВеха Тогда
		Возврат;
	КонецЕсли;
	
	КоэффициентыЕдИзмеренияВремени = ПолучитьКоэффициентыЕдИзмеренияВремени();
	
	МаксимальнаяДлительность = 0;
	
	Для Каждого СтрокаТЧ Из Объект.ТрудовыеРесурсы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаНормирования) Тогда
			Продолжить;
		КонецЕсли;
		
		Коэффициент = КоэффициентыЕдИзмеренияВремени.Получить(СтрокаТЧ.ЕдиницаНормирования);
		
		ДлительностьСтроки = СтрокаТЧ.Количество * Коэффициент;
		
		Если ДлительностьСтроки > МаксимальнаяДлительность Тогда
			МаксимальнаяДлительность = ДлительностьСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МаксимальнаяДлительность) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ЕдиницаНормированияДлительности) Тогда
			Объект.ЕдиницаНормированияДлительности = упоПроектыИЗадачиОбщие.ЕдИзмеренияПоУмолчанию(ЭтаФорма, Истина);		
		КонецЕсли;
		
		Объект.ДлительностьМоделиПакетаРабот = ПересчитатьЕдВремениИзЧасов(МаксимальнаяДлительность, Объект.ЕдиницаНормированияДлительности); 
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Ошибка расчета длительности по плану трудозатрат.'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕдиницуНормированияСтрокиТабЧасти(СтрокаТабличнойЧасти)

	ЕдиницаНормирования  = упоУправлениеФормамиСервер.ПолучитьЕдиницуИзмТЧ(СтрокаТабличнойЧасти.Ресурс);
	
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаНормирования) <> ТипЗнч(ЕдиницаНормирования) Тогда
		СтрокаТабличнойЧасти.ЕдиницаНормирования =  ЕдиницаНормирования;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентыЕдИзмеренияВремени()
	
	Результат = Новый Соответствие;
	
	Выборка = Справочники.упоЕдиницыВремени.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Выборка.Коэффициент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Выполняет действия при подборе - заполняет строку дополнительными данными.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура  - строка данных.
//  ПараметрыПодбора	 - Структура, Неопределено - параметры подбора.
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	ПараметрыПодбораФормы = Неопределено;
	
	Если ПараметрыПодбора.Свойство("ЭтоСубпродукты") И СтрокаТабличнойЧасти.Свойство("ПрофильРаспределения")
		И Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ПрофильРаспределения) Тогда 
		СтрокаТабличнойЧасти.ПрофильРаспределения = ПрофильДоходовПоУмолчанию();
	КонецЕсли;

	упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодбореВПроектнойЗадаче(СтрокаТабличнойЧасти, 
		ПараметрыПодбора, ПараметрыПодбораФормы);
		
	Если ПараметрыПодбора.Свойство("МассивРаспределенияОбъемов") И
		упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(СтрокаТабличнойЧасти.Ресурс) Тогда
		ПересчитатьИтогиПоТаблицеПП(); 
	КонецЕсли;

	Если ТипЗнч(ПараметрыПодбора) = Тип("Структура") Тогда
		Если ПараметрыПодбора.Свойство("ДобавлениеПредшественника") Тогда
			СтрокаТабличнойЧасти.ТипСвязи = ПредопределенноеЗначение("Перечисление.упоТипСвязи.ОкончаниеНачало");
			СтрокаТабличнойЧасти.ЕдиницаНормированияДлительности = ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.Час");
		ИначеЕсли ПараметрыПодбора.Свойство("ТрудовыеРесурсы") Тогда
			СтрокаТабличнойЧасти.Количество = 1;
			СтрокаТабличнойЧасти.ЕдиницаНормирования = ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.Час");
			СтрокаТабличнойЧасти.Подразделение = упоУправлениеФормамиСервер.ПолучитьПодразделениеРолиВызовСервера(СтрокаТабличнойЧасти.Ресурс);
		ИначеЕсли ПараметрыПодбора.Свойство("МатериальныеРесурсы") Тогда
			СтрокаТабличнойЧасти.Количество = 1;
			ЗаполнитьЕдиницуНормированияСтрокиТабЧасти(СтрокаТабличнойЧасти);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

&НаКлиенте
Процедура ТаблицаТрудовыеРесурсыСпособПривязкиПриИзменении(Элемент)
	
	ТекущиеДанныеТР = Элементы.ТрудовыеРесурсы.ТекущиеДанные;
	
	Если ТекущиеДанныеТР = Неопределено Тогда 
		Возврат;
	КонецЕсли;
			
	ИндексСтрокРаспределенияПоПериодамДляУдаления = Неопределено;
	
	СпособПривязкиРаспределенияВручную = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную");
	Если ТекущиеДанныеТР.СпособПривязки = СпособПривязкиРаспределенияВручную
		И ТекущиеДанныеТР.ИндексСтрокРаспределенияПоПериодам = Неопределено Тогда
		
		ТекущиеДанныеТР.ИндексСтрокРаспределенияПоПериодам =
			упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(
					Объект.ТрудовыеРесурсы, "ИндексСтрокРаспределенияПоПериодам");
		
	ИначеЕсли ТекущиеДанныеТР.СпособПривязки <> СпособПривязкиРаспределенияВручную Тогда
		
		ИндексСтрокРаспределенияПоПериодамДляУдаления = ТекущиеДанныеТР.ИндексСтрокРаспределенияПоПериодам;
		
		ТекущиеДанныеТР.ИндексСтрокРаспределенияПоПериодам = Неопределено;
		
		ОбнулитьКоличествоИСуммуРучногоРаспределенияТрудовыхРесурсовЗаПериод(ТекущиеДанныеТР);
		
	КонецЕсли;
			
	Если ИндексСтрокРаспределенияПоПериодамДляУдаления <> Неопределено Тогда
		СтруктураОтбора = Новый Структура("ИндексСтрокиРаспределениеПоРолям", ИндексСтрокРаспределенияПоПериодамДляУдаления);
		ИскомыеСтроки = Объект.ТрудовыеРесурсыПоПериодам.НайтиСтроки(СтруктураОтбора);
		Для каждого НайденнаяСтрока Из ИскомыеСтроки Цикл
			Объект.ТрудовыеРесурсыПоПериодам.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;			
	
	СоздатьДопЭлементыРаспределенияДоходов(Ложь, Ложь, Ложь, Ложь, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьКоличествоИСуммуРучногоРаспределенияТрудовыхРесурсовЗаПериод(ТекСтрока)
	
	ТаблицаРаспределения = "ТрудовыеРесурсы";
	
	ПрограммноСозданныеЭлементы = 
		упоРаботаСФормамиКлиентСервер.ПолучитьЭлементыРаспределенияПоПериодам(ЭтаФорма, ТаблицаРаспределения);		
	Для каждого ЭлементСпискаПрограммно Из ПрограммноСозданныеЭлементы Цикл
		
		ПериодЗашифрованный = упоРаботаСФормамиКлиентСервер.ПолучитьЗашифрованныйПериод(ЭлементСпискаПрограммно.Имя);			 
		
		ИмяКолонкиКоличество = "Количество_" + ТаблицаРаспределения + "_" + Формат(ПериодЗашифрованный, "ДФ=MM_yyyy");				
		ТекСтрока[ИмяКолонкиКоличество] = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Таблица_ПриИзмененииОбщСтоимости(СтрокаТабличнойЧасти, ИмяКолонкиСтоимость)
	
	ИмяКолонкиОбщСтоимость = "Общ" + ИмяКолонкиСтоимость;
	упоРаботаСФормамиКлиент.ПриИзмененииОбщейСтоимостиТабЧасти(СтрокаТабличнойЧасти, ИмяКолонкиСтоимость, ИмяКолонкиОбщСтоимость);
	
	ПроверитьИсправитьОбщСтоимость(СтрокаТабличнойЧасти, ИмяКолонкиСтоимость);
		      	
КонецПроцедуры
  
// Корректировка общей стоимости для устранения погрешности округления.
&НаКлиенте
Процедура ПроверитьИсправитьОбщСтоимость(СтрокаТабличнойЧасти, ИмяКолонкиСтоимость = "Стоимость") 
	
	ИмяКолонкиОбщСтоимость = "Общ" + ИмяКолонкиСтоимость;
	
	ИсходнаяСтоимость = СтрокаТабличнойЧасти[ИмяКолонкиОбщСтоимость];
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти, 
														, 
														ИмяКолонкиСтоимость, 
														ИмяКолонкиОбщСтоимость);	
	
	Если Не ИсходнаяСтоимость = СтрокаТабличнойЧасти[ИмяКолонкиОбщСтоимость] Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке %1 скорректирована общая %2стоимость ресурсов с %3 до %4.'"),
		СтрокаТабличнойЧасти.НомерСтроки, 
		?(ИмяКолонкиСтоимость = "Стоимость", "", НСтр("ru = 'внешняя '")),
		ИсходнаяСтоимость, 
		СтрокаТабличнойЧасти[ИмяКолонкиОбщСтоимость]);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);					
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СубпродуктыРесурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОпцииВыбора = упоРаботаСФормамиКлиент.КонструкторОпцииВыборПроектнойПродукции(, , Истина);

	упоРаботаСФормамиКлиент.УстановитьПараметрыВыбораРесурсаСубпродуктов(Элемент, 
		Объект.ТипСубпродукта, ОпцииВыбора);

КонецПроцедуры

#КонецОбласти

#Область ПроектнаяПродукция

&НаКлиенте
Процедура ЗаполнитьКоэффициентСложностиДляРолей(ТаблицаРоли, СтрокаВладелец, ОбщийКоэффициент)
	
	Если Не ЗначениеЗаполнено(ТаблицаРоли) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаРоли Цикл
		Если Строка.ИндексСтрокиВладельца <> СтрокаВладелец.ИндексСтрокРаспределения Тогда
			Продолжить;
		КонецЕсли;
		Строка.КоэффициентСложности = ОбщийКоэффициент;
	КонецЦикла;
		
КонецПроцедуры //

&НаКлиенте
Процедура РассчитатьТрудоемкостьРаспределенияОбъемов(ДанныеРаспределения)
	
	ДанныеРаспределения.Трудоемкость = ДанныеРаспределения.Нормирование * ДанныеРаспределения.КоэффициентСложности 
		* (ДанныеРаспределения.ПроцентРаспределения / 100);
	
КонецПроцедуры // 

&НаКлиенте
Процедура ПересчитатьИтогКолонкиРаспределения(Форма,
										   ЭлементВладелец,
										   ЭлементПодчиненный, 
										   ИмяКолонкиСумма)
	Если ИмяКолонкиСумма = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяКолонкиСумма = "КоэффициентСложности" Тогда
		ПересчитатьИтогКоэффициентСложности();
		Возврат;
	КонецЕсли;
										   
	ИтоговаяСумма = 0;
	РаспределенноеКоличество = 0;
	
	ТекущиеДанныеВладельца = Форма.Элементы[ЭлементВладелец].ТекущиеДанные;
	
	Если ТекущиеДанныеВладельца <> Неопределено Тогда
			
		ТаблицаПодчиненная = Форма.Объект[ЭлементПодчиненный];
		
		Для Каждого ЭлементРаспределения Из ТаблицаПодчиненная Цикл
			
			Если ЭлементРаспределения.ИндексСтрокиВладельца = ТекущиеДанныеВладельца.ИндексСтрокРаспределения Тогда
				ИтоговаяСумма = ИтоговаяСумма + ЭлементРаспределения[ИмяКолонкиСумма];
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
	ЭтотОбъект["ИтогРаспределенияПП_" + ИмяКолонкиСумма] =  Формат(ИтоговаяСумма, "ЧДЦ=2");

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогКоэффициентСложности()
	
	СуммаНормирование = ЭтотОбъект.ИтогРаспределенияПП_Нормирование;
	СуммаТрудоемкость = ЭтотОбъект.ИтогРаспределенияПП_Трудоемкость;	
	
	Если СуммаНормирование <> 0 Тогда
		ЭтотОбъект.ИтогРаспределенияПП_КоэффициентСложности = СуммаТрудоемкость / СуммаНормирование;
	Иначе
		ЭтотОбъект.ИтогРаспределенияПП_КоэффициентСложности = 0;
	КонецЕсли;

КонецПроцедуры //

&НаКлиенте
Процедура ПриИзмененииРаспределениеОбъемовКоэффициентСложности()
	
	ТекущиеДанныеРаспределения = ЭтотОбъект.Элементы["РаспределениеОбъемов"].ТекущиеДанные;
	Если ТекущиеДанныеРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеВладельца = ЭтотОбъект.Элементы["Субпродукты"].ТекущиеДанные;
	Если ТекущиеДанныеВладельца = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеРаспределения.Трудоемкость = ТекущиеДанныеВладельца.Нормирование * ТекущиеДанныеРаспределения.КоэффициентСложности * (ТекущиеДанныеРаспределения.ПроцентРаспределения/100);
	
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Трудоемкость");
	ТекущиеДанныеВладельца.Трудоемкость = ЭтотОбъект.ИтогРаспределенияПП_Трудоемкость;
	
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "КоэффициентСложности");
	ТекущиеДанныеВладельца.КоэффициентСложности = ЭтотОбъект.ИтогРаспределенияПП_КоэффициентСложности;
	
КонецПроцедуры //

&НаКлиенте
Процедура ПриИзмененииРаспределениеОбъемовТрудоемкость()
	
	Если Не ДоступенФункционалПроектнаяПродукция Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеРаспределения = ЭтотОбъект.Элементы["РаспределениеОбъемов"].ТекущиеДанные;
	Если ТекущиеДанныеРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеВладельца = ЭтотОбъект.Элементы["Субпродукты"].ТекущиеДанные;
	Если ТекущиеДанныеВладельца = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Трудоемкость");
	ТекущиеДанныеВладельца.Трудоемкость = ИтогРаспределенияПП_Трудоемкость;
	Если ТекущиеДанныеРаспределения.ПроцентРаспределения = 0 Или ТекущиеДанныеВладельца.Нормирование = 0 Тогда
		ТекущиеДанныеРаспределения.КоэффициентСложности = 1;
	Иначе
		ТекущиеДанныеРаспределения.КоэффициентСложности = 
			ТекущиеДанныеРаспределения.Трудоемкость / ТекущиеДанныеВладельца.Нормирование / 
				(ТекущиеДанныеРаспределения.ПроцентРаспределения/100);
	КонецЕсли;			
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "КоэффициентСложности");
	ТекущиеДанныеВладельца.КоэффициентСложности = ИтогРаспределенияПП_КоэффициентСложности;
	
КонецПроцедуры //

&НаКлиенте
Процедура ПриИзмененииРаспределениеОбъемовПроцентТрудоемкости()
	 
	ТекущиеДанныеРаспределения = ЭтотОбъект.Элементы["РаспределениеОбъемов"].ТекущиеДанные;
	Если ТекущиеДанныеРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеВладельца = ЭтотОбъект.Элементы["Субпродукты"].ТекущиеДанные;
	Если ТекущиеДанныеВладельца = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеРаспределения.Количество = ТекущиеДанныеВладельца.Количество * (ТекущиеДанныеРаспределения.ПроцентРаспределения / 100);
	ТекущиеДанныеРаспределения.Нормирование = ТекущиеДанныеВладельца.Нормирование * (ТекущиеДанныеРаспределения.ПроцентРаспределения / 100);
	ТекущиеДанныеРаспределения.Трудоемкость = ТекущиеДанныеВладельца.Нормирование * ТекущиеДанныеРаспределения.КоэффициентСложности * (ТекущиеДанныеРаспределения.ПроцентРаспределения/100);
	ТекущиеДанныеРаспределения.Сумма = ТекущиеДанныеРаспределения.Количество * ТекущиеДанныеВладельца.Стоимость;
	
	
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "ПроцентРаспределения");
	Разница = 100 - ЭтотОбъект.ИтогРаспределенияПП_ПроцентРаспределения;
	
	Если Разница <> 0 Тогда
		
		ПараметрыОтбора = Новый Структура("ИндексСтрокиВладельца", ТекущиеДанныеВладельца.ИндексСтрокРаспределения); 
		ЗаписиРаспределения = ЭтотОбъект.Объект["РаспределениеОбъемов"].НайтиСтроки(ПараметрыОтбора);
		КоличествоЗаписей = ЗаписиРаспределения.Количество();
		ПоследняяСтрока = ЗаписиРаспределения[КоличествоЗаписей - 1];
		ПоследняяСтрока.ПроцентРаспределения = ПоследняяСтрока.ПроцентРаспределения + Разница;
		
		ПоследняяСтрока.Количество = ТекущиеДанныеВладельца.Количество * (ПоследняяСтрока.ПроцентРаспределения / 100);
		ПоследняяСтрока.Нормирование = ТекущиеДанныеВладельца.Нормирование * (ПоследняяСтрока.ПроцентРаспределения / 100);
		ПоследняяСтрока.Трудоемкость = ТекущиеДанныеВладельца.Нормирование * ПоследняяСтрока.КоэффициентСложности * (ПоследняяСтрока.ПроцентРаспределения/100);
		ПоследняяСтрока.Сумма = ПоследняяСтрока.Количество * ТекущиеДанныеВладельца.Стоимость;
		
	КонецЕсли; 
	
	ПересчитатьИтогиКолонокПП();
	ТекущиеДанныеВладельца.Трудоемкость = ИтогРаспределенияПП_Трудоемкость;
	ТекущиеДанныеВладельца.КоэффициентСложности = ИтогРаспределенияПП_КоэффициентСложности;
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиКолонокПП()
	
	Если Не ДоступенФункционалПроектнаяПродукция Тогда
		Возврат;
	КонецЕсли;
	
	СписокКолонкоПП = Новый Массив;
	СписокКолонкоПП.Добавить("Нормирование");
	СписокКолонкоПП.Добавить("Трудоемкость");
	СписокКолонкоПП.Добавить("ПроцентРаспределения");
	СписокКолонкоПП.Добавить("КоэффициентСложности");
	
	Для Каждого КолонкаПП Из СписокКолонкоПП Цикл
		ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", КолонкаПП);
	КонецЦикла;

КонецПроцедуры //

&НаКлиенте
Функция ВключенПереключательПроектнаяПродукция()
	
	Возврат ТипПродуктаЧисло = 1;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииКоличестваПроектногоПродукта(СтрокаТабличнойЧасти)

	ИмяПодчиненнойТаблицы = "РаспределениеОбъемов"; 
	КоличествоВладелец = СтрокаТабличнойЧасти.Количество;
	
	ТаблицаПодчиненная = ЭтотОбъект.Объект[ИмяПодчиненнойТаблицы];
	
	Для Каждого ПодчиненнаяСтрока Из ТаблицаПодчиненная Цикл
		
		Если ПодчиненнаяСтрока.ИндексСтрокиВладельца = СтрокаТабличнойЧасти.ИндексСтрокРаспределения Тогда
			ПодчиненнаяСтрока.Количество = КоличествоВладелец * (ПодчиненнаяСтрока.ПроцентРаспределения / 100);
		КонецЕсли;

	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура("Ресурс, Количество, Нормирование");
	ЗаполнитьЗначенияСвойств(ДанныеДляЗаполнения, СтрокаТабличнойЧасти);
	РассчитатьНормированиеППНаСервере(ДанныеДляЗаполнения); 
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеДляЗаполнения, "Нормирование"); 
	ПриИзмененииНормированияПроектногоПродукта(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНормированиеППНаСервере(СтрокаТабличнойЧасти)
	
	Если ДоступенФункционалПроектнаяПродукция Тогда
		МодульупоПроектнаяПродукция = ОбщегоНазначения.ОбщийМодуль("упоПроектнаяПродукция");
		МодульупоПроектнаяПродукция.РассчитатьНормированиеПоСтрокеПроектнойПродукции(СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНормированияПроектногоПродукта(СтрокаТабличнойЧасти)
		
	ЗаполнитьНормированиеПодчиненныхРолей(ЭтотОбъект.Объект["РаспределениеОбъемов"], СтрокаТабличнойЧасти, СтрокаТабличнойЧасти.Нормирование);
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Нормирование");
	
	Для Каждого СтрокаРоли Из ЭтотОбъект.Объект["РаспределениеОбъемов"] Цикл
		Если СтрокаРоли.ИндексСтрокиВладельца <> СтрокаТабличнойЧасти.ИндексСтрокРаспределения Тогда
			Продолжить;
		КонецЕсли;	
		СтрокаРоли.Трудоемкость = СтрокаТабличнойЧасти.Нормирование * СтрокаРоли.КоэффициентСложности * (СтрокаРоли.ПроцентРаспределения/100);
	КонецЦикла;
		
	ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Трудоемкость");
	СтрокаТабличнойЧасти.Трудоемкость = ЭтотОбъект.ИтогРаспределенияПП_Трудоемкость;
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиПоТаблицеПП() 
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Субпродукты",
		"РаспределениеОбъемов", "ОбщСтоимость", Истина, Ложь);
	
	ПересчитатьИтогиКолонокПП();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДозаполнитьТЧСубпродукты()
	
	Для каждого Строка Из Объект.Субпродукты Цикл
		
		Если упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Строка.Ресурс) Тогда
			
			Строка.ЭтоПП = Истина;
			Строка.Длительность = Строка.Количество * Строка.СкоростьВыполнения;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНормированиеПодчиненныхРолей(ТаблицаРоли, СтрокаВладелец, ОбщееНормирование)
	
	Если Не ЗначениеЗаполнено(ТаблицаРоли) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаРоли Цикл
		Если Строка.ИндексСтрокиВладельца <> СтрокаВладелец.ИндексСтрокРаспределения Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.Нормирование = ОбщееНормирование * (Строка.ПроцентРаспределения / 100);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СубпродуктыРесурсПриИзмененииНаСервере(СтруктураСтрокиСубпродукты, МассивРаспределенияОбъемов)
	
	СтруктураСтрокиСубпродукты.ЭтоПП = 
		упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(СтруктураСтрокиСубпродукты.Ресурс);
	
	Если СтруктураСтрокиСубпродукты.ЭтоПП Тогда
		
		ПустаяПроектнаяЗадача = ПредопределенноеЗначение("Документ.упоПроектнаяЗадача.ПустаяСсылка");
		
		РеквизитыРесурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураСтрокиСубпродукты.Ресурс, 
			"Шаблон, ПроектнаяЗадача");
		
		Если РеквизитыРесурса.Шаблон = Ложь И Не (РеквизитыРесурса.ПроектнаяЗадача = Объект.Ссылка Или  
			РеквизитыРесурса.ПроектнаяЗадача = ПустаяПроектнаяЗадача) Тогда
			
			СтруктураСтрокиСубпродукты.Ресурс = ПредопределенноеЗначение("Справочник.упоПроектнаяПродукция.ПустаяСсылка");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураСтрокиСубпродукты.Ресурс) Тогда 

			МодульПроектнаяПродукцияВызовСервера = ОбщегоНазначения.ОбщийМодуль("упоПроектнаяПродукцияВызовСервера");
			МодульПроектнаяПродукцияВызовСервера.ЗаполнитьПланВыпускаПоПроектнойПродукции(СтруктураСтрокиСубпродукты,
				МассивРаспределенияОбъемов);
								
		КонецЕсли;
		
	Иначе   
		
		упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтруктураСтрокиСубпродукты,
			Неопределено, Объект.НормаСтоимостиОбъемы);
		
		Если Не ЗначениеЗаполнено(СтруктураСтрокиСубпродукты.ЕдиницаНормирования) Тогда
			ЗаполнитьЕдИзмеренияСубпродуктов(СтруктураСтрокиСубпродукты);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьЕдИзмеренияСубпродуктов(СтруктураСтрокиСубпродукты) 
	
	СтруктураСтрокиСубпродукты.ЕдиницаНормирования = 
		упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры(СтруктураСтрокиСубпродукты.Ресурс);
		
КонецФункции

&НаСервереБезКонтекста
Функция ПрофильДоходовПоУмолчанию()
	
	Возврат Константы.упоПрофильДоходовПоУмолчанию.Получить(); 
		
КонецФункции

&НаКлиенте
Процедура РаспределениеСтоимостиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ПересчитатьТаблицуРаспределенияЗавершение(ДополнительныеПараметры);	
	
	ИмяТаблицыРаспределения = ДополнительныеПараметры.ИмяТаблицыРаспределения;
	
	ПересчитатьИтогиВПодчиненнойТаблице(ДополнительныеПараметры.ИмяТаблицыВладельца, 
		ИмяТаблицыРаспределения, 
		ДополнительныеПараметры.ИмяКолонкиОбщСтоимость, 
		"ИндексСтрокиРаспределениеПоРолям",
		ДополнительныеПараметры.ПересчитыватьКоличество);
		
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТаблицыРаспределения);
	ТекстСообщения = "";
	Для Каждого СтрокаРаспределения Из ДополнительныеПараметры.ТаблицаРаспределения Цикл
		
		Если СтрокаРаспределения.СпособПривязки = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
			ТекстСообщения = НСтр(
				"ru = 'Изменилась стоимость, необходимо пересчитать распределение по периодам в табличной части ""%1"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеТаблицы);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиВПодчиненнойТаблице(ИмяТаблицыВладельца, 
	ИмяТаблицыРаспределения, 
	ИмяКолонкиСумма = "Сумма", 
	ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям",
	ПересчитыватьКоличество = Истина)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма,
		ИмяТаблицыВладельца,
		ИмяТаблицыРаспределения, 
		ИмяКолонкиСумма,
		ПересчитыватьКоличество);
	
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, 
		ЭтаФорма, 
		ИмяТаблицыРаспределения, 
		ИмяТаблицыВладельца,
		ИмяКолонкиИндекса, 
		ПересчитыватьКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРаспределение(Отказ)
	
	 //1. Проверка дублей в таблицах распределения.	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ГруппыРазделов", ПодготовитьСоответствиеЭлементовФормыРазделамПроверки());	
	ДопПараметры.Вставить("ГруппыРазделовКолонкиПоПериодам", ЭтаФорма.СоответствиеРазделовКолонкиПоПериодам);
	ДопПараметры.Вставить("ПредставлениеДляДокумента", Истина);		
	ДопПараметры.Вставить("КолонкаСуммыДДС", "Сумма");
	ДопПараметры.Вставить("ЭтоШаблон", Истина);
	
	упоРаботаСФормамиКлиент.ПроверитьТаблицыНаДубли(Объект, ЭтаФорма, ДопПараметры, Отказ);	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Проверка сумм и количества в таблицах распределения и родительских таблицах.				
	КлючиТаблиц = "ТаблицаВладелец, ТаблицаПодчиненная, ИмяКолонкиВладелец,
		|ИмяКолонкиПодчиненная, ЕстьКоличество, ЕстьИсточникПлана, ПредставлениеТаблицыРаспределения";
	ПараметрыТаблиц = Новый Массив;	
	
	ИмяТЧ = "Субпродукты";
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТЧ);
	ПараметрыТаблиц.Добавить(
		Новый Структура(КлючиТаблиц, ИмяТЧ, "РаспределениеОбъемов", "ОбщСтоимость", "Сумма", Истина, Ложь, 
			ПредставлениеТаблицы));
	
	ИмяТЧ = "МатериальныеРесурсы";
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТЧ);
	ПараметрыТаблиц.Добавить(
		Новый Структура(КлючиТаблиц, ИмяТЧ, "РаспределениеПотребностей", "ОбщСтоимость", "Сумма", Истина, Ложь, 
			ПредставлениеТаблицы));
	
	ИмяТЧ = "ДополнительныеЗатраты";
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТЧ);
	ПараметрыТаблиц.Добавить(
		Новый Структура(КлючиТаблиц, ИмяТЧ, "РаспределениеДополнительныхЗатрат", "Стоимость", "Сумма", Ложь, Ложь, 
			ПредставлениеТаблицы));
	
	ИмяТЧ = "ПланДоходов";
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТЧ);
	ПараметрыТаблиц.Добавить(
		Новый Структура(КлючиТаблиц, ИмяТЧ, "РаспределениеДоходов", "Сумма", "Сумма", Ложь, Истина, 
			ПредставлениеТаблицы));
	
	ИмяТЧ = "ПланРасходов";
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТЧ);
	ПараметрыТаблиц.Добавить(
		Новый Структура(КлючиТаблиц, ИмяТЧ, "РаспределениеРасходов", "Сумма", "Сумма", Ложь, Истина, 
			ПредставлениеТаблицы));
	
	упоАналитикаПоПодразделениямКлиент.ПроверитьРаспределениеПередЗаписью(Объект, ПараметрыТаблиц, Отказ);	

КонецПроцедуры

&НаКлиенте 
Функция ПодготовитьСоответствиеЭлементовФормыРазделамПроверки()
	
	ГруппыРазделов = Новый Структура;
	ГруппыРазделов.Вставить("ГруппаРаспределениеОбъемовПоПодразделениям", "РаспределениеОбъемов");
	ГруппыРазделов.Вставить("ГруппаРаспределениеПотребностей", "РаспределениеПотребностей");
	ГруппыРазделов.Вставить("ГруппаРаспределениеДополнительныхЗатрат", "РаспределениеДополнительныхЗатрат");
	ГруппыРазделов.Вставить("ГруппаДополнительныеЗатратыПоПроектнойЗадаче", "ДополнительныеЗатраты");
	ГруппыРазделов.Вставить("ГруппаРаспределениеПланДоходов", "РаспределениеДоходов");
	ГруппыРазделов.Вставить("ГруппаРаспределениеРасходов", "РаспределениеРасходов");
	ГруппыРазделов.Вставить("МатериальныеРесурсы", "МатериальныеРесурсы");
	ГруппыРазделов.Вставить("Субпродукты", "Субпродукты");
	ГруппыРазделов.Вставить("СтраницаПоступления", "ПланПоступлений");
	ГруппыРазделов.Вставить("СтраницаВыплаты", "ПланВыплат");


	Возврат ГруппыРазделов;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеТаблиц(Отказ)
		
	ПроверитьЗаполнение_МатериальныеРесурсы(Отказ);
	ПроверитьЗаполнение_Субпродукты(Отказ);
	ПроверитьЗаполнение_ПланРасходов(Отказ);
	ПроверитьЗаполнение_ПланДоходов(Отказ);
	ПроверитьЗаполнение_ДопЗатраты(Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнение_ПланДоходов(Отказ)
	
	ИмяТаблицы 			= "ПланДоходов";                                                
		
	ЕстьТаблицаРаспределения 			= Элементы.РамкаГруппыРаспределениеПоПодразделениям.Видимость;
	ЕстьОбъемыВРаспределенииРасходов 	= Ложь;
	Если ЕстьТаблицаРаспределения Тогда
		ЕстьОбъемыВРаспределенииДоходов	= Элементы.РаспределениеДоходовГруппаОбъемыПоПодразделениям.Видимость;	                                             
	Иначе
		ЕстьОбъемыВРаспределенииДоходов = Ложь;
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ПроверитьЗаполнениеОсновнойИСвязаннойТаблиц(ЭтотОбъект, 
						                                                ИмяТаблицы, 
																		ЕстьТаблицаРаспределения, 
																		Отказ,
																		Истина,
																		ЕстьОбъемыВРаспределенииДоходов, 
																		ЕстьОбъемыВРаспределенииРасходов);
						
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьЗаполнение_МатериальныеРесурсы(Отказ)
	
	ИмяТаблицы 			= "МатериальныеРесурсы";
	
	ЕстьТаблицаРаспределения 			= Элементы.ГруппаРаспределениеПотребностей.Видимость;
	ЕстьОбъемыВРаспределенииРасходов 	= Ложь;
	ЕстьОбъемыВРаспределенииДоходов		= Ложь;
	
	упоРаботаСФормамиКлиент.ПроверитьЗаполнениеОсновнойИСвязаннойТаблиц(ЭтотОбъект, 
		ИмяТаблицы, 
		ЕстьТаблицаРаспределения, 
		Отказ,
		Истина,
		ЕстьОбъемыВРаспределенииДоходов, 
		ЕстьОбъемыВРаспределенииРасходов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнение_Субпродукты(Отказ)
	
	ИмяТаблицы = "Субпродукты";
	
	ЕстьТаблицаРаспределения = Элементы.ГруппаРаспределениеОбъемовПоПодразделениям.Видимость;
	ЕстьОбъемыВРаспределенииРасходов = Ложь;
	ЕстьОбъемыВРаспределенииДоходов = Ложь;
	
	упоРаботаСФормамиКлиент.ПроверитьЗаполнениеОсновнойИСвязаннойТаблиц(ЭтотОбъект,
		ИмяТаблицы,
		ЕстьТаблицаРаспределения,
		Отказ,
		Истина,
		ЕстьОбъемыВРаспределенииДоходов,
		ЕстьОбъемыВРаспределенииРасходов);
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() И Объект.ТранслироватьЗатратыПоСубпродуктам Тогда
		МодульПроектнаяПродукцияВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("упоПроектнаяПродукцияВызовСервера");
		МодульПроектнаяПродукцияВызовСервера.ПроверитьЗаполнениеРаспределенияПроектнойПродукцииПередТрансляцией(Объект.Субпродукты,
			Объект.РаспределениеОбъемов, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнение_ДопЗатраты(Отказ)
	
	ИмяТаблицы 			= "ДополнительныеЗатраты";
	
	ЕстьТаблицаРаспределения 			= Элементы.ГруппаРаспределениеДополнительныхЗатрат.Видимость;
	ЕстьОбъемыВРаспределенииРасходов 	= Ложь;
	ЕстьОбъемыВРаспределенииДоходов		= Ложь;
	
	упоРаботаСФормамиКлиент.ПроверитьЗаполнениеОсновнойИСвязаннойТаблиц(ЭтотОбъект, 
		ИмяТаблицы, 
		ЕстьТаблицаРаспределения, 
		Отказ,
		Истина,
		ЕстьОбъемыВРаспределенииДоходов, 
		ЕстьОбъемыВРаспределенииРасходов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнение_ПланРасходов(Отказ)
	
	ИмяТаблицы 			= "ПланРасходов";
	
	ЕстьТаблицаРаспределения 			= Элементы.ГруппаРаспределениеРасходов.Видимость;		
	Если ЕстьТаблицаРаспределения Тогда
		ЕстьОбъемыВРаспределенииРасходов = Элементы.РаспределениеРасходовГруппаОбъемыПоПодразделениям.Видимость;
	Иначе	
		ЕстьОбъемыВРаспределенииРасходов = Ложь;
    КонецЕсли;                                            
	ЕстьОбъемыВРаспределенииДоходов		= Ложь;
	
	упоРаботаСФормамиКлиент.ПроверитьЗаполнениеОсновнойИСвязаннойТаблиц(ЭтотОбъект, 
						                                                ИмяТаблицы, 
																		ЕстьТаблицаРаспределения, 
																		Отказ,
																		Истина,
																		ЕстьОбъемыВРаспределенииДоходов, 
																		ЕстьОбъемыВРаспределенииРасходов);
																		
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиПоИмениКоманды(ИмяКоманды)
	
	УчитыватьКоличество = Ложь;
	Если ИмяКоманды = "РаспределитьПоПериодамПланДоходов" Тогда
		ИмяОсновнойТаблицы = "ПланДоходов"; 
		ИмяТаблицыРаспределения = "РаспределениеДоходов";
	ИначеЕсли ИмяКоманды = "РаспределитьПоПериодамПланРасходов" Тогда
		ИмяОсновнойТаблицы = "ПланРасходов";
		ИмяТаблицыРаспределения = "РаспределениеРасходов";
	ИначеЕсли ИмяКоманды = "РаспределитьПоПериодамСубпродукты" Тогда
		ИмяОсновнойТаблицы = "Субпродукты";
		ИмяТаблицыРаспределения = "РаспределениеОбъемов";
		УчитыватьКоличество = Истина;
	ИначеЕсли ИмяКоманды = "РаспределитьПоПериодамМатРесурсы" Тогда
		ИмяОсновнойТаблицы = "МатериальныеРесурсы";
		ИмяТаблицыРаспределения = "РаспределениеПотребностей";
		УчитыватьКоличество = Истина;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяОсновнойТаблицы", 		ИмяОсновнойТаблицы);
	Результат.Вставить("ИмяТаблицыРаспределения", 	ИмяТаблицыРаспределения);	
	Результат.Вставить("УчитыватьКоличество", 		УчитыватьКоличество);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РаспределениеСтоимостиПП_Завершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	СуммаКРаспределению = ДополнительныеПараметры.СуммаКРаспределению;
	ТекущиеДанныеПП = ДополнительныеПараметры.ТекущиеДанныеПП;
	ТаблицаРаспределения = Объект.РаспределениеОбъемов;
	
	упоРаботаСФормамиКлиент.ПересчитатьДлительностьПоПроектнойПродукции(ТекущиеДанныеПП);
	ПриИзмененииКоличестваПроектногоПродукта(ТекущиеДанныеПП);

	РаспределенныеСуммы = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКРаспределению, 
																ДополнительныеПараметры.КоэффициентыКРаспределению);
																
	Счетчик = 0;
	
	Для Каждого ПодчиненнаяСтрока Из ТаблицаРаспределения Цикл
		Если ПодчиненнаяСтрока.ИндексСтрокиВладельца = ТекущиеДанныеПП.ИндексСтрокРаспределения Тогда
			
			Если СуммаКРаспределению = 0 Тогда
				ПодчиненнаяСтрока.Сумма = 0;
			Иначе
				ПодчиненнаяСтрока.Сумма = РаспределенныеСуммы[Счетчик];	
			КонецЕсли;
			Счетчик = Счетчик + 1;
			
		КонецЕсли;
	КонецЦикла;
											
	упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, "РаспределениеОбъемов", 
		"Субпродукты", "ИндексСтрокиРаспределениеПоРолям", Истина);
	
	ПересчитатьИтогиВПодчиненнойТаблице("Субпродукты", 
		"РаспределениеОбъемов", 
		"ОбщСтоимость", 
		"ИндексСтрокиРаспределениеПоРолям",
		Истина);
		
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи("РаспределениеОбъемов");
	ТекстСообщения = "";
	Для Каждого СтрокаРаспределения Из ТаблицаРаспределения Цикл
		
		Если СтрокаРаспределения.СпособПривязки = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
			ТекстСообщения = НСтр(
				"ru = 'Изменилась стоимость, необходимо пересчитать распределение по периодам в табличной части ""%1"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеТаблицы);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИтоговРаспределенияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ИтогиПересчитаны") И ДополнительныеПараметры.ИтогиПересчитаны Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыТаблицы = ДополнительныеПараметры.ПараметрыТекТаблицы;
	
	ИмяТаблицыВладельца = упоПроектыИЗадачиОбщие.ИмяТаблицыВладельцаПоИмениПодчиненной(
		ПараметрыТаблицы.ТаблицаРаспределения);
			
	Если Не ЗначениеЗаполнено(ИмяТаблицыВладельца) Или ИмяТаблицыВладельца = "ДополнительныеЗатраты" 		
		Или ИмяТаблицыВладельца = "ПланДоходов" Или ИмяТаблицыВладельца = "ПланРасходов" Тогда
		Возврат;
	КонецЕсли;	

	ПересчитатьИтогиВПодчиненнойТаблице(ИмяТаблицыВладельца, 
		ПараметрыТаблицы.ТаблицаРаспределения, 
		"ОбщСтоимость", 
		"ИндексСтрокиРаспределениеПоРолям",
		Истина);
	
	ЭтоПП = Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
	Если ИмяТаблицыВладельца = "Субпродукты" И ЭтоПП Тогда		
		ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Нормирование");
	    ПересчитатьИтогКолонкиРаспределения(ЭтаФорма, "Субпродукты", "РаспределениеОбъемов", "Трудоемкость");
	КонецЕсли;
			
	ДополнительныеПараметры.Вставить("ИтогиПересчитаны", Истина);

КонецПроцедуры

#КонецОбласти
