
&Вместо("ПолучитьСведенияОПоказателяхОтчета")
Функция Расш1_ПолучитьСведенияОПоказателяхОтчета(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета)
	
	ПоказателиОтчета = Новый Структура;
	
	Если ИДОтчета = "ИКТ_РегламентированныйОтчетБухОтчетность" Тогда
		ЗаполнениеБухгалтерскойОтчетности.ПолучитьСведенияОПоказателяхОтчетаБухОтчетность(ИДРедакцииОтчета, ПоказателиОтчета, ПараметрыОтчета);
		Возврат ПоказателиОтчета;
	КонецЕсли;
	
	Результат = ПродолжитьВызов(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета);
	Возврат Результат;
	
КонецФункции

&Вместо("ЗаполнитьОтчет")
Процедура Расш1_ЗаполнитьОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер)
	
	Если ИДОтчета = "ИКТ_РегламентированныйОтчетБухОтчетность" Тогда
		
		///ИТК Ал_ 15.01.2025
		
		//ЗаполнениеБухгалтерскойОтчетности.ЗаполнитьБухотчетность(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
		
		//для списка оргнаизаций ИспользуетсяНастраиваемаяОтчетность, даже для разных ИНН
		Если ИКТ_ИспользуетсяНастраиваемаяОтчетность(ПараметрыОтчета) Тогда
			НастраиваемаяБухгалтерскаяОтчетность.ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1(ПараметрыОтчета, Контейнер);
		Иначе
			ЗаполнениеБухгалтерскойОтчетностиОсновная.ЗаполнитьОтчетБухОтчетностьФормаОтчета2019Кв1(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	
		///Ал__ 15.01.2025		
	Иначе
		ПродолжитьВызов(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
	КонецЕсли;
	
КонецПроцедуры

//см. НастраиваемаяБухгалтерскаяОтчетность.ИспользуетсяНастраиваемаяОтчетность(ПараметрыОтчета)
Функция ИКТ_ИспользуетсяНастраиваемаяОтчетность(ПараметрыОтчета) Экспорт
	
	ПолныйСписокОрганизаций = Новый Массив;
	Если ПараметрыОтчета.Свойство("ДатаКонцаПериодаОтчета") Тогда
		ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	Иначе
		ДатаКонцаПериодаОтчета = ПараметрыОтчета.мДатаКонцаПериодаОтчета;
	КонецЕсли;
	
	ДоступныеОрганизации = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	
	ОсновнаяОрганизация = ПараметрыОтчета.Организация;
	
	Если ДоступныеОрганизации.Найти(ОсновнаяОрганизация) <> Неопределено Тогда
		ПолныйСписокОрганизаций.Добавить(ОсновнаяОрганизация);
	КонецЕсли;
	
	ПараметрыУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитикНаДату("УчетнаяПолитикаБухУчета",
		ОсновнаяОрганизация,
		ДатаКонцаПериодаОтчета);
	
	Если ПараметрыУчетнойПолитики <> Неопределено И ЗначениеЗаполнено(ПараметрыУчетнойПолитики.НастройкаЗаполненияБухОтчетности)
		И ПараметрыУчетнойПолитики.НастройкаЗаполненияБухОтчетности <> Справочники.НастройкиЗаполненияБухОтчетности.НеНастраивается Тогда
		
		Если ТипЗнч(ПараметрыОтчета) = Тип("Структура") Тогда
			ПараметрыОтчета.Вставить("НастройкаЗаполненияБухОтчетности", ПараметрыУчетнойПолитики.НастройкаЗаполненияБухОтчетности);
		КонецЕсли;
				
		// Для списка организаций с разными ИНН заполнение отчетности с использованием настроек недоступно
		Если ПараметрыОтчета.Свойство("ГруппаОрганизаций") И ПараметрыОтчета.ГруппаОрганизаций.Количество()>0 Тогда
			Для Каждого Организация Из ПараметрыОтчета.ГруппаОрганизаций Цикл
				Если ДоступныеОрганизации.Найти(Организация.Значение) <> Неопределено Тогда
					ПолныйСписокОрганизаций.Добавить(Организация.Значение);
				КонецЕсли;
			КонецЦикла;
			
			Возврат Истина;
			
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = "ВЫБРАТЬ
	//		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Организации.ИНН) КАК КоличествоИНН
	//		|ИЗ
	//		|	Справочник.Организации КАК Организации
	//		|ГДЕ
	//		|	Организации.Ссылка В (&Ссылки)";
	//		Запрос.УстановитьПараметр("Ссылки", ПолныйСписокОрганизаций);
	//
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		ВыборкаДетальныеЗаписи.Следующий();
	//		Если ВыборкаДетальныеЗаписи.КоличествоИНН>1 Тогда
	//			Возврат Ложь;
	//		Иначе 
	//			Возврат Истина;
	//		КонецЕсли;
		Иначе 
			Возврат Истина;
		КонецЕсли;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции