
#Область СлужебныйПрограммныйИнтерфейс

// См. упоИнтеграция.ДоступнаСистемаЛицензирования() 
//
Функция ДоступнаСистемаЛицензирования() Экспорт
		
	Возврат упоИнтеграция.ДоступнаСистемаЛицензирования();
	
КонецФункции

 // Возвращает объекты контура PM, для которых включается дата запрета изменения.
// Используются для отключения режима даты запрета изменений "По объектам" в интегрированных конфигурациях, 
// где такой режим может быть настроен.
// 
// Возвращаемое значение:
//  Соответствие - перечень объектов.
//
Функция ОбъектыСКонтролемДатыЗапретаИзменения() Экспорт
	
	ОбъектыPM = Новый Соответствие();
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоРегистрацияФактическихДоходовИРасходов"), 			Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоСинхронизацияФактическихДоходовИРасходов"), 			Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоРегистрацияФактическихДвиженийДенежныхСредств"), 		Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоСинхронизацияФактическихДвиженийДенежныхСредств"), 	Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоРегистрацияФактическиВыполненногоОбъема"), 			Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоРегистрацияФактическихДопЗатрат"), 					Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоРегистрацияФактическихЗатратМатРесурсов"), 			Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоСинхронизацияФактическиВыполненныхОбъемов"), 			Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоРаспределениеРабочегоВремениЗаНеделю"), 				Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоТабельУчетаРабочегоВремени"), 						Истина);
	ОбъектыPM.Вставить(Тип("ДокументОбъект.упоСинхронизацияФактическихТрудозатрат"), 				Истина);
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ОбъектыPM.Вставить(Тип("ДокументОбъект.упоСогласованиеТрудозатрат"), 						Истина);
	КонецЕсли;
	
	Возврат ОбъектыPM;
	
КонецФункции

#КонецОбласти