#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РесурсПодразделения") Тогда
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
		ДатаАктуальности = Неопределено;
		Параметры.Свойство("ДатаАктуальности", ДатаАктуальности);
		
		МассивПодразделений = упоРесурсыИРолиСервер.ПолучитьМассивПодразделенийРоли(Параметры.РесурсПодразделения, 
																					, 
																					ДатаАктуальности);
			
		СписокОтбора = Новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(массивПодразделений);
		
		НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.Использование = Истина;
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");				
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;			
		НовыйЭлемент.ПравоеЗначение = СписокОтбора;
		
	КонецЕсли;
	
	Если Параметры.Свойство("РежимОтображенияТаблицы") Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы[Параметры.РежимОтображенияТаблицы];
	КонецЕсли;
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	упоИнтеграцияВызовСервера.НастроитьОтображениеСпискаПодразделений(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти
