////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с иерархией и полномочиями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПолучениеИнформацииОДиспетчерахИСотрудниках

// Подбирает сотрудника для диспетчера (или наоборот, диспетчера для
//  сотрудника) по совпадающему началу наименования.
//
// Параметры:
//  СписокДляПоиска	 - Массив			 - элементы справочника для поиска.
//  ИмяДляПоиска	 - Строка			 - имя сопоставляемого объекта.
//  НайденныйОбъект	 - СправочникСсылка	 - сопоставленный объект.
// 
// Возвращаемое значение:
//  Булево - флаг успешного сопоставления.
//
Функция ПодобратьДиспетчераПоИмени(СписокДляПоиска, Знач ИмяДляПоиска, НайденныйОбъект = Неопределено) Экспорт
	
	Для Счетчик = 1 По СтрДлина(ИмяДляПоиска) Цикл
		
		Метка = СтрДлина(ИмяДляПоиска) + 1 - Счетчик;					
		ТекИмяПользователя = Лев(ИмяДляПоиска, Метка);
		
		Для каждого СотрудникДляПоиска Из СписокДляПоиска Цикл
			СтрокаДляПоиска = СотрудникДляПоиска.Наименование;
			Если СтрДлина(СтрокаДляПоиска) < СтрДлина(ИмяДляПоиска) Тогда      
				ИмяДляПоиска = Лев(ИмяДляПоиска, СтрДлина(СтрокаДляПоиска));
			КонецЕсли; 
			Если Лев(СтрокаДляПоиска, СтрДлина(ИмяДляПоиска)) = ИмяДляПоиска Тогда      
				НайденныйОбъект = СотрудникДляПоиска;
				Возврат Истина;
			КонецЕсли; 				
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции // упоИерархияИПолномочияВызовСервера.обПодобратьДиспетчераПоИмени()

// Извлекает список сотрудников, представляемых указанным диспетчером в системе.
//  Обновляет связанные параметры сеанса.
//
// Параметры:
//  Диспетчер					 - СправочникСсылка.Пользователи - пользователь-диспетчер.
//  ОбновитьКэшируемыеЗначения	 - Булево						 - признак необходимости обновления связанных параметров сеанса.
//  						Выставляется в Ложь, если список сотрудников получается не для текущего пользователя системы.
// 
// Возвращаемое значение:
//  СписокЗначений - список представляемых диспетчером сотрудников.
//
Функция СотрудникиДиспетчера(Диспетчер, ОбновитьКэшируемыеЗначения = Ложь) Экспорт

	МассивСотрудников = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Диспетчер", Диспетчер);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Диспетчеры.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(, Пользователь = &Диспетчер) КАК Диспетчеры
	               |ГДЕ
	               |	Диспетчеры.ФлагУправления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			МассивСотрудников.Добавить(Выборка.Сотрудник);
		КонецЦикла;
	КонецЕсли;
	
	Если ОбновитьКэшируемыеЗначения Тогда
		ОбновитьПараметрыСеансаПоСотрудникамИРесурсам(МассивСотрудников);
	КонецЕсли;
	
	СписокСотрудников = Новый СписокЗначений();
	СписокСотрудников.ЗагрузитьЗначения(МассивСотрудников);
	
	Возврат СписокСотрудников;
	
КонецФункции

// Проверяет доступность сотрудника для текущего пользователя и если сотрудник доступен, устанавливает его текущим.
//
// Параметры:
//  Сотрудник	 - СправочникСсылка.упоСотрудники	 - выбранный в качестве текущего.
//
Процедура УстановитьДиспетчеруТекущегоСотрудника(Сотрудник = Неопределено) Экспорт

	СписокСотрудников = упоИерархияИПолномочияВызовСервера.обПолучитьСписокСотрудниковДиспетчера(Пользователи.ТекущийПользователь());
		
	Если СписокСотрудников.Количество() = 0 Тогда      
		Возврат;
	КонецЕсли; 
	
	Если Сотрудник = Неопределено Тогда      
		
		// Если сотрудник прямо не указан, попробуем извлечь его из персональной настройки
		// текущего пользователя.
		
		СотрудникНайден = Ложь;
		
		Сотрудник = упоПользователиВызовСервера.обПолучитьНастройкуПользователя("СотрудникПоУмолчанию");
		
		Если НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Сотрудник) Тогда      
			// указанный в настройке сотрудник должен быть в списке доступных
			Если НЕ СписокСотрудников.НайтиПоЗначению(Сотрудник) = Неопределено Тогда      
				СотрудникНайден = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		Если НЕ СотрудникНайден Тогда      
			
			// Если сотрудник не указан и в настройке, можно взять первого попавшегося
			// но мы поступим чуть хитрее и попробуем поискать по наименованию
			// к сожалению, полнотекстовый поиск будет только в следующей жизни.
			
			СотрудникНайден = упоИерархияИПолномочияВызовСервера.обПодобратьДиспетчераПоИмени(СписокСотрудников.ВыгрузитьЗначения(),
				Пользователи.ТекущийПользователь().Наименование, Сотрудник);
			
			Если НЕ СотрудникНайден Тогда      
				Сотрудник = СписокСотрудников.Получить(0).Значение;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если СписокСотрудников.НайтиПоЗначению(Сотрудник) = Неопределено Тогда      
		ПараметрыСеанса.упоТекущийСотрудник = Справочники.упоСотрудники.ПустаяСсылка();
		#Если Клиент Тогда
		УстановитьЗаголовокСистемы(Метаданные.Синоним + " ( <сотрудник для диспетчера не определен> )");
		#КонецЕсли
	Иначе
		ПараметрыСеанса.упоТекущийСотрудник = Сотрудник;
		#Если Клиент Тогда
		УстановитьЗаголовокСистемы(Метаданные.Синоним + " (" + ПараметрыСеанса.упоТекущийСотрудник.Наименование + ")");
		#КонецЕсли
	КонецЕсли; 
	
КонецПроцедуры

// Проверяет, является ли пользователь диспетчером сотрудника.
//
// Параметры:
//  Пользователь		 - СправочникСсылка.Пользователи, Неопределено - пользователь.
//  Сотрудник			 - СправочникСсылка.упоСотрудники, Неопределено - сотрудник.
//  СотрудникиДиспетчера - СписокЗначений Из СправочникСсылка.упоСотрудники, Неопределено - сотрудники диспетчера.
// 
// Возвращаемое значение:
//  Булево
//
Функция ПользовательЯвляетсяДиспетчеромСотрудника(Пользователь = Неопределено, Сотрудник = Неопределено, СотрудникиДиспетчера = Неопределено) Экспорт
	
	Если СотрудникиДиспетчера = Неопределено Тогда
		Если Пользователь = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		мСотрудникиДиспетчера = СотрудникиДиспетчера(Пользователь, Ложь);
	Иначе
		мСотрудникиДиспетчера = СотрудникиДиспетчера;
	КонецЕсли;
	
	Если Сотрудник = Неопределено Тогда
		мСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	Иначе
		мСотрудник = Сотрудник;
	КонецЕсли;
	
	Возврат мСотрудникиДиспетчера.НайтиПоЗначению(мСотрудник) <> Неопределено;
	
КонецФункции

// Проверяет, является ли пользователь диспетчером сотрудника руководителя проекта.
//
// Параметры:
//  Проект		 - СправочникСсылка.Проекты	 - проект.
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - пользователь.
// 
// Возвращаемое значение:
//  Булево
//
Функция ПользовательЯвляетсяРуководителемПроекта(Проект, Пользователь = Неопределено) Экспорт
	
	РуководительПроекта = упоИерархияИПолномочияСервер.ПолучитьРуководителяПроекта(Проект);
	Если Пользователь = Неопределено Тогда
		мПользователь = Пользователи.ТекущийПользователь();
	Иначе
		мПользователь = мПользователь;
	КонецЕсли;
	
	ЭтоРП = упоИерархияИПолномочияСервер.ПользовательЯвляетсяДиспетчеромСотрудника(
		мПользователь, РуководительПроекта);
	
	Возврат ЭтоРП;
	
КонецФункции

#КонецОбласти

#Область ПолучениеИнформацииОМатричнойСтруктуреУправления

// Возвращает соответствие, содержащее всех руководителей данной проектной задачи, включая более верхние уровни.
//
// Параметры:
//  пПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой надо вернуть данные.
// 
// Возвращаемое значение:
//  Соответствие - соответствие, содержащее всех руководителей данной проектной задачи.
//
Функция ПолучитьВсехРуководителейПроектнойЗадачиПоИерархии(пПроектнаяЗадача) Экспорт
	
	соответствиеРуководителей = Новый Соответствие;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РП.РуководительПроекта КАК РП,
		|	Проекты.СтатусПроекта КАК СтатусПроекта
		|ИЗ
		|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, 
		|		Проект = &Проект
		|	) КАК Проекты
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, 
		|		Проект = &Проект
		|	) КАК РП
		|ПО 
		|	Проекты.Проект = РП.Проект";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Проект", пПроектнаяЗадача.Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Завершен Тогда
			Возврат соответствиеРуководителей;
		КонецЕсли;
		соответствиеРуководителей.Вставить(Выборка.РП);
	Иначе
		Возврат соответствиеРуководителей;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Свойства.ЗадачаРодитель КАК ЗадачаРодитель
	               |ПОМЕСТИТЬ Свойства_ВТ
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК Свойства
	               |ГДЕ
	               |	НЕ Свойства.ЗадачаОтменена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Свойства_ВТ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Свойства_ВТ.ЗадачаРодитель КАК ЗадачаРодитель,
	               |	РПЗ.РуководительПроектнойЗадачи КАК РПЗ
	               |ИЗ
	               |	Свойства_ВТ КАК Свойства_ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РПЗ
	               |		ПО Свойства_ВТ.ПроектнаяЗадача = РПЗ.ПроектнаяЗадача";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущаяВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(пПроектнаяЗадача.Проект));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Родители = Новый Соответствие;
	РПЗы = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Родители.Вставить(Выборка.ПроектнаяЗадача, Выборка.ЗадачаРодитель);
		РПЗы.Вставить(Выборка.ПроектнаяЗадача, Выборка.РПЗ);
	КонецЦикла;
	
	ДобавлениеРуководителейПоРодителю(пПроектнаяЗадача.ПроектнаяЗадача, Родители, РПЗы, соответствиеРуководителей);
	
	Возврат соответствиеРуководителей;
	
КонецФункции

// Возвращает соответствие, содержащее всех руководителей данной проектной задачи, включая более верхние уровни.
//
// Параметры:
//  пПроект	 - СправочникСсылка.Проекты	 - Проект, для которого надо вернуть данные.
// 
// Возвращаемое значение:
//  ТаблицаЗначений, Неопределено - таблица значений, содержащая всех руководителей проектных задач
//  	проекта, либо Неопределено, если руководители отсутствуют.
//
Функция ПолучитьРуководителейПроектныхЗадачПроекта(пПроект) Экспорт 
	
	ТаблицаРезультат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упоВерсииПроекта.Версия КАК Версия
	|ПОМЕСТИТЬ ТекущаяВерсияПроекта
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|ГДЕ
	|	упоВерсииПроекта.Проект = &Проект
	|	И упоВерсииПроекта.Текущая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РуководительПроектнойЗадачи
	|ИЗ
	|	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия В
	|					(ВЫБРАТЬ
	|						ТекущаяВерсияПроекта.Версия КАК Версия
	|					ИЗ
	|						ТекущаяВерсияПроекта КАК ТекущаяВерсияПроекта)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ПО упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
	
	Запрос.УстановитьПараметр("Проект", пПроект);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ТаблицаРезультат = Результат.Выгрузить();		
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции 

// Строит полный список подразделений и определяет для каждого из них текущего руководителя.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - подразделения и руководители.
//
Функция ПолучитьФункциональныхРуководителей() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Подразделения.Ссылка КАК Подразделение,
		|	Подразделения.Родитель КАК Родитель,
		|	РуководителиПодразделенийСрезПоследних.Руководитель КАК Руководитель
		|ИЗ
		|	Справочник.упоПодразделения КАК Подразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПодразделений.СрезПоследних КАК РуководителиПодразделенийСрезПоследних
		|		ПО Подразделения.Ссылка = РуководителиПодразделенийСрезПоследних.Подразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	РуководителиПодразделенийСрезПоследних.Руководитель,
		|	Подразделения.Ссылка,
		|	Подразделения.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение ИЕРАРХИЯ";
	
	Результат = Запрос.Выполнить();       	
	ТаблицаДанных = Результат.Выгрузить();	
		
	// Таблица построена (упорядочиванием по иерархии) таким образом,
	// что при проходе строки уже известно, что ее родитель в любом 
	// случае уже был пройден,
	// поэтому сложного обхода таблицы делать не надо, достаточно простого.
	
	Для каждого СтрокаВыборки Из ТаблицаДанных Цикл
		
		
		Если НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаВыборки.Руководитель) Тогда      
			// руководитель был назначен явным образом, оставляем его			
			Продолжить;                                              			
		КонецЕсли; 
		
		// Если руководителя нет, значит, нужно брать того сотрудника,
		// который руководит подразделением-родителем.
		
		СтрокаРодитель = ТаблицаДанных.Найти(СтрокаВыборки.Родитель, "Подразделение");
		Если НЕ СтрокаРодитель = Неопределено Тогда      
			СтрокаВыборки.Руководитель = СтрокаРодитель.Руководитель;
		КонецЕсли; 
		
	КонецЦикла; 
	
    Возврат ТаблицаДанных;
	
КонецФункции

// Возвращает руководителя подразделения, согласно иерархической
//  структуры справочника Подразделения.
//
// Параметры:
//  ВхДанные -  Массив, СправочникСсылка.Подразделения	 - подразделение
//  	(или список подразделений), для которого необходимо определить текущего руководителя.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники, ТаблицаЗначений - найденные руководители.
//
Функция ПолучитьРуководителяПодразделенияПоИерархии(ВхДанные) Экспорт

	// Разбираем входные данные и генерируем структуру выходных
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
		
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда
		
		ЭтоМассив = Истина;		
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			НоваяСтрока = Результат.Добавить();		
			НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();
		КонецЦикла; 
		Результат.ЗагрузитьКолонку(ВхДанные, "Подразделение");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоПодразделения") Тогда
		
		ЭтоМассив = Ложь;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Подразделение = ВхДанные;
		НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	// Получаем полный список руководителей подразделений
	
	ТаблицаРуководителей = упоИерархияИПолномочияВызовСервера.обПолучитьФункциональныхРуководителей();
		
	// И для каждого из заданных подразделений возвращаем руководителя	
	
	Для каждого СтрокаРезультат Из Результат Цикл
		
		СтрокаРуководитель = ТаблицаРуководителей.Найти(СтрокаРезультат.Подразделение, "Подразделение");
		Если НЕ СтрокаРуководитель = Неопределено Тогда      
			СтрокаРезультат.Руководитель = СтрокаРуководитель.Руководитель;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Возвращаем результат в зависимости от типа входных данных
	
	Если ЭтоМассив Тогда      
		Возврат Результат;
	Иначе
		Возврат Результат[0].Руководитель;
	КонецЕсли; 

КонецФункции

// Возвращает список подразделений руководителя (или группы руководителей)
//  исходя из иерархии подразделений.
//
// Параметры:
//  ВхДанные - Массив Из СправочникСсылка.упоСотрудники, СправочникСсылка.упоСотрудники	 - сотрудник/сотрудники
//  	для которого необходимо найти подразделения.
//  ВернутьМассив	 - Булево	 - флаг указывает на необходимость вернуть не дерево значений,
//  	а массив с общим списком найденных проектных задач.
// 
// Возвращаемое значение:
//  Массив, ДеревоЗначений - найденные подразделения.
//
Функция ПолучитьПодразделенияРуководителяПоИерархии(ВхДанные, ВернутьМассив = Ложь) Экспорт

	// Разбираем входные данные и генерируем структуру выходных
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ДеревоЗначений();
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;	
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Строки.Добавить();		
		КонецЦикла; 		
		Результат.Строки.ЗагрузитьКолонку(ВхДанные, "Руководитель");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоСотрудники") Тогда
		
		ЭтоМассив = Ложь;         		
		НоваяСтрока = Результат.Строки.Добавить();
		НоваяСтрока.Руководитель = ВхДанные;
	
	Иначе		
		Возврат Неопределено;
	КонецЕсли; 
	
	// Получаем полный список руководителей подразделений
	
	ТаблицаРуководителей = упоИерархияИПолномочияВызовСервера.обПолучитьФункциональныхРуководителей();
	
	// И для каждого из заданных руководителей строим список подразделений
	
	МассивПодразделений = Новый Массив();
	
	Для каждого СтрокаРезультат Из Результат.Строки Цикл
		
		СтрокиДанных = ТаблицаРуководителей.НайтиСтроки(Новый Структура("Руководитель", СтрокаРезультат.Руководитель));
		Для каждого СтрокаДанных Из СтрокиДанных Цикл
			НоваяСтрока = СтрокаРезультат.Строки.Добавить();
			НоваяСтрока.Руководитель = СтрокаРезультат.Руководитель;
			НоваяСтрока.Подразделение = СтрокаДанных.Подразделение;
			МассивПодразделений.Добавить(СтрокаДанных.Подразделение);
		КонецЦикла; 
		
	КонецЦикла; 

	// Возвращаем результат в зависимости от типа входных данных
	
	Если ЭтоМассив Тогда      
		Если ВернутьМассив Тогда      
			Возврат МассивПодразделений;
		Иначе
			Возврат Результат;
		КонецЕсли; 	
	Иначе
		Возврат Результат.Строки[0].Строки.ВыгрузитьКолонку("Подразделение");
	КонецЕсли; 

КонецФункции

// Возвращает список подразделений руководителя (или группы руководителей),
//  но только тех, для которых руководитель указан напрямую (без учета иерархии).
//
// Параметры:
//  ВхДанные - 	Массив, Справочник.упоСотрудники - сотрудник (или список сотрудников)
//  	для которого необходимо найти подразделения.
// 
// Возвращаемое значение:
//  Массив, ДеревоЗначений - найденные подразделения.
//
Функция ПолучитьПодразделенияРуководителяБезИерархии(ВхДанные) Экспорт

	// разбираем входные данные и генерируем структуру выходных
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ДеревоЗначений();
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;	
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Строки.Добавить();		
		КонецЦикла; 		
		Результат.Строки.ЗагрузитьКолонку(ВхДанные, "Руководитель");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоСотрудники") Тогда
		
		ЭтоМассив = Ложь;         		
		НоваяСтрока = Результат.Строки.Добавить();
		НоваяСтрока.Руководитель = ВхДанные;
	
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
    // извлекаем запросом список подразделений
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	РегФМ.Подразделение,
		|	РегФМ.Руководитель
		|ИЗ
		|	РегистрСведений.упоРуководителиПодразделений.СрезПоследних КАК РегФМ
		|ГДЕ
		|	РегФМ.Руководитель В(&СписокСотрудников)";
	
	Запрос.УстановитьПараметр("СписокСотрудников", ВхДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СтрокаДанных = Результат.Строки.Найти(Выборка.Руководитель, "Руководитель");
		Если НЕ СтрокаДанных = Неопределено Тогда      
			НоваяСтрока = СтрокаДанных.Строки.Добавить();
			НоваяСтрока.Подразделение = Выборка.Подразделение;
		КонецЕсли; 
	
	КонецЦикла;
	
	Если ЭтоМассив Тогда      
		Возврат Результат;
	Иначе
		Возврат Результат.Строки[0].Строки.ВыгрузитьКолонку("Подразделение");
	КонецЕсли; 
	
КонецФункции

// Строит полный список проектных задач по ряду проектов и определяет
//  для каждого из них текущего руководителя с учетом проектной иерархии.
//
// Параметры:
//  СписокПроектов	 - Массив Из СправочникСсылка.Проекты - список проектов, для которых
//  	необходимо найти проектных руководителей.
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - передается в случае,
//  	когда проектная задача проверяется в момент проведения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - проектные задачи и руководители.
//
Функция ПолучитьПроектныхРуководителей(СписокПроектов, ПроектнаяЗадача = Неопределено) Экспорт

	// проверяем, что на вход подали фильтр
	
	Если НЕ ТипЗнч(СписокПроектов) = Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	// Размечаем структуру исходных данных
	
	ТаблицаДанных = Новый ТаблицаЗначений();
	ТаблицаДанных.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	ТаблицаДанных.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	
	// Получаем список проектных задач по всем заданным проектам
	// для того, чтобы не вытаскивать вообще все задачи (их могут быть тысячи)
	// берем только задачи незакрытых проектов.
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВерсииПроекта.Проект КАК Проект,
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ ТекущиеВерсииПроектов
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Текущая
	               |	И упоВерсииПроекта.Проект В(&СписокПроектов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТекущиеВерсииПроектов.Проект КАК Проект,
	               |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Свойства.ЗадачаРодитель КАК ЗадачаРодитель
	               |ПОМЕСТИТЬ СвойстваПроектныхЗадач
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия В
	               |				(ВЫБРАТЬ
	               |					ТекущиеВерсииПроектов.Версия
	               |				ИЗ
	               |					ТекущиеВерсииПроектов)) КАК Свойства
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеВерсииПроектов КАК ТекущиеВерсииПроектов
	               |		ПО Свойства.Версия = ТекущиеВерсииПроектов.Версия
	               |ГДЕ
	               |	НЕ Свойства.ЗадачаОтменена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РПЗ,
	               |	СвойстваПроектныхЗадач.Проект КАК Проект,
	               |	СвойстваПроектныхЗадач.ЗадачаРодитель КАК ЗадачаРодитель
	               |ПОМЕСТИТЬ РуководителиПЗ
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвойстваПроектныхЗадач КАК СвойстваПроектныхЗадач
	               |		ПО упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РП.РуководительПроекта КАК РП,
	               |	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Данные.ЗадачаРодитель КАК ЗадачаРодитель,
	               |	ВЫБОР
	               |		КОГДА Данные.ЗадачаРодитель = &ПустаяЗадача
	               |				ИЛИ Данные.ЗадачаРодитель ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ВерхнийУровень,
	               |	Данные.РПЗ КАК РПЗ
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект В (&СписокПроектов)) КАК Проекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект В (&СписокПроектов)) КАК РП
	               |		ПО Проекты.Проект = РП.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РуководителиПЗ КАК Данные
	               |		ПО Проекты.Проект = Данные.Проект
	               |ГДЕ
	               |	Проекты.СтатусПроекта <> &ПроектЗакрыт";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СписокПроектов", СписокПроектов);
	Запрос.УстановитьПараметр("ПустаяЗадача", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПроектЗакрыт", Перечисления.упоСостояниеСтатусаПроекта.Завершен);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗадач = Результат.Выгрузить();
	
	ТаблицаЗадач.Индексы.Добавить("ЗадачаРодитель");
	ТаблицаЗадач.Индексы.Добавить("ВерхнийУровень");
	
	Если Не ПроектнаяЗадача = Неопределено Тогда
		
		СтрокаЗадача = ТаблицаЗадач.Найти(ПроектнаяЗадача, "ПроектнаяЗадача");
		Если СтрокаЗадача = Неопределено Тогда
			ПЗ_Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроектнаяЗадача, "ЗадачаРодитель, Проект");
			
			СтрокаЗадача = ТаблицаЗадач.Добавить();
			СтрокаЗадача.ПроектнаяЗадача = ПроектнаяЗадача;
			СтрокаЗадача.ЗадачаРодитель = ПЗ_Реквизиты.ЗадачаРодитель;
			СтрокаЗадача.ВерхнийУровень = упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ПЗ_Реквизиты.ЗадачаРодитель);
			СтрокаЗадача.РП = Справочники.Проекты.ПолучитьРуководителя(ПЗ_Реквизиты.Проект);
			СтрокаЗадача.РПЗ = Справочники.упоСотрудники.ПустаяСсылка();
		КонецЕсли; 
		
	КонецЕсли; 
	
	// Делаем такой кунштюк: 
	//  - выбираем сначала проектные задачи самого верхнего уровня
	//  - определяем для них руководителей (прямых или РП)
	//  - для каждой из них выбираем прямых потомков
	//  - и определяем их руководителей (прямых или по наследству)
	//  - и так повторяем до тех пор, пока задачи не закончатся.
	
	ФлагВыхода = Ложь;
	ФлагПервогоПрохода = Истина;
	НовыеЗадачи = Новый СписокЗначений();
	
	Пока НЕ ФлагВыхода Цикл
		
		Если ФлагПервогоПрохода Тогда
			
			// выбираем задачи верхнего уровня
			
			СписокРодителей = ТаблицаЗадач.НайтиСтроки(Новый Структура("ВерхнийУровень", Истина));
			Для каждого СтрокаРодитель Из СписокРодителей Цикл
				ТЗадача = ТаблицаДанных.Добавить();
				ТЗадача.ПроектнаяЗадача = СтрокаРодитель.ПроектнаяЗадача;
				Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаРодитель.РПЗ) Тогда
					ТЗадача.Руководитель = СтрокаРодитель.РП;
				Иначе
					ТЗадача.Руководитель = СтрокаРодитель.РПЗ;
				КонецЕсли; 
				НовыеЗадачи.Добавить(ТЗадача);
			КонецЦикла; 
			
			ФлагПервогоПрохода = Ложь;
			Продолжить;
		КонецЕсли; 
		
		НайденоНовыхЗадач = 0;
		ЗадачиДляПоиска = Новый СписокЗначений();
		ЗадачиДляПоиска.ЗагрузитьЗначения(НовыеЗадачи.ВыгрузитьЗначения());
		НовыеЗадачи.Очистить();
		
		// На каждом проходе дополняем таблицу выходных данных задачами,
		// которые находятся на уровень ниже предыдущей партии.
		
		Для каждого ТекРодитель Из ЗадачиДляПоиска Цикл
			ЗадачиТекРодителя = ТаблицаЗадач.НайтиСтроки(Новый Структура("ЗадачаРодитель", ТекРодитель.Значение.ПроектнаяЗадача));
			Для каждого ЗадачаТекРодителя Из ЗадачиТекРодителя Цикл
				ТЗадача = ТаблицаДанных.Добавить();
				ТЗадача.ПроектнаяЗадача = ЗадачаТекРодителя.ПроектнаяЗадача;
				Если ЗначениеЗаполнено(ЗадачаТекРодителя.РПЗ) Тогда
					ТЗадача.Руководитель = ЗадачаТекРодителя.РПЗ;
				Иначе
					Если ЗначениеЗаполнено(ТекРодитель.Значение.Руководитель) Тогда
						ТЗадача.Руководитель = ТекРодитель.Значение.Руководитель;
					Иначе
						ТЗадача.Руководитель = ЗадачаТекРодителя.РП;
					КонецЕсли;
				КонецЕсли; 
				НовыеЗадачи.Добавить(ТЗадача);
				НайденоНовыхЗадач = НайденоНовыхЗадач + 1;
			КонецЦикла; 
			
		КонецЦикла; 
		
		// Если на проходе не было найдено ни одной новой задачи, это означает,
		// что все задачи из выборки перенесены в таблицу выходных данных
		// и лавочку можно сворачивать.
		
		Если НайденоНовыхЗадач = 0 Тогда
			ФлагВыхода = Истина;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат ТаблицаДанных;	

КонецФункции

// Возвращает руководителя проектной задачи, согласно иерархической структуре проекта.
//
// Параметры:
//  ВхДанные - Массив, ДокументСсылка.упоПроектнаяЗадача - проектная задача
//  (или список задач), для которой необходимо определить
//  текущего руководителя.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники, ТаблицаЗначений - найденные руководители.
//
Функция ПолучитьРуководителяПроектнойЗадачиПоИерархии(ВхДанные) Экспорт

	// Разбираем входные данные и генерируем структуру выходных.
	ЭтоМассив = Неопределено;
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
		
    Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		ЭтоМассив = Истина;
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Добавить();
		КонецЦикла; 		
		Результат.ЗагрузитьКолонку(ВхДанные, "ПроектнаяЗадача");
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ЭтоМассив = Ложь;
	Иначе
		Возврат Неопределено;		
	КонецЕсли; 
	
	// Прежде, чем вызывать построитель проектной матрицы руководителей,
	// необходимо построить список проектов, которые мы анализируем.
	
	Если ЭтоМассив Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	Задачи.ПроектнаяЗадача.Проект КАК Проект
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&СписокЗадач)) КАК Задачи
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
		               |		ПО Задачи.Версия = Версии.Версия
		               |ГДЕ
		               |	Версии.Текущая";
		
		РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, Новый Структура("СписокЗадач", ВхДанные));
		СписокПроектов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Проект");
		
		// Ставим заплатку на случай, если попытка получить РПЗ производится
		// в момент проведения документа "Проектная задача", в этом случае
		// в регистре сведений может "не быть" данных, т.к. в момент транзакции
		// движения документа самому документу недоступны.
		
		// если по каким-то причинам проектов ноль, не будем делать лишних запросов
		
		Если СписокПроектов.Количество() = 0 Тогда      
			Возврат Результат;
		КонецЕсли; 
		
		ТаблицаДанных = упоИерархияИПолномочияВызовСервера.обПолучитьПроектныхРуководителей(СписокПроектов, ?(НЕ ЭтоМассив, ВхДанные, Неопределено));
		
		// для каждой из переданных на вход задач определяем текущего руководителя
		Для каждого СтрокаРезультат Из Результат Цикл
			СтрокаДанных = ТаблицаДанных.Найти(СтрокаРезультат.ПроектнаяЗадача, "ПроектнаяЗадача");
			Если НЕ СтрокаДанных = Неопределено Тогда      
				СтрокаРезультат.Руководитель = СтрокаДанных.Руководитель;
			КонецЕсли; 
		КонецЦикла;
		
		Возврат Результат;
	Иначе // Если Это НЕ Массив
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РП.РуководительПроекта КАК РП,
		               |	Проекты.СтатусПроекта КАК СтатусПроекта
		               |ИЗ
		               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Проекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК РП
		               |		ПО Проекты.Проект = РП.Проект";
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Проект", ВхДанные.Проект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Завершен Тогда
				Возврат Справочники.упоСотрудники.ПустаяСсылка();
			КонецЕсли;
			РП = Выборка.РП;
		Иначе
			Возврат Справочники.упоСотрудники.ПустаяСсылка();
		КонецЕсли;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	Свойства.ЗадачаРодитель КАК ЗадачаРодитель
		               |ПОМЕСТИТЬ Свойства
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК Свойства
		               |ГДЕ
		               |	НЕ Свойства.ЗадачаОтменена
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	Свойства.ЗадачаРодитель КАК ЗадачаРодитель,
		               |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РПЗ
		               |ИЗ
		               |	Свойства КАК Свойства
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
		               |		ПО Свойства.ПроектнаяЗадача = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача";
	
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ВхДанные.Проект));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Родители = Новый Соответствие;
		РПЗы = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			Родители.Вставить(Выборка.ПроектнаяЗадача, Выборка.ЗадачаРодитель);
			РПЗы.Вставить(Выборка.ПроектнаяЗадача, Выборка.РПЗ);
		КонецЦикла;
		
		Возврат ПоискРуководителяПоРодителю(ВхДанные, Родители, РПЗы, РП);
	КонецЕсли; // ЭтоМассив
	
КонецФункции

// Возвращает список проектных задач, руководимых указанным сотрудником
//  с учетом иерархии СДР и того, что задачи могут принадлежать разным проектам.
//
// Параметры:
//  ВхДанные			 - Массив, СправочникСсылка.упоСотрудники	 - сотрудник (или список сотрудников),
//  	для которого нужно определить руководимые им задачи.
//  МетодПланирования	 - ПеречислениеСсылка.МетодПланированияПроекта	 - используется для того,
//  	чтобы отобрать только проекты с указанным методом планирования.
//  ВернутьМассив		 - Булево	 - флаг, указывает на необходимость вернуть не дерево значений,
//  	а массив с общим списком найденных проектных задач.
// 
// Возвращаемое значение:
//  Массив, ДеревоЗначений - найденные проектные задачи руководителя.
//
Функция ПолучитьПроектныеЗадачиРуководителяПоИерархии(ВхДанные, МетодПланирования = Неопределено,
	ВернутьМассив = Ложь) Экспорт

	// разбираем входные данные и генерируем структуру выходных
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ДеревоЗначений();
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	Результат.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;	
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Строки.Добавить();		
		КонецЦикла; 		
		Результат.Строки.ЗагрузитьКолонку(ВхДанные, "Руководитель");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоСотрудники") Тогда
		
		ЭтоМассив = Ложь;         		
		НоваяСтрока = Результат.Строки.Добавить();
		НоваяСтрока.Руководитель = ВхДанные;
	
	Иначе		
		Возврат Неопределено;
	КонецЕсли; 
	
	// Прежде, чем вызывать построитель таблицы проектных руководителей 
	// нужно определить доступные проекты.
	
	// Доступность проектов может зависеть от метода планирования
	
	Запрос = Новый Запрос;
	
	Если МетодПланирования = Неопределено Тогда      
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	РегРП.Проект КАК Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РегРП
		               |ГДЕ
		               |	РегРП.РуководительПроекта В(&СписокСотрудников)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРП.Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегРПЗ.ПроектнаяЗадача.Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РегРПЗ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		               |				И (упоВерсииПроекта.Текущая)
		               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		               |		ПО РегРПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |ГДЕ
		               |	РегРПЗ.РуководительПроектнойЗадачи В(&СписокСотрудников)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРПЗ.ПроектнаяЗадача.Проект";
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	РегРП.Проект КАК Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РегРП
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК РегСвойства
		               |		ПО РегРП.Проект = РегСвойства.Проект
		               |ГДЕ
		               |	РегРП.РуководительПроекта В(&СписокСотрудников)
		               |	И РегСвойства.МетодОперативногоПланирования = &МетодПланирования
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРП.Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегРПЗ.ПроектнаяЗадача.Проект
		               |ИЗ
		               |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РегРПЗ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК РегСвойства
		               |		ПО РегРПЗ.ПроектнаяЗадача.Проект = РегСвойства.Проект
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		               |				И (упоВерсииПроекта.Текущая)
		               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		               |		ПО РегРПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |ГДЕ
		               |	РегРПЗ.РуководительПроектнойЗадачи В(&СписокСотрудников)
		               |	И РегСвойства.МетодОперативногоПланирования = &МетодПланирования
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегРПЗ.ПроектнаяЗадача.Проект";
		
		Запрос.УстановитьПараметр("МетодПланирования", МетодПланирования);
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ПроектЗакрыт", Перечисления.упоСостояниеСтатусаПроекта.Завершен);
	Запрос.УстановитьПараметр("СписокСотрудников", ВхДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	СписокПроектов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Проект");
	
	// Получаем полный список задач и их руководителей
	
	ТаблицаДанных = упоИерархияИПолномочияВызовСервера.обПолучитьПроектныхРуководителей(СписокПроектов);
	
	// Проходим дерево сотрудников и для каждого их них находим руководимые им задачи
	// если в результате нужен список, сразу заполняем его.
	
	МассивЗадач = Новый Массив(); 	
	
	Для каждого СтрокаРезультат Из Результат.Строки Цикл			
		СтрокиДанных = ТаблицаДанных.НайтиСтроки(Новый Структура("Руководитель", СтрокаРезультат.Руководитель));
		Для каждого СтрокаДанных Из СтрокиДанных Цикл		
			НоваяСтрока = СтрокаРезультат.Строки.Добавить();
			НоваяСтрока.Руководитель = СтрокаДанных.Руководитель;			
			НоваяСтрока.ПроектнаяЗадача = СтрокаДанных.ПроектнаяЗадача;
			МассивЗадач.Добавить(СтрокаДанных.ПроектнаяЗадача);
		КонецЦикла; 
	КонецЦикла; 
		
	Если ЭтоМассив Тогда      
		Если ВернутьМассив Тогда      
			Возврат МассивЗадач;
		Иначе
			Возврат Результат;	
		КонецЕсли; 		
	Иначе
	    Возврат Результат.Строки[0].Строки.ВыгрузитьКолонку("ПроектнаяЗадача");
	КонецЕсли; 
	
КонецФункции

// Возвращает список руководителей проекта (или нескольких проектов) в том числе и закрытых.
//
// Параметры:
//  ВхДанные  - СправочникСсылка.Проекты, Массив – проект (или список
//					 проектов, для которых надо получить руководителя.
//
// Возвращаемое значение:
//   СправочникСсылка.упоСотрудники, Массив - найденные руководители проектов.
//
Функция ПолучитьРуководителяПроекта(ВхДанные) Экспорт

	// Разбираем входные данные и строим структуру выходных
	
	ЭтоМассив = Неопределено;
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();		
		КонецЦикла; 
		Результат.ЗагрузитьКолонку(ВхДанные, "Проект");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.Проекты") Тогда
		
		ЭтоМассив = Ложь;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Руководитель = Справочники.упоСотрудники.ПустаяСсылка();
		НоваяСтрока.Проект = ВхДанные;
		
	Иначе
		
		Возврат Неопределено;		
		
	КонецЕсли;   	

	// Запросом получаем руководителей нужных проектов
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РуководителиПроектовСрезПоследних.РуководительПроекта,
	               |	РуководителиПроектовСрезПоследних.Проект
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект В (&СписокПроектов)) КАК РуководителиПроектовСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РуководителиПроектовСрезПоследних.РуководительПроекта,
	               |	РуководителиПроектовСрезПоследних.Проект";
	
	Запрос.УстановитьПараметр("СписокПроектов", ВхДанные);	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	// И записываем результат в итоговую таблицу
	
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		СтрокаРезультата = Результат.Найти(СтрокаДанных.Проект, "Проект");
		Если НЕ СтрокаРезультата = Неопределено Тогда      
			СтрокаРезультата.Руководитель = СтрокаДанных.РуководительПроекта;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Возвращаем данные в нужном виде
	
	Если ЭтоМассив Тогда      		
		Возврат Результат;
	Иначе
		Возврат Результат[0].Руководитель;
	КонецЕсли;            	
	
КонецФункции

// Возвращает список кураторов проекта (или нескольких проектов) в том числе и закрытых.
//
// Параметры:
//  ВхДанные - СправочникСсылка.Проекты, Массив	 - проект (или список
//  	проектов, для которых надо получить руководителя
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники, Массив - найденные руководители проектов.
//
Функция ПолучитьКуратораПроекта(ВхДанные) Экспорт

	// Разбираем входные данные и строим структуру выходных
	
	ЭтоМассив = Неопределено;
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	Результат.Колонки.Добавить("Куратор", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда      
		
		ЭтоМассив = Истина;
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.Куратор = Справочники.упоСотрудники.ПустаяСсылка();		
		КонецЦикла; 
		Результат.ЗагрузитьКолонку(ВхДанные, "Проект");
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.Проекты") Тогда
		
		ЭтоМассив = Ложь;
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Куратор = Справочники.упоСотрудники.ПустаяСсылка();
		НоваяСтрока.Проект = ВхДанные;
		
	Иначе
		
		Возврат Неопределено;		
		
	КонецЕсли;   	

	// Запросом получаем руководителей нужных проектов
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РуководителиПроектовСрезПоследних.КураторПроекта,
	               |	РуководителиПроектовСрезПоследних.Проект
	               |ИЗ
	               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект В (&СписокПроектов)) КАК РуководителиПроектовСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РуководителиПроектовСрезПоследних.КураторПроекта,
	               |	РуководителиПроектовСрезПоследних.Проект";
	
	Запрос.УстановитьПараметр("СписокПроектов", ВхДанные);	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	// И записываем результат в итоговую таблицу
	
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		СтрокаРезультата = Результат.Найти(СтрокаДанных.Проект, "Проект");
		Если НЕ СтрокаРезультата = Неопределено Тогда      
			СтрокаРезультата.Куратор = СтрокаДанных.КураторПроекта;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Возвращаем данные в нужном виде
	
	Если ЭтоМассив Тогда      		
		Возврат Результат;
	Иначе
		Возврат Результат[0].Куратор;
	КонецЕсли;            	
	
КонецФункции

// Функция - Получить руководителя и куратора проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проект - Проект.
// 
// Возвращаемое значение:
//  Структура - поля КураторПроекта и РуководительПроекта.
//
Функция ПолучитьРуководителяИКуратораПроекта(Проект) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КураторПроекта", Справочники.упоСотрудники.ПустаяСсылка());
	Результат.Вставить("РуководительПроекта", Справочники.упоСотрудники.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Данные.РуководительПроекта,
	|	Данные.КураторПроекта
	|ИЗ
	|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК Данные";
	Запрос.УстановитьПараметр("Проект", Проект);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;		
	
	Возврат Результат;
	
КонецФункции

// Дополняет заголовок системы текущим сотрудником.
//
// Параметры:
//  ЗаголовокПриложения	 - Строка - текущий заголовок приложения.
//
// Возвращаемое значение:
//	Строка - дополненный заголовок.
//
Функция ДополнитьЗаголовокСистемыТекущимСотрудником(Знач ЗаголовокПриложения) Экспорт
	
	Если ПараметрыСеанса.упоТекущийСотрудник.Пустая() Тогда
		упоИерархияИПолномочияСервер.УстановитьДиспетчеруТекущегоСотрудника();
	КонецЕсли;
	
	упоТекущийСотрудник = ПараметрыСеанса.упоТекущийСотрудник.Наименование;
	Если ПустаяСтрока(СокрЛП(упоТекущийСотрудник)) Тогда      
		ЗаголовокПриложения = ЗаголовокПриложения + " ( <сотрудник для диспетчера не определен> )";
	Иначе
		ЗаголовокПриложения = ЗаголовокПриложения + " (" + упоТекущийСотрудник + ")";
	КонецЕсли;
	
	Возврат ЗаголовокПриложения;
	
КонецФункции

// Возвращает булево: является ли текущий сотрудник руководителем или куратором проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты
// 
// Возвращаемое значение:
//  Булево - Истина, если текущий сотрудник является либо руководителем проекта, либо его куратором.
//
Функция ЭтоРуководительКураторПроекта(Проект) Экспорт
	РуководителиПроекта = ПолучитьРуководителяИКуратораПроекта(Проект);
	Результат = ПараметрыСеанса.упоТекущийСотрудник = РуководителиПроекта.РуководительПроекта 
	Или ПараметрыСеанса.упоТекущийСотрудник = РуководителиПроекта.КураторПроекта;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область АктуализацияИнформацииОРуководителяхЗадачПоИерархии

// Актуализирует руководителей всех проектных задач.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция АктуализироватьРуководителейВсехПроектныхЗадач() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЕСТЬNULL(упоРуководителиПроектныхЗадачСрезПоследних.РуководительПроектнойЗадачи, ЕСТЬNULL(упоРуководителиПроектовСрезПоследних.РуководительПроекта, НЕОПРЕДЕЛЕНО)) КАК Руководитель
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК упоРуководителиПроектовСрезПоследних
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект = упоРуководителиПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадач.СрезПоследних КАК упоРуководителиПроектныхЗадачСрезПоследних
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоРуководителиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	(упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = НЕОПРЕДЕЛЕНО
	               |			ИЛИ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка))
	               |	И НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		АктуализироватьРуководителейПроектныхЗадачПоИерархии(Выборка.ПроектнаяЗадача, Выборка.Руководитель);	
	КонецЦикла;
	
КонецФункции 

// Актуализирует руководителей всех проектных задач проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проект.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция АктуализироватьРуководителейВсехПроектныхЗадачПроекта(Проект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Руководитель = упоИерархияИПолномочияВызовСервера.обПолучитьРуководителяПроекта(Проект);
	АктуализироватьРуководителейПроектныхЗадачПоИерархии(Проект, Руководитель);
	
КонецФункции 

// Функция - Актуализировать руководителей проектных задач по иерархии
//
// Параметры:
//  ПроектныйЭлемент		 - ДокументСсылка.упоПроектнаяЗадача или СправочникСсылка.Проекты - ПЗ или Проект.
//  ВходящийРуководитель - СправочникСсылка.упоСотрудники, Неопределено - сотрудник
//																		  (назначаемый или Неопределено, тогда расчет).
//  СнимаетсяТекущийРуководительЗадачи - Булево - признак снятия текущего руководителя задачи.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Процедура АктуализироватьРуководителейПроектныхЗадачПоИерархии(ПроектныйЭлемент, Знач ВходящийРуководитель = Неопределено, 
	СнимаетсяТекущийРуководительЗадачи = Ложь, Знач Версия = Неопределено) Экспорт
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ТипЗнч(ПроектныйЭлемент) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ЭтоПроект = Ложь;
	ИначеЕсли ТипЗнч(ПроектныйЭлемент) = Тип("СправочникСсылка.Проекты") Тогда
		ЭтоПроект = Истина;
	КонецЕсли;
	
	Если Версия = Неопределено Тогда
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектныйЭлемент);
	КонецЕсли;
	
	ЗапросИерархии = Новый Запрос;
	ЗапросИерархии.УстановитьПараметр("ТекВерсия", Версия);
	
	ТекстыЗапроса = Новый Массив;
	
	Если ЭтоПроект Тогда
		
		ЗапросИерархии.УстановитьПараметр("Проект", ПроектныйЭлемент);
		
		
		ТекстыЗапроса.Добавить("ВЫБРАТЬ
		                       |	Проекты.Ссылка КАК ПроектЗеркало,
		                       |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
		                       |ПОМЕСТИТЬ ВсеЗадачиИерархии
		                       |ИЗ
		                       |	Справочник.Проекты КАК Проекты
		                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		                       |		ПО Проекты.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		                       |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		                       |ГДЕ
		                       |	Проекты.ЭтоПроектнаяЗадача
		                       |	И Проекты.Ссылка В ИЕРАРХИИ(&Проект)");
		
	Иначе
		
		ЗапросИерархии.УстановитьПараметр("СсылкаНаПроектнуюЗадачу", ПроектныйЭлемент);
		ТекстыЗапроса.Добавить("ВЫБРАТЬ
		                       |	Проекты.Ссылка КАК ПроектЗеркало,
		                       |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		                       |	Проекты.упоКорневойПроект КАК Проект
		                       |ПОМЕСТИТЬ вхДанные
		                       |ИЗ
		                       |	Справочник.Проекты КАК Проекты
		                       |ГДЕ
		                       |	Проекты.СсылкаНаПроектнуюЗадачу = &СсылкаНаПроектнуюЗадачу
		                       |
		                       |ИНДЕКСИРОВАТЬ ПО
		                       |	ПроектЗеркало
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	Проекты.Ссылка КАК ПроектЗеркало,
		                       |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
		                       |ПОМЕСТИТЬ ВсеЗадачиИерархии
		                       |ИЗ
		                       |	Справочник.Проекты КАК Проекты
		                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		                       |		ПО Проекты.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		                       |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		                       |ГДЕ
		                       |	Проекты.ЭтоПроектнаяЗадача
		                       |	И Проекты.Ссылка В ИЕРАРХИИ
		                       |			(ВЫБРАТЬ
		                       |				вхДАННЫЕ.ПроектЗеркало
		                       |			ИЗ
		                       |				вхДАННЫЕ)");
		
	КонецЕсли;
	
	ТекстыЗапроса.Добавить("ВЫБРАТЬ 
	                       |	ВсеЗадачиИерархии.ПроектЗеркало КАК ПроектЗеркало,
	                       |	ВсеЗадачиИерархии.ПроектнаяЗадача,
	                       |	ЕСТЬNULL(упоРуководителиПроектныхЗадачСрезПоследних.РуководительПроектнойЗадачи, НЕОПРЕДЕЛЕНО) КАК НазначенныйРуководительПЗ,
	                       |	ЕСТЬNULL(упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) КАК ТекущийРуководительПЗ
	                       |ИЗ
	                       |	ВсеЗадачиИерархии КАК ВсеЗадачиИерархии
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадач.СрезПоследних КАК упоРуководителиПроектныхЗадачСрезПоследних
	                       |		ПО ВсеЗадачиИерархии.ПроектнаяЗадача = упоРуководителиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	                       |		ПО ВсеЗадачиИерархии.ПроектнаяЗадача = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача
	                       |ИТОГИ ПО
	                       |	ПроектЗеркало ИЕРАРХИЯ");
	
	ЗапросИерархии.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	РезультатЗапроса = ЗапросИерархии.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	ОпределитьВходящегоРуководителя(ПроектныйЭлемент, ВходящийРуководитель, ЭтоПроект, СнимаетсяТекущийРуководительЗадачи);
	
	//
	
	Иерархия = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Иерархия.Строки[0].НазначенныйРуководительПЗ = ВходящийРуководитель;
	Иерархия.Строки[0].ТекущийРуководительПЗ = ВходящийРуководитель;
	ПостобработкаИерархии(Иерархия, ПроектныйЭлемент, ВходящийРуководитель);
	
	ТаблицаНаЗапись = Новый ТаблицаЗначений;
	ТаблицаНаЗапись.Колонки.Добавить("ПроектнаяЗадача");
	ТаблицаНаЗапись.Колонки.Добавить("РуководительПроектнойЗадачи");	
	
	ОпределениеИзмененияРуководителейВИерархии(Иерархия, ТаблицаНаЗапись);
	
	ТаблицаНаЗапись.Свернуть("ПроектнаяЗадача, РуководительПроектнойЗадачи");
	
	Для Каждого СтрокаНаЗапись Из ТаблицаНаЗапись Цикл
		ЗаписатьАктуальногоРуководителяПроектнойЗадачи(СтрокаНаЗапись.ПроектнаяЗадача, 
			СтрокаНаЗапись.РуководительПроектнойЗадачи);
	КонецЦикла;
	
КонецПроцедуры

// Записывает актуального руководителя проектной задачи. Точка входа для методов интеграции.
//
// Параметры:
//  Задача						 - ДокументСсылка.упоПроектнаяЗадача - проектная задача.
//  РуководительПроектнойЗадачи	 - СправочникСсылка.упоСотрудники	 - новый  руководитель проектной задачи.
//
Процедура ЗаписатьАктуальногоРуководителяПроектнойЗадачи(Задача, РуководительПроектнойЗадачи) Экспорт 
	
	Запись = РегистрыСведений.упоРуководителиПроектныхЗадачАктуальные.СоздатьМенеджерЗаписи();
	Запись.ПроектнаяЗадача = Задача;
	Запись.РуководительПроектнойЗадачи = РуководительПроектнойЗадачи;
	Запись.Записать(Истина);
	
	упоИнтеграцияПереопределяемый.ПослеЗаписи_АктуальныйРуководительПроектнойЗадачи(Задача, РуководительПроектнойЗадачи);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОпределитьВходящегоРуководителя(ПроектныйЭлемент, ВходящийРуководитель, ЭтоПроект, СнимаетсяТекущийРуководитель = Ложь) 
		
	Если ЗначениеЗаполнено(ВходящийРуководитель) Тогда	
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоПроект Тогда
		
		ЗапросРуководителя = Новый Запрос;
		ЗапросРуководителя.Текст = 
		"ВЫБРАТЬ 
		|	упоРуководителиПроектныхЗадачСрезПоследних.РуководительПроектнойЗадачи КАК РуководительПЗ,
		|	упоРуководителиПроектныхЗадачАктуальные_Родитель.РуководительПроектнойЗадачи КАК РуководительРодителя,
		|	упоВерсииПроекта.Проект КАК Проект
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|			И (упоВерсииПроекта.Текущая)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоРуководителиПроектныхЗадачСрезПоследних
		|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоРуководителиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные_Родитель
		|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = упоРуководителиПроектныхЗадачАктуальные_Родитель.ПроектнаяЗадача";
		ЗапросРуководителя.УстановитьПараметр("ПроектнаяЗадача", ПроектныйЭлемент);
		РезультатЗапроса = ЗапросРуководителя.Выполнить();		
		
		Если НЕ РезультатЗапроса.Пустой() Тогда			
			
			ВыборкаРезультата = РезультатЗапроса.Выбрать();
			ВыборкаРезультата.Следующий();			
			
			// Берем назначенного руководителея ПЗ (Если снимается текущий руководитель, то руководителя задачи игнорируем)
			// Иначе берем рассчитаного РПЗ для родителя задачи (Чтобы не искать назначение РПЗ для всех родителей вверх)
			// Иначе берем РП проекта (Скорее всего это корневая задача)
			Если Не СнимаетсяТекущийРуководитель И ЗначениеЗаполнено(ВыборкаРезультата.РуководительПЗ) Тогда
				ВходящийРуководитель = ВыборкаРезультата.РуководительПЗ;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаРезультата.РуководительРодителя) Тогда
				ВходящийРуководитель = ВыборкаРезультата.РуководительРодителя;
			Иначе
				ВходящийРуководитель = упоИерархияИПолномочияВызовСервера.обПолучитьРуководителяПроекта(ВыборкаРезультата.Проект);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ВходящийРуководитель = упоИерархияИПолномочияВызовСервера.обПолучитьРуководителяПроекта(ПроектныйЭлемент);	
		
	КонецЕсли;	
	
	Если ВходящийРуководитель = Неопределено Тогда	
		ВходящийРуководитель = Справочники.упоСотрудники.ПустаяСсылка();	
	КонецЕсли;
		
КонецПроцедуры

Функция ДобавлениеРуководителейПоРодителю(текЗадача, Родители, РПЗы, соответствиеРуководителей)
	
	РПЗ = РПЗы[текЗадача];
	Если ЗначениеЗаполнено(РПЗ) Тогда
		соответствиеРуководителей.Вставить(РПЗ);
	КонецЕсли;
	
	Отец = Родители[текЗадача];
	Если ЗначениеЗаполнено(Отец) Тогда
		ДобавлениеРуководителейПоРодителю(Отец, Родители, РПЗы, соответствиеРуководителей);
	КонецЕсли;
	
КонецФункции

Функция ПоискРуководителяПоРодителю(текЗадача, Родители, РПЗы, РП)
	
	РПЗ = РПЗы[текЗадача];
	Если ЗначениеЗаполнено(РПЗ) Тогда
		Возврат РПЗ;
	Иначе
		Отец = Родители[текЗадача];
		Если ЗначениеЗаполнено(Отец) Тогда
			РПЗ_Отца = РПЗы[Отец];
			Если ЗначениеЗаполнено(РПЗ_Отца) Тогда
				Возврат РПЗ_Отца;
			Иначе
				Возврат ПоискРуководителяПоРодителю(Отец, Родители, РПЗы, РП);
			КонецЕсли;
		Иначе
			Возврат РП;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПостобработкаИерархии(Иерархия, ПЗ, Руководитель)
	
	Для Каждого Строка Из Иерархия.Строки Цикл
		
		ПостобработкаИерархии(Строка, ПЗ, Руководитель);
		
		Если Строка.ПроектнаяЗадача = ПЗ Тогда
			Строка.НазначенныйРуководительПЗ = Руководитель;
		КонецЕсли;	
		
		Если НЕ ТипЗнч(Иерархия) = Тип("ДеревоЗначений") И Строка.ПроектЗеркало = Иерархия.ПроектЗеркало Тогда
			ЗаполнитьЗначенияСвойств(Иерархия, Строка);						
		КонецЕсли;								
		
	КонецЦикла;
	
КонецФункции 

Функция ОпределениеИзмененияРуководителейВИерархии(Иерархия, ТаблицаНаЗапись)
	
	РуководительРодителя = Неопределено;
	Если ТипЗнч(Иерархия) <> Тип("ДеревоЗначений") Тогда
		РуководительРодителя = Иерархия.НазначенныйРуководительПЗ; 		
	КонецЕсли;
	
	Для Каждого СтрокаИерархии Из Иерархия.Строки Цикл                          
				
		Если ЗначениеЗаполнено(СтрокаИерархии.НазначенныйРуководительПЗ) Тогда
			Руководитель = СтрокаИерархии.НазначенныйРуководительПЗ;
		ИначеЕсли РуководительРодителя <> Неопределено Тогда
			Руководитель = РуководительРодителя;
			СтрокаИерархии.НазначенныйРуководительПЗ = Руководитель;
		Иначе
			Руководитель = Справочники.упоСотрудники.ПустаяСсылка();
		КонецЕсли;
			 
		Если ЗначениеЗаполнено(СтрокаИерархии.ПроектнаяЗадача) И СтрокаИерархии.ТекущийРуководительПЗ <> Руководитель Тогда
			СтрокаНаЗапись = ТаблицаНаЗапись.Добавить();
			СтрокаНаЗапись.ПроектнаяЗадача = СтрокаИерархии.ПроектнаяЗадача;
			СтрокаНаЗапись.РуководительПроектнойЗадачи = Руководитель;	
		КонецЕсли;
		
		ОпределениеИзмененияРуководителейВИерархии(СтрокаИерархии, ТаблицаНаЗапись);
		
	КонецЦикла;
	
КонецФункции

// Перезаписывает параметры сеанса упоСписокСотрудниковДиспетчера, упоСписокТрудовыхРесурсовСотрудника на основании 
// входящего массива сотрудников пользователя-диспетчера. Очищает параметр сеанса упоТекущийСотрудник в случае, 
// если текущее значение параметра не найдено в перечне СотрудникиДиспетчера.
//
// Параметры:
//  СотрудникиДиспетчера	 - Массив - сотрудники пользователя-диспетчера
//
Процедура ОбновитьПараметрыСеансаПоСотрудникамИРесурсам(СотрудникиДиспетчера)
	
	 ПараметрыСеанса.упоСписокСотрудниковДиспетчера = Новый ФиксированныйМассив(СотрудникиДиспетчера);
	
	// Для работы RLS-правил роли "Исполнитель" необходимо кэшировать список ТР, которыми владеет данный пользователь
	// через связку Пользователь -> (диспетчер) -> Сотрудник -> (владелец) -> Трудовой ресурс.
	// В случае, если это кэширование будет отрицательно сказываться на производительности,
	// а RLS-правила исполнителей не будут использоваться, данный фрагмент можно закомментировать.
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВладениеРесурсамиСрезПоследних.Ресурс
	               |ИЗ
	               |	РегистрСведений.упоВладениеРесурсами.СрезПоследних(, Сотрудник В (&СписокСотрудников)) КАК ВладениеРесурсамиСрезПоследних
	               |ГДЕ
	               |	ВладениеРесурсамиСрезПоследних.ВладеетРесурсом";
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса,
		Новый Структура("СписокСотрудников", СотрудникиДиспетчера));
	
	СписокТР = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ресурс");
	ПараметрыСеанса.упоСписокТрудовыхРесурсовСотрудника = Новый ФиксированныйМассив(СписокТР);
	
	// Сразу проверим текущего сотрудника - при каждом вызове функции
	// необходима проверка, чтобы в "кэше" не остался удаленный элемент.
	
	Если СотрудникиДиспетчера.Найти(ПараметрыСеанса.упоТекущийСотрудник) = Неопределено Тогда
		ПараметрыСеанса.упоТекущийСотрудник = Справочники.упоСотрудники.ПустаяСсылка();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
