
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	ИнициализацияФормы();
	
	// Оповещения PM	
	упоОповещенияВызовСервера.ДобавитьЭлементыПодписки(ЭтаФорма, Объект, Элементы.ОсновнаяПанель);	
	// Конец Оповещения PM
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	Для Каждого СтрокаТаблицы Из СтатьиЗатрат Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтатьяЗатрат) И СтрокаТаблицы.ДоляСуммы > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексСтроки = СтатьиЗатрат.Индекс(СтрокаТаблицы);
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СтатьяЗатрат) Тогда
			СтрокаСообщения = НСтр("ru = 'В строке №%1 табличной части ""Статьи затрат"": Необходимо заполнить значение реквизита ""Статья затрат""'");
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(ИндексСтроки + 1));
			СтруктураСообщения = Новый Структура;                                                       
			СтруктураСообщения.Вставить("Поле", "СтатьиЗатрат[" + ИндексСтроки + "].СтатьяЗатрат");
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок, ,СтруктураСообщения);
		ИначеЕсли СтрокаТаблицы.ДоляСуммы = 0 Тогда
			СтрокаСообщения = НСтр("ru = 'В строке №%1 табличной части ""Статьи затрат"": Необходимо заполнить значение реквизита ""Доля суммы (%)""'");
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(ИндексСтроки + 1));
			СтруктураСообщения = Новый Структура;                                                       
			СтруктураСообщения.Вставить("Поле", "СтатьиЗатрат[" + ИндексСтроки + "].ДоляСуммы");
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок, ,СтруктураСообщения);
		КонецЕсли;
		
	КонецЦикла;	
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	Если (НЕ Отказ) И (НЕ обЗаписатьРаспределениеСтатейЗатрат(ТекущийОбъект.Ссылка, СтатьиЗатрат.Выгрузить())) Тогда
		Отказ = Истина;
	КонецЕсли;
		 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборы();
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	// Оповещения PM
	упоОповещенияВызовСервера.СохранитьПодписку(ЭтаФорма, ТекущийОбъект);	
	// Конец Оповещения PM
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);	
	
	ВладелецРесурса = упоРесурсыИРолиВызовСервера.обПолучитьТекущегоВладельцаРесурса(ТекущийОбъект.Ссылка);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтоимостьУстановитьПериод(Команда)
	
	упоРаботаСФормамиКлиент.УстановитьПериодВТаблице(ТаблицаСтоимость);
	
КонецПроцедуры

&НаСервере
Функция УстановитьОтборы() 
	
	ЭтоНовый = Не ЗначениеЗаполнено(Объект.Ссылка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокОтборРолей, 	 "ЭтоНовый", ЭтоНовый);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаСтоимость, "ЭтоНовый", ЭтоНовый);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Подразделения, "ЭтоНовый", ЭтоНовый);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокОтборРолей, 	 "Ресурс", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаСтоимость, "Ресурс", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Подразделения, 	"Ресурс", Объект.Ссылка);

КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЗакладокФормы()
	
	// Трудовые ресурсы пользователя нужны для установки видимости закладок формы.
	МассивТрудовыхРесурсовПользователя = ПараметрыСеанса.упоСписокТрудовыхРесурсовСотрудника;
	ЕстьПолныеПрава = РольДоступна("ПолныеПрава");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтоРесурсПользователя = ЕстьПолныеПрава ИЛИ (НЕ МассивТрудовыхРесурсовПользователя.Найти(Объект.Ссылка) = Неопределено);
	Иначе
		// Для новых ТР предполагаем, что текущий ресурс принадлежит пользователю или он имеет все полномочия, раз он его может создать.
		ЭтоРесурсПользователя = Истина;
	КонецЕсли;
	
	// Ограничение доступа к закладке "Компетенции".
	
	ДоступКоВсемКомпетенциям = ЕстьПолныеПрава ИЛИ РольДоступна("упоДоступКоВсемКомпетенциям");
	Если НЕ ДоступКоВсемКомпетенциям Тогда
		ЕстьДоступККомпетенцииРесурса = (НЕ МассивТрудовыхРесурсовПользователя.Найти(Объект.Ссылка) = Неопределено);
		Элементы.Показатели.Видимость = ЕстьДоступККомпетенцииРесурса;
		Элементы.СтраницаКомпетенции.Видимость = ЕстьДоступККомпетенцииРесурса;
	КонецЕсли;
	
	// Ограничение доступа к закладке "Статьи затрат".
	
	ДобавлениеИзменениеСтатейЗатратВсехТрудовыхРесурсов = ЕстьПолныеПрава ИЛИ РольДоступна("упоДобавлениеИзменениеСтатейЗатратВсехТрудовыхРесурсов");
	ДобавлениеИзменениеСтатейЗатратСвоихТрудовыхРесурсов = РольДоступна("упоДобавлениеИзменениеСтатейЗатратСвоихТрудовыхРесурсов");
	ЧтениеСтатейЗатратСвоихТрудовыхРесурсов = РольДоступна("упоЧтениеСтатейЗатратСвоихТрудовыхРесурсов");
	
	Если ДобавлениеИзменениеСтатейЗатратВсехТрудовыхРесурсов Тогда
		Элементы.СтатьиЗатрат.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	ИначеЕсли ДобавлениеИзменениеСтатейЗатратСвоихТрудовыхРесурсов
			ИЛИ ЧтениеСтатейЗатратСвоихТрудовыхРесурсов Тогда
		Элементы.СтатьиЗатрат.Видимость = ЭтоРесурсПользователя;
		Элементы.СтраницаСтатьиЗатрат.Видимость = ЭтоРесурсПользователя;
		Элементы.СтатьиЗатрат.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр ИЛИ (НЕ ДобавлениеИзменениеСтатейЗатратСвоихТрудовыхРесурсов);
	Иначе
		Элементы.СтатьиЗатрат.Видимость = Ложь;
		Элементы.СтраницаСтатьиЗатрат.Видимость = Ложь;
	КонецЕсли;
	
	// Ограничение доступа к закладке "Роли".
	
	ЧтениеРолейВсехТрудовыхРесурсов = ЕстьПолныеПрава ИЛИ РольДоступна("упоЧтениеРолейВсехТрудовыхРесурсов");
	Если НЕ ЧтениеРолейВсехТрудовыхРесурсов Тогда
		Элементы.СписокОтборРолей.Видимость = ЭтоРесурсПользователя;
		Элементы.СтраницаРоли.Видимость = ЭтоРесурсПользователя;
	КонецЕсли;
	
	// Ограничение доступа к закладке "Стоимость".
	
	Доступ = упоРазграничениеДоступаВызовСервера.обДоступностьФинансовойИнформации();
	Если Доступ = "Отсутствует" Тогда
		Элементы.ТаблицаСтоимость.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюНазначенийРолей(Команда)
	
	Для каждого ЭлементОтбора Из СписокОтборРолей.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "ПоказатьИсториюНазначенийРолей" Тогда
			ЭлементОтбора.Использование = Элементы.СписокОтборРолейПоказатьИсториюНазначенийРолей.Пометка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СписокОтборРолейПоказатьИсториюНазначенийРолей.Пометка = Не Элементы.СписокОтборРолейПоказатьИсториюНазначенийРолей.Пометка;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ИнициализацияФормы()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Ресурс = Объект.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Ресурс = Параметры.ЗначениеКопирования;
	Иначе
		Ресурс = Неопределено;
	КонецЕсли;
	
	Если Ресурс <> Неопределено Тогда
		ТаблицаСтатей = СтатьиЗатрат.Выгрузить();
		обПолучитьРаспределениеСтатейЗатрат(Ресурс, ТаблицаСтатей);
		СтатьиЗатрат.Загрузить(ТаблицаСтатей);
	КонецЕсли;
	
	Элементы.ФизическоеЛицо.Видимость = упоИнтеграцияВызовСервера.ЭтоEPM();
	
	УстановитьОтборы();

	ВидимостьЗакладокФормы();
	
КонецПроцедуры	

#КонецОбласти
