
Функция ПолучитьПриказЗаписатьДокументПриказа(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТелоЗапроса);
		Объект = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
		Если ТипЗнч(Объект) = Тип("Структура") Тогда
			СоздатьДокумент(Объект);
		Иначе
			ВызватьИсключение("Сообщение не является структурой!");
		КонецЕсли;
		
		Возврат Ответ;	
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка получения документа из ЕРП",,,ОписаниеОшибки());
		Ответ.КодСостояния = 400;
		Возврат Ответ;
	КонецПопытки;			
КонецФункции

Процедура СоздатьДокумент(Объект)
	
	Если Объект.ТипДокумента = "Работа в выходные и праздники" Тогда //ТипДокумента = Представление объекта 
	
	    ЗапросДок = Новый Запрос;
		ЗапросДок.Текст =
		"ВЫБРАТЬ
		|	РаботаВВыходныеИПраздничныеДни.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РаботаВВыходныеИПраздничныеДни КАК РаботаВВыходныеИПраздничныеДни
		|ГДЕ
		|	РаботаВВыходныеИПраздничныеДни.Номер = &Номер";
		ЗапросДок.УстановитьПараметр("Номер",Объект.Номер);
		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если ВыборкаДок.Следующий() Тогда
			НовыйДокумент = ВыборкаДок.Ссылка.ПолучитьОбъект();
			НовыйДокумент.Сотрудники.Очистить();
	    Иначе
			НовыйДокумент = Документы.РаботаВВыходныеИПраздничныеДни.СоздатьДокумент();
		КонецЕсли;
			
		НовыйДокумент.Дата = Дата(Объект.Дата);
		НовыйДокумент.Номер = Объект.Номер;
		НовыйДокумент.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН",Объект.ОрганизацияИНН);
		НовыйДокумент.ДатаНачалаСобытия = Дата(Объект.ДатаНачалаСобытия);
		НовыйДокумент.ПериодРегистрации = Дата(Объект.ПериодРегистрации);
		НовыйДокумент.ВремяВЧасах = Ложь;
		НовыйДокумент.ВремяУчтено = Истина;
		НовыйДокумент.БухучетЗаданВСтрокахДокумента = Ложь;
		НовыйДокумент.СогласиеТребуется = Ложь;
		НовыйДокумент.СогласиеПолучено = Ложь;
		НовыйДокумент.ВремяУчел = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
		НовыйДокумент.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
		НовыйДокумент.Комментарий = "Выгружено из ЕРП";
		НовыйДокумент.ИКТ_ВыгруженоИзЕРП = Истина;	
		
		Для Каждого Строка Из Объект.Сотрудники Цикл
			НоваяСтрокаСотрудники = НовыйДокумент.Сотрудники.Добавить();
			
			Для Каждого Элемент Из Строка Цикл	
				ТабельныйНомер=Прав(Элемент.Ключ,9);
				ТабельныйНомер = Лев(ТабельныйНомер,4)+"-"+Прав(ТабельныйНомер,5);
				НоваяСтрокаСотрудники.Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ТабельныйНомер);
				
				МассивЗначениеСтроки = СтрРазделить(Элемент.Значение,";");
				НоваяСтрокаСотрудники.Дата = Дата(МассивЗначениеСтроки[0]);
				НоваяСтрокаСотрудники.НеРаботал = Булево(МассивЗначениеСтроки[1]);
				НоваяСтрокаСотрудники.СпособКомпенсацииПереработки = Перечисления.СпособыКомпенсацииПереработки.ПовышеннаяОплата;
			КонецЦикла;
		КонецЦикла;
	
	КонецЕсли;
	
	НовыйДокумент.Записать();
	
КонецПроцедуры

Функция Пинг(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
