
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ИнициализироватьНаСервере();
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача", "");
	
	УстановитьОтметкуНезаполненного();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.упоЕдиницыВремени"));
	МассивТипов.Добавить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	Элементы.ЗатратыМатРесурсовФактЕдиницаНормирования.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
	ВидимостьЭлементовАналитикаПоПодразделениям();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
	ВидимостьЭлементовАналитикаПоПодразделениям();
	
	ОбработкаИзмененияРеквизитаВключитьМатРесурсыВФактРасходов();

КонецПроцедуры                            	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманд
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементовАналитикаПоПодразделениям()
	
	СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	
	РасходыПоПодразделениям = СтруктураСвойств.РасходыПоПодразделениям;
	Элементы.РаспределениеЗатрат.Видимость = СтруктураСвойств.РасходыПоПодразделениям;
	
	РасходыПоНатуральнымПоказателям = СтруктураСвойств.РасходыПоНатуральнымПоказателям;
	Элементы.РаспределениеЗатратКоличество.Видимость = СтруктураСвойств.РасходыПоНатуральнымПоказателям;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "СменаНастроекУчетаПодразделений" Тогда
		ВидимостьЭлементовАналитикаПоПодразделениям();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПрограммно(РежимЗаписи,Закрыть)
	
	Отказ = Ложь;
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписи);
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РежимЗаписи",РежимЗаписи);
	ДопПараметры.Вставить("Закрыть",Закрыть); 
	
	Если РасходыПоПодразделениям и Объект.ВключитьМатРесурсыВФактРасходов Тогда

		КлючиТаблиц = "ТаблицаВладелец, ТаблицаПодчиненная, ИмяКолонкиВладелец, ИмяКолонкиПодчиненная, ЕстьКоличество,
		|ПредставлениеТаблицыРаспределения";
		ПараметрТаблиц = Новый Структура(КлючиТаблиц, 
			"ЗатратыМатРесурсовФакт", 
			"РаспределениеЗатрат", 
			"ОбщСтоимость",
			"Сумма", 
			?(РасходыПоНатуральнымПоказателям, Истина, Ложь),
			НСтр("ru = 'Затраты материальных ресурсов'"));
		ПараметрыТаблиц = Новый Массив;
		ПараметрыТаблиц.Добавить(ПараметрТаблиц);	
	    
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьПрограммноЗавершение", ЭтотОбъект, ДопПараметры);	
	
		упоАналитикаПоПодразделениямКлиент.ПроверитьРаспределениеПередЗаписью(Объект, ПараметрыТаблиц, Отказ, ОписаниеОповещения);
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		ЗаписатьПрограммноЗавершение(Истина, ДопПараметры);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПрограммноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", ДополнительныеПараметры.РежимЗаписи);
		
		Записать(ПараметрыЗаписи);
		Если ДополнительныеПараметры.Закрыть Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	АдресХранилища  = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаКлиенте
Процедура НадписьПроектнаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	упоУправлениеФормамиКлиент.ОбработатьНажатиеНаГиперссылкуРеквизитаОбъекта(Объект, ЭтаФорма, "ПроектнаяЗадача", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	Объект.ПроектнаяЗадача = ПредопределенноеЗначение("Документ.упоПроектнаяЗадача.ПустаяСсылка");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПЗ = Объект.ПроектнаяЗадача;
	Если ЗначениеЗаполнено(ПЗ) Тогда
		ПоказатьЗначение(, ПЗ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьМатРесурсыВФактРасходовПриИзменении(Элемент)
	
	ОбработкаИзмененияРеквизитаВключитьМатРесурсыВФактРасходов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗатратыМатРесурсовФакт

&НаКлиенте
Процедура ЗатратыМатРесурсовФактПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ПараметрыПодбораСтруктура = Неопределено;
	ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ЗатратыМатРесурсовФакт");		

	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Ресурс",
		Объект.ЗатратыМатРесурсовФакт, ЭтаФорма, Истина, ПараметрыПодбораСтруктура);		

КонецПроцедуры

&НаКлиенте
Процедура ЗатратыМатРесурсовФактОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыПодбораСтруктура = Неопределено;
		   
	ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ЗатратыМатРесурсовФакт");		
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Ресурс",
		Объект.ЗатратыМатРесурсовФакт, ЭтаФорма, Истина, ПараметрыПодбораСтруктура);

КонецПроцедуры

&НаКлиенте
Процедура ЗатратыМатРесурсовФактПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьОграничениеТиповМатериальныеРесурсы();
	
	ТекСтрока = Элементы.ЗатратыМатРесурсовФакт.ТекущиеДанные;	
	
	Если Копирование Тогда
		ТекСтрока.ИндексСтрокРаспределения = 0;
	КонецЕсли; 
	
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ЗатратыМатРесурсовФакт");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);			
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки,
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЗатратыМатРесурсовФактПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	УстановитьОграничениеТиповМатериальныеРесурсы();
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект, "ЗатратыМатРесурсовФакт",
		"РаспределениеЗатрат", Копирование, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыМатРесурсовФактСтоимостьКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗатратыМатРесурсовФакт.ТекущиеДанные;	
	упоРаботаСФормамиКлиент.ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти);
	
	Если Не Объект.ВключитьМатРесурсыВФактРасходов Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = "ЗатратыМатРесурсовФакт";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, СтрокаТабличнойЧасти, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ЗатратыМатРесурсовФактОбщСтоимостьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ЗатратыМатРесурсовФакт.ТекущиеДанные;	
	упоРаботаСФормамиКлиент.ПриИзмененииОбщейСтоимостиТабЧасти(СтрокаТабличнойЧасти);
	
	Если Не Объект.ВключитьМатРесурсыВФактРасходов Тогда
		Возврат;
	КонецЕсли;

	ИмяТаблицы = "ЗатратыМатРесурсовФакт";
	упоРаботаСФормамиКлиент.ПроверитьНеобходимостьПересчетаРаспределения(ЭтаФорма, СтрокаТабличнойЧасти, ИмяТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ЗатратыМатРесурсовФактПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ЗатратыМатРесурсовФакт",
		"РаспределениеЗатрат", "ОбщСтоимость", Истина) ;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыМатРесурсовФактПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "ЗатратыМатРесурсовФакт", "РаспределениеЗатрат");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеЗатрат
	
&НаКлиенте
Процедура РаспределениеЗатратПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.ЗатратыМатРесурсовФакт, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗатратПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.ЗатратыМатРесурсовФакт, 
		Элементы.РаспределениеЗатрат, Объект, НоваяСтрока, Копирование);
		
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗатратПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ЗатратыМатРесурсовФакт", "РаспределениеЗатрат", "ОбщСтоимость", Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ЗатратыМатРесурсовФакт", "РаспределениеЗатрат", "ОбщСтоимость", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗатратПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "ЗатратыМатРесурсовФакт", "РаспределениеЗатрат", "ОбщСтоимость", Истина);	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "ЗатратыМатРесурсовФакт", "РаспределениеЗатрат", "ОбщСтоимость", Истина);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборВТЧФормы(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПоНормеТР(Команда)
	
	ПересчитатьПоНормеТРСервер();
	
КонецПроцедуры

&НаКлиенте	
Процедура КомандаКопироватьСтрокуВладельцаВРаспределение(Команда)
		
	Результат = НастройкиПоИмениКоманды(Команда.Имя);	
	Если Результат = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;	

	ИмяОсновнойТаблицы		= Результат.ИмяОсновнойТаблицы;
	ИмяТаблицыРаспределения = Результат.ИмяТаблицыРаспределения;
	ИмяКолонкиСумма 		= Результат.ИмяКолонкиСумма;
	УчитыватьКоличество		= Результат.УчитыватьКоличество;
				
	упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределениеСОчисткой(ЭтаФорма, 
																						ИмяОсновнойТаблицы, 
																						ИмяТаблицыРаспределения, 
																						ИмяКолонкиСумма, 
																						УчитыватьКоличество);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыделитьНДС(Команда)
		
	Результат = НастройкиПоИмениКоманды(Команда.Имя);	
	Если Результат = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;	
	
	ИмяОсновнойТаблицы		= Результат.ИмяОсновнойТаблицы;
	ИмяТаблицыРаспределения = Результат.ИмяТаблицыРаспределения;
	ИмяКолонкиСумма 		= Результат.ИмяКолонкиСумма;
	УчитыватьКоличество		= Результат.УчитыватьКоличество;
			
	ТекущиеДанные = Элементы[ИмяОсновнойТаблицы].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;  // Возврат.
	КонецЕсли;		
	
	// Заполнение по умолчанию.
	СтрокиРаспределенияПоПодразделениям = упоПроектыИЗадачиОбщие.ПолучитьСтрокиРаспределенияПоПодразделениям(
																								ТекущиеДанные, 
																								Объект[ИмяТаблицыРаспределения], 
																								Истина);
	Если СтрокиРаспределенияПоПодразделениям.Количество() = 0 Тогда									
		упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределениеСОчисткой(ЭтаФорма, 
																							ИмяОсновнойТаблицы, 
																							ИмяТаблицыРаспределения, 
																							ИмяКолонкиСумма, 
																							УчитыватьКоличество);		
	КонецЕсли;					
	
	// НДС.
	СтрокаВладелец = Новый Структура;
	СтрокаВладелец.Вставить("Валюта", ТекущиеДанные.Валюта); 
	СтрокаВладелец.Вставить("Договор", ТекущиеДанные.Договор);
	СтрокаВладелец.Вставить("ИндексСтрокРаспределения", ТекущиеДанные.ИндексСтрокРаспределения);
	СтрокаВладелец.Вставить("Сумма", ТекущиеДанные[ИмяКолонкиСумма]);			
						
	ВыделитьНДС(СтрокаВладелец, ИмяОсновнойТаблицы);		
	
	// Итоги.
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, 
																		ИмяОсновнойТаблицы, 
																		ИмяТаблицыРаспределения, 
																		ИмяКолонкиСумма,
																		Истина);
																		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровестиИЗакрыть(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение,Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровести(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗаписать(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Запись,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧФормы(Команда)
		
	Если Объект.ЗатратыМатРесурсовФакт.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТЧФормыЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена и заполнена заново.
			|Продолжить?'");
		
		ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса, РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ВыполнитьОбработкуЗаполненияНаСервере(Объект.ПроектнаяЗадача);	
		
	КонецЕсли; 
	
	ОбработкаИзмененияРеквизитаВключитьМатРесурсыВФактРасходов();
	
	Элементы.ЗатратыМатРесурсовФакт.ТекущаяСтрока = 0;
	ЗатратыМатРесурсовФактПриАктивизацииСтроки(Элементы.ЗатратыМатРесурсовФакт);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧФормыЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЗатратыМатРесурсовФакт.Очистить();
	Объект.РаспределениеЗатрат.Очистить();
	
	ВыполнитьОбработкуЗаполненияНаСервере(Объект.ПроектнаяЗадача);
	
	Элементы.ЗатратыМатРесурсовФакт.ТекущаяСтрока = 0;
	ЗатратыМатРесурсовФактПриАктивизацииСтроки(Элементы.ЗатратыМатРесурсовФакт);
		
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
	
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ИнициализацияФормы()
		
	УстановитьДоступКФинансовойИнформации();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуЗаполненияНаСервере(Основание)
	
	ТипЗначения = Тип("ДокументОбъект.упоРегистрацияФактическихЗатратМатРесурсов");
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ТипЗначения);	
	ДокументОбъект.Заполнить(Основание);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПоНормеТРСервер()
	
	Если НЕ Объект.НормаСтоимости.Пустая() Тогда   
		МатРесурсы = Объект.ЗатратыМатРесурсовФакт.Выгрузить(); 
		упоРесурсыИНормыВызовСервера.обРассчитатьСтоимостьРесурсовПоНорме(МатРесурсы, Объект, Объект.НормаСтоимости);
		Объект.ЗатратыМатРесурсовФакт.Загрузить(МатРесурсы);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте	
Процедура УстановитьОграничениеТиповМатериальныеРесурсы()
		
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	ОписаниеТиповМатериальныеРесурсы = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.ЗатратыМатРесурсовФактРесурс.ОграничениеТипа = ОписаниеТиповМатериальныеРесурсы;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкуНезаполненного()
	
	Элементы.ЗатратыМатРесурсовФактСтоимость.АвтоОтметкаНезаполненного = Объект.ВключитьМатРесурсыВФактРасходов;
	Элементы.ЗатратыМатРесурсовФактСтатья.АвтоОтметкаНезаполненного = Объект.ВключитьМатРесурсыВФактРасходов;
	Элементы.ЗатратыМатРесурсовФактДатаНачисления.АвтоОтметкаНезаполненного = Объект.ВключитьМатРесурсыВФактРасходов;
	Элементы.ЗатратыМатРесурсовФактСтоимость.АвтоОтметкаНезаполненного = Объект.ВключитьМатРесурсыВФактРасходов;
	Элементы.ЗатратыМатРесурсовФактВалюта.АвтоОтметкаНезаполненного = Объект.ВключитьМатРесурсыВФактРасходов;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьНаСервере()
	
	УстановитьВидимостьКолонокТЧ(Элементы.ЗатратыМатРесурсовФакт, Объект.ВключитьМатРесурсыВФактРасходов);
	
	УстановитьДоступКФинансовойИнформации();
	
	Элементы.ГруппаРаспределениеЗатрат.Видимость = Объект.ВключитьМатРесурсыВФактРасходов;
	
КонецПроцедуры

// Подгототавливает дополнительные параметры структуры подбора.
//
// Параметры:
//  ПараметрыПодбораСтруктура	 - Структура - структура параметров.
//  ИмяТЧ						 - Строка - имя табличной части.
&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ) Экспорт
	
	ПараметрыПодбораСтруктура = Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных = ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
КонецПроцедуры

&НаСервере
Функция  ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("СтруктураСтрокиТЧ", Новый Структура);
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураСтрокиТЧ, ИмяТЧ);
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)
	
	// Перенести код в модуль с повторным использованием значений
	
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическихЗатратМатРесурсов.Реквизиты Цикл
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);
		
	Иначе 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическихЗатратМатРесурсов.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Объект.Проект = ВыбранноеЗначение.Проект;
		Объект.ПроектнаяЗадача = ВыбранноеЗначение;
		упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача", "");
		
		Основание = Объект.ПроектнаяЗадача;
		СвойстваПЗ = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектнойЗадачи(Основание, "ВключитьМатРесурсыВПланРасходов");
		Объект.ВключитьМатРесурсыВФактРасходов = СвойстваПЗ.ВключитьМатРесурсыВПланРасходов;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	АдресХранилища = "";
	
	Если имяКоманды = "ДействиеПодобрать_Ресурсы_РолиТР" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ЗатратыМатРесурсовФакт;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.Номенклатура";
		ТаблицаФормы = Объект.ЗатратыМатРесурсовФакт;
		ИмяКолонки = "Ресурс";	
		
	КонецЕсли;
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
	
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// Выполняет действия при подборе.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура - строка данных, для которой надо выполнить действия.
//  ПараметрыПодбора	 - Структура - данные подбора.
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	Если ТипЗнч(ПараметрыПодбора) = Тип("Структура") Тогда
		
		Если ПараметрыПодбора.Свойство("ПараметрыПодбораСписок") Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыПодбора.СтруктураСтроки, СтрокаТабличнойЧасти);				
			упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбора.СтруктураСтроки,
																   ПараметрыПодбора.ПараметрыПодбораСписок,
																   ПараметрыПодбора.СвойстваОбъекта);
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ПараметрыПодбора.СтруктураСтроки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКолонокТЧ(ЭлементФормыТЧ, Видимость = Ложь)
	
	ЭлементФормыТЧ.ПодчиненныеЭлементы.ЗатратыМатРесурсовФактСтатья.Видимость = Видимость;
	ЭлементФормыТЧ.ПодчиненныеЭлементы.ЗатратыМатРесурсовФактДатаНачисления.Видимость = Видимость;
	ЭлементФормыТЧ.ПодчиненныеЭлементы.ЗатратыМатРесурсовФактКонтрагент.Видимость = Видимость;
	ЭлементФормыТЧ.ПодчиненныеЭлементы.ЗатратыМатРесурсовФактДоговор.Видимость = Видимость;
	ЭлементФормыТЧ.ПодчиненныеЭлементы.ЗатратыМатРесурсовФактВалюта.Видимость = Видимость;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ВыделитьНДС(СтрокаВладелец, ИмяТаблицы)
				
	ПараметрыРаспределения = упоДоходыИРасходыСервер.ПараметрыВыделенияНДСВРаспределенииПоУмолчанию();
	ПараметрыРаспределения.Проект 		= Объект.Проект;
	ПараметрыРаспределения.СтавкаНДС 	= упоДоходыИРасходыСервер.ЗначениеСтавкиНДС(СтрокаВладелец.Договор, Объект.Проект);
	
	упоДоходыИРасходыСервер.ВыделитьНДСВРаспределении(Объект, 
													СтрокаВладелец, 
													ИмяТаблицы,
													, 
													ПараметрыРаспределения);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОсновнойТаблицыПоИмениКоманды(ИмяКоманды)
			
	Если ИмяКоманды = "ВыделитьНДСЗатраты"
		Или ИмяКоманды = "ЗаполнитьПоВладельцуЗатраты" Тогда				
		ИмяТаблицы = "ЗатратыМатРесурсовФакт";														
	Иначе
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Возврат ИмяТаблицы;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция ИменаТаблицРеквизитовПоИмениОсновнойТаблицы(ИмяОсновнойТаблицы)			
		
	ИмяКолонкиСумма = "ОбщСтоимость";
	
	Если ИмяОсновнойТаблицы = "ЗатратыМатРесурсовФакт" Тогда						
		ИмяТаблицыРаспределения = "РаспределениеЗатрат";		
	Иначе
		Возврат Неопределено; // Возврат.
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицыРаспределения", 	ИмяТаблицыРаспределения);
	Результат.Вставить("ИмяКолонкиСумма", 			ИмяКолонкиСумма);	
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиПоИмениКоманды(ИмяКоманды)
		
	ИмяОсновнойТаблицы = ИмяОсновнойТаблицыПоИмениКоманды(ИмяКоманды);
	Если ИмяОсновнойТаблицы = Неопределено Тогда
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Результат = ИменаТаблицРеквизитовПоИмениОсновнойТаблицы(ИмяОсновнойТаблицы);	
	Если Результат = Неопределено Тогда
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	Результат.Вставить("ИмяОсновнойТаблицы", 	ИмяОсновнойТаблицы);
	Результат.Вставить("УчитыватьКоличество", 	Истина);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияРеквизитаВключитьМатРесурсыВФактРасходов()
	
	УстановитьВидимостьКолонокТЧ(Элементы.ЗатратыМатРесурсовФакт, Объект.ВключитьМатРесурсыВФактРасходов);
	УстановитьОтметкуНезаполненного();
	Элементы.ГруппаРаспределениеЗатрат.Видимость = Объект.ВключитьМатРесурсыВФактРасходов;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступКФинансовойИнформации()
	
	ДоступКФинИнформации = упоРазграничениеДоступаВызовСервера.обДоступностьФинансовойИнформации();
	Если ДоступКФинИнформации = "Отсутствует" Тогда
		СкрытьФинансовуюИнформацию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьФинансовуюИнформацию()
	
	КолонкиСОграничениемДоступа = Новый Массив;
	
	ИмяТЧ = "ЗатратыМатРесурсовФакт";
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Стоимость");
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "ОбщСтоимость");
	
	ИмяТЧ = "РаспределениеЗатрат";
	КолонкиСОграничениемДоступа.Добавить(ИмяТЧ + "Сумма");

	упоРазграничениеДоступаВызовСервера.УстановитьДоступККолонкамТабличнойЧасти(Элементы,
		КолонкиСОграничениемДоступа,
		"Отсутствует");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеСтоимостиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не РасходыПоНатуральнымПоказателям Тогда
		ДополнительныеПараметры.Вставить("ПересчитыватьКоличество", Ложь);
	КонецЕсли;

	упоРаботаСФормамиКлиент.ПересчитатьТаблицуРаспределенияЗавершение(ДополнительныеПараметры);			
	
	ВосстановитьОбнуленныйНДСПослеПересчета(ДополнительныеПараметры.ТаблицаРаспределения,
											ДополнительныеПараметры.ТекДанные,
											ДополнительныеПараметры.ИмяТаблицыВладельца);
												
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, 
																		ДополнительныеПараметры.ИмяТаблицыВладельца, 
																		ДополнительныеПараметры.ИмяТаблицыРаспределения, 
																		ДополнительныеПараметры.ИмяКолонкиОбщСтоимость,
																		ДополнительныеПараметры.ПересчитыватьКоличество);
																		
КонецПроцедуры 
																	
// Если в подчиненных строках был НДС, его сумма обнулится при пересчете по коэффициентам, т.к. в строке НДС Количество = 0. 
// Для восстановления делаем пересчет НДС.
&НаКлиенте
Процедура ВосстановитьОбнуленныйНДСПослеПересчета(ТаблицаРаспределения, СтрокаВладелец, ИмяТаблицыВладельца)
	
	СтруктураСтрокаВладелец = упоРаботаСФормамиКлиент.СтруктураСтрокиДляРасчетаНДС(ТаблицаРаспределения, СтрокаВладелец, 
		ИмяТаблицыВладельца);
		
	Если Не ЗначениеЗаполнено(СтруктураСтрокаВладелец) Тогда
		Возврат;
	КонецЕсли;
	
	ВыделитьНДС(СтруктураСтрокаВладелец, ИмяТаблицыВладельца);
		
КонецПроцедуры

#КонецОбласти

