#Область ПрограммныйИнтерфейс

// Рассчитывает финансовый показатель Чистая приведенная стоимость (показатель прибыли,
//  которую получат участники проекта) по таблице периодов.
//
// Параметры:
//  ТаблицаПериодов					 - ТаблицаЗначений	 - таблица периодов, за которые необходимо рассчитать показатель.
//  СтавкаДисконтированияНаПериод	 - Число
// 
// Возвращаемое значение:
//  Число - значение NPV
//
Функция РассчитатьNPV(ТаблицаПериодов, СтавкаДисконтированияНаПериод) Экспорт
	
	НачальнаяДатаРасчетаNPV = Неопределено;
	Для каждого СтрокаПериод Из ТаблицаПериодов Цикл
		Если Не ЗначениеЗаполнено(НачальнаяДатаРасчетаNPV) Тогда
			НачальнаяДатаРасчетаNPV = СтрокаПериод.Период;
		КонецЕсли;
		
		ПозицияПериодаДляРасчетаNPV = РазностьДатВМесяцах(НачальнаяДатаРасчетаNPV, СтрокаПериод.Период);
		
		СтрокаПериод.ПриведенныйДенежныйПоток = 
			СтрокаПериод.ЧистыйДенежныйПоток * КоэффициентДисконтирования(СтавкаДисконтированияНаПериод,
				ПозицияПериодаДляРасчетаNPV);
	КонецЦикла;
	
	Возврат Окр(ТаблицаПериодов.Итог("ПриведенныйДенежныйПоток"), 2);
	
КонецФункции

// Рассчитывает финансовый показатель Срок окупаемости (через сколько периодов выйдем в плюс) по таблице периодов.
//
// Параметры:
//  ТаблицаПериодов					 - ТаблицаЗначений	 - таблица периодов, за которые необходимо рассчитать показатель.
//  СтавкаДисконтированияНаПериод	 - Число
// 
// Возвращаемое значение:
//  Число - значение PBP
//
Функция РассчитатьPBP(ТаблицаПериодов, СтавкаДисконтированияНаПериод) Экспорт	
	
	НакопленныйДенежныйПоток = 0;
	ПериодОкупаемости = 0;
	ПустыеПериоды = 0;
	
	Для Сч = 0 По ТаблицаПериодов.Количество() - 1 Цикл
		
		СтрокаПериод = ТаблицаПериодов[Сч];
		
		Если Сч = 0 Тогда
			НачальнаяДатаРасчетаNPV = СтрокаПериод.Период;
		КонецЕсли;
		
		ПозицияПериодаДляРасчетаNPV = РазностьДатВМесяцах(НачальнаяДатаРасчетаNPV, СтрокаПериод.Период);
		
		СтрокаПериод.ПриведенныйДенежныйПоток = 
			СтрокаПериод.ЧистыйДенежныйПоток * КоэффициентДисконтирования(СтавкаДисконтированияНаПериод,
			ПозицияПериодаДляРасчетаNPV);
		
		Если СтрокаПериод.ПриведенныйДенежныйПоток = 0 Тогда
			ПустыеПериоды = ПустыеПериоды + 1;
		КонецЕсли;
		
		НакопленныйДенежныйПоток = НакопленныйДенежныйПоток + СтрокаПериод.ПриведенныйДенежныйПоток;
		
		Если НакопленныйДенежныйПоток > 0 Тогда
			
			Если ПериодОкупаемости = 0 Тогда
				ПериодОкупаемости = Сч - ПустыеПериоды;
			КонецЕсли;
			
		Иначе
			
			ПериодОкупаемости = 0;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат ПериодОкупаемости;
	
КонецФункции

// Рассчитывает финансовый показатель Индекс прибыльности (отношение приведенного денежного потока
//  к приведенной сумме выплат) по таблице периодов.
//
// Параметры:
//  ТаблицаПериодов					 - ТаблицаЗначений	 - таблица периодов, за которые необходимо рассчитать показатель.
//  СтавкаДисконтированияНаПериод	 - Число
// 
// Возвращаемое значение:
//  Соответствие - Ключ - зеркало проектной задачи, Значение - структура с ключами Предшественники и ПредшественникиПроектов
//  с массивами подготовленными для СтрСоединить в значениях.
//
Функция РассчитатьPI(ТаблицаПериодов, СтавкаДисконтированияНаПериод) Экспорт
	
	ОбщаяСуммаИнвестиций = 0;
	ОбщаяСуммаПоступлений = 0;
	ПриведеннаяСтоимостьДенежныхПотоков = 0;
	
	НачальнаяДатаРасчетаNPV = Неопределено;
	Для Каждого СтрокаПериод Из ТаблицаПериодов Цикл
		Если Не ЗначениеЗаполнено(НачальнаяДатаРасчетаNPV) Тогда
			НачальнаяДатаРасчетаNPV = СтрокаПериод.Период;
		КонецЕсли;
		
		ПозицияПериодаДляРасчетаNPV = РазностьДатВМесяцах(НачальнаяДатаРасчетаNPV, СтрокаПериод.Период);
		
		ПриведенныйДенежныйПоток = СтрокаПериод.ЧистыйДенежныйПоток * КоэффициентДисконтирования(СтавкаДисконтированияНаПериод,
			ПозицияПериодаДляРасчетаNPV);
		
		ПриведеннаяСтоимостьДенежныхПотоков = ПриведеннаяСтоимостьДенежныхПотоков + ПриведенныйДенежныйПоток;
		
		ОбщаяСуммаПоступлений = ОбщаяСуммаПоступлений + СтрокаПериод.Поступление;
		ОбщаяСуммаИнвестиций = ОбщаяСуммаИнвестиций + СтрокаПериод.Выплата;
	КонецЦикла;
	
	//Возврат ?(ОбщаяСуммаИнвестиций = 0, 0, (ОбщаяСуммаПоступлений - ПриведеннаяСтоимостьДенежныхПотоков) / ОбщаяСуммаИнвестиций);
	Возврат ?(ОбщаяСуммаИнвестиций = 0, 0, 1 + ПриведеннаяСтоимостьДенежныхПотоков / ОбщаяСуммаИнвестиций);
	
КонецФункции

// Рассчитывает финансовый показатель Ставка дисконтирования, при которой приведенная стоимость 
// всех денежных потоков = 0 по таблице периодов.
//
// Параметры:
//  ТаблицаПериодов	 - ТаблицаЗначений - таблица периодов, за которые необходимо рассчитать показатель.
//  СтавкаДисконтированияНаПериод	 - Число
// 
// Возвращаемое значение:
//  Число - значение IRR
//
Функция РассчитатьIRR(ТаблицаПериодов, СтавкаДисконтированияНаПериод) Экспорт
// Метод последовательных приближений.

	ЕстьОшибкиПериодов = ПроверитьПериодыДенежныхПотоков(ТаблицаПериодов);
		
	Если ЕстьОшибкиПериодов Тогда
		ТекстОшибки = НСтр("ru = 'Невозможно рассчитать значение внутренней ставки доходности IRR.
							|Период поступления денежных средств раньше выплаты.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат 0;
	КонецЕсли;
	
	Точность = 0.00001;
	
	ЧистыйДенежныйПоток = ТаблицаПериодов.Итог("ЧистыйДенежныйПоток");	
	Если ЧистыйДенежныйПоток <= Точность Тогда
		СтавкаДисконтированияНаПериод = СтавкаДисконтированияНаПериод * (-1);
	КонецЕсли;
	
	Даты = ТаблицаПериодов.ВыгрузитьКолонку("Период");
	Платежи = ТаблицаПериодов.ВыгрузитьКолонку("ЧистыйДенежныйПоток");
	
	Если СтавкаДисконтированияНаПериод = Неопределено Тогда
		Х0 = 0.1;
	Иначе
		Х0 = СтавкаДисконтированияНаПериод;
	КонецЕсли;
	
	ПреобразоватьВходящиеПараметрыЧИСТВНДОХ(Платежи, Даты);
	
	Если Не ПроверитьВходящиеПараметрыЧИСТВНДОХ(Платежи) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Сроки = Новый Массив;
	Для Инд = 0 По Даты.Количество() - 1 Цикл
		Сроки.Добавить((Даты[0] - Даты[Инд]) / 31536000); // В днях
	КонецЦикла;
		
	МаксИтераций = 500;
	ЧислоИтераций = 0;
	
	Пока ЧислоИтераций < МаксИтераций Цикл
		
		ПроизводнаяОтNPV = ПроизводнаяОтNPVВсего(Платежи, Сроки, Х0);
		Если ПроизводнаяОтNPV = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Х1 = Х0 - РассчитатьNPV(ТаблицаПериодов, Х0) / ПроизводнаяОтNPV;
		Ошибка = МодульЧисла(Х1 - Х0);
		Х0 = Х1;
		
		Если Ошибка <= Точность Тогда
			Возврат Х0;
		КонецЕсли;
		
		ЧислоИтераций = ЧислоИтераций + 1;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции //

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает использование набора свойств.
//
// Параметры:
//  Использование	 - Булево
//
Процедура УстановитьПараметрыНабораСвойств(Знач Использование = Неопределено) Экспорт
	
	Если Использование = Неопределено Тогда
		Использование = Константы.упоИспользоватьЗаявкиНаПроекты.Получить();
	КонецЕсли;
	
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Документ_упоЗаявкаНаПроект", 					Использование);
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Документ_упоРасчетИтоговогоБаллаПроектов", 		Использование);
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Документ_упоРегистрацияПоказателейЭффективностиПроекта",
		Использование);
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Документ_упоСоответствиеСтратегическимЦелям", 	Использование);
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Документ_упоФормированиеБизнесПлана",			Использование);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция РазностьДатВМесяцах(ДатаНачала, ДатаОкончания) Экспорт
	
	Годы = Год(ДатаОкончания) - Год(ДатаНачала);
	Месяцы = Месяц(ДатаОкончания) - Месяц(ДатаНачала);
	
	Разность = Годы * 12 + Месяцы;
	
	Возврат Разность;
	
КонецФункции 

Функция ТаблицаПериодов(ДатаНачала, ДатаОкончания, лПериодичность = "МЕСЯЦ") 
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	НоваяСтрока = ТаблицаПериодов.Добавить();	
	НоваяСтрока.Период = НачалоМесяца(ДатаНачала);		
	
	РазностьДат = РазностьДатВМесяцах(ДатаНачала, ДатаОкончания); 
	
	Если РазностьДат > 1 Тогда
		
		НачалоОтсчета = НачалоМесяца(ДатаНачала);
		
		Для Сч = 1 По РазностьДат Цикл
			НоваяСтрока = ТаблицаПериодов.Добавить();
			НоваяСтрока.Период = ДобавитьМесяц(НачалоОтсчета, Сч);
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат ТаблицаПериодов;
	
КонецФункции

Функция ДенежныйПотокПоПроектам(Проекты, Знач ДатаНачала, Знач ДатаОкончания)
	
	СписокПроектов = Новый Массив;
	Если ТипЗнч(Проекты) = Тип("СправочникСсылка.Проекты") Тогда
		СписокПроектов.Добавить(Проекты);
	Иначе
		СписокПроектов = Проекты;
	КонецЕсли;
	
	// Периодичность можно задавать динамически от периода: если больше 3 лет, то период год, иначе - месяц.
	лПериодичность = "МЕСЯЦ";
	
	ТекущиеВерсииПроектов = Новый Массив;
	Для каждого Проект Из СписокПроектов Цикл
		ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
		ТекущиеВерсииПроектов.Добавить(ТекущаяВерсия);
	КонецЦикла;
	
	ТаблицаПериодов = ТаблицаПериодов(ДатаНачала, ДатаОкончания, лПериодичность);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПериодов", ТаблицаПериодов);
	Запрос.УстановитьПараметр("Версии", ТекущиеВерсииПроектов);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДатаОкончания);
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	ТаблицаПериодов.Период КАК Период
		|ПОМЕСТИТЬ втТаблицаПериодов
		|ИЗ
		|	&ТаблицаПериодов КАК ТаблицаПериодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения, %Периодичность) КАК Период,
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
		|	СУММА(ВЫБОР
		|			КОГДА упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление)
		|				ТОГДА упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Поступление,
		|	СУММА(ВЫБОР
		|			КОГДА упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата)
		|				ТОГДА упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Выплата
		|ПОМЕСТИТЬ втДенежныеСредства
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
		|			,
		|			Версия В (&Версии)
		|				И (ДатаДвижения МЕЖДУ &НачалоПериода И &ОкончаниеПериода)) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&Версии)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ПО упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача.Проект,
		|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения, %Периодичность)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаПериодов.Период КАК Период,
		|	втДенежныеСредства.Проект КАК Проект,
		|	ЕСТЬNULL(втДенежныеСредства.Поступление, 0) КАК Поступление,
		|	ЕСТЬNULL(втДенежныеСредства.Выплата, 0) КАК Выплата,
		|	ЕСТЬNULL(втДенежныеСредства.Поступление, 0) - ЕСТЬNULL(втДенежныеСредства.Выплата, 0) КАК ЧистыйДенежныйПоток,
		|	0 КАК ПриведенныйДенежныйПоток
		|ИЗ
		|	втДенежныеСредства КАК втДенежныеСредства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаПериодов КАК втТаблицаПериодов
		|		ПО втДенежныеСредства.Период = втТаблицаПериодов.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(ЧистыйДенежныйПоток)
		|ПО
		|	Проект";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Периодичность", лПериодичность);
	
	Запрос.Текст = ТекстЗапроса;
	
	ДеревоПотоковПоПроектам = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ДеревоПотоковПоПроектам;
	
КонецФункции

// Рассчитывает значения показателей эффективности проекта.
//
// Параметры:
//  Проект             - СправочникСсылка.Проекты
//  ДатаНачала         - Дата
//  ДатаОкончания      - Дата
// 
// Возвращаемое значение:
//  Результат - Соответствие - соответствие из показателей и их рассчитанных значений.
//
Функция РассчитатьПоказателиЭффективностиПроекта(Проект, ДатаНачала, ДатаОкончания) Экспорт
	
	Результат = Новый Соответствие;
	ПоказателиМенеджер = Справочники.упоПоказателиПроектов;
	
	ПоказательСтавкаДисконтирования = Константы.упоПоказательСтавкаДисконтирования.Получить();
	
	ДеревоПотоковПоПроектам = ДенежныйПотокПоПроектам(Проект, ДатаНачала, ДатаОкончания);
	
	Для Каждого СтрокаПроект Из ДеревоПотоковПоПроектам.Строки Цикл
		
		ТаблицаПериодов = СтрокаПроект.Строки;
		
		Показатели = Новый Соответствие;
		СтавкаДисконтирования = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателя(ПоказательСтавкаДисконтирования, СтрокаПроект.Проект);
		Если СтавкаДисконтирования = Неопределено Тогда
			СтавкаДисконтирования = 0;
		КонецЕсли;
		СтавкаДисконтированияНаПериод = СтавкаДисконтированияНаПериод(СтавкаДисконтирования);	
		
		Показатели.Вставить(ПоказателиМенеджер.NPV, РассчитатьNPV(ТаблицаПериодов, СтавкаДисконтированияНаПериод));
		Показатели.Вставить(ПоказателиМенеджер.PBP, РассчитатьPBP(ТаблицаПериодов, СтавкаДисконтированияНаПериод));
		Показатели.Вставить(ПоказателиМенеджер.PI, 	РассчитатьPI(ТаблицаПериодов, СтавкаДисконтированияНаПериод));
		Показатели.Вставить(ПоказателиМенеджер.IRR, РассчитатьIRR(ТаблицаПериодов, СтавкаДисконтированияНаПериод));
		Показатели.Вставить(ПоказателиМенеджер.NCF, СтрокаПроект.ЧистыйДенежныйПоток);
		
		Результат.Вставить(СтрокаПроект.Проект, Показатели);
		
	КонецЦикла;
	
	РезультатПоПроекту = Результат.Получить(Проект);
	
	Возврат РезультатПоПроекту;
	
КонецФункции

Функция СтавкаДисконтированияНаПериод(СтавкаДисконтирования, Периодичность = "МЕСЯЦ")		
	
	СтавкаДисконтированияНаПериод = СтавкаДисконтирования;
	
	Если Периодичность = "МЕСЯЦ" Тогда
		СтавкаДисконтированияНаПериод = (Exp((Log(1 + СтавкаДисконтированияНаПериод / 100))/12) - 1) * 100;	
	КонецЕсли;	
	
	Возврат СтавкаДисконтированияНаПериод;
		
КонецФункции	

Функция ПроверитьПериодыДенежныхПотоков(ТаблицаПериодов)

	Результат = Ложь;
	
	Для Каждого СтрокаТаблицы Из ТаблицаПериодов Цикл
		
		Если СтрокаТаблицы.Поступление > 0 Тогда
			Результат = Истина;
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КоэффициентДисконтирования(СтавкаДисконтированияНаПериод, Знач НомерПериода)
	
	//Возврат 1 / Pow((1 + СтавкаДисконтированияНаПериод), НомерПериода + 1);	
	Возврат 1 / Pow((1 + СтавкаДисконтированияНаПериод / 100), НомерПериода);	
	
КонецФункции	

// Функция возвращает модуль значения.
Функция МодульЧисла(Значение)
	
	Коэффициент = ?(Значение < 0, -1 , 1);	
	Возврат Коэффициент * Значение;
	
КонецФункции // Модуль() 

Функция ПроизводнаяОтNPVВсего(Платежи, Сроки, Аргумент)
	
	Рез = 0;
	
	Для Инд = 0 По Платежи.Количество() - 1 Цикл
		Рез = Рез + ПроизводнаяОтNPV(Платежи[Инд], Сроки[Инд], Аргумент);
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

Процедура ПреобразоватьВходящиеПараметрыЧИСТВНДОХ(Платежи, Даты)
	
	Если Платежи.Количество() <> Даты.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикПлатежей = Новый ТаблицаЗначений; 
	ГрафикПлатежей.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ГрафикПлатежей.Колонки.Добавить("Сумма", РаботаСКурсамиВалют.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Любой));
	
	Для Инд = 0 По Платежи.ВГраница() Цикл
		Если Платежи[Инд] <> 0 Тогда
			НоваяСтрока = ГрафикПлатежей.Добавить();
			НоваяСтрока.Дата = Даты[Инд];
			НоваяСтрока.Сумма = Платежи[Инд];
		КонецЕсли;
	КонецЦикла;
	
	ГрафикПлатежей.Свернуть("Дата", "Сумма");
	
	Даты = ГрафикПлатежей.ВыгрузитьКолонку("Дата");
	Платежи = ГрафикПлатежей.ВыгрузитьКолонку("Сумма");
	
КонецПроцедуры

Функция ПроверитьВходящиеПараметрыЧИСТВНДОХ(Платежи)
	
	ЕстьПоложительнаяСумма = Ложь;
	ЕстьОтрицательнаяСумма = Ложь;
	
	Для Инд = 0 По Платежи.ВГраница() Цикл
		Если Не ЕстьПоложительнаяСумма И Платежи[Инд] > 0 Тогда
			ЕстьПоложительнаяСумма = Истина;
		ИначеЕсли Не ЕстьОтрицательнаяСумма И Платежи[Инд] < 0 Тогда
			ЕстьОтрицательнаяСумма = Истина;
		КонецЕсли;
		Если ЕстьПоложительнаяСумма И ЕстьОтрицательнаяСумма Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не (ЕстьПоложительнаяСумма И ЕстьОтрицательнаяСумма) Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно рассчитать приблизительную годовую ставку IRR. Проверьте корректность графика платежей: по крайней мере один платеж в графике должен быть положительный и один отрицательный.';
		|en = 'Cannot calculate an approximate yearly IRR rate. Check the correctness of the payment schedule: at least one payment in the schedule must be positive and one negative.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Возврат ЕстьПоложительнаяСумма И ЕстьОтрицательнаяСумма;
	
КонецФункции

Функция ПроизводнаяОтNPV(Платеж, Срок, Аргумент)
	
	Если Аргумент <= -1 Тогда
		Аргумент = -1 + 0.000000000001;
	КонецЕсли;
	
	Возврат Срок * Платеж * Pow((1 + Аргумент), (Срок - 1));
	
КонецФункции

#КонецОбласти 