#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда	
		Объект.ПериодРегистрации = ДобавитьМесяц(НачалоМесяца(ТекущаяДатаСеанса()), -1);
		
		// Заполнение нового документа.
		ЗначенияДляЗаполнения = Новый Структура("Организация, Ответственный",
			"Объект.Организация",
			"Объект.Ответственный");

		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	КонецЕсли;	
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцНачисленияСтрокой");	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ИКТ_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, "Кадровый учет");
	
КонецПроцедуры

#КонецОбласти

#Область ПериодРегистрации

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцНачисленияСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "МесяцНачисленияСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "МесяцНачисленияСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                      = "Файл данных (*.csv)|*.csv";
	ДиалогВыбораФайла.Заголовок                   = "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  ="csv";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	//ДиалогВыбораФайла.ПолноеИмяФайла              = Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество()>0 Тогда
		
		ЧтениеФайлаНаСервере(ВыбранныеФайлы[0]);
				
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЧтениеФайлаНаСервере(ИмяФайлаДанных)
	
	ЗаписьВДокумент(ЧтениеЗаписей(ИмяФайлаДанных));
	
КонецПроцедуры

&НаСервере
Функция ЧтениеЗаписей(ИмяФайлаДанных)
		
	Буфер = Новый Структура;
	СоотвествиеКолонок = Новый Соответствие;// файл - ТЗ
	ТЗ = СоздатьТаблицуПроходов();
	
	Сч = 1;
	Для каждого Колонка Из ТЗ.Колонки Цикл
		СоотвествиеКолонок.Вставить(Сч, Колонка.Имя);
		Сч = Сч + 1;
	КонецЦикла; 

	СодержимоеФайла = Новый ЧтениеТекста;
	СодержимоеФайла.Открыть(ИмяФайлаДанных,,,,Ложь);
	
	Периоды = СодержимоеФайла.ПрочитатьСтроку();//период
	ПериодНачало = Дата(Сред(Периоды,СтрНайти(Периоды, " c ")+3, 10)+ " 00:00:00");
	ПериодОкончание = Дата(Сред(Периоды,СтрНайти(Периоды, " по ")+4, 10)+ " 00:00:00");
	
	СодержимоеФайла.ПрочитатьСтроку();//отборы
	СодержимоеФайла.ПрочитатьСтроку();//отборы
	
	//шапка по умолчанию 4-я строка
	Шапка = СодержимоеФайла.ПрочитатьСтроку();
	МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Шапка, ";", Истина, Истина);
    
	Если МассивКолонок.Количество() <> 4 Тогда
		Сообщить("Неверный формат файла");
		Возврат	ТЗ
	КонецЕсли; 
	
	стр = СодержимоеФайла.ПрочитатьСтроку();	
	Пока стр <> Неопределено Цикл	
		
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(стр, ";", Истина, Истина);
		
		Если МассивПодстрок.Количество() <> МассивКолонок.Количество() Тогда
			Продолжить; //в тексте есть разделитель
		КонецЕсли;
				
		Для НомерСтолбца = 1 по МассивКолонок.Количество() Цикл
			//заполняем строчку значениями
			ТекущееЗначение = МассивПодстрок[НомерСтолбца-1];
			ТекущееЗначение = СтрЗаменить(ТекущееЗначение,"""",""); 

			ИмяКолонки = СоотвествиеКолонок.Получить(НомерСтолбца);
			
			Буфер.Вставить(ИмяКолонки, ТекущееЗначение);
		КонецЦикла;
		
		Если Буфер.ТабельныйНомер <> "0" Тогда
			НоваяСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Буфер);		
			
			НоваяСтрока.Вход = ?(Буфер.Вход = "Вход", Истина, Ложь);
		КонецЕсли; 
		
		стр = СодержимоеФайла.ПрочитатьСтроку();
	КонецЦикла;
	
	Возврат ТЗ 
КонецФункции

&НаСервере
Процедура ЗаписьВДокумент(ТабЗнач)
	
	Объект.ВходыВыходы.Очистить();
	ТЗСотрудников = СформироватьТЗСотрудников(ПериодНачало, ПериодОкончание);
	
	//Свертка данных
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗСотрудников.ТабельныйНомер КАК СТРОКА(4)) КАК ТабельныйНомер,
	|	ВЫРАЗИТЬ(ТЗСотрудников.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	&ТЗСотрудников КАК ТЗСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТЗ.ДатаВремя, ДЕНЬ) КАК Период,
	|	ВЫРАЗИТЬ(ТЗ.ТабельныйНомер КАК СТРОКА(4)) КАК ТабельныйНомер,
	|	ВЫРАЗИТЬ(ТЗ.ФИО КАК СТРОКА(50)) КАК ФИО,
	|	ТЗ.Вход,
	|	ТЗ.ДатаВремя КАК ДатаВремя
	|ПОМЕСТИТЬ Врем
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Врем.ТабельныйНомер
	|ПОМЕСТИТЬ РаботникиПрошлогоПериода
	|ИЗ
	|	Врем КАК Врем
	|ГДЕ
	|	Врем.Вход
	|	И Врем.ДатаВремя < ДОБАВИТЬКДАТЕ(&ПериодНачало, ЧАС, &Вход1СменаНачало)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Врем.Период КАК Период,
	|	Врем.ТабельныйНомер КАК ТабельныйНомер,
	|	Врем.ФИО,
	|	МИНИМУМ(Врем.ДатаВремя) КАК Вход
	|ПОМЕСТИТЬ ПриходНаРаботу
	|ИЗ
	|	Врем КАК Врем
	|ГДЕ
	|	Врем.Вход
	|	И Врем.ДатаВремя < ДОБАВИТЬКДАТЕ(&ПериодНачало, ЧАС, 1 + &Вход1СменаОкончание)
	|	И ЧАС(Врем.ДатаВремя) МЕЖДУ &Вход1СменаНачало И &Вход1СменаОкончание
	|	И НЕ Врем.ТабельныйНомер В
	|				(ВЫБРАТЬ
	|					РаботникиПрошлогоПериода.ТабельныйНомер
	|				ИЗ
	|					РаботникиПрошлогоПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	Врем.Период,
	|	Врем.ТабельныйНомер,
	|	Врем.ФИО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Врем.Период,
	|	Врем.ТабельныйНомер,
	|	Врем.ФИО,
	|	МИНИМУМ(Врем.ДатаВремя)
	|ИЗ
	|	Врем КАК Врем
	|ГДЕ
	|	Врем.Вход
	|	И Врем.ДатаВремя МЕЖДУ ДОБАВИТЬКДАТЕ(&ПериодНачало, ЧАС, 1 + &Вход1СменаОкончание) И &ПериодОкончание
	|	И ЧАС(Врем.ДатаВремя) МЕЖДУ &Вход1СменаНачало И &Вход1СменаОкончание
	|
	|СГРУППИРОВАТЬ ПО
	|	Врем.Период,
	|	Врем.ТабельныйНомер,
	|	Врем.ФИО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Врем.Период,
	|	Врем.ТабельныйНомер,
	|	Врем.ФИО,
	|	МИНИМУМ(Врем.ДатаВремя)
	|ИЗ
	|	Врем КАК Врем
	|ГДЕ
	|	Врем.Вход
	|	И ЧАС(Врем.ДатаВремя) МЕЖДУ &Вход2СменаНачало И &Вход2СменаОкончание
	|	И Врем.ДатаВремя < &ПериодОкончание
	|
	|СГРУППИРОВАТЬ ПО
	|	Врем.Период,
	|	Врем.ТабельныйНомер,
	|	Врем.ФИО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Врем.ТабельныйНомер,
	|	Врем.ДатаВремя КАК Выход
	|ПОМЕСТИТЬ УходСРаботы
	|ИЗ
	|	Врем КАК Врем
	|ГДЕ
	|	НЕ Врем.Вход
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходНаРаботу.Период,
	|	Сотрудники.Сотрудник,
	|	ПриходНаРаботу.ТабельныйНомер,
	|	ПриходНаРаботу.ФИО,
	|	ПриходНаРаботу.Вход КАК ПервыйВход,
	|	МАКСИМУМ(УходСРаботы.Выход) КАК ПоследнийВыход
	|ИЗ
	|	ПриходНаРаботу КАК ПриходНаРаботу
	|		ЛЕВОЕ СОЕДИНЕНИЕ УходСРаботы КАК УходСРаботы
	|		ПО ПриходНаРаботу.ТабельныйНомер = УходСРаботы.ТабельныйНомер
	|			И ПриходНаРаботу.Вход < УходСРаботы.Выход
	|			И (РАЗНОСТЬДАТ(ПриходНаРаботу.Вход, УходСРаботы.Выход, ЧАС) <= 20)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Сотрудники КАК Сотрудники
	|		ПО ПриходНаРаботу.ТабельныйНомер = Сотрудники.ТабельныйНомер
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходНаРаботу.Период,
	|	ПриходНаРаботу.ТабельныйНомер,
	|	ПриходНаРаботу.Вход,
	|	ПриходНаРаботу.ФИО,
	|	Сотрудники.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Сотрудник.Наименование,
	|	ПервыйВход";
	
	Запрос.УстановитьПараметр("ТЗ", ТабЗнач);
	Запрос.УстановитьПараметр("ТЗСотрудников", ТЗСотрудников);
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание", ПериодОкончание);
	
	Запрос.УстановитьПараметр("Вход1СменаНачало", 5); //с 5.00
	Запрос.УстановитьПараметр("Вход1СменаОкончание", 8); // до 9.00
	Запрос.УстановитьПараметр("Вход2СменаНачало", 15); //с 18.00
	Запрос.УстановитьПараметр("Вход2СменаОкончание", 20); //до 21.00
		
	ИтогТЗ = Запрос.Выполнить().Выгрузить();
	
	ТекСотрудник = "";
	Индекс = 0;
	Пока Индекс < ИтогТЗ.Количество() Цикл
		Если ТекСотрудник <> ИтогТЗ[Индекс].Сотрудник Тогда
			ТекСотрудник = ИтогТЗ[Индекс].Сотрудник;
			ПоследнийВыход = ?(ИтогТЗ[Индекс].ПоследнийВыход = NULL, Дата('00010101000000'), ИтогТЗ[Индекс].ПоследнийВыход);
		Иначе	
			Если ИтогТЗ[Индекс].ПервыйВход < ПоследнийВыход Тогда
				ИтогТЗ.Удалить(Индекс);
		        Индекс = Индекс - 1;
			Иначе	
				ПоследнийВыход = ?(ИтогТЗ[Индекс].ПоследнийВыход = NULL, Дата('00010101000000'), ИтогТЗ[Индекс].ПоследнийВыход);
			КонецЕсли; 
		КонецЕсли; 
	 	Индекс = Индекс + 1;
	КонецЦикла; 
	
	Объект.ВходыВыходы.Загрузить(ИтогТЗ);
	
КонецПроцедуры

Функция СформироватьТЗСотрудников(Начало, Окончание)
	ТЗ = Новый ТаблицаЗначений;
	Запрос = Новый Запрос;
	
	Запрос.Параметры.Вставить("Начало", Начало);
	Запрос.Параметры.Вставить("Окончание", Окончание);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляПодбораСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеДляПодбораСотрудников.Сотрудник.Код КАК ТабельныйНомер
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	|ГДЕ
	|	ДанныеДляПодбораСотрудников.Организация = &Организация
	|	И ДанныеДляПодбораСотрудников.Начало <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДанныеДляПодбораСотрудников.Начало < &Окончание
	|	И (ДанныеДляПодбораСотрудников.Окончание = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДанныеДляПодбораСотрудников.Окончание >= &Начало)";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого стр ИЗ ТЗ Цикл
		стр.ТабельныйНомер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(стр.ТабельныйНомер, Истина, Истина);
	КонецЦикла;
	
	Возврат ТЗ
КонецФункции

//&НаСервере
//Процедура ЗагрузитьИзSQLНаСервере()
//	Отказ = Ложь;
//	ADOСоединение = ИКТ_РаботаSQL.ПолучитьСоединениеСSQL();
//	
//	Если ADOСоединение = Неопределено Тогда	
//		Сообщить("Соединение не установлено");
//		Возврат ;
//	КонецЕсли; 
//	
//	Попытка
//		ADOСоединение.BeginTrans();	
//	Исключение
//		Сообщить(ОписаниеОшибки());
//	КонецПопытки; 

//	ДанныеSQL = СчитатьДанныеПоОрганизации(ADOСоединение, Отказ);
//	
//	ЗаписьВДокумент(ДанныеSQL);
//		
//	ADOСоединение.CommitTrans();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьИзSQL(Команда)
//	ЗагрузитьИзSQLНаСервере();
//КонецПроцедуры

//Функция СчитатьДанныеПоОрганизации(ADOСоединение, Отказ)
//	КС = Новый КвалификаторыСтроки(36);
//	Массив = Новый Массив;
//	Массив.Добавить(Тип("Строка"));
//	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
//	
//	ПериодНачало = НачалоМесяца(Объект.ПериодРегистрации);
//	ПериодОкончание = КонецМесяца(Объект.ПериодРегистрации)+1;
//	ТЗ = СоздатьТаблицуПроходов();
//	//ТЗ.Колонки.Добавить("УИН", ОписаниеТиповС);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ИКТ_ТурникетыОрганизацийСрезПоследних.Турникет КАК Турникет
//	|ИЗ
//	|	РегистрСведений.ИКТ_ТурникетыОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК ИКТ_ТурникетыОрганизацийСрезПоследних";
//	
//	Запрос.УстановитьПараметр("Период", ПериодОкончание - 1);
//	Запрос.УстановитьПараметр("Организация", Объект.Организация);
//	
//	Турникет = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
//	
//	Если Турникет.Количество()=0 Тогда
//		Отказ = Истина;
//		Возврат ТЗ
//	КонецЕсли;
//	 
//	ADOНаборДанных = Новый COMОбъект("ADODB.RecordSet");
//	
//	Попытка
//		ADOНаборДанных.Open(	
//		"SELECT 
//		|[ID]
//		|,[fullName]
//		|,[perNumber]
//		|,[DT]
//		//|,[Door]
//		|,[Direction]
//		|FROM [Sigur].[dbo].[Report] WHERE [DT] BETWEEN '" + формат(ПериодНачало, "ДФ=yyyy-dd-MM") + "'
//		| and '" + формат(КонецДня(ПериодОкончание), "ДФ='yyyy-dd-MM 12:00:00'") + "'
//		| and [Door] = '" + Турникет[0] + "'", ADOСоединение);
//	Исключение
//		Сообщить(ОписаниеОшибки());
//		ADOСоединение.CommitTrans();
//		Отказ = Истина;
//		Возврат ТЗ
//	КонецПопытки; 
//	 
//	Пока НЕ ADOНаборДанных.eof() Цикл
//		
//		НоваяСтрока = ТЗ.Добавить();
//		
//		//НоваяСтрока.УИН = ADOНаборДанных.Fields("ID").Value;
//		НоваяСтрока.ФИО = ADOНаборДанных.Fields("fullName").Value;
//		//НоваяСтрока.ТабельныйНомер = Прав(ADOНаборДанных.Fields("perNumber").Value, 4);		
//		НоваяСтрока.ТабельныйНомер = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ADOНаборДанных.Fields("perNumber").Value, Истина, Истина);		
//		НоваяСтрока.ДатаВремя = ADOНаборДанных.Fields("DT").Value;
//		НоваяСтрока.Вход = ?(ADOНаборДанных.Fields("Direction").Value = "IN", Истина, Ложь);
//	
//		ADOНаборДанных.MoveNext();
//	КонецЦикла;
//	
//	ADOНаборДанных.Close();
//	
//	Возврат ТЗ;
//КонецФункции

&НаСервереБезКонтекста
Функция СоздатьТаблицуПроходов()
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата");
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");

	ТаблицаПроходов = Новый ТаблицаЗначений;
	
	ТаблицаПроходов.Колонки.Добавить("ФИО", ОписаниеТиповСтрока);		
	ТаблицаПроходов.Колонки.Добавить("ТабельныйНомер", ОписаниеТиповСтрока);		
	ТаблицаПроходов.Колонки.Добавить("ДатаВремя", ОписаниеТиповДата);		
	ТаблицаПроходов.Колонки.Добавить("Вход", ОписаниеТиповБулево);

	Возврат ТаблицаПроходов;
	
КонецФункции