
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ - Булево, признак отказа от записи элемента.
// 
Процедура ПередЗаписью(Отказ)
	
	Если  ЭтотОбъект.РолиТР.Количество() > 0 И Не ЭтотОбъект.РолиТР.Итог("ПроцентРаспределения") = 100 Тогда 

		ТекстСообщения = НСтр("ru = 'Сумма процента распределения ролей должна быть равна 100%.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , , Отказ);
		
	КонецЕсли;  
	
КонецПроцедуры  

#КонецОбласти


#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли