////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с фазами проектов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Возвращает стартовую фазу проекта.
//
// Параметры:
//  Проект	 - СправочникОбъект.Проекты - Проект.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоФазыПроектов, Неопределено - Стартовая фаза. 
//
Функция ПолучитьСтартовуюФазуПроекта(Проект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Возврат Справочники.упоФазыПроектов.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоФазыПроектов.Ссылка
	               |ИЗ
	               |	Справочник.упоФазыПроектов КАК упоФазыПроектов
	               |ГДЕ
	               |	упоФазыПроектов.Стартовая И упоФазыПроектов.Владелец = &Проект";
	Запрос.УстановитьПараметр("Проект", Проект);				   
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.упоФазыПроектов.ПустаяСсылка();
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;
	КонецЕсли;
КонецФункции 

// Функция - При необходимости создает и возвращает стартовую фазу проекта.
//
// Параметры:
//  Проект	 - СправочникОбъект.Проекты - Проект.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоФазыПроектов, Неопределено - Стартовая фаза. 
//
Функция ОбновитьСтартовуюФазуПроекта(Проект) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Возврат Справочники.упоФазыПроектов.ПустаяСсылка();
	КонецЕсли;
 
	СтартоваяФазаСсылка = ПолучитьСтартовуюФазуПроекта(Проект);
	
	Если Не ЗначениеЗаполнено(СтартоваяФазаСсылка) Тогда
		
		СтартоваяФаза = Справочники.упоФазыПроектов.СоздатьЭлемент();
		СтартоваяФаза.Владелец = Проект;
		СтартоваяФаза.Наименование = НСтр("ru = 'Стартовая'");
		СтартоваяФаза.ПолноеНаименование = СтартоваяФаза.Наименование;
		СтартоваяФаза.Стартовая = Истина;
		СтартоваяФаза.Записать();
		
		СтартоваяФазаСсылка = СтартоваяФаза.Ссылка;
		
	КонецЕсли;
	
	Возврат СтартоваяФазаСсылка;
	
КонецФункции

// Функция - Проверить корректность таблицы проекта "фазы" и если нужно установить стартовую фазу.
//
// Параметры:
//  Объект	 - СправочникОбъект.Проект - Проект.
//  Отказ	 - Булево - Отказ записи.
//  Принудительно	 - Булево - Проверять даже если использование механизма отключено.
// 
Процедура ПроверитьИсправитьФазыПроекта(Объект, Отказ = Ложь, Принудительно = Ложь) Экспорт
	
	НужнаПроверка = ФазыПроектовИспользуются() ИЛИ Принудительно;
	
	Если НужнаПроверка И Объект.Фазы.Количество() Тогда
		
		СсылкаНаПроект = Объект.Ссылка;
		Если НЕ ЗначениеЗаполнено(СсылкаНаПроект) Тогда
			СсылкаНаПроект = Объект.ПолучитьСсылкуНового();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СсылкаНаПроект) Тогда
			СсылкаНаПроект = Справочники.Проекты.ПолучитьСсылку();
			Объект.УстановитьСсылкуНового(СсылкаНаПроект);
		КонецЕсли;		
		
		ФазаПервая = Объект.Фазы[0].Фаза;
		ФазаСтартовая = упоФазыПроектаСервер.ОбновитьСтартовуюФазуПроекта(СсылкаНаПроект);
		Если НЕ ФазаПервая = ФазаСтартовая Тогда
			Если ФазаПервая = Объект.упоТекущаяФаза Тогда
				Объект.упоТекущаяФаза = ФазаСтартовая;	
			КонецЕсли;
			Объект.Фазы[0].Фаза = ФазаСтартовая; 
		КонецЕсли;
		
		//
		
		Для Каждого СтрокаФазы Из Объект.Фазы Цикл
			Если СтрокаФазы.НомерСтроки = 1 Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаФазы.Фаза) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.УстановитьДанные(Объект);
				Сообщение.ПутьКДанным = "Объект.Фазы";
				Сообщение.Поле = "Фазы[" + СтрокаФазы.НомерСтроки + "].Фаза";
				ТекстСообщение = НСтр("ru = 'В таблице ""Фазы"" в строке %1 не заполнено поле ""Фаза""'");
				ТекстСообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщение, СтрокаФазы.НомерСтроки);
				Сообщение.Текст = ТекстСообщение;
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

// Функция - Фазы проектов используются
// 
// Возвращаемое значение:
//   Булево - Признак использования механизма фаз проектов.
//
Функция ФазыПроектовИспользуются() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("упоИспользоватьФазыПроектов");	
КонецФункции

#Область СхемаФазПроекта

// Схема фаз проекта.
//
// Параметры:
//  Проект						 - СправочникСсылка.Проекты	 - Проект.
//  ВходящиеПараметрыПостроения	 - Структура				 - Входящие параметры построения.
//  НадоМасштабировать			 - Булево
// 
// Возвращаемое значение:
//  ТабличныйДокумент, Неопределено - Схема фаз проекта.
//
Функция СхемаФазПроектаПоСсылке(Проект, ВходящиеПараметрыПостроения = Неопределено, НадоМасштабировать = Ложь) Экспорт
		
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;

	Возврат ПостроениеСхемыФаз(Проект, ВходящиеПараметрыПостроения, НадоМасштабировать);
	
КонецФункции 

// Схема фаз проекта.
//
// Параметры:
//  ПроектОбъект				 - СправочникОбъект.Проекты	 - Проект.
//  ВходящиеПараметрыПостроения	 - Структура				 - Входящие параметры построения.
//  НадоМасштабировать			 - Булево
// 
// Возвращаемое значение:
//  ТабличныйДокумент, Неопределено - Схема фаз проекта.
//
Функция СхемаФазПроектаПоОбъекту(ПроектОбъект, ВходящиеПараметрыПостроения = Неопределено, НадоМасштабировать = Ложь) Экспорт
	
	Возврат ПостроениеСхемыФаз(ПроектОбъект, ВходящиеПараметрыПостроения, НадоМасштабировать);
	
КонецФункции 

// Функция - Полуить базовые параметры построения.
//
// Параметры:
//  ВходящиеПараметрыПостроения - Структура - Входящие параметры построения.
// 
// Возвращаемое значение:
//  Структура - Базовые параметры построения.
//
Функция ПолучитьБазовыеПараметрыПостроения(ВходящиеПараметрыПостроения) Экспорт
	
	ОбработатьВходящиеПараметры(ВходящиеПараметрыПостроения);	
	
	ПараметрыПостроения = Новый Структура;
	Для Каждого КлючЗначение Из ВходящиеПараметрыПостроения Цикл
		ПараметрыПостроения.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
	КонецЦикла;
	
	//
	
	ДобавочныйМасштаб = ПараметрыПостроения.ДобавочныйМасштаб;
	
	ПараметрыПостроения.Вставить("СхемаФаз", Новый ТабличныйДокумент);
	
	ПараметрыПостроения.Вставить("ПустойЦвет", Новый Цвет());
	ПараметрыПостроения.Вставить("ПустаяЛиния", Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии));
	
	ПараметрыПостроения.Вставить("ОтступСверху", 1);
		
	ПараметрыПостроения.Вставить("ОтступСлева", 1);
	ПараметрыПостроения.Вставить("Шаг", 2);
	
	ПараметрыПостроения.Вставить("МаксимальнаяШиринаПоказателя", 65);
	ПараметрыПостроения.Вставить("МаксимальнаяШиринаУказателя", 50);
	
	ПараметрыПостроения.Вставить("ШиринаВехи", 15 + ДобавочныйМасштаб);
	ПараметрыПостроения.Вставить("ВысотаВехи", 15 + ДобавочныйМасштаб);
	ПараметрыПостроения.Вставить("ШиринаВехи_Мини", 5);
	ПараметрыПостроения.Вставить("ВысотаВехи_Мини", 5);
	
	ПараметрыПостроения.Вставить("ШиринаФазы", 35 + ДобавочныйМасштаб);
	ПараметрыПостроения.Вставить("ВысотаФазы", 15 + ДобавочныйМасштаб);

	ПараметрыПостроения.Вставить("МинимальнаяШиринаФигурыДляТекста", 10);
	
	ПараметрыПостроения.Вставить("ВысотаУказателяТекущей", 10);
	Если ПараметрыПостроения.ПоказыватьИсполнителейПроектныхРешений Тогда
		ПараметрыПостроения.Вставить("ВысотаПР", 8);
	Иначе
		ПараметрыПостроения.Вставить("ВысотаПР", 4);
	КонецЕсли;
	ПараметрыПостроения.Вставить("ВысотаПР_ДополнительнаяСтрока", 4);
	ПараметрыПостроения.Вставить("МаксимальнаяВысотаРП", 21);
	ПараметрыПостроения.Вставить("ВысотаПодписиНадписи", 4);
	ПараметрыПостроения.Вставить("ОтступПодписиНадписи", 1);
	
	Если ПараметрыПостроения.ВыводитьПодписьФазы Тогда
		ПараметрыПостроения.Вставить("ВысотаПодписиФазы", ПараметрыПостроения.ВысотаПодписиНадписи);
		ПараметрыПостроения.Вставить("ОтступПодписиФазы", ПараметрыПостроения.ОтступПодписиНадписи);
	Иначе
		ПараметрыПостроения.Вставить("ВысотаПодписиФазы", 0);
		ПараметрыПостроения.Вставить("ОтступПодписиФазы", 0);
	КонецЕсли;		
	Если ПараметрыПостроения.ВыводитьНадписьВехи Тогда
		ПараметрыПостроения.Вставить("ВысотаНадписиВехи", ПараметрыПостроения.ВысотаПодписиНадписи + ДобавочныйМасштаб);
		ПараметрыПостроения.Вставить("ОтступНадписиВехи", ПараметрыПостроения.ОтступПодписиНадписи);
	Иначе
		ПараметрыПостроения.Вставить("ВысотаНадписиВехи", 0);
		ПараметрыПостроения.Вставить("ОтступНадписиВехи", 0);
	КонецЕсли;	
	
	ПараметрыПостроения.Вставить("РазмерШрифтаПодписи", 8);
	ПараметрыПостроения.Вставить("РазмерШрифтаПодписиФазы", 8);
	ПараметрыПостроения.Вставить("РазмерШрифтаПР", 7);
	
	// Пока оставляем расчет длины текста через коэффициент (подобран методом тыка).
	ПараметрыПостроения.Вставить("КоэффициентШрифтаПодписиФазы", 0.7); 
	ПараметрыПостроения.Вставить("КоэффициентШрифтаПР", 0.6); 
	
	ПараметрыПостроения.Вставить("ШиринаПоказателяГотовностиПроекта", 25);
	ПараметрыПостроения.Вставить("ШиринаТаблицыПоказателей", 25);	
	ПараметрыПостроения.Вставить("РазмерШрифтаЗначенийПоказателей", 7);
	
	ПараметрыПостроения.Вставить("РазмерШрифтаНадписиПроект", 10);
	ПараметрыПостроения.Вставить("ШиринаНадписиПроект", 40);
	ПараметрыПостроения.Вставить("ОриентацияНадписиПроект", 0);
		
	ПараметрыПостроения.Вставить("ОтступПР", 1);
	
	ПараметрыПостроения.Вставить("ШиринаБлока", ПараметрыПостроения.ШиринаФазы+ПараметрыПостроения.ШиринаВехи);
	
	ПараметрыПостроения.Вставить("НачалоБлока_Y", ПараметрыПостроения.ОтступСверху + ПараметрыПостроения.ВысотаНадписиВехи +
		ПараметрыПостроения.ОтступНадписиВехи + ДобавочныйМасштаб);
	ПараметрыПостроения.Вставить("КонецБлока_Y", ПараметрыПостроения.НачалоБлока_Y + ПараметрыПостроения.ВысотаВехи + ДобавочныйМасштаб - 1);
	
	ПараметрыПостроения.Вставить("НачалоПР_Y", ПараметрыПостроения.КонецБлока_Y + ПараметрыПостроения.ОтступПодписиФазы +
		ПараметрыПостроения.ВысотаПодписиФазы + 2);
	ПараметрыПостроения.Вставить("НазваниеШрифта", "Arial");
	ПараметрыПостроения.Вставить("ЭтоВебКлиент", ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент());
	
	ЗаполнитьЗначенияСвойств(ПараметрыПостроения, ВходящиеПараметрыПостроения);
	
	Возврат ПараметрыПостроения;
	
КонецФункции 

// Функция - Получить коэффициент - значение для растягивания\сжатия базового блока на схеме фаз.
//
// Параметры:
//  Дата1				 - Дата	 - Дата начала блока.
//  Дата2				 - Дата	 - Дата окончания блока.
//  Периодичность		 - Структура - Периодичность.
//  НадоМасштабировать	 - Булево
// 
// Возвращаемое значение:
//  Число - Коэффициент.
//
Функция ПолучитьКоэффициент(Знач Дата1, Знач Дата2, Периодичность, НадоМасштабировать = Ложь) Экспорт 
	
	Дата2 = Дата2 - 24*3600;
	
	Разность =  НачалоДня(Дата2) - НачалоДня(Дата1);
	
	Если Периодичность = "Месяц" Тогда
		РазностьПериодов = 1 + упоФункцииОбщегоНазначенияКлиентСервер.РазностьДатВМесяцах(Дата2, Дата1);
		РазностьПолныхПериодов = НачалоДня(КонецМесяца(Дата2)) - НачалоМесяца(Дата1);
	ИначеЕсли Периодичность = "Квартал" Тогда
		РазностьПериодов = 1 + (Год(Дата2) - Год(Дата1)) * 4 + Число(Формат(Дата2, "ДФ=к")) - Число(Формат(Дата1, "ДФ=к"));
		РазностьПолныхПериодов = НачалоДня(КонецКвартала(Дата2)) - НачалоКвартала(Дата1);
	Иначе
		РазностьПериодов = 1 + Год(Дата2) - Год(Дата1);
		РазностьПолныхПериодов = НачалоДня(КонецГода(Дата2)) - НачалоГода(Дата1);
	КонецЕсли;
	
	Если НадоМасштабировать Тогда
		МагическийКоэффициент = 0.52; // Подогнан подбором
		РазностьПериодов = РазностьПериодов * МагическийКоэффициент;
	КонецЕсли;
	
	Отношение = Разность / РазностьПолныхПериодов;
	
	Возврат РазностьПериодов * Отношение;
	
КонецФункции

#КонецОбласти

#Область СхемаФазПроектов

// Функция - Схема фаз проектов. 
//
// Параметры:
//  вхДанные	 - Массив, ДеревоЗначений, СправочникОбъект.Проект - Проекты.
//  ВПП - Структура - Входящие параметры построения.
//  ТекстЗамечаний - Строка - Строка для вывода ошибок построения.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Схема фаз проектов.
//
Функция СхемаФазПроектов(вхДанные, ВПП, ТекстЗамечаний) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	//
	
	ТипВхДанные = ТипЗнч(вхДанные);
	
	Если ТипВхДанные = Тип("Массив") Тогда
		МассивПроектов = вхДанные;
		ДеревоПроектов = Новый ДеревоЗначений;
		ДеревоПроектов.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
		Для Каждого тПроект Из МассивПроектов Цикл
			ДеревоПроектов.Строки.Добавить().Проект = тПроект;	
		КонецЦикла;
	ИначеЕсли ТипВхДанные = Тип("ДеревоЗначений") Тогда
		МассивПроектов = ПолучитьМассивПроектовПоДереву(вхДанные);
		ДеревоПроектов = вхДанные;
	ИначеЕсли ТипВхДанные = Тип("СправочникОбъект.Проекты") Тогда
		МассивПроектов = Новый Массив;
		МассивПроектов.Добавить(вхДанные.Ссылка);
		ДеревоПроектов = Новый ДеревоЗначений;
		ДеревоПроектов.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
		ДеревоПроектов.Строки.Добавить().Проект = вхДанные.Ссылка;
		ВПП.Вставить("ПроектОбъект", вхДанные);
	Иначе
		Возврат ДокументРезультат;
	КонецЕсли;	
	
	//
	
	БазовыеПараметрыПостроения = упоФазыПроектаСервер.ПолучитьБазовыеПараметрыПостроения(ВПП);
	БПП = БазовыеПараметрыПостроения;
	
	//
	
	Если ВПП.ПоказатьПоказателиПроектов Тогда
		ВПП.Вставить("ТаблицаПоказателей", ПолучитьТаблицуПоказателей());
	КонецЕсли;
	
	//
	Если ВПП.УчитыватьСроки Тогда
		
		Сроки = ОпределитьПериодПостроения(ВПП, МассивПроектов);
		Если Сроки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		НадоМасштабировать = ПроверитьПериодПроектовИНастройкуПериодичности(Сроки, ВПП.Периодичность);
		МасштабироватьПараметрыПостроения(БПП, НадоМасштабировать);
		ФорматПериода = ФорматЗаголовковПериодов(ВПП.Периодичность, НадоМасштабировать);
		
		ТекПозицияX = 0;
		ШиринаБлока = БПП.ШиринаВехи+БПП.ШиринаФазы;
		
		Если ВПП.ПоказыватьПроектныеРешения Тогда
			ТекПозицияX = БПП.ШиринаВехи + БПП.ШиринаФазы + 1;
		Иначе
			ТекПозицияX = БПП.ШиринаВехи + 1; 
		КонецЕсли;
		Если ВПП.ПоказыватьНадписьПроект Тогда
			ТекПозицияX = ТекПозицияX + БПП.ШиринаНадписиПроект;
		КонецЕсли;
		Если ВПП.ПоказатьВыполнимостьПроекта Тогда	
			ТекПозицияX = ТекПозицияX + БПП.ШиринаПоказателяГотовностиПроекта + БПП.Шаг;
		КонецЕсли;
		Если ВПП.ПоказатьПоказателиПроектов Тогда
			ТекПозицияX = ТекПозицияX + БПП.ШиринаТаблицыПоказателей + БПП.Шаг;
		КонецЕсли;
	
		МассивКоординатПериодов = Новый Массив;
		МассивКоординатПериодов.Добавить(ТекПозицияX);
		
		ТекДата = Сроки.НачалоПериода; 
		ПредДата = Неопределено;
		ПозицияX_ТекДень = Неопределено;
		
		Сегодня = ТекущаяДатаСеанса();
		
		Пока ТекДата <= Сроки.КонецПериода Цикл
			
			ДобавитьНадписьПериод(ДокументРезультат, ТекПозицияX, ШиринаБлока, Формат(ТекДата, ФорматПериода), БПП);
			
			ПредДата = ТекДата;
			
			//
			
			Если ВПП.Периодичность = "Месяц" Тогда
				ТекДата = ДобавитьМесяц(ТекДата, 1);
			ИначеЕсли ВПП.Периодичность = "Квартал" Тогда
				ТекДата = ДобавитьМесяц(ТекДата, 3);
			Иначе
				ТекДата = ДобавитьМесяц(ТекДата, 12);
			КонецЕсли;
			МассивКоординатПериодов.Добавить(ТекПозицияX); 
			
			//
			
			Если ТекДата >= Сегодня И ПредДата <= Сегодня Тогда
				Коэф = упоФазыПроектаСервер.ПолучитьКоэффициент(ПредДата, Сегодня, ВПП.Периодичность, НадоМасштабировать);
				ПозицияX_ТекДень = ТекПозицияX + ШиринаБлока * (Коэф-1); 
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	//
	
	ДобавитьФазуПроектаРекурсивно(ДокументРезультат, ВПП, ДеревоПроектов, ТекстЗамечаний, НадоМасштабировать);
	
	//
	
	Если ВПП.УчитыватьСроки Тогда
		ПостроитьЛинииПериодов(ДокументРезультат, МассивКоординатПериодов, ПозицияX_ТекДень);
	КонецЕсли;
	
	//

	Возврат ДокументРезультат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СхемаФазПроекта

Функция ПостроениеСхемыФаз(ДанныеПроекта, ВходящиеПараметрыПостроения, НадоМасштабировать)
	
	БазовыеПараметрыПостроения = ПолучитьБазовыеПараметрыПостроения(ВходящиеПараметрыПостроения);
	БПП = БазовыеПараметрыПостроения;
	
	ПеременныеПараметрыПостроения = Новый Структура();
	ППП = ПеременныеПараметрыПостроения;
	ППП.Вставить("КоэфПериода");
	ППП.Вставить("ШиринаБлока");
	ППП.Вставить("ШиринаВехи");
	ППП.Вставить("ШиринаФазы");
	ППП.Вставить("ТекНачалоX_Веха");
	ППП.Вставить("ТекКонецX_Веха");
	ППП.Вставить("ТекНачалоX_Фаза");
	ППП.Вставить("ТекКонецX_Фаза");	
	ППП.Вставить("ТекПозицияY_ПР");
	ППП.Вставить("НачальнаяПозицияY_ПР", БПП.НачалоПР_Y);
	ППП.Вставить("МаксимальнаяВысотаПР", БПП.НачалоПР_Y);	
	ППП.Вставить("МаксимальнаяВысотаY", ППП.МаксимальнаяВысотаПР);		
	ППП.Вставить("ТекНачалоX", БПП.ОтступСлева);
	ППП.Вставить("ТекКонецX", ППП.ТекНачалоX);
	
	ДанныеПостроения = ПолучитьДанныеПостроения(ДанныеПроекта, БПП, НадоМасштабировать);
	ТаблицаПостроения = ДанныеПостроения.ТаблицаПостроения;
	ВходящиеПараметрыПостроения.Вставить("ВехиБезДат", ДанныеПостроения.ВехиБезДат);
	ВходящиеПараметрыПостроения.Вставить("ВехиНеПоПорядку", ДанныеПостроения.ВехиНеПоПорядку);

	Если ТаблицаПостроения.Количество() = 0 И БПП.ПропускатьПроектыБезФаз Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ППП, БПП);
	
	Если БПП.ПоказыватьНадписьПроект Тогда
		ППП.ТекКонецX = ППП.ТекКонецX + БПП.ШиринаНадписиПроект;				
	КонецЕсли;
	Если БПП.ПоказатьПоказателиПроектов Тогда
		ППП.Вставить("ПозицияX_ПоказателиПроекта", ППП.ТекКонецX);
		ППП.ТекКонецX = ППП.ТекКонецX + БПП.ШиринаТаблицыПоказателей + БПП.Шаг;		
	КонецЕсли;	
	Если БПП.ПоказатьВыполнимостьПроекта Тогда	
		ППП.Вставить("ПозицияX_ПоказательГотовностиПроекта", ППП.ТекКонецX);
		ППП.ТекКонецX = ППП.ТекКонецX + БПП.ШиринаПоказателяГотовностиПроекта + БПП.Шаг;		
	КонецЕсли;	
	
	
	Для Каждого СтрокаДанных Из ТаблицаПостроения Цикл
		
		Если БПП.УчитыватьСроки Тогда     
			
			Если СтрокаДанных.Первая Тогда
				Коэф = ПолучитьКоэффициент(БПП.НачалоПериода, СтрокаДанных.ТекДата, БПП.Периодичность, НадоМасштабировать);
				ОтступПервого = Коэф * (БПП.ШиринаВехи + БПП.ШиринаФазы);
				ППП.ТекКонецX = ППП.ТекКонецX + ОтступПервого;
			КонецЕсли;
			
		КонецЕсли;
		
		//
		СтрокаДанных.ШиринаВехи = ?(БПП.ВыводитьВоротаКачества, БПП.ШиринаВехи, БПП.ШиринаВехи_Мини);
		
		РисоватьФазу = НЕ СтрокаДанных.Первая;
		
		Если СтрокаДанных.Первая И НЕ СтрокаДанных.ДелатьПолныйОтступ Тогда			
			СтрокаДанных.ШиринаФазы = 0;
			СтрокаДанных.ШиринаБлока = БПП.ШиринаВехи; 	
		Иначе
			СтрокаДанных.ШиринаБлока = БПП.ШиринаБлока*СтрокаДанных.КоэфПериода; 				
			СтрокаДанных.ШиринаБлока = Макс(СтрокаДанных.ШиринаБлока, 1);
			Если СтрокаДанных.ШиринаБлока <= СтрокаДанных.ШиринаВехи Тогда
				СтрокаДанных.ШиринаФазы = 0;
				РисоватьФазу = Ложь;
			Иначе
				СтрокаДанных.ШиринаФазы = СтрокаДанных.ШиринаБлока - СтрокаДанных.ШиринаВехи;
			КонецЕсли;							
		КонецЕсли;	
		
		СтрокаДанных.ТекНачалоX = ППП.ТекКонецX + 1;
		СтрокаДанных.ТекКонецX = СтрокаДанных.ТекНачалоX + СтрокаДанных.ШиринаБлока - 1; 
		
		Если СтрокаДанных.Первая И НЕ СтрокаДанных.ДелатьПолныйОтступ Тогда	
			СтрокаДанных.ТекНачалоX_Веха = СтрокаДанных.ТекНачалоX;
			СтрокаДанных.ТекКонецX_Веха = СтрокаДанных.ТекНачалоX_Веха + СтрокаДанных.ШиринаВехи - 1;
		Иначе 
			СтрокаДанных.ТекНачалоX_Фаза = СтрокаДанных.ТекНачалоX;
			СтрокаДанных.ТекКонецX_Фаза = Макс(СтрокаДанных.ТекНачалоX_Фаза + СтрокаДанных.ШиринаФазы - 1, СтрокаДанных.ТекНачалоX_Фаза);
			
			СтрокаДанных.ТекКонецX_Веха = СтрокаДанных.ТекКонецX;	
			СтрокаДанных.ТекНачалоX_Веха = СтрокаДанных.ТекКонецX_Веха - СтрокаДанных.ШиринаВехи + 1;
		КонецЕсли;
		
		//
		
		ЗаполнитьЗначенияСвойств(ППП, СтрокаДанных);
		
		Если РисоватьФазу Тогда
			НаименованиеФазы = упоФункцииБСП.ПодставитьПараметрыВСтроку("%1. %2", Строка(СтрокаДанных.НомерСтроки), СтрокаДанных.Фаза.Наименование);
			ДобавитьФазу(БПП, ППП, НаименованиеФазы, СтрокаДанных.Фаза, СтрокаДанных.Состояние);
		КонецЕсли;
		
		Если БПП.ВыводитьВоротаКачества Тогда
			ТекстВехи = СтрокаДанных.ВидОперации;
			Если ТипЗнч(СтрокаДанных.ВидОперации) = Тип("СправочникСсылка.упоВидыОпераций") И НЕ ПустаяСтрока(СтрокаДанных.ВидОперации.НаименованиеВоротКачества) Тогда
				ТекстВехи = СтрокаДанных.ВидОперации.НаименованиеВоротКачества;
			КонецЕсли;
		Иначе
			ТекстВехи = "";
		КонецЕсли;	
		
		ДобавитьВеху(БПП, ППП, ТекстВехи, СтрокаДанных.ПЗВехи, СтрокаДанных.Состояние);
																									
	КонецЦикла;
	
	Сч = 0;
	КоличествоСтрок = ТаблицаПостроения.Количество();
	ПППСледующий = Новый Структура;
	Для Каждого ЭлементСтруктуры Из ППП Цикл
  		ПППСледующий.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ТаблицаПостроения Цикл
		
		ЗаполнитьЗначенияСвойств(ППП, СтрокаДанных);
		
		Если БПП.ВыводитьПодписьФазы Тогда
			ДобавитьПодписьФазы(БПП, ППП, СтрокаДанных.Фаза, СтрокаДанных.ТекстНадписиФазы);
		КонецЕсли;
		Если БПП.ВыводитьНадписьВехи Тогда
			Сч = Сч + 1;
			Если Сч = КоличествоСтрок Тогда 
				ПППСледующий = Неопределено;
			Иначе	
				ЗаполнитьЗначенияСвойств(ПППСледующий, ТаблицаПостроения[Сч]);
			КонецЕсли;
			НаименованиеВехи = упоФункцииБСП.ПодставитьПараметрыВСтроку("%1. %2", 
																		Строка(СтрокаДанных.НомерСтроки), 
																		СтрокаДанных.ТекстПодписиВехи);
			ДобавитьНадписьВехи(БПП, ППП, ПППСледующий, СтрокаДанных.ПЗВехи, НаименованиеВехи);
		КонецЕсли;
		
	КонецЦикла;
	
	Если БПП.ПоказыватьПроектныеРешения Тогда
		
		Для Каждого СтрокаДанных Из ТаблицаПостроения Цикл	
			
			ЗаполнитьЗначенияСвойств(ППП, СтрокаДанных);			
			ППП.Вставить("ТекПозицияY_ПР", ППП.НачальнаяПозицияY_ПР);
			
			ДобавитьВсеПРВехи(БПП, ППП, СтрокаДанных.ТаблицаПР, СтрокаДанных.Первая);
			
			ППП.МаксимальнаяВысотаПР = Макс(ППП.МаксимальнаяВысотаПР, ППП.ТекПозицияY_ПР);	
			ППП.МаксимальнаяВысотаY = Макс(ППП.МаксимальнаяВысотаY, ППП.МаксимальнаяВысотаПР);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	МаксимальнаяВысотаПР_ПередПостроениемИндикаторов = ППП.МаксимальнаяВысотаПР;
	
	Если БПП.ПоказыватьИндикаторы Тогда
		
		Для Каждого СтрокаДанных Из ТаблицаПостроения Цикл	
			
			ЗаполнитьЗначенияСвойств(ППП, СтрокаДанных);
			ППП.Вставить("ТекПозицияY_ПР", МаксимальнаяВысотаПР_ПередПостроениемИндикаторов);
			
			Если Не СтрокаДанных.Первая Тогда
				ДобавитьПоказатель(БПП, ППП, СтрокаДанных.ПЗВехи, СтрокаДанных.ДанныеИндикатора);
			КонецЕсли;
			
			ППП.МаксимальнаяВысотаПР = Макс(ППП.МаксимальнаяВысотаПР, ППП.ТекПозицияY_ПР);
			ППП.МаксимальнаяВысотаY = Макс(ППП.МаксимальнаяВысотаY, ППП.МаксимальнаяВысотаПР);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Для Каждого СтрокаДанных Из ТаблицаПостроения Цикл
		
		ЗаполнитьЗначенияСвойств(ППП, СтрокаДанных);
		ДобавитьРазделительнуюЛинию(БПП, ППП, МаксимальнаяВысотаПР_ПередПостроениемИндикаторов);
		
		Если СтрокаДанных.ТекущаяФаза Тогда
			ДобавитьПодчеркиваниеТекущей(БПП, ППП);
		КонецЕсли;
		
	КонецЦикла;
	
	Если БПП.ПоказыватьНадписьПроект Тогда
		ДобавитьНадписьПроект(БПП, ППП, ДанныеПроекта.Ссылка);
	КонецЕсли;
	
	Если БПП.ПоказатьВыполнимостьПроекта Тогда	
		ДобавитьПоказательГотовностиПроекта(БПП, ППП, ДанныеПостроения.ПроцентГотовностиПроекта);
	КонецЕсли;
	
	Если БПП.ПоказатьПоказателиПроектов Тогда
		ДобавитьЗначенияПоказателей(БПП, ППП, ДанныеПостроения.ЗначенияПоказателей);
	КонецЕсли;
	
	Возврат БПП.СхемаФаз;
	
КонецФункции

Процедура ДобавитьЗначенияПоказателей(БПП, ППП, ЗначенияПоказателей)
	
	Если ЗначенияПоказателей = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекстПоказателей = "";
	
	Для Каждого СтрокаЗначений Из ЗначенияПоказателей Цикл
		ТекстПоказателей = ТекстПоказателей + ?(ЗначениеЗаполнено(ТекстПоказателей), Символы.ПС, "") +
		СтрокаЗначений.НаименованиеПоказателя + ": " + СтрокаЗначений.ФорматЗначениеПоказателя; 	
	КонецЦикла;	
	
	Надпись = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Надпись.Ширина = БПП.ШиринаТаблицыПоказателей;
	Надпись.Верх = 1;
	Надпись.Высота = ППП.МаксимальнаяВысотаY - Надпись.Верх - 1;	
	Надпись.Лево = ППП.ПозицияX_ПоказателиПроекта;	
	Надпись.Текст = ТекстПоказателей;
	Надпись.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
	Надпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	Надпись.ЦветФона = БПП.ПустойЦвет;
	Надпись.Узор = ТипУзораТабличногоДокумента.БезУзора;	
	Надпись.Линия = БПП.ПустаяЛиния;
	Надпись.ОриентацияТекста = БПП.ОриентацияНадписиПроект;
	Надпись.Расшифровка = ТекстПоказателей;
	Надпись.ЦветТекста = WebЦвета.Черный;
	Надпись.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, БПП.РазмерШрифтаЗначенийПоказателей);

КонецПроцедуры 

Функция ОбработатьВходящиеПараметры(ВходящиеПараметры)
	
	ПоУмолчанию = Новый Структура;
	ПоУмолчанию.Вставить("ПоказыватьИндикаторы", Истина);
	ПоУмолчанию.Вставить("ПоказыватьПроектныеРешения", Истина);
	ПоУмолчанию.Вставить("ПоказыватьСтрелкуТекущей", Истина);
	ПоУмолчанию.Вставить("ПропускатьПроектыБезФаз", Истина);
	ПоУмолчанию.Вставить("ПоказыватьНадписьПроект", Ложь);
	ПоУмолчанию.Вставить("УчитыватьСроки", Ложь);
	ПоУмолчанию.Вставить("ВыводитьВоротаКачества", Истина);
	ПоУмолчанию.Вставить("ВыводитьПодписьФазы", Истина);
	ПоУмолчанию.Вставить("ВыводитьНадписьВехи", Истина);
	ПоУмолчанию.Вставить("ПоказатьВыполнимостьПроекта", Ложь);
	ПоУмолчанию.Вставить("ВидВыполнимостиПроекта", "Круговой");
	ПоУмолчанию.Вставить("ПоказатьПоказателиПроектов", Ложь);
	ПоУмолчанию.Вставить("ПоказыватьГруппировки", Ложь);
	ПоУмолчанию.Вставить("Периодичность", "Год");
	ПоУмолчанию.Вставить("ПоказыватьИсполнителейПроектныхРешений", Ложь);
	ПоУмолчанию.Вставить("КоэффициентМасштабаСхемы", 1);
	ПоУмолчанию.Вставить("ДобавочныйМасштаб", 0);
	
	Если ТипЗнч(ВходящиеПараметры) <> Тип("Структура") Тогда
		ВходящиеПараметры = Новый Структура;		
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ПоУмолчанию Цикл
		Если НЕ ВходящиеПараметры.Свойство(КлючИЗначение.Ключ)  Тогда
			ВходящиеПараметры.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);	
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьДанныеПостроения(ДанныеПроекта, БПП, НадоМасштабировать)
	
	Результат = Новый Структура("ТаблицаПостроения, ПроцентГотовностиПроекта, ЗначенияПоказателей", Новый ТаблицаЗначений);
	Результат.Вставить("ВехиБезДат", Ложь);
	Результат.Вставить("ВехиНеПоПорядку", Ложь);

	Если БПП.Свойство("ПроектОбъект") Тогда
		Результат.ТаблицаПостроения = БПП.ПроектОбъект.Фазы.Выгрузить();
	ИначеЕсли ТипЗнч(ДанныеПроекта.Фазы) = Тип("ТаблицаЗначений") Тогда
		Результат.ТаблицаПостроения = ДанныеПроекта.Фазы.Скопировать();
	Иначе
		Результат.ТаблицаПостроения = ДанныеПроекта.Фазы.Выгрузить();
	КонецЕсли;
	
	Если Результат.ТаблицаПостроения.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;	
	
	ДанныеИБ = ПолучитьДанныеИБ(ДанныеПроекта, БПП, Результат.ТаблицаПостроения);
	Результат.ПроцентГотовностиПроекта = ДанныеИБ.ПроцентГотовности;	
	
	Результат.ТаблицаПостроения.Колонки.Добавить("ПЗВехи");
	Результат.ТаблицаПостроения.Колонки.Добавить("ВидОперации");
	Результат.ТаблицаПостроения.Колонки.Добавить("Первая", Новый ОписаниеТипов("Булево"));
	Результат.ТаблицаПостроения.Колонки.Добавить("Состояние");
	Результат.ТаблицаПостроения.Колонки.Добавить("КоэфПериода");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекНачалоX");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекКонецX");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекНачалоX_Веха");	
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекКонецX_Веха");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекНачалоX_Фаза");	
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекКонецX_Фаза");		
	Результат.ТаблицаПостроения.Колонки.Добавить("ШиринаВехи");
	Результат.ТаблицаПостроения.Колонки.Добавить("ШиринаФазы");
	Результат.ТаблицаПостроения.Колонки.Добавить("ШиринаБлока");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекстПодписиВехи");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекстНадписиФазы");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекущаяФаза", Новый ОписаниеТипов("Булево"));
	Результат.ТаблицаПостроения.Колонки.Добавить("ДелатьПолныйОтступ", Новый ОписаниеТипов("Булево"));
	Результат.ТаблицаПостроения.Колонки.Добавить("ДанныеИндикатора");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТаблицаПР");
	Результат.ТаблицаПостроения.Колонки.Добавить("ПредДата");
	Результат.ТаблицаПостроения.Колонки.Добавить("ТекДата");
			
	Если БПП.ПоказатьПоказателиПроектов Тогда
		Результат.ЗначенияПоказателей = ДанныеИБ.ЗначенияПоказателей;
	КонецЕсли;	
	
	Если БПП.УчитыватьСроки Тогда
		
		СтрокиКУдалению = Новый Массив;
		Для Каждого СтрокаДанных Из Результат.ТаблицаПостроения Цикл
			СрокВехи = ДанныеИБ.СрокиВех.Найти(СтрокаДанных.ВехаЗеркало, "ВехаЗеркало");
			Если СрокВехи <> Неопределено И ЗначениеЗаполнено(СрокВехи.ДатаВехи) Тогда
				СтрокаДанных.ТекДата = СрокВехи.ДатаВехи;	
			Иначе
				Результат.ВехиБезДат = Истина;	
				СтрокиКУдалению.Добавить(СтрокаДанных);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			Результат.ТаблицаПостроения.Удалить(СтрокаКУдалению);	
		КонецЦикла;
		Результат.ТаблицаПостроения.Сортировать("ТекДата Возр");		
		
		ПредДата = Неопределено;
		сч = 1;
		Для Каждого СтрокаДанных Из Результат.ТаблицаПостроения Цикл
			Если СтрокаДанных.НомерСтроки <> сч Тогда
				Результат.ВехиНеПоПорядку = Истина;
			КонецЕсли;
			СтрокаДанных.ПредДата = ПредДата;
			ПредДата = СтрокаДанных.ТекДата;
			сч = сч + 1;
		КонецЦикла;
		
	КонецЕсли;
		
	БылаТекущая = Ложь;
	ПерваяСтрока = Истина;	
	Для Каждого СтрокаДанных Из Результат.ТаблицаПостроения Цикл
		
		Если БПП.УчитыватьСроки Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаДанных.ПредДата) ИЛИ НЕ ЗначениеЗаполнено(СтрокаДанных.ТекДата) Тогда
				СтрокаДанных.КоэфПериода = 1;	
			Иначе
				СтрокаДанных.КоэфПериода = ПолучитьКоэффициент(СтрокаДанных.ПредДата, 
					СтрокаДанных.ТекДата, 
					БПП.Периодичность, 
					НадоМасштабировать);
			КонецЕсли;
		Иначе
			СтрокаДанных.КоэфПериода = 1;
		КонецЕсли;
		
		СтрокаДанных.Первая = ПерваяСтрока;
		
		Если БылаТекущая Тогда 
			СтрокаДанных.Состояние = 3;		
		ИначеЕсли СтрокаДанных.Фаза = ДанныеПроекта.упоТекущаяФаза И (ЗначениеЗаполнено(СтрокаДанных.Фаза) ИЛИ СтрокаДанных.НомерСтроки = 1) Тогда
			СтрокаДанных.Состояние = 2;
			СтрокаДанных.ТекущаяФаза = Истина;
			БылаТекущая = Истина;
		Иначе
			СтрокаДанных.Состояние = 1;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВехаЗеркало) Тогда	
			
			ДанныеПЗ = ДанныеИБ.СвойстваПЗ.Найти(СтрокаДанных.ВехаЗеркало, "ВехаЗеркало"); 
			
			СтрокаДанных.ПЗВехи = ДанныеПЗ.ПЗВехи;
			СтрокаДанных.ТекстПодписиВехи = ДанныеПЗ.НазваниеЗадачи;
			СтрокаДанных.ВидОперации = ДанныеПЗ.ВидОперации;	
			
			ПараметрыОтбора = Новый Структура("Веха", СтрокаДанных.ВехаЗеркало);
			СтрокаДанных.ДанныеИндикатора = ДанныеИБ.ДанныеИндикатора.Скопировать(ПараметрыОтбора, 
																 "Индикатор, ЗначениеИндикатора");			
			ТаблицаПР = ДанныеИБ.ТаблицаПР.Скопировать(Новый Структура("ПроектнаяЗадача", СтрокаДанных.ВехаЗеркало));
			СтрокаДанных.ТаблицаПР = ТаблицаПР;
			
			Если (СтрокаДанных.ДанныеИндикатора.Количество() И НЕ ПерваяСтрока) ИЛИ ТаблицаПР.Количество() Тогда
				СтрокаДанных.ДелатьПолныйОтступ = Истина;
			КонецЕсли;
			
		Иначе		
			СтрокаДанных.ПЗВехи = ПредопределенноеЗначение("Документ.упоПроектнаяЗадача.ПустаяСсылка");
			Если ПерваяСтрока Тогда
				СтрокаДанных.ТекстПодписиВехи = НСтр("ru = 'Старт'");
				СтрокаДанных.ВидОперации = НСтр("ru = 'Старт'");
			Иначе
				СтрокаДанных.ТекстПодписиВехи = "";
				СтрокаДанных.ВидОперации = "-";
			КонецЕсли;		
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрокаДанных.Фаза) И НЕ СтрокаДанных.НомерСтроки = 1 Тогда
			ДанныеФазы = ДанныеИБ.СвойстваФаз.Найти(СтрокаДанных.Фаза, "Фаза");
			НаименованиеФазы = ДанныеФазы.Наименование;
			СтрокаДанных.ТекстНадписиФазы = ДанныеФазы.ПолноеНаименование;		 
		КонецЕсли;	
		
		ПерваяСтрока = Ложь;
				
	КонецЦикла;	
	
	Если НЕ БылаТекущая Тогда
		Для Каждого СтрокаДанных Из Результат.ТаблицаПостроения Цикл	
			СтрокаДанных.Состояние = 3;		
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьДанныеИБ(ДанныеПроекта, БПП, ТаблицаФазыПроекта)
	
	Проект = ДанныеПроекта.Ссылка;
	
	Индикатор = ДанныеПроекта.упоОсновнойИндикаторПоФазе;
	
	ТЗВех = ТаблицаФазыПроекта.Скопировать(, "ВехаЗеркало");
	ТЗВех.Свернуть("ВехаЗеркало");
	МассивВех = ТЗВех.ВыгрузитьКолонку("ВехаЗеркало");
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивВех, Справочники.Проекты.ПустаяСсылка());
	
	ТЗФаз = ТаблицаФазыПроекта.Скопировать(, "Фаза");
	ТЗФаз.Свернуть("Фаза");
	МассивФаз = ТЗФаз.ВыгрузитьКолонку("Фаза");
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивФаз, 
		Справочники.упоФазыПроектов.ПустаяСсылка());
	
	Пакет = Новый Запрос;
	
	Пакет.УстановитьПараметр("Вехи", МассивВех);
	Пакет.УстановитьПараметр("Фазы", МассивФаз);
	Пакет.УстановитьПараметр("Проект", Проект);
	Пакет.УстановитьПараметр("ТекущаяВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	Пакет.УстановитьПараметр("ПоказыватьПроектныеРешения", БПП.ПоказыватьПроектныеРешения);
	Пакет.УстановитьПараметр("Индикатор", Индикатор);
	
	Пакет.Текст = ТекстЗапросаФазы(БПП);
	
	РезультатПакета = Пакет.ВыполнитьПакет();
	
	ТаблицаПР = РезультатПакета[1].Выгрузить();
	СвойстваПЗ = РезультатПакета[2].Выгрузить();
	СвойстваФаз = РезультатПакета[3].Выгрузить();
	СрокиВех = РезультатПакета[5].Выгрузить();
	Если БПП.ПоказатьВыполнимостьПроекта Тогда
		ПроцентГотовности = РезультатПакета[6].Выгрузить()[0].ПроцентГотовности;
	Иначе
		ПроцентГотовности = Неопределено;
	КонецЕсли;
	
	ДанныеИндикатора = Новый ТаблицаЗначений;
	ДанныеИндикатора.Колонки.Добавить("ЗначениеИндикатора");
	ДанныеИндикатора.Колонки.Добавить("Веха");
	ДанныеИндикатора.Колонки.Добавить("Индикатор");
	
	Если БПП.ПоказыватьИндикаторы И ЗначениеЗаполнено(Индикатор) Тогда
		
		Индикаторы = Новый Массив;
		Индикаторы.Добавить(Индикатор);
		ЗначенияПоказателяВех = упоПоказателиПроектовСервер.ПолучитьЗначенияПоказателей(Индикаторы, МассивВех);
		
		Для Каждого СтрокаСвойств Из СвойстваПЗ Цикл
			
			Объект = СтрокаСвойств.ВехаЗеркало;
			
			ЗначениеПоказателя = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателяВех, Индикатор, Объект);
			
			Если ТипЗнч(ЗначениеПоказателя) <> Тип("Число") Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеПоказателя > 100 Тогда
				ЗначениеПоказателя = 100;
			ИначеЕсли ЗначениеПоказателя < 0 Тогда
				ЗначениеПоказателя = 0;
			КонецЕсли;
			Если ЗначениеПоказателя <> Неопределено Тогда
				НоваяСтрока = ДанныеИндикатора.Добавить();
				НоваяСтрока.ЗначениеИндикатора = ЗначениеПоказателя; 
				НоваяСтрока.Индикатор = Индикатор; 
				НоваяСтрока.Веха = СтрокаСвойств.ВехаЗеркало; 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	
	Если БПП.ПоказатьПоказателиПроектов Тогда
		СтруктураДанных.Вставить("ЗначенияПоказателей", ПолучитьЗначенияПоказателей(Проект, БПП.ТаблицаПоказателей));
	КонецЕсли;
	
	СтруктураДанных.Вставить("ТаблицаПР", ТаблицаПР);
	СтруктураДанных.Вставить("ДанныеИндикатора", ДанныеИндикатора);
	СтруктураДанных.Вставить("СвойстваПЗ", СвойстваПЗ);
	СтруктураДанных.Вставить("СвойстваФаз", СвойстваФаз);
	СтруктураДанных.Вставить("СрокиВех", СрокиВех);
	СтруктураДанных.Вставить("ПроцентГотовности", ПроцентГотовности);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ТекстЗапросаФазы(ПараметрыТекста)
	
	ТекстыЗапроса = Новый Массив;
	
	ТекстыЗапроса.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	упоЗадания.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	упоЗадания.Ссылка КАК ПР,
	                       |	упоЗадания.Исполнитель КАК Исполнитель,
	                       |	упоСрокиЗаданий.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	                       |	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус,
	                       |	упоЗадания.ЭтоОсновноеЗаданиеПроектнойЗадачи КАК Основное,
	                       |	упоСрокиЗаданий.ДатаНачалаПлан КАК ДатаНачалаПлан
	                       |ПОМЕСТИТЬ Задания
	                       |ИЗ
	                       |	Справочник.упоЗадания КАК упоЗадания
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних(, &ПоказыватьПроектныеРешения) КАК упоЗаданияСтатусыСрезПоследних
	                       |		ПО (упоЗаданияСтатусыСрезПоследних.Задание = упоЗадания.Ссылка)
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	                       |		ПО упоЗадания.Ссылка = упоСрокиЗаданий.Задание
	                       |ГДЕ
	                       |	&ПоказыватьПроектныеРешения
	                       |	И упоЗадания.ПроектнаяЗадача В(&Вехи)
	                       |	И упоЗадания.ВидЗадания = ЗНАЧЕНИЕ(Справочник.упоВидыЗаданий.ПроектноеРешение)
	                       |	И НЕ упоЗадания.ПометкаУдаления
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	Задания.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	Задания.ПР КАК ПР,
	                       |	Задания.Исполнитель КАК Исполнитель,
	                       |	Задания.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	                       |	Задания.Статус КАК Статус,
	                       |	Задания.Основное КАК Основное,
	                       |	ЕСТЬNULL(Статусы.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияФакт,
	                       |	Задания.ДатаНачалаПлан КАК ДатаНачалаПлан
	                       |ИЗ
	                       |	Задания КАК Задания
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
	                       |				,
	                       |				&ПоказыватьПроектныеРешения
	                       |					И Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Завершено)) КАК Статусы
	                       |		ПО Задания.ПР = Статусы.Задание
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	ДатаНачалаПлан");
	
	ТекстыЗапроса.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПЗВехи,
	                       |	Свойства.ВидОперации КАК ВидОперации,
	                       |	Свойства.НазваниеЗадачи КАК НазваниеЗадачи,
	                       |	Проекты.Ссылка КАК ВехаЗеркало,
	                       |	Свойства.ЗадачаРодитель КАК Этап,
	                       |	ПроектыРодители.Ссылка КАК ЭтапЗеркало
	                       |ИЗ
	                       |	Справочник.Проекты КАК Проекты
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК Свойства
	                       |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК ПроектыРодители
	                       |			ПО Свойства.ЗадачаРодитель = ПроектыРодители.СсылкаНаПроектнуюЗадачу
	                       |				И (Свойства.ЗадачаРодитель <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка))
	                       |		ПО Проекты.СсылкаНаПроектнуюЗадачу = Свойства.ПроектнаяЗадача
	                       |ГДЕ
	                       |	Проекты.Ссылка В(&Вехи)");
	
	ТекстыЗапроса.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	упоФазыПроектов.Наименование КАК Наименование,
	                       |	упоФазыПроектов.Ссылка КАК Фаза,
	                       |	упоФазыПроектов.ПолноеНаименование КАК ПолноеНаименование
	                       |ИЗ
	                       |	Справочник.упоФазыПроектов КАК упоФазыПроектов
	                       |ГДЕ
	                       |	упоФазыПроектов.Ссылка В(&Фазы)");
	
	ТекстыЗапроса.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
	                       |	Проекты.Ссылка КАК Зеркало
	                       |ПОМЕСТИТЬ ПроектныеЗадачи
	                       |ИЗ
	                       |	Справочник.Проекты КАК Проекты
	                       |ГДЕ
	                       |	НЕ Проекты.ПометкаУдаления
	                       |	И Проекты.Ссылка В(&Вехи)
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаВехи,
	                       |	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ВехаДокумент,
	                       |	ПроектныеЗадачи.Зеркало КАК ВехаЗеркало
	                       |ИЗ
	                       |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	                       |			,
	                       |			Версия = &ТекущаяВерсия
	                       |				И ПроектнаяЗадача В
	                       |					(ВЫБРАТЬ
	                       |						ПроектныеЗадачи.ПроектнаяЗадача
	                       |					ИЗ
	                       |						ПроектныеЗадачи КАК ПроектныеЗадачи)) КАК упоСрокиПроектныхЗадачСрезПоследних
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроектныеЗадачи КАК ПроектныеЗадачи
	                       |		ПО упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ПроектныеЗадачи.ПроектнаяЗадача");
	
	Если ПараметрыТекста.ПоказатьВыполнимостьПроекта Тогда
		
		ТекстыЗапроса.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(упоПроцентыГотовностиПроектовСрезПоследних.ПроцентГотовности) КАК ПроцентГотовности
		|ИЗ
		|	РегистрСведений.упоПроцентыГотовностиПроектов.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И Проект = &Проект) КАК упоПроцентыГотовностиПроектовСрезПоследних");
		
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Общегоназначения.РазделительПакетаЗапросов());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьНадписьВехи(БПП, ППП, ПППСледующий, Веха, Знач ТекстНадписи)
	
	ШиринаЛево = (ППП.ТекКонецX - ППП.ТекНачалоX)/2;
	Если ПППСледующий = Неопределено Тогда
		ШиринаПраво = ШиринаЛево;
	Иначе 
		ШиринаПраво = (ПППСледующий.ТекКонецX - ПППСледующий.ТекНачалоX)/2;
	КонецЕсли;	
	Ширина = Мин(ШиринаЛево, ШиринаПраво)*2;
	
	Если Ширина < БПП.МинимальнаяШиринаФигурыДляТекста Тогда
		ТекстНадписи = "";
	КонецЕсли;
	
	Надпись = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Надпись.Ширина = Ширина;
	Надпись.Высота = БПП.ВысотаНадписиВехи;
	Надпись.Верх = БПП.ОтступСверху + 1;
	Надпись.Лево = ППП.ТекКонецX - (ППП.ТекКонецX_Веха - ППП.ТекНачалоX_Веха)/2 - Ширина/2;	
	Надпись.Текст = ТекстНадписи;
	Надпись.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	Надпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Надпись.ЦветФона = БПП.ПустойЦвет;
	Надпись.Линия = БПП.ПустаяЛиния;
	Надпись.Расшифровка = Веха;
	Надпись.ЦветТекста = WebЦвета.ТемноСиний;
	Надпись.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, БПП.РазмерШрифтаПодписи);
	Надпись.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Авто;
	
КонецПроцедуры 

Процедура ДобавитьПодписьФазы(БПП, ППП, Фаза, Знач ТекстНадписи)
	
	ШиринаБлока = ППП.ТекКонецX - ППП.ТекНачалоX;
	ШиринаВехи = ППП.ТекКонецX_Веха - ППП.ТекНачалоX_Веха;
	Ширина = Макс(ШиринаБлока, ШиринаВехи);
	
	ДлинаТекста = СтрДлина(ТекстНадписи);
	Если ДлинаТекста = 0 Или Ширина = 0 Тогда
		ДопВысотаФазы = 0;
	Иначе	
		ДопВысотаФазы = БПП.ВысотаПодписиФазы * Окр(ДлинаТекста/(Ширина*БПП.КоэффициентШрифтаПодписиФазы) - 0.5, 
														0, 
														РежимОкругления.Окр15как20);
	КонецЕсли;	
	ВысотаФазы = БПП.ВысотаПодписиФазы + ДопВысотаФазы;
	ППП.НачальнаяПозицияY_ПР = Макс(ППП.НачальнаяПозицияY_ПР, БПП.НачалоПР_Y + ДопВысотаФазы);
	
	Если Ширина < БПП.МинимальнаяШиринаФигурыДляТекста Тогда
		ТекстНадписи = "";
	КонецЕсли;
	
	Подпись = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Подпись.Ширина = Ширина;
	Подпись.Высота = ВысотаФазы;
	Подпись.Верх = БПП.КонецБлока_Y + БПП.ОтступПодписиФазы + 1;
	Подпись.Лево = Мин(ППП.ТекНачалоX, ППП.ТекНачалоX_Веха-1);	
	Подпись.Текст = ТекстНадписи;
	Подпись.ВертикальноеПоложение = ВертикальноеПоложение.Верх; 
	Если Ширина <= 20 Тогда
		Подпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	Иначе
		Подпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	КонецЕсли;
	Подпись.ЦветФона = WebЦвета.Белый;
	Подпись.Линия = БПП.ПустаяЛиния;
	Подпись.Расшифровка = Фаза;
	Подпись.ЦветТекста = WebЦвета.Черный;
	Подпись.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, БПП.РазмерШрифтаПодписиФазы);
	Подпись.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Авто;
	
КонецПроцедуры 

Процедура ДобавитьФазу(БПП, ППП, Знач пТекст, Расшифровка, Состояние = 1)
	
	ПравильнаяШиринаФазы = ППП.ТекКонецX_Фаза - ППП.ТекНачалоX_Фаза + 1;
	
	Если ПравильнаяШиринаФазы < БПП.МинимальнаяШиринаФигурыДляТекста Тогда
		пТекст = "";
	КонецЕсли;		
	
	Если ПравильнаяШиринаФазы < 10 Тогда
		ШиринаКончика = 2;
	ИначеЕсли ПравильнаяШиринаФазы < 3 Тогда
		ШиринаКончика = 0;
	Иначе
		ШиринаКончика = 6;
	КонецЕсли;	
	
	ШиринаПрямоугольника = ПравильнаяШиринаФазы - ШиринаКончика;
	
	Если Состояние = 2 Тогда
		КартинкаФон = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);	
		КартинкаФон.Ширина = ШиринаПрямоугольника + ШиринаКончика;
		КартинкаФон.Высота = БПП.ВысотаФазы;
		КартинкаФон.Верх = БПП.НачалоБлока_Y;
		КартинкаФон.Лево = ППП.ТекНачалоX_Фаза;
		КартинкаФон.Линия = БПП.ПустаяЛиния;
		КартинкаФон.Расшифровка = Расшифровка;
		КартинкаФон.ЦветФона = БПП.ПустойЦвет;
		КартинкаФон.Узор = ТипУзораТабличногоДокумента.БезУзора;
		КартинкаФон.Картинка = БиблиотекаКартинок.упоПрямоугольник2_1;
	КонецЕсли;
	
	Картинка1 = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);	
	Картинка1.Ширина = ШиринаПрямоугольника - ?(Состояние = 2, 1, 0);
	Картинка1.Высота = БПП.ВысотаФазы - ?(Состояние = 2, 1, 0);
	Картинка1.Верх = БПП.НачалоБлока_Y + ?(Состояние = 2, 0.5, 0);
	Картинка1.Лево = ППП.ТекНачалоX_Фаза + ?(Состояние = 2, 1, 0);
	Картинка1.Линия = БПП.ПустаяЛиния;
	Картинка1.Расшифровка = Расшифровка;
	Картинка1.ЦветФона = БПП.ПустойЦвет;
	Картинка1.Узор = ТипУзораТабличногоДокумента.БезУзора;
	
	КорректировкаПоложенияТекста = ?(Состояние = 2, 2, 1);
	Текст = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Текст.Ширина = Картинка1.Ширина - КорректировкаПоложенияТекста;
	Текст.Высота = Картинка1.Высота - КорректировкаПоложенияТекста;
	Текст.Верх = Картинка1.Верх + КорректировкаПоложенияТекста;
	Текст.Лево = Картинка1.Лево + КорректировкаПоложенияТекста;	
	Текст.Текст = пТекст;
	Текст.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
	Текст.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Текст.ЦветФона = БПП.ПустойЦвет;
	Текст.Линия = БПП.ПустаяЛиния;
	Текст.Расшифровка = Расшифровка;
	Текст.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, БПП.РазмерШрифтаПодписи);
	Текст.Узор = ТипУзораТабличногоДокумента.БезУзора;
	
	//

	Картинка2 = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);	
	Картинка2.Ширина = ШиринаКончика;
	Картинка2.Высота = БПП.ВысотаФазы - ?(Состояние = 2, 1, 0);
	Картинка2.Верх = БПП.НачалоБлока_Y + ?(Состояние = 2, 0.5, 0);
	Картинка2.Лево = Картинка1.Лево + Картинка1.Ширина - ?(БПП.ЭтоВебКлиент, 0.3, 0);
	Картинка2.Линия = БПП.ПустаяЛиния;
	Картинка2.Расшифровка = Расшифровка;
	Картинка2.ЦветФона = БПП.ПустойЦвет;
	Картинка2.Узор = ТипУзораТабличногоДокумента.БезУзора;
	
	Если Состояние = 1 Тогда
		Картинка1.Картинка = БиблиотекаКартинок.упоПрямоугольник4;
		Картинка2.Картинка = БиблиотекаКартинок.упоТреугольник4;
	ИначеЕсли Состояние = 2 Или Состояние = 3 Тогда
		Картинка1.Картинка = БиблиотекаКартинок.упоПрямоугольник3;
		Картинка2.Картинка = БиблиотекаКартинок.упоТреугольник3;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьВеху(БПП, ППП, Знач пТекст, Расшифровка, Состояние = 1)
	
	ПравильнаяШиринаВехи = ППП.ТекКонецX_Веха - ППП.ТекНачалоX_Веха + 1;
	
	Если БПП.ВыводитьВоротаКачества Тогда
		
		ДлинаТекста = СтрДлина(пТекст);
		Если ДлинаТекста > 20 Тогда 
			РазмерШрифта = 6;	
		ИначеЕсли ДлинаТекста <= 6 Тогда
			РазмерШрифта = 8;
		Иначе
			РазмерШрифта = 6;
		КонецЕсли;
		
		Если ПравильнаяШиринаВехи < БПП.МинимальнаяШиринаФигурыДляТекста Тогда
			пТекст = "";
		КонецЕсли;
	
	КонецЕсли;	
	
	Если Состояние = 2 Тогда
		КартинкаФон = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);	
		КартинкаФон.Ширина = ПравильнаяШиринаВехи - 0.5;
		КартинкаФон.Высота = БПП.ВысотаВехи;
		КартинкаФон.Верх = БПП.НачалоБлока_Y;
		КартинкаФон.Лево = ППП.ТекНачалоX_Веха;
		КартинкаФон.Линия = БПП.ПустаяЛиния;
		КартинкаФон.Расшифровка = Расшифровка;
		КартинкаФон.ЦветФона = БПП.ПустойЦвет;
		КартинкаФон.Узор = ТипУзораТабличногоДокумента.БезУзора;
		КартинкаФон.Картинка = БиблиотекаКартинок.упоПрямоугольник2_2;
	КонецЕсли;
	
	Картинка = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);	
	Картинка.Ширина = ПравильнаяШиринаВехи;
	Если БПП.ВыводитьВоротаКачества Тогда
		Картинка.Высота = БПП.ВысотаВехи;
		Картинка.Верх = БПП.НачалоБлока_Y;
	Иначе
		Картинка.Высота = БПП.ВысотаВехи_Мини;
		Картинка.Верх = БПП.НачалоБлока_Y + (БПП.ВысотаВехи - БПП.ВысотаВехи_Мини)/2;
	КонецЕсли;	
	Картинка.Лево = ППП.ТекНачалоX_Веха;
	Картинка.Линия = БПП.ПустаяЛиния;
	Картинка.Расшифровка = Расшифровка;
	Картинка.ЦветФона = БПП.ПустойЦвет;
	Картинка.Узор = ТипУзораТабличногоДокумента.БезУзора;
	
	Если Состояние = 1 Тогда
		Картинка.Картинка = БиблиотекаКартинок.упоРомб4;
	ИначеЕсли Состояние = 2 Тогда
		Картинка.Картинка = БиблиотекаКартинок.упоРомб5;
		Картинка.Ширина = Картинка.Ширина - 1;
		Картинка.Высота = Картинка.Высота - 1;
		Картинка.Верх = Картинка.Верх + 0.5;
	ИначеЕсли Состояние = 3 Тогда
		Картинка.Картинка = БиблиотекаКартинок.упоРомб5;
	КонецЕсли;
	
	Если БПП.ВыводитьВоротаКачества Тогда
		Текст = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		Текст.Ширина = Картинка.Ширина;
		Текст.Высота = Картинка.Высота;
		Текст.Верх = Картинка.Верх;
		Текст.Лево = Картинка.Лево;	
		Текст.Текст = пТекст;
		Текст.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Авто;
		Текст.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
		Текст.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		Текст.ЦветФона = БПП.ПустойЦвет;
		Текст.Узор = ТипУзораТабличногоДокумента.БезУзора;
		Текст.Линия = БПП.ПустаяЛиния;
		Текст.Расшифровка = Расшифровка;
		Текст.ЦветТекста = WebЦвета.Черный;
		Текст.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, РазмерШрифта);
	КонецЕсли;
	
	Если Состояние = 3 Тогда
		Картинка.Картинка = БиблиотекаКартинок.упоРомб5;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВсеПРВехи(БПП, ППП, ТаблицаПР, ПерваяФаза = Ложь)
	Если ТаблицаПР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	сч = 1;
	ТекущаяДата = ТекущаяДатаСеанса();
	Для Каждого СтрокаПР Из ТаблицаПР Цикл						
		Если ЗначениеЗаполнено(СтрокаПР.ДатаОкончанияФакт) Тогда
			Префикс = "+";
			ДатаПР = СтрокаПР.ДатаОкончанияФакт;
			ТипПР = 2;
		Иначе
			Префикс = "*";
			ДатаПР = СтрокаПР.ДатаОкончанияПлан;
			Если ЗначениеЗаполнено(СтрокаПР.ДатаОкончанияПлан) И СтрокаПР.ДатаОкончанияПлан < ТекущаяДата Тогда
				ТипПР = 3;					
			Иначе
				ТипПР = 1;					
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаПР) Тогда
			Постфикс = " ("+Формат(ДатаПР, "ДФ=dd.MM.yyyy")+")"; 
		Иначе
			Постфикс = "";
		КонецЕсли;
		Если ППП.ШиринаБлока < БПП.МинимальнаяШиринаФигурыДляТекста Тогда
			ОписаниеПР = Префикс + Формат(1, "ЧН=; ЧГ=");
		Иначе
			ОписаниеПР = Префикс + " " + СтрокаПР.ПР + Постфикс; 
			Если БПП.ПоказыватьИсполнителейПроектныхРешений Тогда 
				ОписаниеПР = ОписаниеПР + Символы.ПС + "  " + СтрокаПР.Исполнитель;
			КонецЕсли;
		КонецЕсли;
		ВысотаТекста = 0;
		ДобавитьПР(БПП, ППП, ОписаниеПР, СтрокаПР.ПР, ТипПР, СтрокаПР.Основное, ПерваяФаза, ВысотаТекста);	
		
		ППП.Вставить("ТекПозицияY_ПР", ППП.ТекПозицияY_ПР + ВысотаТекста + БПП.ОтступПР);
		сч = сч + 1;
	КонецЦикла;		
КонецПроцедуры 

Процедура ДобавитьПР(БПП, ППП, пТекст, Расшифровка, СтатусРешения = 1, Основное = Ложь, ПерваяФаза = Ложь, ВысотаТекста)
	
	Текст = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Текст.Ширина = ППП.ШиринаБлока - 2;
	Текст.Верх = ППП.ТекПозицияY_ПР; 
	Текст.Лево = ППП.ТекНачалоX+1;	
	Текст.Текст = пТекст;
	
	ДлинаТекста = СтрДлина(СтрПолучитьСтроку(пТекст, 1));
	Если ДлинаТекста = 0 Или Текст.Ширина = 0 Тогда
		ДопВысотаТекста = 0;
	Иначе	
		ДопКоличествоСтрок = Окр(ДлинаТекста/(Текст.Ширина * БПП.КоэффициентШрифтаПР) - 0.5, 0, РежимОкругления.Окр15как20);
		ДопВысотаТекста = БПП.ВысотаПР_ДополнительнаяСтрока * ДопКоличествоСтрок;
	КонецЕсли;	
	ВысотаТекста =  Мин(БПП.ВысотаПР + ДопВысотаТекста, БПП.МаксимальнаяВысотаРП);
	Текст.Высота = ВысотаТекста;
	Текст.ВертикальноеПоложение = ВертикальноеПоложение.Верх; 
	Если ПерваяФаза Тогда
		Текст.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	Иначе             	
		Текст.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	КонецЕсли;
	Текст.ЦветФона = БПП.ПустойЦвет;
	Текст.Узор = ТипУзораТабличногоДокумента.БезУзора;
	Текст.Линия = БПП.ПустаяЛиния;
	Текст.Расшифровка = Расшифровка;
	Если Основное Тогда
		Текст.Шрифт = Новый Шрифт(БПП.НазваниеШрифта,БПП.РазмерШрифтаПР, Истина);
	Иначе
		Текст.Шрифт = Новый Шрифт(БПП.НазваниеШрифта,БПП.РазмерШрифтаПР, Ложь);
	КонецЕсли;
	
	Если СтатусРешения = 2 Тогда
		Текст.ЦветТекста = WebЦвета.ТемноЗеленый;
	ИначеЕсли СтатусРешения = 3 Тогда
		Текст.ЦветТекста = WebЦвета.Красный;
	Иначе
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказатель(БПП, ППП, Веха, ДанныеИндикатора)
	
	Если ДанныеИндикатора = Неопределено ИЛИ НЕ ДанныеИндикатора.Количество() Тогда
		Возврат;
	ИначеЕсли ДанныеИндикатора.Количество() = 1 И НЕ ЗначениеЗаполнено(ДанныеИндикатора[0].ЗначениеИндикатора) Тогда
		Возврат;
	КонецЕсли;
	
	ШиринаПоказателя = ППП.ТекКонецX - ППП.ТекНачалоX - 2;
	ШиринаПоказателя = Мин(ШиринаПоказателя, БПП.МаксимальнаяШиринаПоказателя);
	
	Картинка = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Диаграмма);	
	Картинка.Ширина = ШиринаПоказателя;
	Картинка.Лево = ППП.ТекНачалоX + (ППП.ТекКонецX - ППП.ТекНачалоX) / 2  - ШиринаПоказателя / 2;
	Картинка.Верх = ППП.ТекПозицияY_ПР;
	Картинка.Высота = Картинка.Ширина * 3 / 5;
	
	Картинка.Объект.ТипДиаграммы = ТипДиаграммы.Измерительная; 
	
	Если упоИнтеграцияКлиентСервер.ДоступныСвойстваДиаграммыДляРасчетаМаксИМинЗначения() Тогда
		
		Картинка.Объект.АвтоМаксимальноеЗначение = Ложь;
		Картинка.Объект.АвтоМинимальноеЗначение = Ложь;   
		Картинка.Объект.МаксимальноеЗначение = 100; 
		Картинка.Объект.МинимальноеЗначение = 0; 
		
	КонецЕсли; 
	
	Картинка.Объект.ОсьЗначений.МинимальноеЗначение = 0;
	Картинка.Объект.ОсьЗначений.МаксимальноеЗначение = 100;
	Картинка.Объект.ОсьЗначений.СпособОпределенияМаксимальногоЗначения = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	Картинка.Объект.ОсьЗначений.СпособОпределенияМинимальногоЗначения = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение; 
	Картинка.ГраницаСверху = Ложь;
	Картинка.ГраницаСнизу = Ложь;
	Картинка.ГраницаСлева = Ложь;
	Картинка.ГраницаСправа = Ложь;
	Картинка.Объект.ПрозрачныйФон = Истина;
	Картинка.Узор = ТипУзораТабличногоДокумента.БезУзора;
	
	Полосы = Картинка.Объект.ПолосыИзмерительнойДиаграммы; 
	НоваяПолоса = Полосы.Добавить(); 
	НоваяПолоса.Начало = 0; 
	НоваяПолоса.Конец = 60; 
	НоваяПолоса.ЦветФона = WebЦвета.Красный; 
	
	НоваяПолоса = Полосы.Добавить(); 
	НоваяПолоса.Начало = 60; 
	НоваяПолоса.Конец = 85; 
	НоваяПолоса.ЦветФона = WebЦвета.Желтый; 
	
	НоваяПолоса = Полосы.Добавить(); 
	НоваяПолоса.Начало = 85; 
	НоваяПолоса.Конец = 100; 
	НоваяПолоса.ЦветФона = WebЦвета.Зеленый; 
	
	Серия = Картинка.Объект.Серии.Добавить();
	Точка = Картинка.Объект.Точки.Добавить();
	Картинка.Объект.УстановитьЗначение(Точка, Серия, ДанныеИндикатора[0].ЗначениеИндикатора,, ДанныеИндикатора[0].Индикатор); 
	Картинка.Объект.Обновление = Истина;
	Картинка.Объект.ТолщинаВтулкиИзмерительнойДиаграммы = 10;
	
	ОбластьЛегенды = Картинка.Объект.ОбластьЛегенды;
	ОбластьЛегенды.Верх = 1;
	ОбластьЛегенды.Лево = 1;
	ОбластьЛегенды.Низ = 1;
	ОбластьЛегенды.Право = 1;
	Картинка.Объект.ОтображатьЛегенду = Ложь;
	
	ОбластьПостроения = Картинка.Объект.ОбластьПостроения;
	ОбластьПостроения.Верх = 0;
	ОбластьПостроения.Лево = 0;
	ОбластьПостроения.Низ = 1;
	ОбластьПостроения.Право = 1;
	Если Картинка.Ширина < 35 Тогда
		РазмерШрифта = 4;
	ИначеЕсли Картинка.Ширина < 45 Тогда
		РазмерШрифта = 5;
	ИначеЕсли Картинка.Ширина < 55 Тогда
		РазмерШрифта = 6;
	Иначе
		РазмерШрифта = 7;
	КонецЕсли;	
	ОбластьПостроения.Шрифт = Новый Шрифт("Verdana", РазмерШрифта);
		
	ППП.Вставить("ТекПозицияY_ПР", ППП.ТекПозицияY_ПР + Картинка.Высота + БПП.ОтступПР / 2);
			
КонецПроцедуры

Процедура ДобавитьНадписьПроект(БПП, ППП, Проект)
	
	Надпись = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Надпись.Ширина = БПП.ШиринаНадписиПроект;
	Надпись.Верх = 1;
	Надпись.Высота = ППП.МаксимальнаяВысотаY - Надпись.Верх - 1;	
	Надпись.Лево = БПП.ОтступСлева;	
	Надпись.Текст = Проект;
	Надпись.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
	Надпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Надпись.ЦветФона = БПП.ПустойЦвет;
	Надпись.Узор = ТипУзораТабличногоДокумента.БезУзора;
	Надпись.Линия = БПП.ПустаяЛиния;
	Надпись.ОриентацияТекста = БПП.ОриентацияНадписиПроект;
	Надпись.Расшифровка = Проект;
	Надпись.ЦветТекста = WebЦвета.Коричневый;
	Надпись.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, БПП.РазмерШрифтаНадписиПроект, Истина);
	
КонецПроцедуры 

Процедура ДобавитьПоказательГотовностиПроекта(БПП, ППП, Знач ЗначениеПоказателя)
	
	Если ЗначениеПоказателя = Неопределено ИЛИ ЗначениеПоказателя = NULL Тогда
		ЗначениеПоказателя = 0;
	КонецЕсли;
	
	Если БПП.ВидВыполнимостиПроекта = "Круговой" Тогда
		
		Картинка = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Диаграмма);	
		Картинка.Ширина = БПП.ШиринаПоказателяГотовностиПроекта;
		Картинка.Лево = ППП.ПозицияX_ПоказательГотовностиПроекта;
		Картинка.Верх = 1;
		Картинка.Высота = ППП.МаксимальнаяВысотаY - Картинка.Верх - 1;
		
		Картинка.Объект.ТипДиаграммы = ТипДиаграммы.Измерительная; 
		
		Если упоИнтеграцияКлиентСервер.ДоступныСвойстваДиаграммыДляРасчетаМаксИМинЗначения() Тогда
			
			Картинка.Объект.АвтоМаксимальноеЗначение = Ложь;
			Картинка.Объект.АвтоМинимальноеЗначение = Ложь;  
			Картинка.Объект.МаксимальноеЗначение = 100; 
			Картинка.Объект.МинимальноеЗначение = 0; 
			
		КонецЕсли;   

		Картинка.Объект.ОсьЗначений.МинимальноеЗначение = 0;
		Картинка.Объект.ОсьЗначений.МаксимальноеЗначение = 100;
		Картинка.Объект.ОсьЗначений.СпособОпределенияМаксимальногоЗначения = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
		Картинка.Объект.ОсьЗначений.СпособОпределенияМинимальногоЗначения = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
		Картинка.ГраницаСверху = Ложь;
		Картинка.ГраницаСнизу = Ложь;
		Картинка.ГраницаСлева = Ложь;
		Картинка.ГраницаСправа = Ложь;
		Картинка.ЦветФона = Новый Цвет();
		Картинка.Узор = ТипУзораТабличногоДокумента.БезУзора;
		
		Полосы = Картинка.Объект.ПолосыИзмерительнойДиаграммы; 
		НоваяПолоса = Полосы.Добавить(); 
		НоваяПолоса.Начало = 0; 
		НоваяПолоса.Конец = 60; 
		НоваяПолоса.ЦветФона = WebЦвета.Красный; 
		
		НоваяПолоса = Полосы.Добавить(); 
		НоваяПолоса.Начало = 60; 
		НоваяПолоса.Конец = 85; 
		НоваяПолоса.ЦветФона = WebЦвета.Желтый; 
		
		НоваяПолоса = Полосы.Добавить(); 
		НоваяПолоса.Начало = 85; 
		НоваяПолоса.Конец = 100; 
		НоваяПолоса.ЦветФона = WebЦвета.Зеленый; 
		
		Серия = Картинка.Объект.Серии.Добавить();
		Точка = Картинка.Объект.Точки.Добавить();
		Картинка.Объект.УстановитьЗначение(Точка, Серия, ЗначениеПоказателя,, 
		Формат(ЗначениеПоказателя, "ЧДЦ=; ЧН=") + НСтр("ru = ', % готовности проекта'")); 
		Картинка.Объект.Обновление = Истина;
		Картинка.Объект.ТолщинаВтулкиИзмерительнойДиаграммы = 10;
		
		ОбластьЛегенды = Картинка.Объект.ОбластьЛегенды;
		ОбластьЛегенды.Верх = 1;
		ОбластьЛегенды.Лево = 1;
		ОбластьЛегенды.Низ = 1;
		ОбластьЛегенды.Право = 1;
		Картинка.Объект.ОтображатьЛегенду = Ложь; 
		
		ОбластьПостроения = Картинка.Объект.ОбластьПостроения;
		ОбластьПостроения.Верх = 0;
		ОбластьПостроения.Лево = 0;
		ОбластьПостроения.Низ = 1;
		ОбластьПостроения.Право = 1;
		
	Иначе
		
		Лево = ППП.ПозицияX_ПоказательГотовностиПроекта;
		Ширина = БПП.ШиринаПоказателяГотовностиПроекта;
		Верх = 1;
		Высота = ППП.МаксимальнаяВысотаY - Верх - 1;
		ВысотаБлока = 10; 
		ВерхБлока = Верх + Высота / 2 - ВысотаБлока/ 2;
		
		Если ЗначениеПоказателя <> 0 Тогда			
			Блок1 = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямоугольник);
			Блок1.Ширина = Ширина * ЗначениеПоказателя / 100;
			Блок1.Лево = Лево;
			Блок1.Высота = ВысотаБлока;			
			Блок1.Верх = ВерхБлока;
			Блок1.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
			//Блок1.ЦветФона = WebЦвета.Синий;
			//Блок1.ЦветФона = WebЦвета.Роса;
			Блок1.ЦветФона = WebЦвета.БледноЗеленый;
			//Блок1.Узор = ТипУзораТабличногоДокумента.Узор8;
			Блок1.Узор = ТипУзораТабличногоДокумента.Сплошной;
			Если ЗначениеПоказателя <> 100 Тогда
				Блок1.ГраницаСправа = Ложь;
			КонецЕсли;
		КонецЕсли;    
		Если ЗначениеПоказателя <> 100 Тогда			
			Блок2 = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямоугольник);
			Блок2.Ширина = Ширина * (100-ЗначениеПоказателя) / 100;
			Блок2.Лево = Лево + Ширина - Блок2.Ширина;
			Блок2.Высота = ВысотаБлока;			
			Блок2.Верх = ВерхБлока;
			Блок2.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
			//Блок2.ЦветФона = WebЦвета.СветлоКоралловый;
			Блок2.Узор = ТипУзораТабличногоДокумента.БезУзора;
			Если ЗначениеПоказателя <> 0 Тогда
				Блок2.ГраницаСлева = Ложь;	
			КонецЕсли;
		КонецЕсли;		
				
		Текст = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);	
		Текст.Ширина = Ширина;
		Текст.Лево = Лево;
		Текст.Верх = Верх;
		Текст.Высота = Высота;
		
		Текст.Текст = Формат(ЗначениеПоказателя, "ЧДЦ=; ЧН=; ЧГ=") + "%";
		Текст.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
		Текст.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		Текст.ЦветФона = Новый Цвет();
		Текст.Узор = ТипУзораТабличногоДокумента.БезУзора;
		Текст.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		Текст.Расшифровка = Неопределено;
		//Текст.ЦветТекста = WebЦвета.Красный;
		Текст.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, 10);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРазделительнуюЛинию(БПП, ППП, ВысотаПР)
	
	Высота = ВысотаПР - БПП.НачалоПР_Y;
	Если Высота = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Линия = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	Линия.ЦветЛинии = WebЦвета.ТемноСиний;
	Линия.Лево = ППП.ТекКонецX + 1;
	Линия.Верх = ППП.НачальнаяПозицияY_ПР;
	Линия.Высота = Высота;
	Линия.Ширина = 0;
	
КонецПроцедуры 

Процедура ДобавитьПодчеркиваниеТекущей(БПП, ППП)
	
	Если БПП.ПоказыватьСтрелкуТекущей Тогда
		
		Подчеркивание = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		Подчеркивание.Лево = ППП.ТекНачалоX + 1;
		Подчеркивание.Верх = ППП.МаксимальнаяВысотаПР;
		Подчеркивание.Высота = 1;   
		Подчеркивание.Ширина = ППП.ТекКонецX - Подчеркивание.Лево;
		Подчеркивание.Линия = БПП.ПустаяЛиния;
		Подчеркивание.Картинка = БиблиотекаКартинок.упоЛиния1;
		
		ППП.МаксимальнаяВысотаY = Макс(ППП.МаксимальнаяВысотаY, Подчеркивание.Верх + 3);
		
	КонецЕсли;
	
	Если БПП.ПоказыватьСтрелкуТекущей Тогда
		
		Указатель = БПП.СхемаФаз.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);	
		
		ШиринаУказателя = Мин(Подчеркивание.Ширина / 2, БПП.МаксимальнаяШиринаУказателя);
		
		УказательЛево = Подчеркивание.Лево + Подчеркивание.Ширина / 2 - ШиринаУказателя / 2;
		
		Указатель.Ширина = ШиринаУказателя;
		Указатель.Высота = БПП.ВысотаУказателяТекущей;
		Указатель.Верх = Подчеркивание.Верх + 1;
		Указатель.Лево = УказательЛево;
		Указатель.Картинка = БиблиотекаКартинок.упоУказатель1;
		Указатель.Линия = БПП.ПустаяЛиния;
		
		ППП.МаксимальнаяВысотаY = Макс(ППП.МаксимальнаяВысотаY, Указатель.Высота + Указатель.Верх);
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьЗначенияПоказателей(Проект, ТаблицаПоказателей)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Показатель");
	ТаблицаРезультата.Колонки.Добавить("НаименованиеПоказателя");
	ТаблицаРезультата.Колонки.Добавить("ЗначениеПоказателя");
	ТаблицаРезультата.Колонки.Добавить("ФорматЗначениеПоказателя");
	
	СтрокиИспользуемыхПоказателей = ТаблицаПоказателей.НайтиСтроки(Новый Структура("Использовать", Истина));
	Если СтрокиИспользуемыхПоказателей.Количество() = 0 Тогда 
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	Показатели = Новый Массив;
	Для Каждого Строка Из СтрокиИспользуемыхПоказателей Цикл
		Показатели.Добавить(Строка.Показатель);
	КонецЦикла;
	
	Проекты = Новый Массив;
	Проекты.Добавить(Проект);
	
	ЗначенияПоказателейПроекта = упоПоказателиПроектовСервер.ПолучитьЗначенияПоказателей(Показатели, Проекты);
	
	Для Каждого СтрокаПоказателя Из СтрокиИспользуемыхПоказателей Цикл
		
		Если Не СтрокаПоказателя.Использовать Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРезультата = ТаблицаРезультата.Добавить();
		СтрокаРезультата.Показатель = СтрокаПоказателя.Показатель;
		СтрокаРезультата.НаименованиеПоказателя = СтрокаПоказателя.Наименование;
		СтрокаРезультата.ЗначениеПоказателя =
			упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроекта, СтрокаПоказателя.Показатель, Проект);  
		
		СтрокаРезультата.ФорматЗначениеПоказателя = Формат(СтрокаРезультата.ЗначениеПоказателя, СтрокаПоказателя.ФорматнаяСтрока);
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

#КонецОбласти

#Область СхемаФазПроектов

Функция ДобавитьФазуПроектаРекурсивно(ДокументРезультат, ВПП, ДеревоПроектов, ТекстЗамечаний, НадоМасштабировать)
	
	БылВыводПроекта = Ложь;
	
	Для Каждого СтрокаДерева Из ДеревоПроектов.Строки Цикл
		Если ТипЗнч(СтрокаДерева.Проект) = Тип("СправочникСсылка.Проекты") Тогда
			Если ВПП.Свойство("ПроектОбъект") Тогда
				Схема = упоФазыПроектаСервер.СхемаФазПроектаПоОбъекту(ВПП.ПроектОбъект, ВПП, НадоМасштабировать);
			Иначе
				Схема = упоФазыПроектаСервер.СхемаФазПроектаПоСсылке(СтрокаДерева.Проект, ВПП, НадоМасштабировать);
			КонецЕсли;
			
			Если Схема <> Неопределено Тогда				 
				ДокументРезультат.Вывести(Схема);				
				БылВыводПроекта = Истина;
			КонецЕсли;	
			ПроверитьОшибкиПостроенияСхемы(ВПП, СтрокаДерева.Проект, ТекстЗамечаний);	
		Иначе
			ВремеменныйДок = Новый ТабличныйДокумент;
			ВПодчБылВыводПроекта = ДобавитьФазуПроектаРекурсивно(ВремеменныйДок, 
				ВПП, 
				СтрокаДерева, 
				ТекстЗамечаний, 
				НадоМасштабировать);
			Если ВПодчБылВыводПроекта Тогда
				Если ВПП.ПоказыватьГруппировки Тогда
					ВывестиГруппировкуФаз(ДокументРезультат, ВПП, СтрокаДерева);
					ДокументРезультат.НачатьГруппуСтрок();
				КонецЕсли;
				ДокументРезультат.Вывести(ВремеменныйДок);
				Если ВПП.ПоказыватьГруппировки Тогда
					ДокументРезультат.ЗакончитьГруппуСтрок(); 			
				КонецЕсли;
			КонецЕсли;		
			БылВыводПроекта = БылВыводПроекта ИЛИ ВПодчБылВыводПроекта;
		КонецЕсли;
	КонецЦикла;
	
	Возврат БылВыводПроекта;
	
КонецФункции 

Функция ПолучитьМассивПроектовПоДереву(Дерево, Массив = Неопределено)
	
	Если Массив = Неопределено Тогда
		Массив = Новый Массив;
	КонецЕсли;
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Если ТипЗнч(Строка.Проект) = Тип("СправочникСсылка.Проекты") Тогда
			Массив.Добавить(Строка.Проект);
		Иначе
			ПолучитьМассивПроектовПоДереву(Строка, Массив);
		КонецЕсли;
	КонецЦикла;
		
	Возврат Массив;	
		
КонецФункции 

Функция ПроверитьОшибкиПостроенияСхемы(ВПП, Проект, ТекстЗамечаний)
	
	Если ВПП.ВехиБезДат Тогда
		ТекстОшибки = НСтр("ru = 'В проекте ""%1"" для некоторых вех из таблицы фаз не удалось найти даты. Данные на схеме могут быть искажены.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", Проект);
		ТекстЗамечаний = ТекстЗамечаний + ?(ЗначениеЗаполнено(ТекстЗамечаний), Символы.ПС, "") + ТекстОшибки;	
	ИначеЕсли ВПП.ВехиНеПоПорядку Тогда
		ТекстОшибки = НСтр("ru = 'В проекте ""%1"" некоторые вехи в таблице фаз расположены в порядке, не соответствующем их срокам. Данные на схеме могут быть искажены.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", Проект);
		ТекстЗамечаний = ТекстЗамечаний + ?(ЗначениеЗаполнено(ТекстЗамечаний), Символы.ПС, "") + ТекстОшибки;	
	КонецЕсли;		
	
КонецФункции

Функция ПостроитьЛинииПериодов(ДокументРезультат, МассивКоординатПериодов, ПозицияX_ТекДень)
	
	МаксВысота = 0;
	Для Каждого Об Из ДокументРезультат.Рисунки Цикл
		МаксВысота = Макс(МаксВысота, Об.Верх + Об.Высота);
	КонецЦикла;
	
	Для Каждого КоордX Из МассивКоординатПериодов Цикл
		ДобавитьРазделительнуюЛиниюПериода(ДокументРезультат, КоордX, МаксВысота);	
	КонецЦикла;
	Если ПозицияX_ТекДень <> Неопределено Тогда
		ДобавитьРазделительнуюЛиниюПериода(ДокументРезультат, ПозицияX_ТекДень, МаксВысота, Истина);	
	КонецЕсли;
	
КонецФункции

Функция ОпределитьПериодПостроения(ВПП, МассивПроектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПроектов", МассивПроектов);
	
	Если ВПП.Свойство("ПроектОбъект") Тогда
		ТекстПредЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		              |	врФазы.ВехаЗеркало,
		              |	врФазы.Фаза,
					  |	&Ссылка КАК Ссылка
		              |ПОМЕСТИТЬ врФазы
		              |ИЗ
		              |	&Фазы КАК врФазы
					  |	;
					  |";				  
		 ТаблицаФаз = "врФазы"; 
		 Запрос.УстановитьПараметр("Фазы", ВПП.ПроектОбъект.Фазы.Выгрузить());
		 Запрос.УстановитьПараметр("Ссылка", ВПП.ПроектОбъект.Ссылка);
	Иначе
		ТекстПредЗапроса = "";
		ТаблицаФаз = "Справочник.Проекты.Фазы";
	КонецЕсли;
	
	ТекстЗапроса = ТекстПредЗапроса + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Проект
	               |ПОМЕСТИТЬ Проекты
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК упоСтатусыПроектовСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСтатусыПроектовСрезПоследних.Проект = Проекты.Ссылка
	               |ГДЕ
	               |	НЕ Проекты.ЭтоПроектнаяЗадача
	               |	И Проекты.Ссылка В(&МассивПроектов)
	               |	И НЕ Проекты.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Проекты.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МИНИМУМ(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан) КАК НачалоПериода,
	               |	МАКСИМУМ(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан) КАК КонецПериода
	               |ИЗ
	               |	Справочник.Проекты.Фазы КАК ПроектыФазы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Проекты КАК Проекты
	               |		ПО ПроектыФазы.Ссылка = Проекты.Проект
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО ПроектыФазы.ВехаЗеркало.СсылкаНаПроектнуюЗадачу = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан <> ДАТАВРЕМЯ(1, 1, 1)";
 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Проекты.Фазы", ТаблицаФаз);
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаСроки = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаСроки.Следующий() ИЛИ Не ЗначениеЗаполнено(ВыборкаСроки.НачалоПериода) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не удалось определить период построения фаз.'");
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	Сроки = Новый Структура();
	Если ВПП.Периодичность = "Месяц" Тогда
		Сроки.Вставить("НачалоПериода", НачалоМесяца(ВыборкаСроки.НачалоПериода));
		Сроки.Вставить("КонецПериода", НачалоМесяца(ВыборкаСроки.КонецПериода));
	ИначеЕсли ВПП.Периодичность = "Квартал" Тогда
		Сроки.Вставить("НачалоПериода", НачалоКвартала(ВыборкаСроки.НачалоПериода));
		Сроки.Вставить("КонецПериода", НачалоКвартала(ВыборкаСроки.КонецПериода));
	Иначе
		Сроки.Вставить("НачалоПериода", НачалоГода(ВыборкаСроки.НачалоПериода));
		Сроки.Вставить("КонецПериода", НачалоГода(ВыборкаСроки.КонецПериода));
	КонецЕсли;
	
	ВПП.Вставить("НачалоПериода", Сроки.НачалоПериода);	
	
	Возврат Сроки;
	
КонецФункции

Функция ДобавитьНадписьПериод(Документ, ТекПозицияX, Ширина, Текст, БПП)
	
	Надпись = Документ.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Надпись.Ширина = Ширина;
	Надпись.Высота = 4;
	Надпись.Верх = 1;
	Надпись.Лево = ТекПозицияX;	
	Надпись.Текст = Текст;
	Надпись.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
	Надпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Надпись.ЦветФона = Новый Цвет();
	Надпись.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	Надпись.Расшифровка = Неопределено;
	Надпись.ЦветТекста = WebЦвета.Черный;
	Надпись.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, 10, Истина);
		
	ТекПозицияX = ТекПозицияX + Ширина; 

КонецФункции 

Процедура ДобавитьРазделительнуюЛиниюПериода(Док, ТекПозицияX, Высота, Сегодня = Ложь)
	
	Линия = Док.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	Линия.Лево = ТекПозицияX;
	Если НЕ Сегодня Тогда
		Линия.ЦветЛинии = WebЦвета.СветлоЗеленый;
		Линия.Верх = 1;
	Иначе
		Линия.ЦветЛинии = WebЦвета.Красный;
		Линия.Верх = 10;
		Линия.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Пунктир, 2);
	КонецЕсли;
	Линия.Высота = Высота - Линия.Верх;
	Линия.Ширина = 0;
	
КонецПроцедуры 

Функция ПолучитьТаблицуПоказателей()
	
	Данные = Новый Структура;
	Данные.Вставить("ТаблицаПоказателей", Новый ТаблицаЗначений);
	Данные.ТаблицаПоказателей.Колонки.Добавить("Использовать");
	Данные.ТаблицаПоказателей.Колонки.Добавить("Показатель");
	Данные.ТаблицаПоказателей.Колонки.Добавить("Группа");
	Данные.ТаблицаПоказателей.Колонки.Добавить("Порядок");
	Данные.ТаблицаПоказателей.Колонки.Добавить("ФорматнаяСтрока");
	Данные.ТаблицаПоказателей.Колонки.Добавить("Наименование");
	Данные.ТаблицаПоказателей.Колонки.Добавить("ТипЗаполнения");
	Данные.ТаблицаПоказателей.Колонки.Добавить("Группировки");
	Данные.ТаблицаПоказателей.Колонки.Добавить("ВыражениеГруппировки");
	Данные.ТаблицаПоказателей.Колонки.Добавить("ПринадлежностьПоказателя");
	Данные.ТаблицаПоказателей.Колонки.Добавить("ТипИндикатора");
	Данные.ТаблицаПоказателей.Колонки.Добавить("ИмяПоказателя");
	
	упоПанельПоказателейВызовСервера.ПолучитьСписокВсехПоказателей(Данные);
	
	Настройка = Неопределено;
	КлючНастройки = Неопределено;
	
	упоНастройкаПоказателейДляКарточкиПроектовНастройка = Константы.упоНастройкаПоказателейДляКарточкиПроектов.Получить().Получить();
	
	Если ТипЗнч(упоНастройкаПоказателейДляКарточкиПроектовНастройка) = Тип("Структура") Тогда
		КлючНастройки = упоНастройкаПоказателейДляКарточкиПроектовНастройка.КлючНастроек;
		Пользователь = упоНастройкаПоказателейДляКарточкиПроектовНастройка.Пользователь;
	КонецЕсли;
	
	Если КлючНастройки <> Неопределено И КлючНастройки <> "" Тогда
		Настройка = ХранилищеОбщихНастроек.Загрузить("Обработка.упоПанельПоказателей", КлючНастройки,, Пользователь);	
	КонецЕсли;	
	
	Если Настройка = Неопределено ИЛИ НЕ Настройка.Свойство("СтруктураПоказателей") Тогда
		ПанельПоказателейПроекта = "";
		Возврат Данные.ТаблицаПоказателей;
	КонецЕсли;
	
	Для Каждого Эл Из Данные.ТаблицаПоказателей Цикл
		Эл.Использовать = Ложь;	
	КонецЦикла;
	
	НомерПозиции = 0;
	Для Каждого ЭлементПоказателей Из Настройка.СтруктураПоказателей.ВключенныеПоказатели Цикл
		
		Если ЗначениеЗаполнено(ЭлементПоказателей.Код) Тогда
			
			РезПоиска = Данные.ТаблицаПоказателей.НайтиСтроки(Новый Структура("Показатель", ЭлементПоказателей));
			Если РезПоиска.Количество() > 0 Тогда
				РезПоиска[0].Использовать = Истина;	
				
				// Восстановим порядок вывода показателей.
				НомерПозиции = НомерПозиции + 1;
				ТекНомерПозиции = Данные.ТаблицаПоказателей.Индекс(РезПоиска[0]) + 1;
				Данные.ТаблицаПоказателей.Сдвинуть(ТекНомерПозиции - 1, -(ТекНомерПозиции - НомерПозиции));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Данные.ТаблицаПоказателей;
	
КонецФункции

Функция ВывестиГруппировкуФаз(ДокументРезультат, БПП, СтрокаДерева)
	
	Док = Новый ТабличныйДокумент;
	
	РазмерШрифта = 14 - СтрокаДерева.Уровень();
	РазмерШрифта = Макс(РазмерШрифта, 4);
	
	Надпись = Док.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
	Надпись.Ширина = 200;
	Надпись.Верх = 1;
	Надпись.Высота = 10;	
	Надпись.Лево = 1;	
	Надпись.Текст = СтрокаДерева.Проект;
	Надпись.ВертикальноеПоложение = ВертикальноеПоложение.Центр; 
	Надпись.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	Надпись.ЦветФона = Новый Цвет();
	Надпись.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	Надпись.Расшифровка = СтрокаДерева.Проект;
	Надпись.ЦветТекста = WebЦвета.Коричневый;
	Надпись.Шрифт = Новый Шрифт(БПП.НазваниеШрифта, РазмерШрифта, Истина);
	
	ДокументРезультат.Вывести(Док);
	
КонецФункции

#КонецОбласти

#Область МасштабированиеВывода

Функция ФорматЗаголовковПериодов(Периодичность, НадоМасштабировать)
	
	Если Периодичность = "Месяц" Тогда
		Если НадоМасштабировать Тогда
			ФорматПериода = "ДФ='MM.yy'";
		Иначе
			ФорматПериода = "ДФ='MMMM yyyy'";
		КонецЕсли;
	ИначеЕсли Периодичность = "Квартал" Тогда
		ФорматПериода = "ДФ='к ""кв."" гггг'";
	Иначе
		ФорматПериода = "ДФ='yyyy'";
	КонецЕсли;
	
	Возврат ФорматПериода;
	
КонецФункции

Процедура МасштабироватьПараметрыПостроения(БПП, НадоМасштабировать)
	
	Если Не НадоМасштабировать Тогда
		Возврат;
	КонецЕсли;
	
	БПП.ШиринаВехи = БПП.ШиринаВехи - 10;
	БПП.ШиринаФазы = БПП.ШиринаФазы - 20;
	БПП.РазмерШрифтаПодписи = БПП.РазмерШрифтаПодписи - 1; 
	БПП.РазмерШрифтаПодписиФазы = БПП.РазмерШрифтаПодписиФазы - 1;
	
КонецПроцедуры

Функция ПроверитьПериодПроектовИНастройкуПериодичности(Сроки, Периодичность)
	
	ПериодПостроения = 
		упоФункцииОбщегоНазначенияКлиентСервер.РазностьДатВМесяцах(Сроки.КонецПериода, Сроки.НачалоПериода);
		
	Если Периодичность = "Год" Тогда
		ПриведенныйПериод = ПериодПостроения / 12;
	ИначеЕсли Периодичность = "Квартал" Тогда
		ПриведенныйПериод = ПериодПостроения / 4;
	Иначе
		ПриведенныйПериод = ПериодПостроения;
	КонецЕсли;
	
	НадоМасштабировать = ПриведенныйПериод > 6;
	
	Возврат НадоМасштабировать;
	
КонецФункции

#КонецОбласти

#КонецОбласти