#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	 
#Область ПрограммныйИнтерфейс

// Заполняет объект по основанию.
//
// Параметры:
//  Объект			 - ДокументСсылка.упоРегистрацияФактическихДоходовИРасходов - заполняемый документ.
//  Основание		 - ДокументСсылка - документ-основание.
//  ЗаполнятьДоходы	 - Булево - признак необходимости заполнять доходы.
//  ЗаполнятьРасходы - Булево - признак необходимости заполнять расходы.
//
Процедура ЗаполнитьОбъектПоОснованию(Объект, Основание, ЗаполнятьДоходы = Ложь, ЗаполнятьРасходы = Ложь) Экспорт
	
	ТаблицаРезультат = Неопределено;
	
	Если ЗаполнятьДоходы Или ЗаполнятьРасходы Тогда
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект); 
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоВерсияПланаПроекта") 
		Или ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		ТаблицаРезультат = ПолучитьТаблицуОснованиеВерсии(Объект, Основание,  ЗаполнятьДоходы, ЗаполнятьРасходы);		 
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.упоРегистрацияФактическиВыполненногоОбъема") Тогда
		
		ТаблицаРезультат = ПолучитьВыполненныеОбъемыПоРегистратору(Объект, Основание,  ЗаполнятьДоходы, ЗаполнятьРасходы);
		
	ИначеЕсли Основание = "ПоВыполненнымОбъемам" Тогда
		
		ТаблицаРезультат =  ПолучитьОстаткиВыполненныхОбъемов(Объект,  ЗаполнятьДоходы, ЗаполнятьРасходы);	
		
	КонецЕсли;
	
	Если ЗаполнятьДоходы Тогда
		
		Объект.Доходы.Очистить();
		Объект.РаспределениеДоходов.Очистить();
		
		Если ТаблицаРезультат <> Неопределено Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ВидЭлемента",Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход);
			
			ТаблицаДоходы = ТаблицаРезультат.Скопировать(Отбор);
			ТаблицаДоходы.Свернуть("ПроектнаяЗадача, Статья, Контрагент, Договор, Валюта, Номенклатура, ЕдиницаИзмерения, ДатаНачисления",
			"Сумма,Количество");
			
			Счетчик = 0;
			
			// Кеширование
			мПроектныеЗадачи = Новый Массив;
			Для Каждого СтрокаО Из  ТаблицаДоходы Цикл
				мПроектныеЗадачи.Добавить(СтрокаО.ПроектнаяЗадача);
			КонецЦикла;
			СправочникПроектПоДокументуПЗ = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(мПроектныеЗадачи,, Истина);
			
			Для Каждого СтрокаО Из  ТаблицаДоходы Цикл
				
				НоваяСтрока = Объект.Доходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаО);
				
				Если НоваяСтрока.Количество > 0 Тогда
					
					НоваяСтрока.Стоимость =  НоваяСтрока.Сумма /  НоваяСтрока.Количество;
					
				КонецЕсли;
				
				НоваяСтрока.ПроектнаяЗадачаПроект = СправочникПроектПоДокументуПЗ.Получить(НоваяСтрока.ПроектнаяЗадача);
				
				Если СвойстваПроекта.ДоходыПоПодразделениям Тогда
					
					ОтборРаспределения = Новый Структура;
					
					ОтборРаспределения.Вставить("ПроектнаяЗадача", СтрокаО.ПроектнаяЗадача);
					ОтборРаспределения.Вставить("Статья", СтрокаО.Статья);
					ОтборРаспределения.Вставить("Контрагент", СтрокаО.Контрагент);
					ОтборРаспределения.Вставить("Договор", СтрокаО.Договор);
					ОтборРаспределения.Вставить("Валюта", СтрокаО.Валюта);
					ОтборРаспределения.Вставить("Номенклатура", СтрокаО.Номенклатура);
					ОтборРаспределения.Вставить("ЕдиницаИзмерения", СтрокаО.ЕдиницаИзмерения);
					ОтборРаспределения.Вставить("ДатаНачисления", СтрокаО.ДатаНачисления);
					ОтборРаспределения.Вставить("ВидЭлемента", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход);
					
					НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(ОтборРаспределения); 
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						
						НоваяСтрока.ИндексСтрокРаспределения = Неопределено;
						
					Иначе
						
						НоваяСтрока.ИндексСтрокРаспределения = Счетчик;
						
						Для Каждого НайденнаяСтрокаРаспределения Из НайденныеСтроки Цикл
							
							НоваяСтрокаРаспределения = Объект.РаспределениеДоходов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, НайденнаяСтрокаРаспределения);
							НоваяСтрокаРаспределения.ИндексСтрокиВладельца = Счетчик;
							
						КонецЦикла;
						
						Счетчик = Счетчик + 1;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнятьРасходы Тогда
		
		Объект.Расходы.Очистить();
		Объект.РаспределениеРасходов.Очистить();
		
		Если ТаблицаРезультат <> Неопределено Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("ВидЭлемента",Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход);
			
			ТаблицаРасходы = ТаблицаРезультат.Скопировать(Отбор);
			ТаблицаРасходы.Свернуть("ПроектнаяЗадача, Статья, Контрагент, Договор, Валюта, Номенклатура, ЕдиницаИзмерения, ДатаНачисления",
			"Сумма,Количество");
			
			Счетчик = 0;
			
			// Кеширование
			мПроектныеЗадачи = Новый Массив;
			Для Каждого СтрокаО Из  ТаблицаРасходы Цикл
				мПроектныеЗадачи.Добавить(СтрокаО.ПроектнаяЗадача);
			КонецЦикла;
			СправочникПроектПоДокументуПЗ = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(мПроектныеЗадачи,, Истина);
			
			
			Для Каждого СтрокаО Из  ТаблицаРасходы Цикл
				
				НоваяСтрока = Объект.Расходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаО);
				
				Если НоваяСтрока.Количество > 0 Тогда
					
					НоваяСтрока.Стоимость =  НоваяСтрока.Сумма /  НоваяСтрока.Количество;
					
				КонецЕсли;
				
				НоваяСтрока.ПроектнаяЗадачаПроект = СправочникПроектПоДокументуПЗ.Получить(НоваяСтрока.ПроектнаяЗадача);
				
				Если СвойстваПроекта.РасходыПоПодразделениям Тогда
					
					ОтборРаспределения = Новый Структура;
					
					ОтборРаспределения.Вставить("ПроектнаяЗадача", СтрокаО.ПроектнаяЗадача);
					ОтборРаспределения.Вставить("Статья", СтрокаО.Статья);
					ОтборРаспределения.Вставить("Контрагент", СтрокаО.Контрагент);
					ОтборРаспределения.Вставить("Договор", СтрокаО.Договор);
					ОтборРаспределения.Вставить("Валюта", СтрокаО.Валюта);
					ОтборРаспределения.Вставить("Номенклатура", СтрокаО.Номенклатура);
					ОтборРаспределения.Вставить("ЕдиницаИзмерения", СтрокаО.ЕдиницаИзмерения);
					ОтборРаспределения.Вставить("ДатаНачисления", СтрокаО.ДатаНачисления);
					ОтборРаспределения.Вставить("ВидЭлемента", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход);
					
					НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(ОтборРаспределения); 
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						
						НоваяСтрока.ИндексСтрокРаспределения = Неопределено;
						
					Иначе
						
						НоваяСтрока.ИндексСтрокРаспределения = Счетчик;
						
						Для Каждого НайденнаяСтрокаРаспределения Из НайденныеСтроки Цикл
							
							НоваяСтрокаРаспределения = Объект.РаспределениеРасходов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, НайденнаяСтрокаРаспределения);
							НоваяСтрокаРаспределения.ИндексСтрокиВладельца = Счетчик;
							
						КонецЦикла;
						
						Счетчик = Счетчик + 1;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Проект)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВыполненныеОбъемыПоРегистратору(Объект, Основание,  ЗаполнятьДоходы, ЗаполнятьРасходы)
	
	ЗапросФО = Новый Запрос;
	ЗапросФО.Текст =  "ВЫБРАТЬ
	                  |	упоФактВыполненияОбъемовОбороты.Период КАК ДатаНачисления,
	                  |	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача,
	                  |	упоФактВыполненияОбъемовОбороты.Статья,
	                  |	ВЫБОР
	                  |		КОГДА упоФактВыполненияОбъемовОбороты.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)
	                  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	                  |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	                  |	КОНЕЦ КАК ВидЭлемента,
	                  |	упоФактВыполненияОбъемовОбороты.Контрагент,
	                  |	упоФактВыполненияОбъемовОбороты.Договор,
	                  |	упоФактВыполненияОбъемовОбороты.Валюта,
	                  |	упоФактВыполненияОбъемовОбороты.Подразделение,
	                  |	упоФактВыполненияОбъемовОбороты.Роль,
	                  |	упоФактВыполненияОбъемовОбороты.Номенклатура,
	                  |	упоФактВыполненияОбъемовОбороты.ЕдиницаИзмерения,
	                  |	упоФактВыполненияОбъемовОбороты.Сценарий,
	                  |	упоФактВыполненияОбъемовОбороты.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	                  |	упоФактВыполненияОбъемовОбороты.СобствСилы_Субподряд,
	                  |	упоФактВыполненияОбъемовОбороты.КонтрагентПодрядчик,
	                  |	упоФактВыполненияОбъемовОбороты.СуммаВалютная КАК Сумма,
	                  |	упоФактВыполненияОбъемовОбороты.Количество
	                  |ИЗ
	                  |	РегистрНакопления.упоФактВыполненияОбъемовОбороты КАК упоФактВыполненияОбъемовОбороты
	                  |ГДЕ
	                  |	упоФактВыполненияОбъемовОбороты.Регистратор = &Основание";
	
	ЗапросФО.УстановитьПараметр("Основание", Основание);
	ТаблицаРезультат = ЗапросФО.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;	
	
КонецФункции

Функция ПолучитьТаблицуОснованиеВерсии(Объект, Основание,  ЗаполнятьДоходы = Ложь, ЗаполнятьРасходы = Ложь)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
		ТекстУсловия = ",	Версия = &ТекущаяВерсия И ПроектнаяЗадача = &Основание";
		ОтборНеОтмененых = "";
		
	Иначе
		
		текущаяВерсия = Основание;		 
		ТекстУсловия = ",Версия = &ТекущаяВерсия";
		ОтборНеОтмененых = "		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	                       |		ПО упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	                       |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
		
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления,
	 |	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная) КАК Сумма,
	 |	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество) КАК Количество,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика
	 |ИЗ
	 |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(%ТекстУсловия%) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	 |%ОтборНеОтмененых%
	 |ГДЕ
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная > 0
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик,
	 |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ТекстУсловия%", ТекстУсловия);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ОтборНеОтмененых%", ОтборНеОтмененых);
	
	ЗапросОбъемов = Новый Запрос;
	ЗапросОбъемов.УстановитьПараметр("Основание", Основание);	
	ЗапросОбъемов.УстановитьПараметр("ТекущаяВерсия",  текущаяВерсия);
	
	ЗапросОбъемов.Текст = ТекстЗапроса;	
	
	ТаблицаРезультат = ЗапросОбъемов.Выполнить().Выгрузить();
	
	ТаблицаКопия = ТаблицаРезультат.СкопироватьКолонки();
	
	Если ЗаполнятьДоходы Тогда
		
		Для Каждого СтрокаТР Из ТаблицаРезультат Цикл
			
			Если СтрокаТР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
				
				НоваяСтрока = ТаблицаКопия.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТР);
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если ЗаполнятьРасходы Тогда
		
		Для Каждого СтрокаТР Из ТаблицаРезультат Цикл
			
			Если СтрокаТР.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход Тогда
				
				НоваяСтрока = ТаблицаКопия.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТР);
				
			КонецЕсли;
			
		КонецЦикла;			
		
	КонецЕсли;
	
	Возврат ТаблицаКопия;
	
КонецФункции

Функция ПолучитьОстаткиВыполненныхОбъемов(Объект,  ЗаполнятьДоходы, ЗаполнятьРасходы)
	
	ЗапросОстатков = Новый Запрос;
	ЗапросОстатков.Текст = "ВЫБРАТЬ
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Статья КАК Статья,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.ВидОбъема КАК ВидОбъема,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Контрагент КАК Контрагент,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Договор КАК Договор,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Валюта КАК Валюта,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Подразделение КАК Подразделение,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Роль КАК Роль,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Номенклатура КАК Номенклатура,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Сценарий КАК Сценарий,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.СуммаВалютнаяРасход КАК СуммаВалютнаяРасход,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.СуммаВалютнаяПриход КАК СуммаВалютнаяПриход,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Регистратор КАК Регистратор,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход
	                       |ПОМЕСТИТЬ ВТ_Остатки
	                       |ИЗ
	                       |	РегистрНакопления.упоВыполненныеПринятыеОбъемы.ОстаткиИОбороты(, , Авто, , ПроектнаяЗадача.Проект = &Проект) КАК упоВыполненныеПринятыеОбъемыОстаткиИОбороты
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	                       |				,
	                       |				Версия В
	                       |					(ВЫБРАТЬ
	                       |						упоВерсииПроекта.Версия КАК Версия
	                       |					ИЗ
	                       |						РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	                       |					ГДЕ
	                       |						упоВерсииПроекта.Проект = &Проект
	                       |						И упоВерсииПроекта.Текущая)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	                       |		ПО упоВыполненныеПринятыеОбъемыОстаткиИОбороты.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	                       |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	                       |ГДЕ
	                       |	упоВыполненныеПринятыеОбъемыОстаткиИОбороты.Регистратор <> &Регистратор
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_Остатки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	ВТ_Остатки.Статья КАК Статья,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_Остатки.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)
	                       |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	                       |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	                       |	КОНЕЦ КАК ВидЭлемента,
	                       |	ВТ_Остатки.Контрагент КАК Контрагент,
	                       |	ВТ_Остатки.Договор КАК Договор,
	                       |	ВТ_Остатки.Валюта КАК Валюта,
	                       |	ВТ_Остатки.Подразделение КАК Подразделение,
	                       |	ВТ_Остатки.Роль КАК Роль,
	                       |	ВТ_Остатки.Номенклатура КАК Номенклатура,
	                       |	ВТ_Остатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ВТ_Остатки.Сценарий КАК Сценарий,
	                       |	ВТ_Остатки.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	                       |	ВТ_Остатки.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                       |	ВТ_Остатки.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	                       |	СУММА(ВТ_Остатки.СуммаВалютнаяПриход - ВТ_Остатки.СуммаВалютнаяРасход) КАК Сумма,
	                       |	&ТекущаяДата КАК ДатаНачисления,
	                       |	СУММА(ВТ_Остатки.КоличествоПриход - ВТ_Остатки.КоличествоРасход) КАК Количество
	                       |ИЗ
	                       |	ВТ_Остатки КАК ВТ_Остатки
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВТ_Остатки.Статья,
	                       |	ВТ_Остатки.ПроектнаяЗадача,
	                       |	ВТ_Остатки.Контрагент,
	                       |	ВТ_Остатки.Договор,
	                       |	ВТ_Остатки.Валюта,
	                       |	ВТ_Остатки.Подразделение,
	                       |	ВТ_Остатки.Роль,
	                       |	ВТ_Остатки.Номенклатура,
	                       |	ВТ_Остатки.ЕдиницаИзмерения,
	                       |	ВТ_Остатки.Сценарий,
	                       |	ВТ_Остатки.Заказ_ДоговорПодрядчика,
	                       |	ВТ_Остатки.СобствСилы_Субподряд,
	                       |	ВТ_Остатки.КонтрагентПодрядчик,
	                       |	ВЫБОР
	                       |		КОГДА ВТ_Остатки.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)
	                       |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
	                       |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	                       |	КОНЕЦ";
	
	ЗапросОстатков.УстановитьПараметр("Проект", Объект.Проект);
	ЗапросОстатков.УстановитьПараметр("ТекущаяДата",Объект.Дата);
	ЗапросОстатков.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	ТаблицаОстатков = ЗапросОстатков.Выполнить().Выгрузить();
	ТаблицаКопия = ТаблицаОстатков.СкопироватьКолонки();
	
	Для Каждого СтрокаОстатков Из ТаблицаОстатков Цикл
		
		Если (СтрокаОстатков.Количество + СтрокаОстатков.Сумма) <> 0 Тогда
			
			НоваяСтрока = ТаблицаКопия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаКопия;
	
КонецФункции

#КонецОбласти

#КонецЕсли