
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем мВалютаУправленческогоУчета Экспорт; // Хранит валюту упр. учета из константы ВалютаУправленческогоУчета.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки
	ИначеЕсли ИмяТабличнойЧасти = "Доходы" Тогда
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадачаПроект");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		СтруктураОбязательныхПолей.Вставить("Сумма");
	ИначеЕсли ИмяТабличнойЧасти = "Расходы" Тогда
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадачаПроект");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		СтруктураОбязательныхПолей.Вставить("Сумма");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьДанныеПередЗаписью()

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
//  Заголовок    - Строка - содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура для вызова при подборе ресурсов.
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти	 - строка табличной части "ДвиженияДенежныхСредств". 
//  ПараметрыПодбора	 - СписокЗначений со вспомогательными параметрами.
//
Процедура ВыполнитьДействияПриПодборе(Знач СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт

	имяРеквизитаВалютыДоговора = упоУправлениеДоговорамиКлиентСервер.ИмяРеквизитаВалютыДоговора();
	
	Если Не ПараметрыПодбора = Неопределено Тогда      
		
		Для Каждого ПараметрПодбора Из ПараметрыПодбора Цикл
			
			// прямое обращение к реквизитам на всякий случай оборачиваем в try
			Попытка 				
				Если ПараметрПодбора.Представление = "ИмяТабличнойЧасти" Тогда      					
					Если ПараметрПодбора.Значение = "Доходы" Или ПараметрПодбора.Значение = "Расходы" Тогда     
						
						// попробуем определить договор контрагента по умолчанию
						
						Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаТабличнойЧасти.Контрагент) Тогда      
							СтрокаТабличнойЧасти.Договор = СтрокаТабличнойЧасти.Контрагент.упоОсновнойДоговорКонтрагента;
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Договор) Тогда      
							СтрокаТабличнойЧасти.Валюта = СтрокаТабличнойЧасти.Договор[имяРеквизитаВалютыДоговора];
						Иначе
							СтрокаТабличнойЧасти.Валюта = мВалютаУправленческогоУчета;
						КонецЕсли;
					КонецЕсли; 			
				КонецЕсли; 
				
			Исключение
				// некорректное имя колонки
			КонецПопытки;
			
		КонецЦикла; 	
	КонецЕсли; 

КонецПроцедуры // ВыполнитьДействияПриПодборе()

// Функция формирует структуру обязательных реквизитов шапки для заданной табличной части документа.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт
	
	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактДоходовИРасходовПоДням.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("Доходы", ПравилаТаблицы);
	
	// Делаем одно движение по ТЧ
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеФактическихДоходов", ПравилаДвижения);
	
	// Правила связи
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Статья", "Статья");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаНачисления");
	ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход));
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("Расходы", ПравилаТаблицы);
	
	// Делаем одно движение по ТЧ
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеФактическихДоходов", ПравилаДвижения);
	
	// Правила связи
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Статья", "Статья");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаНачисления");
	ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход));
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоВыполненныеПринятыеОбъемы.Метаданные().Имя, Правила);
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактДоходовИРасходовОбороты.Метаданные().Имя, Правила);
	
	Возврат ПравилаНаложения; 
	
КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()

// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	// Здесь можно расположить бизнес-логику дополнительной обработки
	// данных движений регистров.
	
	Для каждого Движение Из Движения Цикл
		ТаблицаДвижения = ДанныеДвижений[Движение.Метаданные().Имя];
		упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвижения);
	КонецЦикла;	
	
	ТаблицаДвиженийФактическиеДоходыРасходы = ДанныеДвижений.упоФактДоходовИРасходовПоДням;
	ТаблицаДвиженийФактическиеДоходыРасходы.Свернуть("Период, ПроектнаяЗадача, Статья, ВидЭлемента, Контрагент, Договор, ДатаНачисления, Валюта", "Сумма, СуммаВалютная");
	
	текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	
	СвойстваПроведения = Новый Структура;
	СвойстваПроведения.Вставить("Проект", Проект);
	СвойстваПроведения.Вставить("Версия", текущаяВерсия);
	СвойстваПроведения.Вставить("ПроектнаяЗадача", текущаяВерсия);
	
	упоАналитикаПоПодразделениямСервер.ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(ЭтотОбъект, СвойстваПроведения);
	упоАналитикаПоПодразделениямСервер.ПодготовитьТаблицыДвижений(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);
	
КонецПроцедуры // ПодготовитьДанныеДвижений()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	ТипОснования = ТипЗнч(Основание);
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипОснования) Тогда
		Если Основание.Метаданные().Реквизиты.Найти("Проект") <> Неопределено Тогда
			Проект = Основание.Проект;
		КонецЕсли;
		Документы.упоРегистрацияФактическихДоходовИРасходов.ЗаполнитьОбъектПоОснованию(ЭтотОбъект, Основание, Истина, Истина);
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.Проекты") Тогда
		Проект = Основание;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область Инициализация

мВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли