
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
			
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	ЗаполнитьПроектыНаСервере();
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШаблонТаблицыСравнения()
	
	// Критерии баллов:
	// 1. NPV > 0
	// 2. IRR > Ставка дисконтирования
	// 3. PI Максимальный
	// 4. PBP Минимальный.
	ТаблицаСравнения = Новый ТаблицаЗначений;
	ТаблицаСравнения.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТаблицаСравнения.Колонки.Добавить("ЗаявкаНаПроект", Новый ОписаниеТипов("ДокументСсылка.упоЗаявкаНаПроект"));
	ТаблицаСравнения.Колонки.Добавить("КритерийNPV", Новый ОписаниеТипов("Булево"));
	ТаблицаСравнения.Колонки.Добавить("КритерийIRR", Новый ОписаниеТипов("Число"));
	ТаблицаСравнения.Колонки.Добавить("КритерийPI", Новый ОписаниеТипов("Число"));
	ТаблицаСравнения.Колонки.Добавить("КритерийPBP", Новый ОписаниеТипов("Число"));
	ТаблицаСравнения.Колонки.Добавить("Балл", Новый ОписаниеТипов("Число"));
	ТаблицаСравнения.Колонки.Добавить("БаллСтратегии", Новый ОписаниеТипов("Число"));	
	
	Возврат ТаблицаСравнения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПроектыНаСервере()
	
	Объект.Проекты.Очистить();
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.упоСтатусыЗаявокНаПроект.Инициировано);
	МассивСтатусов.Добавить(Перечисления.упоСтатусыЗаявокНаПроект.НаРассмотрении);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусыЗаявокНаПроектСрезПоследних.ЗаявкаНаПроект КАК ЗаявкаНаПроект,
	               |	упоЗаявкаНаПроект.Проект КАК Проект
	               |ПОМЕСТИТЬ втЗаявки
	               |ИЗ
	               |	РегистрСведений.упоСтатусыЗаявокНаПроект.СрезПоследних КАК упоСтатусыЗаявокНаПроектСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоЗаявкаНаПроект КАК упоЗаявкаНаПроект
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |			ПО упоЗаявкаНаПроект.Проект = Проекты.Ссылка
	               |		ПО упоСтатусыЗаявокНаПроектСрезПоследних.ЗаявкаНаПроект = упоЗаявкаНаПроект.Ссылка
	               |			И (упоСтатусыЗаявокНаПроектСрезПоследних.Статус В (&МассивСтатусов))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ЗаявкаНаПроект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втЗаявки.Проект КАК Проект,
	               |	втЗаявки.ЗаявкаНаПроект КАК ЗаявкаНаПроект,
	               |	ЕСТЬNULL(упоСоответствиеСтратегическимЦелямСрезПоследних.Балл, 0) КАК БаллСтратегии
	               |ИЗ
	               |	втЗаявки КАК втЗаявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеСтратегическимЦелям.СрезПоследних(
	               |				,
	               |				ЗаявкаНаПроект В
	               |					(ВЫБРАТЬ
	               |						втЗаявки.ЗаявкаНаПроект КАК ЗаявкаНаПроект
	               |					ИЗ
	               |						втЗаявки КАК втЗаявки)) КАК упоСоответствиеСтратегическимЦелямСрезПоследних
	               |		ПО втЗаявки.Проект = упоСоответствиеСтратегическимЦелямСрезПоследних.Проект
	               |			И втЗаявки.ЗаявкаНаПроект = упоСоответствиеСтратегическимЦелямСрезПоследних.ЗаявкаНаПроект";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Соединения = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[1].Соединения;	
			
	ПоляОтбора = Новый Массив;
	ПоляОтбора.Добавить("Подразделение");
	ПоляОтбора.Добавить("ПортфельПроектов");
	ПоляОтбора.Добавить("ПрограммаПроектов");
		
	ЕстьОтбор = Ложь;
	ШаблонУсловия = "Проекты.%1 = &%1";
	Для Каждого ПолеОтбора Из ПоляОтбора Цикл		
		Если ЗначениеЗаполнено(Объект[ПолеОтбора]) Тогда
			Запрос.УстановитьПараметр(ПолеОтбора, Объект[ПолеОтбора]);	
			Соединения.Добавить("Проекты", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУсловия, ПолеОтбора));
			ЕстьОтбор = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОтбор Тогда
		Для Каждого Соединение Из Соединения Цикл
			Соединение.ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;
		КонецЦикла;
	КонецЕсли;	
		
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
			
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСравнения = ШаблонТаблицыСравнения();
	ПоказательСтавка = Константы.упоПоказательСтавкаДисконтирования.Получить();
	ВесаКритериев = Новый Структура;	
	ВесаКритериев.Вставить("КритерийIRR", 100);
	ВесаКритериев.Вставить("КритерийPI", 500);
	ВесаКритериев.Вставить("КритерийPBP", 10);
			
	ПоказателиМенеджер = Справочники.упоПоказателиПроектов;
	Показатели = Новый Массив;
	Показатели.Добавить(ПоказателиМенеджер.NPV);
	Показатели.Добавить(ПоказателиМенеджер.IRR);
	Показатели.Добавить(ПоказателиМенеджер.PBP);
	Показатели.Добавить(ПоказателиМенеджер.PI);
	Показатели.Добавить(ПоказательСтавка);
	
	Проекты = Результат.Выгрузить().ВыгрузитьКолонку("Проект");
	
	ЗначенияПоказателейПроекта = упоПоказателиПроектовСервер.ПолучитьЗначенияПоказателей(Показатели, Проекты);
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл			
		НоваяСтрока = ТаблицаСравнения.Добавить();			
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
		ЗаполнитьКритерииСравнения(НоваяСтрока, ПоказательСтавка, ВесаКритериев, ПоказателиМенеджер, ЗначенияПоказателейПроекта);				
	КонецЦикла; 		
	ТаблицаСравнения.Сортировать("Балл УБЫВ");
	
	Объект.Проекты.Загрузить(ТаблицаСравнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьКритерииСравнения(СтрокаПроекта, ПоказательСтавка, ВесаКритериев, ПоказателиМенеджер, ЗначенияПоказателейПроекта)
	
	Проект = СтрокаПроекта.Проект;			
	
	NPV = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроекта,
		ПоказателиМенеджер.NPV, Проект);
	СтрокаПроекта.КритерийNPV =  NPV > 0;
	
	Если СтрокаПроекта.КритерийNPV Тогда
		
		IRR = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроекта,
			ПоказателиМенеджер.IRR, Проект);
		СтавкаДисконтирования = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроекта,
			ПоказательСтавка, Проект);
				
		СтрокаПроекта.КритерийIRR = IRR - СтавкаДисконтирования;
		
		СтрокаПроекта.КритерийPBP = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроекта, 
			ПоказателиМенеджер.PBP, Проект);
		СтрокаПроекта.КритерийPI = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроекта,
			ПоказателиМенеджер.PI, Проект);
		
	КонецЕсли;	
	
	Для Каждого ВесКритерия Из ВесаКритериев Цикл
		СтрокаПроекта.Балл = СтрокаПроекта.Балл + ВесКритерия.Значение * СтрокаПроекта[ВесКритерия.Ключ];
	КонецЦикла;
	
	СтрокаПроекта.Балл = СтрокаПроекта.Балл + СтрокаПроекта.БаллСтратегии;
	
КонецФункции	

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти
