
#Область СлужебныйПрограммныйИнтерфейс

// Распределяет массив трудозатрат равномерно по месяцам в периоде.
//
// Параметры:
//  ДатаНачала			 - Дата
//  ДатаЗавершения		 - Дата
//  Календарь			 - СправочникСсылка.упоРабочиеКалендари
//  СуммаКРаспределению	 - Число
//  ПолучатьПериоды		 - Булево
// 
// Возвращаемое значение:
//  Массив
//
Функция МассивТрудозатратРавномерноПоМесяцамВПериоде(Знач ДатаНачала, 
														Знач ДатаЗавершения, 
														Знач Календарь, 
														Знач СуммаКРаспределению, 
														Знач ПолучатьПериоды = Ложь) Экспорт
		
	мКоэффициентов = Новый Массив;	
	Если ПолучатьПериоды Тогда
		мПериоды = Новый Массив;
	КонецЕсли;	
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочийКалендарь", Календарь);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаЗавершения", ДатаЗавершения);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НАЧАЛОПЕРИОДА(РегКалендарь.День, МЕСЯЦ) КАК Период,
	               |	СУММА(РегКалендарь.КоличествоЧасов) КАК КоличествоЧасов
	               |ИЗ
	               |	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	               |			,
	               |			Календарь = &РабочийКалендарь
	               |				И (День МЕЖДУ &ДатаНачала И &ДатаЗавершения)) КАК РегКалендарь	             
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(РегКалендарь.День, МЕСЯЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл		
		Если ПолучатьПериоды Тогда
			мПериоды.Добавить(Выборка.Период);
		КонецЕсли;		
		мКоэффициентов.Добавить(Выборка.КоличествоЧасов);	
	КонецЦикла;	
			
	Если мКоэффициентов.Количество() > 1 Тогда
		мТрудозатраты = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКРаспределению, 
																									мКоэффициентов, 
																									2);
	Иначе
		мТрудозатраты = Новый Массив;
		мТрудозатраты.Добавить(СуммаКРаспределению);
	КонецЕсли;
	
	Результат = Новый Структура("Трудозатраты", мТрудозатраты);
	Если ПолучатьПериоды Тогда
		Результат.Вставить("Периоды", мПериоды);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Запускает фоновое отражение документов с передачей результата на клиент.
//
// Параметры:
//  ПараметрыПроцедуры	 - Структура			 - произвольные параметры вызова процедуры ИмяПроцедуры.
//  ИдентификаторФормы	 - УникальныйИдентификатор	 - уникальный идентификатор формы,
//  	во временное хранилище которой надо поместить результат выполнения процедуры.
// 
// Возвращаемое значение:
//  Структура - результат выполнения задания (см.ДлительныеОперации.ВыполнитьВФоне()).
//
Функция ЗапуститьФоновоеОтражениеДокументовКонтекстКлиента(Знач ПараметрыПроцедуры, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыПроцедуры.ПроектныеЗадачи = 
		упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(ПараметрыПроцедуры.ПроектныеЗадачи);
	
	Возврат упоРаботаСОчередямиВызовСервера.ЗапуститьФоновоеЗаданиеКонтекстКлиента(ИмяПроцедурыОтражения(), 
		ПараметрыПроцедуры, 
		ИдентификаторФормы,
		НаименованиеФоновогоЗаданияОтражения(),
		КлючФоновогоЗаданияОтражения());
	
КонецФункции

// Вызыов метода упоРаспределениеТрудозатратВызовСервера.ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач
//  для фонового выполнения.
//
// Параметры:
//  ПараметрыВыполнения	 - Структура, Неопределено	 - параметры отражения первичного документа.
//  АдресРезультата		 - Строка, Неопределено		 - Адрес временного хранилища для помещения результата.
//
Процедура ЗапуститьФоновоеОтражениеДокументов(ПараметрыВыполнения = Неопределено, АдресРезультата = Неопределено) Экспорт
	
	ПроектныеЗадачи = Неопределено;
	ПараметрыВыполнения.Свойство("ПроектныеЗадачи", ПроектныеЗадачи);
	
	Если ПроектныеЗадачи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	упоРаспределениеТрудозатратВызовСервера.ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач(ПроектныеЗадачи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеФоновогоЗаданияОтражения() 
	
	Возврат НСтр("ru = 'Отражение плановых трудозатрат: Отражение в фоне.'");	
	
КонецФункции

Функция ИмяПроцедурыОтражения()
		
	Возврат "упоПланированиеТрудозатратВызовСервера.ЗапуститьФоновоеОтражениеДокументов";
	
КонецФункции	

Функция КлючФоновогоЗаданияОтражения() 
	
	КлючФоновогоЗадания = "ОтражениеПлановыхТрудозатрат";
	
	КлючФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1_%2", 
		КлючФоновогоЗадания, 
		упоРаботаСОчередямиВызовСервера.РазделительСеансовыхДанных());
	
	Возврат КлючФоновогоЗадания; 
	
КонецФункции

#КонецОбласти
