#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СотрудникиДляИзмененияСмены(Организация, Подразделение, СменаРабот, ДатаИзменения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Параметры = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	Параметры.Организация = Организация;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Параметры.Подразделение = Подразделение;
	КонецЕсли;
	
	Параметры.НачалоПериода 	= ДатаИзменения;
	Параметры.ОкончаниеПериода 	= ДатаИзменения;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Модуль.ДобавитьОтборыПоВидуДоговора(Параметры.Отборы);
	КонецЕсли; 
	
	СотрудникиНаДату = КадровыйУчет.СотрудникиОрганизации(Истина, Параметры).ВыгрузитьКолонку("Сотрудник");
	
	Запрос.УстановитьПараметр("Сотрудники", СотрудникиНаДату); 
	Запрос.УстановитьПараметр("СменаРабот", СменаРабот);
	Запрос.УстановитьПараметр("НаДату", НачалоДня(ДатаИзменения)-1);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ЕСТЬNULL(ИКТ_СменыРаботСотрудниковСрезПоследних.СменаРабот, ЗНАЧЕНИЕ(Справочник.ИКТ_СменыРабот.ПоУмолчанию)) КАК ТекущаяСменаРабот
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИКТ_СменыРаботСотрудников.СрезПоследних(&НаДату, СменаРабот <> &СменаРабот) КАК ИКТ_СменыРаботСотрудниковСрезПоследних
	|		ПО Сотрудники.Ссылка = ИКТ_СменыРаботСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	Сотрудники.Ссылка В(&Сотрудники)";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецЕсли