#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаИзменения, "Объект.ДатаИзменения", Отказ, НСтр("ru='Дата изменения'"), , , Ложь);
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.Организация				= Организация;
	ПараметрыПолученияСотрудниковОрганизаций.Подразделение				= Подразделение;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода				= ДатаИзменения;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода			= ДатаОкончания;
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоДоговорамГПХ	= Неопределено;
	ПараметрыПолученияСотрудниковОрганизаций.ИсключаемыйРегистратор		= Ссылка;
	
	КадровыйУчет.ПроверитьРаботающихСотрудников(
		Сотрудники.ВыгрузитьКолонку("Сотрудник"),
		ПараметрыПолученияСотрудниковОрганизаций,
		Отказ,
		Новый Структура("ИмяПоляСотрудник, ИмяОбъекта", "Сотрудник", "Объект.Сотрудники"));
	
	Если ЗначениеЗаполнено(ДатаОкончания) И ДатаИзменения > ДатаОкончания Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата окончания не может быть меньше даты начала изменения смены работы'"), ЭтотОбъект, "ДатаОкончания", ,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокумент(ВремяРегистрации) Экспорт
		
	Менеджер = Документы.ИКТ_ИзменениеСменыРабот;
	
	Сотрудники.Очистить();
	
	ТЗСотрудников = Менеджер.СотрудникиДляИзмененияСмены(Организация, Подразделение, СменаРабот, ДатаИзменения);
	
	Для Каждого Сотрудник Из ТЗСотрудников Цикл
		
		Если Сотрудники.Найти(Сотрудник, "Сотрудник") = Неопределено Тогда
			
			НоваяСтрокаСотрудника = Сотрудники.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСотрудника, Сотрудник);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// регистр ИКТ_СменыРаботСотрудников
	Движения.ИКТ_СменыРаботСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.ИКТ_СменыРаботСотрудников.Добавить();
		
		Движение.Период = ДатаИзменения+60;
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.СменаРабот = СменаРабот;
		Движение.ДействуетДо = КонецДня(ДатаОкончания)+1;
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Движение = Движения.ИКТ_СменыРаботСотрудников.Добавить();	
			
			Движение.Период = КонецДня(ДатаОкончания)+1;
			Движение.Организация = Организация;
			Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
			Движение.СменаРабот = ТекСтрокаСотрудники.ТекущаяСменаРабот;
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры

#КонецЕсли