
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗаполнитьНаименованияПроектныхЗадачВТаблице();
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	Элементы.ДДС_ПараметрыПодбора_НаправлениеПоступление.Пометка = Истина;
	
	Для Каждого СтрокаТЧ Из Объект.ДвиженияДенежныхСредств Цикл
		упоРаботаСФормамиКлиент.УстановитьИконкуНаправленияВТаблицеДДС(СтрокаТЧ);
	КонецЦикла;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьНаименованияПроектныхЗадачВТаблице();
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Для Каждого СтрокаТЧ Из Объект.ДвиженияДенежныхСредств Цикл
		упоРаботаСФормамиКлиент.УстановитьИконкуНаправленияВТаблицеДДС(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДвиженияДенежныхСредств

&НаКлиенте
Процедура ДвиженияДенежныхСредствНаправлениеДвиженияПриИзменении(Элемент)
	
	текДанные = Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
	упоРаботаСФормамиКлиент.УстановитьИконкуНаправленияВТаблицеДДС(текДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствСтатьяДДСПриИзменении(Элемент)
	
	текДанные = Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
	
	УстановитьНаправлениеДС(текДанные);	
		
	упоРаботаСФормамиКлиент.УстановитьИконкуНаправленияВТаблицеДДС(текДанные);
			
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекСтрока = Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
		
		Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
			
			ПараметрыПодбораСтруктура = Неопределено;
			ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ДвиженияДенежныхСредств");		
			
			ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);			
			упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки,
				ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
			ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);
			
			Если ПараметрыПодбораСтруктура.СтруктураСтроки.Свойство("НаправлениеДвижения") Тогда
				
				упоРаботаСФормамиКлиент.УстановитьИконкуНаправленияВТаблицеДДС(ТекСтрока);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	       
	ЗаполнитьНаименованиеВСтрокеТЧ(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствСсылкаНаРегистраторОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	 	  
	ТекДанные = Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
			
	СтрокаТЧ = "Объект.ДвиженияДенежныхСредств[" + Строка(ТекДанные.НомерСтроки - 1) + "].СсылкаНаРегистратор";
	ПараметрыПерехода = Новый Структура;
	ПараметрыПерехода.Вставить("СсылкаНаРегистратор", 	  		 ТекДанные.СсылкаНаРегистратор);
	ПараметрыПерехода.Вставить("ПолеНаФормеСсылкаНаРегистратор", СтрокаТЧ);
	ПараметрыПерехода.Вставить("ИсточникДанных", 		  		 Объект.ИсточникДанных);
	ПараметрыПерехода.Вставить("ПолеНаФормеИсточникДанных", 	 "Объект.ИсточникДанных");
	упоИнтеграцияКлиент.ПерейтиПоСсылкеНаРегистратор(ПараметрыПерехода);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствДоговорПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма,"ДвиженияДенежныхСредств");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборВТЧФормы(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		
	
КонецПроцедуры

&НаКлиенте
Процедура ДДС_ПараметрыПодбора_Направление(Команда)
	
	Если Команда.Имя = "ДДС_ПараметрыПодбора_НаправлениеВыплата" Тогда
		
		Элементы.ДДС_ПараметрыПодбора_НаправлениеВыплата.Пометка = Истина;
		Элементы.ДДС_ПараметрыПодбора_НаправлениеПоступление.Пометка = Ложь;
		
	ИначеЕсли Команда.Имя = "ДДС_ПараметрыПодбора_НаправлениеПоступление" Тогда
		
		Элементы.ДДС_ПараметрыПодбора_НаправлениеВыплата.Пометка = Ложь;
		Элементы.ДДС_ПараметрыПодбора_НаправлениеПоступление.Пометка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	АдресХранилища = "";
	
	Если  имяКоманды = "ДействиеПодобрать_ДДС_ПоСтатьям" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ДвиженияДенежныхСредств;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.СтатьиДвиженияДенежныхСредств";
		ТаблицаФормы = Объект.ДвиженияДенежныхСредств;
		ИмяКолонки = "СтатьяДДС";
		ПараметрыПодбора.ДопПараметры.ПовторныйВыбор = Истина;
		
	ИначеЕсли  имяКоманды = "ДействиеПодобрать_ДДС_ПоКонтрагентам" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ДвиженияДенежныхСредств;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.Контрагенты";
		ТаблицаФормы = Объект.ДвиженияДенежныхСредств;
		ИмяКолонки = "Контрагент";
		ПараметрыПодбора.ДопПараметры.ПовторныйВыбор = Истина;
		
	КонецЕсли;
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
	
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьНаименованиеВСтрокеТЧ(СтрокаТЧ) 
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ПроектнаяЗадача) Тогда
		СтрокаТЧ.НазваниеПроектнойЗадачи = упоПроектыИЗадачиВызовСервера.НазваниеПроектнойЗадачи(СтрокаТЧ.ПроектнаяЗадача);
	Иначе
		СтрокаТЧ.НазваниеПроектнойЗадачи = "";
	КонецЕсли;
	
КонецФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	АдресХранилища  = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "СтатьяДДС";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ДвиженияДенежныхСредств");	
		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля,
			Объект.ДвиженияДенежныхСредств, ЭтаФорма, Истина, ПараметрыПодбораСтруктура, Истина);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля =  "Контрагент";
		Иначе 
			имяПоля =  "СтатьяДДС";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ДвиженияДенежныхСредств");	
		
		Если Элементы.ДДС_ПараметрыПодбора_НаправлениеПоступление.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"),"НаправлениеДвижения");
			
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_НаправлениеВыплата.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата"), "НаправлениеДвижения");
			
		КонецЕсли;
		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.ДвиженияДенежныхСредств, ЭтаФорма, Истина, ПараметрыПодбораСтруктура, Истина);		
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ) Экспорт
	
	ПараметрыПодбораСтруктура= Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных =  ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
	Если ИмяТЧ = "ДвиженияДенежныхСредств" Тогда
		
		Если Элементы.ДДС_ПараметрыПодбора_НаправлениеПоступление.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"),"НаправлениеДвижения");
			
		ИначеЕсли Элементы.ДДС_ПараметрыПодбора_НаправлениеВыплата.Пометка Тогда
			
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок.Добавить(
				ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата"), "НаправлениеДвижения");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт 
	
	Если ТипЗнч(ПараметрыПодбора) = Тип("Структура") Тогда
		
		Если ПараметрыПодбора.Свойство("ПараметрыПодбораСписок") Тогда
			
			ЗаполнитьЗначенияСвойств(ПараметрыПодбора.СтруктураСтроки, СтрокаТабличнойЧасти);						
			упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбора.СтруктураСтроки,
				ПараметрыПодбора.ПараметрыПодбораСписок, ПараметрыПодбора.СвойстваОбъекта);
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ПараметрыПодбора.СтруктураСтроки);
			
			Если ПараметрыПодбора.СтруктураСтроки.Свойство("НаправлениеДвижения") Тогда
				
				упоРаботаСФормамиКлиент.УстановитьИконкуНаправленияВТаблицеДДС(СтрокаТабличнойЧасти);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("СтруктураСтрокиТЧ", Новый Структура);
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураСтрокиТЧ, ИмяТЧ);
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)
	
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда 
		
		РеквизитыДокумента = Метаданные.Документы.упоСинхронизацияФактическихДвиженийДенежныхСредств.Реквизиты;
		Для Каждого РеквизитМетаданных Из РеквизитыДокумента Цикл
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);
		
	Иначе 
		
		РеквизитыТЧДокумента = 
			Метаданные.Документы.упоСинхронизацияФактическихДвиженийДенежныхСредств.ТабличныеЧасти[ИмяТЧ].Реквизиты;
		Для Каждого РеквизитМетаданных Из РеквизитыТЧДокумента Цикл
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура УстановитьНаправлениеДС(ТекСтрока = Неопределено)

	Если ТекСтрока = Неопределено Тогда 
		ТекСтрока = Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
	КонецЕсли;

	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ТекСтрока.СтатьяДДС) Тогда
		ТекСтрока.НаправлениеДвижения = ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.ПустаяСсылка");
	Иначе
		ТекСтрока.НаправлениеДвижения =	ПолучитьНаправлениеДвиженияСтатьиДДС(ТекСтрока.СтатьяДДС);
	КонецЕсли;       	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаправлениеДвиженияСтатьиДДС(СтатьяДДС)
	
	Возврат СтатьяДДС.упоНаправлениеДвижения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаименованияПроектныхЗадачВТаблице()
	          		
	МассивТабЧастей = Новый Массив;
	МассивТабЧастей.Добавить(Объект.ДвиженияДенежныхСредств);
	упоРаботаСФормамиСервер.ЗаполнитьНаименованияПЗВТабличныхЧастях(МассивТабЧастей);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти