////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с заданиями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет возможность изменения статуса у Задания.
//
// Параметры:
//  Задание			 - СправочникСсылка.упоЗадания		 - Задание.
//  ТекущийСтатус	 - ПеречислениеСсылка.упоСтатусыЗаданий
//  Статус			 - ПеречислениеСсылка.упоСтатусыЗаданий	 - новый статус.
//  ТекущийСотрудник - СправочникСсылка.упоСотрудники
//  Исполнитель		 - СправочникСсылка.упоТрудовыеРесурсы	 - трудовой ресурс.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ВозможностьИзмененияСтатуса(Задание, ТекущийСтатус, Статус, ТекущийСотрудник, Исполнитель) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Задание.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование")
		И Задание.ЭтоСогласованиеРодитель Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	СтатусДоступен = Ложь;
	
	ТаблицаДоступныхСтатусов = ПолучитьТаблицуДоступныхСтатусов();
	
	ТаблицаДоступныхСтатусов.Колонки.Добавить("ТекущийСтатусСсылка");
	ТаблицаДоступныхСтатусов.Колонки.Добавить("НовыйСтатусСсылка");
	ТаблицаДоступныхСтатусов.Колонки.Добавить("ВидЗаданияСсылка");
	
	Для Каждого СтрокаДоступныйСтатус Из ТаблицаДоступныхСтатусов Цикл
		
		Если СтрокаДоступныйСтатус.ТекущийСтатус = "" Тогда
			СтрокаДоступныйСтатус.ТекущийСтатусСсылка = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.ПустаяСсылка");
		Иначе	
			СтрокаДоступныйСтатус.ТекущийСтатусСсылка = 
				ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий." + СтрокаДоступныйСтатус.ТекущийСтатус);
		КонецЕсли;	
		СтрокаДоступныйСтатус.НовыйСтатусСсылка = 
			ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий." + СтрокаДоступныйСтатус.НовыйСтатус);
		СтрокаДоступныйСтатус.ВидЗаданияСсылка = 
			ПредопределенноеЗначение("Справочник.упоВидыЗаданий." + СтрокаДоступныйСтатус.ВидЗадания);
		
	КонецЦикла;
		
	СтруктураРолей = ПолучитьСтруктуруРолей(Задание, ТекущийСотрудник, Задание.ПроектнаяЗадача, Исполнитель); 
	
	Отбор = Новый Структура; 
	Отбор.Вставить("ТекущийСтатусСсылка", ТекущийСтатус);
	Отбор.Вставить("НовыйСтатусСсылка", Статус);
	Отбор.Вставить("ВидЗаданияСсылка", Задание.ВидЗадания);
	
	СтатусДоступен = НайтиДоступныеСтатусыДляРолей(Отбор, СтруктураРолей, ТаблицаДоступныхСтатусов);
	
	Если НЕ СтатусДоступен Тогда
		Отбор.Вставить("ТекущийСтатусСсылка", ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.ПустаяСсылка"));
		СтатусДоступен = НайтиДоступныеСтатусыДляРолей(Отбор, СтруктураРолей, ТаблицаДоступныхСтатусов);
	КонецЕсли;
	
	Если НЕ СтатусДоступен Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Изменение статуса на ""%1"" недоступно! Текущий статус задания: ""%2"".'"), 
			Статус, ТекущийСтатус);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	Возврат СтатусДоступен;
	
КонецФункции

// Процедура устанавливает статус Задания.
//
// Параметры:
//  Задание								 - СправочникСсылка.упоЗадания
//  НовыйСтатус							 - ПеречислениеСсылка.упоСтатусыЗаданий	 - новый статус.
//  Комментарий							 - Строка
//  ПроверятьВозможность				 - Булево
//  ПроверкаНаЭтоЗаданиеИсполнителяПЗ	 - Булево
// 
// Возвращаемое значение:
//  Булево - результат выполнения Успешно/Не успешно.
//
Функция УстановитьСтатусЗадания(Задание, НовыйСтатус, Комментарий = "", ПроверятьВозможность = Истина,
								ПроверкаНаЭтоЗаданиеИсполнителяПЗ = Истина) Экспорт

	Успешно = Ложь;
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.упоЗаданияСтатусы");
	ЭлементБлокировки.УстановитьЗначение("Задание", Задание);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	ТекущийСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	ТекущийСтатус = упоЗаданияСервер.ПолучитьСтатусЗадания(Задание);
	ДанныеЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задание,
			"Исполнитель, ЭтоСогласованиеРодитель, ВидЗадания, Родитель, ЭтоЗаданиеИсполнителяПроектнойЗадачи, ЗавершеноЗакрытоВручную");
	
	Если ПроверятьВозможность И
		Не упоЗаданияСервер.ВозможностьИзмененияСтатуса(Задание,
			ТекущийСтатус,
			НовыйСтатус,
			ТекущийСотрудник,
			ДанныеЗадания.Исполнитель) Тогда
		
		ОтменитьТранзакцию();
		Возврат Успешно;
		
	КонецЕсли;
	
	Если ПроверкаНаЭтоЗаданиеИсполнителяПЗ Тогда
		
		Если ДанныеЗадания.ЭтоЗаданиеИсполнителяПроектнойЗадачи Тогда
			
			Если НовыйСтатус = Перечисления.упоСтатусыЗаданий.Закрыто Или НовыйСтатус = Перечисления.упоСтатусыЗаданий.Завершено Тогда
				УстановитьЗначенияРеквизитовЗадания(Задание, Ложь, Истина);
			КонецЕсли;
			
		Иначе
			
			Если ДанныеЗадания.ЗавершеноЗакрытоВручную
				И (ТекущийСтатус = Перечисления.упоСтатусыЗаданий.Завершено И НовыйСтатус = Перечисления.упоСтатусыЗаданий.Выполняется
					Или ТекущийСтатус = Перечисления.упоСтатусыЗаданий.Закрыто И НовыйСтатус = Перечисления.упоСтатусыЗаданий.Выдано) Тогда
				
				УстановитьЗначенияРеквизитовЗадания(Задание, Истина, Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Задание, НовыйСтатус, Комментарий);
	
	Если ДанныеЗадания.ВидЗадания = Справочники.упоВидыЗаданий.Согласование
		И Не ДанныеЗадания.ЭтоСогласованиеРодитель Тогда
		
		упоЗаданияСервер.ЗаписатьРезультатВСогласованиеРодитель(ДанныеЗадания.Родитель, Задание);
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Успешно = Истина;
	
	Возврат Успешно;
	
КонецФункции

// Записывает в регистр статус задания.
//
// Параметры:
//  пЗадание	 - СправочникСсылка.упоЗадания			- Задание.
//  пСтатус		 - ПеречислениеСсылка.упоСтатусыЗаданий - текущий статус.
//  пКомментарий - Строка - комментарий. 
//	пАвтор		 - СправочникСсылка.упоСотрудники - Автор изменения статуса.
//
Процедура ЗаписатьВРегистрСтатусЗадания(пЗадание, пСтатус, пКомментарий = "", пАвтор = Неопределено) Экспорт
	
	Если пСтатус = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНовогоСтатуса = ТекущаяДатаСеанса();
	
	статусыЗадания = РегистрыСведений.упоЗаданияСтатусы.СоздатьНаборЗаписей();
	статусыЗадания.Отбор.Задание.Установить(пЗадание);
	статусыЗадания.Отбор.Период.Установить(ДатаНовогоСтатуса);
	
	новСтрока = статусыЗадания.Добавить();
	новСтрока.Период = ДатаНовогоСтатуса;
	новСтрока.Задание = пЗадание;
	новСтрока.Статус = пСтатус;
	
	Попытка
		статусыЗадания.Записать(Ложь);
	Исключение
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОшибкаЗаписиЗадания", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.упоЗадания, пЗадание, ПредставлениеОшибки);
		ТекстСообщения = НСтр("ru = 'Произошла ошибка записи статуса. Подробнее см. журнал регистрации.'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Если пСтатус = Перечисления.упоСтатусыЗаданий.Закрыто 
		Или пСтатус = Перечисления.упоСтатусыЗаданий.Отменено Тогда
		
		упоЗаданияСервер.УдалитьЗаданиеИзВсехОчередей(пЗадание);
		
	КонецЕсли;
	
	Комментарий = Строка(пКомментарий) + 
		?(ПустаяСтрока(пКомментарий), "", "<hr>") + "Статус Задания изменен на """ + Строка(пСтатус) + """";
		
	ПараметрыЗаписи	= ПолучитьСтруктуруПараметровЗаписиКомментыЗаданий(пЗадание, пСтатус, Комментарий, пКомментарий, пАвтор);
		
	ДобавитьЗаписьВРегистрКомментыЗаданий(ПараметрыЗаписи);
	
	упоИнтеграцияПереопределяемый.ПослеЗаписи_СтатусКомментарийЗадания(пЗадание, пСтатус, пКомментарий);
	
КонецПроцедуры

// Записывает в регистр комментарий к заданию.
//
// Параметры:
//	Задание 	- СправочникСсылка.упоЗадания - задание.
//	Комментарий - Строка - комментарий.
//
Процедура ЗаписатьКомментарийЗадания(Задание, Комментарий = "") Экспорт

	Если Задание.ВидЗадания = Справочники.упоВидыЗаданий.Обсуждение Тогда
		//СтруктураРолей = ПолучитьСтруктуруРолей(Задание, ПараметрыСеанса.упоТекущийСотрудник, Задание.ПроектнаяЗадача);
		//Если ЗначениеЗаполнено(Задание.ПроектнаяЗадача) Тогда
		//	Если НЕ (СтруктураРолей.ЯИсполнительПроектнойЗадачи ИЛИ СтруктураРолей.ЯРуководительПроектнойЗадачи) Тогда
		//		Сообщение = Новый СообщениеПользователю;
		//		Сообщение.Текст = НСтр("ru = 'Комментировать задания с видом ""Обсуждение"" могут только исполнители или руководитель проектной задачи!'");
		//		Сообщение.Сообщить();
		//		Возврат;
		//	КонецЕсли;
		//Иначе	
		//	Если НЕ (СтруктураРолей.ЯИсполнитель ИЛИ СтруктураРолей.ЯАвтор) Тогда
		//		Сообщение = Новый СообщениеПользователю;
		//		Сообщение.Текст = НСтр("ru = 'Комментировать задания с видом ""Обсуждение"" могут только исполнитель или автор задания!'");
		//		Сообщение.Сообщить();
		//		Возврат;
		//	КонецЕсли;					
		//КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаписи = ПолучитьСтруктуруПараметровЗаписиКомментыЗаданий(Задание, , Комментарий, Комментарий);
	
	ДобавитьЗаписьВРегистрКомментыЗаданий(ПараметрыЗаписи);

КонецПроцедуры

// Изменяет поле регистра.
//
// Параметры:
//  пИмяРегистра	 - Строка 						- имя регистра.
//  пИмяКлюча		 - Строка 						- имя ключа.
//  пКлюч			 - РегистрСведенийКлючЗаписи	- ключ записи регистра сведений.
//  пИмяПараметра	 - Строка 						- имя изменяемого параметра.
//  пПараметр		 - Произвольный 				- значение параметра.
//  СоздаватьНовую	 - Булево 						- признак необходимости создать новую запись.
//
// Возвращаемое значение:
//	Булево - результат выполнения.
//
Функция ИзменитьПолеРегистра(пИмяРегистра, пИмяКлюча, пКлюч, пИмяПараметра, пПараметр, СоздаватьНовую = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(пКлюч) ИЛИ НЕ ЗначениеЗаполнено(пПараметр) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	наборЗаписей = РегистрыСведений[пИмяРегистра].СоздатьНаборЗаписей();
	наборЗаписей.Отбор[пИмяКлюча].Установить(пКлюч);
	наборЗаписей.Прочитать();
	
	Если наборЗаписей.Количество() = 0 И СоздаватьНовую Тогда
		новаяЗапись = наборЗаписей.Добавить();
	ИначеЕсли наборЗаписей.Количество() > 0 Тогда
		новаяЗапись = наборЗаписей[0];
	КонецЕсли;
	
	Если новаяЗапись = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	новаяЗапись[пИмяКлюча] = пКлюч;
	новаяЗапись[пИмяПараметра] = пПараметр;
	
	наборЗаписей.Записать();
	
	Возврат Истина;
	
КонецФункции

// Изменяет поля справочника.
//
// Параметры:
//  пКлюч			 - СправочникСсылка - ссылка на объект.
//  пСтруктураПолей	 - Структура		- структура заполняемых полей.
//  СоздаватьНовую	 - Произвольный		- не используется.
//
// Возвращаемое значение:
//	Булево - результат выполнения.
//
Функция ИзменитьПоляСправочника(пКлюч, пСтруктураПолей, СоздаватьНовую = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(пКлюч) Или пСтруктураПолей.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	лОбъект = пКлюч.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(лОбъект, пСтруктураПолей);
	лОбъект.Записать();
	
	Возврат Истина;
	
КонецФункции

// Изменяет поле справочника.
//
// Параметры:
//  пКлюч			 - СправочникСсылка - ссылка на объект.
//  пИмяПараметра	 - Строка 			- имя поля.
//  пПараметр		 - Произвольный 	- новое значение параметра.
//  СоздаватьНовую	 - Булево			- не используется.
//
// Возвращаемое значение:
//	Булево - результат выполнения.
//
Функция ИзменитьПолеСправочника(пКлюч, пИмяПараметра, пПараметр, СоздаватьНовую = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(пКлюч) Или Не ЗначениеЗаполнено(пПараметр) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ИзменитьПоляСправочника(пКлюч, Новый Структура(пИмяПараметра, пПараметр), СоздаватьНовую);
	
КонецФункции

// Получает статус Задания.
//
// Параметры:
//  пЗадание	 - СправочникСсылка.упоЗадания - Задание.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.упоСтатусыЗаданий - статус.
//
Функция ПолучитьСтатусЗадания(пЗадание) Экспорт
	
	Результат = Перечисления.упоСтатусыЗаданий.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусыЗаданийСрезПоследних.Период,
	               |	упоСтатусыЗаданийСрезПоследних.Задание,
	               |	упоСтатусыЗаданийСрезПоследних.Статус
	               |ИЗ
	               |	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(, Задание = &Задание) КАК упоСтатусыЗаданийСрезПоследних";
	Запрос.УстановитьПараметр("Задание", пЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Статус;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Записывает статус ребенка в родителя.
//
// Параметры:
//  СогласованиеРодитель - СправочникСсылка.упоЗадания	 - родитель.
//  Согласование		 - СправочникСсылка.упоЗадания	 - ребенок.
//
Процедура ЗаписатьРезультатВСогласованиеРодитель(СогласованиеРодитель, Согласование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СогласованиеРодительОбъект = СогласованиеРодитель.ПолучитьОбъект();
	
	ТекущийСтатус = ПолучитьСтатусЗадания(Согласование);
	
	Отбор = Новый Структура("СогласующееЛицо", Согласование.Исполнитель);
	СтрокиСогласующиеЛица = СогласованиеРодительОбъект.СогласующиеЛица.НайтиСтроки(Отбор);
	Для Каждого СтрокаСогласующееЛицо Из СтрокиСогласующиеЛица Цикл
		СтрокаСогласующееЛицо.Статус = ТекущийСтатус;
	КонецЦикла; 
	СогласованиеРодительОбъект.Записать();
	
	ПользовательскийКомментарий = ПолучитьПоследнийКомментарий(Согласование);
	
	СогласованиеЗавершено = Истина;
	Если СогласованиеРодительОбъект.ВидСогласования =
		ПредопределенноеЗначение("Перечисление.упоВидыСогласований.Последовательное") Тогда
		
		// При последовательном согласовании, если статус текущего дочернего задания = не согласован,
		// то родительское задание не должно продолжать согласование.
		СтатусСогласованияРодителя = ПолучитьСтатусЗадания(СогласованиеРодитель);
		Если СтатусСогласованияРодителя = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.НаСогласовании")
			И Не ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.НеСогласовано") Тогда
			
			// Создаем согласование для следующего согласующего.
			Для Каждого СтрокаСогласующееЛицо Из СогласованиеРодительОбъект.СогласующиеЛица Цикл
				Если Не ЗначениеЗаполнено(СтрокаСогласующееЛицо.Статус) Тогда
					СогласованиеЗавершено = Ложь;
					СтруктураРеквизитов = ПолучитьСрокиЗадания(СогласованиеРодитель);
					СписокСогласующие = Новый СписокЗначений;
					СписокСогласующие.Добавить(СтрокаСогласующееЛицо.СогласующееЛицо);
					
					СоздатьПодчиненныеЗаданияКопированиемТекущего(СогласованиеРодительОбъект,
						СтруктураРеквизитов,
						СписокСогласующие,
						СогласованиеРодитель.АвторСотрудник);
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	ИначеЕсли СогласованиеРодительОбъект.ВидСогласования =
		ПредопределенноеЗначение("Перечисление.упоВидыСогласований.Параллельное") Тогда
		
		СтатусНеСогласовано = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.НеСогласовано");
		
		Отбор = Новый Структура("Статус", СтатусНеСогласовано);
		ЕстьСтатусыНеСогласовано = СогласованиеРодительОбъект.СогласующиеЛица.НайтиСтроки(Отбор).Количество() <> 0;
		
		Отбор = Новый Структура("Статус", ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.ПустаяСсылка"));
		ЕстьНеУстановленныеСтатусы = СогласованиеРодительОбъект.СогласующиеЛица.НайтиСтроки(Отбор).Количество() <> 0;
		
		// Не меняем статус родителя, пока не дождались согласования по всем подчиненным заданиям, либо если
		// раннее был установлен статус "Не согласовано" другим пользователем.
		Если (ЕстьНеУстановленныеСтатусы Или ЕстьСтатусыНеСогласовано) И ТекущийСтатус <> СтатусНеСогласовано Тогда
			ДобавитьКомментарийРодительскомуСогласованию(СогласованиеРодитель, ТекущийСтатус, ПользовательскийКомментарий);
			Возврат;
		КонецЕсли;
		
		СогласованиеЗавершено = ТекущийСтатус <> СтатусНеСогласовано;
		
	КонецЕсли;
	
	Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.НеСогласовано") Тогда
		СтатусСогласованияРодителя = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.НеСогласовано");
		СогласованиеЗавершено = Истина;
	ИначеЕсли СогласованиеЗавершено Тогда
		СтатусСогласованияРодителя = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Согласовано");
	КонецЕсли;
	
	Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто") Тогда
		
		Если упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(СогласованиеРодительОбъект.ОбъектБазы) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапросаПодчиненныхСогласований();
					
			Запрос.УстановитьПараметр("Родитель", СогласованиеРодительОбъект.Ссылка);
			Запрос.УстановитьПараметр("Статус", ТекущийСтатус);
			Запрос.УстановитьПараметр("Согласование", Согласование);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				СтатусСогласованияРодителя = ТекущийСтатус;
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СогласованиеЗавершено Тогда
		УстановитьСтатусЗадания(СогласованиеРодитель, СтатусСогласованияРодителя, ПользовательскийКомментарий, Ложь);
	Иначе
		ДобавитьКомментарийРодительскомуСогласованию(СогласованиеРодитель, ТекущийСтатус, ПользовательскийКомментарий);
	КонецЕсли;
	
КонецПроцедуры

// Получает диспетчеров трудового ресурса.
//
// Параметры:
//  ТрудовойРесурс	 - СправочникСсылка.упоТрудовыеРесурсы, Массив	 - трудовой ресурс (массив трудовых ресурсов).
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Массив - диспетчер(ы) ТР(ов).
//
Функция ПолучитьДиспетчеровТрудовогоРесурса(ТрудовойРесурс) Экспорт
	
	Запрос = Новый Запрос;

	Если ТипЗнч(ТрудовойРесурс) = Тип("Массив") Тогда
		вхМассив = Истина;
		Запрос.УстановитьПараметр("МассивРесурсов", ТрудовойРесурс);
	Иначе
		вхМассив = Ложь;
		Запрос.УстановитьПараметр("ТрудовойРесурс", ТрудовойРесурс);
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегТР.Сотрудник
		|ПОМЕСТИТЬ Сотрудники
		|ИЗ
		|	РегистрСведений.упоВладениеРесурсами.СрезПоследних(, Ресурс = &ТрудовойРесурс) КАК РегТР
		|ГДЕ
		|	РегТР.ВладеетРесурсом = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	упоДиспетчерыСистемыСрезПоследних.Пользователь,
		|	упоДиспетчерыСистемыСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(
		|			,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					Сотрудники.Сотрудник
		|				ИЗ
		|					Сотрудники)) КАК упоДиспетчерыСистемыСрезПоследних
		|ГДЕ
		|	упоДиспетчерыСистемыСрезПоследних.ФлагУправления
		|	И НЕ упоДиспетчерыСистемыСрезПоследних.Пользователь.ПометкаУдаления";
		
	Если вхМассив Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Ресурс = &ТрудовойРесурс", "Ресурс В (&МассивРесурсов)");
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Если вхМассив Тогда
		Возврат ТаблицаРезультат;
	Иначе
		Возврат ТаблицаРезультат.ВыгрузитьКолонку("Пользователь");
	КонецЕсли;
	
КонецФункции 

// Добавляет на форму страницы с кнопками для изменения статуса Задания.
//
// Параметры:
//  Форма			 - 	 - УправляемаяФорма.
//  КнопкиЗакрытия	 - Булево	 - признак необходимости добавления кнопки закрытия.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см.НоваяТаблицаСтраницыДоступныхСтатусов
//
Функция ДобавитьКнопкиИзмененияСтатуса(Форма, КнопкиЗакрытия = Ложь) Экспорт
	
	ТаблицаДоступныхСтатусов = ПолучитьТаблицуДоступныхСтатусов();
	ТаблицаСтатусовВидовЗаданий = ПолучитьТаблицуСтатусовВидовЗаданий();
	МассивВидыЗаданий = ПолучитьВидыЗаданий();
	
	ТаблицаСтраницыДоступныхСтатусов = НоваяТаблицаСтраницыДоступныхСтатусов();
	
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	
	ШиринаКнопки = Элементы.Комментировать.Ширина;
	ЦветаСтатусов = Новый Соответствие;
	ЦветаСтатусов.Вставить("Выдано", WebЦвета.ТусклоРозовый);
	ЦветаСтатусов.Вставить("Завершено", Новый Цвет(207,238,207));
	ЦветаСтатусов.Вставить("Выполняется", WebЦвета.Лимонный);
	ЦветаСтатусов.Вставить("Отменено", WebЦвета.СеребристоСерый);
	ЦветаСтатусов.Вставить("Закрыто", Новый Цвет(183, 230, 255));
	ЦветаСтатусов.Вставить("Уточняется", WebЦвета.Персиковый);
	ЦветаСтатусов.Вставить("НаСогласовании", WebЦвета.Лимонный);
	ЦветаСтатусов.Вставить("Согласовано", Новый Цвет(207,238,207));
	ЦветаСтатусов.Вставить("НеСогласовано", WebЦвета.ТусклоРозовый);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Форма", Форма);
	СтруктураПараметров.Вставить("ТаблицаСтраницыДоступныхСтатусов", ТаблицаСтраницыДоступныхСтатусов);
	СтруктураПараметров.Вставить("ШиринаКнопки", ШиринаКнопки);
	СтруктураПараметров.Вставить("ЦветаСтатусов", ЦветаСтатусов);
		
	Для Каждого ВидЗадания Из МассивВидыЗаданий Цикл				

		ОтборПоВидуЗадания = Новый Структура("ВидЗадания", ВидЗадания); 
		МассивСтрокДоступныеСтатусы = ТаблицаДоступныхСтатусов.НайтиСтроки(ОтборПоВидуЗадания); 		
		ВсеСтатусы = ТаблицаСтатусовВидовЗаданий.НайтиСтроки(ОтборПоВидуЗадания);

		Для Каждого СтрокаДоступныйСтатус Из МассивСтрокДоступныеСтатусы Цикл 	
	
			// Добавление команды формы.
			КомандаИзменитьСтатус = Команды.Найти(СтрокаДоступныйСтатус.НовыйСтатус);
			Если КомандаИзменитьСтатус = Неопределено Тогда
				КомандаИзменитьСтатус = Команды.Добавить(СтрокаДоступныйСтатус.НовыйСтатус);
				КомандаИзменитьСтатус.Действие = "ИзменитьСтатус";				
			КонецЕсли;
			Если КнопкиЗакрытия Тогда
				КомандаИзменитьСтатусИЗакрыть = Команды.Найти(СтрокаДоступныйСтатус.НовыйСтатус + "ИЗакрыть");
				Если КомандаИзменитьСтатусИЗакрыть = Неопределено Тогда
					КомандаИзменитьСтатусИЗакрыть = Команды.Добавить(СтрокаДоступныйСтатус.НовыйСтатус + "ИЗакрыть");
					КомандаИзменитьСтатусИЗакрыть.Действие = "ИзменитьСтатусИЗакрыть";
					КомандаИзменитьСтатусИЗакрыть.Подсказка = НСтр("ru = 'Изменить статус и закрыть форму'");
				КонецЕсли;
				КомандаИзменитьСтатус.Подсказка = НСтр("ru = 'Изменить статус'");
			КонецЕсли;						
			
			// Добавление страниц с кнопками.
			Если СтрокаДоступныйСтатус.ТекущийСтатус = "" Тогда
				// Если текущий статус не указан, значит можно переходить с любого статуса для данного вида задания.
				Для Каждого СтрокаСтатус Из ВсеСтатусы Цикл					
					ДобавитьСтраницыДляСтатуса(СтрокаСтатус.Статус, 
											СтрокаДоступныйСтатус, 
											СтруктураПараметров, 
											КнопкиЗакрытия);										
				КонецЦикла; 			
				
			Иначе
				ДобавитьСтраницыДляСтатуса(СтрокаДоступныйСтатус.ТекущийСтатус, 
											СтрокаДоступныйСтатус, 
											СтруктураПараметров, 
											КнопкиЗакрытия);														
			КонецЕсли;			
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Если Форма.ИмяФормы = "Обработка.упоРаботаСЗаданиями.Форма.Форма" Тогда
		ДобавитьКнопкиИзмененияСтатусаДляГруппыЗаданий(Форма, ТаблицаДоступныхСтатусов, ЦветаСтатусов);
	КонецЕсли;
	
	Возврат ТаблицаСтраницыДоступныхСтатусов;
	
КонецФункции

Процедура ДобавитьКнопкиИзмененияСтатусаДляГруппыЗаданий(Форма, ТаблицаДоступныхСтатусов, ЦветаСтатусов)
	
	Элементы = Форма.Элементы;
	
	Форма.ТаблицаДоступныеСтатусыСКомандами.Загрузить(ТаблицаДоступныхСтатусов);
	
	ИмяСтраницы = "СтраницаСтатусыДляГруппыЗаданий";	
	
	СтраницаСтатусыДляГруппыЗаданий = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Элементы.ГруппаИзменитьСтатус);
	СтраницаСтатусыДляГруппыЗаданий.Вид = ВидГруппыФормы.Страница;
	
	ПолеКомментарий = Элементы.Добавить(ИмяСтраницы + "ПолеКомментарий", Тип("ПолеФормы"), СтраницаСтатусыДляГруппыЗаданий);
	ЗаполнитьЗначенияСвойств(ПолеКомментарий, Элементы.ПолеКомментария, , "ВыделенныйТекст");	
	ПолеКомментарий.УстановитьДействие("ПриИзменении", "ПолеКомментарияПриИзменении");
	ПолеКомментарий.УстановитьДействие("АвтоПодбор", "ПолеКомментарияАвтоПодбор");
	
	ДоступныеСтатусыГруппаКнопок = Элементы.Добавить(ИмяСтраницы + "ГруппаКнопок", 
		Тип("ГруппаФормы"), 
		СтраницаСтатусыДляГруппыЗаданий);
	ДоступныеСтатусыГруппаКнопок.Вид = ВидГруппыФормы.КоманднаяПанель;	
	
	ГруппаОсновнойКнопкиПраво = Элементы[ИмяСтраницы + "ГруппаКнопок"];
	
	Для Каждого ТекСтатус Из Метаданные.Перечисления.упоСтатусыЗаданий.ЗначенияПеречисления Цикл	
		
		Если Форма.Команды.Найти(ТекСтатус.Имя) = Неопределено Тогда
			Продолжить;	
		КонецЕсли; 
										
		ИмяНовогоЭлемент = СтрЗаменить(ИмяСтраницы, "Страница", "Кнопка") + ТекСтатус.Имя;
		КнопкаИзменитьСтатус = Форма.Элементы.Добавить(ИмяНовогоЭлемент, Тип("КнопкаФормы"), ГруппаОсновнойКнопкиПраво);
		КнопкаИзменитьСтатус.Заголовок = НСтр("ru = 'В '") + ТекСтатус.Синоним;       	
		КнопкаИзменитьСтатус.ИмяКоманды = ТекСтатус.Имя;
		ЦветСтатуса = ЦветаСтатусов.Получить(ТекСтатус.Имя);
		Если ЦветСтатуса <> Неопределено Тогда
			КнопкаИзменитьСтатус.ЦветФона = ЦветСтатуса;
		КонецЕсли;				
		
	КонецЦикла;		
		
КонецПроцедуры 

// Получает плановые и фактические даты начала и даты окончания Задания.
//
// Параметры:
//  Задание	 - ДокументСсылка.упоЗадание - Задание.
//
// Возвращаемое значение:
//	СтруктураСроки - Структура - ключи:
//		* ДатаНачалаПлан	 - Дата - плановая дата начала.
//		* ДатаОкончанияПлан	 - Дата - плановая дата окончания.
//		* ДатаНачалаФакт	 - Дата - факт. дата начала.
//		* ДатаОкончанияФакт	 - Дата - факт. дата окончания.
//
Функция ПолучитьСрокиЗадания(Задание) Экспорт
	
	Перем СтруктураСроки; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСрокиЗаданий.ДатаНачалаПлан,
	               |	упоСрокиЗаданий.ДатаОкончанияПлан
	               |ИЗ
	               |	РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	               |ГДЕ
	               |	упоСрокиЗаданий.Задание = &Задание";
				   
				   
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("СтатусВыполняется", ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выполняется"));
	Запрос.УстановитьПараметр("СтатусЗавершено", ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено"));
	
	ВыборкаПлан = Запрос.Выполнить().Выбрать();

	СтруктураСрокиФакт = ПолучитьФактическиеСрокиЗадания(Задание);

	СтруктураСроки = Новый Структура("ДатаНачалаПлан, ДатаОкончанияПлан, ДатаНачалаФакт, ДатаОкончанияФакт");
	
	Если ВыборкаПлан.Следующий() Тогда		
		СтруктураСроки.Вставить("ДатаНачалаПлан", ВыборкаПлан.ДатаНачалаПлан);
		СтруктураСроки.Вставить("ДатаОкончанияПлан", ВыборкаПлан.ДатаОкончанияПлан);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураСроки, СтруктураСрокиФакт);    
	
	Возврат СтруктураСроки;
	
КонецФункции	

// Получает фактические дату начала и дату окончания Задания.
//
// Параметры:
//  Задание	 - ДокументСсылка.упоЗадание - Задание.
//
// Возвращаемое значение:
//	СтруктураСроки - Структура - ключи:
//		* ДатаНачалаФакт	 - Дата - плановая дата начала.
//		* ДатаОкончанияФакт	 - Дата - плановая дата окончания.
//
Функция ПолучитьФактическиеСрокиЗадания(Задание) Экспорт
	
	Перем СтруктураСроки; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоЗаданияСтатусыСрезПервых.Период
	               |ИЗ
	               |	РегистрСведений.упоЗаданияСтатусы.СрезПервых(
	               |			,
	               |			Статус = &СтатусВыполняется
	               |				И Задание = &Задание) КАК упоЗаданияСтатусыСрезПервых
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоЗаданияСтатусыСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
	               |			,
	               |			Задание = &Задание
	               |				И Статус = &СтатусЗавершено) КАК упоЗаданияСтатусыСрезПоследних";
				   
				   
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("СтатусВыполняется", ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выполняется"));
	Запрос.УстановитьПараметр("СтатусЗавершено", ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено"));
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаФактДатаНачала = Результаты[0].Выбрать();
	ВыборкаФактДатаОкончания = Результаты[1].Выбрать(); 

	СтруктураСроки = Новый Структура("ДатаНачалаФакт, ДатаОкончанияФакт");
	
	Если ВыборкаФактДатаНачала.Следующий() Тогда
		СтруктураСроки.Вставить("ДатаНачалаФакт", ВыборкаФактДатаНачала.Период);
	КонецЕсли;
	
	Если ВыборкаФактДатаОкончания.Следующий() Тогда
		ТекущийСтатус = ПолучитьСтатусЗадания(Задание);
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено") 
			ИЛИ ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто") Тогда
			СтруктураСроки.Вставить("ДатаОкончанияФакт", ВыборкаФактДатаОкончания.Период);
			// Если задание завершено сразу после того, как было выдано, то тогда дата начала факт не будет заполнена.
			// Поэтому берем значение из даты окончания факт.
			Если Не ЗначениеЗаполнено(СтруктураСроки.ДатаНачалаФакт) Тогда
				СтруктураСроки.ДатаНачалаФакт = ВыборкаФактДатаОкончания.Период;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;    
	
	Возврат СтруктураСроки;
	
КонецФункции	

// Добавляет/изменяет запись в регистре упоСрокиЗаданий.
//
// Параметры:
//  Задание			- СправочникСсылка.упоЗадания - задание.
//  ДатаНачала	 	- Дата - дата начала.
//  ДатаОкончания	- Дата - дата окончания.
//
Процедура ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(Задание, ДатаНачала, ДатаОкончания) Экспорт

	НаборЗаписей = РегистрыСведений.упоСрокиЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);

	Запись = НаборЗаписей.Добавить();
	Запись.Задание = Задание;
	Запись.ДатаНачалаПлан = ДатаНачала;
	Запись.ДатаОкончанияПлан = ДатаОкончания;

	НаборЗаписей.Записать();
	
	упоИнтеграцияПереопределяемый.ПослеЗаписи_СрокиЗадания(Задание, ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

// Создает подчиненные Задания для списка исполнителей копированием родительского.
//
// Параметры:
//  ЗаданиеРодитель		 - СправочникОбъект.упоЗадание	 - копируемое Задание.
//  СтруктураРеквизитов	 - Структура					 - Ключи:
//  					* ДатаНачалаПлан    - Дата - плановая дата начала.
//  					* ДатаОкончанияПлан - Дата - плановая дата окончания.
//  СписокИсполнителей	 - СписокЗначений Из СправочникСсылка.упоТрудовыеРесурсы - исполнители задания.
//  Автор				 - СправочникСсылка.упоСотрудники
//
Процедура СоздатьПодчиненныеЗаданияКопированиемТекущего(ЗаданиеРодитель, 
														СтруктураРеквизитов,
														СписокИсполнителей,
														Автор = Неопределено) Экспорт
	
	Для Каждого Исполнитель Из СписокИсполнителей Цикл
		
		Если Не ЗначениеЗаполнено(Исполнитель.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеЗадание = ЗаданиеРодитель.Скопировать();
		НовоеЗадание.ЭтоОсновноеЗаданиеПроектнойЗадачи = Ложь;
		НовоеЗадание.ЭтоЗаданиеИсполнителяПроектнойЗадачи = ЗаданиеРодитель.ЭтоЗаданиеИсполнителяПроектнойЗадачи;
		НовоеЗадание.ЭтоСогласованиеРодитель = Ложь;
		НовоеЗадание.Родитель = ЗаданиеРодитель.Ссылка;		
		НовоеЗадание.Исполнитель = Исполнитель.Значение;
		Если Автор <> Неопределено Тогда
			НовоеЗадание.АвторСотрудник = Автор;
			НовоеЗадание.Контролеры.Очистить();
			СтрокаКонтролер = НовоеЗадание.Контролеры.Добавить();
			СтрокаКонтролер.Контролер = Автор; 	
		КонецЕсли;	
		
		НовоеЗадание.Записать();

		Если ЗаданиеРодитель.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение") Тогда
			НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Открыто");
		ИначеЕсли ЗаданиеРодитель.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование") Тогда	
			НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.НаСогласовании");
		Иначе
			НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выдано");
		КонецЕсли;
		
		ЗаписатьВРегистрСтатусЗадания(НовоеЗадание.Ссылка, НовыйСтатус);
		
		ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(НовоеЗадание.Ссылка, СтруктураРеквизитов.ДатаНачалаПлан, СтруктураРеквизитов.ДатаОкончанияПлан);
		
	КонецЦикла;
	
КонецПроцедуры	

// Записывает срок Задания в регистр упоСрокиЗаданий.
//
Процедура ЗаписатьСрокЗаданий() Экспорт

	ПустаяДата =  Дата(1, 1, 1); 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоЗадания.Ссылка КАК Задание,
	               |	упоЗадания.Удалить_Срок
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания
	               |ГДЕ
	               |	упоЗадания.Удалить_Срок <> ДАТАВРЕМЯ(1, 1, 1)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 		
		ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(Выборка.Задание, ПустаяДата, Выборка.Удалить_Срок);		
	КонецЦикла;

КонецПроцедуры

// Получает структуру ролей.
//
// Параметры:
//  Задание			 - СправочникСсылка.упоЗадания	 - задание.
//  ТекущийСотрудник - СправоночникСсылка.Сотрудники - текущий сотрудник.
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача 	- ПЗ.
//  Исполнитель		 - СправочникСсылка.упоТрудовыеРесурсы	- трудовой ресурс.
// 
// Возвращаемое значение:
//  Структура - структура ролей.
//
Функция ПолучитьСтруктуруРолей(Задание, ТекущийСотрудник, ПроектнаяЗадача, Исполнитель = Неопределено) Экспорт
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЯИсполнитель", 					Ложь);
	РезультатФункции.Вставить("ЯКонтролер", 					Ложь);
	РезультатФункции.Вставить("ЯАвтор", 						Ложь);
	РезультатФункции.Вставить("ЯИсполнительПроектнойЗадачи", 	Ложь);
	РезультатФункции.Вставить("ЯРуководительПроектнойЗадачи", 	Ложь);
	
	ТрудовыеРесурсыСотрудника = ПолучитьМассивТрудовыхРесурсовСотрудника(ТекущийСотрудник);
	
	СтруктураРолейПоЗаданию = ПолучитьСтруктуруРолейПоЗаданию(Задание, Исполнитель, ТрудовыеРесурсыСотрудника);
	ЗаполнитьЗначенияСвойств(РезультатФункции, СтруктураРолейПоЗаданию);
	
	СтруктураРолейПоПроектнойЗадаче = ПолучитьСтруктуруРолейПоПроектнойЗадаче(ПроектнаяЗадача, ТрудовыеРесурсыСотрудника);
	ЗаполнитьЗначенияСвойств(РезультатФункции, СтруктураРолейПоПроектнойЗадаче);
	
	Возврат РезультатФункции;

КонецФункции

// Получает структуру ролей по проектной задаче.
//
// Параметры:
//  ПроектнаяЗадачаЗеркало - СправочникСсылка.Проекты	 - ПЗ.
//  МассивТрудовыхРесурсовСотрудника - Массив - трудовые ресурсы сотрудника.
// 
// Возвращаемое значение:
//  Структура - структура ролей.
//
Функция ПолучитьСтруктуруРолейПоПроектнойЗадаче(ПроектнаяЗадачаЗеркало, МассивТрудовыхРесурсовСотрудника = Неопределено) Экспорт
	
	СтруктураРолейПоПроектнойЗадаче = Новый Структура;
	СтруктураРолейПоПроектнойЗадаче.Вставить("ЯИсполнительПроектнойЗадачи", Ложь);
	СтруктураРолейПоПроектнойЗадаче.Вставить("ЯРуководительПроектнойЗадачи", Ложь);
	
	Если Не ЗначениеЗаполнено(ПроектнаяЗадачаЗеркало) Тогда
		Возврат СтруктураРолейПоПроектнойЗадаче;
	КонецЕсли;
	
	ПроектнаяЗадача = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(ПроектнаяЗадачаЗеркало);
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РуководительПроектнойЗадачи
		|ИЗ
		|	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
		|ГДЕ
		|	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи = &ТекущийСотрудник
		|	И упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача = &ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс КАК КоличествоРесурсов
		|ИЗ
		|	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
		|			,
		|			Версия = &ТекВерсия
		|				И Ресурс В (&СписокТрудовыхРесурсовПользователя)
		|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
		|ГДЕ
		|	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен";
	
	ТекущийСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	Запрос.УстановитьПараметр("ТекущийСотрудник", ТекущийСотрудник);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	Если МассивТрудовыхРесурсовСотрудника = Неопределено Тогда
		МассивТрудовыхРесурсовСотрудника = ПолучитьМассивТрудовыхРесурсовСотрудника(ТекущийСотрудник);
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокТрудовыхРесурсовПользователя", МассивТрудовыхРесурсовСотрудника);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Если Не Результаты[0].Пустой() Тогда
		СтруктураРолейПоПроектнойЗадаче.ЯРуководительПроектнойЗадачи = Истина;
	КонецЕсли;
	
	Если Не Результаты[1].Пустой() Тогда
		СтруктураРолейПоПроектнойЗадаче.ЯИсполнительПроектнойЗадачи = Истина;
	КонецЕсли;
	
	Возврат СтруктураРолейПоПроектнойЗадаче;
	
КонецФункции

// Заполняет вид задания по умолчанию - "Поручение".
//
Процедура ЗаполнитьВидЗаданий() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗадания.Ссылка
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	ВидЗаданияЗадание = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение");
	Пока Выборка.Следующий() Цикл
		ЗаданиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаданиеОбъект.ВидЗадания = ВидЗаданияЗадание;
		Попытка
			ЗаданиеОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

// Возвращает признак того, используются проектные решения или нет.
// 
// Возвращаемое значение:
//  Булево - признак использования проектных решений.
//
Функция ИспользуютсяПроектныеРешения() Экспорт
	
	Возврат Константы.упоИспользоватьНормированиеИПроектныеРешения.Получить();
	
КонецФункции

// Получает массив трудовых ресурсов сотрудника.
//
// Параметры:
//  ТекущийСотрудник - СправочникСсылка.упоСотрудники - сотрудник.
//
// Возвращаемое значение:
//  Массив - трудовые ресурсы пользователя.
//
Функция ПолучитьМассивТрудовыхРесурсовСотрудника(ТекущийСотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегТР.Ресурс КАК Ресурс
		|ИЗ
		|	РегистрСведений.упоВладениеРесурсами.СрезПоследних(, Сотрудник = &ТекущийСотрудник) КАК РегТР
		|ГДЕ
		|	РегТР.ВладеетРесурсом";
	
	Запрос.УстановитьПараметр("ТекущийСотрудник", ТекущийСотрудник);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		МассивТР = Новый Массив;
	Иначе
		МассивТР = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ресурс");
	КонецЕсли;
	
	Возврат МассивТР;
	
КонецФункции

// Возвращает трудовые ресурсы сотрудников.
//
// Параметры:
//  Сотрудники	 - Массив, СписокЗначение	 - сотрудники.
// 
// Возвращаемое значение:
//  Соответствие - отрудник - назначенные трудовые ресурсы
//
Функция ТрудовыеРесурсыСотрудников(Сотрудники) Экспорт
	
	ТаблицаФамилий = Новый ТаблицаЗначений;
	ТаблицаФамилий.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка"));
	ТаблицаФамилий.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"));
	Для каждого Сотрудник Из Сотрудники Цикл	
		МассивИмен = СтрРазделить(Сотрудник.Наименование, " ");
		НоваяСтрока = ТаблицаФамилий.Добавить();
		НоваяСтрока.Фамилия = МассивИмен[0] + "%";
		НоваяСтрока.Сотрудник = Сотрудник;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаФамилий", ТаблицаФамилий);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаФамилий.Фамилия КАК Фамилия,
		|	ТаблицаФамилий.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_Фамилии
		|ИЗ
		|	&ТаблицаФамилий КАК ТаблицаФамилий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегТР.Ресурс КАК Ресурс,
		|	РегТР.Сотрудник КАК Сотрудник,
		|	ВТ_Фамилии.Фамилия КАК Фамилия,
		|	РегТР.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ВладениеРесурсами
		|ИЗ
		|	ВТ_Фамилии КАК ВТ_Фамилии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВладениеРесурсами.СрезПоследних КАК РегТР
		|		ПО ВТ_Фамилии.Сотрудник = РегТР.Сотрудник
		|ГДЕ
		|	РегТР.ВладеетРесурсом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВладениеРесурсами.Ресурс КАК Ресурс,
		|	ВТ_ВладениеРесурсами.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТ_ВладениеРесурсами КАК ВТ_ВладениеРесурсами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоТрудовыеРесурсы КАК упоТрудовыеРесурсы
		|		ПО ВТ_ВладениеРесурсами.Ресурс = упоТрудовыеРесурсы.Ссылка
		|ГДЕ
		|	упоТрудовыеРесурсы.Наименование ПОДОБНО ВТ_ВладениеРесурсами.Фамилия
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВладениеРесурсами.Период
		|ИТОГИ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВладениеРесурсами.Ресурс КАК Ресурс,
		|	ВТ_ВладениеРесурсами.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТ_ВладениеРесурсами КАК ВТ_ВладениеРесурсами
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ВладениеРесурсами.Период
		|ИТОГИ ПО
		|	Сотрудник";
	
	УстановитьПривилегированныйРежим(Истина);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ПакетЗапросов[2].Пустой() Тогда
		РезультатЗапроса = ПакетЗапросов[2];
	Иначе
		РезультатЗапроса = ПакетЗапросов[3];
	КонецЕсли;

	СоответствиеПоРезультату = упоФункцииОбщегоНазначенияСервер.
		СоответствиеПоРезультатуЗапросаСОдноуровневойГруппировкой(РезультатЗапроса, "Сотрудник", "Ресурс");
		
	// Для случаев, когда несколько сотрудников, у одного найден ТР по фамилии, а у другого нет,
	// проверяем добавлены ли все сотрудники в соответствие.
	Если Не ПакетЗапросов[2].Пустой() И Сотрудники.Количество() > 1 Тогда
		Для каждого Сотрудник Из Сотрудники Цикл
			
			СотрудникДобавлен = СоответствиеПоРезультату[Сотрудник] <> Неопределено;
			Если СотрудникДобавлен Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаГруппировка = ПакетЗапросов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаГруппировка.Следующий() Цикл
				Если Не ВыборкаГруппировка.Сотрудник = Сотрудник Тогда
					Продолжить;
				КонецЕсли;
				
				Выборка = ВыборкаГруппировка.Выбрать();
				МассивДеталей = Новый Массив;
				Пока Выборка.Следующий() Цикл
					МассивДеталей.Добавить(Выборка["Ресурс"]);
				КонецЦикла;
				СоответствиеПоРезультату.Вставить(ВыборкаГруппировка["Сотрудник"], МассивДеталей);
			КонецЦикла;

	    КонецЦикла;
	КонецЕсли;
		
	Возврат СоответствиеПоРезультату;

КонецФункции

// Получить массив статусов заданий с предупреждением при попытке перехода в них.
// 
// Возвращаемое значение:
//  Массив - Массив статусов заданий.
//
Функция ПолучитьМассивСтатусовСПредупреждением() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.упоСтатусыЗаданий.Отменено);
	
	Возврат Результат;
	
КонецФункции 

// Ставит порядковый номер в очереди
//
// Параметры:
//  Задание			 - СправочникСсылка.упоЗадания
//  ВидОчереди		 - ПеречислениеСсылка.упоВидыОчередейЗаданий
//  ГруппаОчереди	 - СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.Проекты, СправочникСсылка.упоПодразделения, СправочникСсылка.упоПортфелиПроектов
//  Номер			 - Число
//
Процедура УстановитьПорядковыйНомерВОчереди(Задание, ВидОчереди, ГруппаОчереди, Знач Номер) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Номер < 0 Тогда
		Номер = 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаОчереди", ГруппаОчереди);
	Запрос.УстановитьПараметр("ВидОчереди", ВидОчереди);
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоОчередиЗаданий.Задание КАК Задание,
	               |	упоОчередиЗаданий.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.упоОчередиЗаданий КАК упоОчередиЗаданий
	               |ГДЕ
	               |	упоОчередиЗаданий.ГруппаОчереди = &ГруппаОчереди
	               |	И упоОчередиЗаданий.ВидОчереди = &ВидОчереди
	               |	И упоОчередиЗаданий.Задание <> &Задание
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
	
	НаборЗаписей = РегистрыСведений.упоОчередиЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГруппаОчереди.Установить(ГруппаОчереди);
	НаборЗаписей.Отбор.ВидОчереди.Установить(ВидОчереди);
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.упоОчередиЗаданий");
	ЭлементБлокировки.УстановитьЗначение("ГруппаОчереди", ГруппаОчереди);
	ЭлементБлокировки.УстановитьЗначение("ВидОчереди", ВидОчереди);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	сч = 1;
	
	ЗаданиеДобавлено = Ложь;
	
	Если Номер = 0 Тогда
		ДобавитьЗаданиеВНаборЗаписейОчереди(НаборЗаписей, ВидОчереди, ГруппаОчереди, Задание, Номер);
		ЗаданиеДобавлено = Истина;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Порядок = 0 Тогда
			ДобавитьЗаданиеВНаборЗаписейОчереди(НаборЗаписей, ВидОчереди, ГруппаОчереди, Выборка.Задание, 0);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗаданиеДобавлено И сч = Номер Тогда
			ДобавитьЗаданиеВНаборЗаписейОчереди(НаборЗаписей, ВидОчереди, ГруппаОчереди, Задание, Номер);
			ЗаданиеДобавлено = Истина;
			сч = сч + 1;
		КонецЕсли;
		
		ДобавитьЗаданиеВНаборЗаписейОчереди(НаборЗаписей, ВидОчереди, ГруппаОчереди, Выборка.Задание, сч);
		сч = сч + 1;
		
	КонецЦикла;
	
	Если НЕ ЗаданиеДобавлено Тогда
		ДобавитьЗаданиеВНаборЗаписейОчереди(НаборЗаписей, ВидОчереди, ГруппаОчереди, Задание, сч);
		ЗаданиеДобавлено = Истина;
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Ставит задание перед заданием в очереди.
//
// Параметры:
//  Задание			 - СправочникСсылка.упоЗадания
//  ВидОчереди		 - ПеречислениеСсылка.упоВидыОчередейЗаданий
//  ГруппаОчереди	 - СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.Проекты, СправочникСсылка.упоПодразделения, СправочникСсылка.упоПортфелиПроектов
//  ПередЗаданием	 - СправочникСсылка.упоЗадания	 - задание очереди,
//  	перед которым надо поместить Задание, переданное в первом параметре.
//
Процедура ПоставитьЗаданиеПередЗаданиемВОчереди(Задание, ВидОчереди, ГруппаОчереди, ПередЗаданием) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаОчереди", ГруппаОчереди);
	Запрос.УстановитьПараметр("ВидОчереди", ВидОчереди);
	Запрос.УстановитьПараметр("ПередЗаданием", ПередЗаданием);
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоОчередиЗаданий.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.упоОчередиЗаданий КАК упоОчередиЗаданий
	               |ГДЕ
	               |	упоОчередиЗаданий.ГруппаОчереди = &ГруппаОчереди
	               |	И упоОчередиЗаданий.ВидОчереди = &ВидОчереди
	               |	И упоОчередиЗаданий.Задание = &ПередЗаданием";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПорядковыйНомерВОчереди(Задание, ВидОчереди, ГруппаОчереди, РезультатЗапроса.Выгрузить()[0].Порядок);
	
КонецПроцедуры

// Удаляет задание из очередей.
//
// Параметры:
//  Задание	 - СправочникСсылка.упоЗадания
//
Процедура УдалитьЗаданиеИзВсехОчередей(Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.упоОчередиЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Записать();
		
КонецПроцедуры

// Возвращает данные по заданиям подразделениям по задаче.
//
// Параметры:
//  ПроектнаяЗадача	 - СправочникСсылка.Проекты, ДокументСсылка.упоПроектнаяЗадача
// 
// Возвращаемое значение:
//  Структура - данные по заданиям подразделению.
//
Функция ЗаданияПодразделениюПоЗадаче(ПроектнаяЗадача) Экспорт
	
	Если ТипЗнч(ПроектнаяЗадача) = Тип("СправочникСсылка.Проекты") Тогда
		СсылкаНаПроектнуюЗадачу = ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу;
	Иначе
		СсылкаНаПроектнуюЗадачу = ПроектнаяЗадача;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(ИСТИНА) КАК ЭтоКонтролер,
	               |	упоКонтролерыЗаданий.Ссылка КАК Задание
	               |ПОМЕСТИТЬ упоКонтролерыЗаданий
	               |ИЗ
	               |	Справочник.упоЗадания.Контролеры КАК упоКонтролерыЗаданий
	               |ГДЕ
	               |	упоКонтролерыЗаданий.Контролер = &ТекСотрудник
	               |	И &СотрудникУказан
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоКонтролерыЗаданий.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗаданияСтатусыСрезПоследних.Задание КАК Задание,
	               |	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус,
	               |	ВЫБОР
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Выдано)
	               |			ТОГДА 1
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Уточняется)
	               |			ТОГДА 2
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Выполняется)
	               |			ТОГДА 3
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Завершено)
	               |			ТОГДА 4
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Закрыто)
	               |			ТОГДА 5
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Отменено)
	               |			ТОГДА 6
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПолеСортировки,
	               |	упоЗаданияСтатусыСрезПоследних.Период КАК Период
	               |ПОМЕСТИТЬ СтатусыЗаданий
	               |ИЗ
	               |	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
	               |			,
	               |			Задание.ЭтоЗаданиеПодразделению
	               |				И НЕ Задание.ПометкаУдаления
	               |				И Задание.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу = &Ссылка) КАК упоЗаданияСтатусыСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ упоКонтролерыЗаданий КАК ДанныеКонтролеры
	               |		ПО упоЗаданияСтатусыСрезПоследних.Задание = ДанныеКонтролеры.Задание
	               |ГДЕ
	               |	(&ПолныеПрава
	               |			ИЛИ упоЗаданияСтатусыСрезПоследних.Задание.Исполнитель В (&СписокТрудовыхРесурсовПользователя)
	               |			ИЛИ ЕСТЬNULL(ДанныеКонтролеры.ЭтоКонтролер, ЛОЖЬ)
	               |			ИЛИ упоЗаданияСтатусыСрезПоследних.Задание.АвторСотрудник = &ТекСотрудник
	               |				И &СотрудникУказан)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатусыЗаданий.Задание КАК Задание,
	               |	СтатусыЗаданий.ПолеСортировки КАК ПолеСортировки
	               |ИЗ
	               |	СтатусыЗаданий КАК СтатусыЗаданий
	               |ГДЕ
	               |	СтатусыЗаданий.ПолеСортировки < 6
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПолеСортировки,
	               |	Задание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатусыЗаданий.Задание КАК Задание,
	               |	СтатусыЗаданий.ПолеСортировки КАК ПолеСортировки,
	               |	СтатусыЗаданий.Период КАК Период
	               |ИЗ
	               |	СтатусыЗаданий КАК СтатусыЗаданий
	               |ГДЕ
	               |	СтатусыЗаданий.ПолеСортировки = 6
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтатусыЗаданий.Период УБЫВ";
	
	ТекущийСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	МассивТрудовыхРесурсовПользователя = ПолучитьМассивТрудовыхРесурсовСотрудника(ТекущийСотрудник);
	Запрос.УстановитьПараметр("ТекСотрудник", ТекущийСотрудник);
	Запрос.УстановитьПараметр("СотрудникУказан", ЗначениеЗаполнено(ТекущийСотрудник)); 	
	Запрос.УстановитьПараметр("СписокТрудовыхРесурсовПользователя", МассивТрудовыхРесурсовПользователя);
	Запрос.УстановитьПараметр("ПолныеПрава", РольДоступна("ПолныеПрава"));
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаПроектнуюЗадачу);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураРезультата = Новый Структура("КоличествоЗаданий, ЗаданиеДляПозиционирования, ТекущийСотрудник");
	СтруктураРезультата.ТекущийСотрудник = ТекущийСотрудник;
	Если РезультатЗапроса[2].Пустой() Тогда
		// По задаче есть только отмененные задания.
		Если РезультатЗапроса[3].Пустой() Тогда
			СтруктураРезультата.КоличествоЗаданий = 0;
		Иначе
			Выборка = РезультатЗапроса[3].Выбрать();
			Выборка.Следующий();
			СтруктураРезультата.КоличествоЗаданий = 1;
			СтруктураРезультата.ЗаданиеДляПозиционирования = Выборка.Задание;
		КонецЕсли;	
	Иначе
		Выборка = РезультатЗапроса[2].Выбрать();
		СтруктураРезультата.КоличествоЗаданий = Выборка.Количество();
		Выборка.Следующий();
		СтруктураРезультата.ЗаданиеДляПозиционирования = Выборка.Задание;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - определяет поддерживает ли указанный сценарий механзим сохранения настроек
//
// Параметры:
//  Сценарий - Строка - см. имена команд обработки упоРаботаСЗаданиями 
// 
// Возвращаемое значение:
//   - Булево
//
Функция СценарийПоддерживаетСохранениеНастроек(Сценарий) Экспорт
	
	СценарииПоддерживающиеСохранениеНастроек = СценарииПоддерживающиеСохранениеНастроек();
	Возврат СценарииПоддерживающиеСохранениеНастроек.Найти(Сценарий) <> Неопределено;
	
КонецФункции

// Функция - возвращает массив сценариев, которые поддерживают механизм сохранения настроек
// 
// Возвращаемое значение:
//   -   Массив - Строка - перечень сценариев, которые поддерживают механизм сохранения настроек
//
Функция СценарииПоддерживающиеСохранениеНастроек() Экспорт
	
	Сценарии = Новый Массив;
	Сценарии.Добавить("ПоУмолчанию");
	Сценарии.Добавить("упоРаботаСЗаданиями");
	Сценарии.Добавить("упоРаботаСЗаданиямиДляИсполнения");
	Сценарии.Добавить("упоРаботаСЗаданиямиНаКонтроле");
	Сценарии.Добавить("упоРаботаСЗаданиямиОтМеня");
	Сценарии.Добавить("ВсеПоручения");
	Сценарии.Добавить("ВсеПроектныеРешения");
	Сценарии.Добавить("упоРаботаСЗаданиямиНаПланирование");
	Сценарии.Добавить("упоРаботаСЗаданиямиНаПрогноз");

	Возврат Сценарии;
	
КонецФункции

// Функция - Новая структура настроек
// 
// Возвращаемое значение:
//   -  Структура - структура сохраняем настроек
//
Функция НоваяСтруктураНастроек() Экспорт

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ПользовательскиеНастройки", Неопределено);
	СтруктураНастроек.Вставить("ОчередьЗадачИсполнителя", Ложь);
	СтруктураНастроек.Вставить("ОтключитьГруппуЗадания", Ложь);
	СтруктураНастроек.Вставить("ПоказыватьОбсуждения", Ложь);
	СтруктураНастроек.Вставить("ПоказыватьПрочие", Ложь);
	СтруктураНастроек.Вставить("ПоказыватьЗакрытыеОтмененные", Ложь);
	СтруктураНастроек.Вставить("Автор", Справочники.упоСотрудники.ПустаяСсылка());
	СтруктураНастроек.Вставить("Исполнитель", Справочники.упоТрудовыеРесурсы.ПустаяСсылка());
	СтруктураНастроек.Вставить("ВидЗадания", Справочники.упоВидыЗаданий.ПустаяСсылка());
	
	Возврат СтруктураНастроек;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаданиеВНаборЗаписейОчереди(НаборЗаписей, ВидОчереди, ГруппаОчереди, Задание, Порядок)
	
	Запись = НаборЗаписей.Добавить();						
	Запись.Задание = Задание;
	Запись.ГруппаОчереди = ГруппаОчереди;
	Запись.ВидОчереди = ВидОчереди;
	Запись.Порядок = Порядок;

КонецПроцедуры

Процедура ДобавитьЗаписьВРегистрКомментыЗаданий(ПараметрыЗаписи)

	Период					= ТекущаяДатаСеанса();   
	Задание					= ПараметрыЗаписи.Задание;
	Статус					= ПараметрыЗаписи.Статус;
	Комментарий 			= ПараметрыЗаписи.Комментарий;
	КомментарийПользователя = ПараметрыЗаписи.КомментарийПользователя; 
	Автор					= ПараметрыЗаписи.Автор;
	
	КомментыЗаданий = РегистрыСведений.упоКомментарииЗаданий.СоздатьНаборЗаписей();
	КомментыЗаданий.Отбор.Задание.Установить(Задание);
	КомментыЗаданий.Отбор.Период.Установить(Период);
	
	новСтрока = КомментыЗаданий.Добавить();
	новСтрока.Период = Период;
	новСтрока.Задание = Задание;
	новСтрока.Автор = Автор;
	новСтрока.Статус = Статус;
	новСтрока.Комментарий = Комментарий;
	новСтрока.КомментарийПользователя = КомментарийПользователя;
	
	Попытка
		КомментыЗаданий.Записать(Ложь);
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОшибкаЗаписиЗадания", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.упоЗадания, Задание, ПредставлениеОшибки);
		ТекстСообщения = НСтр("ru = 'Произошла ошибка записи комментария. Подробнее см. журнал регистрации.'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьПоследнийКомментарий(Задание)
	
	Комментарий = "";
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	упоКомментарииЗаданийСрезПоследних.КомментарийПользователя
	               |ИЗ
	               |	РегистрСведений.упоКомментарииЗаданий.СрезПоследних(, Задание = &Задание) КАК упоКомментарииЗаданийСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоКомментарииЗаданийСрезПоследних.Период УБЫВ";

	Запрос.УстановитьПараметр("Задание", Задание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Комментарий = Выборка.КомментарийПользователя;	
	КонецЕсли;
	
	Возврат Комментарий;

КонецФункции

Процедура ДобавитьКомментарийРодительскомуСогласованию(СогласованиеРодитель, СтатусПодчиненного, ПользовательскийКомментарий)
	
	ШаблонКомментария = Строка(ПользовательскийКомментарий) + 
		?(ПустаяСтрока(ПользовательскийКомментарий), "", "<hr>") + "Статус Задания изменен на ""%1""";
	Комментарий = СтрШаблон(ШаблонКомментария, Строка(СтатусПодчиненного));
	ПараметрыЗаписи = ПолучитьСтруктуруПараметровЗаписиКомментыЗаданий(СогласованиеРодитель, СтатусПодчиненного, Комментарий,
			ПользовательскийКомментарий);
	ДобавитьЗаписьВРегистрКомментыЗаданий(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ДобавитьСтраницыДляСтатуса(Статус, 
									СтрокаДоступныйСтатус, 
									СтруктураПараметров, 
									КнопкиЗакрытия)

	ИмяСтраницы = "Страница" + СтрокаДоступныйСтатус.ВидЗадания + СтрокаДоступныйСтатус.Роль + Статус;
	ДобавитьКнопкуИзменитьСтатус(ИмяСтраницы, 
								Статус,
								СтрокаДоступныйСтатус.Роль, 
								СтрокаДоступныйСтатус, 
								СтруктураПараметров, 
								КнопкиЗакрытия);
		
	// Создание дополнительной страницы для случая, когда сотрудник и автор и исполнитель одновременно.
	Если СтрокаДоступныйСтатус.Роль = "Автор" Или СтрокаДоступныйСтатус.Роль = "Исполнитель" Тогда
		ИмяСтраницы = "Страница" + СтрокаДоступныйСтатус.ВидЗадания + "АвторИсполнитель" + Статус;
		ДобавитьКнопкуИзменитьСтатус(ИмяСтраницы, 
									Статус, 
									"АвторИсполнитель", 
									СтрокаДоступныйСтатус, 
									СтруктураПараметров, 
									КнопкиЗакрытия);									
	КонецЕсли;	
		
КонецПроцедуры

Функция ПолучитьВидыЗаданий()

	МассивВидыЗаданий = Новый Массив;			   
	МассивВидыЗаданий.Добавить("Поручение");
	МассивВидыЗаданий.Добавить("Обсуждение");
	МассивВидыЗаданий.Добавить("Согласование");
	МассивВидыЗаданий.Добавить("ПроектноеРешение");
	
	Возврат МассивВидыЗаданий;

КонецФункции

Функция ПолучитьТаблицуСтатусовВидовЗаданий()

	ТаблицаСтатусовВидовЗаданий = Новый ТаблицаЗначений;
	ТаблицаСтатусовВидовЗаданий.Колонки.Добавить("ВидЗадания");
	ТаблицаСтатусовВидовЗаданий.Колонки.Добавить("Статус");
	ТаблицаСтатусовВидовЗаданий.Колонки.Добавить("ИмяСтраницы");
	
	// Поручения.
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Поручение";
	СтрокаСтатусВидаЗадания.Статус = "Выдано";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Поручение";
	СтрокаСтатусВидаЗадания.Статус = "Выполняется";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Поручение";
	СтрокаСтатусВидаЗадания.Статус = "Завершено";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Поручение";
	СтрокаСтатусВидаЗадания.Статус = "Закрыто";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Поручение";
	СтрокаСтатусВидаЗадания.Статус = "Отменено";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Поручение";
	СтрокаСтатусВидаЗадания.Статус = "Уточняется";
	
	// Обсуждения.
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Обсуждение";
	СтрокаСтатусВидаЗадания.Статус = "Открыто";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Обсуждение";
	СтрокаСтатусВидаЗадания.Статус = "Закрыто";
	
	// Согласования.
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Согласование";
	СтрокаСтатусВидаЗадания.Статус = "НаСогласовании";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Согласование";
	СтрокаСтатусВидаЗадания.Статус = "Согласовано";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Согласование";
	СтрокаСтатусВидаЗадания.Статус = "НеСогласовано";
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "Согласование";
	СтрокаСтатусВидаЗадания.Статус = "Закрыто";
	
	// Проектные решения
	
	СтрокаСтатусВидаЗадания = ТаблицаСтатусовВидовЗаданий.Добавить();
	СтрокаСтатусВидаЗадания.ВидЗадания = "ПроектноеРешение";
	СтрокаСтатусВидаЗадания.Статус = "Завершено";	
	
	Возврат ТаблицаСтатусовВидовЗаданий;
	
КонецФункции

Процедура ДобавитьКнопкуИзменитьСтатус(ИмяСтраницы, 
									ТекущийСтатус, 
									Роль, 
									СтрокаДоступныйСтатус, 
									СтруктураПараметров, 
									КнопкиЗакрытия)
	
	Элементы = СтруктураПараметров.Форма.Элементы;
	
	СтраницаДоступныеСтатусы = Элементы.Найти(ИмяСтраницы);
	Если СтраницаДоступныеСтатусы = Неопределено Тогда
		
		СтраницаДоступныеСтатусы = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Элементы.ГруппаИзменитьСтатус);
		СтраницаДоступныеСтатусы.Вид = ВидГруппыФормы.Страница;
		НоваяСтрока = СтруктураПараметров.ТаблицаСтраницыДоступныхСтатусов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоступныйСтатус);
		НоваяСтрока.Роль = Роль;
		НоваяСтрока.ТекущийСтатусСсылка = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий." + ТекущийСтатус);
		НоваяСтрока.ВидЗаданияСсылка = 
			ПредопределенноеЗначение("Справочник.упоВидыЗаданий." + СтрокаДоступныйСтатус.ВидЗадания);
		НоваяСтрока.ИмяСтраницы = ИмяСтраницы;	
		
		ПолеКомментарий = Элементы.Добавить(ИмяСтраницы + "ПолеКомментарий", Тип("ПолеФормы"), СтраницаДоступныеСтатусы);
		ЗаполнитьЗначенияСвойств(ПолеКомментарий, Элементы.ПолеКомментария, , "ВыделенныйТекст");	
		ПолеКомментарий.УстановитьДействие("ПриИзменении", "ПолеКомментарияПриИзменении");
		ПолеКомментарий.УстановитьДействие("АвтоПодбор", "ПолеКомментарияАвтоПодбор");
		
		ДобавитьЭлемент_КоманднаяПанель(Элементы, ИмяСтраницы + "ГруппаКнопок", СтраницаДоступныеСтатусы);
		
	КонецЕсли;	
			
	ИмяНовогоЭлемент = СтрЗаменить(ИмяСтраницы, "Страница", "Кнопка") + СтрокаДоступныйСтатус.НовыйСтатус;
	
	Если Элементы.Найти(ИмяНовогоЭлемент) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЭлементГруппаКнопокСтатусы = ГруппаРядаКнопок(Элементы, ИмяСтраницы, СтраницаДоступныеСтатусы, КнопкиЗакрытия);
	
	Если КнопкиЗакрытия Тогда
			
		ГруппаКнопокИзменитьСтатус = Элементы.Добавить(ИмяНовогоЭлемент + "Группа", 
			Тип("ГруппаФормы"), 
			ЭлементГруппаКнопокСтатусы);
		ГруппаКнопокИзменитьСтатус.Вид = ВидГруппыФормы.ГруппаКнопок;
		ГруппаКнопокИзменитьСтатус.Отображение = ОтображениеГруппыКнопок.Компактное;
		
		ГруппаОсновнойКнопкиЛево = ГруппаКнопокИзменитьСтатус;
		ГруппаОсновнойКнопкиПраво = ГруппаКнопокИзменитьСтатус;
		
	Иначе
		
		ГруппаОсновнойКнопкиЛево = ЭлементГруппаКнопокСтатусы;
		ГруппаОсновнойКнопкиПраво = ЭлементГруппаКнопокСтатусы;
		
	КонецЕсли;	
	
	КнопкаИзменитьСтатус = Элементы.Добавить(ИмяНовогоЭлемент, Тип("КнопкаФормы"), ГруппаОсновнойКнопкиПраво);
	КнопкаИзменитьСтатус.Заголовок = СтрокаДоступныйСтатус.ЗаголовокКоманды;       	
	КнопкаИзменитьСтатус.ИмяКоманды = СтрокаДоступныйСтатус.НовыйСтатус;
	ЦветСтатуса =  СтруктураПараметров.ЦветаСтатусов.Получить(СтрокаДоступныйСтатус.НовыйСтатус);
	Если ЦветСтатуса <> Неопределено Тогда
		КнопкаИзменитьСтатус.ЦветФона = ЦветСтатуса;
	КонецЕсли;
	   
	Если КнопкиЗакрытия Тогда				
		КнопкаИзменитьСтатусИЗакрыть = Элементы.Добавить(ИмяНовогоЭлемент + "ИЗакрыть", 
			Тип("КнопкаФормы"), 
			ГруппаОсновнойКнопкиЛево);
		КнопкаИзменитьСтатусИЗакрыть.Заголовок = НСтр("ru = 'Х'");       	
		КнопкаИзменитьСтатусИЗакрыть.ИмяКоманды = СтрокаДоступныйСтатус.НовыйСтатус + "ИЗакрыть";
		КнопкаИзменитьСтатусИЗакрыть.ЦветФона = КнопкаИзменитьСтатус.ЦветФона;
		КнопкаИзменитьСтатусИЗакрыть.Картинка = БиблиотекаКартинок.Закрыть;
		КнопкаИзменитьСтатусИЗакрыть.Отображение = ОтображениеКнопки.Картинка;
	КонецЕсли;		
	
КонецПроцедуры

// Возвращает группу кнопок, на которой будут размещаться кнопки управления статусом задания. 
// При необходимости создает второй ряд кнопок. Второй ряд кнопок создается только для элемента справочника Задания.
// Для обработки Работа с заданиями второй ряд не создается, т.к. в обработке нет кнопок закрытия 
// (кнопки размещаются более компактно), но при этом есть управления группами выделенных заданий, 
// когда в панели кнопок регулируется видимость уже размещенных в панелях кнопок - 
// в этом случае получаются некрасивые комбинации при первоначальном размещении кнопок в два ряда.
//
// Параметры:
//  Элементы			 - ЭлементыФормы - элементы формы. 
//  ИмяСтраницы			 - Строка - имя страницы, на которой размещяется группа кнопок.
//  ЭлементРодитель		 - ГруппаФормы - элемент - родитель.
//  ДобавлятьВторойРяд	 - Булево - признак необходимости добавления второго ряда.
// 
// Возвращаемое значение:
//   - ЭлементФормы
//
Функция ГруппаРядаКнопок(Элементы, ИмяСтраницы, ЭлементРодитель, ДобавлятьВторойРяд = Ложь)
	
	СуффиксРядКнопок = "";
	
	ИмяГруппаКнопокПервыйРяд = ИмяСтраницы + "ГруппаКнопок";
	
	Если ДобавлятьВторойРяд Тогда
		МаксКоличествоКнопокВРяду = 2;	
		КоличествоПодчиненных = Элементы[ИмяГруппаКнопокПервыйРяд].ПодчиненныеЭлементы.Количество();
		
		Если КоличествоПодчиненных >= МаксКоличествоКнопокВРяду Тогда				
														
			СуффиксРядКнопок = "ВторойРяд";
			
			ДобавитьЭлемент_КоманднаяПанель(Элементы, ИмяГруппаКнопокПервыйРяд + СуффиксРядКнопок, ЭлементРодитель);
			
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Элементы[ИмяГруппаКнопокПервыйРяд + СуффиксРядКнопок];
	
КонецФункции	

Процедура ДобавитьЭлемент_КоманднаяПанель(Элементы, Имя, ЭлементРодитель)
	
	Если Элементы.Найти(Имя) <> Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДоступныеСтатусыГруппаКнопок = Элементы.Добавить(Имя, Тип("ГруппаФормы"), ЭлементРодитель);
	ДоступныеСтатусыГруппаКнопок.Вид 						= ВидГруппыФормы.КоманднаяПанель;
	ДоступныеСтатусыГруппаКнопок.ГоризонтальноеПоложение 	= ГоризонтальноеПоложениеЭлемента.Право;
	
КонецПроцедуры	

Функция ПолучитьТаблицуДоступныхСтатусов()

	ТаблицаДоступныхСтатусов = Новый ТаблицаЗначений;
	
	ТаблицаДоступныхСтатусов.Колонки.Добавить("ВидЗадания"); 	
	ТаблицаДоступныхСтатусов.Колонки.Добавить("Роль");
	ТаблицаДоступныхСтатусов.Колонки.Добавить("ТекущийСтатус");
	ТаблицаДоступныхСтатусов.Колонки.Добавить("НовыйСтатус");
	ТаблицаДоступныхСтатусов.Колонки.Добавить("ЗаголовокКоманды"); 	
	
	// Поручения.
	
	// - Выдано
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выдано";
	СтрокаДоступныйСтатус.НовыйСтатус = "Выполняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Взять в работу'");
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выдано";
	СтрокаДоступныйСтатус.НовыйСтатус = "Уточняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Уточнить'");  
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выдано";
	СтрокаДоступныйСтатус.НовыйСтатус = "Завершено";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Завершить'");
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выдано";
	СтрокаДоступныйСтатус.НовыйСтатус = "Уточняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Уточнить'");	
	
	// - Выполняется
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выполняется";
	СтрокаДоступныйСтатус.НовыйСтатус = "Завершено";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Завершить'");
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выполняется";
	СтрокаДоступныйСтатус.НовыйСтатус = "Уточняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Уточнить'");
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выполняется";
	СтрокаДоступныйСтатус.НовыйСтатус = "Уточняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Уточнить'");	
		
	// - Уточняется
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Уточняется";
	СтрокаДоступныйСтатус.НовыйСтатус = "Выдано";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Выдать'");
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Уточняется";
	СтрокаДоступныйСтатус.НовыйСтатус = "Выполняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Взять в работу'");
	
	// - Завершено
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Завершено";
	СтрокаДоступныйСтатус.НовыйСтатус = "Выполняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Доработать'");	
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Завершено";
	СтрокаДоступныйСтатус.НовыйСтатус = "Закрыто";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Закрыть'");	
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Завершено";
	СтрокаДоступныйСтатус.НовыйСтатус = "Выполняется";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Доработать'");		
	
	// - Закрыто
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Закрыто";
	СтрокаДоступныйСтатус.НовыйСтатус = "Выдано";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Выдать заново'");	
		
	// - Любой
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "";
	СтрокаДоступныйСтатус.НовыйСтатус = "Отменено";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Отменить'");
	
	// Для того, чтобы данный статус отрабатывал, надо расписать предыдущий
	// на все возможные варианты.
	//СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	//СтрокаДоступныйСтатус.ВидЗадания = "Поручение";
	//СтрокаДоступныйСтатус.Роль = "Автор";
	//СтрокаДоступныйСтатус.ТекущийСтатус = "Отменено";
	//СтрокаДоступныйСтатус.НовыйСтатус = "Отменено";
	//СтрокаДоступныйСтатус.ЗаголовокКоманды = НСтр("ru = 'Совсем отменено'");
	
	// Обсуждения.
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Обсуждение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Открыто";
	СтрокаДоступныйСтатус.НовыйСтатус = "Закрыто";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = "Закрыть";
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Обсуждение";
	СтрокаДоступныйСтатус.Роль = "РуководительПроектнойЗадачи";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Открыто";
	СтрокаДоступныйСтатус.НовыйСтатус = "Закрыто";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = "Закрыть";
	
	// Согласования.
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Согласование";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "НаСогласовании";
	СтрокаДоступныйСтатус.НовыйСтатус = "Согласовано";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = "Согласовано";
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Согласование";
	СтрокаДоступныйСтатус.Роль = "Исполнитель";
	СтрокаДоступныйСтатус.ТекущийСтатус = "НаСогласовании";
	СтрокаДоступныйСтатус.НовыйСтатус = "НеСогласовано";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = "Не согласовано";
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Согласование";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Согласовано";
	СтрокаДоступныйСтатус.НовыйСтатус = "Закрыто";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = "Закрыть";
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "Согласование";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "НеСогласовано";
	СтрокаДоступныйСтатус.НовыйСтатус = "Закрыто";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = "Закрыть"; 
	
	// Проектные решения
	
	СтрокаДоступныйСтатус = ТаблицаДоступныхСтатусов.Добавить();
	СтрокаДоступныйСтатус.ВидЗадания = "ПроектноеРешение";
	СтрокаДоступныйСтатус.Роль = "Автор";
	СтрокаДоступныйСтатус.ТекущийСтатус = "Выдано";
	СтрокаДоступныйСтатус.НовыйСтатус = "Завершено";
	СтрокаДоступныйСтатус.ЗаголовокКоманды = "Завершить";	
	
	Возврат ТаблицаДоступныхСтатусов;
	
КонецФункции

Функция НоваяТаблицаСтраницыДоступныхСтатусов()
	
	ТаблицаСтраницыДоступныхСтатусов = Новый ТаблицаЗначений;
	
	ТаблицаСтраницыДоступныхСтатусов.Колонки.Добавить("Роль");
	ТаблицаСтраницыДоступныхСтатусов.Колонки.Добавить("ИмяСтраницы");
	ТаблицаСтраницыДоступныхСтатусов.Колонки.Добавить("ВидЗаданияСсылка");
	ТаблицаСтраницыДоступныхСтатусов.Колонки.Добавить("ТекущийСтатусСсылка");
	
	Возврат ТаблицаСтраницыДоступныхСтатусов;
	
КонецФункции

Функция НайтиДоступныеСтатусыДляРолей(Отбор, СтруктураРолей, ТаблицаДоступныхСтатусов)

	СтатусДоступен = Ложь;
	
	Если СтруктураРолей.ЯАвтор Тогда
		Отбор.Вставить("Роль", "Автор");
		НайденныеСтроки = ТаблицаДоступныхСтатусов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтатусДоступен = Истина;
			Возврат СтатусДоступен;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураРолей.ЯИсполнитель Тогда
		Отбор.Вставить("Роль", "Исполнитель");
		НайденныеСтроки = ТаблицаДоступныхСтатусов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			СтатусДоступен = Истина;
			Возврат СтатусДоступен;
		КонецЕсли;
	КонецЕсли;

	Возврат СтатусДоступен;

КонецФункции

Процедура УстановитьЗначенияРеквизитовЗадания(Задание, ЭтоЗаданиеИсполнителяПроектнойЗадачи, ЗавершеноЗакрытоВручную)
	
	ЗаданиеОбъект = Задание.ПолучитьОбъект();
	ЗаданиеОбъект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = ЭтоЗаданиеИсполнителяПроектнойЗадачи;
	ЗаданиеОбъект.ЗавершеноЗакрытоВручную = ЗавершеноЗакрытоВручную;
	ЗаданиеОбъект.Записать();
	
КонецПроцедуры

// Получает структуру ролей.
//
// Параметры:
//  Задание			 - СправочникСсылка.упоЗадания	 - задание.
//  Исполнитель		 - СправочникСсылка.упоТрудовыеРесурсы	- трудовой ресурс.
//  ТрудовыеРесурсыСотрудника	 - Массив СправочникСсылка.упоТрудовыеРесурсы	- трудовые ресурсы сотрудника.
//
// Возвращаемое значение:
//  Структура - структура ролей.
//
Функция ПолучитьСтруктуруРолейПоЗаданию(Задание, Исполнитель, ТрудовыеРесурсыСотрудника)
	
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ЯИсполнитель", 	Ложь);
	РезультатФункции.Вставить("ЯКонтролер", 	Ложь);
	РезультатФункции.Вставить("ЯАвтор", 		Задание.Пустая());

	Если Не ЗначениеЗаполнено(Задание) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокТрудовыхРесурсовПользователя", ТрудовыеРесурсыСотрудника);
	Запрос.УстановитьПараметр("ТекСотрудник", ПараметрыСеанса.упоТекущийСотрудник);
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);

	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(упоКонтролерыЗаданий.Контролер) КАК Контролер,
		|	упоКонтролерыЗаданий.Ссылка КАК Задание
		|ПОМЕСТИТЬ КоличествоКонтролеровЗадания
		|ИЗ
		|	Справочник.упоЗадания.Контролеры КАК упоКонтролерыЗаданий
		|ГДЕ
		|	упоКонтролерыЗаданий.Ссылка = &Задание
		|	И упоКонтролерыЗаданий.Контролер = &ТекСотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	упоКонтролерыЗаданий.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникупоЗадания.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА &Исполнитель = НЕОПРЕДЕЛЕНО
		|				И СправочникупоЗадания.Исполнитель В (&СписокТрудовыхРесурсовПользователя)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &Исполнитель В (&СписокТрудовыхРесурсовПользователя)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЯИсполнитель,
		|	ВЫБОР
		|		КОГДА СправочникупоЗадания.АвторСотрудник = &ТекСотрудник
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЯАвтор
		|ПОМЕСТИТЬ АвторИсполнительЗадания
		|ИЗ
		|	Справочник.упоЗадания КАК СправочникупоЗадания
		|ГДЕ
		|	СправочникупоЗадания.Ссылка = &Задание
		|	И НЕ СправочникупоЗадания.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(АвторИсполнительЗадания.ЯИсполнитель, ЛОЖЬ) КАК ЯИсполнитель,
		|	ЕСТЬNULL(АвторИсполнительЗадания.ЯАвтор, ЛОЖЬ) КАК ЯАвтор,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КоличествоКонтролеровЗадания.Контролер, 0) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЯКонтролер
		|ИЗ
		|	АвторИсполнительЗадания КАК АвторИсполнительЗадания
		|		ПОЛНОЕ СОЕДИНЕНИЕ КоличествоКонтролеровЗадания КАК КоличествоКонтролеровЗадания
		|		ПО АвторИсполнительЗадания.Ссылка = КоличествоКонтролеровЗадания.Задание";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(РезультатФункции, Выборка);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Функция ТекстЗапросаПодчиненныхСогласований()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоЗадания.Ссылка КАК Ссылка,
		|	упоЗадания.Родитель КАК Родитель,
		|	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус
		|ИЗ
		|	Справочник.упоЗадания КАК упоЗадания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
		|		ПО упоЗадания.Ссылка = упоЗаданияСтатусыСрезПоследних.Задание
		|			И (упоЗадания.Родитель = &Родитель)
		|			И (упоЗадания.Ссылка <> &Согласование)
		|			И (упоЗаданияСтатусыСрезПоследних.Статус <> &Статус)";

	Возврат ТекстЗапроса;
	
КонецФункции //

// Формирует структуру параметров записи для РС упоКомментарииЗаданий
//
// Параметры:
//  пЗадание	 - СправочникСсылка.упоЗадания - задание.
//  пСтатус		 - ПеречислениеСсылка.упоСтатусыЗаданий	- статус задания.
//  Комментарий	 - Строка - 
//  пКомментарий - Строка - 
//  пАвтор		 - СправочникСсылка.упоСотрудники - автор изменения статуса.
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуруПараметровЗаписиКомментыЗаданий(пЗадание, пСтатус, Комментарий = "", пКомментарий = "", пАвтор = Неопределено)
	
	СтруктураПараметров = Новый Структура;
	
	Если пАвтор = Неопределено Тогда 		
		пАвтор = ПараметрыСеанса.упоТекущийСотрудник;		
	КонецЕсли;	
	
	СтруктураПараметров.Вставить("Задание", 				пЗадание);
	СтруктураПараметров.Вставить("Статус",					пСтатус);
	СтруктураПараметров.Вставить("Комментарий", 			Комментарий);
	СтруктураПараметров.Вставить("КомментарийПользователя", пКомментарий);		
	СтруктураПараметров.Вставить("Автор", 					пАвтор);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти