////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с ДДС.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Установить доступность даты привязки в строке ДДС.
//
// Параметры:
//  СтрокаДДС			 - ДанныеФормыСтруктура	 - Строка ДДС.
//  ИмяПоляПривязки		 - Строка				 - имя поля привязки.
//  ЭлементДатаПривязки	 - ПолеФормы			 - Колонка формы с датой привязки.
//  ЭлементЗадержка		 - ПолеФормы			 - Колонка формы с задержкой.
//
Процедура УстановитьДоступностьДатыПривязкиВСтрокеДДС(СтрокаДДС, ИмяПоляПривязки, ЭлементДатаПривязки, ЭлементЗадержка) Экспорт
	
	СпособПривязки = СтрокаДДС[ИмяПоляПривязки];
	
	Если ТипЗнч(СпособПривязки) = Тип("ПеречислениеСсылка.упоСпособПривязкиСхемОплаты") Тогда
		СоответствиеВидовПривязки = ПолучитьСоответствиеВидовПривязкиДДСИСхемыОплаты();		
		СпособПривязки = СоответствиеВидовПривязки.Получить(СпособПривязки);
	КонецЕсли;
	
	ЭлементДатаПривязки.ТолькоПросмотр = 
		НЕ (СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НаДату"));
		
	ДоступнаЗадержка = ДоступностьЗадержкиПоСпособуПривязкиДДС(СпособПривязки);		
	ЭлементЗадержка.ТолькоПросмотр = НЕ ДоступнаЗадержка;	
	Если Не ДоступнаЗадержка Тогда
		СтрокаДДС.Задержка = 0;
	КонецЕсли;
	
КонецПроцедуры

// Соответствие видов привязки схема оплаты и ДДС.
// 
// Возвращаемое значение:
//   Соответствие - Соответствие видов привязки ДДС видам привязки схем оплаты
//
Функция ПолучитьСоответствиеВидовПривязкиСхемаОплатыИДДС() Экспорт
	
	ИсходноеСоответствиеПеречислений = ПолучитьСоответствиеВидовПривязкиСхемаОплатыИДДС();
	
	СоответствиеПеречислений = Новый Соответствие;
	
	Для Каждого КлючЗначение Из ИсходноеСоответствиеПеречислений Цикл
		СоответствиеПеречислений.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат СоответствиеПеречислений; 

КонецФункции

// Соответствие видов привязки ДДС и схемы оплаты.
// 
// Возвращаемое значение:
//   Соответствие - Соответствие видов привязи схем оплаты видам привязки ДДС
//
Функция ПолучитьСоответствиеВидовПривязкиДДСИСхемыОплаты() Экспорт
		
	СоответствиеПеречислений = Новый Соответствие;
	
	СоответствиеПеречислений.Вставить(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.НачалоЗадачи"), 	  		
									  ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоЗадачи"));
									  
	СоответствиеПеречислений.Вставить(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.ЗавершениеЗадачи"),  		
									  ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеЗадачи"));
									  
	СоответствиеПеречислений.Вставить(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.НачалоПроекта"),
									  ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоПроекта"));
									  
	СоответствиеПеречислений.Вставить(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.ЗавершениеПроекта"),
									  ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеПроекта"));
									  
	СоответствиеПеречислений.Вставить(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.НаДату"),
								      ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НаДату"));
									  
	СоответствиеПеречислений.Вставить(ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.ПоПрофилюРаспределения"),
									  ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ПоПрофилюРаспределения"));
	
	Возврат СоответствиеПеречислений; 
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров трансляции БДР в ДДС.
//
// Параметры:
//  ВалютаУпрУчета         - СправочникСсылка.Валюты.
//  ПроектнаяЗадача        - ДокументСсылка.упоПроектняЗадача - проектная задача. Если не задано, то применяется из таблицы БДР.
//  Проект                 - СправочникСсылка.Проекты
//  ОтборСтрокБДРДляДДС    - Структура - параметры отбора строк БДР для формирования таблицы ДДС.
//  СоответствиеСхемОплаты - Соответствие - схемы оплаты задач (необходимо, если обрабатывается несколько задач).
//  СхемаОплатыПЗ_Доходы   - СправочникСсылка.упоСхемыОплаты
//  СхемаОплатыПЗ_Расходы  - СправочникСсылка.упоСхемыОплаты
// 
// Возвращаемое значение:
//  ПараметрыРасчетаДДС - Структура.
//
Функция ПараметрыРасчетаДДСПоБДР(ПроектнаяЗадача = Неопределено,
	Проект = Неопределено,
	ВалютаУпрУчета = Неопределено,
	СхемаОплатыПЗ_Доходы = Неопределено,
	СхемаОплатыПЗ_Расходы = Неопределено,
	СоответствиеСхемОплаты = Неопределено,
	ЭтоОтражениеТрудозатрат = Ложь) Экспорт
	
	ПараметрыРасчетаДДС = Новый Структура;
	ПараметрыРасчетаДДС.Вставить("ВалютаУпрУчета", 			ВалютаУпрУчета);
	ПараметрыРасчетаДДС.Вставить("ПроектнаяЗадача", 		ПроектнаяЗадача);
	ПараметрыРасчетаДДС.Вставить("СхемаОплатыПЗ_Доходы", 	СхемаОплатыПЗ_Доходы);
	ПараметрыРасчетаДДС.Вставить("СхемаОплатыПЗ_Расходы", 	СхемаОплатыПЗ_Расходы);
	ПараметрыРасчетаДДС.Вставить("СоответствиеСхемОплаты", 	СоответствиеСхемОплаты);
	ПараметрыРасчетаДДС.Вставить("ЭтоОтражениеТрудозатрат", ЭтоОтражениеТрудозатрат);
	ПараметрыРасчетаДДС.Вставить("Проект", 					Проект);
	ПараметрыРасчетаДДС.Вставить("ЭтоОбновлениеТрансляции", Истина);
	
	Возврат ПараметрыРасчетаДДС;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступностьЗадержкиПоСпособуПривязкиДДС(СпособПривязки) 
	
	Если СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоЗадачи") 
		ИЛИ СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеЗадачи") 
		ИЛИ СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоПроекта") 
		ИЛИ СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеПроекта") Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

