
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Документы.упоОтражениеФактаВПроектномБюджетировании.ОбновитьНаименованияПроектныхЗадач(Объект);
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.ДокументОснование = Неопределено;
	КонецЕсли;	
	
	НастроитьЭлементыФормы(Объект, ЭтаФорма);
			
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 				
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьНадписьПоследняяМодификация();
			
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОчиститьСообщения();
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Документы.упоОтражениеФактаВПроектномБюджетировании.ОбновитьНаименованияПроектныхЗадач(Объект);
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
			
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИзменяемоеЗначение = Объект.ДокументОснование;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)	
	ОчиститьДокумент(Элемент.Имя);	
КонецПроцедуры

&НаКлиенте
Процедура СтатусЗаполненияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьПравилоОтражения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОтраженияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОчиститьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОтраженияПередУдалением(Элемент, Отказ)
	ОчиститьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОтраженияПередНачаломИзменения(Элемент, Отказ)
	ОчиститьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Объект.РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элемент.ТекущиеДанные;	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИмяКолонки = СтрЗаменить(Поле.Имя, Элемент.Имя, "");
	Если ИмяКолонки = "Регистратор" ИЛИ ИмяКолонки = "ПравилоОтражения" Тогда
		ПоказатьЗначение(, ТекущиеДанные[ИмяКолонки]);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДДС.ТекущиеДанные;
	ТекущиеДанные.ПроектнаяЗадачаНаименование = ПроектнаяЗадачаПриИзмененииСервер(ТекущиеДанные.ПроектнаяЗадача);

КонецПроцедуры

&НаКлиенте
Процедура ДоходыРасходыПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходыРасходы.ТекущиеДанные;
	ТекущиеДанные.ПроектнаяЗадачаНаименование = ПроектнаяЗадачаПриИзмененииСервер(ТекущиеДанные.ПроектнаяЗадача);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РучнаяКорректировка(Команда)
	
	Объект.РучнаяКорректировка = НЕ Объект.РучнаяКорректировка;
	
	НастроитьЭлементыФормы(Объект, ЭтаФорма);	
	
	Если НЕ Объект.РучнаяКорректировка Тогда
		ИзменяемоеЗначение = НЕ Объект.РучнаяКорректировка;
		ОчиститьДокумент("РучнаяКорректировка");					
	КонецЕсли;	
				
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПравилу(Команда)
	
	ОчиститьСообщения();
			
	ЗаполнитьПоПравилуСервер();
		
	Если Объект.ОшибкиЗаполнения.Количество() > 0 Тогда
		ТекущаяСтраница = Элементы.СтраницаОшибкиЗаполнения;	
	ИначеЕсли Объект.ДоходыРасходы.Количество() = 0 И Объект.ДДС.Количество() > 0 Тогда
		ТекущаяСтраница = Элементы.СтраницаДДС;
	Иначе
		ТекущаяСтраница = Элементы.СтраницаДоходыРасходы;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ЗаполнитьПоПравилуСервер()
			
	ПроверитьЗаполнение();
	
	ДокОтражение = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);		
	Документы.упоОтражениеФактаВПроектномБюджетировании.ЗаполнитьДокументОтражениеПоПравилуОтражения(ДокОтражение);		
	ЗначениеВДанныеФормы(ДокОтражение, Объект);	
	
	Документы.упоОтражениеФактаВПроектномБюджетировании.ОбновитьНаименованияПроектныхЗадач(Объект);
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Объект, Форма, Открытие = Ложь)
	
	Элементы = Форма.Элементы;
		
	Элементы.КомандаРучнаяКорректировка.Пометка 	= Объект.РучнаяКорректировка;
		
	Элементы.СтраницаДоходыРасходы.ТолькоПросмотр 	= Не Объект.РучнаяКорректировка;
	Элементы.СтраницаДДС.ТолькоПросмотр 			= Не Объект.РучнаяКорректировка;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьДокумент(ИмяРеквизита = "")
	
	Если Объект.ДДС.Количество() > 0 ИЛИ Объект.ДоходыРасходы.Количество() > 0 Тогда
	
		ТекстВопроса = НСтр("ru='Данные документа будут очищены. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьДокументЗавершение", ЭтаФорма, ИмяРеквизита);
	
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ОчиститьШапкуДокументаСервер(ИмяРеквизита);
		
	КонецЕсли;       
	
КонецПроцедуры	

&НаКлиенте
Процедура ОчиститьДокументЗавершение(Результат, ИмяРеквизита) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
			Объект[ИмяРеквизита] = ИзменяемоеЗначение;
		КонецЕсли;	
		НастроитьЭлементыФормы(Объект, ЭтаФорма);
	Иначе	 				
		ОчиститьДокументСервер(ИмяРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокументСервер(ИмяРеквизита)
	
	Объект.ДоходыРасходы.Очистить();
	Объект.ДДС.Очистить();
	
	ОчиститьШапкуДокументаСервер(ИмяРеквизита);	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьШапкуДокументаСервер(ИмяРеквизита)
	
	Если ИмяРеквизита = "РучнаяКорректировка" Тогда		
		Возврат;		
	ИначеЕсли ИмяРеквизита = "ДокументОснование" Тогда			
		Объект.ПравилаОтражения.Очистить();
		Объект.НачалоПериода = Неопределено;
		Объект.ОкончаниеПериода = Неопределено;		
	Иначе		
		Объект.ДокументОснование = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПравилоОтражения()
			
	ПравилаОтраженияПоДокументуОснования = ПравилаОтраженияПоДокументуОснования(Объект);
	                 
	Если ПравилаОтраженияПоДокументуОснования.Количество() > 0 Тогда
		ПараметрыФормы = Новый Структура("Отбор");
		ПараметрыФормы.Отбор = Новый Структура("Ссылка", ПравилаОтраженияПоДокументуОснования);
		ОткрытьФорму("Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования.ФормаСписка", 
					ПараметрыФормы, 
					ЭтаФорма, 
					УникальныйИдентификатор);
	КонецЕсли;
					
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПравилаОтраженияПоДокументуОснования(Знач ДокументОтражение)
	
	Возврат Документы.упоОтражениеФактаВПроектномБюджетировании.ПравилаОтраженияПоДокументуОснованию(ДокументОтражение);
	
КонецФункции	

&НаСервере
Функция ПроектнаяЗадачаПриИзмененииСервер(ПроектнаяЗадача)
	
	Возврат Документы.упоОтражениеФактаВПроектномБюджетировании.ОбновитьНаименованияПроектныхЗадач(Объект, ПроектнаяЗадача);
	
КонецФункции	

#КонецОбласти
