
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоискПроблемРолевойСтруктурыНажатие(Элемент)
	
	мИмяФормы = "Обработка.упоПоискПроблемныхОбъектовИБ.Форма.ФормаУправляемая";
	ОткрытьФормуИнструмента(мИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСверткаПроцентыСтатусыНажатие(Элемент)
	
	мИмяФормы = "Обработка.упоСверткаРегистровПроцентыСтатусы.Форма.Форма";
	ОткрытьФормуИнструмента(мИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУдалениеПроектаНажатие(Элемент)
	
	мИмяФормы = "Обработка.упоУдалениеПроекта.Форма.ФормаУправляемая";
	ОткрытьФормуИнструмента(мИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуИнструмента(мИмяФормы)
	
	ОткрытьФорму(мИмяФормы, 
		,
		ЭтотОбъект, 
		ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПоискПроблемСтруктурыПроектаНажатие(Элемент)
	
	мИмяФормы = "Обработка.упоПроверкаСтруктурыПроекта.Форма.ФормаОсновнаяУправляемая";
	ОткрытьФормуИнструмента(мИмяФормы);
	
КонецПроцедуры

#КонецОбласти
