
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборТабличныхЧастей.Загрузить(
		Параметры.ОтборТабличныхЧастей.Выгрузить(
		Параметры.ОтборТабличныхЧастей.НайтиСтроки(Новый Структура("ТабличнаяЧасть", Параметры.ИмяТЧ))));
	Для каждого ТекДанные Из ОтборТабличныхЧастей Цикл
		УстановитьТип(ТекДанные);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборТабличныхЧастей

&НаКлиенте
Процедура ОтборТабличныхЧастейВидСравненияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОтборТабличныхЧастей.ТекущиеДанные;
	УстановитьТип(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТабличныхЧастейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТабличныхЧастейПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТабличныхЧастейЗначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОтборТабличныхЧастей.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.Значение) Тогда
		ТекДанные.Использование = Истина;	
	Иначе                                		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Окей(Команда)
	
	ВладелецФормы.ОбновитьОтборТабличныхЧастей(ОтборТабличныхЧастей);
	ВладелецФормы.Открыть();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ВладелецФормы.Открыть();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТип(ТекДанные)
	
	ОписаниеТиповСписок = Новый ОписаниеТипов("СписокЗначений");
	Если ТекДанные.ВидСравнения = ВидСравнения.ВСписке Или ТекДанные.ВидСравнения = ВидСравнения.НеВСписке Тогда 
		ТекДанные.Значение = ОписаниеТиповСписок.ПривестиЗначение(ТекДанные.Значение);
		ТекДанные.Значение.ТипЗначения = ТекДанные.ТипЭлемента;
	Иначе
		ТекДанные.Значение = ТекДанные.ТипЭлемента.ПривестиЗначение(ТекДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти