
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	ОбработатьЗаполнение(); 
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыНаФорму(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ПриОткрытииПосле(Отказ)
	
	ОбработатьОткрытие(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если ИКТ_ЗП_УОС.ЕстьПраваУОС() Тогда
		ПроверитьНаличиеДокументаУОС();     
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ОрганизацияПриИзмененииПосле(Элемент)
	
	ДобавитьРеквизитыНаФорму(); 
	
КонецПроцедуры

#Область ДоработкиЛС

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()  
	
	Если ИКТ_ЗП_УОС.ЕстьПраваУОС() Тогда
		НайденнаяКоманда = Команды.Найти("ОткрытьСвязанныйДокумент");   
		Если НайденнаяКоманда = Неопределено Тогда
			Команда = Команды.Добавить("ОткрытьСвязанныйДокумент"); 
			Команда.Заголовок = "ОткрытьСвязанныйДокумент";
			Команда.Действие  = "ОткрытьСвязанныйДокумент"; 
		КонецЕсли;
		
		НайденнаяКоманда = Команды.Найти("СоздатьСвязанныйДокумент");   
		Если НайденнаяКоманда = Неопределено Тогда
			Команда = Команды.Добавить("СоздатьСвязанныйДокумент"); 
			Команда.Заголовок = "СоздатьСвязанныйДокумент";
			Команда.Действие  = "СоздатьСвязанныйДокумент"; 
		КонецЕсли;
		
		ЭтоБухгалтерскаяОрганизация = ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Объект.Организация);
		ЭтоУОС = ИКТ_ЗП_УОС.ЭтоУОС(Объект.Организация);
		
		Элемент = Элементы.Найти("ИКТ_СоздатьСвязанныйДокумент"); 
		
		Если Элемент = Неопределено Тогда  
			
			Если ЭтоБухгалтерскаяОрганизация Тогда
				
				СвязанныйДокумент = ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка);
				
				Если НЕ ЗначениеЗаполнено(СвязанныйДокумент) Тогда
					
					НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СоздатьСвязанныйДокумент", Тип("КнопкаФормы"), Элементы.Шапка);
					НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка; 
					НовыйЭлемент.Заголовок = "Создать документ УОС";
					НовыйЭлемент.ИмяКоманды = "СоздатьСвязанныйДокумент";
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			Если ЭтоБухгалтерскаяОрганизация Тогда
				Элемент.Видимость = Истина;
			Иначе
				Элемент.Видимость = Ложь; 
			КонецЕсли;
			
		КонецЕсли;      
		
		Элемент = Элементы.Найти("ИКТ_СвязанныйДокумент"); 
		
		Если Элемент = Неопределено Тогда  
			
			Если ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС Тогда
				
				СвязанныйДокумент = ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка);
				
				Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда
					
					НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СвязанныйДокумент", Тип("КнопкаФормы"), Элементы.Шапка);
					НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка; 
					НовыйЭлемент.Заголовок = СтрШаблон("%1 %2", ?(ЭтоУОС, "БУ", "УОС"), СвязанныйДокумент);
					НовыйЭлемент.ИмяКоманды = "ОткрытьСвязанныйДокумент";
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			Если ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС Тогда
				Элемент.Видимость = Истина;
			Иначе
				Элемент.Видимость = Ложь; 
			КонецЕсли;
			
		КонецЕсли;   
	КонецЕсли;
	
	ИКТ_RequestСерверПривилегированный.ИКТ_ДобавитьЭлементыСостоянияРеквестНаФорму(ЭтаФорма, ,Элементы.ОсновныеРеквизиты); 
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвязанныйДокумент()
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПолучитьСвязанныйДокумент());
	
	ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);

КонецПроцедуры    

&НаСервере
Функция ПолучитьСвязанныйДокумент()

	Возврат ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка); 

КонецФункции

&НаКлиенте
Процедура СоздатьСвязанныйДокумент()  
	
	Если НЕ Объект.Проведен ИЛИ Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед вводом документа УОС требуется провести документ.");
	
	Иначе
	
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("УОС", Истина);
		ПараметрыФормы.Вставить("ДокументИсточник", Объект.Ссылка);
		
		ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ОбработатьЗаполнение()
	
	Если Параметры.Свойство("УОС") И Параметры.УОС = Истина Тогда
			
		ОбъектДляКопирования = ИКТ_ЗП_УОС.СоздатьСвязанныйДокумент(Параметры.ДокументИсточник);
		ЗначениеВРеквизитФормы(ОбъектДляКопирования, "Объект");
		Объект.ИКТ_ДокументИсточник = Параметры.ДокументИсточник;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеДокументаУОС()
	
	Оповестить("ИКТ_ЗаписанДокумент");
	
	Если НЕ ЭтоБухгалтерскаяОрганизация(Объект.Организация) ИЛИ НЕ Объект.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДокументУОС = ЕстьДокументУОС();
	
	Если ЕстьДокументУОС Тогда
		Возврат;
	КонецЕсли;  
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
	 
	ПоказатьВопрос(Оповещение, "Создать документ?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Не найден документ УОС.");    	

КонецПроцедуры    

&НаСервере
Функция ЭтоБухгалтерскаяОрганизация(Организация)

	Возврат ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Объект.Организация);	

КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("УОС", Истина);
		ПараметрыФормы.Вставить("ДокументИсточник", Объект.Ссылка);
		
		ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);

	КонецЕсли;	
 
КонецПроцедуры   

&НаСервере
Функция ЕстьДокументУОС()   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
		|ГДЕ
		|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
	
	Запрос.УстановитьПараметр("ДокументБУ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Возврат ?(ЗначениеЗаполнено(Выборка.ДокументУУ), Истина, Ложь);	
	
	КонецЦикла;
	
    Возврат Ложь;

КонецФункции    

&НаСервере
Функция ТипДокумента(Документ) 
	
	Возврат Документ.Метаданные().Имя;

КонецФункции

&НаКлиенте
Функция ОбработатьОткрытие()
	
	Если ЗначениеЗаполнено(Объект.ИКТ_ДокументИсточник) Тогда
		
		СотрудникПриИзменении("");
		
	КонецЕсли;  
	
	ПодключитьОбработчикОжидания("ИКТ_ОбновитьСостояниеОбменаСРеквест", 60, Ложь);
	
КонецФункции 

&НаКлиенте
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквест()
	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Объект.Организация.ИКТ_УУ Тогда
			
			Результат = ИКТ_RequestСерверПривилегированный.ПолучитьСоостояниеОбменаСРеквестПоОбъекту(Объект.Ссылка);
			
			Если Не ЗначениеЗаполнено(Результат.Период) Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Не выполнялся";
				
			ИначеЕсли Результат.Ошибка = Ложь и Результат.Выгружен = Ложь Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Объект в очереди на выгрузку";  
				
			ИначеЕсли Результат.Ошибка = Истина Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = СтрШаблон("Ошибка обмена. Дата выгрузки %1", Результат.Период);
				
			Иначе 
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен выполнен";
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен будет выполнен после записи объекта";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьНаСервере")
Процедура ИКТ_ЗаполнитьНаСервере()

	ИсключаемыеРегистраторы = ИсключаемыеРегистраторы();

	// Метод создает строки в коллекциях начислений и удержаний,
	// строки остальных коллекций заполняются при расчете.

	УстановитьПривилегированныйРежим(Истина);

	ПериодЗаполнения = Документы.Увольнение.ПериодЗаполненияДокумента(Объект, Объект.ПериодРегистрации);
	Сотрудники = СотрудникиДокумента();
	МенеджерРасчета = ПроинициализированныйМенеджерРасчета(ПериодЗаполнения, Сотрудники);

	МенеджерРасчета.НастройкиРасчета.ОкончательныйРасчет = Истина;
	МенеджерРасчета.НастройкиРасчета.ИсключатьРанееОплаченныеПериоды = Ложь;
	МенеджерРасчета.НастройкиРасчета.ИсключатьСтрокиПолностьюВытесненныхНачислений = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		МодульУправленческаяЗарплата = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
		МодульУправленческаяЗарплата.ПриИнициализацииМенеджераРасчетаДляЗаполненияДокументаРасчетаЗарплаты(МенеджерРасчета);
	КонецЕсли;

	Организация = Объект.Организация;
	МесяцНачисления = НачалоМесяца(Объект.ПериодРегистрации);
	// Если дата увольнения раньше начала месяца начисления, сдвигаем период расчета.
	НачалоПериода = Объект.МесяцНачалаРасчетов;

	Если ЭтоУвольнениеБудущимМесяцем(Объект) Тогда
		ОкончаниеПериода = Макс(КонецМесяца(МесяцНачисления), КонецДня(Объект.ДатаУвольнения));
	Иначе
		ОкончаниеПериода = Мин(КонецМесяца(МесяцНачисления), КонецДня(Объект.ДатаУвольнения));
	КонецЕсли;

	ПериодВыявления = Новый СтандартныйПериод;
	ПериодВыявления.ДатаНачала = ПериодЗаполнения.ДатаНачала;
	ПериодВыявления.ДатаОкончания = ОкончаниеПериода;

	ПараметрыИсправленного = Неопределено;
	ЭтоИсправление = ИсправлениеДокументовЗарплатаКадрыКлиентСервер.ЭтоИсправление(ЭтотОбъект, ПараметрыИсправленного);	

	ОтменятьТранзакцию = Ложь;
	ПродлеватьТранзакцию = Ложь;
	Если ЭтоИсправление Тогда
		Если Не ТранзакцияАктивна() Тогда
			НачатьТранзакцию();
			ОтменятьТранзакцию = Истина;
			ПродлеватьТранзакцию = Истина;
		КонецЕсли;
		Отказ = Ложь;
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ИсправлениеПериодическихСведений.ПолучитьПрежнийИсправленный(ДокументОбъект, Отказ, РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		ДокументИсправление = ?(ЗначениеЗаполнено(СсылкаНаОбъект), СсылкаНаОбъект, Документы.Увольнение.ПолучитьСсылку());
		ИсправлениеПериодическихСведений.ИсправлениеПериодическихСведений(ДокументОбъект, Отказ, РежимПроведенияДокумента.Неоперативный, ДокументИсправление, ПараметрыИсправленного.Ссылка);
		УправлениеШтатнымРасписанием.СторнироватьДвиженияДокумента(ДокументОбъект.Движения, ПараметрыИсправленного.Ссылка);
		Если Не МенеджерРасчета.ЭтоИсправлениеТекущимПериодом Тогда
			// Сброс признака исправления текущим периодом, на случай если ранее документ был исправлен текущим периодом.
			РегистрыРасчета.Начисления.ПриОтменеИсправленияВТекущемПериоде(ПараметрыИсправленного.Ссылка);
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьПоказателиПереработокСуммированногоУчета(МенеджерРасчета);

	ДополнительныеВидыРасчета = РасчетЗарплатыРасширенный.ДополнительныеНачисленияОсновныхВидовРасчета(ВидыРасчетаДокумента());

	// Если увольнение происходит в последний день месяца, 
	// то заработок за этот месяц также следует включить в базу среднего заработка при расчете компенсации за отпуск.
	ЗаполнятьОтрицательныеНачисленияЗаОтпуск = Истина;
	ЗаполнятьКомпенсациюНеИспользованныхОтгулов = Истина;
	СохранитьСреднийЗаработок = Не ПерезаполнятьСреднийЗаработок;
	Если Не СохранитьСреднийЗаработок И РассчитыватьСреднийЗаработокПриЗаполненииДокумента() Тогда

		// Выполняем расчет начислений для регистрации их в среднем заработке.
		ТаблицаНачислений = ТаблицаСпециализированныхНачислений(МенеджерРасчета);
		ЗаполнитьОтрицательныеНачисленияЗаОтпуск(ТаблицаНачислений, МенеджерРасчета);

		КомпенсируемыеДниОтгулов = Новый Соответствие;
		КомпенсируемыеЧасыОтгулов = Новый Соответствие;
		ЗаполнитьКомпенсациюНеИспользованныхОтгулов(ТаблицаНачислений, МенеджерРасчета, КомпенсируемыеДниОтгулов, КомпенсируемыеЧасыОтгулов);

		ЗаполнитьНачисления(ПериодВыявления, ИсключаемыеРегистраторы, МенеджерРасчета, ТаблицаНачислений);		
		СформироватьЗаписиПерерасчета(МенеджерРасчета);

		ЗаполнитьЗависимыеНачисленияКомпенсацииОтгуловПрошлыхПериодов(МенеджерРасчета);
		ЗаполнитьЗначенияПоказателейКомпенсацииОтгулов(КомпенсируемыеДниОтгулов, МенеджерРасчета, Истина);
		ЗаполнитьЗначенияПоказателейКомпенсацииОтгулов(КомпенсируемыеЧасыОтгулов, МенеджерРасчета, Ложь);

		МенеджерРасчета.НастройкиРасчета.РассчитыватьНачисления = Истина;
		МенеджерРасчета.РассчитатьЗарплату();

		ТаблицаРассчитанныхНачислений = МенеджерРасчета.Зарплата.Начисления.Скопировать();
		ТаблицаРассчитанныхУдержаний = МенеджерРасчета.Зарплата.Удержания.Скопировать();

		РасчетЗарплатыВДанныеФормы(МенеджерРасчета.Зарплата);
		ПериодВыявления = Неопределено;
		ЗаполнятьОтрицательныеНачисленияЗаОтпуск = Ложь;
		ЗаполнятьКомпенсациюНеИспользованныхОтгулов = Ложь;
		Если Не ТранзакцияАктивна() Тогда
			НачатьТранзакцию();
			ОтменятьТранзакцию = Истина;
		КонецЕсли;

		// Для корректной регистрации данных среднего заработка нужно прежде зарегистрировать начисления и отработанное время.
		ДанныеДляПроведения = ДанныеДокументаДляПроведения();
		ИсключаемыеРегистраторы.Добавить(ДанныеДляПроведения.ДокументСсылка);

		// Регистрируем данные документа в учете.
		Отказ = Ложь;
		// Смоделируем коллекцию движений документа.
		НаборыЗаписей = ЗарплатаКадры.НаборыЗаписейРегистратора(Метаданные.Документы.Увольнение, ДанныеДляПроведения.ДокументСсылка);
		ИсправлениеДокументовРасчетЗарплаты.ПриВременнойРегистрацииИсправления(НаборыЗаписей, ДанныеДляПроведения);
		// Регистрация начислений
		РасчетЗарплатыРасширенный.СформироватьДвиженияНачислений(
		НаборыЗаписей, Отказ, Объект.Организация, КонецМесяца(Объект.ПериодРегистрации), ДанныеДляПроведения.Начисления, ДанныеДляПроведения.ПоказателиНачислений, Истина);
		// Регистрация отработанного времени в учете начислений и удержаний.
		ДанныеДляПроведенияУчетЗарплаты = ОтражениеЗарплатыВУчете.ОписаниеДанныеДляПроведения();
		ДанныеДляПроведенияУчетЗарплаты.Движения 				= НаборыЗаписей;
		ДанныеДляПроведенияУчетЗарплаты.Организация 			= Объект.Организация;
		ДанныеДляПроведенияУчетЗарплаты.ПериодРегистрации 		= Объект.ПериодРегистрации;
		ДанныеДляПроведенияУчетЗарплаты.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
		УчетНачисленнойЗарплаты.ЗарегистрироватьОтработанноеВремя(ДанныеДляПроведенияУчетЗарплаты, Отказ, ДанныеДляПроведения.ОтработанноеВремяПоСотрудникам, Истина);

		// Определяем исключаемый регистратор, который будет использоваться при обновлении корректировок.	
		НаборыЗаписей.ДанныеОВремениДляРасчетаСреднегоОбщий.ДополнительныеСвойства.Вставить("ИсключаемыйРегистратор", СсылкаНаОбъект);
		// Учет среднего заработка
		УчетСреднегоЗаработка.ЗарегистрироватьДанныеСреднегоЗаработка(НаборыЗаписей, Отказ, ДанныеДляПроведения.НачисленияДляСреднегоЗаработка, Истина);

		// Обновляем данные среднего заработка в документе с учетом зарегистрированных начислений.
		ЗаполнитьПериодРасчетаСреднегоЗаработка();

		ОчиститьРассчитанныеДанные();

		Если ОтменятьТранзакцию = Истина И ПродлеватьТранзакцию = Ложь Тогда
			ОтменитьТранзакцию();
		ИначеЕсли ПродлеватьТранзакцию = Истина Тогда
			НаборыЗаписей.Начисления.Очистить();
			НаборыЗаписей.Начисления.Записать();
		КонецЕсли;

	Иначе
		Если ПерезаполнятьСреднийЗаработок Тогда
			ОбновитьДанныеДляРасчетаСреднего();
		КонецЕсли;
	КонецЕсли;

	Если ПерезаполнятьСреднийЗаработокСФР Тогда
		ОбновитьДанныеДляРасчетаСреднегоФСС();
	КонецЕсли;

	Если ОбновитьРасчетДенежногоСодержания Тогда
		ОбновитьДанныеДляРасчетаСохраняемогоДенежногоСодержания();
	КонецЕсли;

	ЗначенияПоказателейДляВыходногоПособия = Неопределено;
	ЗначенияПоказателейДляКомпенсаций = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда 
		СтруктураОбъекта = ПодготовитьСтруктуруОбъектаДляРасчетаДенежногоСодержания();
		МодульРасчетДенежногоСодержания = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
		ЗначенияПоказателейСохраняемогоДенежногоСодержания = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержания(СтруктураОбъекта);
		ЗначенияПоказателейДляВыходногоПособия = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержанияПоНазначению(ЗначенияПоказателейСохраняемогоДенежногоСодержания, "ВыходноеПособие");
		ЗначенияПоказателейДляКомпенсаций = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержанияПоНазначению(ЗначенияПоказателейСохраняемогоДенежногоСодержания, "ВыходноеПособие");
	КонецЕсли;

	Если Не Объект.ФиксПределДоходаНеОблагаемогоНДФЛ Тогда
		РассчитатьПределДоходаНеОблагаемогоНДФЛ();	
	КонецЕсли;

	Если Не Объект.ФиксПределДоходаНеОблагаемогоСтраховымиВзносами Тогда
		РассчитатьПределДоходаНеОблагаемогоСтраховымиВзносами();	
	КонецЕсли;

	ПерезаполнятьСреднийЗаработок = Истина;
	ПерезаполнятьСреднийЗаработокСФР = Истина;

	// Дополняем таблицу начислений строками специализированных.
	ТаблицаНачислений = ТаблицаСпециализированныхНачислений(МенеджерРасчета);
	ЗаполнитьВыходноеПособие(ТаблицаНачислений, МенеджерРасчета, ДополнительныеВидыРасчета, ЗначенияПоказателейДляВыходногоПособия);
	ЗаполнитьКомпенсацииЗаОтпуск(ТаблицаНачислений, МенеджерРасчета, ДополнительныеВидыРасчета, ЗначенияПоказателейДляКомпенсаций);

	Если ЗаполнятьКомпенсациюНеИспользованныхОтгулов Тогда
		КомпенсируемыеДниОтгулов = Новый Соответствие;
		КомпенсируемыеЧасыОтгулов = Новый Соответствие;
		ЗаполнитьКомпенсациюНеИспользованныхОтгулов(ТаблицаНачислений, МенеджерРасчета, КомпенсируемыеДниОтгулов, КомпенсируемыеЧасыОтгулов);
	КонецЕсли;

	Если ЗаполнятьОтрицательныеНачисленияЗаОтпуск Тогда
		ЗаполнитьОтрицательныеНачисленияЗаОтпуск(ТаблицаНачислений, МенеджерРасчета);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.ДосрочноеУвольнение") Тогда
		МодульДосрочноеУвольнение = ОбщегоНазначения.ОбщийМодуль("ДосрочноеУвольнение");
		МодульДосрочноеУвольнение.УвольнениеЗаполнитьКомпенсациюЗаНеотработанноеВремя(ЭтотОбъект, ТаблицаНачислений, МенеджерРасчета, ДополнительныеВидыРасчета);
	КонецЕсли;

	Если СохранитьСреднийЗаработок Или Не РассчитыватьСреднийЗаработокПриЗаполненииДокумента() Тогда

		ЗаполнитьНачисления(ПериодВыявления, ИсключаемыеРегистраторы, МенеджерРасчета, ТаблицаНачислений);
		СформироватьЗаписиПерерасчета(МенеджерРасчета);

	Иначе

		МенеджерРасчета.ЗаполнитьНачисленияСотрудниковЗаПериод(Сотрудники, ТаблицаНачислений, ПериодВыявления);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРассчитанныхНачислений, МенеджерРасчета.Зарплата.Начисления);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРассчитанныхУдержаний, МенеджерРасчета.Зарплата.Удержания);

	КонецЕсли;

	Если ЗаполнятьКомпенсациюНеИспользованныхОтгулов Тогда
		ЗаполнитьЗависимыеНачисленияКомпенсацииОтгуловПрошлыхПериодов(МенеджерРасчета);
		ЗаполнитьЗначенияПоказателейКомпенсацииОтгулов(КомпенсируемыеДниОтгулов, МенеджерРасчета, Истина);
		ЗаполнитьЗначенияПоказателейКомпенсацииОтгулов(КомпенсируемыеЧасыОтгулов, МенеджерРасчета, Ложь);
	КонецЕсли;

	// Удержания (рассчитываем, если выплата в межрасчетный период).
	ЗаполнитьУдержания(МенеджерРасчета);

	ЗаполнитьНастройкиМенеджераРасчета(МенеджерРасчета);
	МенеджерРасчета.НастройкиБухучета.КоэффициентыСреднегоЗаработкаДокумента = УчетСреднегоЗаработка.КоэффициентыРаспределенияСреднегоЗаработкаДокумента(Объект, ОписаниеДокумента(ЭтотОбъект));
	МенеджерРасчета.НастройкиБухучета.КоэффициентыРаспределенияДенежногоСодержания = Объект.КоэффициентыРаспределенияДенежногоСодержания.Выгрузить();

	МенеджерРасчета.ДополнительныеСвойства.Вставить("ДанныеДляУчетаПособийПриУвольнении", ДанныеДляУчетаПособийПриУвольнении());
	
	МенеджерРасчета.РассчитатьЗарплату();
	#Вставка
	//++ЛС 24.07.2025 
	
	ИКТ_ЗП_УОС.УдалитьЛишниеНачисления(МенеджерРасчета.Зарплата.Начисления);
	
	Индекс = 0;
	Пока Индекс < МенеджерРасчета.Зарплата.Начисления.Количество() Цикл
		Строка = МенеджерРасчета.Зарплата.Начисления[Индекс];
		
		Если  НЕ ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Строка.Сотрудник.ГоловнаяОрганизация) Тогда
			Прервать;
		КонецЕсли; 
		
		Если  Строка.Начисление.ИКТ_УУ  Тогда
			МенеджерРасчета.Зарплата.Начисления.Удалить(Индекс); 
			Продолжить;
		КонецЕсли; 
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	//--ЛС 24.07.2025
	#КонецВставки

	РасчетЗарплатыВДанныеФормы(МенеджерРасчета.Зарплата);

	МенеджерРасчета = Неопределено;

	Если ОтменятьТранзакцию = Истина Тогда
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЕсли;

	УстановитьВидимостьПерерасчетов();

КонецПроцедуры
#КонецОбласти 


