////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции показателей проектов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает значения реквизитов у предопределенных элементов "go", "get", "freeze", "move" в 
// справочнике упоПоказателиПроектов.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ЗаполнитьПоказателиGoGetFreeze() Экспорт
	
	Freeze = Справочники.упоПоказателиПроектов.Freeze.ПолучитьОбъект();	
	Freeze.ПолноеНаименование = Freeze.Наименование;
	Freeze.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	Freeze.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Freeze.ФорматнаяСтрока = "ЧЦ=3; ЧДЦ=; ЧН=";
	Freeze.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий;
	Freeze.Порядок = 3500;
	Freeze.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Freeze.Записать();
	
	FreezeDate = Справочники.упоПоказателиПроектов.FreezeDate.ПолучитьОбъект();	
	FreezeDate.ПолноеНаименование = FreezeDate.Наименование;
	FreezeDate.ТипИндикатора = Перечисления.упоТипИндикатора.Дата;
	FreezeDate.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	FreezeDate.ФорматнаяСтрока = "ДЛФ=D";
	FreezeDate.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий;
	FreezeDate.Порядок = 3600;
	FreezeDate.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	FreezeDate.Записать();
	
	Go = Справочники.упоПоказателиПроектов.Go.ПолучитьОбъект();	
	Go.ПолноеНаименование = Go.Наименование;
	Go.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	Go.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Go.ФорматнаяСтрока = "ЧЦ=3; ЧДЦ=; ЧН=";
	Go.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий;
	Go.Порядок = 3300;
	Go.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Go.Записать();
	
	Get = Справочники.упоПоказателиПроектов.Get.ПолучитьОбъект();	
	Get.ПолноеНаименование = Get.Наименование;
	Get.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	Get.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Get.ФорматнаяСтрока = "ЧЦ=3; ЧДЦ=; ЧН=";
	Get.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий;
	Get.Порядок = 3400;
	Get.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Get.Записать();
	
	ЗаполнитьПоказателиMove();
	
КонецФункции

// Устанавливает значения реквизитов у предопределенных элементов "move" в
//  справочнике упоПоказателиПроектов.
//
// Параметры:
//  Параметры	 - Неопределено, Структура
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ЗаполнитьПоказателиMove(Параметры = Неопределено) Экспорт 
	
	Move = Справочники.упоПоказателиПроектов.Move.ПолучитьОбъект();	
	Move.ПолноеНаименование = Move.Наименование;
	Move.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	Move.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Move.ФорматнаяСтрока = "ЧЦ=3; ЧДЦ=; ЧН=";
	Move.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий;
	Move.Порядок = 3700;
	Move.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Move.Записать();

	MoveМес = Справочники.упоПоказателиПроектов.MoveМес.ПолучитьОбъект();	
	MoveМес.ПолноеНаименование = MoveМес.Наименование;
	MoveМес.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	MoveМес.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	MoveМес.ФорматнаяСтрока = "ЧЦ=3; ЧДЦ=; ЧН=";
	MoveМес.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий;
	MoveМес.Порядок = 3800;
	MoveМес.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	MoveМес.Записать();	
	
КонецФункции

// Устанавливает значения реквизитов у предопределенного элемента "Коэффициент сложности" в
// справочнике упоПоказателиПроектов.
//
Процедура ЗаполнитьПоказательКоэффициентСложности() Экспорт
	
	КоэффициентСложности = Справочники.упоПоказателиПроектов.КоэффициентСложности.ПолучитьОбъект();	
	КоэффициентСложности.ПолноеНаименование = "Коэффициент сложности";
	КоэффициентСложности.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	КоэффициентСложности.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	КоэффициентСложности.ФорматнаяСтрока = "ЧЦ=10; ЧДЦ=2; ЧН=";
	КоэффициентСложности.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий;
	КоэффициентСложности.Порядок = 3700;
	КоэффициентСложности.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	КоэффициентСложности.Записать();
	
КонецПроцедуры

// Устанавливает значения реквизитов у предопределенных элементов связанных с проектами продаж в
// справочнике упоПоказателиПроектов.
//
Процедура ЗаполнитьПоказателиПроектаПродажи() Экспорт
	
	Показатель = Справочники.упоПоказателиПроектов.ВероятностьПродажи.ПолучитьОбъект();	
	Показатель.ПолноеНаименование = НСтр("ru = 'Вероятность продажи, %'");
	Показатель.Наименование = Показатель.ПолноеНаименование;
	Показатель.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	Показатель.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Показатель.ФорматнаяСтрока = "ЧЦ=3; ЧДЦ=0";
	Показатель.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта;
	Показатель.Порядок = 11561;
	Показатель.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Показатель.Записать();
	
	Показатель = Справочники.упоПоказателиПроектов.ДатаПродажиПрогноз.ПолучитьОбъект();	
	Показатель.ПолноеНаименование = НСтр("ru = 'Дата продажи, прогноз'");
	Показатель.Наименование = Показатель.ПолноеНаименование;
	Показатель.ТипИндикатора = Перечисления.упоТипИндикатора.Дата;
	Показатель.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Показатель.ФорматнаяСтрока = "ДФ=dd.MM.yy";
	Показатель.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта;
	Показатель.Порядок = 11562;
	Показатель.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Показатель.Записать();
	
	Показатель = Справочники.упоПоказателиПроектов.СуммаДоговораПрогноз.ПолучитьОбъект();	
	Показатель.ПолноеНаименование = НСтр("ru = 'Сумма договора, прогноз'");
	Показатель.Наименование = Показатель.ПолноеНаименование;
	Показатель.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	Показатель.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Показатель.ФорматнаяСтрока = "ЧДЦ=0";
	Показатель.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта;
	Показатель.Порядок = 11563;
	Показатель.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Показатель.Записать();
	
	Показатель = Справочники.упоПоказателиПроектов.СуммаДоговораФакт.ПолучитьОбъект();	
	Показатель.ПолноеНаименование = НСтр("ru = 'Сумма договора, факт'");
	Показатель.Наименование = Показатель.ПолноеНаименование;
	Показатель.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	Показатель.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	Показатель.ФорматнаяСтрока = "ЧДЦ=0";
	Показатель.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта;
	Показатель.Порядок = 11564;
	Показатель.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Показатель.Записать();
	
	// Показатели типа проекта
	
	МассивПоказателей = ПолучитьМассивПоказателейПоТипуПроекта(Справочники.упоТипыПроектов.Продажа);
	
	Продажа = Справочники.упоТипыПроектов.Продажа.ПолучитьОбъект();
	Для Каждого ПоказательСсылка Из МассивПоказателей Цикл
		Строка = Продажа.Показатели.Найти(ПоказательСсылка, "Показатель");
		Если Строка <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Продажа.Показатели.Добавить().Показатель = ПоказательСсылка;
	КонецЦикла;
	Если Продажа.Модифицированность() Тогда
		Продажа.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Изменяет имена регистров в тексте запроса показателей.
//
// Возвращаемое значение:
//	Неопределено - не возвращает ничего.
//
Функция ПереименоватьРегистрыСвВПоказателях() Экспорт 
	
	СписокПереименованныхРегистров = Новый СписокЗначений;
	СписокПоказателейСУстаревшимиРС = Новый СписокЗначений;
	
	СписокПереименованныхРегистров.Добавить("упоДанныеПлановыхДоходовИРасходов", "упоДанныеПлановДоходовИРасходовПодразделения");
	СписокПереименованныхРегистров.Добавить("упоПланДоходовИРасходов", "упоАктуальныеПланыДоходовИРасходовПодразделения");
	СписокПереименованныхРегистров.Добавить("упоДанныеПлановыхОбъемов", "упоДанныеПлановОбъемовПодразделения");
	СписокПереименованныхРегистров.Добавить("упоПлановыеОбъемы", "упоАктуальныеПланыВыполненияОбъемов");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	упоПоказателиПроектов.Ссылка,
	                |	упоПоказателиПроектов.ТекстЗапроса
	                |ИЗ
	                |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	                |ГДЕ
	                |	упоПоказателиПроектов.ТипЗаполнения = 0
	                |	И упоПоказателиПроектов.ВидЗаполнения В(&ТипИндикатора)
	                |	И НЕ упоПоказателиПроектов.ПометкаУдаления";
	
	МассивТиповИ = Новый Массив;
	МассивТиповИ.Добавить(Перечисления.упоВидЗаполненияИндикатора.Автоматически);
	МассивТиповИ.Добавить(Перечисления.упоВидЗаполненияИндикатора.АвтоматическиВДокументе);
	 
	Запрос.УстановитьПараметр("ТипИндикатора", МассивТиповИ);
	
	ВыборкаПоказателей = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаПоказателей.Следующий() Цикл
		
		Для Каждого УстаревшийРС Из СписокПереименованныхРегистров Цикл
			
			Если Найти(ВыборкаПоказателей.ТекстЗапроса, "РегистрСведений." + УстаревшийРС.Значение) > 0
				И СписокПоказателейСУстаревшимиРС.НайтиПоЗначению(ВыборкаПоказателей.Ссылка)  = Неопределено Тогда
				
				СписокПоказателейСУстаревшимиРС.Добавить(ВыборкаПоказателей.Ссылка);
				
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ПоказательУстаревший Из СписокПоказателейСУстаревшимиРС Цикл
		
		ПоказательОбъект = ПоказательУстаревший.Значение.ПолучитьОбъект();
		ТекстЗапросаПоказателя = ПоказательОбъект.ТекстЗапроса;
		
		Для Каждого УстаревшийРС Из СписокПереименованныхРегистров Цикл		
			
			ТекстЗапросаПоказателя = СтрЗаменить(ТекстЗапросаПоказателя, "РегистрСведений." + УстаревшийРС.Значение,
				"РегистрСведений." + УстаревшийРС.Представление);
			
		КонецЦикла;
		
		ПоказательОбъект.ТекстЗапроса = ТекстЗапросаПоказателя;
		ПоказательОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
		
		Попытка
			ПоказательОбъект.Записать();	
		Исключение
			ПараметрыОшибки = Новый Структура;
			ПараметрыОшибки.Вставить("Событие", "Запись справочника " + ПоказательУстаревший.Значение);
			ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
			ПараметрыОшибки.Вставить("ОбъектМетаданных", Метаданные.Справочники.упоПоказателиПроектов);
			ПараметрыОшибки.Вставить("Данные", ПоказательУстаревший.Значение);
			ПараметрыОшибки.Вставить("Комментарий", ОписаниеОшибки());			
			упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(ПараметрыОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецФункции

// Заполняет картинки по умолчанию и табличную часть "Состояния" предопределенных элементов 
// справочника "Показатели проектов".
Процедура ЗаполнитьКартинкиПоказателей() Экспорт

	// Freeze, Date.
	ПоказательОбъект = Справочники.упоПоказателиПроектов.FreezeDate.ПолучитьОбъект();
	ЗаполнитьКартинкиПоказателя(ПоказательОбъект);
	ПоказательОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	ПоказательОбъект.Записать();
	
	ПоказательОбъект = Справочники.упоПоказателиПроектов.Get.ПолучитьОбъект();
	ЗаполнитьКартинкиПоказателя(ПоказательОбъект);
	ПоказательОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	ПоказательОбъект.Записать();
	
	ПоказательОбъект = Справочники.упоПоказателиПроектов.Go.ПолучитьОбъект();
	ЗаполнитьКартинкиПоказателя(ПоказательОбъект);
	ПоказательОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	ПоказательОбъект.Записать();
	
	ПоказательОбъект = Справочники.упоПоказателиПроектов.Freeze.ПолучитьОбъект();
	ЗаполнитьКартинкиПоказателя(ПоказательОбъект);
	ПоказательОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	ПоказательОбъект.Записать();
	
	ПоказательОбъект = Справочники.упоПоказателиПроектов.КоэффициентСложности.ПолучитьОбъект();
	ЗаполнитьКартинкиПоказателя(ПоказательОбъект);
	ПоказательОбъект.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	ПоказательОбъект.Записать();


КонецПроцедуры

// Устанавливает значения реквизитов у предопределенных элементов "Предшественники", "ВнешниеПредшественники".
//
Процедура ЗаполнитьПоказателиПредшественники() Экспорт
		
	Показатель = Справочники.упоПоказателиПроектов.Предшественники.ПолучитьОбъект();	
	Показатель.ПолноеНаименование = Показатель.Наименование;
	Показатель.ТипИндикатора = Перечисления.упоТипИндикатора.Строка;
	Показатель.ТипЗаполнения = 2;
	Показатель.СчитатьСуммуПоГруппировкам = Ложь;
	Показатель.ВыражениеГруппировки = "";
	Показатель.ФорматнаяСтрока = "";
	Показатель.строкаФормулы = "";
	Показатель.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Автоматически;
	Показатель.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи;
	Показатель.Порядок = 7000;
	Показатель.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Показатель.Записать();
	
	Показатель = Справочники.упоПоказателиПроектов.ВнешниеПредшественники.ПолучитьОбъект();	
	Показатель.ПолноеНаименование = Показатель.Наименование;
	Показатель.ТипИндикатора = Перечисления.упоТипИндикатора.Строка;
	Показатель.ТипЗаполнения = 2;
	Показатель.СчитатьСуммуПоГруппировкам = Ложь;
	Показатель.ВыражениеГруппировки = "";
	Показатель.ФорматнаяСтрока = "";
	Показатель.строкаФормулы = "";
	Показатель.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Автоматически;
	Показатель.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи;
	Показатель.Порядок = 7100;
	Показатель.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Показатель.Записать();
	
КонецПроцедуры

// Устанавливает значения реквизитов у предопределенного элемента "Ставка стоимости денег" в
//  справочнике упоПоказателиПроектов.
//
// Параметры:
//  Параметры	 - Неопределено, Структура
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ЗаполнитьПоказательСтавкаСтоимостиДенег(Параметры = Неопределено) Экспорт 
	
	СтавкаСтоимостиДенег = Справочники.упоПоказателиПроектов.СтавкаСтоимостиДенег.ПолучитьОбъект();	
	СтавкаСтоимостиДенег.ПолноеНаименование = СтавкаСтоимостиДенег.Наименование;
	СтавкаСтоимостиДенег.ТипИндикатора = Перечисления.упоТипИндикатора.Число;
	СтавкаСтоимостиДенег.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную;
	СтавкаСтоимостиДенег.ФорматнаяСтрока = "ЧДЦ=2";
	СтавкаСтоимостиДенег.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта;
	СтавкаСтоимостиДенег.Порядок = 17100;
	СтавкаСтоимостиДенег.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	СтавкаСтоимостиДенег.Записать();
	
КонецФункции

// Заполняет порядок показателей Go, Get, Freeze, FreezeDate и Коэффициент сложности значениями по умолчанию.
//
Процедура ЗаполнитьПорядокПоказателей() Экспорт

	Freeze = Справочники.упоПоказателиПроектов.Freeze.ПолучитьОбъект();	
	Freeze.Порядок = 3500; 
	Freeze.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Freeze.Записать();
	
	FreezeDate = Справочники.упоПоказателиПроектов.FreezeDate.ПолучитьОбъект();	
	FreezeDate.Порядок = 3600;
	FreezeDate.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	FreezeDate.Записать();
	
	Go = Справочники.упоПоказателиПроектов.Go.ПолучитьОбъект();	
	Go.Порядок = 3300;
	Go.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Go.Записать();
	
	Get = Справочники.упоПоказателиПроектов.Get.ПолучитьОбъект();	
	Get.Порядок = 3400;
	Get.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	Get.Записать();
	
	КоэффициентСложности = Справочники.упоПоказателиПроектов.КоэффициентСложности.ПолучитьОбъект();	
	КоэффициентСложности.Порядок = 3700;
	КоэффициентСложности.ДополнительныеСвойства.Вставить("РазрешитьЗаписьПредопределенных", Истина);
	КоэффициентСложности.Записать();

КонецПроцедуры

// Функция - Возвращает значение показателя проекта.
//
// Параметры:
//  Показатель				 - СправочникСсылка.упоПоказателиПроектов	 - Показатель.
//  Проект					 - СправочникСсылка.Проекты					 - Проект.
//  РасчетВДокументе		 - Булево									 - Признак вызова функции из документа "упоРегистрацияПоказателейПроекта" - Булево.
//  ТекстОшибки				 - Строка
//  СтруктураДопПараметров	 - Структура
//  ФорматироватьРезультат	 - Булево
// 
// Возвращаемое значение:
//  Произвольный, Неопределено - Значение показателя, Неопределено когда значения нет.
//
Функция ПолучитьЗначениеПоказателя(
			Показатель, 
			Проект, 
			РасчетВДокументе = Ложь, 
			ТекстОшибки = "", 
			СтруктураДопПараметров = Неопределено,
			ФорматироватьРезультат = Ложь) Экспорт
	
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(Показатель) ИЛИ Не ЗначениеЗаполнено(Проект) Тогда
		ТекстОшибкиЗаполнения = НСтр("ru = 'Не указан проект или показатель'");
		ТекстОшибки = ТекстОшибки + ТекстОшибкиЗаполнения + Символы.ПС;
		Возврат Результат;
	КонецЕсли;
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить(Показатель);
	МассивПроектов = Новый Массив;
	МассивПроектов.Добавить(Проект);
	ЗначенияПоказателейПроектов = ПолучитьЗначенияПоказателей(МассивПоказателей, МассивПроектов, РасчетВДокументе,
		СтруктураДопПараметров, ФорматироватьРезультат);
	
	Возврат ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроектов, Показатель, Проект);
	
КонецФункции

// Функция - Получить соответствие показателей предшественников
//
// Параметры:
//  МассивЗеркалПроектныхЗадач	 - Массив	 -  Массив зеркал проектных задач.
// 
// Возвращаемое значение:
//  Соответствие - Ключ - зеркало проектной задачи, Значение - структура с ключами Предшественники и ПредшественникиПроектов
//						  с массивами подготовленными для СтрСоединить в значениях.
//
Функция ПолучитьСоответствиеПоказателейПредшественников(МассивЗеркалПроектныхЗадач) Экспорт
	
	ЗапросПредшественников = Новый Запрос;
	ЗапросПредшественников.УстановитьПараметр("МассивЗеркалПроектныхЗадач", МассивЗеркалПроектныхЗадач);
	ЗапросПредшественников.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
	|	Проекты.Ссылка КАК Зеркало
	|ПОМЕСТИТЬ ВТ_Задачи
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Ссылка В(&МассивЗеркалПроектныхЗадач)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ_Задачи.Зеркало КАК Зеркало,
	|	упоПредусловияПроектныхЗадачСрезПоследних.ЗадачаПредшественник КАК ЗадачаПредшественник,
	|	упоПредусловияПроектныхЗадачСрезПоследних.ТипСвязи КАК ТипСвязи,
	|	упоПредусловияПроектныхЗадачСрезПоследних.Задержка КАК Задержка,
	|	упоПредусловияПроектныхЗадачСрезПоследних.СвязьМеждуПроектами КАК СвязьМеждуПроектами
	|ПОМЕСТИТЬ ВТ_Предшественники
	|ИЗ
	|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(
	|			,
	|			ПроектнаяЗадача В
	|				(ВЫБРАТЬ
	|					Вт_Задачи.ПроектнаяЗадача
	|				ИЗ
	|					Вт_Задачи КАК Вт_Задачи)) КАК упоПредусловияПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Задачи КАК ВТ_Задачи
	|		ПО упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ВТ_Задачи.ПроектнаяЗадача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоПредусловияПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ) КАК СвойстваПредшественника
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроектовПредшественников
	|			ПО СвойстваПредшественника.Версия = упоВерсииПроектовПредшественников.Версия
	|				И (упоВерсииПроектовПредшественников.Текущая)
	|				И (НЕ СвойстваПредшественника.ЗадачаОтменена)
	|		ПО упоПредусловияПроектныхЗадачСрезПоследних.ЗадачаПредшественник = СвойстваПредшественника.ПроектнаяЗадача
	|ГДЕ
	|	упоПредусловияПроектныхЗадачСрезПоследних.СвязьСуществует
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Предшественники.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ_Предшественники.Зеркало КАК Зеркало,
	|	ВТ_Предшественники.ЗадачаПредшественник КАК ЗадачаПредшественник,
	|	ВТ_Предшественники.ТипСвязи КАК ТипСвязи,
	|	ВТ_Предшественники.Задержка КАК Задержка,
	|	ВТ_Предшественники.СвязьМеждуПроектами КАК СвязьМеждуПроектами,
	|	Проекты.Ссылка КАК ЗеркалоПредшественника,
	|	Проекты.КодСДР КАК КодСДРПредшественника,
	|	Проекты.упоКорневойПроект КАК ПроектПредшественника
	|ИЗ
	|	ВТ_Предшественники КАК ВТ_Предшественники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО ВТ_Предшественники.ЗадачаПредшественник = Проекты.СсылкаНаПроектнуюЗадачу";
	
	ВыборкаПредшественников = ЗапросПредшественников.Выполнить().Выбрать();
	
	СоответствиеПредшественников = Новый Соответствие;
	
	Пока ВыборкаПредшественников.Следующий() Цикл
		
		СтруктураЗадачи = СоответствиеПредшественников.Получить(ВыборкаПредшественников.Зеркало);
		Если СтруктураЗадачи = Неопределено Тогда
			СтруктураЗадачи = Новый Структура("Предшественники, ПредшественникиПроектов", Новый Массив, Новый Массив);;
		КонецЕсли;
		
		Если ВыборкаПредшественников.СвязьМеждуПроектами Тогда
			
			ТекМассив = СтруктураЗадачи.ПредшественникиПроектов;	
			
			ТекМассив.Добавить("[");
			ТекМассив.Добавить(Строка(ВыборкаПредшественников.ПроектПредшественника));
			ТекМассив.Добавить("]");	
			ТекМассив.Добавить("/");
			
		Иначе
			
			ТекМассив = СтруктураЗадачи.Предшественники;
			
		КонецЕсли;
		
		ТекМассив.Добавить(ВыборкаПредшественников.КодСДРПредшественника);		
		
		Если НЕ ВыборкаПредшественников.ТипСвязи = Перечисления.упоТипСвязи.ОкончаниеНачало Тогда
			
			ТекМассив.Добавить(ПолучитьСтрокуПоТипуСвязи(ВыборкаПредшественников.ТипСвязи));
			
		КонецЕсли;
		
		Если НЕ ВыборкаПредшественников.Задержка = 0 Тогда
			ТекМассив.Добавить("(");
			ТекМассив.Добавить(Формат(ВыборкаПредшественников.Задержка, "ЧГ="));
			ТекМассив.Добавить(")");
		КонецЕсли;
		
		ТекМассив.Добавить(";");
		ТекМассив.Добавить(" ");	
		
		СоответствиеПредшественников.Вставить(ВыборкаПредшественников.Зеркало, СтруктураЗадачи);
		
	КонецЦикла;	
	
	Возврат СоответствиеПредшественников;

КонецФункции 

// Возвращает значение показателя для списка проектов.
//
// Параметры:
//  Показатель				 - СправочникСсылка.упоПоказателиПроектов	 - Показатель.
//  МассивПроектовИЗадач	 - 											 - Массив (СправочникСсылка.Проекты) - список проектов.
//  РасчетВДокументе		 - 											 - Признак вызова функции из документа "упоРегистрацияПоказателейПроекта" - Булево.
//  Ошибки					 - Неопределено, Соответствие				 - ошибки получения показателя.
//  СтруктураДопПараметров	 - Структура
// 
// Возвращаемое значение:
//  Соответствие - :
//  * Ключ - СправочникСсылка.Проекты
//  * Значение - Произвольный, Неопределено - Значение показателя, Неопределено когда значения нет.
//
Функция ПолучитьЗначенияПоказателяДляСпискаПроектов(Показатель, МассивПроектовИЗадач, РасчетВДокументе = Ложь, Ошибки = Неопределено, СтруктураДопПараметров = Неопределено) Экспорт
	
	ЗначенияПоказателяПроектов = Новый Соответствие;
	Если Ошибки = Неопределено Тогда
		Ошибки = Новый Соответствие;		
	КонецЕсли;	
	
	ТекстОшибки = "";
	Если Не ЗначениеЗаполнено(Показатель) ИЛИ Не ЗначениеЗаполнено(МассивПроектовИЗадач) Тогда
		ТекстОшибкиЗаполнения = НСтр("ru = 'Не указан список проектов или показатель'");
		ТекстОшибки = ТекстОшибки + ТекстОшибкиЗаполнения + Символы.ПС;
		Возврат ЗначенияПоказателяПроектов;
	КонецЕсли;
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить(Показатель);
	
	ЗначенияПоказателейПроектов = ПолучитьЗначенияПоказателей(МассивПоказателей, МассивПроектовИЗадач, РасчетВДокументе,
		СтруктураДопПараметров);
		
	ВозвращаемыеЗначения = Новый Соответствие;	
	Для Каждого Проект Из МассивПроектовИЗадач Цикл
		ВозвращаемыеЗначения.Вставить(Проект, ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроектов, Показатель, Проект));	
	КонецЦикла;
	
	Возврат ВозвращаемыеЗначения;
		
КонецФункции

// Сообщает пользователю ошибки получения показателя для списка проектов.
//
// Параметры:
//  Показатель  - СправочникСсылка.упоПоказателиПроектов - показатель, получение которого привело к ошибкам.
//  Ошибки  - Соответствие:
//			* Ключ - СправочникСсылка.Проект - проект или проектная задача, для показателя которой получена ошибка.
//			* Значение - Строка - описание ошибки.
//
Процедура СообщитьОшибкиПолученияПоказателяДляСпискаПроектов(Показатель, Ошибки) Экспорт

	Если Ошибки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Ошибки.Количество() > 0 Тогда
		МассивОшибок = Новый Массив;
		МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При получении показателя ""%1"" для следующих задач произошли ошибки:'"),
			Показатель)); 
		Для Каждого Ошибка Из Ошибки Цикл
			МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("""%1"" :  %2", 
				Ошибка.Ключ, Ошибка.Значение));
		КонецЦикла;			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;	

КонецПроцедуры // ()

// Получить массив показателей по типу проекта
//
// Параметры:
//  ТипПроекта	 - СправочникСсылка.упоТипыПроектов	 - Тип проекта
// 
// Возвращаемое значение:
//  МассивПоказателей - Массив показателей
//
Функция ПолучитьМассивПоказателейПоТипуПроекта(ТипПроекта) Экспорт
	
	МассивПоказателей = Новый Массив;
	
	Если ТипПроекта = Справочники.упоТипыПроектов.Продажа Тогда
		МассивПоказателей.Добавить(Справочники.упоПоказателиПроектов.ВероятностьПродажи);	
		МассивПоказателей.Добавить(Справочники.упоПоказателиПроектов.ДатаПродажиПрогноз);	
		МассивПоказателей.Добавить(Справочники.упоПоказателиПроектов.СуммаДоговораПрогноз);	
		МассивПоказателей.Добавить(Справочники.упоПоказателиПроектов.СуммаДоговораФакт);	
	КонецЕсли;
	
	Возврат МассивПоказателей;
	
КонецФункции

// Получить текущую дату для показателей ФОТ
// 
// Возвращаемое значение:
//  Дата - Текущая дата для показателей ФОТ
//
Функция ПолучитьТекДатуДляПоказателейФОТ() Экспорт 
	
	ТекДата = Константы.упоТекущаяДата.Получить();
	Если Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ТекДата;
	
КонецФункции 

// Возвращает значения показателей проектов.
//
// Параметры:
//  Показатели	 - Массив, Соответствие	 - Список показателей проекта. Если тип параметра Показатели - соответствие тогда
//  	Соответствие - Список проектов и значений показателей.
//  	* Ключ - СправочникСсылка.Проекты - Ссылка на проект.
//  	* Значение - Соответствие - Список значений показателей.
//  	** Ключ -	СправочникСсылка.упоПоказателиПроектов - Ссылка на показатель.
//  	** Значение - Соответствие - Список идентификаторов параметров показателя.
//  	*** Ключ - Число - Идентификатор параметра показателя.
//  	*** Значение - Соответствие - Значение показателя.
//  Проекты					 - Массив	 - Список проектов.
//  РасчетВДокументе		 - Булево	 - Признак вызова функции из документа "упоРегистрацияПоказателейПроекта".
//  СтруктураДопПараметров	 - Структура - Параметры запроса получения данных по индикаторам.
//  ФорматироватьРезультат	 - Булево	 - Применить форматирование к полученным значениям показателей.
// 
// Возвращаемое значение:
//  Соответствие - Список проектов и значений показателей.
//  * Ключ - СправочникСсылка.Проекты - Ссылка на проект.
//  * Значение - Соответствие - Список значений показателей.
//  ** Ключ -	СправочникСсылка.упоПоказателиПроектов - Ссылка на показатель.
//  ** Значение - Произвольный - Значение показателя.
//
Функция ПолучитьЗначенияПоказателей(Показатели, 
			Проекты, 
			РасчетВДокументе = Ложь, 
			СтруктураДопПараметров = Неопределено,
			ФорматироватьРезультат = Ложь) Экспорт

	Если Проекты.Количество() = 0 Или Показатели.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	МасПоказателей = Новый Массив;
	ПоказателиСПараметрами = Неопределено;
	Если ТипЗнч(Показатели) = Тип("Соответствие") Тогда	
		Для Каждого Показатель Из Показатели Цикл
			МасПоказателей.Добавить(Показатель.Ключ);	
		КонецЦикла;
		ПоказателиСПараметрами = Показатели;
	Иначе		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МасПоказателей, Показатели, Истина);	
	КонецЕсли;	
		
	// Получим основные данные по показателям.
	Запрос = Новый Запрос;	
	Запрос.Текст = ПолучитьТекстЗапросаКПроектамИПоказателям();	
	Запрос.УстановитьПараметр("Проекты", Проекты);
	Запрос.УстановитьПараметр("Показатели", МасПоказателей);
	Запрос.УстановитьПараметр("ВидЗаполненияАвтоматически", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЗаполненияИндикатора.Автоматически"));
	Запрос.УстановитьПараметр("ВидЗаполненияАвтоматическиВДокументе",
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЗаполненияИндикатора.АвтоматическиВДокументе"));
	Запрос.УстановитьПараметр("РасчетВДокументе", РасчетВДокументе);
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();	
	
	ДанныеПоПоказателям = ПакетЗапроса[3].Выгрузить();
	ДанныеПоПоказателям.Индексы.Добавить("Показатель");
	
	// Заполним значения по умолчанию для списка полей.
	СписокПолейИзначальный = Новый ТаблицаЗначений;
	СписокПолейИзначальный.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.упоПоказателиПроектов"));
	СписокПолейИзначальный.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	СписокПолейИзначальный.Колонки.Добавить("ЗначениеПоУмолчанию");
	СписокПолейИзначальный.Индексы.Добавить("Показатель");
	Для Каждого Элем Из МасПоказателей Цикл
		Если ЗначениеЗаполнено(Элем) Тогда
			ИмяПоказателя = упоПанельПоказателейВызовСервера.ПолучитьИмяПоказателя(Элем);			
			Строка = СписокПолейИзначальный.Добавить();
			Строка.Показатель = Элем;
			Строка.Представление = ИмяПоказателя;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из СписокПолейИзначальный Цикл
		НайденнаяСтрока = ДанныеПоПоказателям.Найти(Строка.Показатель, "Показатель");
		Если НайденнаяСтрока <> Неопределено Тогда
			Строка.ЗначениеПоУмолчанию = ТипизацияНезаполненногоПоказателя(НайденнаяСтрока.ТипИндикатора);
		Иначе
			Строка.ЗначениеПоУмолчанию = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	ЕстьПоказателиСПараметрами = ПоказателиСПараметрами <> Неопределено;
	Если ЕстьПоказателиСПараметрами Тогда
		ЗаполнитьТабДанныеПоПоказателямПараметрами(ДанныеПоПоказателям, ПоказателиСПараметрами);		
	КонецЕсли;	
	
	ФормульныеПоказатели = ПакетЗапроса[1].Выгрузить();
	ДанныеПоВсемПоказателям = ПакетЗапроса[4].Выгрузить();  // Для расчета формул.
	ДанныеПоВсемПоказателям.Индексы.Добавить("Показатель");
	РасчетныеИндикаторыПоказателей = ПакетЗапроса[5].Выгрузить();
	РасчетныеИндикаторыПоказателей.Индексы.Добавить("Показатель");
	
	// Получим формулы.
	ПоляФормульныхПоказателей = Новый Структура;	
	ПоказателиИзФормульныхПоказателей = Новый СписокЗначений;				
	ДополнитьПоказателямиИзФормул(ФормульныеПоказатели, ДанныеПоПоказателям, 
		ДанныеПоВсемПоказателям, РасчетныеИндикаторыПоказателей, РасчетВДокументе, ПоляФормульныхПоказателей,
		ПоказателиИзФормульныхПоказателей);	
		
	ЗаполнитьПредставлениеВЗаданнойТаблице(ФормульныеПоказатели);	
	ЗаполнитьПредставлениеВЗаданнойТаблице(ДанныеПоПоказателям);
		
	ЕстьПроектныеЗадачи = Не ПакетЗапроса[7].Пустой();
	ЕстьПроекты = Не ПакетЗапроса[8].Пустой();
	
	ДопПараметры = Новый Структура;
	РучныеПоказатели = Новый Массив;
	
	ТекстЗапроса = ПолучитьТекстЗапросаПолученияЗначений(ДанныеПоПоказателям, ДопПараметры, РучныеПоказатели, ЕстьПроекты,
		ЕстьПроектныеЗадачи, РасчетВДокументе, ЕстьПоказателиСПараметрами);
		
	Запрос = Новый Запрос;	
	Запрос.Текст = ТекстЗапроса;	
	ТекДата = упоПоказателиПроектовСервер.ПолучитьТекДатуДляПоказателейФОТ();
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("ТекДатаСеанса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Проекты", Проекты);
	Запрос.УстановитьПараметр("Показатели", ДанныеПоПоказателям.ВыгрузитьКолонку("Показатель"));
	Запрос.УстановитьПараметр("РучныеИндикаторы", РучныеПоказатели);
	
	Для Каждого ДопПараметр Из ДопПараметры Цикл
		Запрос.УстановитьПараметр(ДопПараметр.Ключ, ДопПараметр.Значение);
	КонецЦикла;
	
	Если СтруктураДопПараметров <> Неопределено Тогда
		Для Каждого КлючЗначение Из СтруктураДопПараметров Цикл
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);		
		КонецЦикла;				
	КонецЕсли;
		
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Добавим если нужно Предшественников в ПоказателиИзФормульныхПоказателей.	
	СписокПредшественников = ЗаполнитьСписокПредшественниками(СписокПолейИзначальный, ПоказателиИзФормульныхПоказателей);
	
	ТаблицаПоказателейИндикаторов = ПолучитьПустуюТаблицуПоказателейИндикаторов(ДанныеПоПоказателям, ЕстьПоказателиСПараметрами,
		ПоказателиИзФормульныхПоказателей);	
	
	ЗаполнитьИзВыборкиТаблицуПоказателейИндикаторов(Выборка, ТаблицаПоказателейИндикаторов,
		ПоказателиИзФормульныхПоказателей, ЕстьПоказателиСПараметрами);
	
	упоПанельПоказателейВызовСервера.ЗаполнитьПоказателиПредшественниковВТаблицеПоказателей(ТаблицаПоказателейИндикаторов,
		ПоказателиИзФормульныхПоказателей);	
	
	ТаблицаПоказателейИндикаторов = ПосчитатьФормульныеПоказатели(ТаблицаПоказателейИндикаторов, ПоляФормульныхПоказателей,
		СписокПредшественников, ФормульныеПоказатели);	
		
	Возврат ПолучитьДанныеИзВыборки(Выборка, ДанныеПоПоказателям, ФорматироватьРезультат, ЕстьПоказателиСПараметрами,
		ТаблицаПоказателейИндикаторов, СписокПолейИзначальный);
		
КонецФункции	

// Возвращает значение показателя проекта.
//
// Параметры:
//  ЗначенияПоказателейПроектов	 - Соответствие			 - Список показателей проекта, см. возвращаемое значение ПолучитьЗначенияПоказателей(...).
//  Показатель					 - СправочникСсылка.упоПоказателиПроектов	 - Показатель.
//  Проект						 - СправочникСсылка.Проекты					 - Проект.
//  ИдентификаторПараметра		 - Число									 - Идентификатор параметра показателя.
// 
// Возвращаемое значение:
//  Произвольный
//
Функция ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейПроектов, Показатель, Проект, ИдентификаторПараметра = Неопределено) Экспорт
	
	ПоказательПроекта = ЗначенияПоказателейПроектов.Получить(Проект);	
	
	Если ПоказательПроекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ИдентификаторПараметра <> Неопределено Тогда
		
		ДанныеПоПоказателюСНомерами = ПоказательПроекта.Получить(Показатель);
		
		Если ДанныеПоПоказателюСНомерами = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЗначенияПоказателяСНомеромПараметров = ДанныеПоПоказателюСНомерами.Получить(ИдентификаторПараметра);
		
		Если ЗначенияПоказателяСНомеромПараметров = Неопределено Тогда
			Возврат ДанныеПоПоказателюСНомерами.Получить(0);
		КонецЕсли;		
		
		Возврат ЗначенияПоказателяСНомеромПараметров;
		
	Иначе	
		
		Возврат ПоказательПроекта.Получить(Показатель);	
		
	КонецЕсли;
	
КонецФункции

// Добавляет в текст запроса отборы по отмененным задачам для регистров с плановыми данными.
//
// Параметры:
//  ТекстЗапроса	- Строка - Исходный текст запроса
// 
// Возвращаемое значение:
//  Строка - Модифицированный текст запроса.
//
Функция ДобавитьПроверкуОтмененныхЗадачВТекстЗапроса(ТекстЗапроса) Экспорт
	
	РегистрыПлановыхДанных = 				РегистрыПлановыхДанных();	
	РегистрыПлановыхДанныхТекущаяВерсия = 	РегистрыПлановыхДанныхТекущаяВерсия();
	
	СхемаЗапроса = Новый СхемаЗапроса;	
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
			
	Для Каждого ПакетЗапроса ИЗ СхемаЗапроса.ПакетЗапросов Цикл
		 ОбработатьОператорыСхемыЗапроса(ПакетЗапроса.Операторы, 
		 	РегистрыПлановыхДанных, РегистрыПлановыхДанныхТекущаяВерсия);	
	КонецЦикла;	
		
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипизацияНезаполненногоПоказателя(ТипПоказателя)
	
	Результат = Неопределено;
	
	Если ТипПоказателя = Перечисления.упоТипИндикатора.Число Тогда
		Результат = 0;
	ИначеЕсли ТипПоказателя = Перечисления.упоТипИндикатора.Дата Тогда
		Результат = Дата(1,1,1);
	ИначеЕсли ТипПоказателя = Перечисления.упоТипИндикатора.Булево Тогда
		Результат = Ложь;
	ИначеЕсли ТипПоказателя = Перечисления.упоТипИндикатора.Строка Тогда	
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьСтрокуПоТипуСвязи(ТипСвязи)
		
	лТипСвязи = "ОН";
	Если ТипСвязи = ПредопределенноеЗначение("Перечисление.упоТипСвязи.НачалоНачало") Тогда
		лТипСвязи = "НН";
	ИначеЕсли ТипСвязи = ПредопределенноеЗначение("Перечисление.упоТипСвязи.НачалоОкончание") Тогда
		лТипСвязи = "НО";
	ИначеЕсли ТипСвязи = ПредопределенноеЗначение("Перечисление.упоТипСвязи.ОкончаниеОкончание") Тогда
		лТипСвязи = "ОО";
	КонецЕсли;
	
	Возврат лТипСвязи;
	
КонецФункции

Процедура ЗаполнитьКартинкиПоказателя(ПоказательОбъект)
	
	ТЧСостояния = ПоказательОбъект.Состояния;
	ТЧСостояния.Очистить();
	
	Если ПоказательОбъект.Ссылка = ПредопределенноеЗначение("Справочник.упоПоказателиПроектов.FreezeDate") Тогда
		
		ПоказательОбъект.КартинкаПоУмолчанию = 62;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 1;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.Оформление = 0;
		
	ИначеЕсли ПоказательОбъект.Ссылка = ПредопределенноеЗначение("Справочник.упоПоказателиПроектов.Get") 
		ИЛИ ПоказательОбъект.Ссылка = ПредопределенноеЗначение("Справочник.упоПоказателиПроектов.Go") Тогда
		
		ПоказательОбъект.КартинкаПоУмолчанию = 1;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 1;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.Оформление = 0;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 0;
		СтрокаСостояние.ЗначениеПо = 50;
		СтрокаСостояние.Оформление = 3;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 50;
		СтрокаСостояние.ЗначениеПо = 80;
		СтрокаСостояние.Оформление = 2;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 80;
		СтрокаСостояние.ЗначениеПо = 90;
		СтрокаСостояние.Оформление = 4;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 90;
		СтрокаСостояние.ЗначениеПо = 100;
		СтрокаСостояние.Оформление = 1;
		
	ИначеЕсли ПоказательОбъект.Ссылка = ПредопределенноеЗначение("Справочник.упоПоказателиПроектов.Freeze") Тогда	
		
		ПоказательОбъект.КартинкаПоУмолчанию = 1;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 1;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.Оформление = 0;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 0;
		СтрокаСостояние.ЗначениеПо = 50;
		СтрокаСостояние.Оформление = 1 ;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 50;
		СтрокаСостояние.ЗначениеПо = 80;
		СтрокаСостояние.Оформление = 4;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 80;
		СтрокаСостояние.ЗначениеПо = 90;
		СтрокаСостояние.Оформление = 2;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 90;
		СтрокаСостояние.ЗначениеПо = 100;
		СтрокаСостояние.Оформление = 3;
		
	ИначеЕсли ПоказательОбъект.Ссылка = ПредопределенноеЗначение("Справочник.упоПоказателиПроектов.КоэффициентСложности") Тогда	
	
		ПоказательОбъект.КартинкаПоУмолчанию = 22;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 1;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.Оформление = 0;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 0;
		СтрокаСостояние.ЗначениеПо = 50;
		СтрокаСостояние.Оформление = 22 ;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 50;
		СтрокаСостояние.ЗначениеПо = 80;
		СтрокаСостояние.Оформление = 21;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 80;
		СтрокаСостояние.ЗначениеПо = 90;
		СтрокаСостояние.Оформление = 24;
		
		СтрокаСостояние = ТЧСостояния.Добавить();
		СтрокаСостояние.ВидСравнения = 10;
		СтрокаСостояние.Значение = 0;
		СтрокаСостояние.ЗначениеС = 90;
		СтрокаСостояние.ЗначениеПо = 100;
		СтрокаСостояние.Оформление = 23;
		
	КонецЕсли;	

КонецПроцедуры

#Область РасчетЗначенийПоказателейПроектов

Функция ЗаполнитьСписокПредшественниками(СписокПолейИзначальный, ПоказателиИзФормульныхПоказателей)
	
	СписокПредшественников = Новый СписокЗначений;
	
	Предшественники = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоПоказателиПроектов.Предшественники");
	ВнешПредшественники = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоПоказателиПроектов.ВнешниеПредшественники");	
	
	ЭлементСпискаПред = СписокПолейИзначальный.Найти(Предшественники, "Показатель");
	Если ЭлементСпискаПред <> Неопределено Тогда
		Если ПоказателиИзФормульныхПоказателей.НайтиПоЗначению(Предшественники) = Неопределено Тогда
			ПоказателиИзФормульныхПоказателей.Добавить(ЭлементСпискаПред.Показатель, ЭлементСпискаПред.Представление);
		КонецЕсли;
		СписокПредшественников.Добавить(ЭлементСпискаПред.Показатель, ЭлементСпискаПред.Представление);
	КонецЕсли;
	
	ЭлементСпискаПред = СписокПолейИзначальный.Найти(ВнешПредшественники, "Показатель");
	Если ЭлементСпискаПред <> Неопределено Тогда
		Если ПоказателиИзФормульныхПоказателей.НайтиПоЗначению(ВнешПредшественники) = Неопределено Тогда
			ПоказателиИзФормульныхПоказателей.Добавить(ЭлементСпискаПред.Показатель, ЭлементСпискаПред.Представление);
		КонецЕсли;
		СписокПредшественников.Добавить(ЭлементСпискаПред.Показатель, ЭлементСпискаПред.Представление);
	КонецЕсли;	
	
	Возврат СписокПредшественников;
	
КонецФункции

Процедура ЗаполнитьПредставлениеВЗаданнойТаблице(Таблица)
	
	Таблица.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Для Каждого Строка Из Таблица Цикл
		Строка.Представление = упоПанельПоказателейВызовСервера.ПолучитьИмяПоказателя(Строка.Показатель);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабДанныеПоПоказателямПараметрами(ДанныеПоПоказателям, ПоказателиСПараметрами)
	
	ДанныеПоПоказателям.Колонки.Добавить("ИдентификаторПараметров", Новый ОписаниеТипов("Число"));
	ДанныеПоПоказателям.Колонки.Добавить("Параметры");
	
	Для Каждого Показатель Из ПоказателиСПараметрами Цикл
		
		Если Показатель.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Строка = ДанныеПоПоказателям.Найти(Показатель.Ключ, "Показатель"); 
		
		Если Строка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПервыйПроход = Истина;			
		Для Каждого ПараметрПоказателя Из Показатель.Значение Цикл
			Если ПервыйПроход Тогда
				ПервыйПроход = Ложь;
				НовСтрока = Строка;
			Иначе
				НовСтрока = ДанныеПоПоказателям.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
			КонецЕсли;
			НовСтрока.ИдентификаторПараметров = ПараметрПоказателя.Ключ;
			НовСтрока.Параметры = ПараметрПоказателя.Значение;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьФорматированноеЗначение(СтрокаВыборки, ДанныеПоПоказателям, ФорматироватьРезультат, ЗначениеПоУмолчанию)

	Если СтрокаВыборки.Значение = Неопределено Или СтрокаВыборки.Значение = Null Тогда
		Значение = ЗначениеПоУмолчанию;
	Иначе
		Значение = СтрокаВыборки.Значение;
	КонецЕсли;	
		
	Если ФорматироватьРезультат Тогда
		ФорматнаяСтрока = "";		
		ДанныеПоказателя = ДанныеПоПоказателям.Найти(СтрокаВыборки.Показатель, "Показатель"); 
		Если ДанныеПоказателя <> Неопределено Тогда
			ФорматнаяСтрока = ДанныеПоказателя.ФорматнаяСтрока;				
		КонецЕсли;
		Значение = Формат(Значение, ФорматнаяСтрока);	
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьЗначение(Отбор, ТаблицаПоказателейИндикаторов, Выборка, ДанныеПоПоказателям, ФорматироватьРезультат, ЗначениеПоУмолчанию)

	НайденныеСтроки = ТаблицаПоказателейИндикаторов.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		Значение = ПолучитьФорматированноеЗначение(НайденныеСтроки[0], ДанныеПоПоказателям, ФорматироватьРезультат,
		ЗначениеПоУмолчанию);
	Иначе
		Значение = ПолучитьФорматированноеЗначение(Выборка, ДанныеПоПоказателям, ФорматироватьРезультат, 
		ЗначениеПоУмолчанию);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьДанныеИзВыборки(ВыборкаПроекты, ДанныеПоПоказателям, ФорматироватьРезультат, ЕстьПоказателиСПараметрами,
		ТаблицаПоказателейИндикаторов, СписокПолейИзначальный)

	Если ЕстьПоказателиСПараметрами Тогда
		Отбор = Новый Структура("Проект, Показатель, ИдентификаторПараметров");
	Иначе
		Отбор = Новый Структура("Проект, Показатель");
	КонецЕсли;
	СоответствиеПроектов = Новый Соответствие;
	Пока ВыборкаПроекты.Следующий() Цикл
		СоответствиеПоказателей = Новый Соответствие;
		Если ЕстьПоказателиСПараметрами Тогда			
			ВыборкаПоказатели = ВыборкаПроекты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
			Пока ВыборкаПоказатели.Следующий() Цикл			
				
				Показатель = СписокПолейИзначальный.Найти(ВыборкаПоказатели.Показатель, "Показатель");
				Если Показатель = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СоответствиеИдентификатораИЗначения = Новый Соответствие;
				Выборка = ВыборкаПоказатели.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Отбор.Проект = Выборка.Проект;
					Отбор.Показатель = Выборка.Показатель;
					Отбор.ИдентификаторПараметров = Выборка.ИдентификаторПараметров;
					Значение = ПолучитьЗначение(Отбор, ТаблицаПоказателейИндикаторов, Выборка, ДанныеПоПоказателям,
						ФорматироватьРезультат, Показатель.ЗначениеПоУмолчанию);
					СоответствиеИдентификатораИЗначения.Вставить(Выборка.ИдентификаторПараметров, Значение);
					
				КонецЦикла;
				
				СоответствиеПоказателей.Вставить(ВыборкаПоказатели.Показатель, СоответствиеИдентификатораИЗначения);
				
			КонецЦикла;			
		Иначе	
			ВыборкаПоказатели = ВыборкаПроекты.Выбрать();
			Пока ВыборкаПоказатели.Следующий() Цикл
				
				Показатель = СписокПолейИзначальный.Найти(ВыборкаПоказатели.Показатель, "Показатель");
				Если Показатель = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор.Проект = ВыборкаПоказатели.Проект;
				Отбор.Показатель = ВыборкаПоказатели.Показатель;
				Значение = ПолучитьЗначение(Отбор, ТаблицаПоказателейИндикаторов, ВыборкаПоказатели, ДанныеПоПоказателям,
					ФорматироватьРезультат, Показатель.ЗначениеПоУмолчанию);
							
				СоответствиеПоказателей.Вставить(ВыборкаПоказатели.Показатель, Значение);
				
			КонецЦикла;
		КонецЕсли;
		
		СоответствиеПроектов.Вставить(ВыборкаПроекты.Проект, СоответствиеПоказателей);
		
	КонецЦикла;
	
	Возврат СоответствиеПроектов;
	
КонецФункции

Функция ПолучитьТекстЗапросаКПроектамИПоказателям()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоПоказателиПроектов.Ссылка КАК Показатель,
	        |	упоПоказателиПроектов.Наименование КАК Наименование,
	        |	упоПоказателиПроектов.ИмяПоляЗначения КАК ИмяПоляЗначения,
	        |	упоПоказателиПроектов.ИмяПоляЗначенияПЗ КАК ИмяПоляЗначенияПЗ,
	        |	упоПоказателиПроектов.ИмяПоляОбъекта КАК ИмяПоляОбъекта,
	        |	упоПоказателиПроектов.ИмяПоляОбъектаПЗ КАК ИмяПоляОбъектаПЗ,
	        |	упоПоказателиПроектов.ПараметрыЗапроса КАК ПараметрыЗапроса,
	        |	упоПоказателиПроектов.ПараметрыЗапросаПЗ КАК ПараметрыЗапросаПЗ,
	        |	упоПоказателиПроектов.ПолноеНаименование КАК ПолноеНаименование,
	        |	упоПоказателиПроектов.ТекстЗапроса КАК ТекстЗапроса,
	        |	упоПоказателиПроектов.ТекстЗапросаПЗ КАК ТекстЗапросаПЗ,
	        |	упоПоказателиПроектов.ТипЗаполнения КАК ТипЗаполнения,
	        |	упоПоказателиПроектов.ВидЗаполнения КАК ВидЗаполнения,
	        |	упоПоказателиПроектов.строкаФормулы КАК строкаФормулы,
	        |	упоПоказателиПроектов.ПринадлежностьПоказателя КАК ПринадлежностьПоказателя,
	        |	упоПоказателиПроектов.ТипИндикатора КАК ТипИндикатора,
	        |	упоПоказателиПроектов.ФорматнаяСтрока КАК ФорматнаяСтрока,
	        |	упоПоказателиПроектов.ТипСсылки КАК ТипСсылки
	        |ПОМЕСТИТЬ ДанныеПоПоказателям
	        |ИЗ
	        |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	        |ГДЕ
	        |	упоПоказателиПроектов.Ссылка В(&Показатели)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПоПоказателям.Показатель КАК Показатель,
	        |	ДанныеПоПоказателям.Наименование КАК Наименование,
	        |	ДанныеПоПоказателям.ИмяПоляЗначения КАК ИмяПоляЗначения,
	        |	ДанныеПоПоказателям.ИмяПоляЗначенияПЗ КАК ИмяПоляЗначенияПЗ,
	        |	ДанныеПоПоказателям.ИмяПоляОбъекта КАК ИмяПоляОбъекта,
	        |	ДанныеПоПоказателям.ИмяПоляОбъектаПЗ КАК ИмяПоляОбъектаПЗ,
	        |	ДанныеПоПоказателям.ПараметрыЗапроса КАК ПараметрыЗапроса,
	        |	ДанныеПоПоказателям.ПараметрыЗапросаПЗ КАК ПараметрыЗапросаПЗ,
	        |	ДанныеПоПоказателям.ПолноеНаименование КАК ПолноеНаименование,
	        |	ДанныеПоПоказателям.ТекстЗапроса КАК ТекстЗапроса,
	        |	ДанныеПоПоказателям.ТекстЗапросаПЗ КАК ТекстЗапросаПЗ,
	        |	ДанныеПоПоказателям.ТипЗаполнения КАК ТипЗаполнения,
	        |	ДанныеПоПоказателям.ВидЗаполнения КАК ВидЗаполнения,
	        |	ДанныеПоПоказателям.строкаФормулы КАК строкаФормулы,
	        |	ДанныеПоПоказателям.ПринадлежностьПоказателя КАК ПринадлежностьПоказателя,
	        |	ДанныеПоПоказателям.ТипИндикатора КАК ТипИндикатора,
	        |	ДанныеПоПоказателям.ФорматнаяСтрока КАК ФорматнаяСтрока,
	        |	ДанныеПоПоказателям.ТипСсылки КАК ТипСсылки
	        |ИЗ
	        |	ДанныеПоПоказателям КАК ДанныеПоПоказателям
	        |ГДЕ
	        |	(ДанныеПоПоказателям.ВидЗаполнения = &ВидЗаполненияАвтоматически
	        |			ИЛИ ДанныеПоПоказателям.ВидЗаполнения = &ВидЗаполненияАвтоматическиВДокументе
	        |				И &РасчетВДокументе)
	        |	И ДанныеПоПоказателям.ТипЗаполнения = 1
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПоПоказателям.Показатель) КАК Показатель
	        |ПОМЕСТИТЬ КоличествоФормульныхПоказателей
	        |ИЗ
	        |	ДанныеПоПоказателям КАК ДанныеПоПоказателям
	        |ГДЕ
	        |	(ДанныеПоПоказателям.ВидЗаполнения = &ВидЗаполненияАвтоматически
	        |			ИЛИ ДанныеПоПоказателям.ВидЗаполнения = &ВидЗаполненияАвтоматическиВДокументе
	        |				И &РасчетВДокументе)
	        |	И ДанныеПоПоказателям.ТипЗаполнения = 1
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДанныеПоПоказателям.Показатель КАК Показатель,
	        |	ДанныеПоПоказателям.Наименование КАК Наименование,
	        |	ДанныеПоПоказателям.ИмяПоляЗначения КАК ИмяПоляЗначения,
	        |	ДанныеПоПоказателям.ИмяПоляЗначенияПЗ КАК ИмяПоляЗначенияПЗ,
	        |	ДанныеПоПоказателям.ИмяПоляОбъекта КАК ИмяПоляОбъекта,
	        |	ДанныеПоПоказателям.ИмяПоляОбъектаПЗ КАК ИмяПоляОбъектаПЗ,
	        |	ДанныеПоПоказателям.ПараметрыЗапроса КАК ПараметрыЗапроса,
	        |	ДанныеПоПоказателям.ПараметрыЗапросаПЗ КАК ПараметрыЗапросаПЗ,
	        |	ДанныеПоПоказателям.ПолноеНаименование КАК ПолноеНаименование,
	        |	ДанныеПоПоказателям.ТекстЗапроса КАК ТекстЗапроса,
	        |	ДанныеПоПоказателям.ТекстЗапросаПЗ КАК ТекстЗапросаПЗ,
	        |	ДанныеПоПоказателям.ТипЗаполнения КАК ТипЗаполнения,
	        |	ДанныеПоПоказателям.ВидЗаполнения КАК ВидЗаполнения,
	        |	ДанныеПоПоказателям.строкаФормулы КАК строкаФормулы,
	        |	ДанныеПоПоказателям.ПринадлежностьПоказателя КАК ПринадлежностьПоказателя,
	        |	ДанныеПоПоказателям.ТипИндикатора КАК ТипИндикатора,
	        |	ДанныеПоПоказателям.ФорматнаяСтрока КАК ФорматнаяСтрока,
	        |	ДанныеПоПоказателям.ТипСсылки КАК ТипСсылки
	        |ИЗ
	        |	ДанныеПоПоказателям КАК ДанныеПоПоказателям
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоПоказателиПроектов.Ссылка КАК Показатель,
	        |	упоПоказателиПроектов.Наименование КАК Наименование,
	        |	упоПоказателиПроектов.ИмяПоляЗначения КАК ИмяПоляЗначения,
	        |	упоПоказателиПроектов.ИмяПоляЗначенияПЗ КАК ИмяПоляЗначенияПЗ,
	        |	упоПоказателиПроектов.ИмяПоляОбъекта КАК ИмяПоляОбъекта,
	        |	упоПоказателиПроектов.ИмяПоляОбъектаПЗ КАК ИмяПоляОбъектаПЗ,
	        |	упоПоказателиПроектов.ПараметрыЗапроса КАК ПараметрыЗапроса,
	        |	упоПоказателиПроектов.ПараметрыЗапросаПЗ КАК ПараметрыЗапросаПЗ,
	        |	упоПоказателиПроектов.ПолноеНаименование КАК ПолноеНаименование,
	        |	упоПоказателиПроектов.ТекстЗапроса КАК ТекстЗапроса,
	        |	упоПоказателиПроектов.ТекстЗапросаПЗ КАК ТекстЗапросаПЗ,
	        |	упоПоказателиПроектов.ТипЗаполнения КАК ТипЗаполнения,
	        |	упоПоказателиПроектов.ВидЗаполнения КАК ВидЗаполнения,
	        |	упоПоказателиПроектов.строкаФормулы КАК строкаФормулы,
	        |	упоПоказателиПроектов.ПринадлежностьПоказателя КАК ПринадлежностьПоказателя,
	        |	упоПоказателиПроектов.ТипИндикатора КАК ТипИндикатора,
	        |	упоПоказателиПроектов.ФорматнаяСтрока КАК ФорматнаяСтрока,
	        |	упоПоказателиПроектов.ТипСсылки КАК ТипСсылки
	        |ИЗ
	        |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоФормульныхПоказателей КАК КоличествоФормульныхПоказателей
	        |		ПО (КоличествоФормульныхПоказателей.Показатель <> 0)
	        |			И (НЕ упоПоказателиПроектов.ЭтоГруппа)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоПоказателиПроектовРасчетныеИндикаторы.Ссылка КАК Показатель,
	        |	упоПоказателиПроектовРасчетныеИндикаторы.Индикатор КАК Индикатор,
	        |	упоПоказателиПроектовРасчетныеИндикаторы.Представление КАК Представление
	        |ИЗ
	        |	Справочник.упоПоказателиПроектов.РасчетныеИндикаторы КАК упоПоказателиПроектовРасчетныеИндикаторы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоФормульныхПоказателей КАК КоличествоФормульныхПоказателей
	        |		ПО (КоличествоФормульныхПоказателей.Показатель <> 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	Проекты.Ссылка КАК Проект,
	        |	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача
	        |ПОМЕСТИТЬ ДанныеПоПроектам
	        |ИЗ
	        |	Справочник.Проекты КАК Проекты
	        |ГДЕ
	        |	Проекты.Ссылка В(&Проекты)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(ДанныеПоПроектам.Проект) КАК Количество
	        |ИЗ
	        |	ДанныеПоПроектам КАК ДанныеПоПроектам
	        |ГДЕ
	        |	ДанныеПоПроектам.ЭтоПроектнаяЗадача
	        |
	        |ИМЕЮЩИЕ
	        |	КОЛИЧЕСТВО(ДанныеПоПроектам.Проект) <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(ДанныеПоПроектам.Проект) КАК Количество
	        |ИЗ
	        |	ДанныеПоПроектам КАК ДанныеПоПроектам
	        |ГДЕ
	        |	НЕ ДанныеПоПроектам.ЭтоПроектнаяЗадача
	        |
	        |ИМЕЮЩИЕ
	        |	КОЛИЧЕСТВО(ДанныеПоПроектам.Проект) <> 0";		
	
КонецФункции

Процедура ДополнитьПоказателямиИзФормул(АвтоматическиеПоказателиФормула, ДанныеПоПоказателям,
		ДанныеПоВсемПоказателям, РасчетныеИндикаторыПоказателей, РасчетВДокументе, ПоляФормульныхПоказателей,
		ПоказателиИзФормульныхПоказателей)
		
	Таблицы = Новый Структура;	
	Таблицы.Вставить("ДанныеПоПоказателям", ДанныеПоПоказателям);
	Таблицы.Вставить("ДанныеПоВсемПоказателям", ДанныеПоВсемПоказателям);
	Таблицы.Вставить("РасчетныеИндикаторыПоказателей", РасчетныеИндикаторыПоказателей);
	
	Отбор = Новый Структура("Показатель");	
	Для Каждого Строка Из АвтоматическиеПоказателиФормула Цикл
		
		Отбор.Показатель = Строка.Показатель;
		НайденныеСтроки = РасчетныеИндикаторыПоказателей.НайтиСтроки(Отбор);
		
		ВложенныеПоказатели = Новый Структура;
		
		Для Каждого НСтрока Из НайденныеСтроки Цикл
			
			НайденнаяСтрока = ДанныеПоВсемПоказателям.Найти(НСтрока.Индикатор, "Показатель");
			
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДополнитьПоказателямиИзФормулРекурсивно(НайденнаяСтрока, Таблицы, РасчетВДокументе, ВложенныеПоказатели,
				НСтрока.Представление, ПоказателиИзФормульныхПоказателей);			
					
		КонецЦикла;	
		
		// Заменим в формуле представления на ИмяПоказателя.
		ФормулаЧерезИмяПоказателя = Строка.строкаФормулы;
		Для Каждого Элемент Из ВложенныеПоказатели Цикл 
			
			Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
				Продолжить;
			КонецЕсли;		
			
			Если Элемент.Значение.ФормулаЧерезИмяПоказателя = "" Тогда
				ФормулаЧерезИмяПоказателя = СтрЗаменить(ФормулаЧерезИмяПоказателя, Элемент.Значение.Представление, "т." + Элемент.Ключ);
			Иначе
				ФормулаЧерезИмяПоказателя = СтрЗаменить(ФормулаЧерезИмяПоказателя, Элемент.Значение.Представление, Элемент.Значение.ФормулаЧерезИмяПоказателя);
			КонецЕсли;
			
		КонецЦикла; 		
		
		ДанныеПоказателя = Новый Структура("Формула, ВложенныеПоказатели, ФормулаЧерезИмяПоказателя",
			Строка.строкаФормулы, ВложенныеПоказатели, ФормулаЧерезИмяПоказателя);
		ПоляФормульныхПоказателей.Вставить(упоПанельПоказателейВызовСервера.ПолучитьИмяПоказателя(Строка.Показатель), ДанныеПоказателя);			
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьПоказателямиИзФормулРекурсивно(ДанныеПоказателя, Таблицы, РасчетВДокументе,
		ПоляФормульныхПоказателей, Представление, ПоказателиИзФормульныхПоказателей)
		
	ДанныеПоПоказателям = Таблицы.ДанныеПоПоказателям;
	ДанныеПоВсемПоказателям = Таблицы.ДанныеПоВсемПоказателям;
	РасчетныеИндикаторыПоказателей = Таблицы.РасчетныеИндикаторыПоказателей;
	
	Отбор = Новый Структура("Показатель");
	
	ВложенныеПоказатели = Новый Структура;
	Если (ДанныеПоказателя.ВидЗаполнения = ОбщегоНазначения.ПредопределенныйЭлемент(
											"Перечисление.упоВидЗаполненияИндикатора.Автоматически")
		ИЛИ ДанныеПоказателя.ВидЗаполнения = ОбщегоНазначения.ПредопределенныйЭлемент(
												"Перечисление.упоВидЗаполненияИндикатора.АвтоматическиВДокументе") 
		И РасчетВДокументе) 
		И ДанныеПоказателя.ТипЗаполнения = 1 Тогда
		
		Отбор.Показатель = ДанныеПоказателя.Показатель;	
		НайденныеСтроки = РасчетныеИндикаторыПоказателей.НайтиСтроки(Отбор);
		
		Для Каждого НСтрока Из НайденныеСтроки Цикл
			
			НайденнаяСтрока = ДанныеПоВсемПоказателям.Найти(НСтрока.Индикатор, "Показатель");
			
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДополнитьПоказателямиИзФормулРекурсивно(НайденнаяСтрока, Таблицы, РасчетВДокументе, ВложенныеПоказатели,
				НСтрока.Представление, ПоказателиИзФормульныхПоказателей);
			
		КонецЦикла;
		
	Иначе
		
		ИмяПоказателя = упоПанельПоказателейВызовСервера.ПолучитьИмяПоказателя(ДанныеПоказателя.Показатель);
		ВложенныеПоказатели.Вставить(ИмяПоказателя, Представление);
		
		НайденнаяСтрока = ДанныеПоПоказателям.Найти(ДанныеПоказателя.Показатель, "Показатель");		
		Если НайденнаяСтрока = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ДанныеПоПоказателям.Добавить(), ДанныеПоказателя);			
		КонецЕсли;
		
		ЭлементФП = ПоказателиИзФормульныхПоказателей.НайтиПоЗначению(ДанныеПоказателя.Показатель);
		Если ЭлементФП = Неопределено Тогда
			ПоказателиИзФормульныхПоказателей.Добавить(ДанныеПоказателя.Показатель, ИмяПоказателя);
		КонецЕсли;
	
	КонецЕсли;	
	
	// Заменим в формуле представления на ИмяПоказателя.
	ФормулаЧерезИмяПоказателя = ДанныеПоказателя.строкаФормулы;
	Для Каждого Элемент Из ВложенныеПоказатели Цикл 
		
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;		
		
		Если Элемент.Значение.ФормулаЧерезИмяПоказателя = "" Тогда
			ФормулаЧерезИмяПоказателя = СтрЗаменить(ФормулаЧерезИмяПоказателя, Элемент.Значение.Представление, "т." + Элемент.Ключ);
		Иначе
			ФормулаЧерезИмяПоказателя = СтрЗаменить(ФормулаЧерезИмяПоказателя, Элемент.Значение.Представление, Элемент.Значение.ФормулаЧерезИмяПоказателя);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ФормулаЧерезИмяПоказателя) Тогда
		ФормулаЧерезИмяПоказателя = "(" + ФормулаЧерезИмяПоказателя + ")";
	КонецЕсли;
	
	ДанныеПоказателяСтруктура = Новый Структура("Формула, ВложенныеПоказатели, Представление, ФормулаЧерезИмяПоказателя",
		ДанныеПоказателя.строкаФормулы, ВложенныеПоказатели, Представление, ФормулаЧерезИмяПоказателя);
	ПоляФормульныхПоказателей.Вставить(упоПанельПоказателейВызовСервера.ПолучитьИмяПоказателя(ДанныеПоказателя.Показатель), ДанныеПоказателяСтруктура);
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаПолученияЗначений(ДанныеПоПоказателям, ДопПараметры, РучныеПоказатели, ЕстьПроекты,
		ЕстьПроектныеЗадачи, РасчетВДокументе, ЕстьПоказателиСПараметрами)
	
	ТекстЗапроса = "ВЫБРАТЬ 
	|	NULL КАК Показатель,
	|	NULL КАК Проект,	
	|	NULL КАК Значение%1
	|ПОМЕСТИТЬ ДанныеПоказателей
	|
	|";
		
	Для Каждого Строка Из ДанныеПоПоказателям Цикл
		
		Если Строка.Показатель = Справочники.упоПоказателиПроектов.Предшественники 
			ИЛИ Строка.Показатель = Справочники.упоПоказателиПроектов.ВнешниеПредшественники Тогда
			
			Продолжить;
			
		ИначеЕсли (Строка.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Автоматически
			ИЛИ Строка.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.АвтоматическиВДокументе И РасчетВДокументе) Тогда
			
			Если Строка.ТипЗаполнения = 0 Тогда
				
				Если Строка.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта И ЕстьПроекты Тогда
					
					упоПанельПоказателейВызовСервера.ДобавитьПоказательвТекстЗапроса(ДопПараметры, ТекстЗапроса, Строка,,
						Истина, ЕстьПоказателиСПараметрами);
					
				ИначеЕсли Строка.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи И ЕстьПроектныеЗадачи Тогда 
					
					упоПанельПоказателейВызовСервера.ДобавитьПоказательвТекстЗапроса(ДопПараметры, ТекстЗапроса, Строка, Истина,
						Истина, ЕстьПоказателиСПараметрами);
					
				ИначеЕсли Строка.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий Тогда
					
					Если ЕстьПроектныеЗадачи Тогда
						упоПанельПоказателейВызовСервера.ДобавитьПоказательвТекстЗапроса(ДопПараметры, ТекстЗапроса, Строка, Истина,
							Истина, ЕстьПоказателиСПараметрами);
					КонецЕсли;
					
					Если ЕстьПроекты Тогда
						упоПанельПоказателейВызовСервера.ДобавитьПоказательвТекстЗапроса(ДопПараметры, ТекстЗапроса, Строка,,
							Истина, ЕстьПоказателиСПараметрами);
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			РучныеПоказатели.Добавить(Строка.Показатель);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если РучныеПоказатели.Количество() <> 0 Тогда 
		ТекстЗапроса = ТекстЗапроса + 
		"ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Индикатор,
		|	Объект,
		|	ЗначениеИндикатора%1
		|ИЗ
		|	РегистрСведений.упоЗначенияИндикаторов.СрезПоследних(, Объект В (&Проекты) И Индикатор В (&РучныеИндикаторы)) КАК ЗначенияИндикаторов
		|";
	КонецЕсли;
	
	Если ЕстьПоказателиСПараметрами Тогда
		ПараметрЗамены = "," + Символы.ПС + "	NULL КАК ИдентификаторПараметров";
	Иначе	
		ПараметрЗамены = "";
	КонецЕсли;
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, ПараметрЗамены);
	
	ТекстЗапроса = ТекстЗапроса + ";" + Символы.ПС +  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Ссылка КАК Проект,
	|	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача
	|ПОМЕСТИТЬ Проекты
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Ссылка В(&Проекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоПоказателиПроектов.Ссылка КАК Показатель
	|ПОМЕСТИТЬ Показатели
	|ИЗ
	|	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	|ГДЕ
	|	упоПоказателиПроектов.Ссылка В(&Показатели)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Проекты.Проект КАК Проект,
	|	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача,
	|	Показатели.Показатель КАК Показатель
	|ПОМЕСТИТЬ ПроектыИПоказатели
	|ИЗ
	|	Проекты КАК Проекты,
	|	Показатели КАК Показатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроектыИПоказатели.Проект КАК Проект,
	|	ПроектыИПоказатели.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача,
	|	ПроектыИПоказатели.Показатель КАК Показатель,
	|	ДанныеПоказателей.Значение КАК Значение%1
	|ИЗ
	|	ПроектыИПоказатели КАК ПроектыИПоказатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоказателей КАК ДанныеПоказателей
	|		ПО ПроектыИПоказатели.Проект = ДанныеПоказателей.Проект
	|			И ПроектыИПоказатели.Показатель = ДанныеПоказателей.Показатель
	|ИТОГИ
	|	МАКСИМУМ(ЭтоПроектнаяЗадача)
	|ПО
	|	Проект%2";
	
	Если ЕстьПоказателиСПараметрами Тогда
		ПараметрЗамены = "," + Символы.ПС + "	ЕСТЬNULL(ДанныеПоказателей.ИдентификаторПараметров, 0) КАК ИдентификаторПараметров";
		ИтогиПО = "," + Символы.ПС + "	Показатель";
	Иначе	
		ПараметрЗамены = "";
		ИтогиПО = "";
	КонецЕсли;
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, ПараметрЗамены, ИтогиПО);
	
	ДобавитьПроверкуОтмененныхЗадачВТекстЗапроса(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьПустуюТаблицуПоказателейИндикаторов(ДанныеПоПоказателям, ЕстьПоказателиСПараметрами, ПоказателиИзКоторыхСоздаемТаблицу)

	ТаблицаПоказателейИндикаторов = Новый ТаблицаЗначений;
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ЭтоПроектнаяЗадача", Новый ОписаниеТипов("Булево"));
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ИдентификаторПараметров", Новый ОписаниеТипов("Число"));
	
	Для Каждого Показатель Из ПоказателиИзКоторыхСоздаемТаблицу Цикл
		
		ДанныеПоказателя = ДанныеПоПоказателям.Найти(Показатель.Значение, "Показатель");
		
		Если ДанныеПоказателя = Неопределено Или ЕстьПоказателиСПараметрами И
			ЗначениеЗаполнено(ДанныеПоказателя.ИдентификаторПараметров) И ДанныеПоказателя.ИдентификаторПараметров > 1 Тогда
			Продолжить;
		КонецЕсли;	
			
		Если ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Булево");
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Дата");
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Строка");
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
			КЧ = Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой);
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Число", КЧ);
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка Тогда	
			МассивТипов = упоПанельПоказателейКлиентСервер.ПолучитьМассивТиповПоТипуСсылки(ДанныеПоказателя.ТипСсылки);
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов(МассивТипов);			
		КонецЕсли;
		
		ТаблицаПоказателейИндикаторов.Колонки.Добавить(
			ДанныеПоказателя.Представление, ОписаниеТиповПоляПоказателя);
	КонецЦикла;
		
	Возврат ТаблицаПоказателейИндикаторов;
	
КонецФункции

Процедура ЗаполнитьИзВыборкиТаблицуПоказателейИндикаторов(ВыборкаПроекты, ТаблицаПоказателейИндикаторов, СписокПолей,
		ЕстьПоказателиСПараметрами)
		
	Если СписокПолей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Пока ВыборкаПроекты.Следующий() Цикл
			
		НоваяСтрокаПоказателейИндикаторов = ТаблицаПоказателейИндикаторов.Добавить();				
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказателейИндикаторов, ВыборкаПроекты);
		
		ВыборкаПоказателей = ВыборкаПроекты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоказателей.Следующий() Цикл
			
			ПоказательИзСписка = СписокПолей.НайтиПоЗначению(ВыборкаПоказателей.Показатель);
			
			Если ПоказательИзСписка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЕстьПоказателиСПараметрами Тогда
				
				Выборка = ВыборкаПоказателей.Выбрать();
				КоличествоПоИдентификаторам = Выборка.Количество() > 1;
				Пока Выборка.Следующий() Цикл
					
					// Делаем следующие действия из-за того, что если есть формулные показатели с параметрами, тогда нам нужно итоги
					// запроса делать не по показателям, а по идентификатору параметров, но нам нужны именно эти итоги потому, что
					// по этим итогам создается возвращаемое соответствие.
					Если КоличествоПоИдентификаторам Тогда 
						НайденныеСтроки = ТаблицаПоказателейИндикаторов.НайтиСтроки(
							Новый Структура("Проект, ИдентификаторПараметров", Выборка.Проект, Выборка.ИдентификаторПараметров));
						Если НайденныеСтроки.Количество() <> 0 Тогда
							НоваяСтрокаПоказателейИндикаторов = НайденныеСтроки[0];	
						Иначе
							НоваяСтрокаПоказателейИндикаторов = ТаблицаПоказателейИндикаторов.Добавить();				
							ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказателейИндикаторов, Выборка);	
						КонецЕсли;					
					КонецЕсли;
					
					НоваяСтрокаПоказателейИндикаторов[ПоказательИзСписка.Представление] = Выборка.Значение;
					
				КонецЦикла;
				
			Иначе
								
				НоваяСтрокаПоказателейИндикаторов[ПоказательИзСписка.Представление] = ВыборкаПоказателей.Значение;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;	
	
	ВыборкаПроекты.Сбросить();
		
КонецПроцедуры

Функция ПосчитатьФормульныеПоказатели(ТаблицаПоказателейИндикаторов, ПоляФормульныхПоказателей, СписокПредшественников,
		ФормульныеПоказатели)
		
	// Если в формуле есть агрегатные функции, то их нужно убрать.	
	АгрегатныеФункции = Новый Массив;
	АгрегатныеФункции.Добавить("СУММА(");
	АгрегатныеФункции.Добавить("МИНИМУМ(");
	АгрегатныеФункции.Добавить("МАКСИМУМ(");
	АгрегатныеФункции.Добавить("СРЕДНЕЕ(");
	АгрегатныеФункции.Добавить("КОЛИЧЕСТВО(");
	АгрегатныеФункции.Добавить("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ");
	
	ПоляТекст = "";
	ШаблонПоля = ", %1 КАК %2";	
	Для Каждого Формула Из ПоляФормульныхПоказателей Цикл
		ПоляТекст = ПоляТекст + 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля, Формула.Значение.ФормулаЧерезИмяПоказателя, Формула.Ключ) 
		+ Символы.ПС;
		// Т.к. в запросе верхний и нижний регистр не учитывается, то приводим все к верхнему, для замены агрегатных функций.
		ПоляТекст = ВРег(ПоляТекст);
		Для Каждого АгрегатнаяФункция Из АгрегатныеФункции Цикл
			ПоляТекст = СтрЗаменить(ПоляТекст, АгрегатнаяФункция, "(");
		КонецЦикла;		
	КонецЦикла;  
	
	ШаблонПоляФормул = ", т.%1 КАК %1";
	Для Каждого Элемент Из СписокПредшественников Цикл
		ПоляТекст = ПоляТекст + 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоляФормул, Элемент.Представление) 
		+ Символы.ПС;
	КонецЦикла;
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	т.*
	|ПОМЕСТИТЬ ВТ_Табл
	|ИЗ
	|	&ТЗ КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Проект КАК Проект,
	|	т.ИдентификаторПараметров
	|%1
	|ИЗ
	|	ВТ_Табл КАК т";
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, ПоляТекст);
	Запрос.УстановитьПараметр("ТЗ", ТаблицаПоказателейИндикаторов);
	
	ПолученныеЗначения =  Запрос.Выполнить().Выгрузить();	
	
	ТаблицаПоказателейПроектов = Новый ТаблицаЗначений;
	ТаблицаПоказателейПроектов.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	ТаблицаПоказателейПроектов.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.упоПоказателиПроектов"));
	ТаблицаПоказателейПроектов.Колонки.Добавить("ИдентификаторПараметров", Новый ОписаниеТипов("Число"));
	ТаблицаПоказателейПроектов.Колонки.Добавить("Значение");
	
	ТаблицаПоказателейПроектов.Индексы.Добавить("Проект");
	ТаблицаПоказателейПроектов.Индексы.Добавить("Показатель");
	ТаблицаПоказателейПроектов.Индексы.Добавить("ИдентификаторПараметров");
	
	Для Каждого Строка Из ПолученныеЗначения Цикл
		
		Для Каждого ФормульныйПоказатель Из ФормульныеПоказатели Цикл
			
			НоваяСтрока = ТаблицаПоказателейПроектов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Показатель = ФормульныйПоказатель.Показатель;
			НоваяСтрока.Значение = Строка[ФормульныйПоказатель.Представление];
			
		КонецЦикла;
		
		Для Каждого Элемент Из СписокПредшественников Цикл
			
			НоваяСтрока = ТаблицаПоказателейПроектов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Показатель = Элемент.Значение;
			НоваяСтрока.Значение = Строка[Элемент.Представление];
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаПоказателейПроектов;
	
КонецФункции

#КонецОбласти

#Область ОтборОтмененныхЗадачВТекстеЗапроса

Процедура ОбработатьОператорыСхемыЗапроса(ОператорыЗапроса, 
	РегистрыПлановыхДанных, РегистрыПлановыхДанныхТекущаяВерсия)
		
	Для Каждого ОператорЗапроса Из ОператорыЗапроса Цикл
		
		Для Каждого ИсточникЗапроса Из ОператорЗапроса.Источники Цикл
			
			Если ТипЗнч(ИсточникЗапроса.Источник) = Тип("ТаблицаСхемыЗапроса") Тогда
				
				ОбработатьТаблицуСхемыЗапроса(ОператорЗапроса, ИсточникЗапроса, 
					РегистрыПлановыхДанных, РегистрыПлановыхДанныхТекущаяВерсия)					
				
			ИначеЕсли ТипЗнч(ИсточникЗапроса.Источник) = Тип("ВложенныйЗапросСхемыЗапроса") Тогда
								
				ОбработатьОператорыСхемыЗапроса(ИсточникЗапроса.Источник.Запрос.Операторы, 
					РегистрыПлановыхДанных, РегистрыПлановыхДанныхТекущаяВерсия);							
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;
		
КонецПроцедуры	

Процедура ОбработатьТаблицуСхемыЗапроса(ОператорЗапроса, ИсточникЗапроса, 
	РегистрыПлановыхДанных, РегистрыПлановыхДанныхТекущаяВерсия)
	
	ИмяРегистра = ИмяРегистраПоИмениТаблицы(ИсточникЗапроса.Источник.ИмяТаблицы);	
			
	Если РегистрыПлановыхДанных.Получить(ИмяРегистра) <> Неопределено Тогда
		
		ДобавитьИсточникВСхемуЗапроса_Свойства(ОператорЗапроса, ИсточникЗапроса, 
									РегистрыПлановыхДанных.Получить(ИмяРегистра));
		
	ИначеЕсли РегистрыПлановыхДанныхТекущаяВерсия.Получить(ИмяРегистра) <> Неопределено Тогда
		
		ИсточникСвойства = ДобавитьИсточникВСхемуЗапроса_Свойства(ОператорЗапроса, ИсточникЗапроса, 
									РегистрыПлановыхДанныхТекущаяВерсия.Получить(ИмяРегистра), 
									Ложь);
		
		ДобавитьИсточникВСхемуЗапроса_Версии(ОператорЗапроса, ИсточникСвойства);
		
	ИначеЕсли ИмяРегистра = "упоСвойстваПроектныхЗадач" Тогда
		
		Если СтрНайти(ИсточникЗапроса.Источник.Псевдоним, СлужебныйПрефикс()) = 0 Тогда
			ДобавитьОтборОтмененные(ОператорЗапроса, ИсточникЗапроса.Источник.Псевдоним);
		КонецЕсли;	
		
	КонецЕсли;		
	
КонецПроцедуры	

Функция ДобавитьИсточникВСхемуЗапроса_Свойства(ОператорЗапроса, ИсточникЗапроса, 
												ИмяПоляПЗИсточника = "ПроектнаяЗадача",
												ВключатьВерсию = Истина)
	
	ПсведонимТаблицыСоединения 	= ИсточникЗапроса.Источник.Псевдоним;	
	ПсевдонимНовойТаблицы 		= СлужебныйПрефикс() + "СвойстваПЗ_" + ПсведонимТаблицыСоединения;	
	
	НовыйИсточник = ОператорЗапроса.Источники.Добавить("РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних", 
		ПсевдонимНовойТаблицы);
	// Удаляем автоматически добавленное левое соединение, т.к. дальше будем добавлять внутреннее.	
	Если НовыйИсточник.Соединения.Количество() > 0 Тогда
		НовыйИсточник.Соединения.Очистить();
	КонецЕсли;
	
	УсловияСоединения = Новый Массив;
	Если ВключатьВерсию Тогда
		УсловияСоединения.Добавить("%1.Версия = %2.Версия");
	КонецЕсли;
	УсловияСоединения.Добавить("%1.%3 = %2.ПроектнаяЗадача");
	УсловияСоединения.Добавить("НЕ %2.ЗадачаОтменена");
		
	СтрокаСоединения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		СтрСоединить(УсловияСоединения, " И "),
		ПсведонимТаблицыСоединения,
		ПсевдонимНовойТаблицы,
		ИмяПоляПЗИсточника);			
	
	упоТиповыеОтчетыСервер.ДобавитьВнутреннееСоединениеВИсточник(ИсточникЗапроса, 
																ПсевдонимНовойТаблицы, 
																СтрокаСоединения);
		
	Возврат НовыйИсточник;
	
КонецФункции

Функция ДобавитьИсточникВСхемуЗапроса_Версии(ОператорЗапроса, ИсточникЗапроса)
	
	ПсведонимТаблицыСоединения 	= ИсточникЗапроса.Источник.Псевдоним;
	ПсевдонимНовойТаблицы 		= СлужебныйПрефикс() + "Версии_" + ПсведонимТаблицыСоединения;	
	
	НовыйИсточник = ОператорЗапроса.Источники.Добавить("РегистрСведений.упоВерсииПроекта", ПсевдонимНовойТаблицы);	
	// Удаляем автоматически добавленное левое соединение, т.к. дальше будем добавлять внутреннее.	
	Если НовыйИсточник.Соединения.Количество() > 0 Тогда
		НовыйИсточник.Соединения.Очистить();
	КонецЕсли;
	
	СтрокаСоединения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.Версия = %2.Версия И %2.Текущая",
		ПсведонимТаблицыСоединения, 
		ПсевдонимНовойТаблицы);									
	
	упоТиповыеОтчетыСервер.ДобавитьВнутреннееСоединениеВИсточник(ИсточникЗапроса, 
																ПсевдонимНовойТаблицы, 
																СтрокаСоединения);
	
	Возврат НовыйИсточник;
	
КонецФункции

Процедура ДобавитьОтборОтмененные(ОператорЗапроса, ПсевдонимТаблицы)
	
	СтрокаОтбора = СтрЗаменить("НЕ %1.ЗадачаОтменена", "%1", ПсевдонимТаблицы); 
	ОператорЗапроса.Отбор.Добавить(СтрокаОтбора);
	
КонецПроцедуры	

Функция ИмяРегистраПоИмениТаблицы(ПолноеИмяТаблицы)
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмяТаблицы, ".");
	
	Если ЧастиИмени.Количество() > 1 Тогда
		ИмяРегистра = ЧастиИмени[1];
	Иначе 
		ИмяРегистра = "Неопределено";
	КонецЕсли;	
	
	Возврат ИмяРегистра;
	
КонецФункции	

Функция СлужебныйПрефикс()
	
	Возврат "_ОтборОтмененные_";
	
КонецФункции	

Функция РегистрыПлановыхДанных()
	
	Регистры = Новый Соответствие;
	Регистры.Вставить("упоАктуальныеПланыВыполненияОбъемов", "ПроектнаяЗадача");
	Регистры.Вставить("упоАктуальныеПланыДвиженийДенежныхСредств", "ПроектнаяЗадача");
	Регистры.Вставить("упоАктуальныеПланыДополнительныхЗатрат", "ПроектнаяЗадача");
	Регистры.Вставить("упоАктуальныеПланыДоходовИРасходов", "ПроектнаяЗадача");
	Регистры.Вставить("упоАктуальныеПланыДоходовИРасходовПодразделения", "ПроектнаяЗадача");
	Регистры.Вставить("упоАктуальныеПланыЗатратМатериальныхРесурсов", "ПроектнаяЗадача");
	Регистры.Вставить("упоАктуальныеПланыТрудозатратПоДнямВерсии", "Операция");	
	Регистры.Вставить("упоАктуальныеПланыТрудозатратСводноВерсии", "ПроектнаяЗадача");	
	Регистры.Вставить("упоВыделенныеТрудовыеРесурсы", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановВыпускаСубпродуктов", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановДвиженияДенежныхСредств", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановДополнительныхЗатрат", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановДополнительныхЗатратПодразделения", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановДоходовИРасходов", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановДоходовИРасходовПодразделения", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановОбъемовПодразделения", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановПотребностейМатериальныхРесурсов", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеПлановТрудозатратРолей", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеРаспределенияДоходовПоПериодам", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам", "ПроектнаяЗадача");
	Регистры.Вставить("упоДанныеРаспределенияРасходовПоПериодам", "ПроектнаяЗадача");
	Регистры.Вставить("упоКодыСДР", "ПроектнаяЗадача");
	Регистры.Вставить("упоПредусловияПроектныхЗадач", "ПроектнаяЗадача");
	Регистры.Вставить("упоПрогнозныеСрокиПроектныхЗадач", "ПроектнаяЗадача");	
	Регистры.Вставить("упоПроцентыГотовностиПроектныхЗадач", "ПроектнаяЗадача");	
	Регистры.Вставить("упоРасчетныеСрокиПроектныхЗадач", "ПроектнаяЗадача");		
	Регистры.Вставить("упоСрокиПроектныхЗадач", "ПроектнаяЗадача");
	Регистры.Вставить("упоСтатусыПроектныхЗадач", "ПроектнаяЗадача");
	Регистры.Вставить("упоФактическиеДатыНачалаИОкончанияПроектныхЗадач", "ПроектнаяЗадача");
	
	Возврат Регистры;
		
КонецФункции

Функция РегистрыПлановыхДанныхТекущаяВерсия()
	
	Регистры = Новый Соответствие;

	Регистры.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", "Операция");
	Регистры.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "ПроектнаяЗадача");
		
	Возврат Регистры;
	
КонецФункции

#КонецОбласти

#КонецОбласти