////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции интеграции с УПФ.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Оповещает о выборе связанной статьи 
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора плана счетов "Управленческий"
//  ВыбранноеЗначение - ПланСчетовСсылка.Управленческий - план счет, по которому нужно найти связанную статью
//
// Возвращаемое значение:
//  Булево - Истина, если нужно оповестить о выборе связанной статьи.
//
Функция ОповеститьОВыбореСвязаннойСтатьи(Форма, ВыбранноеЗначение) Экспорт
	
	ИмяРеквизита = упоИнтеграцияУПФКлиентСервер.ИмяРеквизитаДляОпределенияВыбораСвязанойСтатьи();
	ЭтоВыборСвязаннойСтатьи = Форма[ИмяРеквизита];
	
	Если ЭтоВыборСвязаннойСтатьи Тогда
		СвязаннаяСтатья = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(ВыбранноеЗначение);
		Форма.ОповеститьОВыборе(СвязаннаяСтатья);
		Возврат Истина;
	КонецЕсли;
				
	Возврат Ложь;
	
КонецФункции

// Возвращает имена табличных частей документа Бюджет, которые нужно заполнить данными из контура РМ-а. 
//
// Возвращаемое значение:
//  Массив из строк - Имена табличных частей документа Бюджет.
//
Функция ИменаЗаполняемыхТабличныхЧастейДокументаБюджет() Экспорт
	
	ИменаЗаполняемыхТабличныхЧастей = Новый Массив;
	ИменаЗаполняемыхТабличныхЧастей.Добавить("Доходы");
	ИменаЗаполняемыхТабличныхЧастей.Добавить("Расходы");
	ИменаЗаполняемыхТабличныхЧастей.Добавить("Поступления");
	ИменаЗаполняемыхТабличныхЧастей.Добавить("Выбытия");
	
	Возврат ИменаЗаполняемыхТабличныхЧастей;
	
КонецФункции

// Создает заказы покупателя по данным проектной задачи
//
// Параметры:
//	ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача - Документ на основании, которого создаются заказы покупателя	
//
Процедура СоздатьЗаказыПокупателя(ПроектнаяЗадача) Экспорт

	ВидДокумента = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяВидаЗаказаПокупателя();
	ПолученныеДанные = упоИнтеграцияУПФВызовСервера.ПолучитьДанныеДляЗаполненияЗаказов(ПроектнаяЗадача, ВидДокумента);
	ОткрытьЗаполненныеФормыЗаказов(ПолученныеДанные);	
	
КонецПроцедуры	

// Создает заказы покупателя по данным проектной задачи
//
// Параметры:
//	ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача	- Документ на основании, которого создаются заказы поставщику
//
Процедура СоздатьЗаказыПоставщику(ПроектнаяЗадача) Экспорт

	ВидДокумента = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяВидаЗаказаПоставщику();
	ПолученныеДанные = упоИнтеграцияУПФВызовСервера.ПолучитьДанныеДляЗаполненияЗаказов(ПроектнаяЗадача, ВидДокумента);
	ОткрытьЗаполненныеФормыЗаказов(ПолученныеДанные);	
	
КонецПроцедуры

// Оповещает о выборе классификатора единицы измерения
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма выбора классификатора единиц измерения
//	Классификатор - СправочникСсылка.КлассификаторЕдиницИзмерения - Элемент, для которого нужно найти упаковку.
//
Процедура ОповеститьОВыбореКлассификатораЕдИзм(Форма, Классификатор) Экспорт
		
	ИмяРеквизита = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяРеквизитаДляОпределенияВыбораУпаковки();
	ЭтоВыборУпаковки = Форма[ИмяРеквизита];
	
	Если ЭтоВыборУпаковки Тогда
		Упаковка = упоИнтеграцияУПФВызовСервера.УпаковкаЕдИзмСвязаннаяСКлассификаторомЕдИзм(Классификатор);
		Форма.ОповеститьОВыборе(Упаковка);
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает изменение положения элемента "Проект" на форме документа.
//
// Параметры:
//  Объект						 - ДанныеФормыСтруктура	 - Основной реквизит формы документа
//  СтруктураНастройкаДокумента	 - Структура			 - Результат, возвращаемый общей формой
//  			"ШапкаТабличнаяЧасть" при закрытии
//
Процедура ОбработатьИзменениеПоложенияПроекта(Объект, СтруктураНастройкаДокумента) Экспорт 
	
	Если ТипЗнч(СтруктураНастройкаДокумента) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	
	Если СтруктураНастройкаДокумента.Свойство("ПоложениеПроекта") Тогда
		Если Объект.ПоложениеПроекта <> СтруктураНастройкаДокумента.ПоложениеПроекта Тогда
			Объект.ПоложениеПроекта = СтруктураНастройкаДокумента.ПоложениеПроекта;
			МодульЗаполнениеОбъектовУНФКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЗаполнениеОбъектовУНФКлиент");
			МодульЗаполнениеОбъектовУНФКлиент.ОбработатьИзменениеПоложения(Объект, "РасшифровкаПлатежа", "Проект", "ПоложениеПроекта");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Устанавливает реквизит формы "Объект.ОтображатьОрганизацию" в значение "Истина",
// если из группы "Строки" выбрана только настройка "Проект" или только "Проектная задача".
// Это необходимо для правильного формирования отчета, в противном случае
// отчет будет сформирован пустым.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма отчета "Платежный календарь"
//
Процедура НастроитьОтчетСОтображениемПроектаВСтроках(Форма) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "упоОтображатьПроект") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "упоОтображатьПроектнуюЗадачу") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Форма.Объект.упоОтображатьПроект И
		 НЕ Форма.Объект.упоОтображатьПроектнуюЗадачу Тогда 
		Возврат;
	КонецЕсли;
	
	Если Форма.Объект.ОтображатьОрганизацию 
		ИЛИ Форма.Объект.ОтображатьТипДС 
		ИЛИ Форма.Объект.ОтображатьСчетКассу 
	 	ИЛИ Форма.Объект.ОтображатьСтатью 
	 	ИЛИ Форма.Объект.ОтображатьКонтрагента Тогда 
		Возврат;
	КонецЕсли;
	
	Форма.Объект.ОтображатьОрганизацию = Истина;

КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Заказы

Процедура ПерезаполнитьЗаказы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		упоИнтеграцияУПФВызовСервера.ПерезаполнитьЗаказыНаСервере(ДополнительныеПараметры)
	КонецЕсли;
	
КонецПроцедуры 

Функция ТекстВопросаПоЗаказам(Заказы) Экспорт 

	ШаблонВопроса = НСтр("ru = 'Запланированные движения денежных средств не совпадают с данными документов:
                    |%1
                    |Хотите обновить данные платежного календаря в указанных документах?
                    |'");
	СписокЗаказов = "";
	
	Для Каждого Заказ Из Заказы Цикл
		
		Если ЗначениеЗаполнено(СписокЗаказов) Тогда
			СписокЗаказов = СписокЗаказов + Символы.ПС;
		КонецЕсли;
		
		СписокЗаказов = СписокЗаказов + Заказ;
		
	КонецЦикла;
	
	ШаблонВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВопроса, СписокЗаказов);
	
	Возврат ШаблонВопроса;

КонецФункции

#КонецОбласти

Процедура Подключаемый_ОткрытьФормуЗаполненияДокументаБюджет(ПараметрКоманды, 
	ПараметрыВыполненияКоманды) Экспорт
	
	Если Не ПараметрыВыполненияКоманды.ЭтоФормаОбъекта Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектФормы = ПараметрыВыполненияКоманды.Форма.Объект;
	ИменаЗаполняемыхТабличныхЧастей = ИменаЗаполняемыхТабличныхЧастейДокументаБюджет();
	
	Если Не ОбъектФормы.ИспользоватьПродвинутыйРежимПросмотра Тогда
		ТекстСообщения = НСтр("ru = 'Для продолжения необходимо переключить режим просмотра.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЕстьЗаполненныеТЧ = Ложь;
	Для Каждого ИмяТЧ Из ИменаЗаполняемыхТабличныхЧастей Цикл
		
		Если ОбъектФормы[ИмяТЧ].Количество() <> 0 Тогда
			ЕстьЗаполненныеТЧ = Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	ДопПараметры = 
		Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды, ИменаЗаполняемыхТабличныхЧастей, ОбъектФормы",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды,
			ИменаЗаполняемыхТабличныхЧастей,
			ОбъектФормы);
	
	Если ЕстьЗаполненныеТЧ Тогда
		
		ТекстВопроса = 
			НСтр("ru = 'Для продолжения необходимо очистить следующие табличные части: Доходы, Расходы, Поступления, Выбытия.
			|Продолжить?'");		
		
		ЗавершениеВопроса = Новый ОписаниеОповещения("ОчисткаТабЧастейДокументаБюджетЗавершение", ЭтотОбъект, ДопПараметры);		
		ПоказатьВопрос(ЗавершениеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуОбработкиЗаполненияДокумента(ПараметрКоманды, ПараметрыВыполненияКоманды);
		
КонецПроцедуры

Процедура Подключаемый_ОткрытьФормуЗаполненияДокументаНачисленияЗП(ПараметрКоманды, 
	ПараметрыВыполненияКоманды) Экспорт
	
	Если Не ПараметрыВыполненияКоманды.ЭтоФормаОбъекта Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектФормы = ПараметрыВыполненияКоманды.Форма.Объект;
	
	ДопПараметры = 
		Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды, ОбъектФормы",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды,
			ОбъектФормы);
	
	Если ОбъектФормы.НачисленияУдержания.Количество() <> 0 Тогда
		
		ТекстВопроса = 
			НСтр("ru = 'Для продолжения необходимо очистить табличную часть ""Начисления и удержания"".
			|Продолжить?'");		
		
		ЗавершениеВопроса = Новый ОписаниеОповещения("ОчисткаТЧДокументаНачисленияЗПЗавершение", ЭтотОбъект, ДопПараметры);		
		ПоказатьВопрос(ЗавершениеВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);		
		
		Возврат	
		
	КонецЕсли;
	
	ОткрытьФормуОбработкиЗаполненияДокумента(ПараметрКоманды, ПараметрыВыполненияКоманды,
		"ФормаЗаполненияДокументаНачисленияЗП");
	
КонецПроцедуры

Процедура Подключаемый_РаспределитьПоЗадачамПроектов(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если Не ПараметрыВыполненияКоманды.ЭтоФормаОбъекта Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектФормы = ПараметрыВыполненияКоманды.Форма.Объект;
	
	МожноЗаполнять = ПроверитьВозможностьЗаполнения(ОбъектФормы);
	Если Не МожноЗаполнять Тогда		
		Возврат;		
	КонецЕсли;
	
	ДанныеДокумента = ПолучитьДанныеДляНахожденияРаспределенияТрудозатрат(ОбъектФормы);
	ДанныеРаспределения = 
		упоИнтеграцияУПФВызовСервера.ПолучитьДанныеРаспределенияЗарплатыПоФактуТрудозатрат(ДанныеДокумента);
	ЗаполнитьПоДаннымРаспределения(ОбъектФормы, ДанныеРаспределения);
		
	ПараметрыВыполненияКоманды.Форма.Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заказы

// Выполняет действия, связанные с именем команды.
//
// Параметры:
//  ИмяКоманды     - Строка - имя команды.
//  СсылкаНаЗадачу - ДокументСсылка.упоПроектнаяЗадача, Массив - проектная задача или массив проектных задач

Процедура ДобавитьНаФормуКомандуСоздатьНаОсновании(ИмяКоманды, СсылкаНаЗадачу) Экспорт
			
	Если ИмяКоманды = "Создать_Документ_ЗаказПокупателя" Тогда     			
		ВводНаОсновании_СоздатьЗаказПокупателя(СсылкаНаЗадачу);
	ИначеЕсли ИмяКоманды = "Создать_Документ_ЗаказПоставщику" Тогда
		ВводНаОсновании_СоздатьЗаказПоставщику(СсылкаНаЗадачу);	
	КонецЕсли;
	
КонецПроцедуры

// Создает документ Заказ покупателя на основании переданного массива ссылок объектов-оснований.
//
// Параметры:
//  МассивСсылок		 - ДокументСсылка.упоПроектнаяЗадача, Массив - проектная задача или массив проектных задач
//  ПараметрыВыполнения	 - Структура - параметры выполнения команды.
//
Процедура ВводНаОсновании_СоздатьЗаказПокупателя(МассивСсылок, ПараметрыВыполнения = Неопределено) Экспорт
	
	ПроектнаяЗадачаСсылка = ПолучитьПервыйЭлементПеременной(МассивСсылок);
	
	Если ПроектнаяЗадачаСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	упоИнтеграцияУПФКлиент.СоздатьЗаказыПокупателя(ПроектнаяЗадачаСсылка);	
	
КонецПроцедуры 

// Создает документ Заказ поставщику на основании переданного массива ссылок объектов-оснований.
//
// Параметры:
//  МассивСсылок		 - ДокументСсылка.упоПроектнаяЗадача, Массив - проектная задача или массив проектных задач
//  ПараметрыВыполнения	 - Структура - параметры выполнения команды.
//
Процедура ВводНаОсновании_СоздатьЗаказПоставщику(МассивСсылок, ПараметрыВыполнения = Неопределено) Экспорт
	
	ПроектнаяЗадачаСсылка = ПолучитьПервыйЭлементПеременной(МассивСсылок);
	
	Если ПроектнаяЗадачаСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	упоИнтеграцияУПФКлиент.СоздатьЗаказыПоставщику(ПроектнаяЗадачаСсылка);	
	
КонецПроцедуры 

#КонецОбласти

Процедура ОчисткаТабЧастейДокументаБюджетЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = ДопПараметры.ПараметрКоманды;
	ПараметрыВыполненияКоманды = ДопПараметры.ПараметрыВыполненияКоманды;	
	ИменаЗаполняемыхТабличныхЧастей = ДопПараметры.ИменаЗаполняемыхТабличныхЧастей;
	ОбъектФормы = ДопПараметры.ОбъектФормы;
	
	Для Каждого ИмяТЧ Из ИменаЗаполняемыхТабличныхЧастей Цикл		
		Если ОбъектФормы[ИмяТЧ].Количество() <> 0 Тогда
			ОбъектФормы[ИмяТЧ].Очистить();
		КонецЕсли;		
	КонецЦикла;
	
	ОткрытьФормуОбработкиЗаполненияДокумента(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

Процедура ОчисткаТЧДокументаНачисленияЗПЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = ДопПараметры.ПараметрКоманды;
	ПараметрыВыполненияКоманды = ДопПараметры.ПараметрыВыполненияКоманды;	
	ОбъектФормы = ДопПараметры.ОбъектФормы;
	
	ОбъектФормы.НачисленияУдержания.Очистить();	
	
	ОткрытьФормуОбработкиЗаполненияДокумента(ПараметрКоманды, ПараметрыВыполненияКоманды,
		"ФормаЗаполненияДокументаНачисленияЗП");
	
КонецПроцедуры

Процедура ОткрытьФормуОбработкиЗаполненияДокумента(ПараметрКоманды, ПараметрыВыполненияКоманды,
	ИмяОткрываемойФормы = "ФормаЗаполненияДокументаБюджет")

	ИмяФормы = "Обработка.упоЗаполнениеДокументовУНФ.Форма.%1";
	ИмяФормы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИмяФормы, ИмяОткрываемойФормы);
	ПараметрыФормы = Новый Структура("ДокументОснование", ПараметрКоманды);
	ОткрытьФорму(ИмяФормы, 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Форма, 
		ПараметрКоманды, 
		, 
		, 
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры	

Процедура ОткрытьЗаполненныеФормыЗаказов(ПолученныеДанные)

	ПараметрыСозданияЗаказов = ПолученныеДанные.ПараметрыСозданияЗаказов;
	ДанныеЗаказов = ПолученныеДанные.ДанныеЗаказов;   

	Если ДанныеЗаказов.Количество() = 0 Тогда
		
		Если ПараметрыСозданияЗаказов.ВидДокумента = "ЗаказПоставщику" Тогда
			ТекстСообщения = НСтр("ru = 'Для создания заказа поставщику необходимо заполнить план потребностей'");
		ИначеЕсли ПараметрыСозданияЗаказов.ВидДокумента = "ЗаказПокупателя" Тогда
			ТекстСообщения = НСтр("ru = 'Для создания заказа покупателя необходимо заполнить план выпуска'"); 
		Иначе
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
	Для Каждого ДанныеЗаказа Из ДанныеЗаказов Цикл
		РеквизитыЗаполнения = Новый Структура;
		РеквизитыЗаполнения.Вставить("ПараметрыСозданияЗаказов", ПараметрыСозданияЗаказов);
		РеквизитыЗаполнения.Вставить("ДанныеЗаказа", ДанныеЗаказа);
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("упоДанныеЗаполнения", РеквизитыЗаполнения);
		ФормаЗаказаПокупателя = ПолучитьФорму(ПараметрыСозданияЗаказов.ИмяФормы, ПараметрыОткрытия, , 
																			Новый УникальныйИдентификатор);		
		ФормаЗаказаПокупателя.Открыть();		
	КонецЦикла;
	
КонецПроцедуры

#Область РаспределениеЗарплатыПоЗадачамПроектов

Процедура ДобавитьСтрокиРаспределения(НайденныеСтроки, НачисленияУдержания, СтрокаСРаспределением)
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Распределение = СтрокаСРаспределением.Распределение;
	Если Распределение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = НайденныеСтроки[0];		
	ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Распределение[0]);
	ИндексНайденнойСтроки = НачисленияУдержания.Индекс(НайденнаяСтрока);
	
	Для Итератор = 1 По Распределение.ВГраница() Цикл
		ИндексВставляемойСтроки = ИндексНайденнойСтроки + Итератор;
		НоваяСтрока = НачисленияУдержания.Вставить(ИндексВставляемойСтроки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Распределение[Итератор]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымРаспределения(ОбъектФормы, ДанныеРаспределения)
	
	НачисленияУдержания = ОбъектФормы.НачисленияУдержания;
	ИменаПолей = упоИнтеграцияУПФКлиентСервер.ПолучитьИменаРеквизитовДляРаспределенияСуммыЗарплатыПоФактуТрудозатрат();
	
	Для Каждого СтрокаСРаспределением Из ДанныеРаспределения Цикл
		
		Отбор = Новый Структура(ИменаПолей);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаСРаспределением);
		НайденныеСтроки = НачисленияУдержания.НайтиСтроки(Отбор);
		
		ДобавитьСтрокиРаспределения(НайденныеСтроки, НачисленияУдержания, СтрокаСРаспределением);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляНахожденияРаспределенияТрудозатрат(ОбъектФормы)
	
	ИменаПолей = упоИнтеграцияУПФКлиентСервер.ПолучитьИменаРеквизитовДляРаспределенияСуммыЗарплатыПоФактуТрудозатрат();
	ДанныеТЧНачисленияУдержания = Новый Массив;
	Для Каждого Строка Из ОбъектФормы.НачисленияУдержания Цикл
		Отбирать = ПроверитьУсловиеОтбораСтрок(Строка);
		Если Отбирать Тогда
			ДанныеПоСтроке = Новый Структура(ИменаПолей);
			ЗаполнитьЗначенияСвойств(ДанныеПоСтроке, Строка);
			ДанныеТЧНачисленияУдержания.Добавить(ДанныеПоСтроке);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("ДанныеТЧНачисленияУдержания", ДанныеТЧНачисленияУдержания);
	ДанныеДокумента.Вставить("ПериодРегистрации", ОбъектФормы.ПериодРегистрации);
	ДанныеДокумента.Вставить("СтруктурнаяЕдиница", ОбъектФормы.СтруктурнаяЕдиница);
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ПроверитьВозможностьЗаполнения(ОбъектФормы) 
	
	МожноЗаполнять = Ложь;
	
	Если ОбъектФормы.НачисленияУдержания.Количество() = 0 Тогда		
		Возврат МожноЗаполнять;		
	КонецЕсли;	
	
	Для Каждого Строка Из ОбъектФормы.НачисленияУдержания Цикл
		Отбирать = ПроверитьУсловиеОтбораСтрок(Строка);
		Если Отбирать Тогда
			МожноЗаполнять = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МожноЗаполнять;
	
КонецФункции

Функция ПроверитьУсловиеОтбораСтрок(Строка)
	
	Отбирать = Строка.Сумма <> 0 И ЗначениеЗаполнено(Строка.Сотрудник) И Не ЗначениеЗаполнено(Строка.Проект);	
	Возврат Отбирать;
	
КонецФункции

#КонецОбласти  

 // Функция - Получить первый элемент переменной
//
// Параметры:
//  МассивСсылок - Любая ссылка, Массив - элемент иди массив обрабатываемых элементов
// 
// Возвращаемое значение:
//  ПервыйЭлемент - возвращает первый элемент массива, если передан массив, или сам элемент, 
//  				если передан параметр не списочного типа                            
//
Функция ПолучитьПервыйЭлементПеременной(МассивСсылок) Экспорт

	ПервыйЭлемент = "";
	
	Если ТипЗнч(МассивСсылок) <> Тип("Массив") Тогда
		ПервыйЭлемент = МассивСсылок;
	ИначеЕсли ТипЗнч(МассивСсылок) = Тип("Массив") И МассивСсылок.Количество() <> 0 Тогда
		ПервыйЭлемент = МассивСсылок[0];  
	Иначе 
		ПервыйЭлемент = Неопределено;
	КонецЕсли;
	
	Возврат ПервыйЭлемент;
	
КонецФункции

#КонецОбласти
