
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	упоОбработчикиСобытийСервер.ОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
	Если Не Отказ Тогда		
		Наименование = СокрЛП(СтрПолучитьСтроку(Описание, 1));	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Начало = НачалоДня(ТекущаяДатаСеанса()) + 3600 * 10;	
	Конец = НачалоДня(ТекущаяДатаСеанса()) + 3600 * 11;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.упоТрудовыеРесурсы") Тогда
		ВладелецКалендаря = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	Иначе      
		Если ПараметрыСеанса.упоСписокТрудовыхРесурсовСотрудника.Количество() Тогда
			ВладелецКалендаря = ПараметрыСеанса.упоСписокТрудовыхРесурсовСотрудника[0];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли