////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции работы с отладкой.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает текущий контекст выполнения.
//
// Возвращаемое значение:
//	Строка - текущий контекст.
//
Функция ТекущийКонтекст() Экспорт
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат "ТолстыйКлиентОбычноеПриложение";
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		Возврат "ТолстыйКлиентУправляемоеПриложение";
	#ИначеЕсли ВнешнееСоединение Тогда
		Возврат "ВнешнееСоединение";
	#ИначеЕсли ТонкийКлиент Тогда
		Возврат "ТонкийКлиент";
	#ИначеЕсли ВебКлиент Тогда
		Возврат "ВебКлиент";
	#ИначеЕсли Сервер Тогда
		Возврат "Сервер";		
	#КонецЕсли
	Возврат "Неопределено";
КонецФункции

// Получает массив ошибок записи движений.
//
// Параметры:
//  Движения						 - КоллекцияДвижений - коллекции наборов записей движений документа, которые надо 
//														   проверить на ошибки записи.
//  ВозвращатьТекстКогдаНетОшибок	 - Булево - признак того, что необходимо возвращать строку в случае отсутствия ошибок.
//
// Возвращаемое значение:
//	Строка, Массив, Неопределено - массив сообщений об ошибках или строка "Нет ошибок".
//								   В случае ВозвращатьТекстКогдаНетОшибок = Истина и отсутствуют ошибки,
//								   возвращается Неопределено.
//
Функция ПолучитьОшибкиЗаписиДвижений(Движения, ВозвращатьТекстКогдаНетОшибок = Ложь) Экспорт
	
	МассивОшибок = Новый Массив;
	Для Каждого НаборЗаписей Из Движения Цикл
		Попытка
			НаборЗаписей.Записать();
		Исключение
			МассивОшибок.Добавить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
			
	Если ВозвращатьТекстКогдаНетОшибок И МассивОшибок.Количество() = 0 Тогда
		Возврат НСтр("ru = 'Нет ошибок'");
	Иначе
		Возврат МассивОшибок;
	КонецЕсли;
			
КонецФункции

// Получается PID процесса (только для windows).
//
// Возвращаемое значение:
//	Число - PID процесса или -1 в случае провала.
//
Функция ПолучитьPID() Экспорт
	
	чPID = -1;
	
	#Если Сервер Или ТонкийКлиент Или ТолстыйКлиент Тогда
	
	Попытка
		oLocator = Новый COMОбъект("WbemScripting.SWbemLocator");
		oService = oLocator.ConnectServer(".", "root\CIMV2");
		oShell = Новый COMОбъект("WScript.Shell");
		oApp = oShell.Exec("rundll32.exe kernel32,Sleep");
		oChildProcess = oService.Get("Win32_Process.Handle=" + Формат(oApp.ProcessID, "ЧГ="));
		чPID = oChildProcess.ParentProcessID;
		oChildProcess.Terminate();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = '" + ОписаниеОшибки() + ".'");
		Сообщение.Сообщить();
	КонецПопытки; 
		
	#КонецЕсли
	
	Возврат чPID;
	
КонецФункции 

// Функция - Зафиксировать время
//
// Параметры:
//  Текст	 - Строка	 - Текст метки.
// 
// Возвращаемое значение:
//  ТекущаяУниверсальнаяДатаВМиллисекундах - Число.
//
Функция ФиксВремя(Текст = "") Экспорт
	
	Возврат Неопределено;
	
	ТекущаяУниверсальнаяДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Нстр("ru = '" + Формат(ТекущаяУниверсальнаяДатаВМиллисекундах, "ЧН=; ЧГ=") + "|" + Текст + "'");
	Сообщение.Сообщить();
	
	Возврат ТекущаяУниверсальнаяДатаВМиллисекундах;
	
КонецФункции

#КонецОбласти