////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции общего назначения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает таблицу соответствия цветов.
//
// Параметры:
//  рНижнийРегистр	 - Булево - признак необходимости представления названия цвета в таблице
//								в нижнем регистре.
// Возвращаемое значение:
//	ТаблицаЗначений - таблица цветов.
//
Функция ПрочитатьТаблицуЦветов(рНижнийРегистр = Ложь) Экспорт
	
	тЦветов = Новый ТаблицаЗначений;
	тЦветов.Колонки.Добавить("Название");
	тЦветов.Колонки.Добавить("Красный");
	тЦветов.Колонки.Добавить("Синий");
	тЦветов.Колонки.Добавить("Зеленый");
	тЦветов.Колонки.Добавить("Шестнадцатиричный");
	
	Мак = ПолучитьОбщийМакет("упоТаблицаЦветов");
	
	Для Ит = 2 По Мак.ВысотаТаблицы Цикл
		
		мргб = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Мак.Область(Ит, 2).Текст, " ");
		Стро = тЦветов.Добавить();
		Стро.Название = СокрЛП(Мак.Область(Ит, 1).Текст);		
		
		Попытка 
			Стро.Красный = Число(СокрЛП(мргб.Получить(0)));
		Исключение 
		КонецПопытки;
		
		Попытка 
			Стро.Синий = Число(СокрЛП(мргб.Получить(1)));
		Исключение 
		КонецПопытки;
		
		Попытка 
			Стро.Зеленый = Число(СокрЛП(мргб.Получить(2)));
		Исключение 
		КонецПопытки;
		
		Стро.Шестнадцатиричный = СокрЛП(Мак.Область(Ит, 3).Текст);
		Если рНижнийРегистр Тогда
			Стро.Название = СокрЛП(НРег(Стро.Название));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат тЦветов;
	
КонецФункции

#КонецОбласти