////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с проведением документов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Очищает набор записей.
//
// Параметры:
//  ТипРегистра				 - Строка
//  ИмяРегистра				 - Строка
//  ДокументСсылка			 - ДокументСсылка
//  ДополнительныеСвойства	 - Структура
//
Процедура ОчиститьНаборЗаписей(ТипРегистра, ИмяРегистра, ДокументСсылка, ДополнительныеСвойства = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипРегистра = "РегистрНакопления" Тогда
		Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
	Иначе
		Если ТипРегистра = "РегистрБухгалтерии" Тогда
			Набор = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
		ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
			Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		ИначеЕсли ТипРегистра = "РегистрРасчета" Тогда
			Набор = РегистрыРасчета[ИмяРегистра].СоздатьНаборЗаписей();
		КонецЕсли; 
	КонецЕсли;
	
	Набор.Отбор.Регистратор.Установить(ДокументСсылка);
	
	Если ДополнительныеСвойства <> Неопределено Тогда
		Для Каждого КлючЗначение Из ДополнительныеСвойства Цикл
			Набор.ДополнительныеСвойства.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);	
		КонецЦикла;
	КонецЕсли;			
	
	Набор.Записать();
		
КонецПроцедуры

// Процедура добавляет движения очистки неактуальных записей регистра
//  упоПредусловияПроектныхЗадач.
//
// Параметры:
//  ТаблицаДвижений	 - ТаблицаЗначений	 - подготовленные движения документа по регистру упоПредусловияПроектныхЗадач.
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача		 - документ Проектная задача.
//  Версия			 - ДокументСсылка.упоВерсияПланаПроекта 	- текущая версия проекта.
//
Процедура ДобавитьДвиженияОчисткиНеактуальныхСвязей(ТаблицаДвижений, ПроектнаяЗадача, Версия) Экспорт
	
	МассивСвязанныхЗадач = ТаблицаДвижений.ВыгрузитьКолонку("ЗадачаПредшественник");
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.Версия,
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.ЗадачаПредшественник,
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.ТипСвязи,
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.Задержка,
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.ЕдиницаНормированияДлительности,
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.ЗадержкаВЕдиницеИзмерения,
						  |	упоПредусловияПроектныхЗадачСрезПоследних.СвязьМеждуПроектами,
	                      |	ЛОЖЬ КАК СвязьСуществует
	                      |ИЗ
	                      |	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(
	                      |			,
	                      |			Версия = &Версия
	                      |				И ПроектнаяЗадача = &ПроектнаяЗадача
	                      |				И НЕ ЗадачаПредшественник В (&МассивСвязанныхЗадач)) КАК упоПредусловияПроектныхЗадачСрезПоследних
	                      |ГДЕ
	                      |	упоПредусловияПроектныхЗадачСрезПоследних.СвязьСуществует");
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("МассивСвязанныхЗадач", МассивСвязанныхЗадач);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), Выборка);
		КонецЦикла;	
	КонецЕсли;	
			
КонецПроцедуры	

// Готовит движения к регистрации: очищает и выставляет флаг Записывать.
//
// Параметры:
//  Объект	 - ДокументОбъект	 - проводимый документ.
//
Процедура ПодготовитьДвиженияКРегистрации(Объект) Экспорт
	
	Для Каждого ДвиженияРегистра Из Объект.Движения Цикл

		Если ДвиженияРегистра.Количество() > 0 Тогда
			ДвиженияРегистра.Очистить();
		КонецЕсли;

		ДвиженияРегистра.Записывать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

// Проводит документ.
//
// Параметры:
//  ДокументОбъект			 - ДокументОбъект	 - проводимый документ.
//  ДополнительныйРезультат	 - Структура, Неопределено
//
Процедура ПровестиДокумент(ДокументОбъект, ДополнительныйРезультат = Неопределено) Экспорт
	
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	
	ДанныеПроведения = Документы[ИмяДокумента].ДанныеПроведения(ДокументОбъект.Ссылка);
		
	Для Каждого ДанныеОтраженияПоРегистру Из ДанныеПроведения Цикл
		
		ДвижениеДокумента = ДокументОбъект.Движения.Найти(ДанныеОтраженияПоРегистру.Ключ);
		
		Если ДвижениеДокумента <> Неопределено Тогда
			ДвиженияРегистра = ДокументОбъект.Движения[ДанныеОтраженияПоРегистру.Ключ];
			ДвиженияРегистра.Загрузить(ДанныеОтраженияПоРегистру.Значение);
		ИначеЕсли ДополнительныйРезультат <> Неопределено Тогда
			ДополнительныйРезультат.Вставить(ДанныеОтраженияПоРегистру.Ключ, ДанныеОтраженияПоРегистру.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура рассчитывает процент готовности проектных задач и формирует движения в регистр
//  упоПроцентыГотовностиПроектныхЗадач.
//
// Параметры:
//  ЭтотОбъект		 - ДокументОбъект			 - содержит сам объект.
//  Отказ			 - Булево					 - признак проведения документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//  ДатаДвижений	 - Дата, Неопределено
//  Проект			 - СправочникСсылка.Проекты, Неопределено
//  НастройкиРасчета - Структура, Неопределено
//
Процедура АвтоматическийРасчетГотовности(ЭтотОбъект, Отказ, РежимПроведения, 
	ДатаДвижений = Неопределено, Знач Проект = Неопределено, НастройкиРасчета = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Проект = ЭтотОбъект.Проект;
		Если Не ЗначениеЗаполнено(Проект) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Отключение автоматического расчета требуется при свертке регистров.
	ДополнительныеСвойства = ЭтотОбъект.ДополнительныеСвойства;
	Если ДополнительныеСвойства.Свойство("ОтключитьАвтоматическийРасчетГотовности") 
		И ДополнительныеСвойства.ОтключитьАвтоматическийРасчетГотовности = Истина Тогда
		Возврат;
	КонецЕсли;
	
	мВерсия = Неопределено;
	ДополнительныеСвойства.Свойство("Версия", мВерсия);
	Если Не ЗначениеЗаполнено(мВерсия) Тогда
		мВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	СтруктураНастроекПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	
	УчитыватьТрудозатратыПриРасчетеГотовности = Неопределено;
	ИспДлитВместоПустТрудЗатДляРасчГотовности = Неопределено;
	Если ТипЗНЧ(НастройкиРасчета) = Тип("Структура") Тогда
		НастройкиРасчета.Свойство("УчитыватьТрудозатратыПриРасчетеГотовности", УчитыватьТрудозатратыПриРасчетеГотовности);
		НастройкиРасчета.Свойство("ИспДлитВместоПустТрудЗатДляРасчГотовности", ИспДлитВместоПустТрудЗатДляРасчГотовности);
	КонецЕсли;			
	Если УчитыватьТрудозатратыПриРасчетеГотовности = Неопределено Тогда	
		УчитыватьТрудозатратыПриРасчетеГотовности = Константы.упоУчитыватьТрудозатратыПриРасчетеПроцентаГотовности.Получить();
	КонецЕсли;
	Если ИспДлитВместоПустТрудЗатДляРасчГотовности = Неопределено Тогда
		ИспДлитВместоПустТрудЗатДляРасчГотовности = Константы.упоИспДлитВместоПустТрудЗатДляРасчГотовности.Получить();
	КонецЕсли;	
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекущаяВерсия"                       , мВерсия);
	Параметры.Вставить("Проект"                              , Проект);
	Параметры.Вставить("УчитыватьТрудозатратыПриРасчетеГотовности", УчитыватьТрудозатратыПриРасчетеГотовности);
	Параметры.Вставить("ИспДлитВместоПустТрудЗатДляРасчГотовности", ИспДлитВместоПустТрудЗатДляРасчГотовности);
	Параметры.Вставить("НастройкаУровняПланированияПриРасчетеГотовностиПроектов", 
		СтруктураНастроекПроекта.НастройкаУровняПланированияПриРасчетеГотовностиПроектов);
	
	ТаблицаДвиженияСтатусыПЗ 	= ЭтотОбъект.Движения.упоСтатусыПроектныхЗадач;
	ТаблицаДвиженияГотПЗ   		= ЭтотОбъект.Движения.упоПроцентыГотовностиПроектныхЗадач;
	ТаблицаДвиженияГотПроекта 	= ЭтотОбъект.Движения.упоПроцентыГотовностиПроектов;
	
	Параметры.Вставить("ТаблицаРучнойПроцентГотовности", ТаблицаРучнойПроцентГотовности(ТаблицаДвиженияГотПЗ));
	
	Если ЭтотОбъект.Движения.Найти("упоСвойстваПроектныхЗадач") <> Неопределено Тогда
		ТаблицаСвойстваПЗ   = ЭтотОбъект.Движения.упоСвойстваПроектныхЗадач.Выгрузить(,"ПроектнаяЗадача,Длительность,ЗадачаРодитель");
		Параметры.Вставить("ТаблицаСвойстваПЗ", ТаблицаСвойстваПЗ);
	КонецЕсли;

	Результат = упоАктуализацияПроектаВызовСервера.обАктуализацияГотовностиПроектныхЗадач(Параметры);
	
	Если Константы.упоАвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта.Получить() Тогда
		
		ТаблицаГотПЗ = ТаблицаДвиженияГотПЗ.Выгрузить();
		ТаблицаГотПЗ.Индексы.Добавить("ПроектнаяЗадача");
		
		ТаблицаСтатусыПЗ = ТаблицаДвиженияСтатусыПЗ.Выгрузить();
		ТаблицаСтатусыПЗ.Индексы.Добавить("ПроектнаяЗадача");
		
		Для Каждого ТекЗадача Из Результат.ДанныеЗадач Цикл
			
			Если ТипЗнч(ТекЗадача.Задача) = Тип("СправочникСсылка.Проекты") Тогда
				Продолжить;
			КонецЕсли;			
			
			// Заполняем проценты готовности проектной задачи.
			ДобавитьИзменитьСтрокуДвижений(ТаблицаГотПЗ, ЭтотОбъект, ДатаДвижений, 
				ТекЗадача.Задача, "ПроцентГотовности", ТекЗадача.Готовность, мВерсия);
				
			// Заполняем статусы проектной задачи.
			ДобавитьИзменитьСтрокуДвижений(ТаблицаСтатусыПЗ, ЭтотОбъект, ДатаДвижений, 
				ТекЗадача.Задача, "СтатусЗадачи", ТекЗадача.Статус, мВерсия);
							
		КонецЦикла;
		
		ТаблицаДвиженияГотПЗ.Загрузить(ТаблицаГотПЗ);
		ТаблицаДвиженияСтатусыПЗ.Загрузить(ТаблицаСтатусыПЗ);
				
	КонецЕсли;
	
	Движение = ТаблицаДвиженияГотПроекта.Добавить();
	Если ДатаДвижений = Неопределено Тогда
		Движение.Период = ЭтотОбъект.Дата;
	Иначе
		Движение.Период = ДатаДвижений;
	КонецЕсли;
	Движение.Версия   = мВерсия;
	Движение.Проект   = Проект;
	Движение.ПроцентГотовности = Результат.ГотовностьПроекта;

КонецПроцедуры

// Процедура рассчитывает фактические даты проектных задач и формирует движения в регистр 
// упоФактическиеДатыНачалаИОкончанияПроектныхЗадач по задачам регистра упоСтатусыПроектныхЗадач.
// При этом если документ содержит движения по регистру упоФактическиеДатыНачалаИОкончанияПроектныхЗадач, 
// то задачи этих движений будут исключены из расчета: предполагается, что они были введены вручную 
// или рассчитаны ранее.
//
// Параметры:
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак проведения документа.
// 
Процедура РасчетФактическихДатНачалаИОкончанияПроектныхЗадач(ЭтотОбъект, Отказ, ДатаДвижений = Неопределено) Экспорт
	
	тзСтатусыЗадач = ЭтотОбъект.Движения.упоСтатусыПроектныхЗадач.Выгрузить( , "Версия, ПроектнаяЗадача, СтатусЗадачи");
	Если Не ЗначениеЗаполнено(тзСтатусыЗадач) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДвиженийФактическиеДаты = ЭтотОбъект.Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач;
	РодителиЗадач = РодителиЗадачФактическихСроков(ТаблицаДвиженийФактическиеДаты);
	
	Если Не ЗначениеЗаполнено(ДатаДвижений) Тогда
		ДатаДвижений = ЭтотОбъект.Дата; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатусыЗадач", тзСтатусыЗадач);
	Запрос.УстановитьПараметр("Период", ДатаДвижений);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("РодителиПроектныхЗадач", РодителиЗадач);
	Запрос.УстановитьПараметр("ФактическиеДаты", ТаблицаДвиженийФактическиеДаты);
	
	// Привилегированный режим при проведении документов.
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФактическиеДаты.Версия КАК Версия,
	               |	ФактическиеДаты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ФактическиеДаты.ДатаНачала КАК ДатаНачала,
	               |	ФактическиеДаты.ДатаЗавершения КАК ДатаЗавершения
	               |ПОМЕСТИТЬ вт_ФактическиеДаты
	               |ИЗ
	               |	&ФактическиеДаты КАК ФактическиеДаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатусыЗадач.Версия КАК Версия,
	               |	СтатусыЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СтатусыЗадач.СтатусЗадачи КАК Статус
	               |ПОМЕСТИТЬ вт_СтатусыПЗПредварительная
	               |ИЗ
	               |	&СтатусыЗадач КАК СтатусыЗадач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РодителиПроектныхЗадач.Версия КАК Версия,
	               |	РодителиПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ вт_РодителиПроектныхЗадач
	               |ИЗ
	               |	&РодителиПроектныхЗадач КАК РодителиПроектныхЗадач
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_СтатусыПЗПредварительная.Версия КАК Версия,
	               |	вт_СтатусыПЗПредварительная.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	вт_СтатусыПЗПредварительная.Статус КАК Статус
	               |ПОМЕСТИТЬ вт_СтатусыПЗ
	               |ИЗ
	               |	вт_СтатусыПЗПредварительная КАК вт_СтатусыПЗПредварительная
	               |ГДЕ
	               |	(НЕ вт_СтатусыПЗПредварительная.ПроектнаяЗадача В
	               |						(ВЫБРАТЬ
	               |							вт_ФактическиеДаты.ПроектнаяЗадача
	               |						ИЗ
	               |							вт_ФактическиеДаты КАК вт_ФактическиеДаты)
	               |				И вт_СтатусыПЗПредварительная.Статус <> ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Запланирована)
	               |			ИЛИ вт_СтатусыПЗПредварительная.ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						вт_РодителиПроектныхЗадач.ПроектнаяЗадача
	               |					ИЗ
	               |						вт_РодителиПроектныхЗадач КАК вт_РодителиПроектныхЗадач)
	               |				И вт_СтатусыПЗПредварительная.Статус = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Запланирована))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Версия,
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСрокиПроектныхЗадачСрезПоследних.Версия КАК Версия,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан
	               |ПОМЕСТИТЬ ВТ_ПлановыеДатыПроектныхЗадач
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	               |			,
	               |			(Версия, ПроектнаяЗадача) В
	               |				(ВЫБРАТЬ
	               |					вт_СтатусыПЗ.Версия КАК Версия,
	               |					вт_СтатусыПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |				ИЗ
	               |					вт_СтатусыПЗ КАК вт_СтатусыПЗ)) КАК упоСрокиПроектныхЗадачСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.Версия КАК Версия,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачала,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершения
	               |ПОМЕСТИТЬ ВТ_ФактическиеДатыПроектныхЗадачРегистр
	               |ИЗ
	               |	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
	               |			,
	               |			(Версия, ПроектнаяЗадача) В
	               |				(ВЫБРАТЬ
	               |					вт_СтатусыПЗ.Версия КАК Версия,
	               |					вт_СтатусыПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |				ИЗ
	               |					вт_СтатусыПЗ КАК вт_СтатусыПЗ)) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	&Период КАК Период,
	               |	вт_СтатусыПЗ.Версия КАК Версия,
	               |	вт_СтатусыПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА вт_СтатусыПЗ.Статус = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Запланирована)
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		КОГДА ЕСТЬNULL(ВТ_ФактическиеДатыПроектныхЗадачРегистр.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВТ_ПлановыеДатыПроектныхЗадач.ДатаНачалаПлан
	               |		ИНАЧЕ ВТ_ФактическиеДатыПроектныхЗадачРегистр.ДатаНачала
	               |	КОНЕЦ КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА вт_СтатусыПЗ.Статус = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Запланирована)
	               |				ИЛИ вт_СтатусыПЗ.Статус = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Выполняется)
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	               |		КОГДА ЕСТЬNULL(ВТ_ФактическиеДатыПроектныхЗадачРегистр.ДатаЗавершения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВТ_ПлановыеДатыПроектныхЗадач.ДатаЗавершенияПлан
	               |		ИНАЧЕ ВТ_ФактическиеДатыПроектныхЗадачРегистр.ДатаЗавершения
	               |	КОНЕЦ КАК ДатаЗавершения
	               |ИЗ
	               |	вт_СтатусыПЗ КАК вт_СтатусыПЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлановыеДатыПроектныхЗадач КАК ВТ_ПлановыеДатыПроектныхЗадач
	               |		ПО вт_СтатусыПЗ.Версия = ВТ_ПлановыеДатыПроектныхЗадач.Версия
	               |			И вт_СтатусыПЗ.ПроектнаяЗадача = ВТ_ПлановыеДатыПроектныхЗадач.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФактическиеДатыПроектныхЗадачРегистр КАК ВТ_ФактическиеДатыПроектныхЗадачРегистр
	               |		ПО вт_СтатусыПЗ.Версия = ВТ_ФактическиеДатыПроектныхЗадачРегистр.Версия
	               |			И вт_СтатусыПЗ.ПроектнаяЗадача = ВТ_ФактическиеДатыПроектныхЗадачРегистр.ПроектнаяЗадача
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	&Период,
	               |	вт_ФактическиеДаты.Версия,
	               |	вт_ФактическиеДаты.ПроектнаяЗадача,
	               |	вт_ФактическиеДаты.ДатаНачала,
	               |	вт_ФактическиеДаты.ДатаЗавершения
	               |ИЗ
	               |	вт_ФактическиеДаты КАК вт_ФактическиеДаты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаДвиженийФактическиеДаты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДвиженийФактическиеДаты.Добавить(), Выборка);
	КонецЦикла;
	
	ТаблицаДвиженийФактическиеДаты.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РодителиЗадачФактическихСроков(ДвиженияФактическиеСроки)
	
	РодителиЗадач = Новый ТаблицаЗначений;
	РодителиЗадач.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	РодителиЗадач.Колонки.Добавить("Версия", Новый ОписаниеТипов("ДокументСсылка.упоВерсияПланаПроекта"));
	
	ТаблицаФактическиеСроки = ДвиженияФактическиеСроки.Выгрузить();
	
	Если Не ЗначениеЗаполнено(ТаблицаФактическиеСроки) Тогда
		Возврат РодителиЗадач;
	КонецЕсли;
	
	ВерсииПроектов = ТаблицаФактическиеСроки.ВыгрузитьКолонку("Версия");
	ВерсииПроектов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВерсииПроектов);
	
	ПроектныеЗадачиРодители = ПроектныеЗадачиРодители(ВерсииПроектов);
	
	Для каждого Строка Из ТаблицаФактическиеСроки Цикл
		РодительЗадачи = ПроектныеЗадачиРодители[Строка.ПроектнаяЗадача];
		
		Пока ЗначениеЗаполнено(РодительЗадачи) Цикл
			
			// Прерываем цикл, если уже добавляли родителя с его цепочкой иерархии.
			// Или если по родителю уже есть данные в движениях.
			Если РодителиЗадач.Найти(РодительЗадачи) <> Неопределено
				Или ТаблицаФактическиеСроки.Найти(РодительЗадачи) <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = РодителиЗадач.Добавить();
			НоваяСтрока.ПроектнаяЗадача = РодительЗадачи;
			НоваяСтрока.Версия = Строка.Версия;
			
			РодительЗадачи = ПроектныеЗадачиРодители[РодительЗадачи];
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат РодителиЗадач;
	
КонецФункции

Процедура ДобавитьИзменитьСтрокуДвижений(Таблица, ЭтотОбъект, ДатаДвижений, ПроектнаяЗадача, Реквизит,
	ЗначениеРеквизита, Версия)
	
	Движение = Таблица.Найти(ПроектнаяЗадача, "ПроектнаяЗадача");		
	
	Если Движение = Неопределено Тогда
		Движение = Таблица.Добавить();
		Если ДатаДвижений = Неопределено Тогда
			Движение.Период = ЭтотОбъект.Дата;
		Иначе
			Движение.Период = ДатаДвижений;
		КонецЕсли;
		Движение.Регистратор = ЭтотОбъект.Ссылка;
		Движение.Версия = Версия;
		Движение.ПроектнаяЗадача = ПроектнаяЗадача;
		Движение.Активность = Истина;
	Иначе
		Если Реквизит = "СтатусЗадачи"
			И Движение[Реквизит] = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Движение[Реквизит] = ЗначениеРеквизита;	
	
КонецПроцедуры

Функция ТаблицаРучнойПроцентГотовности(ДвиженияПроцентыГотовностиПроектныхЗадач)
	
	ТаблицаРучнойПроцентГотовности = ДвиженияПроцентыГотовностиПроектныхЗадач.Выгрузить(, 
																	"ПроектнаяЗадача, ПроцентГотовности");
				
	ТаблицаРучнойПроцентГотовности.Колонки.ПроектнаяЗадача.Имя 		= "Задача";
	ТаблицаРучнойПроцентГотовности.Колонки.ПроцентГотовности.Имя 	= "Процент";
		
	Возврат ТаблицаРучнойПроцентГотовности;
	
КонецФункции

Функция ПроектныеЗадачиРодители(ВерсииПроектов)

	ПроектныеЗадачиРодители = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&Версии)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена");
	
	Запрос.УстановитьПараметр("Версии", ВерсииПроектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПроектныеЗадачиРодители;
	КонецЕсли;	
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПроектныеЗадачиРодители.Вставить(Выборка.ПроектнаяЗадача, Выборка.ЗадачаРодитель);			
	КонецЦикла;
	
	Возврат ПроектныеЗадачиРодители;
		
КонецФункции

#КонецОбласти