
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	упоОповещенияВызовСервера.ПередЗаписьюТиповыхОповещений(ЭтотОбъект, Отказ);
	упоОбработчикиСобытийСервер.ОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
	Если НЕ ЭтоГруппа Тогда
		Для Каждого СтрокаПолучатель Из Получатели Цикл
			Если СтрокаПолучатель.Получатель <> Неопределено И СтрокаПолучатель.Получатель.Пустая() Тогда
				СтрокаПолучатель.Получатель = Неопределено;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаПараметра Из ПараметрыВыполняемогоКода Цикл
			Попытка
				Тест = Новый Структура(СтрокаПараметра.ИмяПараметра);
			Исключение
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = "ПараметрыВыполняемогоКода["+Формат(СтрокаПараметра.НомерСтроки-1, "ЧН=; ЧГ=")+"].ИмяПараметра";
				Сообщение.Текст = НСтр("ru = 'Недопустимое имя параметра в строке '")+СтрокаПараметра.НомерСтроки+".";
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено И НЕ ЭтоГруппа Тогда
		ЗаполнитьТранспортПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		упоОповещенияВызовСервера.ОбновитьРегламентныеЗаданияДетекторов(Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТранспортПоУмолчанию()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоТранспортОповещений.Ссылка КАК Транспорт,
	               |	ЛОЖЬ КАК Используется
	               |ИЗ
	               |	Справочник.упоТранспортОповещений КАК упоТранспортОповещений
	               |ГДЕ
	               |	НЕ упоТранспортОповещений.ПометкаУдаления";
	ТранспортОповещений.Загрузить(Запрос.Выполнить().Выгрузить());				   
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли