
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.упоИзменениеСоставаПодразделения.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияРуководителяПодразделения.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияСоставаПодразделения.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоПодразделения);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РесурсПодразделения") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаПоиска = "";
		Если Параметры.Свойство("СтрокаПоиска") Тогда
			СтрокаПоиска = Параметры.СтрокаПоиска;
		КонецЕсли;
		ДатаАктуальности = Неопределено;
		Параметры.Свойство("ДатаАктуальности", ДатаАктуальности); 
		
		МассивПодразделений = упоРесурсыИРолиСервер.ПолучитьМассивПодразделенийРоли(Параметры.РесурсПодразделения, 
																					СтрокаПоиска, 
																					ДатаАктуальности);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(МассивПодразделений);
		
	ИначеЕсли Параметры.Свойство("СписокПодразделений") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Параметры.СписокПодразделений;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
