&НаКлиенте
&ИзменениеИКонтроль("Записать")
Функция Расш1_Записать(ПриЗакрытии)

	Успешно = Ложь;

	Если ДоступЗакрыт Тогда
		Возврат Успешно;
	КонецЕсли;

	Если НайденаОшибкаРасчетаСроков Тогда
		ТекстОшибки = НСтр("ru = 'При расчете сроков обнаружены ошибки, запись структуры запрещена. Исправьте ошибку и попытайтесь сохранить структуру ещё раз.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат Успешно;
	КонецЕсли;

	Если ТаблицаФоновыхЗаданий.Количество() Тогда

		Если Истина Тогда			
			ТекстСообщения = НСтр("ru = 'После завершения всех заданий на пересчет сроков будет произведена запись структуры.'");			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ПопытатьсяЗаписать = Истина;
			ПопытатьсяЗаписатьИЗакрыть = ПриЗакрытии;
			Если ПопытатьсяЗаписатьИЗакрыть Тогда
				ТекстСообщения = НСтр("ru = 'Затем форма структуры будет закрыта.'");			
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			//ПоказатьОповещениеПользователя(ТекстОшибки);
		Иначе
			//ТекстОшибки = НСтр("ru = 'Запрещена запись структуры до завершения работы всех заданий на пересчет сроков. '");
			//ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;

		Возврат Успешно;

	КонецЕсли;

	// Структура хранится в дереве.
	// В дереве имеется информация о типе задачи о режиме ввода сроков и наименование.
	// Информация о текущем объекте тоже может иметься.
	// Информация о предшественниках хранится в соответствии.
	// Собственно делаю так - беру дерево и иду по нему.

	Если Модифицированность Или ЕстьРасхожденияВСроках Тогда

		ТрудовыеРесурсыРолиДанныеИзмененные = Новый Соответствие;		
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.ТрудовыеРесурсыРоли Цикл

			ДанныеТР = ПолучитьДанныеТаблицы("ТрудовыеРесурсыРоли", 
			ДанныеТЧСоответствие.ТрудовыеРесурсыРоли, 
			КлючЗначение.Ключ, 
			Истина, 
			Ложь);
			ТрудовыеРесурсыРолиДанныеИзмененные.Вставить(КлючЗначение.Ключ, ДанныеТР);	

		КонецЦикла;

		НазначенныеТрудовыеРесурсыДанныеИзмененные = Новый Соответствие;
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.НазначенныеТрудовыеРесурсы Цикл
			ДанныеНазначения = ПолучитьДанныеНазначенныеТрудовыеРесурсы(ДанныеТЧСоответствие.НазначенныеТрудовыеРесурсы, 
			КлючЗначение.Ключ, 
			Истина, 
			Ложь);
			НазначенныеТрудовыеРесурсыДанныеИзмененные.Вставить(КлючЗначение.Ключ, ДанныеНазначения);	
		КонецЦикла;

		МатериальныеРесурсыДанныеИзмененные = Новый Соответствие;
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.МатериальныеРесурсы Цикл
			ДанныеМР = ПолучитьДанныеТаблицы("МатериальныеРесурсы", 
			ДанныеТЧСоответствие.МатериальныеРесурсы, 
			КлючЗначение.Ключ, 
			Истина, 
			Ложь);
			МатериальныеРесурсыДанныеИзмененные.Вставить(КлючЗначение.Ключ, ДанныеМР);	
		КонецЦикла;

		СубпродуктыДанныеИзмененные = Новый Соответствие;
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.Субпродукты Цикл
			ДанныеСП = ПолучитьДанныеТаблицы("Субпродукты", 
			ДанныеТЧСоответствие.Субпродукты, 
			КлючЗначение.Ключ, 
			Истина, 
			Ложь);
			СубпродуктыДанныеИзмененные.Вставить(КлючЗначение.Ключ, ДанныеСП);	
		КонецЦикла;

		ПланДоходовДанныеИзмененные = Новый Соответствие;
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.ПланДоходов Цикл
			ДанныеДоходы = ПолучитьДанныеТаблицы("ПланДоходов", 
			ДанныеТЧСоответствие.ПланДоходов, 
			КлючЗначение.Ключ,
			Истина, 
			Ложь);
			ПланДоходовДанныеИзмененные.Вставить(КлючЗначение.Ключ, ДанныеДоходы);	
		КонецЦикла;

		ПланРасходовДанныеИзмененные = Новый Соответствие;
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.ПланРасходов Цикл
			ДанныеРасходы = ПолучитьДанныеТаблицы("ПланРасходов", 
			ДанныеТЧСоответствие.ПланРасходов, 
			КлючЗначение.Ключ, 
			Истина, 
			Ложь);
			ПланРасходовДанныеИзмененные.Вставить(КлючЗначение.Ключ, ДанныеРасходы);	
		КонецЦикла;

		ДвиженияДенежныхСредствДанныеИзмененые = Новый Соответствие;
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.ДвиженияДенежныхСредств Цикл
			ДанныеДДС = ПолучитьДанныеТаблицы("ДвиженияДенежныхСредств", 
			ДанныеТЧСоответствие.ДвиженияДенежныхСредств, 
			КлючЗначение.Ключ, 
			Истина, 
			Ложь);
			ДвиженияДенежныхСредствДанныеИзмененые.Вставить(КлючЗначение.Ключ, ДанныеДДС);
		КонецЦикла;

		ПричиныОтклоненийДанныеИзмененные = Новый Соответствие;
		Для Каждого КлючЗначение Из ДанныеТЧСоответствиеИзмененные.ПричиныОтклонений Цикл
			ДанныеТаблицы = ПолучитьДанныеТаблицы("ПричиныОтклонений", 
			ДанныеТЧСоответствие.ПричиныОтклонений, 
			КлючЗначение.Ключ, 
			Истина, 
			Ложь);
			ПричиныОтклоненийДанныеИзмененные.Вставить(КлючЗначение.Ключ, ДанныеТаблицы);
		КонецЦикла;

		ДанныеИзмененные = Новый Структура;
		ДанныеИзмененные.Вставить("ТрудовыеРесурсыРоли", 		ТрудовыеРесурсыРолиДанныеИзмененные);
		ДанныеИзмененные.Вставить("НазначенныеТрудовыеРесурсы", НазначенныеТрудовыеРесурсыДанныеИзмененные);
		ДанныеИзмененные.Вставить("МатериальныеРесурсы", 		МатериальныеРесурсыДанныеИзмененные);
		ДанныеИзмененные.Вставить("Субпродукты", 				СубпродуктыДанныеИзмененные);
		ДанныеИзмененные.Вставить("ПланДоходов", 				ПланДоходовДанныеИзмененные);
		ДанныеИзмененные.Вставить("ПланРасходов", 				ПланРасходовДанныеИзмененные);		
		ДанныеИзмененные.Вставить("ДвиженияДенежныхСредств", 	ДвиженияДенежныхСредствДанныеИзмененые);
		ДанныеИзмененные.Вставить("ПричиныОтклонений", 			ПричиныОтклоненийДанныеИзмененные);

		СсылкаНаОбъектТекСтроки = ПолучитьСсылкуНаОбъектТекущейСтроки();

		ОбновлятьКэшПредставленияПроектныхЗадач = Ложь;

		ИзмененныеСтроки = Неопределено;
		ЗаполнитьИзмененныеСтроки_УПФ(ИзмененныеСтроки);

		Результат = ЗаписатьСтруктуруВБазуДанных(ГлавныйПроект, 
		мКэшЗначений.ИзмененныеСтрокиДляЗаписи, 
		ДанныеИзмененные, 
		мКэшЗначений.Предшественники, 
		СоотОбъектаПоИд, 
		СоотИдПоОбъекту, 
		СоотНовойПЗ_И_Исходной, 
		РазвернутыеСтроки, 
		ОбновлятьКэшПредставленияПроектныхЗадач, 
		ПриЗакрытии, 
		ТекущийСотрудникИмеетВсеРазрешения,
		СоответствиеСотрудниковДиспетчера);

		Если Результат.Успешно Тогда

			Успешно = Истина;
			Модифицированность = Ложь;

			Если Не НеОбновлятьПослеЗаписи И Не ПриЗакрытии Тогда

				ИнициализацияПеременныхКлиента();

				мДополнительныеПараметры = Результат.ДополнительныеПараметры;

				Если Результат.ПеременныеБазы <> Неопределено Тогда
					ПослеЗагрузкиПроектаКлиент(Результат.ПеременныеБазы);
					ОбновитьКешПоказателей = Истина;
				КонецЕсли;

			Иначе

				ИнициализацияПеременныхКлиент_ДоЗаписи();

			КонецЕсли;

			Оповестить("ПриЗаписиСтруктурыПроекта", Новый Структура("Проект", ГлавныйПроект));

			ОбновитьКэшСвязанныхЭлементов(ОбновлятьКэшПредставленияПроектныхЗадач);

			// Перерасчет стоимости
			Если Результат.ЕстьИзмененияНормСтоимостиДляПересчета Тогда
				Оповещение = Новый ОписаниеОповещения("ИзмененияНормСтоимостиЗавершение", ЭтаФорма);
				ТекстВопроса = 
				НСтр("ru = 'Норма стоимости в задачах проекта была изменена. Выполнить расчет новой стоимости ролей?'");
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			КонецЕсли;

			ПерезаполнитьЗаказы_УПФ(ИзмененныеСтроки);

			УстановитьТекущуюСтрокуДереваПоОбъекту(СсылкаНаОбъектТекСтроки);

		Иначе

			Если Результат.Свойство("НетРуководителяПроекта") Тогда
				ПоказатьПредупреждение(,
				НСтр("ru = 'Проект не зарегистрирован. Перед сохранением структуры регистрация проекта обязательна!'"));
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	КонтрольДоступностиКнопокОтменыВозврата();
	#Вставка
	//{[+] ИКТ №18794 (фрагмент ДОБАВЛЕН), Новоселов, 18.06.2026 
	Если Успешно Тогда
		СохранитьВехиИЭтапы(СоотОбъектаПоИд);
	КонецЕсли;
	//[+]} ИКТ №18794
	#КонецВставки

	Возврат Успешно;

КонецФункции

//{[+] ИКТ №18794 (фрагмент ДОБАВЛЕН), Новоселов, 18.06.2026 
&НаСервере
Процедура СохранитьВехиИЭтапы(СоотОбъектаПоИд)

	ДеревоЗначений = ДанныеФормыВЗначение(ДеревоЗадач, Тип("ДеревоЗначений"));
	
	МассивСсылок = Новый Массив;	
	НайтиВехиИЭтапыРекурсиво(МассивСсылок, ДеревоЗначений.Строки, СоотОбъектаПоИд);
	ДополнительныеСвойства = Новый Структура;
	
	Для каждого Ссылка Из МассивСсылок Цикл
		
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		Документы.упоПроектнаяЗадача.ПолучитьДанныеВерсии(Неопределено, ДокументОбъект, ДополнительныеСвойства);
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НайтиВехиИЭтапыРекурсиво(ЦелевойМассив, КоллекцияСтрок, СоотОбъектаПоИд)
	
	Для Каждого Строка Из Коллекциястрок Цикл
		Если Строка.Строки.Количество() тогда
			НайтиВехиИЭтапыРекурсиво(ЦелевойМассив, Строка.Строки, СоотОбъектаПоИд);		
		КонецЕсли;
		
		Если Строка.ТипЗадачи = 5 Или Строка.ТипЗадачи = 11     // Вехи
			Или Строка.ТипЗадачи = 1 Или Строка.ТипЗадачи = 7 Тогда  // Этапы
			ЦелевойМассив.Добавить(СоотОбъектаПоИд.Получить(Строка.ИдСтроки));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//[+]} ИКТ №18794

//{[+] ИКТ №19162 (фрагмент ДОБАВЛЕН), Новоселов, 19.06.2026 Относящееся к интеграции с ДО делал Макушев, коментарии он не оставил
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьреквизитыНаФорму();  //{[+] ИКТ №19162 (фрагмент ДОБАВЛЕН), Новоселов, 19.06.2026
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()
	
	//{[+] ИКТ №19162 (фрагмент ДОБАВЛЕН), Новоселов, 19.06.2026 
	ДеревоЗначений = ДанныеФормыВЗначение(ДеревоЗадач, Тип("ДеревоЗначений"));
	Если ДеревоЗначений.Колонки.Найти("ИКТ_ЕстьПрисоединенныеФайлы") = Неопределено Тогда
		//ДеревоЗначений.Колонки.Вставить(0, "ИКТ_ЕстьПрисоединенныеФайлы", Новый ОписаниеТипов("Картинка"), "Есть прикрепленные файлы");
	//ЗначениеВДанныеФормы(ДеревоЗначений, ДеревоЗадач);
	//[+]} ИКТ №19162
	
		МассивДобавляемыхРеквизитов = Новый Массив;  
		ТипРеквизитаЧисло = Новый ОписаниеТипов("Число");
		ТипРеквизитаСтрока = Новый ОписаниеТипов("Строка");
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИКТ_ЕстьПрисоединенныеФайлы", ТипРеквизитаЧисло, "ДеревоЗадач"));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ИКТ_КоличествоФайлов", ТипРеквизитаСтрока, "ДеревоЗадач"));
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);	
		
		расш_Картинка = Элементы.Вставить("ИКТ_ЕстьПрисоединенныеФайлы", Тип("ПолеФормы"), ЭтаФорма.Элементы.ДеревоЗадачОсновные, ЭтаФорма.Элементы.ДеревоЗадачКодСДР);
		расш_Картинка.Вид = ВидПоляФормы.ПолеКартинки;
		расш_Картинка.ПутьКДанным = "ДеревоЗадач.ИКТ_ЕстьПрисоединенныеФайлы";
		расш_Картинка.КартинкаШапки = БиблиотекаКартинок.Скрепка;
		расш_Картинка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		расш_Картинка.КартинкаЗначений = БиблиотекаКартинок.КоллекцияСкрепка;
		расш_Картинка.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	КонецЕсли;
	
	//{[+] ИКТ №20078 (фрагмент ДОБАВЛЕН), Новоселов, 23.07.2026 
	НоваяКоманда = Команды.Добавить("ОткрытьФайлыПроекта");
	НоваяКоманда.Действие = "ОткрытьФайлыПроекта";
	НоваяКоманда.Подсказка = "Открыть присоединенные файлы проекта";
	
	НоваяКнопка = Элементы.Вставить("ОткрытьФайлыПроекта", Тип("КнопкаФормы"), Элементы.Группа1, Элементы.КомандаПересчитыватьГотовность);
	НоваяКнопка.ИмяКоманды = "ОткрытьФайлыПроекта";
	НоваяКнопка.Отображение = ОтображениеКнопки.Картинка;
	НоваяКнопка.Картинка = БиблиотекаКартинок.Скрепка;
	//[+]} ИКТ №20078
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	ОбойтиДеревоРекурсивно(, СоотОбъектаПоИд)
	
КонецПроцедуры

&НаСервере
Процедура ОбойтиДеревоРекурсивно(Знач КоллекцияСтрок = Неопределено,СоотОбъектаПоИд)
	Если КоллекцияСтрок = Неопределено Тогда
		ПервыйВход = Истина;
		//ДеревоЗначений = ДанныеФормыВЗначение(ДеревоЗадач, Тип("ДеревоЗначений"));
		КоллекцияСтрок = ДеревоЗадач.ПолучитьЭлементы();
	Иначе
		ПервыйВход = Ложь;
	КонецЕсли;
	Для каждого Строка Из КоллекцияСтрок Цикл
		Строка.ИКТ_ЕстьПрисоединенныеФайлы = ЕстьПрисоединенныеФайлыКСтроке(Строка.ИдСтроки,СоотОбъектаПоИд);
		//Если Строка.Строки.Количество() Тогда
			ОбойтиДеревоРекурсивно(Строка.ПолучитьЭлементы(), СоотОбъектаПоИд);
		//КонецЕсли;
	КонецЦикла;
	//Если ПервыйВход Тогда
	//	ЗначениеВРеквизитФормы(ДеревоЗначений,"ДеревоЗадач");	
	//КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
&После("ЗаполнитьЖелаемыеДатыПроизводства")
Процедура Расш1_ЗаполнитьЖелаемыеДатыПроизводства()
	ОбойтиДеревоРекурсивно(, СоотОбъектаПоИд)
КонецПроцедуры

&НаСервере
Функция ЕстьПрисоединенныеФайлыКСтроке(ИдСтроки, СоотОбъектаПоИд)
	
	СсылкаНаЗадачу = СоотОбъектаПоИд.Получить(ИдСтроки);
	Запрос = Новый Запрос("ВЫБРАТЬ 
	|	НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы
	|ИЗ
	|	РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|ГДЕ
	|	НаличиеФайлов.ОбъектСФайлами = &ОбъектСФайлами");
	Запрос.УстановитьПараметр("ОбъектСФайлами", СсылкаНаЗадачу);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() И Рез.ЕстьФайлы Тогда	
		Возврат 1;
	Иначе
		Если ТипЗнч(СсылкаНаЗадачу) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	упоЗадания.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.упоЗадания КАК упоЗадания
			|ГДЕ
			|	(ВЫРАЗИТЬ(упоЗадания.ОбъектБазы КАК Документ.упоПроектнаяЗадача)) = &ОбъектБазы");
			Запрос.УстановитьПараметр("ОбъектБазы", СсылкаНаЗадачу);
			Рез = Запрос.Выполнить().Выбрать();
			ПравилоИнтеграции = Неопределено;
			Пока Рез.Следующий() Цикл
				Если ПравилоИнтеграции = Неопределено Тогда
					Правила = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.НайтиСоздатьПодходящиеПравила(
					Рез.Ссылка);
					Если Правила.Количество() > 0 Тогда
						ПравилоИнтеграции = Правила[0];
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				Тип = ПравилоИнтеграции.ТипОбъектаДО;
				ТипВидаДокумента = ПравилоИнтеграции.ТипВидаДокумента;
				ИдентификаторВидаДокумента = ПравилоИнтеграции.ИдентификаторВидаДокумента;
				ИспользоватьЭлектронныеПодписиИС =
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьЭлектронныеЦифровыеПодписи();
				ВладелецМетаданные = Рез.Ссылка.Метаданные();
				ТипСправочникаСФайлами = ВладелецМетаданные.ПолноеИмя();
				ТипОбъектаМассив = СтрРазделить(ТипСправочникаСФайлами, ".");
				Если ТипОбъектаМассив[0] = "Справочник" Тогда
					ПредставлениеТипаВладельца = "справочника";
				ИначеЕсли ТипОбъектаМассив[0] = "Документ" Тогда
					ПредставлениеТипаВладельца = "документа";
				КонецЕсли;
				ОбъектДО = РегистрыСведений.ОбъектыИнтегрированныеС1СДокументооборотом.ДанныеОбъектаДОПоВнешнемуОбъекту(Рез.Ссылка);
				Если ОбъектДО = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ОбъектДО.ID) И ЗначениеЗаполнено(ОбъектДО.type) Тогда
					ID = ОбъектДО.ID;
					Тип = ОбъектДО.type;
				Иначе
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(ID) Тогда
					ПолучаемыеПоля = Новый Массив;
					ПолучаемыеПоля.Добавить("files");
					ПолучаемыеПоля.Добавить("documentType");
					ПолучаемыеПоля.Добавить("enabledProperties");
					ПолучаемыеПоля.Добавить("htmlView");
					ПолучаемыеПоля.Добавить("ignoreDeletionMark");
					Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
					ОбъектXDTO = ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПолучитьОбъект(
					Прокси,
					Тип,
					ID,
					ПолучаемыеПоля,
					ПравилоИнтеграции.Ссылка,
					Рез.Ссылка);
					Если ОбъектXDTO.files.Количество() Тогда
						Возврат 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ПодготовитьСоответствиеИзмененныхСрок")
Функция Расш1_ПодготовитьСоответствиеИзмененныхСрок()

	СоответствиеСтрок = Новый Соответствие;

	НайденныеСтроки = ТаблицаИзмененныеСтроки.НайтиСтроки(Новый Структура("ИзменениеСтроки", Истина));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеСтроки, 
	ТаблицаИзмененныеСтроки.НайтиСтроки(Новый Структура("Удаление", Истина)),
	Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеСтроки, 
	ТаблицаИзмененныеСтроки.НайтиСтроки(Новый Структура("ИзменениеСвязей", Истина)), 
	Истина);

	Для Каждого ОписаниеИзмененияСтроки Из НайденныеСтроки Цикл

		Если СоответствиеСтрок.Получить(ОписаниеИзмененияСтроки.ИдСтроки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		УИДСтрокиДерева = мКэшЗначений.СтрокиДерева.Получить(ОписаниеИзмененияСтроки.ИдСтроки);
		Если УИДСтрокиДерева = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СтрокаДерева = ДеревоЗадач.НайтиПоИдентификатору(УИДСтрокиДерева);

		ДанныеСтроки = упоСтруктураПроектаКлиентСервер.ПолучитьСтруктуруПараметровСтроки();
		Если СтрокаДерева.Свойство("ТрудовыеРесурсыРолиОкончательныйКоличество") Тогда
			ДанныеСтроки.Вставить("ТрудовыеРесурсыРолиОкончательныйКоличество");
		КонецЕсли; 
		Если СтрокаДерева.Свойство("ТрудовыеРесурсыРолиПредварительныйКоличество") Тогда
			ДанныеСтроки.Вставить("ТрудовыеРесурсыРолиПредварительныйКоличество");
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаДерева);

		СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
		Если СтрокаРодителя = Неопределено Тогда
			ИдСтрокиРодителя = Неопределено;
		Иначе
			ИдСтрокиРодителя = СтрокаРодителя.ИдСтроки;
			НоваяСтрока = Новый Структура;
			НоваяСтрока.Вставить("ИдСтроки", ИдСтрокиРодителя);
			НоваяСтрока.Вставить("ИдентификаторЗадания", "");
			НоваяСтрока.Вставить("ИзменениеСвязей", Ложь);
			НоваяСтрока.Вставить("ИзменениеСтроки", Истина);
			НоваяСтрока.Вставить("Удаление", Ложь);
			НайденныеСтроки.Добавить(НоваяСтрока);
		КонецЕсли;	
		ДанныеСтроки.ИдСтрокиРодителя = ИдСтрокиРодителя;

		Если ОписаниеИзмененияСтроки.ИзменениеСтроки Тогда
			СоответствиеСтрок.Вставить(ДанныеСтроки.ИдСтроки, ДанныеСтроки);		
		КонецЕсли;

	КонецЦикла;

	Возврат СоответствиеСтрок;

КонецФункции

&НаКлиенте
Процедура ПризакрытииФормыФайла(Параметр1, Параметр2) Экспорт

	ОбойтиДеревоРекурсивно(, СоотОбъектаПоИд)	

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДеревоЗадачВыбор")
Процедура Расш1_ДеревоЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекДанные = Элементы.ДеревоЗадач.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяПоля = СтрЗаменить(Поле.Имя, Элемент.Имя, "");
	#Вставка
	Если ИмяПоля = "ИКТ_ЕстьПрисоединенныеФайлы" Тогда
		Ссылка = СоотОбъектаПоИд.Получить(ТекДанные.ИдСтроки);
		Пар = Новый Структура("Ключ, ПерейтиНаФайлы", Ссылка, Истина);
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			ОткрытьФорму("Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая",Пар,,,,,Новый ОписаниеОповещения("ПризакрытииФормыФайла", 
			ЭтотОбъект, 
			Пар));
			СтандартнаяОбработка = Ложь;
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки

	ДопПараметры = Новый Структура("Валюта", мВалютаУправленческогоУчета);

	Если ТекДанные.ЭтоФантом Тогда

		СтандартнаяОбработка = Ложь;

		Ссылка = СоотОбъектаПоИд.Получить(ТекДанные.ИдСтроки);

		Если ЗначениеЗаполнено(Ссылка) Тогда

			СписокДействий = Новый СписокЗначений;
			СписокДействий.Добавить("ОткрытьЗначение", НСтр("ru = 'Открыть задачу'"));	
			СписокДействий.Добавить("ОткрытьСтруктуру", НСтр("ru = 'Показать задачу в структуре'"));

			тДополнительныеПараметры = Новый Структура("Задача", Ссылка);
			ОписаниеОповещения = Новый ОписаниеОповещения("ДеревоЗадачаВыборФантомаЗавершение", 
			ЭтотОбъект, 
			тДополнительныеПараметры);
			СписокДействий.ПоказатьВыборЭлемента(ОписаниеОповещения, 
			НСтр("ru = 'Выберите действие'"), 
			СписокДействий[0].Значение);

		КонецЕсли;

	ИначеЕсли ИмяПоля = "Связи" Или ИмяПоля = "СвязиПоНомеруСтроки" Тогда

		Если Не ЭлементДоступенДляРедактированияПолнаяПроверка(ТекДанные) Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьФормуПараметровОбъекта("Связи");
		КонецЕсли;

	ИначеЕсли ИмяПоля = "Последователи" Тогда

		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПараметровОбъекта("Последователи");

	ИначеЕсли ИмяПоля = "СвязиМеждуПроектами"  Тогда

		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПараметровОбъекта("Связи");

	ИначеЕсли Найти(ИмяПоля, "ТрудовыеРесурсыРолиПредварительный") <> 0 Тогда

		СтандартнаяОбработка = Ложь;
		ДопПараметры.Вставить("УровеньПланирования", 
		ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Предварительный"));
		ОткрытьФормуПараметровОбъекта("ТрудовыеРесурсыРоли", ДопПараметры);

	ИначеЕсли Найти(ИмяПоля, "ТрудовыеРесурсыРолиОкончательный") <> 0 Тогда	

		СтандартнаяОбработка = Ложь;
		ДопПараметры.Вставить("УровеньПланирования", 
		ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Окончательный"));
		ОткрытьФормуПараметровОбъекта("ТрудовыеРесурсыРоли", ДопПараметры);

	ИначеЕсли ИмяПоля = "НазначенныеТрудовыеРесурсы" Тогда	

		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПараметровОбъекта("НазначенныеТрудовыеРесурсы");

	ИначеЕсли ИмяПоля = "ПодчиненныйПроект" Тогда

		Если ЗначениеЗаполнено(ТекДанные.ПодчиненныйПроект) Тогда

			СтандартнаяОбработка = Ложь;

			СписокДействий = Новый СписокЗначений;
			СписокДействий.Добавить("ОткрытьСтруктуру", НСтр("ru = 'Открыть структуру проекта'"));
			СписокДействий.Добавить("ОткрытьЗначение", 	НСтр("ru = 'Открыть проект'"));
			СписокДействий.Добавить("ОчиститьЗначение", НСтр("ru = 'Очистить проект'"));

			тДополнительныеПараметры = Новый Структура;
			тДополнительныеПараметры.Вставить("Проект", ТекДанные.ПодчиненныйПроект);
			тДополнительныеПараметры.Вставить("ТекущиеДанные", ТекДанные);

			ОписаниеОповещения = Новый ОписаниеОповещения("ДеревоЗадачаВыборПодчиненногоПроектаЗавершение", 
			ЭтотОбъект, 
			тДополнительныеПараметры);
			СписокДействий.ПоказатьВыборЭлемента(ОписаниеОповещения, 
			НСтр("ru = 'Выберите действие'"), 
			СписокДействий[0].Значение);

		КонецЕсли;

	ИначеЕсли ИмяПоля = "ПланПотребностейКоличество" Тогда

		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПараметровОбъекта("МатериальныеРесурсы", ДопПараметры);

	ИначеЕсли ИмяПоля = "ПланВыпускаКоличество" Тогда

		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПараметровОбъекта("Субпродукты", ДопПараметры);

	ИначеЕсли ИмяПоля = "ПланБДРДоход" Тогда

		СтандартнаяОбработка = Ложь;
		ДопПараметры.Вставить("НаправлениеДвижения", 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"));
		ОткрытьФормуПараметровОбъекта("ПланБДРДоход", ДопПараметры);

	ИначеЕсли ИмяПоля = "ПланБДРРасход" Тогда

		СтандартнаяОбработка = Ложь;
		ДопПараметры.Вставить("НаправлениеДвижения", 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата"));
		ОткрытьФормуПараметровОбъекта("ПланБДРРасход", ДопПараметры);

	ИначеЕсли ИмяПоля = "ПланДДСПоступления" Тогда

		СтандартнаяОбработка = Ложь;
		ДопПараметры.Вставить("НаправлениеДвижения", 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление"));
		ОткрытьФормуПараметровОбъекта("ДвиженияДенежныхСредств", ДопПараметры);

	ИначеЕсли ИмяПоля = "ПланДДСВыплаты" Тогда

		СтандартнаяОбработка = Ложь;
		ДопПараметры.Вставить("НаправлениеДвижения", 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата"));
		ОткрытьФормуПараметровОбъекта("ДвиженияДенежныхСредств", ДопПараметры);

	ИначеЕсли ИмяПоля = "ЗаданиеПодразделению" Тогда

		Если ЗначениеЗаполнено(ТекДанные.ЗаданиеПодразделению) Тогда
			СтандартнаяОбработка = Ложь;
			Ссылка = СоотОбъектаПоИд.Получить(ТекДанные.ИдСтроки);
			Если ЗначениеЗаполнено(Ссылка) Тогда
				упоЗаданияКлиент.ОткрытьЗаданияПодразделениюПоЗадаче(ЭтаФорма, Ссылка);
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли ИмяПоля = "ПричиныОтклонений" Тогда

		СтандартнаяОбработка = Ложь;
		ОткрытьФормуПараметровОбъекта("ПричиныОтклонений", ДопПараметры);

	Иначе

		ПоискДопСвойства = мКэшЗначений.МассивДопСвойств.Найти(ИмяПоля);
		Если ПоискДопСвойства = Неопределено Тогда 
			Возврат;
		КонецЕсли;

		СтандартнаяОбработка = Ложь;
		Ссылка = СоотОбъектаПоИд.Получить(ТекДанные.ИдСтроки);
		Если ЗначениеЗаполнено(Ссылка) Тогда

			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Ссылка", Ссылка);

			ОткрытьФорму("ОбщаяФорма.РедактированиеДополнительныхСведений",
			ПараметрыОткрытия, , , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
//[+]} №19162

//{[+] ИКТ №20078 (фрагмент ДОБАВЛЕН), Новоселов, 23.07.2026
&НаКлиенте
Процедура ОткрытьФайлыПроекта()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВладелецФайла",						Объект.Проект);
	СтруктураПараметров.Вставить("ВыборГруппИЭлементов",				Неопределено); 
	СтруктураПараметров.Вставить("ВыборДобавлением",					Неопределено);
	СтруктураПараметров.Вставить("ДополнительныеСтруктураПараметров",	Новый Структура);
	СтруктураПараметров.Вставить("ЗаголовокФормы",						"");
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе",					Неопределено);
	СтруктураПараметров.Вставить("ЗакрыватьПриЗакрытииВладельца",		Неопределено);
	СтруктураПараметров.Вставить("КлючНазначенияИспользования"	 		"");
	СтруктураПараметров.Вставить("КлючПользовательскихНастроек",		Неопределено);
	СтруктураПараметров.Вставить("МножественныйВыбор",					Неопределено);
	СтруктураПараметров.Вставить("Отбор",								Новый Структура);
	СтруктураПараметров.Вставить("ОтображениеТаблицы",					Неопределено);
	СтруктураПараметров.Вставить("ПараметрыОтправки",					"");
	СтруктураПараметров.Вставить("ПараметрыФункциональныхОпций",		Новый Структура);
	СтруктураПараметров.Вставить("ПользовательскиеНастройки",			Неопределено);
	СтруктураПараметров.Вставить("ПростаяФорма",						Ложь);
	СтруктураПараметров.Вставить("РазрешитьВыборКорня",					Неопределено);
	СтруктураПараметров.Вставить("РежимВыбора",							Ложь);
	СтруктураПараметров.Вставить("СкрыватьВладельца",					Ложь);
	СтруктураПараметров.Вставить("ТекущаяСтрока",						Неопределено);
	СтруктураПараметров.Вставить("ТолькоПросмотр",						Ложь);
	СтруктураПараметров.Вставить("ФиксированныеНастройки",				Неопределено);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", СтруктураПараметров);

КонецПроцедуры
//[+]} ИКТ №20078
