////////////////////////////////////////////////////////////////////////////////
// Кастомизация бизнес-логики обработчиков для отдельных объектов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщиеДействияОбработчиковСобытийМодуляОбъектаСправочника

// Общие действия обработчика события ПриУстановкеНовогоКода модуля справочника.
//  Возникает в момент, когда выполняется установка нового кода элемента справочника.
//
// Параметры:
//  ЭтотОбъект			 - СправочникОбъект	 - содержит сам объект.
//  СтандартнаяОбработка - Булево			 - признак выполнения стандартной (системной) обработки события.
//  Префикс				 - Строка			 - префикс, который будет использоваться для генерации кода.
//
Процедура обСправочникОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Экспорт
	
	
КонецПроцедуры

// Общие действия обработчика события ПриКопировании модуля справочника.
//  Возникает при создании элемента справочника копированием.
//
// Параметры:
//  ЭтотОбъект			 - СправочникОбъект	 - сам объект.
//  ОбъектКопирования	 - СправочникОбъект	 - исходный элемент, который является источником копирования.
//
Процедура обСправочникОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ОбработкаЗаполнения модуля справочника.
// Возникает при вводе элемента справочника на основании, а также при выполнении метода Заполнить.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
Процедура обСправочникОбъектОбработкаЗаполнения(ЭтотОбъект, Основание) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ПередЗаписью модуля справочника.
// Возникает перед выполнением записи элемента справочника.
// Процедура-обработчик вызывается после начала транзакции записи, но до начала записи элемента справочника.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи элемента.
// 
Процедура обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъектМетаданные = ЭтотОбъект.Метаданные();
	ИмяМетаданных = ЭтотОбъектМетаданные.Имя;
	
	Если ЭтотОбъектМетаданные.Реквизиты.Найти("АвторИзменений") <> Неопределено Тогда
		Если ЭтотОбъект.ЭтоНовый() Тогда
			ЭтотОбъект.Автор = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		ЭтотОбъект.АвторИзменений = Пользователи.ТекущийПользователь();
		ЭтотОбъект.ДатаМодификации = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ИмяМетаданных = "упоПортфелиПроектов" ИЛИ ИмяМетаданных = "упоПрограммыПроектов" Тогда 
		
		ЭтоPM_Проф = упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф();
		
		Если НЕ ЭтотОбъект.ЭтоГруппа И Не ЭтоPM_Проф Тогда
			
			Если Не ЗначениеЗаполнено(ЭтотОбъект.ПроектСтруктуры) Тогда
				
				ЭтотОбъект.ДополнительныеСвойства.Вставить("НужноСоздатьЗеркальныйПроект");
				
				Если ЭтотОбъект.ЭтоНовый() Тогда
					СсылкаНаПортфельПрограмму = ЭтотОбъект.ПолучитьСсылкуНового();
					Если СсылкаНаПортфельПрограмму.Пустая() Тогда
						// Если ссылка установлена ранее, то она будет битая, но не пустая.
						// Если ссылка не была установлена - она будет пустая.
						СсылкаНаПортфельПрограмму = Справочники[ИмяМетаданных].ПолучитьСсылку();
						ЭтотОбъект.УстановитьСсылкуНового(СсылкаНаПортфельПрограмму);
					КонецЕсли;
				Иначе
					СсылкаНаПортфельПрограмму = ЭтотОбъект.Ссылка;
				КонецЕсли;
				
				УстановитьПривилегированныйРежим(Истина);
				НовыйПроект = Справочники.Проекты.СоздатьЭлемент();
				НовыйПроект.Наименование = ЭтотОбъект.Наименование;
				НовыйПроект.Заполнить(СсылкаНаПортфельПрограмму);
				НовыйПроект.Записать();
				УстановитьПривилегированныйРежим(Ложь);
				
				ЭтотОбъект.ПроектСтруктуры = НовыйПроект.Ссылка;
				
			ИначеЕсли НЕ ЭтотОбъект.ЭтоНовый() Тогда
				
				СинхронизироватьПометкуУдаления(ЭтотОбъект.ПометкаУдаления, ЭтотОбъект.ПроектСтруктуры);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Общие действия обработчика события ПриЗаписи модуля справочника.
// Возникает при записи объекта.
// Процедура-обработчик вызывается после записи объекта в базу данных, но до окончания транзакции записи. 
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи.
// 
Процедура обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ПередУдалением модуля справочника.
// Возникает перед непосредственным удалением объекта из базы данных.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
Процедура обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеДействияОбработчиковСобытийМодуляОбъектаДокумента

// Общие действия обработчика события ПриУстановкеНовогоНомера модуля документа.
//  Возникает в момент, когда выполняется установка нового номера документа.
//
// Параметры:
//  ЭтотОбъект			 - СправочникОбъект	 - содержит сам объект.
//  СтандартнаяОбработка - Булево			 - признак выполнения стандартной (системной) обработки события.
//  Префикс				 - Строка			 - префикс, который будет использоваться для генерации номера.
//
Процедура обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ПриКопировании модуля документа.
//  Возникает при создании документа копированием.
//
// Параметры:
//  ЭтотОбъект			 - ДокументОбъект	 - содержит сам объект.
//  ОбъектКопирования	 - ДокументОбъект	 - исходный документ, который является источником копирования
//
Процедура обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования) Экспорт
	
	Если ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.упоПрогнозТрудозатратПоРолям") 
		Или ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.упоПланированиеТрудозатратПоТрудовымРесурсам") Тогда 
		
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("НеУдалятьОтмененныеПЗПриКопировании") Тогда
			УдалитьОтмененныеПЗПриКопировании(ЭтотОбъект);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

// Общие действия обработчика события ОбработкаЗаполнения модуля документа.
// Возникает при вводе документа на основании, а также при выполнении метода Заполнить.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ПередЗаписью модуля документа.
// Возникает перед выполнением записи объекта.
// Процедура-обработчик вызывается после начала транзакции записи, но до начала записи документа.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не Отказ Тогда		
		Если ЭтотОбъект.Метаданные().Реквизиты.Найти("АвторИзменений") <> Неопределено Тогда		
			Если ЭтотОбъект.ЭтоНовый() Тогда
				ЭтотОбъект.Автор = Пользователи.ТекущийПользователь();		
			КонецЕсли;
			
			ЭтотОбъект.АвторИзменений = Пользователи.ТекущийПользователь();
			ЭтотОбъект.ДатаМодификации = ТекущаяДатаСеанса();		
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;    
	КонецЕсли; 
	
	ВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	Если Не ЗначениеЗаполнено(ВалютаУправленческогоУчета) Тогда
		ОбщегоНазначения.СообщитьПользователю(Нстр("ru = 'Не заполнена валюта управленческого учета!'"));		
		Отказ = Истина;
	КонецЕсли;	
	 
КонецПроцедуры

// Общие действия обработчика события ПриЗаписи модуля документа.
// Возникает при записи объекта.
// Процедура-обработчик вызывается после записи объекта в базу данных, но до окончания транзакции записи. 
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
// 
Процедура обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ПередУдалением модуля документа.
// Возникает перед непосредственным удалением объекта из базы данных.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
Процедура обДокументОбъектПередУдалением(ЭтотОбъект, Отказ) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ОбработкаПроведения модуля документа.
// Возникает при проведении документа.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Экспорт
	
	Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);
	
	Если НЕ	(ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ЭтотОбъект.ДополнительныеСвойства.НеПроверятьРазграничениеДоступа)
		И Не (ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтложенноеПроведение")) Тогда 
		// Вызываем общую процедуру проверки
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, 
																			РежимЗаписиДокумента.Проведение, 
																			Отказ, 
																			Заголовок, 
																			Истина);
	КонецЕсли;
	
	Если Не (ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый) Тогда
		упоПроведениеДокументовВызовСервера.обУдалитьДвиженияДокумента(Отказ, ЭтотОбъект);
	КонецЕсли;
			
	ПроверитьДокументНаОтмененныеПЗ(ЭтотОбъект, Отказ);
	
	// Получаем полный слепок документа
	ДанныеДокумента = упоПроведениеДокументовВызовСервера.обПолучитьДанныеДокумента(ЭтотОбъект);
		
	// Вызываем общую процедуру проверки
	упоПроведениеДокументовВызовСервера.обПроверитьДанныеДокумента(ЭтотОбъект, ДанныеДокумента, Отказ, РежимПроведения, Заголовок);
	
	// Вызываем универсальный генератор движений по регистрам
	упоПроведениеДокументовВызовСервера.обПровестиДокументПоРегистрам(ЭтотОбъект, ДанныеДокумента, Отказ, РежимПроведения);
		
КонецПроцедуры

// Общие действия обработчика события ОбработкаУдаленияПроведения модуля документа.
// Возникает при отмене проведения документа.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отмены проведения документа.
// 
Процедура обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Экспорт
	
	Представление = СокрЛП(ЭтотОбъект.Ссылка);	
	Заголовок = НСтр("ru = 'Операция отмены проведения документа ""%1"" не выполнена:'");
	Заголовок = СтрЗаменить(Заголовок, "%1", Представление); 	
		
	Если НЕ	(ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ЭтотОбъект.ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		// Вызываем общую процедуру проверки.
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, РежимЗаписиДокумента.ОтменаПроведения, Отказ, Заголовок, Истина);
	КонецЕсли;
		
	упоПроведениеДокументовВызовСервера.обУдалитьДвиженияДокумента(Отказ, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеДействияОбработчиковСобытийМодуляНабораЗаписейРегистраСведений

// Общие действия обработчика события ПередЗаписью модуля набора записей.
// Возникает перед выполнением записи набора регистра сведений.
// Процедура-обработчик вызывается после начала транзакции записи,
// но до начала записи набора регистра сведений.
// 
// Параметры: 
//  ЭтотОбъект   - РегистрСведенийНаборЗаписей - содержит сам набор записей.
//  Отказ        - Булево - признак отказа от записи набора регистра сведений.
//  Замещение    - Булево - Режим записи набора.
//                 Истина - запись осуществляется с заменой
//                 существующих в базе данных записей набора.
//                 Ложь - запись осуществляется с "дописыванием"
//                 текущего набора записей.
// 
// 
Процедура обРегистрСведенийНаборЗаписейПередЗаписью(ЭтотОбъект, Отказ, Замещение) Экспорт
	
КонецПроцедуры

// Общие действия обработчика события ПриЗаписи модуля набора записей.
// Возникает при записи объекта.
// Процедура-обработчик вызывается после записи объекта в базу данных,
// но до окончания транзакции записи. 
// 
// Параметры: 
//  ЭтотОбъект   - РегистрСведенийНаборЗаписей - содержит сам набор записей.
//  Отказ        - Булево - признак отказа от записи набора в базу данных.
//  Замещение    - Булево - Режим записи набора.
//                 Истина - запись осуществляется с заменой
//                 существующих в базе данных записей набора.
//                 Ложь - запись осуществляется с "дописыванием"
//                 текущего набора записей.
// 
Процедура обРегистрСведенийНаборЗаписейПриЗаписи(ЭтотОбъект, Отказ, Замещение) Экспорт
	
	Если ТипЗНЧ(ЭтотОбъект) = Тип("РегистрСведенийНаборЗаписей.упоЗаданияСтатусы") Тогда
		
		ОбновитьСтатусыПроектнойПродукцииПриИзмененииСтатусаЗаданий(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновить пометку удаления у основного проекта программы или портфеля.
//
Процедура СинхронизироватьПометкуУдаления(ПометкаУдаления, ПроектСтруктуры)
	
	Если ПометкаУдаления <> ПроектСтруктуры.ПометкаУдаления Тогда
		ПроектСтруктурыОбъект = ПроектСтруктуры.ПолучитьОбъект();
		ПроектСтруктурыОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьОтмененныеПЗПриКопировании(ЭтотОбъект)
			
	Отбор = Новый Структура("ПроектнаяЗадачаЗеркало");
	
	ОтмененныеПЗ = НайтиОтмененныеПЗ(ЭтотОбъект.Данные.ВыгрузитьКолонку("ПроектнаяЗадачаЗеркало"));
	Для Каждого ОтмененнаяПЗ Из ОтмененныеПЗ Цикл	
		
		Отбор.ПроектнаяЗадачаЗеркало = ОтмененнаяПЗ;
		НайденныеСтроки = ЭтотОбъект.Данные.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЭтотОбъект.Данные.Удалить(НайденнаяСтрока);	
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиОтмененныеПЗ(ПроектныеЗадачи)
	
	ОтмененныеПЗ = Новый Массив;
		
	Если Не ПроектныеЗадачи.Количество() Тогда
		Возврат ОтмененныеПЗ;
	КонецЕсли;	
		
	ЭтоЗеркала = ТипЗнч(ПроектныеЗадачи[0]) = Тип("СправочникСсылка.Проекты");
	
	Если ЭтоЗеркала Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Проекты.Ссылка КАК ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		               |			,
		               |			ПроектнаяЗадача В
		               |				(ВЫБРАТЬ
		               |					Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу
		               |				ИЗ
		               |					Справочник.Проекты КАК Проекты
		               |				ГДЕ
		               |					Проекты.Ссылка В (&ПроектныеЗадачи))) КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		               |			И (упоВерсииПроекта.Текущая)
		               |			И (упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу";
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		               |			И (упоВерсииПроекта.Текущая)
		               |			И (упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	
	Результат = Запрос.Выполнить();	
	Если Не Результат.Пустой() Тогда
		ОтмененныеПЗ = Результат.Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
	КонецЕсли;	
	
	Возврат ОтмененныеПЗ;
	
КонецФункции	

Процедура ПроверитьДокументНаОтмененныеПЗ(ЭтотОбъект, Отказ) Экспорт
	
	Если ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.упоПрогнозТрудозатратПоРолям") 
		Или ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.упоПланированиеТрудозатратПоТрудовымРесурсам") Тогда 
		
		ПроектныеЗадачи = ЭтотОбъект.Данные.ВыгрузитьКолонку("ПроектнаяЗадачаЗеркало");
		
	Иначе
		Возврат;
	КонецЕсли;
		
	ОтмененныеПЗ = НайтиОтмененныеПЗ(ПроектныеЗадачи);

	Если Не ОтмененныеПЗ.Количество() Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтоЗеркала = ТипЗнч(ОтмененныеПЗ[0]) = Тип("СправочникСсылка.Проекты");
	
	ШаблонСообщения = НСтр("ru = 'Проектная задача ""%1"" (%2) отменена.'");
	ТекстыОшибок = Новый Массив;
	
	Для Каждого ОтмененнаяПЗ Из ОтмененныеПЗ Цикл
		
		СвязанныйЭлемент = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(ОтмененнаяПЗ);		
		Если ЭтоЗеркала Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
				ОтмененнаяПЗ, СвязанныйЭлемент);
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
				СвязанныйЭлемент, ОтмененнаяПЗ);
		КонецЕсли;					
		ТекстыОшибок.Добавить(ТекстСообщения);		
			
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(ТекстыОшибок, Символы.ПС),,,, Отказ);
	
КонецПроцедуры	

Процедура ОбновитьСтатусыПроектнойПродукцииПриИзмененииСтатусаЗаданий(ЭтотОбъект)
	
	Если Не упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект) Тогда
		Задания = ЭтотОбъект.ВыгрузитьКолонку("Задание");
		МодульупоПроектнаяПродукция = ОбщегоНазначения.ОбщийМодуль("упоПроектнаяПродукция");
		МодульупоПроектнаяПродукция.ОбновитьСтатусыПроектнойПродукцииПриИзмененииСтатусаЗаданий(Задания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

