#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыФормы = ПолучитьРеквизиты("");	
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		Если Параметры.Свойство(РеквизитФормы.Имя) Тогда
			ЭтаФорма[РеквизитФормы.Имя] = Параметры[РеквизитФормы.Имя];
		КонецЕсли;
	КонецЦикла;
	
	ДатаСтарта = МинимальнаяДатаСтарта;
	Если КоличествоЧасовПоРоли <> 0 Тогда
		ДоляТрудозатрат = 100* КоличествоЧасов / КоличествоЧасовПоРоли;	
	Иначе
		ДоляТрудозатрат = 0;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДоляТрудозатратПриИзменении(Элемент)
	КоличествоЧасов = КоличествоЧасовПоРоли * ДоляТрудозатрат / 100; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВОчередьПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаСтартаПриИзменении(Элемент)
	Если ДатаСтарта < МинимальнаяДатаСтарта Тогда
		ДатаСтарта = МинимальнаяДатаСтарта;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЧасовПриИзменении(Элемент)
	Если КоличествоЧасовПоРоли <> 0 Тогда
		ДоляТрудозатрат = 100* КоличествоЧасов / КоличествоЧасовПоРоли;	
	Иначе
		ДоляТрудозатрат = 0;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНазначить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВыборПараметровНазначения");
	Результат.Вставить("ДобавитьВОчередь", ДобавитьВОчередь);
	Результат.Вставить("ДатаСтарта", ДатаСтарта);
	Результат.Вставить("КоличествоЧасов", КоличествоЧасов);
	Результат.Вставить("ТрудовойРесурс", ТрудовойРесурс);
	Результат.Вставить("УИДСтрокиЗадачи", УИДСтрокиЗадачи);
	Результат.Вставить("ПрофильРаспределения", ПрофильРаспределения);
	Результат.Вставить("РаспределятьНаПериодПланирования", РаспределятьНаПериодПланирования);
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементов(ЭтаФорма) 
	
	Элементы = ЭтаФорма.Элементы;
	Элементы.ПрофильРаспределения.Видимость = НЕ ЭтаФорма.ДобавитьВОчередь;
	Элементы.Группа3.Видимость = НЕ ЭтаФорма.ДобавитьВОчередь;
	Элементы.РаспределятьНаПериодПланирования.Видимость = НЕ ЭтаФорма.ДобавитьВОчередь;
	Элементы.ДоляТрудозатрат.Видимость = НЕ ЭтаФорма.ДобавитьВОчередь;
	
КонецПроцедуры

#КонецОбласти
