#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка,,Ложь);	
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИнициализацияФормы();
	КонецЕсли;	
			
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	РазвернутьСтрокиДереваПротоколы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);

	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
	КонецЕсли;	
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Проект) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СозданиеНовогоПроекта", Истина);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ТекущийОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		ОбновитьНадписьПроект();	
		ОбновитьКартинкуПроекта();
	КонецЕсли;	
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("СозданиеНовогоПроекта") 
		И ТекущийОбъект.ДополнительныеСвойства.СозданиеНовогоПроекта
		И ЗначениеЗаполнено(ТекущийОбъект.Проект) Тогда
		
		ШаблонСообщения = НСтр("ru = 'По заявке ""%1"" создан новый проект ""%2"".'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущийОбъект, ТекущийОбъект.НаименованиеПроекта);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения)
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ИнициализацияФормы();

КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Протоколы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если Поле.Имя = "ПротоколыПротокол" И ТекущиеДанные.ЭтоПротокол Тогда
		
		ПоказатьЗначение(, ТекущиеДанные.Протокол);
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПроектНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	упоУправлениеФормамиКлиент.НадписьДокументОснованиеНажатие(Объект, ЭтаФорма, "Проект");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПротоколы(Команда)
	
	ЗаполнитьПротоколыНаСервере();
	
	РазвернутьСтрокиДереваПротоколы();
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура РазвернутьСтрокиДереваПротоколы()
	
	ЭлементыДерева = ДеревоПротоколы.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Элементы.Протоколы.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПротоколыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("СтатусЗавершено", Перечисления.упоСтатусыЗаданий.Завершено);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПроектыФазы.НомерСтроки КАК НомерСтроки,
	               |	ПроектыФазы.Фаза КАК Фаза,
	               |	ПроектыФазы.ВехаЗеркало КАК ВехаЗеркало
	               |ПОМЕСТИТЬ втФазы
	               |ИЗ
	               |	Справочник.Проекты.Фазы КАК ПроектыФазы
	               |ГДЕ
	               |	ПроектыФазы.Ссылка = &Проект
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ВехаЗеркало
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗадания.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоЗадания.Ссылка КАК ПР,
	               |	упоЗадания.Исполнитель КАК Исполнитель,
	               |	упоСрокиЗаданий.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус,
	               |	упоЗадания.ЭтоОсновноеЗаданиеПроектнойЗадачи КАК Основное,
	               |	упоЗадания.ОбъектБазы КАК ОбъектБазы
	               |ПОМЕСТИТЬ Задания
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
	               |		ПО (упоЗаданияСтатусыСрезПоследних.Задание = упоЗадания.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	               |		ПО упоЗадания.Ссылка = упоСрокиЗаданий.Задание
	               |ГДЕ
	               |	упоЗадания.ВидЗадания = ЗНАЧЕНИЕ(Справочник.упоВидыЗаданий.ПроектноеРешение)
	               |	И упоЗадания.ПроектнаяЗадача В
	               |			(ВЫБРАТЬ
	               |				втФазы.ВехаЗеркало КАК ВехаЗеркало
	               |			ИЗ
	               |				втФазы КАК втФазы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Задания.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Задания.ПР КАК ПР,
	               |	Задания.Исполнитель КАК Исполнитель,
	               |	Задания.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	Задания.Статус КАК Статус,
	               |	Задания.Основное КАК Основное,
	               |	ЕСТЬNULL(Статусы.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияФакт,
	               |	Задания.ОбъектБазы КАК ОбъектБазы
	               |ПОМЕСТИТЬ втПроектныеРешенияФаз
	               |ИЗ
	               |	Задания КАК Задания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних(, Статус = &СтатусЗавершено) КАК Статусы
	               |		ПО Задания.ПР = Статусы.Задание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втФазы.Фаза КАК Фаза,
	               |	втПроектныеРешенияФаз.ПР КАК ПроектноеРешение,
	               |	втПроектныеРешенияФаз.ОбъектБазы КАК ПроектнаяЗадача,
	               |	Проекты.Ссылка КАК ПроектнаяЗадачаЗеркало,
	               |	втФазы.НомерСтроки КАК НомерСтроки,
	               |	втПроектныеРешенияФаз.Основное КАК Основное,
	               |	втПроектныеРешенияФаз.Статус КАК Статус,
	               |	втПроектныеРешенияФаз.ДатаОкончанияФакт КАК ДатаОкончанияФакт,
	               |	втПроектныеРешенияФаз.ДатаОкончанияПлан КАК ДатаОкончанияПлан
	               |ПОМЕСТИТЬ ФазыИПроектныеРешения
	               |ИЗ
	               |	втФазы КАК втФазы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втПроектныеРешенияФаз КАК втПроектныеРешенияФаз
	               |		ПО втФазы.ВехаЗеркало = втПроектныеРешенияФаз.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО (втПроектныеРешенияФаз.ОбъектБазы = Проекты.СсылкаНаПроектнуюЗадачу)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ФазыИПроектныеРешения.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало
	               |ИЗ
	               |	ФазыИПроектныеРешения КАК ФазыИПроектныеРешения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФазыИПроектныеРешения.Фаза КАК Фаза,
	               |	ФазыИПроектныеРешения.ПроектноеРешение КАК ПроектноеРешение,
	               |	ФазыИПроектныеРешения.ПроектнаяЗадача КАК ПроектнаяЗадача,
				   |	ФазыИПроектныеРешения.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало
	               |ИЗ
	               |	ФазыИПроектныеРешения КАК ФазыИПроектныеРешения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФазыИПроектныеРешения.НомерСтроки,
	               |	ФазыИПроектныеРешения.Основное,
	               |	ФазыИПроектныеРешения.Статус,
	               |	ФазыИПроектныеРешения.ДатаОкончанияФакт,
	               |	ФазыИПроектныеРешения.ДатаОкончанияПлан
	               |ИТОГИ ПО
	               |	Фаза,
	               |	ПроектноеРешение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПоказателиПроектов.Ссылка КАК Показатель,
	               |	упоПоказателиПроектов.ПолноеНаименование КАК НаименованиеПоказателя
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	               |ГДЕ
	               |	упоПоказателиПроектов.ПоказательИнвестирования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НаименованиеПоказателя";
			
	Результат = Запрос.ВыполнитьПакет();		
	Если Результат[Результат.ВГраница() - 1].Пустой() Тогда		
		ДеревоПротоколы.ПолучитьЭлементы().Очистить();
		Возврат;
	КонецЕсли;	
	
	ДеревоФормы = Результат[Результат.ВГраница() - 1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоФормы.Колонки.Добавить("Протокол");
	ДеревоФормы.Колонки.Добавить("ЭтоПротокол");
	ДеревоФормы.Колонки.Добавить("Значение");			
	ДеревоФормы.Колонки.Добавить("Показатель");			
	ДеревоФормы.Колонки.Добавить("НаименованиеПоказателя");			
	
	Показатели = Результат[Результат.ВГраница()].Выгрузить();
	ВехиЗеркало = Результат[Результат.ВГраница() - 2].Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадачаЗеркало");
	ЗначенияПоказателейВех =
		упоПоказателиПроектовСервер.ПолучитьЗначенияПоказателей(Показатели.ВыгрузитьКолонку("Показатель"), ВехиЗеркало);
	
	ОбработатьДеревоПротоколыРекурсивно(ДеревоФормы.Строки, Показатели, ЗначенияПоказателейВех);
	
	ЗначениеВРеквизитФормы(ДеревоФормы, "ДеревоПротоколы");		
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьКартинкуПроекта()
	
	ОтображатьКартинку = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		ФайлСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Проект, "упоКартинкаПроекта");
						
		Если ЗначениеЗаполнено(ФайлСсылка) Тогда			
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(ФайлСсылка);				
			КартинкаПроекта = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;		
			ОтображатьКартинку = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
	Элементы.КартинкаПроекта.Видимость = ОтображатьКартинку;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ОбработатьДеревоПротоколыРекурсивно(СтрокиДерева, Показатели, ЗначенияПоказателейВех)
	
	СтрокиКУдалению = Новый Массив;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		СтрокаКУдалению = Ложь;
		ПротоколРодитель = Неопределено;
		Если СтрокаДерева.Родитель <> Неопределено Тогда
			ПротоколРодитель = СтрокаДерева.Родитель.Протокол;
		КонецЕсли;	
		
		Если ТипЗНЧ(СтрокаДерева.Протокол) = Тип("СправочникСсылка.упоПоказателиПроектов") Тогда
			Продолжить;			
		ИначеЕсли ТипЗнч(ПротоколРодитель) = Тип("СправочникСсылка.упоФазыПроектов") Тогда	
			Если ЗначениеЗаполнено(СтрокаДерева.ПроектноеРешение) Тогда
				СтрокаДерева.Протокол = СтрокаДерева.ПроектноеРешение;		
				СтрокаДерева.ЭтоПротокол = Истина;
			Иначе
				СтрокаКУдалению = Истина;
				СтрокиКУдалению.Добавить(СтрокаДерева);
			КонецЕсли;			
		ИначеЕсли ТипЗнч(ПротоколРодитель) = Тип("СправочникСсылка.упоЗадания") Тогда
			СтрокаКУдалению = Истина;
			СтрокиКУдалению.Добавить(СтрокаДерева);
									
			Для Каждого СтрокаТаблицыПоказатели Из Показатели Цикл
				Значение = упоПоказателиПроектовСервер.ПолучитьЗначениеПоказателяПроекта(ЗначенияПоказателейВех,
					СтрокаТаблицыПоказатели.Показатель, СтрокаДерева.ПроектнаяЗадачаЗеркало);
				Если ЗначениеЗаполнено(Значение) Тогда
					СтрокаПоказатель = СтрокиДерева.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПоказатель, СтрокаДерева, , "Родитель");
					СтрокаПоказатель.Показатель = СтрокаТаблицыПоказатели.Показатель;
					СтрокаПоказатель.Протокол = СтрокаТаблицыПоказатели.Показатель;
					СтрокаПоказатель.Значение = Значение;
					СтрокаПоказатель.НаименованиеПоказателя = СтрокаТаблицыПоказатели.НаименованиеПоказателя;
				КонецЕсли;	
			КонецЦикла;							
		Иначе
			СтрокаДерева.Протокол = СтрокаДерева.Фаза;
		КонецЕсли;
		
		Если НЕ СтрокаКУдалению Тогда
			ОбработатьДеревоПротоколыРекурсивно(СтрокаДерева.Строки, Показатели, ЗначенияПоказателейВех);		
		КонецЕсли;	
				
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		СтрокиДерева.Удалить(СтрокаКУдалению);	
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
		
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("СправочникСсылка.Проекты") Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(ВыбранноеЗначение);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	ЗаполнитьПротоколыНаСервере();
	
	ОбновитьКартинкуПроекта();
	
	ОбновитьНадписьПроект();
	
	ЭтаФорма.Модифицированность = Истина;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьПроект()
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	Элементы.НаименованиеПроекта.Видимость = НЕ ЗначениеЗаполнено(Объект.Проект);
	Элементы.НаименованиеПроекта.АвтоОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.Проект);
		
КонецПроцедуры	

&НаСервере
Процедура ИнициализацияФормы()
	
	ОбновитьНадписьПроект();
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ЗаполнитьПротоколыНаСервере();								
	КонецЕсли;
	
	ОбновитьКартинкуПроекта();		
	
КонецПроцедуры

#КонецОбласти
