#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета = "СводныйСтатус";
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		ТабличныйДокумент = ПечатьСводныйСтатусПроектов(МассивОбъектов, ОбъектыПечати);
		СинонимМакета = НСтр("ru = 'Сводный статус'");
		ПолныйПутьКМакету = ПолныйПутьКМакету("ПФ_MXL_СводныйСтатус");
	
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			СинонимМакета,
			ТабличныйДокумент,
			,
			ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	 // Сводный статус
	 КомандаПечати = КомандыПечати.Добавить();
	 КомандаПечати.МенеджерПечати = "Документ.упоСводныйСтатусОтчетПоПроектам";
	 КомандаПечати.Идентификатор = "СводныйСтатус";
	 КомандаПечати.Представление = НСтр("ru = 'Сводный статус'");
	 КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Функция ПолныйПутьКМакету(ИмяМакета)
	
	ПолныйПутьКМакету = СтрШаблон("Документ.упоСводныйСтатусОтчетПоПроектам.%1", ИмяМакета);
	
	Возврат ПолныйПутьКМакету;
	
КонецФункции

Функция МакетПечатнойФормы(ИмяМакета)
	
	ПолныйПутьКМакету = ПолныйПутьКМакету(ИмяМакета);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолныйПутьКМакету);
	
	Возврат Макет;
	
КонецФункции

Функция ПечатьСводныйСтатусПроектов(МассивОбъектов, ОбъектыПечати = Неопределено) Экспорт 

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_СводныйСтатус";
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСправа = 0;
	
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу = 0;
	
	///////////////////////////////////////////////////////////////
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Ссылка КАК Ссылка,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект.ПортфельПроектов КАК ПортфельПроектов,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект.ПрограммаПроектов КАК ПрограммаПроектов,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект КАК Проект,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект.ПортфельПроектов.Наименование КАК ПортфельПроектовНаименование,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект.ПрограммаПроектов.Наименование КАК ПрограммаПроектовНаименование,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект.Наименование КАК ПроектНаименование
	               |ИЗ
	               |	Документ.упоСводныйСтатусОтчетПоПроектам.Проекты КАК упоСводныйСтатусОтчетПоПроектамПроекты
	               |ГДЕ
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Ссылка В(&Ссылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПортфельПроектовНаименование,
	               |	ПрограммаПроектовНаименование,
	               |	ПроектНаименование
	               |ИТОГИ ПО
	               |	Ссылка,
	               |	ПортфельПроектов,
	               |	ПрограммаПроектов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Ссылка КАК Ссылка,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Фаза.Наименование КАК Фаза,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект КАК Проект,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Статус КАК Статус,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Сроки КАК Сроки,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Ресурсы КАК Ресурсы,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Бюджеты КАК Бюджеты,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Риски КАК Риски,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.КураторПроекта КАК КураторПроекта,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.РуководительПроекта КАК РуководительПроекта,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Объект КАК Объект,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Комментарий КАК Комментарий,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Ссылка.Номер КАК СсылкаНомер,
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Проект.Код КАК Код
	               |ИЗ
	               |	Документ.упоСводныйСтатусОтчетПоПроектам.Проекты КАК упоСводныйСтатусОтчетПоПроектамПроекты
	               |ГДЕ
	               |	упоСводныйСтатусОтчетПоПроектамПроекты.Ссылка В(&Ссылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СсылкаНомер,
	               |	Фаза
	               |ИТОГИ ПО
	               |	Ссылка,
	               |	Фаза
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Ссылка КАК Ссылка,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Проект КАК Проект,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Родитель КАК Родитель,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Уровень КАК УровеньДерева,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ЗадачаПредставление КАК ЗадачаПредставление,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ЗадачаСсылка КАК ЗадачаСсылка,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.КодСДР КАК КодСДР,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.СтатусЗадачи КАК Статус,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Сроки КАК Сроки,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Ресурсы КАК Ресурсы,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Бюджеты КАК Бюджеты,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Риски КАК Риски,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ПроцентВыполненияЗадачи КАК ПроцентВыполненияЗадачи,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ПроцентДинамики КАК ПроцентДинамики,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Ответственный КАК Ответственный,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Комментарий КАК Комментарий,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.ИндексКартинки КАК ИндексКартинки,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Ссылка.Номер КАК Номер,
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Проект.Наименование КАК ПроектНаименование
	               |ИЗ
	               |	Документ.упоСводныйСтатусОтчетПоПроектам.Задачи КАК упоСводныйСтатусОтчетПоПроектамЗадачи
	               |ГДЕ
	               |	упоСводныйСтатусОтчетПоПроектамЗадачи.Ссылка В(&Ссылка)
	               |	И НЕ упоСводныйСтатусОтчетПоПроектамЗадачи.ЗадачаСсылка.НеВыводитьВСтатусОтчет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер,
	               |	ПроектНаименование,
	               |	УровеньДерева,
	               |	КодСДР";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаГруппы = ПакетЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДокументы = ПакетЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	тЗадачи = ПакетЗапроса[2].Выгрузить();
	
	тПроекты = ПакетЗапроса[1].Выгрузить();
	тПроекты.Очистить();
	
	/////////////////////////////////////////////////////////////// 
	Макет = МакетПечатнойФормы("ПФ_MXL_СводныйСтатус");
	
	СтруктураОбластей = Новый Структура; 
	СтруктураОбластей.Вставить("Заголовок", Макет.ПолучитьОбласть("Заголовок") );
	СтруктураОбластей.Вставить("ШапкаСводПоПроектам", Макет.ПолучитьОбласть("ШапкаСводПоПроектам"));
	СтруктураОбластей.Вставить("ГруппировкаСводПоПроектам", Макет.ПолучитьОбласть("ГруппировкаСводПоПроектам"));
	СтруктураОбластей.Вставить("СтрокаСводПоПроектам", Макет.ПолучитьОбласть("СтрокаСводПоПроектам"));
	СтруктураОбластей.Вставить("ШапкаКраткийСтатусПроекта", Макет.ПолучитьОбласть("ШапкаКраткийСтатусПроекта"));
	СтруктураОбластей.Вставить("СтрокаКраткийСтатусПроекта", Макет.ПолучитьОбласть("СтрокаКраткийСтатусПроекта"));
	СтруктураОбластей.Вставить("ЗаголовокКраткийСтатусПроекта", Макет.ПолучитьОбласть("ЗаголовокКраткийСтатусПроекта"));
	СтруктураОбластей.Вставить("Разделитель", Макет.ПолучитьОбласть("R100"));
	СтруктураОбластей.Вставить("РасшифровкаСемафора", Макет.ПолучитьОбласть("РасшифровкаСемафора"));
	///////////////////////////////////////////////////////////////
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("ИконкиСтатусовКолонок ", ИконкиСтатусовКолонок());
	ПараметрыВывода.Вставить("тДочерние", тЗадачи);
	ПараметрыВывода.Вставить("ТабДок", ТабДок);
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока ВыборкаДокументы.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ОтборПоДокументу = Новый Структура("Ссылка", ВыборкаДокументы.Ссылка);
		тПроекты.Очистить();
		
		// заголовок
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Заголовок" );
		Область.Параметры.Дата = Формат(ВыборкаДокументы.Ссылка.Дата, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(Область);
		
		// сводно по проектам
		
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "ШапкаСводПоПроектам" );
		ТабДок.Вывести(Область);
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		
		ВыборкаФазы = ВыборкаДокументы.Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам );
		Пока ВыборкаФазы.Следующий() Цикл 
			Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "ГруппировкаСводПоПроектам" );
			Область.Параметры.Фаза = ВыборкаФазы.Фаза;			
			ТабДок.Вывести(Область, 0);
			
			Выборка = ВыборкаФазы.Выбрать();
			Пока Выборка.Следующий() Цикл
				Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "СтрокаСводПоПроектам" );
				Область.Параметры.Заполнить(Выборка);
								
				ПодставитьКартинку(Выборка, Область, "Сроки", ПараметрыВывода);
				ПодставитьКартинку(Выборка, Область, "Ресурсы", ПараметрыВывода);
				ПодставитьКартинку(Выборка, Область, "Бюджеты", ПараметрыВывода);
				ПодставитьКартинку(Выборка, Область, "Риски", ПараметрыВывода);
				
				ТабДок.Вывести(Область, 1);
				
				//
				
				НовСтрокаПроект = тПроекты.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрокаПроект, Выборка);
			КонецЦикла;
		КонецЦикла; 
		
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		// задачи
		мНезаполняемыеПоля = Новый Массив; 
		мНезаполняемыеПоля.Добавить("Код");
		мНезаполняемыеПоля.Добавить("Проект");
		
		ПараметрыВывода.Вставить("Область", ПолучитьОбластьПоИмени(СтруктураОбластей, "СтрокаКраткийСтатусПроекта"));
		ПараметрыВывода.Вставить("ИмяОбласти", "СтрокаКраткийСтатусПроекта");
		ПараметрыВывода.Вставить("НезаполняемыеПоля", мНезаполняемыеПоля);
		
		//
		
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "ЗаголовокКраткийСтатусПроекта");
		ТабДок.Вывести(Область);
		
		Для Каждого СтрокаПроекта Из тПроекты Цикл 
			
			Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "ШапкаКраткийСтатусПроекта");
			ТабДок.Вывести(Область);
			
			ТабДок.НачатьАвтогруппировкуСтрок();
			
			тДочерние = ПараметрыВывода.тДочерние;
			ТабДок = ПараметрыВывода.ТабДок;
			Область = ПараметрыВывода.Область;
			Уровень = 0; 
			
			Область.Области[ПараметрыВывода.ИмяОбласти].Шрифт = Новый Шрифт(,,Истина);
			Область.Параметры.Заполнить(СтрокаПроекта);
			Область.Параметры.ЗадачаПредставление = "";
			Область.Параметры.ПроцентВыполненияЗадачи = "";
			Область.Параметры.ПроцентДинамики = "";
			Область.Параметры.Ответственный = СтрокаПроекта.РуководительПроекта;
			
			ПодставитьКартинку(СтрокаПроекта, Область, "Сроки", ПараметрыВывода);
			ПодставитьКартинку(СтрокаПроекта, Область, "Ресурсы", ПараметрыВывода);
			ПодставитьКартинку(СтрокаПроекта, Область, "Бюджеты", ПараметрыВывода);
			ПодставитьКартинку(СтрокаПроекта, Область, "Риски", ПараметрыВывода);
			
			ТабДок.Вывести(Область, Уровень);
			
			ОтборЗадачПроектов = Новый Структура("Ссылка, Проект, УровеньДерева", ВыборкаДокументы.Ссылка, СтрокаПроекта.Проект, Уровень);
			КорневыеЗадачи = тДочерние.НайтиСтроки( ОтборЗадачПроектов );
			
			Для Каждого СтрокаЗадача Из КорневыеЗадачи Цикл 
				ВывестиДерево(СтрокаЗадача, Уровень, ПараметрыВывода);
			КонецЦикла;
			
			ТабДок.ЗакончитьАвтогруппировкуСтрок();
			
			Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Разделитель");
			ТабДок.Вывести(Область);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "РасшифровкаСемафора");
	ТабДок.Вывести(Область);
	
	// удаление текстовых маркеров для подстановки иконок статусов
	Для Каждого КлючЗначение Из ПараметрыВывода.ИконкиСтатусовКолонок Цикл 
		Искать = Истина;
		
		Пока Искать Цикл
			Ячейка = ТабДок.НайтиТекст("##"+КлючЗначение.Ключ+"##");
			
			Если Ячейка = Неопределено Тогда 
				Искать = Ложь;
			Иначе
				Ячейка.Текст = "";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции 

Функция ИконкиСтатусовКолонок()
	
	Возврат Документы.упоСтатусОтчетПоПроекту.ИконкиСтатусовКолонок();

КонецФункции 

Процедура ПодставитьКартинку(Строка, Область, Ключ, ПараметрыВывода)
			
	ОбластьЯчейки = Область.НайтиТекст("##"+Ключ+"##");	
	
	ИконкиСтатусов = Неопределено;
	ПараметрыВывода.ИконкиСтатусовКолонок.Свойство(Ключ, ИконкиСтатусов);
		
	Если НЕ ОбластьЯчейки = Неопределено Тогда 				
		Если НЕ ИконкиСтатусов = Неопределено Тогда 
			ОбластьЯчейки.Картинка = ИконкиСтатусов[Строка[Ключ]] ;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОбластьПоИмени(СтруктураОбластей, Имя)
	Возврат СтруктураОбластей[Имя];
КонецФункции 

Процедура ВывестиДерево(Строка, Уровень, ПараметрыВывода)
	
	тДочерние = ПараметрыВывода.тДочерние;
	ТабДок = ПараметрыВывода.ТабДок;
	Область = ПараметрыВывода.Область;
	слУровень = Уровень + 1;	 
	ИмяОбласти = ?(ЗначениеЗаполнено( ПараметрыВывода.Свойство("ИмяОбласти") ), ПараметрыВывода.ИмяОбласти, "СтрокаТаблицы"); 	
	НезаполняемыеПоля = ?(ПараметрыВывода.Свойство("НезаполняемыеПоля"), ПараметрыВывода.НезаполняемыеПоля, Новый Массив);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", Строка.ЗадачаСсылка);
	ПараметрыОтбора.Вставить("УровеньДерева", слУровень);	
	Дочерние = тДочерние.НайтиСтроки(ПараметрыОтбора);
	
	//
	
	ЭтоГруппа = Дочерние.Количество() > 0;
	Область.Области[ИмяОбласти].Шрифт = ?(ЭтоГруппа, Новый Шрифт(,, Истина), Новый Шрифт(,, Ложь));
	Область.Параметры.Заполнить(Строка);
	
	ШаблонТекста = "%1%%";
	
	Область.Параметры.ПроцентВыполненияЗадачи = СтрШаблон(ШаблонТекста, Строка.ПроцентВыполненияЗадачи);
	Область.Параметры.ПроцентДинамики = СтрШаблон(ШаблонТекста, Строка.ПроцентДинамики);
	
	Если НезаполняемыеПоля.Количество() > 0 Тогда 
		Для Каждого ИмяПоля Из НезаполняемыеПоля Цикл 
			Область.Параметры[ИмяПоля] = "";		
		КонецЦикла;
	КонецЕсли; 
	
	ПодставитьКартинку(Строка, Область, "Сроки", ПараметрыВывода);
	ПодставитьКартинку(Строка, Область, "Ресурсы", ПараметрыВывода);
	ПодставитьКартинку(Строка, Область, "Бюджеты", ПараметрыВывода);
	ПодставитьКартинку(Строка, Область, "Риски", ПараметрыВывода);
			
	ТабДок.Вывести(Область, Уровень);
	
	Для Каждого ДочернийУзел Из Дочерние Цикл 
		ВывестиДерево(ДочернийУзел, слУровень, ПараметрыВывода);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли