
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    ИКТ_ДобавлениеИзменениеРеквизитовФормы();
КонецПроцедуры

&НаСервере
Процедура ИКТ_ДобавлениеИзменениеРеквизитовФормы()
	
	ГруппаФормыКомандыФИО = Элементы.Найти("КомандыФИО");
	
	Если ГруппаФормыКомандыФИО = Неопределено Тогда 
		Сообщить("Не найден элемент формы: " + "<КомандыФИО>");
		Возврат;
	КонецЕсли;
	
	ЭлементФормыИзменитьФИО = Элементы.Найти("ИзменитьФИО");
	
	Если ЭлементФормыИзменитьФИО = Неопределено Тогда 
		Сообщить("Не найден элемент формы: " + "<ИзменитьФИО>");
		Возврат;
	КонецЕсли;
		
    ДобавляемыеРеквизиты = Новый Массив;
		
    Реквизит_ИКТ_ТабельныйНомер = Новый РеквизитФормы("ИКТ_ТабельныйНомер",Новый ОписаниеТипов("Строка"),, "Таб.номер УУ");
		
	ЭлементФормы_ИКТ_ТабельныйНомер = Элементы.Найти("ИКТ_ТабельныйНомер");
	
	Если ЭлементФормы_ИКТ_ТабельныйНомер = Неопределено Тогда 
		ДобавляемыеРеквизиты.Добавить(Реквизит_ИКТ_ТабельныйНомер);  
	КонецЕсли; 

	ИзменитьРеквизиты(ДобавляемыеРеквизиты); 	
		
	Если ЭлементФормы_ИКТ_ТабельныйНомер = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("ИКТ_ТабельныйНомер", Тип("ПолеФормы"), ГруппаФормыКомандыФИО,ЭлементФормыИзменитьФИО);
		НовыйЭлемент.ПутьКДанным            = "ФизическоеЛицо.ИКТ_ТабельныйНомер";		
		НовыйЭлемент.Вид                    = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ЦветТекста             = WebЦвета.Красный;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Ширина = 10;
		НовыйЭлемент.МаксимальнаяШирина = 10;
	КонецЕсли; 
		
КонецПроцедуры