
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
				
	СвязаннаяСтатья = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(ПараметрКоманды);
	
	Если Не ЗначениеЗаполнено(СвязаннаяСтатья) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначенияСтатьи = ТипЗнч(СвязаннаяСтатья);
	
	ИмяСправочника = "упоСтатьиЗатрат";
	Если ТипЗначенияСтатьи = Тип("СправочникСсылка.упоСтатьиДоходов") Тогда
		ИмяСправочника = "упоСтатьиДоходов";
	КонецЕсли;
	
	ИмяФормы = "Справочник.%1.Форма.ФормаЭлементаУправляемая";
	
	ИмяФормы = СтрЗаменить(ИмяФормы, "%1", ИмяСправочника);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СвязаннаяСтатья);
	ПараметрыФормы.Вставить("РежимИнтеграции", Истина);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
