
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Возвращает данные для проведения документа.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
// Возвращаемое значение:
//   Структура: 
//   	* Ключ - Строка - имя регистра.
//   	* Значение - ТаблицаЗначений - данные для проведения документа.
//
Функция ДанныеПроведения(ДокументСсылка) Экспорт
			
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);		
			
	Запрос.Текст = ТекстПроведение();
			
	Результат = Запрос.Выполнить();		
	
	ДанныеПроведения = Новый Структура;
	ДанныеПроведения.Вставить("упоСоответствиеСтратегическимЦелям", Результат.Выгрузить());
		
	Возврат ДанныеПроведения;
		
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Расчет.Проект, NULL КАК ИСТИНА))";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоСоответствиеСтратегическимЦелям);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ТекстПроведение()
			
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоСоответствиеСтратегическимЦелямБаллыПроектов.Ссылка.Ссылка КАК Регистратор,
	               |	упоСоответствиеСтратегическимЦелямБаллыПроектов.Ссылка.Дата КАК Период,
	               |	упоСоответствиеСтратегическимЦелямБаллыПроектов.Балл КАК Балл,
	               |	упоСоответствиеСтратегическимЦелямБаллыПроектов.Проект КАК Проект,
	               |	упоСоответствиеСтратегическимЦелямБаллыПроектов.Заявка КАК ЗаявкаНаПроект
	               |ИЗ
	               |	Документ.упоСоответствиеСтратегическимЦелям.БаллыПроектов КАК упоСоответствиеСтратегическимЦелямБаллыПроектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоЗаявкаНаПроект КАК упоЗаявкаНаПроект
	               |		ПО упоСоответствиеСтратегическимЦелямБаллыПроектов.Заявка = упоЗаявкаНаПроект.Ссылка
	               |ГДЕ
	               |	упоСоответствиеСтратегическимЦелямБаллыПроектов.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
