#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработатьДанныеМонитораПортала1С();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьОповещение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИнтернетПоддержкаПодключена" Тогда
		ЭтотОбъект.ПараметрыОткрытия = упоФункцииЗащитыСервер.ДанныеПроверкиДоговораСопровождения();
		ОбработатьДанныеМонитораПортала1С();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьТокен(Команда)
	
	Если Не ЭтаФорма.Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьТокен(ЭтотОбъект.Токен);
	
	ЭтаФорма.Модифицированность = Ложь;
	
	Если Команда.Имя = ИмяКомандыСохранитьИЗакрыть() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьПодключениеКБоту(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИнформациюОБотеСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьСообщенияБоту(Команда)
	
	ПолучитьСообщенияБоту();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСоответствиеПользователя(Команда)
	
	ТекущиеДанные = Элементы.СообщенияБоту.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Пользователь) Тогда
		ПараметрыФормы.Вставить("Ключ", КлючЗаписиРегистраСоответствия(ТекущиеДанные));
	Иначе 
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполненияРегистраСоответствия(ТекущиеДанные));
	КонецЕсли;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеУстановкиСоответствияПользователя", ЭтотОбъект);
	
	ОткрытьФорму(
		"РегистрСведений.упоСоответствиеПользователейTelegram.ФормаЗаписи",
		ПараметрыФормы,
		ЭтаФорма,
		ЭтаФорма.УникальныйИдентификатор,
		,
		,
		ОписаниеОповещенияОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьСообщенияБоту(Команда)
	
	ОчиститьСообщенияБотуСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьСообщениеПользователю(Команда)
	
	ТекущиеДанные = Элементы.СоответствиеПользователейTelegram.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Пользователь)
		Или Не ЗначениеЗаполнено(ТекущиеДанные.ИД_ПользователяTelegram) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИД_ПользователяTelegram", ТекущиеДанные.ИД_ПользователяTelegram); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаТекстаСообщения", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводСтроки(
		ОписаниеОповещения,
		,
		НСтр("ru = 'Введите текст сообщения'"),
		3000,
		Истина
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияФормы()
	
	ЭтотОбъект.ПараметрыОткрытия = упоФункцииЗащитыСервер.ДанныеПроверкиДоговораСопровождения();
	
	ЭтотОбъект.Токен = упоРаботаCTelegram.ТокенБотаДляФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьТокен(Токен)
	
	упоРаботаCTelegram.УстановитьТокенБота(Токен);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОБотеСервер()
	
	ЭтотОбъект.ИнформацияОБоте = упоРаботаCTelegram.ПолучитьИнформациюОБотеОтAPI(, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщенияБоту()
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСообщенийБоту = упоРаботаCTelegram.ПолучитьСообщенияБоту(, Истина, Истина);
	
	ЭтотОбъект.СообщенияБоту.Загрузить(ТаблицаСообщенийБоту);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСообщенияБотуСервер()
	
	упоРаботаCTelegram.ОчиститьНакопленныеСообщенияБоту();
	
	ПолучитьСообщенияБоту();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьСообщениеСервер(ИД_Пользователя, ТекстСообщения)
	
	Сообщение = упоРаботаCTelegram.ОтправитьСообщениеПользователю(
		,
		ИД_Пользователя,
		ТекстСообщения
	);
	
	Возврат Сообщение;
	
КонецФункции

&НаКлиенте
Процедура ПослеУстановкиСоответствияПользователя(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПолучитьСообщенияБоту();
	
КонецПроцедуры 

&НаКлиенте
Функция ЗначенияЗаполненияРегистраСоответствия(ДанныеСтроки)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Пользователь", ДанныеСтроки.Пользователь);
	ЗначенияЗаполнения.Вставить("ИД_ПользователяTelegram", ДанныеСтроки.ID_Пользователя);
	ЗначенияЗаполнения.Вставить("ИмяПользователяTelegram", 
		ДанныеСтроки.ИмяПользователя + ДанныеСтроки.ФамилияПользователя);
		
	Возврат ЗначенияЗаполнения;
	
КонецФункции

&НаКлиенте
Функция КлючЗаписиРегистраСоответствия(ДанныеСтроки)
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Пользователь", ДанныеСтроки.Пользователь);
	СтруктураЗаписи.Вставить("ИД_ПользователяTelegram", ДанныеСтроки.ID_Пользователя);
		
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
	
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.упоСоответствиеПользователейTelegram", МассивСтруктураЗаписи);
	
	Возврат КлючЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьОповещение(Результат, Контекст) Экспорт
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Имя", ИмяКомандыСохранитьИЗакрыть());
	
	КомандаСохранитьТокен(ПараметрыКоманды);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаТекстаСообщения(ТекстСообщения, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = ОтправитьСообщениеСервер(ДополнительныеПараметры.ИД_ПользователяTelegram, ТекстСообщения);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Сообщение отправлено.'"));
	
КонецПроцедуры

&НаКлиенте
Функция ИмяКомандыСохранитьИЗакрыть()
	Возврат "СохранитьНастройкиИЗакрыть";
КонецФункции

#Область ПроверкаДоговораСопровождения

&НаКлиенте
Процедура ОбработатьДанныеМонитораПортала1С()
	
	ЭтаФорма.Доступность = ПараметрыОткрытия.УсловияДоговораСопровожденияВыполнены;
	
	НеобходимоЗапуститьМонитор = Не ПараметрыОткрытия.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки
		Или ПараметрыОткрытия.ОшибкаЗапускаМонитора;
	
	ТекстНужнаПодписка = НСтр("ru = 'Для использования функциональности необходим действующий договор сопровождения ИТС.'");
	
	Если НеобходимоЗапуститьМонитор Тогда
		
		ПараметрыОповещения = Неопределено;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ПараметрыОповещения);
		ТекстВопроса = ТекстНужнаПодписка 
			+ НСтр("ru = ' Выполнить настройку подключения интернет-поддержки для проверки договора сопровождения?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		
		Если Не ПараметрыОткрытия.УсловияДоговораСопровожденияВыполнены Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьФормуПослеПредупрежденияЗавершение", ЭтотОбъект);
			ПоказатьПредупреждение(ОписаниеОповещения, ТекстНужнаПодписка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(, ЭтотОбъект);
	Иначе
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуПослеПредупрежденияЗавершение(ДополнительныеПараметры) Экспорт
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
