
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СообщениеВопрос = Параметры.СообщениеВопрос;
	СообщениеЗаголовок = Параметры.СообщениеЗаголовок;
	Заголовок = Параметры.Заголовок;
	Файлы = Параметры.Файлы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяСтрока = Файлы[ВыбраннаяСтрока].Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Да(Команда)
	
	МассивДляОповещения = Новый Массив;
	Для Каждого ЭлементыСписка Из Файлы Цикл
		Если ЭлементыСписка.Пометка = Истина Тогда 
			МассивДляОповещения.Добавить(ЭлементыСписка.Значение);
		КонецЕсли;	
	КонецЦикла;
	
	Оповестить("упоФормаВопроса", МассивДляОповещения,ЭтаФорма);
	
	Закрыть(МассивДляОповещения);
	
КонецПроцедуры

#КонецОбласти