#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проведение документа
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.Ссылка.Дата КАК Период,
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.Ссылка.Организация КАК Организация,
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.Должность.Подразделение КАК Подразделение,
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.Должность КАК Должность,
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.ВидУдостоверения КАК ВидУдостоверения,
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.ГруппаДопуска КАК ГруппаДопуска,
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.Используется КАК Используется
	|ИЗ
	|	Документ.ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностей.Должности КАК ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности
	|ГДЕ
	|	ИКТ_УтверждениеПеречняВидовУдостоверенийДляДолжностейДолжности.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Движения.ИКТ_ВидыУдостоверенийПоДолжностям.Записывать = Истина;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Движения.ИКТ_ВидыУдостоверенийПоДолжностям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
