
&ИзменениеИКонтроль("ОбновитьКурсыПодчиненныхВалют")
Процедура Расш1_ОбновитьКурсыПодчиненныхВалют()

	ВыбраннаяВалюта = Неопределено;
	ДополнительныеСвойства.Свойство("ОбновитьКурсЗависимойВалюты", ВыбраннаяВалюта);

	Для Каждого ЗаписьОсновнойВалюты Из ЭтотОбъект Цикл

		Если ВыбраннаяВалюта <> Неопределено Тогда // Нужно обновить курс только указанной валюты.
			ЗаблокироватьКурсЗависимойВалюты(ВыбраннаяВалюта, ЗаписьОсновнойВалюты.БазоваяВалюта, ЗаписьОсновнойВалюты.Период);
		Иначе
			ЗависимыеВалюты = РаботаСКурсамиВалютУТ.СписокЗависимыхВалют(ЗаписьОсновнойВалюты.Валюта, ДополнительныеСвойства);
			Для Каждого ЗависимаяВалюта Из ЗависимыеВалюты Цикл
				ЗаблокироватьКурсЗависимойВалюты(ЗависимаяВалюта, ЗаписьОсновнойВалюты.БазоваяВалюта, ЗаписьОсновнойВалюты.Период);
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	Для Каждого ЗаписьОсновнойВалюты Из ЭтотОбъект Цикл
		
		#Вставка
		//{[+] ИКТ №20074 (фрагмент ДОБАВЛЕН), Новоселов, 16.07.2026 
		Если ЗаписьОсновнойВалюты.Валюта = Справочники.Валюты.НайтиПоКоду("784") Тогда
			Продолжить;
		КонецЕсли;
		//[+]} ИКТ №20074
		#КонецВставки
		Если ВыбраннаяВалюта <> Неопределено Тогда // Нужно обновить курс только указанной валюты.
			ОбновленныеПериоды = Неопределено;
			Если Не ДополнительныеСвойства.Свойство("ОбновленныеПериоды", ОбновленныеПериоды) Тогда
				ОбновленныеПериоды = Новый Соответствие;
				ДополнительныеСвойства.Вставить("ОбновленныеПериоды", ОбновленныеПериоды);
			КонецЕсли;
			// Повторно не обновляем курс за один и тот же период.
			Если ОбновленныеПериоды[ЗаписьОсновнойВалюты.Период] = Неопределено Тогда
				ОбновитьКурсЗависимойВалюты(ВыбраннаяВалюта, ЗаписьОсновнойВалюты);
				ОбновленныеПериоды.Вставить(ЗаписьОсновнойВалюты.Период, Истина);
			КонецЕсли;
		Иначе	// Обновить курс всех зависимых валют.
			ЗависимыеВалюты = РаботаСКурсамиВалютУТ.СписокЗависимыхВалют(ЗаписьОсновнойВалюты.Валюта, ДополнительныеСвойства);
			Для Каждого ЗависимаяВалюта Из ЗависимыеВалюты Цикл
				ОбновитьКурсЗависимойВалюты(ЗависимаяВалюта, ЗаписьОсновнойВалюты); 
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
