////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с проектами и задачами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработкаСобытийИнтегрированныхОбъектов

// См. упоПроектыИЗадачиВызовСервера.НайтиСвязанныйЭлементПроекта
//
Функция НайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу = Ложь, ВернутьСоответствие = Ложь) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу, ВернутьСоответствие);
	
КонецФункции

// Устарела. См. упоПроектыИЗадачиВызовСервера.НайтиСвязанныйЭлементПроекта
//
Функция упоНайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу = Ложь) Экспорт
	Возврат НайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу);
КонецФункции

// Устарела. См. упоПроектыИЗадачиВызовСервера.НайтиСвязанныйЭлементПроекта
//
Функция обНайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу = Ложь) Экспорт
	Возврат НайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу);
КонецФункции

// Устарела. См. упоПроектыИЗадачиВызовСервера.НайтиСвязанныйЭлементПроекта
//
Функция обПолучитьСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу = Ложь) Экспорт
	Возврат НайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу);
КонецФункции

// Устарела. См. упоПроектыИЗадачиВызовСервера.НайтиСвязанныйЭлементПроекта
//
Функция обВернутьСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу = Ложь) Экспорт
	Возврат НайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу);
КонецФункции

#КонецОбласти

#Область ПроверкаЦикличностиПЗ

// Проверяет на зацикливание структуры проекта после изменений, внесенных в проектную задачу.
//  Если мы удаляем какие-то предусловия, то на цикличность это не влияет, а вот если добавляем,
//  то надо проверить. Для этого идем по предыдущим вглубь проекта от нашей задачи и проверяем, не
//  попали ли мы уже в пройденную.
//
// Параметры:
//  ДанныеДокумента	 - Структура - содержит полный слепок документа.
//  Отказ			 - Булево	 - содержит признак отказа от операции.
//  Заголовок		 - Строка	 - содержит заголовок всех сообщений.
//
Процедура обПроверитьЗацикливаниеСтруктурыПроектаПослеИзмененийВПроектнойЗадаче(ДанныеДокумента, Отказ, Заголовок) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеДокумента.ПредусловияЗадачи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
		
	Проект          = ДанныеДокумента.Проект;
	ПроектнаяЗадача = ДанныеДокумента.Ссылка;
		
	Если ТипЗнч(ДанныеДокумента.Ссылка) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ЗадачаРодитель	= ДанныеДокумента.ЗадачаРодитель;
	Иначе
		ЗадачаРодитель	= Документы.упоПроектнаяЗадача.ПустаяСсылка();
	КонецЕсли;
	
	/////////////////////////////
	
	МассивВнешнихПроектов = Новый Массив;
	
	ТаблицаНовыхСвязей = Новый ТаблицаЗначений;
	ТаблицаНовыхСвязей.Колонки.Добавить("ЭлементПроекта");
	ТаблицаНовыхСвязей.Колонки.Добавить("ПроектПредшественника");
	ТаблицаНовыхСвязей.Колонки.Добавить("СвязанныйЭлемент");
	
	ТаблицаНовыхСвойств = Новый ТаблицаЗначений;
	ТаблицаНовыхСвойств.Колонки.Добавить("ЭлементПроекта");
	ТаблицаНовыхСвойств.Колонки.Добавить("ЭлементРодитель");
	ТаблицаНовыхСвойств.Колонки.Добавить("Проект");
	ТаблицаНовыхСвойств.Колонки.Добавить("ПредставлениеЭлемента");
	СтрокаТаблицыНовыхСвойств = ТаблицаНовыхСвойств.Добавить();
	СтрокаТаблицыНовыхСвойств.ЭлементПроекта = ПроектнаяЗадача;
	СтрокаТаблицыНовыхСвойств.ЭлементРодитель = ЗадачаРодитель;
	
	Для Каждого СтрокаПредусловияЗадачи Из ДанныеДокумента.ПредусловияЗадачи Цикл
		
		Если СтрокаПредусловияЗадачи.СвязьМеждуПроектами Тогда
			
			ПроектСвязи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПредусловияЗадачи.ЗадачаПредшественник, "Проект");			
			
			ИндексВМассиве = МассивВнешнихПроектов.Найти(ПроектСвязи);
			Если ИндексВМассиве = Неопределено Тогда
				МассивВнешнихПроектов.Добавить(ПроектСвязи);	
			КонецЕсли;
			
		Иначе
			
			ПроектСвязи = Проект;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаНовыхСвязей.Добавить();
		НоваяСтрока.ЭлементПроекта = ПроектнаяЗадача;
		НоваяСтрока.ПроектПредшественника = ПроектСвязи;
		НоваяСтрока.СвязанныйЭлемент = СтрокаПредусловияЗадачи.ЗадачаПредшественник;
				
	КонецЦикла;
	
	//
	
	ДанныеЗадач = Новый Соответствие;
	
	ДанныеЗадачи = Новый Структура;
	ДанныеЗадачи.Вставить("ВнешниеПроекты", МассивВнешнихПроектов);
	ДанныеЗадачи.Вставить("Связи", ТаблицаНовыхСвязей);
	ДанныеЗадачи.Вставить("Свойства", ТаблицаНовыхСвойств);
	
	ДанныеЗадач.Вставить(ПроектнаяЗадача, ДанныеЗадачи);
	
	//
	
	ТаблицаОшибок = упоПроектыИЗадачиСервер.ПроверитьНаЦикличностьПроект(Проект, ДанныеЗадач);
				
	//
		
	Если ТаблицаОшибок.Количество() Тогда
		СтрокаСообщения = упоПроектыИЗадачиСервер.СобратьВТекстОшибкиЦикличностиПроекта(ТаблицаОшибок);
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли;
		
КонецПроцедуры

// Проверяет разрешения диспетчера или сотрудника на создание или модификацию проектной задачи.
//
// Параметры:
//  ДанныеДокумента		 - Структура - содержит полный слепок документа.
//  Отказ				 - Булево	 - содержит признак отказа от операции.
//  Заголовок			 - Строка	 - содержит заголовок всех сообщений.
//  ВыводитьСообщение	 - Булево
//
Процедура обПроверитьПолномочияПользователяПроектнойЗадачи(ДанныеДокумента, Отказ, Заголовок = "", ВыводитьСообщение = Истина) Экспорт

	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если упоРазграничениеДоступаВызовСервера.РазграничениеДоступаОтключено() Тогда
		Возврат;
	КонецЕсли;
	
	// Собственно для начала определим руководителя проектной задачи.
	Руководитель = ОпределитьРуководителяПроектнойЗадачи(ДанныеДокумента);
	
	// Если руководителя нет, надо сообщить об этом.
	Если Руководитель = Неопределено Тогда
		СтрокаСообщения = НСтр("ru = 'Не определен руководитель проекта!'");
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		Возврат;
	КонецЕсли;
	
	// Теперь определим список пользователей,
	// через которых управляет системой руководитель проектной задачи.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Руководитель);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Рег.Пользователь
	               |ИЗ
	               |	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(, Сотрудник В (&Сотрудники)) КАК Рег
	               |ГДЕ
	               |	Рег.ФлагУправления = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда // Нет диспетчеров.
		строкаРуководителей = "";
		
		первыйРаз = Истина;
		Для каждого лОдинРук Из Руководитель Цикл
			Если НЕ первыйРаз Тогда
				строкаРуководителей = строкаРуководителей + ", ";
			КонецЕсли;
			строкаРуководителей = строкаРуководителей + лОдинРук;
		КонецЦикла;
		СтрокаСообщения = НСтр("ru = 'Для руководителей: ""%1"" не определен ни один диспетчер.'");
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, строкаРуководителей);
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		
		Возврат;
		
	КонецЕсли;
	
	СписокПользователей = Результат.Выгрузить();
	
	ПользовательНайден = (СписокПользователей.Найти(Пользователи.ТекущийПользователь(), "Пользователь") <> Неопределено);
	
	Если ПользовательНайден Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеЗадачи = упоСервисныеФункцииВызовСервера.обПолучитьСтроковоеПредставление(ДанныеДокумента.ПроектнаяЗадача);
	СтрокаСообщения = НСтр("ru = 'Пользователь ""%1"" не имеет полномочий на выполнение этой операции.'");
	СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь());
	обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок, , , ВыводитьСообщение);
	
КонецПроцедуры

// Проверяет допустимость записи проектной задачи при ее создании.
//
// Параметры:
//  ДанныеДокумента	 - Структура - содержит полный слепок документа.
//  Отказ			 - Булево	 - содержит признак отказа от операции.
//  Заголовок		 - Строка	 - содержит заголовок всех сообщений.
//
Процедура обПроверитьДопустимостьПроектнойЗадачи(ДанныеДокумента, Отказ, Заголовок) Экспорт

	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Следующая проверка только если есть родительская задача.
	Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ДанныеДокумента.ЗадачаРодитель) Тогда
		// Проверим существование задачи-родителя.
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Задача", ДанныеДокумента.ЗадачаРодитель);
		Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ДанныеДокумента.ЗадачаРодитель.Проект));
			
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегСвойствоЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	РегСвойствоЗадачи.ЭтоПакетРабот КАК ЭтоПакетРабот,
			|	РегСвойствоЗадачи.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
			|	РегСвойствоЗадачи.НазваниеЗадачи КАК НазваниеЗадачи,
			|	РегСвойствоЗадачи.ЭтоВеха КАК ЭтоВеха
			|ИЗ
			|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
			|			,
			|			ПроектнаяЗадача = &Задача
			|				И Версия = &текВерсия) КАК РегСвойствоЗадачи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
			|		ПО РегСвойствоЗадачи.Версия = Версии.Версия
			|			И (Версии.Текущая)
			|ГДЕ
			|	НЕ РегСвойствоЗадачи.ЗадачаОтменена";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			
			СтрокаСообщения = НСтр("ru = 'Не найдена задача-родитель! Документ удален или не проведен.'");
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
			
		Иначе
			
			ТаблицаДанных = Результат.Выгрузить();
			НазваниеЗадачи = ТаблицаДанных[0].НазваниеЗадачи;
			ЭтоПакетРабот  = ТаблицаДанных[0].ЭтоПакетРабот;
			ЭтоМодельПакетаРабот = ТаблицаДанных[0].ЭтоМодельПакетаРабот;
			ЭтоВеха = ТаблицаДанных[0].ЭтоВеха;
			
			СтрокаСообщения = "";
			Если ЭтоМодельПакетаРабот Тогда
                СтрокаСообщения = НСтр("ru = 'Задача-родитель ""%1"" является моделью пакета работ и не может выступать
				|в роли родительской задачи!'");				
			ИначеЕсли ЭтоПакетРабот Тогда
				СтрокаСообщения = НСтр("ru = 'Задача-родитель ""%1"" является пакетом работ и не может выступать в роли
				|родительской задачи!'");				
			ИначеЕсли ЭтоВеха Тогда
				СтрокаСообщения = НСтр("ru = 'Задача-родитель ""%1"" является вехой и не может выступать в роли родительской задачи!'");				
			КонецЕсли;
			
			Если Не ПустаяСтрока(СтрокаСообщения) Тогда
				СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(НазваниеЗадачи));
				обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет предусловия проектной задачи на корректность связей (например на зацикливание).
//
// Параметры:
//  ДанныеДокумента	 - Структура - содержит полный слепок документа.
//  Отказ			 - Булево	 - содержит признак отказа от операции.
//  Заголовок		 - Строка	 - содержит заголовок всех сообщений.
//
Процедура обПроверитьПравильностьПредУсловийПроектнойЗадачи(ДанныеДокумента, Отказ, Заголовок) Экспорт

	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеДокумента.ПредусловияЗадачи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Проект          = ДанныеДокумента.Проект;
	ПроектнаяЗадача = ДанныеДокумента.ПроектнаяЗадача;
	
	// Получим последнюю иерархию проектных задач для заданного проекта.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.ПроектнаяЗадача КАК Задача,
		|	Рег.ЗадачаРодитель КАК Родитель,
		|	Рег.НазваниеЗадачи КАК НазваниеЗадачи
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК Рег
		|ГДЕ
		|	НЕ Рег.ЗадачаОтменена";
	
	ТаблицаЗадач = Запрос.Выполнить().Выгрузить();
	
	// Это обязательно:
	// Добавим текущую задачу, т.к. при проведении ее данные автоматически удаляются из регистра,
	// или перепишем текущую задачу, т.к. при изменении у нее записаны старые данные.
	СтрокаЗадачи = ТаблицаЗадач.Найти(ПроектнаяЗадача, "Задача");
	Если СтрокаЗадачи = Неопределено Тогда
		СтрокаЗадачи = ТаблицаЗадач.Добавить();
	КонецЕсли;
	СтрокаЗадачи.Задача           = ДанныеДокумента.ПроектнаяЗадача;
	СтрокаЗадачи.Родитель         = ДанныеДокумента.ЗадачаРодитель;
	СтрокаЗадачи.НазваниеЗадачи   = ДанныеДокумента.НазваниеПроектнойЗадачи;
	
	// Для каждого предшественника будем проверять не зависит ли он прямо или косвенно от текущей задачи.
	
	// Перебираем задачи-предшественники табличной части "ПредусловияЗадачи".
	Для Каждого ПредУсловие Из ДанныеДокумента.ПредусловияЗадачи Цикл
		
		Если ПредУсловие.СвязьМеждуПроектами Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаПредшественник = ПредУсловие.ЗадачаПредшественник;
		
		Задача = ТаблицаЗадач.Найти(ЗадачаПредшественник, "Задача");
		Если Не Задача = Неопределено Тогда 
			// Проверим, что задача-предшественник не является текущей задачей.
			Если ЗадачаПредшественник = ПроектнаяЗадача Тогда
				ПредставлениеЗадачи = упоСервисныеФункцииВызовСервера.обПолучитьСтроковоеПредставление(ПредУсловие.ЗадачаПредшественник);
				СтрокаСообщения = НСтр("ru = 'Задача-предшественник ""'") + ПредставлениеЗадачи 
					+ НСтр("ru = '"" является текущей задачей.'");
				обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
			Иначе
				// Проверим задачу-предшественника на родительскую связь.
				Если обЭтоРодитель(ТаблицаЗадач, ПредУсловие.ЗадачаПредшественник, ПроектнаяЗадача) Тогда
					ПредставлениеЗадачи = упоСервисныеФункцииВызовСервера.обПолучитьСтроковоеПредставление(ПредУсловие.ЗадачаПредшественник);
					СтрокаСообщения = НСтр("ru = 'Задача-предшественник ""'") + ПредставлениеЗадачи 
						+ НСтр("ru = '"" является родительской задачей по иерархии.'");
					обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				// Проверим задачу-предшественника на подчиненность.
				Если обЭтоРодитель(ТаблицаЗадач, ПроектнаяЗадача, ПредУсловие.ЗадачаПредшественник) Тогда
					ПредставлениеЗадачи = упоСервисныеФункцииВызовСервера.обПолучитьСтроковоеПредставление(ПредУсловие.ЗадачаПредшественник);
					СтрокаСообщения = НСтр("ru = 'Задача-предшественник ""'") + ПредставлениеЗадачи 
						+ НСтр("ru = '"" является подчиненной задачей по иерархии.'");
					обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Не нашли задачу-предшественника. Удалена или не проведена.
			ПредставлениеЗадачи = упоСервисныеФункцииВызовСервера.обПолучитьСтроковоеПредставление(ПредУсловие.ЗадачаПредшественник);
			СтрокаСообщения = НСтр("ru = 'Не найдена задача-предшественник ""'") + ПредставлениеЗадачи + НСтр("ru = '"".'");
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ПроверкаДанныхПриЗаписиСправочникаШаблоныПроектныхЗадач

// Процедура проверяет допустимость записи в ИБ указанный шаблон проектной задачи.
//
// Параметры:
//  Объект		 - СправочникСсылка.упоШаблоныПроектныхЗадач - ссылка на справочник
//  Отказ		 - Булево									 - содержит признак отказа от операции.
//  Заголовок	 - Строка									 - содержит текст заголовока сообщения.
//
Процедура обПроверитьДопустимостьЗаписиШаблонаЗадачи(Объект, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Получим список всех шаблонов проектных задач и их родителей для текущего шаблона проекта.
	Если Объект.Родитель.ЭтоПакетРабот = Истина Тогда
		СтрокаСообщения = НСтр("ru = 'Шаблон задачи-родителя ""%1"" является пакетом работ и не может выступать в роли
		|родительской задачи!'");
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(Объект.Родитель));
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет предусловия указанного шаблона проектной задачи.
//
// Параметры:
//  Объект		 - СправочникСсылка.упоШаблоныПроектныхЗадач - шаблон проектной задачи.
//  Отказ		 - Булево									 - содержит признак отказа от операции.
//  Заголовок	 - Строка									 - содержит текст заголовока сообщения.
//
Процедура обПроверитьПредусловияШаблонаЗадачи(Объект, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ШаблонЗадачи  = Объект;
		ПроверитьПредусловияНовогоШаблонаЗадачи(Объект, Отказ, Заголовок);
		Возврат;
	Иначе
		ШаблонЗадачи  = Объект.Ссылка;
	КонецЕсли;
	ШаблонПроекта = Объект.Владелец;
	
	// Получим список всех шаблонов проектных задач и их родителей для текущего шаблона проекта.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ШаблонПроекта); 
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Спр.Ссылка КАК Задача,
		|	Спр.Представление КАК ПредставлениеЗадачи,
		|	Спр.Родитель,
		|	Спр.Родитель.Представление КАК ПредставлениеРодителя
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач КАК Спр
		|ГДЕ
		|	Спр.Владелец = &Владелец";
	
	Результат = Запрос.Выполнить();
	ТаблицаЗадач = Результат.Выгрузить();
	
	// Отбор по текущему шаблону задачи.
	Отбор = Новый Структура;
	Отбор.Вставить("Задача", ШаблонЗадачи);
	
	// Изменияем данные по данным текущего шаблона задачи.
	МассивСтрок = ТаблицаЗадач.НайтиСтроки(Отбор);
	Для Каждого ТекСтрока Из МассивСтрок Цикл
		ТаблицаЗадач.Удалить(ТекСтрока);
	КонецЦикла;
	
	НовСтрока = ТаблицаЗадач.Добавить();
	НовСтрока.Задача                = ШаблонЗадачи;
	НовСтрока.ПредставлениеЗадачи   = ШаблонЗадачи.Наименование;
	НовСтрока.Родитель              = Объект.Родитель;
	НовСтрока.ПредставлениеРодителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Родитель, "Наименование");
	
	// Получим список предусловий для всех шаблонов проектных задач для текущего шаблона проекта.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ШаблонПроекта); 
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабСпр.Ссылка КАК Объект,
		|	ТабСпр.ЗадачаПредшественник КАК ОбъектСвязи
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.ПредУсловия КАК ТабСпр
		|ГДЕ
		|	ТабСпр.Ссылка.Владелец = &Владелец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Спр.Ссылка,
		|	Спр.Родитель
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач КАК Спр
		|ГДЕ
		|	Спр.Владелец = &Владелец";
	
	Результат = Запрос.Выполнить();
	ТаблицаСвязей = Результат.Выгрузить();
	
	// Отбор по текущему шаблону задачи.
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", ШаблонЗадачи);
	
	// Изменияем данные по данным текущего шаблона задачи.
	МассивСтрок = ТаблицаСвязей.НайтиСтроки(Отбор);
	Для Каждого ТекСтрока Из МассивСтрок Цикл
		ТаблицаСвязей.Удалить(ТекСтрока);
	КонецЦикла;
	
	Для Каждого ПредУсловие Из Объект.ПредУсловия Цикл
		НовСтрока = ТаблицаСвязей.Добавить();
		НовСтрока.Объект      = ШаблонЗадачи;
		НовСтрока.ОбъектСвязи = ПредУсловие.ЗадачаПредшественник;
	КонецЦикла;
	
	// Проверяем предусловия текущего шаблона задачи.
	Для Каждого ПредУсловие Из Объект.ПредУсловия Цикл
		ЗадачаПредшественник = ПредУсловие.ЗадачаПредшественник;
		ПредставлениеЗадачи = ПредУсловие.ЗадачаПредшественник.Наименование;

		ПредставлениеТабличнойЧасти = Объект.Метаданные().ТабличныеЧасти["ПредУсловия"].Представление();
		ЗаголовокСообщения = упоСервисныеФункцииВызовСервера.обСформироватьЗаголовокОшибкиВСтрокеТЧ(ПредставлениеТабличнойЧасти, ПредУсловие.НомерСтроки);
		
		ДанныеЗадачи = ТаблицаЗадач.Найти(ПредУсловие.ЗадачаПредшественник, "Задача");
		Если Не ДанныеЗадачи = Неопределено Тогда 
			// Проверим, что задача-предшественник является текущей задачей.
			Если ЗадачаПредшественник = ШаблонЗадачи Тогда
				СтрокаСообщения = НСтр("ru = 'Задача-предшественник ""'") + ПредставлениеЗадачи 
					+ НСтр("ru = '"" является текущей задачей.'");
				обСообщитьОбОшибке(ЗаголовокСообщения, Отказ, Заголовок);
				обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
			Иначе
				// Проверим задачу-предшественника на родительскую связь.
				Если обЭтоРодитель(ТаблицаЗадач, ПредУсловие.ЗадачаПредшественник, ШаблонЗадачи) Тогда
					СтрокаСообщения = НСтр("ru = 'Задача-предшественник ""'") + ПредставлениеЗадачи 
						+ НСтр("ru = '"" является родительской задачей по иерархии.'");
					обСообщитьОбОшибке(ЗаголовокСообщения, Отказ, Заголовок);
					обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
				// Проверим задачу-предшественника на подчиненность.
				Если обЭтоРодитель(ТаблицаЗадач, ШаблонЗадачи, ПредУсловие.ЗадачаПредшественник) Тогда
					СтрокаСообщения = НСтр("ru = 'Задача-предшественник ""'") + ПредставлениеЗадачи 
						+ НСтр("ru = '"" является подчиненной задачей по иерархии.'");
					обСообщитьОбОшибке(ЗаголовокСообщения, Отказ, Заголовок);
					обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Не нашли задачу-предшественника. Удалена или не проведена.
			ПредставлениеЗадачи = упоСервисныеФункцииВызовСервера.обПолучитьСтроковоеПредставление(ПредУсловие.ЗадачаПредшественник);
			СтрокаСообщения = НСтр("ru = 'Не найдена задача-предшественник ""'") + ПредставлениеЗадачи + НСтр("ru = '"".'");
			обСообщитьОбОшибке(ЗаголовокСообщения, Отказ, Заголовок);
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	// Проверим на зацикленность связей.
	ЕстьСвязь = обНайтиСвязь(ТаблицаСвязей);
	Если ЕстьСвязь Тогда
		СтрокаСообщения = НСтр("ru = 'Обнаружено зацикливание среди звязей!'");
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 #Область ПроверкаСтруктурыПроекта
 
// См. упоПроектыИЗадачиСервер.ДанныеПроверкиСтруктурыПроекта
//
Функция ДанныеПроверкиСтруктурыПроекта(Проект, Отказ) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ДанныеПроверкиСтруктурыПроекта(Проект, Отказ);
	
КонецФункции

// Базовая функция. Проверяет проект на наличие ошибок по заданным параметрам.
//  Подготавливает данные для проверки и выполняет проверку.
//
// Параметры:
//  СтруктураПроверки	 - Структура - содержит параметры проверки, настроенные пользователем или системой.
//  ОтключитьИндикатор	 - Булево	 - признак индикации состояния процесса проверки.
// 
// Возвращаемое значение:
//  ТаблицаЗначений, Неопределено - таблица обнаруженных ошибок, при отсутствии ошибок - пустая.
//
Функция обКомплекснаяПроверкаСтруктурыПроекта(СтруктураПроверки, ОтключитьИндикатор = Ложь) Экспорт
	
	// Создаем таблицу для хранения списка ошибок.
	ТаблицаОшибок = Новый Структура;
	
	ТаблицаОшибокЗадачи = Новый ТаблицаЗначений;
	ТаблицаОшибокЗадачи.Колонки.Добавить("Задача");
	ТаблицаОшибокЗадачи.Колонки.Добавить("ЗадачаПредставление");
	ТаблицаОшибокЗадачи.Колонки.Добавить("ЗадачаТекстОшибки");
	ТаблицаОшибокЗадачи.Колонки.Добавить("ИндексКартинки");
	
	ТаблицаОшибокОбщие = Новый ТаблицаЗначений;
	ТаблицаОшибокОбщие.Колонки.Добавить("ТекстОшибки");
	
	ТаблицаОшибок.Вставить("Задачи"  , ТаблицаОшибокЗадачи);
	ТаблицаОшибок.Вставить("Общие"   , ТаблицаОшибокОбщие);

	Если обПроверитьПроект(ТаблицаОшибок, СтруктураПроверки, ОтключитьИндикатор) = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаОшибок;
	
КонецФункции

// Проверяет наличие ошибок в структуре проекта.
//
// Параметры:
//  Проект						 - СправочникСсылка.Проекты - проект. 
//  ДанныеРасшифровкиСообщения	 - Новый Структура - данные для формирования сообщения пользователю 
//  Отказ						 - Булево
// 
// Возвращаемое значение:
//  Булево 
//
Функция ЕстьОшибкиСтруктурыПроекта(Проект, ДанныеРасшифровкиСообщения, Отказ) Экспорт
	
	МассивыСтруктурОшибок = упоПроектыИЗадачиСервер.ДанныеПроверкиСтруктурыПроекта(Проект, Отказ);
	
	Если МассивыСтруктурОшибок.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли; 
	
	Заголовок = "";	
	ДокументРегистратор = Неопределено;
	ДокументСсылка = Неопределено;

	Если ДанныеРасшифровкиСообщения.Свойство("Заголовок") Тогда
		Заголовок = ДанныеРасшифровкиСообщения.Заголовок	
	КонецЕсли;
	
	Если ДанныеРасшифровкиСообщения.Свойство("ИмяДокумента") Тогда 
		ДокументРегистратор = Метаданные.Документы[ДанныеРасшифровкиСообщения.ИмяДокумента];
	КонецЕсли;
	
	Если ДанныеРасшифровкиСообщения.Свойство("ДокументСсылка") Тогда 
		ДокументСсылка = ДанныеРасшифровкиСообщения.ДокументСсылка;
	КонецЕсли;
	
	ТекстыОшибок = Новый Массив;
	ШаблонТекста = "%1 %2";
	Для каждого МассивСтруктурОшибок Из МассивыСтруктурОшибок Цикл	
		Для каждого ЭлементСтруктуры Из МассивСтруктурОшибок Цикл
			
			Если ЭлементСтруктуры.ВидОшибок = "Задачи" Тогда
				ТекстыОшибок.Добавить(СтрШаблон(ШаблонТекста, 
					ЭлементСтруктуры.ЗадачаПредставление, 
					ЭлементСтруктуры.ЗадачаТекстОшибки));
			Иначе	
	            ТекстыОшибок.Добавить(ЭлементСтруктуры.ТекстОшибки);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	ТекстСообщения = СтрСоединить(ТекстыОшибок, Символы.ПС);
	
	обСообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок);
		
	КомментарийОшибки = СтрШаблон(НСтр("ru = 'Ошибка при проверке структуры проекта: %1.
		|%2'"), Проект, ТекстСообщения); 
	
	ПараметрыОшибки = Новый Структура;
	ПараметрыОшибки.Вставить("Событие", "ОшибкаПриПроверкеСтруктурыПроекта");
	ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
	ПараметрыОшибки.Вставить("ОбъектМетаданных", ДокументРегистратор);
	ПараметрыОшибки.Вставить("Данные", ДокументСсылка);
	ПараметрыОшибки.Вставить("Комментарий", КомментарийОшибки);
	упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(ПараметрыОшибки);

	Возврат Истина;
		
КонецФункции 

#КонецОбласти

#Область СворачиваниеРазворачиваниеДереваСтруктурыПроекта

// См.упоПроектыИЗадачиСервер.СохранитьНастройкиРазвернутыхСтрокПользователя
//
Процедура СохранитьНастройкиРазвернутыхСтрокПользователя(Знач СписокОбъектов,
	Знач Проект,
	Знач Пользователь = Неопределено,
	ЭтоСправочники = Ложь) Экспорт
	
	
	упоПроектыИЗадачиСервер.СохранитьНастройкиРазвернутыхСтрокПользователя(СписокОбъектов,
		Проект,
		Пользователь,
		ЭтоСправочники);
	
КонецПроцедуры

// См. упоПроектыИЗадачиСервер.ПолучитьНастройкиРазвернутыхСтрокПользователя
//
Функция ПолучитьНастройкиРазвернутыхСтрокПользователя(Знач Проект,
	Знач Пользователь = Неопределено,
	ВозвращатьСправочники = Ложь) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьНастройкиРазвернутыхСтрокПользователя(Проект,
		Пользователь, ВозвращатьСправочники);
	
КонецФункции

// См. упоПроектыИЗадачиСервер.НаличиеНастройкиРазвернутыхСтрокПользователя
//
Функция НаличиеНастройкиРазвернутыхСтрокПользователя(Знач Проект, Знач Пользователь = Неопределено) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.НаличиеНастройкиРазвернутыхСтрокПользователя(Проект, Пользователь);
	
КонецФункции

#КонецОбласти

#Область ПанельСтатусовПроекта

// См. упоПроектыИЗадачиСервер.ПолучитьНеобходимоеДействие
//
Функция ПолучитьНеобходимоеДействие(Знач ТекущийСтатусПроекта, Знач ВыбранныйСтатус) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьНеобходимоеДействие(ТекущийСтатусПроекта, ВыбранныйСтатус);
	
КонецФункции

// См. упоПроектыИЗадачиСервер.СоздатьПровестиДокументСменыСтатуса
//
Функция СоздатьПровестиДокументСменыСтатуса(ИмяДокумента, РегистраторТекущегоСтатуса, Проект, 
	ПроверкаСтруктурыПроектаПройдена = Неопределено) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.СоздатьПровестиДокументСменыСтатуса(ИмяДокумента, РегистраторТекущегоСтатуса, Проект,
		ПроверкаСтруктурыПроектаПройдена);
	
КонецФункции

#КонецОбласти

// См. упоПроектыИЗадачиСервер.ПолучитьУдаляемыеОбъекты
//
Функция ПолучитьУдаляемыеОбъекты(ПроектнаяЗадача) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьУдаляемыеОбъекты(ПроектнаяЗадача);
	
КонецФункции

// См. упоПроектыИЗадачиСервер.ОбработатьУстановкуТекущегоПроекта
//
Функция ОбработатьУстановкуТекущегоПроекта(Проект) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ОбработатьУстановкуТекущегоПроекта(Проект);

КонецФункции

// См. упоПроектыИЗадачиСервер.ЗаписатьПрограммуПроектовВПроекте
//
Процедура ЗаписатьПрограммуПроектовВПроекте(Проект, ПрограммаПроектов) Экспорт
	
	упоПроектыИЗадачиСервер.ЗаписатьПрограммуПроектовВПроекте(Проект, ПрограммаПроектов);
	
КонецПроцедуры

//  Процедура отображает обнаруженные ошибки при проверке проекта.
//
// Параметры:
//  ТаблицаОшибок	 - ТаблицаЗначений	 - таблица обнаруженных ошибок, при отсутствии ошибок - пустая.
//  Проект			 - СправочникСсылка.Проекты	 - проект, по которому осуществлена проверка.
//
Процедура обОтобразитьСписокОшибок(ТаблицаОшибок, Проект = Неопределено) Экспорт
	
	Обработка = Обработки.упоПроверкаСтруктурыПроекта.Создать();
	
	Если НЕ Проект = Неопределено Тогда
		Обработка.Проект = Проект;
	КонецЕсли; 
	
	Обработка.ВывестиТаблицуОшибок(ТаблицаОшибок);
	
КонецПроцедуры

// См. упоПроектыИЗадачиСервер.ПолучитьКалендарьПроекта
//
Функция обПолучитьКалендарьПроекта(Проект) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьКалендарьПроекта(Проект);
	
КонецФункции

// Функция возвращает банковский календарь проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты
// 
// Возвращаемое значение:
//  СправочникСсылка.упоРабочиеКалендари, Неопределено - нет сведений о календаре на запрашиваемый год.
//
Функция обПолучитьБанковскийКалендарьПроекта(Проект) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА Рег.КалендарьБанковскихДней ЕСТЬ NULL 
		|			ТОГДА Рег.КалендарьПроекта
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Рег.КалендарьБанковскихДней = &ПустойКалендарь
		|					ТОГДА Рег.КалендарьПроекта
		|				ИНАЧЕ Рег.КалендарьБанковскихДней
		|			КОНЕЦ
		|	КОНЕЦ КАК Календарь
		|ИЗ
		|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	ПараметрыЗапроса = Новый Структура("Проект,ПустойКалендарь", Проект, Справочники.упоРабочиеКалендари.ПустаяСсылка());
	
	Результат = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	Если Результат.Пустой() Тогда
		Возврат Неопределено; // Нет сведений.
	КонецЕсли;
	
	Возврат Результат.Выгрузить()[0].Календарь; // Банковский календаря проекта.
	
КонецФункции

// Функция возвращает все календари проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проект.
// 
// Возвращаемое значение:
//  Структура - содержит календари проекта.
//
Функция обПолучитьКалендариПроекта(Проект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект" , Проект);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Рег.КалендарьПроекта КАК РабочийКалендарь,
		|	ЕСТЬNULL(Рег.КалендарьБанковскихДней, Рег.КалендарьПроекта) КАК БанковскийКалендарь
		|ИЗ
		|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Структура("Банковский,Рабочий", Неопределено, Неопределено); // Нет сведений.
	КонецЕсли;
	
	СтрокаПроект = Результат.Выгрузить()[0];
	Возврат Новый Структура("Банковский,Рабочий", СтрокаПроект.БанковскийКалендарь, СтрокаПроект.РабочийКалендарь); 
	
КонецФункции

#Область ПолученияОтдельныхСведенийОПроектнойЗадаче

// См. упоПроектыИЗадачиСервер.ПолучитьДанныеПроектнойЗадачи
// 
Функция обПолучитьДанныеПроектнойЗадачи(ВхПараметр, НужныеТаблицы = Неопределено, ВключаяЗануленные = Ложь) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьДанныеПроектнойЗадачи(ВхПараметр, НужныеТаблицы, ВключаяЗануленные);
	
КонецФункции

// Функция получает последние сведения о названии заданной проектной задачи.
//
// Параметры:
//  Задача	 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
// 
// Возвращаемое значение:
//  Строка, Неопределено - название задачи.
//
Функция обПолучитьНазваниеПроектнойЗадачи(Знач Задача) Экспорт

	// Получаем последние сведения о названии задачи.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА Рег.НазваниеЗадачи <> """"
		|			ТОГДА Рег.НазваниеЗадачи
		|		ИНАЧЕ Рег.ПроектнаяЗадача.НазваниеПроектнойЗадачи
		|	КОНЕЦ КАК НазваниеЗадачи
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &Задача) КАК Рег
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.упоВерсииПроекта КАК Версии
		|ПО
		|	Рег.Версия = Версии.Версия
		|ГДЕ
		|	Версии.Текущая
		|";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].НазваниеЗадачи; // Возвращаем название задачи.
	Иначе
		Возврат Неопределено; // Нет сведений.
	КонецЕсли;

КонецФункции

// См. упоПроектыИЗадачиСервер.НазваниеПроектнойЗадачи
//
Функция НазваниеПроектнойЗадачи(Задача, ДобавитьРасшифровкуДокумента = Ложь) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.НазваниеПроектнойЗадачи(Задача, ДобавитьРасшифровкуДокумента);
	
КонецФункции
 
// См. упоПроектыИЗадачиСервер.НазваниеПроектнойЗадачи
//
Функция НазванияПроектныхЗадач(ПроектныеЗадачи) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.НазванияПроектныхЗадач(ПроектныеЗадачи);
	
КонецФункции

// Функция получает последние сведения о родительской задаче заданной проектной задачи.
//
// Параметры:
//  Задача	 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
// 
// Возвращаемое значение:
//  ДокументСсылка.упоПроектнаяЗадача - родительская задача.
//
Функция обПолучитьРодителяПроектнойЗадачи(Знач Задача) Экспорт
	
	// Получаем последние сведения о родительской задаче.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.ЗадачаРодитель
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &Задача) КАК Рег
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.упоВерсииПроекта КАК Версии
		|ПО
		|	Рег.Версия = Версии.Версия
		|ГДЕ
		|	Версии.Текущая
		|";
		
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].ЗадачаРодитель; // Возвращаем родительскую задачу.
	Иначе
		Возврат Неопределено; // Нет сведений.
	КонецЕсли;

КонецФункции

// Функция получает последние сведения о сроках заданной проектной задачи. См. упоПроектыИЗадачиВызовСервера.обПолучитьСрокиПроектнойЗадачи
//
// Параметры:
//  ПроектнаяЗадача						 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
//  НеопределеноКогдаНетДанных	 - Булево	 - указывает на необходимость вернуть Неопределено, если сроки не найдены.
// 
// Возвращаемое значение:
//  Структура, Неопределено - сроки задачи.
//
Функция обПолучитьСрокиПроектнойЗадачи(Знач ПроектнаяЗадача, НеопределеноКогдаНетДанных = Истина) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьСрокиПроектнойЗадачи(ПроектнаяЗадача, Ложь);
	
КонецФункции

// Функция получает последние сведения о коде СДР заданной проектной задачи.
//
// Параметры:
//  Задача	 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
// 
// Возвращаемое значение:
//  Строка, Неопределено - код СДР задачи.
//
Функция обПолучитьКодСДРПроектнойЗадачи(Знач Задача) Экспорт
	
	// Получаем последние сведения о коде СДР задачи.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.КодСДР КАК КодСДР
		|ИЗ
		|	Справочник.Проекты КАК Рег
		|ГДЕ
		|	Рег.СсылкаНаПроектнуюЗадачу = &Задача
		|	И НЕ Рег.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].КодСДР; // Возвращаем код СДР задачи.
	Иначе
		Возврат Неопределено; // Нет сведений.
	КонецЕсли;

КонецФункции

// Функция получает последние сведения о предусловиях заданной проектной задачи.
//
// Параметры:
//  Задача	 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
// 
// Возвращаемое значение:
//  ТаблицаЗначений, Неопределено - таблица предусловий задачи.
//
Функция обПолучитьСписокПредУсловийПроектнойЗадачи(Знач Задача) Экспорт
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Задача);
	
	// Проверим, что заданная задача актуальна.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегПредусловия.ЗадачаПредшественник КАК ЗадачаПредшественник
		|ИЗ
		|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &ТекВерсия
		|				И ПроектнаяЗадача = &Задача) КАК РегПредусловия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|				,
		|				Версия = &ТекВерсия
		|					И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ПО РегПредусловия.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		|			И (РегПредусловия.СвязьСуществует)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено; // Нет сведений.
	Иначе
		ЗадачиПредшественники = Результат.Выгрузить().ВыгрузитьКолонку("ЗадачаПредшественник");
	КонецЕсли;
	
	// Получаем последние сведения о предусловиях задачи.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("ЗадачиПредшественники", ЗадачиПредшественники);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Задача КАК ПроектнаяЗадача,
		|	СвойстваПредшественника.ПроектнаяЗадача КАК Предшественник
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&ЗадачиПредшественники)) КАК СвойстваПредшественника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроектовПредшественников
		|		ПО СвойстваПредшественника.Версия = упоВерсииПроектовПредшественников.Версия
		|			И (упоВерсииПроектовПредшественников.Текущая)
		|			И (НЕ СвойстваПредшественника.ЗадачаОтменена)";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить(); // Возвращаем таблицу предусловий.

КонецФункции

// Формирует таблицу предусловий всех задач проекта.
//
// Параметры:
//  Проект	 - СправочникСсыллка.Проекты - собственно проект
// 
// Возвращаемое значение:
//  ТаблицаЗначенй - сформированная таблица предусловий.
//  Структура колонок: Объект, Предшественник.
//
Функция обПодготовитьТаблицуПредусловий(Знач Проект) Экспорт

	// Получим необходимые данные.
	// Получим все предусловия проектных задач для заданного проекта.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегСвязиЗадач.ПроектнаяЗадача КАК Задача,
		|	РегСвязиЗадач.ЗадачаПредшественник КАК ПредЗадача
		|ИЗ
		|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвязиЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ) КАК СвойстваПредшественника
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроектовПредшественников
		|			ПО СвойстваПредшественника.Версия = упоВерсииПроектовПредшественников.Версия
		|				И (упоВерсииПроектовПредшественников.Текущая)
		|				И (НЕ СвойстваПредшественника.ЗадачаОтменена)
		|		ПО РегСвязиЗадач.ЗадачаПредшественник = СвойстваПредшественника.ПроектнаяЗадача
		|ГДЕ
		|	РегСвязиЗадач.СвязьСуществует";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// См. упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи
//
Функция ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача, Свойство, ЗначениеПоУмолчанию = Неопределено, Версия = Неопределено) Экспорт
	Возврат упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача, 
		Свойство, ЗначениеПоУмолчанию, Версия)
КонецФункции 

#КонецОбласти

#Область ПолучениеПолныхДанныхСтруктурыПроектаИзБД

// См. упоПроектыИЗадачиСервер.ДатаСтартаПроекта
//
Функция ДатаСтартаПроекта(Проект, ЗаполнятьПустуюТекущей = Ложь, Версия = Неопределено) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ДатаСтартаПроекта(Проект, ЗаполнятьПустуюТекущей, Версия);
	
КонецФункции

#КонецОбласти

// Формирует структуру необходимых данных проекта.
//
// Параметры:
//  Проект				 - СправочникСсылка.Проекты	 - проект.
//  ДатаНачалаПроекта	 - Дата						 - планируемая дата старта проектных работ.
// 
// Возвращаемое значение:
//  ТаблицаЗначенй - сформированная структура данных.
//  Структура полей: Календарь, СтартоваяДата.
//
Функция обПодготовитьСтруктуруДанныхПроекта(Знач Проект, Знач ДатаНачалаПроекта) Экспорт

	// Создаем пустое дерево.
	Данные = Новый Структура;

	// Получим необходимые данные.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.КалендарьПроекта
		|ИЗ
		|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
		
	Результат = Запрос.Выполнить();
	
	// Добавляем нужные поля.
	Данные.Вставить("Календарь", 
		?(Результат.Пустой(), Справочники.упоРабочиеКалендари.ПустаяСсылка(), Результат.Выгрузить()[0].КалендарьПроекта));
	Данные.Вставить("ДатаНачалаПроекта", ДатаНачалаПроекта);
	
	Возврат Данные;
	
КонецФункции

// Формирует дерево проектных задач для заданного проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проект.
// 
// Возвращаемое значение:
//  ДеревоЗначений - сформированное дерево проектных задач.
//  Структура колонок: название задачи,
//  код СДР и ссылка на саму задачу.
//
Функция обСформироватьДеревоПроектныхЗадач(Знач Проект) Экспорт

	// Создаем пустое дерево.
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("НазваниеПроектнойЗадачи", , "Проектная задача");
	Дерево.Колонки.Добавить("КодСДР", , "Код СДР");
	Дерево.Колонки.Добавить("ПроектнаяЗадача", , "Связанный документ");
	
	// Получим последнюю иерархию проектных задач и их коды СДР для заданного проекта.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегСвойства.ПроектнаяЗадача КАК Задача,
		|	РегСвойства.ЗадачаРодитель КАК Родитель,
		|	ВЫБОР
		|		КОГДА РегСвойства.НазваниеЗадачи <> """"
		|			ТОГДА РегСвойства.НазваниеЗадачи
		|		ИНАЧЕ РегСвойства.ПроектнаяЗадача.НазваниеПроектнойЗадачи
		|	КОНЕЦ КАК НазваниеЗадачи,
		|	РегКодыСДР.КодСДР КАК КодСДР
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвойства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК РегКодыСДР
		|		ПО РегСвойства.ПроектнаяЗадача = РегКодыСДР.СсылкаНаПроектнуюЗадачу
		|			И (НЕ РегКодыСДР.ПометкаУдаления)
		|			И (НЕ РегСвойства.ЗадачаОтменена)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегСвойства.ПроектнаяЗадача.Дата";
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЗадач = Результат.Выгрузить();
	ТаблицаЗадач.Сортировать("КодСДР");
		
	обЗаполнитьДерево(Дерево, ТаблицаЗадач, Документы.упоПроектнаяЗадача.ПустаяСсылка());
	
	Возврат Дерево;
	
КонецФункции

// Заполняет иерархию.
//
// Параметры:
//  ПараметрРодитель	- СправочникСсылка.Проекты - родитель.
//  ТемпИерархия		- Соответствие				- иерархия.
//  ТемпКодыСДР			- Соответствие 				- список кодов СДР.
//  ПараметрПроверяемыйНаНижний - СправочникСсылка.Проекты - ссылка для проверки на нижний.
//  ВерхнийИзРодителей	 - СправочникСсылка.Проекты - верхний из родителей.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ЗаполнитьИерархию(ПараметрРодитель,
						  ТемпИерархия,
						  ТемпКодыСДР,
						  ПараметрПроверяемыйНаНижний = Неопределено,
						  ВерхнийИзРодителей = Неопределено) Экспорт
						  
	Если ПараметрРодитель = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ АктуальныеЗадачи_ВТ
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК Задачи
	|ГДЕ
	|	НЕ Задачи.ЗадачаОтменена
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Родитель КАК Родитель,
	|	Проекты.Ссылка КАК Ссылка,
	|	Проекты.КодСДР КАК КодСДР,
	|	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача
	|ИЗ
	|	АктуальныеЗадачи_ВТ КАК АктуальныеЗадачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО АктуальныеЗадачи.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьОтборПоРодителю
	|				ТОГДА Проекты.Ссылка В ИЕРАРХИИ (&Родителя)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ Проекты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Родителя", ПараметрРодитель);
	
	ТекПроект = ?(ПараметрРодитель.ЭтоПроектнаяЗадача,ПараметрРодитель.СсылкаНаПроектнуюЗадачу.Проект,ПараметрРодитель);
    Запрос.УстановитьПараметр("Проект",ТекПроект );
	Запрос.УстановитьПараметр("ЕстьОтборПоРодителю",ЗначениеЗаполнено(ПараметрРодитель));
	Запрос.УстановитьПараметр("ТекущаяВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ТекПроект));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = ПараметрПроверяемыйНаНижний Тогда
			ВерхнийИзРодителей = ПараметрРодитель;
		КонецЕсли;
		
		дети = ТемпИерархия[Выборка.Родитель];
		Если дети = Неопределено Тогда
			дети = Новый Соответствие;
		КонецЕсли;
		
		дети.Вставить(Выборка.Ссылка, Истина);
		ТемпИерархия.Вставить(Выборка.Родитель, дети);
		
		ТемпКодыСДР.Вставить(Выборка.Ссылка, ?(Выборка.КодСДР = "" И Выборка.ЭтоПроектнаяЗадача, "а", Выборка.КодСДР));
	КонецЦикла;
	
КонецФункции

// Заполняет коды СДР.
//
// Параметры:
//  ПараметрРодитель	 - СправочникСсылка.Проекты - родитель.
//  ТемпИерархия		 - Соответствие - иерархия элементов.
//  ТемпКодыСДР			 - Соответствие - список кодов СДР.
//  ТемпИзмененныеКодыСДР- Соответствие - измененные коды СДР. В качестве ключа выступает ссылка,
//										  а в качестве значения - новый код СДР.
//  ЭлементИнициатор	 - ДокументСсылка.упоПроектнаяЗадача 				- ссылка на элемент-инициатор.
//  Направление			 - ПеречисленияСсылка.упоНаправлениеДвиженияПоСДР 	- направление движения по СДР.
//  КодРодителя			 - Строка		- код СДР родителя.
//  Замещать			 - Булево 		- признак необходимости замещения.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ЗаполнитьКодыСДР(ПараметрРодитель,
						 ТемпИерархия,
						 ТемпКодыСДР,
						 ТемпИзмененныеКодыСДР,
						 ЭлементИнициатор,
						 Направление,
						 КодРодителя = Неопределено,
						 Замещать = Ложь) Экспорт
						 
	Если ПараметрРодитель = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	КоллекцияЭлементов = ТемпИерархия[ПараметрРодитель];
	
	Если КоллекцияЭлементов = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если КодРодителя = Неопределено Тогда
		КодРодителя = ТемпИзмененныеКодыСДР[ПараметрРодитель];
		Если КодРодителя = Неопределено Тогда
			КодРодителя = ТемпКодыСДР[ПараметрРодитель];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодРодителя) Тогда
			КодРодителя = КодРодителя + ".";
		КонецЕсли;
	КонецЕсли;
	
	КолвоЦифр = СтрДлина(Строка(КоллекцияЭлементов.Количество()));
	форматнаяСтрока = "ЧЦ=" + КолвоЦифр + "; ЧВН=; ЧГ=0";
	
	ТемпТаблицаЭлементов = Новый ТаблицаЗначений;
	ТемпТаблицаЭлементов.Колонки.Добавить("КодСДР");
	ТемпТаблицаЭлементов.Колонки.Добавить("Ссылка");
	
	СдвигаемаяСтрока = Неопределено;
	Для каждого ТемпЭлемент Из КоллекцияЭлементов Цикл
	    новаяСтрока = ТемпТаблицаЭлементов.Добавить();
		новаяСтрока.КодСДР = ТемпКодыСДР[ТемпЭлемент.Ключ];
		новаяСтрока.Ссылка = ТемпЭлемент.Ключ;
		
		Если НЕ ЭлементИнициатор = Неопределено И ЭлементИнициатор = ТемпЭлемент.Ключ Тогда
			СдвигаемаяСтрока = новаяСтрока;
		КонецЕсли;
	КонецЦикла;
	
	ТемпТаблицаЭлементов.Сортировать("КодСДР");
	
	Если НЕ СдвигаемаяСтрока = Неопределено Тогда
		Если Направление = Перечисления.упоНаправлениеДвиженияПоСДР.НаВерхнююСтроку Тогда
			ТемпТаблицаЭлементов.Сдвинуть(СдвигаемаяСтрока, -1 * ТемпТаблицаЭлементов.Индекс(СдвигаемаяСтрока));
		ИначеЕсли Направление = Перечисления.упоНаправлениеДвиженияПоСДР.НаНижнююСтроку Тогда
			ТемпТаблицаЭлементов.Сдвинуть(СдвигаемаяСтрока, ТемпТаблицаЭлементов.Количество() - 1 - ТемпТаблицаЭлементов.Индекс(СдвигаемаяСтрока));
		ИначеЕсли Направление = Перечисления.упоНаправлениеДвиженияПоСДР.НаСтрокуВверх 
			И ТемпТаблицаЭлементов.Индекс(СдвигаемаяСтрока) > 0 Тогда
			ТемпТаблицаЭлементов.Сдвинуть(СдвигаемаяСтрока, -1);
		ИначеЕсли Направление = Перечисления.упоНаправлениеДвиженияПоСДР.НаСтрокуВниз 
			И ТемпТаблицаЭлементов.Индекс(СдвигаемаяСтрока) < ТемпТаблицаЭлементов.Количество() - 1 Тогда	
			ТемпТаблицаЭлементов.Сдвинуть(СдвигаемаяСтрока, 1);
		КонецЕсли;	
	КонецЕсли;
	
	СтартовыйКод = 1; // Начальный код СДР для ствола дерева.
	
	
	Для Каждого ТемпЭлемент Из ТемпТаблицаЭлементов Цикл
		новыйКодСДР = Строка(КодРодителя) + Формат(СтартовыйКод, форматнаяСтрока);
		Если НЕ новыйКодСДР = ТемпЭлемент.КодСДР ИЛИ Замещать Тогда
			ТемпИзмененныеКодыСДР.Вставить(ТемпЭлемент.Ссылка, новыйКодСДР);
			
			упоПроектыИЗадачиВызовСервера.ЗаполнитьКодыСДР(ТемпЭлемент.Ссылка, ТемпИерархия, ТемпКодыСДР, ТемпИзмененныеКодыСДР, ЭлементИнициатор, Направление, новыйКодСДР + ".", Замещать);
		КонецЕсли;
		
		СтартовыйКод = СтартовыйКод + 1; // Увеличиваем код СДР на единицу.
	КонецЦикла;
	
КонецФункции

// См. упоПроектыИЗадачиСервер.УстановитьСтатьюЗатратРесурса
// 
Процедура УстановитьСтатьюЗатратРесурса(СтрокаТабличнойЧасти, ЗатиратьЗначение = Истина, ИмяКолонки = "СтатьяЗатрат") Экспорт 
	
	упоПроектыИЗадачиСервер.УстановитьСтатьюЗатратРесурса(СтрокаТабличнойЧасти, ЗатиратьЗначение, ИмяКолонки);
	
КонецПроцедуры

// Заполняет строку табличной части Проектный задачи документа Ручная актуализация
//  свойствами: ЭтоВеха, ДатаНачалаФакт, ДатаЗавершенияФакт.
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти
//  Объект				 - ДокументОбъект.упоРучнаяАктуализацияПроекта.
//
Процедура ЗаполнитьСтрокуСвойствамиПроектнойЗадачи(СтрокаТабличнойЧасти, Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект));
	Запрос.УстановитьПараметр("ПроектнаяЗадача", СтрокаТабличнойЧасти.ПроектнаяЗадача);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачалаФакт,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершенияФакт
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &ТекВерсия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &ТекВерсия
	               |					И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.Версия
	               |			И упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
	
КонецПроцедуры

// См. упоПроектыИЗадачиСервер.ПолучитьМассивЗадачСохраненияДанныхПроекта
//
Функция ПолучитьМассивЗадачСохраненияДанныхПроекта(ДокументСсылка, МассивИгнорируемыхТЧ = Неопределено) Экспорт
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьМассивЗадачСохраненияДанныхПроекта(ДокументСсылка, МассивИгнорируемыхТЧ)
	
КонецФункции 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ищет связь двух объектов.
// 
// Параметры:
//  ТаблицаСвязей – ТаблицаЗначений - содержит связи объектов.
//  ОбъектСвязи   – Произвольный - объект для которого ищется связь.
//  Связь         - Произвольный - искомая связь.
// 
// Возвращаемое значение:
//  Булево - признак связи.
// 
Функция обНайтиСвязь(ТаблицаСвязейВх, Индикатор = Неопределено)

	ТаблицаСвязей = ТаблицаСвязейВх.Скопировать();
	
	ОтборПоСвязи   = Новый Структура;
	ОтборПоОбъекту = Новый Структура;
		
	Пока Истина Цикл
		
		ЭтоПроход = Ложь;
		
		Для Каждого ДанныеСвязи Из ТаблицаСвязей Цикл
			
			ОтборПоСвязи.Вставить("ОбъектСвязи", ДанныеСвязи.Объект);
			НайденныеСвязи = ТаблицаСвязей.НайтиСтроки(ОтборПоСвязи);
			Если НайденныеСвязи.Количество() = 0 Тогда
			ОтборПоОбъекту.Вставить("Объект", ДанныеСвязи.Объект);
				НайденныеСтроки = ТаблицаСвязей.НайтиСтроки(ОтборПоОбъекту);
				Для Каждого ТекСтрока Из НайденныеСтроки Цикл
					ТаблицаСвязей.Удалить(ТекСтрока);
					ЭтоПроход = Истина;
				КонецЦикла;
				
				Прервать; // На следующий проход.
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаСвязей.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ЭтоПроход = Ложь Тогда
			Возврат Истина; // Дедлок.
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Рекурсивная функция. Проверяет, что одна задача подчинена по иерархии другой задаче.
// 
// Параметры:
//  ТаблицаЗадач – ТаблицаЗначений, содержит связи объектов.
//  Родитель     - СправочникСсылка.ПроектнаяЗадача, проектная задача,
//                 подчинение к которой, проверяется.
//               - СправочникСсылка.Проекты, единичный случай для родительской задачи.
//  Задача       - СправочникСсылка.Проекты, проектная задача,
//                 для которой ищется родительская задача.
// 
// Возвращаемое значение:
//  Булево - Истина, задача являетя родительской.
//              - Ложь, задача не является родительской.
// 
Функция обЭтоРодитель(ТаблицаЗадач, Родитель, Задача)

	Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Задача) Тогда
		Возврат Ложь; // Дошли до верха.
	КонецЕсли;
	
	Если Задача = Родитель Тогда
		Возврат Истина; // Нашли родителя.
	КонецЕсли;
	
	НайденыйОбъект = ТаблицаЗадач.Найти(Задача, "Задача");
	Если Не НайденыйОбъект = Неопределено Тогда
		Возврат обЭтоРодитель(ТаблицаЗадач, Родитель, НайденыйОбъект.Родитель);
	Иначе
		Возврат Ложь; // Нет родителя (разрыв в иерархии).
	КонецЕсли;
	
КонецФункции

// Рекурсивная функция. Ищет руководителя проектной задачи снизу вверх.
// 
// Параметры:
//  ТаблицаЗадач – ТаблицаЗначений, содержит иерархию проектных задач
//                 и их руководителей.
//  Проект       - СправочникСсылка.Проекты, проект в который входит проектная задача.
//  Задача       - СправочникСсылка.Проекты, проектная задача,
//                 для которой ищется руководитель.
//  Руководитель - СправочникСсылка.упоСотрудники, необязательный параметр, сотрудник по умолчанию.
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Неопределено - найденный руководитель проектной задачи.
// 
Функция НайтиРуководителяПроектнойЗадачи(ТаблицаЗадач, Задача, Руководитель = Неопределено)
	
	Возврат упоПроектыИЗадачиСервер.НайтиРуководителяПроектнойЗадачи(ТаблицаЗадач, Задача, Руководитель);
	
КонецФункции

// Функция определяет руководителя проектной задачи.
// Если руководитель проектной задаче не назначен, то возвращается руководитель проекта.
// 
// Параметры:
//  ДанныеДокумента – Структура - содержит полный слепок документа.
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Неопределено - руководитель проектной задачи.
// 
Функция ОпределитьРуководителяПроектнойЗадачи(ДанныеДокумента)

	Проект          = ДанныеДокумента.Проект;
	ПроектнаяЗадача = ДанныеДокумента.ПроектнаяЗадача;
	ЗадачаРодитель  = ДанныеДокумента.ЗадачаРодитель;
	
	// Для начала получим руководителя проекта.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.РуководительПроекта
		|ИЗ
		|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		РуководительПроекта = Результат.Выгрузить()[0].РуководительПроекта;
	КонецЕсли;
	
	массивВозврата = Новый Массив;
	массивВозврата.Добавить(РуководительПроекта);
		
	// Далее получим непосредственного руководителя проектной задачей, если он имеется.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", ПроектнаяЗадача);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.РуководительПроектнойЗадачи
		|ИЗ
		|	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК Рег
		|ГДЕ
		|	Рег.ПроектнаяЗадача = &Задача";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Руководитель = Результат.Выгрузить()[0].РуководительПроектнойЗадачи;
		Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Руководитель) Тогда
			массивВозврата.Добавить(Руководитель);
			Возврат массивВозврата;
		КонецЕсли;
	КонецЕсли;
	
	// Далее получим руководителя вышестоящей проектной задачей, если он имеется.
	
	// Получаем полную иерархию задач проекта и их руководителей.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегСвойства.ПроектнаяЗадача КАК Задача,
		|	РегСвойства.ЗадачаРодитель КАК Родитель,
		|	РегРуководители.РуководительПроектнойЗадачи КАК Руководитель
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвойства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РегРуководители
		|		ПО РегСвойства.ПроектнаяЗадача = РегРуководители.ПроектнаяЗадача
		|ГДЕ
		|	НЕ РегСвойства.ЗадачаОтменена";
	
	ТаблицаПроектныхЗадач = Запрос.Выполнить().Выгрузить();
	
	// Рекурсивно ищем руководителя.
	Руководитель = НайтиРуководителяПроектнойЗадачи(ТаблицаПроектныхЗадач, ЗадачаРодитель, РуководительПроекта);
	
	массивВозврата.Добавить(Руководитель);
	
	Возврат массивВозврата;

КонецФункции

Функция ПолучитьДетей(Родитель, Родители, ДетиУбраны)
	Если ДетиУбраны[Родитель] = Неопределено Тогда
		убратьРодителейИзДетей(Родители, Родитель, ДетиУбраны);
	КонецЕсли;
	
	Возврат Родители[Родитель];
КонецФункции

Функция ПолучитьСледующие(Задача, Следующие, СледующиеГотовы, СледующиеБезИерархии, Родители, ДетиУбраны)
	
	Если СледующиеГотовы[Задача] = Неопределено Тогда
		текСледующие = Следующие[Задача];
		Если НЕ текСледующие = Неопределено Тогда
			Для каждого текСледующий Из текСледующие Цикл
				ЗаполнитьСледующие(текСледующий, Задача, СледующиеБезИерархии, Родители, ДетиУбраны);
			КонецЦикла;
		КонецЕсли;
		
		СледующиеГотовы.Вставить(Задача, Истина);
	КонецЕсли;
	
	Возврат СледующиеБезИерархии[Задача];
	
КонецФункции

Процедура ЗаполнитьСледующие(ЭлементПроекта, СвязанныйЭлемент, Следующие, Родители, ДетиУбраны)
	
	детиЭлемента = ПолучитьДетей(ЭлементПроекта, Родители, ДетиУбраны);
	детиСвязанного = ПолучитьДетей(СвязанныйЭлемент, Родители, ДетиУбраны);
	
	Если детиЭлемента = Неопределено И детиСвязанного = Неопределено Тогда
		// Оба элемента связи не являются родителями.
		
		данныеЭлемента = Следующие[СвязанныйЭлемент];
		
		Если данныеЭлемента = Неопределено Тогда
			данныеЭлемента = Новый Соответствие;
		КонецЕсли;
		
		данныеЭлемента.Вставить(ЭлементПроекта, Истина);
		Следующие.Вставить(СвязанныйЭлемент, данныеЭлемента);
		
	ИначеЕсли НЕ детиЭлемента = Неопределено И НЕ детиСвязанного = Неопределено Тогда
		// Оба элемента связи являются родителями.
		
		Для каждого ребенокСвязанного Из детиСвязанного Цикл
			данныеЭлемента = Следующие[ребенокСвязанного.Ключ];
			Если данныеЭлемента = Неопределено Тогда
				данныеЭлемента = Новый Соответствие;
			КонецЕсли;
			
			Для каждого ребенок Из детиЭлемента Цикл
				данныеЭлемента.Вставить(ребенок.Ключ, Истина);
			КонецЦикла;
			
			Следующие.Вставить(ребенокСвязанного.Ключ, данныеЭлемента);
		КонецЦикла;
		
	ИначеЕсли детиЭлемента = Неопределено И НЕ детиСвязанного = Неопределено Тогда
		// Элемент связан с родителем.
		
		Для каждого ребенокСвязанного Из детиСвязанного Цикл
			данныеЭлемента = Следующие[ребенокСвязанного.Ключ];
			Если данныеЭлемента = Неопределено Тогда
				данныеЭлемента = Новый Соответствие;
			КонецЕсли;
			
			данныеЭлемента.Вставить(ЭлементПроекта, Истина);
			Следующие.Вставить(ребенокСвязанного.Ключ, данныеЭлемента);
		КонецЦикла;
		
	ИначеЕсли НЕ детиЭлемента = Неопределено И детиСвязанного = Неопределено Тогда
		// Элемент-родитель связан с элементом.
		
		данныеЭлемента = Следующие[СвязанныйЭлемент];
		Если данныеЭлемента = Неопределено Тогда
			данныеЭлемента = Новый Соответствие;
		КонецЕсли;
		
		Для каждого ребенок Из детиЭлемента Цикл
			данныеЭлемента.Вставить(ребенок.Ключ, Истина);
		КонецЦикла;
		
		Следующие.Вставить(СвязанныйЭлемент, данныеЭлемента);
	КонецЕсли;
	
КонецПроцедуры

// Процедура (рекурсивная) обрабатывает Соответствие, в котором каждому элементу соотнесены
// подчинненные элементы. Процедура устраняет из подчиненных элементов элементы Родители.
//
// Параметры:
//  Родители  	– Соответствие - содержит родителей и их подчиненных элементов:
//					Ключ		- Любая ссылка, элемент проекта, у которого если подчиненные элементы.
//					Значение	- Соответствие, подчиненные по иерархии элементы.
//  Родитель  	– СправочникСсылка, ДокументСсылка - элемент проекта, который обрабатывается на данной итерации.
//  ДетиУбраны – Соответствие - хранит элементы проекта, которые уже были обработаны.
//
Процедура убратьРодителейИзДетей(Родители, Родитель, ДетиУбраны)
	
	Дети = Родители[Родитель];
	Если Дети = Неопределено Тогда
		ДетиУбраны.Вставить(Родитель, Истина);
		Возврат;
	КонецЕсли;
	
	Для каждого кизРебенок Из Дети Цикл
		ребенок = кизРебенок.Ключ;
		Если Не Родители[ребенок] = Неопределено Тогда
			Если ДетиУбраны[ребенок] = Неопределено Тогда
				убратьРодителейИзДетей(Родители, ребенок, ДетиУбраны);
			КонецЕсли;
			Дети.Удалить(ребенок);
			Для каждого новыйРебенок Из Родители[ребенок] Цикл
			    Дети.Вставить(новыйРебенок.Ключ, Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Родители.Вставить(Родитель, Дети);
	ДетиУбраны.Вставить(Родитель, Истина);
	
КонецПроцедуры

// Функция проходит в глубину по следующим элементам и ищет элемент.
//
// Параметры:
//  текЭлемент  		– Произвольный - текущий рассматриваемый узел.
//  Следующие  			– Соответствие - содержит все следующие элементы для всех элементов.
//  ПредыдущиеЭлементы  – Соответствие - соответствие, содержащее элементы, которые необходимо найти.
//  ПройденныеПодВетки  – Соответствие - ветки, уже пройденные и проводить не имеет смысла.
//  НайденныйЦикл		– Массив - содержит элементы найденного цикла.
//
// Возвращаемое значение:
//   Булево   – Истина: в ветке найден предыдущий, Ложь: в ветке не найден предыдущий.
//
Функция ИскатьПредыдущиеВВетке(текЭлемент,
							   ПредыдущиеЭлементы,
							   ПройденныеПодВетки,
							   НайденныйЦикл, 
							   Следующие,
							   СледующиеГотовы,
							   СледующиеБезИерархии,
							   Родители,
							   детиУбраны)
							   
	Если НЕ ПредыдущиеЭлементы[текЭлемент] = Неопределено Тогда
		НайденныйЦикл.Добавить(текЭлемент);
		Возврат Истина;
	КонецЕсли;
	
	СледующиеЭлементы = ПолучитьСледующие(текЭлемент, Следующие, СледующиеГотовы, СледующиеБезИерархии, Родители, детиУбраны);
	Если НЕ СледующиеЭлементы = Неопределено Тогда
		Для каждого следующий Из СледующиеЭлементы Цикл
			Если следующий.Ключ = текЭлемент Тогда
				НайденныйЦикл.Добавить(текЭлемент);
				Возврат Истина;
			КонецЕсли;
			Если ПройденныеПодВетки[следующий.Ключ] = Неопределено Тогда
				Если ИскатьПредыдущиеВВетке(следующий.Ключ,
											ПредыдущиеЭлементы,
											ПройденныеПодВетки,
											НайденныйЦикл,
											Следующие,
											СледующиеГотовы, 
											СледующиеБезИерархии,
											Родители,
											детиУбраны) Тогда
					НайденныйЦикл.Добавить(текЭлемент);
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПройденныеПодВетки.Вставить(текЭлемент, Истина);
	
	Возврат Ложь;
КонецФункции

// Внутренняя процедура. Добавляет в заданную таблицу ошибок, новую ошибку по заданным параметрам.
// 
// Параметры:
//  Таблица             – ТаблицаЗначений - таблица ошибок.
//  Объект              – ДокументСсылка - ссылка на объект проверки в которой обнаружена ошибка.
//  ОбъектПредставление – Строка - представление объекта.
//  ТекстОшибки         – Строка - текст описания ошибки.
// 
// Возвращаемое значение:
//  Структура – содержит обнаруженные ошибки при проверке:
//	 * ВылезаетСрокНачала     - Строка - описание ошибки.
//	 * ВылезаетСрокЗавершения - Строка - описание ошибки.
//	 * ВылезаетКрайнийСрок    - Строка - описание ошибки.
// 
Процедура обДобавитьОшибку(Таблица, Объект = Неопределено, ОбъектПредставление = Неопределено, ИндексКартинки = 0, 
		ТекстОшибки = Неопределено, ДопИнформация = Неопределено)
	
	Если ТекстОшибки = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Нет текста.'");
	КонецЕсли;
	
	Если ДопИнформация <> Неопределено Тогда
		ТекстОшибки = ТекстОшибки + " %1";
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДопИнформация);
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		НоваяСтрока = Таблица.Задачи.Добавить();
		НоваяСтрока.Задача = Объект;
		НоваяСтрока.ЗадачаПредставление = ОбъектПредставление;
		НоваяСтрока.ЗадачаТекстОшибки = ТекстОшибки;
		НоваяСтрока.ИндексКартинки = ИндексКартинки;
	Иначе
		НоваяСтрока = Таблица.Общие.Добавить();
		НоваяСтрока.ТекстОшибки = ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

// Главная функция. Основной модуль. Проверяет проект на наличие ошибок по заданным условиям,
// и добавляет обнаруженные ошибки в заданную таблицу ошибок.
// 
// Параметры:
//  ТаблицаОшибок       – ТаблицаЗначений - таблица ошибок.
//  СтруктураПроверки   – Структура - содержит параметры (условия) проверки,
//                        настроенные пользователем или системой.
//  ОтключитьИндикатор  – Булево - признак индикации состояния процесса проверки.
// 
// Возвращаемое значение:
//  Булево - Признак успешного проведения проверки.
// 
Функция обПроверитьПроект(ТаблицаОшибок, СтруктураПроверки, ОтключитьИндикатор = Ложь)

	// Разберем входную структуру.
	Проект                         = СтруктураПроверки.Проект;
	ПроверятьСтруктуруЗадач        = СтруктураПроверки.ПроверятьСтруктуруЗадач;
	ПроверятьСрокиЗадач            = СтруктураПроверки.ПроверятьСрокиЗадач;
	ПроверятьЗаполнениеСроковЗадач = СтруктураПроверки.ПроверятьЗаполнениеСроковЗадач;
	ПроверятьПредУсловияЗадач      = СтруктураПроверки.ПроверятьПредУсловияЗадач;
	ПроверятьЗацикливание          = СтруктураПроверки.ПроверятьЗацикливание;
	
	Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Проект) Тогда
		Возврат Ложь; // Нечего проверять - пустая таблица.
	КонецЕсли;
	
	// ПРЕДВАРИТЕЛЬНАЯ ПОДГОТОВКА ДАННЫХ ДЛЯ КОМПЛЕКСНОЙ ПРОВЕРКИ ПРОЕКТА.
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ТекущаяВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	
	// Получим статус проекта.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Рег.СтатусПроекта
	|ИЗ
	|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		обДобавитьОшибку(ТаблицаОшибок, Документы.упоПроектнаяЗадача.ПустаяСсылка(), "", 0, НСтр("ru = 'Проект не был зарегистрирован'"));
		
		Возврат Истина; // Выходим, так как дальнейшие действия не имеют смысла.
	КонецЕсли;
		
	// Получим все предусловия проектных задач для заданного проекта.
	// Получим полное описание каждой проектной задачи для заданного проекта.
	// Место в иерархии, основные параметры и сроки.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСвязиЗадач.ПроектнаяЗадача КАК Объект,
	|	РегСвязиЗадач.ЗадачаПредшественник КАК ОбъектСвязи,
	|	РегСвязиЗадач.ТипСвязи КАК ТипСвязи,
	|	РегСвязиЗадач.Задержка КАК Задержка
	|ИЗ
	|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК РегСвязиЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|				И (упоВерсииПроекта.Текущая)
	|				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	|		ПО РегСвязиЗадач.ЗадачаПредшественник = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|ГДЕ
	|	РегСвязиЗадач.СвязьСуществует
	|	И НЕ РегСвязиЗадач.СвязьМеждуПроектами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСвойства.ПроектнаяЗадача КАК Задача,
	|	РегСвойства.ЗадачаРодитель КАК Родитель,
	|	РегСвойства.КрайнийСрок КАК КрайнийСрок,
	|	РегСроки.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	РегСроки.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	РегСвойства.РучнойВводСроков КАК РучнойВводСроков,
	|	РегСвойства.ЭтоПакетРабот КАК ЭтоПакетРабот,
	|	Проекты.КодСДР + "" "" + Проекты.Наименование КАК НазваниеЗадачи,
	|	ВЫБОР
	|		КОГДА РегСвойства.ЭтоВеха
	|			ТОГДА 4
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РегСвойства.ЭтоМодельПакетаРабот
	|					ТОГДА 3
	|				ИНАЧЕ ВЫБОР
	|						КОГДА НЕ РегСвойства.ЭтоПакетРабот И НЕ РегСвойства.ЭтоМодельПакетаРабот
	|							ТОГДА 0
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК РегСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК РегСроки
	|		ПО РегСвойства.ПроектнаяЗадача = РегСроки.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО РегСвойства.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	|ГДЕ
	|	НЕ РегСвойства.ЗадачаОтменена
	|
	|УПОРЯДОЧИТЬ ПО
	|	Задача";
	
	РезультатВыполнения = Запрос.ВыполнитьПакет();
	
	ТаблицаСвязейЗадач = РезультатВыполнения[0].Выгрузить();
	ТаблицаЗадач = РезультатВыполнения[1].Выгрузить();
	
	// КОМПЛЕКСНАЯ ПРОВЕРКА ПРОЕКТНЫХ ЗАДАЧ.	
	
	Если ПроверятьСтруктуруЗадач = Истина 
		Или ПроверятьЗаполнениеСроковЗадач = Истина 
		Или ПроверятьСрокиЗадач = Истина 
		Или ПроверятьПредУсловияЗадач Тогда
		
		// Перебираем данные каждой задачи проекта.
		Для Каждого ДанныеЗадачи Из ТаблицаЗадач Цикл
			
			// Сразу получим нужные данные о задаче.
			Задача           = ДанныеЗадачи.Задача;
			НазваниеЗадачи   = ДанныеЗадачи.НазваниеЗадачи;
			Родитель         = ДанныеЗадачи.Родитель;
			ИндексКартинки	 = ДанныеЗадачи.ИндексКартинки;
			
			// Сразу получим нужные данные о сроках задачи.
			ЗадачаДатаНачала     = ?(ДанныеЗадачи.ДатаНачалаПлан = NULL, Неопределено, 
				НачалоДня(ДанныеЗадачи.ДатаНачалаПлан));
			ЗадачаДатаЗавершения = ?(ДанныеЗадачи.ДатаЗавершенияПлан = NULL, Неопределено, 
				НачалоДня(ДанныеЗадачи.ДатаЗавершенияПлан));
			ЗадачаКрайнийСрок    = ДанныеЗадачи.КрайнийСрок;
				
			Если ПроверятьСтруктуруЗадач = Истина Или ПроверятьЗаполнениеСроковЗадач = Истина Или ПроверятьСрокиЗадач = Истина Тогда
		
				// Ищем родительскую задачу.
				ДанныеРодителя = ТаблицаЗадач.Найти(Родитель, "Задача");
				Если Не Родитель.Пустая() Тогда
					Если ДанныеРодителя = Неопределено Тогда
						Если ПроверятьСтруктуруЗадач = Истина Тогда
							обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, НСтр("ru = 'В СДР не найдена задача-родитель'"));
						КонецЕсли; // ПроверятьСтруктуруЗадач.
					Иначе
						Если ПроверятьСтруктуруЗадач = Истина И ДанныеРодителя.ЭтоПакетРабот = Истина Тогда
							обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
								НСтр("ru = 'Задача-родитель является пакетом работ и не может выступать в роли родительской задачи!'"));
						КонецЕсли; // ПроверятьСтруктуруЗадач.
						
						// Сразу получим нужные данные о сроках родительской задачи.
						РодительДатаНачала     = ?(ДанныеРодителя.ДатаНачалаПлан = NULL, Неопределено, 
							НачалоДня(ДанныеРодителя.ДатаНачалаПлан));
						РодительДатаЗавершения = ?(ДанныеРодителя.ДатаЗавершенияПлан = NULL, Неопределено, 
							НачалоДня(ДанныеРодителя.ДатаЗавершенияПлан));
						РодительКрайнийСрок    = ДанныеРодителя.КрайнийСрок;
						
					КонецЕсли;
				КонецЕсли;
				
				// Ищем сроки задачи.
				// Возможно, эта проверка - лишняя.
				Если Не ЗадачаДатаНачала = Неопределено И Не ЗадачаДатаЗавершения = Неопределено Тогда
					// Такое может быть, если нет записи в регистре сроков.
					Если ПроверятьЗаполнениеСроковЗадач = Истина Тогда
						// Проверим сроки на заполненность.
						Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ЗадачаДатаНачала) Тогда
							обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, НСтр("ru = 'Пустая дата начала работ'"));
						КонецЕсли;
						Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ЗадачаДатаЗавершения) Тогда
							обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, НСтр("ru = 'Пустая дата завершения работ'"));
						КонецЕсли;
						// Крайний срок может быть незаполненным по определению.
					КонецЕсли;
						
					// Проверим корректность сроков текущей задачи.
					Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ЗадачаДатаЗавершения) 
						И ЗадачаДатаЗавершения < ЗадачаДатаНачала Тогда
						обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, НСтр("ru = 'Конфликт между датами начала и завершения работ'"));
					КонецЕсли;

					Если ПроверятьСрокиЗадач = Истина Тогда
						Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ЗадачаКрайнийСрок) Тогда
							Если ЗадачаКрайнийСрок < ЗадачаДатаНачала Тогда
								обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
									НСтр("ru = 'Конфликт между датой начала работ и крайним сроком'"));
							КонецЕсли;
							Если ЗадачаКрайнийСрок < ЗадачаДатаЗавершения Тогда
								обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
									НСтр("ru = 'Конфликт между датой завершения работ и крайним сроком'"));
							КонецЕсли;
						КонецЕсли;
						
						ВходящиеПараметы = Новый Структура;
						ВходящиеПараметы.Вставить("Родитель", Родитель);
						ВходящиеПараметы.Вставить("ДанныеРодителя", ДанныеРодителя);
						ВходящиеПараметы.Вставить("РодительДатаНачала", РодительДатаНачала);
						ВходящиеПараметы.Вставить("РодительДатаЗавершения", РодительДатаЗавершения);
						ВходящиеПараметы.Вставить("ТаблицаОшибок", ТаблицаОшибок);
						ВходящиеПараметы.Вставить("Задача", Задача);
						ВходящиеПараметы.Вставить("НазваниеЗадачи", НазваниеЗадачи);
						ВходящиеПараметы.Вставить("ЗадачаДатаНачала", ЗадачаДатаНачала);
						ВходящиеПараметы.Вставить("РодительКрайнийСрок", РодительКрайнийСрок);
						ВходящиеПараметы.Вставить("ЗадачаДатаЗавершения", ЗадачаДатаЗавершения);
						ВходящиеПараметы.Вставить("ЗадачаКрайнийСрок", ЗадачаКрайнийСрок);
						ВходящиеПараметы.Вставить("ИндексКартинки", ИндексКартинки);
						ПроверитьСрокиЗадачИЗадачРодителей(ВходящиеПараметы);
						
					КонецЕсли; // ПроверятьСрокиЗадач.
				Иначе
					обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, НСтр("ru = 'Не обнаружены плановые сроки проектной задачи'"));
				КонецЕсли;
				
			КонецЕсли; // Проверки.
			
			Если ПроверятьПредУсловияЗадач = Истина Тогда
				// Ищем предусловия текущей задачи.
				Отбор = Новый Структура("Объект", Задача);
				ПредусловияЗадачи = ТаблицаСвязейЗадач.НайтиСтроки(Отбор);
				
				Для Каждого ПредУсловие Из ПредусловияЗадачи Цикл
					// Сразу получим нужные данные о предшественнике задачи.
					Предшественник = ПредУсловие.ОбъектСвязи;
					
					// Проверим тип предшественника.
					Если ТипЗнч(Предшественник) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
						НазваниеПредшественника = Предшественник.НазваниеПроектнойЗадачи;
						
						// Ищем задачу-предшественника, ее может и не быть.
						ДанныеПредшественника = ТаблицаЗадач.Найти(Предшественник, "Задача");
						Если Не ДанныеПредшественника = Неопределено Тогда
							// Сразу получим нужные данные о сроке завершения задачи-предшественника
							ПредшественникДатаЗавершения = ДанныеПредшественника.ДатаЗавершенияПлан;
							ПредшественникДатаНачала = ДанныеПредшественника.ДатаНачалаПлан;
							
							// Проверим что задача-предшественник не является самой задачей.
							Если Предшественник = Задача Тогда
								СтрокаСообщения = НСтр("ru = 'Задача является предусловием сама для себя'");
								обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, СтрокаСообщения);
							Иначе
								// Проверим задачу-предшественника на родительскую связь.
								Если обЭтоРодитель(ТаблицаЗадач, Предшественник, Задача) Тогда
									СтрокаСообщения = НСтр("ru = 'Предусловие является задачей-родителем'");
									обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, СтрокаСообщения);
								КонецЕсли;
								// Проверим задачу-предшественника на подчиненность.
								Если обЭтоРодитель(ТаблицаЗадач, Задача, Предшественник) Тогда
									СтрокаСообщения = НСтр("ru = 'Предусловие является подчиненной задачей'");
									обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, СтрокаСообщения);
								КонецЕсли;
							КонецЕсли;
							
						Иначе	
							// Не нашли задачу-предшественника вообще.
							СтрокаСообщения = НСтр("ru = 'Предусловие не обнаружено в структуре проекта'");
							обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, СтрокаСообщения);
						КонецЕсли;
						
					Иначе
						// Не определили тип предшественника. 
						СтрокаСообщения = НСтр("ru = 'Неправильный тип объекта-предусловия'");
						обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки, СтрокаСообщения);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли; // ПроверятьПредУсловияЗадач.
			
		КонецЦикла;
		
	КонецЕсли;
			
	Если ПроверятьЗацикливание = Истина Тогда
		
		// Поиск цикличных связей.
		
		// Формируем полную таблицу элементов проекта и связей между ними.
		ТаблицаЭлементов = Новый ТаблицаЗначений;
		ТаблицаЭлементов.Колонки.Добавить("ЭлементПроекта");
		ТаблицаЭлементов.Колонки.Добавить("ЭлементРодитель"); 		
		Для Каждого СтрокаЗадача Из ТаблицаЗадач Цикл     			
			НоваяСтрокаЭлемент = ТаблицаЭлементов.Добавить();
			НоваяСтрокаЭлемент.ЭлементПроекта = СтрокаЗадача.Задача;
			НоваяСтрокаЭлемент.ЭлементРодитель = СтрокаЗадача.Родитель;
		КонецЦикла;    		
	
		ТаблицаСвязейПолная = Новый ТаблицаЗначений;
		ТаблицаСвязейПолная.Колонки.Добавить("ЭлементПроекта");
		ТаблицаСвязейПолная.Колонки.Добавить("СвязанныйЭлемент");		                   
		Для Каждого СтрокаСвязьЗадачи Из ТаблицаСвязейЗадач Цикл
			НоваяСтрокаСвязь = ТаблицаСвязейПолная.Добавить();
			НоваяСтрокаСвязь.ЭлементПроекта = СтрокаСвязьЗадачи.Объект;
			НоваяСтрокаСвязь.СвязанныйЭлемент = СтрокаСвязьЗадачи.ОбъектСвязи;
		КонецЦикла;    		
		
		ТаблицаОшибокПредусловий = Новый ТаблицаЗначений;
		ТаблицаОшибокПредусловий.Колонки.Добавить("ЭлементПроекта");
		ТаблицаОшибокПредусловий.Колонки.Добавить("ЭлементПроектаПредставление");
		ТаблицаОшибокПредусловий.Колонки.Добавить("ТекстОшибки");
		
		упоПроектыИЗадачиСервер.ПроверитьНаЦикличность(ТаблицаЭлементов, ТаблицаСвязейПолная, ТаблицаОшибокПредусловий,
			Документы.упоПроектнаяЗадача.ПустаяСсылка());
		Для Каждого СтрокаОшибкаПредусловия Из ТаблицаОшибокПредусловий Цикл
			Если ТипЗнч(СтрокаОшибкаПредусловия.ЭлементПроекта) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
				СтрокаОшибка = ТаблицаОшибок.Задачи.Добавить();
				СтрокаОшибка.Задача = СтрокаОшибкаПредусловия.ЭлементПроекта;
				СтрокаОшибка.ЗадачаПредставление = СтрокаОшибкаПредусловия.ЭлементПроектаПредставление;
				СтрокаОшибка.ЗадачаТекстОшибки = СтрокаОшибкаПредусловия.ТекстОшибки;
			КонецЕсли;	 			
		КонецЦикла;  
		
	КонецЕсли;
			
	Возврат Истина;
	
КонецФункции

// Рекурсивная функция. Заполняет дерево задач от заданной задачи родителя.
// 
// Параметры:
//  Дерево        – ДеревоЗначений, содержит пустое дерево, актуально при первом вызове,
//                - СтрокаДереваЗначений, содержит ветку дерева для дальнейшего заполнения.
//  ТаблицаЗадач  – ТаблицаЗначений, содержит иерархию проектных задач.
//  Родитель      - СправочникСсылка.Проекты, содержит сам проект, актуально при первом вызове,
//                - ДокументСсылка.упоПроектнаяЗадача, содержитм задачу родителя.
//  ЭтоКорень     - Булево, признак самого верхнего уровня дерева.
// 
// Возвращаемое значение:
//  ДеревоЗначенй – сформированное дерево проектных задач.
//                       Структура колонок: название задачи,
//                       код СДР и ссылка на саму задачу.
// 
Функция обЗаполнитьДерево(Дерево, ТаблицаЗадач, Родитель)
	
	// Формируем отбор по родителю.
	Отбор = Новый Структура("Родитель", Родитель);
	
	// Находим все задачи по заданному родителю.
	НайденныеСтроки = ТаблицаЗадач.НайтиСтроки(Отбор);
	СтартовыйКод = 1; // Начальный код СДР для ствола дерева.
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Ветка = Дерево.Строки.Добавить(); // Добавляем строку к дереву.
		Ветка.НазваниеПроектнойЗадачи = НайденнаяСтрока.НазваниеЗадачи; // Определяем строке название задачи.
		Ветка.КодСДР                  = НайденнаяСтрока.КодСДР; // Определяем код СДР задачу.
		Ветка.ПроектнаяЗадача         = НайденнаяСтрока.Задача; // Определяем строке задачу.
		обЗаполнитьДерево(Ветка, ТаблицаЗадач, Ветка.ПроектнаяЗадача); // Вызываем рекурсию.
	КонецЦикла;
	
КонецФункции

// Рекурсивная функция. Рассчитывает и заполняет заданную таблицу задач кодами СДР по заданным параметрам.
// 
// Параметры:
//  ТаблицаКодовСДР - ТаблицаЗначений - содержит подготовленную таблицу задач для заполнения кодами СДР.
//  ТаблицаЗадач    – ТаблицаЗначений - содержит таблицу иерархии задач.
//  Родитель        – ДокументСсылка.упоПроектнаяЗадача - родительская задача от которой ведется расчет.
//  КодРодителя     – Сторка - код СДР родительской задачи, на конце ".".
//  Замещать        – Булево - если Истина, то спускаемся по иерархии, даже если код СДР не поменялся.
// 
Функция обЗаполнитьКодыСДР(ТаблицаКодовСДР, ТаблицаЗадач, Родитель, КодРодителя = "", Замещать = Ложь, ИскатьДубли = Ложь)
	
	// Формируем отбор по родителю.
	Отбор = Новый Структура("Родитель", Родитель);
	
	// Находим все задачи по заданному родителю.
	НайденныеЗадачи = ТаблицаЗадач.НайтиСтроки(Отбор);
	
	КолвоЦифр = СтрДлина(Строка(НайденныеЗадачи.Количество()));
	форматнаяСтрока = "ЧЦ=" + КолвоЦифр + "; ЧВН=; ЧГ=0";
	
	СтартовыйКод = 1; // Начальный код СДР для ствола дерева.
	Для Каждого НайденнаяЗадача Из НайденныеЗадачи Цикл
		
		Строка = Неопределено;
		ужеБылаЗаполнена = Ложь; ПредКод = "";
		Если ИскатьДубли Тогда
			Строка = ТаблицаКодовСДР.Найти(НайденнаяЗадача.Задача, "ПроектнаяЗадача");
			Если Не Строка = Неопределено Тогда
				ужеБылаЗаполнена = Истина; ПредКод = Строка.КодСДР;
			КонецЕсли;
		КонецЕсли;
		
		Если Строка = Неопределено Тогда
			Строка = ТаблицаКодовСДР.Добавить(); // Добавляем строку.
			Строка.ПроектнаяЗадача 	= НайденнаяЗадача.Задача; // Определяем строке задачу.
		КонецЕсли;
		Строка.КодСДР = Строка(КодРодителя) + Формат(СтартовыйКод, форматнаяСтрока);
		
		СтартовыйКод = СтартовыйКод + 1; // Увеличиваем код СДР на единицу.
		
		Если Не Строка.КодСДР = ?(ужеБылаЗаполнена, ПредКод, НайденнаяЗадача.КодСДР) ИЛИ Замещать Тогда
			// Вызываем рекурсию.
			обЗаполнитьКодыСДР(ТаблицаКодовСДР, ТаблицаЗадач, Строка.ПроектнаяЗадача, Строка.КодСДР + ".", , ИскатьДубли);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Обновляет коды СДР.
//
// Похожий функционал реализован в функции ЗаполнитьКодыСДРвДереве формы обработки упоУпрощенныйВводСтруктурыПроекта,
// а также в упоБиблиотекаШаблоновВызовСервера.РассчитатьКодСДРДляЗадач.
//
// Параметры:
//  ЭлементИнициатор	 - ДокументСсылка.упоПроектнаяЗадача - ссылка на проектную задачу.
//  НовыйРодитель		 - ДокументСсылка.упоПроектнаяЗадача - необязательный. Новый родитель, если параметр задан.
//  СтарыйРодитель		 - ДокументСсылка.упоПроектнаяЗадача - необязательный. Старый родитель.
//  Направление			 - ПеречисленияСсылка.упоНаправлениеДвиженияПоСДР - направление движения по СДР.
//  ЗаписыватьИзменения	 - Булево - признак необходимости записи изменений по кодам в объектах.
//
// Возвращаемое значение:
//	Соответствие - в качестве ключа выступает ссылка, а в качестве значения - новый код СДР.
//
Функция обОбновитьКодСДР(
			Знач ЭлементИнициатор = Неопределено, 
			Знач НовыйРодитель = Неопределено, 
			Знач СтарыйРодитель = Неопределено, 
			Направление = Неопределено, 
			ЗаписыватьИзменения = Ложь) Экспорт 
			
	// Возвращает соответствие ссылка -> КодСДР (новый).
	ТемпИзмененныеКодыСДР = Новый Соответствие;
	ТемпКодыСДР = Новый Соответствие;
	ТемпИерархия = Новый Соответствие;
	
	Если ЭлементИнициатор = Неопределено И НовыйРодитель = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементИнициатор = ПолучитьСсылкуНаПроект(ЭлементИнициатор);
	НовыйРодитель = ПолучитьСсылкуНаПроект(НовыйРодитель);
	СтарыйРодитель = ПолучитьСсылкуНаПроект(СтарыйРодитель);
	
	Если Не ЭлементИнициатор = Неопределено И Не ЗначениеЗаполнено(НовыйРодитель) Тогда
		НовыйРодитель = ЭлементИнициатор.Родитель;
	КонецЕсли;
	
	ВерхнийИзРодителей = Неопределено;
	
	Если Направление = Неопределено Тогда
		Направление = Перечисления.упоНаправлениеДвиженияПоСДР.НеПеремещать;
	КонецЕсли;
	
	// Получим иерархию задач по родителям.
	
	Если СтарыйРодитель = НовыйРодитель Тогда
		ЗаполнитьИерархию(СтарыйРодитель, ТемпИерархия, ТемпКодыСДР);
	Иначе
		ЗаполнитьИерархию(СтарыйРодитель, ТемпИерархия, ТемпКодыСДР, НовыйРодитель, ВерхнийИзРодителей);
		Если Не СтарыйРодитель = ВерхнийИзРодителей Или СтарыйРодитель = Неопределено Тогда
			ЗаполнитьИерархию(НовыйРодитель, ТемпИерархия, ТемпКодыСДР, СтарыйРодитель, ВерхнийИзРодителей);
		КонецЕсли;
		
		// Если родители разные (т.е. изменилась иерархия элемента), то надо элемент поставить в конец.
		Если ЗначениеЗаполнено(СтарыйРодитель) И ЗначениеЗаполнено(НовыйРодитель) И ЗначениеЗаполнено(ЭлементИнициатор) Тогда
			ТемпКодыСДР.Вставить(ЭлементИнициатор, "а");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭлементИнициатор = Неопределено И ТемпКодыСДР[ЭлементИнициатор] = Неопределено Тогда
		// Значит элемент новый и надо присвоить ему какой-нибудь код СДР.
		ТемпКодыСДР.Вставить(ЭлементИнициатор, "а");
	КонецЕсли;
	
	Если Не ЭлементИнициатор = Неопределено Тогда
		дети = ТемпИерархия[СтарыйРодитель];
		Если НЕ дети = Неопределено Тогда
			дети.Удалить(ЭлементИнициатор);
		КонецЕсли;
		
		дети = ТемпИерархия[НовыйРодитель];
		Если дети = Неопределено Тогда
			дети = Новый Соответствие;
			ТемпИерархия.Вставить(НовыйРодитель, дети);
		КонецЕсли;
		
		дети.Вставить(ЭлементИнициатор, Истина);
	КонецЕсли;
	
	Если ВерхнийИзРодителей = Неопределено Тогда
		ЗаполнитьКодыСДР(СтарыйРодитель, ТемпИерархия, ТемпКодыСДР, ТемпИзмененныеКодыСДР, ЭлементИнициатор, Направление);
		ЗаполнитьКодыСДР(НовыйРодитель , ТемпИерархия, ТемпКодыСДР, ТемпИзмененныеКодыСДР, ЭлементИнициатор, Направление);
	Иначе
		ЗаполнитьКодыСДР(ВерхнийИзРодителей, ТемпИерархия, ТемпКодыСДР, ТемпИзмененныеКодыСДР, ЭлементИнициатор, Направление);
		Если ВерхнийИзРодителей = СтарыйРодитель Тогда
			ЗаполнитьКодыСДР(НовыйРодитель, ТемпИерархия, ТемпКодыСДР, ТемпИзмененныеКодыСДР, ЭлементИнициатор, Направление);
		Иначе
			ЗаполнитьКодыСДР(СтарыйРодитель, ТемпИерархия, ТемпКодыСДР, ТемпИзмененныеКодыСДР, ЭлементИнициатор, Направление);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаписыватьИзменения Тогда
		Для Каждого ТемпЭлемент Из ТемпИзмененныеКодыСДР Цикл
			Попытка
				Обж = ТемпЭлемент.Ключ.ПолучитьОбъект();
				Обж.КодСДР = ТемпЭлемент.Значение;
				Обж.Записать();
			Исключение
				Сообщение = НСтр("ru = 'Неудачная попытка обновления кода СДР для элемента %1 описание ошибки: %2'");
				Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, ТемпЭлемент.Ключ, ОписаниеОшибки());
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТемпИзмененныеКодыСДР;
	
КонецФункции

Функция ПолучитьСсылкуНаПроект(СсылкаНа)
	
	Если ЗначениеЗаполнено(СсылкаНа) И ТипЗнч(СсылкаНа) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Возврат упоПроектыИЗадачиВызовСервера.НайтиСвязанныйЭлементПроекта(СсылкаНа);
	КонецЕсли;
	
	Возврат СсылкаНа;
	
КонецФункции

Процедура ПроверитьСрокиЗадачИЗадачРодителей(ВходящиеПараметы)
	
	Родитель = ВходящиеПараметы.Родитель;
	ДанныеРодителя = ВходящиеПараметы.ДанныеРодителя;
	РодительДатаНачала = ВходящиеПараметы.РодительДатаНачала;
	РодительДатаЗавершения = ВходящиеПараметы.РодительДатаЗавершения;
	ТаблицаОшибок = ВходящиеПараметы.ТаблицаОшибок;
	Задача = ВходящиеПараметы.Задача;
	НазваниеЗадачи = ВходящиеПараметы.НазваниеЗадачи;
	ЗадачаДатаНачала = ВходящиеПараметы.ЗадачаДатаНачала;
	РодительКрайнийСрок = ВходящиеПараметы.РодительКрайнийСрок;
	ЗадачаДатаЗавершения = ВходящиеПараметы.ЗадачаДатаЗавершения;
	ЗадачаКрайнийСрок = ВходящиеПараметы.ЗадачаКрайнийСрок;
	ИндексКартинки = ВходящиеПараметы.ИндексКартинки;

	Если Родитель.Пустая() Или ДанныеРодителя = Неопределено Или РодительДатаНачала = Неопределено
		Или РодительДатаЗавершения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Ищем сроки родительской задачи.
	// Такое может быть, если нет записи в регистре сроков.
	// Проверим, не вылезают ли сроки текущей задачи за сроки задачи родителя.
	Если ДанныеРодителя.РучнойВводСроков Тогда
		ДопИнформация = НСтр("ru = '(у задачи-родителя установлен ручной режим ввода сроков, исправление необязательно)'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗадачаДатаНачала) Тогда
		Если ЗначениеЗаполнено(РодительДатаНачала) И ЗадачаДатаНачала < РодительДатаНачала Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт! Дата начала работ раньше даты начала задачи-родителя'"), ДопИнформация);
		КонецЕсли;
		Если ЗначениеЗаполнено(РодительДатаЗавершения) И ЗадачаДатаНачала > РодительДатаЗавершения Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт! Дата начала работ позже даты завершения задачи-родителя'"), ДопИнформация);
		КонецЕсли;
		Если ЗначениеЗаполнено(РодительКрайнийСрок) И ЗадачаДатаНачала > РодительКрайнийСрок Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт! Дата начала работ позже крайнего срока задачи-родителя'"), ДопИнформация);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗадачаДатаЗавершения) Тогда
		Если ЗначениеЗаполнено(РодительДатаНачала) И ЗадачаДатаЗавершения < РодительДатаНачала Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт! Дата завершения работ раньше даты начала задачи-родителя'"), ДопИнформация);
		КонецЕсли;
		Если ЗначениеЗаполнено(РодительДатаЗавершения) И ЗадачаДатаЗавершения > РодительДатаЗавершения Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт! Дата завершения работ позже даты завершения задачи-родителя'"), ДопИнформация);
		КонецЕсли;
		Если ЗначениеЗаполнено(РодительКрайнийСрок) И ЗадачаДатаЗавершения > РодительКрайнийСрок Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт между датой завершения работ и крайним сроком задачи-родителя'"), ДопИнформация);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗадачаКрайнийСрок) Тогда
		Если ЗначениеЗаполнено(РодительДатаНачала) И ЗадачаКрайнийСрок < РодительДатаНачала Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт между крайним сроком и датой начала задачи-родителя'"), ДопИнформация);
		КонецЕсли;
		Если ЗначениеЗаполнено(РодительКрайнийСрок) И ЗадачаКрайнийСрок > РодительКрайнийСрок Тогда
			обДобавитьОшибку(ТаблицаОшибок, Задача, НазваниеЗадачи, ИндексКартинки,
				НСтр("ru = 'Конфликт между крайним сроком и крайним сроком задачи-родителя'"), ДопИнформация);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПредусловияНовогоШаблонаЗадачи(Объект, Отказ, Заголовок)
	
	Родитель = Объект.Родитель;
	
	Для Каждого ПредУсловие Из Объект.ПредУсловия Цикл
		
		ЗадачаПредшественник = ПредУсловие.ЗадачаПредшественник;		
		Если ЗадачаПредшественник <> Родитель Тогда
			Продолжить;
		КонецЕсли;
		
		ПредставлениеЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаПредшественник, "Наименование");
		
		ПредставлениеТабличнойЧасти = Объект.Метаданные().ТабличныеЧасти["ПредУсловия"].Представление();
		ЗаголовокСообщения = упоСервисныеФункцииВызовСервера.обСформироватьЗаголовокОшибкиВСтрокеТЧ(ПредставлениеТабличнойЧасти, ПредУсловие.НомерСтроки);

		СтрокаСообщения = НСтр("ru = 'Задача-предшественник ""'") + ПредставлениеЗадачи 
			+ НСтр("ru = '"" является родительской задачей по иерархии.'");
		обСообщитьОбОшибке(ЗаголовокСообщения, Отказ, Заголовок);
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры
		
#КонецОбласти