
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем НаименованиеВерсии Экспорт; // Хранит полученное наименование версии проекта.
Перем ПредыдущаяТекущаяВерсия Экспорт; // Хранит предыдущую текущую версию.
Перем Комментарий Экспорт; // Хранит полученный комментарий версии.

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
		
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Произвольный - данные документа.
//  Отказ        - Булево - признак отказа от выполнения операции.
//  Заголовок    - Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
// Правила передаются в виде иерархическая структуры.
//
// Параметры:
//   ДанныеДокумента – Произвольный – не используется.
//
// Возвращаемое значение:
//   Структура – иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//  
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать.
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_" .
	
	Для Каждого Движение Из Движения Цикл
		Правила = Новый Структура();
		ПравилаНаложения.Вставить(Движение.Метаданные().Имя, Правила);
	КонецЦикла;
	
	Возврат ПравилаНаложения; 

КонецФункции

// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//   ДанныеДокумента – Структура – структура данных документа.
//   ДанныеДвижений  – Структура – структура данных движений по регистрам.
//   Отказ           - Булево - признак отказа от записи документа.
//   РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда 
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;    
	КонецЕсли; 
	
	Если Текущая Тогда
		ВерсияВключаетДанныеВыполнения = Истина;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЭтоВосстановлениеВерсии") 
		И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВерсияОснование, "ВерсияВключаетДанныеВыполнения") Тогда
		ПредыдущаяТекущаяВерсия	= упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);	
	КонецЕсли;
	
	Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
	Если НЕ ЗначениеЗаполнено(НаименованиеВерсии) Тогда
		НаименованиеВерсии = упоВерсионирование.ПолучитьНаименованиеНовойВерсии(Проект);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;    
	КонецЕсли; 
	
	
	// Запишем версию в список
	наборЗаписей = РегистрыСведений.упоВерсииПроекта.СоздатьНаборЗаписей();
		
	Если Текущая ИЛИ Базовая Тогда   	
		
		наборЗаписей.Отбор.Проект.Установить(Проект);
		наборЗаписей.Прочитать();
			
		Таблица = наборЗаписей.Выгрузить();
		Таблица.Индексы.Добавить("Версия");
		
		Если Текущая Тогда
			строкаТекущейВерсии = Таблица.Найти(Истина, "Текущая");
			Если НЕ строкаТекущейВерсии = Неопределено Тогда
				строкаТекущейВерсии.Текущая = Ложь;
				строкаТекущейВерсии.Системная = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Базовая Тогда
			Таблица.ЗаполнитьЗначения(Ложь, "Базовая");
		КонецЕсли;
		
		СтрокаВерсии = Таблица.Найти(Ссылка, "Версия");
		Если СтрокаВерсии = Неопределено Тогда
			СтрокаВерсии = Таблица.Добавить();
		
			СтрокаВерсии.Проект = Проект;
			СтрокаВерсии.Версия = Ссылка;
			СтрокаВерсии.НаименованиеВерсии = НаименованиеВерсии;
			СтрокаВерсии.Автор = Автор;
			СтрокаВерсии.ДатаСоздания = ДатаМодификации;
			СтрокаВерсии.Системная = Системная;
			СтрокаВерсии.ВерсияВключаетДанныеВыполнения = ВерсияВключаетДанныеВыполнения;
		КонецЕсли;	
		
		Если Текущая Тогда
			СтрокаВерсии.Текущая = Текущая;
		КонецЕсли;
		Если Базовая Тогда
			СтрокаВерсии.Базовая = Базовая;
			Если Текущая И СтрокаВерсии.Системная = Истина Тогда
				СтрокаВерсии.Системная = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаВерсии.ДатаОбновления = ТекущаяДатаСеанса();
		
		наборЗаписей.Загрузить(Таблица);
		наборЗаписей.Записать();
		
	Иначе
		наборЗаписей.Отбор.Проект.Установить(Проект);
		наборЗаписей.Отбор.Версия.Установить(Ссылка);
		наборЗаписей.Прочитать();
			
		Таблица = наборЗаписей.Выгрузить();
		
		Если Таблица.Количество() = 0 Тогда
			новаяСтрока = Таблица.Добавить();
		
			новаяСтрока.Проект = Проект;
			новаяСтрока.Версия = Ссылка;
			новаяСтрока.НаименованиеВерсии = НаименованиеВерсии;
			новаяСтрока.Автор = Автор;
			новаяСтрока.ДатаСоздания = ДатаМодификации;
			новаяСтрока.Системная = Системная;
			новаяСтрока.Текущая = Текущая;
			новаяСтрока.Базовая = Базовая;
			новаяСтрока.ДатаОбновления = ТекущаяДатаСеанса();
			новаяСтрока.ВерсияВключаетДанныеВыполнения = ВерсияВключаетДанныеВыполнения;
			
			наборЗаписей.Загрузить(Таблица);
			наборЗаписей.Записать();
		Иначе
			Таблица.ЗаполнитьЗначения(ТекущаяДатаСеанса(), "ДатаОбновления");
			Таблица.ЗаполнитьЗначения(ВерсияВключаетДанныеВыполнения, "ВерсияВключаетДанныеВыполнения");
			наборЗаписей.Загрузить(Таблица);
			наборЗаписей.Записать();			
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
	Оповестить("ПанельПроекта_ЗаписьВерсии", , Ссылка);
	#КонецЕсли

КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;    
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	Если ЗначениеЗаполнено(ВерсияОснование) Тогда
		// Если у нас версия Текущая, значит она создается при создании проекта, а точнее Регистрации проекта.
		// В таком случае нам не нужно сохранять версию, так как не откуда брать сохраняемые данные, они еще не введены.
		СохранитьВерсиюПланаПроекта(Отказ);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросПоРегистру(имяРегистра, ПоляПоУмолчанию, УсловиеНаПроект)
		
	Непериодический = Метаданные.РегистрыСведений[имяРегистра].ПериодичностьРегистраСведений 
										= Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;										
	
	новыйТекстЗапроса = "ВЫБРАТЬ 
						|";
	ПервоеПоле = Истина;					
	Для каждого полеПоУмолчанию Из ПоляПоУмолчанию Цикл
		Если НЕ ПервоеПоле Тогда
			новыйТекстЗапроса = новыйТекстЗапроса + ","
		КонецЕсли;
		новыйТекстЗапроса = новыйТекстЗапроса + полеПоУмолчанию.Ключ + " КАК " + полеПоУмолчанию.Значение +"
												|";
		Если ПервоеПоле Тогда
			ПервоеПоле = Ложь;
		КонецЕсли;
	КонецЦикла;
	Для каждого измерение Из Метаданные.РегистрыСведений[имяРегистра].Измерения Цикл
		Если НЕ ПервоеПоле Тогда
			новыйТекстЗапроса = новыйТекстЗапроса + ","
		КонецЕсли;
		новыйТекстЗапроса = новыйТекстЗапроса + измерение.Имя +"
												|";
		Если ПервоеПоле Тогда
			ПервоеПоле = Ложь;
		КонецЕсли;
	КонецЦикла;
	Для каждого ресурс Из Метаданные.РегистрыСведений[имяРегистра].Ресурсы Цикл
		Если НЕ ПервоеПоле Тогда
			новыйТекстЗапроса = новыйТекстЗапроса + ","
		КонецЕсли;
		новыйТекстЗапроса = новыйТекстЗапроса + ресурс.Имя +"
												|";
		Если ПервоеПоле Тогда
			ПервоеПоле = Ложь;
		КонецЕсли;
	КонецЦикла;
	Для каждого реквизит Из Метаданные.РегистрыСведений[имяРегистра].Реквизиты Цикл
		Если НЕ ПервоеПоле Тогда
			новыйТекстЗапроса = новыйТекстЗапроса + ","
		КонецЕсли;
		новыйТекстЗапроса = новыйТекстЗапроса + реквизит.Имя +"
												|";
		Если ПервоеПоле Тогда
			ПервоеПоле = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Непериодический Тогда
		
		новыйТекстЗапроса = новыйТекстЗапроса + "
		|ИЗ
		|	РегистрСведений."+ имяРегистра +" КАК табличка
		|ГДЕ 
		|" + УсловиеНаПроект;
		
	Иначе
		
		новыйТекстЗапроса = новыйТекстЗапроса + "
		|ИЗ
		|	РегистрСведений."+ имяРегистра +".СрезПоследних(, "+УсловиеНаПроект+") КАК табличка";
		
	КонецЕсли;
			
	Возврат новыйТекстЗапроса;
	
КонецФункции

// Сохранение базового плана проекта.
// Берется актуальный срез данных некоторых регистров и переписывается этим документом.
Процедура СохранитьВерсиюПланаПроекта(Отказ)
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	Если НЕ ЗначениеЗаполнено(ВерсияОснование) Тогда
		ВерсияОснование = ТекущаяВерсияПроекта;
	КонецЕсли;	
	
	ВерсияОснованиеЭтоТекущая = ТекущаяВерсияПроекта = ВерсияОснование;
	
	//
	
	Запросы = Новый Структура;
	
	//
	
	ПоляПоУмолчанию = Новый Соответствие;
	ПоляПоУмолчанию.Вставить("&ДатаДокумента"		, "Период");
	ПоляПоУмолчанию.Вставить("&Версия"				, "Версия");
	
	УсловиеНаПроект = "Версия = &ВерсияОснование";
	
	РегистрыДанныхВыполнения = Новый Соответствие;
	РегистрыДанныхВыполнения.Вставить("упоПроцентыГотовностиПроектныхЗадач", Истина);
	РегистрыДанныхВыполнения.Вставить("упоПроцентыГотовностиПроектов", Истина);
	РегистрыДанныхВыполнения.Вставить("упоСтатусыПроектныхЗадач", Истина);
	РегистрыДанныхВыполнения.Вставить("упоФактическиеДатыНачалаИОкончанияПроектныхЗадач", Истина);
	
	РегистрыСОграничениемФункциональности = Новый Соответствие;
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		РегистрыСОграничениемФункциональности.Вставить("упоСтатусыПроектнойПродукции",Истина);
		РегистрыСОграничениемФункциональности.Вставить("упоДанныеПроектнойПродукции", Истина);
	КонецЕсли;
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда 
		РегистрыСОграничениемФункциональности.Вставить("упоПричиныОтклонений", Истина);
	КонецЕсли;
	
	Для Каждого Движение Из Движения Цикл
		имяРегистра = Движение.Метаданные().Имя;
		Если Не ВерсияВключаетДанныеВыполнения И РегистрыДанныхВыполнения[имяРегистра] <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		Если РегистрыДанныхВыполнения[имяРегистра] <> Неопределено И ПредыдущаяТекущаяВерсия <> Неопределено Тогда
			Запросы.Вставить(имяРегистра, СформироватьЗапросПоРегистру(имяРегистра, ПоляПоУмолчанию,
				"Версия = &ПредыдущаяТекущая"));
			Продолжить;
		КонецЕсли;
		
		ЭтоРегистрСОграничением = РегистрыСОграничениемФункциональности[имяРегистра];
		Если ЭтоРегистрСОграничением = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Запросы.Вставить(имяРегистра, СформироватьЗапросПоРегистру(имяРегистра, ПоляПоУмолчанию, УсловиеНаПроект));
	КонецЦикла;
	
	//
	
	ПоляПоУмолчанию = Новый Соответствие;
	ПоляПоУмолчанию.Вставить("&Версия"				, "Версия");
	ПоляПоУмолчанию.Вставить("&Проект"				, "Проект");
	
	СтруктураНезависимыхРегистров = Новый Структура;
	
	Если ВерсияОснованиеЭтоТекущая Тогда
		УсловиеНаПроект = "табличка.Проект = &Проект";
		Если Текущая Тогда
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", 
				"упоАктуальныеПланыТрудозатратСводноТекущаяВерсия");	
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", 
				"упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия");
		Иначе
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", 
				"упоАктуальныеПланыТрудозатратСводноВерсии");
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", 
				"упоАктуальныеПланыТрудозатратПоДнямВерсии");
		КонецЕсли;
	Иначе
		УсловиеНаПроект = "табличка.Версия = &ВерсияОснование";
		Если Текущая Тогда
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратСводноВерсии", 
				"упоАктуальныеПланыТрудозатратСводноТекущаяВерсия");
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратПоДнямВерсии", 
				"упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия");
		Иначе
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратСводноВерсии", 
				"упоАктуальныеПланыТрудозатратСводноВерсии");
			СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратПоДнямВерсии", 
				"упоАктуальныеПланыТрудозатратПоДнямВерсии");
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СтруктураНезависимыхРегистров Цикл
		Запросы.Вставить(КлючЗначение.Значение, 
			СформироватьЗапросПоРегистру(КлючЗначение.Ключ, ПоляПоУмолчанию, УсловиеНаПроект));
	КонецЦикла;
	
	//
	
	ТекстЗапроса = "";
	
	ПервыйЗапрос = Истина;
	Для Каждого текЗапрос Из Запросы Цикл
		Если НЕ ЗначениеЗаполнено(текЗапрос.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПервыйЗапрос Тогда
			ТекстЗапроса = ТекстЗапроса + "
				|;
				|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + текЗапрос.Значение;
		
		Если ПервыйЗапрос Тогда
			ПервыйЗапрос = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект"       	, Проект);
	Запрос.УстановитьПараметр("ДатаДокумента"	, Дата);
	Запрос.УстановитьПараметр("Версия"			, Ссылка);
	Запрос.УстановитьПараметр("ВерсияОснование"	, ВерсияОснование);
	Если ПредыдущаяТекущаяВерсия <> Неопределено Тогда
		Запрос.УстановитьПараметр("ПредыдущаяТекущая", ПредыдущаяТекущаяВерсия);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	//
	
	сч = 0;
	Для Каждого текЗапрос Из Запросы Цикл
		ТаблицаРегистра = РезультатыЗапросов[сч].Выгрузить();
		ТаблицаДвижения = Движения.Найти(текЗапрос.Ключ);
		Если ТаблицаДвижения <> Неопределено Тогда
			ТаблицаДвижения.Загрузить(ТаблицаРегистра);
		Иначе
			НаборЗаписей = РегистрыСведений[текЗапрос.Ключ].СоздатьНаборЗаписей();
			Если Текущая И НаборЗаписей.Отбор.Найти("Проект") <> Неопределено Тогда
				НаборЗаписей.Отбор.Проект.Установить(Проект);
			Иначе
				НаборЗаписей.Отбор.Версия.Установить(Ссылка);
			КонецЕсли;
			НаборЗаписей.Загрузить(ТаблицаРегистра);
			НаборЗаписей.Записать(Истина);
		КонецЕсли;		
		сч = сч + 1;
	КонецЦикла;
	
	//
	
	Если НЕ Текущая Тогда
		// Сохраним текущие КОДЫ СДР
		ТемпИерархия = Новый Соответствие;
		ТемпКодыСДР = Новый Соответствие;
		упоПроектыИЗадачиВызовСервера.ЗаполнитьИерархию(Проект, ТемпИерархия, ТемпКодыСДР);
		Движения.упоКодыСДР.Очистить();
		Для каждого киз Из ТемпКодыСДР Цикл
			новоеДвижение = Движения.упоКодыСДР.Добавить();
			новоеДвижение.Период 			= Дата;
			новоеДвижение.Версия 			= ссылка;
			новоеДвижение.ПроектнаяЗадача 	= киз.Ключ;
			новоеДвижение.КодСДР 			= киз.Значение;
		КонецЦикла;
	КонецЕсли;
	
	//
	
	НаименованиеВерсииОснования = упоВерсионирование.ПолучитьНаименованиеВерсии(ВерсияОснование);
	
	КомментарийВерсии =  НСтр("ru = 'Данные загружены из версии ""%1"" %2 %3'");
	
	Если Комментарий = "" Тогда
		КомментарийВерсии = СокрП(СтрШаблон(КомментарийВерсии, НаименованиеВерсииОснования, ДатаМодификации));
	Иначе 
		КомментарийВерсии = СтрШаблон(КомментарийВерсии, НаименованиеВерсииОснования, ДатаМодификации, 
			"(" + Комментарий + ")");
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.упоВерсииПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Версия.Установить(Ссылка);
	НаборЗаписей.Отбор.Проект.Установить(Проект);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда 
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Комментарий = КомментарийВерсии;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;

	//

	СохранитьВерсиюДополнительныхРеквизитов(Ссылка, ВерсияОснование, ТекущаяВерсияПроекта);

КонецПроцедуры

#Область ВерсионированиеДополнительныхРеквизитов

Процедура СохранитьВерсиюДополнительныхРеквизитов(ВерсияПриемник, ВерсияИсточник, ТекущаяВерсияПроекта)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалВерсионированиеДопРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьВерсионируемыеДополнительныеРеквизиты = ЕстьВерсионируемыеДополнительныеРеквизиты();
	Если Не ЕстьВерсионируемыеДополнительныеРеквизиты Тогда
		Возврат;
	КонецЕсли;

	//

	ДатаСеанса = ТекущаяДатаСеанса();
	ДатаСеансаУниверсальная = УниверсальноеВремя(ДатаСеанса, ЧасовойПоясСеанса());
	
	ВерсияОснованиеЭтоТекущая = ВерсияИсточник = ТекущаяВерсияПроекта;
	ОбновитьТекущиеДанныеСправочников = ТекущаяВерсияПроекта = ВерсияПриемник;

	//

	Если ВерсияОснованиеЭтоТекущая Тогда
		ТекстЗапросаНовыеЗначенияДополнительныеРеквизиты = ТекстЗапросаНовыеЗначенияДополнительныхРеквизитыТекущейВерсии();
	Иначе
		ТекстЗапросаНовыеЗначенияДополнительныеРеквизиты = ТекстЗапросаНовыеЗначенияДополнительныхРеквизитыВерсии();
	КонецЕсли;

	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗапросаНовыеЗначенияДополнительныеРеквизиты);
	ТекстыЗапроса.Добавить(ТекстЗапросаТекущиеЗначенияДополнительныхРеквизитов());
	ТекстыЗапроса.Добавить(ОсновнаяЧастьЗапросаДополнительныеРеквизитыПроектнойПродукцииИзменения());

	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Автор", Автор);
	Запрос.УстановитьПараметр("Дата", ДатаСеансаУниверсальная);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ВерсияПриемник", ВерсияПриемник);
	Запрос.УстановитьПараметр("ВерсияИсточник", ВерсияИсточник);
	Запрос.УстановитьПараметр("ОбновитьТекущиеДанныеСправочников", ОбновитьТекущиеДанныеСправочников);

	РезультатПакета = Запрос.ВыполнитьПакет();

	//

	ВыборкаДанныхОбновленияРС = РезультатПакета[РезультатПакета.Количество() - 1].Выбрать();

	НаборЗаписей = РегистрыСведений["упоДополнительныеРеквизитыВерсии"].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Версия.Установить(ВерсияПриемник);
	НаборЗаписей.Отбор.Период.Установить(ДатаСеансаУниверсальная);

	Пока ВыборкаДанныхОбновленияРС.Следующий() Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ВыборкаДанныхОбновленияРС);
	КонецЦикла;

	НаборЗаписей.Записать();

	//

	Если Не ОбновитьТекущиеДанныеСправочников Тогда
		Возврат;
	КонецЕсли;

	ВыборкаОбъект = РезультатПакета[РезультатПакета.Количество() - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаОбъект.Следующий() Цикл

		ОбъектВладелец = ВыборкаОбъект.Объект.ПолучитьОбъект();
		ОбъектВладелец.ДополнительныеРеквизиты.Очистить();

		Если Не ВыборкаОбъект.Удалить = Истина Тогда
			Выборка = ВыборкаОбъект.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ОбъектВладелец.ДополнительныеРеквизиты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
		КонецЕсли;

		ОбъектВладелец.Записать();

	КонецЦикла;

КонецПроцедуры

Функция ЕстьВерсионируемыеДополнительныеРеквизиты()

	ЕстьВерсионируемыеДополнительныеРеквизиты = упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция();
	Возврат ЕстьВерсионируемыеДополнительныеРеквизиты;

КонецФункции

Функция ОсновнаяЧастьЗапросаДополнительныеРеквизитыПроектнойПродукцииИзменения()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Объект КАК Объект,
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Свойство КАК Свойство,
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Значение КАК Значение,
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Действует КАК Действует
	|ПОМЕСТИТЬ СтарыеЗначенияДополнительныхРеквизитов
	|ИЗ
	|	РегистрСведений.упоДополнительныеРеквизитыВерсии.СрезПоследних(, Версия = &ВерсияПриемник) КАК упоДополнительныеРеквизитыВерсииСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ТекущиеЗначенияДР.Объект, НовыеЗначенияДР.Объект) КАК Объект,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТекущиеЗначенияДР.Действует, ЛОЖЬ) = ИСТИНА
	|					И ЕСТЬNULL(НовыеЗначенияДР.Действует, ЛОЖЬ) = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК УдалитьДополнительныеРеквизиты,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТекущиеЗначенияДР.Значение, ""_ПустоеЗначение_"") <> ЕСТЬNULL(НовыеЗначенияДР.Значение, ""_ПустоеЗначение_"")
	|						И ЕСТЬNULL(ТекущиеЗначенияДР.Действует, ЛОЖЬ) = ЕСТЬNULL(НовыеЗначенияДР.Действует, ЛОЖЬ)
	|					ИЛИ ЕСТЬNULL(ТекущиеЗначенияДР.Действует, ЛОЖЬ) <> ЕСТЬNULL(НовыеЗначенияДР.Действует, ЛОЖЬ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьИзменения
	|ПОМЕСТИТЬ ОбъектыДляОбновления
	|ИЗ
	|	ТекущиеЗначенияДополнительныхРеквизитов КАК ТекущиеЗначенияДР
	|		ПОЛНОЕ СОЕДИНЕНИЕ НовыеЗначенияДополнительныхРеквизитов КАК НовыеЗначенияДР
	|		ПО ТекущиеЗначенияДР.Объект = НовыеЗначенияДР.Объект
	|			И ТекущиеЗначенияДР.Свойство = НовыеЗначенияДР.Свойство
	|			И (&ОбновитьТекущиеДанныеСправочников)
	|ГДЕ
	|	&ОбновитьТекущиеДанныеСправочников
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ТекущиеЗначенияДР.Объект, НовыеЗначенияДР.Объект)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыеЗначенияДополнительныхРеквизитов.Объект КАК Объект,
	|	НовыеЗначенияДополнительныхРеквизитов.Свойство КАК Свойство,
	|	НовыеЗначенияДополнительныхРеквизитов.Значение КАК Значение,
	|	ЛОЖЬ КАК Удалить
	|ИЗ
	|	НовыеЗначенияДополнительныхРеквизитов КАК НовыеЗначенияДополнительныхРеквизитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыДляОбновления КАК ОбъектыДляОбновления
	|		ПО НовыеЗначенияДополнительныхРеквизитов.Объект = ОбъектыДляОбновления.Объект
	|			И (НЕ ОбъектыДляОбновления.УдалитьДополнительныеРеквизиты)
	|			И (ОбъектыДляОбновления.ЕстьИзменения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбъектыДляОбновления.Объект,
	|	NULL,
	|	NULL,
	|	ИСТИНА
	|ИЗ
	|	ОбъектыДляОбновления КАК ОбъектыДляОбновления
	|ГДЕ
	|	ОбъектыДляОбновления.УдалитьДополнительныеРеквизиты
	|ИТОГИ
	|	МАКСИМУМ(Удалить)
	|ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ВерсияПриемник КАК Версия,
	|	&Дата КАК Период,
	|	&Автор КАК Автор,
	|	СтарыеЗначенияДополнительныхРеквизитов.Объект КАК Объект,
	|	СтарыеЗначенияДополнительныхРеквизитов.Свойство КАК Свойство,
	|	СтарыеЗначенияДополнительныхРеквизитов.Значение КАК Значение,
	|	ЛОЖЬ КАК Действует
	|ИЗ
	|	СтарыеЗначенияДополнительныхРеквизитов КАК СтарыеЗначенияДополнительныхРеквизитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеЗначенияДополнительныхРеквизитов КАК НовыеЗначенияДополнительныхРеквизитов
	|		ПО (НовыеЗначенияДополнительныхРеквизитов.Объект = СтарыеЗначенияДополнительныхРеквизитов.Объект)
	|			И (НовыеЗначенияДополнительныхРеквизитов.Свойство = СтарыеЗначенияДополнительныхРеквизитов.Свойство)
	|ГДЕ
	|	НовыеЗначенияДополнительныхРеквизитов.Объект ЕСТЬ NULL
	|	И ЕСТЬNULL(СтарыеЗначенияДополнительныхРеквизитов.Действует, ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВерсияПриемник,
	|	&Дата,
	|	&Автор,
	|	НовыеЗначенияДополнительныхРеквизитов.Объект,
	|	НовыеЗначенияДополнительныхРеквизитов.Свойство,
	|	НовыеЗначенияДополнительныхРеквизитов.Значение,
	|	НовыеЗначенияДополнительныхРеквизитов.Действует
	|ИЗ
	|	НовыеЗначенияДополнительныхРеквизитов КАК НовыеЗначенияДополнительныхРеквизитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтарыеЗначенияДополнительныхРеквизитов КАК СтарыеЗначенияДополнительныхРеквизитов
	|		ПО НовыеЗначенияДополнительныхРеквизитов.Объект = СтарыеЗначенияДополнительныхРеквизитов.Объект
	|			И НовыеЗначенияДополнительныхРеквизитов.Свойство = СтарыеЗначенияДополнительныхРеквизитов.Свойство
	|ГДЕ
	|	(ЕСТЬNULL(СтарыеЗначенияДополнительныхРеквизитов.Значение, ""_ПустоеЗначение_"") <> ЕСТЬNULL(НовыеЗначенияДополнительныхРеквизитов.Значение, ""_ПустоеЗначение_"")
	|			ИЛИ ЕСТЬNULL(СтарыеЗначенияДополнительныхРеквизитов.Действует, ЛОЖЬ) <> ЕСТЬNULL(НовыеЗначенияДополнительныхРеквизитов.Действует, ЛОЖЬ))";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаНовыеЗначенияДополнительныхРеквизитыТекущейВерсии()

	ТекстЗапросаПустышка =
	"ВЫБРАТЬ
	|	NULL КАК Объект,
	|	NULL КАК Свойство,
	|	NULL КАК Значение,
	|	ИСТИНА КАК Действует
	|ПОМЕСТИТЬ НовыеЗначенияДополнительныхРеквизитов
	|ГДЕ
	|	ЛОЖЬ";

	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗапросаПустышка);

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ТекстыЗапроса.Добавить(ТекстЗапросаНовыеЗначенияДополнительныхРеквизитовПроектнаяПродукция());
	КонецЕсли;

	ТекстЗапросаОбъединитьВсе = 
	"
	|ОБЪЕДИНИТЬ ВСЕ
	|";

	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ТекстЗапросаОбъединитьВсе);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаНовыеЗначенияДополнительныхРеквизитыВерсии()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Объект КАК Объект,
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Свойство КАК Свойство,
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Значение КАК Значение,
	|	упоДополнительныеРеквизитыВерсииСрезПоследних.Действует КАК Действует
	|ПОМЕСТИТЬ НовыеЗначенияДополнительныхРеквизитов
	|ИЗ
	|	РегистрСведений.упоДополнительныеРеквизитыВерсии.СрезПоследних(, Версия = &ВерсияИсточник) КАК упоДополнительныеРеквизитыВерсииСрезПоследних";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТекущиеЗначенияДополнительныхРеквизитов()

	ТекстЗапросаПустышка =
	"ВЫБРАТЬ
	|	NULL КАК Объект,
	|	NULL КАК Свойство,
	|	NULL КАК Значение,
	|	ИСТИНА КАК Действует
	|ПОМЕСТИТЬ ТекущиеЗначенияДополнительныхРеквизитов
	|ГДЕ
	|	ЛОЖЬ";

	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстЗапросаПустышка);

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ТекстыЗапроса.Добавить(ТекстЗапросаТекущиеЗначенияДополнительныхРеквизитовПроектнаяПродукция());
	КонецЕсли;

	ТекстЗапросаОбъединитьВсе =
	"
	|ОБЪЕДИНИТЬ ВСЕ
	|";

	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ТекстЗапросаОбъединитьВсе);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТекущиеЗначенияДополнительныхРеквизитовПроектнаяПродукция()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Ссылка КАК Объект,
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Свойство КАК Свойство,
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Значение КАК Значение,
	|	ИСТИНА КАК Действует
	|ИЗ
	|	Справочник.упоПроектнаяПродукция.ДополнительныеРеквизиты КАК упоПроектнаяПродукцияДополнительныеРеквизиты
	|ГДЕ
	|	&ОбновитьТекущиеДанныеСправочников
	|	И упоПроектнаяПродукцияДополнительныеРеквизиты.Ссылка.ПроектнаяЗадача.Проект = &Проект";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаНовыеЗначенияДополнительныхРеквизитовПроектнаяПродукция()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Ссылка КАК Объект,
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Свойство КАК Свойство,
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Значение КАК Значение,
	|	ИСТИНА КАК Действует
	|ИЗ
	|	Справочник.упоПроектнаяПродукция.ДополнительныеРеквизиты КАК упоПроектнаяПродукцияДополнительныеРеквизиты
	|ГДЕ
	|	упоПроектнаяПродукцияДополнительныеРеквизиты.Ссылка.ПроектнаяЗадача.Проект = &Проект";

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

НаименованиеВерсии = "";
Комментарий = "";

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли