#Область ПрограммныйИнтерфейс

#Область ПланВыпускаПроектнойЗадачи

// Возвращает соответствие проектных задач и вновь созданных СПД из шаблонов (или привязанных СПД к проектной задаче)
//
// Параметры:
//  СоответствиеПЗ		 - Соответствие		 - ДокументСсылка.упоПроектнаяЗадача Соответствие проектных задач с ИдСтроки.
//  Таблица				 - ТабличнаяЧасть	 - данные по табличной части "Субпродукты".
//  ТаблицаРаспределения - ТабличнаяЧасть	 - данные по табличной части "РаспределениеОбъемов".
//  ТолькоОбновление     - Булево            - признак необходимости обновления проектной продукции в табличной
//                                             части без создания новой из шаблонов.
//
// Возвращаемое значение:
//  Соответствие - Проектная задача - массив созданной проектной продукции.
//
Функция СоздатьОбновитьПроектнуюПродукциюВСубпродуктах(СоответствиеПЗ, Таблица, ТаблицаРаспределения, ТолькоОбновление = Ложь) Экспорт
	
	СозданныеПП = Новый Соответствие;
	
	СозданиеИзСтруктуры = ТипЗнч(СоответствиеПЗ) <> Тип("ДокументСсылка.упоПроектнаяЗадача"); 
	
	Проект = Неопределено;
	
	Для Каждого Строка Из Таблица Цикл
		
		ПроектнаяПродукция = Строка.Ресурс;
		
		Если Не упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(ПроектнаяПродукция)
			Или Не ЗначениеЗаполнено(ПроектнаяПродукция) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СозданиеИзСтруктуры Тогда
			ПроектнаяЗадача = СоответствиеПЗ.Получить(Строка.ИдСтроки);
			КлючСоответствия = Строка.ИдСтроки;
		Иначе
			ПроектнаяЗадача = СоответствиеПЗ;
			КлючСоответствия = СоответствиеПЗ;
		КонецЕсли;
		
		РеквизитыСтруктурыПД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроектнаяПродукция, "Шаблон, ПроектнаяЗадача");
		ЭтоШаблон = РеквизитыСтруктурыПД.Шаблон;
		Если ЗначениеЗаполнено(ЭтоШаблон) И ЭтоШаблон И ТолькоОбновление Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоНоваяПП = Не ЭтоШаблон И Не ЗначениеЗаполнено(ПроектнаяЗадача);
		Если ЭтоНоваяПП Тогда
			Продолжить;
		КонецЕсли;
		
		ИзмененаПроектнаяЗадача = РеквизитыСтруктурыПД.ПроектнаяЗадача <> ПроектнаяЗадача;
		
		Отбор = Новый Структура("ИндексСтрокиВладельца", Строка.ИндексСтрокРаспределения);
		Если СозданиеИзСтруктуры Тогда
			Отбор.Вставить("ИдСтроки", Строка.ИдСтроки);
		КонецЕсли;
		СтрокиРаспределенияСубпродукта = ТаблицаРаспределения.НайтиСтроки(Отбор);
		
		СССП_НДС = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС");
		СтрокиРаспределенияСубпродуктаБезНДС = Новый Массив;
		Для каждого СтрокаРаспределения Из СтрокиРаспределенияСубпродукта Цикл
			Если СтрокаРаспределения.СобствСилы_Субподряд <> СССП_НДС Тогда
				СтрокиРаспределенияСубпродуктаБезНДС.Добавить(СтрокаРаспределения);
			КонецЕсли;
		КонецЦикла;
		
		ИзмененаПроектнаяПродукция = ПроектнаяПродукцияИзменена(ПроектнаяПродукция, Строка, 
			СтрокиРаспределенияСубпродуктаБезНДС);
		
		Если Не ЭтоШаблон И Не ИзмененаПроектнаяПродукция И Не ИзмененаПроектнаяЗадача Тогда
			Продолжить;
		КонецЕсли;
		
		Если Проект = Неопределено Тогда
			Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
		КонецЕсли;
			
		ЭтоКопия = Не ЭтоШаблон И ИзмененаПроектнаяЗадача И ЗначениеЗаполнено(РеквизитыСтруктурыПД.ПроектнаяЗадача);
		
		Если ЭтоШаблон Или ЭтоКопия Тогда
			
			Если ЭтоКопия И ЗначениеЗаполнено(ПроектнаяПродукция.ШаблонПроектнойПродукции) Тогда
				ШаблонПП = ПроектнаяПродукция.ШаблонПроектнойПродукции;
			Иначе
				ШаблонПП = ПроектнаяПродукция;
			КонецЕсли;

			ОбъектСтруктурыПД = Справочники.упоПроектнаяПродукция.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ОбъектСтруктурыПД, ПроектнаяПродукция, , "Владелец, Код, Шаблон");	
			ОбъектСтруктурыПД.ПроектнаяЗадача = ПроектнаяЗадача; 
			ОбъектСтруктурыПД.Проект = Проект;
			ОбъектСтруктурыПД.КодПП = ПолучитьКодНового(ПроектнаяЗадача, ПроектнаяПродукция.ТипДокумента);
			ОбъектСтруктурыПД.Наименование = НаименованиеПоШаблону(ПроектнаяЗадача, ШаблонПП);
			ОбъектСтруктурыПД.ШаблонПроектнойПродукции = ШаблонПП;
			ОбъектСтруктурыПД.ОбъектПП = ПолучитьОбъектПроектнойЗадачи(ПроектнаяЗадача);
						
		ИначеЕсли ИзмененаПроектнаяЗадача Тогда
			
			ОбъектСтруктурыПД = ПроектнаяПродукция.ПолучитьОбъект();
			ОбъектСтруктурыПД.ПроектнаяЗадача = ПроектнаяЗадача; 
			ОбъектСтруктурыПД.Проект = Проект;
			ОбъектСтруктурыПД.ОбъектПП = ПолучитьОбъектПроектнойЗадачи(ПроектнаяЗадача);
			
		ИначеЕсли ИзмененаПроектнаяПродукция Тогда
			
			ОбъектСтруктурыПД = ПроектнаяПродукция.ПолучитьОбъект();
			
		КонецЕсли;
		
		ОбъектСтруктурыПД.РолиТР.Очистить();
		ОбъектСтруктурыПД.Трудоемкость = Строка.Трудоемкость;
		ОбъектСтруктурыПД.Количество = Строка.Количество;
		ОбъектСтруктурыПД.Нормирование = Строка.Нормирование;
		ОбъектСтруктурыПД.КоэффициентСложности = Строка.КоэффициентСложности;
		
		Для Каждого НайденнаяСтрока Из СтрокиРаспределенияСубпродуктаБезНДС Цикл
			НоваяСтрока = ОбъектСтруктурыПД.РолиТР.Добавить();
			НоваяСтрока.РольТР = НайденнаяСтрока.Роль;
			НоваяСтрока.Подразделение = НайденнаяСтрока.Подразделение;
			СписокСвойств = "ПроцентРаспределения, Количество, КоэффициентСложности, Трудоемкость, Нормирование";
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока, СписокСвойств);
			
			НайденнаяСтрокаРоли = ПроектнаяПродукция.РолиТР.Найти(НоваяСтрока.РольТР, "РольТР");
			Если НайденнаяСтрокаРоли = Неопределено Тогда
				НоваяСтрока.ПрофильТрудозатрат = Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение;
			Иначе
				НоваяСтрока.ПрофильТрудозатрат = НайденнаяСтрокаРоли.ПрофильТрудозатрат;
			КонецЕсли;
		КонецЦикла;
		
		// TODO Подумать нужно ли здесь вообще это, потому что проценты контролируются на форме
		Если ЗначениеЗаполнено(ОбъектСтруктурыПД.РолиТР) Тогда
			ОсталосьРаспределить = 100 - ОбъектСтруктурыПД.РолиТР.Итог("ПроцентРаспределения");
			Если ОсталосьРаспределить <> 0 Тогда
				СтрокаРолиТР = ОбъектСтруктурыПД.РолиТР[0];
				СтрокаРолиТР.ПроцентРаспределения = СтрокаРолиТР.ПроцентРаспределения + ОсталосьРаспределить;
			КонецЕсли;
		КонецЕсли;
		
		ОбъектСтруктурыПД.Записать();
		
		МассивСПД = СозданныеПП.Получить(КлючСоответствия);
		Если МассивСПД = Неопределено Тогда
			МассивСПД = Новый Массив;
		КонецЕсли;
		МассивСПД.Добавить(ОбъектСтруктурыПД.Ссылка);
		СозданныеПП.Вставить(КлючСоответствия, МассивСПД);
		
		Если ЭтоШаблон Или ЭтоКопия Тогда
			Строка.Ресурс = ОбъектСтруктурыПД.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СозданныеПП;
	
КонецФункции

// Возвращает проектную документацию удаленную из субпродуктов.
//
// Параметры:
//  СписокПроектнойПродукции        - Массив из СправочникСсылка.упоПроектнаяПродукция - список проектной продукции из ТЧ Объемы.
//  ПроектнаяЗадача                 - ДокументСсылка.упоПроектнаяЗадача
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица элементов удаленной проектной документации
//
Функция СписокУдаленныхПроектныхПродуктов(СписокПроектнойПродукции, ПроектнаяЗадача, Знач Версия = Неопределено) Экспорт
	
	Если Версия = Неопределено Тогда
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&текВерсия КАК Версия,
		|	Субпродукты.Номенклатура КАК ПроектнаяПродукция,
		|	&ПроектнаяЗадача КАК ПроектнаяЗадача
		|ИЗ
		|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &ПроектнаяЗадача
		|				И Версия = &текВерсия) КАК Субпродукты
		|ГДЕ
		|	(Субпродукты.Количество <> 0
		|			ИЛИ Субпродукты.Сумма <> 0
		|			ИЛИ Субпродукты.СуммаВалютная <> 0)
		|	И ТИП(Справочник.упоПроектнаяПродукция) = ТИПЗНАЧЕНИЯ(Субпродукты.Номенклатура)
		|	И НЕ Субпродукты.Номенклатура В (&СписокПроектнойПродукции)";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("СписокПроектнойПродукции", СписокПроектнойПродукции);
	Запрос.УстановитьПараметр("текВерсия", Версия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Рассчитывает нормирование по строке доходных объемов проектной задачи.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции	 - строка доходных объемов с проектной продукцией для расчета.
//
Процедура РассчитатьНормированиеПоСтрокеПроектнойПродукции(СтрокаТабличнойЧасти) Экспорт
	
	ПроектныйПродукт = СтрокаТабличнойЧасти.Ресурс;
	
	Если Не ЗначениеЗаполнено(ПроектныйПродукт) Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникДанных = Неопределено;
	
	Если ПроектныйПродукт.Шаблон Тогда
		ИсточникДанных = ПроектныйПродукт;
	ИначеЕсли ЗначениеЗаполнено(ПроектныйПродукт.ШаблонПроектнойПродукции) Тогда
		ИсточникДанных = ПроектныйПродукт.ШаблонПроектнойПродукции;
	Иначе
		ИсточникДанных = ПроектныйПродукт;
	КонецЕсли;
	
	ДанныеИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникДанных, "Количество, Нормирование");
	
	Если ДанныеИсточника.Количество <> 0 Тогда
		Коэффициент = СтрокаТабличнойЧасти.Количество / ДанныеИсточника.Количество;
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Нормирование = ДанныеИсточника.Нормирование * Коэффициент;
	
КонецПроцедуры

// Проверяет наличие выполненных объемов по переданной проектной продукции.
//
// Параметры:
//  ПроектнаяПродукция	 - СправочникСсылка.упоПроектнаяПродукция
// 
// Возвращаемое значение:
//  Булево
//
Функция ЕстьВыполненныйОбъемПоПроектнойПродукции(Знач ПроектнаяПродукция) Экспорт
	
	РезультатФункции = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ПроектнаяПродукция) Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяПродукция", ПроектнаяПродукция);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    упоВыполненныеПринятыеОбъемыОстатки.Номенклатура КАК Номенклатура,
		|    СУММА(упоВыполненныеПринятыеОбъемыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|    РегистрНакопления.упоВыполненныеПринятыеОбъемы.Остатки(, Номенклатура = &ПроектнаяПродукция) КАК упоВыполненныеПринятыеОбъемыОстатки
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоПроектнаяПродукция КАК упоПроектнаяПродукция
		|        ПО упоВыполненныеПринятыеОбъемыОстатки.Номенклатура = упоПроектнаяПродукция.Ссылка
		|ГДЕ
		|    НЕ упоПроектнаяПродукция.Шаблон
		|
		|СГРУППИРОВАТЬ ПО
		|    упоВыполненныеПринятыеОбъемыОстатки.Номенклатура";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат РезультатФункции;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	РезультатФункции = Выборка.КоличествоОстаток <> 0;
	
	Возврат РезультатФункции;
	
КонецФункции

// Проверяет наличие проектной продукции в плане доходных объемов проектной задачи по версии.
//
// Параметры:
//  ПроектнаяПродукция	 - СправочникСсылка.упоПроектнаяПродукция, Массив Из СправочникСсылка.упоПроектнаяПродукция
//  ПроектнаяЗадача		 - ДокументСсылка.упоПроектнаяЗадача
//  Версия				 - ДокументСсылка.упоВерсияПланаПроекта - версия плана проекта.
// 
// Возвращаемое значение:
//  Булево
//
Функция ПроектнаяПродукцияЕстьВПланеВыпуска(Знач ПроектнаяПродукция, Знач ПроектнаяЗадача, Знач Версия) Экспорт
	
	Результат = Новый Соответствие;
	
	Если ТипЗнч(ПроектнаяПродукция) <> Тип("Массив") Тогда
		ПроектнаяПродукция = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПроектнаяПродукция);
	КонецЕсли;
	
	Если Версия = Неопределено Тогда
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	КонецЕсли;
		
	Для Каждого ПП Из ПроектнаяПродукция Цикл
		Результат.Вставить(ПП, Ложь);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &ПроектнаяЗадача
		|				И Номенклатура В (&СписокПроектнойПродукции)
		|				И Версия = &Версия) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
		|ГДЕ
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Количество <> 0";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("СписокПроектнойПродукции", ПроектнаяПродукция);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.Номенклатура, Истина);
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

// Генерирует КодПП (Код проекта - код типа документа № ПП).
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача		 - проектная задача.
//  ТипДокумента	 - СправочникСсылка.упоТипыПроектнойПродукции	 - тип проектной продукции.
//  ТекущаяПП		 - СправочникСсылка.упоПроектнаяПродукция		 - существующая проектная продукция,
//  		для которой вызывается перегенерация кода. Не указывается при создании нового элемента.
// 
// Возвращаемое значение:
//  Строка - сформированное наименование проектной документации.
//
Функция ПолучитьКодНового(ПроектнаяЗадача, ТипДокумента, ТекущаяПП = Неопределено) Экспорт 
	
	КодПП = "";
	
	Если Не (ЗначениеЗаполнено(ПроектнаяЗадача) И ЗначениеЗаполнено(ТипДокумента)) Тогда
		Возврат КодПП;
	КонецЕсли;
	
	КодПроекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача.Проект, "Код");
	КодТипа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипДокумента, "Код");
	
	КодПроектИТип = СтрШаблон(нСтр("ru='%1-%2'", "ru"), СокрЛП(КодПроекта), КодТипа);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(упоПроектнаяПродукция.Код) КАК КоличествоЗаписей
	               |ИЗ
	               |	Справочник.упоПроектнаяПродукция КАК упоПроектнаяПродукция
	               |ГДЕ
	               |	упоПроектнаяПродукция.КодПП ПОДОБНО &КодПП";;
	
	Если ЗначениеЗаполнено(ТекущаяПП) Тогда
		ТекстЗапроса = ТекстЗапроса + "|	И упоПроектнаяПродукция.Ссылка <> &ТекущаяПП";
		Запрос.УстановитьПараметр("ТекущаяПП", ТекущаяПП);
	КонецЕсли;
	Запрос.УстановитьПараметр("КодПП", КодПроектИТип + "%");
	
	Запрос.Текст = ТекстЗапроса;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		
		НомерПП = "1";
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		КоличествоЗаписей = Выборка.КоличествоЗаписей;
		НомерПП = КоличествоЗаписей + 1;
		
	КонецЕсли;
	
	КодПП = СтрШаблон(нСтр("ru='%1-%2'", "ru"), КодПроектИТип, НомерПП); 
	
	Возврат КодПП;
	
КонецФункции

// Делает проверку на привязку проектной продукции к другим проектным задачам перед записью документа.
//
// Параметры:
//  СписокПроектнойПродукции - Массив из СправочникСсылка.упоПроектнаяПродукция
//  Отказ                    - Булево
//
Процедура ПроверитьПривязкуПроектнойПродукцииКДругойЗадаче(СписокПроектнойПродукции, ПроектнаяЗадача, Отказ) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|   упоПроектнаяПродукция.Наименование КАК ПроектнаяПродукция,
		|   ЕСТЬNULL(Проекты.Наименование, ""Ошибка получения имени задачи"") КАК ПроектнаяЗадача,
		|   ЕСТЬNULL(Проекты.КодСДР, """") КАК ПроектнаяЗадачаКодСДР
		|ИЗ
		|   Справочник.упоПроектнаяПродукция КАК упоПроектнаяПродукция
		|       ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		|       ПО упоПроектнаяПродукция.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|       ПО (упоПроектнаяЗадача.Ссылка = Проекты.СсылкаНаПроектнуюЗадачу)
		|ГДЕ
		|   упоПроектнаяПродукция.ПроектнаяЗадача <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
		|   И упоПроектнаяПродукция.ПроектнаяЗадача <> &ПроектнаяЗадача
		|   И упоПроектнаяПродукция.Ссылка В(&СписокПроектнойПродукции)
		|   И НЕ упоПроектнаяПродукция.Шаблон";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("СписокПроектнойПродукции", СписокПроектнойПродукции);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШаблонСообщения = НСтр("ru = 'Проектная продукция ""%1"" уже привязана к проектной задаче ""%2"".'");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		
		ПроектнаяПродукция = ВыборкаДетальныеЗаписи.ПроектнаяПродукция;
		НайденнаяПроектнаяЗадача = ВыборкаДетальныеЗаписи.ПроектнаяЗадача;
		ПроектнаяЗадачаКодСДР = ВыборкаДетальныеЗаписи.ПроектнаяЗадачаКодСДР;
		
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроектнаяПродукция,
				?(ЗначениеЗаполнено(ПроектнаяЗадачаКодСДР), ПроектнаяЗадачаКодСДР + ", " + НайденнаяПроектнаяЗадача, НайденнаяПроектнаяЗадача));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает соответствие заменяемых и вновь созданных СПД.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача  - проектная задача
//  Таблица			 - ТаблицаЗначений - данные регистра упоДанныеПлановВыпускаСубпродуктов.
// 
// Возвращаемое значение:
//  Соответствие - Заменяемая проектная продукция - созданная проектная продукция. 
//
Функция НоваяПроектнаяПродукцияДляКопируемойЗадачи(ПроектнаяЗадача, Таблица) Экспорт
	
	ЗаменяемаяСозданнаяПП = Новый Соответствие;
	
	НачатьТранзакцию();
	
	Попытка
		Для Каждого Строка Из Таблица Цикл
			
			ПроектнаяПродукция = Строка.Номенклатура;
			
			Если Не упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(ПроектнаяПродукция)
				Или Не ЗначениеЗаполнено(ПроектнаяПродукция) Тогда
				Продолжить;
			КонецЕсли;

			Если ЗначениеЗаполнено(ПроектнаяПродукция.ШаблонПроектнойПродукции) Тогда
				ШаблонПП = ПроектнаяПродукция.ШаблонПроектнойПродукции;
			Иначе
				ШаблонПП = ПроектнаяПродукция;
			КонецЕсли;
			
			КопияПП = ПроектнаяПродукция.Скопировать();
	        КопияПП.ПроектнаяЗадача = ПроектнаяЗадача;
			КопияПП.КодПП = ПолучитьКодНового(ПроектнаяЗадача, ПроектнаяПродукция.ТипДокумента);
			КопияПП.Наименование = НаименованиеПоШаблону(ПроектнаяЗадача, ШаблонПП);
			КопияПП.ШаблонПроектнойПродукции = ШаблонПП;		
			КопияПП.Записать();
			
			ЗаменяемаяСозданнаяПП.Вставить(ПроектнаяПродукция, КопияПП.Ссылка);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();

		СообщениеОшибки = ОписаниеОшибки();
			
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка записи проектной продукции.'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'При записи проектной продукции произошла ошибка.'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
        ТекстСообщения = НСтр("ru = 'Ошибка записи проектной продукции. Подробнее см. журнал регистрации.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
	КонецПопытки;

    Возврат ЗаменяемаяСозданнаяПП;
			
КонецФункции

#Область ТрансляцияТрудозатратИзПланаВыпуска

// Возвращает уровень планирование трансляции трудозатрат для проектной продукции.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.упоУровеньПланирования
//
Функция УровеньПланированияПоУмолчанию() Экспорт
	
	УровеньПланирования = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоУровеньПланирования.Окончательный");
	
	Возврат УровеньПланирования;
	
КонецФункции

// Трансляция трудозатрат выполнения проектной продукции из доходных объемов в "Роли трудовых ресурсов".
//
// Параметры:
//  ТрудовыеРесурсы     - ТабличнаяЧасть, ТаблицаЗначений                   - табличная часть проектной задачи "Роли трудовых ресурсов".
//  Субпродукты         - ДанныеФормыКоллекция, ТабличнаяЧасть              - табличная часть проектной задачи "Субпродукты".
//  ОбъектЗаполнения    - ДокументОбъект.ПроектнаяЗадача, УправляемаяФорма  - проектная задача,
//                                                                            представленная документом или формой задачи структуры проекта.
//  ДопПараметры        - Структура:
//                          * Версия - текущая версия проекта.
//                          * ДанныеИзСтруктуры - булево - признак того, что данные заполняются в структуре.
//
Процедура ДополнитьСтрокиТрансляцииЗатратыПоСубпродуктам(ТрудовыеРесурсы, Субпродукты, ОбъектЗаполнения,
		ДопПараметры) Экспорт
	
	ДанныеИзСтруктуры = ДопПараметры.ДанныеИЗСтруктуры;
	ТекВерсия = ДопПараметры.Версия;
	
	СтруктураСтоимости = Новый Структура();
	СтруктураСтоимости.Вставить("НормаСтоимостиТрудовыхРесурсов", "Стоимость");
	СтруктураСтоимости.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", "ВнешняяСтоимость");
	
	СписокСтатусовИсключений = Новый Массив;
	СписокСтатусовИсключений.Добавить(Перечисления.упоСтатусыПроектнойПродукции.Неактивно);
	
	Если ТипЗнч(Субпродукты) = Тип("ДанныеФормыКоллекция")
		Или ТипЗнч(Субпродукты) = Тип("ДокументТабличнаяЧасть.упоПроектнаяЗадача.Субпродукты") Тогда
		ТаблицаПроектнойПродукции = Субпродукты.Выгрузить();
	КонецЕсли;
	
	Проект = ОбъектЗаполнения.Проект;
	Если ДанныеИзСтруктуры Тогда
		ЕдиницаНормированияПроектаПЗ = ОбъектЗаполнения.ЕдиницаТрудоемкостиПоУмолчанию;
	Иначе
		ЕдиницаНормированияПроектаПЗ = ОбъектЗаполнения.ЕдиницаНормированияДлительности;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЕдиницаНормированияПроектаПЗ) Тогда
		ЕдиницаНормированияПроектаПЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "упоЕдиницаТрудоемкостиПоУмолчанию");
	КонецЕсли;
	КоэффициентЕдВремПроекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаНормированияПроектаПЗ, "Коэффициент");
	Если Не ЗначениеЗаполнено(КоэффициентЕдВремПроекта) Тогда
		КоэффициентЕдВремПроекта = 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатусыИсключения", СписокСтатусовИсключений);
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	Запрос.УстановитьПараметр("ЕдиницаНормирования", ЕдиницаНормированияПроектаПЗ);
	Запрос.УстановитьПараметр("КоэффициентЕдВремПроекта", КоэффициентЕдВремПроекта);
	Запрос.УстановитьПараметр("ПроектнаяПродукция", ТаблицаПроектнойПродукции);
	
	Запрос.Текст = "ВЫБРАТЬ
		|    ПроектнаяПродукция.Ресурс КАК ПроектнаяПродукция
		|ПОМЕСТИТЬ ВТ_ПроектнаяПродукция
		|ИЗ
		|    &ПроектнаяПродукция КАК ПроектнаяПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    упоПроектнаяПродукцияРолиТР.РольТР КАК Ресурс,
		|    СУММА(ВЫБОР
		|            КОГДА упоПроектнаяПродукцияРолиТР.Ссылка.ЕдиницаИзмеренияВремени.Коэффициент = 0
		|                ТОГДА упоПроектнаяПродукцияРолиТР.Трудоемкость * (1 / &КоэффициентЕдВремПроекта)
		|            ИНАЧЕ упоПроектнаяПродукцияРолиТР.Трудоемкость * (упоПроектнаяПродукцияРолиТР.Ссылка.ЕдиницаИзмеренияВремени.Коэффициент / &КоэффициентЕдВремПроекта)
		|        КОНЕЦ) КАК Количество,
		|    ВЫБОР
		|        КОГДА &ЕдиницаНормирования = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|            ТОГДА упоПроектнаяПродукцияРолиТР.Ссылка.ЕдиницаИзмеренияВремени
		|        ИНАЧЕ &ЕдиницаНормирования
		|    КОНЕЦ КАК ЕдиницаНормирования,
		|    упоПроектнаяПродукцияРолиТР.ПрофильТрудозатрат КАК ПрофильРаспределения,
		|    упоПроектнаяПродукцияРолиТР.Подразделение КАК Подразделение,
		|    ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения) КАК СпособПривязки,
		|    ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный) КАК УровеньПланирования,
		|    ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы) КАК ИсточникПлана
		|ИЗ
		|    ВТ_ПроектнаяПродукция КАК ВТ_ПроектнаяПродукция
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоПроектнаяПродукция.РолиТР КАК упоПроектнаяПродукцияРолиТР
		|            ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектнойПродукции.СрезПоследних(
		|                    ,
		|                    Версия = &ТекВерсия) КАК упоСтатусыПроектнойПродукцииСрезПоследних
		|            ПО упоПроектнаяПродукцияРолиТР.Ссылка = упоСтатусыПроектнойПродукцииСрезПоследних.ПроектнаяПродукция
		|        ПО ВТ_ПроектнаяПродукция.ПроектнаяПродукция = упоПроектнаяПродукцияРолиТР.Ссылка
		|ГДЕ
		|    ВЫБОР
		|            КОГДА упоСтатусыПроектнойПродукцииСрезПоследних.Статус ЕСТЬ NULL
		|                ТОГДА ИСТИНА
		|            ИНАЧЕ НЕ упоСтатусыПроектнойПродукцииСрезПоследних.Статус В (&СтатусыИсключения)
		|        КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|    упоПроектнаяПродукцияРолиТР.РольТР,
		|    упоПроектнаяПродукцияРолиТР.ПрофильТрудозатрат,
		|    упоПроектнаяПродукцияРолиТР.Подразделение,
		|    ВЫБОР
		|        КОГДА &ЕдиницаНормирования = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|            ТОГДА упоПроектнаяПродукцияРолиТР.Ссылка.ЕдиницаИзмеренияВремени
		|        ИНАЧЕ &ЕдиницаНормирования
		|    КОНЕЦ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТрудовыеРесурсы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если ДанныеИзСтруктуры Тогда
			НоваяСтрока.Основной = Ложь;
		Иначе
			упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(НоваяСтрока,
				ОбъектЗаполнения,
				СтруктураСтоимости,
				,
				,
				Истина,
				Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Статусы

// Записывает статус проектной документации в РС упоСтатусыПроектнойПродукции.
//
// Параметры:
//  ТаблицаПП		 - ТаблицаЗначений	 - таблица со списком удаленной проектной продукции.
//  Период			 - Дата				 - дата изменения статуса
//  Статус			 - ПеречислениеСсылка.упоСтатусыПроектнойПродукции
//  УдалятьИзОчереди - Булево
//
Процедура УстановитьСтатусПроектнойПродукции(ТаблицаПП, Период, Статус = Неопределено, УдалятьИзОчереди = Ложь) Экспорт
	
	СтатусНеактивно = Перечисления.упоСтатусыПроектнойПродукции.Неактивно;
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = СтатусНеактивно;
	КонецЕсли;
	
	Если УдалятьИзОчереди И Статус = СтатусНеактивно Тогда
		УдалитьИзОчередиРасчетаСтатусовПроектнойПродукции(ТаблицаПП);
	КонецЕсли;
	
	ЕстьКолонкаСтатус = ТаблицаПП.Колонки.Найти("Статус") <> Неопределено;
	ПроектныеПродукцииДляОтменыЗадания = Новый Массив;

	// Исполнитель, у которого нет доступа к редактированию проектной продукции,
	// должен косвенно изменять статус проектной продукции по статусу своего задания.
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Строка Из ТаблицаПП Цикл
		
		Запись = РегистрыСведений.упоСтатусыПроектнойПродукции.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.Период = Период;
		Статус = ?(ЕстьКолонкаСтатус, Строка.Статус, Статус);
		Запись.Статус = Статус;
		Попытка
			Запись.Записать();
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписатьОшибкуВОчередьРасчетаСтатусовПроектнойПродукции(Строка.ПроектнаяПродукция, ОписаниеОшибки);
			ВызватьИсключение ОписаниеОшибки;
		КонецПопытки;
		
		Если Статус = СтатусНеактивно Тогда
			ПроектныеПродукцииДляОтменыЗадания.Добавить(Строка.ПроектнаяПродукция);
		КонецЕсли;
			
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПроектныеПродукцииДляОтменыЗадания) Тогда
		ОтменитьЗаданияПроектнойПродукции(ПроектныеПродукцииДляОтменыЗадания);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

// Вызывает расчет статусов проектной продукции.
//
Процедура РассчитатьСтатусыПроектнойПродукции() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.упоРасчетСтатусовПроектнойПродукции);
	
	ОбработатьПорциюОчередиРасчетаСтатусовПроектнойПродукции();
	
КонецПроцедуры

// Обновляет статусы проектной продукции при изменении статуса связанных заданий.
//  Вызывается из подписки модуля набора записей упоЗаданияСтатусы.ПриЗаписи.
//
// Параметры:
//  Задания	 - Массив	 - Задания, по которым необходимо обновить статусы связанной проектной продукции.
//
Процедура ОбновитьСтатусыПроектнойПродукцииПриИзмененииСтатусаЗаданий(Задания) Экспорт
	
	Если Не ЗначениеЗаполнено(Задания) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задания", Задания);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоЗадания.ОбъектБазы КАК ПроектнаяПродукция
		|ПОМЕСТИТЬ ВТ_СПД
		|ИЗ
		|	Справочник.упоЗадания КАК упоЗадания
		|ГДЕ
		|	упоЗадания.Ссылка В(&Задания)
		|	И НЕ упоЗадания.ПометкаУдаления
		|	И упоЗадания.ОбъектБазы ССЫЛКА Справочник.упоПроектнаяПродукция
		|	И ВЫРАЗИТЬ(упоЗадания.ОбъектБазы КАК Справочник.упоПроектнаяПродукция).ПроектнаяЗадача <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СПД.ПроектнаяПродукция КАК ПроектнаяПродукция
		|ИЗ
		|	ВТ_СПД КАК ВТ_СПД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектнойПродукции.СрезПоследних КАК упоСтатусыПроектнойПродукцииСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|			ПО упоСтатусыПроектнойПродукцииСрезПоследних.Версия = упоВерсииПроекта.Версия
		|				И (упоВерсииПроекта.Текущая)
		|		ПО ВТ_СПД.ПроектнаяПродукция = упоСтатусыПроектнойПродукцииСрезПоследних.ПроектнаяПродукция
		|ГДЕ
		|	(упоСтатусыПроектнойПродукцииСрезПоследних.Статус ЕСТЬ NULL
		|			ИЛИ упоСтатусыПроектнойПродукцииСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Неактивно))";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		АктуализироватьСтатусПроектнойПродукции(Выборка.ПроектнаяПродукция);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Устанавливает использование набора свойств.
//
// Параметры:
//  Использование	 - Булево, Неопределено	 - признак включения/отключения доп.реквизитов проектной продукции.
//
Процедура УстановитьПараметрыНабораСвойств(Знач Использование = Неопределено) Экспорт
	
	Если Использование = Неопределено Тогда
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьПроектнуюПродукцию");
	КонецЕсли;
	
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Справочник_упоПроектнаяПродукция", Использование);
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Справочник_упоТипыПроектнойПродукции", Использование);
	
КонецПроцедуры

// Проверка: наличие записей в очереди расчета статусов проектной продукции.
//
// Параметры:
//  ПроектнаяПродукция - Массив 
// 
// Возвращаемое значение:
//  Булево 
//
Функция ЕстьОчередьРасчетаСтатусовПроектнойПродукции(ПроектнаяПродукция) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	упоОчередьРасчетаСтатусовПроектнойПродукции.ПроектнаяПродукция КАК ПроектнаяПродукция
		|ИЗ
		|	РегистрСведений.упоОчередьРасчетаСтатусовПроектнойПродукции КАК упоОчередьРасчетаСтатусовПроектнойПродукции
		|ГДЕ
		|	упоОчередьРасчетаСтатусовПроектнойПродукции.ПроектнаяПродукция В(&ПроектнаяПродукция)";
	
	Запрос.УстановитьПараметр("ПроектнаяПродукция", ПроектнаяПродукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой(); 
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновления

// Процедура используется в обработчике обновлений. Заполняет добавленный реквизит Проект 
// по проекту проектной задачи реквизита ПроектнаяЗадача.
//
Процедура ЗаполнениеРеквизитаПроектПроектнойПродукции() Экспорт
	
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Информация,,,
				НСтр("ru = 'Заполнение реквизита ""Проект"" для существующей проектной продукции: Начало'"));
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоПроектнаяПродукция.Ссылка КАК ПроектнаяПродукция,
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.упоПроектнаяПродукция КАК упоПроектнаяПродукция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		|		ПО упоПроектнаяПродукция.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО (упоПроектнаяЗадача.Проект = Проекты.Ссылка)
		|ГДЕ
		|	упоПроектнаяПродукция.Проект <> Проекты.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			обПроектнаяПродукция = Выборка.ПроектнаяПродукция.ПолучитьОбъект();
			обПроектнаяПродукция.Проект = Выборка.Проект;
			Попытка
				обПроектнаяПродукция.Записать();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,,
					Выборка.ПроектнаяПродукция,
					ТекстОшибки);
			КонецПопытки;
				
		КонецЦикла;
						
	КонецЕсли;
			
	ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,,,
			НСтр("ru = 'Заполнение реквизита ""Проект"" для существующей проектной продукции: Окончание'"));
	
КонецПроцедуры

#КонецОбласти

#Область ПланВыпускаПроектнойЗадачи

// Удаление проектной продукции из плана доходных объемов проектной задачи.Удалить проектную продукцию из плана выпуска
//
// Параметры:
//  ПроектнаяЗадача			 - ДокументСсылка.упоПроектнаяЗадача - очищаемая проектная задача.
//  СписокПроектнойПродукции - ТаблицаЗначений, Массив Из СтрокаТаблицыЗначений - таблица с проектными задачами
//  	и проектной продукцией.
//
Процедура УдалитьПроектнуюПродукциюИзПланаВыпуска(Знач ПроектнаяЗадача, Знач СписокПроектнойПродукции) Экспорт
	
	Если Не ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокПроектнойПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	обПроектнаяЗадача = ПроектнаяЗадача.ПолучитьОбъект(); 
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ЗагрузитьТрудовыеРесурсы", Истина);
	Документы.упоПроектнаяЗадача.ПолучитьДанныеВерсии(Неопределено, обПроектнаяЗадача, ДополнительныеСвойства); 
	
	Для Каждого СтрокаПроектнойПродукции Из СписокПроектнойПродукции Цикл
		
		СтрокиСубпродукта = обПроектнаяЗадача.Субпродукты.НайтиСтроки(Новый Структура("Ресурс", СтрокаПроектнойПродукции.ПроектнаяПродукция));
		Для Каждого НайденнаяСтрока Из СтрокиСубпродукта Цикл
			
			ПараметрыРаспределенных = Новый Структура;
			ПараметрыРаспределенных.Вставить("ИндексСтрокиВладельца", НайденнаяСтрока.ИндексСтрокРаспределения);
			
			СтрокиРаспределения = обПроектнаяЗадача.РаспределениеОбъемов.НайтиСтроки(ПараметрыРаспределенных);
			
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
				обПроектнаяЗадача.РаспределениеОбъемов.Удалить(СтрокаРаспределения);
			КонецЦикла; 
			
			обПроектнаяЗадача.Субпродукты.Удалить(НайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
	обПроектнаяЗадача.ДополнительныеСвойства.Вставить("ДанныеВерсииПолучены", Истина);
	обПроектнаяЗадача.ДополнительныеСвойства.Вставить("ЭтоИнтерактивнаяЗапись", Истина);
	обПроектнаяЗадача.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры //

// Дополнение строки плановых доходных объемов по данным проектной продукции (коэффициент, нормирование и проч.).
//
// Параметры:
//  СтрокаСубпродукты			 - ДанныеФормыЭлементКоллекции	 - дополняемая строка доходных объемов.
//  МассивРаспределенияОбъемов	 - Массив Из ДанныеФормыЭлементКоллекции - подчиненне строки распределения.
//  Версия						 - ДокументСсылка.упоВерсияПланаПроекта - версия плана проекта.
//  ЭтоШаблон					 - Булево - признак того, что в поле ресурса доходных объемов выбран шаблон проектной продукции.
//
Процедура ЗаполнитьПланВыпускаПоПроектнойПродукции(СтрокаСубпродукты, 
	МассивРаспределенияОбъемов, 
	Версия = Неопределено,
	ЭтоШаблон = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяПродукция", СтрокаСубпродукты.Ресурс);
	//Запрос.УстановитьПараметр("Версия", Версия);
	
	//Если ЭтоШаблон Тогда
	
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Т.Количество КАК Количество,
		               |	Т.Трудоемкость КАК Трудоемкость,
		               |	Т.Нормирование КАК Нормирование,
		               |	Т.КоэффициентСложности КАК КоэффициентСложности,
		               |	Т.ЕдиницаИзмерения КАК ЕдиницаНормирования,
		               |	Т.СкоростьВыполнения КАК СкоростьВыполнения					   
		               |ИЗ
		               |	Справочник.упоПроектнаяПродукция КАК Т
		               |ГДЕ
		               |	Т.Ссылка = &ПроектнаяПродукция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Т.РольТР КАК Роль,
		               |	Т.Подразделение КАК Подразделение,
		               |	Т.Количество КАК Количество,
		               |	Т.Трудоемкость КАК Трудоемкость,
		               |	Т.ПроцентРаспределения КАК ПроцентРаспределения,
		               |	Т.Нормирование КАК Нормирование,
		               |	Т.КоэффициентСложности КАК КоэффициентСложности,
		               |	Т.РольТР.СобствСилы_Субподряд КАК СобствСилы_Субподряд
		               |ИЗ
		               |	Справочник.упоПроектнаяПродукция.РолиТР КАК Т
		               |ГДЕ
		               |	Т.Ссылка = &ПроектнаяПродукция";
		
	//Иначе
	//	
	//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	               |	Т.Количество КАК Количество,
	//	               |	Т.Трудоемкость КАК Трудоемкость,
	//	               |	Т.Нормирование КАК Нормирование,
	//	               |	Т.КоэффициентСложности КАК КоэффициентСложности,
	//	               |	Т.ЕдиницаИзмерения КАК ЕдиницаНормирования
	//	               |ИЗ
	//	               |	РегистрСведений.упоДанныеПроектнойПродукции КАК Т
	//	               |ГДЕ
	//	               |	Т.Версия = &Версия
	//	               |	И Т.ПроектнаяПродукция = &ПроектнаяПродукция
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	               |	Т.РольТР КАК Роль,
	//	               |	Т.Подразделение КАК Подразделение,
	//	               |	Т.Количество КАК Количество,
	//	               |	Т.Трудоемкость КАК Трудоемкость,
	//	               |	Т.ПроцентРаспределения КАК ПроцентРаспределения,
	//	               |	Т.Нормирование КАК Нормирование,
	//	               |	Т.КоэффициентСложности КАК КоэффициентСложности,
	//	               |	Т.РольТР.СобствСилы_Субподряд КАК СобствСилы_Субподряд
	//	               |ИЗ
	//	               |	РегистрСведений.упоДанныеТрудозатратПроектнойПродукции КАК Т
	//	               |ГДЕ
	//	               |	Т.Версия = &Версия
	//	               |	И Т.ПроектнаяПродукция = &ПроектнаяПродукция";
	//	
	//КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтрокаСубпродукты, Выборка);
	
	Если РезультатЗапроса[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаРоли = РезультатЗапроса[1].Выбрать();
	СписокСвойств = "Роль, Подразделение, СобствСилы_Субподряд, Количество, 
		|Трудоемкость, ПроцентРаспределения, Нормирование, КоэффициентСложности";
	Пока ВыборкаРоли.Следующий() Цикл
		СтрокаРаспределения = Новый Структура(СписокСвойств);
		ЗаполнитьЗначенияСвойств(СтрокаРаспределения, ВыборкаРоли);
		МассивРаспределенияОбъемов.Добавить(СтрокаРаспределения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОчередьРасчетаСтатусовПроектнойПродукции

Процедура ОбработатьПорциюОчередиРасчетаСтатусовПроектнойПродукции() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 300
		|	упоОчередьРасчетаСтатусовПроектнойПродукции.ПроектнаяПродукция КАК ПроектнаяПродукция
		|ИЗ
		|	РегистрСведений.упоОчередьРасчетаСтатусовПроектнойПродукции КАК упоОчередьРасчетаСтатусовПроектнойПродукции
		|ГДЕ
		|	НЕ упоОчередьРасчетаСтатусовПроектнойПродукции.Ошибка
		|
		|УПОРЯДОЧИТЬ ПО
		|	упоОчередьРасчетаСтатусовПроектнойПродукции.ДатаВМиллиСекундах";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПП = РезультатЗапроса.Выгрузить();
	ПроектныеПродукции = ТаблицаПП.ВыгрузитьКолонку("ПроектнаяПродукция");
	
	УдалитьИзОчередиРасчетаСтатусовПроектнойПродукции(ТаблицаПП);
	АктуализироватьСтатусПроектнойПродукции(ПроектныеПродукции);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОчередьРасчетаСтатусовПроектнойПродукции

Процедура ЗаполнитьНовуюЗаписьВОчередиРасчетаСтатусовПроектнойПродукции(Запись, ПроектнаяПродукция)
	
	Дата = ТекущаяДата();
	ДатаВМиллиСекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() + (ТекущаяДата() - ТекущаяУниверсальнаяДата());
	
	Запись.ПроектнаяПродукция = ПроектнаяПродукция;
	Запись.Дата = Дата;
	Запись.ДатаВМиллиСекундах = ДатаВМиллиСекундах;
	Запись.Ошибка = Ложь;
	Запись.ОписаниеОшибки = "";
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВОчередьРасчетаСтатусовПроектнойПродукции(ПроектнаяПродукция, ОписаниеОшибки)
	
	// Привилегированный режим в методе вызова.
	
	НаборЗаписей = РегистрыСведений.упоОчередьРасчетаСтатусовПроектнойПродукции.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроектнаяПродукция.Установить(ПроектнаяПродукция);
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьНовуюЗаписьВОчередиРасчетаСтатусовПроектнойПродукции(Запись, ПроектнаяПродукция);
	Запись.Ошибка = Истина;
	Запись.ОписаниеОшибки = ОписаниеОшибки;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИзОчередиРасчетаСтатусовПроектнойПродукции(ТаблицаПроектнойПродукции)
	
	ИмяРегистра = "упоОчередьРасчетаСтатусовПроектнойПродукции";
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений." + ИмяРегистра);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаПроектнойПродукции;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПроектнаяПродукция", "ПроектнаяПродукция");
	Блокировка.Заблокировать();
	
	Попытка
	
		Для Каждого СтрокаПП Из ТаблицаПроектнойПродукции Цикл
			НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПроектнаяПродукция.Установить(СтрокаПП.ПроектнаяПродукция);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		БылаОшибкаЗаписи = Истина;
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОшибкаЗаписиСтруктурыПроекта", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений[ИмяРегистра],, ПредставлениеОшибки);
		
		Текст = НСтр("ru = 'Ошибка удаления проектной продукции из очереди расчета статусов. Подробнее см. журнал регистрации.'");
		ОбщегоНазначения.СообщитьПользователю();
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

// Генерирует наименование проектной документации по шаблону и проектной задаче
//
// Параметры:
//  ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача	 - проектная задача
//  Шаблон		    - СправочникСсылка.упоПроектнаяПродукция - структура проектной документации с типом шаблон
//
// Возвращаемое значение:
//   Строка   - сформированное наименование проектной документации.
Функция НаименованиеПоШаблону(ПроектнаяЗадача, Шаблон)
	
	РеквизитыПЗ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроектнаяЗадача, "Проект, Номер");
	КодПроекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПЗ.Проект, "Код");
	НомерПЗ = РеквизитыПЗ.Номер;
	НаименованиеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "Наименование");
	
	Наименование = СтрШаблон(нСтр("ru='%1-%2 %3'", "ru"), СокрЛП(КодПроекта), НомерПЗ, НаименованиеШаблона);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	упоПроектнаяПродукция.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.упоПроектнаяПродукция КАК упоПроектнаяПродукция
		|ГДЕ
		|	упоПроектнаяПродукция.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование + "%");
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		НомерПП = "1";
		
	Иначе
		
		КоличествоЗаписей = РезультатЗапроса.Выбрать().Количество();
		НомерПП = КоличествоЗаписей + 1;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Наименование = СтрШаблон(нСтр("ru='%1 %2'", "ru"), Наименование, НомерПП);
	
	Возврат Наименование;
	
КонецФункции

Функция ПроектнаяПродукцияИзменена(ПроектнаяПродукция, ДанныеШапки, ДанныеРаспределения)
	
	ОбнаруженыИзменения = Ложь;
	
	// ТОDO Нужен какой-то признак, что ПП изменен.
	ПроверочныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроектнаяПродукция, "Трудоемкость, Количество, Нормирование, КоэффициентСложности");
	
	Для Каждого КлючЗначение Из ПроверочныеРеквизиты Цикл
		ОбнаруженыИзменения = КлючЗначение.Значение <> ДанныеШапки[КлючЗначение.Ключ];
		Если ОбнаруженыИзменения Тогда
			Возврат ОбнаруженыИзменения;
		КонецЕсли;
	КонецЦикла;
	
	Если ПроектнаяПродукция.РолиТР.Количество() <> ДанныеРаспределения.Количество() Тогда
		ОбнаруженыИзменения = Истина;
		Возврат ОбнаруженыИзменения;
	КонецЕсли;
	
	СписокРеквизитов = "РольТР, Подразделение, ПроцентРаспределения, Количество, Нормирование, КоэффициентСложности, Трудоемкость";
	Для Каждого СтрокаРаспределения Из ДанныеРаспределения Цикл
		
		СтруктураОтбора = Новый Структура(СписокРеквизитов);
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаРаспределения);
		СтруктураОтбора.РольТР = СтрокаРаспределения.Роль;
		
		НайденныеСтроки = ПроектнаяПродукция.РолиТР.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			ОбнаруженыИзменения = Истина;
			Возврат ОбнаруженыИзменения;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбнаруженыИзменения;
	
КонецФункции //

Функция ПолучитьОбъектПроектнойЗадачи(ПроектнаяЗадача)
	
	Результат = Неопределено;
	
	ЗапросТекущихСвойств = Новый Запрос;
	ЗапросТекущихСвойств.Текст = ТекстЗапросаТекущихСвойствПЗ();
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
	
	ЗапросТекущихСвойств.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	ЗапросТекущихСвойств.УстановитьПараметр("ТекВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	РезультатЗапросаТекущихСвойств = ЗапросТекущихСвойств.Выполнить();
	
	Если Не РезультатЗапросаТекущихСвойств.Пустой() Тогда
		ВыборкаТекущихСвойств = РезультатЗапросаТекущихСвойств.Выбрать();
		ВыборкаТекущихСвойств.Следующий();
		Результат = ВыборкаТекущихСвойств.Объект;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //

Функция ТекстЗапросаТекущихСвойствПЗ()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &ПроектнаяЗадача
		|				И Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних";
	
	Возврат ТекстЗапроса;
	
КонецФункции //

Процедура АктуализироватьСтатусПроектнойПродукции(ПроектнаяПродукция, УдалятьИзОчереди = Ложь)
	
	мВидыЗаданий = Новый Массив;
	мВидыЗаданий.Добавить(Справочники.упоВидыЗаданий.Поручение);
	мВидыЗаданий.Добавить(Справочники.упоВидыЗаданий.Согласование);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПроектнаяПродукция);
	Запрос.УстановитьПараметр("ВидыЗаданий", мВидыЗаданий);
	
	Запрос.Текст = ТекстЗапросаЗаданияСПроектнойПродукцией();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСтатусПроектнойПродукции(РезультатЗапроса.Выгрузить(), ТекущаяДатаСеанса(),, УдалятьИзОчереди);

КонецПроцедуры

Процедура ОтменитьЗаданияПроектнойПродукции(ПроектнаяПродукция)
	
	Запрос = Новый Запрос;

	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусыЗаданий.Завершено"));
	СписокСтатусов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусыЗаданий.Закрыто"));
	СписокСтатусов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусыЗаданий.Отменено"));
	
	Запрос.УстановитьПараметр("СтатусыИсключения", СписокСтатусов);
	Запрос.УстановитьПараметр("ОбъектБазы", ПроектнаяПродукция);
	
	Запрос.Текст = "ВЫБРАТЬ
		|	упоЗадания.Ссылка КАК Задание,
		|	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус
		|ИЗ
		|	Справочник.упоЗадания КАК упоЗадания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
		|		ПО (упоЗадания.Ссылка = упоЗаданияСтатусыСрезПоследних.Задание)
		|ГДЕ
		|	упоЗадания.ОбъектБазы В (&ОбъектБазы)
		|	И НЕ упоЗадания.ПометкаУдаления
		|	И НЕ упоЗаданияСтатусыСрезПоследних.Статус В (&СтатусыИсключения)";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СтатусОтменено = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусыЗаданий.Отменено");
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		упоЗаданияСервер.УстановитьСтатусЗадания(Выборка.Задание, СтатусОтменено);
	КонецЦикла;
		
КонецПроцедуры //

Функция ТекстЗапросаЗаданияСПроектнойПродукцией()

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗадания.Ссылка КАК Задание,
	               |	упоЗадания.ОбъектБазы КАК ПроектнаяПродукция,
	               |	ВЫРАЗИТЬ(упоЗадания.ОбъектБазы КАК Справочник.упоПроектнаяПродукция).ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_Задания
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания
	               |ГДЕ
	               |	упоЗадания.ОбъектБазы В (&Ссылка)
	               |	И НЕ упоЗадания.ПометкаУдаления
	               |	И упоЗадания.ВидЗадания В(&ВидыЗаданий)
	               |	И ВЫРАЗИТЬ(упоЗадания.ОбъектБазы КАК Справочник.упоПроектнаяПродукция).ПроектнаяЗадача <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_Задания.Задание КАК Задание,
	               |	ВТ_Задания.ПроектнаяПродукция КАК ПроектнаяПродукция,
	               |	ВТ_Задания.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ ВТ_ЗаданияДополненная
	               |ИЗ
	               |	ВТ_Задания КАК ВТ_Задания
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО ВТ_Задания.ПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ЗаданияДополненная.Версия КАК Версия,
	               |	ВТ_ЗаданияДополненная.ПроектнаяПродукция КАК ПроектнаяПродукция,
	               |	ВТ_ЗаданияДополненная.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВЫБОР
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Уточняется)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Уточняется)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Выполняется)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Выполняется)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Выдано)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Выдано)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Открыто)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Открыто)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Завершено)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Завершено)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Закрыто)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Закрыто)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Отменено)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Отменено)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.НаСогласовании)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.НаСогласовании)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.НеСогласовано)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.НеСогласовано)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Согласовано)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Согласовано)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.ПустаяСсылка)
	               |	КОНЕЦ КАК Статус,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Уточняется)
	               |				ТОГДА 1
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Выполняется)
	               |				ТОГДА 2
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Выдано)
	               |				ТОГДА 3
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Открыто)
	               |				ТОГДА 4
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.НаСогласовании)
	               |				ТОГДА 5
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.НеСогласовано)
	               |				ТОГДА 6
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Согласовано)
	               |				ТОГДА 7
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Завершено)
	               |				ТОГДА 8
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Закрыто)
	               |				ТОГДА 9
	               |			КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Отменено)
	               |				ТОГДА 10
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Приоритет
	               |ПОМЕСТИТЬ ВТ_ПроектныеПродукцииГруппировка
	               |ИЗ
	               |	ВТ_ЗаданияДополненная КАК ВТ_ЗаданияДополненная
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
	               |				,
	               |				Задание В
	               |					(ВЫБРАТЬ
	               |						ВТ_Задания.Задание КАК Задание
	               |					ИЗ
	               |						ВТ_Задания КАК ВТ_Задания)) КАК упоЗаданияСтатусыСрезПоследних
	               |		ПО ВТ_ЗаданияДополненная.Задание = упоЗаданияСтатусыСрезПоследних.Задание
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЗаданияДополненная.Версия,
	               |	ВТ_ЗаданияДополненная.ПроектнаяЗадача,
	               |	ВТ_ЗаданияДополненная.ПроектнаяПродукция,
	               |	ВЫБОР
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Уточняется)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Уточняется)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Выполняется)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Выполняется)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Выдано)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Выдано)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Открыто)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Открыто)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Завершено)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Завершено)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Закрыто)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Закрыто)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Отменено)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Отменено)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.НаСогласовании)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.НаСогласовании)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.НеСогласовано)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.НеСогласовано)
	               |		КОГДА упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упостатусыЗаданий.Согласовано)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Согласовано)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.ПустаяСсылка)
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПроектныеПродукцииГруппировка.Версия КАК Версия,
	               |	ВТ_ПроектныеПродукцииГруппировка.ПроектнаяПродукция КАК ПроектнаяПродукция,
	               |	ВТ_ПроектныеПродукцииГруппировка.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	МИНИМУМ(ВТ_ПроектныеПродукцииГруппировка.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ ВТ_ПроектныеПродукцииСУровнемПриоритетом
	               |ИЗ
	               |	ВТ_ПроектныеПродукцииГруппировка КАК ВТ_ПроектныеПродукцииГруппировка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПроектныеПродукцииГруппировка.ПроектнаяЗадача,
	               |	ВТ_ПроектныеПродукцииГруппировка.Версия,
	               |	ВТ_ПроектныеПродукцииГруппировка.ПроектнаяПродукция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПроектныеПродукцииГруппировка.Версия КАК Версия,
	               |	ВТ_ПроектныеПродукцииГруппировка.ПроектнаяПродукция КАК ПроектнаяПродукция,
	               |	ВТ_ПроектныеПродукцииГруппировка.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_ПроектныеПродукцииГруппировка.Статус КАК Статус,
	               |	ВТ_ПроектныеПродукцииГруппировка.Приоритет КАК Приоритет
	               |ИЗ
	               |	ВТ_ПроектныеПродукцииГруппировка КАК ВТ_ПроектныеПродукцииГруппировка
	               |ГДЕ
	               |	(ВТ_ПроектныеПродукцииГруппировка.ПроектнаяПродукция, ВТ_ПроектныеПродукцииГруппировка.Приоритет) В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПППриоритет.ПроектнаяПродукция,
	               |				ВТ_ПППриоритет.Приоритет
	               |			ИЗ
	               |				ВТ_ПроектныеПродукцииСУровнемПриоритетом КАК ВТ_ПППриоритет)";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти