////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с шаблонами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Главный модуль экспорта данных из реального проекта в шаблона проекта по заданным параметрам.
// 
// Параметры:
//  ПараметрыЭкспорта - Структура - содержит настройки пользователя:
//		* Проект                - СправочникСсылка.Проекты.
//		* Этап                  - ДокументСсылка.упоПроектнаяЗадача.
//		* НазваниеШаблона       - Строка.
//		* СоздатьКорневуюЗадачу - Булево.
//  ТекстОшибки       - Строка - заполняется при возникновении ошибки.
// 
// Возвращаемое значение:
//  Булево - признак ошибки.
// 
Функция обЭкспортДанныхПроектаВШаблон(ПараметрыЭкспорта, ТекстОшибки = "") Экспорт
	
	ЕстьОшибка = Ложь;
	ОписаниеОшибки = "";
	Индикатор = Неопределено;
	НовыйШаблон = Неопределено;
	
	НачатьТранзакцию();
	Попытка
		ДанныеПроекта = ПолучитьДанныеПроекта(ПараметрыЭкспорта.Проект);
		
		ЗаписатьДанныеПроектаВШаблон(ПараметрыЭкспорта, ДанныеПроекта, Индикатор, НовыйШаблон);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ЕстьОшибка = Истина;
		ОписаниеОшибки = ОписаниеОшибки();
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат Новый Структура("Ошибка, ОписаниеОшибки, Шаблон", ЕстьОшибка, ОписаниеОшибки, НовыйШаблон);
	
КонецФункции

// Главный модуль импорта данных шаблона проекта в реальный проект по заданным параметрам.
// 
// Параметры:
//  ПараметрыИмпорта - Структура, содержит настройки пользователя:
//		* Шаблон                     - СправочникСсылка.упоШаблоныПроектов.
//		* Проект                     - СправочникСсылка.Проекты.
//		* Этап                       - ДокументСсылка.упоПроектнаяЗадача.
//		* ОчиститьПроект             - Булево.
//		* СоздатьКорневуюЗадачу      - Булево.
//		* ДатаНачала                 - Дата.
//		* КоэффициентМасштабирования - Число.
//  ТекстОшибки      - Строка - заполняется при возникновении ошибки.
// 
// Возвращаемое значение:
//  Булево - признак ошибки.
// 
Функция обИмпортДанныхШаблонаВПроект(ПараметрыИмпорта, ТекстОшибки = "") Экспорт
	
	Проект = ПараметрыИмпорта.Проект;
	
	ЕстьОшибка = Ложь;
	ОписаниеОшибки = "";
	Индикатор = Неопределено;
	
	Попытка
		
		ОписаниеОшибки = ПолучитьСообщениеПроверкиСтатусаПроекта(Проект);
		
		Если ОписаниеОшибки <> "" Тогда
			Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, ОписаниеОшибки);
		КонецЕсли;
		
		Если ПараметрыИмпорта.ОчиститьПроект = Истина Тогда
			ЕстьОшибка = ОчиститьПроект(Проект, Индикатор);
			Если ЕстьОшибка = Истина Тогда
				
				ОписаниеОшибки = НСтр("ru = 'Невозможно очистить проект. По проекту имеются фактические данные!'");
				
				Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
		
		ДанныеШаблона = ПолучитьДанныеШаблона(ПараметрыИмпорта);
		
		ЕстьОшибка = ЗаписатьДанныеШаблонаВПроект(ПараметрыИмпорта, ДанныеШаблона, Индикатор, ТекстОшибки);
		
		Если ЕстьОшибка = Истина Тогда
			
			Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, ТекстОшибки);
			
		КонецЕсли;
		
	Исключение
		
		ЕстьОшибка = Истина;
		ТекстОшибки = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат Новый Структура("Ошибка, ОписаниеОшибки", ЕстьОшибка, ТекстОшибки);
	
КонецФункции

// Проверяет статус проект и если статус Завершен или Проект не зарегистрирован,
// то возвращает соответствующее сообщение
// Параметры:
//	Проект - СправочникСсылка.Проекты - Проверяемый проект.
//
// Возвращаемое значение:
//	Строка - Пустая строка, если проверка статуса прошла успешно.
//
Функция ПолучитьСообщениеПроверкиСтатусаПроекта(Проект) Экспорт
	
	Статус = упоПроектыИЗадачиСервер.ПолучитьСтатусПроекта(Проект);
	
	ТекстОшибки = "";
	Если Статус = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Отказ выполнения операции. Выбранный проект необходимо зарегистрировать!'");
	КонецЕсли;
	
	СтатусЗавершен = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаПроекта.Завершен");
	Если Статус = СтатусЗавершен Тогда
		
		ТекстОшибки = НСтр("ru = 'Отказ выполнения операции. Выбранный проект не может находиться в статусе %1!'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтатусЗавершен);
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЭкспортПроектаВШаблон

// Функция возвращает данные БД по заданному проекту.
// 
// Параметры:
//	Проект - СправочникСсылка.Проекты - проект.
//
// Возвращаемое значение:
//	ТаблицаЗначений - содержит трубуемые данные.
//		ТаблицаЗадач               - ТаблицаЗначений.
//		ТаблицаПредУсловийЗадач    - ТаблицаЗначений.
//		ТаблицаМатРесурсовЗадач    - ТаблицаЗначений.
// 
Функция ПолучитьДанныеПроекта(Проект)
	
	// Создим возвращаемую структуру.
	ДанныеПроекта = Новый Структура;
	ДанныеПроекта.Вставить("Проект", Проект);
	ДанныеПроекта.Вставить("ТаблицаЗадач");
	ДанныеПроекта.Вставить("ТаблицаСроков");
	ДанныеПроекта.Вставить("ТаблицаПредУсловийЗадач");
	ДанныеПроекта.Вставить("ТаблицаМатРесурсовЗадач");
	ДанныеПроекта.Вставить("ТаблицаСубпродуктовЗадач");
	ДанныеПроекта.Вставить("ТаблицаДопЗатратЗадач");
	ДанныеПроекта.Вставить("ТаблицаТрудовыхРесурсовЗадач");
	ДанныеПроекта.Вставить("ТаблицаФинПланыДДС");
	ДанныеПроекта.Вставить("ТаблицаФинПланыДР");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеОбъемовЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеПотребностейЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДопЗатратЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовПоПериодамЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовПоПериодамЗадач");
	ДанныеПроекта.Вставить("ТаблицаТрудовыеРесурсыПоПериодамЗадач");
	
	// Каждое поле возвращаемой структры заполняем отобранными данными из БД.
	текВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Дата", '00010101');
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Версия", текВерсия);
	Запрос.УстановитьПараметр("ЕдВремениЧас", Справочники.упоЕдиницыВремени.Час);
	Запрос.УстановитьПараметр("МатериальныйРесурс", Перечисления.упоВидРесурса.Материальный);
	ИсточникПланаБДР = Новый Массив;
	ИсточникПланаБДР.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ПустаяСсылка());
	ИсточникПланаБДР.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
	Запрос.УстановитьПараметр("ИсточникПланаБДР", ИсточникПланаБДР);			
	// Получим данные по задачам проекта.
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваПроектныхЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	СвойстваПроектныхЗадач.ЗадачаРодитель КАК Родитель,
		|	СвойстваПроектныхЗадач.НазваниеЗадачи КАК НазваниеЗадачи,
		|	СвойстваПроектныхЗадач.ЭтоПакетРабот КАК ЭтоПакетРабот,
		|	СвойстваПроектныхЗадач.ЭтоВеха КАК ЭтоВеха,
		|	СвойстваПроектныхЗадач.НормаСтоимости КАК НормаСтоимости,
		|	СвойстваПроектныхЗадач.ОписаниеЗадачи КАК ОписаниеЗадачи,
		|	СвойстваПроектныхЗадач.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
		|	СвойстваПроектныхЗадач.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|	СвойстваПроектныхЗадач.Длительность КАК Длительность,
		|	СвойстваПроектныхЗадач.СпособПривязкиДопЗатрат КАК СпособПривязкиДопЗатрат,
		|	СвойстваПроектныхЗадач.ВидОперации КАК ВидОперации,
		|	СвойстваПроектныхЗадач.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта,
		|	СвойстваПроектныхЗадач.РучнойВводСроков КАК РучнойВводСроков,
		|	СвойстваПроектныхЗадач.ВключитьСубпродуктыВПланДоходов КАК ВключитьСубпродуктыВПланДоходов,
		|	СвойстваПроектныхЗадач.ВключитьМатРесурсыВПланРасходов КАК ВключитьМатРесурсыВПланРасходов,
		|	СвойстваПроектныхЗадач.ВключитьТрудРесурсыВПланРасходов КАК ВключитьТрудРесурсыВПланРасходов,
		|	СвойстваПроектныхЗадач.Объект КАК Объект,
		|	СвойстваПроектныхЗадач.КрайнийСрок КАК КрайнийСрок,
		|	СвойстваПроектныхЗадач.МетодРасчетаМоделиПакетаРабот КАК МетодРасчетаМоделиПакетаРабот,
		|	СвойстваПроектныхЗадач.СпособПланированияРасходов КАК СпособПланированияРасходов,
		|	СвойстваПроектныхЗадач.УчестьРучнойВводСроковПриАктуализации КАК УчестьРучнойВводСроковПриАктуализации,
		|	СвойстваПроектныхЗадач.ПланироватьТрудозатратыНаИсполнителей КАК ПланироватьТрудозатратыНаИсполнителей,
		|	СвойстваПроектныхЗадач.ДлительностьМоделиПакетаРабот КАК ДлительностьМоделиПакетаРабот,
		|	СвойстваПроектныхЗадач.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
		|	СвойстваПроектныхЗадач.КодПроектногоДокумента КАК КодПроектногоДокумента,
		|	СвойстваПроектныхЗадач.КритерийРезультата КАК КритерийРезультата,
		|	СвойстваПроектныхЗадач.ОписаниеРезультата КАК ОписаниеРезультата,
		|	СвойстваПроектныхЗадач.КалендарьЗадачи КАК КалендарьЗадачи,
		|	СвойстваПроектныхЗадач.ВключитьДопЗатратыВПланРасходов КАК ВключитьДопЗатратыВПланРасходов,
		|	СвойстваПроектныхЗадач.УровеньПланированияТрудозатратДляБДР КАК УровеньПланированияТрудозатратДляБДР,
		|	СвойстваПроектныхЗадач.ВключитьПланРасходовВБДДС КАК ВключитьПланРасходовВБДДС,
		|	СвойстваПроектныхЗадач.ВключитьПланДоходовВБДДС КАК ВключитьПланДоходовВБДДС,
		|	СвойстваПроектныхЗадач.СхемаОплатыПоУмолчаниюРасходы КАК СхемаОплатыПоУмолчаниюРасходы,
		|	СвойстваПроектныхЗадач.СхемаОплатыПоУмолчаниюДоходы КАК СхемаОплатыПоУмолчаниюДоходы,
		|	СвойстваПроектныхЗадач.НормаСтоимостиОбъемы КАК НормаСтоимостиОбъемы,
		|	СвойстваПроектныхЗадач.ТипСубпродукта КАК ТипСубпродукта,
		|	СвойстваПроектныхЗадач.ТранслироватьЗатратыПоСубпродуктам КАК ТранслироватьЗатратыПоСубпродуктам,
		|	СвойстваПроектныхЗадач.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
		|	СвойстваПроектныхЗадач.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(&Дата, Версия = &Версия) КАК СвойстваПроектныхЗадач
		|ГДЕ
		|	НЕ СвойстваПроектныхЗадач.ЗадачаОтменена
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КодыСДР.КодСДР КАК КодСДР,
		|	втЗадачи.ПроектнаяЗадача КАК Задача,
		|	втЗадачи.Родитель КАК Родитель,
		|	втЗадачи.НазваниеЗадачи КАК НазваниеЗадачи,
		|	втЗадачи.ЭтоПакетРабот КАК ЭтоПакетРабот,
		|	втЗадачи.ЭтоВеха КАК ЭтоВеха,
		|	втЗадачи.НормаСтоимости КАК НормаСтоимости,
		|	втЗадачи.ОписаниеЗадачи КАК ОписаниеЗадачи,
		|	втЗадачи.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
		|	втЗадачи.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|	втЗадачи.Длительность КАК Длительность,
		|	втЗадачи.СпособПривязкиДопЗатрат КАК СпособПривязкиДопЗатрат,
		|	втЗадачи.ВидОперации КАК ВидОперации,
		|	втЗадачи.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта,
		|	втЗадачи.РучнойВводСроков КАК РучнойВводСроков,
		|	втЗадачи.ВключитьСубпродуктыВПланДоходов КАК ВключитьСубпродуктыВПланДоходов,
		|	втЗадачи.ВключитьМатРесурсыВПланРасходов КАК ВключитьМатРесурсыВПланРасходов,
		|	втЗадачи.ВключитьТрудРесурсыВПланРасходов КАК ВключитьТрудРесурсыВПланРасходов,
		|	втЗадачи.Объект КАК Объект,
		|	втЗадачи.КрайнийСрок КАК КрайнийСрок,
		|	втЗадачи.МетодРасчетаМоделиПакетаРабот КАК МетодРасчетаМоделиПакетаРабот,
		|	втЗадачи.СпособПланированияРасходов КАК СпособПланированияРасходов,
		|	втЗадачи.УчестьРучнойВводСроковПриАктуализации КАК УчестьРучнойВводСроковПриАктуализации,
		|	втЗадачи.ПланироватьТрудозатратыНаИсполнителей КАК ПланироватьТрудозатратыНаИсполнителей,
		|	втЗадачи.ДлительностьМоделиПакетаРабот КАК ДлительностьМоделиПакетаРабот,
		|	втЗадачи.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
		|	втЗадачи.КодПроектногоДокумента КАК КодПроектногоДокумента,
		|	втЗадачи.КритерийРезультата КАК КритерийРезультата,
		|	втЗадачи.ОписаниеРезультата КАК ОписаниеРезультата,
		|	втЗадачи.КалендарьЗадачи КАК КалендарьЗадачи,
		|	втЗадачи.ВключитьДопЗатратыВПланРасходов КАК ВключитьДопЗатратыВПланРасходов,
		|	втЗадачи.УровеньПланированияТрудозатратДляБДР КАК УровеньПланированияТрудозатратДляБДР,
		|	втЗадачи.ВключитьПланРасходовВБДДС КАК ВключитьПланРасходовВБДДС,
		|	втЗадачи.ВключитьПланДоходовВБДДС КАК ВключитьПланДоходовВБДДС,
		|	втЗадачи.СхемаОплатыПоУмолчаниюРасходы КАК СхемаОплатыПоУмолчаниюРасходы,
		|	втЗадачи.СхемаОплатыПоУмолчаниюДоходы КАК СхемаОплатыПоУмолчаниюДоходы,
		|	втЗадачи.НормаСтоимостиОбъемы КАК НормаСтоимостиОбъемы,
		|	втЗадачи.ТипСубпродукта КАК ТипСубпродукта,
		|	втЗадачи.ТранслироватьЗатратыПоСубпродуктам КАК ТранслироватьЗатратыПоСубпродуктам,
		|	втЗадачи.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
		|	втЗадачи.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов
		|ИЗ
		|	втЗадачи КАК втЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК КодыСДР
		|		ПО втЗадачи.ПроектнаяЗадача = КодыСДР.СсылкаНаПроектнуюЗадачу";
	
	ДанныеПроекта.Вставить("ТаблицаЗадач", Запрос.Выполнить().Выгрузить());
	ДанныеПроекта.ТаблицаЗадач.Индексы.Добавить("Родитель");
	
	// Получим данные по срокам задач.
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК Задача,
		|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан
		|ИЗ
		|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСрокиПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача";
	
	ДанныеПроекта.Вставить("ТаблицаСроков", Запрос.Выполнить().Выгрузить());
	ДанныеПроекта.ТаблицаЗадач.Индексы.Добавить("Задача");
	
	// Получим данные по финансовым планам проекта.
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеБДДС.ПроектнаяЗадача КАК Задача,
		|	ДанныеБДДС.СтатьяДДС КАК СтатьяДДС,
		|	ДанныеБДДС.НаправлениеДвижения КАК НаправлениеДвижения,
		|	ДанныеБДДС.Контрагент КАК Контрагент,
		|	ДанныеБДДС.СпособПривязки КАК СпособПривязки,
		|	ДанныеБДДС.ВидПлатежа КАК ВидПлатежа,
		|	ДанныеБДДС.Задержка КАК Задержка,
		|	ДанныеБДДС.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДанныеБДДС.Валюта КАК Валюта,
		|	СУММА(ДанныеБДДС.СуммаВалютная) КАК Сумма
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДвиженияДенежныхСредств.СрезПоследних(, Версия = &Версия) КАК ДанныеБДДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеБДДС.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	(ДанныеБДДС.Сумма <> 0
		|			ИЛИ ДанныеБДДС.СуммаВалютная <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеБДДС.СпособПривязки,
		|	ДанныеБДДС.ВидПлатежа,
		|	ДанныеБДДС.Контрагент,
		|	ДанныеБДДС.ПроектнаяЗадача,
		|	ДанныеБДДС.НаправлениеДвижения,
		|	ДанныеБДДС.СтатьяДДС,
		|	ДанныеБДДС.Валюта,
		|	ДанныеБДДС.ПрофильРаспределения,
		|	ДанныеБДДС.Задержка";
	
	ДанныеПроекта.Вставить("ТаблицаФинПланыДДС", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   ДанныеБДР.ПроектнаяЗадача КАК Задача,
        |   ДанныеБДР.Статья КАК Статья,
        |   ДанныеБДР.ВидЭлемента КАК ВидЭлемента,
        |   ДанныеБДР.Контрагент КАК Контрагент,
        |   ДанныеБДР.ПрофильРаспределения КАК ПрофильРаспределения,
        |   ДанныеБДР.СпособПривязки КАК СпособПривязки,
        |   ДанныеБДР.Валюта КАК Валюта,
        |   СУММА(ДанныеБДР.СуммаВалютная) КАК Сумма,
        |   ДанныеБДР.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
        |   ДанныеБДР.Договор КАК Договор
        |ИЗ
        |   РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
        |           ,
        |           Версия = &Версия
        |               И НЕ ЭтоСубпродуктИлиПотребность) КАК ДанныеБДР
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
        |       ПО ДанныеБДР.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
        |ГДЕ
        |   ДанныеБДР.ИсточникПлана В(&ИсточникПланаБДР)
        |   И (ДанныеБДР.Сумма <> 0
        |           ИЛИ ДанныеБДР.СуммаВалютная <> 0)
        |
        |СГРУППИРОВАТЬ ПО
        |   ДанныеБДР.ВидЭлемента,
        |   ДанныеБДР.Статья,
        |   ДанныеБДР.ПроектнаяЗадача,
        |   ДанныеБДР.ПрофильРаспределения,
        |   ДанныеБДР.СпособПривязки,
        |   ДанныеБДР.Валюта,
        |   ДанныеБДР.Контрагент,
        |   ДанныеБДР.ИндексСтрокРаспределения,
        |   ДанныеБДР.Договор";
	
	ДанныеПроекта.Вставить("ТаблицаФинПланыДР", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по предусловиям задач проекта.
	// Теперь отбираем задачи.
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредусловияПроектныхЗадач.ПроектнаяЗадача КАК Задача,
		|	ПредусловияПроектныхЗадач.ЗадачаПредшественник КАК Предшественник,
		|	ПредусловияПроектныхЗадач.ТипСвязи КАК ТипСвязи,
		|	ПредусловияПроектныхЗадач.Задержка КАК Задержка
		|ИЗ
		|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(&Дата, Версия = &Версия) КАК ПредусловияПроектныхЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК СвойстваПредшественника
		|		ПО ПредусловияПроектныхЗадач.ЗадачаПредшественник = СвойстваПредшественника.ПроектнаяЗадача
		|			И (НЕ СвойстваПредшественника.ЗадачаОтменена)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ПредусловияПроектныхЗадач.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	ПредусловияПроектныхЗадач.СвязьСуществует
		|	И НЕ ПредусловияПроектныхЗадач.СвязьМеждуПроектами";
	
	ДанныеПроекта.Вставить("ТаблицаПредУсловийЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по материальным ресурсам задач проекта.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗатратыРесурсовПлан.ПроектнаяЗадача КАК Задача,
		|	ЗатратыРесурсовПлан.Номенклатура КАК Ресурс,
		|	ЗатратыРесурсовПлан.ЕдиницаИзмерения КАК ЕдиницаНормирования,
		|	ЗатратыРесурсовПлан.Контрагент КАК Контрагент,
		|	ЗатратыРесурсовПлан.СпособПривязки КАК СпособПривязкиПотребности,
		|	ЗатратыРесурсовПлан.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
		|	ЗатратыРесурсовПлан.Валюта КАК Валюта,
		|	ЗатратыРесурсовПлан.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗатратыРесурсовПлан.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗатратыРесурсовПлан.СуммаВалютная / ЗатратыРесурсовПлан.Количество
		|	КОНЕЦ КАК СтоимостьЕд,
		|	ЗатратыРесурсовПлан.СуммаВалютная КАК Стоимость,
		|	ЗатратыРесурсовПлан.Договор КАК Договор,
		|	ЗатратыРесурсовПлан.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ЗатратыРесурсовПлан.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ЗатратыРесурсовПлан.СпособПривязкиРасхода КАК СпособПривязки,
		|	ЗатратыРесурсовПлан.ДатаПривязки КАК ДатаПривязки,
		|	ЗатратыРесурсовПлан.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
		|ИЗ
		|	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(&Дата, Версия = &Версия) КАК ЗатратыРесурсовПлан
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ЗатратыРесурсовПлан.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	(ЗатратыРесурсовПлан.Количество <> 0
		|			ИЛИ ЗатратыРесурсовПлан.Сумма <> 0
		|			ИЛИ ЗатратыРесурсовПлан.СуммаВалютная <> 0)";
	
	ДанныеПроекта.Вставить("ТаблицаМатРесурсовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по субпродуктам задач проекта.
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗатратыРесурсовПлан.ПроектнаяЗадача КАК Задача,
		|	ЗатратыРесурсовПлан.Номенклатура КАК Ресурс,
		|	ЗатратыРесурсовПлан.ЕдиницаИзмерения КАК ЕдиницаНормирования,
		|	ЗатратыРесурсовПлан.Контрагент КАК Контрагент,
		|	ЗатратыРесурсовПлан.СпособПривязки КАК СпособПривязкиВыпуска,
		|	ЗатратыРесурсовПлан.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
		|	ЗатратыРесурсовПлан.Валюта КАК Валюта,
		|	ЗатратыРесурсовПлан.Скорость КАК Скорость,
		|	ЗатратыРесурсовПлан.Коэффициент КАК Коэффициент,
		|	ЗатратыРесурсовПлан.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗатратыРесурсовПлан.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗатратыРесурсовПлан.СуммаВалютная / ЗатратыРесурсовПлан.Количество
		|	КОНЕЦ КАК СтоимостьЕд,
		|	ЗатратыРесурсовПлан.СуммаВалютная КАК Стоимость,
		|	ЗатратыРесурсовПлан.Договор КАК Договор,
		|	ЗатратыРесурсовПлан.СтатьяДоходов КАК СтатьяДоходов,
		|	ЗатратыРесурсовПлан.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ЗатратыРесурсовПлан.СпособПривязкиДоходов КАК СпособПривязки,
		|	ЗатратыРесурсовПлан.ДатаПривязки КАК ДатаПривязки,
		|	ЗатратыРесурсовПлан.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	ЗатратыРесурсовПлан.НомерСтроки КАК НомерСтроки,
		|	СтруктурыПД.СкоростьВыполнения КАК СкоростьВыполнения,
		|	ВЫБОР
		|		КОГДА ТИП(Справочник.упоПроектнаяПродукция) = ТИПЗНАЧЕНИЯ(ЗатратыРесурсовПлан.Номенклатура)
		|			ТОГДА ЗатратыРесурсовПлан.Номенклатура.Трудоемкость
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Трудоемкость,
		|	ВЫБОР
		|		КОГДА ТИП(Справочник.упоПроектнаяПродукция) = ТИПЗНАЧЕНИЯ(ЗатратыРесурсовПлан.Номенклатура)
		|			ТОГДА ЗатратыРесурсовПлан.Номенклатура.Нормирование
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Нормирование,
		|	ВЫБОР
		|		КОГДА ТИП(Справочник.упоПроектнаяПродукция) = ТИПЗНАЧЕНИЯ(ЗатратыРесурсовПлан.Номенклатура)
		|			ТОГДА ЗатратыРесурсовПлан.Номенклатура.КоэффициентСложности
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоэффициентСложности
		|ИЗ
		|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(&Дата, Версия = &Версия) КАК ЗатратыРесурсовПлан
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ЗатратыРесурсовПлан.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПроектнойПродукции.СрезПоследних(
		|				,
		|				Версия = &Версия) КАК СтруктурыПД
		|		ПО ЗатратыРесурсовПлан.Номенклатура = СтруктурыПД.ПроектнаяПродукция
		|ГДЕ
		|	(ЗатратыРесурсовПлан.Количество <> 0
		|			ИЛИ ЗатратыРесурсовПлан.Сумма <> 0
		|			ИЛИ ЗатратыРесурсовПлан.СуммаВалютная <> 0)";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗатратыРесурсовПлан.ПроектнаяЗадача КАК Задача,
		|	ЗатратыРесурсовПлан.Номенклатура КАК Ресурс,
		|	ЗатратыРесурсовПлан.ЕдиницаИзмерения КАК ЕдиницаНормирования,
		|	ЗатратыРесурсовПлан.Контрагент КАК Контрагент,
		|	ЗатратыРесурсовПлан.СпособПривязки КАК СпособПривязкиВыпуска,
		|	ЗатратыРесурсовПлан.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
		|	ЗатратыРесурсовПлан.Валюта КАК Валюта,
		|	ЗатратыРесурсовПлан.Скорость КАК Скорость,
		|	ЗатратыРесурсовПлан.Коэффициент КАК Коэффициент,
		|	ЗатратыРесурсовПлан.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗатратыРесурсовПлан.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗатратыРесурсовПлан.СуммаВалютная / ЗатратыРесурсовПлан.Количество
		|	КОНЕЦ КАК СтоимостьЕд,
		|	ЗатратыРесурсовПлан.СуммаВалютная КАК Стоимость,
		|	ЗатратыРесурсовПлан.Договор КАК Договор,
		|	ЗатратыРесурсовПлан.СтатьяДоходов КАК СтатьяДоходов,
		|	ЗатратыРесурсовПлан.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ЗатратыРесурсовПлан.СпособПривязкиДоходов КАК СпособПривязки,
		|	ЗатратыРесурсовПлан.ДатаПривязки КАК ДатаПривязки,
		|	ЗатратыРесурсовПлан.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	ЗатратыРесурсовПлан.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(&Дата, Версия = &Версия) КАК ЗатратыРесурсовПлан
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ЗатратыРесурсовПлан.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	(ЗатратыРесурсовПлан.Количество <> 0
		|			ИЛИ ЗатратыРесурсовПлан.Сумма <> 0
		|			ИЛИ ЗатратыРесурсовПлан.СуммаВалютная <> 0)";
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаСубпродуктовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по дополнительным затратам проектных задач.		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача КАК Задача,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ВидОперации КАК ВидОперации,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.КонтрагентДоходовРасходов КАК КонтрагентДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДоговорДоходовРасходов КАК ДоговорДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.СпособПривязкиДоходовРасходов КАК СпособПривязкиДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределенияДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДатаПривязкиДоходовРасходов КАК ДатаПривязкиДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.Комментарий КАК Комментарий,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма КАК Стоимость
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДополнительныхЗатрат.СрезПоследних(, Версия = &Версия) КАК упоДанныеПлановДополнительныхЗатратСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма <> 0";
	
	ДанныеПроекта.Вставить("ТаблицаДопЗатратЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по распределению допзатрат проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПроектнаяЗадача КАК Задача,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Роль КАК Роль,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязки,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	СУММА(упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Сумма) КАК Сумма,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДополнительныхЗатратПодразделения.СрезПоследних(, ) КАК упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПроектнаяЗадача,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ДатаНачисления,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Подразделение,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Роль,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СобствСилы_Субподряд,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.КонтрагентПодрядчик,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СпособПривязки,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПрофильРаспределения,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокиВладельца,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам";
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДопЗатратЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по трудовым ресурсам.
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ресурсы.ПроектнаяЗадача КАК Задача,
		|	Ресурсы.Ресурс КАК Ресурс,
		|	Ресурсы.УровеньПланирования КАК УровеньПланирования,
		|	СУММА(Ресурсы.Количество) КАК Количество,
		|	Ресурсы.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|	СУММА(Ресурсы.ОбщСтоимость) КАК Стоимость,
		|	Ресурсы.ПрофильРаспределения КАК ПрофильРаспределения,
		|	Ресурсы.Подразделение КАК Подразделение,
		|	Ресурсы.Основной КАК Основной,
		|	Ресурсы.СпособПривязки КАК СпособПривязки,
		|	Ресурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияПоПериодам,
		|	СУММА(Ресурсы.ОбщВнешняяСтоимость) КАК ВнешняяСтоимость
		|ИЗ
		|	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, Версия = &Версия) КАК Ресурсы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО Ресурсы.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	(Ресурсы.Количество <> 0
		|			ИЛИ Ресурсы.ОбщСтоимость <> 0
		|			ИЛИ Ресурсы.ОбщВнешняяСтоимость <> 0)
		|	И Ресурсы.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты)
		|
		|СГРУППИРОВАТЬ ПО
		|	Ресурсы.ПрофильРаспределения,
		|	Ресурсы.УровеньПланирования,
		|	Ресурсы.ПроектнаяЗадача,
		|	Ресурсы.ЕдиницаНормирования,
		|	Ресурсы.Ресурс,
		|	Ресурсы.Подразделение,
		|	Ресурсы.Основной,
		|	Ресурсы.СпособПривязки,
		|	Ресурсы.ИндексСтрокРаспределения";
		
	ДанныеПроекта.Вставить("ТаблицаТрудовыхРесурсовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по распределению доходов проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДРПодразделения.ПроектнаяЗадача КАК Задача,
		|	ДанныеДРПодразделения.Подразделение КАК Подразделение,
		|	ДанныеДРПодразделения.Роль КАК Роль,
		|	ДанныеДРПодразделения.ДатаНачисления КАК ДатаПривязки,
		|	ДанныеДРПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ДанныеДРПодразделения.КонтрагентПодрядчик КАК Контрагент,
		|	ДанныеДРПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	СУММА(ДанныеДРПодразделения.Сумма) КАК Сумма,
		|	ДанныеДРПодразделения.СпособПривязки КАК СпособПривязки,
		|	ДанныеДРПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДанныеДРПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ДанныеДРПодразделения.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			Версия = &Версия
		|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)) КАК ДанныеДРПодразделения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеДРПодразделения.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	ДанныеДРПодразделения.ИсточникПлана В(&ИсточникПланаБДР)
		|	И (ДанныеДРПодразделения.Сумма <> 0
		|			ИЛИ ДанныеДРПодразделения.СуммаВалютная <> 0
		|			ИЛИ ДанныеДРПодразделения.Количество <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДРПодразделения.Роль,
		|	ДанныеДРПодразделения.ПроектнаяЗадача,
		|	ДанныеДРПодразделения.Подразделение,
		|	ДанныеДРПодразделения.КонтрагентПодрядчик,
		|	ДанныеДРПодразделения.СпособПривязки,
		|	ДанныеДРПодразделения.ДатаНачисления,
		|	ДанныеДРПодразделения.ПрофильРаспределения,
		|	ДанныеДРПодразделения.СобствСилы_Субподряд,
		|	ДанныеДРПодразделения.ИндексСтрокРаспределенияПоПериодам,
		|	ДанныеДРПодразделения.ИндексСтрокиВладельца,
		|	ДанныеДРПодразделения.Заказ_ДоговорПодрядчика";
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по распределению расходов проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДРПодразделения.ПроектнаяЗадача КАК Задача,
		|	ДанныеДРПодразделения.Подразделение КАК Подразделение,
		|	ДанныеДРПодразделения.Роль КАК Роль,
		|	ДанныеДРПодразделения.ДатаНачисления КАК ДатаПривязки,
		|	ДанныеДРПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ДанныеДРПодразделения.КонтрагентПодрядчик КАК Контрагент,
		|	ДанныеДРПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	СУММА(ДанныеДРПодразделения.Сумма) КАК Сумма,
		|	ДанныеДРПодразделения.СпособПривязки КАК СпособПривязки,
		|	ДанныеДРПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДанныеДРПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ДанныеДРПодразделения.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			Версия = &Версия
		|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)) КАК ДанныеДРПодразделения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеДРПодразделения.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	ДанныеДРПодразделения.ИсточникПлана В(&ИсточникПланаБДР)
		|	И (ДанныеДРПодразделения.Количество <> 0
		|			ИЛИ ДанныеДРПодразделения.СуммаВалютная <> 0
		|			ИЛИ ДанныеДРПодразделения.Сумма <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДРПодразделения.ДатаНачисления,
		|	ДанныеДРПодразделения.КонтрагентПодрядчик,
		|	ДанныеДРПодразделения.ПроектнаяЗадача,
		|	ДанныеДРПодразделения.Подразделение,
		|	ДанныеДРПодразделения.Роль,
		|	ДанныеДРПодразделения.СобствСилы_Субподряд,
		|	ДанныеДРПодразделения.СпособПривязки,
		|	ДанныеДРПодразделения.ПрофильРаспределения,
		|	ДанныеДРПодразделения.ИндексСтрокРаспределенияПоПериодам,
		|	ДанныеДРПодразделения.ИндексСтрокиВладельца,
		|	ДанныеДРПодразделения.Заказ_ДоговорПодрядчика";
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по распределению объемов проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПлановОбъемовПодразделения.ПроектнаяЗадача КАК Задача,
		|	ДанныеПлановОбъемовПодразделения.Подразделение КАК Подразделение,
		|	ДанныеПлановОбъемовПодразделения.Роль КАК Роль,
		|	ДанныеПлановОбъемовПодразделения.СпособПривязки КАК СпособПривязки,
		|	ДанныеПлановОбъемовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДанныеПлановОбъемовПодразделения.ДатаНачисления КАК ДатаПривязки,
		|	ДанныеПлановОбъемовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ДанныеПлановОбъемовПодразделения.КонтрагентПодрядчик КАК Контрагент,
		|	ДанныеПлановОбъемовПодразделения.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	СУММА(ДанныеПлановОбъемовПодразделения.Сумма) КАК Сумма,
		|	СУММА(ДанныеПлановОбъемовПодразделения.Количество) КАК Количество,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
		|ИЗ
		|	РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
		|			,
		|			Версия = &Версия
		|				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)) КАК ДанныеПлановОбъемовПодразделения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеПлановОбъемовПодразделения.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	(ДанныеПлановОбъемовПодразделения.СуммаВалютная <> 0
		|			ИЛИ ДанныеПлановОбъемовПодразделения.Сумма <> 0
		|			ИЛИ ДанныеПлановОбъемовПодразделения.Количество <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПлановОбъемовПодразделения.ПроектнаяЗадача,
		|	ДанныеПлановОбъемовПодразделения.ДатаНачисления,
		|	ДанныеПлановОбъемовПодразделения.Подразделение,
		|	ДанныеПлановОбъемовПодразделения.Роль,
		|	ДанныеПлановОбъемовПодразделения.СобствСилы_Субподряд,
		|	ДанныеПлановОбъемовПодразделения.КонтрагентПодрядчик,
		|	ДанныеПлановОбъемовПодразделения.Заказ_ДоговорПодрядчика,
		|	ДанныеПлановОбъемовПодразделения.СпособПривязки,
		|	ДанныеПлановОбъемовПодразделения.ПрофильРаспределения,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокиВладельца,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам";
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеОбъемовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по распределению потребностей проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПлановОбъемовПодразделения.ПроектнаяЗадача КАК Задача,
		|	ДанныеПлановОбъемовПодразделения.Подразделение КАК Подразделение,
		|	ДанныеПлановОбъемовПодразделения.Роль КАК Роль,
		|	ДанныеПлановОбъемовПодразделения.СпособПривязки КАК СпособПривязки,
		|	ДанныеПлановОбъемовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДанныеПлановОбъемовПодразделения.ДатаНачисления КАК ДатаПривязки,
		|	ДанныеПлановОбъемовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	СУММА(ДанныеПлановОбъемовПодразделения.Сумма) КАК Сумма,
		|	СУММА(ДанныеПлановОбъемовПодразделения.Количество) КАК Количество,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца
		|ИЗ
		|	РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
		|			,
		|			Версия = &Версия
		|				И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)) КАК ДанныеПлановОбъемовПодразделения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеПлановОбъемовПодразделения.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	(ДанныеПлановОбъемовПодразделения.СуммаВалютная <> 0
		|			ИЛИ ДанныеПлановОбъемовПодразделения.Сумма <> 0
		|			ИЛИ ДанныеПлановОбъемовПодразделения.Количество <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПлановОбъемовПодразделения.ПроектнаяЗадача,
		|	ДанныеПлановОбъемовПодразделения.ДатаНачисления,
		|	ДанныеПлановОбъемовПодразделения.Подразделение,
		|	ДанныеПлановОбъемовПодразделения.Роль,
		|	ДанныеПлановОбъемовПодразделения.СобствСилы_Субподряд,
		|	ДанныеПлановОбъемовПодразделения.СпособПривязки,
		|	ДанныеПлановОбъемовПодразделения.ПрофильРаспределения,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокиВладельца,
		|	ДанныеПлановОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам";
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеПотребностейЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по распределению доходов по периодам проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРаспределенияДоходовПоПериодам.ПроектнаяЗадача КАК Задача,
		|	ДанныеРаспределенияДоходовПоПериодам.ПериодРаспределения КАК Период,
		|	ДанныеРаспределенияДоходовПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	ДанныеРаспределенияДоходовПоПериодам.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
		|	СУММА(ДанныеРаспределенияДоходовПоПериодам.Сумма) КАК Сумма,
		|	СУММА(ДанныеРаспределенияДоходовПоПериодам.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.упоДанныеРаспределенияДоходовПоПериодам.СрезПоследних(, Версия = &Версия) КАК ДанныеРаспределенияДоходовПоПериодам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеРаспределенияДоходовПоПериодам.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	(ДанныеРаспределенияДоходовПоПериодам.Сумма <> 0
		|			ИЛИ ДанныеРаспределенияДоходовПоПериодам.Количество <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРаспределенияДоходовПоПериодам.ПериодРаспределения,
		|	ДанныеРаспределенияДоходовПоПериодам.ПроектнаяЗадача,
		|	ДанныеРаспределенияДоходовПоПериодам.ИндексСтрокиРаспределениеПоРолям,
		|	ДанныеРаспределенияДоходовПоПериодам.ИндексСтрокиРаспределенияДоходов";
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовПоПериодамЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по распределению расходов по периодам проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРаспределенияРасходов.ПроектнаяЗадача КАК Задача,
		|	ДанныеРаспределенияРасходов.ПериодРаспределения КАК Период,
		|	ДанныеРаспределенияРасходов.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	ДанныеРаспределенияРасходов.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
		|	ДанныеРаспределенияРасходов.ИсточникПлана КАК ИсточникПлана,
		|	СУММА(ДанныеРаспределенияРасходов.Сумма) КАК Сумма,
		|	СУММА(ДанныеРаспределенияРасходов.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.упоДанныеРаспределенияРасходовПоПериодам.СрезПоследних(, Версия = &Версия) КАК ДанныеРаспределенияРасходов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеРаспределенияРасходов.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	ДанныеРаспределенияРасходов.ИсточникПлана В(&ИсточникПланаБДР)
		|	И (ДанныеРаспределенияРасходов.Сумма <> 0
		|			ИЛИ ДанныеРаспределенияРасходов.Количество <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРаспределенияРасходов.ПериодРаспределения,
		|	ДанныеРаспределенияРасходов.ПроектнаяЗадача,
		|	ДанныеРаспределенияРасходов.ИндексСтрокиРаспределениеПоРолям,
		|	ДанныеРаспределенияРасходов.ИндексСтрокиРаспределенияРасходов,
		|	ДанныеРаспределенияРасходов.ИсточникПлана";
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовПоПериодамЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные трудовые ресурсы по периодам проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРаспределенияТрудовыхРесурсовПоПериодам.ПроектнаяЗадача КАК Задача,
		|	ДанныеРаспределенияТрудовыхРесурсовПоПериодам.ПериодРаспределения КАК Период,
		|	ДанныеРаспределенияТрудовыхРесурсовПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	СУММА(ДанныеРаспределенияТрудовыхРесурсовПоПериодам.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.СрезПоследних(, Версия = &Версия) КАК ДанныеРаспределенияТрудовыхРесурсовПоПериодам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ДанныеРаспределенияТрудовыхРесурсовПоПериодам.ПроектнаяЗадача = втЗадачи.ПроектнаяЗадача
		|ГДЕ
		|	ДанныеРаспределенияТрудовыхРесурсовПоПериодам.Количество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРаспределенияТрудовыхРесурсовПоПериодам.ПроектнаяЗадача,
		|	ДанныеРаспределенияТрудовыхРесурсовПоПериодам.ПериодРаспределения,
		|	ДанныеРаспределенияТрудовыхРесурсовПоПериодам.ИндексСтрокиРаспределениеПоРолям";
	
	ДанныеПроекта.Вставить("ТаблицаТрудовыеРесурсыПоПериодамЗадач", Запрос.Выполнить().Выгрузить());
	
	ЗаполнитьТабличнуюЧастьПоДаннымПроектнойПродукции(ДанныеПроекта);
	
	// Возвращаем полученные данные.
	Возврат ДанныеПроекта;
	
КонецФункции

// Функция рассчитывает количество элементов для записи.
// Используется для индикатора о ходе выполнения процесса.
// 
// Параметры:
//  ПараметрыЭкспорта - Структура, содержит настройки пользователя:
//   * Шаблон                     - СправочникСсылка.упоШаблоныПроектов.
//   * Проект                     - СправочникСсылка.Проекты.
//   * Этап                       - ДокументСсылка.упоПроектнаяЗадача.
//   * ОчиститьПроект             - Булево.
//   * СоздатьКорневуюЗадачу      - Булево.
//   * ДатаНачала                 - Дата.
//   * КоэффициентМасштабирования - Число.
//  ДанныеПроекта     - Структура, содержит данные реального проекта:
//   * ТаблицаЗадач               - ТаблицаЗначений.
//   * ТаблицаПредУсловийЗадач    - ТаблицаЗначений.
//   * ТаблицаМатРесурсовЗадач    - ТаблицаЗначений.
// 
// Возвращаемое значение:
//  Число - количество элементов.
// 
Функция ПолучитьКоличествоЭлементов(ПараметрыЭкспорта, ДанныеПроекта)
	
	КолЭлементов = 0;
	
	// Массив для хранения задач.
	МассивЗадач = Новый Массив;
	
	ОтборПоЗадаче   = Новый Структура("Задача");
	ОтборПоРодителю = Новый Структура("Родитель");
	
	КорневаяЗадача = ПараметрыЭкспорта.Этап;
	
	// Определим корневые задачи.
	Если КорневаяЗадача = Документы.упоПроектнаяЗадача.ПустаяСсылка() Или ПараметрыЭкспорта.СоздатьКорневуюЗадачу = Ложь Тогда
		ОтборПоРодителю.Вставить("Родитель", КорневаяЗадача);
		
		МассивСтрок = ДанныеПроекта.ТаблицаЗадач.НайтиСтроки(ОтборПоРодителю);
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			МассивЗадач.Добавить(ТекСтрока);
		КонецЦикла;
	Иначе
		ТекСтрока = ДанныеПроекта.ТаблицаЗадач.Найти(КорневаяЗадача, "Задача");
		Если Не ТекСтрока = Неопределено Тогда
			МассивЗадач.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЕсли;
	
	// Перебираем массив задач и внутри для каждой текущей задачи ищем ее потомков.
	// Далее каждого потомка текущей задачи добавляем в тот же массив задач для последующего обхода.
	Для Каждого ДанныеЗадачи Из МассивЗадач Цикл
		// Добавим элемент.
		КолЭлементов = КолЭлементов + 1;
		
		// Отбор по текущей задаче.
		ОтборПоЗадаче.Вставить("Задача", ДанныеЗадачи.Задача);
				
		// Отбор по родителю текущей задачи.
		ОтборПоРодителю.Вставить("Родитель", ДанныеЗадачи.Задача);
		
		МассивСтрок = ДанныеПроекта.ТаблицаЗадач.НайтиСтроки(ОтборПоРодителю);
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			МассивЗадач.Добавить(ТекСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Возврат КолЭлементов;
	
КонецФункции

// Модуль записи шаблона проектной задачи по данным реальной проекной задачи.
// 
// Параметры:
//  ШаблонПроекта       - СправочникСсылка.упоШаблоныПроектов.
//  ДанныеПроекта       - Структура, содержит данные проекта:
//   * ТаблицаЗадач               - ТаблицаЗначений.
//   * ТаблицаПредУсловийЗадач    - ТаблицаЗначений.
//   * ТаблицаМатРесурсовЗадач    - ТаблицаЗначений.
//  ДанныеЗадачи        - СтрокаТаблицыЗначений - содержит данные конкретной задачи проекта.
//  СоответствиеШаблона - Соответствие - содержит соответствия задач и созданных по ним шаблонов.
//  Индикатор           - Форма - индикатор выполнения процесса (прогресс бар).
//  Журнал 				- РегистрСведенийНаборЗаписей - для фиксации связи между шаблоном и проектом.
// 
// Возвращаемое значение:
//  ДокументСсылка.упоПроектнаяЗадача - ссылка на созданную проектную задачу.
// 
Функция ЗаписатьДанныеЗадачиВШаблон(ШаблонПроекта, ДанныеПроекта, ДанныеЗадачи, СоответствиеШаблона,
	Индикатор, Журнал = Неопределено, СоответствиеКонтрагентов = Неопределено)
		
	ШаблонЗадачи = Справочники.упоШаблоныПроектныхЗадач.СоздатьЭлемент();
	
	// Отбор по заданной задаче.
	Отбор = Новый Структура("Задача", ДанныеЗадачи.Задача);
	
	// Если есть родительская задача, то получаем к ней соответствующий шаблон.
	Если Не ДанныеЗадачи.Родитель = Документы.упоПроектнаяЗадача.ПустаяСсылка() Тогда
		ШаблонЗадачиРодителя = СоответствиеШаблона.Получить(ДанныеЗадачи.Родитель);
	Иначе
		ШаблонЗадачиРодителя = Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ШаблонЗадачи, ДанныеЗадачи);	
	
	ШаблонЗадачи.Наименование   		 = ДанныеЗадачи.НазваниеЗадачи;
	ШаблонЗадачи.НазваниеПроектнойЗадачи = ДанныеЗадачи.НазваниеЗадачи;
	ШаблонЗадачи.ПолноеНаименование      = ДанныеЗадачи.НазваниеЗадачи;
	ШаблонЗадачи.Владелец       		 = ШаблонПроекта;
	ШаблонЗадачи.Родитель       		 = ШаблонЗадачиРодителя;
	
	// Получим сроки задачи.
	СтрокиСроковЗадачи = ДанныеПроекта.ТаблицаСроков.НайтиСтроки(Отбор);
	Для каждого СрокиЗадачи Из СтрокиСроковЗадачи Цикл
		ШаблонЗадачи.ДатаНачалаПлан			 = СрокиЗадачи.ДатаНачалаПлан;
		ШаблонЗадачи.ДатаЗавершенияПлан		 = СрокиЗадачи.ДатаЗавершенияПлан;
	КонецЦикла;
		
	// Получим состав материальных ресуров заданной задачи.
	МатРесурсыЗадачи = ДанныеПроекта.ТаблицаМатРесурсовЗадач.НайтиСтроки(Отбор);
	Для каждого МатРесурс Из МатРесурсыЗадачи Цикл
		НоваяСтрока = ШаблонЗадачи.МатериальныеРесурсы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, МатРесурс);
		НоваяСтрока.Стоимость           = МатРесурс.СтоимостьЕд;
		НоваяСтрока.ОбщСтоимость        = МатРесурс.Стоимость;
	КонецЦикла;
	
	// Получим состав субпродуктов заданной задачи.
	ЭтоЗадачаПроектнойПродукции = ДанныеЗадачи.ТипСубпродукта = 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
	
	СубпродуктыЗадачи = ДанныеПроекта.ТаблицаСубпродуктовЗадач.НайтиСтроки(Отбор);

	Если ЭтоЗадачаПроектнойПродукции Тогда		
		СоответствиеШаблоновПП = ПолучитьШаблоныППДляСубпродуктов(СубпродуктыЗадачи, ДанныеЗадачи.Задача, Истина);
	КонецЕсли;

	Для Каждого Субпродукт Из СубпродуктыЗадачи Цикл
				
		Если УдаленаСтрокаПроектнойПродукции(ЭтоЗадачаПроектнойПродукции, СоответствиеШаблоновПП, Субпродукт, 
			ДанныеПроекта.ТаблицаРаспределениеОбъемовЗадач) Тогда			
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ШаблонЗадачи.Субпродукты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Субпродукт);
		НоваяСтрока.Стоимость           = Субпродукт.СтоимостьЕд;
		НоваяСтрока.ОбщСтоимость        = Субпродукт.Стоимость;
		
		Если ЭтоЗадачаПроектнойПродукции Тогда			
			НоваяСтрока.Ресурс 			= СоответствиеШаблоновПП.Получить(Субпродукт.Ресурс);					
		КонецЕсли;				
	КонецЦикла;
	
	// Получим трудовые ресурсы и параметры для модели пакета работ.	
	
	ШаблонЗадачи.ДлительностьМоделиПакетаРабот = ДанныеЗадачи.ДлительностьМоделиПакетаРабот;
	ШаблонЗадачи.ЕдиницаНормированияДлительности = ДанныеЗадачи.ЕдиницаНормированияДлительности;
	ШаблонЗадачи.НормаСтоимостиТрудовыхРесурсов = ДанныеЗадачи.НормаСтоимостиТрудовыхРесурсов;
	ШаблонЗадачи.ДлительностьБезУчетаКалендаряПроекта = ДанныеЗадачи.ДлительностьБезУчетаКалендаряПроекта;
	
	ТрудовыеРесурсыЗадачи = ДанныеПроекта.ТаблицаТрудовыхРесурсовЗадач.НайтиСтроки(Отбор);
	Для каждого СтрокаРесурс Из ТрудовыеРесурсыЗадачи Цикл
		НоваяСтрока 					= ШаблонЗадачи.ТрудовыеРесурсы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРесурс);
		НоваяСтрока.ОбщСтоимость 		= СтрокаРесурс.Стоимость;
		НоваяСтрока.Стоимость 			= ?(СтрокаРесурс.Количество > 0, СтрокаРесурс.Стоимость / СтрокаРесурс.Количество, 0);
		НоваяСтрока.ОбщВнешняяСтоимость = СтрокаРесурс.ВнешняяСтоимость;
		НоваяСтрока.ВнешняяСтоимость 	= ?(СтрокаРесурс.Количество > 0, СтрокаРесурс.ВнешняяСтоимость / СтрокаРесурс.Количество, 0);
	КонецЦикла; 
	
	// Получим данные финансовых планов проектной задачи.
	ДанныеБДДС = ДанныеПроекта.ТаблицаФинПланыДДС.НайтиСтроки(Отбор);
	
	Для каждого ФинСтрока Из ДанныеБДДС Цикл
						
		ФинСтрокаШаблона = Неопределено;
		Если ФинСтрока.НаправлениеДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Выплата Тогда
			
			ФинСтрокаШаблона = ШаблонЗадачи.ПланВыплат.Добавить();
			
		ИначеЕсли ФинСтрока.НаправлениеДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление Тогда
			
			ФинСтрокаШаблона = ШаблонЗадачи.ПланПоступлений.Добавить();
			
		КонецЕсли;
		
		Если ФинСтрокаШаблона = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ФинСтрокаШаблона.Статья 	= ФинСтрока.СтатьяДДС;
		ФинСтрокаШаблона.ВидПлатежа 	= ФинСтрока.ВидПлатежа;
		ФинСтрокаШаблона.Валюта 	= ФинСтрока.Валюта;
		ФинСтрокаШаблона.Сумма 		= ФинСтрока.Сумма;		
		ФинСтрокаШаблона.Задержка 	= ФинСтрока.Задержка;
		ФинСтрокаШаблона.ПрофильРаспределения = ФинСтрока.ПрофильРаспределения;
		
		Если ФинСтрока.СпособПривязки = Перечисления.упоСпособПривязкиДДС.НаДату Тогда
			ФинСтрокаШаблона.СпособПривязки = Перечисления.упоСпособПривязкиДДС.НачалоЗадачи;
		Иначе
			ФинСтрокаШаблона.СпособПривязки = ФинСтрока.СпособПривязки;
		КонецЕсли;
		
		СтрокаСоответствие = СоответствиеКонтрагентов.Найти(ФинСтрока.Контрагент, "Контрагент");
		Если СтрокаСоответствие <> Неопределено Тогда
			ФинСтрокаШаблона.Контрагент = СтрокаСоответствие.ШаблонКонтрагента;
		КонецЕсли;	
		
		НоваяСтрока =  ШаблонЗадачи.ДвиженияДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ФинСтрока);
		
	КонецЦикла; 
	
	ПрофильПоУмолчанию = Неопределено;
	ВыборкаПрофилей = Справочники.упоПрофилиРаспределенияДоходовИРасходов.Выбрать();
	Если ВыборкаПрофилей.Следующий() Тогда
		ПрофильПоУмолчанию = ВыборкаПрофилей.Ссылка;
	КонецЕсли;
	
	ДанныеБДР = ДанныеПроекта.ТаблицаФинПланыДР.НайтиСтроки(Отбор);
	
	Для каждого ФинСтрока Из ДанныеБДР Цикл
		
		ФинСтрокаШаблона = Неопределено;
		Если ФинСтрока.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
			ФинСтрокаШаблона = ШаблонЗадачи.ПланДоходов.Добавить();
		ИначеЕсли ФинСтрока.ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход Тогда
			ФинСтрокаШаблона = ШаблонЗадачи.ПланРасходов.Добавить();
		КонецЕсли;
		
		Если ФинСтрокаШаблона = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(ФинСтрокаШаблона, ФинСтрока);
		
		ФинСтрокаШаблона.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения;
		Если Не ЗначениеЗаполнено(ФинСтрока.ПрофильРаспределения) Тогда
			ФинСтрокаШаблона.ПрофильРаспределения = ПрофильПоУмолчанию;
		Иначе
			ФинСтрокаШаблона.ПрофильРаспределения = ФинСтрока.ПрофильРаспределения;
		КонецЕсли;
		
		СтрокаСоответствие = СоответствиеКонтрагентов.Найти(ФинСтрока.Контрагент, "Контрагент");
		Если СтрокаСоответствие <> Неопределено Тогда
			ФинСтрокаШаблона.Контрагент = СтрокаСоответствие.ШаблонКонтрагента;
		КонецЕсли;
		
	КонецЦикла; 
	
	// Получим дополнительные затраты проектной задачи.
	
	ДопЗатраты = ДанныеПроекта.ТаблицаДопЗатратЗадач.НайтиСтроки(Отбор);
	Для каждого ДопЗатрата Из ДопЗатраты Цикл				
		НоваяСтрока = ШаблонЗадачи.ДополнительныеЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДопЗатрата, , "КонтрагентДоходовРасходов");
				
		СтрокаСоответствие = СоответствиеКонтрагентов.Найти(ДопЗатрата.КонтрагентДоходовРасходов, "Контрагент");
		Если СтрокаСоответствие <> Неопределено Тогда
			НоваяСтрока.КонтрагентДоходовРасходов = СтрокаСоответствие.ШаблонКонтрагента;	
		КонецЕсли;		
	КонецЦикла; 
		
	РаспределениеДопЗатрат = ДанныеПроекта.ТаблицаРаспределениеДопЗатратЗадач.НайтиСтроки(Отбор);
	Для каждого ДопЗатрата Из РаспределениеДопЗатрат Цикл
				
		НоваяСтрока 			 = ШаблонЗадачи.РаспределениеДополнительныхЗатрат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДопЗатрата, ,"КонтрагентПодрядчик");
		
		СтрокаСоответствие = СоответствиеКонтрагентов.Найти(ДопЗатрата.КонтрагентПодрядчик, "Контрагент");
		Если СтрокаСоответствие <> Неопределено Тогда
			НоваяСтрока.КонтрагентПодрядчик = СтрокаСоответствие.ШаблонКонтрагента;	
		КонецЕсли;
		
	КонецЦикла; 

		
	// Получить данные распределения доходов.
	МассивСтрок = ДанныеПроекта.ТаблицаРаспределениеДоходовЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
						
		НоваяСтрока = ШаблонЗадачи.РаспределениеДоходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		СтрокаСоответствие = СоответствиеКонтрагентов.Найти(Строка.Контрагент, "Контрагент");
		Если СтрокаСоответствие <> Неопределено Тогда
			НоваяСтрока.КонтрагентПодрядчик = СтрокаСоответствие.ШаблонКонтрагента;
		КонецЕсли;	
		
	КонецЦикла;
	
	// Получить данные распределения расходов.
	МассивСтрок = ДанныеПроекта.ТаблицаРаспределениеРасходовЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
		
		НоваяСтрока = ШаблонЗадачи.РаспределениеРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	// Получить данные распределения объемов
	МассивСтрок = ДанныеПроекта.ТаблицаРаспределениеОбъемовЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
				
		НоваяСтрока = ШаблонЗадачи.РаспределениеОбъемов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		СтрокаСоответствие = СоответствиеКонтрагентов.Найти(Строка.Контрагент, "Контрагент");
		Если СтрокаСоответствие <> Неопределено Тогда
			НоваяСтрока.КонтрагентПодрядчик = СтрокаСоответствие.ШаблонКонтрагента;
		КонецЕсли;	
		
	КонецЦикла;
	
	
	// Получить данные распределения потребностей.
	МассивСтрок = ДанныеПроекта.ТаблицаРаспределениеПотребностейЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
		
		НоваяСтрока = ШаблонЗадачи.РаспределениеПотребностей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	// Получить данные распределение доходов по периодам.
	МассивСтрок = ДанныеПроекта.ТаблицаРаспределениеДоходовПоПериодамЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
		
		НоваяСтрока = ШаблонЗадачи.РаспределениеДоходовПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	// Получить данные распределение расходов по периодам.
	МассивСтрок = ДанныеПроекта.ТаблицаРаспределениеРасходовПоПериодамЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
		
		НоваяСтрока = ШаблонЗадачи.РаспределениеРасходовПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	// Получить данные трудовые ресурсы по периодам.
	МассивСтрок = ДанныеПроекта.ТаблицаТрудовыеРесурсыПоПериодамЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
		
		НоваяСтрока = ШаблонЗадачи.ТрудовыеРесурсыПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	ШаблонЗадачи.Записать();
	
	Если Не Журнал = Неопределено Тогда  		
		
		ЗаписьЖурнала = Журнал.Добавить();
		ЗаписьЖурнала.ВидОперации 	= Перечисления.упоОперацияБиблиотекиШаблонов.ЗаписьПроектаВШаблон;
		ЗаписьЖурнала.ОбъектПроекта = ДанныеЗадачи.Задача;
		ЗаписьЖурнала.ОбъектШаблона = ШаблонЗадачи.Ссылка;
		ЗаписьЖурнала.Пользователь 	= Пользователи.ТекущийПользователь();
		ЗаписьЖурнала.Период 		= ТекущаяДата();
		
	КонецЕсли; 
	
	Возврат ШаблонЗадачи.Ссылка;
	
КонецФункции

// Базовый модуль экспорта данных из реального проекта в шаблона проекта.
// 
// Параметры:
//  ПараметрыЭкспорта - Структура - содержит настройки пользователя:
//   * Шаблон                     - СправочникСсылка.упоШаблоныПроектов.
//   * Проект                     - СправочникСсылка.Проекты.
//   * Этап                       - ДокументСсылка.упоПроектнаяЗадача.
//   * ОчиститьПроект             - Булево.
//   * СоздатьКорневуюЗадачу      - Булево.
//   * ДатаНачала                 - Дата.
//   * КоэффициентМасштабирования - Число.
//  ДанныеПроекта     - Структура - содержит данные реального проекта:
//   * ТаблицаЗадач               - ТаблицаЗначений.
//   * ТаблицаПредУсловийЗадач    - ТаблицаЗначений.
//   * ТаблицаМатРесурсовЗадач    - ТаблицаЗначений.
//  Индикатор         - Форма - индикатор выполнения процесса (прогресс бар).
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
// 
Функция ЗаписатьДанныеПроектаВШаблон(ПараметрыЭкспорта, ДанныеПроекта, Индикатор, НовыйШаблон = Неопределено)
	
	НазваниеШаблона = ПараметрыЭкспорта.НазваниеШаблона;
	КорневаяЗадача = ПараметрыЭкспорта.Этап;
	СопоставлениеКонтрагентов = ПараметрыЭкспорта.СопоставлениеКонтрагентов;
	
	КолЭлементов = ПолучитьКоличествоЭлементов(ПараметрыЭкспорта, ДанныеПроекта);
			
	// Массив для хранения задач.
	СписокЗадач = Новый СписокЗначений();
	// Соответствие для задачи/операции и ее шаблона.
	СоответствиеШаблона = Новый Соответствие;
	Отбор = Новый Структура;
	
	// Создаем шаблон проекта.
	ШаблонПроекта = Справочники.упоШаблоныПроектов.СоздатьЭлемент();
	ШаблонПроекта.Наименование = НазваниеШаблона;
	
	Если НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ПараметрыЭкспорта.ГруппаШаблонов) Тогда      
		ШаблонПроекта.Родитель = ПараметрыЭкспорта.ГруппаШаблонов;
	КонецЕсли; 
	
	ШаблонПроекта.Записать();
	НовыйШаблон = ШаблонПроекта.Ссылка;
			
	// Определим корневые задачи.
	Если КорневаяЗадача = Документы.упоПроектнаяЗадача.ПустаяСсылка() Или ПараметрыЭкспорта.СоздатьКорневуюЗадачу = Ложь Тогда
		Отбор.Вставить("Родитель", КорневаяЗадача);
		
		МассивСтрок = ДанныеПроекта.ТаблицаЗадач.НайтиСтроки(Отбор);
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			СписокЗадач.Добавить(ТекСтрока, ТекСтрока.КодСДР);
		КонецЦикла;
	Иначе
		ТекСтрока = ДанныеПроекта.ТаблицаЗадач.Найти(КорневаяЗадача, "Задача");
		Если Не ТекСтрока = Неопределено Тогда
			СписокЗадач.Добавить(ТекСтрока, ТекСтрока.КодСДР);
		КонецЕсли;
	КонецЕсли;
	
	// Далее будем записывать всю ветку от корневой задачи, включая корневую задачу если необходимо.
	
	// Перебираем массив задач и внутри для каждой текущей задачи ищем ее потомков.
	// Далее каждого потомка текущей задачи добавляем в тот же массив задач для последующего обхода.
	
	// Зафиксируем в служебном регистре производимые операции.
	Если ПараметрыЭкспорта.СохранитьСоответствие Тогда      
		Журнал = РегистрыСведений.упоОперацииБиблиотекиШаблонов.СоздатьНаборЗаписей();
	Иначе
		Журнал = Неопределено;	
	КонецЕсли; 
	
	СписокЗадач.СортироватьПоПредставлению();
	
	Для Каждого ДанныеЗадачи Из СписокЗадач Цикл
		
		// Запишем данные текущей задачи.
		ШаблонЗадачи = ЗаписатьДанныеЗадачиВШаблон(ШаблонПроекта.Ссылка, ДанныеПроекта, ДанныеЗадачи.Значение,
			СоответствиеШаблона, Индикатор, Журнал, СопоставлениеКонтрагентов);
		
		// Создадим соответствие задачи ее шаблону.
		СоответствиеШаблона.Вставить(ДанныеЗадачи.Значение.Задача, ШаблонЗадачи);
		
		Отбор.Вставить("Родитель", ДанныеЗадачи.Значение.Задача);
		
		МассивСтрок = ДанныеПроекта.ТаблицаЗадач.НайтиСтроки(Отбор);
		СписокСтрок = Новый СписокЗначений();
		
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			СписокСтрок.Добавить(ТекСтрока, ТекСтрока.КодСДР);
		КонецЦикла; 
		
		СписокСтрок.СортироватьПоПредставлению();
		
		Для Каждого ТекСтрока Из СписокСтрок Цикл
			СписокЗадач.Добавить(ТекСтрока.Значение, ТекСтрока.Представление);
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ Журнал = Неопределено Тогда
		Журнал.Записать(Ложь);
	КонецЕсли;
	
	ШаблонПроекта.Записать();
	
	СписокЗадач.СортироватьПоПредставлению();
	
	// Повторно перебираем массив задач, полученный выше.
	// По текущей задачи для связанного с ней шаблона создаем его связи.
	Для Каждого ДанныеЗадачи Из СписокЗадач Цикл
		
		СсылкаНаПЗ = ДанныеЗадачи.Значение.Задача;
		
		Отбор = Новый Структура("Задача", СсылкаНаПЗ);
		ПредУсловияЗадачи = ДанныеПроекта.ТаблицаПредУсловийЗадач.НайтиСтроки(Отбор);
		Если Не ЗначениеЗаполнено(ПредУсловияЗадачи) Тогда
			Продолжить;
		КонецЕсли;
		
		ШаблонЗадачи = СоответствиеШаблона.Получить(СсылкаНаПЗ);
		ШаблонЗадачи = ШаблонЗадачи.ПолучитьОбъект();
		
		Для Каждого ПредУсловие Из ПредУсловияЗадачи Цикл
			// Если выбрана корневая задача, то исключенные задачи не войдут в шаблон.
			ЗадачаПредшественник = СоответствиеШаблона.Получить(ПредУсловие.Предшественник);
			Если Не ЗначениеЗаполнено(ЗадачаПредшественник) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ШаблонЗадачи.ПредУсловия.Добавить();
			НоваяСтрока.ЗадачаПредшественник = ЗадачаПредшественник;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПредУсловие);
			НоваяСтрока.ЗадержкаВЧасах = ПредУсловие.Задержка;
			НоваяСтрока.ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.Час;
			
		КонецЦикла;
		
		ШаблонЗадачи.Записать();
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ИмпортШаблонаВПроект

// Функция возвращает данные БД по заданному шаблону проекта и параметрам пользователя.
// 
// Параметры:
//  ПараметрыИмпорта - Структура - содержит настройки:
//   * Шаблон - СправочникСсылка.упоШаблоныПроектов, СправочникСсылка.упоШаблоныПроектныхЗадач.
//   * ЕдиницаВремениПоУмолчанию - СправочникСсылка.упоЕдиницыВремени.
//   * УстановитьЕдиницуВремениПоУмолчанию - Булево.
//   * ЕдиницаТрудоемкостиПоУмолчанию - СправочникСсылка.упоЕдиницыВремени.
//   * УстановитьЕдиницуТрудоемкостиПоУмолчанию - Булево.
//   * ВключатьПодчиненныеЗадачи - Булево.
//   * РасчетЦеныКонтракта - ДокументСсылка.упоРасчетЦеныКонтракта.
//   * КоэффициентМасштабирования - Число.
// 
// Возвращаемое значение:
//  Структура - содержит трубуемые данные.
//		ТаблицаЗадач               - ТаблицаЗначений.
//		ТаблицаПредУсловийЗадач    - ТаблицаЗначений.
//		ТаблицаМатРесурсовЗадач    - ТаблицаЗначений.
// 
Функция ПолучитьДанныеШаблона(ПараметрыИмпорта) Экспорт
	
	Запрос = Новый Запрос;
	
	// Создим возвращаемую структуру.
	ДанныеПроекта = Новый Структура;
	ДанныеПроекта.Вставить("ТаблицаЗадач");
	ДанныеПроекта.Вставить("ТаблицаПредУсловийЗадач");
	ДанныеПроекта.Вставить("ТаблицаМатРесурсовЗадач");
	ДанныеПроекта.Вставить("ТаблицаСубпродуктовЗадач");
	ДанныеПроекта.Вставить("ТаблицаТрудовыхРесурсовЗадач");
	ДанныеПроекта.Вставить("ТаблицаДопЗатратЗадач");
	ДанныеПроекта.Вставить("ТаблицаФинПлановЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеОбъемовЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеПотребностейЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДополнительныхЗатрат");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовПоПериодамЗадач");
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовПоПериодамЗадач");
	ДанныеПроекта.Вставить("ТаблицаТрудовыеРесурсыПоПериодамЗадач");
	
	Если ТипЗнч(ПараметрыИмпорта.Шаблон) = Тип("СправочникСсылка.упоШаблоныПроектныхЗадач") Тогда
		Если ПараметрыИмпорта.Свойство("ВключатьПодчиненныеЗадачи") И ПараметрыИмпорта.ВключатьПодчиненныеЗадачи Тогда
			СтрокаПодмены = ".Ссылка В ИЕРАРХИИ (&ШаблонЗадачи)";	
		Иначе
			СтрокаПодмены = ".Ссылка = &ШаблонЗадачи";
		КонецЕсли;
		Запрос.УстановитьПараметр("ШаблонЗадачи" , ПараметрыИмпорта.Шаблон);
	Иначе
		СтрокаПодмены = "";
		Запрос.УстановитьПараметр("Шаблон" , ПараметрыИмпорта.Шаблон);
	КонецЕсли;	
	
	// Заготовка для дополнительной проектной задачи (при создании на основании Расчета цены контракта).
	ДанныеДополнительнойПроектнойЗадачи = Новый Соответствие;
	
	// Каждое поле возвращаемой структры заполняем отобранными данными из БД.
	
	Запрос.УстановитьПараметр("Коэффициент" , ПараметрыИмпорта.КоэффициентМасштабирования);
	Запрос.УстановитьПараметр("ПустаяЗадача", Справочники.упоШаблоныПроектныхЗадач.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("ЕдиницаВремениПоУмолчанию", ПараметрыИмпорта.ЕдиницаВремениПоУмолчанию);
	Запрос.УстановитьПараметр("ИзменятьЕдиницуВремени", ЗначениеЗаполнено(ПараметрыИмпорта.ЕдиницаВремениПоУмолчанию) И  ПараметрыИмпорта.УстановитьЕдиницуВремениПоУмолчанию);
	
	Запрос.УстановитьПараметр("ЕдиницаТрудоемкостиПоУмолчанию", ПараметрыИмпорта.ЕдиницаТрудоемкостиПоУмолчанию);
	Запрос.УстановитьПараметр("ИзменятьЕдиницуТрудоемкости", ЗначениеЗаполнено(ПараметрыИмпорта.ЕдиницаТрудоемкостиПоУмолчанию) И  ПараметрыИмпорта.УстановитьЕдиницуТрудоемкостиПоУмолчанию);

	КоэффициентЕдиницыВремени = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыИмпорта.ЕдиницаВремениПоУмолчанию, "Коэффициент");
	Если Не ЗначениеЗаполнено(КоэффициентЕдиницыВремени) Тогда
		КоэффициентЕдиницыВремени = 1;
	КонецЕсли;
	Запрос.УстановитьПараметр("КоэффициентЕдиницыВремени", КоэффициентЕдиницыВремени);
	
	ЕдиницаТрудоемкостиПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыИмпорта.ЕдиницаТрудоемкостиПоУмолчанию, "Коэффициент");
	Если Не ЗначениеЗаполнено(ЕдиницаТрудоемкостиПоУмолчанию) Тогда
		ЕдиницаТрудоемкостиПоУмолчанию = 1;
	КонецЕсли;
	Запрос.УстановитьПараметр("КоэффициентЕдиницыТрудоемкости", ЕдиницаТрудоемкостиПоУмолчанию);	
		
	// Получим данные по проектным задачам шаблона.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрШПЗ.Ссылка КАК Задача,
		|	СпрШПЗ.Родитель КАК Родитель,
		|	СпрШПЗ.ПолноеНаименование КАК НазваниеЗадачи,
		|	СпрШПЗ.ЭтоПакетРабот КАК ЭтоПакетРабот,
		|	СпрШПЗ.ЭтоВеха КАК ЭтоВеха,
		|	СпрШПЗ.НормаСтоимости КАК НормаСтоимости,
		|	СпрШПЗ.ОписаниеЗадачи КАК ОписаниеЗадачи,
		|	СпрШПЗ.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	СпрШПЗ.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
		|	СпрШПЗ.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
		|	ВЫБОР
		|		КОГДА СпрШПЗ.ЭтоВеха
		|			ТОГДА СпрШПЗ.ЕдиницаНормированияДлительности
		|		КОГДА &ИзменятьЕдиницуВремени
		|				ИЛИ СпрШПЗ.ЕдиницаНормированияДлительности = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА &ЕдиницаВремениПоУмолчанию
		|		ИНАЧЕ СпрШПЗ.ЕдиницаНормированияДлительности
		|	КОНЕЦ КАК ЕдиницаНормированияДлительности,
		|	СпрШПЗ.ДлительностьМоделиПакетаРабот * &Коэффициент * ВЫБОР
		|		КОГДА &ИзменятьЕдиницуВремени
		|				И НЕ ЕСТЬNULL(СпрШПЗ.ЕдиницаНормированияДлительности, ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА СпрШПЗ.ЕдиницаНормированияДлительности.Коэффициент / &КоэффициентЕдиницыВремени
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДлительностьМоделиПакетаРабот,
		|	СпрШПЗ.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|	СпрШПЗ.ВидОперации КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА СпрШПЗ.СпособПривязкиДопЗатрат = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДопЗатрат.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДопЗатрат.КЗавершениюЗадачи)
		|		ИНАЧЕ СпрШПЗ.СпособПривязкиДопЗатрат
		|	КОНЕЦ КАК СпособПривязкиДопЗатрат,
		|	СпрШПЗ.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта,
		|	СпрШПЗ.РучнойВводСроков КАК РучнойВводСроков,
		|	СпрШПЗ.ВключитьМатРесурсыВПланРасходов КАК ВключитьМатРесурсыВПланРасходов,
		|	СпрШПЗ.ВключитьСубпродуктыВПланДоходов КАК ВключитьСубпродуктыВПланДоходов,
		|	СпрШПЗ.ВключитьТрудРесурсыВПланРасходов КАК ВключитьТрудРесурсыВПланРасходов,
		|	СпрШПЗ.Объект КАК Объект,
		|	СпрШПЗ.КрайнийСрок КАК КрайнийСрок,
		|	СпрШПЗ.МетодРасчетаМоделиПакетаРабот КАК МетодРасчетаМоделиПакетаРабот,
		|	СпрШПЗ.СпособПланированияРасходов КАК СпособПланированияРасходов,
		|	СпрШПЗ.УчестьРучнойВводСроковПриАктуализации КАК УчестьРучнойВводСроковПриАктуализации,
		|	СпрШПЗ.ПланироватьТрудозатратыНаИсполнителей КАК ПланироватьТрудозатратыНаИсполнителей,
		|	СпрШПЗ.КодПроектногоДокумента КАК КодПроектногоДокумента,
		|	СпрШПЗ.ЗапретитьАвтоЗапуск КАК ЗапретитьАвтоЗапуск,
		|	СпрШПЗ.НазваниеОперации КАК НазваниеОперации,
		|	СпрШПЗ.НазваниеПроектнойЗадачи КАК НазваниеПроектнойЗадачи,
		|	СпрШПЗ.НаправлениеДвиженияПоСДР КАК НаправлениеДвиженияПоСДР,
		|	СпрШПЗ.ОбновлятьДатуДокумента КАК ОбновлятьДатуДокумента,
		|	СпрШПЗ.РазрешитьРаннийЗапуск КАК РазрешитьРаннийЗапуск,
		|	СпрШПЗ.ФлагИмпортаMSP КАК ФлагИмпортаMSP,
		|	СпрШПЗ.СтруктураКартинокОписания КАК СтруктураКартинокОписания,
		|	СпрШПЗ.ВключитьЗатратыНаТрудовыеРесурсыВПланРасходов КАК ВключитьЗатратыНаТрудовыеРесурсыВПланРасходов,
		|	СпрШПЗ.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
		|	СпрШПЗ.КритерийРезультата КАК КритерийРезультата,
		|	СпрШПЗ.ОписаниеРезультата КАК ОписаниеРезультата,
		|	СпрШПЗ.КалендарьЗадачи КАК КалендарьЗадачи,
		|	СпрШПЗ.ВключитьДопЗатратыВПланРасходов КАК ВключитьДопЗатратыВПланРасходов,
		|	СпрШПЗ.УровеньПланированияТрудозатратДляБДР КАК УровеньПланированияТрудозатратДляБДР,
		|	СпрШПЗ.ВключитьПланДоходовВБДДС КАК ВключитьПланДоходовВБДДС,
		|	СпрШПЗ.ВключитьПланРасходовВБДДС КАК ВключитьПланРасходовВБДДС,
		|	СпрШПЗ.СхемаОплатыПоУмолчаниюРасходы КАК СхемаОплатыПоУмолчаниюРасходы,
		|	СпрШПЗ.СхемаОплатыПоУмолчаниюДоходы КАК СхемаОплатыПоУмолчаниюДоходы,
		|	СпрШПЗ.НормаСтоимостиОбъемы КАК НормаСтоимостиОбъемы,
		|	СпрШПЗ.ТипСубпродукта КАК ТипСубпродукта,
		|	СпрШПЗ.ТранслироватьЗатратыПоСубпродуктам КАК ТранслироватьЗатратыПоСубпродуктам,
		|	СпрШПЗ.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач КАК СпрШПЗ
		|ГДЕ
		|	СпрШПЗ.Владелец = &Шаблон
		|	И НЕ СпрШПЗ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СпрШПЗ.Код";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные финансовых планов задач.
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблоныПроектныхЗадачПланДоходов.Ссылка КАК Задача,
		|	""Доходы"" КАК ВидЭлемента,
		|	ШаблоныПроектныхЗадачПланДоходов.Статья КАК Статья,
		|	NULL КАК ВидПлатежа,
		|	ШаблоныПроектныхЗадачПланДоходов.Сумма * &Коэффициент КАК Сумма,
		|	ШаблоныПроектныхЗадачПланДоходов.Контрагент КАК Контрагент,
		|	ШаблоныПроектныхЗадачПланДоходов.ПрофильРаспределения КАК Профиль,
		|	ШаблоныПроектныхЗадачПланДоходов.Валюта КАК Валюта,
		|	0 КАК Задержка,
		|	ШаблоныПроектныхЗадачПланДоходов.НомерСтроки КАК НомерСтроки,
		|	ШаблоныПроектныхЗадачПланДоходов.СпособПривязки КАК СпособПривязки,
		|	ШаблоныПроектныхЗадачПланДоходов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	NULL КАК ЭтоРольТрудовогоРесурса,
		|	NULL КАК Договор
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.ПланДоходов КАК ШаблоныПроектныхЗадачПланДоходов
		|ГДЕ
		|	ШаблоныПроектныхЗадачПланДоходов.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблоныПроектныхЗадачПланДоходов.Ссылка.ПометкаУдаления
		|	И ШаблоныПроектныхЗадачПланДоходов.Сумма > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблоныПроектныхЗадачПланРасходов.Ссылка,
		|	""Расходы"",
		|	ШаблоныПроектныхЗадачПланРасходов.Статья,
		|	NULL,
		|	ШаблоныПроектныхЗадачПланРасходов.Сумма * &Коэффициент,
		|	ШаблоныПроектныхЗадачПланРасходов.Контрагент,
		|	ШаблоныПроектныхЗадачПланРасходов.ПрофильРаспределения,
		|	ШаблоныПроектныхЗадачПланРасходов.Валюта,
		|	0,
		|	ШаблоныПроектныхЗадачПланРасходов.НомерСтроки,
		|	ШаблоныПроектныхЗадачПланРасходов.СпособПривязки,
		|	ШаблоныПроектныхЗадачПланРасходов.ИндексСтрокРаспределения,
		|	ШаблоныПроектныхЗадачПланРасходов.ЭтоРольТрудовогоРесурса,
		|	NULL
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.ПланРасходов КАК ШаблоныПроектныхЗадачПланРасходов
		|ГДЕ
		|	ШаблоныПроектныхЗадачПланРасходов.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблоныПроектныхЗадачПланРасходов.Ссылка.ПометкаУдаления
		|	И ШаблоныПроектныхЗадачПланРасходов.Сумма > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблоныПроектныхЗадачПланПоступлений.Ссылка,
		|	""Поступления"",
		|	ШаблоныПроектныхЗадачПланПоступлений.Статья,
		|	ШаблоныПроектныхЗадачПланПоступлений.ВидПлатежа,
		|	ШаблоныПроектныхЗадачПланПоступлений.Сумма * &Коэффициент,
		|	ШаблоныПроектныхЗадачПланПоступлений.Контрагент,
		|	ШаблоныПроектныхЗадачПланПоступлений.ПрофильРаспределения,
		|	ШаблоныПроектныхЗадачПланПоступлений.Валюта,
		|	ШаблоныПроектныхЗадачПланПоступлений.Задержка,
		|	ШаблоныПроектныхЗадачПланПоступлений.НомерСтроки,
		|	ШаблоныПроектныхЗадачПланПоступлений.СпособПривязки,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.ПланПоступлений КАК ШаблоныПроектныхЗадачПланПоступлений
		|ГДЕ
		|	ШаблоныПроектныхЗадачПланПоступлений.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблоныПроектныхЗадачПланПоступлений.Ссылка.ПометкаУдаления
		|	И ШаблоныПроектныхЗадачПланПоступлений.Сумма > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблоныПроектныхЗадачПланВыплат.Ссылка,
		|	""Выплаты"",
		|	ШаблоныПроектныхЗадачПланВыплат.Статья,
		|	ШаблоныПроектныхЗадачПланВыплат.ВидПлатежа,
		|	ШаблоныПроектныхЗадачПланВыплат.Сумма * &Коэффициент,
		|	ШаблоныПроектныхЗадачПланВыплат.Контрагент,
		|	ШаблоныПроектныхЗадачПланВыплат.ПрофильРаспределения,
		|	ШаблоныПроектныхЗадачПланВыплат.Валюта,
		|	ШаблоныПроектныхЗадачПланВыплат.Задержка,
		|	ШаблоныПроектныхЗадачПланВыплат.НомерСтроки,
		|	ШаблоныПроектныхЗадачПланВыплат.СпособПривязки,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.ПланВыплат КАК ШаблоныПроектныхЗадачПланВыплат
		|ГДЕ
		|	ШаблоныПроектныхЗадачПланВыплат.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблоныПроектныхЗадачПланВыплат.Ссылка.ПометкаУдаления
		|	И ШаблоныПроектныхЗадачПланВыплат.Сумма > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаФинПлановЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по предусловиям проектных задач шаблона.
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабСпрШПЗ_ПУ.Ссылка КАК Задача,
	               |	ТабСпрШПЗ_ПУ.Ссылка.Код КАК Код,
	               |	ТабСпрШПЗ_ПУ.ЗадачаПредшественник КАК Предшественник,
	               |	ТабСпрШПЗ_ПУ.ТипСвязи КАК ТипСвязи,
	               |	ТабСпрШПЗ_ПУ.ЗадержкаВЧасах КАК ЗадержкаВЧасах,
	               |	ТабСпрШПЗ_ПУ.Задержка * ВЫБОР
	               |		КОГДА &ИзменятьЕдиницуВремени
	               |				И НЕ ЕСТЬNULL(ТабСпрШПЗ_ПУ.ЕдиницаНормированияДлительности, ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
	               |			ТОГДА ТабСпрШПЗ_ПУ.ЕдиницаНормированияДлительности.Коэффициент / &КоэффициентЕдиницыВремени
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Задержка,
	               |	ВЫБОР
	               |		КОГДА &ИзменятьЕдиницуВремени
	               |				И НЕ ЕСТЬNULL(ТабСпрШПЗ_ПУ.ЕдиницаНормированияДлительности, ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
	               |			ТОГДА &ЕдиницаВремениПоУмолчанию
	               |		ИНАЧЕ ТабСпрШПЗ_ПУ.ЕдиницаНормированияДлительности
	               |	КОНЕЦ КАК ЕдиницаНормированияДлительности
	               |ИЗ
	               |	Справочник.упоШаблоныПроектныхЗадач.ПредУсловия КАК ТабСпрШПЗ_ПУ
	               |ГДЕ
	               |	ТабСпрШПЗ_ПУ.Ссылка.Владелец = &Шаблон
	               |	И НЕ ТабСпрШПЗ_ПУ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаПредУсловийЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получим данные по материальным ресурсам проектных задач шаблона.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабСпрШПЗ_МР.Ссылка КАК Задача,
		|	ТабСпрШПЗ_МР.Ссылка.ВидОперации КАК ВидОперации,
		|	ТабСпрШПЗ_МР.Ресурс КАК Ресурс,
		|	ТабСпрШПЗ_МР.Количество * &Коэффициент КАК Количество,
		|	ТабСпрШПЗ_МР.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|	ТабСпрШПЗ_МР.Контрагент КАК Контрагент,
		|	ТабСпрШПЗ_МР.СпособПривязкиПотребности КАК СпособПривязкиПотребности,
		|	ТабСпрШПЗ_МР.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
		|	ТабСпрШПЗ_МР.Валюта КАК Валюта,
		|	ТабСпрШПЗ_МР.Стоимость * &Коэффициент КАК СтоимостьЕд,
		|	ТабСпрШПЗ_МР.ОбщСтоимость * &Коэффициент КАК Стоимость,
		|	ТабСпрШПЗ_МР.Договор КАК Договор,
		|	ТабСпрШПЗ_МР.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ТабСпрШПЗ_МР.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ТабСпрШПЗ_МР.СпособПривязки КАК СпособПривязки,
		|	ТабСпрШПЗ_МР.ДатаПривязки КАК ДатаПривязки,
		|	ТабСпрШПЗ_МР.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.МатериальныеРесурсы КАК ТабСпрШПЗ_МР
		|ГДЕ
		|	ТабСпрШПЗ_МР.Ссылка.Владелец = &Шаблон
		|	И НЕ ТабСпрШПЗ_МР.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаМатРесурсовЗадач", Запрос.Выполнить().Выгрузить());
		
	Если ПараметрыИмпорта.Свойство("РасчетЦеныКонтракта") И ЗначениеЗаполнено(ПараметрыИмпорта.РасчетЦеныКонтракта) Тогда
		СкорректироватьТаблицуМатериаловПоРасчетуЦеныКонтракта(ДанныеПроекта.ТаблицаМатРесурсовЗадач,
																ДанныеДополнительнойПроектнойЗадачи,
																ПараметрыИмпорта.РасчетЦеныКонтракта);	
	КонецЕсли;
	
	// Получим данные по субпродуктам проектных задач шаблона.
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабСпрШПЗ.Ссылка КАК Задача,
		|	ТабСпрШПЗ.Ресурс КАК Ресурс,
		|	ТабСпрШПЗ.Количество * &Коэффициент КАК Количество,
		|	ТабСпрШПЗ.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|	ТабСпрШПЗ.Контрагент КАК Контрагент,
		|	ТабСпрШПЗ.СпособПривязкиВыпуска КАК СпособПривязкиВыпуска,
		|	ТабСпрШПЗ.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
		|	ТабСпрШПЗ.Скорость КАК Скорость,
		|	ТабСпрШПЗ.Коэффициент КАК Коэффициент,
		|	ТабСпрШПЗ.Валюта КАК Валюта,
		|	ТабСпрШПЗ.Стоимость * &Коэффициент КАК СтоимостьЕд,
		|	ТабСпрШПЗ.ОбщСтоимость * &Коэффициент КАК Стоимость,
		|	ТабСпрШПЗ.Договор КАК Договор,
		|	ТабСпрШПЗ.СтатьяДоходов КАК СтатьяДоходов,
		|	ТабСпрШПЗ.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ТабСпрШПЗ.СпособПривязки КАК СпособПривязки,
		|	ТабСпрШПЗ.ДатаПривязки КАК ДатаПривязки,
		|	ТабСпрШПЗ.НомерСтроки КАК НомерСтроки,
		|	ТабСпрШПЗ.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	ТабСпрШПЗ.Нормирование КАК Нормирование,
		|	ТабСпрШПЗ.КоэффициентСложности КАК КоэффициентСложности,
		|	ТабСпрШПЗ.Трудоемкость КАК Трудоемкость,
		|	ТабСпрШПЗ.СкоростьВыполнения КАК СкоростьВыполнения
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.Субпродукты КАК ТабСпрШПЗ
		|ГДЕ
		|	ТабСпрШПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ТабСпрШПЗ.Ссылка.ПометкаУдаления";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабСпрШПЗ.Ссылка КАК Задача,
		|	ТабСпрШПЗ.Ресурс КАК Ресурс,
		|	ТабСпрШПЗ.Количество * &Коэффициент КАК Количество,
		|	ТабСпрШПЗ.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|	ТабСпрШПЗ.Контрагент КАК Контрагент,
		|	ТабСпрШПЗ.СпособПривязкиВыпуска КАК СпособПривязкиВыпуска,
		|	ТабСпрШПЗ.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
		|	ТабСпрШПЗ.Скорость КАК Скорость,
		|	ТабСпрШПЗ.Коэффициент КАК Коэффициент,
		|	ТабСпрШПЗ.Валюта КАК Валюта,
		|	ТабСпрШПЗ.Стоимость * &Коэффициент КАК СтоимостьЕд,
		|	ТабСпрШПЗ.ОбщСтоимость * &Коэффициент КАК Стоимость,
		|	ТабСпрШПЗ.Договор КАК Договор,
		|	ТабСпрШПЗ.СтатьяДоходов КАК СтатьяДоходов,
		|	ТабСпрШПЗ.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ТабСпрШПЗ.СпособПривязки КАК СпособПривязки,
		|	ТабСпрШПЗ.ДатаПривязки КАК ДатаПривязки,
		|	ТабСпрШПЗ.НомерСтроки КАК НомерСтроки,
		|	ТабСпрШПЗ.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.Субпродукты КАК ТабСпрШПЗ
		|ГДЕ
		|	ТабСпрШПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ТабСпрШПЗ.Ссылка.ПометкаУдаления";
    КонецЕсли;
		
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаСубпродуктовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получаем данные по трудовым ресурсам задач.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Задача КАК Задача,
		|	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
		|	ВложенныйЗапрос.Ресурс КАК Ресурс,
		|	ВложенныйЗапрос.УровеньПланирования КАК УровеньПланирования,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|	ВложенныйЗапрос.СтоимостьЕд КАК СтоимостьЕд,
		|	ВложенныйЗапрос.Стоимость КАК Стоимость,
		|	ВложенныйЗапрос.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ВложенныйЗапрос.СтоимостьЕдВнешняя КАК СтоимостьЕдВнешняя,
		|	ВложенныйЗапрос.ВнешняяСтоимость КАК ВнешняяСтоимость,
		|	ВложенныйЗапрос.Подразделение КАК Подразделение,
		|	ВложенныйЗапрос.Основной КАК Основной,
		|	ВложенныйЗапрос.Коэффициент КАК КоэффициентЕд,
		|	ВложенныйЗапрос.ИсточникПлана КАК ИсточникПлана,
		|	ВложенныйЗапрос.Количество * ВложенныйЗапрос.Коэффициент КАК КоличествоЧасов
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТрудовыеРесурсы.Ссылка КАК Задача,
		|		ТрудовыеРесурсы.Ссылка.ВидОперации КАК ВидОперации,
		|		ТрудовыеРесурсы.Ресурс КАК Ресурс,
		|		ТрудовыеРесурсы.УровеньПланирования КАК УровеньПланирования,
		|		ТрудовыеРесурсы.Количество * &Коэффициент * ВЫБОР
		|			КОГДА &ИзменятьЕдиницуТрудоемкости
		|					И НЕ ЕСТЬNULL(ТрудовыеРесурсы.ЕдиницаНормирования, ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|				ТОГДА ТрудовыеРесурсы.ЕдиницаНормирования.Коэффициент / &КоэффициентЕдиницыТрудоемкости
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК Количество,
		|		ВЫБОР
		|			КОГДА &ИзменятьЕдиницуТрудоемкости
		|					И НЕ ЕСТЬNULL(ТрудовыеРесурсы.ЕдиницаНормирования, ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|				ТОГДА &ЕдиницаТрудоемкостиПоУмолчанию
		|			ИНАЧЕ ТрудовыеРесурсы.ЕдиницаНормирования
		|		КОНЕЦ КАК ЕдиницаНормирования,
		|		ТрудовыеРесурсы.Стоимость * &Коэффициент КАК СтоимостьЕд,
		|		ТрудовыеРесурсы.ОбщСтоимость * &Коэффициент КАК Стоимость,
		|		ТрудовыеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
		|		ТрудовыеРесурсы.ВнешняяСтоимость * &Коэффициент КАК СтоимостьЕдВнешняя,
		|		ТрудовыеРесурсы.ОбщВнешняяСтоимость * &Коэффициент КАК ВнешняяСтоимость,
		|		ТрудовыеРесурсы.Подразделение КАК Подразделение,
		|		ТрудовыеРесурсы.Основной КАК Основной,
		|		ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты) КАК ИсточникПлана,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ТрудовыеРесурсы.ЕдиницаНормирования, ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|				ТОГДА 1
		|			ИНАЧЕ ТрудовыеРесурсы.ЕдиницаНормирования.Коэффициент
		|		КОНЕЦ КАК Коэффициент
		|	ИЗ
		|		Справочник.упоШаблоныПроектныхЗадач.ТрудовыеРесурсы КАК ТрудовыеРесурсы
		|	ГДЕ
		|		ТрудовыеРесурсы.Ссылка.Владелец = &Шаблон
		|		И НЕ ТрудовыеРесурсы.Ссылка.ПометкаУдаления) КАК ВложенныйЗапрос";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаТрудовыхРесурсовЗадач", Запрос.Выполнить().Выгрузить());
	
	Если ПараметрыИмпорта.Свойство("РасчетЦеныКонтракта") И ЗначениеЗаполнено(ПараметрыИмпорта.РасчетЦеныКонтракта) Тогда
		СкорректироватьТаблицуТрудозатратПоРасчетуЦеныКонтракта(ДанныеПроекта.ТаблицаТрудовыхРесурсовЗадач,
																ДанныеДополнительнойПроектнойЗадачи,
																ПараметрыИмпорта.РасчетЦеныКонтракта);	
	КонецЕсли;
	
	// Получаем данные по доп. затратам задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ШаблонПЗ.Ссылка.ВидОперации КАК ВидОперацииПроектнойЗадачи,
		|	ШаблонПЗ.ВидОперации КАК ВидОперации,
		|	ШаблонПЗ.Стоимость * &Коэффициент КАК Стоимость,
		|	ШаблонПЗ.Ссылка КАК Задача,
		|	ШаблонПЗ.Комментарий КАК Комментарий,
		|	ШаблонПЗ.СпособПривязкиДоходовРасходов КАК СпособПривязкиДоходовРасходов,
		|	ШаблонПЗ.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределенияДоходовРасходов,
		|	ШаблонПЗ.ДатаПривязкиДоходовРасходов КАК ДатаПривязкиДоходовРасходов,
		|	ШаблонПЗ.КонтрагентДоходовРасходов КАК КонтрагентДоходовРасходов,
		|	ШаблонПЗ.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.ДополнительныеЗатраты КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаДопЗатратЗадач", Запрос.Выполнить().Выгрузить());
	
	Если ПараметрыИмпорта.Свойство("РасчетЦеныКонтракта") И ЗначениеЗаполнено(ПараметрыИмпорта.РасчетЦеныКонтракта) Тогда
		СкорректироватьТаблицуДопЗатратПоРасчетуЦеныКонтракта(ДанныеПроекта.ТаблицаДопЗатратЗадач,
																ДанныеДополнительнойПроектнойЗадачи,
																ПараметрыИмпорта.РасчетЦеныКонтракта);	
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ДанныеДополнительнойПроектнойЗадачи", ДанныеДополнительнойПроектнойЗадачи);		
	
	// Получаем данные по распределению доходов проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Роль,
		|	ШаблонПЗ.Подразделение,
		|	ШаблонПЗ.СпособПривязки,
		|	ШаблонПЗ.ПрофильРаспределения,
		|	ШаблонПЗ.ДатаПривязки,
		|	ШаблонПЗ.ИндексСтрокиВладельца,
		|	ШаблонПЗ.Сумма * &Коэффициент КАК Сумма,
		|	ШаблонПЗ.СобствСилы_Субподряд,
		|	ШаблонПЗ.КонтрагентПодрядчик,
		|	ШаблонПЗ.ИндексСтрокРаспределенияПоПериодам,
		|	ШаблонПЗ.Ссылка КАК Задача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеДоходов КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получаем данные по распределению расходов проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Роль КАК Роль,
		|	ШаблонПЗ.Подразделение КАК Подразделение,
		|	ШаблонПЗ.СпособПривязки КАК СпособПривязки,
		|	ШаблонПЗ.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ШаблонПЗ.ДатаПривязки КАК ДатаПривязки,
		|	ШаблонПЗ.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ШаблонПЗ.Сумма * &Коэффициент КАК Сумма,
		|	ШаблонПЗ.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ШаблонПЗ.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	ШаблонПЗ.Ссылка КАК Задача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеРасходов КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получаем данные по распределению объемов проектных задач.
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Роль КАК Роль,
		|	ШаблонПЗ.Подразделение КАК Подразделение,
		|	ШаблонПЗ.СпособПривязки КАК СпособПривязки,
		|	ШаблонПЗ.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ШаблонПЗ.ДатаПривязки КАК ДатаПривязки,
		|	ШаблонПЗ.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	ШаблонПЗ.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ШаблонПЗ.Сумма * &Коэффициент КАК Сумма,
		|	ШаблонПЗ.Количество * &Коэффициент КАК Количество,
		|	ШаблонПЗ.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ШаблонПЗ.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	ШаблонПЗ.Ссылка КАК Задача,
		|	ШаблонПЗ.Нормирование КАК Нормирование,
		|	ШаблонПЗ.КоэффициентСложности КАК КоэффициентСложности,
		|	ШаблонПЗ.Трудоемкость КАК Трудоемкость,
		|	ШаблонПЗ.ПроцентРаспределения КАК ПроцентРаспределения
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеОбъемов КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Роль КАК Роль,
		|	ШаблонПЗ.Подразделение КАК Подразделение,
		|	ШаблонПЗ.СпособПривязки КАК СпособПривязки,
		|	ШаблонПЗ.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ШаблонПЗ.ДатаПривязки КАК ДатаПривязки,
		|	ШаблонПЗ.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	ШаблонПЗ.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ШаблонПЗ.Сумма * &Коэффициент КАК Сумма,
		|	ШаблонПЗ.Количество * &Коэффициент КАК Количество,
		|	ШаблонПЗ.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ШаблонПЗ.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	ШаблонПЗ.Ссылка КАК Задача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеОбъемов КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
    КонецЕсли;
			
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеОбъемовЗадач", Запрос.Выполнить().Выгрузить());

	// Получаем данные по распределению потребностей проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Роль КАК Роль,
		|	ШаблонПЗ.Подразделение КАК Подразделение,
		|	ШаблонПЗ.СпособПривязки КАК СпособПривязки,
		|	ШаблонПЗ.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ШаблонПЗ.ДатаПривязки КАК ДатаПривязки,
		|	ШаблонПЗ.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ШаблонПЗ.Сумма * &Коэффициент КАК Сумма,
		|	ШаблонПЗ.Количество * &Коэффициент КАК Количество,
		|	ШаблонПЗ.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ШаблонПЗ.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	ШаблонПЗ.Ссылка КАК Задача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеПотребностей КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеПотребностейЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получаем данные по распределению дополнительных затрат проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.Роль КАК Роль,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.Подразделение КАК Подразделение,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.СпособПривязки КАК СпособПривязки,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.ПрофильРаспределения КАК ПрофильРаспределения,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.ДатаПривязки КАК ДатаПривязки,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.Сумма КАК Сумма,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.Ссылка КАК Задача,
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.КонтрагентПодрядчик КАК КонтрагентПодрядчик
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеДополнительныхЗатрат КАК упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат
		|ГДЕ
		|	упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.Ссылка.Владелец = &Шаблон
		|	И НЕ упоШаблоныПроектныхЗадачРаспределениеДополнительныхЗатрат.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДополнительныхЗатратЗадач", Запрос.Выполнить().Выгрузить());

	
	// Получаем данные по распределению доходов по периодам проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Период КАК Период,
		|	ШаблонПЗ.Сумма КАК Сумма,
		|	ШаблонПЗ.Количество КАК Количество,
		|	ШаблонПЗ.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	ШаблонПЗ.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
		|	ШаблонПЗ.Ссылка КАК Задача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеДоходовПоПериодам КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеДоходовПоПериодамЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получаем данные по распределению расходов по периодам проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Период КАК Период,
		|	ШаблонПЗ.Сумма КАК Сумма,
		|	ШаблонПЗ.Количество КАК Количество,
		|	ШаблонПЗ.ИсточникПлана КАК ИсточникПлана,
		|	ШаблонПЗ.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	ШаблонПЗ.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
		|	ШаблонПЗ.Ссылка КАК Задача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.РаспределениеРасходовПоПериодам КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаРаспределениеРасходовПоПериодамЗадач", Запрос.Выполнить().Выгрузить());
	
	// Получаем данные трудовые ресурсы по периодам проектных задач.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонПЗ.Период КАК Период,
		|	ШаблонПЗ.Количество КАК Количество,
		|	ШаблонПЗ.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	ШаблонПЗ.Ссылка КАК Задача
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач.ТрудовыеРесурсыПоПериодам КАК ШаблонПЗ
		|ГДЕ
		|	ШаблонПЗ.Ссылка.Владелец = &Шаблон
		|	И НЕ ШаблонПЗ.Ссылка.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(СтрокаПодмены) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Ссылка.Владелец = &Шаблон", СтрокаПодмены);
	КонецЕсли;
	
	ДанныеПроекта.Вставить("ТаблицаТрудовыеРесурсыПоПериодамЗадач", Запрос.Выполнить().Выгрузить());
		
	// Возвращаем полученные данные.
	Возврат ДанныеПроекта;
	
КонецФункции

// Модуль проверки на факты по проекту.
// 
// Параметры:
//  Проект - СправочникСсылка.Проекты - проект.
// 
// Возвращаемое значение:
//  Булево - признак наличия факта.
// 
Функция ПроверитьПланФактПроекта(Проект)
	
	ЗадачиСписанФакт = упоПроектыИЗадачиСервер.ПолучитьЗадачиСписанФакт(Проект);
	
	ЕстьФактПоПроекту = ЗадачиСписанФакт.Количество() = 0;
	
	Возврат ЕстьФактПоПроекту;
	
КонецФункции

// Модуль очистки проекта.
// 
// Параметры:
//  Проект    - СправочникСсылка.Проекты - проект.
//  Индикатор - Форма - индикатор выполнения процесса (прогресс бар).
// 
// Возвращаемое значение:
//  Булево - признак выполнения операции.
// 
Функция ОчиститьПроект(Проект, Индикатор)
	
	ЭтоФакт = ПроверитьПланФактПроекта(Проект);
	
	Если ЭтоФакт = Истина Тогда
		Возврат Истина;
	КонецЕсли;
			
	Успех = упоПроектыИЗадачиСервер.ОчиститьПроект(Проект);
	
	Возврат Не Успех;
	
КонецФункции

// Модуль записи проектной задачи в реальный проект по данным шаблона проекной задачи.
// 
// Параметры:
//  Проект              - СправочникСсылка.Проекты - проект.
//  ЗадачаРодитель      – ДокументСсылка.упоПроектнаяЗадача - ссылка на родительскую проектную задачу.
//  ДанныеШаблона       - Структура, содержит данные шаблона проекта:
//   * ТаблицаЗадач               - ТаблицаЗначений.
//   * ТаблицаПредУсловийЗадач    - ТаблицаЗначений.
//   * ТаблицаМатРесурсовЗадач    - ТаблицаЗначений.
//  ДанныеШаблонаЗадачи - СтрокаТаблицыЗначений - содержит данные конкретной задачи шаблона проекта.
//  Индикатор           - Форма - индикатор выполнения процесса (прогресс бар).
//  Журнал 				- РегистрСведенийНаборЗаписей - для фиксации связей между объектами.
// 
// Возвращаемое значение:
//  ДокументСсылка.упоПроектнаяЗадача - ссылка на созданную проектную задачу.
// 
Функция ЗаписатьДанныеЗадачиВПроект(Проект, ЗадачаРодитель, ДанныеШаблона, ДанныеШаблонаЗадачи, Индикатор,
	Журнал = Неопределено, Контрагенты = Неопределено)
	
	// Создание и запись новой проектной задачи по заданным параметрам.
	
	// Создадим новую задачу в проекте.
	Задача = Документы.упоПроектнаяЗадача.СоздатьДокумент();
	
	// Заполним необходимые данные.
	ЗаполнитьЗначенияСвойств(Задача, ДанныеШаблонаЗадачи);
	
	Задача.Дата 						= ТекущаяДата();
	Задача.НазваниеПроектнойЗадачи 		= ДанныеШаблонаЗадачи.НазваниеЗадачи;
	Задача.ОбновлятьДатуДокумента 		= Истина;
	Задача.Проект 						= Проект;
	Задача.ЗадачаРодитель 				= ЗадачаРодитель;
		
	Если ДанныеШаблонаЗадачи.РучнойВводСроков И НЕ ЗначениеЗаполнено(ДанныеШаблонаЗадачи.ДатаНачалаПлан) Тогда
		
		Задача.РучнойВводСроков = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru = 'У задачи ""%1"" не заполнена плановая дата начала! Режим ввода сроков изменен на автоматический.'");
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение.Текст, Задача.НазваниеПроектнойЗадачи);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Если ДанныеШаблонаЗадачи.РучнойВводСроков И НЕ ЗначениеЗаполнено(ДанныеШаблонаЗадачи.ДатаЗавершенияПлан) Тогда
		
		Задача.РучнойВводСроков = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'У задачи ""%1"" не заполнена плановая дата завершения! Режим ввода сроков изменен на автоматический.'");
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение.Текст, Задача.НазваниеПроектнойЗадачи);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	// Отбор по заданному шаблону задачи.
	Отбор = Новый Структура("Задача", ДанныеШаблонаЗадачи.Задача);
	
	// Определим состав материальных ресуров для новой задачи.
	МатРесурсы = ДанныеШаблона.ТаблицаМатРесурсовЗадач.НайтиСтроки(Отбор);
	Для Каждого МатРесурс Из МатРесурсы Цикл
		
		НоваяСтрока = Задача.МатериальныеРесурсы.Добавить();
		
		НоваяСтрока.Ресурс               = МатРесурс.Ресурс;
		НоваяСтрока.ЕдиницаНормирования  = МатРесурс.ЕдиницаНормирования;
		НоваяСтрока.Количество           = МатРесурс.Количество;
		НоваяСтрока.Стоимость            = МатРесурс.СтоимостьЕд;
		НоваяСтрока.ОбщСтоимость         = МатРесурс.Стоимость;
		НоваяСтрока.ИндексСтрокРаспределения = МатРесурс.ИндексСтрокРаспределения;
		НоваяСтрока.Контрагент        	 = МатРесурс.Контрагент;
		НоваяСтрока.СпособПривязкиПотребности = МатРесурс.СпособПривязкиПотребности;
		НоваяСтрока.ЗадержкаЗаказа       = МатРесурс.ЗадержкаЗаказа;
		НоваяСтрока.Валюта        		 = МатРесурс.Валюта;
		НоваяСтрока.Договор        		 = МатРесурс.Договор;
		НоваяСтрока.СтатьяЗатрат 		 = МатРесурс.СтатьяЗатрат;
		НоваяСтрока.ПрофильРаспределения = МатРесурс.ПрофильРаспределения;
		НоваяСтрока.СпособПривязки       = МатРесурс.СпособПривязки;
		НоваяСтрока.ДатаПривязки         = МатРесурс.ДатаПривязки;
		
	КонецЦикла;
	
	// Определим состав субпродуктов для новой задачи.
	ЭтоЗадачаПроектнойПродукции = ДанныеШаблонаЗадачи.ТипСубпродукта = 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
		
	Субпродукты = ДанныеШаблона.ТаблицаСубпродуктовЗадач.НайтиСтроки(Отбор);
	
	Если ЭтоЗадачаПроектнойПродукции Тогда		
		СоответствиеШаблоновПП =  ПолучитьШаблоныППДляСубпродуктов(Субпродукты, ДанныеШаблонаЗадачи.Задача, Ложь);
	КонецЕсли;
	
	Для Каждого Субпродукт Из Субпродукты Цикл
		
		Если УдаленаСтрокаПроектнойПродукции(ЭтоЗадачаПроектнойПродукции, СоответствиеШаблоновПП, Субпродукт, 
			ДанныеШаблона.ТаблицаРаспределениеОбъемовЗадач) Тогда			
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Задача.Субпродукты.Добавить();
		
		НоваяСтрока.Ресурс               = Субпродукт.Ресурс;
		НоваяСтрока.ЕдиницаНормирования  = Субпродукт.ЕдиницаНормирования;
		НоваяСтрока.Количество           = Субпродукт.Количество;
		НоваяСтрока.Стоимость            = Субпродукт.СтоимостьЕд;
		НоваяСтрока.ОбщСтоимость         = Субпродукт.Стоимость;
		НоваяСтрока.ИндексСтрокРаспределения = Субпродукт.ИндексСтрокРаспределения;
		НоваяСтрока.Контрагент        	 = Субпродукт.Контрагент;
		НоваяСтрока.СпособПривязкиВыпуска= Субпродукт.СпособПривязкиВыпуска;
		НоваяСтрока.ЗадержкаЗаказа       = Субпродукт.ЗадержкаЗаказа;
		НоваяСтрока.Скорость       		 = Субпродукт.Скорость;
		НоваяСтрока.Коэффициент    		 = Субпродукт.Коэффициент;
		НоваяСтрока.Валюта        		 = Субпродукт.Валюта;
		НоваяСтрока.Договор        		 = Субпродукт.Договор;
		НоваяСтрока.СтатьяДоходов 		 = Субпродукт.СтатьяДоходов;
		НоваяСтрока.ПрофильРаспределения = Субпродукт.ПрофильРаспределения;
		НоваяСтрока.СпособПривязки       = Субпродукт.СпособПривязки;
		НоваяСтрока.ДатаПривязки         = Субпродукт.ДатаПривязки;
		
		Если ЭтоЗадачаПроектнойПродукции Тогда	
			НоваяСтрока.Нормирование  	 		= Субпродукт.Нормирование;
			НоваяСтрока.Трудоемкость    		= Субпродукт.Трудоемкость;
			НоваяСтрока.КоэффициентСложности  	= Субпродукт.КоэффициентСложности;
			НоваяСтрока.СкоростьВыполнения  	= Субпродукт.СкоростьВыполнения;
		КонецЕсли
		
	КонецЦикла;

	// Определим параметры и трудовые ресурсы для модели пакета работ.
	
	Задача.ДлительностьМоделиПакетаРабот 			= ДанныеШаблонаЗадачи.ДлительностьМоделиПакетаРабот;
	Задача.ЕдиницаНормированияДлительности 			= ДанныеШаблонаЗадачи.ЕдиницаНормированияДлительности;
	Задача.НормаСтоимостиТрудовыхРесурсов 			= ДанныеШаблонаЗадачи.НормаСтоимостиТрудовыхРесурсов;
	Задача.ВнешняяНормаСтоимостиТрудовыхРесурсов 	= ДанныеШаблонаЗадачи.ВнешняяНормаСтоимостиТрудовыхРесурсов;
	Задача.ВидОперации 								= ДанныеШаблонаЗадачи.ВидОперации;
	Задача.МетодРасчетаМоделиПакетаРабот 			= Перечисления.упоМетодРасчетаСроковМоделиПакетаРабот.ПоДлительности;
	Задача.ДлительностьБезУчетаКалендаряПроекта 	= ДанныеШаблонаЗадачи.ДлительностьБезУчетаКалендаряПроекта;
	
	ТрудовыеРесурсы = ДанныеШаблона.ТаблицаТрудовыхРесурсовЗадач.НайтиСтроки(Отбор);
	Для каждого СтрокаРесурс Из ТрудовыеРесурсы Цикл
		
		НоваяСтрока 					 = Задача.ТрудовыеРесурсы.Добавить();
		НоваяСтрока.ЕдиницаНормирования  = СтрокаРесурс.ЕдиницаНормирования;
		НоваяСтрока.УровеньПланирования  = СтрокаРесурс.УровеньПланирования;
		НоваяСтрока.Количество 			 = СтрокаРесурс.Количество;
		НоваяСтрока.ОбщСтоимость 		 = СтрокаРесурс.Стоимость;
		НоваяСтрока.ПрофильРаспределения = СтрокаРесурс.ПрофильРаспределения;
		НоваяСтрока.Ресурс 				 = СтрокаРесурс.Ресурс;
		НоваяСтрока.Подразделение 		 = СтрокаРесурс.Подразделение;
		НоваяСтрока.Стоимость 			 = СтрокаРесурс.СтоимостьЕд;
		НоваяСтрока.Основной 			 = СтрокаРесурс.Основной;
		Если НЕ ДанныеШаблона.ТаблицаТрудовыхРесурсовЗадач.Колонки.Найти("СтоимостьЕдВнешняя") = Неопределено Тогда
			НоваяСтрока.ВнешняяСтоимость = СтрокаРесурс.СтоимостьЕдВнешняя;
		КонецЕсли;
		Если НЕ ДанныеШаблона.ТаблицаТрудовыхРесурсовЗадач.Колонки.Найти("ВнешняяСтоимость") = Неопределено Тогда
			НоваяСтрока.ОбщВнешняяСтоимость = СтрокаРесурс.ВнешняяСтоимость;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ПрофильРаспределения) Тогда
			НоваяСтрока.ПрофильРаспределения = Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СпособПривязки) Тогда
			НоваяСтрока.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения;
		КонецЕсли;
		НоваяСтрока.ИсточникПлана = СтрокаРесурс.ИсточникПлана;
	КонецЦикла;
	
	// Определяем дополнительные затраты по проектной задаче.
	
	ДопЗатраты = ДанныеШаблона.ТаблицаДопЗатратЗадач.НайтиСтроки(Отбор);
	Для каждого СтрокаЗатрат Из ДопЗатраты Цикл
		НоваяСтрока 			 = Задача.ДополнительныеЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗатрат, , "КонтрагентДоходовРасходов");
		
		СтрокаКонтрагент = Контрагенты.Найти(СтрокаЗатрат.КонтрагентДоходовРасходов, "ШаблонКонтрагента");
		Если НЕ СтрокаКонтрагент = Неопределено Тогда
			НоваяСтрока.КонтрагентДоходовРасходов = СтрокаКонтрагент.Контрагент;
		КонецЕсли;
	КонецЦикла; 
	
	// Определяем финансовые планы проектной задачи.
	
	ПрофильПоУмолчанию = Неопределено;
	ВыборкаПрофилей = Справочники.упоПрофилиРаспределенияДоходовИРасходов.Выбрать();
	Если ВыборкаПрофилей.Следующий() Тогда
		ПрофильПоУмолчанию = ВыборкаПрофилей.Ссылка;
	КонецЕсли;
	
	ФинПланы = ДанныеШаблона.ТаблицаФинПлановЗадач.НайтиСтроки(Отбор);
	Для каждого СтрокаФинПлан Из ФинПланы Цикл
		
		// Пробуем найти контрагента.
		Контрагент = Неопределено;
		Договор = Неопределено;
		СтрокаКонтрагент = Контрагенты.Найти(СтрокаФинПлан.Контрагент, "ШаблонКонтрагента");
		Если Не СтрокаКонтрагент = Неопределено Тогда
			Контрагент = СтрокаКонтрагент.Контрагент;
			Договор = СтрокаКонтрагент.Договор;
		КонецЕсли; 
		
		Если СтрокаФинПлан.ВидЭлемента = "Доходы" Или СтрокаФинПлан.ВидЭлемента = "Расходы" Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаФинПлан.Профиль) И Не ЗначениеЗаполнено(ПрофильПоУмолчанию) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаФинПлан.ВидЭлемента = "Доходы" Тогда
				СтрокаФинПланЗадачи = Задача.ПланДоходов.Добавить();
			ИначеЕсли СтрокаФинПлан.ВидЭлемента = "Расходы" Тогда
				СтрокаФинПланЗадачи = Задача.ПланРасходов.Добавить();
				СтрокаФинПланЗадачи.ЭтоРольТрудовогоРесурса = СтрокаФинПлан.ЭтоРольТрудовогоРесурса;
			КонецЕсли; 
			
			СтрокаФинПланЗадачи.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения;
			Если НЕ ЗначениеЗаполнено(СтрокаФинПлан.Профиль) Тогда
				СтрокаФинПланЗадачи.ПрофильРаспределения = ПрофильПоУмолчанию;
			Иначе
				СтрокаФинПланЗадачи.ПрофильРаспределения = СтрокаФинПлан.Профиль;
			КонецЕсли;
			
			СтрокаФинПланЗадачи.Статья = СтрокаФинПлан.Статья;
			СтрокаФинПланЗадачи.Валюта = СтрокаФинПлан.Валюта;
			СтрокаФинПланЗадачи.Сумма = СтрокаФинПлан.Сумма;
			СтрокаФинПланЗадачи.Контрагент = Контрагент;
			СтрокаФинПланЗадачи.Договор = Договор;
			СтрокаФинПланЗадачи.ИндексСтрокРаспределения = СтрокаФинПлан.ИндексСтрокРаспределения;
			СтрокаФинПланЗадачи.ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы;
			
		ИначеЕсли СтрокаФинПлан.ВидЭлемента = "Поступления" ИЛИ СтрокаФинПлан.ВидЭлемента = "Выплаты" Тогда
			
			// БДДС обязательно требует указания контрагента.
			
			Если Контрагент = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокаФинПланЗадачи = Задача.ДвиженияДенежныхСредств.Добавить();
			СтрокаФинПланЗадачи.СтатьяДДС = СтрокаФинПлан.Статья;
			СтрокаФинПланЗадачи.Валюта = СтрокаФинПлан.Валюта;
			СтрокаФинПланЗадачи.Сумма = СтрокаФинПлан.Сумма;
			СтрокаФинПланЗадачи.Контрагент = Контрагент;
			СтрокаФинПланЗадачи.Договор = СтрокаКонтрагент.Договор;
			СтрокаФинПланЗадачи.ВидПлатежа = СтрокаФинПлан.ВидПлатежа;
			
			Если СтрокаФинПлан.ВидЭлемента = "Поступления" Тогда
				СтрокаФинПланЗадачи.НаправлениеДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление;
			ИначеЕсли СтрокаФинПлан.ВидЭлемента = "Выплаты" Тогда
				СтрокаФинПланЗадачи.НаправлениеДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Выплата;
			КонецЕсли; 
			
			Если СтрокаФинПлан.СпособПривязки = Перечисления.упоСпособПривязкиДДС.НаДату Тогда
				СтрокаФинПланЗадачи.СпособПривязки = Перечисления.упоСпособПривязкиДДС.НачалоЗадачи;
			Иначе
				СтрокаФинПланЗадачи.СпособПривязки = СтрокаФинПлан.СпособПривязки; 				
			КонецЕсли;
			СтрокаФинПланЗадачи.Задержка = СтрокаФинПлан.Задержка;
			СтрокаФинПланЗадачи.ПрофильРаспределения = СтрокаФинПлан.Профиль;
			СтрокаФинПланЗадачи.ИсточникПлана = Перечисления.упоИсточникПланаДДС.ДДС;
			
		КонецЕсли; 
		
	КонецЦикла; 
		
	// Получить данные распределения доходов.
	МассивСтрок = ДанныеШаблона.ТаблицаРаспределениеДоходовЗадач.НайтиСтроки(Отбор);
	Для каждого Строка Из МассивСтрок Цикл
		
		НоваяСтрока = Задача.РаспределениеДоходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Контрагент = Неопределено;
		СтрокаКонтрагент = Контрагенты.Найти(Строка.КонтрагентПодрядчик, "ШаблонКонтрагента");
		Если Не СтрокаКонтрагент = Неопределено Тогда
			НоваяСтрока.КонтрагентПодрядчик = СтрокаКонтрагент.Контрагент;
		КонецЕсли;
		
	КонецЦикла;
	
	// Получить данные распределения расходов.
	МассивСтрок = ДанныеШаблона.ТаблицаРаспределениеРасходовЗадач.НайтиСтроки(Отбор);
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока =  Задача.РаспределениеРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	// Получить данные распределения объемов.
	МассивСтрок = ДанныеШаблона.ТаблицаРаспределениеОбъемовЗадач.НайтиСтроки(Отбор);
	Для Каждого Строка Из МассивСтрок Цикл
				
		НоваяСтрока =  Задача.РаспределениеОбъемов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Контрагент = Неопределено;
		СтрокаКонтрагент = Контрагенты.Найти(Строка.КонтрагентПодрядчик, "ШаблонКонтрагента");
		Если НЕ СтрокаКонтрагент = Неопределено Тогда
			НоваяСтрока.КонтрагентПодрядчик = СтрокаКонтрагент.Контрагент;
		КонецЕсли;
		
	КонецЦикла;

	// Получить данные распределения потребностей.
	МассивСтрок = ДанныеШаблона.ТаблицаРаспределениеПотребностейЗадач.НайтиСтроки(Отбор);
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока =  Задача.РаспределениеПотребностей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	// Получить данные распределения дополнительных затрат.
	МассивСтрок = ДанныеШаблона.ТаблицаРаспределениеДополнительныхЗатратЗадач.НайтиСтроки(Отбор);
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока =  Задача.РаспределениеДополнительныхЗатрат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		СтрокаКонтрагент = Контрагенты.Найти(Строка.КонтрагентПодрядчик, "ШаблонКонтрагента");
		Если НЕ СтрокаКонтрагент = Неопределено Тогда
			НоваяСтрока.КонтрагентПодрядчик = СтрокаКонтрагент.Контрагент;
		КонецЕсли;		
	КонецЦикла;
	
	// Получить данные распределение доходов по периодам.
	МассивСтрок = ДанныеШаблона.ТаблицаРаспределениеДоходовПоПериодамЗадач.НайтиСтроки(Отбор);
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока =  Задача.РаспределениеДоходовПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	// Получить данные распределение расходов по периодам.
	МассивСтрок = ДанныеШаблона.ТаблицаРаспределениеРасходовПоПериодамЗадач.НайтиСтроки(Отбор);
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока =  Задача.РаспределениеРасходовПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	// Получить данные трудовые ресурсы по периодам.
	МассивСтрок = ДанныеШаблона.ТаблицаТрудовыеРесурсыПоПериодамЗадач.НайтиСтроки(Отбор);
	Для Каждого Строка Из МассивСтрок Цикл
		НоваяСтрока =  Задача.ТрудовыеРесурсыПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	// Не надо добавлять лишние строки при записи из шаблона.
	Задача.ДополнительныеСвойства.Вставить("упоНеПроверятьЗаполнятьТабличныеЧастиРаспределений", Истина);
	Задача.ДополнительныеСвойства.Вставить("НеЗеркалировать", Истина);
	Задача.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
	Задача.ДополнительныеСвойства.Вставить("НеПроверятьУдалениеПП", Истина);
	
	// Запишем задачу в БД в режиме проведения.
	Задача.Записать(РежимЗаписиДокумента.Запись);
	
	Если НЕ Журнал = Неопределено Тогда
		ЗаписьЖурнала = Журнал.Добавить();
		ЗаписьЖурнала.ВидОперации = Перечисления.упоОперацияБиблиотекиШаблонов.ЗаписьШаблонаВПроект;
		ЗаписьЖурнала.ОбъектПроекта = Задача.Ссылка;
		ЗаписьЖурнала.ОбъектШаблона = ДанныеШаблонаЗадачи.Задача;
		ЗаписьЖурнала.Пользователь = Пользователи.ТекущийПользователь();
		ЗаписьЖурнала.Период = ТекущаяДата(); 
	КонецЕсли; 
		
	Возврат Задача.Ссылка;
	
КонецФункции

// Базовый модуль импорта данных шаблона проекта в реальный проект.
// 
// Параметры:
//  ПараметрыИмпорта - Структура - содержит настройки пользователя:
//   * Шаблон                     - СправочникСсылка.упоШаблоныПроектов.
//   * Проект                     - СправочникСсылка.Проекты.
//   * Этап                       - ДокументСсылка.упоПроектнаяЗадача.
//   * ОчиститьПроект             - Булево.
//   * СоздатьКорневуюЗадачу      - Булево.
//   * ДатаНачала                 - Дата.
//   * КоэффициентМасштабирования - Число.
//  ДанныеШаблона    - Структура - содержит данные шаблона проекта:
//   * ТаблицаЗадач               - ТаблицаЗначений.
//   * ТаблицаПредУсловийЗадач    - ТаблицаЗначений.
//   * ТаблицаМатРесурсовЗадач    - ТаблицаЗначений.
//  Индикатор        - Форма - индикатор выполнения процесса (прогресс бар).
//  ТекстОшибки      - Строка - заполняется при возникновении ошибки.
// 
// Возвращаемое значение:
//  Булево - признак ошибки.
// 
Функция ЗаписатьДанныеШаблонаВПроект(ПараметрыИмпорта, ДанныеШаблона, Индикатор, ТекстОшибки = "")
	
	ЕстьОшибка = Ложь;
	
	ДополнитьПараметрыИмпортаСвойствамиПроекта(ПараметрыИмпорта);
	
	ДанныеЗаписаныВРасширении = Расширяемый_ЗаписатьДанныеШаблонаВПроект(ЕстьОшибка, 
		ПараметрыИмпорта, ДанныеШаблона, Индикатор, ТекстОшибки);
	Если ДанныеЗаписаныВРасширении Тогда
		Возврат ЕстьОшибка;
	КонецЕсли;
	
	// Здесь будем хранить все импортированные задачи.
	МассивЗадач = Новый Массив;
	
	// Получим входные параметры.
	Проект			= ПараметрыИмпорта.Проект;
	КорневаяЗадача 	= ПараметрыИмпорта.Этап;
	Версия 			= ПараметрыИмпорта.Версия;
	
	КолЭлементов = ДанныеШаблона.ТаблицаЗадач.Количество();
	
	// Если требуется, то создаем дополнительную корневую задачу.
	Если ПараметрыИмпорта.СоздатьКорневуюЗадачу Тогда
		
		НазваниеЗадачи = ПараметрыИмпорта.Шаблон.Наименование;
		
		// Создание и запись корневой проектной задачи.
		
		// Создадим новую задачу в проекте.
		Задача = Документы.упоПроектнаяЗадача.СоздатьДокумент();
		
		// Заполним необходимые данные.
		Задача.Дата                    = ТекущаяДата();
		Задача.НазваниеПроектнойЗадачи = НазваниеЗадачи;
		Задача.Проект                  = Проект;
		
		// Запишем задачу в БД в режиме проведения.
		Задача.ДополнительныеСвойства.Вставить("НеЗеркалировать", Истина);
		Задача.Записать(РежимЗаписиДокумента.Запись); // Лучше запись.
		
		КорневаяЗадача = Задача.Ссылка;
		
		МассивЗадач.Добавить(КорневаяЗадача);
		
	КонецЕсли;
	
	// Массив для хранения задач.
	МассивШаблонаЗадач = Новый Массив;
	// Соответствие шаблонов их задачам/операциям.
	СоответствиеШаблона = Новый Соответствие;
	ОтборПоРодителю = Новый Структура;
	
	// Определим шаблоны задач верхнего уровня,
	// и добавим их в массив шаблона задач.
	ОтборПоРодителю.Вставить("Родитель", Справочники.упоШаблоныПроектныхЗадач.ПустаяСсылка());
	
	ДанныеШаблона.ТаблицаЗадач.Индексы.Добавить("Родитель");
	МассивСтрок = ДанныеШаблона.ТаблицаЗадач.НайтиСтроки(ОтборПоРодителю);
	Для Каждого ТекСтрока Из МассивСтрок Цикл
		МассивШаблонаЗадач.Добавить(ТекСтрока);
	КонецЦикла;
		
	// Далее будем создавать всю ветку задач от корневой задачи.
	
	// Перебираем массив шаблона задач и внутри для каждой текущей задачи ищем ее потомков.
	// Далее каждого потомка текущей задачи добавляем в этот же массив для последующего обхода.
	
	// Зафиксируем в регистре соответствие элементов шаблона и проекта.
	
	Если ПараметрыИмпорта.СохранитьСоответствие Тогда      
		Журнал = РегистрыСведений.упоОперацииБиблиотекиШаблонов.СоздатьНаборЗаписей();
	Иначе
		Журнал = Неопределено;
	КонецЕсли;
	
	ИндексОбхода = 0;
	Для Каждого ДанныеШаблонаЗадачи Из МассивШаблонаЗадач Цикл
		// Определим родительскую задачу для текущей задачи.
		Если ДанныеШаблонаЗадачи.Родитель = Справочники.упоШаблоныПроектныхЗадач.ПустаяСсылка() Тогда
			ЗадачаРодитель = КорневаяЗадача;
		Иначе
			ЗадачаРодитель = СоответствиеШаблона.Получить(ДанныеШаблонаЗадачи.Родитель);
		КонецЕсли;
		
		// Создадим данные текущей задачи.
		Задача = ЗаписатьДанныеЗадачиВПроект(Проект, ЗадачаРодитель, ДанныеШаблона, ДанныеШаблонаЗадачи, Индикатор,
			Журнал, ПараметрыИмпорта.СоответствиеКонтрагентов);
		
		МассивЗадач.Добавить(Задача);
		
		// Создадим соответствие шаблона ее задаче.
		СоответствиеШаблона.Вставить(ДанныеШаблонаЗадачи.Задача, Задача);
		
		// Опеределим и добавим в перебираемый массив потомков для текущего шаблона задачи.
		ОтборПоРодителю.Вставить("Родитель", ДанныеШаблонаЗадачи.Задача);
		
		МассивСтрок = ДанныеШаблона.ТаблицаЗадач.НайтиСтроки(ОтборПоРодителю);
		ИндексПодчиненных = 0;
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			// Подчиненные задачи должы следовать за родителем, 
			// чтобы не нарушался порядок проведения по связям (см.ПровестиЗадачу()).
			ИндексПодчиненных = ИндексПодчиненных + 1;
			МассивШаблонаЗадач.Вставить(ИндексОбхода + ИндексПодчиненных, ТекСтрока);
		КонецЦикла;
		
		ИндексОбхода = ИндексОбхода + 1;
	КонецЦикла;
	
	Если ДанныеШаблона.ДанныеДополнительнойПроектнойЗадачи.Количество() > 0 Тогда
		СоздатьДополнительнуюПроектнуюЗадачу(ДанныеШаблона.ДанныеДополнительнойПроектнойЗадачи, ПараметрыИмпорта, 
			МассивЗадач, КорневаяЗадача);
	КонецЕсли;
		
	ОтборПоЗадаче = Новый Структура;
	
	// Далее будем создавать для каждой задачи ее операции.
	
	Если НЕ Журнал = Неопределено Тогда
		Журнал.Записать(Ложь);
	КонецЕсли;
	
	// Далее будем определять для каждой задачи ее предшественников.
	
	ТаблицаЗадач = Новый ТаблицаЗначений;
	ТаблицаЗадач.Колонки.Добавить("Задача");
	ТаблицаЗадач.Колонки.Добавить("Родитель");
	ТаблицаЗадач.Колонки.Добавить("ЭтоМодельПакетаРабот");
	ТаблицаЗадач.Колонки.Добавить("ЭтоВеха");
	ТаблицаЗадач.Колонки.Добавить("ДатаНачалаПлан");
	ТаблицаЗадач.Колонки.Добавить("ДатаЗавершенияПлан");
	ТаблицаЗадач.Колонки.Добавить("КодСДР");
	
	ТаблицаПредЗадач = Новый ТаблицаЗначений;
	ТаблицаПредЗадач.Колонки.Добавить("Задача");
	ТаблицаПредЗадач.Колонки.Добавить("ПредЗадача");
	ТаблицаПредЗадач.Колонки.Добавить("ТипСвязи");
	ТаблицаПредЗадач.Колонки.Добавить("Задержка");
	
	// Корневая задача не попадала в расчет и поэтому проект не проходил проверку сроков.
	// Лучше добавлять в расчет корневую задачу, если она заполнена. Если не заполнена, то и не добавляем.
	Если ЗначениеЗаполнено(КорневаяЗадача) Тогда
		новаяСтрокаЗадач = ТаблицаЗадач.Добавить();
		новаяСтрокаЗадач.Задача 				= КорневаяЗадача;
		новаяСтрокаЗадач.Родитель 				= Документы.упоПроектнаяЗадача.ПустаяСсылка();
		новаяСтрокаЗадач.ЭтоМодельПакетаРабот 	= Ложь;
		новаяСтрокаЗадач.ЭтоВеха 				= Ложь;
		новаяСтрокаЗадач.ДатаНачалаПлан 		= КорневаяЗадача.ДатаНачалаПлан;
		новаяСтрокаЗадач.ДатаЗавершенияПлан		= КорневаяЗадача.ДатаЗавершенияПлан;
	КонецЕсли;
 
	// Снова перебираем полученный массив шаблона задач.
	Для Каждого ДанныеШаблонаЗадачи Из МассивШаблонаЗадач Цикл
		
		// Получим предшественников для текущего шаблона задачи.
		ОтборПоЗадаче.Вставить("Задача", ДанныеШаблонаЗадачи.Задача);
		
		текСсылка = СоответствиеШаблона[ДанныеШаблонаЗадачи.Задача];
		
		новаяСтрокаЗадач = ТаблицаЗадач.Добавить();
		новаяСтрокаЗадач.Задача 				= текСсылка;
		ПолучаемыеРеквизиты = "ЗадачаРодитель, ЭтоМодельПакетаРабот, ЭтоВеха, ДатаНачалаПлан, ДатаЗавершенияПлан";
		ПолученныеЗначенияПЗ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(текСсылка, ПолучаемыеРеквизиты, Истина);
		ЗаполнитьЗначенияСвойств(новаяСтрокаЗадач, ПолученныеЗначенияПЗ);
		новаяСтрокаЗадач.Родитель = ПолученныеЗначенияПЗ.ЗадачаРодитель;
		
		// Получим задачу по ее шаблону, а по ней ее объект.
		Задача = текСсылка.ПолучитьОбъект();
		
		// Определим предшественников текущей задачи.
		ПредУсловия = ДанныеШаблона.ТаблицаПредУсловийЗадач.НайтиСтроки(ОтборПоЗадаче);
		Для Каждого ПредУсловие Из ПредУсловия Цикл
			предСсылка = СоответствиеШаблона[ПредУсловие.Предшественник];
			
			НоваяСтрока = Задача.ПредУсловияЗадачи.Добавить();
			НоваяСтрока.ЗадачаПредшественник = предСсылка;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПредУсловие);
			
			новаястрокаПред 			= ТаблицаПредЗадач.Добавить();
			новаястрокаПред.Задача 		= текСсылка;
			новаястрокаПред.ПредЗадача 	= предСсылка;
			ЗаполнитьЗначенияСвойств(новаястрокаПред, ПредУсловие, , "Задача");
			новаястрокаПред.Задержка 	= ПредУсловие.ЗадержкаВЧасах;
		КонецЦикла;
		
		Задача.ДополнительныеСвойства.Вставить("упоНеПроверятьЗаполнятьТабличныеЧастиРаспределений", Истина);
		Задача.ДополнительныеСвойства.Вставить("НеЗеркалировать", Истина);
		Задача.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
		Задача.ДополнительныеСвойства.Вставить("НеПроверятьУдалениеПП", Истина);
	
		// Запишем изменения текущей задачи в БД в режиме проведения.
		Задача.Записать(РежимЗаписиДокумента.Запись); // Лучше записать.
		
	КонецЦикла;
	
	ТаблицаЗадач.Индексы.Добавить("Родитель, Задача");
		
	Если ЗначениеЗаполнено(ПараметрыИмпорта.Этап) Тогда
		КодСДРЭтапа = упоПроектыИЗадачиВызовСервера.обПолучитьКодСДРПроектнойЗадачи(ПараметрыИмпорта.Этап);
		КодСДРЭтапа = ?(ЗначениеЗаполнено(КодСДРЭтапа), КодСДРЭтапа + ".", "");
		РассчитатьКодСДРДляЗадач(ТаблицаЗадач, ПараметрыИмпорта.Этап, КодСДРЭтапа, ПараметрыИмпорта.Этап);
	Иначе
		РассчитатьКодСДРДляЗадач(ТаблицаЗадач, Документы.упоПроектнаяЗадача.ПустаяСсылка(), "", Проект);
	КонецЕсли;
	
	// Далее будем определять для каждой операции ее предшественников.
	
	ПараметрыИмпорта.Вставить("ТаблицаЗадач"		, ТаблицаЗадач);
	ПараметрыИмпорта.Вставить("ТаблицаПредЗадач"	, ТаблицаПредЗадач);
	
	ЭтоСозданиеПроектаИзШаблона = Истина;

	Если ПараметрыИмпорта.Свойство("ДатаНачала") И ЗначениеЗаполнено(ПараметрыИмпорта.ДатаНачала) Тогда
		НоваяДатаСтарта = ПараметрыИмпорта.ДатаНачала;
		ДатаНачалаДляЗадачБезСроков = НоваяДатаСтарта; 
	Иначе
		НоваяДатаСтарта = Неопределено;
		ДатаНачалаДляЗадачБезСроков = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(Проект, Истина);
	КонецЕсли;
	
	проведенныеЗадачи 	= Новый Соответствие;
	Если НЕ КорневаяЗадача = ПараметрыИмпорта.Этап Тогда
		ПровестиЗадачу(КорневаяЗадача, проведенныеЗадачи, Индикатор, ДатаНачалаДляЗадачБезСроков, ТаблицаЗадач, КодСДРЭтапа);
	Иначе
		проведенныеЗадачи.Вставить(КорневаяЗадача, Истина);
	КонецЕсли;
	проведенныеЗадачи.Вставить(ПараметрыИмпорта.Этап, Истина);
	
	// Перебираем полученный массив задач.
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкиДляЗаписиПроектныхЗадач(Проект, ТаблицаЗадач);
		Для Каждого ТекСтрокаТаблицы Из ТаблицаЗадач Цикл
			ПровестиЗадачу(ТекСтрокаТаблицы.Задача, проведенныеЗадачи, Индикатор, ДатаНачалаДляЗадачБезСроков,
				ТаблицаЗадач, ТекСтрокаТаблицы.КодСДР);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ТаблицаДопЗадач = Новый ТаблицаЗначений;
	ТаблицаДопЗадач.Колонки.Добавить("ПроектнаяЗадача");
	ТаблицаДопЗадач.Колонки.Добавить("Родитель");
	ТаблицаДопЗадач.Колонки.Добавить("ЭтоМодельПакетаРабот");
	ТаблицаДопЗадач.Колонки.Добавить("ЭтоВеха");
	ТаблицаДопЗадач.Колонки.Добавить("ДатаНачалаПлан");
	ТаблицаДопЗадач.Колонки.Добавить("ДатаЗавершенияПлан");
	ТаблицаДопЗадач.Колонки.Добавить("КодСДР");
	
	Для Каждого ТекДопЗадача Из МассивЗадач Цикл
		
		ЗадачаВТаблицеЗадач = ТаблицаЗадач.Найти(ТекДопЗадача, "Задача");
		Если ЗадачаВТаблицеЗадач <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		новаяСтрокаЗадач = ТаблицаДопЗадач.Добавить();
		новаяСтрокаЗадач.ПроектнаяЗадача = ТекДопЗадача;
		ПолучаемыеРеквизиты = "ЗадачаРодитель, ЭтоМодельПакетаРабот, ЭтоВеха, ДатаНачалаПлан, ДатаЗавершенияПлан";
		ПолученныеЗначенияПЗ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(текСсылка, ПолучаемыеРеквизиты, Истина);
		ЗаполнитьЗначенияСвойств(новаяСтрокаЗадач, ПолученныеЗначенияПЗ);
		новаяСтрокаЗадач.Родитель = ПолученныеЗначенияПЗ.ЗадачаРодитель;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПараметрыИмпорта.Этап) Тогда
		КодСДРЭтапа = упоПроектыИЗадачиВызовСервера.обПолучитьКодСДРПроектнойЗадачи(ПараметрыИмпорта.Этап);
		КодСДРЭтапа = ?(ЗначениеЗаполнено(КодСДРЭтапа), КодСДРЭтапа + ".", "");
		РассчитатьКодСДРДляЗадач(ТаблицаДопЗадач, ПараметрыИмпорта.Этап, КодСДРЭтапа, ПараметрыИмпорта.Этап);
	Иначе
		РассчитатьКодСДРДляЗадач(ТаблицаДопЗадач, Документы.упоПроектнаяЗадача.ПустаяСсылка(), "", Проект);
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировкиДляЗаписиПроектныхЗадач(Проект, ТаблицаДопЗадач);
		Для Каждого ТекДопЗадача Из ТаблицаДопЗадач Цикл
			ПровестиЗадачу(ТекДопЗадача.ПроектнаяЗадача, проведенныеЗадачи, Индикатор, ДатаНачалаДляЗадачБезСроков,
				ТаблицаДопЗадач, ТекДопЗадача.КодСДР);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Попытка
		упоРасчетКалендарныхСроковРедакция3Сервер.АктуализироватьСрокиПроекта(Проект, Истина, НоваяДатаСтарта, Версия);
	Исключение
		ТекстОшибки = ТекстОшибки + ОписаниеОшибки();
		ЕстьОшибка = Истина;
	КонецПопытки;
	
	Возврат ЕстьОшибка;
	
КонецФункции

Функция ДополнитьПараметрыИмпортаСвойствамиПроекта(ПараметрыИмпорта)
	
	Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПараметрыИмпорта.Проект);
	ПараметрыИмпорта.Вставить("Версия", Версия);
	
	Если ЗначениеЗаполнено(ПараметрыИмпорта.Этап) Тогда
		ЭтоПроектСЗадачами = Истина;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Версия", Версия);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	упоСвойстваПроектныхЗадачСрезПервых.ПроектнаяЗадача КАК ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПервых(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПервых
		               |ГДЕ
		               |	НЕ упоСвойстваПроектныхЗадачСрезПервых.ЗадачаОтменена";
		Результат = Запрос.Выполнить();
		
		ЭтоПроектСЗадачами = Не Результат.Пустой();
	КонецЕсли;
	ПараметрыИмпорта.Вставить("ЭтоПроектСЗадачами", ЭтоПроектСЗадачами);
	
КонецФункции

Процедура УстановитьБлокировкиДляЗаписиПроектныхЗадач(Проект, ПроектныеЗадачи)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.Проекты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Проект);
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упоСвойстваПроектныхЗадач");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ПроектныеЗадачи;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПроектнаяЗадача", "ПроектнаяЗадача");
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упоСрокиПроектныхЗадач");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ПроектныеЗадачи;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПроектнаяЗадача", "ПроектнаяЗадача");
	
КонецПроцедуры

Процедура ПровестиЗадачу(текЗадача, проведенныеЗадачи, Индикатор, ДатаНачалаДляЗадачБезСроков,
							ТаблицаЗадач, КодСДР)
	
	Если НЕ проведенныеЗадачи[текЗадача] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Объект текущей задачи.
	Задача = ТекЗадача.ПолучитьОбъект();
	
	ЗадачаРодитель = Задача.ЗадачаРодитель;
	Если ЗначениеЗаполнено(ЗадачаРодитель) И 
		проведенныеЗадачи[ЗадачаРодитель] = Неопределено Тогда
		ПровестиЗадачуСЗаполненнымКодомСДР(ЗадачаРодитель, проведенныеЗадачи, Индикатор, 
			ДатаНачалаДляЗадачБезСроков, ТаблицаЗадач);
	КонецЕсли;
	
	Для каждого предЗадача Из Задача.ПредусловияЗадачи Цикл
		ЗадачаПредшественник = предЗадача.ЗадачаПредшественник;
		Если проведенныеЗадачи[ЗадачаПредшественник] = Неопределено Тогда
			ПровестиЗадачуСЗаполненнымКодомСДР(ЗадачаПредшественник, проведенныеЗадачи, Индикатор, 
				ДатаНачалаДляЗадачБезСроков, ТаблицаЗадач);
		КонецЕсли;
	КонецЦикла;
	
	Задача.ДополнительныеСвойства.Вставить("ИспользоватьРодителяИзДокумента", Истина);
	Задача.ДополнительныеСвойства.Вставить("НеПроверятьВозможностьАктуализацииФинПланов", Истина);
	Если Не Задача.РучнойВводСроков Тогда
		Задача.ДополнительныеСвойства.Вставить("упоНеФормироватьАктуальныеДвижения", Истина);
	КонецЕсли;
	Задача.ДополнительныеСвойства.Вставить("ДанныеВерсииПолучены", Истина);
	Если ЗначениеЗаполнено(КодСДР) Тогда
		Задача.ДополнительныеСвойства.Вставить("ЗаписатьКодСДР", КодСДР);
		Задача.ДополнительныеСвойства.Вставить("НеИзменятьКодСДР", Истина);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Задача.ДатаНачалаПлан) ИЛИ Не ЗначениеЗаполнено(Задача.ДатаЗавершенияПлан) Тогда
		Задача.ДатаНачалаПлан = ДатаНачалаДляЗадачБезСроков;
		Задача.ДатаЗавершенияПлан = Задача.ДатаНачалаПлан;
		Задача.ДополнительныеСвойства.Вставить("ЗаписатьСроки", Истина);
	КонецЕсли;
	
	Задача.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
	Задача.ДополнительныеСвойства.Вставить("НеПроверятьУдалениеПП", Истина);
	
	Задача.Записать(РежимЗаписиДокумента.Проведение);
	
	проведенныеЗадачи.Вставить(текЗадача, Истина);
	
КонецПроцедуры

Процедура СкорректироватьТаблицуТрудозатратПоРасчетуЦеныКонтракта(ТаблицаТрудовыхРесурсовЗадач, 
																	ДанныеДополнительнойПроектнойЗадачи,
																	РасчетЦеныКонтракта)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРасчетЦеныКонтрактаТрудозатратыПИРНИР.ВидОперации,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПИРНИР.Специальность,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПИРНИР.КоличествоЧасов,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПИРНИР.СуммаПоВнутреннейСтавке КАК Сумма,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПИРНИР.СуммаПоВнешнейСтавке КАК СуммаВнешняя
	               |ПОМЕСТИТЬ втТрудозатраты
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ТрудозатратыПИРНИР КАК упоРасчетЦеныКонтрактаТрудозатратыПИРНИР
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаТрудозатратыПИРНИР.Ссылка = &РасчетЦеныКонтракта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоРасчетЦеныКонтрактаТрудозатратыПНР.ВидОперации,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПНР.Специальность,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПНР.КоличествоЧасов,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПНР.СуммаПоВнутреннейСтавке,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПНР.СуммаПоВнешнейСтавке
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ТрудозатратыПНР КАК упоРасчетЦеныКонтрактаТрудозатратыПНР
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаТрудозатратыПНР.Ссылка = &РасчетЦеныКонтракта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоРасчетЦеныКонтрактаТрудозатратыСМР.ВидОперации,
	               |	упоРасчетЦеныКонтрактаТрудозатратыСМР.Специальность,
	               |	упоРасчетЦеныКонтрактаТрудозатратыСМР.КоличествоЧасов,
	               |	упоРасчетЦеныКонтрактаТрудозатратыСМР.СуммаПоВнутреннейСтавке,
	               |	упоРасчетЦеныКонтрактаТрудозатратыСМР.СуммаПоВнешнейСтавке
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ТрудозатратыСМР КАК упоРасчетЦеныКонтрактаТрудозатратыСМР
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаТрудозатратыСМР.Ссылка = &РасчетЦеныКонтракта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоРасчетЦеныКонтрактаТрудозатратыПрочие.ВидОперации,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПрочие.Специальность,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПрочие.КоличествоЧасов,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПрочие.СуммаПоВнутреннейСтавке,
	               |	упоРасчетЦеныКонтрактаТрудозатратыПрочие.СуммаПоВнешнейСтавке
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ТрудозатратыПрочие КАК упоРасчетЦеныКонтрактаТрудозатратыПрочие
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаТрудозатратыПрочие.Ссылка = &РасчетЦеныКонтракта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТрудозатраты.ВидОперации,
	               |	втТрудозатраты.Специальность КАК Ресурс,
	               |	СУММА(втТрудозатраты.КоличествоЧасов) КАК Количество,
	               |	СУММА(втТрудозатраты.Сумма) КАК Стоимость,
	               |	втТрудозатраты.СуммаВнешняя
	               |ИЗ
	               |	втТрудозатраты КАК втТрудозатраты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТрудозатраты.ВидОперации,
	               |	втТрудозатраты.Специальность,
	               |	втТрудозатраты.СуммаВнешняя";
				   
	Запрос.УстановитьПараметр("РасчетЦеныКонтракта", РасчетЦеныКонтракта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Пропорциональное распределение количества часов и суммы из Расчета цены контракта.
		
		// Отбор по виду операции и роли.
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОперации", Выборка.ВидОперации);
		Отбор.Вставить("Ресурс", Выборка.Ресурс);
		
		МассивСтрокТрудозатратыШаблона = ТаблицаТрудовыхРесурсовЗадач.НайтиСтроки(Отбор);
		
		Если МассивСтрокТрудозатратыШаблона.Количество() = 0 Тогда 
			
			// Данные будут записаны в дополнительную проектную задачу.
			СтруктураДанныеДополнительнойПроектнойЗадачи = ДанныеДополнительнойПроектнойЗадачи.Получить(Выборка.ВидОперации);
			Если СтруктураДанныеДополнительнойПроектнойЗадачи = Неопределено Тогда
				СтруктураДанныеДополнительнойПроектнойЗадачи = СформироватьСтруктуруДанныхДополнительнойПроектнойЗадачи();
				ДанныеДополнительнойПроектнойЗадачи.Вставить(Выборка.ВидОперации, СтруктураДанныеДополнительнойПроектнойЗадачи);
			КонецЕсли;
			Если СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаТрудовыхРесурсовЗадач = Неопределено Тогда
				СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаТрудовыхРесурсовЗадач = ТаблицаТрудовыхРесурсовЗадач.СкопироватьКолонки();
			КонецЕсли;   
			СтрокаТрудозатраты = СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаТрудовыхРесурсовЗадач.Добавить();
			
			// Из Расчета цены контракта надо хватать внешнюю стоимость.
			ИмяКолонкиВнешняяСтоимость = "СуммаВнешняя";
			Если СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаТрудовыхРесурсовЗадач.Колонки.Найти(ИмяКолонкиВнешняяСтоимость) = Неопределено Тогда 
				СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаТрудовыхРесурсовЗадач.Колонки.Добавить(
					ИмяКолонкиВнешняяСтоимость, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)))
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаТрудозатраты, Выборка);
			
		Иначе	
		
			// Получение коэффициентов для распределения (по количеству часов в шаблоне).
			МассивКоэффициентов = Новый Массив;
			Для Каждого СтрокаТрудозатратыШаблона Из МассивСтрокТрудозатратыШаблона Цикл
				МассивКоэффициентов.Добавить(СтрокаТрудозатратыШаблона.КоличествоЧасов);
			КонецЦикла;
			
			МассивКоличествоЧасов = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Выборка.Количество, 
																								МассивКоэффициентов, 
																								2);
			МассивСумма = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Выборка.Стоимость, 
																								МассивКоэффициентов, 
																								2);
			МассивСуммаВнешняя = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Выборка.СуммаВнешняя, 
																								МассивКоэффициентов, 
																								2);

			// Запись полученных значений в таблицу.
			КоличествоСтрок = МассивСтрокТрудозатратыШаблона.Количество();
			Для Индекс = 0 По КоличествоСтрок - 1 Цикл
				
				КоэффициентЕд = МассивСтрокТрудозатратыШаблона[Индекс].КоэффициентЕд;
				 
				Если КоэффициентЕд = 0 Тогда					
					МассивСтрокТрудозатратыШаблона[Индекс].Количество 		= 0; 
					МассивСтрокТрудозатратыШаблона[Индекс].Стоимость 		= 0;
					МассивСтрокТрудозатратыШаблона[Индекс].ВнешняяСтоимость = 0;
				Иначе
					МассивСтрокТрудозатратыШаблона[Индекс].Количество 		= МассивКоличествоЧасов[Индекс] / КоэффициентЕд;
					МассивСтрокТрудозатратыШаблона[Индекс].Стоимость 		= МассивСумма[Индекс] / КоэффициентЕд;
					МассивСтрокТрудозатратыШаблона[Индекс].ВнешняяСтоимость = МассивСуммаВнешняя[Индекс] / КоэффициентЕд;										
				КонецЕсли;												
											
				Если МассивСтрокТрудозатратыШаблона[Индекс].Количество = 0 Тогда
					МассивСтрокТрудозатратыШаблона[Индекс].СтоимостьЕд 			= 0;
					МассивСтрокТрудозатратыШаблона[Индекс].СтоимостьЕдВнешняя 	= 0;
				Иначе
					МассивСтрокТрудозатратыШаблона[Индекс].СтоимостьЕд = 
						МассивСтрокТрудозатратыШаблона[Индекс].Стоимость / МассивСтрокТрудозатратыШаблона[Индекс].Количество;
					МассивСтрокТрудозатратыШаблона[Индекс].СтоимостьЕдВнешняя = 
						МассивСтрокТрудозатратыШаблона[Индекс].ВнешняяСтоимость / МассивСтрокТрудозатратыШаблона[Индекс].Количество;
				КонецЕсли;			
				
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;
				   
КонецПроцедуры

Процедура СкорректироватьТаблицуДопЗатратПоРасчетуЦеныКонтракта(ТаблицаДопЗатратЗадач, 
																ДанныеДополнительнойПроектнойЗадачи,
																РасчетЦеныКонтракта)

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПИРНИР.ВидОперации,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПИРНИР.СтатьяЗатрат,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПИРНИР.Сумма
	               |ПОМЕСТИТЬ втДополнительныеЗатраты
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ДополнительныеЗатратыПИРНИР КАК упоРасчетЦеныКонтрактаДополнительныеЗатратыПИРНИР
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПИРНИР.Ссылка = &РасчетЦеныКонтракта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыОборудование.ВидОперации,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыОборудование.СтатьяЗатрат,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыОборудование.Сумма
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ДополнительныеЗатратыОборудование КАК упоРасчетЦеныКонтрактаДополнительныеЗатратыОборудование
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыОборудование.Ссылка = &РасчетЦеныКонтракта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПНР.ВидОперации,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПНР.СтатьяЗатрат,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПНР.Сумма
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ДополнительныеЗатратыПНР КАК упоРасчетЦеныКонтрактаДополнительныеЗатратыПНР
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПНР.Ссылка = &РасчетЦеныКонтракта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыСМР.ВидОперации,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыСМР.СтатьяЗатрат,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыСМР.Сумма
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ДополнительныеЗатратыСМР КАК упоРасчетЦеныКонтрактаДополнительныеЗатратыСМР
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыСМР.Ссылка = &РасчетЦеныКонтракта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПрочие.ВидОперации,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПрочие.СтатьяЗатрат,
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПрочие.Сумма
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ДополнительныеЗатратыПрочие КАК упоРасчетЦеныКонтрактаДополнительныеЗатратыПрочие
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаДополнительныеЗатратыПрочие.Ссылка = &РасчетЦеныКонтракта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДополнительныеЗатраты.ВидОперации,
	               |	втДополнительныеЗатраты.СтатьяЗатрат,
	               |	СУММА(втДополнительныеЗатраты.Сумма) КАК Стоимость
	               |ИЗ
	               |	втДополнительныеЗатраты КАК втДополнительныеЗатраты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДополнительныеЗатраты.ВидОперации,
	               |	втДополнительныеЗатраты.СтатьяЗатрат";
	
	Запрос.УстановитьПараметр("РасчетЦеныКонтракта", РасчетЦеныКонтракта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаДопЗатратЗадач.Колонки.Добавить("НеУчитывать");
	ТаблицаДопЗатратЗадач.ЗаполнитьЗначения(Ложь, "НеУчитывать");
	
	// Проходим выборку первый раз - распределяем доп. затраты по видам операции, указанным в табличной части.
	
	Пока Выборка.Следующий() Цикл
		
		// Пропорциональное распределение суммы из Расчета цены контракта.
		
		// Отбор по виду операции и роли.
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОперацииПроектнойЗадачи", Выборка.ВидОперации);
		Отбор.Вставить("ВидОперации", Выборка.ВидОперации);		
		Отбор.Вставить("СтатьяЗатрат", Выборка.СтатьяЗатрат);
		
		МассивСтрокДопЗатратыШаблона = ТаблицаДопЗатратЗадач.НайтиСтроки(Отбор);
		
		Если МассивСтрокДопЗатратыШаблона.Количество() > 0 Тогда
		
			// Получение коэффициентов для распределения (по количеству часов в шаблоне).
			МассивКоэффициентов = Новый Массив;
			Для Каждого СтрокаДопЗатратыШаблона Из МассивСтрокДопЗатратыШаблона Цикл
				МассивКоэффициентов.Добавить(СтрокаДопЗатратыШаблона.Стоимость);
				СтрокаДопЗатратыШаблона.НеУчитывать = Истина;
			КонецЦикла;
			
			МассивСумма = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Выборка.Стоимость, МассивКоэффициентов, 2);

			// Запись полученных значений в таблицу.
			КоличествоСтрок = МассивСтрокДопЗатратыШаблона.Количество();
			Для Индекс = 0 По КоличествоСтрок - 1 Цикл
				МассивСтрокДопЗатратыШаблона[Индекс].Стоимость = МассивСумма[Индекс];
			КонецЦикла; 
		
		КонецЕсли;
		
	КонецЦикла;
	
	Выборка.Сбросить();
	
	// Проходим выборку второй раз и нераспределенные на предыдущем этапе строки распределяем на остальные виды операций.
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОперацииПроектнойЗадачи", Выборка.ВидОперации);
		Отбор.Вставить("ВидОперации", Выборка.ВидОперации);		
		Отбор.Вставить("СтатьяЗатрат", Выборка.СтатьяЗатрат);
		
		МассивСтрокДопЗатратыШаблона = ТаблицаДопЗатратЗадач.НайтиСтроки(Отбор);
		
		Если МассивСтрокДопЗатратыШаблона.Количество() = 0 Тогда
			
			Отбор.Удалить("ВидОперации");
			Отбор.Вставить("НеУчитывать", Ложь);
			
			МассивСтрокДопЗатратыШаблона = ТаблицаДопЗатратЗадач.НайтиСтроки(Отбор);
			
			Если МассивСтрокДопЗатратыШаблона.Количество() = 0 Тогда
				
				// Данные будут записаны в дополнительную проектную задачу.
				СтруктураДанныеДополнительнойПроектнойЗадачи = ДанныеДополнительнойПроектнойЗадачи.Получить(Выборка.ВидОперации);
				Если СтруктураДанныеДополнительнойПроектнойЗадачи = Неопределено Тогда
					СтруктураДанныеДополнительнойПроектнойЗадачи = СформироватьСтруктуруДанныхДополнительнойПроектнойЗадачи();
					ДанныеДополнительнойПроектнойЗадачи.Вставить(Выборка.ВидОперации, СтруктураДанныеДополнительнойПроектнойЗадачи);
				КонецЕсли;
				Если СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаДопЗатратЗадач = Неопределено Тогда
					СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаДопЗатратЗадач = ТаблицаДопЗатратЗадач.СкопироватьКолонки();
				КонецЕсли;
				СтрокаДопЗатраты = СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаДопЗатратЗадач.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДопЗатраты, Выборка);
				
			Иначе			
				
				// Получение коэффициентов для распределения (по количеству часов в шаблоне).
				МассивКоэффициентов = Новый Массив;
				Для Каждого СтрокаДопЗатратыШаблона Из МассивСтрокДопЗатратыШаблона Цикл
					МассивКоэффициентов.Добавить(СтрокаДопЗатратыШаблона.Стоимость);
				КонецЦикла;
				
				МассивСумма = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Выборка.Стоимость, МассивКоэффициентов, 2);

				// Запись полученных значений в таблицу.
				КоличествоСтрок = МассивСтрокДопЗатратыШаблона.Количество();
				Для Индекс = 0 По КоличествоСтрок - 1 Цикл
					МассивСтрокДопЗатратыШаблона[Индекс].Стоимость = МассивСумма[Индекс];
				КонецЦикла;
					
				КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
				   
КонецПроцедуры

Процедура СкорректироватьТаблицуМатериаловПоРасчетуЦеныКонтракта(ТаблицаМатРесурсовЗадач, 
																	ДанныеДополнительнойПроектнойЗадачи,
																	РасчетЦеныКонтракта)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Оборудование КАК Ресурс,
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.ВидОперации КАК ВидОперации,
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Ссылка.Валюта КАК Валюта,
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Оборудование.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	               |	СУММА(упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Количество) КАК Количество,
	               |	СУММА(упоРасчетЦеныКонтрактаОборудованиеПродаваемое.ЦенаЗакупки) КАК Стоимость,
				   |	СУММА(упоРасчетЦеныКонтрактаОборудованиеПродаваемое.СтоимостьЗакупкиCIP) КАК СтоимостьЗакупкиCIP,
	               |	СУММА(упоРасчетЦеныКонтрактаОборудованиеПродаваемое.СуммаТаможенныхПлатежей) КАК СуммаТаможенныхПлатежей
	               |ИЗ
	               |	Документ.упоРасчетЦеныКонтракта.ОборудованиеПродаваемое КАК упоРасчетЦеныКонтрактаОборудованиеПродаваемое
	               |ГДЕ
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Ссылка = &РасчетЦеныКонтракта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Оборудование,
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Ссылка.Валюта,
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.ВидОперации,
	               |	упоРасчетЦеныКонтрактаОборудованиеПродаваемое.Оборудование.ЕдиницаИзмерения";
				   
	Запрос.УстановитьПараметр("РасчетЦеныКонтракта", РасчетЦеныКонтракта);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		// Проверим заполнение необходимых реквизитов.
		
		Если Не ЗначениеЗаполнено(Выборка.Валюта) Тогда 
			ШаблонСообщения = НСтр("ru = 'Необходимо заполнить значение реквизита ""Валюта"" в документе ""%1"".
				|Разворачивание шаблона прервано.'");	
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, РасчетЦеныКонтракта);			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ЕдиницаНормирования) Тогда 
			ШаблонСообщения = НСтр("ru = 'Необходимо заполнить значение реквизита ""Единица измерения"" в карточке номенклатуры ""%1"".
				|Разворачивание шаблона прервано.'");	
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Выборка.Ресурс);			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.Стоимость) Тогда 
			ШаблонСообщения = НСтр("ru = 'По номенклатуре ""%1"" в документе ""%2"" не заполнена ""Цена закупки (EXW)"" .
				|Разворачивание шаблона прервано.'");	
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Выборка.Ресурс, РасчетЦеныКонтракта);			
		КонецЕсли;
		
		// Изменение стоимости оборудования по Расчету цены контракта.
		
		// Отбор по виду операции и роли.
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОперации", Выборка.ВидОперации);
		Отбор.Вставить("Ресурс", Выборка.Ресурс);
		
		МассивСтрокМатРесурсыШаблона = ТаблицаМатРесурсовЗадач.НайтиСтроки(Отбор);
		
		Если МассивСтрокМатРесурсыШаблона.Количество() = 0 Тогда
			
			// Данные будут записаны в дополнительную проектную задачу.
			СтруктураДанныеДополнительнойПроектнойЗадачи = ДанныеДополнительнойПроектнойЗадачи.Получить(Выборка.ВидОперации);
			Если СтруктураДанныеДополнительнойПроектнойЗадачи = Неопределено Тогда
				СтруктураДанныеДополнительнойПроектнойЗадачи = СформироватьСтруктуруДанныхДополнительнойПроектнойЗадачи();
				ДанныеДополнительнойПроектнойЗадачи.Вставить(Выборка.ВидОперации, СтруктураДанныеДополнительнойПроектнойЗадачи);
			КонецЕсли;
			Если СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаМатРесурсовЗадач = Неопределено Тогда
				СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаМатРесурсовЗадач = ТаблицаМатРесурсовЗадач.СкопироватьКолонки();
				СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаМатРесурсовЗадач.Колонки.Добавить("ОбщСтоимость");
			КонецЕсли;
			СтрокаОборудование = СтруктураДанныеДополнительнойПроектнойЗадачи.ТаблицаМатРесурсовЗадач.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОборудование, Выборка);
			СтрокаОборудование.Стоимость = Выборка.Стоимость;
			СтрокаОборудование.ОбщСтоимость = Выборка.Количество * Выборка.Стоимость;
			
			СтрокаОборудование.СпособПривязкиПотребности = 
				ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиПоставокИСубпродуктов.НачалоЗадачи");
			
		Иначе  			

			МассивСтрокМатРесурсыШаблона[0].Количество = Выборка.Количество;			
			//МассивСтрокМатРесурсыШаблона[0].Стоимость = Выборка.СтоимостьЗакупкиCIP + Выборка.СуммаТаможенныхПлатежей;
			МассивСтрокМатРесурсыШаблона[0].СтоимостьЕд = Выборка.Стоимость;
			МассивСтрокМатРесурсыШаблона[0].Стоимость = Выборка.Количество * Выборка.Стоимость;
		
		КонецЕсли;
	
	КонецЦикла;
				   
КонецПроцедуры

Процедура СоздатьДополнительнуюПроектнуюЗадачу(ДанныеДополнительнойПроектнойЗадачи, ПараметрыИмпорта, МассивЗадач,
	КорневаяЗадача)

	ВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	РеквизитыПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыИмпорта.Проект, 
		"ПрофильРасходовПоУмолчанию, СтатьяЗатратПоУмолчанию");
	
	СтатьяЗатратПоУмолчанию = РеквизитыПроекта.СтатьяЗатратПоУмолчанию;
	СпособПривязкиДиРПоУмолчанию = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения; 
	ПрофильДиРПоУмолчанию = РеквизитыПроекта.ПрофильРасходовПоУмолчанию;
	Если Не ЗначениеЗаполнено(ПрофильДиРПоУмолчанию) Тогда 
		ВыборкаПрофилей = Справочники.упоПрофилиРаспределенияДоходовИРасходов.Выбрать();
		Если ВыборкаПрофилей.Следующий() Тогда
			ПрофильДиРПоУмолчанию = ВыборкаПрофилей.Ссылка;
		КонецЕсли;
	КонецЕсли;	
	
	Для Каждого ВидОперации Из ДанныеДополнительнойПроектнойЗадачи Цикл
	
		Задача = Документы.упоПроектнаяЗадача.СоздатьДокумент();
		
		// Свойства задач.
		Задача.Дата 							= ТекущаяДата();
		Задача.НазваниеПроектнойЗадачи 			= ?(ЗначениеЗаполнено(ВидОперации.Ключ), Строка(ВидОперации.Ключ), "Вид операции не заполнен");
		Задача.Проект 							= ПараметрыИмпорта.Проект;
		Задача.ЭтоПакетРабот 					= Истина;
		Задача.ЭтоМодельПакетаРабот 			= Истина;
		Задача.ТипПроектнойЗадачи 				= ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
		Задача.ВидОперации						= ВидОперации.Ключ;
		Задача.МетодРасчетаМоделиПакетаРабот	= ПредопределенноеЗначение("Перечисление.упоМетодРасчетаСроковМоделиПакетаРабот.ПоДлительности");
		Задача.ЕдиницаНормированияДлительности 	= ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.Час");
		Задача.ЗадачаРодитель					= КорневаяЗадача;
		
		// Материальные ресурсы.
		МатРесурсы = ВидОперации.Значение.ТаблицаМатРесурсовЗадач;		
		Если МатРесурсы <> Неопределено Тогда
			Для Каждого СтрокаМатРесурса Из МатРесурсы Цикл
					
				ЗаполнитьЗначенияСвойств(Задача.МатериальныеРесурсы.Добавить(), СтрокаМатРесурса);				
												
				// Трансляция в фин.планы.				
				НоваяСтрока = Задача.ПланРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатРесурса);
				НоваяСтрока.Статья = СтрокаМатРесурса.СтатьяЗатрат;
				НоваяСтрока.Сумма = СтрокаМатРесурса.ОбщСтоимость;	
				Если Не ЗначениеЗаполнено(НоваяСтрока.Статья) Тогда
					НоваяСтрока.Статья = СтатьяЗатратПоУмолчанию;
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(НоваяСтрока.СпособПривязки) Тогда
					НоваяСтрока.СпособПривязки = СпособПривязкиДиРПоУмолчанию;
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(НоваяСтрока.ПрофильРаспределения) Тогда
					НоваяСтрока.ПрофильРаспределения = ПрофильДиРПоУмолчанию;
				КонецЕсли;

			КонецЦикла;							
		КонецЕсли;
		
		// Трудозатраты.
		
		МаксимумТрудозатраты = 0;		
		ТрудовыеРесурсы = ВидОперации.Значение.ТаблицаТрудовыхРесурсовЗадач;
		Если ТрудовыеРесурсы <> Неопределено Тогда
			Для Каждого СтрокаРесурс Из ТрудовыеРесурсы Цикл 
				НоваяСтрока = Задача.ТрудовыеРесурсы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРесурс, , "Стоимость");
				НоваяСтрока.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
				НоваяСтрока.ПрофильРаспределения = ПредопределенноеЗначение("Справочник.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение");
				НоваяСтрока.ЕдиницаНормирования = ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.Час");
				НоваяСтрока.УровеньПланирования = ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Предварительный");
				НоваяСтрока.ОбщСтоимость = СтрокаРесурс.Стоимость;
				НоваяСтрока.Стоимость = ?(НоваяСтрока.Количество <> 0, НоваяСтрока.ОбщСтоимость / НоваяСтрока.Количество, 0);
				НоваяСтрока.ОбщВнешняяСтоимость = СтрокаРесурс.СуммаВнешняя;
				НоваяСтрока.ВнешняяСтоимость = ?(НоваяСтрока.Количество <> 0, НоваяСтрока.ОбщВнешняяСтоимость / НоваяСтрока.Количество, 0);
				МаксимумТрудозатраты = Макс(МаксимумТрудозатраты, НоваяСтрока.Количество);
			КонецЦикла;
		КонецЕсли;
		
		Задача.ДлительностьМоделиПакетаРабот = ?(МаксимумТрудозатраты = 0, 1, МаксимумТрудозатраты);
		
		// Доп.затраты.
			
		ДопЗатраты = ВидОперации.Значение.ТаблицаДопЗатратЗадач;			
		Если ДопЗатраты <> Неопределено Тогда
			Для Каждого СтрокаДопЗатрат Из ДопЗатраты Цикл
								
				ЗаполнитьЗначенияСвойств(Задача.ДополнительныеЗатраты.Добавить(), СтрокаДопЗатрат);
										
				// Трансляция в фин.планы.				
				НоваяСтрока = Задача.ПланРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДопЗатрат);
				НоваяСтрока.Статья = СтрокаДопЗатрат.СтатьяЗатрат;
				НоваяСтрока.Сумма = СтрокаДопЗатрат.Стоимость;
				НоваяСтрока.СпособПривязки = СпособПривязкиДиРПоУмолчанию;
				НоваяСтрока.ПрофильРаспределения = ПрофильДиРПоУмолчанию;
				НоваяСтрока.Валюта = ВалютаУправленческогоУчета;
				
			КонецЦикла;									
			Задача.СпособПривязкиДопЗатрат = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДопЗатрат.КЗавершениюЗадачи");			
		КонецЕсли;
		
		Задача.ДополнительныеСвойства.Вставить("НеЗеркалировать", Истина);
		Задача.Записать(РежимЗаписиДокумента.Запись);
		
		МассивЗадач.Добавить(Задача.Ссылка);
	
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьСтруктуруДанныхДополнительнойПроектнойЗадачи()

	ДанныеДополнительнойПроектнойЗадачи = Новый Структура;
	ДанныеДополнительнойПроектнойЗадачи.Вставить("СоздатьДополнительнуюЗадачу", Ложь);
	ДанныеДополнительнойПроектнойЗадачи.Вставить("ТаблицаТрудовыхРесурсовЗадач");
	ДанныеДополнительнойПроектнойЗадачи.Вставить("ТаблицаМатРесурсовЗадач");
	ДанныеДополнительнойПроектнойЗадачи.Вставить("ТаблицаДопЗатратЗадач");
	
	Возврат ДанныеДополнительнойПроектнойЗадачи;

КонецФункции

Процедура РассчитатьКодСДРДляЗадач(ТаблицаЗадач, Родитель, НачальныйКодСДР, ПроектИлиЭтап = Неопределено) 
	
	Если Не ЗначениеЗаполнено(ТаблицаЗадач) Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоПЗ = 0;
	
	ПервыйУровень = ПроектИлиЭтап <> Неопределено;
	
	Если ПервыйУровень Тогда
		
		ЭлементСпрПроекты = ПроектИлиЭтап;
		Если ТипЗнч(ЭлементСпрПроекты) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			ЭлементСпрПроекты = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(ЭлементСпрПроекты);
		КонецЕсли;
		
		ПроектныеЗадачиСКодамиСДР = ПолучитьТаблицуПроектныхЗадачСКодамиСДР(ЭлементСпрПроекты);		
		
		ПроектныеЗадачиСКодамиСДР.Индексы.Добавить("Родитель");
		
		Отбор = Новый Структура("Родитель", ЭлементСпрПроекты);		
		НайденныеСтрокиПЗ = ПроектныеЗадачиСКодамиСДР.НайтиСтроки(Отбор);
		
		КоличествоПЗ = НайденныеСтрокиПЗ.Количество();
		
	КонецЕсли;
	
	Отбор = Новый Структура("Родитель", Родитель);
	НайденныеСтроки = ТаблицаЗадач.НайтиСтроки(Отбор);	
	
	// Похожий функционал реализован в функции ЗаполнитьКодыСДРвДереве формы обработки упоУпрощенныйВводСтруктурыПроекта,
	// а также в упоПроектыИЗадачиВызовСервера.обОбновитьКодСДР.
	КоличествоСтрок = КоличествоПЗ + НайденныеСтроки.Количество();	
	ФорматУровня = ПолучитьФорматУровня(КоличествоСтрок);
	
	СледующийНомер = 1;
	
	Если ПервыйУровень Тогда		
		ПересчитатьКодыСДРПроектныхЗадач(ПроектныеЗадачиСКодамиСДР, НайденныеСтрокиПЗ, НачальныйКодСДР, СледующийНомер, ФорматУровня);		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкаЗадача = НайденныеСтроки[0].Владелец().Колонки.Найти("Задача");
	Если КолонкаЗадача = Неопределено Тогда
		ИмяКолонкиЗадачи = "ПроектнаяЗадача";
	Иначе
		ИмяКолонкиЗадачи = "Задача";
	КонецЕсли;
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		
		КодСДР = НачальныйКодСДР + Формат(СледующийНомер, ФорматУровня);
		Строка.КодСДР = КодСДР;
		СледующийНомер = СледующийНомер + 1;
		
		РассчитатьКодСДРДляЗадач(ТаблицаЗадач, Строка[ИмяКолонкиЗадачи], КодСДР + ".");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПровестиЗадачуСЗаполненнымКодомСДР(Задача, проведенныеЗадачи, Индикатор, 
			ДатаНачалаДляЗадачБезСроков, ТаблицаЗадач)

	Отбор = Новый Структура("Задача", Задача);
	НайденныеСтроки = ТаблицаЗадач.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() <> 0 Тогда		
		ПровестиЗадачу(Задача, проведенныеЗадачи, Индикатор, ДатаНачалаДляЗадачБезСроков,
			ТаблицаЗадач, НайденныеСтроки[0].КодСДР);		
	КонецЕсли;
	
КонецПроцедуры
 
Функция ПолучитьТаблицуПроектныхЗадачСКодамиСДР(ПроектИлиПроектнаяЗадача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Проекты.Ссылка КАК ПроектнаяЗадачаЗеркало,
	|	Проекты.КодСДР КАК КодСДР,
	|	Проекты.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Родитель В ИЕРАРХИИ(&ПроектИлиПроектнаяЗадача)
	|	И НЕ Проекты.СсылкаНаПроектнуюЗадачу = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
	|	И НЕ Проекты.ПометкаУдаления
	|	И НЕ Проекты.ЗадачаОтменена
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСДР";
	
	МассивПроектов = Новый Массив;
	МассивПроектов.Добавить(ПроектИлиПроектнаяЗадача);
	
	Запрос.УстановитьПараметр("ПроектИлиПроектнаяЗадача", МассивПроектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();		

КонецФункции // ()

Процедура ПересчитатьКодыСДРПроектныхЗадач(Таблица, НайденныеСтроки, НачальныйКодСДР, СледующийНомер, ФорматУровня)

	Для Каждого Строка Из НайденныеСтроки Цикл	
		
		НовыйКодСДР = НачальныйКодСДР + Формат(СледующийНомер, ФорматУровня);
		
		Если Строка.КодСДР <> НовыйКодСДР Тогда
			
			ПЗЗеркало = Строка.ПроектнаяЗадачаЗеркало.ПолучитьОбъект();
			ПЗЗеркало.КодСДР = НовыйКодСДР;
			ПЗЗеркало.Записать();
			
			Отбор = Новый Структура("Родитель", Строка.ПроектнаяЗадачаЗеркало);
			НайденныеСтрокиТаблицы = Таблица.НайтиСтроки(Отбор);
			
			ПромежуточныйФорматУровня = ПолучитьФорматУровня(НайденныеСтрокиТаблицы.Количество());		
			
			ПересчитатьКодыСДРПроектныхЗадач(Таблица, НайденныеСтрокиТаблицы, НовыйКодСДР + ".", 1, ПромежуточныйФорматУровня);
			
		КонецЕсли;
		
		СледующийНомер = СледующийНомер + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьФорматУровня(КоличествоСтрок) 
	
	КоличествоЦифр = СтрДлина(Формат(КоличествоСтрок, "ЧГ="));
	
	Возврат "ЧЦ=" + КоличествоЦифр + "; ЧВН=; ЧГ=";	
	
КонецФункции

#КонецОбласти

#Область ПроксиМетодыРасширений

// Служебный метод. Используется в расширении упоBIM.
//
Функция Расширяемый_ЗаписатьДанныеШаблонаВПроект(ЕстьОшибка, ПараметрыИмпорта, ДанныеШаблона, Индикатор, ТекстОшибки)
	
	// Алгоритм обработки расширения.
	
	ДанныеЗаписаныВРасширении = Ложь;
	
	Возврат ДанныеЗаписаныВРасширении;
	
КонецФункции

#КонецОбласти

Функция ПолучитьШаблоныППДляСубпродуктов(СубпродуктыЗадачи, ПроектнаяЗадача, ЭтоСохранениеВШаблон) 
    
	СоответствиеШаблоновПП = Новый Соответствие; 
	МассивПП = Новый Массив;
	МассивИсключений = Новый Массив;
	
	Для Каждого Субпродукт Из СубпродуктыЗадачи Цикл
		МассивПП.Добавить(Субпродукт.Ресурс);		
	КонецЦикла;
	
	РеквизитыПП = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивПП, "ШаблонПроектнойПродукции, Шаблон");
	
	Для каждого ПроектнаяПродукция Из МассивПП Цикл		
				
		Если ЭтоСохранениеВШаблон Тогда 
			
			Если ЗначениеЗаполнено(РеквизитыПП[ПроектнаяПродукция].ШаблонПроектнойПродукции) Тогда
				СоответствиеШаблоновПП.Вставить(ПроектнаяПродукция, РеквизитыПП[ПроектнаяПродукция].ШаблонПроектнойПродукции);
			Иначе
				МассивИсключений.Добавить(ПроектнаяПродукция);
			КонецЕсли;
			
		Иначе
			
			Если РеквизитыПП[ПроектнаяПродукция].Шаблон Тогда
				СоответствиеШаблоновПП.Вставить(ПроектнаяПродукция, РеквизитыПП[ПроектнаяПродукция].Шаблон);
			Иначе
				МассивИсключений.Добавить(ПроектнаяПродукция);
            КонецЕсли;

		КонецЕсли;
				
	КонецЦикла;
	
	ОбработатьСообщениеИсключений(МассивИсключений, ПроектнаяЗадача, ЭтоСохранениеВШаблон);
	
	Возврат СоответствиеШаблоновПП;
  
КонецФункции

Функция ПредставлениеПроектнойЗадачи(ПроектнаяЗадача)
	
	МассивПЗ = Новый Массив;
	МассивПЗ.Добавить(ПроектнаяЗадача);
	НазванияПроектныхЗадач = упоПроектыИЗадачиСервер.НазванияПроектныхЗадач(МассивПЗ);
	ПредставлениеПЗ = НазванияПроектныхЗадач.Получить(ПроектнаяЗадача);
	
	Возврат ПредставлениеПЗ;

КонецФункции 

Процедура ОбработатьСообщениеИсключений(МассивИсключений, ПроектнаяЗадача, ЭтоСохранениеВШаблон)
	
	Если Не ЗначениеЗаполнено(МассивИсключений) Тогда
		Возврат;	
	КонецЕсли;
	
    Если ЭтоСохранениеВШаблон Тогда
    	
    	ПредставлениеПЗ = ПредставлениеПроектнойЗадачи(ПроектнаяЗадача);
 
    	ТекстСообщения = 
    		СтрШаблон(НСтр("ru = 'В проектной задаче ""%1"" проектная продукция 
    			|%2 
    			|не может быть выгружена по причине: не заполнен реквизит ""Шаблон ПП"".'"),		
    			ПредставлениеПЗ,
    			(СтрСоединить(МассивИсключений, Символы.ПС)));
    	
    Иначе
    	
    	ТекстСообщения =
    		СтрШаблон(НСтр("ru = 'Для проектной задачи ""%1"" проектная продукция 
    			|%2
    			|не развернута по причине: проектная продукция не является шаблоном.'"),
    	        ПроектнаяЗадача.Наименование,
    	        (СтрСоединить(МассивИсключений, Символы.ПС)));
    			    	
    КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

Функция УдаленаСтрокаПроектнойПродукции(ЭтоЗадачаПП, СоответствиеШаблоновПП, Субпродукт, ТаблицаРаспределения)
	
	СтрокаУдалена = Ложь;
	
	Если ЭтоЗадачаПП Тогда
		
		ШаблонПП = СоответствиеШаблоновПП.Получить(Субпродукт.Ресурс);
		
		Если Не ЗначениеЗаполнено(ШаблонПП) Тогда
			
			СтрокиРаспределенияПЗ = ТаблицаРаспределения.НайтиСтроки(Новый Структура("Задача", Субпродукт.Задача));
			СтрокиРаспределения = упоПроектыИЗадачиОбщие.ПолучитьСтрокиРаспределенияПоПодразделениям(Субпродукт, 
				СтрокиРаспределенияПЗ);
			
			Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл					
				ТаблицаРаспределения.Удалить(СтрокаРаспределения);
			КонецЦикла;
			
			СтрокаУдалена = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаУдалена;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьПоДаннымПроектнойПродукции(ДанныеПроекта)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	ДанныеПроекта.ТаблицаРаспределениеОбъемовЗадач.Колонки.Добавить("ПроцентРаспределения", ТипЧисло);
 	ДанныеПроекта.ТаблицаРаспределениеОбъемовЗадач.Колонки.Добавить("КоэффициентСложности", ТипЧисло);
 	ДанныеПроекта.ТаблицаРаспределениеОбъемовЗадач.Колонки.Добавить("Трудоемкость", ТипЧисло);
	ДанныеПроекта.ТаблицаРаспределениеОбъемовЗадач.Колонки.Добавить("Нормирование", ТипЧисло);
		
	СписокСвойств = "ПроцентРаспределения, Количество, КоэффициентСложности, Трудоемкость, Нормирование";
	Для Каждого СтрокаПП Из ДанныеПроекта.ТаблицаСубпродуктовЗадач Цикл
        
        Если Не ТипЗнч(СтрокаПП.Ресурс) = Тип("СправочникСсылка.упоПроектнаяПродукция") Тогда
            Продолжить;	
        КонецЕсли;
        
		Для Каждого СтрокаРоли Из СтрокаПП.Ресурс.РолиТР Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Роль", СтрокаРоли.РольТР);
			ПараметрыОтбора.Вставить("Подразделение", СтрокаРоли.Подразделение);
			ПараметрыОтбора.Вставить("ИндексСтрокиВладельца", СтрокаПП.ИндексСтрокРаспределения);
			ПараметрыОтбора.Вставить("Задача", СтрокаПП.Задача);
			СтрокиРаспределения = ДанныеПроекта.ТаблицаРаспределениеОбъемовЗадач.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокиРаспределения.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокиРаспределения[0], СтрокаРоли, СписокСвойств);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
