&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.Описание0.Доступность = ДоступноРедактированиеФайла(ТипЗнч(ВладелецФайла), "");  //[+] ИКТ №20078 (строка ДОБАВЛЕНА), Новоселов, 29.07.2026 
	
КонецПроцедуры

//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 29.07.2026 
&НаКлиентеНаСервереБезКонтекста
&Вместо("ДоступныеКомандыФормы")
Функция Расш1_ДоступныеКомандыФормы(Форма)
	
	ИменаКоманд = ПродолжитьВызов(Форма);
	
	ТипВладельцаФайла = ТипЗнч(Форма);
	АвторФайла = "";  // В этой форме автор недоступен
	Если Не ДоступноРедактированиеФайла(ТипВладельцаФайла, АвторФайла) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ИменаКоманд, "Редактировать");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ИменаКоманд, "СохранитьИзменения");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ИменаКоманд, "Занять");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ИменаКоманд, "Освободить");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ИменаКоманд, "ОбновитьИзФайлаНаДиске");
	КонецЕсли;
	
	Возврат ИменаКоманд;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступноРедактированиеФайла(ТипВладельцаФайла, АвторФайла)
	
	Автор = ?(ТипЗнч(АвторФайла) = Тип("Строка"), Справочники.Пользователи.НайтиПоНаименованию(АвторФайла), АвторФайла);
	
	Если Автор = Пользователи.ТекущийПользователь() Тогда
		Возврат Истина;
	ИначеЕсли Автор = Справочники.Пользователи.ПустаяСсылка() Тогда
		Общегоназначения.СообщитьПользователю("Не удалось установить связь автора файла с пользователем системы!");
	КонецЕсли;
	
	Если ТипВладельцаФайла = Тип("СправочникСсылка.Проекты") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектов");
	ИначеЕсли ТипВладельцаФайла = Тип("ДокументСсылка.упоПроектнаяЗадача")
			Или ТипВладельцаФайла = Тип("СправочникСсылка.упоЗадания") Тогда
		Возврат Пользователи.РолиДоступны("ИКТ_РедактированиеПрисоединенныхФайловПроектныхЗадачЗаданий");
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции
//[+]} ИКТ №20612
