#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет документ по основанию.
//
// Параметры:
//  Объект			 - ДокументСсылка.упоСинхронизацияФактическихДвиженийДенежныхСредств - заполняемый документ.
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - ПЗ, на основании которой заполняется документ.
//  Версия			 - ДокументСсылка.упоВерсияПланаПроекта - версия плана проекта.
//
Процедура ЗаполнитьДокументПоОснованию(Объект, ПроектнаяЗадача, Версия = Неопределено) Экспорт 
	
	Объект.ДвиженияДенежныхСредств.Очистить();
	ПараметрыЗапроса = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
	ПараметрыЗапроса.Вставить("Версия", Версия);
	
	// простой режим - забираем данные из текущего плана		
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РегПлан.СтатьяДДС,
		|	РегПлан.НаправлениеДвижения,
		|	РегПлан.Контрагент,
		|	РегПлан.Договор,
		|	РегПлан.Валюта,
		|	РегПлан.ДатаДвижения,
		|	СУММА(РегПлан.СуммаВалютная) КАК Сумма
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &ПроектнаяЗадача
		|				И Версия = &Версия) КАК РегПлан
		|ГДЕ
		|	РегПлан.СуммаВалютная > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РегПлан.ДатаДвижения,
		|	РегПлан.Договор,
		|	РегПлан.Валюта,
		|	РегПлан.Контрагент,
		|	РегПлан.НаправлениеДвижения,
		|	РегПлан.СтатьяДДС";
	
	// извлекаем данные запросом
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	// и переливаем их в табличную часть	
	Для Каждого СтрокаТЗ Из ТаблицаЗапроса Цикл
		
		НоваяСтрока = Объект.ДвиженияДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоСинхронизацияФактическихДвиженийДенежныхСредств);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли