#Область ПрограммныйИнтерфейс

// Выполнить изменение данных программы
//
// Параметры:
//  ПараметрыФормыНастроек                          - Структура:
//  * УровеньПланирования                           - ПеречислениеСсылка.упоУровеньПланирования
//  * АктуализироватьПланВыплатДС                   - Булево
//  * АктуализироватьПланВыпускаПоДоходам           - Булево
//  * АктуализироватьПланДоходов                    - Булево
//  * АктуализироватьПланПоступленийДС              - Булево
//  * АктуализироватьПланРасходов                   - Булево
//  * АктуализироватьТрудозатраты                   - Булево
//  * ВерсияПроекта                                 - ДокументСсылка.упоВерсияПланаПроекта
//  * ДатаСтартаПроекта                             - Дата - нужна для расчета сроков новых ПЗ в структуре программы.
//  * ЗадачиАктуализации                            - Массив
//  * ЗадачиАктуализацииРЦК                         - Массив
//  * МассивВерсий                                  - Массив
//  * МассивРЦК                                     - Соответствие - соответствие проектной задачи (с заполненным подчиненным проектом) и её документа РЦК.
//  * Проект                                        - СправочникСсылка.Проекты
//  * ТекущаяВерсия                                 - ДокументСсылка.упоВерсияПланаПроекта
//  * ПроектнаяЗадачаПриемник                       - ДокументСсылка.упоПроектнаяЗадача
//  * ПроектнаяЗадачаПриемникПерспективныхОбъемов   - ДокументСсылка.упоПроектнаяЗадача
//  * РабочийКалендарьПроекта                       - СправочникСсылка.упоРабочиеКалендари
//  * РодителиЗадач                                 - Соответствие
//  * СписокОтменяемыхЗадач                         - Массив
Процедура ВыполнитьИзменениеДанныхПрограммы(ПараметрыАктуализации) Экспорт
	
	ПроектнаяЗадачаПриемник = Неопределено;
	ПроектнаяЗадачаПриемникПерспективныхОбъемов = Неопределено;
	ЗадачиАктуализации = Неопределено;
	ПараметрыАктуализации.Свойство("ПроектнаяЗадачаПриемник", ПроектнаяЗадачаПриемник);
	ПараметрыАктуализации.Свойство("ЗадачиАктуализации", ЗадачиАктуализации);
	ПараметрыАктуализации.Свойство("ПроектнаяЗадачаПриемникПерспективныхОбъемов", ПроектнаяЗадачаПриемникПерспективныхОбъемов);
	
	ЗадачиАктуализации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЗадачиАктуализации);
	
	ВерсияКорневогоПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПараметрыАктуализации.Проект);
	
	НачатьТранзакцию();
	
	Попытка
		Если ПараметрыАктуализации.Свойство("СписокОтменяемыхЗадач") Тогда
			ОтменитьПроектныеЗадачиПриАктуализации(ПараметрыАктуализации.Проект, ПараметрыАктуализации.ТекущаяВерсия,
				ПараметрыАктуализации.СписокОтменяемыхЗадач);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПроектнаяЗадачаПриемник) И ЗначениеЗаполнено(ЗадачиАктуализации) Тогда
			АктуализируемыеЗадачи =
				ПолучитьСоздатьАктуализируемыеЗадачиИИзменитьТипЗадачиПриемника(ПроектнаяЗадачаПриемник,
					ЗадачиАктуализации, ПараметрыАктуализации, ПараметрыАктуализации.РодителиЗадач);
			
			АктуализироватьДанныеПрограммыПроектов(ВерсияКорневогоПроекта,
				АктуализируемыеЗадачи, ПараметрыАктуализации);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПроектнаяЗадачаПриемникПерспективныхОбъемов) Тогда
			АктуализироватьДанныеПрограммыПроектовПоРЦК(ВерсияКорневогоПроекта, ПроектнаяЗадачаПриемникПерспективныхОбъемов,
				ПараметрыАктуализации);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СообщениеОшибки = ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Актуализация программы по проектам'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Во время выполнения действия произошла неизвестная ошибка.'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение(СообщениеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Актуализировать данные структуры по подчиненным проектам. Актуализируются сроки и план доходов.
//
// Параметры:
//  ВерсияПрограммы - ДокументСсылка.упоВерсияПланаПроекта - Версия актуализируемой программы.
//  ПараметрыАктуализации - Структура:
//      * АктуализироватьПланДоходов - Булево
//  СписокЗадач - Массив Из ДокументСсылка.упоПроектнаяЗадача - Задачи актуализируемой программы.
//
Процедура АктуализироватьСтруктуруПоПодчиненнымПроектам(ВерсияПрограммы, ПараметрыАктуализации, СписокЗадач) Экспорт
	
	ДокументСохранения = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ДокументСохранения.Проект = ВерсияПрограммы.Проект;
	ДокументСохранения.Комментарий = НСтр("ru = 'Документ создан автоматически при актуализации данных по подчиненным проектам.'", "ru");
	
	АктуализироватьПланДоходов = Неопределено;
	ПараметрыАктуализации.Свойство("АктуализироватьПланДоходов", АктуализироватьПланДоходов);
	АктуализироватьПланДоходов = ?(АктуализироватьПланДоходов = Неопределено, Ложь, АктуализироватьПланДоходов);
	
	ПараметрыОчистки = Новый Структура;
	ПараметрыОчистки.Вставить("ОчищатьПланДоходов", АктуализироватьПланДоходов);
	
	ОчиститьДанныеПроектныхЗадач(ВерсияПрограммы, СписокЗадач, ПараметрыОчистки);
	
	СвойстваПроектныхЗадачСоответствие =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПрограммы,
			СписокЗадач);
	СлужебныеКоллекции = Новый Структура("СписокЗадач, СвойстваПроектныхЗадачСоответствие", СписокЗадач, СвойстваПроектныхЗадачСоответствие);
	
	АктуализироватьДоходыСтруктурыПоПодчиненнымПроектам(ВерсияПрограммы, ДокументСохранения, Ложь, СлужебныеКоллекции);
	
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(ВерсияПрограммы.Проект, Истина, ВерсияПрограммы);
	ДанныеПоПодчиненным = ПолучитьДанныеСроковИГотовностиПоПодчиненным(ВерсияПрограммы.Проект, ДатаСтартаПроекта, СписокЗадач,
			ВерсияПрограммы);
	СвойстваПроектныхЗадачСоответствие =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПрограммы);
	АктуализироватьСрокиИПроцентГотовностиЗадач(ВерсияПрограммы.Проект, ДокументСохранения, ДанныеПоПодчиненным, СвойстваПроектныхЗадачСоответствие);
	
	ЕстьДанныеДляЗаписи = ПроверитьНаличиеДанныхВДокументеСохраненияДанныхПроекта(ДокументСохранения);
	
	Если Не ЕстьДанныеДляЗаписи Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСохранения.Дата = ТекущаяДатаСеанса();
	ДокументСохранения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

// Структура параметров актуализации по умолчанию
//
// Возвращаемое значение:
//  ПараметрыАктуализации - Структура:
//  * АктуализироватьБДР - Булево
//  * АктуализироватьТрудозатраты - Булево
//  * АктуализироватьПланВыпускаПоДоходам - Булево
//  * УровеньПланирования - ПеречислениеСсылка.упоУровеньПланирования
//
Функция СтруктураПараметровАктуализацииПоУмолчанию() Экспорт
	
	ПараметрыАктуализации = Новый Структура();
	ПараметрыАктуализации.Вставить("УровеньПланирования", Перечисления.упоУровеньПланирования.Предварительный);
	ПараметрыАктуализации.Вставить("АктуализироватьБДР", Ложь);
	ПараметрыАктуализации.Вставить("АктуализироватьТрудозатраты", Ложь);
	ПараметрыАктуализации.Вставить("АктуализироватьПланВыпускаПоДоходам", Ложь);
	ПараметрыАктуализации.Вставить("АктуализироватьПланРасходов", Ложь);
	ПараметрыАктуализации.Вставить("АктуализироватьПланПоступленийДС", Ложь);
	ПараметрыАктуализации.Вставить("АктуализироватьПланВыплатДС", Ложь);
	
	Возврат ПараметрыАктуализации;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получить, создать актуализируемые задачи и изменить тип задачи-приемника.
//
// Параметры:
//  ПроектнаяЗадачаПриемник - ДокументСсылка.упоПроектнаяЗадача
//  ВыбранныеЗадачи - Массив Из СправочникСсылка.Проекты - источники данных для актуализации.
//  ДопПараметры - Структура:
//  * Проект - СправочникСсылка.Проекты - актуализируемая программа.
//  РодителиЗадач - Соответствие
//
// Возвращаемое значение:
//  Массив - Существующие и созданные задачи актуализируемой структуры проекта.
//
Функция ПолучитьСоздатьАктуализируемыеЗадачиИИзменитьТипЗадачиПриемника(ПроектнаяЗадачаПриемник, ВыбранныеЗадачи, ДопПараметры, РодителиЗадач) Экспорт
	
	ИзменитьТипЗадачиКудаЭтап(ПроектнаяЗадачаПриемник);
	
	Возврат ПолучитьАктуализируемыеЗадачиИЗаполнитьДопПараметры(ПроектнаяЗадачаПриемник, ВыбранныеЗадачи, ДопПараметры, РодителиЗадач);
	
КонецФункции

Процедура ОчиститьДанныеПроектныхЗадач(ВерсияПрограммы, СписокЗадач, ПараметрыОчистки = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СписокЗадач) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОчистки = Неопределено Тогда
		ПараметрыОчистки = Новый Структура;
	КонецЕсли;
	
	СвойстваПроектныхЗадачСоответствие =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПрограммы, СписокЗадач);
	
	УровеньПланированияТрудозатрат = Неопределено;
	ПараметрыОчистки.Свойство("УровеньПланированияТрудозатрат", УровеньПланированияТрудозатрат);
	УровеньПланированияТрудозатрат = ?(УровеньПланированияТрудозатрат = Неопределено, Перечисления.упоУровеньПланирования.ПустаяСсылка(),
			УровеньПланированияТрудозатрат);
	ОчищатьТрудовыеРесурсы = ПараметрыОчистки.Свойство("ОчищатьТрудовыеРесурсы") И ПараметрыОчистки.ОчищатьТрудовыеРесурсы;
	ОчищатьПланДоходов = ПараметрыОчистки.Свойство("ОчищатьПланДоходов") И ПараметрыОчистки.ОчищатьПланДоходов;;
	ОчищатьСубпродукты = ПараметрыОчистки.Свойство("ОчищатьСубпродукты") И ПараметрыОчистки.ОчищатьСубпродукты;
	ОчищатьПланРасходов = ПараметрыОчистки.Свойство("ОчищатьПланРасходов") И ПараметрыОчистки.ОчищатьПланРасходов;
	ОчищатьПланПоступленийДС = ПараметрыОчистки.Свойство("ОчищатьПланПоступленийДС") И ПараметрыОчистки.ОчищатьПланПоступленийДС;
	ОчищатьПланВыплатДС = ПараметрыОчистки.Свойство("ОчищатьПланВыплатДС") И ПараметрыОчистки.ОчищатьПланВыплатДС;
	
	НетПлановДляОчистки = Не ОчищатьТрудовыеРесурсы И Не ОчищатьПланДоходов И Не ОчищатьСубпродукты И Не ОчищатьПланРасходов И Не ОчищатьПланПоступленийДС
		И Не ОчищатьПланВыплатДС;
	Если НетПлановДляОчистки Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСохранения = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ДокументСохранения.Проект = ВерсияПрограммы.Проект;
	ДокументСохранения.Комментарий = НСтр("ru = 'Документ создан автоматически при актуализации данных по подчиненным проектам. Очистка данных'", "ru");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("текВерсия", ВерсияПрограммы);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	Запрос.УстановитьПараметр("УровеньПланированияТрудозатрат", УровеньПланированияТрудозатрат);
	
	ТекстЗапроса = ТекстЗапросаДанныеПЗДляОчистки();
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если ОчищатьТрудовыеРесурсы Тогда
		СоответствиеТЧТрудозатраты = Новый Соответствие();
		СоответствиеТЧТрудозатраты.Вставить("ТрудовыеРесурсыРоли", РезультатЗапроса[4].Выгрузить());
		СоответствиеТЧТрудозатраты.Вставить("ТрудовыеРесурсыРолиПоПериодам", РезультатЗапроса[5].Выгрузить());
		ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, "ПерезаписатьТрудовыеРесурсыРоли",
			СоответствиеТЧТрудозатраты);
	КонецЕсли;
	
	Если ОчищатьПланДоходов Тогда
		СоответствиеТЧПланДоходов = Новый Соответствие();
		СоответствиеТЧПланДоходов.Вставить("ПланДоходов", РезультатЗапроса[6].Выгрузить());
		СоответствиеТЧПланДоходов.Вставить("ПланДоходовПоПодразделениям", РезультатЗапроса[8].Выгрузить());
		СоответствиеТЧПланДоходов.Вставить("ПланДоходовПоПериодам", РезультатЗапроса[9].Выгрузить());
		ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, "ПерезаписатьПланДоходов", СоответствиеТЧПланДоходов);
	КонецЕсли;
	
	Если ОчищатьСубпродукты Тогда
		// Очистим выборочно данные трансляции ролей проектной продукции.
		Запрос.Текст = ТекстЗапросаДанныеТрансляцииТрудозатратПоПроектнойПродукции();
		ДанныеТрансляцииТрудозатратИзСубпродуктов = Запрос.ВыполнитьПакет();
		ТрудовыеРесурсыРоли = ДанныеТрансляцииТрудозатратИзСубпродуктов[1].Выгрузить();
		ТрудовыеРесурсыРолиПоПериодам = ДанныеТрансляцииТрудозатратИзСубпродуктов[2].Выгрузить();
		
		СоответствиеТЧТрудозатраты = Новый Соответствие();
		СоответствиеТЧТрудозатраты.Вставить("ТрудовыеРесурсыРоли", ТрудовыеРесурсыРоли);
		СоответствиеТЧТрудозатраты.Вставить("ТрудовыеРесурсыРолиПоПериодам", ТрудовыеРесурсыРолиПоПериодам);
		ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, "ПерезаписатьТрудовыеРесурсыРоли", СоответствиеТЧТрудозатраты);
		
		// Отключим трансляцию затрат из субпродуктов и установим тип "Номенклатура".
		Для каждого ДанныеСвойств Из СвойстваПроектныхЗадачСоответствие Цикл
			СвойстваПроектнойЗадачи = ДанныеСвойств.Значение;
			
			СтрокаСвойствПЗВДокументеСДП = ДокументСохранения.ПроектныеЗадачи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСвойствПЗВДокументеСДП, СвойстваПроектнойЗадачи);
			СтрокаСвойствПЗВДокументеСДП.ТранслироватьЗатратыПоСубпродуктам = Ложь;
			СтрокаСвойствПЗВДокументеСДП.ВключитьСубпродуктыВПланДоходов = Ложь;
			СтрокаСвойствПЗВДокументеСДП.ТипСубпродукта = Перечисления.упоТипСубпродукта.Номенклатура;
		КонецЦикла;
		
		// Очистим план выпуска.
		СоответствиеТЧОбъемы = Новый Соответствие();
		СоответствиеТЧОбъемы.Вставить("Субпродукты", РезультатЗапроса[0].Выгрузить());
		СоответствиеТЧОбъемы.Вставить("СубпродуктыПоПодразделениям", РезультатЗапроса[2].Выгрузить());
		ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, "ПерезаписатьСубпродукты", СоответствиеТЧОбъемы);
	КонецЕсли;
	
	Если ОчищатьПланРасходов Тогда
		СоответствиеТЧПланРасходов = Новый Соответствие();
		СоответствиеТЧПланРасходов.Вставить("ПланРасходов", РезультатЗапроса[10].Выгрузить());
		СоответствиеТЧПланРасходов.Вставить("ПланРасходовПоПодразделениям", РезультатЗапроса[12].Выгрузить());
		СоответствиеТЧПланРасходов.Вставить("ПланРасходовПоПериодам", РезультатЗапроса[13].Выгрузить());
		ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, "ПерезаписатьПланРасходов", СоответствиеТЧПланРасходов);
	КонецЕсли;
	
	Если ОчищатьПланПоступленийДС Тогда
		СоответствиеТЧПланПоступленийДС = Новый Соответствие();
		СоответствиеТЧПланПоступленийДС.Вставить("ДвиженияДенежныхСредств", РезультатЗапроса[14].Выгрузить());
		ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, "ПерезаписатьДвиженияДенежныхСредств", СоответствиеТЧПланПоступленийДС);
	КонецЕсли;
	
	Если ОчищатьПланВыплатДС Тогда
		СоответствиеТЧПланВыплатДС = Новый Соответствие();
		СоответствиеТЧПланВыплатДС.Вставить("ДвиженияДенежныхСредств", РезультатЗапроса[15].Выгрузить());
		ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, "ПерезаписатьДвиженияДенежныхСредств", СоответствиеТЧПланВыплатДС);
	КонецЕсли;
	
	ЕстьДанныеДляЗаписи = ПроверитьНаличиеДанныхВДокументеСохраненияДанныхПроекта(ДокументСохранения);
	
	Если Не ЕстьДанныеДляЗаписи Тогда
		Возврат;
	КонецЕсли;
			
	ДокументСохранения.Дата = ТекущаяДатаСеанса();
	ДокументСохранения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура УбратьНедоступныеКАктуализацииПоПодчиненнымПроектамЗадачи(ПроектныеЗадачи, Проект) Экспорт
	
	ВыводитьСообщениеОбОшибке = Истина;
	ПроектныеОпции = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	ЗапретитьРПЗИзменятьСрокиЧужихЗадач = ПроектныеОпции.ЗапретитьРПЗИзменятьСрокиЧужихЗадач;
	
	СтруктураСроковПроектныхЗадач = ТекущиеСрокиИСрокиПоПодчиненномуПроектуПроектнойЗадачи(ПроектныеЗадачи, Проект);
	
	// Данных для актуализации на дату старта проекта нет.
	Если Не ЗначениеЗаполнено(СтруктураСроковПроектныхЗадач) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексПоследнего = ПроектныеЗадачи.ВГраница();
	Пока ИндексПоследнего <> -1 Цикл
		ПроектнаяЗадача = ПроектныеЗадачи[ИндексПоследнего];
		
		// Проверим доступность по статусам.
		ЕстьОграниченияИзмененияТекущейЗадачи = упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(
				ПроектнаяЗадача, "Форма", , , Истина);
		Если ЕстьОграниченияИзмененияТекущейЗадачи Тогда
			ПроектныеЗадачи.Удалить(ИндексПоследнего);
			ИндексПоследнего = ИндексПоследнего - 1;
			Продолжить;
		КонецЕсли;
		
		// Проверим на доступность изменения сроков вышестоящих задач.
		Если Не ЗапретитьРПЗИзменятьСрокиЧужихЗадач Тогда
			ИндексПоследнего = ИндексПоследнего - 1;
			Продолжить;
		КонецЕсли;
		
		СрокиПроектнойЗадачи = СтруктураСроковПроектныхЗадач.Получить(ПроектнаяЗадача);
		Если СрокиПроектнойЗадачи = Неопределено Тогда
			ИндексПоследнего = ИндексПоследнего + 1;
			Продолжить;
		КонецЕсли;
		
		СрокиИзменились = СрокиПроектнойЗадачи.ДатаНачала <> СрокиПроектнойЗадачи.ДатаНачалаПодчиненного
			Или СрокиПроектнойЗадачи.ДатаЗавершения <> СрокиПроектнойЗадачи.ДатаЗавершенияПодчиненного;
		Если Не СрокиИзменились Тогда
			ИндексПоследнего = ИндексПоследнего - 1;
			Продолжить;
		КонецЕсли;
		
		НельзяИзменятьСрокиРодителя = Ложь;
		ПроверитьДоступностьИзмененияСроковПроектнойЗадачи(ПроектнаяЗадача, НельзяИзменятьСрокиРодителя, ВыводитьСообщениеОбОшибке);
		Если НельзяИзменятьСрокиРодителя Тогда
			ПроектныеЗадачи.Удалить(ИндексПоследнего);
		КонецЕсли;
		
		ИндексПоследнего = ИндексПоследнего - 1;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, доступна ли задача для актуализации программы по проектам.
//
// Параметры:
//  ПроектнаяЗадача                 - ДокументСсылка.упоПроектнаяЗадача
//  Проект                          - СправочникСсылка.Проекты
//  ИсточникДанныхДляАктуализации   - ДокументСсылка.упоВерсияПланаПроекта, ДокументСсылка.упоРасчетЦеныКонтракта
//  ЗапрещеноИзменятьСроки          - Булево - признак, рассчитывающийся в форме структуры проекта.
//  Отказ                           - Булево
//
Процедура ЗадачаДоступнаДляАктуализацииПрограммыПоПроектам(ПроектнаяЗадача,
		Проект,
		ИсточникДанныхДляАктуализации,
		ЗапрещеноИзменятьСроки,
		Отказ = Ложь) Экспорт
	
	// Если задача новая в списке на актуализацию, то выполним одну проверку на запрет изменения сроков.
	Если Не ЗначениеЗаполнено(ПроектнаяЗадача) И ЗапрещеноИзменятьСроки Тогда
		Отказ = Истина;
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		Отказ = Ложь;
		Возврат;
	КонецЕсли;
	
	// Сначала проверим, является ли текущий пользователь РПЗ.
	упоПроектыИЗадачиВызовСервера.обПроверитьПолномочияПользователяПроектнойЗадачи(ПроектнаяЗадача,
		Отказ, "", Ложь);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Теперь проверим разграничение по статусу.
	упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(
		ПроектнаяЗадача, , Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Наконец, узнаем, не влияет ли текущая задача на сроки родителя.
	Если Не ЗапрещеноИзменятьСроки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсточникДанныхДляАктуализации) Тогда
		Возврат;
	КонецЕсли;
	
	ПроектныеЗадачи = Новый Массив;
	ПроектныеЗадачи.Добавить(ПроектнаяЗадача);
	ЭтоРЦК = ТипЗнч(ИсточникДанныхДляАктуализации) = Тип("ДокументСсылка.упоРасчетЦеныКонтракта");
	Если ЭтоРЦК Тогда
		ВерсииПодчиненныхИлиРЦК = Новый Соответствие;
		ВерсииПодчиненныхИлиРЦК.Вставить(ПроектнаяЗадача, ИсточникДанныхДляАктуализации);
	Иначе
		ВерсииПодчиненныхИлиРЦК = Новый Массив;
		ВерсииПодчиненныхИлиРЦК.Добавить(ИсточникДанныхДляАктуализации);
	КонецЕсли;
	
	СтруктураСроковПроектныхЗадач = ТекущиеСрокиИСрокиПоПодчиненномуПроектуПроектнойЗадачи(ПроектныеЗадачи, Проект,
		ВерсииПодчиненныхИлиРЦК, ЭтоРЦК);
	СрокиПроектнойЗадачи = СтруктураСроковПроектныхЗадач.Получить(ПроектнаяЗадача);
	Если СрокиПроектнойЗадачи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СрокиИзменились = СрокиПроектнойЗадачи.ДатаНачала <> СрокиПроектнойЗадачи.ДатаНачалаПодчиненного
		Или СрокиПроектнойЗадачи.ДатаЗавершения <> СрокиПроектнойЗадачи.ДатаЗавершенияПодчиненного;
	Если Не СрокиИзменились Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьДоступностьИзмененияСроковПроектнойЗадачи(ПроектнаяЗадача, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Актуализировать данные программы проектов.
//
// Параметры:
//  ВерсияПрограммы - ДокументСсылка.упоВерсияПланаПроекта - Версия актуализируемой программы.
//  СписокЗадач - Массив Из ДокументСсылка.упоПроектнаяЗадача - Задачи актуализируемой программы.
//  СписокВерсий - Массив Из ДокументСсылка.упоВерсияПланаПроекта - Версии подчиненных проектов.
//  ПараметрыАктуализации - Структура:
//  * АктуализироватьБДР - Булево
//  * АктуализироватьТрудозатраты - Булево
//  * АктуализироватьПланВыпускаПоДоходам - Булево
//  * УровеньПланирования - ПеречислениеСсылка.упоУровеньПланирования
//
Процедура АктуализироватьДанныеПрограммыПроектов(ВерсияПрограммы, СписокЗадач, ПараметрыАктуализации)
	
	// Получим доп. параметры и проверим их заполнение.
	МассивВерсий = Неопределено;
	УровеньПланированияТрудозатрат = Неопределено;
	АктуализироватьПланДоходов = Неопределено;
	АктуализироватьПланВыпускаПоДоходам = Неопределено;
	АктуализироватьПланРасходов = Неопределено;
	АктуализироватьПланПоступленийДС = Неопределено;
	АктуализироватьПланВыплатДС = Неопределено;
	АктуализироватьТрудозатраты = Неопределено;
	АктуализироватьПланВыпуска = Неопределено;
	
	ПараметрыАктуализации.Свойство("МассивВерсий", МассивВерсий);
	ПараметрыАктуализации.Свойство("УровеньПланирования", УровеньПланированияТрудозатрат);
	ПараметрыАктуализации.Свойство("АктуализироватьПланДоходов", АктуализироватьПланДоходов);
	ПараметрыАктуализации.Свойство("АктуализироватьТрудозатраты", АктуализироватьТрудозатраты);
	ПараметрыАктуализации.Свойство("АктуализироватьПланВыпускаПоДоходам", АктуализироватьПланВыпускаПоДоходам);
	ПараметрыАктуализации.Свойство("АктуализироватьПланРасходов", АктуализироватьПланРасходов);
	ПараметрыАктуализации.Свойство("АктуализироватьПланПоступленийДС", АктуализироватьПланПоступленийДС);
	ПараметрыАктуализации.Свойство("АктуализироватьПланВыплатДС", АктуализироватьПланВыплатДС);
	ПараметрыАктуализации.Свойство("АктуализироватьПланВыпуска", АктуализироватьПланВыпуска);
	
	// Если параметры не были указаны, то устанавливаем их в Ложь.
	АктуализироватьПланДоходов = ?(АктуализироватьПланДоходов = Неопределено, Ложь, АктуализироватьПланДоходов);
	АктуализироватьПланВыпускаПоДоходам = ?(АктуализироватьПланВыпускаПоДоходам = Неопределено, Ложь, АктуализироватьПланВыпускаПоДоходам);
	АктуализироватьПланРасходов = ?(АктуализироватьПланРасходов = Неопределено, Ложь, АктуализироватьПланРасходов);
	АктуализироватьПланПоступленийДС = ?(АктуализироватьПланПоступленийДС = Неопределено, Ложь, АктуализироватьПланПоступленийДС);
	АктуализироватьПланВыплатДС = ?(АктуализироватьПланВыплатДС = Неопределено, Ложь, АктуализироватьПланВыплатДС);
	АктуализироватьТрудозатраты = ?(АктуализироватьТрудозатраты = Неопределено, Ложь, АктуализироватьТрудозатраты);
	АктуализироватьПланВыпуска = ?(АктуализироватьПланВыпуска = Неопределено, Ложь, АктуализироватьПланВыпуска);
	МассивВерсий = ?(МассивВерсий = Неопределено, Новый Массив, МассивВерсий);
	
	ПараметрыОчистки = Новый Структура;
	ПараметрыОчистки.Вставить("УровеньПланированияТрудозатрат", УровеньПланированияТрудозатрат);
	ПараметрыОчистки.Вставить("ОчищатьПланДоходов", АктуализироватьПланДоходов);
	ПараметрыОчистки.Вставить("ОчищатьСубпродукты", АктуализироватьПланВыпускаПоДоходам Или АктуализироватьПланВыпуска);
	ПараметрыОчистки.Вставить("ОчищатьТрудовыеРесурсы", АктуализироватьТрудозатраты);
	ПараметрыОчистки.Вставить("ОчищатьПланРасходов", АктуализироватьПланРасходов);
	ПараметрыОчистки.Вставить("ОчищатьПланПоступленийДС", АктуализироватьПланПоступленийДС);
	ПараметрыОчистки.Вставить("ОчищатьПланВыплатДС", АктуализироватьПланВыплатДС);
	
	ОчиститьДанныеПроектныхЗадач(ВерсияПрограммы, СписокЗадач, ПараметрыОчистки);
	
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(ВерсияПрограммы.Проект, Истина, ВерсияПрограммы);
	СрокиИПроцентГотовностиПодчиненныхПроектов = ПолучитьДанныеСроковИГотовностиПоПодчиненным(ВерсияПрограммы.Проект,
		ДатаСтартаПроекта, СписокЗадач, ВерсияПрограммы, МассивВерсий);
	СвойстваПроектныхЗадачСоответствие =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПрограммы, СписокЗадач);
	СлужебныеКоллекции = Новый Структура("СписокЗадач, СписокВерсий, СвойстваПроектныхЗадачСоответствие", СписокЗадач,
			МассивВерсий, СвойстваПроектныхЗадачСоответствие);
	
	ДокументСохранения = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ДокументСохранения.Проект = ВерсияПрограммы.Проект;
	ДокументСохранения.Комментарий = НСтр("ru = 'Документ создан автоматически при актуализации данных программы по подчиненным проектам.'", "ru");
	
	Если АктуализироватьПланДоходов Тогда
		НаправлениеБДР = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
		АктуализироватьПланДоходовРасходов(НаправлениеБДР, ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции);
	КонецЕсли;
	
	Если АктуализироватьПланВыпускаПоДоходам Тогда
		АктуализироватьСубпродукты(ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции, Истина);
	КонецЕсли;
	
	Если АктуализироватьПланРасходов Тогда
		НаправлениеБДР = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
		АктуализироватьПланДоходовРасходов(НаправлениеБДР, ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции);
	КонецЕсли;
	
	Если АктуализироватьПланПоступленийДС Тогда
		НаправлениеДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление;
		ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
		АктуализироватьПланПоступленийВыплатДС(ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции, НаправлениеДвижения, ВидЭлемента);
	КонецЕсли;
	
	Если АктуализироватьПланВыплатДС Тогда
		НаправлениеДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Выплата;
		ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
		АктуализироватьПланПоступленийВыплатДС(ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции, НаправлениеДвижения, ВидЭлемента);
	КонецЕсли;
	
	Если АктуализироватьТрудозатраты Тогда
		АктуализироватьТрудозатраты(ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции, УровеньПланированияТрудозатрат);
	КонецЕсли;
	
	Если АктуализироватьПланВыпуска Тогда
		АктуализироватьСубпродукты(ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции);
	КонецЕсли;
	
	// Актуализировать сроки.
	СвойстваПроектныхЗадачСоответствие =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПрограммы);
	АктуализироватьСрокиИПроцентГотовностиЗадач(ВерсияПрограммы.Проект, ДокументСохранения, СрокиИПроцентГотовностиПодчиненныхПроектов, СвойстваПроектныхЗадачСоответствие);
	
	ЕстьДанныеДляЗаписи = ПроверитьНаличиеДанныхВДокументеСохраненияДанныхПроекта(ДокументСохранения);
	
	Если Не ЕстьДанныеДляЗаписи Тогда
		Возврат;
	КонецЕсли;
		
	ДокументСохранения.Дата = ТекущаяДатаСеанса();
	ДокументСохранения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

// Актуализировать данные программы проектов по документам "Расчет цены контракта".
//
// Параметры:
//  ВерсияПрограммы			 - ДокументСсылка.упоВерсияПланаПроекта	 - Версия актуализируемой проекта-программы.
//  АктуализируемыйЭтап		 - ДокументСсылка.упоПроектнаяЗадача
//  ДанныеДляАктуализации	 - Структура
//  ДопПараметрыАктуализации - Структура
//
Процедура АктуализироватьДанныеПрограммыПроектовПоРЦК(ВерсияПрограммы, АктуализируемыйЭтап, ДанныеДляАктуализации)
	
	СписокПроектовРЦК = Неопределено;
	СписокДокументовРЦК = Неопределено;
	ДанныеДляАктуализации.Свойство("СписокПроектовРЦК", СписокПроектовРЦК);
	ДанныеДляАктуализации.Свойство("СписокДокументовРЦК", СписокДокументовРЦК);
	
	Если Не ЗначениеЗаполнено(СписокПроектовРЦК) Или Не ЗначениеЗаполнено(СписокДокументовРЦК) Тогда
		Возврат;
	КонецЕсли;
	
	РодителиЗадач = Неопределено;
	ДанныеДляАктуализации.Свойство("РодителиЗадач", РодителиЗадач);
	// Если параметры не были указаны, то устанавливаем инициализируем их как пустые массивы.
	РодителиЗадач = ?(РодителиЗадач = Неопределено, Новый Массив, РодителиЗадач);
	
	ДокументСохранения = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ДокументСохранения.Проект = ВерсияПрограммы.Проект;
	ДокументСохранения.Комментарий = НСтр("ru = 'Документ создан автоматически при актуализации данных по подчиненным проектам (РЦК).'", "ru");
	
	ПараметрыОчистки = Новый Структура;
	ПараметрыОчистки.Вставить("УровеньПланированияТрудозатрат", ДанныеДляАктуализации.УровеньПланирования);
	ПараметрыОчистки.Вставить("ОчищатьТрудовыеРесурсы", ДанныеДляАктуализации.АктуализироватьТрудозатраты);
	ПараметрыОчистки.Вставить("ОчищатьПланДоходов", ДанныеДляАктуализации.АктуализироватьПланДоходов);
	ПараметрыОчистки.Вставить("ОчищатьСубпродукты", ДанныеДляАктуализации.АктуализироватьПланВыпускаПоДоходам);
	
	ИзменитьТипЗадачиКудаЭтап(АктуализируемыйЭтап);
	
	СписокЗадачПоРЦК = ПолучитьАктуализируемыеЗадачиПоДокументамРЦК(АктуализируемыйЭтап, СписокПроектовРЦК,
			СписокДокументовРЦК, ДанныеДляАктуализации, РодителиЗадач);
	
	ОчиститьДанныеПроектныхЗадач(ВерсияПрограммы, СписокЗадачПоРЦК, ПараметрыОчистки);
	
	СлужебныеКоллекции = Новый Структура("СписокЗадач, СвойстваПроектныхЗадачСоответствие");
	СлужебныеКоллекции.Вставить("СписокЗадач", СписокЗадачПоРЦК);
	
	СвойстваПроектныхЗадачСоответствие =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПрограммы,
			СписокЗадачПоРЦК);
	СлужебныеКоллекции.Вставить("СвойстваПроектныхЗадачСоответствие", СвойстваПроектныхЗадачСоответствие);
	
	Если Не ЗначениеЗаполнено(СписокЗадачПоРЦК) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеДляАктуализации.АктуализироватьТрудозатраты Тогда
		АктуализироватьТрудозатратыПоДокументамРЦК(ВерсияПрограммы, ДокументСохранения, СписокЗадачПоРЦК,
			СписокДокументовРЦК, ДанныеДляАктуализации.УровеньПланирования);
	КонецЕсли;
	
	Если ДанныеДляАктуализации.АктуализироватьПланДоходов Тогда
		АктуализироватьПланДоходовПоДокументамРЦК(ВерсияПрограммы, ДокументСохранения, СписокЗадачПоРЦК,
			СписокДокументовРЦК, ДанныеДляАктуализации);
	КонецЕсли;
	
	Если ДанныеДляАктуализации.АктуализироватьПланВыпускаПоДоходам Тогда
		АктуализироватьСубпродуктыПоДокументамРЦК(ВерсияПрограммы, ДокументСохранения, СлужебныеКоллекции,
			СписокДокументовРЦК, ДанныеДляАктуализации);
	КонецЕсли;
	
	ДанныеСроковПроектныхЗадач = ДанныеСроковПроектныхЗадачПоРЦК(СписокЗадачПоРЦК, СписокДокументовРЦК);
	СвойстваПроектныхЗадачСоответствие =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ВерсияПрограммы);
	АктуализироватьСрокиИПроцентГотовностиЗадач(ВерсияПрограммы.Проект, ДокументСохранения, ДанныеСроковПроектныхЗадач,
		СвойстваПроектныхЗадачСоответствие, Истина);
	
	ЕстьДанныеДляЗаписи = ПроверитьНаличиеДанныхВДокументеСохраненияДанныхПроекта(ДокументСохранения);
	
	Если Не ЕстьДанныеДляЗаписи Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСохранения.Дата = ТекущаяДатаСеанса();
	ДокументСохранения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОтменитьПроектныеЗадачиПриАктуализации(Проект, ТекущаяВерсия, СписокПроектныхЗадач)
	
	Если Не ЗначениеЗаполнено(СписокПроектныхЗадач) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И ПроектнаяЗадача В (&СписокПроектныхЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("СписокПроектныхЗадач", СписокПроектныхЗадач);
	Запрос.УстановитьПараметр("ТекущаяВерсия", ТекущаяВерсия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДокументСохранение = Документы.упоСохранениеДанныхПроекта.ПолучитьОбъектДляСохраненияДанныхПроекта(Проект);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДокументСохранение.ПроектныеЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи); 
		НоваяСтрока.ЗадачаОтменена = Истина;
	КонецЦикла;
	
	ДокументСохранение.Комментарий = нСтр("ru='Создан автоматически при актуализации программы проекта.'", "ru");
	
	Попытка
		ДокументСохранение.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(нСтр("ru='Актуализация программы проектов.'", "ru"), УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнениеТЧДокументаСохраненияДляОчистки(ДокументСохранения, ИмяСвойстваПерезаписать, СоответствиеТЧ)
	
	ДокументСохранения[ИмяСвойстваПерезаписать] = Истина;
	
	Для каждого ТЧ Из СоответствиеТЧ Цикл
		Для каждого Строка Из ТЧ.Значение Цикл
			НоваяСтрока = ДокументСохранения[ТЧ.Ключ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьНаличиеДанныхВДокументеСохраненияДанныхПроекта(ДокументСохранения)
	
	ТабЧастиСДП = Метаданные.Документы.упоСохранениеДанныхПроекта.ТабличныеЧасти;
	
	ЕстьДанныеДляЗаписи = Ложь;
	
	Для каждого Таблица Из ТабЧастиСДП Цикл
		Если ЗначениеЗаполнено(ДокументСохранения[Таблица.Имя]) Тогда
			ЕстьДанныеДляЗаписи = Истина;
			Возврат ЕстьДанныеДляЗаписи;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьДанныеДляЗаписи;
	
КонецФункции

Процедура ПроверитьДоступностьИзмененияСроковПроектнойЗадачи(ПроектнаяЗадача, Отказ = Ложь, ВыводитьСообщение = Ложь)
	
	ЗадачаРодитель = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача, "ЗадачаРодитель");
	Если ЗначениеЗаполнено(ЗадачаРодитель) Тогда
		ПроверитьДоступностьИзмененияСроковПроектнойЗадачи(ЗадачаРодитель, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НазваниеПроектнойЗадачи = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача, "НазваниеЗадачи");
	ТекстСообщения = НСтр("ru = 'Невозможно актуализировать выбранные элементы по подчиненным, т.к. установлен запрет на изменение сроков чужих задач
			|(обнаружено вероятное изменение сроков задачи ""%1"").'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НазваниеПроектнойЗадачи);
	упоПроектыИЗадачиВызовСервера.обПроверитьПолномочияПользователяПроектнойЗадачи(ПроектнаяЗадача,
		Отказ, ТекстСообщения, ВыводитьСообщение);
	
КонецПроцедуры

Функция ТекущиеСрокиИСрокиПоПодчиненномуПроектуПроектнойЗадачи(ПроектныеЗадачи, Проект, ВерсииПодчиненныхИлиРЦК = Неопределено, ЭтоРЦК = Ложь)
	
	СтруктураТекущихСроковИСроковПоПодчиненным = Новый Соответствие;
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(Проект, Истина);
	ТекущаяВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	СрокиПроектныхЗадач =
		упоАктуализацияПроектаВызовСервера.СвойстваПроектныхЗадачДляИзмененияВДокументеСохранениеДанныхПроекта(ТекущаяВерсияПроекта,
			ПроектныеЗадачи);
	Если ЭтоРЦК Тогда
		СрокиПоПодчиненным = ДанныеСроковПроектныхЗадачПоРЦК(ПроектныеЗадачи, ВерсииПодчиненныхИлиРЦК);
	Иначе
		СрокиПоПодчиненным = ПолучитьДанныеСроковИГотовностиПоПодчиненным(Проект, ДатаСтартаПроекта,
			ПроектныеЗадачи, , ВерсииПодчиненныхИлиРЦК);
	КонецЕсли;
	
	Для каждого ДанныеПодчиненного Из СрокиПоПодчиненным Цикл
		СвойстваПроектнойЗадачи = СрокиПроектныхЗадач[ДанныеПодчиненного.ПроектнаяЗадача];
		
		Сроки = Новый Структура("ДатаНачала, ДатаЗавершения, ДатаНачалаПодчиненного, ДатаЗавершенияПодчиненного");
		Сроки.Вставить("ДатаНачала", СвойстваПроектнойЗадачи.ДатаНачалаПлан);
		Сроки.Вставить("ДатаЗавершения", СвойстваПроектнойЗадачи.ДатаЗавершенияПлан);
		Сроки.Вставить("ДатаНачалаПодчиненного", ДанныеПодчиненного.ДатаНачалаПлан);
		Сроки.Вставить("ДатаЗавершенияПодчиненного", ДанныеПодчиненного.ДатаЗавершенияПлан);
		
		СтруктураТекущихСроковИСроковПоПодчиненным.Вставить(ДанныеПодчиненного.ПроектнаяЗадача, Сроки);
	КонецЦикла;
	
	Возврат СтруктураТекущихСроковИСроковПоПодчиненным;
	
КонецФункции

#Область СозданиеИзменениеАктуализируемыхЗадач

Процедура ИзменитьРодителяПроектнойЗадачи(ВерсияПроекта, ПроектнаяЗадача, РодительПроектнойЗадачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &Версия
		|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Версия", ВерсияПроекта);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.ЗадачаРодитель = РодительПроектнойЗадачи Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.упоСвойстваПроектныхЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ПроектнаяЗадача);
	НоваяЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.ЗадачаРодитель = РодительПроектнойЗадачи;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	упоПроектыИЗадачиСервер.СоздатьОбновитьСвязанныйЭлементСправочникаПроекты(ПроектнаяЗадача.ПолучитьОбъект());
	
КонецПроцедуры

Процедура ИзменитьТипЗадачи(ПроектнаяЗадача, ТипЗадачиЭтап)
	
	ПроектнаяЗадачаОб = ПроектнаяЗадача.ПолучитьОбъект();
	ПроектнаяЗадачаОб.ПолучитьДанныеВерсии(Неопределено);
	ПроектнаяЗадачаОб.ТипПроектнойЗадачи = ТипЗадачиЭтап;
	ПроектнаяЗадачаОб.РучнойВводСроков = Истина;
	
	ЗаписатьПроектнуюЗадачу(ПроектнаяЗадачаОб);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоАктируемымЭтапамПоПолученнымТаблицам(ДанныеПоАктирЭтапам, ДоходыРасходы,
		РаспределениеПоПодразделениям)
	
	РеквизитыПоиска = "АктируемыйЭтап, Статья, ВидЭлемента, Контрагент, Договор, СпособПривязки, ДатаПривязки, Валюта, 
		|ИсточникПлана, ПрофильРаспределения";
	
	РаспределениеПоПодразделениям.Индексы.Добавить(РеквизитыПоиска);
	
	Отбор = Новый Структура(РеквизитыПоиска);
	ГруппировкаПоАктируемомуЭтапу = ДоходыРасходы.Строки;
	
	// Чтобы два раза не делать поиск по таблице РаспределениеПоПодразделениям, сразу заполним Индекс распределения
	Для Каждого СтрокаДерева Из ГруппировкаПоАктируемомуЭтапу Цикл
		
		ИндексРаспределения = 1;
		ТаблицаДоходов = ПолучитьПустуюТаблицуПоКолонкамЗаданногоПараметра(ДоходыРасходы);
		ТаблицаРаспределенияДоходов = ПолучитьПустуюТаблицуПоКолонкамЗаданногоПараметра(РаспределениеПоПодразделениям);
		Для Каждого Строка Из СтрокаДерева.Строки Цикл
			
			ЗаполнитьЗначенияСвойств(Отбор, Строка);
			
			НайденныеСтроки = РаспределениеПоПодразделениям.НайтиСтроки(Отбор);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ИндексСтрокиВладельца = ИндексРаспределения;
				СтрокаРаспределения = ТаблицаРаспределенияДоходов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределения, НайденнаяСтрока);
			КонецЦикла;
			Строка.ИндексСтрокРаспределения = ИндексРаспределения;
			
			СтрокаДоходовРасходов = ТаблицаДоходов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДоходовРасходов, Строка);
			
			ИндексРаспределения = ИндексРаспределения + 1;
			
		КонецЦикла;
		
		ДанныеАктируемогоЭтапа = Новый Структура;
		ДанныеАктируемогоЭтапа.Вставить("ТаблицаДоходов", ТаблицаДоходов);
		ДанныеАктируемогоЭтапа.Вставить("ТаблицаРаспределенияДоходов", ТаблицаРаспределенияДоходов);
		СтрокаТаблицы = ДанныеПоАктирЭтапам.Добавить();
		СтрокаТаблицы.АктируемыйЭтап = СтрокаДерева.АктируемыйЭтап;
		СтрокаТаблицы.ДанныеАктируемогоЭтапа = ДанныеАктируемогоЭтапа;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоАктируемымЭтапамРекурсивно(ПроектнаяЗадача, ДанныеПоПроекту, ДанныеПоАктируемымЭтапам,
		БылАктируемыйЭтап, ПервыйАктируемыйЭтап)
	
	Отбор = Новый Структура("ЗадачаРодитель", ПроектнаяЗадача);
	ЗадачиТекущегоУровня = ДанныеПоПроекту.НайтиСтроки(Отбор);
	
	Для Каждого Строка Из ЗадачиТекущегоУровня Цикл
		
		Если БылАктируемыйЭтап Тогда
			
			СтрокаДанныхАктЭтапов = ДанныеПоАктируемымЭтапам.Добавить();
			СтрокаДанныхАктЭтапов.АктируемыйЭтап = ПервыйАктируемыйЭтап;
			СтрокаДанныхАктЭтапов.БылАктируемыйЭтап = БылАктируемыйЭтап;
			СтрокаДанныхАктЭтапов.ПроектнаяЗадача = Строка.ПроектнаяЗадача;
			
			ЗаполнитьДанныеПоАктируемымЭтапамРекурсивно(Строка.ПроектнаяЗадача, ДанныеПоПроекту, ДанныеПоАктируемымЭтапам,
				БылАктируемыйЭтап, ПервыйАктируемыйЭтап);
			
		Иначе
			
			Если Строка.ЭтоАктируемаяЗадача Тогда
				
				ЗаполнитьДанныеПоАктируемымЭтапамРекурсивно(Строка.ПроектнаяЗадача, ДанныеПоПроекту, ДанныеПоАктируемымЭтапам,
					Истина, Строка.ПроектнаяЗадача);
				
				СтрокаДанныхАктЭтапов = ДанныеПоАктируемымЭтапам.Добавить();
				СтрокаДанныхАктЭтапов.АктируемыйЭтап = Строка.ПроектнаяЗадача;
				СтрокаДанныхАктЭтапов.БылАктируемыйЭтап = Истина;
				СтрокаДанныхАктЭтапов.ПроектнаяЗадача = Строка.ПроектнаяЗадача;
				
			Иначе
				
				ЗаполнитьДанныеПоАктируемымЭтапамРекурсивно(Строка.ПроектнаяЗадача, ДанныеПоПроекту, ДанныеПоАктируемымЭтапам,
					БылАктируемыйЭтап, ПервыйАктируемыйЭтап);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДопДанныеДляСозданияПЗ(Проект, ВерсияПроекта)
	
	РабочийКалендарьПроекта = Проект.ПолучитьОбъект().ПолучитьРабочийКалендарь();
	ЕдиницаНормированияДлительности = ПолучитьЕдиницаНормированияДлительности(Проект);
	ТипПроектнойЗадачи = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(Проект, Истина, ВерсияПроекта);
	
	ДопДанные = Новый Структура;
	ДопДанные.Вставить("Проект", Проект);
	ДопДанные.Вставить("ВерсияПроекта", ВерсияПроекта);
	ДопДанные.Вставить("РабочийКалендарьПроекта", РабочийКалендарьПроекта);
	ДопДанные.Вставить("ЕдиницаНормированияДлительности", ЕдиницаНормированияДлительности);
	ДопДанные.Вставить("ТипПроектнойЗадачи", ТипПроектнойЗадачи);
	ДопДанные.Вставить("ОбновленныеПЗ", Новый Соответствие);
	ДопДанные.Вставить("ТолькоОбновлениеЗадачи", Ложь);
	ДопДанные.Вставить("ДатаСтартаПроекта", ДатаСтартаПроекта);
	
	Возврат ДопДанные;
	
КонецФункции

Функция ПолучитьДетейЗаданнойЗадачи(ЗадачаРодитель, Версия)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПодчиненнаяПроектнаяЗадача
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = &ЗадачаРодитель
		|	И НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|	И НЕ упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача.СсылкаНаПроектнуюЗадачу ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ЗадачаРодитель", ЗадачаРодитель);
	Запрос.УстановитьПараметр("Версия", Версия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьЕдиницаНормированияДлительности(Проект)
	
	// Единица измерения скопировано из Обработки.упоЗагрузитьИзПодчиненныхПроектов.Форма.Форма
	ЗначенияРеквизитов = упоФункцииБСП.ПолучитьЗначенияРеквизитов(Проект, "упоЕдиницаВремениПоУмолчанию");
	
	Если ЗначенияРеквизитов.Количество() <> 0 Тогда
		ЕдиницаНормированияДлительности = ЗначенияРеквизитов.упоЕдиницаВремениПоУмолчанию;
	Иначе
		ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.Час;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЕдиницаНормированияДлительности) Тогда
		ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.Час;
	КонецЕсли;
	
	Возврат ЕдиницаНормированияДлительности;
	
КонецФункции

Функция ПолучитьПроектныеЗадачиДляАктуальныхПланов(ДанныеПоАктируемымЭтапам)
	
	ПроектныеЗадачи = Новый Массив;
	Для Каждого Строка Из ДанныеПоАктируемымЭтапам Цикл
		Если Строка.БылАктируемыйЭтап Тогда
			ПроектныеЗадачи.Добавить(Строка.ПроектнаяЗадача);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПроектныеЗадачи;
	
КонецФункции

Функция ПолучитьПроектныеЗадачиДляДанныхПланов(ДанныеПоАктируемымЭтапам)
	
	ПроектныеЗадачи = Новый Массив;
	Для Каждого Строка Из ДанныеПоАктируемымЭтапам Цикл
		Если Не Строка.БылАктируемыйЭтап Тогда
			ПроектныеЗадачи.Добавить(Строка.АктируемыйЭтап);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПроектныеЗадачи;
	
КонецФункции

Функция ПолучитьПустуюТаблицуПоКолонкамЗаданногоПараметра(Параметр)
	
	Таблица = Новый ТаблицаЗначений;
	Для Каждого КолонкаПараметра Из Параметр.Колонки Цикл
		КолонкиТаблицы = Таблица.Колонки;
		КолонкаТаблицы = КолонкиТаблицы.Добавить();
		ЗаполнитьЗначенияСвойств(КолонкаТаблицы, КолонкаПараметра);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура РасчитатьНовыеСроки(ПроектнаяЗадачаОб, АктируемыйЭтап, ДопДанные)
	
	РабочийКалендарьПроекта = ДопДанные.РабочийКалендарьПроекта;
	ДатаСтартаПроекта = ДопДанные.ДатаСтартаПроекта;
	
	ПроектнаяЗадачаОб.РучнойВводСроков = Истина;
	
	СрокиАктируемогоЭтапа = упоПроектыИЗадачиСервер.ПолучитьСрокиПроектнойЗадачи(АктируемыйЭтап);
	Если СрокиАктируемогоЭтапа.ДатаНачалаПлан <= ДатаСтартаПроекта Тогда
		ПроектнаяЗадачаОб.ДатаНачалаПлан = ДатаСтартаПроекта;
	Иначе
		ПроектнаяЗадачаОб.ДатаНачалаПлан = СрокиАктируемогоЭтапа.ДатаНачалаПлан;
	КонецЕсли;
	
	ПроектнаяЗадачаОб.ДатаЗавершенияПлан = СрокиАктируемогоЭтапа.ДатаЗавершенияПлан;
	
	ПроектнаяЗадачаОб.ДлительностьМоделиПакетаРабот = упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьДлительность(
			ПроектнаяЗадачаОб.ДатаНачалаПлан, ПроектнаяЗадачаОб.ДатаЗавершенияПлан,
			ПроектнаяЗадачаОб.ЕдиницаНормированияДлительности, ПроектнаяЗадачаОб.КалендарьЗадачи, РабочийКалендарьПроекта,
			Ложь,
			Новый Соответствие);
	
КонецПроцедуры

Процедура ОтменитьЗадачиЭтапаРодителя(ДетиПроектнойЗадачиРодителя, НайденныеЗадачиЭтапа, Проект, ОбновленныеПЗ)
	
	ТекущиеЗадачи = ДетиПроектнойЗадачиРодителя.ВыгрузитьКолонку("ПроектнаяЗадача");
	
	УдаляемыеЗадачи = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ТекущиеЗадачи, НайденныеЗадачиЭтапа);
	УдаляемыеЗадачи = ОбщегоНазначенияКлиентСервер.СвернутьМассив(УдаляемыеЗадачи);
	
	Если УдаляемыеЗадачи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого УдаляемаяЗадача Из УдаляемыеЗадачи Цикл
		ОбновленныеПЗ.Вставить(УдаляемаяЗадача, Истина);
	КонецЦикла;
	
	ОтменитьУдаляемыеЗадачи(УдаляемыеЗадачи, Проект);
	
КонецПроцедуры

Процедура ОтменитьУдаляемыеЗадачи(УдаляемыеЗадачи, Проект)
	
	ДокументСохранения = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ДокументСохранения.Дата = ТекущаяДатаСеанса();
	ДокументСохранения.Проект = Проект;
	
	ПроектныеЗадачи = ДокументСохранения.ПроектныеЗадачи;
	Для Каждого УдаляемаяЗадача Из УдаляемыеЗадачи Цикл
		
		Если Не ЗначениеЗаполнено(УдаляемаяЗадача) Тогда
			Продолжить;
		КонецЕсли;
		
		Строка = ПроектныеЗадачи.Добавить();
		Строка.ПроектнаяЗадача = УдаляемаяЗадача;
		Строка.ЗадачаОтменена = Истина;
		
	КонецЦикла;
	
	ДокументСохранения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ЗаписатьПроектнуюЗадачу(ПроектнаяЗадачаОб)
	
	Попытка
		ПроектнаяЗадачаОб.Дата = ТекущаяДатаСеанса();
		ПроектнаяЗадачаОб.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

#Область ПолучениеСпискаАктуализируемыхЗадач

Функция ПолучитьАктуализируемыеЗадачиИЗаполнитьДопПараметры(ПроектнаяЗадачаПриемник, ВыбранныеПроекты, ДопПараметры, РодителиЗадач)
	// Ищем существующие, создаём новые.
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаЗадачиСПодчиненными();
	
	ТекущаяВерсия = ДопПараметры.ТекущаяВерсия;
	
	Запрос.УстановитьПараметр("Версия", ТекущаяВерсия);
	Запрос.УстановитьПараметр("КорневойПроект", ДопПараметры.Проект);
	Запрос.УстановитьПараметр("ПодчиненныеПроекты", ВыбранныеПроекты);
	
	РезультатЗапроса = Запрос.Выполнить();
	СуществующиеПЗ = РезультатЗапроса.Выгрузить();
	
	ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.РабочийДень;
	ДопПараметры.Вставить("ЕдиницаНормированияДлительности", ЕдиницаНормированияДлительности);
	ТипПроектнойЗадачи = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
	ДопПараметры.Вставить("ТипПроектнойЗадачи", ТипПроектнойЗадачи);
	ДопПараметры.Вставить("ЗадачаРодитель", ПроектнаяЗадачаПриемник);
	
	// TODO передавать через доппараметры
	ПроектныеОпции = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ДопПараметры.Проект);
	ДопПараметры.Вставить("НормаСтоимостиТрудовыхРесурсов", ПроектныеОпции.НормаСтоимостиТрудовыхРесурсов);
	ДопПараметры.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", ПроектныеОпции.ВнешняяНормаСтоимостиТрудовыхРесурсов);
	
	АктуализируемыеЗадачи = Новый Массив;
	
	Для Каждого Проект Из ВыбранныеПроекты Цикл
		СтрокаПЗ = СуществующиеПЗ.Найти(Проект);
		
		Если СтрокаПЗ = Неопределено Тогда
			ЗадачаКуда = РодителиЗадач.Получить(Проект);
			Если ЗадачаКуда <> Неопределено Тогда
				ДопПараметры.Вставить("ЗадачаРодитель", ЗадачаКуда);
			КонецЕсли;
			
			СозданнаяЗадача = ПолучитьСсылкуСозданнойПЗ(Проект, ДопПараметры);
			Если ЗначениеЗаполнено(СозданнаяЗадача) Тогда
				АктуализируемыеЗадачи.Добавить(СозданнаяЗадача);
			КонецЕсли;
		Иначе
			ЗадачаКуда = РодителиЗадач.Получить(Проект);
			Если ЗадачаКуда <> Неопределено Тогда
				ДопПараметры.Вставить("ЗадачаРодитель", ЗадачаКуда);
			КонецЕсли;
			
			ИзменитьРодителяПроектнойЗадачи(ДопПараметры.ТекущаяВерсия, СтрокаПЗ.СуществующаяПроектнаяЗадача, ЗадачаКуда);
			АктуализируемыеЗадачи.Добавить(СтрокаПЗ.СуществующаяПроектнаяЗадача);
		КонецЕсли;
	КонецЦикла;
	
	Возврат АктуализируемыеЗадачи;
	
КонецФункции

Функция ПолучитьСсылкуСозданнойПЗ(ВыбранныйПроект, ДопПараметры)
	
	ТипПроектнойЗадачи = ДопПараметры.ТипПроектнойЗадачи;
	ЗадачаРодитель = ДопПараметры.ЗадачаРодитель;
	Проект = ДопПараметры.Проект;
	
	ЕдиницаНормированияДлительности = Неопределено;
	ДопПараметры.Свойство("ЕдиницаНормированияДлительности", ЕдиницаНормированияДлительности);
	Если Не ЗначениеЗаполнено(ЕдиницаНормированияДлительности) Тогда
		ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.РабочийДень;
	КонецЕсли;
	
	ПроектнаяЗадачаОб = Документы.упоПроектнаяЗадача.СоздатьДокумент();
	
	Если ВыбранныйПроект <> Неопределено Тогда
		ПроектнаяЗадачаОб.ПодчиненныйПроект = ВыбранныйПроект.Ссылка;
		ПроектнаяЗадачаОб.НазваниеПроектнойЗадачи = ВыбранныйПроект.Наименование;
	Иначе
		ПроектнаяЗадачаОб.НазваниеПроектнойЗадачи = ДопПараметры.НазваниеПроектнойЗадачи;
	КонецЕсли;
	
	ПроектнаяЗадачаОб.ТипПроектнойЗадачи = ТипПроектнойЗадачи;
	ПроектнаяЗадачаОб.ЗадачаРодитель = ЗадачаРодитель;
	ПроектнаяЗадачаОб.Проект = Проект;
	ПроектнаяЗадачаОб.ЕдиницаНормированияДлительности = ЕдиницаНормированияДлительности;
	ПроектнаяЗадачаОб.РучнойВводСроков = Истина;
	
	Если ДопПараметры.Свойство("ДатаНачалаПлан") И ДопПараметры.Свойство("ДатаЗавершенияПлан") Тогда
		РассчитатьДлительность(ПроектнаяЗадачаОб, ДопПараметры);
	Иначе
		РасчитатьНовыеСрокиСозданнойПЗ(ПроектнаяЗадачаОб, ЕдиницаНормированияДлительности, ДопПараметры);
	КонецЕсли;
	
	ДопПараметры.Свойство("РасчетЦеныКонтракта", ПроектнаяЗадачаОб.РасчетЦеныКонтракта);
	
	ЗаписатьПроектнуюЗадачу(ПроектнаяЗадачаОб);
	
	Возврат ПроектнаяЗадачаОб.Ссылка;
	
КонецФункции

Процедура РасчитатьНовыеСрокиСозданнойПЗ(ПроектнаяЗадачаОб, ЕдиницаНормированияДлительности, ДопПараметры)
	
	РабочийКалендарьПроекта = ДопПараметры.РабочийКалендарьПроекта;
	ДатаНачалаПлан = ДопПараметры.ДатаСтартаПроекта;
	
	Длительность = 1;
	КоличествоЧасовВМесяце = 160;
	ДлительностьВЧасах = Длительность * КоличествоЧасовВМесяце;
	КоэффициентЕдиницыНормирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаНормированияДлительности, "Коэффициент");
	ДлительностьЗадачи = ДлительностьВЧасах / ?(КоэффициентЕдиницыНормирования = 0, 1, КоэффициентЕдиницыНормирования);
	
	ПроектнаяЗадачаОб.ДатаНачалаПлан = ДатаНачалаПлан;
	ПроектнаяЗадачаОб.ДлительностьМоделиПакетаРабот = ДлительностьЗадачи;
	ПроектнаяЗадачаОб.ДатаЗавершенияПлан = упоРабочиеКалендариВызовСервера.обПолучитьКонецПериода(РабочийКалендарьПроекта,
			ДатаНачалаПлан, ДлительностьВЧасах);
	
КонецПроцедуры

Процедура РассчитатьДлительность(ПроектнаяЗадачаОб, ДопПараметры)
	
	РабочийКалендарьПроекта = ДопПараметры.РабочийКалендарьПроекта;
	ДатаНачала = ДопПараметры.ДатаНачалаПлан;
	ДатаЗавершения = ДопПараметры.ДатаЗавершенияПлан;
	
	РабочийКалендарь =
		упоРабочиеКалендариВызовСервера.ПолучитьРабочийКалендарьНаПериод(РабочийКалендарьПроекта, ДатаНачала, ДатаЗавершения, Истина);
	
	Если РабочийКалендарь <> Неопределено Тогда
		КоличествоДней = РабочийКалендарь.Количество();
	Иначе
		КоличествоДней = 1;
	КонецЕсли;
	
	ПроектнаяЗадачаОб.ДатаНачалаПлан = ДатаНачала;
	ПроектнаяЗадачаОб.ДлительностьМоделиПакетаРабот = КоличествоДней;
	ПроектнаяЗадачаОб.ДатаЗавершенияПлан = ДатаЗавершения;
	
КонецПроцедуры

Процедура ИзменитьТипЗадачиКудаЭтап(ПроектнаяЗадача)
	
	ТипЗадачи = упоПроектыИЗадачиСервер.ПолучитьТипПроектнойЗадачи(ПроектнаяЗадача);
	ТипЗадачиЭтап = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоТипПроектнойЗадачи.Этап");
	Если ТипЗадачи <> ТипЗадачиЭтап Тогда
		ИзменитьТипЗадачи(ПроектнаяЗадача, ТипЗадачиЭтап);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьАктуализируемыеЗадачиПоДокументамРЦК(ПроектнаяЗадачаКуда, ВыбранныеПроекты, СписокДокументовРЦК, ДопПараметры, РодителиЗадач)
	
	АктуализируемыеЗадачи = Новый Массив;
	ТипПроектнойЗадачи = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
	
	Для Каждого Проект Из ВыбранныеПроекты Цикл
		
		ДокРЦК = СписокДокументовРЦК.Получить(Проект);
		
		ТипДанных = ТипЗнч(Проект);
		Если ТипДанных = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			РодительКуда = РодителиЗадач.Получить(ДокРЦК);
			Если РодительКуда <> Неопределено Тогда
				ИзменитьРодителяПроектнойЗадачи(ДопПараметры.ТекущаяВерсия, Проект, РодительКуда)
			КонецЕсли;
			АктуализируемыеЗадачи.Добавить(Проект);
			СписокДокументовРЦК.Вставить(Проект, ДокРЦК);
		Иначе
			Если ДокРЦК <> Неопределено Тогда
				ДанныеРЦК = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокРЦК, "ДатаНачалаРаботПлан, ДатаОкончанияРаботПлан, ПредметКонкурса");
				ДопПараметры.Вставить("ДатаНачалаПлан", ДанныеРЦК.ДатаНачалаРаботПлан);
				ДопПараметры.Вставить("ДатаЗавершенияПлан", ДанныеРЦК.ДатаОкончанияРаботПлан);
				ДопПараметры.Вставить("НазваниеПроектнойЗадачи", ДанныеРЦК.ПредметКонкурса);
				ДопПараметры.Вставить("РасчетЦеныКонтракта", ДокРЦК);
				ЗадачаРодитель = РодителиЗадач.Получить(ДокРЦК);
				Если ЗадачаРодитель = Неопределено Тогда
					ЗадачаРодитель = ПроектнаяЗадачаКуда;
				КонецЕсли;
				ДопПараметры.Вставить("ЗадачаРодитель", ЗадачаРодитель);
				ДопПараметры.Вставить("ТипПроектнойЗадачи", ТипПроектнойЗадачи);
			КонецЕсли;
			
			ПодчиненныйПроект = Неопределено;
			Если ТипДанных = Тип("СправочникСсылка.Проекты") Тогда
				ПодчиненныйПроект = Проект;
			КонецЕсли;
			СозданнаяЗадача = ПолучитьСсылкуСозданнойПЗ(ПодчиненныйПроект, ДопПараметры);
			Если ЗначениеЗаполнено(СозданнаяЗадача) Тогда
				АктуализируемыеЗадачи.Добавить(СозданнаяЗадача);
				СписокДокументовРЦК.Вставить(СозданнаяЗадача, ДокРЦК);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат АктуализируемыеЗадачи;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ТекстыЗапросов

#Область АктуализацияСтруктурыПоПодчиненным

Функция ТекстЗапросаПолученияПодчиненныхЗадачДоходы()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПодчиненнаяПроектнаяЗадачаДокумент
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &Версия
		|				И &ОтборЗадач) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект <> &ПустаяСсылкаПроекта
		|	И НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПроектныеЗадачиПроектаДоходы()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоВерсииПроекта.Версия КАК Версия
		|ПОМЕСТИТЬ ТекущаяВерсияПроекта
		|ИЗ
		|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|ГДЕ
		|	упоВерсииПроекта.Проект = &Проект
		|	 &ОтборПоВерсиям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия В
		|				(ВЫБРАТЬ
		|					ТекущаяВерсияПроекта.Версия
		|				ИЗ
		|					ТекущаяВерсияПроекта)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДоходовДляАктуализацииСтруктурыПоПодчиненным()
	
	ТекстЗапрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья КАК Статья,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент КАК Контрагент,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор КАК Договор,
		|	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату) КАК СпособПривязки,
		|	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату) КАК СпособПривязкиРаспределения,
		|	&ИсточникПлана КАК ИсточникПлана,
		|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления, ДЕНЬ) КАК ДатаПривязки,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта КАК Валюта,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) КАК Сумма,
		|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
		|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество) КАК Количество,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд
		|ПОМЕСТИТЬ ДанныеПланаДоходовАктуальные
		|ИЗ
		|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			Версия В (&Версии)
		|				И ПроектнаяЗадача В (&ПроектныеЗадачиАктПланы)
		|				И ДатаНачисления >= &ДатаСтартаПроекта
		|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|				И ВЫБОР
		|					КОГДА &ОтделитьСубпродукты
		|						ТОГДА ИсточникПлана <> &ИсточникПланаОбъемы
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
		|ГДЕ
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор,
		|	ИсточникПлана,
		|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления, ДЕНЬ),
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоходыРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ДоходыРасходы.Статья КАК Статья,
		|	ДоходыРасходы.ВидЭлемента КАК ВидЭлемента,
		|	ДоходыРасходы.Контрагент КАК Контрагент,
		|	ДоходыРасходы.Договор КАК Договор,
		|	ДоходыРасходы.СпособПривязки КАК СпособПривязки,
		|	ДоходыРасходы.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДоходыРасходы.ДатаПривязки КАК ДатаПривязки,
		|	ДоходыРасходы.ПериодАгрегации КАК ПериодАгрегации,
		|	&ИсточникПлана КАК ИсточникПлана,
		|	ДоходыРасходы.Валюта КАК Валюта,
		|	ДоходыРасходы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	ДоходыРасходы.СуммаВалютная КАК Сумма
		|ПОМЕСТИТЬ ДанныеПланаДоходовРегистрыДанные
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
		|			,
		|			Версия В (&Версии)
		|				И ПроектнаяЗадача В (&ПроектныеЗадачиДанныеПланы)
		|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|				И ДатаПривязки >= &ДатаСтартаПроекта
		|				И НЕ ЭтоСубпродуктИлиПотребность) КАК ДоходыРасходы
		|ГДЕ
		|	(ДоходыРасходы.Сумма <> 0
		|			ИЛИ ДоходыРасходы.СуммаВалютная <> 0)
		|	И ВЫБОР
		|			КОГДА &ОтделитьСубпродукты
		|				ТОГДА ДоходыРасходы.ИсточникПлана <> &ИсточникПланаОбъемы
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязкиРаспределения,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма КАК Сумма,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество КАК Количество,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязкиРаспределения,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределенияРаспределения,
		|	&ИсточникПлана КАК ИсточникПлана,
		|	ДанныеПланаДоходовРегистрыДанные.Статья КАК Статья,
		|	ДанныеПланаДоходовРегистрыДанные.Контрагент КАК Контрагент,
		|	ДанныеПланаДоходовРегистрыДанные.Договор КАК Договор,
		|	ДанныеПланаДоходовРегистрыДанные.Валюта КАК Валюта,
		|	ДанныеПланаДоходовРегистрыДанные.ДатаПривязки КАК ДатаПривязки,
		|	ДанныеПланаДоходовРегистрыДанные.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДанныеПланаДоходовРегистрыДанные.СпособПривязки КАК СпособПривязки
		|ПОМЕСТИТЬ ДанныеПланаДоходовРегистрыДанныеПодразеделения
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			Версия В (&Версии)
		|				И ПроектнаяЗадача В (&ПроектныеЗадачиДанныеПланы)
		|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|				И ДатаНачисления >= &ДатаСтартаПроекта) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПланаДоходовРегистрыДанные КАК ДанныеПланаДоходовРегистрыДанные
		|		ПО упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача = ДанныеПланаДоходовРегистрыДанные.ПроектнаяЗадача
		|			И упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца = ДанныеПланаДоходовРегистрыДанные.ИндексСтрокРаспределения
		|ГДЕ
		|	(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
		|			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0
		|			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0)
		|	И ВЫБОР
		|			КОГДА &ОтделитьСубпродукты
		|				ТОГДА упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана <> &ИсточникПланаОбъемы
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПланаДоходовАктуальные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ДанныеПланаДоходовАктуальные.Статья КАК Статья,
		|	ДанныеПланаДоходовАктуальные.ВидЭлемента КАК ВидЭлемента,
		|	ДанныеПланаДоходовАктуальные.Контрагент КАК Контрагент,
		|	ДанныеПланаДоходовАктуальные.Договор КАК Договор,
		|	ДанныеПланаДоходовАктуальные.СпособПривязки КАК СпособПривязки,
		|	ДанныеПланаДоходовАктуальные.СпособПривязкиРаспределения КАК СпособПривязкиРаспределения,
		|	ДанныеПланаДоходовАктуальные.ИсточникПлана КАК ИсточникПлана,
		|	ДанныеПланаДоходовАктуальные.ДатаПривязки КАК ДатаПривязки,
		|	ДанныеПланаДоходовАктуальные.Валюта КАК Валюта,
		|	ДанныеПланаДоходовАктуальные.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	ДанныеПланаДоходовАктуальные.Подразделение КАК Подразделение,
		|	ДанныеПланаДоходовАктуальные.Роль КАК Роль,
		|	ДанныеПланаДоходовАктуальные.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	ДанныеПланаДоходовАктуальные.Сумма КАК Сумма,
		|	ДанныеПланаДоходовАктуальные.СуммаВалютная КАК СуммаВалютная,
		|	ДанныеПланаДоходовАктуальные.Количество КАК Количество,
		|	ДанныеПланаДоходовАктуальные.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	NULL КАК ПрофильРаспределения,
		|	NULL КАК ПрофильРаспределенияРаспределения,
		|	ДанныеПланаДоходовАктуальные.ДатаПривязки КАК ДатаПривязкиРаспределения
		|ПОМЕСТИТЬ ОбъединенныеДанные
		|ИЗ
		|	ДанныеПланаДоходовАктуальные КАК ДанныеПланаДоходовАктуальные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ПроектнаяЗадача,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Статья,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ВидЭлемента,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Контрагент,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Договор,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.СпособПривязки,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.СпособПривязкиРаспределения,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ИсточникПлана,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ДатаПривязки,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Валюта,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ЗаказДоговорПодрядчика,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Подразделение,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Роль,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.КонтрагентПодрядчик,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Сумма,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.СуммаВалютная,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.Количество,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.СобствСилы_Субподряд,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ПрофильРаспределения,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ПрофильРаспределенияРаспределения,
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения.ДатаПривязкиРаспределения
		|ИЗ
		|	ДанныеПланаДоходовРегистрыДанныеПодразеделения КАК ДанныеПланаДоходовРегистрыДанныеПодразеделения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоАктируемымЭтапам.АктируемыйЭтап КАК АктируемыйЭтап,
		|	ДанныеПоАктируемымЭтапам.ПроектнаяЗадача КАК ПроектнаяЗадача
		|ПОМЕСТИТЬ ПроектныеЗадачиАктируемыхЭтапов
		|ИЗ
		|	&ДанныеПоАктируемымЭтапам КАК ДанныеПоАктируемымЭтапам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроектныеЗадачиАктируемыхЭтапов.АктируемыйЭтап КАК АктируемыйЭтап,
		|	ОбъединенныеДанные.Статья КАК Статья,
		|	ОбъединенныеДанные.ВидЭлемента КАК ВидЭлемента,
		|	ОбъединенныеДанные.Контрагент КАК Контрагент,
		|	ОбъединенныеДанные.Договор КАК Договор,
		|	ОбъединенныеДанные.СпособПривязки КАК СпособПривязки,
		|	ОбъединенныеДанные.СпособПривязкиРаспределения КАК СпособПривязкиРаспределения,
		|	ОбъединенныеДанные.ИсточникПлана КАК ИсточникПлана,
		|	ОбъединенныеДанные.ДатаПривязки КАК ДатаПривязки,
		|	ОбъединенныеДанные.Валюта КАК Валюта,
		|	ОбъединенныеДанные.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	ОбъединенныеДанные.Подразделение КАК Подразделение,
		|	ОбъединенныеДанные.Роль КАК Роль,
		|	ОбъединенныеДанные.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	СУММА(ОбъединенныеДанные.Сумма) КАК Сумма,
		|	СУММА(ОбъединенныеДанные.СуммаВалютная) КАК СуммаВалютная,
		|	СУММА(ОбъединенныеДанные.Количество) КАК Количество,
		|	ОбъединенныеДанные.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ОбъединенныеДанные.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ОбъединенныеДанные.ПрофильРаспределенияРаспределения КАК ПрофильРаспределенияРаспределения,
		|	ОбъединенныеДанные.ДатаПривязкиРаспределения КАК ДатаПривязкиРаспределения
		|ПОМЕСТИТЬ ДанныеПоАктируемымЭтапам
		|ИЗ
		|	ПроектныеЗадачиАктируемыхЭтапов КАК ПроектныеЗадачиАктируемыхЭтапов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъединенныеДанные КАК ОбъединенныеДанные
		|		ПО ПроектныеЗадачиАктируемыхЭтапов.ПроектнаяЗадача = ОбъединенныеДанные.ПроектнаяЗадача
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбъединенныеДанные.Валюта,
		|	ОбъединенныеДанные.ЗаказДоговорПодрядчика,
		|	ОбъединенныеДанные.Роль,
		|	ОбъединенныеДанные.ИсточникПлана,
		|	ОбъединенныеДанные.Договор,
		|	ОбъединенныеДанные.КонтрагентПодрядчик,
		|	ОбъединенныеДанные.СобствСилы_Субподряд,
		|	ОбъединенныеДанные.ПрофильРаспределения,
		|	ОбъединенныеДанные.ВидЭлемента,
		|	ОбъединенныеДанные.ДатаПривязки,
		|	ОбъединенныеДанные.Подразделение,
		|	ОбъединенныеДанные.Статья,
		|	ОбъединенныеДанные.СпособПривязки,
		|	ОбъединенныеДанные.СпособПривязкиРаспределения,
		|	ПроектныеЗадачиАктируемыхЭтапов.АктируемыйЭтап,
		|	ОбъединенныеДанные.Контрагент,
		|	ОбъединенныеДанные.ПрофильРаспределенияРаспределения,
		|	ОбъединенныеДанные.ДатаПривязкиРаспределения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыРасходы.АктируемыйЭтап КАК АктируемыйЭтап,
		|	ДоходыРасходы.Статья КАК Статья,
		|	ДоходыРасходы.ВидЭлемента КАК ВидЭлемента,
		|	ДоходыРасходы.Контрагент КАК Контрагент,
		|	ДоходыРасходы.Договор КАК Договор,
		|	ДоходыРасходы.СпособПривязки КАК СпособПривязки,
		|	ДоходыРасходы.ДатаПривязки КАК ДатаПривязки,
		|	ДоходыРасходы.Валюта КАК Валюта,
		|	ДоходыРасходы.ИсточникПлана КАК ИсточникПлана,
		|	ДоходыРасходы.ПрофильРаспределения КАК ПрофильРаспределения,
		|	0 КАК ИндексСтрокРаспределения,
		|	СУММА(ДоходыРасходы.СуммаВалютная) КАК Сумма
		|ИЗ
		|	ДанныеПоАктируемымЭтапам КАК ДоходыРасходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО ДоходыРасходы.АктируемыйЭтап = Проекты.СсылкаНаПроектнуюЗадачу
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоходыРасходы.АктируемыйЭтап,
		|	Проекты.КодСДР,
		|	ДоходыРасходы.Статья,
		|	ДоходыРасходы.ВидЭлемента,
		|	ДоходыРасходы.Контрагент,
		|	ДоходыРасходы.Договор,
		|	ДоходыРасходы.СпособПривязки,
		|	ДоходыРасходы.ДатаПривязки,
		|	ДоходыРасходы.Валюта,
		|	ДоходыРасходы.ИсточникПлана,
		|	ДоходыРасходы.ПрофильРаспределения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Проекты.КодСДР
		|ИТОГИ ПО
		|	АктируемыйЭтап
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПланаДоходов.АктируемыйЭтап КАК АктируемыйЭтап,
		|	ДанныеПланаДоходов.Статья КАК Статья,
		|	ДанныеПланаДоходов.ВидЭлемента КАК ВидЭлемента,
		|	ДанныеПланаДоходов.Контрагент КАК Контрагент,
		|	ДанныеПланаДоходов.Договор КАК Договор,
		|	ДанныеПланаДоходов.СпособПривязки КАК СпособПривязки,
		|	ДанныеПланаДоходов.СпособПривязкиРаспределения КАК СпособПривязкиРаспределения,
		|	ДанныеПланаДоходов.ДатаПривязки КАК ДатаПривязки,
		|	ДанныеПланаДоходов.Валюта КАК Валюта,
		|	ДанныеПланаДоходов.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	ДанныеПланаДоходов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	ДанныеПланаДоходов.Подразделение КАК Подразделение,
		|	ДанныеПланаДоходов.Роль КАК Роль,
		|	ДанныеПланаДоходов.Сумма КАК Сумма,
		|	ДанныеПланаДоходов.СуммаВалютная КАК СуммаВалютная,
		|	ДанныеПланаДоходов.Количество КАК Количество,
		|	ДанныеПланаДоходов.ИсточникПлана КАК ИсточникПлана,
		|	0 КАК ИндексСтрокиВладельца,
		|	ДанныеПланаДоходов.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДанныеПланаДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ДанныеПланаДоходов.ПрофильРаспределенияРаспределения КАК ПрофильРаспределенияРаспределения,
		|	ДанныеПланаДоходов.ДатаПривязкиРаспределения КАК ДатаПривязкиРаспределения
		|ИЗ
		|	ДанныеПоАктируемымЭтапам КАК ДанныеПланаДоходов";
	
	Возврат ТекстЗапрос;
	
КонецФункции

#КонецОбласти

Функция ТекстЗапросаДанныеПоСрокамПодчиненных()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПодчиненнаяПроектнаяЗадача,
		|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК ЕстьПодчиненнаяПЗ
		|ПОМЕСТИТЬ ТаблицаПЗ
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			(&ВсеЗадачи
		|				ИЛИ ПроектнаяЗадача В (&МассивЗадач))
		|				И Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|	И НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ТаблицаПЗ.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|	упоВерсииПроекта.Версия КАК Версия,
		|	ТаблицаПЗ.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача,
		|	ТаблицаПЗ.ЕстьПодчиненнаяПЗ КАК ЕстьПодчиненнаяПЗ
		|ПОМЕСТИТЬ ТаблицаПЗСВерсиямиПодчиненныхПроектов
		|ИЗ
		|	ТаблицаПЗ КАК ТаблицаПЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО ТаблицаПЗ.ПодчиненныйПроект = упоВерсииПроекта.Проект
		|			&ОтборПоВерсиям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.Версия КАК Версия,
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|ПОМЕСТИТЬ ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ
		|ИЗ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов КАК ТаблицаПЗСВерсиямиПодчиненныхПроектов
		|ГДЕ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ЕстьПодчиненнаяПЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.Версия КАК Версия,
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|ПОМЕСТИТЬ ТаблицаПЗСВерсиямиПодчиненныхПроектовНетПодчиненнойПЗ
		|ИЗ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов КАК ТаблицаПЗСВерсиямиПодчиненныхПроектов
		|ГДЕ
		|	НЕ ТаблицаПЗСВерсиямиПодчиненныхПроектов.ЕстьПодчиненнаяПЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненныйПроект КАК Проект,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан >= &ДатаСтартаПроекта
		|				ТОГДА упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан
		|			ИНАЧЕ &ДатаСтартаПроекта
		|		КОНЕЦ) КАК НачалоПроекта,
		|	МАКСИМУМ(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан) КАК ЗавершениеПроекта
		|ПОМЕСТИТЬ ТаблицаСрокиПроектов
		|ИЗ
		|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия В
		|				(ВЫБРАТЬ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовНетПодчиненнойПЗ.Версия
		|				ИЗ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовНетПодчиненнойПЗ)) КАК упоСрокиПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПЗСВерсиямиПодчиненныхПроектов КАК ТаблицаПЗСВерсиямиПодчиненныхПроектов
		|		ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = ТаблицаПЗСВерсиямиПодчиненныхПроектов.Версия
		|ГДЕ
		|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан > &ДатаСтартаПроекта
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненныйПроект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВЫБОР
		|		КОГДА упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан >= &ДатаСтартаПроекта
		|			ТОГДА упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан
		|		ИНАЧЕ &ДатаСтартаПроекта
		|	КОНЕЦ КАК НачалоПроекта,
		|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ЗавершениеПроекта
		|ПОМЕСТИТЬ ТаблицаСрокиПЗ
		|ИЗ
		|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		|			,
		|			(Версия, ПроектнаяЗадача) В
		|				(ВЫБРАТЬ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ.Версия,
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ.ПодчиненнаяПроектнаяЗадача
		|				ИЗ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ)) КАК упоСрокиПроектныхЗадачСрезПоследних
		|ГДЕ
		|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан > &ДатаСтартаПроекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненныйПроект КАК Проект,
		|	МИНИМУМ(упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения) КАК ДатаЗавершения
		|ПОМЕСТИТЬ ФактическиеСрокиПроектов
		|ИЗ
		|	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия В
		|				(ВЫБРАТЬ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовНетПодчиненнойПЗ.Версия
		|				ИЗ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовНетПодчиненнойПЗ)) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПЗСВерсиямиПодчиненныхПроектов КАК ТаблицаПЗСВерсиямиПодчиненныхПроектов
		|		ПО упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.Версия = ТаблицаПЗСВерсиямиПодчиненныхПроектов.Версия
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненныйПроект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершения
		|ПОМЕСТИТЬ ФактическиеСрокиПЗ
		|ИЗ
		|	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
		|			,
		|			(Версия, ПроектнаяЗадача) В
		|				(ВЫБРАТЬ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ.Версия,
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ.ПодчиненнаяПроектнаяЗадача
		|				ИЗ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ)) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоПроцентыГотовностиПроектовСрезПоследних.Проект КАК Проект,
		|	ЕСТЬNULL(упоПроцентыГотовностиПроектовСрезПоследних.ПроцентГотовности, 0) КАК ПроцентГотовности
		|ПОМЕСТИТЬ ТаблицаГотовностьПроектов
		|ИЗ
		|	РегистрСведений.упоПроцентыГотовностиПроектов.СрезПоследних(
		|			,
		|			Версия В
		|				(ВЫБРАТЬ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектов.Версия КАК Версия
		|				ИЗ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовНетПодчиненнойПЗ КАК ТаблицаПЗСВерсиямиПодчиненныхПроектов)) КАК упоПроцентыГотовностиПроектовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) КАК ПроцентГотовности
		|ПОМЕСТИТЬ ТаблицаГотовностьПЗ
		|ИЗ
		|	РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
		|			,
		|			(Версия, ПроектнаяЗадача) В
		|				(ВЫБРАТЬ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектов.Версия КАК Версия,
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектов.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|				ИЗ
		|					ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ КАК ТаблицаПЗСВерсиямиПодчиненныхПроектов)) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ТаблицаГотовностьПроектов.ПроцентГотовности КАК ПроцентГотовности,
		|	ТаблицаСрокиПроектов.НачалоПроекта КАК НачалоПроекта,
		|	ТаблицаСрокиПроектов.ЗавершениеПроекта КАК ЗавершениеПроекта,
		|	ФактическиеСрокиПроектов.ДатаНачала КАК ДатаНачалаФакт,
		|	ФактическиеСрокиПроектов.ДатаЗавершения КАК ДатаЗавершенияФакт
		|ИЗ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектовНетПодчиненнойПЗ КАК ТаблицаПЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСрокиПроектов КАК ТаблицаСрокиПроектов
		|		ПО ТаблицаПЗ.ПодчиненныйПроект = ТаблицаСрокиПроектов.Проект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаГотовностьПроектов КАК ТаблицаГотовностьПроектов
		|		ПО ТаблицаПЗ.ПодчиненныйПроект = ТаблицаГотовностьПроектов.Проект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическиеСрокиПроектов КАК ФактическиеСрокиПроектов
		|		ПО ТаблицаПЗ.ПодчиненныйПроект = ФактическиеСрокиПроектов.Проект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПЗ.ПроектнаяЗадача,
		|	ТаблицаГотовностьПЗ.ПроцентГотовности,
		|	ТаблицаСрокиПЗ.НачалоПроекта,
		|	ТаблицаСрокиПЗ.ЗавершениеПроекта,
		|	ФактическиеСрокиПЗ.ДатаНачала,
		|	ФактическиеСрокиПЗ.ДатаЗавершения
		|ИЗ
		|	ТаблицаПЗСВерсиямиПодчиненныхПроектовЕстьПодчиненнаяПЗ КАК ТаблицаПЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСрокиПЗ КАК ТаблицаСрокиПЗ
		|		ПО ТаблицаПЗ.ПодчиненнаяПроектнаяЗадача = ТаблицаСрокиПЗ.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаГотовностьПЗ КАК ТаблицаГотовностьПЗ
		|		ПО ТаблицаПЗ.ПодчиненнаяПроектнаяЗадача = ТаблицаГотовностьПЗ.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФактическиеСрокиПЗ КАК ФактическиеСрокиПЗ
		|		ПО ТаблицаПЗ.ПодчиненнаяПроектнаяЗадача = ФактическиеСрокиПЗ.ПроектнаяЗадача";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗадачиСПодчиненными()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК Проект,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК СуществующаяПроектнаяЗадача
		|ИЗ
		|   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|           ,
		|           Версия = &Версия
		|               И ПодчиненныйПроект В (&ПодчиненныеПроекты)
		|               И ПроектнаяЗадача.Проект = &КорневойПроект) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|       ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|ГДЕ
		|   НЕ Проекты.ЗадачаОтменена";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДанныеПЗДляОчистки()
	
	// 0, 2 - данные объемов, распределение по подразделениям.
	// 4, 5 - трудозатраты, трудозатраты по периодам.
	// 6, 8, 9 - план доходов, распределение по подразделениям, распределение по периодам.
	// 10, 12, 13 - план расходов, распределение по подразделениям, распределение по периодам.
	// 14 - план ДДС, поступление.
	// 15 - план ДДС, выплата.
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    Субпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    Субпродукты.Номенклатура КАК Ресурс,
                   |    Субпродукты.Контрагент КАК Контрагент,
                   |    Субпродукты.Договор КАК Договор,
                   |    Субпродукты.ЕдиницаИзмерения КАК ЕдиницаНормирования,
                   |    Субпродукты.СпособПривязки КАК СпособПривязкиВыпуска,
                   |    Субпродукты.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
                   |    Субпродукты.ДатаВыпуска КАК ДатаВыпуска,
                   |    Субпродукты.Валюта КАК Валюта,
                   |    Субпродукты.Цена КАК Стоимость,
                   |    Субпродукты.Скорость КАК Скорость,
                   |    Субпродукты.Основной КАК Основной,
                   |    0 КАК Количество,
                   |    Субпродукты.Коэффициент КАК Коэффициент,
                   |    0 КАК ОбщСтоимость,
                   |    Субпродукты.СтатьяДоходов КАК СтатьяДоходов,
                   |    Субпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    Субпродукты.СпособПривязкиДоходов КАК СпособПривязки,
                   |    Субпродукты.ДатаПривязки КАК ДатаПривязки,
                   |    Субпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
                   |    Субпродукты.Комментарий КАК Комментарий,
                   |    ИСТИНА КАК Отмена,
                   |    ИСТИНА КАК ИзменениеРаспределения
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
                   |            ,
                   |            ПроектнаяЗадача В (&СписокЗадач)
                   |                И Версия = &текВерсия) КАК Субпродукты
                   |ГДЕ
                   |    (Субпродукты.Количество <> 0
                   |            ИЛИ Субпродукты.Сумма <> 0
                   |            ИЛИ Субпродукты.СуммаВалютная <> 0)
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |    Субпродукты.НомерСтроки
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.НомерСтроки КАК НомерСтроки,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.ВидОбъема КАК ВидОбъема,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
                   |    упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
                   |    0 КАК СуммаВалютная,
                   |    0 КАК Количество,
                   |    ИСТИНА КАК Отмена
                   |ПОМЕСТИТЬ ВТ_ПланОбъемовПодразделения
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
                   |ГДЕ
                   |    (упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0
                   |            ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
                   |            ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество <> 0)
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_ПланОбъемовПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    ВТ_ПланОбъемовПодразделения.Подразделение КАК Подразделение,
                   |    ВТ_ПланОбъемовПодразделения.Роль КАК Роль,
                   |    ВТ_ПланОбъемовПодразделения.СпособПривязки КАК СпособПривязки,
                   |    ВТ_ПланОбъемовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    ВТ_ПланОбъемовПодразделения.ДатаНачисления КАК ДатаПривязки,
                   |    ВТ_ПланОбъемовПодразделения.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
                   |    ВТ_ПланОбъемовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                   |    ВТ_ПланОбъемовПодразделения.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
                   |    ВТ_ПланОбъемовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
                   |    ВТ_ПланОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
                   |    ВТ_ПланОбъемовПодразделения.СуммаВалютная КАК Сумма,
                   |    ВТ_ПланОбъемовПодразделения.Количество КАК Количество
                   |ИЗ
                   |    ВТ_ПланОбъемовПодразделения КАК ВТ_ПланОбъемовПодразделения
                   |ГДЕ
                   |    ВТ_ПланОбъемовПодразделения.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |    ВТ_ПланОбъемовПодразделения.НомерСтроки
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    Затраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    Затраты.Ресурс КАК Ресурс,
                   |    0 КАК Количество,
                   |    Затраты.ЕдиницаНормирования КАК ЕдиницаНормирования,
                   |    Затраты.ОбщСтоимость КАК ОбщСтоимость,
                   |    Затраты.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    Затраты.Основной КАК Основной,
                   |    Затраты.Подразделение КАК Подразделение,
                   |    Затраты.СпособПривязки КАК СпособПривязки,
                   |    Затраты.УровеньПланирования КАК УровеньПланирования,
                   |    Затраты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияПоПериодам,
                   |    ВЫБОР
                   |        КОГДА Затраты.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.ПустаяСсылка)
                   |            ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты)
                   |        ИНАЧЕ ЕСТЬNULL(Затраты.ИсточникПлана, ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты))
                   |    КОНЕЦ КАК ИсточникПлана,
                   |    ИСТИНА КАК Отмена,
                   |    ИСТИНА КАК ИзменениеРаспределения
                   |ПОМЕСТИТЬ ВТ_Трудозатраты
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы)
                   |                И ПроектнаяЗадача В (&СписокЗадач)
                   |                И УровеньПланирования = &УровеньПланированияТрудозатрат) КАК Затраты
                   |ГДЕ
                   |    (Затраты.Количество <> 0
                   |            ИЛИ Затраты.ОбщСтоимость <> 0
                   |            ИЛИ Затраты.ОбщВнешняяСтоимость <> 0)
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_Трудозатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    ВТ_Трудозатраты.Ресурс КАК Ресурс,
                   |    ВТ_Трудозатраты.Количество КАК Количество,
                   |    ВТ_Трудозатраты.ЕдиницаНормирования КАК ЕдиницаНормирования,
                   |    ВТ_Трудозатраты.ОбщСтоимость КАК ОбщСтоимость,
                   |    ВТ_Трудозатраты.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    ВТ_Трудозатраты.Основной КАК Основной,
                   |    ВТ_Трудозатраты.Подразделение КАК Подразделение,
                   |    ВТ_Трудозатраты.СпособПривязки КАК СпособПривязки,
                   |    ВТ_Трудозатраты.УровеньПланирования КАК УровеньПланирования,
                   |    ВТ_Трудозатраты.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
                   |    ВТ_Трудозатраты.ИсточникПлана КАК ИсточникПлана,
                   |    ВТ_Трудозатраты.Отмена КАК Отмена,
                   |    ВТ_Трудозатраты.ИзменениеРаспределения КАК ИзменениеРаспределения
                   |ИЗ
                   |    ВТ_Трудозатраты КАК ВТ_Трудозатраты
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ПериодРаспределения КАК Период,
                   |    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
                   |    0 КАК Количество,
                   |    ИСТИНА КАК Отмена
                   |ИЗ
                   |    РегистрСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)
                   |                И ИндексСтрокиРаспределениеПоРолям В
                   |                    (ВЫБРАТЬ
                   |                        ВТ_Трудозатраты.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам
                   |                    ИЗ
                   |                        ВТ_Трудозатраты КАК ВТ_Трудозатраты)) КАК упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам
                   |ГДЕ
                   |    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Количество <> 0
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |    ДоходыРасходы.Версия КАК Версия,
				   |    ДоходыРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    ДоходыРасходы.Статья КАК Статья,
				   |    ДоходыРасходы.ВидЭлемента КАК ВидЭлемента,
                   |    ДоходыРасходы.Контрагент КАК Контрагент,
                   |    ДоходыРасходы.Договор КАК Договор,
                   |    ДоходыРасходы.СпособПривязки КАК СпособПривязки,
                   |    ДоходыРасходы.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    ДоходыРасходы.ДатаПривязки КАК ДатаПривязки,
				   |    ДоходыРасходы.ПериодАгрегации КАК ПериодАгрегации,
                   |    ДоходыРасходы.Валюта КАК Валюта,
				   |    ДоходыРасходы.ЭтоСубпродуктИлиПотребность КАК ЭтоСубпродуктИлиПотребность,
                   |    ДоходыРасходы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
				   |    ДоходыРасходы.ИсточникПлана КАК ИсточникПлана,
                   |    0 КАК Сумма,
                   |    ИСТИНА КАК Отмена,
                   |    ИСТИНА КАК ИзменениеРаспределения
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)
                   |                И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
                   |                И НЕ ЭтоСубпродуктИлиПотребность) КАК ДоходыРасходы
                   |ГДЕ
                   |    (ДоходыРасходы.Сумма <> 0
                   |            ИЛИ ДоходыРасходы.СуммаВалютная <> 0)
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |    ДоходыРасходы.НомерСтроки
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Версия КАК Версия,
				   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязки,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
				   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана,
                   |    0 КАК Сумма,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения
                   |ПОМЕСТИТЬ ВТ_ПланДоходовПодразделения
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)
                   |                И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
                   |ГДЕ
                   |    (упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0
                   |            ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
                   |            ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0)
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
				   |    ВТ_ПланДоходовПодразделения.Версия КАК Версия,
				   |    ВТ_ПланДоходовПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    ВТ_ПланДоходовПодразделения.ВидЭлемента КАК ВидЭлемента,
                   |    ВТ_ПланДоходовПодразделения.Подразделение КАК Подразделение,
                   |    ВТ_ПланДоходовПодразделения.Роль КАК Роль,
                   |    ВТ_ПланДоходовПодразделения.ДатаПривязки КАК ДатаПривязки,
                   |    ВТ_ПланДоходовПодразделения.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
                   |    ВТ_ПланДоходовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                   |    ВТ_ПланДоходовПодразделения.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
                   |    ВТ_ПланДоходовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
                   |    ВТ_ПланДоходовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
				   |    ВТ_ПланДоходовПодразделения.ИсточникПлана КАК ИсточникПлана,
                   |    ВТ_ПланДоходовПодразделения.Сумма КАК Сумма,
                   |    ВТ_ПланДоходовПодразделения.СпособПривязки КАК СпособПривязки,
                   |    ВТ_ПланДоходовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    ИСТИНА КАК Отмена
                   |ИЗ
                   |    ВТ_ПланДоходовПодразделения КАК ВТ_ПланДоходовПодразделения
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |    упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Версия КАК Версия,
				   |    упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
                   |    упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
                   |    упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
                   |    0 КАК Сумма,
                   |    ВЫБОР
                   |        КОГДА ВТ_ПланОбъемовПодразделения.ПроектнаяЗадача ЕСТЬ NULL
                   |            ТОГДА ЕСТЬNULL(ВТ_ПланДоходовПодразделения.ИсточникПлана, ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка))
                   |        ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Объемы)
                   |    КОНЕЦ КАК ИсточникПлана,
                   |    ИСТИНА КАК Отмена
                   |ИЗ
                   |    РегистрСведений.упоДанныеРаспределенияДоходовПоПериодам.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеРаспределенияДоходовПоПериодамСрезПоследних
                   |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланДоходовПодразделения КАК ВТ_ПланДоходовПодразделения
                   |        ПО упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияДоходов = ВТ_ПланДоходовПодразделения.ИндексСтрокРаспределенияПоПериодам
                   |            И (ВТ_ПланДоходовПодразделения.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
                   |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланОбъемовПодразделения КАК ВТ_ПланОбъемовПодразделения
                   |        ПО упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям = ВТ_ПланОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам
                   |            И (ВТ_ПланОбъемовПодразделения.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход))
                   |            И (ВТ_ПланОбъемовПодразделения.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
                   |ГДЕ
                   |    (упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Сумма <> 0
                   |            ИЛИ упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Количество <> 0)
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |    ДоходыРасходы.Версия КАК Версия,
				   |    ДоходыРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    ДоходыРасходы.Статья КАК Статья,
                   |    ДоходыРасходы.ВидЭлемента КАК ВидЭлемента,
                   |    ДоходыРасходы.Контрагент КАК Контрагент,
                   |    ДоходыРасходы.Договор КАК Договор,
                   |    ДоходыРасходы.СпособПривязки КАК СпособПривязки,
                   |    ДоходыРасходы.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    ДоходыРасходы.ДатаПривязки КАК ДатаПривязки,
				   |    ДоходыРасходы.ПериодАгрегации КАК ПериодАгрегации,
                   |    ДоходыРасходы.Валюта КАК Валюта,
				   |    ДоходыРасходы.ЭтоСубпродуктИлиПотребность КАК ЭтоСубпродуктИлиПотребность,
                   |    ДоходыРасходы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
				   |    ДоходыРасходы.ИсточникПлана КАК ИсточникПлана,
                   |    0 КАК Сумма,
                   |    ИСТИНА КАК Отмена,
                   |    ИСТИНА КАК ИзменениеРаспределения
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)
                   |                И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
                   |                И НЕ ЭтоСубпродуктИлиПотребность) КАК ДоходыРасходы
                   |ГДЕ
                   |    (ДоходыРасходы.Сумма <> 0
                   |            ИЛИ ДоходыРасходы.СуммаВалютная <> 0)
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |    ДоходыРасходы.НомерСтроки
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Версия КАК Версия,
				   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязки,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
				   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана,
                   |    0 КАК Сумма,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
                   |    упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения
                   |ПОМЕСТИТЬ ВТ_ПланРасходовПодразделения
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)
                   |                И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
                   |ГДЕ
                   |    (упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0
                   |            ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
                   |            ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0)
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
				   |    ВТ_ПланРасходовПодразделения.Версия КАК Версия,
				   |    ВТ_ПланРасходовПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    ВТ_ПланРасходовПодразделения.ВидЭлемента КАК ВидЭлемента,
                   |    ВТ_ПланРасходовПодразделения.Подразделение КАК Подразделение,
                   |    ВТ_ПланРасходовПодразделения.Роль КАК Роль,
                   |    ВТ_ПланРасходовПодразделения.ДатаПривязки КАК ДатаПривязки,
                   |    ВТ_ПланРасходовПодразделения.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
                   |    ВТ_ПланРасходовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                   |    ВТ_ПланРасходовПодразделения.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
                   |    ВТ_ПланРасходовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
                   |    ВТ_ПланРасходовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
				   |    ВТ_ПланРасходовПодразделения.ИсточникПлана КАК ИсточникПлана,
                   |    ВТ_ПланРасходовПодразделения.Сумма КАК Сумма,
                   |    ВТ_ПланРасходовПодразделения.СпособПривязки КАК СпособПривязки,
                   |    ВТ_ПланРасходовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
                   |    ИСТИНА КАК Отмена
                   |ИЗ
                   |    ВТ_ПланРасходовПодразделения КАК ВТ_ПланРасходовПодразделения
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |    упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Версия КАК Версия,
				   |    упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
                   |    упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
                   |    упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
				   |    упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
				   |    ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы) КАК ИсточникПлана,
                   |    0 КАК Сумма,
                   |    ИСТИНА КАК Отмена
                   |ИЗ
                   |    РегистрСведений.упоДанныеРаспределенияРасходовПоПериодам.СрезПоследних(
                   |            ,
                   |            Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеРаспределенияРасходовПоПериодамСрезПоследних
                   |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланРасходовПодразделения КАК ВТ_ПланРасходовПодразделения
                   |        ПО (ВТ_ПланРасходовПодразделения.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Регистратор КАК Регистратор,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Версия КАК Версия,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СтатьяДДС КАК СтатьяДДС,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.НаправлениеДвижения КАК НаправлениеДвижения,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Контрагент КАК Контрагент,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Договор КАК Договор,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СпособПривязки КАК СпособПривязки,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Задержка КАК Задержка,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ДатаПривязки КАК ДатаПривязки,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Валюта КАК Валюта,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ВидПлатежа КАК ВидПлатежа,
				   |    СУММА(упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
                   |    ИСТИНА КАК Отмена
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановДвиженияДенежныхСредств.СрезПоследних(
                   |            ,
                   |            НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Поступление)
                   |                И Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДвиженияДенежныхСредствСрезПоследних
                   |ГДЕ
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СуммаВалютная > 0
                   |
                   |СГРУППИРОВАТЬ ПО
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Регистратор,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Версия,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПроектнаяЗадача,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СтатьяДДС,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.НаправлениеДвижения,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Контрагент,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Договор,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СпособПривязки,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Задержка,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ДатаПривязки,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Валюта,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПрофильРаспределения,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ВидПлатежа
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Регистратор КАК Регистратор,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Версия КАК Версия,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СтатьяДДС КАК СтатьяДДС,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.НаправлениеДвижения КАК НаправлениеДвижения,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Контрагент КАК Контрагент,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Договор КАК Договор,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СпособПривязки КАК СпособПривязки,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Задержка КАК Задержка,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ДатаПривязки КАК ДатаПривязки,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Валюта КАК Валюта,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ВидПлатежа КАК ВидПлатежа,
				   |    СУММА(упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
                   |    ИСТИНА КАК Отмена
                   |ИЗ
                   |    РегистрСведений.упоДанныеПлановДвиженияДенежныхСредств.СрезПоследних(
                   |            ,
                   |            НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата)
                   |                И Версия = &текВерсия
                   |                И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеПлановДвиженияДенежныхСредствСрезПоследних
                   |ГДЕ
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СуммаВалютная > 0
                   |
                   |СГРУППИРОВАТЬ ПО
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Регистратор,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Версия,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПроектнаяЗадача,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СтатьяДДС,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.НаправлениеДвижения,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Контрагент,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Договор,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.СпособПривязки,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Задержка,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ДатаПривязки,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.Валюта,
                   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ПрофильРаспределения,
				   |    упоДанныеПлановДвиженияДенежныхСредствСрезПоследних.ВидПлатежа";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДанныеТрансляцииТрудозатратПоПроектнойПродукции()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    Затраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    Затраты.Ресурс КАК Ресурс,
		|    0 КАК Количество,
		|    Затраты.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    Затраты.ОбщСтоимость КАК ОбщСтоимость,
		|    Затраты.ПрофильРаспределения КАК ПрофильРаспределения,
		|    Затраты.Основной КАК Основной,
		|    Затраты.Подразделение КАК Подразделение,
		|    Затраты.СпособПривязки КАК СпособПривязки,
		|    Затраты.УровеньПланирования КАК УровеньПланирования,
		|    Затраты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияПоПериодам,
		|    ВЫБОР
		|        КОГДА Затраты.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.ПустаяСсылка)
		|            ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты)
		|        ИНАЧЕ ЕСТЬNULL(Затраты.ИсточникПлана, ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты))
		|    КОНЕЦ КАК ИсточникПлана,
		|    ИСТИНА КАК Отмена,
		|    ИСТИНА КАК ИзменениеРаспределения
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|    РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		|            ,
		|            ПроектнаяЗадача В (&СписокЗадач)
		|                И Версия = &текВерсия
		|                И ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы)) КАК Затраты
		|ГДЕ
		|    (Затраты.Количество <> 0
		|            ИЛИ Затраты.ОбщСтоимость <> 0
		|            ИЛИ Затраты.ОбщВнешняяСтоимость <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВТ_ОсновныеДанные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ВТ_ОсновныеДанные.Ресурс КАК Ресурс,
		|    ВТ_ОсновныеДанные.Количество КАК Количество,
		|    ВТ_ОсновныеДанные.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    ВТ_ОсновныеДанные.ОбщСтоимость КАК ОбщСтоимость,
		|    ВТ_ОсновныеДанные.ПрофильРаспределения КАК ПрофильРаспределения,
		|    ВТ_ОсновныеДанные.Основной КАК Основной,
		|    ВТ_ОсновныеДанные.Подразделение КАК Подразделение,
		|    ВТ_ОсновныеДанные.СпособПривязки КАК СпособПривязки,
		|    ВТ_ОсновныеДанные.УровеньПланирования КАК УровеньПланирования,
		|    ВТ_ОсновныеДанные.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|    ВТ_ОсновныеДанные.ИсточникПлана КАК ИсточникПлана,
		|    ВТ_ОсновныеДанные.Отмена КАК Отмена,
		|    ВТ_ОсновныеДанные.ИзменениеРаспределения КАК ИзменениеРаспределения
		|ИЗ
		|    ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ПериодРаспределения КАК Период,
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|    0 КАК Количество,
		|    ИСТИНА КАК Отмена
		|ИЗ
		|    РегистрСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.СрезПоследних(
		|            ,
		|            ИндексСтрокиРаспределениеПоРолям В
		|                    (ВЫБРАТЬ
		|                        ВТ_ОсновныеДанные.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам
		|                    ИЗ
		|                        ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)
		|                И Версия = &текВерсия
		|                И ПроектнаяЗадача В (&СписокЗадач)) КАК упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам
		|ГДЕ
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Количество <> 0";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСубпродуктов()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_ПодчиненныеПроекты
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &ВерсияКорневогоПроекта
	               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПодчиненныйПроект,
	               |	ПодчиненнаяПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_ЗадачиПодчиненных
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия В (&СписокВерсий)
	               |				И Версия.Проект В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПодчиненныеПроекты.ПодчиненныйПроект КАК ПодчиненныйПроект
	               |					ИЗ
	               |						ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |					ГДЕ
	               |						НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |	И Проекты.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |			ИЗ
	               |				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ГДЕ
	               |				НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия В (&СписокВерсий)
	               |				И Версия.Проект В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПодчиненныеПроекты.ПодчиненныйПроект КАК ПодчиненныйПроекта
	               |					ИЗ
	               |						ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |					ГДЕ
	               |						ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |	И Проекты.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |			ИЗ
	               |				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ГДЕ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК Регистратор,
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	&ВерсияКорневогоПроекта КАК Версия,
	               |	СрезДоходовПоОбъемам.Номенклатура КАК Ресурс,
	               |	СУММА(СрезДоходовПоОбъемам.Количество) КАК Количество,
	               |	СрезДоходовПоОбъемам.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	               |	СУММА(СрезДоходовПоОбъемам.Сумма) КАК ОбщСтоимость,
	               |	СрезДоходовПоОбъемам.Валюта КАК Валюта,
	               |	СрезДоходовПоОбъемам.Подразделение КАК Подразделение,
	               |	СрезДоходовПоОбъемам.Роль КАК Роль,
	               |	СрезДоходовПоОбъемам.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	СрезДоходовПоОбъемам.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	СрезДоходовПоОбъемам.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	СрезДоходовПоОбъемам.СпособПривязки КАК СпособПривязки,
	               |	СрезДоходовПоОбъемам.ДатаНачисления КАК ДатаПривязкиРаспределение
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	               |			,
	               |			ИсточникПлана = &ИсточникПлана
	               |				И Версия В (&СписокВерсий)) КАК СрезДоходовПоОбъемам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |		ПО СрезДоходовПоОбъемам.Версия.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадачиПодчиненных КАК ВТ_ЗадачиПодчиненных
	               |		ПО СрезДоходовПоОбъемам.ПроектнаяЗадача = ВТ_ЗадачиПодчиненных.ПроектнаяЗадача
	               |ГДЕ
	               |	(СрезДоходовПоОбъемам.Количество <> 0
	               |			ИЛИ СрезДоходовПоОбъемам.Сумма <> 0)
	               |	И СрезДоходовПоОбъемам.ДатаНачисления >= &ДатаСтартаПроекта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача,
	               |	СрезДоходовПоОбъемам.Номенклатура,
	               |	СрезДоходовПоОбъемам.ЕдиницаИзмерения,
	               |	СрезДоходовПоОбъемам.Валюта,
	               |	СрезДоходовПоОбъемам.СпособПривязки,
	               |	СрезДоходовПоОбъемам.Статья,
	               |	СрезДоходовПоОбъемам.КонтрагентПодрядчик,
	               |	СрезДоходовПоОбъемам.Заказ_ДоговорПодрядчика,
	               |	СрезДоходовПоОбъемам.ДатаНачисления,
	               |	СрезДоходовПоОбъемам.Роль,
	               |	СрезДоходовПоОбъемам.ПрофильРаспределения,
	               |	СрезДоходовПоОбъемам.СобствСилы_Субподряд,
	               |	СрезДоходовПоОбъемам.Подразделение,
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПланВыпуска()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_ПодчиненныеПроекты
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &ВерсияКорневогоПроекта
	               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПодчиненныйПроект,
	               |	ПодчиненнаяПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_ЗадачиПодчиненных
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия В (&СписокВерсий)
	               |				И Версия.Проект В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПодчиненныеПроекты.ПодчиненныйПроект КАК ПодчиненныйПроект
	               |					ИЗ
	               |						ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |					ГДЕ
	               |						НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |	И Проекты.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |			ИЗ
	               |				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ГДЕ
	               |				НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия В (&СписокВерсий)
	               |				И Версия.Проект В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПодчиненныеПроекты.ПодчиненныйПроект КАК ПодчиненныйПроекта
	               |					ИЗ
	               |						ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |					ГДЕ
	               |						ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |	И Проекты.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |			ИЗ
	               |				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ГДЕ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК Регистратор,
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	&ВерсияКорневогоПроекта КАК Версия,
	               |	ПланОбъемов.Номенклатура КАК Ресурс,
	               |	СУММА(ПланОбъемов.Количество) КАК Количество,
	               |	ПланОбъемов.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	               |	СУММА(ПланОбъемов.Сумма) КАК ОбщСтоимость,
	               |	ПланОбъемов.Валюта КАК Валюта,
	               |	ПланОбъемов.Подразделение КАК Подразделение,
	               |	ПланОбъемов.Роль КАК Роль,
	               |	ПланОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ПланОбъемов.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ПланОбъемов.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	ПланОбъемов.СпособПривязки КАК СпособПривязки,
	               |	ПланОбъемов.ДатаНачисления КАК ДатаПривязкиРаспределение
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
	               |			,
	               |			Версия В (&СписокВерсий)
	               |				И ВидОбъема = &ВидОбъема) КАК ПланОбъемов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |		ПО ПланОбъемов.Версия.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадачиПодчиненных КАК ВТ_ЗадачиПодчиненных
	               |		ПО ПланОбъемов.ПроектнаяЗадача = ВТ_ЗадачиПодчиненных.ПроектнаяЗадача
	               |ГДЕ
	               |	(ПланОбъемов.Количество <> 0
	               |			ИЛИ ПланОбъемов.Сумма <> 0)
	               |	И ПланОбъемов.ДатаНачисления >= &ДатаСтартаПроекта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача,
	               |	ПланОбъемов.Номенклатура,
	               |	ПланОбъемов.ЕдиницаИзмерения,
	               |	ПланОбъемов.Валюта,
	               |	ПланОбъемов.СпособПривязки,
	               |	ПланОбъемов.Статья,
	               |	ПланОбъемов.КонтрагентПодрядчик,
	               |	ПланОбъемов.Заказ_ДоговорПодрядчика,
	               |	ПланОбъемов.ДатаНачисления,
	               |	ПланОбъемов.Роль,
	               |	ПланОбъемов.СобствСилы_Субподряд,
	               |	ПланОбъемов.Подразделение,
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТрудозатрат()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|ПОМЕСТИТЬ ВТ_ПодчиненныеПроекты
		|ИЗ
		|   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|           ,
		|           Версия = &ВерсияКорневогоПроекта
		|               И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|   НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадачаПодчиненная,
		|   упоВерсииПроекта.Текущая КАК Текущая
		|ПОМЕСТИТЬ ВТ_ЗадачиПодчиненных
		|ИЗ
		|   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&СписокВерсий)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|           ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|           ПО упоВерсииПроекта.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
		|       ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|       ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|ГДЕ
		|   НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|   И Проекты.Ссылка В ИЕРАРХИИ
		|           (ВЫБРАТЬ
		|               ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|           ИЗ
		|               ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|           ГДЕ
		|               НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
		|   И НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|   ВТ_ПодчиненныеПроекты.ПроектнаяЗадача,
		|   упоСвойстваПроектныхЗадачСрезПоследних.Версия,
		|   упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
		|   упоВерсииПроекта.Текущая
		|ИЗ
		|   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&СписокВерсий)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|           ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|           ПО упоВерсииПроекта.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
		|       ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|       ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|ГДЕ
		|   НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|   И Проекты.Ссылка В ИЕРАРХИИ
		|           (ВЫБРАТЬ
		|               ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|           ИЗ
		|               ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|           ГДЕ
		|               ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
		|   И ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ЗадачиПодчиненных.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_ЗадачиПодчиненных.ПроектнаяЗадачаПодчиненная КАК ПроектнаяЗадачаПодчиненная
		|ПОМЕСТИТЬ ВТ_ЗадачиПодчиненныхТекущаяВерсия
		|ИЗ
		|   ВТ_ЗадачиПодчиненных КАК ВТ_ЗадачиПодчиненных
		|ГДЕ
		|   ВТ_ЗадачиПодчиненных.Текущая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ЗадачиПодчиненных.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_ЗадачиПодчиненных.Версия КАК Версия,
		|   ВТ_ЗадачиПодчиненных.ПроектнаяЗадачаПодчиненная КАК ПроектнаяЗадачаПодчиненная
		|ПОМЕСТИТЬ ВТ_ЗадачиПодчиненныхВерсии
		|ИЗ
		|   ВТ_ЗадачиПодчиненных КАК ВТ_ЗадачиПодчиненных
		|ГДЕ
		|   НЕ ВТ_ЗадачиПодчиненных.Текущая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ЗадачиПодчиненныхВерсии.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   упоАктуальныеПланыТрудозатратПоДнямВерсии.Ресурс КАК Ресурс,
		|   упоАктуальныеПланыТрудозатратПоДнямВерсии.УровеньПланирования КАК УровеньПланирования,
		|   упоАктуальныеПланыТрудозатратПоДнямВерсии.Подразделение КАК Подразделение,
		|   упоАктуальныеПланыТрудозатратПоДнямВерсии.День КАК День,
		|   упоАктуальныеПланыТрудозатратПоДнямВерсии.Трудозатраты КАК Количество
		|ПОМЕСТИТЬ ВТ_ПланыТрудозатратПредварительная
		|ИЗ
		|   РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямВерсии КАК упоАктуальныеПланыТрудозатратПоДнямВерсии
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадачиПодчиненныхВерсии КАК ВТ_ЗадачиПодчиненныхВерсии
		|       ПО упоАктуальныеПланыТрудозатратПоДнямВерсии.Версия = ВТ_ЗадачиПодчиненныхВерсии.Версия
		|           И упоАктуальныеПланыТрудозатратПоДнямВерсии.Операция = ВТ_ЗадачиПодчиненныхВерсии.ПроектнаяЗадачаПодчиненная
		|ГДЕ
		|   ТИПЗНАЧЕНИЯ(упоАктуальныеПланыТрудозатратПоДнямВерсии.Ресурс) = ТИП(Справочник.упоРоли)
		|   И упоАктуальныеПланыТрудозатратПоДнямВерсии.УровеньПланирования = &УровеньПланирования
		|   И упоАктуальныеПланыТрудозатратПоДнямВерсии.День >= &ДатаСтартаПроекта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|   ВТ_ЗадачиПодчиненныхТекущаяВерсия.ПроектнаяЗадача,
		|   упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс,
		|   упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования,
		|   упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение,
		|   упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День,
		|   упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты
		|ИЗ
		|   РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
		|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадачиПодчиненныхТекущаяВерсия КАК ВТ_ЗадачиПодчиненныхТекущаяВерсия
		|       ПО упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция = ВТ_ЗадачиПодчиненныхТекущаяВерсия.ПроектнаяЗадачаПодчиненная
		|ГДЕ
		|   ТИПЗНАЧЕНИЯ(упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс) = ТИП(Справочник.упоРоли)
		|   И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланирования
		|   И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День >= &ДатаСтартаПроекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ПланыТрудозатрат.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_ПланыТрудозатрат.Ресурс КАК Ресурс,
		|   ВТ_ПланыТрудозатрат.УровеньПланирования КАК УровеньПланирования,
		|   ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.Час) КАК ЕдиницаНормирования,
		|   ВЫБОР
		|       КОГДА ВТ_ПланыТрудозатрат.ПодразделениеКоличество = 1
		|           ТОГДА ВТ_ПланыТрудозатрат.Подразделение
		|       ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
		|   КОНЕЦ КАК Подразделение,
		|   ВТ_ПланыТрудозатрат.Количество КАК Количество,
		|   ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную) КАК СпособПривязки,
		|   ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение) КАК ПрофильРаспределения,
		|   ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты) КАК ИсточникПлана,
		|   ЛОЖЬ КАК Отмена,
		|   ЛОЖЬ КАК Основной
		|ПОМЕСТИТЬ ВТ_ПланыТрудозатрат
		|ИЗ
		|   (ВЫБРАТЬ
		|       ВТ_ПланыТрудозатратПредварительная.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|       ВТ_ПланыТрудозатратПредварительная.Ресурс КАК Ресурс,
		|       ВТ_ПланыТрудозатратПредварительная.УровеньПланирования КАК УровеньПланирования,
		|       МАКСИМУМ(ВТ_ПланыТрудозатратПредварительная.Подразделение) КАК Подразделение,
		|       КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПланыТрудозатратПредварительная.Подразделение) КАК ПодразделениеКоличество,
		|       СУММА(ВТ_ПланыТрудозатратПредварительная.Количество) КАК Количество
		|   ИЗ
		|       ВТ_ПланыТрудозатратПредварительная КАК ВТ_ПланыТрудозатратПредварительная
		|   
		|   СГРУППИРОВАТЬ ПО
		|       ВТ_ПланыТрудозатратПредварительная.ПроектнаяЗадача,
		|       ВТ_ПланыТрудозатратПредварительная.Ресурс,
		|       ВТ_ПланыТрудозатратПредварительная.УровеньПланирования) КАК ВТ_ПланыТрудозатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Ресурс,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования КАК УровеньПланирования,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.СпособПривязки КАК СпособПривязки,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.Количество КАК Количество,
		|   0 КАК ИндексСтрокРаспределенияПоПериодам,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.ИсточникПлана КАК ИсточникПлана,
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.Основной КАК Основной
		|ПОМЕСТИТЬ ВТ_ПланыТрудозатратБД
		|ИЗ
		|   РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		|           ,
		|           (Версия, ПроектнаяЗадача) В
		|               (ВЫБРАТЬ
		|                   ВТ_ПодчиненныеПроекты.Версия КАК Версия,
		|                   ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК ПроектнаяЗадача
		|               ИЗ
		|                   ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		|ГДЕ
		|   упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
		|   И упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования = &УровеньПланирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ЕСТЬNULL(ВТ_ПланыТрудозатратБД.ПроектнаяЗадача, ВТ_ПланыТрудозатрат.ПроектнаяЗадача) КАК ПроектнаяЗадача,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатратБД.Ресурс, ВТ_ПланыТрудозатрат.Ресурс) КАК Ресурс,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатратБД.УровеньПланирования, ВТ_ПланыТрудозатрат.УровеньПланирования) КАК УровеньПланирования,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатрат.ЕдиницаНормирования, ВТ_ПланыТрудозатратБД.ЕдиницаНормирования) КАК ЕдиницаНормирования,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатрат.Подразделение, ВТ_ПланыТрудозатратБД.Подразделение) КАК Подразделение,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатрат.СпособПривязки, ВТ_ПланыТрудозатратБД.СпособПривязки) КАК СпособПривязки,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатрат.ПрофильРаспределения, ВТ_ПланыТрудозатратБД.ПрофильРаспределения) КАК ПрофильРаспределения,
		|   ВТ_ПланыТрудозатратБД.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатрат.ИсточникПлана, ВТ_ПланыТрудозатратБД.ИсточникПлана) КАК ИсточникПлана,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатрат.Основной, ВТ_ПланыТрудозатратБД.Основной) КАК Основной,
		|   ЕСТЬNULL(ВТ_ПланыТрудозатрат.Количество, ВТ_ПланыТрудозатратБД.Количество) КАК Количество,
		|   ВЫБОР
		|       КОГДА ВТ_ПланыТрудозатрат.ПроектнаяЗадача ЕСТЬ NULL
		|           ТОГДА ИСТИНА
		|       ИНАЧЕ ЛОЖЬ
		|   КОНЕЦ КАК Отмена,
		|   ИСТИНА КАК ИзменениеРаспределения
		|ИЗ
		|   ВТ_ПланыТрудозатратБД КАК ВТ_ПланыТрудозатратБД
		|       ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПланыТрудозатрат КАК ВТ_ПланыТрудозатрат
		|       ПО ВТ_ПланыТрудозатратБД.ПроектнаяЗадача = ВТ_ПланыТрудозатрат.ПроектнаяЗадача
		|           И ВТ_ПланыТрудозатратБД.Ресурс = ВТ_ПланыТрудозатрат.Ресурс
		|           И ВТ_ПланыТрудозатратБД.УровеньПланирования = ВТ_ПланыТрудозатрат.УровеньПланирования
		|           И ВТ_ПланыТрудозатратБД.ИсточникПлана = ВТ_ПланыТрудозатрат.ИсточникПлана
		|ИТОГИ
		|   МАКСИМУМ(ИндексСтрокРаспределенияПоПериодам)
		|ПО
		|   ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_ПланыТрудозатратПредварительная.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|   ВТ_ПланыТрудозатратПредварительная.Ресурс КАК Ресурс,
		|   ВТ_ПланыТрудозатратПредварительная.УровеньПланирования КАК УровеньПланирования,
		|   КОНЕЦПЕРИОДА(ВТ_ПланыТрудозатратПредварительная.День, МЕСЯЦ) КАК Период,
		|   СУММА(ВТ_ПланыТрудозатратПредварительная.Количество) КАК Количество
		|ИЗ
		|   ВТ_ПланыТрудозатратПредварительная КАК ВТ_ПланыТрудозатратПредварительная
		|
		|СГРУППИРОВАТЬ ПО
		|   ВТ_ПланыТрудозатратПредварительная.ПроектнаяЗадача,
		|   ВТ_ПланыТрудозатратПредварительная.Ресурс,
		|   ВТ_ПланыТрудозатратПредварительная.УровеньПланирования,
		|   КОНЕЦПЕРИОДА(ВТ_ПланыТрудозатратПредварительная.День, МЕСЯЦ)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПланДоходовРасходов()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|ПОМЕСТИТЬ ВТ_ПодчиненныеПроекты
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &ВерсияКорневогоПроекта
		|				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПодчиненныйПроект,
		|	ПодчиненнаяПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадачаПодчиненная
		|ПОМЕСТИТЬ ВТ_ЗадачиПодчиненных
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&СписокВерсий)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|			ПО упоВерсииПроекта.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
		|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|ГДЕ
		|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|	И Проекты.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|			ИЗ
		|				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|			ГДЕ
		|				НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
		|	И НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.Версия,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&СписокВерсий)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|			ПО упоВерсииПроекта.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
		|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|ГДЕ
		|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		|	И Проекты.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
		|			ИЗ
		|				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
		|			ГДЕ
		|				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
		|	И ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача КАК Регистратор,
		|	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	&ВерсияКорневогоПроекта КАК Версия,
		|	СУММА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма) КАК Сумма,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья КАК Статья,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта КАК Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату) КАК СпособПривязки,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПериодАгрегации КАК ПериодАгрегации,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент КАК Контрагент,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор КАК Договор,
		|	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы) КАК ИсточникПлана,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязки
		|ПОМЕСТИТЬ ВТ_ОсновныеДанныеПодразделения
		|ИЗ
		|	ВТ_ЗадачиПодчиненных КАК ВТ_ЗадачиПодчиненных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
		|				,
		|				ИсточникПлана В (&ИсточникПлана)
		|					И Версия В (&СписокВерсий)
		|					И ВидЭлемента = &ВидЭлемента) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
		|		ПО ВТ_ЗадачиПодчиненных.ПроектнаяЗадачаПодчиненная = упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача
		|			И ВТ_ЗадачиПодчиненных.Версия = упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Версия
		|ГДЕ
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления >= &ДатаСтартаПроекта
		|	И упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПериодАгрегации,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение,
		|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления,
		|	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанныеПодразделения.Регистратор КАК Регистратор,
		|	ВТ_ОсновныеДанныеПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ОсновныеДанныеПодразделения.Версия КАК Версия,
		|	СУММА(ВТ_ОсновныеДанныеПодразделения.Сумма) КАК Сумма,
		|	ВТ_ОсновныеДанныеПодразделения.Статья КАК Статья,
		|	ВТ_ОсновныеДанныеПодразделения.Валюта КАК Валюта,
		|	ВТ_ОсновныеДанныеПодразделения.СпособПривязки КАК СпособПривязки,
		|	ВТ_ОсновныеДанныеПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ВТ_ОсновныеДанныеПодразделения.ПериодАгрегации КАК ПериодАгрегации,
		|	ВТ_ОсновныеДанныеПодразделения.Контрагент КАК Контрагент,
		|	ВТ_ОсновныеДанныеПодразделения.Договор КАК Договор,
		|	ВТ_ОсновныеДанныеПодразделения.ИсточникПлана КАК ИсточникПлана,
		|	ВТ_ОсновныеДанныеПодразделения.ДатаПривязки КАК ДатаПривязки
		|ИЗ
		|	ВТ_ОсновныеДанныеПодразделения КАК ВТ_ОсновныеДанныеПодразделения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОсновныеДанныеПодразделения.Регистратор,
		|	ВТ_ОсновныеДанныеПодразделения.Статья,
		|	ВТ_ОсновныеДанныеПодразделения.ПроектнаяЗадача,
		|	ВТ_ОсновныеДанныеПодразделения.СпособПривязки,
		|	ВТ_ОсновныеДанныеПодразделения.Версия,
		|	ВТ_ОсновныеДанныеПодразделения.Договор,
		|	ВТ_ОсновныеДанныеПодразделения.ДатаПривязки,
		|	ВТ_ОсновныеДанныеПодразделения.ИсточникПлана,
		|	ВТ_ОсновныеДанныеПодразделения.Валюта,
		|	ВТ_ОсновныеДанныеПодразделения.ПрофильРаспределения,
		|	ВТ_ОсновныеДанныеПодразделения.Контрагент,
		|	ВТ_ОсновныеДанныеПодразделения.ПериодАгрегации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанныеПодразделения.Регистратор КАК Регистратор,
		|	ВТ_ОсновныеДанныеПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ОсновныеДанныеПодразделения.Версия КАК Версия,
		|	ВТ_ОсновныеДанныеПодразделения.Сумма КАК Сумма,
		|	ВТ_ОсновныеДанныеПодразделения.Статья КАК Статья,
		|	ВТ_ОсновныеДанныеПодразделения.Валюта КАК Валюта,
		|	ВТ_ОсновныеДанныеПодразделения.СпособПривязки КАК СпособПривязки,
		|	ВТ_ОсновныеДанныеПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ВТ_ОсновныеДанныеПодразделения.ПериодАгрегации КАК ПериодАгрегации,
		|	ВТ_ОсновныеДанныеПодразделения.Контрагент КАК Контрагент,
		|	ВТ_ОсновныеДанныеПодразделения.Договор КАК Договор,
		|	ВТ_ОсновныеДанныеПодразделения.ИсточникПлана КАК ИсточникПлана,
		|	ВТ_ОсновныеДанныеПодразделения.Роль КАК Роль,
		|	ВТ_ОсновныеДанныеПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ВТ_ОсновныеДанныеПодразделения.Подразделение КАК Подразделение,
		|	ВТ_ОсновныеДанныеПодразделения.ДатаПривязки КАК ДатаПривязки
		|ИЗ
		|	ВТ_ОсновныеДанныеПодразделения КАК ВТ_ОсновныеДанныеПодразделения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПланДДС()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_ПодчиненныеПроекты
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &ВерсияКорневогоПроекта
	               |				И ПроектнаяЗадача В (&СписокЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПодчиненныйПроект,
	               |	ПодчиненнаяПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадачаПодчиненная
	               |ПОМЕСТИТЬ ВТ_ЗадачиПодчиненных
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&СписокВерсий)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ПО упоВерсииПроекта.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |	И Проекты.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |			ИЗ
	               |				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ГДЕ
	               |				НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
	               |	И НЕ ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ПодчиненныеПроекты.ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.Версия,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия В (&СписокВерсий)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ПО упоВерсииПроекта.Проект = ВТ_ПодчиненныеПроекты.ПодчиненныйПроект
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |	И Проекты.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача
	               |			ИЗ
	               |				ВТ_ПодчиненныеПроекты КАК ВТ_ПодчиненныеПроекты
	               |			ГДЕ
	               |				ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
	               |	И ВТ_ПодчиненныеПроекты.ПодчиненнаяПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача КАК Регистратор,
	               |	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	&ВерсияКорневогоПроекта КАК Версия,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Валюта КАК Валюта,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент КАК Контрагент,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор КАК Договор,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СтатьяДДС КАК СтатьяДДС,
	               |	&НаправлениеДвижения КАК НаправлениеДвижения,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ВидПлатежа КАК ВидПлатежа,
	               |	ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДДС.НаДату) КАК СпособПривязки,
	               |	NULL КАК Задержка,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения КАК ДатаПривязки,
	               |	СУММА(упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СуммаВалютная) КАК СуммаВалютная
	               |ИЗ
	               |	ВТ_ЗадачиПодчиненных КАК ВТ_ЗадачиПодчиненных
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(, НаправлениеДвижения = &НаправлениеДвижения) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
	               |		ПО ВТ_ЗадачиПодчиненных.ПроектнаяЗадачаПодчиненная = упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача
	               |			И ВТ_ЗадачиПодчиненных.Версия = упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Версия
	               |ГДЕ
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СуммаВалютная > 0
				   |	И упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения >= &ДатаСтартаПроекта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Валюта,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СтатьяДДС,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ВидПлатежа,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения,
	               |	ВТ_ЗадачиПодчиненных.ПроектнаяЗадача";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область АктуализацияСроков

Процедура АктуализироватьСрокиИПроцентГотовностиЗадач(КорневойПроект,
		ДокументСохранения,
		ДанныеАктуализации,
		СвойстваПроектныхЗадачСоответствие,
		ЭтоАктуализацияПоРЦК = Ложь)
	
	ДокументСохранения.ПерезаписатьПроцентГотовности = Истина;
	ДокументСохранения.ПерезаписатьСрокиПроекта = Истина;
	
	Для каждого СтрокаДанных Из ДанныеАктуализации Цикл
		
		СтрокаПЗ = ДокументСохранения.ПроектныеЗадачи.Найти(СтрокаДанных.ПроектнаяЗадача);
		Если Не ЗначениеЗаполнено(СтрокаПЗ) Тогда
			СвойстваПроектнойЗадачи = СвойстваПроектныхЗадачСоответствие[СтрокаДанных.ПроектнаяЗадача];
			СтрокаПЗ = ДокументСохранения.ПроектныеЗадачи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПЗ, СвойстваПроектнойЗадачи);
		КонецЕсли;
		
		СтрокаПЗ.РучнойВводСроков = Истина;
		
		// Сроки и проценты готовности.
		СтрокаСроки = ДокументСохранения.Сроки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСроки, СтрокаДанных);
		
		Если Не ЭтоАктуализацияПоРЦК Тогда
			СтрокаСрокиФакт = ДокументСохранения.ФактическиеСроки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСрокиФакт, СтрокаДанных);
			
			СтрокаГотовность = ДокументСохранения.ПроцентыГотовности.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаГотовность, СтрокаДанных);
		КонецЕсли;
		
		// Расчет длительности.
		РабочийКалендарьПрограммы = упоПроектыИЗадачиСервер.ПолучитьКалендарьПроекта(КорневойПроект);
		КалендарьЗадачи = ?(ЗначениеЗаполнено(СтрокаПЗ.КалендарьЗадачи), СтрокаПЗ.КалендарьЗадачи,
				РабочийКалендарьПрограммы);
		
		МаксимальнаяДатаЗавершения = упоРасчетКалендарныхСроковРедакция3Сервер.КалендарныйКонецДня(
				НачалоДня(СтрокаДанных.ДатаЗавершенияПлан), , КалендарьЗадачи, Неопределено, Неопределено);
		
		Если МаксимальнаяДатаЗавершения < СтрокаДанных.ДатаЗавершенияПлан Тогда
			СтрокаДанных.ДатаЗавершенияПлан = МаксимальнаяДатаЗавершения;
		КонецЕсли;
		
		// Для вехи не заполняется длительность и единица времени.
		Если СтрокаПЗ.ЭтоВеха Тогда
			СтрокаСроки.ДатаНачалаПлан = СтрокаСроки.ДатаЗавершенияПлан;
		Иначе
			СтрокаПЗ.ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.РабочийДень;
			
			СтрокаПЗ.ДлительностьМоделиПакетаРабот = упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьДлительность(
					СтрокаДанных.ДатаНачалаПлан,
					СтрокаДанных.ДатаЗавершенияПлан,
					СтрокаПЗ.ЕдиницаНормированияДлительности,
					СтрокаПЗ.КалендарьЗадачи,
					РабочийКалендарьПрограммы,
					0);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеСроковИГотовностиПоПодчиненным(Проект,
		ДатаСтартаПроекта,
		СписокЗадач = Неопределено,
		Версия = Неопределено,
		ВерсииПодчиненных = Неопределено)
	
	Если Версия = Неопределено Тогда
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Если СписокЗадач = Неопределено Тогда
		Запрос.УстановитьПараметр("ВсеЗадачи", Истина);
		Запрос.УстановитьПараметр("МассивЗадач", Новый Массив);
	Иначе
		Запрос.УстановитьПараметр("ВсеЗадачи", Ложь);
		Запрос.УстановитьПараметр("МассивЗадач", СписокЗадач);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаДанныеПоСрокамПодчиненных();
	Если ВерсииПодчиненных = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВерсиям", "И упоВерсииПроекта.Текущая");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВерсиям", "И упоВерсииПроекта.Версия В (&ВерсииПодчиненных)");
		Запрос.УстановитьПараметр("ВерсииПодчиненных", ВерсииПодчиненных);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ДатаСтартаПроекта", ДатаСтартаПроекта);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивСроков = Новый Массив;
	
	Для Каждого СтрокаПЗ Из РезультатЗапроса Цикл
		СтруктураСроков = Новый Структура;
		СтруктураСроков.Вставить("ПроектнаяЗадача", СтрокаПЗ.ПроектнаяЗадача);
		СтруктураСроков.Вставить("ДатаНачалаПлан", СтрокаПЗ.НачалоПроекта);
		СтруктураСроков.Вставить("ДатаЗавершенияПлан", СтрокаПЗ.ЗавершениеПроекта);
		СтруктураСроков.Вставить("ПроцентГотовности", СтрокаПЗ.ПроцентГотовности);
		СтруктураСроков.Вставить("ДатаНачала", СтрокаПЗ.ДатаНачалаФакт);
		СтруктураСроков.Вставить("ДатаЗавершения", СтрокаПЗ.ДатаЗавершенияФакт);
		МассивСроков.Добавить(СтруктураСроков);
	КонецЦикла;
	
	Возврат МассивСроков;
	
КонецФункции

Функция ДанныеСроковПроектныхЗадачПоРЦК(СписокЗадачПоРЦК, СписокДокументовРЦК)
	
	СрокиДокументовРЦК = Новый Соответствие;
	ДанныеСроковПроектныхЗадачПоРЦК = Новый Массив;
	Для каждого ПроектнаяЗадача Из СписокЗадачПоРЦК Цикл
		ДокументРЦК = СписокДокументовРЦК.Получить(ПроектнаяЗадача);
		
		Если Не ЗначениеЗаполнено(ДокументРЦК) Тогда
			Продолжить;
		КонецЕсли;
		
		СрокиДокументаРЦК = СрокиДокументовРЦК.Получить(ДокументРЦК);
		Если СрокиДокументаРЦК = Неопределено Тогда
			СрокиДокументаРЦК = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРЦК, "ДатаНачалаРаботПлан, ДатаОкончанияРаботПлан");
			СрокиДокументовРЦК.Вставить(ДокументРЦК, СрокиДокументаРЦК);
		КонецЕсли;
		
		СтруктураДанных = Новый Структура("ПроектнаяЗадача, ДатаНачалаПлан, ДатаЗавершенияПлан", ПроектнаяЗадача,
				СрокиДокументаРЦК.ДатаНачалаРаботПлан, СрокиДокументаРЦК.ДатаОкончанияРаботПлан);
		ДанныеСроковПроектныхЗадачПоРЦК.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат ДанныеСроковПроектныхЗадачПоРЦК;
	
КонецФункции

#КонецОбласти

#Область АктуализацияСтруктурыПоПодчиненнымПроектам

Функция ПолучитьДанныеПоАктируемымЭтапамПодчиненнойЗадачи(Проект, ДатаСтартаПроекта, ПЗПроекта, ДопПараметры)
	
	АктуализироватьПланВыпускаПоДоходам = ДопПараметры.АктуализироватьПланВыпускаПоДоходам;
	ПустаяПроектнаяЗадача = ДопПараметры.ПустаяПроектнаяЗадача;
	СписокВерсий = ДопПараметры.СписокВерсий;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроектныеЗадачиПроектаДоходы();
	
	Если СписокВерсий = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВерсиям", "И упоВерсииПроекта.Текущая");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВерсиям", "И упоВерсииПроекта.Версия В (&СписокВерсий)");
		Запрос.УстановитьПараметр("СписокВерсий", СписокВерсий);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоПроекту = РезультатЗапроса.Выгрузить();
	
	ДанныеПоПроекту.Индексы.Добавить("ЗадачаРодитель");
	
	ДанныеПоАктируемымЭтапам = Новый ТаблицаЗначений;
	ДанныеПоАктируемымЭтапам.Колонки.Добавить("АктируемыйЭтап", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	ДанныеПоАктируемымЭтапам.Колонки.Добавить("БылАктируемыйЭтап", Новый ОписаниеТипов("Булево"));
	ДанныеПоАктируемымЭтапам.Колонки.Добавить("ПроектнаяЗадача",
		Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	
	Если ПЗПроекта = Неопределено Тогда
		ЗаполнитьДанныеПоАктируемымЭтапамРекурсивно(ПустаяПроектнаяЗадача, ДанныеПоПроекту, ДанныеПоАктируемымЭтапам, Ложь,
			Неопределено);
	Иначе
		Строка = ДанныеПоАктируемымЭтапам.Добавить();
		Строка.АктируемыйЭтап = ПЗПроекта;
		Строка.БылАктируемыйЭтап = Истина;
		Строка.ПроектнаяЗадача = ПЗПроекта;
		ЗаполнитьДанныеПоАктируемымЭтапамРекурсивно(ПЗПроекта, ДанныеПоПроекту, ДанныеПоАктируемымЭтапам, Истина,
			ПЗПроекта);
	КонецЕсли;
	
	ВерсияПроектаПЗ = Неопределено;
	Если ДанныеПоПроекту.Количество() <> 0 Тогда
		ВерсияПроектаПЗ = ДанныеПоПроекту[0].Версия;
	КонецЕсли;
	
	Данные = ПолучитьДанныеПоЗадачамАктируемыхЭтапов(ДанныеПоАктируемымЭтапам, ДатаСтартаПроекта, ВерсияПроектаПЗ,
			АктуализироватьПланВыпускаПоДоходам);
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьДанныеПоЗадачамАктируемыхЭтапов(ДанныеПоАктируемымЭтапам, ДатаСтартаПроекта, ВерсияПроектаПЗ,
		АктуализироватьПланВыпускаПоДоходам)
	
	ДанныеПоАктирЭтапам = Новый ТаблицаЗначений;
	ДанныеПоАктирЭтапам.Колонки.Добавить("АктируемыйЭтап");
	ДанныеПоАктирЭтапам.Колонки.Добавить("ДанныеАктируемогоЭтапа");
	Если ДанныеПоАктируемымЭтапам.Количество() = 0 Тогда
		Возврат ДанныеПоАктирЭтапам;
	КонецЕсли;
	
	ПЗДляАктуальныхПланов = ПолучитьПроектныеЗадачиДляАктуальныхПланов(ДанныеПоАктируемымЭтапам);
	ПЗДляДанныхПланов = ПолучитьПроектныеЗадачиДляДанныхПланов(ДанныеПоАктируемымЭтапам);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДоходовДляАктуализацииСтруктурыПоПодчиненным();
	
	ИсточникПлана = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы");
	
	ВерсияМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВерсияПроектаПЗ);
	Запрос.УстановитьПараметр("Версии", ВерсияМассив);
	Запрос.УстановитьПараметр("ПроектныеЗадачиАктПланы", ПЗДляАктуальныхПланов);
	Запрос.УстановитьПараметр("ПроектныеЗадачиДанныеПланы", ПЗДляДанныхПланов);
	Запрос.УстановитьПараметр("ДанныеПоАктируемымЭтапам", ДанныеПоАктируемымЭтапам);
	Запрос.УстановитьПараметр("ДатаСтартаПроекта", ДатаСтартаПроекта);
	Запрос.УстановитьПараметр("ИсточникПлана", ИсточникПлана);
	
	Если АктуализироватьПланВыпускаПоДоходам Тогда
		Запрос.УстановитьПараметр("ОтделитьСубпродукты", Истина);
		Запрос.УстановитьПараметр("ИсточникПланаОбъемы", Перечисления.упоИсточникПланаДоходовИРасходов.Объемы);
	Иначе
		Запрос.УстановитьПараметр("ОтделитьСубпродукты", Ложь);
		Запрос.УстановитьПараметр("ИсточникПланаОбъемы", Неопределено);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоЗапросов = РезультатЗапроса.ВГраница();
	РаспределениеПоПодразделениям = РезультатЗапроса[КоличествоЗапросов].Выгрузить();
	ДоходыРасходы = РезультатЗапроса[КоличествоЗапросов - 1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЗаполнитьДанныеПоАктируемымЭтапамПоПолученнымТаблицам(ДанныеПоАктирЭтапам,
		ДоходыРасходы, РаспределениеПоПодразделениям);
	
	Возврат ДанныеПоАктирЭтапам;
	
КонецФункции

Процедура АктуализироватьДоходыСтруктурыПоПодчиненнымПроектам(ВерсияПроекта, ДокументСохранения, АктуализироватьПланВыпускаПоДоходам,
		СлужебныеКоллекции)
	
	СписокЗадач = Неопределено;
	СписокВерсий = Неопределено;
	
	СлужебныеКоллекции.Свойство("СписокЗадач", СписокЗадач);
	СлужебныеКоллекции.Свойство("СписокВерсий", СписокВерсий);
	
	ДокументСохранения.ПерезаписатьПланДоходов = Истина;
	
	Если СписокЗадач = Неопределено Тогда
		СтрокаЗамены = "ИСТИНА";
	Иначе
		СтрокаЗамены = "ПроектнаяЗадача В (&СписокЗадач)";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапросаПолученияПодчиненныхЗадачДоходы();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборЗадач", СтрокаЗамены);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Версия", ВерсияПроекта);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	ПустаяСсылкаПроекта =
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Проекты.ПустаяСсылка");
	Запрос.УстановитьПараметр("ПустаяСсылкаПроекта", ПустаяСсылкаПроекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПодчиненныхЗадач = РезультатЗапроса.Выбрать();
	
	ДопДанные = ПолучитьДопДанныеДляСозданияПЗ(ВерсияПроекта.Проект, ВерсияПроекта);
	ДатаСтартаПроекта = ДопДанные.ДатаСтартаПроекта;
	
	ПустаяПроектнаяЗадача = ОбщегоНазначения.ПредопределенныйЭлемент("Документ.упоПроектнаяЗадача.ПустаяСсылка");
	ТипЗадачиЭтап = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоТипПроектнойЗадачи.Этап");
	Пока ВыборкаПодчиненныхЗадач.Следующий() Цикл
		
		ПроектнаяЗадача = ВыборкаПодчиненныхЗадач.ПроектнаяЗадача;
		ОбновленныеПЗ = ДопДанные.ОбновленныеПЗ;
		Если ОбновленныеПЗ[ПроектнаяЗадача] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// TODO Вынести получение сроков и отбор по ним в запрос ПолучитьТекстЗапросаПолученияПодчиненныхЗадач
		СрокиПодчиненногоПроекта =
			упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроекта(ВыборкаПодчиненныхЗадач.ПодчиненныйПроект);
		
		Если СрокиПодчиненногоПроекта.ДатаЗавершенияПлан < ДатаСтартаПроекта Тогда
			Продолжить;
		КонецЕсли;
		
		ПЗПодчиненногоПроекта = Неопределено;
		Если ВыборкаПодчиненныхЗадач.ПодчиненнаяПроектнаяЗадача <> ПустаяСсылкаПроекта Тогда
			ПЗПодчиненногоПроекта = ВыборкаПодчиненныхЗадач.ПодчиненнаяПроектнаяЗадачаДокумент;
			// TODO Вынести получение сроков и отбор по ним в запрос ПолучитьТекстЗапросаПолученияПодчиненныхЗадач
			СрокиПодчиненнойПЗ = упоПроектыИЗадачиСервер.ПолучитьСрокиПроектнойЗадачи(ПЗПодчиненногоПроекта);
			Если СрокиПодчиненнойПЗ.ДатаЗавершенияПлан < ДатаСтартаПроекта Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ПЗПодчиненногоПроекта = Неопределено Тогда
			// TODO Сделать изменение типа сразу по всем проектным задачам выборки, через документ сохранения даннах проекта
			ИзменитьТипЗадачи(ПроектнаяЗадача, ТипЗадачиЭтап);
		КонецЕсли;
		
		// TODO Сделать получение данных через транзитивное замыкание, если получиться и вынести из цикла выборки
		ДопПараметры = Новый Структура("АктуализироватьПланВыпускаПоДоходам, ПустаяПроектнаяЗадача, СписокВерсий",
				АктуализироватьПланВыпускаПоДоходам, ПустаяПроектнаяЗадача, СписокВерсий);
		ДанныеПоПЗ = ПолучитьДанныеПоАктируемымЭтапамПодчиненнойЗадачи(ВыборкаПодчиненныхЗадач.ПодчиненныйПроект,
				ДатаСтартаПроекта, ПЗПодчиненногоПроекта, ДопПараметры);
		
		// TODO См. комментарий к переменной ОбновленныеПЗ в методе СоздатьПЗпоДаннымПодчиненнойПЗ,
		// если избавиться от ОбновленныеПЗ, то возможно получить и от этого свойства избавиться
		ДопДанные.ТолькоОбновлениеЗадачи = ПЗПодчиненногоПроекта <> Неопределено;
		
		// TODO Вынести получение данных по проекту из цикла
		СоздатьПЗпоДаннымПодчиненнойПЗ(ДанныеПоПЗ, ДокументСохранения, ПроектнаяЗадача, ДопДанные);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьПЗпоДаннымПодчиненнойПЗ(ДанныеПоПЗ, ДокументСохранения, ПроектнаяЗадачаРодитель, ДопДанные)
	
	Проект = ДопДанные.Проект;
	ВерсияПроекта = ДопДанные.ВерсияПроекта;
	РабочийКалендарьПроекта = ДопДанные.РабочийКалендарьПроекта;
	ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.РабочийДень;
	ТипПроектнойЗадачи = ДопДанные.ТипПроектнойЗадачи;
	ТолькоОбновлениеЗадачи = ДопДанные.ТолькоОбновлениеЗадачи;
	ДатаСтартаПроекта = ДопДанные.ДатаСтартаПроекта;
	// TODO Свойство ОбновленныеПЗ Введено, для того чтобы не обновлять задачи по нескольку раз,
	// так как выборка из АктуализироватьБДР не обеспечивает иерархию проекта, нужно реализовать обход этой проблемы.
	// Эта проблема возникает только при актуализации всего проекта
	ОбновленныеПЗ = ДопДанные.ОбновленныеПЗ;
	
	Если ТолькоОбновлениеЗадачи Тогда
		ДетиПроектнойЗадачиРодителя = ПолучитьДетейЗаданнойЗадачи("", ВерсияПроекта);
	Иначе
		ДетиПроектнойЗадачиРодителя = ПолучитьДетейЗаданнойЗадачи(ПроектнаяЗадачаРодитель, ВерсияПроекта);
	КонецЕсли;
	
	// Кэширование сроков
	АктируемыеЭтапы = Новый Массив;
	Для Каждого СтрокаТаблицы Из ДанныеПоПЗ Цикл
		АктируемыеЭтапы.Добавить(СтрокаТаблицы.АктируемыйЭтап);
	КонецЦикла;
	СрокиАктируемыхЭтапов = упоПроектыИЗадачиСервер.СрокиПроектныхЗадач(АктируемыеЭтапы);
	НазванияАктируемыхЭтапов = упоПроектыИЗадачиСервер.НазванияПроектныхЗадач(АктируемыеЭтапы);
	//
	НайденныеЗадачиЭтапа = Новый Массив;
	Для Каждого СтрокаТаблицы Из ДанныеПоПЗ Цикл
		
		АктируемыйЭтап = СтрокаТаблицы.АктируемыйЭтап;
		ДанныеПоАктируемомуЭтапу = СтрокаТаблицы.ДанныеАктируемогоЭтапа;
		
		СрокиПодчиненнойПЗ = СрокиАктируемыхЭтапов.Получить(АктируемыйЭтап);
		Если СрокиПодчиненнойПЗ.ДатаЗавершенияПлан < ДатаСтартаПроекта Тогда
			НайденнаяСтрока = ДетиПроектнойЗадачиРодителя.Найти(АктируемыйЭтап, "ПодчиненнаяПроектнаяЗадача");
			Если НайденнаяСтрока <> Неопределено Тогда
				ОбновленныеПЗ.Вставить(НайденнаяСтрока.ПроектнаяЗадача, Истина);
				НайденныеЗадачиЭтапа.Добавить(НайденнаяСтрока.ПроектнаяЗадача);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Ложь;
		
		Если ТолькоОбновлениеЗадачи Тогда
			Если ОбновленныеПЗ[ПроектнаяЗадачаРодитель] <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			// TODO Возможно стоит переделать обновление данных табличных честей, через документ сохранения данных проекта
			ПроектнаяЗадачаОб = ПроектнаяЗадачаРодитель.ПолучитьОбъект();
			ПроектнаяЗадачаОб.ПолучитьДанныеВерсии(Неопределено);
			ОбновленныеПЗ.Вставить(ПроектнаяЗадачаРодитель, Истина);
		Иначе
			НайденнаяСтрока = ДетиПроектнойЗадачиРодителя.Найти(АктируемыйЭтап, "ПодчиненнаяПроектнаяЗадача");
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденныеЗадачиЭтапа.Добавить(НайденнаяСтрока.ПроектнаяЗадача);
				Если ОбновленныеПЗ[НайденнаяСтрока.ПроектнаяЗадача] <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				// TODO Возможно стоит переделать обновление данных табличных честей, через документ сохранения данных проекта
				ПроектнаяЗадачаОб = НайденнаяСтрока.ПроектнаяЗадача.ПолучитьОбъект();
				ПроектнаяЗадачаОб.ПолучитьДанныеВерсии(Неопределено);
				ОбновленныеПЗ.Вставить(НайденнаяСтрока.ПроектнаяЗадача, Истина);
			Иначе
				НовыйДокумент = Истина;
				ПроектнаяЗадачаОб = Документы.упоПроектнаяЗадача.СоздатьДокумент();
				ПроектнаяЗадачаОб.ТипПроектнойЗадачи = ТипПроектнойЗадачи;
				// TODO Убрать получение Проекта АктируемогоЭтапа из цикла, добавить поле в таблицу ДанныеПоПЗ
				ПроектнаяЗадачаОб.ПодчиненныйПроект = АктируемыйЭтап.Проект;
				// TODO Убрать получение связанного элемента АктируемогоЭтапа из цикла, добавить поле в таблицу ДанныеПоПЗ
				ПроектнаяЗадачаОб.ПодчиненнаяПроектнаяЗадача =
					упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(АктируемыйЭтап);
				ПроектнаяЗадачаОб.ЗадачаРодитель = ПроектнаяЗадачаРодитель;
				ПроектнаяЗадачаОб.Проект = Проект;
				ПроектнаяЗадачаОб.ЕдиницаНормированияДлительности = ЕдиницаНормированияДлительности;
				// TODO Убрать получение сроков АктируемогоЭтапа из цикла, добавить поле в таблицу ДанныеПоПЗ
				// скопировано из Обработки.упоЗагрузитьИзПодчиненныхПроектов.Форма.Форма
				РасчитатьНовыеСроки(ПроектнаяЗадачаОб, АктируемыйЭтап, ДопДанные);
			КонецЕсли;
		КонецЕсли;
		
		// TODO Убрать получение НазваниеПроектнойЗадачи АктируемогоЭтапа из цикла, добавить поле в таблицу ДанныеПоПЗ
		ПроектнаяЗадачаОб.НазваниеПроектнойЗадачи = НазванияАктируемыхЭтапов[АктируемыйЭтап];
		
		// План доходов
		ПроектнаяЗадачаОб.ВключитьПланДоходовВБДДС = Ложь;
		Если НовыйДокумент Тогда
			ПроектнаяЗадачаоб.ДополнительныеСвойства.Вставить("ДанныеВерсииПолучены", Истина);
			ПроектнаяЗадачаоб.ДополнительныеСвойства.Вставить("ЭтоИнтерактивнаяЗапись", Ложь);
			ПроектнаяЗадачаоб.Дата = ТекущаяДатаСеанса();
			ПроектнаяЗадачаоб.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗаполнитьДоходыСохранениеПроекта(ПроектнаяЗадачаОб.Ссылка, ДокументСохранения, ДанныеПоАктируемомуЭтапу);
		
	КонецЦикла;
	
	ОтменитьЗадачиЭтапаРодителя(ДетиПроектнойЗадачиРодителя, НайденныеЗадачиЭтапа, Проект, ОбновленныеПЗ);
	
КонецПроцедуры

Процедура ЗаполнитьДоходыСохранениеПроекта(ПроектнаяЗадача, ДокументСохранения, ДанныеПоАктируемомуЭтапу)
	
	ПланДоходов = ДокументСохранения.ПланДоходов;
	ПланДоходовПоПодразделениям = ДокументСохранения.ПланДоходовПоПодразделениям;
	ТаблицаДоходов = ДанныеПоАктируемомуЭтапу.ТаблицаДоходов;
	ТаблицаПланДоходовПоПодразделениям = ДанныеПоАктируемомуЭтапу.ТаблицаРаспределенияДоходов;
	
	Для Каждого Строка Из ТаблицаДоходов Цикл
		СтрокаПланДоходов = ПланДоходов.Добавить();
		СтрокаПланДоходов.ПроектнаяЗадача = ПроектнаяЗадача;
		ЗаполнитьЗначенияСвойств(СтрокаПланДоходов, Строка);
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаПланДоходовПоПодразделениям Цикл
		СтрокаРаспределенияДоходов = ПланДоходовПоПодразделениям.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРаспределенияДоходов, Строка);
		СтрокаРаспределенияДоходов.ПроектнаяЗадача = ПроектнаяЗадача;
		СтрокаРаспределенияДоходов.СпособПривязки = Строка.СпособПривязкиРаспределения;
		СтрокаРаспределенияДоходов.ПрофильРаспределения = Строка.ПрофильРаспределенияРаспределения;
		СтрокаРаспределенияДоходов.ДатаПривязки = Строка.ДатаПривязкиРаспределения;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область АктуализацияТрудозатрат

Процедура АктуализироватьТрудозатраты(ВерсияКорневогоПроекта, ДокументСохранения, СлужебныеКоллекции, УровеньПланирования)
	
	СписокЗадач = Неопределено;
	СписокВерсий = Неопределено;
	СвойстваПроектныхЗадачСоответствие = Неопределено;
		
	СлужебныеКоллекции.Свойство("СписокЗадач", СписокЗадач);
	СлужебныеКоллекции.Свойство("СписокВерсий", СписокВерсий);
	СлужебныеКоллекции.Свойство("СвойстваПроектныхЗадачСоответствие", СвойстваПроектныхЗадачСоответствие);
		
	ДокументСохранения.ПерезаписатьТрудовыеРесурсыРоли = Истина;
	
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(ВерсияКорневогоПроекта.Проект, Истина, ВерсияКорневогоПроекта);
	УровеньПланирования = ?(УровеньПланирования = Неопределено, Перечисления.упоУровеньПланирования.ПустаяСсылка(),
			УровеньПланирования);
	
	ТекстЗапроса = ТекстЗапросаТрудозатрат();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаСтартаПроекта", ДатаСтартаПроекта);
	Запрос.УстановитьПараметр("УровеньПланирования", УровеньПланирования);
	Запрос.УстановитьПараметр("СписокВерсий", СписокВерсий);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	Запрос.УстановитьПараметр("ВерсияКорневогоПроекта", ВерсияКорневогоПроекта);
	Запрос.УстановитьПараметр("КорневойПроект", ВерсияКорневогоПроекта.Проект);
	
	// Данные по подчиненным проектам нужны все, поэтому выполняем в привилегированнои режиме.
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПроектнаяЗадачаИндекс = МаксимальныеИндексыСтрокРаспределенияПоПериодамТрудозатрат(ВерсияКорневогоПроекта, 
		СписокЗадач);
	
	ЗаполнитьТрудозатратыСохранениеПроекта(ДокументСохранения, РезультатЗапроса, СвойстваПроектныхЗадачСоответствие,
		ПроектнаяЗадачаИндекс);
	
КонецПроцедуры

Процедура ЗаполнитьТрудозатратыСохранениеПроекта(ДокументСохранения, РезультатЗапроса, 
	СвойстваПроектныхЗадачСоответствие, ПроектнаяЗадачаИндекс)
	
	ИндексТрудовыеРесурсы = 7;
	ИндексТрудовыеРесурсыПоПериодам = 8;
	
	Если РезультатЗапроса[ИндексТрудовыеРесурсы].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтруктура = Новый Структура("ПроектнаяЗадача, Ресурс");
	ТаблицаТрудовыеРесурсыПоПериодам = РезультатЗапроса[ИндексТрудовыеРесурсыПоПериодам].Выгрузить();
	ВыборкаПроектныеЗадачи = РезультатЗапроса[ИндексТрудовыеРесурсы].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПроектныеЗадачи.Следующий() Цикл
		
		МаксимальныйИндекс = ПроектнаяЗадачаИндекс[ВыборкаПроектныеЗадачи.ПроектнаяЗадача];
		Если МаксимальныйИндекс = Неопределено Тогда
			СледующийИндекс = 1;
		Иначе
			СледующийИндекс = МаксимальныйИндекс + 1;
		КонецЕсли;
		
		Выборка = ВыборкаПроектныеЗадачи.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ДокументСохранения.ТрудовыеРесурсыРоли.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ИндексСтрокРаспределенияПоПериодам = СледующийИндекс;
			СледующийИндекс = СледующийИндекс + 1;
			
			Если НоваяСтрока.Отмена Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОтборСтруктура, НоваяСтрока);
			НайденныеСтроки = ТаблицаТрудовыеРесурсыПоПериодам.НайтиСтроки(ОтборСтруктура);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НоваяСтрокаПоПериодам = ДокументСохранения.ТрудовыеРесурсыРолиПоПериодам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоПериодам, НайденнаяСтрока);
				НоваяСтрокаПоПериодам.ИндексСтрокиРаспределениеПоРолям = НоваяСтрока.ИндексСтрокРаспределенияПоПериодам;
			КонецЦикла;
			
			ПараметрыОтбора = Новый Структура("ПроектнаяЗадача", Выборка.ПроектнаяЗадача);
			СуществующиеЗаписи = ДокументСохранения.ПроектныеЗадачи.НайтиСтроки(ПараметрыОтбора);
			Если ЗначениеЗаполнено(СуществующиеЗаписи) Тогда
				СтрокаИзмененияСвойствПроектнойЗадачи = СуществующиеЗаписи[0];
			Иначе
				СвойстваПроектнойЗадачи = СвойстваПроектныхЗадачСоответствие[Выборка.ПроектнаяЗадача];
				СтрокаИзмененияСвойствПроектнойЗадачи = ДокументСохранения.ПроектныеЗадачи.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаИзмененияСвойствПроектнойЗадачи, СвойстваПроектнойЗадачи);
			КонецЕсли;
			
		    СтрокаИзмененияСвойствПроектнойЗадачи.ВключитьТрудРесурсыВПланРасходов = Ложь;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АктуализироватьТрудозатратыПоДокументамРЦК(ВерсияПроекта, ДокументСохранения, СписокЗадач,
		СоответсвиеДокументовРЦК, УровеньПланирования) Экспорт
	
	ДокументСохранения.ПерезаписатьТрудовыеРесурсыРоли = Истина;
	
	СпособПривязки = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
	ПрофильРаспределения = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение");
	ЕдиницаНормирования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоЕдиницыВремени.Час");
	
	ЗначенияПоУмолчанию = Новый Структура;
	ЗначенияПоУмолчанию.Вставить("ЕдиницаНормирования", ЕдиницаНормирования);
	ЗначенияПоУмолчанию.Вставить("СпособПривязки", СпособПривязки);
	ЗначенияПоУмолчанию.Вставить("ПрофильРаспределения", ПрофильРаспределения);
	ЗначенияПоУмолчанию.Вставить("Версия", ВерсияПроекта);
	ЗначенияПоУмолчанию.Вставить("УровеньПланирования", УровеньПланирования);
	ЗначенияПоУмолчанию.Вставить("Период", ТекущаяДатаСеанса());
	ЗначенияПоУмолчанию.Вставить("ИсточникПлана", Перечисления.упоИсточникПланаТрудозатратРолей.Трудозатраты);
	
	Для Каждого ПроектнаяЗадача Из СписокЗадач Цикл
		
		ДокументРЦК = СоответсвиеДокументовРЦК.Получить(ПроектнаяЗадача);
		
		Если Не ЗначениеЗаполнено(ДокументРЦК) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияПоУмолчанию.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		
		обДокументРЦК = ДокументРЦК.ПолучитьОбъект();
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("Специальность");
		ТаблицаДанных.Колонки.Добавить("Подразделение");
		ТаблицаДанных.Колонки.Добавить("КоличествоЧасов");
		
		Для Каждого СтрокаДокумента Из обДокументРЦК.ТрудозатратыПИРНИР Цикл
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		КонецЦикла;
		
		Для Каждого СтрокаДокумента Из обДокументРЦК.ТрудозатратыПНР Цикл
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		КонецЦикла;
		
		Для Каждого СтрокаДокумента Из обДокументРЦК.ТрудозатратыСМР Цикл
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		КонецЦикла;
		
		Для Каждого СтрокаДокумента Из обДокументРЦК.ТрудозатратыПрочие Цикл
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		КонецЦикла;
		ТаблицаДанных.Свернуть("Специальность, Подразделение", "КоличествоЧасов");
		
		ЗаполнитьТрудозатратыСохранениеПроектаРЦК(ДокументСохранения, ТаблицаДанных, ЗначенияПоУмолчанию);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТрудозатратыСохранениеПроектаРЦК(ДокументСохранения, ДанныеПоАктируемомуЭтапу, ЗначенияПоУмолчанию)
	
	Для Каждого СтрокаДокумента Из ДанныеПоАктируемомуЭтапу Цикл
		
		СтрокаТрудовыеРесурсы = ДокументСохранения.ТрудовыеРесурсыРоли.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТрудовыеРесурсы, ЗначенияПоУмолчанию);
		СтрокаТрудовыеРесурсы.Ресурс = СтрокаДокумента.Специальность;
		СтрокаТрудовыеРесурсы.Подразделение = СтрокаДокумента.Подразделение;
		СтрокаТрудовыеРесурсы.Количество = СтрокаДокумента.КоличествоЧасов;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область АктуализацияСубпродуктов

Процедура АктуализироватьСубпродукты(ВерсияКорневогоПроекта, ДокументСохранения, СлужебныеКоллекции, ТолькоВключенныеВБДР = Ложь)
	
	СписокЗадач = Неопределено;
	СписокВерсий = Неопределено;
	СвойстваПроектныхЗадачСоответствие = Неопределено;
	
	СлужебныеКоллекции.Свойство("СписокЗадач", СписокЗадач);
	СлужебныеКоллекции.Свойство("СписокВерсий", СписокВерсий);
	СлужебныеКоллекции.Свойство("СвойстваПроектныхЗадачСоответствие", СвойстваПроектныхЗадачСоответствие);
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВерсияКорневогоПроекта, "Проект");
	
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(Проект, Истина, ВерсияКорневогоПроекта);
	СпособПривязкиРаспределение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиРаспределения.НаДату");
	
	ЗначенияПоУмолчанию = Новый Структура;
	ЗначенияПоУмолчанию.Вставить("Версия", ВерсияКорневогоПроекта);
	ЗначенияПоУмолчанию.Вставить("СпособПривязкиРаспределение", СпособПривязкиРаспределение);
	
	ДокументСохранения.ПерезаписатьСубпродукты = Истина;
	ДокументСохранения.ПерезаписатьВключитьСубпродуктыВПланДоходов = Истина;
	
	Если ТолькоВключенныеВБДР Тогда
		ТекстЗапроса = ТекстЗапросаСубпродуктов();
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаСтартаПроекта", ДатаСтартаПроекта);
		Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.Объемы);
		Запрос.УстановитьПараметр("СписокВерсий", СписокВерсий);
		Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
		Запрос.УстановитьПараметр("ВерсияКорневогоПроекта", ВерсияКорневогоПроекта);
	Иначе
		ТекстЗапроса = ТекстЗапросаПланВыпуска();
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаСтартаПроекта", ДатаСтартаПроекта);
		Запрос.УстановитьПараметр("ВидОбъема", Перечисления.упоВидЭлементаОбъемов.Доход);
		Запрос.УстановитьПараметр("СписокВерсий", СписокВерсий);
		Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
		Запрос.УстановитьПараметр("ВерсияКорневогоПроекта", ВерсияКорневогоПроекта);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	т_ДанныеПланаВыпуска = Результат.Выгрузить();
	
	м_СписокПроектныхЗадач = т_ДанныеПланаВыпуска.ВыгрузитьКолонку("ПроектнаяЗадача");
	м_СписокПроектныхЗадач = ОбщегоНазначенияКлиентСервер.СвернутьМассив(м_СписокПроектныхЗадач);
	
	Для Каждого ПроектнаяЗадача Из м_СписокПроектныхЗадач Цикл
		
		СвойстваПроектнойЗадачи = СвойстваПроектныхЗадачСоответствие[ПроектнаяЗадача];
		
		ДатаВыпуска = СвойстваПроектнойЗадачи.ДатаЗавершенияПлан;
		
		ЗначенияПоУмолчанию.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		ЗначенияПоУмолчанию.Вставить("ДатаВыпуска", ДатаВыпуска);
		
		СтруктураОтбора = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
		м_ДанныеПланаВыпускаПоЗадаче = т_ДанныеПланаВыпуска.НайтиСтроки(СтруктураОтбора);
		Если м_ДанныеПланаВыпускаПоЗадаче.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуществующиеЗаписиДокумента = ДокументСохранения.ПроектныеЗадачи.НайтиСтроки(СтруктураОтбора);
		Если НЕ ЗначениеЗаполнено(СуществующиеЗаписиДокумента) Тогда
			СтрокаИзмененияСвойствПроектнойЗадачи = ДокументСохранения.ПроектныеЗадачи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИзмененияСвойствПроектнойЗадачи, СвойстваПроектнойЗадачи);
		Иначе
			СтрокаИзмененияСвойствПроектнойЗадачи = СуществующиеЗаписиДокумента[0];
		КонецЕсли;
		
		т_ДанныеПланаВыпускаПоЗадаче = т_ДанныеПланаВыпуска.Скопировать(м_ДанныеПланаВыпускаПоЗадаче);
		
		ЗаполнитьСубпродуктыСохранениеПроекта(ПроектнаяЗадача, ДокументСохранения, ЗначенияПоУмолчанию, 
			т_ДанныеПланаВыпускаПоЗадаче);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьСубпродуктыСохранениеПроекта(ПроектнаяЗадача, ДокументСохранения, ЗначенияПоУмолчанию, 
	т_ДанныеПланаВыпускаПоЗадаче)
	
	т_ГруппыПланаВыпускаПоЗадаче = т_ДанныеПланаВыпускаПоЗадаче.Скопировать();
	т_ГруппыПланаВыпускаПоЗадаче.Свернуть("Регистратор,
		|ПроектнаяЗадача,
		| Версия,
		| Ресурс,
		| ЕдиницаНормирования,
		| Валюта",
		" Количество,
		| ОбщСтоимость");
	
	ИндексСтроки = 1;
	
	Для Каждого СтрокаГруппировки Из т_ГруппыПланаВыпускаПоЗадаче Цикл
		
		//Не должно быть строк группировки с нулевым количеством, но на всякий случай проверим
		Если СтрокаГруппировки.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//Заполним субпродукты
		СтрокаСубпродукты = ДокументСохранения.Субпродукты.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаСубпродукты, СтрокаГруппировки);
		ЗаполнитьЗначенияСвойств(СтрокаСубпродукты, ЗначенияПоУмолчанию);
		
		СтрокаСубпродукты.ИндексСтрокРаспределения = ИндексСтроки;
		СтрокаСубпродукты.Стоимость = СтрокаСубпродукты.ОбщСтоимость / СтрокаСубпродукты.Количество;
		
		//Заполним субпродукты по подразделениям
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Регистратор", 		СтрокаГруппировки.Регистратор);
		СтруктураОтбора.Вставить("ПроектнаяЗадача", 	СтрокаГруппировки.ПроектнаяЗадача);
		СтруктураОтбора.Вставить("Версия", 				СтрокаГруппировки.Версия);
		СтруктураОтбора.Вставить("Ресурс", 				СтрокаГруппировки.Ресурс);
		СтруктураОтбора.Вставить("ЕдиницаНормирования", СтрокаГруппировки.ЕдиницаНормирования);
		СтруктураОтбора.Вставить("Валюта", 				СтрокаГруппировки.Валюта);
		
		м_ДанныеРаспределения = т_ДанныеПланаВыпускаПоЗадаче.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого СтрокаРаспределения Из м_ДанныеРаспределения Цикл
			СтрокаСубпродуктыПоПодразделениям = ДокументСохранения.СубпродуктыПоПодразделениям.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаСубпродуктыПоПодразделениям, СтрокаРаспределения);
			ЗаполнитьЗначенияСвойств(СтрокаСубпродуктыПоПодразделениям, ЗначенияПоУмолчанию);
			
			СтрокаСубпродуктыПоПодразделениям.ИндексСтрокиВладельца = ИндексСтроки;
			СтрокаСубпродуктыПоПодразделениям.СпособПривязки = ЗначенияПоУмолчанию.СпособПривязкиРаспределение;
			СтрокаСубпродуктыПоПодразделениям.ДатаПривязки = СтрокаРаспределения.ДатаПривязкиРаспределение;
			СтрокаСубпродуктыПоПодразделениям.Сумма = СтрокаРаспределения.ОбщСтоимость;
		КонецЦикла;
		
		ИндексСтроки = ИндексСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АктуализироватьСубпродуктыПоДокументамРЦК(ВерсияПроекта, ДокументСохранения, СлужебныеКоллекции,
		СоответсвиеДокументовРЦК, ПараметрыАктуализации) Экспорт
	
	ДокументСохранения.ПерезаписатьСубпродукты = Истина;
	
	СписокЗадач = Неопределено;
	СвойстваПроектныхЗадачСоответствие = Неопределено;
	
	СлужебныеКоллекции.Свойство("СписокЗадач", СписокЗадач);
	СлужебныеКоллекции.Свойство("СвойстваПроектныхЗадачСоответствие", СвойстваПроектныхЗадачСоответствие);
	
	АктуализироватьСубпродукты = Ложь;
	Если ПараметрыАктуализации.Свойство("АктуализироватьПланВыпускаПоДоходам") Тогда
		АктуализироватьСубпродукты = ПараметрыАктуализации.АктуализироватьПланВыпускаПоДоходам;
	КонецЕсли;
	
	Если Не АктуализироватьСубпродукты Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВерсияПроекта.Проект, "СтатьяДоходовПоУмолчанию, РольДоходовПоУмолчанию, ПодразделениеДоходовПоУмолчанию");
	СпособПривязки = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату");
	СобственныеСилы = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы");
	СпособПривязкиРаспределение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиРаспределения.НаДату");
	ИсточникПланаОбъемы = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.Объемы");
	
	ЗначенияПоУмолчанию = Новый Структура;
	ЗначенияПоУмолчанию.Вставить("ВидОбъема", ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЭлементаОбъемов.Доход"));
	ЗначенияПоУмолчанию.Вставить("СпособПривязки", СпособПривязки);
	ЗначенияПоУмолчанию.Вставить("СпособПривязкиРаспределение", СпособПривязкиРаспределение);
	ЗначенияПоУмолчанию.Вставить("СтатьяДоходов", ДанныеПроекта.СтатьяДоходовПоУмолчанию);
	ЗначенияПоУмолчанию.Вставить("Роль", ДанныеПроекта.РольДоходовПоУмолчанию);
	ЗначенияПоУмолчанию.Вставить("Подразделение", ДанныеПроекта.ПодразделениеДоходовПоУмолчанию);
	ЗначенияПоУмолчанию.Вставить("СпособПривязкиДоходов", СпособПривязки);
	ЗначенияПоУмолчанию.Вставить("СобствСилы_Субподряд", СобственныеСилы);
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Версия", ВерсияПроекта);
	ДанныеШапки.Вставить("Период", ТекущаяДатаСеанса());
	
	Для Каждого ПроектнаяЗадача Из СписокЗадач Цикл
		
		ДокументРЦК = СоответсвиеДокументовРЦК.Получить(ПроектнаяЗадача);
		ДанныеШапки.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		
		Если Не ЗначениеЗаполнено(ДокументРЦК) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияПоУмолчанию.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		
		обДокументРЦК = ДокументРЦК.ПолучитьОбъект();
		
		ДанныеШапки.Вставить("Валюта", обДокументРЦК.Валюта);
		
		ОперацияОборудование = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоВидыОпераций.Оборудование");
		СтрокиРасчета = обДокументРЦК.ПараметрыРасчета.НайтиСтроки(Новый Структура("ВидОперации", ОперацияОборудование));
		
		Если СтрокиРасчета.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаКонтрактаОборудования = СтрокиРасчета[0].СуммаКонтракта + (СтрокиРасчета[0].СуммаКонтракта * (обДокументРЦК.ПоправкаНаИнфляцию / 100));
		МассивСуммОборудования = Новый Массив;
		Для Каждого СтрокаОборудования Из обДокументРЦК.ОборудованиеПродаваемое Цикл
			МассивСуммОборудования.Добавить(СтрокаОборудования.СтоимостьПродажиCIP + СтрокаОборудования.СуммаТаможенныхПлатежей);
		КонецЦикла;
		
		ДатаПривязки = СтрокиРасчета[0].ДатаАктирования;
		ЗначенияПоУмолчанию.Вставить("ДатаПривязки", ДатаПривязки);
		
		МассивРаспределенныхСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКонтрактаОборудования, МассивСуммОборудования);
		
		ДанныеЗаполнения = Новый Структура("ОборудованиеПродаваемое, МассивРаспределенныхСумм", обДокументРЦК.ОборудованиеПродаваемое, МассивРаспределенныхСумм);
		
		СвойстваПроектнойЗадачи = СвойстваПроектныхЗадачСоответствие[ПроектнаяЗадача];
		СтрокаИзмененияСвойствПроектнойЗадачи = ДокументСохранения.ПроектныеЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИзмененияСвойствПроектнойЗадачи, СвойстваПроектнойЗадачи);
		СтрокаИзмененияСвойствПроектнойЗадачи.ВключитьСубпродуктыВПланДоходов = Истина;
		
		ЗаполнитьСубпродуктыСохранениеПроектаРЦК(ДокументСохранения, ДанныеЗаполнения, ДанныеШапки, ЗначенияПоУмолчанию);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСубпродуктыСохранениеПроектаРЦК(ДокументСохранения, ДанныеПоАктируемомуЭтапу, ДанныеШапки, ЗначенияПоУмолчанию)
	
	Индекс = 0;
	ИндексРаспределения = 1;
	
	ОборудованиеПродаваемое = ДанныеПоАктируемомуЭтапу.ОборудованиеПродаваемое;
	МассивРаспределенныхСумм = ДанныеПоАктируемомуЭтапу.МассивРаспределенныхСумм;
	
	Для Каждого СтрокаОборудования Из ОборудованиеПродаваемое Цикл
		
		НоваяСтрока = ДокументСохранения.Субпродукты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеШапки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияПоУмолчанию);
		НоваяСтрока.Ресурс = СтрокаОборудования.Оборудование;
		НоваяСтрока.ЕдиницаНормирования =
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Ресурс, "ЕдиницаИзмерения");
		НоваяСтрока.ДатаВыпуска = ЗначенияПоУмолчанию.ДатаПривязки;
		НоваяСтрока.Количество = ?(СтрокаОборудования.Количество = 0, 1, СтрокаОборудования.Количество);
		НоваяСтрока.ОбщСтоимость = МассивРаспределенныхСумм[Индекс];
		НоваяСтрока.Стоимость = НоваяСтрока.ОбщСтоимость / НоваяСтрока.Количество;
		НоваяСтрока.ИндексСтрокРаспределения = ИндексРаспределения;
		
		НоваяСтрокаРаспредления = ДокументСохранения.СубпродуктыПоПодразделениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспредления, ДанныеШапки);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспредления, ЗначенияПоУмолчанию);
		НоваяСтрокаРаспредления.СпособПривязки = ЗначенияПоУмолчанию.СпособПривязкиРаспределение;
		НоваяСтрокаРаспредления.ИндексСтрокиВладельца = ИндексРаспределения;
		НоваяСтрокаРаспредления.Сумма = НоваяСтрока.ОбщСтоимость;
		НоваяСтрокаРаспредления.Количество = НоваяСтрока.Количество;
		
		Индекс = Индекс + 1;
		ИндексРаспределения = ИндексРаспределения + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область АктуализацияПланаДоходовРасходов

Процедура АктуализироватьПланДоходовРасходов(НаправлениеБДР, ВерсияКорневогоПроекта, ДокументСохранения, СлужебныеКоллекции)
	
	СписокЗадач = Неопределено;
	СписокВерсий = Неопределено;
	СвойстваПроектныхЗадачСоответствие = Неопределено;
	
	СлужебныеКоллекции.Свойство("СписокЗадач", СписокЗадач);
	СлужебныеКоллекции.Свойство("СписокВерсий", СписокВерсий);
	СлужебныеКоллекции.Свойство("СвойстваПроектныхЗадачСоответствие", СвойстваПроектныхЗадачСоответствие);
	
	ДокументСохранения.ПерезаписатьПланРасходов = Истина;
	
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(ВерсияКорневогоПроекта.Проект, Истина, ВерсияКорневогоПроекта);
	
	МассивИсточникПлана = Новый Массив;
	МассивИсточникПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
	МассивИсточникПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.Объемы);
	МассивИсточникПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты);
	МассивИсточникПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.Трудозатраты);
	МассивИсточникПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ПустаяСсылка());
	
	ТекстЗапроса = ТекстЗапросаПланДоходовРасходов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаСтартаПроекта", ДатаСтартаПроекта);
	Запрос.УстановитьПараметр("ВидЭлемента", НаправлениеБДР);
	Запрос.УстановитьПараметр("ИсточникПлана", МассивИсточникПлана);
	Запрос.УстановитьПараметр("СписокВерсий", СписокВерсий);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	Запрос.УстановитьПараметр("ВерсияКорневогоПроекта", ВерсияКорневогоПроекта);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаРезультат = Результат[3].Выгрузить();
	ТаблицаРезультатПодразделения = Результат[4].Выгрузить();
	
	СписокПроектныхЗадач = ТаблицаРезультат.ВыгрузитьКолонку("ПроектнаяЗадача");
	СписокПроектныхЗадач = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокПроектныхЗадач);
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Версия", ВерсияКорневогоПроекта);
	ДанныеШапки.Вставить("Период", ТекущаяДатаСеанса());
	ДанныеШапки.Вставить("ПериодАгрегации", Перечисления.упоПериодыАгрегацииЗатрат.ПустаяСсылка());
	
	Для Каждого ПроектнаяЗадача Из СписокПроектныхЗадач Цикл
		
		ДанныеШапки.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		
		ПараметрыОтбора = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
		ДанныеДляЗаписи = ТаблицаРезультат.НайтиСтроки(ПараметрыОтбора);
		
		Если ДанныеДляЗаписи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуществующиеЗаписи = ДокументСохранения.ПроектныеЗадачи.НайтиСтроки(ПараметрыОтбора);
		Если ЗначениеЗаполнено(СуществующиеЗаписи) Тогда
			ВыключитьОпцииТрансляции(СуществующиеЗаписи[0], НаправлениеБДР, Истина, Ложь);
		Иначе	
			СвойстваПроектнойЗадачи = СвойстваПроектныхЗадачСоответствие[ПроектнаяЗадача];
			СтрокаИзмененияСвойствПроектнойЗадачи = ДокументСохранения.ПроектныеЗадачи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИзмененияСвойствПроектнойЗадачи, СвойстваПроектнойЗадачи);
			ВыключитьОпцииТрансляции(СтрокаИзмененияСвойствПроектнойЗадачи, НаправлениеБДР, Истина, Ложь);
		КонецЕсли;
		
		ЗаполнитьПланДоходовРасходовСохранениеПроекта(НаправлениеБДР, ПроектнаяЗадача, ДокументСохранения, ДанныеШапки, ДанныеДляЗаписи, ТаблицаРезультатПодразделения);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПланДоходовРасходовСохранениеПроекта(НаправлениеБДР,
		ПроектнаяЗадача,
		ДокументСохранения,
		ДанныеШапки,
		ДанныеДляЗаписи,
		ТаблицаРезультатПодразделения)
	
	Если НаправлениеБДР = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
		ОсновнаяТЧ = "ПланДоходов";
		ТЧРаспределения = "ПланДоходовПоПодразделениям";
	Иначе
		ОсновнаяТЧ = "ПланРасходов";
		ТЧРаспределения = "ПланРасходовПоПодразделениям";
	КонецЕсли;
	
	ИндексРаспределения = 1;
	
	Для Каждого СтрокаДляЗаписи Из ДанныеДляЗаписи Цикл
		
		НоваяСтрока = ДокументСохранения[ОсновнаяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДляЗаписи);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеШапки);
		НоваяСтрока.ИндексСтрокРаспределения = ИндексРаспределения;
		
		ПараметрыОтбора = Новый Структура("ПроектнаяЗадача, СпособПривязки, ПрофильРаспределения",
				НоваяСтрока.ПроектнаяЗадача, НоваяСтрока.СпособПривязки, НоваяСтрока.ПрофильРаспределения);
		
		ПараметрыОтбора.Вставить("ДатаПривязки", СтрокаДляЗаписи.ДатаПривязки);
		ПараметрыОтбора.Вставить("Статья", СтрокаДляЗаписи.Статья);
		ПараметрыОтбора.Вставить("Контрагент", СтрокаДляЗаписи.Контрагент);
		ПараметрыОтбора.Вставить("Договор", СтрокаДляЗаписи.Договор);
		
		МассивРаспределенных = ТаблицаРезультатПодразделения.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаРаспределения Из МассивРаспределенных Цикл
			НоваяСтрокаРаспредления = ДокументСохранения[ТЧРаспределения].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспредления, ДанныеШапки);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспредления, СтрокаРаспределения);
			НоваяСтрокаРаспредления.ИндексСтрокиВладельца = ИндексРаспределения;
		КонецЦикла;
		
		ИндексРаспределения = ИндексРаспределения + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АктуализироватьПланДоходовПоДокументамРЦК(ВерсияПроекта, ДокументСохранения, СписокЗадач,
		СоответсвиеДокументовРЦК, ПараметрыАктуализации) Экспорт
	
	ДокументСохранения.ПерезаписатьПланДоходов = Истина;
	
	СпособПривязки = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату");
	СпособоПривязкиРаспределение = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСпособПривязкиРаспределения.НаДату");
	ДанныеПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВерсияПроекта.Проект, "СтатьяДоходовПоУмолчанию, РольДоходовПоУмолчанию, ПодразделениеДоходовПоУмолчанию");
	ИсточникПлана = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы");
	ИсточникПланаОбъемы = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.Объемы");
	СобственныеСилы = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы");
	
	ОтделятьСубпродукты = Ложь;
	Если ПараметрыАктуализации.Свойство("АктуализироватьПланВыпускаПоДоходам") Тогда
		ОтделятьСубпродукты = ПараметрыАктуализации.АктуализироватьПланВыпускаПоДоходам;
	КонецЕсли;
	ДокументСохранения.ПерезаписатьВключитьСубпродуктыВПланДоходов = ОтделятьСубпродукты;
	
	ОперацияОборудование = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоВидыОпераций.Оборудование");
	
	ЗначенияПоУмолчанию = Новый Структура;
	ЗначенияПоУмолчанию.Вставить("СпособПривязки", СпособПривязки);
	ЗначенияПоУмолчанию.Вставить("СпособПривязкиРаспределение", СпособоПривязкиРаспределение);
	ЗначенияПоУмолчанию.Вставить("Статья", ДанныеПроекта.СтатьяДоходовПоУмолчанию);
	ЗначенияПоУмолчанию.Вставить("ЭтоСубпродуктИлиПотребность", Ложь);
	ЗначенияПоУмолчанию.Вставить("Подразделение", ДанныеПроекта.ПодразделениеДоходовПоУмолчанию);
	ЗначенияПоУмолчанию.Вставить("Роль", ДанныеПроекта.РольДоходовПоУмолчанию);
	ЗначенияПоУмолчанию.Вставить("ИсточникПлана", ИсточникПлана);
	ЗначенияПоУмолчанию.Вставить("СобствСилы_Субподряд", СобственныеСилы);
	
	Для Каждого ПроектнаяЗадача Из СписокЗадач Цикл
		
		ДокументРЦК = СоответсвиеДокументовРЦК.Получить(ПроектнаяЗадача);
		
		Если Не ЗначениеЗаполнено(ДокументРЦК) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияПоУмолчанию.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		
		// TODO: переделать получение данных документа РЦК на запрос.
		обДокументРЦК = ДокументРЦК.ПолучитьОбъект();
		ЗначенияПоУмолчанию.Вставить("Валюта", обДокументРЦК.Валюта);
		ЗначенияПоУмолчанию.Вставить("ПоправкаНаИнфляцию", обДокументРЦК.ПоправкаНаИнфляцию);
		
		ДанныеПоРасчетам = обДокументРЦК.ПараметрыРасчета.Выгрузить();
		
		Если ОтделятьСубпродукты Тогда
			Для Каждого СтрокаРасчетов Из ДанныеПоРасчетам Цикл
				Если СтрокаРасчетов.ВидОперации = ОперацияОборудование Тогда
					ДанныеПоРасчетам.Удалить(СтрокаРасчетов);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ДанныеПоРасчетам.Колонки.Удалить("ВидОперации");
		СуммыПоДатамАктирования = ДанныеПоРасчетам.СкопироватьКолонки("СуммаКонтракта, ДатаАктирования");
		
		Для Каждого СтрокаРасчетов Из ДанныеПоРасчетам Цикл
			НоваяСтрока = СуммыПоДатамАктирования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчетов);
		КонецЦикла;
		
		СуммыПоДатамАктирования.Свернуть("ДатаАктирования", "СуммаКонтракта");
		
		ЗаполнитьБДРСохранениеПроектаРЦК(ДокументСохранения, СуммыПоДатамАктирования, ЗначенияПоУмолчанию);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьБДРСохранениеПроектаРЦК(ДокументСохранения, ДанныеПоАктируемомуЭтапу, ЗначенияПоУмолчанию)
	
	ИндексРаспределения = 1;
	
	Для Каждого СтрокаРасчетов Из ДанныеПоАктируемомуЭтапу Цикл
		
		Если СтрокаРасчетов.СуммаКонтракта = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДокументСохранения.ПланДоходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияПоУмолчанию);
		НоваяСтрока.ДатаПривязки = СтрокаРасчетов.ДатаАктирования;
		НоваяСтрока.Сумма = СтрокаРасчетов.СуммаКонтракта + (СтрокаРасчетов.СуммаКонтракта * (ЗначенияПоУмолчанию.ПоправкаНаИнфляцию / 100));
		НоваяСтрока.ИндексСтрокРаспределения = ИндексРаспределения;
		
		НоваяСтрокаРаспределения = ДокументСохранения.ПланДоходовПоПодразделениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, ЗначенияПоУмолчанию);
		НоваяСтрокаРаспределения.Сумма = НоваяСтрока.Сумма;
		НоваяСтрокаРаспределения.СпособПривязки = ЗначенияПоУмолчанию.СпособПривязкиРаспределение;
		НоваяСтрокаРаспределения.ДатаПривязки = НоваяСтрока.ДатаПривязки;
		НоваяСтрокаРаспределения.ИндексСтрокиВладельца = ИндексРаспределения;
		
		ИндексРаспределения = ИндексРаспределения + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область АктуалиацияПланаПоступленийДС

Процедура АктуализироватьПланПоступленийВыплатДС(ВерсияКорневогоПроекта, ДокументСохранения, СлужебныеКоллекции, НаправлениеДвижения, ВидЭлемента)
	
	СписокЗадач = Неопределено;
	СписокВерсий = Неопределено;
	СвойстваПроектныхЗадачСоответствие = Неопределено;
	
	СлужебныеКоллекции.Свойство("СписокЗадач", СписокЗадач);
	СлужебныеКоллекции.Свойство("СписокВерсий", СписокВерсий);
	СлужебныеКоллекции.Свойство("СвойстваПроектныхЗадачСоответствие", СвойстваПроектныхЗадачСоответствие);
	
	ДокументСохранения.ПерезаписатьДвиженияДенежныхСредств = Истина;
	
	ДатаСтартаПроекта = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(ВерсияКорневогоПроекта.Проект, Истина, ВерсияКорневогоПроекта);
	
	ТекстЗапроса = ТекстЗапросаПланДДС();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаСтартаПроекта", ДатаСтартаПроекта);
	Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
	Запрос.УстановитьПараметр("СписокВерсий", СписокВерсий);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	Запрос.УстановитьПараметр("ВерсияКорневогоПроекта", ВерсияКорневогоПроекта);
	Запрос.УстановитьПараметр("НаправлениеДвижения", НаправлениеДвижения);
	Запрос.УстановитьПараметр("ВидЭлемента", ВидЭлемента);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаРезультат = Результат.Выгрузить();
	
	СписокПроектныхЗадач = ТаблицаРезультат.ВыгрузитьКолонку("ПроектнаяЗадача");
	СписокПроектныхЗадач = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокПроектныхЗадач);
	
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("Версия", ВерсияКорневогоПроекта);
	ДанныеШапки.Вставить("Период", ТекущаяДатаСеанса());
	
	Для Каждого ПроектнаяЗадача Из СписокПроектныхЗадач Цикл
		
		ДанныеШапки.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		
		ПараметрыОтбора = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
		ДанныеДляЗаписи = ТаблицаРезультат.НайтиСтроки(ПараметрыОтбора);
		
		Если ДанныеДляЗаписи.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуществующиеЗаписи = ДокументСохранения.ПроектныеЗадачи.НайтиСтроки(ПараметрыОтбора);
		Если ЗначениеЗаполнено(СуществующиеЗаписи) Тогда
			ВыключитьОпцииТрансляции(СуществующиеЗаписи[0], ВидЭлемента, Ложь, Истина);
		Иначе
			СвойстваПроектнойЗадачи = СвойстваПроектныхЗадачСоответствие[ПроектнаяЗадача];
			СтрокаИзмененияСвойствПроектнойЗадачи = ДокументСохранения.ПроектныеЗадачи.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИзмененияСвойствПроектнойЗадачи, СвойстваПроектнойЗадачи);
			ВыключитьОпцииТрансляции(СтрокаИзмененияСвойствПроектнойЗадачи, ВидЭлемента, Ложь, Истина);
		КонецЕсли;
		
		ЗаполнитьПланДДС(ПроектнаяЗадача, ДокументСохранения, ДанныеШапки, ДанныеДляЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПланДДС(ПроектнаяЗадача, ДокументСохранения, ДанныеШапки, ДанныеДляЗаписи)
	
	ИндексРаспределения = 1;
	
	Для Каждого СтрокаДляЗаписи Из ДанныеДляЗаписи Цикл
		
		НоваяСтрока = ДокументСохранения.ДвиженияДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеШапки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДляЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ВыключитьОпцииТрансляции(СтрокаИзмененияСвойствПроектнойЗадачи, ВидЭлемента, ОтключитьТрансляциюБДР = Ложь,
	ОтключитьТрансляциюБДДС = Ложь)
	
	ЭтоДоход = ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
	ЭтоРасход = ВидЭлемента = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход; 
	
	Если ОтключитьТрансляциюБДР И ЭтоДоход Тогда	
		СтрокаИзмененияСвойствПроектнойЗадачи.ВключитьСубпродуктыВПланДоходов = Ложь;				
	ИначеЕсли ОтключитьТрансляциюБДР И ЭтоРасход Тогда	
		СтрокаИзмененияСвойствПроектнойЗадачи.ВключитьМатРесурсыВПланРасходов = Ложь;
	КонецЕсли;	
	
	Если ОтключитьТрансляциюБДДС И ЭтоДоход Тогда
		СтрокаИзмененияСвойствПроектнойЗадачи.ВключитьПланДоходовВБДДС = Ложь;
	ИначеЕсли ОтключитьТрансляциюБДДС И ЭтоРасход Тогда
		СтрокаИзмененияСвойствПроектнойЗадачи.ВключитьПланРасходовВБДДС = Ложь;
	КонецЕсли;

КонецПроцедуры

Функция МаксимальныеИндексыСтрокРаспределенияПоПериодамТрудозатрат(ВерсияКорневогоПроекта, СписокЗадач)
	
	ПроектнаяЗадачаИндекс = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", ВерсияКорневогоПроекта);
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	МАКСИМУМ(упоДанныеПлановТрудозатратРолейСрезПоследних.ИндексСтрокРаспределения) КАК МаксимальныйИндекс
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача В (&СписокЗадач)
	               |				И Версия = &Версия) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |ГДЕ
	               |	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость <> 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл			
			ПроектнаяЗадачаИндекс.Вставить(Выборка.ПроектнаяЗадача, Выборка.МаксимальныйИндекс);
		КонецЦикла;	
	КонецЕсли;	
		
	Возврат	ПроектнаяЗадачаИндекс;
		
КонецФункции

#КонецОбласти
