#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Сформировать отчет по очереди.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - Форма обработки упоРаботаСОчередями.
//
Процедура СформироватьОтчетПоОчереди(ЭтаФорма) Экспорт
	
	ЭтаФорма.ДокументРезультат.Очистить();
	
	//
	
	СКД = Новый СхемаКомпоновкиДанных;
	Настройки = Неопределено;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	
	Если ЭтаФорма.ИмяОчереди = "упоОчередьОтраженияПлановыхТрудозатратЗадач" Тогда
		
		ЭтаФорма.Заголовок = НСтр("ru = 'Очередь распределения плановых трудозатрат'");
		
		НаборДанных.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                     |	Проекты.упоКорневойПроект КАК Проект,
		                     |	Проекты.Ссылка КАК ПроектнаяЗадача,
		                     |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача КАК Документ,
		                     |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ОписаниеОшибки КАК ОписаниеОшибки,
		                     |	упоОчередьОтраженияПлановыхТрудозатратЗадач.НомерПопытки КАК НомерПопытки,
		                     |	упоОчередьОтраженияПлановыхТрудозатратЗадач.Источник КАК Источник,
		                     |	упоОчередьОтраженияПлановыхТрудозатратЗадач.Дата КАК Дата,
		                     |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ДатаВМиллиСекундах КАК ДатаВМиллиСекундах,
		                     |	упоОчередьОтраженияПлановыхТрудозатратЗадач.Ошибка КАК Ошибка
		                     |ИЗ
		                     |	РегистрСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач КАК упоОчередьОтраженияПлановыхТрудозатратЗадач
		                     |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		                     |		ПО упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу";
		
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
		ДобавитьВыбранныеПоля(Настройки, "СистемныеПоля.НомерПоПорядкуВГруппировке, ПроектнаяЗадача, Дата, НомерПопытки, ОписаниеОшибки, Документ, Источник");
		
		Структура = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Проект");
		Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		
		Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		
		Порядок = Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		Порядок.Поле = Новый ПолеКомпоновкиДанных("ДатаВМиллиСекундах");
		Порядок.Использование = Истина;
				
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Очередь не поддерживается'"); 
		
	КонецЕсли;                                              
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки, ,
										Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ЭтаФорма.ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);		
	
	//
	
	ЭтаФорма.АдресДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ЭтаФорма.УникальныйИдентификатор);
	ЭтаФорма.АдресСКД = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура - Добавить оповещение по очереди трудозатрат по настройке компоновки.
//
// Параметры:
//  НастройкиКомпоновки	 - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  СписокОповещений		 - СписокЗначений	 - Список данных для оповещений.
//  БезПроверкиПрав		 - Булево	 - Необходимость установки привилегированного режима.
//
Процедура ДобавитьОповещениеПоОчередиТрудозатратПоНастройкеКомпоновки(НастройкиКомпоновки, СписокОповещений, БезПроверкиПрав = Ложь) Экспорт
	
	КоличествоВОчереди = упоРаботаСОчередями.ПолучитьКоличествоВОчередиТрудозатратПоНастройкамКомпоновки(НастройкиКомпоновки, БезПроверкиПрав);
	
	ДобавитьОповещениеПоОчередиТрудозатрат(КоличествоВОчереди, СписокОповещений, БезПроверкиПрав);
		
КонецПроцедуры

// Процедура - Добавить оповещение по очереди трудозатрат по отбору.
//
// Параметры:
//  Отбор	 - Проект, Массив - Отбор по проекту.
//  СписокОповещений		 - СписокЗначений	 - Список данных для оповещений.
//  БезПроверкиПрав		 - Булево	 - Необходимость установки привилегированного режима.
//
Процедура ДобавитьОповещениеПоОчередиТрудозатратПоОтбору(Отбор, СписокОповещений, БезПроверкиПрав = Ложь) Экспорт
	
	Состояние = упоРаботаСОчередямиВызовСервера.ПолучитьСостояниеОчередиРаспределенияТрудозатрат(Отбор, БезПроверкиПрав);
	
	ДобавитьОповещениеПоОчередиТрудозатрат(Состояние.Всего, СписокОповещений, БезПроверкиПрав);
		
КонецПроцедуры

// Процедура - Добавить оповещение по очереди трудозатрат по отбору и тексту запроса.
//
// Параметры:
//  Отбор	 - Проект, Массив - Отбор по проекту.
//  ТекстЗапроса	 - Строка - Текст запроса.
//  СписокОповещений		 - СписокЗначений	 - Список данных для оповещений.
//  БезПроверкиПрав		 - Булево	 - Необходимость установки привилегированного режима.
//
Процедура ДобавитьОповещениеПоОчередиТрудозатратПоОтборуИТекстуЗапроса(Отбор, ТекстЗапроса, СписокОповещений, БезПроверкиПрав = Ложь) Экспорт
	
	МассивПроверяемыхРегистровВЗапросе = Новый Массив;
	МассивПроверяемыхРегистровВЗапросе.Добавить("РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия");
	МассивПроверяемыхРегистровВЗапросе.Добавить("РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия");
	
	НужноПродолжить = Ложь;
	
	Для Каждого ИмяРегистра Из МассивПроверяемыхРегистровВЗапросе Цикл
		Если СтрНайти(ТекстЗапроса, ИмяРегистра) <> 0 Тогда
			НужноПродолжить = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ НужноПродолжить Тогда
		Возврат;
	КонецЕсли;
	
	Состояние = упоРаботаСОчередямиВызовСервера.ПолучитьСостояниеОчередиРаспределенияТрудозатрат(Отбор, БезПроверкиПрав);
	
	ДобавитьОповещениеПоОчередиТрудозатрат(Состояние.Всего, СписокОповещений, БезПроверкиПрав);
		
КонецПроцедуры

// Процедура - Добавить оповещение по очереди трудозатрат.
//
// Параметры:
//  КоличествоВОчереди	 - Число - Количество в очереди.
//  СписокОповещений		 - СписокЗначений	 - Список данных для оповещений.
//  БезПроверкиПрав		 - Булево	 - Необходимость установки привилегированного режима.
//
Процедура ДобавитьОповещениеПоОчередиТрудозатрат(КоличествоВОчереди, СписокОповещений, БезПроверкиПрав = Ложь) Экспорт
	
	Если КоличествоВОчереди = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//ТекстОповещения = НСтр("ru = 'Очередь отложенного отражения плановых трудозатрат'");
	ТекстОповещения = НСтр("ru = 'Важно'");
	
	ТекстПояснения =  НСтр("ru = '%1 задач в очереди отложенного отражения плановых трудозатрат.'");
	ТекстПояснения = СтрШаблон(ТекстПояснения, КоличествоВОчереди);
	
	ПараметрыОповещения = Новый Структура("ИмяОчереди", "упоОчередьОтраженияПлановыхТрудозатратЗадач");
	
	ДанныеОповещения = Новый Структура("ТекстОповещения, ТекстПояснения, ПараметрыОповещения, ИмяПроцедуры", 
				ТекстОповещения,
				ТекстПояснения,
				ПараметрыОповещения,
				"ОбработатьНажатиеНаОповещениеОСостоянииОчереди");
	
	СписокОповещений.Добавить(ДанныеОповещения);															
	
КонецПроцедуры

// Функция - Получить количество в очереди трудозатрат по настройкам компоновки.
//
// Параметры:
//  НастройкиКомпоновки	 - НастройкиКомпоновкиДанных - Настройки компоновки данных.
//  БезПроверкиПрав		 - Булево	 - Необходимость установки привилегированного режима.
// 
// Возвращаемое значение:
//  Число - Количество элементов в очереди трудозатрат.
//
Функция ПолучитьКоличествоВОчередиТрудозатратПоНастройкамКомпоновки(НастройкиКомпоновки, БезПроверкиПрав = Ложь) Экспорт
	
	Если БезПроверкиПрав Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Отбор = НастройкиКомпоновки.Отбор;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ISNULL(СУММА(1), 0) КАК Количество
	               |ИЗ
	               |	РегистрСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач КАК упоОчередьОтраженияПлановыхТрудозатратЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |			И (Проекты.ЭтоПроектнаяЗадача)
	               |{ГДЕ
	               |	Проекты.упоКорневойПроект.ПортфельПроектов.* КАК ПортфельПроектов,
	               |	Проекты.упоКорневойПроект.ПрограммаПроектов.* КАК ПрограммаПроектов,
	               |	Проекты.упоКорневойПроект.* КАК Проект,
	               |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача.* КАК ПроектнаяЗадачаДокумент,
	               |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача.* КАК Операция,
	               |	Проекты.Ссылка.* КАК ПроектнаяЗадача}";
	
	СКД = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.Запрос = ТекстЗапроса;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	НовоеПолеПоказатель = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПолеПоказатель.Поле = Новый ПолеКомпоновкиДанных("Количество");		
	НовоеПолеПоказатель.Использование = Истина;
	
	Структура = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Количество");
	
	упоТиповыеОтчетыСервер.СкопироватьОтборВНастройки(Отбор.Элементы, Настройки.Отбор.Элементы);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КомпоновщикНастроек.Восстановить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, , ,
				Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	//
	
	КоличествоЭлементовВОчереди = ТаблицаРезультат[0].Количество;
	
	Возврат КоличествоЭлементовВОчереди;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВыбранныеПоля(Настройки, СтрокаПолей)

	СтрокиПолей = СтрРазделить(СтрокаПолей, ",");
	
	Для Каждого Строка Из СтрокиПолей Цикл
		НовыеВыбранноеПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовыеВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(СокрЛП(Строка));		
		НовыеВыбранноеПоле.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
