
#Область ПрограммныйИнтерфейс

// Позволяет переопределить заголовок программы.
//
// Параметры:
//  ЗаголовокПриложения - Строка - текст заголовка программы;
//  ПриЗапуске          - Булево - Истина, если вызывается при начале работы программы.
//                                 В этом случае недопустимо вызывать те серверные функции конфигурации,
//                                 которые рассчитывают на то, что запуск уже полностью завершен. 
//                                 Например, вместо СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента
//                                 следует вызывать СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске. 
//
// Пример:
//  Для того чтобы в начале заголовка программы вывести название текущего проекта, следует определить параметр 
//  ТекущийПроект в процедуре ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиента и вписать код:
//
//  Если ПриЗапуске Тогда
//    Возврат;
//  КонецЕсли;
//  ПараметрыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента();
//  ТекущийПроект = Неопределено;	
//  Если ПараметрыКлиента.ДоступноИспользованиеРазделенныхДанных И ПараметрыКлиента.Свойство("ТекущийПроект", ТекущийПроект) 
//	  И Не ПараметрыКлиента.ТекущийПроект.Пустая() Тогда
//	  ЗаголовокПриложения = Строка(ПараметрыКлиента.ТекущийПроект) + " / " + ЗаголовокПриложения;
//  КонецЕсли;
//
Процедура ПриУстановкеЗаголовкаКлиентскогоПриложения(ЗаголовокПриложения, ПриЗапуске) Экспорт
	
	МассивСтрок = Новый Массив(3);
	МассивСтрок[0] = ЗаголовокПриложения;
	МассивСтрок[1] = " / ";
	МассивСтрок[2] = упоИнтеграцияВызовСервера.ПолучитьТекущегоСотрудникаВызовСервера();
	
	ЗаголовокПриложения = СтрСоединить(МассивСтрок);
	
	МассивСтрок = Неопределено;	
		
КонецПроцедуры

// Выполняет проверку на модифицированность формы и открывает форму ERP; если форма модифицирована, 
// то показывает вопрос о необходимости сохранить изменения.
//
// Параметры:
//  Форма			   - ФормаКлиентскогоПриложения - форма проекта или форма проектной задачи.
//  ЭтоПроектнаяЗадача - Булево - Признак проектной задачи.
//  ЭтоОткрытиеИзПроекта - Булево - Признак вызова из формы ERP.
//
Процедура ПроверитьНаМодифицированностьИОткрытьЗамененнуюФормуПроекта(Форма, ЭтоПроектнаяЗадача = Ложь,
	ЭтоОткрытиеИзПроекта = Ложь) Экспорт
	
	СсылкаНаОбъект = Форма.Объект.Ссылка;
	ИмяФормы = "Справочник.Проекты.Форма.ФормаЭлемента";
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда 
		ТекстЗамены = "ERP";
	Иначе
		ТекстЗамены = "УНФ";
	КонецЕсли;
	Если ЭтоОткрытиеИзПроекта Тогда
		Если ЗначениеЗаполнено(Форма.Объект.СсылкаНаПроектнуюЗадачу) Тогда
			СсылкаНаОбъект = Форма.Объект.СсылкаНаПроектнуюЗадачу;
			ИмяФормы = "Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая";
		Иначе
			ИмяФормы = "Справочник.Проекты.Форма.упоФормаЭлементаУправляемая";
		КонецЕсли;
		ТекстЗамены = "PM";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для открытия формы проекта %1 нужно сохранить объект.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекстЗамены);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	Если Форма.Модифицированность Тогда
		
		ДопПараметры = Новый Структура("Форма, ЭтоПроектнаяЗадача, ЭтоОткрытиеИзПроекта",
			Форма, ЭтоПроектнаяЗадача, ЭтоОткрытиеИзПроекта);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаНаМодифицированностьЗавершение", ЭтотОбъект, ДопПараметры);
		
		Если ЭтоПроектнаяЗадача Тогда
			ТекстВопроса = 
				НСтр("ru = 'Карточка проектной задачи изменена. Сохранить изменения перед переходом на форму проекта %1?'");	
		Иначе
			ТекстВопроса = НСтр("ru = 'Карточка проекта изменена. Сохранить изменения перед переходом на форму проекта %1?'"); 
		КонецЕсли;
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ТекстЗамены);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		
		Возврат;
		
	КонецЕсли;
			
	Если ЭтоПроектнаяЗадача Тогда
		Ключ = упоПроектыИЗадачиВызовСервера.обПолучитьСвязанныйЭлементПроекта(СсылкаНаОбъект);
	Иначе
		Ключ = СсылкаНаОбъект;
	КонецЕсли;
	
	Форма.Закрыть();
	ОткрытьФорму(ИмяФормы, Новый Структура("Ключ", Ключ));		
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверкаНаМодифицированностьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	 
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ЭтоПроектнаяЗадача = ДополнительныеПараметры.ЭтоПроектнаяЗадача;
	ЭтоОткрытиеИзПроекта = ДополнительныеПараметры.ЭтоОткрытиеИзПроекта;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Форма.Модифицированность = Ложь;	
	КонецЕсли;	
		
	Если Результат = КодВозвратаДиалога.Да Тогда
		Форма.Записать();
	КонецЕсли;
	
	ПроверитьНаМодифицированностьИОткрытьЗамененнуюФормуПроекта(Форма, ЭтоПроектнаяЗадача, ЭтоОткрытиеИзПроекта);
	
КонецПроцедуры

Процедура ПерейтиПоСсылкеНаРегистратор(ПараметрыПерехода) Экспорт
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ПараметрыПерехода.СсылкаНаРегистратор) Тогда
		ТекстСообщения = НСтр("ru = 'Переход по ссылке невозможен: не заполнена Ссылка в источнике'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ПараметрыПерехода.ПолеНаФормеСсылкаНаРегистратор);
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыПерехода.ИсточникДанных) Тогда
		ТекстСообщения = НСтр("ru = 'Переход по ссылке невозможен: не заполнен Источник данных'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ПараметрыПерехода.ПолеНаФормеИсточникДанных);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиПоСсылкеНаРегистраторПродолжение(ПараметрыПерехода.ИсточникДанных, ПараметрыПерехода.СсылкаНаРегистратор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПерейтиПоСсылкеНаРегистраторПродолжение(Знач ИсточникДанных, Знач СсылкаНаРегистратор)
  
	ПодключениеКИсточникуДанных = упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(ИсточникДанных, "Подключение"); 
	СсылкаДляПерехода = ПодключениеКИсточникуДанных + "#" + СсылкаНаРегистратор;
	Попытка			
		ПерейтиПоНавигационнойСсылке(СсылкаДляПерехода);	
	Исключение
		Инфо = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиент.СообщитьПользователю(Инфо.Причина.Описание);			
	КонецПопытки;
   	
КонецПроцедуры

#КонецОбласти