#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Генерирует код проектной продукции (Код проекта - код типа документа № ПП).
// Формирование кода происходит на основании данных самой проектной продукции
//
Процедура УстановитьКодПроектнойПродукции() Экспорт
	
	ЭтотОбъект.КодПП = упоПроектнаяПродукция.ПолучитьКодНового(ЭтотОбъект.ПроектнаяЗадача, ЭтотОбъект.ТипДокумента);
	
КонецПроцедуры //

// Заполнение ресурсов объекта по спецификации.
//
Процедура ЗаполнитьДанныеОбъектаПоСпецификации() Экспорт
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Спецификация) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеПоСпецификации();
		
	ЗаполнитьКоэффициентСложностиДляРолей(ЭтотОбъект.РолиТР, ЭтотОбъект.КоэффициентСложности);
	
	ЗаполнитьНормированиеРолей(ЭтотОбъект.РолиТР, ЭтотОбъект.Нормирование);
	
	Для Каждого СтрокаТР Из ЭтотОбъект.РолиТР Цикл
		РассчитатьФормулыПоСтрокеРоли(СтрокаТР);
	КонецЦикла;
	
КонецПроцедуры

// Заполнение данных объекта по шаблону.
//
Процедура ЗаполнитьДанныеОбъектаПоШаблону() Экспорт
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ШаблонПроектнойПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = "ТипДокумента, Количество, ЕдиницаИзмерения, Трудоемкость, ЕдиницаИзмеренияВремени, 
		|ВидОперации, МинимальнаяДлительность, СкоростьВыполнения,
		|Нормирование, КоэффициентСложности,
		|Последовательность, ПроектнаяПродукция, Спецификация";
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЭтотОбъект.ШаблонПроектнойПродукции, Реквизиты);
	ЭтотОбъект.ДополнительныеЗатраты.Загрузить(ЭтотОбъект.ШаблонПроектнойПродукции.ДополнительныеЗатраты.Выгрузить());
	ЭтотОбъект.РолиТР.Загрузить(ЭтотОбъект.ШаблонПроектнойПродукции.РолиТР.Выгрузить());
	ЭтотОбъект.МатериалыИОборудование.Загрузить(ЭтотОбъект.ШаблонПроектнойПродукции.МатериалыИОборудование.Выгрузить());
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоКода модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации кода.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание	- Произвольный - значение, которое используется как основание для заполнения.
//
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ПроектнаяЗадача = Основание;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ - Булево, признак отказа от записи элемента.
// 
Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.КодПП) Тогда
		ЭтотОбъект.УстановитьКодПроектнойПродукции();
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	ПроектнаяЗадача = Неопределено;
	КодПП = Неопределено;
	Наименование = Неопределено;
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеПоСпецификации()
	
	ЭтотОбъект.РолиТР.Очистить();
	ЭтотОбъект.МатериалыИОборудование.Очистить();
	ЭтотОбъект.ДополнительныеЗатраты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Спецификация);
	Запрос.УстановитьПараметр("Количество", ЭтотОбъект.Количество);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСпецификацииРолиТР.РольТР КАК РольТР,
		|	упоСпецификацииРолиТР.Подразделение КАК Подразделение,
		|	упоСпецификацииРолиТР.ПроцентРаспределения КАК ПроцентРаспределения,
		|	упоСпецификацииРолиТР.ПрофильТрудозатрат КАК ПрофильТрудозатрат,
		|	&Количество * упоСпецификацииРолиТР.ПроцентРаспределения / 100 КАК Количество
		|ИЗ
		|	Справочник.упоСпецификации.РолиТР КАК упоСпецификацииРолиТР
		|ГДЕ
		|	упоСпецификацииРолиТР.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСпецификацииМатериалыИОборудование.Номенклатура КАК Номенклатура,
		|	упоСпецификацииМатериалыИОборудование.Количество КАК Количество,
		|	упоСпецификацииМатериалыИОборудование.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	упоСпецификацииМатериалыИОборудование.ПрофильРаспределения КАК ПрофильРаспределения
		|ИЗ
		|	Справочник.упоСпецификации.МатериалыИОборудование КАК упоСпецификацииМатериалыИОборудование
		|ГДЕ
		|	упоСпецификацииМатериалыИОборудование.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСпецификацииДополнительныеЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
		|	упоСпецификацииДополнительныеЗатраты.СпособПривязкиДопЗатрат КАК СпособПривязкиДопЗатрат,
		|	упоСпецификацииДополнительныеЗатраты.Стоимость КАК Стоимость,
		|	упоСпецификацииДополнительныеЗатраты.Валюта КАК Валюта
		|ИЗ
		|	Справочник.упоСпецификации.ДополнительныеЗатраты КАК упоСпецификацииДополнительныеЗатраты
		|ГДЕ
		|	упоСпецификацииДополнительныеЗатраты.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[0].Пустой() Тогда
		ЭтотОбъект.РолиТР.Загрузить(РезультатЗапроса[0].Выгрузить());
	КонецЕсли;
	Если Не РезультатЗапроса[1].Пустой() Тогда
		ЭтотОбъект.МатериалыИОборудование.Загрузить(РезультатЗапроса[1].Выгрузить());
	КонецЕсли;
	Если Не РезультатЗапроса[2].Пустой() Тогда
		ЭтотОбъект.ДополнительныеЗатраты.Загрузить(РезультатЗапроса[2].Выгрузить());
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗаполнитьКоэффициентСложностиДляРолей(ТаблицаРоли, ОбщийКоэффициент)
	
	Если Не ЗначениеЗаполнено(ТаблицаРоли) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаРоли Цикл
		Строка.КоэффициентСложности = ОбщийКоэффициент;
	КонецЦикла;
		
КонецПроцедуры //

Процедура ЗаполнитьНормированиеРолей(ТаблицаРоли, ОбщееНормирование)
	
	Если Не ЗначениеЗаполнено(ТаблицаРоли) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаРоли Цикл
		Строка.Нормирование = ОбщееНормирование * (Строка.ПроцентРаспределения / 100);
	КонецЦикла;
		
КонецПроцедуры //

Процедура РассчитатьФормулыПоСтрокеРоли(Строка)
	
	Строка.Трудоемкость = ЭтотОбъект.Нормирование * Строка.КоэффициентСложности * (Строка.ПроцентРаспределения / 100);
	
	ЭтотОбъект.Трудоемкость = ЭтотОбъект.РолиТР.Итог("Трудоемкость");
	
КонецПроцедуры //

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли