#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Копирует проектную задачу.
//
// Параметры:
//  пСсылка	 - ДокументСсылка.упоПроектнаяЗадача - копируемая ПЗ.
//
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция Скопировать(пСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(пСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	новыйОбъект = пСсылка.Скопировать();
	новыйОбъект.ДополнительныеСвойства.Вставить("СсылкаКопирования", пСсылка);
	
	новыйОбъект.ПолучитьФорму().Открыть();
	
КонецФункции

// Возвращает актуальные на текущий момент времени сроки проектной
//  задачи (без учета реквизита "Ручной ввод сроков"), данные в любом случае берутся из регистра сведений.
//
// Параметры:
//  пСсылка	 - ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой надо получить актуальные сроки.
// 
// Возвращаемое значение:
//  Структура - сроки проектной задачи. Ключи структуры: "ДатаНачала" и "ДатаЗавершения".
//
Функция ПолучитьСроки(пСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рег.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Рег.ДатаНачалаПлан КАК ДатаНачала,
		|	Рег.ДатаЗавершенияПлан КАК ДатаЗавершения
		|ИЗ
		|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &Ссылка) КАК Рег
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
		|		ПО Рег.Версия = Версии.Версия
		|			И (Версии.Текущая)";
	
	Если ТипЗнч(пСсылка) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПроектнаяЗадача = &Ссылка", "ПроектнаяЗадача В (&Ссылка)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", пСсылка);
	
	// Если пользователь имеет доступ к проектной задаче, то он должен иметь доступ к просмотру ее сроков.
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивСроков = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Сроки = Новый Структура();
		Сроки.Вставить("ПроектнаяЗадача", Выборка.ПроектнаяЗадача);
		Сроки.Вставить("ДатаНачала", Выборка.ДатаНачала);
		Сроки.Вставить("ДатаЗавершения", Выборка.ДатаЗавершения);
		МассивСроков.Добавить(Сроки);
	КонецЦикла;
	
	Если ТипЗнч(пСсылка) = Тип("Массив") Тогда
		Результат = МассивСроков;
	Иначе
		Результат = МассивСроков[0];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает расчетные сроки проектной задачи.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой надо получить сроки.
// 
// Возвращаемое значение:
//  Структура - структура сроков:
//  * ДатаРаннегоСтарта - Дата - дата раннего старта,
//  * ДатаПозднегоСтарта - Дата - дата позднего старта,
//  * ДатаРаннегоФиниша - Дата - дата раннего финиша,
//  * ДатаПозднегоФиниша - Дата - дата позднего финиша.
//
Функция ПолучитьРасчетныеСроки(ПроектнаяЗадача) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РегСроки.ДатаРаннегоСтарта,
		|	РегСроки.ДатаРаннегоФиниша,
		|	РегСроки.ДатаПозднегоСтарта,
		|	РегСроки.ДатаПозднегоФиниша
		|ИЗ
		|	РегистрСведений.упоРасчетныеСрокиПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &Ссылка) КАК РегСроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
		|		ПО РегСроки.Версия = Версии.Версия И Версии.Текущая";
	#Если Не ТолстыйКлиентУправляемоеПриложение Тогда
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, Новый Структура("Ссылка", ПроектнаяЗадача));
	#Иначе
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ПроектнаяЗадача);
	РезультатЗапроса = Запрос.Выполнить();
	#КонецЕсли
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СрокиЗадачи = Новый Структура("ДатаРаннегоСтарта, ДатаПозднегоСтарта, ДатаРаннегоФиниша, ДатаПозднегоФиниша");
	Пока Выборка.Следующий() Цикл
		Для каждого Срок Из СрокиЗадачи Цикл
			СрокиЗадачи[Срок.Ключ] = Выборка[Срок.Ключ];
		КонецЦикла;
		Возврат СрокиЗадачи;
	КонецЦикла;
	
КонецФункции

// Получает данные версии проектной задачи.
//
// Параметры:
//  ЭтаФорма				 - УправляемаяФорма - форма документа.
//  Объект					 - ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой надо получить данные версии.
//  ДополнительныеСвойства	 - Структура - дополнительные свойства.
//
Процедура ПолучитьДанныеВерсии(ЭтаФорма, Объект, ДополнительныеСвойства) Экспорт
	
	ОграничитьКопированиеИзУпрощенногоВвода = ДополнительныеСвойства.Свойство("ОграничитьКопированиеИзУпрощенногоВвода")
		И ДополнительныеСвойства.ОграничитьКопированиеИзУпрощенногоВвода;
	
	ЗагрузитьТрудовыеРесурсы = ДополнительныеСвойства.Свойство("ЗагрузитьТрудовыеРесурсы")
		И ДополнительныеСвойства.ЗагрузитьТрудовыеРесурсы;
	
	СсылкаКопирования = Неопределено;
	ДополнительныеСвойства.Свойство("СсылкаКопирования", СсылкаКопирования);
	
	//
	
	текВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	
	Если ЗначениеЗаполнено(СсылкаКопирования) Тогда
		СсылкаДанных = СсылкаКопирования;
	Иначе
		СсылкаДанных = Объект.Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("текВерсия", текВерсия);
	Запрос.УстановитьПараметр("Ссылка", СсылкаДанных);
	
	// ПредусловияЗадачи
	Если Не ОграничитьКопированиеИзУпрощенногоВвода Тогда
		
		ТекстЗапроса = ТекстЗапросаПредусловия();
		Запрос.Текст = ТекстЗапроса;
		
		УстановитьПривилегированныйРежим(Истина);
		Результат = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат, Объект, "ПредусловияЗадачи");
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапросаДанныеВерсии();
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
		
		Объект.НазваниеПроектнойЗадачи = Выборка.НазваниеЗадачи;
		Объект.ДлительностьМоделиПакетаРаботВЧасах = Выборка.Длительность;
		
		// Данные получили по источнику копирования, возвращаем ссылку на объект.
		Если ЗначениеЗаполнено(СсылкаКопирования) Тогда
			Объект.ПроектнаяЗадача = Объект.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	// ДвиженияДенежныхСредств
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[2], Объект, "ДвиженияДенежныхСредств");
	
	// Субпродукты
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[3], Объект, "Субпродукты");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[5], Объект, "РаспределениеОбъемов");
	
	// Проектная продукция
	ЗаполнитьТабличнуюЧастьПоДаннымПроектнойПродукции(Объект, ЭтаФорма);
	
	// МатериальныеРесурсы
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[6], Объект, "МатериальныеРесурсы");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[7], Объект, "РаспределениеПотребностей");
	
	// ТрудовыеРесурсы
	Если Не ОграничитьКопированиеИзУпрощенногоВвода Или ЗагрузитьТрудовыеРесурсы Тогда
		ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[8], Объект, "ТрудовыеРесурсы");
		ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[9], Объект, "ТрудовыеРесурсыПоПериодам");
	КонецЕсли;
	
	// ДополнительныеЗатраты
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[10], Объект, "ДополнительныеЗатраты");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[11], Объект, "РаспределениеДополнительныхЗатрат");
	
	// ПланДоходов
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[12], Объект, "ПланДоходов");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[14], Объект, "РаспределениеДоходов");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[15], Объект, "РаспределениеДоходовПоПериодам");
	
	// ПланРасходов
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[16], Объект, "ПланРасходов");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[17], Объект, "РаспределениеРасходов");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[18], Объект, "РаспределениеРасходовПоПериодам");
	
	// ПричиныОтклонений
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[19], Объект, "ПричиныОтклонений");
	КонецЕсли;
	
	упоПроектыИЗадачиОбщие.УстановитьТипЗадачи(Объект);
	
	Если ЭтаФорма <> Неопределено Тогда
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДанныеВерсииПолучены", Истина);
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоДаннымПроектнойПродукции(Объект, ЭтаФорма)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;

	СписокСвойств = "ПроцентРаспределения, Количество, КоэффициентСложности, Трудоемкость, Нормирование";
	Для Каждого СтрокаПП Из Объект.Субпродукты Цикл
        
        Если Не ТипЗнч(СтрокаПП.Ресурс) = Тип("СправочникСсылка.упоПроектнаяПродукция") Тогда
            Продолжить;	
        КонецЕсли;
        
		Для Каждого СтрокаРоли Из СтрокаПП.Ресурс.РолиТР Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Роль", СтрокаРоли.РольТР);
			ПараметрыОтбора.Вставить("Подразделение", СтрокаРоли.Подразделение);
			ПараметрыОтбора.Вставить("ИндексСтрокиВладельца", СтрокаПП.ИндексСтрокРаспределения);
			СтрокиРаспределения = Объект.РаспределениеОбъемов.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокиРаспределения.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокиРаспределения[0], СтрокаРоли, СписокСвойств);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Получает данные плана расходов версии проектной задачи.
//
// Параметры:
//  ЭтаФорма				 - УправляемаяФорма - форма документа.
//  Объект					 - ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой надо получить данные версии.
//
Процедура ПолучитьДанныеПланаРасходовВерсии(ЭтаФорма, Объект) Экспорт
	
	ФормаМодифицирована = ЭтаФорма <> Неопределено И ЭтаФорма.Модифицированность;
	
	текВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПланРасходов();
	
	Запрос.УстановитьПараметр("текВерсия", текВерсия);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИменаКолонок = "Ресурс, Подразделение, УровеньПланирования, Количество";
	ТекстСообщения = СформироватьСообщениеОНедостаткеДанныхТрансляции(Объект.ТрудовыеРесурсы.Выгрузить( , ИменаКолонок),
			Объект.УровеньПланированияТрудозатратДляБДР);
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// ПланРасходов.
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[0], Объект, "ПланРасходов");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[1], Объект, "РаспределениеРасходов");
	ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(Результат[2], Объект, "РаспределениеРасходовПоПериодам");
	
	Если ЭтаФорма <> Неопределено И Не ФормаМодифицирована Тогда
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет наличие данных, необходимых для трансляции данных в таблицу плана расходов
//
// Параметры:
//  Таблица						 - ТаблицаЗначений - проверяемая таблица трудовых ресурсов.
//  УровеньПланированияДляБДР	 - ПеречислениеСсылка.упоУровеньПланированияТрудозатратДляБДР -
//		уровень планирования трудозатрат для трансляции.
//
// Возвращаемое значение:
//   - Строка
//
Функция СформироватьСообщениеОНедостаткеДанныхТрансляции(Таблица, УровеньПланированияДляБДР) Экспорт
	
	ТекстСообщения = НСтр("ru = ''");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УровеньПланированияДляБДР", УровеньПланированияДляБДР);
	Запрос.УстановитьПараметр("УровеньПланированияДляБДР_Авто", Перечисления.упоУровеньПланированияТрудозатратДляБДР.Авто);
	Запрос.УстановитьПараметр("УровеньПланированияДляБДР_Предв", Перечисления.упоУровеньПланированияТрудозатратДляБДР.ПредварительныйПоРолям);
	Запрос.УстановитьПараметр("УровеньПланированияДляБДР_Оконч", Перечисления.упоУровеньПланированияТрудозатратДляБДР.ОкончательныйПоРолям);
	Запрос.УстановитьПараметр("УровеньПредварительный", Перечисления.упоУровеньПланирования.Предварительный);
	Запрос.УстановитьПараметр("УровеньОкончательный", Перечисления.упоУровеньПланирования.Окончательный);
	Запрос.УстановитьПараметр("Таблица", Таблица);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ресурс КАК Ресурс,
		|	Таблица.УровеньПланирования КАК Уровень
		|ПОМЕСТИТЬ втТаблицаПредварительный
		|ИЗ
		|	&Таблица КАК Таблица
		|ГДЕ
		|	Таблица.УровеньПланирования = &УровеньПредварительный
		|	И НЕ Таблица.Ресурс = ЗНАЧЕНИЕ(Справочник.упоРоли.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ресурс КАК Ресурс,
		|	Таблица.УровеньПланирования КАК Уровень
		|ПОМЕСТИТЬ втТаблицаОкончательный
		|ИЗ
		|	&Таблица КАК Таблица
		|ГДЕ
		|	Таблица.УровеньПланирования = &УровеньОкончательный
		|	И НЕ Таблица.Ресурс = ЗНАЧЕНИЕ(Справочник.упоРоли.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТаблицаОкончательный.Ресурс, ТаблицаПредварительный.Ресурс) КАК Ресурс,
		|	ВЫБОР
		|		КОГДА &УровеньПланированияДляБДР = &УровеньПланированияДляБДР_Авто
		|			ТОГДА ЕСТЬNULL(ТаблицаОкончательный.Уровень, ТаблицаПредварительный.Уровень)
		|		КОГДА &УровеньПланированияДляБДР = &УровеньПланированияДляБДР_Предв
		|			ТОГДА ТаблицаПредварительный.Уровень
		|		КОГДА &УровеньПланированияДляБДР = &УровеньПланированияДляБДР_Оконч
		|			ТОГДА ТаблицаОкончательный.Уровень
		|	КОНЕЦ КАК Уровень
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	втТаблицаПредварительный КАК ТаблицаПредварительный
		|		ПОЛНОЕ СОЕДИНЕНИЕ втТаблицаОкончательный КАК ТаблицаОкончательный
		|		ПО ТаблицаПредварительный.Ресурс = ТаблицаОкончательный.Ресурс
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &УровеньПланированияДляБДР = &УровеньПланированияДляБДР_Авто
		|				ТОГДА ИСТИНА
		|			КОГДА &УровеньПланированияДляБДР = &УровеньПланированияДляБДР_Предв
		|				ТОГДА ТаблицаПредварительный.Уровень = &УровеньПредварительный
		|			КОГДА &УровеньПланированияДляБДР = &УровеньПланированияДляБДР_Оконч
		|				ТОГДА ТаблицаОкончательный.Уровень = &УровеньОкончательный
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	втТаблица.Ресурс КАК Ресурс,
		|	втТаблица.Уровень КАК Уровень,
		|	РесурсыПоСтатьямЗатрат.СтатьяЗатрат КАК СтатьяЗатрат,
		|	РесурсыПоСтатьямЗатрат.СтатьяЗатрат.СпособПривязкиРасходовТрудозатраты КАК СпособПривязки,
		|	РесурсыПоСтатьямЗатрат.ДоляСуммы КАК ДоляСуммы
		|ИЗ
		|	втТаблица КАК втТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРаспределениеРесурсовПоСтатьямЗатрат КАК РесурсыПоСтатьямЗатрат
		|		ПО (РесурсыПоСтатьямЗатрат.Ресурс = втТаблица.Ресурс)";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат ТекстСообщения;
	КонецЕсли;
	
	Ш_НетСтатьи = НСтр("ru = 'Для ресурса %1 (уровень планирования %2) не указаны статьи затрат.'");
	Ш_НетПривязки = НСтр("ru = 'Для ресурса %1 (уровень планирования %2) в статье %3 не указан способ привязки.'");
	Ш_НетДоли = НСтр("ru = 'Для ресурса %1 (уровень планирования %2) для статьи %3 не указана доля суммы (%).'");
	
	Выборка = Рез.Выбрать();
	МассивСтрокКОбъединению = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.СтатьяЗатрат) Тогда
			тТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ш_НетСтатьи,
					Выборка.Ресурс,
					Выборка.Уровень);
			МассивСтрокКОбъединению.Добавить(тТекст);
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Выборка.СпособПривязки) Тогда
			тТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ш_НетПривязки,
					Выборка.Ресурс,
					Выборка.Уровень,
					Выборка.СтатьяЗатрат);
			МассивСтрокКОбъединению.Добавить(тТекст);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Выборка.ДоляСуммы) Тогда
			тТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ш_НетДоли,
					Выборка.Ресурс,
					Выборка.Уровень,
					Выборка.СтатьяЗатрат);
			МассивСтрокКОбъединению.Добавить(тТекст);
		КонецЕсли;
	КонецЦикла;
	Если МассивСтрокКОбъединению.Количество() > 0 Тогда
		ТекстСообщения = СтрСоединить(МассивСтрокКОбъединению, Символы.ПС);
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

// Заполняет проектную задачу по основанию.
//
// Параметры:
//  ДанныеЗаполнения	- ДокументСсылка, СправочникСсылка - основание для заполнения.
//  Объект		 		- ДокументСсылка.упоПроектнаяЗадача - заполняемая ПЗ.
//
Процедура ЗаполнитьПЗПоОснованию(ДанныеЗаполнения, Объект) Экспорт
	
	Основание = ДанныеЗаполнения;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Проект") Тогда
			Основание = ДанныеЗаполнения.Проект;
		ИначеЕсли ДанныеЗаполнения.Свойство("ПроектнаяЗадача") Тогда
			Основание = ДанныеЗаполнения.ПроектнаяЗадача;
		КонецЕсли;
		
		ЗаписатьТипЗадачи = Ложь;
		Если ДанныеЗаполнения.Свойство("ЭтоВеха") Тогда
			Объект.ЭтоВеха = ДанныеЗаполнения.ЭтоВеха;
			ЗаписатьТипЗадачи = Истина;
		ИначеЕсли ДанныеЗаполнения.Свойство("ЭтоМодельПакетаРабот") Тогда
			Объект.ЭтоМодельПакетаРабот = ДанныеЗаполнения.ЭтоМодельПакетаРабот;
			ЗаписатьТипЗадачи = Истина;
		КонецЕсли;
		Если ЗаписатьТипЗадачи Тогда
			упоПроектыИЗадачиОбщие.ЗаписатьТипЗадачи(Объект);
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.НормаСтоимости = Константы.упоНормаСтоимостиПоУмолчанию.Получить();
	Объект.НормаСтоимостиТрудовыхРесурсов = Константы.упоНормаСтоимостиПоУмолчанию.Получить();
	Объект.ВнешняяНормаСтоимостиТрудовыхРесурсов = Константы.упоНормаСтоимостиПоУмолчаниюВнешняя.Получить();
	Объект.ПланироватьТрудозатратыНаИсполнителей = Истина;
	
	// Этот реквизит всегда истина по умолчанию.
	Объект.ОбновлятьДатуДокумента = Истина;
	
	ЭтоPM_Проф = упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф();
	Если Не ЭтоPM_Проф Тогда
		ТипПроектнойЗадачи = Объект.ТипПроектнойЗадачи;
		Если Не ЗначениеЗаполнено(ТипПроектнойЗадачи) Тогда
			ТипПроектнойЗадачи = упоПроектыИЗадачиОбщие.ПолучитьТипЗадачи(Объект);
		КонецЕсли;
		Объект.ВыводитьВСводныйСтатусОтчет = ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Этап;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(Объект, Основание);
	
	//
	
	ЗаполнитьРеквизитыЗадачиПоПроекту = Ложь;
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда
		Объект.ДокументОснование = Основание;
		Объект.Проект = Основание;
		упоПроектыИЗадачиСервер.ПроверитьТипПроекта(Объект.Проект);
		
		ЗаполнитьРеквизитыЗадачиПоПроекту = Истина;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Проект = упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(Основание, "Проект");
		
		Объект.ДокументОснование = Основание;
		Объект.Проект = Проект;
		Объект.ЗадачаРодитель = Основание;
		
		ТекВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
		Если ЗначениеЗаполнено(ТекВерсияПроекта) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьСубпродуктыВПланДоходов,
				|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьМатРесурсыВПланРасходов,
				|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьТрудРесурсыВПланРасходов,
				|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьДопЗатратыВПланРасходов,
				|	упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов,
				|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланДоходовВБДДС,
				|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланРасходовВБДДС,
				|	упоСвойстваПроектныхЗадачСрезПоследних.СхемаОплатыПоУмолчаниюРасходы,
				|	упоСвойстваПроектныхЗадачСрезПоследних.СхемаОплатыПоУмолчаниюДоходы,
				|	упоСвойстваПроектныхЗадачСрезПоследних.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов
				|ИЗ
				|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
				|			,
				|			Версия = &ТекВерсия
				|				И ПроектнаяЗадача = &ПЗ) КАК упоСвойстваПроектныхЗадачСрезПоследних";
			Запрос.УстановитьПараметр("ТекВерсия", ТекВерсияПроекта);
			Запрос.УстановитьПараметр("ПЗ", Основание);
			
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				ЗаполнитьРеквизитыЗадачиПоПроекту = Истина;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЗаполнитьЗначенияСвойств(Объект, Выборка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьРеквизитыЗадачиПоПроекту Тогда
		
		РеквизитыПроекта = упоФункцииБСП.ЗначенияРеквизитовОбъектаВызовСервера(Объект.Проект,
				"ВключитьСубпродуктыВПланДоходов, ВключитьМатРесурсыВПланРасходов, 
				|ВключитьТрудРесурсыВПланРасходов, ВключитьДопЗатратыВПланРасходов,
				|упоВключитьПланДоходовВБДДС, упоВключитьПланРасходовВБДДС,
				|упоСхемаОплатыПоУмолчаниюДоходы, упоСхемаОплатыПоУмолчаниюРасходы, 
				|упоТипСубпродукта");
		ЗаполнитьЗначенияСвойств(Объект, РеквизитыПроекта);
		Объект.ВключитьПланДоходовВБДДС = РеквизитыПроекта.упоВключитьПланДоходовВБДДС;
		Объект.ВключитьПланРасходовВБДДС = РеквизитыПроекта.упоВключитьПланРасходовВБДДС;
		Объект.СхемаОплатыПоУмолчаниюРасходы = РеквизитыПроекта.упоСхемаОплатыПоУмолчаниюРасходы;
		Объект.СхемаОплатыПоУмолчаниюДоходы = РеквизитыПроекта.упоСхемаОплатыПоУмолчаниюДоходы;
		Объект.ТипСубпродукта = РеквизитыПроекта.упоТипСубпродукта;
		
		ПроектныеОпции = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
		Объект.НормаСтоимостиТрудовыхРесурсов = ПроектныеОпции.НормаСтоимостиТрудовыхРесурсов;
		Объект.ВнешняяНормаСтоимостиТрудовыхРесурсов = ПроектныеОпции.ВнешняяНормаСтоимостиТрудовыхРесурсов;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает список трудовых ресурсов, которые были назначены
//  на выполнение работ по задаче.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой надо получить список трудовых ресурсов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - сформированный список исполнителей. Колонки:
//  * РольРесурса - СправочникСсылка.упоРоли - роль ресурса.
//  * Ресурс - СправочникСсылка.упоТрудовыеРесурсы - ресурс.
//
Функция ПолучитьСписокИсполнителей(ПроектнаяЗадача) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.РольРесурса,
		|	Рег.Ресурс
		|ИЗ
		|	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача И Версия = &текВерсия) КАК Рег
		|ГДЕ
		|	Рег.РесурсВыделен = ИСТИНА
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача.Проект);
	СтруктураПараметров = Новый Структура("ПроектнаяЗадача, текВерсия", ПроектнаяЗадача, текущаяВерсия);
	#Если Не ТолстыйКлиентУправляемоеПриложение Тогда
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, СтруктураПараметров);
	#Иначе
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("текВерсия", текущаяВерсия);
	РезультатЗапроса = Запрос.Выполнить();
	#КонецЕсли
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Процедура получает все необходимые данные документа.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - проектная задача, для которой надо получить все данные.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - сформированная структура данных.
//
Функция ПолучитьДанные(ПроектнаяЗадача) Экспорт
	
	НужныеТаблицы = Новый Структура("ДанныеЗадачи");
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьДанныеПроектнойЗадачи(ПроектнаяЗадача, НужныеТаблицы);
	
КонецФункции

// Заполняет план расходов по трудовым ресурсам.
//
// Параметры:
//  Объект	- ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой заполняется план расходов по трудовым ресурсам.
//  Очищать	- Булево - признак предварительной очистки табличных частей "ПланРасходов" и "РаспределениеРасходов".
//
Процедура ЗаполнитьПланРасходовПоТрудовымРесурсам(Объект, Очищать = Истина, Свернуть = Истина,
		УчитыватьПериодРегистрацииНормСтоимости = Ложь) Экспорт
	
	Если Очищать Тогда
		ОчиститьПланРасходовРаспределениеРасходовКромеИсточникаТрудозатраты(Объект);
	КонецЕсли;
	
	Проект = Объект.Проект;
	ПроектнаяЗадача = Объект.Ссылка;
	
	ТаблицаТрудовыеРесурсы = Объект.ТрудовыеРесурсы.Выгрузить();
	ТаблицаТрудовыеРесурсыПоПериодам = Объект.ТрудовыеРесурсыПоПериодам.Выгрузить();
	ТаблицаПланРасходов = Объект.ПланРасходов.Выгрузить(Новый Массив);
	
	СтартовыйИндекс = упоАналитикаПоПодразделениямКлиентСервер.
		ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект.ПланРасходов);
	
	упоРаспределениеТрудозатратВызовСервера.ЗаполнитьПланРасходовПоТрудовымРесурсам(Проект,
		ПроектнаяЗадача,
		ТаблицаТрудовыеРесурсы,
		ТаблицаТрудовыеРесурсыПоПериодам,
		ТаблицаПланРасходов,
		Объект.РаспределениеРасходов,
		СтартовыйИндекс,
		Свернуть,
		УчитыватьПериодРегистрацииНормСтоимости);
	
	Для Каждого Строка Из ТаблицаПланРасходов Цикл
		ЗаполнитьЗначенияСвойств(Объект.ПланРасходов.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры

// Очищает план расходов задачи: оставляет только строки, добавленные трансляцией трудозатрат.
//
// Параметры:
//  Объект					 - ДокументОбъект.упоПроектнаяЗадача, Структура - обрабатываемая задача.
//  ИмяТаблицы				 - Строка - Имя таблицы плана расходов.
//  ИмяПодчиненнойТаблицы	 - Строка - Имя таблицы распределения плана расходов.
//
Процедура ОчиститьПланРасходовРаспределениеРасходовКромеИсточникаТрудозатраты(Объект,
		ИмяТаблицы = "ПланРасходов",
		ИмяПодчиненнойТаблицы = "РаспределениеРасходов") Экспорт
	// Строки, добавленные трансляцией трудозатрат, не должны очищаться.
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаРасход Из Объект[ИмяТаблицы] Цикл
		Если СтрокаРасход.ИсточникПлана <> Перечисления.упоИсточникПланаДоходовИРасходов.Трудозатраты Тогда
			СтрокиКУдалению.Добавить(СтрокаРасход);
		КонецЕсли;
	КонецЦикла;
	Если СтрокиКУдалению.Количество() = Объект[ИмяТаблицы].Количество() Тогда
		Объект[ИмяТаблицы].Очистить();
		Объект[ИмяПодчиненнойТаблицы].Очистить();
	Иначе
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			НайденныеСтроки = Объект[ИмяПодчиненнойТаблицы].НайтиСтроки(
					Новый Структура("ИндексСтрокиВладельца", СтрокаКУдалению.ИндексСтрокРаспределения));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Объект[ИмяПодчиненнойТаблицы].Удалить(НайденнаяСтрока);
			КонецЦикла;
			Объект[ИмяТаблицы].Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет план расходов по плану доходов.
//
// Параметры:
//  Объект					 - ДокументОбъект.упоПроектнаяЗадача - ПЗ, для которой заполняется план расходов по трудовым ресурсам.
//  ИмяТаблицы				 - Строка							 - Имя таблицы плана расходов.
//  ИмяПодчиненнойТаблицы	 - Строка							 - Имя таблицы распределения плана расходов.
//  ИмяСсылки				 - Строка							 - Имя реквизита, содержащего ссылку на проектную задачу.
//  ОчиститьПланРасходов	 - 									 - Ложь - новые записи будут добавлены в таблицу без очистки существующих.
//
Процедура ЗаполнитьПланРасходовПоПлануДоходов(Объект,
		ИмяТаблицы = "ПланРасходов",
		ИмяПодчиненнойТаблицы = "РаспределениеРасходов",
		ИмяСсылки = "Ссылка",
		ОчиститьПланРасходов) Экспорт
		
	Если ОчиститьПланРасходов Тогда
		ОчиститьПланРасходовРаспределениеРасходовКромеИсточникаТрудозатраты(Объект, ИмяТаблицы, ИмяПодчиненнойТаблицы);
	КонецЕсли;
	
	СтруктураСвойствПоУмолчанию = упоАналитикаПоПодразделениямСервер.
		ПолучитьЗначенияДляПодстановкиПоУмолчанию(Объект.Проект);
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта КАК Валюта,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная КАК Сумма
	               |ПОМЕСТИТЬ втПланДоходов
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ПроектнаяЗадача = &Ссылка
	               |				И ВидЭлемента = &ВидЭлементаДоход) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	               |ГДЕ
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоПроцентыЗатратСрезПоследних.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	СУММА(упоПроцентыЗатратСрезПоследних.Процент) КАК Процент
	               |ПОМЕСТИТЬ втПроцентыЗатрат
	               |ИЗ
	               |	РегистрСведений.упоПроцентыЗатрат.СрезПоследних КАК упоПроцентыЗатратСрезПоследних
	               |ГДЕ
	               |	упоПроцентыЗатратСрезПоследних.Процент <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоПроцентыЗатратСрезПоследних.СтатьяЗатрат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПланДоходов.Валюта КАК Валюта,
	               |	втПланДоходов.Подразделение КАК Подразделение,
	               |	втПланДоходов.Роль КАК Роль,
	               |	втПланДоходов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	СУММА(втПланДоходов.Сумма) КАК СуммаДоход,
	               |	СУММА(втПроцентыЗатрат.Процент * втПланДоходов.Сумма / 100) КАК Сумма,
	               |	втПроцентыЗатрат.СтатьяЗатрат КАК Статья,
	               |	ВЫБОР
	               |		КОГДА втПроцентыЗатрат.СтатьяЗатрат.ПрофильРаспределенияПоУмолчанию = ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка)
	               |			ТОГДА &ПрофильРасходовПоУмолчанию
	               |		ИНАЧЕ втПроцентыЗатрат.СтатьяЗатрат.ПрофильРаспределенияПоУмолчанию
	               |	КОНЕЦ КАК ПрофильРаспределения,
	               |	ВЫБОР
	               |		КОГДА втПроцентыЗатрат.СтатьяЗатрат.СпособПривязкиРасходовПоУмолчанию = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПустаяСсылка)
	               |			ТОГДА &СпособПривязкиПоУмолчанию
	               |		ИНАЧЕ втПроцентыЗатрат.СтатьяЗатрат.СпособПривязкиРасходовПоУмолчанию
	               |	КОНЕЦ КАК СпособПривязки
	               |ИЗ
	               |	втПланДоходов КАК втПланДоходов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втПроцентыЗатрат КАК втПроцентыЗатрат
	               |		ПО (ИСТИНА)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втПланДоходов.Валюта,
	               |	втПланДоходов.Подразделение,
	               |	втПланДоходов.Роль,
	               |	втПланДоходов.СобствСилы_Субподряд,
	               |	втПроцентыЗатрат.СтатьяЗатрат,
	               |	ВЫБОР
	               |		КОГДА втПроцентыЗатрат.СтатьяЗатрат.ПрофильРаспределенияПоУмолчанию = ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка)
	               |			ТОГДА &ПрофильРасходовПоУмолчанию
	               |		ИНАЧЕ втПроцентыЗатрат.СтатьяЗатрат.ПрофильРаспределенияПоУмолчанию
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА втПроцентыЗатрат.СтатьяЗатрат.СпособПривязкиРасходовПоУмолчанию = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПустаяСсылка)
	               |			ТОГДА &СпособПривязкиПоУмолчанию
	               |		ИНАЧЕ втПроцентыЗатрат.СтатьяЗатрат.СпособПривязкиРасходовПоУмолчанию
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(втПроцентыЗатрат.Процент * втПланДоходов.Сумма / 100) КАК Сумма
	               |ИЗ
	               |	втПланДоходов КАК втПланДоходов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втПроцентыЗатрат КАК втПроцентыЗатрат
	               |		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект[ИмяСсылки]);
	Запрос.УстановитьПараметр("Версия", ТекВерсия);
	Запрос.УстановитьПараметр("ВидЭлементаДоход",
		ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход"));
	Запрос.УстановитьПараметр("ПрофильРасходовПоУмолчанию", СтруктураСвойствПоУмолчанию.ПрофильРасходовПоУмолчанию);
	Запрос.УстановитьПараметр("СпособПривязкиПоУмолчанию",
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения"));
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ТаблицаРаспределения = Результаты[2].Выгрузить();
	ВыборкаДоходы = Результаты[3].Выбрать();
	
	Если ВыборкаДоходы.Следующий() Тогда
		ОбщаяСуммаРаспределения = ВыборкаДоходы.Сумма;
	КонецЕсли;
	
	ТаблицаСтатей = ТаблицаРаспределения.Скопировать();
	ТаблицаСтатей.Свернуть("Статья, Валюта, ПрофильРаспределения, СпособПривязки", "Сумма");
	ТаблицаСтатей.Колонки.Добавить("ИндексСтрокРаспределения");
	ТаблицаРаспределения.Колонки.Добавить("ИндексСтрокиВладельца");
	
	МассивКоэфСтатей = Новый Массив;
	Для Каждого СтрокаСтатья Из ТаблицаСтатей Цикл
		МассивКоэфСтатей.Добавить(СтрокаСтатья.Сумма);
	КонецЦикла;
	
	МассивСуммСтатей = упоФункцииОбщегоНазначенияСервер.РаспределитьПропорционально(ОбщаяСуммаРаспределения,
		МассивКоэфСтатей);
	Если МассивСуммСтатей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачальныйИндекс = упоАналитикаПоПодразделениямКлиентСервер.
		ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект.ПланРасходов);
	
	КоличествоСтатей = ТаблицаСтатей.Количество();
	
	Отбор = Новый Структура("Статья, Валюта");
	Для Индекс = 0 По КоличествоСтатей - 1 Цикл
		
		ТаблицаСтатей[Индекс].Сумма = МассивСуммСтатей[Индекс];
		
		ИндексСтрокРаспределения = Индекс + НачальныйИндекс + 1; 
		ТаблицаСтатей[Индекс].ИндексСтрокРаспределения = ИндексСтрокРаспределения;
		
		Если СвойстваПроекта.РасходыПоПодразделениям Тогда
			
			МассивКоэф = Новый Массив;
			
			Отбор.Статья = ТаблицаСтатей[Индекс].Статья;
			Отбор.Валюта = ТаблицаСтатей[Индекс].Валюта;
			НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Отбор);
			Для Каждого СтрокаРаспределение Из НайденныеСтроки Цикл
				СтрокаРаспределение.ИндексСтрокиВладельца = ИндексСтрокРаспределения;
				МассивКоэф.Добавить(СтрокаРаспределение.СуммаДоход);
			КонецЦикла;
			
			МассивСумм = упоФункцииОбщегоНазначенияСервер.РаспределитьПропорционально(ТаблицаСтатей[Индекс].Сумма, МассивКоэф);
			
			КоличествоНайденныхСтрок = НайденныеСтроки.Количество();
			Для ИндексСтрокиВМассиве = 0 По КоличествоНайденныхСтрок - 1 Цикл
				НайденныеСтроки[ИндексСтрокиВМассиве].Сумма = МассивСумм[ИндексСтрокиВМассиве];
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицыСтатей ИЗ ТаблицаСтатей Цикл
		ЗаполнитьЗначенияСвойств(Объект[ИмяТаблицы].Добавить(), СтрокаТаблицыСтатей);
	КонецЦикла;
	
	Если СвойстваПроекта.РасходыПоПодразделениям Тогда
		Для каждого СтрокаТаблицыРаспределения ИЗ ТаблицаРаспределения	Цикл
			СтрокаДобавления = Объект[ИмяПодчиненнойТаблицы].Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДобавления, СтрокаТаблицыРаспределения);
			СтрокаДобавления.СпособПривязки = упоАналитикаПоПодразделениямКлиентСервер.
				СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(СтрокаТаблицыРаспределения.СпособПривязки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет распределение плана доходов по трудовым ресурсам.
//
// Параметры:
//  СтруктураПараметров - Структура:
//      * Объект	- ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой заполняется план доходов по трудовым ресурсам.
//      * Очищать	- Булево - признак предварительной очистки табличных частей "ПланДоходов" и "РаспределениеДоходов".
//      * УровеньПланирования	- Перечисление.упоУровеньПланирования
//      * ДанныеСтрокиРаспределения - Структура:
//          * ИндексСтрокРаспределения - Число
//          * Сумма - Число
//
Процедура ЗаполнитьРаспределениеДоходовПоТрудовымМатериальнымРесурсам(СтруктураПараметров) Экспорт
	
	Объект = Неопределено;
	Очищать = Неопределено;
	УровеньПланирования = Неопределено;
	ТолькоТрудовыеРесурсы = Неопределено;
	ДанныеСтрокиРаспределения = Неопределено;
	ТолькоМатРесурсы = Неопределено;
	
	СтруктураПараметров.Свойство("Объект", Объект);
	СтруктураПараметров.Свойство("Очищать", Очищать);
	СтруктураПараметров.Свойство("УровеньПланирования", УровеньПланирования);
	СтруктураПараметров.Свойство("ТолькоТрудовыеРесурсы", ТолькоТрудовыеРесурсы);
	СтруктураПараметров.Свойство("ДанныеСтрокиРаспределения", ДанныеСтрокиРаспределения);
	СтруктураПараметров.Свойство("ТолькоМатРесурсы", ТолькоМатРесурсы);
		
	Если Очищать Тогда       
        ОчиститьДанныеРаспределения(Объект, ДанныеСтрокиРаспределения.ИндексСтрокРаспределения, "ИндексСтрокиВладельца",
            "РаспределениеДоходов");
	КонецЕсли;
	
	// Если есть данные по уровню планирования "Предварительный" и нет по "Окончательный",
	// то заполнять по "Предварительный".
	// Если есть данные по уровню планирования "Окончательный", то заполнять по "Окончательный".
    Если ТолькоТрудовыеРесурсы Тогда
    	КолонкаСтоимость = "ОбщВнешняяСтоимость";
        ТаблицаРесурсы = ТаблицаТрудовыхРесурсовПоУровням(Объект.ТрудовыеРесурсы.Выгрузить(), УровеньПланирования, 
            КолонкаСтоимость);
	Иначе
    	КолонкаСтоимость = "Стоимость";
        ТаблицаРесурсы = ТаблицаПлановРесурсов(Объект, УровеньПланирования, ТолькоМатРесурсы);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаРесурсы) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяСумма = ДанныеСтрокиРаспределения.Сумма;
	ОбщаяСуммаДляРасчетаДоли = ТаблицаРесурсы.Итог(КолонкаСтоимость);
	ВалютаУпрУчета = упоПроектноеБюджетированиеПовтИсп.ВалютаУправленческогоУчета();
	
	ЗначенияПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Объект.Проект);
	
	НастройкиУчета = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	Для Каждого СтрокаТР Из ТаблицаРесурсы Цикл
		Если СтрокаТР[КолонкаСтоимость] = 0 Тогда
			Продолжить;
        КонецЕсли;
		НоваяСтрокаРаспределения = Объект.РаспределениеДоходов.Добавить();
		НоваяСтрокаРаспределения.ИндексСтрокиВладельца = ДанныеСтрокиРаспределения.ИндексСтрокРаспределения;
		НоваяСтрокаРаспределения.КонтрагентПодрядчик = ЗначенияПоУмолчанию.КонтрагентДоходовПоУмолчанию;
		НоваяСтрокаРаспределения.ЗаказДоговорПодрядчика = ЗначенияПоУмолчанию.ДоговорДоходовПоУмолчанию;
		НоваяСтрокаРаспределения.Роль = СтрокаТР.Ресурс;
		НоваяСтрокаРаспределения.Подразделение = СтрокаТР.Подразделение;
        Если ТолькоТрудовыеРесурсы Тогда
             НоваяСтрокаРаспределения.СобствСилы_Субподряд = упоАналитикаПоПодразделениямСервер.СССП_Роли(СтрокаТР.Ресурс);	
        Иначе
            НоваяСтрокаРаспределения.СобствСилы_Субподряд = ?(ЗначениеЗаполнено(СтрокаТР.СобствСилы_Субподряд), 
                СтрокаТР.СобствСилы_Субподряд, упоАналитикаПоПодразделениямСервер.СССП_Роли(СтрокаТР.Ресурс));
		КонецЕсли;
		НоваяСтрокаРаспределения.Сумма = СтрокаТР[КолонкаСтоимость] / ОбщаяСуммаДляРасчетаДоли * ОбщаяСумма;
		Если Не НастройкиУчета.ДоходыПоНатуральнымПоказателям Тогда
			НоваяСтрокаРаспределения.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения;
			НоваяСтрокаРаспределения.ПрофильРаспределения = ЗначенияПоУмолчанию.ПрофильДоходовПоУмолчанию;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет план доходов по планам ресурсов (материальные, трудовые).
//
// Параметры:
//  СтруктураПараметров - Структура:
//      * Объект	- ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой заполняется план доходов по трудовым ресурсам.
//      * Очищать	- Булево - признак предварительной очистки табличных частей "ПланДоходов" и "РаспределениеДоходов".
//      * УровеньПланирования	- Перечисление.упоУровеньПланирования
//      * ТолькоТрудовыеРесурсы - Булево
//
Процедура ЗаполнитьПланДоходовПоПланамТрудовыхМатериальныхРесурсов(СтруктураПараметров) Экспорт
	
	Объект = Неопределено;
	Очищать = Неопределено;
	УровеньПланирования = Неопределено;
	ТолькоТрудовыеРесурсы = Неопределено;
	ТолькоМатРесурсы = Неопределено;
	
	СтруктураПараметров.Свойство("Объект", Объект);
	СтруктураПараметров.Свойство("Очищать", Очищать);
	СтруктураПараметров.Свойство("УровеньПланирования", УровеньПланирования);
	СтруктураПараметров.Свойство("ТолькоТрудовыеРесурсы", ТолькоТрудовыеРесурсы);
	СтруктураПараметров.Свойство("ТолькоМатРесурсы", ТолькоМатРесурсы);
	
	Если Очищать Тогда
		Объект.ПланДоходов.Очистить();
		Объект.РаспределениеДоходов.Очистить();
	КонецЕсли;
	
	// Если есть данные по уровню планирования "Предварительный" и нет по "Окончательный",
	// то заполнять по "Предварительный".
	// Если есть данные по уровню планирования "Окончательный", то заполнять по "Окончательный".
    Если ТолькоТрудовыеРесурсы Тогда
    	КолонкаСтоимость = "ОбщВнешняяСтоимость";
        ТаблицаРесурсы = ТаблицаТрудовыхРесурсовПоУровням(Объект.ТрудовыеРесурсы.Выгрузить(), УровеньПланирования, 
            КолонкаСтоимость);
	Иначе
    	КолонкаСтоимость = "Стоимость";
        ТаблицаРесурсы = ТаблицаПлановРесурсов(Объект, УровеньПланирования, ТолькоМатРесурсы);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТаблицаРесурсы) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяСумма = ТаблицаРесурсы.Итог(КолонкаСтоимость);
	ВалютаУпрУчета = упоПроектноеБюджетированиеПовтИсп.ВалютаУправленческогоУчета();
	
	ЗначенияПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Объект.Проект);
	
	НоваяСтрока = Объект.ПланДоходов.Добавить();
	ИндексСтрокРаспределения =
		упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект.ПланДоходов);
	НоваяСтрока.ИндексСтрокРаспределения = ИндексСтрокРаспределения;
	НоваяСтрока.Сумма = ОбщаяСумма;
	НоваяСтрока.Валюта = ВалютаУпрУчета;
	НоваяСтрока.Статья = ЗначенияПоУмолчанию.СтатьяДоходовПоУмолчанию;
	НоваяСтрока.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения;
	НоваяСтрока.ПрофильРаспределения = ЗначенияПоУмолчанию.ПрофильДоходовПоУмолчанию;
	НоваяСтрока.Договор = ЗначенияПоУмолчанию.ДоговорДоходовПоУмолчанию;
	НоваяСтрока.Контрагент = ЗначенияПоУмолчанию.КонтрагентДоходовПоУмолчанию;
	
	ИндексСтроки = Объект.ПланДоходов.Индекс(НоваяСтрока);
	
	РесурсыБезСтоимости = Новый Массив;
	
	НастройкиУчета = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	Если НастройкиУчета.ДоходыПоПодразделениям Тогда
		
		Для Каждого СтрокаТР Из ТаблицаРесурсы Цикл
			
			НоваяСтрокаРаспределения = Объект.РаспределениеДоходов.Добавить();
			НоваяСтрокаРаспределения.ИндексСтрокиВладельца = ИндексСтрокРаспределения;
			НоваяСтрокаРаспределения.КонтрагентПодрядчик = ЗначенияПоУмолчанию.КонтрагентДоходовПоУмолчанию;
			НоваяСтрокаРаспределения.ЗаказДоговорПодрядчика = ЗначенияПоУмолчанию.ДоговорДоходовПоУмолчанию;
			НоваяСтрокаРаспределения.Роль = СтрокаТР.Ресурс;
			НоваяСтрокаРаспределения.Подразделение = СтрокаТР.Подразделение;
			Если ТолькоТрудовыеРесурсы Тогда
				НоваяСтрокаРаспределения.СобствСилы_Субподряд = упоАналитикаПоПодразделениямСервер.СССП_Роли(СтрокаТР.Ресурс);
			Иначе
				НоваяСтрокаРаспределения.СобствСилы_Субподряд = ?(ЗначениеЗаполнено(СтрокаТР.СобствСилы_Субподряд), 
					СтрокаТР.СобствСилы_Субподряд,
					упоАналитикаПоПодразделениямСервер.СССП_Роли(СтрокаТР.Ресурс));
			КонецЕсли;
			НоваяСтрокаРаспределения.Сумма = СтрокаТР[КолонкаСтоимость];
			Если СтрокаТР[КолонкаСтоимость] = 0 Тогда
				РесурсыБезСтоимости.Добавить(СтрокаТР.Ресурс);
			КонецЕсли;
			Если Не НастройкиУчета.ДоходыПоНатуральнымПоказателям Тогда
				НоваяСтрокаРаспределения.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения;
				НоваяСтрокаРаспределения.ПрофильРаспределения = ЗначенияПоУмолчанию.ПрофильДоходовПоУмолчанию;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РесурсыБезСтоимости) Тогда
		ШаблонСообщения = НСтр("ru = 'В строке №%1 таблицы ""План доходов"" не заполнена стоимость по ресурсам:
		|%2.
		|Суммы дохода необходимо заполнить вручную.'");
		НомерСтрокиДляТекстаСообщения = ИндексСтроки + 1;
		РолиСтрокой = СтрСоединить(РесурсыБезСтоимости, Символы.ПС);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
			НомерСтрокиДляТекстаСообщения, РолиСтрокой);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет СписокПотомков полным перечнем зависимых проектных задач
//
// Параметры:
//  Объект	- ДокументСсылка.упоПроектнаяЗадача - ПЗ, для которой собирается список потомков.
//  СписокПотомков	- СписокЗначений - хранит весь список потомков.
//
Процедура ПолучитьПолныйСписокПотомков(Объект, СписокПотомков) Экспорт
	
	Если ТипЗнч(Объект) <> Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Возврат;
	КонецЕсли;
	
	ПрямыеПотомки = упоПредставлениеПроектаВызовСервера.обПолучитьСписокПрямыхПотомковЗадачи(Объект);
	Для Каждого ПЗПотомок Из ПрямыеПотомки Цикл
		СписокПотомков.Добавить(ПЗПотомок.ПроектнаяЗадача);
		ПолучитьПолныйСписокПотомков(ПЗПотомок.ПроектнаяЗадача, СписокПотомков)
	КонецЦикла;
	
КонецПроцедуры

#Область Интеграция_с_ДО

// Возвращает неинтегрируемые реквизиты задачи для Документооборота.
//
// Возвращаемое значение:
//  Массив - реквизиты, которые не должны участвовать в интеграции ДО
//
Функция НеинтегрируемыеРеквизитыОбъектаИС() Экспорт
	
	НеинтегрируемыеРеквизиты = Новый Массив;
	НеинтегрируемыеРеквизиты.Добавить("Дата");
	НеинтегрируемыеРеквизиты.Добавить("ОбновлятьДатуДокумента");
	НеинтегрируемыеРеквизиты.Добавить("Номер");
	НеинтегрируемыеРеквизиты.Добавить("Автор");
	// Не меняем тип ПЗ и положение в иерархии.
	НеинтегрируемыеРеквизиты.Добавить("ТипПроектнойЗадачи");
	НеинтегрируемыеРеквизиты.Добавить("ЭтоВеха");
	НеинтегрируемыеРеквизиты.Добавить("ЭтоМодельПакетаРабот");
	НеинтегрируемыеРеквизиты.Добавить("ЭтоПакетРабот");
	НеинтегрируемыеРеквизиты.Добавить("ЗадачаРодитель");
	// Не меняем сроки ПЗ.
	НеинтегрируемыеРеквизиты.Добавить("ДатаНачалаПлан");
	НеинтегрируемыеРеквизиты.Добавить("ДатаЗавершенияПлан");
	НеинтегрируемыеРеквизиты.Добавить("РучнойВводСроков");
	НеинтегрируемыеРеквизиты.Добавить("КрайнийСрок");
	НеинтегрируемыеРеквизиты.Добавить("ДлительностьБезУчетаКалендаряПроекта");
	НеинтегрируемыеРеквизиты.Добавить("ДлительностьМоделиПакетаРабот");
	НеинтегрируемыеРеквизиты.Добавить("ДлительностьМоделиПакетаРаботВЧасах");
	НеинтегрируемыеРеквизиты.Добавить("МетодРасчетаМоделиПакетаРабот");
	НеинтегрируемыеРеквизиты.Добавить("ЗапретитьАвтоЗапуск");
	// Не меняем флаги импорта.
	НеинтегрируемыеРеквизиты.Добавить("ФлагИмпортаMSP");
	НеинтегрируемыеРеквизиты.Добавить("СкопированаВСводныйИзЗадачи");
	
	Возврат НеинтегрируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Проект)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.упоЗакрытиеЭтапа.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоИзменениеРуководителяПроектнойЗадачи.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияПоказателейПроекта.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияФактическиВыполненногоОбъема.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияФактическихДвиженийДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияФактическихДопЗатрат.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияФактическихДоходовИРасходов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияФактическихЗатратМатРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРучнаяАктуализацияПроекта.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Документы.упоСтатусОтчетПоПроекту.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		
		КомандаСозданияНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСозданияНаОсновании.Обработчик = "упоИнтеграцияУПФКлиент.ВводНаОсновании_СоздатьЗаказПокупателя";
		КомандаСозданияНаОсновании.Идентификатор = "ИнтеграцияУПФСоздатьЗаказПокупателя";
		КомандаСозданияНаОсновании.Представление = НСтр("ru = 'Заказ покупателя'");
		КомандаСозданияНаОсновании.РежимЗаписи = ?(Параметры.ВидВРег = "ДОКУМЕНТ", "Проводить", "Записывать");
		КомандаСозданияНаОсновании.Порядок = 1;
		
		КомандаСозданияНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСозданияНаОсновании.Обработчик = "упоИнтеграцияУПФКлиент.ВводНаОсновании_СоздатьЗаказПоставщику";
		КомандаСозданияНаОсновании.Идентификатор = "ИнтеграцияУПФСоздатьЗаказПоставщику";
		КомандаСозданияНаОсновании.Представление = НСтр("ru = 'Заказ поставщику'");
		КомандаСозданияНаОсновании.РежимЗаписи = ?(Параметры.ВидВРег = "ДОКУМЕНТ", "Проводить", "Записывать");
		КомандаСозданияНаОсновании.Порядок = 2;
		
	КонецЕсли;
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоПроектнаяЗадача);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанныхВерсии

Функция ТекстЗапросаСвойстваПЗ()
	
	ТекстЗапросаСвойства = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	сроки.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	сроки.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
		|	ПрогнозныеСроки.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
		|	ПрогнозныеСроки.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
		|	ПрогнозныеСроки.СтатусСроков КАК СтатусСроков,
		|	&ПоляСвойств
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка) КАК свойства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		|				,
		|				Версия = &текВерсия
		|					И ПроектнаяЗадача = &Ссылка) КАК сроки
		|		ПО свойства.Версия = сроки.Версия
		|			И свойства.ПроектнаяЗадача = сроки.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПрогнозныеСроки КАК ПрогнозныеСроки
		|		ПО свойства.ПроектнаяЗадача = ПрогнозныеСроки.ПроектнаяЗадача";
	
	РесурсыРегистра = Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Ресурсы;
	СтрокиЗапросаСвойств = Новый Массив;
	Для Каждого Ресурс Из РесурсыРегистра Цикл
		СтрокаЗапроса = СтрШаблон("свойства.%1", Ресурс.Имя);
		СтрокиЗапросаСвойств.Добавить(СтрокаЗапроса);
	КонецЦикла;
	ТекстСвойства = СтрСоединить(СтрокиЗапросаСвойств, ",");
	
	ТекстЗапросаСвойства = СтрЗаменить(ТекстЗапросаСвойства, "&ПоляСвойств", ТекстСвойства);
	
	Возврат ТекстЗапросаСвойства;
	
КонецФункции

// Важно! Если изменился состав полей табличных частей МатериальныеРесурсы, Субпродукты, то
// необходимо отразить это в расширении BIM,
// упо_BIM_ДанныеBIMСервер.ТекстЗапросаОбъемыСоСтатусамиRenga()/ТекстЗапросаМатериальныеЗатратыСоСтатусамиRenga().
//
Функция ТекстЗапросаДанныеТабличныхЧастей()
	
	ТекстДДС = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДДС.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ДДС.СтатьяДДС КАК СтатьяДДС,
		|	ДДС.НаправлениеДвижения КАК НаправлениеДвижения,
		|	ДДС.Контрагент КАК Контрагент,
		|	ДДС.Договор КАК Договор,
		|	ДДС.СпособПривязки КАК СпособПривязки,
		|	ДДС.ВидПлатежа КАК ВидПлатежа,
		|	ДДС.Задержка КАК Задержка,
		|	ДДС.ДатаПривязки КАК ДатаПривязки,
		|	ДДС.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДДС.Валюта КАК Валюта,
		|	ДДС.СуммаВалютная КАК Сумма
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДвиженияДенежныхСредств.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &Ссылка
		|				И Версия = &текВерсия) КАК ДДС
		|ГДЕ
		|	(ДДС.Сумма <> 0
		|			ИЛИ ДДС.СуммаВалютная <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДДС.НомерСтроки";
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ТекстСубпродукты = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Субпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	Субпродукты.Номенклатура КАК Ресурс,
			|	Субпродукты.Контрагент КАК Контрагент,
			|	Субпродукты.Договор КАК Договор,
			|	Субпродукты.ЕдиницаИзмерения КАК ЕдиницаНормирования,
			|	Субпродукты.СпособПривязки КАК СпособПривязкиВыпуска,
			|	Субпродукты.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
			|	Субпродукты.ДатаВыпуска КАК ДатаВыпуска,
			|	Субпродукты.Валюта КАК Валюта,
			|	Субпродукты.Цена КАК Стоимость,
			|	Субпродукты.Скорость КАК Скорость,
			|	Субпродукты.Основной КАК Основной,
			|	Субпродукты.Количество КАК Количество,
			|	Субпродукты.Сумма КАК Сумма,
			|	Субпродукты.Коэффициент КАК Коэффициент,
			|	Субпродукты.СуммаВалютная КАК ОбщСтоимость,
			|	Субпродукты.СтатьяДоходов КАК СтатьяДоходов,
			|	Субпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
			|	Субпродукты.СпособПривязкиДоходов КАК СпособПривязки,
			|	Субпродукты.ДатаПривязки КАК ДатаПривязки,
			|	Субпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
			|	Субпродукты.Комментарий КАК Комментарий,
			|	СтруктурыПД.Последовательность КАК Последовательность,
			|	СтруктурыПД.СкоростьВыполнения КАК СкоростьВыполнения,
			|	СтруктурыПД.НомерСвязи КАК НомерСвязи,
			|	ВЫБОР
			|		КОГДА ТИП(Справочник.упоПроектнаяПродукция) = ТИПЗНАЧЕНИЯ(Субпродукты.Номенклатура)
			|			ТОГДА Субпродукты.Номенклатура.Трудоемкость
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Трудоемкость,
			|	ВЫБОР
			|		КОГДА ТИП(Справочник.упоПроектнаяПродукция) = ТИПЗНАЧЕНИЯ(Субпродукты.Номенклатура)
			|			ТОГДА Субпродукты.Номенклатура.Нормирование
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Нормирование,
			|	ВЫБОР
			|		КОГДА ТИП(Справочник.упоПроектнаяПродукция) = ТИПЗНАЧЕНИЯ(Субпродукты.Номенклатура)
			|			ТОГДА Субпродукты.Номенклатура.КоэффициентСложности
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоэффициентСложности,
			|	ВЫБОР
			|		КОГДА ТИП(Справочник.Номенклатура) = ТИПЗНАЧЕНИЯ(Субпродукты.Номенклатура)
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ЭтоПП
			|ИЗ
			|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
			|			,
			|			ПроектнаяЗадача = &Ссылка
			|				И Версия = &текВерсия) КАК Субпродукты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПроектнойПродукции.СрезПоследних(
			|				,
			|				ПроектнаяЗадача = &Ссылка
			|					И Версия = &текВерсия) КАК СтруктурыПД
			|		ПО Субпродукты.Номенклатура = СтруктурыПД.ПроектнаяПродукция
			|ГДЕ
			|	(Субпродукты.Количество <> 0
			|			ИЛИ Субпродукты.Сумма <> 0
			|			ИЛИ Субпродукты.СуммаВалютная <> 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Субпродукты.НомерСтроки";
	Иначе
		ТекстСубпродукты = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Субпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	Субпродукты.Номенклатура КАК Ресурс,
			|	Субпродукты.Контрагент КАК Контрагент,
			|	Субпродукты.Договор КАК Договор,
			|	Субпродукты.ЕдиницаИзмерения КАК ЕдиницаНормирования,
			|	Субпродукты.СпособПривязки КАК СпособПривязкиВыпуска,
			|	Субпродукты.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
			|	Субпродукты.ДатаВыпуска КАК ДатаВыпуска,
			|	Субпродукты.Валюта КАК Валюта,
			|	Субпродукты.Цена КАК Стоимость,
			|	Субпродукты.Скорость КАК Скорость,
			|	Субпродукты.Основной КАК Основной,
			|	Субпродукты.Количество КАК Количество,
			|	Субпродукты.Сумма КАК Сумма,
			|	Субпродукты.Коэффициент КАК Коэффициент,
			|	Субпродукты.СуммаВалютная КАК ОбщСтоимость,
			|	Субпродукты.СтатьяДоходов КАК СтатьяДоходов,
			|	Субпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
			|	Субпродукты.СпособПривязкиДоходов КАК СпособПривязки,
			|	Субпродукты.ДатаПривязки КАК ДатаПривязки,
			|	Субпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
			|	Субпродукты.Комментарий КАК Комментарий
			|ИЗ
			|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
			|			,
			|			ПроектнаяЗадача = &Ссылка
			|				И Версия = &текВерсия) КАК Субпродукты
			|ГДЕ
			|	(Субпродукты.Количество <> 0
			|			ИЛИ Субпродукты.Сумма <> 0
			|			ИЛИ Субпродукты.СуммаВалютная <> 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Субпродукты.НомерСтроки";
	КонецЕсли;
	
	ТекстОстальное = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ВидОбъема КАК ВидОбъема,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаВалютная,
		|	упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ПланОбъемовПодразделения
		|ИЗ
		|	РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
		|ГДЕ
		|	(упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0
		|			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
		|			ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПланОбъемовПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ПланОбъемовПодразделения.Подразделение КАК Подразделение,
		|	ВТ_ПланОбъемовПодразделения.Роль КАК Роль,
		|	ВТ_ПланОбъемовПодразделения.СпособПривязки КАК СпособПривязки,
		|	ВТ_ПланОбъемовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ВТ_ПланОбъемовПодразделения.ДатаНачисления КАК ДатаПривязки,
		|	ВТ_ПланОбъемовПодразделения.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	ВТ_ПланОбъемовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ВТ_ПланОбъемовПодразделения.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	ВТ_ПланОбъемовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ВТ_ПланОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	ВТ_ПланОбъемовПодразделения.СуммаВалютная КАК Сумма,
		|	ВТ_ПланОбъемовПодразделения.Количество КАК Количество
		|ИЗ
		|	ВТ_ПланОбъемовПодразделения КАК ВТ_ПланОбъемовПодразделения
		|ГДЕ
		|	ВТ_ПланОбъемовПодразделения.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ПланОбъемовПодразделения.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МатРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	МатРесурсы.Номенклатура КАК Ресурс,
		|	МатРесурсы.Контрагент КАК Контрагент,
		|	МатРесурсы.Договор КАК Договор,
		|	МатРесурсы.ЕдиницаИзмерения КАК ЕдиницаНормирования,
		|	МатРесурсы.СпособПривязки КАК СпособПривязкиПотребности,
		|	МатРесурсы.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
		|	МатРесурсы.Цена КАК Стоимость,
		|	МатРесурсы.Валюта КАК Валюта,
		|	МатРесурсы.Количество КАК Количество,
		|	МатРесурсы.СуммаВалютная КАК ОбщСтоимость,
		|	МатРесурсы.ВидОперации КАК ВидОперации,
		|	МатРесурсы.СтатьяЗатрат КАК СтатьяЗатрат,
		|	МатРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
		|	МатРесурсы.СпособПривязкиРасхода КАК СпособПривязки,
		|	МатРесурсы.ДатаПривязки КАК ДатаПривязки,
		|	МатРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	МатРесурсы.ДатаЗаказа КАК ДатаЗаказа
		|ИЗ
		|	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &Ссылка
		|				И Версия = &текВерсия) КАК МатРесурсы
		|ГДЕ
		|	(МатРесурсы.Сумма <> 0
		|			ИЛИ МатРесурсы.Количество <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатРесурсы.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПланОбъемовПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ПланОбъемовПодразделения.Подразделение КАК Подразделение,
		|	ВТ_ПланОбъемовПодразделения.Роль КАК Роль,
		|	ВТ_ПланОбъемовПодразделения.СпособПривязки КАК СпособПривязки,
		|	ВТ_ПланОбъемовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ВТ_ПланОбъемовПодразделения.ДатаНачисления КАК ДатаПривязки,
		|	ВТ_ПланОбъемовПодразделения.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	ВТ_ПланОбъемовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ВТ_ПланОбъемовПодразделения.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	ВТ_ПланОбъемовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ВТ_ПланОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	ВТ_ПланОбъемовПодразделения.СуммаВалютная КАК Сумма,
		|	ВТ_ПланОбъемовПодразделения.Количество КАК Количество
		|ИЗ
		|	ВТ_ПланОбъемовПодразделения КАК ВТ_ПланОбъемовПодразделения
		|ГДЕ
		|	ВТ_ПланОбъемовПодразделения.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_ПланОбъемовПодразделения.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Затраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Затраты.Ресурс КАК Ресурс,
		|	Затраты.Количество КАК Количество,
		|	Затраты.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|	Затраты.Стоимость КАК Стоимость,
		|	Затраты.ОбщСтоимость КАК ОбщСтоимость,
		|	Затраты.ПрофильРаспределения КАК ПрофильРаспределения,
		|	Затраты.Основной КАК Основной,
		|	Затраты.ВнешняяСтоимость КАК ВнешняяСтоимость,
		|	Затраты.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
		|	Затраты.Подразделение КАК Подразделение,
		|	Затраты.СпособПривязки КАК СпособПривязки,
		|	Затраты.УровеньПланирования КАК УровеньПланирования,
		|	Затраты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияПоПериодам,
		|	ВЫБОР
		|		КОГДА Затраты.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты)
		|		ИНАЧЕ ЕСТЬNULL(Затраты.ИсточникПлана, ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты))
		|	КОНЕЦ КАК ИсточникПлана
		|ИЗ
		|	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &Ссылка
		|				И Версия = &текВерсия
		|				И ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы)) КАК Затраты
		|ГДЕ
		|	(Затраты.Количество <> 0
		|			ИЛИ Затраты.ОбщСтоимость <> 0
		|			ИЛИ Затраты.ОбщВнешняяСтоимость <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Затраты.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ПериодРаспределения КАК Период,
		|	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.СрезПоследних(
		|			,
		|			ПроектнаяЗадача = &Ссылка
		|				И Версия = &текВерсия) КАК упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам
		|ГДЕ
		|	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Количество <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеЗатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ДополнительныеЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ДополнительныеЗатраты.ВидОперации КАК ВидОперации,
		|	ДополнительныеЗатраты.Комментарий КАК Комментарий,
		|	ДополнительныеЗатраты.КонтрагентДоходовРасходов КАК КонтрагентДоходовРасходов,
		|	ДополнительныеЗатраты.ДоговорДоходовРасходов КАК ДоговорДоходовРасходов,
		|	ДополнительныеЗатраты.СпособПривязкиДоходовРасходов КАК СпособПривязкиДоходовРасходов,
		|	ДополнительныеЗатраты.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределенияДоходовРасходов,
		|	ДополнительныеЗатраты.ДатаПривязкиДоходовРасходов КАК ДатаПривязкиДоходовРасходов,
		|	ДополнительныеЗатраты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	ДополнительныеЗатраты.Сумма КАК Стоимость
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДополнительныхЗатрат.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка) КАК ДополнительныеЗатраты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДополнительныеЗатраты.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Роль КАК Роль,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязки,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.Сумма КАК Сумма,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДополнительныхЗатратПодразделения.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка) КАК упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	упоДанныеПлановДополнительныхЗатратПодразделенияСрезПоследних.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоходыРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ДоходыРасходы.Статья КАК Статья,
		|	ДоходыРасходы.ВидЭлемента КАК ВидЭлемента,
		|	ДоходыРасходы.Контрагент КАК Контрагент,
		|	ДоходыРасходы.Договор КАК Договор,
		|	ДоходыРасходы.СпособПривязки КАК СпособПривязки,
		|	ДоходыРасходы.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ДоходыРасходы.ДатаПривязки КАК ДатаПривязки,
		|	ДоходыРасходы.Валюта КАК Валюта,
		|	ДоходыРасходы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	ДоходыРасходы.СуммаВалютная КАК Сумма
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка
		|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)
		|				И НЕ ЭтоСубпродуктИлиПотребность) КАК ДоходыРасходы
		|ГДЕ
		|	(ДоходыРасходы.Сумма <> 0
		|			ИЛИ ДоходыРасходы.СуммаВалютная <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоходыРасходы.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязки,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная КАК Сумма,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество КАК Количество,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана
		|ПОМЕСТИТЬ ВТ_ПланДоходовПодразделения
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка
		|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход)) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
		|ГДЕ
		|	(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0
		|			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
		|			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПланДоходовПодразделения.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ПланДоходовПодразделения.ВидЭлемента КАК ВидЭлемента,
		|	ВТ_ПланДоходовПодразделения.Подразделение КАК Подразделение,
		|	ВТ_ПланДоходовПодразделения.Роль КАК Роль,
		|	ВТ_ПланДоходовПодразделения.ДатаПривязки КАК ДатаПривязки,
		|	ВТ_ПланДоходовПодразделения.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
		|	ВТ_ПланДоходовПодразделения.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|	ВТ_ПланДоходовПодразделения.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
		|	ВТ_ПланДоходовПодразделения.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
		|	ВТ_ПланДоходовПодразделения.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|	ВТ_ПланДоходовПодразделения.Сумма КАК Сумма,
		|	ВТ_ПланДоходовПодразделения.Количество КАК Количество,
		|	ВТ_ПланДоходовПодразделения.СпособПривязки КАК СпособПривязки,
		|	ВТ_ПланДоходовПодразделения.ПрофильРаспределения КАК ПрофильРаспределения,
		|	ВТ_ПланДоходовПодразделения.ИсточникПлана КАК ИсточникПлана
		|ИЗ
		|	ВТ_ПланДоходовПодразделения КАК ВТ_ПланДоходовПодразделения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
		|	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
		|	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Сумма КАК Сумма,
		|	упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ВТ_ПланОбъемовПодразделения.ПроектнаяЗадача ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ВТ_ПланДоходовПодразделения.ИсточникПлана, ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Объемы)
		|	КОНЕЦ КАК ИсточникПлана
		|ИЗ
		|	РегистрСведений.упоДанныеРаспределенияДоходовПоПериодам.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка) КАК упоДанныеРаспределенияДоходовПоПериодамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланДоходовПодразделения КАК ВТ_ПланДоходовПодразделения
		|		ПО упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияДоходов = ВТ_ПланДоходовПодразделения.ИндексСтрокРаспределенияПоПериодам
		|			И (ВТ_ПланДоходовПодразделения.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланОбъемовПодразделения КАК ВТ_ПланОбъемовПодразделения
		|		ПО упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям = ВТ_ПланОбъемовПодразделения.ИндексСтрокРаспределенияПоПериодам
		|			И (ВТ_ПланОбъемовПодразделения.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход))
		|			И (ВТ_ПланОбъемовПодразделения.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.Вручную))
		|ГДЕ
		|	(упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Сумма <> 0
		|			ИЛИ упоДанныеРаспределенияДоходовПоПериодамСрезПоследних.Количество <> 0)";
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстДДС);
	ТекстыЗапросов.Добавить(ТекстСубпродукты);
	ТекстыЗапросов.Добавить(ТекстОстальное);
	
	Возврат СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов())
	
КонецФункции // ()

Функция ТекстЗапросаПланРасходов()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоходыРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ДоходыРасходы.Статья КАК Статья,
	|	ДоходыРасходы.ВидЭлемента КАК ВидЭлемента,
	|	ДоходыРасходы.Контрагент КАК Контрагент,
	|	ДоходыРасходы.Договор КАК Договор,
	|	ДоходыРасходы.СпособПривязки КАК СпособПривязки,
	|	ДоходыРасходы.ПрофильРаспределения КАК ПрофильРаспределения,
	|	ДоходыРасходы.ДатаПривязки КАК ДатаПривязки,
	|	ДоходыРасходы.ПериодАгрегации КАК ПериодАгрегации,
	|	ДоходыРасходы.ИсточникПлана КАК ИсточникПлана,
	|	ДоходыРасходы.Валюта КАК Валюта,
	|	ДоходыРасходы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	|	ДоходыРасходы.СуммаВалютная КАК Сумма
	|ИЗ
	|	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
	|			,
	|			Версия = &текВерсия
	|				И ПроектнаяЗадача = &Ссылка
	|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
	|				И НЕ ЭтоСубпродуктИлиПотребность) КАК ДоходыРасходы
	|ГДЕ
	|	(ДоходыРасходы.Сумма <> 0
	|			ИЛИ ДоходыРасходы.СуммаВалютная <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоходыРасходы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаПривязки,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная КАК Сумма,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки) = ТИП(Перечисление.упоСпособПривязкиДоходаРасхода)
	|			ТОГДА ВЫБОР
	|					КОГДА упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения)
	|					КОГДА упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.НаДату)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиРаспределения.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки
	|	КОНЕЦ КАК СпособПривязки,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана
	|ИЗ
	|	РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
	|			,
	|			Версия = &текВерсия
	|				И ПроектнаяЗадача = &Ссылка
	|				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
	|ГДЕ
	|	(упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Сумма <> 0
	|			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная <> 0
	|			ИЛИ упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Количество <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
	|	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	|	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	|	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	|	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма КАК Сумма,
	|	упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.упоДанныеРаспределенияРасходовПоПериодам.СрезПоследних(
	|			,
	|			ПроектнаяЗадача = &Ссылка
	|				И Версия = &текВерсия) КАК упоДанныеРаспределенияРасходовПоПериодамСрезПоследних
	|ГДЕ
	|	(упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Сумма <> 0
	|			ИЛИ упоДанныеРаспределенияРасходовПоПериодамСрезПоследних.Количество <> 0)";
	
КонецФункции

Функция ТекстЗапросаДанныеВерсии()
	
	ТекстыЗапроса = Новый Массив;
	
	ТекстЗапроса = упоПроектыИЗадачиСервер.ТекстЗапросаВременнаяТаблицаПрогнозныеСроки();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаСвойстваПЗ();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаДанныеТабличныхЧастей();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = ТекстЗапросаПланРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		ТекстЗапроса = ТекстЗапросаПричиныОтклонений();
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Возврат СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

Функция ТекстЗапросаПредусловия()
	
	Возврат "ВЫБРАТЬ
	|	предУсловия.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	предУсловия.ЗадачаПредшественник КАК ЗадачаПредшественник,
	|	предУсловия.НомерСтроки КАК НомерСтроки,
	|	предУсловия.СвязьСуществует КАК СвязьСуществует,
	|	предУсловия.СвязьМеждуПроектами КАК СвязьМеждуПроектами,
	|	предУсловия.ТипСвязи КАК ТипСвязи,
	|	предУсловия.Задержка КАК ЗадержкаВЧасах,
	|	предУсловия.ЗадержкаВЕдиницеИзмерения КАК Задержка,
	|	предУсловия.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
	|	Проекты.КодСДР КАК КодСДР
	|ПОМЕСТИТЬ ВТ_Предусловия
	|ИЗ
	|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(
	|			,
	|			Версия = &текВерсия
	|				И ПроектнаяЗадача = &Ссылка) КАК предУсловия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО предУсловия.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	|ГДЕ
	|	предУсловия.СвязьСуществует
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упоВерсииПроекта.Проект КАК Проект,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадачаПредшественник
	|ПОМЕСТИТЬ ВТ_СвойстваПредшественников
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|				,
	|				ПроектнаяЗадача В
	|					(ВЫБРАТЬ
	|						Т.ЗадачаПредшественник
	|					ИЗ
	|						ВТ_Предусловия КАК Т)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ПО упоВерсииПроекта.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	|			И (упоВерсииПроекта.Текущая)
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Предусловия.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ_Предусловия.ЗадачаПредшественник КАК ЗадачаПредшественник,
	|	ВТ_Предусловия.СвязьСуществует КАК СвязьСуществует,
	|	ВТ_Предусловия.СвязьМеждуПроектами КАК СвязьМеждуПроектами,
	|	ВТ_Предусловия.ТипСвязи КАК ТипСвязи,
	|	ВТ_Предусловия.ЗадержкаВЧасах КАК ЗадержкаВЧасах,
	|	ВТ_Предусловия.Задержка КАК Задержка,
	|	ВТ_Предусловия.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
	|	ВТ_Предусловия.КодСДР КАК КодСДР,
	|	ВТ_СвойстваПредшественников.Проект КАК Проект,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_СвойстваПредшественников.Проект) КАК ПроектПредставление,
	|	ВТ_СвойстваПредшественников.НазваниеЗадачи КАК НазваниеЗадачаПредшественник
	|ИЗ
	|	ВТ_Предусловия КАК ВТ_Предусловия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвойстваПредшественников КАК ВТ_СвойстваПредшественников
	|		ПО ВТ_Предусловия.ЗадачаПредшественник = ВТ_СвойстваПредшественников.ПроектнаяЗадачаПредшественник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Предусловия.НомерСтроки"
	
КонецФункции

Функция ТекстЗапросаПричиныОтклонений()
	
	ТекстЗапросаПричинОтклонения = "ВЫБРАТЬ
		|	упоПричиныОтклоненийСрезПоследних.Версия КАК Версия,
		|	упоПричиныОтклоненийСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоПричиныОтклоненийСрезПоследних.Пользователь КАК Пользователь,
		|	упоПричиныОтклоненийСрезПоследних.Сотрудник КАК Сотрудник,
		|	упоПричиныОтклоненийСрезПоследних.АвторИзменений КАК АвторИзменений,
		|	упоПричиныОтклоненийСрезПоследних.ДатаИзменений КАК ДатаИзменений,
		|	упоПричиныОтклоненийСрезПоследних.Комментарий КАК Комментарий,
		|	упоПричиныОтклоненийСрезПоследних.Причина КАК Причина,
		|	упоПричиныОтклоненийСрезПоследних.Отмена КАК Отмена
		|ИЗ
		|	РегистрСведений.упоПричиныОтклонений.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И ПроектнаяЗадача = &Ссылка) КАК упоПричиныОтклоненийСрезПоследних
		|ГДЕ
		|	НЕ упоПричиныОтклоненийСрезПоследних.Отмена";
	
	Возврат ТекстЗапросаПричинОтклонения;
	
КонецФункции //

#КонецОбласти

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Справочник.Проекты.ФормаВыбора";
		Параметры.Вставить("РежимВыбора", Истина);
		Параметры.Вставить("ЭтоФормаВыбораПроектнойЗадачи", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаТрудовыхРесурсовПоУровням(ИсходнаяТаблицаТрудовыхРесурсов, УровеньПланирования, КолонкаСтоимости)
	
	ТаблицаТрудовыхРесурсовПоУровням =
		упоРаспределениеТрудозатратВызовСервера.ТаблицаТрудовыхРесурсовПоУровням(ИсходнаяТаблицаТрудовыхРесурсов,
			КолонкаСтоимости, УровеньПланирования);
	
	Возврат ТаблицаТрудовыхРесурсовПоУровням;
	
КонецФункции

Функция ТаблицаПлановРесурсов(Объект, УровеньПланирования, ТолькоМатРесурсы)
	
	ТаблицаПлановРесурсов = СтруктураТаблицыПлановРесурсов();
		
	Если Не ТолькоМатРесурсы Тогда
	
		ТаблицаТрудовыхРесурсовПоУровням =
			упоРаспределениеТрудозатратВызовСервера.ТаблицаТрудовыхРесурсовПоУровням(Объект.ТрудовыеРесурсы.Выгрузить(),
				"ОбщВнешняяСтоимость", УровеньПланирования);
		
		Если ТаблицаТрудовыхРесурсовПоУровням.Количество() Тогда
			ЗаполнитьТаблицуПлановРесурсов("ОбщВнешняяСтоимость", ТаблицаТрудовыхРесурсовПоУровням, ТаблицаПлановРесурсов);
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаМатериальныхРесурсов = ТаблицаМатериальныхРесурсов(Объект.РаспределениеПотребностей.Выгрузить());
	
	Если ТаблицаМатериальныхРесурсов.Количество() Тогда
		ЗаполнитьТаблицуПлановРесурсов("ОбщСтоимость", ТаблицаМатериальныхРесурсов, ТаблицаПлановРесурсов);
	КонецЕсли;
	
	Возврат ТаблицаПлановРесурсов;
	
КонецФункции

Процедура ЗаполнитьТаблицуПлановРесурсов(ИмяКолонкиСтоимость, ТаблицаИсточник, ТаблицаПриемник)
	
	Для каждого РесурсИсточник Из ТаблицаИсточник Цикл
		СтрокаРесурс = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРесурс, РесурсИсточник);
		СтрокаРесурс.Стоимость = РесурсИсточник[ИмяКолонкиСтоимость];
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаМатериальныхРесурсов(ИсходнаяТаблицаМатериальныхРесурсов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|   ИсходнаяТаблицаМатериальныхРесурсов.Роль КАК Роль,
		|   ИсходнаяТаблицаМатериальныхРесурсов.Подразделение КАК Подразделение,
		|   ИсходнаяТаблицаМатериальныхРесурсов.Количество КАК Количество,
		|   ИсходнаяТаблицаМатериальныхРесурсов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   ИсходнаяТаблицаМатериальныхРесурсов.Сумма КАК ОбщСтоимость
		|ПОМЕСТИТЬ ВТ_МатериальныеРесурсы
		|ИЗ
		|   &ИсходнаяТаблицаМатериальныхРесурсов КАК ИсходнаяТаблицаМатериальныхРесурсов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВТ_МатериальныеРесурсы.Роль КАК Ресурс,
		|   ВТ_МатериальныеРесурсы.Подразделение КАК Подразделение,
		|   ВТ_МатериальныеРесурсы.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
		|   СУММА(ВТ_МатериальныеРесурсы.Количество) КАК Количество,
		|   СУММА(ВТ_МатериальныеРесурсы.ОбщСтоимость) КАК ОбщСтоимость
		|ИЗ
		|   ВТ_МатериальныеРесурсы КАК ВТ_МатериальныеРесурсы
		|
		|СГРУППИРОВАТЬ ПО
		|   ВТ_МатериальныеРесурсы.Подразделение,
		|   ВТ_МатериальныеРесурсы.Роль,
		|   ВТ_МатериальныеРесурсы.СобствСилы_Субподряд";
	
	Запрос.УстановитьПараметр("ИсходнаяТаблицаМатериальныхРесурсов", ИсходнаяТаблицаМатериальныхРесурсов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция СтруктураТаблицыПлановРесурсов()
	
	СтруктураТаблицыПлановРесурсов = Новый ТаблицаЗначений;
	СтруктураТаблицыПлановРесурсов.Колонки.Добавить("Количество",
		Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 5)));
	СтруктураТаблицыПлановРесурсов.Колонки.Добавить("Стоимость",
		Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	СтруктураТаблицыПлановРесурсов.Колонки.Добавить("СобствСилы_Субподряд",
		Новый ОписаниеТипов("СправочникСсылка.упоСобственныеСилыСубподряд"));
	СтруктураТаблицыПлановРесурсов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	СтруктураТаблицыПлановРесурсов.Колонки.Добавить("Ресурс", Новый ОписаниеТипов("СправочникСсылка.упоРоли"));
	
	Возврат СтруктураТаблицыПлановРесурсов;
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьПоДаннымЗапроса(РезультатЗапроса, Объект, ИмяТабличнойЧасти)
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Объект[ИмяТабличнойЧасти].Очистить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Объект[ИмяТабличнойЧасти].Добавить(), Выборка);
		КонецЦикла;
	ИначеЕсли Объект.Проведен Тогда
		Объект[ИмяТабличнойЧасти].Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьДанныеРаспределения(Объект, ИндексСтрокРаспределения, ИмяКолонкиРаспределения, ИмяТЧ)

    ОтборОчистка = Новый Структура(ИмяКолонкиРаспределения, 
        ИндексСтрокРаспределения);
    СтрокиКУдалению = Объект[ИмяТЧ].НайтиСтроки(ОтборОчистка);

    Если СтрокиКУдалению.Количество() Тогда
        Для каждого Строка Из СтрокиКУдалению Цикл
            Объект[ИмяТЧ].Удалить(Строка);	
        КонецЦикла;    	
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли