
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мДанные Экспорт; // Хранит актуальные данные проектной задачи, извлеченные из регистра сведений.
Перем мВалютаУправленческогоУчета Экспорт; // Хранит ссылку на валюту управленческого учета.

Перем мТаблицаКалендаря Экспорт; 		// Для КЭШа обРассчитатьЗадержкуПоКалендарю.
Перем мТаблицаКалендаряПолные Экспорт;	// Для КЭШа обРассчитатьЗадержкуПоКалендарю.

Перем текущаяВерсия;
Перем СвойстваПроекта; 

// Хранит общий модуль для работы с проектной продукцией, если такой функционал присутствует в системе.
Перем МодульупоПроектнаяПродукция; 

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Устанавливает данные текущей версии.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма, Форма - форма, для которой будет установлен признак модифицированности в случае 
//				успешной установки данных текущей версии в объект.
//
Процедура ПолучитьДанныеВерсии(ЭтаФорма) Экспорт
		
	Документы.упоПроектнаяЗадача.ПолучитьДанныеВерсии(ЭтаФорма, ЭтотОбъект, ЭтотОбъект.ДополнительныеСвойства);	
	
КонецПроцедуры

// Возвращает список трудовых ресурсов, которые были назначены
// на выполнение работ по задаче типа "модель пакета работ".
//
// Возвращаемое значение:
//  ТаблицаЗначений - сформированный список исполнителей.
//
Функция ПолучитьСписокИсполнителей() Экспорт

	Возврат Документы.упоПроектнаяЗадача.ПолучитьСписокИсполнителей(Ссылка);
	
КонецФункции
 
// Процедура получает все необходимые данные документа.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными задачи.
//
Функция ПолучитьДанные() Экспорт
	
	Возврат Документы.упоПроектнаяЗадача.ПолучитьДанные(Ссылка);
	 
КонецФункции

// Вызывает метод Документы.упоПроектнаяЗадача.ПолучитьРасчетныеСроки для экземпляра объекта.
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьРасчетныеСроки() Экспорт

	Возврат Документы.упоПроектнаяЗадача.ПолучитьРасчетныеСроки(Ссылка);
	
КонецФункции

// Устанавливает значение устаревших реквизитов
// (требуются для совместимости с функционалом редакции 1)
// по значению реквизита ТипПроектнойЗадачи.
//
Процедура ЗаписатьТипЗадачи() Экспорт
	
	упоПроектыИЗадачиОбщие.ЗаписатьТипЗадачи(ЭтотОбъект);
	
КонецПроцедуры

// Устанавливает значение реквизита ТипПроектнойЗадачи
// по значению устаревших реквизитов
// (требуются для совместимости с функционалом редакции 1).
//
Процедура УстановитьТипЗадачи() Экспорт

	упоПроектыИЗадачиОбщие.УстановитьТипЗадачи(ЭтотОбъект);

КонецПроцедуры

// Возвращает актуальные на текущий момент времени сроки проектной
//  задачи (без учета реквизита "Ручной ввод сроков"), данные в
//  любом случае берутся из регистра сведений.
// 
// Возвращаемое значение:
//  Структура - сроки проектной задачи, свойства: "ДатаНачала" и "ДатаЗавершения".
//
Функция ПолучитьСроки() Экспорт
	
	Если текущаяВерсия = Неопределено Тогда
		текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ДатаНачалаПлан КАК ДатаНачала,
		|	Рег.ДатаЗавершенияПлан КАК ДатаЗавершения
		|ИЗ
		|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И ПроектнаяЗадача = &Ссылка) КАК Рег";
	
	Запрос.УстановитьПараметр("ТекущаяВерсия", текущаяВерсия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СтрокаЗапроса = РезультатЗапроса.Выгрузить()[0];
	Результат = Новый Структура();
	Результат.Вставить("ДатаНачала", СтрокаЗапроса.ДатаНачала);
	Результат.Вставить("ДатаЗавершения", СтрокаЗапроса.ДатаЗавершения);
	
	Возврат Результат;

КонецФункции

// Получает строку с данными основного результат субпродуктов.
//
// Возвращаемое значение:
//	Неопределено, ДанныеФормыЭлементКоллекции - данные строки табличной части.
//
Функция ПолучитьСтрокуОсновногоРезультатСубпродуктов() Экспорт
	
	строкаОсновногоРезультата = Неопределено;
	Для каждого строкаТЧ Из Субпродукты Цикл
	    Если строкаТЧ.Основной Тогда
			строкаОсновногоРезультата = строкаТЧ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат строкаОсновногоРезультата;
	
КонецФункции

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	ЭтоEPM = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();
		
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки.
		СтруктураОбязательныхПолей.Вставить("ТипПроектнойЗадачи");
		
		Если ДополнительныеЗатраты.Количество() > 0 Тогда      
			СтруктураОбязательныхПолей.Вставить("СпособПривязкиДопЗатрат");
		КонецЕсли; 
		
		Если ЭтоМодельПакетаРабот Тогда
			СтруктураОбязательныхПолей.Вставить("ДлительностьМоделиПакетаРабот");	
			СтруктураОбязательныхПолей.Вставить("ЕдиницаНормированияДлительности");
		КонецЕсли; 
		
		// При ручном вводе сроков необходимо заполнить даты начала и завершения.
		Если РучнойВводСроков = Истина Тогда
			Если Не ЭтоВеха Тогда
				СтруктураОбязательныхПолей.Вставить("ДатаНачалаПлан");
			КонецЕсли;
			СтруктураОбязательныхПолей.Вставить("ДатаЗавершенияПлан");
		КонецЕсли;
	ИначеЕсли ИмяТабличнойЧасти = "ПредусловияЗадачи" Тогда
		СтруктураОбязательныхПолей.Вставить("ЗадачаПредшественник");
	ИначеЕсли ИмяТабличнойЧасти = "МатериальныеРесурсы" И СвойстваПроекта.ПланироватьЗатратыНаМатериалы Тогда
		СтруктураОбязательныхПолей.Вставить("Ресурс");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		СтруктураОбязательныхПолей.Вставить("Количество");
		СтруктураОбязательныхПолей.Вставить("ЕдиницаНормирования");
		Если ВключитьМатРесурсыВПланРасходов Тогда
			СтруктураОбязательныхПолей.Вставить("СпособПривязки");
			СтруктураОбязательныхПолей.Вставить("СтатьяЗатрат");
			СтруктураОбязательныхПолей.Вставить("Стоимость");
		КонецЕсли;
		Если ЭтоEPM Тогда
			СтруктураОбязательныхПолей.Вставить("СпособПривязкиПотребности");
		КонецЕсли;	
	ИначеЕсли ИмяТабличнойЧасти = "ДополнительныеЗатраты" И СвойстваПроекта.ПланироватьДополнительныеЗатратыПоЗадаче Тогда
		СтруктураОбязательныхПолей.Вставить("СтатьяЗатрат");
		СтруктураОбязательныхПолей.Вставить("Стоимость");
		Если ВключитьДопЗатратыВПланРасходов Тогда
			СтруктураОбязательныхПолей.Вставить("СпособПривязкиДоходовРасходов");
		КонецЕсли;
	ИначеЕсли ИмяТабличнойЧасти = "ДвиженияДенежныхСредств" Тогда
		СтруктураОбязательныхПолей.Вставить("СтатьяДДС");
		СтруктураОбязательныхПолей.Вставить("НаправлениеДвижения");
		СтруктураОбязательныхПолей.Вставить("СпособПривязки");
		СтруктураОбязательныхПолей.Вставить("Сумма");
		СтруктураОбязательныхПолей.Вставить("Валюта");
	ИначеЕсли ИмяТабличнойЧасти = "ПланДоходов" Тогда
		СтруктураОбязательныхПолей.Вставить("Статья");
		СтруктураОбязательныхПолей.Вставить("Сумма");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		СтруктураОбязательныхПолей.Вставить("СпособПривязки");
	ИначеЕсли ИмяТабличнойЧасти = "ПланРасходов" Тогда
		СтруктураОбязательныхПолей.Вставить("Статья");
		СтруктураОбязательныхПолей.Вставить("СпособПривязки");
		СтруктураОбязательныхПолей.Вставить("Сумма");
		СтруктураОбязательныхПолей.Вставить("Валюта");
	ИначеЕсли ИмяТабличнойЧасти = "Субпродукты" И СвойстваПроекта.ДоходыПоНатуральнымПоказателям Тогда
		СтруктураОбязательныхПолей.Вставить("Ресурс");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		СтруктураОбязательныхПолей.Вставить("Количество");
		СтруктураОбязательныхПолей.Вставить("ЕдиницаНормирования");
		Если ВключитьСубпродуктыВПланДоходов Тогда
			СтруктураОбязательныхПолей.Вставить("СтатьяДоходов");
			СтруктураОбязательныхПолей.Вставить("СпособПривязки");
		КонецЕсли;
		Если ЭтоEPM Тогда
			СтруктураОбязательныхПолей.Вставить("СпособПривязкиВыпуска");
		КонецЕсли;
	ИначеЕсли ИмяТабличнойЧасти = "ТрудовыеРесурсы" Тогда
		СтруктураОбязательныхПолей.Вставить("Ресурс");		
		СтруктураОбязательныхПолей.Вставить("Количество");
		СтруктураОбязательныхПолей.Вставить("ЕдиницаНормирования");
		СтруктураОбязательныхПолей.Вставить("ПрофильРаспределения");
	ИначеЕсли ИмяТабличнойЧасти = "РаспределениеОбъемов" Тогда
		Если ТранслироватьОбъемыВТрудозатраты() Тогда
			ПараметрыПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ЭтотОбъект.Проект);
			Если ПараметрыПроекта.УказыватьПодразделениеРолиПриПланированииТР Тогда
				СтруктураОбязательныхПолей.Вставить("Подразделение");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
//  Заголовок    - Строка - содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
	упоРаботаСФормамиКлиентСервер.ПроверитьЗаполнениеДатыПривязки(ЭтотОбъект, Отказ, Заголовок, Истина);

КонецПроцедуры

// Не используется. Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры: 
//  ДанныеДокумента - Структура - содержит слепок документа.
//  Отказ           - Булево	- признак отказа от выполнения операции.
//  Заголовок       - Строка	- содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоСозданиеИзСтруктуры() Тогда
		Возврат;
	КонецЕсли;
	
	лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок);
	
	Если Не ОтключитьПроверкуЦикличности(ЭтотОбъект) Тогда
		упоПроектыИЗадачиВызовСервера.обПроверитьПравильностьПредУсловийПроектнойЗадачи(ДанныеДокумента, Отказ, Заголовок);
		упоПроектыИЗадачиВызовСервера.обПроверитьЗацикливаниеСтруктурыПроектаПослеИзмененийВПроектнойЗадаче(ДанныеДокумента, Отказ, Заголовок);
	КонецЕсли;

	Если Не упоРазграничениеДоступаВызовСервера.РазграничениеДоступаОтключеноДляОбъекта(ЭтотОбъект) Тогда
		упоПроектыИЗадачиВызовСервера.обПроверитьПолномочияПользователяПроектнойЗадачи(ДанныеДокумента, Отказ, Заголовок);
		упоПроектыИЗадачиВызовСервера.обПроверитьДопустимостьПроектнойЗадачи(ЭтотОбъект, Отказ, Заголовок);
	КонецЕсли;
	
	// Проверим, возможен ли расчет актуальных данных по ДДС и БДР.
	// Если нет, оповестим пользователя, что движения по соответствующим регистрам не будут сделаны.
	
	ПроверитьВозможностьАктуализацииФинансовыхПлановПроекта(ДанныеДокумента);
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//	Структура - каждая пара ключ и значение соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа
//  на измерения, ресурсы и реквизиты регистров
//  Правила передаются в виде иерархическая структуры.
//  Структура описывает, КУДА положить ЧТО.
//
// Параметры:
//  ДанныеДокумента	 - ДанныеФормыСтруктура	 - содержит слепок документа.
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар ИмяРеквизитаДокумента:ИмяРеквизитаРегистра.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	УпрощенноеСоздание = ЭтоСозданиеИзСтруктуры();
	
	//
	
	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать,
	// для одной таблицы может быть сформировано произвольное число движений
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_" .
	
	// Базовый регистр. На основании него получать актуальность задачи и ее параметров.
	// Правила для регистра "упоСвойстваПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСвойстваПроектныхЗадач.Метаданные().Имя, Правила);
	
	Если Не УпрощенноеСоздание Тогда
		
		// Правила для шапки документа.
		ПравилаТаблицы = Новый Структура();	
		Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
		
		// Делаем одно движение по шапке.
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ОпределениеСвойствЗадачи", ПравилаДвижения);
		
		ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
		ПравилаДвижения.Вставить("ПроектнаяЗадача", "ПроектнаяЗадача");
		ПравилаДвижения.Вставить("НазваниеЗадачи", "НазваниеПроектнойЗадачи");
		ПравилаДвижения.Вставить("ЗадачаРодитель", "ЗадачаРодитель");
		ПравилаДвижения.Вставить("ЭтоПакетРабот", "ЭтоПакетРабот");
		ПравилаДвижения.Вставить("ЭтоМодельПакетаРабот", "ЭтоМодельПакетаРабот");
		ПравилаДвижения.Вставить("ЭтоВеха", "ЭтоВеха");
		ПравилаДвижения.Вставить("Длительность", "ДлительностьМоделиПакетаРаботВЧасах");
		ПравилаДвижения.Вставить("КрайнийСрок", "КрайнийСрок");
		ПравилаДвижения.Вставить("СпособПривязкиДопЗатрат", "СпособПривязкиДопЗатрат");
		ПравилаДвижения.Вставить("ПланироватьТрудозатратыНаИсполнителей", "ПланироватьТрудозатратыНаИсполнителей");
		ПравилаДвижения.Вставить("ВидОперации", "ВидОперации");
		ПравилаДвижения.Вставить("ДлительностьМоделиПакетаРабот", "ДлительностьМоделиПакетаРабот");
		Если ДанныеДокумента.ЭтоВеха Тогда
			ПравилаДвижения.Вставить("ЕдиницаНормированияДлительности", Новый Структура("Значение", Справочники.упоЕдиницыВремени.ПустаяСсылка()));		
		Иначе
			ПравилаДвижения.Вставить("ЕдиницаНормированияДлительности", "ЕдиницаНормированияДлительности");
		КонецЕсли;
		ПравилаДвижения.Вставить("НормаСтоимостиТрудовыхРесурсов", "НормаСтоимостиТрудовыхРесурсов");
		ПравилаДвижения.Вставить("НормаСтоимостиОбъемы", "НормаСтоимостиОбъемы");
		ПравилаДвижения.Вставить("ДлительностьБезУчетаКалендаряПроекта", "ДлительностьБезУчетаКалендаряПроекта");
		ПравилаДвижения.Вставить("ВключитьСубпродуктыВПланДоходов", "ВключитьСубпродуктыВПланДоходов");
		ПравилаДвижения.Вставить("ВключитьМатРесурсыВПланРасходов", "ВключитьМатРесурсыВПланРасходов");
		ПравилаДвижения.Вставить("ВключитьТрудРесурсыВПланРасходов", "ВключитьТрудРесурсыВПланРасходов");
		ПравилаДвижения.Вставить("ВключитьДопЗатратыВПланРасходов", "ВключитьДопЗатратыВПланРасходов");		
		ПравилаДвижения.Вставить("УдалитьДлительностьПоОсвоенномуОбъему", "УдалитьДлительностьПоОсвоенномуОбъему");
		ПравилаДвижения.Вставить("РучнойВводСроков", "РучнойВводСроков");
		ПравилаДвижения.Вставить("КодПроектногоДокумента", "КодПроектногоДокумента");
		ПравилаДвижения.Вставить("НормаСтоимости", "НормаСтоимости");
		ПравилаДвижения.Вставить("Объект", "Объект");
		ПравилаДвижения.Вставить("СуммаСанкцийЗаДеньЗадержки", "СуммаСанкцийЗаДеньЗадержки");
		ПравилаДвижения.Вставить("КритерийРезультата", "КритерийРезультата");
		ПравилаДвижения.Вставить("ОписаниеЗадачи", "ОписаниеЗадачи");
		ПравилаДвижения.Вставить("ОписаниеРезультата", "ОписаниеРезультата");
		ПравилаДвижения.Вставить("ПодчиненныйПроект", "ПодчиненныйПроект");
		ПравилаДвижения.Вставить("ПодчиненнаяПроектнаяЗадача", "ПодчиненнаяПроектнаяЗадача");
		ПравилаДвижения.Вставить("КалендарьЗадачи", "КалендарьЗадачи");
		ПравилаДвижения.Вставить("УдалитьОписаниеРезультатаФакт", "УдалитьОписаниеРезультатаФакт");
		ПравилаДвижения.Вставить("УровеньПланированияТрудозатратДляБДР", "УровеньПланированияТрудозатратДляБДР");
		ПравилаДвижения.Вставить("ВключитьПланДоходовВБДДС", "ВключитьПланДоходовВБДДС");
		ПравилаДвижения.Вставить("ВключитьПланРасходовВБДДС", "ВключитьПланРасходовВБДДС");
		ПравилаДвижения.Вставить("СхемаОплатыПоУмолчаниюРасходы", "СхемаОплатыПоУмолчаниюРасходы");
		ПравилаДвижения.Вставить("СхемаОплатыПоУмолчаниюДоходы", "СхемаОплатыПоУмолчаниюДоходы");
		ПравилаДвижения.Вставить("ТранслироватьЗатратыПоСубпродуктам", "ТранслироватьЗатратыПоСубпродуктам");
		ПравилаДвижения.Вставить("ТипСубпродукта", "ТипСубпродукта");
		
		ПравилаДвижения.Вставить("ЭтоАктируемаяЗадача", "ЭтоАктируемаяЗадача");
		ПравилаДвижения.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", "ВнешняяНормаСтоимостиТрудовыхРесурсов");
		ПравилаДвижения.Вставить("ЗадачаОтменена", "ЗадачаОтменена");
		
		Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
			ПравилаДвижения.Вставить("НеВыводитьВСтатусОтчет", "НеВыводитьВСтатусОтчет");
			ПравилаДвижения.Вставить("ВыводитьВСводныйСтатусОтчет", "ВыводитьВСводныйСтатусОтчет");
		КонецЕсли; 
		
	КонецЕсли;
	
	// Правила для регистра "СтатусыПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСтатусыПроектныхЗадач.Метаданные().Имя, Правила);
	
	ПериодСтатусЗадачи = ПолучитьДатуРегистрацииПроекта();
	
	// Правила для шапки документа.
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	// Делаем одно движение по шапке.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеСтатусаЗадачи", ПравилаДвижения);
	
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "ПроектнаяЗадача");
	ПравилаДвижения.Вставить("СтатусЗадачи",
		Новый Структура("Значение", Перечисления.упоСостояниеСтатусаЗадачи.Запланирована));
	Если ЗначениеЗаполнено(ПериодСтатусЗадачи) Тогда
		ПравилаДвижения.Вставить("Период", Новый Структура("Значение", ПериодСтатусЗадачи));
	КонецЕсли;
	
	// Правила для регистра "СрокиПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСрокиПроектныхЗадач.Метаданные().Имя, Правила);
	
	Если Не УпрощенноеСоздание Тогда
		
		Если ДанныеДокумента.РучнойВводСроков ИЛИ НужноЗаписатьСрокиПринудительно() Тогда
			// Правила для шапки документа.
			ПравилаТаблицы = Новый Структура();	
			Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
			
			// Делаем одно движение по шапке.
			ПравилаДвижения = Новый Структура();
			ПравилаТаблицы.Вставить("ОпределениеСроковЗадачи", ПравилаДвижения);
			
			// Правила связи.
			ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
			ПравилаДвижения.Вставить("ПроектнаяЗадача"   , "ПроектнаяЗадача");
			Если ДанныеДокумента.ЭтоВеха Тогда
				ПравилаДвижения.Вставить("ДатаНачалаПлан"    , "ДатаЗавершенияПлан");
			Иначе
				ПравилаДвижения.Вставить("ДатаНачалаПлан"    , "ДатаНачалаПлан");
			КонецЕсли;
			ПравилаДвижения.Вставить("ДатаЗавершенияПлан", "ДатаЗавершенияПлан");
		КонецЕсли;
		
	КонецЕсли;
	
	// Правила для регистра "упоПрогнозныеСрокиПроектныхЗадач".
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда  
		
		Правила = Новый Структура();
		ПравилаНаложения.Вставить(Движения.упоПрогнозныеСрокиПроектныхЗадач.Метаданные().Имя, Правила);
		
		ПравилаТаблицы = Новый Структура();	
		Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
		
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ПрогнозныеСроки", ПравилаДвижения);
		
		ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
		ПравилаДвижения.Вставить("ПроектнаяЗадача"   , "ПроектнаяЗадача");
		ПравилаДвижения.Вставить("ДатаНачалаПрогноз"    , "ДатаНачалаПрогноз");
		ПравилаДвижения.Вставить("ДатаЗавершенияПрогноз", "ДатаЗавершенияПрогноз");		
		ПравилаДвижения.Вставить("СтатусСроков", "СтатусСроков");
		
	КонецЕсли;		
	
	// Правила для регистра "ПредусловияПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоПредусловияПроектныхЗадач.Метаданные().Имя, Правила);
	
	// Правила для табличной части "ПредусловияЗадачи" документа.
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ПредусловияЗадачи", ПравилаТаблицы);
	
	// Делаем одно движение по табличной часте.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеПредусловийЗадачи", ПравилаДвижения);
	
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача"     	, "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ЗадачаПредшественник"	, "ЗадачаПредшественник");
	ПравилаДвижения.Вставить("СвязьСуществует"     	, Новый Структура("Значение", Истина));
	ПравилаДвижения.Вставить("ТипСвязи"				, "ТипСвязи");
	ПравилаДвижения.Вставить("Задержка"				, "ЗадержкаВЧасах");
	ПравилаДвижения.Вставить("ЗадержкаВЕдиницеИзмерения", "Задержка");
	ПравилаДвижения.Вставить("ЕдиницаНормированияДлительности", "ЕдиницаНормированияДлительности");
	ПравилаДвижения.Вставить("СвязьМеждуПроектами", "СвязьМеждуПроектами");
			
	// Правила для регистра "КодыСДР".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоКодыСДР.Метаданные().Имя, Правила);
	
	// Регистр заполняется спец. процедурой.	
	
	// Правила для регистра "упоАктуальныеПланыЗатратМатериальныхРесурсов".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыЗатратМатериальныхРесурсов.Метаданные().Имя, Правила);	
	// Правила для табличной части "МатериальныеРесурсы" документа.
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("МатериальныеРесурсы", ПравилаТаблицы);		
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеЗатратМатРесурсов", ПравилаДвижения);		
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача"       , "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Ресурс"                , "Ресурс");
	ПравилаДвижения.Вставить("ВидОперации"           , "ВидОперации");
	ПравилаДвижения.Вставить("КоличествоЕдНормирования", "Количество");
	ПравилаДвижения.Вставить("ЕдиницаНормирования"   , "ЕдиницаНормирования");
	ПравилаДвижения.Вставить("Стоимость"             , "ОбщСтоимость");		
		
	// Правила для регистра "упоДанныеПлановДополнительныхЗатрат".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановДополнительныхЗатрат.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ДополнительныеЗатраты", ПравилаТаблицы);	
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("упоДанныеПлановДополнительныхЗатрат", ПравилаДвижения);		
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("СтатьяЗатрат", "СтатьяЗатрат");
	ПравилаДвижения.Вставить("ВидОперации", "ВидОперации");	
	ПравилаДвижения.Вставить("Сумма", "Стоимость");
	ПравилаДвижения.Вставить("Комментарий", "Комментарий");
	ПравилаДвижения.Вставить("КонтрагентДоходовРасходов", "КонтрагентДоходовРасходов");
	ПравилаДвижения.Вставить("ДоговорДоходовРасходов", "ДоговорДоходовРасходов");
	ПравилаДвижения.Вставить("СпособПривязкиДоходовРасходов", "СпособПривязкиДоходовРасходов");
	ПравилаДвижения.Вставить("ПрофильРаспределенияДоходовРасходов", "ПрофильРаспределенияДоходовРасходов");
	ПравилаДвижения.Вставить("ДатаПривязкиДоходовРасходов", "ДатаПривязкиДоходовРасходов");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределения", "ИндексСтрокРаспределения");	
	
	
	// Правила для регистра "упоДанныеПлановДополнительныхЗатратПодразделения".
		
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановДополнительныхЗатратПодразделения.Метаданные().Имя, Правила);	
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("РаспределениеДополнительныхЗатрат", ПравилаТаблицы);		                                      
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("упоДанныеПлановДополнительныхЗатратПодразделения", ПравилаДвижения);		
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("Роль", "Роль");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("Сумма", "Сумма");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаПривязки");
	ПравилаДвижения.Вставить("КонтрагентПодрядчик", "КонтрагентПодрядчик");
	ПравилаДвижения.Вставить("Заказ_ДоговорПодрядчика", "ЗаказДоговорПодрядчика");
	ПравилаДвижения.Вставить("СобствСилы_Субподряд", "СобствСилы_Субподряд");
	ПравилаДвижения.Вставить("ИндексСтрокиВладельца", "ИндексСтрокиВладельца");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределенияПоПериодам", "ИндексСтрокРаспределенияПоПериодам");	
	
	// Правила для регистра "упоАктуальныеПланыДополнительныхЗатрат".
		
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДополнительныхЗатрат.Метаданные().Имя, Правила);	
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ДополнительныеЗатраты", ПравилаТаблицы);		
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("упоАктуальныеПланыДополнительныхЗатрат", ПравилаДвижения);		
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("СтатьяЗатрат", "СтатьяЗатрат");
	ПравилаДвижения.Вставить("ВидОперации", "ВидОперации");
	ПравилаДвижения.Вставить("Стоимость", "Стоимость");
	ПравилаДвижения.Вставить("Комментарий", "Комментарий");	
	
	// Правила для регистра "ДанныеПлановДДС".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановДвиженияДенежныхСредств.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ДвиженияДенежныхСредств", ПравилаТаблицы);	
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеПлановДДС", ПравилаДвижения);	
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("СтатьяДДС", "СтатьяДДС");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	ПравилаДвижения.Вставить("НаправлениеДвижения", "НаправлениеДвижения");
	ПравилаДвижения.Вставить("ВидПлатежа", "ВидПлатежа");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("Задержка", "Задержка");
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязки");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	
	// Правила для регистра "АктуальныеПланыДДС" не определяются, ручное управление движениями.
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДвиженийДенежныхСредств.Метаданные().Имя, Правила);
	
	// Правила для регистра "ДанныеПлановДоходовИРасходов".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановДоходовИРасходов.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ПланДоходов", ПравилаТаблицы);	
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеПланаДоходов", ПравилаДвижения);	
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Статья", "Статья");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязки");
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход));
	ПравилаДвижения.Вставить("ЭтоСубпродуктИлиПотребность", Новый Структура("Значение", Ложь));
	ПравилаДвижения.Вставить("ИндексСтрокРаспределения", "ИндексСтрокРаспределения");
	ПравилаДвижения.Вставить("ИсточникПлана", "ИсточникПлана");
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ПланРасходов", ПравилаТаблицы);	
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеПланаРасходов", ПравилаДвижения);	
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Статья", "Статья");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязки");
	ПравилаДвижения.Вставить("ПериодАгрегации", "ПериодАгрегации");
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход));
	ПравилаДвижения.Вставить("ЭтоСубпродуктИлиПотребность", Новый Структура("Значение", Ложь));
	ПравилаДвижения.Вставить("ИндексСтрокРаспределения", "ИндексСтрокРаспределения");
	ПравилаДвижения.Вставить("ИсточникПлана", "ИсточникПлана");
	
	// Также опционально может быть сделано движение по таблице субпродуктов.
	Если ВключитьСубпродуктыВПланДоходов Тогда
		ПравилаТаблицы = Новый Структура();
		Правила.Вставить("Субпродукты", ПравилаТаблицы);
		// Делаем одно движение по ТЧ.
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ОпределениеПланаДоходов", ПравилаДвижения);
		// Правила связи.
		ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
		ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
		ПравилаДвижения.Вставить("Статья", "СтатьяДоходов");
		ПравилаДвижения.Вставить("СуммаВалютная", "ОбщСтоимость"); 
		ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
		ПравилаДвижения.Вставить("Контрагент", "Контрагент");
		ПравилаДвижения.Вставить("Договор", "Договор");
		ПравилаДвижения.Вставить("Валюта", "Валюта");
		ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход));
		ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
		ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязки");
		ПравилаДвижения.Вставить("ЭтоСубпродуктИлиПотребность", Новый Структура("Значение", Истина));
		ПравилаДвижения.Вставить("ИсточникПлана", Новый Структура("Значение", Перечисления.упоИсточникПланаДоходовИРасходов.Объемы));
	КонецЕсли;
	
	// Также опционально может быть сделано движение по таблице МатериальныеРесурсы.
	Если ВключитьМатРесурсыВПланРасходов Тогда
		ПравилаТаблицы = Новый Структура();
		Правила.Вставить("МатериальныеРесурсы", ПравилаТаблицы);
		// Делаем одно движение по ТЧ.
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ОпределениеПланаРасходов", ПравилаДвижения);
		// Правила связи.
		ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
		ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
		ПравилаДвижения.Вставить("Статья", "СтатьяЗатрат");
		ПравилаДвижения.Вставить("СуммаВалютная", "ОбщСтоимость"); 
		ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
		ПравилаДвижения.Вставить("Контрагент", "Контрагент");
		ПравилаДвижения.Вставить("Договор", "Договор");
		ПравилаДвижения.Вставить("Валюта", "Валюта");
		ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход));
		ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
		ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязки");
		ПравилаДвижения.Вставить("ЭтоСубпродуктИлиПотребность", Новый Структура("Значение", Истина));
		ПравилаДвижения.Вставить("ИсточникПлана", Новый Структура("Значение", Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты));
	КонецЕсли;
	
	// Также опционально может быть сделано движение по таблице ДополнительныеЗатраты.
	Если ВключитьДопЗатратыВПланРасходов Тогда
		ПравилаТаблицы = Новый Структура();
		Правила.Вставить("ДополнительныеЗатраты", ПравилаТаблицы);
		// Делаем одно движение по ТЧ.
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ОпределениеПланаРасходов", ПравилаДвижения);
		// Правила связи.
		ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
		ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
		ПравилаДвижения.Вставить("Статья", "СтатьяЗатрат");
		ПравилаДвижения.Вставить("СуммаВалютная", "Стоимость"); 
		ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределенияДоходовРасходов");
		ПравилаДвижения.Вставить("Контрагент", "КонтрагентДоходовРасходов");
		ПравилаДвижения.Вставить("Договор", "ДоговорДоходовРасходов");
		ПравилаДвижения.Вставить("Валюта", Новый Структура("Значение", мВалютаУправленческогоУчета));	
		ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход));
		ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязкиДоходовРасходов");
		ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязкиДоходовРасходов");
		ПравилаДвижения.Вставить("ЭтоСубпродуктИлиПотребность", Новый Структура("Значение", Истина));
	    ПравилаДвижения.Вставить("ИсточникПлана", Новый Структура("Значение", Перечисления.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты));
	КонецЕсли;
	
	// Правила для регистра "Субпродукты проектных задач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановВыпускаСубпродуктов.Метаданные().Имя, Правила);	
		
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("Субпродукты", ПравилаТаблицы);
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ЗаписьСубпродуктов", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Номенклатура", "Ресурс");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязкиВыпуска");
	ПравилаДвижения.Вставить("ЗадержкаЗаказа", "ЗадержкаЗаказа");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	ПравилаДвижения.Вставить("ЕдиницаИзмерения", "ЕдиницаНормирования");
	ПравилаДвижения.Вставить("Количество", "Количество");
	ПравилаДвижения.Вставить("Цена", "Стоимость");
	ПравилаДвижения.Вставить("СуммаВалютная", "ОбщСтоимость");
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("Скорость", "Скорость");
	ПравилаДвижения.Вставить("Основной", "Основной");
	ПравилаДвижения.Вставить("Коэффициент", "Коэффициент");
	ПравилаДвижения.Вставить("ДатаВыпуска", "ДатаВыпуска");
	ПравилаДвижения.Вставить("СтатьяДоходов", "СтатьяДоходов");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("СпособПривязкиДоходов", "СпособПривязки");
	ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязки");
	ПравилаДвижения.Вставить("Комментарий", "Комментарий");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределения", "ИндексСтрокРаспределения");
	
	// Правила для регистра "Данные проектной документации".
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Правила = Новый Структура();
		ПравилаНаложения.Вставить(Движения.упоДанныеПроектнойПродукции.Метаданные().Имя, Правила);
		
		ПравилаТаблицы = Новый Структура();
		Правила.Вставить("Субпродукты", ПравилаТаблицы);
		// Делаем одно движение по ТЧ.
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ЗаписьПроектнойПродукции", ПравилаДвижения);
		// Правила связи.
		ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
		ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
		ПравилаДвижения.Вставить("ПроектнаяПродукция", "Ресурс");
		ПравилаДвижения.Вставить("Последовательность", "Последовательность");
		ПравилаДвижения.Вставить("НомерСвязи", "НомерСвязи");
		ПравилаДвижения.Вставить("СкоростьВыполнения", "СкоростьВыполнения");
	КонецЕсли;
	
	// Правила для регистра "План поставки мат. ресурсов проектных задач".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановПотребностейМатериальныхРесурсов.Метаданные().Имя, Правила);	
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("МатериальныеРесурсы", ПравилаТаблицы);
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ЗаписьПоставки", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Номенклатура", "Ресурс");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязкиПотребности");
	ПравилаДвижения.Вставить("ЗадержкаЗаказа", "ЗадержкаЗаказа");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	ПравилаДвижения.Вставить("ЕдиницаИзмерения", "ЕдиницаНормирования");
	ПравилаДвижения.Вставить("Количество", "Количество");
	ПравилаДвижения.Вставить("Цена", "Стоимость");
	ПравилаДвижения.Вставить("СуммаВалютная", "ОбщСтоимость");
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("ВидОперации", "ВидОперации");
	ПравилаДвижения.Вставить("СтатьяЗатрат", "СтатьяЗатрат");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("СпособПривязкиРасхода", "СпособПривязки");
	ПравилаДвижения.Вставить("ДатаПривязки", "ДатаПривязки");
	ПравилаДвижения.Вставить("ДатаЗаказа", "ДатаЗаказа");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределения", "ИндексСтрокРаспределения");
	
	// Правила для регистра "упоДанныеПлановТрудозатратРолей"
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоДанныеПлановТрудозатратРолей.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ТрудовыеРесурсы", ПравилаТаблицы);
	// Делаем одно движение по ТЧ
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ЗаписьТрудовыеРесурсы", ПравилаДвижения);
	// Правила связи
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Ресурс", "Ресурс");
	ПравилаДвижения.Вставить("Количество", "Количество");
	ПравилаДвижения.Вставить("ЕдиницаНормирования", "ЕдиницаНормирования");
	ПравилаДвижения.Вставить("Стоимость", "Стоимость");
	ПравилаДвижения.Вставить("ОбщСтоимость", "ОбщСтоимость");
	ПравилаДвижения.Вставить("ВнешняяСтоимость", "ВнешняяСтоимость");
	ПравилаДвижения.Вставить("ОбщВнешняяСтоимость", "ОбщВнешняяСтоимость");	
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("Основной", "Основной");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("УровеньПланирования", "УровеньПланирования");		
	ПравилаДвижения.Вставить("ИндексСтрокРаспределения", "ИндексСтрокРаспределенияПоПериодам");
	ПравилаДвижения.Вставить("ИсточникПлана", "ИсточникПлана");
	
	////////////////////////////////////////////////////////////////////////////////////////////
	// Правила для регистра "упоАктуальныеПланыВыполненияОбъемов".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыВыполненияОбъемов.Метаданные().Имя, Правила);
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДоходовИРасходовПодразделения.Метаданные().Имя, Правила);	
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоДанныеПлановОбъемовПодразделения", Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("РаспределениеОбъемов", ПравилаТаблицы);
	ПравилаДвижения = Новый Структура;
	ПравилаТаблицы.Вставить("ЗаписьРаспределениеОбъемов", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ВидОбъема", Новый Структура("Значение", Перечисления.упоВидЭлементаОбъемов.Доход));
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("Роль", "Роль");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаПривязки");
	ПравилаДвижения.Вставить("Заказ_ДоговорПодрядчика", "ЗаказДоговорПодрядчика");
	ПравилаДвижения.Вставить("СобствСилы_Субподряд", "СобствСилы_Субподряд");
	ПравилаДвижения.Вставить("ИндексСтрокиВладельца", "ИндексСтрокиВладельца");
	ПравилаДвижения.Вставить("КонтрагентПодрядчик", "КонтрагентПодрядчик");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределенияПоПериодам", "ИндексСтрокРаспределенияПоПериодам");
	ПравилаДвижения.Вставить("Сумма", "Сумма");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("Количество", "Количество");
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("РаспределениеПотребностей", ПравилаТаблицы);
	ПравилаДвижения = Новый Структура;
	ПравилаТаблицы.Вставить("ЗаписьРаспределениеПотребностей", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ВидОбъема", Новый Структура("Значение", Перечисления.упоВидЭлементаОбъемов.Расход));
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("Роль", "Роль");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаПривязки");
	ПравилаДвижения.Вставить("Заказ_ДоговорПодрядчика", Новый Структура("Значение", Справочники.ДоговорыКонтрагентов.ПустаяСсылка()));
	ПравилаДвижения.Вставить("СобствСилы_Субподряд", "СобствСилы_Субподряд");
	ПравилаДвижения.Вставить("ИндексСтрокиВладельца", "ИндексСтрокиВладельца");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределенияПоПериодам", "ИндексСтрокРаспределенияПоПериодам");
	ПравилаДвижения.Вставить("КонтрагентПодрядчик", Новый Структура("Значение", Справочники.Контрагенты.ПустаяСсылка()));
	ПравилаДвижения.Вставить("Сумма", "Сумма");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("Количество", "Количество");	
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыВыполненияОбъемов.Метаданные().Имя, Правила);
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДоходовИРасходовПодразделения.Метаданные().Имя, Правила);	
	
	// План доходов и расходов.
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоДанныеПлановДоходовИРасходовПодразделения", Правила);
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("РаспределениеДоходов", ПравилаТаблицы);
	ПравилаДвижения = Новый Структура;
	ПравилаТаблицы.Вставить("ЗаписьРаспределениеДоходов", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход));
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("Роль", "Роль");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаПривязки");
	ПравилаДвижения.Вставить("Заказ_ДоговорПодрядчика", "ЗаказДоговорПодрядчика");
	ПравилаДвижения.Вставить("СобствСилы_Субподряд", "СобствСилы_Субподряд");
	ПравилаДвижения.Вставить("ИндексСтрокиВладельца", "ИндексСтрокиВладельца");
	ПравилаДвижения.Вставить("КонтрагентПодрядчик", "КонтрагентПодрядчик");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределенияПоПериодам", "ИндексСтрокРаспределенияПоПериодам");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("Сумма", "Сумма");
	ПравилаДвижения.Вставить("Количество", Новый Структура("Значение", 1));
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("РаспределениеРасходов", ПравилаТаблицы);
	ПравилаДвижения = Новый Структура;
	ПравилаТаблицы.Вставить("ЗаписьРаспределениеРасходов", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход));
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("Роль", "Роль");
	ПравилаДвижения.Вставить("СпособПривязки", "СпособПривязки");
	ПравилаДвижения.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаПривязки");
	ПравилаДвижения.Вставить("Заказ_ДоговорПодрядчика", Новый Структура("Значение", Справочники.ДоговорыКонтрагентов.ПустаяСсылка()));
	ПравилаДвижения.Вставить("СобствСилы_Субподряд", "СобствСилы_Субподряд");
	ПравилаДвижения.Вставить("ИндексСтрокиВладельца", "ИндексСтрокиВладельца");
	ПравилаДвижения.Вставить("ИндексСтрокРаспределенияПоПериодам", "ИндексСтрокРаспределенияПоПериодам");
	ПравилаДвижения.Вставить("КонтрагентПодрядчик", Новый Структура("Значение", Справочники.Контрагенты.ПустаяСсылка()));
	ПравилаДвижения.Вставить("Сумма", "Сумма");
	ПравилаДвижения.Вставить("СуммаВалютная", "Сумма");
	ПравилаДвижения.Вставить("Количество", Новый Структура("Значение", 0));
	ПравилаДвижения.Вставить("ИсточникПлана", "ИсточникПлана");
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоДанныеРаспределенияДоходовПоПериодам", Правила);
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("РаспределениеДоходовПоПериодам", ПравилаТаблицы);
	ПравилаДвижения = Новый Структура;
	ПравилаТаблицы.Вставить("ЗаписьРаспределениеДоходовПоПериодам", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ПериодРаспределения", "Период");
	ПравилаДвижения.Вставить("ИндексСтрокиРаспределениеПоРолям", "ИндексСтрокиРаспределениеПоРолям");
	ПравилаДвижения.Вставить("ИндексСтрокиРаспределенияДоходов", "ИндексСтрокиРаспределенияДоходов");	
	ПравилаДвижения.Вставить("Сумма", "Сумма");
	ПравилаДвижения.Вставить("Количество", "Количество");
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоДанныеРаспределенияРасходовПоПериодам", Правила);
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("РаспределениеРасходовПоПериодам", ПравилаТаблицы);
	ПравилаДвижения = Новый Структура;
	ПравилаТаблицы.Вставить("ЗаписьРаспределениеРасходовПоПериодам", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ПериодРаспределения", "Период");
	ПравилаДвижения.Вставить("ИндексСтрокиРаспределениеПоРолям", "ИндексСтрокиРаспределениеПоРолям");
	ПравилаДвижения.Вставить("ИндексСтрокиРаспределенияРасходов", "ИндексСтрокиРаспределенияРасходов");	
	ПравилаДвижения.Вставить("ИсточникПлана", "ИсточникПлана");	
	ПравилаДвижения.Вставить("Сумма", "Сумма");
	ПравилаДвижения.Вставить("Количество", "Количество");

	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам", Правила);
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ТрудовыеРесурсыПоПериодам", ПравилаТаблицы);
	ПравилаДвижения = Новый Структура;
	ПравилаТаблицы.Вставить("ЗаписьРаспределениеТрудовыхРесурсовПоПериодам", ПравилаДвижения);
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ПериодРаспределения", "Период");
	ПравилаДвижения.Вставить("ИндексСтрокиРаспределениеПоРолям", "ИндексСтрокиРаспределениеПоРолям");
	ПравилаДвижения.Вставить("Количество", "Количество");
	
	// Правила для регистра "АктуальныеПланыДоходовИРасходов" не определяются, ручное управление движениями.
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоАктуальныеПланыДоходовИРасходов.Метаданные().Имя, Правила);
	
	// Правила для регистра "упоПричиныОтклонений".
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		Правила = Новый Структура();
		ПравилаНаложения.Вставить(Движения.упоПричиныОтклонений.Метаданные().Имя, Правила);
	
		ПравилаТаблицы = Новый Структура();
		Правила.Вставить("ПричиныОтклонений", ПравилаТаблицы);
		
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ЗаписьПричинОтклонений", ПравилаДвижения);
		
		ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
		ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
		ПравилаДвижения.Вставить("Причина", "Причина");
		ПравилаДвижения.Вставить("Сотрудник", "Сотрудник");
		ПравилаДвижения.Вставить("Комментарий", "Комментарий");
		ПравилаДвижения.Вставить("Пользователь", "Пользователь"); 
		ПравилаДвижения.Вставить("АвторИзменений", "АвторИзменений");
		ПравилаДвижения.Вставить("ДатаИзменений", "ДатаИзменений");
		ПравилаДвижения.Вставить("Отмена", "Отмена");
	КонецЕсли;
	
	Возврат ПравилаНаложения; 

КонецФункции

// Получает подготовленные данные для движений по регистрам
//  и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	Если ЭтоСозданиеИзСтруктуры() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДокумента.Вставить("ТекущаяВерсияПроекта", текущаяВерсия);
	
	// Предусловия проектных задач
	
	упоПроведениеДокументовСервер.ДобавитьДвиженияОчисткиНеактуальныхСвязей(ДанныеДвижений.упоПредусловияПроектныхЗадач, 
		ДанныеДокумента.Ссылка, ТекущаяВерсия);
	
	// Свертка данных по упоДанныеПлановТрудозатратРолей
	колонкиСуммы = Новый Соответствие;
	колонкиСуммы.Вставить("Количество", Истина);
	колонкиСуммы.Вставить("ОбщСтоимость", Истина);
	колонкиСуммы.Вставить("ОбщВнешняяСтоимость", Истина);
	
	Если СвойстваПроекта.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда
		колонкиСуммы.Вставить("Стоимость", Истина);
		колонкиСуммы.Вставить("ВнешняяСтоимость", Истина);
	КонецЕсли;
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДвижений.упоДанныеПлановТрудозатратРолей, колонкиСуммы);
	
	// Актуализация данных табличных частей ПЗ.
	// "упоДанныеПлановПотребностейМатериальныхРесурсов" не актуализируем: это произойдет при актуализации фин.планов.
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(ДанныеДокумента.Ссылка);
	
	ДанныеАктуализации = Новый Структура ("Регистратор, Период, МассивЗадач, ИмяРегистра",
		ДанныеДокумента.Ссылка, ДанныеДокумента.Дата, МассивЗадач, "");
	УсловиеОтбора = "Версия = &Версия";
	ПараметрОтбора = Новый Структура("Версия", текущаяВерсия);
	
	ИмяРегистра = "упоДанныеПлановТрудозатратРолей";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);
		
	ИмяРегистра = "упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);
		
	ИмяРегистра = "упоДанныеПлановВыпускаСубпродуктов";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		ИмяРегистра = "упоДанныеПроектнойПродукции";
		ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
		упоСервисныеФункцииВызовСервера.УдалитьНоменклатуруИзРегистра(ДанныеДвижений[ИмяРегистра], 
			ДанныеДокумента.Ссылка, текущаяВерсия);
		упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
			ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь); 
	КонецЕсли;
	
	ИмяРегистра = "упоДанныеПлановОбъемовПодразделения";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);
		
	ИмяРегистра = "упоДанныеРаспределенияДоходовПоПериодам";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);
		
	ИмяРегистра = "упоДанныеРаспределенияРасходовПоПериодам";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);
		
	// Свертка данных по Данным планов доходов и расходов. Обработка источника плана и трансляции трудозатрат.
	
	колонкиСуммы = Новый Соответствие;
	колонкиСуммы.Вставить("Сумма", Истина);
	колонкиСуммы.Вставить("СуммаВалютная", Истина);
	
	колонкиИсключения = Новый Соответствие;
	колонкиИсключения.Вставить("УдалитьПрофильРаспределения", Истина);
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДвижений.упоДанныеПлановДоходовИРасходов, 
		колонкиСуммы, колонкиИсключения);
	
	ОбработатьИсточникиПлана_ДоходыИРасходы(ДанныеДвижений);
	
	УсловиеОтбора = "Версия = &Версия И ИсточникПлана = &ИсточникПлана";
	ПараметрОтбора = Новый Структура("Версия, ИсточникПлана", 
		текущаяВерсия, Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
	
	ИмяРегистра = "упоДанныеПлановДоходовИРасходов";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , ,УсловиеОтбора, ПараметрОтбора, Ложь);
		
	ИмяРегистра = "упоДанныеПлановДоходовИРасходовПодразделения";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);

	//
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДвижений.упоДанныеПлановДвиженияДенежныхСредств, колонкиСуммы);
	
	ДанныеДокумента.ДвиженияДенежныхСредств.Колонки.Удалить(ДанныеДокумента.ДвиженияДенежныхСредств.Колонки.НомерСтроки);
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДокумента.ДвиженияДенежныхСредств, колонкиСуммы);
	
	УсловиеОтбора = "Версия = &Версия";
	ПараметрОтбора = Новый Структура("Версия", текущаяВерсия);
	
	ИмяРегистра = "упоДанныеПлановДвиженияДенежныхСредств";
	ДанныеАктуализации.ИмяРегистра = ИмяРегистра;
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(ДанныеДвижений[ИмяРегистра], 
		ДанныеАктуализации, , , УсловиеОтбора, ПараметрОтбора, Ложь);
	
	// Для актуализации информации и дальнейших манипуляций свойства и сроки ПЗ должны быть уже записаны.
	ЗаписатьДвиженияРегистраПринудительно(ДанныеДвижений, "упоСвойстваПроектныхЗадач", Отказ);
	ЗаписатьДвиженияРегистраПринудительно(ДанныеДвижений, "упоСрокиПроектныхЗадач", Отказ);
	
	ЗаполнитьСуммуУправленческогоУчета(ДанныеДокумента, ДанныеДвижений);
	
	// Расчет актуальных финансовых планов.
	
	ИспользоватьСрокиИзДокумента = Истина;
	Если НЕ (ДанныеДокумента.РучнойВводСроков Или НужноЗаписатьСрокиПринудительно()) Тогда
		СрокиЗадачи = ПолучитьСроки();
		Если СрокиЗадачи <> Неопределено Тогда
			ИспользоватьСрокиИзДокумента = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ИспользоватьСрокиИзДокумента Тогда
		СрокиЗадачи = Новый Структура("ДатаНачала, ДатаЗавершения",
			ДанныеДокумента.ДатаНачалаПлан,
			ДанныеДокумента.ДатаЗавершенияПлан)
	КонецЕсли;
	
	СрокиСоответствие = Новый Соответствие;
	СрокиСоответствие.Вставить(Ссылка, Новый Структура("Результат", СрокиЗадачи));
	
	ТаблицаДвиженийБДДС = ДанныеДвижений.упоДанныеПлановДвиженияДенежныхСредств;
	ТаблицаДвиженийБДДСАктуальные = ДанныеДвижений.упоАктуальныеПланыДвиженийДенежныхСредств;
	ТаблицаДвиженияПланБДР = ДанныеДвижений.упоАктуальныеПланыДоходовИРасходов;
	ТаблицаДвиженияПланПоставкиМатРесурсовПЗ = ДанныеДвижений.упоДанныеПлановПотребностейМатериальныхРесурсов;
	
	Если Не НужноНеФормироватьАктуальныеДвижения() Тогда 
		
		// Подготовим таблицу сроков задачи для обновления движений по регистру 
		// упоДанныеПлановПотребностейМатериальныхРесурсов.
		
		ТаблицаДвиженияСрокиПЗ = Новый ТаблицаЗначений;
		ТаблицаДвиженияСрокиПЗ.Колонки.Добавить("ПроектнаяЗадача");
		ТаблицаДвиженияСрокиПЗ.Колонки.Добавить("ДатаНачалаПлан");
		ТаблицаДвиженияСрокиПЗ.Колонки.Добавить("ДатаЗавершенияПлан");
		
		СтрокаТаблицы = ТаблицаДвиженияСрокиПЗ.Добавить();
		СтрокаТаблицы.ПроектнаяЗадача = ДанныеДокумента.Ссылка;
		СтрокаТаблицы.ДатаНачалаПлан = СрокиЗадачи.ДатаНачала;
		СтрокаТаблицы.ДатаЗавершенияПлан = СрокиЗадачи.ДатаЗавершения;
		
		ДанныеДляАктуализации = Новый Структура("ТаблицаДвиженийБДР,
			|ТаблицаДвиженийБДДС,
			|ТаблицаДвиженийБДДСАктуальные,
			|ТаблицаДвиженийСрокиПЗ,
			|ТаблицаДвиженияПланПоставкиМатРесурсовПЗ",
			ТаблицаДвиженияПланБДР,
			ТаблицаДвиженийБДДС,
			ТаблицаДвиженийБДДСАктуальные,
			ТаблицаДвиженияСрокиПЗ,
			ТаблицаДвиженияПланПоставкиМатРесурсовПЗ);
		упоАктуализацияПроектаВызовСервера.обАктуализацияФинансовыхПлановПроекта(ЭтотОбъект, 
			ДанныеДокумента, СрокиСоответствие, ДанныеДляАктуализации, Истина);
		
	КонецЕсли;
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДвиженийБДДСАктуальные, колонкиСуммы);
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаДвиженияПланБДР, колонкиСуммы);
	
	// Дополнительная обработка данных движения по регистру "ЗатратыМатериальныхРесурсовПлан".
	
	колонкиСуммы = Новый Соответствие;
	колонкиСуммы.Вставить("Количество", Истина);
	колонкиСуммы.Вставить("Сумма", Истина);
	колонкиСуммы.Вставить("СуммаВалютная", Истина);
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДвижений.упоДанныеПлановПотребностейМатериальныхРесурсов, 
		колонкиСуммы, колонкиИсключения);
		
	// Регистр упоАктуальныеПланыЗатратМатериальныхРесурсов.
	
	колонкиСуммы = Новый Соответствие;
	колонкиСуммы.Вставить("Количество", Истина);
	колонкиСуммы.Вставить("Стоимость", Истина);
	колонкиСуммы.Вставить("КоличествоЕдНормирования", Истина);
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ДанныеДвижений.упоАктуальныеПланыЗатратМатериальныхРесурсов, 
		колонкиСуммы, колонкиИсключения);
	
	упоПроектыИЗадачиСервер.ЗаполнитьКоличествоПоКоличествуЕдНормированияМатериальныхЗатрат(
		ДанныеДвижений.упоАктуальныеПланыЗатратМатериальныхРесурсов);
	
	// Регистр сведений "Плановые объемы" по подразделениям.
	
	СтрокаПараметрыКонтрагентовПроекта = "КонтрагентДоходов, КонтрагентЗатрат, ДоговорДоходов, ДоговорЗатрат";
	ПараметрыПроекта = упоФункцииБСП.ЗначенияРеквизитовОбъектаВызовСервера(Проект, СтрокаПараметрыКонтрагентовПроекта);
	
	Если ЗначениеЗаполнено(ДанныеДокумента.КалендарьЗадачи) Тогда
		Календарь = ДанныеДокумента.КалендарьЗадачи;
	Иначе
		Календарь = Справочники.Проекты.ПолучитьРабочийКалендарь(Проект);
	КонецЕсли;
	
	// Регистры упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.
	Если Не НужноНеФормироватьАктуальныеДвижения() Тогда
		НезаписанныеДанныеЗадач = Новый Соответствие;
		НезаписанныеДанныеЗадач.Вставить(Ссылка, ДанныеДокумента);
		упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(Ссылка, Ссылка, 
			СрокиСоответствие, НезаписанныеДанныеЗадач, ДанныеДвижений);
	КонецЕсли;
	
	СвойстваПроведения = Новый Структура(СтрокаПараметрыКонтрагентовПроекта);
	
	ЗаполнитьЗначенияСвойств(СвойстваПроведения, ПараметрыПроекта);
	
	СвойстваПроведения.Вставить("Проект", Проект);
	СвойстваПроведения.Вставить("Версия", текущаяВерсия);
	СвойстваПроведения.Вставить("ПроектнаяЗадача", Ссылка);
	СвойстваПроведения.Вставить("НачДата", СрокиЗадачи.ДатаНачала);
	СвойстваПроведения.Вставить("КонДата", СрокиЗадачи.ДатаЗавершения);
	СвойстваПроведения.Вставить("Календарь", Календарь);
	
	упоАналитикаПоПодразделениямСервер.ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(Ссылка, СвойстваПроведения);

	упоАналитикаПоПодразделениямСервер.ПодготовитьТаблицыДвижений(ЭтотОбъект, 
		ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);

КонецПроцедуры

// Устанавливает субпродукт по умолчанию. В случае, если субпродукт еще
// не был установлен, берется первый из списка.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция УстановитьОсновнойСубпродуктПоУмолчанию() Экспорт
	
	Если Субпродукты.Количество() > 0 И Субпродукты.Найти(Истина, "Основной") = Неопределено Тогда
		Субпродукты[0].Основной = Истина;		
	КонецЕсли;	
	
КонецФункции 

// Заполняет СписокПотомков полным перечнем зависимых проектных задач
//
// Параметры:
//  СписокПотомков	- СписокЗначений - хранит весь список потомков.
//
Процедура ПолучитьПолныйСписокПотомков(СписокПотомков) Экспорт
	
	Документы.упоПроектнаяЗадача.ПолучитьПолныйСписокПотомков(ЭтотОбъект.Ссылка, СписокПотомков);	
	
КонецПроцедуры

// Описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
// Параметры:
//  Таблица	 - ТаблицаЗначений - см. УправлениеДоступом.ТаблицаНаборыЗначенийДоступа
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = Проект;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
//  
Процедура ПриКопировании(ОбъектКопирования)
		 	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоФункцииЗащитыСервер.МожноИспользоватьОбъектИспользующийЗащищенныйКод(,Отказ);
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	упоУправлениеСсылкамиСервер.СоздатьСсылкуПроектнойЗадачи(ЭтотОбъект); 
	
	//
	
	текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	ДополнительныеСвойства.Вставить("Версия", текущаяВерсия);

	упоЗакрытиеЭтапа.ПроверкаПередЗаписью_упоПроектнаяЗадачаПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ЗапомнитьСвойстваНовогоДокумента();
	
		
	// Контроль удаления проектной задачи - задача может быть удалена только специальной командой.
	КонтрольУдаления(РежимЗаписи, Отказ);
	
	// Контроль списания факта при отмене задачи.
	КонтрольПриОтменеСписанФакт(Отказ);
	
	КонтрольВозможностиПроведенияПоСвойствам(РежимЗаписи, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	ЗаполнитьДатуДокумента(РежимЗаписи);
	
	ЗаписатьТипЗадачи();
	ЗаполнитьДлительностьМоделиПакетаРабот();
	НазваниеОперации = НазваниеПроектнойЗадачи;
	
	ПрименитьПроектныеОпции();
	ПроверитьЗаполнитьТабличныеЧастиРаспределений(Отказ);
	
	ОбработатьПредусловия();
	
	ОбработатьВыводВСтатусОтчет();
	
	ЗапомнитьУдаленнуюПроектнуюПродукцию();
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
	РежимЗаписи = ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи;
	ПоставитьПроектыПредусловийВОчередьПересчетаСроков(РежимЗаписи);
	
	ПоставитьПроектВОчередьПересчетаСроков(РежимЗаписи);
	
	ОбновитьПроектнуюПродукциюВРегистрахСкопированнойЗадачи();
		
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УпрощенноеСоздание = ЭтоСозданиеИзСтруктуры();
	Если НЕ ДополнительныеСвойства.ЭтоНовый И НЕ УпрощенноеСоздание Тогда
		// Удалим лишние движения версии по данной проектной задаче.
		ОчиститьДвиженияДокумента();
	КонецЕсли;
	
	ОбработатьПроектнуюПродукциюПриПроведении();
	
	// Необходимо принимать во внимание, что при вызове процедуры "ПодготовитьДанныеДляДвижений"
	// из модуля объекта свойства проектных задач принудительно записываются
	// (до записи всех остальных движений), иначе дальнейшее обращение к данным регистра будет некорректным.
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Для актуализации информации свойства должны быть уже записаны.
	ЗаменитьЗначениеРеквизитаОбъектУПотомков(Отказ);
	
	СоздатьДокументНазначениеРуководителяПЗ(Отказ); 
	
	АктуализироватьРПЗИПоручения(Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОчиститьДвиженияДокумента();
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	упоИерархияИПолномочияСервер.АктуализироватьРуководителейПроектныхЗадачПоИерархии(Ссылка, , , текущаяВерсия);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка дубликатов трудовых ресурсов. 
	// Ограничение: не должны дублироваться роли на одном уровне планирования, даже в разных подразделениях. 
	Ошибки = Неопределено;
	ОбработанныеРесурсы = Новый Соответствие;
	ОбработанныеРесурсы.Вставить(Перечисления.упоУровеньПланирования.Предварительный, Новый Соответствие);
	ОбработанныеРесурсы.Вставить(Перечисления.упоУровеньПланирования.Окончательный, Новый Соответствие);
	Для Каждого СтрокаТрудовойРесурс Из ТрудовыеРесурсы Цикл
		
		Если СтрокаТрудовойРесурс.ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаТрудозатратРолей.Объемы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбработанныеРесурсы[СтрокаТрудовойРесурс.УровеньПланирования][СтрокаТрудовойРесурс.Ресурс] = Неопределено Тогда
			ОбработанныеРесурсы[СтрокаТрудовойРесурс.УровеньПланирования].Вставить(СтрокаТрудовойРесурс.Ресурс, Истина);
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ресурс ""%1"" (уровень планирования %2) в строке №%3 является дубликатом.'"), 
				СтрокаТрудовойРесурс.Ресурс, СтрокаТрудовойРесурс.УровеньПланирования, СтрокаТрудовойРесурс.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"ТрудовыеРесурсы[%1].Ресурс",
				ТекстОшибки, 
				"ТрудовыеРесурсы",
				СтрокаТрудовойРесурс.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	ОбработанныеРесурсы = Неопределено;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	//
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		МодульупоПроектнаяПродукция = ОбщегоНазначения.ОбщийМодуль("упоПроектнаяПродукцияВызовСервера");
		МодульупоПроектнаяПродукция.СообщитьОшибкиТрансляцииПроектнойПродукции(ТрудовыеРесурсы, Отказ);
	КонецЕсли;
	
	//
	ПроверяемыеТЧ = ПроверяемыеТабличныеЧастиПоПроектнымОпциямИСвойствам();
	
	упоАналитикаПоПодразделениямСервер.ПроверитьЗаполнениеТабличныхЧастей(ЭтотОбъект, ПроверяемыеТЧ, Отказ, СвойстваПроекта);
			
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
//
// Параметры: 
//   ДанныеЗаполнения - Произвольный - данные заполнения.
// 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения) Экспорт
	
	Документы.упоПроектнаяЗадача.ЗаполнитьПЗПоОснованию(ДанныеЗаполнения, ЭтотОбъект);
		
КонецПроцедуры // ОбработкаЗаполнения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ОчиститьДвиженияДокумента()
	
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоПредусловияПроектныхЗадач", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоАктуальныеПланыЗатратМатериальныхРесурсов", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоАктуальныеПланыДополнительныхЗатрат", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановДвиженияДенежныхСредств", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановДоходовИРасходов", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановВыпускаСубпродуктов", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановПотребностейМатериальныхРесурсов", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановТрудозатратРолей", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановДоходовИРасходовПодразделения", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановОбъемовПодразделения", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеРаспределенияДоходовПоПериодам", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеРаспределенияРасходовПоПериодам", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоАктуальныеПланыДоходовИРасходовПодразделения", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоАктуальныеПланыВыполненияОбъемов", Ссылка, текущаяВерсия);
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановДополнительныхЗатрат", Ссылка, текущаяВерсия);	
	упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоДанныеПлановДополнительныхЗатратПодразделения", Ссылка, текущаяВерсия);
	
	// Лишнее удаление сроков проектных задач.
	Если РучнойВводСроков Тогда 
		упоЗаписьИПроведениеПривилегированный.ОчиститьДвиженияВерсии("упоСрокиПроектныхЗадач", Ссылка, текущаяВерсия);
	КонецЕсли;
	
КонецФункции 

// Функция получает дату документа "Регистрация проекта".
//
Функция ПолучитьДатуРегистрацииПроекта()
 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСтатусыПроектовСрезПоследних.Период КАК Дата
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(
	               |			,
	               |			Проект = &Проект
	               |				И СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Запланирован)) КАК упоСтатусыПроектовСрезПоследних";
				   
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПериодСтатусЗадачи 	= Выборка.Дата;
	КонецЕсли;              
	
	Возврат ПериодСтатусЗадачи;

КонецФункции // ПолучитьДатуРегистрацииПроекта()

Процедура ЗаполнитьСуммуУправленческогоУчета(ДанныеДокумента, ДанныеДвижений)
	
	Если НЕ ЗначениеЗаполнено(мВалютаУправленческогоУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Движение Из Движения Цикл
		ТаблицаДвижения = ДанныеДвижений[Движение.Метаданные().Имя];
		упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвижения, мВалютаУправленческогоУчета);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПроверитьВозможностьАктуализацииФинансовыхПлановПроекта(ДанныеДокумента)
	
	НеПроверятьВозможностьАктуализацииФинПланов = 
		СвойствоСтруктуры(ДополнительныеСвойства, "НеПроверятьВозможностьАктуализацииФинПланов");
	Если НеПроверятьВозможностьАктуализацииФинПланов Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуСроковИзДокумента = Истина;	
	
	ТаблицаСроков = Новый ТаблицаЗначений();
	ТаблицаСроков.Колонки.Добавить("Задача");
	ТаблицаСроков.Колонки.Добавить("ДатаНачала");
	ТаблицаСроков.Колонки.Добавить("ДатаЗавершения");
		
	Если НЕ (ДанныеДокумента.РучнойВводСроков ИЛИ НужноЗаписатьСрокиПринудительно()) Тогда
		
		Если текущаяВерсия = Неопределено Тогда
			текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДанныеДокумента.Ссылка);
		Запрос.УстановитьПараметр("ТекВерсия", текущаяВерсия);
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегСроки.ДатаНачалаПлан КАК ДатаНачала,
		               |	РегСроки.ДатаЗавершенияПлан КАК ДатаЗавершения,
		               |	РегСроки.ПроектнаяЗадача КАК Задача
		               |ИЗ
		               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		               |			,
		               |			Версия = &ТекВерсия
		               |				И ПроектнаяЗадача = &Ссылка) КАК РегСроки";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаСроков = РезультатЗапроса.Выгрузить();
			ЗаполнитьТаблицуСроковИзДокумента = Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЗаполнитьТаблицуСроковИзДокумента Тогда	
		СтрокаСроки = ТаблицаСроков.Добавить();
		СтрокаСроки.Задача = ДанныеДокумента.Ссылка;
		СтрокаСроки.ДатаНачала = ДанныеДокумента.ДатаНачалаПлан;
		СтрокаСроки.ДатаЗавершения = ДанныеДокумента.ДатаЗавершенияПлан;
	КонецЕсли;
	
	ПроверитьВозможностьАктуализацииДДСПроекта(ДанныеДокумента, ТаблицаСроков);
	ПроверитьВозможностьАктуализацииБДРПроекта(ДанныеДокумента, ТаблицаСроков);
	
КонецПроцедуры

Процедура ПроверитьВозможностьАктуализацииДДСПроекта(ДанныеДокумента, ТаблицаСроков)
	
	УспехДДС = Истина;
	
	ДанныеПланаДДС = ДанныеДокумента.ДвиженияДенежныхСредств;
	Если НЕ ДанныеПланаДДС.Количество() = 0 Тогда
		
		Для каждого СтрокаДанных Из ДанныеПланаДДС Цикл
			
			Если НЕ СтрокаДанных.СпособПривязки = Перечисления.упоСпособПривязкиДДС.НаДату Тогда
				
				Если ТипЗнч(ТаблицаСроков) = Тип("ТаблицаЗначений") Тогда
					Если ТаблицаСроков.Количество() = 0 Тогда
						СтрокаДанныеПЗ = Неопределено;
					Иначе
						СтрокаДанныеПЗ = ТаблицаСроков.Найти(ДанныеДокумента.Ссылка, "Задача");
					КонецЕсли;
				Иначе
					СтрокаДанныеПЗ = ТаблицаСроков[ДанныеДокумента.Ссылка];
				КонецЕсли;
				
				Если СтрокаДанныеПЗ = Неопределено Тогда
					УспехДДС = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ УспехДДС Тогда
			ТекстСообщения = НСтр("ru = 'Расчет актуальных данных ДДС проектной задачи ""%1"" проекта ""%2"" невозможен:
                                   |у проектной задачи не указаны сроки начала и завершения работ.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
				ДанныеДокумента.НазваниеПроектнойЗадачи, ДанныеДокумента.Проект.ПолноеНаименование);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВозможностьАктуализацииБДРПроекта(ДанныеДокумента, ТаблицаСроков)
	
	УспехБДР = Истина;
	
	ПланДоходовКолво = ДанныеДокумента.ПланДоходов.Количество();
	ПланРасходовКолво = ДанныеДокумента.ПланРасходов.Количество();
	Если СвойстваПроекта.ПланироватьЗатратыНаМатериалы И ДанныеДокумента.ВключитьМатРесурсыВПланРасходов Тогда
		МатериальныеРесурсыКолво = ДанныеДокумента.МатериальныеРесурсы.Количество();
	Иначе
		МатериальныеРесурсыКолво = 0;
	КонецЕсли;
	Если СвойстваПроекта.ДоходыПоНатуральнымПоказателям И ДанныеДокумента.ВключитьСубпродуктыВПланДоходов Тогда
		СубпродуктыКолво = ДанныеДокумента.Субпродукты.Количество();
	Иначе
		СубпродуктыКолво = 0;
	КонецЕсли;
	Если Ложь И ДанныеДокумента.ВключитьТрудРесурсыВПланРасходов Тогда // Пока что данный функционал не запущен
		ТрудРесурсыКолво = ДанныеДокумента.ТрудовыеРесурсы.Количество();
	Иначе
		ТрудРесурсыКолво = 0;
	КонецЕсли;
	
	Если (ПланДоходовКолво + ПланРасходовКолво + МатериальныеРесурсыКолво + СубпродуктыКолво + ТрудРесурсыКолво) > 0 Тогда
				
		Если ТипЗнч(ТаблицаСроков) = Тип("ТаблицаЗначений") Тогда
			Если ТаблицаСроков.Количество() = 0 Тогда
				СтрокаДанныеПЗ = Неопределено;
			Иначе
				СтрокаДанныеПЗ = ТаблицаСроков.Найти(ДанныеДокумента.Ссылка, "Задача");
			КонецЕсли;
		Иначе
			СтрокаДанныеПЗ = ТаблицаСроков[ДанныеДокумента.Ссылка];	
		КонецЕсли;
		
		Если СтрокаДанныеПЗ = Неопределено Тогда      
			УспехБДР = Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НЕ УспехБДР Тогда
		ТекстСообщения = НСтр("ru = 'Расчет актуальных данных БДР проектной задачи ""%1"" проекта ""%2"" невозможен:
                               |у проектной задачи не указаны сроки начала и завершения работ.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			ДанныеДокумента.НазваниеПроектнойЗадачи, ДанныеДокумента.Проект.ПолноеНаименование);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаписатьДвиженияРегистраПринудительно(ДанныеДвижений, ИмяРегистра, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
				
	ТаблицаДвижений = ДанныеДвижений[ИмяРегистра];
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	Для каждого СтрокаТЧ Из ТаблицаДвижений Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Период) Тогда
			СтрокаТЧ.Период = Дата;
		КонецЕсли;
	КонецЦикла;
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	
	Движения[ИмяРегистра].Загрузить(ТаблицаДвижений);
	Движения[ИмяРегистра].Записать();	

КонецПроцедуры

Функция СвойствоСтруктуры(Структура, ИмяСвойства)
	
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, ИмяСвойства, Ложь);
	
КонецФункции

Функция ЭтоСозданиеИзСтруктуры() 
	Возврат ДополнительныеСвойства.Свойство("СозданиеИзСтруктуры") И ДополнительныеСвойства.СозданиеИзСтруктуры;
КонецФункции

Функция НужноЗаписатьСрокиПринудительно() 
	Возврат ДополнительныеСвойства.Свойство("ЗаписатьСроки") И ДополнительныеСвойства.ЗаписатьСроки
		Или (ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый);
КонецФункции

Функция НужноНеФормироватьАктуальныеДвижения() 
	Возврат ДополнительныеСвойства.Свойство("упоНеФормироватьАктуальныеДвижения") 
		И ДополнительныеСвойства.упоНеФормироватьАктуальныеДвижения;
КонецФункции

Функция НужноНеПроверятьЗаполнятьТабличныеЧастиРаспределений() 
	Возврат ДополнительныеСвойства.Свойство("упоНеПроверятьЗаполнятьТабличныеЧастиРаспределений");
КонецФункции

Функция ЗаменитьРеквизитОбъектУПотомков(СписокПотомков, ЗначениеРеквизитаОбъект)
	
	Если текущаяВерсия = Неопределено Тогда
		текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&ТекущаяДата КАК Период,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК Регистратор,
		|	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации КАК ВидОперации,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьДопЗатратыВПланРасходов КАК ВключитьДопЗатратыВПланРасходов,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьМатРесурсыВПланРасходов КАК ВключитьМатРесурсыВПланРасходов,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьСубпродуктыВПланДоходов КАК ВключитьСубпродуктыВПланДоходов,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьТрудРесурсыВПланРасходов КАК ВключитьТрудРесурсыВПланРасходов,
		|	упоСвойстваПроектныхЗадачСрезПоследних.Длительность КАК Длительность,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ДлительностьМоделиПакетаРабот КАК ДлительностьМоделиПакетаРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.УдалитьДлительностьПоОсвоенномуОбъему КАК УдалитьДлительностьПоОсвоенномуОбъему,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель,
		|	упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи КАК КалендарьЗадачи,
		|	упоСвойстваПроектныхЗадачСрезПоследних.КодПроектногоДокумента КАК КодПроектногоДокумента,
		|	упоСвойстваПроектныхЗадачСрезПоследних.КрайнийСрок КАК КрайнийСрок,
		|	упоСвойстваПроектныхЗадачСрезПоследних.КритерийРезультата КАК КритерийРезультата,
		|	упоСвойстваПроектныхЗадачСрезПоследних.МетодРасчетаМоделиПакетаРабот КАК МетодРасчетаМоделиПакетаРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
		|	упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимости КАК НормаСтоимости,
		|	упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|	&Объект КАК Объект,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ОписаниеЗадачи КАК ОписаниеЗадачи,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ОписаниеРезультата КАК ОписаниеРезультата,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПланироватьТрудозатратыНаИсполнителей КАК ПланироватьТрудозатратыНаИсполнителей,
		|	упоСвойстваПроектныхЗадачСрезПоследних.РучнойВводСроков КАК РучнойВводСроков,
		|	упоСвойстваПроектныхЗадачСрезПоследних.СпособПланированияРасходов КАК СпособПланированияРасходов,
		|	упоСвойстваПроектныхЗадачСрезПоследних.СпособПривязкиДопЗатрат КАК СпособПривязкиДопЗатрат,
		|	упоСвойстваПроектныхЗадачСрезПоследних.СуммаСанкцийЗаДеньЗадержки КАК СуммаСанкцийЗаДеньЗадержки,
		|	упоСвойстваПроектныхЗадачСрезПоследних.СхемаОплатыПоУмолчаниюРасходы КАК СхемаОплатыПоУмолчаниюРасходы,
		|	упоСвойстваПроектныхЗадачСрезПоследних.СхемаОплатыПоУмолчаниюДоходы КАК СхемаОплатыПоУмолчаниюДоходы,
		|	упоСвойстваПроектныхЗадачСрезПоследних.УдалитьОписаниеРезультатаФакт КАК УдалитьОписаниеРезультатаФакт,
		|	упоСвойстваПроектныхЗадачСрезПоследних.УчестьРучнойВводСроковПриАктуализации КАК УчестьРучнойВводСроковПриАктуализации,
		|	упоСвойстваПроектныхЗадачСрезПоследних.УровеньПланированияТрудозатратДляБДР КАК УровеньПланированияТрудозатратДляБДР,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланРасходовВБДДС КАК ВключитьПланРасходовВБДДС,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланДоходовВБДДС КАК ВключитьПланДоходовВБДДС,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПодчиненныйПроект,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненнаяПроектнаяЗадача КАК ПодчиненнаяПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.НеВыводитьВСтатусОтчет КАК НеВыводитьВСтатусОтчет,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВыводитьВСводныйСтатусОтчет КАК ВыводитьВСводныйСтатусОтчет,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			Версия = &ТекВерсия
		|				И ПроектнаяЗадача В (&СписокПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|ГДЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.Объект <> &Объект";
	
	Запрос.УстановитьПараметр("СписокПЗ", СписокПотомков);
	Запрос.УстановитьПараметр("ТекВерсия", текущаяВерсия);
	Запрос.УстановитьПараметр("Объект", ЗначениеРеквизитаОбъект);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НЗ = РегистрыСведений.упоСвойстваПроектныхЗадач.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
		НЗ.Прочитать();
		
		НоваяЗапись = Неопределено;
		Для Каждого Запись Из НЗ Цикл
			Если Запись.Версия = ВыборкаДетальныеЗаписи.Версия Тогда 
				НоваяЗапись = Запись;
			КонецЕсли;
		КонецЦикла;
	    Если НоваяЗапись = Неопределено Тогда
			НоваяЗапись = НЗ.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
		
		Попытка 
			НЗ.Записать();
		Исключение 
			
			Возврат Ложь;
		КонецПопытки;

	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура СформироватьСообщениеПользователю(ТекстСообщения, ИмяПроверяемойТЧ, стрПроверяемойТЧ, ПолеИмя, Отказ)
	
	Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.%1[%2].%3Остаток", 
								ИмяПроверяемойТЧ, 
								Формат(ЭтотОбъект[ИмяПроверяемойТЧ].Индекс(стрПроверяемойТЧ), "ЧН=0; ЧГ=0"),
								ПолеИмя);
								
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);	
	
КонецПроцедуры

// Создает документ упоИзменениеРуководителяПроектнойЗадачи в случае проведения ПЗ при условии,
// что в ПЗ есть основная роль. Если основной роли нет, действий по снятию РПЗ не производится.
// Снятие основной роли отрабатывается в форме ПЗ.
//
Процедура СоздатьДокументНазначениеРуководителяПЗ(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СвойстваПроекта.НазначатьРСПОсновнойРолиКакРПЗ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееПодразделениеОсновнойРоли = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("НазначитьРПЗИзПодразделения", ТекущееПодразделениеОсновнойРоли) Тогда
		Возврат;
	КонецЕсли;
	
	НеобходимоОбновитьРПЗ = Истина;
	
	Если ЗначениеЗаполнено(ТекущееПодразделениеОсновнойРоли) Тогда
		АвтоНазначенныйРПЗ = упоИерархияИПолномочияВызовСервера.НепосредственныйРуководительПодразделения(
			ТекущееПодразделениеОсновнойРоли);
		РПЗ = упоИерархияИПолномочияСервер.ПолучитьРуководителяПроектнойЗадачиПоИерархии(Ссылка);
		
		НеобходимоОбновитьРПЗ = АвтоНазначенныйРПЗ <> РПЗ;
	Иначе
		АвтоНазначенныйРПЗ = Справочники.упоСотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если Не НеобходимоОбновитьРПЗ Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	ДокументНазначение = Документы.упоИзменениеРуководителяПроектнойЗадачи.СоздатьДокумент();
	ДокументНазначение.ДополнительныеСвойства.Вставить("ОтключитьПроверкуАвтоматическогоНазначенияРПЗ", Истина);
	ДокументНазначение.Дата = ТекущаяДатаСеанса();
	ДокументНазначение.Проект = Проект;
	ДокументНазначение.ПроектнаяЗадача = Ссылка;
	ДокументНазначение.РуководительПроектнойЗадачи = АвтоНазначенныйРПЗ;
	
	Попытка
		ДокументНазначение.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОшибкаЗаписиПроектнойЗадачи", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.упоПроектнаяЗадача,, ПредставлениеОшибки);
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Ошибка записи структуры проекта. Подробнее см. журнал регистрации.'"),
			,,, Отказ);
	КонецПопытки;
	
КонецПроцедуры

Функция ИсходноеПодразделениеОсновнойРоли()
	
	ИсходноеПодразделение = Справочники.упоПодразделения.ПустаяСсылка();	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", текущаяВерсия);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |ГДЕ
	               |	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0)
	               |	И упоДанныеПлановТрудозатратРолейСрезПоследних.Основной";
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ИсходноеПодразделение = Выборка.Подразделение;
	КонецЕсли;	
	
	Возврат ИсходноеПодразделение;
	
КонецФункции

Функция ТекущееПодразделениеОсновнойРоли()
	
	ТекущееПодразделение = Справочники.упоПодразделения.ПустаяСсылка();
			
	СтрокаОсновнойРоли = ТрудовыеРесурсы.Найти(Истина, "Основной");
	Если СтрокаОсновнойРоли <> Неопределено Тогда
		ТекущееПодразделение = СтрокаОсновнойРоли.Подразделение;
	КонецЕсли;	

	Возврат ТекущееПодразделение;
		
КонецФункции

// Удаление "чужих" строк трансляции, добавленных при отображени на форме. 
// Заполнение реквизита ИсточникПлана в "родных" строках.
//
// Параметры:
//	ДанныеДвижений	– Структура – структура с данными движений документа.
//
Процедура ОбработатьИсточникиПлана_ДоходыИРасходы(ДанныеДвижений)
	
	Отбор = Новый Структура("ВидЭлемента, ИндексСтрокиВладельца");
	
	ИсточникПланаМенеджер = Перечисления.упоИсточникПланаДоходовИРасходов;
	ИсключаемыеИсточникиПлана = Новый Соответствие;
	ИсключаемыеИсточникиПлана.Вставить(ИсточникПланаМенеджер.Трудозатраты, 			Истина);
	ИсключаемыеИсточникиПлана.Вставить(ИсточникПланаМенеджер.Объемы, 				Истина);
	ИсключаемыеИсточникиПлана.Вставить(ИсточникПланаМенеджер.МатериальныеЗатраты, 	Истина);
	ИсключаемыеИсточникиПлана.Вставить(ИсточникПланаМенеджер.ДополнительныеЗатраты, Истина);
	
	ВидЭлементаДоход = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
	ВидЭлементаРасход = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаПланДР Из ДанныеДвижений.упоДанныеПлановДоходовИРасходов Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПланДР.ИсточникПлана) Тогда
			// Заполнение источника плана.
			СтрокаПланДР.ИсточникПлана = ИсточникПланаМенеджер.ДоходыРасходы;
			Продолжить; // Продолжить
		КонецЕсли;
		
		Если ИсключаемыеИсточникиПлана.Получить(СтрокаПланДР.ИсточникПлана) = Неопределено Тогда
			// "Родная" строка
			Продолжить; // Продолжить
		КонецЕсли;
		
		НужнаОбработкаПодразделений = 
			(СвойстваПроекта.РасходыПоПодразделениям И СтрокаПланДР.ВидЭлемента = ВидЭлементаРасход)
			Или (СвойстваПроекта.ДоходыПоПодразделениям И СтрокаПланДР.ВидЭлемента = ВидЭлементаДоход);
		
		// Удаление из движений строк трансляции трудозатрат.
		Если НужнаОбработкаПодразделений Тогда
			
			Отбор.ВидЭлемента = СтрокаПланДР.ВидЭлемента;
			Отбор.ИндексСтрокиВладельца = СтрокаПланДР.ИндексСтрокРаспределения;
			
			СтрокиПоПодразделениям = ДанныеДвижений.упоДанныеПлановДоходовИРасходовПодразделения.НайтиСтроки(Отбор);
			Для Каждого СтрокаПоПодразделению Из СтрокиПоПодразделениям Цикл
				ДанныеДвижений.упоДанныеПлановДоходовИРасходовПодразделения.Удалить(СтрокаПоПодразделению);
			КонецЦикла;
			
		КонецЕсли;
		
		СтрокиКУдалению.Добавить(СтрокаПланДР);
		
	КонецЦикла;
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		ДанныеДвижений.упоДанныеПлановДоходовИРасходов.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	Отбор = Новый Структура("ИсточникПлана", ИсточникПланаМенеджер.ПустаяСсылка());
	ПустыеИсточники = ДанныеДвижений.упоДанныеПлановДоходовИРасходовПодразделения.НайтиСтроки(Отбор);
	Для Каждого ПустойИсточник Из ПустыеИсточники Цикл
		ПустойИсточник.ИсточникПлана = ИсточникПланаМенеджер.ДоходыРасходы;
	КонецЦикла;
	
КонецПроцедуры

Функция ТранслироватьОбъемыВТрудозатраты()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИсточникПлана", ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаТрудозатратРолей.Объемы"));
	
	Результат = ЭтотОбъект.ТрудовыеРесурсы.НайтиСтроки(ПараметрыОтбора).Количество() <> 0;
	
	Возврат Результат;

КонецФункции //

Процедура КонтрольПриОтменеСписанФакт(Отказ)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗадачаОтменена Тогда
		Возврат;
	КонецЕсли;
	
	// Входящие в этап задачи не проверяем, т.к. для этапа установлен запрет отмены из документа.
	СписокПроверяемыхЗадач = Новый СписокЗначений;
	СписокПроверяемыхЗадач.Добавить(Ссылка);
	
	СписокЗадачиСписанФакт = упоПроектыИЗадачиСервер.ПолучитьЗадачиСписанФакт(СписокПроверяемыхЗадач);
	Если Не ЗначениеЗаполнено(СписокЗадачиСписанФакт) Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	Представление = СтрШаблон("%1. %2",
		упоПроектыИЗадачиВызовСервера.обПолучитьКодСДРПроектнойЗадачи(Ссылка),
		НазваниеПроектнойЗадачи);
		
	ТекстСообщения = СтрШаблон(
		НСтр("ru = 'По задаче ""%1"" списан факт. Нельзя отменить проектные задачи, по которым списан факт.'"),
		Представление);
		
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	
КонецПроцедуры

Функция ОтключитьПроверкуЦикличности(Объект)
	
    Отключено = Объект.ДополнительныеСвойства.Свойство("ОтключитьПроверкуЦикличности") И Объект.ДополнительныеСвойства.ОтключитьПроверкуЦикличности;
	Возврат Отключено;

КонецФункции

#Область ЗаписьИПроведение

Процедура ОбработатьПроектнуюПродукциюПриПроведении()
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	ПроектнаяПродукция = ПолучитьСоздатьЭлементыПроектнойПродукции();
	
	УстановитьСтатусУдаленнойПроектнойПродукции();
	
КонецПроцедуры

Функция ПолучитьСоздатьЭлементыПроектнойПродукции()
	
	СозданныеСПД = МодульупоПроектнаяПродукция.СоздатьОбновитьПроектнуюПродукциюВСубпродуктах(ЭтотОбъект.Ссылка,
		ЭтотОбъект.Субпродукты,
		ЭтотОбъект.РаспределениеОбъемов);
	
	Возврат СозданныеСПД.Получить(ЭтотОбъект.Ссылка);
	
КонецФункции

Процедура УстановитьСтатусУдаленнойПроектнойПродукции()
	
	УдаленнаяПП = Неопределено;
	ДополнительныеСвойства.Свойство("УдаленнаяПП", УдаленнаяПП);
	
	Если ЗначениеЗаполнено(УдаленнаяПП) Тогда
		МодульупоПроектнаяПродукция.УстановитьСтатусПроектнойПродукции(УдаленнаяПП, Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаменитьЗначениеРеквизитаОбъектУПотомков(Отказ)
	
	УпрощенноеСоздание = ЭтоСозданиеИзСтруктуры();
	
	ЗаменятьЗначениеРеквизитаОбъектУПотомков = 
		СвойствоСтруктуры(ДополнительныеСвойства, "ЗаменятьЗначениеРеквизитаОбъектУПотомков");
		
	Если Не УпрощенноеСоздание И ЗаменятьЗначениеРеквизитаОбъектУПотомков Тогда
		СписокПотомков = Новый СписокЗначений;
		ПолучитьПолныйСписокПотомков(СписокПотомков);
		Если ЗаменитьРеквизитОбъектУПотомков(СписокПотомков, ЭтотОбъект.Объект) Тогда
			ЭтотОбъект.ДополнительныеСвойства.ЗаменятьЗначениеРеквизитаОбъектУПотомков = Ложь;
		Иначе
			ТекстОШибки = НСтр("ru = 'Изменение реквизита ""Объект"" у потомков %1 не выполнено.'");
			ТекстОШибки = СтрШаблон(ТекстОШибки, ЭтотОбъект.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура АктуализироватьРПЗИПоручения(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	АктуализироватьРПЗ = Не СвойствоСтруктуры(ДополнительныеСвойства, "НеАктуализироватьРПЗ");
	Если АктуализироватьРПЗ Тогда
		упоИерархияИПолномочияСервер.АктуализироватьРуководителейПроектныхЗадачПоИерархии(Ссылка, , , текущаяВерсия);
	КонецЕсли;
	
	АктуализироватьЗадания = Не СвойствоСтруктуры(ДополнительныеСвойства, "НеАктуализироватьЗадания");
	Если АктуализироватьЗадания Тогда
		упоЗадания.СинхронизироватьПорученияЗадач(Ссылка, Неопределено, текущаяВерсия);
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольУдаления(РежимЗаписи, Отказ)
	
	ЭтоУдалениеПроектнойЗадачи = СвойствоСтруктуры(ДополнительныеСвойства, "УдалениеПроектнойЗадачи");
	
	Если ЭтоУдалениеПроектнойЗадачи Тогда
		Возврат;
	КонецЕсли;
	
	Если (ПометкаУдаления И НЕ Ссылка.ПометкаУдаления)
		Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОбщегоНазначения.СообщитьПользователю(
			Нстр("ru = 'Для запрашиваемого действия воспользуйтесь кнопкой ""Удалить задачу""!'")
			, , , , Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОчиститьДанныеПриОтключенииПроектныхОпций()
	
	Если СвойстваПроекта = Неопределено Тогда
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	КонецЕсли;
	
	Если Не СвойстваПроекта.ПланироватьЗатратыНаМатериалы И ЗначениеЗаполнено(ЭтотОбъект.МатериальныеРесурсы) Тогда
		ЭтотОбъект.МатериальныеРесурсы.Очистить();
		упоПроектыИЗадачиОбщие.ОчиститьСтрокиРаспределенияПоПодразделениям(ЭтотОбъект.РаспределениеПотребностей, 
			ЭтотОбъект.РаспределениеРасходовПоПериодам, "ИндексСтрокиРаспределениеПоРолям", 
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты"));
	КонецЕсли;
	Если Не СвойстваПроекта.ДоходыПоНатуральнымПоказателям И ЗначениеЗаполнено(ЭтотОбъект.Субпродукты) Тогда
		ЭтотОбъект.Субпродукты.Очистить();
		упоПроектыИЗадачиОбщие.ОчиститьСтрокиРаспределенияПоПодразделениям(ЭтотОбъект.РаспределениеОбъемов, 
			ЭтотОбъект.РаспределениеДоходовПоПериодам, "ИндексСтрокиРаспределениеПоРолям",
			ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.Объемы"));
	КонецЕсли;
	Если Не СвойстваПроекта.ПланироватьДополнительныеЗатратыПоЗадаче 
		И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеЗатраты) Тогда
		ЭтотОбъект.ДополнительныеЗатраты.Очистить();
		упоПроектыИЗадачиОбщие.ОчиститьСтрокиРаспределенияПоПодразделениям(ЭтотОбъект.РаспределениеДополнительныхЗатрат, 
			ЭтотОбъект.РаспределениеРасходовПоПериодам, "ИндексСтрокиРаспределениеПоРолям");
	КонецЕсли;
	Если Не СвойстваПроекта.ВедетсяБюджетДоходов И ЗначениеЗаполнено(ЭтотОбъект.ПланДоходов) Тогда
		ЭтотОбъект.ПланДоходов.Очистить();
		упоПроектыИЗадачиОбщие.ОчиститьСтрокиРаспределенияПоПодразделениям(ЭтотОбъект.РаспределениеДоходов, 
			ЭтотОбъект.РаспределениеДоходовПоПериодам, "ИндексСтрокиРаспределенияДоходов");
	КонецЕсли;
	Если Не СвойстваПроекта.ВедетсяБюджетРасходов И ЗначениеЗаполнено(ЭтотОбъект.ПланРасходов) Тогда
		ЭтотОбъект.ПланРасходов.Очистить();
		упоПроектыИЗадачиОбщие.ОчиститьСтрокиРаспределенияПоПодразделениям(ЭтотОбъект.РаспределениеРасходов, 
			ЭтотОбъект.РаспределениеРасходовПоПериодам, "ИндексСтрокиРаспределенияРасходов");
	КонецЕсли;
	Если Не СвойстваПроекта.ПланироватьТрудозатратыПоПроекту И ЗначениеЗаполнено(ЭтотОбъект.ТрудовыеРесурсы) Тогда
		ЭтотОбъект.ТрудовыеРесурсы.Очистить();
		ЭтотОбъект.ТрудовыеРесурсыПоПериодам.Очистить();
	КонецЕсли;
	Если Не СвойстваПроекта.ВедетсяБюджетДвиженияДенежныхСредств И ЗначениеЗаполнено(ЭтотОбъект.ДвиженияДенежныхСредств) Тогда
		ЭтотОбъект.ДвиженияДенежныхСредств.Очистить();
	КонецЕсли;

КонецПроцедуры

Процедура КонтрольВозможностиПроведенияПоСвойствам(РежимЗаписи, Отказ)
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ДанныеВерсииПолучены")
		И Не ДополнительныеСвойства.Свойство("ЭтоИнтерактивнаяЗапись") Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Проведение проектной задачи невозможно: данные версии не получены.'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьПредусловия()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого предусловие Из ПредусловияЗадачи Цикл
		Если НЕ ЗначениеЗаполнено(предусловие.ТипСвязи) Тогда
			предусловие.ТипСвязи = Перечисления.упоТипСвязи.ОкончаниеНачало;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(предусловие.ЕдиницаНормированияДлительности) Тогда
			предусловие.ЕдиницаНормированияДлительности = Справочники.упоЕдиницыВремени.Час;
		КонецЕсли;
		Если предусловие.СвязьМеждуПроектами Тогда
			ПроектСвязи = упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(предусловие.ЗадачаПредшественник, "Проект");
			Если ПроектСвязи = Проект Тогда
				предусловие.СвязьМеждуПроектами = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		предусловие.ЗадержкаВЧасах = предусловие.Задержка * предусловие.ЕдиницаНормированияДлительности.Коэффициент;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьТабличныеЧастиРаспределений(Отказ)
	
	// При записи из шаблона не проверяем заполнение и не добавляем лишние строки.
	Если НужноНеПроверятьЗаполнятьТабличныеЧастиРаспределений() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметрыОбработки = упоАналитикаПоПодразделениямКлиентСервер.ПараметрыОбработкиДанныхРаспределения(Ложь);
	упоАналитикаПоПодразделениямСервер.ПроверитьЗаполнитьТабличныеЧастиРаспределений(ЭтотОбъект, ДополнительныеПараметрыОбработки, 
		СвойстваПроекта,,Отказ);
	
КонецПроцедуры

Процедура ПоставитьПроектыПредусловийВОчередьПересчетаСроков(РежимЗаписи)
	
	ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов =
		Константы.упоАвтоматическийРасчетСроковСвязанныхПроектов.Получить();
	Если Не ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов Тогда
		Возврат;
	КонецЕсли;
	
	УпрощенноеСоздание = ЭтоСозданиеИзСтруктуры();
	ЭтоУдалениеПроектнойЗадачи = СвойствоСтруктуры(ДополнительныеСвойства, "УдалениеПроектнойЗадачи");
	Если НЕ УпрощенноеСоздание И ЗначениеЗаполнено(Ссылка) И (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ ЭтоУдалениеПроектнойЗадачи) Тогда
		упоРасчетКалендарныхСроковРедакция3Сервер.ПриИзмененииСроковЗадачНеобходимоПересчитатьПроекты(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатуДокумента(РежимЗаписи)
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	НеОбновлятьДатуДокумента = СвойствоСтруктуры(ДополнительныеСвойства, "НеОбновлятьДатуДокумента");
	Если НЕ НеОбновлятьДатуДокумента Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДлительностьМоделиПакетаРабот()
	
	Если ЭтоВеха Тогда
		ДлительностьМоделиПакетаРабот = 0;
	КонецЕсли;
	ДлительностьМоделиПакетаРаботВЧасах = ДлительностьМоделиПакетаРабот * ЕдиницаНормированияДлительности.Коэффициент;
	
КонецПроцедуры

Процедура ПрименитьПроектныеОпции()
	
	// При отключении проектных опций очищаем соответствующие ТЧ.
	ОчиститьДанныеПриОтключенииПроектныхОпций();
	
	ОбработатьНаследованиеОбъектаИзРодителя();
	
	СнятьФлагиТрансляцииПриОтключенииПроектныхОпций();
	
	ЗапомнитьПодразделениеОсновнойРоли();
	
КонецПроцедуры

Процедура ОбработатьНаследованиеОбъектаИзРодителя()
	
	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗадачаРодитель) Тогда
		Возврат;
	КонецЕсли;
	
	НаследоватьЗначениеПоляОбъектИзЗадачиРодителя = СвойстваПроекта.НаследоватьЗначениеПоляОбъектИзЗадачиРодителя;
	Если НаследоватьЗначениеПоляОбъектИзЗадачиРодителя Тогда
		Свойство = "Объект";
		ЭтотОбъект[Свойство] = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектнойЗадачи(ЗадачаРодитель, Свойство)[Свойство];
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВыводВСтатусОтчет()

	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("НеНужноДелатьПроверкуНаТипЗадачи")
		И (ДополнительныеСвойства.ЭтоНовый И Не ДополнительныеСвойства.Свойство("ЭтоИнтерактивнаяЗапись")) Тогда
		упоПроектыИЗадачиСервер.ЗаполнитьРеквизитВыводитьВСводныйСтатусОтчет(ТипПроектнойЗадачи, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапомнитьСвойстваНовогоДокумента()
	
	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДанныеВерсииПолучены", Истина);
	ДополнительныеСвойства.Вставить("ИспользоватьРодителяИзДокумента", Истина);
	
КонецПроцедуры

Процедура ЗапомнитьПодразделениеОсновнойРоли()

	Если Не СвойстваПроекта.НазначатьРСПОсновнойРолиКакРПЗ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		ИсходноеОсновноеПодразделение = Справочники.упоПодразделения.ПустаяСсылка();
	Иначе
		ИсходноеОсновноеПодразделение = ИсходноеПодразделениеОсновнойРоли();
	КонецЕсли;
	ТекущееОсновноеПодразделение = ТекущееПодразделениеОсновнойРоли();

	Если ИсходноеОсновноеПодразделение <> ТекущееОсновноеПодразделение Тогда
		ДополнительныеСвойства.Вставить("НазначитьРПЗИзПодразделения", ТекущееОсновноеПодразделение);
	КонецЕсли;
	
КонецПроцедуры

// Формирует список удаленной ПП для изменения статуса ПП при проведении ПЗ.
//
Процедура ЗапомнитьУдаленнуюПроектнуюПродукцию()
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	МодульупоПроектнаяПродукция = ОбщегоНазначения.ОбщийМодуль("упоПроектнаяПродукция");
	
	Если ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеПроверятьУдалениеПП") И ДополнительныеСвойства.НеПроверятьУдалениеПП Тогда
		Возврат;
	КонецЕсли;
	
	СубпродуктыТЧ = Субпродукты.ВыгрузитьКолонку("Ресурс");
	УдаленнаяПП = МодульупоПроектнаяПродукция.СписокУдаленныхПроектныхПродуктов(СубпродуктыТЧ, Ссылка, текущаяВерсия);
	ДополнительныеСвойства.Вставить("УдаленнаяПП", УдаленнаяПП);
	
КонецПроцедуры

Процедура ПоставитьПроектВОчередьПересчетаСроков(РежимЗаписи);
	
	УпрощенноеСоздание = ЭтоСозданиеИзСтруктуры();
	Если УпрощенноеСоздание Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтоУдалениеПроектнойЗадачи = СвойствоСтруктуры(ДополнительныеСвойства, "УдалениеПроектнойЗадачи");	
	ЭтоПроведениеУдалениеПроектнойЗадачи = ЗначениеЗаполнено(Ссылка) 
		И (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ ЭтоУдалениеПроектнойЗадачи);
		
	Если Не ЭтоПроведениеУдалениеПроектнойЗадачи Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НеобходимоПоставитьПроектВОчередьРасчетаСроков() Тогда
		Возврат;
	КонецЕсли;
	
	упоРасчетКалендарныхСроковРедакция3Сервер.ДобавитьВОчередьРасчетаСроковПроектов(ЭтотОбъект.Проект);
	
КонецПроцедуры

Функция НеобходимоПоставитьПроектВОчередьРасчетаСроков()
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Истина;
	КонецЕсли;

	Если ЭтотОбъект.РучнойВводСроков Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ИзменилисьСрокиПроектнойЗадачи() Тогда
		Возврат Ложь;
	КонецЕсли;

	Если упоРасчетКалендарныхСроковРедакция3Сервер.ПроектВОчередиРасчетаСроков(ЭтотОбъект.Проект) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если Не СвойстваПроекта.ЗапретитьРПЗИзменятьСрокиЧужихЗадач Тогда
		Возврат Истина;
	КонецЕсли;
	
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	РуководительПроекта = упоИерархияИПолномочияСервер.ПолучитьРуководителяПроекта(ЭтотОбъект.Проект);
	
	Если Пользователь = РуководительПроекта Тогда
		Возврат Истина;
	КонецЕсли;
	
	СписокСотрудниковДиспетчера = упоИерархияИПолномочияВызовСервера.обПолучитьСписокСотрудниковДиспетчера(
		Пользователь);
	ЭтоДиспетчер = СписокСотрудниковДиспетчера.НайтиПоЗначению(РуководительПроекта) <> Неопределено;
	
	Если ЭтоДиспетчер Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ИзменилисьСрокиПроектнойЗадачи()
	
	ИзменилисьСроки = Истина;
	
	СрокиПЗИзБазы = ПолучитьСроки();
	Если СрокиПЗИзБазы <> Неопределено
		И ЭтотОбъект.ДатаНачалаПлан = СрокиПЗИзБазы.ДатаНачала
		И ЭтотОбъект.ДатаЗавершенияПлан = СрокиПЗИзБазы.ДатаЗавершения Тогда
		ИзменилисьСроки = Ложь;
	КонецЕсли;
	
	Возврат ИзменилисьСроки;
	
КонецФункции

Процедура СнятьФлагиТрансляцииПриОтключенииПроектныхОпций()

	Если ЭтотОбъект.ВключитьДопЗатратыВПланРасходов И Не СвойстваПроекта.ПланироватьДополнительныеЗатратыПоЗадаче Тогда
		ЭтотОбъект.ВключитьДопЗатратыВПланРасходов = Ложь;
	КонецЕсли;
	Если ЭтотОбъект.ВключитьМатРесурсыВПланРасходов И Не СвойстваПроекта.ПланироватьЗатратыНаМатериалы Тогда
		ЭтотОбъект.ВключитьМатРесурсыВПланРасходов = Ложь;
	КонецЕсли;
	Если ЭтотОбъект.ВключитьСубпродуктыВПланДоходов И Не СвойстваПроекта.ДоходыПоНатуральнымПоказателям Тогда
		ЭтотОбъект.ВключитьСубпродуктыВПланДоходов = Ложь;
	КонецЕсли;	
	Если ЭтотОбъект.ВключитьТрудРесурсыВПланРасходов И Не СвойстваПроекта.ПланироватьТрудозатратыПоПроекту Тогда
		ЭтотОбъект.ВключитьТрудРесурсыВПланРасходов = Ложь;
	КонецЕсли;
	Если ЭтотОбъект.ВключитьПланДоходовВБДДС и Не СвойстваПроекта.ВедетсяБюджетДвиженияДенежныхСредств Тогда
		ЭтотОбъект.ВключитьПланДоходовВБДДС = Ложь;	
	КонецЕсли;
	Если ЭтотОбъект.ВключитьПланРасходовВБДДС и Не СвойстваПроекта.ВедетсяБюджетДвиженияДенежныхСредств Тогда
		ЭтотОбъект.ВключитьПланРасходовВБДДС = Ложь;	
	КонецЕсли;
	Если Не СвойстваПроекта.ВедетсяБюджетРасходов Тогда
		Если ЭтотОбъект.ВключитьПланРасходовВБДДС Тогда
			ЭтотОбъект.ВключитьПланРасходовВБДДС = Ложь;		
		КонецЕсли; 
		Если ЭтотОбъект.ВключитьМатРесурсыВПланРасходов Тогда
			ЭтотОбъект.ВключитьМатРесурсыВПланРасходов = Ложь;		
		КонецЕсли; 
		Если ЭтотОбъект.ВключитьДопЗатратыВПланРасходов Тогда
			ЭтотОбъект.ВключитьДопЗатратыВПланРасходов = Ложь;		
		КонецЕсли; 
		Если ЭтотОбъект.ВключитьТрудРесурсыВПланРасходов Тогда
			ЭтотОбъект.ВключитьТрудРесурсыВПланРасходов = Ложь;		
		КонецЕсли;
	КонецЕсли;
 	Если Не СвойстваПроекта.ВедетсяБюджетДоходов Тогда
		Если ЭтотОбъект.ВключитьПланДоходовВБДДС Тогда
			ЭтотОбъект.ВключитьПланДоходовВБДДС = Ложь;		
		КонецЕсли; 
		Если ЭтотОбъект.ВключитьСубпродуктыВПланДоходов Тогда
			ЭтотОбъект.ВключитьСубпродуктыВПланДоходов = Ложь;		
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьПроектнуюПродукциюВРегистрахСкопированнойЗадачи()
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗагрузитьДанныеИзРегистров") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРегистров = ЭтотОбъект.ДополнительныеСвойства.ЗагрузитьДанныеИзРегистров;
	
	ЕстьДанныеСубпродуктов = ДанныеРегистров.Свойство("упоДанныеПлановВыпускаСубпродуктов") 
		И ДанныеРегистров.упоДанныеПлановВыпускаСубпродуктов.Количество();
		
	Если Не ЕстьДанныеСубпродуктов Тогда
		Возврат;
	КонецЕсли;
		
	ЗаменяемаяСозданнаяПП = МодульупоПроектнаяПродукция.НоваяПроектнаяПродукцияДляКопируемойЗадачи(ЭтотОбъект.Ссылка, 
		ДанныеРегистров.упоДанныеПлановВыпускаСубпродуктов);
		
	Если Не ЗначениеЗаполнено(ЗаменяемаяСозданнаяПП) Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаменитьПроектнуюПродукциюВРегистреНаНовую(ДанныеРегистров.упоДанныеПлановВыпускаСубпродуктов,
		ЗаменяемаяСозданнаяПП, "Номенклатура");
	
	ЗаменитьПроектнуюПродукциюВРегистреНаНовую(ДанныеРегистров.упоАктуальныеПланыВыполненияОбъемов,
		ЗаменяемаяСозданнаяПП, "Номенклатура");
	
	ЗаменитьПроектнуюПродукциюВРегистреНаНовую(ДанныеРегистров.упоДанныеПроектнойПродукции,
		ЗаменяемаяСозданнаяПП, "ПроектнаяПродукция");
		
КонецПроцедуры

Процедура ЗаменитьПроектнуюПродукциюВРегистреНаНовую(ТаблицаРегистра, ЗаменяемаяСозданнаяПП, ИмяКолонкиПП)

	Для каждого СтрокаРегистра Из ТаблицаРегистра Цикл
		СозданнаяПП = ЗаменяемаяСозданнаяПП.Получить(СтрокаРегистра[ИмяКолонкиПП]); 
		СтрокаРегистра[ИмяКолонкиПП] = СозданнаяПП;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполнения

Функция ПолучитьСписокОшибокЗаполненияПроектнойПродукции()
	
	Ошибки = Неопределено;
	
	Если ТипСубпродукта <> ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
		Возврат Ошибки;
	КонецЕсли;
	
	ОбработанныеРесурсыОбъемов = Новый Соответствие;
	ИсточникОбъемы = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаТрудозатратРолей.Объемы");
	
	ШаблонОшибки = нСтр("ru='Для транслируемого из проектной продукции ресурса ""%1"" в строке №%2 уже указаны трудозатраты по подразделению ""%3"".'", "ru");
	
	Для Каждого СтрокаТрудовойРесурс Из ТрудовыеРесурсы Цикл
		
		Если СтрокаТрудовойРесурс.ИсточникПлана <> ИсточникОбъемы Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбработанныеРесурсыОбъемов[СтрокаТрудовойРесурс.Ресурс] = Неопределено Тогда
			ОбработанныеРесурсыОбъемов.Вставить(СтрокаТрудовойРесурс.Ресурс, СтрокаТрудовойРесурс.Подразделение);
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, 
				СтрокаТрудовойРесурс.Ресурс, СтрокаТрудовойРесурс.НомерСтроки, ОбработанныеРесурсыОбъемов[СтрокаТрудовойРесурс.Ресурс]);
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"ТрудовыеРесурсы[%1].Ресурс",
				ТекстОшибки, 
				"ТрудовыеРесурсы",
				СтрокаТрудовойРесурс.НомерСтроки,
				ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции //

Функция ПроверяемыеТабличныеЧастиПоПроектнымОпциямИСвойствам()
	
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ЭтотОбъект.Проект);
	
	МассивПроверяемыхТЧ = Новый Массив;
	МассивПроверяемыхТЧ.Добавить("ПланРасходов");
	МассивПроверяемыхТЧ.Добавить("ТрудовыеРесурсы");
	МассивПроверяемыхТЧ.Добавить("ПланДоходов");
	МассивПроверяемыхТЧ.Добавить("ДвиженияДенежныхСредств");
	Если СвойстваПроекта.ДоходыПоНатуральнымПоказателям Тогда 
		МассивПроверяемыхТЧ.Добавить("РаспределениеОбъемов");
		Если ВключитьСубпродуктыВПланДоходов Тогда
			МассивПроверяемыхТЧ.Добавить("Субпродукты");
		КонецЕсли;
	ИначеЕсли СвойстваПроекта.ДоходыПоОбъемам Тогда
		МассивПроверяемыхТЧ.Добавить("РаспределениеДоходов");
	КонецЕсли;
	Если СвойстваПроекта.РасходыПоОбъемам Тогда 
		Если СвойстваПроекта.РасходыПоНатуральнымПоказателям Или ВключитьМатРесурсыВПланРасходов Тогда
			МассивПроверяемыхТЧ.Добавить("РаспределениеПотребностей");
		Иначе
			МассивПроверяемыхТЧ.Добавить("РаспределениеРасходов");
		КонецЕсли;
	КонецЕсли;
	Если СвойстваПроекта.ПланироватьЗатратыНаМатериалы И ВключитьМатРесурсыВПланРасходов Тогда
		МассивПроверяемыхТЧ.Добавить("МатериальныеРесурсы");
	КонецЕсли;
	Если СвойстваПроекта.ПланироватьДополнительныеЗатратыПоЗадаче И ВключитьДопЗатратыВПланРасходов Тогда
		МассивПроверяемыхТЧ.Добавить("ДополнительныеЗатраты");
		Если СвойстваПроекта.РасходыПоОбъемам И Не СвойстваПроекта.РасходыПоНатуральнымПоказателям Тогда
			МассивПроверяемыхТЧ.Добавить("РаспределениеДополнительныхЗатрат");
		КонецЕсли
	КонецЕсли;
	
	ПроверяемыеТЧ = Новый СписокЗначений;
	Для Каждого ПроверямаяТЧ Из МассивПроверяемыхТЧ Цикл
		ПроверяемыеТЧ.Добавить(ПроверямаяТЧ, 
			упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ПроверямаяТЧ));
	КонецЦикла;
	
	Возврат ПроверяемыеТЧ;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

мВалютаУправленческогоУчета = упоПроектноеБюджетированиеПовтИсп.ВалютаУправленческогоУчета();

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли