////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции панели показателей.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область НастройкаПоказателейДляКарточкиПроектов

// Формирует представление для настроек показателей карточек проекта
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - источник
//
Процедура СформироватьПредставлениеДляНастройкиПоказателейКарточекПроектов(ЭтаФорма) Экспорт 
		
	СформироватьПредставлениеНастройкиПоказателей(ЭтаФорма, 
													"упоНастройкаПоказателейДляКарточкиПроектовНастройка", 
													"упоНастройкаПоказателейДляКарточкиПроектов");
	
КонецПроцедуры

// Формирует представление для настроек показателей
//
// Параметры:
//  ЭтаФорма			 - Форма - источник
//  ИмяПоляНастройки	 - Строка
//  ИмяПоляПредставления - Строка
//
Процедура СформироватьПредставлениеНастройкиПоказателей(ЭтаФорма, ИмяПоляНастройки, ИмяПоляПредставления) Экспорт 
	
	ДанныеНастройки = ЭтаФорма[ИмяПоляНастройки];
	
	Если ТипЗнч(ДанныеНастройки) = Тип("Структура") 
		И ДанныеНастройки.Свойство("ИмяНастройки") Тогда
		ЭтаФорма[ИмяПоляПредставления] = ДанныеНастройки.ИмяНастройки + " (" + ДанныеНастройки.Пользователь + ")";
	Иначе 
		ЭтаФорма[ИмяПоляПредставления] = "";
	КонецЕсли;
	
КонецПроцедуры

// Возвращает массив типов по параметру тип ссылки
//
// Параметры:
//  ТипСсылки	 - ЛюбаяСсылка, Неопределено
//  СписокТипов	 - СписокЗачений Из Тип, Неопределено - список элементов Тип.
// 
// Возвращаемое значение:
//  Массив Из Тип
//
Функция ПолучитьМассивТиповПоТипуСсылки(ТипСсылки = Неопределено, СписокТипов = Неопределено) Экспорт
	
	Если ТипСсылки = Неопределено Тогда
		Если СписокТипов = Неопределено Тогда
			Возврат упоПанельПоказателейВызовСервера.ОписаниеТипаВсеСсылки();
		Иначе
			Возврат СписокТипов.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЕсли;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(ТипСсылки));
	Возврат МассивТипов;
	
КонецФункции

#КонецОбласти

#КонецОбласти
