
Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ДоступСКУД.ЗоныИТочкиДоступа КАК ИКТ_ДоступСКУДЗоныИТочкиДоступа
	|ГДЕ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.ТочкаДоступа.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИКТ_ЗоныДоступаТочкиДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ЗоныДоступа.ТочкиДоступа КАК ИКТ_ЗоныДоступаТочкиДоступа
	|ГДЕ
	|	ИКТ_ЗоныДоступаТочкиДоступа.Точка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	Выборка1 = ПакетыЗапроса[0].Выбрать();
	Пока Выборка1.Следующий() Цикл
		ЗаписьДоступСКУД = Выборка1.Ссылка.ПолучитьОбъект();
		МассивСтрок = ЗаписьДоступСКУД.ЗоныИТочкиДоступа.НайтиСтроки(Новый Структура("ТочкаДоступа",ЭтотОбъект.Ссылка));
		Для Каждого Стр Из МассивСтрок Цикл
			ЗаписьДоступСКУД.ЗоныИТочкиДоступа.Удалить(Стр);		
		КонецЦикла;
		ЗаписьДоступСКУД.Записать();
	КонецЦикла;
	Выборка2 = ПакетыЗапроса[1].Выбрать();
	Пока Выборка2.Следующий() Цикл
		ЗаписьЗоныДоступа = Выборка2.Ссылка.ПолучитьОбъект();
		МассивСтрок = ЗаписьЗоныДоступа.ТочкиДоступа.НайтиСтроки(Новый Структура("Точка",ЭтотОбъект.Ссылка));
		Для Каждого Стр Из МассивСтрок Цикл
			ЗаписьЗоныДоступа.ТочкиДоступа.Удалить(Стр);		
		КонецЦикла;
		ЗаписьЗоныДоступа.Записать();
	КонецЦикла;
	
КонецПроцедуры
