
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьРеквизитыНаФорму(); //<=ИКТ_Камалов_Добавил процедуру для новых реквизитов_01.11.25
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()
	//ИКТ_Камалов_Задача 11872_28.08.25<<
	НовыйЭлемент = Элементы.Вставить("ИКТ_Наценка", Тип("ПолеФормы"), Элементы.ГруппаПараметрыПраво, Элементы.НалогообложениеНДС);        
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 	= "Объект.ИКТ_Наценка";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ИКТ_НаценкаПриИзменении");
	Объект.ИКТ_Наценка = ?(Параметры.Ключ.Пустая(), 10, Объект.ИКТ_Наценка);
	
	НовыйЭлемент = Элементы.Вставить("ТоварыИКТ_ЦенаЗакупкиБезНДС", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыЦена);
	НовыйЭлемент.Заголовок		= "Цена закупки (ИКТ)";  //<=ИКТ_Новоселов_27.02.2026_Задача№16112 Переименование поля
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 	= "Объект.Товары.ИКТ_ЦенаЗакупкиБезНДС";
	
	НовыйЭлемент = Элементы.Вставить("ТоварыИКТ_Наценка", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыИКТ_ЦенаЗакупкиБезНДС);        
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 	= "Объект.Товары.ИКТ_Наценка";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ТоварыИКТ_НаценкаПриИзменении");
	
	//<<ИКТ_Новоселов_18.12.2025_Задача№11872 Добавление индикации наценки строки при отличии от общей наценки документа
	ЭлементОформленияНаценка = УсловноеОформление.Элементы.Добавить();
	мШрифт = Новый Шрифт(, , Истина);
	ЭлементОформленияНаценка.Оформление.УстановитьЗначениеПараметра("Шрифт",  мШрифт);
	ЭлементОформленияНаценка.ИдентификаторПользовательскойНастройки = "ТоварыИКТ_Наценка";
	
	ЭлементУсловияНаценка                = ЭлементОформленияНаценка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловияНаценка.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.ИКТ_Наценка");
	ЭлементУсловияНаценка.ПравоеЗначение = Объект.ИКТ_Наценка; 
	ЭлементУсловияНаценка.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	
	ОформляемоеПоле      = ЭлементОформленияНаценка.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыИКТ_Наценка");	
	//>>ИКТ_Новоселов_18.12.2025_Задача№11872
	
	НовыйЭлемент = Элементы.Вставить("ТоварыИКТ_ЗаказПоставщику", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыНоменклатураПартнера);        
	НовыйЭлемент.Вид 			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 	= "Объект.Товары.ИКТ_ЗаказПоставщику";
	
	НоваяКоманда = Команды.Добавить("ИКТ_ОткрытьПодборЗаказаПоставщику");
	НоваяКоманда.Действие = "ИКТ_ОткрытьПодборЗаказаПоставщику";
	
	Кнопка = Элементы.Вставить("ТоварыИКТ_ОткрытьПодборЗаказаПоставщику", Тип("КнопкаФормы"), Элементы.ТоварыГруппаЗаполнить, Элементы.ТоварыДополнитьМногооборотнойТарой);
	Кнопка.Заголовок = "Подбор по заказу поставщику (ИКТ)";
	Кнопка.ИмяКоманды = "ИКТ_ОткрытьПодборЗаказаПоставщику";
	//>>ИКТ_Камалов_28.08.25
	
//{[+] ИКТ №17434 (фрагмент ДОБАВЛЕН), Селиверстов Д.Н., <09.04.2026 16:30>
	ГруппаДопСоглашения = ЭтаФорма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"),ЭтаФорма);
	ГруппаДопСоглашения.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДопСоглашения.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДопСоглашения.ОтображатьЗаголовок = ЛОЖЬ;
	ГруппаДопСоглашения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ДополнительноеСоглашение", Тип("ПолеФормы"),ГруппаДопСоглашения);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ДополнительноеСоглашение";
	НовыйЭлемент.Заголовок = "Дополнительное соглашение";

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ДатаДополнительногоСоглашения", Тип("ПолеФормы"),ГруппаДопСоглашения);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ДатаДополнительногоСоглашения";
	НовыйЭлемент.Заголовок = "от";
//[+]} ИКТ №17434

КонецПроцедуры

//ИКТ_Камалов_Событие нового реквизита "НачалоВыбора" с вызовом формы выбора. Задача 6132_10.11.25<<
&НаКлиенте
Процедура ИКТ_ОткрытьПодборЗаказаПоставщику()
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОтборФормы = Новый Структура("Организация", Объект.Организация);
	ОтборФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("Отбор", ОтборФормы);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораЗаказовПоставщику", ЭтаФорма);
	
	мФорма = ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(мФорма.Список, "Ссылка", ПолучитьЗаказыПоставщикуТовары(), ВидСравненияКомпоновкиДанных.НеВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный, Новый УникальныйИдентификатор);
	
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИКТ_НаценкаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	//Если ТекущаяСтрока.ИКТ_Наценка <> Объект.ИКТ_Наценка Тогда
	//	Элемент.ЦветФона = WebЦвета.;
	//КонецЕсли;

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОбработатьСтрокуПриИзмененииНаценки(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_НаценкаПриИзменении(Элемент)
	
	ОбновитьУсловиеОформление();  //<=ИКТ_Новоселов_18.12.2025_Задача№11872
	Для каждого Строка из Объект.Товары Цикл
		Если Строка.ИКТ_Наценка = Объект.ИКТ_Наценка Тогда
			Продолжить
		КонецЕсли;
		Строка.ИКТ_Наценка = Объект.ИКТ_Наценка;
		ОбработатьСтрокуПриИзмененииНаценки(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

//<<ИКТ_Новоселов_18.12.2025_Задача№11872 Обновление условия условного оформления при изменении Наценки
&НаСервере
Процедура ОбновитьУсловиеОформление()
	Для каждого Элемент Из УсловноеОформление.Элементы Цикл
	    Если Элемент.ИдентификаторПользовательскойНастройки = "ТоварыИКТ_Наценка" Тогда
			Элемент.Отбор.Элементы[0].ПравоеЗначение = Объект.ИКТ_Наценка;		
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры // ОбновитьУсловиеОформление()
//>>ИКТ_Новоселов_18.12.2025_Задача№11872
	
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораЗаказовПоставщику(Значение, ДопПараметры) Экспорт
	
    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ПриЗакрытииФормыВыбораЗаказовПоставщикуНаСервере(Значение);
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект, Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	// ИКТ_Новоселов_Задача №11872_Доработан расчет итоговой суммы_26.11.2025<<
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");

	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	// >>ИКТ_Новоселов_Задача №11872_26.11.2025
	Если Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала") Тогда
		СтруктураДействий.Вставить("ЗаполнитьПодразделениеВСтрокеТЧ", Новый Структура("Подразделение", Объект.Подразделение));
	КонецЕсли;
	
	Для каждого ТекущаяСтрока из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ИКТ_ЗаказПоставщику) ИЛИ ЗначениеЗаполнено(ТекущаяСтрока.ВариантОбеспечения) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
		
		ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий,
			"ВариантОбеспечения,ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);		
	КонецЦикла;
	
	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
			
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииФормыВыбораЗаказовПоставщикуНаСервере(ЗаказыПоставщику) Экспорт
	Для каждого Заказ из ЗаказыПоставщику Цикл		
		Для каждого СтрокаЗаказа из Заказ.Товары Цикл
			НоваяСтрокаТЧ = Объект.Товары.Добавить();
			НоваяСтрокаТЧ.Номенклатура = СтрокаЗаказа.Номенклатура;
			НоваяСтрокаТЧ.ИКТ_ЦенаЗакупкиБезНДС = СтрокаЗаказа.Цена;
			НоваяСтрокаТЧ.ИКТ_Наценка = Объект.ИКТ_Наценка;
			НоваяСтрокаТЧ.Количество = СтрокаЗаказа.Количество;
			НоваяСтрокаТЧ.КоличествоУпаковок = СтрокаЗаказа.КоличествоУпаковок;
			НоваяСтрокаТЧ.Цена = НоваяСтрокаТЧ.ИКТ_ЦенаЗакупкиБезНДС * (1 + (НоваяСтрокаТЧ.ИКТ_Наценка)/100);
			НоваяСтрокаТЧ.ИКТ_ЗаказПоставщику = Заказ;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуПриИзмененииНаценки(Строка)
	Если Строка.ИКТ_Наценка <> 0 Тогда
		Строка.Цена = Строка.ИКТ_ЦенаЗакупкиБезНДС * (1 + (Строка.ИКТ_Наценка)/100);
	КонецЕсли;
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	ОчиститьСообщения();

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиЗаполнениеКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказыПоставщикуТовары()
	ТаблицаЗначенийЗаказыПоставщику = Объект.Товары.Выгрузить(, "ИКТ_ЗаказПоставщику");
	ТаблицаЗначенийЗаказыПоставщику.Свернуть("ИКТ_ЗаказПоставщику");
	МассивЗаказыПоставщику = ТаблицаЗначенийЗаказыПоставщику.ВыгрузитьКолонку("ИКТ_ЗаказПоставщику");
	
	Возврат МассивЗаказыПоставщику;
КонецФункции
//>>ИКТ_Камалов_10.11.25 
