////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для печати шаблонов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует дерево значений с реквизитами и допреквизитами документа указанного типа.
//
// Возвращаемое значение:
//  ДеревоЗначений - дерево значений с реквизитами документа:
//	 * Наименование		- Строка - Имя объекта.
//	 * Представление	- Строка - Строковое представление объекта
//	 * Тип				- Строка - Тип объекта (Реквизит, ТабличнаяЧасть, ДопРеквизит).
//
Функция ЗаполнитьДеревоРеквизитовДляВыбора() Экспорт
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипКартинка = Новый ОписаниеТипов("Картинка");
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Наименование", ТипСтрока);
	Дерево.Колонки.Добавить("Представление", ТипСтрока);
	Дерево.Колонки.Добавить("Тип", ТипСтрока);
	Дерево.Колонки.Добавить("Картинка", ТипКартинка);
	Дерево.Колонки.Добавить("ПолноеИмя", ТипСтрока);
	
	МассивТиповОбъектовМетаданных = Новый Массив;
	МассивТиповОбъектовМетаданных.Добавить("Документы");	
	МассивТиповОбъектовМетаданных.Добавить("Справочники");      
	
	Для каждого ТипОбъектаМетаданных Из МассивТиповОбъектовМетаданных Цикл
		
		МетаТип = Метаданные[ТипОбъектаМетаданных];
		
		СтрокаДереваТип = Дерево.Строки.Добавить();
		СтрокаДереваТип.Наименование = ТипОбъектаМетаданных;
		СтрокаДереваТип.Представление = ТипОбъектаМетаданных;
		СтрокаДереваТип.Картинка = БиблиотекаКартинок[Лев(ТипОбъектаМетаданных, СтрДлина(ТипОбъектаМетаданных) - 1)];
		
		Для Каждого МетаОбъект Из МетаТип Цикл
			                                  
			СтрокаДереваОбъект = СтрокаДереваТип.Строки.Добавить();
			СтрокаДереваОбъект.Наименование = МетаОбъект.Имя;
			СтрокаДереваОбъект.Представление = МетаОбъект.Синоним;
			СтрокаДереваОбъект.Картинка = БиблиотекаКартинок[Лев(ТипОбъектаМетаданных, СтрДлина(ТипОбъектаМетаданных) - 1)];
			
			МетаРеквизиты = МетаОбъект.Реквизиты;
			МетаСтРеквизиты = МетаОбъект.СтандартныеРеквизиты;
			
			НоваяСтрокаРеквизиты = СтрокаДереваОбъект.Строки.Добавить();
			НоваяСтрокаРеквизиты.Наименование = "Реквизиты";
			НоваяСтрокаРеквизиты.Представление = "Реквизиты";
			НоваяСтрокаРеквизиты.Тип = "";
			
			Для Каждого МетаСтРеквизит Из МетаСтРеквизиты Цикл
				
				СтрокаДереваРеквизит = НоваяСтрокаРеквизиты.Строки.Добавить();
				СтрокаДереваРеквизит.Наименование = "Результат = Объект." + МетаСтРеквизит.Имя + ";";
				СтрокаДереваРеквизит.Представление = МетаСтРеквизит.Имя;
				СтрокаДереваРеквизит.Тип = "Реквизит";
				СтрокаДереваРеквизит.Картинка = ОпределитьКартинкуТипДанных(МетаСтРеквизит.Тип);
				СтрокаДереваРеквизит.ПолноеИмя = МетаОбъект.ПолноеИмя() + ".Реквизит." + МетаСтРеквизит.Имя;
				
			КонецЦикла;
			
			Для Каждого МетаРеквизит Из МетаРеквизиты Цикл
				
				СтрокаДереваРеквизит = НоваяСтрокаРеквизиты.Строки.Добавить();
				СтрокаДереваРеквизит.Наименование = "Результат = Объект." + МетаРеквизит.Имя + ";";
				СтрокаДереваРеквизит.Представление = МетаРеквизит.Синоним;
				СтрокаДереваРеквизит.Тип = "Реквизит";
				СтрокаДереваРеквизит.Картинка = ОпределитьКартинкуТипДанных(МетаРеквизит.Тип);
				СтрокаДереваРеквизит.ПолноеИмя = МетаРеквизит.ПолноеИмя();
				
			КонецЦикла;
			
			Попытка
				Если МетаОбъект.ТабличныеЧасти.Найти("ДополнительныеРеквизиты") <> Неопределено Тогда
					
					ТекстЗапросаДопРеквизиты =
						"""ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						||	ТаблицаСвойств.Свойство КАК Свойство,
						||	ТаблицаСвойств.Значение КАК Значение,
						||	ВЫБОР
						||		КОГДА ДополнительныеРеквизитыИСведения.МногострочноеПолеВвода > 0
						||			ТОГДА ТаблицаСвойств.ТекстоваяСтрока
						||		ИНАЧЕ """"""""
						||	КОНЕЦ КАК ТекстоваяСтрока
						||ИЗ
						||	[ИмяОбъектаСоСвойствами].ДополнительныеРеквизиты КАК ТаблицаСвойств
						||		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
						||		ПО ТаблицаСвойств.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
						||ГДЕ
						||	ТаблицаСвойств.Ссылка = &ВладелецСвойств
						||	И ТаблицаСвойств.Свойство = &Свойство""";
					
					ТекстВыполнитьОбработатьЗапрос = 
						"Запрос = Новый Запрос([ТекстЗапросаДопРеквизиты]);
						|Запрос.УстановитьПараметр(""ВладелецСвойств"", Объект);
						|УникальныйИдентификаторСвойства = Новый УникальныйИдентификатор(""[СтрокаУникальныйИдентификаторСвоства]"");
						|СсылкаСвойства = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(УникальныйИдентификаторСвойства);
						|Запрос.УстановитьПараметр(""Свойство"", СсылкаСвойства);
						|РезультатЗапроса = Запрос.Выполнить();
						|Если РезультатЗапроса.Пустой() Тогда
						|	Результат = Неопределено;
						|Иначе
						|	Выборка = РезультатЗапроса.Выбрать();
						|	Выборка.Следующий();
						|	Результат = Выборка.Значение;
						|КонецЕсли;
						|";
					
					УстановитьПривилегированныйРежим(Истина);
					
					Объект = Вычислить(ТипОбъектаМетаданных + "." + МетаОбъект.Имя + ?(ТипОбъектаМетаданных = "Справочники",
						".СоздатьЭлемент()", ".СоздатьДокумент()"));  
					НаборСвойств = УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(Объект);
					Если НаборСвойств.Количество() > 0 Тогда
						НоваяСтрокаДопРеквизиты = СтрокаДереваОбъект.Строки.Добавить();
						НоваяСтрокаДопРеквизиты.Наименование = "ДопРеквизиты";
						НоваяСтрокаДопРеквизиты.Представление = "Доп. реквизиты";
						НоваяСтрокаДопРеквизиты.Тип = "";
						Для Каждого ВложенныйНаборСвойств Из НаборСвойств Цикл
							НоваяСтрокаВложенныеДопРеквизиты = НоваяСтрокаДопРеквизиты.Строки.Добавить();
							НоваяСтрокаВложенныеДопРеквизиты.Наименование = ВложенныйНаборСвойств.Набор.Наименование;
							НоваяСтрокаВложенныеДопРеквизиты.Представление = ВложенныйНаборСвойств.Набор.Наименование;
							НоваяСтрокаВложенныеДопРеквизиты.Тип = "";    
							Для Каждого ДопРеквизит Из ВложенныйНаборСвойств.Набор.ДополнительныеРеквизиты Цикл
								
								КодПолученияДопРеквизита = "" + ТекстВыполнитьОбработатьЗапрос;
								КодПолученияДопРеквизита = СтрЗаменить(КодПолученияДопРеквизита, "[ТекстЗапросаДопРеквизиты]",
									ТекстЗапросаДопРеквизиты);
								КодПолученияДопРеквизита = СтрЗаменить(КодПолученияДопРеквизита, "[СтрокаУникальныйИдентификаторСвоства]",
									Строка(ДопРеквизит.Свойство.УникальныйИдентификатор()));
								КодПолученияДопРеквизита = СтрЗаменить(КодПолученияДопРеквизита, "[ИмяОбъектаСоСвойствами]",
									Объект.Метаданные().ПолноеИмя());
								
								НоваяСтрокаДопРеквизит = НоваяСтрокаВложенныеДопРеквизиты.Строки.Добавить();
								НоваяСтрокаДопРеквизит.Наименование = КодПолученияДопРеквизита;
								НоваяСтрокаДопРеквизит.Представление = ДопРеквизит.Свойство.Наименование;
								НоваяСтрокаДопРеквизит.Тип = "ДопРеквизит";
								НоваяСтрокаДопРеквизит.Картинка = ОпределитьКартинкуТипДанных(ДопРеквизит.Свойство.ТипЗначения);
								НоваяСтрокаДопРеквизит.ПолноеИмя = ДопРеквизит.Свойство.Наименование;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
					
					УстановитьПривилегированныйРежим(Ложь);		
				КонецЕсли;
			Исключение
				// у справочника может не быть ни одного настроенного доп.реквизита
			КонецПопытки;
			
			МетаТАбличныеЧасти = МетаОбъект.ТабличныеЧасти;
			
			НоваяСтрокаТЧ = СтрокаДереваОбъект.Строки.Добавить();
			НоваяСтрокаТЧ.Наименование = "ТабличныеЧасти";
			НоваяСтрокаТЧ.Представление = "Табличные части";
			НоваяСтрокаТЧ.Тип = "";
			НоваяСтрокаТЧ.Картинка = БиблиотекаКартинок.упоТабличнаяЧасть;
			
			Для Каждого МетаТЧ Из МетаТАбличныеЧасти Цикл
				
				Если МетаТЧ.Имя = "ДополнительныеРеквизиты" Или
					МетаТЧ.Имя = "ДополнительныеСведения" Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстЗапросаТЧ =
					"""ВЫБРАТЬ РАЗРЕШЕННЫЕ
					||	[ИмяТЧ].НомерСтроки КАК НомерСтроки";
				
				Для Каждого РеквизитТЧ Из МетаТЧ.Реквизиты Цикл
					ТекстЗапросаТЧ = ТекстЗапросаТЧ +
					"
					||	,[ИмяТЧ]." + РеквизитТЧ.Имя + " КАК " + РеквизитТЧ.Имя + " //" + РеквизитТЧ.Синоним;
				КонецЦикла;
				
				ТекстЗапросаТЧ = ТекстЗапросаТЧ +
					"
					||ИЗ
					||	[ИмяОбъекта].[ИмяТЧ] КАК [ИмяТЧ]
					||ГДЕ
					||	[ИмяТЧ].Ссылка = &Ссылка""";
				
				ТекстВыполнитьОбработатьЗапрос = 
					"Запрос = Новый Запрос([ТекстЗапросаТЧ]);
					|Запрос.УстановитьПараметр(""Ссылка"", Объект);
					|РезультатЗапроса = Запрос.Выполнить();
					|Результат = РезультатЗапроса.Выгрузить();
					|";
				
				КодПолученияТЧ = "" + ТекстВыполнитьОбработатьЗапрос;
				КодПолученияТЧ = СтрЗаменить(КодПолученияТЧ, "[ТекстЗапросаТЧ]", ТекстЗапросаТЧ);
				КодПолученияТЧ = СтрЗаменить(КодПолученияТЧ, "[ИмяОбъекта]", МетаОбъект.ПолноеИмя());
				КодПолученияТЧ = СтрЗаменить(КодПолученияТЧ, "[ИмяТЧ]", МетаТЧ.Имя);
				
				СтрокаДереваРеквизит = НоваяСтрокаТЧ.Строки.Добавить();
				СтрокаДереваРеквизит.Наименование = КодПолученияТЧ;
				СтрокаДереваРеквизит.Представление = МетаТЧ.Синоним;
				СтрокаДереваРеквизит.Тип = "ТабличнаяЧасть";
				СтрокаДереваРеквизит.Картинка = БиблиотекаКартинок.упоТабличнаяЧасть;
				СтрокаДереваРеквизит.ПолноеИмя = МетаТЧ.ПолноеИмя();
				
			КонецЦикла;
			
		КонецЦикла;
 
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьКартинкуТипДанных(ТипДанных)

	Картинка = БиблиотекаКартинок.упоТипДанных_Любой;
	
	Если ТипДанных.Типы().Количество() > 1 Тогда
		Возврат Картинка;
	КонецЕсли;
	
	Если ТипДанных.СодержитТип(Тип("Булево")) Тогда      
		Картинка = БиблиотекаКартинок.упоТипДанных_Булево;
	ИначеЕсли ТипДанных.СодержитТип(Тип("Дата")) Тогда      
		Картинка = БиблиотекаКартинок.упоТипДанных_Дата;
	ИначеЕсли ТипДанных.СодержитТип(Тип("Число")) Тогда      
		Картинка = БиблиотекаКартинок.упоТипДанных_Число;	
	КонецЕсли; 
	
	Возврат Картинка;

КонецФункции

#КонецОбласти