////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с проектами и задачами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обрабатывает установку текущего проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - установленный проект.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ОбработатьУстановкуТекущегоПроекта(Проект) Экспорт
	
	Если Проект.ЭтоПроектнаяЗадача Тогда
		Возврат Ложь;
	Иначе
		
		ПараметрыСеанса.упоТекущийПроект = Проект;
		ХранилищеОбщихНастроек.Сохранить("упоТекущийПроект", , Проект, "Текущий проект");
		
		Возврат Истина;
		
	КонецЕсли; 
	
КонецФункции 

// Запись программы проектов в проекте
//
// Параметры:
//  Проект				 - СправочникСсылка.Проекты				 - проект.
//  ПрограммаПроектов	 - СправочникСсылка.упоПрограммыПроектов - программа.
//
Процедура ЗаписатьПрограммуПроектовВПроекте(Проект, ПрограммаПроектов) Экспорт
	
	Объект = Проект.ПолучитьОбъект();
	Объект.ПрограммаПроектов = ПрограммаПроектов;
	Объект.Записать();
	
КонецПроцедуры

#Область ПолучениеПолныхДанныхСтруктурыПроектаИзБД

// Функция возвращает рабочий календарь проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - заданный проект.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоРабочиеКалендари, Неопределено - нет сведений о календаре на запрашиваемый год.
//
Функция ПолучитьКалендарьПроекта(Проект) Экспорт
	
	Календарь = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект" , Проект);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.КалендарьПроекта КАК Календарь
		|ИЗ
		|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Календарь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Календарь;
	
КонецФункции

// Функция возвращает банковский календарь проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проект.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоРабочиеКалендари, Неопределено - нет сведений о календаре на запрашиваемый год.
//
Функция ПолучитьБанковскийКалендарьПроекта(Проект) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА Рег.КалендарьБанковскихДней ЕСТЬ NULL 
		|			ТОГДА Рег.КалендарьПроекта
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Рег.КалендарьБанковскихДней = &ПустойКалендарь
		|					ТОГДА Рег.КалендарьПроекта
		|				ИНАЧЕ Рег.КалендарьБанковскихДней
		|			КОНЕЦ
		|	КОНЕЦ КАК Календарь
		|ИЗ
		|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	ПараметрыЗапроса = Новый Структура("Проект,ПустойКалендарь", Проект, Справочники.упоРабочиеКалендари.ПустаяСсылка());
	
	Результат = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	Если Результат.Пустой() Тогда
		Возврат Неопределено; // Нет сведений.
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Календарь;
	
КонецФункции

// Функция возвращает все календари проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - заданный проект.
// 
// Возвращаемое значение:
//  Структура - содержит календари проекта.
//
Функция ПолучитьКалендариПроекта(Проект) Экспорт
	
	КалендариПроекта = Новый Структура;
	КалендариПроекта.Вставить("Банковский", Неопределено);
	КалендариПроекта.Вставить("Рабочий", Неопределено);
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.упоКалендариПроектов) Тогда
		Возврат КалендариПроекта;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект" , Проект);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.КалендарьПроекта КАК Рабочий,
		|	ЕСТЬNULL(Рег.КалендарьБанковскихДней, Рег.КалендарьПроекта) КАК Банковский
		|ИЗ
		|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат КалендариПроекта;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(КалендариПроекта, Выборка);
	
	Возврат КалендариПроекта;
	
КонецФункции

// Получает статус проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - проект, для которого нужно получить статус.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.упоСостояниеСтатусаПроекта - статус.
//
Функция ПолучитьСтатусПроекта(Проект) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.упоСтатусыПроектов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект" , Проект);
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	Рег.СтатусПроекта КАК СтатусПроекта
		|ИЗ
		|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СтатусПроекта;
	
КонецФункции 

// Возвращает текущую дату старта проекта.
//
// Параметры:
//  Проект					 - СправочникСсылка.Проекты	 - проект.
//  ЗаполнятьПустуюТекущей	 - Булево	 - возвращать текущую дату, если не удалось определить дату старта.
//  Версия					 - ДокументСсылка.упоВерсияПланаПроекта - версия проекта.
// 
// Возвращаемое значение:
//  Дата - дата старта проекта.
//
Функция ДатаСтартаПроекта(Проект, ЗаполнятьПустуюТекущей = Ложь, Знач Версия = Неопределено) Экспорт
	
	ДатаСтарта = Дата(1,1,1);
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.упоСвойстваПроектов) Тогда
		Возврат ДатаСтарта;
	КонецЕсли;
	
	Если Версия = Неопределено Тогда
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Версия) Тогда
		Возврат ДатаСтарта;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСвойстваПроектов.ДатаСтарта КАК ДатаСтарта
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектов.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И Проект = &Проект) КАК упоСвойстваПроектов";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДатаСтарта = Выборка.ДатаСтарта;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСтарта) Тогда
		СрокиПроекта = ПолучитьПланируемыеСрокиПроекта(Проект, Версия);
		ДатаСтарта = СрокиПроекта.ДатаНачалаПлан;
	КонецЕсли;
	
	Если ЗаполнятьПустуюТекущей И НЕ ЗначениеЗаполнено(ДатаСтарта) Тогда
		ДатаСтарта = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ДатаСтарта;
	
КонецФункции

// Возвращает метод оперативного планирования проекта.
//
// Параметры:
//  Проект	- СправочникСсылка.Проекты - Проект.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.упоМетодОперативногоПланирования, Неопределено - метод оперативного планирования проекта.
//
Функция МетодОперативногоПланированияПроекта(Проект) Экспорт
	
	МетодОперативногоПланирования = Неопределено;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.упоКалендариПроектов) Тогда
		Возврат МетодОперативногоПланирования; // Нет сведений.
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Рег.МетодОперативногоПланирования
			|ИЗ
			|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	Запрос.УстановитьПараметр("Проект", Проект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		МетодОперативногоПланирования = Выборка.МетодОперативногоПланирования;
	КонецЕсли;
	
	Возврат МетодОперативногоПланирования;
	
КонецФункции

// Возвращает календарь по иерархии объектов ДДС.
//
// Параметры:
//  ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу. 
// 
// Возвращаемое значение:
//   СправочникСсылка.упоРабочиеКалендари, Неопределено - нет сведений о календаре на запрашиваемый год. 
//
Функция КалендарьПоИерархииОбъектовДДС(ПроектнаяЗадача, Проект = Неопределено) Экспорт
	
	ПроектДляПоискаКалендаря = Проект;
	
	Если ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		Календарь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "КалендарьЗадачи");
		
		Если ЗначениеЗаполнено(Календарь) Тогда
			Возврат Календарь;
		КонецЕсли;
		
		ПроектДляПоискаКалендаря = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
	КонецЕсли;
	
	Календарь = упоПроектыИЗадачиСервер.ПолучитьБанковскийКалендарьПроекта(ПроектДляПоискаКалендаря);
	
	Если ЗначениеЗаполнено(Календарь) Тогда
		Возврат Календарь;
	КонецЕсли;
	
	Календарь = упоПроектыИЗадачиСервер.ПолучитьКалендарьПроекта(ПроектДляПоискаКалендаря);
	
	Возврат Календарь;
	
КонецФункции

#КонецОбласти

#Область ПолученияОтдельныхСведенийОПроектнойЗадаче

// Функция получает последние сведения о названии заданной проектной задачи.
//
// Параметры:
//  Задача						 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
//  ДобавитьРасшифровкуДокумента - Булево
// 
// Возвращаемое значение:
//  Строка, Неопределено - название задачи. Неопределено, если не найдено.
//
Функция НазваниеПроектнойЗадачи(Задача, ДобавитьРасшифровкуДокумента = Ложь, ДобавитьКодСДР = Ложь) Экспорт
	
	НазваниеЗадачи = "";
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА Рег.НазваниеЗадачи > """"
	               |			ТОГДА Рег.НазваниеЗадачи
	               |		ИНАЧЕ Рег.ПроектнаяЗадача.НазваниеПроектнойЗадачи
	               |	КОНЕЦ КАК НазваниеЗадачи,
	               |	ВЫБОР
	               |		КОГДА &ДобавитьРасшифровкуДокумента
	               |			ТОГДА ПРЕДСТАВЛЕНИЕ(Рег.ПроектнаяЗадача)
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ПредставлениеДокумента,
	               |	ЕСТЬNULL(Проекты.КодСДР, """") КАК КодСДР
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, &УсловиеОтбораЗадачи) КАК Рег
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО Рег.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	               |			И (&ДобавитьКодСДР)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО Рег.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)";
	
	Если ТипЗнч(Задача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда 
		УсловиеОтбораЗадачи = "ПроектнаяЗадача = &Задача";
	ИначеЕсли ТипЗнч(Задача) = Тип("СправочникСсылка.Проекты") Тогда
		УсловиеОтбораЗадачи = "ПроектнаяЗадача В
				               |(ВЫБРАТЬ
				               |	Проекты.СсылкаНаПроектнуюЗадачу КАК Ссылка
				               |ИЗ
				               |	Справочник.Проекты КАК Проекты
				               |ГДЕ
				               |	Проекты.Ссылка = &Задача)";
	Иначе
		Возврат НазваниеЗадачи;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораЗадачи", УсловиеОтбораЗадачи);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДобавитьРасшифровкуДокумента", ДобавитьРасшифровкуДокумента);
	Запрос.УстановитьПараметр("ДобавитьКодСДР", ДобавитьКодСДР);
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НазваниеЗадачи = НСтр("ru = '(задачи нет в текущей версии)'"); 
		Возврат НазваниеЗадачи;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если ДобавитьКодСДР Тогда
		НазваниеЗадачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1, %2",
			Выборка.КодСДР,
			Выборка.НазваниеЗадачи);
	Иначе
		НазваниеЗадачи = Выборка.НазваниеЗадачи;
	КонецЕсли;
	
	Если ДобавитьРасшифровкуДокумента Тогда
		НазваниеЗадачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"""%1"" (%2)",
			НазваниеЗадачи,
			Выборка.ПредставлениеДокумента);
	КонецЕсли;
	
	Возврат НазваниеЗадачи;
	
КонецФункции
 
// Функция - получает названия с кодом СДР проектных задач текущей версии проекта.
//
// Параметры:
//  ПроектныеЗадачи	 - Массив	 - массив документов типа ДокументСсылка.упоПроектнаяЗадача
// 
// Возвращаемое значение:
//  Соответствие - соответствие проектных задач и их названий
//
Функция НазванияПроектныхЗадач(ПроектныеЗадачи, ДобавитьРасшифровкуДокумента = Ложь) Экспорт
	
	НазванияПроектныхЗадач = Новый Соответствие;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СвойстваЗадач.НазваниеЗадачи КАК НазваниеЗадачи,
	               |	СвойстваЗадач.ПроектнаяЗадача КАК СсылкаНаПроектнуюЗадачу,
	               |	Проекты.КодСДР КАК КодСДР,
	               |	ПРЕДСТАВЛЕНИЕ(СвойстваЗадач.ПроектнаяЗадача) КАК ПредставлениеДокумента
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК СвойстваЗадач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
	               |		ПО СвойстваЗадач.Версия = Версии.Версия
	               |			И (Версии.Текущая)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО СвойстваЗадач.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу";
	
	Если Не ДобавитьРасшифровкуДокумента Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПРЕДСТАВЛЕНИЕ(СвойстваЗадач.ПроектнаяЗадача)", "Неопределено");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если ДобавитьРасшифровкуДокумента Тогда
		ШаблонНаименования = "%1, %2 (%3)";
		Пока Выборка.Следующий() Цикл
			НазваниеЗадачи = СтрШаблон(ШаблонНаименования, Выборка.КодСДР, Выборка.НазваниеЗадачи, Выборка.ПредставлениеДокумента);
			НазванияПроектныхЗадач.Вставить(Выборка.СсылкаНаПроектнуюЗадачу, НазваниеЗадачи);
		КонецЦикла;
	Иначе
		ШаблонНаименования = "%1, %2";
		Пока Выборка.Следующий() Цикл
			НазваниеЗадачи = СтрШаблон(ШаблонНаименования, Выборка.КодСДР, Выборка.НазваниеЗадачи);
			НазванияПроектныхЗадач.Вставить(Выборка.СсылкаНаПроектнуюЗадачу, НазваниеЗадачи);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НазванияПроектныхЗадач;
	
КонецФункции

// Производит поиск связанных элементов проекта по "зеркальным" элементам.
//
// Параметры:
//  ВхДанные		 - ДокументСсылка.ПроектнаяЗадача, СправочникСсылка.Проекты, Массив	 - исходные данные для поиска.
//  ВернутьТаблицу	 - Булево - флаг указывает на необходиомость вернуть результат
//  	в виде таблицы значений.
// 
// Возвращаемое значение:
//  ДокументСсылка.ПроектнаяЗадача, СправочникСсылка.Проекты, ТаблицаЗначений, Неопределено - найденные данные.
//
Функция НайтиСвязанныйЭлементПроекта(ВхДанные, ВернутьТаблицу = Ложь, ВернутьСоответствие = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ВхДанные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Определяем тип исходного объекта и направление для поиска.
	
	ЭтоМассив = Ложь;
	ЭтоСправочник = Ложь;
	ЭтоТекущиеДанныеСписка = (ТипЗнч(ВхДанные) = Тип("ТекущиеДанныеСписка"));	
	
	Если ВернутьСоответствие Тогда
		РезультатСоответствие = Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда
		ЭтоМассив = Истина;
		Если ТипЗнч(ВхДанные[0]) = Тип("СправочникСсылка.Проекты") Тогда
			ЭтоСправочник = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("СправочникСсылка.Проекты") Или (ЭтоТекущиеДанныеСписка
		И ТипЗнч(ВхДанные.Ссылка) = Тип("СправочникСсылка.Проекты")) Тогда
		
		ЭтоСправочник = Истина;
		
	КонецЕсли; 

	Если НЕ ЭтоСправочник Тогда
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Проекты.СсылкаНаПроектнуюЗадачу КАК ДокументСсылка,
			|	Проекты.Ссылка КАК СправочникСсылка
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	НЕ Проекты.СсылкаНаПроектнуюЗадачу = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
			|	И Проекты.СсылкаНаПроектнуюЗадачу " + ?(ЭтоМассив, " В (&Список) ", " = &Список ");
	Иначе
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Проекты.Ссылка КАК СправочникСсылка,
			|	Проекты.СсылкаНаПроектнуюЗадачу КАК ДокументСсылка
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Ссылка "+?(ЭтоМассив," В (&Список)"," = &Список ");
	КонецЕсли; 
	
	ПараметрыЗапроса = Новый Структура();
	
	Если ЭтоМассив Тогда
		ПараметрыЗапроса.Вставить("Список", ВхДанные);
	Иначе
		ПараметрыЗапроса.Вставить("Список", ?(ЭтоТекущиеДанныеСписка,ВхДанные.Ссылка,ВхДанные));
	КонецЕсли; 
	
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	Если РезультатЗапроса.Пустой() Тогда
		Если ВернутьСоответствие Тогда
			Возврат РезультатСоответствие;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли; 
	
	ИмяКолонкиРезультата = "СправочникСсылка";
	ИмяИсходнойКолонки = "ДокументСсылка";
	Если ЭтоСправочник Тогда
		ИмяКолонкиРезультата = "ДокументСсылка";
		ИмяИсходнойКолонки = "СправочникСсылка";
	КонецЕсли;
	
	Если ЭтоМассив Тогда
		Если ВернутьСоответствие Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				РезультатСоответствие.Вставить(Выборка[ИмяИсходнойКолонки], Выборка[ИмяКолонкиРезультата]);
			КонецЦикла;
			Возврат РезультатСоответствие;
		ИначеЕсли ВернутьТаблицу Тогда
			Возврат РезультатЗапроса.Выгрузить();
		Иначе
			Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(ИмяКолонкиРезультата);
		КонецЕсли;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка[ИмяКолонкиРезультата];
	КонецЕсли; 
	
КонецФункции

// Формирует структуру необходимых данных по проектным задачам.
//
// Параметры:
//  ВхПараметр			 - СправочникСсылка.Проекты, Массив, СписокЗначений	 - собираются данные по всем задачам проекта
//  	или по заданным задачам проекта.
//  НужныеТаблицы		 - Структура										 - содержащая список необходимых таблиц для выгрузки
//  	 По умолчанию: получаем все данные.
//  ВключаяЗануленные	 -  Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначенй - сформированная структура данных.
//
Функция ПолучитьДанныеПроектнойЗадачи(ВхПараметр, НужныеТаблицы = Неопределено, ВключаяЗануленные = Ложь) Экспорт
	
	Если НужныеТаблицы = Неопределено Тогда
		НужныеТаблицы = Новый Структура("ДанныеЗадачи,
										|ОтветственнаяРоль,
										|Ресурсы,
										|ТрудовыеРесурсыТЧ,
										|ПредУсловия,
										|Длительность,
										|Руководитель");
	КонецЕсли;
	
	ВозможныЗадачиРазныхПроектов = Ложь;
	
	Если ТипЗнч(ВхПараметр) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Проект = ВхПараметр.Проект;
		СписокПроектныхЗадач = Новый Массив;
		СписокПроектныхЗадач.Добавить(ВхПараметр);
		ВидОперации = 0; // Получаем данные только для одной задачи.
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("Массив") Или ТипЗнч(ВхПараметр) = Тип("СписокЗначений") Тогда
		ВозможныЗадачиРазныхПроектов = Истина;
		Проект = Неопределено;
		// Преобразуем список значений в массив (необходимо для операций поиска ниже)
		Если ТипЗнч(ВхПараметр) = Тип("СписокЗначений") Тогда 		
			СписокПроектныхЗадач = ВхПараметр.ВыгрузитьЗначения();
		Иначе
			СписокПроектныхЗадач = ВхПараметр;                   
		КонецЕсли;
		ВидОперации = 1; // Получаем данные для списка задач.
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = ВхПараметр;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Проект", Проект);
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	упоВерсииПроекта.Версия КАК Версия
			|ПОМЕСТИТЬ ТекущаяВерсияПроекта
			|ИЗ
			|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
			|ГДЕ
			|	упоВерсииПроекта.Проект = &Проект
			|	И упоВерсииПроекта.Текущая
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Рег.ПроектнаяЗадача КАК ПроектнаяЗадача
			|ИЗ
			|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
			|			,
			|			Версия В
			|				(ВЫБРАТЬ
			|					ТекущаяВерсияПроекта.Версия КАК Версия
			|				ИЗ
			|					ТекущаяВерсияПроекта КАК ТекущаяВерсияПроекта)) КАК Рег
			|ГДЕ
			|	НЕ Рег.ЗадачаОтменена";
		СписокПроектныхЗадач = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
		ВидОперации = 1; // Получаем данные для списка задач.
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокЗадач", СписокПроектныхЗадач);
	Запрос.УстановитьПараметр("ВключаяЗануленные", ВключаяЗануленные);
	
	Если НЕ ВозможныЗадачиРазныхПроектов Тогда
		текВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
		Запрос.УстановитьПараметр("текВерсия", текВерсия);
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	МАКСИМУМ(упоВерсииПроекта.Версия) КАК Версия,
		               |	упоПроектнаяЗадача.Проект
		               |ПОМЕСТИТЬ втТекущиеВерсии
		               |ИЗ
		               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |		ПО упоПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
		               |ГДЕ
		               |	упоВерсииПроекта.Текущая
		               |	И упоПроектнаяЗадача.Ссылка В(&СписокЗадач)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упоПроектнаяЗадача.Проект
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Версия";
		Запрос.Выполнить();	
		СтрокаПодменыВерсии = "Версия В (ВЫБРАТЬ втТекущиеВерсии.Версия ИЗ втТекущиеВерсии КАК втТекущиеВерсии)";
		СтрокаВерсии = "версия = &текверсия";
	КонецЕсли;
	
	Если НужныеТаблицы.Свойство("ДанныеЗадачи") Тогда
			
		Запрос.Текст = ТекстЗапросаВременнаяТаблицаПрогнозныеСроки(Истина)
			+ ОбщегоНазначения.РазделительПакетаЗапросов() + "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегСвойства.ПроектнаяЗадача.Проект КАК Проект,
			|	РегСвойства.ПроектнаяЗадача.Дата КАК Дата,
			|	РегСвойства.ПроектнаяЗадача КАК Ссылка,
			|	РегСвойства.Версия КАК ТекущаяВерсияПроекта,
			|	ВЫБОР
			|		КОГДА РегСвойства.НазваниеЗадачи <> """"
			|			ТОГДА РегСвойства.НазваниеЗадачи
			|		ИНАЧЕ РегСвойства.ПроектнаяЗадача.НазваниеПроектнойЗадачи
			|	КОНЕЦ КАК Наименование,
			|	РегСвойства.ЗадачаРодитель КАК Родитель,
			|	РегСвойства.ЭтоПакетРабот КАК ЭтоПакетРабот,
			|	РекКоды.КодСДР КАК КодСДР,
			|	РегСтатусы.СтатусЗадачи КАК Статус,
			|	РегГотовности.ПроцентГотовности КАК ПроцентГотовности,
			|	РегСвойства.КрайнийСрок КАК КрайнийСрок,
			|	РегСрокиПлан.ДатаНачалаПлан КАК ДатаНачалаПлан,
			|	РегПрогСроки.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
			|	РегПрогСроки.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
			|	РегПрогСроки.СтатусСроков КАК СтатусСроков,
			|	РегСвойства.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
			|	РегСвойства.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
			|	РегСвойства.ВидОперации КАК ВидОперации,
			|	РегСвойства.КалендарьЗадачи КАК КалендарьЗадачи,
			|	РегСвойства.ПодчиненныйПроект КАК ПодчиненныйПроект,
			|	РегСвойства.СуммаСанкцийЗаДеньЗадержки КАК СуммаСанкцийЗаДеньЗадержки,
			|	РегСрокиПлан.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
			|	РегСрокиРасчет.ДатаРаннегоСтарта КАК ДатаРаннегоСтарта,
			|	РегСрокиРасчет.ДатаПозднегоСтарта КАК ДатаПозднегоСтарта,
			|	РегСрокиРасчет.ДатаРаннегоФиниша КАК ДатаРаннегоФиниша,
			|	РегСрокиРасчет.ДатаПозднегоФиниша КАК ДатаПозднегоФиниша,
			|	ЕСТЬNULL(РегСвойства.ЭтоМодельПакетаРабот, ЛОЖЬ) КАК ЭтоМодельПакетаРабот,
			|	ЕСТЬNULL(РегСвойства.ЭтоВеха, ЛОЖЬ) КАК ЭтоВеха,
			|	ЕСТЬNULL(РегСвойства.ПланироватьТрудозатратыНаИсполнителей, ЛОЖЬ) КАК ПланироватьТрудозатратыНаИсполнителей,
			|	РегСвойства.ВключитьТрудРесурсыВПланРасходов КАК ВключитьТрудРесурсыВПланРасходов,
			|	ВЫБОР
			|		КОГДА РегСвойства.УровеньПланированияТрудозатратДляБДР = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланированияТрудозатратДляБДР.пустаяСсылка)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоУровеньПланированияТрудозатратДляБДР.Авто)
			|		ИНАЧЕ РегСвойства.УровеньПланированияТрудозатратДляБДР
			|	КОНЕЦ КАК УровеньПланированияТрудозатратДляБДР,
			|	РегСвойства.ВключитьДопЗатратыВПланРасходов КАК ВключитьДопЗатратыВПланРасходов,
			|	РегСвойства.ВключитьМатРесурсыВПланРасходов КАК ВключитьМатРесурсыВПланРасходов,
			|	РегСвойства.ВключитьСубпродуктыВПланДоходов КАК ВключитьСубпродуктыВПланДоходов,
			|	РегСвойства.ВключитьПланДоходовВБДДС КАК ВключитьПланДоходовВБДДС,
			|	РегСвойства.ВключитьПланРасходовВБДДС КАК ВключитьПланРасходовВБДДС
			|ИЗ
			|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
			|			,
			|			ПроектнаяЗадача В (&СписокЗадач)
			|				И Версия = &текВерсия) КАК РегСвойства
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
			|				,
			|				Версия = &текВерсия
			|					И ПроектнаяЗадача В (&СписокЗадач)) КАК РегСтатусы
			|		ПО РегСвойства.ПроектнаяЗадача = РегСтатусы.ПроектнаяЗадача
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
			|				,
			|				ПроектнаяЗадача В (&СписокЗадач)
			|					И Версия = &текВерсия) КАК РегСрокиПлан
			|		ПО РегСвойства.ПроектнаяЗадача = РегСрокиПлан.ПроектнаяЗадача
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПрогнозныеСроки КАК РегПрогСроки
			|		ПО РегСвойства.ПроектнаяЗадача = РегПрогСроки.ПроектнаяЗадача
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРасчетныеСрокиПроектныхЗадач.СрезПоследних(
			|				,
			|				ПроектнаяЗадача В (&СписокЗадач)
			|					И Версия = &текВерсия) КАК РегСрокиРасчет
			|		ПО РегСвойства.ПроектнаяЗадача = РегСрокиРасчет.ПроектнаяЗадача
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК РекКоды
			|		ПО РегСвойства.ПроектнаяЗадача = РекКоды.СсылкаНаПроектнуюЗадачу
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
			|				,
			|				Версия = &текВерсия
			|					И ПроектнаяЗадача В (&СписокЗадач)) КАК РегГотовности
			|		ПО РегСвойства.ПроектнаяЗадача = РегГотовности.ПроектнаяЗадача";
			
		Если ВозможныЗадачиРазныхПроектов Тогда    
			Запрос.Текст = СтрЗаменить(НРег(Запрос.Текст), СтрокаВерсии, СтрокаПодменыВерсии); 
		КонецЕсли;
		ТаблицаШапки = Запрос.Выполнить().Выгрузить();
		ТаблицаШапки.Индексы.Добавить("Ссылка");
	КонецЕсли;
		
	Если НужныеТаблицы.Свойство("Ресурсы") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеПлановРесурсов.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	ДанныеПлановРесурсов.Номенклатура КАК Ресурс,
			|	ДанныеПлановРесурсов.Сумма КАК СтоимостьПлан,
			|	ДанныеПлановРесурсов.Количество КАК КоличествоПлан,
			|	ДанныеПлановРесурсов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ДанныеПлановРесурсов.ВидОперации КАК ВидОперации
			|ИЗ
			|	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
			|			,
			|			ПроектнаяЗадача В (&СписокЗадач)
			|				И Версия = &ТекВерсия) КАК ДанныеПлановРесурсов
			|ГДЕ
			|	&ВключаяЗануленные ИЛИ (ДанныеПлановРесурсов.Количество <> 0
			|			ИЛИ ДанныеПлановРесурсов.Сумма <> 0)";
			
		Если ВозможныЗадачиРазныхПроектов Тогда    
			Запрос.Текст = СтрЗаменить(НРег(Запрос.Текст), СтрокаВерсии, СтрокаПодменыВерсии); 
		КонецЕсли;
		ТаблицаРесурсы = Запрос.Выполнить().Выгрузить();
		ТаблицаРесурсы.Индексы.Добавить("ПроектнаяЗадача");
	КонецЕсли;
	                                                                            	
	Если НужныеТаблицы.Свойство("ТрудовыеРесурсыПоПериодам") Тогда
		
		Запрос.Текст =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                 |	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.Версия,
		                 |	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.ПроектнаяЗадача,
		                 |	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.ПериодРаспределения КАК Период,
		                 |	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям,
		                 |	упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.Количество
		                 |ИЗ
		                 |	РегистрСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.СрезПоследних(
		                 |			,
		                 |			ПроектнаяЗадача В (&СписокЗадач)
		                 |				И Версия = &текВерсия) КАК упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних
		                 |ГДЕ
		                 |	&ВключаяЗануленные ИЛИ (упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.Количество <> 0
						 |	)";
		Если ВозможныЗадачиРазныхПроектов Тогда    
			Запрос.Текст = СтрЗаменить(НРег(Запрос.Текст), СтрокаВерсии, СтрокаПодменыВерсии); 
		КонецЕсли;	
		ТрудовыеРесурсыПоПериодам = Запрос.Выполнить().Выгрузить();
		ТрудовыеРесурсыПоПериодам.Индексы.Добавить("ПроектнаяЗадача");
		
	КонецЕсли;
	
	Если НужныеТаблицы.Свойство("ТрудовыеРесурсыТЧ") Тогда
		
		Запрос.Текст =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.Версия КАК Версия,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Ресурс,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования КАК ЕдиницаНормирования,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.СпособПривязки КАК СпособПривязки,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияПоПериодам,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.Количество КАК Количество,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость КАК Стоимость,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость КАК ОбщСтоимость,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.Основной КАК Основной,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ВнешняяСтоимость КАК ВнешняяСтоимость,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования КАК УровеньПланирования,
		                 |	упоДанныеПлановТрудозатратРолейСрезПоследних.ИсточникПлана КАК ИсточникПлана
		                 |ИЗ
		                 |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		                 |			,
		                 |			ПроектнаяЗадача В (&СписокЗадач)
		                 |				И Версия = &текВерсия) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		                 |ГДЕ
		                 |	(&ВключаяЗануленные
		                 |			ИЛИ (упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
		                 |				ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0
		                 |				ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость <> 0))";
		Если ВозможныЗадачиРазныхПроектов Тогда    
			Запрос.Текст = СтрЗаменить(НРег(Запрос.Текст), СтрокаВерсии, СтрокаПодменыВерсии); 
		КонецЕсли;	
		ТрудовыеРесурсыТЧ = Запрос.Выполнить().Выгрузить();
		ТрудовыеРесурсыТЧ.Индексы.Добавить("ПроектнаяЗадача");
		
	КонецЕсли;
	
	Если НужныеТаблицы.Свойство("ПланРасходовТЧ") Тогда
		
		Запрос.Текст =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.Версия КАК Версия,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.ВидЭлемента КАК ВидЭлемента,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.Статья КАК Статья,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки КАК СпособПривязки,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПериодАгрегации КАК ПериодАгрегации,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.Контрагент КАК Контрагент,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.Договор КАК Договор,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.Сумма КАК Сумма,
		                 |	упоДанныеПлановДоходовИРасходовСрезПоследних.СуммаВалютная КАК СуммаВалютная
		                 |ИЗ
		                 |	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
		                 |			,
		                 |			ПроектнаяЗадача В (&СписокЗадач)
		                 |				И Версия = &текВерсия
		                 |				И ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход)
		                 |				И ИсточникПлана В (&ИсточникПлана)) КАК упоДанныеПлановДоходовИРасходовСрезПоследних";
		ИсточникПлана = Новый Массив;
		ИсточникПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ДоходыРасходы);
		ИсточникПлана.Добавить(Перечисления.упоИсточникПланаДоходовИРасходов.ПустаяСсылка());
		Запрос.УстановитьПараметр("ИсточникПлана", ИсточникПлана);
		
		Если ВозможныЗадачиРазныхПроектов Тогда    
			Запрос.Текст = СтрЗаменить(НРег(Запрос.Текст), СтрокаВерсии, СтрокаПодменыВерсии); 
		КонецЕсли;	
		ПланРасходовТЧ = Запрос.Выполнить().Выгрузить();
		ПланРасходовТЧ.Индексы.Добавить("ПроектнаяЗадача");
		
	КонецЕсли;
	
	Если НужныеТаблицы.Свойство("ПредУсловия") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегПредусловия.ПроектнаяЗадача КАК ПроектнаяЗадача,
			|	РегПредусловия.ЗадачаПредшественник КАК ПредУсловие,
			|	ЕСТЬNULL(РегЗадачи.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершенияПлан
			|ИЗ
			|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(
			|			,
			|			ПроектнаяЗадача В (&СписокЗадач)
			|				И Версия = &текВерсия) КАК РегПредусловия
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегЗадачи
			|		ПО РегПредусловия.ЗадачаПредшественник = РегЗадачи.ПроектнаяЗадача
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ) КАК СвойстваПредшественника
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроектовПредшественников
			|			ПО СвойстваПредшественника.Версия = упоВерсииПроектовПредшественников.Версия
			|				И (упоВерсииПроектовПредшественников.Текущая)
			|				И (НЕ СвойстваПредшественника.ЗадачаОтменена)
			|		ПО РегПредусловия.ЗадачаПредшественник = СвойстваПредшественника.ПроектнаяЗадача
			|ГДЕ
			|	РегПредусловия.СвязьСуществует";
		
		Если ВозможныЗадачиРазныхПроектов Тогда    
			Запрос.Текст = СтрЗаменить(НРег(Запрос.Текст), СтрокаВерсии, СтрокаПодменыВерсии); 
		КонецЕсли;	
		ТаблицаПредУсловия = Запрос.Выполнить().Выгрузить();
		ТаблицаПредУсловия.Индексы.Добавить("ПроектнаяЗадача");
	КонецЕсли;
			
	// Получаем всех руководителей задач для проекта.
	
	Если НужныеТаблицы.Свойство("Руководитель") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегСвойства.ПроектнаяЗадача КАК Задача,
			|	РегСвойства.ЗадачаРодитель КАК Родитель,
			|	РегРуководители.РуководительПроектнойЗадачи КАК Руководитель
			|ИЗ
			|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвойства
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РегРуководители
			|		ПО РегСвойства.ПроектнаяЗадача = РегРуководители.ПроектнаяЗадача
			|ГДЕ
			|	НЕ РегСвойства.ЗадачаОтменена";
		
		Если ВозможныЗадачиРазныхПроектов Тогда    
			Запрос.Текст = СтрЗаменить(НРег(Запрос.Текст), СтрокаВерсии, СтрокаПодменыВерсии); 
		КонецЕсли;	
		ТаблицаРуководители = Запрос.Выполнить().Выгрузить();
		ТаблицаРуководители.Индексы.Добавить("Задача");
	КонецЕсли;
	
	// Итоговая таблица.
	ДанныеВых = Новый ТаблицаЗначений;
	ДанныеВых.Колонки.Добавить("ПроектнаяЗадача");
	ДанныеВых.Колонки.Добавить("ДанныеЗадачи");
	
	// Перебираем список заданных задач, по кот. необходимо получить их данные.
	Для Каждого ПроектнаяЗадача Из СписокПроектныхЗадач Цикл	
		
		ДанныеЗадачи = Новый Структура();
		ДанныеЗадачи.Вставить("Дата");
		ДанныеЗадачи.Вставить("Проект");
		ДанныеЗадачи.Вставить("Ссылка");
		ДанныеЗадачи.Вставить("Наименование");
		ДанныеЗадачи.Вставить("Родитель");
		ДанныеЗадачи.Вставить("КалендарьЗадачи");
		ДанныеЗадачи.Вставить("КодСДР");
		ДанныеЗадачи.Вставить("ЭтоВеха");
		ДанныеЗадачи.Вставить("ЭтоПакетРабот");
		ДанныеЗадачи.Вставить("ЭтоМодельПакетаРабот");
		ДанныеЗадачи.Вставить("Статус");
		ДанныеЗадачи.Вставить("ПодчиненныйПроект");
		ДанныеЗадачи.Вставить("ПроцентГотовности");
		ДанныеЗадачи.Вставить("СуммаСанкцийЗаДеньЗадержки");
		ДанныеЗадачи.Вставить("ВидОперации");
		ДанныеЗадачи.Вставить("Руководитель");
		ДанныеЗадачи.Вставить("ПланироватьТрудозатратыНаИсполнителей");		
		ДанныеЗадачи.Вставить("НормаСтоимостиТрудовыхРесурсов");		
		ДанныеЗадачи.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов");
		ДанныеЗадачи.Вставить("ТекущаяВерсияПроекта");
		ДанныеЗадачи.Вставить("ВключитьТрудРесурсыВПланРасходов", Ложь);
		ДанныеЗадачи.Вставить("ВключитьДопЗатратыВПланРасходов", Ложь);
		ДанныеЗадачи.Вставить("ВключитьМатРесурсыВПланРасходов", Ложь);
		ДанныеЗадачи.Вставить("ВключитьСубпродуктыВПланДоходов", Ложь);												
		ДанныеЗадачи.Вставить("ВключитьПланДоходовВБДДС", Ложь);
		ДанныеЗадачи.Вставить("ВключитьПланРасходовВБДДС", Ложь);
		ДанныеЗадачи.Вставить("УровеньПланированияТрудозатратДляБДР");
		
		СтруктураСроков = Новый Структура();
		СтруктураСроков.Вставить("НачалоПлан");
		СтруктураСроков.Вставить("ЗавершениеПлан");
		СтруктураСроков.Вставить("ДатаНачалаПрогноз");
		СтруктураСроков.Вставить("ДатаЗавершенияПрогноз");
		СтруктураСроков.Вставить("СтатусСроков");
		СтруктураСроков.Вставить("КрайнийСрок");
		СтруктураСроков.Вставить("РаннийСтарт");
		СтруктураСроков.Вставить("ПозднийСтарт");
		СтруктураСроков.Вставить("РаннийФиниш");
		СтруктураСроков.Вставить("ПозднийФиниш");
	
		СтруктураОР = Новый Структура();
		СтруктураОР.Вставить("РольПлан");
		СтруктураОР.Вставить("СтоимостьПлан");
		СтруктураОР.Вставить("ТрудозатратыПлан");
		СтруктураОР.Вставить("ЕдИзмПлан");
		
		СтруктураДлительности = Новый Структура();
		СтруктураДлительности.Вставить("ДлительностьПлан");
		
		ТаблицаРесурсов = Новый ТаблицаЗначений;
		ТаблицаРесурсов.Колонки.Добавить("Операция");
		ТаблицаРесурсов.Колонки.Добавить("Ресурс");
		ТаблицаРесурсов.Колонки.Добавить("ВидРесурса");
		ТаблицаРесурсов.Колонки.Добавить("СтоимостьПлан");
		ТаблицаРесурсов.Колонки.Добавить("ВнешняяСтоимостьПлан");
		ТаблицаРесурсов.Колонки.Добавить("КоличествоПлан");
		ТаблицаРесурсов.Колонки.Добавить("ЕдИзмПлан");
		ТаблицаРесурсов.Колонки.Добавить("ВидОперации");		
		
		ТаблицаПредУсловий = Новый ТаблицаЗначений;
		ТаблицаПредУсловий.Колонки.Добавить("ПредУсловие");
		ТаблицаПредУсловий.Колонки.Добавить("ДатаЗавершенияПлан");
				
		ДанныеЗадачи.Вставить("Сроки", СтруктураСроков);
		ДанныеЗадачи.Вставить("ОтветственнаяРоль", СтруктураОР);
		ДанныеЗадачи.Вставить("Длительность", СтруктураДлительности);
		ДанныеЗадачи.Вставить("Ресурсы", ТаблицаРесурсов);
		ДанныеЗадачи.Вставить("ПредУсловия", ТаблицаПредУсловий);
		
		// Ссылка на текущий объект будет всегда.
		ДанныеЗадачи.Вставить("Ссылка", ПроектнаяЗадача);
		
		Если НужныеТаблицы.Свойство("ДанныеЗадачи") Тогда
			// Получим данные по шапке.
			Данные = ТаблицаШапки.Найти(ПроектнаяЗадача, "Ссылка");
			Если Не Данные = Неопределено Тогда
				// Получим основные данные.
				ДанныеЗадачи.Вставить("Ссылка", Данные.Ссылка);
				ДанныеЗадачи.Вставить("Проект", Данные.Проект);
				ДанныеЗадачи.Вставить("Дата", Данные.Дата);
				ДанныеЗадачи.Вставить("Наименование", Данные.Наименование);
				ДанныеЗадачи.Вставить("Родитель", Данные.Родитель);
				ДанныеЗадачи.Вставить("КалендарьЗадачи", Данные.КалендарьЗадачи);
				ДанныеЗадачи.Вставить("КодСДР", Данные.КодСДР);
				ДанныеЗадачи.Вставить("ЭтоВеха", Данные.ЭтоВеха);
				ДанныеЗадачи.Вставить("ЭтоПакетРабот", Данные.ЭтоПакетРабот);
				ДанныеЗадачи.Вставить("ЭтоМодельПакетаРабот", Данные.ЭтоМодельПакетаРабот);
				ДанныеЗадачи.Вставить("Статус", Данные.Статус);
				ДанныеЗадачи.Вставить("ПодчиненныйПроект", Данные.ПодчиненныйПроект);
				ДанныеЗадачи.Вставить("ПроцентГотовности", Данные.ПроцентГотовности);
				ДанныеЗадачи.Вставить("СуммаСанкцийЗаДеньЗадержки", Данные.СуммаСанкцийЗаДеньЗадержки);
				ДанныеЗадачи.Вставить("ВидОперации", Данные.ВидОперации);
				ДанныеЗадачи.Вставить("ПланироватьТрудозатратыНаИсполнителей", Данные.ПланироватьТрудозатратыНаИсполнителей);
				ДанныеЗадачи.Вставить("НормаСтоимостиТрудовыхРесурсов", Данные.НормаСтоимостиТрудовыхРесурсов);		
				ДанныеЗадачи.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", Данные.ВнешняяНормаСтоимостиТрудовыхРесурсов);
				ДанныеЗадачи.Вставить("ТекущаяВерсияПроекта", Данные.ТекущаяВерсияПроекта);
				ДанныеЗадачи.Вставить("ВключитьТрудРесурсыВПланРасходов", Данные.ВключитьТрудРесурсыВПланРасходов);
				ДанныеЗадачи.Вставить("ВключитьДопЗатратыВПланРасходов", Данные.ВключитьДопЗатратыВПланРасходов);
				ДанныеЗадачи.Вставить("ВключитьМатРесурсыВПланРасходов", Данные.ВключитьМатРесурсыВПланРасходов);
				ДанныеЗадачи.Вставить("ВключитьСубпродуктыВПланДоходов", Данные.ВключитьСубпродуктыВПланДоходов);												
				ДанныеЗадачи.Вставить("ВключитьПланДоходовВБДДС", Данные.ВключитьПланДоходовВБДДС);
				ДанныеЗадачи.Вставить("ВключитьПланРасходовВБДДС", Данные.ВключитьПланРасходовВБДДС);
				ДанныеЗадачи.Вставить("УровеньПланированияТрудозатратДляБДР", Данные.УровеньПланированияТрудозатратДляБДР);
				
				// Получим данные сроков.
				СтруктураСроков.Вставить("НачалоПлан", Данные.ДатаНачалаПлан);
				СтруктураСроков.Вставить("ЗавершениеПлан", Данные.ДатаЗавершенияПлан);
				СтруктураСроков.Вставить("КрайнийСрок", Данные.КрайнийСрок);
				СтруктураСроков.Вставить("РаннийСтарт", Данные.ДатаРаннегоСтарта);
				СтруктураСроков.Вставить("ПозднийСтарт", Данные.ДатаПозднегоСтарта);
				СтруктураСроков.Вставить("РаннийФиниш", Данные.ДатаРаннегоФиниша);
				СтруктураСроков.Вставить("ПозднийФиниш", Данные.ДатаПозднегоФиниша);
				СтруктураСроков.Вставить("ДатаНачалаПрогноз", Данные.ДатаНачалаПрогноз);
				СтруктураСроков.Вставить("ДатаЗавершенияПрогноз", Данные.ДатаЗавершенияПрогноз);
				СтруктураСроков.Вставить("СтатусСроков", Данные.СтатусСроков);
			КонецЕсли;
		КонецЕсли;
		
		Если НужныеТаблицы.Свойство("Руководитель") Тогда
			// Получим руководителя.
 			Руководитель = НайтиРуководителяПроектнойЗадачи(ТаблицаРуководители, ПроектнаяЗадача);
			ДанныеЗадачи.Вставить("Руководитель", Руководитель);
		КонецЕсли;
				
		Если НужныеТаблицы.Свойство("Длительность") Тогда
			Длительность = 0;
			СтруктураДлительности.Вставить("ДлительностьПлан", Длительность);
		КонецЕсли;
		
		Отбор = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
		
		Если НужныеТаблицы.Свойство("Ресурсы") Тогда
			// Получим данные ресурсов.
			НаборДанных = ТаблицаРесурсы.НайтиСтроки(Отбор);
			Для Каждого Данные Из НаборДанных Цикл
				СтрокаТаблицы = ТаблицаРесурсов.Добавить();
				СтрокаТаблицы.Операция       = Данные.ПроектнаяЗадача;
				СтрокаТаблицы.Ресурс         = Данные.Ресурс;
				СтрокаТаблицы.СтоимостьПлан  = Данные.СтоимостьПлан;
				СтрокаТаблицы.КоличествоПлан = Данные.КоличествоПлан;
				СтрокаТаблицы.ЕдИзмПлан      = Данные.ЕдиницаИзмерения;
				СтрокаТаблицы.ВидОперации    = Данные.ВидОперации;
			КонецЦикла;
		КонецЕсли;
		
		Если НужныеТаблицы.Свойство("ТрудовыеРесурсыПоПериодам") Тогда
			НаборДанных = ТрудовыеРесурсыПоПериодам.Скопировать(Отбор);
			ДанныеЗадачи.Вставить("ТрудовыеРесурсыПоПериодам", НаборДанных);
		КонецЕсли;		
		
		Если НужныеТаблицы.Свойство("ТрудовыеРесурсыТЧ") Тогда
			НаборДанных = ТрудовыеРесурсыТЧ.Скопировать(Отбор);
			ДанныеЗадачи.Вставить("ТрудовыеРесурсыТЧ", НаборДанных);
		КонецЕсли;		
		
		Если НужныеТаблицы.Свойство("ПланРасходовТЧ") Тогда
			НаборДанных = ПланРасходовТЧ.Скопировать(Отбор);
			ДанныеЗадачи.Вставить("ПланРасходов", НаборДанных);
        КонецЕсли;
		
		Если НужныеТаблицы.Свойство("ПредУсловия") Тогда
			// Получим данные предусловий.
			НаборДанных = ТаблицаПредУсловия.НайтиСтроки(Отбор);
			Для Каждого Данные Из НаборДанных Цикл
				СтрокаТаблицы = ТаблицаПредУсловий.Добавить();
				СтрокаТаблицы.ПредУсловие        = Данные.ПредУсловие;
				СтрокаТаблицы.ДатаЗавершенияПлан = Данные.ДатаЗавершенияПлан;
			КонецЦикла;
		КонецЕсли;
		
		Если ВидОперации = 0 Тогда
			ДанныеВых = ДанныеЗадачи;
		Иначе	
			СтрокаДанных = ДанныеВых.Добавить();
			СтрокаДанных.ПроектнаяЗадача = ПроектнаяЗадача;
			СтрокаДанных.ДанныеЗадачи    = ДанныеЗадачи;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеВых;
	
КонецФункции

// Текст запроса временная таблица ПрогнозныеСроки.
//
// Параметры:
//  ОтборПоСпискуЗадач	 - Булево	 - признак отбора по списку задач.
// 
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаВременнаяТаблицаПрогнозныеСроки(ОтборПоСпискуЗадач = Ложь) Экспорт
	
	ТекстЗапросаТаблицаПрогнозныеСроки = "";
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		ТекстЗапросаТаблицаПрогнозныеСроки = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрогнозныеСроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ПрогнозныеСроки.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
		|	ПрогнозныеСроки.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
		|	ПрогнозныеСроки.СтатусСроков КАК СтатусСроков
		|ПОМЕСТИТЬ ПрогнозныеСроки
		|ИЗ
		|РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних(
		|				,
		|				ПроектнаяЗадача = &Ссылка
		|					И Версия = &текВерсия) КАК ПрогнозныеСроки";
		
		Если ОтборПоСпискуЗадач Тогда
			ТекстЗапросаТаблицаПрогнозныеСроки = СтрЗаменить(
				ТекстЗапросаТаблицаПрогнозныеСроки, 
				"ПроектнаяЗадача = &Ссылка",
				"ПроектнаяЗадача В (&СписокЗадач)"
			);
		КонецЕсли; 
		
	Иначе 
		
		ТекстЗапросаТаблицаПрогнозныеСроки = "
		|ВЫБРАТЬ 
		|	NULL КАК ПроектнаяЗадача,
		|	NULL КАК ДатаНачалаПрогноз,
		|	NULL КАК ДатаЗавершенияПрогноз,
		|	NULL КАК СтатусСроков
		|ПОМЕСТИТЬ ПрогнозныеСроки";
		
	КонецЕсли;
	
	Возврат ТекстЗапросаТаблицаПрогнозныеСроки;
	
КонецФункции

// Рекурсивная функция. Ищет руководителя проектной задачи снизу вверх.
//
// Параметры:
//  ТаблицаЗадач - ТаблицаЗначений								 - содержит иеррархию проектных задач
//  Задача		 - СправочникСсылка.Проекты						 - проектная задача,
//  	для которой ищется руководитель.
//  Руководитель - СправочникСсылка.упоСотрудники, Неопределено	 - необязательный параметр, сотрудник по умолчанию.
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Неопределено - найденный руководитель проектной задачи или не найден руководитель.
//
Функция НайтиРуководителяПроектнойЗадачи(ТаблицаЗадач, Задача, Руководитель = Неопределено) Экспорт
	
	Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Задача) Тогда
		Возврат Руководитель; // Дошли до верхнего уровня.
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаЗадач.Найти(Задача, "Задача");
	Если Не СтрокаТаблицы = Неопределено Тогда
		Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаТаблицы.Руководитель) Тогда
			Руководитель = СтрокаТаблицы.Руководитель;
			Возврат Руководитель; // Нашли руководителя можно выходить.
		КонецЕсли;
	Иначе
		Возврат Руководитель; // Нашелся разрыв, выходим с тем что есть.
	КонецЕсли;
	
	// Поднимаемся на уровнь выше.
	Руководитель = НайтиРуководителяПроектнойЗадачи(ТаблицаЗадач, СтрокаТаблицы.Родитель, Руководитель);
	
	Возврат Руководитель;
	
КонецФункции

// Функция возвращает свойство задачи из регистра упоСвойстваПроектныхЗадач для текущей версии проекта.
//
// Параметры:
//  ПроектнаяЗадача		 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
//  Свойство			 - Строка							 - Имя реквизита свойства.
//  ЗначениеПоУмолчанию	 - Произвольное						 - Значение возвращаемое, когда данные не найдены.
//  Версия				 - ДокументСсылка.упоВерсияПланаПроекта	 - версия проекта.
// 
// Возвращаемое значение:
//  Произвольное - содержит значение свойства или значение по умолчанию.
//
Функция ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача, Свойство, ЗначениеПоУмолчанию = Неопределено, Версия = Неопределено) Экспорт
	Значение = ПолучитьСвойстваПроектнойЗадачи(ПроектнаяЗадача, Свойство, Версия)[Свойство]; 
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	Иначе
		Возврат Значение;
	КонецЕсли;
КонецФункции 

// Функция возвращает свойства задачи из регистра упоСвойстваПроектныхЗадач для текущей версии проекта.
//
// Параметры:
//  пПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
//  Свойства		 - Строка							 - Список имен свойств через запятую.
//  Версия			 - ДокументСсылка.упоВерсияПланаПроекта	 - текущая версия проекта.
// 
// Возвращаемое значение:
//  Структура - содержит значения свойств.
//
Функция ПолучитьСвойстваПроектнойЗадачи(пПроектнаяЗадача, Свойства, Версия = Неопределено) Экспорт
	
	Если ТипЗнч(пПроектнаяЗадача) = Тип("СправочникСсылка.Проекты") Тогда
		ПроектнаяЗадача = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(пПроектнаяЗадача);
	Иначе
		ПроектнаяЗадача = пПроектнаяЗадача;
	КонецЕсли;
	
	СтруктураСвойства = Новый Структура(Свойства);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	%1
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, %2 ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |	%3";
	
	Если ЗначениеЗаполнено(Версия) Тогда
		ТекстПараметров = "Версия = &ТекВерсия И ";
		ТекстОтбора = "";
		Запрос.УстановитьПараметр("ТекВерсия", Версия);
	Иначе
		ТекстПараметров = "";
		ТекстОтбора = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|	ПО (упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|			И упоВерсииПроекта.Текущая)";
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, 
		Свойства, ТекстПараметров, ТекстОтбора);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураСвойства;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураСвойства, Выборка);
	
	Возврат СтруктураСвойства;
	
КонецФункции 

// Функция возвращает свойства задач из регистра упоСвойстваПроектныхЗадач для текущих версий проектов.
//
// Параметры:
//  МассивЗадач	 - Массив	 - Массив ссылок на проектные задачи.
//  Свойства	 - Строка	 - Список имен свойств через запятую.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие структур со значениями свойств.
//
Функция ПолучитьСвойстваПроектныхЗадач(МассивЗадач, Свойства) Экспорт
	
	Результат = Новый Соответствие;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПроектнаяЗадача, "+Свойства+"
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО (упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И упоВерсииПроекта.Текущая)";
				  				   
	Запрос.УстановитьПараметр("МассивЗадач", МассивЗадач);			   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда  
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураСвойства = Новый Структура(Свойства);
			ЗаполнитьЗначенияСвойств(СтруктураСвойства, Выборка);
			Результат.Вставить(Выборка.ПроектнаяЗадача, СтруктураСвойства);			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Последние сведения о сроках заданной проектной задачи. См. упоПроектыИЗадачиВызовСервера.обПолучитьСрокиПроектнойЗадачи
//
// Параметры:
//  ПроектнаяЗадача						 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
//  НеопределеноКогдаНетДанных	 - Булево							 - указывает на необходимость вернуть Неопределено, если сроки не найдены.
// 
// Возвращаемое значение:
//  Структура, Неопределено - сроки задачи.
//
Функция ПолучитьСрокиПроектнойЗадачи(ПроектнаяЗадача, НеопределеноКогдаНетДанных = Истина) Экспорт
	
	СрокиЗадачи = СтруктураСроковПроектнойЗадачи();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача.Проект));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСвойства.КрайнийСрок КАК КрайнийСрок,
	|	РегСроки.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	РегСроки.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	РесСрокиРасчет.ДатаРаннегоСтарта КАК ДатаРаннегоСтарта,
	|	РесСрокиРасчет.ДатаРаннегоФиниша КАК ДатаРаннегоФиниша,
	|	РесСрокиРасчет.ДатаПозднегоСтарта КАК ДатаПозднегоСтарта,
	|	РесСрокиРасчет.ДатаПозднегоФиниша КАК ДатаПозднегоФиниша
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			,
	|			ПроектнаяЗадача = &Задача
	|				И Версия = &текВерсия) КАК РегСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	|				,
	|				ПроектнаяЗадача = &Задача
	|					И Версия = &текВерсия) КАК РегСроки
	|		ПО РегСвойства.ПроектнаяЗадача = РегСроки.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРасчетныеСрокиПроектныхЗадач.СрезПоследних(
	|				,
	|				ПроектнаяЗадача = &Задача
	|					И Версия = &текВерсия) КАК РесСрокиРасчет
	|		ПО (РегСвойства.ПроектнаяЗадача = РегСроки.ПроектнаяЗадача)";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(СрокиЗадачи, Выборка);
		
	ИначеЕсли НеопределеноКогдаНетДанных Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СрокиЗадачи;
	
КонецФункции 

// Возвращает набор расчетных сроков проектных задач.
//
// Параметры:
//  Задачи	 - Массив Из ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
// 
// Возвращаемое значение:
//  Соответствие - сроки задач.
//
Функция СрокиПроектныхЗадач(Знач Задачи) Экспорт
	
	СрокиЗадач = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задачи", Задачи);
	Запрос.УстановитьПараметр("текВерсии", упоВерсионирование.ТекущиеВерсии(Задачи));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСвойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ЕСТЬNULL(РегСвойства.КрайнийСрок, ДАТАВРЕМЯ(1, 1, 1)) КАК КрайнийСрок,
	|	ЕСТЬNULL(РегСроки.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаПлан,
	|	ЕСТЬNULL(РегСроки.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершенияПлан,
	|	ЕСТЬNULL(РесСрокиРасчет.ДатаРаннегоСтарта, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРаннегоСтарта,
	|	ЕСТЬNULL(РесСрокиРасчет.ДатаРаннегоФиниша, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРаннегоФиниша,
	|	ЕСТЬNULL(РесСрокиРасчет.ДатаПозднегоСтарта, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПозднегоСтарта,
	|	ЕСТЬNULL(РесСрокиРасчет.ДатаПозднегоФиниша, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПозднегоФиниша
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			,
	|			Версия В (&текВерсии)
	|				И ПроектнаяЗадача В (&Задачи)) КАК РегСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия В (&текВерсии)
	|					И ПроектнаяЗадача В (&Задачи)) КАК РегСроки
	|		ПО РегСвойства.ПроектнаяЗадача = РегСроки.ПроектнаяЗадача
	|			И РегСвойства.Версия = РегСроки.Версия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРасчетныеСрокиПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия = Версия В (&текВерсии)
	|					И ПроектнаяЗадача В (&Задачи)) КАК РесСрокиРасчет
	|		ПО РегСвойства.ПроектнаяЗадача = РесСрокиРасчет.ПроектнаяЗадача
	|			И РегСвойства.Версия = РесСрокиРасчет.Версия";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СрокиЗадач;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СрокиЗадачи = СтруктураСроковПроектнойЗадачи();
		ЗаполнитьЗначенияСвойств(СрокиЗадачи, Выборка);
		
		СрокиЗадач.Вставить(Выборка.ПроектнаяЗадача, СрокиЗадачи);
		
	КонецЦикла;
	
	Возврат СрокиЗадач;

КонецФункции

// Функция возвращает тип проектной задачи.
//
// Параметры:
//  Параметр - ДокументСсылка.упоПроектнаяЗадача, Структура	 - ссылка на проектную задачу или структура ее свойств.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.упоТипПроектнойЗадачи - тип проектной задачи.
//
Функция ПолучитьТипПроектнойЗадачи(Параметр) Экспорт
	
	Если ТипЗнч(Параметр) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		СвойстваЗадачи = ПолучитьСвойстваПроектнойЗадачи(Параметр, "ЭтоВеха, ЭтоПакетРабот, ЭтоМодельПакетаРабот");
	Иначе
		СвойстваЗадачи = Параметр;
	КонецЕсли;
		
	ТипПроектнойЗадачи = Неопределено;
	
	Если СвойстваЗадачи.ЭтоМодельПакетаРабот = Ложь
		И СвойстваЗадачи.ЭтоПакетРабот = Ложь
		И СвойстваЗадачи.ЭтоВеха = Ложь Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Этап;	
		
	ИначеЕсли СвойстваЗадачи.ЭтоМодельПакетаРабот = Ложь
		И СвойстваЗадачи.ЭтоПакетРабот = Истина
		И СвойстваЗадачи.ЭтоВеха = Ложь Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.ПакетРабот;
		
	ИначеЕсли СвойстваЗадачи.ЭтоМодельПакетаРабот = Истина
		И СвойстваЗадачи.ЭтоПакетРабот = Истина
		И СвойстваЗадачи.ЭтоВеха = Ложь Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.МодельПакетаРабот;
		
	ИначеЕсли СвойстваЗадачи.ЭтоМодельПакетаРабот = Ложь
		И СвойстваЗадачи.ЭтоПакетРабот = Ложь
		И СвойстваЗадачи.ЭтоВеха = Истина Тогда
		
		ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Веха;
		
	КонецЕсли;
	
	Возврат ТипПроектнойЗадачи;

КонецФункции 

#КонецОбласти

#Область ПроверкаСтруктурыПроекта

// Возвращает данные проверки структуры проекта в виде массива структур со сведениями об ошибках.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - проект.
//  Отказ	 - Булево 					- признак отказа от выполнения операции.
//
// Возвращаемое значение:
//	Массив - массив структур ошибок.
//
Функция ДанныеПроверкиСтруктурыПроекта(Проект, Отказ) Экспорт
	
	МассивыСтруктурОшибок = Новый Массив();
	
	Если Отказ = Истина Тогда
		Возврат МассивыСтруктурОшибок;
	КонецЕсли;
	
	СтруктураПроверки = Новый Структура;
	
	СтруктураПроверки.Вставить("Проект"                        , Проект);
	СтруктураПроверки.Вставить("ПроверятьСтруктуруЗадач"       , Истина);
	СтруктураПроверки.Вставить("ПроверятьСрокиЗадач"           , Истина);
	СтруктураПроверки.Вставить("ПроверятьЗаполнениеСроковЗадач", Истина);
	СтруктураПроверки.Вставить("ПроверятьПредУсловияЗадач"     , Истина);
	СтруктураПроверки.Вставить("ПроверятьЗацикливание"         , Истина);
	
	ТаблицаОшибок = упоПроектыИЗадачиВызовСервера.обКомплекснаяПроверкаСтруктурыПроекта(СтруктураПроверки, Истина);
	
	Если НЕ ТаблицаОшибок = Неопределено Тогда
		
		Если ТаблицаОшибок.Задачи.Количество() = 0
		   И ТаблицаОшибок.Общие.Количество() = 0 Тогда
		   
		Иначе
			
			МассивСтруктурОшибкиЗадач = упоФункцииОбщегоНазначенияСервер.ПреобразоватьТаблицуВМассивСтруктур(ТаблицаОшибок.Задачи,
				Новый Структура("ВидОшибок", "Задачи"));
			МассивСтруктурОшибкиОбщие = упоФункцииОбщегоНазначенияСервер.ПреобразоватьТаблицуВМассивСтруктур(ТаблицаОшибок.Общие,
				Новый Структура("ВидОшибок", "Общие"));
			
			МассивыСтруктурОшибок.Добавить(МассивСтруктурОшибкиЗадач);
			МассивыСтруктурОшибок.Добавить(МассивСтруктурОшибкиОбщие);
			
			СообщениеОНайденныхОшибкахПроекта = НСтр("ru = 'При проверке проекта ""%1"" обнаружены ошибки!'");
			
			СтрокаСообщения = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОНайденныхОшибкахПроекта, Проект);
			
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru = 'Ошибка:'"));
			
		КонецЕсли;
		
	Иначе
		
		СтрокаСообщения = НСтр("ru = 'Не выбран проект!'");
		обСообщитьОбОшибке(СтрокаСообщения, Отказ, НСтр("ru = 'Ошибка:'"));
		Отказ = Истина;
		
	КонецЕсли;
	
	Возврат МассивыСтруктурОшибок;
	
КонецФункции

// Устанавливает статью затрат ресурса в строке табличной части.
// 
// Параметры:
//	СтрокаТабличнойЧасти 	- СтрокаТабличнойЧасти - строка с данными.
//	ЗатиратьЗначение 		- Булево - если в строке установлено значение статьи затрат, то будет затирать его, если Истина,
//					   					или пропускать, если параметр = Ложь.
//	ИмяКолонки 				- Строка - Имя колонки, содержащей Статью затрат мат ресурса.
//
Процедура УстановитьСтатьюЗатратРесурса(СтрокаТабличнойЧасти, ЗатиратьЗначение = Истина, ИмяКолонки = "СтатьяЗатрат") Экспорт 
	
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти[ИмяКолонки]) И Не ЗатиратьЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Рег.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.упоРаспределениеРесурсовПоСтатьямЗатрат КАК Рег
	|ГДЕ
	|	Рег.Ресурс = &Ресурс
	|
	|УПОРЯДОЧИТЬ ПО
	|	Рег.ДоляСуммы УБЫВ";
	Запрос.УстановитьПараметр("Ресурс", СтрокаТабличнойЧасти.Ресурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СтрокаТабличнойЧасти[ИмяКолонки] = Выборка.СтатьяЗатрат;
	Иначе
		СтрокаТабличнойЧасти[ИмяКолонки] = Справочники.упоСтатьиЗатрат.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, что переданный элемент справочника соответвует проекту, а не проектной задаче.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проект, который нужно проверить. В случае, если Проект -
//  	яляется проектной задачей, параметру присваивается значение ПустаяСсылка типа СправочникСсылка.Проекты.
//
Процедура ПроверитьТипПроекта(Проект) Экспорт

	Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Проект) И Проект.ЭтоПроектнаяЗадача Тогда
		Проект = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли; 	

КонецПроцедуры

// Проверяет цикличность предусловий с учетом иерархии.
//
// Параметры:
//	пТаблицаЭлементов - ТаблицаЗначений - таблица элементов проекта.
//	ТаблицаСвязей - ТаблицаЗначений - связи элементов проекта.
//	ТаблицаОшибок - ТаблицаЗначений.
//  ПустойРодитель - Неопределено или ПустаяСсылка - определение типа родителя для разных источников вызова.
//
Процедура ПроверитьНаЦикличность(пТаблицаЭлементов, Знач ТаблицаСвязей, ТаблицаОшибок, ПустойРодитель = Неопределено) Экспорт
	
	Перем СтруктураДанныхЦикла;
	
	ТаблицаСвязей.Колонки.Добавить("ИсточникСвязи");
	
	ТаблицаДобавляемыхСвязей = Новый ТаблицаЗначений;
	ТаблицаДобавляемыхСвязей.Колонки.Добавить("Элемент");
	ТаблицаДобавляемыхСвязей.Колонки.Добавить("Связь");
	ТаблицаДобавляемыхСвязей.Колонки.Добавить("ВидСвязи");
	
	//
	
	ДетиРодителей = Новый Соответствие;
	ПолучитьВсехДетейРодителей(пТаблицаЭлементов, ПустойРодитель, ДетиРодителей, ПустойРодитель);
	
	Для Каждого КлючЗначение Из ДетиРодителей Цикл
		
		Родитель = КлючЗначение.Ключ;
		Дети = КлючЗначение.Значение;
		
		Отбор = Новый Структура;
		Отбор.Вставить("СвязанныйЭлемент", Родитель);
		СвязиПредыдущие = ТаблицаСвязей.НайтиСтроки(Отбор);
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЭлементПроекта", Родитель);
		СвязиСледующие = ТаблицаСвязей.НайтиСтроки(Отбор);
		
		Для Каждого Связь Из СвязиПредыдущие Цикл
			Для Каждого Ребенок Из Дети Цикл							
				НоваяСвязь = ТаблицаСвязей.Добавить();	
				НоваяСвязь.ИсточникСвязи = Родитель;
				НоваяСвязь.ЭлементПроекта = Связь.ЭлементПроекта;
				НоваяСвязь.СвязанныйЭлемент = Ребенок;
			КонецЦикла;
			ТаблицаСвязей.Удалить(Связь);
		КонецЦикла;
		
		Для Каждого Связь Из СвязиСледующие Цикл
			Для Каждого Ребенок Из Дети Цикл
				НоваяСвязь = ТаблицаСвязей.Добавить();	
				НоваяСвязь.ИсточникСвязи = Родитель;
				НоваяСвязь.ЭлементПроекта = Ребенок;
				НоваяСвязь.СвязанныйЭлемент = Связь.СвязанныйЭлемент;
			КонецЦикла;
			ТаблицаСвязей.Удалить(Связь);
		КонецЦикла;
		
	КонецЦикла;
	
	//
	
	СоответствиеПроверенныеЗадачи = Новый Соответствие;
	МассивПроверяемыеЗадачи = Новый Массив;
	
	СтруктураДанныхЦикла = Новый Структура;
	СтруктураДанныхЦикла.Вставить("НайденЦикл", Ложь);
	СтруктураДанныхЦикла.Вставить("Элемент", "");
	СтруктураДанныхЦикла.Вставить("МассивЭлементовЦикла", Новый Массив);
	СтруктураДанныхЦикла.Вставить("ЦиклЗаписан", Ложь);
	
	Для каждого СтрокаЭлемент Из пТаблицаЭлементов Цикл
		
		// Если нашли хоть один цикл, то дальнейшую проверку прекращаем.
		Если СтруктураДанныхЦикла.ЦиклЗаписан Тогда
			Прервать;
		КонецЕсли;
		
		Если СоответствиеПроверенныеЗадачи.Получить(СтрокаЭлемент.ЭлементПроекта) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивПроверяемыеЗадачи.Очистить();
		НайтиЦиклыРекурсивно(ТаблицаСвязей, СоответствиеПроверенныеЗадачи, МассивПроверяемыеЗадачи, СтрокаЭлемент.ЭлементПроекта, Неопределено, СтруктураДанныхЦикла);		
			
	КонецЦикла;
	
	Если СтруктураДанныхЦикла.НайденЦикл Тогда
		
		Для Каждого ЭлементЦикла Из СтруктураДанныхЦикла.МассивЭлементовЦикла Цикл
			СтрокаСообщения = НСтр("ru = 'В структуре проекта обнаружена цикличность связей!'");
			ДобавитьОшибку(ТаблицаОшибок, ЭлементЦикла,, СтрокаСообщения); 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Проверить зацикливание связей проекта.
//
// Параметры:
//  Проект			 - СправочникСсылка.Проекты	 - Проект
//  НовыеДанныеЗадач - Соответствие, Неопределено	 - Незаписанные в базу данные задач.
// 
// Возвращаемое значение:
//  ТаблицаОшибок - ТаблицаЗначений.
//
Функция ПроверитьНаЦикличностьПроект(Проект, НовыеДанныеЗадач = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивПроектовДляПолученияДанных = Новый Массив;
	МассивПроектовДляПолученияДанных.Добавить(Проект);
	
	Если НовыеДанныеЗадач <> Неопределено Тогда
		Для Каждого КлючЗначение Из НовыеДанныеЗадач Цикл
			
			ПроектнаяЗадача = КлючЗначение.Ключ;
			ДанныеПоЗадаче = КлючЗначение.Значение;
			
			ПроектыВСвязяхЗадачи = ДанныеПоЗадаче.ВнешниеПроекты;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПроектовДляПолученияДанных, ПроектыВСвязяхЗадачи, Истина);
			
		КонецЦикла;
	КонецЕсли;
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = "ВЫБРАТЬ
	|	упоВерсииПроекта.Версия КАК Версия,
	|	упоВерсииПроекта.Проект КАК Проект
	|ПОМЕСТИТЬ ВТ_ТекущиеВерсииПроектов
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|ГДЕ
	|	упоВерсииПроекта.Проект В(&Проекты)
	|	И упоВерсииПроекта.Текущая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущиеВерсииПроектов.Проект КАК Проект,
	|	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель
	|ПОМЕСТИТЬ ВТ_ЗадачиПроектов
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТекущиеВерсииПроектов КАК ВТ_ТекущиеВерсииПроектов
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = ВТ_ТекущиеВерсииПроектов.Версия
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗадачиПроектов.ПроектнаяЗадача КАК ЭлементПроекта,
	|	ВТ_ЗадачиПроектов.ЗадачаРодитель КАК ЭлементРодитель
	|ИЗ
	|	ВТ_ЗадачиПроектов КАК ВТ_ЗадачиПроектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ЭлементПроекта,
	|	упоПредусловияПроектныхЗадачСрезПоследних.ЗадачаПредшественник КАК СвязанныйЭлемент,
	|	ВТ_ЗадачиПроектов.Проект КАК ПроектПредшественника
	|ИЗ
	|	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних КАК упоПредусловияПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадачиПроектов КАК ВТ_ЗадачиПроектов
	|		ПО упоПредусловияПроектныхЗадачСрезПоследних.Версия = ВТ_ЗадачиПроектов.Версия
	|			И упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ВТ_ЗадачиПроектов.ПроектнаяЗадача
	|			И (упоПредусловияПроектныхЗадачСрезПоследних.СвязьСуществует)";
	
	//
	
	ТаблицаПредусловий = Неопределено;
	ТаблицаСвойств = Неопределено;
	
	МассивПроектовСПолученнымиДанными = Новый Массив;
	
	Пока МассивПроектовДляПолученияДанных.Количество() Цикл
		
		ЗапросДанных.УстановитьПараметр("Проекты", МассивПроектовДляПолученияДанных);
		РезультатЗапроса = ЗапросДанных.ВыполнитьПакет();
		
		ДопТаблицаСвойств = РезультатЗапроса[2].Выгрузить();
		ДопТаблицаПредусловий = РезультатЗапроса[3].Выгрузить();
		
		Если ТаблицаПредусловий = Неопределено Тогда
			ТаблицаПредусловий = ДопТаблицаПредусловий;
			ТаблицаСвойств = ДопТаблицаСвойств;
		Иначе
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДопТаблицаПредусловий, ТаблицаПредусловий);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДопТаблицаСвойств, ТаблицаСвойств);
		КонецЕсли;
		
		//
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПроектовСПолученнымиДанными, МассивПроектовДляПолученияДанных);
		МассивПроектовДляПолученияДанных.Очистить();
		
		//
		
		ТаблицаНовыхПроектов = ДопТаблицаПредусловий.Скопировать(, "ПроектПредшественника");
		ТаблицаНовыхПроектов.Свернуть("ПроектПредшественника");			
		Для Каждого СтрокаНовыхПроектов Из ТаблицаНовыхПроектов Цикл
			Если МассивПроектовСПолученнымиДанными.Найти(СтрокаНовыхПроектов.ПроектПредшественника) = Неопределено Тогда
				МассивПроектовДляПолученияДанных.Добавить(СтрокаНовыхПроектов.ПроектПредшественника);	
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	//
	
	Если НовыеДанныеЗадач <> Неопределено Тогда
		
		МассивОчищаемыхТаблиц = Новый Массив;
		МассивОчищаемыхТаблиц.Добавить(Новый Структура("Таблица, ИмяПоляЗадачи", ТаблицаПредусловий, "ЭлементПроекта"));
		МассивОчищаемыхТаблиц.Добавить(Новый Структура("Таблица, ИмяПоляЗадачи", ТаблицаСвойств, "ЭлементПроекта"));
		
		Для Каждого КлючЗначение Из НовыеДанныеЗадач Цикл
			
			ПроектнаяЗадача = КлючЗначение.Ключ;
			ДанныеПоЗадаче = КлючЗначение.Значение;
			
			Для Каждого ДанныеОчищаемойТаблицы Из МассивОчищаемыхТаблиц Цикл
				ЗаписанныеДанныеЗадачи = ДанныеОчищаемойТаблицы.Таблица.НайтиСтроки(Новый Структура(ДанныеОчищаемойТаблицы.ИмяПоляЗадачи, ПроектнаяЗадача));
				Для Каждого ЗаписаннаяСтрока Из ЗаписанныеДанныеЗадачи Цикл
					ДанныеОчищаемойТаблицы.Таблица.Удалить(ЗаписаннаяСтрока);
				КонецЦикла;
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПоЗадаче.Связи, ТаблицаПредусловий);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПоЗадаче.Свойства, ТаблицаСвойств);
			
		КонецЦикла;
		
	КонецЕсли;
	
	//
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("ЭлементПроекта");
	ТаблицаОшибок.Колонки.Добавить("ЭлементПроектаПредставление");
	ТаблицаОшибок.Колонки.Добавить("ТекстОшибки");
	
	упоПроектыИЗадачиСервер.ПроверитьНаЦикличность(ТаблицаСвойств, ТаблицаПредусловий, ТаблицаОшибок);

	Возврат ТаблицаОшибок;
	
КонецФункции 

// Функция - Собрать ошибки зацикливания в одну строку.
//
// Параметры:
//  ТаблицаОшибок			 - ТаблицаЗначений - Таблица ошибок.
// 
// Возвращаемое значение:
//  СтрокаСообщения - Строка.
//
Функция СобратьВТекстОшибкиЦикличностиПроекта(ТаблицаОшибок) Экспорт
	
	Если НЕ ТаблицаОшибок.Количество() Тогда
		Возврат "";	
	КонецЕсли;
	
	МассивТекстаОшибки = Новый Массив;
	МассивТекстаОшибки.Добавить(НСтр("ru = 'Обнаружено зацикливание в связях:'"));
	Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
		МассивТекстаОшибки.Добавить(Символы.ПС);
		МассивТекстаОшибки.Добавить("	");
		МассивТекстаОшибки.Добавить(Строка(СтрокаОшибки.ЭлементПроекта));
	КонецЦикла;
	СтрокаСообщения = СтрСоединить(МассивТекстаОшибки);
	
	Возврат СтрокаСообщения;

КонецФункции 

#КонецОбласти

#Область ПанельСтатусовПроекта

// Возвращает таблицу значений с картой статусов проекта.
//
// Возвращаемое значение:
//	ТаблицаЗначений - карта статусов.
//
Функция ПолучитьКартуСтатусовПроекта() Экспорт
	
	Статусы = Перечисления.упоСостояниеСтатусаПроекта;
	
	БезСтатуса			= Статусы.ПустаяСсылка();
	СтатусВыполняется	= Статусы.Выполняется;
	СтатусЗавершен		= Статусы.Завершен;
	СтатусЗапланирован	= Статусы.Запланирован;
	СтатусОстановлен	= Статусы.Остановлен;
	СтатусУтвержден		= Статусы.Утвержден;
	
	КартаСтатусов = Новый ТаблицаЗначений;
	КартаСтатусов.Колонки.Добавить("СтатусТекущий");	
	КартаСтатусов.Колонки.Добавить("СтатусВозможный");
	КартаСтатусов.Колонки.Добавить("НеобходимоеДействие");
	КартаСтатусов.Колонки.Добавить("ОтобразитьФормуДокумента");
	
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		БезСтатуса, СтатусЗапланирован, "упоРегистрацияПроекта", Истина));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусЗапланирован,	СтатусУтвержден, "упоУтверждениеПланаПроекта", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусЗапланирован, СтатусЗавершен, "упоЗавершениеПроекта", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусУтвержден, СтатусВыполняется, "упоСтартПроектныхРабот", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусУтвержден, СтатусЗавершен, "упоЗавершениеПроекта", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусВыполняется, СтатусОстановлен, "упоОстановкаПроектныхРабот", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусВыполняется, СтатусЗавершен, "упоЗавершениеПроекта", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусОстановлен, СтатусВыполняется, "упоВозобновлениеПроекта", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусОстановлен, СтатусЗавершен, "упоЗавершениеПроекта", Ложь));
	ЗаполнитьЗначенияСвойств(КартаСтатусов.Добавить(),
		Новый Структура("СтатусТекущий, СтатусВозможный, НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтатусЗавершен, СтатусВыполняется, "упоВозобновлениеПроекта", Ложь));	
																		
	Возврат КартаСтатусов;																		
																		
КонецФункции

// Возвращает таблицу значений с уровнями статусов проекта.
//
// Возвращаемое значение:
//	ТаблицаЗначений - уровни статусов.
//
Функция ПолучитьУровниСтатусовПроекта() Экспорт

	Статусы = Перечисления.упоСостояниеСтатусаПроекта;
	
	БезСтатуса			= Статусы.ПустаяСсылка();
	СтатусВыполняется	= Статусы.Выполняется;
	СтатусЗавершен		= Статусы.Завершен;
	СтатусЗапланирован	= Статусы.Запланирован;
	СтатусОстановлен	= Статусы.Остановлен;
	СтатусУтвержден		= Статусы.Утвержден;
	
	УровниСтатусов = Новый ТаблицаЗначений;
	УровниСтатусов.Колонки.Добавить("Статус");	
	УровниСтатусов.Колонки.Добавить("Уровень");
	
	ЗаполнитьЗначенияСвойств(УровниСтатусов.Добавить(), Новый Структура("Статус,			Уровень",
																		БезСтатуса,			1));																		
	ЗаполнитьЗначенияСвойств(УровниСтатусов.Добавить(), Новый Структура("Статус,			Уровень",
																		СтатусЗапланирован,	2));
	ЗаполнитьЗначенияСвойств(УровниСтатусов.Добавить(), Новый Структура("Статус,			Уровень",
																		СтатусУтвержден,	3));																		
	ЗаполнитьЗначенияСвойств(УровниСтатусов.Добавить(), Новый Структура("Статус,			Уровень",
																		СтатусВыполняется,	4));
	ЗаполнитьЗначенияСвойств(УровниСтатусов.Добавить(), Новый Структура("Статус,			Уровень",
																		СтатусОстановлен,	4));																		
	ЗаполнитьЗначенияСвойств(УровниСтатусов.Добавить(), Новый Структура("Статус,			Уровень",
																		СтатусЗавершен,		5));
																		
	Возврат УровниСтатусов;
	
КонецФункции

// Отрисовывает элементы управления панели статусов проекта на форме.
//
// Параметры:
//  Элементы		- Произвольный - коллекция элементов формы.
//  ОсновнаяГруппа	- Строка - имя группы формы для добавления новых элементов.
//  ИмяКоманды		- Строка - имя команды, которая будет выполняться при нажатии кнопок смены статуса.
//  Группировка		- Строка - может иметь значение "Вертикальная" или "Горизонтальная".
//								Влияет на режим группировки создаваемых элементов.
//
Процедура ОтрисоватьЭлементыФормы(Элементы,
								  ОсновнаяГруппа = "ГруппаОсновная",
								  ИмяКоманды = "КомандаСменаСтатуса", 
								  Группировка = "Вертикальная") Экспорт
	
	УровниСтатусов = ПолучитьУровниСтатусовПроекта();
	
	тзУровни = УровниСтатусов.Скопировать(,"Уровень");
	тзУровни.Свернуть("Уровень");
	
	Если ГруппировкаПодчиненныхЭлементовФормы[Группировка] = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная Тогда
		Элементы[ОсновнаяГруппа].Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная; 
	Иначе
		Элементы[ОсновнаяГруппа].Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
		
	Элементы[ОсновнаяГруппа].ШиринаПодчиненныхЭлементов = ШиринаПодчиненныхЭлементовФормы.Одинаковая;
	
	МаксимальноеКоличествоКнопокВУровне = 1;
	
	Для Каждого СтрокаУровень Из тзУровни Цикл
		МассивСтатусовУровня = УровниСтатусов.НайтиСтроки(Новый Структура("Уровень", СтрокаУровень.Уровень));
		Если МассивСтатусовУровня.Количество() > МаксимальноеКоличествоКнопокВУровне Тогда
			МаксимальноеКоличествоКнопокВУровне = МассивСтатусовУровня.Количество();
		КонецЕсли;
	КонецЦикла;
	
	СчетчикУровней = 1;
	
	Для Каждого СтрокаУровень Из тзУровни Цикл
		
		МассивСтатусовУровня = УровниСтатусов.НайтиСтроки(Новый Структура("Уровень", СтрокаУровень.Уровень));
		
		ГруппаФормыУровня = Элементы.Добавить("ГруппаУровня" + СчетчикУровней, тип("ГруппаФормы"), Элементы[ОсновнаяГруппа]);
		ГруппаФормыУровня.Вид 							= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаФормыУровня.Группировка 					= ГруппировкаПодчиненныхЭлементовФормы[Группировка];
		ГруппаФормыУровня.Отображение 					= ОтображениеОбычнойГруппы.Нет;
		ГруппаФормыУровня.ОтображатьЗаголовок 			= Ложь;
		ГруппаФормыУровня.ШиринаПодчиненныхЭлементов 	= ШиринаПодчиненныхЭлементовФормы.Одинаковая;
		ГруппаФормыУровня.Объединенная 					= Ложь;
		
		Для Каждого СтатусУровня Из МассивСтатусовУровня Цикл											  
			ИмяКнопки 		= упоПроектыИЗадачиОбщие.ПолучитьИмяКнопкиПоСтатусу(СтатусУровня.Статус);												  
			ЗаголовокКнопки = упоПроектыИЗадачиОбщие.ПолучитьЗаголовокКнопкиПоСтатусу(СтатусУровня.Статус);
			
			КновкаФормыСтатуса = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаФормыУровня); 	
			КновкаФормыСтатуса.Заголовок 	= ЗаголовокКнопки;
			КновкаФормыСтатуса.ИмяКоманды 	= ИмяКоманды;
		КонецЦикла;
		
		СчетчикУровней = СчетчикУровней + 1;
		
	КонецЦикла;
		
КонецПроцедуры

// Возвращает текущий статус проекта и регистратор этого статуса.
//
// Параметры:
//  Проект	- СправочникСсылка.Проекты - проект.
//
// Возвращаемое значение:
//	Структура - свойства:
//		* СтатусПроекта - ПеречислениеСсылка.упоСостояниеСтатусаПроекта - статус проекта.
//		* Регистратор 	- ДокументСсылка - регистратор.
//
Функция СостояниеПроекта(Проект) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	РегСтатус.СтатусПроекта,
	                      |	РегСтатус.Регистратор
	                      |ИЗ
	                      |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК РегСтатус");
	Запрос.УстановитьПараметр("Проект", Проект);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Структура("СтатусПроекта, Регистратор", 
			Перечисления.упоСостояниеСтатусаПроекта.ПустаяСсылка(), Неопределено);
	КонецЕсли;
	Выбор = Результат.Выбрать();
	Выбор.Следующий();
	
	Возврат Новый Структура("СтатусПроекта, Регистратор",Выбор.СтатусПроекта, Выбор.Регистратор);
	
КонецФункции

// Возвращает необходимое действие для изменения статуса.
//
// Параметры:
//  ТекущийСтатусПроекта	- ПеречислениеСсылка.упоСостояниеСтатусаПроекта - текущий статус.
//  ВыбранныйСтатус			- ПеречислениеСсылка.упоСостояниеСтатусаПроекта - выбранный статус.
//
// Возвращаемое значение:
//   Строка - необходимое действие.
//
Функция ПолучитьНеобходимоеДействие(Знач ТекущийСтатусПроекта, Знач ВыбранныйСтатус) Экспорт
	
	КартаСтатусов = ПолучитьКартуСтатусовПроекта();
	
	СтрокаДействия = КартаСтатусов.НайтиСтроки(Новый Структура("СтатусТекущий, СтатусВозможный", ТекущийСтатусПроекта, ВыбранныйСтатус));
	Если СтрокаДействия.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Новый Структура("НеобходимоеДействие, ОтобразитьФормуДокумента",
		СтрокаДействия[0].НеобходимоеДействие, СтрокаДействия[0].ОтобразитьФормуДокумента);
КонецФункции

// Обновляет информацию о текущем статусе на форме.
//
// Параметры:
//  Форма									- УправляемаяФорма			- форма.
//  Проект									- СправочникСсылка.Проекты 	- проект.
//  ИмяРеквизитаТекущийСтатусПроекта		- Строка 					- имя реквизита формы, в котором хранится текущий статус проекта,
//												по умолчанию - "ТекущийСтатусПроекта".
//  ИмяРеквизитаРегистраторТекущегоСтатуса	- Строка 					- имя реквизита формы, в котором хранится ссылка 
//												на регистратор текущего статуса проекта, по умолчанию - "РегистраторТекущегоСтатуса".
//
Процедура ОбновитьИнформациюОСтатусеПроекта(Форма,
											Проект,
											ИмяРеквизитаТекущийСтатусПроекта = "ТекущийСтатусПроекта",
											ИмяРеквизитаРегистраторТекущегоСтатуса = "РегистраторТекущегоСтатуса") Экспорт
	СтатусПроекта = СостояниеПроекта(Проект);
	Форма[ИмяРеквизитаТекущийСтатусПроекта] = СтатусПроекта.СтатусПроекта;
	Форма[ИмяРеквизитаРегистраторТекущегоСтатуса] = СтатусПроекта.Регистратор;
КонецПроцедуры

// Устанавливает доступность, цвет фона, заголовок элементов управления панели статусов проекта,
// в зависимости от текущего статуса.
//
// Параметры:
//  Элементы				- Произвольный - коллекция элементов формы.
//  ТекущийСтатусПроекта	- ПеречислениеСсылка.упоСостояниеСтатусаПроекта - текущий статус.
//  Проект					- СправочникСсылка.Проекты - проект.
//
Процедура УстановитьДоступностьРаскраситьЭлементы(Элементы, ТекущийСтатусПроекта, Проект) Экспорт
	
	УровниСтатусов = ПолучитьУровниСтатусовПроекта();
	КартаСтатусов  = ПолучитьКартуСтатусовПроекта();
	
	ЦветВажнойКнопки = ЦветаСтиля.упоЦветДиаграммыГантаЗадачаЗапланирована;
	ЦветОбычнойКнопки = ЦветаСтиля.ЦветФонаКнопки;
	
	Для каждого Статус Из УровниСтатусов Цикл
		ИмяКнопки = упоПроектыИЗадачиОбщие.ПолучитьИмяКнопкиПоСтатусу(Статус.Статус);
		Элементы[ИмяКнопки].Доступность = Ложь;
		Элементы[ИмяКнопки].ЦветФона = ЦветОбычнойКнопки;
		ДоступныеСтатусы = КартаСтатусов.НайтиСтроки(Новый Структура("СтатусВозможный", Статус.Статус));
		Элементы[ИмяКнопки].Заголовок = ПолучитьЗаголовокКнопкиПоСтатусуСУчетомДействия(Статус.Статус,
			?(ДоступныеСтатусы.Количество() = 0, Неопределено, ДоступныеСтатусы[0].НеобходимоеДействие));
	КонецЦикла;
	
	Элементы[упоПроектыИЗадачиОбщие.ПолучитьИмяКнопкиПоСтатусу(ТекущийСтатусПроекта)].ЦветФона = ЦветВажнойКнопки;
	
	ДоступныеСтатусы = КартаСтатусов.НайтиСтроки(Новый Структура("СтатусТекущий", ТекущийСтатусПроекта));	
	
	Для каждого Статус Из ДоступныеСтатусы Цикл
		Если Не ПроверитьВозможностьПереходаВСтатус(Проект, ТекущийСтатусПроекта, Статус.СтатусВозможный) Тогда
			Продолжить;
		КонецЕсли;
		ИмяКнопки = упоПроектыИЗадачиОбщие.ПолучитьИмяКнопкиПоСтатусу(Статус.СтатусВозможный);
		Элементы[ИмяКнопки].Доступность = Истина;
		Элементы[ИмяКнопки].Заголовок = ПолучитьЗаголовокКнопкиПоСтатусуСУчетомДействия(Статус.СтатусВозможный, Статус.НеобходимоеДействие);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет необходимые действия при смене статуса проекта.
//
// Параметры:
//  Форма									- УправляемаяФорма 								- форма.
//  Элементы								- Произвольный 									- коллекция элементов формы.
//  Проект									- СправочникСсылка.Проекты 						- проект.
//  ТекущийСтатусПроекта					- ПеречислениеСсылка.упоСостояниеСтатусаПроекта - текущий статус.
//  ИмяРеквизитаТекущийСтатусПроекта		- Строка 										- имя реквизита формы,
//												в котором хранится текущий статус проекта, по умолчанию: "ТекущийСтатусПроекта".
//  ИмяРеквизитаРегистраторТекущегоСтатуса	- Строка 										- имя реквизита формы,
//												в котором хранится ссылка на регистратор текущего статуса проекта, по умолчанию -
//												"РегистраторТекущегоСтатуса".
//
Процедура ОбработкаСменыСтатусаПроекта(Форма,
									   Элементы,
									   Проект,
									   ТекущийСтатусПроекта,
									   ИмяРеквизитаТекущийСтатусПроекта = "ТекущийСтатусПроекта", 
									   ИмяРеквизитаРегистраторТекущегоСтатуса = "РегистраторТекущегоСтатуса") Экспорт
	ОбновитьИнформациюОСтатусеПроекта(Форма, Проект, ИмяРеквизитаТекущийСтатусПроекта, ИмяРеквизитаРегистраторТекущегоСтатуса);
	УстановитьДоступностьРаскраситьЭлементы(Элементы, ТекущийСтатусПроекта, Проект);	
КонецПроцедуры

// Создает и проводит документ смены статуса.
//
// Параметры:
//  ИмяДокумента				- Строка 					- имя документа, который нужно создать.
//  РегистраторТекущегоСтатуса	- ДокументСсылка			- ссылка на документ-регистратор текущего статуса.
//  Проект						- СправочникСсылка.Проекты 	- проект.
//
// Возвращаемое значение:
//	Булево - признак успешного создания документа.
//
Функция СоздатьПровестиДокументСменыСтатуса(ИмяДокумента, РегистраторТекущегоСтатуса, Проект, 
	ПроверкаСтруктурыПроектаПройдена = Неопределено) Экспорт
	
	ДокументОбъект = Документы[ИмяДокумента].СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();
	ДокументОбъект.Заполнить(?(ЗначениеЗаполнено(РегистраторТекущегоСтатуса), РегистраторТекущегоСтатуса, Проект));
	ДокументОбъект.ДополнительныеСвойства.Вставить("ПроверкаСтруктурыПроектаПройдена", ПроверкаСтруктурыПроектаПройдена); 
	Попытка
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());   
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проведение документа'"), УровеньЖурналаРегистрации.Ошибка,
								ДокументОбъект.Метаданные(),, ПредставлениеОшибки);

		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ошибка записи документа. Подробнее см. журнал регистрации.'"));
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Проверяет дату смены статуса проекта перед записью.
//
// Параметры:
//  Источник            - ДокументОбъект
//  Отказ               - Булево
//  РежимЗаписи         - РежимЗаписисДокумента 
//  РежимПроведения     - РежимПроведенияДокумента
//
Процедура ПроверкаДатыСменыСтатусаПроектаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.Дата > КонецДня(ТекущаяДатаСеанса()) Тогда
		ТекстСообщения = НСтр("ru = 'Нельзя проводить документ будущим числом (относительно текущего дня)'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	Если ЭтоЗаписьНепроведенного(Источник, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Проект", Источник.Проект);
	Запрос.УстановитьПараметр("Дата", Источник.Дата);

	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Т.СтатусПроекта КАК СтатусПроекта,
	               |	Т.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПервых(&Дата, Проект = &Проект) КАК Т
	               |ГДЕ
	               |	Т.Регистратор <> &Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ТекстСообщения = НСтр("ru = 'Нельзя проводить документ задним числом при уже установленном статусе: %1'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.СтатусПроекта);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	Отказ = Истина;
	
КонецПроцедуры

// Проверяет возможность изменения статуса проекта.
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект - Документ изменения статуса проекта
//  Отказ			 - Булево 
//  Заголовок		 - Строка 
//
Процедура ПроверкаВозможностиИзмененияСтатусаПроекта(ДокументОбъект, Отказ, Заголовок = "") Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ упоРаботаСОчередямиВызовСервера.ВозможностьДействий_ОчередьРаспределенияТрудозатрат(ДокументОбъект.Проект) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	  
	// Если проверка уже производилась, например, из модуля формы, то повторную проверку не делаем.
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("ПроверкаСтруктурыПроектаПройдена") 
		И ДокументОбъект.ДополнительныеСвойства.ПроверкаСтруктурыПроектаПройдена = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРасшифровкиСообщения = Новый Структура;
	ДанныеРасшифровкиСообщения.Вставить("ИмяДокумента", ДокументОбъект.Метаданные().Имя);
	ДанныеРасшифровкиСообщения.Вставить("ДокументСсылка", ДокументОбъект.Ссылка);
	ДанныеРасшифровкиСообщения.Вставить("Заголовок", Заголовок);

	упоПроектыИЗадачиВызовСервера.ЕстьОшибкиСтруктурыПроекта(ДокументОбъект.Проект, ДанныеРасшифровкиСообщения, Отказ);
	
КонецПроцедуры
	
#КонецОбласти

#Область СворачиваниеРазворачиваниеДереваСтруктурыПроекта

// Сохраняет настройки развернутых строк пользователя.
//
// Параметры:
//  СписокОбъектов	 - СписокЗначений, ТаблицаЗначений 	- коллекция настроек.
//  Проект			 - СправочникСсылка.Проекты 		- проект.
//  Пользователь	 - СправочникСсылка.Пользователи	- пользователь, которому принадлежат настройки.
//  ЭтоСправочники	 - Булево 							- признак справочников.
//
Процедура СохранитьНастройкиРазвернутыхСтрокПользователя(Знач СписокОбъектов,
														 Знач Проект,
														 Знач Пользователь = Неопределено,
														 ЭтоСправочники = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ТипЗнч(СписокОбъектов) = Тип("СписокЗначений") Тогда
		ТаблицаКСохранению = ПолучитьТаблицуКСохранению(СписокОбъектов, Проект, Пользователь, ЭтоСправочники);
	Иначе
		ТаблицаКСохранению = СписокОбъектов.Скопировать();
		
		ТаблицаКСохранению.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		ТаблицаКСохранению.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
		
		ТаблицаКСохранению.ЗаполнитьЗначения(Проект, "Проект");
		ТаблицаКСохранению.ЗаполнитьЗначения(Пользователь, "Пользователь");
	КонецЕсли;		
	
	НаборЗаписей = РегистрыСведений.упоРазвернутыеСтрокиПользователя.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Проект.Установить(Проект);
	
	НаборЗаписей.Загрузить(ТаблицаКСохранению);
	
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),
		Новый Структура("Проект, Пользователь, ФлагНаличияНастроек", Проект, Пользователь, Истина));
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры

// Получает настройки развернутых строк пользователя.
//
// Параметры:
//  Проект					 - СправочникСсылка.Проекты 		- проект.
//  Пользователь			 - СправочникСсылка.Пользователи	- пользователь, которому принадлежат настройки.
//  ВозвращатьСправочники	 - Булево 							- признак того, что надо возвращать справочники.
//
// Возвращаемое значение:
//	СписокЗначений - список настроек.
//
Функция ПолучитьНастройкиРазвернутыхСтрокПользователя(Знач Проект,
													  Знач Пользователь = Неопределено,
													  ВозвращатьСправочники = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	упоРазвернутыеСтрокиПользователя.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
		|ИЗ
		|	РегистрСведений.упоРазвернутыеСтрокиПользователя КАК упоРазвернутыеСтрокиПользователя
		|ГДЕ
		|	упоРазвернутыеСтрокиПользователя.Проект = &Проект
		|	И упоРазвернутыеСтрокиПользователя.Пользователь = &Пользователь
		|	И НЕ упоРазвернутыеСтрокиПользователя.ФлагНаличияНастроек";
	
	Если ВозвращатьСправочники Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"упоРазвернутыеСтрокиПользователя.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача", 
			"упоРазвернутыеСтрокиПользователя.ПроектнаяЗадача КАК ПроектнаяЗадача"); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	Выбор = Результат.Выбрать();
	
	СписокЗначенийДляВозврата = Новый СписокЗначений;
	
	Пока Выбор.Следующий() Цикл
		СписокЗначенийДляВозврата.Добавить(Выбор.ПроектнаяЗадача);	
	КонецЦикла;
	
	Возврат СписокЗначенийДляВозврата;
	
КонецФункции

// Определяет, есть ли сохраненные настройки.
//
// Параметры:
//  Проект					 - СправочникСсылка.Проекты 		- проект.
//  Пользователь			 - СправочникСсылка.Пользователи	- пользователь, которому принадлежат настройки.
//
// Возвращаемое значение:
//	Булево - наличие настройки.
//
Функция НаличиеНастройкиРазвернутыхСтрокПользователя(Знач Проект, Знач Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	упоРазвернутыеСтрокиПользователя.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
		|ИЗ
		|	РегистрСведений.упоРазвернутыеСтрокиПользователя КАК упоРазвернутыеСтрокиПользователя
		|ГДЕ
		|	упоРазвернутыеСтрокиПользователя.Проект = &Проект
		|	И упоРазвернутыеСтрокиПользователя.Пользователь = &Пользователь";
		
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

#КонецОбласти

#Область ОтменаПроектныхЗадач

// Отменяет заданные проектные задачи
// 
// Параметры:
//	Проект - СправочникСсылка.Проекты - Проект отменяемых проектных задач
//	ПроектныеЗадачи - Массив из ДокументСсылка.упоПроектнаяЗадача
//
// Возвращаемое значение:
//	Булево - Признак успешности отмены задач
//
Функция ОтменитьПроектныеЗадачи(Проект, ПроектныеЗадачи) Экспорт

	Если ПроектныеЗадачи.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДокСохраненияДанных = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	ЗаполнитьДокументСохраненияДанных(ДокСохраненияДанных, Проект, ПроектныеЗадачи);
	
	УспешнаяЗапись = Ложь;
	Попытка
		
		ДокСохраненияДанных.Записать(РежимЗаписиДокумента.Проведение);
		УспешнаяЗапись = Истина;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);   
		ЗаписьЖурналаРегистрации("ОшибкаОтменыЗадачПроекта", УровеньЖурналаРегистрации.Ошибка, , , ПредставлениеОшибки);
			
		ОшибкаДляПользователя = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);	
		ШаблонТекстаОшибки = НСтр("ru = 'Не удалось отменить задачи проекта ""%1"" по причине: ""%2"".
		|Подробнее см. журнал регистрации.'");
		ТекстОшибки = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, Проект, ОшибкаДляПользователя);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		
	КонецПопытки;
	
	Возврат УспешнаяЗапись;
	
КонецФункции	
	
#КонецОбласти

#Область ОчисткаПроекта

// Отменяет проектные задачи проекта и помечает на удаление документы, в которых есть связи с очищаемым проектом
//
// Параметры:
//	Проект - СправочникСсылка - ссылка на проект.
// 
// Возвращаемое значение:
//  Булево - Признах успеха очистки проекта.
//
Функция ОчиститьПроект(Проект) Экспорт
	
	// Каждое поле структры заполняем отобранными данными из БД.
	Соединение = ПолучитьТекстСоединенияДляФильтраПоОтмененнымЗадачам();
	МассивДПЗ    = ПолучитьДокументыПроекта(Проект, "упоПроектнаяЗадача", "", Соединение);
	ЗадачиУспешноОтменены = ОтменитьПроектныеЗадачи(Проект, МассивДПЗ);
	Если Не ЗадачиУспешноОтменены Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивДРКПП  = ПолучитьДокументыПроекта(Проект, "упоРасчетКалендарногоПланаПроекта", "");
	УдалитьДокументы(МассивДРКПП);
	МассивДИРПЗ  = ПолучитьДокументыПроекта(Проект, "упоИзменениеРуководителяПроектнойЗадачи", "");
	УдалитьДокументы(МассивДИРПЗ);
	МассивДРФЗМР = ПолучитьДокументыПроекта(Проект, "упоРегистрацияФактическихЗатратМатРесурсов", "ПроектнаяЗадача");
	УдалитьДокументы(МассивДРФЗМР);
	МассивАП	 = ПолучитьДокументыПроекта(Проект, "упоАктуализацияПроекта", "");
	УдалитьДокументы(МассивАП);
	МассивАПР 	 = ПолучитьДокументыПроекта(Проект, "упоРучнаяАктуализацияПроекта", "");
	УдалитьДокументы(МассивАПР);	
	
	Возврат Истина;
	
КонецФункции	

// Получает массив ссылок на конкретный тип документов проекта по заданному имени документа метаданных.
// 
// Параметры:
//  Проект       - СправочникСсылка - ссылка на проект.
//  ИмяДокумента - Строка - содержит имя документа метаданных.
//  Условие 	 - Строка - содержит некое условие для подстановки в общий текст запроса.
//	Соединение	 - Строка - содержит некое соединение для подстановки в общий текст запроса.
// 
// Возвращаемое значение:
//  Массив - список ссылкок.
// 
Функция ПолучитьДокументыПроекта(Проект, ИмяДокумента, Условие, Соединение = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Если Не Условие = "" Тогда
		Условие = Условие + ".";
	КонецЕсли;
	
	// Получим все задачи проекта.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.Ссылка
		|ИЗ
		|	Документ." + ИмяДокумента + " КАК Док
		|	" + Соединение + "	
		|ГДЕ
		|	Док." + Условие + "Проект = &Проект
		|     И Док.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Док.Дата";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область Прочее

// Помечает на удаление проектную задачу и производит расчет календарного плана.
//
// Параметры:
//  ПроектнаяЗадача						 - ДокументСсылка.упоПроектнаяЗадача
//  СтруктураУдаляемыеОбъекты			 - Структура - состав:
//  * СписокУдаляемыхЗадач - СписокЗначений - удаляемая задача и ее подчиненные.
//  * СписокСвязанныхЗадач - задачи, из которых нужно удалить связи.
//  ТекстОшибкиРасчетКалендарногоПлана	 - Строка
//  ПроводитьДокументРасчета			 - Булево
//
Процедура УдалитьПроектнуюЗадачу(ПроектнаяЗадача, СтруктураУдаляемыеОбъекты, ТекстОшибкиРасчетКалендарногоПлана = "", ПроводитьДокументРасчета = Истина) Экспорт

	НачатьТранзакцию();
	
	СписокСвязанныхЗадач = СтруктураУдаляемыеОбъекты.СписокСвязанныхЗадач;
	СписокУдаляемыхЗадач = СтруктураУдаляемыеОбъекты.СписокУдаляемыхЗадач;
	
	// Удаление связей задач.
	
	Для Каждого СвязаннаяЗадача Из СписокСвязанныхЗадач Цикл
		
		ПроектнаяЗадачаОбъект = СвязаннаяЗадача.Значение.ПолучитьОбъект();
		ПроектнаяЗадачаОбъект.Дата = ТекущаяДата();
		ПроектнаяЗадачаОбъект.ПолучитьДанныеВерсии(Неопределено);
		
		ТЧПредшественники = ПроектнаяЗадачаОбъект.ПредусловияЗадачи;
		Для Каждого УдаляемаяЗадача Из СписокУдаляемыхЗадач Цикл
			НайденныеСтроки = ТЧПредшественники.НайтиСтроки(Новый Структура("ЗадачаПредшественник", УдаляемаяЗадача.Значение));   			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл  			
				ТЧПредшественники.Удалить(НайденнаяСтрока);			
			КонецЦикла;
		КонецЦикла;	
		
		Если ПроектнаяЗадачаОбъект.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		ПроектнаяЗадачаОбъект.Записать(РежимЗаписи);
		
	КонецЦикла;
	
	// Удаление задачи и ее подчиненных.
	
	Для Каждого ПодчиненнаяЗадача Из СписокУдаляемыхЗадач Цикл  		
		ПроектнаяЗадачаОбъект = ПодчиненнаяЗадача.Значение.ПолучитьОбъект();
		ПроектнаяЗадачаОбъект.ДополнительныеСвойства.Вставить("УдалениеПроектнойЗадачи", Истина);
		ПроектнаяЗадачаОбъект.УстановитьПометкуУдаления(Истина);  		
	КонецЦикла;
	
	// Удаление данных о задаче из документов "Сохранение данных проекта", "Расчет календарного плана",
	// "Актуализация проекта", "Версия плана проекта".
	УдалитьЗадачиИзСлужебныхДокументов(СписокУдаляемыхЗадач);	
		
	// Расчет календарного плана.	
	Если ПроводитьДокументРасчета Тогда
		ПровестиРасчетКалендарногоПланаПроекта(ПроектнаяЗадача.Проект, ТекстОшибкиРасчетКалендарногоПлана); 	
	КонецЕсли;
	
	//
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Формирует таблицу элементов проекта и таблицу исключений для расчета сроков.
//
// Параметры:
//  ДанныеПроекта - Соответствие, ТаблицаЗначений.
//  ТаблицаЭлементов - ТаблицаЗначений.
//  ТаблицаИсключений - ТаблицаЗначений.
//  ЭлДереваПоИдСтроки - Соответствие - необходимо при вызове из обработки "Упрощенный ввод структуры проекта".
//
Процедура ПодготовитьДанныеДляРасчетаСроков(ДанныеПроекта, ТаблицаЭлементов, ТаблицаИсключений,
	ЭлДереваПоИдСтроки = Неопределено) Экспорт
	
	ТаблицаЭлементов.Колонки.Добавить("ДлительностьБезУчетаКалендаряПроекта");
	
	// ТипЗадачи:
	// 0 - Модель пакета работ;
	// 1 - Этап;
	// 2 - Пакет работ;
	// 3 - Веха;
	// 4 - Операция;
	// 5 - ПЗ типа Веха.
	
	// Режимы:
	// 0 - Вручную;
	// 1 - Автоматически.
	
	Для каждого ЭлементПроекта Из ДанныеПроекта Цикл
		
		Если ТипЗнч(ЭлементПроекта) = Тип("КлючИЗначение") Тогда
			СтрокаДанных = ЭлементПроекта.Значение;	
			ИспользуютсяИдентификаторыЗадач = Истина;
		Иначе
			СтрокаДанных = ЭлементПроекта;
			ИспользуютсяИдентификаторыЗадач = Ложь;
		КонецЕсли;	
		
		новыйЭлемент = ТаблицаЭлементов.Добавить();
		Если ИспользуютсяИдентификаторыЗадач Тогда
			новыйЭлемент.ЭлементПроекта = СтрокаДанных.Идентификатор;
			новыйЭлемент.ЭлементРодитель = СтрокаДанных.ИдентификаторРодителя;
			новыйЭлемент.НазваниеПЗ = СтрокаДанных.НазваниеЗадачи;
			новыйЭлемент.КодСДР = СтрокаДанных.КодСДР;
		Иначе
			новыйЭлемент.ЭлементПроекта = СтрокаДанных.ЗадачаСсылка;
			новыйЭлемент.ЭлементРодитель = СтрокаДанных.Родитель;
			новыйЭлемент.НазваниеПЗ = СтрокаДанных.НазваниеЗадачи;
			новыйЭлемент.КодСДР = СтрокаДанных.КодСДР;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.ЕдиницаИзмерения) Тогда
			новыйЭлемент.Длительность = СтрокаДанных.Длительность * СтрокаДанных.ЕдиницаИзмерения.Коэффициент;
		ИначеЕсли НЕ ЗначениеЗаполнено(новыйЭлемент.Длительность) Тогда
			новыйЭлемент.Длительность = 0;
		КонецЕсли;	
		
		НовыйЭлемент.ДлительностьБезУчетаКалендаряПроекта = СтрокаДанных.ДлительностьБезУчетаКалендаряПроекта;
		
		Если ЭлДереваПоИдСтроки <> Неопределено Тогда
			ЭлДереваПоИдСтроки.Вставить(СтрокаДанных.ИдСтроки, Новый Структура("ПЗ,НазваниеПЗ,КодСДР",новыйЭлемент.ЭлементПроекта,СтрокаДанных.Задача,СтрокаДанных.КодСДР));
		КонецЕсли;
		
		Если СтрокаДанных.ТипЗадачи % 6 = 3   // Вехи.
			ИЛИ  СтрокаДанных.РежимВвода = 0 И СтрокаДанных.ТипЗадачи % 6 <> 4  // Ручной ввод сроков (кроме операций).
			ИЛИ СтрокаДанных.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Завершена // Завершенные.
			ИЛИ СтрокаДанных.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта Тогда // Закрытые.
			
			НовоеИсключение = ТаблицаИсключений.Добавить();
			НовоеИсключение.ЭлементПроекта = новыйЭлемент.ЭлементПроекта;
			НовоеИсключение.НазваниеПЗ = новыйЭлемент.НазваниеПЗ;
			НовоеИсключение.КодСДР = новыйЭлемент.КодСДР;
			НовоеИсключение.ДатаНачала = СтрокаДанных.ДатаНачала;
			НовоеИсключение.ДатаЗавершения = СтрокаДанных.ДатаЗавершения;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Получает тип задачи числом:
//  0 - Модель пакета работ;
//  1 - Этап;
//  2 - Пакет работ;
//  3 - Веха;
//  4 - Операция;
//  5 - ПЗ типа Веха.
//
// Параметры:
//  СтрокаДанных - СтрокаТаблицыЗначений, ВыборкаИзРезультатаЗапроса.
// 
// Возвращаемое значение:
//  Число
//
Функция ПолучитьТипЗадачиЧислом(СтрокаДанных) Экспорт

	Если СтрокаДанных.ЭтоВеха Тогда
		лТипЗадачи = 5; // Это веха.
	ИначеЕсли СтрокаДанных.ЭтоПакетРабот И СтрокаДанных.ЭтоМодельПакетаРабот Тогда
		лТипЗадачи = 0; // Это модель пакета работ.
	ИначеЕсли СтрокаДанных.ЭтоПакетРабот И НЕ СтрокаДанных.ЭтоМодельПакетаРабот Тогда
		лТипЗадачи = 2; // Это пакет работ.
	Иначе
		лТипЗадачи = 1; // Это этап.
	КонецЕсли;
	
	Возврат лТипЗадачи;

КонецФункции

// Получает задачи по которым списан факт.
//
// Параметры:
//	ПроектПроектныеЗадачи - СписокЗначений, СправочникСсылка.Проекты.
//
// Возвращаемое значение:
//	СписокЗначений:
//		* Значение - ДокументСсылка.упоПроектнаяЗадача.
//		* Представление - Строка - Код СДР + Название проектной задачи (если входящий параметр имеет тип СписокЗначений).
//
Функция ПолучитьЗадачиСписанФакт(ПроектПроектныеЗадачи) Экспорт

	СписокЗадачСписанФакт = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ПроектПроектныеЗадачи) = Тип("СправочникСсылка.Проекты") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	упоФактТрудозатратСводно.ПроектнаяЗадача КАК ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоФактТрудозатратСводно КАК упоФактТрудозатратСводно
		               |ГДЕ
		               |	(упоФактТрудозатратСводно.КоличествоЧасов <> 0
		               |			ИЛИ упоФактТрудозатратСводно.Стоимость <> 0)
		               |	И упоФактТрудозатратСводно.ПроектнаяЗадача.Проект = &Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	упоФактЗатратМатериальныхРесурсов.ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоФактЗатратМатериальныхРесурсов КАК упоФактЗатратМатериальныхРесурсов
		               |ГДЕ
		               |	(упоФактЗатратМатериальныхРесурсов.Количество <> 0
		               |			ИЛИ упоФактЗатратМатериальныхРесурсов.Стоимость <> 0)
		               |	И упоФактЗатратМатериальныхРесурсов.ПроектнаяЗадача.Проект = &Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	упоФактДоходовИРасходовПоДням.ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоФактДоходовИРасходовПоДням КАК упоФактДоходовИРасходовПоДням
		               |ГДЕ
		               |	упоФактДоходовИРасходовПоДням.Сумма <> 0
		               |	И упоФактДоходовИРасходовПоДням.ПроектнаяЗадача.Проект = &Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	упоФактДополнительныхЗатрат.ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоФактДополнительныхЗатрат КАК упоФактДополнительныхЗатрат
		               |ГДЕ
		               |	упоФактДополнительныхЗатрат.Стоимость <> 0
		               |	И упоФактДополнительныхЗатрат.ПроектнаяЗадача.Проект = &Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	упоФактДвиженийДенежныхСредств.ПроектнаяЗадача
		               |ИЗ
		               |	РегистрСведений.упоФактДвиженийДенежныхСредств КАК упоФактДвиженийДенежныхСредств
		               |ГДЕ
		               |	упоФактДвиженийДенежныхСредств.Сумма <> 0
		               |	И упоФактДвиженийДенежныхСредств.ПроектнаяЗадача.Проект = &Проект
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача
		               |ИЗ
		               |	РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(, , , ПроектнаяЗадача.Проект = &Проект) КАК упоФактВыполненияОбъемовОбороты
		               |ГДЕ
		               |	упоФактВыполненияОбъемовОбороты.СуммаОборот <> 0";
		
		Запрос.УстановитьПараметр("Проект", ПроектПроектныеЗадачи);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ПроектныеЗадачиСписанФакт.ПроектнаяЗадача КАК ПроектнаяЗадача
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		упоФактТрудозатратСводно.ПроектнаяЗадача КАК ПроектнаяЗадача
		               |	ИЗ
		               |		РегистрСведений.упоФактТрудозатратСводно КАК упоФактТрудозатратСводно
		               |	ГДЕ
		               |		упоФактТрудозатратСводно.ПроектнаяЗадача В(&СписокЗадач)
		               |		И (упоФактТрудозатратСводно.КоличествоЧасов <> 0
		               |				ИЛИ упоФактТрудозатратСводно.Стоимость <> 0)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		упоФактЗатратМатериальныхРесурсов.ПроектнаяЗадача
		               |	ИЗ
		               |		РегистрСведений.упоФактЗатратМатериальныхРесурсов КАК упоФактЗатратМатериальныхРесурсов
		               |	ГДЕ
		               |		упоФактЗатратМатериальныхРесурсов.ПроектнаяЗадача В(&СписокЗадач)
		               |		И (упоФактЗатратМатериальныхРесурсов.Количество <> 0
		               |				ИЛИ упоФактЗатратМатериальныхРесурсов.Стоимость <> 0)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		упоФактДоходовИРасходовПоДням.ПроектнаяЗадача
		               |	ИЗ
		               |		РегистрСведений.упоФактДоходовИРасходовПоДням КАК упоФактДоходовИРасходовПоДням
		               |	ГДЕ
		               |		упоФактДоходовИРасходовПоДням.ПроектнаяЗадача В(&СписокЗадач)
		               |		И упоФактДоходовИРасходовПоДням.Сумма <> 0
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		упоФактДополнительныхЗатрат.ПроектнаяЗадача
		               |	ИЗ
		               |		РегистрСведений.упоФактДополнительныхЗатрат КАК упоФактДополнительныхЗатрат
		               |	ГДЕ
		               |		упоФактДополнительныхЗатрат.ПроектнаяЗадача В(&СписокЗадач)
		               |		И упоФактДополнительныхЗатрат.Стоимость <> 0
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		упоФактДвиженийДенежныхСредств.ПроектнаяЗадача
		               |	ИЗ
		               |		РегистрСведений.упоФактДвиженийДенежныхСредств КАК упоФактДвиженийДенежныхСредств
		               |	ГДЕ
		               |		упоФактДвиженийДенежныхСредств.ПроектнаяЗадача В(&СписокЗадач)
		               |		И упоФактДвиженийДенежныхСредств.Сумма <> 0
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		упоФактВыполненияОбъемовОбороты.ПроектнаяЗадача
		               |	ИЗ
		               |		РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(, , , ПроектнаяЗадача В (&СписокЗадач)) КАК упоФактВыполненияОбъемовОбороты
		               |	ГДЕ
		               |		упоФактВыполненияОбъемовОбороты.СуммаОборот <> 0) КАК ПроектныеЗадачиСписанФакт"; 
				   
		Запрос.УстановитьПараметр("СписокЗадач", ПроектПроектныеЗадачи);	
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(ПроектПроектныеЗадачи) = Тип("СправочникСсылка.Проекты") Тогда
			СписокЗадачСписанФакт.Добавить(Выборка.ПроектнаяЗадача);
		Иначе
			СписокЗадачСписанФакт.Добавить(Выборка.ПроектнаяЗадача, ПроектПроектныеЗадачи.НайтиПоЗначению(Выборка.ПроектнаяЗадача).Представление);
		КонецЕсли;
	КонецЦикла; 	   
	
	Возврат СписокЗадачСписанФакт;

КонецФункции

// Получает операции, для которых операции, переданные в качестве параметра, являются предшественниками.
//
// Параметры:
//	СписокУдаляемыхЗадач - СписокЗначений.
//
// Возвращаемое значение:
//	СписокЗначений:
//		* Значение - ДокументСсылка.упоПроектнаяЗадача
//		* Представление - Строка - Код СДР + Название проектной задачи.
//
Функция ПолучитьСвязанныеЗадачи(СписокУдаляемыхЗадач) Экспорт
	
	СписокСвязанныхЗадач = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ втТекущаяВерсия
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Текущая
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Версия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.КодСДР,
	               |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втКодыСДР
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
	               |	втКодыСДР.КодСДР КАК КодСДР,
	               |	ВЫБОР
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача ЕСТЬ NULL 
	               |			ТОГДА упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача.НазваниеПроектнойЗадачи
	               |		ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи
	               |	КОНЕЦ КАК НазваниеПроектнойЗадачи
	               |ИЗ
	               |	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(
	               |			,
	               |			ЗадачаПредшественник В (&СписокЗадач)
	               |				И НЕ ПроектнаяЗадача В (&СписокЗадач)
	               |				И Версия В
	               |					(ВЫБРАТЬ
	               |						втТекущаяВерсия.Версия
	               |					ИЗ
	               |						втТекущаяВерсия КАК втТекущаяВерсия)) КАК упоПредусловияПроектныхЗадачСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКодыСДР КАК втКодыСДР
	               |		ПО упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача = втКодыСДР.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия В
	               |					(ВЫБРАТЬ
	               |						втТекущаяВерсия.Версия
	               |					ИЗ
	               |						втТекущаяВерсия КАК втТекущаяВерсия)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО упоПредусловияПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	упоПредусловияПроектныхЗадачСрезПоследних.СвязьСуществует
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КодСДР";
				   
	Запрос.УстановитьПараметр("СписокЗадач", СписокУдаляемыхЗадач);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл    		
		СписокСвязанныхЗадач.Добавить(Выборка.ПроектнаяЗадача, Выборка.КодСДР + " " + Выборка.НазваниеПроектнойЗадачи); 		
	КонецЦикла; 	   
	
	Возврат СписокСвязанныхЗадач;

КонецФункции

// Получает подчиненные задачи.
//
// Параметры:
//	ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача.
//
// Возвращаемое значение:
//	СписокЗначений:
//		* Значение - ДокументСсылка.упоПроектнаяЗадача.
//		* Представление - Строка - Код СДР + Название проектной задачи.
//
Функция ПолучитьПодчиненныеЗадачи(ПроектнаяЗадача) Экспорт

	СписокПодчиненныхЗадач = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ втСсылкаНаЗеркальныйПроект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.СсылкаНаПроектнуюЗадачу = &ПроектнаяЗадача
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
	               |	Проекты.КодСДР КАК КодСДР,
	               |	Проекты.СсылкаНаПроектнуюЗадачу.НазваниеПроектнойЗадачи КАК НазваниеПроектнойЗадачи
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				втСсылкаНаЗеркальныйПроект.Ссылка
	               |			ИЗ
	               |				втСсылкаНаЗеркальныйПроект КАК втСсылкаНаЗеркальныйПроект)
	               |	И НЕ Проекты.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КодСДР";
				   
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл    		
		СписокПодчиненныхЗадач.Добавить(Выборка.ПроектнаяЗадача, Выборка.КодСДР + " " + Выборка.НазваниеПроектнойЗадачи); 		
	КонецЦикла; 	   
	
	Возврат СписокПодчиненныхЗадач;

КонецФункции

// Получает списки удаляемых задач и операций и списки задач и операций, в которых нужно удалить связи.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - удаляемая проектная задача.
// 
// Возвращаемое значение:
//  СтруктураУдаляемыеОбъекты - Структура - состав:
//  * СписокУдаляемыхЗадач - СписокЗначений.
//  * СписокСвязанныхЗадач - СписокЗначений.
//
Функция ПолучитьУдаляемыеОбъекты(ПроектнаяЗадача) Экспорт
	
	СписокУдаляемыхЗадач = ПолучитьПодчиненныеЗадачи(ПроектнаяЗадача);
	СписокСвязанныхЗадач = ПолучитьСвязанныеЗадачи(СписокУдаляемыхЗадач); 
	СписокУдаляемыхЗадачСписанФакт = ПолучитьЗадачиСписанФакт(СписокУдаляемыхЗадач);
	
	СтруктураУдаляемыеОбъекты = Новый Структура;
	СтруктураУдаляемыеОбъекты.Вставить("СписокУдаляемыхЗадач", СписокУдаляемыхЗадач);
	СтруктураУдаляемыеОбъекты.Вставить("СписокСвязанныхЗадач", СписокСвязанныхЗадач);
	СтруктураУдаляемыеОбъекты.Вставить("СписокУдаляемыхЗадачСписанФакт", СписокУдаляемыхЗадачСписанФакт);
	
	Возврат СтруктураУдаляемыеОбъекты;
	
КонецФункции

// Проводит расчет календарного плана проекта.
//
// Параметры:
//  Проект		 - СправочникСсылка.Проекты
//  ТекстОшибки	 - Строка
//  ДатаОтсчета	 - Дата 
//
Процедура ПровестиРасчетКалендарногоПланаПроекта(Проект, ТекстОшибки, ДатаОтсчета = Неопределено) Экспорт
	
	СписокСотрудниковДиспетчера = упоИерархияИПолномочияСервер.СотрудникиДиспетчера(
		ПользователиКлиентСервер.АвторизованныйПользователь(), Истина);
	ОтключитьРазграничениеДоступаКПроектнымДокументам = 
		упоРазграничениеДоступаВызовСервера.РазграничениеДоступаОтключено();
	
	Запрос = Новый Запрос();
	Запрос.Текст = упоСтруктураПроекта.ПолучитьТекстЗапросаЭлементыПроекта();
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ТекВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	Запрос.УстановитьПараметр("РуководительП", Неопределено);
	Запрос.УстановитьПараметр("КонецТекДня", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СписокСотрудниковДиспетчера", СписокСотрудниковДиспетчера);
	Запрос.УстановитьПараметр("ОтключитьРазграничениеДоступаКПроектнымДокументам",
		ОтключитьРазграничениеДоступаКПроектнымДокументам);
	
	ТаблицаДанныхПроекта = Запрос.Выполнить().Выгрузить();
	ТаблицаДанныхПроекта.Колонки.Добавить("ТипЗадачи");
	ТаблицаДанныхПроекта.Колонки.Добавить("РежимВвода");
		
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("ЭлементПроекта");
	ТаблицаЭлементов.Колонки.Добавить("ЭлементРодитель");
	ТаблицаЭлементов.Колонки.Добавить("Длительность");
	ТаблицаЭлементов.Колонки.Добавить("НазваниеПЗ");
	ТаблицаЭлементов.Колонки.Добавить("КодСДР");
	
	ТаблицаИсключений = Новый ТаблицаЗначений();
	ТаблицаИсключений.Колонки.Добавить("ЭлементПроекта");
	ТаблицаИсключений.Колонки.Добавить("ДатаНачала");
	ТаблицаИсключений.Колонки.Добавить("ДатаЗавершения");
	ТаблицаИсключений.Колонки.Добавить("НазваниеПЗ");
	ТаблицаИсключений.Колонки.Добавить("КодСДР");
	
	Для Каждого СтрокаДанных Из ТаблицаДанныхПроекта Цикл   	
		СтрокаДанных.ТипЗадачи = ПолучитьТипЗадачиЧислом(СтрокаДанных);
		СтрокаДанных.РежимВвода = ?(СтрокаДанных.РучнойВводСроков, 0, 1); 
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДатаОтсчета) Тогда
		ДатаОтсчета = упоПроектыИЗадачиСервер.ДатаСтартаПроекта(Проект, Истина);
	КонецЕсли;
	
	ПодготовитьДанныеДляРасчетаСроков(ТаблицаДанныхПроекта, ТаблицаЭлементов, ТаблицаИсключений); 	  

	упоРасчетКалендарныхСроковРедакция3Сервер.СформироватьДокументРасчетКалендарногоПлана(
		Проект, ТаблицаИсключений, ДатаОтсчета, 2, , ТекстОшибки);

КонецПроцедуры   

// Заполняет служебный реквизит ЭтоВеха в табличной части Проектные задачи документа Ручная актуализация проекта
//  в уже существующих документах.
//
// Параметры:
//  Параметры	 - Неопределено	 - не используется.
//
Процедура ЗаполнитьРеквизитЭтоВехаВРучнойАктуализации(Параметры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ втТекущиеВерсии
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Текущая
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Версия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втВехи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия В
	               |				(ВЫБРАТЬ
	               |					втТекущиеВерсии.Версия
	               |				ИЗ
	               |					втТекущиеВерсии КАК втТекущиеВерсии)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоРучнаяАктуализацияПроектаПроектныеЗадачи.Ссылка КАК Ссылка,
	               |	упоРучнаяАктуализацияПроектаПроектныеЗадачи.НомерСтроки
	               |ИЗ
	               |	Документ.упоРучнаяАктуализацияПроекта.ПроектныеЗадачи КАК упоРучнаяАктуализацияПроектаПроектныеЗадачи
	               |ГДЕ
	               |	упоРучнаяАктуализацияПроектаПроектныеЗадачи.ПроектнаяЗадача В
	               |			(ВЫБРАТЬ
	               |				втВехи.ПроектнаяЗадача
	               |			ИЗ
	               |				втВехи КАК втВехи)
	               |ИТОГИ ПО
	               |	Ссылка";
	
	ВыборкаДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		РучнаяАктуализацияОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		
		ВыборкаНомераСтрок = ВыборкаДокументы.Выбрать();
		Пока ВыборкаНомераСтрок.Следующий() Цикл
			РучнаяАктуализацияОбъект.ПроектныеЗадачи[ВыборкаНомераСтрок.НомерСтроки - 1].ЭтоВеха = Истина;
		КонецЦикла;
		
		РучнаяАктуализацияОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры

// Удаляет данные задачи из табличных частей и движений документов "Актуализация проекта",
//  "Расчет календарного плана проекта", "Версия плана проекта", "Сохранение данных проекта".
//
// Параметры:
//  СписокЗадач						 - СписокЗначений	 - список удаляемых задач:
//  	* Значение - ДокументСсылка.упоПроектнаяЗадача.
//  ПродолжитьПриОшибке				 - Булево
//  НеПроверятьРазграничения		 - Булево
//  УдалитьИзНезависимыхРегистров	 - Булево
//
Процедура УдалитьЗадачиИзСлужебныхДокументов(СписокЗадач, ПродолжитьПриОшибке = Ложь, НеПроверятьРазграничения = Ложь, УдалитьИзНезависимыхРегистров = Истина) Экспорт
	
	Если СписокЗадач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если УдалитьИзНезависимыхРегистров Тогда
		Для Каждого ЭлементСпискаЗадач Из СписокЗадач Цикл
			УдалитьЗадачуИзНезависимыхРегистров(ЭлементСпискаЗадач.Значение, Ложь);             
		КонецЦикла;
	КонецЕсли;
	
	// "Сохранение данных проекта" - удаление из табличных частей. 
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоТабличнымЧастямДокументаСохранение();
				   
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);			   
				   
	ВыборкаДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ДокументСохранениеОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		ВыборкаТабличныеЧасти = ВыборкаДокументы.Выбрать();
		
		Пока ВыборкаТабличныеЧасти.Следующий() Цикл  
			
			Для Каждого ПроектнаяЗадача Из СписокЗадач Цикл
				
				Отбор = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача.Значение); 				
				УдаляемыеСтрокиТабличнойЧасти = ДокументСохранениеОбъект[ВыборкаТабличныеЧасти.ИмяТабличнойЧасти].НайтиСтроки(Отбор);
				Для Каждого УдаляемаяСтрока Из УдаляемыеСтрокиТабличнойЧасти Цикл
					ДокументСохранениеОбъект[ВыборкаТабличныеЧасти.ИмяТабличнойЧасти].Удалить(УдаляемаяСтрока);	
				КонецЦикла;	
				
				Если ВыборкаТабличныеЧасти.ИмяТабличнойЧасти = "Связи" Тогда
					ОтборПоПредшественникам = Новый Структура("ЗадачаПредшественник", ПроектнаяЗадача.Значение);
					УдаляемыеСтрокиТабличнойЧасти = ДокументСохранениеОбъект[ВыборкаТабличныеЧасти.ИмяТабличнойЧасти].НайтиСтроки(ОтборПоПредшественникам);
					Для Каждого УдаляемаяСтрока Из УдаляемыеСтрокиТабличнойЧасти Цикл
						ДокументСохранениеОбъект[ВыборкаТабличныеЧасти.ИмяТабличнойЧасти].Удалить(УдаляемаяСтрока);	
					КонецЦикла;	 			
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;
		
		Если НеПроверятьРазграничения Тогда
			ДокументСохранениеОбъект.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);	
		КонецЕсли;
		
		Если ПродолжитьПриОшибке Тогда
			Попытка
				ДокументСохранениеОбъект.Записать(); 	
			Исключение
				ПараметрыОшибки = Новый Структура;
				ПараметрыОшибки.Вставить("Событие", "Запись документа: " + ДокументСохранениеОбъект.Ссылка);
				ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
				ПараметрыОшибки.Вставить("ОбъектМетаданных", Метаданные.Документы.упоСохранениеДанныхПроекта);
				ПараметрыОшибки.Вставить("Данные", ДокументСохранениеОбъект.Ссылка);
				ПараметрыОшибки.Вставить("Комментарий", ОписаниеОшибки());			
				упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(ПараметрыОшибки);
			КонецПопытки;  
		Иначе
			ДокументСохранениеОбъект.Записать(); 		
		КонецЕсли;	
		
	КонецЦикла; 
	
	// Удаление из движений.
	                                    
	// Поиск документов, из которых нужно удалить задачу.
	// Для документа упоВерсияПланаПроекта - отдельный алгоритм.
	
	СписокИменСлужебныхДокументов = Новый СписокЗначений;
	
	СписокИменСлужебныхДокументов.Добавить("упоАктуализацияПроекта", , Истина);		
	СписокИменСлужебныхДокументов.Добавить("упоСохранениеДанныхПроекта", , Истина);
	СписокИменСлужебныхДокументов.Добавить("упоВерсияПланаПроекта", , Ложь);
	СписокИменСлужебныхДокументов.Добавить("упоРасчетКалендарногоПланаПроекта", , Истина);
	
	СтруктураМетаданныхДляПоиска = Новый Структура;

	Запрос = Новый Запрос;
	ТекстЗапроса = ПолучитьТекстЗапросаПоДвижениямСлужебныхДокументов(СписокИменСлужебныхДокументов,
		СтруктураМетаданныхДляПоиска);
		
	// Добавление в запрос текущей версии
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упоВерсииПроекта.Версия
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|ГДЕ
	|	упоВерсииПроекта.Текущая
	|	И упоВерсииПроекта.Проект В
	|			(ВЫБРАТЬ
	|				втПроекты.Проект
	|			ИЗ
	|				втПроекты КАК втПроекты)
	|;
	|
	|//////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеДанные.Регистратор
	|ИЗ
	|	втВсеДанные КАК втВсеДанные
	|СГРУППИРОВАТЬ ПО 
	|	Регистратор";	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СписокЗадач", СписокЗадач);
	
	ТаблицаДокументы = Запрос.Выполнить().Выгрузить(); 
	
	// Обход движений найденных документов и удаление строк.
	
	Для Каждого СтрокаДокумент Из ТаблицаДокументы Цикл
		
		РегистраторОбъект = СтрокаДокумент.Регистратор.ПолучитьОбъект();
		Движения = РегистраторОбъект.Движения;
		
		Для Каждого НаборЗаписей Из Движения Цикл
			
			НаборЗаписей.Прочитать();
			НаборЗаписей.ДополнительныеСвойства.Вставить("упоУдалениеЛишнихДвиженийВерсии", Истина);
			ТаблицаДвижений = НаборЗаписей.Выгрузить();
			ИмяРегистра = НаборЗаписей.Метаданные().Имя;
			
			МассивСтрокДляУдаления = Новый Массив;

			Если СтруктураМетаданныхДляПоиска.Свойство(ИмяРегистра) Тогда
				ПоляПоиска = СтруктураМетаданныхДляПоиска[ИмяРегистра];
				
				НужноПерезаписатьДвижения = Ложь;
				Для Каждого СтрокаДвижение Из ТаблицаДвижений Цикл  				
					Для Каждого ПолеПоиска Из ПоляПоиска Цикл 					
						Если СписокЗадач.НайтиПоЗначению(СтрокаДвижение[ПолеПоиска]) <> Неопределено Тогда
							МассивСтрокДляУдаления.Добавить(СтрокаДвижение);
							НужноПерезаписатьДвижения = Истина;
						КонецЕсли;					
					КонецЦикла;				
				КонецЦикла;
				
				Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
					Если ТаблицаДвижений.Индекс(СтрокаДляУдаления) <> -1 Тогда
						ТаблицаДвижений.Удалить(СтрокаДляУдаления);
					КонецЕсли;	
				КонецЦикла;
				
				Если НужноПерезаписатьДвижения Тогда
					НаборЗаписей.Загрузить(ТаблицаДвижений);
					
					Если НеПроверятьРазграничения Тогда
						НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);	
					КонецЕсли;
					
					Если ПродолжитьПриОшибке Тогда
						Попытка
							НаборЗаписей.Записать();
						Исключение
							ПараметрыОшибки = Новый Структура;
							ПараметрыОшибки.Вставить("Событие", "Запись документа: " + РегистраторОбъект.Ссылка);
							ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
							ПараметрыОшибки.Вставить("ОбъектМетаданных", РегистраторОбъект.Метаданные());
							ПараметрыОшибки.Вставить("Данные", РегистраторОбъект.Ссылка);
							ПараметрыОшибки.Вставить("Комментарий", ОписаниеОшибки());			
							упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(ПараметрыОшибки);
						КонецПопытки;
					Иначе	
						НаборЗаписей.Записать();
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;
		
		// "Расчет календарного плана" - удаление из табличной части "Исключения"
		
		Если ТипЗнч(РегистраторОбъект) = Тип("ДокументОбъект.упоРасчетКалендарногоПланаПроекта") Тогда
			
			Отбор = Новый Структура;         			
			
			НужноПерезаписатьДокумент = Ложь;
			Для Каждого Задача Из СписокЗадач Цикл   
				Отбор.Вставить("Задача", Задача.Значение);				
				СтрокиДляУдаления = РегистраторОбъект.Исключения.НайтиСтроки(Отбор);
				Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
					РегистраторОбъект.Исключения.Удалить(СтрокаДляУдаления);
					НужноПерезаписатьДокумент = Истина;
				КонецЦикла;  				
			КонецЦикла;
			Если НужноПерезаписатьДокумент Тогда
				Если НеПроверятьРазграничения Тогда
					РегистраторОбъект.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);	
				КонецЕсли;		
				Если ПродолжитьПриОшибке Тогда
					Попытка
						РегистраторОбъект.Записать();	
					Исключение
						ПараметрыОшибки = Новый Структура;
						ПараметрыОшибки.Вставить("Событие", "Запись документа: " + РегистраторОбъект.Ссылка);
						ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
						ПараметрыОшибки.Вставить("ОбъектМетаданных", Метаданные.Документы.упоРасчетКалендарногоПланаПроекта);
						ПараметрыОшибки.Вставить("Данные", РегистраторОбъект.Ссылка);
						ПараметрыОшибки.Вставить("Комментарий", ОписаниеОшибки());			
						упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(ПараметрыОшибки);
					КонецПопытки;
				Иначе
					РегистраторОбъект.Записать();
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Удалить задачу из независимых регистров
//
// Параметры:
//  Задача					 - ДокументСсылка.упоПроектнаяЗадача
//  УдалятьДанныеВсехВерсий	 - Булево
//
Процедура УдалитьЗадачуИзНезависимыхРегистров(Задача, УдалятьДанныеВсехВерсий) Экспорт
	
	СтруктураНезависимыхРегистров = Новый Структура;
	СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", "ПроектнаяЗадача");
	СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", "Операция");
	
	Если УдалятьДанныеВсехВерсий Тогда
		СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратСводноВерсии", "ПроектнаяЗадача");
		СтруктураНезависимыхРегистров.Вставить("упоАктуальныеПланыТрудозатратПоДнямВерсии", "Операция");
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СтруктураНезависимыхРегистров Цикл
		НаборЗаписей = РегистрыСведений[КлючЗначение.Ключ].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор[КлючЗначение.Значение].Установить(Задача);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Получает планируемые сроки проекта.
//
// Параметры:
//  Проект					 - СправочникСсылка.Проекты	 - проект.
//  Версия					 - ДокументСсылка.упоВерсияПланаПроекта	 - версия проект.
//  ПолучатьДатуНачала		 - Булево
//  ПолучатьДатуЗавершения	 - Булево
// 
// Возвращаемое значение:
//  Структура - структура сроков.
//
Функция ПолучитьПланируемыеСрокиПроекта(Знач Проект, Знач Версия = Неопределено, ПолучатьДатуНачала = Истина, ПолучатьДатуЗавершения = Истина) Экспорт
	
	ПустаяДата = Дата(1,1,1);
	
	Структура = Новый Структура("ДатаНачалаПлан, ДатаЗавершенияПлан", ПустаяДата, ПустаяДата);
	
	НуженЗапрос = ПолучатьДатуНачала Или ПолучатьДатуЗавершения;
	Если Не НуженЗапрос Тогда
		Возврат Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если Версия = Неопределено Тогда
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Версия", Версия);
	
	ТекстыЗапроса = Новый Массив;
	
	Если ПолучатьДатуНачала Тогда
		
		ТекстДатаНачала = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		                  |	ЕСТЬNULL(Таблица.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаПлан
		                  |ИЗ
		                  |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК Таблица
		                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		                  |		ПО Таблица.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		                  |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		                  |
		                  |УПОРЯДОЧИТЬ ПО
		                  |	ДатаНачалаПлан";
		ТекстыЗапроса.Добавить(ТекстДатаНачала);
		
	КонецЕсли;
	
	Если ПолучатьДатуЗавершения Тогда
		
		ТекстДатаЗавершения = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		                      |	ЕСТЬNULL(Таблица.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершенияПлан
		                      |ИЗ
		                      |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК Таблица
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		                      |		ПО Таблица.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		                      |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Таблица.ДатаЗавершенияПлан УБЫВ";
		ТекстыЗапроса.Добавить(ТекстДатаЗавершения);
		
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если ПолучатьДатуНачала Тогда
		Если РезультатыЗапроса[0].Пустой() Тогда 
			Структура.ДатаНачалаПлан = ПустаяДата;
		Иначе 
			Выборка = РезультатыЗапроса[0].Выбрать();
			Выборка.Следующий();
			Структура.ДатаНачалаПлан = Выборка.ДатаНачалаПлан;
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучатьДатуЗавершения Тогда
		ИндексПоследнего = РезультатыЗапроса.ВГраница();
		Если РезультатыЗапроса[ИндексПоследнего].Пустой() Тогда 
			Структура.ДатаЗавершенияПлан = ПустаяДата;
		Иначе 
			Выборка = РезультатыЗапроса[ИндексПоследнего].Выбрать();
			Выборка.Следующий();
			Структура.ДатаЗавершенияПлан = Выборка.ДатаЗавершенияПлан;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

// Получает планируемые сроки проекта с учетом текущих данных ручного ввода сроков по ПЗ.
//
// Параметры:
//  Проект			 - СправочникСсылка.Проекты.
//  ТекущиеДанные	 - ТаблицаЗначений	 - таблица сроков по ПЗ.
//  ТекущаяВерсия	 - ДокументСсылка.упоВерсияПланаПроекта	 - версия проекта.
// 
// Возвращаемое значение:
//  Структура - сроки проекта.
//
Функция ПолучитьПланируемыеСрокиПроектаСУчетомТекущихДанных(Проект, ТекущиеДанные = Неопределено, ТекущаяВерсия = Неопределено) Экспорт
	
	СрокиПроекта = ПолучитьПланируемыеСрокиПроекта(Проект, ТекущаяВерсия);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат СрокиПроекта;
	КонецЕсли;
	
	ПустаяДата = Дата(1,1,1);
	
	Результат = ИменаПолейСтрокиДанных(ТекущиеДанные);
	ПолучатьПутьКДаннымСтроки = Результат.ПолучатьПутьКДаннымСтроки;
	ДопПутьКДаннымСтроки = Результат.ДопПутьКДаннымСтроки;
	ИмяПоляДатаНачала = Результат.ИмяПоляДатаНачала;
	ИмяПоляДатаЗавершения = Результат.ИмяПоляДатаЗавершения;
	
	Для Каждого СтрокаДанных Из ТекущиеДанные Цикл
		
		Если ПолучатьПутьКДаннымСтроки Тогда
			Если ЗначениеЗаполнено(ДопПутьКДаннымСтроки) Тогда
				СтруктураСрокиЗадачи = СтрокаДанных.Значение[ДопПутьКДаннымСтроки];
			Иначе
				СтруктураСрокиЗадачи = СтрокаДанных.Значение;
			КонецЕсли;
		Иначе
			СтруктураСрокиЗадачи = СтрокаДанных;
		КонецЕсли;
				
		Если СрокиПроекта.ДатаНачалаПлан = ПустаяДата Тогда
			// Новый проект
			СрокиПроекта.ДатаНачалаПлан = СтруктураСрокиЗадачи[ИмяПоляДатаНачала];
		ИначеЕсли Не СтруктураСрокиЗадачи[ИмяПоляДатаНачала] = ПустаяДата Тогда
			СрокиПроекта.ДатаНачалаПлан = Мин(СтруктураСрокиЗадачи[ИмяПоляДатаНачала], СрокиПроекта.ДатаНачалаПлан);
		КонецЕсли;
		
		СрокиПроекта.ДатаЗавершенияПлан = Макс(СтруктураСрокиЗадачи[ИмяПоляДатаЗавершения], СрокиПроекта.ДатаЗавершенияПлан);
	
	КонецЦикла;
	
	Возврат СрокиПроекта;

КонецФункции

// Создает/обновляет связанный элемент справочника "Проекты".
//
// Параметры:
//  Источник - Структура, ДокументОбъект.упоПроектнаяЗадача	 - источник данных сравнения.
//  	При записи в структуре проекта входящим параметром будет структура,
//  	см.упоСохранениеДанныхПроекта.СоздатьОбновитьСвязанныйЭлементСправочникаПроекты.
// 
// Возвращаемое значение:
//  Булево - результат.
//
Функция СоздатьОбновитьСвязанныйЭлементСправочникаПроекты(Источник) Экспорт
	
	Отказ = Ложь;
	СинхронизироватьНаправленияДеятельности = Константы.упоИспользоватьСвязьПроектовСНаправлениямиДеятельности.Получить();
	
	ИсточникДокумент = ТипЗнч(Источник) = Тип("ДокументОбъект.упоПроектнаяЗадача");
	
	// Попытаемся найти связанные элементы справочника для проектной задачи и ее родителя.
	
	ЭлементЗадача = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(Источник.Ссылка);
	Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Источник.ЗадачаРодитель) Тогда
		ЭлементРодитель = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(Источник.ЗадачаРодитель);
	Иначе
		ЭлементРодитель = Неопределено;
	КонецЕсли; 
	
	// В случае, если связаного элемента нет, его нужно создать.
	
	ЭтоНоваяЗадача = Ложь;
	Если ЭлементЗадача = Неопределено Тогда
		ЭлементЗадача = Справочники.Проекты.СоздатьЭлемент();
		ЭлементЗадача.Наименование = Источник.НазваниеПроектнойЗадачи;
		ЭлементЗадача.ЭтоПроектнаяЗадача = Истина;
		ЭлементЗадача.СсылкаНаПроектнуюЗадачу = Источник.Ссылка;
		
		ЭтоНоваяЗадача = Истина;
	Иначе
		ЭлементЗадача = ЭлементЗадача.ПолучитьОбъект();
	КонецЕсли; 
	
	Если Не ЭлементЗадача.ЭтоПроектнаяЗадача Тогда
		ЭлементЗадача.ЭтоПроектнаяЗадача = Истина;
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("ЗаписатьКодСДР") Тогда
		ЭлементЗадача.КодСДР = Источник.ДополнительныеСвойства.ЗаписатьКодСДР;
	КонецЕсли; 
	
	// В случае, если родитель изменился, необходимо отобразить это изменение.
	
	ИзменилсяРодитель = Ложь;
	ИзменилсяПризнакАктируемости = Ложь;
	НовыйРодитель = Неопределено;
	СтарыйРодитель = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЭлементРодитель) Тогда
		НовыйРодитель = Источник.Проект;
		Если Не ЭтоНоваяЗадача Тогда
			СтарыйРодитель = ЭлементЗадача.Родитель;
		КонецЕсли;
		
		// При пустом родителе элемент должен подчиняться непосредственно проекту.
		Если Не ЭлементЗадача.Родитель = Источник.Проект Тогда
			ЭлементЗадача.Родитель = Источник.Проект;
			ИзменилсяРодитель = Истина;
		КонецЕсли;
	Иначе
		НовыйРодитель = ЭлементРодитель;
		Если Не ЭтоНоваяЗадача Тогда
			СтарыйРодитель = ЭлементЗадача.Родитель;
		КонецЕсли;
		
		Если Не ЭлементЗадача.Родитель = ЭлементРодитель Тогда
			ЭлементЗадача.Родитель = ЭлементРодитель;
			ИзменилсяРодитель = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	// Ключ - проверяем у Проектной задачи, Значение - проверяем у Проекта.
	ПроверяемыеРеквизиты = Новый Структура;
	ПроверяемыеРеквизиты.Вставить("ЗадачаОтменена", 			"ЗадачаОтменена");
	ПроверяемыеРеквизиты.Вставить("НазваниеПроектнойЗадачи", 	"Наименование");
	ПроверяемыеРеквизиты.Вставить("Проект", 					"упоКорневойПроект");
	ПроверяемыеРеквизиты.Вставить("ЭтоАктируемаяЗадача", 		"ЭтоАктируемаяЗадача");
	// Реквизит Шифр не версионируется и не пишется в структуре документом  СДП.
	Если ИсточникДокумент Тогда
		ПроверяемыеРеквизиты.Вставить("КодПроектногоДокумента", "упоШифр");
	КонецЕсли;
	
	Для Каждого проверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		Если Не ЭлементЗадача[проверяемыйРеквизит.Значение] = Источник[проверяемыйРеквизит.Ключ] Тогда
			ЭлементЗадача[проверяемыйРеквизит.Значение] = Источник[проверяемыйРеквизит.Ключ];
			Если проверяемыйРеквизит.Значение = "ЭтоАктируемаяЗадача" Тогда
				ИзменилсяПризнакАктируемости = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Источник.Проведен И Не Источник.ПометкаУдаления Тогда
		НоваяПометкаУдаления = Ложь;
	Иначе // Во всех других случаях пометка удаления нужно ставить.
		НоваяПометкаУдаления = Истина;
	КонецЕсли;
	
	Если Не ЭлементЗадача.ПометкаУдаления = НоваяПометкаУдаления Тогда
		ЭлементЗадача.ПометкаУдаления = НоваяПометкаУдаления;
	КонецЕсли;
	
	// Проверяем, есть ли необходимость в записи связанного элемента.
	
	Если ЭлементЗадача.Модифицированность() Тогда
		
		Попытка
			
			ЭлементЗадача.Записать();
			Если СинхронизироватьНаправленияДеятельности Тогда
				упоСвязьПроектаСНаправлениемДеятельности.ВыполнитьСинхронизациюПроектаСНД(ЭлементЗадача,
					, 
					ИзменилсяПризнакАктируемости, 
					ИзменилсяРодитель, 
					Отказ);
			КонецЕсли;
			
		Исключение
			
			текстОшибки = ОписаниеОшибки();
			Источник.ДополнительныеСвойства.Вставить("ОшибкаСинхронизацииСПроектом", текстОшибки);
			
			Сообщение = НСтр("ru = 'Неудачная попытка записи связанного элемента справочника для документа %1
                              |описание ошибки: %2
                              |Операция записи документа была отменена.'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, Источник.Ссылка, текстОшибки);
			ОбщегоНазначения.СообщитьПользователю(Сообщение, , , , Отказ);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если Не (Источник.ДополнительныеСвойства.Свойство("НеИзменятьКодСДР")
		И Источник.ДополнительныеСвойства.НеИзменятьКодСДР) Тогда
		измененныеКодыСДР = упоПроектыИЗадачиВызовСервера.обОбновитьКодСДР(ЭлементЗадача.Ссылка, 
			НовыйРодитель, 
			СтарыйРодитель, 
			, 
			Истина);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

// Удаляет ссылки на удаленные проектные задачи из служебных документов и их движений.
//
// Параметры:
//  Параметры	 - Неопределено	 - не используется.
//
Процедура ОчиститьДанныеУдаленныхЗадач(Параметры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПроектнаяЗадача.Ссылка
	               |ИЗ
	               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	               |ГДЕ
	               |	упоПроектнаяЗадача.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокЗадач = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокЗадач.Добавить(Выборка.Ссылка);
	КонецЦикла;

	упоПроектыИЗадачиСервер.УдалитьЗадачиИзСлужебныхДокументов(СписокЗадач, Истина);
	
КонецПроцедуры

// Заполняет у элемента справочика Проекты реквизит Компонент значением по умолчанию Проект.
//
// Параметры:
//  Параметры	 - Неопределено	 - не используется.
//
Процедура ЗаполнитьРеквизитКомпонентПроекта(Параметры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.Компонент = &ПустоеЗначениеКомпонента
	               |	И НЕ Проекты.ЭтоПроектнаяЗадача";
	
	Запрос.УстановитьПараметр("ПустоеЗначениеКомпонента", Перечисления.упоКомпоненты.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ПроектОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПроектОбъект.Компонент = Перечисления.упоКомпоненты.Проект;
			ПроектОбъект.Записать();
		Исключение
			ПараметрыОшибки = Новый Структура;
			ПараметрыОшибки.Вставить("Событие", "Запись проекта " + Выборка.Ссылка);
			ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);
			ПараметрыОшибки.Вставить("ОбъектМетаданных", Метаданные.Справочники.Проекты);
			ПараметрыОшибки.Вставить("Данные", Выборка.Ссылка);
			ПараметрыОшибки.Вставить("Комментарий", ОписаниеОшибки());			
			упоРаботаСДиалогамиСервер.ЗаписатьВЖурналРегистрации(ПараметрыОшибки);
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

// Получает текст запроса по табличным частям документа "Сохранение данных проекта",
//  содержащих ссылки на проектные задачи.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьТекстЗапросаПоТабличнымЧастямДокументаСохранение() Экспорт

	ТекстЗапроса = "";
	ТабличныеЧастиДокумента = Метаданные.Документы.упоСохранениеДанныхПроекта.ТабличныеЧасти; 
	ПервыйЗапрос = Истина;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧастиДокумента Цикл
		ЕстьРеквизитПроектнаяЗадача = Ложь;
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			Если Реквизит.Имя = "ПроектнаяЗадача" Тогда
				ЕстьРеквизитПроектнаяЗадача = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьРеквизитПроектнаяЗадача Тогда 
			ТекстЗапроса = ТекстЗапроса + ?(ПервыйЗапрос, "", "
					   |	
					   |ОБЪЕДИНИТЬ ВСЕ") + "
		               |
		               |ВЫБРАТЬ " + ?(ПервыйЗапрос, "РАЗРЕШЕННЫЕ", "") + "
		               |	упоСохранениеДанныхПроекта.Ссылка,
		               |	""" + ТабличнаяЧасть.Имя + """ КАК ИмяТабличнойЧасти"
					   + ?(ПервыйЗапрос, "
					   |ПОМЕСТИТЬ втСохранениеДанныхПроекта", "") + "
		               |ИЗ
		               |	Документ.упоСохранениеДанныхПроекта." + ТабличнаяЧасть.Имя + " КАК упоСохранениеДанныхПроекта
		               |ГДЕ
		               |	упоСохранениеДанныхПроекта.ПроектнаяЗадача В (&СписокЗадач)";
			ПервыйЗапрос = Ложь;
		КонецЕсли;	
	КонецЦикла;

	ТекстЗапроса = ТекстЗапроса + "
				   |	
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
	               |ВЫБРАТЬ 
				   |	упоСохранениеДанныхПроекта.Ссылка,
	               |	""Связи"" КАК ИмяТабличнойЧасти
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.Связи КАК упоСохранениеДанныхПроекта
	               |ГДЕ
	               |	упоСохранениеДанныхПроекта.ЗадачаПредшественник В (&СписокЗадач)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втСохранениеДанныхПроекта.Ссылка КАК Ссылка,
	               |	втСохранениеДанныхПроекта.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти
	               |ИЗ
	               |	втСохранениеДанныхПроекта КАК втСохранениеДанныхПроекта
	               |ГДЕ
	               |	втСохранениеДанныхПроекта.Ссылка.Проведен
	               |ИТОГИ ПО
	               |	Ссылка";

	Возврат ТекстЗапроса;

КонецФункции

// Получает массив ссылок на проектные задачи используемые в документе "Сохранение данных проекта".
//
// Параметры:
//  ДокументСсылка		 - ДокументСсылка.упоСохранениеДанныхПроекта - Документ.
//  МассивИгнорируемыхТЧ - Массив Из Строка - Массив строк с именами ТЧ документа упоСохранениеДанныхПроекта,
//  	которые нужно проигнорировать при поиске задач.
// 
// Возвращаемое значение:
//  Массив - Массив задач документа.
//
Функция ПолучитьМассивЗадачСохраненияДанныхПроекта(ДокументСсылка, МассивИгнорируемыхТЧ = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	СтруктураТЧ = Новый Структура;
	
	Для Каждого метТЧ Из Метаданные.Документы.упоСохранениеДанныхПроекта.ТабличныеЧасти Цикл
		Если МассивИгнорируемыхТЧ <> Неопределено И МассивИгнорируемыхТЧ.Найти(метТЧ.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если метТЧ.Реквизиты.Найти("ПроектнаяЗадача") <> Неопределено Тогда
			СтруктураТЧ.Вставить(метТЧ.Имя, "ПроектнаяЗадача");
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураТЧ.Количество()= 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	
	Для Каждого КлючЗначение Из СтруктураТЧ Цикл
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС +  
			"ВЫБРАТЬ Табл."+КлючЗначение.Значение+" КАК ПроектнаяЗадача ИЗ Документ.упоСохранениеДанныхПроекта."+КлючЗначение.Ключ+" КАК Табл ГДЕ Табл.Ссылка = &Ссылка"; 
		Иначе
			ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ Табл."+КлючЗначение.Значение+" ИЗ Документ.упоСохранениеДанныхПроекта."+КлючЗначение.Ключ+" КАК Табл ГДЕ Табл.Ссылка = &Ссылка"; 
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = ТекстЗапроса;	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Получает текст запроса по движения служебных документов, содержащих ссылки на проектные задачи.
//
// Параметры:
//  СписокИменСлужебныхДокументов	 - СписокЗначений
//  СтруктураМетаданныхДляПоиска	 - Структура
// 
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаПоДвижениямСлужебныхДокументов(СписокИменСлужебныхДокументов,
	СтруктураМетаданныхДляПоиска) Экспорт
	
	МассивТиповЗадача = Новый Массив;
	МассивТиповЗадача.Добавить(Тип("ДокументСсылка.упоПроектнаяЗадача"));
	ОписаниеТиповЗадача = Новый ОписаниеТипов(МассивТиповЗадача);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                              |	упоПроектнаяЗадача.Проект КАК Проект
	                              |ПОМЕСТИТЬ втПроекты
	                              |ИЗ
	                              |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	                              |ГДЕ
	                              |	упоПроектнаяЗадача.Ссылка В(&СписокЗадач)
	                              |
	                              |ИНДЕКСИРОВАТЬ ПО
	                              |	Проект
	                              |;
	                              |
	                              |////////////////////////////////////////////////////////////////////////////////";
								  
	ЭтоНачалоЗапроса = Истина;							  
	СтруктураМетаданныхДляПоиска = Новый Структура;
	
	Для каждого ЭлементСпискаДокументов Из СписокИменСлужебныхДокументов Цикл
		
		ИмяДокумента = ЭлементСпискаДокументов.Значение;
		
		Движения = Метаданные.Документы[ИмяДокумента].Движения;
		
		Для Каждого Движение Из Движения Цикл  			
			Для Каждого Измерение Из Движение.Измерения Цикл   				
				Если Измерение.Тип.СодержитТип(Тип("ДокументСсылка.упоПроектнаяЗадача")) Тогда
					ИмяРегистра = Движение.Имя;
					ИмяИзмерения = Измерение.Имя;
					Если НЕ СтруктураМетаданныхДляПоиска.Свойство(ИмяРегистра) Тогда
						СтруктураМетаданныхДляПоиска.Вставить(ИмяРегистра);
					КонецЕсли;
					Если СтруктураМетаданныхДляПоиска[ИмяРегистра] = Неопределено Тогда
						СтруктураМетаданныхДляПоиска[ИмяРегистра] = Новый Массив;
					КонецЕсли;
					Если СтруктураМетаданныхДляПоиска[ИмяРегистра].Найти(ИмяИзмерения) = Неопределено Тогда
						СтруктураМетаданныхДляПоиска[ИмяРегистра].Добавить(ИмяИзмерения); 						
					КонецЕсли;
					Если ЭлементСпискаДокументов.Пометка Тогда
						ДополнитьТекстЗапросаСсылкиНаЗадачу(ТекстЗапроса, ИмяДокумента, ИмяРегистра, ИмяИзмерения, ЭтоНачалоЗапроса);
					КонецЕсли;	
				КонецЕсли; 				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;  		

	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаПоДвижениямУдаленныхЗадач()

// Заполняет количество по количеству ед. норомирования для движений материальных затрат.
//
// Параметры:
//	ТаблицаДвижения - ТаблицаЗначений, НаборЗаписей - Таблица движений.
//
Процедура ЗаполнитьКоличествоПоКоличествуЕдНормированияМатериальныхЗатрат(ТаблицаДвижения) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаДвижения) Тогда
		Возврат;
	КонецЕсли;	
	
	КоэффициентыНормирования = Новый Соответствие;
	
	Запрос = Новый Запрос;
	ЕдиницыНормирования = ТаблицаДвижения.ВыгрузитьКолонку("ЕдиницаНормирования");
	Запрос.УстановитьПараметр("ЕдиницыНормирования", ЕдиницыНормирования);
	
	Запрос.Текст = ТекстЗапросаКоэффициентыЕдиницИзмерения();
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		КоэффициентыНормирования.Вставить(Выборка.Ссылка, Выборка.Коэффициент);
	КонецЦикла;	
	
	Для Каждого СтрокаДвижения Из ТаблицаДвижения Цикл				
		Если ЗначениеЗаполнено(СтрокаДвижения.ЕдиницаНормирования) Тогда
			КоэффНормирования = КоэффициентыНормирования[СтрокаДвижения.ЕдиницаНормирования];
			СтрокаДвижения.Количество = СтрокаДвижения.КоличествоЕдНормирования * КоэффНормирования;	
		Иначе	
			СтрокаДвижения.Количество = СтрокаДвижения.КоличествоЕдНормирования;				
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

// Заполняет реквизит ВыводитьВСводныйСтатусОтчет в зависимости от тип проектной задачи
//
// Параметры:
//  ТипПроектнойЗадачи	 - Перечисления.упоТипПроектнойЗадачи
//  Объект				 - ДокументОбъект
//
Процедура ЗаполнитьРеквизитВыводитьВСводныйСтатусОтчет(ТипПроектнойЗадачи, Объект) Экспорт

	Если ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Этап Тогда
		Объект.ВыводитьВСводныйСтатусОтчет = Истина;
	Иначе
		Объект.ВыводитьВСводныйСтатусОтчет = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак наличия закрытых задач в текущей версии проекта
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проверяемый проект.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЕстьЗакрытыеЭтапыВТекущейВерсииПроекта(Проект) Экспорт
	
	ПроверяемыеСтатусы = Новый Массив;
	ПроверяемыеСтатусы.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
	
	ЗадачиУказанныхСтатусов = ЗадачиУказанныхСтатусов(Проект, ПроверяемыеСтатусы);
	
	Возврат ЗначениеЗаполнено(ЗадачиУказанныхСтатусов);
	
КонецФункции 

// Возвращает задачи, которые находятся в проверяемых статусах.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты	 - проверяемый проект.
//  ТекущаяВерсия	 - ДокументСсылка.упоВерсииПроекта, Неопределено - версия проекта.
//  ПроверяемыеЗадачи - Массив Из ДокументСсылка.упоПроектнаяЗадача, Неопределено - проверяемые проектные задачи.
// 
// Возвращаемое значение:
//  Массив - результат проверки: задачи в проверяемых статусах.
//
Функция ЗадачиУказанныхСтатусов(Проект, ПроверяемыеСтатусы, Знач ТекущаяВерсия = Неопределено, ПроверяемыеЗадачи = Неопределено) Экспорт
	
	ЗадачиВПроверяемыхСтатусах = Новый Массив;
	
	Если ТекущаяВерсия = Неопределено Тогда
		ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекВерсия", ТекущаяВерсия);
	Запрос.УстановитьПараметр("ПроверяемыеСтатусы", ПроверяемыеСтатусы);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	тСтатусы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	тСтатусы.СтатусЗадачи КАК СтатусЗадачи,
	|	тСвойства.НазваниеЗадачи КАК НазваниеЗадачи
	|ИЗ
	|	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК тСтатусы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия = &ТекВерсия
	|					И ПроектнаяЗадача В (&ПроверяемыеЗадачи)) КАК тСвойства
	|		ПО тСтатусы.ПроектнаяЗадача = тСвойства.ПроектнаяЗадача
	|			И (НЕ тСвойства.ЗадачаОтменена)
	|			И (тСтатусы.СтатусЗадачи В (&ПроверяемыеСтатусы))";
	
	Если ЗначениеЗаполнено(ПроверяемыеЗадачи) Тогда
		Запрос.УстановитьПараметр("ПроверяемыеЗадачи", ПроверяемыеЗадачи);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ПроектнаяЗадача В (&ПроверяемыеЗадачи)", "");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат ЗадачиВПроверяемыхСтатусах;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СвойстваЗадачи = Новый Структура("ПроектнаяЗадача, НазваниеЗадачи, СтатусЗадачи");
		ЗаполнитьЗначенияСвойств(СвойстваЗадачи, Выборка);
		ЗадачиВПроверяемыхСтатусах.Добавить(СвойстваЗадачи);
	КонецЦикла;
	
	Возврат ЗадачиВПроверяемыхСтатусах;
	
КонецФункции

// Получает задачи Проекта, за исключением передаваемой ПЗ.
// Параметры:
//	
//  Проект			 - СправочникСсылка.Проекты.
//	ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача.
//
// Возвращаемое значение:
//	СписокЗначений:
//		* Значение - ДокументСсылка.упоПроектнаяЗадача. 
Функция СписокЗадачПроектаИсключаяТекущую(Проект, ПроектнаяЗадача) Экспорт
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	ЗапросПЗ = Новый Запрос;
	ЗапросПЗ.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                 |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача
	                 |ИЗ
	                 |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК Свойства
	                 |ГДЕ
	                 |	Свойства.ПроектнаяЗадача <> &ПроектнаяЗадача
	                 |	И НЕ Свойства.ЗадачаОтменена";
	
	ЗапросПЗ.УстановитьПараметр("ТекВерсия", ТекВерсия);
	ЗапросПЗ.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	
	Выборка = ЗапросПЗ.Выполнить().Выбрать();
	
	СписокЗадач = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокЗадач.Добавить(Выборка.ПроектнаяЗадача);
	КонецЦикла;
		
	Возврат СписокЗадач;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПодчиненныеЗадачи

// Получает текст запроса составления иерархии задач.
//
// Параметры:
//  ТекстНачало						 - Строка	 - начало запроса, в котором установлены все необходимые отборы.
//  	Начало запроса может находиться во временной таблице отчета.
//  ИмяВременнойТаблицыРезультата	 - Строка	 - имя временной таблицы, в которую необходимо поместить результат запроса.
//  ИсключатьСвязиССамимСобой		 - Булево
//  МаксимальнаяГлубина				 - Число
// 
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаПодчиненныеЗадачи(ТекстНачало = "", ИмяВременнойТаблицыРезультата = "", ИсключатьСвязиССамимСобой = Ложь, МаксимальнаяГлубина = 10) Экспорт 
		
	Если ТекстНачало = "" Тогда
		ТекстНачало = ТекстЗапросаПодчиненныеЗадачиНачало();
	КонецЕсли;	
									
	ТекстПовтор = "ВЫБРАТЬ РАЗЛИЧНЫЕ	         
	         |	ВтораяТаблица.Ребенок КАК Ребенок,
			 |	ПерваяТаблица.Родитель КАК Родитель
	         |ПОМЕСТИТЬ Иерархия%2
	         |ИЗ
	         |	Иерархия%1 КАК ПерваяТаблица
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Иерархия%1 КАК ВтораяТаблица
	         |		ПО ПерваяТаблица.Ребенок = ВтораяТаблица.Родитель
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |УНИЧТОЖИТЬ Иерархия%1";

    ТекстКонец = "ВЫБРАТЬ Ребенок КАК Ребенок, Родитель КАК Родитель %1 ИЗ Иерархия%2 %3";
			
	ТекстыЗапроса = Новый Массив;

	ТекстыЗапроса.Добавить(ТекстНачало);
		 	
    Глубина = 1;
    Пока Глубина < МаксимальнаяГлубина Цикл     		
		ТекстыЗапроса.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПовтор, 				
				Формат(Глубина, "ЧГ=0"), Формат(Глубина + 1, "ЧГ=0")));
		    		
		Глубина = Глубина + 1;
    КонецЦикла;
			
	ТекстыЗапроса.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстКонец, 
	    ?(ИмяВременнойТаблицыРезультата = "", "", "ПОМЕСТИТЬ " + ИмяВременнойТаблицыРезультата),
		Формат(Глубина, "ЧГ=0"),
		?(ИсключатьСвязиССамимСобой, "ГДЕ Родитель <> Ребенок", "")
		));
	
	Возврат СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции	

// См. ТекстЗапросаПодчиненныеЗадачи
//
Процедура ВставитьВТекстЗапросаПодчиненныеЗадачи(ТекстЗапроса, ИмяВременнойТаблицы, 
		ИсключатьСвязиССамимСобой = Ложь, МаксимальнаяГлубина = 10) Экспорт 
	
	ПакетЗапроса = ПакетСхемыЗапросаПоИмениВременнойТаблицы(ТекстЗапроса, ИмяВременнойТаблицы);
	Если ПакетЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстЗамены = ПакетЗапроса.ПолучитьТекстЗапроса();
	ПакетЗапроса.ТаблицаДляПомещения = "Иерархия1";
	ТекстНачалоИерархии = ПакетЗапроса.ПолучитьТекстЗапроса();
	
	ТекстВставки = упоПроектыИЗадачиСервер.ТекстЗапросаПодчиненныеЗадачи(ТекстНачалоИерархии, ИмяВременнойТаблицы, 
		ИсключатьСвязиССамимСобой, МаксимальнаяГлубина);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, ТекстВставки);
	
КонецПроцедуры

Функция ИндексВременнойТаблицыПоИмени(ТекстЗапроса, ИмяВременнойТаблицы) Экспорт
	
	Возврат ПакетСхемыЗапросаПоИмениВременнойТаблицы(ТекстЗапроса, ИмяВременнойТаблицы, Истина);
	
КонецФункции

#КонецОбласти

Функция ПоследняяЗаписьВПроектБылаНеИзСтруктуры(ВерсияПроекта) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВерсияПроекта", ВерсияПроекта);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадач.Регистратор КАК Регистратор,
	               |	упоСвойстваПроектныхЗадач.Период КАК Период
	               |ПОМЕСТИТЬ ТЧРегистраторы
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач КАК упоСвойстваПроектныхЗадач
	               |ГДЕ
	               |	упоСвойстваПроектныхЗадач.Версия = &ВерсияПроекта
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоСрокиПроектныхЗадач.Регистратор,
	               |	упоСрокиПроектныхЗадач.Период
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач КАК упоСрокиПроектныхЗадач
	               |ГДЕ
	               |	упоСрокиПроектныхЗадач.Версия = &ВерсияПроекта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ТЧРегистраторы.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ТЧРегистраторПоследний
	               |ИЗ
	               |	ТЧРегистраторы КАК ТЧРегистраторы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТЧРегистраторы.Период УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИСТИНА КАК Поле1
	               |ИЗ
	               |	ТЧРегистраторПоследний КАК ТЧРегистраторПоследний
	               |ГДЕ
	               |	НЕ ТЧРегистраторПоследний.Регистратор ССЫЛКА Документ.упоСохранениеДанныхПроекта";
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

Процедура УстановитьИндексРаспределенияПоСоответствию(СтрокаВладелец, СоответствиеПоследнихИндексовРаспределения) Экспорт
	
	Если СтрокаВладелец.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.Вручную Тогда
		Если СтрокаВладелец.ИндексСтрокРаспределения = Неопределено Тогда
			СтрокаВладелец.ИндексСтрокРаспределения = ПолучитьСледующийИндексРаспределения(СтрокаВладелец.ПроектнаяЗадача, 
				СоответствиеПоследнихИндексовРаспределения);	
		КонецЕсли;		
	Иначе
		Если СтрокаВладелец.ИндексСтрокРаспределения <> Неопределено Тогда
			СтрокаВладелец.ИндексСтрокРаспределения = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция СтатусыЗадачаЗакрытаЗавершена() Экспорт
	
	Статусы = СтатусыЗадачаЗакрыта();
	Статусы.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Завершена);
	
	Возврат Статусы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВсехДетейРодителей(пТаблицаЭлементов, Родитель, ДетиРодителей, ПустойРодитель = Неопределено, УдалятьРодителейИзДетей = Истина)
	Отбор = Новый Структура("ЭлементРодитель", Родитель);
	Элементы = пТаблицаЭлементов.НайтиСтроки(Отбор);
	ДетиРодителя = Новый Массив;
	НужныДетиРодителя = ПустойРодитель <> Родитель;
	Для Каждого Элемент Из Элементы Цикл
		ДетиЭлемента = ПолучитьВсехДетейРодителей(пТаблицаЭлементов, Элемент.ЭлементПроекта, ДетиРодителей, ПустойРодитель, УдалятьРодителейИзДетей);	
		Если Не УдалятьРодителейИзДетей ИЛИ ДетиЭлемента.Количество() = 0 Тогда 
			ДетиЭлемента.Добавить(Элемент.ЭлементПроекта);
		КонецЕсли;
		Если НужныДетиРодителя Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДетиРодителя, ДетиЭлемента);
		КонецЕсли;
		//Если ДетиЭлемента.Количество() Тогда
		//	ДетиРодителей.Вставить(Элемент, ДетиЭлемента);
		//КонецЕсли;
	КонецЦикла;
	Если ДетиРодителя.Количество() Тогда
		ДетиРодителей.Вставить(Родитель, ДетиРодителя);
	КонецЕсли;	
	Возврат ДетиРодителя;
КонецФункции 

Функция ПроверитьВозможностьПереходаВСтатус(Проект, ТекущийСтатусПроекта, ВыбранныйСтатус)
	
	// Из статуса Завершен в статус Выполняется проект можно перевести,
	// только если он до этого уже был в статусе Выполняется.
	Если ТекущийСтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Завершен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	упоСтатусыПроектов.Проект,
		               |	упоСтатусыПроектов.СтатусПроекта
		               |ИЗ
		               |	РегистрСведений.упоСтатусыПроектов КАК упоСтатусыПроектов
		               |ГДЕ
		               |	упоСтатусыПроектов.Проект = &Проект
		               |	И упоСтатусыПроектов.СтатусПроекта = &СтатусПроекта";
		Запрос.УстановитьПараметр("Проект", Проект);				   
		Запрос.УстановитьПараметр("СтатусПроекта", Перечисления.упоСостояниеСтатусаПроекта.Выполняется);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьЗаголовокКнопкиПоСтатусуСУчетомДействия(Статус, Действие, БезДействия = Истина)
	
	Если БезДействия Тогда
		Возврат упоПроектыИЗадачиОбщие.ПолучитьЗаголовокКнопкиПоСтатусу(Статус);
	КонецЕсли;	
	
	Если Действие = Неопределено Тогда
		Возврат упоПроектыИЗадачиОбщие.ПолучитьЗаголовокКнопкиПоСтатусу(Статус);
	КонецЕсли;
	
	НаименованиеДокумента	= Метаданные.Документы[Действие].Синоним;
	НаименованиеСтатуса		= упоПроектыИЗадачиОбщие.ПолучитьЗаголовокКнопкиПоСтатусу(Статус);
	
	Возврат "Ввести документ: """ + НаименованиеДокумента + """ (" + НаименованиеСтатуса + ")";
	
КонецФункции

Функция ПолучитьТаблицуКСохранению(СписокОбъектов, Проект, Пользователь, ЭтоСправочники = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Проекты.Ссылка КАК ПроектнаяЗадача
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.СсылкаНаПроектнуюЗадачу В(&СписокОбъектов)";
	
	Если ЭтоСправочники Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Проекты.СсылкаНаПроектнуюЗадачу В(&СписокОбъектов)", "Проекты.Ссылка В(&СписокОбъектов)"); 	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокОбъектов", СписокОбъектов);
	Результат = Запрос.Выполнить();
	
	ТаблицаДляВозврата = Результат.Выгрузить();  
	
	Если ТаблицаДляВозврата.Найти(Проект, "ПроектнаяЗадача") = Неопределено Тогда
		ТаблицаДляВозврата.Добавить().ПроектнаяЗадача = Проект;	
	КонецЕсли;
	
	ТаблицаДляВозврата.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаДляВозврата.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	
	ТаблицаДляВозврата.ЗаполнитьЗначения(Проект, "Проект");
	ТаблицаДляВозврата.ЗаполнитьЗначения(Пользователь, "Пользователь");
	
	Возврат ТаблицаДляВозврата;
	
КонецФункции

Процедура ДобавитьОшибку(Таблица, Объект = Неопределено, ОбъектПредставление = Неопределено, 
	ТекстОшибки = "Нет текста.")
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ЭлементПроекта = Объект;
	НоваяСтрока.ЭлементПроектаПредставление = Объект;
	НоваяСтрока.ТекстОшибки = ТекстОшибки;
	
КонецПроцедуры

// Процедура (рекурсивная) обрабатывает Соответствие, в котором каждому элементу соотнесены
// подчинненные элементы. Процедура устраняет из подчиненных элементов элементы Родители.
//
// Параметры:
//  Родители  	– Соответствие, содержит родителей и их подчиненных элементов:
//					Ключ		- Любая ссылка, элемент проекта, у которого если подчиненные элементы.
//					Значение	- Соответствие, подчиненные по иерархии элементы.
//  Родитель  	– Любая ссылка, элемент проекта, который обрабатывается на данной итерации.
//  Дети  		– Соответствие, содержит подчиненные элементы для элемента "родитель".
//  ДетиУбраны  – Соответствие, хранит элементы проекта, которые уже были обработаны.
//
Процедура убратьРодителейИзДетей(Родители, Родитель, Дети, ДетиУбраны)
	
	Для каждого кизРебенок Из Дети Цикл
		ребенок = кизРебенок.Ключ;
		Если Не Родители[ребенок] = Неопределено Тогда
			Если ДетиУбраны[ребенок] = Неопределено Тогда
				убратьРодителейИзДетей(Родители, ребенок, Родители[ребенок], ДетиУбраны);
			КонецЕсли;
			Дети.Удалить(ребенок);
			Для каждого новыйРебенок Из Родители[ребенок] Цикл
			    Дети.Вставить(новыйРебенок.Ключ, Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Родители.Вставить(Родитель, Дети);
	ДетиУбраны.Вставить(Родитель, Истина);
	
КонецПроцедуры

Процедура НайтиЦиклыРекурсивно(ТаблицаСвязей, СоответствиеПроверенныеЗадачи, МассивПроверяемыеЗадачи, Элемент, ИсточникСвязи, СтруктураДанныхЦикла)
	
	// Если нашли хоть один цикл, то дальнейшую проверку прекращаем.
	Если СтруктураДанныхЦикла.ЦиклЗаписан Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеПроверенныеЗадачи.Вставить(Элемент, Истина);
	МассивПроверяемыеЗадачи.Добавить(Элемент);
	
	Отбор = Новый Структура("СвязанныйЭлемент", Элемент);
	НайденныеСтроки = ТаблицаСвязей.НайтиСтроки(Отбор);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Если СтруктураДанныхЦикла.НайденЦикл Тогда     
			Прервать;
		КонецЕсли;
		
		ПодчиненныйЭлемент = НайденнаяСтрока.ЭлементПроекта;
		Если НЕ ЗначениеЗаполнено(ПодчиненныйЭлемент) Тогда
			Продолжить;
		КонецЕсли;
				
		Если МассивПроверяемыеЗадачи.Найти(ПодчиненныйЭлемент) <> Неопределено Тогда  // Найден цикл.
			СтруктураДанныхЦикла.НайденЦикл = Истина;
			СтруктураДанныхЦикла.Элемент = ПодчиненныйЭлемент;  
			СтруктураДанныхЦикла.МассивЭлементовЦикла.Добавить(ПодчиненныйЭлемент);
			// Если это связь элемента-родителя, то добавим в элементы цикла и его.
			Если НайденнаяСтрока.ИсточникСвязи <> Неопределено Тогда
				СтруктураДанныхЦикла.МассивЭлементовЦикла.Добавить(НайденнаяСтрока.ИсточникСвязи);	
			КонецЕсли;
			Углубляемся = Ложь;
		Иначе
			ЭлементУжеПроверялся = СоответствиеПроверенныеЗадачи.Получить(ПодчиненныйЭлемент) <> Неопределено; 
			Углубляемся = НЕ ЭлементУжеПроверялся;
		КонецЕсли;
		
		Если Углубляемся Тогда 
			НайтиЦиклыРекурсивно(ТаблицаСвязей, СоответствиеПроверенныеЗадачи, МассивПроверяемыеЗадачи, ПодчиненныйЭлемент,
			НайденнаяСтрока.ИсточникСвязи, СтруктураДанныхЦикла);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтруктураДанныхЦикла.НайденЦикл И НЕ СтруктураДанныхЦикла.ЦиклЗаписан Тогда
		Если Элемент = СтруктураДанныхЦикла.Элемент Тогда
			СтруктураДанныхЦикла.ЦиклЗаписан = Истина;
		Иначе
			СтруктураДанныхЦикла.МассивЭлементовЦикла.Добавить(Элемент);
			// Если это связь элемента-родителя, то добавим в элементы цикла и его.
			Если ИсточникСвязи <> Неопределено Тогда
				СтруктураДанныхЦикла.МассивЭлементовЦикла.Добавить(ИсточникСвязи);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		
	
	МассивПроверяемыеЗадачи.Удалить(МассивПроверяемыеЗадачи.Количество() - 1);
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаСсылкиНаЗадачу(ТекстЗапроса, ИмяДокумента, ИмяРегистра, ИмяИзмерения, ЭтоНачалоЗапроса)

	Если НЕ ЭтоНачалоЗапроса Тогда 		
		ТекстЗапроса = ТекстЗапроса + "
		|
		| ОБЪЕДИНИТЬ ВСЕ
		|";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " 	
	 |ВЫБРАТЬ" + ?(ЭтоНачалоЗапроса, " РАЗРЕШЕННЫЕ", "") + "
	 |	" + ИмяРегистра + ".Регистратор
	 |" + ?(ЭтоНачалоЗапроса, "ПОМЕСТИТЬ втВсеДанные", "") + "
	 |ИЗ
	 |	РегистрСведений." + ИмяРегистра + " КАК " + ИмяРегистра + "
	 |ГДЕ
	 |	" + ИмяРегистра + "." + ИмяИзмерения + " В (&СписокЗадач)
	 |   И Регистратор ССЫЛКА Документ." + ИмяДокумента + "";     	

	Если ЭтоНачалоЗапроса Тогда
		ЭтоНачалоЗапроса = Ложь;
	КонецЕсли;	
	 
КонецПроцедуры

#Область ПодчиненныеЗадачи

Функция ТекстЗапросаПодчиненныеЗадачиНачало(Проект = Неопределено)
			
	ТекстНачало = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	         |	Проекты.Ссылка КАК Ребенок,
	         |	Проекты.Родитель КАК Родитель
	         |ПОМЕСТИТЬ Иерархия1
	         |ИЗ
	         |	Справочник.Проекты КАК Проекты
	         |ГДЕ
	         |	Проекты.упоКорневойПроект = &Проект
	         |	И НЕ Проекты.ПометкаУдаления
	         |	И Проекты.Родитель <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	         |
	         |ОБЪЕДИНИТЬ
	         |
	         |ВЫБРАТЬ
	         |	Проекты.Ссылка,
	         |	Проекты.Ссылка
	         |ИЗ
	         |	Справочник.Проекты КАК Проекты
	         |ГДЕ
	         |	Проекты.упоКорневойПроект = &Проект
	         |	И НЕ Проекты.ПометкаУдаления";
	
	Если Проект = Неопределено Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстНачало);
		
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Удалить(0);
		СхемаЗапроса.ПакетЗапросов[0].Операторы[1].Отбор.Удалить(0);
		
		ТекстНачало = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Возврат ТекстНачало;
	
КонецФункции	

Функция ПакетСхемыЗапросаПоИмениВременнойТаблицы(ТекстЗапроса, ИмяВременнойТаблицы, ПолучитьТолькоИндекс = Ложь) 
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	Сч = 0;
	Для Каждого ПакетЗапроса Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТипЗнч(ПакетЗапроса) = Тип("ЗапросВыбораСхемыЗапроса") 
			И ПакетЗапроса.ТаблицаДляПомещения = ИмяВременнойТаблицы Тогда
			Если ПолучитьТолькоИндекс Тогда
				Возврат Сч;			
			Иначе
				Возврат ПакетЗапроса;
			КонецЕсли;	
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции	

#КонецОбласти

Функция ПолучитьСледующийИндексРаспределения(ПроектнаяЗадача, СоответствиеПоследнихИндексовРаспределения) 
	
	ТекущийИндекс = СоответствиеПоследнихИндексовРаспределения.Получить(ПроектнаяЗадача);
	
	Если ТекущийИндекс = Неопределено Тогда
		ТекущийИндекс = 1000;
	КонецЕсли;
	
	НовыйИндекс = ТекущийИндекс + 1;
	
	СоответствиеПоследнихИндексовРаспределения.Вставить(ПроектнаяЗадача, НовыйИндекс);
	
	Возврат НовыйИндекс;
	
КонецФункции

Функция ПолучитьТекстСоединенияДляФильтраПоОтмененнымЗадачам()
	
	Соединение = 
	"		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия В
	|					(ВЫБРАТЬ
	|						упоВерсииПроекта.Версия
	|					ИЗ
	|						РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|					ГДЕ
	|						упоВерсииПроекта.Проект = &Проект
	|						И упоВерсииПроекта.Текущая)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ПО (Док.Ссылка = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача)
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
		
	Возврат Соединение;
	
КонецФункции

Функция ТекстЗапросаКоэффициентыЕдиницИзмерения()
	
	ЕстьРеквизитыЧислительЗнаменатель = 
		упоИнтеграцияКлиентСервер.ЕстьРеквизитыЧислительЗнаменательВСправочникеУпаковки();				
	
	Текст = "ВЫБРАТЬ
	        |	упоЕдиницыВремени.Ссылка КАК Ссылка,
	        |	упоЕдиницыВремени.Коэффициент КАК Коэффициент
	        |ИЗ
	        |	Справочник.упоЕдиницыВремени КАК упоЕдиницыВремени
	        |ГДЕ
	        |	упоЕдиницыВремени.Ссылка В(&ЕдиницыНормирования)
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	УпаковкиЕдиницыИзмерения.Ссылка,
	        |	&РасчетКоэффициентаУпаковки
	        |ИЗ
	        |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	        |ГДЕ
	        |	УпаковкиЕдиницыИзмерения.Ссылка В(&ЕдиницыНормирования)";
		
	Если ЕстьРеквизитыЧислительЗнаменатель Тогда
		Текст = СтрЗаменить(Текст, "&РасчетКоэффициентаУпаковки", 
				   "ВЫБОР
	               |	КОГДА УпаковкиЕдиницыИзмерения.Знаменатель = 0
	               |		ТОГДА 1
	               |	ИНАЧЕ УпаковкиЕдиницыИзмерения.Числитель / УпаковкиЕдиницыИзмерения.Знаменатель
	               |КОНЕЦ");			
	Иначе
		Текст = СтрЗаменить(Текст, "&РасчетКоэффициентаУпаковки", "1");
	КонецЕсли;	

	Возврат Текст;
	
КонецФункции

Процедура ЗаполнитьДокументСохраненияДанных(ДокСохраненияДанных, Проект, ПроектныеЗадачи)
	
	ДокСохраненияДанных.Проект = Проект;
	ДокСохраненияДанных.Дата = ТекущаяДатаСеанса();	
	текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);	
	ДанныеПоТекСвойствам = 
		ДокСохраненияДанных.СформироватьДанныеПоТекущимСвойстваПроектныхЗадач(текущаяВерсия, ПроектныеЗадачи);
		
	ТаблицаТекущиеСвойства = ДанныеПоТекСвойствам.ТаблицаТекущиеСвойства;	
		
	ТЧПроектныеЗадачи = ДокСохраненияДанных.ПроектныеЗадачи;
	Для Каждого ТекущиеСвойства Из ТаблицаТекущиеСвойства Цикл
		СтрокаТЧ = ТЧПроектныеЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекущиеСвойства);
		СтрокаТЧ.ЗадачаОтменена = Истина;
	КонецЦикла;	
	
КонецПроцедуры

// Удаляет (помечает на удаление) заданный массив документов из БД.
// 
// Параметры:
//  МассивДокументов - Массив - список ссылок на документы.
// 
Процедура УдалитьДокументы(МассивДокументов)
		
	Для Каждого Документ Из МассивДокументов Цикл
		
		Объект = Документ.ПолучитьОбъект();
		Объект.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
		Объект.УстановитьПометкуУдаления(Истина);
		
	КонецЦикла;
		
КонецПроцедуры

// В зависимости от входящей структуры данных (Таблица значений или Соответствие) 
// значения могут находиться в полях строк с разным наименованием. 
// Метод унифицирует имена полей входящих данных для дальнейшей обработки.
//
Функция ИменаПолейСтрокиДанных(ТекущиеДанные)
	
	Результат = Новый Структура();
	Результат.Вставить("ДопПутьКДаннымСтроки", ""); // Имя дополнительного ключа при получении данных из структуры. 
	Результат.Вставить("ПолучатьПутьКДаннымСтроки", Ложь); // Признак получения данных из структуры.
	Результат.Вставить("ИмяПоляДатаНачала", "ДатаНачала");
	Результат.Вставить("ИмяПоляДатаЗавершения", "ДатаЗавершения");

	Если ТипЗнч(ТекущиеДанные) = Тип("Соответствие") Тогда
		
		Результат.ПолучатьПутьКДаннымСтроки = Истина;
		
		Для Каждого Строка Из ТекущиеДанные Цикл
			
			// Сроки могут лежать в промежуточной структуре с именем "Результат" 
			// или напрямую в соответствии в зависимости от вызывающего метода.
			Если Строка.Значение.Свойство("Результат") Тогда
				ДопПутьКДаннымСтроки = "Результат";
				ДанныеСроков = Строка.Значение.Результат;
			Иначе
				ДанныеСроков = Строка.Значение;
			КонецЕсли;
			
			Результат.ДопПутьКДаннымСтроки = ДопПутьКДаннымСтроки;
			
			Если ДанныеСроков.Свойство("ДатаНачалаПлан") Тогда
				Результат.ИмяПоляДатаНачала = "ДатаНачалаПлан";
			КонецЕсли;
			Если ДанныеСроков.Свойство("ДатаЗавершенияПлан") Тогда
				Результат.ИмяПоляДатаЗавершения = "ДатаЗавершенияПлан";
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураСроковПроектнойЗадачи()
	
	СрокиЗадачи = Новый Структура;
	СрокиЗадачи.Вставить("КрайнийСрок");
	СрокиЗадачи.Вставить("ДатаНачалаПлан");
	СрокиЗадачи.Вставить("ДатаЗавершенияПлан");
	СрокиЗадачи.Вставить("ДатаРаннегоСтарта");
	СрокиЗадачи.Вставить("ДатаРаннегоФиниша");
	СрокиЗадачи.Вставить("ДатаПозднегоСтарта");
	СрокиЗадачи.Вставить("ДатаПозднегоФиниша");
	
	Возврат СрокиЗадачи;
	
КонецФункции

Функция СтатусыЗадачаЗакрыта()
	
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
	
	Возврат Статусы;
	
КонецФункции

Функция ЭтоЗаписьНепроведенного(ДокументОбъект, РежимЗаписи)
	
	Возврат РежимЗаписи = РежимЗаписиДокумента.Запись
		И Не ДокументОбъект.Проведен;
	
КонецФункции

#КонецОбласти
