#Область ПрограммныйИнтерфейс

// Выполняет изменение элементов форм для конфигурации, интегрированной с УХ. Обработчик события ПриСоздании.
//
// Параметры:
//  Форма				 - УправляемаяФорма
//  Отказ				 - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт 
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоERPУХ() Тогда
		Возврат;
	КонецЕсли;
	
	СостИмени = упоФункцииОбщегоНазначенияКлиентСервер.СоставИмениФормы(Форма.ИмяФормы);
	ИмяТипаМетаданных = СостИмени.ТипМетаданных;
	
	Если ИмяТипаМетаданных = "Документ" Тогда
		
		ПриСозданииНаСервере_Документы(СостИмени.ВидМетаданных, СостИмени.ИмяФормы, Форма, Отказ, СтандартнаяОбработка);
		
	КонецЕсли;

КонецПроцедуры

// См. ПодключаемыеКоманды.ПриСозданииНаСервере
//
Процедура ПодключаемыеКомандыПриСозданииНаСервере(Форма, ПараметрыРазмещения) Экспорт
	
		
КонецПроцедуры	

// Удаляет из заданных массивов имен реквизитов Имя "РасшифровкаПлатежа.Проект".
//
// Параметры:
//  МассивВсехРеквизитов	 - Массив	 - Массив всех имен реквизитов, зависимых от хозяйственной операции
//  МассивРеквизитовОперации - Массив	 - Массив имен реквизитов, используемых в выбранной хозяйственной операции.
//
Процедура УдалитьИзМассивовИменРеквизитовРеквизитПроект(МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоERPУХ() Тогда
		Возврат;
	КонецЕсли;	
	
	УдаляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты.Добавить("РасшифровкаПлатежа.Проект");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(МассивВсехРеквизитов, УдаляемыеРеквизиты);
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитовОперации, УдаляемыеРеквизиты);
		
КонецПроцедуры

#Область ОбработчикиПодписок

// Заполняет реквизит "Проект" в расшифровке документа конфигурации УХ. Обработчик подписки упоИнтеграцияУХДокументыРасчетаПередЗаписью.
//
// Параметры:
//  Источник		 - ДокументОбъект
//  Отказ			 - Булево
//  РежимЗаписи		 - РежимЗаписиДокумента
//  РежимПроведения	 - РежимПроведенияДокумента
//
Процедура упоИнтеграцияУХДокументыРасчетаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоERPУХ() Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаПлатежа = Источник.РасшифровкаПлатежа;
	
	ПроектныеЗадачи = РасшифровкаПлатежа.ВыгрузитьКолонку("упоПроектнаяЗадача");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК ПроектнаяЗадача,
		|	Проекты.упоКорневойПроект КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка В(&ПроектныеЗадачи)";
	
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	
	ПроектыПроектныхЗадач = Запрос.Выполнить().Выгрузить();
	
	ПроектыПроектныхЗадач.Индексы.Добавить("ПроектнаяЗадача");
	
	ЭтоЗаявкаНаРасходованиеДС = ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств");
	
	Для Каждого СтрокаТЧ Из РасшифровкаПлатежа Цикл
		НайденнаяСтрока = ПроектыПроектныхЗадач.Найти(СтрокаТЧ.упоПроектнаяЗадача, "ПроектнаяЗадача");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтоЗаявкаНаРасходованиеДС Тогда
			Источник.Проект = НайденнаяСтрока.Проект;
			Прервать;
		КонецЕсли;
		СтрокаТЧ.Проект = НайденнаяСтрока.Проект;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Изменяет видимость элементов связанных с реквизитом Проект в формах расчетных документов.
// Для документов см. источник подписки на событие упоИнтеграцияУХДокументыРасчетаПередЗаписью
//
// Параметы:
//   Форма - УправляемаяФорма
//
Процедура ИзменитьВидимостьЭлементовПроектаУХи(Форма) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоERPУХ() Тогда
		Возврат;
	КонецЕсли;	
		
	ИменаЭлементов = Новый Массив;		
	Если Форма.ИмяФормы = "Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента" Тогда
		ИменаЭлементов.Добавить("ПроектБезРазбиения");
		ИменаЭлементов.Добавить("Проект");
	Иначе
		ИменаЭлементов.Добавить("РасшифровкаПлатежаПроект");
		ИменаЭлементов.Добавить("РасшифровкаБезРазбиенияПроект");
	КонецЕсли;
	
	упоФункцииОбщегоНазначенияСервер.НайтиЭлементыПоИменамИУстановитьДляНихУказанноеСвойство(ИменаЭлементов, Форма,
		"Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервере_Документы(ИмяДокумента, ИмяФормы, Форма, Отказ, СтандартнаяОбработка)
	
	ДокументыДляМодификации = ДокументыДляМодификации();
	
	Если ИмяФормы = "ФормаДокумента" И ДокументыДляМодификации.Получить(ИмяДокумента) <> Неопределено Тогда
		
		ДобавитьВДокументыЭлементы_ДоговорКонтрагентов(Форма, Отказ, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВДокументыЭлементы_ДоговорКонтрагентов(Форма, Отказ, СтандартнаяОбработка)
	
	Если Форма.Элементы.Найти("упоСтатусДоговора") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Добавим элемент формы для нашего реквизита.
	ГруппаФормы = Форма.Элементы.Найти("ГруппаОсновноеПравая");
	
	Если ГруппаФормы = Неопределено Тогда
		ГруппаФормы = Форма;
	КонецЕсли; 
	
	ЭлементСтатусДоговора = Форма.Элементы.Добавить("упоСтатусДоговора", Тип("ПолеФормы"), ГруппаФормы);
	ЭлементСтатусДоговора.ПутьКДанным = "ДоговорОбъект.упоСтатусДоговора";
	ЭлементСтатусДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтатусДоговора.Ширина = 20;
	ЭлементСтатусДоговора.РастягиватьПоГоризонтали = Ложь;
	ЭлементСтатусДоговора.РедактированиеТекста = Ложь;
	ЭлементСтатусДоговора.УстановитьДействие("ПриИзменении", "Подключаемый_упоСтатусДоговораПриИзменении");
	
	МассивСтатусов = упоИнтеграцияEPMСервер.ПолучитьМассивСтатусовДоговоров();
	ЭлементСтатусДоговора.СписокВыбора.ЗагрузитьЗначения(МассивСтатусов);
	ЭлементСтатусДоговора.РежимВыбораИзСписка = Истина;
	
	упоСхемаОплаты = Форма.Элементы.Добавить("упоСхемаОплаты", Тип("ПолеФормы"), ГруппаФормы);
	упоСхемаОплаты.ПутьКДанным = "ДоговорОбъект.упоСхемаОплаты";
	упоСхемаОплаты.Вид = ВидПоляФормы.ПолеВвода;
	упоСхемаОплаты.КнопкаВыбора = Истина;
	
КонецПроцедуры

Функция ДокументыДляМодификации()
	
	ИменаФорм = Новый Соответствие;
	ИменаФорм.Вставить("ВерсияСоглашенияАккредитив", Истина);
	ИменаФорм.Вставить("ВерсияСоглашенияБанковскаяГарантия", Истина);
	ИменаФорм.Вставить("ВерсияСоглашенияВалютноПроцентныйСвоп", Истина);
	ИменаФорм.Вставить("ВерсияСоглашенияВалютныйСвоп", Истина);
	ИменаФорм.Вставить("ВерсияСоглашенияВалютныйФорвард", Истина);
	ИменаФорм.Вставить("ВерсияСоглашенияКоммерческийДоговор", Истина);
	
	Возврат ИменаФорм;
	
КонецФункции

#КонецОбласти