
&После("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)
	
	//{[+] ИКТ №8622 (фрагмент ДОБАВЛЕН), Бабуров Никита, 27.06.2025 12:53:41 
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//[+]} ИКТ №8622
	Если ОбщегоНазначения.ЕстьРоль("ИКТ_ДобавлениеИзменениеПользователейБезПолныхПрав") И (НЕ ОбщегоНазначения.ЭтоПолноправныйПользователь()) Тогда
		Если ЕстьЗапрещеннаяРоль(ЭтотОбъект.Профиль.Роли) Тогда
			//ОбщегоНазначения.СообщитьПользователю("Ошибка доступа. В группе присуцтвует запрещенная роль!");
			ВызватьИсключение(НСтр("ru = 'Недостаточно прав для редактирования группы доступа.
				|В выбранной группе доступа присутствует запрещенная роль.';
				|en = 'Insufficient rights to edit the access group.
				|There is a prohibited role in the selected access group.'"),
				КатегорияОшибки.НарушениеПравДоступа);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьЗапрещеннаяРоль(СписокРолейПрофиля)
	Результат = Ложь;
	
	СписокЗапрещенныхРолей = Новый Массив;
	СписокЗапрещенныхРолей.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("Имя", "АдминистраторСистемы"));
	СписокЗапрещенныхРолей.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("Имя", "ПолныеПрава"));
	
	Для каждого Роль Из СписокЗапрещенныхРолей Цикл
		НайденнаяСтрока = СписокРолейПрофиля.Найти(Роль, "Роль");
		Если НайденнаяСтрока <> Неопределено Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции