////////////////////////////////////////////////////////////////////////////////
// Содержит обработчики базовых событий формы и универсальные
// обработчики действий.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик события, вызываемый при создании объекта на сервере.
//
// Параметры:
//  ЭтаФорма							 - УправляемаяФорма	 - форма, для который вызывается обработчик.
//  ОбъектФормы							 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект	 - записываемый объект.
//  Отказ								 - Булево	 - признак отказа от выполнения действия.
//  СтандартнаяОбработка				 - Булево	 - признак стандартной обработки.
//  ВыводитьСообщенияОРазграниченииПрав	 - Булево	 - признак необходимости выводить сообщения о разграничении прав,
//  	проверяемых в функции "упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения", пользователю.
//  	По умолчанию сообщения регистрируются только в журнале регистрации.
//  ПроверятьРазграничениеДоступа		 - Булево	 - признак необходимости проверки прав разграничения.
//
Процедура ФормаПриСозданииНаСервере(ЭтаФорма, ОбъектФормы = Неопределено, Отказ, СтандартнаяОбработка,
		ВыводитьСообщенияОРазграниченииПрав = Ложь, ПроверятьРазграничениеДоступа = Истина) Экспорт
	
	СостИмени = упоФункцииОбщегоНазначенияКлиентСервер.СоставИмениФормы(ЭтаФорма.ИмяФормы);
	
	Если ЭтоИзменениеСтиляДляФормыДокументооборота(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ДобавитьКомандыИнтеграцииССППР(ЭтаФорма);
	КонецЕсли;
	
	Если ПроверятьРазграничениеДоступа И ТипЗнч(ОбъектФормы) = Тип("ДанныеФормыСтруктура") И ОбъектФормы.Свойство("Ссылка") И Не ЭтаФорма.ТолькоПросмотр Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектФормы.Ссылка)) Тогда
			Если НЕ упоУправлениеФормамиСервер.ЭтоНовый(ЭтаФорма) Тогда
				ЭтаФорма.ТолькоПросмотр = упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ОбъектФормы, , , , ВыводитьСообщенияОРазграниченииПрав);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	упоИнтеграцияEPMСервер.ДобавитьЭлементыФормыКонтрагентов(ЭтаФорма, Отказ);
	
	ЭтоСправочникПроекты = СостИмени.ТипМетаданных = "Справочник" И СостИмени.ВидМетаданных = "Проекты";
	
	ЭтоФормаВыбора = Ложь; 
	Если ЭтаФорма.Параметры.Свойство("РежимВыбора") И ЗначениеЗаполнено(ЭтаФорма.Параметры.РежимВыбора) Тогда
		ЭтоФормаВыбора = ЭтаФорма.Параметры.РежимВыбора;	
	КонецЕсли;

	Если ТипЗнч(ОбъектФормы) = Тип("ДинамическийСписок") И Не ЭтоСправочникПроекты И Не ЭтоФормаВыбора Тогда
		
		Если НЕ СтрЧислоВхождений(ЭтаФорма.ИмяФормы, "Справочник.упоШаблоныПроектныхЗадач") Тогда
			
			ПолеПроект = Новый ПолеКомпоновкиДанных("Проект");
			Если ОбъектФормы.Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеПроект) <> Неопределено Тогда
				
				ИндексОтбора = Неопределено;
				ОтборПоПроекту = Неопределено;
				ПолеКомпоновкиПроект = Новый ПолеКомпоновкиДанных("Проект");
				Для Каждого ЭлементОтбора Из ОбъектФормы.Отбор.Элементы Цикл
					Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиПроект Тогда
						ОтборПоПроекту = ЭлементОтбора;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Использование = Истина;
				Если ЭтаФорма.Параметры.Свойство("Проект") Тогда
					Проект = ЭтаФорма.Параметры.Проект;
				ИначеЕсли ЭтаФорма.Параметры.Свойство("Отбор") И ЭтаФорма.Параметры.Отбор.Свойство("Проект") Тогда
					Проект = ЭтаФорма.Параметры.Отбор.Проект;
				ИначеЕсли ЭтаФорма.Параметры.Свойство("Отбор") И ЭтаФорма.Параметры.Отбор.Свойство("Владелец")
					И ТипЗнч(ЭтаФорма.Параметры.Отбор.Владелец) = Тип("СправочникСсылка.Проекты") Тогда
					Проект = ЭтаФорма.Параметры.Отбор.Владелец;
				Иначе
					Проект = ПараметрыСеанса.упоТекущийПроект;
					Использование = ЗначениеЗаполнено(Проект);
				КонецЕсли;
				Если ЭтаФорма.Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(ЭтаФорма.Параметры.ТекущаяСтрока) Тогда
					Использование = Ложь;
				КонецЕсли;
				
				Если ОтборПоПроекту = Неопределено Тогда
					ОтборПоПроекту = ОбъектФормы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборПоПроекту.ЛевоеЗначение = ПолеПроект;
				КонецЕсли;
				ОтборПоПроекту.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборПоПроекту.ПравоеЗначение = Проект;
				ОтборПоПроекту.Использование = Использование;
				
				ИндексОтбора = ОбъектФормы.Отбор.Элементы.Индекс(ОтборПоПроекту);
				
				ЭлементРодитель = ЭтаФорма.Элементы.Найти("Список");
				
				Если ЭлементРодитель <> Неопределено Тогда
					ДобавитьЭлементОтбораНаФорму(ЭтаФорма, ЭлементРодитель, , ИндексОтбора);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ПолеВладелец = Новый ПолеКомпоновкиДанных("Владелец");
			Если ОбъектФормы.Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеВладелец) <> Неопределено Тогда
				
				ОтборПоПроекту = ОбъектФормы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборПоПроекту.ЛевоеЗначение = ПолеВладелец;
				ОтборПоПроекту.Использование = Ложь;
				ОтборПоПроекту.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементРодитель = ЭтаФорма.Элементы.Найти("Список");
				
				ИндексОтбора = ОбъектФормы.Отбор.Элементы.Индекс(ОтборПоПроекту);
				
				Если ЭлементРодитель <> Неопределено Тогда
					ДобавитьЭлементОтбораНаФорму(ЭтаФорма, ЭлементРодитель, Ложь, ИндексОтбора);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ЭтоСправочникПроекты Тогда
		
		ПроверкаУпрощеннойФормыПоПравамПользователя(ЭтаФорма);
		
	КонецЕсли;
	
	Если ТипЗнч(ОбъектФормы) = Тип("ДанныеФормыСтруктура") И ОбъектФормы.Свойство("Ссылка") Тогда
		
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM()
			Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
			
			СписокОбъектовСДоговорамиЕРМ = ПолучитьПолныйСписокОбъектовЕРМ();
			
			ОтборПоТипу = Новый Структура;
			ОтборПоТипу.Вставить("ТипЗначенияОбъекта", ТипЗнч(ОбъектФормы.Ссылка));
			
			НайденныеСтроки = СписокОбъектовСДоговорамиЕРМ.НайтиСтроки(ОтборПоТипу);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Контрагент", НайденнаяСтрока.ПутьКДанным);
				
				МассивСвязей = Новый Массив;
				МассивСвязей.Добавить(НоваяСвязь);
				НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
				Если ЭтаФорма.Элементы.Найти(НайденнаяСтрока.ЭлементУ) <> Неопределено Тогда
					ЭтаФорма.Элементы[НайденнаяСтрока.ЭлементУ].СвязиПараметровВыбора = НовыеСвязи;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СостИмени.ВидМетаданных = "упоРегистрацияЮридическихУсловийДоговора" Тогда
		ИзменитьЗаголовкиВводаНаОснованииРегистрацииЮрУсловийДоговора(ЭтаФорма.Элементы);
	КонецЕсли;
	
	ПриСозданииНаСервере_РабочиеКалендари(СостИмени, ЭтаФорма);
	
	упоИнтеграцияEPMСервер.УстановитьВидимостьЭлементовВРежимеИнтеграции(ЭтаФорма);
	
	УстановитьВидимостьКомандВерсионированияДополнительныхРеквизитов(СостИмени, ЭтаФорма);
	
	Если ТипЗнч(ОбъектФормы) = Тип("ДанныеФормыСтруктура") И ОбъектФормы.Свойство("Ссылка") Тогда
		ИспользуютсяДопРеквизиты = УправлениеСвойствами.ИспользоватьДопРеквизиты(ОбъектФормы.Ссылка);
		Если ИспользуютсяДопРеквизиты Тогда
			УстановитьПараметрыВыбораДляДопРеквизитаСТипомПроекты(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед записью объекта на сервере. Можно отменить запись.
//
// Параметры:
//  ЭтаФорма		 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Отказ			 - Булево - признак отказа от выполнения действия.
//  ТекущийОбъект	 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - записываемый объект.
//  ПараметрыЗаписи	 - Структура - структура, содержащая параметры записи.
//
Процедура ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи = Неопределено) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при записи объекта из формы.
//
// Параметры:
//  ЭтаФорма		 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Отказ			 - Булево - признак отказа от выполнения действия.
//  ТекущийОбъект	 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - записываемый объект.
//  ПараметрыЗаписи	 - Структура - структура, содержащая параметры записи.
//
Процедура ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи = Неопределено) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый после записи объекта на сервере и после завершения транзакции.
//
// Параметры:
//  ЭтаФорма		 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ТекущийОбъект	 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - записываемый объект.
//  ПараметрыЗаписи	 - Структура - структура, содержащая параметры записи.
//
Процедура ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи = Неопределено) Экспорт
	
	СостИмени = упоФункцииОбщегоНазначенияКлиентСервер.СоставИмениФормы(ЭтаФорма.ИмяФормы);
	
	ПослеЗаписиНаСервере_РабочиеКалендари(СостИмени, ЭтаФорма);
	
КонецПроцедуры

// Обработчик события, вызываемый расширением формы при необходимости проверки заполнения реквизитов
// при записи в форме.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Объект				 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//  Отказ				 - Булево - признак отказа от записи.
//  ПроверяемыеРеквизиты - Массив - массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при сохранении данных в настройках на сервере.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Объект		 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//  Настройки	 - Соответствие - настройки формы.
//
Процедура ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при загрузке данных из настроек на сервере.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Объект		 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//  Настройки	 - Соответствие - настройки формы.
//
Процедура ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при чтении объекта на сервере.
//
// Параметры:
//  ЭтаФорма		 - УправляемаяФорма - форма, для который вызывается обработчик.
//  ТекущийОбъект	 - ДокументОбъект, СправочникОбъект, ОбработкаОбъект, ОтчетОбъект - основной реквизит формы.
//
Процедура ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект) Экспорт
	
КонецПроцедуры

// Обработчик события, вызываемый перед загрузкой данных из настроек на сервере.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Настройки	 - Соответствие - настройки формы.
//
Процедура ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при сохранении варианта отчета.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Настройки	 - НастройкиКомпоновкиДанных - сохраняемые настройки.
//
Процедура ФормаПриСохраненииВариантаНаСервере(ЭтаФорма, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при перед загрузкой варианта на сервере.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Настройки	 - НастройкиКомпоновкиДанных - загружаемые настройки.
//
Процедура ФормаПередЗагрузкойВариантаНаСервере(ЭтаФорма, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый после загрузки настроек в компоновщик настроек.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Настройки	 - НастройкиКомпоновкиДанных - загруженные настройки.
//
Процедура ФормаПриЗагрузкеВариантаНаСервере(ЭтаФорма, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при сохранении пользовательских настроек.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Настройки	 - ПользовательскиеНастройкиКомпоновкиДанных - сохраняемые настройки.
//
Процедура ФормаПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый перед загрузкой пользовательских настроек.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Настройки	 - ПользовательскиеНастройкиКомпоновкиДанных - загружаемые настройки.
//
Процедура ФормаПередЗагрузкойПользовательскихНастроекНаСервере(ЭтаФорма, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события, вызываемый при восстановлении пользовательских настроек.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма, для который вызывается обработчик.
//  Настройки	 - ПользовательскиеНастройкиКомпоновкиДанных - загружаемые настройки.
//
Процедура ФормаПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки) Экспорт
	
	
	
КонецПроцедуры

// Универсальный обработчик событий формы на сервере.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма	 - форма, для который вызывается обработчик.
//  ТипП1	 - Произвольный		 - не используется, зарезервирован.
//  ИмяП1	 - Произвольный		 - не используется, зарезервирован.
//  П2		 - Произвольный		 - не используется, зарезервирован.
//  П3		 - Произвольный		 - не используется, зарезервирован.
//  П4		 - Произвольный		 - не используется, зарезервирован.
//  П5		 - Произвольный		 - не используется, зарезервирован.
//  П6		 - Произвольный		 - не используется, зарезервирован.
//  П7		 - Произвольный		 - не используется, зарезервирован.
//  П8		 - Произвольный		 - не используется, зарезервирован.
//
Процедура ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма,
		ТипП1, ИмяП1, П2, П3, П4, П5, П6, П7 = Неопределено, П8 = Неопределено) Экспорт
	
КонецПроцедуры

// Обработчик события "Обработка заполнения" объекта.
//
// Параметры:
//  Объект				 - Произвольный	 - объект, для которого вызывается событие.
//  ДанныеЗаполнения	 - Произвольный	 - объект-основание.
//  ТекстЗаполнения		 - Строка
//  СтандартнаяОбработка - Булево
//
Процедура ОбъектОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Проекты") Тогда
		
		Объект.СтатьяЗатратПоУмолчанию = Константы.упоСтатьяЗатратПоУмолчанию.Получить();
		Объект.СтатьяДоходовПоУмолчанию = Константы.упоСтатьяДоходовПоУмолчанию.Получить();
		Объект.НатуральныйПоказательДоходовПоУмолчанию = Константы.упоНатуральныйПоказательДоходовПоУмолчанию.Получить();
		Объект.РольДоходовПоУмолчанию = Константы.упоРольДоходовПоУмолчанию.Получить();
		Объект.ПодразделениеДоходовПоУмолчанию = Константы.упоПодразделениеДоходовПоУмолчанию.Получить();
		Объект.РольРасходовПоУмолчанию = Константы.упоРольРасходовПоУмолчанию.Получить();
		Объект.НатуральныйПоказательРасходовПоУмолчанию = Константы.упоНатуральныйПоказательРасходовПоУмолчанию.Получить();
		Объект.ПодразделениеРасходовПоУмолчанию = Константы.упоПодразделениеРасходовПоУмолчанию.Получить();
		Объект.ПрофильДоходовПоУмолчанию = Константы.упоПрофильДоходовПоУмолчанию.Получить();
		Объект.ПрофильРасходовПоУмолчанию = Константы.упоПрофильРасходовПоУмолчанию.Получить();
		
		Объект.СоздаватьЗаданияПриНазначенииРесурсов = Константы.упоСоздаватьЗаданияПриНазначенииРесурсов.Получить();
		
		Объект.упоОсновнойИндикаторПоФазе = Константы.упоОсновнойИндикаторПоФазе.Получить();
		Объект.упоЕдиницаВремениПоУмолчанию = Константы.упоЕдиницаВремениПоУмолчанию.Получить();
		Объект.упоЕдиницаТрудоемкостиПоУмолчанию = Константы.упоЕдиницаТрудоемкостиПоУмолчанию.Получить();
		Объект.ВключитьТрудРесурсыВПланРасходов = Константы.упоВключитьТрудРесурсыВПланРасходов.Получить();
		Объект.ВключитьМатРесурсыВПланРасходов = Константы.упоВключитьМатРесурсыВПланРасходов.Получить();
		Объект.ВключитьДопЗатратыВПланРасходов = Константы.упоВключитьДопЗатратыВПланРасходов.Получить();
		Объект.ВключитьСубпродуктыВПланДоходов = Константы.упоВключитьСубпродуктыВПланДоходов.Получить();
		Объект.упоВключитьПланДоходовВБДДС = Константы.упоВключитьПланДоходовВБДДС.Получить();
		Объект.упоВключитьПланРасходовВБДДС = Константы.упоВключитьПланРасходовВБДДС.Получить();
		Объект.упоСхемаОплатыПоУмолчаниюДоходы = Константы.упоСхемаОплатыПоУмолчаниюДоходы.Получить();
		Объект.упоСхемаОплатыПоУмолчаниюРасходы = Константы.упоСхемаОплатыПоУмолчаниюРасходы.Получить();
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.упоПрограммыПроектов") Тогда
			Объект.Компонент = Перечисления.упоКомпоненты.ПрограммаПроектов;
			Объект.ПрограммаПроектов = ДанныеЗаполнения;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.упоПортфелиПроектов") Тогда
			Объект.Компонент = Перечисления.упоКомпоненты.ПортфельПроектов;
			Объект.ПортфельПроектов = ДанныеЗаполнения;
			
			СтруктураНастроек = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.ПортфельПроектов);
			ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек);
		Иначе
			Объект.Компонент = Перечисления.упоКомпоненты.Проект;
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	
	Если упоИнтеграцияEPMСервер.ИспользоватьПодсистемуРаспределениеЗарплаты() Тогда
		МодульРаспределениеЗарплатыСервер = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыСервер");
		МодульРаспределениеЗарплатыСервер.ОбъектОбработкаЗаполнения(Объект,
			ДанныеЗаполнения,
			ТекстЗаполнения,
			СтандартнаяОбработка);
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектОбработкаЗаполнения(Объект, ДанныеЗаполнения);
	
КонецПроцедуры

// Обработчик события "Перед записью" объекта.
//
// Параметры:
//  Объект	 - Произвольный	 - объект, для которого вызывается событие.
//  Отказ	 - Булево		 - признак отказа от записи.
//
Процедура ОбъектПередЗаписью(Объект, Отказ) Экспорт
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(Объект, Отказ);
	
	ОбъектПередЗаписью_Проекты(Объект, Отказ);
	
КонецПроцедуры

// Обработчик события "При записи" объекта.
//
// Параметры:
//  Объект	 - Произвольный	 - объект, для которого вызывается событие.
//  Отказ	 - Булево		 - признак отказа от записи.
//
Процедура ОбъектПриЗаписи(Объект, Отказ) Экспорт
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(Объект, Отказ);
	
КонецПроцедуры

// Обработчик события "Перед удалением" объекта.
//
// Параметры:
//  Объект	 - Произвольный	 - объект, для которого вызывается событие.
//  Отказ	 - Булево		 - признак отказа от удаления.
//
Процедура ОбъектПередУдалением(Объект, Отказ) Экспорт
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(Объект, Отказ);
	
КонецПроцедуры

// Обработчик события "При копировании" объекта.
//
// Параметры:
//  Объект				 - Произвольный	 - объект, для которого вызывается событие.
//  ОбъектКопирования	 - Произвольный	 - объект, являющийся источником копирования.
//
Процедура ОбъектПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	ОбъектПриКопировании_Проекты(Объект, ОбъектКопирования);
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриКопировании(Объект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события "При установке нового кода" объекта.
//
// Параметры:
//  Объект				 - Произвольный	 - объект, для которого вызывается событие.
//  СтандартнаяОбработка - Булево		 - признак стандартной обработки.
//  Префикс				 - Строка		 - префикс, который будет использоваться для генерации кода.
//
Процедура ОбъектПриУстановкеНовогоКода(Объект, СтандартнаяОбработка, Префикс) Экспорт
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриУстановкеНовогоКода(Объект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события "Обработка проверки заполнения" объекта.
//
// Параметры:
//  Объект		 - Произвольный	 - объект, для которого вызывается событие.
//  ПроверяемыеРеквизиты		 - Массив	 - массив проверяемых реквизитов.
//  Отказ	 - Булево		 - признак отказа при проверке реквизитов.
//
Процедура ОбъектОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Проекты") Тогда
		Если Объект.ЭтоПроектнаяЗадача Тогда
			ИндексЭлемента = ПроверяемыеРеквизиты.Найти("Компонент");
			Если ИндексЭлемента <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
			КонецЕсли;
		КонецЕсли;
		
		Если упоИнтеграцияEPMСервер.ИспользоватьПодсистемуРаспределениеЗарплаты() Тогда
			Если Объект["упоРежимУчетаВзносов"] = 1 Тогда
				ПроверяемыеРеквизиты.Добавить("упоСтатьяРасходовВзносов");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработкаФормВебКлиента

// Функция принудительно выставляет признак отображения кнопок только во всех действиях.
// Используется для отрисовки кнопок на панелях форм в веб-клиенте.
//
// Параметры:
//  ГруппаКнопки - ГруппаФормы - содержит группу кнопок, надо которыми производится действие.
//  НомерКнопки - Число - номер кнопки, начиная с которой кнопки отображаются только во всех действиях.
//  ОставитьПоследние - Число - количество последних кнопок, которые необходимо оставить на панели (актуально для справки).
//
Процедура УбратьАвтоКнопкиПринудительно(ГруппаКнопки, НомерКнопки, ОставитьПоследние = 0) Экспорт
	
	МассивКнопок = Новый Массив();
	ПолучитьПодчиненныеКнопкиРекурсивно(ГруппаКнопки.ПодчиненныеЭлементы, МассивКнопок);
	
	ПоследняяКнопка = МассивКнопок.Количество() - 1 - ОставитьПоследние;
	Для сч = НомерКнопки По ПоследняяКнопка Цикл
		МассивКнопок[сч].ТолькоВоВсехДействиях = Истина;
	КонецЦикла;
	
	МассивКнопок = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПолныйСписокОбъектовЕРМ()
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	
	ТаблицаОбъектов.Колонки.Добавить("ТипЗначенияОбъекта");
	ТаблицаОбъектов.Колонки.Добавить("ПутьКДанным");
	ТаблицаОбъектов.Колонки.Добавить("ЭлементУ");
	
	// Справочники.
	
	// Проекты.
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("СправочникСсылка.Проекты");
	НоваяСтрока.ПутьКДанным = "Объект.КонтрагентДоходов";
	НоваяСтрока.ЭлементУ = "ДоговорДоходов";
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("СправочникСсылка.Проекты");
	НоваяСтрока.ПутьКДанным = "Объект.КонтрагентЗатрат";
	НоваяСтрока.ЭлементУ = "ДоговорЗатрат";
	
	// Шаблоны ПЗ.
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("СправочникСсылка.упоШаблоныПроектныхЗадач");
	НоваяСтрока.ПутьКДанным = "Элементы.МатериальныеРесурсы.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "МатериальныеРесурсыДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("СправочникСсылка.упоШаблоныПроектныхЗадач");
	НоваяСтрока.ПутьКДанным = "Элементы.Субпродукты1.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "Субпродукты1Договор";
	
	// Документы.
	
	// ПЗ.
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоПроектнаяЗадача");
	НоваяСтрока.ПутьКДанным = "Элементы.ДвиженияДенежныхСредств.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "ДвиженияДенежныхСредствДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоПроектнаяЗадача");
	НоваяСтрока.ПутьКДанным = "Элементы.МатериальныеРесурсы.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "МатериальныеРесурсыДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоПроектнаяЗадача");
	НоваяСтрока.ПутьКДанным = "Элементы.ПланДоходов.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "ПланДоходовДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоПроектнаяЗадача");
	НоваяСтрока.ПутьКДанным = "Элементы.ПланРасходов.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "ПланРасходовДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоПроектнаяЗадача");
	НоваяСтрока.ПутьКДанным = "Элементы.Субпродукты.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "СубпродуктыДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоПроектнаяЗадача");
	НоваяСтрока.ПутьКДанным = "Элементы.РаспределениеДоходов.ТекущиеДанные.КонтрагентПодрядчик";
	НоваяСтрока.ЭлементУ = "РаспределениеДоходовЗаказДоговорПодрядчика";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоПроектнаяЗадача");
	НоваяСтрока.ПутьКДанным = "Элементы.РаспределениеОбъемов.ТекущиеДанные.КонтрагентПодрядчик";
	НоваяСтрока.ЭлементУ = "РаспределениеОбъемовЗаказДоговорПодрядчика";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРасчетЦеныКонтракта");
	НоваяСтрока.ПутьКДанным = "Объект.Контрагент";
	НоваяСтрока.ЭлементУ = "ДоговорКонтрагента";
	
	// Регистрация фактических движений денежных средств.
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическихДвиженийДенежныхСредств");
	НоваяСтрока.ПутьКДанным = "Элементы.ДвиженияДенежныхСредств.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "ДвиженияДенежныхСредствДоговор";
	
	// Регистрация фактических доходов и расходов.
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическихДоходовИРасходов");
	НоваяСтрока.ПутьКДанным = "Элементы.Доходы.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "ДоходыДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическихДоходовИРасходов");
	НоваяСтрока.ПутьКДанным = "Элементы.Расходы.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "РасходыДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическихДоходовИРасходов");
	НоваяСтрока.ПутьКДанным = "Элементы.РаспределениеДоходов.ТекущиеДанные.КонтрагентПодрядчик";
	НоваяСтрока.ЭлементУ = "РаспределениеДоходовЗаказДоговорПодрядчика";
	
	// Регистрация фактических затрат мат. ресурсов.
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическихЗатратМатРесурсов");
	НоваяСтрока.ПутьКДанным = "Элементы.ЗатратыМатРесурсовФакт.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "ЗатратыМатРесурсовФактДоговор";
	
	// Регистрация фактически выполненного объема.
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическиВыполненногоОбъема");
	НоваяСтрока.ПутьКДанным = "Элементы.ДоходныеОбъемы.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "ДоходныеОбъемыДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическиВыполненногоОбъема");
	НоваяСтрока.ПутьКДанным = "Элементы.РасходныеОбъемы.ТекущиеДанные.Контрагент";
	НоваяСтрока.ЭлементУ = "РасходныеОбъемыДоговор";
	
	НоваяСтрока = ТаблицаОбъектов.Добавить();
	НоваяСтрока.ТипЗначенияОбъекта = Тип("ДокументСсылка.упоРегистрацияФактическиВыполненногоОбъема");
	НоваяСтрока.ПутьКДанным = "Элементы.РаспределениеДоходныхОбъемов.ТекущиеДанные.КонтрагентПодрядчик";
	НоваяСтрока.ЭлементУ = "РаспределениеДоходныхОбъемовЗаказДоговорПодрядчика";
	
	Возврат ТаблицаОбъектов;
	
КонецФункции

Процедура ДобавитьЭлементОтбораНаФорму(ЭтаФорма, ЭлементРодитель, ПоказыватьВидСтравнения = Истина, ИндексОтбора = 0)
	
	Если ЭтаФорма.Элементы.Найти("ОтборПроект") <> Неопределено Тогда
		ЭтаФорма.ОтборПроект = ЭтаФорма.Список.Отбор.Элементы[ИндексОтбора].ПравоеЗначение;
		Возврат;
	КонецЕсли;
	
	НоваяГруппа = ЭтаФорма.Элементы.Вставить("ГруппаПредустановленныйОтборПоПроекту",
			Тип("ГруппаФормы"), ЭлементРодитель.Родитель, ЭлементРодитель);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	
	НовыйПолеОтбора = ЭтаФорма.Элементы.Добавить("ПолеОтборПоПроектуИспользование", Тип("ПолеФормы"), НоваяГруппа);
	НовыйПолеОтбора.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйПолеОтбора.ПутьКДанным = "Список.Отбор[" + ИндексОтбора + "].Использование";
	НовыйПолеОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	НовыйПолеОтбора = ЭтаФорма.Элементы.Добавить("ПолеОтборПоПроектуЛевоеЗначение", Тип("ПолеФормы"), НоваяГруппа);
	НовыйПолеОтбора.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйПолеОтбора.ПутьКДанным = "Список.Отбор[" + ИндексОтбора + "].ЛевоеЗначение";
	НовыйПолеОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйПолеОтбора.АвтомаксимальнаяШирина = Ложь;
	НовыйПолеОтбора.МаксимальнаяШирина = 15;
	
	Если ПоказыватьВидСтравнения Тогда
		НовыйПолеОтбора = ЭтаФорма.Элементы.Добавить("ПолеОтборПоПроектуВидСравнения", Тип("ПолеФормы"), НоваяГруппа);
		НовыйПолеОтбора.Вид = ВидПоляФормы.ПолеВвода;
		НовыйПолеОтбора.ПутьКДанным = "Список.Отбор[" + ИндексОтбора + "].ВидСравнения";
		НовыйПолеОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйПолеОтбора.АвтомаксимальнаяШирина = Ложь;
		НовыйПолеОтбора.МаксимальнаяШирина = 15;
	КонецЕсли;
	
	НовыйПолеОтбора = ЭтаФорма.Элементы.Добавить("ПолеОтборПоПроектуПравоеЗначение", Тип("ПолеФормы"), НоваяГруппа);
	НовыйПолеОтбора.Вид = ВидПоляФормы.ПолеВвода;
	НовыйПолеОтбора.ПутьКДанным = "Список.Отбор[" + ИндексОтбора + "].ПравоеЗначение";
	НовыйПолеОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйПолеОтбора.АвтомаксимальнаяШирина = Ложь;
	НовыйПолеОтбора.МаксимальнаяШирина = 40;
	
КонецПроцедуры

#Область ИнтеграцияСППР

Процедура ДобавитьКомандыИнтеграцииССППР(Форма, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НеТребуютсяКомандыИнтеграцииССППР(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("РазмещениеКомандСППР") Тогда
		РазмещениеКоманд = ДополнительныеПараметры.РазмещениеКомандСППР;
	Иначе
		РазмещениеКоманд = ОпределитьРазмещениеКоманд(Форма);
	КонецЕсли;
	
	// В форме отчета команда размещается во всех действиях, иначе ее не видно.
	ТолькоВоВсехДействиях = (Найти(Форма.ИмяФормы, "Отчет.") <> 0);
	
	НомерКоманды = 1;
	Для каждого МестоРазмещенияКоманд Из РазмещениеКоманд Цикл
		ДобавитьКомандуФункциональнойМодели(
			Форма,
			МестоРазмещенияКоманд,
			НомерКоманды,
			ТолькоВоВсехДействиях,
			"Подключаемый_УниверсальныйОбработчикСобытийКлиент");
		
		НомерКоманды = НомерКоманды + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьРазмещениеКоманд(Форма)
	
	РазмещениеКоманд = Новый Массив;
	
	Для каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы")
			И Найти(НРег(ЭлементФормы.Имя), НСтр("ru = 'справка'")) <> 0
			И ЭлементФормы.Родитель <> Неопределено Тогда
			
			РазмещениеКоманд.Добавить(ЭлементФормы.Родитель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РазмещениеКоманд;
	
КонецФункции

Функция ДобавитьКомандуФункциональнойМодели(Форма, МестоРазмещенияКоманд, НомерКоманды, ТолькоВоВсехДействиях, Действие)
	
	ИмяКоманды = МестоРазмещенияКоманд.Имя + "КомандаСППР" + Формат(НомерКоманды, "ЧГ=0");
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Действие = Действие; // Универсальный обработчик.
	КомандаФормы.Заголовок = НСтр("ru = 'Функциональная модель'");
	КомандаФормы.Подсказка = НСтр("ru = 'Функциональная модель'");
	КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
	
	НовыйЭлемент = Форма.Элементы.Добавить(МестоРазмещенияКоманд.Имя + ИмяКоманды, Тип("КнопкаФормы"), МестоРазмещенияКоманд);
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	НовыйЭлемент.ТолькоВоВсехДействиях = ТолькоВоВсехДействиях;
	НовыйЭлемент.Картинка = БиблиотекаКартинок["ФункциональнаяМодель"];
	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
	
	Возврат ИмяКоманды;
	
КонецФункции

Функция НеТребуютсяКомандыИнтеграцииССППР(Форма)
	
	Если НЕ упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюССППР")
		ИЛИ НЕ ПравоДоступа("Просмотр", Метаданные.Обработки["ИнтеграцияССППР"])
		ИЛИ Форма.ИмяФормы = "Обработка.ИнтеграцияССППР.Форма.ФункциональнаяМодель"
		ИЛИ Найти(Форма.ИмяФормы, "Справочник.ЭлементыФинансовыхОтчетов") <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ИзменитьЗаголовкиВводаНаОснованииРегистрацииЮрУсловийДоговора(Элементы)
	
	ЭУСоздатьРегистрациюЮрУсловийНаОсновании = Элементы.Найти("ФормаДокументупоРегистрацияЮридическихУсловийДоговораСоздатьНаОсновании");
	Если НЕ ЭУСоздатьРегистрациюЮрУсловийНаОсновании = Неопределено Тогда
		ЭУСоздатьРегистрациюЮрУсловийНаОсновании.Заголовок = НСтр("ru = 'Дополнительное соглашение'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаУпрощеннойФормыПоПравамПользователя(Форма)
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Если Справочники.Проекты.ЕстьОграничениеРолейНаПросмотрРедактированиеПроектов() Тогда
		
		Кнопка = Элементы.Найти("ФормаСправочникПроектыОткрытьКарточкуПроекта");
		Если Кнопка <> Неопределено Тогда
			Кнопка.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Кнопка = Элементы.Найти("ФормаИмпортИзMSProject");
	Если Кнопка <> Неопределено Тогда
		Кнопка.Видимость = РольДоступна("упоИмпортИзMSProject");
	КонецЕсли;
	
	Кнопка = Элементы.Найти("ФормаЭкспортВMSProject");
	Если Кнопка <> Неопределено Тогда
		Кнопка.Видимость = РольДоступна("упоЭкспортВMSProject");
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.упоСотрудники) Тогда
		КолонкаСписка = Элементы.Найти("РуководительПроекта");
		Если КолонкаСписка <> Неопределено Тогда
			КолонкаСписка.Видимость = Ложь;
		КонецЕсли;
		
		КолонкаСписка = Элементы.Найти("КураторПроекта");
		Если КолонкаСписка <> Неопределено Тогда
			КолонкаСписка.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	КолонкаСписка = Элементы.Найти("ПортфельПроектов");
	Если КолонкаСписка <> Неопределено Тогда
		КолонкаСписка.Видимость = ПравоДоступа("Чтение", Метаданные.Справочники.упоПортфелиПроектов);
	КонецЕсли;
	
	КолонкаСписка = Элементы.Найти("ПрограммаПроектов");
	Если КолонкаСписка <> Неопределено Тогда
		КолонкаСписка.Видимость = ПравоДоступа("Чтение", Метаданные.Справочники.упоПрограммыПроектов);
	КонецЕсли;
	
	КолонкаСписка = Элементы.Найти("Подразделение");
	Если КолонкаСписка <> Неопределено Тогда
		КолонкаСписка.Видимость = ПравоДоступа("Чтение", Метаданные.Справочники.упоПодразделения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрыВыбораДляДопРеквизитаСТипомПроекты(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ОписаниеТиповПроекты = Новый ОписаниеТипов("СправочникСсылка.Проекты");
	
	ШаблонПоискаДополнительныхРеквизитов = "ДополнительныйРеквизитЗначение";
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Для каждого Реквизит Из РеквизитыФормы Цикл
		ИмяРеквизита = Реквизит.Имя;
		
		Если СтрНайти(ИмяРеквизита, ШаблонПоискаДополнительныхРеквизитов) <> 0 Тогда
			Если Реквизит.ТипЗначения <> ОписаниеТиповПроекты Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныйЭлемент = ЭлементыФормы.Найти(ИмяРеквизита);
			Если НайденныйЭлемент = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыВыбора = Новый Массив;
			ЗначениеПараметровВыбора = Новый ПараметрВыбора("Отбор.ЭтоГруппа", Ложь);
			ПараметрыВыбора.Добавить(ЗначениеПараметровВыбора);
			НайденныйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаФормВебКлиента

Процедура ПолучитьПодчиненныеКнопкиРекурсивно(ГруппаЭлементов, МассивКнопок)
	
	Для Каждого ЭлементГруппы Из ГруппаЭлементов Цикл
		Если ТипЗНЧ(ЭлементГруппы) = Тип("ГруппаФормы") Тогда
			ПолучитьПодчиненныеКнопкиРекурсивно(ЭлементГруппы.ПодчиненныеЭлементы, МассивКнопок);
		ИначеЕсли ТипЗнч(ЭлементГруппы) = Тип("КнопкаФормы") Тогда
			МассивКнопок.Добавить(ЭлементГруппы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ЭтоИзменениеСтиляДляФормыДокументооборота(Форма)
	
	ЭтоФормаДокументооборота = Ложь;
	Если Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.СозданиеБизнесПроцесса" Тогда
		ИмяКнопки = "СоздатьПроцесс";
		ЭтоФормаДокументооборота = Истина;
	ИначеЕсли Форма.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.ВыборТипаПредмета" Тогда
		ИмяКнопки = "КомандаВыбрать";
		ЭтоФормаДокументооборота = Истина;
	КонецЕсли;
	
	Если ЭтоФормаДокументооборота
		И упоИнтеграцияКлиентСервер.ИспользуетсяСтильОформленияITLand() Тогда
		Форма.Элементы[ИмяКнопки].ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	КонецЕсли;
	
	Возврат ЭтоФормаДокументооборота;
	
КонецФункции

Процедура ОбъектПередЗаписью_Проекты(Объект, Отказ)
	
	Если Не ТипЗнч(Объект) = Тип("СправочникОбъект.Проекты") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Объект.ЭтоНовый();
	ЭтоПроект = Не Объект.ЭтоПроектнаяЗадача;
	
	Объект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый);
	
	Если ЭтоНовый Тогда
		// Если объект новый, тогда он относится к текущей версии проекта.
		Объект.ТекущаяВерсия = Истина;
	КонецЕсли;
	
	Если ЭтоПроект Тогда
		Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
			упоФазыПроектаСервер.ПроверитьИсправитьФазыПроекта(Объект, Отказ);
		КонецЕсли;
		
		Если ЭтоНовый И Не ЗначениеЗаполнено(Объект.упоШифр) Тогда
			Объект.УстановитьНовыйКод();
			Объект.упоШифр = Объект.Код;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбъектПриКопировании_Проекты(Объект, ОбъектКопирования)
	
	Если Не ТипЗнч(Объект) = Тип("СправочникОбъект.Проекты") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		Объект.Фазы.Очистить();
		Объект.упоТекущаяФаза = Справочники.упоФазыПроектов.ПустаяСсылка();
		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		ТекущаяДата = ТекущаяДатаСеанса();
		
		Объект.Завершен = Ложь;
		Объект.ПлановаяДатаНачала = ТекущаяДата;
		Объект.ПлановаяДатаОкончания = ТекущаяДата;
		Объект.ДатаНачала = ТекущаяДата;
		Объект.ДатаОкончания = ТекущаяДата;
		
	КонецЕсли;
	
	Объект.упоШифр = "";
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере_РабочиеКалендари(СостИмени, Форма)
	
	Если Не упоРаботаСФормамиКлиентСервер.ЭтоФормаРабочегоКалендаря(СостИмени) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКалендарь = упоРаботаСФормамиКлиентСервер.ИмяРеквизитаКалендарь(СостИмени);
	ИмяКоманды = упоРаботаСФормамиКлиентСервер.ИмяЭлемента_КомандаОптимизироватьРабочиеКалендари();
	НуженРасчетСдвигов = упоРабочиеКалендариВызовСервера.НуженРасчетСдвигов(Форма.Объект[ИмяРеквизитаКалендарь]);
	
	Форма.Элементы[ИмяКоманды].Видимость = НуженРасчетСдвигов;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_РабочиеКалендари(СостИмени, Форма)
	
	Если Не упоРаботаСФормамиКлиентСервер.ЭтоФормаРабочегоКалендаря(СостИмени) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаКалендарь = упоРаботаСФормамиКлиентСервер.ИмяРеквизитаКалендарь(СостИмени);
	НуженРасчетСдвигов = упоРабочиеКалендариВызовСервера.НуженРасчетСдвигов(Форма.Объект[ИмяРеквизитаКалендарь]);
	
	ИмяКоманды = упоРаботаСФормамиКлиентСервер.ИмяЭлемента_КомандаОптимизироватьРабочиеКалендари();
	
	НоваяКомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	НоваяКомандаФормы.Заголовок = НСтр("ru = 'Нужна оптимизация расчета сроков'");
	НоваяКомандаФормы.Подсказка = НСтр("ru = 'Рассчитать сдвиги сроков для ускорения алгоритма расчета сроков'");
	
	Элемент_Команда = Форма.Элементы.Добавить(ИмяКоманды,
			Тип("КнопкаФормы"),
			Форма.Элементы.ФормаКоманднаяПанель);
	
	Элемент_Команда.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Элемент_Команда.ЦветТекста = WebЦвета.Красный;
	Элемент_Команда.Шрифт = Новый Шрифт( , , Истина);
	Элемент_Команда.ИмяКоманды = ИмяКоманды;
	Элемент_Команда.Видимость = НуженРасчетСдвигов;
	
КонецПроцедуры

Процедура УстановитьВидимостьКомандВерсионированияДополнительныхРеквизитов(СостИмени, Форма)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалВерсионированиеДопРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Если Не СостИмени.ТипМетаданных = "Справочник" Тогда
		Возврат;
	КонецЕсли;

	ПустаяСсылка = Справочники[СостИмени.ВидМетаданных].ПустаяСсылка();
	ТипСсылки = ТипЗнч(ПустаяСсылка);

	ОписаниеТипов_упоВладелецВерсионируемыхСвойств = Метаданные.ОпределяемыеТипы.упоВладелецВерсионируемыхСвойств.Тип;
	Если Не ОписаниеТипов_упоВладелецВерсионируемыхСвойств.СодержитТип(ТипСсылки) Тогда
		Возврат;
	КонецЕсли;

	Элементы = Форма.Элементы;

	Если Элементы.Найти("ФормаупоВерсииДополнительныхРеквизитов") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИспользоватьДополнительныеРеквизиты = Константы.ИспользоватьДополнительныеРеквизитыИСведения.Получить();

	ИмяНабораДополнительныхРеквизитов = СостИмени.ТипМетаданных + "_" + СостИмени.ВидМетаданных;
	ИспользуетсяНаборДополнительныхРеквизитов = 
		Справочники.НаборыДополнительныхРеквизитовИСведений[ИмяНабораДополнительныхРеквизитов].Используется;

	СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(ПустаяСсылка, Истина, Ложь);

	Элементы.ФормаупоВерсииДополнительныхРеквизитов.Видимость = ИспользоватьДополнительныеРеквизиты
																	И ИспользуетсяНаборДополнительныхРеквизитов
																	И ЗначениеЗаполнено(СвойстваОбъекта);

КонецПроцедуры

#КонецОбласти