////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для печати шаблонов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает список файлов, принадлежащих документу.
//
// Параметры:
//  Ссылка	 - ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора - документ, для которого идет поиск файлов.
//
// Возвращаемое значение:
//	СписокЗначений - список ссылок на документы.
//
Функция ПолучитьСписокДокументов(Ссылка) Экспорт 
	 
	СтрокаТипа 		= упоУправлениеФормамиСервер.ВернутьСтрокуТипа(Ссылка);
	СтрокиТипа 		= СтрЗаменить(СтрокаТипа, ".", Символы.ПС);
	СтрокаБезСсылки	= СтрЗаменить(СтрПолучитьСтроку(СтрокиТипа, 1), "Ссылка", "");
	Параметр 		= СтрокаБезСсылки + "." + СтрПолучитьСтроку(СтрокиТипа, 2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСвязиОбъектовСистемыИФайлов.Ссылка
		|ПОМЕСТИТЬ Параметр
		|ИЗ
		|	Справочник.упоСвязиОбъектовСистемыИФайлов КАК упоСвязиОбъектовСистемыИФайлов
		|ГДЕ
		|	упоСвязиОбъектовСистемыИФайлов.ТипОбъектаМетаданных "
		+ "ССЫЛКА " + Параметр + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Файлы.Ссылка
		|ПОМЕСТИТЬ ВТФайлы
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла В
		|			(ВЫБРАТЬ
		|				Параметр.Ссылка
		|			ИЗ
		|				Параметр КАК Параметр)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТФайлы.Ссылка
		|ИЗ
		|	ВТФайлы КАК ВТФайлы 
		|ГДЕ
		|	НЕ ВТФайлы.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТФайлы.Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Список = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		НовыйЭлементСписка 					= Список.Добавить();
		НовыйЭлементСписка.Значение 		= ВыборкаДетальныеЗаписи.Ссылка;
		НовыйЭлементСписка.Представление	= ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Список;
	 
КонецФункции
 
// Получает параметры заполнения параметров.
//
// Возвращаемое значение:
//	Соответствие - коллекция пар ключ-значение, где ключ - параметр MS Word (строка),
//		а значение - действие (строка), правило заполнения.
//
Функция ПолучитьПарметрыЗаполнения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДействия.Действие,
	               |	упоДействия.ПараметрWord КАК Представление
	               |ИЗ
	               |	Справочник.упоПравилаЗаполненияПараметров КАК упоДействия
	               |ГДЕ
	               |	НЕ упоДействия.ЭтоГруппа
	               |	И НЕ упоДействия.ПометкаУдаления";
	
	ДанныеДляСтруктуры 			= Запрос.Выполнить().Выбрать();		
	ДанныеДляВозврата 			= Новый Соответствие;
	Пока ДанныеДляСтруктуры.Следующий() Цикл 
		ДанныеДляВозврата.Вставить(ДанныеДляСтруктуры.Представление,ДанныеДляСтруктуры.Действие);
	КонецЦикла;
	
	Возврат ДанныеДляВозврата;
	
КонецФункции

// Возвращает результат выполнения действия.
//
// Параметры:
//  Действие	 - Строка 		- действие, которое необходимо выполнить.
//  Объект		 - Произвольный - не используется.
//  Параметры	 - Произвольный - не используется.
//
// Возвращаемое значение:
//	Строка, Массив - результат выполнения действия.
//
Функция ПолучитьРезультатВыполненияДействия(Действие, Объект = Неопределено, Параметры = Неопределено) Экспорт
	
	Результат = "";
	Попытка
		ТакогоПараметраНЕТВДокументе = Ложь;
		Выполнить(Действие);
	Исключение
		ТакогоПараметраНЕТВДокументе = Истина;
	КонецПопытки;
	
	Если ТакогоПараметраНЕТВДокументе И Результат = "" Тогда
	КонецЕсли;
	
	Если ТипЗнч(Результат)  = Тип("ТаблицаЗначений") Тогда 
		МассивСтрок 		= Новый Массив;
		Колонки 			= Результат.Колонки;
		Для Каждого СтрокаРезультата Из Результат Цикл
			СтруктураСтроки	= Новый Соответствие;
			Для Каждого КолонкаРезультата Из Колонки Цикл
				СтруктураСтроки.Вставить(КолонкаРезультата.Имя, СтрокаРезультата  [КолонкаРезультата.Имя])
			КонецЦикла;
			МассивСтрок.Добавить(СтруктураСтроки);
		КонецЦикла;
		
		Результат = МассивСтрок;
	КонецЕсли;
	
	Возврат Результат;
	 
КонецФункции
               
#КонецОбласти