
#Область ПрограммныйИнтерфейс

// Распределить косвенные расходы
//
// Параметры:
//  ТаблицаКосвенныхРасходов - ТаблицаЗначений - таблица с суммами для распределения
//  ТаблицаРезультат		 - ТаблицаЗначений - результирующая таблица
//  Параметры				 - Структура - параметры:
//		*МассивПроектыДляРаспределения - Массив - проекты для распределения
//		*ДатаНачало - Дата - начало периода
//		*ДатаКонец - Дата - конецПериода
//
Процедура КосвенныеРасходыРаспределить(ТаблицаКосвенныхРасходов, ТаблицаРезультат, Параметры) Экспорт

	Если Не ЗначениеЗаполнено(ТаблицаКосвенныхРасходов) Тогда
		Возврат;
	КонецЕсли;
	
	ПромежуточнаяТаблица = ТаблицаРезультат.СкопироватьКолонки();
	
	Для Каждого СтрокаТаблицы Из ТаблицаКосвенныхРасходов Цикл
		
		ПромежуточнаяТаблица.Очистить();
		РаспределитьСтрокуТаблицыПоПроектам(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		РаспределитьСтрокуТаблицыПоПодразделениям(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
		Для Каждого Строка Из ПромежуточнаяТаблица Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры

// Проверить способы распределения для документа "Распределение расходов по проектам"
// и для обработки "Помощник распределения расходов по проектам"
//
// Параметры:
//  МассивСпособов	 - Массив - способы распределения расходов по проектам;
//  ЭтоДокумент		 - Булево - признак для разграничения вызова из документа или обработки.
//
Процедура ПроверитьСпособыРаспределения(МассивСпособов, ЭтоДокумент) Экспорт

	МассивПоПроектам = Новый Массив;
	МассивПоПодразделениям = Новый Массив;
	
	Для Каждого Строка Из МассивСпособов Цикл
		
		ДобавитьВМассив(МассивПоПроектам, Строка.СпособРаспределенияПоНаправлениямДеятельности);
		ДобавитьВМассив(МассивПоПодразделениям, Строка.СпособРаспределенияПоПодразделениям);

	КонецЦикла;
	
	Если ЭтоДокумент Тогда
		
		МассивДляПроверкиПоПроектам = СпособыПоПроектамДляДокумента();
		МассивДляПроверкиПоПодразделениям = СпособыПоПодразделениямДляДокумента();
		
	Иначе
		
		МассивДляПроверкиПоПроектам = СпособыПоПроектамДляОбработки();
		МассивДляПроверкиПоПодразделениям = СпособыПоПодразделениямДляОбработки();
		
	КонецЕсли;
	
	РазностьПоПроектам = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивПоПроектам, 
		МассивДляПроверкиПоПроектам); 
	РазностьПоПодразделениям = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивПоПодразделениям,
		МассивДляПроверкиПоПодразделениям);
		
	Если РазностьПоПроектам.Количество() = 0 И РазностьПоПодразделениям.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Разделитель = ",";
	СтрокаПоПроектам = СтрСоединить(РазностьПоПроектам, Разделитель);
	СтрокаПоПодразделениям = СтрСоединить(РазностьПоПодразделениям, Разделитель);
	Использование = ?(ЭтоДокумент, "в документе", "в обработке");
	
	Если РазностьПоПроектам.Количество() Тогда
		
		ШаблонСообщения = нСтр("ru='Внимание! Присутствуют способы распределения по проектам ""%1"",
			| которые не предназначены для использования %2. Проверьте способы распределения расходов.'", "ru");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
			СтрокаПоПроектам, Использование); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	Если РазностьПоПодразделениям.Количество() Тогда
		
		ШаблонСообщения = нСтр("ru='Внимание! Присутствуют способы распределения по подразделениям ""%1"",
			| которые не предназначены для использования %2. Проверьте способы распределения расходов.'", "ru");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
			СтрокаПоПодразделениям, Использование); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РаспределитьСтрокуТаблицыПоПроектам(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры)
	
	СпособРаспределенияРасходов = СтрокаТаблицы.СпособРаспределенияРасходов;
	
	Если НЕ ЗначениеЗаполнено(СпособРаспределенияРасходов) Тогда
		Возврат;
	КонецЕсли;
	
	СпособРаспределения = СпособРаспределенияРасходов.СпособРаспределенияПоНаправлениямДеятельности;
	
	Если НЕ ЗначениеЗаполнено(СпособРаспределения) Тогда
		Возврат;
	КонецЕсли;
	
	ПеречислениеМенеджер = Перечисления.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности;
	Проект_ПоКоэффициентам = ПеречислениеМенеджер.ПоКоэффициентам;
	Проект_ПоТрудозатратам = ПеречислениеМенеджер.ПоТрудозатратам;
	Проект_ПоТрудозатратамСтоимость = ПеречислениеМенеджер.ПоСтоимостиФактическихЧасов;
	Проект_ПоРаспределениюОбъемовПлан = ПеречислениеМенеджер.ПоРаспределениюОбъемовПлан;
	Проект_ПоРаспределениюОбъемовФакт = ПеречислениеМенеджер.ПоРаспределениюОбъемовФакт;
	Проект_ПоСогласованнымЧасам = ПеречислениеМенеджер.ПоСогласованнымЧасам;
	Проект_ПоСтоимостиСогласованныхЧасов = ПеречислениеМенеджер.ПоСтоимостиСогласованныхЧасов;
	Проект_ПоСтатьямФОТ = ПеречислениеМенеджер.ПоСтатьямФОТ;
	Проект_ПоПрямымСтатьямРМ = ПеречислениеМенеджер.ПоПрямымСтатьямPM;
	Проект_ПоУказаннымСтатьям = ПеречислениеМенеджер.ПоУказаннымСтатьям;
	Проект_ПоВыручкеПлан = ПеречислениеМенеджер.ПоВыручкеПлан;
	Проект_ПоВыручкеФакт = ПеречислениеМенеджер.ПоВыручкеФакт;
	
	Если СпособРаспределения = Проект_ПоКоэффициентам Тогда
		
		РаспределитьСтрокуПоКоэффициентам(СтрокаТаблицы, ПромежуточнаяТаблица);
		
	ИначеЕсли СпособРаспределения = Проект_ПоУказаннымСтатьям Тогда
		
		Параметры.Вставить("Вид", "статьи_проект");
		СтатьиЗатрат = СпособРаспределенияРасходов.СтатьиРасходов.ВыгрузитьКолонку("СтатьяРасходов");
		Параметры.Вставить("СтатьиЗатрат", СтатьиЗатрат);
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоТрудозатратам Тогда
		
		Параметры.Вставить("Вид", "часы_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоТрудозатратамСтоимость Тогда
		
		Параметры.Вставить("Вид", "стоимость_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоРаспределениюОбъемовПлан Тогда
		
		Параметры.Вставить("Вид", "план_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоРаспределениюОбъемовФакт Тогда
		
		Параметры.Вставить("Вид", "факт_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоВыручкеПлан Тогда
		
		Параметры.Вставить("Вид", "планвыручка_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоВыручкеФакт Тогда
		
		Параметры.Вставить("Вид", "фактвыручка_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоСтатьямФОТ Тогда
		
		Параметры.Вставить("Вид", "фот_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоПрямымСтатьямРМ Тогда
		
		Параметры.Вставить("Вид", "прямые_проект"); 
		РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = Проект_ПоСогласованнымЧасам Тогда
		
		// Работает только в случае инеграции модуля "Согласование часов"
		Если Параметры.ИспользуетсяПодсистемаСогласованияЧасов Тогда
			Параметры.Вставить("Вид", "соглчасы_проект"); 
			РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		КонецЕсли;
		
	ИначеЕсли СпособРаспределения = Проект_ПоСтоимостиСогласованныхЧасов Тогда
		
		// Работает только в случае инеграции модуля "Согласование часов"
		Если Параметры.ИспользуетсяПодсистемаСогласованияЧасов Тогда
			Параметры.Вставить("Вид", "соглстоимость_проект"); 
			РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьСтрокуПоКоэффициентам(СтрокаТаблицы, ПромежуточнаяТаблица)
	
	КоэффициентыНД = СтрокаТаблицы.СпособРаспределенияРасходов.КоэффициентыНД;
	
	Для Каждого СтрокаКоэф Из КоэффициентыНД Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаКоэф.ПроектнаяЗадача) Тогда
			ТекстСообщения = НСтр("ru = 'Не указана проектная задача в способе распределения расходов'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;	
		
		ПроектнаяЗадача = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоэф.ПроектнаяЗадача, "СсылкаНаПроектнуюЗадачу");

		НоваяСтрока = ПромежуточнаяТаблица.Добавить();
		НоваяСтрока.ПроектнаяЗадача = ПроектнаяЗадача;
		НоваяСтрока.Период = СтрокаТаблицы.Период;
		НоваяСтрока.ИндексСтрокиРасходов = СтрокаТаблицы.ИндексСтрокиРасходов;
		НоваяСтрока.СтатьяРасходов = СтрокаТаблицы.СтатьяРасходов;
		НоваяСтрока.СобствСилы_Субподряд = СтрокаТаблицы.СобствСилы_Субподряд;
		
		ВсеПроценты = 100;
		Коэф = СтрокаКоэф.Доля / ВсеПроценты;
		НоваяСтрока.КоэффициентПроекта = Коэф;
		НоваяСтрока.Сумма = СтрокаТаблицы.Сумма * Коэф;
		
	КонецЦикла;
	
	КолонкиСумма = ПолучитьКолонкиСумма();
	СкорректироватьОкруглениеВРаспределеннойТаблице(СтрокаТаблицы, ПромежуточнаяТаблица, КолонкиСумма);
	
КонецПроцедуры

Процедура РаспределитьСтрокуПроектаПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры)
	
	КоэффициентыНД = ПолучитьТаблицуРаспределения(Параметры);
	
	Для Каждого СтрокаКоэф Из КоэффициентыНД Цикл
		
		НоваяСтрока = ПромежуточнаяТаблица.Добавить();
		
		ПроектнаяЗадача = СтрокаКоэф.ПроектнаяЗадача;
		НоваяСтрока.ПроектнаяЗадача = ПроектнаяЗадача;
		НоваяСтрока.Период = СтрокаТаблицы.Период;
		НоваяСтрока.СтатьяРасходов = СтрокаТаблицы.СтатьяРасходов;
		НоваяСтрока.СобствСилы_Субподряд = СтрокаТаблицы.СобствСилы_Субподряд;
		НоваяСтрока.ИндексСтрокиРасходов = СтрокаТаблицы.ИндексСтрокиРасходов;
		НоваяСтрока.КоэффициентПроекта = СтрокаКоэф.Коэффициент;
		НоваяСтрока.Сумма = СтрокаТаблицы.Сумма * СтрокаКоэф.Коэффициент;
		
	КонецЦикла;
	
	КолонкиСумма = ПолучитьКолонкиСумма();
	СкорректироватьОкруглениеВРаспределеннойТаблице(СтрокаТаблицы, ПромежуточнаяТаблица, КолонкиСумма);
	
КонецПроцедуры

Процедура РаспределитьСтрокуТаблицыПоПодразделениям(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры)
	
	СпособРаспределенияРасходов = СтрокаТаблицы.СпособРаспределенияРасходов;
	
	Если НЕ ЗначениеЗаполнено(СпособРаспределенияРасходов) Тогда
		Возврат;
	КонецЕсли;
	
	СпособРаспределения = СпособРаспределенияРасходов.СпособРаспределенияПоПодразделениям;
	
	Если НЕ ЗначениеЗаполнено(СпособРаспределения) Тогда
		Возврат;
	КонецЕсли;
	
	ПеречислениеМенеджер = Перечисления.упоВидРаспределенияОПРиОХРпоПодразделениям;
	ПоКоэффициентам = ПеречислениеМенеджер.ПоКоэффициентам;
	ПоРаспределениюОбъемовПлан = ПеречислениеМенеджер.ПоРаспределениюОбъемовПлан;
	ПоРаспределениюОбъемовФакт = ПеречислениеМенеджер.ПоРаспределениюОбъемовФакт;
	ПоТрудозатратам = ПеречислениеМенеджер.ПоТрудозатратам;
	ПоТрудозатратамСтоимость = ПеречислениеМенеджер.ПоСтоимостиФактическихЧасов;
	ПоСогласованнымЧасам = ПеречислениеМенеджер.ПоСогласованнымЧасам;
	ПоСтоимостиСогласованныхЧасов = ПеречислениеМенеджер.ПоСтоимостиСогласованныхЧасов;
	ПоСтатьямФОТ = ПеречислениеМенеджер.ПоСтатьямФОТ;
	ПоПрямымСтатьямРМ = ПеречислениеМенеджер.ПоПрямымСтатьямPM;
    НеРаспределять = ПеречислениеМенеджер.НеРаспределять;
	ПоВыручкеПлан = ПеречислениеМенеджер.ПоВыручкеПлан;
	ПоВыручкеФакт = ПеречислениеМенеджер.ПоВыручкеФакт;
	
	Если СтрокаТаблицы.СобствСилы_Субподряд = Справочники.упоСобственныеСилыСубподряд.НДС Тогда
		
		РаспределитьСтрокуПоПодразделениямСлужебногоПроекта(СтрокаТаблицы, ПромежуточнаяТаблица);

	ИначеЕсли СпособРаспределения = ПоКоэффициентам Тогда
		
		РаспределитьСтрокуПоПодразделениямПоКоэффициентам(СтрокаТаблицы, ПромежуточнаяТаблица);
		
	ИначеЕсли СпособРаспределения = НеРаспределять Тогда
		
		РаспределитьСтрокуПоПодразделениямСлужебногоПроекта(СтрокаТаблицы, ПромежуточнаяТаблица);
		
	ИначеЕсли СпособРаспределения = ПоРаспределениюОбъемовПлан Тогда
		
		Параметры.Вставить("Вид", "план_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = ПоРаспределениюОбъемовФакт Тогда
		
		Параметры.Вставить("Вид", "факт_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = ПоВыручкеПлан Тогда
		
		Параметры.Вставить("Вид", "планвыручка_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = ПоВыручкеФакт Тогда
		
		Параметры.Вставить("Вид", "фактвыручка_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = ПоТрудозатратам Тогда
		
		Параметры.Вставить("Вид", "часы_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = ПоТрудозатратамСтоимость Тогда
		
		Параметры.Вставить("Вид", "стоимость_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = ПоСогласованнымЧасам Тогда
		
		// Работает только в случае инеграции модуля "Согласование часов"
		Если Параметры.ИспользуетсяПодсистемаСогласованияЧасов Тогда
			Параметры.Вставить("Вид", "соглчасы_подразделение");
			РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		КонецЕсли;
		
	ИначеЕсли СпособРаспределения = ПоСтоимостиСогласованныхЧасов Тогда
		
		// Работает только в случае инеграции модуля "Согласование часов"
		Если Параметры.ИспользуетсяПодсистемаСогласованияЧасов Тогда
			Параметры.Вставить("Вид", "соглстоимость_подразделение");
			РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		КонецЕсли;
		
	ИначеЕсли СпособРаспределения = ПоСтатьямФОТ Тогда
		
		Параметры.Вставить("Вид", "фот_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	ИначеЕсли СпособРаспределения = ПоПрямымСтатьямРМ Тогда
		
		Параметры.Вставить("Вид", "прямые_подразделение");
		РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьСтрокуПоПодразделениямПоКоэффициентам(СтрокаТаблицы, ПромежуточнаяТаблица)
	
	Коэффициенты = СтрокаТаблицы.СпособРаспределенияРасходов.КоэффициентыПодразделений;
	
	КопияПромежуточнаяТаблица = ПромежуточнаяТаблица.СкопироватьКолонки();
	ТЗРезультатРаспределения = ПромежуточнаяТаблица.СкопироватьКолонки();
	
	Для Каждого СтрокаПромежуточная Из ПромежуточнаяТаблица Цикл
		
		КопияПромежуточнаяТаблица.Очистить();
		
		Для Каждого СтрокаКоэф Из Коэффициенты Цикл
			
			ВсеПроценты = 100;
			Коэф = СтрокаКоэф.Доля / ВсеПроценты;
			
			НоваяСтрока = КопияПромежуточнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПромежуточная);
			
			НоваяСтрока.Подразделение = СтрокаКоэф.Подразделение;
			НоваяСтрока.КоэффициентПодразделения = Коэф;
			НоваяСтрока.Сумма = СтрокаПромежуточная.Сумма * Коэф;
			
		КонецЦикла;
		
		КолонкиСумма = ПолучитьКолонкиСумма();
		СкорректироватьОкруглениеВРаспределеннойТаблице(СтрокаПромежуточная, КопияПромежуточнаяТаблица, КолонкиСумма);
		
		Для Каждого Строка Из КопияПромежуточнаяТаблица Цикл
			НоваяСтрока = ТЗРезультатРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
		
	КонецЦикла;
	
	ПромежуточнаяТаблица.Очистить();
	
	Для Каждого Строка Из ТЗРезультатРаспределения Цикл
		
		НоваяСтрока = ПромежуточнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьСтрокуПоПодразделениямСлужебногоПроекта(СтрокаТаблицы, ПромежуточнаяТаблица)
	
	ТЗРезультатРаспределения = ПромежуточнаяТаблица.СкопироватьКолонки();
	
	Для Каждого СтрокаПромежуточная Из ПромежуточнаяТаблица Цикл
		
		НоваяСтрока = ТЗРезультатРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПромежуточная);
		
		НоваяСтрока.Подразделение = СтрокаТаблицы.Подразделение;
		НоваяСтрока.КоэффициентПодразделения = СтрокаПромежуточная.КоэффициентПроекта;
		
	КонецЦикла;
	
	ПромежуточнаяТаблица.Очистить();
	
	Для Каждого Строка Из ТЗРезультатРаспределения Цикл
		
		НоваяСтрока = ПромежуточнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьСтрокуПодразделенияПоБазеРаспределения(СтрокаТаблицы, ПромежуточнаяТаблица, Параметры)
	
	МассивПЗ = ПромежуточнаяТаблица.ВыгрузитьКолонку("ПроектнаяЗадача");
	Коэффициенты = ПолучитьТаблицуРаспределенияПоПодразделениям(Параметры, МассивПЗ);
	
	ТЗРезультатРаспределения = ПромежуточнаяТаблица.СкопироватьКолонки();
	
	Для Каждого СтрокаКоэф Из Коэффициенты Цикл
		
		СтруктураПоиск = Новый Структура("ПроектнаяЗадача", СтрокаКоэф.ПроектнаяЗадача);
		НайдСтроки = ПромежуточнаяТаблица.НайтиСтроки(СтруктураПоиск);
		
		Если НайдСтроки.Количество() > 0 Тогда
			
			НоваяСтрока = ТЗРезультатРаспределения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайдСтроки[0]);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоэф);
			НоваяСтрока.Подразделение = СтрокаКоэф.Подразделение;
			НоваяСтрока.КоэффициентПодразделения = СтрокаКоэф.Коэффициент;
			НоваяСтрока.Сумма = СтрокаТаблицы.Сумма * СтрокаКоэф.Коэффициент;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КолонкиСумма = ПолучитьКолонкиСумма();
	СкорректироватьОкруглениеВРаспределеннойТаблице(СтрокаТаблицы, ТЗРезультатРаспределения, КолонкиСумма);
	
	ПромежуточнаяТаблица.Очистить();
	
	Для Каждого Строка Из ТЗРезультатРаспределения Цикл
		
		НоваяСтрока = ПромежуточнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	КонецЦикла;
		
КонецПроцедуры

Процедура СкорректироватьОкруглениеВРаспределеннойТаблице(СтрокаРаспределяемая, Таблица, КолонкиСумма)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяКолонки Из КолонкиСумма Цикл
		
		ИтогПоКолонке = Таблица.Итог(ИмяКолонки);
		
		Если НЕ ИтогПоКолонке = СтрокаРаспределяемая[ИмяКолонки] Тогда
			Индекс = Таблица.Количество() - 1;
			Таблица[Индекс][ИмяКолонки] = Таблица[Индекс][ИмяКолонки] + (СтрокаРаспределяемая[ИмяКолонки] - ИтогПоКолонке);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКолонкиСумма()
	
	КолонкиСумма = Новый Массив;
	КолонкиСумма.Добавить("Сумма");
	
	Возврат КолонкиСумма;
	
КонецФункции

Функция ПолучитьТаблицуРаспределения(ДанныеОтбора)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДанныеОтбора.ДатаНачало));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДанныеОтбора.ДатаКонец));
	Запрос.УстановитьПараметр("МассивПроектов", ДанныеОтбора.МассивПроектыДляРаспределения);
	Запрос.УстановитьПараметр("ВидОбъема", ПредопределенноеЗначение("Перечисление.упоВидЭлементаОбъемов.Доход"));
	Запрос.УстановитьПараметр("ВидРасхода", ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход"));
	Запрос.УстановитьПараметр("УровеньПланирования", ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Предварительный"));	
	Запрос.УстановитьПараметр("НДС", Справочники.упоСобственныеСилыСубподряд.НДС);	
	Запрос.УстановитьПараметр("ВидДохода", ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход"));
	
	Если НРег(ДанныеОтбора.Вид) = "часы_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоФактическимТрудозатратам();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "статьи_проект" Тогда
		Запрос.УстановитьПараметр("СтатьиЗатрат", ДанныеОтбора.СтатьиЗатрат);
		Запрос.Текст = ТекстЗапроса_ПроектПоУказаннымСтатьям();	
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "стоимость_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоСтоимостиФактическихТрудозатрат();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "соглчасы_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоСогласованнымЧасам();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "соглстоимость_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоСтоимостиСогласованныхЧасов();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "план_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоОбъемамПлан();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "факт_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоОбъемамФакт();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "планвыручка_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоВыручкеПлан();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "фактвыручка_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоВыручкеФакт();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "фот_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоСтатьямФОТ();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "прямые_проект" Тогда
		Запрос.Текст = ТекстЗапроса_ПроектПоПрямымСтатьям();
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКоэффициенты = РезультатЗапроса.Выгрузить();
	
	ТаблицаКоэффициенты.Колонки.Добавить("Коэффициент");
	
	КолонкаСумма = ТаблицаКоэффициенты.ВыгрузитьКолонку("Сумма");
	мКоэффициенты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(1, КолонкаСумма, 7);
	
	Если НЕ мКоэффициенты = Неопределено Тогда
		ТаблицаКоэффициенты.ЗагрузитьКолонку(мКоэффициенты, "Коэффициент");
	КонецЕсли;
	
	Возврат ТаблицаКоэффициенты;
	
КонецФункции

Функция ПолучитьТаблицуРаспределенияПоПодразделениям(ДанныеОтбора, МассивПЗ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДанныеОтбора.ДатаНачало));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДанныеОтбора.ДатаКонец));
	Запрос.УстановитьПараметр("МассивПЗ", МассивПЗ);
	Запрос.УстановитьПараметр("ВидОбъема", ПредопределенноеЗначение("Перечисление.упоВидЭлементаОбъемов.Доход"));
	Запрос.УстановитьПараметр("ВидРасхода", ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход"));
	Запрос.УстановитьПараметр("УровеньПланирования", ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Предварительный"));	
	Запрос.УстановитьПараметр("НДС", Справочники.упоСобственныеСилыСубподряд.НДС);
	Запрос.УстановитьПараметр("ВидДохода", ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход"));
	
	Если НРег(ДанныеОтбора.Вид) = "часы_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоФактическимТрудозатратам();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "стоимость_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоСтоимостиФактическихТрудозатрат();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "соглчасы_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоСогласованнымЧасам();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "соглстоимость_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоСтоимостиСогласованныхЧасов();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "план_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоОбъемамПлан();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "факт_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоОбъемамФакт();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "планвыручка_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоВыручкеПлан();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "фактвыручка_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоВыручкеФакт();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "фот_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоСтатьямФОТ();
	ИначеЕсли НРег(ДанныеОтбора.Вид) = "прямые_подразделение" Тогда
		Запрос.Текст = ТекстЗапроса_ПодразделенияПоПрямымСтатьям();
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаКоэффициенты = РезультатЗапроса.Выгрузить();
	
	ТаблицаКоэффициенты.Колонки.Добавить("Коэффициент");
	
	КолонкаСумма = ТаблицаКоэффициенты.ВыгрузитьКолонку("Сумма");
	мКоэффициенты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(1, КолонкаСумма, 7);
	
	Если НЕ мКоэффициенты = Неопределено Тогда
		ТаблицаКоэффициенты.ЗагрузитьКолонку(мКоэффициенты, "Коэффициент");
	КонецЕсли;
	
	Возврат ТаблицаКоэффициенты;
	
КонецФункции

Функция ТекстЗапроса_ПроектПоОбъемамПлан()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления, МЕСЯЦ) КАК Период,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Регистратор КАК Регистратор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема КАК ВидОбъема,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение КАК Подразделение,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль КАК Роль,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СпособПривязки КАК СпособПривязки,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма КАК Сумма,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_План
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
	|			,
	|			ДатаНачисления > ДАТАВРЕМЯ(1, 1, 1)
	|				И ДатаНачисления >= &НачалоПериода
	|				И ВЫБОР
	|					КОГДА &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДатаНачисления <= &КонецПериода
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная > 0
	|			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_План.Сумма) КАК Сумма,
	|	ВТ_План.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_План КАК ВТ_План
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_План.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоОбъемамФакт()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактВыполненияОбъемовОборотыОбороты.ПериодМесяц КАК Период,
	|	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактВыполненияОбъемовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактВыполненияОбъемовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			ВидОбъема = &ВидОбъема
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоФактВыполненияОбъемовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоВыручкеПлан()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления, МЕСЯЦ) КАК Период,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Регистратор КАК Регистратор,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма КАК Сумма,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_План
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	|			,
	|			ДатаНачисления > ДАТАВРЕМЯ(1, 1, 1)
	|				И ДатаНачисления >= &НачалоПериода
	|				И ВЫБОР
	|					КОГДА &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДатаНачисления <= &КонецПериода
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ СобствСилы_Субподряд = &НДС
	|				И ВидЭлемента = &ВидДохода) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_План.Сумма) КАК Сумма,
	|	ВТ_План.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_План КАК ВТ_План
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_План.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоВыручкеФакт()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактДоходовИРасходовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			ВидЭлемента = &ВидДохода
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоФактДоходовИРасходовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоФактическимТрудозатратам()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактТрудозатратПоДням.Подразделение КАК Подразделение,
	|	упоФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
	|	упоФактТрудозатратПоДням.Трудозатраты КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактТрудозатратПоДням.Операция = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	упоФактТрудозатратПоДням.День МЕЖДУ &НачалоПериода И &КонецПериода
	|	И упоФактТрудозатратПоДням.УровеньПланирования = &УровеньПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоСтоимостиФактическихТрудозатрат()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактТрудозатратПоДням.Подразделение КАК Подразделение,
	|	упоФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
	|	упоФактТрудозатратПоДням.Стоимость КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактТрудозатратПоДням.Операция = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	упоФактТрудозатратПоДням.День МЕЖДУ &НачалоПериода И &КонецПериода
	|	И упоФактТрудозатратПоДням.УровеньПланирования = &УровеньПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоСогласованнымЧасам()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСогласованныеТрудозатратыОбороты.Подразделение КАК Подразделение,
	|	упоСогласованныеТрудозатратыОбороты.СогласованныеЧасыОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоСогласованныеТрудозатраты.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК упоСогласованныеТрудозатратыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоСтоимостиСогласованныхЧасов()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСогласованныеТрудозатратыОбороты.Подразделение КАК Подразделение,
	|	упоСогласованныеТрудозатратыОбороты.СтоимостьОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоСогласованныеТрудозатраты.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК упоСогласованныеТрудозатратыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоСтатьямФОТ()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСтатьиФОТ.Статья КАК Статья
	|ПОМЕСТИТЬ ВТ_СтатьиФОТ
	|ИЗ
	|	РегистрСведений.упоСтатьиФОТ КАК упоСтатьиФОТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактДоходовИРасходовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ВидЭлемента = &ВидРасхода
	|				И Статья В
	|					(ВЫБРАТЬ
	|						ВТ_СтатьиФОТ.Статья
	|					ИЗ
	|						ВТ_СтатьиФОТ КАК ВТ_СтатьиФОТ)) КАК упоФактДоходовИРасходовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоПрямымСтатьям()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСтатьиПрямыхРасходов.Статья КАК Статья
	|ПОМЕСТИТЬ ВТ_ПрямыеСтатьи
	|ИЗ
	|	РегистрСведений.упоСтатьиПрямыхРасходов КАК упоСтатьиПрямыхРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактДоходовИРасходовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ВидЭлемента = &ВидРасхода
	|				И Статья В
	|					(ВЫБРАТЬ
	|						ВТ_ПрямыеСтатьи.Статья
	|					ИЗ
	|						ВТ_ПрямыеСтатьи КАК ВТ_ПрямыеСтатьи)
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоФактДоходовИРасходовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПроектПоУказаннымСтатьям()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача.Проект В (&МассивПроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактДоходовИРасходовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ВидЭлемента = &ВидРасхода
	|				И Статья В (&СтатьиЗатрат)
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоФактДоходовИРасходовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоОбъемамПлан()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления, МЕСЯЦ) КАК Период,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Регистратор КАК Регистратор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема КАК ВидОбъема,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение КАК Подразделение,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль КАК Роль,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СпособПривязки КАК СпособПривязки,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма КАК Сумма,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_План
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(
	|			,
	|			ДатаНачисления > ДАТАВРЕМЯ(1, 1, 1)
	|				И ДатаНачисления >= &НачалоПериода
	|				И ВЫБОР
	|					КОГДА &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДатаНачисления <= &КонецПериода
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная > 0
	|			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_План.Сумма) КАК Сумма,
	|	ВТ_План.Подразделение КАК Подразделение,
	|	ВТ_План.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_План КАК ВТ_План
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_План.Подразделение,
	|	ВТ_План.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоОбъемамФакт()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактВыполненияОбъемовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактВыполненияОбъемовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			ВидОбъема = &ВидОбъема
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоФактВыполненияОбъемовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоВыручкеПлан()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления, МЕСЯЦ) КАК Период,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Регистратор КАК Регистратор,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сумма КАК Сумма,
	|	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_План
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	|			,
	|			ДатаНачисления > ДАТАВРЕМЯ(1, 1, 1)
	|				И ДатаНачисления >= &НачалоПериода
	|				И ВЫБОР
	|					КОГДА &КонецПериода <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДатаНачисления <= &КонецПериода
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И НЕ СобствСилы_Субподряд = &НДС
	|				И ВидЭлемента = &ВидДохода) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	(упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СуммаВалютная > 0
	|			ИЛИ упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Количество > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_План.Сумма) КАК Сумма,
	|	ВТ_План.Подразделение КАК Подразделение,
	|	ВТ_План.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_План КАК ВТ_План
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_План.Подразделение,
	|	ВТ_План.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоВыручкеФакт()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактДоходовИРасходовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			ВидЭлемента = &ВидДохода
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоФактДоходовИРасходовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоФактическимТрудозатратам()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактТрудозатратПоДням.Подразделение КАК Подразделение,
	|	упоФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
	|	упоФактТрудозатратПоДням.Трудозатраты КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактТрудозатратПоДням.Операция = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	упоФактТрудозатратПоДням.День МЕЖДУ &НачалоПериода И &КонецПериода
	|	И упоФактТрудозатратПоДням.УровеньПланирования = &УровеньПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача,
	|	ВТ_Факт.Подразделение";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоСтоимостиФактическихТрудозатрат()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактТрудозатратПоДням.Подразделение КАК Подразделение,
	|	упоФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
	|	упоФактТрудозатратПоДням.Стоимость КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактТрудозатратПоДням.Операция = ПЗы.ПроектнаяЗадача
	|ГДЕ
	|	упоФактТрудозатратПоДням.День МЕЖДУ &НачалоПериода И &КонецПериода
	|	И упоФактТрудозатратПоДням.УровеньПланирования = &УровеньПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.ПроектнаяЗадача,
	|	ВТ_Факт.Подразделение";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоСогласованнымЧасам()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСогласованныеТрудозатратыОбороты.Подразделение КАК Подразделение,
	|	упоСогласованныеТрудозатратыОбороты.СогласованныеЧасыОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоСогласованныеТрудозатраты.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК упоСогласованныеТрудозатратыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоСтоимостиСогласованныхЧасов()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСогласованныеТрудозатратыОбороты.Подразделение КАК Подразделение,
	|	упоСогласованныеТрудозатратыОбороты.СтоимостьОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоСогласованныеТрудозатраты.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК упоСогласованныеТрудозатратыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоСогласованныеТрудозатратыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоСтатьямФОТ()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСтатьиФОТ.Статья КАК Статья
	|ПОМЕСТИТЬ ВТ_СтатьиФОТ
	|ИЗ
	|	РегистрСведений.упоСтатьиФОТ КАК упоСтатьиФОТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактДоходовИРасходовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ВидЭлемента = &ВидРасхода
	|				И Статья В
	|					(ВЫБРАТЬ
	|						ВТ_СтатьиФОТ.Статья
	|					ИЗ
	|						ВТ_СтатьиФОТ КАК ВТ_СтатьиФОТ)) КАК упоФактДоходовИРасходовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция ТекстЗапроса_ПодразделенияПоПрямымСтатьям()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСтатьиПрямыхРасходов.Статья КАК Статья
	|ПОМЕСТИТЬ ВТ_ПрямыеСтатьи
	|ИЗ
	|	РегистрСведений.упоСтатьиПрямыхРасходов КАК упоСтатьиПрямыхРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПЗы
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоФактДоходовИРасходовОборотыОбороты.Подразделение КАК Подразделение,
	|	упоФактДоходовИРасходовОборотыОбороты.СуммаОборот КАК Сумма
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	РегистрНакопления.упоФактДоходовИРасходовОбороты.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ВидЭлемента = &ВидРасхода
	|				И Статья В
	|					(ВЫБРАТЬ
	|						ВТ_ПрямыеСтатьи.Статья
	|					ИЗ
	|						ВТ_ПрямыеСтатьи КАК ВТ_ПрямыеСтатьи)
	|				И НЕ СобствСилы_Субподряд = &НДС) КАК упоФактДоходовИРасходовОборотыОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПЗы КАК ПЗы
	|		ПО упоФактДоходовИРасходовОборотыОбороты.ПроектнаяЗадача = ПЗы.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Факт.Сумма) КАК Сумма,
	|	ВТ_Факт.Подразделение КАК Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ИЗ
	|	ВТ_Факт КАК ВТ_Факт
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Факт.Подразделение,
	|	ВТ_Факт.ПроектнаяЗадача";
	
КонецФункции

Функция СпособыПоПроектамДляДокумента()

	ПеречислениеМенеджер = Перечисления.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности;
	
	МассивСпособов = Новый Массив;
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоУказаннымСтатьям);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоКоэффициентам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовПлан);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовФакт);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоТрудозатратам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСогласованнымЧасам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтатьямФОТ);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоПрямымСтатьямPM);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтоимостиСогласованныхЧасов);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтоимостиФактическихЧасов);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоВыручкеПлан);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоВыручкеФакт);

	Возврат МассивСпособов;

КонецФункции

Функция СпособыПоПодразделениямДляДокумента()

	ПеречислениеМенеджер = Перечисления.упоВидРаспределенияОПРиОХРпоПодразделениям;
	
	МассивСпособов = Новый Массив;
	МассивСпособов.Добавить(ПеречислениеМенеджер.НеРаспределять);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоКоэффициентам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовПлан);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовФакт);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоТрудозатратам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСогласованнымЧасам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтатьямФОТ);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоПрямымСтатьямPM);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтоимостиФактическихЧасов);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтоимостиСогласованныхЧасов);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоВыручкеПлан);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоВыручкеФакт);

	Возврат МассивСпособов;

КонецФункции

Функция СпособыПоПроектамДляОбработки()

	ПеречислениеМенеджер = Перечисления.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности;
	
	МассивСпособов = Новый Массив;
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоПрямымРасходам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоУказаннымСтатьям);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоКоэффициентам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовПлан);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовФакт);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоТрудозатратам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтатьямФОТ);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоПрямымСтатьямPM);

	Возврат МассивСпособов;

КонецФункции

Функция СпособыПоПодразделениямДляОбработки()

	ПеречислениеМенеджер = Перечисления.упоВидРаспределенияОПРиОХРпоПодразделениям;
	
	МассивСпособов = Новый Массив;
	МассивСпособов.Добавить(ПеречислениеМенеджер.НеРаспределять);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоПрямым);
	МассивСпособов.Добавить(ПеречислениеМенеджер.НаУказанныеПодразделения);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоКоэффициентам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовПлан);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоРаспределениюОбъемовФакт);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоТрудозатратам);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоСтатьямФОТ);
	МассивСпособов.Добавить(ПеречислениеМенеджер.ПоПрямымСтатьямPM);

	Возврат МассивСпособов;

КонецФункции

Процедура ДобавитьВМассив(Массив, Значение)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;	
	
	Поиск = Массив.Найти(Значение);
	Если Поиск = Неопределено Тогда
		Массив.Добавить(Значение);
	КонецЕсли;
		
КонецПроцедуры		
	
#КонецОбласти