////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с отправкой сообщений по e-mail.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает информацию по версии модуля.
// 
// Возвращаемое значение:
//  Структура
//
Функция Информация() Экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("ИмяМодуля", НСтр("ru = 'Модуль транспорта подсистемы оповещений для отправки электронной почты'"));
	Ответ.Вставить("ВерсияМодуля", "2.0");
	
	Возврат Ответ;
	
КонецФункции 

// Отправляет сообщение.
//
// Параметры:
//  ПарОтправки	 - Структура
// 
// Возвращаемое значение:
//  Строка - идентификатор отправленного сообщения. См. РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение
//
Функция ОтправитьСообщение(ПарОтправки) Экспорт
	
	масПараметры = Новый Массив;
	масПараметры.Добавить("Кому");
	масПараметры.Добавить("Копии");
	масПараметры.Добавить("СлепыеКопии");
	масПараметры.Добавить("Тема");
	масПараметры.Добавить("Тело");
	масПараметры.Добавить("Важность");
	масПараметры.Добавить("Вложения");
	масПараметры.Добавить("АдресОтвета");
	масПараметры.Добавить("Пароль");
	масПараметры.Добавить("ИдентификаторыОснований");
	масПараметры.Добавить("ОбрабатыватьТексты");
	масПараметры.Добавить("УведомитьОДоставке");
	масПараметры.Добавить("УведомитьОПрочтении");
	масПараметры.Добавить("ТипТекста");
	
	УчетнаяЗапись = ПарОтправки.УчетнаяЗапись;
	ПараметрыПисьма = Новый Структура;
	
	Для Каждого Эл Из масПараметры Цикл
		
		текЗн = Неопределено;
		ПарОтправки.Свойство(Эл,текЗн);
		Если Эл = "Тема" И Не ЗначениеЗаполнено(текЗн) Тогда
			текЗн = "<без темы>";
		ИначеЕсли Эл = "ТипТекста" Тогда
			Если текЗн = "HTML" Тогда
				текЗн = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			Иначе
				текЗн = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(текЗн) Тогда
			ДобавитьПараметрВСтруктуру(ПараметрыПисьма, Эл, текЗн);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
	
КонецФункции

// Получает настройки транспорта.
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьНастройкиТранспорта() Экспорт
	
	Рез = Новый Структура;
	Рез.Вставить("ДоступнаТемаСообщения", Истина);
	Рез.Вставить("ДоступенТекстСообщенияВHTML", Истина);
	Рез.Вставить("ДоступнаНастройкаДляВидаСобытия", Ложь);
	
	ПарТраспорта = Новый Структура;
	ПарТраспорта.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты);
	
	Рез.Вставить("ПараметрыТранспорта", ПарТраспорта);
	
	Возврат Рез;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПараметрВСтруктуру(стрПараметры, ИмяПараметра, ЗначениеПараметра)
	
	стрПараметры.Вставить(ИмяПараметра, ЗначениеПараметра);
	
КонецПроцедуры

#КонецОбласти