////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для печати диаграммы Ганта.
////////////////////////////////////////////////////////////////////////////////
         
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Установить признак отображения текста точек
//
// Параметры:
//  Диаграмма	 - ДиаграммаГанта - диаграмма ганта, в области построения которой
// 									необходимо установить признак отображения текста точек
//
Процедура УстановитьПризнакОтображенияТекстаТочек(Диаграмма) Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсияПриложения = СистемнаяИнформация.ВерсияПриложения;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.21.0", ТекущаяВерсияПриложения) <= 0 Тогда
		// Свойство существует только на платформе 8.3.21 и выше.
		// Используем "Вычислить" для поддержки работоспособности в платформах ниже версии 8.3.21.
		Диаграмма.ОбластьПостроения.ОтображатьТекстТочек = Вычислить("ОтображениеВДиаграммеГанта.Отображать");
	КонецЕсли; 
	
КонецПроцедуры  

#КонецОбласти 

