
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка);           
	
	Параметры.Свойство("ТаблицаПолучателя",ТаблицаПолучателя);
	Параметры.Свойство("ВариантХраненияПоляАдреса",ВариантХраненияПоляАдреса);
	Параметры.Свойство("УИстроки",УИстроки);
	Параметры.Свойство("ОписаниеХраненияАдреса",ОписаниеХраненияАдреса);
	
	Параметры.Свойство("ИмяТаблицы",ИмяТаблицы);
	Параметры.Свойство("ПолеСвязи",ПолеСвязи);
	Параметры.Свойство("ПолеАдреса",ПолеАдреса);
	Параметры.Свойство("ПолеУсловия",ПолеУсловия);
	
	Параметры.Свойство("ИмяТаблицыКонтЛицо",ИмяТаблицыКонтЛицо);
	Параметры.Свойство("ПолеСвязиКонтЛицо",ПолеСвязиКонтЛицо);
	Параметры.Свойство("ПолеУсловияКонтЛицо",ПолеУсловияКонтЛицо);
	
	Если ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВКонтИнформацииКонтЛицаПолучателя Тогда
		
		Если ЗначениеЗаполнено(ПолеУсловияКонтЛицо) Тогда
			ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ИмяТаблицыКонтЛицо,ПолеУсловияКонтЛицо);
			Если ОписаниеТипаРеквизита <> Неопределено Тогда
				Элементы.ЗначениеУсловияКонтЛицо.ОграничениеТипа = ОписаниеТипаРеквизита;
			КонецЕсли;
			Параметры.Свойство("ЗначениеУсловияКонтЛицо",ЗначениеУсловияКонтЛицо);
		КонецЕсли;
		
		ЗаполнитьТаблицыКонтЛицо(ТаблицаПолучателя);
		Если ЗначениеЗаполнено(ИмяТаблицыКонтЛицо) Тогда
			ЗаполнитьТаблицыКонтИнфо(ИмяТаблицыКонтЛицо);
			ЗаполнитьСпискиВыбораКонтЛицо();
			ПредставлениеТаблицыКонтЛицо = упоОповещенияВызовСервера.ПолучитьПредставлениеТаблицы(ИмяТаблицыКонтЛицо);
		КонецЕсли;
		
	ИначеЕсли ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВКонтИнформацииПолучателя Тогда
		
		Элементы.ГруппаТаблКонтЛицо.Видимость = Ложь;
		ЗаполнитьТаблицыКонтИнфо(ТаблицаПолучателя);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеУсловия) Тогда
		ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ИмяТаблицы,ПолеУсловия);
		Если ОписаниеТипаРеквизита <> Неопределено Тогда
			Элементы.ЗначениеУсловия.ОграничениеТипа = ОписаниеТипаРеквизита;
		КонецЕсли;
		Параметры.Свойство("ЗначениеУсловия",ЗначениеУсловия);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ЗаполнитьСпискиВыбора();
		ПредставлениеТаблицы = упоОповещенияВызовСервера.ПолучитьПредставлениеТаблицы(ИмяТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаВыборТаблицыМетаданных" Тогда
		
		Если ВыбранноеЗначение.УИстроки = 1 Тогда
			ИмяТаблицы = ВыбранноеЗначение.ИмяТаблицы;
			ПредставлениеТаблицы = ВыбранноеЗначение.ПредставлениеТаблицы;
			ЗаполнитьСпискиВыбора();
		ИначеЕсли ВыбранноеЗначение.УИстроки = 2 Тогда
			
			ПредставлениеТаблицы = "";
			ИмяТаблицы = "";
			ПолеСвязи = "";
			ПолеУсловия = "";
			ЗначениеУсловия = Неопределено;
			ПолеАдреса = "";
			
			ИмяТаблицыКонтЛицо = ВыбранноеЗначение.ИмяТаблицы;
			ПредставлениеТаблицыКонтЛицо = ВыбранноеЗначение.ПредставлениеТаблицы;
			ЗаполнитьСпискиВыбораКонтЛицо();
			
			ЗаполнитьТаблицыКонтИнфо(ИмяТаблицыКонтЛицо);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);          
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);          
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);     
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);     
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
	П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеТаблицыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Пар = Новый Структура("ИмяТаблицы, УИСтроки", ИмяТаблицы, 1);
	
	масНужныеТипы = Новый Массив;
	масНужныеТипы.Добавить("Справочники");
	масНужныеТипы.Добавить("ПланыВидовХарактеристик");
	масНужныеТипы.Добавить("Документы");
	масНужныеТипы.Добавить("РегистрыСведений");
	Пар.Вставить("масНужныеТипы", масНужныеТипы);
	
	масНужныеТаблицы = Новый Массив;
	Для Каждого СтрТз Из ТаблицыКонтИнфо Цикл
		масНужныеТаблицы.Добавить(СтрТз.ИмяТаблицы);	
	КонецЦикла;
	Пар.Вставить("масНужныеТаблицы", масНужныеТаблицы);
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаВыборТаблицыМетаданных", Пар, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТаблицыКонтЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Пар = Новый Структура("ИмяТаблицы, УИСтроки", ИмяТаблицыКонтЛицо, 2);
	
	масНужныеТипы = Новый Массив;
	масНужныеТипы.Добавить("Справочники");
	масНужныеТипы.Добавить("Документы");
	масНужныеТипы.Добавить("ПланыВидовХарактеристик");
	Пар.Вставить("масНужныеТипы", масНужныеТипы);
	
	масНужныеТаблицы = Новый Массив;
	Для Каждого СтрТз Из ТаблицыКонтЛицо Цикл
		масНужныеТаблицы.Добавить(СтрТз.ИмяТаблицы);	
	КонецЦикла;
	Пар.Вставить("масНужныеТаблицы", масНужныеТаблицы);
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаВыборТаблицыМетаданных", Пар, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеУсловияПриИзменении(Элемент)
	
	ОписаниеТипаРеквизита = Неопределено;
	
	Если ЗначениеЗаполнено(ПолеУсловия) Тогда
		ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ИмяТаблицы,ПолеУсловия);
	КонецЕсли;
	
	Если ОписаниеТипаРеквизита <> Неопределено Тогда
		Элементы.ЗначениеУсловия.ОграничениеТипа = ОписаниеТипаРеквизита;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеУсловияКонтЛицоПриИзменении(Элемент)
	
	ОписаниеТипаРеквизита = Неопределено;
	
	Если ЗначениеЗаполнено(ПолеУсловияКонтЛицо) Тогда
		ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ИмяТаблицыКонтЛицо,ПолеУсловияКонтЛицо);
	КонецЕсли;
	
	Если ОписаниеТипаРеквизита <> Неопределено Тогда
		Элементы.ЗначениеУсловияКонтЛицо.ОграничениеТипа = ОписаниеТипаРеквизита;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьИЗакрыть(Команда)
	
	Пар = Новый Структура("ПолеАдреса,УИстроки,ИмяТаблицы,ПолеСвязи,ПолеУсловия,ЗначениеУсловия,
	|ИмяТаблицыКонтЛицо,ПолеСвязиКонтЛицо,ПолеУсловияКонтЛицо,ЗначениеУсловияКонтЛицо,ОписаниеХраненияАдреса");
	ЗаполнитьЗначенияСвойств(Пар,ЭтаФорма);
	
	Если ВариантХраненияПоляАдреса = ПредопределенноеЗначение("Перечисление.упоВариантыХраненияПоляАдреса.ВКонтИнформацииКонтЛицаПолучателя") Тогда
		Пар.Вставить("ПредставлениеПоляАдреса",ПредставлениеТаблицыКонтЛицо + "(" + ПредставлениеТаблицы + "." + ПолеАдреса+")");	
	Иначе
		Пар.Вставить("ПредставлениеПоляАдреса",ПредставлениеТаблицы + "." + ПолеАдреса);
	КонецЕсли;
	
	ОповеститьОВыборе(Пар);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицыКонтИнфо(ИмяВедущейТаблицы)
	
	// получим список таблиц, в которых может хранится конт. информация
	ТаблицыКонтИнфо.Очистить();
	
	масТаблицыКонтИнфо = упоОповещенияВызовСервера.ПолучитьТаблицыКонтИнфо(ИмяВедущейТаблицы);
	Для Каждого Эл Из масТаблицыКонтИнфо Цикл
		новстр = ТаблицыКонтИнфо.Добавить();
		ЗаполнитьЗначенияСвойств(новстр,Эл);
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицыКонтЛицо(ИмяВедущейТаблицы)
	
	// получим список таблиц, в которых могут хранится конт. лица
	ТаблицыКонтЛицо.Очистить();
	
	масТаблицыКонтЛицо = упоОповещенияВызовСервера.ПолучитьТаблицыКонтЛицо(ИмяВедущейТаблицы);
	Для Каждого Эл Из масТаблицыКонтЛицо Цикл
		новстр = ТаблицыКонтЛицо.Добавить();
		ЗаполнитьЗначенияСвойств(новстр,Эл);
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	ЗаполнитьСписокВыбораПоляСвязи();
	ЗаполнитьСписокВыбораПоляУсловия();
	ЗаполнитьСписокВыбораПоляАдреса();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоляСвязи()
	
	Если ВариантХраненияПоляАдреса = Перечисления.упоВариантыХраненияПоляАдреса.ВКонтИнформацииКонтЛицаПолучателя Тогда
		Элементы.ПолеСвязи.Заголовок = "Поле связи с таблицей """ + ИмяТаблицыКонтЛицо + """";	
	Иначе
		Элементы.ПолеСвязи.Заголовок = "Поле связи с таблицей """ + ТаблицаПолучателя + """";
	КонецЕсли;
	
	Элементы.ПолеСвязи.СписокВыбора.Очистить();
	
	Для Каждого СтрТз Из ТаблицыКонтИнфо Цикл
		Если СтрТз.ИмяТаблицы = ИмяТаблицы И СтрТз.ЭтоПолеСвязи Тогда
			Элементы.ПолеСвязи.СписокВыбора.Добавить(СтрТз.ИмяРеквизита,СтрТз.ИмяРеквизитаПредставление);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоляУсловия()
	
	Элементы.ПолеУсловия.СписокВыбора.Очистить();
	
	СписРеквизитов = упоОповещенияВызовСервера.ПолучитьСписокРеквизитовДляОповещений(ИмяТаблицы);
	
	Для Каждого Эл Из СписРеквизитов Цикл
		Элементы.ПолеУсловия.СписокВыбора.Добавить(Эл.Имя,Эл.Представление);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоляАдреса()
	
	Элементы.ПолеАдреса.СписокВыбора.Очистить();
	
	СписРеквизитов = упоОповещенияВызовСервера.ПолучитьСписокВозможныхРеквизитовДляХраненияАдресов(ИмяТаблицы);
	
	Для Каждого Эл Из СписРеквизитов Цикл
		Элементы.ПолеАдреса.СписокВыбора.Добавить(Эл.Значение,Эл.Представление);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораКонтЛицо()
	ЗаполнитьСписокВыбораПоляСвязиКонтЛицо();
	ЗаполнитьСписокВыбораПоляУсловияКонтЛицо();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоляСвязиКонтЛицо()
	
	Элементы.ПолеСвязиКонтЛицо.Заголовок = НСтр("ru = 'Поле связи с таблицей'") + " """ + ТаблицаПолучателя + """";
	Элементы.ПолеСвязиКонтЛицо.СписокВыбора.Очистить();
	
	Для Каждого СтрТз Из ТаблицыКонтЛицо Цикл
		Если СтрТз.ИмяТаблицы = ИмяТаблицыКонтЛицо И СтрТз.ЭтоПолеСвязи Тогда
			Элементы.ПолеСвязиКонтЛицо.СписокВыбора.Добавить(СтрТз.ИмяРеквизита,СтрТз.ИмяРеквизитаПредставление);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоляУсловияКонтЛицо()
	
	Элементы.ПолеУсловияКонтЛицо.СписокВыбора.Очистить();
	
	СписРеквизитов = упоОповещенияВызовСервера.ПолучитьСписокРеквизитовДляОповещений(ИмяТаблицыКонтЛицо);
	
	Для Каждого Эл Из СписРеквизитов Цикл
		Элементы.ПолеУсловияКонтЛицо.СписокВыбора.Добавить(Эл.Имя,Эл.Представление);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
