
&ИзменениеИКонтроль("ВыполнитьВБезопасномРежиме")
Процедура Расш1_ВыполнитьВБезопасномРежиме(Алгоритм, Параметры)

	ПроверитьАлгоритмНаЗапрещенныеВыражения(Алгоритм);

	// BSLLS:PairingBrokenTransaction-off
	// Проектное решение. Методы НачатьТранзакцию / ОтменитьТранзакцию используются для предотвращения
	// несанкционированных действий с БД из выражения на встроенном языке.

	НачатьТранзакцию();

	Попытка
		ОбщегоНазначения.ВыполнитьВБезопасномРежиме(Алгоритм, Параметры);
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	#Вставка
	Если Найти(Алгоритм, "БезРеж = ложь;") Тогда
		ЗафиксироватьТранзакцию();
		Возврат;
	КонецЕсли;
	#КонецВставки

	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли;

	// BSLLS:PairingBrokenTransaction-on

КонецПроцедуры

&ИзменениеИКонтроль("ПараметрыПереносаФайловВДО")
Функция Расш1_ПараметрыПереносаФайловВДО(ДанныеСвязи, ПрисоединенныеФайлыВИС, ТипСправочникаСФайлами, ПредставлениеТипаВладельца)

	ПараметрыПереносаФайлов = Новый Структура;
	ПараметрыПереносаФайлов.Вставить("НужноЗадатьВопросОПереносеФайловВДО", Ложь);
	ПараметрыПереносаФайлов.Вставить("СостояниеРазрешаетДобавлениеФайла", Истина);
	ПараметрыПереносаФайлов.Вставить("СостояниеРазрешаетДобавлениеСканКопии", Истина);
	ПараметрыПереносаФайлов.Вставить("ПрисоединенныеФайлыВИС", ПрисоединенныеФайлыВИС);
	ПараметрыПереносаФайлов.Вставить("ВладелецID", ДанныеСвязи.ID);
	ПараметрыПереносаФайлов.Вставить("ВладелецТип", ДанныеСвязи.Тип);
	ПараметрыПереносаФайлов.Вставить("ВладелецИС", ДанныеСвязи.Объект);
	ПараметрыПереносаФайлов.Вставить("ТипСправочникаСФайлами", ТипСправочникаСФайлами);
	ПараметрыПереносаФайлов.Вставить("ПредставлениеТипаВладельца", ПредставлениеТипаВладельца);
	ПараметрыПереносаФайлов.Вставить("СокращенноеНаименованиеКонфигурации", СокращенноеНаименованиеКонфигурации());

	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	Если Не Настройки.ИспользоватьИнтеграциюДО3 Тогда
		// Функционал переноса файлов реализован только в интеграции с ДО 3.
		Возврат ПараметрыПереносаФайлов;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеСвязи.Объект)
		И (ТипСправочникаСФайлами = "Неопределено" Или ПредставлениеТипаВладельца = "объекта") Тогда
		ВладелецМетаданные = ДанныеСвязи.Объект.Метаданные();
		ПараметрыПереносаФайлов.ТипСправочникаСФайлами = ВладелецМетаданные.ПолноеИмя();
		ТипОбъектаМассив = СтрРазделить(ПараметрыПереносаФайлов.ТипСправочникаСФайлами, ".");
		Если ТипОбъектаМассив[0] = "Справочник" Тогда
			ПараметрыПереносаФайлов.ПредставлениеТипаВладельца = "справочника";
		ИначеЕсли ТипОбъектаМассив[0] = "Документ" Тогда
			ПараметрыПереносаФайлов.ПредставлениеТипаВладельца = "документа";
		КонецЕсли;
	КонецЕсли;

	НастройкаЗадаватьВопросОПереносеФайловВДО =
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.НастройкаЗадаватьВопросОПереносеФайловВДО(
	ПараметрыПереносаФайлов.ТипСправочникаСФайлами);
	Если НастройкаЗадаватьВопросОПереносеФайловВДО = Ложь Тогда
		// Персональная настройка пользователя.
		Возврат ПараметрыПереносаФайлов;
	КонецЕсли;

	Если Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьПрисоединенныеФайлы1СДокументооборотаДляОбъекта(
		ДанныеСвязи.Объект) Тогда
		// Функционал хранения файлов в ДО не используется.
		Возврат ПараметрыПереносаФайлов;
	КонецЕсли;

	ВсеПрисоединенныеФайлыВИС = ПрисоединенныеФайлыВИС(ДанныеСвязи.Объект);
	#Удаление
	Если ВсеПрисоединенныеФайлыВИС.Количество() = 0 Тогда
	#КонецУдаления
	#Вставка
	//{[*] ИКТ №20078 (фрагмент ИЗМЕНЕН), Новоселов, 31.07.2026 У Заданий файлы копируются обратно в базу и 1С может потребовать их перенести в ДО, что приведет к ошибке
	Если ВсеПрисоединенныеФайлыВИС.Количество() = 0
			Или ТипЗнч(ДанныеСвязи.Объект) = Тип("СправочникСсылка.упоЗадания") Тогда
	//[*]} ИКТ №20078
	#КонецВставки
		// Файлы для переноса в ДО отсутствуют.
		Возврат ПараметрыПереносаФайлов;
	КонецЕсли;

	Если ПараметрыПереносаФайлов.ПрисоединенныеФайлыВИС = Неопределено Тогда
		СписокФайловДО = Новый Массив;
		Если ЗначениеЗаполнено(ДанныеСвязи.ID) Тогда
			Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
			ОбъектXDTO = ПолучитьОбъект(
			Прокси,
			ДанныеСвязи.Тип,
			ДанныеСвязи.ID,
			"files,enabledProperties");
			ЗаполнитьНДПСизОбъектаXDTO(ПараметрыПереносаФайлов, ОбъектXDTO);
			Если СвойствоУстановлено(ОбъектXDTO, "files") Тогда
				СписокФайловДО = ОбъектXDTO.files;
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьНеПеренесенныеВДОПрисоединенныеФайлыВИС(
		ПараметрыПереносаФайлов.ПрисоединенныеФайлыВИС,
		ВсеПрисоединенныеФайлыВИС,
		СписокФайловДО);
	КонецЕсли;

	ПараметрыПереносаФайлов.НужноЗадатьВопросОПереносеФайловВДО =
	(ПараметрыПереносаФайлов.ПрисоединенныеФайлыВИС.Количество() > 0);

	Возврат ПараметрыПереносаФайлов;

КонецФункции
