
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует таблицу данных для операции "Заполнить".
//
// Параметры:
//  Объект				 - ДокументСсылка.упоНазначениеТрудовыхРесурсовНаПроект - ссылка на документ-источник.
//  ИмяТабличнойЧасти 	 - Строка - содержит имя табличной части объекта,
//                      	если параметр не указан, то структура формируется по шапке объекта.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными для заполнения.
//
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект, ИмяТабличнойЧасти) Экспорт
	
	// Формируем запрос
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект));
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.Ресурс КАК Ресурс,
		|	Рег.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Рег.Ресурс.Представление КАК РесурсПредставление
		|ПОМЕСТИТЬ ВсеРесурсыПроекта
		|ИЗ
		|	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
		|			,
		|			Версия = &текВерсия
		|				И Проект = &Проект) КАК Рег
		|ГДЕ
		|	Рег.РесурсВыделен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеРесурсыПроекта.Ресурс КАК Ресурс,
		|	ВсеРесурсыПроекта.РесурсПредставление КАК РесурсПредставление
		|ИЗ
		|	ВсеРесурсыПроекта КАК ВсеРесурсыПроекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ПО ВсеРесурсыПроекта.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВсеРесурсыПроекта.Ресурс,
		|	ВсеРесурсыПроекта.РесурсПредставление
		|ИЗ
		|	ВсеРесурсыПроекта КАК ВсеРесурсыПроекта
		|ГДЕ
		|	ВсеРесурсыПроекта.ПроектнаяЗадача = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РесурсПредставление";
		
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
//  СтруктураПараметров - Структура - не используется.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти,
	СтруктураПараметров = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроект);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли