
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.упоОперативнаяЗагрузкаСпециалистов.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки.ТрудовойРесурс,
	               |	упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки.ПроектнаяЗадача,
	               |	упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки.ДатаВремя,
	               |	упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки.Роль,
	               |	упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки.Занят,
	               |	упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки.Ссылка.Дата КАК Период
	               |ИЗ
	               |	Документ.упоРегистрацияОперативнойЗагрузкиСпециалистов.ИзменениеЗагрузки КАК упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки
	               |ГДЕ
	               |	упоРегистрацияОперативнойЗагрузкиСпециалистовИзменениеЗагрузки.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);				   	
	Движения.упоОперативнаяЗагрузкаСпециалистов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли