
#Область СлужебныеПроцедурыИФункции

Процедура ВывестиОтчет(ДанныеОтчета, ДокументРезультат, Области)
		
		// {УПФ}
		// Вместо
		// Для каждого ОператорыЗапроса Из ПакетЗапроса.Операторы Цикл
		//	ОператорыЗапроса.ВыбираемыеПоля.Добавить(ИмяТаблицы + ИмяПоля);
		//	ОператорыЗапроса.Группировка.Добавить(ИмяТаблицы + ИмяПоля);
		// КонецЦикла;
		// Конец Вместо
		
		// Заглушка. После объединения удалить.
		ИмяПоля = "";
		ПолеПроект = "";
		ИмяТаблицы = "";
		ПакетЗапроса = Неопределено;
		// Конец заглушки
		
		упоБылоИзмененияИмениПоля = Ложь;
		Если ИмяПоля = ПолеПроект Тогда
			упоБылоИзмененияИмениПоля = Истина;
			упоДобавляемоеПоле = 
			"	ВЫБОР
			|		КОГДА ЕСТЬNULL(&1Проект.ЭтоПроектнаяЗадача, ЛОЖЬ) = ИСТИНА
			|			ТОГДА &1Проект.упоКорневойПроект
			|		ИНАЧЕ &1Проект
			|	КОНЕЦ";
			упоДобавляемоеПоле = СтрЗаменить(упоДобавляемоеПоле, "&1", ИмяТаблицы);
		Иначе
			упоДобавляемоеПоле = ИмяТаблицы + ИмяПоля;
		КонецЕсли;
		
		Для каждого ОператорыЗапроса Из ПакетЗапроса.Операторы Цикл
			ОператорыЗапроса.ВыбираемыеПоля.Добавить(упоДобавляемоеПоле);
			ОператорыЗапроса.Группировка.Добавить(упоДобавляемоеПоле);
		КонецЦикла;
		
		Если упоБылоИзмененияИмениПоля Тогда
			ИмяПоля = "Поле1";
		КонецЕсли;
		// {/УПФ}
			
КонецПроцедуры

#КонецОбласти
