

&ИзменениеИКонтроль("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)

	#Вставка
	//{[+](фрагмент ДОБАВЛЕН), Буцких, 20.02.2025 11:14:32    
	БылУстановленПривилегированныйРежим = Ложь;
	Если ОбщегоНазначения.ЕстьРоль("ИКТ_ДобавлениеИзменениеПользователейБезПолныхПрав") Тогда
		БылУстановленПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	//[+]} Буцких
	#КонецВставки
	// АПК:75-выкл проверка ОбменДанными.Загрузка должна быть после блокировки регистров.
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ПользователиСлужебный.ЗаблокироватьРегистрыПередЗаписьюВФайловойИБ(Ложь);
	КонецЕсли;
	// АПК:75-вкл

	// АПК:75-выкл проверка ОбменДанными.Загрузка должна быть после обработки пользователя ИБ, когда требуется.
	ПользователиСлужебный.ПользовательОбъектПередЗаписью(ЭтотОбъект, ПараметрыОбработкиПользователяИБ);
	// АПК:75-вкл

	#Вставка
	//{[+](фрагмент ДОБАВЛЕН), Буцких, 20.02.2025 11:14:32
	Если БылУстановленПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	//[+]} Буцких
	#КонецВставки
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЭтоНовый = ЭтоНовый();

КонецПроцедуры


&ИзменениеИКонтроль("ПриЗаписи")
Процедура Расш1_ПриЗаписи(Отказ)

	// АПК:75-выкл проверка ОбменДанными.Загрузка должна быть после обработки пользователя ИБ, когда требуется.
	Если ОбменДанными.Загрузка И ПараметрыОбработкиПользователяИБ <> Неопределено Тогда
		ПользователиСлужебный.ЗавершитьОбработкуПользователяИБ(
		ЭтотОбъект, ПараметрыОбработкиПользователяИБ);
	КонецЕсли;
	// АПК:75-вкл

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ГруппаНовогоПользователя")
		И ЗначениеЗаполнено(ДополнительныеСвойства.ГруппаНовогоПользователя) Тогда

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ГруппыПользователей");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДополнительныеСвойства.ГруппаНовогоПользователя);
		Блокировка.Заблокировать();

		ОбъектГруппы = ДополнительныеСвойства.ГруппаНовогоПользователя.ПолучитьОбъект(); // СправочникОбъект.ГруппыПользователей
		ОбъектГруппы.Состав.Добавить().Пользователь = Ссылка;
		ОбъектГруппы.Записать();
	КонецЕсли;

	// Обновление состава автоматической группы "Все пользователи".
	ИзмененияСоставов = ПользователиСлужебный.НовыеИзмененияСоставовГрупп();
	ПользователиСлужебный.ОбновитьИспользуемостьСоставовГруппПользователей(Ссылка, ИзмененияСоставов);
	ПользователиСлужебный.ОбновитьСоставГруппыВсеПользователи(Ссылка, ИзмененияСоставов);
	#Вставка
	//{[+](фрагмент ДОБАВЛЕН), Буцких, 20.02.2025 11:14:32
	Если ОбщегоНазначения.ЕстьРоль("ИКТ_ДобавлениеИзменениеПользователейБезПолныхПрав") Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	//[+]} Буцких
	#КонецВставки
	ПользователиСлужебный.ЗавершитьОбработкуПользователяИБ(ЭтотОбъект,
	ПараметрыОбработкиПользователяИБ);
	#Вставка
	//{[+](фрагмент ДОБАВЛЕН), Буцких, 20.02.2025 11:14:32
	Если ОбщегоНазначения.ЕстьРоль("ИКТ_ДобавлениеИзменениеПользователейБезПолныхПрав") Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	//[+]} Буцких
	#КонецВставки

	ПользователиСлужебный.ПослеОбновленияСоставовГруппПользователей(ИзмененияСоставов);

	ИнтеграцияПодсистемБСП.ПослеДобавленияИзмененияПользователяИлиГруппы(Ссылка, ЭтоНовый);

КонецПроцедуры

