////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с договорами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает представление документа Регистрация юридический условий договора
//
// Параметры:
//  Объект					 - Произвольный	 - не используется.
//  ИмяИзменяемогоРеквизита	 - Строка		 - имя реквизита
//
Процедура УстановитьПредставлениеДоговора(Объект, ИмяИзменяемогоРеквизита = Неопределено) Экспорт 
	
	ПравилоНаименованияДоговора = Объект.ВидДоговора.ПравилоФормированияНаименованияДоговора;
	Если Не ЗначениеЗаполнено(ПравилоНаименованияДоговора) Тогда 
		Возврат;
	КонецЕсли; 
	
	РеквизитЕстьВВыборке = Ложь;
	ПорядокФормированияНаименования = 
		упоУправлениеДоговорамиСервер.ПолучитьПорядокЗаполненияНаименованияДоговора(ПравилоНаименованияДоговора, 
			ИмяИзменяемогоРеквизита, РеквизитЕстьВВыборке);
	
	Объект.ПредставлениеДоговора = 
		упоУправлениеДоговорамиКлиентСервер.СформироватьНаименованияДоговора(Объект, ПорядокФормированияНаименования);
	
КонецПроцедуры

// Проверяет возможность проведения документа Регистрация юридический условий договора и дополнительных соглашений.
//
// Параметры:
//  Ссылка	 - Произвольный - не используется.
//  Отказ	 - Произвольный - не используется.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ПроверитьВозможностьПроведенияДокументаРЮУДиДопоСогл(Ссылка, Отказ) Экспорт
	
КонецФункции

// Проверяет данные для создания проектных задач.
//
// Параметры:
//  Объект	 - Произвольный - проверяемый объект.
//
// Возвращаемое значение:
//	Булево - признак отказа от создания.
//
Функция ПроверитьДанныеДляСозданияПроектныхЗадач(Объект) Экспорт
	
	Этапы = Объект.Этапы;
	ГрафикОплаты = Объект.ГрафикОплаты;
	Отказ = Ложь;
	Для Каждого Этап Из Этапы Цикл
		Если Этап.СтатьяДоходов.Пустая() Тогда 
			Отказ 				= Истина;
			Сообщение 			= Новый СообщениеПользователю();
			ТекстСообщения	 	= НСтр("ru = 'В строке %1 табличной части ""Этапы"" не заполнена статья доходов.'");
			Сообщение.Текст		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Этап.НомерСтроки); 	
			Сообщение.Поле 		= "Этап["+Этап.НомерСтроки +"].СтатьяДоходов";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Оплаты Из ГрафикОплаты Цикл
		
		Если Оплаты.Статья.Пустая() Тогда 
			Отказ 				= Истина;
			Сообщение 			= Новый СообщениеПользователю();
			ТекстСообщения		= НСтр("ru = 'В строке  %1 табличной части ""График оплаты"" не заполнена статья БДДС.'");
			Сообщение.Текст		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Оплаты.НомерСтроки);
			Сообщение.Поле 		= "Этап["+Оплаты.НомерСтроки +"].Статья";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

// Рассчитывает график платежей.
//
// Параметры:
//  Объект	 - Произвольный - объект, для которого надо рассчитать график платежей.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция РассчитатьГрафикПлатежей(Знач Объект) Экспорт
	
	Объект.ГрафикОплаты.Очистить();
	ГрафикОплаты = Объект.ГрафикОплаты;
	
	ДанныеПроекта = ПолучитьДатыНачалаИОкончанияПроекта(Объект);
	Этапы = Объект.ГрафикНачислений;
	
	Для Каждого Этап Из Этапы Цикл
		Если ЗначениеЗаполнено(Этап.Этап) Тогда
			ДанныеЭтапа = Объект.Этапы.НайтиСтроки(Новый Структура("Этап", Этап.Этап))[0];  		
			РассчитатьГрафикПлатежейВСтроке(Объект, ГрафикОплаты, ДанныеПроекта, ДанныеЭтапа, Этап); 
		ИначеЕсли ЗначениеЗаполнено(Этап.ИндексСвязиЭтапа) Тогда
			ДанныеЭтапа = Объект.Этапы.НайтиСтроки(Новый Структура("ИндексСвязиЭтапа", Этап.ИндексСвязиЭтапа))[0];  		
			РассчитатьГрафикПлатежейВСтроке(Объект, ГрафикОплаты, ДанныеПроекта, ДанныеЭтапа, Этап); 
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

// Добавляет строку в таблицу графика платежей для строки БДР
// Параметры:
//	ГрафикОплаты - ДанныеФормыКоллекция
//	ДанныеПроекта - Структура
//	ДанныеЭтапа - Структура
//	Этап - ДанныеФормыЭлементКоллекции
//	ПараметрРасчета - Строка табличной части "ПараметрыРасчета" справочника "упоСхемыОплаты"
//	СуммаПлатежа - Число
//	ПериодПлатежа - Дата
//
Процедура ДобавитьСтрокуВГрафикОплаты(ГрафикОплаты, ДанныеПроекта, ДанныеЭтапа, Этап, ПараметрРасчета, СуммаПлатежа, ПериодПлатежа = Неопределено)

	СтрокаГрафика 				= ГрафикОплаты.Добавить();
	СтрокаГрафика.Этап 			= Этап.Этап;
	СтрокаГрафика.ИндексСвязиЭтапа 	= Этап.ИндексСвязиЭтапа;
	СтрокаГрафика.СтатьяБДР 	= Этап.Статья;
	СтрокаГрафика.СхемаОплаты	= Этап.СхемаОплаты;
	СтрокаГрафика.Статья		= ПараметрРасчета.Статья;
	упоУправлениеДоговорамиКлиентСервер.ЗаполнитьВидДвиженияПоСтатье(СтрокаГрафика);
	СтрокаГрафика.Задержка 		= ПараметрРасчета.Задержка;
	СтрокаГрафика.ВидПривязки   = ПараметрРасчета.ВидПривязки;
	УстановитьДатуОплатыГрафикаПлатежей(СтрокаГрафика, ПараметрРасчета, ДанныеПроекта, ДанныеЭтапа, Этап, ПериодПлатежа);
	СтрокаГрафика.Сумма  = СуммаПлатежа;
	
КонецПроцедуры

// Рассчитывает график платежей для строки БДР
// Параметры:
//	Объект - ДанныеФормыСтруктура
//	ГрафикОплаты - ДанныеФормыКоллекция
//	ДанныеПроекта - Структура
//	ДанныеЭтапа - Структура
//	Этап - ДанныеФормыЭлементКоллекции
//
Процедура РассчитатьГрафикПлатежейВСтроке(Объект, ГрафикОплаты, ДанныеПроекта, ДанныеЭтапа, Этап) Экспорт
	
	ОстатокРаспределения = Этап.Сумма;
	Для Каждого ПараметрРасчета Из Этап.СхемаОплаты.ПараметрыРасчета Цикл
		
		Если ПараметрРасчета.ВидПлатежа = ПредопределенноеЗначение("Перечисление.упоВидыПлатежей.Аванс") Тогда 
			
			Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 
				СпособУчетаАванса = Объект.ДокументОснование.СпособУчетаАванса;
			Иначе
				СпособУчетаАванса = Объект.СпособУчетаАванса;
			КонецЕсли;
			
			Если СпособУчетаАванса = ПредопределенноеЗначение("Перечисление.упоСпособУчетаАванса.НаПроект") Тогда
				СуммаПлатежа = Окр(ПараметрРасчета.Доля * ДанныеПроекта["СуммаЭтапов"] / 100, 2);
			Иначе
				СуммаПлатежа = Окр(ПараметрРасчета.Доля * Этап.Сумма / 100, 2);
			КонецЕсли;
			
		Иначе
			
			СуммаПлатежа = Окр(ПараметрРасчета.Доля * Этап.Сумма / 100, 2);
			
		КонецЕсли;
		
		СуммаПлатежа = Мин(СуммаПлатежа, ОстатокРаспределения);
		ОстатокРаспределения = ОстатокРаспределения - СуммаПлатежа;
		
		Если ПараметрРасчета.ВидПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.ПоПрофилюРаспределения") Тогда
			
			СуммыПоПериодам = упоДоходыИРасходыСервер.РаспределитьДоходыИРасходыПоПрофилю(ПараметрРасчета.ПрофильРаспределения, ДанныеЭтапа.ДатаНачала,  ДанныеЭтапа.ДатаОкончания, СуммаПлатежа);
			Для Каждого СтрокаСуммыВПериоде Из СуммыПоПериодам Цикл
				
				ДобавитьСтрокуВГрафикОплаты(ГрафикОплаты, ДанныеПроекта, ДанныеЭтапа, Этап, ПараметрРасчета, СтрокаСуммыВПериоде.Сумма, СтрокаСуммыВПериоде.Период);
				
			КонецЦикла;
			
		Иначе
			
			ДобавитьСтрокуВГрафикОплаты(ГрафикОплаты, ДанныеПроекта, ДанныеЭтапа, Этап, ПараметрРасчета, СуммаПлатежа);
			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

// Актуализирует статус справочника "Договоры контрагентов".
//
// Параметры:
//  Источник	 - ДокументСсылка - документ-источник события актуализации.
//  Договор		 - ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора - документ-договор.
//  Статус		 - СправочникСсылка.упоСтатусыОбъектов - устанавливаемый статус.
//  РежимЗаписи	 - Строка - режим записи документа ("Проведение" или "ОтменаПроведения").
//
// Возвращаемое значение:
//   Неопределено - не возвращает значение.
//
Функция АктуализироватьСтатусСправочникаДоговорыКонтрагентов(Источник, Договор, Статус, РежимЗаписи) Экспорт
	
	ОперацияРЮУД = (ТипЗнч(Источник) = Тип("ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора"));
	
	Если ОперацияРЮУД И РежимЗаписи = "ОтменаПроведения" Тогда 
		
		НовыйСтатус =  Справочники.упоСтатусыОбъектов.ПустаяСсылка();
		
	ИначеЕсли (РежимЗаписи = "Проведение" И ОперацияРЮУД)
		ИЛИ (РежимЗаписи = "ОтменаПроведения" И Не ОперацияРЮУД) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Договор", Договор);
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	упоСтатусыДоговоров.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.упоСтатусыДоговоров.СрезПоследних(, Договор = &Договор) КАК упоСтатусыДоговоров";
						
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			НовыйСтатус = Справочники.упоСтатусыОбъектов.Запланирован; 
		Иначе	
			Выборка = Результат.Выбрать();		
			Выборка.Следующий();
			
			НовыйСтатус = Выборка.Статус;
		КонецЕсли;
		
	Иначе
		
		НовыйСтатус = Статус;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ТЧДоговоров = Договор.СвязиЭтаповДоговораСПроектнымКонтуром.Выгрузить();
	
	Если Не Договор.ДоговорВзаиморасчетов.Пустая() Тогда 
		ТЧДоговоров.Добавить().ДоговорКонтрагента = Договор.ДоговорВзаиморасчетов;
	КонецЕсли;
	
	ТЧДоговоров.Свернуть("ДоговорКонтрагента");
	
	Для Каждого СтрокаСвязий Из ТЧДоговоров Цикл
		
		Если Не СтрокаСвязий.ДоговорКонтрагента.упоСтатусДоговора = НовыйСтатус 
			И ЗначениеЗаполнено(СтрокаСвязий.ДоговорКонтрагента) Тогда  // передалать на запрос и функцию
			
			ДоговорКонтрагента = СтрокаСвязий.ДоговорКонтрагента.ПолучитьОбъект();
			ДоговорКонтрагента.упоСтатусДоговора = НовыйСтатус;
			ДоговорКонтрагента.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Возвращает значение константы упоИспользоватьПодсистемуДоговоров.
//
// Возвращаемое значение:
//   Константы.упоИспользоватьПодсистемуДоговоров - значение константы.
//
Функция ВыборДокументаДоговорВместаДоговораКонтрагента() Экспорт
	
	Возврат Константы.упоИспользоватьПодсистемуДоговоров.Получить();
	
КонецФункции

// Проставляет картинки этапов в строках дерева значений.
//
// Параметры:
//  Дерево	 - ДеревоЗначений - дерево, в строках которого надо проставить строки.
//
// Возвращаемое значение:
//   Неопределено - не возвращает значение.
//
Функция ПроставитьКартинкиЭтапов(Дерево) Экспорт
	
	СтрокиВетки = Дерево.Строки;
	Для Каждого Строка Из СтрокиВетки Цикл
		
		Если Строка.ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.Этап Тогда

			Строка["ТипЭлемента"] = 1;
			
		ИначеЕсли Строка.ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.ПакетРабот Тогда

			Строка["ТипЭлемента"] = 2;
			
		ИначеЕсли Строка.ТипПроектнойЗадачи = Перечисления.упоТипПроектнойЗадачи.МодельПакетаРабот Тогда
			
			Строка["ТипЭлемента"] = 0;
			
		КонецЕсли;
		
		ПроставитьКартинкиЭтапов(Строка);
		
	КонецЦикла;
	
КонецФункции

// Получает таблицу графика оплаты и этапов договора.
//
// Параметры:
//  Договор	 - ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора	 - ссылка на договор.
// 
// Возвращаемое значение:
//  Структура - структура с ключами:
//  * Этапы - СправочникСсылка.упоЭтапыДоговоров
//  * ГрафикОплаты - ТаблицаЗначений
//
Функция ПолучитьТаблицуГрафикаОплатыИЭтаповДоговора(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоГрафикОплатыПоДоговоруСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	упоГрафикОплатыПоДоговоруСрезПоследних.Этап,
		|	упоГрафикОплатыПоДоговоруСрезПоследних.Статья,
		|	упоГрафикОплатыПоДоговоруСрезПоследних.Задержка,
		|	упоГрафикОплатыПоДоговоруСрезПоследних.Сумма,
		|	упоГрафикОплатыПоДоговоруСрезПоследних.ДатаОплаты
		|ИЗ
		|	РегистрСведений.упоГрафикОплатыПоДоговору.СрезПоследних(
		|			,
		|			ДокументИзменения В
		|				(ВЫБРАТЬ
		|					упоАктуальнаяВерсияДоговораСрезПоследних.АктуальноеИзменениеДоговора
		|				ИЗ
		|					РегистрСведений.упоАктуальнаяВерсияДоговора.СрезПоследних(, Договор = &Договор) КАК упоАктуальнаяВерсияДоговораСрезПоследних)) КАК упоГрафикОплатыПоДоговоруСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоЭтапыДоговораСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	упоЭтапыДоговораСрезПоследних.Этап,
		|	упоЭтапыДоговораСрезПоследних.ЭтапРодитель,
		|	упоЭтапыДоговораСрезПоследних.ДатаНачала,
		|	упоЭтапыДоговораСрезПоследних.ДатаОкончания,
		|	упоЭтапыДоговораСрезПоследних.Сумма,
		|	упоЭтапыДоговораСрезПоследних.СхемаОплаты,
		|	упоЭтапыДоговораСрезПоследних.СтатьяДоходов
		|ИЗ
		|	РегистрСведений.упоЭтапыДоговора.СрезПоследних(
		|			,
		|			ДокументИзменения В
		|				(ВЫБРАТЬ
		|					упоАктуальнаяВерсияДоговораСрезПоследних.АктуальноеИзменениеДоговора
		|				ИЗ
		|					РегистрСведений.упоАктуальнаяВерсияДоговора.СрезПоследних(, Договор = &Договор) КАК упоАктуальнаяВерсияДоговораСрезПоследних)) КАК упоЭтапыДоговораСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("договор", Договор);
	Пакет 			= запрос.ВыполнитьПакет();	
	
	ГрафикОплаты	= Пакет.Получить(0).Выгрузить();
	ЭтапыПроекта 	= Пакет.Получить(1).Выгрузить();
	
	Возврат Новый Структура("Этапы, ГрафикОплаты", ЭтапыПроекта, ГрафикОплаты);
	
КонецФункции

// Получает порядок заполнения наименования договора.
//
// Параметры:
//  ВидДоговора				 - СправочникСсылка.упоВидДоговор
//  ИмяИзменяемогоРеквизита	 - Строка
//  РеквизитЕстьВВыборке	 - Булево
// 
// Возвращаемое значение:
//  Массив - коллекция, определяющая порядок заполнения условий договора.
//
Функция ПолучитьПорядокЗаполненияНаименованияДоговора(ВидДоговора, 
	ИмяИзменяемогоРеквизита = Неопределено, 
	РеквизитЕстьВВыборке = Ложь) Экспорт
	
	СтрокаНаименования = "";
	
	Если ТипЗнч(ВидДоговора) = Тип("СправочникСсылка.упоВидДоговора") Тогда
		УсловияФормирования = ВидДоговора.ПравилоФормированияНаименованияДоговора;
	ИначеЕсли ТипЗнч(ВидДоговора) = Тип("СправочникСсылка.упоПравилаФормированияНаименованийДоговоров") Тогда
		УсловияФормирования = ВидДоговора;
	КонецЕсли;
	
	Если УсловияФормирования.Пустая() Тогда 
		УсловияФормирования = Константы.упоПравилоФормированияНаименованияДоговораПоУмолчанию.Получить();
	КонецЕсли;
	
	Если  УсловияФормирования.Пустая() Тогда 
		ТекстСообщения = НСтр("ru = 'Не удалось определить правило формирования наименования договора!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли; 
	
	УсловияФормированияТЧ = УсловияФормирования.ПорядокФормированияНаименования;
	ПорядокФормирования = Новый Массив;
	
	Для Каждого Условия Из УсловияФормированияТЧ Цикл
		Если ЗначениеЗаполнено(Условия) Тогда 
			Если ТипЗнч(Условия.Поле) = Тип("ПеречислениеСсылка.упоСоставНаименованияДоговора") Тогда 
				Если ЗначениеЗаполнено(ИмяИзменяемогоРеквизита) Тогда 
					Если Перечисления.упоСоставНаименованияДоговора[ИмяИзменяемогоРеквизита] = Условия.Поле Тогда 
						РеквизитЕстьВВыборке = Истина;
					КонецЕсли;
				КонецЕсли;
				ЗначениеПеречисления 		= Условия.Поле;
				ИмяПеречисления 			= ЗначениеПеречисления.Метаданные().Имя;
				ИндексЗначенияПеречисления 	= Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
				ИмяЗначенияПеречисления 	= Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[
					ИндексЗначенияПеречисления].Имя;
				Значение 					= Новый Соответствие(); 
				Значение.Вставить(ТипЗнч(Условия.Поле), ИмяЗначенияПеречисления);
				ПорядокФормирования.Добавить(Значение);
			Иначе 
				Значение = Новый Соответствие;
				Значение.Вставить(ТипЗнч(Условия.Поле), Условия.Поле);
				ПорядокФормирования.Добавить(Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПорядокФормирования;
	
КонецФункции

// Получает статус договора.
//
// Параметры:
//  Договор	 - ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора - 
//				договор, для которого надо получить статус.
//
// Возвращаемое значение:
//	СправочникСсылка.упоСтатусыОбъектов - статус договора.
//
Функция ПолучитьСтатусДоговора(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упоСтатусыДоговоров.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.упоСтатусыДоговоров.СрезПоследних(, Договор = &Договор) КАК упоСтатусыДоговоров";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Статус;
	
КонецФункции

// Заполняет юридические условия договора по проекту.
//
// Параметры:
//  Проект				 - СправочникСсылка.Проекты	 - проект.
//  СтруктураДоговора	 - Структура				 - структура, содержащая данные договора.
//
Процедура ЗаполнитьЮридическиеУсловияПоПроекту(Проект, СтруктураДоговора) Экспорт
	
	Запрос = Новый Запрос;
	
	СтруктураДоговора.Этапы.Очистить();
	СтруктураДоговора.ГрафикНачислений.Очистить();
	СтруктураДоговора.ГрафикОплаты.Очистить();
	
	//СтруктураДоговора.СвязиЭтаповДоговораСПроектнымКонтуром.Очистить();
	
	//ЗаполнитьДоходы = (СтруктураДоговора.Свойство("РежимЗаполнения") И СтруктураДоговора.РежимЗаполнения = 1);
	РежимЗаполнения = Неопределено;
	СтруктураДоговора.Свойство("РежимЗаполнения", РежимЗаполнения);
	
	Если РежимЗаполнения = Неопределено Тогда
		ТекстЗапроса = ТекстЗапросаЗаполнитьПоПроектуПоСтруктуре();
	Иначе	
	    ТекстЗапроса = ТекстЗапросаЗаполнитьПоПроекту();	
	КонецЕсли;

	Если СтруктураДоговора.Свойство("Контрагент") Тогда
		УсловиеКонтрагент = "Контрагент = &Контрагент";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеКонтрагент", "упоАктуальныеПланыДоходовИРасходовСрезПоследних."+УсловиеКонтрагент);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеКонтрагент", "упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних."+УсловиеКонтрагент);
		Запрос.УстановитьПараметр("Контрагент", СтруктураДоговора.Контрагент);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеКонтрагент", "Истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеКонтрагент", "Истина");
	КонецЕсли;
	Если СтруктураДоговора.Свойство("ДоговорКонтрагента") Тогда
		УсловиеДоговорКонтрагента = "Договор = &ДоговорКонтрагента";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеДоговорКонтрагента", "упоАктуальныеПланыДоходовИРасходовСрезПоследних."+УсловиеДоговорКонтрагента);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеДоговорКонтрагента", "упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних."+УсловиеДоговорКонтрагента);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", СтруктураДоговора.ДоговорКонтрагента);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеДоговорКонтрагента", "Истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеДоговорКонтрагента", "Истина");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	Запрос.УстановитьПараметр("Проект", Проект);
	
	ДатаДокумента = Неопределено;
	СтруктураДоговора.Свойство("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	Запрос.УстановитьПараметр("СвязиЭтаповДоговораСПроектнымКонтуром", СтруктураДоговора.СвязиЭтаповДоговораСПроектнымКонтуром);
	
	СписокНаправлениеДвиженияБДДС = Новый СписокЗначений;
	СписокНаправлениеДвиженияБДР = Новый СписокЗначений;
	 
	Если РежимЗаполнения = 0 Или РежимЗаполнения = 1 Тогда
		СписокНаправлениеДвиженияБДДС.Добавить(Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление);
		СписокНаправлениеДвиженияБДР.Добавить(Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход);
	КонецЕсли;
	Если РежимЗаполнения = 0 Или РежимЗаполнения = 2 Тогда
		СписокНаправлениеДвиженияБДДС.Добавить(Перечисления.упоНаправлениеДвиженияДенежныхСредств.Выплата);
		СписокНаправлениеДвиженияБДР.Добавить(Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход);
	КонецЕсли;
	Запрос.УстановитьПараметр("НаправлениеДвиженияБДДС", СписокНаправлениеДвиженияБДДС);
	Запрос.УстановитьПараметр("НаправлениеДвиженияБДР", СписокНаправлениеДвиженияБДР);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ПроектныеЗадачи = РезультатЗапроса[6].Выгрузить();
	
	СтруктураДоговора.СвязиЭтаповДоговораСПроектнымКонтуром.Очистить();
	
	СоответствиеПЗСЭтапами = Новый Соответствие;
	СоответствиеПЗСИндексамиЭтапов = Новый Соответствие;

	Индекс = 1; 
	Для Каждого СтрокаДанныхПроектнойЗадачи Из ПроектныеЗадачи Цикл
		СоответствиеПЗСЭтапами.Вставить(СтрокаДанныхПроектнойЗадачи.ПроектнаяЗадача, СтрокаДанныхПроектнойЗадачи.Этап);
		СоответствиеПЗСИндексамиЭтапов.Вставить(СтрокаДанныхПроектнойЗадачи.ПроектнаяЗадача, Индекс);
		
		Если ЗначениеЗаполнено(СтрокаДанныхПроектнойЗадачи.Сумма) И СтрокаДанныхПроектнойЗадачи.Валюта <> СтруктураДоговора.Валюта Тогда
			СтрокаДанныхПроектнойЗадачи.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(СтрокаДанныхПроектнойЗадачи.Сумма,
																						СтрокаДанныхПроектнойЗадачи.Валюта, 
																						СтруктураДоговора.Валюта, 
																						СтрокаДанныхПроектнойЗадачи.ДатаПривязки);
        КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
		
	ДДС = РезультатЗапроса[7].Выгрузить();
	
	// Заполним данные ДДС
	Для Каждого ДанныеСтрокиДДС Из ДДС Цикл
		
		СтрокаГрафика = СтруктураДоговора.ГрафикОплаты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаГрафика, ДанныеСтрокиДДС);
		
		Если ЗначениеЗаполнено(СтрокаГрафика.Сумма) И ДанныеСтрокиДДС.Валюта <> СтруктураДоговора.Валюта Тогда
			СтрокаГрафика.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(СтрокаГрафика.Сумма,
																			ДанныеСтрокиДДС.Валюта, 
																			СтруктураДоговора.Валюта, 
																			ДанныеСтрокиДДС.ДатаОплаты);																			
		КонецЕсли;
																		
		СтрокаГрафика.Этап = СоответствиеПЗСЭтапами[ДанныеСтрокиДДС.ПроектнаяЗадача];
		СтрокаГрафика.ИндексСвязиЭтапа = СоответствиеПЗСИндексамиЭтапов[ДанныеСтрокиДДС.ПроектнаяЗадача];
		упоУправлениеДоговорамиКлиентСервер.ЗаполнитьВидДвиженияПоСтатье(СтрокаГрафика);
		
	КонецЦикла; 	
	
	Для Каждого СтрокаДанныхПроектнойЗадачи Из ПроектныеЗадачи Цикл
		
		Этап = СоответствиеПЗСЭтапами[СтрокаДанныхПроектнойЗадачи.ПроектнаяЗадача];
		ИндексСвязиЭтапа = СоответствиеПЗСИндексамиЭтапов[СтрокаДанныхПроектнойЗадачи.ПроектнаяЗадача];
		
		СтрокаЭтапа = СтруктураДоговора.Этапы.Добавить();
		СтрокаЭтапа.Этап = Этап;
		СтрокаЭтапа.ИндексСвязиЭтапа = ИндексСвязиЭтапа;
		СтрокаЭтапа.ПредставлениеЭтапа = СтрокаДанныхПроектнойЗадачи.НазваниеЗадачи;
		СтрокаЭтапа.ЭтапРодитель = СоответствиеПЗСЭтапами[СтрокаДанныхПроектнойЗадачи.ЗадачаРодитель];
		СтрокаЭтапа.ИндексСвязиЭтапаРодитель = СоответствиеПЗСИндексамиЭтапов[СтрокаДанныхПроектнойЗадачи.ЗадачаРодитель];
		
		// Сявзи этапов и проектов
		СтрокаСвязейЭтаповИПроектов = СтруктураДоговора.СвязиЭтаповДоговораСПроектнымКонтуром.Добавить();
		СтрокаСвязейЭтаповИПроектов.ЭтапДоговора = Этап;
		СтрокаСвязейЭтаповИПроектов.ИндексСвязиЭтапа = ИндексСвязиЭтапа;
		СтрокаСвязейЭтаповИПроектов.ПроектнаяЗадача = СтрокаДанныхПроектнойЗадачи.ПроектнаяЗадача;
		СтрокаСвязейЭтаповИПроектов.Проект = СтруктураДоговора.Проект;
		СтрокаСвязейЭтаповИПроектов.ДоговорКонтрагента = СтруктураДоговора.ДоговорВзаиморасчетов;
		
		СтрокаЭтапа.ДатаНачала = СтрокаДанныхПроектнойЗадачи.ДатаНачалаПлан;
		СтрокаЭтапа.ДатаОкончания = СтрокаДанныхПроектнойЗадачи.ДатаЗавершенияПлан;
		СтрокаЭтапа.Сумма = СтрокаДанныхПроектнойЗадачи.Сумма;
		
		Если Не СтрокаДанныхПроектнойЗадачи.ЭтоМодельПакетаРабот И Не СтрокаДанныхПроектнойЗадачи.ЭтоПакетРабот Тогда
			СтрокаЭтапа.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Этап");
		ИначеЕсли СтрокаДанныхПроектнойЗадачи.ЭтоМодельПакетаРабот Тогда
			СтрокаЭтапа.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
		Иначе
			СтрокаЭтапа.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.ПакетРабот");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанныхПроектнойЗадачи.Статья) Тогда
			СтрокаНачисление = СтруктураДоговора.ГрафикНачислений.Добавить();   			
			СтрокаНачисление.Этап = Этап;
			СтрокаНачисление.ИндексСвязиЭтапа = ИндексСвязиЭтапа;
			СтрокаНачисление.Статья = СтрокаДанныхПроектнойЗадачи.Статья;
			упоУправлениеДоговорамиКлиентСервер.ЗаполнитьВидДвиженияПоСтатье(СтрокаНачисление);
			СтрокаНачисление.Сумма = СтрокаДанныхПроектнойЗадачи.Сумма;
			СтрокаНачисление.ДатаНачисления = СтрокаДанныхПроектнойЗадачи.ДатаЗавершенияПлан;			
		КонецЕсли;	
		
	КонецЦикла;
	
	СтруктураДоговора.СвязиЭтаповДоговораСПроектнымКонтуром.Свернуть("ДоговорКонтрагента,
		|НомерСтроки, Проект, ПроектнаяЗадача, ЭтапДоговора, ИндексСвязиЭтапа");
	
КонецПроцедуры

// Заполняет договор по шаблону.
//
// Параметры:
//  Шаблон				 - Справочник.упоШаблоныПроектов - шаблон проекта.
//  СтруктураДоговора	 - Структура - структура данных договора.
//
Процедура ЗаполнитьДоговорПоШаблону(Шаблон, СтруктураДоговора) Экспорт
	
	СтруктураДоговора.СвязиЭтаповДоговораСПроектнымКонтуром.Очистить();
	
	СвязьЭтаповСПЗ = Неопределено;
	СвязьИндексовЭтаповСПЗ = Неопределено;
	ЗаполнитьДанныеБДРДоговораПоШаблону(Шаблон, СвязьЭтаповСПЗ, СвязьИндексовЭтаповСПЗ, СтруктураДоговора);
	ЗаполнитьДанныеБДДСДоговораПоШаблону(Шаблон, СвязьЭтаповСПЗ, СвязьИндексовЭтаповСПЗ, СтруктураДоговора);
	
КонецПроцедуры

// Заполняет табличную часть График начислений.
//
Процедура ЗаполнитьГрафикНачислений() Экспорт

	Выборка = Документы.упоРегистрацияЮридическихУсловийДоговора.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ДокументОбъект.ГрафикНачислений.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаЭтап Из ДокументОбъект.Этапы Цикл
			
			Если ЗначениеЗаполнено(СтрокаЭтап.УдалитьСтатьяДоходов) Тогда
				СтрокаНачисление = ДокументОбъект.ГрафикНачислений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНачисление, СтрокаЭтап);
				СтрокаНачисление.Статья = СтрокаЭтап.УдалитьСтатьяДоходов;
				Если ТипЗнч(СтрокаНачисление.Статья) = Тип("СправочникСсылка.упоСтатьиДоходов") Тогда
					СтрокаНачисление.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
				ИначеЕсли ТипЗнч(СтрокаНачисление.Статья) = Тип("СправочникСсылка.упоСтатьиЗатрат") Тогда
					СтрокаНачисление.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
				КонецЕсли;
				СтрокаНачисление.ДатаНачисления = СтрокаЭтап.ДатаОкончания;	
			КонецЕсли;	
			
		КонецЦикла; 
		
		Для Каждого СтрокаСтатьяДДС Из ДокументОбъект.ГрафикОплаты Цикл
			
			СтрокаЭтап = ДокументОбъект.Этапы.Найти(СтрокаСтатьяДДС.ИндексСвязиЭтапа, "ИндексСвязиЭтапа");
			Если ЗначениеЗаполнено(СтрокаЭтап) Тогда
				СтрокаСтатьяДДС.СтатьяБДР = СтрокаЭтап.УдалитьСтатьяДоходов;
				СтрокаСтатьяДДС.СхемаОплаты = СтрокаЭтап.УдалитьСхемаОплаты;
			КонецЕсли;	
			Если ТипЗнч(СтрокаСтатьяДДС.Статья) = Тип("СправочникСсылка.упоСтатьиДоходов") Тогда     				
				СтрокаСтатьяДДС.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход;
			ИначеЕсли ТипЗнч(СтрокаСтатьяДДС.Статья) = Тип("СправочникСсылка.упоСтатьиЗатрат") Тогда
				СтрокаСтатьяДДС.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход;
			ИначеЕсли ТипЗнч(СтрокаСтатьяДДС.Статья) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда
				СтрокаСтатьяДДС.ВидДвижения = СтрокаСтатьяДДС.Статья.упоНаправлениеДвижения;
			КонецЕсли;
			
		КонецЦикла;
		
		ДокументОбъект.Записать();
		
	КонецЦикла;   	

КонецПроцедуры         

// Возвращает дату начала и окончания проекта, сумму этапов.
//
// Параметры:
//  Договор	 -  СправочникСсылка.ДоговорыКонтрагентов
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьДатыНачалаИОкончанияПроекта(Договор) Экспорт
	
	Если ЗначениеЗаполнено(Договор.ДокументОснование) Тогда 
		ИспользоватьЭтапы = Договор.ДокументОснование.ИспользоватьЭтапы;
	Иначе
		ИспользоватьЭтапы = Договор.ИспользоватьЭтапы;
	КонецЕсли;
		
	ДатаОкончанияПроекта = '00010101';
	ДатаНачалаПроекта = '30000101';
	Этапы = Договор.Этапы;
	Для Каждого СтрокаЭтап Из Этапы Цикл
		Если ДатаОкончанияПроекта <= СтрокаЭтап.ДатаОкончания Тогда 
			ДатаОкончанияПроекта= СтрокаЭтап.ДатаОкончания;
		КонецЕсли;
		
		Если ДатаНачалаПроекта > СтрокаЭтап.ДатаНачала Тогда 
			ДатаНачалаПроекта = СтрокаЭтап.ДатаНачала;
		КонецЕсли;
	КонецЦикла;	
	Если ДатаНачалаПроекта > ДатаОкончанияПроекта Тогда
		ДатаНачалаПроекта = ДатаОкончанияПроекта;
	КонецЕсли;
	
	СуммаДоговораИтог = Договор.СуммаДоговора;
	
	Возврат Новый Структура("ДатаНачалаПроекта, ДатаОкончанияПроекта, СуммаЭтапов",
		ДатаНачалаПроекта, ДатаОкончанияПроекта, СуммаДоговораИтог);
	
КонецФункции

// Создает элемент "Этап договора" в ИБ.
//
// Параметры:
//  ЗначениеСвойств	 - Структура - значения для заполнения.
//  ЭтоНовый		 - Булево
//  ЭтапДоговора	 - СправочникСсылка.упоЭтапыДоговоров, Неопределено
// 
// Возвращаемое значение:
//  СправочникСсылка.упоЭтапыДоговоров - созданный или измененный элемент "Этап договора".
//
Функция СоздатьЭтапДоговора(ЗначениеСвойств, ЭтоНовый = Истина, ЭтапДоговора = Неопределено) Экспорт 
	
	Если ЭтоНовый Тогда
		ЭтапДоговораОбъект = Справочники.упоЭтапыДоговоров.СоздатьЭлемент();
	Иначе
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтапДоговора, "Наименование") = ЗначениеСвойств.Наименование Тогда
			Возврат ЭтапДоговора;
		КонецЕсли;
		ЭтапДоговораОбъект = ЭтапДоговора.ПолучитьОбъект();
		Автор = ЭтапДоговораОбъект.Автор;
		ЮридическоеУсловиеДоговора = ЭтапДоговораОбъект.ЮридическоеУсловиеДоговора;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтапДоговораОбъект, ЗначениеСвойств);
	Если Не ЭтоНовый Тогда
		ЭтапДоговораОбъект.Автор = Автор;
		Если ЗначениеЗаполнено(ЮридическоеУсловиеДоговора) Тогда
			ЭтапДоговораОбъект.ЮридическоеУсловиеДоговора = ЮридическоеУсловиеДоговора;
		КонецЕсли;
	КонецЕсли;
	ЭтапДоговораОбъект.Записать();
	
	Возврат ЭтапДоговораОбъект.Ссылка;

КонецФункции

// Возвращает валюту договора контрагента.
//
// Параметры:
//  ДоговорКонтрагента	 - СправочникСсылка.ДоговорыКонтрагентов - договор контрагента.
// 
// Возвращаемое значение:
//  СправочникСсылка.Валюты
//
Функция ВалютаДоговораКонтрагента(ДоговорКонтрагента) Экспорт
	
	имяРеквизитаВалютыДоговора = упоУправлениеДоговорамиКлиентСервер.ИмяРеквизитаВалютыДоговора();
	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, имяРеквизитаВалютыДоговора);
	
	Возврат ВалютаДоговора;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Добавляет в дерево данные табличных частей График начислений и График оплаты.
//
// Параметры:
//  Дерево		 - ДеревоЗначений
//  ТаблицаБДР	 - ТаблицаЗначений
//  ТаблицаБДДС	 - ТаблицаЗначений
//
Процедура ДобавитьВДеревоБДРиБДДС(Дерево, ТаблицаБДР, ТаблицаБДДС) Экспорт
	
	// Дополняем дерево данными БДР и БДДС.
	
	// Типы элементов:
	// 0 - Модель
	// 1 - Этап
	// 2 - Пакет
	// 3 - Доход
	// 4 - Расход
	// 5 - Поступление
	// 6 - Выплата.

	// Заполнять будем с конца таблицы, потому что строки будут вставляться непосредственно под родителя,
	// таким образом порядок строк будет сохранен.
	Индекс = ТаблицаБДР.Количество() - 1;
	
	Пока Индекс >= 0 Цикл
		
		СтрокаБДР = ТаблицаБДР[Индекс];
		
		Отбор = Новый Структура();
		Если ЗначениеЗаполнено(СтрокаБДР.Этап) Тогда
			Отбор.Вставить("Этап", СтрокаБДР.Этап);
		Иначе
			Отбор.Вставить("ИндексСвязиЭтапа", СтрокаБДР.ИндексСвязиЭтапа);
		КонецЕсли;
		Отбор.Вставить("ТипЭлемента", 0);

		НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);      
		Если НайденныеСтроки.Количество() = 0 Тогда
			Отбор.Вставить("ТипЭлемента", 1);
		    НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
		КонецЕсли;
		Если НайденныеСтроки.Количество() = 0 Тогда
			РодительскаяСтрокаДерева = Дерево;
		Иначе	
			РодительскаяСтрокаДерева = НайденныеСтроки[0];	
		КонецЕсли;	
		НоваяСтрока = РодительскаяСтрокаДерева.Строки.Вставить(0);
		
		НоваяСтрока.Этап = СтрокаБДР.Статья;
		НоваяСтрока.ЭтапРодитель = СтрокаБДР.Этап;
		НоваяСтрока.ИндексСвязиЭтапаРодитель = СтрокаБДР.ИндексСвязиЭтапа;
		НоваяСтрока.ПредставлениеЭтапа = СтрокаБДР.Статья;
		НоваяСтрока.Статья = СтрокаБДР.Статья;
		Если СтрокаБДР.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход Тогда
			НоваяСтрока.ТипЭлемента = 3;
		Иначе
			НоваяСтрока.ТипЭлемента = 4;
		КонецЕсли;
		НоваяСтрока.ВидДвижения = СтрокаБДР.ВидДвижения;
		НоваяСтрока.СуммаБДР = СтрокаБДР.Сумма;
		НоваяСтрока.СхемаОплаты = СтрокаБДР.СхемаОплаты;
		НоваяСтрока.ДатаНачисленияОплаты = СтрокаБДР.ДатаНачисления;
		НоваяСтрока.Примечание = СтрокаБДР.Примечание;
		НоваяСтрока.ИндексСвязиЭтапа = СтрокаБДР.ИндексСвязиЭтапа;

		Индекс = Индекс - 1;
			
	КонецЦикла;  	
	
	Для Каждого СтрокаБДДС Из ТаблицаБДДС Цикл
		
		Отбор = Новый Структура();
		
		Если ЗначениеЗаполнено(СтрокаБДДС.СтатьяБДР) Тогда
			Если ЗначениеЗаполнено(СтрокаБДДС.Этап) Тогда 
				Отбор.Вставить("ЭтапРодитель", СтрокаБДДС.Этап);
			Иначе
				Отбор.Вставить("ИндексСвязиЭтапаРодитель", СтрокаБДДС.ИндексСвязиЭтапа);
			КонецЕсли;
			Отбор.Вставить("Статья", СтрокаБДДС.СтатьяБДР);
			Отбор.Вставить("СхемаОплаты", СтрокаБДДС.СхемаОплаты);
			Отбор.Вставить("ТипЭлемента", 3);
			НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);      
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Вставить("ТипЭлемента", 4);
			    НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(СтрокаБДДС.Этап) Тогда 
				Отбор.Вставить("Этап", СтрокаБДДС.Этап);
			Иначе
				Отбор.Вставить("ИндексСвязиЭтапа", СтрокаБДДС.ИндексСвязиЭтапа);
			КонецЕсли;
			Отбор.Вставить("ТипЭлемента", 0);
			НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);      
			Если НайденныеСтроки.Количество() = 0 Тогда
				Отбор.Вставить("ТипЭлемента", 1);
			    НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
			КонецЕсли;
		КонецЕсли;
			
		РодительскаяСтрокаДерева = Неопределено;
		НайденноеКоличествоСтрок = НайденныеСтроки.Количество();
		Если НайденноеКоличествоСтрок = 0 Тогда
			РодительскаяСтрокаДерева = Дерево;
		ИначеЕсли НайденноеКоличествоСтрок = 1 Тогда
			РодительскаяСтрокаДерева = НайденныеСтроки[0];
		Иначе
			Для Каждого СтрокаПоиска Из НайденныеСтроки Цикл
				Если СтрокаПоиска.СуммаБДДС + СтрокаБДДС.Сумма <= СтрокаПоиска.СуммаБДР Тогда 
					СтрокаПоиска.СуммаБДДС = СтрокаПоиска.СуммаБДДС + СтрокаБДДС.Сумма;
					РодительскаяСтрокаДерева = СтрокаПоиска;
					Прервать;
				КонецЕсли;			
			КонецЦикла;
			Если РодительскаяСтрокаДерева = Неопределено Тогда
				РодительскаяСтрокаДерева = НайденныеСтроки[НайденноеКоличествоСтрок-1];
			КонецЕсли;
		КонецЕсли;	
		
		// Если строка оплаты на одном уровне с этапами, то передвигаем ее вверх.
		Для ИндексДляВставки = 0 По РодительскаяСтрокаДерева.Строки.Количество() - 1 Цикл
			СоседняяСтрока = РодительскаяСтрокаДерева.Строки[ИндексДляВставки];
			Если СоседняяСтрока.ТипЭлемента = 0 ИЛИ СоседняяСтрока.ТипЭлемента = 1 Тогда
				Прервать;	
			КонецЕсли;
		КонецЦикла;
	
		НоваяСтрока = РодительскаяСтрокаДерева.Строки.Вставить(ИндексДляВставки);

		НоваяСтрока.Этап = СтрокаБДДС.Статья;
		НоваяСтрока.ЭтапРодитель = СтрокаБДДС.СтатьяБДР;
		НоваяСтрока.ПредставлениеЭтапа = СтрокаБДДС.Статья;
		НоваяСтрока.Статья = СтрокаБДДС.Статья;
		
		НоваяСтрока.ВидДвижения = СтрокаБДДС.ВидДвижения;
		Если СтрокаБДДС.ВидДвижения = Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход 
			ИЛИ СтрокаБДДС.ВидДвижения = Перечисления.упоНаправлениеДвиженияДенежныхСредств.Поступление Тогда 
			НоваяСтрока.ТипЭлемента = 5;
		Иначе 
			НоваяСтрока.ТипЭлемента = 6;
		КонецЕсли;
			
		НоваяСтрока.СуммаБДДС = СтрокаБДДС.Сумма;
		НоваяСтрока.СхемаОплаты = СтрокаБДДС.СхемаОплаты;
		НоваяСтрока.ДатаНачисленияОплаты = СтрокаБДДС.ДатаОплаты;
		НоваяСтрока.Задержка = СтрокаБДДС.Задержка;
		НоваяСтрока.Примечание = СтрокаБДДС.Примечание;
		НоваяСтрока.ВидПривязки = СтрокаБДДС.ВидПривязки;
		НоваяСтрока.ИндексСвязиЭтапа = СтрокаБДДС.ИндексСвязиЭтапа;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеБДРДоговораПоШаблону(Шаблон, СвязьЭтаповСПЗ, СвязьИндексовЭтаповСПЗ, СтруктураДоговора)
	
	СтруктураДоговора.Этапы.Очистить();
	СтруктураДоговора.ГрафикНачислений.Очистить();
	
	РежимЗаполнения = Неопределено;
	СтруктураДоговора.Свойство("РежимЗаполнения", РежимЗаполнения);
	ЗаполнитьДоходы = РежимЗаполнения = 0 Или РежимЗаполнения = 1; 

	Если СвязьЭтаповСПЗ = Неопределено Тогда
		СвязьЭтаповСПЗ = Новый Соответствие;
	КонецЕсли;
	Если СвязьИндексовЭтаповСПЗ = Неопределено Тогда
		СвязьИндексовЭтаповСПЗ = Новый Соответствие;
	КонецЕсли;
	
	Если ЗаполнитьДоходы Тогда
		ИмяТаблицыСПланом = "ПланДоходов";
	Иначе
		ИмяТаблицыСПланом = "ПланРасходов";
	КонецЕсли;
		
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоШаблоныПроектныхЗадач.Ссылка,
	|	упоШаблоныПроектныхЗадач.Родитель,
	|	упоШаблоныПроектныхЗадач.Наименование,
	|	упоШаблоныПроектныхЗадач.ПолноеНаименование,
	|	упоШаблоныПроектныхЗадач.ТипПроектнойЗадачи,
	|	упоШаблоныПроектныхЗадач.ВключитьСубпродуктыВПланДоходов
	|ПОМЕСТИТЬ ВТШаблоныПЗ
	|ИЗ
	|	Справочник.упоШаблоныПроектныхЗадач КАК упоШаблоныПроектныхЗадач
	|ГДЕ
	|	упоШаблоныПроектныхЗадач.Владелец = &Владелец
	|	И НЕ упоШаблоныПроектныхЗадач.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныПЗ.Ссылка,
	|	ШаблоныПЗ.Родитель,
	|	ШаблоныПЗ.Наименование,
	|	ШаблоныПЗ.ПолноеНаименование,
	|	ШаблоныПЗ.ТипПроектнойЗадачи
	|ИЗ
	|	ВТШаблоныПЗ КАК ШаблоныПЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныПЗ.Ссылка,
	|	ШаблоныПЗ.Родитель,
	|	ШаблоныПЗ.Наименование,
	|	ШаблоныПЗ.ПолноеНаименование,
	|	ШаблоныПЗ.ТипПроектнойЗадачи,
	|	ПланБДР.Статья,
	|	ПланБДР.ПрофильРаспределения,
	|	ПланБДР.Валюта,
	|	ПланБДР.Сумма,
	|	ПланБДР.Контрагент,
	|	ПланБДР.СпособПривязки
	|ПОМЕСТИТЬ ВТДанныеБДР
	|ИЗ
	|	ВТШаблоныПЗ КАК ШаблоныПЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоШаблоныПроектныхЗадач." + ИмяТаблицыСПланом + " КАК ПланБДР
	|		ПО ШаблоныПЗ.Ссылка = ПланБДР.Ссылка
	|";
	
	Если ЗаполнитьДоходы Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ШаблоныПЗ.Ссылка,
		|	ШаблоныПЗ.Родитель,
		|	ШаблоныПЗ.Наименование,
		|	ШаблоныПЗ.ПолноеНаименование,
		|	ШаблоныПЗ.ТипПроектнойЗадачи,
		|	Субпродукты.СтатьяДоходов,
		|	Субпродукты.ПрофильРаспределения,
		|	Субпродукты.Валюта,
		|	Субпродукты.ОбщСтоимость,
		|	Субпродукты.Контрагент,
		|	Субпродукты.СпособПривязки
		|ИЗ
		|	ВТШаблоныПЗ КАК ШаблоныПЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоШаблоныПроектныхЗадач.Субпродукты КАК Субпродукты
		|		ПО ШаблоныПЗ.Ссылка = Субпродукты.Ссылка
		|			И (ШаблоныПЗ.ВключитьСубпродуктыВПланДоходов)
		|";
	КонецЕсли;
	
	Если РежимЗаполнения = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ
		|ВЫБРАТЬ 
		|	ШаблоныПЗ.Ссылка,
		|	ШаблоныПЗ.Родитель,
		|	ШаблоныПЗ.Наименование,
		|	ШаблоныПЗ.ПолноеНаименование,
		|	ШаблоныПЗ.ТипПроектнойЗадачи,
		|	ПланРасходов.Статья,
		|	ПланРасходов.ПрофильРаспределения,
		|	ПланРасходов.Валюта,
		|	ПланРасходов.Сумма,
		|	ПланРасходов.Контрагент,
		|	ПланРасходов.СпособПривязки
		|ИЗ
		|	ВТШаблоныПЗ КАК ШаблоныПЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоШаблоныПроектныхЗадач.ПланРасходов КАК ПланРасходов
		|		ПО ШаблоныПЗ.Ссылка = ПланРасходов.Ссылка
		|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныПЗ.Ссылка
	|	,ШаблоныПЗ.Родитель
	|	,ШаблоныПЗ.Наименование
	|	,ШаблоныПЗ.ПолноеНаименование
	|	,ШаблоныПЗ.ТипПроектнойЗадачи
	|	,ДанныеБДР.Статья
	|	,ДанныеБДР.Валюта
	|	,ДанныеБДР.Сумма
	|ИЗ
	|	ВТШаблоныПЗ КАК ШаблоныПЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеБДР КАК ДанныеБДР
	|		ПО ШаблоныПЗ.Ссылка = ДанныеБДР.Ссылка
	|			И ШаблоныПЗ.Родитель = ДанныеБДР.Родитель
	|			И ШаблоныПЗ.ТипПроектнойЗадачи = ДанныеБДР.ТипПроектнойЗадачи
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Шаблон);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	Индекс = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СвязьЭтаповСПЗ.Вставить(ВыборкаДетальныеЗаписи.Ссылка, Справочники.упоЭтапыДоговоров.ПустаяСсылка());
		СвязьИндексовЭтаповСПЗ.Вставить(ВыборкаДетальныеЗаписи.Ссылка, Индекс);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаЭтапы				= СтруктураДоговора.Этапы.Добавить();
		НоваяСтрокаЭтапы.Этап 			= СвязьЭтаповСПЗ[ВыборкаДетальныеЗаписи.Ссылка];
		НоваяСтрокаЭтапы.ЭтапРодитель 	= СвязьЭтаповСПЗ[ВыборкаДетальныеЗаписи.Родитель];
		НоваяСтрокаЭтапы.ИндексСвязиЭтапа 			= СвязьИндексовЭтаповСПЗ[ВыборкаДетальныеЗаписи.Ссылка];
		НоваяСтрокаЭтапы.ИндексСвязиЭтапаРодитель 	= СвязьИндексовЭтаповСПЗ[ВыборкаДетальныеЗаписи.Родитель];
		НоваяСтрокаЭтапы.ПредставлениеЭтапа = ВыборкаДетальныеЗаписи.Наименование;

		НоваяСтрокаЭтапы.ТипПроектнойЗадачи = ВыборкаДетальныеЗаписи.ТипПроектнойЗадачи;
		НоваяСтрокаЭтапы.Сумма = ВыборкаДетальныеЗаписи.Сумма;
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) И ВыборкаДетальныеЗаписи.Валюта <> СтруктураДоговора.Валюта Тогда
			НоваяСтрокаЭтапы.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(ВыборкаДетальныеЗаписи.Сумма,
																				ВыборкаДетальныеЗаписи.Валюта, 
																				СтруктураДоговора.Валюта, 
																				СтруктураДоговора.ДатаДокумента);
		КонецЕсли;
	   
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Статья) Тогда
			НоваяСтрокаНачисление = СтруктураДоговора.ГрафикНачислений.Добавить();
			НоваяСтрокаНачисление.Этап = НоваяСтрокаЭтапы.Этап;
			НоваяСтрокаНачисление.ИндексСвязиЭтапа = НоваяСтрокаЭтапы.ИндексСвязиЭтапа;
			НоваяСтрокаНачисление.Статья = ВыборкаДетальныеЗаписи.Статья;
			упоУправлениеДоговорамиКлиентСервер.ЗаполнитьВидДвиженияПоСтатье(НоваяСтрокаНачисление);
			НоваяСтрокаНачисление.Сумма = ВыборкаДетальныеЗаписи.Сумма; 
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) И ВыборкаДетальныеЗаписи.Валюта <> СтруктураДоговора.Валюта Тогда
				НоваяСтрокаНачисление.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(ВыборкаДетальныеЗаписи.Сумма,
																				ВыборкаДетальныеЗаписи.Валюта, 
																				СтруктураДоговора.Валюта, 
																				СтруктураДоговора.ДатаДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеБДДСДоговораПоШаблону(Шаблон, СвязьЭтаповСПЗ, СвязьИндексовЭтаповСПЗ, СтруктураДоговора)
	
	СтруктураДоговора.ГрафикОплаты.Очистить();
	
	// РежимЗаполнения = Неопределено - только структура; 0 - доходы+расходы; 1 - доходы; 2 - расходы;
	РежимЗаполнения = Неопределено;
	СтруктураДоговора.Свойство("РежимЗаполнения", РежимЗаполнения);
	ЗаполнитьДоходы = РежимЗаполнения = 0 Или РежимЗаполнения = 1; 
	
	Если ЗаполнитьДоходы Тогда
		ИмяТаблицыСПланом = "ПланПоступлений";
	Иначе
		ИмяТаблицыСПланом = "ПланВыплат";
	КонецЕсли;
		
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоШаблоныПроектныхЗадач.Ссылка,
		|	упоШаблоныПроектныхЗадач.Родитель,
		|	упоШаблоныПроектныхЗадач.Наименование,
		|	упоШаблоныПроектныхЗадач.ПолноеНаименование,
		|	упоШаблоныПроектныхЗадач.ТипПроектнойЗадачи,
		|	упоШаблоныПроектныхЗадач.ВключитьСубпродуктыВПланДоходов
		|ПОМЕСТИТЬ ВТШаблоныПЗ
		|ИЗ
		|	Справочник.упоШаблоныПроектныхЗадач КАК упоШаблоныПроектныхЗадач
		|ГДЕ
		|	упоШаблоныПроектныхЗадач.Владелец = &Владелец
		|	И НЕ упоШаблоныПроектныхЗадач.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШаблоныПЗ.Ссылка,
		|	ШаблоныПЗ.Родитель,
		|	ШаблоныПЗ.Наименование,
		|	ШаблоныПЗ.ПолноеНаименование,
		|	ШаблоныПЗ.ТипПроектнойЗадачи
		|ИЗ
		|	ВТШаблоныПЗ КАК ШаблоныПЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШаблоныПЗ.Ссылка,
		|	ШаблоныПЗ.Родитель,
		|	ШаблоныПЗ.Наименование,
		|	ШаблоныПЗ.ПолноеНаименование,
		|	ШаблоныПЗ.ТипПроектнойЗадачи,
		|	ПланБДДС.Статья,
		|	ПланБДДС.Валюта,
		|	ПланБДДС.Сумма,
		|	ПланБДДС.Контрагент,
		|	ПланБДДС.Задержка,
		|	ПланБДДС.СпособПривязки
		|ИЗ
		|	ВТШаблоныПЗ КАК ШаблоныПЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоШаблоныПроектныхЗадач." + ИмяТаблицыСПланом + " КАК ПланБДДС
		|		ПО ШаблоныПЗ.Ссылка = ПланБДДС.Ссылка
		|";
	
	Если РежимЗаполнения = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ
		|ВЫБРАТЬ 
		|	ШаблоныПЗ.Ссылка,
		|	ШаблоныПЗ.Родитель,
		|	ШаблоныПЗ.Наименование,
		|	ШаблоныПЗ.ПолноеНаименование,
		|	ШаблоныПЗ.ТипПроектнойЗадачи,
		|	ПланВыплат.Статья,
		|	ПланВыплат.Валюта,
		|	ПланВыплат.Сумма,
		|	ПланВыплат.Контрагент,
		|	ПланВыплат.Задержка,
		|	ПланВыплат.СпособПривязки
		|ИЗ
		|	ВТШаблоныПЗ КАК ШаблоныПЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоШаблоныПроектныхЗадач.ПланВыплат КАК ПланВыплат
		|		ПО ШаблоныПЗ.Ссылка = ПланВыплат.Ссылка
		|";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Шаблон);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаГрафика = СтруктураДоговора.ГрафикОплаты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаГрафика, Выборка);
			СтрокаГрафика.Этап = СвязьЭтаповСПЗ[Выборка.Ссылка];
			СтрокаГрафика.ИндексСвязиЭтапа = СвязьИндексовЭтаповСПЗ[Выборка.Ссылка];
			
			Если ЗначениеЗаполнено(Выборка.Сумма) И Выборка.Валюта <> СтруктураДоговора.Валюта Тогда
				СтрокаГрафика.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(Выборка.Сумма,
																				Выборка.Валюта, 
																				СтруктураДоговора.Валюта, 
																				СтруктураДоговора.ДатаДокумента);
            КонецЕсли;

			упоУправлениеДоговорамиКлиентСервер.ЗаполнитьВидДвиженияПоСтатье(СтрокаГрафика);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьДатуОплатыГрафикаПлатежей(СтрокаГрафика, ПараметрыРасчета, ДанныеПроекта, ДанныеЭтапа, Этап, ПериодПоПрофилюРаспределения = Неопределено)
	
	ВидПривязки = ПараметрыРасчета.ВидПривязки;
	Задержка = ПараметрыРасчета.Задержка;
	Сутки = 86400;
	
	Если ВидПривязки = Перечисления.упоСпособПривязкиСхемОплаты.НачалоЗадачи Тогда
		
		СтрокаГрафика.ДатаОплаты = ДанныеЭтапа.ДатаНачала + Задержка * Сутки;
		
	ИначеЕсли ВидПривязки = Перечисления.упоСпособПривязкиСхемОплаты.ЗавершениеЗадачи Тогда
		
		СтрокаГрафика.ДатаОплаты = ДанныеЭтапа.ДатаОкончания + Задержка * Сутки;
		
	ИначеЕсли ВидПривязки = Перечисления.упоСпособПривязкиСхемОплаты.ЗавершениеПроекта Тогда
		
		СтрокаГрафика.ДатаОплаты = ДанныеПроекта.ДатаОкончанияПроекта + Задержка * Сутки;
		
	ИначеЕсли ВидПривязки = Перечисления.упоСпособПривязкиСхемОплаты.НачалоПроекта Тогда
		
		СтрокаГрафика.ДатаОплаты = ДанныеПроекта.ДатаНачалаПроекта + Задержка * Сутки;
		
	ИначеЕсли ВидПривязки = Перечисления.упоСпособПривязкиСхемОплаты.НаДату Тогда
		
		СтрокаГрафика.ДатаОплаты = ПараметрыРасчета.ДатаПривязки;
		
	ИначеЕсли ВидПривязки = Перечисления.упоСпособПривязкиСхемОплаты.ПоПрофилюРаспределения Тогда
		
		СтрокаГрафика.ДатаОплаты = ПериодПоПрофилюРаспределения;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаЗаполнитьПоПроектуПоСтруктуре()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТ.ЭтапДоговора КАК ЭтапДоговора,
	|	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ.Проект КАК Проект,
	|	ВТ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ.ИндексСвязиЭтапа КАК ИндексСвязиЭтапа
	|ПОМЕСТИТЬ СвязиЭтаповДоговораСПроектнымКонтуром
	|ИЗ
	|	&СвязиЭтаповДоговораСПроектнымКонтуром КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	|	Проекты.КодСДР КАК КодСДР
	|ПОМЕСТИТЬ втКодыСДР
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	НЕ Проекты.ПометкаУдаления
	|	И Проекты.упоКорневойПроект = &Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот
	|ПОМЕСТИТЬ втСвойстваПЗ
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСрокиПроектныхЗадачСрезПоследних
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	|
	|СГРУППИРОВАТЬ ПО
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСвойстваПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.СуммаВалютная КАК Сумма,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Статья КАК Статья,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ДатаНачисления КАК ДатаПривязки
	|ПОМЕСТИТЬ втЗадачиИБДР
	|ИЗ
	|	втСвойстваПЗ КАК втСвойстваПЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(, Версия = &текВерсия) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	|		ПО втСвойстваПЗ.ПроектнаяЗадача = упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача
	|			И (&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеКонтрагент)
	|			И (&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеДоговорКонтрагента)
	|ГДЕ
	|	(упоАктуальныеПланыДоходовИРасходовСрезПоследних.СуммаВалютная <> 0
	|			ИЛИ упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСвойстваПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СтатьяДДС КАК Статья,
	|	ЕСТЬNULL(упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СуммаВалютная КАК Сумма,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ втДДС
	|ИЗ
	|	втСвойстваПЗ КАК втСвойстваПЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(, Версия = &текВерсия) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
	|		ПО втСвойстваПЗ.ПроектнаяЗадача = упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача
	|			И (&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеКонтрагент)
	|			И (&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеДоговорКонтрагента)
	|ГДЕ
	|	(упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СуммаВалютная <> 0
	|			ИЛИ упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Период) КАК Период,
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Проект КАК Проект,
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПериодыСвязиЭтаповДоговораСПроектнымКонтуром
	|ИЗ
	|	РегистрСведений.упоСвязьЭтаповДоговораСПроектнымКонтуром.СрезПоследних(&ДатаДокумента, Проект = &Проект) КАК упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Проект,
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСвойстваПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	втСвойстваПЗ.ЗадачаРодитель КАК ЗадачаРодитель,
	|	втСвойстваПЗ.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	втСвойстваПЗ.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	втСвойстваПЗ.НазваниеЗадачи КАК НазваниеЗадачи,
	|	втСвойстваПЗ.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	|	втСвойстваПЗ.ЭтоПакетРабот КАК ЭтоПакетРабот,
	|	втЗадачиИБДР.Сумма КАК Сумма,
	|	втЗадачиИБДР.Статья КАК Статья,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА СвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|		ИНАЧЕ упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ЭтапДоговора
	|	КОНЕЦ КАК Этап,
	|	втЗадачиИБДР.Валюта КАК Валюта,
	|	ЕСТЬNULL(втЗадачиИБДР.ДатаПривязки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПривязки
	|ИЗ
	|	втСвойстваПЗ КАК втСвойстваПЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗадачиИБДР КАК втЗадачиИБДР
	|		ПО втСвойстваПЗ.ПроектнаяЗадача = втЗадачиИБДР.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКодыСДР КАК втКодыСДР
	|		ПО втСвойстваПЗ.ПроектнаяЗадача = втКодыСДР.СсылкаНаПроектнуюЗадачу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыСвязиЭтаповДоговораСПроектнымКонтуром КАК ПериодыСвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО втСвойстваПЗ.ПроектнаяЗадача = ПериодыСвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвязьЭтаповДоговораСПроектнымКонтуром.СрезПоследних(&ДатаДокумента, Проект = &Проект) КАК упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних
	|		ПО (ПериодыСвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача = упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ПроектнаяЗадача)
	|			И (ПериодыСвязиЭтаповДоговораСПроектнымКонтуром.Период = упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО втСвойстваПЗ.ПроектнаяЗадача = СвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача
	|
	|УПОРЯДОЧИТЬ ПО
	|	втКодыСДР.КодСДР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДДС.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	втДДС.Статья КАК Статья,
	|	втДДС.ДатаОплаты КАК ДатаОплаты,
	|	втДДС.Сумма КАК Сумма,
	|	втДДС.Валюта КАК Валюта
	|ИЗ
	|	втДДС КАК втДДС";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗаполнитьПоПроекту()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТ.ЭтапДоговора КАК ЭтапДоговора,
	|	ВТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ.Проект КАК Проект,
	|	ВТ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ.ИндексСвязиЭтапа КАК ИндексСвязиЭтапа
	|ПОМЕСТИТЬ СвязиЭтаповДоговораСПроектнымКонтуром
	|ИЗ
	|	&СвязиЭтаповДоговораСПроектнымКонтуром КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	|	Проекты.КодСДР КАК КодСДР
	|ПОМЕСТИТЬ втКодыСДР
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Ссылка В ИЕРАРХИИ(&Проект)
	|	И НЕ Проекты.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот,
	|	СУММА(упоАктуальныеПланыДоходовИРасходовСрезПоследних.СуммаВалютная) КАК Сумма,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Статья КАК Статья,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ДатаНачисления КАК ДатаПривязки
	|ПОМЕСТИТЬ втЗадачиИБДР
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСрокиПроектныхЗадачСрезПоследних
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(, Версия = &текВерсия) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача
	|			И (упоАктуальныеПланыДоходовИРасходовСрезПоследних.ВидЭлемента В (&НаправлениеДвиженияБДР))
	|			И (&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеКонтрагент)
	|			И (&упоАктуальныеПланыДоходовИРасходовСрезПоследнихУсловиеДоговорКонтрагента)
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	|	И (упоАктуальныеПланыДоходовИРасходовСрезПоследних.СуммаВалютная <> 0
	|			ИЛИ упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Статья,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Валюта,
	|	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ДатаНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК ЗадачаРодитель,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СтатьяДДС КАК Статья,
	|	ЕСТЬNULL(упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОплаты,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СуммаВалютная КАК Сумма,
	|	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ втДДС
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(, Версия = &текВерсия) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача
	|			И (упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.НаправлениеДвижения В (&НаправлениеДвиженияБДДС))
	|			И (&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеКонтрагент)
	|			И (&упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследнихУсловиеДоговорКонтрагента)
	|ГДЕ
	|	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	|	И (упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СуммаВалютная <> 0
	|			ИЛИ упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Сумма <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Период) КАК Период,
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Проект КАК Проект,
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ПериодыСвязиЭтаповДоговораСПроектнымКонтуром
	|ИЗ
	|	РегистрСведений.упоСвязьЭтаповДоговораСПроектнымКонтуром.СрезПоследних(&ДатаДокумента, Проект = &Проект) КАК упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Проект,
	|	упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втЗадачиИБДР.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	втЗадачиИБДР.НазваниеЗадачи КАК НазваниеЗадачи,
	|	втЗадачиИБДР.ЗадачаРодитель КАК ЗадачаРодитель,
	|	втЗадачиИБДР.ЭтоПакетРабот КАК ЭтоПакетРабот,
	|	втЗадачиИБДР.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот
	|ПОМЕСТИТЬ втБДРиДДС
	|ИЗ
	|	втЗадачиИБДР КАК втЗадачиИБДР
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втДДС.ПроектнаяЗадача,
	|	втДДС.НазваниеЗадачи,
	|	втДДС.ЗадачаРодитель,
	|	втДДС.ЭтоПакетРабот,
	|	втДДС.ЭтоМодельПакетаРабот
	|ИЗ
	|	втДДС КАК втДДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втБДРиДДС.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	втБДРиДДС.ЗадачаРодитель КАК ЗадачаРодитель,
	|	втЗадачиИБДР.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	втЗадачиИБДР.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	втБДРиДДС.НазваниеЗадачи КАК НазваниеЗадачи,
	|	втБДРиДДС.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	|	втБДРиДДС.ЭтоПакетРабот КАК ЭтоПакетРабот,
	|	втЗадачиИБДР.Сумма КАК Сумма,
	|	втЗадачиИБДР.Статья КАК Статья,
	|	втКодыСДР.КодСДР КАК КодСДР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ЭтапДоговора, ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоЭтапыДоговоров.ПустаяСсылка)
	|			ТОГДА СвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора
	|		ИНАЧЕ упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ЭтапДоговора
	|	КОНЕЦ КАК Этап,
	|	втЗадачиИБДР.Валюта КАК Валюта,
	|	ЕСТЬNULL(втЗадачиИБДР.ДатаПривязки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПривязки
	|ИЗ
	|	втБДРиДДС КАК втБДРиДДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗадачиИБДР КАК втЗадачиИБДР
	|		ПО втБДРиДДС.ПроектнаяЗадача = втЗадачиИБДР.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКодыСДР КАК втКодыСДР
	|		ПО втБДРиДДС.ПроектнаяЗадача = втКодыСДР.СсылкаНаПроектнуюЗадачу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыСвязиЭтаповДоговораСПроектнымКонтуром КАК ПериодыСвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО втБДРиДДС.ПроектнаяЗадача = ПериодыСвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвязьЭтаповДоговораСПроектнымКонтуром.СрезПоследних(&ДатаДокумента, Проект = &Проект) КАК упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних
	|		ПО (ПериодыСвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача = упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.ПроектнаяЗадача)
	|			И (ПериодыСвязиЭтаповДоговораСПроектнымКонтуром.Период = упоСвязьЭтаповДоговораСПроектнымКонтуромСрезПоследних.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиЭтаповДоговораСПроектнымКонтуром КАК СвязиЭтаповДоговораСПроектнымКонтуром
	|		ПО втБДРиДДС.ПроектнаяЗадача = СвязиЭтаповДоговораСПроектнымКонтуром.ПроектнаяЗадача
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСДР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДДС.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	втДДС.Статья КАК Статья,
	|	втДДС.ДатаОплаты КАК ДатаОплаты,
	|	втДДС.Сумма КАК Сумма,
	|	втДДС.Валюта КАК Валюта
	|ИЗ
	|	втДДС КАК втДДС";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти