#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
		
	ЗаполнитьТаблицуФормы();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача", "");
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка,,Ложь);
	
	Объект.Сложность = ЗначениеПоказателяСложность(Объект.ПроектнаяЗадача);		
	
	УстановитьПредставлениеТаблицыФормы();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьПоследняяМодификация();
	
	Если Не ЗначениеЗаполнено (Объект.ДатаЗакрытияЭтапа) Тогда
		Объект.ДатаЗакрытияЭтапа = Объект.Дата;	
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	Оповестить("СменаСтатусаПроектнойЗадачи", Новый Структура("Проект", Объект.Проект), ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
			
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
			
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	СохранитьТаблицуФормы(ТекущийОбъект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	упоУправлениеФормамиКлиент.ОбработатьНажатиеНаГиперссылкуРеквизитаОбъекта(Объект, ЭтаФорма, "ПроектнаяЗадача", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	Объект.ПроектнаяЗадача = ПредопределенноеЗначение("Документ.упоПроектнаяЗадача.ПустаяСсылка");
	
	Объект.Сложность = 0;
	ТаблицаФормы.Очистить();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектнаяЗадачаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Если ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
		ПоказатьЗначение(, Объект.ПроектнаяЗадача);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПриИзменении(Элемент)	
	УстановитьПредставлениеТаблицыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФормыЗначениеОценкиПриИзменении_Подключаемый(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаФормы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;				
	КонецЕсли;	
	
	РассчитатьСреднююОценкуПоСтроке(ТекущиеДанные, КолонкиОценки);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФормыКТУПриИзменении(Элемент)
	
	ТолькоКТУ = Истина;
	ОбновитьИтогиТаблицыФормы(ЭтаФорма, ТолькоКТУ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОценкиТрудозатраты(Команда)
	
	Если ТаблицаФормы.Количество() > 0 Тогда				
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Очистить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Сохранить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьОценкиТрудозатратыЗавершение", ЭтаФорма), 
			НСтр("ru = 'Заполненные оценки и КТУ следует:'"), 
			Кнопки, 
			, 
			КодВозвратаДиалога.Нет);		
	Иначе		
		ЗаполнитьПоДаннымУчета = Истина;	
		ЗаполнитьТаблицуФормы(ЗаполнитьПоДаннымУчета);		
	КонецЕсли;
			
КонецПроцедуры

// Продолжает процесс заполнения оценок после показа вопроса.
//
&НаКлиенте
Процедура ЗаполнитьОценкиТрудозатратыЗавершение(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да ИЛИ Результат = КодВозвратаДиалога.Нет Тогда		
		ЗаполнитьПоДаннымУчета = Истина;
		СохранитьВведенныеЗначения = Результат = КодВозвратаДиалога.Нет;
		
		ЗаполнитьТаблицуФормы(ЗаполнитьПоДаннымУчета, СохранитьВведенныеЗначения);
		
		Модифицированность = Истина;		
	КонецЕсли;					
			
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Объект.Проект = ВыбранноеЗначение.Проект;
		Объект.ПроектнаяЗадача = ВыбранноеЗначение;
		упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача", "");
				
	КонецЕсли;
	
	Объект.Сложность = ЗначениеПоказателяСложность(Объект.ПроектнаяЗадача);
	
	ЗаполнитьПоДаннымУчета = Истина;
	ЗаполнитьТаблицуФормы(ЗаполнитьПоДаннымУчета);	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТаблицуФормы(ТекущийОбъект)
	
	ТекущийОбъект.ОценкиИсполнителейПодрядчиков.Очистить();	
	ТекущийОбъект.Трудозатраты.Очистить();
	
	Для Каждого ОценкаИсполнителяПодрядчика Из ТаблицаФормы Цикл
		
		ЕстьОценки = Ложь;
		
		Для Каждого КолонкаОценки Из КолонкиОценки Цикл
			Оценка = ОценкаИсполнителяПодрядчика[КолонкаОценки.Ключ];
			Если ЗначениеЗаполнено(Оценка) Тогда			
				НоваяСтрока = ТекущийОбъект.ОценкиИсполнителейПодрядчиков.Добавить();				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ОценкаИсполнителяПодрядчика);	
				НоваяСтрока.Оценка = Оценка;
				НоваяСтрока.ЗначениеОценки = ОценкаИсполнителяПодрядчика[КолонкаОценки.Ключ + "_Значение"];
				НоваяСтрока.Вес = ОценкаИсполнителяПодрядчика[КолонкаОценки.Ключ + "_Вес"];								
				
				ЕстьОценки = Истина;
			КонецЕсли;	
		КонецЦикла;
		
		Если ЕстьОценки = Ложь Тогда
			НоваяСтрока = ТекущийОбъект.ОценкиИсполнителейПодрядчиков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОценкаИсполнителяПодрядчика);
		КонецЕсли;	
		
		НоваяСтрока = ТекущийОбъект.Трудозатраты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОценкаИсполнителяПодрядчика);	
		
	КонецЦикла;	
	
КонецПроцедуры	

// Вывод оценок и трудозатрат в сводную таблицу формы.
//
&НаСервере
Процедура ДобавитьКолонкиОценокВТаблицуФормы(ОценкиИсполнителей)
		
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	ТипОценки = Новый ОписаниеТипов("СправочникСсылка.упоОценкиИсполнителейПодрядчиков");
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Если КолонкиОценки = Неопределено Тогда
		КолонкиОценки = Новый Структура;
	КонецЕсли;
					
	ИмяТаблицы = "ТаблицаФормы";	
	ПутьКТаблице = "ТаблицаФормы.";	
	
	// Очистка колонок при повторном заполнении.
	Если КолонкиОценки.Количество() > 0 Тогда
		Для Каждого КолонкаОценки Из КолонкиОценки Цикл		
			ИмяКолонки = ПутьКТаблице + КолонкаОценки.Ключ;
			УдаляемыеРеквизиты.Добавить(ИмяКолонки);
			УдаляемыеРеквизиты.Добавить(ИмяКолонки + "_Вес");
			УдаляемыеРеквизиты.Добавить(ИмяКолонки + "_Значение");
						
			ИмяЭлемента = ИмяТаблицы + КолонкаОценки.Ключ;
			Элементы.Удалить(Элементы[ИмяЭлемента]);				
		КонецЦикла;		
		КолонкиОценки.Очистить();														
	КонецЕсли;	
	
	Сч = 1;
	Для Каждого Оценка Из ОценкиИсполнителей Цикл
		
		Если НЕ ЗначениеЗаполнено(Оценка) Тогда		
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = "Оценка" + Сч;				
		ПолноеИмяКолонки = ИмяТаблицы + ИмяКолонки;
		ЗаголовокКолонки = Строка(Оценка);
						
		Реквизит = Новый РеквизитФормы(ИмяКолонки, ТипОценки, ИмяТаблицы, ЗаголовокКолонки);			
		ДобавляемыеРеквизиты.Добавить(Реквизит);			
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "_Вес", ТипЧисло, ИмяТаблицы, "Вес");			
		ДобавляемыеРеквизиты.Добавить(Реквизит);			
		Реквизит = Новый РеквизитФормы(ИмяКолонки + "_Значение", ТипЧисло, ИмяТаблицы, ЗаголовокКолонки);			
		ДобавляемыеРеквизиты.Добавить(Реквизит);				
		
		КолонкиОценки.Вставить(ИмяКолонки, Оценка);				
		
		Сч = Сч + 1;
		
	КонецЦикла;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
				
		ПредыдущийЭлемент = Неопределено;
		
		НаборКолонокОценки = Новый Массив;
		НаборКолонокОценки.Добавить("_Значение");
		НаборКолонокОценки.Добавить("_Вес");
		
		Для Каждого КолонкаОценки Из КолонкиОценки Цикл
			
			ПолноеИмяГруппы = ИмяТаблицы + КолонкаОценки.Ключ;			
			ГруппаКолонок = Элементы.Найти(ПолноеИмяГруппы);	 
			Если ГруппаКолонок <> Неопределено Тогда																										
				Продолжить;
			КонецЕсли;							
			
			ГруппаКолонок = Элементы.Вставить(ПолноеИмяГруппы, Тип("ГруппаФормы"), Элементы.ТаблицаФормыГруппаОценки, ПредыдущийЭлемент);
			ГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;			
			ГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
			ГруппаКолонок.Ширина = 10;			
			ГруппаКолонок.РастягиватьПоГоризонтали = Ложь;		
			ГруппаКолонок.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1, Вес оценки", КолонкаОценки.Значение);
			ГруппаКолонок.ШрифтЗаголовка = Новый Шрифт(ГруппаКолонок.ШрифтЗаголовка,, 9);
			ГруппаКолонок.ОтображатьВШапке = Истина;
			
			ПредыдущийЭлемент = ГруппаКолонок;																							
			
			Для Каждого КолонкаНабора Из НаборКолонокОценки Цикл
				
				ИмяКолонки = КолонкаОценки.Ключ + КолонкаНабора;
				ПолноеИмяКолонки = ИмяТаблицы + ИмяКолонки;
				
				ЭлементКолонки = Элементы.Добавить(ПолноеИмяКолонки, Тип("ПолеФормы"), ГруппаКолонок);					
				ЭлементКолонки.Ширина = 5;				
				ЭлементКолонки.АвтоМаксимальнаяШирина = Ложь;
				ЭлементКолонки.МаксимальнаяШирина = 5;				
				ЭлементКолонки.ПутьКДанным = ПутьКТаблице + ИмяКолонки;			
				ЭлементКолонки.ОтображатьВШапке = Ложь;				
				Если КолонкаНабора = "_Значение" Тогда
					ЭлементКолонки.Вид = ВидПоляФормы.ПолеВвода;
					ЭлементКолонки.УстановитьДействие("ПриИзменении", "ТаблицаФормыЗначениеОценкиПриИзменении_Подключаемый");
				Иначе
					ЭлементКолонки.Вид = ВидПоляФормы.ПолеНадписи;					
				КонецЕсли;			
				
			КонецЦикла;							
			
		КонецЦикла;
		
		// Отключаем колонку-заглушку.
		Элементы.ТаблицаФормыНадписьНетОценок.Видимость = Ложь;
					
	КонецЕсли;	
	
	Если ОценкиИсполнителей.Количество() > 0 Тогда
		Элементы.ТаблицаФормыСредняяОценка.ФиксацияВТаблице = ФиксацияВТаблице.Право;
	Иначе 
		Элементы.ТаблицаФормыСредняяОценка.ФиксацияВТаблице = ФиксацияВТаблице.Нет
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
			
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлементаУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("ТаблицаФормыТрудозатратыПроцент");
	ПолеЭлементаУО = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("ТаблицаФормыКТУ");
	
	ОтборЭлементаУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлементаУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаФормы.Роль");
	ОтборЭлементаУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;						
	ОтборЭлементаУО.ПравоеЗначение = Перечисления.упоПредметыОценки.Подрядчик;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветНедоступнойСтрокиДокумента());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//	
	
	ИмяТаблицы = "ТаблицаФормы";	
	ПутьКТаблице = "ТаблицаФормы.";		
	
	НаборКолонокОценки = Новый Массив;
	НаборКолонокОценки.Добавить("_Значение");
	НаборКолонокОценки.Добавить("_Вес");
	
	Для Каждого КолонкаОценки Из ЭтаФорма.КолонкиОценки Цикл
						
		ЭлементУО = УсловноеОформление.Элементы.Добавить();				
		
		Для Каждого КолонкаНабора Из НаборКолонокОценки Цикл			
			ИмяКолонки = КолонкаОценки.Ключ + КолонкаНабора;
			ПолноеИмяКолонки = ИмяТаблицы + ИмяКолонки;										
			
			ПолеЭлементаУО = ЭлементУО.Поля.Элементы.Добавить();
			ПолеЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ПолноеИмяКолонки);								
		КонецЦикла;							
		
		// Засеривание оценок, недоступных для роли.
		ОтборЭлементаУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлементаУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКТаблице + КолонкаОценки.Ключ);
		ОтборЭлементаУО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;						
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветНедоступнойСтрокиДокумента());
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуФормы(ЗаполнитьПоДаннымУчета = Ложь, СохранитьВведенныеЗначения = Ложь)
	
	Если НЕ ПолучитьФункциональнуюОпцию("упоИспользоватьОценкуИсполнителейПодрядчиков") Тогда
		Возврат;
	КонецЕсли;					
	
	ОценкиРолей.Очистить();
	
	ОценкиЭтапа = Объект.ОценкиИсполнителейПодрядчиков.Выгрузить();
	
	Если ЗаполнитьПоДаннымУчета Тогда					
		
		Если Не ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
			Возврат;
		КонецЕсли;	
		
		ТаблицыОценки = Новый Структура;
		Если СохранитьВведенныеЗначения Тогда
			ТаблицыОценки.Вставить("Оценки", ОценкиЭтапа);
			ТаблицыОценки.Вставить("Трудозатраты", Объект.Трудозатраты.Выгрузить());
		КонецЕсли;
		
		Результат = Документы.упоЗакрытиеЭтапа.ТаблицыОценокИТрудозатрат(Объект.ПроектнаяЗадача, ТаблицыОценки);		
		ОценкиЭтапа = Результат.Оценки;
		ТрудозатратыЭтапа = Результат.Трудозатраты;
		
		Объект.Трудозатраты.Очистить();	
		Объект.ОценкиИсполнителейПодрядчиков.Очистить();
		
		Если ТрудозатратыЭтапа.Количество() > 0 Тогда					
			Объект.Трудозатраты.Загрузить(ТрудозатратыЭтапа);				
		КонецЕсли;	
		Если ОценкиЭтапа.Количество() > 0 Тогда
			Объект.ОценкиИсполнителейПодрядчиков.Загрузить(ОценкиЭтапа);						
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ОценкиЭтапа.Количество() > 0 Тогда
		ОценкиРолей.Загрузить(СвернутаяТаблица(ОценкиЭтапа, "Оценка,Роль"));
	КонецЕсли;	
		
	ДобавитьКолонкиОценокВТаблицуФормы(МассивУникальныхПоТаблицеЗначений(ОценкиЭтапа, "Оценка", " УБЫВ"));
	
	УстановитьУсловноеОформление();
	
	ЗагрузитьДанныеВТаблицуФормы(ОценкиЭтапа);			
		
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьДанныеВТаблицуФормы(ОценкиИсполнителей)
		
	ТрудозатратыИсполнителей = Объект.Трудозатраты;
	
	ТаблицаФормы.Очистить();
	
	КолонкиОтбора = "ИсполнительПодрядчик,Роль";
	ТрудовыеРесурсыЭтапа = СвернутаяТаблица(ОценкиИсполнителей, КолонкиОтбора);
	
	Отбор = Новый Структура(КолонкиОтбора);
	
	ОценкиВКолонках = СоответствиеПоСтруктуре(КолонкиОценки);		
	
	Для Каждого ТрудовойРесурс Из ТрудовыеРесурсыЭтапа Цикл
		
		// Оценки.
		
		СтрокаОценки = ТаблицаФормы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОценки, ТрудовойРесурс);
		СтрокаОценки.НетОценок = Истина;
		
		ЗаполнитьЗначенияСвойств(Отбор, ТрудовойРесурс);
		НайденныеОценкиИсполнителя = ОценкиИсполнителей.НайтиСтроки(Отбор);				
		СуммарнаяОценка = 0;
		Для Каждого ОценкаИсполнителя Из НайденныеОценкиИсполнителя Цикл			
			ИмяКолонки = ОценкиВКолонках[ОценкаИсполнителя.Оценка];
			Если ИмяКолонки <> Неопределено Тогда
				СтрокаОценки[ИмяКолонки] = ОценкаИсполнителя.Оценка;
				СтрокаОценки[ИмяКолонки + "_Вес"] = ОценкаИсполнителя.Вес;
				СтрокаОценки[ИмяКолонки + "_Значение"] = ОценкаИсполнителя.ЗначениеОценки;				
				
				СтрокаОценки.НетОценок = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаОценки.НетОценок = Ложь Тогда
			РассчитатьСреднююОценкуПоСтроке(СтрокаОценки, КолонкиОценки);
		КонецЕсли;	
		
		// Трудозатраты.
		
		НайденныеТрудозатратыИсполнителя = ТрудозатратыИсполнителей.НайтиСтроки(Отбор);
		Если НайденныеТрудозатратыИсполнителя.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОценки, НайденныеТрудозатратыИсполнителя[0]);	
		КонецЕсли;	
		
	КонецЦикла;	
	
	ОбновитьИтогиТаблицыФормы(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьПредставлениеТаблицыФормы()
		
	Элементы.ТаблицаФормыГруппаТрудозатраты.Видимость = Представление = 0;	
	Элементы.ТаблицаФормыГруппаОценки.Видимость = Представление = 1;	
	Элементы.ТаблицаФормы.Подвал = Представление = 0;
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтогиТаблицыФормы(Форма, ТолькоКТУ = Ложь)
	
	Если НЕ ТолькоКТУ Тогда
		Форма.ТрудозатратыИтого = Форма.ТаблицаФормы.Итог("Трудозатраты");
		Форма.ТрудозатратыПроцентИтого = Форма.ТаблицаФормы.Итог("ТрудозатратыПроцент");
	КонецЕсли;	
	Форма.КТУИтого = Форма.ТаблицаФормы.Итог("КТУ");
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСреднююОценкуПоСтроке(СтрокаДанных, КолонкиОценки)
	
	ОбщаяСумма = 0;
	ОбщийВес = 0;
	Для Каждого КолонкаОценки Из КолонкиОценки Цикл
		Если ЗначениеЗаполнено(СтрокаДанных[КолонкаОценки.Ключ]) Тогда
			ОбщийВес = ОбщийВес + СтрокаДанных[КолонкаОценки.Ключ + "_Вес"];
			ОбщаяСумма = ОбщаяСумма + СтрокаДанных[КолонкаОценки.Ключ + "_Значение"] * СтрокаДанных[КолонкаОценки.Ключ + "_Вес"];					
		КонецЕсли;	
	КонецЦикла;	
		
	СтрокаДанных.СредняяОценка = ?(ОбщийВес = 0, 0, ОбщаяСумма/ОбщийВес);	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СоответствиеПоСтруктуре(ИсходнаяСтруктура)
	
	НовоеСоответствие = Новый Соответствие;
	
	Для Каждого ЗначениеСтруктуры Из ИсходнаяСтруктура Цикл
		НовоеСоответствие.Вставить(ЗначениеСтруктуры.Значение, ЗначениеСтруктуры.Ключ);		
	КонецЦикла;
	
	Возврат НовоеСоответствие;
	
КонецФункции

&НаСервереБезКонтекста
Функция СвернутаяТаблица(Таблица, КолонкиСвертки)
	
	КопияТаблицы = Новый ТаблицаЗначений;
	
	КолонкиОтбора = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КолонкиСвертки,,,Истина);
	КолонкиТаблицы = Таблица.Колонки;
	Для Каждого КолонкаОтбора Из КолонкиОтбора Цикл
		Если КолонкиТаблицы.Найти(КолонкаОтбора) = Неопределено Тогда
			Возврат КопияТаблицы;	
		КонецЕсли;	
	КонецЦикла;	
	
	КопияТаблицы = Таблица.Скопировать(, КолонкиСвертки);
	КопияТаблицы.Свернуть(КолонкиСвертки);
	
	Возврат КопияТаблицы;
	
КонецФункции	

&НаСервереБезКонтекста
Функция МассивУникальныхПоТаблицеЗначений(Таблица, ИмяКолонки, Направление = " ВОЗР")
	
	МассивУникальных = Новый Массив;
	
	Если Таблица.Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
		КопияТаблицы = СвернутаяТаблица(Таблица, ИмяКолонки);	
		КопияТаблицы.Сортировать(ИмяКолонки + Направление);
		
		МассивУникальных = КопияТаблицы.ВыгрузитьКолонку(ИмяКолонки);	
	КонецЕсли;	
	
	Возврат МассивУникальных;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ЗначениеПоказателяСложность(ПроектнаяЗадача)
		
	Возврат Документы.упоЗакрытиеЭтапа.ЗначениеПоказателяСложность(ПроектнаяЗадача);
	
КонецФункции	

&НаСервереБезКонтекста
Функция ЦветНедоступнойСтрокиДокумента()
	
	Возврат ЦветаСтиля.упоФонНедоступнойСтрокиДокумента;	
	
КонецФункции	

#КонецОбласти
