
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
            
    УстановитьВидимостьЭлементовПоНД();
    УстановитьВидимостьЭлементовПоПодразделениям();           
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
    
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
    
    упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
    
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    
    упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
    
КонецПроцедуры   

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
    
    упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
    
    упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    
    упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
    
    упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
    
    упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);
    
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);		
    
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    
    упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
    
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    
    упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    
    упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)  
  	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
    
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
    
    упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
    
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
    
    упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
    
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
    
    упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
    
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
    
    упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособРаспределенияПоНаправлениямДеятельностиПриИзменении(Элемент)   
    
    УстановитьВидимостьЭлементовПоНД();
    УстановитьВидимостьЭлементовПоПодразделениям();
    
КонецПроцедуры

&НаКлиенте
Процедура СпособРаспределенияПоПодразделениямПриИзменении(Элемент)
    
    УстановитьВидимостьЭлементовПоНД();
    УстановитьВидимостьЭлементовПоПодразделениям();
    
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьПоПрямымСтатьямPM(Команда)
          
    РезультатВыполнения = ПоказатьВопросЗаполнитьТаблицуСтатьиРасходов("ПоПрямымСтатьямPM");
    
    Если НЕ РезультатВыполнения.ПродолжитьВыполнение Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьПоНастройкеСтатейPM("ПоПрямымСтатьямPM");    
    
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоСтатьямФОТ(Команда)
    
    РезультатВыполнения = ПоказатьВопросЗаполнитьТаблицуСтатьиРасходов("ПоСтатьямФОТ");
    
    Если НЕ РезультатВыполнения.ПродолжитьВыполнение Тогда
        Возврат;
    КонецЕсли;
    
    ЗаполнитьПоНастройкеСтатейPM("ПоСтатьямФОТ");    
    
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КоллекцияЭлементовФормыНД()

    Результат = Новый Структура; 
    
    Результат.Вставить("СтатьяПрямыхРасходов", Ложь);    
    Результат.Вставить("ГруппаСтатьиРасходов", Ложь);
    Результат.Вставить("ГруппаКоэффициентыНД", Ложь);
    Результат.Вставить("ГруппаКоэффициентыПодразделений", Ложь);
    
	Возврат Результат; 

КонецФункции // КоллекцияЭлементовФормыНД() 

&НаСервере
Процедура УстановитьВидимостьЭлементовПоНД()
    
    КоллекцияЭлементов = КоллекцияЭлементовФормыНД();
    СпособРаспределенияПоНаправлениямДеятельности = Объект.СпособРаспределенияПоНаправлениямДеятельности;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
		Элементы.СпособРаспределенияПоНаправлениямДеятельности.Заголовок = "Способ распределения по проектам";
		Элементы.ГруппаКоэффициентыНД.Заголовок = "Коэффициенты: проектные задачи";
	КонецЕсли;	
	
    Если Объект.Ссылка = Справочники.упоСпособыРаспределенияРасходовПоПроектам.ФормироватьНЗП Тогда
        
        Элементы.СпособРаспределенияПоНаправлениямДеятельности.Видимость = Ложь;
        Элементы.СпособРаспределенияПоПодразделениям.Видимость = Ложь;
            
    ИначеЕсли СпособРаспределенияПоНаправлениямДеятельности = ПредопределенноеЗначение("Перечисление.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности.ПоПрямымРасходам") Тогда
                
        КоллекцияЭлементов.ГруппаСтатьиРасходов = Ложь;
        КоллекцияЭлементов.ГруппаКоэффициентыНД = Ложь;
        
    ИначеЕсли СпособРаспределенияПоНаправлениямДеятельности = ПредопределенноеЗначение("Перечисление.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности.ПоУказаннымСтатьям") Тогда
                
        КоллекцияЭлементов.ГруппаСтатьиРасходов = Истина;
        КоллекцияЭлементов.ГруппаКоэффициентыНД = Ложь;
        
    ИначеЕсли СпособРаспределенияПоНаправлениямДеятельности = ПредопределенноеЗначение("Перечисление.упоВидРаспределенияОПРиОХРпоНаправлениямДеятельности.ПоКоэффициентам") Тогда
                
        КоллекцияЭлементов.ГруппаСтатьиРасходов = Ложь;
        КоллекцияЭлементов.ГруппаКоэффициентыНД = Истина;
		
		Если упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов() Тогда
			Элементы.КоэффициентыНДНаправлениеДеятельности.Видимость = Ложь;
		КонецЕсли;	
        
    КонецЕсли;                        
    
    Для Каждого ИмяВидимость Из КоллекцияЭлементов Цикл 
        Элементы[ИмяВидимость.Ключ].Видимость = ИмяВидимость.Значение;
    КонецЦикла;                                  
    
КонецПроцедуры // УстановитьВидимостьЭлементовПоНД()

&НаСервере
Процедура УстановитьВидимостьЭлементовПоПодразделениям()

    НаУказанныеПодразделения = Объект.СпособРаспределенияПоПодразделениям = ПредопределенноеЗначение("Перечисление.упоВидРаспределенияОПРиОХРпоПодразделениям.НаУказанныеПодразделения");
    ВидимостьКоэффициентыПодр = Объект.СпособРаспределенияПоПодразделениям = ПредопределенноеЗначение("Перечисление.упоВидРаспределенияОПРиОХРпоПодразделениям.ПоКоэффициентам");
     
    Элементы.ГруппаПодразделения.Видимость = НаУказанныеПодразделения;
    Элементы.ГруппаКоэффициентыПодразделений.Видимость = ВидимостьКоэффициентыПодр;
    
КонецПроцедуры

&НаКлиенте
Функция ПоказатьВопросЗаполнитьТаблицуСтатьиРасходов(ТипОперации)

	Результат = Новый Структура("ПродолжитьВыполнение", Истина); 
    
    Если Объект.СтатьиРасходов.Количество() Тогда
        
        ДополнительныеПараметры = Новый Структура;
        ДополнительныеПараметры.Вставить("ТипОперации", ТипОперации);
        
        ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВопросЗаполнитьТаблицуСтатьиРасходовЗавершение", ЭтаФорма, ДополнительныеПараметры);
        ТекстВопроса = НСтр("ru = 'Очистить табличную часть перед заполнением?'");
        
        Кнопки = Новый СписокЗначений;
        Кнопки.Добавить("Очистить",НСтр("ru = 'Очистить'"));
        Кнопки.Добавить("Дополнить",НСтр("ru = 'Дополнить'"));
        Кнопки.Добавить("Отмена",НСтр("ru = 'Отмена'"));
        
        ПоказатьВопрос(
            ОписаниеОповещенияОЗавершении,
            ТекстВопроса,
            Кнопки
            );     
            
        Результат.ПродолжитьВыполнение = Ложь;            
            
    КонецЕсли;

    Возврат Результат;
    
КонецФункции // ПоказатьВопросЗаполнитьТаблицуСтатьиРасходов()
  
&НаКлиенте
Процедура ВопросЗаполнитьТаблицуСтатьиРасходовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
    
    Если РезультатВопроса = Неопределено
        ИЛИ РезультатВопроса = "Отмена" Тогда
        Возврат;
    КонецЕсли; 
    
    Если РезультатВопроса = "Очистить" Тогда 
        Объект.СтатьиРасходов.Очистить();
    КонецЕсли; 
    
    ТипОперации = Неопределено;
    ДополнительныеПараметры.Свойство("ТипОперации", ТипОперации);
    ЗаполнитьПоНастройкеСтатейPM(ТипОперации);
                
КонецПроцедуры // ВопросЗаполнитьТаблицуСтатьиРасходовЗавершение()

&НаСервере
Процедура ЗаполнитьПоНастройкеСтатейPM(ТипОперации)

    Если ТипОперации = "ПоПрямымСтатьямPM" Тогда
        СтрокаИсточник = "упоСтатьиПрямыхРасходов";
    ИначеЕсли ТипОперации = "ПоСтатьямФОТ" Тогда
        СтрокаИсточник = "упоСтатьиФОТ";
    КонецЕсли;  

    ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |    Регистр.Статья КАК Статья
    |ИЗ
    |    РегистрСведений.%1 КАК Регистр";
    ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, СтрокаИсточник);
        
	Запрос = Новый Запрос(ТекстЗапроса);        
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.СтатьиРасходов.Добавить(); 
        НоваяСтрока.СтатьяРасходов = Выборка.Статья;
    КонецЦикла;

КонецПроцедуры // ЗаполнитьПоНастройкеСтатейPM()

#КонецОбласти 