
#Область СлужебныйПрограммныйИнтерфейс

#Область Документ_ОтражениеЗарплатыВФинУчете_Получение

Процедура ДобавитьПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение(ПравилаКонвертации) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИмяПКО", "Документ_ОтражениеЗарплатыВФинУчете_Получение");
	ПараметрыОтбора.Вставить("ОбъектДанных", Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете);
	ПараметрыОтбора.Вставить("ОбъектФормата", "Документ.ОтражениеЗарплатыВФинансовомУчете");
	ПараметрыОтбора.Вставить("ПриКонвертацииДанныхXDTO", "ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПриКонвертацииДанныхXDTO");
	ПараметрыОтбора.Вставить("ПередЗаписьюПолученныхДанных", "ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПередЗаписьюПолученныхДанных");
	ПараметрыОтбора.Вставить("ВариантИдентификации", "ПоУникальномуИдентификатору");
	
	Найдено = ПравилаКонвертации.НайтиСтроки(ПараметрыОтбора);
	Если НЕ Найдено.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонвертации = Найдено[0];
	
	///////////////////////////////////////////////////////////////
	СтрокаТаблицы = ПравилоКонвертации.СвойстваТабличныхЧастей.Найти("НачисленнаяЗарплатаИВзносы", "ТЧКонфигурации");
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СвойстваТЧ = СтрокаТаблицы.Свойства;
		ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "", 1, "Справочник_ФизическиеЛица_Получение");
	КонецЕсли;
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "НачисленнаяЗарплатаИВзносыПоФизлицам", "");
	ДобавитьПКС(СвойстваТЧ, "ВзносыВсего", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ВидНачисленияОплатыТрудаДляНУ", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ВидОперации", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ОблагаетсяЕНВД", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПодразделениеПредприятия", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРДоПредельнойВеличины", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРНаДоплатуЛетчикам", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРНаДоплатуШахтерам", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРНакопительная", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРПоСуммарномуТарифу", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРСПревышения", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ПФРСтраховая", "", 1);
	ДобавитьПКС(СвойстваТЧ, "СпособОтраженияЗарплатыВБухучете", "", 1, "Справочник_СпособыОтраженияЗарплатыВБухУчете");
	ДобавитьПКС(СвойстваТЧ, "СпособРасчетов", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ТФОМС", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФСС", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФССНесчастныеСлучаи", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФФОМС", "", 1);
	ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "", 1, "Справочник_ФизическиеЛица_Получение");
	ДобавитьПКС(СвойстваТЧ, "упоНачислениеЗУП", "", 1);
	ДобавитьПКС(СвойстваТЧ, "упоНачислениеPM", "", 1);
	
	// НачисленныйНДФЛ.
	СтрокаТаблицы = ПравилоКонвертации.СвойстваТабличныхЧастей.Найти("НачисленныйНДФЛ", "ТЧКонфигурации");
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СвойстваТЧ = СтрокаТаблицы.Свойства;
		ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "", 1, "Справочник_ФизическиеЛица_Получение");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСвойстваДопИнформация = "AdditionalInfo";
	ДополнительныеСвойства = Неопределено;
	
	Если НЕ ДанныеXDTO.Свойство(ИмяСвойстваДопИнформация, ДополнительныеСвойства)
		И НЕ ТипЗнч(ДополнительныеСвойства) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные.Сводно = Ложь;
	ПолученныеДанные.ПроводкиПоРаботникам = Истина;
	
	ВидыОперацийПоЗарплатеЗначения = Метаданные.Перечисления["ВидыОперацийПоЗарплате"].ЗначенияПеречисления;
	ВидыНачисленияОплатыТрудаДляНУЗначения = Метаданные.Перечисления["ВидыНачисленийОплатыТрудаДляНУ"].ЗначенияПеречисления;
	СпособыРасчетовСФизическимиЛицами = Метаданные.Перечисления["СпособыРасчетовСФизическимиЛицами"].ЗначенияПеречисления;
	
	// НачисленнаяЗарплатаИВзносы.
	НачисленнаяЗарплатаИВзносыXDTO = Неопределено;
	Если ДанныеXDTO.Свойство("НачисленнаяЗарплатаИВзносы", НачисленнаяЗарплатаИВзносыXDTO)
		И ЗначениеЗаполнено(НачисленнаяЗарплатаИВзносыXDTO) Тогда
		
		МассивНачисленнаяЗарплатаИВзносыПоФизлицам = Новый Массив;
		
		Для Каждого СтрокаНачисленнаяЗарплатаИВзносыXDTO Из НачисленнаяЗарплатаИВзносыXDTO Цикл
			
			СтрокаНачисленнаяЗарплатаИВзносы = Новый Структура;
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФизическоеЛицо");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПодразделениеПредприятия");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ВидОперации");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("СпособОтраженияЗарплатыВБухучете");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ОблагаетсяЕНВД");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("Сумма");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ВзносыВсего");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ВидНачисленияОплатыТрудаДляНУ");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРСтраховая");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРНакопительная");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРПоСуммарномуТарифу");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРНаДоплатуЛетчикам");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРНаДоплатуШахтерам");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФСС");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФФОМС");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ТФОМС");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ФССНесчастныеСлучаи");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРДоПредельнойВеличины");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРСПревышения");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка");
			СтрокаНачисленнаяЗарплатаИВзносы.Вставить("СпособРасчетов");
			
			ЗаполнитьЗначенияСвойств(СтрокаНачисленнаяЗарплатаИВзносы, СтрокаНачисленнаяЗарплатаИВзносыXDTO);
			СтрокаНачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете = СтрокаНачисленнаяЗарплатаИВзносыXDTO.СпособОтраженияЗарплатыВФинансовомУчете;
			
			СтрокаПодразделениеXDTO = Новый Структура("Подразделение");
			ЗаполнитьЗначенияСвойств(СтрокаПодразделениеXDTO, СтрокаНачисленнаяЗарплатаИВзносыXDTO);
			Если ЗначениеЗаполнено(СтрокаПодразделениеXDTO.Подразделение)
				И ТипЗнч(СтрокаПодразделениеXDTO.Подразделение) = Тип("Структура") Тогда
				Если СтрокаПодразделениеXDTO.Подразделение.Свойство("Ссылка") Тогда
					СтрокаНачисленнаяЗарплатаИВзносы.ПодразделениеПредприятия = Новый Структура("Значение, ИмяПКО",
							СтрокаПодразделениеXDTO.Подразделение, "Справочник_Подразделения_Получение");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНачисленнаяЗарплатаИВзносы.ВидОперации) Тогда
				ВидОперацииМД = ВидыОперацийПоЗарплатеЗначения.Найти(СтрокаНачисленнаяЗарплатаИВзносы.ВидОперации);
				Если Не ВидОперацииМД = Неопределено Тогда
					СтрокаНачисленнаяЗарплатаИВзносы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Получить(ВидыОперацийПоЗарплатеЗначения.Индекс(ВидОперацииМД));
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ) Тогда
				ВидНачисленияОплатыТрудаДляНУМД = ВидыНачисленияОплатыТрудаДляНУЗначения.Найти(СтрокаНачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ);
				Если Не ВидНачисленияОплатыТрудаДляНУМД = Неопределено Тогда
					СтрокаНачисленнаяЗарплатаИВзносы.ВидНачисленияОплатыТрудаДляНУ =
						Перечисления.ВидыНачисленийОплатыТрудаДляНУ.Получить(ВидыНачисленияОплатыТрудаДляНУЗначения.Индекс(ВидНачисленияОплатыТрудаДляНУМД));
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаНачисленнаяЗарплатаИВзносы.СпособРасчетов) Тогда
				СпособРасчетовМД = СпособыРасчетовСФизическимиЛицами.Найти(СтрокаНачисленнаяЗарплатаИВзносы.СпособРасчетов);
				Если Не СпособРасчетовМД = Неопределено Тогда
					МенеджерСпособыРасчетовСФизическимиЛицами = ОбщегоНазначения.ОбщийМодуль("Перечисления.СпособыРасчетовСФизическимиЛицами");
					СтрокаНачисленнаяЗарплатаИВзносы.СпособРасчетов =
						МенеджерСпособыРасчетовСФизическимиЛицами.Получить(СпособыРасчетовСФизическимиЛицами.Индекс(СпособРасчетовМД));
				КонецЕсли;
			КонецЕсли;
			
			МенеджерОтражениеЗарплатыВФинансовомУчете = ОбщегоНазначения.ОбщийМодуль("Документы.ОтражениеЗарплатыВФинансовомУчете");
			КолонкиДляСуммированияСтрокой = МенеджерОтражениеЗарплатыВФинансовомУчете.КолонкиДляСуммирования();
			КолонкиДляСуммирования = Новый Структура(КолонкиДляСуммированияСтрокой);
			
			СтрокаНачисленнаяЗарплатаИВзносы.ВзносыВсего = 0;
			Для Каждого Колонка Из КолонкиДляСуммирования Цикл
				Если СтрокаНачисленнаяЗарплатаИВзносы[Колонка.Ключ] = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаНачисленнаяЗарплатаИВзносы.ВзносыВсего = СтрокаНачисленнаяЗарплатаИВзносы.ВзносыВсего
					+ СтрокаНачисленнаяЗарплатаИВзносы[Колонка.Ключ];
			КонецЦикла;
			
			МассивНачисленнаяЗарплатаИВзносыПоФизлицам.Добавить(СтрокаНачисленнаяЗарплатаИВзносы);
			
		КонецЦикла;
		
		///////////////////////////////////////////////////////////////
		Если МассивНачисленнаяЗарплатаИВзносыПоФизлицам.Количество() Тогда
			
			МассивНачисленийТаблицы = Неопределено;
			Если ДополнительныеСвойства.Свойство("НачисленнаяЗарплатаИВзносы", МассивНачисленийТаблицы)
				И НЕ МассивНачисленийТаблицы = Неопределено Тогда
				
				КартаНачислений = Новый Соответствие;
				
				ИмяКолонкиНачислениеPM = "упоНачислениеPM";
				ИмяКолонкиНачислениеЗУП = "упоНачислениеЗУП";
				Индекс = 0;
				
				СоответствиеНачисленийPM = упоРаспределениеЗарплатыНастройкиСервер.ПолучитьСоответствиеНачисленийPM();
				
				Для Каждого СтруктураСтрокаНачисление Из МассивНачисленийТаблицы Цикл
					СсылкаНачислениеЗУП = ПолучитьНачислениеЗУП(СтруктураСтрокаНачисление);
					
					ДанныеНачислений = Новый Структура;
					ДанныеНачислений.Вставить(ИмяКолонкиНачислениеPM, СоответствиеНачисленийPM.Получить(СсылкаНачислениеЗУП));
					ДанныеНачислений.Вставить(ИмяКолонкиНачислениеЗУП, СсылкаНачислениеЗУП);
					
					КартаНачислений.Вставить(Индекс, ДанныеНачислений);
					Индекс = Индекс + 1;
				КонецЦикла;
				
				Индекс = 0;
				Для Каждого Строка Из МассивНачисленнаяЗарплатаИВзносыПоФизлицам Цикл
					ДанныеНачислений = КартаНачислений.Получить(Индекс);
					Индекс = Индекс + 1;
					Если НЕ ДанныеНачислений = Неопределено Тогда
						Строка.Вставить(ИмяКолонкиНачислениеPM, ДанныеНачислений[ИмяКолонкиНачислениеPM]);
						Строка.Вставить(ИмяКолонкиНачислениеЗУП, ДанныеНачислений[ИмяКолонкиНачислениеЗУП]);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////
		ПолученныеДанные.ДополнительныеСвойства.Вставить("НачисленнаяЗарплатаИВзносыПоФизлицам", МассивНачисленнаяЗарплатаИВзносыПоФизлицам);
		
	КонецЕсли;
	
	// НачисленныйНДФЛ.
	НачисленныйНДФЛXDTO = Неопределено;
	Если ДанныеXDTO.Свойство("НачисленныйНДФЛ", НачисленныйНДФЛXDTO)
		И ЗначениеЗаполнено(НачисленныйНДФЛXDTO) Тогда
		
		МассивНачисленныйНДФЛ = Новый Массив;
		
		Для Каждого СтрокаНачисленныйНДФЛXDTO Из НачисленныйНДФЛXDTO Цикл
			СтрокаНачисленныйНДФЛ = Новый Структура("ФизическоеЛицо, ВидОперации, ПодразделениеПредприятия, РегистрацияВНалоговомОргане, Сумма");
			
			ЗаполнитьЗначенияСвойств(СтрокаНачисленныйНДФЛ, СтрокаНачисленныйНДФЛXDTO);
			
			СтрокаПодразделениеXDTO = Новый Структура("Подразделение");
			ЗаполнитьЗначенияСвойств(СтрокаПодразделениеXDTO, СтрокаНачисленныйНДФЛXDTO);
			Если ЗначениеЗаполнено(СтрокаПодразделениеXDTO.Подразделение)
				И ТипЗнч(СтрокаПодразделениеXDTO.Подразделение) = Тип("Структура") Тогда
				Если СтрокаПодразделениеXDTO.Подразделение.Свойство("Ссылка") Тогда
					СтрокаНачисленныйНДФЛ.ПодразделениеПредприятия = Новый Структура("Значение, ИмяПКО",
							СтрокаПодразделениеXDTO.Подразделение, "Справочник_Подразделения_Получение");
				КонецЕсли;
			КонецЕсли;
			
			ВидОперацииМД = ВидыОперацийПоЗарплатеЗначения.Найти(СтрокаНачисленныйНДФЛ.ВидОперации);
			Если Не ВидОперацииМД = Неопределено Тогда
				СтрокаНачисленныйНДФЛ.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.Получить(ВидыОперацийПоЗарплатеЗначения.Индекс(ВидОперацииМД));
			КонецЕсли;
			
			МассивНачисленныйНДФЛ.Добавить(СтрокаНачисленныйНДФЛ);
		КонецЦикла;
		
		ПолученныеДанные.ДополнительныеСвойства.Вставить("НачисленныйНДФЛ", МассивНачисленныйНДФЛ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПКО_Документ_ОтражениеЗарплатыВФинУчете_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПолученныеДанные.Сводно Тогда
		ЗаполнитьДопПоляТаблицыДетальныхЗаписейПоФизЛицам(ПолученныеДанные);
		ОбновитьСводнуюТаблицуПоДетальнымЗаписям(ПолученныеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьПКТЧ(ПравилоКонвертации, ИмяТЧКонфигурации, ИмяТЧФормата)
	
	Если ПравилоКонвертации.СвойстваТабличныхЧастей.Колонки.Количество() = 0 Тогда
		ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	КонецЕсли;
	
	КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = ИмяТЧКонфигурации;
	КонвертацияТабличнойЧасти.ТЧФормата = ИмяТЧФормата;
	КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	Возврат КонвертацияТабличнойЧасти.Свойства;
	
КонецФункции

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0,
		ПравилоКонвертацииСвойства = "")
	
	НоваяСтрока = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства;
	
КонецПроцедуры

Функция ПолучитьНачислениеЗУП(Данные)
	
	РезультатСсылка = Неопределено;
	UID_Пустой = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Если Данные.УИД = UID_Пустой Тогда
		Возврат РезультатСсылка;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////
	СсылкаНайдена = Ложь;
	РезультатСсылка = Справочники.упоНачисленияЗУП.ПолучитьСсылку(Данные.УИД);
	
	Если НЕ РезультатСсылка.ПолучитьОбъект() = Неопределено Тогда
		СсылкаНайдена = Истина;
	КонецЕсли;
	
	///////////// //////////////////////////////////////////////////
	Если НЕ СсылкаНайдена Тогда // НЕ ЗначениеЗаполнено(РезультатСсылка) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
				|    упоНачисленияЗУП.Ссылка КАК Ссылка
				|ИЗ
				|    Справочник.упоНачисленияЗУП КАК упоНачисленияЗУП
				|ГДЕ
				|    упоНачисленияЗУП.Код = &Код
				|    И упоНачисленияЗУП.Наименование = &Наименование");
		
		Запрос.УстановитьПараметр("Код", Данные.Код);
		Запрос.УстановитьПараметр("Наименование", Данные.Наименование);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			РезультатСсылка = Выборка.Ссылка;
			СсылкаНайдена = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////
	Если НЕ СсылкаНайдена Тогда // Если НЕ ЗначениеЗаполнено(РезультатСсылка) Тогда
		//Попытка
		НовыйОбъект = Справочники.упоНачисленияЗУП.СоздатьЭлемент();
		НовыйОбъект.УстановитьСсылкуНового(РезультатСсылка);
		
		НовыйОбъект.Код = Данные.Код;
		НовыйОбъект.Наименование = Данные.Наименование;
		
		НовыйОбъект.Записать();
		РезультатСсылка = НовыйОбъект.Ссылка;
		СсылкаНайдена = Истина;
		//Исключение
		//    Инфо = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		//КонецПопытки;
	КонецЕсли;
	
	Если НЕ СсылкаНайдена Тогда
		РезультатСсылка = Справочники.упоНачисленияЗУП.ПустаяСсылка();
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////
	Возврат РезультатСсылка;
	
КонецФункции

Процедура ЗаполнитьДопПоляТаблицыДетальныхЗаписейПоФизЛицам(Объект)
	
	Для Каждого Строка Из Объект.НачисленнаяЗарплатаИВзносыПоФизлицам Цикл
		Строка["упоКорСпособОтраженияЗарплатыВБухучете"] = Строка["СпособОтраженияЗарплатыВБухучете"];
		Строка["упоКорПодразделениеУчетаЗатрат"] = Строка["ПодразделениеПредприятия"];
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСводнуюТаблицуПоДетальнымЗаписям(Объект)
	
	// Метод взят из формы "ОтражениеЗарплатыВФинансовомУчете.ФормаДокумента".
	// При обновлении релизов раздела зарплаты, желательно проверять состав полей запроса и реальной таблицы документа.
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ДетальныеЗаписи.ПодразделениеПредприятия,
			|	ДетальныеЗаписи.ВидОперации,
			|	ДетальныеЗаписи.СпособРасчетов,
			|	ДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете,
			|	ДетальныеЗаписи.ОблагаетсяЕНВД,
			|	ДетальныеЗаписи.Сумма,
			|	ДетальныеЗаписи.ПФРСтраховая,
			|	ДетальныеЗаписи.ПФРНакопительная,
			|	ДетальныеЗаписи.ПФРПоСуммарномуТарифу,
			|	ДетальныеЗаписи.ПФРДоПредельнойВеличины,
			|	ДетальныеЗаписи.ПФРСПревышения,
			|	ДетальныеЗаписи.ПФРНаДоплатуЛетчикам,
			|	ДетальныеЗаписи.ПФРНаДоплатуШахтерам,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
			|	ДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
			|	ДетальныеЗаписи.ФСС,
			|	ДетальныеЗаписи.ФФОМС,
			|	ДетальныеЗаписи.ТФОМС,
			|	ДетальныеЗаписи.ФССНесчастныеСлучаи,
			|	ДетальныеЗаписи.ВзносыВсего
			|ПОМЕСТИТЬ ВТДетальныеЗаписи
			|ИЗ
			|	&ДетальныеЗаписи КАК ДетальныеЗаписи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия КАК ПодразделениеПредприятия,
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия.Наименование КАК НаименованиеПодразделения,
			|	ВТДетальныеЗаписи.ВидОперации КАК ВидОперации,
			|	ВТДетальныеЗаписи.СпособРасчетов КАК СпособРасчетов,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете.Наименование КАК НаименованиеСпособа,
			|	ВТДетальныеЗаписи.ОблагаетсяЕНВД,
			|	СУММА(ВТДетальныеЗаписи.Сумма) КАК Сумма,
			|	СУММА(ВТДетальныеЗаписи.ПФРСтраховая) КАК ПФРСтраховая,
			|	СУММА(ВТДетальныеЗаписи.ПФРНакопительная) КАК ПФРНакопительная,
			|	СУММА(ВТДетальныеЗаписи.ПФРПоСуммарномуТарифу) КАК ПФРПоСуммарномуТарифу,
			|	СУММА(ВТДетальныеЗаписи.ПФРДоПредельнойВеличины) КАК ПФРДоПредельнойВеличины,
			|	СУММА(ВТДетальныеЗаписи.ПФРСПревышения) КАК ПФРСПревышения,
			|	СУММА(ВТДетальныеЗаписи.ПФРНаДоплатуЛетчикам) КАК ПФРНаДоплатуЛетчикам,
			|	СУММА(ВТДетальныеЗаписи.ПФРНаДоплатуШахтерам) КАК ПФРНаДоплатуШахтерам,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
			|	СУММА(ВТДетальныеЗаписи.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
			|	СУММА(ВТДетальныеЗаписи.ФСС) КАК ФСС,
			|	СУММА(ВТДетальныеЗаписи.ФФОМС) КАК ФФОМС,
			|	СУММА(ВТДетальныеЗаписи.ТФОМС) КАК ТФОМС,
			|	СУММА(ВТДетальныеЗаписи.ФССНесчастныеСлучаи) КАК ФССНесчастныеСлучаи,
			|	СУММА(ВТДетальныеЗаписи.ВзносыВсего) КАК ВзносыВсего
			|ИЗ
			|	ВТДетальныеЗаписи КАК ВТДетальныеЗаписи
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия,
			|	ВТДетальныеЗаписи.ПодразделениеПредприятия.Наименование,
			|	ВТДетальныеЗаписи.ВидОперации,
			|	ВТДетальныеЗаписи.СпособРасчетов,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете,
			|	ВТДетальныеЗаписи.СпособОтраженияЗарплатыВБухучете.Наименование,
			|	ВТДетальныеЗаписи.ОблагаетсяЕНВД
			|
			|УПОРЯДОЧИТЬ ПО
			|	НаименованиеПодразделения,
			|	ВидОперации,
			|	НаименованиеСпособа");
	
	Запрос.УстановитьПараметр("ДетальныеЗаписи", Объект.НачисленнаяЗарплатаИВзносыПоФизлицам.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Объект.НачисленнаяЗарплатаИВзносы.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

#КонецОбласти