#Область ПрограммныйИнтерфейс

// Управление доступностью настроек учета по подразделениям.
//
// Параметры:
//	ЭтаФорма - УправляемаяФорма - форма.
//	Объект - ДанныеФормыСтруктура - Проект или Портфель проектов.
Процедура ДоступностьАналитикаВРазрезеПодразделений(ЭтаФорма, Объект) Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	
	Элементы.ДоходыПоПодразделениям.Доступность = Объект.ВедетсяБюджетДоходов;
	Элементы.ДоходыПоОбъемам.Доступность = Объект.ДоходыПоПодразделениям;
	Элементы.ДоходыПоНатуральнымПоказателям.Доступность = Объект.ДоходыПоПодразделениям И Объект.ДоходыПоОбъемам;
	
	Элементы.РасходыПоПодразделениям.Доступность = Объект.ВедетсяБюджетРасходов;
	Элементы.РасходыПоОбъемам.Доступность =  Объект.РасходыПоПодразделениям;
	Элементы.РасходыПоНатуральнымПоказателям.Доступность = Объект.РасходыПоПодразделениям И Объект.РасходыПоОбъемам;
	
	Элементы.НастройкаРаспределенияБДР.Доступность = Объект.ДоходыПоПодразделениям Или Объект.РасходыПоПодразделениям;
	
	Элементы.ПланироватьЗатратыНаМатериалы.Доступность = Не Объект.РасходыПоНатуральнымПоказателям;
	
	Элементы.УстанавливатьПризнакОсновнаяПриДобавленииРоли.Доступность = Объект.НазначатьРСПОсновнойРолиКакРПЗ;
	
	Элементы.УказыватьПодразделениеРолиПриПланированииТР.Доступность = Объект.ПланироватьТрудозатратыПоПроекту;
	
КонецПроцедуры

// Возвращает структуру параметров для обработки.
//
// Параметры:
//  ВызовИзСтруктуры	 - Булево	 - признак вызова из структуры.
//  ВключитьИменаТаблиц	 - Булево	 - признак добавления в результат имен таблиц.
// 
// Возвращаемое значение:
//  Структура - параметры обработки.
// 
Функция ПараметрыОбработкиДанныхРаспределения(ВызовИзСтруктуры = Истина, ВключитьИменаТаблиц = Истина) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверятьРаспределениеДопЗатрат", Не ВызовИзСтруктуры);
	Результат.Вставить("ЕстьТаблицаРаспределенияПоПериодам", Не ВызовИзСтруктуры);	
	Если ВключитьИменаТаблиц Тогда
		Результат.Вставить("СубпродуктыТаблицаРаспределения", 
			?(ВызовИзСтруктуры, "СубпродуктыПоПодразделениям", "РаспределениеОбъемов"));
		Результат.Вставить("МатериальныеРесурсыТаблицаРаспределения", 
			?(ВызовИзСтруктуры, "МатериальныеРесурсыПоПодразделениям", "РаспределениеПотребностей"));
		Результат.Вставить("ПланДоходовТаблицаРаспределения", 
			?(ВызовИзСтруктуры, "ПланДоходовПоПодразделениям", "РаспределениеДоходов"));
		Результат.Вставить("ПланРасходовТаблицаРаспределения", 
			?(ВызовИзСтруктуры, "ПланРасходовПоПодразделениям", "РаспределениеРасходов"));
	КонецЕсли;			
		
	Возврат Результат;
	
КонецФункции

// Возвращает следующий по порядку индекс для новой строки.
//
// Параметры:
//  ТаблицаВладелец	 - ТабличнаяЧасть, ТаблицаЗначений, ДанныеФормыКоллекция, Массив - таблица распределения.
//  ИмяКолонкиИндекс - Строка
// 
// Возвращаемое значение:
//  Число
//
Функция ПолучитьИндексСтрокРаспределенияНовойСтроки(ТаблицаВладелец, ИмяКолонкиИндекс = "ИндексСтрокРаспределения") Экспорт
	
	Максимум = 0;
	Для Каждого СтрокаТаблицы Из ТаблицаВладелец Цикл
		Если СтрокаТаблицы[ИмяКолонкиИндекс] <> Неопределено Тогда
			Максимум = Макс(Максимум, СтрокаТаблицы[ИмяКолонкиИндекс]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Максимум + 1;
	
КонецФункции

// Заполнят свойство строки распределения ИсполнительКонтрагент (используется для ограничения доступности на формах)
// в зависимости от типа значения поля Контрагент.
//
// Параметры:
//  СтрокаРаспределения - Структура, ДанныеФормыЭлементКоллекция - строка распределения.
//  ИмяПоляКонтрагент - Строка - имя поля Контрагент.
//
Процедура ЗаполнитьСвойствоИсполнительКонтрагент(СтрокаРаспределения, 
												ИмяПоляКонтрагент = "КонтрагентПодрядчик") Экспорт
	
	Если СтрокаРаспределения.Свойство("ИсполнительКонтрагент") 
		И СтрокаРаспределения.Свойство(ИмяПоляКонтрагент) Тогда		
		СтрокаРаспределения.ИсполнительКонтрагент = 
			ТипЗНЧ(СтрокаРаспределения[ИмяПоляКонтрагент]) = Тип("СправочникСсылка.Контрагенты");		
	КонецЕсли;
	
КонецПроцедуры		

// Очищает поля "Контрагент-подрядчик" и "Договор подрядчика" при измении реквизита СС/СП.
//
// Параметры:
//	СтрокаРаспределения - ДанныеФормыКоллекция, Структура - данные проверяемой строки распределения.
//	ИспользоватьАналитикуКонтрагентДляСС - Булево - признак необходимости контроля типа аналитики Контрагент/Договор.
//
Процедура РаспределениеОбъемовСубподрядСобсСилыПриИзменении(СтрокаРаспределения,	
	ИспользоватьАналитикуКонтрагентДляСС = Ложь) Экспорт
		
	Если СтрокаРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИмяПоляКонтрагент 	= "КонтрагентПодрядчик";
	ИмяПоляДоговор 		= "ЗаказДоговорПодрядчика";
	
	Если СтрокаРаспределения.СобствСилы_Субподряд = 
		ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.СобственныеСилы") Тогда
		
		Если Не ИспользоватьАналитикуКонтрагентДляСС Тогда	
			Если СтрокаРаспределения.Свойство(ИмяПоляКонтрагент) Тогда
				Если ТипЗНЧ(СтрокаРаспределения.КонтрагентПодрядчик) = Тип("СправочникСсылка.Контрагенты") Тогда					
					СтрокаРаспределения.КонтрагентПодрядчик = 
						ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.ПустаяСсылка");
				КонецЕсли;				
			КонецЕсли;
			
			Если СтрокаРаспределения.Свойство(ИмяПоляДоговор) Тогда
				СтрокаРаспределения.ЗаказДоговорПодрядчика = 
					ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
			КонецЕсли;			
		КонецЕсли;		
		
	ИначеЕсли СтрокаРаспределения.СобствСилы_Субподряд = 
		ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.Субподряд") Тогда	
		
		Если Не ИспользоватьАналитикуКонтрагентДляСС Тогда			
			Если СтрокаРаспределения.Свойство(ИмяПоляКонтрагент) Тогда
				Если ТипЗНЧ(СтрокаРаспределения.КонтрагентПодрядчик) = Тип("СправочникСсылка.упоТрудовыеРесурсы") Тогда								
					СтрокаРаспределения.КонтрагентПодрядчик = 
						ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
				КонецЕсли;				
			КонецЕсли;			
		КонецЕсли;	
		
	ИначеЕсли СтрокаРаспределения.СобствСилы_Субподряд = 
		ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС") Тогда
		
		Если СтрокаРаспределения.Свойство("Количество") Тогда
			СтрокаРаспределения.Количество = 0;
		КонецЕсли;
		
	КонецЕсли;	
		
	ЗаполнитьСвойствоИсполнительКонтрагент(СтрокаРаспределения, ИмяПоляКонтрагент);
	
КонецПроцедуры

// Возвращает значение перечисления СпособПривязкиРаспределения по значению перечисления СпособПривязкиДоходаРасхода.
//
// Параметры:
//	СпособПривязкиДоходаРасхода - ПеречислениеСсылка.упоСпособПривязкиДоходаРасхода - значение перечисления СпособПривязкиДоходаРасхода.
//	
// Возвращаемое значение:
//	ПеречислениеСсылка.упоСпособПривязкиРаспределения - значение перечисления СпособПривязкиРаспределения.
//
Функция СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(СпособПривязкиДоходаРасхода) Экспорт
		
	Если СпособПривязкиДоходаРасхода = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда
		СпособПривязкиРаспределения = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату");
	ИначеЕсли СпособПривязкиДоходаРасхода = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
		СпособПривязкиРаспределения = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
	Иначе
		СпособПривязкиРаспределения = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПустаяСсылка");	
	КонецЕсли; 
	
	Возврат СпособПривязкиРаспределения;
	
КонецФункции

#КонецОбласти