
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// БазоваяФункциональность
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммы = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
	ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы = СтандартныеПодсистемыСервер.ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы();
	// Конец БазоваяФункциональность
	
	// работа с пользователями
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();	
	
	// работа с файлами
	СпрашиватьРежимРедактированияПриОткрытииФайла = 
		ХранилищеОбщихНастроек.Загрузить("НастройкиОткрытияФайлов", "СпрашиватьРежимРедактированияПриОткрытииФайла");
	Если СпрашиватьРежимРедактированияПриОткрытииФайла = Неопределено Тогда
		СпрашиватьРежимРедактированияПриОткрытииФайла = Истина;
		ХранилищеОбщихНастроек.Сохранить("НастройкиОткрытияФайлов", "СпрашиватьРежимРедактированияПриОткрытииФайла", СпрашиватьРежимРедактированияПриОткрытииФайла);
	КонецЕсли;
	
	ДействиеПоДвойномуЩелчкуМыши = ХранилищеОбщихНастроек.Загрузить("НастройкиОткрытияФайлов", "ДействиеПоДвойномуЩелчкуМыши");
	Если ДействиеПоДвойномуЩелчкуМыши = Неопределено Тогда
		ДействиеПоДвойномуЩелчкуМыши = Перечисления.ДействияСФайламиПоДвойномуЩелчку.ОткрыватьФайл;
		ХранилищеОбщихНастроек.Сохранить("НастройкиОткрытияФайлов", "ДействиеПоДвойномуЩелчкуМыши", ДействиеПоДвойномуЩелчкуМыши);
	КонецЕсли;
	
	СпособСравненияВерсийФайлов = ХранилищеОбщихНастроек.Загрузить("НастройкиСравненияФайлов", "СпособСравненияВерсийФайлов");
	ПоказыватьПодсказкиПриРедактированииФайлов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПоказыватьПодсказкиПриРедактированииФайлов");
	ПоказыватьИнформациюЧтоФайлНеБылИзменен = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПоказыватьИнформациюЧтоФайлНеБылИзменен");
	
	ПоказыватьЗанятыеФайлыПриЗавершенииРаботы =  ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы");
	Если ПоказыватьЗанятыеФайлыПриЗавершенииРаботы = Неопределено Тогда 
		ПоказыватьЗанятыеФайлыПриЗавершенииРаботы = Истина;
		ХранилищеОбщихНастроек.Сохранить("НастройкиПрограммы", "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы", ПоказыватьЗанятыеФайлыПриЗавершенииРаботы);
	КонецЕсли;
	
	ПоказыватьКолонкуРазмер = ХранилищеОбщихНастроек.Загрузить("НастройкиПрограммы", "ПоказыватьКолонкуРазмер");
	Если ПоказыватьКолонкуРазмер = Неопределено Тогда
		ПоказыватьКолонкуРазмер = Ложь;
		ХранилищеОбщихНастроек.Сохранить("НастройкиПрограммы", "ПоказыватьКолонкуРазмер", ПоказыватьКолонкуРазмер);
	КонецЕсли;
	
	// Заполнение настроек открытия файлов.
	НастройкиРаботыСФайлами = РаботаСФайлами.НастройкиРаботыСФайлами();
	
	СтрокаНастройки = НастройкиОткрытияФайлов.Добавить();
	СтрокаНастройки.ТипФайла = Перечисления.ТипыФайловДляВстроенногоРедактора.ТекстовыеФайлы;
	СтрокаНастройки.Расширение = НастройкиРаботыСФайлами.ТекстовыеФайлыРасширение;
	СтрокаНастройки.СпособОткрытия = НастройкиРаботыСФайлами.ТекстовыеФайлыСпособОткрытия;
	
	СтрокаНастройки = НастройкиОткрытияФайлов.Добавить();
	СтрокаНастройки.ТипФайла = Перечисления.ТипыФайловДляВстроенногоРедактора.ГрафическиеСхемы;
	СтрокаНастройки.Расширение = НастройкиРаботыСФайлами.ГрафическиеСхемыРасширение;
	СтрокаНастройки.СпособОткрытия = НастройкиРаботыСФайлами.ГрафическиеСхемыСпособОткрытия;
	
	ПоказыватьПредупреждениеПриРегистрации = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСДокументами", "ПоказыватьПредупреждениеПриРегистрации");
	Если ПоказыватьПредупреждениеПриРегистрации = Неопределено Тогда 
		ПоказыватьПредупреждениеПриРегистрации = Истина;
		ХранилищеОбщихНастроек.Сохранить("НастройкиРаботыСДокументами", "ПоказыватьПредупреждениеПриРегистрации", ПоказыватьПредупреждениеПриРегистрации);
	КонецЕсли;
	
	Элементы.Группа8.Видимость = Пользователи.ЭтоПолноправныйПользователь(, Истина)
									И (Не ОбщегоНазначения.РазделениеВключено()
									Или Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных());
	
	// Заполнение документов по статистике
	ЗаполнятьПоСтатистике = ХранилищеОбщихНастроек.Загрузить(
		"НастройкиРаботыСДокументами", "ЗаполнятьРеквизитыДокументовПоСтатистике");
	Если ЗаполнятьПоСтатистике <> Неопределено Тогда
		ЗаполнятьРеквизитыДокументовПоСтатистике = ЗаполнятьПоСтатистике;
	Иначе
		ЗаполнятьРеквизитыДокументовПоСтатистике = Истина;
		ХранилищеОбщихНастроек.Сохранить(
			"НастройкиРаботыСДокументами", "ЗаполнятьРеквизитыДокументовПоСтатистике", Истина);
	КонецЕсли;
	
	// Печать
	ЗапрашиватьПодтверждение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбщиеНастройкиПользователя", "ЗапрашиватьПодтверждениеПриПечатиКомплектаДокументов");
	Если ЗапрашиватьПодтверждение <> Неопределено Тогда
		ЗапрашиватьПодтверждениеПриПечатиКомплектаДокументов = ЗапрашиватьПодтверждение;
	Иначе
		ЗапрашиватьПодтверждениеПриПечатиКомплектаДокументов = Истина;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОбщиеНастройкиПользователя", "ЗапрашиватьПодтверждениеПриПечатиКомплектаДокументов", Истина);
	КонецЕсли;
	
	ДоступноВыключениеКонтроляОстатков = ПраваПользователяПовтИсп.РазрешитьОтключениеКонтроляТоваровОрганизацийНаВремяСеанса();
	
	Если ДоступноВыключениеКонтроляОстатков Тогда
		ОбновитьНадписьКнопкиВыключитьКонтрольОстатковТоваровОрганизаций(ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций);
	КонецЕсли;
	
	ДоступноВыключениеКонтроляРезервовТоваровПоЗаказам = ПраваПользователяПовтИсп.РазрешитьОтключениеКонтроляРезервовТоваровПоЗаказамНаВремяСеанса();
	
	Если ДоступноВыключениеКонтроляРезервовТоваровПоЗаказам Тогда
		ОбновитьНадписьКнопкиВыключитьКонтрольРезервовТоваровПоЗаказам(ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам);
	КонецЕсли;
	
	Элементы.ВыключитьКонтрольОстатковТоваров.Видимость = ДоступноВыключениеКонтроляОстатков;
	Элементы.ВыключитьКонтрольРезервовТоваровПоЗаказам.Видимость = ДоступноВыключениеКонтроляРезервовТоваровПоЗаказам;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		Элементы.ИнтеграцияС1СДокументооборот.Видимость = Ложь;
	КонецЕсли;
	
	// Учет ретро-бонусов
	РазрешитьОтключениеКонтроляРетроБонусовНаВремяСеанса = ПраваПользователяПовтИсп.РазрешитьОтключениеКонтроляРетроБонусовНаВремяСеанса();
	Элементы.ВыключитьКонтрольОстатковРетроБонусовКлиентов.Видимость = РазрешитьОтключениеКонтроляРетроБонусовНаВремяСеанса;
	
	Если РазрешитьОтключениеКонтроляРетроБонусовНаВремяСеанса Тогда
		
		ОбновитьНадписьКнопкиВыключитьКонтрольОстатковРетроБонусов(ПараметрыСеанса.ПроводитьБезКонтроляОстатковРетроБонусовКлиентов);
		
	КонецЕсли;
	
	// Учет зарплаты и кадров
	Элементы.УчетЗарплатыИКадров.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплатыУТ");
	Элементы.ПерсональнаяНастройкаСменаПодписи.Видимость =
		ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ПодписиДокументов");
	Элементы.ОчиститьНастройкиПодписанияЭЦПКадровогоЭДО.Видимость =
		ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ЭДОБЗК");
		
		
	// {PM}
	упоИнтеграция.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	упоИзменитьЭлементыУправления();
	упоЗаполнитьНачальныеЗначения(Отказ, СтандартнаяОбработка);
	упоСкрытьРаскрытьВсеГруппы(Истина);
	// {/PM}
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьОповещение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
		
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьИОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть()
	МассивСтруктур = Новый Массив;
	
	// работа с файлами
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиОткрытияФайлов");
	Элемент.Вставить("Настройка", "ДействиеПоДвойномуЩелчкуМыши");
	Элемент.Вставить("Значение", ДействиеПоДвойномуЩелчкуМыши);
	МассивСтруктур.Добавить(Элемент);
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиОткрытияФайлов");
	Элемент.Вставить("Настройка", "СпрашиватьРежимРедактированияПриОткрытииФайла");
	Элемент.Вставить("Значение", СпрашиватьРежимРедактированияПриОткрытииФайла);
	МассивСтруктур.Добавить(Элемент);
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиПрограммы");
	Элемент.Вставить("Настройка", "ПоказыватьПодсказкиПриРедактированииФайлов");
	Элемент.Вставить("Значение", ПоказыватьПодсказкиПриРедактированииФайлов);
	МассивСтруктур.Добавить(Элемент);
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиПрограммы");
	Элемент.Вставить("Настройка", "ПоказыватьЗанятыеФайлыПриЗавершенииРаботы");
	Элемент.Вставить("Значение", ПоказыватьЗанятыеФайлыПриЗавершенииРаботы);
	МассивСтруктур.Добавить(Элемент);
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиСравненияФайлов");
	Элемент.Вставить("Настройка", "СпособСравненияВерсийФайлов");
	Элемент.Вставить("Значение", СпособСравненияВерсийФайлов);
	МассивСтруктур.Добавить(Элемент);
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиПрограммы");
	Элемент.Вставить("Настройка", "ПоказыватьКолонкуРазмер");
	Элемент.Вставить("Значение", ПоказыватьКолонкуРазмер);
	МассивСтруктур.Добавить(Элемент);
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиРаботыСДокументами");
	Элемент.Вставить("Настройка", "ЗаполнятьРеквизитыДокументовПоСтатистике");
	Элемент.Вставить("Значение", ЗаполнятьРеквизитыДокументовПоСтатистике);
	МассивСтруктур.Добавить(Элемент);
	
	Если НастройкиОткрытияФайлов.Количество() >= 1 Тогда
		
		Элемент = Новый Структура;
		Элемент.Вставить("Объект", "НастройкиОткрытияФайлов\ТекстовыеФайлы");
		Элемент.Вставить("Настройка", "Расширение");
		Элемент.Вставить("Значение", НастройкиОткрытияФайлов[0].Расширение);
		МассивСтруктур.Добавить(Элемент);
		
		Элемент = Новый Структура;
		Элемент.Вставить("Объект", "НастройкиОткрытияФайлов\ТекстовыеФайлы");
		Элемент.Вставить("Настройка", "СпособОткрытия");
		Элемент.Вставить("Значение", НастройкиОткрытияФайлов[0].СпособОткрытия);
		МассивСтруктур.Добавить(Элемент);
		
		Элемент = Новый Структура;
		Элемент.Вставить("Объект", "НастройкиОткрытияФайлов\ГрафическиеСхемы");
		Элемент.Вставить("Настройка", "Расширение");
		Элемент.Вставить("Значение", НастройкиОткрытияФайлов[1].Расширение);
		МассивСтруктур.Добавить(Элемент);
		
		Элемент = Новый Структура;
		Элемент.Вставить("Объект", "НастройкиОткрытияФайлов\ГрафическиеСхемы");
		Элемент.Вставить("Настройка", "СпособОткрытия");
		Элемент.Вставить("Значение", НастройкиОткрытияФайлов[1].СпособОткрытия);
		МассивСтруктур.Добавить(Элемент);
		
	КонецЕсли;
	
	// БазоваяФункциональность
	МассивСтруктур.Добавить(ОписаниеНастройки(
	    "ОбщиеНастройкиПользователя",
	    "ЗапрашиватьПодтверждениеПриЗавершенииПрограммы",
	    ЗапрашиватьПодтверждениеПриЗавершенииПрограммы));
	
	МассивСтруктур.Добавить(ОписаниеНастройки(
	    "ОбщиеНастройкиПользователя",
	    "ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы",
	    ПоказыватьПредупреждениеОбУстановленныхОбновленияхПрограммы));
	// Конец БазоваяФункциональность
	
	МассивСтруктур.Добавить(ОписаниеНастройки(
	    "НастройкиПрограммы",
	    "ПоказыватьИнформациюЧтоФайлНеБылИзменен",
	    ПоказыватьИнформациюЧтоФайлНеБылИзменен));
	
	// Печать
	МассивСтруктур.Добавить(ОписаниеНастройки(
		"ОбщиеНастройкиПользователя",
		"ЗапрашиватьПодтверждениеПриПечатиКомплектаДокументов",
		ЗапрашиватьПодтверждениеПриПечатиКомплектаДокументов));
	// Конец Печать
	
	// {PM}
	упоЗаписатьЗначенияПараметров(МассивСтруктур);
	// {/PM}
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур);
	Модифицированность = Ложь;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРабочегоКаталога(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкаРабочегоКаталога",,,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширениеРаботыСФайламиНаКлиенте(Команда)
	НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСканирования(Команда)
	
	РаботаСФайламиКлиент.ОткрытьФормуНастройкиСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПользователе(Команда)
	
	ПоказатьЗначение(Неопределено, ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыСистемы(Команда)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьДействиеПриВыбореМакетаПечатнойФормы(Команда)
	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.ВыбораРежимаОткрытияМакета");
КонецПроцедуры

&НаКлиенте
Процедура ПерсональнаяНастройкаПроксиСервера(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера",
	                  Новый Структура("НастройкаПроксиНаКлиенте", Истина));
					  
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЭЦП(Команда)
	
	ЭлектроннаяПодписьКлиент.ОткрытьНастройкиЭлектроннойПодписиИШифрования();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширениеРаботыСКриптографиейНаКлиенте(Команда)
	НачатьУстановкуРасширенияРаботыСКриптографией(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПараметрыАвторизацииВ1СДокументооборот(Команда)
	
	// ИнтеграцияС1СДокументооборотом
	ОткрытьФорму(
		"Обработка.ИнтеграцияС1СДокументооборотБазоваяФункциональность.Форма.АвторизацияВ1СДокументооборот",,,,,,
		Неопределено,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьКонтрольОстатковТоваров(Команда)
	ВыключитьКонтрольОстатковТоваровСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьКонтрольРезервовТоваровПоЗаказам(Команда)
	
	ВыключитьКонтрольРезервовТоваровПоЗаказамСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьКонтрольОстатковРетроБонусов(Команда)
	
	ВыключитьКонтрольОстатковРетроБонусовСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВыключитьКонтрольОстатковТоваровСервер()
	ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Не ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций;
	
	ОбновитьНадписьКнопкиВыключитьКонтрольОстатковТоваровОрганизаций(ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций);
	
	Если ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций Тогда
		ТекстСообщения = НСтр("ru = 'Пользователем %ИмяПользователя% в рамках своего сеанса выключен контроль остатков товаров организаций.';
								|en = 'Control of company stock balance is disabled by the %ИмяПользователя% user during their session.'", Метаданные.ОсновнойЯзык.КодЯзыка);
	Иначе
		ТекстСообщения = НСтр("ru = 'Пользователем %ИмяПользователя% возобновлен контроль остатков товаров организаций.';
								|en = 'Control of company stock balance is resumed by the %ИмяПользователя% user'", Метаданные.ОсновнойЯзык.КодЯзыка);
	КонецЕсли;
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяПользователя%", Пользователи.ТекущийПользователь());
	
	ЗаписьЖурналаРегистрации(ЗапасыСервер.ИмяСобытияВыключенКонтрольОстатков(),
		УровеньЖурналаРегистрации.Предупреждение, , ,ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура СпрашиватьРежимРедактированияПриОткрытииФайлаПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПодсказкиПриРедактированииФайловПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЗанятыеФайлыПриЗавершенииРаботыПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьКолонкуРазмерПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИнформациюЧтоФайлНеБылИзмененПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура СпособСравненияВерсийФайловПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьПодтверждениеПриПечатиКомплектаДокументовПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПерсональнаяНастройкаСменаПодписи(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ПодписиДокументов") Тогда
		МодульПодписиДокументов = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодписиДокументовКлиент");
		МодульПодписиДокументов.ОткрытьФормуНастройкиСменыПодписи(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНастройкиПодписанияЭЦПКадровогоЭДО(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ЭДОБЗК") Тогда
		МодульЭДОБЗККлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭДОБЗККлиент");
		МодульЭДОБЗККлиент.ОчиститьНастройкиПодписанияПечатныхФорм();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНапоминаний(Команда)
	
	МодульНапоминанияПользователяКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НапоминанияПользователяКлиент");
	МодульНапоминанияПользователяКлиент.ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиРаботыСПочтой(Команда)
	
	ОткрытьФорму("ЖурналДокументов.Взаимодействия.Форма.НастройкиРаботыСПочтой",,ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#Область Подсистема_PM

&НаКлиенте
Процедура упоФорматСуммВОтчетахНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// {PM}
	ДополнительныеПараметры = Новый Структура("ИмяЭлемента", Элемент.Имя);
	
	Конструктор = Новый КонструкторФорматнойСтроки;
	Конструктор.ДоступныеТипы = Новый ОписаниеТипов("Число");
	Конструктор.Текст = ЭтаФорма[ДополнительныеПараметры.ИмяЭлемента];
	Конструктор.Показать(Новый ОписаниеОповещения("упоФорматКолонокВОтчетахНачалоВыбораЗавершение",ЭтотОбъект, ДополнительныеПараметры));
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоФорматКолонокВОтчетахНачалоВыбораЗавершение(Текст, ДополнительныеПараметры) Экспорт
	// {PM}	
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[ДополнительныеПараметры.ИмяЭлемента] = Текст; 
	
	Модифицированность = Истина;
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетахПриИзменении(Элемент)
	// {PM}
	ЭтаФорма.Элементы["упоФорматКоличестваВПанелиРуководителяПодразделения"].Видимость = Не ЭтаФорма["упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах"];
	упоРеквизитПриИзменении(Элемент);
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоФорматСуммВСтруктуреПроектаКакВОтчетахПриИзменении(Элемент)
	// {PM}
	ЭтаФорма.Элементы["упоФорматСуммВСтруктуреПроекта"].Видимость = Не ЭтаФорма["упоФорматСуммВСтруктуреПроектаКакВОтчетах"];
	упоРеквизитПриИзменении(Элемент);
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоФорматКоличестваВСтруктуреПроектаКакВОтчетахПриИзменении(Элемент)
	// {PM}
	ЭтаФорма.Элементы["упоФорматКоличестваВСтруктуреПроекта"].Видимость = Не ЭтаФорма["упоФорматКоличестваВСтруктуреПроектаКакВОтчетах"];
	упоРеквизитПриИзменении(Элемент);
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоРеквизитПриИзменении(Элемент)
	// {PM}
	 ЗаписатьИОбновитьИнтерфейсПрограммы();
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоНастройкиПроизводительностиПриИзменении(Элемент)
	// {PM}
	упоДопОбработкаНастроекПроизводительностиСтруктурыПроекта();
	упоРеквизитПриИзменении(Элемент);
	// {/PM}
КонецПроцедуры

#КонецОбласти
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьИОбновитьИнтерфейсПрограммы()
	ЗаписатьИЗакрыть();
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПоДвойномуЩелчкуМышиПриИзменении(Элемент)
	ЗаписатьИОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьОповещение(Результат, Неопределен) Экспорт
	ЗаписатьИЗакрыть();
КонецПроцедуры

&НаКлиенте
Функция ОписаниеНастройки(Объект, Настройка, Значение)
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", Объект);
	Элемент.Вставить("Настройка", Настройка);
	Элемент.Вставить("Значение", Значение);
	
	Возврат Элемент;
	
КонецФункции

&НаСервере
Процедура ОбновитьНадписьКнопкиВыключитьКонтрольОстатковТоваровОрганизаций(КонтрольВыключен)
	Если КонтрольВыключен Тогда
		Элементы.ВыключитьКонтрольОстатковТоваров.Заголовок = НСтр("ru = 'Возобновить контроль остатков';
																	|en = 'Resume stock balance control'");
		Элементы.ВыключитьКонтрольОстатковТоваров.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Восстановление контроля остатков товаров организаций для текущего пользователя, ранее выключенных на время сеанса.';
																						|en = 'Restore company stock balance previously disabled for the session time for the current user.'");
	Иначе
		Элементы.ВыключитьКонтрольОстатковТоваров.Заголовок = НСтр("ru = 'Отключить контроль остатков (на время сеанса)';
																	|en = 'Disable stock balance control (for the session time)'");
		Элементы.ВыключитьКонтрольОстатковТоваров.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Выключение контроля остатков товаров организаций для текущего пользователя на время сеанса работы.';
																						|en = 'Disable company stock balance for the current user for the operation session time.'");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыключитьКонтрольРезервовТоваровПоЗаказамСервер()
	
	ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам = Не ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам;
	
	ОбновитьНадписьКнопкиВыключитьКонтрольРезервовТоваровПоЗаказам(ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам);
	
	Если ПараметрыСеанса.ПроводитьБезКонтроляРезервовТоваровПоЗаказам Тогда
		ТекстСообщения = НСтр("ru = 'Пользователем %ИмяПользователя% в рамках своего сеанса выключен контроль резервов по заказам.';
								|en = 'Control of reserves under orders is disabled by the %ИмяПользователя% user during their session.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		ТекстСообщения = НСтр("ru = 'Пользователем %ИмяПользователя% возобновлен контроль резервов по заказам.';
								|en = 'Control of reserves under orders is resumed by the %ИмяПользователя% user.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяПользователя%", Пользователи.ТекущийПользователь());
	
	ЗаписьЖурналаРегистрации(ОбеспечениеВДокументахСервер.ИмяСобытияВыключенКонтрольРезервовТоваровПоЗаказам(),
		УровеньЖурналаРегистрации.Предупреждение, , , ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьКнопкиВыключитьКонтрольРезервовТоваровПоЗаказам(КонтрольВыключен)
	
	Если КонтрольВыключен Тогда
		Элементы.ВыключитьКонтрольРезервовТоваровПоЗаказам.Заголовок = НСтр("ru = 'Возобновить контроль резервов';
																			|en = 'Resume reserve control'");
		Элементы.ВыключитьКонтрольРезервовТоваровПоЗаказам.РасширеннаяПодсказка.Заголовок
			= НСтр("ru = 'Восстановление контроля резервов товаров по заказам для текущего пользователя, ранее выключенных на время сеанса.';
					|en = 'Resume the control of reserves under orders previously disabled for the session time for the current user.'");
	Иначе
		Элементы.ВыключитьКонтрольРезервовТоваровПоЗаказам.Заголовок = НСтр("ru = 'Отключить контроль резервов (на время сеанса)';
																			|en = 'Disable reserve control (for the session time)'");
		Элементы.ВыключитьКонтрольРезервовТоваровПоЗаказам.РасширеннаяПодсказка.Заголовок
			= НСтр("ru = 'Выключение контроля резервов товаров по заказам для текущего пользователя на время сеанса работы.';
					|en = 'Disable the control of goods reserves under orders for the current user for the operation session time.'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыключитьКонтрольОстатковРетроБонусовСервер()
	
	ПараметрыСеанса.ПроводитьБезКонтроляОстатковРетроБонусовКлиентов = Не ПараметрыСеанса.ПроводитьБезКонтроляОстатковРетроБонусовКлиентов;
	
	ОбновитьНадписьКнопкиВыключитьКонтрольОстатковРетроБонусов(ПараметрыСеанса.ПроводитьБезКонтроляОстатковРетроБонусовКлиентов);
	
	Если ПараметрыСеанса.ПроводитьБезКонтроляОстатковРетроБонусовКлиентов Тогда
		ШаблонСообщения = НСтр("ru = 'Пользователем %1 в рамках своего сеанса выключен контроль остатков ретро-бонусов.';
								|en = 'Rebate balance check is disabled by the %1 user during their session.'", ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		ШаблонСообщения = НСтр("ru = 'Пользователем %1 возобновлен контроль остатков ретро-бонусов.';
								|en = 'Rebate balance check is resumed by the %1 user.'", ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонСообщения,
		Пользователи.ТекущийПользователь());
	
	ЗаписьЖурналаРегистрации(
		РетроБонусыСервер.ИмяСобытияВыключенКонтрольОстатков(),
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,
		ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНадписьКнопкиВыключитьКонтрольОстатковРетроБонусов(КонтрольВыключен)
	
	Если КонтрольВыключен Тогда
		
		Элементы.ВыключитьКонтрольОстатковРетроБонусовКлиентов.Заголовок = НСтр("ru = 'Возобновить контроль остатков ретро-бонусов клиентов';
																				|en = 'Resume customer rebate balance check'");
		Элементы.ВыключитьКонтрольОстатковРетроБонусовКлиентов.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Восстановление контроля остатков ретро-бонусов клиентов для текущего пользователя, ранее выключенных на время сеанса.';
																									|en = 'Resume customer rebate balance check previously disabled for the session time for the current user.'");
		
	Иначе
		
		Элементы.ВыключитьКонтрольОстатковРетроБонусовКлиентов.Заголовок = НСтр("ru = 'Отключить контроль остатков ретро-бонусов клиентов (на время сеанса)';
																				|en = 'Disable customer rebate balance check (for the session time)'");
		Элементы.ВыключитьКонтрольОстатковРетроБонусовКлиентов.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Выключение контроля остатков ретро-бонусов клиентов для текущего пользователя на время сеанса работы.';
																									|en = 'Disable customer rebate balance check for the current user for the operation session time.'");
		
	КонецЕсли;
	
КонецПроцедуры

#Область Подсистема_PM

&НаСервере
Функция упоСохранитьНастройкиОповещений()
	// {PM} 
	// Оповещения PM
	упоОповещенияВызовСервера.СохранитьПодписку(ЭтаФорма, ТекущийПользователь);
	// Конец Оповещения PM
	// {/PM} 
КонецФункции

&НаКлиенте
Процедура упоЗаполнитьСпискиВыбора()
	// {PM}	
	СписокМакетов = упоПолучитьСписокМакетов();
	
	упоЗаполнитьСписокВыбора("МакетОформленияОтчетов", СписокМакетов);
	
	СписокМакетов.Вставить(0, "КакВОтчетах", НСтр("ru = 'Как в отчетах'"));
	СписокМакетов.Вставить(1, "ОбщийСтиль", НСтр("ru = 'В зависимости от общего стиля'"));
	упоЗаполнитьСписокВыбора("упоМакетОформленияПанелиРуководителяПодразделения", СписокМакетов);
	
	СписокВариантовЗаполненияПериодов = упоПолучитьСписокВариантовЗаполненияПериода();
	упоЗаполнитьСписокВыбора("упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП", СписокВариантовЗаполненияПериодов);
	
	// {/PM}	
КонецПроцедуры

&НаСервереБезКонтекста
Функция упоПолучитьСписокМакетов()
	// {PM}
	СписокМакетов = Новый СписокЗначений();
	СписокМакетов.ТипЗначения = Новый ОписаниеТипов("Строка");
	
	СписокМакетов.Добавить(упоТиповыеОтчетыСервер.ПолучитьЗначениеМакетаОформленияБезОформления(), НСтр("ru = 'Не использовать макет'"));
	                                                
	Для Каждого МакетОформления Из БиблиотекаМакетовОформленияКомпоновкиДанных Цикл
		СписокМакетов.Добавить(МакетОформления.Имя, МакетОформления.Представление);	
	КонецЦикла;
	
	Возврат СписокМакетов;
	// {/PM}	
КонецФункции

&НаСервереБезКонтекста
Функция упоПолучитьСписокВариантовЗаполненияПериода()
	// {PM}
	мТипы = Новый Массив;
	мТипы.Добавить(Тип("Строка"));
	мТипы.Добавить(Тип("Булево"));
	
	СписокВариантовЗаполненияПериодов = Новый СписокЗначений();
	СписокВариантовЗаполненияПериодов.ТипЗначения = Новый ОписаниеТипов(мТипы);
	
	СписокВариантовЗаполненияПериодов.Добавить("КакВОтчетах", НСтр("ru = 'Как в отчетах'"));
	СписокВариантовЗаполненияПериодов.Добавить(Истина, НСтр("ru = 'Не загружать период из варианта настройки'"));
	СписокВариантовЗаполненияПериодов.Добавить(Ложь, НСтр("ru = 'Загружать период из варианта настройки'"));                                                
	
	Возврат СписокВариантовЗаполненияПериодов;
	// {/PM}	
КонецФункции

&НаКлиенте
Процедура упоЗаполнитьСписокВыбора(ИмяЭлемента, СписокЗначений)
	// {PM}	
	СписокВыбора = Элементы[ИмяЭлемента].СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого Значение Из СписокЗначений Цикл
		ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(), Значение);
	КонецЦикла;
	// {/PM}	
КонецПроцедуры

&НаКлиенте
Процедура упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ОбъектИмя, НастройкаИмя, Значение)
	// {PM} 
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", ОбъектИмя);
	Элемент.Вставить("Настройка", НастройкаИмя);
	Элемент.Вставить("Значение", Значение);
	МассивСтруктур.Добавить(Элемент);	
	// {/PM} 
КонецПроцедуры

&НаСервере
Процедура упоИзменитьЭлементыУправления()
	// {PM}
	ЭтотОбъект.УстановитьДействие("ПриОткрытии", "упоПриОткрытии");
	
	упоПользователиВызовСервера.ДобавитьЭлементыКонтураPMНаФормуПерсональныхНастроекПользователя(ЭтотОбъект, ТекущийПользователь);
	// {/PM}
КонецПроцедуры

&НаСервере
Процедура упоЗаполнитьНачальныеЗначения(Отказ, СтандартнаяОбработка)
	// {PM}
	ЭтаФорма["РабочийКалендарьДляРасчетаШаблонов"] = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСШаблонами",
		"РабочийКалендарьДляРасчетаШаблонов");
	ЭтаФорма["ПоследнийОткрытыйШаблон"] = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСШаблонами",
		"ПоследнийОткрытыйШаблон");
	ЭтаФорма["ИсключитьИзШаблонаПомеченныеНаУдаление"] = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСШаблонами",
		"ИсключитьИзШаблонаПомеченныеНаУдаление");
	ЭтаФорма["ОткрыватьПоследнийШаблон"] = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСШаблонами",
		"ОткрыватьПоследнийШаблон");
	
	ЭтаФорма["упоСохранятьТекущийПериодПриЗагрузкеВариантаОтчета"] = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСОтчетами",
		"упоСохранятьТекущийПериодПриЗагрузкеВариантаОтчета");

	// Настройки диспетчера.
	ЭтаФорма["СотрудникПоУмолчанию"] = ХранилищеОбщихНастроек.Загрузить("НастройкиДиспетчераПользователя", "СотрудникПоУмолчанию");
	ЭтаФорма["СотрудникПоУмолчаниюДоИзменения"] = ЭтаФорма["СотрудникПоУмолчанию"];
	
	Если Параметры.Свойство("ЭтоВебКлиент") Тогда 
		Если Не Параметры.ЭтоВебКлиент Тогда
			Элементы.УстановитьРасширениеРаботыСФайламиНаКлиенте.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма["упоТекущийПроект"] = ХранилищеОбщихНастроек.Загрузить("упоТекущийПроект"); 
	
	ЭтаФорма["упоУстанавливатьОтборПоПодразделениюВСпискеРолей"] = 
		ХранилищеОбщихНастроек.Загрузить("СписокРолей", 
		"УстанавливатьОтборПоПодразделениюВСпискеРолей"); 
	
	ЭтаФорма["КоличествоДнейДоКонцаСрокаЗадания"] = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСЗаданиями",
		"КоличествоДнейДоКонцаСрокаЗадания");
	Если ЭтаФорма["КоличествоДнейДоКонцаСрокаЗадания"] = Неопределено Тогда 
		ЭтаФорма["КоличествоДнейДоКонцаСрокаЗадания"] = 0;
		ХранилищеОбщихНастроек.Сохранить("НастройкиРаботыСЗаданиями", "КоличествоДнейДоКонцаСрокаЗадания",
			ЭтаФорма["КоличествоДнейДоКонцаСрокаЗадания"]);
	КонецЕсли;
	
	ЭтаФорма["КоличествоДнейДляЗакрытыхЗаданий"] = ХранилищеОбщихНастроек.Загрузить("НастройкиРаботыСЗаданиями",
		"КоличествоДнейДляЗакрытыхЗаданий");
	Если ЭтаФорма["КоличествоДнейДляЗакрытыхЗаданий"] = Неопределено Тогда 
		ЭтаФорма["КоличествоДнейДляЗакрытыхЗаданий"] = 0;
		ХранилищеОбщихНастроек.Сохранить("НастройкиРаботыСЗаданиями", "КоличествоДнейДляЗакрытыхЗаданий",
			ЭтаФорма["КоличествоДнейДляЗакрытыхЗаданий"]);
	КонецЕсли;
	
	// Настройки отчетов.
	СтруктураОформлениеОтчета = упоТиповыеОтчетыСервер.ПолучитьНастройкиОформленияОтчета();
	ЭтаФорма["ФорматСуммВОтчетах"] 							= СтруктураОформлениеОтчета.ФорматСумм;
	ЭтаФорма["ШиринаСуммовыхКолонокВОтчетах"] 				= СтруктураОформлениеОтчета.ШиринаСуммовыхКолонок;
	ЭтаФорма["ФорматКоличестваВОтчетах"] 					= СтруктураОформлениеОтчета.ФорматКоличества;
	ЭтаФорма["ШиринаКоличественныхКолонокВОтчетах"] 		= СтруктураОформлениеОтчета.ШиринаКолонокКоличества;
	ЭтаФорма["ФорматТрудозатратВОтчетах"] 					= СтруктураОформлениеОтчета.ФорматТрудозатрат;
	ЭтаФорма["ШиринаКолонокТрудозатратВОтчетах"] 			= СтруктураОформлениеОтчета.ШиринаКолонокТрудозатрат;
	ЭтаФорма["ФорматКоличествоВыделятьОтрицательные"]  		= СтруктураОформлениеОтчета.ФорматКоличествоВыделятьОтрицательные;
	ЭтаФорма["ФорматСуммаВыделятьОтрицательные"]       		= СтруктураОформлениеОтчета.ФорматСуммаВыделятьОтрицательные;
	ЭтаФорма["ФорматТрудозатратВыделятьОтрицательные"]      = СтруктураОформлениеОтчета.ФорматТрудозатратВыделятьОтрицательные;
	ЭтаФорма["МакетОформленияОтчетов"] 						= СтруктураОформлениеОтчета.МакетОформленияОтчетов;
	
	СтруктураГруппировкиОтчета = упоТиповыеОтчетыСервер.ПолучитьНастройкиГруппировокОтчета();
	ЭтаФорма["СворачиватьГруппировкиДоУровня"] 		= СтруктураГруппировкиОтчета.УровеньСворачиванияГруппировок;
	ЭтаФорма["ПрименятьДляВложенныхГрупп"] 			= СтруктураГруппировкиОтчета.ПрименятьДляВложенныхГрупп;

	ЭтаФорма["упоФорматСуммВСтруктуреПроектаКакВОтчетах"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоФорматСуммВСтруктуреПроектаКакВОтчетах");
										
	ЭтаФорма["упоФорматСуммВСтруктуреПроекта"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоФорматСуммВСтруктуреПроекта");
										
	ЭтаФорма.Элементы["упоФорматСуммВСтруктуреПроекта"].Видимость = Не ЭтаФорма["упоФорматСуммВСтруктуреПроектаКакВОтчетах"];
	
	ЭтаФорма["упоФорматКоличестваВСтруктуреПроектаКакВОтчетах"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоФорматКоличестваВСтруктуреПроектаКакВОтчетах");
										
	ЭтаФорма["упоФорматКоличестваВСтруктуреПроекта"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоФорматКоличестваВСтруктуреПроекта");
	
	ЭтаФорма.Элементы["упоФорматКоличестваВСтруктуреПроекта"].Видимость = Не ЭтаФорма["упоФорматКоличестваВСтруктуреПроектаКакВОтчетах"];
	
	// Настроки производительности.
	упоЗагрузитьНастройкиПроизводительностиСтруктурыПроекта(ЭтотОбъект);
	
	ЭтаФорма["ЗагружатьПоказателиПриОткрытииПанелиРуководителя"] = упоПользователиВызовСервера.обПолучитьНастройкуПользователя("ЗагружатьПоказателиПриОткрытииПанелиРуководителя");
	//ЭтаФорма["ЗадержкаПересчетаСроковПослеДобавленияЗадачи"] = упоПользователиВызовСервера.обПолучитьНастройкуПользователя("ЗадержкаПересчетаСроковПослеДобавленияЗадачи"); 
	
	ЭтаФорма["ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения");
	
	ЭтаФорма["упоМакетОформленияПанелиРуководителяПодразделения"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоМакетОформленияПанелиРуководителяПодразделения");
										
	ЭтаФорма["упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП"] = упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП");
										
	ЭтаФорма["упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах");
										
	ЭтаФорма["упоФорматКоличестваВПанелиРуководителяПодразделения"] = 
										упоПользователиВызовСервера.обПолучитьНастройкуПользователя("упоФорматКоличестваВПанелиРуководителяПодразделения");
										
	ЭтаФорма.Элементы["упоФорматКоличестваВПанелиРуководителяПодразделения"].Видимость = Не ЭтаФорма["упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах"];
	
	ЭтаФорма["упоОсновнойТрудовойРесурс"] = упоПользователиВызовСервера.ПолучитьОсновнойТрудовойРесурсПользователя(ТекущийПользователь);
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Неопределено, Отказ, СтандартнаяОбработка);
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоЗаписатьЗначенияПараметров(МассивСтруктур)
	// {PM}
	СтруктураНастройки = ОписаниеНастройки("НастройкиРаботыСШаблонами", "РабочийКалендарьДляРасчетаШаблонов",
		ЭтотОбъект["РабочийКалендарьДляРасчетаШаблонов"]);
	МассивСтруктур.Добавить(СтруктураНастройки);
	
	СтруктураНастройки = ОписаниеНастройки("НастройкиРаботыСШаблонами", "ПоследнийОткрытыйШаблон",
		ЭтотОбъект["ПоследнийОткрытыйШаблон"]);
	МассивСтруктур.Добавить(СтруктураНастройки);
	
	СтруктураНастройки = ОписаниеНастройки("НастройкиРаботыСШаблонами", "ИсключитьИзШаблонаПомеченныеНаУдаление",
		ЭтотОбъект["ИсключитьИзШаблонаПомеченныеНаУдаление"]);
	МассивСтруктур.Добавить(СтруктураНастройки);
	
	СтруктураНастройки = ОписаниеНастройки("НастройкиРаботыСШаблонами", "ОткрыватьПоследнийШаблон",
		ЭтотОбъект["ОткрыватьПоследнийШаблон"]);
	МассивСтруктур.Добавить(СтруктураНастройки);
	
	СтруктураНастройки = ОписаниеНастройки("НастройкиРаботыСОтчетами", "упоСохранятьТекущийПериодПриЗагрузкеВариантаОтчета",
		ЭтотОбъект["упоСохранятьТекущийПериодПриЗагрузкеВариантаОтчета"]);
	МассивСтруктур.Добавить(СтруктураНастройки);
	
	СтруктураНастройки = ОписаниеНастройки("НастройкиДиспетчераПользователя", "СотрудникПоУмолчанию", ЭтотОбъект["СотрудникПоУмолчанию"]);
	МассивСтруктур.Добавить(СтруктураНастройки);
	
	упоПроектыИЗадачиКлиент.УстановитьПроектТекущим(ЭтотОбъект["упоТекущийПроект"]);	
	
	ИмяОбъекта = "НастройкиРаботыСЗаданиями";  
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "КоличествоДнейДоКонцаСрокаЗадания", ЭтотОбъект["КоличествоДнейДоКонцаСрокаЗадания"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "КоличествоДнейДляЗакрытыхЗаданий", ЭтотОбъект["КоличествоДнейДляЗакрытыхЗаданий"]);
	
	ИмяОбъекта = "СписокРолей";  
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "УстанавливатьОтборПоПодразделениюВСпискеРолей", 
		ЭтотОбъект["упоУстанавливатьОтборПоПодразделениюВСпискеРолей"]);
				
	ИмяОбъекта = "НастройкиРаботыСОтчетами";  
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ФорматСумм", ЭтотОбъект["ФорматСуммВОтчетах"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ШиринаСуммовыхКолонок", ЭтотОбъект["ШиринаСуммовыхКолонокВОтчетах"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ФорматКоличества", ЭтотОбъект["ФорматКоличестваВОтчетах"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ШиринаКолонокКоличества", ЭтотОбъект["ШиринаКоличественныхКолонокВОтчетах"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ФорматТрудозатрат", ЭтотОбъект["ФорматТрудозатратВОтчетах"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ШиринаКолонокТрудозатрат", ЭтотОбъект["ШиринаКолонокТрудозатратВОтчетах"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ФорматКоличествоВыделятьОтрицательные", ЭтотОбъект["ФорматКоличествоВыделятьОтрицательные"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ФорматСуммаВыделятьОтрицательные", ЭтотОбъект["ФорматСуммаВыделятьОтрицательные"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ФорматТрудозатратВыделятьОтрицательные", ЭтотОбъект["ФорматТрудозатратВыделятьОтрицательные"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "МакетОформленияОтчетов", ЭтотОбъект["МакетОформленияОтчетов"]);	
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "УровеньСворачиванияГруппировок", ЭтотОбъект["СворачиватьГруппировкиДоУровня"]);
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ПрименятьДляВложенныхГрупп", ЭтотОбъект["ПрименятьДляВложенныхГрупп"]);
	
	ИмяОбъекта = "Обработка.упоУпрощенныйВводСтруктурыПроекта";
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоФорматСуммВСтруктуреПроектаКакВОтчетах", 
										ЭтотОбъект["упоФорматСуммВСтруктуреПроектаКакВОтчетах"]); 
	
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоФорматСуммВСтруктуреПроекта", 
										ЭтотОбъект["упоФорматСуммВСтруктуреПроекта"]);
										
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоФорматКоличестваВСтруктуреПроектаКакВОтчетах", 
										ЭтотОбъект["упоФорматКоличестваВСтруктуреПроектаКакВОтчетах"]); 
	
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоФорматКоличестваВСтруктуреПроекта", 
										ЭтотОбъект["упоФорматКоличестваВСтруктуреПроекта"]); 
	
	упоСохранитьНастройкиПроизводительностиСтруктурыПроекта();
	
	ИмяОбъекта = "Обработка.упоПанельПоказателей";
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ЗагружатьПоказателиПриОткрытииПанелиРуководителя", 
										ЭтотОбъект["ЗагружатьПоказателиПриОткрытииПанелиРуководителя"]); 
										
	ИмяОбъекта = "Обработка.упоПанельРуководителяПодразделения";
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения", 
										ЭтотОбъект["ЗагружатьДанныеПриОткрытииПанелиРуководителяПодразделения"]); 	
	
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоМакетОформленияПанелиРуководителяПодразделения", 
										ЭтотОбъект["упоМакетОформленияПанелиРуководителяПодразделения"]); 
	
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП", 
										ЭтотОбъект["упоСохранятьТекущийПериодПриЗагрузкеВариантаПанелиРСП"]); 
	
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах", 
										ЭтотОбъект["упоФорматКоличестваВПанелиРуководителяПодразделенияКакВОтчетах"]); 
	
	упоДобавитьЭлементНастройкиВМассив(МассивСтруктур, ИмяОбъекта, "упоФорматКоличестваВПанелиРуководителяПодразделения", 
										ЭтотОбъект["упоФорматКоличестваВПанелиРуководителяПодразделения"]); 
	
	упоПользователиВызовСервера.УстановитьОсновнойТрудовойРесурсПользователя(ТекущийПользователь, ЭтотОбъект["упоОсновнойТрудовойРесурс"]);
	
	упоСохранитьНастройкиОповещений();
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоСохранитьНастройкиПроизводительностиСтруктурыПроекта()
	// {PM}
	СписокНастроекПроизводительности = упоСтруктураПроектаКлиентСервер.СписокНастроекПроизводительностиСтруктурыПроекта();
	ПрефиксНастройки = упоИнтеграцияКлиентСервер.ПрефиксПодсистемыPM();
	Для каждого Настройка Из СписокНастроекПроизводительности Цикл
		ИмяНастройки = Настройка.Ключ;
		ЗначениеНастройки = ЭтотОбъект[ПрефиксНастройки + ИмяНастройки];
		
		упоСтруктураПроектаКлиент.СохранитьНастройкуПроизводительностиСтруктурыПроекта(
			ИмяНастройки, ЗначениеНастройки);
	КонецЦикла;
	// {/PM}
КонецПроцедуры

&НаСервереБезКонтекста
Процедура упоЗагрузитьНастройкиПроизводительностиСтруктурыПроекта(Форма)
	// {PM}
	ЗначенияНастроек = упоСтруктураПроекта.СохраненныеНастройкиПроизводительностиСтруктурыПроекта();
	ПрефиксНастройки = упоИнтеграцияКлиентСервер.ПрефиксПодсистемыPM();
	Для каждого Настройка Из ЗначенияНастроек Цикл
		ИмяНастройки = ПрефиксНастройки + Настройка.Ключ;
		ЗначениеНастройки = Настройка.Значение;
		
		Форма[ИмяНастройки] = ЗначениеНастройки;
	КонецЦикла;
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоСвернутьРазвернутьГруппу(Элемент)
	// {PM} 
	ЭтаФорма["упоИмяГруппыСвернутьРазвернуть"] = Элемент.Имя;
	ЭтаФорма["упоИмяГруппыСвернутьРазвернуть"] = СтрЗаменить(ЭтаФорма["упоИмяГруппыСвернутьРазвернуть"], "ДекорацияЗаголовок", "");
	упоИзменитьСвернутостьГруппы(ЭтаФорма["упоИмяГруппыСвернутьРазвернуть"]);
	// {/PM}
КонецПроцедуры

&НаСервере
Процедура упоИзменитьСвернутостьГруппы(ИмяГруппы, Свернуть = Неопределено)
	// {PM} 
	Элементы["СворачиваемаяГруппа" + ИмяГруппы].Видимость = ?(Свернуть = Неопределено, Не Элементы["СворачиваемаяГруппа" + ИмяГруппы].Видимость, Не Свернуть);
	// {/PM}
КонецПроцедуры

&НаСервере
Процедура упоРазвернутьСворачиваемуюГруппу(ИмяГруппы)
	// {PM} 
	ГруппаРодитель  = Элементы[ИмяГруппы].Родитель;
	Если ГруппаРодитель = ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	ИмяГруппыРодителя =ГруппаРодитель.Имя;
	
	Если СтрНайти(ИмяГруппыРодителя, "СворачиваемаяГруппа") = 0 Тогда
		упоРазвернутьСворачиваемуюГруппу(ИмяГруппыРодителя);
	Иначе
		ИмяГруппыРодителя = СтрЗаменить(ИмяГруппыРодителя, "СворачиваемаяГруппа", "");
		упоИзменитьСвернутостьГруппы(ИмяГруппыРодителя, Ложь);
	КонецЕсли;
	// {/PM}
КонецПроцедуры

&НаСервере
Процедура упоСкрытьРаскрытьВсеГруппы(Свернуть = Неопределено)
	// {PM}
	Для Каждого ЭлементИмяГруппы Из ЭтаФорма["упоИменаСворачиваемыхГрупп"] Цикл
		упоИзменитьСвернутостьГруппы(ЭлементИмяГруппы.Значение, Свернуть);
	КонецЦикла;
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоПриОткрытии(Отказ)
	// {PM}
	упоЗаполнитьСпискиВыбора();
	упоДопОбработкаНастроекПроизводительностиСтруктурыПроекта();
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура упоДопОбработкаНастроекПроизводительностиСтруктурыПроекта()
	// {PM}
	ПересчитыватьФоново = ЭтотОбъект["упоПересчитыватьФоново"];
	НеСчитатьРасчетныеСрокиИКритическийПуть = ЭтотОбъект["упоНеСчитатьРасчетныеСрокиИКритическийПуть"];
	
	Элементы.упоПересчитыватьФоновоВДвеОчереди.Доступность = ПересчитыватьФоново;
	Если Не ПересчитыватьФоново Тогда
		ЭтотОбъект["упоПересчитыватьФоновоВДвеОчереди"] = Ложь;
	КонецЕсли;
	
	Элементы.упоПересчитыватьТолькоИзмененныеЗадачи.Доступность = НеСчитатьРасчетныеСрокиИКритическийПуть;
	Если Не НеСчитатьРасчетныеСрокиИКритическийПуть Тогда
		ЭтотОбъект["упоПересчитыватьТолькоИзмененныеЗадачи"] = Ложь;
	КонецЕсли;
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_упоСотрудникПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// {PM}
	СтандартнаяОбработка = Ложь;
	
	ЭтаФорма["СотрудникПоУмолчаниюДоИзменения"] = ЭтаФорма["СотрудникПоУмолчанию"];
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	упоРаботаСФормамиКлиент.ОткрытьФормуВыбораСотрудниковПользователя(ТекущийПользователь, Элемент);
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_упоСотрудникПоУмолчаниюПриИзменении(Элемент)
	// {PM}
	СотрудникУстановлен = упоПользователиВызовСервера.УстановитьСотрудникаПользователяПоУмолчанию(
		ЭтаФорма["СотрудникПоУмолчанию"], 
		ПользователиКлиентСервер.ТекущийПользователь());
	Если Не СотрудникУстановлен Тогда
		ЭтаФорма["СотрудникПоУмолчанию"] = ЭтаФорма["СотрудникПоУмолчаниюДоИзменения"];
		упоРеквизитПриИзменении(Элемент);
	КонецЕсли;
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_упоКомандаВыборСтиляОформления(Команда)
	// {PM}
	ОткрытьФорму("ОбщаяФорма.упоВыборСтиляОформления", , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	// {/PM}
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_упоКомандаНастройкиПроизводительностиПоУмолчанию(Команда)
	// {PM}
	НастройкиПроизводительности = упоСтруктураПроектаКлиентСервер.СписокНастроекПроизводительностиСтруктурыПроекта();
	ПрефиксНастройки = упоИнтеграцияКлиентСервер.ПрефиксПодсистемыPM();
	Для каждого Настройка Из НастройкиПроизводительности Цикл
		ИмяРеквизита = ПрефиксНастройки + Настройка.Ключ;
		ЭтотОбъект[ИмяРеквизита] = Настройка.Значение.НастройкаПоУмолчанию;
	КонецЦикла;
	
	ЗаписатьИЗакрыть();
	// {/PM} 
КонецПроцедуры

#КонецОбласти

#КонецОбласти
