////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции подбора в ТЧ.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Подготавливает таблицу выбранных значений и возвращает ее адрес во временном хранилище.
//
// Параметры:
//  УИДФорма				 - УникальныйИдентификатор, Строка	 - уникальный идентификатор формы, во временное хранилище
//  	которой надо поместить данные.
//  ТабличнаяЧастьОбъекта	 - ДанныеФормыКоллекция				 - таблица объекта, из которой осуществляется добавление
//  	ранее выбранных значений в таблицу выбранных значений.
//  ИмяКолонки				 - Строка							 - имя колонки табличной части, в которую осуществляется подбор.
//  СписокДопКолонок		 - СписокЗначений, Неопределено		 - список доп колонок, которые должны быть выведены в форму подбора.
//  СтруктураОтбора			 - Структура, Неопределено
// 
// Возвращаемое значение:
//  Строка - адрес хранилища.
//
Функция ПодготовитьТаблицуВыбранныхЗначений(УИДФорма, 
	ТабличнаяЧастьОбъекта, 
	ИмяКолонки, 
	СписокДопКолонок = Неопределено, 
	СтруктураОтбора = Неопределено) Экспорт
	
	ТаблицаВыбранных = Новый ТаблицаЗначений;
	ТаблицаВыбранных.Колонки.Добавить("ВыбранныйОбъект");
	ТаблицаВыбранных.Колонки.Добавить("ИсходныйНомерСтроки");
	
	Если СписокДопКолонок <> Неопределено Тогда
		Для Каждого ДопЭлемент Из СписокДопКолонок Цикл
			ТаблицаВыбранных.Колонки.Добавить(ДопЭлемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ВыбранноеЗначение Из ТабличнаяЧастьОбъекта Цикл
		
		Если ВыбранноеЗначение[ИмяКолонки] = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтруктураОтбора <> Неопределено Тогда
			Пропустить = Ложь;
			Для Каждого КлючЗначение Из СтруктураОтбора Цикл
				Если ВыбранноеЗначение[КлючЗначение.Ключ] <> КлючЗначение.Значение Тогда
					Пропустить = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Пропустить Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаВыбранных.Добавить();
		НоваяСтрока.ВыбранныйОбъект = ВыбранноеЗначение[ИмяКолонки];
		НоваяСтрока.ИсходныйНомерСтроки = ВыбранноеЗначение.ПолучитьИдентификатор();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыбранноеЗначение[ИмяКолонки]);
		
		Если  СписокДопКолонок <> Неопределено 
			И СписокДопКолонок.НайтиПоЗначению("КодСДР") <> Неопределено  Тогда
			
			НоваяСтрока.КодСДР = упоПроектыИЗадачиВызовСервера.обПолучитьКодСДРПроектнойЗадачи(ВыбранноеЗначение[ИмяКолонки]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаВыбранных, УИДФорма);
	
	Возврат АдресХранилища;
	
КонецФункции

// Проверяет, является ли выбранное значение группой справочника.
//
// Параметры:
//  ВыбранноеЗначение	 - Произвольный - выбранное значение, которое необходимо проверить. Если тип 
//										  значения СправочникСсылка, СправочникОбъект, тогда осущетвляется проверка.
//										  Во всех остальных случаях возвращается результат Истина.
//
// Возвращаемое значение:
//	Булево - истина, если не группа, иначе - ложь.
//
Функция ЭтоНеГруппа(ВыбранноеЗначение) Экспорт
	
	Результат = Истина;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		
		Попытка
			Если Метаданные.Справочники.Найти(ВыбранноеЗначение.Метаданные().Имя) <> Неопределено Тогда
				
				Результат = Не ВыбранноеЗначение.ЭтоГруппа;
				
			КонецЕсли;
		Исключение
			Результат = Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подготавливает таблицу отбора.
//
// Параметры:
//  ТаблицаОтбора	 - ТаблицаЗначений, Неопределено - по окончании процедуры в этом параметре возвращается таблица значений отбора.
//
Процедура ПодготовитьТаблицуОтбора(ТаблицаОтбора) Экспорт
	 
	ТаблицаОтбора = Новый ТаблицаЗначений;
	
	ТаблицаОтбора.Колонки.Добавить("ПравоеЗначение");
	ТаблицаОтбора.Колонки.Добавить("ВидСравнения");
	ТаблицаОтбора.Колонки.Добавить("ЛевоеЗначение");
	ТаблицаОтбора.Колонки.Добавить("Использование"); 
	ТаблицаОтбора.Колонки.Добавить("Применение");
	ТаблицаОтбора.Колонки.Добавить("РежимОтображения");
	
КонецПроцедуры

// Создает дерево отбора.
// 
// Возвращаемое значение:
//  ДеревоЗначений
//
Функция НовоеДеревоОтбора() Экспорт
	 
	ДеревоОтбора = Новый ДеревоЗначений;
	
	ДеревоОтбора.Колонки.Добавить("ПравоеЗначение");
	ДеревоОтбора.Колонки.Добавить("ВидСравнения");
	ДеревоОтбора.Колонки.Добавить("ЛевоеЗначение");
	ДеревоОтбора.Колонки.Добавить("Использование"); 
	ДеревоОтбора.Колонки.Добавить("Применение");
	ДеревоОтбора.Колонки.Добавить("РежимОтображения");
	ДеревоОтбора.Колонки.Добавить("ТипГруппы");	
	ДеревоОтбора.Колонки.Добавить("ИмяПоля");
	
	Возврат ДеревоОтбора;
	
КонецФункции

#КонецОбласти