
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодыПоказателейГрафикаПериодПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПериодыПоказателейГрафика.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ДатаНачала = ТекДанные.Период.ДатаНачала;
		ТекДанные.ДатаОкончания = ТекДанные.Период.ДатаОкончания;		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКолонкуПериод();	 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьКолонкуПериод();
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКолонкуПериод()
	
	Для Каждого СтрокаПериод Из Объект.ПериодыПоказателейГрафика Цикл
		СтрокаПериод.Период.ДатаНачала = СтрокаПериод.ДатаНачала;
		СтрокаПериод.Период.ДатаОкончания = СтрокаПериод.ДатаОкончания;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

