////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы со связью проектов с направлениями деятельности.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Ищет направление деятельности по элементу.
//
// Параметры:
//  СсылкаПоиска - СправочникСсылка.Проект	 - объект, для которого ищется связанный элемент.
// 
// Возвращаемое значение:
//  Структура - данные о найденном связанном объекте.
//
Функция ПолучитьНаправлениеДеятельностиПоЭлементу(СсылкаПоиска) Экспорт
	
	СвязанноеНД = Новый Структура("НаправлениеДеятельностиЭлемент, НаправлениеДеятельностиГруппа");
	
	ЭтоУПФ = упоИнтеграцияВызовСервера.ЭтоУПФ();
	Если ЭтоУПФ Тогда 
		СвязанноеНД.Вставить("ОтключитьСинхронизациюНаименований");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаПоиска) Тогда
		Возврат СвязанноеНД;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиЭлемент КАК НаправлениеДеятельностиЭлемент,
	|	упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиГруппа КАК НаправлениеДеятельностиГруппа
	|ИЗ
	|	РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности
	|ГДЕ
	|	упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлемент = &ПроектныйЭлемент";
	
	Если ЭтоУПФ Тогда 
		ДополнениеТекстаЗапроса = "	, упоСвязьПроектаСНаправлениемДеятельности.ОтключитьСинхронизациюНаименований КАК ОтключитьСинхронизациюНаименований
								  |ИЗ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИЗ", ДополнениеТекстаЗапроса);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПроектныйЭлемент", СсылкаПоиска);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(СвязанноеНД, Выборка);
		
	КонецЕсли;
	
	Возврат СвязанноеНД;
	
КонецФункции

// Ищет направление деятельности по элементу.
//
// Параметры:
//  СсылкаПоиска - ДокументСсылка.упоПроектнаяЗадача - объект, для которого ищется связанный элемент.
// 
// Возвращаемое значение:
//  СправочникСсылка.НаправлениеДеятельности - найденный связанный объект.
//
Функция ПолучитьНаправлениеДеятельностиПоПроектнойЗадачеСУчетомИерархии(СсылкаПоиска) Экспорт
		
	Если Не ЗначениеЗаполнено(СсылкаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК Задача1,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель КАК Задача2,
	|	ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследнихРодителя.ЗадачаРодитель, &ПустаяПЗ) КАК Задача3,
	|	ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследнихРодителяРодителя.ЗадачаРодитель, &ПустаяПЗ) КАК Задача4
	|ПОМЕСТИТЬ Родители
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадачаДокумент) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследнихРодителя
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследнихРодителяРодителя
	|			ПО (упоСвойстваПроектныхЗадачСрезПоследнихРодителя.ЗадачаРодитель <> &ПустаяПЗ)
	|				И упоСвойстваПроектныхЗадачСрезПоследнихРодителя.ЗадачаРодитель = упоСвойстваПроектныхЗадачСрезПоследнихРодителяРодителя.ПроектнаяЗадача
	|				И упоСвойстваПроектныхЗадачСрезПоследнихРодителя.Версия = упоСвойстваПроектныхЗадачСрезПоследнихРодителяРодителя.Версия
	|				И (НЕ упоСвойстваПроектныхЗадачСрезПоследнихРодителяРодителя.ЗадачаОтменена)
	|		ПО (упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель <> &ПустаяПЗ)
	|			И упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = упоСвойстваПроектныхЗадачСрезПоследнихРодителя.ПроектнаяЗадача
	|			И упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследнихРодителя.Версия
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследнихРодителя.ЗадачаОтменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Родители.Задача1 КАК Задача1,
	|	Родители.Задача2 КАК Задача2,
	|	Родители.Задача3 КАК Задача3,
	|	Родители.Задача4 КАК Задача4,
	|	упоСвязьПроектаСНаправлениемДеятельности1.НаправлениеДеятельностиЭлемент КАК НаправлениеДеятельностиЭлемент1,
	|	упоСвязьПроектаСНаправлениемДеятельности2.НаправлениеДеятельностиЭлемент КАК НаправлениеДеятельностиЭлемент2,
	|	упоСвязьПроектаСНаправлениемДеятельности3.НаправлениеДеятельностиЭлемент КАК НаправлениеДеятельностиЭлемент3,
	|	упоСвязьПроектаСНаправлениемДеятельности4.НаправлениеДеятельностиЭлемент КАК НаправлениеДеятельностиЭлемент4
	|ИЗ
	|	Родители КАК Родители
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности1
	|		ПО Родители.Задача1 = упоСвязьПроектаСНаправлениемДеятельности1.ПроектныйЭлементПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности2
	|		ПО (Родители.Задача2 <> &ПустаяПЗ)
	|			И Родители.Задача2 = упоСвязьПроектаСНаправлениемДеятельности2.ПроектныйЭлементПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности3
	|		ПО (Родители.Задача3 <> &ПустаяПЗ)
	|			И Родители.Задача3 = упоСвязьПроектаСНаправлениемДеятельности3.ПроектныйЭлементПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности4
	|		ПО (Родители.Задача4 <> &ПустаяПЗ)
	|			И Родители.Задача4 = упоСвязьПроектаСНаправлениемДеятельности4.ПроектныйЭлементПроектнаяЗадача";	
	
	
	Запрос = Новый Запрос();				   	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустаяПЗ", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	
	ТекЗадача = СсылкаПоиска;
	
	Пока Истина Цикл
		Запрос.УстановитьПараметр("ПроектнаяЗадачаДокумент", ТекЗадача);
		Выборка = Запрос.Выполнить().Выбрать();	
		Если Не Выборка.Следующий() Тогда
			Возврат Результат;
		КонецЕсли;
		сч = 1;  
		Пока сч <= 4 Цикл
			ТекЗадача = Выборка["Задача" + сч];
			Если Не ЗначениеЗаполнено(ТекЗадача) Тогда
				Возврат Результат;
			КонецЕсли;
			Направление = Выборка["НаправлениеДеятельностиЭлемент" + сч];
			Если ЗначениеЗаполнено(Направление) Тогда
				Результат = Направление;
				Возврат Результат;
			КонецЕсли;
			сч = сч + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Ищет направление деятельности по элементу.
//
// Параметры:
//  СсылкаПоиска - ДокументСсылка.упоПроектнаяЗадача - объект, для которого ищется связанный элемент.
// 
// Возвращаемое значение:
//  СправочникСсылка.НаправлениеДеятельности, Неопределено - найденный связанный объект.
//
Функция ПолучитьНаправлениеДеятельностиПоПроектнойЗадаче(СсылкаПоиска) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиЭлемент КАК НаправлениеДеятельностиЭлемент
	|ИЗ
	|	РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности
	|ГДЕ
	|	упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлементПроектнаяЗадача = &СсылкаПоиска";	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СсылкаПоиска", СсылкаПоиска);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.НаправлениеДеятельностиЭлемент;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Ищет  проект по направлению деятельности.
//
// Параметры:
//  СсылкаПоиска - СправочникСсылка.НаправлениеДеятельности	 - объект, для которого ищется связанный элемент.
// 
// Возвращаемое значение:
//  СправочникСсылка.Проект, Неопределено - найденный связанный объект.
//
Функция ПолучитьЭлементПоНаправлениюДеятельности(СсылкаПоиска) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СсылкаПоиска", СсылкаПоиска);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлемент КАК ПроектныйЭлемент,
				   |	упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлементПроектнаяЗадача КАК ПроектныйЭлементПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности
	               |ГДЕ
	               |	упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиЭлемент = &СсылкаПоиска";
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ПроектныйЭлемент;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Ищет  проект по направлению деятельности.
//
// Параметры:
//  СсылкаПоиска - СправочникСсылка.НаправлениеДеятельности	 - объект, для которого ищется связанный элемент.
// 
// Возвращаемое значение:
//  ДокументСсылка.упоПроектнаяЗадача, Неопределено - найденный связанный объект.
//
Функция ПолучитьПроектнуюЗадачуПоНаправлениюДеятельности(СсылкаПоиска) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СсылкаПоиска", СсылкаПоиска);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлемент КАК ПроектныйЭлемент,
				   |	упоСвязьПроектаСНаправлениемДеятельности.ПроектныйЭлементПроектнаяЗадача КАК ПроектныйЭлементПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоСвязьПроектаСНаправлениемДеятельности КАК упоСвязьПроектаСНаправлениемДеятельности
	               |ГДЕ
	               |	упоСвязьПроектаСНаправлениемДеятельности.НаправлениеДеятельностиЭлемент = &СсылкаПоиска";
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.ПроектныйЭлементПроектнаяЗадача;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Формирует структуру настроек заполнения создаваемого направления деятельности из константы настроек
//  и дополнительных значений по умолчанию.
// 
// Возвращаемое значение:
//  Структура - Настройки заполнения направления деятельности, см. ДополнитьСтруктуруНастроекЗаполненияНД_EPM.
//
Функция ПолучитьНастройкиЗаполненияСвязанногоНД() Экспорт
	
	НастройкиЗаполненияНД = Константы.упоСвязьПроектовСНД_НастройкаАвтозаполнения.Получить().Получить();
	
	Если НастройкиЗаполненияНД = Неопределено Тогда
		НастройкиЗаполненияНД = Новый Структура();
		ДополнитьСтруктуруНастроекЗаполненияНД_EPM(НастройкиЗаполненияНД);
	КонецЕсли;
	
	НастройкиЗаполненияНД.Вставить("Группа", Константы.упоСвязьПроектовСНД_ГруппаПоУмолчанию.Получить());
	
	Возврат НастройкиЗаполненияНД;
	
КонецФункции

// Сохраняет настройки заполнения связанного направления деятельности в константу настроек.
//
// Параметры:
//  НастройкиЗаполнения	 - Структура -Настройки заполнения.
//
Процедура СохранитьНастройкиЗаполненияСвязанногоНД(НастройкиЗаполнения) Экспорт 
	Константы.упоСвязьПроектовСНД_НастройкаАвтозаполнения.Установить(Новый ХранилищеЗначения(НастройкиЗаполнения));
КонецПроцедуры

// Запускает синхронизацию по подписке: для одной задачи, если это проект и для иерархии задач, если это документ.
//
// Параметры:
//  ПроектОбъект				 - СправочникОбъект.Проекты - проект или проектная задача - зеркало.
//  ТолькоАктируемые			 - Булево, Неопределено
//  ИзменилсяПризнакАктируемости - Булево
//  ИзменилсяРодитель			 - Булево
//  Отказ						 - Булево
//
Процедура ВыполнитьСинхронизациюПроектаСНД(ПроектОбъект, Знач ТолькоАктируемые = Неопределено, ИзменилсяПризнакАктируемости, ИзменилсяРодитель, Отказ) Экспорт
	
	Если ПроектОбъект.ДополнительныеСвойства.Свойство("ИзменилсяТолькоКодСДР") И ПроектОбъект.ДополнительныеСвойства.ИзменилсяТолькоКодСДР Тогда	
		Возврат;
	КонецЕсли;	
	
	Если НЕ Константы.упоИспользоватьСвязьПроектовСНаправлениямиДеятельности.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТолькоАктируемые = Неопределено Тогда
		
		ТолькоАктируемые = Константы.упоСвязьПроектовСНД_ТолькоАктируемые.Получить();
		
	КонецЕсли;
	
	Если ТолькоАктируемые Тогда
		
		Если Не ПроектОбъект.ЭтоАктируемаяЗадача Тогда
			
			Если ВИерархииЕстьАктируемые(ПроектОбъект.Ссылка) Тогда
				
				СинхронизироватьПроектСНаправлениемДеятельности(ПроектОбъект.Ссылка, Отказ, ТолькоАктируемые);
				
			КонецЕсли;
			
		ИначеЕсли ИзменилсяПризнакАктируемости ИЛИ ИзменилсяРодитель Тогда
			
			МассивЭлементов = ПолучитьЭлементыВверхПоИерархии(ПроектОбъект.Ссылка);
			
			Для Каждого Элемент Из МассивЭлементов Цикл
				
				СинхронизироватьПроектСНаправлениемДеятельности(Элемент.Ссылка, Отказ, ТолькоАктируемые);
				
			КонецЦикла;
			
		Иначе
			
			СинхронизироватьПроектСНаправлениемДеятельности(ПроектОбъект.Ссылка, Отказ, ТолькоАктируемые);
			
		КонецЕсли;		
		
	Иначе
		
		МассивЭлементов = ПолучитьЭлементыВверхПоИерархии(ПроектОбъект.Ссылка);
		
		Для Каждого Элемент Из МассивЭлементов Цикл
			
			СинхронизироватьПроектСНаправлениемДеятельности(Элемент.Ссылка, Отказ, ТолькоАктируемые);
			
		КонецЦикла;
	
	КонецЕсли;	
	
КонецПроцедуры

// Создает для всех проектов связанные направления деятельности.
//
// Параметры:
//  КоличествоОбработано - Число, Неопределено
//
Процедура СинхронизироватьВсеПроектыСНаправлениямиДеятельности(КоличествоОбработано = Неопределено) Экспорт
	
	ТолькоАктируемые = Константы.упоСвязьПроектовСНД_ТолькоАктируемые.Получить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТолькоАктируемые", ТолькоАктируемые);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Элемент,
	               |	Проекты.Наименование КАК Наименование,
	               |	Проекты.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
	               |	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	               |	Проекты.Родитель КАК Родитель,
	               |	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	(НЕ &ТолькоАктируемые
	               |			ИЛИ Проекты.ЭтоАктируемаяЗадача)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Проекты.КодСДР";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВыполнитьСинхронизациюПроектаСНД(Выборка.Элемент.ПолучитьОбъект(), ТолькоАктируемые, Истина, Истина, Ложь);
		Если КоличествоОбработано <> Неопределено Тогда
			КоличествоОбработано = КоличествоОбработано + 1;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры 

// Создает для всех проектов связанные направления деятельности.
//
// Параметры:
//  СтруктураПараметров	 - Структура - входящие параметры для передачи из фонового вызова.
//  АдресХранилища		 - Строка	 - адрес хранилища, куда помещается результат исполнения процедуры.
//
Процедура СинхронизироватьВсеПроектыСНаправлениямиДеятельностиЗадание(СтруктураПараметров, АдресХранилища) Экспорт
	
	РезультатВыполнения = Новый Структура("ЗаданиеВыполнено, Количество", Ложь, Истина);
	
	СинхронизироватьВсеПроектыСНаправлениямиДеятельности(РезультатВыполнения.Количество);
	
	РезультатВыполнения.ЗаданиеВыполнено = Истина;
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ищет и обновляет связанное направление деятельности, если не находит - создает новое.
//
// Параметры:
//	ПроектныйЭлемент  				- СправочникСсылка.Проект - проект/проектная задача, для которого ищется и обновляется направление деятельности.
//  Отказ					- Булево - признак успешного создания элементов направлений деятельности.
//  ТолькоАктируемые					- Булево - признак необходимости синхронизировать только актируемые.
//  ДопПараметры			- Структура - дополнительные параметры.
//
Процедура СинхронизироватьПроектСНаправлениемДеятельности(ПроектныйЭлемент, Отказ = Ложь, ТолькоАктируемые, ДопПараметры = Неопределено)
	
	Если Не ЗначениеЗаполнено(ПроектныйЭлемент) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДопПараметры = Неопределено Тогда 
		ДопПараметры = ПолучитьПараметрыПроекта(ПроектныйЭлемент, ТолькоАктируемые);
	КонецЕсли;
	
	ПроектныйЭлементРодитель = ДопПараметры.Родитель;
	ЭтоПроектнаяЗадача = ДопПараметры.ЭтоПроектнаяЗадача;
	ЭтоАктируемаяЗадача = ДопПараметры.ЭтоАктируемаяЗадача;
	СсылкаНаПроектнуюЗадачу = ДопПараметры.СсылкаНаПроектнуюЗадачу;
	НужнаТолькоГруппа = ДопПараметры.НужнаТолькоГруппа;
	
	НастройкиЗаполненияНД = ПолучитьНастройкиЗаполненияСвязанногоНД();
	
	//
	
	СтруктураСвязи = ПолучитьНаправлениеДеятельностиПоЭлементу(ПроектныйЭлемент);
	СвязанноеНД_Элемент_Ссылка = СтруктураСвязи.НаправлениеДеятельностиЭлемент;
	СвязанноеНД_Группа_Ссылка = СтруктураСвязи.НаправлениеДеятельностиГруппа;
	
	//
	
	Если ЗначениеЗаполнено(ПроектныйЭлементРодитель) Тогда
		НД_Родитель_Группа_Ссылка = ПолучитьНаправлениеДеятельностиПоЭлементу(ПроектныйЭлементРодитель).НаправлениеДеятельностиГруппа;
	Иначе
		НД_Родитель_Группа_Ссылка = НастройкиЗаполненияНД.Группа;
	КонецЕсли; 
	Если НД_Родитель_Группа_Ссылка = Неопределено Тогда
		НД_Родитель_Группа_Ссылка = Справочники.НаправленияДеятельности.ПустаяСсылка();
	КонецЕсли;
	
	//
	
	НужноОбновитьСвязь = Ложь;
	
	ЭтоУПФ = упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
	ИерархияЭлементов = ЭтоУПФ;
	НужнаТолькоГруппа = НужнаТолькоГруппа Или ИерархияЭлементов;
	
	СвязанноеНД_Группа_Объект = ОбновляемоеСоздаваемоеНаправлениеДеятельностиГруппа(СвязанноеНД_Группа_Ссылка,
		ИерархияЭлементов, НужноОбновитьСвязь, НастройкиЗаполненияНД);
	
	Если НЕ НужнаТолькоГруппа Тогда				
		ИзменитьУчетДенежныхСредств = Не ИерархияЭлементов;
		СвязанноеНД_Элемент_Объект = ОбновляемоеСоздаваемоеНаправлениеДеятельностиЭлемент(СвязанноеНД_Элемент_Ссылка,
			НужноОбновитьСвязь, НастройкиЗаполненияНД);
	КонецЕсли;	
	
	//
	
	Если НЕ СвязанноеНД_Группа_Объект.Родитель = НД_Родитель_Группа_Ссылка Тогда
		СвязанноеНД_Группа_Объект.Родитель = НД_Родитель_Группа_Ссылка;
	КонецЕсли;
	
	ПроверяемыеРеквизиты = Новый Структура;
	ПроверяемыеРеквизиты.Вставить("Наименование", "Наименование");
	ПроверяемыеРеквизиты.Вставить("ПометкаУдаления", "ПометкаУдаления");
	ПроверяемыеРеквизитыГруппы = ОбщегоНазначения.СкопироватьРекурсивно(ПроверяемыеРеквизиты);
	ПроверяемыеРеквизиты.Вставить("Ссылка", "упоПроектнаяЗадачаЗеркало");
	
	Если ИерархияЭлементов Тогда
		ПроверяемыеРеквизитыГруппы = ПроверяемыеРеквизиты;
	КонецЕсли;
	ПроверитьИЗаполнитьНеобходимыеРеквизиты(СвязанноеНД_Группа_Объект, ПроектныйЭлемент, ПроверяемыеРеквизитыГруппы);
	
	Если НЕ НужнаТолькоГруппа Тогда
		ПроверитьИЗаполнитьНеобходимыеРеквизиты(СвязанноеНД_Элемент_Объект, ПроектныйЭлемент, ПроверяемыеРеквизиты);
	КонецЕсли;
		
	//
	
	ЗаполнитьСчетаУчетаЗначениямиПоУмолчаниюУПФ(ЭтоУПФ, СвязанноеНД_Группа_Объект);
		
	ТекстОшибки = НСтр("ru = 'Связь проекта ""%1"" с направлением деятельности не установлена по причине:
						|%2'");
						
	Если СвязанноеНД_Группа_Объект.Модифицированность() Тогда
		Попытка 
			СвязанноеНД_Группа_Объект.Записать();
		Исключение		
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
								Строка(ПроектныйЭлемент),
								КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ПроектныйЭлемент, , , Отказ);			
			Возврат;
		КонецПопытки;
	КонецЕсли;	
	СвязанноеНД_Группа_Ссылка = СвязанноеНД_Группа_Объект.Ссылка;

	Если НЕ НужнаТолькоГруппа Тогда		
		Если СвязанноеНД_Элемент_Объект.Родитель <> СвязанноеНД_Группа_Ссылка Тогда	
			СвязанноеНД_Элемент_Объект.Родитель = СвязанноеНД_Группа_Ссылка;
		КонецЕсли;		
		Если СвязанноеНД_Элемент_Объект.Модифицированность() Тогда			
			Попытка 
				СвязанноеНД_Элемент_Объект.Записать();
			Исключение 
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
										Строка(ПроектныйЭлемент),
										КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ПроектныйЭлемент, , , Отказ);			
				Возврат;
			КонецПопытки;
		КонецЕсли;
		СвязанноеНД_Элемент_Ссылка = СвязанноеНД_Элемент_Объект.Ссылка;
	КонецЕсли;
	
	Если ИерархияЭлементов Тогда
		СвязанноеНД_Элемент_Ссылка = СвязанноеНД_Группа_Ссылка;	
	КонецЕсли;
	
	Если НужноОбновитьСвязь Тогда
		
		НаборЗаписей = РегистрыСведений.упоСвязьПроектаСНаправлениемДеятельности.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПроектныйЭлемент.Установить(ПроектныйЭлемент);	
		Запись = НаборЗаписей.Добавить();
		Запись.ПроектныйЭлемент = ПроектныйЭлемент;
		Запись.НаправлениеДеятельностиЭлемент = СвязанноеНД_Элемент_Ссылка;
		Запись.НаправлениеДеятельностиГруппа = СвязанноеНД_Группа_Ссылка;
		Запись.ПроектныйЭлементПроектнаяЗадача = СсылкаНаПроектнуюЗадачу;
		НаборЗаписей.Записать();
		
	КонецЕсли;
		
КонецПроцедуры

Функция ОбновляемоеСоздаваемоеНаправлениеДеятельностиГруппа(СвязанноеНД_Группа_Ссылка, СоздатьЭлемент,
	НужноОбновитьСвязь,	НастройкиЗаполненияНД)

	Если Не ЗначениеЗаполнено(СвязанноеНД_Группа_Ссылка) Тогда		
		НужноОбновитьСвязь = Истина;		
		Если СоздатьЭлемент Тогда
			СвязанноеНД_Группа_Объект = НовоеНаправлениеДеятельностиЭлемент(НастройкиЗаполненияНД);	
		Иначе
			СвязанноеНД_Группа_Объект = Справочники.НаправленияДеятельности.СоздатьГруппу();
		КонецЕсли;
	Иначе		
		СвязанноеНД_Группа_Объект = СвязанноеНД_Группа_Ссылка.ПолучитьОбъект();		
	КонецЕсли;
	
	Возврат СвязанноеНД_Группа_Объект;
	
КонецФункции

Функция ОбновляемоеСоздаваемоеНаправлениеДеятельностиЭлемент(СвязанноеНД_Элемент_Ссылка,
	НужноОбновитьСвязь, НастройкиЗаполненияНД)
				
	Если Не ЗначениеЗаполнено(СвязанноеНД_Элемент_Ссылка) Тогда						
		НужноОбновитьСвязь = Истина;		
		СвязанноеНД_Элемент_Объект = НовоеНаправлениеДеятельностиЭлемент(НастройкиЗаполненияНД);		
	Иначе
		СвязанноеНД_Элемент_Объект = СвязанноеНД_Элемент_Ссылка.ПолучитьОбъект();						
	КонецЕсли;
	
	Возврат СвязанноеНД_Элемент_Объект;
	
КонецФункции	

Функция НовоеНаправлениеДеятельностиЭлемент(НастройкиЗаполненияНД)
	
	СвязанноеНД_Элемент_Объект = Справочники.НаправленияДеятельности.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(СвязанноеНД_Элемент_Объект, НастройкиЗаполненияНД);
	упоИнтеграция.ЗаполнитьНастройкиУчетаДДСвНаправленииДеятельностиПоУмолчанию(СвязанноеНД_Элемент_Объект, НастройкиЗаполненияНД);
	
	Возврат СвязанноеНД_Элемент_Объект;
	
КонецФункции

Процедура ДополнитьСтруктуруНастроекЗаполненияНД_EPM(НастройкиЗаполненияНД)
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиЗаполненияНД.Вставить("НалогообложениеНДСОпределяетсяВДокументе", Истина);
	НастройкиЗаполненияНД.Вставить("Статус", упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
		"Перечисление.СтатусыНаправленияДеятельности.Используется"));
	НастройкиЗаполненияНД.Вставить("ТипНаправленияДеятельности", 
		упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
			"Перечисление.ТипыНаправленийДеятельности.ИнаяДеятельность"));
	НастройкиЗаполненияНД.Вставить("УчетЗатрат", Ложь);
	НастройкиЗаполненияНД.Вставить("УчетДенежныхСредств", Ложь);
	НастройкиЗаполненияНД.Вставить("УчетДенежныхСредствРаздельно", Ложь); 
	НастройкиЗаполненияНД.Вставить("УчетДенежныхСредствПоКорреспонденции", Ложь);
	НастройкиЗаполненияНД.Вставить("УчетДоходов", Ложь); 
	НастройкиЗаполненияНД.Вставить("УчетРасчетовСПоставщиками", Истина);
	
КонецПроцедуры

// Сначала сравниваем значения, чтобы не появилась пометка модифицированности у проверяемого элемента
//
Процедура ПроверитьИЗаполнитьНеобходимыеРеквизиты(ПроверяемыйЭлемент, ПроектныйЭлемент, ПроверяемыеРеквизиты)
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл	
		 			
		Если ПроверяемыйЭлемент[ПроверяемыйРеквизит.Значение] <> ПроектныйЭлемент[ПроверяемыйРеквизит.Ключ] Тогда
			ПроверяемыйЭлемент[ПроверяемыйРеквизит.Значение] = ПроектныйЭлемент[ПроверяемыйРеквизит.Ключ];				
		КонецЕсли;			
				
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив всех элементов вверх по иерархии включая сам элемент.
//
// Возвращаемое значение:
//	Ссылка - СправочникСсылка.Проекты - Ссылка на элемент.
//
Функция ПолучитьЭлементыВверхПоИерархии(Ссылка) 
	
	МассивЭлементов = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Элемент,
	               |	Проекты.Родитель КАК Родитель
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Ссылка = &Ссылка
	               |ИТОГИ ПО
	               |	Родитель ИЕРАРХИЯ";	
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
						
		ВыборкаБезИерахии = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);       
		Пока ВыборкаБезИерахии.Следующий() Цикл
			
			МассивЭлементов.Добавить(ВыборкаБезИерахии.Родитель);			
			
			Если ВыборкаБезИерахии.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда	
				
				ВыборкаСИерархией = ВыборкаБезИерахии.Выбрать();
				Пока ВыборкаСИерархией.Следующий() Цикл
					МассивЭлементов.Добавить(ВыборкаСИерархией.Элемент);
				КонецЦикла;						
				
			КонецЕсли;				
			
		КонецЦикла;
		
	КонецЕсли;	
	
	Возврат МассивЭлементов;
	
КонецФункции

// Проверяет есть ли в иерархии элемент актируемые задачи.
//
// Возвращаемое значение:
//	Булево - Результат проверки.
//
Функция ВИерархииЕстьАктируемые(Ссылка) 
	
	МассивЭлементов = Новый Массив();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Элемент
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.ЭтоАктируемаяЗадача
	               |	И Ссылка В ИЕРАРХИИ (&Ссылка)";	
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьПараметрыПроекта(ДанныеПроекта, ТолькоАктируемые = Неопределено)
	
	Результат = Новый Структура;
	
	Если ТолькоАктируемые = Неопределено Тогда
		
		ТолькоАктируемые = Константы.упоСвязьПроектовСНД_ТолькоАктируемые.Получить();
		
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеПроекта) = Тип("СправочникСсылка.Проекты") Тогда
		
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПроекта, "ЭтоПроектнаяЗадача, Родитель, ЭтоАктируемаяЗадача, СсылкаНаПроектнуюЗадачу");
				
	Иначе		
		
		Результат = Новый Структура;
		Результат.Вставить("ЭтоПроектнаяЗадача", ДанныеПроекта.ЭтоПроектнаяЗадача);
		Результат.Вставить("Родитель", ДанныеПроекта.Родитель);
		Результат.Вставить("ЭтоАктируемаяЗадача", ДанныеПроекта.ЭтоАктируемаяЗадача);
		Результат.Вставить("СсылкаНаПроектнуюЗадачу", ДанныеПроекта.СсылкаНаПроектнуюЗадачу);

	КонецЕсли;
	
	Результат.Вставить("ТолькоАктируемые", ТолькоАктируемые);
	
	НужнаТолькоГруппа = (НЕ Результат.ЭтоПроектнаяЗадача) ИЛИ (ТолькоАктируемые И НЕ Результат.ЭтоАктируемаяЗадача);
	Результат.Вставить("НужнаТолькоГруппа", НужнаТолькоГруппа);
	
	Возврат Результат;
	
КонецФункции 

Процедура ЗаполнитьСчетаУчетаЗначениямиПоУмолчаниюУПФ(НужноЗаполнять, НаправлениеДеятельности)

	Если Не НужноЗаполнять Или НаправлениеДеятельности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетаУчетаПоУмолчанию = упоИнтеграцияУПФСервер.СчетаУчетаНаправленияДеятельностиУПФПоУмолчанию();
		
	Для Каждого Элемент Из СчетаУчетаПоУмолчанию Цикл
		
		Если Не ЗначениеЗаполнено(НаправлениеДеятельности[Элемент.Ключ]) Тогда
			НаправлениеДеятельности[Элемент.Ключ] = Элемент.Значение;		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	
	
#КонецОбласти

