////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции инициализации системы.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает значение параметров сеанса режимов интеграции.
// В наследуемых конфигурациях модифицируем их значения.
// Также делаем другие инициализации при начале сеанса.
//
// Параметры:
//	ТребуемыеПараметры - Массив или НЕОПРЕДЕЛЕНО - массив требуемых параметров или неопределено, если
//												   вызывается системой при начале сеанса.
//
Процедура ПриНачалеСеанса(ТребуемыеПараметры) Экспорт 

	Если ТребуемыеПараметры <> Неопределено Тогда
		Возврат;	
	КонецЕсли;
		
	УстановитьСтильОформления();
	
КонецПроцедуры

// Устанавливает режим открытия форм приложения. По умолчанию - в закладках.
//
// Параметры:
//  Режим	 - Строка - если в качестве параметра передана строка "Закладки" или ничего не передано,
//						то режим открытия в закладках; иначе - в отдельных окнах.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция УстановитьРежимОткрытияФормПриложения(Режим = "Закладки") Экспорт
	
	Если Режим = "Закладки" Тогда
		РежимОткрытия = РежимОткрытияФормПриложения.Закладки; 
	Иначе
		РежимОткрытия = РежимОткрытияФормПриложения.ОтдельныеОкна;
	КонецЕсли;
	
	КлючНастроек = "Общее/НастройкиКлиентскогоПриложения"; 
	
	Настройка = ХранилищеСистемныхНастроек.Загрузить(КлючНастроек);
	
	Если Настройка = Неопределено Тогда		
		Настройка = Новый НастройкиКлиентскогоПриложения;
	КонецЕсли;	
	
	Если Настройка.РежимОткрытияФормПриложения <> РежимОткрытия Тогда
		Настройка.РежимОткрытияФормПриложения = РежимОткрытия;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,Настройка);	
	КонецЕсли;	
	
КонецФункции

// Устанавливает значение параметра сеанса подсистемы "Управление проектным офисом".
//
// Параметры:
//	ИмяПараметра - Строка - имя устанавливаемого параметра.
//	УстановленныеПараметры - Массив - содержит имена установленных параметров сеанса в качестве ключей.
//
Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	упоФункцииЗащитыСервер.УстановитьЗначениеПараметраСеанса(ИмяПараметра);
	
	Если ИмяПараметра = "упоОтключитьПроверкуОграничений" Тогда
		
		ПараметрЗапускаКлиента = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ПараметрЗапуска");
		
		Если РольДоступна("ПолныеПрава") И СтрНайти(ПараметрЗапускаКлиента, "упоОтключитьПроверкуОграничений") > 0 Тогда
			ПараметрыСеанса.упоОтключитьПроверкуОграничений = Истина;
		Иначе 
			ПараметрыСеанса.упоОтключитьПроверкуОграничений = Ложь;
		КонецЕсли;
		
	ИначеЕсли ИмяПараметра = "упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов" Тогда
		
		ПараметрыСеанса.упоОтключитьСтрогуюПроверкуЗакрытыхЭтапов = Ложь;
		
	ИначеЕсли ИмяПараметра = "упоПроверкаУниверсальногоОтчета" Тогда
		
		ПараметрыСеанса[ИмяПараметра] = Ложь;
		
	ИначеЕсли ИмяПараметра = "упоТекущийСотрудник" Тогда
		
		ПараметрыСеанса.упоТекущийСотрудник = Справочники.упоСотрудники.ПустаяСсылка();
		упоИерархияИПолномочияВызовСервера.обУстановитьДиспетчеруТекущегоСотрудника();
		
	ИначеЕсли ИмяПараметра = "упоТекущийПроект" Тогда
		
		упоТекущийПроект = ХранилищеОбщихНастроек.Загрузить("упоТекущийПроект", , "Текущий проект");
		
		Если ЗначениеЗаполнено(упоТекущийПроект) Тогда
			ПараметрыСеанса.упоТекущийПроект = упоТекущийПроект; 
		Иначе
			ПараметрыСеанса.упоТекущийПроект = Справочники.Проекты.ПустаяСсылка();
		КонецЕсли; 
	
	ИначеЕсли ИмяПараметра = "упоОткрытоОсновноеОкно" Тогда
		
		ПараметрыСеанса.упоОткрытоОсновноеОкно = Ложь;
			
	ИначеЕсли ИмяПараметра = "упоРежимИнтеграции_PMO" Тогда
		
		ПараметрыСеанса.упоРежимИнтеграции_PMO  = Истина;
		
	ИначеЕсли ИмяПараметра = "упоРежимИнтеграции_EPM2" Тогда
		
		ПараметрыСеанса.упоРежимИнтеграции_EPM2 = Ложь;

	ИначеЕсли ИмяПараметра = "упоВалютаУправленческогоУчета" Тогда
		
		ПараметрыСеанса.упоВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		
	КонецЕсли;
	
	Если УстановленныеПараметры <> Неопределено Тогда
		УстановленныеПараметры.Добавить(ИмяПараметра);
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает вариант интерфейса клиентского приложения.
//
// Параметры:
//  НовыеНастройки	- Структура - Содержит значения настроек, которые необходимо установить.
//  ИмяПользователя	- Строка - Имя пользователя, для которого необходимо установить новые настройки.
//
Процедура УстановитьНастройкиКлиентскогоПриложения(НовыеНастройки, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КлючНастроек = "Общее/НастройкиКлиентскогоПриложения"; 
	
	ТекущиеНастройки = ХранилищеСистемныхНастроек.Загрузить(КлючНастроек, , , ИмяПользователя);
	
	Если ТекущиеНастройки = Неопределено Тогда		
		ТекущиеНастройки = Новый НастройкиКлиентскогоПриложения;
	КонецЕсли;	
	
	Изменили = Ложь;
	
	Если НовыеНастройки.Свойство("ВариантИнтерфейсаКлиентскогоПриложения") Тогда
		
		Если ТекущиеНастройки.ВариантИнтерфейсаКлиентскогоПриложения <> НовыеНастройки.ВариантИнтерфейсаКлиентскогоПриложения Тогда
			
			ТекущиеНастройки.ВариантИнтерфейсаКлиентскогоПриложения = НовыеНастройки.ВариантИнтерфейсаКлиентскогоПриложения;	
			Изменили = Истина;
			
			Если НовыеНастройки.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
				
				НастройкиТакси = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
				НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
				
				ГруппаСлева = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
				ГруппаСлева.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
				ГруппаСлева.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
				НастройкиСостава.Лево.Добавить(ГруппаСлева);
				
				ГруппаСнизу = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
				ГруппаСнизу.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
				НастройкиСостава.Низ.Добавить(ГруппаСнизу);
								
				НастройкиТакси.УстановитьСостав(НастройкиСостава);
				
				ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "",
					НастройкиТакси, , ИмяПользователя);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НовыеНастройки.Свойство("ВариантМасштабаФормКлиентскогоПриложения") Тогда
		Если ТекущиеНастройки.ВариантМасштабаФормКлиентскогоПриложения <> НовыеНастройки.ВариантМасштабаФормКлиентскогоПриложения Тогда
			ТекущиеНастройки.ВариантМасштабаФормКлиентскогоПриложения  = НовыеНастройки.ВариантМасштабаФормКлиентскогоПриложения;	
			Изменили = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Изменили Тогда
		ХранилищеСистемныхНастроек.Сохранить(КлючНастроек,"",ТекущиеНастройки,,ИмяПользователя);	
	КонецЕсли;
	
КонецПроцедуры

// Выполняется при интерактивном начале работы пользователя с областью данных или в локальном режиме.
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ПараметрыСеанса.упоОткрытоОсновноеОкно = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтильОформления()
		
	Если Не упоИнтеграцияКлиентСервер.ДоступнаНастройкаСтилей() Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйСтиль = упоИнтеграцияКлиентСерверПовтИсп.ИмяТекущегоСтиляОформления();
	
	Если ВыбранныйСтиль = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Выполнить("ГлавныйСтиль = БиблиотекаСтилей[ВыбранныйСтиль]");
			
КонецПроцедуры

#КонецОбласти