
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает изменяемые задачи и проекты.
//
// Параметры:
//  ДокументСсылка	- ДокументСсылка - Документ планирования. 
// 
// Возвращаемое значение:
//  Структура 		- содержит два поля с типом массив: МассивПроектов и МассивЗадач.
//
Функция ПолучитьИзменяемыеЗадачиИПроекты(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.ПроектнаяЗадачаЗеркало.упоКорневойПроект КАК Проект
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.Данные КАК упоПланированиеТрудозатратПоТрудовымРесурсам
	               |ГДЕ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.Ссылка = &Ссылка
	               |	И упоПланированиеТрудозатратПоТрудовымРесурсам.Записывать
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсамОтменаНазначения.ПроектнаяЗадача,
	               |	упоПланированиеТрудозатратПоТрудовымРесурсамОтменаНазначения.ПроектнаяЗадача.Проект
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.ОтменаНазначения КАК упоПланированиеТрудозатратПоТрудовымРесурсамОтменаНазначения
	               |ГДЕ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсамОтменаНазначения.Ссылка = &Ссылка
	               |	И упоПланированиеТрудозатратПоТрудовымРесурсамОтменаНазначения.Записывать";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ТаблицаПЗ = Запрос.Выполнить().Выгрузить();
	МассивЗадач = ТаблицаПЗ.ВыгрузитьКолонку("ПроектнаяЗадача");
	ТаблицаПЗ.Свернуть("Проект");
	МассивПроектов = ТаблицаПЗ.ВыгрузитьКолонку("Проект");
	
	Результат = Новый Структура("МассивПроектов, МассивЗадач", МассивПроектов, МассивЗадач);
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоПланированиеТрудозатратПоТрудовымРесурсам);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли