
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ	(ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);	
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, РежимЗаписиДокумента.Проведение, Отказ, Заголовок, Истина);
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.ПроверитьДокументНаОтмененныеПЗ(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	упоПроведениеДокументовВызовСервера.обУдалитьДвиженияДокумента(Отказ, ЭтотОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПрогнозТрудозатратТРДанные.Подразделение,
	               |	ЕСТЬNULL(упоПрогнозТрудозатратТРРаспределениеПоПериоду.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	               |	ЕСТЬNULL(упоПрогнозТрудозатратТРРаспределениеПоПериоду.Значение, 0) КАК Трудозатраты,
	               |	упоПрогнозТрудозатратТРДанные.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	упоПрогнозТрудозатратТРДанные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоПрогнозТрудозатратТРДанные.Роль КАК Роль
	               |ПОМЕСТИТЬ ВР_ТаблицаДанныеДокумента_Распределение
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.Данные КАК упоПрогнозТрудозатратТРДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.РаспределениеПоПериоду КАК упоПрогнозТрудозатратТРРаспределениеПоПериоду
	               |		ПО (упоПрогнозТрудозатратТРРаспределениеПоПериоду.ПроектнаяЗадача = упоПрогнозТрудозатратТРДанные.ПроектнаяЗадача)
	               |			И (упоПрогнозТрудозатратТРРаспределениеПоПериоду.Роль = упоПрогнозТрудозатратТРДанные.Роль)
	               |			И (упоПрогнозТрудозатратТРРаспределениеПоПериоду.ТрудовойРесурс = упоПрогнозТрудозатратТРДанные.ТрудовойРесурс)
	               |			И (упоПрогнозТрудозатратТРРаспределениеПоПериоду.Ссылка = упоПрогнозТрудозатратТРДанные.Ссылка)
	               |			И (упоПрогнозТрудозатратТРРаспределениеПоПериоду.ТипДанных = &ТипДанных)
	               |ГДЕ
	               |	упоПрогнозТрудозатратТРДанные.Ссылка = &Ссылка
	               |	И упоПрогнозТрудозатратТРДанные.Записывать
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоПрогнозТрудозатратТРДанные.Подразделение,
	               |	ЕСТЬNULL(упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	               |	ЕСТЬNULL(упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.Трудозатраты, 0),
	               |	упоПрогнозТрудозатратТРДанные.ТрудовойРесурс,
	               |	упоПрогнозТрудозатратТРДанные.ПроектнаяЗадача,
	               |	упоПрогнозТрудозатратТРДанные.Роль
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.Данные КАК упоПрогнозТрудозатратТРДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.ТрудозатратыЗаПериодомПланирования КАК упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования
	               |		ПО (упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.ПроектнаяЗадача = упоПрогнозТрудозатратТРДанные.ПроектнаяЗадача)
	               |			И (упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.Роль = упоПрогнозТрудозатратТРДанные.Роль)
	               |			И (упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.Ресурс = упоПрогнозТрудозатратТРДанные.ТрудовойРесурс)
	               |			И (упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.Ссылка = упоПрогнозТрудозатратТРДанные.Ссылка)
	               |			И (упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.Дата < &НачалоПериода
	               |				ИЛИ упоПланированиеТрудозатратПоТрудовымРесурсамТрудозатратыЗаПериодомПланирования.Дата > &КонецПериода)
	               |ГДЕ
	               |	упоПрогнозТрудозатратТРДанные.Записывать
	               |	И упоПрогнозТрудозатратТРДанные.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоПрогнозТрудозатратТРОтменаНазначения.ТрудовойРесурс КАК Ресурс,
	               |	упоПрогнозТрудозатратТРОтменаНазначения.Роль КАК РольРесурса,
	               |	упоПрогнозТрудозатратТРОтменаНазначения.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоПрогнозТрудозатратТРОтменаНазначения.Подразделение,
	               |	ИСТИНА КАК ОтменаНазначения
	               |ПОМЕСТИТЬ ВР_УчастникиДокумента
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.ОтменаНазначения КАК упоПрогнозТрудозатратТРОтменаНазначения
	               |ГДЕ
	               |	упоПрогнозТрудозатратТРОтменаНазначения.Ссылка = &Ссылка
	               |	И упоПрогнозТрудозатратТРОтменаНазначения.Записывать
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВР_ТаблицаДанныеДокумента_Распределение.ТрудовойРесурс,
	               |	ВР_ТаблицаДанныеДокумента_Распределение.Роль,
	               |	ВР_ТаблицаДанныеДокумента_Распределение.ПроектнаяЗадача,
	               |	ВР_ТаблицаДанныеДокумента_Распределение.Подразделение,
	               |	ЛОЖЬ
	               |ИЗ
	               |	ВР_ТаблицаДанныеДокумента_Распределение КАК ВР_ТаблицаДанныеДокумента_Распределение
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ресурс,
	               |	РольРесурса,
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.Дата КАК Дата,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.Подразделение,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.Роль КАК Роль,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.Ресурс КАК Ресурс
	               |ПОМЕСТИТЬ ВР_ДанныеДляОбнуления
	               |ИЗ
	               |	РегистрСведений.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.СрезПоследних(
	               |			,
	               |			(Ресурс, Роль, ПроектнаяЗадача) В
	               |				(ВЫБРАТЬ
	               |					ВР_УчастникиДокумента.Ресурс,
	               |					ВР_УчастникиДокумента.РольРесурса,
	               |					ВР_УчастникиДокумента.ПроектнаяЗадача
	               |				ИЗ
	               |					ВР_УчастникиДокумента КАК ВР_УчастникиДокумента)) КАК упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача,
	               |	Ресурс,
	               |	Роль,
	               |	Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_УчастникиДокумента.Ресурс,
	               |	&Период КАК Период,
	               |	&Ссылка КАК Регистратор,
	               |	ИСТИНА КАК Активность,
	               |	ВР_УчастникиДокумента.РольРесурса,
	               |	ВР_УчастникиДокумента.ПроектнаяЗадача,
	               |	ВР_УчастникиДокумента.ПроектнаяЗадача.Проект КАК Проект,
	               |	ВР_УчастникиДокумента.Подразделение,
	               |	НЕ ВР_УчастникиДокумента.ОтменаНазначения КАК РесурсВыделен,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВариантыРаспределенияТрудозатрат.РучноеРаспределение) КАК ВариантРаспределения,
	               |	МАКСИМУМ(упоВерсииПроекта.Версия) КАК Версия
	               |ИЗ
	               |	ВР_УчастникиДокумента КАК ВР_УчастникиДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО ВР_УчастникиДокумента.ПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВР_УчастникиДокумента.Ресурс,
	               |	ВР_УчастникиДокумента.РольРесурса,
	               |	ВР_УчастникиДокумента.ПроектнаяЗадача,
	               |	ВР_УчастникиДокумента.Подразделение,
	               |	НЕ ВР_УчастникиДокумента.ОтменаНазначения,
	               |	ВР_УчастникиДокумента.ПроектнаяЗадача.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	&Период КАК Период,
	               |	&Ссылка КАК Регистратор,
	               |	ЕСТЬNULL(ВР_ТаблицаДанныеДокумента_Распределение.Подразделение, ВР_ДанныеДляОбнуления.Подразделение) КАК Подразделение,
	               |	ЕСТЬNULL(ВР_ТаблицаДанныеДокумента_Распределение.Дата, ВР_ДанныеДляОбнуления.Дата) КАК Дата,
	               |	ЕСТЬNULL(ВР_ТаблицаДанныеДокумента_Распределение.ТрудовойРесурс, ВР_ДанныеДляОбнуления.Ресурс) КАК Ресурс,
	               |	ЕСТЬNULL(ВР_ТаблицаДанныеДокумента_Распределение.ПроектнаяЗадача, ВР_ДанныеДляОбнуления.ПроектнаяЗадача) КАК ПроектнаяЗадача,
	               |	ЕСТЬNULL(ВР_ТаблицаДанныеДокумента_Распределение.Трудозатраты, 0) КАК Трудозатраты,
	               |	ЕСТЬNULL(ВР_ТаблицаДанныеДокумента_Распределение.Роль, ВР_ДанныеДляОбнуления.Роль) КАК Роль
	               |ИЗ
	               |	ВР_ТаблицаДанныеДокумента_Распределение КАК ВР_ТаблицаДанныеДокумента_Распределение
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВР_ДанныеДляОбнуления КАК ВР_ДанныеДляОбнуления
	               |		ПО ВР_ТаблицаДанныеДокумента_Распределение.ПроектнаяЗадача = ВР_ДанныеДляОбнуления.ПроектнаяЗадача
	               |			И ВР_ТаблицаДанныеДокумента_Распределение.ТрудовойРесурс = ВР_ДанныеДляОбнуления.Ресурс
	               |			И ВР_ТаблицаДанныеДокумента_Распределение.Роль = ВР_ДанныеДляОбнуления.Роль
	               |			И ВР_ТаблицаДанныеДокумента_Распределение.Дата = ВР_ДанныеДляОбнуления.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВР_УчастникиДокумента.ПроектнаяЗадача
	               |ИЗ
	               |	ВР_УчастникиДокумента КАК ВР_УчастникиДокумента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);					
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ТипДанных", "НовоеЗначение");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = РезультатПакета.Количество();
	
	//
	
	ТаблицаВыделенныхРесурсов = РезультатПакета[КоличествоРезультатов-3].Выгрузить();
	Движения.упоВыделенныеТрудовыеРесурсы.Загрузить(ТаблицаВыделенныхРесурсов);
	
	ТаблицаТрудозатрат = РезультатПакета[КоличествоРезультатов-2].Выгрузить();
	Движения.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.Загрузить(ТаблицаТрудозатрат);
	
	//
	
	МассивПЗ = РезультатПакета[КоличествоРезультатов-1].Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
	
	//
	
	Движения.упоВыделенныеТрудовыеРесурсы.Записать();
	Движения.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.Записать();	
	
	//
	
	ИзменитьСрокиПЗ();
	
	//
	
	СформироватьДвижения_ТрудозатратыРесурсовПоДням(МассивПЗ);
	
	//
	
	упоЗадания.СинхронизироватьПорученияЗадач(МассивПЗ, МассивПЗ);
	
	ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов =
		Константы.упоАвтоматическийРасчетСроковСвязанныхПроектов.Получить();
	Если Не ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов Тогда
		Возврат;
	КонецЕсли;
	
	упоРасчетКалендарныхСроковРедакция3Сервер.ПриИзмененииСроковЗадачНеобходимоПересчитатьПроекты(МассивПЗ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ Тогда		
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если ДополнительныеСвойства.Свойство("НеОбновлятьДатуДокумента") Тогда
				НеОбновлятьДатуДокумента = ДополнительныеСвойства.НеОбновлятьДатуДокумента;
			Иначе
				НеОбновлятьДатуДокумента = Ложь;
			КонецЕсли;
			Если НЕ НеОбновлятьДатуДокумента Тогда
				Дата = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
		КонецПериода = КонецНедели(НачалоПериода + 14*24*3600);
		
		ЭтотОбъект.НеЗаписыватьСрокиЗадач = ХранилищеОбщихНастроек.Загрузить("Документ.упоПланированиеТрудозатратПоТрудовымРесурсам", "НеЗаписыватьСрокиЗадач",, ИмяПользователя()); 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		
		НачальноеЗаполнениеТекДокумента(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		НачальноеЗаполнениеТекДокументаПоСтруктуре(ДанныеЗаполнения);	
				
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры 
 
Процедура ПриКопировании(ОбъектКопирования)
	
	УровеньГруппировок = ?(ПорядокГруппировок = 2, 0, 3);
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.ПроектнаяЗадача КАК СсылкаНаПроектнуюЗадачу
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.Данные КАК упоПланированиеТрудозатратПоТрудовымРесурсам
	               |ГДЕ
	               |	упоПланированиеТрудозатратПоТрудовымРесурсам.Записывать
	               |	И упоПланированиеТрудозатратПоТрудовымРесурсам.Ссылка = &Ссылка";
		
	МассивЗадач = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаНаПроектнуюЗадачу");
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(МассивЗадач, ЭтотОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзменитьСрокиПЗ() 
	
	Если НеЗаписыватьСрокиЗадач Тогда
		Движения.упоСрокиПроектныхЗадач.Очистить();			   
		Движения.упоСрокиПроектныхЗадач.Записать();	
		Движения.упоСвойстваПроектныхЗадач.Очистить();
		Движения.упоСвойстваПроектныхЗадач.Записать();	
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоПрогнозТрудозатратТРДанные.ДатаНачалаНП КАК ДатаНачалаНП,
	               |	упоПрогнозТрудозатратТРДанные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоПрогнозТрудозатратТРДанные.ДатаЗавершенияНП КАК ДатаЗавершенияНП,
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ПОМЕСТИТЬ СрокиДокумента
	               |ИЗ
	               |	Документ.упоПланированиеТрудозатратПоТрудовымРесурсам.Данные КАК упоПрогнозТрудозатратТРДанные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоПрогнозТрудозатратТРДанные.ПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	               |			И (упоВерсииПроекта.Текущая)
	               |ГДЕ
	               |	упоПрогнозТрудозатратТРДанные.Ссылка = &Ссылка
	               |	И упоПрогнозТрудозатратТРДанные.Записывать
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаТекущие,
	               |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершенияТекущие,
	               |	СрокиДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СрокиДокумента.ДатаНачалаНП КАК ДатаНачала,
	               |	СрокиДокумента.ДатаЗавершенияНП КАК ДатаЗавершения,
	               |	СрокиДокумента.Версия КАК Версия
	               |ПОМЕСТИТЬ СводнаяТаблица
	               |ИЗ
	               |	СрокиДокумента КАК СрокиДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	               |				,
	               |				ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						СрокиДокумента.ПроектнаяЗадача
	               |					ИЗ
	               |						СрокиДокумента КАК СрокиДокумента)) КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ПО СрокиДокумента.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И СрокиДокумента.Версия = упоСрокиПроектныхЗадачСрезПоследних.Версия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбщаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ОбщаяТаблица.ДатаНачала КАК ДатаНачала,
	               |	ОбщаяТаблица.ДатаЗавершения КАК ДатаЗавершения,
	               |	ОбщаяТаблица.Версия КАК Версия
	               |ПОМЕСТИТЬ НовыеСроки
	               |ИЗ
	               |	СводнаяТаблица КАК ОбщаяТаблица
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ НАЧАЛОПЕРИОДА(ОбщаяТаблица.ДатаНачалаТекущие, ДЕНЬ) = НАЧАЛОПЕРИОДА(ОбщаяТаблица.ДатаНачала, ДЕНЬ)
	               |				ТОГДА ИСТИНА
	               |			КОГДА НЕ НАЧАЛОПЕРИОДА(ОбщаяТаблица.ДатаЗавершенияТекущие, ДЕНЬ) = НАЧАЛОПЕРИОДА(ОбщаяТаблица.ДатаЗавершения, ДЕНЬ)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Период КАК Период,
	               |	НовыеСроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	НовыеСроки.ДатаНачала КАК ДатаНачалаПлан,
	               |	НовыеСроки.ДатаЗавершения КАК ДатаЗавершенияПлан,
	               |	НовыеСроки.Версия КАК Версия,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи, ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
	               |				ТОГДА ЕСТЬNULL(упоКалендариПроектовСрезПоследних.КалендарьПроекта, ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка))
	               |			ИНАЧЕ ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи, ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка))
	               |		КОНЕЦ) КАК Календарь
	               |ПОМЕСТИТЬ НовыеСрокиСКалендарем
	               |ИЗ
	               |	НовыеСроки КАК НовыеСроки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |				,
	               |				(ПроектнаяЗадача, Версия) В
	               |					(ВЫБРАТЬ
	               |						НовыеСроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |						НовыеСроки.Версия КАК Версия
	               |					ИЗ
	               |						НовыеСроки КАК НовыеСроки)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО НовыеСроки.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И НовыеСроки.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК упоКалендариПроектовСрезПоследних
	               |		ПО НовыеСроки.ПроектнаяЗадача.Проект = упоКалендариПроектовСрезПоследних.Проект
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НовыеСроки.ПроектнаяЗадача,
	               |	НовыеСроки.ДатаНачала,
	               |	НовыеСроки.ДатаЗавершения,
	               |	НовыеСроки.Версия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НовыеСрокиСКалендарем.Период КАК Период,
	               |	НовыеСрокиСКалендарем.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	НовыеСрокиСКалендарем.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(НовыеСрокиСКалендарем.ДатаЗавершенияПлан, ДЕНЬ), ЧАС, ЕСТЬNULL(упоРабочиеКалендариСрезПоследних.КоличествоЧасов, 0)) КАК ДатаЗавершенияПлан,
	               |	НовыеСрокиСКалендарем.Версия КАК Версия
	               |ИЗ
	               |	НовыеСрокиСКалендарем КАК НовыеСрокиСКалендарем
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
	               |		ПО (НАЧАЛОПЕРИОДА(НовыеСрокиСКалендарем.ДатаЗавершенияПлан, ДЕНЬ) = упоРабочиеКалендариСрезПоследних.День)
	               |			И НовыеСрокиСКалендарем.Календарь = упоРабочиеКалендариСрезПоследних.Календарь";
				   
	ТаблицаСроков = Запрос.Выполнить().Выгрузить();				   
	Движения.упоСрокиПроектныхЗадач.Загрузить(ТаблицаСроков);			   
	Движения.упоСрокиПроектныхЗадач.Записать();
	
	СтрокаВсехПолейСвойств = ПолучитьСтрокуВсехПолейРегистраСвойствПЗ("упоСвойстваПроектныхЗадачСрезПоследних.");
	
	Запрос.УстановитьПараметр("ТаблицаПроектныеЗадачи", ТаблицаСроков);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПроектныеЗадачи.ПроектнаяЗадача,
	               |	ТаблицаПроектныеЗадачи.ДатаНачалаПлан,
	               |	ТаблицаПроектныеЗадачи.ДатаЗавершенияПлан,
	               |	ТаблицаПроектныеЗадачи.Версия,
	               |	ТаблицаПроектныеЗадачи.Период
	               |ПОМЕСТИТЬ ТаблицаПроектныеЗадачи
	               |ИЗ
	               |	&ТаблицаПроектныеЗадачи КАК ТаблицаПроектныеЗадачи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	"+СтрокаВсехПолейСвойств+"
	               |	,ТаблицаПроектныеЗадачи.ДатаНачалаПлан,
	               |	ТаблицаПроектныеЗадачи.ДатаЗавершенияПлан,
	               |	ТаблицаПроектныеЗадачи.Период,
	               |	упоКалендариПроектовСрезПоследних.КалендарьПроекта	               
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			(ПроектнаяЗадача, Версия) В
	               |				(ВЫБРАТЬ
	               |					ТаблицаПроектныеЗадачи.ПроектнаяЗадача,
	               |					ТаблицаПроектныеЗадачи.Версия
	               |				ИЗ
	               |					ТаблицаПроектныеЗадачи КАК ТаблицаПроектныеЗадачи)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПроектныеЗадачи КАК ТаблицаПроектныеЗадачи
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ТаблицаПроектныеЗадачи.ПроектнаяЗадача
	               |			И упоСвойстваПроектныхЗадачСрезПоследних.Версия = ТаблицаПроектныеЗадачи.Версия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК упоКалендариПроектовСрезПоследних
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект = упоКалендариПроектовСрезПоследних.Проект";
					   
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	сч = ТаблицаСвойств.Количество() -1;
	
	Пока сч >= 0 Цикл		
		СтрокаТаблицы = ТаблицаСвойств[сч];
		
		Если НЕ СтрокаТаблицы.ДлительностьБезУчетаКалендаряПроекта Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.КалендарьЗадачи) Тогда
				Календарь = СтрокаТаблицы.КалендарьЗадачи;
			Иначе
				Календарь = СтрокаТаблицы.КалендарьПроекта;
			КонецЕсли;
			Ответ = упоРабочиеКалендариВызовСервера.обКоличествоРабочихДнейИЧасовВПериоде(Календарь, СтрокаТаблицы.ДатаНачалаПлан, СтрокаТаблицы.ДатаЗавершенияПлан);
			ДлительностьМоделиПакетаРабот = упоРабочиеКалендариВызовСервера.обПересчитатьЕдВремениИзЧасов(Ответ.КоличествоЧасов,
					СтрокаТаблицы.ЕдиницаНормированияДлительности);
			
		Иначе
			ДлительностьМоделиПакетаРабот = упоРабочиеКалендариВызовСервера.обПересчитатьЕдВремениИзЧасов(
						(КонецДня(СтрокаТаблицы.ДатаЗавершенияПлан) - НачалоДня(СтрокаТаблицы.ДатаНачалаПлан)) / 3600, 
						СтрокаТаблицы.ЕдиницаНормированияДлительности);
		КонецЕсли;

		Если ДлительностьМоделиПакетаРабот = СтрокаТаблицы.ДлительностьМоделиПакетаРабот
														И СтрокаТаблицы.РучнойВводСроков 
		Тогда
			ТаблицаСвойств.Удалить(СтрокаТаблицы);		
		Иначе
			СтрокаТаблицы.ДлительностьМоделиПакетаРабот = ДлительностьМоделиПакетаРабот; 
			СтрокаТаблицы.РучнойВводСроков = Истина;
		КонецЕсли;
				
		сч = сч -1;
	КонецЦикла;
	
	Движения.упоСвойстваПроектныхЗадач.Загрузить(ТаблицаСвойств);
	Движения.упоСвойстваПроектныхЗадач.Записать();
	
КонецФункции

Функция ПолучитьСтрокуВсехПолейРегистраСвойствПЗ(Префикс = "")
	СтрокаПолей = "";
	Для Каждого Поле Из Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Измерения Цикл
		СтрокаПолей = СтрокаПолей + ?(ЗначениеЗаполнено(СтрокаПолей), ", ", "") + Префикс + Поле.Имя;	
	КонецЦикла;
	Для Каждого Поле Из Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Ресурсы Цикл
		СтрокаПолей = СтрокаПолей + ?(ЗначениеЗаполнено(СтрокаПолей), ", ", "") + Префикс + Поле.Имя;	
	КонецЦикла;
	Для Каждого Поле Из Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Реквизиты Цикл
		СтрокаПолей = СтрокаПолей + ?(ЗначениеЗаполнено(СтрокаПолей), ", ", "") + Префикс + Поле.Имя;	
	КонецЦикла;
	Возврат СтрокаПолей;	
КонецФункции 

Функция СформироватьДвижения_ТрудозатратыРесурсовПоДням(МассивЗадач)
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(МассивЗадач, ЭтотОбъект.Ссылка);
					
КонецФункции 

Процедура НачальноеЗаполнениеТекДокумента(Проект)

	Проекты.Добавить().Проект = Проект;
	ПорядокГруппировок = 1;
	УровеньГруппировок = 3;
	НачалоПериода = упоПоказателиПроектовСервер.ПолучитьТекДатуДляПоказателейФОТ();
	СрокиПроекта = упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроекта(Проект, Неопределено, Ложь);
	КонецПериода = СрокиПроекта.ДатаЗавершенияПлан;	
	
КонецПроцедуры

Процедура НачальноеЗаполнениеТекДокументаПоСтруктуре(Структура)
	
	Если Структура.Свойство("НачалоПериода") И Структура.Свойство("КонецПериода") Тогда
		ЭтотОбъект.НачалоПериода = Структура.НачалоПериода;
		ЭтотОбъект.КонецПериода = Структура.КонецПериода;
	КонецЕсли;
	Если Структура.Свойство("Проекты") Тогда
		ЭтотОбъект.Проекты.Очистить();
		Для Каждого Проект ИЗ Структура.Проекты Цикл
			ЭтотОбъект.Проекты.Добавить().Проект = Проект;
		КонецЦикла;
	КонецЕсли;
	Если Структура.Свойство("Подразделения") Тогда
		ЭтотОбъект.Подразделения.Очистить();
		Для Каждого Подразделение ИЗ Структура.Подразделения Цикл
			ЭтотОбъект.Подразделения.Добавить().Подразделение = Подразделение;
		КонецЦикла;
	КонецЕсли;
	Если Структура.Свойство("Роли") Тогда
		ЭтотОбъект.Роли.Очистить();
		Для Каждого Роль ИЗ Структура.Роли Цикл
			ЭтотОбъект.Роли.Добавить().Роль = Роль;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
