////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для экспорта данных в Microsoft Project.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Экспорт в MS Project.
//
// Параметры:
//  НеведомыйОбъект	 - Произвольный	 - объект или структура данных, на основании
//  	которых необходимо выгрузить данные в MSP.
//  УровеньПланированияТрудозатрат  - ПеречислениеСсылка.упоУровеньПланирования, Неопределено
//  ТипВыгрузки                     - Число     - в зависимости от типа формируются параметры выгрузки.
//  ВерсияMSProject                 - Число     - Номер используемой версии MS Project.
//  РучныеСроки                     - Булево    - признак использования ручных сроков.
// 
// Возвращаемое значение:
//  Строка - адрес файла выгрузки во временном хранилище.
//
Функция ЭкспортВMSProject(НеведомыйОбъект, ТипВыгрузки, УровеньПланированияТрудозатрат = Неопределено,
	ВерсияMSProject = 0, РучныеСроки = Ложь) Экспорт
	
	АдресФайлаВыгрузкиВоВременномХранилище = "";
	
	СтруктураДанных = ПолучитьСтруктуруДанных(НеведомыйОбъект, РучныеСроки);
	СтруктураДанных.Вставить("ВерсияMSProject", ВерсияMSProject);
	СтруктураДанных.Вставить("УровеньПланированияТрудозатрат", УровеньПланированияТрудозатрат);
	
	ВыгрузитьДанныеВMSProject(СтруктураДанных, , , ТипВыгрузки, АдресФайлаВыгрузкиВоВременномХранилище);
	
	Возврат АдресФайлаВыгрузкиВоВременномХранилище;
	
КонецФункции

// Функция - Проверить выгрузку
//
// Параметры:
//  Параметры	 - Структура:
//		* ТипВыгрузки - Число - в качестве ресурсов выгрузить роли - 0;
//							    в качестве ресурсов выгрузить исполнителей (трудовые ресурсы) - 1;
//		* ВерсияMSP - Число - версия MS Project для выбора схемы выгрузки данных;
//		* ОткрытьВMSP - Булево - признак необходимости открытия файла в MS Project;
//		* РучныеСроки - Булево - признак установки ручных сроков;
//		* Проект - СправочникСсылка.Проекты - проект, экспорт которого должен осуществиться в MS Project.
// 
// Возвращаемое значение:
//  Булево - признак наличия ошибок. 
//
Функция ПроверитьВыгрузку(Параметры) Экспорт
	
	СтруктураДанных = ПолучитьСтруктуруДанных(Параметры.Проект, Параметры.РучныеСроки);
	СтруктураДанных.Вставить("ВерсияMSProject", Параметры.ВерсияMSP);
	
	Если НЕ ПараметрыСеанса.упоОтключитьПроверкуОграничений
		И НЕ ВыполнитьПроверкуСтруктурыПроекта(СтруктураДанных) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

// Строит общую таблицу связей всех элементов проекта.
//
// Параметры:
//	ОсновнойПроект - СправочникСсылка.Проекты - проект, для которого строится таблица связей.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица связей.
//
Функция ПостроитьСписокСвязей(ОсновнойПроект) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = ЗапросСписокСвязейПроекта();
	Запрос.УстановитьПараметр("Проект", ОсновнойПроект);
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ОсновнойПроект));
	
	ТаблицаСвязейПроекта = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСвязейПроекта;	
	
КонецФункции

// Получает структуру данных, необходимых для экспорта проекта в MS Project, в зависимости от типа параметра.
//
// Параметры:
//  ЧерныйЯщик	 - Произвольный	 - объект, на основании которого надо получить структуру данных для экспорта.
//  РучныеСроки	 - Булево		 - признак выгрузки с ручными сроками.
// 
// Возвращаемое значение:
//  Структура - структура данных.
//
Функция ПолучитьСтруктуруДанных(ЧерныйЯщик, РучныеСроки) Экспорт
	
	СтруктураДанных = Новый Структура();
	// Многие таблицы уже есть в переданных объектах.
	
	// Выгружаем проект в различных вариантах вызова.
	Если ТипЗнч(ЧерныйЯщик) = Тип("СправочникОбъект.Проекты") 
		ИЛИ ТипЗнч(ЧерныйЯщик) = Тип("СправочникСсылка.Проекты") Тогда
		
		// Если это главный проект - сразу начинаем печатать иначе нужно сначало получить главный проект.
		
		Если ЗначениеЗаполнено(ЧерныйЯщик.Родитель) Тогда
			СтруктураДанных.Вставить("Проект", ЧерныйЯщик.Ссылка.упоКорневойПроект);
		Иначе
			СтруктураДанных.Вставить("Проект", ЧерныйЯщик.Ссылка);	
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ЧерныйЯщик) = Тип("СправочникСписок.Проекты") Тогда
		
		СтруктураДанных.Вставить("Проект", ЧерныйЯщик.ТекущиеДанные.Ссылка);
				
	ИначеЕсли (ТипЗнч(ЧерныйЯщик) = Тип("ДокументСсылка.упоПроектнаяЗадача") 
		ИЛИ ТипЗнч(ЧерныйЯщик) = Тип("ДокументОбъект.упоПроектнаяЗадача")) Тогда
		
		СтруктураДанных.Вставить("Проект", ЧерныйЯщик.Проект);
		
	ИначеЕсли ТипЗнч(ЧерныйЯщик) = Тип("ОбработкаОбъект.упоАнализВыполнимостиПроектов") Тогда
		
		ИсходнаяТаблицаОбработки = ЧерныйЯщик.ПроектныеЗадачи.Выгрузить();
		
		мКолонки = Новый Массив;
		Для Каждого Колонка Из ИсходнаяТаблицаОбработки.Колонки Цикл
			Если мКолонки.Количество() > 0 Тогда
				мКолонки.Добавить(", ");
			КонецЕсли;	
			мКолонки.Добавить("ИсходнаяТаблица.");
			мКолонки.Добавить(Колонка.Имя);
		КонецЦикла;
		СтрокаПолей = СтрСоединить(мКолонки);
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ * 
				 		|ПОМЕСТИТЬ ИсходнаяТаблица		
				 		|ИЗ &ИсходнаяТаблица КАК ИсходнаяТаблица
				 		|;
				 		|ВЫБРАТЬ РАЗРЕШЕННЫЕ *,
				 		|	СвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха,
						|	СвойстваПроектныхЗадачСрезПоследних.Длительность КАК Длительность
				 		|ИЗ ИсходнаяТаблица КАК ИсходнаяТаблица
				 		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ) КАК СвойстваПроектныхЗадачСрезПоследних
				 		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
				 		|			ПО СвойстваПроектныхЗадачСрезПоследних.Версия = ВерсииПроекта.Версия
				 		|				И ВерсииПроекта.Текущая
						|				И НЕ СвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
				 		|		ПО ИсходнаяТаблица.ПроектнаяЗадача = СвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "*", СтрокаПолей);
		Запрос.УстановитьПараметр("ИсходнаяТаблица", ИсходнаяТаблицаОбработки);
		ИсходнаяТаблица = Запрос.Выполнить().Выгрузить();
		
		Если НЕ ИсходнаяТаблица.Колонки.Найти("НазваниеПроектнойОперации") = Неопределено Тогда
			ИсходнаяТаблица.Колонки.НазваниеПроектнойОперации.Имя = "Name";
		КонецЕсли;
		
		Если НЕ ИсходнаяТаблица.Колонки.Найти("ДатаНачала") = Неопределено Тогда
			ИсходнаяТаблица.Колонки.ДатаНачала.Имя = "Start";
		КонецЕсли;
		
		Если НЕ ИсходнаяТаблица.Колонки.Найти("ДатаЗавершения") = Неопределено Тогда
			ИсходнаяТаблица.Колонки.ДатаЗавершения.Имя = "Finish";
		КонецЕсли;
		
		Если ИсходнаяТаблица.Колонки.Найти("КодСДР") = Неопределено Тогда
			ИсходнаяТаблица.Колонки.Добавить("КодСДР");
		КонецЕсли;

		Если НЕ ИсходнаяТаблица.Колонки.Найти("ПроектнаяЗадача") = Неопределено Тогда
			ИсходнаяТаблица.Колонки.ПроектнаяЗадача.Имя =  "ПроектнаяЗадача_";
		КонецЕсли;

		// Добавим Код СДР.
		ИсходнаяТаблица.Колонки.Добавить("Родитель");
		ИсходнаяТаблица.Колонки.Добавить("ПроектнаяЗадача");
		ИсходнаяТаблица.Колонки.Добавить("Описание");
       	ИсходнаяТаблица.Колонки.Добавить("РучнойВводСроков");
       	ТаблицаРолей = ИсходнаяТаблица.Скопировать(,"Роль");
		ИсходнаяТаблица.Индексы.Добавить("Роль");
		ТаблицаРолей.Свернуть("Роль");
		СчКодаСДР = 0;
		Для каждого СтрокаТаблицыРолей Из ТаблицаРолей  Цикл
			
			Отбор = Новый Структура("Роль",СтрокаТаблицыРолей.Роль);
			МассивСтрок = ИсходнаяТаблица.НайтиСтроки(Отбор);
			СчКодаСДР = СчКодаСДР+1;
			ИндексЭлементаМассива = 0;
			флагДобавитьСуммирующуюЗадачу = Истина;
			ИтогоStart = Дата('99990101000000');
			ИтогоFinish = Дата('00010101000000');
			Для каждого ЭлементМассивСтрок Из МассивСтрок  Цикл
				
				// Вставим в исходную таблицу групповые строки(суммирующими задачами у нас будут роли).
		        Если флагДобавитьСуммирующуюЗадачу Тогда
					СуммирующаяЗадача = ИсходнаяТаблица.Добавить();
				    ЗаполнитьЗначенияСвойств(СуммирующаяЗадача,ЭлементМассивСтрок);
					СуммирующаяЗадача.Name = СтрокаТаблицыРолей.Роль;
					СуммирующаяЗадача.Родитель = СтрокаТаблицыРолей.Роль;
					СуммирующаяЗадача.ПроектнаяЗадача = СтрокаТаблицыРолей.Роль;
					СуммирующаяЗадача.КодСДР = Строка(СчКодаСДР);
					СуммирующаяЗадача.ПроектнаяОперация = Документы["упоПроектнаяЗадача"].ПустаяСсылка();
					флагДобавитьСуммирующуюЗадачу = НЕ флагДобавитьСуммирующуюЗадачу;
					СуммирующаяЗадача.Описание = "";
					СуммирующаяЗадача.РучнойВводСроков = Истина;
				КонецЕсли; 
		    
				ИтогоStart = Мин(ИтогоStart,ЭлементМассивСтрок.Start);
				ИтогоFinish = Макс(ИтогоFinish,ЭлементМассивСтрок.Finish);
				ИндексЭлементаМассива = ИндексЭлементаМассива+1;
				ЭлементМассивСтрок.КодСДР = Строка(СчКодаСДР)+"."+Строка(ИндексЭлементаМассива);
				ЭлементМассивСтрок.Родитель = СтрокаТаблицыРолей.Роль; 
				ЭлементМассивСтрок.ПроектнаяЗадача =ЭлементМассивСтрок.ПроектнаяЗадача_;
				// Добавим информацию о трудозатратах.
				ЭлементМассивСтрок.Описание = "" + Формат(ЭлементМассивСтрок.ЗагрузкаРесурса, "ЧДЦ=2; ЧРД=.") 
					+ " ч. (" + ЭлементМассивСтрок.Проект + ")";
				ЭлементМассивСтрок.РучнойВводСроков = Истина;
			КонецЦикла;
			
			// Поставим итоговые даты.
			СуммирующаяЗадача.Start = ИтогоStart;
			СуммирующаяЗадача.Finish = ИтогоFinish;
		КонецЦикла; 
		
		СтруктураДанных = Новый Структура("Задачи", ИсходнаяТаблица);
		
	ИначеЕсли ТипЗнч(ЧерныйЯщик) = Тип("ОбработкаОбъект.упоПанельПоказателей") Тогда
		
		ИсходнаяТаблица = Новый ТаблицаЗначений();
		
		ИсходнаяТаблица.Колонки.Добавить("Родитель");
		ИсходнаяТаблица.Колонки.Добавить("ПроектнаяЗадача");
		ИсходнаяТаблица.Колонки.Добавить("Описание");
		ИсходнаяТаблица.Колонки.Добавить("КодСДР");

		ИсходнаяТаблица.Колонки.Добавить("Start");
		ИсходнаяТаблица.Колонки.Добавить("Finish");
		ИсходнаяТаблица.Колонки.Добавить("Name");
		ИсходнаяТаблица.Колонки.Добавить("Проект");
		ИсходнаяТаблица.Колонки.Добавить("СтатусПроекта");
		ИсходнаяТаблица.Колонки.Добавить("СтатусПроектнойЗадачи");
		ИсходнаяТаблица.Колонки.Добавить("ЭтоВеха");
		ИсходнаяТаблица.Колонки.Добавить("ЭтоМодельПакетаРабот");
		ИсходнаяТаблица.Колонки.Добавить("ЭтоПроектнаяЗадача");
		ИсходнаяТаблица.Колонки.Добавить("ПакетРабот");
		ИсходнаяТаблица.Колонки.Добавить("Длительность");
		ИсходнаяТаблица.Колонки.Добавить("РучнойВводСроков");
		
		ТаблицаСвязейПроекта = Новый ТаблицаЗначений();
		ТаблицаСвязейПроекта.Колонки.Добавить("КонецСвязи");
		ТаблицаСвязейПроекта.Колонки.Добавить("НачалоСвязи");
		ТаблицаСвязейПроекта.Колонки.Добавить("ТипСвязиЭлементов");
		ТаблицаСвязейПроекта.Колонки.Добавить("Задержка");
		ТаблицаСвязейПроекта.Колонки.Добавить("ТипСвязи");

		СчКодаСДР = 0;
		ВыгрузитьДеревоПоказателейПроектов(ЧерныйЯщик.ДеревоПоказателейПроектов.Строки, ИсходнаяТаблица, ТаблицаСвязейПроекта);
		ТаблицаСвязейПроекта.Свернуть("КонецСвязи,НачалоСвязи,ТипСвязиЭлементов,Задержка,ТипСвязи");
		
		СтруктураДанных.Вставить("Задачи",ИсходнаяТаблица);
		СтруктураДанных.Вставить("ТаблицаСвязейПроекта",ТаблицаСвязейПроекта);
		
	ИначеЕсли ТипЗнч(ЧерныйЯщик) = Тип("Структура") Тогда
		
		// Можно передать что угодно, но соблюдаем некоторые правила:
		// ОсновнойПроект - "СправочникСсылка.Проекты"
		// ДатаСреза	- "Дата", если дата не передана, то берется ТекущаяДата, используется для выборки из регистров
		// и указания актуальных дат;
		// СписокПроектныхЗадач - "Массив" - проектные задачи выгруженные из тз Задачи;	
		// ВыделенныеТрудовыеРесурсы - "Массив" содержащих трудовые ресурсы выделенные на Проект;
		// ТрудовыеРесурсыПроектныхЗадач - "Массив" содержащих трудовые ресурсы выделенные
		// на ПроектныеЗадачи из СписокПроектныхЗадач;
		// Задачи - "ТаблицаЗначений" - Обязательно нужно выгрузить таблицу задач в слудующей минимальной структуре.
		// Колонки:
		//	"Name" - обязательно строка;
        //	"Start" - обязательно дата;
        //	"Finish" - обязательно дата;
		// ТаблицаСвязейПроекта - "ТаблицаЗначений" - Таблица предшественников, определяющая связи в MSP между задачами;
		// Обязательна следующая структура:
		//	КонецСвязи 			- "ДокументСсылка.ПроектнаяЗадача";
		//  НачалоСвязи 		- "ДокументСсылка.ПроектнаяЗадача";
		//	ЗадачаПредшественник;
		//  ТипСвязи			- "Число";
		//	Задержка.
		
		СтруктураДанных = ЧерныйЯщик;
		
	КонецЕсли;	
	
	Если СтруктураДанных.Свойство("Проект") Тогда
		СтруктураДанных.Вставить("РучныеСроки", РучныеСроки);
	КонецЕсли;	
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ВыгрузитьДеревоПоказателейПроектов(ДеревоЗначений, ИсходнаяТаблица, ТаблицаСвязейПроекта, СчКодаСДРРодитель = "", Родитель = Неопределено)
	
	СчКодаСДР = 0;	
	Для каждого СтрокаТаблицыГруппировок Из ДеревоЗначений  Цикл
		НоваяСтрока = ИсходнаяТаблица.Добавить();
		СчКодаСДР = СчКодаСДР + 1;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыГруппировок);
		
		НоваяСтрока.Родитель = ?(Родитель = Неопределено, Документы.упоПроектнаяЗадача.ПустаяСсылка(), Родитель);
		НоваяСтрока.Name = Строка(СтрокаТаблицыГруппировок.Группировка);
		НоваяСтрока.КодСДР = СчКодаСДРРодитель + ?(СчКодаСДРРодитель = "", "", ".") + СчКодаСДР;
		НоваяСтрока.СтатусПроектнойЗадачи = СтрокаТаблицыГруппировок.СтатусЗадачи;
		НоваяСтрока.Описание = "";
		
		НоваяСтрока.Start = СтрокаТаблицыГруппировок.ДатаНачала_ДГ; //Дата('00010101000000');
		НоваяСтрока.Finish = СтрокаТаблицыГруппировок.ДатаЗавершения_ДГ; //Дата('00010101000000');
		НоваяСтрока.Длительность = Окр((КонецДня(НоваяСтрока.Finish) - НачалоДня(НоваяСтрока.Start) + 1) /3600 , 0); /// (60*60*24)
		НоваяСтрока.РучнойВводСроков = Истина;
		
		НоваяСтрока.ПакетРабот = СтрокаТаблицыГруппировок.ЭтоМодельПакетаРабот Или Не СтрокаТаблицыГруппировок.ЭтоПроектнаяЗадача;
		НоваяСтрока.ПроектнаяЗадача = СтрокаТаблицыГруппировок.Группировка;
		
		Если ТипЗнч(СтрокаТаблицыГруппировок.Группировка) = Тип("СправочникСсылка.Проекты") Тогда
			НоваяСтрока.Проект = СтрокаТаблицыГруппировок.Группировка;
		    Если ЗначениеЗаполнено(СтрокаТаблицыГруппировок.Группировка.СсылкаНаПроектнуюЗадачу) Тогда
				НоваяСтрока.ПроектнаяЗадача = СтрокаТаблицыГруппировок.Группировка.СсылкаНаПроектнуюЗадачу;
				НоваяСтрока.Проект = НоваяСтрока.ПроектнаяЗадача.Проект;
			КонецЕсли;
		КонецЕсли;	
			
		// Обязательна следующая структура:
		//	КонецСвязи 			- "ДокументСсылка.ПроектнаяЗадача";
		//  НачалоСвязи 		- "ДокументСсылка.ПроектнаяЗадача";
		//  ТипСвязи			- "Число";
		//	Задержка.

		Элемент = Неопределено;
		ЭлементПредшественник = Неопределено;
		Для Каждого Связь Из СтрокаТаблицыГруппировок.СвязиВПроектеДГ Цикл
			НоваяСтрокаСвязи = ТаблицаСвязейПроекта.Добавить();
			
			Если Связь.Значение.Свойство("Элемент", Элемент) Тогда
				Если ТипЗнч(Элемент) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
					НоваяСтрокаСвязи.КонецСвязи = Элемент;
				Иначе
					НоваяСтрокаСвязи.КонецСвязи = Элемент.СсылкаНаПроектнуюЗадачу;
				КонецЕсли;
			КонецЕсли;
			Если Связь.Значение.Свойство("ЭлементПредшественник", ЭлементПредшественник) Тогда
				Если ТипЗнч(ЭлементПредшественник) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
					НоваяСтрокаСвязи.НачалоСвязи = ЭлементПредшественник;
				Иначе
					НоваяСтрокаСвязи.НачалоСвязи = ЭлементПредшественник.СсылкаНаПроектнуюЗадачу;
				КонецЕсли;
			КонецЕсли;
			Связь.Значение.Свойство("ТипСвязи", НоваяСтрокаСвязи.ТипСвязиЭлементов);
			Связь.Значение.Свойство("Задержка", НоваяСтрокаСвязи.Задержка);
			НоваяСтрокаСвязи.Задержка = ?(ЗначениеЗаполнено(НоваяСтрокаСвязи.Задержка),НоваяСтрокаСвязи.Задержка,0);
			НоваяСтрокаСвязи.ТипСвязи = ?(ТипЗнч(НоваяСтрокаСвязи.НачалоСвязи) = Тип("ДокументСсылка.упоПроектнаяЗадача"), 1, 0);
		КонецЦикла;
		
		Для Каждого Связь Из СтрокаТаблицыГруппировок.СвязиМеждуПроектамиДГ Цикл
			НоваяСтрокаСвязи = ТаблицаСвязейПроекта.Добавить();
			Если Связь.Значение.Свойство("Элемент", Элемент) Тогда
				Если ТипЗнч(Элемент) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
					НоваяСтрокаСвязи.КонецСвязи = Элемент;
				Иначе
					НоваяСтрокаСвязи.КонецСвязи = Элемент.СсылкаНаПроектнуюЗадачу;
				КонецЕсли;
			КонецЕсли;
			Если Связь.Значение.Свойство("ЭлементПредшественник", ЭлементПредшественник) Тогда
				Если ТипЗнч(ЭлементПредшественник) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
					НоваяСтрокаСвязи.НачалоСвязи = ЭлементПредшественник;
				Иначе
					НоваяСтрокаСвязи.НачалоСвязи = ЭлементПредшественник.СсылкаНаПроектнуюЗадачу;
				КонецЕсли;
			КонецЕсли;
			Связь.Значение.Свойство("ТипСвязи", НоваяСтрокаСвязи.ТипСвязиЭлементов);
			Связь.Значение.Свойство("Задержка", НоваяСтрокаСвязи.Задержка);
			НоваяСтрокаСвязи.Задержка = ?(ЗначениеЗаполнено(НоваяСтрокаСвязи.Задержка),НоваяСтрокаСвязи.Задержка,0);
			НоваяСтрокаСвязи.ТипСвязи = ?(ТипЗнч(НоваяСтрокаСвязи.НачалоСвязи) = Тип("ДокументСсылка.упоПроектнаяЗадача"), 1, 0);
		КонецЦикла;

		Если СтрокаТаблицыГруппировок.Строки.Количество() <> 0 Тогда
			ВыгрузитьДеревоПоказателейПроектов(СтрокаТаблицыГруппировок.Строки, ИсходнаяТаблица, ТаблицаСвязейПроекта, НоваяСтрока.КодСДР, НоваяСтрока.ПроектнаяЗадача);
		КонецЕсли;			
		
	КонецЦикла;
		
КонецПроцедуры

// Получает статус проекта и руководителя проекта.
//
// Параметры:
//  Параметры	 - Структура - структура входных параметров.
//
// Возвращаемое значение:
//	Структура - структура свойств проекта. Свойства:
//		* СтатусПроекта 		- ПеречислениеСсылка.упоСостояниеСтатусаПроекта - статус.
//		* РуководительПроекта 	- СправочникСсылка.упоСотрудники - руководитель.
//
Функция ПолучитьСвойстваПроекта(Параметры) Экспорт
	
	Структура = Новый Структура;
	
	Запрос = Новый Запрос();
	Запрос.Текст = ЗапросСостояниеПроекта();
	Запрос.УстановитьПараметр("Проект", Параметры.Основнойпроект);
		
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Структура.Вставить("СтатусПроекта", Результат.СтатусПроекта);
		Структура.Вставить("РуководительПроекта", Результат.РуководительПроекта);
	Иначе
		Структура.Вставить("СтатусПроекта", Перечисления.упоСостояниеСтатусаПроекта.ПустаяСсылка());
		Структура.Вставить("РуководительПроекта", Справочники.упоСотрудники.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

// Формирует xml-файл для загрузки в MS Project. В зависимости от контекста выполнения либо
// вызывает сразу процедуру загрузки сформированного фалйла в MS Project, либо возвращает
// в параметре "АдресФайлаВыгрузкиВоВременномХранилище" адрес файла во внутреннем хранилище.
//
// Параметры:
//  СтруктураДанных  	- Структура - структура данных для формирования файла.
//  Режим	  			- Строка 	- в зависимости от режима осуществляется или загрузка или печать.
//						  Возможные варианты: "ВыгрузитьMSP", "ПредварительныйПросмотрMSP".
//	ВыводитьСообщения	- Булево 	- выводить или нет дополнительные сообщения.
//	ТипВыгрузки			- Число 	- в зависимости от типа формируются параметры выгрузки.
//	АдресФайлаВыгрузкиВоВременномХранилище - Строка - в этом параметре возвращается адрес 
//						  файла выгрузки во врмеменном хранилище (в зависимости от контекста выполнения).
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ВыгрузитьДанныеВMSProject(СтруктураДанных,
								  Режим = "ВыгрузитьMSP",
								  ВыводитьСообщения = Ложь,
								  ТипВыгрузки,
								  АдресФайлаВыгрузкиВоВременномХранилище = "") Экспорт

	// Создаем временный файл, в который будем записывать xml данные.
	ИмяФайлаXML = "";
	Файл = СоздатьВременныйФайл("xml", ИмяФайлаXML);
	Если Файл = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	Если ВыводитьСообщения Тогда
		НСтрока = НСтр("ru = 'Создан файл XML ""Project"": %1'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ИмяФайлаXML);
		Сообщение.Сообщить();
	КонецЕсли;
	
	// Создаем XML-схему для элемента <Project> MS Project.
	ИмяФайлаСхемаXSD = СоздатьCхемаXSDProject(ВыводитьСообщения, СтруктураДанных.ВерсияMSProject);
	Если ИмяФайлаСхемаXSD = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Создания фабрики XDTO на основе схемы XML и сопутствующих выгрузки параметров.
	Параметры = ПолучитьПараметрыВыгрузки(СтруктураДанных, ИмяФайлаСхемаXSD, ТипВыгрузки);
	
	ОбъектXDTOProject = СоздатьЗаполнитьОбъектXDTOProject(Параметры,Параметры.ТипОбъектаProject, ТипВыгрузки);
	
	// Создаем объект записи xml документа и открываем файл.
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайлаXML);
	
	// Сериализатор значений в XML на основе XDTO.
	ТекСериализаторXDTO = Новый СериализаторXDTO(Параметры.Фабрика);
	// Записываем переданный XDTO заполненный объект Project в формате xml по схеме MS Project.
	ТекСериализаторXDTO.Фабрика.ЗаписатьXML(ЗаписьXML, ОбъектXDTOProject, "Project");
	
	ЗаписьXML.Закрыть();
	
	// По какой-то причине не записывается стандартная строка xml.
	ДобавитьСтрокуВерсииXML(Файл, ИмяФайлаXML, ВыводитьСообщения);
	
	АдресФайлаВыгрузкиВоВременномХранилище = 
		ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайлаXML), Новый УникальныйИдентификатор());
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЕстьТолькоНеТребующиеИсправленияОшибкиВСрокахЗадач(СтруктураДанных) Экспорт
	
	Если Не СтруктураДанных.Свойство("Проект") Или Не ЗначениеЗаполнено(СтруктураДанных.Проект) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ОбъектупоПроверкаСтруктурыПроекта = Обработки.упоПроверкаСтруктурыПроекта.Создать();
		
	ОбъектупоПроверкаСтруктурыПроекта.Проект = СтруктураДанных.Проект;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиЗаполненностиДат = Истина;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиСроковЗадач = Истина;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиЗаполненностиДат = Истина;
	
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиСтруктурыЗадач = Истина;
	
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиЗацикливания = Истина;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиПредУсловийЗадач = Истина;	
	
	ТаблицаОшибок = ОбъектупоПроверкаСтруктурыПроекта.ВыполнитьПроверкуСтруктурыПроекта();
	
	Если ТаблицаОшибок = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если ТаблицаОшибок.Задачи.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТаблицаОшибок.Общие.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеОшибкиНеТребующейИсправления = НСтр("ru = 'у задачи-родителя установлен ручной режим ввода сроков, исправление необязательно'");
	
	Для Каждого СтрокаОшибки Из ТаблицаОшибок.Задачи Цикл
		
		Если СтрНайти(СтрокаОшибки.ЗадачаТекстОшибки, ОписаниеОшибкиНеТребующейИсправления) = 0 Тогда
			Возврат Ложь;	
		КонецЕсли;
			
	КонецЦикла; 	
	
	Возврат Истина;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьПроверкуСтруктурыПроекта(СтруктураДанных)

	// Если свойства проект нет, то и проверить мы ничего не можем.
	Если Не СтруктураДанных.Свойство("Проект") Или Не ЗначениеЗаполнено(СтруктураДанных.Проект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОбъектупоПроверкаСтруктурыПроекта = Обработки.упоПроверкаСтруктурыПроекта.Создать();
	
	ОбъектупоПроверкаСтруктурыПроекта.Проект = СтруктураДанных.Проект;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиЗаполненностиДат = Истина;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиСроковЗадач = Истина;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиЗаполненностиДат = Истина;
	
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиСтруктурыЗадач = Истина;
	
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиЗацикливания = Истина;
	ОбъектупоПроверкаСтруктурыПроекта.ПризнакПроверкиПредУсловийЗадач = Истина;
	
	ТаблицаОшибок = ОбъектупоПроверкаСтруктурыПроекта.ВыполнитьПроверкуСтруктурыПроекта();
	
	Если Не (ТаблицаОшибок = Неопределено)
		И (ТаблицаОшибок.Задачи.Количество() <> 0 ИЛИ ТаблицаОшибок.Общие.Количество() <> 0) Тогда // Если ошибки есть.
		
		// Выведем таблицу ошибок.
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В проекте ""%1"" обнаружены ошибки:'"), СтруктураДанных.Проект);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ОбъектупоПроверкаСтруктурыПроекта.ВывестиТаблицуОшибок(ТаблицаОшибок);
		Возврат Ложь;
		
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

Функция ВычислитьДлительностьMSProject(Параметры, ДатаНачала, ДатаКонец, ЭтоВеха, СтрокаЗадача)

	КоличестворабочихЧасов = 8;
	ЗначениеMSProject = "PT0H0M0S"; // Латинские символы.
	//СчетчикДата = НачалоДня(ДатаНачала);
	СчетчикДата = ДатаНачала;
	ИтогоРабочихСекунд = 0;
	
	// Определим количество нерабочих дней в интервале.
	ИтогоНерабочихДнейВинтервале = 0;
	
	Если ЭтоВеха Тогда
		ИтогоРабочихСекунд = 0;
	Иначе
		ИтогоРабочихСекунд = СтрокаЗадача.Длительность * 3600;
	КонецЕсли;
	
	//Пока СчетчикДата <= НачалоДня(ДатаКонец) Цикл
	//	
	//	Если ДеньНедели(СчетчикДата) = 6 ИЛИ ДеньНедели(СчетчикДата) = 7
	//		И (Параметры.ТаблицаИсключенийДат.Найти(НачалоДня(СчетчикДата), "FromDate") = Неопределено) Тогда
	//		
	//		ИтогоНерабочихДнейВинтервале = ИтогоНерабочихДнейВинтервале + 1;
	//		
	//	Иначе
	//		
	//		ИтогоРабочихСекунд = ИтогоРабочихСекунд + 3600 * КоличестворабочихЧасов;
	//		
	//	КонецЕсли;
	//	
	//	СчетчикДата = СчетчикДата + 3600 * 24;
	//	
	//КонецЦикла; 
	
	//Пока СчетчикДата <= ДатаКонец Цикл
	//	
	//	Если ДеньНедели(СчетчикДата) = 6 ИЛИ ДеньНедели(СчетчикДата) = 7
	//		И (Параметры.ТаблицаИсключенийДат.Найти(НачалоДня(СчетчикДата), "FromDate") = Неопределено) Тогда
	//		
	//		ИтогоНерабочихДнейВинтервале = ИтогоНерабочихДнейВинтервале + 1;
	//		
	//	Иначе
	//		
	//		МаксимальнаяДатаВДень = НачалоДня(СчетчикДата) + 8 * 3600 - 1;
	//		
	//					

	//		КонецДняПоЗадаче = Мин(ДатаКонец, 
	//		
	//		ИтогоРабочихСекунд = ИтогоРабочихСекунд + 3600 * КоличестворабочихЧасов;
	//		
	//	КонецЕсли;
	//	
	//	СчетчикДата = СчетчикДата + 3600 * 24;
	//	
	//КонецЦикла; 	
	
	Если ТипЗнч(ИтогоРабочихСекунд) = Тип("Число") Тогда // Значение содержит количество сек.
		
		//ИтогоРабочихСекунд = ?(ИтогоРабочихСекунд =0, КоличестворабочихЧасов*3600,ИтогоРабочихСекунд);
		
		//Если ЭтоВеха Тогда
		//	ИтогоРабочихСекунд = 0;
		//Конецесли;
				
		Часы 	= Цел(ИтогоРабочихСекунд/3600);
		Минуты 	= Цел((ИтогоРабочихСекунд - Часы*3600)/60);
		Секунды = ИтогоРабочихСекунд - Часы*3600 - Минуты*60;
		
		ЗначениеMSProject = "PT" + ?(Часы=0, "0", Формат(Часы, "ЧГ=0"))
			+ "H" + ?(Минуты = 0, "0", Формат(Минуты,"ЧГ=0")) + "M" + ?(Секунды = 0, "0", Формат(Секунды, "ЧГ=0")) + "S";
	КонецЕсли;
	
	Возврат ЗначениеMSProject;
	
КонецФункции

Процедура ДобавитьСтрокуВерсииXML(Файл, ИмяФайлаXML, ВыводитьСообщения)

	Файл.Прочитать(ИмяФайлаXML);
	ТекстНачала = "<?xml version=""1.0"" encoding=""UTF-8"" standalone=""yes"" ?> " + Символы.ПС;
	Файл.УстановитьТекст(ТекстНачала + Файл.ПолучитьТекст());
	Файл.Записать(ИмяФайлаXML);
	
	Если ВыводитьСообщения Тогда
		НСтрока = НСтр("ru = 'Записан файл XML ""Project"": %1'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ИмяФайлаXML);
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

// Сначала создается объект ЧтениеXML и открывается файл XML, расположенный на диске.
// После этого с помощью построителя документа DOM, создается объект ДокументDOM, 
// содержащий данные файла XML. Затем с помощью построителя схемы XML на основе документа 
// DOM создается новый объект СхемаXML, содержащий данные схемы XML. В заключении создается 
// пустой набор схем XML, в который добавляется имеющаяся схема XML, и на основании этого набора
// создается фабрика XDTO.
Функция СоздатьФабрикуXDTOнаОсновеСхемыXSD(ИмяФайлаXSD)
	
	// Создать объект чтения XML по умолчанию.
	ЧтениеXMLСхемаXSD = Новый ЧтениеXML;
	
	// Открыть файл XML.
	ЧтениеXMLСхемаXSD.ОткрытьФайл(ИмяФайлаXSD);
	
	// Создать построитель документа DOM по умолчанию.
	ПостроительDOMСхемаXSD = Новый ПостроительDOM;
	
	// Прочитать файл XML в документ DOM.
	НовыйДокументDOM = ПостроительDOMСхемаXSD.Прочитать(ЧтениеXMLСхемаXSD);
	
	// Создать построитель схемы XML по умолчанию.
	ПостроительСхемыXML = Новый ПостроительСхемXML;
	
	// Получить схему XML из документа DOM.
	НоваяСхемаXML = ПостроительСхемыXML.СоздатьСхемуXML(НовыйДокументDOM);
	
	// Создать набор схем XML по умолчанию.
	НовыйНаборСхемXML = Новый НаборСхемXML;
	
	// Добавить схему XML в набор схем XML.
	НовыйНаборСхемXML.Добавить(НоваяСхемаXML);
	
	// Создать фабрику XDTO на основе набора схем XML.
	НоваяФабрикаXDTO = Новый ФабрикаXDTO(НовыйНаборСхемXML);	
	
	Возврат НоваяФабрикаXDTO;
	
КонецФункции

Функция СоздатьВременныйФайл(Расширение, ИмяФайла = "")
	
	Файл = Неопределено;
	
	Попытка
		
		ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
		Файл =  Новый ТекстовыйДокумент;
		Файл.Записать(ИмяФайла);
		
	Исключение
		
		НСтрока = НСтр("ru = 'Не удалось создать временный файл:
                        |%1'");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ОписаниеОшибки());
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	Возврат Файл;
	
КонецФункции

Функция СоздатьCхемаXSDProject(ВыводитьСообщения = Ложь, ВерсияMSProject)
	
	Если ВерсияMSProject >= 15 Тогда
		ИмяМакета = "упоCхемаXSDProject2013_for1c";
	Иначе
		ИмяМакета = "упоCхемаXSDProject_for1c";
	КонецЕсли;
	
	// Загружаем адаптированную схему - тип xsd:boolean заменен на xsd:integer.
    Если Метаданные.ОбщиеМакеты.Найти(ИмяМакета) = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'В конфигураторе не найдена схема XSD для печати в MS Project'");
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстCхемаXSDProject = ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст();
	                                      
	ИмяФайла = "";
	Файл = СоздатьВременныйФайл("xsd",ИмяФайла);
	Если Файл = Неопределено Тогда  
		Возврат Неопределено;
	КонецЕсли;	
	
	Файл.УстановитьТекст(ТекстCхемаXSDProject);
	
	Файл.Записать(ИмяФайла);
	
	Если ВыводитьСообщения Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Создана схема XSD ""Project"": '") + ИмяФайла;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ЗапросСписокСвязейПроекта()
	
	// Сразу в запросе будем определять, какой именно тип связи типы следующие:
	//
	// Задача -> Задача.
	//
	// Тип связи будет нужен при построении хитрой диаграммы Ганта
	// (встраивание вех в дерево задач).
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РегСвязи.ПроектнаяЗадача КАК КонецСвязи,
	        |	РегСвязи.ЗадачаПредшественник КАК НачалоСвязи,
	        |	РегСвязи.ТипСвязи КАК ТипСвязиЭлементов,
	        |	РегСвязи.Задержка КАК Задержка,
	        |	ВЫБОР
	        |		КОГДА (ВЫРАЗИТЬ(РегСвязи.ЗадачаПредшественник КАК Документ.упоПроектнаяЗадача)) = РегСвязи.ЗадачаПредшественник
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ТипСвязи
	        |ИЗ
	        |	РегистрСведений.упоПредусловияПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвязи
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК СвойстваПредшественника
	        |		ПО РегСвязи.ЗадачаПредшественник = СвойстваПредшественника.ПроектнаяЗадача
	        |			И (НЕ СвойстваПредшественника.ЗадачаОтменена)
	        |ГДЕ
	        |	РегСвязи.СвязьСуществует
	        |	И НЕ РегСвязи.СвязьМеждуПроектами";    
	
КонецФункции

Функция ПолучитьПараметрыВыгрузки(СтруктураДанных, ИмяФайлаСхемаXSD, ТипВыгрузки)
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ВерсияMSProject",СтруктураДанных.ВерсияMSProject);
	Если СтруктураДанных.ВерсияMSProject >= 15 Тогда
		Параметры.Вставить("URIПространствоИменMSP", 	"http://schemas.microsoft.com/project");
	Иначе
		Параметры.Вставить("URIПространствоИменMSP", 	"http://schemas.microsoft.com/project/2007");
	КонецЕсли;
	Параметры.Вставить("Фабрика",					СоздатьФабрикуXDTOнаОсновеСхемыXSD(ИмяФайлаСхемаXSD));
	
 	Параметры.Вставить("ТипОбъектаProject",			ПолучитьТипОбъектаProject(Параметры));
	// По умолчанию - Project и Calendar = 0 и 1; — это уникальный идентификатор.
	// Его можно использовать в записи данных для всех его родительских элементов.
	Параметры.Вставить("СчетчикUID",				1); 
	Параметры.Вставить("ПустаяДата",				'00010101');
	Параметры.Вставить("ПустаяСтрока",				"");
	Параметры.Вставить("TasksID",					1); // Это указатель позиции задачи в списке задач.
	Параметры.Вставить("ResourcesID",				1); // Это указатель позиции ресурса в списке ресурсов.
	Параметры.Вставить("СоответствиеTasksUID",		Новый Соответствие);
	Параметры.Вставить("СоответствиеResourcesUID",	Новый Соответствие);
	Параметры.Вставить("ПостроительОтчетаТрудРес",	Новый ПостроительОтчета);
	
	ДатаСреза = ?(СтруктураДанных.Свойство("ДатаСреза"),
		?(ЗначениеЗаполнено(СтруктураДанных.ДатаСреза), СтруктураДанных.ДатаСреза, ТекущаяДатаСеанса()), ТекущаяДатаСеанса());
	
	// Элементы могут придти из структуры или их нужно будет собирать уже здесь.
	Параметры.Вставить("ОсновнойПроект",
		?(СтруктураДанных.Свойство("Проект"), СтруктураДанных.Проект, Неопределено));
	Параметры.Вставить("ТекущаяВерсияОсновногоПроекта", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Параметры.ОсновнойПроект));
	Параметры.Вставить("ДатаСреза",	ДатаСреза);
	Параметры.Вставить("ТаблицаСвязейПроекта", ПолучитьТаблицаСвязейПроекта(Параметры, СтруктураДанных));
	Параметры.Вставить("Задачи", ПолучитьТаблицаЗадач(Параметры, СтруктураДанных));
	Параметры.Вставить("СуммирующиеЗадачи", ПолучитьСуммирующиеЗадачи(Параметры,СтруктураДанных));	
	
	// Нужно для того чтобы проджект давал ставить границы задачи на выходные дни.
	Параметры.Вставить("ТаблицаИсключенийДат", ПолучитьТаблицуИсключенийДат(Параметры,СтруктураДанных));	
	
	Параметры.Вставить("УровеньПланированияТрудозатрат", СтруктураДанных.УровеньПланированияТрудозатрат);
	Если ТипВыгрузки = 2 Тогда
		Параметры.Вставить("СписокПроектныхЗадач", ПолучитьСписокПроектныхЗадач(Параметры.Задачи));
		Параметры.Вставить("ВыделенныеТрудовыеРесурсы",
			?(СтруктураДанных.Свойство("ВыделенныеТрудовыеРесурсы"),
			СтруктураДанных.ВыделенныеТрудовыеРесурсы, ПолучитьПустыеВыделенныеТрудовыеРесурсы(Параметры)));
		Параметры.Вставить("ТрудовыеРесурсыПроектныхЗадач",
			?(СтруктураДанных.Свойство("ТрудовыеРесурсыПроектныхЗадач"),
			СтруктураДанных.ТрудовыеРесурсыПроектныхЗадач, ПолучитьПустыеВыделенныеТрудовыеРесурсы(Параметры)));
	ИначеЕсли ТипВыгрузки = 1 Тогда 
		Параметры.Вставить("СписокПроектныхЗадач", ПолучитьСписокПроектныхЗадач(Параметры.Задачи));	
		Параметры.Вставить("ВыделенныеТрудовыеРесурсы",
			?(СтруктураДанных.Свойство("ВыделенныеТрудовыеРесурсы"),
			СтруктураДанных.ВыделенныеТрудовыеРесурсы, ПолучитьВыделенныеТрудовыеРесурсы(Параметры)));
		Параметры.Вставить("ТрудовыеРесурсыПроектныхЗадач",
			?(СтруктураДанных.Свойство("ТрудовыеРесурсыПроектныхЗадач"),
			СтруктураДанных.ТрудовыеРесурсыПроектныхЗадач, ПолучитьТрудовыеРесурсыПроектныхЗадач(Параметры)));
	Иначе 
		Параметры.Вставить("СписокПроектныхЗадач", ПолучитьСписокПроектныхЗадач(Параметры.Задачи));
		Параметры.Вставить("ВыделенныеТрудовыеРесурсы",
			?(СтруктураДанных.Свойство("ВыделенныеТрудовыеРесурсы"),
			СтруктураДанных.ВыделенныеТрудовыеРесурсы, ПолучитьВыделенныеТрудовыеРоли(Параметры)));
		Параметры.Вставить("ТрудовыеРесурсыПроектныхЗадач",
			?(СтруктураДанных.Свойство("ТрудовыеРесурсыПроектныхЗадач"),
			СтруктураДанных.ТрудовыеРесурсыПроектныхЗадач, ПолучитьТрудовыеРолиПроектныхЗадач(Параметры)));			
	КонецЕсли;
	
	Параметры.Вставить("ПостроительОтчетаТрудРес", ЗаполнитьПостроительОтчетаВыделенныеТрудовыеРесурсы(Параметры));
	
	ЗаполнитьДанныеПоКалендарям(Параметры);
	
	Возврат Параметры;
	
КонецФункции

Процедура ЗаполнитьДанныеПоКалендарям(Параметры)
	
	ДатаНачала = Дата('00010101');
	ДатаОкончания = Дата('00010101');
	Для Каждого Задача Из Параметры.Задачи Цикл
		Если ЗначениеЗаполнено(Задача.Start) Тогда
			Если ЗначениеЗаполнено(ДатаНачала) Тогда				
				ДатаНачала = Мин(Задача.Start, ДатаНачала);
			Иначе
				ДатаНачала = Задача.Start;
			КонецЕсли;
		КонецЕсли;		
		ДатаОкончания = Макс(Задача.Finish, ДатаОкончания);
	КонецЦикла;
	
	// Запросом найдем рабочую неделю, выходные, праздники, сокращенные дни.
	// Выходные, праздники и сокращенные дни должны попасть в исключения
	// Рабочую неделю ищем по максимальному количеству дней недели с одинаковой длительностью
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоВерсииПроекта.Версия КАК Версия
	|ПОМЕСТИТЬ ВерсияПроекта
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|ГДЕ
	|	упоВерсииПроекта.Проект = &Проект
	|	И упоВерсииПроекта.Текущая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоКалендариПроектовСрезПоследних.Проект КАК Проект,
	|	упоКалендариПроектовСрезПоследних.КалендарьПроекта КАК Календарь
	|ПОМЕСТИТЬ КалендарьПроекта
	|ИЗ
	|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК упоКалендариПроектовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КалендарьПроекта.Проект КАК ПроектИлиПроектнаяЗадача,
	|	КалендарьПроекта.Календарь КАК Календарь,
	|	ЛОЖЬ КАК ДлительностьБезУчетаКалендаряПроекта
	|ПОМЕСТИТЬ КалендариПроектаИПроектныхЗадач
	|ИЗ
	|	КалендарьПроекта КАК КалендарьПроекта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача,
	|	ВЫБОР
	|		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
	|			ТОГДА КалендарьПроекта.Календарь
	|		ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи
	|	КОНЕЦ,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ДлительностьБезУчетаКалендаряПроекта
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			,
	|			Версия В
	|					(ВЫБРАТЬ
	|						т.Версия
	|					ИЗ
	|						ВерсияПроекта КАК т)
	|				И ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСвойстваПроектныхЗадачСрезПоследних,
	|	КалендарьПроекта КАК КалендарьПроекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоРабочиеКалендариСрезПоследних.Календарь КАК Календарь,
	|	упоРабочиеКалендариСрезПоследних.День КАК День,
	|	упоРабочиеКалендариСрезПоследних.КоличествоЧасов КАК КоличествоЧасов,
	|	ДЕНЬНЕДЕЛИ(упоРабочиеКалендариСрезПоследних.День) КАК ДеньНедели
	|ПОМЕСТИТЬ КалендариСДнямиНедели
	|ИЗ
	|	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	|			,
	|			День МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, НЕДЕЛЯ) И КОНЕЦПЕРИОДА(&ДатаОкончания, НЕДЕЛЯ)
	|				И Календарь В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						т.Календарь
	|					ИЗ
	|						КалендариПроектаИПроектныхЗадач КАК т)) КАК упоРабочиеКалендариСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалендариСДнямиНедели.Календарь КАК Календарь,
	|	КалендариСДнямиНедели.КоличествоЧасов КАК КоличествоЧасов,
	|	КалендариСДнямиНедели.ДеньНедели КАК ДеньНедели,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КалендариСДнямиНедели.День) КАК КоличествоРазличныхДней
	|ПОМЕСТИТЬ КоличествоРазличныхДнейСОдинаковымКоличествомЧасов
	|ИЗ
	|	КалендариСДнямиНедели КАК КалендариСДнямиНедели
	|
	|СГРУППИРОВАТЬ ПО
	|	КалендариСДнямиНедели.Календарь,
	|	КалендариСДнямиНедели.КоличествоЧасов,
	|	КалендариСДнямиНедели.ДеньНедели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.Календарь КАК Календарь,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.ДеньНедели КАК ДеньНедели,
	|	МАКСИМУМ(КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоРазличныхДней) КАК КоличествоРазличныхДней
	|ПОМЕСТИТЬ ДниНеделиСМаксимальнымКоличествомОдинаковыхЧасовРаботы
	|ИЗ
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов КАК КоличествоРазличныхДнейСОдинаковымКоличествомЧасов
	|
	|СГРУППИРОВАТЬ ПО
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.Календарь,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.ДеньНедели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.Календарь КАК Календарь,
	|	МАКСИМУМ(КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоЧасов) КАК КоличествоЧасов,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.ДеньНедели КАК ДеньНедели,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоРазличныхДней КАК КоличествоРазличныхДней
	|ПОМЕСТИТЬ РабочаяНеделя
	|ИЗ
	|	ДниНеделиСМаксимальнымКоличествомОдинаковыхЧасовРаботы КАК ДниНеделиСМаксимальнымКоличествомОдинаковыхЧасовРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоРазличныхДнейСОдинаковымКоличествомЧасов КАК КоличествоРазличныхДнейСОдинаковымКоличествомЧасов
	|		ПО ДниНеделиСМаксимальнымКоличествомОдинаковыхЧасовРаботы.Календарь = КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.Календарь
	|			И ДниНеделиСМаксимальнымКоличествомОдинаковыхЧасовРаботы.ДеньНедели = КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.ДеньНедели
	|			И ДниНеделиСМаксимальнымКоличествомОдинаковыхЧасовРаботы.КоличествоРазличныхДней = КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоРазличныхДней
	|
	|СГРУППИРОВАТЬ ПО
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.Календарь,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.ДеньНедели,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоРазличныхДней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.Календарь КАК Календарь,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоЧасов КАК КоличествоЧасов,
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.ДеньНедели КАК ДеньНедели
	|ПОМЕСТИТЬ Исключения
	|ИЗ
	|	КоличествоРазличныхДнейСОдинаковымКоличествомЧасов КАК КоличествоРазличныхДнейСОдинаковымКоличествомЧасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РабочаяНеделя КАК РабочаяНеделя
	|		ПО КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.Календарь = РабочаяНеделя.Календарь
	|			И КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.ДеньНедели = РабочаяНеделя.ДеньНедели
	|			И КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоРазличныхДней = РабочаяНеделя.КоличествоРазличныхДней
	|			И КоличествоРазличныхДнейСОдинаковымКоличествомЧасов.КоличествоЧасов = РабочаяНеделя.КоличествоЧасов
	|ГДЕ
	|	РабочаяНеделя.Календарь ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Исключения.Календарь КАК Календарь,
	|	Исключения.КоличествоЧасов КАК КоличествоЧасов,
	|	Исключения.ДеньНедели КАК ДеньНедели,
	|	КалендариСДнямиНедели.День КАК День
	|ИЗ
	|	Исключения КАК Исключения
	|		ЛЕВОЕ СОЕДИНЕНИЕ КалендариСДнямиНедели КАК КалендариСДнямиНедели
	|		ПО Исключения.Календарь = КалендариСДнямиНедели.Календарь
	|			И Исключения.КоличествоЧасов = КалендариСДнямиНедели.КоличествоЧасов
	|			И Исключения.ДеньНедели = КалендариСДнямиНедели.ДеньНедели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочаяНеделя.Календарь КАК Календарь,
	|	РабочаяНеделя.КоличествоЧасов КАК КоличествоЧасов,
	|	РабочаяНеделя.ДеньНедели КАК ДеньНедели,
	|	РабочаяНеделя.Календарь.Наименование КАК НаименованиеКалендаря
	|ИЗ
	|	РабочаяНеделя КАК РабочаяНеделя
	|ИТОГИ ПО
	|	Календарь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалендариПроектаИПроектныхЗадач.ПроектИлиПроектнаяЗадача КАК ПроектИлиПроектнаяЗадача,
	|	КалендариПроектаИПроектныхЗадач.Календарь КАК Календарь,
	|	КалендариПроектаИПроектныхЗадач.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта
	|ИЗ
	|	КалендариПроектаИПроектныхЗадач КАК КалендариПроектаИПроектныхЗадач";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Проект", Параметры.ОсновнойПроект);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", Параметры.СписокПроектныхЗадач);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПоследнегоЭлемента = РезультатЗапроса.ВГраница();
	
	КалендариПроектаИПЗ = РезультатЗапроса[ИндексПоследнегоЭлемента].Выбрать();
	РабочаяНеделяКалендарей = 
		РезультатЗапроса[ИндексПоследнегоЭлемента - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ИсключенияКалендарей = РезультатЗапроса[ИндексПоследнегоЭлемента - 2].Выгрузить();
	
	ЗадачиСДлительностьюБезУчетаКалендаря = Новый Соответствие;
	СоответствиеПроектаПЗИКалендаря = Новый Соответствие;
	Пока КалендариПроектаИПЗ.Следующий() Цикл
		Если КалендариПроектаИПЗ.ДлительностьБезУчетаКалендаряПроекта Тогда
			ЗадачиСДлительностьюБезУчетаКалендаря.Вставить(КалендариПроектаИПЗ.ПроектИлиПроектнаяЗадача);
			Продолжить;
		КонецЕсли;
		СоответствиеПроектаПЗИКалендаря.Вставить(КалендариПроектаИПЗ.ПроектИлиПроектнаяЗадача, 
			КалендариПроектаИПЗ.Календарь);			
	КонецЦикла;
	
	СоответствиеКалендаряИЕгоУИДа = Новый Соответствие;
	
	УИДКалендаря = 1;
	КоличествоСекундВЧасе = 3600;
	СвойстваКалендарей = Новый Соответствие;
	ШаблонНаименования = "%1 (PM)";
	Пока РабочаяНеделяКалендарей.Следующий() Цикл
		Календарь = РабочаяНеделяКалендарей.Календарь;
		
		СвойстваКалендаря = Новый Соответствие;
		СвойстваКалендаря.Вставить("UID" , УИДКалендаря);
		НаименованиеКалендаря = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования,
			РабочаяНеделяКалендарей.НаименованиеКалендаря);
		СвойстваКалендаря.Вставить("Name" , НаименованиеКалендаря);
		СвойстваКалендаря.Вставить("IsBaseCalendar" , 1);
		СвойстваКалендаря.Вставить("BaseCalendarUID" , -1);
		СоответствиеКалендаряИЕгоУИДа.Вставить(Календарь, УИДКалендаря);
		
		ЗаполнитьДниРабочейНедели(СвойстваКалендаря, РабочаяНеделяКалендарей, КоличествоСекундВЧасе);		
		ЗаполнитьИсключенияКалендаря(СвойстваКалендаря, Календарь, ИсключенияКалендарей, КоличествоСекундВЧасе);		
		
		СвойстваКалендарей.Вставить(Календарь, СвойстваКалендаря);		
		УИДКалендаря = УИДКалендаря + 1;
		
	КонецЦикла;	           	
	
	Если ЗадачиСДлительностьюБезУчетаКалендаря.Количество() > 0 Тогда
		ЗаполнитьКалендарь24Часа(СвойстваКалендарей, СоответствиеКалендаряИЕгоУИДа, СоответствиеПроектаПЗИКалендаря,
			УИДКалендаря, ЗадачиСДлительностьюБезУчетаКалендаря)		
	КонецЕсли;
	
	Параметры.Вставить("СоответствиеПроектаПЗИКалендаря", СоответствиеПроектаПЗИКалендаря);
	Параметры.Вставить("СоответствиеКалендаряИЕгоУИДа", СоответствиеКалендаряИЕгоУИДа);
	Параметры.Вставить("СвойстваКалендарей", СвойстваКалендарей);	
	
КонецПроцедуры

Процедура ЗаполнитьКалендарь24Часа(СвойстваКалендарей, СоответствиеКалендаряИЕгоУИДа, СоответствиеПроектаПЗИКалендаря,
	УИДКалендаря, ЗадачиСДлительностьюБезУчетаКалендаря)
	
	СвойстваКалендаря = Новый Соответствие;
	СвойстваКалендаря.Вставить("UID" , УИДКалендаря); 
	СвойстваКалендаря.Вставить("Name" , НСтр("ru = '24 часа (PM)'"));
	СвойстваКалендаря.Вставить("IsBaseCalendar" , 1);
	СвойстваКалендаря.Вставить("BaseCalendarUID" , -1);
	
	ДниРабНедели = Новый Соответствие;
	Для Итератор = 1 По 7 Цикл
		РабочееВремя = Новый Структура;		 
		РабочееВремя.Вставить("FromTime", '00010101000000');				
		РабочееВремя.Вставить("ToTime",   '00010101000000');					
		ДниРабНедели.Вставить(Итератор, РабочееВремя);
	КонецЦикла;
	СвойстваКалендаря.Вставить("WorkingTimes", ДниРабНедели);
	
	Исключения = Новый Массив;
	СвойстваКалендаря.Вставить("ИсключенияКалендаря", Исключения);
	
	СвойстваКалендарей.Вставить(УИДКалендаря, СвойстваКалендаря);
	СоответствиеКалендаряИЕгоУИДа.Вставить(УИДКалендаря, УИДКалендаря);
	
	Для Каждого Задача Из ЗадачиСДлительностьюБезУчетаКалендаря Цикл
		СоответствиеПроектаПЗИКалендаря.Вставить(Задача.Ключ, УИДКалендаря);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИсключенияКалендаря(СвойстваКалендаря, Календарь, ИсключенияКалендарей, КоличествоСекундВЧасе)
	
	ИсключенияКалендаря = ИсключенияКалендарей.НайтиСтроки(Новый Структура("Календарь", Календарь));		
	Исключения = Новый Массив;
	Для Каждого Строка Из ИсключенияКалендаря Цикл
		
		РабочееВремя = Новый Структура;
		
		Если Строка.КоличествоЧасов = 0 Тогда
			РабочееВремя.Вставить("DayWorking", 0);
		Иначе
			РабочееВремя.Вставить("DayWorking", 1);				
			РабочееВремя.Вставить("FromTime", Строка.День);
			РабочееВремя.Вставить("ToTime", Строка.День + Строка.КоличествоЧасов * КоличествоСекундВЧасе);
		КонецЕсли;
		
		РабочееВремя.Вставить("НачалоДня", Строка.День);
		РабочееВремя.Вставить("КонецДня", КонецДня(Строка.День));
		
		Исключения.Добавить(РабочееВремя);
		
	КонецЦикла;
	
	СвойстваКалендаря.Вставить("ИсключенияКалендаря", Исключения);	
	
КонецПроцедуры

Процедура ЗаполнитьДниРабочейНедели(СвойстваКалендаря, РабочаяНеделяКалендарей, КоличествоСекундВЧасе)
	
	ДниРабНедели = Новый Соответствие;
	РабочаяНеделяКалендаря = РабочаяНеделяКалендарей.Выбрать();
	Пока РабочаяНеделяКалендаря.Следующий() Цикл
		// Неделя должна начинаться с Воскресенья, т.е. Воскресенье это 1 день недели, а не последний(седьмой)
		ДеньНедели = РабочаяНеделяКалендаря.ДеньНедели;
		Если ДеньНедели = 7 Тогда
			ДеньНедели = 0;
		КонецЕсли;	
		ДеньНедели = ДеньНедели + 1;
		РабочееВремя = Новый Структура;		
		Если РабочаяНеделяКалендаря.КоличествоЧасов <> 0 Тогда 
			РабочееВремя.Вставить("FromTime", '00010101000000');				
			РабочееВремя.Вставить("ToTime", '00010101000000' + РабочаяНеделяКалендаря.КоличествоЧасов * КоличествоСекундВЧасе);    
		КонецЕсли;			
		ДниРабНедели.Вставить(ДеньНедели, РабочееВремя);
		
	КонецЦикла;	
	
	СвойстваКалендаря.Вставить("WorkingTimes", ДниРабНедели);
		
КонецПроцедуры

Функция ПолучитьТаблицаЗадач(Параметры, СтруктураДанных)
	
	ТаблицаЗадач = ?(СтруктураДанных.Свойство("Задачи"), СтруктураДанных.Задачи, ПолучитьВсеTasks(Параметры));	
	
	КолонкаСДР = ТаблицаЗадач.Колонки.Найти("КодСДР");
	Если Не КолонкаСДР = Неопределено Тогда КолонкаСДР.Имя = "WBS" КонецЕсли;
	
	КолонкаЗадачаРодитель = ТаблицаЗадач.Колонки.Найти("ЗадачаРодитель");
	Если Не КолонкаЗадачаРодитель = Неопределено Тогда КолонкаЗадачаРодитель.Имя = "Родитель" КонецЕсли;
	
	КолонкаДатаНачалаПлан = ТаблицаЗадач.Колонки.Найти("ДатаНачалаПлан");
	Если Не КолонкаДатаНачалаПлан = Неопределено Тогда КолонкаДатаНачалаПлан.Имя = "Start" КонецЕсли;
	
	КолонкаДатаЗавершенияПлан = ТаблицаЗадач.Колонки.Найти("ДатаЗавершенияПлан");
	Если Не КолонкаДатаЗавершенияПлан = Неопределено Тогда КолонкаДатаЗавершенияПлан.Имя = "Finish" КонецЕсли;
	
	КолонкаСДР = ТаблицаЗадач.Колонки.Найти("НазваниеПроектнойЗадачи");
	Если Не КолонкаСДР = Неопределено Тогда КолонкаСДР.Имя = "Name" КонецЕсли;
	
	КолонкаОписание = ТаблицаЗадач.Колонки.Найти("Описание");
	Если КолонкаОписание = Неопределено Тогда
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(Тип("Строка"));
		ТаблицаЗадач.Колонки.Добавить("Описание",Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	
	// Присвоим ID задачам.
	ТаблицаЗадач.Колонки.Добавить("UID");
	ТаблицаЗадач.Колонки.Добавить("ID");
	
	Для каждого СтрокаЗадача Из ТаблицаЗадач Цикл
		
		СтрокаЗадача.UID = Параметры.СчетчикUID;
		// ID - отвечает за то в какой строке будет стоять задача, например если  ID = 6 то задачи начнуться с 6-й строки.
		СтрокаЗадача.ID  = Параметры.TasksID;
		
		Параметры.СоответствиеTasksUID.Вставить(СтрокаЗадача.ПроектнаяЗадача, СтрокаЗадача.ID);	
		
		УвеличитьСчетчикUID(Параметры);
		УвеличитьСчетчикID(Параметры)
		
	КонецЦикла; 
	
	Если СтруктураДанных.Свойство("РучныеСроки") И СтруктураДанных.РучныеСроки Тогда
		ТаблицаЗадач.ЗаполнитьЗначения(Истина, "РучнойВводСроков");	
	КонецЕсли;
	
	Возврат ТаблицаЗадач;
	
КонецФункции

Функция ПолучитьСуммирующиеЗадачи(Параметры,СтруктураДанных)
	
	Если ТипЗнч(Параметры.Задачи) = Тип("ТаблицаЗначений") Тогда
		
		ТаблицаСуммирующихЗадач = Новый ТаблицаЗначений;
		ТаблицаСуммирующихЗадач =  Параметры.Задачи.Скопировать();
		Если Не ТаблицаСуммирующихЗадач.Колонки.Найти("Родитель") = Неопределено    Тогда
			
			ОтборСтрок = Новый Структура("Родитель",Документы.упоПроектнаяЗадача.ПустаяСсылка());
			МассивСтрок = ТаблицаСуммирующихЗадач.НайтиСтроки(ОтборСтрок);
			
			Для каждого СтрокаМассивСтрок Из МассивСтрок  Цикл
				
				   ТаблицаСуммирующихЗадач.Удалить(СтрокаМассивСтрок);
			КонецЦикла; 
			
			ТаблицаСуммирующихЗадач.Свернуть("Родитель");
			
			Возврат ТаблицаСуммирующихЗадач.ВыгрузитьКолонку("Родитель");
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТаблицуИсключенийДат(Параметры,СтруктураДанных)
	
	ТаблицаИсключенийДат = ?(СтруктураДанных.Свойство("ТаблицаИсключенийДат"), СтруктураДанных.ТаблицаИсключенийДат,
		Новый ТаблицаЗначений);	
	
	ТаблицаИсключенийДат.Колонки.Добавить("FromDate");
	ТаблицаИсключенийДат.Колонки.Добавить("ToDate");
	
	// На текущий момент считаем что выходные у нас это сб. вс.
	// Надо сделать привязку к календарю проекта.
	Для каждого СтрокаЗадача Из Параметры.Задачи Цикл
		
		Если ДеньНедели(СтрокаЗадача.Start) = 6 ИЛИ ДеньНедели(СтрокаЗадача.Start) = 7 Тогда
			
			СтрокаИсключения = ТаблицаИсключенийДат.Добавить();
			СтрокаИсключения.FromDate = НачалоДня(СтрокаЗадача.Start); 
			СтрокаИсключения.ToDate = КонецДня(СтрокаЗадача.Start);
		КонецЕсли;	
		
		Если ДеньНедели(СтрокаЗадача.Finish) = 6 ИЛИ ДеньНедели(СтрокаЗадача.Finish) = 7 Тогда
			
			СтрокаИсключения = ТаблицаИсключенийДат.Добавить();
			СтрокаИсключения.FromDate = НачалоДня(СтрокаЗадача.Finish); 
			СтрокаИсключения.ToDate = КонецДня(СтрокаЗадача.Finish);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ТаблицаИсключенийДат.Свернуть("FromDate,ToDate");
	
	Возврат ТаблицаИсключенийДат 
   
КонецФункции

Функция ПолучитьСписокПроектныхЗадач(ДанныеЗадачи)
	
	Если ТипЗнч(ДанныеЗадачи) = Тип("ТаблицаЗначений") Тогда
		Возврат ?(ДанныеЗадачи.Колонки.Найти("ПроектнаяЗадача") = Неопределено,
			Неопределено, ДанныеЗадачи.ВыгрузитьКолонку("ПроектнаяЗадача"));
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьТипОбъектаProject(Параметры)
	
	ПакетProject = Параметры.Фабрика.Пакеты.Получить(Параметры.URIПространствоИменMSP);
	// В СвойствоProject хранится структура и типы, по которым нужно выгрузить.
	СвойствоProject = ПакетProject.КорневыеСвойства.Получить("Project");
	
	Возврат СвойствоProject.Тип;
	
КонецФункции

Функция СоздатьОбъектXDTO(Фабрика, ТипОбъекта, Значение = Неопределено)
	
	Возврат ?(Значение = Неопределено,Фабрика.Создать(ТипОбъекта),Фабрика.Создать(ТипОбъекта,Значение));
	
КонецФункции

Функция ПолучитьТипСвойстваXDTO(ТипОбъекта, ИмяСвойства)
	
	Возврат ТипОбъекта.Свойства.Получить(ИмяСвойства).Тип;
	
КонецФункции

Функция ПолучитьТипСпискаXDTO(СписокXDTO)
	
	Возврат СписокXDTO.ВладеющееСвойство.Тип;
	
КонецФункции

Процедура ЗаполнитьОбъектXDTOЗначениямиXDTO(ОбъектXDTO, СоответствиеЗначенияXDTO)
	
	Для каждого ТекЭлемент Из СоответствиеЗначенияXDTO Цикл
		
		// Здесь записываются элементы первого уровня, они уже подготовлены.
		
		Если ТекЭлемент.Значение = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
			ОбъектXDTO[ТекЭлемент.Ключ] = ТекЭлемент.Значение;
		Исключение
		КонецПопытки
		
	КонецЦикла;
	
КонецПроцедуры

// Получаем Свойства и с помощью фабрики создаем Типы XDTO.
//
Функция ПолучитьСоответствиеТиповXDTO(Фабрика, ОбъектXDTO, Свойства)
	
	Соответствие = Новый Соответствие();
	
	// Свойства - КоллекцияСвойствXDTO.
	Для каждого ТекСвойство Из Свойства Цикл
		Соответствие.Вставить(ТекСвойство.Имя,ТекСвойство.Тип);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСоответствиеЗначенийXDTO(Фабрика, СоответствиеТиповXDTO, СоответствиеЗначения1С)
	
	Соответствие = Новый Соответствие();
	
	Для каждого ТекТип Из СоответствиеТиповXDTO Цикл
		
		Соответствие.Вставить(ТекТип.Ключ, СоздатьОбъектXDTO(Фабрика, ТекТип.Значение, СоответствиеЗначения1С[ТекТип.Ключ]));
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьТаблицаСвязейПроекта(Параметры, СтруктураДанных)
	
	ТаблицаСвязейПроекта = Неопределено;
	
	Если СтруктураДанных.Свойство("ТаблицаСвязейПроекта") И СтруктураДанных.ТаблицаСвязейПроекта.Количество()>0 Тогда
			
		ТаблицаСвязейПроекта = СтруктураДанных.ТаблицаСвязейПроекта; 
		// Индексация позволит ускорить процедуру НайтиСтроки().
		ТаблицаСвязейПроекта.Индексы.Добавить("КонецСвязи");
		
	Иначе
		
		Если Не (Параметры.ОсновнойПроект = Неопределено) Тогда
			ТаблицаСвязейПроекта = ПостроитьСписокСвязей(Параметры.ОсновнойПроект);
			// Индексация позволит ускорить процедуру НайтиСтроки().
			ТаблицаСвязейПроекта.Индексы.Добавить("КонецСвязи");

		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ТаблицаСвязейПроекта;
	
КонецФункции

Функция ЗаполнитьПостроительОтчетаВыделенныеТрудовыеРесурсы(Параметры)
	
	Построитель = Параметры.ПостроительОтчетаТрудРес;
	Построитель.Текст = "ВЫБРАТЬ ИСТИНА";
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Параметры.ТрудовыеРесурсыПроектныхЗадач.Выгрузить());
	
	Возврат Построитель;
	
КонецФункции

Функция СоздатьЗаполнитьОбъектXDTOProject(Параметры, ТипОбъекта,ТипВыгрузки)
	
	// Основное значение, по сути это проект который нам нужно наполнить данными из 1с, но в формате,
	// который воспримет MS Project.
	
	Фабрика = Параметры.Фабрика;
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Фабрика,ТипОбъекта); 
	ЗаполнитьЭлементыProjectПервогоУровня(ОбъектXDTO,ТипОбъекта,Параметры);
	
	// Calendars - Семейство календарей, связанных с проектом.
	ОбъектXDTO.Calendars			= СоздатьЗаполнитьОбъектXDTOCalendars(Параметры, ПолучитьТипСвойстваXDTO(ТипОбъекта,"Calendars"));
	
	// Tasks - Семейство задач, составляющих проект.
	ОбъектXDTO.Tasks 				= СоздатьЗаполнитьОбъектXDTOTasks(Параметры, ПолучитьТипСвойстваXDTO(ТипОбъекта,"Tasks"));
	
	// Resources - Семейство ресурсов, составляющих проект.
	ОбъектXDTO.Resources  			= СоздатьЗаполнитьОбъектXDTOResources(Параметры, ПолучитьТипСвойстваXDTO(ТипОбъекта,"Resources"),ТипВыгрузки);
	
	// Assignments - Связывает Задачи с ресурсами.
	ОбъектXDTO.Assignments 			= СоздатьЗаполнитьОбъектXDTOAssignments(Параметры, ПолучитьТипСвойстваXDTO(ТипОбъекта,"Assignments"),ТипВыгрузки);
	
	// OutlineCodes - Семейство определений кодов структуры, связанных с проектом;
	// эти коды могут быть сопоставлены скольким угодно проектам.
	ОбъектXDTO.OutlineCodes 		= СоздатьОбъектXDTO(Фабрика,ПолучитьТипСвойстваXDTO(ТипОбъекта,"OutlineCodes"));
	
	// WBSMasks  - Таблица элементов, определяющих маску кода структуры.
	ОбъектXDTO.WBSMasks 			= СоздатьОбъектXDTO(Фабрика,ПолучитьТипСвойстваXDTO(ТипОбъекта,"WBSMasks"));
	
	// ExtendedAttributes - Семейство определений расширенных атрибутов (настраиваемых полей), связанных с проектом.
	ОбъектXDTO.ExtendedAttributes 	= СоздатьОбъектXDTO(Фабрика,ПолучитьТипСвойстваXDTO(ТипОбъекта,"ExtendedAttributes"));
	
	Возврат ОбъектXDTO;
	
КонецФункции

Функция ПолучитьСоответствие1СДляProject(Параметры)
	
	Соответствие = Новый Соответствие();
	
	ЗапросТекст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              	|	Проекты.Ссылка КАК Ссылка,
	              	|	Проекты.ПометкаУдаления КАК ПометкаУдаления,
	              	|	Проекты.Предопределенный КАК Предопределенный,
	              	|	Проекты.Родитель КАК Родитель,
	              	|	Проекты.Код КАК Код,
	              	|	Проекты.Наименование КАК Наименование,
	              	|	Проекты.Автор КАК Автор,
	              	|	Проекты.АвторИзменений КАК АвторИзменений,
	              	|	Проекты.ДатаМодификации КАК ДатаМодификации,
	              	|	Проекты.Организация КАК Организация,
	              	|	NULL КАК МетодРаспределения,
	              	|	NULL КАК Ответственный,
	              	|	Проекты.Комментарий КАК Комментарий,
	              	|	NULL КАК Описание,
	              	|	Проекты.ПолноеНаименование КАК ПолноеНаименование,
	              	|	Проекты.ПортфельПроектов КАК ПортфельПроектов,
	              	|	Проекты.ПрограммаПроектов КАК ПрограммаПроектов,
	              	|	Проекты.Подразделение КАК Подразделение,
	              	|	NULL КАК СпособРаспределения,
	              	|	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	              	|	NULL КАК СхемаСопоставленияОбъектов,
	              	|	NULL КАК СценарийПланирования,
	              	|	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача,
	              	|	Проекты.Представление КАК Представление
	              	|ПОМЕСТИТЬ ТекПроект
	              	|ИЗ
	              	|	Справочник.Проекты КАК Проекты
	              	|ГДЕ
	              	|	Проекты.Ссылка = &Проект
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	МИНИМУМ(ВложенныйЗапрос.ДатаНачалаПлан) КАК ДатаНачалаПлан,
	              	|	МАКСИМУМ(ВложенныйЗапрос.ДатаЗавершенияПлан) КАК ДатаЗавершенияПлан
	              	|ПОМЕСТИТЬ ПроектныеЗадачиБезРодителя
	              	|ИЗ
	              	|	(ВЫБРАТЬ
	              	|		ЕСТЬNULL(СрокиПЗ.ДатаНачалаПлан, &ПустаяДата) КАК ДатаНачалаПлан,
	              	|		ЕСТЬNULL(СрокиПЗ.ДатаЗавершенияПлан, &ПустаяДата) КАК ДатаЗавершенияПлан
	              	|	ИЗ
	              	|		РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК СрокиПЗ
	              	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	              	|			ПО СрокиПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	              	|				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)) КАК ВложенныйЗапрос
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              	|	ЕСТЬNULL(ТекПроект.Наименование, &ПустаяСтрока) КАК Name,
	              	|	ЕСТЬNULL(ТекПроект.Автор.Наименование, &ПустаяСтрока) КАК Author,
	              	|	ЕСТЬNULL(ТекПроект.Организация.Наименование, &ПустаяСтрока) КАК Company,
	              	|	ЕСТЬNULL(ТекПроект.ПолноеНаименование, &ПустаяСтрока) КАК Title,
	              	|	ЕСТЬNULL(упоРуководителиПроектовСрезПоследних.РуководительПроекта.Наименование, &ПустаяСтрока) КАК Manager,
	              	|	ЕСТЬNULL(ТекПроект.ДатаМодификации, &ПустаяДата) КАК CreationDate,
	              	|	ЕСТЬNULL(ТекПроект.СсылкаНаПроектнуюЗадачу.ОписаниеЗадачи, &ПустаяСтрока) КАК Subject,
	              	|	ЕСТЬNULL(ТекПроект.СсылкаНаПроектнуюЗадачу.Проект.ПортфельПроектов.Наименование, &ПустаяСтрока) КАК Category
	              	|ИЗ
	              	|	ТекПроект КАК ТекПроект,
	              	|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(&ДатаСреза, Проект = &Проект) КАК упоРуководителиПроектовСрезПоследних,
	              	|	ПроектныеЗадачиБезРодителя КАК ПроектныеЗадачиБезРодителя";
	
	Запрос = Новый Запрос(ЗапросТекст);
	
	Запрос.УстановитьПараметр("ДатаСреза",		Параметры.ДатаСреза);
	Запрос.УстановитьПараметр("ПустаяДата",		Параметры.ПустаяДата);
	Запрос.УстановитьПараметр("ПустаяСтрока",	Параметры.ПустаяСтрока);
	Запрос.УстановитьПараметр("Проект",			Параметры.ОсновнойПроект);
	Запрос.УстановитьПараметр("текВерсия",		упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Параметры.ОсновнойПроект));
	
	// <UID/> - Уникальный идентификатор проекта.
	Соответствие.Вставить("UID",0);
	// <CalendarUID/> - Уникальный идентификатор календаря, используемого в проекте - у нас всегда 1.
	Соответствие.Вставить("CalendarUID",1); 
	// FYStartDate - Месяц, с которого начинается финансовый год.
	Соответствие.Вставить("FYStartDate",1); 
	// <MinutesPerDay> Необязательный Количество минут в одном дне по умолчанию.
	Соответствие.Вставить("MinutesPerDay",480); 
	// <MinutesPerWeek> Необязательный Количество минут в одной неделе по умолчанию.
	Соответствие.Вставить("MinutesPerWeek",2400); 
	// <DaysPerMonth> Количество рабочих дней в месяце по умолчанию.
	Соответствие.Вставить("DaysPerMonth",20); 
	// <Revision> Количество операций сохранения проекта.
	Соответствие.Вставить("Revision",0); 
	// <LastSaved> Дата последнего сохранения проекта.
	Соответствие.Вставить("LastSaved",Параметры.ПустаяДата); 
	// <ScheduleFromStart> Указывает, планируется ли проект от даты начала или от даты окончания.
	Соответствие.Вставить("ScheduleFromStart",1); 
	// <CriticalSlackLimit> Число дней, которое может пройти после даты окончания задачи, прежде чем
	// Microsoft Office Project 2003 пометит ее как критическую задачу.
	Соответствие.Вставить("CriticalSlackLimit",0); 
	// <CurrencyDigits/> - Число цифр после десятичной запятой в денежных значениях, отображаемых в Project.
	Соответствие.Вставить("CurrencyDigits",2); 
	// <CurrencySymbol/> - Символ, который представляет тип валюты, используемый в проекте.
	Соответствие.Вставить("CurrencySymbol","р."); 
	// <CurrencySymbolPosition> Местоположение символа валюты по отношению к денежному значению.
	Соответствие.Вставить("CurrencySymbolPosition",1); // После, без пробела (по умолчанию): 0р.
	// <DefaultStartTime> Дата начала, принимаемая по умолчанию для всех новых задач.
	Соответствие.Вставить("DefaultStartTime", '00010101090000'); // 09:00:00.
	// <DefaultFinishTime> Дата окончания, принимаемая по умолчанию для всех новых задач.
	Соответствие.Вставить("DefaultFinishTime", '00010101180000');  // 18:00:00.
	// <ExtendedCreationDate> Дата, используемая для вычислений и для отчетов.
	Соответствие.Вставить("ExtendedCreationDate",'19840101000000');  // 1984-01-01T00:00:00.
	// <DefaultTaskType> Принятый по умолчанию тип новых задач.
	Соответствие.Вставить("DefaultTaskType",0);  
	// <DefaultFixedCostAccrual> Точка отсчета, относительно которой начисляются затраты.
	Соответствие.Вставить("DefaultFixedCostAccrual",3);
	// <DefaultStandardRate>  Стандартная ставка, принимаемая по умолчанию для новых ресурсов.
	Соответствие.Вставить("DefaultStandardRate",0);
	// <DefaultOvertimeRate>  Ставка сверхурочных работ, принимаемая по умолчанию для новых ресурсов.
	Соответствие.Вставить("DefaultOvertimeRate",0);
	// DurationFormat  - Формат длительности, используемый по умолчанию для всех параметров длительности в проекте.
	Соответствие.Вставить("DurationFormat",7); 
	// WorkFormat - Формат длительности, используемый по умолчанию для всех значений длительности рабочих
	// периодов в проекте.
	Соответствие.Вставить("WorkFormat",3); // В днях.
	// <EditableActualCosts> Указывает, выполняет ли Project автоматическое вычисление фактических затрат.
	Соответствие.Вставить("EditableActualCosts",0); 
	// <HonorConstraints/> - Указывает, планирует ли Project задачи согласно их датам ограничений вместо учета
	// зависимостей задач.
	Соответствие.Вставить("HonorConstraints",0);
	// <EarnedValueMethod/> - Способ расчета освоенного объема, используемый по умолчанию.
	Соответствие.Вставить("EarnedValueMethod",0);
	// <InsertedProjectsLikeSummary/> - Указывает, рассматриваются ли вставленные проекты как суммарные задачи,
	// а не как отдельные проекты при расчетах расписания.
	Соответствие.Вставить("InsertedProjectsLikeSummary",1);
	// <MultipleCriticalPaths/> - Указывает, будет ли Project вычислять и отображать критический путь для каждой
	// независимой сети задач в рамках проекта.
	Соответствие.Вставить("MultipleCriticalPaths",1);
	// <NewTasksEffortDriven/>.
	Соответствие.Вставить("NewTasksEffortDriven",1);
	// <NewTasksEstimated/> - Указывает, будут ли для новых задач устанавливаться предварительные оценки длительности.
	Соответствие.Вставить("NewTasksEstimated",1);
	// <SplitsInProgressTasks/>  - Указывает, можно ли прерывать задачи в ходе их выполнения.
	// <SpreadActualCost/>      - Указывает, распределяются ли фактические затраты равномерно вплоть
	// до даты отчета о состоянии.
	Соответствие.Вставить("SpreadActualCost",0);
	// <SpreadPercentComplete/>  - Указывает, распределяется ли процент завершения равномерно вплоть
	// до даты отчета о состоянии.
	Соответствие.Вставить("SpreadPercentComplete",1);
	// <TaskUpdatesResource/> - Указывает, приводит ли обновление задач к обновлению ресурсов.
    Соответствие.Вставить("TaskUpdatesResource",1);
	// <FiscalYearStart/>  - Указывает, используется ли нумерация финансовых годов.
	// <WeekStartDay/>  - День начала недели.
	Соответствие.Вставить("WeekStartDay",1);
	// <MoveCompletedEndsBack/> -    Указывает, будет ли при планировании конец завершенной части задач сдвигаться
	// к дате после даты отчета о состоянии, а раннее начало сдвигаться к дате отчета о состоянии.
	// <MoveRemainingStartsBack/>  - Указывает, будет ли при планировании начало оставшейся части задач сдвигаться
	// к дате после даты отчета о состоянии, а раннее начало сдвигаться к дате отчета о состоянии.
	// <MoveRemainingStartsForward/> - Указывает, будет ли начало оставшейся части задач сдвигаться к дате после
	// даты отчета о состоянии при планировании позднего начала.
	// <MoveCompletedEndsForward/>  - Указывает, будет ли при планировании конец завершенной части задач сдвигаться
	// к дате до даты отчета о состоянии, а позднее начало сдвигаться к дате отчета о состоянии.
	// <BaselineForEarnedValue/>    - Базовый план, используемый для вычисления значений отклонения.
	// <AutoAddNewResourcesAndTasks/>   - Указывает, будут ли новые ресурсы автоматически добавляться в пул ресурсов.
	Соответствие.Вставить("AutoAddNewResourcesAndTasks",1);
	// <StatusDate/>   - Дата, используемая для вычислений и для отчетов.
	Соответствие.Вставить("StatusDate",Параметры.ДатаСреза);
	// <CurrentDate/> - Системная дата, которая генерируется средствами XML.
	// <MicrosoftProjectServerURL/>  - Указывает, был ли проект создан пользователем Microsoft Office Project Server 2003
	// или пользователем Microsoft Windows NT.
	Соответствие.Вставить("MicrosoftProjectServerURL",1);
	// <Autolink/> - Указывает, выполняется ли автоматическое связывание добавленных или перемещенных задач.
	Соответствие.Вставить("Autolink",1);
	// <NewTaskStartDate/> - Дата начала новой задачи, используемая по умолчанию.
	Соответствие.Вставить("NewTaskStartDate",0);
	// <DefaultTaskEVMethod/> - Способ расчета освоенного объема для задач, используемый по умолчанию.
	Соответствие.Вставить("DefaultTaskEVMethod",0);
	// <ProjectExternallyEdited/> - Указывает, изменялся ли проект во внешнем приложении.
	Соответствие.Вставить("ProjectExternallyEdited", 0);
 	// <ActualsInSync/> - Указывает, была ли запись о трудозатратах синхронизирована с проектом.
	Соответствие.Вставить("ActualsInSync",1);
	// <RemoveFileProperties/> - Указывает, следует ли удалить сведения из свойств файла при сохранении.
	Соответствие.Вставить("RemoveFileProperties",0);
	// <AdminProject/> - Указывает, является ли проект административным проектом.
	Соответствие.Вставить("AdminProject",0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Следующий() Тогда
		
		// <Name/>;
		// <Title/>;
		// <Company/>;
		// <Manager/>;
		// <Author/>;
		// <CreationDate/>;
		// <StartDate/>;
		// <FinishDate/>;
		// <Subject/> - Тема проекта;
		// <Category/>  - в нашем случае - портфель проектов.
		Для каждого Колонка Из Таблица.Колонки Цикл
			Соответствие.Вставить(Колонка.Имя,Выборка[Колонка.Имя]);
		КонецЦикла;
		
	КонецЕсли;
	
	// Вычисляем минимальную дату старта и финиша.
	
	КопияТабЗадачи = Параметры.Задачи.Скопировать();
	Если КопияТабЗадачи.Количество() > 0 Тогда
		Если Не ЗначениеЗаполнено(Соответствие["StartDate"]) Тогда
			КопияТабЗадачи.Сортировать("Start");
			Соответствие.Вставить("StartDate", НачалоДня(КопияТабЗадачи[0].Start));
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Соответствие["FinishDate"]) Тогда
			КопияТабЗадачи.Сортировать("Finish  Убыв");
			Соответствие.Вставить("FinishDate", КонецДня(КопияТабЗадачи[0].Finish));
		КонецЕсли;	
	КонецЕсли; 
	
	Возврат Соответствие;
	
КонецФункции

Процедура ЗаполнитьЭлементыProjectПервогоУровня(ОбъектXDTO, ТипОбъекта, Параметры)
	
	// Нужно определить типы в формате XDTO - получаем реквизиты ЗначениеXDTOProject.
	СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Параметры.Фабрика, ОбъектXDTO, ТипОбъекта.Свойства);
	// Получаем соответствие с значениями из 1С.
	СоответствиеЗначения1С = ПолучитьСоответствие1СДляProject(Параметры); 
	// Создаем ЗначенияXDTO на основе ТиповXDTO первого уровня, для ЗначениеXDTOProject.
	СоответствиеResourcesUID = ПолучитьСоответствиеЗначенийXDTO(Параметры.Фабрика, СоответствиеТиповXDTO, СоответствиеЗначения1С);
	// Заполняем те элементы которые уже знаем.
	ЗаполнитьОбъектXDTOЗначениямиXDTO(ОбъектXDTO,СоответствиеResourcesUID);
	
КонецПроцедуры

Функция СоздатьЗаполнитьОбъектXDTOCalendars(Параметры, ТипОбъекта)
	
	// Основное значение, по сути это проект который нам нужно наполнить данными из 1с, но в формате,
	// который воспримет MS Project.
	
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Параметры.Фабрика,ТипОбъекта); 
	
	// Нужно заполнить список Calendar.
	ЗаполнитьСписокXDTOCalendar(Параметры,ОбъектXDTO.Calendar);
	
	// Больше свойств у календаря нет, заполнять нечего.
	
	Возврат ОбъектXDTO;
	
КонецФункции

Процедура ЗаполнитьСписокXDTOCalendar(Параметры, СписокXDTO)
	
	СписокXDTO.Очистить();
	
	Фабрика = Параметры.Фабрика;
	
	// Первым делом создаем основной календарь.
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	
	ЗаполнитьКалендари(СписокXDTO, Параметры, ТипОбъекта);
	
	// Дальше можем заполнять его данными по ресурсам, зная что базовый календарь - ОбъектXDTOCalendar.
	ВыделенныеТрудовыеРесурсы = Параметры.ВыделенныеТрудовыеРесурсы.Выбрать();
	
	ДобавленныеРесурсы = Новый Массив;
	Пока ВыделенныеТрудовыеРесурсы.Следующий() Цикл
		Если ДобавленныеРесурсы.Найти(ВыделенныеТрудовыеРесурсы.Name) <> 0 Тогда
			Продолжить;
		Иначе
			ДобавленныеРесурсы.Добавить(ВыделенныеТрудовыеРесурсы.Name);
		КонецЕсли;
		
		ОбъектXDTO = СоздатьОбъектXDTO(Фабрика,ТипОбъекта); 
		
		// Нужно определить типы в формате XDTO - получаем реквизиты ЗначениеXDTOProject.
		СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Фабрика,ОбъектXDTO,ТипОбъекта.Свойства);
		
		// По умолчанию для главного = 1.
		ОбъектXDTO.UID = СоздатьОбъектXDTO(Параметры.Фабрика,СоответствиеТиповXDTO["UID"],Параметры.СчетчикUID);
		Параметры.Вставить("СчетчикUID",Параметры.СчетчикUID+1);
		
		ОбъектXDTO.Name 			= СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["Name"],ВыделенныеТрудовыеРесурсы.Name);
		// <IsBaseCalendar>0</IsBaseCalendar>   -  Указывает, является ли календарь базовым.
		ОбъектXDTO.IsBaseCalendar	= СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["IsBaseCalendar"],0);
		// <BaseCalendarUID>1</BaseCalendarUID> -  Уникальный идентификатор базового календаря,
		// от которого зависит данный календарь; используется только для календарей, не являющихся базовыми.
		ОбъектXDTO.BaseCalendarUID 	= СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["BaseCalendarUID"],1);
		
		СписокXDTO.Добавить(ОбъектXDTO);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьКалендари(СписокXDTO, Параметры, ТипОбъекта)
	
	Для Каждого СвойстваКалендаря Из Параметры.СвойстваКалендарей Цикл		
		ОбъектXDTOCalendar = СоздатьКалендарьXDTOCalendar(Параметры, ТипОбъекта, СвойстваКалендаря.Значение);	
		СписокXDTO.Добавить(ОбъектXDTOCalendar);		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьКалендарьXDTOCalendar(Параметры, ТипОбъекта, ПараметрыКалендаря)
	
	ОбъектXDTO = СоздатьОбъектXDTO(Параметры.Фабрика,ТипОбъекта); 
	
	// Нужно определить типы в формате XDTO - получаем реквизиты ЗначениеXDTOProject.
	СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Параметры.Фабрика, ОбъектXDTO, ТипОбъекта.Свойства); 
	СоответствиеResourcesUID = ПолучитьСоответствиеЗначенийXDTO(Параметры.Фабрика, СоответствиеТиповXDTO,
		ПараметрыКалендаря);
	ЗаполнитьОбъектXDTOЗначениямиXDTO(ОбъектXDTO, СоответствиеResourcesUID);
	
	ЗаполнитьСписокXDTOWeekDay(Параметры, ОбъектXDTO.WeekDays.WeekDay, ПараметрыКалендаря);
	ЗаполнитьСписокXDTOExceptions(Параметры, ОбъектXDTO.Exceptions.Exception, ПараметрыКалендаря["ИсключенияКалендаря"]);
		
	Возврат ОбъектXDTO;
	
КонецФункции

Процедура ЗаполнитьСписокXDTOWeekDay(Параметры, СписокXDTO, ПараметрыКалендаря)
	
	СписокXDTO.Очистить();
	
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	
	Для Каждого Строка Из ПараметрыКалендаря["WorkingTimes"] Цикл
		
		ОбъектXDTOWeekDay = Параметры.Фабрика.Создать(СписокXDTO.ВладеющееСвойство.Тип);	
		ОбъектXDTOWeekDay.DayType = Строка.Ключ;
		ДеньРабочий = 1;
		Если Строка.Значение.Количество() = 0 Тогда
			ДеньРабочий = 0;
		КонецЕсли;
		ОбъектXDTOWeekDay.DayWorking = ДеньРабочий;
		
		Если ДеньРабочий = 1 Тогда
			ОбъектXDTOWeekDay.WorkingTimes = СоздатьЗаполнитьОбъектXDTOWorkingTimes(Параметры,
				ПолучитьТипСвойстваXDTO(ТипОбъекта, "WorkingTimes"), Строка.Значение);
        КонецЕсли;
		
		СписокXDTO.Добавить(ОбъектXDTOWeekDay);
		
	КонецЦикла;
		
	// Добавим границы задач, чтобы проджект мог корректно отбразить заданные в PM сроки.
	Для каждого СтрокаИсключение Из Параметры.ТаблицаИсключенийДат Цикл
		
		ОбъектXDTOWeekDay = Параметры.Фабрика.Создать(СписокXDTO.ВладеющееСвойство.Тип);
		// <DayType>.
		ОбъектXDTOWeekDay.DayType = 0; // Исключение.
		// <DayWorking>.
		ОбъектXDTOWeekDay.DayWorking = 1; 
		Если ОбъектXDTOWeekDay.DayWorking = 1 Тогда
			ОбъектXDTOWeekDay.WorkingTimes = СоздатьЗаполнитьОбъектXDTOWorkingTimes(Параметры,
				ПолучитьТипСвойстваXDTO(ТипОбъекта, "WorkingTimes"));
        КонецЕсли;
		ОбъектXDTOWeekDay.TimePeriod = СоздатьЗаполнитьОбъектXDTOTimePeriod(Параметры, СтрокаИсключение.FromDate,
			СтрокаИсключение.ToDate, ПолучитьТипСвойстваXDTO(ТипОбъекта,"TimePeriod")); 
		
		СписокXDTO.Добавить(ОбъектXDTOWeekDay);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьЗаполнитьОбъектXDTOWorkingTimes(Параметры, ТипОбъекта, WorkingTime = Неопределено)
	
	// Основное значение, по сути это проект который нам нужно наполнить данными из 1с, но в формате,
	// который воспримет MS Project.
	
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Параметры.Фабрика,ТипОбъекта); 
	
	// Нужно заполнить список WorkingTime.
	ЗаполнитьСписокXDTOWorkingTimes(Параметры,ОбъектXDTO.WorkingTime, WorkingTime);
	
	// Больше свойств у календаря нет, заполнять нечего.
	
	Возврат ОбъектXDTO;
	
КонецФункции
 
Процедура ЗаполнитьСписокXDTOWorkingTimes(Параметры, СписокXDTO, WorkingTime)
	
	СписокXDTO.Очистить();

	Фабрика = Параметры.Фабрика;
	
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Фабрика, ТипОбъекта); 
	
	Если WorkingTime = Неопределено Тогда
	
		// - <WorkingTimes>
		// - <WorkingTime>
		//   <FromTime>09:00:00</FromTime> 
		//   <ToTime>13:00:00</ToTime> 
		//   </WorkingTime>
		// - <WorkingTime>
		//   <FromTime>14:00:00</FromTime> 
		//   <ToTime>18:00:00</ToTime> 
		//   </WorkingTime>
		//   </WorkingTimes>.
	
		ОбъектXDTOWorkingTime = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
		
		ОбъектXDTOWorkingTime.FromTime = '00010101090000';
		ОбъектXDTOWorkingTime.ToTime = '00010101130000';
		СписокXDTO.Добавить(ОбъектXDTOWorkingTime);
		
		ОбъектXDTOWorkingTime = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
		
		ОбъектXDTOWorkingTime.FromTime = '00010101140000';
		ОбъектXDTOWorkingTime.ToTime = '00010101180000';
		СписокXDTO.Добавить(ОбъектXDTOWorkingTime);
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектXDTOWorkingTime = СоздатьОбъектXDTO(Фабрика,ТипОбъекта);
	ОбъектXDTOWorkingTime.FromTime = WorkingTime.FromTime;
	ОбъектXDTOWorkingTime.ToTime = WorkingTime.ToTime;
	СписокXDTO.Добавить(ОбъектXDTOWorkingTime);
	
КонецПроцедуры

Функция СоздатьЗаполнитьОбъектXDTOTimePeriod(Параметры, ДатаНачала, ДатаКонец, ТипОбъекта)
	
	// Основное значение, по сути это проект который нам нужно наполнить данными из 1с, но в формате, 
	// который воспримет MS Project.
	
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Параметры.Фабрика,ТипОбъекта); 
	
	// Нужно заполнить список WorkingTime.
	ЗаполнитьОбъектXDTOTimePeriod(Параметры, ДатаНачала, ДатаКонец, ОбъектXDTO);
	
	// Больше свойств у календаря нет, заполнять нечего.
	
	Возврат ОбъектXDTO;
	
КонецФункции
 
Процедура ЗаполнитьСписокXDTOExceptions(Параметры, СписокXDTO, Исключения)
	
	СписокXDTO.Очистить();

	Фабрика = Параметры.Фабрика;
	
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
		
	Для Каждого Строка Из Исключения Цикл
		
		ОбъектXDTOException = Фабрика.Создать(СписокXDTO.ВладеющееСвойство.Тип);
		// <Type>.
		ОбъектXDTOException.Type = 1; // Исключение.
		// <DayWorking>.		
		ОбъектXDTOException.DayWorking = Строка.DayWorking;
		
		// EnteredByOccurrences.
		ОбъектXDTOException.EnteredByOccurrences = 1;
		// Occurrences.
		ОбъектXDTOException.Occurrences = 1;
				
		Если ОбъектXDTOException.DayWorking = 1 Тогда
			ОбъектXDTOException.WorkingTimes = СоздатьЗаполнитьОбъектXDTOWorkingTimes(Параметры,
			ПолучитьТипСвойстваXDTO(ТипОбъекта, "WorkingTimes"), Строка);
		КонецЕсли;
		ОбъектXDTOException.TimePeriod = СоздатьЗаполнитьОбъектXDTOTimePeriod(Параметры, Строка.НачалоДня,
		Строка.КонецДня, ПолучитьТипСвойстваXDTO(ТипОбъекта, "TimePeriod")); 
		
		СписокXDTO.Добавить(ОбъектXDTOException);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОбъектXDTOTimePeriod(Параметры, ДатаНачала, ДатаКонец, ОбъектXDTO)

	ТипОбъекта = ОбъектXDTO.Тип();
	Фабрика = Параметры.Фабрика;
	
	ОбъектXDTO.FromDate =СоздатьОбъектXDTO(Фабрика,ПолучитьТипСвойстваXDTO(ТипОбъекта,"FromDate"),ДатаНачала);
	ОбъектXDTO.ToDate =СоздатьОбъектXDTO(Фабрика,ПолучитьТипСвойстваXDTO(ТипОбъекта,"ToDate"),ДатаКонец);
	  	 		
КонецПроцедуры

Функция СоздатьЗаполнитьОбъектXDTOTasks(Параметры, ТипОбъекта)
	
	// Основное значение, по сути, это проект, который нам нужно наполнить данными из 1с, но в формате,
	// который воспримет MS Project.
	
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Параметры.Фабрика, ТипОбъекта); 
	
	// Нужно заполнить список Task.
	ЗаполнитьСписокXDTOTask(Параметры, ОбъектXDTO.Task);
	
	// Больше свойств у задач нет, заполнять нечего.
	Возврат ОбъектXDTO;
	
КонецФункции

// Взята из обработки упоПанельПроекта.
//
Функция ЗапросСписокПроектныхЗадач()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РегЗатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	РегЗатраты.Стоимость КАК ЗатратыПлан
	        |ПОМЕСТИТЬ ЗапросЗатратыПлан
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК РегЗатраты
	        |ГДЕ
	        |	РегЗатраты.Проект = &Проект
	        |	И РегЗатраты.УровеньПланирования = &ПланированиеПоРолям
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РегЗатраты.ПроектнаяЗадача,
	        |	РегЗатраты.Стоимость
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыЗатратМатериальныхРесурсов.СрезПоследних(, Версия = &текВерсия) КАК РегЗатраты
	        |ГДЕ
	        |	НЕ РегЗатраты.Обнуление
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РегДопЗатраты.ПроектнаяЗадача,
	        |	РегДопЗатраты.Стоимость
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыДополнительныхЗатрат.СрезПоследних(, Версия = &текВерсия) КАК РегДопЗатраты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗапросЗатратыПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	СУММА(ЗапросЗатратыПлан.ЗатратыПлан) КАК ЗатратыПлан
	        |ПОМЕСТИТЬ РегЗатратыПлан
	        |ИЗ
	        |	ЗапросЗатратыПлан КАК ЗапросЗатратыПлан
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗапросЗатратыПлан.ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ЗапросЗатратыПлан
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РегЗатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	РегЗатраты.Стоимость КАК ЗатратыФакт
	        |ПОМЕСТИТЬ ЗапросЗатратыФакт
	        |ИЗ
	        |	РегистрСведений.упоФактЗатратМатериальныхРесурсов КАК РегЗатраты
	        |ГДЕ
	        |	РегЗатраты.ПроектнаяЗадача.Проект = &Проект
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РегЗатраты.ПроектнаяЗадача,
	        |	РегЗатраты.Стоимость
	        |ИЗ
	        |	РегистрСведений.упоФактТрудозатратСводно КАК РегЗатраты
	        |ГДЕ
	        |	РегЗатраты.ПроектнаяЗадача.Проект = &Проект
	        |	И РегЗатраты.УровеньПланирования = &ПланированиеПоРолям
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РегДопЗатраты.ПроектнаяЗадача,
	        |	РегДопЗатраты.Стоимость
	        |ИЗ
	        |	РегистрСведений.упоФактДополнительныхЗатрат КАК РегДопЗатраты
	        |ГДЕ
	        |	РегДопЗатраты.ПроектнаяЗадача.Проект = &Проект
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗапросЗатратыФакт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	СУММА(ЗапросЗатратыФакт.ЗатратыФакт) КАК ЗатратыФакт
	        |ПОМЕСТИТЬ РегЗатратыФакт
	        |ИЗ
	        |	ЗапросЗатратыФакт КАК ЗапросЗатратыФакт
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗапросЗатратыФакт.ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ ЗапросЗатратыФакт
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РегРЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	&ПланированиеПоРолям КАК УровеньПланирования,
	        |	СУММА(РегРЗ.Стоимость) КАК Стоимость
	        |ПОМЕСТИТЬ РегЗатраты
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыЗатратМатериальныхРесурсов.СрезПоследних(, Версия = &базВерсия) КАК РегРЗ
	        |ГДЕ
	        |	НЕ РегРЗ.Обнуление
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	РегРЗ.ПроектнаяЗадача
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РегРЗ.ПроектнаяЗадача,
	        |	РегРЗ.УровеньПланирования,
	        |	СУММА(РегРЗ.Стоимость)
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноВерсии КАК РегРЗ
	        |ГДЕ
	        |	РегРЗ.Версия = &базВерсия
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	РегРЗ.ПроектнаяЗадача,
	        |	РегРЗ.УровеньПланирования
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	РегДЗ.ПроектнаяЗадача,
	        |	&ПланированиеПоРолям,
	        |	СУММА(РегДЗ.Стоимость)
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыДополнительныхЗатрат.СрезПоследних(, Версия = &базВерсия) КАК РегДЗ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	РегДЗ.ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РегПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	РегПЗ.КрайнийСрок КАК КрайнийСрок,
	        |	РегСроки.ДатаНачалаПлан КАК ДатаНачалаПлан,
	        |	РегСроки.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	        |	СУММА(ВЫБОР
	        |			КОГДА РегЗатраты.УровеньПланирования = &ПланированиеПоРолям
	        |				ТОГДА РегЗатраты.Стоимость
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК ЗатратыПлан
	        |ПОМЕСТИТЬ БазовыйПлан
	        |ИЗ
	        |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &базВерсия) КАК РегПЗ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &базВерсия) КАК РегСроки
	        |		ПО РегПЗ.ПроектнаяЗадача = РегСроки.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегЗатраты КАК РегЗатраты
	        |		ПО РегПЗ.ПроектнаяЗадача = РегЗатраты.ПроектнаяЗадача
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	РегПЗ.ПроектнаяЗадача,
	        |	РегПЗ.КрайнийСрок,
	        |	РегСроки.ДатаНачалаПлан,
	        |	РегСроки.ДатаЗавершенияПлан
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |УНИЧТОЖИТЬ РегЗатраты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	        |	РегПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	РегПЗ.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	        |	РегПЗ.ЭтоВеха КАК ЭтоВеха,
	        |	РегПЗ.КрайнийСрок КАК КрайнийСрокПлан,
	        |	ЕСТЬNULL(РегПЗ.НазваниеЗадачи, &ПустаяСтрока) КАК Name,
	        |	ВЫБОР
	        |		КОГДА РегПЗ.ЗадачаРодитель ЕСТЬ NULL
	        |				ИЛИ РегПЗ.ЗадачаРодитель = &ПустаяСсылкаупоПроектнаяЗадача
	        |			ТОГДА &ПустаяСсылкаупоПроектнаяЗадача
	        |		ИНАЧЕ РегПЗ.ЗадачаРодитель
	        |	КОНЕЦ КАК Родитель,
	        |	РегПЗ.ЭтоПакетРабот КАК ПакетРабот,
	        |	РегСроки.ДатаНачалаПлан КАК Start,
	        |	РегПЗ.ДлительностьМоделиПакетаРабот КАК ДлительностьМоделиПакетаРабот,
	        |	РегПЗ.Длительность КАК Длительность,
	        |	РегПЗ.РучнойВводСроков КАК РучнойВводСроков,
	        |	РегСроки.ДатаЗавершенияПлан КАК Finish,
	        |	РегСтатус.СтатусЗадачи КАК СтатусПроектнойЗадачи,
	        |	ЕСТЬNULL(РегГотовность.ПроцентГотовности, 0) КАК ПроцентГотовности,
	        |	РегЗатратыПлан.ЗатратыПлан КАК ЗатратыПлан,
	        |	РегЗатратыФакт.ЗатратыФакт КАК ЗатратыФакт,
	        |	РегСДР.КодСДР КАК WBS,
	        |	ВЫБОР
	        |		КОГДА БазовыйПлан.ПроектнаяЗадача ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ВходитВБазовыйПлан,
	        |	БазовыйПлан.КрайнийСрок КАК КрайнийСрокБазовыйПлан,
	        |	БазовыйПлан.ДатаНачалаПлан КАК ДатаНачалаБазовыйПлан,
	        |	БазовыйПлан.ДатаЗавершенияПлан КАК ДатаЗавершенияБазовыйПлан,
	        |	БазовыйПлан.ЗатратыПлан КАК ЗатратыБазовыйПлан,
	        |	ВЫБОР
	        |		КОГДА РегРПЗ.РуководительПроектнойЗадачи ЕСТЬ NULL
	        |				ИЛИ РегРПЗ.РуководительПроектнойЗадачи = &ПустойРуководитель
	        |			ТОГДА &РуководительПроекта
	        |		ИНАЧЕ РегРПЗ.РуководительПроектнойЗадачи
	        |	КОНЕЦ КАК РуководительПроектнойЗадачи,
	        |	ВЫБОР
	        |		КОГДА РегРПЗ.РуководительПроектнойЗадачи ЕСТЬ NULL
	        |				ИЛИ РегРПЗ.РуководительПроектнойЗадачи = &ПустойРуководитель
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК РПЗНазначенЯвно
	        |ИЗ
	        |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегПЗ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСроки
	        |		ПО РегПЗ.ПроектнаяЗадача = РегСроки.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСтатус
	        |		ПО РегПЗ.ПроектнаяЗадача = РегСтатус.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегГотовность
	        |		ПО РегПЗ.ПроектнаяЗадача = РегГотовность.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегЗатратыПлан КАК РегЗатратыПлан
	        |		ПО РегПЗ.ПроектнаяЗадача = РегЗатратыПлан.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегЗатратыФакт КАК РегЗатратыФакт
	        |		ПО РегПЗ.ПроектнаяЗадача = РегЗатратыФакт.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК РегСДР
	        |		ПО РегПЗ.ПроектнаяЗадача = РегСДР.СсылкаНаПроектнуюЗадачу
	        |		ЛЕВОЕ СОЕДИНЕНИЕ БазовыйПлан КАК БазовыйПлан
	        |		ПО РегПЗ.ПроектнаяЗадача = БазовыйПлан.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РегРПЗ
	        |		ПО РегПЗ.ПроектнаяЗадача = РегРПЗ.ПроектнаяЗадача
	        |ГДЕ
	        |	НЕ РегПЗ.ЗадачаОтменена
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	WBS";
	
КонецФункции

Функция ЗапросСостояниеПроекта()
	
	Возврат "
		|ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
		|	РегСтатус.СтатусПроекта,
		|	РегРП.РуководительПроекта
		|	
		|ИЗ
		|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(,
		|		Проект = &Проект
		|	) КАК РегСтатус
		|		
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(,
		|		Проект = &Проект
		|	) КАК РегРП
		|ПО
		|	РегСтатус.Проект = РегРП.Проект
		|";
	
КонецФункции

Функция ПолучитьВсеTasks(Параметры)
	
	ЗапросТекст = ЗапросСписокПроектныхЗадач();
	
	Запрос = Новый Запрос(ЗапросТекст);
	Запрос.УстановитьПараметр("ПустаяДата", Параметры.ПустаяДата);
	Запрос.УстановитьПараметр("ПустаяСтрока", Параметры.ПустаяСтрока);
	Запрос.УстановитьПараметр("ПустаяСсылкаупоПроектнаяЗадача", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	Запрос.УстановитьПараметр("Проект", Параметры.Основнойпроект);
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Параметры.Основнойпроект));
	Запрос.УстановитьПараметр("базВерсия", упоВерсионирование.ПолучитьБазовуюВерсиюПроекта(Параметры.Основнойпроект));
	Запрос.УстановитьПараметр("РуководительПроекта", ПолучитьСвойстваПроекта(Параметры).РуководительПроекта);
	Запрос.УстановитьПараметр("ПустойРуководитель", Справочники.упоСотрудники.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПланированиеПоРолям", Перечисления.упоУровеньПланирования.Предварительный);
		
	ТаблицаTasks = Запрос.Выполнить().Выгрузить();
	ТаблицаTasks.Сортировать("WBS");	
			
	ЗаполнитьДатыСтартаФиниша(Параметры, ТаблицаTasks);
		
	Возврат ТаблицаTasks;
	
КонецФункции

Процедура ЗаполнитьДатыСтартаФиниша(Параметры, ТаблицаTasks)
	
	ТаблицаTasks.Индексы.Добавить("Родитель");
	ТаблицаTasks.Сортировать("WBS Убыв");
	// У подчиненных задач на тот момент могло не быть дат - пытаемся заполнить снова, ища по таблице.
	СтруктураОтбора = Новый Структура("Родитель");
	Для каждого СтрокаЗадача Из ТаблицаTasks Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаЗадача.Start) Тогда
			СтруктураОтбора.Вставить("Родитель",СтрокаЗадача.ПроектнаяЗадача);
			МассивСтрок = ТаблицаTasks.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				СамаяМаленькаяДата = Параметры.ПустаяДата;
				СамаяБольшаяДата = Параметры.ПустаяДата;
				
				Для каждого СтрокаМассива Из МассивСтрок Цикл
				   
					Если СамаяМаленькаяДата  = Параметры.ПустаяДата Тогда 
						СамаяМаленькаяДата = СтрокаМассива.Start;
					КонецЕсли;
					Если СамаяМаленькаяДата  > СтрокаМассива.Start Тогда 
						СамаяМаленькаяДата = СтрокаМассива.Start;
					КонецЕсли;
				
					Если СамаяБольшаяДата  = Параметры.ПустаяДата Тогда 
						СамаяБольшаяДата  = СтрокаМассива.Finish;
					КонецЕсли;
					Если СамаяБольшаяДата  < СтрокаМассива.Finish Тогда 
						СамаяБольшаяДата  = СтрокаМассива.Finish;
					КонецЕсли;

				КонецЦикла;
				
				Если СамаяМаленькаяДата <> Параметры.ПустаяДата Тогда 
					СтрокаЗадача.Start = СамаяМаленькаяДата; 
				КонецЕсли; 
				
				Если СамаяБольшаяДата <> Параметры.ПустаяДата Тогда 
					СтрокаЗадача.Finish = СамаяБольшаяДата; 
				КонецЕсли; 
			КонецЕсли;	
        КонецЕсли;
	КонецЦикла;

    ТаблицаTasks.Сортировать("WBS");
	
КонецПроцедуры

Функция ПолучитьСоответствиеЗначения1СTasks(СоответствиеТиповXDTO, СтрокаЗадача)
	
	Соответствие = Новый Соответствие();
	
	// FixedCostAccrual - "2" Пропорционально (по умолчанию); затраты начисляются по мере планирования
	// и поступления сообщений о фактическом выполнении трудозатрат.
	Соответствие.Вставить("FixedCostAccrual",3);
	
	// DurationFormat — это формат длительности, используемый по умолчанию для всех параметров длительности в проекте.
	Соответствие.Вставить("DurationFormat",39);
	
	// CalendarUID - Уникальный идентификатор календаря, используемого в проекте.
	Соответствие.Вставить("CalendarUID",-1);
	
	// Веха
	Соответствие.Вставить("Milestone", 0);
	
	// Указывает, является ли задача суммарной.
	Соответствие.Вставить("Summary", 0);
	
	Соответствие.Вставить("IgnoreResourceCalendar", 1);
	
	// Указывает, будет ли задача планироваться с фиксированным объемом работ.
	Соответствие.Вставить("EffortDriven", 1);
	
	// Указывает, будет ли задача планироваться в режиме "Предварительная оценка". 0 - режим без предварительной оценки.
	Соответствие.Вставить("Estimated", 0);
	
	// Процент выполнения от длительности задачи.
	Соответствие.Вставить("PercentComplete", 0);
	
	// Текущее состояние задачи, выраженное в виде процента выполненных трудозатрат по задаче.
	Соответствие.Вставить("PercentWorkComplete", 0);
	
	// Текущее состояние задачи, выраженное в виде процента выполненных трудозатрат по задаче.
	Соответствие.Вставить("Type", 0);
	
	Для каждого ТекТип Из СоответствиеТиповXDTO Цикл
		
		Попытка
			Соответствие.Вставить(ТекТип.Ключ, СтрокаЗадача[ТекТип.Ключ]);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Процедура ЗаполнитьСписокXDTOTask(Параметры, СписокXDTO)
	
	СписокXDTO.Очистить(); // В списке обязательно создается один объект, но мы заполняем по-своему.
	
	Фабрика = Параметры.Фабрика;
	
	// Если определен Основной проект - значит для задачи нужно:
	// 1. создавать элементы только с КодомСДР (WBS);
	// 2. обработать связь с предшественниками.
	ЕстьОсновнойПроект = Не (Параметры.ОсновнойПроект = Неопределено);  
	ЕстьТаблицаСвязей = Не (Параметры.ТаблицаСвязейПроекта = Неопределено);
	
	Если Не ЕстьОсновнойПроект Тогда
		Параметры.Задачи.Сортировать("WBS");
	КонецЕсли;
	
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	ОбъектXDTOTask = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
	СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Фабрика, ОбъектXDTOTask, ТипОбъекта.Свойства);
	// В панели показателей не предусмотрена выгрузка процента готовности.
	ЕстьПроцентГотовности = ?(Параметры.Задачи.Колонки.Найти("ПроцентГотовности") = Неопределено, Ложь, Истина);
	
	ВыводимВложенныеЗадачи = 0;
	Для каждого СтрокаЗадача Из Параметры.Задачи Цикл
		
		Если ЕстьОсновнойПроект 
			И НЕ ЗначениеЗаполнено(СтрокаЗадача.WBS) Тогда
			Продолжить; 
		КонецЕсли;
		
		ОбъектXDTOTask = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
		
		СоответствиеЗначения1С = ПолучитьСоответствиеЗначения1СTasks(СоответствиеТиповXDTO, СтрокаЗадача);
		СоответствиеResourcesUID = ПолучитьСоответствиеЗначенийXDTO(Фабрика, СоответствиеТиповXDTO, СоответствиеЗначения1С);
		
		ЗаполнитьОбъектXDTOЗначениямиXDTO(ОбъектXDTOTask, СоответствиеResourcesUID);
		
		ИмяСвойства = "UID";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства], СтрокаЗадача.UID);
		// ID - отвечает за то в какой строке будет стоять задача,
		// например, если  ID = 6 то задачи начнуться с 6-й строки.
		ИмяСвойства = "ID";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства], СтрокаЗадача.ID);
		
		// Заполнить календарь задачи
		Календарь = Параметры.СоответствиеПроектаПЗИКалендаря[СтрокаЗадача.ПроектнаяЗадача];
		УИДКалендаря = Параметры.СоответствиеКалендаряИЕгоУИДа[Календарь];
		Если УИДКалендаря <> Неопределено Тогда
			ОбъектXDTOTask.CalendarUID = УИДКалендаря;
		КонецЕсли;
		
		НулеваяДлительность = СтрокаЗадача.ЭтоВеха;
		
		ИмяСвойства = "Duration";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
			ВычислитьДлительностьMSProject(Параметры,
				СтрокаЗадача.Start,
				СтрокаЗадача.Finish,
				НулеваяДлительность,
				СтрокаЗадача));
		
		Если ЕстьПроцентГотовности Тогда
			Если СтрокаЗадача.ПроцентГотовности <> 0 Тогда
				ИмяСвойства = "ActualStart";
				ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
						ОбъектXDTOTask.Start);
				ИмяСвойства = "ActualDuration";
				ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
						ОбъектXDTOTask.Duration);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаЗадача.РучнойВводСроков И Параметры.ВерсияMSProject >= 15 Тогда
			ИмяСвойства = "Manual";
			ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства], 1);
			ОбъектXDTOTask.ManualStart = ОбъектXDTOTask.Start;
			ОбъектXDTOTask.ManualFinish = СтрокаЗадача.Finish;
			ОбъектXDTOTask.ManualDuration = ОбъектXDTOTask.Duration;
		КонецЕсли;
		
		ИмяСвойства = "OutlineNumber";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства], СтрокаЗадача.WBS);
		// OutlineLevel - Число, определяющее уровень задачи в иерархической структуре проекта.
		ИмяСвойства = "OutlineLevel";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
			СтрЧислоВхождений(СтрокаЗадача.WBS, ".") + 1);
		
		ИмяСвойства = "Notes";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства], СтрокаЗадача.Описание);

		// Summary - флаг, определяющий является ли задача суммирующей.
		ИмяСвойства = "Summary";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
			?(Параметры.СуммирующиеЗадачи.Найти(СтрокаЗадача.ПроектнаяЗадача) = Неопределено, 0, 1));
		
		// DurationFormat.
		ИмяСвойства = "DurationFormat";
		ОбъектXDTOTask[ИмяСвойства] =  СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO[ИмяСвойства],
			?(Параметры.СуммирующиеЗадачи.Найти(СтрокаЗадача.ПроектнаяЗадача) = Неопределено, 39, 53));
		
		// Type.
		ИмяСвойства = "Type";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
			?(Параметры.СуммирующиеЗадачи.Найти(СтрокаЗадача.ПроектнаяЗадача) = Неопределено, 0, 1));
		
		ИмяСвойства = "Name";
		СтрокаЗадача.Name = СокрЛП(СтрокаЗадача.Name);
		СтрокаЗадача.Name = упоФункцииОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXMLиТабуляцию(СтрокаЗадача.Name);
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
			?(СтрокаЗадача.Name = "", НСтр("ru = '<Не указано>'"), СтрокаЗадача.Name));
		
		Если ЕстьОсновнойПроект Или ЕстьТаблицаСвязей Тогда
			
			Если ЕстьТаблицаСвязей Тогда
				// Создадим предшественника PredecessorLink.
				ЗаполнитьPredecessorLink(Параметры,ОбъектXDTOTask.PredecessorLink,СтрокаЗадача);
			КонецЕсли;
			
			УровеньВСДРДляВехи = ОбъектXDTOTask.OutlineLevel;
			ВыводимВложенныеЗадачи = ОбъектXDTOTask.Summary;
			
		КонецЕсли;
		
		ИмяСвойства = "Milestone";
		ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
			?(СтрокаЗадача.ЭтоВеха, 1, 0));
		
		Если ЕстьПроцентГотовности Тогда
			ИмяСвойства = "PercentComplete";
			ОбъектXDTOTask[ИмяСвойства] = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO[ИмяСвойства],
				Окр(СтрокаЗадача.ПроцентГотовности, 0)); // В MSP целочисленый % готовности.
		КонецЕсли;
			
		СписокXDTO.Добавить(ОбъектXDTOTask);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УвеличитьСчетчикUID(Параметры)

	Параметры.Вставить("СчетчикUID",Параметры.СчетчикUID +1);	

КонецПроцедуры

Процедура УвеличитьСчетчикID(Параметры)

	Параметры.Вставить("TasksID",Параметры.TasksID +1);	

КонецПроцедуры

Процедура ЗаполнитьPredecessorLink(Параметры, СписокXDTO, СтрокаЗадача)

   	СписокXDTO.Очистить(); // В списке обязательно создается один объект, но мы заполняем по-своему.
 	Фабрика = Параметры.Фабрика;
	
	МассивРодителей = Параметры.ТаблицаСвязейПроекта.НайтиСтроки(
		Новый Структура("КонецСвязи", СтрокаЗадача.ПроектнаяЗадача));
	
	Если МассивРодителей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//UIDРодителя = Параметры.СоответствиеTasksUID[МассивРодителей[0]["НачалоСвязи"]];
	
	// Добавить проектную веху <Milestone>.
	// Необязательный указывает, является ли задача вехой.
	
	//Если UIDРодителя = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	
	//ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	//ОбъектXDTO =  СоздатьОбъектXDTO(Фабрика,ТипОбъекта);     
	//
	//СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Фабрика, ОбъектXDTO, ТипОбъекта.Свойства);
	//
	//ОбъектXDTO.PredecessorUID =  СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["PredecessorUID"],UIDРодителя);
	//ОбъектXDTO.LinkLag = СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["LinkLag"],МассивРодителей[0].Задержка * 600);
	//ОбъектXDTO.LagFormat = СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["LagFormat"],5);
	//ОбъектXDTO.CrossProject = СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["CrossProject"],0);
	//ОбъектXDTO.Type = ПреобразоватьТипСвязиВMSProject(МассивРодителей[0].ТипСвязиЭлементов);
	//
	//СписокXDTO.Добавить(ОбъектXDTO);
	
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	
	Для Каждого ЭлРодитель Из МассивРодителей Цикл
		
		UIDРодителя = Параметры.СоответствиеTasksUID[ЭлРодитель["НачалоСвязи"]];
	
		// Добавить проектную веху <Milestone>.
		// Необязательный указывает, является ли задача вехой.
	
		Если UIDРодителя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектXDTO =  СоздатьОбъектXDTO(Фабрика,ТипОбъекта);     
		СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Фабрика, ОбъектXDTO, ТипОбъекта.Свойства);
		
		ОбъектXDTO.PredecessorUID =  СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["PredecessorUID"],UIDРодителя);
		ОбъектXDTO.LinkLag = СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["LinkLag"],ЭлРодитель.Задержка * 600);
		ОбъектXDTO.LagFormat = СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["LagFormat"],5);
		ОбъектXDTO.CrossProject = СоздатьОбъектXDTO(Фабрика,СоответствиеТиповXDTO["CrossProject"],0);
		ОбъектXDTO.Type = ПреобразоватьТипСвязиВMSProject(ЭлРодитель.ТипСвязиЭлементов);
		
		СписокXDTO.Добавить(ОбъектXDTO);
		
	КонецЦикла;


КонецПроцедуры

Функция ПреобразоватьТипСвязиВMSProject(Значение)
	
	// Возвращаемое значение:
	// Тип связи с задачей:
	//	0 ОО (окончание-окончание);
	//	1 ОН (окончание-начало);
	//	2 НО (начало-окончание);
	//	3 НН (начало-начало).
	
	упоТипСвязи = Перечисления.упоТипСвязи;
	
	Если Значение = упоТипСвязи.ОкончаниеОкончание Тогда
		Возврат 0;
	ИначеЕсли Значение = упоТипСвязи.ОкончаниеНачало Тогда
		Возврат 1;
	ИначеЕсли Значение = упоТипСвязи.НачалоОкончание Тогда
		Возврат 2;
	ИначеЕсли Значение = упоТипСвязи.НачалоНачало Тогда
		Возврат 3;
	Иначе
		Возврат 1;
	КонецЕсли;   

КонецФункции

Функция СоздатьЗаполнитьОбъектXDTOAssignments(Параметры, ТипОбъекта, ТипВыгрузки)
	
	// Основное значение, по сути это проект который нам нужно наполнить данными из 1с, но в формате,
	// который воспримет MS Project.
	
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Параметры.Фабрика,ТипОбъекта); 
	
	// Нужно заполнить список.
	ЗаполнитьСписокXDTOAssignment(Параметры,ОбъектXDTO.Assignment,ТипВыгрузки);
	
	// Больше свойств у задач нет, заполнять нечего.
	
	Возврат ОбъектXDTO;
	
КонецФункции

Процедура ЗаполнитьСписокXDTOAssignment(Параметры, СписокXDTO, ТипВыгрузки)
	
	СписокXDTO.Очистить();
	
	Фабрика = Параметры.Фабрика;
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	
	ДляСоответствияОбъектXDTO = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
	СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Фабрика, ДляСоответствияОбъектXDTO, ТипОбъекта.Свойства);
	
	ИмяПроектнаяЗадача  = "ПроектнаяЗадача"; 
	
	Если ТипВыгрузки Тогда 
		ИмяРесурс = "Ресурс";
	Иначе
		Имяресурс = "РольРесурса";	
	КонецЕсли;
	
	// Нам нужно связать UID Task и UID Resources.
	ПостроительОтчетаТрудРес = Параметры.ПостроительОтчетаТрудРес;
	ПостроительОтчетаТрудРес.Отбор.Добавить(ИмяПроектнаяЗадача);
	Если ТипВыгрузки <> 2 Тогда
		ПостроительОтчетаТрудРес.Отбор.Добавить(ИмяРесурс);
	КонецЕсли;
	
	Для каждого ТекПрЗадача Из Параметры.СоответствиеTasksUID Цикл
		
		// Ищем все ресурсы, которые с ней связаны.
		ПостроительОтчетаТрудРес.Отбор[ИмяПроектнаяЗадача].Установить(ТекПрЗадача.Ключ);
		
		ДанныеПроектнойЗадачи = Параметры.Задачи.Найти(ТекПрЗадача.Значение, "UID");
		Start = ДанныеПроектнойЗадачи.Start;
		Finish = ДанныеПроектнойЗадачи.Finish;
		
		Для каждого ТекРесурс Из Параметры.СоответствиеResourcesUID Цикл
			
			ПостроительОтчетаТрудРес.Отбор[ИмяРесурс].Установить(ТекРесурс.Ключ);
			
			ПостроительОтчетаТрудРес.Выполнить();
			
			Если ПостроительОтчетаТрудРес.Результат.Пустой() Тогда 
				Продолжить;
			КонецЕсли;
			
			Выборка = ПостроительОтчетаТрудРес.Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ОбъектXDTO = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
				
				ОбъектXDTO.UID = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["UID"], Параметры.СчетчикUID);
				УвеличитьСчетчикUID(Параметры);
				
				ОбъектXDTO.TaskUID = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["TaskUID"], ТекПрЗадача.Значение);
				ОбъектXDTO.ResourceUID = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["ResourceUID"], ТекРесурс.Значение);
				
				ОбъектXDTO.Start = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["Start"], Start);
				ОбъектXDTO.Finish = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["Finish"], Finish);
				
				ЗначениеMSProject = ЗначениеТрудозатратВФорматеMSProject(Выборка.Work);
				ОбъектXDTO.Work = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["Work"], ЗначениеMSProject);
				ОбъектXDTO.RemainingWork = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["RemainingWork"], ЗначениеMSProject);
				// Количество выделенных трудовых ресурсов на роль. Заполняем по умолчанию единицей.
				ОбъектXDTO.Units = СоздатьОбъектXDTO(Фабрика, СоответствиеТиповXDTO["Units"], "1");
				//
				
				СписокXDTO.Добавить(ОбъектXDTO);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;		
	
КонецПроцедуры

Функция СоздатьЗаполнитьОбъектXDTOResources(Параметры, ТипОбъекта, ТипВыгрузки)
	
	// Основное значение, по сути это проект который нам нужно наполнить данными из 1с, но в формате,
	// который воспримет MS Project.
	
	// Создаем объектXDTO.
	ОбъектXDTO = СоздатьОбъектXDTO(Параметры.Фабрика, ТипОбъекта); 
	
	// Нужно заполнить список Resource.
	ЗаполнитьСписокXDTOResource(Параметры, ОбъектXDTO.Resource, ТипВыгрузки);
	
	// Больше свойств у объекта нет, заполнять нечего.
	
	Возврат ОбъектXDTO;
	
КонецФункции 

Функция ПолучитьСоответствиеЗначения1СResource(Параметры, СоответствиеТиповXDTO, Выборка, ТипВыгрузки)
	
	Соответствие = Новый Соответствие();
	
	Соответствие.Вставить("UID", Параметры.СчетчикUID);
	Соответствие.Вставить("ID", Параметры.ResourcesID);
	
	Если ТипВыгрузки Тогда  
		Параметры.СоответствиеResourcesUID.Вставить(Выборка.Ресурс, Параметры.СчетчикUID);
	Иначе 
		Параметры.СоответствиеResourcesUID.Вставить(Выборка.РольРесурса, Параметры.СчетчикUID);
	КонецЕсли;
	
	УвеличитьСчетчикUID(Параметры);
	Параметры.Вставить("ResourcesID",Параметры.ResourcesID +1);
	
	Для каждого ТекТип Из СоответствиеТиповXDTO Цикл
		Попытка
			ИмяПоляXML = ТекТип.Ключ;
			ЗначениеПоляИзВыборки = Выборка[ТекТип.Ключ];
			
			Соответствие.Вставить(ИмяПоляXML, ЗначениеПоляИзВыборки);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ЗначениеТрудозатратВФорматеMSProject(Знач КоличествоЧасов)
	
	ЗначениеMSProject = "PT" + ?(КоличествоЧасов = 0, "0", Формат(КоличествоЧасов, "ЧДЦ=0; ЧГ=0")) + "H0M0S";
	Возврат ЗначениеMSProject;
	
КонецФункции

Функция ПолучитьТрудовыеРесурсыПроектныхЗадач(Параметры)
	
	ЗапросТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли) КАК Роль,
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
		| СУММА(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов) КАК КоличествоЧасовПлан
		|ПОМЕСТИТЬ ВТ_ПлановыеТрудозатраты
		|ИЗ
		| РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
		|ГДЕ
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача В(&СписокПроектныхЗадач)
		| И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоРоли
		| И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = &УровеньПланирования
		|
		|СГРУППИРОВАТЬ ПО
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли),
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		| ВыделенныеТрудРес.Ресурс.Наименование КАК Name,
		| 1 КАК Type,
		| ВыделенныеТрудРес.Ресурс.Представление КАК Initials,
		| ВыделенныеТрудРес.ПроектнаяЗадача.ПроектнаяЗадача КАК Родитель,
		| ВыделенныеТрудРес.ПроектнаяЗадача КАК ПроектнаяЗадача,
		| ВыделенныеТрудРес.Ресурс КАК Ресурс,
		| ВыделенныеТрудРес.РольРесурса КАК РольРесурса,
		| ВыделенныеТрудРес.ДоляТрудозатрат КАК ДоляТрудозатрат
		|ПОМЕСТИТЬ ВТ_ВыделенныеТрудовыеРесурсы
		|ИЗ
		| РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
		|         &ДатаСреза,
		|         Версия = &ТекущаяВерсия
		|             И ПроектнаяЗадача В (&СписокПроектныхЗадач)) КАК ВыделенныеТрудРес
		|ГДЕ
		| ВыделенныеТрудРес.ДоляТрудозатратПоУровнюПланирования = &УровеньПланирования
		|
		|СГРУППИРОВАТЬ ПО
		| ВыделенныеТрудРес.ПроектнаяЗадача,
		| ВыделенныеТрудРес.Ресурс,
		| ВыделенныеТрудРес.Ресурс.Наименование,
		| ВыделенныеТрудРес.Ресурс.Представление,
		| ВыделенныеТрудРес.ПроектнаяЗадача.ПроектнаяЗадача,
		| ВыделенныеТрудРес.РольРесурса,
		| ВыделенныеТрудРес.ДоляТрудозатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		| ВТ_ВыделенныеТрудовыеРесурсы.Name КАК Name,
		| ВТ_ВыделенныеТрудовыеРесурсы.Type КАК Type,
		| ВТ_ВыделенныеТрудовыеРесурсы.Initials КАК Initials,
		| ВТ_ВыделенныеТрудовыеРесурсы.Родитель КАК Родитель,
		| ВТ_ВыделенныеТрудовыеРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
		| ВТ_ВыделенныеТрудовыеРесурсы.Ресурс КАК Ресурс,
		| ЕСТЬNULL(ВТ_ПлановыеТрудозатраты.КоличествоЧасовПлан, 0) * ВТ_ВыделенныеТрудовыеРесурсы.ДоляТрудозатрат / 100 КАК Work
		|ИЗ
		| ВТ_ВыделенныеТрудовыеРесурсы КАК ВТ_ВыделенныеТрудовыеРесурсы
		|     ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеТрудозатраты КАК ВТ_ПлановыеТрудозатраты
		|     ПО ВТ_ВыделенныеТрудовыеРесурсы.ПроектнаяЗадача = ВТ_ПлановыеТрудозатраты.ПроектнаяЗадача";
	
	Запрос = Новый Запрос(ЗапросТекст);
	Запрос.УстановитьПараметр("ДатаСреза", Параметры.ДатаСреза);
	Запрос.УстановитьПараметр("СписокПроектныхЗадач", Параметры.СписокПроектныхЗадач);
	Запрос.УстановитьПараметр("ТекущаяВерсия", Параметры.ТекущаяВерсияОсновногоПроекта);
	Запрос.УстановитьПараметр("УровеньПланирования", Параметры.УровеньПланированияТрудозатрат);
	
	Выборка = Запрос.Выполнить();
	
	Возврат Выборка;
	
КонецФункции

Функция ПолучитьВыделенныеТрудовыеРесурсы(Параметры)
	
	ЗапросТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| ВыделенныеТрудРес.Ресурс.Наименование КАК Name,
		| 1 КАК Type,
		| ВыделенныеТрудРес.Ресурс.Представление КАК Initials,
		| ВыделенныеТрудРес.ПроектнаяЗадача.ПроектнаяЗадача КАК Родитель,
		| ВыделенныеТрудРес.ПроектнаяЗадача КАК ПроектнаяЗадача,
		| ВыделенныеТрудРес.Ресурс КАК Ресурс
		|ИЗ
		| РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(&ДатаСреза, Версия = &ТекущаяВерсия) КАК ВыделенныеТрудРес
		|     ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|     ПО ВыделенныеТрудРес.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|ГДЕ
		| ВыделенныеТрудРес.ДоляТрудозатратПоУровнюПланирования = &УровеньПланирования
		| И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
	
	Запрос = Новый Запрос(ЗапросТекст);
	Запрос.УстановитьПараметр("ДатаСреза", Параметры.ДатаСреза);
	Запрос.УстановитьПараметр("Проект", Параметры.ОсновнойПроект);
	Запрос.УстановитьПараметр("ТекущаяВерсия", Параметры.ТекущаяВерсияОсновногоПроекта);
	Запрос.УстановитьПараметр("УровеньПланирования", Параметры.УровеньПланированияТрудозатрат);
	
	Выборка = Запрос.Выполнить();
	
	Возврат Выборка;
	
КонецФункции

Функция ПолучитьПустыеВыделенныеТрудовыеРесурсы(Параметры)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТР.Ресурс.Наименование КАК Name,
	|	1 КАК Type,
	|	ВТР.Ресурс.Представление КАК Initials,
	|	ВТР.ПроектнаяЗадача.ПроектнаяЗадача КАК Родитель,
	|	ВТР.ПроектнаяЗадача,
	|	ВТР.Ресурс
	|ИЗ
	|	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних() КАК ВТР ГДЕ ЛОЖЬ");
	
	Выборка = Запрос.Выполнить();
	
	Возврат Выборка;
	
КонецФункции

// Получает трудовые роли  по каждой проектной задаче.
//
// Параметры:
//  Параметры – Параметр.
//
// Возвращаемое значение:
//   Выборка – результат запроса.
//
Функция ПолучитьТрудовыеРолиПроектныхЗадач(Параметры)
	
	ЗапросТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| 1 КАК Type,
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли).Наименование КАК Name,
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача.ЗадачаРодитель КАК Родитель,
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли) КАК РольРесурса,
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли).Представление КАК Initials,
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов КАК Work
		|ИЗ
		| РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
		|ГДЕ
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача В(&СписокПроектныхЗадач)
		| И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоРоли
		| И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = &УровеньПланирования";
	
	Запрос = Новый Запрос(ЗапросТекст);
	Запрос.УстановитьПараметр("СписокПроектныхЗадач", Параметры.СписокПроектныхЗадач);
	Запрос.УстановитьПараметр("УровеньПланирования", Параметры.УровеньПланированияТрудозатрат);
	
	Выборка = Запрос.Выполнить();
	
	Возврат Выборка;
	
КонецФункции

// Получает трудовые роли  по проекту.
//
// Параметры:
//  Параметры – Параметр.
//
// Возвращаемое значение:
//   Выборка – результат запроса.
//
Функция ПолучитьВыделенныеТрудовыеРоли(Параметры)
	
	ЗапросТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		| 1 КАК Type,
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли).Наименование КАК Name,
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача.ЗадачаРодитель КАК Родитель,
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли) КАК РольРесурса,
		| ВЫРАЗИТЬ(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Справочник.упоРоли).Представление КАК Initials
		|ИЗ
		| РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
		|     ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсияПроекта) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|     ПО упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|ГДЕ
		| упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Проект = &Проект
		| И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоРоли
		| И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = &УровеньПланирования
		| И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
	
	Запрос = Новый Запрос(ЗапросТекст);
	Запрос.УстановитьПараметр("Проект", Параметры.ОсновнойПроект);
	Запрос.УстановитьПараметр("ТекущаяВерсияПроекта", Параметры.ТекущаяВерсияОсновногоПроекта);
	Запрос.УстановитьПараметр("УровеньПланирования", Параметры.УровеньПланированияТрудозатрат);
	
	Выборка = Запрос.Выполнить();
	
	Возврат Выборка;
	
КонецФункции

Процедура ЗаполнитьСписокXDTOResource(Параметры, СписокXDTO, ТипВыгрузки)
	
	СписокXDTO.Очистить();
	
	Фабрика = Параметры.Фабрика;
	ТипОбъекта = ПолучитьТипСпискаXDTO(СписокXDTO);
	
	// Объекты у нас будут одинаковые, типы тоже, поэтому создадим общее соответствие.
	ДляТиповОбъектXDTO = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
	СоответствиеТиповXDTO = ПолучитьСоответствиеТиповXDTO(Фабрика, ДляТиповОбъектXDTO, ТипОбъекта.Свойства);
	
	// Получить выделенные трудовые ресурсы.
	Выборка = Параметры.ВыделенныеТрудовыеРесурсы.Выбрать();
	
	СписокДобавленныеРесурсы = Новый Массив;
	
	КолонкаРольРесурс = "";
	Если ТипВыгрузки Тогда
		КолонкаРольРесурс = "Ресурс";
	Иначе
		КолонкаРольРесурс = "РольРесурса";
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если СписокДобавленныеРесурсы.Найти(Выборка[КолонкаРольРесурс]) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокДобавленныеРесурсы.Добавить(Выборка[КолонкаРольРесурс]);
		
		ОбъектXDTO = СоздатьОбъектXDTO(Фабрика, ТипОбъекта);
		
		СоответствиеЗначения1С = ПолучитьСоответствиеЗначения1СResource(Параметры, СоответствиеТиповXDTO, Выборка, ТипВыгрузки);
		
		СоответствиеResourcesUID = ПолучитьСоответствиеЗначенийXDTO(Фабрика, СоответствиеТиповXDTO, СоответствиеЗначения1С);
		
		ЗаполнитьОбъектXDTOЗначениямиXDTO(ОбъектXDTO, СоответствиеResourcesUID);
		
		СписокXDTO.Добавить(ОбъектXDTO);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти