#Область ОбменСоСКУД

// Процедура - Получить данные sigur
//Получение зон и точек доступа регламентным заданием ИКТ_ПолучениеДанныхИзСКУД
//путём обращения к СКУД с помощью http запросов 
Процедура ПолучитьДанныеSigur() Экспорт
	
	//ОТКЛЮЧИЛ ЗАПИСЬ ЗОН И ТОЧЕК ДОСТУПА, Т.К. ЕСТЬ КУЧА ЛИШНИХ С ДРУГОЙ ОРГАНИЗАЦИИ
	//НУЖНО ИЛИ ЗАВОДИТЬ ТОЧКИ И ЗОНЫ РУКАМИ ИЛИ СДЕЛАТЬ ФУНКЦИОНАЛ, ЧТОБЫ ОНИ САМИ ЗАВОДИЛИ
	
	////Запись новых точек или изменение старых
	//Параметры = Новый Массив;
	////limit
	//limit = Новый Массив;
	//limit.Добавить(300);
	//Параметры.Добавить(Новый Структура("limit",limit));
	//QueryParameters = ЗадатьQueryParameters(Параметры);
	//
	//ОтветТочкиДоступа = Получить("accesspoints",,QueryParameters,,10);
	//Попытка
	//	Если ТипЗнч(ОтветТочкиДоступа) = Тип("Число") Тогда
	//		ВызватьИсключение("Код ошибки: "+ОтветТочкиДоступа);
	//	Иначе 
	//		ИКТ_СКУД.ИзменитьТочкиДоступа(ОтветТочкиДоступа);
	//	КонецЕсли;
	//	ЗаписьЖурналаРегистрации("Получение точек доступа из СКУД",УровеньЖурналаРегистрации.Информация,,"Точки доступа успешно получены.");
	//Исключение
	//	ЗаписьЖурналаРегистрации("Получение точек доступа из СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	//КонецПопытки;
	
	////Запись новых зон доступа или изменение старых
	//ОтветЗоныДоступа = Получить("zones",,,,10);
	//Попытка
	//	Если ТипЗнч(ОтветЗоныДоступа) = Тип("Число") Тогда
	//		ВызватьИсключение("Код ошибки: "+ОтветЗоныДоступа);
	//	Иначе
	//		ИКТ_СКУД.ИзменитьЗоныДоступа(ОтветЗоныДоступа);
	//	КонецЕсли;
	//	ЗаписьЖурналаРегистрации("Получение зон доступа из СКУД",УровеньЖурналаРегистрации.Информация,,"Зоны доступа успешно получены");
	//Исключение
	//	ЗаписьЖурналаРегистрации("Получение зон доступа из СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	//КонецПопытки;
	
	//20.05.24
	//Запись событий прохода
	
	//{ИКТ 21.04.2024
	// Примечание: для подчиненного узла не нужно выполнять процедуру
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда 
		Возврат
	КонецЕсли;
	//}ИКТ
	
	//limit
	EventsTypesПараметры = Новый Массив;
	EventsTypesLimit = Новый Массив;
	EventsTypesLimit.Добавить(300);
	EventsTypesПараметры.Добавить(Новый Структура("limit",EventsTypesLimit));
	EventsTypesQueryParameters = ЗадатьQueryParameters(EventsTypesПараметры);
	
	ОтветТипыСобытий = Получить("events/types",,EventsTypesQueryParameters,,10);
	Попытка
		Если ТипЗнч(ОтветТипыСобытий) = Тип("Число") Тогда
			ВызватьИсключение("Код ошибки: "+ОтветТипыСобытий);
		Иначе	
			ИКТ_СКУД.ЗаписатьТипыСобытий(ОтветТипыСобытий);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Получение типов событий из СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	КонецПопытки;
	
	EventsПараметры = Новый Массив;	
	//lastId
	Попытка
		ID_Прохода = ИКТ_СКУД.ID_ПоследнегоСобытия();
		Если ID_Прохода = Неопределено Тогда
			ВызватьИсключение("Нет ID последнего прохода");
		КонецЕсли;
		EventsLastId = Новый Массив;
		EventsLastId.Добавить(ID_Прохода);
		EventsПараметры.Добавить(Новый Структура("lastId",EventsLastId));
	
		//limit
		EventsLimit = Новый Массив;
		EventsLimit.Добавить(3000);  //Максимум 3000 (ограничение СКУД)
		EventsПараметры.Добавить(Новый Структура("limit",Eventslimit));
		
		EventsQueryParameters = ЗадатьQueryParameters(EventsПараметры);	
		ОтветСобытияПрохода = Получить("events",,EventsQueryParameters,,15);
		//Не работает, нет соединения с сервисом
		//ОтветСобытияПрохода = Получить("events/parsed",,EventsQueryParameters,,10);
	Если ТипЗнч(ОтветСобытияПрохода) = Тип("Число") Тогда
		ВызватьИсключение("Код ошибки: "+ОтветСобытияПрохода);
	Иначе	
		ИКТ_СКУД.ЗаписатьСобытияПрохода(ОтветСобытияПрохода);
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Получение событий проходов из СКУД",УровеньЖурналаРегистрации.Информация,,"События прохода успешно получены.");
	Исключение
		ЗаписьЖурналаРегистрации("Получение событий проходов из СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьJWTTokenSigur(СерверSigur)
	
	//Устарело
	//АдресРесурса = "api/v1/application-keys/auth";
	//СтруктураТела = Новый Структура;
	//СтруктураТела.Вставить("system","1C:Предприятие ЗУП КОРП 3.1");
	//СтруктураТела.Вставить("password",Константы.ИКТ_ПарольREST_API.Получить());
	
	АдресРесурса = "/api/v1/users/auth";
	СтруктураТела = Новый Структура;
	СтруктураТела.Вставить("username",Константы.ИКТ_ЛогинREST_API.Получить());
	СтруктураТела.Вставить("password",Константы.ИКТ_ПарольREST_API.Получить());
	ТелоЗапроса = ЗаписатьJSONСтроку(СтруктураТела);
	
	Соединение = Новый HTTPСоединение(СерверSigur,9500,,,,10);
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	Запрос.Заголовки.Вставить("Content-Type", "application/json"); 
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;	
		
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	//Устарело
	//Возврат ?(Ответ.КодСостояния = 200, СтрСоединить(СтрРазделить(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8),""""),""), Ответ.КодСостояния);
	Возврат ?(Ответ.КодСостояния = 200, ПрочитатьJSONСтроку(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8)), Ответ.КодСостояния);
КонецФункции

// Функция - Соединиться
//
// Параметры:
//  Метод			Методы http - Строка - методы для отправки запросов
//  ИмяМетода		Имя метода СКУД - Строка - для подключения к нужному методу СКУД, 
//	может содержать путь (PathParametr)
//  QueryParameters	Параметры запроса - Строка - Для отбора конкретных данных
//  ТелоЗапроса		Тело запроса - Строка JSON - Набор данных отправляемых с запросом
//  Таймаут			Время ответа - Число - Время ответа от СКУД
// 
// Возвращаемое значение:
//  Ответ от СКУД - Структура или Число
//
Функция Соединиться(Метод, ИмяМетода,QueryParameters="", ТелоЗапроса = Неопределено, Знач Таймаут = 0) Экспорт
	АдресРесурса = "api/v1/"+ИмяМетода+QueryParameters;
	
	СерверSigur = Константы.ИКТ_СерверSigur.Получить();
	Соединение = Новый HTTPСоединение(СерверSigur,9500,,,,10);	
	
	//Устарело
	//JWTTokenSigur = ПолучитьJWTTokenSigur(СерверSigur);
	JWTTokenSigur = ПолучитьJWTTokenSigur(СерверSigur).token;
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Authorization", "Bearer"+" "+JWTTokenSigur);
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		ТелоЗапроса = ЗаписатьJSONСтроку(ТелоЗапроса);	
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;	
		
	Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);
	Возврат ?(Ответ.КодСостояния = 200, ПрочитатьJSONСтроку(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8)), Ответ.КодСостояния); 	
КонецФункции

Функция Получить(ИмяМетода, PathParametr="", QueryParameters="", ТелоЗапроса = Неопределено, Таймаут) Экспорт
	СтрМетод = ?(ЗначениеЗаполнено(PathParametr),ИмяМетода+"/"+PathParametr,ИмяМетода);
	Возврат Соединиться("GET", СтрМетод, QueryParameters, ТелоЗапроса, Таймаут);	
КонецФункции

Функция Отправить(ИмяМетода,QueryParameters="", ТелоЗапроса = Неопределено) Экспорт
	Возврат Соединиться("POST", ИмяМетода,QueryParameters, ТелоЗапроса);
КонецФункции

// Функция - Изменить
//
// Параметры:
//  ИмяМетода	Имя метода СКУД - Строка - для подключения к нужному методу СКУД 
//  PathParametr Путь метода - Строка - Содержит конкретное число (id) которое указывает на id
//	объекта данные которого мы запрашиваем
//  ТелоЗапроса	Тело запроса - Строка JSON - Набор данных отправляемых с запросом
// 
// Возвращаемое значение:
//  Ответ от СКУД - Структура или Число 
//
Функция Изменить(ИмяМетода,PathParametr="",ТелоЗапроса = Неопределено) Экспорт
	Возврат Соединиться("PUT", ИмяМетода+"/"+PathParametr,,ТелоЗапроса,10);
КонецФункции

// Функция - Разрешить проход
//
// Параметры:
//  keyHex		Значение карты - Строка - Hex значение карты
//  direction	Вид входа - Строка - Вид входа: выход = 1, вход = 2, неизвестно = 3
//  accessPoint	Точка доступа - Строка - Номер точки доступа
// 
// Возвращаемое значение:
//  Булево 
//
Функция РазрешитьПроход(keyHex, direction, accessPoint) Экспорт
	
	Если direction = 1 Тогда
		Возврат Истина
	ИначеЕсли direction = 3 Тогда
		Возврат Ложь
	Иначе
		Возврат ИКТ_СКУД.ПроверитьНаличиеДоступа(keyHex,accessPoint)
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьJSONСтроку(Строка) Экспорт
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись,Строка);
	Возврат Запись.Закрыть(); 
КонецФункции

Функция ПрочитатьJSONСтроку(СтрокаJSON) Экспорт
	Попытка
		Если ТипЗнч(СтрокаJSON) = Тип("Число") Тогда
			Возврат СтрокаJSON; //Код ошибочного ответа
		КонецЕсли;
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаJSON);
		ОбъектJSON = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
		Возврат ОбъектJSON;
	Исключение
		ЗаписьЖурналаРегистрации("Делегация СКУД",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки());
	КонецПопытки;

КонецФункции

Функция ЗадатьQueryParameters(Параметры) Экспорт
	
	ВсеПараметры="";
	Для Каждого Набор Из Параметры Цикл
		
		Для Каждого Строка Из Набор Цикл
			
			ЗначенияПараметра=""; 
			Для Каждого Стр Из Строка.Значение Цикл
				
				//23.05.24 исправление бага с группировкой чисел
				Стр = ?(ТипЗнч(Стр) = Тип("Число"),Формат(Стр,"ЧГ=0"),Стр);
				
				ЗначенияПараметра = ?(Не ЗначениеЗаполнено(ЗначенияПараметра),Стр,ЗначенияПараметра+","+Стр);
				
			КонецЦикла;
			ВсеПараметры = ?(Не ЗначениеЗаполнено(ВсеПараметры),СтрШаблон("%1=%2",Строка.Ключ,ЗначенияПараметра),
			ВсеПараметры+"&"+СтрШаблон("%1=%2",Строка.Ключ,ЗначенияПараметра));
		КонецЦикла;
	КонецЦикла;
	
	Возврат "?"+ВсеПараметры
КонецФункции

#КонецОбласти