////////////////////////////////////////////////////////////////////////////////
// Привилегированный модуль с процедурами и функциями для записи и проведения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция служит для удаления записей из регистра, сделанные версией (документом) при ее восстановлении в текущую.
//
// Параметры:
//  ИмяРегистра - Строка 								– имя регистра.
//  ОбСсылка	- Произвольный	 						- некая ссылка, значение параметра в запросе, по которому 
//														  отбираются записи для отбора записей в регистре.
//  Версия		 - ДокументСсылка.упоВерсияПланаПроекта – ссылка на версию.
//  ПолеПоиска	 - Строка 								– поле параметра в запросе.
//  ДопОтборы	 - Произвольный 						- не используется.
//
// Возвращаемое значение:
//	Неопределено 
//
Функция ОчиститьДвиженияВерсии(ИмяРегистра,
							   ОбСсылка,
							   Версия,
							   ПолеПоиска = Неопределено,
							   ДопОтборы = Неопределено) Экспорт
	
	Если ПолеПоиска = Неопределено Тогда
		
		Если ТипЗнч(ОбСсылка) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда		
			ПолеПоиска = "ПроектнаяЗадача";
		КонецЕсли;
				
	КонецЕсли;
	
	Если Не ПолеПоиска = Неопределено Тогда
		ОчиститьДвиженияВерсииПоРегистрам(Версия, ОбСсылка, ИмяРегистра, ПолеПоиска);
	КонецЕсли;
			
КонецФункции

// Создает новую версию на основании копируемой версии.
//
// Параметры:
//  ДанныеЗаполнения - Структура:
//  * Проект				 - СправочникСсылка.Проекты 			- ссылка на проект, для которого создается версия.
//  * КопируемаяВерсия	     - ДокументСсылка.упоВерсияПланаПроекта - версия основание.
//  * НаименованиеВерсии	 - Строка 								- наименование версии.
//  * Системная			     - Булево 								- признак того, что создаваемая версия системная.
//  * Базовая				 - Булево 								- признак того, что создаваемая версия базовая.
//  * Текущая				 - Булево 								- признак того, что создаваемая версия текущая.
//
// Возвращаемое значение:
//	Строка - если пустая, то все ок; иначе - сообщение об ошибке.
//
Процедура КопироватьВерсию(ДанныеЗаполнения) Экспорт
	
	упоВерсионирование.КопироватьВерсию(ДанныеЗаполнения);
		
КонецПроцедуры

// Записывает версию плана проекта.
//
// Параметры:
//  Версия	 - ДокументСсылка.упоВерсияПланаПроекта - записываемая версия.
//
// Возвращаемое значение:
//	Неопределено - не возвращает ничего.
//
Функция ЗаписатьВерсию(Версия) Экспорт
	
	Версия.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции

// Помечает на удаление базовую версию проекта, удаляет запись с этой версией из регистра "Версии проектов".
//
// Параметры:
//  Проект			 - СправочникСсылка.Проекты 			- проект, которому принадлежит версия. Нужен для отбора в регистре.
//  ВерсияПроекта	 - ДокументСсылка.упоВерсияПланаПроекта - удаляемая версия.
//
// Возвращаемое значение:
//	Неопределено - не возвращает ничего.
//
Функция УдалитьВерсиюПроекта(Проект, ВерсияПроекта) Экспорт

	ВерсияОбъект = ВерсияПроекта.ПолучитьОбъект();
	ВерсияОбъект.УстановитьПометкуУдаления(Истина);
	
	НаборЗаписей = РегистрыСведений.упоВерсииПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Проект.Установить(Проект);
	НаборЗаписей.Отбор.Версия.Установить(ВерсияПроекта);
	НаборЗаписей.Записать();
	
	МассивНезависимыхРегистров = Новый Массив;
	МассивНезависимыхРегистров.Добавить("упоАктуальныеПланыТрудозатратСводноВерсии");
	МассивНезависимыхРегистров.Добавить("упоАктуальныеПланыТрудозатратПоДнямВерсии");
		
	Для Каждого ИмяРегистра Из МассивНезависимыхРегистров Цикл
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Версия.Установить(ВерсияПроекта);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецФункции

// Обновляет базовую версию проекта.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - проект, для которого необходимо обновить базовую версию.
//    
Процедура ОбновитьБазовуюВерсиюПроекта(Проект) Экспорт 
	
	// Проверим, что еще нет текущей версии.
	базоваяВерсия = упоВерсионирование.ПолучитьБазовуюВерсиюПроекта(Проект);

	ПроектныеОпции = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	
    Если базоваяВерсия = Неопределено Тогда 
        ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
        
        ДанныеЗаполнения = упоВерсионирование.ДанныеЗаполненияВерсииПоУмолчанию(Проект, ТекущаяВерсия);
        
        ДопДанныеЗаполнения = Новый Структура("НаименованиеВерсии,
            |Базовая, ВключаетДанныеВыполнения", 
                упоВерсионирование.ПолучитьНаименованиеБазовойВерсии(), Истина,
    			ПроектныеОпции.ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки);
                
        ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ДопДанныеЗаполнения);
                
        упоЗаписьИПроведениеПривилегированный.КопироватьВерсию(ДанныеЗаполнения);
	Иначе // Уже есть базовая версия - ее нужно просто перепровести.
		упоЗаписьИПроведениеПривилегированный.ЗаписатьВерсию(базоваяВерсия.ПолучитьОбъект());
	КонецЕсли; 
		
КонецПроцедуры

// Создает новый документ - текущую версию проекта.
//
// Параметры:
//  Проект					- СправочникСсылка.Проекты 				- проект, для которого создается текущая версия.
//  ВосстанавливаемаяВерсия - ДокументСсылка.упоВерсияПланаПроекта 	- необязательный параметр. Если указан, то
//																	  является основанием для создаваемой версии.
//
// Возвращаемое значение:
//	ДокументСсылка.упоВерсияПланаПроекта - ссылка на созданную версию.
//
Функция СоздатьТекущуюВерсиюПроекта(Проект, ВосстанавливаемаяВерсия = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Проект) Тогда
		Возврат Документы.упоВерсияПланаПроекта.ПустаяСсылка();
	КонецЕсли;
	
	ТекущаяВерсия = Документы.упоВерсияПланаПроекта.СоздатьДокумент();
	ТекущаяВерсия.Проект = Проект;
	ТекущаяВерсия.НаименованиеВерсии = НСтр("ru = 'Текущая версия'");
	ТекущаяВерсия.Текущая = Истина;
	Если Не ВосстанавливаемаяВерсия = Неопределено Тогда
		ТекущаяВерсия.ВерсияОснование = ВосстанавливаемаяВерсия;
		ТекущаяВерсия.ДополнительныеСвойства.Вставить("ЭтоВосстановлениеВерсии", Истина);
	КонецЕсли;
		
	ЗаписатьВерсию(ТекущаяВерсия);
	
	Возврат ТекущаяВерсия.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОчиститьДвиженияВерсииПоРегистрам(Версия, ОбСсылка, Регистр, ПолеПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	табл.Регистратор КАК Ссылка,
	               |	табл.НомерСтроки
	               |ИЗ
	               |	РегистрСведений." + Регистр + " КАК табл
	               |ГДЕ
	               |	табл." + ПолеПоиска + " = &Ссылка
	               |	И табл.Версия = &Версия
	               |	И табл.Регистратор ССЫЛКА Документ.упоВерсияПланаПроекта";
				   
	Запрос.УстановитьПараметр("Ссылка", ОбСсылка);
	Запрос.УстановитьПараметр("Версия", Версия);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	наборЗаписей = РегистрыСведений[Регистр].СоздатьНаборЗаписей();
	
	Данные = Результат.Выгрузить();
	кДанные = Данные.Скопировать();
	кДанные.Свернуть("Ссылка");
	СписокРегистраторов = кДанные.ВыгрузитьКолонку("Ссылка");
	Для Каждого Регистратор Из СписокРегистраторов Цикл
		
		наборЗаписей.Отбор.Регистратор.Установить(Регистратор);	
		наборЗаписей.Прочитать();
		сч = наборЗаписей.Количество() -1;
		Записать = Ложь;
		
		Пока сч >= 0 Цикл
			Отбор = Новый Структура("Ссылка, НомерСтроки", Регистратор, наборЗаписей[сч].НомерСтроки); 
			Строки = Данные.НайтиСтроки(Отбор);
			Если Строки.Количество() > 0  Тогда
				наборЗаписей.Удалить(наборЗаписей[сч]);	
				Записать = Истина;
			КонецЕсли;		
			сч = сч-1;
		КонецЦикла;
		
		Если Записать Тогда
			наборЗаписей.ДополнительныеСвойства.Вставить("упоУдалениеЛишнихДвиженийВерсии", Истина);
			наборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти