#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Список, Отказ, СтандартнаяОбработка); 		
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Проект") Тогда
		Если ТипЗнч(Параметры.Отбор.Проект) = Тип("СправочникСсылка.Проекты") Тогда
			ОтборПроект = Параметры.Отбор.Проект;
		КонецЕсли;	
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ТипРиска") Тогда
		Если ТипЗнч(Параметры.Отбор.ТипРиска) = Тип("ПеречислениеСсылка.упоТипыРисковПроектов") Тогда
			ОтборТипРиска = Параметры.Отбор.ТипРиска;
		КонецЕсли;	
	КонецЕсли;	
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ПроектнаяЗадача") Тогда
		Если ТипЗнч(Параметры.Отбор.ПроектнаяЗадача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			ОтборПроектнаяЗадача = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(Параметры.Отбор.ПроектнаяЗадача);
			Параметры.Отбор.Вставить("ПроектнаяЗадача", ОтборПроектнаяЗадача);
		ИначеЕсли ТипЗнч(Параметры.Отбор.ПроектнаяЗадача) = Тип("СправочникСсылка.Проекты") Тогда
			ОтборПроектнаяЗадача = Параметры.Отбор.ПроектнаяЗадача;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	ОбновитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Список, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Список, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Список, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ИзмененПриоритетРискаПроекта" Тогда
		 Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Список, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Список, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура ОтборРуководительПроектаПриИзменении(Элемент)
	
	ИзменитьЭлементОтбораСписка(Список, "РуководительПроекта", ОтборРуководительПроекта, ЗначениеЗаполнено(ОтборРуководительПроекта));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектПриИзменении(Элемент)
	
	ИзменитьЭлементОтбораСписка(Список, "Проект", ОтборПроект, ЗначениеЗаполнено(ОтборПроект));
	ОбновитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	НовыйМассив = Новый Массив;							
	НовыйМассив.Добавить(Новый ПараметрВыбора("ЭтоПроектнаяЗадача", Ложь));	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);	
	
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипРискаПриИзменении(Элемент)
	
	ИзменитьЭлементОтбораСписка(Список, "ТипРиска", ОтборТипРиска, ЗначениеЗаполнено(ОтборТипРиска));
	ОбновитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусРискаПриИзменении(Элемент)
	
	ИзменитьЭлементОтбораСписка(Список, "СтатусРиска", ОтборСтатусРиска, ЗначениеЗаполнено(ОтборСтатусРиска));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПортфельПроектовПриИзменении(Элемент)
	
	ИзменитьЭлементОтбораСписка(Список, "ПортфельПроектов", ОтборПортфельПроектов, ЗначениеЗаполнено(ОтборПортфельПроектов));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПроектаПриИзменении(Элемент)
	
	ИзменитьЭлементОтбораСписка(Список, "СтатусПроекта", ОтборСтатусПроекта, ЗначениеЗаполнено(ОтборСтатусПроекта));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектнаяЗадачаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	НовыйМассив = Новый Массив;							
	НовыйМассив.Добавить(Новый ПараметрВыбора("ЭтоПроектнаяЗадача", Истина));	
	НовыйМассив.Добавить(Новый ПараметрВыбора("КорневойПроект", ОтборПроект));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);	
	
	Элемент.ПараметрыВыбора = НовыеПараметры;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПроектнаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.упоВыборПроектнойЗадачи.Форма.ОсновнаяФормаУправляемая",
		Новый Структура("Проект, ТекЗадача, ВыбиратьТолькоЭтапы, ВозвращатьСсылкуНаЗеркальныйПроект",
			ОтборПроект, ОтборПроектнаяЗадача, Ложь, Истина), Элемент);

КонецПроцедуры
		
&НаКлиенте
Процедура ОтборПроектнаяЗадачаПриИзменении(Элемент)
	ИзменитьЭлементОтбораСписка(Список, "ПроектнаяЗадача", ОтборПроектнаяЗадача, ЗначениеЗаполнено(ОтборПроектнаяЗадача));
	ОбновитьЗаголовокФормы(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьЗаголовокФормы(ЭтаФорма) 
	
	ПолеТипРиска = Новый ПолеКомпоновкиДанных("ТипРиска");
	ПолеПроект = Новый ПолеКомпоновкиДанных("Проект");
	
	ОтборПоРиску = Неопределено;
	ОтборПоПроекту = Неопределено;
	
	Для Каждого ЭлементОтбора Из ЭтаФорма.Список.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
			Продолжить; 
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеТипРиска И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = 
			Тип("ПеречислениеСсылка.упоТипыРисковПроектов") Тогда
			
			ОтборПоРиску = ЭлементОтбора.ПравоеЗначение;
			
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеПроект 
			И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
			
			ОтборПоПроекту = ЭлементОтбора.ПравоеЗначение;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Заголовок = "";
		
	Если ОтборПоРиску = ПредопределенноеЗначение("Перечисление.упоТипыРисковПроектов.Возможность") Тогда
		Заголовок = НСтр("ru = 'Возможности проектов'");
	ИначеЕсли ОтборПоРиску = ПредопределенноеЗначение("Перечисление.упоТипыРисковПроектов.Угроза") Тогда
		Заголовок = НСтр("ru = 'Угрозы проектов'");
	ИначеЕсли Не ЗначениеЗаполнено(ОтборПоРиску) Тогда
		Заголовок = НСтр("ru = 'Риски проектов'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПоПроекту) Тогда
		Заголовок = Заголовок + ": " + ОтборПоПроекту;
	КонецЕсли;
	
	ЭтаФорма.Заголовок = Заголовок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Удаляет элемент отбора динамического списка
//
// Параметры:
//	Список  - ДинамическийСписок - обрабатываемый динамический список.
//	ИмяПоля - Строка - имя поля компоновки, отбор по которому нужно удалить.
//
&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Счетчик = 1;
	Пока Счетчик <= Список.Отбор.Элементы.Количество() Цикл
		ЭлементОтбора = Список.Отбор.Элементы[Счетчик - 1];
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;	
	КонецЦикла; 
	
КонецПроцедуры

// Устанавливает элемент отбор динамического списка
//
// Параметры:
//	Список			- ДинамическийСписок - обрабатываемый динамический список.
//	ИмяПоля			- Строка - имя поля компоновки, отбор по которому нужно установить.
//	ВидСравнения	- ВидСравненияКомпоновкиДанных - вид сравнения отбора, по умолчанию - Равно.
//	ПравоеЗначение 	- Произвольный - значение отбора.
//
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

// Изменяет элемент отбора динамического списка.
//
// Параметры:
//	Список			- ДинамическийСписок - обрабатываемый динамический список.
//	ИмяПоля			- Строка - имя поля компоновки, отбор по которому нужно установить.
//	ПравоеЗначение 	- Произвольный - значение отбора.
//	Установить      - Булево - признак необходимости установить отбор.
//	ВидСравнения	- ВидСравненияКомпоновкиДанных - вид сравнения отбора, по умолчанию - Равно.
//	ОтборПоПериоду  - Булево - признак необходимости установить отбор по периоду.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь,
	ВидСравнения = Неопределено, ОтборПоПериоду = Ложь)
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		Если ОтборПоПериоду Тогда
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
			УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);		
		Иначе
		    УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4, П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти
