
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, НаборКонстант, Отказ, СтандартнаяОбработка);
	
	ПроверкаДоступностиВалютыУчета();
	ЗаполнитьРеквизитыФормы();
	
	// Обновление состояния элементов.
	УстановитьДоступностьВидимостьЭлементовФормы();
	УстановитьОграниченияВидимостиЭлементов();
	
	ЗаполнитьМассивРеквизитовТребующихОбновленияИнтрефейса();
	
	// Функциональность УПФ
	упоИнтеграция.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, НаборКонстант);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, НаборКонстант, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													НаборКонстант, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, НаборКонстант);
	
	ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Если ИмяСобытия = "Запись_НаборКонстант" 
		 И Источник = "ВалютаУчета" Тогда
		 	НаборКонстант.ВалютаУправленческогоУчета = ПолучитьЗначениеКонстанты("ВалютаУправленческогоУчета");
		КонецЕсли;
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, НаборКонстант, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, НаборКонстант, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, НаборКонстант, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, НаборКонстант, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, НаборКонстант, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура упоНастройкаПоказателейПрограммПроектовОчистка(Элемент, СтандартнаяОбработка)
	
	упоПанельПоказателейКлиент.НастройкаПоказателейОчистка(
		ЭтаФорма, 
		Элемент, 
		СтандартнаяОбработка,  
		"упоНастройкаПоказателейПрограммПроектовНастройка", 
		"упоНастройкаПоказателейПрограммПроектов");
	ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура упоНастройкаПоказателейПрограммПроектовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоПанельПоказателейКлиент.НастройкаПоказателейОбработкаВыбора(
		ЭтаФорма, 
		ВыбранноеЗначение,
		"упоНастройкаПоказателейПрограммПроектовНастройка",
		"упоНастройкаПоказателейПрограммПроектов");
		
	ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура упоНастройкаПоказателейПрограммПроектовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	упоПанельПоказателейКлиент.НастройкаПоказателейНачалоВыбора(
		ЭтаФорма, 
		Элемент, 
		ДанныеВыбора, 
		СтандартнаяОбработка, 
		Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьВариантыОтчетов(Команда)
	ОбновитьВариантыОтчетовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьАдресБазыПоТекущемуСоединению(Команда)
	НаборКонстант.упоАдресБазыДляНавигационныхСсылок = ПолучитьНавигационнуюСсылкуИнформационнойБазы()+"#";
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьСтатью(Команда)
	ОткрытьФорму("РегистрСведений.упоСтатьиФОТ.ФормаЗаписи", ,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьСтатью(Команда)
	ТекущаяСтрока = Элементы.СтатьиФОТ.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		УдалитьСтатьюФОТ(ТекущаяСтрока);			
		Элементы.СтатьиФОТ.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИдентификаторыМетаданных(Команда)
	
	ЕстьИзменения = Ложь;
	ЕстьУдаленные = Ложь;
	
	ОбновитьДанныеСправочникаНаСервере(ЕстьИзменения, ЕстьУдаленные);
	
	Если ЕстьИзменения Тогда
		Текст = НСтр("ru = 'Обновление выполнено успешно.'");
	Иначе
		Текст = НСтр("ru = 'Обновление не требуется.'");
	КонецЕсли;
	
	Если ЕстьУдаленные Тогда
		Текст = Текст
		+ Символы.ПС
		+ Символы.ПС
		+ НСтр("ru = 'Найдены удаленные объекты метаданных
		|(см. элементы, начинающиеся с символа ""?"").'");
	КонецЕсли;
	
	ПоказатьПредупреждение(,Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьСтатьюПрямыхРасходов(Команда)
	ОткрытьФорму("РегистрСведений.упоСтатьиПрямыхРасходов.ФормаЗаписи", ,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьСтатьюПрямыхРасходов(Команда)
	ТекущаяСтрока = Элементы.СтатьиПрямыхРасходов.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		УдалитьСтатьюПрямыхРасходов(ТекущаяСтрока);			
		Элементы.СтатьиПрямыхРасходов.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьПодсказуАдресаБазы(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакета", "АдресСервераПодсказка");
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Адрес базы'"));
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаИнформации", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвязиПроектовСНаправлениямиДеятельности(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда				
		ТекстВопроса = НСтр("ru='Будут записаны изменения в настройках и выполнено обновление связей проектов с направлениями деятельности. Продолжить?'");
		ЗаписатьДанные = Истина;
	Иначе			
		ТекстВопроса = НСтр("ru='Будет выполнено обновление связей проектов с направлениями деятельности. Продолжить?'");				
		ЗаписатьДанные = Ложь;
	КонецЕсли;	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСвязиПроектовСНаправлениямиДеятельностиЗавершение", ЭтотОбъект, ЗаписатьДанные);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);			
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвязиПроектовСНаправлениямиДеятельностиЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры Тогда 
		ЭтаФорма.Записать();
	КонецЕсли;
	
	ВыполнитьЗапускОбновленияСвязейПроектов();
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуНастройкиЗаполненияНаправленияДеятельности(Команда)
	
	ОткрытьФорму("Константа.упоСвязьПроектовСНД_НастройкаАвтозаполнения.ФормаКонстант", , 
	ЭтаФорма, ЭтаФорма.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСССП(Команда)
	ОткрытьФорму("РегистрСведений.упоСССПИсключаемыеИзФОТ.ФормаЗаписи", ,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьСССП(Команда)
	ТекущаяСтрока = Элементы.упоСССПИсключаемыеИзФОТ.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		УдалитьСССП(ТекущаяСтрока);			
		Элементы.упоСССПИсключаемыеИзФОТ.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаАвтоматическиеОграниченияДоступаПоПроектам(Команда)
	ОткрытьФорму("Справочник.упоОграниченияДоступаПоПроектам.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчередьПересчетаОграниченийДоступаПоПроектам(Команда)
	
	ОткрытьОчередьОтложеннойОбработки("упоОчередьПересчетаОграниченийДоступаПоПроектам");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьРасписаниеРегламентногоЗаданияПересчетаОграниченийПоПроектам(Команда)
	
	ОткрытьРасписаниеПредопределенногоЗадания("упоПересчетОграниченийДоступаПоПроектам");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасписаниеРасчетаСроков(Команда)
	
	ОткрытьРасписаниеПредопределенногоЗадания("упоРасчетСроковПроектов");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасписаниеОтложенногоОтраженияТрудозатрат(Команда)
	
	ОткрытьРасписаниеПредопределенногоЗадания("упоОтражениеПлановыхТрудозатратЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчередьОтложенногоОтраженияТрудозатрат(Команда)
	
	ОткрытьОчередьОтложеннойОбработки("упоОчередьОтраженияПлановыхТрудозатратЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчередьРасчетаСроков(Команда)
	
	ОткрытьОчередьОтложеннойОбработки("упоОчередьРасчетаСроковПроектов");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасписаниеСинхронизацииПоручений(Команда)
	
	ОткрытьРасписаниеПредопределенногоЗадания("упоСинхронизацияПорученийЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчередьСинхронизацииПоручений(Команда)
	
	ОткрытьОчередьОтложеннойОбработки("упоОчередьСинхронизацииПорученийЗадач");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВключитьФоновыйПересчетСроковВСтруктуре(Команда)
	
	упоСтруктураПроектаВызовСервера.ВключитьДляВсехФоновыйПересчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыключитьФоновыйПересчетСроковВСтруктуре(Команда)
	
	упоСтруктураПроектаВызовСервера.ВыключитьДляВсехФоновыйПересчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьДокументыИзОчередиКОтражениюВБюджетировании(Команда)
	УдалитьДокументыИзОчередиКОтражениюВБюджетированииСервер();	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыИзОчередиКОтражениюВБюджетированииСервер()
	упоПроектноеБюджетированиеСервер.ПроверитьДокументыПериодаИспользованияКонтураОтражения();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЗаполнениеПроцентовЗатрат(Команда)

	ОткрытьФорму("Обработка.упоЗаполнениеПроцентовЗатрат.Форма.Форма");

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьПравилаПБДляСогласования(Команда)
	ОбновитьПредопределенныеПравилаПолученияФактаСогласованиеТрудозатрат();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
	П5, П5, П6);
	
КонецФункции

#КонецОбласти

#Область Инициализация

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()
	
	ВариантРасчетаСтоимостиТрудозатрат = ?(ПолучитьЗначениеКонстанты("упоИспользоватьСтавкуТрудовогоРесурсаПриРасчетеСтоимостиТрудозатрат"), 1, 0);
	ВариантРаспределенияПоЗаданиямИПроектнымЗадачам = Перечисления.упоВариантыРаспределенияРабочегоВремени.ПоЗаданиямИПроектнымЗадачам;
	
	упоНастройкаПоказателейДляКарточкиПроектовНастройка = Константы.упоНастройкаПоказателейДляКарточкиПроектов.Получить().Получить();
	упоПанельПоказателейКлиентСервер.СформироватьПредставлениеДляНастройкиПоказателейКарточекПроектов(ЭтаФорма);
	
	упоНастройкаПоказателейПрограммПроектовНастройка = Константы.упоНастройкаПоказателейПрограммПроектов.Получить().Получить();
	упоПанельПоказателейКлиентСервер.СформироватьПредставлениеНастройкиПоказателей(
		ЭтаФорма,
		"упоНастройкаПоказателейПрограммПроектовНастройка",
		"упоНастройкаПоказателейПрограммПроектов");
	
	СсылкаНаГруппу = ПолучитьНавигационнуюСсылку(ПредопределенноеЗначение("Справочник.ГруппыДоступа.упоИспользованиеЗащищенногоФункционала"));
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Элементы.НадписьИспользованиеЗащищенногоФункционала.Заголовок);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Использование защищенного функционала", , , , СсылкаНаГруппу));
	
	Элементы.НадписьИспользованиеЗащищенногоФункционала.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияВидимостиЭлементов()
	
	ЭлементыСОграниченнымДоступомПРОФ = Новый Структура;
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("ИспользоватьПодсистемуДоговоров", "СтраницаУправлениеДоговорами");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьРасчетЦеныКонтракта", "СтраницаУправлениеДоговорами");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьПодсистемуУправленияРисками", "СтраницаУправлениеРисками");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоУправлятьПрограммамиПроектов", "СтраницаУправлениеПрограммами");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьНормированиеИПроектныеРешения", 
		"СтраницаНормированиеИПроектныеРешения");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьФазыПроектов", "СтраницаФазыПроектов");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьЗаявкиНаПроекты", "СтраницаЗаявкиНаПроекты");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьПричиныОтклонений", "СтраницаСтутсОтчетыПричиныОтклонений");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьСтатусОтчетыПоПроектам", "СтраницаСтутсОтчетыПричиныОтклонений");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьПроектнуюПродукцию", "СтраницаПроектнаяПродукция");
	ЭлементыСОграниченнымДоступомПРОФ.Вставить("упоИспользоватьПодсистемуСогласованиеТрудозатрат", 
		"СтраницаСогласованиеТрудозатрат");
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		
		// В PM ПРОФ показываем кнопку доступности функционала в PM КОРП;
		// В УНФ+PM скрываем функционал, т.к. апгрейда на PM КОРП нет.
		ЭтоУПФ = упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
		ВидимостьЭлемента = Не ЭтоУПФ; 
		
		Для Каждого КлючЗначение Из ЭлементыСОграниченнымДоступомПРОФ Цикл
			ОграничитьДоступКПодсистеме(Элементы[КлючЗначение.Значение], 
				Элементы[КлючЗначение.Ключ], ВидимостьЭлемента);
		КонецЦикла;
		
		Элементы.упоНастройкаДереваКлючевыхПоказателей.Видимость = ВидимостьЭлемента;
	Иначе
		
		Для Каждого КлючЗначение Из ЭлементыСОграниченнымДоступомПРОФ Цикл
			Элементы[КлючЗначение.Ключ].ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		КонецЦикла;
		
	КонецЕсли;

	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ОграничитьДоступКПодсистеме(Элементы.ГруппаРаспределениеЗП,
			Элементы.КомандаОткрытьФормуНастроекРаспределенияЗП, Ложь);
		
		Элементы.НадписьНастройкиЗаполненияНД.Видимость = Ложь;
		Элементы.ГруппаРазделУчетФакта.Видимость = Ложь; 
		
	КонецЕсли;
	
	Элементы.СтраницаПроектноеБюджетирование.Видимость = 
		упоИнтеграцияКлиентСервер.ФункционалПроектногоБюджетированияДоступен();
		
	Элементы.ГруппаНастройкиПрогнозаТрудозатрат.Видимость = 
		упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозТрудозатратПоРолям();
		
	УстановитьВидимостьУстаревшихОпций();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьУстаревшихОпций()
	
	// Устаревшие опции скрыты из интерфейса, если не были использованы.
	
	Элементы.упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДеньГруппа.Видимость = 
		НаборКонстант.упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДень;
		
	Если ВариантРасчетаСтоимостиТрудозатрат Тогда
		Элементы.ГруппаВариантРасчетаСтоимостиТрудозатрат.Видимость = Ложь;
	Иначе
		Элементы.ГруппаВариантРасчетаСтоимостиТрудозатратПредупреждение.Видимость = Ложь; // Служебная информация.
	КонецЕсли;
	
	СкрытьМетодОперативногоПланирования();
	
	Элементы.ГруппаНастройкиОтображенияДоходовРасходовВПЗ.Видимость = 
		Не НаборКонстант.упоПоказыватьНаЗакладкахПланДоходовПланРасходовДДСДанныеОтраженияСДругихЗакладок;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОграничитьДоступКПодсистеме(Группа, Элемент, ВидимостьГруппы)
	
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	
	Группа.Видимость = ВидимостьГруппы;
	Если ВидимостьГруппы Тогда
		Для Каждого ПодчиненныйЭлемент Из Группа.ПодчиненныеЭлементы Цикл
			ПодчиненныйЭлемент.Доступность = Ложь;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивРеквизитовТребующихОбновленияИнтрефейса()
	
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьРасчетЦеныКонтракта");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьФазыПроектов");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьПодсистемуДоговоров");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьПодсистемуУправленияРисками");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоУправлятьПрограммамиПроектов");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьНормированиеИПроектныеРешения");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоПроводитьОценкуИсполнителейПодрядчиков");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьЗагрузкуИзСметы");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьОповещения");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьЗаявкиНаПроекты");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьСтатусОтчетыПоПроектам");
	СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДень");
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьПодсистемуСогласованиеТрудозатрат");
	КонецЕсли;
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		СписокРеквизитовТребующихОбновленияИнтерфейса.Добавить("упоИспользоватьПроектнуюПродукцию");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТребуетсяОбновитьИнтерфейс(ПутьКДаннымЭлемента)
	
	Возврат СписокРеквизитовТребующихОбновленияИнтерфейса.НайтиПоЗначению(ПутьКДаннымЭлемента) <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции

&НаКлиенте
Процедура ПриИзмененииРеквизита(Элемент)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	ОбновлятьИнтерфейс = ТребуетсяОбновитьИнтерфейс(КонстантаИмя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Если КонстантаИмя = "ВалютаУправленческогоУчета" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	УстановитьДоступностьВидимостьЭлементовФормы(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);	
	КонецЕсли; 
	
	// Сохранения значения константы.
	УстановитьЗначениеКонстанты(КонстантаИмя);
	
	Если РеквизитПутьКДанным = "упоНастройкаПоказателейДляКарточкиПроектов" Тогда 
		
		ХранилищеНастройки = Новый ХранилищеЗначения(упоНастройкаПоказателейДляКарточкиПроектовНастройка);
		Константы.упоНастройкаПоказателейДляКарточкиПроектов.Установить(ХранилищеНастройки);
		
	ИначеЕсли РеквизитПутьКДанным = "упоНастройкаПоказателейПрограммПроектов" Тогда 
		
		ХранилищеНастройки = Новый ХранилищеЗначения(упоНастройкаПоказателейПрограммПроектовНастройка);
		Константы.упоНастройкаПоказателейПрограммПроектов.Установить(ХранилищеНастройки);
		
	ИначеЕсли РеквизитПутьКДанным = "ВариантРасчетаСтоимостиТрудозатрат" Тогда
		
		Константы.упоИспользоватьСтавкуТрудовогоРесурсаПриРасчетеСтоимостиТрудозатрат.Установить(ВариантРасчетаСтоимостиТрудозатрат);
		
	КонецЕсли;
	
	Если КонстантаИмя = "ВалютаУправленческогоУчета" Тогда
		
		ПараметрыСеанса.упоВалютаУправленческогоУчета = НаборКонстант.ВалютаУправленческогоУчета;
		
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
			Константы["ВалютаУчета"].Установить(НаборКонстант.ВалютаУправленческогоУчета);
		КонецЕсли;
		
	КонецЕсли;
	
	ИзменитьЗависимыеРеквизиты(КонстантаИмя);
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначениеКонстанты(КонстантаИмя)
	
	Если КонстантаИмя <> "" Тогда 
		
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаИмя = "упоПоказательСложности" 
			И Не Документы.упоЗакрытиеЭтапа.ПоказательСложностьЗаполненПравильно(КонстантаЗначение) Тогда
			НаборКонстант[КонстантаИмя] = КонстантаМенеджер.Получить();
		КонецЕсли;
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗависимыеРеквизиты(РеквизитПутьКДанным)
	
	Если РеквизитПутьКДанным = "" Тогда	
		Возврат;	
	КонецЕсли; 
	
	Если РеквизитПутьКДанным = "упоВедетсяБюджетДоходов" Тогда
		
		Если НаборКонстант.упоВедетсяБюджетДоходов = Ложь Тогда
			
			НаборКонстант.упоДоходыПоПодразделениям = Ложь;	
			НаборКонстант.упоДоходыПоОбъемам = Ложь;
			НаборКонстант.упоДоходыПоНатуральнымПоказателям = Ложь;
			
			УстановитьЗначениеКонстанты("упоДоходыПоПодразделениям");
			УстановитьЗначениеКонстанты("упоДоходыПоОбъемам");
			УстановитьЗначениеКонстанты("упоДоходыПоНатуральнымПоказателям");
			
		КонецЕсли;	
		
	ИначеЕсли РеквизитПутьКДанным = "упоДоходыПоПодразделениям" Тогда
		
		Если НаборКонстант.упоДоходыПоПодразделениям = Ложь Тогда
			
			НаборКонстант.упоДоходыПоОбъемам = Ложь;
			НаборКонстант.упоДоходыПоНатуральнымПоказателям = Ложь;
			
			УстановитьЗначениеКонстанты("упоДоходыПоОбъемам");
			УстановитьЗначениеКонстанты("упоДоходыПоНатуральнымПоказателям");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоДоходыПоОбъемам" Тогда
		
		Если НаборКонстант.упоДоходыПоОбъемам = Ложь Тогда
			
			НаборКонстант.упоДоходыПоНатуральнымПоказателям = Ложь;
			
			УстановитьЗначениеКонстанты("упоДоходыПоНатуральнымПоказателям");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоВедетсяБюджетРасходов" Тогда
		
		Если НаборКонстант.упоВедетсяБюджетРасходов = Ложь Тогда
			
			НаборКонстант.упоРасходыПоПодразделениям = Ложь;
			НаборКонстант.упоРасходыПоОбъемам = Ложь;
			НаборКонстант.упоРасходыПоНатуральнымПоказателям = Ложь;
			
			УстановитьЗначениеКонстанты("упоРасходыПоПодразделениям");
			УстановитьЗначениеКонстанты("упоРасходыПоОбъемам");
			УстановитьЗначениеКонстанты("упоРасходыПоНатуральнымПоказателям");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоРасходыПоПодразделениям" Тогда
		
		Если НаборКонстант.упоРасходыПоПодразделениям = Ложь Тогда
			
			НаборКонстант.упоРасходыПоОбъемам = Ложь;
			НаборКонстант.упоРасходыПоНатуральнымПоказателям = Ложь;
			
			УстановитьЗначениеКонстанты("упоРасходыПоОбъемам");
			УстановитьЗначениеКонстанты("упоРасходыПоНатуральнымПоказателям");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоРасходыПоОбъемам" Тогда
		
		Если НаборКонстант.упоРасходыПоОбъемам = Ложь Тогда
			
			НаборКонстант.упоРасходыПоНатуральнымПоказателям = Ложь;
			
			УстановитьЗначениеКонстанты("упоРасходыПоНатуральнымПоказателям");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоРасходыПоНатуральнымПоказателям" Тогда
		
		Если НаборКонстант.упоРасходыПоНатуральнымПоказателям = Истина Тогда
			
			НаборКонстант.упоПланироватьЗатратыНаМатериалы = Истина;
			
			УстановитьЗначениеКонстанты("упоПланироватьЗатратыНаМатериалы");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоОтражатьФактДоходовПервичнымиДокументами" Тогда
		
		Если НаборКонстант.упоОтражатьФактДоходовПервичнымиДокументами = Ложь Тогда
			
			НаборКонстант.упоВключатьНДСВФактДоходовПервичныхДокументов = Ложь;
			УстановитьЗначениеКонстанты("упоВключатьНДСВФактДоходовПервичныхДокументов");
			
		КонецЕсли;	
		
	ИначеЕсли РеквизитПутьКДанным = "упоОтражатьФактРасходовПервичнымиДокументами" Тогда
		
		Если НаборКонстант.упоОтражатьФактРасходовПервичнымиДокументами = Ложь Тогда
			
			НаборКонстант.упоВключатьНДСВФактРасходовПервичныхДокументов = Ложь;
			НаборКонстант.упоОтражатьФактРасходаПриПриобретенииТоваров = Ложь;
			
			УстановитьЗначениеКонстанты("упоВключатьНДСВФактРасходовПервичныхДокументов");
			УстановитьЗначениеКонстанты("упоОтражатьФактРасходаПриПриобретенииТоваров");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоУчитыватьТрудозатратыПриРасчетеПроцентаГотовности" Тогда
		
		Если НаборКонстант.упоУчитыватьТрудозатратыПриРасчетеПроцентаГотовности Тогда
			
			НаборКонстант.упоИспДлитВместоПустТрудЗатДляРасчГотовности = Истина;
			
			УстановитьЗначениеКонстанты("упоИспДлитВместоПустТрудЗатДляРасчГотовности");
			
		КонецЕсли;
		
	ИначеЕсли РеквизитПутьКДанным = "упоНазначатьРСПОсновнойРолиКакРПЗ" Тогда
		
		Если НаборКонстант.упоНазначатьРСПОсновнойРолиКакРПЗ = Ложь 
			И НаборКонстант.упоУстанавливатьПризнакОсновнаяПриДобавленииРоли = Истина Тогда
			
			НаборКонстант.упоУстанавливатьПризнакОсновнаяПриДобавленииРоли = Ложь;
			
			УстановитьЗначениеКонстанты("упоУстанавливатьПризнакОсновнаяПриДобавленииРоли");
			
		КонецЕсли;	
	ИначеЕсли РеквизитПутьКДанным = "упоПланироватьТрудозатратыПоПроекту" Тогда
		
		Если НаборКонстант.упоПланироватьТрудозатратыПоПроекту = Ложь 
			И НаборКонстант.упоУказыватьПодразделениеРолиПриПланированииТР = Истина Тогда
			
			НаборКонстант.упоУказыватьПодразделениеРолиПриПланированииТР = Ложь;
			
			УстановитьЗначениеКонстанты("упоУказыватьПодразделениеРолиПриПланированииТР");
			
		КонецЕсли;	
		
	ИначеЕсли РеквизитПутьКДанным = "упоИспользоватьПодсистемуСогласованиеТрудозатрат" Тогда
		
		Если НаборКонстант.упоИспользоватьПодсистемуСогласованиеТрудозатрат
			И Не ЗначениеЗаполнено(НаборКонстант.упоПериодСогласованияТрудозатрат) Тогда
			
			НаборКонстант.упоПериодСогласованияТрудозатрат = Перечисления.упоПериодыСогласованияТрудозатрат.Месяц;
			УстановитьЗначениеКонстанты("упоПериодСогласованияТрудозатрат");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПроверкаДоступностиВалютыУчета()
	
	стрЗаголовка = "";
	ЕстьДокументы = Ложь;
	
	Если Не ПравоДоступа("Изменение", Метаданные.Константы.ВалютаУправленческогоУчета) Тогда
		
		// Если нет прав на изменение хотя бы одной константы - закрываем доступ на все.
		стрЗаголовка = НСтр("ru = ' Нет прав на изменение хоть одной константы валют.'");
		ЕстьДокументы = Истина;
		
	Иначе	
		
		Запрос = Новый Запрос;
		СчетчикДокументов = 0;
		Для каждого Док Из Метаданные.Документы Цикл
			Запрос.Текст = Запрос.Текст
			+ ?(Запрос.Текст = "",
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1", 
			" 
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1 ") + "
			|
			|	Документ" + Док.Имя + ".Ссылка
			|ИЗ
			|	Документ." + Док.Имя + " КАК " + "Документ" + Док.Имя + "
			|";
			
			СчетчикДокументов = СчетчикДокументов + 1;
			
			Если СчетчикДокументов > 3 Тогда
				СчетчикДокументов = 0;
				Попытка
					РезультатЗапроса = Запрос.Выполнить();
					ЕстьДокументы = НЕ РезультатЗапроса.Пустой();
				Исключение
					ЕстьДокументы = Истина;
				КонецПопытки;
				
				Если ЕстьДокументы Тогда
					Прервать;
				КонецЕсли; 
				Запрос.Текст = "";
			КонецЕсли;
		КонецЦикла;
		
		Если СчетчикДокументов > 0 Тогда
			Попытка
				РезультатЗапроса = Запрос.Выполнить();
				ЕстьДокументы = НЕ РезультатЗапроса.Пустой();
			Исключение
				ЕстьДокументы = Истина;
			КонецПопытки;
		КонецЕсли; 
		
	КонецЕсли;
	
	Элементы.ВалютаУправленческогоУчета.ТолькоПросмотр = ЕстьДокументы;
	
	Если ПустаяСтрока(стрЗаголовка) Тогда
		Если ЕстьДокументы Тогда
			Элементы.ТекстВажнойНадписи.Заголовок = НСтр("ru = ' После ввода документов валюты учета изменять нельзя.'");
		Иначе
			Элементы.ТекстВажнойНадписи.Заголовок = НСтр("ru = ' Валюты учета можно изменять пока не введены документы.'");
		КонецЕсли;
	Иначе
		Элементы.ТекстВажнойНадписи.Заголовок = стрЗаголовка;
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты)
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьСтатьюФОТ(КлючЗаписи) 
	Запись = РегистрыСведений.упоСтатьиФОТ.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись,КлючЗаписи);
	Запись.Удалить();
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьСтатьюПрямыхРасходов(КлючЗаписи) 
	Запись = РегистрыСведений.упоСтатьиПрямыхРасходов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись,КлючЗаписи);
	Запись.Удалить();
КонецФункции

&НаСервереБезКонтекста
Функция УдалитьСССП(КлючЗаписи) 
	Запись = РегистрыСведений.упоСССПИсключаемыеИзФОТ.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись,КлючЗаписи);
	Запись.Удалить();
КонецФункции

&НаСервере
Процедура ОбновитьВариантыОтчетовНаСервере()
	
	ПараметрыОбновления = Новый Структура;	
	ПараметрыОбновления.Вставить("РазделенныеОбработчики", Неопределено);
	ВариантыОтчетов.ОперативноеОбновлениеОбщихДанныхКонфигурации(ПараметрыОбновления);
	ВариантыОтчетов.ОперативноеОбновлениеРазделенныхДанныхКонфигурации();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСправочникаНаСервере(ЕстьИзменения, ЕстьУдаленные)
	
	УстановитьПривилегированныйРежим(Истина);
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(ЕстьИзменения, ЕстьУдаленные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста	
Процедура ДоступностьАналитикаВРазрезеПодразделений(Форма)
	
	Форма.Элементы.упоДоходыПоПодразделениям.Доступность = Форма.НаборКонстант.упоВедетсяБюджетДоходов;
	Форма.Элементы.упоДоходыПоОбъемам.Доступность = Форма.НаборКонстант.упоДоходыПоПодразделениям;
	Форма.Элементы.упоДоходыПоНатуральнымПоказателям.Доступность = 
		(Форма.НаборКонстант.упоДоходыПоПодразделениям И Форма.НаборКонстант.упоДоходыПоОбъемам);
	
	Форма.Элементы.упоРасходыПоПодразделениям.Доступность = Форма.НаборКонстант.упоВедетсяБюджетРасходов;
	Форма.Элементы.упоРасходыПоОбъемам.Доступность = Форма.НаборКонстант.упоРасходыПоПодразделениям;
	Форма.Элементы.упоРасходыПоНатуральнымПоказателям.Доступность = 
		(Форма.НаборКонстант.упоРасходыПоПодразделениям И Форма.НаборКонстант.упоРасходыПоОбъемам);
		
	Форма.Элементы.упоПланироватьЗатратыНаМатериалы.Доступность = Не Форма.НаборКонстант.упоРасходыПоНатуральнымПоказателям;	
			
	Форма.Элементы.упоНастройкаРаспределенияБДР.Доступность = 
		Форма.НаборКонстант.упоДоходыПоПодразделениям Или Форма.НаборКонстант.упоРасходыПоПодразделениям;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступностьВидимостьЭлементовФормы(РеквизитПутьКДанным = "")
	
	ДоступностьАналитикаВРазрезеПодразделений(ЭтаФорма);
	
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоПроводитьОценкуИсполнителейПодрядчиков" Тогда
		Элементы.ГруппаНастройкиОценок.Доступность = НаборКонстант.упоПроводитьОценкуИсполнителейПодрядчиков;
	КонецЕсли;
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании" Тогда
		Элементы.ГруппаПараметрыЭкономики.Доступность = 
			НаборКонстант.упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании;
	КонецЕсли;
	
	//
	ДоступноОтражениеФакта = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
	
	Элементы.упоВключатьНДСВФактДоходовПервичныхДокументов.Доступность = 
		ДоступноОтражениеФакта И НаборКонстант["упоОтражатьФактДоходовПервичнымиДокументами"];
	Элементы.упоВключатьНДСВФактРасходовПервичныхДокументов.Доступность = 
		ДоступноОтражениеФакта И НаборКонстант["упоОтражатьФактРасходовПервичнымиДокументами"];
	Элементы.упоОтражатьФактРасходаПриПриобретенииТоваров.Доступность = 
		ДоступноОтражениеФакта И НаборКонстант["упоОтражатьФактРасходовПервичнымиДокументами"];
	Элементы.упоСтатьяРасходовПриПриобретенииТоваров.Доступность = 
		ДоступноОтражениеФакта И НаборКонстант["упоОтражатьФактРасходаПриПриобретенииТоваров"];
	
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоВариантРаспределенияРабочегоВремени" Тогда
		ВариантРаспределенияРабочегоВремени = НаборКонстант.упоВариантРаспределенияРабочегоВремени;
		
		УстановитьДоступностьКонстантыПравилоЗаполненияПоручениямиИПроектнымиЗадачами(ЭтаФорма,
		ВариантРаспределенияРабочегоВремени, ВариантРаспределенияПоЗаданиямИПроектнымЗадачам);
		
		Если ВариантРаспределенияРабочегоВремени = ВариантРаспределенияПоЗаданиямИПроектнымЗадачам 
			И Не ЗначениеЗаполнено(НаборКонстант.упоПравилоРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи) Тогда
			
			ПравилоЗаполнятьВсе = ПредопределенноеЗначение(
				"Перечисление.упоПравилаРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи.ВсеПроектныеЗадачиИЗадания");
			НаборКонстант.упоПравилоРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи = ПравилоЗаполнятьВсе;
			
		КонецЕсли;
	КонецЕсли;
	
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоИспользоватьСвязьПроектовСНаправлениямиДеятельности" Тогда
		Элементы.ГруппаНастройкиСвязи.Доступность = НаборКонстант.упоИспользоватьСвязьПроектовСНаправлениямиДеятельности;
	КонецЕсли;
	
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоУчитыватьТрудозатратыПриРасчетеПроцентаГотовности" Тогда
		Элементы.упоНастройкаУровняПланированияПриРасчетеГотовностиПроектов.Доступность = 
			НаборКонстант.упоУчитыватьТрудозатратыПриРасчетеПроцентаГотовности;
		Элементы.упоИспДлитВместоПустТрудЗатДляРасчГотовности.Доступность = 
			НаборКонстант.упоУчитыватьТрудозатратыПриРасчетеПроцентаГотовности;
	КонецЕсли;
		
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоПоказательСложности" Тогда
		Элементы.упоПроводитьОценкуИсполнителейПодрядчиков.Доступность = 
			ЗначениеЗаполнено(НаборКонстант.упоПоказательСложности);
	КонецЕсли;
		
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДень" Тогда
		Элементы.упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДень.Доступность = 
			НаборКонстант.упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДень;
	КонецЕсли;
	
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоНазначатьРСПОсновнойРолиКакРПЗ" Тогда
		Элементы.упоУстанавливатьПризнакОсновнаяПриДобавленииРоли.Доступность = 
			НаборКонстант.упоНазначатьРСПОсновнойРолиКакРПЗ;
	КонецЕсли;
		
	//
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоПланироватьТрудозатратыПоПроекту" Тогда
		Элементы.упоУказыватьПодразделениеРолиПриПланированииТР.Доступность = 
			НаборКонстант.упоПланироватьТрудозатратыПоПроекту;
	КонецЕсли;
		
	Если РеквизитПутьКДанным = "" 
		Или РеквизитПутьКДанным = "НаборКонстант.упоИспользоватьПодсистемуСогласованиеТрудозатрат"
		Или РеквизитПутьКДанным = "НаборКонстант.упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании" Тогда
		Элементы.КомандаОбновитьПравилаПБДляСогласования.Видимость = 
			НаборКонстант.упоИспользоватьПодсистемуСогласованиеТрудозатрат 
			И НаборКонстант.упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКонстантыПравилоЗаполненияПоручениямиИПроектнымиЗадачами(Форма, 
	ВариантРаспределения, ВариантРаспределенияПоЗаданиямИПроектнымЗадачам)
	
	ЭлементДоступен = ?(ВариантРаспределения = ВариантРаспределенияПоЗаданиямИПроектнымЗадачам, Истина, Ложь);
	Форма.Элементы.упоПравилоРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи.Доступность = ЭлементДоступен;
	
КонецПроцедуры

&НаКлиенте
Процедура упоНастройкаПоказателейДляКарточкиПроектовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	упоПанельПоказателейКлиент.упоНастройкаПоказателейДляКарточкиПроектовНачалоВыбора(
		ЭтаФорма, 
		Элемент, 
		ДанныеВыбора, 
		СтандартнаяОбработка, 
		Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура упоНастройкаПоказателейДляКарточкиПроектовОчистка(Элемент, СтандартнаяОбработка)
	
	упоПанельПоказателейКлиент.упоНастройкаПоказателейДляКарточкиПроектовОчистка(
		ЭтаФорма, 
		Элемент, 
		СтандартнаяОбработка);
		
	ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура упоНастройкаПоказателейДляКарточкиПроектовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоПанельПоказателейКлиент.упоНастройкаПоказателейДляКарточкиПроектовОбработкаВыбора(
		ЭтаФорма, 
		ВыбранноеЗначение);
		
	ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоФайловаяИнформационнаяБаза()
	
	Возврат ОбщегоНазначения.ИнформационнаяБазаФайловая();	
	
КонецФункции

&НаСервере
Процедура СкрытьМетодОперативногоПланирования()
	
	// Скрываем поле до проработки механики работы с подразделениями.
	Если упоИнтеграцияКлиентСервер.ИспользоватьМетодОперативногоПланированияРесурсовНаПроект() Тогда
		Возврат;
	КонецЕсли;
	
	мМетодОперативногоПланирования = НаборКонстант.упоМетодОперативногоПланированияПоУмолчанию;
	// Если явно не выбрано планирование работ по подразделениям - скрываем настройку.
	СкрытьВидимость = Не ЗначениеЗаполнено(мМетодОперативногоПланирования) 
		Или мМетодОперативногоПланирования = 
			Перечисления.упоМетодОперативногоПланирования.ПрямоеВыделениеРесурсовНаПроект;
	Если СкрытьВидимость Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"упоМетодОперативногоПланированияПоУмолчанию", 
			"Видимость", 
			Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьОчередьПроектовНаРасчетСроков()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	упоОчередьРасчетаСроковПроектов.Проект КАК Проект
		|ИЗ
		|	РегистрСведений.упоОчередьРасчетаСроковПроектов КАК упоОчередьРасчетаСроковПроектов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьПроектыВОчереди = Не РезультатЗапроса.Пустой();
	Если ЕстьПроектыВОчереди Тогда
		НаборЗаписей = РегистрыСведений.упоОчередьРасчетаСроковПроектов.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДлительныеОперации

&НаКлиенте
Процедура ВыполнитьЗапускОбновленияСвязейПроектов()
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	ЭтоФайловаяИнформационнаяБаза = ЭтоФайловаяИнформационнаяБаза();
	
	Если ЭтоФайловаяИнформационнаяБаза Тогда
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания); 
	КонецЕсли;
	
	РезультатВыполнения = ВыполнитьФоновоеОбновлениеСвязейПроектовНаСервере(ЭтоФайловаяИнформационнаяБаза);
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда    
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		ОбработатьРезультатОбновленияСвязей(РезультатВыполнения, ЭтоФайловаяИнформационнаяБаза);
		
	Иначе
		
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания); 
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);	  
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина); 
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ВыполнитьФоновоеОбновлениеСвязейПроектовНаСервере(ЭтоФайловаяИнформационнаяБаза)
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);    
	ИдентификаторЗадания = Неопределено;
	
	СтруктураПараметров = Новый Структура;    
	
	Если ЭтоФайловаяИнформационнаяБаза Тогда
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
		
		упоСвязьПроектаСНаправлениемДеятельности.СинхронизироватьВсеПроектыСНаправлениямиДеятельности();
		
	Иначе
		
		РезультатВыполнения  = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
		"упоСвязьПроектаСНаправлениемДеятельности.СинхронизироватьВсеПроектыСНаправлениямиДеятельностиЗадание", 
		СтруктураПараметров, 
		НСтр("ru = 'Синхронизация проектов с направлениями деятельности'"));    
		
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
		АдресХранилища       = РезультатВыполнения.АдресХранилища;    
		
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 								
			РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
			ОбработатьРезультатОбновленияСвязей(РезультатВыполнения);
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 
			ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
		КонецЕсли;
	Исключение
		ЗакрытьФормуИндикатор();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатОбновленияСвязей(РезультатВыполнения, ЭтоФайловаяИнформационнаяБаза = Ложь)
	
	ЗакрытьФормуИндикатор();
	
	Если ЭтоФайловаяИнформационнаяБаза Тогда
		ТекстСообщения = НСтр("ru = 'Связи проектов установлены.'");
	Иначе 
		ТекстСообщения = НСтр("ru = 'Связи проектов установлены. Обработано элементов: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, РезультатВыполнения.Количество);
	КонецЕсли; 
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуИндикатор()
	
	Если Не ФормаДлительнойОперации = Неопределено
		И ФормаДлительнойОперации.Открыта() 
		И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		
	КонецЕсли;		
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);    
КонецФункции

&НаКлиенте
Функция ОткрытьРасписаниеПредопределенногоЗадания(ИмяЗадания) 
	
	ПараметрыФормы = Новый Структура;
	
	Идентификатор = ПолучитьИдентификаторПредопределенногоЗадания(ИмяЗадания);
	ПараметрыФормы.Вставить("Идентификатор", Идентификатор);
	ПараметрыФормы.Вставить("Действие",      "Изменить");
	
	ФормаЗадания = ПолучитьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыФормы, ЭтотОбъект);	
	//ФормаЗадания.Элементы.Использование.Видимость = Ложь;
	ФормаЗадания.Открыть();
	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторПредопределенногоЗадания(ИмяЗадания) 
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(
	Метаданные.РегламентныеЗадания[ИмяЗадания]);
	Возврат Задание.УникальныйИдентификатор;	
	
КонецФункции     

&НаКлиенте
Функция ОткрытьОчередьОтложеннойОбработки(ИмяОчереди) 
	
	ОткрытьФорму("РегистрСведений." + ИмяОчереди + ".ФормаСписка");
	
КонецФункции

&НаКлиенте
Процедура упоНастройкаУровняПланированияПриРасчетеГотовностиПроектовОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область РаспределениеЗарплатыПоПроектам

&НаКлиенте
Процедура КомандаОткрытьФормуНастроекРаспределенияЗП(Команда)
	
	ОткрытьФорму("Справочник.упоНастройкиРаспределенияЗарплаты.Форма.ФормаНастроек");
	
КонецПроцедуры

#КонецОбласти

#Область ПричиныОтклонений

&НаКлиенте
Процедура КомандаОткрытьСправочникВидыПричинОтклонений(Команда)
	
	ОткрытьФорму("Справочник.упоВидыПричинОтклонений.Форма.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Процедура ОбновитьПредопределенныеПравилаПолученияФактаСогласованиеТрудозатрат()
	
	ИменаПравилОбновления = упоПроектноеБюджетированиеСервер.
		ПравилаПроектногоБюджетированияДляПодсистемыСогласованиеТрудозатрат();
	упоПроектноеБюджетированиеСервер.
		ОбновитьПредопределенныеПравилаПолученияФакта(ИменаПравилОбновления);
	
КонецПроцедуры

#КонецОбласти