
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	 
#Область ПрограммныйИнтерфейс

// Процедура заполняет объект по выбранному основанию
// 
// Параметры:
//	Объект        	- ДокументОбъект.упоРегистрацияФактическиВыполненногоОбъема, ДанныеФормыСтруктура - 
//					  объект, который надо заполнить.
//	Основание    	- Произвольный - Данные, на основании которых нужно заполнить Объект.
//	ЗаполнятьДоходы - Булево - Признак того, что нужно заполнить ТЧ "Доходные объемы".
//	ЗаполнятьРасходы- Булево - Признак того, что нужно заполнить ТЧ "Расходные объемы".
// 
Процедура ЗаполнитьОбъектПоОснованию(Объект, Основание, ЗаполнятьДоходы = Ложь, ЗаполнятьРасходы = Ложь) Экспорт
	
	Если ЗаполнятьДоходы Или ЗаполнятьРасходы Тогда
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоВерсияПланаПроекта") 
		Или ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция() И 
			ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			
			ТипСубпродукта = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(Основание, "ТипСубпродукта");
			Если ТипСубпродукта = Перечисления.упоТипСубпродукта.ПроектнаяПродукция Тогда
				Объект.РегистрацияПроектнойПродукции = Истина;
			КонецЕсли;
			
		КонецЕсли;

		ТаблицаРезультат = ПолучитьТаблицуОснованиеВерсии(Объект, Основание,  ЗаполнятьДоходы, ЗаполнятьРасходы); 
				
	ИначеЕсли Основание = "ВыполненнаяПроектнаяПродукцияНаДату" Тогда
		
		ТаблицаРезультат = ПолучитьТаблицуПоВыполненнойПроектнойПродукцииНаДату(Объект);
		
	Иначе
		
		ТаблицаРезультат = ПолучитьТаблицуОстатковОбъемов(Объект, ЗаполнятьДоходы, ЗаполнятьРасходы);
		
	КонецЕсли;
	
	ТаблицаОбъемы = ТаблицаРезультат.Скопировать();
	ТаблицаОбъемы.Свернуть(
		"ПроектнаяЗадача, Статья, Контрагент, Договор, Валюта, Номенклатура, ЕдиницаИзмерения, ВидОбъема, ДатаПоступления",
		"Сумма, Количество");
	
	Если ЗаполнятьДоходы Тогда
		
		УстановитьПериодРегистрацииПоДатеПоступлений(Объект, ТаблицаОбъемы);
	
		Объект.ДоходныеОбъемы.Очистить();
		Объект.РаспределениеДоходныхОбъемов.Очистить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОбъема", Перечисления.упоВидЭлементаОбъемов.Доход);
		
		ТаблицаДоходы = ТаблицаРезультат.Скопировать(Отбор);
		ТаблицаДоходы.Свернуть(
			"ПроектнаяЗадача, Статья, Контрагент, Договор, Валюта, Номенклатура, ЕдиницаИзмерения, ДатаПоступления",
			"Сумма,Количество");
		
		// Кеширование
		мПроектныеЗадачи = Новый Массив;
		Для Каждого СтрокаО Из ТаблицаДоходы Цикл
			мПроектныеЗадачи.Добавить(СтрокаО.ПроектнаяЗадача);
		КонецЦикла;
		СправочникПроектПоДокументуПЗ = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(мПроектныеЗадачи,, Истина);
		
		Счетчик = 0;
		
		Для Каждого СтрокаО Из  ТаблицаДоходы Цикл
			
			НоваяСтрока = Объект.ДоходныеОбъемы.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаО);
			
			НоваяСтрока.ПроектнаяЗадачаПроект = СправочникПроектПоДокументуПЗ.Получить(НоваяСтрока.ПроектнаяЗадача);
			
			НоваяСтрока.Стоимость = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);
			
			Если СвойстваПроекта.ДоходыПоПодразделениям Тогда
				
				ОтборРаспределения = Новый Структура;
				
				ОтборРаспределения.Вставить("ПроектнаяЗадача", СтрокаО.ПроектнаяЗадача);
				ОтборРаспределения.Вставить("Статья", СтрокаО.Статья);
				ОтборРаспределения.Вставить("Контрагент", СтрокаО.Контрагент);
				ОтборРаспределения.Вставить("Договор", СтрокаО.Договор);
				ОтборРаспределения.Вставить("Валюта", СтрокаО.Валюта);
				ОтборРаспределения.Вставить("Номенклатура", СтрокаО.Номенклатура);
				ОтборРаспределения.Вставить("ЕдиницаИзмерения", СтрокаО.ЕдиницаИзмерения);
				ОтборРаспределения.Вставить("ДатаПоступления", СтрокаО.ДатаПоступления);
				ОтборРаспределения.Вставить("ВидОбъема", Перечисления.упоВидЭлементаОбъемов.Доход);
				
				НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(ОтборРаспределения); 
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					
					НоваяСтрока.ИндексСтрокРаспределения = Неопределено;
					
				Иначе
					
					НоваяСтрока.ИндексСтрокРаспределения = Счетчик;
					
					ЕстьРаспределение = Ложь;
					
					Для Каждого НайденнаяСтрокаРаспределения Из НайденныеСтроки Цикл
						
						Если ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.КонтрагентПодрядчик) 
							+ ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.ЗаказДоговорПодрядчика)
							+ ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.Подразделение)
							+ ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.СобствСилы_Субподряд)
							+ ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.Роль) > 0 Тогда
							
							ЕстьРаспределение = Истина;
							
							НоваяСтрокаРаспределения = Объект.РаспределениеДоходныхОбъемов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, НайденнаяСтрокаРаспределения);
							НоваяСтрокаРаспределения.ИндексСтрокиВладельца = Счетчик;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Счетчик = Счетчик + 1;
					
					Если Не ЕстьРаспределение Тогда
						НоваяСтрока.ИндексСтрокРаспределения = Неопределено;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗаполнятьРасходы Тогда
		
		Объект.РасходныеОбъемы.Очистить();
		Объект.РаспределениеРасходныхОбъемов.Очистить();
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОбъема", Перечисления.упоВидЭлементаОбъемов.Расход);
		
		ТаблицаРасходы = ТаблицаРезультат.Скопировать(Отбор);
		ТаблицаРасходы.Свернуть("ПроектнаяЗадача, Статья, Контрагент, Договор, Валюта, Номенклатура, ЕдиницаИзмерения, ДатаПоступления",
			"Сумма,Количество");
		
		// Кеширование
		мПроектныеЗадачи = Новый Массив;
		Для Каждого СтрокаО Из ТаблицаРасходы Цикл
			мПроектныеЗадачи.Добавить(СтрокаО.ПроектнаяЗадача);
		КонецЦикла;
		СправочникПроектПоДокументуПЗ = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(мПроектныеЗадачи,, Истина);
		
		Счетчик = 0;
		
		Для Каждого СтрокаО Из  ТаблицаРасходы Цикл
			
			НоваяСтрока = Объект.РасходныеОбъемы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаО);
			
			НоваяСтрока.ПроектнаяЗадачаПроект = СправочникПроектПоДокументуПЗ.Получить(НоваяСтрока.ПроектнаяЗадача);
			НоваяСтрока.Стоимость = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);
			
			Если СвойстваПроекта.РасходыПоПодразделениям Тогда
				
				ОтборРаспределения = Новый Структура;
				
				ОтборРаспределения.Вставить("ПроектнаяЗадача", СтрокаО.ПроектнаяЗадача);
				ОтборРаспределения.Вставить("Статья", СтрокаО.Статья);
				ОтборРаспределения.Вставить("Контрагент", СтрокаО.Контрагент);
				ОтборРаспределения.Вставить("Договор", СтрокаО.Договор);
				ОтборРаспределения.Вставить("Валюта", СтрокаО.Валюта);
				ОтборРаспределения.Вставить("Номенклатура", СтрокаО.Номенклатура);
				ОтборРаспределения.Вставить("ЕдиницаИзмерения", СтрокаО.ЕдиницаИзмерения);
				ОтборРаспределения.Вставить("ДатаПоступления", СтрокаО.ДатаПоступления);
				ОтборРаспределения.Вставить("ВидОбъема", Перечисления.упоВидЭлементаОбъемов.Расход);
				
				НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(ОтборРаспределения); 
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					
					НоваяСтрока.ИндексСтрокРаспределения = Неопределено;
					
				Иначе
					
					НоваяСтрока.ИндексСтрокРаспределения = Счетчик;
					
					ЕстьРаспределение = Ложь;
	
					Для Каждого НайденнаяСтрокаРаспределения Из НайденныеСтроки Цикл
						
						Если ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.Подразделение)
							+ ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.СобствСилы_Субподряд)
							+ ЗначениеЗаполнено(НайденнаяСтрокаРаспределения.Роль) > 0 Тогда
							
							ЕстьРаспределение = Истина;

						НоваяСтрокаРаспределения = Объект.РаспределениеРасходныхОбъемов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, НайденнаяСтрокаРаспределения);
						НоваяСтрокаРаспределения.ИндексСтрокиВладельца = Счетчик;
						
						КонецЕсли;
					
					КонецЦикла;
					
					Если Не ЕстьРаспределение Тогда 
						
						НоваяСтрока.ИндексСтрокРаспределения = Неопределено;
							
					КонецЕсли;
					Счетчик = Счетчик + 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#Область Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМакета = "ВедомостьПоВыполненнымОбъемам";
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		ТабличныйДокумент = ПечатьНесколькихВедомостей(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'Ведомость по выполненным объемам'");
		ПолныйПутьКМакету = ПолныйПутьКМакету("ПФ_MXL_ВедомостьПоВыполненнымОбъемам");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			ИмяМакета,
			СинонимМакета,
			ТабличныйДокумент,
			,
			ПолныйПутьКМакету);
	КонецЕсли;
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ДоступКФинИнформации = упоРазграничениеДоступаВызовСервера.обДоступностьФинансовойИнформации();
	Если ДоступКФинИнформации = "Отсутствует" Тогда
		Возврат;
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат;
	КонецЕсли;
	
	КомандаПечати = КомандыПечати.Добавить();
	
	КомандаПечати.Идентификатор = "ВедомостьПоВыполненнымОбъемам";
	КомандаПечати.Представление = НСтр("ru='Ведомость по выполненным объемам'");
	КомандаПечати.МенеджерПечати = "Документ.упоРегистрацияФактическиВыполненногоОбъема";
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("ДокументСсылка.упоРегистрацияФактическиВыполненногоОбъема"));
	КомандаПечати.ТипыОбъектовПечати = МассивТипов;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.упоРегистрацияФактическихДоходовИРасходов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРегистрацияФактическиВыполненногоОбъема);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуОснованиеВерсии(Объект, Основание,  ЗаполнятьДоходы, ЗаполнятьРасходы)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
		ТекстУсловия = ",	Версия = &ТекущаяВерсия И ПроектнаяЗадача = &Основание";
		ОтборНеОтмененых = "";
		
	Иначе
		
		текущаяВерсия = Основание;		 
		ТекстУсловия = ",Версия = &ТекущаяВерсия";
		ОтборНеОтмененых = "		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	                       |		ПО упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	                       |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)";
		
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления КАК ДатаПоступления,
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная) КАК Сумма,
	|	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК Количество,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема
	|ИЗ
	|	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(%ТекстУсловия%) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	|%ОтборНеОтмененых%
	|ГДЕ
	|	(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная <> 0
	|			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество <> 0)
	|	И ВЫБОР
	|			КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) И &ТолькоПП
	|				ТОГДА ТИПЗНАЧЕНИЯ(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура) = ТИП(Справочник.упоПроектнаяПродукция)
	|			ИНАЧЕ НЕ ТИПЗНАЧЕНИЯ(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура) = ТИП(Справочник.упоПроектнаяПродукция)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик,
	|	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ТекстУсловия%", ТекстУсловия);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ОтборНеОтмененых%", ОтборНеОтмененых);
	
	ЗапросОбъемов = Новый Запрос;
	ЗапросОбъемов.УстановитьПараметр("Основание", Основание);
	ЗапросОбъемов.УстановитьПараметр("ТекущаяВерсия", текущаяВерсия);
	ЗапросОбъемов.УстановитьПараметр("ТолькоПП", Объект.РегистрацияПроектнойПродукции);
	
	ЗапросОбъемов.Текст = ТекстЗапроса;
	
	ТаблицаРезультат = ЗапросОбъемов.Выполнить().Выгрузить();
	
	ТаблицаКопия = ТаблицаЗаполненияПоТаблицеЗапроса(ТаблицаРезультат, ЗаполнятьДоходы, ЗаполнятьРасходы);
	
	Возврат ТаблицаКопия;
	
КонецФункции

Функция ПолучитьТаблицуОстатковОбъемов(Объект, ЗаполнятьДоходы, ЗаполнятьРасходы)
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	
	ЗапросОстатков = Новый Запрос;
	ЗапросОстатков.УстановитьПараметр("ТекВерсия", ТекВерсия);
	ЗапросОстатков.УстановитьПараметр("Проект", Объект.Проект);
	ЗапросОстатков.УстановитьПараметр("Регистратор", Объект.Ссылка);
	ЗапросОстатков.УстановитьПараметр("ДатаДока", КонецДня(Объект.Дата));
	ЗапросОстатков.УстановитьПараметр("Неопределено", Неопределено);
	ЗапросОстатков.УстановитьПараметр("ТолькоНоменклатура", Не Объект.РегистрацияПроектнойПродукции);

	ЗапросОстатков.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья КАК Статья,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема КАК ВидОбъема,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент КАК Контрагент,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор КАК Договор,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта КАК Валюта,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение КАК Подразделение,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль КАК Роль,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура КАК Номенклатура,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                       |	ВЫБОР
	                       |		КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик = &Неопределено
	                       |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                       |		КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик = ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	                       |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                       |		ИНАЧЕ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик
	                       |	КОНЕЦ КАК КонтрагентПодрядчик,
	                       |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная) КАК СуммаПлан,
	                       |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК КоличествоПлан
	                       |ПОМЕСТИТЬ ВТ_План
	                       |ИЗ
	                       |	РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(, Версия = &ТекВерсия) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	                       |		ПО упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	                       |			И упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	                       |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	                       |			И (упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления <= &ДатаДока)
	                       |ГДЕ
	                       |	(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма <> 0
	                       |			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная <> 0
	                       |			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество <> 0)
	                       |	И ВЫБОР
	                       |			КОГДА &ТолькоНоменклатура
	                       |				ТОГДА ТИПЗНАЧЕНИЯ(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура) = ТИП(Справочник.Номенклатура)
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик,
	                       |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                       |	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Статья КАК Статья,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.ВидОбъема КАК ВидОбъема,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Контрагент КАК Контрагент,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Договор КАК Договор,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Валюта КАК Валюта,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Подразделение КАК Подразделение,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Роль КАК Роль,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Номенклатура КАК Номенклатура,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                       |	ВЫБОР
	                       |		КОГДА упоФактВыполненияОбъемовОборотыОбороты.КонтрагентПодрядчик = &Неопределено
	                       |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                       |		КОГДА упоФактВыполненияОбъемовОборотыОбороты.КонтрагентПодрядчик = ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	                       |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                       |		ИНАЧЕ упоФактВыполненияОбъемовОборотыОбороты.КонтрагентПодрядчик
	                       |	КОНЕЦ КАК КонтрагентПодрядчик,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.СуммаВалютнаяОборот КАК СуммаФакт,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.КоличествоОборот КАК КоличествоФакт,
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Регистратор КАК Регистратор
	                       |ПОМЕСТИТЬ ВТ_Факт
	                       |ИЗ
	                       |	РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(, &ДатаДока, Авто, ПроектнаяЗадача.Проект = &Проект) КАК упоФактВыполненияОбъемовОборотыОбороты
	                       |ГДЕ
	                       |	упоФактВыполненияОбъемовОборотыОбороты.Регистратор <> &Регистратор
	                       |	И ВЫБОР
	                       |			КОГДА &ТолькоНоменклатура
	                       |				ТОГДА ТИПЗНАЧЕНИЯ(упоФактВыполненияОбъемовОборотыОбороты.Номенклатура) = ТИП(Справочник.Номенклатура)
	                       |			ИНАЧЕ ИСТИНА
	                       |		КОНЕЦ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_План.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	ВТ_План.Статья КАК Статья,
	                       |	ВТ_План.ВидОбъема КАК ВидОбъема,
	                       |	ВТ_План.Контрагент КАК Контрагент,
	                       |	ВТ_План.Договор КАК Договор,
	                       |	ВТ_План.Валюта КАК Валюта,
	                       |	ВТ_План.Подразделение КАК Подразделение,
	                       |	ВТ_План.Роль КАК Роль,
	                       |	ВТ_План.Номенклатура КАК Номенклатура,
	                       |	ВТ_План.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ВТ_План.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	                       |	ВТ_План.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                       |	ВТ_План.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	                       |	ВТ_План.СуммаПлан КАК СуммаПлан,
	                       |	ВТ_План.КоличествоПлан КАК КоличествоПлан,
	                       |	0 КАК СуммаФакт,
	                       |	0 КАК КоличествоФакт
	                       |ПОМЕСТИТЬ ВТ_СводнаяТаблица
	                       |ИЗ
	                       |	ВТ_План КАК ВТ_План
	                       |
	                       |ОБЪЕДИНИТЬ ВСЕ
	                       |
	                       |ВЫБРАТЬ
	                       |	ВТ_Факт.ПроектнаяЗадача,
	                       |	ВТ_Факт.Статья,
	                       |	ВТ_Факт.ВидОбъема,
	                       |	ВТ_Факт.Контрагент,
	                       |	ВТ_Факт.Договор,
	                       |	ВТ_Факт.Валюта,
	                       |	ВТ_Факт.Подразделение,
	                       |	ВТ_Факт.Роль,
	                       |	ВТ_Факт.Номенклатура,
	                       |	ВТ_Факт.ЕдиницаИзмерения,
	                       |	ВТ_Факт.Заказ_ДоговорПодрядчика,
	                       |	ВТ_Факт.СобствСилы_Субподряд,
	                       |	ВТ_Факт.КонтрагентПодрядчик,
	                       |	0,
	                       |	0,
	                       |	ВТ_Факт.СуммаФакт,
	                       |	ВТ_Факт.КоличествоФакт
	                       |ИЗ
	                       |	ВТ_Факт КАК ВТ_Факт
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВложенныйЗапрос.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |	ВложенныйЗапрос.Статья КАК Статья,
	                       |	ВложенныйЗапрос.ВидОбъема КАК ВидОбъема,
	                       |	ВложенныйЗапрос.Контрагент КАК Контрагент,
	                       |	ВложенныйЗапрос.Договор КАК Договор,
	                       |	ВложенныйЗапрос.Валюта КАК Валюта,
	                       |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	                       |	ВложенныйЗапрос.Роль КАК Роль,
	                       |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                       |	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |	ВложенныйЗапрос.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	                       |	ВложенныйЗапрос.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                       |	ВложенныйЗапрос.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	                       |	ВложенныйЗапрос.Сумма КАК Сумма,
	                       |	ВложенныйЗапрос.Количество КАК Количество,
	                       |	ВложенныйЗапрос.ДатаПоступления КАК ДатаПоступления
	                       |ИЗ
	                       |	(ВЫБРАТЬ
	                       |		ВТ_СводнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                       |		ВТ_СводнаяТаблица.Статья КАК Статья,
	                       |		ВТ_СводнаяТаблица.ВидОбъема КАК ВидОбъема,
	                       |		ВТ_СводнаяТаблица.Контрагент КАК Контрагент,
	                       |		ВТ_СводнаяТаблица.Договор КАК Договор,
	                       |		ВТ_СводнаяТаблица.Валюта КАК Валюта,
	                       |		ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	                       |		ВТ_СводнаяТаблица.Роль КАК Роль,
	                       |		ВТ_СводнаяТаблица.Номенклатура КАК Номенклатура,
	                       |		ВТ_СводнаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                       |		ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	                       |		ВТ_СводнаяТаблица.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	                       |		ВТ_СводнаяТаблица.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	                       |		СУММА(ВТ_СводнаяТаблица.СуммаПлан - ВТ_СводнаяТаблица.СуммаФакт) КАК Сумма,
	                       |		СУММА(ВТ_СводнаяТаблица.КоличествоПлан - ВТ_СводнаяТаблица.КоличествоФакт) КАК Количество,
	                       |		&ДатаДока КАК ДатаПоступления
	                       |	ИЗ
	                       |		ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица
	                       |	
	                       |	СГРУППИРОВАТЬ ПО
	                       |		ВТ_СводнаяТаблица.ПроектнаяЗадача,
	                       |		ВТ_СводнаяТаблица.Статья,
	                       |		ВТ_СводнаяТаблица.ВидОбъема,
	                       |		ВТ_СводнаяТаблица.Контрагент,
	                       |		ВТ_СводнаяТаблица.Договор,
	                       |		ВТ_СводнаяТаблица.Валюта,
	                       |		ВТ_СводнаяТаблица.Подразделение,
	                       |		ВТ_СводнаяТаблица.Роль,
	                       |		ВТ_СводнаяТаблица.Номенклатура,
	                       |		ВТ_СводнаяТаблица.ЕдиницаИзмерения,
	                       |		ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика,
	                       |		ВТ_СводнаяТаблица.СобствСилы_Субподряд,
	                       |		ВТ_СводнаяТаблица.КонтрагентПодрядчик) КАК ВложенныйЗапрос
	                       |ГДЕ
	                       |	(ВложенныйЗапрос.Количество <> 0
						   |			ИЛИ ВложенныйЗапрос.Сумма <> 0)";
	
	ТаблицаРезультат = ЗапросОстатков.Выполнить().Выгрузить();
	
	ТаблицаКопия = ТаблицаЗаполненияПоТаблицеЗапроса(ТаблицаРезультат, ЗаполнятьДоходы, ЗаполнятьРасходы);
	
	Возврат ТаблицаКопия;
	
КонецФункции

Функция ПолучитьТаблицуПоВыполненнойПроектнойПродукцииНаДату(Объект)
	
	ДатаНачала = Объект.ПериодРегистрации;
	ДатаОкончания = КонецМесяца(ДатаНачала);
	Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекВерсия", Версия);
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусыПроектнойПродукцииСрезПоследних.ПроектнаяПродукция КАК ПроектнаяПродукция,
	               |	упоСтатусыПроектнойПродукцииСрезПоследних.Период КАК ДатаПоступления
	               |ПОМЕСТИТЬ ВТ_ПроектнаяПродукция
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектнойПродукции.СрезПоследних(, Версия = &ТекВерсия) КАК упоСтатусыПроектнойПродукцииСрезПоследних
	               |ГДЕ
	               |	упоСтатусыПроектнойПродукцииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Закрыто)
	               |	И упоСтатусыПроектнойПродукцииСрезПоследних.Период <= &ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья КАК Статья,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема КАК ВидОбъема,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент КАК Контрагент,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор КАК Договор,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта КАК Валюта,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение КАК Подразделение,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль КАК Роль,
	               |	ВЫБОР
	               |		КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |		ИНАЧЕ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура
	               |	КОНЕЦ КАК Номенклатура,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВЫБОР
	               |		КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |		КОГДА упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик = ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |		ИНАЧЕ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик
	               |	КОНЕЦ КАК КонтрагентПодрядчик,
	               |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная) КАК СуммаПлан,
	               |	СУММА(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество) КАК КоличествоПлан,
	               |	ВТ_ПроектнаяПродукция.ДатаПоступления КАК ДатаПоступления
	               |ПОМЕСТИТЬ ВТ_План
	               |ИЗ
	               |	ВТ_ПроектнаяПродукция КАК ВТ_ПроектнаяПродукция
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыВыполненияОбъемов.СрезПоследних(, Версия = &ТекВерсия) КАК упоАктуальныеПланыВыполненияОбъемовСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |			ПО упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |				И упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |				И (упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ДатаНачисления <= &ДатаОкончания)
	               |		ПО ВТ_ПроектнаяПродукция.ПроектнаяПродукция = упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура
	               |ГДЕ
	               |	(упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Сумма <> 0
	               |			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СуммаВалютная <> 0
	               |			ИЛИ упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Количество <> 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ПроектнаяЗадача,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Статья,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ВидОбъема,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Контрагент,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Договор,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Валюта,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Подразделение,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Роль,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Номенклатура,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.ЕдиницаИзмерения,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.Заказ_ДоговорПодрядчика,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.СобствСилы_Субподряд,
	               |	упоАктуальныеПланыВыполненияОбъемовСрезПоследних.КонтрагентПодрядчик,
	               |	ВТ_ПроектнаяПродукция.ДатаПоступления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоФактВыполненияОбъемовОборотыОбороты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Статья КАК Статья,
	               |	упоФактВыполненияОбъемовОборотыОбороты.ВидОбъема КАК ВидОбъема,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Контрагент КАК Контрагент,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Договор КАК Договор,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Валюта КАК Валюта,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Подразделение КАК Подразделение,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Роль КАК Роль,
	               |	ВЫБОР
	               |		КОГДА упоФактВыполненияОбъемовОборотыОбороты.Номенклатура = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |		ИНАЧЕ упоФактВыполненияОбъемовОборотыОбороты.Номенклатура
	               |	КОНЕЦ КАК Номенклатура,
	               |	упоФактВыполненияОбъемовОборотыОбороты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	упоФактВыполненияОбъемовОборотыОбороты.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВЫБОР
	               |		КОГДА упоФактВыполненияОбъемовОборотыОбороты.КонтрагентПодрядчик = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |		КОГДА упоФактВыполненияОбъемовОборотыОбороты.КонтрагентПодрядчик = ЗНАЧЕНИЕ(Справочник.упоТрудовыеРесурсы.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |		ИНАЧЕ упоФактВыполненияОбъемовОборотыОбороты.КонтрагентПодрядчик
	               |	КОНЕЦ КАК КонтрагентПодрядчик,
	               |	упоФактВыполненияОбъемовОборотыОбороты.СуммаВалютнаяОборот КАК СуммаФакт,
	               |	упоФактВыполненияОбъемовОборотыОбороты.КоличествоОборот КАК КоличествоФакт,
	               |	упоФактВыполненияОбъемовОборотыОбороты.Регистратор КАК Регистратор,
	               |	ВТ_ПроектнаяПродукция.ДатаПоступления КАК ДатаПоступления
	               |ПОМЕСТИТЬ ВТ_Факт
	               |ИЗ
	               |	ВТ_ПроектнаяПродукция КАК ВТ_ПроектнаяПродукция
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.упоФактВыполненияОбъемовОбороты.Обороты(, &ДатаОкончания, Авто, ПроектнаяЗадача.Проект = &Проект) КАК упоФактВыполненияОбъемовОборотыОбороты
	               |		ПО ВТ_ПроектнаяПродукция.ПроектнаяПродукция = упоФактВыполненияОбъемовОборотыОбороты.Номенклатура
	               |ГДЕ
	               |	упоФактВыполненияОбъемовОборотыОбороты.Регистратор <> &Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_План.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_План.Статья КАК Статья,
	               |	ВТ_План.ВидОбъема КАК ВидОбъема,
	               |	ВТ_План.Контрагент КАК Контрагент,
	               |	ВТ_План.Договор КАК Договор,
	               |	ВТ_План.Валюта КАК Валюта,
	               |	ВТ_План.Подразделение КАК Подразделение,
	               |	ВТ_План.Роль КАК Роль,
	               |	ВТ_План.Номенклатура КАК Номенклатура,
	               |	ВТ_План.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_План.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	ВТ_План.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВТ_План.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ВТ_План.СуммаПлан КАК СуммаПлан,
	               |	ВТ_План.КоличествоПлан КАК КоличествоПлан,
	               |	0 КАК СуммаФакт,
	               |	0 КАК КоличествоФакт,
	               |	ВТ_План.ДатаПоступления КАК ДатаПоступления
	               |ПОМЕСТИТЬ ВТ_СводнаяТаблица
	               |ИЗ
	               |	ВТ_План КАК ВТ_План
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Факт.ПроектнаяЗадача,
	               |	ВТ_Факт.Статья,
	               |	ВТ_Факт.ВидОбъема,
	               |	ВТ_Факт.Контрагент,
	               |	ВТ_Факт.Договор,
	               |	ВТ_Факт.Валюта,
	               |	ВТ_Факт.Подразделение,
	               |	ВТ_Факт.Роль,
	               |	ВТ_Факт.Номенклатура,
	               |	ВТ_Факт.ЕдиницаИзмерения,
	               |	ВТ_Факт.Заказ_ДоговорПодрядчика,
	               |	ВТ_Факт.СобствСилы_Субподряд,
	               |	ВТ_Факт.КонтрагентПодрядчик,
	               |	0,
	               |	0,
	               |	ВТ_Факт.СуммаФакт,
	               |	ВТ_Факт.КоличествоФакт,
	               |	ВТ_Факт.ДатаПоступления
	               |ИЗ
	               |	ВТ_Факт КАК ВТ_Факт
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВложенныйЗапрос.Статья КАК Статья,
	               |	ВложенныйЗапрос.ВидОбъема КАК ВидОбъема,
	               |	ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |	ВложенныйЗапрос.Договор КАК Договор,
	               |	ВложенныйЗапрос.Валюта КАК Валюта,
	               |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	               |	ВложенныйЗапрос.Роль КАК Роль,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	ВложенныйЗапрос.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	ВложенныйЗапрос.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	ВложенныйЗапрос.Сумма КАК Сумма,
	               |	ВложенныйЗапрос.Количество КАК Количество,
	               |	ВложенныйЗапрос.ДатаПоступления КАК ДатаПоступления
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_СводнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |		ВТ_СводнаяТаблица.Статья КАК Статья,
	               |		ВТ_СводнаяТаблица.ВидОбъема КАК ВидОбъема,
	               |		ВТ_СводнаяТаблица.Контрагент КАК Контрагент,
	               |		ВТ_СводнаяТаблица.Договор КАК Договор,
	               |		ВТ_СводнаяТаблица.Валюта КАК Валюта,
	               |		ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	               |		ВТ_СводнаяТаблица.Роль КАК Роль,
	               |		ВТ_СводнаяТаблица.Номенклатура КАК Номенклатура,
	               |		ВТ_СводнаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |		ВТ_СводнаяТаблица.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |		ВТ_СводнаяТаблица.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |		СУММА(ВТ_СводнаяТаблица.СуммаПлан - ВТ_СводнаяТаблица.СуммаФакт) КАК Сумма,
	               |		СУММА(ВТ_СводнаяТаблица.КоличествоПлан - ВТ_СводнаяТаблица.КоличествоФакт) КАК Количество,
	               |		ВТ_СводнаяТаблица.ДатаПоступления КАК ДатаПоступления
	               |	ИЗ
	               |		ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_СводнаяТаблица.ПроектнаяЗадача,
	               |		ВТ_СводнаяТаблица.Статья,
	               |		ВТ_СводнаяТаблица.ВидОбъема,
	               |		ВТ_СводнаяТаблица.Контрагент,
	               |		ВТ_СводнаяТаблица.Договор,
	               |		ВТ_СводнаяТаблица.Валюта,
	               |		ВТ_СводнаяТаблица.Подразделение,
	               |		ВТ_СводнаяТаблица.Роль,
	               |		ВТ_СводнаяТаблица.Номенклатура,
	               |		ВТ_СводнаяТаблица.ЕдиницаИзмерения,
	               |		ВТ_СводнаяТаблица.Заказ_ДоговорПодрядчика,
	               |		ВТ_СводнаяТаблица.СобствСилы_Субподряд,
	               |		ВТ_СводнаяТаблица.КонтрагентПодрядчик,
	               |		ВТ_СводнаяТаблица.ДатаПоступления) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	(ВложенныйЗапрос.Количество <> 0
	               |			ИЛИ ВложенныйЗапрос.Сумма <> 0)";
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаКопия = ТаблицаЗаполненияПоТаблицеЗапроса(ТаблицаРезультат, Истина, Ложь);
	
	Возврат ТаблицаКопия;
	
КонецФункции

Функция ТаблицаЗаполненияПоТаблицеЗапроса(ТаблицаРезультат, ЗаполнятьДоходы, ЗаполнятьРасходы)
	
	ТаблицаКопия = ТаблицаРезультат.СкопироватьКолонки();
	
	Для Каждого СтрокаТР Из ТаблицаРезультат Цикл
		
		ДобавитьДоход = ЗаполнятьДоходы И СтрокаТР.ВидОбъема = Перечисления.упоВидЭлементаОбъемов.Доход;
		ДобавитьРасход = ЗаполнятьРасходы И СтрокаТР.ВидОбъема = Перечисления.упоВидЭлементаОбъемов.Расход;
		
		Если ДобавитьДоход Или ДобавитьРасход Тогда
			НоваяСтрока = ТаблицаКопия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТР);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаКопия;
	
КонецФункции

Процедура УстановитьПериодРегистрацииПоДатеПоступлений(Объект, ТаблицаОбъемы)
	
	ЗаполнитьПериодРегистрации = Объект.РегистрацияПроектнойПродукции И ЗначениеЗаполнено(ТаблицаОбъемы)
		И Не ЗначениеЗаполнено(Объект.ПериодРегистрации);
	
	Если Не ЗаполнитьПериодРегистрации Тогда
		Возврат;
	КонецЕсли;
	
	ДатыПоступлений = ТаблицаОбъемы.ВыгрузитьКолонку("ДатаПоступления");
	
	МаксДата = '00010101';
	Для Каждого ДатаПоступления из ДатыПоступлений Цикл
		МаксДата = Макс(МаксДата, ДатаПоступления); 
	КонецЦикла;
	
	Объект.ПериодРегистрации = МаксДата;
	
КонецПроцедуры

#Область Печать

Функция ПолныйПутьКМакету(ИмяМакета)
	
	ПолныйПутьКМакету = СтрШаблон("Документ.упоРегистрацияФактическиВыполненногоОбъема.%1", ИмяМакета);
	
	Возврат ПолныйПутьКМакету;
	
КонецФункции

Функция МакетПечатнойФормы(ИмяМакета)
	
	ПолныйПутьКМакету = ПолныйПутьКМакету(ИмяМакета);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолныйПутьКМакету);
	
	Возврат Макет;
	
КонецФункции

Функция ПечатьНесколькихВедомостей(МассивОбъектов)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		ТабличныйДокументСсылки = ПечатьВедомостиПоВыполненнымОбъемам(Ссылка);
		Если ТабличныйДокумент.ВысотаТаблицы > 0 И ТабличныйДокументСсылки.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ТабличныйДокументСсылки);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьВедомостиПоВыполненнымОбъемам(Ссылка)
	
	ДанныеШапки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Проект, ПериодРегистрации, Дата");
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ДанныеШапки.Проект);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = МакетПечатнойФормы("ПФ_MXL_ВедомостьПоВыполненнымОбъемам");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.НомерСтроки КАК НомерСтроки,
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ПроектнаяЗадача КАК ПроектнаяЗадачаПроект,
		|	ПРЕДСТАВЛЕНИЕ(упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура) КАК ПроектнаяПродукция,
		|	ПРЕДСТАВЛЕНИЕ(упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Количество КАК Количество,
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ДатаПоступления КАК ПериодС,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура) = ТИП(Справочник.упоПроектнаяПродукция)
		|			ТОГДА упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура.КодПП
		|		ИНАЧЕ упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура.Код
		|	КОНЕЦ КАК КодПП,
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Сумма КАК Сумма,
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка.РегистрацияПроектнойПродукции КАК РегистрацияПроектнойПродукции
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.упоРегистрацияФактическиВыполненногоОбъема.ДоходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы
		|ГДЕ
		|	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ДанныеДокумента.НомерСтроки КАК НомерСтроки,
		|	ВТ_ДанныеДокумента.Количество КАК Количество,
		|	ЕСТЬNULL(СвойстваПЗ.НазваниеЗадачи, ПРЕДСТАВЛЕНИЕ(ВТ_ДанныеДокумента.ПроектнаяЗадачаПроект)) КАК ПроектнаяЗадача,
		|	ЕСТЬNULL(СвойстваЭтапа.НазваниеЗадачи, """") КАК Этап,
		|	ВТ_ДанныеДокумента.ПроектнаяПродукция КАК ПроектнаяПродукция,
		|	ВТ_ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ДанныеДокумента.ПериодС КАК ПериодС,
		|	ВТ_ДанныеДокумента.КодПП КАК КодПП,
		|	ВТ_ДанныеДокумента.Сумма КАК Сумма,
		|	ВТ_ДанныеДокумента.РегистрацияПроектнойПродукции КАК РегистрацияПроектнойПродукции
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК СвойстваПЗ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК СвойстваЭтапа
		|			ПО СвойстваПЗ.ЗадачаРодитель = СвойстваЭтапа.ПроектнаяЗадача
		|		ПО ВТ_ДанныеДокумента.ПроектнаяЗадача = СвойстваПЗ.ПроектнаяЗадача
		|ИТОГИ
		|	МИНИМУМ(ПериодС),
		|	СУММА(Сумма),
		|	МИНИМУМ(РегистрацияПроектнойПродукции)
		|ПО
		|	ОБЩИЕ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ДоходныеОбъемыОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ДоходныеОбъемыШапкаТаблицы");
	ДоходныеОбъемыОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("ДоходныеОбъемыДетали");
	ДоходныеОбъемыОбластьИтоги = Макет.ПолучитьОбласть("ДоходныеОбъемыИтоги");
	ТабДок.Очистить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.ПериодС = Формат(ВыборкаДетальныеЗаписи.ПериодС, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ПериодПо = Формат(?(ЗначениеЗаполнено(ДанныеШапки.ПериодРегистрации),
			ДанныеШапки.ПериодРегистрации, ДанныеШапки.Дата), "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьШапка);
		
		Если ВыборкаДетальныеЗаписи.РегистрацияПроектнойПродукции Тогда
			ДоходныеОбъемыОбластьШапкаТаблицы.Параметры.ЗаголовокНоменклатура = НСтр("ru = 'Проектная продукция'");
			ДоходныеОбъемыОбластьШапкаТаблицы.Параметры.ЗаголовокКод = НСтр("ru = 'Код ПП'");
		Иначе
			ДоходныеОбъемыОбластьШапкаТаблицы.Параметры.ЗаголовокНоменклатура = НСтр("ru = 'Номенклатура'");
			ДоходныеОбъемыОбластьШапкаТаблицы.Параметры.ЗаголовокКод = НСтр("ru = 'Код'");
		КонецЕсли;
		ТабДок.Вывести(ДоходныеОбъемыОбластьШапкаТаблицы);
		
		ДоходныеОбъемыВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписи.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ДоходныеОбъемыВыборкаДетальныеЗаписи.Следующий() Цикл
			ДоходныеОбъемыОбластьДетальныхЗаписей.Параметры.Заполнить(ДоходныеОбъемыВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ДоходныеОбъемыОбластьДетальныхЗаписей);
		КонецЦикла;
		ДоходныеОбъемыОбластьИтоги.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		
		ТабДок.Вывести(ДоходныеОбъемыОбластьИтоги);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли