
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем мТаблицаВыполненныхОбъемов Экспорт; // Данные о выполненных объемах.
Перем мТаблицаПлановыхВыполненныхОбъемов Экспорт; // Данные плановых выполненных объемов.
Перем мВведенНаОсновании Экспорт; // Признак того, что документ введен на основании.

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура для вызова при подборе ресурсов в табличную часть "МатериальныеРесурсы".
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти	 - строка табличной части "МатериальныеРесурсы". 
//  ПараметрыПодбора	 - Структура - не используется.
//
Процедура ВыполнитьДействияПриПодборе(Знач СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	КодОшибки = ЗаполнитьСтрокуТЧДанными(СтрокаТабличнойЧасти.ПроектнаяЗадача, СтрокаТабличнойЧасти, Истина);	
	Если Не КодОшибки = Неопределено Тогда
		обПредупреждение(КодОшибки);
		СтрокаТабличнойЧасти.Владелец().Удалить(СтрокаТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	СвойстваПроекта = Неопределено;
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("СвойстваПроекта", СвойстваПроекта) Тогда
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ЭтотОбъект.Проект);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СвойстваПроекта", СвойстваПроекта);
	КонецЕсли;	
			
	Если ИмяТабличнойЧасти = "ДоходныеОбъемы" Тогда		
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадачаПроект");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		Если СвойстваПроекта.ДоходыПоНатуральнымПоказателям Тогда
			СтруктураОбязательныхПолей.Вставить("Количество");
		КонецЕсли;	
	ИначеЕсли ИмяТабличнойЧасти = "РасходныеОбъемы" Тогда		
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадачаПроект");
		СтруктураОбязательныхПолей.Вставить("Валюта");
		Если СвойстваПроекта.РасходыПоНатуральнымПоказателям Тогда
			СтруктураОбязательныхПолей.Вставить("Количество");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры: 
//  ДанныеДокумента - Структура - содержит слепок документа.
//  Отказ           - Булево	- признак отказа от выполнения операции.
//  Заголовок       - Строка	- содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Отказ проведения, если есть документы, проведенные после текущей даты для текущих ПЗ.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Факт.Регистратор
	               |ИЗ
	               |	РегистрСведений.упоФактВыполненияОбъемовПоДням КАК Факт
	               |ГДЕ
	               |	Факт.День > &текДень
	               |	И Факт.ПроектнаяЗадача В(&ПроектныеЗадачи)";
	
	Запрос.УстановитьПараметр("ПроектныеЗадачи", );
	Запрос.УстановитьПараметр("текДень", Дата);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		обСообщитьОбОшибке("Документ не будет проведен, так как есть документы ""Регистрация фактического освоенного объема""
			|за следующие дни, что противоречит логике.", Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт
	
	ПравилаНаложения = Новый Структура();
	
	// Правила для регистра "ФактВыполненияОбъемов".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактВыполненияОбъемовПоДням.Метаданные().Имя, Правила);
	
	// Правила для регистра "СтатусыПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСтатусыПроектныхЗадач.Метаданные().Имя, Правила);
	
	// Правила для регистра "ПроцентыГотовностиПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоПроцентыГотовностиПроектныхЗадач.Метаданные().Имя, Правила);
	
	// Правила для регистра "ПроцентыГотовностиПроектов".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоПроцентыГотовностиПроектов.Метаданные().Имя, Правила);
	
	// Правила для регистра "упоВыполненныеПринятыеОбъемы".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоВыполненныеПринятыеОбъемы", Правила);
	
	// Правила для регистра "упоФактВыполненияОбъемовОбороты".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоФактВыполненияОбъемовОбороты", Правила);
	
	// Правила для регистра "упоФактическиеДатыНачалаИОкончанияПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоФактическиеДатыНачалаИОкончанияПроектныхЗадач", Правила);
	
	Возврат ПравилаНаложения; 
	
КонецФункции

Процедура ДобавитьВРегистрыПроцентИСтатус(ДанныеДвижений,
										  КЭШПроцентов,
										  Версия,
										  пПроектнаяЗадача, 
										  Знач пПроцентГотовности,
										  пСтатусЗадачиТекущий,
										  пСтатусЗадачи = Неопределено)
										  
	Если пСтатусЗадачи = Неопределено Тогда
		пСтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Выполняется;
	КонецЕсли;
	
	Если пПроцентГотовности > 100 Тогда
		пПроцентГотовности = 100;
	КонецЕсли;
	
	Если пПроцентГотовности = 100 Тогда
		пСтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Завершена;
	КонецЕсли;
	
	Если пСтатусЗадачиТекущий = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта Тогда
		пСтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта;
		пПроцентГотовности = 100;
	КонецЕсли;
	
	ОчиститьДанныеГотовностиИСтатусаДляОбновления(пПроектнаяЗадача, ДанныеДвижений);
	
	Движение = ДанныеДвижений[Движения.упоПроцентыГотовностиПроектныхЗадач.Метаданные().Имя].Добавить();
	Движение.Версия = Версия;
	Движение.ПроектнаяЗадача = пПроектнаяЗадача;
	Движение.ПроцентГотовности = пПроцентГотовности;
	
	Движение = ДанныеДвижений[Движения.упоСтатусыПроектныхЗадач.Метаданные().Имя].Добавить();
	Движение.Версия = Версия;
	Движение.ПроектнаяЗадача = пПроектнаяЗадача;
	Движение.СтатусЗадачи = пСтатусЗадачи;
	
	КЭШПроцентов.Вставить(пПроектнаяЗадача, пПроцентГотовности);
	
КонецПроцедуры

// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	// Начало проценты и статусы.
	Родители = Новый Массив;
	КЭШПроцентов = Новый Соответствие;
	ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	СчитатьПроцентыГотовностиПоДоходнымОбъемам(ДанныеДвижений, ТекущаяВерсия, КЭШПроцентов, Родители, Отказ);
	
	// Теперь еще для родителей надо сделать.
	СчитатьПроцентыГотовностиРодителей(ДанныеДвижений, ТекущаяВерсия, КЭШПроцентов, Родители);
	
	ЗапросФактСубпродуктов = Новый Запрос;
	ЗапросФактСубпродуктов.Текст = "ВЫБРАТЬ
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка.Проект,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ПроектнаяЗадача,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура КАК Субпродукт,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ДатаПоступления КАК День,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ЕдиницаИзмерения,
	                               |	1 КАК Коэффициент,
	                               |	СУММА(упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Количество) КАК Количество,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Валюта,
	                               |	СУММА(упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Сумма) КАК СуммаВалютная
	                               |ИЗ
	                               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.ДоходныеОбъемы КАК упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы
	                               |ГДЕ
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка = &Ссылка
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Ссылка.Проект,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ПроектнаяЗадача,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Номенклатура,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ДатаПоступления,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.ЕдиницаИзмерения,
	                               |	упоРегистрацияФактическиВыполненногоОбъемаДоходныеОбъемы.Валюта";
	ЗапросФактСубпродуктов.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = ЗапросФактСубпродуктов.Выполнить().Выбрать();
	пВалютаУпр = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = ДанныеДвижений.упоФактВыполненияОбъемовПоДням.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Сумма = упоМодульВалютногоУчета.ПересчитатьСумму(Выборка.СуммаВалютная, Выборка.Валюта, пВалютаУпр, Дата);
		
	КонецЦикла;
	
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	
	СвойстваПроведения = Новый Структура;
	СвойстваПроведения.Вставить("Проект", Проект);
	СвойстваПроведения.Вставить("Версия", текущаяВерсия);
	СвойстваПроведения.Вставить("ПроектнаяЗадача", текущаяВерсия);
	СвойстваПроведения.Вставить("КонтрагентЗатрат", Проект.КонтрагентДоходов);
	СвойстваПроведения.Вставить("ДоговорЗатрат", Проект.ДоговорДоходов);
	
	упоАналитикаПоПодразделениямСервер.ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(ЭтотОбъект, СвойстваПроведения);
	упоАналитикаПоПодразделениямСервер.ПодготовитьТаблицыДвижений(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);
	
КонецПроцедуры

// Не используется.
//
// Параметры:
//	пПроектнаяЗадача 		 - Произвольный - не используется.
//	пСтрокаТЧ		 		 - Произвольный - не используется.
//	ВытянутьПервоеПопавшееся - Произвольный - не используется.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ЗаполнитьСтрокуТЧДанными(пПроектнаяЗадача, пСтрокаТЧ = Неопределено, ВытянутьПервоеПопавшееся = Неопределено) Экспорт
	
	
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события.
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Основание    - Произвольный 	- значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		ДокументОснование = Основание;
		Проект = Основание.Проект;
		Документы.упоРегистрацияФактическиВыполненногоОбъема.ЗаполнитьОбъектПоОснованию(ЭтотОбъект, 
			Основание, 
			Истина, 
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево 			- признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево 			- признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	// Закомментированно, т.к. создаёт записи по всем задачам структуры. Если дата документа больше
	// текущей даты, то мы просто не можем изменить процент готовности/статус задачи из-за наличия
	// этих записей.
	//упоПроведениеДокументовСервер.АвтоматическийРасчетГотовности(ЭтотОбъект, Отказ, РежимПроведения);
	
	упоЗакрытиеЭтапа.УдалитьИзДвиженийСтатусовИПроцентовЗакрытыеЗадачи(ЭтотОбъект);
	
	упоПроведениеДокументовСервер.РасчетФактическихДатНачалаИОкончанияПроектныхЗадач(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ДоходныеОбъемы.ДатаПоступления");	
	ПроверяемыеРеквизиты.Добавить("РасходныеОбъемы.ДатаПоступления");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	Если ЗначениеЗаполнено(Проект) Тогда
		СтрокаТаб.ЗначениеДоступа = Проект;
	Иначе
		СтрокаТаб.ЗначениеДоступа = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
		
КонецПроцедуры


#Область ПроцентыГотовностиИСтатусы

Процедура СчитатьПроцентыГотовностиПоДоходнымОбъемам(ДанныеДвижений, ТекущаяВерсия, КЭШПроцентов, Родители, Отказ)
	
	Если Не МожноРассчитатьПроцентГотовностиИСтатус(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ДоходныеОбъемы.ВыгрузитьКолонку("ПроектнаяЗадача"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТекущаяВерсия", ТекущаяВерсия);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	план.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	план.Номенклатура КАК Субпродукт,
	               |	план.Количество КАК ПланВсего
	               |ПОМЕСТИТЬ ПланВыпускаСубпродуктов
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
	               |			,
	               |			Версия = &ТекущаяВерсия
	               |				И ПроектнаяЗадача В (&ПроектныеЗадачи)
	               |				И Основной) КАК план
	               |ГДЕ
	               |	план.Количество <> 0
	               |	ИЛИ план.Сумма <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДокОсвоения.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДокОсвоения.Номенклатура КАК Субпродукт,
	               |	0 КАК ПланВсего,
	               |	СУММА(ДокОсвоения.Количество) КАК УжеОсвоено
	               |ПОМЕСТИТЬ ОсвоеноПоДокументу
	               |ИЗ
	               |	Документ.упоРегистрацияФактическиВыполненногоОбъема.ДоходныеОбъемы КАК ДокОсвоения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВыпускаСубпродуктов КАК План
	               |		ПО ДокОсвоения.Номенклатура = План.Субпродукт
	               |			И ДокОсвоения.ПроектнаяЗадача = План.ПроектнаяЗадача
	               |ГДЕ
	               |	ДокОсвоения.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокОсвоения.ПроектнаяЗадача,
	               |	ДокОсвоения.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Влож.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Влож.Субпродукт КАК Субпродукт,
	               |	СУММА(Влож.ПланВсего) КАК ПланВсего,
	               |	СУММА(Влож.УжеОсвоено) КАК УжеОсвоено,
	               |	ВЫБОР
	               |		КОГДА НЕ СУММА(ЕСТЬNULL(Влож.ПланВсего, 0)) = 0
	               |			ТОГДА ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(Влож.УжеОсвоено, 0)) / СУММА(Влож.ПланВсего) * 100 КАК ЧИСЛО(15, 2))
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентГотовности,
	               |	ВЫБОР
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача ЕСТЬ NULL
	               |			ТОГДА Влож.ПроектнаяЗадача.ЗадачаРодитель
	               |		ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель
	               |	КОНЕЦ КАК Родитель,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачиТекущий
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		План.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |		План.Субпродукт КАК Субпродукт,
	               |		План.ПланВсего КАК ПланВсего,
	               |		0 КАК УжеОсвоено
	               |	ИЗ
	               |		ПланВыпускаСубпродуктов КАК План
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		Факт.ПроектнаяЗадача,
	               |		Факт.Субпродукт,
	               |		0,
	               |		СУММА(Факт.Количество)
	               |	ИЗ
	               |		РегистрСведений.упоФактВыполненияОбъемовПоДням КАК Факт
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВыпускаСубпродуктов КАК ДанныеПлана
	               |			ПО Факт.ПроектнаяЗадача = ДанныеПлана.ПроектнаяЗадача
	               |				И Факт.Субпродукт = ДанныеПлана.Субпродукт
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Факт.ПроектнаяЗадача,
	               |		Факт.Субпродукт
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ДокОсвоения.ПроектнаяЗадача,
	               |		ДокОсвоения.Субпродукт,
	               |		ДокОсвоения.ПланВсего,
	               |		ДокОсвоения.УжеОсвоено
	               |	ИЗ
	               |		ОсвоеноПоДокументу КАК ДокОсвоения) КАК Влож
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &ТекущаяВерсия
	               |					И ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО Влож.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &ТекущаяВерсия
	               |					И ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ПО Влож.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	Влож.Субпродукт В
	               |			(ВЫБРАТЬ
	               |				ОсвоеноПоДокументу.Субпродукт
	               |			ИЗ
	               |				ОсвоеноПоДокументу)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Влож.ПроектнаяЗадача,
	               |	Влож.Субпродукт,
	               |	ВЫБОР
	               |		КОГДА упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача ЕСТЬ NULL
	               |			ТОГДА Влож.ПроектнаяЗадача.ЗадачаРодитель
	               |		ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель
	               |	КОНЕЦ,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ %1 не записал проценты готовности задач: '"), Ссылка)
			+ НСтр("ru = 'в плане выпуска не найдена номенклатура с признаком ""Основной результат"", '")
			+ НСтр("ru = 'нет базы для расчета процента готовности.'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.ПроцентГотовности) Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьВРегистрыПроцентИСтатус(ДанныеДвижений, КЭШПроцентов, ТекущаяВерсия, Выборка.ПроектнаяЗадача,
				Выборка.ПроцентГотовности, Выборка.СтатусЗадачиТекущий);
			Родитель = Выборка.Родитель;
			Если ЗначениеЗаполнено(Родитель) И Родители.Найти(Родитель) = Неопределено Тогда
				Родители.Добавить(Родитель);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура СчитатьПроцентыГотовностиРодителей(ДанныеДвижений, ТекущаяВерсия, КЭШПроцентов, Родители)
	
	// Теперь еще для родителей надо сделать. Как?
	// Думаю, надо следующим образом: если у родителя % готовности складывается из % готовности детей, 
	// то один % готовности ребенка меняется и все.
	Пока Родители.Количество() > 0 Цикл
		новыеРодители = Новый Массив;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи
		               |ИЗ
		               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
		               |			,
		               |			Версия = &ТекущаяВерсия
		               |				И ПроектнаяЗадача В (&Родители)) КАК упоСтатусыПроектныхЗадачСрезПоследних";
		Запрос.УстановитьПараметр("Родители", Родители);
		Запрос.УстановитьПараметр("ТекущаяВерсия", ТекущаяВерсия);
		ВыборкаТекущихСтатусовРодителей = Запрос.Выполнить().Выбрать();
		СоответствиеТекущихСтатусовРодителей = Новый Соответствие;
		Пока ВыборкаТекущихСтатусовРодителей.Следующий() Цикл
			СоответствиеТекущихСтатусовРодителей.Вставить(ВыборкаТекущихСтатусовРодителей.ПроектнаяЗадача, ВыборкаТекущихСтатусовРодителей.СтатусЗадачи);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	задачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	задачи.ЗадачаРодитель КАК ЗадачаРодитель
		               |ПОМЕСТИТЬ СвойстваПроектныхЗадач
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		               |			,
		               |			Версия = &ТекущаяВерсия
		               |				И ЗадачаРодитель В (&ЗадачаРодитель)) КАК задачи
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	задачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	ЕСТЬNULL(проценты.ПроцентГотовности, 0) КАК ПроцентГотовности,
		               |	задачи.ЗадачаРодитель КАК Родитель,
		               |	задачи.ЗадачаРодитель.ЗадачаРодитель КАК НовыйРодитель,
		               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК ТекущийСтатусЗадачи
		               |ИЗ
		               |	СвойстваПроектныхЗадач КАК задачи
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
		               |				,
		               |				Версия = &ТекущаяВерсия
		               |					И ПроектнаяЗадача В
		               |						(ВЫБРАТЬ
		               |							СвойстваПроектныхЗадач.ПроектнаяЗадача
		               |						ИЗ
		               |							СвойстваПроектныхЗадач)) КАК проценты
		               |		ПО (проценты.ПроектнаяЗадача = задачи.ПроектнаяЗадача)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
		               |				,
		               |				Версия = &ТекущаяВерсия
		               |					И ПроектнаяЗадача В
		               |						(ВЫБРАТЬ
		               |							СвойстваПроектныхЗадач.ПроектнаяЗадача
		               |						ИЗ
		               |							СвойстваПроектныхЗадач)) КАК упоСтатусыПроектныхЗадачСрезПоследних
		               |		ПО задачи.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача";
		
		Запрос.УстановитьПараметр("ЗадачаРодитель", Родители);
		Запрос.УстановитьПараметр("ТекущаяВерсия", ТекущаяВерсия);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		Выборка.Индексы.Добавить("Родитель");
		
		Для каждого Родитель Из Родители Цикл
			
			ТекущийСтатусРодителя = СоответствиеТекущихСтатусовРодителей.Получить(Родитель);
			
			Дети = Выборка.НайтиСтроки(Новый Структура("Родитель", Родитель));
			Если Дети.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			суммаПроцентов = 0;
			
			ДобавилиРодителя = Ложь;
			Для каждого ребенок Из Дети Цикл
				ужеУстановленныйПроцент = КЭШПроцентов[ребенок.ПроектнаяЗадача];
				Если ужеУстановленныйПроцент = Неопределено Тогда
					суммаПроцентов = суммаПроцентов + ребенок.ПроцентГотовности;
				Иначе
					суммаПроцентов = суммаПроцентов + ужеУстановленныйПроцент;
				КонецЕсли;
				
				Если НЕ ДобавилиРодителя Тогда
					Если ЗначениеЗаполнено(ребенок.НовыйРодитель) Тогда
						новыеРодители.Добавить(ребенок.НовыйРодитель);
					КонецЕсли;
					
					ДобавилиРодителя = Истина
				КонецЕсли;
			КонецЦикла;			
			
			ДобавитьВРегистрыПроцентИСтатус(ДанныеДвижений, КЭШПроцентов, ТекущаяВерсия, Родитель,
				суммаПроцентов / дети.Количество(), ТекущийСтатусРодителя);
			
		КонецЦикла;
		
		Родители = новыеРодители;
	КонецЦикла;

КонецПроцедуры

// Очищает раннее заполненные данные по проектной задаче для обновления в вызываемом методе.
//
// Параметры:
//  ПроектнаяЗадача     - ДокументСсылка.упоПроектнаяЗадача
//  ДанныеДвижений     - Структура
//
Процедура ОчиститьДанныеГотовностиИСтатусаДляОбновления(ПроектнаяЗадача, ДанныеДвижений)
	
	Отбор = Новый Структура("ПроектнаяЗадача", ПроектнаяЗадача);
	ТаблицаПроцентыГотовности = ДанныеДвижений[Движения.упоПроцентыГотовностиПроектныхЗадач.Метаданные().Имя];
	ТаблицаСтатусы = ДанныеДвижений[Движения.упоСтатусыПроектныхЗадач.Метаданные().Имя];
	
	Строки = ТаблицаПроцентыГотовности.НайтиСтроки(Отбор);
	Для каждого Строка Из Строки Цикл
		ТаблицаПроцентыГотовности.Удалить(Строка);
	КонецЦикла;
	
	Строки = ТаблицаСтатусы.НайтиСтроки(Отбор);
	Для каждого Строка Из Строки Цикл
		ТаблицаСтатусы.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПроектВСтатусеВыполняется(Проект, СтатусПроекта)
	
	ПроектВСтатусеВыполняется = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ДатаДокумента", КонецДня(ЭтотОбъект.Дата));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Т.СтатусПроекта КАК СтатусПроекта
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(&ДатаДокумента, Проект = &Проект) КАК Т";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ПроектВСтатусеВыполняется;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СтатусПроекта = Выборка.СтатусПроекта;
	Если СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Выполняется Тогда
		ПроектВСтатусеВыполняется = Истина;
	КонецЕсли;
	
	Возврат ПроектВСтатусеВыполняется;
	
КонецФункции

Функция МожноРассчитатьПроцентГотовностиИСтатус(Отказ)
	
	Результат = Ложь;
	
	Если Не ЭтотОбъект.ЗаписыватьПроцентГотовности Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтатусПроекта = Неопределено;
	Если Не ПроектВСтатусеВыполняется(ЭтотОбъект.Проект, СтатусПроекта) Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Для записи процента готовности проект ""%1"" должен находиться в статусе ""Выполняется""'")
			 + НСтр("ru = ' на дату документа (на %2 проект находится в статусе ""%3"").'"),
			ЭтотОбъект.Проект,
			Формат(ЭтотОбъект.Дата, "ДЛФ=Д"),
			СтатусПроекта);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат Результат;
	КонецЕсли;
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Инициализация

мВведенНаОсновании = Ложь;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли