#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ИмяМакета = "ДетальныйСтатусОтчет";
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		ТабличныйДокумент = ПечатьДетальныйСтатусОтчет(МассивОбъектов, ОбъектыПечати);
		СинонимМакета = НСтр("ru = 'Детальный статус-отчет'");
		ПолныйПутьКМакету = ПолныйПутьКМакету("ПФ_MXL_ДетальныйСтатусОтчет");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			СинонимМакета,
			ТабличныйДокумент,
			,
			ПолныйПутьКМакету);
	КонецЕсли;
	
	ИмяМакета = "СтатусОтчетПоПроекту";
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		ТабличныйДокумент = ПечатьСтатусОтчетПоПроекту(МассивОбъектов, ОбъектыПечати);
		СинонимМакета = НСтр("ru = 'Статус отчет по проекту'");
		ПолныйПутьКМакету = ПолныйПутьКМакету("ПФ_MXL_СтатусОтчетПоПроекту");
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			СинонимМакета,
			ТабличныйДокумент,
			,
			ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Детальный статус-отчет
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.упоСтатусОтчетПоПроекту";
	КомандаПечати.Идентификатор = "ДетальныйСтатусОтчет";
	КомандаПечати.Представление = НСтр("ru = 'Детальный статус-отчет'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	 	 
	
	// Детальный статус-отчет
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.упоСтатусОтчетПоПроекту";
	КомандаПечати.Идентификатор = "СтатусОтчетПоПроекту";
	КомандаПечати.Представление = НСтр("ru = 'Статус отчет по проекту'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект, ПустаяСсылка КАК Истина)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоСтатусОтчетПоПроекту);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПечатьДетальныйСтатусОтчет(МассивОбъектов, ОбъектыПечати = Неопределено) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_ДетальныйСтатусОтчет";
	ТабДок.ОтображатьСетку = Ложь;		
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДок.АвтоМасштаб = Ложь;
	ТабДок.МасштабПечати = 74;
	
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСправа = 0;
	
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу = 0;
	
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Родитель КАК Родитель,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Уровень КАК УровеньДерева,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаПредставление КАК ЗадачаПредставление,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаСсылка КАК ЗадачаСсылка,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.СтатусЗадачи КАК СтатусЗадачи,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Сроки КАК Сроки,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ресурсы КАК Ресурсы,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Бюджеты КАК Бюджеты,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Риски КАК Риски,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.ПроцентВыполненияЗадачи КАК ПроцентВыполненияЗадачи,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.ПроцентДинамики КАК ПроцентДинамики,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ответственный КАК Ответственный,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Комментарий КАК Комментарий,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка КАК Ссылка,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.Дата КАК Дата,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.Номер КАК Номер,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.Проект КАК Проект,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.ТипПроекта КАК ТипПроекта,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.ДатаНачалаПроекта КАК ДатаНачалаПроекта,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.ДатаОкончанияПроекта КАК ДатаОкончанияПроекта,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.КураторПроекта КАК КураторПроекта,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.РуководительПроекта КАК РуководительПроекта,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.ПрограммаПроектов КАК ПрограммаПроектов,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.ПортфельПроектов КАК ПортфельПроектов,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.СтатусПроекта КАК СтатусПроекта,
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка.Проект.упоТекущаяФаза КАК ФазаПроекта,
	               |	Проекты.КодСДР КАК КодСДР
	               |ПОМЕСТИТЬ втДанные
	               |ИЗ
	               |	Документ.упоСтатусОтчетПоПроекту.СтатусЗадач КАК упоСтатусОтчетПоПроектуСтатусЗадач
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаСсылка = Проекты.СсылкаНаПроектнуюЗадачу
	               |ГДЕ
	               |	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка В(&Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втДанные.Родитель КАК Родитель,
	               |	втДанные.УровеньДерева КАК УровеньДерева,
	               |	втДанные.ЗадачаПредставление КАК ЗадачаПредставление,
	               |	втДанные.ЗадачаСсылка КАК ЗадачаСсылка,
	               |	втДанные.КодСДР КАК КодСДР,
	               |	втДанные.СтатусЗадачи КАК СтатусЗадачи,
	               |	втДанные.Сроки КАК Сроки,
	               |	втДанные.Ресурсы КАК Ресурсы,
	               |	втДанные.Бюджеты КАК Бюджеты,
	               |	втДанные.Риски КАК Риски,
	               |	втДанные.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	втДанные.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	втДанные.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	               |	втДанные.ПроцентВыполненияЗадачи КАК ПроцентВыполненияЗадачи,
	               |	втДанные.ПроцентДинамики КАК ПроцентДинамики,
	               |	втДанные.Ответственный КАК Ответственный,
	               |	втДанные.Комментарий КАК Комментарий,
	               |	втДанные.Ссылка КАК Ссылка,
	               |	втДанные.Дата КАК Дата,
	               |	втДанные.Номер КАК Номер,
	               |	втДанные.Проект КАК Проект,
	               |	втДанные.ТипПроекта КАК ТипПроекта,
	               |	втДанные.ДатаНачалаПроекта КАК ДатаНачалаПроекта,
	               |	втДанные.ДатаОкончанияПроекта КАК ДатаОкончанияПроекта,
	               |	втДанные.КураторПроекта КАК КураторПроекта,
	               |	втДанные.РуководительПроекта КАК РуководительПроекта,
	               |	втДанные.ПрограммаПроектов КАК ПрограммаПроектов,
	               |	втДанные.ПортфельПроектов КАК ПортфельПроектов,
	               |	втДанные.СтатусПроекта КАК СтатусПроекта,
	               |	втДанные.ФазаПроекта КАК ФазаПроекта
	               |ИЗ
	               |	втДанные КАК втДанные
	               |ГДЕ
	               |	втДанные.УровеньДерева = 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер,
	               |	УровеньДерева,
	               |	КодСДР
	               |ИТОГИ
	               |	МАКСИМУМ(Дата),
	               |	МАКСИМУМ(Проект),
	               |	МАКСИМУМ(ТипПроекта),
	               |	МАКСИМУМ(ДатаНачалаПроекта),
	               |	МАКСИМУМ(ДатаОкончанияПроекта),
	               |	МАКСИМУМ(КураторПроекта),
	               |	МАКСИМУМ(РуководительПроекта),
	               |	МАКСИМУМ(ПрограммаПроектов),
	               |	МАКСИМУМ(ПортфельПроектов),
	               |	МАКСИМУМ(СтатусПроекта),
	               |	МАКСИМУМ(ФазаПроекта)
	               |ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	втДанные.Родитель КАК Родитель,
	               |	втДанные.УровеньДерева КАК УровеньДерева,
	               |	втДанные.ЗадачаПредставление КАК ЗадачаПредставление,
	               |	втДанные.ЗадачаСсылка КАК ЗадачаСсылка,
	               |	втДанные.КодСДР КАК КодСДР,
	               |	втДанные.СтатусЗадачи КАК СтатусЗадачи,
	               |	втДанные.Сроки КАК Сроки,
	               |	втДанные.Ресурсы КАК Ресурсы,
	               |	втДанные.Бюджеты КАК Бюджеты,
	               |	втДанные.Риски КАК Риски,
	               |	втДанные.ДатаНачалаПлан КАК ДатаНачалаПлан,
	               |	втДанные.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	               |	втДанные.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	               |	втДанные.ПроцентВыполненияЗадачи КАК ПроцентВыполненияЗадачи,
	               |	втДанные.ПроцентДинамики КАК ПроцентДинамики,
	               |	втДанные.Ответственный КАК Ответственный,
	               |	втДанные.Комментарий КАК Комментарий,
	               |	втДанные.Ссылка КАК Ссылка,
	               |	втДанные.Дата КАК Дата,
	               |	втДанные.Номер КАК Номер,
	               |	втДанные.Проект КАК Проект,
	               |	втДанные.ТипПроекта КАК ТипПроекта,
	               |	втДанные.ДатаНачалаПроекта КАК ДатаНачалаПроекта,
	               |	втДанные.ДатаОкончанияПроекта КАК ДатаОкончанияПроекта
	               |ИЗ
	               |	втДанные КАК втДанные
	               |ГДЕ
	               |	втДанные.Родитель <> &РодительПустой
	               |	И втДанные.УровеньДерева > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер,
	               |	УровеньДерева,
	               |	КодСДР";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.УстановитьПараметр("РодительПустой", Документы.упоСтатусОтчетПоПроекту.ПустаяСсылка());
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();		
	// 1: корневые
	// 2: дочерние
	Выборка = ПакетЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	тДочерние = ПакетЗапроса[2].Выгрузить();
	
	//
	
	Макет = МакетПечатнойФормы("ПФ_MXL_ДетальныйСтатусОтчет");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаОтчета = Макет.ПолучитьОбласть("ШапкаОтчета");	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьРасшифровкаСемафора = Макет.ПолучитьОбласть("РасшифровкаСемафора");
	//
	
	ИконкиСтатусовКолонок = ИконкиСтатусовКолонок();
	
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("тДочерние", тДочерние);
	ПараметрыВывода.Вставить("ТабДок", ТабДок);
	ПараметрыВывода.Вставить("Область", ОбластьСтрокаТаблицы);
	ПараметрыВывода.Вставить("ИконкиСтатусовКолонок", ИконкиСтатусовКолонок);
	
	//
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		// шапка 
		
		ОбластьШапкаОтчета.Параметры.Заполнить(Выборка);
		ОбластьШапкаОтчета.Параметры.ДатаНачалаПроекта = Формат(Выборка.ДатаНачалаПроекта, "ДФ=dd.MM.yyyy");
		ОбластьШапкаОтчета.Параметры.ДатаОкончанияПроекта = Формат(Выборка.ДатаОкончанияПроекта, "ДФ=dd.MM.yyyy");
		ОбластьШапкаОтчета.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		
		Если Не ЗначениеЗаполнено(Выборка.ФазаПроекта) Тогда
			ОбластьШапкаОтчета.Параметры.ФазаПроекта = НСтр("ru = 'Стартовая'");	
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьШапкаОтчета);
		
		// таблица
		
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		
		ТабДок.ФиксацияСверху = ТабДок.ВысотаТаблицы;
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		
		ВыборкаКорневые = Выборка.Выбрать();
		Пока ВыборкаКорневые.Следующий() Цикл 
			ВывестиДерево(ВыборкаКорневые, ВыборкаКорневые.УровеньДерева, ПараметрыВывода);
		КонецЦикла; 
		
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
	КонецЦикла; 	
	
	Для Каждого КлючЗначение Из ИконкиСтатусовКолонок Цикл 
		Искать = Истина;
		
		Пока Искать Цикл 			
			Ячейка = ТабДок.НайтиТекст("##"+КлючЗначение.Ключ+"##");
			
			Если Ячейка = Неопределено Тогда 
				Искать = Ложь;
			Иначе
				Ячейка.Текст = "";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//
	
	ТабДок.Вывести(ОбластьРасшифровкаСемафора);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьСтатусОтчетПоПроекту(МассивОбъектов, ОбъектыПечати = Неопределено) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_СтатусОтчетПоПроекту";
	ТабДок.ОтображатьСетку = Ложь;	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСлева = 3; // Посчитано опытным путем.
	ТабДок.ПолеСправа = 0;
	
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу = 0; 
	
	//
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусОтчетПоПроекту.Ссылка КАК Ссылка,
	               |	упоСтатусОтчетПоПроекту.Дата КАК Дата,
	               |	упоСтатусОтчетПоПроекту.Проект КАК Проект,
	               |	упоСтатусОтчетПоПроекту.КураторПроекта КАК КураторПроекта,
	               |	упоСтатусОтчетПоПроекту.РуководительПроекта КАК РуководительПроекта,
	               |	упоСтатусОтчетПоПроекту.Организация КАК Организация,
	               |	упоСтатусОтчетПоПроекту.БизнесЕдиница КАК БизнесЕдиница,
	               |	упоСтатусОтчетПоПроекту.ТипПроекта КАК ТипПроекта,
	               |	упоСтатусОтчетПоПроекту.ПортфельПроектов КАК ПортфельПроектов,
	               |	упоСтатусОтчетПоПроекту.ПрограммаПроектов КАК ПрограммаПроектов,
	               |	упоСтатусОтчетПоПроекту.ДатаНачалаПроекта КАК ДатаНачалаПроекта,
	               |	упоСтатусОтчетПоПроекту.ДатаОкончанияПроекта КАК ДатаОкончанияПроекта,
	               |	упоСтатусОтчетПоПроекту.ПроцентГотовностиПроекта КАК ПроцентГотовностиПроекта,
	               |	упоСтатусОтчетПоПроекту.СтатусПроекта КАК СтатусПроекта,
	               |	упоСтатусОтчетПоПроекту.КраткийСтатусПроекта КАК КраткийСтатусПроекта,
	               |	упоСтатусОтчетПоПроекту.Проект.упоТекущаяФаза КАК ФазаПроекта
	               |ИЗ
	               |	Документ.упоСтатусОтчетПоПроекту КАК упоСтатусОтчетПоПроекту
	               |ГДЕ
	               |	упоСтатусОтчетПоПроекту.Ссылка В(&Ссылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоСтатусОтчетПоПроекту.Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Вопросы.Ссылка КАК Ссылка,
	               |	Вопросы.ТипВопроса КАК ТипВопроса,
	               |	Вопросы.Вопрос КАК Вопрос,
	               |	Вопросы.Описание КАК Описание,
	               |	Вопросы.Решения КАК Решения,
	               |	Вопросы.Статус КАК Статус,
	               |	Вопросы.Срок КАК Срок,
	               |	Вопросы.Ответственный КАК Ответственный,
	               |	Вопросы.Комментарий КАК Комментарий
	               |ИЗ
	               |	Документ.упоСтатусОтчетПоПроекту.Вопросы КАК Вопросы
	               |ГДЕ
	               |	Вопросы.Ссылка В(&Ссылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипВопроса
	               |ИТОГИ ПО
	               |	Ссылка,
	               |	ТипВопроса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗадачиАктивности.Ссылка КАК Ссылка,
	               |	ЗадачиАктивности.ТипВопроса КАК ТипВопроса,
	               |	ЗадачиАктивности.Вопрос КАК Вопрос,
	               |	ЗадачиАктивности.Комментарий КАК Комментарий
	               |ИЗ
	               |	Документ.упоСтатусОтчетПоПроекту.ЗадачиАктивности КАК ЗадачиАктивности
	               |ГДЕ
	               |	ЗадачиАктивности.Ссылка В(&Ссылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипВопроса
	               |ИТОГИ ПО
	               |	Ссылка,
	               |	ТипВопроса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусОтчетПоПроектуРиски.Ссылка КАК Ссылка,
	               |	упоСтатусОтчетПоПроектуРиски.Риск КАК Риск,
	               |	упоСтатусОтчетПоПроектуРиски.ТипРиска КАК ТипРиска,
	               |	упоСтатусОтчетПоПроектуРиски.Последствия КАК Последствия,
	               |	упоСтатусОтчетПоПроектуРиски.ТипРеакции КАК ТипРеакции,
	               |	упоСтатусОтчетПоПроектуРиски.Вероятность КАК Вероятность,
	               |	упоСтатусОтчетПоПроектуРиски.Действия КАК Действия,
	               |	упоСтатусОтчетПоПроектуРиски.Статус КАК Риски,
	               |	упоСтатусОтчетПоПроектуРиски.Ответственный КАК Ответственный
	               |ИЗ
	               |	Документ.упоСтатусОтчетПоПроекту.Риски КАК упоСтатусОтчетПоПроектуРиски
	               |ГДЕ
	               |	упоСтатусОтчетПоПроектуРиски.Ссылка В(&Ссылка)
	               |ИТОГИ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСтатусОтчетПоПроекту.Ссылка КАК Ссылка,
	               |	упоСтатусОтчетПоПроекту.СрокиСводно КАК Сроки,
	               |	упоСтатусОтчетПоПроекту.РесурсыСводно КАК Ресурсы,
	               |	упоСтатусОтчетПоПроекту.БюджетыСводно КАК Бюджеты,
	               |	упоСтатусОтчетПоПроекту.РискиСводно КАК Риски
	               |ИЗ
	               |	Документ.упоСтатусОтчетПоПроекту КАК упоСтатусОтчетПоПроекту
	               |ИТОГИ ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	// 0: реквизиты шапки
	// 1: вопросы
	// 2: риски
	// 3: сводный статус
	
	ВыборкаДокументы = ПакетЗапроса[0].Выбрать();
	ВыборкаВопросы = ПакетЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаАктивности = ПакетЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРиски = ПакетЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСводныйСтатус = ПакетЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//
	
	Макет = МакетПечатнойФормы("ПФ_MXL_СтатусОтчетПоПроекту");
	
	ИконкиСтатусовКолонок = ИконкиСтатусовКолонок();
	
	СтруктураОбластей = Новый Структура; 
	СтруктураОбластей.Вставить("Заголовок", Макет.ПолучитьОбласть("Заголовок") );
	СтруктураОбластей.Вставить("ШапкаОтчета", Макет.ПолучитьОбласть("ШапкаОтчета") );
	СтруктураОбластей.Вставить("СводныйСтатус", Макет.ПолучитьОбласть("СводныйСтатус") );
	СтруктураОбластей.Вставить("ШапкаБлижайшиеЗадачи", Макет.ПолучитьОбласть("ШапкаБлижайшиеЗадачи") );
	СтруктураОбластей.Вставить("СтрокаБлижайшиеЗадачи", Макет.ПолучитьОбласть("СтрокаБлижайшиеЗадачи") );
	СтруктураОбластей.Вставить("ШапкаВопросыНаКонтроле", Макет.ПолучитьОбласть("ШапкаВопросыНаКонтроле") );
	СтруктураОбластей.Вставить("СтрокаВопросыНаКонтроле", Макет.ПолучитьОбласть("СтрокаВопросыНаКонтроле") );
	СтруктураОбластей.Вставить("ШапкаВопросыТребующиеРешения", Макет.ПолучитьОбласть("ШапкаВопросыТребующиеРешения") );
	СтруктураОбластей.Вставить("СтрокаВопросыТребующиеРешения", Макет.ПолучитьОбласть("СтрокаВопросыТребующиеРешения") );
	СтруктураОбластей.Вставить("ШапкаРиски", Макет.ПолучитьОбласть("ШапкаРиски") );
	СтруктураОбластей.Вставить("СтрокаРиски", Макет.ПолучитьОбласть("СтрокаРиски") );
	
	стОбластиВопросов = Новый Структура; 
	стОбластиВопросов.Вставить("ВопросыНаКонтроле", 2);
	стОбластиВопросов.Вставить("ВопросыТребующиеРешения", 0);	
	
	//
	
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("ИконкиСтатусовКолонок ", ИконкиСтатусовКолонок);
	
	//
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока ВыборкаДокументы.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ОтборПоДокументу = Новый Структура("Ссылка", ВыборкаДокументы.Ссылка);
		
		ВыборкаВопросы.Сбросить();
		ВыборкаТипВопроса = Неопределено;
		ВыборкаТипВопросаАктивностей = Неопределено;
		ВыборкаСводныйСтатус.Сбросить();
		ВыборкаРиски.Сбросить();
		
		ЕстьВопросы = ВыборкаВопросы.НайтиСледующий(ОтборПоДокументу);
		Если ЕстьВопросы Тогда 
			ВыборкаТипВопроса = ВыборкаВопросы.Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам )
		КонецЕсли;
		ЕстьАктивности = ВыборкаАктивности.НайтиСледующий(ОтборПоДокументу);
		Если ЕстьАктивности Тогда 
			ВыборкаТипВопросаАктивностей = ВыборкаАктивности.Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам )
		КонецЕсли;
		ЕстьСводныйСтатус = ВыборкаСводныйСтатус.НайтиСледующий(ОтборПоДокументу);
		ЕстьРиски = ВыборкаРиски.НайтиСледующий(ОтборПоДокументу);
		
		// Заголовок.
		
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Заголовок" );
		ТабДок.Вывести(Область);
		
		// Шапка.
		
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "ШапкаОтчета" );
		Область.Параметры.Заполнить(ВыборкаДокументы);
		Область.Параметры.ДатаНачалаПроекта = Формат(ВыборкаДокументы.ДатаНачалаПроекта, "ДФ=dd.MM.yyyy");
		Область.Параметры.ДатаОкончанияПроекта = Формат(ВыборкаДокументы.ДатаОкончанияПроекта, "ДФ=dd.MM.yyyy");
		Область.Параметры.Дата = Формат(ВыборкаДокументы.Дата, "ДФ=dd.MM.yyyy");
		
		Если Не ЗначениеЗаполнено(ВыборкаДокументы.ФазаПроекта) Тогда
			Область.Параметры.ФазаПроекта = НСтр("ru = 'Стартовая'");	
		КонецЕсли;
		
		ТабДок.Вывести(Область);
		
		// Сводный статус.
		
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "СводныйСтатус" );
		Область.Параметры.Заполнить(ВыборкаДокументы);
				
		Если ЕстьСводныйСтатус Тогда 
			Выборка = ВыборкаСводныйСтатус.Выбрать();
			Выборка.Следующий();
			
			ПодставитьКартинку(Выборка, Область, "Сроки", ПараметрыВывода);
			ПодставитьКартинку(Выборка, Область, "Ресурсы", ПараметрыВывода);
			ПодставитьКартинку(Выборка, Область, "Бюджеты", ПараметрыВывода);
			ПодставитьКартинку(Выборка, Область, "Риски", ПараметрыВывода);
		КонецЕсли;
				
		ТабДок.Вывести(Область);
		
		Для Каждого КлючЗначение Из ИконкиСтатусовКолонок Цикл 
			Искать = Истина;
			
			Пока Искать Цикл
				Ячейка = ТабДок.НайтиТекст("##"+КлючЗначение.Ключ+"##");
				
				Если Ячейка = Неопределено Тогда 
					Искать = Ложь;
				Иначе
					Ячейка.Текст = ?(ЕстьСводныйСтатус, Выборка[КлючЗначение.Ключ], "") ;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		
		// Активности.
		
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "ШапкаБлижайшиеЗадачи");
		ТабДок.Вывести(Область);
		
		Если ЕстьАктивности Тогда 
			соотТекст = Новый Соответствие; 
			соотТекст.Вставить(4, ""); // ТекстВыполненные
			соотТекст.Вставить(1, ""); // ТекстВыполняемые
			соотТекст.Вставить(3, ""); // ТекстЗапланированные
			
			Для Каждого ЭлТекст Из соотТекст Цикл 
				
				Текст = соотТекст.Получить(ЭлТекст.Ключ);
				
				ВыборкаТипВопросаАктивностей.Сбросить();
				Если ВыборкаТипВопросаАктивностей.НайтиСледующий( Новый Структура("ТипВопроса", ЭлТекст.Ключ) ) Тогда
					сч = 1;
					Выборка = ВыборкаТипВопросаАктивностей.Выбрать();
					
					Пока Выборка.Следующий() Цикл 
						Текст = Текст + "" + сч + ". " + Выборка.Вопрос + Символы.ПС;
						сч = сч + 1; 
					КонецЦикла; 
					
					соотТекст[ЭлТекст.Ключ] = Текст;
				КонецЕсли;
			КонецЦикла;
			
			Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "СтрокаБлижайшиеЗадачи");
			Область.Параметры.ТекстВыполненные = соотТекст.Получить(4);
			Область.Параметры.ТекстВыполняемые = соотТекст.Получить(1);
			Область.Параметры.ТекстЗапланированные = соотТекст.Получить(3);
			ТабДок.Вывести(Область);
		КонецЕсли;
		
		
		// Вопросы.
		
		Для Каждого ЭлОбласть Из стОбластиВопросов Цикл
			ИмяОбласти = ЭлОбласть.Ключ;
			
			Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Шапка" + ИмяОбласти);
			ТабДок.Вывести(Область);
			
			Если ЕстьВопросы Тогда 
				ВыборкаТипВопроса.Сбросить();
				Если ВыборкаТипВопроса.НайтиСледующий( Новый Структура("ТипВопроса", ЭлОбласть.Значение) ) Тогда
					Выборка = ВыборкаТипВопроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл 
						Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Строка" + ИмяОбласти);
						Область.Параметры.Заполнить(Выборка);
						
						Если ИмяОбласти = "ВопросыНаКонтроле" Тогда 
							ПодставитьКартинку(Выборка, Область, "ВопросыНаКонтроле", ПараметрыВывода, "Статус");
						КонецЕсли;
						
						ТабДок.Вывести(Область);
					КонецЦикла; 
				КонецЕсли;
			Иначе
				// Выведем пустую.
				Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Строка" + ИмяОбласти);
				ТабДок.Вывести(Область);
			КонецЕсли;
			
		КонецЦикла;
		
		// Риски.
		ИмяОбласти = "Риски";
		
		Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Шапка" + ИмяОбласти);
		ТабДок.Вывести(Область);
		
		Если ЕстьРиски Тогда 
			Выборка = ВыборкаРиски.Выбрать();
			
			Пока Выборка.Следующий() Цикл  
				Область = ПолучитьОбластьПоИмени(СтруктураОбластей, "Строка" + ИмяОбласти);
				Область.Параметры.Заполнить(Выборка);
				ПодставитьКартинку(Выборка, Область, "Риски", ПараметрыВывода);
				ТабДок.Вывести(Область);
			КонецЦикла; 
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ИконкиСтатусовКолонок Цикл 
		Искать = Истина;
		
		Пока Искать Цикл
			Ячейка = ТабДок.НайтиТекст("##"+КлючЗначение.Ключ+"##");
			
			Если Ячейка = Неопределено Тогда 
				Искать = Ложь;
			Иначе
				Ячейка.Текст = "";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	Возврат ТабДок;
	
КонецФункции

Функция ИконкиСтатусовКолонок() Экспорт
	
	ИконкиСтатусовКолонок = Новый Структура; 
	
	//
	
	Сроки = Новый Соответствие;
	Сроки.Вставить(Перечисления.упоСтатусОтчетыСтатусыСроков.План, БиблиотекаКартинок.упоСтатусБелый);
	Сроки.Вставить(Перечисления.упоСтатусОтчетыСтатусыСроков.Выполнено, БиблиотекаКартинок.упоСтатусЗеленый);
	Сроки.Вставить(Перечисления.упоСтатусОтчетыСтатусыСроков.ПоГрафику, БиблиотекаКартинок.упоСтатусСветлоЗеленый);
	Сроки.Вставить(Перечисления.упоСтатусОтчетыСтатусыСроков.Задержка, БиблиотекаКартинок.упоСтатусЖелтый);
	Сроки.Вставить(Перечисления.упоСтатусОтчетыСтатусыСроков.Срыв, БиблиотекаКартинок.упоСтатусКрасный); 
	
	ИконкиСтатусовКолонок.Вставить("Сроки", Сроки);
	
	//
	
	Ресурсы = Новый Соответствие;
	Ресурсы.Вставить(Перечисления.упоСтатусОтчетыСтатусыРесурсов.План, БиблиотекаКартинок.упоСтатусБелый);
	Ресурсы.Вставить(Перечисления.упоСтатусОтчетыСтатусыРесурсов.Освобождены, БиблиотекаКартинок.упоСтатусЗеленый);
	Ресурсы.Вставить(Перечисления.упоСтатусОтчетыСтатусыРесурсов.Выделены, БиблиотекаКартинок.упоСтатусСветлоЗеленый);
	Ресурсы.Вставить(Перечисления.упоСтатусОтчетыСтатусыРесурсов.Мало, БиблиотекаКартинок.упоСтатусЖелтый);
	Ресурсы.Вставить(Перечисления.упоСтатусОтчетыСтатусыРесурсов.Критично, БиблиотекаКартинок.упоСтатусКрасный);
	
	ИконкиСтатусовКолонок.Вставить("Ресурсы", Ресурсы);
	
	//
	
	Бюджеты = Новый Соответствие;
	Бюджеты.Вставить(Перечисления.упоСтатусОтчетыСтатусыБюджетов.План, БиблиотекаКартинок.упоСтатусБелый);
	Бюджеты.Вставить(Перечисления.упоСтатусОтчетыСтатусыБюджетов.Освоены, БиблиотекаКартинок.упоСтатусЗеленый);
	Бюджеты.Вставить(Перечисления.упоСтатусОтчетыСтатусыБюджетов.ПоГрафику, БиблиотекаКартинок.упоСтатусСветлоЗеленый);
	Бюджеты.Вставить(Перечисления.упоСтатусОтчетыСтатусыБюджетов.Отклонения, БиблиотекаКартинок.упоСтатусЖелтый);
	Бюджеты.Вставить(Перечисления.упоСтатусОтчетыСтатусыБюджетов.НеИсполняется, БиблиотекаКартинок.упоСтатусКрасный);
	
	ИконкиСтатусовКолонок.Вставить("Бюджеты", Бюджеты);
	
	//
	
	Риски = Новый Соответствие;
	Риски.Вставить(Перечисления.упоСтатусОтчетыСтатусыРисков.НеЗаявлены, БиблиотекаКартинок.упоСтатусБелый);
	Риски.Вставить(Перечисления.упоСтатусОтчетыСтатусыРисков.Закрыты, БиблиотекаКартинок.упоСтатусЗеленый);
	Риски.Вставить(Перечисления.упоСтатусОтчетыСтатусыРисков.НеАктуальны, БиблиотекаКартинок.упоСтатусСветлоЗеленый);
	Риски.Вставить(Перечисления.упоСтатусОтчетыСтатусыРисков.Актуальны, БиблиотекаКартинок.упоСтатусЖелтый);
	Риски.Вставить(Перечисления.упоСтатусОтчетыСтатусыРисков.Сработали, БиблиотекаКартинок.упоСтатусКрасный);
	
	//
	
	ИконкиСтатусовКолонок.Вставить("Риски", Риски);	
	
	ВопросыНаКонтроле = Новый Соответствие;	
	ВопросыНаКонтроле.Вставить(Перечисления.упоСтатусОтчетыСтатусыВопросов.Выполнено, БиблиотекаКартинок.упоСтатусЗеленый);
	ВопросыНаКонтроле.Вставить(Перечисления.упоСтатусОтчетыСтатусыВопросов.ПоГрафику, БиблиотекаКартинок.упоСтатусСветлоЗеленый);
	ВопросыНаКонтроле.Вставить(Перечисления.упоСтатусОтчетыСтатусыВопросов.Задержка, БиблиотекаКартинок.упоСтатусЖелтый);
	ВопросыНаКонтроле.Вставить(Перечисления.упоСтатусОтчетыСтатусыВопросов.Срыв, БиблиотекаКартинок.упоСтатусКрасный);	
	
	ИконкиСтатусовКолонок.Вставить("ВопросыНаКонтроле", ВопросыНаКонтроле);
	
	//
	
	Возврат ИконкиСтатусовКолонок;
	
КонецФункции

#Область СведенияОПроекте

Процедура ЗаполнитьСведенияОПроекте(Объект) Экспорт

	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Организация КАК Организация,
	|	Проекты.Подразделение КАК БизнесЕдиница,
	|	Проекты.ПортфельПроектов КАК ПортфельПроектов,
	|	Проекты.ТипПроекта КАК ТипПроекта,
	|	Проекты.ПрограммаПроектов КАК ПрограммаПроектов,
	|	Проекты.упоЦельПроекта КАК ЦельПроекта,
	|	Статусы.СтатусПроекта КАК СтатусПроекта,
	|	Готовность.ПроцентГотовности КАК ПроцентГотовностиПроекта,
	|	Рукли.КураторПроекта КАК КураторПроекта,
	|	Рукли.РуководительПроекта КАК РуководительПроекта,
	|	ПрогнозныеСрокиПроектов.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
	|	ПрогнозныеСрокиПроектов.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	|	ПрогнозныеСрокиПроектов.СтатусСроков КАК СтатусСроков
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Статусы
	|		ПО Проекты.Ссылка = Статусы.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектов.СрезПоследних(
	|				,
	|				Версия = &Версия
	|					И Проект = &Проект) КАК Готовность
	|		ПО Проекты.Ссылка = Готовность.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК Рукли
	|		ПО Проекты.Ссылка = Рукли.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПрогнозныеСрокиПроектов.СрезПоследних(, Версия = &Версия) КАК ПрогнозныеСрокиПроектов
	|		ПО Проекты.Ссылка = ПрогнозныеСрокиПроектов.Проект
	|ГДЕ
	|	Проекты.Ссылка = &Проект");
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	Запрос.УстановитьПараметр("Версия", ТекВерсия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	КонецЕсли;
	
	СрокиПроекта = упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроекта(Объект.Проект, ТекВерсия);
	Объект.ДатаНачалаПроекта = СрокиПроекта.ДатаНачалаПлан;
	Объект.ДатаОкончанияПроекта = СрокиПроекта.ДатаЗавершенияПлан;
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаДляЗаполненияПоПроекту() 
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(Сроки.ДатаНачалаПлан) КАК ДатаНачалаПлан,
	|	МАКСИМУМ(Сроки.ДатаЗавершенияПлан) КАК ДатаЗавершенияПлан
	|ПОМЕСТИТЬ ВТ_СрокиПроекта
	|ИЗ
	|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК Сроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ПО Сроки.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска0
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска1
	|				ТОГДА 1
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска2
	|				ТОГДА 2
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска3
	|				ТОГДА 3
	|			ИНАЧЕ 4
	|		КОНЕЦ) КАК МаксимальныйСтатус,
	|	упоРискиПроектов.Владелец КАК Проект
	|ПОМЕСТИТЬ ВТ_Риски
	|ИЗ
	|	Справочник.упоРискиПроектов КАК упоРискиПроектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыРисковПроектов.СрезПоследних КАК упоСтатусыРисковПроектовСрезПоследних
	|		ПО (упоСтатусыРисковПроектовСрезПоследних.Риск = упоРискиПроектов.Ссылка)
	|ГДЕ
	|	упоРискиПроектов.Владелец = &Проект
	|	И НЕ упоРискиПроектов.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	упоРискиПроектов.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Организация КАК Организация,
	|	Проекты.Подразделение КАК БизнесЕдиница,
	|	Проекты.ПортфельПроектов КАК ПортфельПроектов,
	|	Проекты.ТипПроекта КАК ТипПроекта,
	|	Проекты.ПрограммаПроектов КАК ПрограммаПроектов,
	|	Проекты.упоЦельПроекта КАК ЦельПроекта,
	|	Статусы.СтатусПроекта КАК Статус,
	|	Готовность.ПроцентГотовности КАК ПроцентГотовностиПроекта,
	|	Рукли.КураторПроекта КАК КураторПроекта,
	|	Рукли.РуководительПроекта КАК РуководительПроекта,
	|	ВТ_СрокиПроекта.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ВТ_СрокиПроекта.ДатаЗавершенияПлан КАК ДатаОкончанияПлан,
	|	ПрогнозныеСрокиПроектов.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
	|	ПрогнозныеСрокиПроектов.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	|	ПрогнозныеСрокиПроектов.СтатусСроков КАК Сроки,
	|	Проекты.Комментарий КАК Комментарий,
	|	Проекты.Объект КАК Объект,
	|	Проекты.упоТекущаяФаза КАК Фаза,
	|	НЕОПРЕДЕЛЕНО КАК Бюджеты,
	|	НЕОПРЕДЕЛЕНО КАК Ресурсы,
	|	ВЫБОР
	|		КОГДА ВТ_Риски.Проект ЕСТЬ NULL
	|			ТОГДА &СостояниеРискаISNULL
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 0
	|			ТОГДА &СостояниеРиска0
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 1
	|			ТОГДА &СостояниеРиска1
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 2
	|			ТОГДА &СостояниеРиска2
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 3
	|			ТОГДА &СостояниеРиска3
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 4
	|			ТОГДА &СостояниеРискаПрочее
	|	КОНЕЦ КАК Риски
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Статусы
	|		ПО Проекты.Ссылка = Статусы.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектов.СрезПоследних(
	|				,
	|				Версия = &Версия
	|					И Проект = &Проект) КАК Готовность
	|		ПО Проекты.Ссылка = Готовность.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК Рукли
	|		ПО Проекты.Ссылка = Рукли.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиПроекта КАК ВТ_СрокиПроекта
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПрогнозныеСрокиПроектов.СрезПоследних(, Версия = &Версия) КАК ПрогнозныеСрокиПроектов
	|		ПО Проекты.Ссылка = ПрогнозныеСрокиПроектов.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Риски КАК ВТ_Риски
	|		ПО (ВТ_Риски.Проект = Проекты.Ссылка)
	|ГДЕ
	|	Проекты.Ссылка = &Проект";
	
КонецФункции

Функция ПолучитьТекстЗапросаДляЗаполненияПоСтатусОтчету()
	
	Возврат 
	"ВЫБРАТЬ
	|	Проекты.упоТекущаяФаза КАК Фаза,
	|	упоСтатусОтчетПоПроекту.СтатусПроекта КАК Статус,
	|	упоСтатусОтчетПоПроекту.СрокиСводно КАК Сроки,
	|	упоСтатусОтчетПоПроекту.РесурсыСводно КАК Ресурсы,
	|	упоСтатусОтчетПоПроекту.БюджетыСводно КАК Бюджеты,
	|	упоСтатусОтчетПоПроекту.РискиСводно КАК Риски,
	|	упоСтатусОтчетПоПроекту.ДатаНачалаПроекта КАК ДатаНачалаПлан,
	|	упоСтатусОтчетПоПроекту.ДатаОкончанияПроекта КАК ДатаОкончанияПлан,
	|	упоСтатусОтчетПоПроекту.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
	|	упоСтатусОтчетПоПроекту.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	|	упоСтатусОтчетПоПроекту.КураторПроекта КАК КураторПроекта,
	|	упоСтатусОтчетПоПроекту.РуководительПроекта КАК РуководительПроекта,
	|	Проекты.Объект КАК Объект,
	|	упоСтатусОтчетПоПроекту.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.упоСтатусОтчетПоПроекту КАК упоСтатусОтчетПоПроекту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО упоСтатусОтчетПоПроекту.Проект = Проекты.Ссылка
	|ГДЕ
	|	упоСтатусОтчетПоПроекту.Ссылка = &СтатусОтчет";
	
КонецФункции

Процедура ЗаполнитьСведенияОПроектеВСводном(ЭтаФорма) Экспорт

	ТекДанные = ЭтаФорма.Объект.Проекты.НайтиПоИдентификатору(ЭтаФорма.Элементы.Проекты.ТекущаяСтрока);
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Проект = ТекДанные.Проект;
	СтатусОтчет = ТекДанные.СтатусОтчет;	
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(СтатусОтчет) Тогда
		Запрос.Текст = ПолучитьТекстЗапросаДляЗаполненияПоСтатусОтчету();
		Запрос.УстановитьПараметр("СтатусОтчет", СтатусОтчет);
	Иначе
		Запрос.Текст = ПолучитьТекстЗапросаДляЗаполненияПоПроекту();
		УстановитьПараметрыСтатусовРисковВЗапрос(Запрос);
		Запрос.УстановитьПараметр("Проект", Проект);
		ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
		Запрос.УстановитьПараметр("Версия", ТекВерсия);
	КонецЕсли;		
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, Выборка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДопДанныеДереваПЗ

Процедура ДополнитьДеревоЗадачНаФормеДопДанными(ЭтаФорма) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.Проект) Тогда      
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаДанныхКолонокПроектныхЗадач();
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ЭтаФорма.Объект.Проект));
	Запрос.УстановитьПараметр("Проект", ЭтаФорма.Объект.Проект);
	УстановитьПараметрыСтатусовРисковВЗапрос(Запрос);

	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда      
		Возврат;
	КонецЕсли; 
		
	ДеревоЗадачОбъект = ЭтаФорма.РеквизитФормыВЗначение("ДеревоЗадач");
	СтрокиДерева = ДеревоЗадачОбъект.Строки;
	                                  
	Поля = Новый Структура; 
	Поля.Вставить("ДатаНачалаПлан", "ДатаНачалаПлан");
	Поля.Вставить("ДатаОкончанияПлан", "ДатаЗавершенияПлан");
	Поля.Вставить("Сроки", "СтатусСроков");
	Поля.Вставить("Риски", "Риски");
	Поля.Вставить("ДатаНачалаПрогноз", "ДатаНачалаПрогноз");
	Поля.Вставить("ДатаЗавершенияПрогноз", "ДатаЗавершенияПрогноз");
	Поля.Вставить("Ответственный", "Ответственный");
	Поля.Вставить("ПроцентДинамики", "Динамика");
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗапроса Цикл 		
		
		ПараметрыОтбора = Новый Структура("ЗадачаСсылка", СтрокаТаблицы.ПроектнаяЗадача);		
		Найдено = СтрокиДерева.НайтиСтроки(ПараметрыОтбора, Истина);
		
		Если Найдено.Количество() > 0 Тогда 
			НайденнаяСтрока = Найдено[0];
			
			Для Каждого КЗ Из Поля Цикл 
				НайденнаяСтрока[КЗ.Ключ] = СтрокаТаблицы[КЗ.Значение];
			КонецЦикла;  
					
		КонецЕсли; 
	КонецЦикла;	 
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ДеревоЗадачОбъект, "ДеревоЗадач");    	
	
КонецПроцедуры

Процедура ДополнитьДеревоЗадачСводногоНаФормеДопДанными(ЭтаФорма) Экспорт
		
	МассивПроектов = Новый Массив;
	Для Каждого СтрокаПроекта Из ЭтаФорма.Объект.Проекты Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаПроекта.Проект) Тогда
			Продолжить;
		КонецЕсли;
		МассивПроектов.Добавить(СтрокаПроекта.Проект);
	КонецЦикла;
	
	Если МассивПроектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапросаСводногоДанныхКолонокПроектныхЗадач();
	Запрос.УстановитьПараметр("Проекты", МассивПроектов);
	Запрос.УстановитьПараметр("ДокументОснование", Неопределено);
	УстановитьПараметрыСтатусовРисковВЗапрос(Запрос);

	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда      
		Возврат;
	КонецЕсли; 
		
	ДеревоЗадачОбъект = ЭтаФорма.РеквизитФормыВЗначение("ДеревоЗадач");
	СтрокиДерева = ДеревоЗадачОбъект.Строки;
	                                  
	Поля = Новый Структура; 
	Поля.Вставить("ДатаНачалаПлан", "ДатаНачалаПлан");
	Поля.Вставить("ДатаОкончанияПлан", "ДатаЗавершенияПлан");
	Поля.Вставить("ПроцентВыполненияЗадачи", "ПроцентГотовности");
	Поля.Вставить("СтатусЗадачи", "СтатусЗадачи");
	Поля.Вставить("Сроки", "СтатусСроков");
	Поля.Вставить("Риски", "Риски");
	Поля.Вставить("ДатаНачалаПрогноз", "ДатаНачалаПрогноз");
	Поля.Вставить("ДатаЗавершенияПрогноз", "ДатаЗавершенияПрогноз");
	Поля.Вставить("Ответственный", "Ответственный");
	Поля.Вставить("ПроцентДинамики", "Динамика");
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗапроса Цикл 		
		
		ПараметрыОтбора = Новый Структура("ЗадачаСсылка", СтрокаТаблицы.ПроектнаяЗадача);		
		Найдено = СтрокиДерева.НайтиСтроки(ПараметрыОтбора, Истина);
		
		Если Найдено.Количество() > 0 Тогда 
			НайденнаяСтрока = Найдено[0];
			
			Для Каждого КЗ Из Поля Цикл 
				НайденнаяСтрока[КЗ.Ключ] = СтрокаТаблицы[КЗ.Значение];
			КонецЦикла;  
					
		КонецЕсли; 
	КонецЦикла;	 
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ДеревоЗадачОбъект, "ДеревоЗадач");    	
	
КонецПроцедуры

Функция ТекстЗапросаДанныхКолонокПроектныхЗадач()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСвойства.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ВТ_Задачи
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвойства
	|ГДЕ
	|	НЕ РегСвойства.ЗадачаОтменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска0
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска1
	|				ТОГДА 1
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска2
	|				ТОГДА 2
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска3
	|				ТОГДА 3
	|			ИНАЧЕ 4
	|		КОНЕЦ) КАК МаксимальныйСтатус,
	|	упоРискиПроектов.Владелец КАК Проект,
	|	упоСвойстваРисковПроектовПланСрезПоследних.СвязанСПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК СвязанСПроектнаяЗадача
	|ПОМЕСТИТЬ ВТ_Риски
	|ИЗ
	|	Справочник.упоРискиПроектов КАК упоРискиПроектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыРисковПроектов.СрезПоследних КАК упоСтатусыРисковПроектовСрезПоследних
	|		ПО (упоСтатусыРисковПроектовСрезПоследних.Риск = упоРискиПроектов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваРисковПроектовПлан.СрезПоследних КАК упоСвойстваРисковПроектовПланСрезПоследних
	|		ПО (упоСвойстваРисковПроектовПланСрезПоследних.Риск = упоРискиПроектов.Ссылка)
	|ГДЕ
	|	упоРискиПроектов.Владелец = &Проект
	|	И НЕ упоРискиПроектов.ПометкаУдаления
	|	И упоСвойстваРисковПроектовПланСрезПоследних.СвязанСПроектнаяЗадача.СсылкаНаПроектнуюЗадачу В
	|			(ВЫБРАТЬ
	|				ВТ_Задачи.ПроектнаяЗадача
	|			ИЗ
	|				ВТ_Задачи)
	|
	|СГРУППИРОВАТЬ ПО
	|	упоРискиПроектов.Владелец,
	|	упоСвойстваРисковПроектовПланСрезПоследних.СвязанСПроектнаяЗадача.СсылкаНаПроектнуюЗадачу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.СтатусСроков КАК СтатусСроков,
	|	упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
	|	упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	|	ВЫБОР
	|		КОГДА ВТ_Риски.СвязанСПроектнаяЗадача ЕСТЬ NULL
	|			ТОГДА &СостояниеРискаISNULL
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 0
	|			ТОГДА &СостояниеРиска0
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 1
	|			ТОГДА &СостояниеРиска1
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 2
	|			ТОГДА &СостояниеРиска2
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 3
	|			ТОГДА &СостояниеРиска3
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 4
	|			ТОГДА &СостояниеРискаПрочее
	|	КОНЕЦ КАК Риски,
	|	РПЗ.РуководительПроектнойЗадачи КАК Ответственный,
	|	0 КАК Динамика
	|ИЗ
	|	ВТ_Задачи КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоСрокиПроектныхЗадачСрезПоследних
	|		ПО Т.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК упоПрогнозныеСрокиПроектныхЗадачСрезПоследних
	|		ПО Т.ПроектнаяЗадача = упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Риски КАК ВТ_Риски
	|		ПО Т.ПроектнаяЗадача = ВТ_Риски.СвязанСПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РПЗ
	|		ПО Т.ПроектнаяЗадача = РПЗ.ПроектнаяЗадача";
		
КонецФункции

Функция ТекстЗапросаСводногоДанныхКолонокПроектныхЗадач()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоВерсииПроекта.Версия КАК Версия,
	|	упоВерсииПроекта.Проект КАК Проект
	|ПОМЕСТИТЬ ВТ_Версии
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|ГДЕ
	|	упоВерсииПроекта.Проект В(&Проекты)
	|	И упоВерсииПроекта.Текущая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегСвойства.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ ВТ_Задачи
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			,
	|			Версия В
	|				(ВЫБРАТЬ
	|					ВТ_Версии.Версия
	|				ИЗ
	|					ВТ_Версии)) КАК РегСвойства
	|ГДЕ
	|	НЕ РегСвойства.ЗадачаОтменена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска0
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска1
	|				ТОГДА 1
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска2
	|				ТОГДА 2
	|			КОГДА ЕСТЬNULL(упоСтатусыРисковПроектовСрезПоследних.Статус, НЕОПРЕДЕЛЕНО) = &СтатусРиска3
	|				ТОГДА 3
	|			ИНАЧЕ 4
	|		КОНЕЦ) КАК МаксимальныйСтатус,
	|	упоРискиПроектов.Владелец КАК Проект,
	|	упоСвойстваРисковПроектовПланСрезПоследних.СвязанСПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК СвязанСПроектнаяЗадача
	|ПОМЕСТИТЬ ВТ_Риски
	|ИЗ
	|	Справочник.упоРискиПроектов КАК упоРискиПроектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыРисковПроектов.СрезПоследних КАК упоСтатусыРисковПроектовСрезПоследних
	|		ПО (упоСтатусыРисковПроектовСрезПоследних.Риск = упоРискиПроектов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваРисковПроектовПлан.СрезПоследних КАК упоСвойстваРисковПроектовПланСрезПоследних
	|		ПО (упоСвойстваРисковПроектовПланСрезПоследних.Риск = упоРискиПроектов.Ссылка)
	|ГДЕ
	|	НЕ упоРискиПроектов.ПометкаУдаления
	|	И упоСвойстваРисковПроектовПланСрезПоследних.СвязанСПроектнаяЗадача.СсылкаНаПроектнуюЗадачу В
	|			(ВЫБРАТЬ
	|				ВТ_Задачи.ПроектнаяЗадача
	|			ИЗ
	|				ВТ_Задачи)
	|
	|СГРУППИРОВАТЬ ПО
	|	упоРискиПроектов.Владелец,
	|	упоСвойстваРисковПроектовПланСрезПоследних.СвязанСПроектнаяЗадача.СсылкаНаПроектнуюЗадачу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Предыдущий.ЗадачаСсылка КАК ЗадачаСсылка,
	|	Предыдущий.ПроцентВыполненияЗадачи КАК ПроцентВыполненияЗадачи
	|ПОМЕСТИТЬ ВТ_Предыдущий
	|ИЗ
	|	Документ.упоСтатусОтчетПоПроекту.СтатусЗадач КАК Предыдущий
	|ГДЕ
	|	Предыдущий.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	СтатусыЗадач.СтатусЗадачи КАК СтатусЗадачи,
	|	упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.СтатусСроков КАК СтатусСроков,
	|	упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
	|	упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	|	ВЫБОР
	|		КОГДА ВТ_Риски.СвязанСПроектнаяЗадача ЕСТЬ NULL
	|			ТОГДА &СостояниеРискаISNULL
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 0
	|			ТОГДА &СостояниеРиска0
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 1
	|			ТОГДА &СостояниеРиска1
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 2
	|			ТОГДА &СостояниеРиска2
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 3
	|			ТОГДА &СостояниеРиска3
	|		КОГДА ВТ_Риски.МаксимальныйСтатус = 4
	|			ТОГДА &СостояниеРискаПрочее
	|	КОНЕЦ КАК Риски,
	|	РПЗ.РуководительПроектнойЗадачи КАК Ответственный,
	|	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности КАК ПроцентГотовности,
	|	ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) - ЕСТЬNULL(ВТ_Предыдущий.ПроцентВыполненияЗадачи, 0) КАК Динамика
	|ИЗ
	|	ВТ_Задачи КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия В
	|					(ВЫБРАТЬ
	|						ВТ_Версии.Версия
	|					ИЗ
	|						ВТ_Версии)) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
	|		ПО Т.ПроектнаяЗадача = упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия В
	|					(ВЫБРАТЬ
	|						ВТ_Версии.Версия
	|					ИЗ
	|						ВТ_Версии)) КАК упоСрокиПроектныхЗадачСрезПоследних
	|		ПО Т.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия В
	|					(ВЫБРАТЬ
	|						ВТ_Версии.Версия
	|					ИЗ
	|						ВТ_Версии)) КАК упоПрогнозныеСрокиПроектныхЗадачСрезПоследних
	|		ПО Т.ПроектнаяЗадача = упоПрогнозныеСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	|				,
	|				Версия В
	|					(ВЫБРАТЬ
	|						ВТ_Версии.Версия
	|					ИЗ
	|						ВТ_Версии)) КАК СтатусыЗадач
	|		ПО Т.ПроектнаяЗадача = СтатусыЗадач.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Риски КАК ВТ_Риски
	|		ПО Т.ПроектнаяЗадача = ВТ_Риски.СвязанСПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РПЗ
	|		ПО Т.ПроектнаяЗадача = РПЗ.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Предыдущий КАК ВТ_Предыдущий
	|		ПО Т.ПроектнаяЗадача = ВТ_Предыдущий.ЗадачаСсылка";
		
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Функция ПолныйПутьКМакету(ИмяМакета)
	
	ПолныйПутьКМакету = СтрШаблон("Документ.упоСтатусОтчетПоПроекту.%1", ИмяМакета);
	
	Возврат ПолныйПутьКМакету;
	
КонецФункции

Функция МакетПечатнойФормы(ИмяМакета)
	
	ПолныйПутьКМакету = ПолныйПутьКМакету(ИмяМакета);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолныйПутьКМакету);
	
	Возврат Макет;
	
КонецФункции

Процедура ВывестиДерево(Строка, Уровень, ПараметрыВывода)
	
	тДочерние = ПараметрыВывода.тДочерние;
	ТабДок = ПараметрыВывода.ТабДок;
	Область = ПараметрыВывода.Область;
	слУровень = Уровень + 1;	 
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", Строка.ЗадачаСсылка);
	ПараметрыОтбора.Вставить("УровеньДерева", слУровень);	
	Дочерние = тДочерние.НайтиСтроки(ПараметрыОтбора);
	
	//
	
	ЭтоГруппа = Дочерние.Количество() > 0;
	Область.Области.СтрокаТаблицы.Шрифт = ?(ЭтоГруппа, Новый Шрифт(,,Истина), Новый Шрифт(,,Ложь));
	Область.Параметры.Заполнить(Строка);
	
	ПодставитьКартинку(Строка, Область, "Сроки", ПараметрыВывода);
	ПодставитьКартинку(Строка, Область, "Ресурсы", ПараметрыВывода);
	ПодставитьКартинку(Строка, Область, "Бюджеты", ПараметрыВывода);
	ПодставитьКартинку(Строка, Область, "Риски", ПараметрыВывода);
	
	ТабДок.Вывести(Область, Уровень);
	
	Для Каждого ДочернийУзел Из Дочерние Цикл 
		ВывестиДерево(ДочернийУзел, слУровень, ПараметрыВывода);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодставитьКартинку(Строка, Область, Ключ, ПараметрыВывода, КлючСтроки = "")
		
	ОбластьЯчейки = Область.НайтиТекст("##"+Ключ+"##");	
	КлючСтроки = ?(ЗначениеЗаполнено(КлючСтроки), КлючСтроки, Ключ); 
	
	ИконкиСтатусов = Неопределено;
	ПараметрыВывода.ИконкиСтатусовКолонок.Свойство(Ключ, ИконкиСтатусов);
		
	Если НЕ ОбластьЯчейки = Неопределено Тогда 				
		Если НЕ ИконкиСтатусов = Неопределено Тогда 
			ОбластьЯчейки.Картинка = ИконкиСтатусов[Строка[КлючСтроки]] ;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОбластьПоИмени(СтруктураОбластей, Имя)
	Возврат СтруктураОбластей[Имя];
КонецФункции

#КонецОбласти 

Процедура УстановитьПараметрыСтатусовРисковВЗапрос(Запрос)
	
	Запрос.УстановитьПараметр("СостояниеРискаISNULL", Перечисления.упоСтатусОтчетыСтатусыРисков.НеЗаявлены);		
	Запрос.УстановитьПараметр("СостояниеРискаПрочее", Неопределено);
	
	Запрос.УстановитьПараметр("СтатусРиска0", Справочники.упоСтатусыРисковПроектов.Закрыт);
	Запрос.УстановитьПараметр("СостояниеРиска0", Перечисления.упоСтатусОтчетыСтатусыРисков.Закрыты);
	
	Запрос.УстановитьПараметр("СтатусРиска1", Справочники.упоСтатусыРисковПроектов.ПотерялАктуальность);
	Запрос.УстановитьПараметр("СостояниеРиска1", Перечисления.упоСтатусОтчетыСтатусыРисков.НеАктуальны);
	
	Запрос.УстановитьПараметр("СтатусРиска2", Справочники.упоСтатусыРисковПроектов.Актуален);
	Запрос.УстановитьПараметр("СостояниеРиска2", Перечисления.упоСтатусОтчетыСтатусыРисков.Актуальны);
	
	Запрос.УстановитьПараметр("СтатусРиска3", Справочники.упоСтатусыРисковПроектов.Сработал);
	Запрос.УстановитьПараметр("СостояниеРиска3", Перечисления.упоСтатусОтчетыСтатусыРисков.Сработали);	

КонецПроцедуры

#КонецОбласти

#КонецЕсли