
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ДатаВстречи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		
		Дата = ТекущаяДатаСеанса();
		Проект = ДанныеЗаполнения;			
		БизнесЕдиница = ДанныеЗаполнения.Подразделение;
		ПортфельПроектов = ДанныеЗаполнения.ПортфельПроектов;
		ПрограммаПроектов = ДанныеЗаполнения.ПрограммаПроектов;
		Организация = ДанныеЗаполнения.Организация;
		ТипПроекта = ДанныеЗаполнения.ТипПроекта;				
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упоСтатусОтчетПоПроекту") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Дата = ТекущаяДатаСеанса();
		Номер = "";
		ДокументОснование = ДанныеЗаполнения;
		
	КонецЕсли;	  
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли