
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьИзменитьРеквизиты();  //[+] ИКТ №20876 (строка ДОБАВЛЕНА), Новоселов, 13.08.2026 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзменитьРеквизиты()
	
	//{[+] ИКТ №20876 (фрагмент ДОБАВЛЕН), Новоселов, 13.08.2026 
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_Проект", Тип("ПолеФормы"), Элементы.СтраницаОсновное);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_Проект";
	НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ИКТ_ПроектНачалоВыбора");
	//[+]} ИКТ №20876
	
КонецПроцедуры

//{[+] ИКТ №20876 (фрагмент ДОБАВЛЕН), Новоселов, 13.08.2026 
&НаКлиенте
Процедура ИКТ_ПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ВыбраннаяФорма = "Справочник.Проекты.Форма.упоФормаВыбораУправляемая";
	
	ОткрытьФорму(ВыбраннаяФорма, ПараметрыОткрытияФормы, Элемент);
	
КонецПроцедуры
//[+]} ИКТ №20876
