#Область ПрограммныйИнтерфейс

#Область НастройкиПроизводительности

// См. упоСтруктураПроекта.СохранитьНастройкуПроизводительностиСтруктурыПроекта
//
Процедура СохранитьНастройкуПроизводительностиСтруктурыПроекта(ИмяНастройки, Значение) Экспорт

	упоСтруктураПроекта.СохранитьНастройкуПроизводительностиСтруктурыПроекта(ИмяНастройки, Значение);

КонецПроцедуры

// См. упоСтруктураПроекта.ПолучитьСохраненныеНастройкиПроизводительностиСтруктурыПроекта
//
Функция СохраненныеНастройкиПроизводительностиСтруктурыПроекта() Экспорт
	
	ЗначенияНастроек = упоСтруктураПроекта.СохраненныеНастройкиПроизводительностиСтруктурыПроекта();
	Возврат ЗначенияНастроек;
	
КонецФункции

#КонецОбласти

#Область РасчетПроекта

// Вызывает фоновый пересчет сроков проекта в структуре.
//
// Параметры:
//  Параметры					 - Структура - параметры пересчета. См.упоСтруктураПроекта.Пересчитать
//  АдресХранилищаРезультата	 - Строка
//  АдресДопХранилищаРезультата	 - Строка
//
Процедура ПересчитатьФоново(Знач Параметры, АдресХранилищаРезультата = "", АдресДопХранилищаРезультата = "") Экспорт
		
	РезультатПересчета = упоСтруктураПроекта.Пересчитать(Параметры.Данные, 
															Параметры.СтруктураИзмДанных, 
															Параметры.ДатаОтсчета,
															Параметры.РабочийКалендарьПроекта, 
															Параметры.СтруктураДопПараметровПересчета,
															Параметры.НастройкаУровняПланированияПриРасчетеГотовностиПроектов);
	
	Если АдресХранилищаРезультата = "" Тогда
		АдресХранилищаРезультата = ПоместитьВоВременноеХранилище(РезультатПересчета);
	Иначе
		ПоместитьВоВременноеХранилище(РезультатПересчета, АдресХранилищаРезультата);
	КонецЕсли;

КонецПроцедуры

// Вызывает интерактивный пересчет сроков проекта в структуре.
//
// Параметры:
//  Параметры	 - Структура - параметры пересчета. См.упоСтруктураПроекта.Пересчитать
// 
// Возвращаемое значение:
//  Структура - результат пересчета.
//
Функция Пересчитать(Параметры) Экспорт
		
	РезультатПересчета = упоСтруктураПроекта.Пересчитать(Параметры.Данные, 
															Параметры.СтруктураИзмДанных, 
															Параметры.ДатаОтсчета,
															Параметры.РабочийКалендарьПроекта, 
															Параметры.СтруктураДопПараметровПересчета,
															Параметры.НастройкаУровняПланированияПриРасчетеГотовностиПроектов);
	
	Возврат РезультатПересчета;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВключитьДляВсехФоновыйПересчет() Экспорт
	
	упоСтруктураПроекта.УстановитьДляВсехНастройку(Новый Структура("ПересчитыватьФоново", Истина), Ложь);
	
КонецПроцедуры

Процедура ВыключитьДляВсехФоновыйПересчет() Экспорт
	
	упоСтруктураПроекта.УстановитьДляВсехНастройку(Новый Структура("ПересчитыватьФоново", Ложь), Ложь);
	
КонецПроцедуры

#КонецОбласти
