
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОтразитьВТабеле = Истина И ЗначениеЗаполнено(ВидРабочегоВремени) Тогда
		
		Движения.ДанныеСостоянийСотрудников.Записывать = Истина;
		
		СостоянияСотрудников.ЗарегистрироватьСостоянияСотрудников(Движения, Ссылка, ДанныеСостоянийСотрудника());
	
		Движения.Записать(); 
		
	КонецЕсли; 
	
	ВыполнитьОбработкуРешенияРеквест();
	
КонецПроцедуры

Функция ДанныеСостоянийСотрудника() Экспорт 
	
	ДанныеСостояний = СостоянияСотрудников.ПустаяТаблицаДанныхСостоянийСотрудника();
	
	ПериодыНачислений = Новый Массив;
	ПериодРаботы = Новый Структура;
	ПериодРаботы.Вставить("ДатаНачалаПериода", ДатаИнцидента);
	ПериодРаботы.Вставить("ДатаОкончанияПериода", ДатаИнцидента);
	ПериодыНачислений.Добавить(ПериодРаботы);

	Для Каждого ПериодНачисления Из ПериодыНачислений Цикл
		НоваяСтрока = ДанныеСостояний.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник;
		НоваяСтрока.Состояние = СостояниеСотрудника;
		НоваяСтрока.Начало = ПериодНачисления.ДатаНачалаПериода;
		НоваяСтрока.Окончание = ПериодНачисления.ДатаОкончанияПериода;
		НоваяСтрока.ВидВремени = ВидРабочегоВремени;
	КонецЦикла;
		
	Возврат ДанныеСостояний;
	
КонецФункции

Процедура ВыполнитьОбработкуРешенияРеквест() 
	
	Если РешениеRequest = Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.БольничныйНеподтвержденный
		ИЛИ РешениеRequest = Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.РабочийНеоплачиваемыйДень Тогда
		
		СформироватьДокументыПрогул();
		
	ИначеЕсли РешениеRequest = Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ОтпускПолДня_ДоОбеда
		ИЛИ РешениеRequest = Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ОтпускПолДня_ПослеОбеда Тогда
		
		СформироватьДвиженияОтпускПолдня();
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕстьNULL(ИКТ_НакоплениеОтпускаПолДняОбороты.СуммаЧасовОборот,0) КАК СуммаЧасовОборот
			|ИЗ
			|	РегистрНакопления.ИКТ_НакоплениеОтпускаПолДня.Обороты(
			|			,
			|			&ГраницаВключа,
			|			,
			|			Сотрудник = &Сотрудник
			|				И Организация = &Организация) КАК ИКТ_НакоплениеОтпускаПолДняОбороты";
		
		Запрос.УстановитьПараметр("ГраницаВключа", Новый Граница(МоментВремени(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Цел(Выборка.СуммаЧасовОборот) = Выборка.СуммаЧасовОборот И Выборка.СуммаЧасовОборот > 0 Тогда
				
				СформироватьДокументыОтпуск();
				
			КонецЕсли;
			
		КонецЕсли; 
		
	ИначеЕсли РешениеRequest = Перечисления.ИКТ_ВидыРешенияRequestРаботаНеПоГрафику.ЕжегодныйОтпуск Тогда

		СформироватьДокументыОтпуск();
		
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени.ШаблонВводаДокумента КАК ШаблонВводаДокумента,
		|	ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени.Показатель КАК Показатель
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени КАК ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени
		|ГДЕ
		|	ИКТ_СоответствиеРешенийПоОтсутствиюИВидовВремени.РешениеRequest = &РешениеRequest";
	
	Запрос.УстановитьПараметр("РешениеRequest", РешениеRequest);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ШаблонВводаДокумента) И ЗначениеЗаполнено(Выборка.Показатель) Тогда
			СформироватьДокументДанныеДляРасчетаЗарплатыЗаДень(Выборка.ШаблонВводаДокумента, Выборка.Показатель);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область Прогул

Процедура СформироватьДокументыПрогул()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаУОС КАК ДокументУчетаУОС,
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаЮОС КАК ДокументУчетаЮОС
		|ИЗ
		|	РегистрСведений.ИКТ_РаботаНеПоГрафику_ДокументыУчета КАК ИКТ_РаботаНеПоГрафику_ДокументыУчета
		|ГДЕ
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокУчетаУОС = Выборка.ДокументУчетаУОС.ПолучитьОбъект();
	Иначе
		ДокУчетаУОС = Документы.ПрогулНеявка.СоздатьДокумент();
	КонецЕсли;
	
	ДокУчетаУОС.Заполнить(Сотрудник);
	ДокУчетаУОС.ДатаНачала = ДатаИнцидента;
	ДокУчетаУОС.ДатаОкончания = ДатаИнцидента;
	ДокУчетаУОС.ДатаОтсутствия = ДатаИнцидента;
	ДокУчетаУОС.Записать(РежимЗаписиДокумента.Проведение);

	ДокУчетаУОССсылка = ДокУчетаУОС.Ссылка;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеОбъектов.ОбъектБУ КАК СотрудникЮОС
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
		|ГДЕ
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ = &СотрудникСсылка";
	
	Запрос.УстановитьПараметр("СотрудникСсылка", Сотрудник);
	
	РезультатЗапросаСотрудникЮОС = Запрос.Выполнить();
	
	ВыборкаСотрудникЮОС = РезультатЗапросаСотрудникЮОС.Выбрать();
	
	ДокУчетаЮОССсылка = Документы.ПрогулНеявка.ПустаяСсылка();
	
	Если ВыборкаСотрудникЮОС.Следующий() Тогда
		
		Если Выборка.Следующий() Тогда
			ДокУчетаЮОС = Выборка.ДокументУчетаЮОС.ПолучитьОбъект();
		Иначе
			ДокУчетаЮОС = Документы.ПрогулНеявка.СоздатьДокумент();
		КонецЕсли;
		
		ДокУчетаЮОС.Заполнить(ВыборкаСотрудникЮОС.СотрудникЮОС);
		ДокУчетаЮОС.ДатаНачала = ДатаИнцидента;
		ДокУчетаЮОС.ДатаОкончания = ДатаИнцидента;
		ДокУчетаЮОС.ДатаОтсутствия = ДатаИнцидента;
		ДокУчетаЮОС.Записать(РежимЗаписиДокумента.Проведение);

		ДокУчетаЮОССсылка = ДокУчетаЮОС.Ссылка;
		
	КонецЕсли;
	
	ДобавитьЗаписьСвязейДокументов(Ссылка, ДокУчетаУОССсылка, ДокУчетаЮОССсылка);
	
КонецПроцедуры 

#КонецОбласти 

#Область Отпуск

Процедура СформироватьДокументыОтпуск()
	
	Если СозданДокументОтпуска() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтпуска = ОстаткиОтпусков.ОписаниеПараметровДляОстаткиОтпусков();
	
	ПараметрыОтпуска.ДатаОстатков = ?(ЗначениеЗаполнено(ДатаНачалаОтсутствия), ДатаНачалаОтсутствия,ДатаИнцидента);
	
	Если ЗначениеЗаполнено(ДатаНачалаОтсутствия) и ЗначениеЗаполнено(ДатаОкончанияОтсутствия) Тогда
		ДлительностьОтпуска = (ДатаОкончанияОтсутствия - ДатаНачалаОтсутствия) / 86400 + 1;
	Иначе
		ДлительностьОтпуска = 1;
	КонецЕсли;
		
    мСотрудников = Новый Массив;
	мСотрудников.Добавить(Сотрудник);
	ПараметрыОтпуска.Сотрудники = мСотрудников;
	
	мВидыОтпусков = Новый Массив;
	мВидыОтпусков.Добавить(Справочники.ВидыОтпусков.ВидыЕжегодныхОплачиваемыхОтпусков());
	
	ПараметрыОтпуска.ВидыОтпусков = мВидыОтпусков;
	
	ТЗ_ОстаткиОтпусков = ОстаткиОтпусков.ОстаткиОтпусков(ПараметрыОтпуска);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ_ОстаткиОтпусков", ТЗ_ОстаткиОтпусков);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ_ОстаткиОтпусков.Сотрудник КАК Сотрудник,
	|	ТЗ_ОстаткиОтпусков.ВидОтпуска КАК ВидОтпуска,
	|	ТЗ_ОстаткиОтпусков.РабочийГодДатаНачала КАК РабочийГодДатаНачала,
	|	ТЗ_ОстаткиОтпусков.РабочийГодДатаОкончания КАК РабочийГодДатаОкончания,
	|	ТЗ_ОстаткиОтпусков.ВидОтпускаНаименование КАК ВидОтпускаНаименование,
	|	ТЗ_ОстаткиОтпусков.Дни КАК Дни
	|ПОМЕСТИТЬ ВТ_ОстаткиОтпусков
	|ИЗ
	|	&ТЗ_ОстаткиОтпусков КАК ТЗ_ОстаткиОтпусков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиОтпусков.Сотрудник КАК Сотрудник,
	|	ВТ_ОстаткиОтпусков.ВидОтпуска КАК ВидОтпуска,
	|	СУММА(ВТ_ОстаткиОтпусков.Дни) КАК Дни
	|ИЗ
	|	ВТ_ОстаткиОтпусков КАК ВТ_ОстаткиОтпусков
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиОтпусков.Сотрудник,
	|	ВТ_ОстаткиОтпусков.ВидОтпуска
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_ОстаткиОтпусков.Дни) >= 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дни УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		НачалоПериодаОтпуска = ?(ЗначениеЗаполнено(ДатаНачалаОтсутствия), ДатаНачалаОтсутствия, ДатаИнцидента);
		ОкончаниеПериодаОтпуска = ?(ЗначениеЗаполнено(ДатаОкончанияОтсутствия), ДатаОкончанияОтсутствия, ДатаИнцидента);
		
		Пока Выборка.Следующий() И ДлительностьОтпуска > 0 Цикл
			
			ОстатокОтпуска = Цел(Выборка.Дни); //Проверка целого значения
			
			Если ОстатокОтпуска = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ДнейПоВидуОтпуска = Мин(ОстатокОтпуска, ДлительностьОтпуска);
			
			ДокОтпуска = Документы.Отпуск.СоздатьДокумент();
			ДокОтпуска.Заполнить(Выборка.Сотрудник);
			ДокОтпуска.ДатаНачалаОсновногоОтпуска = НачалоПериодаОтпуска;
			ДокОтпуска.ДатаОкончанияОсновногоОтпуска = НачалоПериодаОтпуска + (ДнейПоВидуОтпуска - 1) * 86400; 
			
			НачалоПериодаОтпуска = ДокОтпуска.ДатаОкончанияОсновногоОтпуска + 86400;
			
			ДокОтпуска.ПредоставитьОсновнойОтпуск = Истина;
			ДокОтпуска.УчитыватьМРОТПриОплатеПоСреднемуЗаработку = Истина;
			ДокОтпуска.ПериодРегистрации = НачалоМесяца(ДатаИнцидента);
			
			РассчитатьПараметрыОтпуска(ДокОтпуска);
			
			ПерезаполнитьНачисленияСотрудника(ДокОтпуска,Выборка.ВидОтпуска);
			
			ДокОтпуска.Записать(РежимЗаписиДокумента.Проведение);
			
			ДобавитьЗаписьСвязейДокументов(Ссылка, ДокОтпуска.Ссылка, Документы.Отпуск.ПустаяСсылка());  
			
			ДлительностьОтпуска = ДлительностьОтпуска - ДнейПоВидуОтпуска; 
			
		КонецЦикла; 
		
		Если ДлительностьОтпуска > 0 Тогда
			
			//Остатков отпусков не хватило на весь период. На остаток создаем отпуск за свой счет
			ДокОтпуска = Документы.ОтпускБезСохраненияОплаты.СоздатьДокумент();
			ДокОтпуска.Заполнить(Сотрудник);
			ДокОтпуска.ДатаНачала = НачалоПериодаОтпуска;
			ДокОтпуска.ДатаОкончания = НачалоПериодаОтпуска + (ДлительностьОтпуска - 1) * 86400;
			ДокОтпуска.ПериодРегистрации = НачалоМесяца(ДатаИнцидента);
			ДокОтпуска.ВидОтпуска = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускЗаСвойСчет"); 
			ДокОтпуска.Рассчитал = ПараметрыСеанса.ТекущийПользователь;
			ДокОтпуска.ПерерасчетВыполнен = Истина;
			
			ДокОтпуска.Записать(РежимЗаписиДокумента.Проведение);
			
			ДобавитьЗаписьСвязейДокументов(Ссылка, ДокОтпуска.Ссылка, Документы.ОтпускБезСохраненияОплаты.ПустаяСсылка()); 
			
		КонецЕсли;
		
	Иначе
		
		//Нет даже одного полного дня отпуска. На весь период создаем отпуск за свой счет
		ДокОтпуска = Документы.ОтпускБезСохраненияОплаты.СоздатьДокумент();
		ДокОтпуска.Заполнить(Сотрудник);
		ДокОтпуска.ДатаНачала = ?(ЗначениеЗаполнено(ДатаНачалаОтсутствия), ДатаНачалаОтсутствия, ДатаИнцидента);
		ДокОтпуска.ДатаОкончания = ?(ЗначениеЗаполнено(ДатаОкончанияОтсутствия), ДатаОкончанияОтсутствия, ДатаИнцидента);
		ДокОтпуска.ПериодРегистрации = НачалоМесяца(ДатаИнцидента);
		ДокОтпуска.ВидОтпуска = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускЗаСвойСчет"); 
		ДокОтпуска.Рассчитал = ПараметрыСеанса.ТекущийПользователь;
		ДокОтпуска.ПерерасчетВыполнен = Истина;
		
		ДокОтпуска.Записать(РежимЗаписиДокумента.Проведение);
		
		ДобавитьЗаписьСвязейДокументов(Ссылка, ДокОтпуска.Ссылка, Документы.ОтпускБезСохраненияОплаты.ПустаяСсылка());
		
	КонецЕсли;

КонецПроцедуры 

Функция СозданДокументОтпуска()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаУОС КАК ДокументУчетаУОС,
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаЮОС КАК ДокументУчетаЮОС
		|ИЗ
		|	РегистрСведений.ИКТ_РаботаНеПоГрафику_ДокументыУчета КАК ИКТ_РаботаНеПоГрафику_ДокументыУчета
		|ГДЕ
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументОснование = &ДокументОснование
		|	И ВЫБОР
		|			КОГДА ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаУОС ССЫЛКА Документ.Отпуск
		|				ТОГДА ВЫРАЗИТЬ(ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаУОС КАК Документ.Отпуск).Проведен
		|			КОГДА ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаУОС ССЫЛКА Документ.ОтпускБезСохраненияОплаты
		|				ТОГДА ВЫРАЗИТЬ(ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаУОС КАК Документ.ОтпускБезСохраненияОплаты).Проведен
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой()
	
КонецФункции

Процедура ПерезаполнитьНачисленияСотрудника(Документ, ВидОтпуска, СохранятьИсправления = Истина, ПерезаполнитьНачисления = Истина) Экспорт
	
	ПараметрыРасчета = Документ.ПараметрыРасчета();
	ПараметрыРасчета.ПерезаполнитьНачисления = ПерезаполнитьНачисления;
	ПараметрыРасчета.СохранятьИсправления = Истина;  
	ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего = Истина;
	ПараметрыРасчета.ОбновитьРасчетДенежногоСодержания = Истина;
	
	ЗаполнитьВидыРасчетовОсновногоОтпуска(Документ, ВидОтпуска, );
	
	Документ.Рассчитать(ПараметрыРасчета);
	
КонецПроцедуры 

Процедура ЗаполнитьВидыРасчетовОсновногоОтпуска(Документ,ВидОтпуска, ПервичнаяИнициализацияФормы = Ложь)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВАрхиве", Ложь);
	Отбор.Вставить("ПометкаУдаления", Ложь);
	Отбор.Вставить("ВидВремени", Перечисления.ВидыРабочегоВремениСотрудников.ЦелодневноеНеотработанное);
	Отбор.Вставить("ВидДокументаНачисления", Перечисления.ВидыДокументовНачисления.Отпуск);
	Отбор.Вставить("ВидОтпуска", ВидОтпуска);
	Отбор.Вставить("СпособВыполненияНачисления", Перечисления.СпособыВыполненияНачислений.ПоОтдельномуДокументуДоОкончательногоРасчета);
	Отбор.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска);
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
	Документ.ВидРасчетаОсновногоОтпуска = ПланыВидовРасчета.Начисления.НачислениеПоУмолчанию(Отбор);
	
КонецПроцедуры

Процедура РассчитатьПараметрыОтпуска(ДокОтпуска)
		
	Если ЗначениеЗаполнено(ДокОтпуска.ДатаОкончанияОсновногоОтпуска) И ЗначениеЗаполнено(ДокОтпуска.ДатаНачалаОсновногоОтпуска) 
		И ДокОтпуска.ДатаНачалаОсновногоОтпуска <= ДокОтпуска.ДатаОкончанияОсновногоОтпуска Тогда 
		
		ОтпускВРабочихДняхПоДоговору = ОстаткиОтпусков.ОтпускСотрудникаВРабочихДняхПоДоговору(ДокОтпуска.Сотрудник, ДокОтпуска.ДатаНачалаОсновногоОтпуска); 
		
		ОписаниеВидаОтпуска = ОстаткиОтпусков.ОписаниеВидаОтпуска(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), ОтпускВРабочихДняхПоДоговору);
		ДокОтпуска.КоличествоДнейОсновногоОтпуска = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(ДокОтпуска.Сотрудник, ДокОтпуска.ДатаНачалаОсновногоОтпуска, ДокОтпуска.ДатаОкончанияОсновногоОтпуска, ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
		
	Иначе
		
		ДокОтпуска.КоличествоДнейОсновногоОтпуска = 0;
		
	КонецЕсли;
		
	ОбновитьРабочийГодОсновногоОтпуска(ДокОтпуска);
	
КонецПроцедуры 

Процедура ОбновитьРабочийГодОсновногоОтпуска(ДокОтпуска)
	Если (ДокОтпуска.ПредоставитьОсновнойОтпуск И ЗначениеЗаполнено(ДокОтпуска.ДатаНачалаОсновногоОтпуска) И ЗначениеЗаполнено(ДокОтпуска.ДатаОкончанияОсновногоОтпуска))
		Или (ДокОтпуска.ПредоставитьКомпенсациюОсновногоОтпуска И ЗначениеЗаполнено(ДокОтпуска.КоличествоДнейКомпенсацииОсновногоОтпуска)) Тогда               
		
		УстановитьПривилегированныйРежим(Истина);
		ДниПриостановкиОтпуска = 0;
		
		СтруктураПараметров = ОстаткиОтпусков.ПараметрыПолученияРабочегоПериодаОтпуска();
		СтруктураПараметров.Сотрудник = ДокОтпуска.Сотрудник;
		СтруктураПараметров.ТекущийРегистратор = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокОтпуска.Ссылка);
		СтруктураПараметров.ВидОтпуска = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
		Если ДокОтпуска.ПредоставитьОсновнойОтпуск Тогда
			СтруктураПараметров.ДатаНачала = ДокОтпуска.ДатаНачалаОсновногоОтпуска;
			СтруктураПараметров.ДатаОкончания = ДокОтпуска.ДатаОкончанияОсновногоОтпуска
		Иначе
			СтруктураПараметров.ДатаНачала = Дата(1,1,1);
			СтруктураПараметров.ДатаОкончания = Дата(1,1,1);
		КонецЕсли;
		Если ДокОтпуска.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
			СтруктураПараметров.ДатаКомпенсации = ДокОтпуска.ПериодРегистрации;
			СтруктураПараметров.КоличествоДнейКомпенсации = - ДниПриостановкиОтпуска + ДокОтпуска.КоличествоДнейКомпенсацииОсновногоОтпуска;
		Иначе
			СтруктураПараметров.ДатаКомпенсации = Дата(1,1,1);
			СтруктураПараметров.КоличествоДнейКомпенсации = - ДниПриостановкиОтпуска;
		КонецЕсли;
		ПериодОсновногоОтпуска = ОстаткиОтпусков.РабочийПериодОтпуска(СтруктураПараметров);
		
		ДокОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск	= ПериодОсновногоОтпуска.РабочийГодС;
		ДокОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск	= ПериодОсновногоОтпуска.РабочийГодПо;
		
	КонецЕсли;
КонецПроцедуры 

Процедура СформироватьДвиженияОтпускПолдня() 
	
	Движения.ИКТ_НакоплениеОтпускаПолДня.Записывать = Истина;
	Движения.ИКТ_НакоплениеОтпускаПолДня.Записать(Истина); // Очистка движений
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ИКТ_НакоплениеОтпускаПолДня");
	ЭлементБлокировки.УстановитьЗначение("Сотрудник", Сотрудник);
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	Блокировка.Заблокировать();
	
	Движение = Движения.ИКТ_НакоплениеОтпускаПолДня.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Организация = Организация;
	Движение.СуммаЧасов = 0.5;
	
	Движения.Записать();
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаписьСвязейДокументов(ДокументОснование, ДокументУчетаУОС, ДокументУчетаЮОС);
	
	Запись = РегистрыСведений.ИКТ_РаботаНеПоГрафику_ДокументыУчета.СоздатьМенеджерЗаписи();
	Запись.ДокументОснование = ДокументОснование;
	Запись.ДокументУчетаУОС = ДокументУчетаУОС;
	Запись.ДокументУчетаЮОС = ДокументУчетаЮОС;
	Запись.Записать(Истина);
	
КонецПроцедуры  

Процедура СформироватьДокументДанныеДляРасчетаЗарплатыЗаДень(ШаблонВводаДокумента, Показатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаУОС КАК ДокументУчетаУОС,
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументУчетаЮОС КАК ДокументУчетаЮОС
		|ИЗ
		|	РегистрСведений.ИКТ_РаботаНеПоГрафику_ДокументыУчета КАК ИКТ_РаботаНеПоГрафику_ДокументыУчета
		|ГДЕ
		|	ИКТ_РаботаНеПоГрафику_ДокументыУчета.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокУчетаУОС = Выборка.ДокументУчетаУОС.ПолучитьОбъект();
	Иначе
		ДокУчетаУОС = Документы.ДанныеДляРасчетаЗарплаты.СоздатьДокумент();
	КонецЕсли;

	ДокУчетаУОС.Дата = ДатаИнцидента;
	ДокУчетаУОС.Период = ДатаИнцидента; 
	ДокУчетаУОС.ПериодОкончания = ДатаИнцидента;
	
	ДокУчетаУОС.ВидДокумента = ШаблонВводаДокумента;
	ДокУчетаУОС.Организация = Организация;
		
	ДокУчетаУОС.ЗначенияПоказателей.Очистить();
	
	Нстр = ДокУчетаУОС.ЗначенияПоказателей.Добавить();
	Нстр.Объект = Сотрудник;
	НСтр.Показатель = Показатель;
	НСтр.Значение = 1;
	НСтр.Период = ДатаИнцидента; 
	НСтр.ПериодОкончания = ДатаИнцидента;
	
	ДокУчетаУОС.Записать(РежимЗаписиДокумента.Проведение);
	
	ДобавитьЗаписьСвязейДокументов(Ссылка, ДокУчетаУОС.Ссылка, Документы.ДанныеДляРасчетаЗарплаты.ПустаяСсылка());

КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыИнцидентов", ВидыИнцидентов.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыИнцидентов.ВидИнцидента КАК ВидИнцидента
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВидыИнцидентов КАК ВидыИнцидентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ВТ.ВидИнцидента) КАК ВидИнцидента
	|ИЗ
	|	ВТ КАК ВТ";
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивИнцидентов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВидИнцидента");
	
	ВидыИнцидентовСтрокой = СтрСоединить(МассивИнцидентов, "; ");
	
КонецПроцедуры


#КонецОбласти
