
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует таблицу данных для операции "Заполнить".
//
// Параметры:
//  Объект				 - ДокументСсылка.упоИзменениеСоставаПодразделения - ссылка на документ-источник.
//  ИмяТабличнойЧасти 	 - Строка - содержит имя табличной части объекта,
//                      	если параметр не указан, то структура формируется по шапке объекта.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными для заполнения.
//
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект, ИмяТабличнойЧасти) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеИсточник);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Рег.Роль
	               |ИЗ
	               |	РегистрСведений.упоСоставПодразделений.СрезПоследних(, Подразделение = &Подразделение) КАК Рег
	               |ГДЕ
	               |	Рег.ВходитВСостав = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Рег.Роль";
		
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
//	СтруктураПараметров - Структура - структура параметров.
// 
// Возвращаемое значение: 
//  Структура - содержит поля обязательных реквизитов:
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти, 
	СтруктураПараметров = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	// Заполнение структуры обязательных полей шапки.
	СтруктураОбязательныхПолей.Вставить("ПодразделениеИсточник");
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоИзменениеСоставаПодразделения);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли