
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки.
		СтруктураОбязательныхПолей.Вставить("ПодразделениеИсточник");
	ИначеЕсли ИмяТабличнойЧасти = "СоставРолей" Тогда
		// Формирование структуры обязательных реквизитов табличной части СоставРолей.
		СтруктураОбязательныхПолей.Вставить("Роль");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры:
//  ДанныеДокумента - Структура - содержит слепок документа.
//  Отказ           - Булево - Признак отказа от выполнения операции.
//  Заголовок       - Строка - Содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРолейПодразделенияИсточник = СформироватьТаблицуДанных(ДанныеДокумента, ДанныеДокумента.ПодразделениеИсточник);
	ТаблицаРолейПодразделенияПриемник = СформироватьТаблицуДанных(ДанныеДокумента, ДанныеДокумента.ПодразделениеПриемник);
	
	Для Каждого ТекСтрока Из ДанныеДокумента.СоставРолей Цикл
		НайденнаяСтрока = ТаблицаРолейПодразделенияИсточник.Найти(ТекСтрока.Роль, "Роль");
		Если НайденнаяСтрока = Неопределено Тогда
			ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти.СоставРолей.Представление();
			ЗаголовокСтрокиСообщения = упоСервисныеФункцииВызовСервера.обСформироватьЗаголовокОшибкиВСтрокеТЧ(ПредставлениеТабличнойЧасти, ТекСтрока.НомерСтроки);
			СтрокаСообщения = ЗаголовокСтрокиСообщения +
							"Нельзя сместить роль """ + СокрЛП(ТекСтрока.Роль) + """." 
							+ " Эта роль не входит в состав подразделения """ + СокрЛП(ДанныеДокумента.ПодразделениеИсточник) + """!";
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
		
		Если Не ДанныеДокумента.ПодразделениеПриемник.Пустая() Тогда
			НайденнаяСтрока = ТаблицаРолейПодразделенияПриемник.Найти(ТекСтрока.Роль, "Роль");
			Если НайденнаяСтрока <> Неопределено Тогда
				ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти.СоставРолей.Представление();
				ЗаголовокСтрокиСообщения = упоСервисныеФункцииВызовСервера.обСформироватьЗаголовокОшибкиВСтрокеТЧ(ПредставлениеТабличнойЧасти, ТекСтрока.НомерСтроки);
				СтрокаСообщения = ЗаголовокСтрокиСообщения +
								"Нельзя переместить роль """ + СокрЛП(ТекСтрока.Роль)
								+ """ в подразделение """ + СокрЛП(ДанныеДокумента.ПодразделениеПриемник)
								+ """. Эта роль уже входит в его состав!";
				обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//   Отказ        - Тип: Булево. Признак отказа от выполнения операции.
//   Заголовок    - Тип: Строка. Содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки для заданной табличной части документа.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	// Заполнение структуры обязательных полей шапки.
	СтруктураОбязательныхПолей.Вставить("ПодразделениеИсточник");
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеИсточник);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.Роль
		|ИЗ
		|	РегистрСведений.упоСоставПодразделений.СрезПоследних(, Подразделение = &Подразделение) КАК Рег
		|ГДЕ
		|	Рег.ВходитВСостав = ИСТИНА
		|УПОРЯДОЧИТЬ ПО 
		|	Рег.Роль";
		
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	
	// Правила для регистра "СоставПодразделений"
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСоставПодразделений.Метаданные().Имя, Правила);
	
	// Правила для табличной части "СоставРолей" документа
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("СоставРолей", ПравилаТаблицы);
	
	// Делаем первое движение по ТЧ для подразделения-источник
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("СмещениеСоставаРолейПодразделения", ПравилаДвижения);
	
	// Правила связи реквизитов
	ПравилаДвижения.Вставить("Подразделение", "Шапка_ПодразделениеИсточник");
	ПравилаДвижения.Вставить("Роль"         , "Роль");
	ПравилаДвижения.Вставить("ВходитВСостав", Новый Структура("Значение", Ложь));
	
	// Делаем второе движение по ТЧ для подразделения-приемник, если оно заполнено
	Если Не ДанныеДокумента.ПодразделениеПриемник.Пустая() Тогда
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("ПеремещениеСоставаРолейПодразделения", ПравилаДвижения);
		
		// Правила связи реквизитов
		ПравилаДвижения.Вставить("Подразделение", "Шапка_ПодразделениеПриемник");
		ПравилаДвижения.Вставить("Роль"         , "Роль");
		ПравилаДвижения.Вставить("ВходитВСостав", Новый Структура("Значение", Истина));
	КонецЕсли;
	
	Возврат ПравилаНаложения; 

КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	// Здесь можно расположить бизнес-логику дополнительной обработки
	// данных движений регистров.
	
	// По умолчанию ничего не делаем.
	                                     
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.упоПодразделения") Тогда      
		ПодразделениеИсточник = Основание;
	КонецЕсли;  

КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует таблицу данных для проверки корректности заполнения реквизитов документа.
// 
// Параметры: 
//  ДанныеДокумента - Тип: Структура, содержит список таблиц (ключи структуры),
//                    состоящий из шапки и всех табличных частей документа.
//                    Является полным слепком документа.
//  Условие         - Тип: Произвольный, содержит некое условие.
// 
// Возвращаемое значение: 
//  Тип: ТаблицаЗначений, сформированная таблица данных.
// 
Функция СформироватьТаблицуДанных(ДанныеДокумента, Подразделение)
	
	// Определим момент времени запроса
	МоментВремениЗапроса = упоРабочиеКалендариВызовСервера.обПолучитьМоментВремениДокумента(ЭтотОбъект);
	
	// Формируем запрос
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"         , МоментВремениЗапроса);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.Роль
		|ИЗ
		|	РегистрСведений.упоСоставПодразделений.СрезПоследних(&Дата, Подразделение = &Подразделение) КАК Рег
		|ГДЕ
		|	Рег.ВходитВСостав = ИСТИНА";
	
	// Запускаем запрос
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
