
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки.
		СтруктураОбязательныхПолей.Вставить("Проект");
	ИначеЕсли ИмяТабличнойЧасти = "Показатели" Тогда
		// Формирование структуры обязательных реквизитов табличной части Показатели.
		СтруктураОбязательныхПолей.Вставить("Показатель");
	ИначеЕсли ИмяТабличнойЧасти = "Индикаторы" Тогда
		// Формирование структуры обязательных реквизитов табличной части Индикаторы.
		СтруктураОбязательныхПолей.Вставить("Индикатор");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет все необходимые данные документа для его записи в ИБ.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
//
Процедура ПроверитьДанныеПередЗаписью(Отказ) Экспорт
	
	// Получим заголовок для сообщения об ошибках при записи объекта.
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	
	// Проверяем заполненность обязательных реквизитов.
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьДанныеПередЗаписью()

// Процедура проверяет все необходимые данные документа для его проведения.
// 
// Параметры: 
//  ДанныеДокумента - Структура - содержит слепок документа.
//  Отказ           - Булево - Признак отказа от выполнения операции.
//  Заголовок       - Строка - Содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки для заданной табличной части документа.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - итоговая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	
	
КонецФункции

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая пара ключ-значение соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	
	// Правила для регистра ЗначенияПоказателей.
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоЗначенияИндикаторов", Правила);
	
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("Индикаторы", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("Движение_Раз", ПравилаДвижения);
	
	ПравилаДвижения.Вставить("Индикатор", "Индикатор");
	ПравилаДвижения.Вставить("Объект", "Шапка_Проект");
	ПравилаДвижения.Вставить("ЗначениеИндикатора", "ЗначениеИндикатора");
	
	Возврат ПравилаНаложения; 

КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	// Здесь можно расположить бизнес-логику дополнительной обработки
	// данных движений регистров.
	
	// По умолчанию ничего не делаем.
	
	// Когда тип индикатора = Число, а значение нужно сохранить 0, то сохраняется Неопределено.
	Если ДанныеДвижений.Свойство("упоЗначенияИндикаторов") Тогда
		Для Каждого ТекСтр Из ДанныеДвижений.упоЗначенияИндикаторов Цикл
			Если (ТекСтр.ЗначениеИндикатора = Неопределено) И (ТекСтр.Индикатор.ТипИндикатора = Перечисления.упоТипИндикатора.Число) Тогда
				ТекСтр.ЗначениеИндикатора = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	                                     
КонецПроцедуры // ПодготовитьДанныеДвижений()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт 
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
		
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
		
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда
		
		Проект = Основание;
	
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Проект = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(Основание);
			
	ИначеЕсли ТипЗнч(Основание) = Тип("Структура") Тогда
		
		Если Основание.Свойство("Проект", Проект) И Основание.Свойство("ЗаполнитьТЧИндикаторы") Тогда
			ЗаполнитьИндикаторыПроекта();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура отменяет проведение документа для перерасчета показателей.
//
Процедура ОтменитьПроведениеДокумента() Экспорт
	
	Если ЭтотОбъект.Проведен Тогда
		ЭтотОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события..
//						   продолжение описания параметра. 
//  Префикс – Строка - префикс, который будет использоваться для генерации номера.
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения); 
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ - Булево - признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ - Булево - признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  Отказ - Булево - признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  Отказ - Булево - признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИндикаторыПроекта()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	упоЗначенияИндикаторовСрезПоследних.Индикатор КАК Индикатор,
	                      |	упоЗначенияИндикаторовСрезПоследних.ЗначениеИндикатора КАК ЗначениеИндикатора
	                      |ИЗ
	                      |	РегистрСведений.упоЗначенияИндикаторов.СрезПоследних(, Объект = &Проект) КАК упоЗначенияИндикаторовСрезПоследних
	                      |ГДЕ
	                      |	упоЗначенияИндикаторовСрезПоследних.Индикатор.ПоказательИнвестирования");
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Если Индикаторы.Количество() > 0 Тогда
			Индикаторы.Очистить();
		КонецЕсли;	
	Иначе	
		Индикаторы.Загрузить(Результат.Выгрузить());
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли