////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции панели показателей.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет начальные значения группировок.
//
// Параметры:
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек.
//  Группировка			 - КоллекцияПолейГруппировкиКомпоновкиДанных - поля группировки.
//
Процедура ЗаполнитьНачальныеЗначенияГруппировок(КомпоновщикНастроек, Группировка) Экспорт
	
	// Установка начальных значений Группировки.
	Группировка.Очистить();
	Для Каждого ЭлементСтруктуры Из КомпоновщикНастроек.Настройки.Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			Для Каждого Серия Из ЭлементСтруктуры.Серии Цикл
				Если Серия.Имя = "Группировка" Тогда
					ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Серия, Группировка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Для Каждого Точка Из ЭлементСтруктуры.Точки Цикл
				Если Точка.Имя = "Группировка" Тогда
					ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Точка, Группировка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Для Каждого Колонка Из ЭлементСтруктуры.Колонки Цикл
				Если Колонка.Имя = "Группировка" Тогда
					ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Колонка, Группировка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Для Каждого Строка Из ЭлементСтруктуры.Строки Цикл
				Если Строка.Имя = "Группировка" Тогда
					ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Строка, Группировка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Группировка.Очистить();
			ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, ЭлементСтруктуры, Группировка);
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// Получает свойство поля.
//
// Параметры:
//  ЭлементСтруктура - ДоступныеПоляКомпоновкиДанных - коллекция полей СКД.
//  Поле			 - ПолеКомпоновкиДанных - поле.
//  Свойство		 - Строка - имя свойства.
//
// Возвращаемое значение:
//	ПолеКомпоновкиДанных - поле СКД.
//
Функция ПолучитьСвойствоПоля(ЭлементСтруктура, Поле, Свойство = "Заголовок") Экспорт
	
	Если ТипЗнч(ЭлементСтруктура) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Коллекция = ЭлементСтруктура.Настройки.ДоступныеПоляВыбора;
	Иначе
		Коллекция = ЭлементСтруктура;
	КонецЕсли;
	
	ПолеСтрокой = Строка(Поле);
	ПозицияКвадратнойСкобки = Найти(ПолеСтрокой, "[");
	Окончание = "";
	Заголовок = "";
	Если ПозицияКвадратнойСкобки > 0 Тогда
		Окончание = Сред(ПолеСтрокой, ПозицияКвадратнойСкобки);
		ПолеСтрокой = Лев(ПолеСтрокой, ПозицияКвадратнойСкобки - 2);
	КонецЕсли;
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолеСтрокой, ".");
	
	Если Не ПустаяСтрока(Окончание) Тогда
		МассивСтрок.Добавить(Окончание);
	КонецЕсли;
	
	ДоступныеПоля = Коллекция.Элементы;
	ПолеПоиска = "";
	Для Индекс = 0 По МассивСтрок.Количество() - 1 Цикл
		ПолеПоиска = ПолеПоиска + ?(Индекс = 0, "", ".") + МассивСтрок[Индекс];
		ДоступноеПоле = ДоступныеПоля.Найти(ПолеПоиска);
		Если ДоступноеПоле <> Неопределено Тогда
			ДоступныеПоля = ДоступноеПоле.Элементы;
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступноеПоле <> Неопределено Тогда
		Если Свойство = "ДоступноеПоле" Тогда
			Результат = ДоступноеПоле;
		Иначе
			Результат = ДоступноеПоле[Свойство]; 
		КонецЕсли;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет группировки.
//
// Параметры:
//  ПараметрыОтчета		 - ПараметрыСхемыКомпоновкиДанных - параметры.
//  КомпоновщикНастроек	 - КомпоновщикНастроек - компоновщик настроек СКД.
Процедура ДобавитьГруппировки(ПараметрыОтчета, КомпоновщикНастроек) Экспорт
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		СтруктураНастроек = КомпоновщикНастроек.Настройки.Структура;
	Иначе
		СтруктураНастроек = КомпоновщикНастроек;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураНастроек Цикл
		
		Группировка = ЭлементСтруктуры;
		
		Если ТипЗнч(Группировка) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Родитель = Группировка.Родитель;
			ПерваяГруппировка = Истина;
			Индекс = Родитель.Структура.Индекс(Группировка);
			Родитель.Структура.Удалить(Группировка);
			Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл 
				Если ПолеВыбраннойГруппировки.Использование Тогда
					Если ПерваяГруппировка Тогда
						Группировка = Родитель.Структура.Вставить(Индекс, Тип("ГруппировкаКомпоновкиДанных"));
						ПерваяГруппировка = Ложь;
					Иначе
						Группировка = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
					КонецЕсли;
					
					ПолеГруппировки = Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
					ПолеГруппировки.Использование  = Истина;
					ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
					Если ПолеВыбраннойГруппировки.ТипГруппировки = 1 Тогда
						ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
					ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = 2 Тогда
						ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
					Иначе
						ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
					КонецЕсли;
					Если Не ПолеВыбраннойГруппировки.ВыключитьАвтоПоля Тогда
						Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
						Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет начальные значения дополнительных полей.
//
// Параметры:
//  КомпоновщикНастроек	 - КомпоновщикНастроек - компоновщик настроек СКД.
//  ДопПоля				 - ДоступныеПоляКомпоновкиДанных - коллекция полей СКД.
Процедура ЗаполнитьНачальныеЗначенияДопПолей(КомпоновщикНастроек, ДопПоля) Экспорт 
	
	ДопПоля.Очистить();
	
	ГруппировкаПроект = ПолучитьГруппировкуПоПроекту(КомпоновщикНастроек);
					
	Для Каждого ЭлементВыбора Из ГруппировкаПроект.Выбор.Элементы Цикл
		
		Поле = Строка(ЭлементВыбора.Поле);
		
		НоваяСтрока 			  = ДопПоля.Добавить();
		НоваяСтрока.Поле		  = Поле;
		НоваяСтрока.Использование = ЭлементВыбора.Использование;
		//НоваяСтрока.Представление = ПолучитьСвойствоПоля(КомпоновщикНастроек, НоваяСтрока.Поле);
		НоваяСтрока.Представление = ЭлементВыбора.Заголовок;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет дополнительные поля.
//
// Параметры:
//  ПараметрыОтчета		 - ПараметрыСхемыКомпоновкиДанных	 - параметры.
//  КомпоновщикНастроек	 - КомпоновщикНастроек				 - компоновщик настроек СКД.
//  ТолькоВыбранныеПоля	 - Булево
//
Процедура ДобавитьДопПоля(ПараметрыОтчета, КомпоновщикНастроек, ТолькоВыбранныеПоля = Ложь) Экспорт
	
	ДопПоля = ПараметрыОтчета.ДополнительныеПоля;
	
	ГруппировкаПроект = ПолучитьГруппировкуПоПроекту(КомпоновщикНастроек);
	
	Для Каждого ДопПоле Из ДопПоля Цикл
		
		Группировка = ПараметрыОтчета.Группировка.Найти(ДопПоле.Поле, "Поле");
		Если Группировка = Неопределено ИЛИ НЕ Группировка.Использование Тогда
			
			НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			НовоеПолеКомпоновкиДанных.Использование = ДопПоле.Использование;
			НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ДопПоле.Поле);
			
			ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Использование = ДопПоле.Использование;
			ВыбранноеПоле.Заголовок =  ДопПоле.Представление;
			ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТолькоВыбранныеПоля Тогда
		Возврат;
	КонецЕсли;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Проект.ЭтоПроектнаяЗадача");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Проект.СсылкаНаПроектнуюЗадачу");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Проект.ПометкаУдаления");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Проект.ПортфельПроектов");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Проект.ПортфельПроектов.КартинкаПоУмолчанию");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ЭтоВеха");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ЭтоМодельПакетаРабот");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("КодСДРВПрограмме");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
	
	НовоеПолеКомпоновкиДанных = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеКомпоновкиДанных.Использование = Истина;
	НовоеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("СтатусПроекта");
	
	ВыбранноеПоле = ГруппировкаПроект.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок =  "";
	ВыбранноеПоле.Поле = НовоеПолеКомпоновкиДанных.Поле;
	
КонецПроцедуры

// Формирует дерево показателей и помещает во временное хранилище.
//
// Параметры:
//  Параметры		 - Структура		 - Структура, ключи:
//  		* ОсновнаяСхемаКомпоновкиДанных - СхемаКомпоновкиДанных.
//  		* СписокПолей - СписокЗначений.
//  		* Настройки - НастройкиКомпоновкиДанных.
//  		* ДополнительныеНастройки - НастройкиКомпоновкиДанных.
//  		* СКД - СхемаКомпоновкиДанных.
//  АдресХранилища	 - Строка	 - адрес временного хранилища.
//
Процедура ПолучитьДеревоПоказателей(Параметры, АдресХранилища = "") Экспорт
	
	ДеревоОбъект = Новый ДеревоЗначений;

	ПроцессорКомпоновкиДанных = ПодготовитьСхемуСКД(Параметры, АдресХранилища);
	
	Если ПроцессорКомпоновкиДанных <> Неопределено Тогда
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ДеревоОбъект);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		ДеревоОбъект.Колонки.ПроектЭтоПроектнаяЗадача.Имя = "ЭтоПроектнаяЗадача";
		
	КонецЕсли;
	
	Если АдресХранилища = "" Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("ДеревоПоказателей", ДеревоОбъект));
	Иначе
		ПоместитьВоВременноеХранилище(Новый Структура("ДеревоПоказателей", ДеревоОбъект), АдресХранилища);
	КонецЕсли;

КонецПроцедуры

// Готовит схему СКД.
//
// Параметры:
//  Параметры			 - Структура - параметры схемы.
//  АдресХранилища		 - Строка	 - адрес временного хранилища.
//  КоличествоВложенных	 - Число	 - ограничение количества вложенных схем.
//  ДанныеРасшифровки	 - ДанныеРасшифровкиКомпоновкиДанных
// 
// Возвращаемое значение:
//  ПроцессорКомпоновкиДанных - процессор КД.
//
Функция ПодготовитьСхемуСКД(Параметры, АдресХранилища = "", КоличествоВложенных = 0, ДанныеРасшифровки = Неопределено) Экспорт
	
	СписокПолей 			= Параметры.СписокПолей;
	Настройки 				= Параметры.Настройки;
	ДополнительныеНастройки = Параметры.ДополнительныеНастройки;
	СКД 					= Параметры.СКД;
	
	ВыводитьТолькоСНенулевымиПоказателями = Неопределено;
	ВыводитьПроектныеЗадачи = Неопределено;
	НеВыводитьЭлементИерархииВПодчиненных = Неопределено;
	ОтдельныеЗапросыДляПроектовИЗадач = Неопределено;
	Параметры.Свойство("ВыводитьТолькоСНенулевымиПоказателями", ВыводитьТолькоСНенулевымиПоказателями);
	Параметры.Свойство("ВыводитьПроектныеЗадачи", ВыводитьПроектныеЗадачи);
	Параметры.Свойство("НеВыводитьЭлементИерархииВПодчиненных", НеВыводитьЭлементИерархииВПодчиненных);
	Параметры.Свойство("ОтдельныеЗапросыДляПроектовИЗадач", ОтдельныеЗапросыДляПроектовИЗадач);
	Если ВыводитьТолькоСНенулевымиПоказателями = Неопределено Тогда
		ВыводитьТолькоСНенулевымиПоказателями = Ложь;
	КонецЕсли;
	Если ВыводитьПроектныеЗадачи = Неопределено Тогда
		ВыводитьПроектныеЗадачи = Истина;
	КонецЕсли;
	Если НеВыводитьЭлементИерархииВПодчиненных = Неопределено Тогда
		НеВыводитьЭлементИерархииВПодчиненных = Ложь;
	КонецЕсли;
	Если ОтдельныеЗапросыДляПроектовИЗадач = Неопределено Тогда
		ОтдельныеЗапросыДляПроектовИЗадач = Ложь;
	КонецЕсли;
	
	ОбработатьОтборПоВидуОперацииРекурсивно(Параметры.ДополнительныеНастройки.Отбор.Элементы);
	
	СписокПроектов = ПолучитьСписокПроектов(Параметры, ВыводитьПроектныеЗадачи);
	
	ДопПараметры = Новый Соответствие;
	
	Текст = ПолучитьТекстЗапроса();
	
	ТекстПолей = "";
	ТекстСоединений = "
		|   ГДЕ 
		|   НЕ Проекты.ПометкаУдаления И Проекты.Ссылка В ИЕРАРХИИ (&СписокПроектов)
		|	И (("+?(НеВыводитьЭлементИерархииВПодчиненных,"НЕ &ВыводитьПроектныеЗадачи И ", "")+"НЕ Проекты.ЭтоПроектнаяЗадача)
		|	ИЛИ (&ВыводитьПроектныеЗадачи И Проекты.ЭтоПроектнаяЗадача И НЕ &ОтдельныеЗапросыДляПроектовИЗадач)
		|	ИЛИ (&ВыводитьПроектныеЗадачи И &ОтдельныеЗапросыДляПроектовИЗадач))
		|	И ВЫБОР
		|			КОГДА Проекты.ЭтоПроектнаяЗадача
		|				ТОГДА НЕ упоСвойстваПроектныхЗадачСрезПоследнихОтбор.ЗадачаОтменена
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Если НЕ СписокПолей.Количество() = 0 Тогда
		
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Индикаторы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Индикаторы
		|ИЗ
		|	Справочник.упоПоказателиПроектов КАК Индикаторы
		|ГДЕ
		|	НЕ Индикаторы.ЭтоГруппа
		|	И Индикаторы.Ссылка В(&СписокИндикаторов)
		|;
		|" + Текст;
		
		ТекстЗапросаДляИндикаторов = ПолучитьТекстЗапросаДляИндикаторов(СписокПолей, 
			ДопПараметры, ВыводитьПроектныеЗадачи, ОтдельныеЗапросыДляПроектовИЗадач);
		
		ТекстСоединений = "
			|	ПОЛНОЕ СОЕДИНЕНИЕ Индикаторы КАК Индикаторы
			|	ПО ИСТИНА
			|	
			|	ЛЕВОЕ СОЕДИНЕНИЕ (" + ТекстЗапросаДляИндикаторов + ") КАК ЗначенияИндикаторов
			|	ПО Индикаторы.Ссылка = ЗначенияИндикаторов.Индикатор
			|		И Проекты.Ссылка = ЗначенияИндикаторов.Объект" + ТекстСоединений;
		
		ТекстПолей = ",
			|	Индикаторы.Ссылка КАК Показатель,
			|	ПРЕДСТАВЛЕНИЕ(Индикаторы.Ссылка),
			|	ЗначенияИндикаторов.ЗначениеИндикатора КАК ЗначениеПоказателя,
			|	Индикаторы.Ссылка.СчитатьСуммуПоГруппировкам КАК СчитатьСуммуПоГруппировкам
			|";
		
		Текст = Текст + " ИТОГИ  
			|//ИТОГОВОЕПОЛЕ
			|ПО Объект";
	
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "//ПОКАЗАТЕЛИ", ТекстПолей);
	Текст = СтрЗаменить(Текст, "//СОЕДИНЕНИЕ_ПОКАЗАТЕЛЕЙ", ТекстСоединений);
	
	ТаблицаПоказателейИндикаторов = СоздатьПустуюТаблицуПоказателейИндикаторов();
	
	Для Каждого СтрокаПоказателя Из СписокПолей Цикл
		
		ДанныеПоказателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаПоказателя.Значение, "ТипИндикатора, ТипСсылки, Наименование");
		Если ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Булево");
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Дата");
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Строка");
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
			КЧ = Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой);
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов("Число", КЧ);
		ИначеЕсли ДанныеПоказателя.ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка Тогда	
			МассивТипов = упоПанельПоказателейКлиентСервер.ПолучитьМассивТиповПоТипуСсылки(ДанныеПоказателя.ТипСсылки);
			ОписаниеТиповПоляПоказателя = Новый ОписаниеТипов(МассивТипов);			
		КонецЕсли;
		
		ТаблицаПоказателейИндикаторов.Колонки.Добавить(
			СтрокаПоказателя.Представление, ОписаниеТиповПоляПоказателя, ДанныеПоказателя.Наименование, 16);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("СписокПроектов", СписокПроектов);
	
	Для Каждого допПараметр Из ДопПараметры Цикл
		Запрос.УстановитьПараметр(допПараметр.Ключ, допПараметр.Значение);
	КонецЦикла;
	
	// Установка параметра ТекДата нужна для расчета показателей ФОТ. Аналогичное получение текущей даты использовано
	// в процедуре ЗагрузитьПроектИзБазыИПолучитьДопПеременные формы обработки упоУпрощенныйВводСтруктурыПроекта.
	ТекДата = упоПоказателиПроектовСервер.ПолучитьТекДатуДляПоказателейФОТ();
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
			
	Запрос.УстановитьПараметр("ПустойРуководитель", Справочники.упоСотрудники.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойСтатус", Перечисления.упоСостояниеСтатусаПроекта.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписокИндикаторов", СписокПолей);
	Запрос.УстановитьПараметр("ВыводитьПроектныеЗадачи", ВыводитьПроектныеЗадачи);
	Запрос.УстановитьПараметр("ОтдельныеЗапросыДляПроектовИЗадач", ОтдельныеЗапросыДляПроектовИЗадач);
	Запрос.УстановитьПараметр("ТекДатаСеанса", ТекущаяДатаСеанса());
	
	// Строки, у которых все показатели  = null удаляем только после обработки
 	// результата запроса, иначе будет вылезать ошибка в вычисляемых полях.
	МассивСтрокНаУдаление = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаПоказателейИндикаторов = ТаблицаПоказателейИндикаторов.Добавить();
		НоваяСтрокаПоказателейИндикаторов.Проект = Выборка.Объект;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказателейИндикаторов, Выборка);
		
		ВыборкаПолей = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
		
		ЕстьНеNULL = Ложь;
		
		Пока ВыборкаПолей.Следующий() Цикл
			
			НетГруппировки = ПроверитьГруппировкуПоПроекту(Выборка.Объект,
				ВыводитьПроектныеЗадачи,
				ОтдельныеЗапросыДляПроектовИЗадач,
				ВыборкаПолей.ЭтоПроектнаяЗадача,
				ВыборкаПолей.СчитатьСуммуПоГруппировкам);
				
			Если НетГруппировки Тогда
				Продолжить;
			КонецЕсли;	
			
			Если ВыборкаПолей.Показатель = Null Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВыборкаПолей.ЗначениеПоказателя <> Null Тогда
				ЕстьНеNULL = Истина;
			КонецЕсли;
			
			ПредставлениеИндикатора = СписокПолей.НайтиПоЗначению(ВыборкаПолей.Показатель).Представление;
			НоваяСтрокаПоказателейИндикаторов[ПредставлениеИндикатора] = ВыборкаПолей.ЗначениеПоказателя;
			НоваяСтрокаПоказателейИндикаторов.СтатусПроекта = ВыборкаПолей.СтатусПроекта;
			НоваяСтрокаПоказателейИндикаторов.РуководительПроекта = ВыборкаПолей.РуководительПроекта;
			НоваяСтрокаПоказателейИндикаторов.КураторПроекта = ВыборкаПолей.КураторПроекта;
			НоваяСтрокаПоказателейИндикаторов.ЭтоВеха = ВыборкаПолей.ЭтоВеха;
			НоваяСтрокаПоказателейИндикаторов.ЭтоМодельПакетаРабот = ВыборкаПолей.ЭтоМодельПакетаРабот;
			НоваяСтрокаПоказателейИндикаторов.КодСДРВПрограмме = ВыборкаПолей.КодСДРВПрограмме;
			НоваяСтрокаПоказателейИндикаторов.ВидОперации = ВыборкаПолей.ВидОперации;
			НоваяСтрокаПоказателейИндикаторов.ОбъектПЗ = ВыборкаПолей.ОбъектПЗ;
			НоваяСтрокаПоказателейИндикаторов.ОбъектПроекта = ВыборкаПолей.ОбъектПроекта;
		КонецЦикла;
		
		Если НЕ ЕстьНеNULL Тогда
			
			Если ВыводитьТолькоСНенулевымиПоказателями Тогда
				МассивСтрокНаУдаление.Добавить(НоваяСтрокаПоказателейИндикаторов);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаНаУдаление Из МассивСтрокНаУдаление Цикл		
		ТаблицаПоказателейИндикаторов.Удалить(СтрокаНаУдаление);	
	КонецЦикла;
	
	ЗаполнитьПоказателиПредшественниковВТаблицеПоказателей(ТаблицаПоказателейИндикаторов, СписокПолей);
		
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Основной", ТаблицаПоказателейИндикаторов);

	НастройкиКомпоновки = ДополнительныеНастройки;
	
	Если СписокПолей.Количество() = 0 Тогда
		врКомпоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
		врКомпоновщик.ЗагрузитьНастройки(ДополнительныеНастройки);
		врНастройкиКомпоновки = врКомпоновщик.ПолучитьНастройки();
		НастройкиКомпоновки.Отбор.Элементы.Очистить();
		
		ДопПараметры = Новый Структура("НеКопироватьПоказатели", Истина);
		упоТиповыеОтчетыСервер.СкопироватьОтборВНастройки(врНастройкиКомпоновки.Отбор.Элементы, НастройкиКомпоновки.Отбор.Элементы, ДопПараметры);
	КонецЕсли;
	
	НастройкиКомпоновки.ПараметрыВывода.УстановитьЗначениеПараметра("ВертикальноеРасположениеОбщихИтогов", 
		РасположениеИтоговКомпоновкиДанных.Конец);
	
	МассивГруппировок = Новый Массив;
	КоличествоВложенных = 0;
	ДобавитьАвтоПоле(НастройкиКомпоновки.Структура, МассивГруппировок, КоличествоВложенных);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Если ДанныеРасшифровки = Неопределено Тогда
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КонецЕсли;
	
	ЭтоВызовИзПанелиПоказателей = Неопределено;
	Параметры.Свойство("ЭтоВызовИзПанелиПоказателей", ЭтоВызовИзПанелиПоказателей); 
	ЭлементыОтбора = НастройкиКомпоновки.Отбор.Элементы;
	ИзменитьВидСравненияЭлементовОтбораПроекта(ВыводитьПроектныеЗадачи, ЭлементыОтбора,
																				 ЭтоВызовИзПанелиПоказателей);	
	
	СортировкаЭлементов = НастройкиКомпоновки.Порядок.Элементы;
	ДобавитьСортировкуПоКодуСДР(СортировкаЭлементов);
	
	Попытка
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновки, ДанныеРасшифровки,,
			Тип(Параметры.ТипГенератораМакета));
					
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	Возврат ПроцессорКомпоновкиДанных;
	
КонецФункции

// Используется для функции упоПанельПоказателейКлиентСервер.ПолучитьМассивТиповПоТипуСсылки
// 
// Возвращаемое значение:
//  ОписаниеТипов - все ссылочные типы конфигурации.
//
Функция ОписаниеТипаВсеСсылки() Экспорт

	Возврат ОбщегоНазначения.ОписаниеТипаВсеСсылки();

КонецФункции // ()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗаполнитьПоказателиПредшественниковВТаблицеПоказателей(ТаблицаПоказателейИндикаторов, СписокПолей) Экспорт 
	
	ПолеПредшественники = СписокПолей.НайтиПоЗначению(Справочники.упоПоказателиПроектов.Предшественники);
	ПолеПредшественникиПроектов = СписокПолей.НайтиПоЗначению(Справочники.упоПоказателиПроектов.ВнешниеПредшественники);
	
	Если ПолеПредшественники = Неопределено И ПолеПредшественникиПроектов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивЗеркалПроектныхЗадач = ТаблицаПоказателейИндикаторов.Скопировать(Новый Структура("ЭтоПроектнаяЗадача", Истина)).ВыгрузитьКолонку("Проект"); 
	
	СоответствиеПредшественников = упоПоказателиПроектовСервер.ПолучитьСоответствиеПоказателейПредшественников(МассивЗеркалПроектныхЗадач);
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоказателейИндикаторов Цикл
		СтруктураЗадачи = СоответствиеПредшественников.Получить(СтрокаТаблицы.Проект);
		Если СтруктураЗадачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ПолеПредшественники = Неопределено Тогда
			СтрокаТаблицы[ПолеПредшественники.Представление] = СтрСоединить(СтруктураЗадачи.Предшественники);
		КонецЕсли; 
		Если НЕ ПолеПредшественникиПроектов = Неопределено Тогда
			СтрокаТаблицы[ПолеПредшественникиПроектов.Представление] = СтрСоединить(СтруктураЗадачи.ПредшественникиПроектов);
		КонецЕсли; 
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

#Область ИнициализацияКомпоновщика

Процедура ИнициализироватьКомпоновщик(Объект, СтруктураДанных, ВторичнаяИнициализация = Ложь, ИзОтчета = Ложь, ЭтоПрограммноеФормирование = Ложь) Экспорт
	
	Перем ПрименяемыеНастройки;
	
	ТаблицаПоказателей = СтруктураДанных.ТаблицаПоказателей;
	
	ТаблицаИндикаторов = Новый ТаблицаЗначений;
	
	ТаблицаИндикаторов.Колонки.Добавить("ИмяПоказателя");
	ТаблицаИндикаторов.Колонки.Добавить("СсылкаНаПоказатель");
	ТаблицаИндикаторов.Колонки.Добавить("ЗаголовокПоказателя");
	ТаблицаИндикаторов.Колонки.Добавить("ЭтоФормула");
	ТаблицаИндикаторов.Колонки.Добавить("ФормулаРасчета");
	ТаблицаИндикаторов.Колонки.Добавить("ТолькоВФормуле");	
	ТаблицаИндикаторов.Колонки.Добавить("ТипЗначения");	
	ТаблицаИндикаторов.Колонки.Добавить("ФорматнаяСтрока");	
	ТаблицаИндикаторов.Колонки.Добавить("Группировки");	
	ТаблицаИндикаторов.Колонки.Добавить("ВыражениеГруппировки");	
	ТаблицаИндикаторов.Колонки.Добавить("ПринадлежностьПоказателя");
	ТаблицаИндикаторов.Колонки.Добавить("ТипИндикатора");
		
	ТаблицаИндикаторов.Индексы.Добавить("СсылкаНаПоказатель");
	
	Если ВторичнаяИнициализация Тогда
		
		ПрименяемыеНастройки = Объект.ДопКомпоновщикНастроек.ПолучитьНастройки();
		Если ИзОтчета Тогда
			Объект.АвтоФиксация = СтруктураДанных.ПолучитьКоличествоПолейДляФиксацииСлева(ПрименяемыеНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	СписокИндикаторов = Новый Массив;		
	
	СписокИндикаторовТолькоФормула = Новый СписокЗначений;	
	СписокПростыхПолей = Новый СписокЗначений;
	СписокПоФормуле = Новый СписокЗначений;
	
	ОтборИспользуемых = Новый Структура;
	ОтборИспользуемых.Вставить("Использовать", Истина);
	
	Если ТипЗнч(ТаблицаПоказателей) = Тип("ДанныеФормыКоллекция") Тогда
		ВыбранныеИндикаторы = ТаблицаПоказателей.Выгрузить(ОтборИспользуемых);
	Иначе
		ВыбранныеИндикаторы = ТаблицаПоказателей.НайтиСтроки(ОтборИспользуемых);
	КонецЕсли;
	ПодготовитьСпискиИндикаторов(Объект, СтруктураДанных, ВыбранныеИндикаторы, ТаблицаИндикаторов, ЭтоПрограммноеФормирование);
	
	СКД = Новый СхемаКомпоновкиДанных;
	НовыйИсточник = СКД.ИсточникиДанных.Добавить();
	НовыйИсточник.Имя = "ИсточникДанных1";
	НовыйИсточник.ТипИсточникаДанных = "Local";
	
	НовыйНаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НовыйНаборДанных.ИсточникДанных = "Local";
	
	НовыйНаборДанных.Имя = "Основной";
	НовыйНаборДанных.ИмяОбъекта = "Основной"; 	
	НовыйНаборДанных.ИсточникДанных = "ИсточникДанных1";
	
	ДобавитьОбщиеПоля(НовыйНаборДанных);
	
	ДобавитьПараметры(СКД);
	
	индексПоля = 0;
	
	МассивПоФормуле = Новый Массив;
	СписокПростыхПолей = Новый СписокЗначений;
	
	Для Каждого ЭлементРеквизит Из ТаблицаИндикаторов Цикл
		
		Если ЭлементРеквизит.ТипЗначения = Неопределено Тогда
			
			НСтрока = НСтр("ru = 'Ошибка в заполнении показателя: ""%1"": не заполнен тип значения'");
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, ЭлементРеквизит.СсылкаНаПоказатель);
			Сообщение.КлючДанных = ЭлементРеквизит.СсылкаНаПоказатель;
			Сообщение.Сообщить();
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЭлементРеквизит.ЭтоФормула = Ложь Тогда
			
			НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			НовоеПолеНабораДанных.Заголовок = ЭлементРеквизит.ЗаголовокПоказателя;
			НовоеПолеНабораДанных.Поле =  ЭлементРеквизит.ИмяПоказателя;
			НовоеПолеНабораДанных.Оформление.УстановитьЗначениеПараметра("Формат", ЭлементРеквизит.ФорматнаяСтрока);
			
			Если ЭлементРеквизит.ТолькоВФормуле Тогда
				
				НовоеПолеНабораДанных.ОграничениеИспользования.Группировка = Истина;
				НовоеПолеНабораДанных.ОграничениеИспользования.Поле = Истина;
				Если ИзОтчета Тогда
					НовоеПолеНабораДанных.ОграничениеИспользования.Порядок = Истина;
					НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;	
				Иначе
					НовоеПолеНабораДанных.ОграничениеИспользования.Порядок = Ложь;
					НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
			НовоеПолеНабораДанных.ТипЗначения = ЭлементРеквизит.ТипЗначения;				
			НовоеПолеНабораДанных.ПутьКДанным = ЭлементРеквизит.ИмяПоказателя;
			Если ИзОтчета Тогда
			Иначе
				НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
				НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементРеквизит Из ТаблицаИндикаторов Цикл
		
		Если ЭлементРеквизит.ЭтоФормула = Истина Тогда
			
			НовоеПолеВыражение = СКД.ВычисляемыеПоля.Добавить();
			НовоеПолеВыражение.Выражение = ЭлементРеквизит.ФормулаРасчета;
			НовоеПолеВыражение.Заголовок = ЭлементРеквизит.ЗаголовокПоказателя;
			НовоеПолеВыражение.ПутьКДанным = ЭлементРеквизит.ИмяПоказателя;
			НовоеПолеВыражение.Оформление.УстановитьЗначениеПараметра("Формат", ЭлементРеквизит.ФорматнаяСтрока);
			НовоеПолеВыражение.ТипЗначения =  ЭлементРеквизит.ТипЗначения;
			
			Если ЭлементРеквизит.ТолькоВФормуле Тогда
				
				НовоеПолеВыражение.ОграничениеИспользования.Группировка = Истина;
				НовоеПолеВыражение.ОграничениеИспользования.Поле = Истина;
				НовоеПолеВыражение.ОграничениеИспользования.Порядок = Истина;
				
				Если ИзОтчета Тогда
					НовоеПолеВыражение.ОграничениеИспользования.Условие = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			НовоеПолеВыражение.ОграничениеИспользования.Условие = Истина;
			НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьРесурсы(СКД, ТаблицаИндикаторов);
	
	Объект.АдресСКД = ПоместитьВоВременноеХранилище(СКД,СтруктураДанных.УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Объект.АдресСКД);
	
	Если ПрименяемыеНастройки = Неопределено Тогда
		
		НастройкиКомпоновки = СКД.НастройкиПоУмолчанию;
		Если Не ЭтоПрограммноеФормирование Тогда
			СтруктураДанных.ЗаполнитьНастройкиПоУмолчанию(НастройкиКомпоновки);
		КонецЕсли;
		
	Иначе
		
		НастройкиКомпоновки = ПрименяемыеНастройки;
		
	КонецЕсли;
	
	НастройкиКомпоновки.Выбор.Элементы.Очистить();
	
	ДобавитьПоляВыбора(НастройкиКомпоновки.Выбор.Элементы, ТаблицаИндикаторов);
	
	Для Каждого ПараметрДанных Из НастройкиКомпоновки.ПараметрыДанных.Элементы Цикл
		ПараметрДанных.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
		ПараметрДанных.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЦикла;
	
	Объект.ДопКомпоновщикНастроек.Инициализировать(ИсточникНастроек);	
	Объект.ДопКомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	
КонецПроцедуры

Функция ПолучитьИмяПоказателя(СсылкаНаПоказатель) Экспорт
	
	// УИД нужно преобразовать в такую строку, чтобы ее можно было использовать 
	// в качестве псевдонима поля запроса или имени колонки в Таблице значений.
	
	УИДСтрокой = Строка(СсылкаНаПоказатель.УникальныйИдентификатор());
	УИДСтрокой = СтрЗаменить(УИДСтрокой, "-", "_");
	УИДСтрокой = "_" + УИДСтрокой;
	
	Возврат УИДСтрокой;
	
КонецФункции

// Структура данных для программного формирования отчета.
// 
// Возвращаемое значение:
// СтруктураДанных - Структура:
//  * ТаблицаПоказателей - ТаблицаЗначений
//  * СписокПоказателейТолькоВФормуле - СписокЗначений
//  * УникальныйИдентификатор - УникальныйИдентификатор
//
Функция СтруктураДанныхДляПрограммногоФормированияОтчета() Экспорт
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("ТаблицаПоказателей", СтруктураТаблицыПоказателей());
	СтруктураДанных.Вставить("СписокПоказателейТолькоВФормуле", Новый СписокЗначений);
	СтруктураДанных.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	
	ПолучитьСписокВсехПоказателей(СтруктураДанных);
	
	Возврат СтруктураДанных;
	
КонецФункции

// Таблица показателей согласно шаблону реквизита ТаблицаПоказателей формы отчёта
// (см. Отчет.упоАнализПроектовПоПоказателямСКД.ФормаОтчета).
Функция СтруктураТаблицыПоказателей() Экспорт
	
	ТаблицаПоказателей = Новый ТаблицаЗначений;
	КолонкиТаблицы = ТаблицаПоказателей.Колонки;
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТипаСправочникПоказателиПроектов = Новый ОписаниеТипов("СправочникСсылка.упоПоказателиПроектов");
	ОписаниеТипаПринадлежностьПоказателя = Новый ОписаниеТипов("ПеречислениеСсылка.упоПринадлежностьПоказателя");
	ОписаниеТипаТипИндикатора = Новый ОписаниеТипов("ПеречислениеСсылка.упоТипИндикатора");
	
	КолонкиТаблицы.Добавить("Использовать", ОписаниеТипаБулево);
	КолонкиТаблицы.Добавить("Показатель", ОписаниеТипаСправочникПоказателиПроектов);
	КолонкиТаблицы.Добавить("Группа", ОписаниеТипаСправочникПоказателиПроектов);
	КолонкиТаблицы.Добавить("Порядок", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	КолонкиТаблицы.Добавить("ФорматнаяСтрока", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	КолонкиТаблицы.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(32));
	КолонкиТаблицы.Добавить("ТипЗаполнения", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	КолонкиТаблицы.Добавить("Группировки", ОписаниеТипаБулево);
	КолонкиТаблицы.Добавить("ВыражениеГруппировки", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	КолонкиТаблицы.Добавить("ПринадлежностьПоказателя", ОписаниеТипаПринадлежностьПоказателя);
	КолонкиТаблицы.Добавить("ТипИндикатора", ОписаниеТипаТипИндикатора);
	КолонкиТаблицы.Добавить("ИмяПоказателя", ОбщегоНазначения.ОписаниеТипаСтрока(37));
	
	Возврат ТаблицаПоказателей;
	
КонецФункции

// Получает список всех показателей.
//
// Параметры:
//  СтруктураДанных - Структура\Форма	 - Объект с полем ТаблицаПоказателей
//  ИзОтчета - Булево	 - признак вызова из отчета.
//
Процедура ПолучитьСписокВсехПоказателей(СтруктураДанных, ИзОтчета = Ложь) Экспорт
	
	Если ТипЗнч(СтруктураДанных.ТаблицаПоказателей) = Тип("ТаблицаЗначений") Тогда
		ТаблицаПоказателей = СтруктураДанных.ТаблицаПоказателей;
		КэшПоказателей = ТаблицаПоказателей;
	Иначе
		ТаблицаПоказателей = СтруктураДанных.ТаблицаПоказателей;
		КэшПоказателей = ТаблицаПоказателей.Выгрузить();
		ТаблицаПоказателей.Очистить();
	КонецЕсли;
	
	ЗапросПоказателей = Новый Запрос;
	ЗапросПоказателей.Текст = "ВЫБРАТЬ
	                          |	упоПоказателиПроектов.Ссылка КАК Показатель,
	                          |	упоПоказателиПроектов.Родитель КАК Группа,
	                          |	упоПоказателиПроектов.Порядок КАК Порядок,
	                          |	ВЫРАЗИТЬ(упоПоказателиПроектов.ФорматнаяСтрока КАК СТРОКА(100)) КАК ФорматнаяСтрока,
	                          |	упоПоказателиПроектов.Наименование КАК Наименование,
	                          |	упоПоказателиПроектов.ТипЗаполнения КАК ТипЗаполнения,
	                          |	упоПоказателиПроектов.СчитатьСуммуПоГруппировкам КАК Группировки,
	                          |	упоПоказателиПроектов.ВыражениеГруппировки КАК ВыражениеГруппировки,
	                          |	упоПоказателиПроектов.ТипИндикатора КАК ТипИндикатора,
	                          |	упоПоказателиПроектов.ПринадлежностьПоказателя КАК ПринадлежностьПоказателя,
	                          |	упоПоказателиПроектов.ТипСсылки КАК ТипСсылки,
	                          |	ВЫБОР
	                          |		КОГДА упоПоказателиПроектов.ПометкаУдаления
	                          |			ТОГДА 4
	                          |		КОГДА упоПоказателиПроектов.Предопределенный
	                          |				ИЛИ упоПоказателиПроектов.ПредустановленныйКод <> """"
	                          |			ТОГДА 5
	                          |		ИНАЧЕ 3
	                          |	КОНЕЦ КАК ИндексКартинки
	                          |ИЗ
	                          |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	                          |ГДЕ
	                          |	НЕ упоПоказателиПроектов.ПометкаУдаления
	                          |	И НЕ упоПоказателиПроектов.ЭтоГруппа
	                          |	И НЕ упоПоказателиПроектов.ТекстЗапроса ПОДОБНО &ПараметрНачалоПериода
	                          |	И НЕ упоПоказателиПроектов.ТекстЗапросаПЗ ПОДОБНО &ПараметрНачалоПериода
	                          |	И НЕ упоПоказателиПроектов.ПринадлежностьПоказателя = ЗНАЧЕНИЕ(Перечисление.упоПринадлежностьПоказателя.Произвольный)
	                          |
	                          |УПОРЯДОЧИТЬ ПО
	                          |	упоПоказателиПроектов.Родитель,
	                          |	упоПоказателиПроектов.Порядок";
	
	ЗапросПоказателей.УстановитьПараметр("ПараметрНачалоПериода", "%&НачалоПериода%");
	
	Выборка = ЗапросПоказателей.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		
		Если КэшПоказателей.Количество() = 0 Тогда
			
			НоваяСтрока.Использовать = ИзОтчета;
			
		Иначе
			
			ПоказательБылВыбран = КэшПоказателей.Найти(Выборка.Показатель, "Показатель");
			Если ПоказательБылВыбран <> Неопределено Тогда
				НоваяСтрока.Использовать = ПоказательБылВыбран.Использовать;
			Иначе
				НоваяСтрока.Использовать = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ИмяПоказателя = ПолучитьИмяПоказателя(Выборка.Показатель);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет параметры <Источника> в <Приемник>.
//
// Параметры:
//  Приемник – ТаблицаЗначений - Колонки: ИмяПараметра, ЭтоВыражение, ЗначениеПараметра.
//  Источник – ТаблицаЗначений - Колонки: ИмяПараметра, ЭтоВыражение, ЗначениеПараметра.
//
Процедура СкопироватьПараметры(Приемник, Источник) Экспорт
	
	Если Источник <> Неопределено И Приемник <> Неопределено Тогда
		
		Для каждого СтрокаПараметров Из Источник Цикл
			
			Если СтрокаПараметров.ЭтоВыражение = Истина Тогда
				Попытка
					Приемник.Вставить(СтрокаПараметров.ИмяПараметра, Вычислить(СтрокаПараметров.ЗначениеПараметра));
				Исключение
					обПредупреждение(НСтр("ru='Ошибка в выражении параметра '") + СтрокаПараметров.ИмяПараметра);
				КонецПопытки;
			Иначе
				Приемник.Вставить(СтрокаПараметров.ИмяПараметра, СтрокаПараметров.ЗначениеПараметра);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтборПоКомпоненту(НастройкиКомпоновки) Экспорт
	
	НовыйЭлементОтбора = Неопределено;
	ПолеКомпоновкиДанныхКомпонент = Новый ПолеКомпоновкиДанных("Компонент");
	
	Для Каждого ЭлементОтбора Из НастройкиКомпоновки.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанныхКомпонент Тогда
			
			НовыйЭлементОтбора = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НовыйЭлементОтбора = Неопределено Тогда
		НовыйЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанныхКомпонент;
	КонецЕсли;
	
	НовыйЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.упоКомпоненты.Проект");
	НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Структура, Группировка)
	
	Если Структура.ПоляГруппировки.Элементы.Количество() > 0 Тогда
		
		Поле = Строка(Структура.ПоляГруппировки.Элементы[0].Поле);
		НоваяСтрока = Группировка.Добавить();
		
		НоваяСтрока.Использование  = Структура.Использование;
		НоваяСтрока.Поле           = Поле;
		НоваяСтрока.Представление  = ПолучитьСвойствоПоля(КомпоновщикНастроек, НоваяСтрока.Поле);
		ТипГруппировки = Структура.ПоляГруппировки.Элементы[0].ТипГруппировки;
		Если ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
			НоваяСтрока.ТипГруппировки = 1;
		ИначеЕсли ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
			НоваяСтрока.ТипГруппировки = 2;
		Иначе
			НоваяСтрока.ТипГруппировки = 0;
		КонецЕсли;
		
		Если Структура.Структура.Количество() > 0 Тогда
			ЗаполнитьГруппировкиИзНастроек(КомпоновщикНастроек, Структура.Структура[0], Группировка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГруппировкуПоПроекту(КомпоновщикНастроек)
	
	ПолеПроект = Новый ПолеКомпоновкиДанных("Проект");
	
	Если КомпоновщикНастроек.Настройки.Структура.Количество() > 0 Тогда
				
		ЭлементСтруктуры  = КомпоновщикНастроек.Настройки.Структура[0];		
		ГруппировкаПроект = Неопределено;
		
		Пока ГруппировкаПроект = Неопределено Цикл 
			
			Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				
				Если ПолеГруппировки.Поле = ПолеПроект Тогда
					ГруппировкаПроект = ЭлементСтруктуры;
					Прервать;
				КонецЕсли; 
				
			КонецЦикла;
			
			Если ТипЗнч(ГруппировкаПроект) = Тип("ГруппировкаКомпоновкиДанных") Тогда 
				Прервать;	
			КонецЕсли; 
			
			Если ЭлементСтруктуры.Структура.Количество() > 0 Тогда
				ЭлементСтруктуры = ЭлементСтруктуры.Структура[0];
			Иначе
				ГруппировкаПроект = Ложь;
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе 
		ГруппировкаПроект = Ложь;	
		ЭлементСтруктуры = КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	Если ТипЗнч(ГруппировкаПроект) = Тип("Булево") Тогда
		
		ГруппировкаПроект 				= ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ГруппировкаПроект.Использование = Истина;
		
		НовоеПолеКомпоновкиДанных 				 = ГруппировкаПроект.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НовоеПолеКомпоновкиДанных.Использование  = Истина;
		НовоеПолеКомпоновкиДанных.Поле 			 = ПолеПроект;
		НовоеПолеКомпоновкиДанных.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;	
		
	КонецЕсли;
	
	Возврат ГруппировкаПроект;
		
КонецФункции

Функция ПолучитьСписокПроектов(Параметры, СПроектнымиЗадачами = Ложь)
	
	ТекущийОтбор = Параметры.ДополнительныеНастройки.Отбор;
	НастройкиКомпоновки  = Параметры.Настройки;	
	
	// Очистка отбор не нужна, если формируется отчет упоАнализПроектовПоПоказателямСКД.
	Если (Параметры.Свойство("ОчищатьОтборКомпоновщикаНастроек") И Параметры.ОчищатьОтборКомпоновщикаНастроек = Истина)
		ИЛИ НЕ Параметры.Свойство("ОчищатьОтборКомпоновщикаНастроек") Тогда
		НастройкиКомпоновки.Отбор.Элементы.Очистить();
	КонецЕсли;
	
	// Если формируется отчет упоАнализПроектовПоПоказателямСКД, то копировать настройки не надо,
	// т.к. в доп. отборе содержатся показатели, а таблице-источике для получения списка проектов
	// просто нет колонок, по которым будет сделана попытка произвести отбор (нет показателей).
	Если (Параметры.Свойство("КопироватьОтборИзДопНастроекВНастройки") И Параметры.КопироватьОтборИзДопНастроекВНастройки = Истина)
		ИЛИ НЕ Параметры.Свойство("КопироватьОтборИзДопНастроекВНастройки") Тогда
		ДопПараметры = Новый Структура("НеКопироватьПоказатели", Истина);
		упоТиповыеОтчетыСервер.СкопироватьОтборВНастройки(ТекущийОтбор.Элементы, НастройкиКомпоновки.Отбор.Элементы, ДопПараметры);
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьТекстЗапросаСпискаПроектов();	
	ТекстЗапроса = УдалитьТаблицуСОбъектомПЗЕслиПоОбъектуНетОтбора(ТекстЗапроса, НастройкиКомпоновки.Отбор.Элементы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустойСтатус", Перечисления.упоСостояниеСтатусаПроекта.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойРуководитель", Справочники.упоСотрудники.ПустаяСсылка());
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	СКД = Параметры.ОсновнаяСхемаКомпоновкиДанных;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Основной", ТаблицаРезультат);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновки, , ,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,ВнешниеНаборыДанных);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРезультат = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТаблицаРезультат.Свернуть("Проект");
	
	СписокПроектов = Новый СписокЗначений;
	Для Каждого ЭлементРезультат Из ТаблицаРезультат Цикл
		СписокПроектов.Добавить(ЭлементРезультат.Проект);
	КонецЦикла;
	
	Возврат СписокПроектов;
	
КонецФункции

// Возвращает текст запроса для списка индикаторов.
//
// Параметры:
//  СписокИндикаторов	 - СписокЗначений 	- список индикаторов.
//  Параметры			 - Структура 		- структура параметров запроса.
//
// Возвращаемое значение:
//	Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаДляИндикаторов(СписокИндикаторов, Параметры, 
												ВыводитьПроектныеЗадачи, 
												ОтдельныеЗапросыДляПроектовИЗадач = Ложь) Экспорт 
	
	ТекстЗапроса = "
		|ВЫБРАТЬ 
		|	NULL КАК Индикатор,
		|	NULL КАК Объект,
		|	NULL КАК ЗначениеИндикатора
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Индикатор,
		|	Объект,
		|	ЗначениеИндикатора
		|ИЗ
		|	РегистрСведений.упоЗначенияИндикаторов.СрезПоследних КАК ЗначенияИндикаторов
		|ГДЕ
		|	НЕ Индикатор.ВидЗаполнения = &Автоматически
		|";
	
	Параметры.Вставить("Автоматически", Перечисления.упоВидЗаполненияИндикатора.Автоматически);
	
	тзИндикаторы = Новый ТаблицаЗначений;
	тзИндикаторы.Колонки.Добавить("Значение", Новый ОписаниеТипов("СправочникСсылка.упоПоказателиПроектов"));
	тзИндикаторы.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	тзИндикаторы.Колонки.Добавить("НомерПП", Новый ОписаниеТипов("Число"));
	Сч = 1;
	Для Каждого Эл Из СписокИндикаторов Цикл
		новСтр = тзИндикаторы.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Эл);
		НовСтр.НомерПП = Сч;		
		Сч = Сч + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВтИндикаторы ИЗ &тзИндикаторы КАК тзИндикаторы";
	Запрос.УстановитьПараметр("тзИндикаторы", тзИндикаторы);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПоказателиПроектов.Ссылка КАК Показатель,
	               |	упоПоказателиПроектов.ВидЗаполнения,
	               |	упоПоказателиПроектов.ТипЗаполнения,
	               |	упоПоказателиПроектов.Наименование,
	               |	упоПоказателиПроектов.ПринадлежностьПоказателя,
	               |	упоПоказателиПроектов.ТекстЗапроса,
	               |	упоПоказателиПроектов.ТекстЗапросаПЗ,
	               |	упоПоказателиПроектов.ИмяПоляЗначения,
	               |	упоПоказателиПроектов.ИмяПоляЗначенияПЗ,
	               |	упоПоказателиПроектов.ИмяПоляОбъекта,
	               |	упоПоказателиПроектов.ИмяПоляОбъектаПЗ,
	               |	ВтИндикаторы.Представление,
	               |	упоПоказателиПроектов.ПараметрыЗапроса,
	               |	упоПоказателиПроектов.ПараметрыЗапросаПЗ
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтИндикаторы КАК ВтИндикаторы
	               |		ПО упоПоказателиПроектов.Ссылка = ВтИндикаторы.Значение
	               |ГДЕ
	               |	упоПоказателиПроектов.ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.упоВидЗаполненияИндикатора.Автоматически)
	               |	И упоПоказателиПроектов.ТипЗаполнения = 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВтИндикаторы.НомерПП";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта Тогда
			
			ДобавитьПоказательвТекстЗапроса(Параметры, ТекстЗапроса, Выборка);
				
		ИначеЕсли Выборка.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи И ВыводитьПроектныеЗадачи Тогда 
			
			ДобавитьПоказательвТекстЗапроса(Параметры, ТекстЗапроса, Выборка, Истина);
				
		ИначеЕсли Выборка.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий Тогда
				
			Если ВыводитьПроектныеЗадачи Тогда
				ДобавитьПоказательвТекстЗапроса(Параметры, ТекстЗапроса, Выборка, Истина);
			КонецЕсли;
			
			Если ОтдельныеЗапросыДляПроектовИЗадач ИЛИ Не ВыводитьПроектныеЗадачи Тогда
				ДобавитьПоказательвТекстЗапроса(Параметры, ТекстЗапроса, Выборка);
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	упоПоказателиПроектовСервер.ДобавитьПроверкуОтмененныхЗадачВТекстЗапроса(ТекстЗапроса);
	
	Возврат ТекстЗапроса;
		
КонецФункции

Процедура ДобавитьПоказательвТекстЗапроса(Параметры, ТекстЗапроса, Выборка, ЭтоПоказательДляПЗ = Ложь,
		ОтборПоПроектам = Ложь, ДополнитьДопПараметрами = Ложь) Экспорт
	
	Если ЭтоПоказательДляПЗ Тогда
		
		ТекстЗапросаПоказателя = Выборка.ТекстЗапросаПЗ;
		ИмяПоляОбъекта = Выборка.ИмяПоляОбъектаПЗ;
		ИмяПоляЗначения = Выборка.ИмяПоляЗначенияПЗ;
		ПараметрыЗапроса = Выборка.ПараметрыЗапросаПЗ;
		
	Иначе
		
		ТекстЗапросаПоказателя = Выборка.ТекстЗапроса;
		ИмяПоляОбъекта = Выборка.ИмяПоляОбъекта;
		ИмяПоляЗначения = Выборка.ИмяПоляЗначения;
		ПараметрыЗапроса = Выборка.ПараметрыЗапроса;
		
	КонецЕсли;
	
	ТекстОшибки = "";
	ЗапросКорректный = упоФункцииОбщегоНазначенияСервер.ПроверитьЗапрос(ТекстЗапросаПоказателя,
																		ТекстОшибки, 
																		Выборка.Показатель, 
																		Истина);
	Если НЕ ЗапросКорректный Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось рассчитать показатель ""%1"" для %2! %3'"),
			Выборка.Наименование,
			?(ЭтоПоказательДляПЗ, НСтр("ru = 'проектной задачи'"), НСтр("ru = 'проекта'")),
			ТекстОшибки);
					
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Показатель);
		
		Возврат;
		
	КонецЕсли;
	
	Если ОтборПоПроектам Тогда
		СтрокаВставки = "ГДЕ
		|	Главная." + ИмяПоляОбъекта + " В (&Проекты)
		|";
	Иначе
		СтрокаВставки = "";
	КонецЕсли;
		
	ШаблонЗапроса = "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ		
		|	&Индикатор" + Выборка.Представление + ",
		|	" + ИмяПоляОбъекта + ",
		|	" + ИмяПоляЗначения + "%1	
		|ИЗ
		|	(" + ТекстЗапросаПоказателя + ") КАК Главная
		|" + СтрокаВставки;
	
	Параметры.Вставить("Индикатор" + Выборка.Представление, Выборка.Показатель);
	
	Если ДополнитьДопПараметрами Тогда
		Если ЗначениеЗаполнено(Выборка.ИдентификаторПараметров) И ЗначениеЗаполнено(Выборка.Параметры) Тогда
			ШаблонТекста = "ДопПараметр%1_%2_Индикатора%3";	
			СделатьЗаменуПараметровВТекстеЗапроса(ШаблонЗапроса, Параметры, ШаблонТекста, Выборка.Параметры,
				Выборка.Представление, Выборка.ИдентификаторПараметров);
			ПараметрЗамены = "," + Символы.ПС + Символы.Таб + Выборка.ИдентификаторПараметров;
		Иначе
			ПараметрЗамены = "," + Символы.ПС + Символы.Таб + "0";	
		КонецЕсли;
	Иначе
		ПараметрЗамены = "";	
	КонецЕсли;
	 
	ШаблонЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗапроса, ПараметрЗамены);
	
	ПараметрыВложенногоЗапроса = Новый Структура;	
	упоПанельПоказателейВызовСервера.СкопироватьПараметры(ПараметрыВложенногоЗапроса, ПараметрыЗапроса.Получить());
	
	Если ПараметрыВложенногоЗапроса.Количество() = 0 Тогда
		ТекстЗапроса = ТекстЗапроса + ШаблонЗапроса;
		Возврат;
	КонецЕсли;
	
	ШаблонТекста = "Параметр_%2_Индикатора%3";		
	СделатьЗаменуПараметровВТекстеЗапроса(ШаблонЗапроса, Параметры, ШаблонТекста, ПараметрыВложенногоЗапроса, Выборка.Представление);
	
	ТекстЗапроса = ТекстЗапроса + ШаблонЗапроса;
	
КонецПроцедуры

Процедура СделатьЗаменуПараметровВТекстеЗапроса(ШаблонТекстаЗапроса, Параметры, ШаблонПараметра, СтруктураПараметров,
		Представление, Идентификатор = "")
	
	ТаблДляСортировкиПараметров = Новый ТаблицаЗначений;
	ТаблДляСортировкиПараметров.Колонки.Добавить("ИмяПараметра");
	ТаблДляСортировкиПараметров.Колонки.Добавить("Значение");
	ТаблДляСортировкиПараметров.Колонки.Добавить("ДлинаИмениПараметра");
	ТаблДляСортировкиПараметров.Колонки.Добавить("НовоеИмяПараметра");
	Для Каждого Параметр Из СтруктураПараметров Цикл
				
		Строка = ТаблДляСортировкиПараметров.Добавить();
		Строка.ИмяПараметра = Параметр.Ключ;
		Строка.Значение = Параметр.Значение;
		Строка.ДлинаИмениПараметра = СтрДлина(Параметр.Ключ);
		Строка.НовоеИмяПараметра = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПараметра, Идентификатор, Параметр.Ключ, Представление);
		
	КонецЦикла;	
	
	ТаблДляСортировкиПараметров.Сортировать("ДлинаИмениПараметра Убыв");
	
	ШаблонТекста = "&%1";
	Для Каждого Строка Из ТаблДляСортировкиПараметров Цикл
		ИмяПараметра = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, Строка.ИмяПараметра);
		НовоеИмяПараметра = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, Строка.НовоеИмяПараметра);
		ШаблонТекстаЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, ИмяПараметра, НовоеИмяПараметра);
		Параметры.Вставить(Строка.НовоеИмяПараметра, Строка.Значение);	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса(ВыводитьПроектныеЗадачи = Истина)

    Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |    Проекты.Ссылка КАК Объект,
        |    ЕСТЬNULL(Руководители.РуководительПроекта, &ПустойРуководитель) КАК РуководительПроекта,
        |    ЕСТЬNULL(Руководители.КураторПроекта, &ПустойРуководитель) КАК КураторПроекта,
        |    ЕСТЬNULL(Статусы.СтатусПроекта, &ПустойСтатус) КАК СтатусПроекта,
        |    Проекты.Автор,
        |    Проекты.АвторИзменений,
        |    Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.ИсточникФинансирования
        |        ИНАЧЕ Проекты.ИсточникФинансирования
        |    КОНЕЦ КАК ИсточникФинансирования,       
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.Организация
        |        ИНАЧЕ Проекты.Организация
        |    КОНЕЦ КАК Организация,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.ПортфельПроектов
        |        ИНАЧЕ Проекты.ПортфельПроектов
        |    КОНЕЦ КАК ПортфельПроектов,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.ПрограммаПроектов
        |        ИНАЧЕ Проекты.ПрограммаПроектов
        |    КОНЕЦ КАК ПрограммаПроектов,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.Подразделение
        |        ИНАЧЕ Проекты.Подразделение
        |    КОНЕЦ КАК Подразделение,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.КонтрагентЗатрат
        |        ИНАЧЕ Проекты.КонтрагентЗатрат
        |    КОНЕЦ КАК КонтрагентЗатрат,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.КонтрагентДоходов
        |        ИНАЧЕ Проекты.КонтрагентДоходов
        |    КОНЕЦ КАК КонтрагентДоходов,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.ДоговорЗатрат
        |        ИНАЧЕ Проекты.ДоговорЗатрат
        |    КОНЕЦ КАК ДоговорЗатрат,
        |    Проекты.Код,
        |    Проекты.Наименование,
        |    Проекты.ПолноеНаименование,               
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.ДоговорДоходов
        |        ИНАЧЕ Проекты.ДоговорДоходов
        |    КОНЕЦ КАК ДоговорДоходов,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.Компонент
        |        ИНАЧЕ Проекты.Компонент
        |    КОНЕЦ КАК Компонент,
		|    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.Объект
        |        ИНАЧЕ Проекты.Объект
        |    КОНЕЦ КАК ОбъектПроекта
        |//ПОЛЯ_ЗАДАЧ
		|//ПОЛЕ_КодСДРВПрограмме
        |//ПОКАЗАТЕЛИ
        |{ВЫБРАТЬ
        |    РуководительПроекта,
        |    КураторПроекта,
        |    СтатусПроекта,
        |    Компонент}
        |ИЗ
        |    Справочник.Проекты КАК Проекты
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект В (&СписокПроектов)) КАК Руководители
        |        ПО (Руководители.Проект = ВЫБОР
        |                                    КОГДА Проекты.ЭтоПроектнаяЗадача
        |                                        ТОГДА Проекты.упоКорневойПроект
        |                                    ИНАЧЕ Проекты.Ссылка
        |                                КОНЕЦ)
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект В (&СписокПроектов)) КАК Статусы
        |        ПО (Статусы.Проект = ВЫБОР
        |                                КОГДА Проекты.ЭтоПроектнаяЗадача
        |                                    ТОГДА Проекты.упоКорневойПроект
        |                                ИНАЧЕ Проекты.Ссылка
        |                            КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследнихОтбор
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроектаОтбор
		|			ПО (упоСвойстваПроектныхЗадачСрезПоследнихОтбор.Версия = упоВерсииПроектаОтбор.Версия
		|					И упоВерсииПроектаОтбор.Проект В (&СписокПроектов)
		|					И упоВерсииПроектаОтбор.Текущая)
		|		ПО (Проекты.ЭтоПроектнаяЗадача 
		|			И Проекты.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследнихОтбор.ПроектнаяЗадача)
        | //СОЕДИНЕНИЕ_ЗАДАЧИ 
		| //СОЕДИНЕНИЕ_КодыСДРВПрограмме
        | //СОЕДИНЕНИЕ_ПОКАЗАТЕЛЕЙ
		|
        |{ГДЕ
        |    Проекты.Ссылка.* КАК Объект,
        |    Проекты.Код,
        |    Проекты.Наименование,
        |    Проекты.Автор.*,
        |    Проекты.АвторИзменений.*,
        |    Проекты.ДатаМодификации,
        |    Проекты.Организация.*,
        |    Проекты.Комментарий,
        |    Проекты.ПолноеНаименование,
        |    Проекты.ПрограммаПроектов.*,
        |    (ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.Подразделение
        |        ИНАЧЕ Проекты.Подразделение
        |    КОНЕЦ).* КАК Подразделение,
        |    ВЫБОР
        |        КОГДА Проекты.ЭтоПроектнаяЗадача
        |            ТОГДА Проекты.упоКорневойПроект.Компонент
        |        ИНАЧЕ Проекты.Компонент
        |    КОНЕЦ КАК Компонент,
        |    (ЕСТЬNULL(Руководители.РуководительПроекта, &ПустойРуководитель)) КАК РуководительПроекта,
        |    (ЕСТЬNULL(Руководители.КураторПроекта, &ПустойРуководитель)) КАК КураторПроекта,
        |    (ЕСТЬNULL(Статусы.СтатусПроекта, &ПустойСтатус)) КАК СтатусПроекта}";

		
	НуженКодСДРВПрограмме = Истина;
	Если НуженКодСДРВПрограмме Тогда
		
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Проекты.Ссылка КАК Проект,
		|	Проекты.ПрограммаПроектов,
		|	Проекты.ПрограммаПроектов.ПроектСтруктуры КАК ПроектСтруктуры
		|ПОМЕСТИТЬ ВТ_ПрограммыПроектов
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Ссылка В (&СписокПроектов)
		|	И Проекты.ПрограммаПроектов <> Значение(Справочник.упоПрограммыПроектов.ПустаяСсылка)
		|	И Проекты.ПрограммаПроектов.ПроектСтруктуры <> Значение(Справочник.Проекты.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект КАК ПроектВходящийВПрограмму,
		|	МИНИМУМ(Проекты.КодСДР) КАК КодСДРВПрограмме
		|ПОМЕСТИТЬ ВТ_КодыСДРВПрограмме
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		|			,
		|			ПроектнаяЗадача.Проект В
		|				(ВЫБРАТЬ
		|					ВТ_Программыпроектов.ПроектСтруктуры
		|				ИЗ
		|					ВТ_Программыпроектов)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|		ПО (упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|				И упоВерсииПроекта.Текущая)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО (упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|				И НЕ Проекты.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	упоСвойстваПроектныхЗадачСрезПоследних.ПодчиненныйПроект
		|;" + Текст;
		
		ТекстСоединения =   
        "ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КодыСДРВПрограмме КАК ВТ_КодыСДРВПрограмме
        |        ПО (Проекты.ЭтоПроектнаяЗадача
        |                И Проекты.упоКорневойПроект = ВТ_КодыСДРВПрограмме.ПроектВходящийВПрограмму)
		|        ИЛИ (НЕ Проекты.ЭтоПроектнаяЗадача
        |                И Проекты.Ссылка = ВТ_КодыСДРВПрограмме.ПроектВходящийВПрограмму)
		|";	
		
		Текст = СтрЗаменить(Текст, "//ПОЛЕ_КодСДРВПрограмме", ", ВТ_КодыСДРВПрограмме.КодСДРВПрограмме");
		Текст = СтрЗаменить(Текст, "//СОЕДИНЕНИЕ_КодыСДРВПрограмме", ТекстСоединения);
		
	КонецЕсли;
	
    Если ВыводитьПроектныеЗадачи Тогда
        ТекстСоединения =   
        "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадач
        |            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
        |            ПО (упоСвойстваПроектныхЗадач.Версия = упоВерсииПроекта.Версия
        |                    И упоВерсииПроекта.Текущая)
        |        ПО (Проекты.ЭтоПроектнаяЗадача
        |                И Проекты.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадач.ПроектнаяЗадача)
        |";
        ТекстПолей = ", 
		|	ISNULL(упоСвойстваПроектныхЗадач.ЭтоВеха, Ложь) КАК ЭтоВеха, 
		|	ISNULL(упоСвойстваПроектныхЗадач.ЭтоМодельПакетаРабот, Ложь) КАК ЭтоМодельПакетаРабот,
		|	упоСвойстваПроектныхЗадач.ВидОперации КАК ВидОперации, 
		|	упоСвойстваПроектныхЗадач.Объект КАК ОбъектПЗ";
        Текст = СтрЗаменить(Текст, "//СОЕДИНЕНИЕ_ЗАДАЧИ", ТекстСоединения);
        Текст = СтрЗаменить(Текст, "//ПОЛЯ_ЗАДАЧ", ТекстПолей);
	Иначе
		ТекстПолей = ", 
		|	Ложь КАК ЭтоВеха,
		|	Ложь КАК ЭтоМодельПакетаРабот, 
		|	ЗНАЧЕНИЕ(СправочникСсылка.упоВидыОпераций.ПустаяСсылка) КАК ВидОпераций,
		|	ЗНАЧЕНИЕ(СправочникСсылка.упоОбъекты.ПустаяСсылка) КАК ОбъектПЗ"; 
        Текст = СтрЗаменить(Текст, "//ПОЛЯ_ЗАДАЧ", ТекстПолей);   
    КонецЕсли;

    Возврат Текст;             

КонецФункции

Функция ПолучитьТекстЗапросаСпискаПроектов()

    Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	упоВерсииПроекта.Проект КАК Проект,
	|	упоСвойстваПроектныхЗадачСрезПоследних.Объект КАК ОбъектПЗ
	|ПОМЕСТИТЬ ОбъектыПроектныхЗадачПроекта
	|{ВЫБРАТЬ
	|	Проект.*,
	|	ОбъектПЗ.*}
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)
	|{ГДЕ
	|	упоВерсииПроекта.Проект.*,
	|	упоСвойстваПроектныхЗадачСрезПоследних.Объект.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Ссылка КАК Проект,
	|	ЕСТЬNULL(Руководители.РуководительПроекта, &ПустойРуководитель) КАК РуководительПроекта,
	|	ЕСТЬNULL(Руководители.КураторПроекта, &ПустойРуководитель) КАК КураторПроекта,
	|	ЕСТЬNULL(Статусы.СтатусПроекта, &ПустойСтатус) КАК СтатусПроекта,
	|	Проекты.ПортфельПроектов КАК ПортфельПроектов,
	|	Проекты.ПрограммаПроектов КАК ПрограммаПроектов,
	|	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача,
	|	Проекты.Подразделение КАК Подразделение,
	|	Проекты.ИсточникФинансирования КАК ИсточникФинансирования,
	|	ЛОЖЬ КАК ЭтоВеха,
	|	ЛОЖЬ КАК ЭтоМодельПакетаРабот,
	|	Проекты.Компонент КАК Компонент,
	|	NULL КАК ВидОперации,
	|	Проекты.Объект КАК ОбъектПроекта,
	|	ОбъектыПроектныхЗадачПроекта.ОбъектПЗ КАК ОбъектПЗ
	|{ВЫБРАТЬ
	|	РуководительПроекта,
	|	СтатусПроекта,
	|	КураторПроекта,
	|	Проекты.Ссылка.* КАК Проект,
	|	Проекты.Код,
	|	Проекты.Наименование,
	|	Проекты.Автор.*,
	|	Проекты.АвторИзменений.*,
	|	Проекты.ДатаМодификации,
	|	Проекты.Организация.*,
	|	Проекты.Комментарий,
	|	Проекты.ПолноеНаименование,
	|	Проекты.Компонент,
	|	Проекты.Родитель.*,
	|	ОбъектПроекта.*,
	|	ОбъектПЗ.*}
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, ) КАК Руководители
	|		ПО (Руководители.Проект = Проекты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(, ) КАК Статусы
	|		ПО (Статусы.Проект = Проекты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыПроектныхЗадачПроекта КАК ОбъектыПроектныхЗадачПроекта
	|		ПО (ОбъектыПроектныхЗадачПроекта.Проект = Проекты.Ссылка)
	|ГДЕ
	|	НЕ Проекты.ЭтоПроектнаяЗадача
	|	И НЕ Проекты.ПометкаУдаления
	|{ГДЕ
	|	Проекты.Ссылка.* КАК Проект,
	|	Проекты.Код,
	|	Проекты.Наименование,
	|	Проекты.Автор.*,
	|	Проекты.АвторИзменений.*,
	|	Проекты.ДатаМодификации,
	|	Проекты.Организация.*,
	|	Проекты.Комментарий,
	|	Проекты.ПолноеНаименование,
	|	Проекты.Компонент,
	|	Проекты.Подразделение.* КАК Подразделение,
	|	(ЕСТЬNULL(Руководители.РуководительПроекта, &ПустойРуководитель)) КАК РуководительПроекта,
	|	(ЕСТЬNULL(Руководители.КураторПроекта, &ПустойРуководитель)) КАК КураторПроекта,
	|	(ЕСТЬNULL(Статусы.СтатусПроекта, &ПустойСтатус)) КАК СтатусПроекта,
	|	Проекты.Объект.* КАК ОбъектПроекта,
	|	ОбъектыПроектныхЗадачПроекта.ОбъектПЗ.*}";

    Возврат Текст;

КонецФункции

Функция УдалитьТаблицуСОбъектомПЗЕслиПоОбъектуНетОтбора(Знач ТекстЗапроса, ЭлементыОтбора)
	
	ПолеОбъектТекст = "ОбъектПЗ";
	УдалитьОтбор = Не ПолеНайденоВОтборе(ЭлементыОтбора, ПолеОбъектТекст);
	
	// Удалить Отбор по Объекту проектной задачи если нет активного отбора по нему
	Если УдалитьОтбор Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		СхемаЗапроса.ПакетЗапросов.Удалить(0);
		// При удалении соединения автоматически удаляются все выбранные поля соединяемой таблицы
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники.Удалить(3);
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолеНайденоВОтборе(ЭлементыОтбора, ИмяПоля, ПолеНайдено = Ложь)
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ПолеНайдено = ПолеНайденоВОтборе(ЭлементОтбора.Элементы, ИмяПоля);
			Если ПолеНайдено Тогда
				Возврат ПолеНайдено;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		ИмяОтбора = Строка(ЭлементОтбора.ЛевоеЗначение);
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И Лев(ИмяОтбора, 8) = ИмяПоля
			И ЭлементОтбора.Использование Тогда
			ПолеНайдено = Истина;
			Возврат ПолеНайдено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПолеНайдено;
	
КонецФункции

Функция СоздатьПустуюТаблицуПоказателейИндикаторов()
	
	ТаблицаПоказателейИндикаторов = Новый ТаблицаЗначений;

	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("СтатусПроекта", Новый ОписаниеТипов("ПеречислениеСсылка.упоСостояниеСтатусаПроекта"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("РуководительПроекта", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("КураторПроекта", Новый ОписаниеТипов("СправочникСсылка.упоСотрудники"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Автор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("АвторИзменений", Новый ОписаниеТипов("СправочникСсылка.Пользователи"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ИсточникФинансирования", Новый ОписаниеТипов("СправочникСсылка.упоИсточникиФинансирования"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ПортфельПроектов", Новый ОписаниеТипов("СправочникСсылка.упоПортфелиПроектов"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ПрограммаПроектов", Новый ОписаниеТипов("СправочникСсылка.упоПрограммыПроектов"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("КонтрагентЗатрат", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"),, 35);	
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("КонтрагентДоходов", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ДоговорЗатрат", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ДоговорДоходов", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"),, 35);	
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("КодСДРВПрограмме", Новый ОписаниеТипов("Строка"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ПолноеНаименование", Новый ОписаниеТипов("Строка"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("Компонент", Новый ОписаниеТипов("ПеречислениеСсылка.упоКомпоненты"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ЭтоВеха", Новый ОписаниеТипов("Булево"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ЭтоМодельПакетаРабот", Новый ОписаниеТипов("Булево"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ЭтоПроектнаяЗадача", Новый ОписаниеТипов("Булево"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("СправочникСсылка.упоВидыОпераций"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ОбъектПЗ", Новый ОписаниеТипов("СправочникСсылка.упоОбъекты"),, 35);
	ТаблицаПоказателейИндикаторов.Колонки.Добавить("ОбъектПроекта", Новый ОписаниеТипов("СправочникСсылка.упоОбъекты"),, 35);
	
	Возврат ТаблицаПоказателейИндикаторов;
	
КонецФункции

Процедура ДобавитьАвтоПоле(СтруктураКомпоновки, МассивГруппировок, КоличествоВложенных)
	
	КоличествоВложенных = КоличествоВложенных + 1;
	
	Для каждого ВыбранныйЭлемент Из СтруктураКомпоновки Цикл
		
		Если ТипЗнч(ВыбранныйЭлемент) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			
			ПроверитьДоступностьВыбранныхПолей(ВыбранныйЭлемент);
			
			МассивГруппировок.Добавить(Формат(ВыбранныйЭлемент.Выбор.Элементы.Количество(), "ЧГ=0"));
			
			Если ВыбранныйЭлемент.Структура.Количество() = 0 Тогда
				
				АвтоПолеЕсть = Ложь;
				
				Для Каждого ЭлементГруппировки Из ВыбранныйЭлемент.Выбор.Элементы Цикл
					
					Если ТипЗнч(ЭлементГруппировки) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
						
						АвтоПолеЕсть = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если АвтоПолеЕсть = Ложь Тогда
					
					НовоеПоле = ВыбранныйЭлемент.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
					
				КонецЕсли;
				
			Иначе
				
				ДобавитьАвтоПоле(ВыбранныйЭлемент.Структура, МассивГруппировок, КоличествоВложенных);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьДоступностьВыбранныхПолей(ВыбранныйЭлемент)
	
	ВыборСтруктуры = ВыбранныйЭлемент.Выбор;			 
	ПоляГруппировки =  ВыбранныйЭлемент.ПоляГруппировки.Элементы;
	
	Для Каждого ЭлементГруппировки Из ПоляГруппировки Цикл
		
		Для Каждого ВыбранноеПоле Из ВыборСтруктуры.Элементы Цикл
			
			Если ТипЗнч(ВыбранноеПоле) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
				Продолжить;	  
			КонецЕсли;
			
			Если ВыбранноеПоле.Поле =  ЭлементГруппировки.Поле Тогда
				
				ВыбранноеПоле.Использование = ЭлементГруппировки.Использование;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ЭлементВыбора Из ВыборСтруктуры.Элементы Цикл
		
		Если ТипЗнч(ЭлементВыбора) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;	  
		КонецЕсли;		  
		
		ЭлементНайден = Ложь;
		
		Для Каждого ЭлементГруппировки Из ПоляГруппировки Цикл
			
			Если ТипЗнч(ЭлементГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
				
				Если ЭлементГруппировки.Поле =  ЭлементВыбора.Поле 
					И ЭлементГруппировки.Использование Тогда
					
					ЭлементНайден = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЭлементВыбора.Использование = ЭлементНайден;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ИнициализацияКомпоновщика

Процедура ПодготовитьСпискиИндикаторов(Объект, СтруктураДанных, ВыбранныеИндикаторы, ТаблицаИндикаторов,
		ЭтоПрограммноеФормирование)
	
	Объект.СписокПолей.Очистить();
	СписокПоказателейТолькоВФормуле = СтруктураДанных.СписокПоказателейТолькоВФормуле;
	СписокПоказателейТолькоВФормуле.Очистить();
	
	Если Не ЭтоПрограммноеФормирование Тогда
		РассчитыватьПоказатели = СтруктураДанных.Элементы.Найти("КомандаРассчитыватьПоказатели");
		Если НЕ РассчитыватьПоказатели = Неопределено И НЕ РассчитыватьПоказатели.Пометка Тогда
			ВыбранныеИндикаторы.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	МассивТиповЧ = Новый Массив;
	МассивТиповЧ.Добавить(Тип("Число"));
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	МассивТиповДата = Новый Массив;
	МассивТиповДата.Добавить(Тип("Дата"));
	
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	
	МассивТиповБулево = Новый Массив;
	МассивТиповБулево.Добавить(Тип("Булево"));
	
	МассивТиповСтрока = Новый Массив;
	МассивТиповСтрока.Добавить(Тип("Строка"));
	
	ОписаниеТиповЧ = Новый ОписаниеТипов(МассивТиповЧ,КЧ);
	ОписаниеТиповД = Новый ОписаниеТипов(МассивТиповДата,,,КвалификаторыДаты);
	ОписаниеТиповДД = Новый ОписаниеТипов(МассивТиповБулево);
	ОписаниеТиповСтр = Новый ОписаниеТипов(МассивТиповСтрока);
		
	Для Каждого ВыбранныйПоказатель Из ВыбранныеИндикаторы Цикл
		
		НоваяСтрока = ТаблицаИндикаторов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыбранныйПоказатель);
		НоваяСтрока.СсылкаНаПоказатель =  ВыбранныйПоказатель.Показатель;
		НоваяСтрока.ЗаголовокПоказателя = ВыбранныйПоказатель.Наименование;
		НоваяСтрока.ТолькоВФормуле = Ложь;
		
		ВидЗаполненияПоказателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранныйПоказатель.Показатель, "ВидЗаполнения");
						
		Если ВыбранныйПоказатель.ТипЗаполнения = 1 И НЕ ВидЗаполненияПоказателя = Перечисления.упоВидЗаполненияИндикатора.АвтоматическиВДокументе Тогда
			
			НоваяСтрока.ЭтоФормула = Истина;
			НоваяСтрока.ФормулаРасчета = 
				Справочники.упоПоказателиПроектов.ПолучитьФормулуРасчетаПоказателя(ВыбранныйПоказатель.Показатель);
			
		Иначе
			
			НоваяСтрока.ЭтоФормула = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьИзФормул(СтруктураДанных, ВыбранныеИндикаторы, ТаблицаИндикаторов);
	
	индексСтроки = 0;
	
	Для Каждого СтрокаИндикатора Из ТаблицаИндикаторов Цикл
				
		Если СтрДлина(СокрЛП(СтрокаИндикатора.ВыражениеГруппировки)) = 0 Тогда
			
			СтрокаИндикатора.ВыражениеГруппировки = "";
			
		КонецЕсли;
		
		Если СтрокаИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
			
			СтрокаИндикатора.ТипЗначения = ОписаниеТиповЧ;
			
		ИначеЕсли СтрокаИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
			
			СтрокаИндикатора.ТипЗначения = ОписаниеТиповД;
			
		ИначеЕсли СтрокаИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
			
			СтрокаИндикатора.ТипЗначения = ОписаниеТиповДД;
			
		ИначеЕсли СтрокаИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
			
			СтрокаИндикатора.ТипЗначения = ОписаниеТиповСтр;
			
		ИначеЕсли СтрокаИндикатора.ТипИндикатора = Перечисления.упоТипИндикатора.Ссылка Тогда			
			
			МассивТипов = упоПанельПоказателейКлиентСервер.ПолучитьМассивТиповПоТипуСсылки(СтрокаИндикатора.СсылкаНаПоказатель.ТипСсылки);
			ОписаниеТиповПоказателя = Новый ОписаниеТипов(МассивТипов);
			
			СтрокаИндикатора.ТипЗначения = ОписаниеТиповПоказателя;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаИндикатора Из ТаблицаИндикаторов Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаИндикатора.ИмяПоказателя) Тогда
			
			СтрокаИндикатора.ИмяПоказателя = ПолучитьИмяПоказателя(СтрокаИндикатора.СсылкаНаПоказатель);	
			
		КонецЕсли;
		
		Объект.СписокПолей.Добавить(СтрокаИндикатора.СсылкаНаПоказатель, СтрокаИндикатора.ИмяПоказателя);
		
	КонецЦикла;
	
	ЗаполнитьФормулы(ТаблицаИндикаторов);
	
КонецПроцедуры

Процедура ДобавитьОбщиеПоля(НовыйНаборДанных)
	
	МассивТиповПроект = Новый Массив;
	МассивТиповПроект.Добавить(Тип("СправочникСсылка.Проекты"));
	
	ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПроект);
	
	// Поля выбора по умолчанию.
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Проект'");
	НовоеПолеНабораДанных.Поле = "Проект";
	НовоеПолеНабораДанных.ТипЗначения = ОписаниеТиповП;
	НовоеПолеНабораДанных.ПутьКДанным = "Проект";
	НовоеПолеНабораДанных.ПараметрыРедактирования.УстановитьЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ВыборГруппИЭлементов"), ИспользованиеГруппИЭлементов.Группы);
		
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Статус проекта'");
	НовоеПолеНабораДанных.Поле = "СтатусПроекта";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("ПеречислениеСсылка.упоСостояниеСтатусаПроекта");
	НовоеПолеНабораДанных.ПутьКДанным = "СтатусПроекта";
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Руководитель проекта'");
	НовоеПолеНабораДанных.Поле = "РуководительПроекта";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоСотрудники");
	НовоеПолеНабораДанных.ПутьКДанным = "РуководительПроекта";
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	// Поля для группировок.
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Автор'");
	НовоеПолеНабораДанных.Поле = "Автор";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	НовоеПолеНабораДанных.ПутьКДанным = "Автор";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Автор изменений'");
	НовоеПолеНабораДанных.Поле = "АвторИзменений";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	НовоеПолеНабораДанных.ПутьКДанным = "АвторИзменений";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Источник финансирования'");
	НовоеПолеНабораДанных.Поле = "ИсточникФинансирования";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоИсточникиФинансирования");
	НовоеПолеНабораДанных.ПутьКДанным = "ИсточникФинансирования";
	//НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	//НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;		
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Организация'");
	НовоеПолеНабораДанных.Поле = "Организация";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	НовоеПолеНабораДанных.ПутьКДанным = "Организация";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Портфель проектов'");
	НовоеПолеНабораДанных.Поле = "ПортфельПроектов";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоПортфелиПроектов");
	НовоеПолеНабораДанных.ПутьКДанным = "ПортфельПроектов";
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Программа проектов'");
	НовоеПолеНабораДанных.Поле = "ПрограммаПроектов";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоПрограммыПроектов");
	НовоеПолеНабораДанных.ПутьКДанным = "ПрограммаПроектов";
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Подразделение'");
	НовоеПолеНабораДанных.Поле = "Подразделение";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоПодразделения");
	НовоеПолеНабораДанных.ПутьКДанным = "Подразделение";
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Контрагент затрат'");
	НовоеПолеНабораДанных.Поле = "КонтрагентЗатрат";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	НовоеПолеНабораДанных.ПутьКДанным = "КонтрагентЗатрат";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Контрагент доходов'");
	НовоеПолеНабораДанных.Поле = "КонтрагентДоходов";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	НовоеПолеНабораДанных.ПутьКДанным = "КонтрагентДоходов";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Договор затрат'");
	НовоеПолеНабораДанных.Поле = "ДоговорЗатрат";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	НовоеПолеНабораДанных.ПутьКДанным = "ДоговорЗатрат";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Договор доходов'");
	НовоеПолеНабораДанных.Поле = "ДоговорДоходов";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	НовоеПолеНабораДанных.ПутьКДанным = "ДоговорДоходов";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Код'");
	НовоеПолеНабораДанных.Поле = "Код";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("Строка");
	НовоеПолеНабораДанных.ПутьКДанным = "Код";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Наименование'");
	НовоеПолеНабораДанных.Поле = "Наименование";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("Строка");
	НовоеПолеНабораДанных.ПутьКДанным = "Наименование";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Полное наименование'");
	НовоеПолеНабораДанных.Поле = "ПолноеНаименование";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("Строка");
	НовоеПолеНабораДанных.ПутьКДанным = "ПолноеНаименование";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Код СДР в программе'");
	НовоеПолеНабораДанных.Поле = "КодСДРВПрограмме";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("Строка");
	НовоеПолеНабораДанных.ПутьКДанным = "КодСДРВПрограмме";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользования.Поле = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Поле = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Компонент'");
	НовоеПолеНабораДанных.Поле = "Компонент";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("ПеречислениеСсылка.упоКомпоненты");
	НовоеПолеНабораДанных.ПутьКДанным = "Компонент";
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Куратор проекта'");
	НовоеПолеНабораДанных.Поле = "КураторПроекта";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоСотрудники");
	НовоеПолеНабораДанных.ПутьКДанным = "КураторПроекта";	
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'ЭтоВеха'");
	НовоеПолеНабораДанных.Поле = "ЭтоВеха";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("Булево");
	НовоеПолеНабораДанных.ПутьКДанным = "ЭтоВеха";
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользования.Группировка = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользования.Порядок = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользования.Поле = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'ЭтоМодельПакетаРабот'");
	НовоеПолеНабораДанных.Поле = "ЭтоМодельПакетаРабот";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("Булево");
	НовоеПолеНабораДанных.ПутьКДанным = "ЭтоМодельПакетаРабот";	
	НовоеПолеНабораДанных.ОграничениеИспользования.Условие = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользования.Группировка = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользования.Порядок = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользования.Поле = Истина;
	НовоеПолеНабораДанных.ОграничениеИспользованияРеквизитов.Условие = Истина;
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Вид операции'");
	НовоеПолеНабораДанных.Поле = "ВидОперации";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоВидыОпераций");
	НовоеПолеНабораДанных.ПутьКДанным = "ВидОперации";	
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Объект проектной задачи'");
	НовоеПолеНабораДанных.Поле = "ОбъектПЗ";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоОбъекты");
	НовоеПолеНабораДанных.ПутьКДанным = "ОбъектПЗ";
	
	НовоеПолеНабораДанных = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПолеНабораДанных.Заголовок = НСтр("ru = 'Объект проекта'");
	НовоеПолеНабораДанных.Поле = "ОбъектПроекта";
	НовоеПолеНабораДанных.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.упоОбъекты");
	НовоеПолеНабораДанных.ПутьКДанным = "ОбъектПроекта";
	
КонецПроцедуры

Процедура ДобавитьПараметры(СхемаКомпоновкиДанных)
	
	МассивТиповБулево = Новый Массив;
	МассивТиповБулево.Добавить(Тип("Булево"));
	
	ПараметрВыводитьПЗ = СхемаКомпоновкиДанных.Параметры.Добавить();
	ПараметрВыводитьПЗ.Заголовок = НСтр("ru = 'Выводить проектные задачи'");
	ПараметрВыводитьПЗ.Имя = "ВыводитьПроектныеЗадачи";
	
	ПараметрВыводитьПз.ТипЗначения = Новый ОписаниеТипов(МассивТиповБулево);
	ПараметрВыводитьПЗ.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ПараметрВыводитьПЗ.Значение = Истина; 
	
	ПараметрВыводитьБезПоказателей = СхемаКомпоновкиДанных.Параметры.Добавить();
	ПараметрВыводитьБезПоказателей.Заголовок = НСтр("ru = 'Выводить только с ненулевыми показателями'");
	ПараметрВыводитьБезПоказателей.Имя = "ВыводитьТолькоСНенулевымиПоказателями";
	
	ПараметрВыводитьБезПоказателей.ТипЗначения = Новый ОписаниеТипов(МассивТиповБулево);
	ПараметрВыводитьБезПоказателей.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	ПараметрВыводитьБезПоказателей.Значение = Ложь; 
	
КонецПроцедуры

Процедура ДобавитьРесурсы(СхемаКомпоновкиДанных, ТаблицаИндикаторов)
	
	Для Каждого ЭлементРесурс Из ТаблицаИндикаторов Цикл 
		
		
		Если ЭлементРесурс.СсылкаНаПоказатель.ТипИндикатора = Перечисления.упоТипИндикатора.Строка
			И Не ЭлементРесурс.Группировки Тогда 
			
			ВыражениеРесурса = "ВЫБОР КОГДА МАКСИМУМ("+ЭлементРесурс.ИмяПоказателя+") = МИНИМУМ("+ЭлементРесурс.ИмяПоказателя+") ТОГДА "+ЭлементРесурс.ИмяПоказателя+" ИНАЧЕ ВЫБОР КОГДА
			| УровеньВГруппировке() > 0 ТОГДА " + ЭлементРесурс.ИмяПоказателя
			+ " ИНАЧЕ """" КОНЕЦ КОНЕЦ";
			
		ИначеЕсли ЭлементРесурс.Группировки
			И Не СокрЛП(ЭлементРесурс.ВыражениеГруппировки) = "Формула" Тогда
			
			Если СтрДлина(СокрЛП(ЭлементРесурс.ВыражениеГруппировки)) = 0 Тогда
				
				ВыражениеГруппировки = "Сумма";
				
			Иначе 
				
				ВыражениеГруппировки = ЭлементРесурс.ВыражениеГруппировки;
				
			КонецЕсли;
			
			ВыражениеРесурса = ВыражениеГруппировки + "(" + ЭлементРесурс.ИмяПоказателя + ")";				
			
		Иначе
			
			ВыражениеРесурса = ЭлементРесурс.ИмяПоказателя;
			
		КонецЕсли;
		
		Если СхемаКомпоновкиДанных.ПоляИтога.Найти(ЭлементРесурс.ИмяПоказателя)  = Неопределено Тогда
			
			НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
			НовыйРесурс.Выражение = ВыражениеРесурса;
			НовыйРесурс.ПутьКДанным = ЭлементРесурс.ИмяПоказателя;
			
			ДобавитьГруппировкиПоляИтогов(ЭлементРесурс, НовыйРесурс);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ДобавитьПоляВыбора(ВыборЭлементы, ТаблицаРесурсов);
	
	Для Каждого ЭлементГруппировки Из ТаблицаРесурсов Цикл
		
		Если ЭлементГруппировки.ТолькоВФормуле =Ложь Тогда
			
			НовоеПолеПоказатель = ВыборЭлементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовоеПолеПоказатель.Заголовок = ЭлементГруппировки.ЗаголовокПоказателя;
			НовоеПолеПоказатель.Поле = Новый ПолеКомпоновкиДанных(ЭлементГруппировки.ИмяПоказателя);		
			НовоеПолеПоказатель.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИзФормул(ЭтаФорма,ВыбранныеИндикаторы, ТаблицаИндикаторов)
	
	Для Каждого СтрокаИндикатора Из ТаблицаИндикаторов Цикл
		
		Если СтрокаИндикатора.ЭтоФормула Тогда
			
			Для Каждого СтрокаРасчетногоПоказателя Из СтрокаИндикатора.СсылкаНаПоказатель.РасчетныеИндикаторы Цикл
				
				ДобавитьИндикаторыИзРасчетных(ЭтаФорма,ВыбранныеИндикаторы, ТаблицаИндикаторов, СтрокаРасчетногоПоказателя.Индикатор);		
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьФормулы(ТаблицаИндикаторов)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЭтоФормула", Истина);
	
	ТаблицаКопия = ТаблицаИндикаторов.Скопировать(Отбор);
	
	ТаблицаКопия.Колонки.Добавить("СписокВФормуле");
	ТаблицаКопия.Колонки.Добавить("ВФормулахЕстьФормулы", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаКопии Из ТаблицаКопия Цикл
		
		СтрокаКопии.СписокВФормуле = Новый СписокЗначений;
		ВФормулахЕстьФормулы = Ложь;
		
		Для Каждого РасчетныйПоказатель Из СтрокаКопии.СсылкаНаПоказатель.РасчетныеИндикаторы Цикл
			
			СтрокаКопии.СписокВФормуле.Добавить(РасчетныйПоказатель.Индикатор);
			
			Если РасчетныйПоказатель.Индикатор.ТипЗаполнения = 1 Тогда
				
				ВФормулахЕстьФормулы = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаКопии.ВФормулахЕстьФормулы = ВФормулахЕстьФормулы;
		
	КонецЦикла;
	
	ВФормулахЕстьФормулы = Истина;	
	Счетчик = 1;
	
	ФормулыОбработаныУспешно = Истина;
	
	Пока ВФормулахЕстьФормулы Цикл
		
		Счетчик = Счетчик + 1;
		
		Если Счетчик = 1000 Тогда
			
			ФормулыОбработаныУспешно = Ложь;
			
			Прервать;
			
		КонецЕсли;
		
		ТаблицаКопия.Сортировать("ВФормулахЕстьФормулы Возр");
		
		Для Каждого СтрокаФормулы Из  ТаблицаКопия Цикл
			
			СписокОставшихсяФормул = Новый СписокЗначений;
			
			Для Каждого ЭлементРасчетногоИндикатора Из СтрокаФормулы.СписокВФормуле Цикл
				
				Если  ЭлементРасчетногоИндикатора.Значение.ТипЗаполнения = 1 Тогда
					
					СписокОставшихсяФормул.Добавить(ЭлементРасчетногоИндикатора.Значение);
					
				Иначе
					
					ПредставлениеИндикатора = ТаблицаИндикаторов.Найти(ЭлементРасчетногоИндикатора.Значение,
						"СсылкаНаПоказатель").ИмяПоказателя;	
					Если ЗначениеЗаполнено(ЭлементРасчетногоИндикатора.Значение.ВыражениеГруппировки) Тогда
						ПредставлениеИндикатора = ЭлементРасчетногоИндикатора.Значение.ВыражениеГруппировки + "("+ПредставлениеИндикатора+")";			
					КонецЕсли;	
					СтрокаФормулы.ФормулаРасчета = СтрЗаменить(СтрокаФормулы.ФормулаРасчета,
						"[" + ЭлементРасчетногоИндикатора.Значение.Наименование + "]", ПредставлениеИндикатора);
					
				КонецЕсли;
				
				ВФормулахЕстьФормулы = Ложь;
				
				Для Каждого ЭлементПоФормуле Из СписокОставшихсяФормул Цикл
					
					Отбор = Новый Структура;
					Отбор.Вставить("СсылкаНаПоказатель",   ЭлементПоФормуле.Значение);
					Отбор.Вставить("ВФормулахЕстьФормулы",   Ложь);
					
					НайденныеСтроки = ТаблицаКопия.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						
						ВФормулахЕстьФормулы = Истина;
						
					Иначе
						
						Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							
							ПредставлениеИндикатора = НайденнаяСтрока.ФормулаРасчета;
							
							Если ЗначениеЗаполнено(ЭлементРасчетногоИндикатора.Значение.ВыражениеГруппировки) Тогда
								
								Если ЭлементРасчетногоИндикатора.Значение.ВыражениеГруппировки <> "Формула" Тогда								
									ПредставлениеИндикатора = ЭлементПоФормуле.Значение.ВыражениеГруппировки + "("+ПредставлениеИндикатора+")";
								КонецЕсли;
									
							КонецЕсли;
							
							СтрокаФормулы.ФормулаРасчета = СтрЗаменить(СтрокаФормулы.ФормулаРасчета,
								"[" + ЭлементПоФормуле.Значение.Наименование + "]", "(" + ПредставлениеИндикатора + ")");
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
				СтрокаФормулы.ВФормулахЕстьФормулы = ВФормулахЕстьФормулы;
				
			КонецЦикла;			
			
		КонецЦикла;
		
		ВФормулахЕстьФормулы =  (ТаблицаКопия.НайтиСтроки(Новый Структура("ВФормулахЕстьФормулы", Истина)).Количество() > 0);
		
	КонецЦикла;
	
	Если ФормулыОбработаныУспешно = Ложь Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Обнаружены взаимозависимые показатели. Корректный расчет таких показателей невозможен'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Для  Каждого СтрокаКопия Из ТаблицаКопия Цикл
		
		СтрокаФормулы =	 ТаблицаИндикаторов.Найти(СтрокаКопия.СсылкаНаПоказатель, "СсылкаНаПоказатель");
		
		Если СтрокаКопия.ВФормулахЕстьФормулы Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрокаКопия.СсылкаНаПоказатель;
			Сообщение.УстановитьДанные(СтрокаКопия.СсылкаНаПоказатель.ПолучитьОбъект());
			Сообщение.Сообщить();
			
			СтрокаФормулы.ФормулаРасчета = "0";
			
		Иначе
			 
			СтрокаФормулы.ФормулаРасчета = СтрокаКопия.ФормулаРасчета; 
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьГруппировкиПоляИтогов(ПоказательСсылка, НовоеПолеИтогов)
	
	НовоеПолеИтогов.Группировки.Добавить("Проект");
	
	Если ПоказательСсылка.Группировки Тогда
		
		НовоеПолеИтогов.Группировки.Добавить("Проект Иерархия");
		
		Если ПоказательСсылка.СсылкаНаПоказатель.ТипИндикатора = Перечисления.упоТипИндикатора.Строка
			И Не ПоказательСсылка.Группировки Тогда 
			Возврат;			
		КонецЕсли;
		
		НовоеПолеИтогов.Группировки.Добавить("Код");
		НовоеПолеИтогов.Группировки.Добавить("Наименование");
		НовоеПолеИтогов.Группировки.Добавить("ПолноеНаименование");
		
		НовоеПолеИтогов.Группировки.Добавить("ПортфельПроектов");
		НовоеПолеИтогов.Группировки.Добавить("ПортфельПроектов Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("СтатусПроекта");
		НовоеПолеИтогов.Группировки.Добавить("РуководительПроекта");
		НовоеПолеИтогов.Группировки.Добавить("РуководительПроекта Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("КураторПроекта");
		НовоеПолеИтогов.Группировки.Добавить("КураторПроекта Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("Автор");
		НовоеПолеИтогов.Группировки.Добавить("Автор Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("АвторИзменений");
		НовоеПолеИтогов.Группировки.Добавить("АвторИзменений Иерархия");
				
		НовоеПолеИтогов.Группировки.Добавить("ИсточникФинансирования");
		НовоеПолеИтогов.Группировки.Добавить("ИсточникФинансирования Иерархия");		
		
		НовоеПолеИтогов.Группировки.Добавить("Организация");
		НовоеПолеИтогов.Группировки.Добавить("Организация Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("ПрограммаПроектов");
		НовоеПолеИтогов.Группировки.Добавить("ПрограммаПроектов Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("Подразделение");
		НовоеПолеИтогов.Группировки.Добавить("Подразделение Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("КонтрагентЗатрат");
		НовоеПолеИтогов.Группировки.Добавить("КонтрагентЗатрат Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("КонтрагентДоходов");
		НовоеПолеИтогов.Группировки.Добавить("КонтрагентДоходов Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("ДоговорЗатрат");
		НовоеПолеИтогов.Группировки.Добавить("ДоговорЗатрат Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("ДоговорДоходов");
		НовоеПолеИтогов.Группировки.Добавить("ДоговорДоходов Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("ВидОперации");
		НовоеПолеИтогов.Группировки.Добавить("ВидОперации Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("ОбъектПЗ");
		НовоеПолеИтогов.Группировки.Добавить("ОбъектПЗ Иерархия");

		НовоеПолеИтогов.Группировки.Добавить("ОбъектПроекта");
		НовоеПолеИтогов.Группировки.Добавить("ОбъектПроекта Иерархия");
		
		НовоеПолеИтогов.Группировки.Добавить("ЭтоВеха");
		НовоеПолеИтогов.Группировки.Добавить("ЭтоМодельПакетаРабот");
		
		НовоеПолеИтогов.Группировки.Добавить("ОбщийИтог");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьИндикаторыИзРасчетных(ЭтаФорма,ВыбранныеИндикаторы, ТаблицаИндикаторов, ИндикаторПоФормуле)
	
	ОтборОбработанных = Новый Структура;
	ОтборОбработанных.Вставить("СсылкаНаПоказатель", ИндикаторПоФормуле);
	
	Если ТаблицаИндикаторов.НайтиСтроки(ОтборОбработанных).Количество() = 0 Тогда
		
		НоваяСтрока =  ТаблицаИндикаторов.Добавить();
		НоваяСтрока.СсылкаНаПоказатель =  ИндикаторПоФормуле;
		НоваяСтрока.ЗаголовокПоказателя = ИндикаторПоФормуле.Наименование;			
		НоваяСтрока.ТолькоВФормуле = (ВыбранныеИндикаторы.НайтиСтроки(
			Новый Структура("Использовать, Показатель", Истина, ИндикаторПоФормуле)).Количество() = 0);
		
		Если ИндикаторПоФормуле.ТипЗаполнения = 1 Тогда
			
			НоваяСтрока.ЭтоФормула = Истина;					
			НоваяСтрока.ФормулаРасчета = ИндикаторПоФормуле.строкаФормулы;					
			
			Для Каждого СтрокаРасчетногоПоказателя Из ИндикаторПоФормуле.РасчетныеИндикаторы Цикл
				
				ДобавитьИндикаторыИзРасчетных(ЭтаФорма,ВыбранныеИндикаторы, ТаблицаИндикаторов, СтрокаРасчетногоПоказателя.Индикатор);		
				
			КонецЦикла;
			
		Иначе
			
			НоваяСтрока.ЭтоФормула = Ложь;					
			
		КонецЕсли;
		
		Если НоваяСтрока.ТолькоВФормуле Тогда
			ЭтаФорма.СписокПоказателейТолькоВФормуле.Добавить(ИндикаторПоФормуле);	
		КонецЕсли;
		
		НоваяСтрока.ФорматнаяСтрока = ИндикаторПоФормуле.ФорматнаяСтрока;
		НоваяСтрока.Группировки = ИндикаторПоФормуле.СчитатьСуммуПоГруппировкам;
		НоваяСтрока.ВыражениеГруппировки = ИндикаторПоФормуле.ВыражениеГруппировки;
		НоваяСтрока.ПринадлежностьПоказателя = ИндикаторПоФормуле.ПринадлежностьПоказателя;
		НоваяСтрока.ТипИндикатора = ИндикаторПоФормуле.ТипИндикатора;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработатьОтборПоВидуОперацииРекурсивно(ЭлементыТекущегоОтбора)

	ИзменяемоеПолеОтбора = Новый ПолеКомпоновкиДанных("ВидОперации");	
	
	Сч = ЭлементыТекущегоОтбора.Количество();
	
	Пока Сч > 0 Цикл
		
		Сч = Сч - 1;
		
		ЭлементОтбора = ЭлементыТекущегоОтбора[Сч];
		
		Если Не ЭлементОтбора.Использование Тогда		
			Продолжить;		
		КонецЕсли; 
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда	
			ОбработатьОтборПоВидуОперацииРекурсивно(ЭлементОтбора.Элементы);	
			Продолжить;	
		КонецЕсли; 
		
		Если ЭлементОтбора.ЛевоеЗначение <> ИзменяемоеПолеОтбора Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеЭлементаОтбора		= ЭлементОтбора.ПравоеЗначение;
		
		ВидСравненияЭлементаОтбора 	= ЭлементОтбора.ВидСравнения;
		
		ИзменитьЭлементОтбораВидОперации(ЭлементыТекущегоОтбора, ЗначениеЭлементаОтбора, ВидСравненияЭлементаОтбора);		
		
		ЭлементыТекущегоОтбора.Удалить(ЭлементОтбора);
		
	КонецЦикла; 	

КонецПроцедуры

Процедура ИзменитьЭлементОтбораВидОперации(ЭлементыТекущегоОтбора, ЗначениеЭлементаОтбора, ВидСравненияЭлементаОтбора)
		
	ГруппаЭлементовОтбора 	= ЭлементыТекущегоОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
 	ГруппаЭлементовОтбора.ТипГруппы 	= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	
	ЭлементОтбораГруппы 	= ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораГруппы.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Проект.ЭтоПроектнаяЗадача");
	ЭлементОтбораГруппы.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораГруппы.ПравоеЗначение 	= Ложь;

	ЭлементОтбораГруппы 	= ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораГруппы.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ВидОперации");
	ЭлементОтбораГруппы.ВидСравнения 	= ВидСравненияЭлементаОтбора;
	ЭлементОтбораГруппы.ПравоеЗначение	= ЗначениеЭлементаОтбора;		 	

КонецПроцедуры

Процедура ИзменитьВидСравненияЭлементовОтбораПроекта(ВыводитьПроектныеЗадачи, ЭлементыОтбора, ЭтоВызовИзПанелиПоказателей)
	
	Если Не ВыводитьПроектныеЗадачи Или ЭтоВызовИзПанелиПоказателей = Неопределено
		Или Не ЭтоВызовИзПанелиПоказателей Тогда
		Возврат;
	КонецЕсли;
	
	ПолеКомпоновкиПроект = Новый ПолеКомпоновкиДанных("Проект");
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоРеквизитПроекта = СтрНайти(Строка(ЭлементОтбора.ЛевоеЗначение), "Проект.") <> 0;
		
		Если (ЭлементОтбора.ЛевоеЗначение <> ПолеКомпоновкиПроект И Не ЭтоРеквизитПроекта) Или Не ЭлементОтбора.Использование Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ЭтоРеквизитПроекта Тогда
			ЛевоеЗначениеОтбораСтрокой = Строка(ЭлементОтбора.ЛевоеЗначение);
			ЛевоеЗначениеОтбораСтрокой = "Проект.упоКорневойПроект." + Прав(ЛевоеЗначениеОтбораСтрокой,
				СтрДлина(ЛевоеЗначениеОтбораСтрокой) - СтрДлина("Проект."));
			
			ПолеКомпоновкиПроект = Новый ПолеКомпоновкиДанных(ЛевоеЗначениеОтбораСтрокой);
			ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиПроект;
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСортировкуПоКодуСДР(ЭлементыСортировки)
	
	СортировкаПоКодуСДР = ЭлементыСортировки.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	СортировкаПоКодуСДР.Использование = Истина;
	СортировкаПоКодуСДР.Поле = Новый ПолеКомпоновкиДанных("Проект.КодСДР");
	СортировкаПоКодуСДР.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

Функция ПроверитьГруппировкуПоПроекту(Объект, ВыводитьПроектныеЗадачи, ОтдельныеЗапросыДляПроектовИЗадач, 
	ЭтоПроектнаяЗадача, СчитатьСуммуПоГруппировкам)
	
	Если Не ВыводитьПроектныеЗадачи Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ТипЗнч(Объект) = Тип("СправочникСсылка.Проекты") Тогда
		Возврат Ложь;
	КонецЕсли;

	Проверка = НЕ ЭтоПроектнаяЗадача И СчитатьСуммуПоГруппировкам И Не ОтдельныеЗапросыДляПроектовИЗадач;

	Возврат Проверка;

КонецФункции

#КонецОбласти
