////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с деревьями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добполняет дерево значений данными из таблицы значений.
//
// Параметры:
//  Таблица					 - ТаблицаЗначений	 - таблица, на основании которой будет заполняться дерево.
//  Дерево					 - ДеревоЗначений	 - дополняемое дерево.
//  КлючСтроки				 - Строка			 - имя колонки, содержащей данные об этапе.
//  КлючСвязи				 - Строка			 - имя колонки, содержащей ссылку на родителя.
//  КлючСтрокиДоп			 - Строка
//  КлючСвязиДоп			 - Строка
//  КолонкиСверки			 - Массив
//  КолонкаРезультатСверки	 - Строка
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево, дополненное данными из таблицы значений.
//
Функция ВыгрузитьТаблицуЗначенийВДеревоЗначений(Таблица, Дерево,
	КлючСтроки = "Этап", КлючСвязи = "ЭтапРодитель", КлючСтрокиДоп = "", КлючСвязиДоп = "", КолонкиСверки = Неопределено, КолонкаРезультатСверки = "") Экспорт
	
	ИдетСверкаДанных = ЗначениеЗаполнено(КолонкаРезультатСверки) И ЗначениеЗаполнено(КолонкиСверки);
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Отбор = Новый Структура;
		Если Не ЗначениеЗаполнено(СтрокаТаблицы[КлючСтроки]) И КлючСтрокиДоп <> "" И КлючСвязиДоп <> "" Тогда
			ТекущийКлючСтроки = КлючСтрокиДоп;
			ТекущийКлючСвязи = КлючСвязиДоп;
		Иначе
			ТекущийКлючСтроки = КлючСтроки;
			ТекущийКлючСвязи = КлючСвязи;
		КонецЕсли;
		Отбор.Вставить(ТекущийКлючСтроки, СтрокаТаблицы[ТекущийКлючСтроки]);
		Отбор.Вставить(ТекущийКлючСвязи, СтрокаТаблицы[ТекущийКлючСвязи]);
		
		НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
				
		Если НайденныеСтроки.Количество() > 0 Тогда  // Значит, такая строка уже есть, добавлять не надо.
			Если ИдетСверкаДанных Тогда
				ТекущиеДанные = НайденныеСтроки[0];
				ТекущиеДанные[КолонкаРезультатСверки] = Истина;
				Для Каждого ИмяКолонки Из КолонкиСверки Цикл
					ТекущиеДанные[КолонкаРезультатСверки] = ТекущиеДанные[КолонкаРезультатСверки] И 
					Не (ТекущиеДанные[ИмяКолонки.Ключ] <> СтрокаТаблицы[ИмяКолонки.Ключ] 
											И (ЗначениеЗаполнено(ТекущиеДанные[ИмяКолонки.Ключ]) Или ЗначениеЗаполнено(СтрокаТаблицы[ИмяКолонки.Ключ])));
				КонецЦикла;		
			КонецЕсли;			
			Продолжить;
		КонецЕсли;
		
		Родитель = СтрокаТаблицы[ТекущийКлючСвязи];
		
		Если ЗначениеЗаполнено(Родитель) Тогда 
			СтрокаГруппировки = Дерево.Строки.Найти(Родитель, ТекущийКлючСтроки, Истина);
			Если СтрокаГруппировки = Неопределено Тогда 
				СтрокаГруппировки = ДобавитьРодителяВДеревоЗначений(Родитель, Таблица, Дерево, ТекущийКлючСтроки, КлючСвязи);
			КонецЕсли;
		Иначе 
			СтрокаГруппировки = Дерево;
		КонецЕсли;
		
		Если НЕ СтрокаГруппировки = Неопределено Тогда 
			НоваяСтрока = СтрокаГруппировки.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока.ПредставлениеЭтапа = ?(ЗначениеЗаполнено(НоваяСтрока.ПредставлениеЭтапа), НоваяСтрока.ПредставлениеЭтапа, СтрокаТаблицы.Этап);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьРодителяВДеревоЗначений(Родитель, Таблица, Дерево, КлючСтроки = "Этап", КлючСвязи = "ЭтапРодитель")
	
	Если Не ЗначениеЗаполнено(Родитель) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаРодитель = Таблица.НайтиСтроки(Новый Структура("Этап", Родитель))[0];
	
	СтрокаГруппировки = Дерево.Строки.Найти(Родитель, КлючСтроки, Истина);
	
	Если СтрокаГруппировки = Неопределено Тогда 
		СтрокаРодительДерева				= ДобавитьРодителяВДеревоЗначений(СтрокаРодитель.ЭтапРодитель, Таблица,
			Дерево, КлючСтроки, КлючСвязи);
		Если СтрокаРодительДерева = Неопределено Тогда 
			НоваяСтрока 					= Дерево.Строки.Добавить();
		Иначе
			НоваяСтрока 					= СтрокаРодительДерева.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРодитель);
		НоваяСтрока.ПредставлениеЭтапа 		= СтрокаРодитель.Этап;	
	Иначе
		НоваяСтрока = СтрокаГруппировки;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

#КонецОбласти
