
// Переопределение процедуры ПриСозданииНаСервере (после)
//
// Параметры:
//	см. описание параметров переопределяемой процедуры 
//
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьДопЭлементыУправления();
КонецПроцедуры

// Добавить дополнительные элементы управления
// Процедура, в том числе, добавляет команды и реквизиты формы, связанные с новыми элементами управления. 
//
&НаСервере
Процедура ДобавитьДопЭлементыУправления()
			
	НовыйЭлемент = Элементы.Вставить("ИКТ_ВремяНачалаРаботы", Тип("ПолеФормы"), Элементы.ГодГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ВремяНачалаРаботы";
	НовыйЭлемент.Заголовок = "Время начала работы";
	
КонецПроцедуры