

#Область РегистрСведений_ИКТ_СобытияПроходаСКУД

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ДобавитьПОД_РегистрСведенийЗапись_ИКТ_СобытияПроходаСКУД_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведенийЗапись_ИКТ_СобытияПроходаСКУД_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.ИКТ_СобытияПроходаСКУД;
	ПравилоОбработки.ПриОбработке            = "ПОД_РегистрСведенийЗапись_ИКТ_СобытияПроходаСКУД_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("ИКТ_СобытияПроходаСКУД_Отправка");
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ПОД_РегистрСведенийЗапись_ИКТ_СобытияПроходаСКУД_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.ИКТ_СобытияПроходаСКУД_Отправка = ИспользуетсяВерсия_1_17(КомпонентыОбмена);
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ДобавитьПКО_ИКТ_СобытияПроходаСКУД_Отправка(ПравилаКонвертации)
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "ИКТ_СобытияПроходаСКУД_Отправка";
	//ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыСведений.ИКТ_СобытияПроходаСКУД; 
	ПравилоКонвертации.ОбъектДанных 	 = Метаданные.РегистрыСведений.ИКТ_СобытияПроходаСКУД;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.ИКТ_СобытияПроходаСКУД"; 
	//ПравилоКонвертации.ОбъектФормата     = "Справочник.ДокументыФизическихЛиц";

	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ИКТ_СобытияПроходаСКУД_Отправка_ПриОтправкеДанных";   
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ID_ПроходаОтбор", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Записи", ИКТ_ПространствоИмен());
	
	ДобавитьПКС(СвойстваТЧ, "", "ID_Прохода", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ID_ТочкиДоступа", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ТипПрохода", 1, "ТипПрохода" , ИКТ_ПространствоИмен());
	ДобавитьПКС(СвойстваТЧ, "", "internalEmpId", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ВремяПрохода", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеПропуска", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сотрудник","Справочник_Сотрудники_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "accessObjectId", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ТипСобытия", 1);
	ДобавитьПКС(СвойстваТЧ, "", "zoneId", 1);

КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Процедура ПКО_ИКТ_СобытияПроходаСКУД_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	
	ДанныеXDTO.Вставить("ID_ПроходаОтбор",         ДанныеИБ.Отбор.ID_Прохода.Значение);
		
	ТаблицаЗаписи = ДанныеИБ.Выгрузить();
	
	ДанныеXDTO.Вставить("Записи", ТаблицаЗаписи);

КонецПроцедуры //[+]} ИКТ №16316
        
#КонецОбласти    

#Область ИКТ_ДокументВедомостьВБанк

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&ИзменениеИКонтроль("ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыВБанк")
Процедура ИКТ_ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыВБанк(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ВедомостьНаВыплатуЗарплатыВБанк";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВБанк;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ВедомостьНаВыплатуЗарплаты";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗарплатыВБанк_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ВидДоходаИсполнительногоПроизводства", "ВидДоходаИсполнительногоПроизводства", 1);
	ДобавитьПКС(СвойстваШапки, "Дата",                                 "ДатаВедомости");
	ДобавитьПКС(СвойстваШапки, "",                                     "Комментарий", 1);
	ДобавитьПКС(СвойстваШапки, "Номер",                                "НомерВедомости");
	ДобавитьПКС(СвойстваШапки, "Организация",                          "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "ПериодРегистрации",                    "ПериодВыплаты");
	ДобавитьПКС(СвойстваШапки, "Подразделение",                        "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                                     "СпособВыплаты", 1);
	ДобавитьПКС(СвойстваШапки, "",                                     "СпособРасчетов", 1);
	ДобавитьПКС(СвойстваШапки, "СуммаПоДокументу",                     "СуммаДокумента");
	#Вставка   
	//{[+] ИКТ №17494 (фрагмент ДОБАВЛЕН), Воробьев, 12.04.2026)
	ДобавитьПКС(СвойстваШапки, "Проведен",             "", 1);
	//[+]} ИКТ №17494
	#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Зарплата");
	ДобавитьПКС(СвойстваТЧ, "", "ВзысканнаяСумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НомерЛицевогоСчета", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");
	#Вставка   
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	ДобавитьПКС(СвойстваТЧ, "", "Сотрудник","Справочник_Сотрудники_Отправка");
	#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "НДФЛ");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаСПревышения", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");

КонецПроцедуры //[+]} ИКТ №16316

#КонецОбласти 

#Область ИКТ_ДокументВедомостьВКассу 
//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&ИзменениеИКонтроль("ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу")
Процедура ИКТ_ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ВедомостьНаВыплатуЗарплатыВКассу";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ВедомостьНаВыплатуЗарплаты";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",              "ДатаВедомости");
	ДобавитьПКС(СвойстваШапки, "",                  "Комментарий", 1);
	ДобавитьПКС(СвойстваШапки, "Номер",             "НомерВедомости");
	ДобавитьПКС(СвойстваШапки, "Организация",       "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "ПериодРегистрации", "ПериодВыплаты");
	ДобавитьПКС(СвойстваШапки, "Подразделение",     "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                  "СпособВыплаты", 1);
	ДобавитьПКС(СвойстваШапки, "",                  "СпособРасчетов", 1);
	ДобавитьПКС(СвойстваШапки, "СуммаПоДокументу",  "СуммаДокумента");
	#Вставка   
	//{[+] ИКТ №17494 (фрагмент ДОБАВЛЕН), Воробьев, 12.04.2026)
	ДобавитьПКС(СвойстваШапки, "Проведен",             "", 1);
	//[+]} ИКТ №17494
	#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Зарплата");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");
	#Вставка   
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	//ДобавитьПКС(СвойстваТЧ, "", "Сотрудник", 1, "Справочник_Сотрудники_Отправка", ИКТ_ПространствоИмен()); 
	ДобавитьПКС(СвойстваТЧ, "", "Сотрудник","Справочник_Сотрудники_Отправка");
	#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "НДФЛ");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "СуммаСПревышения", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ФизическоеЛицо", 1, "Справочник_ФизическиеЛица_Отправка");

КонецПроцедуры //[+]} ИКТ №16316

#КонецОбласти 

#Область ИКТ_ПереопределениеОбщихПроцедурЗарплатыНаВыплату        
//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ЗаполнитьПравилаКонвертацииОбъектов")
Процедура ИКТ_ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации)
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПКО_ИКТ_СобытияПроходаСКУД_Отправка(ПравилаКонвертации); 
		ДобавитьПКО_ГрафикРаботыСотрудников_Отправка(ПравилаКонвертации);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда 
		ДобавитьПКО_Документ_ДанныеДляРасчетаЗарплаты_Получение(ПравилаКонвертации)
	КонецЕсли;        
	ДобавитьПКО_Справочник_ГрафикиРаботыСотрудников(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ПоказателиРасчетаЗарплаты(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты(ПравилаКонвертации);
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ЗаполнитьПравилаОбработкиДанных")
Процедура ИКТ_ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных)
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПОД_РегистрСведенийЗапись_ИКТ_СобытияПроходаСКУД_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГрафикиРаботыСотрудников_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрСведенийЗапись_ГрафикРаботыСотрудников_Отправка(ПравилаОбработкиДанных);  
		ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда 
		ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ДанныеДляРасчетаЗарплаты_Получение_ИКТ(ПравилаОбработкиДанных);
	КонецЕсли;		
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ВыполнитьПроцедуруМодуляМенеджера")
Процедура ИКТ_ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры)
	Если ИмяПроцедуры = "ПКО_ИКТ_СобытияПроходаСКУД_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_ИКТ_СобытияПроходаСКУД_Отправка_ПриОтправкеДанных(
		Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПОД_РегистрСведенийЗапись_ИКТ_СобытияПроходаСКУД_Отправка_ПриОбработке" Тогда 
		ПОД_РегистрСведенийЗапись_ИКТ_СобытияПроходаСКУД_Отправка_ПриОбработке(
		Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);  
	ИначеЕсли ИмяПроцедуры = "ПОД_РегистрСведенийЗапись_ГрафикРаботыСотрудников_Отправка_ПриОбработке" Тогда 
		ПОД_РегистрСведенийЗапись_ГрафикРаботыСотрудников_Отправка_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);  
	ИначеЕсли ИмяПроцедуры = "ПКО_ГрафикРаботыСотрудников_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_ГрафикРаботыСотрудников_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	КонецЕсли;
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&После("ЗаполнитьПравилаКонвертацииПредопределенныхДанных")
Процедура ИКТ_ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации)
		
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "ТипПрохода";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ИКТ_ТипПроходаТочекДоступа;
		ПравилоКонвертации.ТипXDTO   = "ТипПрохода";
		
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход, "Вход");
		ЗначенияДляОтправки.Вставить(Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход, "Выход");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
		ЗначенияДляПолучения = Новый Соответствие;
		ЗначенияДляПолучения.Вставить("Вход", Перечисления.ИКТ_ТипПроходаТочекДоступа.Вход);
		ЗначенияДляПолучения.Вставить("Выход", Перечисления.ИКТ_ТипПроходаТочекДоступа.Выход);
		ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения; 
		
КонецПроцедуры //[+]} ИКТ №16316

//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
&ИзменениеИКонтроль("ВедомостьНаВыплатуЗарплаты_ПриОтправкеДанных")
Процедура ИКТ_ВедомостьНаВыплатуЗарплаты_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;

	ВерсияНиже110 = (СравнитьВерсии(КомпонентыОбмена.ВерсияФорматаОбмена, "1.10") < 0);
	ВерсияНиже1_11 = (СравнитьВерсии(КомпонентыОбмена.ВерсияФорматаОбмена, "1.11") < 0);
	ИспользоватьФормат1_15 = (СравнитьВерсии(КомпонентыОбмена.ВерсияФорматаОбмена, "1.15") >= 0);
	ИспользуетсяВерсия_1_17 = ИспользуетсяВерсия_1_17(КомпонентыОбмена);

	Если ВерсияНиже110 Тогда
		ВзысканныеСуммы = Новый ТаблицаЗначений;
		ВзысканныеСуммы.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
		ВзысканныеСуммы.Колонки.Добавить("ВзысканнаяСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Иначе
		ДанныеXDTO.Вставить("Комментарий", ДанныеИБ.Комментарий);
	КонецЕсли;

	Зарплата = ДанныеИБ.Состав.Выгрузить();
	Зарплата.Колонки.ИдентификаторСтроки.Имя = "ИдентификаторСтрокиУИ";
	Зарплата.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	Зарплата.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

	КВыплате = ДанныеИБ.Зарплата.Выгрузить();

	УдалятьНулевыеСуммы = Не ИспользуетсяВерсия_1_17;
	ДополнитьТаблицуЗарплатаВедомости(Зарплата, КВыплате, УдалятьНулевыеСуммы);
	#Вставка
	ДанныеXDTO.Вставить("Проведен", ДанныеИБ.Проведен);
	Зарплата.Колонки.Добавить("Сотрудник");
	Для Каждого СтрокаТЧ Из Зарплата Цикл 
		НайденнаяСтрока = ДанныеИБ.Зарплата.Найти(СтрокаТЧ.ФизическоеЛицо);	
		Если НайденнаяСтрока <> Неопределено Тогда 
			СтрокаТЧ.Сотрудник = НайденнаяСтрока.Сотрудник;			
		КонецЕсли;
	КонецЦикла;    
	
	Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда
			ДополнительныеДанные = ДанныеXDTO.AdditionalInfo;
		Иначе
			ДополнительныеДанные = Новый Структура;
		КонецЕсли;
		ДополнительныеДанные.Вставить("ЭтоУУ", ДанныеИБ.Организация.ИКТ_УУ); 
		ДанныеXDTO.Вставить("AdditionalInfo", ДополнительныеДанные);
	#КонецВставки
	ДанныеXDTO.Вставить("Зарплата", Зарплата);

	Если ВерсияНиже110 Тогда
		Для каждого СтрокаТЗ Из Зарплата Цикл
			ЗаполнитьЗначенияСвойств(ВзысканныеСуммы.Добавить(), СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;

	ПередаватьВзысканныеСуммы = Ложь;
	Если ТипЗнч(ДанныеИБ.Ссылка) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
		ДанныеXDTO.Вставить("СпособВыплаты", "ПеречислениемНаСчета");
		ПередаватьВзысканныеСуммы = Истина;
	ИначеЕсли ТипЗнч(ДанныеИБ.Ссылка) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк") Тогда
		ДанныеXDTO.Вставить("СпособВыплаты", "ЧерезБанк");
		ПередаватьВзысканныеСуммы = Истина;
	ИначеЕсли ТипЗнч(ДанныеИБ.Ссылка) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыРаздатчиком") Тогда
		ДанныеXDTO.Вставить("СпособВыплаты", "ЧерезРаздатчика");
	Иначе
		ДанныеXDTO.Вставить("СпособВыплаты", "ЧерезКассу");
	КонецЕсли;

	Если ВерсияНиже110 И ПередаватьВзысканныеСуммы Тогда
		Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда
			ДополнительныеДанные = ДанныеXDTO.AdditionalInfo;
		Иначе
			ДополнительныеДанные = Новый Структура;
		КонецЕсли;
		ДополнительныеДанные.Вставить("ВзысканныеСуммы", ВзысканныеСуммы); 
		ДанныеXDTO.Вставить("AdditionalInfo", ДополнительныеДанные);
	КонецЕсли;

	НДФЛ = ДанныеИБ.НДФЛ.Выгрузить();
	Если ВерсияНиже1_11 Тогда
		Для каждого СтрокаТЗ Из НДФЛ Цикл
			СтрокаТЗ.Сумма = СтрокаТЗ.Сумма + СтрокаТЗ.СуммаСПревышения;
		КонецЦикла;
		НДФЛ.Свернуть("ФизическоеЛицо","Сумма");
	Иначе
		Для каждого СтрокаТЗ Из НДФЛ Цикл
			СтрокаТЗ.СуммаСПревышения = СтрокаТЗ.СуммаСПревышения + СтрокаТЗ.СуммаСПревышенияПоСтавке18 + СтрокаТЗ.СуммаСПревышенияПоСтавке20 + СтрокаТЗ.СуммаСПревышенияПоСтавке22;
		КонецЦикла;
		НДФЛ.Свернуть("ФизическоеЛицо","Сумма,СуммаСПревышения");
	КонецЕсли;
	ДанныеXDTO.Вставить("НДФЛ", НДФЛ);

	Если ЗначениеЗаполнено(ДанныеИБ.СтатьяРасходов) Тогда
		СпособРасчетовСФизическимиЛицами = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.СтатьяРасходов, "СпособРасчетовСФизическимиЛицами");
		Если ЗначениеЗаполнено(СпособРасчетовСФизическимиЛицами) Тогда
			СпособРасчетов = ОбщегоНазначения.ИмяЗначенияПеречисления(СпособРасчетовСФизическимиЛицами);
		Иначе
			СпособРасчетов = "";
		КонецЕсли;
	Иначе
		СпособРасчетов = "";
	КонецЕсли;
	ДанныеXDTO.Вставить("СпособРасчетов", СпособРасчетов);
	
	ВидДоходаИсполнительногоПроизводства = "";
	Если ПередаватьВзысканныеСуммы И ЗначениеЗаполнено(ДанныеИБ.ВидДоходаИсполнительногоПроизводства) Тогда
		Если ИспользоватьФормат1_15 Тогда
			ВидДоходаИсполнительногоПроизводства = ДанныеИБ.ВидДоходаИсполнительногоПроизводства;
		Иначе
			Если ДанныеИБ.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииНеоблагаемыеЕдиновременные
				Или ДанныеИБ.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииНеоблагаемыеПериодические
				Или ДанныеИБ.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииОблагаемыеЕдиновременные
				Или ДанныеИБ.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииОблагаемыеПериодические Тогда

				ВидДоходаИсполнительногоПроизводстваСтрока = ОбщегоНазначения.ИмяЗначенияПеречисления(ДанныеИБ.ВидДоходаИсполнительногоПроизводства);
				Если ДанныеXDTO.Свойство("AdditionalInfo") И ТипЗнч(ДанныеXDTO.AdditionalInfo)=Тип("Структура") Тогда
					ДополнительныеДанные = ДанныеXDTO.AdditionalInfo;
				Иначе
					ДополнительныеДанные = Новый Структура;
				КонецЕсли;
				ДополнительныеДанные.Вставить("ВидДоходаИсполнительногоПроизводства", ВидДоходаИсполнительногоПроизводстваСтрока);
				ДанныеXDTO.Вставить("AdditionalInfo", ДополнительныеДанные);

			Иначе
				ВидДоходаИсполнительногоПроизводства = ДанныеИБ.ВидДоходаИсполнительногоПроизводства;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ДанныеXDTO.Вставить("ВидДоходаИсполнительногоПроизводства", ВидДоходаИсполнительногоПроизводства);
КонецПроцедуры //[+]} ИКТ №16316

#КонецОбласти    
 
#Область ИКТ_УниверальныйПроцедурыИФункции
//{[+] ИКТ №16316 (фрагмент ДОБАВЛЕН), Воробьев, 28.03.2026)
Функция ИКТ_ПространствоИмен() Экспорт  
	Возврат "http://v8.1c.ru/edi/edi_ext_ikt/EnterpriseData/1.20";
КонецФункции //[+]} ИКТ №16316
#КонецОбласти

#Область ИКТ_СправочникГрафикиРаботыСотрудников
Процедура ДобавитьПОД_Справочник_ГрафикиРаботыСотрудников_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ГрафикиРаботыСотрудников_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ГрафикиРаботыСотрудников;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ГрафикиРаботыСотрудников");
КонецПроцедуры                                                                       

Процедура ДобавитьПКО_Справочник_ГрафикиРаботыСотрудников(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_ГрафикиРаботыСотрудников";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.ГрафикиРаботыСотрудников;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ГрафикиРаботыСотрудников";
	ПравилоКонвертации.ВариантИдентификации         = "ПоУникальномуИдентификатору";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
КонецПроцедуры
#КонецОбласти   


#Область ИКТ_РегистрСведенийГрафикРаботыСотрудников
Процедура ДобавитьПОД_РегистрСведенийЗапись_ГрафикРаботыСотрудников_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведенийЗапись_ГрафикРаботыСотрудников_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.ГрафикРаботыСотрудников;
	ПравилоОбработки.ПриОбработке            = "ПОД_РегистрСведенийЗапись_ГрафикРаботыСотрудников_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("ГрафикРаботыСотрудников_Отправка");
КонецПроцедуры

Процедура ДобавитьПКО_ГрафикРаботыСотрудников_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "ГрафикРаботыСотрудников_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыСведений.ГрафикРаботыСотрудников;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.ГрафикРаботыСотрудников";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ГрафикРаботыСотрудников_Отправка_ПриОтправкеДанных";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());

	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "Дата", 1);
	ДобавитьПКС(СвойстваШапки, "", "Номер", 1);
	ДобавитьПКС(СвойстваШапки, "", "Ссылка", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Записи");
	ДобавитьПКС(СвойстваТЧ, "", "ГоловнаяОрганизация", 1, "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ДействуетДо", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Сотрудник", 1, "Справочник_Сотрудники_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "ГрафикРаботы", 1, "Справочник_ГрафикиРаботыСотрудников");
	ДобавитьПКС(СвойстваТЧ, "", "ДатаСобытия", 1);
КонецПроцедуры    

Процедура ПОД_РегистрСведенийЗапись_ГрафикРаботыСотрудников_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.ГрафикРаботыСотрудников_Отправка = ИспользуетсяВерсия_1_17(КомпонентыОбмена) И КомпонентыОбмена.ПараметрыКонвертации.ОтправлятьСотрудников;
КонецПроцедуры

Процедура ПКО_ГрафикРаботыСотрудников_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ГрафикРаботыСотрудников_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки);
КонецПроцедуры   

Процедура ГрафикРаботыСотрудников_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = ДанныеИБ.Отбор.Регистратор.Значение;
	РеквизитыРегистратора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, "Номер,Дата");
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", РеквизитыРегистратора.Номер);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Дата", РеквизитыРегистратора.Дата);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Ссылка", Регистратор);
	
	ТаблицаЗаписей = Новый ТаблицаЗначений;
	ТаблицаЗаписей.Колонки.Добавить("ГрафикРаботы");
	ТаблицаЗаписей.Колонки.Добавить("ДействуетДо");
	ТаблицаЗаписей.Колонки.Добавить("ГоловнаяОрганизация");
	ТаблицаЗаписей.Колонки.Добавить("Сотрудник");
	ТаблицаЗаписей.Колонки.Добавить("ДатаСобытия");
	
	Для каждого Запись Из ДанныеИБ Цикл
		НоваяСтрока = ТаблицаЗаписей.Добавить();
		НоваяСтрока.ГрафикРаботы 		= Запись.ГрафикРаботы;
		НоваяСтрока.ДействуетДо 		= Запись.ДействуетДо;
		НоваяСтрока.ГоловнаяОрганизация = Запись.ГоловнаяОрганизация;
		НоваяСтрока.Сотрудник 			= Запись.Сотрудник; 
		НоваяСтрока.ДатаСобытия 		= Запись.Период;
	КонецЦикла;
	
	ДанныеXDTO.Вставить("Записи", ТаблицаЗаписей);
КонецПроцедуры

#КонецОбласти   

#Область ИКТ_ПоказателиРасчетаЗарплаты 
Процедура ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ПоказателиРасчетаЗарплаты_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ПоказателиРасчетаЗарплаты;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ПоказателиРасчетаЗарплаты");
КонецПроцедуры                                                                       

Процедура ДобавитьПОД_Справочник_ПоказателиРасчетаЗарплаты_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ПоказателиРасчетаЗарплаты_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.ПоказателиРасчетаЗарплаты";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ПоказателиРасчетаЗарплаты");
КонецПроцедуры 

Процедура ДобавитьПКО_Справочник_ПоказателиРасчетаЗарплаты(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_ПоказателиРасчетаЗарплаты";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.ПоказателиРасчетаЗарплаты;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ПоказателиРасчетаЗарплаты";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
	ДобавитьПКС(СвойстваШапки, "Идентификатор", "Идентификатор");
	ДобавитьПКС(СвойстваШапки, "КраткоеНаименование", "КраткоеНаименование");

	ПравилоКонвертации.ПоляПоиска.Добавить("Идентификатор");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры

#КонецОбласти 

#Область ИКТ_ВидыДокументовВводДанныхДляРасчетаЗарплаты 
Процедура ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты");
КонецПроцедуры                                                                       

Процедура ДобавитьПОД_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты");
КонецПроцедуры 

Процедура ДобавитьПКО_Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты";
	ПравилоКонвертации.ВариантИдентификации         = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");

	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры

#КонецОбласти


#Область ИКТ_ДанныеДляРасчетаЗарплаты                                                                     

Процедура ДобавитьПОД_Документ_ДанныеДляРасчетаЗарплаты_Получение_ИКТ(ПравилаОбработкиДанных) 
	
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ДанныеДляРасчетаЗарплаты_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат 	 = "Документ.ДанныеДляРасчетаЗарплаты";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ДанныеДляРасчетаЗарплатыИКТ");
		
КонецПроцедуры                                                                       

Процедура ДобавитьПКО_Документ_ДанныеДляРасчетаЗарплаты_Получение(ПравилаКонвертации)
    	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ДанныеДляРасчетаЗарплатыИКТ";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ДанныеДляРасчетаЗарплаты;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ДанныеДляРасчетаЗарплаты";
	//ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ДанныеДляРасчетаЗарплаты_ПриОтправкеДанных";  
	ПравилоКонвертации.ВариантИдентификации         = "ПоУникальномуИдентификатору";
	ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, ИКТ_ПространствоИмен());
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",                                 "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий",                          "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Номер",                                "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",                          "Организация", , "Справочник_Организации_Получение");
	ДобавитьПКС(СвойстваШапки, "Период",            		           "Период");
   	ДобавитьПКС(СвойстваШапки, "ПериодОкончания",                      "ПериодОкончания");
	ДобавитьПКС(СвойстваШапки, "Подразделение",                        "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Получение");
	ДобавитьПКС(СвойстваШапки, "ПодразделениеУчетаЗатрат",             "ПодразделениеРегламентированногоУчета", , "Справочник_ПодразделенияОрганизаций_Получение");
	ДобавитьПКС(СвойстваШапки, "ВидДокумента",			               "ВидДокумента", , "Справочник_ВидыДокументовВводДанныхДляРасчетаЗарплаты");
	ДобавитьПКС(СвойстваШапки, "КраткийСоставДокумента",               "КраткийСоставДокумента"); 
	ДобавитьПКС(СвойстваШапки, "Сотрудник",				               "Сотрудник", , "Справочник_Сотрудники_Отправка");    
	ДобавитьПКС(СвойстваШапки, "СпособОтраженияЗарплатыВБухучете", "СпособОтраженияЗарплатыВБухучете", , "Справочник_СпособыОтраженияЗарплатыВБухУчете");

	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ЗначенияПоказателей", "ЗначенияПоказателей");
	
	ДобавитьПКС(СвойстваТЧ, "Объект", "Объект", , "Справочник_Сотрудники_Получение"); 
	ДобавитьПКС(СвойстваТЧ, "Показатель", "Показатель", , "Справочник_ПоказателиРасчетаЗарплаты"); 
	ДобавитьПКС(СвойстваТЧ, "Значение", "Значение");
	ДобавитьПКС(СвойстваТЧ, "Период", "Период");
	ДобавитьПКС(СвойстваТЧ, "ПериодОкончания", "ПериодОкончания");
	ДобавитьПКС(СвойстваТЧ, "Коэффициент", "Коэффициент");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ФизическиеЛица", "ФизическиеЛица");	
	ДобавитьПКС(СвойстваТЧ, "ФизическоеЛицо", "ФизическоеЛицо", , "Справочник_ФизическиеЛица_Получение"); 
	
КонецПроцедуры



#КонецОбласти 