#Область ОписаниеПеременных

&НаКлиенте	
Перем ПеременныеКлиента;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ИнициализацияФормы();
	КонецЕсли;		
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	ПроверитьКорректностьЗаполнения(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	ТекущийОбъект.НачалоПериода = ПериодРасчета.ДатаНачала;
	ТекущийОбъект.ОкончаниеПериода = ПериодРасчета.ДатаОкончания;
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипов(Элемент)
	
	ТекущиеДанные = Элементы.Индикаторы.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Элемент.ПодчиненныеЭлементы.ИндикаторыЗначениеИндикатора.ОграничениеТипа = ТекущиеДанные.ТипЗначенияИндикатора;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИндикаторы

&НаКлиенте
Процедура ИндикаторыИндикаторПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Индикаторы.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ПривестиТипИндикатораВСтроке(ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
			
	УстановитьОграничениеТипов(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыПередНачаломИзменения(Элемент, Отказ)
	
	УстановитьОграничениеТипов(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Индикатор",
		Объект.Индикаторы, ЭтаФорма, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Индикатор",
		Объект.Индикаторы, ЭтаФорма, Истина);		

КонецПроцедуры

&НаКлиенте
Процедура ИндикаторыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ПараметрыПодбора = ПодготовитьДопПараметры("ТаблицаИндикаторыПодобрать");
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТаблицаИндикаторыПодобрать(Команда)		
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИндикаторыЗаполнить(Команда)
	
	Если Объект.Индикаторы.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена и заполнена заново. Продолжить?'"); 
		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаИндикаторыЗаполнитьЗавершение",ЭтотОбъект);		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТаблицаИндикаторыЗаполнитьЗавершение(Неопределено,Неопределено);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИндикаторыПересчитать(Команда)
	
	ПроверитьЗаполнение();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Проведен Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаИндикаторыПересчитатьЗавершение",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Для пересчета данных табличной части необходимо отменить проведение документа. Продолжить?",
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ТаблицаИндикаторыПересчитатьЗавершение(Неопределено, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПериодПоСрокуПроекта(Команда)
	
	СрокиПроекта = ПолучитьПланируемыеСрокиПроекта(Объект.Проект);
	
	ПериодРасчета.ДатаНачала = СрокиПроекта.ДатаНачалаПлан;
	ПериодРасчета.ДатаОкончания = СрокиПроекта.ДатаЗавершенияПлан;
	
КонецПроцедуры

// Выполняет действия при подборе.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, Структура - строка, дял которой должны выполниться действия.
//  ПараметрыПодбора	 - Произвольный - параметр подбора.
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт
	
	СтруктураДопСвойствИндикатора = ПолучитьСтруктуруСвойствИндикатора(СтрокаТабличнойЧасти.Индикатор);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДопСвойствИндикатора);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства
// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ТаблицаИндикаторыЗаполнитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Индикаторы.Очистить();
	КонецЕсли;
	
	ТаблицаИндикаторыЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаИндикаторыЗаполнитьНаСервере()
	
	Результат = РезультатЗапросаПолучитьИндикаторыПроекта(Объект.Проект);
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Индикаторы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ПривестиТипИндикатораВСтроке(НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИндикаторыПересчитатьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда		
		ВызватьОтменуПроведения();
		Прочитать();
	КонецЕсли;
	
	ТаблицаИндикаторыПересчитатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаИндикаторыПересчитатьНаСервере()
	
	РезультатПоПроекту = упоПоказателиЭффективностиПроектов.РассчитатьПоказателиЭффективностиПроекта(Объект.Проект,
			ПериодРасчета.ДатаНачала, ПериодРасчета.ДатаОкончания);
	
	Для Каждого СтрИндикатор Из Объект.Индикаторы Цикл
		Если РезультатПоПроекту = Неопределено Тогда
			ЗначениеИндикатора = 0;
		Иначе
			ЗначениеИндикатора = РезультатПоПроекту.Получить(СтрИндикатор.Индикатор);
		КонецЕсли;
		
		СтрИндикатор.ЗначениеИндикатора = ?(ЗначениеИндикатора = Неопределено, 0, ЗначениеИндикатора);
		ПривестиТипИндикатораВСтроке(СтрИндикатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВызватьОтменуПроведения()
	
	Если Объект.Проведен Тогда
		ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ОтменитьПроведениеДокумента();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруСвойствИндикатора(ИндикаторСсылка)
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ТипЗначенияИндикатора");
	
	СтруктураСвойств.Вставить("ВидЗаполненияИндикатора", ИндикаторСсылка.ВидЗаполнения);
	
	МассивТипов =  Новый Массив;
	КЧ = Новый КвалификаторыЧисла(15,3);
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	КС = Новый КвалификаторыСтроки(100);

	Если ИндикаторСсылка.ТипИндикатора = Перечисления.упоТипИндикатора.Число Тогда
		
		МассивТипов.Добавить(Тип("Число"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов, КЧ);
		
	ИначеЕсли ИндикаторСсылка.ТипИндикатора = Перечисления.упоТипИндикатора.Дата Тогда
		
		МассивТипов.Добавить(Тип("Дата"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов,,,КД);
		
	ИначеЕсли ИндикаторСсылка.ТипИндикатора = Перечисления.упоТипИндикатора.Булево Тогда
		
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов);
		
	ИначеЕсли ИндикаторСсылка.ТипИндикатора = Перечисления.упоТипИндикатора.Строка Тогда
		
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов,,КС);		
		
	Иначе
		
		МассивТипов.Добавить(Тип("Число"));
		МассивТипов.Добавить(Тип("Дата"));
		МассивТипов.Добавить(Тип("Булево"));
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТиповИндикатор = Новый ОписаниеТипов(МассивТипов, КЧ,КС,КД);		 
		
	КонецЕсли;
	
	СтруктураСвойств.ТипЗначенияИндикатора = ОписаниеТиповИндикатор;
	
	Возврат СтруктураСвойств;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьКорректностьЗаполнения(Отказ)
		
	МассивПоказателей = ПолучитьПоказателиПроекта(Объект.Проект);
	
	МассивСтрокНесоответствующихПоказателей = Новый Массив();
	Для каждого СтрПоказатель Из Объект.Индикаторы Цикл
		Индикатор = СтрПоказатель.Индикатор;
		Если МассивПоказателей.Найти(Индикатор) = Неопределено Тогда
			МассивСтрокНесоответствующихПоказателей.Добавить(СтрПоказатель.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Ошибки = Неопределено;
	Для Инд = 0 По МассивСтрокНесоответствующихПоказателей.ВГраница() Цикл
		СтрокаОшибки = МассивСтрокНесоответствующихПоказателей[Инд];
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.Индикаторы[%1].Индикатор",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Принадлежность показателя ""%1"" не соответствует выбранному проекту/проектной задаче.'"),
				Объект.Индикаторы[СтрокаОшибки - 1].Индикатор),
			"Объект.Индикаторы",
			СтрокаОшибки - 1,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Принадлежность показателя ""%1"" не соответствует выбранному проекту/проектной задаче.'"),
				Объект.Индикаторы[СтрокаОшибки - 1].Индикатор));
	КонецЦикла;
			
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоказателиПроекта(Проект)
		
	РезультатЗапроса = РезультатЗапросаПолучитьИндикаторыПроекта(Проект);
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Индикатор");
	
КонецФункции

&НаСервереБезКонтекста
Функция РезультатЗапросаПолучитьИндикаторыПроекта(Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПоказателиПроектов.Ссылка КАК Индикатор
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	               |ГДЕ
	               |	упоПоказателиПроектов.ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.упоВидЗаполненияИндикатора.АвтоматическиВДокументеРасчетЭффективности)";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиТипИндикатораВСтроке(СтрокаТаблицы) 
	
	СтруктураДопСвойствИндикатора = ПолучитьСтруктуруСвойствИндикатора(СтрокаТаблицы.Индикатор);
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураДопСвойствИндикатора);
	ТипЗнчИндикатора = ТипЗнч(СтрокаТаблицы.ЗначениеИндикатора);
	
	Если Не СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(ТипЗнчИндикатора) Тогда
		
		Если СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Булево")) Тогда
			
			СтрокаТаблицы.ЗначениеИндикатора = Ложь;
			
		ИначеЕсли СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Число")) Тогда 
			
			СтрокаТаблицы.ЗначениеИндикатора = 0;
			
		ИначеЕсли СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Дата")) Тогда 
			
			СтрокаТаблицы.ЗначениеИндикатора = Дата(1, 1, 1);
			
		ИначеЕсли СтрокаТаблицы.ТипЗначенияИндикатора.СодержитТип(Тип("Строка")) Тогда 	
			
			СтрокаТаблицы.ЗначениеИндикатора = "";
			
		КонецЕсли;			
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.	
	// И приведем гиперссылку в правильный вид.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
				
		Объект.Проект = ВыбранноеЗначение;
		
	КонецЕсли;
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
		
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	 		
	АдресХранилища = "";
	
	Если имяКоманды = "ТаблицаИндикаторыПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.Индикаторы;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Справочники.упоПоказателиПроектов";
        ТаблицаФормы = Объект.Индикаторы;
	    ИмяКолонки = "Индикатор";		
				
	КонецЕсли;
		
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
		
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	Если имяКоманды = "ТаблицаИндикаторыПодобрать" Тогда
		
		СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора(имяКоманды);
			
	КонецЕсли;

	АдресХранилища  = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора(имяКоманды)
	
	Перем ТаблицаОтбора;
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	
	Если имяКоманды = "ТаблицаИндикаторыПодобрать" Тогда
		
		НоваяСтрока =  ТаблицаОтбора.Добавить();
		
		НоваяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЗаполнения");
		НоваяСтрока.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		НоваяСтрока.Применение =  ТипПримененияОтбораКомпоновкиДанных.Элементы;
		НоваяСтрока.Использование  = Истина;
		НоваяСтрока.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
		
		НоваяСтрока.ПравоеЗначение = Перечисления.упоВидЗаполненияИндикатора.АвтоматическиВДокументеРасчетЭффективности;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	  
КонецФункции

&НаСервере
Процедура ИнициализацияФормы()
	
	Для Каждого СтрокаИндикатора Из Объект.Индикаторы Цикл				
		СтруктураДопСвойствИндикатора = ПолучитьСтруктуруСвойствИндикатора(СтрокаИндикатора.Индикатор);
		ЗаполнитьЗначенияСвойств(СтрокаИндикатора, СтруктураДопСвойствИндикатора);		
	КонецЦикла;
	
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
	ПериодРасчета.ДатаНачала = Объект.НачалоПериода;
	ПериодРасчета.ДатаОкончания = Объект.ОкончаниеПериода;
	
	ЗаполнитьСписокВыбораДляПоляИндикатор(Элементы.ИндикаторыИндикатор.СписокВыбора);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПланируемыеСрокиПроекта(Проект)
	
	Возврат упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроекта(Проект);
			
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораДляПоляИндикатор(ЗаполняемыйСписок)
	
	Индикаторы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   упоПоказателиПроектов.Ссылка КАК Ссылка
		|ИЗ
		|   Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
		|ГДЕ
		|   упоПоказателиПроектов.ВидЗаполнения = ЗНАЧЕНИЕ(Перечисление.упоВидЗаполненияИндикатора.АвтоматическиВДокументеРасчетЭффективности)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполняемыйСписок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти
