
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОткрытьДокумент(Команда)
	
	ОткрытьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьДокумент()
	
	Если Не ЗначениеЗаполнено(Объект.СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;	
	
	Попытка
		СсылкаДляПерехода = Объект.ПодключениеКИсточникуДанных + "#" + Объект.СсылкаНаДокумент;	
		ПерейтиПоНавигационнойСсылке(СсылкаДляПерехода);	
	Исключение
		Инфо = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиент.СообщитьПользователю(Инфо.Причина.Описание);			
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

