
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
	АдресСхемыКомпоновкиДанных = Параметры.АдресСхемыКомпоновкиДанных;
	ТекущееВыражение = Параметры.ТекущееВыражение;
	ТипЗначения = Параметры.ТипЗначения;
	
	ЗаполнитьДеревоВыбора();
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработатьВыбор(Элементы.ДеревоВыбора.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДеревоВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыбор(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор(ВыбраннаяСтрока)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = ДеревоВыбора.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Не СтрокаДерева.ПодходящийТип Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СтрокаДерева.Значение);
	
КонецПроцедуры

///// ФинансоваяОтчетностьСервер
&НаСервере
Процедура ЗаполнитьДеревоВыбора()
	
	СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
	СтрокиДерева.Очистить();

	Если Параметры.Свойство("ПравилоБюджетирования") И ЗначениеЗаполнено(Параметры.ПравилоБюджетирования) Тогда
		ЗаполнитьДеревоВыбораПоПравилуБюджетирования(СтрокиДерева, Параметры.ПравилоБюджетирования);	
	Иначе
		ЗаполнитьДеревоВыбораПоСхемеКомпоновкиДанных(СтрокиДерева);
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоВыбораПоСхемеКомпоновкиДанных(СтрокиДерева)
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
			
	ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы;
	ТекущийУровень = 0;
	ДобавитьДоступныеПоляРекурсивно(СтрокиДерева, ДоступныеПоляВыбора, ТекущийУровень, "");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныеПоляРекурсивно(СтрокиДерева, ДоступныеПоляВыбора, ТекущийУровень, ЗаголовокВерхнегоУровня)
	
	Если ТекущийУровень = 3 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ДоступноеПолеВыбора Из ДоступныеПоляВыбора Цикл
		
		ЭтоСистемнаяПапка = 
			ДоступноеПолеВыбора.Папка 
			И (ДоступноеПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("СистемныеПоля")
				Или ДоступноеПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("ПараметрыДанных"));
		
		Если ЭтоСистемнаяПапка Тогда
			Продолжить;
		КонецЕсли;
		
		// Переработано
		ДоступностьПоля = Ложь;
		Если НЕ ДоступноеПолеВыбора.Папка Тогда		
			ДоступностьПоля = ДоступностьПоТипуЗначения(ДоступноеПолеВыбора.ТипЗначения, ТипЗначения);
		КонецЕсли;	
		
		Если ТекущийУровень > 1 И Не ДоступностьПоля Тогда
			Продолжить;
		КонецЕсли;
		
		ЧастиПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка(ДоступноеПолеВыбора.Поле), ".");
		Если ЧастиПоля.Найти("Родитель") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДоступноеПолеВыбора.Папка Тогда
			Представление = ДоступноеПолеВыбора.Заголовок;
			ТекущийЗаголовок = ЗаголовокВерхнегоУровня;
		Иначе
			Представление = Сред(ДоступноеПолеВыбора.Заголовок, СтрДлина(ЗаголовокВерхнегоУровня) + 1);
			ТекущийЗаголовок = ЗаголовокВерхнегоУровня + "." + Представление;
		КонецЕсли;
		
		НоваяСтрокаДерева = СтрокиДерева.Добавить();
		НоваяСтрокаДерева.ЭтоГруппа = ДоступноеПолеВыбора.Папка;
		НоваяСтрокаДерева.Представление = Представление;
		НоваяСтрокаДерева.Значение = ДоступноеПолеВыбора.Поле;
		НоваяСтрокаДерева.ПодходящийТип = ДоступностьПоля;
		НоваяСтрокаДерева.Картинка = ?(ДоступноеПолеВыбора.Папка, БиблиотекаКартинок.Папка, БиблиотекаКартинок.Элемент);
		НоваяСтрокаДерева.ТипЗначения = ДоступноеПолеВыбора.ТипЗначения;
		
		Если НоваяСтрокаДерева.Значение = ТекущееВыражение Тогда
			Элементы.ДеревоВыбора.ТекущаяСтрока = НоваяСтрокаДерева.ПолучитьИдентификатор();
		КонецЕсли;
			
		Если ДоступноеПолеВыбора.Папка Тогда
			НовыйУровень = ТекущийУровень;
		Иначе
			НовыйУровень = ТекущийУровень + 1;
		КонецЕсли;
		
		ДобавитьДоступныеПоляРекурсивно(НоваяСтрокаДерева.ПолучитьЭлементы(), 
						ДоступноеПолеВыбора.Элементы, НовыйУровень, ТекущийЗаголовок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступностьПоТипуЗначения(ТипЗначенияПоля, РазрешенныйТипЗначения)
	
	Для Каждого Тип Из ТипЗначенияПоля.Типы() Цикл
		Если РазрешенныйТипЗначения.СодержитТип(Тип) Тогда
			Возврат Истина;				
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Заполняет дерево выбора поля на основании доступных полей схемы компоновки данных.
// Вызывается из форм:
// 		- настройки заполнения аналитики бюджетирования,
// 		- настройки заполнения субконто международного учета.
// 
// Параметры:
// 	  Форма - УправляемаяФорма - Форма выбора поля заполнения.
//
Процедура ЗаполнитьДеревоВыбораПоПравилуБюджетирования(СтрокиДерева, ПравилоБюджетирования)
	
	СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
			
	НомераАналитик = упоПроектноеБюджетированиеСервер.НомераАналитикСтатьиБюджета(ПравилоБюджетирования.СтатьяБюджетов);
	
	МенеджерПравилаОтражения = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования;
	
	Для Каждого НомерАналитики Из НомераАналитик Цикл
		
		Аналитика = НомерАналитики.Ключ;
				
		РасширенныйТипЗначенияАналитики = МенеджерПравилаОтражения.РасширенныйТипЗначенияАналитики(Аналитика.ТипЗначения);		
		
		НоваяСтрокаДерева = СтрокиДерева.Добавить();
		НоваяСтрокаДерева.Представление = Строка(Аналитика);
		НоваяСтрокаДерева.Значение = Аналитика;
		НоваяСтрокаДерева.ПодходящийТип = ДоступностьПоТипуЗначения(РасширенныйТипЗначенияАналитики, ТипЗначения);
		НоваяСтрокаДерева.Картинка = БиблиотекаКартинок.Элемент;
		НоваяСтрокаДерева.ТипЗначения = РасширенныйТипЗначенияАналитики;
				
		Если НоваяСтрокаДерева.Значение = ТекущееВыражение Тогда
			Элементы.ДеревоВыбора.ТекущаяСтрока = НоваяСтрокаДерева.ПолучитьИдентификатор();
		КонецЕсли;

	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти
