
&ИзменениеИКонтроль("ОписаниеДанныхПозицииВХранилище")
Функция ИКТ_ОписаниеДанныхПозицииВХранилище(Форма, Объект, ИдентификаторСтрокиТекущейПозиции, ДатаВступленияВСилу, ПодразделениеПозиций, ВыборПодчиненныхПодразделений, ИдентификаторПозицииИсточника)

	Форма.ИдентификаторРедактируемойСтроки = ИдентификаторСтрокиТекущейПозиции;

	ДанныеПозиции = Объект.Позиции.НайтиПоИдентификатору(Форма.ИдентификаторРедактируемойСтроки);

	ОписаниеПозиции = УправлениеШтатнымРасписанием.ОписаниеПозицииШтатногоРасписания();
	ОписаниеПозиции.Вставить("Действие");
	ОписаниеПозиции.Вставить("ТекущееКоличествоСтавок");
	ОписаниеПозиции.Вставить("ТекущийФОТ");
	ОписаниеПозиции.Вставить("КатегорияПерсонала");
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
		ОписаниеПозиции.Вставить("ТарификационнаяГруппа");
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ОписаниеПозиции, ДанныеПозиции);

	Если ИдентификаторПозицииИсточника <> Неопределено Тогда
		СтрокаИсточник = Объект.Позиции.НайтиПоИдентификатору(ИдентификаторПозицииИсточника);
		ОписаниеПозиции.Вставить("ИдентификаторСтрокиИсточникаПозиции", СтрокаИсточник.ИдентификаторСтрокиПозиции);
	КонецЕсли;

	ОписаниеПозиции.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр ИЛИ ДанныеПозиции.Действие = Перечисления.ДействияСПозициямиШтатногоРасписания.ЗакрытьПозицию);
	ОписаниеПозиции.Вставить("ДатаУтверждения", ДатаВступленияВСилу);
	Если Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда
		ОписаниеПозиции.Вставить("Регистратор", Объект.Ссылка);
	КонецЕсли;
	ОписаниеПозиции.Вставить("ПодразделениеПозиций", ПодразделениеПозиций);
	Если ВыборПодчиненныхПодразделений Тогда
		ОписаниеПозиции.Вставить("ВыборПодчиненныхПодразделений", Истина);
	КонецЕсли; 

	ОписаниеПозиции.Организация = Объект.Организация;
	ОписаниеПозиции.ПозицияШтатногоРасписания = ДанныеПозиции.Позиция;

	ФОИспользоватьВилкуСтавокВШтатномРасписании = Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьВилкуСтавокВШтатномРасписании");

	// Начисления с показателями
	НачисленияПозиции = Объект.Начисления.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));
	ОписаниеПозиции.Начисления = НачисленияПозиции;

	// Показатели и коэффициенты.
	ПоказателиПозиции = Объект.Показатели.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));

	ОписаниеПозиции.Вставить("Показатели", ПоказателиПозиции);

	// Ежегодные отпуска
	ЕжегодныеОтпускаПозиции = Объект.ЕжегодныеОтпуска.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));
	ОписаниеПозиции.ЕжегодныеОтпуска = ЕжегодныеОтпускаПозиции;

	// Специальности
	СпециальностиПозиции = Объект.Специальности.Выгрузить(Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции));
	ОписаниеПозиции.Специальности = СпециальностиПозиции;
	#Вставка     
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.УтверждениеШтатногоРасписания") ИЛИ
		 ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ИзменениеШтатногоРасписания") Тогда
	
		ОписаниеПозиции.Вставить("ИКТ_ДолжностьС", ДанныеПозиции.ИКТ_ДолжностьС);
		ОписаниеПозиции.Вставить("ИКТ_IDДолжностьС", ДанныеПозиции.ИКТ_IDДолжностьС);
		ОписаниеПозиции.Вставить("ИКТ_НомерГруппыПодбора", ДанныеПозиции.ИКТ_НомерГруппыПодбора);
		ОписаниеПозиции.Вставить("ИКТ_ТипПроверкиКандидатовДБ", ДанныеПозиции.ИКТ_ТипПроверкиКандидатовДБ);
		ОписаниеПозиции.Вставить("ИКТ_ВидИнцидентаПоКРВ", ДанныеПозиции.ИКТ_ВидИнцидентаПоКРВ);
		ОписаниеПозиции.Вставить("ИКТ_УровеньДоступа", ДанныеПозиции.ИКТ_УровеньДоступа);
		ОписаниеПозиции.Вставить("ИКТ_Должность", ДанныеПозиции.ИКТ_Должность);
		ОписаниеПозиции.Вставить("ИКТ_Группа", ДанныеПозиции.ИКТ_Группа);
		ОписаниеПозиции.Вставить("ИКТ_Грейд", ДанныеПозиции.ИКТ_Грейд);
	
		ОписаниеПозиции.Вставить("ИКТ_НазваниеРазделаПерсонала", ДанныеПозиции.ИКТ_НазваниеРазделаПерсонала);
		ОписаниеПозиции.Вставить("ИКТ_ПроцентЗанятости", ДанныеПозиции.ИКТ_ПроцентЗанятости);
		
		ОписаниеПозиции.Вставить("ИКТ_ТрВодитУдостоверение", ДанныеПозиции.ИКТ_ТрВодитУдостоверение); 
		ОписаниеПозиции.Вставить("ИКТ_ДоступКНД", ДанныеПозиции.ИКТ_ДоступКНД);
		ОписаниеПозиции.Вставить("ИКТ_ТребуетсяМедОсмотр", ДанныеПозиции.ИКТ_ТребуетсяМедОсмотр);
		ОписаниеПозиции.Вставить("ИКТ_СозданиеПремийШтраф", ДанныеПозиции.ИКТ_СозданиеПремийШтраф);
		ОписаниеПозиции.Вставить("ИКТ_АдминистративныйРуководительАР", ДанныеПозиции.ИКТ_АдминистративныйРуководительАР);
		ОписаниеПозиции.Вставить("ИКТ_ФункциональныйРуководительФР", ДанныеПозиции.ИКТ_ФункциональныйРуководительФР);
		ОписаниеПозиции.Вставить("ИКТ_ВышестоящийРуководительВР", ДанныеПозиции.ИКТ_ВышестоящийРуководительВР);
		ОписаниеПозиции.Вставить("ИКТ_СрокДействияСтатусаВакансии", ДанныеПозиции.ИКТ_СрокДействияСтатусаВакансии);
		ОписаниеПозиции.Вставить("ИКТ_НеУчитываетсяВKPI", ДанныеПозиции.ИКТ_НеУчитываетсяВKPI);
		ОписаниеПозиции.Вставить("ИКТ_БизнесЕдиница", ДанныеПозиции.ИКТ_БизнесЕдиница);
		ОписаниеПозиции.Вставить("ИКТ_Департамент", ДанныеПозиции.ИКТ_Департамент);
		ОписаниеПозиции.Вставить("ID_ДолжностьS", ДанныеПозиции.ID_ДолжностьS);

	КонецЕсли;
	
	#КонецВставки

	ОписаниеДанныхПозицииВХранилище = Новый Структура;
	ОписаниеДанныхПозицииВХранилище.Вставить("Ключ", ОписаниеПозиции.ПозицияШтатногоРасписания);
	ОписаниеДанныхПозицииВХранилище.Вставить("АдресДанныхПозицииВХранилище", ПоместитьВоВременноеХранилище(ОписаниеПозиции, Форма.УникальныйИдентификатор));

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		МодульУправленческаяЗарплатаФормы = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплатаФормы");
		МодульУправленческаяЗарплатаФормы.ДополнитьОписаниеДанныхПозицииВХранилище(Объект, ОписаниеПозиции, ДанныеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала") Тогда
		МодульХарактеристикиПерсоналаФормы = ОбщегоНазначения.ОбщийМодуль("ХарактеристикиПерсоналаФормы");
		МодульХарактеристикиПерсоналаФормы.ПоместитьХарактеристикиПерсоналаВОписаниеПозиции(Форма, ОписаниеПозиции, ДанныеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ЛьготыСотрудников") Тогда
		МодульЛьготыСотрудников = ОбщегоНазначения.ОбщийМодуль("ЛьготыСотрудников");
		МодульЛьготыСотрудников.ПоместитьЛьготыВОписаниеПозиции(Форма, ОписаниеПозиции, ДанныеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОбучениеРазвитие") Тогда
		МодульОбучениеРазвитие = ОбщегоНазначения.ОбщийМодуль("ОбучениеРазвитиеФормы");
		МодульОбучениеРазвитие.ПоместитьОбучениеВОписаниеПозиции(Форма, ОписаниеПозиции, ДанныеПозиции);
	КонецЕсли;

	Возврат ОписаниеДанныхПозицииВХранилище;

КонецФункции
