#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияФормы();
	
	// Заполняем подразделение аналогично документу упоРаспределениеРабочегоВремениЗаНеделю
	Если упоУправлениеФормамиСервер.ЭтоНовый(ЭтотОбъект) И ЗначениеЗаполнено(Объект.Ресурс) Тогда
		ЗаполнитьПодразделениеРесурса();	
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтотОбъект, Объект, Отказ, СтандартнаяОбработка); 
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОтключитьОбработчикОжиданияДляАвтоматическойЗаписи();
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
        
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
        
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДопДанные(Ложь);
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДопДанные();
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РесурсПриИзменении(Элемент)
	
	РесурсПриИзмененииНаСервере();
	ОчиститьПоручения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если НЕ ДоступныВсеРесурсы Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = СписокТрудовыхРесурсовПользователя;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	МассивИдентификаторовУдаляемыхСтрок = ПолучитьИдентификаторыЗадачДляОчистки();
	
	Если ЗначениеЗаполнено(МассивИдентификаторовУдаляемыхСтрок) Тогда        
		ОписаниеОповещенияОчиститьТабельДня = Новый ОписаниеОповещения("ВопросОчисткиТабеляДня", 
													ЭтаФорма, МассивИдентификаторовУдаляемыхСтрок);
		ТекстВопроса = НСтр("ru = 'Данные таблицы ""Табель дня"" будут очищены. Продолжить?'");	
		ПоказатьВопрос(ОписаниеОповещенияОчиститьТабельДня, ТекстВопроса, РежимДиалогаВопрос.ДаНет);		
	Иначе
		ВопросОчисткиТабеляДня(КодВозвратаДиалога.Да, МассивИдентификаторовУдаляемыхСтрок);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ОбработатьДобавлениеНовойСтрокиКлиент(, Копирование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиСохранятьДокументПриИзменении(Элемент)
	
	ПодключитьОтключитьОбработчикОжиданияДляАвтоматическойЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическиСохранятьКаждыеСекундПриИзменении(Элемент)
	
	ПодключитьОтключитьОбработчикОжиданияДляАвтоматическойЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняДлительностьВЧасахПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		ПересчитатьДатуОкончанияИСроки(ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	ТекЗадача = ТекДанные.Задача;
	Если НЕ ЗначениеЗаполнено(ТекЗадача) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	РазделУчета = ПолучитьРазделУчета(ТекЗадача);	
	
	ОткрытьФормуВыбораВидаОперации(Элемент, Элементы.ТабельДня, РазделУчета, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекЗадача = ТекДанные.Задача;
	
	Если НЕ ЗначениеЗаполнено(ТекЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	РазделУчета = ПолучитьРазделУчета(ТекЗадача);	
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.РазделУчета", РазделУчета);
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(ПараметрВыбора);	
	МассивПараметровВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	Элементы.ТабельДняВидОперации.ПараметрыВыбора = МассивПараметровВыбора;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняНачалоПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда	
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Начало > ТекДанные.Окончание Тогда 
		ТекДанные.Окончание = ТекДанные.Начало; 
		ПересчитатьСрокиСледующейЗадачи(ТекДанные, Объект);
	КонецЕсли;	
	
	ПересчитатьСрокиПредыдущейЗадачи(ТекДанные, Объект);
	ПересчитатьДлительностьВСтроке(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняОкончаниеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда	
		Если ТекДанные.Окончание < ТекДанные.Начало Тогда 
			ТекДанные.Начало = ТекДанные.Окончание; 
			ПересчитатьСрокиПредыдущейЗадачи(ТекДанные, Объект);
		КонецЕсли;
		ПересчитатьСрокиСледующейЗадачи(ТекДанные, Объект);
		ПересчитатьДлительностьВСтроке(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВходящееЗначение = ПараметрыПеретаскивания.Значение[0];
	
	ДобавитьЗадачуВТабель(ВходящееЗначение, Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачуВТабель(ДанныеЗадачиЗадача, ИдСтрокиКуда = Неопределено)
	
	Если ИдСтрокиКуда = Неопределено Тогда
		НоваяСтрока = Объект.ТабельДня.Добавить();
	Иначе
		НоваяСтрока = Объект.ТабельДня.НайтиПоИдентификатору(ИдСтрокиКуда);
	КонецЕсли;
		
	Если ТипЗнч(ДанныеЗадачиЗадача) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗадачиЗадача);
	Иначе
		НоваяСтрока.Задача = ДанныеЗадачиЗадача;
	КонецЕсли;
	
	ЗаполнитьДопДанныеСтрокиТабеля(НоваяСтрока.ПолучитьИдентификатор());
	
	Если ИдСтрокиКуда = Неопределено Тогда
		ОбработатьДобавлениеНовойСтрокиКлиент(НоваяСтрока);
	Иначе
		УстановитьВидОперацииПоТипуЗадачи(НоваяСтрока); // Перетащили в 
	КонецЕсли;
	
	Если НоваяСтрока.ПроектПометкаУдаления Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Выбран проект, помеченный на удаление!'");
		Сообщение.Сообщить();			
	КонецЕсли;
	
	Если НоваяСтрока.ПроектнаяЗадачаПометкаУдаления Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Выбрана проектная задача, помеченная на удаление!'");
		Сообщение.Сообщить();			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабельДняЗадачаПриИзменении(Элемент)
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ЗаполнитьДопДанныеСтрокиТабеля(ТекДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.Окончание = ТекДанные.Начало;
		ПересчитатьСрокиСледующейЗадачи(ТекДанные, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <= КонецДня(ЭтаФорма.ДатаЗапрета) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = '""Установлена дата запрета:'") + " """+ЭтаФорма.ДатаЗапрета+"""";
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроектныеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Объект.ПроектныеЗадачи.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = СтрЗаменить(Поле.Имя, "ПроектныеЗадачи", "");
	
	Если ИмяПоля = "Наименование" Тогда
		Если ЗначениеЗаполнено(ТекСтрока.Задача) Тогда
			ИмяПоля = "Задача";
		Иначе
			ИмяПоля = "ПроектнаяЗадача";
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьЗначение( , ТекСтрока[ИмяПоля]);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Объект.ТабельДня.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяПоля = СтрЗаменить(Поле.Имя, "ТабельДня", "");
	
	Если ИмяПоля <> "Проект" И ИмяПоля <> "Задача" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, ТекСтрока[ИмяПоля]);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПорученийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = ТаблицаПоручений.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;	
	ПоказатьЗначение(, ТекСтрока.Задача);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабельДня

&НаКлиенте
Процедура ТабельДняРольПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодразделенияРоли = ПодразделенияРоли(ТекДанные.Роль);
	
	Если Не ЗначениеЗаполнено(ТекДанные.Роль) 
		Или Не ЗначениеЗаполнено(ПодразделенияРоли) Тогда
		ТекДанные.Подразделение = Неопределено;
		Элементы.ТабельДняПодразделение.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	НайденноеПодразделение = ПодразделенияРоли.НайтиПоЗначению(ТекДанные.Подразделение);
	Если НайденноеПодразделение = Неопределено Тогда
		НайденноеПодразделение = ПодразделенияРоли[0];
	КонецЕсли;
	
	ТекДанные.Подразделение = НайденноеПодразделение.Значение;
	Элементы.ТабельДняПодразделение.ТолькоПросмотр = Ложь;
	
	ЗаполнитьДопДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьДопДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельДняРольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	РолиТрудовогоРесурса = упоРесурсыИРолиВызовСервера.обПолучитьТекщиеРолиТрудовогоРесурса(Объект.Ресурс);
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", РолиТрудовогоРесурса);
	
	СписокПараметровВыбора = Новый Массив;
	СписокПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор", Отбор));
	
	Элементы.ТабельДняРоль.ПараметрыВыбора = Новый ФиксированныйМассив(СписокПараметровВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьПроектныеЗадачи(Команда)
	
	ЗаполнитьПроектныеЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоручения(Команда)
	
	ЗаполнитьПоручения();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьРаботу(Команда)
	НоваяСтрока = Объект.ТабельДня.Добавить();
	НоваяСтрока.Комментарий = НСтр("ru = 'Завершил работу'");
	ОбработатьДобавлениеНовойСтрокиКлиент(НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбед(Команда)
	НоваяСтрока = Объект.ТабельДня.Добавить();
	НоваяСтрока.Комментарий = НСтр("ru = 'Обед'");
	ОбработатьДобавлениеНовойСтрокиКлиент(НоваяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроектныеЗадачиДопИнформация(Команда)
	ТекСостояние = Элементы.ПроектныеЗадачиКомандаПроектныеЗадачиДопИнформация.Пометка; 
	Элементы.ПроектныеЗадачиКомандаПроектныеЗадачиДопИнформация.Пометка = Не ТекСостояние;
	
	ОбновитьВидимостьДоступностьЭлементов(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаТабельДняУчитыватьТекущееВремя(Команда)
	ТекСостояние = Элементы.ТабельДняКомандаТабельДняУчитыватьТекущееВремя.Пометка; 
	Элементы.ТабельДняКомандаТабельДняУчитыватьТекущееВремя.Пометка = Не ТекСостояние;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВверх(Команда)
	ПереместитьТекущуюСтроку(-1);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВниз(Команда)
	ПереместитьТекущуюСтроку(1);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоОперативнойЗагрузке(Команда)
	ЗаполнитьПоОперативнойЗагрузкеСервер();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// АВТОМАТИЧЕСКОЕ СОХРАНЕНИЕ

&НаКлиенте
Функция АвтоматическоеСохранениеДокумента() 
	
	Записать();	
	Модифицированность = Ложь;
		
КонецФункции

&НаКлиенте
Функция ПодключитьОтключитьОбработчикОжиданияДляАвтоматическойЗаписи()
	
	Попытка
		ОтключитьОбработчикОжидания("АвтоматическоеСохранениеДокумента");
	Исключение
	КонецПопытки;	
	
	Если Объект.АвтоматическиСохранятьДокумент Тогда
		
		КаждыеСекунд = ?(ЗначениеЗаполнено(Объект.АвтоматическиСохранятьКаждыеСекунд),Объект.АвтоматическиСохранятьКаждыеСекунд,60);
		
		ПодключитьОбработчикОжидания("АвтоматическоеСохранениеДокумента", КаждыеСекунд);
		
	КонецЕсли;
	
КонецФункции

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияФормы()
	
	ОбновитьДатуЗапрета();
	
	ВремяНачалаДня = упоРаспределениеТрудозатратВызовСервера.ПолучитьВремяНачалаДня();
	
	ЗаполнитьСписокТрудовыхРесурсовПользователя();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПервичноеЗаполнение();
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьЭлементов(ЭтаФорма, Объект);
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	ЭтаФорма.Элементы.ТабельДняПодразделение.ТолькоПросмотр = Не ЭтоПолноправныйПользователь;
	ЭтаФорма.Элементы.ТабельДняРоль.ТолькоПросмотр = Не ЭтоПолноправныйПользователь;
	
	УстановитьУсловноеОформление();
	
	ДатаНаФорме = Объект.Дата;
	
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьРазделУчета(Задача)
	
	Если ТипЗнч(Задача) = Тип("СправочникСсылка.упоЗадания") Тогда
		Задача = упоФункцииБСП.ПолучитьЗначениеРеквизита(Задача, "ОбъектБазы");
	КонецЕсли; 
	
	Если ТипЗнч(Задача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		РазделУчета = ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача");
	ИначеЕсли ТипЗнч(Задача) = Тип("СправочникСсылка.упоВнепроектныеЗадачи")
				ИЛИ ТипЗнч(Задача) = Тип("Неопределено") Тогда
		РазделУчета = ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача");
	ИначеЕсли ТипЗнч(Задача) = Тип("СправочникСсылка.упоПричиныПотерьРабочегоВремени") Тогда
		РазделУчета = ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени");
	Иначе
		РазделУчета = ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПустаяСсылка");
	КонецЕсли;
	
	Возврат РазделУчета;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Процедура РесурсПриИзмененииНаСервере()
	
	ПроверитьСоответствиеТрудовогоРесурсаПриИзменении();	
	ЗаполнитьПроектныеЗадачи();	
	ЗаполнитьПодразделениеРесурса();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодразделениеРесурса()
	
	НайденныеЗначения = 
		упоРесурсыИРолиСервер.ПодразделениеИРольТрудовогоРесурсаНаЗаданнуюДату(Объект.Ресурс, Объект.Дата);
		
	Объект.Подразделение = НайденныеЗначения.Подразделение;	
		
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПроектныеЗадачи() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект.ПроектныеЗадачи.Очистить();
	
	Документы.упоТабельУчетаРабочегоВремени.ЗаполнитьРабочимиЗаданиями(Объект.ПроектныеЗадачи, 
																		Объект.Дата, 
																		Объект.Ресурс, 
																		Истина);
		
	врКэш = Новый Соответствие;
	Для Каждого СтрокаТабеля Из Объект.ТабельДня Цикл
		ПроверитьСтрокуТабеля(СтрокаТабеля, врКэш);
	КонецЦикла;	
	
	ЗаполнитьДопДанные();	
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьПоручения(ЭтаФорма)
	
	ЭтаФорма.ТаблицаПоручений.Очистить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабельДня(ЭтаФорма, МассивИдентификаторовУдаляемыхСтрок)
			
	Если МассивИдентификаторовУдаляемыхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ТабельДня = ЭтаФорма.Объект.ТабельДня;
	
	Для Каждого СтрокаИдентификатор Из МассивИдентификаторовУдаляемыхСтрок Цикл	
		ТабельДня.Удалить(ТабельДня.НайтиПоИдентификатору(СтрокаИдентификатор));
	КонецЦикла; 
		
КонецПроцедуры
 
&НаСервере
Функция ЗаполнитьПоручения()
	
	ТаблицаПоручений.Очистить();
	
	ПолученныеПоручения = упоРаспределениеТрудозатратВызовСервера.ЗаполнитьВнепроектныеЗадачи(Объект.Ресурс, НачалоДня(Объект.Дата),
		КонецДня(Объект.Дата));
		
	ТаблицаПоручений.Загрузить(ПолученныеПоручения);
		
КонецФункции

&НаСервере
Функция ПервичноеЗаполнение() 
	
	Объект.Дата = КонецДня(ТекущаяДатаСеанса());
	
	ДатаНаФорме = Объект.Дата;
	
	МассивИдентификаторовУдаляемыхСтрок = ПолучитьИдентификаторыЗадачДляОчистки();
	
	ОчиститьТабельДня(ЭтаФорма, МассивИдентификаторовУдаляемыхСтрок);
	
	Если ЗначениеЗаполнено(Объект.Ресурс) Тогда
		РесурсВСписке = СписокТрудовыхРесурсовПользователя.НайтиПоЗначению(Объект.Ресурс);	
		Если РесурсВСписке = Неопределено Тогда
			Объект.Ресурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
			Объект.ТабельДня.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ресурс) Тогда
		УстановитьТрудовойРесурс();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ресурс) Тогда
		ЗаполнитьПроектныеЗадачи();
	Иначе
		ЗаполнитьДопДанные();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСписокТрудовыхРесурсовПользователя() 
	
	ДоступныВсеРесурсы = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("упоДобавлениеИзменениеТабеляРабочегоВремениБезОграничений");	
	МассивТР = Документы.упоТабельУчетаРабочегоВремени.ПолучитьМассивТрудовыхРесурсовПользователя();		
	СписокТрудовыхРесурсовПользователя.ЗагрузитьЗначения(МассивТР);	
	
КонецФункции

&НаСервере
Функция УстановитьТрудовойРесурс()

	УстановитьПривилегированныйРежим(Истина);
	МассивРесурсов = упоРесурсыИРолиСервер.ПолучитьТрудовыеРесурсыТекущегоСотрудника();
	Если МассивРесурсов.Количество() = 1 Тогда
		Объект.Ресурс = МассивРесурсов[0];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ресурс) И СписокТрудовыхРесурсовПользователя.Количество() = 1 Тогда
		Объект.Ресурс = СписокТрудовыхРесурсовПользователя[0].Значение;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПроверитьСоответствиеТрудовогоРесурсаПриИзменении()

	Если Не ЗначениеЗаполнено(Объект.Ресурс) Тогда
		Объект.ТабельДня.Очистить();
		Объект.ПроектныеЗадачи.Очистить();
		Возврат;
	КонецЕсли; 
	
	Если Не упоРесурсыИРолиСервер.РесурсУправляетсяТекущимПользователем(Объект.Ресурс) Тогда
		ТекстСообщения = НСтр("ru = 'Текущий пользователь не является владельцем выбранного трудового ресурса ""%1"".'");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Объект.Ресурс), , "Объект.Ресурс");
		
		Объект.Ресурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Функция ОбработатьДобавлениеНовойСтрокиКлиент(ТекДанные = Неопределено, СтрокаСкопирована = Ложь) 
	
	Если ТекДанные = Неопределено Тогда
		ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	КонецЕсли;	
		
	Если ТекДанные <> Неопределено Тогда
		
		ТекДата = ОбщегоНазначенияКлиент.ДатаСеанса();

		Если УчитыватьТекВремя(ЭтаФорма, Объект) Тогда
			ТекВремя = ТекДата;
		Иначе
			Если Объект.ТабельДня.Количество() > 1 Тогда
				НомерТекСтроки = ТекДанные.НомерСтроки;
				Если НомерТекСтроки = 1 Тогда
					ТекВремя = ВремяНачалаДня;
				Иначе
					ПредСтрока = Объект.ТабельДня[НомерТекСтроки-2];
					ТекВремя = ПредСтрока.Окончание
				 КонецЕсли;
			Иначе
				ТекВремя = ВремяНачалаДня;
			КонецЕсли;
		КонецЕсли;
		
		ТекДанные.Начало = ТекВремя;
		ТекДанные.Окончание = ТекВремя;
		
		ПересчитатьСрокиПредыдущейЗадачи(ТекДанные, Объект);
		ПересчитатьСрокиСледующейЗадачи(ТекДанные, Объект);
		
		ПересчитатьДлительностьВСтроке(ТекДанные);
		
		Если НЕ СтрокаСкопирована Тогда
			
			УстановитьВидОперацииПоТипуЗадачи(ТекДанные);
			
		КонецЕсли; 			
		
	КонецЕсли;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидОперацииДляПроектнойЗадачи(ПроектнаяЗадача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации КАК ВидОперации,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации.РазделУчета КАК РазделУчетаВидаОперации
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.Текущая)";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВидОперации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоВидыОпераций.Явка");
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ВидОперации;		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий(); 		
	РазделУчетаПроектнаяЗадача = 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача");
	Если ЗначениеЗаполнено(Выборка.РазделУчетаВидаОперации) 
		И Выборка.РазделУчетаВидаОперации = РазделУчетаПроектнаяЗадача Тогда
		ВидОперации = Выборка.ВидОперации;
	КонецЕсли;			
	
	Возврат ВидОперации;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидОперацииПоТипуЗадачи(ТекДанные)
	
	Задача = ТекДанные.Задача;
	
	Если Задача = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Задача) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		ВидОперации = ПолучитьВидОперацииДляПроектнойЗадачи(Задача);
		
	ИначеЕсли ТипЗнч(Задача) = Тип("СправочникСсылка.упоВнепроектныеЗадачи")
		Или ТипЗнч(Задача) = Тип("СправочникСсылка.упоПричиныПотерьРабочегоВремени") Тогда 
		
		ВидОперации = упоФункцииБСП.ПолучитьЗначениеРеквизита(Задача, "ВидОперации");
		
	Иначе	
		
		ОбъектЗадачи = упоФункцииБСП.ПолучитьЗначениеРеквизита(Задача, "ОбъектБазы");
		Если ТипЗнч(ОбъектЗадачи) = Тип("СправочникСсылка.упоВнепроектныеЗадачи") Тогда
			ВидОперации = упоФункцииБСП.ПолучитьЗначениеРеквизита(ОбъектЗадачи, "ВидОперации");
		ИначеЕсли ТипЗнч(ОбъектЗадачи) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда 
			ВидОперации = ПолучитьВидОперацииДляПроектнойЗадачи(ОбъектЗадачи);	
		Иначе
			ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПустаяСсылка");						
		КонецЕсли; 
		
	КонецЕсли;	
	
	ТекДанные.ВидОперации = ВидОперации;
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция ПересчитатьСрокиПредыдущейЗадачи(ТекДанные, Объект) 
	
	ТекСтрока = ТекДанные; 
	
	Пока Истина Цикл
		
		ПредСтрока = ПолучитьПредыдущуюСтроку(ТекСтрока, Объект);
		Если ПредСтрока = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если ПредСтрока.Окончание = ТекСтрока.Начало Тогда
			Прервать;
		КонецЕсли;
		
		ПредСтрока.Окончание = ТекСтрока.Начало;	
		
		Если ПредСтрока.Окончание < ПредСтрока.Начало Тогда
			ПредСтрока.Начало = ПредСтрока.Окончание;
		КонецЕсли;
		
		ПересчитатьДлительностьВСтроке(ПредСтрока);
		
		ТекСтрока = ПредСтрока;
		
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредыдущуюСтроку(ТекущаяСтрока, Объект) 
	
	НомерТекущейСтроки = ТекущаяСтрока.НомерСтроки;
	ИндексПредыдущейСтроки = НомерТекущейСтроки - 2;	
	
	Если ИндексПредыдущейСтроки >= 0 Тогда
		
		Возврат Объект.ТабельДня[ИндексПредыдущейСтроки];
		
	Иначе
		
		Возврат Неопределено;

	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПересчитатьСрокиСледующейЗадачи(ТекДанные, Объект, МенятьДлительность = Истина) 
		
	ТекСтрока = ТекДанные;
	
	Пока Истина Цикл
		
		СледСтрока = ПолучитьСледующуюСтроку(ТекСтрока, Объект);
		Если СледСтрока = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если СледСтрока.Начало = ТекСтрока.Окончание Тогда
			Прервать;
		КонецЕсли;
		
		СледСтрока.Начало = ТекСтрока.Окончание;
		
		Если МенятьДлительность Тогда			
			Если СледСтрока.Начало > СледСтрока.Окончание Тогда
				СледСтрока.Окончание = СледСтрока.Начало;
			КонецЕсли;
			ПересчитатьДлительностьВСтроке(СледСтрока);			
		Иначе
			
			ПересчитатьДатуОкончания(СледСтрока);
						
		КонецЕсли;	
				
		ТекСтрока = СледСтрока;
		
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьДатуОкончания(ТекущаяСтрока) 
	
	ВремяОкончания = ТекущаяСтрока.Начало + ТекущаяСтрока.ДлительностьВЧасах * 3600;
	Если ВремяОкончания >= Дата("00010102000000") Тогда
		ТекущаяСтрока.Окончание = Дата("00010101235959");
		ПересчитатьДлительностьВСтроке(ТекущаяСтрока);
	Иначе
		ТекущаяСтрока.Окончание = ВремяОкончания;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДатуОкончанияИСроки(Строка)
	
	ПересчитатьДатуОкончания(Строка);
	ПересчитатьСрокиСледующейЗадачи(Строка, Объект, Ложь);	 	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСледующуюСтроку(ТекущаяСтрока, Объект) 
	
	НомерТекущейСтроки = ТекущаяСтрока.НомерСтроки;
	ИндексСледующейСтроки = НомерТекущейСтроки;	
	
	Если ИндексСледующейСтроки < Объект.ТабельДня.Количество() Тогда
		
		Возврат Объект.ТабельДня[ИндексСледующейСтроки];
		
	Иначе
		
		Возврат Неопределено;

	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПересчитатьДлительностьВСтроке(СтрокаТЧ)
	
	ДатаНачало = НачалоМинуты(СтрокаТЧ.Начало);
	ДатаОкончание = СтрокаТЧ.Окончание;
	
	Если Не ДатаОкончание = КонецДня("00010101") Тогда
		ДатаОкончание = НачалоМинуты(ДатаОкончание);
	КонецЕсли;
	
	РазностьВСекундах = ДатаОкончание - ДатаНачало;
	СтрокаТЧ.ДлительностьВЧасах = РазностьВСекундах / 3600;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьДоступностьЭлементов(ЭтаФорма, Объект)
	ЭтаФорма.Элементы.ПроектныеЗадачиГруппаДопИнформация.Видимость = ЭтаФорма.Элементы.ПроектныеЗадачиКомандаПроектныеЗадачиДопИнформация.Пометка;
	ЭтаФорма.Элементы.ПроектныеЗадачиРуководительПроекта.Видимость = ЭтаФорма.Элементы.ПроектныеЗадачиКомандаПроектныеЗадачиДопИнформация.Пометка;
	ЭтаФорма.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр Или (КонецДня(ЭтаФорма.ДатаЗапрета) >= Объект.Дата);
	ЭтаФорма.Элементы.ТабельДняКомандаЗавершитьРаботу.Видимость = Ложь;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УчитыватьТекВремя(ЭтаФорма, Объект)
	Возврат ЭтаФорма.Элементы.ТабельДняКомандаТабельДняУчитыватьТекущееВремя.Пометка;
КонецФункции 

&НаСервере
Функция ОбновитьДатуЗапрета() 
	ДатаЗапрета = Дата(1,1,1);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРольИПодразделениеПЗнаДату(ПЗ, Ресурс, Дата) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	Запрос.УстановитьПараметр("ПЗ", ПЗ);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРолиТрудовыхРесурсовСрезПоследних.Роль
	               |ПОМЕСТИТЬ РолиРесурса
	               |ИЗ
	               |	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(, Ресурс = &Ресурс) КАК упоРолиТрудовыхРесурсовСрезПоследних
	               |ГДЕ
	               |	упоРолиТрудовыхРесурсовСрезПоследних.РольНазначена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение,
	               |	ЕСТЬNULL(упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатрат, 0) КАК ДоляТрудозатрат
	               |ПОМЕСТИТЬ РесурсыПЗ
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПЗ
	               |				И Ресурс В
	               |					(ВЫБРАТЬ
	               |						РолиРесурса.Роль
	               |					ИЗ
	               |						РолиРесурса)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(, Ресурс = &Ресурс) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача
	               |			И упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение = упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение
	               |			И упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс = упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса
	               |			И упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоВыделенныеТрудовыеРесурсыСрезПоследних.Версия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоВерсииПроекта.Версия И упоВерсииПроекта.Текущая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоСрокиПроектныхЗадачСрезПоследних.Версия
	               |ГДЕ
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан <= &КонецДня
	               |			И упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан >= &НачалоДня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РесурсыПЗ.Ресурс КАК Роль,
	               |	РесурсыПЗ.Подразделение,
	               |	РесурсыПЗ.ДоляТрудозатрат КАК ДоляТрудозатрат
	               |ИЗ
	               |	РесурсыПЗ КАК РесурсыПЗ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДоляТрудозатрат УБЫВ";
				   
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Результат = Новый Структура("Роль, Подразделение");
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса[0]);
	Иначе
		 Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЗаполнитьДопДанные(Обновлять = Истина) 
	
	Если Обновлять Тогда
		Документы.упоТабельУчетаРабочегоВремени.ОбновитьДопДанные(ДанныеЗадач, ЭтаФорма);	
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.ПроектныеЗадачи Цикл
		Документы.упоТабельУчетаРабочегоВремени.ЗаполнитьСтрокуТаблицыДопДанными(СтрокаТаблицы, ДанныеЗадач, ЭтаФорма);		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Объект.ТабельДня Цикл
		Документы.упоТабельУчетаРабочегоВремени.ЗаполнитьСтрокуТаблицыДопДанными(СтрокаТаблицы, ДанныеЗадач, ЭтаФорма);		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДопДанныеСтрокиТабеля(пСтрокаТабеля) 
	
	СтрокаТабеля = Объект.ТабельДня.НайтиПоИдентификатору(пСтрокаТабеля);
	
	ПроверитьСтрокуТабеля(СтрокаТабеля);
	
	Документы.упоТабельУчетаРабочегоВремени.ЗаполнитьСтрокуТаблицыДопДанными(СтрокаТабеля, ДанныеЗадач, ЭтаФорма, Истина);
	
	Если упоИнтеграцияEPMСервер.ИспользоватьПодсистемуРаспределениеЗарплаты() Тогда
		МодульРаспределениеЗарплатыСервер = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыСервер");
		МодульРаспределениеЗарплатыСервер.ЗаполнитьВидОперацииСтрокиТабеля(СтрокаТабеля);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьСтрокуТабеля(СтрокаТабеля, пКэш = Неопределено) 
	
	ОсновныеПараметры = Документы.упоТабельУчетаРабочегоВремени.ОсновныеПараметрыСтроки(); 
	
	//
	
	Если Не ЗначениеЗаполнено(СтрокаТабеля.Задача) Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТабеля, Новый Структура(ОсновныеПараметры),, "Задача");
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ТипЗнч(СтрокаТабеля.Задача) = Тип("ДокументСсылка.упоПроектнаяЗадача") 
			ИЛИ ТипЗнч(СтрокаТабеля.Задача) = Тип("СправочникСсылка.упоЗадания") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//
	
	НужноИскать = Истина;
	РольИПодразделение = Неопределено; 
	
	Если пКэш <> Неопределено Тогда
		ДанныеКэша = пКэш.Получить(СтрокаТабеля.Задача);
		Если ДанныеКэша = -1 Тогда
			НужноИскать = Ложь;
		Иначе
			РольИПодразделение = ДанныеКэша; 
		КонецЕсли;
	КонецЕсли;
	
	Если НужноИскать И РольИПодразделение = Неопределено Тогда 
		РольИПодразделение = ПолучитьРольИПодразделениеПЗнаДату(СтрокаТабеля.Задача, Объект.Ресурс, Объект.Дата);	
		Если пКэш <> Неопределено Тогда 
			Если РольИПодразделение = Неопределено Тогда
				пКэш.Вставить(СтрокаТабеля.Задача, -1);
			Иначе
				пКэш.Вставить(СтрокаТабеля.Задача, РольИПодразделение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если РольИПодразделение = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		ТекстСообщения = НСтр("ru = 'Трудовой ресурс не имеет ни одной роли из назначенных на 
		| проектную задачу в строке ""%1"" или день документа не попадает в ее сроки.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаТабеля.НомерСтроки);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТабеля, Новый Структура(ОсновныеПараметры));
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(СтрокаТабеля, РольИПодразделение);
		
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция ЗаполнитьПоОперативнойЗагрузкеСервер() 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ресурс", Объект.Ресурс);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Объект.Дата));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя КАК ДатаВремя,
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача,
	               |	МАКСИМУМ(упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение) КАК Подразделение,
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Роль
	               |ИЗ
	               |	РегистрСведений.упоОперативнаяЗагрузкаСпециалистов.СрезПоследних(
	               |			,
	               |			ТрудовойРесурс = &Ресурс
	               |				И ДатаВремя >= &НачалоДня
	               |				И ДатаВремя <= &КонецДня) КАК упоОперативнаяЗагрузкаСпециалистовСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |			ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И (упоВерсииПроекта.Текущая)
	               |		ПО упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача = упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача
	               |			И упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Роль = упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс
	               |ГДЕ
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Занят
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача,
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя,
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Роль
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаВремя";
	
	Объект.ТабельДня.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредСтрокаТабеля = Неопределено;
	Пока Выборка.Следующий() Цикл
		
		ДобавитьНовуюСтрока = Ложь;
		ДобавитьПромежуточнуюСтроку = Ложь;
		
		ВремяЗаписи = Дата(1,1,1, Час(Выборка.ДатаВремя), Минута(Выборка.ДатаВремя), Секунда(Выборка.ДатаВремя));
				
		Если ПредСтрокаТабеля <> Неопределено И ВремяЗаписи - ПредСтрокаТабеля.Окончание > 1 Тогда
			ДобавитьПромежуточнуюСтроку = Истина;
		КонецЕсли;		
		
		Если ДобавитьПромежуточнуюСтроку ИЛИ
		 ПредСтрокаТабеля = Неопределено ИЛИ 
		 ПредСтрокаТабеля.ПроектнаяЗадача <> Выборка.ПроектнаяЗадача Тогда
		 	ДобавитьНовуюСтрока = Истина;
		КонецЕсли;
		
		Если ДобавитьПромежуточнуюСтроку Тогда
			ПромежуточнаяСтрока = Объект.ТабельДня.Добавить();
			ПромежуточнаяСтрока.Начало = ПредСтрокаТабеля.Окончание;
			ПромежуточнаяСтрока.Окончание = ВремяЗаписи;
			ПересчитатьДлительностьВСтроке(ПромежуточнаяСтрока);
		КонецЕсли;
		
		Если ДобавитьНовуюСтрока Тогда
			ПредСтрокаТабеля = Объект.ТабельДня.Добавить();
			ПредСтрокаТабеля.Задача = Выборка.ПроектнаяЗадача;
			ПредСтрокаТабеля.ПроектнаяЗадача = Выборка.ПроектнаяЗадача;
			ПредСтрокаТабеля.Роль = Выборка.Роль;
			ПредСтрокаТабеля.Подразделение = Выборка.Подразделение;
			ПредСтрокаТабеля.Начало = ВремяЗаписи;
		КонецЕсли;
		
		ПредСтрокаТабеля.Окончание = КонецЧаса(ВремяЗаписи)+1;
		ПересчитатьДлительностьВСтроке(ПредСтрокаТабеля);
		
	КонецЦикла;
	                                    
	ЗаполнитьПроектныеЗадачи();
	
КонецФункции

&НаКлиенте
Процедура ПереместитьТекущуюСтроку(Направление) 
	
	ТекДанные = Элементы.ТабельДня.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Индекс = Объект.ТабельДня.Индекс(ТекДанные);
	НовыйИндекс = Индекс + Направление;
	
	Если НовыйИндекс < 0 Или НовыйИндекс >= Объект.ТабельДня.Количество() Тогда
		Возврат;
	КонецЕсли;
		
	Объект.ТабельДня.Сдвинуть(Индекс, Направление);			
	
	ПараметрыВремени = "Начало, Окончание";
	СтруктураПараметровВремени = Новый Структура(ПараметрыВремени);
	ЗаполнитьЗначенияСвойств(СтруктураПараметровВремени, ТекДанные);
	ЗаполнитьЗначенияСвойств(Объект.ТабельДня[НовыйИндекс], Объект.ТабельДня[Индекс], ПараметрыВремени);
	ЗаполнитьЗначенияСвойств(Объект.ТабельДня[Индекс], СтруктураПараметровВремени);
	
	Если Направление > 0 Тогда
		ТекСтрока = Объект.ТабельДня[Индекс];
	Иначе
		ТекСтрока = Объект.ТабельДня[НовыйИндекс];
	КонецЕсли;
	
	ПересчитатьДатуОкончанияИСроки(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаОперации(Элемент, ТаблицаФормы, РазделУчета, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("РазделУчета", РазделУчета);	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	Контекст = Новый Структура;
	Контекст.Вставить("УИстроки", ТаблицаФормы.ТекущиеДанные.ПолучитьИдентификатор());

	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораВидаОперацииОкончание", ЭтотОбъект, Контекст);
	ОткрытьФорму("Справочник.упоВидыОпераций.ФормаВыбора", ПараметрыФормы, Элемент, , , , ОписаниеОповещения); 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторыЗадачДляОчистки()
	
	ДатаОтбора 							= ЭтаФорма.ДатаНаФорме;
	ДанныеФормыТабельДня	 			= ЭтаФорма.Объект.ТабельДня;
	МассивИдентификаторовУдаляемыхСтрок = Новый Массив;

	Для Каждого СтрокаДанных Из ДанныеФормыТабельДня Цикл	
				
		Если НЕ ЗначениеЗаполнено(СтрокаДанных.Задача) Тогда
			Продолжить;
		КонецЕсли;   
		
		ТекущееЗадание = СтрокаДанных.Задача;
		
		Если ТипЗнч(ТекущееЗадание) = Тип("СправочникСсылка.упоЗадания") Тогда
 			СрокиПЗ = ПолучитьПлановыеСрокиЗадачи(ТекущееЗадание);
		ИначеЕсли ТипЗнч(ТекущееЗадание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
			СрокиПЗ = Документы.упоПроектнаяЗадача.ПолучитьСроки(ТекущееЗадание);	
		Иначе
			Продолжить;
		КонецЕсли; 			
		
		Если СрокиПЗ["ДатаНачала"] > ДатаОтбора ИЛИ СрокиПЗ["ДатаЗавершения"] < ДатаОтбора Тогда
			МассивИдентификаторовУдаляемыхСтрок.Добавить(СтрокаДанных.ПолучитьИдентификатор());
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат МассивИдентификаторовУдаляемыхСтрок; 
	
КонецФункции

// Получает плановые даты начала и даты окончания Задания.
//
// Параметры:
//  Задание	 - СправочникСсылка.упоЗадание - Задание.
//
// Возвращаемое значение:
//	СтруктураСроки - Структура - ключи:
//		* ДатаНачала	 - Дата - плановая дата начала.
//		* ДатаЗавершения - Дата - плановая дата окончания.
//
&НаСервереБезКонтекста
Функция ПолучитьПлановыеСрокиЗадачи(Задание)
	
	СрокиПЗ = Новый Структура;
	СрокиПЗ.Вставить("ДатаНачала", '00010101');
	СрокиПЗ.Вставить("ДатаЗавершения", '00010101');
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСрокиЗаданий.ДатаНачалаПлан КАК ДатаНачала,
	               |	упоСрокиЗаданий.ДатаОкончанияПлан КАК ДатаЗавершения
	               |ИЗ
	               |	РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	               |ГДЕ
	               |	упоСрокиЗаданий.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СрокиПЗ;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СрокиПЗ, Выборка);
	
	Возврат СрокиПЗ;
	
КонецФункции

&НаКлиенте
Процедура ВопросОчисткиТабеляДня(РезультатВопроса, МассивИдентификаторовУдаляемыхСтрок) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ДатаНаФорме = НачалоДня(Объект.Дата);
		Возврат;
	КонецЕсли;
	
	Объект.Дата = КонецДня(ДатаНаФорме);
			
	ОбработатьИзменениеДатыТабеляНаСервере(МассивИдентификаторовУдаляемыхСтрок);
	
КонецПРоцедуры

&НаСервере
Процедура ОбработатьИзменениеДатыТабеляНаСервере(МассивИдентификаторовУдаляемыхСтрок)
	
	ОчиститьТабельДня(ЭтаФорма, МассивИдентификаторовУдаляемыхСтрок);
	ОчиститьПоручения(ЭтаФорма);
	
	ЗаполнитьПроектныеЗадачи();
	ЗаполнитьПодразделениеРесурса();
		
КонецПроцедуры	

// Обработчик описания оповещения открытия формы вида операций - окончание.
//
// Параметры:
//  ВидОперации				 - СправочникСсылка.упоВидыОпераций	- вид операции.
//  ДополнительныеПараметры	 - Структура	 					- дополнительные параметры.
//
&НаКлиенте
Процедура ОткрытьФормуВыбораВидаОперацииОкончание(ВидОперации, ДополнительныеПараметры) Экспорт
	
	Если ВидОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.ТабельДня.НайтиПоИдентификатору(ДополнительныеПараметры.УИстроки);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ВидОперации = ВидОперации;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П4, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ШрифтЖирный = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЖирный);
	ЭлементОтбора 				 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ПроектныеЗадачи.ДетальноеПланирование");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ОформляемоеПоле 	 		 = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле 		 = Новый ПолеКомпоновкиДанных("ПроектныеЗадачиНаименование");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодразделенияРоли(Роль)
	
	Если Не ЗначениеЗаполнено(Роль) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПодразделенияРолейСоответствие = упоРесурсыИРолиСервер.ПолучитьПодразделенияРолей(Роль);
	
	ПодразделенияРолей = ПодразделенияРолейСоответствие.Получить(Роль);
	
	Возврат ПодразделенияРолей;
	
КонецФункции

#КонецОбласти
