////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с договорами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Сохраняет дерево в таблицы Этапы, График начислений и График оплаты.
//
// Параметры:
//  Дерево					 - ДеревоЗначений, ДанныеФормыДерево - сохраняемое в таблицу дерево.
//  Объект					 - ДанныеФормыСтруктура				 - объект формы документа Регистрация юридических условий договора.
//  ТипДеревоЗначений		 - Булево							 - признак того, что дерево имеет тип ДеревоЗначений.
//  ОчиститьТаблицы			 - Булево							 - признак того, что нужно предварительно очистить таблицы.
//  КолонкиДляСверки		 - Соответствие						 - Имя колонки и сравниваемое значение, при котором строка не рассматривается.
//  СтруктураДляНовыхЭтапов	 - Структура, Неопределено
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция СохранитьДеревоВТаблицу(Дерево, Объект, ТипДеревоЗначений = Ложь, ОчиститьТаблицы = Истина, КолонкиДляСверки = Неопределено, СтруктураДляНовыхЭтапов = Неопределено) Экспорт
	
	// Типы элементов:
	// 0 - Модель
	// 1 - Этап
	// 2 - Пакет
	// 3 - Доход
	// 4 - Расход
	// 5 - Поступление
	// 6 - Выплата
	
	Если ОчиститьТаблицы Тогда
		Объект.Этапы.Очистить();
		Объект.ГрафикНачислений.Очистить();
		Объект.ГрафикОплаты.Очистить();
	КонецЕсли;
	
	Если СтруктураДляНовыхЭтапов = Неопределено Тогда
		СоздаватьИзменятьЭтапы = Ложь;
	Иначе
		СоздаватьИзменятьЭтапы = Истина;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Дерево);
	Если ТипЗначения = Тип("ДанныеФормыЭлементДерева") ИЛИ ТипЗначения = Тип("ДанныеФормыДерево") ИЛИ ТипЗначения = Тип("ДанныеФормыКоллекцияЭлементовДерева") Тогда
		ЭтоДанныеФормы = Истина;
		ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Иначе
		ЭтоДанныеФормы = Ложь;
		ЭлементыДерева = Дерево.Строки;
	КонецЕсли;
	
	ИдетСверкаДанных = КолонкиДляСверки <> Неопределено;

	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		ПропуститьСтроку = Ложь;
		Если ИдетСверкаДанных Тогда
			Для Каждого КолонкаСверки Из КолонкиДляСверки Цикл
				Если СтрокаДерева[КолонкаСверки.Ключ] = КолонкаСверки.Значение Тогда
					ПропуститьСтроку = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ПропуститьСтроку Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если СоздаватьИзменятьЭтапы Тогда
			СтруктураДляНовыхЭтапов.Наименование = СтрокаДерева.ПредставлениеЭтапа;
			СтруктураДляНовыхЭтапов.ПолноеНаименование = СтрокаДерева.ПредставлениеЭтапа;

			Если ЗначениеЗаполнено(СтрокаДерева.Этап) Тогда
				НовыйЭтапДоговора = упоУправлениеДоговорамиСервер.СоздатьЭтапДоговора(СтруктураДляНовыхЭтапов, Ложь, СтрокаДерева.Этап);
			Иначе 
				НовыйЭтапДоговора = упоУправлениеДоговорамиСервер.СоздатьЭтапДоговора(СтруктураДляНовыхЭтапов);
				
				НайтиСвязиЭтаповДоговораСПроектнымКонтуром = Объект.СвязиЭтаповДоговораСПроектнымКонтуром.Найти(СтрокаДерева.ИндексСвязиЭтапа, "ИндексСвязиЭтапа");
				Если НайтиСвязиЭтаповДоговораСПроектнымКонтуром <> Неопределено Тогда
					Если ЗначениеЗаполнено(НайтиСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора) Тогда
						НайтиСвязиЭтаповДоговораСПроектнымКонтуром.ЭтапДоговора = НовыйЭтапДоговора;
					КонецЕсли;
				КонецЕсли;
				СтрокаДерева.Этап = НовыйЭтапДоговора;	
			КонецЕсли;
			СтрокаРодитель = ?(ЭтоДанныеФормы, СтрокаДерева.ПолучитьРодителя(), СтрокаДерева.Родитель);
			//Если СтрокаРодитель <> Неопределено И Не ЗначениеЗаполнено(СтрокаДерева.ЭтапРодитель) Тогда
			//	СтрокаДерева.ЭтапРодитель = СтрокаРодитель.Этап;
			//КонецЕсли;
			Если СтрокаРодитель  = Неопределено Тогда
				СтрокаДерева.ЭтапРодитель = ПредопределенноеЗначение("Справочник.упоЭтапыДоговоров.ПустаяСсылка");
			Иначе
				СтрокаДерева.ЭтапРодитель = СтрокаРодитель.Этап;
			КонецЕсли;
		КонецЕсли;
			
		Если СтрокаДерева.ТипЭлемента = 0 ИЛИ СтрокаДерева.ТипЭлемента = 1 ИЛИ СтрокаДерева.ТипЭлемента = 2 Тогда
			Таблица = Объект.Этапы;
			СтрокаТЧ = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаДерева);
			Если СоздаватьИзменятьЭтапы Тогда
				СтрокаТЧ.ПредставлениеЭтапа = "";
			КонецЕсли;		
			
		ИначеЕсли СтрокаДерева.ТипЭлемента = 3 ИЛИ СтрокаДерева.ТипЭлемента = 4 Тогда
	        Таблица = Объект.ГрафикНачислений;
			СтрокаТЧ = Таблица.Добавить();
			СтрокаТЧ.Этап = СтрокаДерева.ЭтапРодитель;
			СтрокаТЧ.Статья = СтрокаДерева.Статья;
			СтрокаТЧ.ВидДвижения = СтрокаДерева.ВидДвижения;
			СтрокаТЧ.СхемаОплаты = СтрокаДерева.СхемаОплаты;
			СтрокаТЧ.Сумма = СтрокаДерева.СуммаБДР;
			СтрокаТЧ.ДатаНачисления = СтрокаДерева.ДатаНачисленияОплаты;
			СтрокаТЧ.Примечание = СтрокаДерева.Примечание;
			СтрокаТЧ.ИндексСвязиЭтапа = СтрокаДерева.ИндексСвязиЭтапа;
			
		ИначеЕсли СтрокаДерева.ТипЭлемента = 5 ИЛИ СтрокаДерева.ТипЭлемента = 6 Тогда
			СтрокаРодитель = ?(ЭтоДанныеФормы, СтрокаДерева.ПолучитьРодителя(), СтрокаДерева.Родитель);			
	        Таблица = Объект.ГрафикОплаты;
			СтрокаТЧ = Таблица.Добавить();			
			Если СтрокаРодитель = Неопределено Тогда
				СтрокаТЧ.СтатьяБДР = СтрокаДерева.ЭтапРодитель;
			ИначеЕсли СтрокаРодитель.ТипЭлемента = 3 ИЛИ СтрокаРодитель.ТипЭлемента = 4 Тогда
				СтрокаТЧ.Этап = СтрокаРодитель.ЭтапРодитель;
				СтрокаТЧ.СтатьяБДР = СтрокаДерева.ЭтапРодитель;
				СтрокаТЧ.СхемаОплаты = СтрокаРодитель.СхемаОплаты;
			Иначе
				СтрокаТЧ.Этап = СтрокаРодитель.Этап;
            КонецЕсли;
			СтрокаТЧ.Статья = СтрокаДерева.Статья;
			СтрокаТЧ.ВидДвижения = СтрокаДерева.ВидДвижения;
			СтрокаТЧ.Сумма = СтрокаДерева.СуммаБДДС;
			СтрокаТЧ.ДатаОплаты = СтрокаДерева.ДатаНачисленияОплаты;
			СтрокаТЧ.Примечание = СтрокаДерева.Примечание;
			СтрокаТЧ.ВидПривязки = СтрокаДерева.ВидПривязки;
			СтрокаТЧ.Задержка = СтрокаДерева.Задержка;
			СтрокаТЧ.ИндексСвязиЭтапа = СтрокаДерева.ИндексСвязиЭтапа;
			
		КонецЕсли;

		СохранитьДеревоВТаблицу(СтрокаДерева, Объект, , Ложь, КолонкиДляСверки, СтруктураДляНовыхЭтапов);
	КонецЦикла;
	
	Если СоздаватьИзменятьЭтапы И ТипЗначения = Тип("ДанныеФормыДерево") Тогда
		// Кеширование
		мЗадачи = Новый Массив;
		Для Каждого СвязьЭтаповДоговора Из Объект.СвязиЭтаповДоговораСПроектнымКонтуром Цикл
			мЗадачи.Добавить(СвязьЭтаповДоговора.ПроектнаяЗадача);
		КонецЦикла;
		НазванияПроектныхЗадач = упоПроектыИЗадачиВызовСервера.НазванияПроектныхЗадач(мЗадачи);
		//
		Для Каждого СвязьЭтаповДоговора Из Объект.СвязиЭтаповДоговораСПроектнымКонтуром Цикл
			
			Если Не ЗначениеЗаполнено(СвязьЭтаповДоговора.ЭтапДоговора) Тогда
				Отбор = Новый Структура("ИндексСвязиЭтапа", СвязьЭтаповДоговора.ИндексСвязиЭтапа);
				НайденныеСтроки = Объект.Этапы.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() Тогда
					СвязьЭтаповДоговора.ЭтапДоговора = НайденныеСтроки[0].Этап;
				ИначеЕсли ЗначениеЗаполнено(СвязьЭтаповДоговора.ПроектнаяЗадача) Тогда
					
					СтруктураДляНовыхЭтапов.Наименование = НазванияПроектныхЗадач[СвязьЭтаповДоговора.ПроектнаяЗадача];
					СтруктураДляНовыхЭтапов.ПолноеНаименование = СтруктураДляНовыхЭтапов.Наименование;

					СвязьЭтаповДоговора.ЭтапДоговора = упоУправлениеДоговорамиСервер.СоздатьЭтапДоговора(СтруктураДляНовыхЭтапов);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

// Пересчитывает данные в потомках ветки дерева.
//
// Параметры:
//  Дерево				 - ДеревоЗначений, ДанныеФормыДерево, СтрокаДереваЗначений, ДанныеФормыЭлементДерева - пересчитываемые потомки
//   ветки или дерева.
//  ДатаОкончанияНовая	 - Дата	 - новая дата окончания этапа.
//
Процедура ПересчитатьДатаНачисленияОплаты(Дерево, ДатаОкончанияНовая = Неопределено) Экспорт
	
	ТипЗначения = ТипЗнч(Дерево);
	
	Если ТипЗначения = Тип("ДанныеФормыЭлементДерева") 
		Или ТипЗначения = Тип("ДанныеФормыДерево")
		Или ТипЗначения = Тип("ДанныеФормыКоллекцияЭлементовДерева") Тогда
		СтрокиДерева = Дерево.ПолучитьЭлементы();
	Иначе
		СтрокиДерева = Дерево.Строки;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если ДатаОкончанияНовая <> Неопределено Тогда
			Если СтрокаДерева.ТипЭлемента = 3 ИЛИ СтрокаДерева.ТипЭлемента = 4 Тогда
				СтрокаДерева.ДатаНачисленияОплаты = ДатаОкончанияНовая;
			КонецЕсли;
		КонецЕсли;
		
		ПересчитатьДатаНачисленияОплаты(СтрокаДерева, СтрокаДерева.ДатаОкончания);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует наименование договора.
//
// Параметры:
//  Объект	 - Произвольный - объект-ссылка.
//  Порядок	 - Произвольный - коллекция элементов.
//
// Возвращаемое значение:
//	Строка - наименование.
//
Функция СформироватьНаименованияДоговора(Объект, Порядок) Экспорт
	
	ЧастиНаименования = Новый Массив;
	Разделитель = " ";
	
	Если Порядок <> Неопределено Тогда
		
		Для Каждого Элемент Из Порядок Цикл
			Для Каждого ЭлементыСтруктуры Из Элемент Цикл
				Если ЭлементыСтруктуры.Ключ = Тип("Строка") Тогда 
					ЧастиНаименования.Добавить(ЭлементыСтруктуры.Значение);
				ИначеЕсли ЭлементыСтруктуры.Значение = "Дата" Тогда 
					ЧастиНаименования.Добавить(Формат(Объект[ЭлементыСтруктуры.Значение], "ДФ=dd.MM.yyyy"));
				Иначе
					ЧастиНаименования.Добавить(СокрЛП(Объект[ЭлементыСтруктуры.Значение]));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		ЧастиНаименования.Добавить(НСтр("ru = 'Договор'"));
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиНаименования, Разделитель);
	
КонецФункции

// Заполняет вид движения статьи.
//
// Параметры:
//	Строка - СтрокаДереваЗначений, ДанныеФормыЭлементДерева .
Процедура ЗаполнитьВидДвиженияПоСтатье(Строка) Экспорт
	
	Если ТипЗнч(Строка.Статья) = Тип("СправочникСсылка.упоСтатьиДоходов") Тогда     				
		Строка.ВидДвижения = ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход");
	ИначеЕсли ТипЗнч(Строка.Статья) = Тип("СправочникСсылка.упоСтатьиЗатрат") Тогда
		Строка.ВидДвижения = ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход");
	ИначеЕсли ТипЗнч(Строка.Статья) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда
		Строка.ВидДвижения = упоФункцииБСП.ПолучитьЗначениеРеквизита(Строка.Статья,"упоНаправлениеДвижения");
	КонецЕсли; 
	
КонецПроцедуры

// Возвращает имя реквизита валюты договора контрагента.
// 
// Возвращаемое значение:
//  СправочникСсылка.Валюты - валюта.
//
Функция ИмяРеквизитаВалютыДоговора() Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПО() 
		Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2()
		Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		имяРеквизитаВалютыДоговора = "ВалютаВзаиморасчетов";
	ИначеЕсли упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		имяРеквизитаВалютыДоговора = "ВалютаРасчетов";
	Иначе
		имяРеквизитаВалютыДоговора = "Валюта";	
	КонецЕсли;
	
	Возврат имяРеквизитаВалютыДоговора;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Пересчитывает данные в ветке дерева.
//
// Параметры:
//  Дерево			 - ДеревоЗначений, ДанныеФормыДерево, СтрокаДереваЗначений, ДанныеФормыЭлементДерева - пересчитываемая
//  ветка или дерево.
//  СуммаДерева		 - Число
//  СуммаБДР		 - Число
//  СуммаБДДС		 - Число
//  ДатаНачала		 - Дата
//  ДатаОкончания	 - Дата
//  ТипРодителя		 - Число
//  РодительУдален	 - Булево
// 
// Возвращаемое значение:
//  Структура - данные ветки:
//  * СуммаДерева - Число - сумма дерева.
//  * ДатаНачала - Дата - дата начала.
//  * ДатаОкончания - Дата - дата окончания.
//
Функция ПересчитатьВетвьДрева(Дерево, СуммаБДР = 0, СуммаБДДС = 0, ДатаНачала = '00010101', ДатаОкончания = '00010101', ТипРодителя = 0, РодительУдален = Ложь) Экспорт
	
	ТипЗначения = ТипЗнч(Дерево);	
	Для Каждого СтрокаДерева Из Дерево Цикл
		
		Если ТипЗначения = Тип("ДанныеФормыЭлементДерева") 
			Или ТипЗначения = Тип("ДанныеФормыДерево")
			Или ТипЗначения = Тип("ДанныеФормыКоллекцияЭлементовДерева") Тогда
			СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
		Иначе
			СтрокиДерева = СтрокаДерева.Строки;
		КонецЕсли;

		Если СтрокиДерева.Количество() Тогда 
			Структура = ПересчитатьВетвьДрева(СтрокиДерева, , , , , СтрокаДерева.ТипЭлемента, СтрокаДерева.УдаленныйЭтапВКалендарномПлане);
			Если СтрокаДерева.ТипЭлемента = 3 ИЛИ СтрокаДерева.ТипЭлемента = 4 Тогда
				СтрокаДерева.Сумма = СтрокаДерева.СуммаБДР;
				СтрокаДерева.СуммаБДР = СтрокаДерева.СуммаБДР;
			Иначе	
				СтрокаДерева.Сумма = Структура.СуммаБДР;
				СтрокаДерева.СуммаБДР = Структура.СуммаБДР;
				
			КонецЕсли;
			СтрокаДерева.СуммаБДДС = Структура.СуммаБДДС;
			
			Если ЗначениеЗаполнено(Структура.ДатаОкончания) Тогда
				СтрокаДерева.ДатаОкончания = Структура.ДатаОкончания;
			КонецЕсли;
			Если ЗначениеЗаполнено(Структура.ДатаНачала) Тогда
				СтрокаДерева.ДатаНачала = Структура.ДатаНачала;
			КонецЕсли;	
		КонецЕсли;
		
		Если СтрокаДерева.УдаленныйЭтапВКалендарномПлане И СтрокаДерева.ТипЭлемента < 3 И СтрокаДерева.СуммаБДР = 0 И СтрокаДерева.Сумма <> 0 Тогда
			СтрокаДерева.СуммаБДР = СтрокаДерева.Сумма;
		КонецЕсли;
		
		Если РодительУдален <> СтрокаДерева.УдаленныйЭтапВКалендарномПлане Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.ВидДвижения = ПредопределенноеЗначение("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход")
			ИЛИ СтрокаДерева.ВидДвижения = ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата") 
				И (ТипРодителя <> 3 И ТипРодителя <> 4) Тогда
			СуммаБДР = СуммаБДР - СтрокаДерева.СуммаБДР;
			СуммаБДДС = СуммаБДДС - СтрокаДерева.СуммаБДДС;
		Иначе
			СуммаБДР = СуммаБДР + СтрокаДерева.СуммаБДР;
			СуммаБДДС = СуммаБДДС + СтрокаДерева.СуммаБДДС;
		КонецЕсли;
		
		ДатаОкончания = Макс(ДатаОкончания, СтрокаДерева.ДатаОкончания);
		
		Если ЗначениеЗаполнено(СтрокаДерева.ДатаНачала) Тогда 
			Если ЗначениеЗаполнено(ДатаНачала) Тогда 
				ДатаНачала = Мин(ДатаНачала, СтрокаДерева.ДатаНачала); 
			Иначе
				ДатаНачала = СтрокаДерева.ДатаНачала;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("СуммаБДР, СуммаБДДС, ДатаНачала, ДатаОкончания",
							 СуммаБДР, СуммаБДДС, ДатаНачала, ДатаОкончания);
	
КонецФункции

#КонецОбласти