

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗаполнитьТаблицуНачислений();
    
    УстановитьОтборИспользуемых(Элементы.Таблица, ПоказыватьНачисленияВАрхиве);
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоказыватьНачисленияВАрхивеПриИзменении(Элемент)
    УстановитьОтборИспользуемых(Элементы.Таблица, ПоказыватьНачисленияВАрхиве);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицы

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    ТекущиеДанные = Элементы.Таблица.ТекущиеДанные;
    	
    Если ТекущиеДанные = Неопределено Тогда 
    	Возврат;
    КонецЕсли; 
    
    ОповеститьОВыборе(ТекущиеДанные.Ссылка);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуНачислений()
    
    Запрос = Новый Запрос;    
    Запрос.Текст = ПолучитьТекстЗапросТаблицы();
    
    РезультатЗапроса = Запрос.Выполнить();
    Таблица.Загрузить( РезультатЗапроса.Выгрузить() );
    
КонецПроцедуры // ЗаполнитьТаблицуНачислений()

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросТаблицы()
    
    Возврат 
    "ВЫБРАТЬ
    |   Начисления.Код КАК Код,
    |   Начисления.Наименование КАК Наименование,
    |   Начисления.Ссылка КАК Ссылка,
    |   Начисления.ПометкаУдаления КАК ПометкаУдаления,
    |	Начисления.КраткоеНаименование КАК КраткоеНаименование,
    |	Начисления.Описание КАК Описание, 
    |	Начисления.ВАрхиве КАК ВАрхиве
    |ИЗ
    |   ПланВидовРасчета.Начисления КАК Начисления";
    
    //|ГДЕ 
    //|   НЕ Начисления.ВАрхиве
    //|";
    
КонецФункции // ПолучитьТекстЗапросТаблицы()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборИспользуемых(ТаблицаФормы, ПоказыватьВАрхиве)
    
    ТаблицаФормы.ОтборСтрок = Неопределено;
        
    Если НЕ ПоказыватьВАрхиве Тогда
        Отбор = Новый Структура("ВАрхиве", ПоказыватьВАрхиве);               
        ТаблицаФормы.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);        
    КонецЕсли;  
    
    //ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ГруппаОтбора, "ВАрхиве");
    //Если НЕ ПоказыватьВАрхиве Тогда
    //	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ВАрхиве", Ложь);
    //КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

