////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с формами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет соответствие контрагента и договора в строке табличной части.
//
// Параметры:
//  Форма			 - Форма, УправляемаяФорма 	- форма, содержащая ТабличнаяЧасть.
//  ТабличнаяЧасть	 - Произвольный				- элемент формы Табличная часть, в которой нужно проверить соответствие
//						договора контрагенту из шапки.
//  ИмяПоляКонтрагент- Строка - Имя колонки, в которой содержится контрагент.
//  ИмяПоляДоговор	 - Строка - Имя колонки, в которой содержится Договор контрагента.
//
Процедура ПроверитьДоговор(Форма, ТабличнаяЧасть, ИмяПоляКонтрагент = "Контрагент", ИмяПоляДоговор = "Договор") Экспорт
	
	ТекДанные = Форма.Элементы[ТабличнаяЧасть].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИсполнительКонтрагент = ТипЗНЧ(ТекДанные[ИмяПоляКонтрагент]) = Тип("СправочникСсылка.Контрагенты");
	Если ТекДанные.Свойство("ИсполнительКонтрагент") Тогда
		ТекДанные.ИсполнительКонтрагент = ИсполнительКонтрагент;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные[ИмяПоляКонтрагент]) ИЛИ НЕ ИсполнительКонтрагент Тогда
		ТекДанные[ИмяПоляДоговор] = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	ИначеЕсли упоРаботаСФормамиСервер.служ_ПроверитьДоговор(ТекДанные[ИмяПоляДоговор], ТекДанные[ИмяПоляКонтрагент]) Тогда
		ПриИзмененииДоговора(Форма, ТабличнаяЧасть,,ИмяПоляКонтрагент, ИмяПоляДоговор);
	КонецЕсли; 
	
КонецПроцедуры 
 
// Устанавливает валюту в строке табличной части.
//
// Параметры:
//  Форма				 - Форма, УправляемаяФорма											 - форма, на которую выведена табличная часть.
//  имяТаблицы			 - Строка															 - имя табличной части на форме.
//  строкаТЧ			 - ДанныеФормыСтруктура, ДанныеФормыЭлементКоллекции, ДанныеФормыЭлементДерева	 - строка,
//  	в которой надо установить валюту. Необязательный параметр. Берет текущие данные табличной
//  	части, если неопределено.
//  ИмяПоляКонтрагент	 - Строка
//  ИмяПоляДоговор		 - Строка
//
Процедура ПриИзмененииДоговора(Форма, имяТаблицы, строкаТЧ = Неопределено, ИмяПоляКонтрагент = "Контрагент",
	ИмяПоляДоговор = "Договор") Экспорт
	
	Если строкаТЧ = Неопределено Тогда
		Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
			текСтрока = Форма.Элементы[имяТаблицы].ТекущиеДанные;
		Иначе
			текСтрока = Форма.ЭлементыФормы[имяТаблицы].ТекущиеДанные;
		КонецЕсли;
	Иначе
		текСтрока = строкаТЧ;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат; // Возврат
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(текСтрока[ИмяПоляДоговор]) Тогда  
		Возврат; // Возврат
	КонецЕсли;
	
	ВалютаДоговора = упоРаботаСФормамиСервер.ВернутьВалютуДоговора(текСтрока[ИмяПоляДоговор]);  
	
	Контекст = Новый Структура();
	Контекст.Вставить("текСтрока",текСтрока);
	Контекст.Вставить("ВалютаДоговора",ВалютаДоговора);
	
	Если Не текСтрока.Свойство("Валюта") Тогда
		Возврат; // Возврат
	КонецЕсли;
		
	Если ВалютаДоговора = текСтрока.Валюта Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	Если ((имяТаблицы = "ПланДоходов" 
		ИЛИ имяТаблицы = "ПланРасходов" 
		ИЛИ имяТаблицы = "Субпродукты"
		ИЛИ имяТаблицы = "МатериальныеРесурсы") 
		И НЕ ЗначениеЗаполнено(текСтрока.Валюта)) Тогда
		
		Ответ = КодВозвратаДиалога.Да;
		
	ИначеЕсли ЗначениеЗаполнено(текСтрока.Валюта) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДоговораЗавершение",ЭтотОбъект,Контекст);
		ПоказатьВопрос(ОписаниеОповещения, 
			НСтр("ru = 'Валюта договора не соответствует валюте в строке. Изменить валюту строки?'"), РежимДиалогаВопрос.ДаНет);
		Возврат; // Возврат
		
	Иначе
		
		Ответ = КодВозвратаДиалога.Да;
		
	КонецЕсли;
	
	ПриИзмененииДоговораЗавершение(Ответ, Контекст);
	
КонецПроцедуры

// Обработчик завершения процеудры "При изменении договора".
//
// Параметры:
//  Ответ					 - КодВозвратаДиалога	 - ответ.
//  ДополнительныеПараметры	 - Структура			 - параметры.
//
Процедура ПриИзмененииДоговораЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДополнительныеПараметры.текСтрока.Валюта = ДополнительныеПараметры.ВалютаДоговора;
	КонецЕсли;
	
КонецПроцедуры

// Открывает отчет проекта по служебной команде.
//
// Параметры:
//  Этаформа				 - Форма, УправляемаяФорма	 - форма-владелец.
//  Команда					 - КомандаФормы				 - текущая команда.
//  ПрефиксКоманды			 - Строка					 - необязательный параметр. Удаляется из имени команды для
//  					получения наименования отчета.
//  Проект					 - 							 - Массив, СправочникСсылка.Проекты, ДокументСсылка.упоПроектнаяЗадача
//  							- массив проектов или проект, который передается в открываемую форму отчета.
//  ЭтоЭтап					 - Булево
//  ОтключитьОтборПоПроекту	 - Булево
//  ИерархическийОтбор		 - Структура, Неопределено
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ОткрытьОтчетПроектаПоСлужебнойКоманде(Этаформа, Команда, ПрефиксКоманды = "КомандаДляПроекта", Проект, 
											  ЭтоЭтап = Ложь, ОтключитьОтборПоПроекту = Ложь, ИерархическийОтбор = Неопределено) Экспорт
	
	ИмяОтчета = СтрЗаменить(Команда.Имя, ПрефиксКоманды, "");
	
	ПрефиксВарианта = "Вариант__";
	УказанВариант = Ложь;
	
	Если СтрНачинаетсяС(ИмяОтчета, ПрефиксВарианта) Тогда
		
		УказанВариант = Истина;
		
		ИмяОтчетаБезПрефикса = СтрЗаменить(ИмяОтчета, ПрефиксВарианта, "");
		
		ПозицияРазделителя = СтрНайти(ИмяОтчетаБезПрефикса, "__");
		
		КлючВарианта = Лев(ИмяОтчетаБезПрефикса, ПозицияРазделителя - 1);
		ИмяОтчета = Прав(ИмяОтчетаБезПрефикса, СтрДлина(ИмяОтчетаБезПрефикса) - ПозицияРазделителя - 1);
		
	КонецЕсли; 
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПараметрыОтчета", Новый Структура);
	ПараметрыОткрытия.Вставить(?(ЭтоЭтап, "Этап", "Проект"), Проект);
	ПараметрыОткрытия.Вставить("ОткрытПоСлужебнойКоманде", Истина);
	
	Если ИерархическийОтбор <> Неопределено Тогда
		ПараметрыОткрытия.Вставить("ИерархическийОтбор", ИерархическийОтбор);	
	КонецЕсли;
	
	Если ОтключитьОтборПоПроекту Тогда 
		ПараметрыОткрытия.Вставить("ОтключитьОтборПоПроекту", Истина);		
	КонецЕсли;
	
	Если УказанВариант Тогда
		
		ВариантСсылка = упоФункцииБСП.ВариантОтчетаПоИмениОтчетаКлючуВарианта(ИмяОтчета, КлючВарианта);
		
		Если ВариантСсылка = Неопределено Тогда
			Возврат Неопределено;			
		КонецЕсли;
		
		ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Неопределено, ВариантСсылка, ПараметрыОткрытия);
		
	Иначе 
		
		ПараметрыОткрытия.Вставить("КлючВарианта", "Основной");
		ОткрытьФорму("Отчет."+ ИмяОтчета + ".ФормаОбъекта", ПараметрыОткрытия, Этаформа);
		
	КонецЕсли;	
	
КонецФункции

// Рассчитывет общую стоимость в строке табличной части.
//
// Параметры:
//  СтрокаТабличнойЧасти												 - ДанныеФормыЭлементКоллекции, ДанныеФормыЭлементДерева, Структура	 - данные строки табличной части.
//  ИмяКолонкиКоличество												 - Строка															 - имя колонки с количеством.
//  ИмяКолонкиСтоимость													 - Строка															 - имя колонки со стоимостью.
//  ИмяКолонкиОбщСтоимость												 - Строка															 - имя колонки с общей стоимостью.
//  УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатратПроекта	 - Булево
//
Процедура ПриИзмененииКоличестваТабЧасти(СтрокаТабличнойЧасти,
										 ИмяКолонкиКоличество = "Количество",
										 ИмяКолонкиСтоимость = "Стоимость",
										 ИмяКолонкиОбщСтоимость = "ОбщСтоимость",
										 УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатратПроекта = Ложь) Экспорт

	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатратПроекта Тогда
		СтрокаТабличнойЧасти[ИмяКолонкиСтоимость] = 0;		
	КонецЕсли;
	
	Количество = СтрокаТабличнойЧасти[ИмяКолонкиКоличество];
	Стоимость  = СтрокаТабличнойЧасти[ИмяКолонкиСтоимость];
	 
	СтрокаТабличнойЧасти[ИмяКолонкиОбщСтоимость] = Количество * Стоимость;
		 
КонецПроцедуры

// Процедура служит для заполнения значения в определенной колонке Табличной части.
//  Подходит для примитивных типов, перечислений. Можно использовать составные типы.
//
// Параметры:
//  Объект					 - ДанныеФормыСтруктура	 - содержит Таблицу с именем ИмяТЧ.
//  ИмяТЧ					 - Строка				 - имя Таблицы объекта.
//  ИмяКолонкиТЧ			 - Строка				 - имя колонки таблицы.
//  ТипыЗначений			 - ОписаниеТипов		 - квалификатор типов содержит доступные типы значений колонки ИмяКолонкиТЧ.
//  ДозаполнитьДоговор		 - Булево				 - признак необходимости заполнять договор.
//  ИмяКолонкиДоговор		 - Строка
//  ТолькоВыделенные		 - Булево				 - признак того, что надо обрабатывать только выделенные.
//  ЗначениеПоУмолчанию		 - Произвольный			 - значение по умолчанию в в колонке.
//  ОбработкаОповещения		 - ОбработкаОповещения
//  ИмяКолонкиДляПроверки	 - Строка
// 
// Возвращаемое значение:
//  Произвольный - введенное значение.
//
Функция ЗаполнитьЗначениеВТЧ(Объект,
							 ИмяТЧ,
							 ИмяКолонкиТЧ,
							 ТипыЗначений,
							 ДозаполнитьДоговор = Ложь,
							 ИмяКолонкиДоговор = "Договор",
							 ТолькоВыделенные = Ложь,
							 ЗначениеПоУмолчанию = Неопределено,
							 ОбработкаОповещения = Неопределено,
							 ИмяКолонкиДляПроверки = "") Экспорт
	
	ВведенноеЗначение = ЗначениеПоУмолчанию;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Объект", Объект);
	Контекст.Вставить("ИмяТЧ", ИмяТЧ);
	Контекст.Вставить("ИмяКолонкиТЧ", ИмяКолонкиТЧ);
	Контекст.Вставить("ТипыЗначений", ТипыЗначений);
	Контекст.Вставить("ДозаполнитьДоговор", ДозаполнитьДоговор);
	Контекст.Вставить("ИмяКолонкиДоговор", ИмяКолонкиДоговор);
	Контекст.Вставить("ЗначениеПоУмолчанию", ЗначениеПоУмолчанию);
	Контекст.Вставить("ТолькоВыделенные", ТолькоВыделенные);
	Контекст.Вставить("СледующееОповещение", ОбработкаОповещения);
	Контекст.Вставить("ВыбранныйДоговор", Неопределено);
	Контекст.Вставить("ИмяКолонкиДляПроверки", ИмяКолонкиДляПроверки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЗначениеВТЧЗавершение", ЭтотОбъект, Контекст);
	
	Заголовок = НСтр("ru = 'Выберите значение'");
	
	Если ТипЗнч(ТипыЗначений) = Тип("ОписаниеТипов") Тогда
		
		ВведенноеЗначение = 0; 
		ПоказатьВводЗначения(ОписаниеОповещения,ВведенноеЗначение, Заголовок, ТипыЗначений);
		
	ИначеЕсли ТипЗнч(ТипыЗначений) = Тип("КвалификаторыЧисла") Тогда
		
		ПоказатьВводЧисла(ОписаниеОповещения,ВведенноеЗначение, Заголовок, ТипыЗначений.Разрядность,
			ТипыЗначений.РазрядностьДробнойЧасти);
		
	ИначеЕсли ТипЗнч(ТипыЗначений) = Тип("КвалификаторыДаты") Тогда
		
		ВведенноеЗначение = Дата(1, 1, 1);
		ПоказатьВводДаты(ОписаниеОповещения,ВведенноеЗначение, Заголовок, ТипыЗначений.ЧастиДаты );	
		
	ИначеЕсли ТипЗнч(ТипыЗначений) = Тип("КвалификаторыСтроки") Тогда
		
		ВведенноеЗначение = ""; 
		ПоказатьВводСтроки(ОписаниеОповещения,ВведенноеЗначение, Заголовок, ТипыЗначений.Длина);
		
	КонецЕсли;
		
	Возврат ВведенноеЗначение;
	
КонецФункции

// Обработчик завершения "Заполнить значение" в ТЧ.
//
// Параметры:
//  ВведенноеЗначение		 - Произвольный	 - введенное значение.
//  ДополнительныеПараметры	 - Структура	 - параметры.
//
Процедура ЗаполнитьЗначениеВТЧЗавершение(ВведенноеЗначение, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Вставить("ВведенноеЗначение", ВведенноеЗначение);
	ВыбранныйДоговор = ДополнительныеПараметры.ВыбранныйДоговор;
	
	Если НЕ ДополнительныеПараметры.ТолькоВыделенные Тогда
		
		Если ВведенноеЗначение <> Неопределено Тогда
			
			Если ДополнительныеПараметры.ДозаполнитьДоговор Тогда
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЗначениеВТЧЗавершение2", ЭтотОбъект, ДополнительныеПараметры);
				
				ПараметрыФормы = Новый Структура;
				
				ОтборПоВладельцу = Новый Структура;
				ИмяРеквизитаДляУстановкиОтбораПоВладельцу = ПолучитьИмяРеквизитаДляОтбора();
				ОтборПоВладельцу.Вставить(ИмяРеквизитаДляУстановкиОтбораПоВладельцу, ВведенноеЗначение);
				
				ПараметрыФормы.Вставить("Отбор", ОтборПоВладельцу);
				Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
					// В УНФ в качестве формы выбора справочника ДоговорыКонтрагентов используется форма списка, 
					// поэтому для возможности выбрать элемент в форме списка необходимо установить "РежимВыбора" в "Истина".
					ПараметрыФормы.Вставить("РежимВыбора", Истина);
				КонецЕсли;
				
				ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещения);
				Возврат;
				
			КонецЕсли;
			
			ЗаполнитьЗначениеВТЧЗавершение2(ВыбранныйДоговор, ДополнительныеПараметры);
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.СледующееОповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.СледующееОповещение, ВведенноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения "Заполнить значение" в ТЧ.
//
// Параметры:
//  ВведенноеЗначение		 - Произвольный	 - введенное значение.
//  ДополнительныеПараметры	 - Структура	 - параметры.
//
Процедура ЗаполнитьЗначениеВТЧЗавершение2(ВведенноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВведенноеЗначение = Неопределено Тогда
		ВведенноеЗначение = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	ДополнительныеПараметры.ВыбранныйДоговор = ВведенноеЗначение;
	
	ЗаменятьТекущие = Неопределено;
	
	Для Каждого СтрокаДанных Из ДополнительныеПараметры.Объект[ДополнительныеПараметры.ИмяТЧ] Цикл
		
		Если НЕ СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ] = ДополнительныеПараметры.ВведенноеЗначение 
			И ((ЗначениеЗаполнено(СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ]) И ДополнительныеПараметры.ЗначениеПоУмолчанию = Неопределено)
			ИЛИ (НЕ ДополнительныеПараметры.ЗначениеПоУмолчанию = Неопределено И НЕ СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ] = ДополнительныеПараметры.ЗначениеПоУмолчанию)) Тогда
			
			    ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЗначениеВТЧЗавершение3",ЭтотОбъект,ДополнительныеПараметры);
				
				ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Заменить установленные значения на
					|""%1""?'"), ДополнительныеПараметры.ВведенноеЗначение); 							
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 360, КодВозвратаДиалога.Да);
					
			 Возврат;
						
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьЗначениеВТЧЗавершение3(Неопределено, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработчик завершения "Заполнить значение" в ТЧ.
//
// Параметры:
//  Ответ					 - 			 - КодВозвратаДиалога
//  ДополнительныеПараметры	 - Структура - параметры.
//
Процедура ЗаполнитьЗначениеВТЧЗавершение3(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда      
		ЗаменятьТекущие = Истина;
	Иначе
		ЗаменятьТекущие = Ложь;
	КонецЕсли;
	
	ЕстьДопПолеДляПроверки = ЗначениеЗаполнено(ДополнительныеПараметры.ИмяКолонкиДляПроверки);
	
	Для Каждого СтрокаДанных Из ДополнительныеПараметры.Объект[ДополнительныеПараметры.ИмяТЧ] Цикл
								
		Если ПропуститьЗаполнениеЗначенияВСтроке(СтрокаДанных, ДополнительныеПараметры) Тогда 
			Продолжить;
		КонецЕсли; 	
		
		Если НЕ СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ] = ДополнительныеПараметры.ВведенноеЗначение 
			И ((ЗначениеЗаполнено(СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ]) И ДополнительныеПараметры.ЗначениеПоУмолчанию = Неопределено)
			ИЛИ (НЕ ДополнительныеПараметры.ЗначениеПоУмолчанию = Неопределено И НЕ СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ] = ДополнительныеПараметры.ЗначениеПоУмолчанию)) Тогда
			
			Если ЗаменятьТекущие Тогда      
				Если (Не ЕстьДопПолеДляПроверки) 
					Или (ЕстьДопПолеДляПроверки И Не СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиДляПроверки]) Тогда				
					СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ] = ДополнительныеПараметры.ВведенноеЗначение;				
				КонецЕсли;
				Если ДополнительныеПараметры.ДозаполнитьДоговор Тогда					
					СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиДоговор] = ДополнительныеПараметры.ВыбранныйДоговор;	
				КонецЕсли;
			КонецЕсли; 
			
		Иначе
			
			Если (Не ЕстьДопПолеДляПроверки) 
				Или (ЕстьДопПолеДляПроверки И Не СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиДляПроверки]) Тогда				
				СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ] = ДополнительныеПараметры.ВведенноеЗначение;				
			КонецЕсли;
			Если ДополнительныеПараметры.ДозаполнитьДоговор Тогда					
				СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиДоговор] = ДополнительныеПараметры.ВыбранныйДоговор;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.СледующееОповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.СледующееОповещение, ДополнительныеПараметры.ВведенноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

// Высчитывает стоимость в строке табличной части.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, ДанныеФормыЭлементДерева, Структура - 
//							данные строки табличной части.
//  КолонкаЧастное		 - Строка - имя колонки.
//  КолонкаДелимое		 - Строка - имя колонки.
//  КолонкаДелитель		 - Строка - имя колонки.
//
Процедура ПриИзмененииОбщейСтоимостиТабЧасти(СтрокаТабличнойЧасти,
											 КолонкаЧастное = "Стоимость",
											 КолонкаДелимое = "ОбщСтоимость",
											 КолонкаДелитель = "Количество") Экспорт
											 
	Если НЕ СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти[КолонкаЧастное] = СтрокаТабличнойЧасти[КолонкаДелимое] 
			/ ?(СтрокаТабличнойЧасти[КолонкаДелитель] = 0, 1, СтрокаТабличнойЧасти[КолонкаДелитель]);
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывает диалог редактирования стандартного периода и устанавливает параметры НачалоПериода и
//  КонецПериода динамического списка.
//
// Параметры:
//  Таблица	 - ДинамическийСписок	 - список, для которого устанавливается период.
//  Форма	 - Форма, УправляемаяФорма
//
Процедура УстановитьПериодВТаблице(Таблица, Форма = Неопределено) Экспорт
	
	ПараметрыТаблицы = Таблица.Параметры;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	ПараметрДатаНачала = ПараметрыТаблицы.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если ПараметрДатаНачала <> Неопределено Тогда
		Диалог.Период.ДатаНачала = ПараметрДатаНачала.Значение;
	КонецЕсли;
	ПараметрДатаОкончания = ПараметрыТаблицы.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если ПараметрДатаОкончания <> Неопределено Тогда
		Диалог.Период.ДатаОкончания = ПараметрДатаОкончания.Значение;
	КонецЕсли;  
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Таблица",Таблица);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПериодВТаблицеЗавершение", 
		ЭтотОбъект, 
		ДополнительныеПараметры);
	Диалог.Показать(ОписаниеОповещения);
			
КонецПроцедуры

// Обработчик завершения процедуры "Установить период в таблице".
//
// Параметры:
//  Период					 - Период	 - период.
//  ДополнительныеПараметры	 - Структура - параметры.
//
Процедура УстановитьПериодВТаблицеЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТаблицы = ДополнительныеПараметры.Таблица.Параметры;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		ПараметрДатаНачала = ПараметрыТаблицы.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		Если ПараметрДатаНачала <> Неопределено Тогда
			ПараметрДатаНачала.Использование = Ложь;
		КонецЕсли;
	Иначе
		ПараметрыТаблицы.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		ПараметрДатаОкончания = ПараметрыТаблицы.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		Если ПараметрДатаОкончания <> Неопределено Тогда
			ПараметрДатаОкончания.Использование = Ложь;
		КонецЕсли;
	Иначе
		ПараметрыТаблицы.УстановитьЗначениеПараметра("КонецПериода", Период.ДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик команд "Заполнить по умолчанию" в таблицах распределения форм. Добавляет строку в подчиненную таблицу
//  и заполняет ее данными из строки таблицы-владельца.
//
// Параметры:
//  Объект								 - ДанныеФормыКоллекция, УправляемаяФорма	 - объект владелец данных заполнения.
//  Форма								 - УправляемаяФорма							 - форма владелец данных заполнения.
//  ИмяКоманды							 - Строка									 - имя команды вызова.
//  ДополнительныеПараметрыРаспределения - Структура								 - параметры обработки таблиц распределения.
// 
// Возвращаемое значение:
//  Структура
//
Функция КопироватьСтрокуВладельцаВРаспределение(Объект, Форма, ИмяКоманды, ДополнительныеПараметрыРаспределения) Экспорт
	
	Элементы = Форма.Элементы;	
	ПроверитьИнформационныеСтроки = Ложь;
	
	Если ИмяКоманды = "ЗаполнитьПоВладельцуПланДоходов" Тогда
		
		ТекущаяСтрокаВладельца = Элементы.ПланДоходов.ТекущиеДанные;
		
		ТаблицаВладелец = "ПланДоходов";
		ТаблицаПодчиненная = "РаспределениеДоходов";
		Если ДополнительныеПараметрыРаспределения.Свойство("ПланДоходовТаблицаРаспределения") Тогда
			ТаблицаПодчиненная = ДополнительныеПараметрыРаспределения.ПланДоходовТаблицаРаспределения;
		КонецЕсли;
		имяКолонкиСумма = "Сумма";
		КопироватьКоличество = Ложь;
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияДоходов";
		ПроверитьИнформационныеСтроки = Истина;
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьПоВладельцуПланРасходов" Тогда
		
		ТекущаяСтрокаВладельца = Элементы.ПланРасходов.ТекущиеДанные;
		
		ТаблицаВладелец = "ПланРасходов";
		ТаблицаПодчиненная = "РаспределениеРасходов";
		Если ДополнительныеПараметрыРаспределения.Свойство("ПланРасходовТаблицаРаспределения") Тогда
			ТаблицаПодчиненная = ДополнительныеПараметрыРаспределения.ПланРасходовТаблицаРаспределения;
		КонецЕсли;
		имяКолонкиСумма = "Сумма";
		КопироватьКоличество = Ложь;
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияРасходов";
		ПроверитьИнформационныеСтроки = Истина;
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьПоВладельцуПотребности" Тогда
		
		ТекущаяСтрокаВладельца = Элементы.МатериальныеРесурсы.ТекущиеДанные;
		
		ТаблицаВладелец = "МатериальныеРесурсы";
		ТаблицаПодчиненная = Неопределено;
		ДополнительныеПараметрыРаспределения.Свойство("МатериальныеРесурсыТаблицаРаспределения", ТаблицаПодчиненная);
		имяКолонкиСумма = "ОбщСтоимость";
		КопироватьКоличество = Истина;
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьПоВладельцуСубпродукты" Тогда
		
		ТекущаяСтрокаВладельца = Элементы.Субпродукты.ТекущиеДанные;
		
		ТаблицаВладелец = "Субпродукты";
		ТаблицаПодчиненная = Неопределено;
		ДополнительныеПараметрыРаспределения.Свойство("СубпродуктыТаблицаРаспределения", ТаблицаПодчиненная);
		имяКолонкиСумма = "ОбщСтоимость";
		КопироватьКоличество = Истина;
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьПоВладельцуДопЗатраты" Тогда
		
		ТекущаяСтрокаВладельца = Элементы.ДополнительныеЗатраты.ТекущиеДанные;
		
		ТаблицаВладелец = "ДополнительныеЗатраты";
		ТаблицаПодчиненная = "РаспределениеДополнительныхЗатрат";
		имяКолонкиСумма = "Стоимость";
		КопироватьКоличество = Ложь;
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";	
		 
	КонецЕсли;	
	
	ПараметрыКопирования = Новый Структура("ТаблицаВладелец, ТаблицаПодчиненная, КопироватьКоличество", 
		ТаблицаВладелец, ТаблицаПодчиненная, КопироватьКоличество);
					
	// Очистим подчиненные записи в подчиненной таблице и таблице распределения по периодам, если есть.
	Если НЕ ТекущаяСтрокаВладельца = Неопределено Тогда
				
		Если ПроверитьИнформационныеСтроки Тогда
		// Если строка - добавленная засеря, то Возврат.
		    Если ЭтоПеренесеннаяСтрокаОсновнойТаблицы(ТаблицаВладелец, ТекущаяСтрокаВладельца, Истина, Истина) Тогда
				Возврат ПараметрыКопирования;
			КонецЕсли;	
		КонецЕсли;		
		
		Если ДополнительныеПараметрыРаспределения.Свойство("ЕстьТаблицаРаспределенияПоПериодам") 
			И ДополнительныеПараметрыРаспределения.ЕстьТаблицаРаспределенияПоПериодам = Истина Тогда
			МожетБытьРаспределениеПоПериодам = (Объект[ТаблицаПодчиненная].Количество() > 0 
				И Объект[ТаблицаПодчиненная][0].Свойство("ИндексСтрокРаспределенияПоПериодам"));			
		Иначе	
			МожетБытьРаспределениеПоПериодам = Ложь;
		КонецЕсли;
			
		Если МожетБытьРаспределениеПоПериодам Тогда
			
			Если ТаблицаВладелец = "Субпродукты" Тогда
				
				ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
				ИмяТаблицыРаспределенияПоПериодам = "РаспределениеДоходовПоПериодам"; 
				
			ИначеЕсли ТаблицаВладелец = "ПланДоходов" Тогда
				
				ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияДоходов";
				ИмяТаблицыРаспределенияПоПериодам = "РаспределениеДоходовПоПериодам"; 
				
			ИначеЕсли ТаблицаВладелец = "МатериальныеРесурсы" Тогда
				
				ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
				ИмяТаблицыРаспределенияПоПериодам = "РаспределениеРасходовПоПериодам"; 
				
			ИначеЕсли ТаблицаВладелец = "ДополнительныеЗатраты" Тогда
				
				ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
				ИмяТаблицыРаспределенияПоПериодам = "РаспределениеРасходовПоПериодам";	
				
			ИначеЕсли ТаблицаВладелец = "ПланРасходов" Тогда
				
				ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияРасходов";
				ИмяТаблицыРаспределенияПоПериодам = "РаспределениеРасходовПоПериодам"; 							
				
			КонецЕсли;
			
		КонецЕсли;
				 
		 УдалитьРаспределенныеСтрокиВладельца(Объект, ТаблицаПодчиненная, ТекущаяСтрокаВладельца, 
		 		МожетБытьРаспределениеПоПериодам, ИмяТаблицыРаспределенияПоПериодам, ИмяКолонкиИндекса);
		
		// Удалили старые строки, теперь можно создать новую подчиненную строку копированием.
		упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределение(Форма, Объект, ТекущаяСтрокаВладельца,
			ТаблицаВладелец, ТаблицаПодчиненная, имяКолонкиСумма, КопироватьКоличество); 
	КонецЕсли;
	
	ИспользоватьАналитикуКонтрагентДляСС = ДополнительныеПараметрыРаспределения.Свойство("ИспользоватьАналитикуКонтрагентДляСС")
										И ДополнительныеПараметрыРаспределения.ИспользоватьАналитикуКонтрагентДляСС;
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
								ТаблицаПодчиненная, 
								ИспользоватьАналитикуКонтрагентДляСС);
	
	Форма.Модифицированность = Истина;
	
	Возврат ПараметрыКопирования;
	
КонецФункции

// Удалить распределенные строки владельца.
//
// Параметры:
//  Объект								 - ОбъектФормы, ДокументОбъект, УправляемаяФорма
//  ИмяПодчиненнойТаблицы				 - Строка
//  СтрокаВладельца						 - ЭлементДанныеФормыКоллекция
//  МожетБытьРаспределениеПоПериодам	 - Булево
//  ИмяТаблицыРаспределенияПоПериодам	 - Строка
//  ИмяКолонкиИндекса					 - Строка
//
Процедура УдалитьРаспределенныеСтрокиВладельца(Объект, ИмяПодчиненнойТаблицы, СтрокаВладельца,
				МожетБытьРаспределениеПоПериодам = Ложь, ИмяТаблицыРаспределенияПоПериодам = Неопределено, ИмяКолонкиИндекса = Неопределено) Экспорт
					
	Если СтрокаВладельца = Неопределено Тогда
		Возврат;
	КонецЕсли;
				
	ПараметрыОтбора = Новый Структура("ИндексСтрокиВладельца", СтрокаВладельца.ИндексСтрокРаспределения);
	НайденныеСтрокиРаспределения = Объект[ИмяПодчиненнойТаблицы].НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого УдаляемаяСтрока Из НайденныеСтрокиРаспределения Цикл
		
		// Удалим распределение по периодам, которое связано с подчиненной строкой.
		Если МожетБытьРаспределениеПоПериодам Тогда
			
			ОтборСтрокРаспределенияПоПериодам = Новый Структура;
			ОтборСтрокРаспределенияПоПериодам.Вставить(
							ИмяКолонкиИндекса, УдаляемаяСтрока.ИндексСтрокРаспределенияПоПериодам);
			
			НайденныеСтрокиРаспределенияПоПериодам = 
						Объект[ИмяТаблицыРаспределенияПоПериодам].НайтиСтроки(ОтборСтрокРаспределенияПоПериодам);
			Для Каждого УдаляемяСтрокаПоПериодам Из НайденныеСтрокиРаспределенияПоПериодам Цикл
				Объект[ИмяТаблицыРаспределенияПоПериодам].Удалить(УдаляемяСтрокаПоПериодам);
			КонецЦикла;
			
		КонецЕсли;
		
		// А теперь удалим строки подчиненной ТЧ.
		Объект[ИмяПодчиненнойТаблицы].Удалить(УдаляемаяСтрока);
		
	КонецЦикла;
		
КонецПроцедуры

// Пересчитывает на форме итоги в таблице распределения по периодам.
//
// Параметры:
//  Объект	- ДанныеФормыКоллекция, УправляемаяФорма - объект владелец данных заполнения.
//  ЭтаФорма - УправляемаяФорма - форма владелец данных заполнения.
//  ТаблицаРаспределения - Строка - имя таблицы распределения.
//  ЭлементРаспределяемый - Строка - имя таблицы-владельца распределения.
//  ИмяКолонкиИндекса - Строка - имя колонки индекса связи таблицы распределения и ее владельца.
//  РаспределятьКоличество - Булево - признак необходимости распределения количества в таблице распределения.
//  СброситьТекущуюСтрокуРаспределения - Булево - признак необходимости сброса выделения текущей строки распределения.
//
Процедура ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, ТаблицаРаспределения, ЭлементРаспределяемый,
	ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям",	
	РаспределятьКоличество = Истина, 
	СброситьТекущуюСтрокуРаспределения = Истина) Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	
	ТекущаяСтрокаВладельца = Элементы[ЭлементРаспределяемый].ТекущиеДанные;
	
	Если Объект[ЭлементРаспределяемый].Количество() > 0 
		И ТекущаяСтрокаВладельца = Неопределено Тогда
		
		ТекущаяСтрокаВладельца = Объект[ЭлементРаспределяемый].Получить(0);
		
	КонецЕсли;
	
	Если РаспределятьКоличество Тогда
		ЭтаФорма[ТаблицаРаспределения + "КоличествоОстатокИтог"] = 0;
		ЭтаФорма[ТаблицаРаспределения + "КоличествоРаспределеноИтог"] = 0;
	КонецЕсли;
		
	ЭтаФорма[ТаблицаРаспределения + "СуммаОстатокИтог"] = 0;
	ЭтаФорма[ТаблицаРаспределения + "СуммаРаспределеноИтог"] = 0; 

	Если ТекущаяСтрокаВладельца <> Неопределено Тогда
		
		Если СброситьТекущуюСтрокуРаспределения Тогда
			Элементы[ТаблицаРаспределения].ТекущаяСтрока = Неопределено;
		КонецЕсли;
		
		ТекущийИндекс = ТекущаяСтрокаВладельца.ИндексСтрокРаспределения;
				
		// Вертикальные итоги
		
		Если ЭтаФорма.ИмяФормы = "Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая"
			И (ТаблицаРаспределения = "РаспределениеДополнительныхЗатрат"
				Или ТаблицаРаспределения = "РаспределениеДоходов"
				Или ТаблицаРаспределения = "РаспределениеРасходов") Тогда
			ИмяЭлементаТаблицыРаспределения = ТаблицаРаспределения + "ГруппаПрограммно";
		Иначе
			ИмяЭлементаТаблицыРаспределения = "";
		КонецЕсли;
		
		Если ЭтаФорма.ИмяФормы = "Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая"
			И ТаблицаРаспределения = "РаспределениеОбъемов" Тогда
			СчитатьФакт = Истина;
		Иначе
			СчитатьФакт = Ложь;
		КонецЕсли;
		
		ПрограммноСозданныеЭлементы = упоРаботаСФормамиКлиентСервер.ПолучитьЭлементыРаспределенияПоПериодам(ЭтаФорма, 
											ТаблицаРаспределения, ИмяЭлементаТаблицыРаспределения);
		Для каждого ЭлементСпискаПрограммно Из ПрограммноСозданныеЭлементы Цикл			
			
			Счетчик = 0;
			ПериодЗашифрованный = упоРаботаСФормамиКлиентСервер.ПолучитьЗашифрованныйПериод(ЭлементСпискаПрограммно.Имя);
			ИмяКолонки = ТаблицаРаспределения + "_" + Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");
			ИмяКолонкиСумма = "Сумма_" + ИмяКолонки;
			ИмяКолонкиКоличество = "Количество_" + ИмяКолонки;
			Если СчитатьФакт Тогда
				ИмяКолонкиСуммаФакт = "СуммаФакт_" + ИмяКолонки;
				ИмяКолонкиКоличествоФакт = "КоличествоФакт_" + ИмяКолонки;
			КонецЕсли;
			
			ЭтаФорма["Всего_" + ИмяКолонкиСумма] = 0; 
			Если РаспределятьКоличество Тогда
				ЭтаФорма["Всего_" + ИмяКолонкиКоличество] = 0;
			КонецЕсли;
			Если СчитатьФакт Тогда
				ЭтаФорма["Всего_" + ИмяКолонкиСуммаФакт] = 0; 
				ЭтаФорма["Всего_" + ИмяКолонкиКоличествоФакт] = 0;
			КонецЕсли;
			
			Для каждого СтрокаРаспределения Из Объект[ТаблицаРаспределения] Цикл
				
				Если Не (СтрокаРаспределения.СпособПривязки =
					ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную")) 
					Или СтрокаРаспределения.ИндексСтрокиВладельца <> ТекущийИндекс Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ЭтаФорма["Всего_" + ИмяКолонкиСумма] = ЭтаФорма["Всего_" + ИмяКолонкиСумма] + СтрокаРаспределения[ИмяКолонкиСумма]; 
				
				Если РаспределятьКоличество Тогда
					ЭтаФорма["Всего_" + ИмяКолонкиКоличество] = ЭтаФорма["Всего_" + ИмяКолонкиКоличество] 
						+ СтрокаРаспределения[ИмяКолонкиКоличество];		 
				КонецЕсли;
				
				Если СчитатьФакт Тогда
					ЭтаФорма["Всего_" + ИмяКолонкиСуммаФакт] = ЭтаФорма["Всего_" + ИмяКолонкиСуммаФакт] + СтрокаРаспределения[ИмяКолонкиСуммаФакт];
					ЭтаФорма["Всего_" + ИмяКолонкиКоличествоФакт] = ЭтаФорма["Всего_" + ИмяКолонкиКоличествоФакт] 
						+ СтрокаРаспределения[ИмяКолонкиКоличествоФакт];
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Горизонтальные итоги	
		
		Для каждого СтрокаРаспределения Из Объект[ТаблицаРаспределения] Цикл
			
			Если Не (СтрокаРаспределения.СпособПривязки = 
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную")) 
				Или СтрокаРаспределения.ИндексСтрокиВладельца <> ТекущийИндекс Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ВсегоРаспределеноСумма = 0;
			ВсегоРаспределеноКоличество = 0;
			
			Для каждого ЭлементСпискаПрограммно Из ПрограммноСозданныеЭлементы Цикл
				
				ПериодЗашифрованный = упоРаботаСФормамиКлиентСервер.ПолучитьЗашифрованныйПериод(ЭлементСпискаПрограммно.Имя);			 
				
				Если РаспределятьКоличество Тогда
					
					ИмяКолонкиКоличество = "Количество_" + ТаблицаРаспределения + "_"+Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");				
					ВсегоРаспределеноКоличество = ВсегоРаспределеноКоличество + СтрокаРаспределения[ИмяКолонкиКоличество];
					
				КонецЕсли;
				
				ИмяКолонкиСумма = "Сумма_" + ТаблицаРаспределения + "_"+Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");
				ВсегоРаспределеноСумма = ВсегоРаспределеноСумма + СтрокаРаспределения[ИмяКолонкиСумма];
				
			КонецЦикла;
			
			СтрокаРаспределения.СуммаРаспределено =  ВсегоРаспределеноСумма;
			Если РаспределятьКоличество Тогда
				СтрокаРаспределения.КоличествоРаспределено  =  ВсегоРаспределеноКоличество;
				СтрокаРаспределения.КоличествоОстаток  =  СтрокаРаспределения.Количество - ВсегоРаспределеноКоличество;
			КонецЕсли;
			
			СтрокаРаспределения.СуммаОстаток =  СтрокаРаспределения.Сумма - ВсегоРаспределеноСумма;
			
			Если РаспределятьКоличество Тогда
				ЭтаФорма[ТаблицаРаспределения + "КоличествоОстатокИтог"] = ЭтаФорма[ТаблицаРаспределения + "КоличествоОстатокИтог"] 
					+ СтрокаРаспределения.КоличествоОстаток;
				ЭтаФорма[ТаблицаРаспределения + "КоличествоРаспределеноИтог"] = ЭтаФорма[ТаблицаРаспределения 
					+ "КоличествоРаспределеноИтог"]  + СтрокаРаспределения.КоличествоРаспределено;;		 
			КонецЕсли;
			
			ЭтаФорма[ТаблицаРаспределения + "СуммаОстатокИтог"] = ЭтаФорма[ТаблицаРаспределения + "СуммаОстатокИтог"] 
				+ СтрокаРаспределения.СуммаОстаток;
			ЭтаФорма[ТаблицаРаспределения + "СуммаРаспределеноИтог"] = ЭтаФорма[ТаблицаРаспределения + "СуммаРаспределеноИтог"] 
				+ СтрокаРаспределения.СуммаРаспределено;		 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Перезаполняет колонки распределения данных по периодам.
//
// Параметры:
//  Объект					 - ДанныеФормыКоллекция, УправляемаяФорма	 - объект владелец данных заполнения.
//  ЭтаФорма				 - УправляемаяФорма							 - форма владелец данных заполнения.
//  ТаблицаРаспределения	 - Строка									 - имя таблицы распределения.
//  ИмяКолонкиИндекса		 - Строка									 - имя колонки индекса связи таблицы распределения и ее владельца.
//  РаспределятьКоличество	 - Булево									 - признак необходимости распределения количества в таблице распределения.
//  ПроверятьИсточникПлана	 - Булево									 - признак небходимости проверки источника плана.
//
Процедура ПерезаполнитьРаспределениеОбъемовПоПериодам(Объект, ЭтаФорма, ТаблицаРаспределения,
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям", РаспределятьКоличество = Истина,
		ПроверятьИсточникПлана = Истина) Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СпособПривязки", ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную"));
	
	НайденныеСтроки = Объект[ТаблицаРаспределения].НайтиСтроки(Отбор);
	Если ТаблицаРаспределения = "РаспределениеОбъемов" Тогда
		ЭлементРаспределяемый = "Субпродукты";
		ИмяТаблицыПериоды = "РаспределениеДоходовПоПериодам";
	ИначеЕсли ТаблицаРаспределения = "РаспределениеДоходов" Тогда
		ЭлементРаспределяемый = "ПланДоходов";
		ИмяТаблицыПериоды = "РаспределениеДоходовПоПериодам";
	ИначеЕсли ТаблицаРаспределения = "РаспределениеРасходов" Тогда
		ЭлементРаспределяемый = "ПланРасходов";
		ИмяТаблицыПериоды = "РаспределениеРасходовПоПериодам";
	ИначеЕсли ТаблицаРаспределения = "РаспределениеПотребностей" Тогда
		ЭлементРаспределяемый = "МатериальныеРесурсы";
		ИмяТаблицыПериоды = "РаспределениеРасходовПоПериодам";
	ИначеЕсли ТаблицаРаспределения = "РаспределениеДополнительныхЗатрат" Тогда
		ЭлементРаспределяемый = "ДополнительныеЗатраты";
		ИмяТаблицыПериоды = "РаспределениеРасходовПоПериодам";
	ИначеЕсли ТаблицаРаспределения = "ТрудовыеРесурсы" Тогда
		ЭлементРаспределяемый = "ТрудовыеРесурсы";
		ИмяТаблицыПериоды = "ТрудовыеРесурсыПоПериодам";
	КонецЕсли;
	
	Если ЭтаФорма.ИмяФормы = "Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая"
		И (ТаблицаРаспределения = "РаспределениеДополнительныхЗатрат"
			Или ТаблицаРаспределения = "РаспределениеДоходов"
			Или ТаблицаРаспределения = "РаспределениеРасходов") Тогда
		ИмяЭлементаТаблицыРаспределения = ТаблицаРаспределения + "ГруппаПрограммно";
	Иначе
		ИмяЭлементаТаблицыРаспределения = "";
	КонецЕсли;
	
	Если ПроверятьИсточникПлана Тогда
		ИсточникПлана = упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ТаблицаРаспределения);
	КонецЕсли;
	
	МассивСтрокНаУдаление = Новый Массив;
	
	Для Каждого РаспределенныйЭлемент Из Объект[ИмяТаблицыПериоды] Цикл
		
		Если РаспределенныйЭлемент[ИмяКолонкиИндекса] <> Неопределено Тогда
			Если ПроверятьИсточникПлана И РаспределенныйЭлемент.ИсточникПлана <> ИсточникПлана Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСтрокНаУдаление.Добавить(РаспределенныйЭлемент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаНаУдаление Из МассивСтрокНаУдаление Цикл
		Объект[ИмяТаблицыПериоды].Удалить(Объект[ИмяТаблицыПериоды].Индекс(СтрокаНаУдаление));
	КонецЦикла;
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого СтрокаРаспределения Из Объект[ТаблицаРаспределения] Цикл
			
			Если НЕ (СтрокаРаспределения.СпособПривязки =
					ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную")) Тогда
				Продолжить;
			КонецЕсли;
			
			ПрограммноСозданныеЭлементы = упоРаботаСФормамиКлиентСервер.ПолучитьЭлементыРаспределенияПоПериодам(ЭтаФорма,
					ТаблицаРаспределения, ИмяЭлементаТаблицыРаспределения);
			Для Каждого ЭлементСпискаПрограммно Из ПрограммноСозданныеЭлементы Цикл
				
				ПериодЗашифрованный = упоРаботаСФормамиКлиентСервер.ПолучитьЗашифрованныйПериод(ЭлементСпискаПрограммно.Имя);
				
				Если РаспределятьКоличество Тогда
					ИмяКолонкиКоличество = "Количество_" + ТаблицаРаспределения + "_" + Формат(ПериодЗашифрованный, "ДФ=MM_yyyy");
					КоличествоВКолонке = СтрокаРаспределения[ИмяКолонкиКоличество];
				Иначе
					КоличествоВКолонке = 0;
				КонецЕсли;
				
				Если ИмяТаблицыПериоды <> "ТрудовыеРесурсыПоПериодам" Тогда
					ИмяКолонкиСумма = "Сумма_" + ТаблицаРаспределения + "_" + Формат(ПериодЗашифрованный, "ДФ=MM_yyyy");
					СуммаВКолонке = СтрокаРаспределения[ИмяКолонкиСумма];
				Иначе
					СуммаВКолонке = 0;
				КонецЕсли;
				
				Если СуммаВКолонке > 0 Или КоличествоВКолонке > 0 Тогда
					
					НоваяСтрока = Объект[ИмяТаблицыПериоды].Добавить();
					Если ПроверятьИсточникПлана Тогда
						НоваяСтрока.ИсточникПлана = ИсточникПлана;
					КонецЕсли;
					НоваяСтрока.Период = ПериодЗашифрованный;
					НоваяСтрока[ИмяКолонкиИндекса] = СтрокаРаспределения.ИндексСтрокРаспределенияПоПериодам;
					Если ИмяТаблицыПериоды <> "ТрудовыеРесурсыПоПериодам" Тогда
						НоваяСтрока.Сумма = СуммаВКолонке;
					КонецЕсли;
					Если РаспределятьКоличество Тогда
						НоваяСтрока.Количество = КоличествоВКолонке;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ТаблицаРаспределения = "ТрудовыеРесурсы" Тогда
		упоРаботаСФормамиКлиент.ПересчитатьИтогиВРаспределенииПоПериодам(Объект, ЭтаФорма, ТаблицаРаспределения,
			ЭлементРаспределяемый, ИмяКолонкиИндекса, РаспределятьКоличество);
	КонецЕсли;
	
КонецПроцедуры

// Установить только просмотр колонки валюта.
//
// Параметры:
//  Форма		 - УправляемаяФорма
//  имяТаблицы	 - Строка
//  естьДоговор	 - Булево
//
Процедура УстановитьТолькоПросмотрВалюте(Форма, имяТаблицы, естьДоговор = Неопределено) Экспорт
	
	Элементы = Форма.Элементы;
	
	текДанные = Элементы[имяТаблицы].ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если естьДоговор = Неопределено Тогда
		естьДоговор = ЗначениеЗаполнено(текДанные.Договор);
	КонецЕсли;
	
	Элементы[имяТаблицы + "Валюта"].ТолькоПросмотр = естьДоговор;
	
КонецПроцедуры

// Сделать текущую строку таблицы основной
//
// Параметры:
//  ЭлементТаблицы	 - ТаблицаФормы
//  ДанныеОбъекта	 - ТаблицаЗначений
//
Процедура СделатьТекущуюСтрокуТаблицыОсновной(ЭлементТаблицы, ДанныеОбъекта) Экспорт
	
	ТекущаяСтрока = ЭлементТаблицы.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТР Из ДанныеОбъекта Цикл
		Если СтрокаТР.ПолучитьИдентификатор() <> ТекущаяСтрока Тогда
			СтрокаТР.Основной = Ложь;
		Иначе
			СтрокаТР.Основной = НЕ СтрокаТР.Основной;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Очищает неактуальные данные, связанные со способом привязки.
//
// Параметры:
//  Форма - УправляемаяФорма - форма владелец данных заполнения.
//  ТекущаяСтрокаРаспределения - ДанныеФормыЭлементКоллекции - строка распределения.
//  СобытиеВызваноИзСтруктурыПроекта - Булево.
//  ИмяТаблицыРаспределения - Строка - имя таблцы распределения.
//  ИмяТаблицыПериоды - Строка - имя таблицы периодов.
//  ИмяКолонкиИндекса - Строка - имя колонки индекса связи таблицы распределения и ее владельца.
//
Процедура СтрокаРаспределенияСпособПривязкиПриИзменении(Форма, ТекущаяСтрокаРаспределения, ИмяТаблицыРаспределения,
		СобытиеВызваноИзСтруктурыПроекта = Ложь,
		ИмяТаблицыПериоды = Неопределено,
		ИмяКолонкиИндекса = Неопределено) Экспорт
	
	Если ТекущаяСтрокаРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрокаРаспределения.СпособПривязки =
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения")
		ИЛИ ТекущаяСтрокаРаспределения.СпособПривязки =
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
		
		ТекущаяСтрокаРаспределения.ДатаПривязки = Дата(1, 1, 1);
		
	ИначеЕсли ТекущаяСтрокаРаспределения.СпособПривязки =
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату")
		ИЛИ ТекущаяСтрокаРаспределения.СпособПривязки =
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда
		
		ТекущаяСтрокаРаспределения.ПрофильРаспределения =
			ПредопределенноеЗначение("Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка");
		
	ИначеЕсли ТекущаяСтрокаРаспределения.СпособПривязки =
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
		
		ТекущаяСтрокаРаспределения.ПрофильРаспределения =
			ПредопределенноеЗначение("Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка");
		ТекущаяСтрокаРаспределения.ДатаПривязки = Дата(1, 1, 1);
		
		Если СобытиеВызваноИзСтруктурыПроекта Тогда
			ТаблицаРаспределения = Форма[ИмяТаблицыРаспределения];
		Иначе
			ТаблицаРаспределения = Форма.Объект[ИмяТаблицыРаспределения];
		КонецЕсли;
		
		ТекущаяСтрокаРаспределения.ИндексСтрокРаспределенияПоПериодам =
			упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(
				ТаблицаРаспределения, "ИндексСтрокРаспределенияПоПериодам");
	КонецЕсли;
	
	Если ТекущаяСтрокаРаспределения.СпособПривязки <>
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
		// Для вызова из форм ПЗ и ШПЗ. При вызове из формы задачи структуры периоды находятся в колонках таблицы-владельца.
		Если Не СобытиеВызваноИзСтруктурыПроекта Тогда
			ОбнулитьРаспределениеПоПериодамСтрокиПланаПроектнойЗадачи(Форма.Объект, Форма, ТекущаяСтрокаРаспределения,
				ИмяТаблицыРаспределения, ИмяТаблицыПериоды, ИмяКолонкиИндекса);
		КонецЕсли;
		
		ТекущаяСтрокаРаспределения.ИндексСтрокРаспределенияПоПериодам = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Делает проверку при изменении фактических дат окончания и начала.
//
// Параметры:
//  ТаблицаДерево - ДанныеФормыКоллекция - строка таблицы/дерева.
//  ТекущаяСтрока - Число - текущая строка ТаблицаДерево.
//  ИмяЭлемента   - Строка - имя проверяемого элемента ТаблицаДерево.
//  ИмяПоля 	  - Строка - имя колонки ТаблицаДерево.
//  
Процедура ПриИзмененииФактическихДат(ТаблицаДерево, ТекущаяСтрока, ИмяЭлемента, ИмяПоля) Экспорт
		
	СтрокаТаблицы = ТаблицаДерево.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ДатаНачалаФакт = СтрокаТаблицы.ДатаНачалаФакт;
	ДатаЗавершенияФакт = СтрокаТаблицы.ДатаЗавершенияФакт;
	
	ДопПараметры = ПолучитьСтруктуруПараметровДляДатФакта(ИмяЭлемента);
	
	Если ИмяПоля = "ДатаНачалаФакт" И ЗначениеЗаполнено(ДатаЗавершенияФакт)
		И ДатаНачалаФакт > ДатаЗавершенияФакт Тогда
		
		ИзменитьПроверяемуюДатуПоляИВывестиСообщение(СтрокаТаблицы, ДатаЗавершенияФакт, ИмяПоля, ДопПараметры);
		
	ИначеЕсли ИмяПоля = "ДатаЗавершенияФакт" И ДатаЗавершенияФакт < ДатаНачалаФакт Тогда
		
		ИзменитьПроверяемуюДатуПоляИВывестиСообщение(СтрокаТаблицы, ДатаНачалаФакт, ИмяПоля, ДопПараметры);
		
	КонецЕсли;	
	
КонецПроцедуры

// Установить фактические сроки по умолчанию
//
// Параметры:
//  ТекущаяСтрока			 - ДанныеФормыЭлементКоллекции
//  ИмяПоляДатаНачала		 - Строка
//  ИмяПоляДатаЗавершения	 - Строка
//
Процедура УстановитьФактическиеСрокиПоУмолчанию(ТекущаяСтрока,
													ИмяПоляДатаНачала = "ДатаНачала", 
													ИмяПоляДатаЗавершения = "ДатаЗавершения") Экспорт 
	
	Если ТекущаяСтрока.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Запланирована") Тогда
		ТекущаяСтрока.ДатаНачалаФакт = Дата(1, 1, 1);
		ТекущаяСтрока.ДатаЗавершенияФакт = Дата(1, 1, 1);    

	ИначеЕсли ТекущаяСтрока.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Выполняется") Тогда		
 		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачалаФакт) Тогда		
			ТекущаяСтрока.ДатаНачалаФакт = ТекущаяСтрока[ИмяПоляДатаНачала];
		КонецЕсли;	
		ТекущаяСтрока.ДатаЗавершенияФакт = Дата(1, 1, 1);
		
	ИначеЕсли ТекущаяСтрока.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Завершена") Или 
			  ТекущаяСтрока.Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта") Тогда
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачалаФакт) Тогда
			ТекущаяСтрока.ДатаНачалаФакт = ТекущаяСтрока[ИмяПоляДатаНачала];	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаЗавершенияФакт) Тогда
			ТекущаяСтрока.ДатаЗавершенияФакт = ТекущаяСтрока[ИмяПоляДатаЗавершения];
		КонецЕсли;	
	
	КонецЕсли;
	
КонецПроцедуры

// Делает проверку при изменении фактических дат окончания и начала.
//
// Параметры:
//  Форма	 - Форма	 - форма обработки "упоПланировщик.Форма.Форма".
//  Задача	 - ЛюбаяСсылка	 - Задача.
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьДатыНачалаОкончанияЗадачи(Форма, Задача) Экспорт
	
	ДатаНачалаЗадачи = Неопределено;
	ДатаОкончанияЗадачи = Неопределено;
	Если ТипЗнч(Задача) <> Тип("СправочникСсылка.упоВнепроектныеЗадачи")
		И ТипЗнч(Задача) <> Тип("СправочникСсылка.упоПричиныПотерьРабочегоВремени") Тогда
		
		Отбор = Новый Структура("Задача", Задача);
		
		НайденныеСтроки = Форма.ТаблицаНазначенныхЗадачПолная.НайтиСтроки(Отбор);		
		Если НайденныеСтроки.Количество() <> 0 Тогда
			ДатаНачалаЗадачи = 
				?(ЗначениеЗаполнено(НайденныеСтроки[0].ДатаНачала), НачалоДня(НайденныеСтроки[0].ДатаНачала), Неопределено);
			ДатаОкончанияЗадачи = 
				?(ЗначениеЗаполнено(НайденныеСтроки[0].ДатаНачала), КонецДня(НайденныеСтроки[0].ДатаОкончания), Неопределено);
		Иначе
			НайденныеСтроки = Форма.ТаблицаПоручений.НайтиСтроки(Отбор);	
			Если НайденныеСтроки.Количество() <> 0 Тогда
				ДатаНачалаЗадачи = 
					?(ЗначениеЗаполнено(НайденныеСтроки[0].ДатаНачала), НачалоДня(НайденныеСтроки[0].ДатаНачала), Неопределено);
				ДатаОкончанияЗадачи =
					?(ЗначениеЗаполнено(НайденныеСтроки[0].ДатаНачала), КонецДня(НайденныеСтроки[0].ДатаОкончания), Неопределено);					
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ДатаНачалаЗадачи, ДатаОкончанияЗадачи", ДатаНачалаЗадачи, ДатаОкончанияЗадачи);
	
КонецФункции

// Сообщает пользователю причину блокировки поля "Валюта".
//  Поле может быть заблокировано в т.ч. условным оформлением.
//
// Параметры:
//  Элемент			 - ТаблицаФормы	 - таблица-источник выбора.
//  Поле			 - ЭлементФормы	 - проверяемый элемент.
//  ИмяПоляДоговор	 - Строка
//
Процедура ОбработатьВыборПоляВалюта(Элемент, Поле, ИмяПоляДоговор = "Договор") Экспорт
	
	ИмяПоля = СтрЗаменить(Поле.Имя, Элемент.Имя, "");		
	Если ИмяПоля = "Валюта" Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные[ИмяПоляДоговор]) Тогда			
			ТекстСообщения = НСтр("ru = 'Для изменения валюты необходимо очистить в строке поле ""Договор"". 
			|Если поле ""Договор"" недоступно, необходимо включить опцию трансляции данных в БДР и после этого очистить договор.'"); 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

// Проверяет наличие непосредственного руководителя подразделения в строке ресурса, 
// если выбранный ресурс является основным.
//
// Параметры:
//  СтрокаДанных - ДанныеФормыЭлементКоллекции - проверяемая строка ресурса.
//  НазначатьРСПОсновнойРолиКакРПЗ - Булево - признак необходимости назначения руководителя подразделения строки 
//												основного ресурса руководителем ПЗ-владельца ресурса.
//
Процедура ПроверитьНаличиеНепосредственногоРуководителяПодразделения(СтрокаДанных, НазначатьРСПОсновнойРолиКакРПЗ) Экспорт
			
	Если Не НазначатьРСПОсновнойРолиКакРПЗ Тогда 
		Возврат;
	КонецЕсли;	
	
	Если СтрокаДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	// Выполняем проверку только для основной строки и только при заполненном подразделении. 
	// Незаполненное подразделение отслеживается при сохранении данных.
	Если Не СтрокаДанных.Основной Или Не ЗначениеЗаполнено(СтрокаДанных.Подразделение) Тогда
		Возврат;
	КонецЕсли;	
		
	РСП = упоИерархияИПолномочияВызовСервера.НепосредственныйРуководительПодразделения(СтрокаДанных.Подразделение);
	
	Если Не ЗначениеЗаполнено(РСП) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для выбранного подразделения ""%1"" основной роли не назначен руководитель. Руководитель ПЗ не будет назначен автоматически.'"),
			СтрокаДанных.Подразделение); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
	
КонецПроцедуры

// Проверяет выбранную таблицу на дубли по выбранному полю
//
// Параметры:
//  ИмяРеквизитаТЧ				 - Строка			 - Имя выбранного поля.
//  ТрудовойРесурс				 - Справочники.упоТрудовыеРесурсы	 - трудовой ресурс.
//  Таблица						 - ДанныеФормыКоллекция				 - таблица-источник выбора.
//  ОтменаРедактирования		 - Булево
//  Отказ						 - Булево
//  ЭтоДокумент					 - Булево
//  ПоискЭлементаВДругойТаблице	 - Булево
//
Процедура ПроверитьДублиРесурсов(ИмяРеквизитаТЧ, ТрудовойРесурс, Таблица, ОтменаРедактирования, Отказ,
	ЭтоДокумент = Истина, ПоискЭлементаВДругойТаблице = Ложь) Экспорт
	
	Если ОтменаРедактирования Или Отказ Или Не ЗначениеЗаполнено(ТрудовойРесурс) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоДокумент Тогда
		СтрокаПроверкиИзДокумента =  НСтр("ru = 'документа'");
	Иначе
		СтрокаПроверкиИзДокумента = НСтр("ru = 'проектной задачи'");
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура(ИмяРеквизитаТЧ, ТрудовойРесурс);
	
	КоличествоДублей = 1;
	Если ПоискЭлементаВДругойТаблице Тогда
		КоличествоДублей = 0;
	КонецЕсли;	
		
	Если Таблица.НайтиСтроки(ПараметрыОтбора).Количество() > КоличествоДублей Тогда
		
		Сообщение = НСтр("ru = 'Ресурс %1 выбран несколько раз.
			|В пределах %2 запрещено выбирать ресурс более одного раза.'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, ТрудовойРесурс, 
			СтрокаПроверкиИзДокумента);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение, , , , Отказ);
			
	КонецЕсли;
	
КонецПроцедуры

// Осуществляет перемещение текущей строки по табличной части в зависимости от выбранного направления движения
// в таблице, которая связана с элементом, на который наложен отбор строк.
//
// Параметры:
//  ТабличнаяЧасть - ДанныеФормыКоллекция - Табличная часть объекта. Обязательный реквизит НомерСтроки.
//  ЭлементТаблица - ТаблицыФормы - Связанный с параметром ТабличнаяЧасть элемент формы.
//  НаправлениеПеремещения - Строка - Направление перемещения по таблице.
//
Процедура ПереместитьСтрокуВТаблице(ТабличнаяЧасть, ЭлементТаблица, НаправлениеПеремещения) Экспорт
		
	ТекущаяСтрока = ЭлементТаблица.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Новый СписокЗначений;	
	Для Каждого ВыделеннаяСтрока Из ЭлементТаблица.ВыделенныеСтроки Цикл		
		Строка = ТабличнаяЧасть.НайтиПоИдентификатору(ВыделеннаяСтрока);
		ВыделенныеСтроки.Добавить(Строка.НомерСтроки - 1);		
	КонецЦикла;
	
	Если НаправлениеПеремещения = "Вверх" Тогда		
		НаправлениеСдвига = -1;
		ВыделенныеСтроки.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	Иначе
		НаправлениеСдвига = 1;
		ВыделенныеСтроки.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	КонецЕсли;
	
	ОтборСтрокЭлемента = ЭлементТаблица.ОтборСтрок;
	
	Индекс = 0;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Сдвиг =	ВеличинаСдвига(ВыделеннаяСтрока.Значение, ТабличнаяЧасть, ОтборСтрокЭлемента, НаправлениеСдвига);		
		ПереместитьСтроку = НужноПереместитьСтроку(ВыделенныеСтроки, ВыделеннаяСтрока, Индекс, Сдвиг);
		
		Если ПереместитьСтроку Тогда
			ТабличнаяЧасть.Сдвинуть(ВыделеннаяСтрока.Значение, Сдвиг);
			ВыделеннаяСтрока.Значение = ВыделеннаяСтрока.Значение + Сдвиг;
		КонецЕсли;		
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	ЭлементТаблица.Обновить();
		
КонецПроцедуры

// Проверяет реквизит на использование служебного значения СводныйРесурс. 
// В случае использования этого значения очищает реквизит.
//
// Параметры:
// 	Ресурс - РеквизитФормы - проверяемый реквизит.
//
Процедура ПроверитьОчиститьСводныйРесурс(Ресурс) Экспорт
	
	Если Ресурс = ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.СводныйРесурс") Тогда
		Ресурс = ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.ПустаяСсылка");
	КонецЕсли;		
	
КонецПроцедуры

// Устанавливает иконку направления ДДС в строке табличной части ПЗ.
//
// Параметры:
//  СтрокаДанные - ДанныеФормыЭлементКоллекции, Структура - строка данных.
//
Процедура УстановитьИконкуНаправленияВТаблицеДДС(СтрокаДанные) Экспорт
		
	Если СтрокаДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не СтрокаДанные.Свойство("Иконка") Тогда
		Возврат;
	КонецЕсли;	
			
	Если СтрокаДанные.НаправлениеДвижения =
			ПредопределенноеЗначение("Перечисление.упоНаправлениеДвиженияДенежныхСредств.Выплата") Тогда      
		СтрокаДанные.Иконка = 1;
	Иначе
		СтрокаДанные.Иконка = 0;
	КонецЕсли; 	
	
КонецПроцедуры

// Открывает форму выбора сотрудников с отбором по сотрудникам, доступным указанному пользователю.
//
// Параметры:
//  Пользователь	 - СправочникССылка.Пользователи - пользователь для выбора его сотрудников.
//  ВладелецФормы	 - УправляемаяФорма, ЭлементФормы - владелец открываемой формы.
//
Процедура ОткрытьФормуВыбораСотрудниковПользователя(Пользователь, ВладелецФормы) Экспорт
	
	СписокСотрудников = упоИерархияИПолномочияВызовСервера.обПолучитьСписокСотрудниковДиспетчера(Пользователь, Ложь);
	
	ПараметрыОтбора 	= Новый Структура("Ссылка", СписокСотрудников);
	ПараметрыФормы 		= Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.упоСотрудники.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
	
КонецПроцедуры

// Проверяет есть ли в распределении объемов роли, трудозатраты которых есть сразу по нескольким подразделениям.
//
// Параметры:
//  ОбъектПроверки	 - ДокументОбъект.упоПроектнаяЗадача, ФормаКлиентскогоПриложения - объект с данными.
//  ИмяТаблицыРаспределения	 - строка - имя таблицы с данными
//	Отказ - булево - .
//
Процедура ПроверитьДублированиеРолейВРаспределенииОбъемов(ОбъектПроверки, ИмяТаблицыРаспределения, Отказ) Экспорт
	
	ОбработанныеРесурсы = Новый Соответствие;
	СписокОшибок = Неопределено;
	
	ШаблонОшибки = нСтр("ru='Для роли ""%1"" уже указаны трудозатраты по подразделению ""%2"".'", "ru");
	
	НомерСтроки = 0;  
	
	Для Каждого СтрокаПроверки Из ОбъектПроверки[ИмяТаблицыРаспределения] Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если ОбработанныеРесурсы[СтрокаПроверки.Роль] = Неопределено Тогда
			ОбработанныеРесурсы.Вставить(СтрокаПроверки.Роль, СтрокаПроверки.Подразделение);
		Иначе
			Если ОбработанныеРесурсы[СтрокаПроверки.Роль] = СтрокаПроверки.Подразделение Тогда
				Продолжить;
			КонецЕсли;
			
			ИндексСтроки = ОбъектПроверки[ИмяТаблицыРаспределения].Индекс(СтрокаПроверки);
			ИмяПоля = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1[%2].Роль", ИмяТаблицыРаспределения,
																		Формат(ИндексСтроки, "ЧН=; ЧГ="));
																		
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, 
				СтрокаПроверки.Роль, ОбработанныеРесурсы[СтрокаПроверки.Роль]); 
					
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок,
				ИмяПоля,
				ТекстОшибки, 
				,
				НомерСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СписокОшибок, Отказ);
	
КонецПроцедуры

#Область ПроектнаяПродукция

// Рассчитывет реквизит Длительность по формуле Количество * Скорость.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции, ДанныеФормыЭлементДерева, Структура -
//
Процедура ПересчитатьДлительностьПоПроектнойПродукции(СтрокаТабличнойЧасти) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(СтрокаТабличнойЧасти.Ресурс) Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.Свойство("Длительность") И СтрокаТабличнойЧасти.Свойство("Количество") И
		СтрокаТабличнойЧасти.Свойство("СкоростьВыполнения") Тогда
	
		СтрокаТабличнойЧасти.Длительность = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.СкоростьВыполнения; 
	
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает параметры выбора ресурса субпродуктов при начале выбора на форме.
//
// Параметры:
//  Элемент			 - ЭлементФормы							 - элемент ресурс, где инициирован выбор.
//  ТипСубпродукта	 - ПеречислениеСсылка.упоТипСубпродукта	 - тип субпродукта для ресурса.
//  ОпцииВыбора		 - Структура							 - см.КонструкторОпцииВыборПроектнойПродукции().
//
Процедура УстановитьПараметрыВыбораРесурсаСубпродуктов(Элемент, ТипСубпродукта, ОпцииВыбора) Экспорт
	
	МассивПараметров = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("ПометкаУдаления", Ложь);
	МассивПараметров.Добавить(НовыйПараметр);
	
	Если ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция") Тогда
		НовыйПараметр = Новый ПараметрВыбора("СтандартныйОтбор", Истина);
		МассивПараметров.Добавить(НовыйПараметр);
		Если ОпцииВыбора.Свойство("Проект") Тогда
			НовыйПараметр = Новый ПараметрВыбора("Проект", ОпцииВыбора.Проект);
			МассивПараметров.Добавить(НовыйПараметр);
		КонецЕсли;	
		Если ОпцииВыбора.Свойство("ПроектнаяЗадача") Тогда
			НовыйПараметр = Новый ПараметрВыбора("ПроектнаяЗадача", ОпцииВыбора.ПроектнаяЗадача);
			МассивПараметров.Добавить(НовыйПараметр);		
		КонецЕсли;
		Если ОпцииВыбора.Свойство("ВыборШаблон") Тогда
			НовыйПараметр = Новый ПараметрВыбора("ВыборШаблон", ОпцииВыбора.ВыборШаблон);
			МассивПараметров.Добавить(НовыйПараметр);
		КонецЕсли;
	КонецЕсли;
		
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

// Обработчик события "ПриИзменении" для типа субпродукта.
//
// Параметры:
//  Форма			 - УправляемаяФорма
//  ВызовИзСтруктуры - Булево			 - признак работы со структурой, а не с документом ПЗ.
//
Процедура ТипСубпродуктаПриИзменении(Форма, ВызовИзСтруктуры = Ложь, ВидимостьКомандЗаполненияПоРолям = Истина) Экспорт
	
	Элементы = Форма.Элементы;
	ТипПродуктаЧисло = Форма.ТипПродуктаЧисло;
	Если ВызовИзСтруктуры Тогда
		ТаблицаРаспределения = "СубпродуктыПоПодразделениям";
		Объект = Форма;
	Иначе
		ТаблицаРаспределения = "РаспределениеОбъемов";
		Объект = Форма.Объект;
	КонецЕсли;
	
	Объект.ТипСубпродукта =
		упоИнтеграцияКлиентСервер.ТипСубпродуктаПеречислениеПоНомеру(ТипПродуктаЧисло);
	
	ЭтоПП =
		Объект.ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
		
	Если Не ЭтоПП Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"СубпродуктыГруппаЗаполнитьПоРолям", "Видимость", ВидимостьКомандЗаполненияПоРолям);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"СубпродуктыПоПодразделениямГруппаЗаполнитьПоРолям", "Видимость", ВидимостьКомандЗаполненияПоРолям);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"РаспределениеОбъемовРаспределениеОбъемовЗаполнитьПоРолям", "Видимость", ВидимостьКомандЗаполненияПоРолям);
	КонецЕсли;
	
	упоРаботаСФормамиКлиентСервер.НастроитьСубпродуктыНаФормеПоТипуСубпродукта(Элементы,
		Объект.ТипСубпродукта, ВызовИзСтруктуры);
		
	// Отключение опции трансляции затрат субпродуктов.
	Если Не ЭтоПП И Объект.ТранслироватьЗатратыПоСубпродуктам Тогда
		Объект.ТранслироватьЗатратыПоСубпродуктам = Ложь;
	КонецЕсли;
	
	// Очистка заполненной ТЧ.
	Если ЗначениеЗаполнено(Объект.Субпродукты) Тогда
		Если Объект.Субпродукты[0].Ресурс = Неопределено Тогда
			НадоОчиститьТЧ = Ложь; // Добавляется новая строка.
		Иначе
			ЗаполненСубпродуктПП = упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Объект.Субпродукты[0].Ресурс);
			НадоОчиститьТЧ = (ЗаполненСубпродуктПП И НЕ ЭтоПП)
				Или (Не ЗаполненСубпродуктПП И ЭтоПП);
				Если НадоОчиститьТЧ И Не ВызовИзСтруктуры Тогда
					упоРаботаСФормамиКлиент.УдалитьПеренесенныеСтрокиИзСвязанныхТаблиц(Объект, 
						"ПланДоходов", 
						"РаспределениеДоходов",
						ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.Объемы"));
						
					Объект[ТаблицаРаспределения].Очистить();	
					ПересчитатьИтогиВРаспределенииПоПериодам(Объект, Форма, ТаблицаРаспределения, "Субпродукты", 
						"ИндексСтрокиРаспределениеПоРолям", Истина, Ложь);	
					
					Объект.РаспределениеДоходовПоПериодам.Очистить();
					Объект.Субпродукты.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

// Конструктор опций выбора проектной продукции.
//
// Параметры:
//		Проект				- Неопределено, СправочникСсылка.Проекты
//  	ПроектнаяЗадача 	- Неопределено, ДокументСсылка.ПроектнаяЗадача
//  	ВыбратьШаблон		- Булево
// 
// Возвращаемое значение:
//   Структура:
//     * Проект 			- СправочникСсылка.Проекты
//     * ПроектнаяЗадача 	- ДокументСсылка.ПроектнаяЗадача
//     * ВыборШаблон 		- Булево
//     
Функция КонструкторОпцииВыборПроектнойПродукции(Проект = Неопределено, ПроектнаяЗадача = Неопределено, 
	ВыбратьШаблон = Ложь) Экспорт
	
  	ОпцииВыбора = Новый Структура();
	Если ЗначениеЗаполнено(Проект) Тогда
		ОпцииВыбора.Вставить("Проект", Проект);
	КонецЕсли;
	Если ПроектнаяЗадача <> Неопределено Тогда
		ОпцииВыбора.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
	КонецЕсли;
	Если ВыбратьШаблон Тогда
		ОпцииВыбора.Вставить("ВыборШаблон", Истина);
	КонецЕсли;	
	
	Возврат ОпцииВыбора;
	
КонецФункции

// Устанавливает блокировку редактирования некоторых полей строки шаблона проектной продукции в плане выпуска.
//
// Параметры:
//  СтрокаПланаВыпуска     - ДанныеФормыЭлементКоллекции
//  ЭлементыФормы          - ВсеЭлементыФормы
//
Процедура УстановитьВозможностьРедактированияСтрокиПроектнойПродукции(СтрокаПланаВыпуска, ЭлементыФормы, ЭтоСтруктураПроекта = Ложь) Экспорт
	
	МодульПроектнаяПродукцияВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("упоПроектнаяПродукцияВызовСервера");
	Если СтрокаПланаВыпуска <> Неопределено
		И ТипЗнч(СтрокаПланаВыпуска.Ресурс) = Тип("СправочникСсылка.упоПроектнаяПродукция") Тогда
		ЭтоШаблон = МодульПроектнаяПродукцияВызовСервера.ЭтоШаблонПроектнойПродукции(СтрокаПланаВыпуска.Ресурс);
	Иначе
		ЭтоШаблон = Ложь;
	КонецЕсли;
	
	ЦветЗапрещеннойЯчейки = ОбщегоНазначенияКлиент.ЦветСтиля("ТекстЗапрещеннойЯчейкиЦвет");
	ЦветАвто = Новый Цвет;
	ОбрабатываемыеЭлементы = ЭлементыДляПроверкиВозможностиРедактированияПроектнойПродукции(ЭтоСтруктураПроекта);
	Для Каждого ИмяЭлемента Из ОбрабатываемыеЭлементы Цикл
		НайденныйЭлемент = ЭлементыФормы.Найти(ИмяЭлемента);
		Если НайденныйЭлемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныйЭлемент.ТолькоПросмотр = ЭтоШаблон;
		Если ЭтоШаблон Тогда
			ЭлементыФормы[ИмяЭлемента].ЦветФона = ЦветЗапрещеннойЯчейки;
		Иначе
			ЭлементыФормы[ИмяЭлемента].ЦветФона = ЦветАвто;
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыБлокировки = Новый Массив;
	РеквизитыБлокировки.Добавить("СубпродуктыПоПодразделениямГруппаЗаполнитьПоРолям");
	Если ЭтоСтруктураПроекта Тогда
		РеквизитыБлокировки.Добавить("СубпродуктыЗаполнитьПоВладельцуСубпродукты");
		РеквизитыБлокировки.Добавить("СубпродуктыПоПодразделениямЗаполнитьКоличествоСумму");
		РеквизитыБлокировки.Добавить("СубпродуктыПоПодразделениямВыделитьНДССубпродукты");
	Иначе
		РеквизитыБлокировки.Добавить("РаспределениеОбъемовЗаполнитьПоВладельцуСубпродукты");
		РеквизитыБлокировки.Добавить("РаспределениеОбъемовРаспределениеОбъемовЗаполнитьКоличествоСумму");
		РеквизитыБлокировки.Добавить("РаспределениеОбъемовВыделитьНДС");
		РеквизитыБлокировки.Добавить("РаспределениеОбъемовГруппаАктуализировать");
	КонецЕсли;
	Для Каждого ИмяЭлемента Из РеквизитыБлокировки Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, "Видимость", Не ЭтоШаблон);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, 
		"НадписьПредупреждениеОЗапретеРедактированияШаблонаПроектнойПродукции", "Видимость", ЭтоШаблон);
	
КонецПроцедуры

// Проверяет на дубли проектную продукцию в плане выпуска.
//
// Параметры:
//  ПланВыпуска         - ДанныеФормыКоллекция
//  ЭлементыФормы       - ВсеЭлементыФормы
//  Отказ               - Булево
//
Процедура ПроверитьНаДублиПроектнуюПродукцию(ПланВыпуска, ЭлементыФормы, Отказ, ЭтоКопирование = Ложь) Экспорт
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПланаВыпуска = ЭлементыФормы.Субпродукты.ТекущиеДанные;
	Если СтрокаПланаВыпуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ресурс = СтрокаПланаВыпуска.Ресурс;
	Если Не ЗначениеЗаполнено(Ресурс) Тогда
		Возврат;
	КонецЕсли;
	
	МодульПроектнаяПродукцияВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("упоПроектнаяПродукцияВызовСервера");
	ЭтоШаблонПроектнойПродукции = МодульПроектнаяПродукцияВызовСервера.ЭтоШаблонПроектнойПродукции(СтрокаПланаВыпуска.Ресурс);
	Если ЭтоШаблонПроектнойПродукции Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Ресурс", Ресурс);
	НайденныеСтроки = ПланВыпуска.НайтиСтроки(ПараметрыОтбора);
	Если ЭтоКопирование Тогда
		Отказ = НайденныеСтроки.Количество() = 1;
	Иначе
		Отказ = НайденныеСтроки.Количество() > 1;
	КонецЕсли;
	Если Отказ Тогда
		ШаблонСообщения = НСтр("ru = 'Нельзя добавить более одного экземпляра проектной продукции (дублирование элемента ""%1"").'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Ресурс);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПричиныОтклонений

// Аннотация не требуется, см. имя метода.
//
// Параметры:
//  СтрокаДанных - Структура, ДанныеФормыЭлементКоллекции, СтрокаТаблицыЗначений - данные строки таблицы.
//
Процедура ПричиныОтклоненийСтрокаПриИзменении(СтрокаДанных) Экспорт
	
	СтрокаДанных.АвторИзменений = ПользователиКлиент.ТекущийПользователь();
	СтрокаДанных.ДатаИзменений = ОбщегоНазначенияКлиент.ДатаСеанса();
	
КонецПроцедуры //

// Аннотация не требуется, см. имя метода.
//
// Параметры:
//  СтрокаДанных - Структура, ДанныеФормыЭлементКоллекции, СтрокаТаблицыЗначений	 - данные строки таблицы.
//  НоваяСтрока	 - Булево
//
Процедура ПричиныОтклоненийСтрокаПриОкончанииРедактирования(СтрокаДанных, НоваяСтрока = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(СтрокаДанных.Пользователь) Тогда
		СтрокаДанных.Пользователь = ПользователиКлиент.ТекущийПользователь();
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		СтрокаДанных.Сотрудник = упоИнтеграцияВызовСервера.ПолучитьТекущегоСотрудникаВызовСервера();
		СтрокаДанных.Новая = Истина;
	КонецЕсли;
	
КонецПроцедуры //

// Аннотация не требуется, см. имя метода.
//
// Параметры:
//  СтрокаДанных	 - СтрокаТабличнойЧасти, ЭлементКоллекцииДанныеФормы
//  ТаблицаДанных	 - ДанныеФормыКоллекция
//
Процедура ПричиныОтклоненийПричинаПриИзменении(СтрокаДанных, ТаблицаДанных) Экспорт
	
	// У нас не может быть 2х строк с одинаковым видом причины отклонения.
	// Поэтому мы сначала должны удалить все "отмененные" с таким же видом.
	// Потом проверить что "не отмененная" только одна
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Причина", СтрокаДанных.Причина);
	ПараметрыОтбора.Вставить("Отмена", Истина);
	
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора);
	
	Для каждого Строка Из НайденныеСтроки Цикл 
		ТаблицаДанных.Удалить(Строка);
	КонецЦикла;
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Причина", СтрокаДанных.Причина);
	ПараметрыОтбора.Вставить("Отмена", Ложь);
	
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = нСтр("ru='В таблице ""Причины отклонений"" есть одинаковые строки. Необходимо удалить дубли.'", "ru");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
		
КонецПроцедуры //

// Аннотация не требуется, см. имя метода.
//
// Параметры:
//  СтрокаДанных - Структура, ДанныеФормыЭлементКоллекции, СтрокаТаблицыЗначений - данные строки таблицы.
//  ТаблицаДанных	 - ДанныеФормыКоллекция
//  Отказ			 - Булево
//
Процедура ПричиныОтклоненийПередУдалением(СтрокаДанных, ТаблицаДанных, Отказ) Экспорт
	
	// Мы полноценно удаляем если у нас это новая строка, 
	// или если кроме этой строки есть другие с таким же видом, не новая
	УдалитьОкончательно = Ложь;
	Если СтрокаДанных.Новая Тогда
		УдалитьОкончательно = Истина;
	Иначе
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Причина", СтрокаДанных.Причина);
		
		НайденныеСтроки = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора);
		УдалитьОкончательно = НайденныеСтроки.Количество() > 1;
	КонецЕсли;
	
	Если Не УдалитьОкончательно Тогда
		Отказ = Истина;
		СтрокаДанных.Отмена = Истина;
	КонецЕсли;
		
КонецПроцедуры //

#КонецОбласти 

// Пересчитывает сумму строки владельца по таблице распределения.
//
// Параметры:
//  ДополнительныеПараметры - Структура - параметры проверки:
//		ТекДанные				 - ДанныеФормыЭлементКоллекции
//  	ИмяТаблицыВладельца 	 - Строка
//  	ИмяТаблицыРаспределения	 - Строка 
//  	ТаблицаРаспределения	 - ДанныеФормыКоллекция
//
Процедура ПересчитатьТаблицуРаспределенияЗавершение(ДополнительныеПараметры) Экспорт
		
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	ИмяТаблицыВладельца = ДополнительныеПараметры.ИмяТаблицыВладельца;
	ИмяТаблицыРаспределения = ДополнительныеПараметры.ИмяТаблицыРаспределения;
	ТаблицаРаспределения = ДополнительныеПараметры.ТаблицаРаспределения;

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонкиОбщСтоимость = "ОбщСтоимость";
	ИмяКолонкиКоэффициентовРаспределения = "Количество";
	Если ИмяТаблицыВладельца = "ПланДоходов" Или ИмяТаблицыВладельца = "ПланРасходов"
		Или ИмяТаблицыВладельца = "Доходы" Или ИмяТаблицыВладельца = "Расходы"
		Или ИмяТаблицыВладельца = "ДоходныеОбъемы" Или ИмяТаблицыВладельца = "РасходныеОбъемы" Тогда
		ИмяКолонкиОбщСтоимость = "Сумма";
	КонецЕсли;
	
	ПересчитыватьКоличество = Истина;
	
	Если ИмяТаблицыВладельца = "ПланДоходов" Или ИмяТаблицыВладельца = "ПланРасходов" Тогда
		ПересчитыватьКоличество = Ложь;
		ИмяКолонкиКоэффициентовРаспределения = "Сумма";
	КонецЕсли;
		
	Если ДополнительныеПараметры.Свойство("ПересчитыватьКоличество") 
		И Не ДополнительныеПараметры.ПересчитыватьКоличество Тогда
		ПересчитыватьКоличество = ДополнительныеПараметры.ПересчитыватьКоличество;
		ИмяКолонкиКоэффициентовРаспределения = "Сумма";
	КонецЕсли;

	ДополнительныеПараметры.Вставить("ПересчитыватьКоличество", ПересчитыватьКоличество); 	
	ДополнительныеПараметры.Вставить("ИмяКолонкиОбщСтоимость", ИмяКолонкиОбщСтоимость);
	
	упоРаботаСФормамиКлиентСервер.РаспределитьСуммуСтрокиВладельцаПоТаблицеРаспределения(ТекДанные, ТаблицаРаспределения,
		ИмяКолонкиОбщСтоимость, "Сумма", ИмяКолонкиКоэффициентовРаспределения, ПересчитыватьКоличество);
			
КонецПроцедуры

// Возвращает структуру строки владельца.
//
// Параметры:
//  ТаблицаРаспределения 	 - ДанныеФормыКоллекция
//  СтрокаВладелец	 		 - ДанныеФормыЭлементКоллекции
//  ИмяТаблицыВладельца 	 - Строка
//
Функция СтруктураСтрокиДляРасчетаНДС(ТаблицаРаспределения, СтрокаВладелец, ИмяТаблицыВладельца) Экспорт
	
	СССП_НДС = ПредопределенноеЗначение("Справочник.упоСобственныеСилыСубподряд.НДС");
	
	ЕстьНДС = Ложь;
	
	Для Каждого СтрокаТаблицы Из ТаблицаРаспределения Цикл
		Если СтрокаТаблицы.СобствСилы_Субподряд = СССП_НДС Тогда
			ЕстьНДС = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьНДС Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяКолонкиОбщСтоимость = "ОбщСтоимость";
	Если ИмяТаблицыВладельца = "ПланДоходов" Или ИмяТаблицыВладельца = "ПланРасходов"
		Или ИмяТаблицыВладельца = "Доходы" Или ИмяТаблицыВладельца = "Расходы"
		Или ИмяТаблицыВладельца = "ДоходныеОбъемы" Или ИмяТаблицыВладельца = "РасходныеОбъемы" Тогда	
		ИмяКолонкиОбщСтоимость = "Сумма";
	КонецЕсли;
	
	СтруктураСтрокаВладелец = упоРаботаСФормамиКлиент.СтрокаДанныхДляРасчетаНДС(СтрокаВладелец, ИмяКолонкиОбщСтоимость);
	
	Возврат СтруктураСтрокаВладелец;
	
КонецФункции

// Устанавливает текущую строку в таблице владельца по индексу отбора починенной таблицы.
//
// Параметры:
//  Форма	 			 - Форма, УправляемаяФорма
//  Объект               - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения
//  ИмяТекущейСтраницы	 - Строка
//  ИмяДляДокументаПЗ 	 - Булево
Процедура УстановитьТекущуюСтрокуДляРасчетаИтоговПриТрансляции(Форма, Объект, ИмяТекущейСтраницы, 
	ИмяДляДокументаПЗ = Ложь) Экспорт
	
	Если ИмяТекущейСтраницы = "СтраницаПланДоходов" Тогда
		ЭлементВладелец = "ПланДоходов";
	ИначеЕсли ИмяТекущейСтраницы = "СтраницаПланРасходов" Тогда
		ЭлементВладелец = "ПланРасходов";
	Иначе 
		Возврат;
	КонецЕсли;
	
	ЭлементПодчиненный = упоПроектыИЗадачиОбщие.ИмяПодчиненнойТаблицыПоИмениОсновной(ЭлементВладелец, ИмяДляДокументаПЗ);

	СтруктураОтбора = Форма.Элементы[ЭлементПодчиненный].ОтборСтрок;
	
	Если Не ЗначениеЗаполнено(СтруктураОтбора) Тогда
		Возврат;	
	КонецЕсли;
	
	ИндексОтбора = Новый Структура("ИндексСтрокРаспределения", СтруктураОтбора.ИндексСтрокиВладельца);
	СтрокиОтбораВладельца = Объект[ЭлементВладелец].НайтиСтроки(ИндексОтбора);
	
	Если Не ЗначениеЗаполнено(СтрокиОтбораВладельца) Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы[ЭлементВладелец].ТекущаяСтрока = СтрокиОтбораВладельца[0].ПолучитьИдентификатор();
		
КонецПроцедуры

// Распределяет сумму по периодам пропорционально уже распределенной сумме.
//
// Параметры:
//  ЭтаФорма				 - УправляемаяФорма - форма владелец данных заполнения. 
//  ОбъектФормы				 - ДанныеФормыКоллекция, УправляемаяФорма - объект владелец данных заполнения.
//	ПараметрыКоманды		 - Структура:
//		ИмяТаблицыРаспределения	 - Строка - имя таблицы распределения. 
// 		ИмяОсновнойТаблицы		 - Строка - имя основной таблицы.
//      УчитыватьКоличество		 - Булево -	признак ведения количественного учета.
//  ВызовИзСтруктуры		 - Булево - признак работы со структурой, а не с документом ПЗ 
//
Процедура РаспределитьПоПериодам(Форма, ОбъектФормы, ПараметрыКоманды, ВызовИзСтруктуры = Ложь) Экспорт
		
	ИмяОсновнойТаблицы		= ПараметрыКоманды.ИмяОсновнойТаблицы;
	ИмяТаблицыРаспределения = ПараметрыКоманды.ИмяТаблицыРаспределения;
	УчитыватьКоличество		= ПараметрыКоманды.УчитыватьКоличество;	
		
	Элементы = Форма.Элементы;
	ТекСтрока = Элементы[ИмяТаблицыРаспределения].ТекущиеДанные; 
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.СпособПривязки <> ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
		Возврат;
	КонецЕсли;
	
	Если УчитыватьКоличество Тогда 
		
		Если ВызовИзСтруктуры Тогда
			НеРаспределеноКоличество = ТекСтрока.НеРаспределеноКоличество;
		Иначе
			НеРаспределеноКоличество =  ТекСтрока.КоличествоОстаток;		
		КонецЕсли;
		
		Если НеРаспределеноКоличество <> 0 Тогда
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоПроектнаяЗадача = Форма.ИмяФормы = "Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая";
	Если ЭтоПроектнаяЗадача И (ИмяТаблицыРаспределения = "РаспределениеДоходов"
		Или ИмяТаблицыРаспределения = "РаспределениеРасходов") Тогда
		ИмяЭлементаТаблицыРаспределения = ИмяТаблицыРаспределения + "ГруппаПрограммно";
	Иначе
		ИмяЭлементаТаблицыРаспределения = "";
	КонецЕсли;
	
	Если ВызовИзСтруктуры Тогда
		ПрограммноСозданныеЭлементы = Форма[ИмяОсновнойТаблицы + "ДобавленныеКолонки"];
    Иначе
		ПрограммноСозданныеЭлементы = упоРаботаСФормамиКлиентСервер.ПолучитьЭлементыРаспределенияПоПериодам(Форма, 
										ИмяТаблицыРаспределения, ИмяЭлементаТаблицыРаспределения);	
	КонецЕсли;
									
	МассивИменКолонокСумма = Новый Массив;
	Для каждого ЭлементСпискаПрограммно Из ПрограммноСозданныеЭлементы Цикл			
		
		Если ВызовИзСтруктуры Тогда
			МассивИменКолонокСумма.Добавить(ЭлементСпискаПрограммно.ИмяКолонкиСумма);
		Иначе
			ПериодЗашифрованный = упоРаботаСФормамиКлиентСервер.ПолучитьЗашифрованныйПериод(ЭлементСпискаПрограммно.Имя);
			ИмяКолонки = ИмяТаблицыРаспределения + "_" + Формат(ПериодЗашифрованный,"ДФ=MM_yyyy");
			ИмяКолонкиСумма = "Сумма_" + ИмяКолонки;
			МассивИменКолонокСумма.Добавить(ИмяКолонкиСумма);
		КонецЕсли;
		
	КонецЦикла;
	
	КоэффициентыКРаспределению = Новый Массив;
	Для каждого ИмяКолонки_Сумма Из МассивИменКолонокСумма Цикл
		КоэффициентыКРаспределению.Добавить(ТекСтрока[ИмяКолонки_Сумма]);	
	КонецЦикла;
	
	СуммаКРаспределению = ТекСтрока.Сумма;
	
    РаспределенныеСуммы = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКРаспределению, 
		КоэффициентыКРаспределению);
		
	Счетчик = 0;	
	Для каждого ИмяКолонки_Сумма Из МассивИменКолонокСумма Цикл
		ТекСтрока[ИмяКолонки_Сумма]	= ?(РаспределенныеСуммы = Неопределено, 0, РаспределенныеСуммы[Счетчик]);
		Счетчик = Счетчик + 1;
    КонецЦикла;
	
	Если ВызовИзСтруктуры Тогда
		ТекСтрока.НеРаспределеноСумма = 0;
		ТекСтрока.РаспределеноСумма = СуммаКРаспределению;
		Возврат;
	Иначе
		ТекСтрока.СуммаОстаток = 0;
		ТекСтрока.СуммаРаспределено = СуммаКРаспределению;	
	КонецЕсли;
	
	ИмяКолонкиИндекса = "ИндексСтрокиРаспределениеПоРолям";
	Если ИмяТаблицыРаспределения = "РаспределениеДоходов" Тогда
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияДоходов";
	ИначеЕсли ИмяТаблицыРаспределения = "РаспределениеРасходов" Тогда
		ИмяКолонкиИндекса = "ИндексСтрокиРаспределенияРасходов";
	КонецЕсли;
	
	
	ПроверятьИсточникПлана = Истина;
	
	// В шаблонах проектных задач источник плана не заполняется для распределения объемов, поэтому пропускаем проверку.
	// Источник плана в шаблонах используется не для трансляции, а для разделения расходных объемов в таблице периодов.
	Если Не ЭтоПроектнаяЗадача И ИмяТаблицыРаспределения = "РаспределениеОбъемов" Тогда
		ПроверятьИсточникПлана = Ложь;	
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ПерезаполнитьРаспределениеОбъемовПоПериодам(ОбъектФормы, Форма, ИмяТаблицыРаспределения, 
		ИмяКолонкиИндекса, УчитыватьКоличество, ПроверятьИсточникПлана);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПроверкаЗаполнения

// Проверяет таблицы формы дубли в строках.
//
// Параметры:
//  Объект	- ДанныеФормыКоллекция, УправляемаяФорма - объект владелец данных заполнения.
//  Форма - УправляемаяФорма - форма владелец данных заполнения.
//  ДопПараметры - Структура - параметры проверки.
//  Отказ - Булево - признак отказа записи данных.
//
Функция ПроверитьТаблицыНаДубли(Объект, Форма, ДопПараметры, Отказ) Экспорт
	
	ПараметрыТаблиц = ПараметрыТаблиц_ПроверкаДублей(Объект, Форма, ДопПараметры, Отказ);
		
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Успех = Истина;
	
	ЭтоШаблон = ДопПараметры.Свойство("ЭтоШаблон") И ДопПараметры.ЭтоШаблон;
	
	ТаблицаСДублями = "";
	ПараметрыТаблицы = Новый Структура;
	
	Для Каждого ДанныеТаблицы Из ПараметрыТаблиц Цикл
		
		ПараметрыТаблицы = ДанныеТаблицы;
		
		ТекущаяТаблица = Объект[ДанныеТаблицы.ТаблицаРаспределения];
		Если ТекущаяТаблица.Количество() <> 0 Тогда
			
			ТаблицаВладелец = упоПроектыИЗадачиОбщие.ТаблицаВладелецДляПроверкиНаДубли(ПараметрыТаблицы.ТаблицаРаспределения);
						
			Для Каждого СтрокаТЧ Из ТекущаяТаблица Цикл
				
				// Исключаем из проверки на дублирование строки трансляции
				Если ЗначениеЗаполнено(ТаблицаВладелец) Тогда
					
					ЭтоСтрокаТрансляции = упоРаботаСФормамиКлиентСервер.ЭтоСтрокаТрансляции(СтрокаТЧ, ТаблицаВладелец);
					
					Если ЭтоСтрокаТрансляции Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;	
				
				СтруктураОтбора = Новый Структура(ДанныеТаблицы.КолонкиИзмерений);
				ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
				
				ИскомыеСтроки = ТекущаяТаблица.НайтиСтроки(СтруктураОтбора);  
				
				Если ДанныеТаблицы.ТаблицаРаспределения = "Субпродукты" И Не ЭтоШаблон
					И упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(ИскомыеСтроки[0].Ресурс) Тогда
					
						УдалитьШаблоныПроектнойПродукцииИзСубпродуктов(ИскомыеСтроки);						
										
				КонецЕсли; 
				
				Если ИскомыеСтроки.Количество() > 1 Тогда
					
					ТаблицаСДублями = ДанныеТаблицы.СинонимТаблицыРаспределения;
										
					Успех = Ложь;					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ Успех Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Успех И ЗначениеЗаполнено(ТаблицаСДублями) Тогда
		
		Отказ = Истина;
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да);
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
		
		ДопПараметры.Вставить("ПараметрыТекТаблицы", ПараметрыТаблицы);
		ДопПараметры.Вставить("Объект", Объект);
		ДопПараметры.Вставить("Форма", Форма);
		
		Если ПараметрыТаблицы.ТаблицаРаспределения = "ДвиженияДенежныхСредств" 
			Или ПараметрыТаблицы.ТаблицаРаспределения = "ПланПоступлений"
			Или ПараметрыТаблицы.ТаблицаРаспределения = "ПланВыплат" Тогда
			ТекстВопроса = НСтр("ru = 'В таблице ""%1"" есть одинаковые строки. Свернуть их, сложив суммы?'");
		Иначе	
			ТекстВопроса = НСтр("ru = 'В таблице ""%1"" есть одинаковые строки. Свернуть их, сложив суммы и количество?'");
		КонецЕсли;
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ТаблицаСДублями);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьТаблицыНаДублиПродолжение", ЭтотОбъект, ДопПараметры);	
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок);		
		
	КонецЕсли;
			
	Возврат Успех;
	
КонецФункции

// Обработчик завершения процедуры ПроверитьТаблицыНаДубли()
//
// Параметры:
//  Ответ	- Код возврата диалога - результат диалога.
//  ДополнительныеПараметры - Структура - параметры обработчика.
//
Процедура ПроверитьТаблицыНаДублиПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект = ДополнительныеПараметры.Объект;
		Форма = ДополнительныеПараметры.Форма;
		
		ЭтоШаблон = ДополнительныеПараметры.Свойство("ЭтоШаблон") И ДополнительныеПараметры.ЭтоШаблон;
	
		// 1. Сворачиваем таблицу (удаляем строки-дубли, суммируем нужные колонки).
		ПараметрыТаблицы = ДополнительныеПараметры.ПараметрыТекТаблицы;
				
		ТаблицаСДублями = Объект[ПараметрыТаблицы.ТаблицаРаспределения];
		КолонкиИзмерений = ПараметрыТаблицы.КолонкиИзмерений;
		КолонкиСумм = ПараметрыТаблицы.КолонкиСумм;
		
		ИмяПодчиненнойТаблицы = упоПроектыИЗадачиОбщие.ИмяПодчиненнойТаблицыПоИмениОсновной(ПараметрыТаблицы.ТаблицаРаспределения, 
			ДополнительныеПараметры.ПредставлениеДляДокумента);
			
		ПодчиненнаяТаблицаПоПериодам = упоПроектыИЗадачиОбщие.ДанныеПодчиненнойТаблицыПоПериодамПоИмениВладельца(ПараметрыТаблицы.ТаблицаРаспределения, 
			ДополнительныеПараметры.ПредставлениеДляДокумента);
		
		ИмяТаблицыВладельца = упоПроектыИЗадачиОбщие.ТаблицаВладелецДляПроверкиНаДубли(
			ПараметрыТаблицы.ТаблицаРаспределения);
			
		МассивИменСуммовыхКолонок = СтрРазделить(КолонкиСумм, ",", Ложь);
		
		Для Каждого СтрокаТЧ Из ТаблицаСДублями Цикл
			
			ЗанулитьТаблицуПоПериодам = ЗанулитьТаблицуПоПериодам(ПараметрыТаблицы.ТаблицаРаспределения, СтрокаТЧ); 
			
			ДополнитьКолонкиСуммКолонкамиПоПериодам(МассивИменСуммовыхКолонок, ПараметрыТаблицы.ТаблицаРаспределения, 
				ДополнительныеПараметры.ГруппыРазделовКолонкиПоПериодам, ЗанулитьТаблицуПоПериодам);
			
			СтруктураОтбора = Новый Структура(КолонкиИзмерений);
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
			
			ИскомыеСтроки = ТаблицаСДублями.НайтиСтроки(СтруктураОтбора); 
			
			Если ПараметрыТаблицы.ТаблицаРаспределения = "Субпродукты" И Не ЭтоШаблон 
				И упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(ИскомыеСтроки[0].Ресурс) Тогда
				
				УдалитьШаблоныПроектнойПродукцииИзСубпродуктов(ИскомыеСтроки);						
				
			КонецЕсли;  

			Если ИскомыеСтроки.Количество() > 1 Тогда
				
				// Сворачиваем, суммируя нужные колонки. 
				// Не забываем про ИсходныйНомерСтроки.
				// Удаляем все строки из таблицы, кроме первой.
				
				МассивУдаляемых = Новый Массив;
				СтрокаДляАгрегирования = Неопределено;
				
				ЭтоПервый = Истина;
				Для Каждого НайденнаяСтрока Из ИскомыеСтроки Цикл
					
					Если ЭтоПервый Тогда
						
						СтрокаДляАгрегирования = НайденнаяСтрока;
						ЭтоПервый = Ложь;
						
					Иначе
						
						Если МассивУдаляемых.Найти(НайденнаяСтрока) = Неопределено Тогда
							МассивУдаляемых.Добавить(НайденнаяСтрока);
								
						КонецЕсли;
						
						Для Каждого ИмяСуммовойКолонки Из МассивИменСуммовыхКолонок Цикл
							ИмяСуммовойКолонки = СокрЛП(ИмяСуммовойКолонки);
							СтрокаДляАгрегирования[ИмяСуммовойКолонки] = СтрокаДляАгрегирования[ИмяСуммовойКолонки] + НайденнаяСтрока[ИмяСуммовойКолонки];							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;	
				
				Для Каждого УдаляемаяСтрока Из МассивУдаляемых Цикл																	
					// Переносим подчиненные строки.
					Если ЗначениеЗаполнено(ИмяПодчиненнойТаблицы) Тогда
						СтрокиРаспределения = упоПроектыИЗадачиОбщие.ПолучитьСтрокиРаспределенияПоПодразделениям(
							УдаляемаяСтрока, Объект[ИмяПодчиненнойТаблицы]);
						Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
							СтрокаРаспределения.ИндексСтрокиВладельца = СтрокаДляАгрегирования.ИндексСтрокРаспределения;	
						КонецЦикла;
					КонецЕсли;
					Если ПодчиненнаяТаблицаПоПериодам <> Неопределено И ЗначениеЗаполнено(ПодчиненнаяТаблицаПоПериодам.ИмяПодчиненнойТаблицы) Тогда
						// Переносим подчиненные строки, распределенные по периодам.
						СтрокиРаспределения = упоПроектыИЗадачиОбщие.ПолучитьСтрокиРаспределенияПоПериодам(
							УдаляемаяСтрока, Объект[ПодчиненнаяТаблицаПоПериодам.ИмяПодчиненнойТаблицы], 
							ПодчиненнаяТаблицаПоПериодам.ИндексСтрокиРаспределения, , ПодчиненнаяТаблицаПоПериодам.ИсточникПлана);
						Если ЗанулитьТаблицуПоПериодам Тогда
							// Способ привязки/профиль/дату устанавливаем по родителю.
							УстановитьДанныеСтрокиПоРодителю(СтрокаДляАгрегирования, Объект, ИмяТаблицыВладельца);
						Иначе
							ОтборСтрок = Новый Структура(ПодчиненнаяТаблицаПоПериодам.колонкиОтбора);
							ОтборСтрок.Вставить(ПодчиненнаяТаблицаПоПериодам.ИндексСтрокиРаспределения);
							Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
								ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаРаспределения);
								ОтборСтрок[ПодчиненнаяТаблицаПоПериодам.ИндексСтрокиРаспределения] = СтрокаДляАгрегирования.ИндексСтрокРаспределенияПоПериодам;
								НайденныеСтроки = Объект[ПодчиненнаяТаблицаПоПериодам.ИмяПодчиненнойТаблицы].НайтиСтроки(ОтборСтрок);
								Если НайденныеСтроки.Количество() = 0 Тогда
									СтрокаДляАгрегированияПоПериодам = Объект[ПодчиненнаяТаблицаПоПериодам.ИмяПодчиненнойТаблицы].Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаДляАгрегированияПоПериодам, ОтборСтрок);
								Иначе
									СтрокаДляАгрегированияПоПериодам = НайденныеСтроки[0];
								КонецЕсли;
								Для Каждого КолонкаСуммы Из ПодчиненнаяТаблицаПоПериодам.колонкиСуммы Цикл
									СтрокаДляАгрегированияПоПериодам[КолонкаСуммы] = СтрокаДляАгрегированияПоПериодам[КолонкаСуммы] + СтрокаРаспределения[КолонкаСуммы];
								КонецЦикла;	
							КонецЦикла;
						КонецЕсли;	
						Для каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
							Объект[ПодчиненнаяТаблицаПоПериодам.ИмяПодчиненнойТаблицы].Удалить(СтрокаРаспределения);
						КонецЦикла;	
					КонецЕсли;	
					
					ТаблицаСДублями.Удалить(УдаляемаяСтрока);
				КонецЦикла;
												
			КонецЕсли;
				
		КонецЦикла;
		
		// 2. Снова проверяем на дубли.
		Отказ = Ложь;		
		ПроверитьТаблицыНаДубли(Объект, Форма, ДополнительныеПараметры, Отказ);
		
		// Пересчитаем длительность ПП у шаблонов проектной задачи
		Если ЭтоШаблон И ПараметрыТаблицы.ТаблицаРаспределения = "Субпродукты" Тогда
			ПересчитатьДлительностьПроектнойПродукцииШаблоновПЗ(ТаблицаСДублями); 	
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.ОбновлениеИтоговРаспределенияЗавершение(Ответ, ДополнительныеПараметры);
	
КонецПроцедуры

// Проверяет строку в таблице формы на наличие дублирующих записей.
//
// Параметры:
//  Форма	- Форма - проверяемая форма.
//  ПараметрыОтбора - Структура - параметры отбора дублитрующих значений.
//  ИмяТаблицы - Строка - имя таблицы, а которой происходит поиск дублей.
//  ПолноеИмяЭлемента - Строка - имя элемента, в котором вызывается действие проверки.
//  Сообщать - Булево - признак необходимости выдачи сообщения.
//
// Возвращаемое значение:
//	Булево - наличие дублей.
//
Функция ПроверитьСтрокуНаДублирование(Форма, ПараметрыОтбора, ИмяТаблицы, ПолноеИмяЭлемента, Сообщать = Истина) Экспорт
	
	Если Форма.ИмяФормы = "Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая"
		Или Форма.ИмяФормы = "Справочник.упоОграниченияДоступаПоПроектам.Форма.ФормаЭлемента" Тогда
		Объект = Форма.Объект;
	Иначе
		Объект = Форма;
	КонецЕсли;	
	
	Элементы = Форма.Элементы;
	
	ИмяЭлемента = СтрЗаменить(ПолноеИмяЭлемента, ИмяТаблицы, "");
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные[ИмяЭлемента]) Тогда
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ТекущиеДанные);
		
		НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 1 Тогда
			
			Если Сообщать Тогда
				ТекстСообщения = НСтр("ru = 'Такая запись уже существует, выберите другое значение'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , 				
								ИмяТаблицы + "[" + ТекущиеДанные.ПолучитьИдентификатор() + "]" + "." + ИмяЭлемента);
			КонецЕсли;
			
			ТекущиеДанные[ИмяЭлемента] = Неопределено;
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;	

	Возврат Истина;
	
КонецФункции

Процедура ПроверитьЗаполнениеТаблицы(ЭтаФорма, ИмяТаблицы, 
									ПредставлениеТаблицы, 
									СтруктураПроверки, 
									Отказ, 
									ОтборСтрок = Неопределено) Экспорт
				
	ШаблонСообщения = НСтр("ru = 'В строке №%1 таблицы ""%2"" не заполнено обязательное для заполнения поле ""%3"".'");
			
	НомерСтрокиДляТекстаСообщения = 0;
	
	ТаблицаФормы = ЭтаФорма[ИмяТаблицы];
	
	Если ОтборСтрок = Неопределено Тогда
		СтрокиПроверки = ТаблицаФормы;
	Иначе	
		СтрокиПроверки = ТаблицаФормы.НайтиСтроки(ОтборСтрок);	
	КонецЕсли;	
			
	Для Каждого СтрокаТаблицы Из СтрокиПроверки Цикл
							
		ИндексСтроки = ТаблицаФормы.Индекс(СтрокаТаблицы);		
		НомерСтрокиДляТекстаСообщения = НомерСтрокиДляТекстаСообщения + 1;
		
		Если ЭтоПеренесеннаяСтрокаОсновнойТаблицы(ИмяТаблицы, СтрокаТаблицы, Истина) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючЗначение Из СтруктураПроверки Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы[КлючЗначение.Ключ]) Тогда					
				
				ПропускатьПроверку = ПропускатьПроверкуЗаполненияРаспределения(КлючЗначение.Ключ, СтрокаТаблицы, ЭтаФорма, 
					ИмяТаблицы);
					
				Если ПропускатьПроверку Тогда
					Продолжить;	
				КонецЕсли;	
					
				ТекстСообщения 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
																					НомерСтрокиДляТекстаСообщения, 
																					ПредставлениеТаблицы, 
																					КлючЗначение.Значение);
				ИмяПоля 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1[%2].%3", 
																					ИмяТаблицы,	
																					Формат(ИндексСтроки, "ЧН=; ЧГ="), 
																					КлючЗначение.Ключ);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ИмяПоля, , Отказ);
				
			КонецЕсли;				    
			
		КонецЦикла;
		
		Если СтруктураПроверки.Свойство("СпособПривязки") 
			Или СтруктураПроверки.Свойство("СпособПривязкиДоходовРасходов") Тогда
			упоПроектыИЗадачиОбщие.ПроверитьЗаполнениеСпособаПривязки(ЭтаФорма, 
																	СтрокаТаблицы, 
																	ИмяТаблицы, 
																	ПредставлениеТаблицы,
																	Отказ, 
																	НомерСтрокиДляТекстаСообщения);
		КонецЕсли;	
			
	КонецЦикла;	
	
КонецПроцедуры

Функция ПропускатьПроверкуЗаполненияРаспределения(ИмяПроверяемогоРеквизита, СтрокаТаблицы, ЭтаФорма, ИмяТаблицы)
	
	Пропускать = Ложь;
	
	Если ИмяПроверяемогоРеквизита = "СпособПривязки" Тогда		
		// Для строк трансляции БДР способ привязки не проверяем.
		ИсточникПлана = Неопределено;
		Если СтрокаТаблицы.Свойство("ИсточникПлана", ИсточникПлана) И ЗначениеЗаполнено(ИсточникПлана) Тогда 
			
			Если ИсточникПлана <>
				ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы") Тогда			
				Пропускать = Истина;			
			КонецЕсли;
			
		КонецЕсли;	
		
	ИначеЕсли ИмяПроверяемогоРеквизита = "Количество" Тогда
		// Для строк НДС количество не заполняем.
		СобствСилы_Субподряд = Неопределено;
		Если СтрокаТаблицы.Свойство("СобствСилы_Субподряд", СобствСилы_Субподряд) Тогда
			
			Если СобствСилы_Субподряд = 
					ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.упоСобственныеСилыСубподряд.НДС") Тогда		
				Пропускать = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		
	ИначеЕсли ИмяПроверяемогоРеквизита = "Сумма" Тогда 
		
		// Для случаев, когда заполнение суммы не является обязательным (только количественный учет для матресурсов и 
		// субпродуктов), сумма НДС всё равно является обязательной.		 
		Если (ИмяТаблицы = "РаспределениеПотребностей" И Не ЭтаФорма.ВключитьМатРесурсыВПланРасходов) 
			Или (ИмяТаблицы = "РаспределениеОбъемов" И Не ЭтаФорма.ВключитьСубпродуктыВПланДоходов)
			Или (ИмяТаблицы = "СубпродуктыПоПодразделениям" И Не ЭтаФорма.ВключитьСубпродуктыВПланДоходов)
			Или (ИмяТаблицы = "МатериальныеРесурсыПоПодразделениям" И Не ЭтаФорма.ВключитьМатРесурсыВПланРасходов) Тогда
			
			СобствСилы_Субподряд = Неопределено;
			Если СтрокаТаблицы.Свойство("СобствСилы_Субподряд", СобствСилы_Субподряд) Тогда
				
				Если Не СобствСилы_Субподряд = 
					ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.упоСобственныеСилыСубподряд.НДС") Тогда
					Пропускать = Истина;		
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
		
	Возврат Пропускать;	
	
КонецФункции

Функция ПропуститьЗаполнениеЗначенияВСтроке(СтрокаДанных, ДополнительныеПараметры)
	
	ПропуститьЗаполнение = Ложь;
	
	Если ДополнительныеПараметры.ИмяКолонкиТЧ = "СобствСилы_Субподряд" Тогда
		Если СтрокаДанных[ДополнительныеПараметры.ИмяКолонкиТЧ] = 
				ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.упоСобственныеСилыСубподряд.НДС") Тогда
			ПропуститьЗаполнение = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ПропуститьЗаполнение;
	
КонецФункции

// Проверяет заполнение основной и связанной таблиц по переданным параметрам.
//
Процедура ПроверитьЗаполнениеОсновнойИСвязаннойТаблиц(Форма, 
	                                                ИмяТаблицы, 
													ЕстьТаблицаРаспределения, 
													Отказ,
													ПолучатьЗаголовкиДляДокумента = Ложь,
													ЕстьОбъемыВРаспределенииДоходов = Ложь, 
													ЕстьОбъемыВРаспределенииРасходов = Ложь,
													ДоступКФинИнформации = "",
                                                    ВызовИзСтруктуры = Ложь) Экспорт 
													
	// Параметры проверки.
	Результат = ПараметрыПроверкиПоИмениОсновнойТаблицы(Форма,
														ИмяТаблицы, 
														ЕстьТаблицаРаспределения, 
														ПолучатьЗаголовкиДляДокумента,
														ЕстьОбъемыВРаспределенииДоходов,
														ЕстьОбъемыВРаспределенииРасходов,
														ДоступКФинИнформации,
                                                        ВызовИзСтруктуры);
												
	Если Результат = Неопределено Тогда
		Возврат; // Возврат.
	КонецЕсли;	
	
	// Проверка основной таблицы.
    Если ВызовИзСтруктуры Тогда
        ОбъектФормы = Форма;
    Иначе
        ОбъектФормы = Форма.Объект;
    КонецЕсли;
    ПараметрыОсновнойТаблицы 		= Результат.ПараметрыОсновнойТаблицы;
	ПараметрыТаблицыРаспределения 	= Результат.ПараметрыТаблицыРаспределения;
	
	упоРаботаСФормамиКлиент.ПроверитьЗаполнениеТаблицы(ОбъектФормы, 
														ПараметрыОсновнойТаблицы.ИмяТаблицы, 
														ПараметрыОсновнойТаблицы.ПредставлениеТаблицы, 
														ПараметрыОсновнойТаблицы.СтруктураДляПроверки, 
														Отказ);															
	// Проверка таблицы распределения.													
	Если Не ЕстьТаблицаРаспределения Тогда
    	Возврат; // Возврат.
	КонецЕсли;	
								
	// Проверку делаем с привязкой к таблице-владельцу, чтобы корректно формировать номера строк в сообщениях об ошибках.
	Отбор = Новый Структура("ИндексСтрокиВладельца");
	Для Каждого СтрокаВладельца Из ОбъектФормы[ПараметрыОсновнойТаблицы.ИмяТаблицы] Цикл
					
		Если ЭтоПеренесеннаяСтрокаОсновнойТаблицы(ПараметрыОсновнойТаблицы.ИмяТаблицы, СтрокаВладельца, Истина) Тогда
			Продолжить;
		КонецЕсли;	
		
		Отбор.ИндексСтрокиВладельца = СтрокаВладельца.ИндексСтрокРаспределения;			
		
		упоРаботаСФормамиКлиент.ПроверитьЗаполнениеТаблицы(ОбъектФормы, 
													ПараметрыТаблицыРаспределения.ИмяТаблицыПоПодразделениям, 
													ПараметрыТаблицыРаспределения.ПредставлениеТаблицыПоПодразделениям,
													ПараметрыТаблицыРаспределения.СтруктураДляПроверкиПоПодразделениям,
													Отказ,
													Отбор);						
	КонецЦикла;																		
	
КонецПроцедуры

// Формирует структуру входящих параметров проверки для ПроверитьЗаполнениеОсновнойИСвязаннойТаблиц().
//
Функция ПараметрыПроверкиПоИмениОсновнойТаблицы(Форма,
												ИмяТаблицы, 
												ЕстьТаблицаРаспределения,
												ПолучатьЗаголовкиДляДокумента = Ложь,
												ЕстьОбъемыВРаспределенииДоходов = Ложь, 
												ЕстьОбъемыВРаспределенииРасходов = Ложь,
												ДоступКФинИнформации = "",
                                                ВызовИзСтруктуры) Экспорт
                                                
    Если ВызовИзСтруктуры Тогда
        ОбъектФормы = Форма;
    Иначе
        ОбъектФормы = Форма.Объект;
    КонецЕсли;
	ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТаблицы, ПолучатьЗаголовкиДляДокумента);
	
	Если Форма.ИмяФормы = "Справочник.упоШаблоныПроектныхЗадач.Форма.ФормаЭлементаУправляемая" Тогда
		ПроверятьПроектныеОпции = Ложь;
	Иначе
		ПроверятьПроектныеОпции = Истина;
		ПроектныеОпции = Форма.ПроектныеОпции;
	КонецЕсли;
	
	СтруктураДляПроверки = Новый Структура;
	Если ИмяТаблицы = "ПланДоходов" Тогда		
		СтруктураДляПроверки.Вставить("Статья", НСтр("ru = 'Статья доходов'"));
		СтруктураДляПроверки.Вставить("Валюта", НСтр("ru = 'Валюта'"));		
		СтруктураДляПроверки.Вставить("Сумма", 	НСтр("ru = 'Сумма'"));			
	ИначеЕсли ИмяТаблицы = "ПланРасходов" Тогда		
		СтруктураДляПроверки.Вставить("Статья", НСтр("ru = 'Статья затрат'"));
		СтруктураДляПроверки.Вставить("Валюта", НСтр("ru = 'Валюта'"));		
		СтруктураДляПроверки.Вставить("Сумма", 	НСтр("ru = 'Сумма'"));		
	ИначеЕсли ИмяТаблицы = "МатериальныеРесурсы" Тогда				
		СтруктураДляПроверки.Вставить("Ресурс", 	НСтр("ru = 'Номенклатура'"));
		СтруктураДляПроверки.Вставить("Валюта", 	НСтр("ru = 'Валюта'"));
		СтруктураДляПроверки.Вставить("ЕдиницаНормирования", НСтр("ru = 'Ед. изм.'"));			
		СтруктураДляПроверки.Вставить("Количество", НСтр("ru = 'Количество'"));				
		Если ОбъектФормы.ВключитьМатРесурсыВПланРасходов Тогда
			Если СтрНайти(ДоступКФинИнформации, "Редактирование") > 0 Тогда
				СтруктураДляПроверки.Вставить("Стоимость", 		НСтр("ru = 'Стоимость'"));				
			КонецЕсли;
			СтруктураДляПроверки.Вставить("СпособПривязки", НСтр("ru = 'Способ привязки'"));			 		
			СтруктураДляПроверки.Вставить("СтатьяЗатрат", 	НСтр("ru = 'Статья затрат'"));
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "Субпродукты" Тогда
		СтруктураДляПроверки.Вставить("Ресурс", НСтр("ru = 'Номенклатура'"));
		СтруктураДляПроверки.Вставить("Валюта", НСтр("ru = 'Валюта'"));
		СтруктураДляПроверки.Вставить("ЕдиницаНормирования", НСтр("ru = 'Ед. изм.'"));	
		СтруктураДляПроверки.Вставить("Количество", НСтр("ru = 'Количество'"));		
		Если ОбъектФормы.ВключитьСубпродуктыВПланДоходов Тогда
			СтруктураДляПроверки.Вставить("Стоимость", 		НСтр("ru = 'Стоимость'"));				
			СтруктураДляПроверки.Вставить("СпособПривязки", НСтр("ru = 'Способ привязки'"));
			СтруктураДляПроверки.Вставить("СтатьяДоходов", 	НСтр("ru = 'Статья доходов'"));
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "ДополнительныеЗатраты" Тогда				
		СтруктураДляПроверки.Вставить("СтатьяЗатрат", 	НСтр("ru = 'Статья затрат'"));
		СтруктураДляПроверки.Вставить("Стоимость", 	НСтр("ru = 'Стоимость'"));			
		Если ОбъектФормы.ВключитьДопЗатратыВПланРасходов Тогда
			СтруктураДляПроверки.Вставить("СпособПривязкиДоходовРасходов", НСтр("ru = 'Способ привязки'"));			 		
		КонецЕсли;
	Иначе 
		Возврат Неопределено; // Возврат.
	КонецЕсли;	
		
	ПараметрыОсновнойТаблицы = Новый Структура;
	ПараметрыОсновнойТаблицы.Вставить("ИмяТаблицы", 			ИмяТаблицы);
	ПараметрыОсновнойТаблицы.Вставить("ПредставлениеТаблицы", 	ПредставлениеТаблицы);
	ПараметрыОсновнойТаблицы.Вставить("СтруктураДляПроверки", 	СтруктураДляПроверки); 
	
	ПараметрыТаблицыРаспределения = Новый Структура;
	
	Если ЕстьТаблицаРаспределения Тогда
		
		ИмяТаблицыПоПодразделениям = упоПроектыИЗадачиОбщие.ИмяПодчиненнойТаблицыПоИмениОсновной(ИмяТаблицы, 
																								ПолучатьЗаголовкиДляДокумента);
		ПредставлениеТаблицыПоПодразделениям = 
			упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТаблицыПоПодразделениям, ПолучатьЗаголовкиДляДокумента);
			
		СтруктураДляПроверкиПоПодразделениям = Новый Структура;	
		Если ИмяТаблицы = "ПланДоходов" Тогда						
			
			СтруктураДляПроверкиПоПодразделениям.Вставить("СобствСилы_Субподряд", 	НСтр("ru = 'Собственные силы / субподряд'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("Сумма", 					НСтр("ru = 'Сумма'"));								
			Если ЕстьОбъемыВРаспределенииДоходов Тогда
				СтруктураДляПроверкиПоПодразделениям.Вставить("СпособПривязки", 	НСтр("ru = 'Способ привязки'"));
			КонецЕсли;
							
		ИначеЕсли ИмяТаблицы = "ПланРасходов" Тогда 
			
			СтруктураДляПроверкиПоПодразделениям.Вставить("СобствСилы_Субподряд", 	НСтр("ru = 'Собственные силы / субподряд'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("Сумма", 					НСтр("ru = 'Сумма'"));								
			Если ЕстьОбъемыВРаспределенииРасходов Тогда
				СтруктураДляПроверкиПоПодразделениям.Вставить("СпособПривязки", 	НСтр("ru = 'Способ привязки'"));
			КонецЕсли;

		ИначеЕсли ИмяТаблицы = "МатериальныеРесурсы" Тогда						
			
			СтруктураДляПроверкиПоПодразделениям.Вставить("СобствСилы_Субподряд", 	НСтр("ru = 'Собственные силы / субподряд'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("Количество", 			НСтр("ru = 'Количество'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("Сумма", 					НСтр("ru = 'Сумма'"));	

			ПроверятьСпособПривязки = Истина;
			Если ПроверятьПроектныеОпции Тогда
				ПроверятьСпособПривязки = ПроектныеОпции.РасходыПоНатуральнымПоказателям
					Или (ПроектныеОпции.РасходыПоОбъемам И ОбъектФормы.ВключитьМатРесурсыВПланРасходов);
			КонецЕсли;
				
			Если ПроверятьСпособПривязки Тогда
				СтруктураДляПроверкиПоПодразделениям.Вставить("СпособПривязки", НСтр("ru = 'Способ привязки'"));
			КонецЕсли;
			
			
		ИначеЕсли ИмяТаблицы = "Субпродукты" Тогда
									
			СтруктураДляПроверкиПоПодразделениям.Вставить("СобствСилы_Субподряд", 	НСтр("ru = 'Собственные силы / субподряд'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("СпособПривязки", 		НСтр("ru = 'Способ привязки'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("Количество", 			НСтр("ru = 'Количество'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("Сумма", 					НСтр("ru = 'Сумма'"));
			Если ПроверятьПроектныеОпции Тогда
				Если Форма.УказыватьПодразделениеРолиПриПланированииТР И ОбъектФормы.ТранслироватьЗатратыПоСубпродуктам Тогда
					СтруктураДляПроверкиПоПодразделениям.Вставить("Подразделение", 		НСтр("ru = 'Подразделение'"));
				КонецЕсли;
			КонецЕсли;	
		ИначеЕсли ИмяТаблицы = "ДополнительныеЗатраты" Тогда						
			
			ПроверятьСпособПривязки = Истина;
			Если ПроверятьПроектныеОпции Тогда
				ПроверятьСпособПривязки = ПроектныеОпции.РасходыПоОбъемам И Не ПроектныеОпции.РасходыПоНатуральнымПоказателям; 
			КонецЕсли; 
			
			СтруктураДляПроверкиПоПодразделениям.Вставить("СобствСилы_Субподряд",	НСтр("ru = 'Собственные силы / субподряд'"));
			СтруктураДляПроверкиПоПодразделениям.Вставить("Сумма", 					НСтр("ru = 'Сумма'"));
			Если ПроверятьСпособПривязки Тогда
				СтруктураДляПроверкиПоПодразделениям.Вставить("СпособПривязки", 	НСтр("ru = 'Способ привязки'"));
			КонецЕсли;
			
		Иначе			
			Возврат Неопределено; // Возврат.
		КонецЕсли;	                                   
				
		ПараметрыТаблицыРаспределения.Вставить("ИмяТаблицыПоПодразделениям", 			ИмяТаблицыПоПодразделениям);
		ПараметрыТаблицыРаспределения.Вставить("ПредставлениеТаблицыПоПодразделениям", 	ПредставлениеТаблицыПоПодразделениям);
		ПараметрыТаблицыРаспределения.Вставить("СтруктураДляПроверкиПоПодразделениям", 	СтруктураДляПроверкиПоПодразделениям);		
				
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыОсновнойТаблицы", 		ПараметрыОсновнойТаблицы);
	Результат.Вставить("ПараметрыТаблицыРаспределения", ПараметрыТаблицыРаспределения);
	
	Возврат Результат;
	
КонецФункции

// Проверяет совпадение суммы в строке-владельце и в подчиненной таблице распределения.
//
// Параметры:
//  Форма				 - УправляемаяФорма
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции
//  ИмяТаблицыВладельца	 - Строка
//
Процедура ПроверитьНеобходимостьПересчетаРаспределения(Форма, СтрокаТабличнойЧасти, ИмяТаблицыВладельца,
	ПоказатьОкноВопроса = Истина) Экспорт
	
	ВызовЗадачиИзСтруктурыПроекта = упоРаботаСФормамиКлиентСервер.ЭтоВызовЗадачиИзСтруктурыПроекта(Форма);
	ИменаДляДокументаПЗ = Не ВызовЗадачиИзСтруктурыПроекта;
	ИмяТаблицыРаспределения = упоПроектыИЗадачиОбщие.ИмяПодчиненнойТаблицыПоИмениОсновной(ИмяТаблицыВладельца, ИменаДляДокументаПЗ);
	Если ВызовЗадачиИзСтруктурыПроекта Тогда
		ТаблицаДанных = Форма[ИмяТаблицыРаспределения];
	Иначе
		ТаблицаДанных = Форма.Объект[ИмяТаблицыРаспределения];
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ИндексСтрокиВладельца", СтрокаТабличнойЧасти.ИндексСтрокРаспределения);
	НайденыеСтроки = ТаблицаДанных.НайтиСтроки(ПараметрыОтбора);
	Если Не ЗначениеЗаполнено(НайденыеСтроки) Тогда 
		Возврат;
	КонецЕсли;
	
	СуммаРаспределение = 0;
	Для каждого Строка Из НайденыеСтроки Цикл
		СуммаРаспределение = СуммаРаспределение + Строка.Сумма;
	КонецЦикла;
		
	ИмяКолонкиОбщСтоимость = "ОбщСтоимость";
	
	Если ИмяТаблицыВладельца = "ПланДоходов" Или ИмяТаблицыВладельца = "ПланРасходов"
		Или ИмяТаблицыВладельца = "Доходы" Или ИмяТаблицыВладельца = "Расходы"
		Или ИмяТаблицыВладельца = "ДоходныеОбъемы" Или ИмяТаблицыВладельца = "РасходныеОбъемы" Тогда
		ИмяКолонкиОбщСтоимость = "Сумма";	
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекДанные", СтрокаТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ИмяТаблицыВладельца", ИмяТаблицыВладельца);
	ДополнительныеПараметры.Вставить("ИмяТаблицыРаспределения", ИмяТаблицыРаспределения);
	ДополнительныеПараметры.Вставить("ТаблицаРаспределения", ТаблицаДанных);
	
	Если СуммаРаспределение <> СтрокаТабличнойЧасти[ИмяКолонкиОбщСтоимость] Тогда
		ИмяОповещения = "РаспределениеСтоимостиЗавершение";
		Если ИмяКолонкиОбщСтоимость = "Сумма" Тогда
			ТекстВопроса = нСтр("ru='Сумма текущей строки изменилась. 
			|Выполнить пересчет сумм в таблице распределения?'", "ru");
		Иначе
			ТекстВопроса = нСтр("ru='Общая стоимость текущей строки изменилась. 
			|Выполнить пересчет сумм в таблице распределения?'", "ru");
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения(ИмяОповещения, Форма, ДополнительныеПараметры);
		Если ПоказатьОкноВопроса Тогда
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			Форма.РаспределениеСтоимостиЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

// Проверяет строки на заполнение ед. изм. в таблице.
//
// Параметры:
//  Объект                     - УправляемаяФорма, ДанныеФормыСтруктура
//  ИмяТаблицы                 - Строка
//  СтрокаТабЧасти             - ДанныеФормыЭлементКоллекции
//  ИмяКолонкиНоменклатуры     - Строка
//  ИмяКолонкиЕдИзм            - Строка
//
Процедура ПроверитьНоменклатуруСтрокиНаЗаполнениеЕдИзмВТаблице(Объект,
		ИмяТаблицы,
		СтрокаТабЧасти = Неопределено,
		ИмяКолонкиНоменклатуры = "Ресурс",
		ИмяКолонкиЕдИзм = "ЕдиницаНормирования") Экспорт
	
	Таблица = Объект[ИмяТаблицы];
	ТекстСообщения = НСтр("ru = 'В карточке номенклатуры ''%1'' в строке №%2 не заполнена единица измерения.'");
	
	Если СтрокаТабЧасти <> Неопределено Тогда
		
		Если ТипЗнч(СтрокаТабЧасти[ИмяКолонкиНоменклатуры]) = Тип("СправочникСсылка.Номенклатура")
			И Не ЗначениеЗаполнено(СтрокаТабЧасти[ИмяКолонкиЕдИзм]) Тогда
			ИндексСтроки = Таблица.Индекс(СтрокаТабЧасти);
			НомерСтрокиДляСообщения = ИндексСтроки + 1;
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(СтрокаТабЧасти[ИмяКолонкиНоменклатуры]),
					НомерСтрокиДляСообщения);
			
			ПутьКДаннымПоляДляИнформации = ?(ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура"), "Объект", "");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ИмяТаблицы + "[" + ИндексСтроки
				+ "].ЕдиницаНормирования", ПутьКДаннымПоляДляИнформации);
		КонецЕсли;
		
	Иначе
		
		Для каждого Строка Из Таблица Цикл
			Если ТипЗнч(Строка[ИмяКолонкиНоменклатуры]) = Тип("СправочникСсылка.Номенклатура")
				И Не ЗначениеЗаполнено(Строка[ИмяКолонкиЕдИзм]) Тогда
				ИндексСтроки = Таблица.Индекс(Строка);
				НомерСтрокиДляСообщения = ИндексСтроки + 1;
				ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Строка[ИмяКолонкиНоменклатуры]),
						НомерСтрокиДляСообщения);
				
				ПутьКДаннымПоляДляИнформации = ?(ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура"), "Объект", "");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ИмяТаблицы + "[" + ИндексСтроки
					+ "].ЕдиницаНормирования", ПутьКДаннымПоляДляИнформации);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет поле объекта на заполнение ед. изм.
//
// Параметры:
//  Объект - УправляемаяФорма, ДанныеФормыСтруктура - владелец данных заполнения.
//  ИмяПоляНоменклатуры     - Строка
//  ИмяКолонкиЕдИзм            - Строка
//
Процедура ПроверитьНоменклатуруНаЗаполнениеЕдИзм(Объект,
		ИмяПоляНоменклатуры = "Ресурс",
		ИмяКолонкиЕдИзм = "ЕдиницаНормирования") Экспорт
	
	Если ТипЗнч(Объект[ИмяПоляНоменклатуры]) = Тип("СправочникСсылка.Номенклатура")
		И Не ЗначениеЗаполнено(Объект[ИмяКолонкиЕдИзм]) Тогда
		ТекстСообщения = НСтр("ru = 'В карточке номенклатуры ''%1'' не заполнена единица измерения.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(Объект[ИмяПоляНоменклатуры]));
		
		ПутьКДаннымПоляДляИнформации = ?(ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура"), "Объект", "");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ИмяКолонкиЕдИзм, ПутьКДаннымПоляДляИнформации);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет совпадение суммы в строке-владельце и в подчиненной таблице распределения проектной продукции.
//
// Параметры:
//  Форма				 - УправляемаяФорма
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции
//  ИмяТаблицыВладельца	 - Строка
//
Процедура ПроверитьНеобходимостьПересчетаРаспределенияПроектнойПродукции(Форма, СтрокаТабличнойЧасти, 
	ИмяТаблицыВладельца) Экспорт
		
	ВызовЗадачиИзСтруктурыПроекта = упоРаботаСФормамиКлиентСервер.ЭтоВызовЗадачиИзСтруктурыПроекта(Форма);
	ИменаДляДокументаПЗ = Не ВызовЗадачиИзСтруктурыПроекта;
	ИмяТаблицыРаспределения = упоПроектыИЗадачиОбщие.ИмяПодчиненнойТаблицыПоИмениОсновной(ИмяТаблицыВладельца, ИменаДляДокументаПЗ);
	
	Если ВызовЗадачиИзСтруктурыПроекта Тогда
		ТаблицаРаспределения = Форма[ИмяТаблицыРаспределения];
	Иначе
		ТаблицаРаспределения = Форма.Объект[ИмяТаблицыРаспределения];
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоКРаспределению = СтрокаТабличнойЧасти.Количество;
	СуммаКРаспределению = СтрокаТабличнойЧасти.ОбщСтоимость;
	КоэффициентыКРаспределению = Новый Массив;
	
	КоличествоРаспределение = 0;
	СуммаРаспределение = 0;
	Для Каждого ПодчиненнаяСтрока Из ТаблицаРаспределения Цикл
		Если ПодчиненнаяСтрока.ИндексСтрокиВладельца = СтрокаТабличнойЧасти.ИндексСтрокРаспределения Тогда
			КоэффициентыКРаспределению.Добавить(ПодчиненнаяСтрока.ПроцентРаспределения);
			КоличествоРаспределение = КоличествоРаспределение + ПодчиненнаяСтрока.Количество;
			СуммаРаспределение = СуммаРаспределение + ПодчиненнаяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоРаспределение <> КоличествоКРаспределению
		Или СуммаРаспределение <> СуммаКРаспределению Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанныеПП", СтрокаТабличнойЧасти);
		ДополнительныеПараметры.Вставить("КоэффициентыКРаспределению", КоэффициентыКРаспределению);
		ДополнительныеПараметры.Вставить("СуммаКРаспределению", СуммаКРаспределению);
		
		ИмяОповещения = "РаспределениеСтоимостиПП_Завершение";
		ТекстВопроса = нСтр("ru='Необходимо обновить данные в таблице распределения.
			|Выполнить пересчет сейчас?'", "ru");

		Оповещение = Новый ОписаниеОповещения(ИмяОповещения, Форма, ДополнительныеПараметры);		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаСДаннымиТрансляции

// Проверяет, является ли строка основной таблицы информационной (строкой трансляции).
//
// Параметры:
//  ИмяТаблицы				 - Строка		 - имя таблицы
//  ПроверяемаяСтрока		 - ДанныеФормыКоллекция	 - объект владелец данных заполнения.
//  ПроверятьИсточникПлана	 - Булево				 - признак необходимости дополнительной проверки по источнику плана.
//  ВыдаватьСообщение		 - Булево
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЭтоПеренесеннаяСтрокаОсновнойТаблицы(ИмяТаблицы, ПроверяемаяСтрока, ПроверятьИсточникПлана = Ложь, ВыдаватьСообщение = Ложь) Экспорт
	
	ЭтоПеренесеннаяСтрока = Ложь;
	ЭтоСтрокаТрансляции = Ложь;
	
	Если ПроверяемаяСтрока = Неопределено Тогда
		Возврат ЭтоПеренесеннаяСтрока;
	КонецЕсли;
	
	Если ПроверяемаяСтрока.Свойство("ИндексСтрокРаспределенияИсходнойТЧ") Тогда
		ЭтоПеренесеннаяСтрока = Не (ПроверяемаяСтрока.ИндексСтрокРаспределенияИсходнойТЧ = Неопределено);
	КонецЕсли;
	
	Если ПроверятьИсточникПлана Тогда
		
		Если ИмяТаблицы = "ТрудовыеРесурсыРоли" Тогда
			ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты");
		Иначе
			ИсточникПлана = Неопределено;
		КонецЕсли;
		
		ЭтоСтрокаТрансляции = упоРаботаСФормамиКлиентСервер.ЭтоСтрокаТрансляции(ПроверяемаяСтрока, ИмяТаблицы, ИсточникПлана);
		
		Если ЭтоСтрокаТрансляции И ВыдаватьСообщение Тогда
			ТекстСообщения = НСтр("ru = 'Нельзя изменять данные информационной строки.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;			
	
	КонецЕсли;
	
	Возврат ЭтоПеренесеннаяСтрока Или ЭтоСтрокаТрансляции;
	
КонецФункции

// Проверяет, является ли строка подчиненной таблицы информационной (строкой трансляции).
//
// Параметры:
//  Объект				 - ДанныеФормыКоллекция		 - объект владелец проверяемой таблицы.
//  ПроверяемаяСтрока	 - ДанныеФормыЭлементКоллекции	 - объект владелец данных заполнения.
//  РодительскаяТаблица	 - Строка - Имя таблицы-владельца.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЭтоПеренесеннаяСтрокаПодчиненнойТаблицы(Объект, ПроверяемаяСтрока, РодительскаяТаблица) Экспорт
	
	ЭтоПеренесеннаяСтрока = Ложь;
	
	Если ПроверяемаяСтрока = Неопределено Тогда
		Возврат ЭтоПеренесеннаяСтрока;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ИндексСтрокРаспределения", ПроверяемаяСтрока.ИндексСтрокиВладельца);
	НайденныеСтроки = Объект[РодительскаяТаблица].НайтиСтроки(СтруктураОтбора);
	Если НЕ НайденныеСтроки.Количество() = 0 Тогда
		СтрокаРодитель = НайденныеСтроки[0];
		ЭтоПеренесеннаяСтрока = НЕ (СтрокаРодитель.ИндексСтрокРаспределенияИсходнойТЧ = Неопределено);
	КонецЕсли;
	
	Возврат ЭтоПеренесеннаяСтрока;
	
КонецФункции

Процедура ПеренестиСтрокуИзОсновнойТаблицыВСвязаннуюСПодчиненными(Объект, ИсходнаяСтрока,
	ТаблицаРаспределенияОсновная, ТаблицаПриемникОсновная, ТаблицаПриемникРаспределения, 
	ТолькоПросмотр = Ложь, СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными = Неопределено, 
	ДополнительныеЗначения = Неопределено) Экспорт 
	
	СтруктураСоответствияКолонок = упоРаботаСФормамиКлиентСервер.ПолучитьСтруктуруСоответствияКолонокДляПереносаСтрок(
		ТаблицаПриемникОсновная, ТаблицаРаспределенияОсновная);
	
	НовыйИндексСтрокиВладельца = 
		упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(Объект[ТаблицаПриемникОсновная]);
	НовыйИндексСтрокиВладельца = ?(НовыйИндексСтрокиВладельца = 0, 1, НовыйИндексСтрокиВладельца);
	
	ЗначенияСвойствНС = Новый Структура("ИндексСтрокРаспределения", НовыйИндексСтрокиВладельца);
	// Перенос значений в соотв. колонки основной таблицы.
	Для Каждого КИЗ Из СтруктураСоответствияКолонок.СоотвКолонокОсновныхТаблиц Цикл
		ЗначенияСвойствНС.Вставить(КИЗ.Ключ, ИсходнаяСтрока[КИЗ.Значение]);
	КонецЦикла;
		
	ЗначенияСвойствНС.Вставить("ИсточникПлана", упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ТаблицаРаспределенияОсновная));
	
	Если ТаблицаРаспределенияОсновная = "РаспределениеДополнительныхЗатрат" Тогда		
		ВалютаПоУмолчанию = Неопределено;
		Если ЗначенияСвойствНС.Свойство("Договор") И ЗначениеЗаполнено(ЗначенияСвойствНС.Договор) Тогда			
			ВалютаПоУмолчанию =	упоРаботаСФормамиСервер.ВалютаПоДоговору(ЗначенияСвойствНС.Договор);	
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВалютаПоУмолчанию) И ТипЗнч(ДополнительныеЗначения) = Тип("Структура") Тогда
			ДополнительныеЗначения.Свойство("Валюта", ВалютаПоУмолчанию);			
		КонецЕсли;	
		ЗначенияСвойствНС.Вставить("Валюта", ВалютаПоУмолчанию);
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		Если СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными.Свойство(ТаблицаПриемникОсновная) Тогда
			мНовыхСтрокНС = СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными[ТаблицаПриемникОсновная];
		Иначе		
			мНовыхСтрокНС = Новый Массив;
			СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными.Вставить(ТаблицаПриемникОсновная);
		КонецЕсли;	
		мНовыхСтрокНС.Добавить(ЗначенияСвойствНС);
		СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными[ТаблицаПриемникОсновная] = мНовыхСтрокНС;
	Иначе
		НС = Объект[ТаблицаПриемникОсновная].Добавить();
		ЗаполнитьЗначенияСвойств(НС, ЗначенияСвойствНС);
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		Если СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными.Свойство(ТаблицаПриемникРаспределения) Тогда
			мНовыхСтрокНСР = СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными[ТаблицаПриемникРаспределения];
		Иначе		
			мНовыхСтрокНСР = Новый Массив;
			СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными.Вставить(ТаблицаПриемникРаспределения);
		КонецЕсли;	
	КонецЕсли;
		
	СтруктураОтбора = Новый Структура("ИндексСтрокиВладельца", ИсходнаяСтрока.ИндексСтрокРаспределения);
	НайденныеСтроки = Объект[ТаблицаРаспределенияОсновная].НайтиСтроки(СтруктураОтбора);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
        ЗначенияСвойствНСР = Новый Структура;
        
        ЗначенияСвойствНСР.Вставить("ИндексСтрокиВладельца", НовыйИндексСтрокиВладельца);
		// Перенос значений в соотв. колонки подчиненной таблицы.
		Для Каждого КИЗ Из СтруктураСоответствияКолонок.СоотвКолонокТаблицРаспределения Цикл
			ЗначенияСвойствНСР.Вставить(КИЗ.Ключ, НайденнаяСтрока[КИЗ.Значение]);
		КонецЦикла;		
		ЗначенияСвойствНСР.Вставить("ИсточникПлана", ЗначенияСвойствНС.ИсточникПлана);
		
		Если ТолькоПросмотр Тогда
			мНовыхСтрокНСР.Добавить(ЗначенияСвойствНСР);
		Иначе
			НСР = Объект[ТаблицаПриемникРаспределения].Добавить();
			ЗаполнитьЗначенияСвойств(НСР, ЗначенияСвойствНСР);
		КонецЕсли;
	КонецЦикла;

	Если ТолькоПросмотр Тогда
		СтруктураДляПереносаСтрокИзОсновнойТаблицыВСвязаннуюСПодчиненными[ТаблицаПриемникРаспределения] = мНовыхСтрокНСР;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДанныеТекущейСтрокиИзСвязаннойОсновнойТаблицы(Объект, 
	Форма, 
	ИсходнаяТЧОсновная, 
	СвязаннаяТЧОсновная, 
	СвязаннаяТЧПодчиненная = Неопределено) Экспорт
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрокТабЧасти(Объект, Форма, ИсходнаяТЧОсновная);
	
	Для Каждого ТекДанные Из ДанныеВыделенныхСтрок Цикл
	
		ИсточникПлана = упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ИсходнаяТЧОсновная, СвязаннаяТЧОсновная);
		
		ЕстьПодчиненнаяСвязанная = ЗначениеЗаполнено(СвязаннаяТЧПодчиненная);
		
		ПараметрыОтбора = Новый Структура("ИсточникПлана, ИндексСтрокРаспределенияИсходнойТЧ", 
			ИсточникПлана, ТекДанные.ИндексСтрокРаспределения);
		НайденныеСтроки = Объект[СвязаннаяТЧОсновная].НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого УдаляемаяСтрока Из НайденныеСтроки Цикл
			Если ЕстьПодчиненнаяСвязанная Тогда
				ОчиститьПеренесенныеСтрокиВПодчиненнойТЧ(УдаляемаяСтрока.ИндексСтрокРаспределения, Объект[СвязаннаяТЧПодчиненная]);
			КонецЕсли;
			Объект[СвязаннаяТЧОсновная].Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДанныеТекущейСтрокиИзСвязаннойПодчиненнойТаблицы(Объект, 
	Форма, 
	ИсходнаяТЧРаспределения, 
	СвязаннаяТЧРодительская, 
	СвязаннаяТЧПодчиненная,
	ВключеныИнформационныеСтрокиВПланДоходовИРасходовИДДС = Истина) Экспорт 
	
	Если НЕ ВключеныИнформационныеСтрокиВПланДоходовИРасходовИДДС Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрокТабЧасти(Объект, Форма, ИсходнаяТЧРаспределения);
	
	Для Каждого ТекДанные Из ДанныеВыделенныхСтрок Цикл
		
		ПараметрыОтбора = Новый Структура("ИсточникПлана, ИндексСтрокРаспределенияИсходнойТЧ", 
			упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ИсходнаяТЧРаспределения), ТекДанные.ИндексСтрокиВладельца);
			
		НайденныеСтроки = Объект[СвязаннаяТЧРодительская].НайтиСтроки(ПараметрыОтбора);
		Если НЕ НайденныеСтроки.Количество() = 0 Тогда
			ОчиститьПеренесенныеСтрокиВПодчиненнойТЧ(НайденныеСтроки[0].ИндексСтрокРаспределения, Объект[СвязаннаяТЧПодчиненная]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьПеренесенныеСтрокиВПодчиненнойТЧ(ИндексСтрокиВладельца, ТЧПодчиненная) Экспорт
	
	СтруктураОтбора = Новый Структура("ИндексСтрокиВладельца", ИндексСтрокиВладельца);
	НайденныеСтроки = ТЧПодчиненная.НайтиСтроки(СтруктураОтбора);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ТЧПодчиненная.Удалить(НайденнаяСтрока);
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьСвязаннуюПодчиненнуюТаблицу(Объект, 
	Форма, 
	ТаблицаРаспределенияОсновная, 
	СвязаннаяТаблица, 
	ТаблицаРаспределенияСвязанная,
	ВключеныИнформационныеСтрокиВПланДоходовИРасходовИДДС = Истина) Экспорт 
	
	Если НЕ ВключеныИнформационныеСтрокиВПланДоходовИРасходовИДДС Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрокТабЧасти(Объект, Форма, ТаблицаРаспределенияОсновная);
	ИсточникПлана = упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ТаблицаРаспределенияОсновная);
	Для Каждого ТекДанные Из ДанныеВыделенныхСтрок Цикл
	
		СтруктураОтбора = Новый Структура("ИсточникПлана, ИндексСтрокРаспределенияИсходнойТЧ", 
			ИсточникПлана, ТекДанные.ИндексСтрокиВладельца);
			
		НайденныеСтроки = Объект[СвязаннаяТаблица].НайтиСтроки(СтруктураОтбора);
		
		Если НЕ НайденныеСтроки.Количество() = 0 Тогда
			СтруктураСоответствияКолонок = упоРаботаСФормамиКлиентСервер.ПолучитьСтруктуруСоответствияКолонокДляПереносаСтрок(СвязаннаяТаблица);
		КонецЕсли;
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			СтруктураОтбораПодч = Новый Структура("ИндексСтрокиВладельца", НайденнаяСтрока.ИндексСтрокРаспределенияИсходнойТЧ);
			НайденныеПодчиненные = Объект[ТаблицаРаспределенияОсновная].НайтиСтроки(СтруктураОтбораПодч);
			Для каждого	ИсходнаяПодчиненная Из НайденныеПодчиненные Цикл
				НСР = Объект[ТаблицаРаспределенияСвязанная].Добавить();
				НСР.ИндексСтрокиВладельца = НайденнаяСтрока.ИндексСтрокРаспределения;
				НСР.ИсточникПлана = ИсточникПлана;
				// Перенос значений в соотв. колонки подчиненной таблицы.
				Для Каждого КИЗ Из СтруктураСоответствияКолонок.СоотвКолонокТаблицРаспределения Цикл
					НСР[КИЗ.Ключ] = ИсходнаяПодчиненная[КИЗ.Значение];
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПеренесенныеСтрокиИзСвязанныхТаблиц(Объект, ОсновнаяСвязаннаяТаблица, СвязаннаяТаблицаРаспределения, ИсточникПлана = Неопределено) Экспорт
		
	МассивУдаляемыхОсновных = Новый Массив;
	
	Для Каждого СтрТЧ Из Объект[ОсновнаяСвязаннаяТаблица] Цикл
		
		Если СтрТЧ.ИндексСтрокРаспределенияИсходнойТЧ = Неопределено Тогда
			Продолжить; // Строки внесены пользователем.
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИсточникПлана) И СтрТЧ.ИсточникПлана <> ИсточникПлана Тогда
			Продолжить; // Строки добавлены другим источником.
		КонецЕсли;						
		
		МассивУдаляемыхОсновных.Добавить(СтрТЧ);
		
		ОчиститьПеренесенныеСтрокиВПодчиненнойТЧ(СтрТЧ.ИндексСтрокРаспределения, Объект[СвязаннаяТаблицаРаспределения]);
				
	КонецЦикла;
	
	Для Каждого УдаляемаяОсновная Из МассивУдаляемыхОсновных Цикл
		Объект[ОсновнаяСвязаннаяТаблица].Удалить(УдаляемаяОсновная);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПеренесенныеСтрокиВСвязанныеТаблицы(Объект, ИмяИсходнойТаблицы, ИмяИсходнойТаблицыРаспределения,
	ИмяСвязаннойТаблицы, ИмяСвязаннойТаблицыРаспределения) Экспорт 
	
	Для Каждого ИсходнаяСтрока Из Объект[ИмяИсходнойТаблицы] Цикл
		ПеренестиСтрокуИзОсновнойТаблицыВСвязаннуюСПодчиненными(Объект, ИсходнаяСтрока,
			ИмяИсходнойТаблицыРаспределения, ИмяСвязаннойТаблицы, ИмяСвязаннойТаблицыРаспределения);
	КонецЦикла;
			
КонецПроцедуры	

Функция ПолучитьТекстВопросаОЗаменеЗначенияРеквизитаОбъект(МножественноеЧисло = Ложь) Экспорт
	
	ТекстСообщения = "";
	
	Если МножественноеЧисло Тогда
		ТекстСообщения = НСтр("ru = 'Реквизит ""Объект"" выбранной родительской задачи не соответствует текущему значению в 
		|перемещаемых проектных задачах. Заменить ""Объекты"" всех перемещаемых задач на ""Объект"" выбранной родительской задачи?'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Реквизит ""Объект"" выбранной родительской задачи не соответствует текущему значению в 
		|перемещаемой проектной задаче. Заменить ""Объект"" перемещаемой задачи на ""Объект"" выбранной родительской задачи?'");
	КонецЕсли;
		
	Возврат  ТекстСообщения;
	
КонецФункции

Процедура УдалитьДанныеТекущейСтрокиИзСвязаннойОсновнойТаблицыПоИсточнику(Объект, 
	Форма, 
	ИсходнаяТЧОсновная, 
	СвязаннаяТЧОсновная, 
	ИсточникПланаПоТаблице) Экспорт
	
	ДанныеВыделенныхСтрок = ДанныеВыделенныхСтрокТабЧасти(Объект, Форма, ИсходнаяТЧОсновная);
	
	Для Каждого ТекДанные Из ДанныеВыделенныхСтрок Цикл
		
		ПараметрыОтбора = Новый Структура("ИсточникПлана, ИндексСтрокРаспределенияИсходнойТЧ", 
			ИсточникПланаПоТаблице, ТекДанные.ИндексСтрокРаспределения);
		
		НайденныеСтроки = Объект[СвязаннаяТЧОсновная].НайтиСтроки(ПараметрыОтбора);
		Для Каждого УдаялемаяСтрока Из НайденныеСтроки Цикл
			Объект[СвязаннаяТЧОсновная].Удалить(УдаялемаяСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Обновляет ручное распределение мат. затрат в таблице распределения расходов
// (при ведении в проекте расходов по натуральным показателям).
//
// Параметры:
//  Объект                              - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения
//  ИмяОсновнойТаблицыПриемник          - Строка
//  ИмяТаблицыРаспределенияПриемник     - Строка
//  ИмяТаблицыРаспределенияИсточник     - Строка
//  ИмяТаблицыРаспределениеПоПериодам   - Строка
//  ДобавленныеКолонкиПериодовПриемника - СписокЗначений
//  ВызовИзСтруктуры                    - Булево
//
Процедура ОбновитьРучноеРаспределениеЗатратВРасходы(Объект,
														ИмяОсновнойТаблицыПриемник,
														ИмяТаблицыРаспределенияПриемник,
														ИмяТаблицыРаспределенияИсточник,
														ИмяТаблицыРаспределениеПоПериодам = Неопределено,
														ДобавленныеКолонкиПериодовПриемника,
														ВызовИзСтруктуры = Ложь) Экспорт
	
	СпособПривязкиВручную = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную");
													
	Если ИмяТаблицыРаспределенияИсточник = "РаспределениеПотребностей"
		Или ИмяТаблицыРаспределенияИсточник = "МатериальныеРесурсыПоПодразделениям" Тогда
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты");
	ИначеЕсли ИмяТаблицыРаспределенияИсточник = "РаспределениеДополнительныхЗатрат" Тогда
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты");
    КонецЕсли;
	
	ТаблицаИсточник = Объект[ИмяТаблицыРаспределенияИсточник];
	ОтборСтрок = Новый Структура("СпособПривязки", СпособПривязкиВручную);
	ЕстьРучноеРаспределение = ТаблицаИсточник.НайтиСтроки(ОтборСтрок).Количество() > 0;
	Если Не ЕстьРучноеРаспределение Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПриемник = Объект[ИмяТаблицыРаспределенияПриемник];
	Если Не ВызовИзСтруктуры Тогда
		РаспределениеРасходовПоПериодам = Объект[ИмяТаблицыРаспределениеПоПериодам];
	КонецЕсли;
	Для каждого СтрокаПриемник Из ТаблицаПриемник Цикл
		Если СтрокаПриемник.ИсточникПлана <> ИсточникПлана Или
			Не СтрокаПриемник.СпособПривязки = СпособПривязкиВручную Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаПриемник.ИндексСтрокРаспределенияПоПериодам = Неопределено Тогда
			ИндексСтрокРаспределенияПоПериодам =
				упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(ТаблицаПриемник,
					"ИндексСтрокРаспределенияПоПериодам");
			СтрокаПриемник.ИндексСтрокРаспределенияПоПериодам = ИндексСтрокРаспределенияПоПериодам;
		Иначе
			ИндексСтрокРаспределенияПоПериодам = СтрокаПриемник.ИндексСтрокРаспределенияПоПериодам;
		КонецЕсли;
		
		// Обнулим распределение для обновления данных.
		Если Не ВызовИзСтруктуры Тогда
			ПараметрыОтбора = Новый Структура("ИсточникПлана, ИндексСтрокиРаспределенияРасходов, ИндексСтрокиРаспределениеПоРолям",
					ИсточникПлана, СтрокаПриемник.ИндексСтрокРаспределенияПоПериодам, Неопределено);
			НайденныеСтрокиРаспределенияПоПериодам = РаспределениеРасходовПоПериодам.НайтиСтроки(ПараметрыОтбора);
			Для каждого СтрокаРаспределенияПоПериодам Из НайденныеСтрокиРаспределенияПоПериодам Цикл
				РаспределениеРасходовПоПериодам.Удалить(СтрокаРаспределенияПоПериодам);
			КонецЦикла;
		КонецЕсли;
		
		// Найдем строки распределения-источника.
		ПараметрыОтбора = Новый Структура("ИндексСтрокРаспределения", СтрокаПриемник.ИндексСтрокиВладельца);
		ОсновнаяСтрокаРасход = Объект[ИмяОсновнойТаблицыПриемник].НайтиСтроки(ПараметрыОтбора)[0];
		
		ПараметрыОтбора = Новый Структура("Роль, Подразделение, СобствСилы_Субподряд");
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаПриемник);
		ПараметрыОтбора.Вставить("ИндексСтрокиВладельца", ОсновнаяСтрокаРасход.ИндексСтрокРаспределенияИсходнойТЧ);
		СтрокиРаспределенияИсточник = ТаблицаИсточник.НайтиСтроки(ПараметрыОтбора);
		
		// Заполним данные.
		Для каждого Строка Из СтрокиРаспределенияИсточник Цикл
			Если ВызовИзСтруктуры Тогда
				Для каждого Колонка Из ДобавленныеКолонкиПериодовПриемника Цикл
					ИмяКолонки = Колонка.Значение;
					СтрокаПриемник[ИмяКолонки] = Строка[ИмяКолонки];
				КонецЦикла;
				
				Прервать;
			КонецЕсли;
			
			Если Строка.ИндексСтрокРаспределенияПоПериодам = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыОтбора = Новый Структура("ИсточникПлана, ИндексСтрокиРаспределенияРасходов, ИндексСтрокиРаспределениеПоРолям",
					ИсточникПлана, Неопределено, Строка.ИндексСтрокРаспределенияПоПериодам);
			СтрокиРаспределенияПоПериодам = РаспределениеРасходовПоПериодам.НайтиСтроки(ПараметрыОтбора);
			Для каждого ДанныеСтрокиРаспределенияПоПериоду Из СтрокиРаспределенияПоПериодам Цикл
				// Добавление новых строк вместо заполнения индекса по колонке ИндексСтрокиРаспределенияРасходов связано
				// с механизмом отображения данных в структуре проекта.
				НоваяСтрока = РаспределениеРасходовПоПериодам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтрокиРаспределенияПоПериоду);
				НоваяСтрока.ИндексСтрокиРаспределениеПоРолям = Неопределено;
				НоваяСтрока.ИндексСтрокиРаспределенияРасходов = ИндексСтрокРаспределенияПоПериодам;
				НоваяСтрока.Количество = 0;
				НоваяСтрока.ИсточникПлана = ИсточникПлана;
				
				ИмяКолонкиПериода =
					ДобавленныеКолонкиПериодовПриемника.НайтиПоЗначению(КонецДня(ДанныеСтрокиРаспределенияПоПериоду.Период)).Представление;
				СтрокаПриемник[ИмяКолонкиПериода] = ДанныеСтрокиРаспределенияПоПериоду.Сумма;
			КонецЦикла;
			
			ИндексСтрокРаспределенияПоПериодам = ИндексСтрокРаспределенияПоПериодам + 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьЗначениевТЧОбщая(Контекст, ОписаниеОповещения = Неопределено) Экспорт
	
	ИмяКоманды = Контекст.ИмяКоманды;
	ДозаполнитьДоговор = Ложь;
	
	Если ИмяКоманды = "МатериалыИОборудование_СпособПривязки" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("ПеречислениеСсылка.упоСпособПривязкиПоставокИСубпродуктов"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "СпособПривязкиПотребности";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_ЗадержкаЗаказа" Тогда
		
		ОписаниеТиповП = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "ЗадержкаЗаказа";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_СтатьяЗатрат" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.упоСтатьиЗатрат"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "СтатьяЗатрат";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_ПрофильРаспределения" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "МатериалыИОборудование_Контрагент" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.Контрагенты"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "МатериальныеРесурсы";
		ИмяКолонки = "Контрагент";
		ДозаполнитьДоговор = Истина;
		
	ИначеЕсли ИмяКоманды = "Субпродукты_СпособПривязки" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("ПеречислениеСсылка.упоСпособПривязкиПоставокИСубпродуктов"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "СпособПривязкиВыпуска";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_ЗадержкаЗаказа" Тогда
		
		ОписаниеТиповП = Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "ЗадержкаЗаказа";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_СтатьяДоходов" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоСтатьиДоходов"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "СтатьяДоходов";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_ПрофильРаспределения" Тогда
		
		МассивТиповПеречисление = Новый Массив;
		МассивТиповПеречисление.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТиповПеречисление);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "Субпродукты_Контрагент" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "Субпродукты";
		ИмяКолонки = "Контрагент";
		ДозаполнитьДоговор = Истина;
		
	ИначеЕсли ИмяКоманды = "ПланДоходов_УстановитьОбщийПрофиль" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "ПланДоходов";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "ПланРасходов_УстановитьОбщийПрофиль" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "ПланРасходов";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "РолиТР_УстановитьОбщийПрофиль" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияТрудозатрат"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "ТрудовыеРесурсы";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "ТрудовыеРесурсыРоли_УстановитьОбщийПрофиль" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоПрофилиРаспределенияТрудозатрат"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "ТрудовыеРесурсыРоли";
		ИмяКолонки = "ПрофильРаспределения";
		
	ИначеЕсли ИмяКоманды = "РаспределениеОбъемовЗаполнитьСССП" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоСобственныеСилыСубподряд"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "РаспределениеОбъемов";
		ИмяКолонки = "СобствСилы_Субподряд";
		
	ИначеЕсли ИмяКоманды = "СубпродуктыПоПодразделениямЗаполнитьСССП" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоСобственныеСилыСубподряд"));
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "СубпродуктыПоПодразделениям";
		ИмяКолонки = "СобствСилы_Субподряд";
		
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ЗаполнитьЗначениеВТЧ(Контекст.Объект, ИмяТЧ, ИмяКолонки, ОписаниеТиповП, ДозаполнитьДоговор,
		, , , ОписаниеОповещения);
	
КонецПроцедуры

Функция СтрокаДанныхДляРасчетаНДС(ТекущиеДанные, ИмяКолонкиСумма) Экспорт
	
	СтрокаВладелец = Новый Структура;
	СтрокаВладелец.Вставить("Валюта", ТекущиеДанные.Валюта); 
	СтрокаВладелец.Вставить("Договор", ТекущиеДанные.Договор);
	СтрокаВладелец.Вставить("ИндексСтрокРаспределения", ТекущиеДанные.ИндексСтрокРаспределения);
	Если ТекущиеДанные.Свойство("ИсточникПлана") Тогда
		СтрокаВладелец.Вставить("ИсточникПлана", ТекущиеДанные.ИсточникПлана);
	КонецЕсли;
	Если ТекущиеДанные.Свойство("СпособПривязки") Тогда
		СтрокаВладелец.Вставить("СпособПривязки", упоАналитикаПоПодразделениямКлиентСервер.
			СпособПривязкиРаспределенияПоСпособуПривязкиДоходаРасхода(ТекущиеДанные.СпособПривязки));
		СтрокаВладелец.Вставить("ПрофильРаспределения", ТекущиеДанные.ПрофильРаспределения);
		СтрокаВладелец.Вставить("ДатаПривязки", ТекущиеДанные.ДатаПривязки);
	КонецЕсли;
	СтрокаВладелец.Вставить("Сумма", ТекущиеДанные[ИмяКолонкиСумма]);
	
	Возврат СтрокаВладелец;
	
КонецФункции

Функция ЭтоСтрокаГруппировкиДинамическогоСписка(СтрокаДинамическогоСписка, ПоказатьПредупреждение = Ложь) Экспорт
	
	ЭтоСтрокаГруппировки = ТипЗнч(СтрокаДинамическогоСписка) = Тип("СтрокаГруппировкиДинамическогоСписка");
	
	Если ПоказатьПредупреждение И ЭтоСтрокаГруппировки Тогда
		ПоказатьПредупреждениеДействиеНедоступно();
	КонецЕсли;
	
	Возврат ЭтоСтрокаГруппировки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗаполнения

Функция ПараметрыТаблиц_ПроверкаДублей(Объект, Форма, ДопПараметры, Отказ)
	
	ГруппыРазделов = ДопПараметры.ГруппыРазделов;
	КолонкиПоПериодам = ДопПараметры.ГруппыРазделовКолонкиПоПериодам;
	ПредставлениеДляДокумента = ДопПараметры.ПредставлениеДляДокумента;
	
	КолонкаСуммыДДС = Новый Соответствие;
	Если ДопПараметры.Свойство("КолонкаСуммыДДС") Тогда
		КолонкаИсключение = ДопПараметры.КолонкаСуммыДДС;
	Иначе
		КолонкаИсключение = "СуммаВалютная";
	КонецЕсли;
	КолонкаСуммыДДС.Вставить("ДвиженияДенежныхСредств", КолонкаИсключение);
	КолонкаСуммыДДС.Вставить("ПланПоступлений", КолонкаИсключение);
	КолонкаСуммыДДС.Вставить("ПланВыплат", КолонкаИсключение);
	
	ЭтоШаблон = Ложь;
	Если ДопПараметры.Свойство("ЭтоШаблон") Тогда
		ЭтоШаблон = ДопПараметры.ЭтоШаблон;
	КонецЕсли;	
	
	ПараметрыТаблиц = Новый Массив;
	
	Для Каждого РазделНаПроверку Из ГруппыРазделов Цикл
		
		Если Форма.Элементы[РазделНаПроверку.Ключ].Видимость Тогда
			
			ИмяТЧ = РазделНаПроверку.Значение;
			ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТЧ, ПредставлениеДляДокумента);
							
			ПараметрТаблицы = Новый Структура;
			ПараметрТаблицы.Вставить("ТаблицаРаспределения", ИмяТЧ);
			ПредставлениеТаблицы = упоПроектыИЗадачиОбщие.ПредставлениеТабличнойЧастиЗадачи(ИмяТЧ, ПредставлениеДляДокумента);
			ПараметрТаблицы.Вставить("СинонимТаблицыРаспределения", ПредставлениеТаблицы);
			КолонкиИзмеренийТаблицы = КолонкиИзмерений(ИмяТЧ, Форма, ЭтоШаблон);
			ПараметрТаблицы.Вставить("КолонкиИзмерений", КолонкиИзмеренийТаблицы);
			КолонкиСуммТаблицы = КолонкиСумм(ИмяТЧ, Форма, КолонкиПоПериодам, КолонкаСуммыДДС, ЭтоШаблон);
			ПараметрТаблицы.Вставить("КолонкиСумм", КолонкиСуммТаблицы);
			
			ПараметрыТаблиц.Добавить(ПараметрТаблицы);
			
			Если ИмяТЧ = "МатериальныеРесурсы" Тогда
				РесурсыСРазнымиЕдиницами = Новый Массив;
				ЕстьОшибки = ЕстьРазныеЕдиницыИзмерения(Объект, ИмяТЧ, РесурсыСРазнымиЕдиницами);																		
				Если ЕстьОшибки Тогда
					СообщениеТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'В табличной части ""%1"" есть строки с одинаковой номенклатурой, но различными единицами измерения.
						|Необходимо привести единицы измерения одинаковых позиций к одному виду:
						|%2'"),
						ПредставлениеТаблицы, СтрСоединить(РесурсыСРазнымиЕдиницами, Символы.ПС));
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеТекст, , , , Отказ);
				КонецЕсли;
			КонецЕсли;			
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ПараметрыТаблиц;
	
КонецФункции	

Функция ЕстьРазныеЕдиницыИзмерения(Объект, ИмяТаблицы, РесурсыСРазнымиЕдиницами = Неопределено)
	
	ЕстьРазные = Ложь;
	
	ФормироватьМассивОшибок = ТипЗнч(РесурсыСРазнымиЕдиницами) = Тип("Массив");
	
	РесурсыСоответствие = Новый Соответствие;	
	Для Каждого СтрокаТаблицы Из Объект[ИмяТаблицы] Цикл
		Если РесурсыСоответствие[СтрокаТаблицы.Ресурс] = Неопределено Тогда			
			ВидОперацииСоответствие = Новый Соответствие;
			ВидОперацииСоответствие.Вставить(СтрокаТаблицы.ВидОперации, СтрокаТаблицы.ЕдиницаНормирования);
			РесурсыСоответствие.Вставить(СтрокаТаблицы.Ресурс, ВидОперацииСоответствие);
		ИначеЕсли РесурсыСоответствие[СтрокаТаблицы.Ресурс][СтрокаТаблицы.ВидОперации] = Неопределено Тогда
			РесурсыСоответствие[СтрокаТаблицы.Ресурс].Вставить(СтрокаТаблицы.ВидОперации, СтрокаТаблицы.ЕдиницаНормирования);
		Иначе
			Если РесурсыСоответствие[СтрокаТаблицы.Ресурс][СтрокаТаблицы.ВидОперации] <> СтрокаТаблицы.ЕдиницаНормирования Тогда
				ЕстьРазные = Истина;
				Если ФормироватьМассивОшибок И РесурсыСРазнымиЕдиницами.Найти(СтрокаТаблицы.Ресурс) = Неопределено Тогда
					РесурсыСРазнымиЕдиницами.Добавить(СтрокаТаблицы.Ресурс);
				КонецЕсли;					
			КонецЕсли;				
		КонецЕсли;							
	КонецЦикла;
	
	Возврат ЕстьРазные;
	
КонецФункции

Функция КолонкиИзмерений(ИмяТаблицы, Форма, ЭтоШаблон = Ложь)
		
	ВозврКолонкиИзмерений = "";
	Если ИмяТаблицы = "РаспределениеОбъемов" Или ИмяТаблицы = "СубпродуктыПоПодразделениям" Тогда
		ВозврКолонкиИзмерений = "ДатаПривязки, ИндексСтрокиВладельца, 
							|КонтрагентПодрядчик, Подразделение, ПрофильРаспределения, Роль,
							|СобствСилы_Субподряд, СпособПривязки";
		Если Не ЭтоШаблон  Тогда
			ВозврКолонкиИзмерений = ВозврКолонкиИзмерений + ", ЗаказДоговорПодрядчика, ИсполнительКонтрагент";
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "РаспределениеПотребностей" Или ИмяТаблицы = "МатериальныеРесурсыПоПодразделениям" Тогда
		ВозврКолонкиИзмерений = "СобствСилы_Субподряд, Роль, Подразделение, ПрофильРаспределения, ДатаПривязки, ИндексСтрокиВладельца,
							|СпособПривязки";
	ИначеЕсли ИмяТаблицы = "РаспределениеРасходов" Или ИмяТаблицы = "ПланРасходовПоПодразделениям" Тогда
		ВозврКолонкиИзмерений = "СобствСилы_Субподряд, Роль, Подразделение, ИндексСтрокиВладельца";
		Если Не ЭтоШаблон  Тогда
			ВозврКолонкиИзмерений = ВозврКолонкиИзмерений + ", ИсточникПлана";
		КонецЕсли;
		РаспределениеРасходов = Форма.Элементы.Найти("РаспределениеРасходовГруппаОбъемыПоПодразделениям");
		Если РаспределениеРасходов = Неопределено Тогда
			РаспределениеРасходов = Форма.Элементы.Найти("ПланРасходовПоПодразделениямГруппаОбъемы");
		КонецЕсли;
		Если РаспределениеРасходов <> Неопределено И РаспределениеРасходов.Видимость Тогда
			ВозврКолонкиИзмерений = ВозврКолонкиИзмерений + ", СпособПривязки, ДатаПривязки";
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "ДополнительныеЗатраты" Тогда
		ВозврКолонкиИзмерений = "СтатьяЗатрат, ВидОперации, Комментарий";
	ИначеЕсли ИмяТаблицы = "РаспределениеДоходов" Или ИмяТаблицы = "ПланДоходовПоПодразделениям" Тогда
		ВозврКолонкиИзмерений = "СобствСилы_Субподряд, Роль, Подразделение, ИндексСтрокиВладельца,
							|КонтрагентПодрядчик";
		Если Не ЭтоШаблон  Тогда
			ВозврКолонкиИзмерений = ВозврКолонкиИзмерений + ", ЗаказДоговорПодрядчика, ИсполнительКонтрагент";
		КонецЕсли;
		РаспределениеДоходов = Форма.Элементы.Найти("РаспределениеДоходовГруппаОбъемыПоПодразделениям");
		Если РаспределениеДоходов = Неопределено Тогда
			РаспределениеДоходов = Форма.Элементы.Найти("ПланДоходовПоПодразделениямГруппаОбъемы");
		КонецЕсли;
		Если РаспределениеДоходов <> Неопределено И РаспределениеДоходов.Видимость Тогда
			ВозврКолонкиИзмерений = ВозврКолонкиИзмерений + ", СпособПривязки, ДатаПривязки";
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "МатериальныеРесурсы" Тогда
		ВозврКолонкиИзмерений = "Ресурс, ЕдиницаНормирования, ВидОперации, СтатьяЗатрат, Валюта, ДатаЗаказа, 
							|ПрофильРаспределения, Контрагент, Договор, СпособПривязкиПотребности, ЗадержкаЗаказа,
							|ДатаПривязки, СпособПривязки, Стоимость";
	ИначеЕсли ИмяТаблицы = "Субпродукты" Тогда
		ВозврКолонкиИзмерений = "Ресурс, ЕдиницаНормирования, СтатьяДоходов, Валюта, ДатаВыпуска, 
							|ПрофильРаспределения, Контрагент, Договор, СпособПривязкиВыпуска, ЗадержкаЗаказа,
							|ДатаПривязки, СпособПривязки, Стоимость";	
	//ИначеЕсли ИмяТаблицы = "ДополнительныеЗатраты" Тогда
	//	ВозврКолонкиИзмерений = "СтатьяЗатрат, ВидОперации, КонтрагентДоходовРасходов, ДоговорДоходовРасходов, СпособПривязкиДоходовРасходов,  
	//						|ПрофильРаспределенияДоходовРасходов, ДатаПривязкиДоходовРасходов, ИндексСтрокРаспределения, Комментарий";
	ИначеЕсли ИмяТаблицы = "РаспределениеДополнительныхЗатрат" Тогда
		ВозврКолонкиИзмерений = "Подразделение, Роль, СобствСилы_Субподряд,  
							|КонтрагентПодрядчик, ИндексСтрокиВладельца";
		Если Не ЭтоШаблон  Тогда
			ВозврКолонкиИзмерений = ВозврКолонкиИзмерений + ", ЗаказДоговорПодрядчика";
		КонецЕсли;
		Если Форма.Элементы.РаспределениеДополнительныхЗатратГруппаОбъемыПоПодразделениям.Видимость Тогда
			ВозврКолонкиИзмерений = ВозврКолонкиИзмерений + ", СпособПривязки, ДатаПривязки";
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "Трудозатраты" Тогда
		ВозврКолонкиИзмерений = "Роль, УровеньПланирования";
	ИначеЕсли ИмяТаблицы = "ДвиженияДенежныхСредств" Тогда
		ВозврКолонкиИзмерений = "СтатьяДДС, Контрагент, Договор, НаправлениеДвижения, ВидПлатежа, СпособПривязки, Задержка,
								|Валюта, ДатаПривязки, ПрофильРаспределения, ИсточникПлана";
	ИначеЕсли ИмяТаблицы = "ПланПоступлений" Или ИмяТаблицы = "ПланВыплат" Тогда
		ВозврКолонкиИзмерений = "Статья, Контрагент, ВидПлатежа, СпособПривязки, Задержка, Валюта, ПрофильРаспределения";
	КонецЕсли;
	
	Возврат ВозврКолонкиИзмерений;
	
КонецФункции

Функция ЗанулитьТаблицуПоПериодам(ИмяТаблицы, СтрокаТЧ)
	
	ЗанулитьТаблицуПоПериодам = Ложь;
	
	ЭтоРаспределениеРасходов = ИмяТаблицы = "РаспределениеРасходов" Или ИмяТаблицы = "ПланРасходовПоПодразделениям";
	ЭтоРаспределениеДоходов = ИмяТаблицы = "РаспределениеДоходов" Или ИмяТаблицы = "ПланДоходовПоПодразделениям";
	ЭтоРаспределениеМатЗатрат = ИмяТаблицы = "РаспределениеПотребностей" Или ИмяТаблицы = "МатериальныеРесурсыПоПодразделениям";
	ЭтоРаспределениеДополнительныхЗатрат = ИмяТаблицы = "РаспределениеДополнительныхЗатрат";
	ЭтоРаспределениеОбъемов = ИмяТаблицы = "РаспределениеОбъемов" Или ИмяТаблицы = "СубпродуктыПоПодразделениям";
	
	Если ЭтоРаспределениеРасходов
		Или ЭтоРаспределениеДоходов
		Или ЭтоРаспределениеМатЗатрат
		Или ЭтоРаспределениеДополнительныхЗатрат
		Или ЭтоРаспределениеОбъемов Тогда
			
	ЗанулитьТаблицуПоПериодам = СтрокаТЧ.СпособПривязки <> ПредопределенноеЗначение(
		"Перечисление.упоСпособПривязкиРаспределения.Вручную"); 
		
	КонецЕсли;
	
	Возврат ЗанулитьТаблицуПоПериодам;
	
КонецФункции

Функция КолонкиСумм(ИмяТаблицы, Форма, КолонкиПоПериодам, КолонкаСуммыДДС, ЭтоШаблон = Ложь)
	
	ВозврКолонкиСумм = "";
	МассивСтрок = Новый Массив;
	Если ИмяТаблицы = "МатериальныеРесурсы" Или ИмяТаблицы = "Субпродукты" Тогда
		МассивСтрок.Добавить("Количество, ОбщСтоимость");
		ЭтоПроектнаяПродукция = Форма.ТипПродуктаЧисло = 1;
		Если ИмяТаблицы = "Субпродукты" И ЭтоПроектнаяПродукция Тогда
			МассивСтрок.Добавить("Нормирование, Трудоемкость");
			Если ЭтоШаблон Тогда
				МассивСтрок.Добавить("СкоростьВыполнения, Скорость");			
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли ИмяТаблицы = "ДополнительныеЗатраты" Тогда
		МассивСтрок.Добавить("Стоимость");
	ИначеЕсли ИмяТаблицы = "РаспределениеДополнительныхЗатрат" Тогда
		МассивСтрок.Добавить("Сумма");
		Если Форма.Элементы.РаспределениеДополнительныхЗатратГруппаОбъемыПоПодразделениям.Видимость Тогда
			МассивСтрок.Добавить("СуммаОстаток, СуммаРаспределено");
		КонецЕсли;	
	ИначеЕсли ИмяТаблицы = "РаспределениеОбъемов" Или ИмяТаблицы = "РаспределениеПотребностей"
		Или ИмяТаблицы = "СубпродуктыПоПодразделениям" Или ИмяТаблицы = "МатериальныеРесурсыПоПодразделениям" Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить("Количество, Сумма");
		Если ИмяТаблицы = "РаспределениеОбъемов" Или ИмяТаблицы = "РаспределениеПотребностей" Тогда
			МассивСтрок.Добавить("КоличествоОстаток, СуммаОстаток, КоличествоРаспределено, СуммаРаспределено");			
		Иначе
			МассивСтрок.Добавить("НеРаспределеноКоличество, НеРаспределеноСумма, РаспределеноКоличество, РаспределеноСумма");
		КонецЕсли;
		ЭтоПроектнаяПродукция = Форма.ТипПродуктаЧисло = 1;
		Если (ИмяТаблицы = "РаспределениеОбъемов" Или ИмяТаблицы = "СубпродуктыПоПодразделениям")
			И ЭтоПроектнаяПродукция Тогда
			МассивСтрок.Добавить("Нормирование, Трудоемкость");	
		КонецЕсли;	
	ИначеЕсли ИмяТаблицы = "РаспределениеДоходов" Или ИмяТаблицы = "РаспределениеРасходов"
		Или ИмяТаблицы = "ПланРасходовПоПодразделениям" Или ИмяТаблицы = "ПланДоходовПоПодразделениям" Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить("Сумма");
		Если ИмяТаблицы = "ПланРасходовПоПодразделениям" Или ИмяТаблицы = "ПланДоходовПоПодразделениям" Тогда
			МассивСтрок.Добавить("НеРаспределеноСумма, РаспределеноСумма");
		ИначеЕсли (ИмяТаблицы = "РаспределениеДоходов" И Форма.Элементы.РаспределениеДоходовГруппаОбъемыПоПодразделениям.Видимость)
				Или (ИмяТаблицы = "РаспределениеРасходов" И Форма.Элементы.РаспределениеРасходовГруппаОбъемыПоПодразделениям.Видимость) Тогда
			МассивСтрок.Добавить("СуммаОстаток, СуммаРаспределено");
		КонецЕсли;
	ИначеЕсли ИмяТаблицы = "ДвиженияДенежныхСредств" Или ИмяТаблицы = "ПланПоступлений"
		Или ИмяТаблицы = "ПланВыплат" Тогда
		ИмяКолонки = КолонкаСуммыДДС[ИмяТаблицы];
		Если ИмяКолонки <> Неопределено Тогда
			МассивСтрок.Добавить(ИмяКолонки);	
		КонецЕсли;
	КонецЕсли;
		
	ВозврКолонкиСумм = СтрСоединить(МассивСтрок, ",");
	
	Возврат ВозврКолонкиСумм;
	
КонецФункции

#КонецОбласти

#Область ПроектнаяПродукция

// Удаляет из массива строки, содержащие шаблоны проектной продукции.
//
// Параметры:
//  СтрокиСубпродуктов - Массив - Массив на основе отбора по табличной части "Субпродукты" 
//
Процедура УдалитьШаблоныПроектнойПродукцииИзСубпродуктов(СтрокиСубпродуктов)
	
	МассивШаблонов = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиСубпродуктов Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Ресурс) Тогда
			МассивШаблонов.Добавить(СтрокаТаблицы.Ресурс);
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеЗаполнено(МассивШаблонов) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитШаблон = упоФункцииБСП.ЗначениеРеквизитаОбъектовВызовСервера(МассивШаблонов, "Шаблон");
	
	Индекс = СтрокиСубпродуктов.Количество() - 1;
	Пока Индекс >= 0 Цикл 
		
		СтрокаТаблицы = СтрокиСубпродуктов[Индекс];
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Ресурс) Тогда
			Продолжить;
		КонецЕсли;
		
		Шаблон = РеквизитШаблон.Получить(СтрокаТаблицы.Ресурс);
		Если Шаблон Тогда 
			СтрокиСубпродуктов.Удалить(Индекс);
		КонецЕсли; 
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭлементыДляПроверкиВозможностиРедактированияПроектнойПродукции(ЭтоСтруктураПроекта)
	
	ОбрабатываемыеЭлементы = Новый Массив;
	
	ОбрабатываемыеЭлементы.Добавить("СубпродуктыКоличество");
	ОбрабатываемыеЭлементы.Добавить("СубпродуктыНормирование");
	ОбрабатываемыеЭлементы.Добавить("СубпродуктыКоэффициентСложности");
	ОбрабатываемыеЭлементы.Добавить("СубпродуктыТрудоемкость");
	
	Если ЭтоСтруктураПроекта Тогда
		ИмяТаблицыРаспределения = "СубпродуктыПоПодразделениям";
	Иначе
		ИмяТаблицыРаспределения = "РаспределениеОбъемов";
	КонецЕсли;
	
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "Роль");
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "Подразделение");
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "Количество");
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "ПроцентРаспределения");
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "Сумма");
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "Нормирование");
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "КоэффициентСложности");
	ОбрабатываемыеЭлементы.Добавить(ИмяТаблицыРаспределения + "Трудоемкость");
	
	Возврат ОбрабатываемыеЭлементы;
	
КонецФункции

#КонецОбласти

Функция ПолучитьИмяРеквизитаДляОтбора()

	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		Возврат "Контрагент";
	Иначе
		Возврат "Владелец";
	КонецЕсли;

КонецФункции

Функция ПолучитьСтруктуруПараметровДляДатФакта(ИмяЭлемента)
	
	ДопПараметры = Новый Структура("ПараметрСообщения1, ПараметрСообщения2, ПараметрСообщения3", 
		"", "", "");
	Если ИмяЭлемента = "ПроектныеЗадачиДатаНачалаФакт" Тогда 
		ДопПараметры.Вставить("ПараметрСообщения1", НСтр("ru = 'начала'"));
		ДопПараметры.Вставить("ПараметрСообщения2", НСтр("ru = 'больше'"));
		ДопПараметры.Вставить("ПараметрСообщения3", НСтр("ru = 'завершения'"));
	ИначеЕсли ИмяЭлемента = "ПроектныеЗадачиДатаЗавершенияФакт" Тогда
		ДопПараметры.Вставить("ПараметрСообщения1", НСтр("ru = 'завершения'"));
		ДопПараметры.Вставить("ПараметрСообщения2", НСтр("ru = 'меньше'"));
		ДопПараметры.Вставить("ПараметрСообщения3", НСтр("ru = 'начала'"));		
	ИначеЕсли ИмяЭлемента = "ДеревоЗадачДатаНачалаФакт" Тогда
		ДопПараметры.Вставить("ПараметрСообщения1", НСтр("ru = 'начала'"));
		ДопПараметры.Вставить("ПараметрСообщения2", НСтр("ru = 'больше'"));
		ДопПараметры.Вставить("ПараметрСообщения3", НСтр("ru = 'окончания'"));		
	ИначеЕсли ИмяЭлемента = "ДеревоЗадачДатаЗавершенияФакт" Тогда
		ДопПараметры.Вставить("ПараметрСообщения1", НСтр("ru = 'окончания'"));
		ДопПараметры.Вставить("ПараметрСообщения2", НСтр("ru = 'меньше'"));
		ДопПараметры.Вставить("ПараметрСообщения3", НСтр("ru = 'начала'"));
	КонецЕсли;
	
	Возврат ДопПараметры;
	
КонецФункции

Процедура ИзменитьПроверяемуюДатуПоляИВывестиСообщение(СтрокаТаблицы, Дата, ИмяЭлемента, ДопПараметрыСообщения)
		
	ПараметрСообщения1 = ДопПараметрыСообщения.ПараметрСообщения1; 
	ПараметрСообщения2 = ДопПараметрыСообщения.ПараметрСообщения2;
	ПараметрСообщения3 = ДопПараметрыСообщения.ПараметрСообщения3;
	
	СтрокаТаблицы[ИмяЭлемента] = Дата;
		
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Фактическая дата %1 не может быть %2 фактической даты %3'"),
	    	ПараметрСообщения1, ПараметрСообщения2, ПараметрСообщения3));	
	
КонецПроцедуры

Процедура УстановитьДанныеСтрокиПоРодителю(СтрокаДляАгрегирования, Объект, ИмяТаблицыВладельца)
		
	Если Не ЗначениеЗаполнено(ИмяТаблицыВладельца) Тогда
		Возврат;
	КонецЕсли;	
	
	ОтборСтрок = Новый Структура("ИндексСтрокРаспределения", СтрокаДляАгрегирования.ИндексСтрокиВладельца);
	НайденныеСтрокиВладелец = Объект[ИмяТаблицыВладельца].НайтиСтроки(ОтборСтрок);
	Если НайденныеСтрокиВладелец.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ИмяКолонкиСпособаПривязки = "СпособПривязки";
	Если ИмяТаблицыВладельца = "ДополнительныеЗатраты" Тогда 
		СоответствиеКолонокПолное = упоРаботаСФормамиКлиентСервер.ПолучитьСтруктуруСоответствияКолонокДляПереносаСтрок("ПланРасходов", ИмяТаблицыВладельца);
		СоответствиеКолонок = СоответствиеКолонокПолное.СоотвКолонокОсновныхТаблиц;
		СтрокаДляАгрегирования.ПрофильРаспределения = НайденныеСтрокиВладелец[0][СоответствиеКолонок.ПрофильРаспределения];
		СтрокаДляАгрегирования.ДатаПривязки = НайденныеСтрокиВладелец[0][СоответствиеКолонок.ДатаПривязки];
		ИмяКолонкиСпособаПривязки = СоответствиеКолонок.СпособПривязки;
	Иначе
		ЗаполнитьЗначенияСвойств(СтрокаДляАгрегирования, НайденныеСтрокиВладелец[0], "ПрофильРаспределения, ДатаПривязки");
	КонецЕсли;
	
	Если ТипЗнч(СтрокаДляАгрегирования.СпособПривязки) = Тип("ПеречислениеСсылка.упоСпособПривязкиРаспределения") Тогда
		Если НайденныеСтрокиВладелец[0][ИмяКолонкиСпособаПривязки] = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
			СтрокаДляАгрегирования.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
		ИначеЕсли НайденныеСтрокиВладелец[0][ИмяКолонкиСпособаПривязки] = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда
			СтрокаДляАгрегирования.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НужноПереместитьСтроку(ВыделенныеСтроки, ВыделеннаяСтрока, Индекс, Сдвиг)
	
	Если ВыделенныеСтроки.Количество() > 1 И Индекс > 0 
		И (ВыделеннаяСтрока.Значение + Сдвиг) = ВыделенныеСтроки[Индекс - 1].Значение Тогда				
		Возврат Ложь;			
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

Функция ВеличинаСдвига(ИндексТекущейСтроки, ТабличнаяЧасть, ОтборСтрокЭлемента, НаправлениеСдвига)
		
	Сдвиг = 0;
	
	МаксимальныйИндекс = ТабличнаяЧасть.Количество();
	
	Пока Истина Цикл
		
		Сдвиг = Сдвиг + НаправлениеСдвига;
		
		Если ИндексТекущейСтроки + Сдвиг < 0
			Или ИндексТекущейСтроки + Сдвиг >= МаксимальныйИндекс Тогда
			Возврат 0;
		КонецЕсли;
				
		Если ОтборСтрокЭлемента = Неопределено Тогда
			Прервать;
		КонецЕсли;	
		
		НайденаСтрокаУдовлетворяющаяОтбору = Истина;
		Для Каждого ЭлементОтбора Из ОтборСтрокЭлемента Цикл
			Если ТабличнаяЧасть[ИндексТекущейСтроки + Сдвиг][ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
				НайденаСтрокаУдовлетворяющаяОтбору = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденаСтрокаУдовлетворяющаяОтбору Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Сдвиг;
	
КонецФункции

Функция ДанныеВыделенныхСтрокТабЧасти(Объект, Форма, ИмяТЧ)
	
	ДанныеВыделенныхСтрок = Новый Массив;
	
	ВыделенныеСтроки = Форма.Элементы[ИмяТЧ].ВыделенныеСтроки;
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Возврат ДанныеВыделенныхСтрок;
	КонецЕсли;
	
	ТабЧасть = Объект[ИмяТЧ];
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		Если ВыделеннаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТекДанные = ТабЧасть.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ТекДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеВыделенныхСтрок.Добавить(ТекДанные);
	КонецЦикла;
	
	Возврат ДанныеВыделенныхСтрок;
	
КонецФункции

Процедура ПоказатьПредупреждениеДействиеНедоступно()
	
	ПоказатьПредупреждение(,НСтр("ru = 'Действие недоступно для строки группировки списка!'"));
	
КонецПроцедуры

Процедура ОбнулитьРаспределениеПоПериодамСтрокиПланаПроектнойЗадачи(Объект, Форма, СтрокаТаблицы,
			ИмяТаблицыРаспределения, ИмяТаблицыПериоды, ИмяКолонкиИндекса)
	
	упоАналитикаПоПодразделениямКлиент.ОчиститьСтрокиРаспределенияПоПериодам(Форма.Объект, Форма,
		ИмяТаблицыРаспределения, ИмяТаблицыПериоды, ИмяКолонкиИндекса, СтрокаТаблицы);
	
	ЕстьКолонкиСуммы = Истина;
	ЕстьКолонкиКоличество = Истина;
	
	Если ИмяТаблицыРаспределения = "РаспределениеДоходов" Или ИмяТаблицыРаспределения = "РаспределениеРасходов" Или
		ИмяТаблицыРаспределения = "РаспределениеДополнительныхЗатрат" Тогда
		ЕстьКолонкиКоличество = Ложь;
	КонецЕсли;
	
	Если ЕстьКолонкиКоличество Тогда
		СтрокаТаблицы.КоличествоРаспределено = 0;
		СтрокаТаблицы.КоличествоОстаток = 0;
	КонецЕсли;
	
	Если ЕстьКолонкиСуммы Тогда
		СтрокаТаблицы.СуммаРаспределено = 0;
		СтрокаТаблицы.СуммаОстаток = 0;
	КонецЕсли;
	
	КолонкиПериодов = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СоответствиеРазделовКолонкиПоПериодам") Тогда
		ЕстьСозданныеКолонкиПериодов = Форма.СоответствиеРазделовКолонкиПоПериодам.Свойство(ИмяТаблицыРаспределения);
		
		Если ЕстьСозданныеКолонкиПериодов Тогда
			ДобавленныеКолонки = Форма.СоответствиеРазделовКолонкиПоПериодам[ИмяТаблицыРаспределения];
			Для Каждого СтрокаКолонки Из ДобавленныеКолонки Цикл
				КолонкиПериодов.Добавить(СтрокаКолонки.Представление);
			КонецЦикла;
		КонецЕсли;
	Иначе // Для шаблона ПЗ.
		ДобавленныеЭлементыПериодов =
			упоРаботаСФормамиКлиентСервер.ПолучитьЭлементыРаспределенияПоПериодам(Форма, ИмяТаблицыРаспределения);
		Для Каждого ГруппаКолонокПоПериоду Из ДобавленныеЭлементыПериодов Цикл
			ИмяКолонкиСумма = СтрЗаменить(ГруппаКолонокПоПериоду.Имя, "Группа_", "Сумма_");
			КолонкиПериодов.Добавить(ИмяКолонкиСумма);
			Если ЕстьКолонкиКоличество Тогда
				ИмяКолонкиКоличество = СтрЗаменить(ГруппаКолонокПоПериоду.Имя, "Группа_", "Количество_");
				КолонкиПериодов.Добавить(ИмяКолонкиКоличество);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИмяКолонки Из КолонкиПериодов Цикл
		// Колонка могла быть удалена из таблицы.
		Попытка
			СтрокаТаблицы[ИмяКолонки] = 0;
			ИмяКолонкиИтогов = "Всего_" + ИмяКолонки;
			Форма[ИмяКолонкиИтогов] = 0;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьКолонкиСуммКолонкамиПоПериодам(МассивИменСуммовыхКолонок, ИмяТаблицы, КолонкиПоПериодам, 
	ЗанулитьТаблицуПоПериодам)
	
	Если Не ЗанулитьТаблицуПоПериодам И КолонкиПоПериодам.Свойство(ИмяТаблицы) Тогда
		Для Каждого Колонка Из КолонкиПоПериодам[ИмяТаблицы] Цикл
			МассивИменСуммовыхКолонок.Добавить(Колонка.Представление);
		КонецЦикла;	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПересчитатьДлительностьПроектнойПродукцииШаблоновПЗ(Субпродукты)
	
	Для каждого Строка Из Субпродукты Цикл
		Если упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Строка.Ресурс) Тогда
			Строка.Длительность = Строка.Количество * Строка.СкоростьВыполнения;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
