#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	Подразделение = упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСтруктурыИлиПодразделения(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Ключ", Подразделение);
	ПараметрыФормы.Вставить("РежимИнтеграции", Истина);
	
	ОткрытьФорму("Справочник.упоПодразделения.Форма.ФормаЭлементаУправляемая", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти