////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции заполнения и пересчета валютных сумм.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция производит пересчет суммы в некой валюте в другую валюту.
//
// Параметры:
//  Сумма		 - Число - сумма для пересчета.
//  Валюта		 - СправочникСсылка.Валюты - валюта исходная.
//  ВалютаНовая	 - СправочникСсылка.Валюты - валюта конечная. 
//  Дата		 - Дата - дата, на которую необходимо выполнить пересчет.
//
// Возвращаемое значение:
//	Число - пересчитанная сумма.
//
Функция ПересчитатьСумму(Сумма, Валюта, ВалютаНовая, Дата) Экспорт

	Если Валюта = ВалютаНовая Тогда
 		// Считаем, что пересчет не нужен.
		Возврат Сумма;
	КонецЕсли;
	
	КурсВал   = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	Курс  	  = КурсВал.Курс;
	Крат      = КурсВал.Кратность;

	КурсВал   = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаНовая, Дата);
	КурсНовая = КурсВал.Курс;
	КратНовая = КурсВал.Кратность;
	
	Если Курс = 0 Тогда
		Сообщение = НСтр("ru = 'Не задан курс валюты ""%1"" на дату %2!'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, Валюта, Формат(Дата, "ДЛФ=DD"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
				
		Возврат 0;
	КонецЕсли;
	
	Если КурсНовая = 0 Тогда
		Сообщение = НСтр("ru = 'Не задан курс валюты ""%1"" на дату %2!'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, ВалютаНовая, Формат(Дата, "ДЛФ=DD"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		
		Возврат 0;
	КонецЕсли;                                   

	СуммаРегл = РаботаСКурсамиВалют.ПересчитатьВВалюту(Сумма, Валюта, ВалютаНовая, Дата);

	Возврат СуммаРегл;

КонецФункции

// Заполняет сумму управленческого учета в таблице НекаяТаблица, пересчитывая ее в валюте управленческого учета.
//
// Параметры:
//  НекаяТаблица	 - ТаблицаЗначений - таблица с данными для пересчета.
//  ВалютаУпр		 - СправочникСсылка.Валюты - валюта управленческого учета. Если не задана,
//												 значение берется из константы.
//  ПроверитьТаблицу - Булево - признак необходимости проверить таблицу из первого параметра.
//
Процедура ЗаполнитьСуммуУправленческогоУчета(НекаяТаблица, ВалютаУпр = Неопределено, ПроверитьТаблицу = Истина) Экспорт
	
	Если ВалютаУпр = Неопределено Тогда
		ТемпВалютаУпр = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	Иначе
		ТемпВалютаУпр = ВалютаУпр;
	КонецЕсли;
	
	// Проверим на наличие Валюты.
	Если ПроверитьТаблицу И Не (
		 Не НекаяТаблица.Колонки.Найти("СуммаВалютная") = Неопределено
		 И Не НекаяТаблица.Колонки.Найти("Сумма") = Неопределено
		 И Не НекаяТаблица.Колонки.Найти("Валюта") = Неопределено) Тогда
		 
		 Возврат;
		 
	КонецЕсли; 
	
	ПолеДатыПлатежа = ПолеДатыПлатежаПоКолонкамТаблицы(НекаяТаблица);
	
	Для каждого строкаДвижения Из НекаяТаблица Цикл
		Если ПолеДатыПлатежа = Неопределено Тогда
			ДатаПлатежа = ТекущаяДатаСеанса();
		Иначе
			ДатаПлатежа = строкаДвижения[ПолеДатыПлатежа];
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТемпВалютаУпр) Тогда
			СтрокаДвижения.Сумма = СтрокаДвижения.СуммаВалютная;
		Иначе	
			СтрокаДвижения.Сумма = ПересчитатьСумму(СтрокаДвижения.СуммаВалютная,
				СтрокаДвижения.Валюта, ТемпВалютаУпр, ДатаПлатежа);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает имя поля "Дата платежа" в зависимости от состава колонок таблицы-источника.
//
// Параметры:
//  НекаяТаблица - ТаблицаЗначений	 - таблица-источник данных о платежах.
// 
// Возвращаемое значение:
//  Строка - имя поля "Дата платежа".
//
Функция ПолеДатыПлатежаПоКолонкамТаблицы(НекаяТаблица) Экспорт
	
	Если Не НекаяТаблица.Колонки.Найти("ДатаНачисления") = Неопределено Тогда
		ПолеДатыПлатежа = "ДатаНачисления";
	ИначеЕсли Не НекаяТаблица.Колонки.Найти("ДатаВыпуска") = Неопределено Тогда
		ПолеДатыПлатежа = "ДатаВыпуска";
	ИначеЕсли Не НекаяТаблица.Колонки.Найти("ДатаДвижения") = Неопределено Тогда
		ПолеДатыПлатежа = "ДатаДвижения";
	ИначеЕсли Не НекаяТаблица.Колонки.Найти("ДатаПривязки") = Неопределено Тогда
		ПолеДатыПлатежа = "ДатаПривязки";
	ИначеЕсли Не НекаяТаблица.Колонки.Найти("Период") = Неопределено Тогда
		ПолеДатыПлатежа = "Период";
	Иначе
		ПолеДатыПлатежа = Неопределено;
	КонецЕсли;
	
	Возврат ПолеДатыПлатежа;
	
КонецФункции

#КонецОбласти