////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с доходами и расходами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает распределение затрат на использование ресурса по статьям затрат.
//
// Параметры:
//  Ресурс			 - СправочникСсылка.упоТрудовыеРесурсы	 - распределяемый ресурс.
//  ТаблицаСтатей	 - ТаблицаЗначений, ДанныеФормыКоллекция - таблица распределения.
//
Процедура обПолучитьРаспределениеСтатейЗатрат(Ресурс, ТаблицаСтатей) Экспорт
	
	Если ЗначениеЗаполнено(ТаблицаСтатей) Тогда
		ТаблицаСтатей.Очистить();
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.СтатьяЗатрат КАК СтатьяЗатрат,
		|	Рег.ДоляСуммы КАК ДоляСуммы
		|ИЗ
		|	РегистрСведений.упоРаспределениеРесурсовПоСтатьямЗатрат КАК Рег
		|ГДЕ
		|	Рег.Ресурс = &Ресурс
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоляСуммы УБЫВ,
		|	Рег.СтатьяЗатрат.Представление";
	
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, Новый Структура("Ресурс", Ресурс));
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСтатей.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Перегоняет текущую настройку распределения затрат на использование ресурса по статьям из ТЗ в регистр.
//
// Параметры:
//  Ресурс			 - СправочникСсылка.упоТрудовыеРесурсы	 - распределяемый ресурс
//  ТаблицаСтатей	 - ТаблицаЗначений						 - таблица распределения.
// 
// Возвращаемое значение:
//  Булево - признак успешной записи.
//
Функция обЗаписатьРаспределениеСтатейЗатрат(Ресурс, ТаблицаСтатей) Экспорт

	НаборЗаписей = РегистрыСведений.упоРаспределениеРесурсовПоСтатьямЗатрат.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ресурс.Использование = Истина;
	НаборЗаписей.Отбор.Ресурс.Значение = Ресурс;
	НаборЗаписей.Прочитать();
	
	ТаблицаНабора = ТаблицаСтатей.Скопировать();
	ТаблицаНабора.Колонки.Добавить("Ресурс");
	Для каждого СтрокаНабора Из ТаблицаНабора Цикл
		СтрокаНабора.Ресурс = Ресурс;
	КонецЦикла; 
	
	НаборЗаписей.Загрузить(ТаблицаНабора);
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;

КонецФункции

// Формирует бюджет расходов проектной задачи на основании запланированных мат. ресурсов и доп. затрат.
//
// Параметры:
//  ПроектнаяЗадача  - Документ.упоПроектнаяЗадача – для которой необходимо сформировать бюджет расходов.
//  ПолучитьДопЗатраты - Булево
//  ПолучитьМатЗатраты - Булево
//
// Возвращаемое значение:
//   ТаблицаЗначений   - сформированный бюджет расходов.
//
Функция обСформироватьРасходыПроектнойЗадачи(ПроектнаяЗадача,
		ПолучитьМатЗатраты = Истина, ПолучитьДопЗатраты = Истина) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	МассивТекстовЗапросов = Новый Массив;
	
	ЕстьОсновнойЗапрос = Ложь;
	
	Если ПолучитьМатЗатраты Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ %1 РАЗЛИЧНЫЕ
			|   СтатьиЗатрат.СтатьяЗатрат КАК СтатьяЗатрат,
			|   СУММА(ПланМатЗатрат.Стоимость) КАК Сумма,
			|   ЛОЖЬ КАК ЭтоРольТрудовогоРесурса,
			|   NULL КАК СпособПривязки,
			|   NULL КАК ПрофильРаспределения
			|ИЗ
			|   РегистрСведений.упоАктуальныеПланыЗатратМатериальныхРесурсов.СрезПоследних(
			|           ,
			|           Версия = &ТекущаяВерсия
			|               И ПроектнаяЗадача = &ПроектнаяЗадача) КАК ПланМатЗатрат
			|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРаспределениеРесурсовПоСтатьямЗатрат КАК СтатьиЗатрат
			|       ПО ПланМатЗатрат.Ресурс = СтатьиЗатрат.Ресурс
			|
			|СГРУППИРОВАТЬ ПО
			|   СтатьиЗатрат.СтатьяЗатрат";
		Если ЕстьОсновнойЗапрос Тогда
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, "");
		Иначе
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, "РАЗРЕШЕННЫЕ");
			ЕстьОсновнойЗапрос = Истина;
		КонецЕсли;
		
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПолучитьДопЗатраты Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ %1 РАЗЛИЧНЫЕ
			|   ДопЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
			|   СУММА(ДопЗатраты.Стоимость) КАК Сумма,
			|   ЛОЖЬ КАК ЭтоРольТрудовогоРесурса,
			|   упоСтатьиЗатрат.СпособПривязкиРасходовПоУмолчанию КАК СпособПривязки,
			|   упоСтатьиЗатрат.ПрофильРаспределенияПоУмолчанию КАК ПрофильРаспределения
			|ИЗ
			|   РегистрСведений.упоАктуальныеПланыДополнительныхЗатрат.СрезПоследних(
			|           ,
			|           Версия = &ТекущаяВерсия
			|               И ПроектнаяЗадача = &ПроектнаяЗадача) КАК ДопЗатраты
			|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоСтатьиЗатрат КАК упоСтатьиЗатрат
			|       ПО ДопЗатраты.СтатьяЗатрат = упоСтатьиЗатрат.Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|   ДопЗатраты.СтатьяЗатрат,
			|   упоСтатьиЗатрат.СпособПривязкиРасходовПоУмолчанию,
			|   упоСтатьиЗатрат.ПрофильРаспределенияПоУмолчанию";
		
		Если ЕстьОсновнойЗапрос Тогда
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, "");
		Иначе
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, "РАЗРЕШЕННЫЕ");
		КонецЕсли;
		
		МассивТекстовЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если Не МассивТекстовЗапросов.Количество() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(МассивТекстовЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	ТекущаяВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ТекущаяВерсия", ТекущаяВерсияПроекта);
	ПараметрыЗапроса.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
	
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Распределяет общую сумму дохода/расхода по периодам в соответствии с заданным профилем.
//
// Параметры:
//  Профиль					 - СправочникСсылка.упоПрофилиРаспределенияДоходовИРасходов	 - заданный профиль распределения.
//  ДатаНач					 - 															 - Дата – начало общего периода.
//  ДатаКон					 - 															 - Дата – окончание общего периода.
//  Сумма					 - Число													 - сумма, которую нужно распределить.
//  РаспределяетсяКоличество - Булево													 - признак распределения количества.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - результат расчета.
//
Функция обРаспределитьДоходыИРасходыПоПрофилю(Профиль, ДатаНач, ДатаКон, Сумма = 0, РаспределяетсяКоличество = Ложь) Экспорт

	Возврат упоДоходыИРасходыСервер.РаспределитьДоходыИРасходыПоПрофилю(Профиль, ДатаНач, ДатаКон, Сумма, РаспределяетсяКоличество);

КонецФункции

// Возвращает актуальные данные для расчета плана БДР проекта/задачи.
//
// Параметры:
//  ВхПараметр		 - СправочникСсылка.Проекты, ДокументСсылка.упоПроектнаяЗадача, Массив	 - данные для расчета.
//  ТекущаяВерсия	 - ДокументСсылка.упоВерсияПланаПроекта		 - версия проекта.
//  СвойстваПроекта	 - Структура								 - свойства проекта.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - подготовленные данные плана БДР.
//
Функция обПолучитьДанныеПланаБДР(ВхПараметр, ТекущаяВерсия, СвойстваПроекта = Неопределено) Экспорт
	
	ДанныеПланаБДР = упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоДанныеПлановДоходовИРасходов");
	
	Если СвойстваПроекта = Неопределено Тогда
		Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяВерсия, "Проект");
		СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяВерсия", ТекущаяВерсия);
	Запрос.УстановитьПараметр("ДоходыПоНатуральнымПоказателям", СвойстваПроекта.Свойство("ДоходыПоНатуральнымПоказателям") И СвойстваПроекта.ДоходыПоНатуральнымПоказателям);
	Запрос.УстановитьПараметр("ПланироватьЗатратыНаМатериалы", СвойстваПроекта.Свойство("ПланироватьЗатратыНаМатериалы") И СвойстваПроекта.ПланироватьЗатратыНаМатериалы);
	Запрос.УстановитьПараметр("ПланироватьДополнительныеЗатратыПоЗадаче", СвойстваПроекта.Свойство("ПланироватьДополнительныеЗатратыПоЗадаче") И СвойстваПроекта.ПланироватьДополнительныеЗатратыПоЗадаче);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	РегЗадачи.ВключитьДопЗатратыВПланРасходов
		|		И &ПланироватьДополнительныеЗатратыПоЗадаче КАК ВключитьДопЗатратыВПланРасходов,
		|	РегЗадачи.ВключитьМатРесурсыВПланРасходов
		|		И &ПланироватьЗатратыНаМатериалы КАК ВключитьМатРесурсыВПланРасходов,
		|	РегЗадачи.ВключитьСубпродуктыВПланДоходов
		|		И &ДоходыПоНатуральнымПоказателям КАК ВключитьСубпродуктыВПланДоходов
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекущаяВерсия) КАК РегЗадачи
		|ГДЕ
		|	НЕ РегЗадачи.ЗадачаОтменена
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	РегПлан.Статья КАК Статья,
		|	РегПлан.ВидЭлемента КАК ВидЭлемента,
		|	РегПлан.ПрофильРаспределения КАК ПрофильРаспределения,
		|	РегПлан.Сумма КАК Сумма,
		|	РегПлан.Контрагент КАК Контрагент,
		|	РегПлан.Договор КАК Договор,
		|	РегПлан.СпособПривязки КАК СпособПривязки,
		|	РегПлан.ДатаПривязки КАК ДатаПривязки,
		|	РегПлан.Валюта КАК Валюта,
		|	РегПлан.СуммаВалютная КАК СуммаВалютная,
		|	РегПлан.ПериодАгрегации КАК ПериодАгрегации,
		|	РегПлан.ЭтоСубпродуктИлиПотребность КАК ЭтоСубпродуктИлиПотребность,
		|	РегПлан.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы) КАК ИсточникПлана
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И ПроектнаяЗадача В
		|					(ВЫБРАТЬ
		|						втЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
		|					ИЗ
		|						втЗадачи КАК втЗадачи)
		|				И (ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ПустаяСсылка)
		|					ИЛИ ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы))) КАК РегПлан
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СтатьяЗатрат КАК Статья,
		|	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязкиРасхода КАК СпособПривязки,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Контрагент КАК Контрагент,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Договор КАК Договор,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Валюта КАК Валюта,
		|	СУММА(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма) КАК Сумма,
		|	СУММА(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная) КАК СуммаВалютная,
		|	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты) КАК ИсточникПлана
		|ИЗ
		|	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И ПроектнаяЗадача В
		|					(ВЫБРАТЬ
		|						втЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
		|					ИЗ
		|						втЗадачи КАК втЗадачи
		|					ГДЕ
		|						втЗадачи.ВключитьМатРесурсыВПланРасходов)) КАК упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних
		|ГДЕ
		|	(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество <> 0
		|			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма <> 0
		|			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СтатьяЗатрат,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СпособПривязкиРасхода,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПрофильРаспределения,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ДатаПривязки,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Контрагент,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Договор,
		|	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.СтатьяЗатрат КАК Статья,
		|	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход) КАК ВидЭлемента,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.СпособПривязкиДоходовРасходов КАК СпособПривязки,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПрофильРаспределенияДоходовРасходов КАК ПрофильРаспределения,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДатаПривязкиДоходовРасходов КАК ДатаПривязки,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.КонтрагентДоходовРасходов КАК Контрагент,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДоговорДоходовРасходов КАК Договор,
		|	СУММА(упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма) КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты) КАК ИсточникПлана,
		|	СУММА(упоДанныеПлановДополнительныхЗатратСрезПоследних.Сумма) КАК СуммаВалютная
		|ИЗ
		|	РегистрСведений.упоДанныеПлановДополнительныхЗатрат.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И ПроектнаяЗадача В
		|					(ВЫБРАТЬ
		|						втЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
		|					ИЗ
		|						втЗадачи КАК втЗадачи
		|					ГДЕ
		|						втЗадачи.ВключитьДопЗатратыВПланРасходов)) КАК упоДанныеПлановДополнительныхЗатратСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПроектнаяЗадача,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.СтатьяЗатрат,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.КонтрагентДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДоговорДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.СпособПривязкиДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ПрофильРаспределенияДоходовРасходов,
		|	упоДанныеПлановДополнительныхЗатратСрезПоследних.ДатаПривязкиДоходовРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов КАК Статья,
		|	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов КАК СпособПривязки,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки КАК ДатаПривязки,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент КАК Контрагент,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор КАК Договор,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта КАК Валюта,
		|	СУММА(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Сумма) КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Объемы) КАК ИсточникПлана,
		|	СУММА(упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СуммаВалютная) КАК СуммаВалютная
		|ИЗ
		|	РегистрСведений.упоДанныеПлановВыпускаСубпродуктов.СрезПоследних(
		|			,
		|			Версия = &ТекущаяВерсия
		|				И ПроектнаяЗадача В
		|					(ВЫБРАТЬ
		|						втЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
		|					ИЗ
		|						втЗадачи КАК втЗадачи
		|					ГДЕ
		|						втЗадачи.ВключитьСубпродуктыВПланДоходов)) КАК упоДанныеПлановВыпускаСубпродуктовСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПроектнаяЗадача,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ПрофильРаспределения,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СпособПривязкиДоходов,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.ДатаПривязки,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Валюта,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Контрагент,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.Договор,
		|	упоДанныеПлановВыпускаСубпродуктовСрезПоследних.СтатьяДоходов";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Источник = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник;		
	Если ТипЗнч(ВхПараметр) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда      		
		Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("Версия = &ТекущаяВерсия И ПроектнаяЗадача = &ПроектнаяЗадача");
		Запрос.УстановитьПараметр("ПроектнаяЗадача", ВхПараметр); 
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("СписокЗначений") Тогда		
		Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("Версия = &ТекущаяВерсия И ПроектнаяЗадача В (&СписокЗадач)");
		Запрос.УстановитьПараметр("СписокЗадач", ВхПараметр.ВыгрузитьЗначения());
	ИначеЕсли ТипЗнч(ВхПараметр) = Тип("Массив") Тогда
		Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("Версия = &ТекущаяВерсия И ПроектнаяЗадача В (&СписокЗадач)");
		Запрос.УстановитьПараметр("СписокЗадач", ВхПараметр);
	ИначеЕсли НЕ ТипЗнч(ВхПараметр) = Тип("СправочникСсылка.Проекты") Тогда
		Возврат Неопределено; // некорректные входные данные
	КонецЕсли; 
				
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();	
	
	Результат = Запрос.ВыполнитьПакет();
	ИндексКрайнего = Результат.ВГраница();
	
	// Данные плана доходов расходов.
	Если Не Результат[ИндексКрайнего - 3].Пустой() Тогда
		Выборка = Результат[ИндексКрайнего - 3].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ДанныеПланаБДР.Добавить(), Выборка);
		КонецЦикла;	
	КонецЕсли;
	// Трансляция мат.затрат.
	Если НЕ Результат[ИндексКрайнего - 2].Пустой() Тогда
		Выборка = Результат[ИндексКрайнего - 2].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ДанныеПланаБДР.Добавить(), Выборка);
		КонецЦикла;				
	КонецЕсли;	
	// Трансляция доп.затрат.
	Если НЕ Результат[ИндексКрайнего - 1].Пустой() Тогда
		Выборка = Результат[ИндексКрайнего - 1].Выбрать();
		ВалютаУправленческогоУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ДанныеПланаБДР.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Валюта = ВалютаУправленческогоУчета;
		КонецЦикла;				
	КонецЕсли;	
	// Трансляция объемов.
	Если НЕ Результат[ИндексКрайнего].Пустой() Тогда
		Выборка = Результат[ИндексКрайнего].Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ДанныеПланаБДР.Добавить(), Выборка);
		КонецЦикла;				
	КонецЕсли;
			
	Возврат ДанныеПланаБДР;

КонецФункции

#КонецОбласти