////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции общего назначения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устарела. см.СтрШаблон.
// Подставляет параметры в строку, находя их по символу %.
//
// Параметры:
//  СтрокаПодстановки	 - Строка - строка, в которую надо осуществить подстановку.
//  Параметр1			 - Строка - параметр 1.
//  Параметр2			 - Строка - необязательный. Параметр 2.
//  Параметр3			 - Строка - необязательный. Параметр 3.
//  Параметр4			 - Строка - необязательный. Параметр 4.
//  Параметр5			 - Строка - необязательный. Параметр 5.
//  Параметр6			 - Строка - необязательный. Параметр 6.
//  Параметр7			 - Строка - необязательный. Параметр 7.
//  Параметр8			 - Строка - необязательный. Параметр 8.
//  Параметр9			 - Строка - необязательный. Параметр 9.
//
// Возвращаемое значение:
//	Строка - строка с подставленными параметрами.
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1,	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Если СтрокаПодстановки = Неопределено ИЛИ СтрДлина(СтрокаПодстановки) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = "";
	НачПозиция = 1;
	Позиция = 1;
	Пока Позиция <= СтрДлина(СтрокаПодстановки) Цикл
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		Если СимволСтроки <> "%" Тогда
			Позиция = Позиция + 1;
			Продолжить;
		КонецЕсли;
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, Позиция - НачПозиция);
		Позиция = Позиция + 1;
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		
		Если СимволСтроки = "%" Тогда
			Позиция = Позиция + 1;
			НачПозиция = Позиция;
			Продолжить;
		КонецЕсли;
		
		Попытка
			НомерПараметра = Число(СимволСтроки);
		Исключение
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + СимволСтроки);
		КонецПопытки;
		
		Если СимволСтроки = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли СимволСтроки = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли СимволСтроки = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли СимволСтроки = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли СимволСтроки = "5" Тогда
			ЗначениеПараметра = Параметр5;
		ИначеЕсли СимволСтроки = "6" Тогда
			ЗначениеПараметра = Параметр6;
		ИначеЕсли СимволСтроки = "7" Тогда
			ЗначениеПараметра = Параметр7;
		ИначеЕсли СимволСтроки = "8" Тогда
			ЗначениеПараметра = Параметр8;
		ИначеЕсли СимволСтроки = "9" Тогда
			ЗначениеПараметра = Параметр9;
		Иначе
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + ЗначениеПараметра);
		КонецЕсли;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = "";
		Иначе
			ЗначениеПараметра = Строка(ЗначениеПараметра);
		КонецЕсли;
		Результат = Результат + ЗначениеПараметра;
		Позиция = Позиция + 1;
		НачПозиция = Позиция;
	
	КонецЦикла;
	
	Если (НачПозиция <= СтрДлина(СтрокаПодстановки)) Тогда
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, СтрДлина(СтрокаПодстановки) - НачПозиция + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, существует ли у объекта свойство.
//
// Параметры:
//  Объект		 - Произвольный - объект, для которого необходимо проверить наличие свойства.
//  ИдСвойства	 - Строка 		- имя свойства.
//
// Возвращаемое значение:
//	Булево - признак наличия свойства у объекта.
//
Функция СуществуетСвойство(Объект, ИдСвойства) Экспорт
	
	Попытка	
		Тест=Объект[ИдСвойства];
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина; 
	
КонецФункции

// Заполняет свойства объекта, если свойство существует.
//
// Параметры:
//  Объект			 - Произвольный	 - объект, для которого необходимо заполнить свойство.
//  ИмяСвойства		 - Строка		 - имя свойства.
//  ЗначениеСвойства - Произвольный	 - значение свойства.
//
Процедура ЗаполнитьСвойствоЕслиЕсть(Объект, ИмяСвойства, ЗначениеСвойства) Экспорт
	
	ДанныеЗаполнения = Новый Структура(ИмяСвойства, ЗначениеСвойства);
	
	ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
	
КонецПроцедуры

// Возвращает признак существования заполненного свойства в объекта.
//
// Параметры:
//  Объект			 - Произвольный	 - объект, для которого необходимо определить наличие заполненного свойства.
//  ИмяСвойства		 - Строка		 - имя проверяемого свойства.
// 
// Возвращаемое значение:
//  Булево - признак существования заполненного свойства.
//
Функция СвойствоСуществуетИЗаполнено(Объект, ИмяСвойства) Экспорт
	
	ДанныеЗаполнения = Новый Структура(ИмяСвойства);
	
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Объект);
	
	Возврат ЗначениеЗаполнено(ДанныеЗаполнения[ИмяСвойства]);
	
КонецФункции

// Получает форму, которой принадлежит элемент.
//
// Параметры:
//  Элемент	 - УправляемаяФорма, ЭлементФормы	 - элемент, для которого необходимо получить форму.
// 
// Возвращаемое значение:
//  УправляемаяФорма, Неопределено - в случае провала - неопределено.
//
Функция ПолучитьФормуЭлементаФормы(Элемент) Экспорт
	
	Если ТипЗнч(Элемент) = Тип("УправляемаяФорма") Тогда
		Возврат Элемент;
	Иначе
		Родитель = Ложь;
		Попытка 
			Родитель = Элемент.Родитель;
		Исключение
		КонецПопытки;
		Если Родитель <> Ложь Тогда
			Возврат ПолучитьФормуЭлементаФормы(Родитель);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Возвращает структуру, скопированную из структуры-источника.
//
// Параметры:
//  Структура			 - Структура 	- источник.
//  НадоЗаполнитьЗначение- Булево	 	- признак того, следует ли заполнять значение из параметра ЗначениеЗаполнения.
//  ЗначениеЗаполнения	 - Произвольный	- значение заполнения значения в случае, если НадоЗаполнитьЗначение = Истина.
//
// Возвращаемое значение:
//	Структура - скопированная структура.
//
Функция СкопироватьСтруктуру(Структура, НадоЗаполнитьЗначение = Ложь, ЗначениеЗаполнения = Неопределено) Экспорт
	
	НоваяСтруктура = Новый Структура;
	Для Каждого КлючЗначение Из Структура Цикл
		Если НадоЗаполнитьЗначение Тогда
			Значение = ЗначениеЗаполнения;
		Иначе
			Значение = КлючЗначение.Значение;
		КонецЕсли;
		НоваяСтруктура.Вставить(КлючЗначение.Ключ, Значение);
	КонецЦикла;
	
	Возврат НоваяСтруктура;
	
КонецФункции

// Сверачивает массив.
//
// Параметры:
//  Массив			 - Массив - сворачиваемый массив.
//  УдалитьПустой	 - Булево - признак необходимости удалять пустые элементы массива.
//
// Возвращаемое значение:
//	Массив - свернутый массив.
//
Функция СвернутьМассив(Массив, УдалитьПустой = Ложь) Экспорт 
	
	НовыйМассив = Новый Массив; Соответствие = Новый Соответствие;
	
	Для каждого ЭлементМассива Из Массив Цикл
		Если Не УдалитьПустой ИЛИ ЗначениеЗаполнено(ЭлементМассива) Тогда		
			Соответствие.Вставить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого КлючИЗначение Из Соответствие Цикл
		НовыйМассив.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;	
	Массив = НовыйМассив;
	
	Возврат Массив;
	
КонецФункции

// Возвращает максимум из всех параметров.
// Параметры должны быть одного типа.
//
// Параметры:
//  П1	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П2	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П3	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П4	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П5	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П6	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П7	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П8	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П9	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П10	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П11	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П12	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П13	 - Число, Строка, Дата, Булево - необязательный параметр.
//
// Возвращаемое значение:
//	Число, Строка, Дата, Булево - максимум.
//
Функция ПолучитьМаксимум(П1=Неопределено,
						 П2=Неопределено,
						 П3=Неопределено,
						 П4=Неопределено,
						 П5=Неопределено, 
						 П6=Неопределено,
						 П7=Неопределено,
						 П8=Неопределено, 
						 П9=Неопределено,
						 П10=Неопределено,
						 П11=Неопределено,
						 П12=Неопределено,
						 П13=Неопределено) Экспорт
	Возврат ПолучитьМаксМин(Истина, Ложь, П1, П2, П3, П4, П5, П6, П7, П8, П9, П10, П11, П12, П13);
КонецФункции

// Возвращает минимум из всех параметров.
// Параметры должны быть одного типа.
//
// Параметры:
//  П1	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П2	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П3	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П4	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П5	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П6	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П7	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П8	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П9	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П10	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П11	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П12	 - Число, Строка, Дата, Булево - необязательный параметр.
//  П13	 - Число, Строка, Дата, Булево - необязательный параметр.
//
// Возвращаемое значение:
//	Число, Строка, Дата, Булево - минимум.
//
Функция ПолучитьМинимум(П1=Неопределено,
						П2=Неопределено,
						П3=Неопределено,
						П4=Неопределено,
						П5=Неопределено,
						П6=Неопределено, 
						П7=Неопределено, 
						П8=Неопределено,
						П9=Неопределено, 
						П10=Неопределено,
						П11=Неопределено,
						П12=Неопределено,
						П13=Неопределено) Экспорт
	Возврат ПолучитьМаксМин(Ложь, Ложь, П1, П2, П3, П4, П5, П6, П7, П8, П9, П10, П11, П12, П13);
КонецФункции

#Область РаботаСДатами

// Возвращает полное или сокращенное наименование месяца по его номеру.
//
// Параметры:
//  НомерМесяца	 - Число 	- номер месяца.
//  Сокращенное	 - Булево 	- признак того, что необходимо вернуть сокращенное наименование.
//
// Возвращаемое значение:
//	Строка - имя месяца.
//
Функция ОпределитьИмяМесяца(НомерМесяца, Сокращенное = Ложь) Экспорт
	Результат = ?(НомерМесяца = 1, ?(Сокращенное, "Янв.", "Январь"), 
				?(НомерМесяца = 2, ?(Сокращенное, "Фев.", "Февраль"), 
				?(НомерМесяца = 3, "Март", 
				?(НомерМесяца = 4, ?(Сокращенное, "Апр.", "Апрель"), 
				?(НомерМесяца = 5, "Май", 
				?(НомерМесяца = 6, "Июнь", 
				?(НомерМесяца = 7, "Июль", 
				?(НомерМесяца = 8, ?(Сокращенное, "Авг.", "Август"), 
				?(НомерМесяца = 9, ?(Сокращенное, "Сент.", "Сентябрь"), 
				?(НомерМесяца = 10, ?(Сокращенное, "Окт.", "Октябрь"), 
				?(НомерМесяца = 11, ?(Сокращенное, "Нояб.", "Ноябрь"), 
				?(НомерМесяца = 12, ?(Сокращенное, "Дек.", "Декабрь"), 
				""))))))))))));
	
	Возврат Результат;
КонецФункции

// Возвращает начало периода по дате (начало дня, недели, месяца, квартала, года).
//
// Параметры:
//  Дата			 - Дата 	- дата, по которой надо вернуть начало периода.
//  Периодичность	 - Строка 	- "день", "неделя", "месяц", "квартал", "год".
//
// Возвращаемое значение:
//	Дата - начало периода.
//
Функция НачалоПериода(Дата, Периодичность) Экспорт
	
	Если НРег(Периодичность) = "день" Тогда
		Возврат НачалоДня(Дата);
	ИначеЕсли НРег(Периодичность) = "неделя" Тогда
		Возврат НачалоНедели(Дата);
	ИначеЕсли НРег(Периодичность) = "месяц" Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли НРег(Периодичность) = "квартал" Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли НРег(Периодичность) = "год" Тогда
		Возврат НачалоГода(Дата);
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
	
КонецФункции

// Возвращает конец периода по дате (конец дня, недели, месяца, квартала, года).
//
// Параметры:
//  Дата			 - Дата 	- дата, по которой надо вернуть конец периода.
//  Периодичность	 - Строка 	- "день", "неделя", "месяц", "квартал", "год".
//
// Возвращаемое значение:
//	Дата - конец периода.
//
Функция КонецПериода(Дата, Периодичность) Экспорт
	
	Если НРег(Периодичность) = "день" Тогда
		Возврат КонецДня(Дата);
	ИначеЕсли НРег(Периодичность) = "неделя" Тогда
		Возврат КонецНедели(Дата);
	ИначеЕсли НРег(Периодичность) = "месяц" Тогда
		Возврат КонецМесяца(Дата);
	ИначеЕсли НРег(Периодичность) = "квартал" Тогда
		Возврат КонецКвартала(Дата);
	ИначеЕсли НРег(Периодичность) = "год" Тогда
		Возврат КонецГода(Дата);   
	Иначе
		Возврат КонецДня(Дата);
	КонецЕсли;	
	
КонецФункции

// Добавляет определнное количество указанных периодов к дате.
//
// Параметры:
//  Дата		 - Дата 	- дата, к которой надо добавить период.
//  Период		 - Строка 	- вид периода: "день", "неделя", "месяц", "квартал", "год".
//  Количество	 - Число	- количество добавляемых периодов. Необязательный. По умолчанию = 1.
//
// Возвращаемое значение:
//	Дата - итоговая дата.
//
Функция ДобавитьПериод(Дата, Период, Количество = 1) Экспорт
	
	Результат = Дата;
	
	Если НРег(Период) = "день" Тогда
		Результат = Результат + Количество * 86400;
	ИначеЕсли НРег(Период) = "неделя" Тогда
		Результат = Результат + Количество * 604800
	ИначеЕсли НРег(Период) = "месяц" Тогда
		Результат = ДобавитьМесяц(Результат, Количество);
	ИначеЕсли НРег(Период) = "квартал" Тогда
		Результат = ДобавитьМесяц(Результат, Количество * 3);
	ИначеЕсли НРег(Период) = "год" Тогда
		Результат = ДобавитьМесяц(Результат, Количество * 12);
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Получает разность дат в месяцах.
//
// Параметры:
//  Дата1	 - Дата - дата, из которой вычитаем.
//  Дата2	 - Дата	- дата, которую вычитаем.
//
// Возвращаемое значение:
//	Число - количество месяцев.
//
Функция РазностьДатВМесяцах(Дата1, Дата2) Экспорт
	
	РазницаЛет = Год(Дата1)	- Год(Дата2);
	РазницаМесяцев = РазницаЛет * 12 + Месяц(Дата1) - Месяц(Дата2);
	
	Возврат РазницаМесяцев;
	
КонецФункции

// Функция определяет дату и время начала календарной декады для указанной даты.
//
// Параметры:
//  ИсходнаяДата - Дата - исходная дата.
//
// Возвращаемое значение:
//  Дата - вычисленная дата.
//
Функция ПолучитьНачалоДекады(ИсходнаяДата) Экспорт

	ДеньМесяца = День(ИсходнаяДата);

	Если ДеньМесяца <= 10 Тогда
		Результат = НачалоМесяца(ИсходнаяДата);
	ИначеЕсли ДеньМесяца <= 20 Тогда
		Результат = НачалоМесяца(ИсходнаяДата) + 60 * 60 * 24 * 10;
	Иначе
		Результат = НачалоМесяца(ИсходнаяДата) + 60 * 60 * 24 * 20;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция определяет дату и время конца календарной декады для указанной даты.
//
// Параметры:
//  ИсходнаяДата - Дата - исходная дата.
//
// Возвращаемое значение:
//  Дата - вычисленная дата.
//
Функция ПолучитьКонецДекады(ИсходнаяДата) Экспорт

	ДеньМесяца = День(ИсходнаяДата);

	Если ДеньМесяца <= 10 Тогда
		Результат = КонецДня(НачалоМесяца(ИсходнаяДата) + 60 * 60 * 24 * 9);
	ИначеЕсли ДеньМесяца <= 20 Тогда
		Результат = КонецДня(НачалоМесяца(ИсходнаяДата) + 60 * 60 * 24 * 19);
	Иначе
		Результат = КонецМесяца(ИсходнаяДата);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция определяет дату и время начала полугодия для указанной даты.
//
// Параметры:
//  ИсходнаяДата - Дата - исходная дата.
//
// Возвращаемое значение:
//  Дата - вычисленная дата.
//
Функция ПолучитьНачалоПолугодия(ИсходнаяДата) Экспорт

	Если Месяц(ИсходнаяДата) < 7 Тогда
		Результат = НачалоГода(ИсходнаяДата);
	Иначе
		Результат = ДобавитьМесяц(НачалоГода(ИсходнаяДата), 6);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция определяет дату и время конца полугодия для указанной даты.
//
// Параметры:
//  ИсходнаяДата - Дата - исходная дата.
//
// Возвращаемое значение:
//  Дата - вычисленная дата.
//
Функция ПолучитьКонецПолугодия(ИсходнаяДата) Экспорт

	Если Месяц(ИсходнаяДата) < 7 Тогда
		Результат = ДобавитьМесяц(КонецГода(ИсходнаяДата), -6);
	Иначе
		Результат = КонецГода(ИсходнаяДата);
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

// Пересчитывает суммы "вверх" от строки по дереву значений.
//
// Параметры:
//  СтруктураКолонокИРазниц	 - Структура - структура колонок и разниц.
//  Строка					 - ДанныеФормыЭлементДерева, ДанныеФормыДерево, СтрокаДереваЗначений, ДеревоЗначений - строка дерева.
//
Процедура ПересчитатьСуммыВВерхПоДереву(СтруктураКолонокИРазниц, Строка) Экспорт
	
	Если Строка <> Неопределено Тогда
				
		Для Каждого КлючЗначение Из СтруктураКолонокИРазниц Цикл
			
			Строка[КлючЗначение.Ключ] = Строка[КлючЗначение.Ключ] - СтруктураКолонокИРазниц[КлючЗначение.Ключ];
			
		КонецЦикла;
		
		ТекТип = Неопределено;
#Если Сервер ИЛИ ТолстыйКлиент Тогда
		Если ТипЗнч(Строка) = Тип("ДеревоЗначений") Тогда
			ТекТип = "ДеревоЗначений";
		ИначеЕсли ТипЗнч(Строка) = Тип("СтрокаДереваЗначений") Тогда
			ТекТип = "СтрокаДереваЗначений";
		КонецЕсли;
#КонецЕсли	
		Если ТипЗнч(Строка) = Тип("ДанныеФормыЭлементДерева") Тогда
			ТекТип = "ДанныеФормыЭлементДерева";
		ИначеЕсли ТипЗнч(Строка) = Тип("ДанныеФормыДерево") Тогда
			ТекТип = "ДанныеФормыДерево";
		КонецЕсли;
		
		Если ТекТип = "СтрокаДереваЗначений" Тогда
			ПересчитатьСуммыВВерхПоДереву(СтруктураКолонокИРазниц, Строка.Родитель)
		ИначеЕсли ТекТип = "ДанныеФормыЭлементДерева" Тогда
			ПересчитатьСуммыВВерхПоДереву(СтруктураКолонокИРазниц, Строка.ПолучитьРодителя())
		КонецЕсли;
		                                            	
	КонецЕсли;
	
КонецПроцедуры

// Функция создает новый объект - копию переданного для объектов типа Структура, ТаблицаЗначений, СписокЗначений.
//
// Параметры:
//  Объект - Структура, ТаблицаЗначений, СписокЗначений, Соответствие - исходный объект.
//
// Возвращаемое значение:
//  Структура, ТаблицаЗначений, СписокЗначений, Соответствие - копия исходного объекта.
//
Функция УниКопироватьОбъект1С(Объект) Экспорт
	
	Если ТипЗнч(Объект)=Тип("Структура") Тогда
        Рез=Новый Структура();
        Для Каждого Эл Из Объект Цикл
            Рез.Вставить(Эл.Ключ, УниКопироватьОбъект1С(Эл.Значение));
		КонецЦикла;
		Возврат Рез;
	КонецЕсли;
	
#Если ТолстыйКлиентОбычноеПриложение ИЛИ Сервер Тогда 
    Если ТипЗнч(Объект)=Тип("ТаблицаЗначений") Тогда
        Возврат Объект.Копировать();
	КонецЕсли;
#КонецЕсли

    Если ТипЗнч(Объект)=Тип("СписокЗначений") Тогда
        Рез=Новый СписокЗначений();
        Для Каждого Эл Из Объект Цикл
            Рез.Добавить(УниКопироватьОбъект1С(Эл.Значение), Эл.Представление, Эл.Пометка, Эл.Картинка);
		КонецЦикла;
		Возврат Рез;
	ИначеЕсли ТипЗнч(Объект)=Тип("Соответствие") Тогда
        Рез=Новый Соответствие();
        Для Каждого Эл Из Объект Цикл
            Рез.Вставить(Эл.Ключ, УниКопироватьОбъект1С(Эл.Значение));
		КонецЦикла;
		Возврат Рез;
    Иначе
        Возврат Объект;
	КонецЕсли;
	
КонецФункции

// Функция преобразует что-то во что-то.
//
// Параметры:
//  Значение - Число - преобразуемое значение.
//  Нотация	 - Число - нотация.
//
// Возвращаемое значение:
//	Число - преобразованное значение.
//
Функция Из_10_В_Любую(Знач Значение=0, Нотация=36) Экспорт
	
	Если Нотация <= 0 Тогда 
		Возврат "";
	КонецЕсли;
	
	Значение = Число(Значение);
	Если Значение<=0 Тогда 
		Возврат "0";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Значение % Нотация + 1, 1) + Результат;
		Значение = Цел(Значение / ?(Нотация = 0, 1, Нотация)) ;
	КонецЦикла;
	
	Возврат Результат;
	 
КонецФункции

// Функция преобразует что-то во что-то.
//
// Параметры:
//  Значение - Число - преобразуемое значение.
//  Нотация	 - Число - нотация.
//
// Возвращаемое значение:
//	Число - результат.
//
Функция Из_Любой_В_10(Знач Значение="0", Нотация=36) Экспорт
	
	Если Нотация <= 0 Тогда 
		Возврат 0; 
	КонецЕсли;
	
	Значение = СокрЛП(Значение);
	Если Значение = "0" Тогда 
		Возврат 0;
	КонецЕсли;
	
	Результат = 0;
	Длина = СтрДлина(Значение);
	Для Ит = 1 По Длина Цикл
		Коэф = 1;
		Для ИтВлож = 1 По Длина - Ит Цикл 
			Коэф = Коэф * Нотация 
		КонецЦикла;
		Результат = Результат + (Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Сред(Значение, Ит, 1)) - 1) * Коэф;
	КонецЦикла;
	
	Возврат Окр(Результат);
	
КонецФункции

// Возвращает числовое значение ставки НДС по значению перечисления.
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
//	Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
		Возврат 0.1;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
		Возврат 0.18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
		Возврат 0.2;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105") Тогда
		Возврат 0.05;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107") Тогда
		Возврат 0.07;
	// Новые ставки добавляем в конце Если на случай, если код добавлен раньше, чем значение перечисления.
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122") Тогда
		Возврат 0.22;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Функция - Заменить недопустимые символы XMLи табулияцию
//
// Параметры:
//  Текст		 - Строка 	 - Текст
//  СимволЗамены - Строка	 - Символ замены.
// 
// Возвращаемое значение:
//  Текст - Строка
//
Функция ЗаменитьНедопустимыеСимволыXMLиТабуляцию(Знач Текст, Знач СимволЗамены = " ") Экспорт 
	Текст = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(Текст, СимволЗамены);
	Возврат СтрЗаменить(Текст, Символ(9), СимволЗамены); //символ табуляции	
КонецФункции

// Устанавливат отбор по полю компоновки компоновщика настроек и возвращает признак успешного завершения.
//
// Параметры:
//  КомпоновщикНастроек		 - КомпоновщикНастроекКомпоновкиДанных	 - модифицируемый компоновщик настроек.
//  ИмяПоля					 - Строка	 - имя поля отбора.
//  Значение				 - Произвольный	 - значение поля отбора.
//  ОтключитьДругиеОтборы	 - Булево	 - признак отключения других отборов.
//  ДобавитьНовый			 - Булево	 - признак добавления нового отбора, если по имени отбор не найден.
//  РодительскоеПоле		 - ПолеКомпоновкиДанных	 - родительская группа отбора.
//  ИерархическийОтбор		 - Булево	 - признак установки иерархического отбора.
// 
// Возвращаемое значение:
//  Булево - признак успешной установки отбора.
//
Функция УстановитьОтборПоПолюКомпоновки(КомпоновщикНастроек, ИмяПоля, Знач Значение, ОтключитьДругиеОтборы = Ложь, 
												ДобавитьНовый = Ложь, РодительскоеПоле = Неопределено, ИерархическийОтбор = Ложь) Экспорт
												
	ОтборУстановлен = Ложь;
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		врЗначение = Новый СписокЗначений;
		врЗначение.ЗагрузитьЗначения(Значение);
		Значение = врЗначение;
	КонецЕсли;
	
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);		
	ЭлементПН = Неопределено;
	ЭлементОтбораНайден = Ложь;
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.ЛевоеЗначение = Поле Тогда
			
			ЭлементОтбораНайден = Истина;	
			ЭлементПН = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
				Элемент.ИдентификаторПользовательскойНастройки);
			Если ЭлементПН = Неопределено Тогда 
				ЭлементПН = Элемент;
			КонецЕсли;
			ЭлементПН.ПравоеЗначение = Значение;
			ЭлементПН.ВидСравнения = ВидСравненияПоЗначению(ЭлементПН.ПравоеЗначение, ИерархическийОтбор);
			ЭлементПН.Использование = Истина;
			
			ОтборУстановлен = Истина;
			
		КонецЕсли;
		
	КонецЦикла;   
	
	// Если поле доступно для отбора, добавляем отбор в настройки
	Если ДобавитьНовый И НЕ ЭлементОтбораНайден Тогда
		ДоступноеПолеОтбора = Неопределено;
		Если РодительскоеПоле = Неопределено Тогда
			ДоступноеПолеОтбора = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Поле);
		Иначе
			РодительскоеДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(РодительскоеПоле);
			Если РодительскоеДоступноеПоле <> Неопределено Тогда
				ДоступноеПолеОтбора = РодительскоеДоступноеПоле.Элементы.Найти(ИмяПоля);
			КонецЕсли; 			
		КонецЕсли;
		Если ДоступноеПолеОтбора <> Неопределено Тогда
			ЭлементПН = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементПН.ЛевоеЗначение = Поле;
			ЭлементПН.ВидСравнения = ВидСравненияПоЗначению(Значение, ИерархическийОтбор);
			ЭлементПН.ПравоеЗначение = Значение;
			ЭлементПН.Использование = Истина;		
			
			ОтборУстановлен = Истина;
			
		КонецЕсли;	
	КонецЕсли;
	
	Если ОтключитьДругиеОтборы Тогда
		ОтключитьВсеОтборыКроме(КомпоновщикНастроек, ЭлементПН);
	КонецЕсли;
	
	Возврат ОтборУстановлен;
	
КонецФункции

// Добавляет указанное количество пробелов к переданной строке.
//
// Параметры:
//  СтрокаТекста		 - Строка - строка текста
//  КоличествоПробелов	 - Число - добавляемоей количество пробелов
// 
// Возвращаемое значение:
//  Строка - строка текста с добавленными пробелами.
//
Функция ДобавитьПробелыКСтроке(СтрокаТекста, КоличествоПробелов) Экспорт
	
	Для Индекс = 0 По КоличествоПробелов - 1 Цикл
		СтрокаТекста = СтрокаТекста + " "; // пробел
	КонецЦикла;
	
	Возврат СтрокаТекста;
	
КонецФункции

// Возвращает разобранный состав имени формы по полному имени формы.
//
// Параметры:
//  ИмяФормы - Строка - полное имя формы.
// 
// Возвращаемое значение:
//  Структура - состав имени формы.
//
Функция СоставИмениФормы(ИмяФормы) Экспорт
	
	СоставИмени = Новый Структура("ТипМетаданных, ВидМетаданных, ИмяФормы");
	
	ЧастиИмени = СтрРазделить(ИмяФормы, ".");
	Если Не ЗначениеЗаполнено(ЧастиИмени) Тогда
		Возврат ЧастиИмени;
	КонецЕсли;
	
	ИмяТипаМетаданных = ЧастиИмени[0];
	Если ИмяТипаМетаданных = "ОбщаяФорма" Тогда
		СоставИмени.ТипМетаданных = ИмяТипаМетаданных;
		СоставИмени.ВидМетаданных = ИмяТипаМетаданных;
		СоставИмени.ИмяФормы = ЧастиИмени[1];
	Иначе
		СоставИмени.ТипМетаданных = ИмяТипаМетаданных;
		СоставИмени.ВидМетаданных = ЧастиИмени[1];
		// Для внешних и встроенных отчетов ЧастиИмени[2], для остальных объектов ЧастиИмени[3].
		СоставИмени.ИмяФормы = ЧастиИмени[ЧастиИмени.ВГраница()]; 
	КонецЕсли;
	
	Возврат СоставИмени;
	
КонецФункции

// Формирует исключение при открытии формы служебного объекта.
// 
// Возвращаемое значение:
//  Строка - текст исключения
//
Процедура Исключение_ЭтоСлужебныйОбъект() Экспорт
	
	ВызватьИсключение НСтр("ru = 'Объект является служебным и не предназначен для интерактивного использования.'")
	
КонецПроцедуры

// Формирует исключение при открытии формы объекта интеграционной конфигурации.
// 
// Возвращаемое значение:
//  Строка - текст исключения
//
Процедура Исключение_ЭтоОбъектДругойКонфигурации() Экспорт
	
	ВызватьИсключение НСтр("ru = 'Объект не предназначен для использования в текущей конфигурации.'")
	
КонецПроцедуры

#Область ТекущееОкружение

// Определяет режим эксплуатации информационной базы: ГРМ (Истина) или нет (Ложь).
// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно. 
// Пример адреса https://app123123.1capp.net/MyBase/ru_RU/
//
// Параметры:
//  СтрокаСоединенияИБ - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево - Истина, если база развернута в ГРМ.
//
Функция ИнформационнаяБазаГРМ(Знач СтрокаСоединенияИБ = "") Экспорт
	
	ЭтоБазаГРМ = Ложь;
	
	Если ПустаяСтрока(СтрокаСоединенияИБ) Тогда
		СтрокаСоединенияИБ = СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	СтрокаСоединенияИБ = ВРег(СтрокаСоединенияИБ);
	
	НачалоАдресаГРМ = "HTTPS://APP";
	ПубликацияСодержитАдрес_APP = СтрНайти(СтрокаСоединенияИБ, НачалоАдресаГРМ) = 1;
	Если Не ПубликацияСодержитАдрес_APP Тогда
		Возврат ЭтоБазаГРМ;
	КонецЕсли;
	
	ДоменАдресаГРМ = ".1CAPP.NET/";
	ВхождениеДомена_NET = СтрНайти(СтрокаСоединенияИБ, ДоменАдресаГРМ);
	Если ВхождениеДомена_NET = 0 Тогда
		Возврат ЭтоБазаГРМ; 
	КонецЕсли;
	
	ПозицияИдентификатораГРМ = СтрДлина(НачалоАдресаГРМ) + 1;
	ДлинаДомена = СтрДлина(ДоменАдресаГРМ);
	
	ИдентификаторГРМ = Сред(СтрокаСоединенияИБ, ПозицияИдентификатораГРМ, ВхождениеДомена_NET - ПозицияИдентификатораГРМ);
	
	Попытка
		ИдентификаторГРМЧислом = Число(ИдентификаторГРМ);
		ЭтоБазаГРМ = Истина;
	Исключение
		ЭтоБазаГРМ = Ложь;
	КонецПопытки;
	
	Возврат ЭтоБазаГРМ;
	
КонецФункции

#КонецОбласти

#Область ПроксиМетодыИнтегрированныхКонфигураций

// Прокси-метод для платформенного ПредопределенноеЗначение().
// Используется для обхода расширенной проверки конфигурации, которая отмечает ошибками использование отсутствующих 
// объектов интеграцоннной конфигурации при прямом обращении через менеджер объекта 
// или при обращении через ПредопределенноеЗначение().
//
// Параметры:
//  Путь - Строка - путь к метаданным. Например, "Перечисление.ВариантыРаспределенияРасходов.НеРаспределять".
// 
// Возвращаемое значение:
//  ЛюбаяСсылка
//
Функция упоПредопределенноеЗначение(Путь) Экспорт
	
	Возврат ПредопределенноеЗначение(Путь);
	
КонецФункции

// Прокси-метод для платформенного Тип().
// Используется для обхода расширенной проверки конфигурации, которая отмечает ошибками использование отсутствующих 
// объектов интеграцоннной конфигурации при обращении через Тип().
//
// Параметры:
//  ИмяТипа - Строка - Имя получаемого типа. Например, "ДокументСсылка.ЗаказПокупателя".
// 
// Возвращаемое значение:
//  Тип
//
Функция упоТип(ИмяТипа) Экспорт
	
	Возврат Тип(ИмяТипа);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВидСравненияПоЗначению(Значение, Иерархия) 
	Если ТипЗнч(Значение) = Тип("СписокЗначений") И Значение.Количество() > 1 Тогда   
		Если Иерархия Тогда
			лВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		Иначе
			лВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
	Иначе
		Если Иерархия Тогда
			лВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		Иначе
			лВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
	КонецЕсли;
	Возврат лВидСравнения;
КонецФункции 

Функция ОтключитьВсеОтборыКроме(КомпоновщикНастроек, ЭлементПН)  
	Если КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Количество() > 0 Тогда
		Коллекция = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Иначе
		Коллекция = КомпоновщикНастроек.Настройки.Отбор.Элементы; 
	КонецЕсли;
	Для Каждого Элемент Из Коллекция Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент <> ЭлементПН Тогда
			Элемент.Использование = Ложь;	
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ПолучитьМаксМин(флМаксимум = Истина, флПроверкаНаЗначение = Ложь, П1=Неопределено,
						П2=Неопределено,
						П3=Неопределено,
						П4=Неопределено,
						П5=Неопределено,
						П6=Неопределено, 
						П7=Неопределено,
						П8=Неопределено,
						П9=Неопределено,
						П10=Неопределено,
						П11=Неопределено,
						П12=Неопределено,
						П13=Неопределено)
	
	МассивЭлементов = Новый Массив;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П1) Тогда МассивЭлементов.Добавить(П1); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П2) Тогда МассивЭлементов.Добавить(П2); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П3) Тогда МассивЭлементов.Добавить(П3); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П4) Тогда МассивЭлементов.Добавить(П4); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П5) Тогда МассивЭлементов.Добавить(П5); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П6) Тогда МассивЭлементов.Добавить(П6); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П7) Тогда МассивЭлементов.Добавить(П7); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П8) Тогда МассивЭлементов.Добавить(П8); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П9) Тогда МассивЭлементов.Добавить(П9); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П10) Тогда МассивЭлементов.Добавить(П10); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П11) Тогда МассивЭлементов.Добавить(П11); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П12) Тогда МассивЭлементов.Добавить(П12); КонецЕсли;
	Если НЕ флПроверкаНаЗначение ИЛИ ЗначениеЗаполнено(П13) Тогда МассивЭлементов.Добавить(П13); КонецЕсли;
	Если МассивЭлементов.Количество() > 0 Тогда
		Результат = МассивЭлементов[0];
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если флМаксимум Тогда
			Результат = Макс(Результат, Элемент);
		Иначе
			Результат = Мин(Результат, Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура СообщитьПользователю(
	Знач ТекстСообщенияПользователю,
	Знач КлючДанных = Неопределено,
	Знач Поле = "",
	Знач ПутьКДанным = "",
	Отказ = Ложь) Экспорт

	#Если Клиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, Отказ);		
	#ИначеЕсли Сервер Тогда 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, Отказ);
	#КонецЕсли
		
КонецПроцедуры

#КонецОбласти