////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с формами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет документ-основание и устанавливает надпись документа-основания
// и прочие свойства.
//
// Параметры:
//  Объект					 - ДокументСсылка, ДокументОбъект, СправочникСсылка, СправочникОбъект - объект.
//  Форма					 - УправляемаяФорма - форма объекта.
//  ИмяРеквизитаОснования	 - Строка 			- имя реквизита, содержащего ссылку на документ-основание.
//  ТекстНадписи			 - Строка 			- текст надписи. Если параметр указан, то подставляется он.
//
Процедура ПроверитьДокументОснование(Объект,
									 Форма,
									 ИмяРеквизитаОснования = "ДокументОснование",
									 ТекстНадписи = Неопределено) Экспорт
									 
	
	ГиперссылкаЭлемент = Форма.Элементы["Надпись" + ИмяРеквизитаОснования];
	
	// Если оснований много, проверим что выбран тип основания.
	Если Не Объект[ИмяРеквизитаОснования] = Неопределено Тогда
		Если Не Объект[ИмяРеквизитаОснования].Пустая() Тогда
			// стандартный вид гиперссылки
			ГиперссылкаЭлемент.ЦветТекста = ВернутьЦветСтиля("ЦветТекстаФормы");
			Форма["Надпись" + ИмяРеквизитаОснования] =  ПолучитьСтроковоеПредставление(Объект[ИмяРеквизитаОснования]);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Укажем пользователю на необходимость выбрать документ-основание
	ГиперссылкаЭлемент.ЦветТекста = ВернутьЦветСтиля("ЦветОсобогоТекста");
	Форма["Надпись" + ИмяРеквизитаОснования] = ?(ТекстНадписи = Неопределено,
		"Не выбран " + ВернутьПредставлениеДокументОснование(Объект, ИмяРеквизитаОснования) + ". Нажмите здесь для выбора.",
		?(ТипЗнч(ТекстНадписи)=Тип("Строка"), ТекстНадписи, ""));
	
КонецПроцедуры 

// Заполняет надпись-гиперссылку на форме.
//
// Параметры:
//  Объект					 - ДокументСсылка, ДокументОбъект, СправочникСсылка, СправочникОбъект, ДанныеФормыСтруктура - объект.
//  Форма					 - УправляемаяФорма - форма объекта.
//  ИмяРеквизита			 - Строка			- необязательный. Имя реквизита.
//  ПредставлениеРеквизита	 - Строка 			- необязательный. Представление реквизита.
//  ПредставлениеСостояния	 - Строка			- необязательный. Представление состояния.
//  ПроверятьПустойРеквизит	 - Булево			- необязательный. Признак необходимости проверять пустой реквизит или нет.
//
Процедура ЗаполнитьГиперссылку(Объект,
							   Форма,
							   ИмяРеквизита = "Проект",
							   ПредставлениеРеквизита = "проект", 
							   ПредставлениеСостояния = "выбран", 
							   ПроверятьПустойРеквизит = Истина) Экспорт

	ГиперссылкаЭлемент = Форма.Элементы["Надпись" + ИмяРеквизита];
	
	// Если оснований много, проверим что выбран тип основания.
	Если Не Объект[ИмяРеквизита] = Неопределено Тогда
		Если Не Объект[ИмяРеквизита].Пустая() Тогда
			// стандартный вид гиперссылки
			ГиперссылкаЭлемент.ЦветТекста = ВернутьЦветСтиля("ЦветТекстаФормы");
			Форма["Надпись" + ИмяРеквизита] =  ПолучитьСтроковоеПредставление(Объект[ИмяРеквизита]);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьПустойРеквизит Тогда
		// Укажем пользователю на необходимость выбрать документ-основание
		ГиперссылкаЭлемент.ЦветТекста = ВернутьЦветСтиля("ЦветОсобогоТекста");
		Форма["Надпись" + ИмяРеквизита] = "Не " + ПредставлениеСостояния + " " 
							  + ПредставлениеРеквизита
							  + ". Нажмите здесь для выбора.";
	Иначе
		ГиперссылкаЭлемент.ЦветТекста = ВернутьЦветСтиля("ЦветТекстаФормы");
		Форма["Надпись" + ИмяРеквизита] = "";
	КонецЕсли;

КонецПроцедуры 

// Получает представление реквизита объекта.
//
// Параметры:
//  Объект					 - Произволльный 	- объект, для которого надо получить представление реквизита по его имени.
//  ИмяРеквизитаОснования	 - Строка 			- имя реквизита.
//
// Возвращаемое значение:
//	Строка - представление реквизита.
//
Функция ВернутьПредставлениеДокументОснование(Объект, ИмяРеквизитаОснования) Экспорт
	
	тОбъект = ПолучитьОбъектПоДаннымФормы(Объект);
	
	Возврат Нрег(СокрЛП(тОбъект.Метаданные().Реквизиты[ИмяРеквизитаОснования].Представление()));
	
КонецФункции

// Везвращает цвет стиля по его имени.
//
// Параметры:
//  Цвет - Строка - имя цвета.
//
// Возвращаемое значение:
//	Цвет - цвет стиля.
//
Функция ВернутьЦветСтиля(Цвет) Экспорт
	
	Возврат ЦветаСтиля[Цвет];
	
КонецФункции

// Проверяет, содержит ли раздел метаданных объект.
//
// Параметры:
//  Раздел			 - Строка - раздел метаданных.
//  ОбъектМетаданных - Строка - имя объекта метаданных.
//
// Возвращаемое значение:
//	Булево - признак того, что раздел метаданных содержит объект.
//
Функция РазделМетаданныхСодержатОбъект(Раздел, ОбъектМетаданных) Экспорт
	
	Возврат Метаданные[Раздел].Содержит(ОбъектМетаданных);
	
КонецФункции

// Возвращает строковое представление ссылки.
//
// Параметры:
//  Ссылка	 - Произвольный - ссылка на объект.
//
// Возвращаемое значение:
//	Строка - представление ссылки.
//
Функция ПолучитьСтроковоеПредставление(Ссылка) Экспорт
	
	Возврат упоСервисныеФункцииВызовСервера.обПолучитьСтроковоеПредставление(Ссылка);
	
КонецФункции

// Получает объект по данным формы.
//
// Параметры:
//  ДанныеФормыОбъект	 - ДанныеФормыСтруктура - структура данных формы.
//
// Возвращаемое значение:
//	Произвольный - ссылка на объект или сам объект.
//
Функция ПолучитьОбъектПоДаннымФормы(ДанныеФормыОбъект) Экспорт
		
	тТип = ВернутьСтрокуТипа(ДанныеФормыОбъект, Истина, "Объект");	
	
	Возврат ДанныеФормыВЗначение(ДанныеФормыОбъект, Тип(тТип));
	
КонецФункции

// Проверяет, новый объект или нет по форме.
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - форма.
//
// Возвращаемое значение:
//	Булево - признак того, новй объект или нет.
//
Функция ЭтоНовый(ЭтаФорма) Экспорт
	
	Если ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает строковое представление типа.
//
// Параметры:
//  Предмет		 - Произвольный - объект или структура, содержащие ссылку на объект, для которого надо
//					получить строкое представление.
//  УказыватьТип - Булево		- признак необходимости указывать в возвращаемой строке тип (документ или
//					Справочник).
//  СсылкаОбъект - Строка 		- "Ссылка" или "Объект".
//
// Возвращаемое значение:
//	Строка - представление типа.
//
Функция ВернутьСтрокуТипа(Предмет, УказыватьТип = Истина, СсылкаОбъект = "Ссылка") Экспорт
	
	сТип = "";
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Предмет.Ссылка)) Тогда
		сТип = "Документ";	   
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Предмет.Ссылка)) Тогда
		сТип = "Справочник";
	КонецЕсли;
	XMLТип = XMLТипЗнч(Предмет.Ссылка);
	Если УказыватьТип Тогда
		сТип = сТип+СсылкаОбъект+".";	
	Иначе
		сТип = "";
	КонецЕсли;
	
	Возврат сТип + Прав(XMLТип.ИмяТипа, СтрДлина(XMLТип.ИмяТипа) -  Найти(XMLТип.ИмяТипа,"."));
	
КонецФункции

// Возвращает список оснований объекта.
//
// Параметры:
//  ДанныеФормыОбъект	 - ДанныеФормыСтруктура - данные объекта.
//
// Возвращаемое значение:
//	СписокЗначений - список оснований объекта.
//
Функция ВернутьСписокОснованийОбъекта(Знач ДанныеФормыОбъект) Экспорт
	
	Список = Новый СписокЗначений;
	Объект = ПолучитьОбъектПоДаннымФормы(ДанныеФормыОбъект);
	Для Каждого ОбъектМетаданных Из Объект.Метаданные().ВводитсяНаОсновании Цикл
		Если РазделМетаданныхСодержатОбъект("Документы", ОбъектМетаданных) Тогда
			Объект = Документы[ОбъектМетаданных.Имя].ПустаяСсылка();
			Список.Добавить(Объект, ТипЗнч(Объект));
		ИначеЕсли РазделМетаданныхСодержатОбъект("Справочники",ОбъектМетаданных) Тогда
			Объект = Справочники[ОбъектМетаданных.Имя].ПустаяСсылка();
			Список.Добавить(Объект, ТипЗнч(Объект));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции       

// Везаращает список типов реквизита объекта.
//
// Параметры:
//  ДанныеФормыОбъект	 - ДанныеФормыСтруктура - данные объекта.
//  ИмяРеквизита		 - Строка				- имя реквизита.
//
// Возвращаемое значение:
//	СписокЗначений - список типов реквизита объекта.
//
Функция ВернутьСписокТиповРеквизитаОбъекта(Знач ДанныеФормыОбъект, ИмяРеквизита) Экспорт
	
	Объект = ПолучитьОбъектПоДаннымФормы(ДанныеФормыОбъект);

	Список = Новый СписокЗначений;
	
	Для Каждого ТипРеквизита Из Объект.Метаданные().Реквизиты[ИмяРеквизита].Тип.Типы() Цикл
	
		Список.Добавить(Новый(ТипРеквизита), ТипРеквизита);
		
	КонецЦикла;
		
	Возврат Список;	
	
КонецФункции       

// Рассчитывает задержку по календарю от даты.
//
// Параметры:
//  ДатаНач					 - Дата 			- дата начала, от которой считается задержка.
//  КоличествоДней			 - Число 			- количество дней задержки.
//  пКалендарь				 - СправочникСсылка.упоРабочиеКалендари - календарь, на основании которого считается задержка.
//  таблицаКалендаря		 - ТаблицаЗначений 	- талица календаря.
//  таблицаКалендаряПолные	 - ТаблицаЗначений 	- талица календаря.
//  ВыводитьСообщения		 - Булево 			- признак необходимости вывода служебных сообщений.
//
// Возвращаемое значение:
//	Дата, Неопределено - дата, рассчитанная как дата начала плюс количество дней с учетом календаря.
//
Функция РассчитатьЗадержкуПоКалендарю(ДатаНач,
									  КоличествоДней,
									  пКалендарь,
									  таблицаКалендаря = Неопределено,
									  таблицаКалендаряПолные = Неопределено,
									  ВыводитьСообщения = Ложь) Экспорт 
										
	  таблицаКалендаряКопия = таблицаКалендаря;
	  таблицаКалендаряПолныеКопия = таблицаКалендаряПолные;
	  
	  Возврат обРассчитатьЗадержкуПоКалендарю(ДатаНач,
											  КоличествоДней, 
											  пКалендарь, 
											  таблицаКалендаряКопия , 
											  таблицаКалендаряПолныеКопия, 
											  ВыводитьСообщения);						
	  										
КонецФункции
									
// Возвращает структуру дополнительных параметров подбора. 
//
// Возвращаемое значение:
//	Структура - дополнительные параметры подбора. Свойства:
//		* ВалютаУправленческогоУчета 	- СправочникСсылка.Валюты 
//		* РежимИнтеграции_УПО 			- Булево
//
Функция ДозаполнитьПараметрыПодбора() Экспорт
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ВалютаУправленческогоУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	ПараметрыПодбора.Вставить("РежимИнтеграции_УПО", упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПО());
	
	Возврат ПараметрыПодбора;
	 
КонецФункции

// Проверяет, не заполнено ли значение.
//
// Параметры:
//  Значение - Произвольный - проверяемое значение.
//
// Возвращаемое значение:
//	Булево - результат проверки.
//
Функция ЗначениеНеЗаполненоВызовСервера(Значение) Экспорт
	
	Возврат упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Значение);
	
КонецФункции

// См. упоРесурсыИРолиВызовСервера.обПолучитьПодразделениеРоли
//
Функция ПолучитьПодразделениеРолиВызовСервера(Роль, ДатаАктуальности = Неопределено) Экспорт 
	
	Возврат упоРесурсыИРолиВызовСервера.обПолучитьПодразделениеРоли(Роль, ДатаАктуальности);
	
КонецФункции

// Заполняет заданную строку табличной части по норме стоимости и пересчитывает общую стоимость ресурса,
//  а также устанавливает статью затрат в соответствии с выбранным ресурсом.
//
// Параметры:
//  СтрокаТабличнойЧасти	 - СтрокаТабличнойЧасти		 - строка ТЧ.
//  Объект					 - ДокументОбъект			 - объект-владелец табличной части.
//  НормаСтоимости			 - СправочникСсылка.упоНормыСтоимости	 - задаваемая напрямую норма
//  	(используется в ситуациях, когда у объекта несколько
//  	реквизитов, представляющих разные нормы стоимости).
//  ЕстьКолонкаВнСтоимость	 - Булево
// 
// Возвращаемое значение:
//  СтрокаТабличнойЧасти
//
Функция ПриИзмененииРесурсаТабЧастиВызовСервера(СтрокаТабличнойЧасти, Объект, НормаСтоимости = Неопределено,
	ЕстьКолонкаВнСтоимость = Ложь) Экспорт

	упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти, Объект, НормаСтоимости, , , ЕстьКолонкаВнСтоимость);
	
	Возврат СтрокаТабличнойЧасти;
	
КонецФункции

// Устарела. Следует использовать упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры.
// Получает единицу измерения ресурса.
//
// Параметры:
//  Ресурс				 - СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.Номенклатура - ресурс.
//  ДопПараметрыПодбора	 - Структура - структура дополнительных параметров подбора.
//
// Возвращаемое значение:
//	СправочникСсылка.упоЕдиницыВремени, СправочникСсылка.ЕдиницыИзмерения - единица измерения ресурса.
//
Функция ПолучитьЕдиницуИзмТЧ(Ресурс, ДопПараметрыПодбора = Неопределено) Экспорт
		
	Возврат упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры(Ресурс);
	
КонецФункции

// Получает основной договор контрагента.
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагенты - контрагент.
//
// Возвращаемое значение:
//	СправочникСсылка.ДоговорыКонтрагентов - договор контрагента.
//
Функция ОсновнойДоговорКонтрагента(Контрагент) Экспорт
	
	Возврат Контрагент.упоОсновнойДоговорКонтрагента;
	
КонецФункции

// Получает значение реквизита основного договора контрагента.
//
// Параметры:
//  ОсновнойДоговорКонтрагента	 - СправочникСсылка.ДоговорыКонтрагентов - договор контрагента.
//  имяРеквизитаВалютыДоговора	 - Строка - имя реквизита.
//
// Возвращаемое значение:
//	Произвольный - значение реквизита.
//
Функция ВалютаДоговораКонтрагента(ОсновнойДоговорКонтрагента, имяРеквизитаВалютыДоговора) Экспорт
	
	Возврат ОсновнойДоговорКонтрагента[имяРеквизитаВалютыДоговора];
	
КонецФункции

// Получает валюту основного договора контрагента.
//
// Параметры:
//  ОсновнойДоговорКонтрагента	 - СправочникСсылка.ДоговорыКонтрагентов - договор контрагента.
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты - валюта.
//
Функция ПолучитьВалютуДоговораКонтрагента(ОсновнойДоговорКонтрагента) Экспорт
	
	Возврат упоУправлениеДоговорамиСервер.ВалютаДоговораКонтрагента(ОсновнойДоговорКонтрагента);
	
КонецФункции 

// Возвращает направление движения денежных средств из статьи ДДС.
//
// Параметры:
//  СтатьяДДС	 - СправочникСсылка.СтатьиДвиженияДенежныхСредств - статья ДДС.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.упоНаправлениеДвиженияДенежныхСредств - направление движения.
//
Функция ПолучитьНаправлениеДДС(СтатьяДДС) Экспорт
	
	Возврат СтатьяДДС.упоНаправлениеДвижения;
	
КонецФункции

// Заполняет информацию по трудовому ресуру в строке.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции - строка табличной части.
//  ПараметрыПодбора	 - Структура - параметры подбора.
//  Объект				 - Произвольный - объект или ссылка на обьъект, содержащий табличную часть.
//  мДанные				 - Произвольный - не используется.
//  ДопПараметрыПодбора	 - Произвольный - не используется.
//
Процедура ЗаполнитьИнформациюТрудовыеРесурыВСтроке(СтрокаТабличнойЧасти,
												   ПараметрыПодбора,
												   Объект,
												   мДанные,
												   ДопПараметрыПодбора) Экспорт
	
	ПриИзмененииРесурсаТабЧастиВызовСервера(СтрокаТабличнойЧасти, Объект, Объект.НормаСтоимостиТрудовыхРесурсов);
	СтрокаТабличнойЧасти.ПрофильРаспределения =
		Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение;

	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Подразделение) Тогда
	   СтрокаТабличнойЧасти.Подразделение = 
	   	упоУправлениеФормамиСервер.ПолучитьПодразделениеРолиВызовСервера(СтрокаТабличнойЧасти.Ресурс);
	КонецЕсли;
			
КонецПроцедуры

// Функция возвращает строку календаря
//
// Параметры:
//  ДатаНач					 - Дата					 - дата начала, от которой считается задержка.
//  КоличествоДней			 - Число				 - количество дней задержки.
//  Календарь				 - СправочникСсылка.упоРабочиеКалендари	 - календарь, на основании которого считается задержка.
//  таблицаКалендаря		 - ТаблицаЗначений						 - талица календаря.
//  таблицаКалендаряПолные	 - ТаблицаЗначений						 - талица календаря.
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - Строка ТЗ таблицаКалендаря.
//
Функция НайтиСтрокуДня(ДатаНач, КоличествоДней, Календарь, таблицаКалендаря, таблицаКалендаряПолные) Экспорт
	
	пДень = ДатаНач;
	
	Если таблицаКалендаря = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	строкаДня = таблицаКалендаря.Найти(НачалоДня(пДень), "День");
	
	Если ЗначениеЗаполнено(строкаДня) Тогда
		Возврат строкаДня;
	КонецЕсли;
	
	// Не нашли строку дня - проверим, а вдруг это просто не рабочий день недели
	Если таблицаКалендаряПолные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	строкаДняПолные = таблицаКалендаряПолные.Найти(НачалоДня(пДень), "День");
	Если строкаДняПолные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Все-таки нашли.
	// Тогда в зависимости от задержки найдем близлежайший рабочий день.
	// Если задержка "-" тогда идем вверх иначе вниз.
	индексСтроки = таблицаКалендаряПолные.Индекс(строкаДняПолные);
	новаяСтрока = Неопределено;
	Пока Истина Цикл
		Если КоличествоДней < 0 Тогда
			индексСтроки = индексСтроки + 1;
		Иначе
			индексСтроки = индексСтроки - 1;
		КонецЕсли;
		
		Если индексСтроки < 0 Тогда
			сохрДата = таблицаКалендаряПолные[0].День;
			увелДата = ДобавитьМесяц(таблицаКалендаряПолные[0].День, -1);
			Если НЕ УвеличитьКалендарь(увелДата, Календарь, таблицаКалендаря, таблицаКалендаряПолные) Тогда
				НСтрока = НСтр("ru = 'Нет календаря на дату: %1 по календарю %2'");
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, увелДата, Календарь);
				Сообщение.Сообщить();
				Прервать;
			КонецЕсли;
			
			строкаСохр = таблицаКалендаряПолные.Найти(сохрДата, "День");
			индексСтроки = таблицаКалендаряПолные.Индекс(строкаСохр) - 1;
		ИначеЕсли индексСтроки > таблицаКалендаряПолные.Количество() - 1 Тогда
			сохрДата = таблицаКалендаряПолные[таблицаКалендаряПолные.Количество() - 1].День;
			увелДата = ДобавитьМесяц(таблицаКалендаряПолные[таблицаКалендаряПолные.Количество() - 1].День, 1);
			Если НЕ УвеличитьКалендарь(увелДата, Календарь, таблицаКалендаря, таблицаКалендаряПолные) Тогда
				НСтрока = НСтр("ru = 'Нет календаря на дату: %1 по календарю %2'");
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, увелДата, Календарь);
				Сообщение.Сообщить();
				Прервать;
			КонецЕсли;
			
			строкаСохр = таблицаКалендаряПолные.Найти(сохрДата, "День");
			индексСтроки = таблицаКалендаряПолные.Индекс(строкаСохр) + 1;
		КонецЕсли;
		
		новаяСтрока = таблицаКалендаряПолные[индексСтроки];
		Если новаяСтрока.КоличествоЧасов > 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если новаяСтрока = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат таблицаКалендаря.Найти(новаяСтрока.День, "День");
	
КонецФункции
 
// Функция к уже имеющимся данным календаря добавляет новые записи
//
// Параметры: 
//  ДопДата					 - Дата 		   - дата на которую увеличиваем календать.
//  Календарь				 - СправочникСсылка.упоРабочиеКалендари - календарь, на основании которого считается задержка.
//  таблицаКалендаря		 - ТаблицаЗначений - талица календаря.
//  таблицаКалендаряПолные	 - ТаблицаЗначений - талица календаря.
//
// Возвращаемое значение:
//	Булево - Признак удалось ли найти календарь на указанную дату.
//
Функция УвеличитьКалендарь(ДопДата, Календарь, таблицаКалендаря, таблицаКалендаряПолные) Экспорт
	
	допТаблицаКалендаря = мПолучитьРабочийКалендарь(Календарь, ДопДата);
	Если допТаблицаКалендаря = Неопределено Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	Если ТаблицаКалендаря = Неопределено Тогда
		ТаблицаКалендаря = допТаблицаКалендаря.Скопировать();
		ТаблицаКалендаря.Индексы.Добавить("День");
	Иначе
		Для каждого лСтрока Из допТаблицаКалендаря Цикл
	    	новаяСтрока = ТаблицаКалендаря.Добавить();
			ЗаполнитьЗначенияСвойств(новаяСтрока, лСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаКалендаря.Сортировать("День");
	
	// Календарь полный со всеми днями
	допТаблицаКалендаряПолные = мПолучитьРабочийКалендарь(Календарь, ДопДата, Ложь);
	Если допТаблицаКалендаряПолные = Неопределено Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	Если ТаблицаКалендаряПолные = Неопределено Тогда
		ТаблицаКалендаряПолные = допТаблицаКалендаряПолные.Скопировать();
		ТаблицаКалендаряПолные.Индексы.Добавить("День");
	Иначе
		Для каждого лСтрока Из допТаблицаКалендаряПолные Цикл
	    	новаяСтрока = ТаблицаКалендаряПолные.Добавить();
			ЗаполнитьЗначенияСвойств(новаяСтрока, лСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаКалендаряПолные.Сортировать("День");
	
	Возврат Истина;
	
КонецФункции

// Рассчитывает задержку по календарю от даты.
//
// Параметры:
//  ДатаНачала	 - Дата		 - дата начала, от которой считается задержка.
//  ДатаЗаказа	 - Дата		 - дата заказа, до которой считается задержка.
//  Проект		 - СправочникСсылка.Проекты	 - проект, на основании которого считается календарь.
// 
// Возвращаемое значение:
//  Структура, Неопределено - дата, рассчитанная как дата начала плюс количество дней с учетом календаря.
//
Функция РассчитатьЗадержкуПоКалендарюСтрокиТаблицы(Знач ДатаНачала, Знач ДатаЗаказа, Проект) Экспорт 
	
	ДатаНачала = НачалоДня(ДатаНачала);
	ДатаЗаказа = НачалоДня(ДатаЗаказа);
	
	Календарь = упоПроектыИЗадачиВызовСервера.обПолучитьБанковскийКалендарьПроекта(Проект);
	
	Знак = ?(ДатаНачала > ДатаЗаказа, -1, 1);
	
	ТаблицаКалендаря = Неопределено;
	ТаблицаКалендаряПолные = Неопределено;	
	СтрокаДня = Неопределено;
	
	ШаблонСообщения = НСтр("ru = 'Нет календаря на дату: %1 по календарю %2'");
	
	Если Не УвеличитьКалендарь(ДатаНачала, Календарь, ТаблицаКалендаря, ТаблицаКалендаряПолные) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ДатаНачала, Календарь);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
		
	СтрокаДатыНачала = НайтиСтрокуДня(ДатаНачала, 0, Календарь, ТаблицаКалендаря, ТаблицаКалендаряПолные);
	СтрокаДня = НайтиСтрокуДня(ДатаЗаказа, 0, Календарь, ТаблицаКалендаря, ТаблицаКалендаряПолные);
	
	множитель = 1;
	Пока СтрокаДня = Неопределено Цикл
		
		УвеличиваемаяДата = ДобавитьМесяц(ДатаНачала, Знак * 12 * множитель);
		Если Не УвеличитьКалендарь(УвеличиваемаяДата, Календарь, ТаблицаКалендаря, ТаблицаКалендаряПолные) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, УвеличиваемаяДата, Календарь);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
		КонецЕсли;
		
		множитель = множитель + 1;
		СтрокаДня = НайтиСтрокуДня(ДатаЗаказа, 0, Календарь, ТаблицаКалендаря, ТаблицаКалендаряПолные);
		
	КонецЦикла;
	
	НайденнаяДата = СтрокаДня.День;
	Задержка = ТаблицаКалендаря.Индекс(СтрокаДня) - ТаблицаКалендаря.Индекс(СтрокаДатыНачала);	
	
	Возврат Новый Структура("ДатаПоКалендарю, Задержка", НайденнаяДата, Задержка);  
	
КонецФункции

// См. Справочники.упоРоли.РолиПодразделений
//
Функция ДоступныеРолиПоПодразделению(СписокПодразделений) Экспорт
	
	Возврат Справочники.упоРоли.РолиПодразделений(СписокПодразделений);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция мПолучитьРабочийКалендарь(Календарь, ГодКалендаря, БезВыходных = Истина)
	
	Возврат упоДвиженияДенежныхСредствСерверПовтИспВыз.ПолучитьРабочийКалендарь(Календарь, НачалоГода(ГодКалендаря), БезВыходных); 

КонецФункции

#КонецОбласти