
Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ДоступСКУД.ЗоныИТочкиДоступа КАК ИКТ_ДоступСКУДЗоныИТочкиДоступа
	|ГДЕ
	|	ИКТ_ДоступСКУДЗоныИТочкиДоступа.ЗонаДоступа.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИКТ_ЗоныДолжностей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ЗоныДолжностей КАК ИКТ_ЗоныДолжностей
	|ГДЕ
	|	ИКТ_ЗоныДолжностей.Зона.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИКТ_ЗоныПодразделений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИКТ_ЗоныПодразделений КАК ИКТ_ЗоныПодразделений
	|ГДЕ
	|	ИКТ_ЗоныПодразделений.Зона.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	Выборка1 = ПакетыЗапроса[0].Выбрать();
	Пока Выборка1.Следующий() Цикл
		ЗаписьДоступСКУД = Выборка1.Ссылка.ПолучитьОбъект();
		МассивСтрок = ЗаписьДоступСКУД.ЗоныИТочкиДоступа.НайтиСтроки(Новый Структура("ЗонаДоступа",ЭтотОбъект.Ссылка));
		Для Каждого Стр Из МассивСтрок Цикл
			ЗаписьДоступСКУД.ЗоныИТочкиДоступа.Удалить(Стр);		
		КонецЦикла;
		ЗаписьДоступСКУД.Записать();
	КонецЦикла;
	Выборка2 = ПакетыЗапроса[1].Выбрать();
	Пока Выборка2.Следующий() Цикл
		ЗаписьЗоныДолжностей = Выборка2.Ссылка.ПолучитьОбъект();
		ЗаписьЗоныДолжностей.ПометкаУдаления = Истина;
		ЗаписьЗоныДолжностей.Записать();
	КонецЦикла;
	Выборка3 = ПакетыЗапроса[2].Выбрать();
	Пока Выборка3.Следующий() Цикл
		ЗаписьЗоныПодразделений = Выборка3.Ссылка.ПолучитьОбъект();
		ЗаписьЗоныПодразделений.ПометкаУдаления = Истина;
		ЗаписьЗоныПодразделений.Записать(); 
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТребуетсяДопуск Тогда
		ПроверяемыеРеквизиты.Добавить("ГруппаДопуска");	
	КонецЕсли;
	
КонецПроцедуры
