
&ИзменениеИКонтроль("ПолучитьДанныеПоПроектнойЗадачеДляЗаполненияПоручения")
Функция Расш1_ПолучитьДанныеПоПроектнойЗадачеДляЗаполненияПоручения(ПроектнаяЗадача)

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоПроектнаяЗадача.Проект КАК Проект,
	|	упоВерсииПроекта.Версия КАК Версия
	|ПОМЕСТИТЬ втТекущиеВерсии
	|ИЗ
	|	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоПроектнаяЗадача.Проект = упоВерсииПроекта.Проект
	|			И (упоВерсииПроекта.Текущая)
	|ГДЕ
	|	упоПроектнаяЗадача.Ссылка = &ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаОкончанияПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ втСрокиПроектнойЗадачи
	|ИЗ
	|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	|			,
	|			ПроектнаяЗадача = &ПроектнаяЗадача
	|				И Версия В
	|					(ВЫБРАТЬ
	|						втТекущиеВерсии.Версия
	|					ИЗ
	|						втТекущиеВерсии КАК втТекущиеВерсии)) КАК упоСрокиПроектныхЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Ссылка КАК СсылкаНаПроект,
	|	Проекты.упоКорневойПроект КАК упоКорневойПроект,
	|	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу
	|ПОМЕСТИТЬ втПроект
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.СсылкаНаПроектнуюЗадачу = &ПроектнаяЗадача
	|	И НЕ Проекты.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ОписаниеРезультата КАК ОписаниеРезультата,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ втСвойстваПроектнойЗадачи
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			,
	|			ПроектнаяЗадача = &ПроектнаяЗадача
	|				И Версия В
	|					(ВЫБРАТЬ
	|						втТекущиеВерсии.Версия
	|					ИЗ
	|						втТекущиеВерсии КАК втТекущиеВерсии)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|;
	#Вставка
	//{[+] ИКТ №18794 (фрагмент ДОБАВЛЕН), Новоселов, 17.06.2026 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упоПроектнаяЗадача.Ссылка КАК ПроектнаяЗадача,
	|	ЕСТЬNULL(МАКСИМУМ(упоСтатусыПредшествующихЗадач.СтатусЗадачи <> ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена)), ЛОЖЬ) КАК ЕстьНезавершенныеПредшествующиеЗадачи,
	|	ЕСТЬNULL(МАКСИМУМ(СтатусыЗаданийПараллельныхЗадач.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.ИКТ_Запланировано)), ЛОЖЬ) КАК ЕстьЗапланированныеЗаданияПараллельныхЗадач
	|ПОМЕСТИТЬ ВТ_СостоянияСвязанныхЗаданий
	|ИЗ
	|	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК ПредшествующиеПроектныеЗадачи
	|		ПО (упоПроектнаяЗадача.Ссылка = ПредшествующиеПроектныеЗадачи.Ссылка)
	|			И (ПредшествующиеПроектныеЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.ОкончаниеНачало))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК упоСтатусыПредшествующихЗадач
	|			ПО (ПредшествующиеПроектныеЗадачи.ЗадачаПредшественник = упоСтатусыПредшествующихЗадач.ПроектнаяЗадача)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК ПараллельныеПроектныеЗадачи
	|		ПО (упоПроектнаяЗадача.Ссылка = ПараллельныеПроектныеЗадачи.Ссылка)
	|			И (ПараллельныеПроектныеЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.НачалоНачало))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК ЗаданияПараллельныхЗадач
	|		ПО ПараллельныеПроектныеЗадачи.ЗадачаПредшественник = ЗаданияПараллельныхЗадач.ОбъектБазы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК СтатусыЗаданийПараллельныхЗадач
	|			ПО ЗаданияПараллельныхЗадач.Ссылка = СтатусыЗаданийПараллельныхЗадач.Задание		
	|ГДЕ
	|	упоПроектнаяЗадача.Ссылка = &ПроектнаяЗадача
	|
	|СГРУППИРОВАТЬ ПО
	|	упоПроектнаяЗадача.Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	&ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ЕСТЬNULL(МАКСИМУМ(упоСтатусыПредшествующихЗадач.СтатусЗадачи <> ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена)), ЛОЖЬ) КАК ПредшествующийЭтапНеЗавершен
	|ПОМЕСТИТЬ ВТ_ЗавершенностьПредшествующегоЭтапа
	|ИЗ
	|	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача.ПредусловияЗадачи КАК ПредшествующиеПроектныеЗадачи
	|		ПО (упоПроектнаяЗадача.ЗадачаРодитель = ПредшествующиеПроектныеЗадачи.Ссылка)
	|			И (ПредшествующиеПроектныеЗадачи.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.упоТипСвязи.ОкончаниеНачало))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК упоСтатусыПредшествующихЗадач
	|			ПО (ПредшествующиеПроектныеЗадачи.ЗадачаПредшественник = упоСтатусыПредшествующихЗадач.ПроектнаяЗадача)
	|ГДЕ
	|	упоПроектнаяЗадача.Ссылка = &ПроектнаяЗадача
	|
	|СГРУППИРОВАТЬ ПО
	|	&ПроектнаяЗадача
	|;
	//[+]} ИКТ №18794
	#КонецВставки
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РуководительПроектнойЗадачи,
	|	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача КАК ПроектнаяЗадача
	|ПОМЕСТИТЬ втРуководительПроектнойЗадачи
	|ИЗ
	|	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	|ГДЕ
	|	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача = &ПроектнаяЗадача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоРуководителиПроектовСрезПоследних.РуководительПроекта КАК РуководительПроекта,
	|	упоРуководителиПроектовСрезПоследних.Проект КАК Проект
	|ПОМЕСТИТЬ втРуководителиПроектов
	|ИЗ
	|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(
	|			,
	|			Проект В
	|				(ВЫБРАТЬ
	|					втТекущиеВерсии.Проект
	|				ИЗ
	|					втТекущиеВерсии КАК втТекущиеВерсии)) КАК упоРуководителиПроектовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втСвойстваПроектнойЗадачи.НазваниеЗадачи КАК Наименование,
	|	втСвойстваПроектнойЗадачи.ВидОперации КАК ВидОперации,
	|	втСвойстваПроектнойЗадачи.ОписаниеРезультата КАК ОписаниеРезультата,
	|	втСрокиПроектнойЗадачи.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	втСрокиПроектнойЗадачи.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	втПроект.СсылкаНаПроект КАК ПроектнаяЗадача,
	|	втПроект.упоКорневойПроект КАК Проект,
	|	втПроект.упоКорневойПроект.ПортфельПроектов КАК ПортфельПроекта,
	|	втСвойстваПроектнойЗадачи.ПроектнаяЗадача КАК ОбъектБазы,
	#Вставка
	//{[+] ИКТ №18794 (фрагмент ДОБАВЛЕН), Новоселов, 17.06.2026 
	|	ВТ_СостоянияСвязанныхЗаданий.ЕстьНезавершенныеПредшествующиеЗадачи КАК ЕстьНезавершенныеПредшествующиеЗадачи,
	|	ВТ_СостоянияСвязанныхЗаданий.ЕстьЗапланированныеЗаданияПараллельныхЗадач КАК ЕстьЗапланированныеЗаданияПараллельныхЗадач,
	|	ВТ_ЗавершенностьПредшествующегоЭтапа.ПредшествующийЭтапНеЗавершен КАК ПредшествующийЭтапНеЗавершен,
	//[+]} ИКТ №18794
	#КонецВставки
	|	ВЫБОР
	|		КОГДА втРуководительПроектнойЗадачи.РуководительПроектнойЗадачи = ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)
	|				ИЛИ втРуководительПроектнойЗадачи.РуководительПроектнойЗадачи ЕСТЬ NULL
	|			ТОГДА втРуководителиПроектов.РуководительПроекта
	|		ИНАЧЕ втРуководительПроектнойЗадачи.РуководительПроектнойЗадачи
	|	КОНЕЦ КАК Контролер
	|ИЗ
	|	втСвойстваПроектнойЗадачи КАК втСвойстваПроектнойЗадачи
	#Вставка
	//{[+] ИКТ №18974 (фрагмент ДОБАВЛЕН), Новоселов, 17.06.2026
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияСвязанныхЗаданий КАК ВТ_СостоянияСвязанныхЗаданий
	|		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = ВТ_СостоянияСвязанныхЗаданий.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗавершенностьПредшествующегоЭтапа КАК ВТ_ЗавершенностьПредшествующегоЭтапа
	|		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = ВТ_ЗавершенностьПредшествующегоЭтапа.ПроектнаяЗадача
	//[+]} ИКТ №18794
	#КонецВставки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСрокиПроектнойЗадачи КАК втСрокиПроектнойЗадачи
	|		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = втСрокиПроектнойЗадачи.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПроект КАК втПроект
	|		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = втПроект.СсылкаНаПроектнуюЗадачу
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРуководительПроектнойЗадачи КАК втРуководительПроектнойЗадачи
	|		ПО втСвойстваПроектнойЗадачи.ПроектнаяЗадача = втРуководительПроектнойЗадачи.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРуководителиПроектов КАК втРуководителиПроектов
	|		ПО (ИСТИНА)";

	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);

	ТаблицаПроектнаяЗадача = Запрос.Выполнить().Выгрузить();

	ДанныеЗадачи = Новый Структура;

	Для Каждого Колонка Из ТаблицаПроектнаяЗадача.Колонки Цикл
		ДанныеЗадачи.Вставить(Колонка.Имя);
	КонецЦикла;
	Если ТаблицаПроектнаяЗадача.Количество() Тогда 
		ЗаполнитьЗначенияСвойств(ДанныеЗадачи, ТаблицаПроектнаяЗадача[0]);
	КонецЕсли;

	Возврат ДанныеЗадачи;

КонецФункции

&ИзменениеИКонтроль("СоздатьПоручениеЗадачи")
Функция Расш1_СоздатьПоручениеЗадачи(ДанныеЗадачи, Исполнитель, ЭтоОсновноеЗадание, ВидЗаданияПодразделению)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДанныеПроектнойЗадачиДляСозданияПоручения", ДанныеЗадачи);
	ДанныеЗаполнения.Вставить("Исполнитель", Исполнитель);
	ДанныеЗаполнения.Вставить("ЭтоОсновноеЗадание", ЭтоОсновноеЗадание);
	ДанныеЗаполнения.Вставить("ВидЗаданияПодразделению", ВидЗаданияПодразделению);

	НовоеЗадание = Справочники.упоЗадания.СоздатьЭлемент();

	НовоеЗадание.Заполнить(ДанныеЗаполнения);

	НовоеЗадание.Записать();
	
	#Удаление
	упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(НовоеЗадание.Ссылка, 
	ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выдано"), "");
	#КонецУдаления
	#Вставка
	//{[*] ИКТ №18794 (фрагмент ИЗМЕНЕН), Новоселов, 17.06.2026 
	Если ТипЗнч(ДанныеЗадачи) = Тип("Структура") 
		И ((ДанныеЗадачи.Свойство("ЕстьНезавершенныеПредшествующиеЗадачи") И ДанныеЗадачи.ЕстьНезавершенныеПредшествующиеЗадачи) 
			ИЛИ (ДанныеЗадачи.Свойство("ЕстьЗапланированныеЗаданияПараллельныхЗадач") И ДанныеЗадачи.ЕстьЗапланированныеЗаданияПараллельныхЗадач)
			ИЛИ (ДанныеЗадачи.Свойство("ПредшествующийЭтапНеЗавершен") И ДанныеЗадачи.ПредшествующийЭтапНеЗавершен)) Тогда
		СтатусНовогоЗадания = Перечисления.упоСтатусыЗаданий.ИКТ_Запланировано;
	Иначе
		СтатусНовогоЗадания = Перечисления.упоСтатусыЗаданий.Выдано;
	КонецЕсли;
	
	упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(НовоеЗадание.Ссылка, 
		СтатусНовогоЗадания, "");
	//[*]} ИКТ №18794
	#КонецВставки

	Если ТипЗнч(ДанныеЗадачи) = Тип("Структура") 
		И ДанныеЗадачи.Свойство("ДатаНачалаПлан") 
		И ДанныеЗадачи.Свойство("ДатаОкончанияПлан") Тогда

		упоЗаданияСервер.ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(НовоеЗадание.Ссылка, 
		ДанныеЗадачи.ДатаНачалаПлан, ДанныеЗадачи.ДатаОкончанияПлан)
	КонецЕсли;

	Возврат НовоеЗадание.Ссылка;

КонецФункции

&ИзменениеИКонтроль("ОбновитьСвойстваСтатусыПоручений")
Процедура Расш1_ОбновитьСвойстваСтатусыПоручений(РезультатЗапроса)

	Если РезультатЗапроса.Пустой() Тогда
		Возврат; // Возврат
	КонецЕсли;

	СтатусЗадания_Отменено = Перечисления.упоСтатусыЗаданий.Отменено;
	#Вставка
	ОбъектБазыОтмененногоЗадания = Неопределено;  //[+] ИКТ №20792 (строка ДОБАВЛЕНА), Новоселов, 11.08.2026 
	#КонецВставки

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		ОбъектЗадание = Неопределено;
		ЭтоЗаданиеПроектнойПродукции = упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Выборка.ОбъектБазы);
		Если ЗначениеЗаполнено(Выборка.НаименованиеЗадачи) 
			И Выборка.НаименованиеЗадания <> Выборка.НаименованиеЗадачи И Не ЭтоЗаданиеПроектнойПродукции Тогда
			ОбъектЗадание = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектЗадание.Наименование = Выборка.НаименованиеЗадачи;
		КонецЕсли;
		Если Выборка.ПроектЗадания <> Выборка.ПроектЗадачи Тогда
			Если ОбъектЗадание = Неопределено Тогда
				ОбъектЗадание = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			ОбъектЗадание.Проект = Выборка.ПроектЗадачи;
		КонецЕсли;
		Если ОбъектЗадание <> Неопределено Тогда
			ОбъектЗадание.ОбменДанными.Загрузка = Истина;
			ОбъектЗадание.Записать();
		КонецЕсли;

		Если Выборка.РесурсСнят И Не ЭтоЗаданиеПроектнойПродукции Тогда

			Если Не Выборка.СтатусЗадания = СтатусЗадания_Отменено Тогда
				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
				СтатусЗадания_Отменено, 
				НСтр("ru = 'Исполнитель снят с задачи.'"));
				#Вставка
				//{[+] ИКТ №20792 (фрагмент ДОБАВЛЕН), Новоселов, 11.08.2026 У отменяемого задания снимаю признак основного поручения
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка, "ЭтоОсновноеЗаданиеПроектнойЗадачи") Тогда
					
					ОбъектБазыОтмененногоЗадания = Выборка.ОбъектБазы;
					ЗаданиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
					
					ЗаданиеОбъект.ЭтоОсновноеЗаданиеПроектнойЗадачи = Ложь;
					Попытка
						ЗаданиеОбъект.Записать();
					Исключение
						ЗаписьЖурналаРегистрации(
							"Данные.Изменение",
							УровеньЖурналаРегистрации.Ошибка,
							Справочники.упоЗадания.Метаданные(),
							ЗаданиеОбъект,
							ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					КонецПопытки;
					
				КонецЕсли;
				//[+]} ИКТ №20792
				#КонецВставки
			КонецЕсли;

		Иначе

			Если Выборка.СтатусЗадания = СтатусЗадания_Отменено Тогда
				Продолжить;
			КонецЕсли;

			ЗадачаЗавершенаЗакрыта = 
			Выборка.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Завершена 
			Или Выборка.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта;

			Если Выборка.ЗадачаОтменена Тогда

				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
				СтатусЗадания_Отменено, 
				НСтр("ru = 'Задача отменена.'"));

			ИначеЕсли ЗадачаЗавершенаЗакрыта
				И Не Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Закрыто Тогда

				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
				Перечисления.упоСтатусыЗаданий.Закрыто, 
				НСтр("ru = 'Задача завершена.'"));

			ИначеЕсли ЗначениеЗаполнено(Выборка.СтатусЗадачи)
				И Не ЗадачаЗавершенаЗакрыта
				И Не (Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Выдано
				Или Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Уточняется
				#Вставка
	            Или Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.ИКТ_Запланировано  //[+] ИКТ №18794 (строка ДОБАВЛЕНА), Новоселов, 17.06.2026
				Или Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Завершено  //[+] ИКТ №20184 (строка ДОБАВЛЕНА), Новоселов, 20.07.2026 
				#КонецВставки
				Или Выборка.СтатусЗадания = Перечисления.упоСтатусыЗаданий.Выполняется) Тогда

				упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Выборка.Ссылка, 
				Перечисления.упоСтатусыЗаданий.Выдано, 
				НСтр("ru = 'Выполнение задачи продолжается.'"));

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;
	#Вставка
	//{[+] ИКТ №20660 (фрагмент ДОБАВЛЕН), Новоселов, 11.08.2026 Может быть такое, что в выборке задание,
	// у которого надо снять признак основного поручения, встретится позже, чем задание которому надо признак установить
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.РесурсСнят
				И Выборка.СтатусЗадания <> СтатусЗадания_Отменено
				И ОбъектБазыОтмененногоЗадания = Выборка.ОбъектБазы
				И ТипЗнч(Выборка.ОбъектБазы) = Тип("ДокументСсылка.упоПроектнаяЗадача")
				И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Ссылка, "ЭтоОсновноеЗаданиеПроектнойЗадачи") Тогда
			
			ЗаданиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЗаданиеОбъект.ЭтоОсновноеЗаданиеПроектнойЗадачи = Истина;
			Попытка
				ЗаданиеОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(
					"Данные.Изменение",
					УровеньЖурналаРегистрации.Ошибка,
					Справочники.упоЗадания.Метаданные(),
					ЗаданиеОбъект,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЕсли;
	КонецЦикла;
	//[+]} ИКТ №20660
	#КонецВставки

КонецПроцедуры
