
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// +++ ИКТ_Андреев_Добавление_24.02.2025
	ИКТ_RequestСерверПривилегированный.ИКТ_ДобавитьЭлементыСостоянияРеквестНаФорму(ЭтаФорма, Элементы.IDДолжностьС); 
	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере(); 
	// --- ИКТ_Андреев_Добавление_24.02.2025

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// +++ ИКТ_Андреев_Добавление_24.02.2025
	ПодключитьОбработчикОжидания("ИКТ_ОбновитьСостояниеОбменаСРеквест", 60, Ложь);
	// --- ИКТ_Андреев_Добавление_24.02.2025

КонецПроцедуры


// +++ ИКТ_Андреев_Добавление_24.02.2025
&НаКлиенте
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквест()
	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();
	
КонецПроцедуры

// +++ ИКТ_Андреев_Добавление_24.02.2025
&НаСервере
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Результат = ИКТ_RequestСерверПривилегированный.ПолучитьСоостояниеОбменаСРеквестПоОбъекту(Объект.Ссылка);
		
		Если Не ЗначениеЗаполнено(Результат.Период) Тогда
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Не выполнялся";
			
		ИначеЕсли Результат.Ошибка = Ложь и Результат.Выгружен = Ложь Тогда
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Объект в очереди на выгрузку";  
			
		ИначеЕсли Результат.Ошибка = Истина Тогда
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = СтрШаблон("Ошибка обмена. Дата выгрузки %1", Результат.Период);
			
		Иначе 
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен выполнен";
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен будет выполнен после записи объекта";
		
	КонецЕсли;
	
КонецПроцедуры

