
#Область ПрограммныйИнтерфейс

// Вызов в начале итерации цикла обхода коллекции ОбрабатываемыеОбъекты
//
// Параметры:
//	ДанныеОбъекта - Произвольный - Объект из коллекции ОбработываемыеОбъекты
//
// Возвращаемое значение:
//	Булево - Признак возможности изменения заданного объекта
//
Функция ОпределитьВозможностьИзменения(ДанныеОбъекта) Экспорт
	
	МожноИзменить = Истина;
	Ссылка = ДанныеОбъекта.Ссылка;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда		
		МожноИзменить = ОпределитьВозможностьИзмененияПроектнойЗадачи(Ссылка);		
	КонецЕсли;
	
	Возврат МожноИзменить;
	
КонецФункции

// Вызов после получения объекта
//
// Параметры:
//	Объект - Произвольный - Произвольный объект
//
Процедура ПослеПолученияОбъекта(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.упоПроектнаяЗадача") Тогда
		Объект.ПолучитьДанныеВерсии(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция	ОпределитьВозможностьИзмененияПроектнойЗадачи(ПроектнаяЗадача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЕСТЬNULL(упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена, ИСТИНА) КАК ЗадачаОтменена
	|ИЗ
	|	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|				И (упоВерсииПроекта.Текущая)
	|		ПО (упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка)
	|ГДЕ
	|	(упоПроектнаяЗадача.Проведен
	|			ИЛИ упоПроектнаяЗадача.ПометкаУдаления)
	|	И упоПроектнаяЗадача.Ссылка = &ПроектнаяЗадача";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	
	МожноИзменять = Истина;
	Пока Выборка.Следующий() Цикл
		МожноИзменять = Не Выборка.ЗадачаОтменена;	
	КонецЦикла;
	
	Возврат МожноИзменять;
	
КонецФункции

#КонецОбласти