////////////////////////////////////////////////////////////////////////////////
// Сопоставление ролей и трудовых ресурсов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает подразделение в состав которого входит указанная роль.
//
// Параметры:
//  Роль			 - СправочникСсылка.упоРоли
//  ДатаАктуальности - Дата
// 
// Возвращаемое значение:
//  СправочникСсылка.Подразделения - подразделение роли,
//  или пустая ссылка если для роли не определено подразделение.
//
Функция обПолучитьПодразделениеРоли(Роль, Знач ДатаАктуальности = Неопределено) Экспорт
	
	ПодразделениеРоли = Справочники.упоПодразделения.ПустаяСсылка(); 
			
	массивПодразделений = упоРесурсыИРолиСервер.ПолучитьМассивПодразделенийРоли(Роль, , ДатаАктуальности);
	Если массивПодразделений.Количество() > 0 Тогда
		ПодразделениеРоли = массивПодразделений[0];
	КонецЕсли;	
	
	Возврат ПодразделениеРоли;
	
КонецФункции

// Функция возвращает массив подразделений в состав которых входит указанная роль.
//
// Параметры:
//  Роль			 - СправочникСсылка.упоРоли
//  ДатаАктуальности - Дата
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.упоПодразделения - подразделения роли.
//
Функция обПолучитьМассивПодразделенийРоли(Роль, ДатаАктуальности = Неопределено) Экспорт
	
	Возврат упоРесурсыИРолиСервер.ПолучитьМассивПодразделенийРоли(Роль, , ДатаАктуальности);
	
КонецФункции

// Функция возвращает массив ролей, входящих в состав указанного подразделения.
//
// Параметры:
//  Подразделение	 - СправочникСсылка.упоПодразделения
// 
// Возвращаемое значение:
//  Массив - (СправочникСсылка.упоРоли).
//
Функция обПолучитьМассивРолейПодразделения(Подразделение) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.Роль
		|ИЗ
		|	РегистрСведений.упоСоставПодразделений.СрезПоследних(, Подразделение = &Подразделение) КАК Рег
		|ГДЕ
		|	Рег.ВходитВСостав = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	массивРолей = Новый Массив;
	Пока Выборка.Следующий() Цикл
		массивРолей.Добавить(Выборка.Роль);
	КонецЦикла;
	
    Возврат массивРолей;
	
КонецФункции

// Проверка, что заданный сотрудник управляется через заданного диспетчера (пользователя).
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Сотрудник	 - СправочникСсылка.упоСотрудники
// 
// Возвращаемое значение:
//  Булево - признак управления.
//
Функция обУправляетсяДиспетчером(Пользователь, Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Сотрудник"   , Сотрудник);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(Рег.ФлагУправления, ЛОЖЬ) КАК ФлагУправления
		|ИЗ
		|	РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(
		|		,
		|		Сотрудник = &Сотрудник
		|			И Пользователь = &Пользователь) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь; // Нет сведений.
	Иначе
		Возврат Результат.Выгрузить()[0].ФлагУправления;
	КонецЕсли;

КонецФункции

// Возвращает список ролей, на которые назначен трудовой ресурс.
//
// Параметры:
//  ТрудовойРесурс	 - СправочникСсылка.упоТрудовыеРесурсы	 - собственно ТР
// 
// Возвращаемое значение:
//  Массив - список ролей, на которые назначен ТР.
//
Функция обПолучитьТекщиеРолиТрудовогоРесурса(ТрудовойРесурс) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Рег.Роль
	               |ИЗ
	               |	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(, Ресурс = &ТрудовойРесурс) КАК Рег
	               |ГДЕ
	               |	Рег.РольНазначена = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТрудовойРесурс", ТрудовойРесурс);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Роль");

КонецФункции

// Возвращает текущего владельца ресурса
//
// Параметры:
//  Ресурс	 - СправочникСсылка.Номенклатура, СправочникСсылка.упоТрудовыеРесурсы	 - трудовой или материальный ресурс.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоСотрудники, Неопределено - владелец ресурса.
//
Функция обПолучитьТекущегоВладельцаРесурса(Ресурс) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	РегВладелец.Сотрудник,
	               |	РегВладелец.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.упоВладениеРесурсами.СрезПоследних(, Ресурс = &Ресурс) КАК РегВладелец
	               |ГДЕ
	               |	РегВладелец.ВладеетРесурсом = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РегВладелец.Сотрудник,
	               |	РегВладелец.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 	
		Возврат Выборка.Сотрудник;	
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции
 
#КонецОбласти