////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции интеграции с EPM.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет переопределяемую команду ERP.
//
// Параметры:
//  Форма					 - Произвольный	 - не используется.
//  Команда					 - Произвольный	 - не используется.
//  ДополнительныеПараметры	 - Произвольный	 - не используется.
//
Процедура ВыполнитьПереопределяемуюКоманду_ERP(Форма, Команда, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
		И Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2() Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "После записи".
//
// Параметры:
// 	Форма			- УправляемаяФорма - форма
//  ПараметрыЗаписи - Структура 	   - параметры записи
//
Процедура ПослеЗаписи_ERP(Форма, ПараметрыЗаписи) Экспорт
		
	Если Не упоИнтеграцияКлиентСервер.НеобходимаСинхронизацияСтатейДР() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьКэшСвязанныхЭлементов(Форма);	
	
КонецПроцедуры

// Выполняет проверку на модифицированность формы и открывает форму ERP, если форма модифицирована, 
// то показывает вопрос о необходимости сохранить изменения.
//
// Параметры:
//  Форма			   - ФормаКлиентскогоПриложения - форма проекта или форма проектной задачи.
//  ЭтоПроектнаяЗадача - Булево - Признак проектной задачи.
//  ЭтоОткрытиеИзПроекта - Булево - Признак вызова из формы ERP.
//
Процедура ПроверитьНаМодифицированностьИОткрытьФормуERP(Форма, ЭтоПроектнаяЗадача = Ложь,
	ЭтоОткрытиеИзПроекта = Ложь) Экспорт
	
	СсылкаНаОбъект = Форма.Объект.Ссылка;
	ИмяФормы = "Справочник.Проекты.Форма.ФормаЭлемента";
	ТекстЗаменыERPPM = "ERP";
	Если ЭтоОткрытиеИзПроекта Тогда
		Если ЗначениеЗаполнено(Форма.Объект.СсылкаНаПроектнуюЗадачу) Тогда
			СсылкаНаОбъект = Форма.Объект.СсылкаНаПроектнуюЗадачу;
			ИмяФормы = "Документ.упоПроектнаяЗадача.Форма.ФормаДокументаУправляемая";
		Иначе
			ИмяФормы = "Справочник.Проекты.Форма.упоФормаЭлементаУправляемая";
		КонецЕсли;
		ТекстЗаменыERPPM = "PM";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для открытия формы проекта %1 нужно сохранить объект.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекстЗаменыERPPM);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	Если Форма.Модифицированность Тогда
		
		ДопПараметры = Новый Структура("Форма, ЭтоПроектнаяЗадача, ЭтоОткрытиеИзПроекта",
			Форма, ЭтоПроектнаяЗадача, ЭтоОткрытиеИзПроекта);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаНаМодифицированностьЗавершение", ЭтотОбъект, ДопПараметры);
		
		Если ЭтоПроектнаяЗадача Тогда
			ТекстВопроса = 
				НСтр("ru = 'Карточка проектной задачи изменена. Сохранить изменения перед переходом на форму проекта %1?'");	
		Иначе
			ТекстВопроса = НСтр("ru = 'Карточка проекта изменена. Сохранить изменения перед переходом на форму проекта %1?'"); 
		КонецЕсли;
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ТекстЗаменыERPPM);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		
		Возврат;
		
	КонецЕсли;
			
	Если ЭтоПроектнаяЗадача Тогда
		Ключ = упоПроектыИЗадачиВызовСервера.обПолучитьСвязанныйЭлементПроекта(СсылкаНаОбъект);
	Иначе
		Ключ = СсылкаНаОбъект;
	КонецЕсли;
	
	Форма.Закрыть();
	ОткрытьФорму(ИмяФормы, Новый Структура("Ключ", Ключ));		
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Документооборот

Процедура ИнтеграцияС1СДокументооборотСоздатьПисьмо(МассивСсылок, ПараметрыВыполнения) Экспорт

	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		ПараметрКоманды = МассивСсылок;
	Иначе
		ПараметрКоманды = МассивСсылок[0];
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ИнтеграцияС1СДокументооборотСоздатьПисьмоПроверитьПодключениеЗавершение",
		ЭтотОбъект,
		ПараметрКоманды);
		
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПроверитьПодключение(ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры 

Процедура ИнтеграцияС1СДокументооборотСоздатьПисьмоПроверитьПодключениеЗавершение(Результат, ОбъектИС) Экспорт
	
	Если Результат = Истина Тогда // авторизация успешна
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ИнтеграцияС1СДокументооборотСоздатьПисьмоПоискСвязанногоОбъектаЗавершение", ЭтотОбъект, ОбъектИС);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.НачатьПоискСвязанногоОбъектаДО(ОбъектИС, ОписаниеОповещения);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не настроено подключение к 1С:Документообороту или сервис
			|1С:Документооборота недоступен. Обратитесь к администратору.';
			|en = 'Connection to 1C:Document Management is not configured or 1C:Document Management
			|service is not available. Contact administrator.'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнтеграцияС1СДокументооборотСоздатьПисьмоПоискСвязанногоОбъектаЗавершение(Результат, ОбъектИС) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Предмет", Результат);
	
	ОткрытьФорму("Обработка.ИнтеграцияС1СДокументооборот.Форма.ИсходящееПисьмо", Параметры);
	
КонецПроцедуры

Процедура ИнтеграцияС1СДокументооборотСоздатьБизнесПроцесс(МассивСсылок, ПараметрыВыполнения) Экспорт

	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		ПараметрКоманды = МассивСсылок;
	Иначе
		ПараметрКоманды = МассивСсылок[0];
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ИнтеграцияС1СДокументооборотСоздатьБизнесПроцессПроверитьПодключениеЗавершение",
		ЭтотОбъект,
		ПараметрКоманды);
		
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПроверитьПодключение(ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры 

Процедура ИнтеграцияС1СДокументооборотСоздатьБизнесПроцессПроверитьПодключениеЗавершение(Результат, ОбъектИС) Экспорт
	
	Если Результат = Истина Тогда // авторизация успешна
		
		ИнтеграцияС1СДокументооборотКлиент.СоздатьБизнесПроцесс(ОбъектИС);
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не настроено подключение к 1С:Документообороту или сервис
			|1С:Документооборота недоступен. Обратитесь к администратору.';
			|en = 'Connection to 1C:Document Management is not configured or 1C:Document Management
			|service is not available. Contact administrator.'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьКэшСвязанныхЭлементов(Форма)
	
	ИменаДействийДляОбновленияКешаФормы = Новый Соответствие;
	ИменаДействийДляОбновленияКешаФормы.Вставить("Справочник.СтруктураПредприятия.Форма.ФормаЭлемента",
		"СтруктураПредприятия");
	ИменаДействийДляОбновленияКешаФормы.Вставить("ПланВидовХарактеристик.СтатьиДоходов.Форма.ФормаЭлемента", "СтатьиДР");
	ИменаДействийДляОбновленияКешаФормы.Вставить("ПланВидовХарактеристик.СтатьиРасходов.Форма.ФормаЭлемента", "СтатьиДР");
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		ИменаДействийДляОбновленияКешаФормы.Вставить("ПланСчетов.Управленческий.Форма.ФормаСчета", "СтатьиДР");	
	КонецЕсли;	
	ИменаДействийДляОбновленияКешаФормы.Вставить("Справочник.СтруктурныеЕдиницы.Форма.ФормаЭлемента", "СтруктураПредприятия");
	
	ИмяДействия = ИменаДействийДляОбновленияКешаФормы[Форма.ИмяФормы];
	Если ИмяДействия = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	ЭлементДляПоискаСвязанногоЭлемента = Форма.Объект.Ссылка;
	упоПроектыИЗадачиКлиент.ОбновитьКэшСвязанныхЭлементов(ИмяДействия, ЭлементДляПоискаСвязанногоЭлемента);
	
КонецПроцедуры

Процедура ПроверкаНаМодифицированностьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	 
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ЭтоПроектнаяЗадача = ДополнительныеПараметры.ЭтоПроектнаяЗадача;
	ЭтоОткрытиеИзПроекта = ДополнительныеПараметры.ЭтоОткрытиеИзПроекта;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Форма.Модифицированность = Ложь;	
	КонецЕсли;	
		
	Если Результат = КодВозвратаДиалога.Да Тогда
		Форма.Записать();
	КонецЕсли;
	
	ПроверитьНаМодифицированностьИОткрытьФормуERP(Форма, ЭтоПроектнаяЗадача, ЭтоОткрытиеИзПроекта);
	
КонецПроцедуры

#КонецОбласти
