#Область ПрограммныйИнтерфейс

// Возвращает начало использования контура отражения факта в проектном бюджетировании.
//
// Возвращаемое значение:
//   Дата   - начало использования контура.
//
Функция НачалоИспользованияКонтураЭкономики() Экспорт
	
	Возврат Константы.упоНачалоИспользованияОтраженияПервичныхДокументовВПроектномБюджетировании.Получить();
	
КонецФункции	

// Возвращает типы значений реквизитов правила по разделам.
//
// Параметры:
//  Раздел  - ПеречислениеСсылка.упоРазделыПравилПроектногоБюджетирования - раздел правила.
//
// Возвращаемое значение:
//   Соответствие   - типы значений реквизитов по разделам:
//	 * Ключ     - ПеречислениеСсылка.упоРазделыПравилПроектногоБюджетирования - раздел правила.
//	 * Значение - Структура, см.ПолучитьТипыРеквизитов().
//
Функция ТипыЗначенийРеквизитовРазделаПравила(Раздел = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Раздел) Тогда
	
		ТипыРеквизитов = Новый Соответствие;
		
		МассивРазделов = Новый Массив;
		МассивРазделов.Добавить(Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы);
		МассивРазделов.Добавить(Перечисления.упоРазделыПравилПроектногоБюджетирования.ДДС);		
		Для Каждого Раздел Из МассивРазделов Цикл
			ТипыРеквизитов.Вставить(Раздел, ПолучитьТипыРеквизитов(Раздел));
		КонецЦикла;	
		
	Иначе		
		
		ТипыРеквизитов = ПолучитьТипыРеквизитов(Раздел);
		
	КонецЕсли;	
		
	Возврат ТипыРеквизитов;
	
КонецФункции

// Возвращает группу статусов, соответствующих расширенному группы.
//
// Параметры:
//  ИмяСтатуса  - Строка - расширенное имя статуса, возможные значения: 
//                 "Отражено", "ОшибкиОтражения", "КОтражению".
//
// Возвращаемое значение:
//   Массив - ПеречислениеСсылка.упоСтатусыОтраженияДокументовВПроектномБюджетировании - 
//					группа статусов отражения, соответствующая расширенному имени группы.
//
Функция СтатусыОтражения(ИмяСтатуса = "Отражено") Экспорт
	
	МассивСтатусов = Новый Массив;
	Если ИмяСтатуса = "Отражено" Тогда
		МассивСтатусов.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.Отражено);
		МассивСтатусов.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОтраженоВручную);
	ИначеЕсли ИмяСтатуса = "КОтражению" Тогда
		МассивСтатусов.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.КОтражению);		
	ИначеЕсли ИмяСтатуса = "ОшибкиОтражения" Тогда
		МассивСтатусов.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОжиданиеОтраженияВРеглУчете);
		МассивСтатусов.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОтсутствуютПравилаОтражения);
		МассивСтатусов.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОшибкаОтражения);
	КонецЕсли;	
		
	Возврат МассивСтатусов;
	
КонецФункции	

// Возвращает дополнительное значения параметра сеанса. Используется для обмена параметрами между сеансами 
// фоновых заданий и текущим сеансом пользователя.
//
// Параметры:
//  Параметр  - Строка - имя параметра.
//
// Возвращаемое значение:
//   Строка, Булево  - значение дополнительного параметра сеанса.
//
Функция ДополнительноеЗначениеПараметраСеанса(Параметр) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Значение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Параметр", Параметр);
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоДополнительныеПараметрыСеанса.Значение
	               |ИЗ
	               |	РегистрСведений.упоДополнительныеПараметрыСеанса КАК упоДополнительныеПараметрыСеанса
	               |ГДЕ
	               |	упоДополнительныеПараметрыСеанса.Параметр = &Параметр";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Значение = Выборка.Значение;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Значение;
	
КонецФункции	

// Возвращает валюту управленческого учета, заданную в настройках системы.
// 
// Возвращаемое значение:
//  СправочникСсылка.Валюты - валюта управленческого учета.
//
Функция ВалютаУправленческогоУчета() Экспорт 
	Возврат ПараметрыСеанса.упоВалютаУправленческогоУчета;
КонецФункции

// см. упоПроектноеБюджетированиеСервер.ТипыДокументовПроектногоБюджетирования()
//                 
// Возвращаемое значение:
//   Массив - Типы документов
//
Функция ТипыДокументовПроектногоБюджетирования() Экспорт
	
	Возврат упоПроектноеБюджетированиеСервер.ТипыДокументовПроектногоБюджетирования();
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает типы значений реквизитов для раздела правила.
//
// Параметры:
//  РазделПравила  - ПеречислениеСсылка.упоРазделыПравилПроектногоБюджетирования - раздел правила.
//
// Возвращаемое значение:
//   Структура   - типы значений реквизитов:
//	 	* Ключ     - Строка - имя реквизита.
//	 	* Значение - ОписаниеТипов - тип реквизита.
//
Функция ПолучитьТипыРеквизитов(РазделПравила)
	
	ТипыРеквизитов = Новый Структура;
	
	ИмяРаздела = упоПроектноеБюджетированиеСервер.ИмяПеречисленияПоЗначению(РазделПравила);
	
	МетаданныеДокументаФакт = Метаданные.Документы.упоОтражениеФактаВПроектномБюджетировании;
	Реквизиты = МетаданныеДокументаФакт.ТабличныеЧасти[ИмяРаздела].Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		ТипыРеквизитов.Вставить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;	
			
	Возврат ТипыРеквизитов;
	
КонецФункции

#КонецОбласти