////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с типовыми отчетами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик события После компоновки результата.
//
// Параметры:
//  ОтчетОбъект			 - ОтчетОбъект 							- отчет, для которого вызывается обработчик.
//  ДокументРезультат	 - Произвольный 						- не используется.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных 	- компоновщик настроек.
//  ДанныеРасшифровки	 - ДанныеРасшифровкиКомпоновкиДанных 	- содержит данные расшифровки.
//
Процедура ПослеКомпоновкиРезультата(ОтчетОбъект, ДокументРезультат, КомпоновщикНастроек, ДанныеРасшифровки) Экспорт
	
	ПолноеИмяОтчета = Строка(ОтчетОбъект);
	ТипОтчета = ?(Найти(ПолноеИмяОтчета, "ВнешнийОтчет"), "ВнешнийОтчет", "Отчет");
	
	Если ТипОтчета = "ВнешнийОтчет" И
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("УникальныйИдентификаторФормы") Тогда
		
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("АдресДанныхРасшифровки",
			ПоместитьВоВременноеХранилище(ДанныеРасшифровки,
			КомпоновщикНастроек.Настройки.ДополнительныеСвойства.УникальныйИдентификаторФормы));
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события При компоновке результата.
//
// Параметры:
//  ОтчетОбъект			 - ОтчетОбъект 							- отчет, для которого вызывается обработчик.
//  ДокументРезультат	 - ТабличныйДокумент					- документ, в который будет осуществляться вывод.
//  ДанныеРасшифровки	 - ДанныеРасшифровкиКомпоновкиДанных 	- содержит данные расшифровки.
//  СтандартнаяОбработка - Булево 								- признак стандартной обработки.
//  ИмяМакета 			 - Строка 								- имя макета СКД.
//  ВнешниеНаборыДанных - Неопределено, Структура:
//			* Ключ - Строка - имя внешнего набора данных.
//			* Значение - ТаблицаЗначений, ДеревоЗначений - внешний набор данных.
//
Процедура ПриКомпоновкеРезультата(ОтчетОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,
		ИмяМакета = "ОсновнаяСхемаКомпоновкиДанных", ВнешниеНаборыДанных = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ЭтоОбщийМакет = ОтчетОбъект.Метаданные().Макеты.Найти(ИмяМакета) = Неопределено;
	Если ЭтоОбщийМакет Тогда
		ОсновнаяСхемаКомпоновки = ПолучитьОбщийМакет(ИмяМакета);
	Иначе
		ОсновнаяСхемаКомпоновки = ОтчетОбъект.ПолучитьМакет(ИмяМакета);
	КонецЕсли;
	
	// Модифицируем СКД по настройкам объекта отчета.
	СтруктураНастроек = Новый Структура;
	Попытка
		СтруктураНастроек = ОтчетОбъект.ПолучитьНастройкиОтчета();
	Исключение
	КонецПопытки;
	
	Если СтруктураНастроек.Свойство("ДопОбработкаЗапроса") Тогда
		ОтчетОбъект.ДопОбработкаЗапроса(ОсновнаяСхемаКомпоновки,
			ОтчетОбъект.КомпоновщикНастроек.Настройки.ДополнительныеСвойства);
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("НеВыводитьНезаполненныеПоказатели")
		И СтруктураНастроек.Свойство("ИмяНабораДанных") Тогда
		
		УстановитьОтборПоПоказателям(ОтчетОбъект.КомпоновщикНастроек.Настройки, ОсновнаяСхемаКомпоновки,
			СтруктураНастроек.ИмяНабораДанных);
		
	КонецЕсли;
	
	ПрименитьНастройкуТипПлана(СтруктураНастроек, ОсновнаяСхемаКомпоновки, ОтчетОбъект.КомпоновщикНастроек);
	
	упоТиповыеОтчетыСервер.ДобавитьДополнительныеНаборыДанныхСКД(ОсновнаяСхемаКомпоновки, СтруктураНастроек, Истина, ОтчетОбъект.КомпоновщикНастроек);
	
	Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	Если СтруктураНастроек.Свойство("ДопОбработкаНастроекКомпоновщика") Тогда
		ОтчетОбъект.ДопОбработкаНастроекКомпоновщика(Настройки);
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("ВыборВерсии") Тогда
		ОбработатьЗаголовкиПолейСВерсиями(СтруктураНастроек, ОсновнаяСхемаКомпоновки, Настройки);
	КонецЕсли;
	
	// Инициализация компоновщика настроек отчета после изменения настроек. Нужно для отображения пользовательских
	// полей из связанных наборов данных.
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	ОтчетОбъект.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОсновнаяСхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОсновнаяСхемаКомпоновки, Настройки, ДанныеРасшифровки);
	
	// Инициализируем процессор СКД.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	
	Если СтруктураНастроек.Свойство("ПроверкаОчередиРаспределенияТрудозатрат") Тогда
		упоРаботаСОчередямиВызовСервера.ВывестиВОтчетИнформациюПоОчередиТрудозатрат(ОтчетОбъект, ДокументРезультат);
	КонецЕсли;
	
	// Инициализируем процессор вывода.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ПараметрыВывода = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы;
	
	УстановитьФиксациюВТабличномДокументе(ДокументРезультат, ПараметрыВывода);
	
	ПрименитьПерсональныеНастройкиГруппировокОтчета(ДокументРезультат);
	
	// Обработчик события после.
	упоТиповыеОтчетыСервер.ПослеКомпоновкиРезультата(ОтчетОбъект,
		ДокументРезультат, ОтчетОбъект.КомпоновщикНастроек, ДанныеРасшифровки);
	
	ОтчетПустой = ОтчетыСервер.ОтчетПустой(ОтчетОбъект, ПроцессорКомпоновкиДанных);
	ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить(
		"ОтчетПустой", ОтчетПустой);
	
	СнятьОтборПоПоказателям(ОтчетОбъект);
	
КонецПроцедуры

// Применение персональных настроек группировок.
//
// Параметры:
//  ДокументРезультат - ТабличныйДокумент - документ, в который будет осуществляться вывод.
//
Процедура ПрименитьПерсональныеНастройкиГруппировокОтчета(ДокументРезультат) Экспорт
	
	ПерсональныеНастройкиГруппировок = ПолучитьНастройкиГруппировокОтчета(); 
	
	Если ПерсональныеНастройкиГруппировок.УровеньСворачиванияГруппировок Тогда
		
		УровеньГруппировок = ПерсональныеНастройкиГруппировок.УровеньСворачиванияГруппировок;
		
		Если ПерсональныеНастройкиГруппировок.ПрименятьДляВложенныхГрупп Тогда		
			// Сворачиваем каждую группировку до заданного уровня вложенности.	
			Индекс = Цел(ДокументРезультат.КоличествоУровнейГруппировокСтрок()/УровеньГруппировок);	
			Пока Индекс > 0 Цикл 	
				ДокументРезультат.ПоказатьУровеньГруппировокСтрок(УровеньГруппировок*Индекс - 1);
				Индекс = Индекс - 1;
			КонецЦикла;	
	
		Иначе
			
			Индекс = ДокументРезультат.КоличествоУровнейГруппировокСтрок(); 
			Пока Индекс >= УровеньГруппировок Цикл
				ДокументРезультат.ПоказатьУровеньГруппировокСтрок(Индекс - 1);
				Индекс = Индекс - 1;
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	

// Процедура добавляет наборы данных, поля и связи в схему компоновки данных.
//
// Параметры:
//  СКД							 - СхемаКомпоновкиДанных - схема компоновки данных.
//  СтруктураНастроек			 - Структура			 - структура настроек (добавляемые наборы данных, поля и связи).
//  ПроверятьИспользованиеПолей	 - Булево
//  КомпоновщикНастроек			 - КомпоновщикНастроекКомпоновкиДанных, Неопределено
//
Процедура ДобавитьДополнительныеНаборыДанныхСКД(СКД, СтруктураНастроек, 
	ПроверятьИспользованиеПолей = Ложь, КомпоновщикНастроек = Неопределено) Экспорт
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда 
		Возврат; 
	КонецЕсли;
	Если НЕ СтруктураНастроек.Свойство("ДопНаборыДанных") Тогда 
		Возврат; 
	КонецЕсли;
	
	ТипЗначенияДата = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ОсновнойНаборДанных = СКД.НаборыДанных[0].Имя;
	
	ТипПлана = Неопределено;
	СтруктураНастроек.Свойство("ТипПлана", ТипПлана);
	
	НастройкиЗаменыВерсии = Неопределено;
	СтруктураНастроек.Свойство("НастройкиЗаменыВерсии", НастройкиЗаменыВерсии);
	
	Если НастройкиЗаменыВерсии = Неопределено 
		Или НастройкиЗаменыВерсии.Свойство("ЭтоЗаменаНеТекущейВерсии") Тогда
		Если ТипПлана = Неопределено Тогда
			ТипПлана = Перечисления.упоТипПланаПроекта.Текущий;
		КонецЕсли;	
	Иначе
		ТипПлана = НастройкиЗаменыВерсии.ТипПлана;
	КонецЕсли;	
	ТипВерсии = ТипВерсииСтрокойПоТипуПлана(ТипПлана);							
	
	ОтборПоСценарию = ЭтоОтборПоСценарию(ТипПлана);	
		
	НуженРасчетПроцентовПЗ = СтруктураНастроек.Свойство("ИмяПоляПЗ") 
							И СтруктураНастроек.Свойство("ПроцентыПЗ");
							
	НуженРасчетСроковПЗ = СтруктураНастроек.Свойство("ИмяПоляПЗ") 
							И СтруктураНастроек.Свойство("Сроки");
							
	НуженРасчетСроковФактПЗ = СтруктураНастроек.Свойство("ИмяПоляПЗ") 
								И СтруктураНастроек.Свойство("СрокиФакт");
	НуженРасчетСроковПоВерсии = СтруктураНастроек.Свойство("ИмяПоляПЗ")
									И СтруктураНастроек.Свойство("ВыборВерсии");
								
	ДобавитьНаборДанныхИерархия = ТипПлана <> Перечисления.упоТипПланаПроекта.Текущий
									Или НуженРасчетПроцентовПЗ
									Или НуженРасчетСроковПЗ
									Или НуженРасчетСроковФактПЗ;
		
	Если ДобавитьНаборДанныхИерархия Тогда
			
		// Иерархия.	
		УстановитьИерархиюПЗПоТипуВерсии(СКД, ОсновнойНаборДанных, СтруктураНастроек, ТипВерсии, ОтборПоСценарию);	
							
		// Проценты.
		Если НуженРасчетПроцентовПЗ Тогда
			
			ДополнитьСКДПроцентыПЗ(СКД, ТипВерсии, ОсновнойНаборДанных, СтруктураНастроек, 
				ПроверятьИспользованиеПолей, КомпоновщикНастроек, ОтборПоСценарию);
						
		КонецЕсли;		
		
		// Сроки.
		Если НуженРасчетСроковПЗ Тогда
			ДополнитьСКДСрокиПЗ(СКД, ТипВерсии, ОсновнойНаборДанных, СтруктураНастроек, 
				ПроверятьИспользованиеПолей, КомпоновщикНастроек, ОтборПоСценарию);
		КонецЕсли;
		
		Если НуженРасчетСроковПоВерсии Тогда
			СрокиПоВерсиям = Неопределено;
			Если СтруктураНастроек.ВыборВерсии.Свойство("СрокиПоВерсиям", СрокиПоВерсиям) Тогда
				ДополнитьСКДСрокиПоВерсии(СКД, СрокиПоВерсиям, ОсновнойНаборДанных, СтруктураНастроек,
					ПроверятьИспользованиеПолей, КомпоновщикНастроек);
			КонецЕсли;
		КонецЕсли;
		
		// Фактические сроки.
		Если НуженРасчетСроковФактПЗ Тогда
			ДополнитьСКДСрокиФактПЗ(СКД, ТипВерсии, ОсновнойНаборДанных, СтруктураНастроек, 
				ПроверятьИспользованиеПолей, КомпоновщикНастроек, ОтборПоСценарию);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("ИмяПоляПроект") Тогда 
		
		// Руководители.
		Если СтруктураНастроек.Свойство("Руководители") Тогда 
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	Руководители.Проект КАК Проект,
			               |	ЕСТЬNULL(Руководители.РуководительПроекта, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) КАК РуководительПроекта,
						   |	ЕСТЬNULL(Руководители.КураторПроекта, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) КАК КураторПроекта
			               |ИЗ
			               |	РегистрСведений.упоРуководителиПроектов.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, ) КАК Руководители";
			
			НаборДанныхРуководители = ДобавитьНаборДанных(СКД, "Руководители", "ИсточникДанных1", ТекстЗапроса);
			
			ДобавитьПолеКомпоновки(НаборДанныхРуководители, "Проект", "Проект", Истина, Истина, Истина, Истина);
			ДобавитьПолеКомпоновки(НаборДанныхРуководители, "РуководительПроекта", "РуководительПроекта");
			ДобавитьПолеКомпоновки(НаборДанныхРуководители, "КураторПроекта", "КураторПроекта");
			
			ДобавитьСвязьНаборовДанных(СКД, ОсновнойНаборДанных, "Руководители", СтруктураНастроек.ИмяПоляПроект, "Проект");
			
		КонецЕсли;
		
		// Сроки проектов.
		Если СтруктураНастроек.Свойство("Сроки") Тогда
			ДобавитьНаборДанныхСрокиПроекта(СКД, ОсновнойНаборДанных, ТипВерсии, ОтборПоСценарию, СтруктураНастроек);
		КонецЕсли;
		
		Если НуженРасчетСроковПоВерсии Тогда
			СрокиПоВерсиям = Неопределено;
			Если СтруктураНастроек.ВыборВерсии.Свойство("СрокиПоВерсиям", СрокиПоВерсиям) Тогда
				ДобавитьНаборДанныхСрокиПроектаПоВерсии(СКД, ОсновнойНаборДанных, СрокиПоВерсиям, СтруктураНастроек);
			КонецЕсли;
		КонецЕсли;
		
		// Статусы проектов.
		Если СтруктураНастроек.Свойство("СтатусыПроектов") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ЕСТЬNULL(Статусы.СтатусПроекта, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.ПустаяСсылка)) КАК СтатусПроекта,
			               |	ЕСТЬNULL(Статусы.СтатусПроекта, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.ПустаяСсылка)) КАК СтатусПроектаРесурс,
			               |	Статусы.Проект
			               |ИЗ
			               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, ) КАК Статусы";
			
			НаборДанныхСтатусыПроектов = ДобавитьНаборДанных(СКД, "СтатусыПроектов", "ИсточникДанных1", ТекстЗапроса);
			
			ДобавитьПолеКомпоновки(НаборДанныхСтатусыПроектов, "Проект", "Проект", Истина, Истина, Истина, Истина);
			ДобавитьПолеКомпоновки(НаборДанныхСтатусыПроектов, "СтатусПроекта", "СтатусПроекта");
			
			ДобавитьПолеКомпоновки(НаборДанныхСтатусыПроектов, "СтатусПроектаРесурс", "СтатусПроектаРесурс", Истина, , , , ,
				НСтр("ru = 'Статус проекта, ресурс'"));
			Группировки = Новый Массив;
			Группировки.Добавить("Проект");
			Группировки.Добавить("Проект Иерархия");
			ДобавитьПолеРесурса(СКД, "СтатусПроектаРесурс", "СтатусПроектаРесурс", Группировки);
			
			ДобавитьСвязьНаборовДанных(СКД, ОсновнойНаборДанных, "СтатусыПроектов", СтруктураНастроек.ИмяПоляПроект, "Проект");
			
		КонецЕсли;
		
		// Проценты готовности проекта. 
		// Отдельный расчет, если проценты готовности ПЗ уже выводятся в основном отчете.
		Если СтруктураНастроек.Свойство("ПроцентыПроект") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ЕСТЬNULL(ПроцентыПроекта.ПроцентГотовности, 0) КАК ПроцентГотовностиПроекта,
			               |	ПроцентыПроекта.Проект КАК СсылкаНаПроект
						   |ИЗ
			               |	РегистрСведений.упоПроцентыГотовностиПроектов.СрезПоследних(
			               |			{(НЕОПРЕДЕЛЕНО) КАК Поле2},
			               |			Версия В
			               |				(ВЫБРАТЬ
			               |					ВерсииВыбранногоТипа.Версия
			               |				ИЗ
			               |					ВерсииВыбранногоТипа) {(Проект) КАК СсылкаНаПроект}) КАК ПроцентыПроекта";
			
			Если ОтборПоСценарию Тогда 
				ТекстЗапроса = ТекстЗапросаДляПолученияДанныхПоСценарию(ТекстЗапроса);
			Иначе	
				ТекстЗапроса = ТекстЗапросаДляПолученияДанныхПоТипуВерсии(ТипВерсии, ТекстЗапроса);
			КонецЕсли;
			
			НаборДанныхПроцентыПроект = ДобавитьНаборДанных(СКД, "ПроцентГотовностиПроекта", "ИсточникДанных1", ТекстЗапроса);
			
			ОграничениеИспользования = НовоеОграничениеИспользованияПоля();
			
			ДобавитьПолеКомпоновки(НаборДанныхПроцентыПроект, 
									"СсылкаНаПроект", 
									"СсылкаНаПроект", 
									Истина, 
									Истина, 
									Истина,
									Истина, 
									, 
									, 
									, 
									, 
									ОграничениеИспользования);
			ДобавитьПолеКомпоновки(НаборДанныхПроцентыПроект, 
									"ПроцентГотовностиПроекта", 
									"ПроцентГотовностиПроекта");
			ДобавитьПолеКомпоновки(НаборДанныхПроцентыПроект, 
									"Проект", 
									"Проект", 
									Истина, 
									Истина, 
									Истина,
									Истина);
			
			ЭлементОформленияФормат 			  = НаборДанныхПроцентыПроект.Поля[1].Оформление.Элементы.Найти("Формат");
			ЭлементОформленияФормат.Использование = Истина;
			ЭлементОформленияФормат.Значение      = "ЧДЦ=2";
			
			ДобавитьСвязьНаборовДанных(СКД, 
									ОсновнойНаборДанных, 
									"ПроцентГотовностиПроекта", 
									СтруктураНастроек.ИмяПоляПроект,
									"СсылкаНаПроект");
			
			Группировки = Новый Массив;
			Группировки.Добавить("Проект");
			ДобавитьПолеРесурса(СКД, "ПроцентГотовностиПроекта", "ПроцентГотовностиПроекта", Группировки);
			
			Группировки = Новый Массив;
			Группировки.Добавить("ОбщийИтог");
			// Умножение на 0 необходимо для использования польз.полей без непосредственного вывода ПроцентаГотовностиПроекта.
			ДобавитьПолеРесурса(СКД, "ПроцентГотовностиПроекта*0", "ПроцентГотовностиПроекта", Группировки);
			
			ВыражениеРесурса = "ВЫБОР КОГДА ПроектнаяЗадача.ЭтоПроектнаяЗадача 
				|ТОГДА "" "" 
				|ИНАЧЕ ПроцентГотовностиПроекта КОНЕЦ";
			
			Группировки = Новый Массив;
			Группировки.Добавить("ПроектнаяЗадача Иерархия");
			ДобавитьПолеРесурса(СКД, ВыражениеРесурса, "ПроцентГотовностиПроекта", Группировки);
			
			ДобавитьПолеРесурса(СКД, "ПроцентГотовностиПроекта", "ПроцентГотовностиПроекта");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("ИмяПоляПЗ") Тогда  
						
		// Статусы проектных задач.
		Если СтруктураНастроек.Свойство("СтатусыПЗ") Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(СтатусыПЗ.СтатусЗадачи, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.ПустаяСсылка)) КАК СтатусПроектнойЗадачи,
			|	ЕСТЬNULL(СтатусыПЗ.СтатусЗадачи, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.ПустаяСсылка)) КАК СтатусПроектнойЗадачиРесурс,
			|	СтатусыПЗ.ПроектнаяЗадача КАК СсылкаНаПроектнуюЗадачу
			|{ВЫБРАТЬ
			|	СсылкаНаПроектнуюЗадачу.*}
			|ИЗ
			|	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
			|			{(НЕОПРЕДЕЛЕНО) КАК Поле2},
			|			Версия В
			|				(ВЫБРАТЬ
			|					ВерсииВыбранногоТипа.Версия
			|				ИЗ
			|					ВерсииВыбранногоТипа) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК СтатусыПЗ
			|{ГДЕ
			|	СтатусыПЗ.ПроектнаяЗадача.* КАК СсылкаНаПроектнуюЗадачу}";
		
				
			Если ОтборПоСценарию Тогда 
				ТекстЗапроса = ТекстЗапросаДляПолученияДанныхПоСценарию(ТекстЗапроса);
			Иначе	
				ТекстЗапроса = ТекстЗапросаДляПолученияДанныхПоТипуВерсии(ТипВерсии, ТекстЗапроса);
			КонецЕсли;
			
			НаборДанныхСтатусыПЗ = ДобавитьНаборДанных(СКД, "СтатусыПЗ", "ИсточникДанных1", ТекстЗапроса);
			
			ДобавитьПолеКомпоновки(НаборДанныхСтатусыПЗ, 
									"СсылкаНаПроектнуюЗадачу", 
									"СсылкаНаПроектнуюЗадачу", 
									Истина, 
									Истина, 
									Истина, 
									Истина);
			ДобавитьПолеКомпоновки(НаборДанныхСтатусыПЗ, 
									"Проект", 
									"Проект", 
									Истина, 
									Истина, 
									Истина, 
									Истина);
			ДобавитьПолеКомпоновки(НаборДанныхСтатусыПЗ, "СтатусЗадачи", "СтатусЗадачи");
			
			ДобавитьПолеКомпоновки(НаборДанныхСтатусыПЗ, "СтатусЗадачиРесурс", "СтатусЗадачиРесурс", Истина, , , , ,
				НСтр("ru = 'Статус задачи, ресурс'"));
			Группировки = Новый Массив;
			Группировки.Добавить("ПроектнаяЗадача");
			Группировки.Добавить("ПроектнаяЗадача Иерархия");
			ДобавитьПолеРесурса(СКД, "СтатусЗадачиРесурс", "СтатусЗадачиРесурс", Группировки);
			
			ДобавитьСвязьНаборовДанных(СКД, 
									ОсновнойНаборДанных, 
									"СтатусыПЗ", 
									СтруктураНастроек.ИмяПоляПЗ, 
									"СсылкаНаПроектнуюЗадачу");
			
		КонецЕсли;
		
		// Руководители ПЗ.
		Если СтруктураНастроек.Свойство("Руководители") Тогда 
			
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	РуководителиПЗ.ПроектнаяЗадача КАК СсылкаНаПроектнуюЗадачу,
			               |	ЕСТЬNULL(РуководителиПЗ.РуководительПроектнойЗадачи, ЗНАЧЕНИЕ(Справочник.упоСотрудники.ПустаяСсылка)) КАК РуководительПроектнойЗадачи
						   |{ВЫБРАТЬ
			               |	СсылкаНаПроектнуюЗадачу.*}
			               |ИЗ
			               |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК РуководителиПЗ
						   |{ГДЕ
			               |	РуководителиПЗ.ПроектнаяЗадача.* КАК СсылкаНаПроектнуюЗадачу}";
			
			НаборДанныхРуководителиПЗ = ДобавитьНаборДанных(СКД, "РуководителиПЗ", "ИсточникДанных1", ТекстЗапроса);
			
			ДобавитьПолеКомпоновки(НаборДанныхРуководителиПЗ, 
									"СсылкаНаПроектнуюЗадачу", 
									"СсылкаНаПроектнуюЗадачу", 
									Истина, 
									Истина, 
									Истина, 
									Истина);
			ДобавитьПолеКомпоновки(НаборДанныхРуководителиПЗ, 
									"РуководительПроектнойЗадачи", 
									"РуководительПроектнойЗадачи");
			
			ДобавитьСвязьНаборовДанных(СКД, 
									ОсновнойНаборДанных, 
									"РуководителиПЗ", 
									СтруктураНастроек.ИмяПоляПЗ, 
									"СсылкаНаПроектнуюЗадачу");
			
		КонецЕсли;
	
		// Свойства ПЗ.
		Если СтруктураНастроек.Свойство("СвойстваПЗ") Тогда
			
			Результат = упоТиповыеОтчетыСерверПовтИспСеанс.ПолучитьРеквизитыПроектныхЗадачХранящихсяВРС(ТипПлана);
					
			СвойстваПЗ = Результат.СвойстваПЗ;
			ТекстЗапроса = Результат.ТекстЗапроса;
			
			АвтозаполнениеДоступныхПолей = Ложь;
			НаборДанныхСвойства = ДобавитьНаборДанных(СКД, "СвойстваПЗ", "ИсточникДанных1", ТекстЗапроса, АвтозаполнениеДоступныхПолей);
			
			ДобавитьПолеКомпоновки(НаборДанныхСвойства, 
									"СсылкаНаПроектнуюЗадачу", 
									"СсылкаНаПроектнуюЗадачу", 
									Истина, 
									Истина, 
									Истина, 
									Истина);
			
			Если СтруктураНастроек.Свойство("ПутьКДанным") Тогда
				ПутьКДанным = СтруктураНастроек.ПутьКДанным;
			Иначе	
				ПутьКДанным = "СвойстваПроектныхЗадач";
			КонецЕсли;
			Если СтруктураНастроек.Свойство("ПутьКДаннымЗаголовок") Тогда
				ПутьКДаннымЗаголовок = СтруктураНастроек.ПутьКДаннымЗаголовок;
			Иначе
				ПутьКДаннымЗаголовок = НСтр("ru = 'Свойства проектных задач'");
			КонецЕсли;
			ПапкаПолейКомпоновки = НаборДанныхСвойства.Поля.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
			ПапкаПолейКомпоновки.ПутьКДанным = ПутьКДанным;
			ПапкаПолейКомпоновки.Заголовок = ПутьКДаннымЗаголовок;
			
			ПапкаПолейКомпоновкиРесурсы = НаборДанныхСвойства.Поля.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
			ПапкаПолейКомпоновкиРесурсы.ПутьКДанным = ПутьКДанным + "Ресурс";
			ПапкаПолейКомпоновкиРесурсы.Заголовок = ПутьКДаннымЗаголовок + НСтр("ru = ', ресурсы'");
			
			ПолеШаблон = "%1ПЗ";
			ПолеШаблонРесурс = "%1ПЗРесурс";
			ПутьКДаннымШаблон = ?(ЗначениеЗаполнено(ПутьКДанным), ПутьКДанным + "." + ПолеШаблон, ПолеШаблон);
			ПутьКДаннымШаблонРесурс = ?(ЗначениеЗаполнено(ПутьКДанным), ПутьКДанным + "Ресурс." + ПолеШаблонРесурс, "Ресурс" + ПолеШаблонРесурс);
			ЗаголовокШаблон = НСтр("ru = '%1 (ПЗ)'");
			ЗаголовокШаблонРесурс = НСтр("ru = '%1 (ПЗ), ресурс'");
			
			ГруппировкиРесурсовСвойствПЗ = Новый Массив;
			ГруппировкиРесурсовСвойствПЗ.Добавить("ПроектнаяЗадача");
			ГруппировкиРесурсовСвойствПЗ.Добавить("ПроектнаяЗадача Иерархия");
			ОграничениеНеГруппировка = Новый Структура("Группировка", Истина);
			
			ПутьКДаннымТипПроектнойЗадачи = ?(ЗначениеЗаполнено(ПутьКДанным),
				ПутьКДанным + ".ТипПроектнойЗадачиПЗ", "ТипПроектнойЗадачиПЗ");
			ДобавитьПолеКомпоновки(НаборДанныхСвойства, 
									"ТипПроектнойЗадачиПЗ", 
									ПутьКДаннымТипПроектнойЗадачи,
									,
									,
									,
									,
									, 
									НСтр("ru = 'Тип проектной задачи (ПЗ)'"));
			ПутьКДаннымТипПроектнойЗадачи = ?(ЗначениеЗаполнено(ПутьКДанным),
				ПутьКДанным + "Ресурс" +".ТипПроектнойЗадачиПЗРесурс", "РесурсТипПроектнойЗадачиПЗРесурс");
			ДобавитьПолеКомпоновки(НаборДанныхСвойства, 
									"ТипПроектнойЗадачиПЗРесурс", 
									ПутьКДаннымТипПроектнойЗадачи,
									Истина,
									,
									,
									,
									,
									НСтр("ru = 'Тип проектной задачи, ресурс (ПЗ)'"),
									,
									,
									ОграничениеНеГруппировка);
			ДобавитьПолеРесурса(СКД, ПутьКДаннымТипПроектнойЗадачи, ПутьКДаннымТипПроектнойЗадачи,
				ГруппировкиРесурсовСвойствПЗ);
			
			СвойстваИсключения = Новый Соответствие;
			СвойстваИсключения.Вставить("ЭтоВеха", 				Истина);
			СвойстваИсключения.Вставить("ЭтоПакетРабот", 		Истина);
			СвойстваИсключения.Вставить("ЭтоМодельПакетаРабот", Истина);
			
			Для каждого СвойствоПЗ Из СвойстваПЗ Цикл
				Если СвойстваИсключения.Получить(СвойствоПЗ.Имя) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Если НРег(Лев(СвойствоПЗ.Имя, 7)) = "удалить" Тогда
					Продолжить;
				КонецЕсли;
				
				Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолеШаблон, СвойствоПЗ.Имя);
				ПутьКДанным = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПутьКДаннымШаблон, СвойствоПЗ.Имя);
				Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокШаблон, СвойствоПЗ.Синоним);
				ДобавитьПолеКомпоновки(НаборДанныхСвойства, Поле, ПутьКДанным, , , , , , Заголовок);
				
				// Поле ресурса.
				Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПолеШаблонРесурс,
						СвойствоПЗ.Имя);
				ПутьКДанным = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПутьКДаннымШаблонРесурс,
						СвойствоПЗ.Имя);
				Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокШаблон, СвойствоПЗ.Синоним + ", ресурс");
				ДобавитьПолеКомпоновки(НаборДанныхСвойства, Поле, ПутьКДанным, Истина, , , , , Заголовок, , , ОграничениеНеГруппировка);
				ДобавитьПолеРесурса(СКД, ПутьКДанным, ПутьКДанным, ГруппировкиРесурсовСвойствПЗ);
			КонецЦикла;
			
			ДобавитьСвязьНаборовДанных(СКД, 
									ОсновнойНаборДанных, 
									"СвойстваПЗ", 
									СтруктураНастроек.ИмяПоляПЗ, 
									"СсылкаНаПроектнуюЗадачу");
						
		КонецЕсли;
		
		// Причины отклонений
		Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПричиныОтклонений() Тогда
			Если СтруктураНастроек.Свойство("ПричиныОтклонений") Тогда
				
				ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|    ПричиныОтклонений.ПроектнаяЗадача КАК СсылкаНаПроектнуюЗадачу,
					|    ПричиныОтклонений.Причина КАК ПричинаОтклонений,
					|    ПричиныОтклонений.ДатаИзменений КАК ПериодПричины,
					|    ПричиныОтклонений.Комментарий КАК КомментарийПричины
					|{ВЫБРАТЬ
					|    СсылкаНаПроектнуюЗадачу.*}
					|ИЗ
					|    РегистрСведений.упоПричиныОтклонений.СрезПоследних(
					|            {(НЕОПРЕДЕЛЕНО) КАК Поле2},
					|            Версия В
					|                (ВЫБРАТЬ
					|                    ВерсииВыбранногоТипа.Версия
					|                ИЗ
					|                    ВерсииВыбранногоТипа) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу, (Причина) КАК ПричинаОтклонений}) КАК ПричиныОтклонений
					|ГДЕ
					|    НЕ ПричиныОтклонений.Отмена
					|{ГДЕ
					|    ПричиныОтклонений.ПроектнаяЗадача.* КАК СсылкаНаПроектнуюЗадачу,
					|    ПричиныОтклонений.Причина КАК ПричинаОтклонений}";
				
				
				Если ОтборПоСценарию Тогда
					ТекстЗапроса = ТекстЗапросаДляПолученияДанныхПоСценарию(ТекстЗапроса);
				Иначе
					ТекстЗапроса = ТекстЗапросаДляПолученияДанныхПоТипуВерсии(ТипВерсии, ТекстЗапроса);
				КонецЕсли;
				
				НаборДанныхПричиныОтклонений = ДобавитьНаборДанных(СКД, "ПричиныОтклонений", "ИсточникДанных1", ТекстЗапроса);
				
				ДобавитьПолеКомпоновки(НаборДанныхПричиныОтклонений,
					"Проект",
					"Проект",
					Истина,
					Истина,
					Истина,
					Истина);
				ДобавитьПолеКомпоновки(НаборДанныхПричиныОтклонений,
					"СсылкаНаПроектнуюЗадачу",
					"СсылкаНаПроектнуюЗадачу",
					Истина,
					Истина,
					Истина,
					Истина);
				
				ДобавитьПолеКомпоновки(НаборДанныхПричиныОтклонений, "ПричинаОтклонений", "ПричинаОтклонений");
				
				ДобавитьСвязьНаборовДанных(СКД,
					ОсновнойНаборДанных,
					"ПричиныОтклонений",
					СтруктураНастроек.ИмяПоляПЗ,
					"СсылкаНаПроектнуюЗадачу");
				
				ВыражениеРесурса = "ВЫБОР 
					|	КОГДА ЗначениеЗаполнено(ПричинаОтклонений)   
					|		ТОГДА Упорядочить(ТаблицаЗначений(ПричинаОтклонений, 
					|			Формат(ПериодПричины, ""ДЛФ='D'"") КАК ПериодПричины,
					|			(ВЫБОР КОГДА ЗначениеЗаполнено(КомментарийПричины) 
					|				ТОГДА КомментарийПричины 
					|				ИНАЧЕ "" "" КОНЕЦ) КАК КомментарийПричины), 
					|					""ПериодПричины Убыв"") 
					|		ИНАЧЕ """"  
					|	КОНЕЦ";
				
				Группировки = Новый Массив;
				Группировки.Добавить("ПроектнаяЗадача");
				ДобавитьПолеРесурса(СКД, ВыражениеРесурса, "ПричинаОтклонений", Группировки);
				
			КонецЕсли;
		КонецЕсли;
		
		// Показатели отставания
		Если СтруктураНастроек.Свойство("ПоказателиОтставания") Тогда
			
			ТекстЗапроса = ТекстЗапросаДляПолученияПоказателейОтставания();
			
			НаборДанныхПоказателиОтставания = ДобавитьНаборДанных(СКД, "ПоказателиОтставания", "ИсточникДанных1", ТекстЗапроса);
			
			Оформление = Новый Структура("Формат", "ЧДЦ=0");
			
			ДобавитьПолеКомпоновки(НаборДанныхПоказателиОтставания, "ОтставаниеОтТП", "ОтставаниеОтТП", , , , , Оформление);
			ДобавитьПолеКомпоновки(НаборДанныхПоказателиОтставания, "ОтставаниеОтБП", "ОтставаниеОтБП", , , , , Оформление);				
			ДобавитьПолеКомпоновки(НаборДанныхПоказателиОтставания, "ОтставаниеОтДП", "ОтставаниеОтДП", , , , , Оформление);	
			
			ДобавитьСвязьНаборовДанных(СКД, ОсновнойНаборДанных, "ПоказателиОтставания", "ПроектнаяЗадача", "ПроектнаяЗадача");			
			
			ДобавитьПолеРесурса(СКД, "ОтставаниеОтТП", "ОтставаниеОтТП");
 			ДобавитьПолеРесурса(СКД, "ОтставаниеОтБП", "ОтставаниеОтБП");
			ДобавитьПолеРесурса(СКД, "ОтставаниеОтДП", "ОтставаниеОтДП");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтборПоСценарию Тогда
		НаборыДанных = СКД.НаборыДанных;
		ДобавитьВТВерсийПоСценариюВНаборыДанных(НаборыДанных, ОсновнойНаборДанных);
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает скрытый отбор на заполненные выбранные показатели отчета
//
// Параметры:
//  НастройкиКомпоновкиДанных - НастройкиКомпоновкиДанных - настройки отчета.
//  СКД - СхемаКомпоновкиДанных - схема компоновки данных.
//  ИмяНабораДанных - Строка - имя набора данных СКД.
//  ПоляИсключения - Массив Из Строка - имена полей, к которым не нужно применять правило отбора.
//
Процедура УстановитьОтборПоПоказателям(НастройкиКомпоновкиДанных, СКД, ИмяНабораДанных, ПоляИсключения = Неопределено) Экспорт
	
	СтандартныйЗапрос = СКД.НаборыДанных[ИмяНабораДанных].Запрос;
	ВыбранныеПоля = НастройкиКомпоновкиДанных.Выбор.Элементы;
	Отбор = НастройкиКомпоновкиДанных.Отбор.Элементы;
	Показатели = Новый Соответствие;
	ИсключаяНеиспользуемые = Истина;
	ЗаполнитьСписокВыбранныхПолей(Показатели, ВыбранныеПоля, ВыбранныеПоля, ИсключаяНеиспользуемые);
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Если ЭлементОтбора.Представление = НСтр("ru='Не выводить незаполненные движения'") Тогда
			ОтборПоказатели = ЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборПоказатели = Неопределено Тогда
		ОтборПоказатели = Отбор.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ОтборПоказатели.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ОтборПоказатели.Представление = НСтр("ru='Не выводить незаполненные движения'");
	КонецЕсли;
	ОтборПоказатели.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ОтборПоказатели.Использование = Истина;
	ОтборПоказатели.Элементы.Очистить();
	
	Если ПоляИсключения = Неопределено Тогда
		ПоляИсключения = Новый Массив;
	КонецЕсли;
	
	ПоляСКД = СКД.НаборыДанных[ИмяНабораДанных].Поля;
	Для Каждого КлючИЗначение Из Показатели Цикл
		Показатель = КлючИЗначение.Ключ;
		
		Если ПоляИсключения.Найти(Строка(Показатель)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПоляСКД.Найти(Показатель) <> Неопределено Или СКД.ВычисляемыеПоля.Найти(Показатель) <> Неопределено Тогда
			ОтборПоказатель = ОтборПоказатели.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоказатель.Использование = Истина;
			ОтборПоказатель.ЛевоеЗначение = Показатель;
			ОтборПоказатель.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет дополнительные отборы и поля в компоновщик.
//
// Параметры:
//	КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек
//	СтруктураНастроек - Структура - структура дополнительных отборов и полей.
//
Процедура ДобавитьДополнительныеНастройкиВКомпоновщик(КомпоновщикНастроек, СтруктураНастроек) Экспорт
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
		
	УстановитьФорматированиеСуммовыхПолейИзНастроекПользователя(КомпоновщикНастроек.Настройки, СтруктураНастроек);	
	ДобавитьФорматированиеПоказателейИОтборПоРуководителюИСтатусуПроекта(КомпоновщикНастроек.Настройки,
		СтруктураНастроек);
	
	Если НЕ (СтруктураНастроек.Свойство("ОтключитьОтборПоКомпоненту") 
		И СтруктураНастроек.ОтключитьОтборПоКомпоненту) Тогда 
		
		РодительскоеПоле = Новый ПолеКомпоновкиДанных("Проект");		
		
		// Похожий функционал реализован в общей форме "упоФормаОтчета" 
		// в процедуре УстановитьОтборПоКомпонентуПроектаКопируемойСКД
		
		упоФункцииОбщегоНазначенияКлиентСервер.УстановитьОтборПоПолюКомпоновки(КомпоновщикНастроек, "Проект.Компонент", 
			ПредопределенноеЗначение("Перечисление.упоКомпоненты.Проект"), Ложь, Истина, РодительскоеПоле);

	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("УстановитьПараметрыПоУмолчаниюИзОтчета") 
		И СтруктураНастроек.Свойство("ПараметрыПоУмолчанию") Тогда
		Для Каждого КлючЗначение Из СтруктураНастроек.ПараметрыПоУмолчанию Цикл
			ЗначениеПараметраСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
														Новый ПараметрКомпоновкиДанных(КлючЗначение.Ключ));
			ЗначениеПараметраСКД.Использование = Истина;
			ЗначениеПараметраСКД.Значение = КлючЗначение.Значение;
			// В некоторых случаях пользовательские параметры не обновляются автоматически из параметров настроек, 
			// поэтому обновляем их принудительно.
			ПеренестиЗначениеПараметрДанныхВПользовательскиеНастройки(КомпоновщикНастроек, ЗначениеПараметраСКД, Истина);
		КонецЦикла;	
	КонецЕсли;	
	        	
КонецПроцедуры

// Процедура - Перенести значение параметра данных в пользовательские настройки.
//
// Параметры:
//	КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек 
//  ЗначениеПараметраСКД - ЗначениеПараметраКомпоновкиДанных - значение параметра компоновких данных
//  ПереносПараметраВДопСвойстваКомпоновщика - Булево - признак необходимости копирования параметра 
//  	в доп.свойства отчета для отключения перезаполнения пользовательскими настройками на форме.
//
Процедура ПеренестиЗначениеПараметрДанныхВПользовательскиеНастройки(КомпоновщикНастроек, 
																	ЗначениеПараметраСКД, 
																	ПереносПараметраВДопСвойстваКомпоновщика = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ЗначениеПараметраСКД.ИдентификаторПользовательскойНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
										ЗначениеПараметраСКД.ИдентификаторПользовательскойНастройки);
	Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		ПользовательскийПараметр.Значение = ЗначениеПараметраСКД.Значение;
	КонецЕсли;	
	
	// Отключение загрузки пользовательских настроек.
			 		
	Если ПереносПараметраВДопСвойстваКомпоновщика Тогда
		
		Если Не КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство(
						"НеЗагружатьПользовательскиеНастройкиДляЭлементов") Тогда		
			КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить(
						"НеЗагружатьПользовательскиеНастройкиДляЭлементов", Новый Соответствие);
		КонецЕсли;	
				
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.НеЗагружатьПользовательскиеНастройкиДляЭлементов.Вставить(
			ЗначениеПараметраСКД.ИдентификаторПользовательскойНастройки, Истина);	
		
	КонецЕсли;		
	
КонецПроцедуры

// Получает значения персональных настроек оформления отчета.
//
// Возвращаемое значение:
//  Структура - ключи:
//   * ФорматСумм 				- Строка - Форматная строка.
//   * ШиринаСуммовыхКолонок 	- Число.
//   * Макет оформления отчетов - Строка - имя макета оформления отчета СКД.
//   * ФорматКоличества 		- Строка - Форматная строка.
//   * ШиринаКолонокКоличества 	- Число.
//
Функция ПолучитьНастройкиОформленияОтчета() Экспорт
	
	СтруктураНастроек = Новый Структура();
	
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ФорматСумм", "ЧДЦ='2'");
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ШиринаСуммовыхКолонок", 15);
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ФорматКоличества", "ЧДЦ=2");
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ШиринаКолонокКоличества", 15);
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ФорматТрудозатрат", "ЧЦ='15'; ЧДЦ='2'");
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ШиринаКолонокТрудозатрат", 15);
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ФорматКоличествоВыделятьОтрицательные", Истина);
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ФорматСуммаВыделятьОтрицательные", Истина);
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ФорматТрудозатратВыделятьОтрицательные", Истина);
	
	// Настройки периодов общие для всех - не сохраняем их в персональные.
	СтруктураНастроек.Вставить("ФорматПериодГод", 		ФорматПериодаГод());
	СтруктураНастроек.Вставить("ФорматПериодКвартал", 	ФорматПериодаКвартал());
	СтруктураНастроек.Вставить("ФорматПериодМесяц", 	ФорматПериодаМесяц());
	СтруктураНастроек.Вставить("ФорматПериодНеделя", 	ФорматПериодаНеделя());
	СтруктураНастроек.Вставить("ФорматПериодДень", 		ФорматПериодаДень());
	
	МакетОформленияОтчетов = МакетОформленияОтчетовИзСтиля();
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "МакетОформленияОтчетов", МакетОформленияОтчетов);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Получает значения персональных настроек группировок.
//
// Возвращаемое значение:
//  Структура - ключи:
//   * УровеньСворачиванияГруппировок - Число.
//   * ПрименятьДляВложенныхГрупп - Булево.
//
Функция ПолучитьНастройкиГруппировокОтчета() Экспорт
	
	СтруктураНастроек = Новый Структура();
			
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "УровеньСворачиванияГруппировок", 3);	
	ДобавитьПерсональнуюНастройку(СтруктураНастроек, "ПрименятьДляВложенныхГрупп", Ложь);
		
	Возврат СтруктураНастроек;
	
КонецФункции

// Формирует отчет "Динамика экономики проекта" и помещает результат во временное хранилище.
//
// Параметры:
//	ПараметрыОтчета - Структура - Ключи:
//		* СхемаКомпоновкиДанных - схема КД
//		* НастройкиКомпоновкиДанных - настройки КД.
//		* СоставПодписей - табличная часть "Состав подписей" отчета.
//		* ТипыПоказателей - табличная часть "Типы показателей" отчета.
//		* Показатели - табличная часть "Показатели" отчета.
//		* ВыбраннаяВерсия - документ "Версия плана проекта" (реквизит отчета).
//	АдресХранилища - Строка - адрес временного хранилища.
//
Процедура СформироватьОтчетДинамикаЭкономики(ПараметрыОтчета, АдресХранилища = "") Экспорт

	ОсновнаяСхемаКомпоновки = ПараметрыОтчета.СхемаКомпоновкиДанных;
	СоставПодписей 			= ПараметрыОтчета.СоставПодписей;
	ТипыПоказателей 		= ПараметрыОтчета.ТипыПоказателей;
	Показатели 				= ПараметрыОтчета.Показатели;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(ПараметрыОтчета.НастройкиКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОсновнаяСхемаКомпоновки)); 
	
	ВнешниеНаборыДанных = Новый Структура;
	
	Попытка
		Если КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение Тогда
			ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Месяц;
		Иначе
			ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
		КонецЕсли;
		КомпоновщикНастроек.Настройки.Структура[0].Точки[0].ПоляГруппировки.Элементы[0].ТипДополнения = ТипДополнения;
	Исключение
	КонецПопытки;
	
	ТекДата = упоПоказателиПроектовСервер.ПолучитьТекДатуДляПоказателейФОТ();
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекДата", ТекДата);
					
	Настройки =	КомпоновщикНастроек.ПолучитьНастройки();
	
	// Тип плана.
	ТипПлана = Неопределено;
	Если ПараметрыОтчета.Свойство("ТипПлана", ТипПлана) Тогда
		
		НастройкиЗаменыВерсии = Новый Структура("ТипВерсии, ТипПлана", "Текущая", Перечисления.упоТипПланаПроекта.Текущий);
		ИзменитьТекстЗапросаОсновногоНабораДанныхСКДПоТипуПлана(ОсновнаяСхемаКомпоновки, ТипПлана, НастройкиЗаменыВерсии);
		
		упоТиповыеОтчетыСервер.ДобавитьДополнительныеНаборыДанныхСКД(ОсновнаяСхемаКомпоновки, 
			Новый Структура("ТипПлана", ТипПлана));
	КонецЕсли;		
		
	// Показатели.
	
	ВыбранныеПоказатели = Новый СписокЗначений;
	Для Каждого Показатель Из Показатели Цикл
		Если Показатель.Пометка Тогда
			ВыбранныеПоказатели.Добавить(Показатель.Значение);
		КонецЕсли;
	КонецЦикла;
	ВыбранныеТипыПоказателей = Новый СписокЗначений;
	Для Каждого ТипПоказателя Из ТипыПоказателей Цикл
		Если ТипПоказателя.Пометка Тогда
			ВыбранныеТипыПоказателей.Добавить(ТипПоказателя.Значение);
		КонецЕсли;
	КонецЦикла;
		
	ОтборПоПоказателям = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоПоказателям.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Показатель");
	ОтборПоПоказателям.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоПоказателям.ПравоеЗначение = ВыбранныеПоказатели;
	ОтборПоПоказателям.Использование = Истина;
	
	ОтборПоТипуПоказателя = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоТипуПоказателя.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипПоказателя");
	ОтборПоТипуПоказателя.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоТипуПоказателя.ПравоеЗначение = ВыбранныеТипыПоказателей;
	ОтборПоТипуПоказателя.Использование = Истина;	
	
	ПодписьСерия = Ложь;
	ПодписьЗначение = Ложь;
	Для Каждого ВыбраннаяПодпись Из СоставПодписей Цикл
		Если ВыбраннаяПодпись.Пометка Тогда
			Если ВыбраннаяПодпись.Значение = "Показатель" Тогда
				ПодписьСерия = Истина;
			ИначеЕсли ВыбраннаяПодпись.Значение = "Сумма" Тогда
				ПодписьЗначение = Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Если ПодписьСерия И ПодписьЗначение Тогда
		ВидПодписей = ВидПодписейКДиаграмме.СерияЗначение;
	ИначеЕсли ПодписьСерия Тогда
		ВидПодписей = ВидПодписейКДиаграмме.Серия;
	ИначеЕсли ПодписьЗначение Тогда
		ВидПодписей = ВидПодписейКДиаграмме.Значение;
	Иначе
		ВидПодписей = ВидПодписейКДиаграмме.Нет;
	КонецЕсли;
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы.ВидПодписей", ВидПодписей);
	
	ПараметрРасположениеЛегенды = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ТипДиаграммы.РасположениеЛегенды"));
	Если ПараметрРасположениеЛегенды <> Неопределено Тогда
		
		Если Настройки.ДополнительныеСвойства.Свойство("ЭтаФормаРабочегоСтола") 
			И Настройки.ДополнительныеСвойства.ЭтаФормаРабочегоСтола = Истина Тогда
			
			ПараметрРасположениеЛегенды.Использование = Истина;
			ПараметрРасположениеЛегенды.Значение = РасположениеЛегендыДиаграммыКомпоновкиДанных.Нет;
			
		Иначе 
			
			Если НЕ ПараметрРасположениеЛегенды.Использование Тогда
				ПараметрРасположениеЛегенды.Использование = Истина;
				ПараметрРасположениеЛегенды.Значение = РасположениеЛегендыДиаграммыКомпоновкиДанных.Нет;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
				
	//
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОсновнаяСхемаКомпоновки, Настройки, ДанныеРасшифровки);
	
	// Инициализируем процессор СКД.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Инициализируем процессор вывода.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;        
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

	Если ДокументРезультат.Рисунки.Количество() <> 0 Тогда
		ДокументРезультат.Рисунки[0].Объект.ОбластьПостроения.ФорматШкалыЗначений = "ЧРГ=;";	                          
	КонецЕсли; 	

	ПоместитьВоВременноеХранилище(Новый Структура("Результат,ДанныеРасшифровки",
		ДокументРезультат, ДанныеРасшифровки), АдресХранилища);
	
КонецПроцедуры

// Формирует отчет и помещает результат во временное хранилище.
//
// Параметры:
//	ПараметрыОтчета - Структура - Ключи:
//		* ИдентификаторОтчета - Строка.
//		* НастройкиКомпоновкиДанных -НастройкиКомпоновкиДанных.
//
//	АдресХранилища - Строка - адрес временного хранилища.
//
Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища = "") Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ОтчетОбъект = Отчеты[ПараметрыОтчета.ИдентификаторОтчета].Создать();
	
	ИнициализироватьСКДиКомпоновщикНастроекОтчета(ОтчетОбъект, ОтчетОбъект.КомпоновщикНастроек);
	СтруктураНастроек = ПараметрыОтчета.НастройкиОбъекта;
	
	// Загрузим пользовательские настройки после инициализации компоновщика настроек.
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(ПараметрыОтчета.НастройкиКомпоновкиДанных);
	
	// Временно отключено.
	//ОбработатьВыборПолейДополнительнойИнформации(ОтчетОбъект.КомпоновщикНастроек.Настройки, СтруктураНастроек);
	
	ОтчетОбъект.СкомпоноватьРезультат(ДокументРезультат, ДанныеРасшифровки);
	
	ПоместитьВоВременноеХранилище(Новый Структура("Результат,ДанныеРасшифровки", ДокументРезультат, ДанныеРасшифровки), АдресХранилища);
	
КонецПроцедуры

// Добавляет на форму кнопку "Открыть новый отчет" и соответствующую команду.
// Обработчик действия команды должен иметь имя "Подключаемый_ОткрытьНовыйОтчет".
//
// Параметры:
//  ЭтаФорма - УправляемаяФорма - форма, в которую надо добавить кнопку.
//  ГруппаФормы - ЭлементФормы - группа формы, на которую надо вывести ЭУ.
//
Процедура ДобавитьКнопкуОткрытияНовогоОтчета(ЭтаФорма, ГруппаФормы) Экспорт
	
	ИмяЭлемента = "ОткрытьНовыйОтчет";
	
	Команда = ЭтаФорма.Команды.Добавить(ИмяЭлемента);
	Команда.Действие  = "Подключаемый_ОткрытьНовыйОтчет";
	Команда.Заголовок = "Открыть новый отчет";
	Команда.Подсказка = "Открыть новый отчет";
	Команда.Картинка = БиблиотекаКартинок.Отчет;
	
	Элемент = ЭтаФорма.Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), ГруппаФормы);
	Элемент.ИмяКоманды = ИмяЭлемента;
	Элемент.ТолькоВоВсехДействиях = Ложь;
	
КонецПроцедуры

// Сохраняет настройки компоновщика во временное хранилище, возвращает адрес.
//
// Параметры:
//	КомпоновщикНастроек - КомпновщиикНастроекКомпоновкиДанных - компоновщик,
//						чьи настройки необходимо сохранить во временном хранимлище.
// Возвращаемое значение:
//	Строка - адрес.
Функция СохранитьНастройкиКомпоновщика(КомпоновщикНастроек) Экспорт
	
	ТекНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Возврат ПоместитьВоВременноеХранилище(ТекНастройки, Новый УникальныйИдентификатор);
	
КонецФункции

// Загружает настройки компоновщика в компоновщик настроек отчета.
//
// Параметры:
//  Настройки - Структура - структура с настройками.
//  ЭтаФорма - УправляемаяФорма - форма.
//  Отчет - ОтчетОбъект - отчет.
//
Процедура ЗагрузитьНастройкиКомпоновщикаВФормуОтчета(Настройки, ЭтаФорма, Отчет) Экспорт
	
	Если Настройки.Свойство("ЕстьОткрытиеНовогоОтчета") Тогда
		ТемпНастройкиКомпоновщика = ПолучитьИзВременногоХранилища(Настройки.НастройкиКомпоновщика);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ТемпНастройкиКомпоновщика);
		Если Настройки.Свойство("ПериодИспользование") Тогда
			ЭтаФорма.ПериодИспользование = Настройки.ПериодИспользование;
			ЭтаФорма.ПериодВид = Настройки.ПериодВид;
			ЭтаФорма.ПериодЗначение = Настройки.ПериодЗначение;
			ЭтаФорма.ПериодПредставление = упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(
				Настройки.ПериодЗначение, ЭтаФорма.ПериодВид);
		КонецЕсли;
		Если ЭтаФорма.РеквизитыВДопНастройки <> Неопределено Тогда
			Для Каждого ЭлементРеквизит Из ЭтаФорма.РеквизитыВДопНастройки Цикл
				ИмяРеквизита = ЭлементРеквизит.Значение;
				Если ТемпНастройкиКомпоновщика.ДополнительныеСвойства.Свойство(ИмяРеквизита) Тогда
					ЭтаФорма[ИмяРеквизита] = ТемпНастройкиКомпоновщика.ДополнительныеСвойства[ИмяРеквизита];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Принудительно прописывает заголовки выбранных полей из доступных полей.
//
// Параметры:
//	КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - компоновщик модифицируемого отчета.
//
Процедура УстановитьЗаголовкиПолейВыбораПоДоступнымПолямПринудительно(КомпоновщикНастроек) Экспорт
	
	ЭлементыВыбора = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора;	
	
	УстановитьЗаголовкиПолейВыбораПоДоступнымПолямРекурсивно(ЭлементыВыбора, ДоступныеПоляВыбора);
	
КонецПроцедуры	

// Процедура добавляет форматирование показателей проекта и отбор по руководителю и статусу проекта.
//
// Параметры:
//	Настройки - НастройкиКомпоновкиДанных	- настройки компоновки данных.
//	СтруктураНастроек	- Структура			- структура дополнительных отборов и полей.
//
Процедура ДобавитьФорматированиеПоказателейИОтборПоРуководителюИСтатусуПроекта(Настройки, СтруктураНастроек) Экспорт
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
		
	Если СтруктураНастроек.Свойство("ФорматПоказателейПроектов") Тогда
		
		МассивПоказателей = Новый Массив;
		Для Каждого КлючЗначение Из СтруктураНастроек.ФорматПоказателейПроектов Цикл
			МассивПоказателей.Добавить(КлючЗначение.Ключ);	
		КонецЦикла;
		
		ДанныеФорматов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивПоказателей, "ФорматнаяСтрока", Истина);
		
		Для Каждого КлючЗначение Из СтруктураНастроек.ФорматПоказателейПроектов Цикл
			ФорматнаяСтрока = ДанныеФорматов.Получить(КлючЗначение.Ключ).ФорматнаяСтрока;
			ДобавитьФорматПолю(Настройки, ФорматнаяСтрока, КлючЗначение.Значение);	
		КонецЦикла;
			
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("ДопНаборыДанных") Тогда
		
		Если СтруктураНастроек.Свойство("Руководители") И СтруктураНастроек.Свойство("ИмяПоляПроект") Тогда	
			ОтборРуководитель 				 = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборРуководитель.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("РуководительПроекта");
			ОтборРуководитель.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
			ОтборРуководитель.Использование  = Ложь;		
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("СтатусыПроектов") И СтруктураНастроек.Свойство("ИмяПоляПроект") Тогда
			ОтборСтатус 			  		 = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборСтатус.ЛевоеЗначение 		 = Новый ПолеКомпоновкиДанных("СтатусПроекта");
			ОтборСтатус.ВидСравнения  		 = ВидСравненияКомпоновкиДанных.Равно;
			ОтборСтатус.Использование 		 = Ложь;		
		КонецЕсли; 		
		
	КонецЕсли;
			
КонецПроцедуры

// Процедура устанавливает условное оформление на поля сумма и количества.
//
// Параметры:
//	Настройки - НастройкиКомпоновкиДанных	- настройки компоновки данных.
//	НастройкиОбъекта	- Структура			- структура дополнительных полей.
//
Процедура УстановитьФорматированиеСуммовыхПолейИзНастроекПользователя(Настройки, НастройкиОбъекта) Экспорт
		
	СтруктураОформлениеОтчета = ПолучитьНастройкиОформленияОтчета();
	
	ФорматСумм 								= СтруктураОформлениеОтчета.ФорматСумм;
	ШиринаКолонок 							= СтруктураОформлениеОтчета.ШиринаСуммовыхКолонок;
	ФорматКоличества						= СтруктураОформлениеОтчета.ФорматКоличества;
	ШиринаКолонокКоличества 				= СтруктураОформлениеОтчета.ШиринаКолонокКоличества; 
	ФорматТрудозатрат						= СтруктураОформлениеОтчета.ФорматТрудозатрат;
	ШиринаКолонокТрудозатрат 				= СтруктураОформлениеОтчета.ШиринаКолонокТрудозатрат; 
	ФорматКоличествоВыделятьОтрицательные 	= СтруктураОформлениеОтчета.ФорматКоличествоВыделятьОтрицательные;
	ФорматСуммаВыделятьОтрицательные 		= СтруктураОформлениеОтчета.ФорматСуммаВыделятьОтрицательные; 
	ФорматТрудозатратВыделятьОтрицательные 	= СтруктураОформлениеОтчета.ФорматТрудозатратВыделятьОтрицательные;
	МакетОформленияОтчетов 					= СтруктураОформлениеОтчета.МакетОформленияОтчетов;
	
	ФорматПериодГод 	= СтруктураОформлениеОтчета.ФорматПериодГод;
	ФорматПериодКвартал = СтруктураОформлениеОтчета.ФорматПериодКвартал;
	ФорматПериодМесяц 	= СтруктураОформлениеОтчета.ФорматПериодМесяц;
	ФорматПериодНеделя 	= СтруктураОформлениеОтчета.ФорматПериодНеделя;
	ФорматПериодДень 	= СтруктураОформлениеОтчета.ФорматПериодДень;
	
	ЭлементыУсловногоОформления = Настройки.УсловноеОформление.Элементы;
	ПараметрыВывода = Настройки.ПараметрыВывода.Элементы;
	
	УстанавливатьОформлениеПолейСумм = ЗначениеЗаполнено(ФорматСумм) ИЛИ ЗначениеЗаполнено(ШиринаКолонок)
		ИЛИ ЗначениеЗаполнено(ФорматСуммаВыделятьОтрицательные);
	
	Если НастройкиОбъекта.Свойство("ПоляСуммы") И УстанавливатьОформлениеПолейСумм Тогда
		
		ДобавитьУсловноеОформлениеДляВыбранныхПолей(Настройки, НастройкиОбъекта.ПоляСуммы, ФорматСумм, ШиринаКолонок,
			ФорматСуммаВыделятьОтрицательные);
		
	КонецЕсли;
		
	Если НастройкиОбъекта.Свойство("ПоляСуммыБезВыделенияОтрицательных") 
		И УстанавливатьОформлениеПолейСумм 
		И ФорматСуммаВыделятьОтрицательные Тогда
		
		ДобавитьУсловноеОформлениеДляВыбранныхПолей(Настройки, 
			НастройкиОбъекта.ПоляСуммыБезВыделенияОтрицательных, ФорматСумм, ШиринаКолонок, Ложь);
		
	КонецЕсли;
	
	УстанавливатьОформлениеПолейКоличества = ЗначениеЗаполнено(ФорматКоличества) 
		ИЛИ ЗначениеЗаполнено(ШиринаКолонокКоличества) ИЛИ ЗначениеЗаполнено(ФорматКоличествоВыделятьОтрицательные);
	
	Если НастройкиОбъекта.Свойство("ПоляКоличества") И УстанавливатьОформлениеПолейКоличества Тогда
		
		ДобавитьУсловноеОформлениеДляВыбранныхПолей(Настройки, НастройкиОбъекта.ПоляКоличества, ФорматКоличества, ШиринаКолонокКоличества,
			ФорматКоличествоВыделятьОтрицательные);
		
	КонецЕсли;
		
	УстанавливатьОформлениеПолейТрудозатрат = ЗначениеЗаполнено(ФорматТрудозатрат) 
		ИЛИ ЗначениеЗаполнено(ШиринаКолонокТрудозатрат) ИЛИ ЗначениеЗаполнено(ФорматТрудозатратВыделятьОтрицательные);
	
	Если НастройкиОбъекта.Свойство("ПоляТрудозатрат") И УстанавливатьОформлениеПолейТрудозатрат Тогда
		
		ДобавитьУсловноеОформлениеДляВыбранныхПолей(Настройки, НастройкиОбъекта.ПоляТрудозатрат, ФорматТрудозатрат, ШиринаКолонокТрудозатрат,
			ФорматТрудозатратВыделятьОтрицательные);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(МакетОформленияОтчетов) Тогда
		ИспользоватьМакет = МакетОформленияОтчетов <> ПолучитьЗначениеМакетаОформленияБезОформления();
		МакетОформления = Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
		МакетОформления.Значение = МакетОформленияОтчетов;
		МакетОформления.Использование = ИспользоватьМакет;
		Для Каждого ЭлементСтруктуры Из Настройки.Структура Цикл
			Если ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
				ВложенныйМакетОформления = ЭлементСтруктуры.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
				ВложенныйМакетОформления.Значение = МакетОформленияОтчетов;
				ВложенныйМакетОформления.Использование = ИспользоватьМакет;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НастройкиОбъекта.Свойство("ПоляПериодов") Тогда
		
		ПоляПериодов = НастройкиОбъекта.ПоляПериодов;
		
		Для Каждого ПолеПериода Из ПоляПериодов Цикл
			
			ИмяПоляПериод = Неопределено;
			
			Если ПолеПериода.Свойство("ПериодМесяц", ИмяПоляПериод) Тогда
				ФорматПериода = ФорматПериодМесяц;
			ИначеЕсли ПолеПериода.Свойство("ПериодГод", ИмяПоляПериод) Тогда
				ФорматПериода = ФорматПериодГод;
			ИначеЕсли ПолеПериода.Свойство("ПериодКвартал", ИмяПоляПериод) Тогда
				ФорматПериода = ФорматПериодКвартал;
			ИначеЕсли ПолеПериода.Свойство("ПериодНеделя", ИмяПоляПериод) Тогда
				ФорматПериода = ФорматПериодНеделя;
			ИначеЕсли ПолеПериода.Свойство("ПериодДень", ИмяПоляПериод) Тогда
				ФорматПериода = ФорматПериодДень;
			Иначе
				Продолжить;
			КонецЕсли;
			
			ДобавитьУсловноеОформлениеДляВыбранныхПолей(Настройки, 
				ИмяПоляПериод, ФорматПериода,,, ГоризонтальноеПоложение.Центр);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Строковый идентификатор объекта метаданных по имени отчета.
//
// Параметры:
//  ИмяОтчета	 - Строка	 - имя отчета
// 
// Возвращаемое значение:
//  Строка - идентификатор объекта метаданных.
//
Функция ПолучитьИдентификаторОтчета(ИмяОтчета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолноеИмя = Метаданные.Отчеты[ИмяОтчета].ПолноеИмя(); 
	
	ИдентификаторОтчета = Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(ПолноеИмя);
	
	Возврат ИдентификаторОтчета;
	
КонецФункции

// Заполняет период формы отчета значением по умолчанию (этот год).
//
// Параметры:
//  Отчет	 - ОтчетОбъект 		- отчет.
//  Форма	 - УправляемаяФорма - форма отчета.
//
Процедура УстановитьНаФормеНастройкуПериодаПоУмолчанию(Отчет, Форма) Экспорт
	
	ПараметрКДПериодОтчета = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	
	НастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	Для Каждого ПараметрОтчета Из НастройкиОтчета.ПараметрыДанных.ДоступныеПараметры.Элементы Цикл
		
		Если ПараметрОтчета.Параметр = ПараметрКДПериодОтчета Тогда
				
			ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрОтчета.Параметр);
			Форма.ВыборТипаДаты = ЗначениеПараметра.Значение.Вариант;
			Форма.ПериодЗначение.ДатаНачала     = ЗначениеПараметра.Значение.ДатаНачала;
			Форма.ПериодЗначение.ДатаОкончания  = ЗначениеПараметра.Значение.ДатаОкончания;
			Форма.ПериодЗначение.Вариант 		= ЗначениеПараметра.Значение.Вариант;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавление дополнительных параметров в схему компоновки данных.
//
// Параметры:
//	СКД					- СхемаКомпоновкиДанных - схема компоновки данных.
//	НастройкиОбъекта	- Структура				- настройки объекта отчета.
//
Процедура ДобавитьДополнительныеПараметрыСКД(СКД, НастройкиОбъекта) Экспорт 
	
	Если НастройкиОбъекта.Свойство("ТипПлана") Тогда 
		
		ПараметрСКД = СКД.Параметры.Добавить();
		ПараметрСКД.Имя = "ТипПлана";
		ПараметрСКД.Заголовок = НСтр("ru = 'Тип плана/Сценарий'");
		ПараметрСКД.ВключатьВДоступныеПоля = Истина;
		ПараметрСКД.ЗапрещатьНезаполненныеЗначения = Истина;
		ПараметрСКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрСКД.ТипЗначения = 
			Новый ОписаниеТипов("ПеречислениеСсылка.упоТипПланаПроекта, СправочникСсылка.упоСценарии");
	
		Для Каждого ВариантНастройки Из СКД.ВариантыНастроек Цикл
			УстановитьПользовательскийПараметр(ВариантНастройки.Настройки, 
												"ТипПлана",
												Перечисления.упоТипПланаПроекта.Текущий,
												"_ТипПлана_");
		КонецЦикла;									
	
	КонецЕсли;	
	
	Если НастройкиОбъекта.Свойство("ВыборВерсии") Тогда 
		Для НомерВерсии = 1 По НастройкиОбъекта.ВыборВерсии.КоличествоВерсий Цикл
			Имя = "Версия" + Строка(НомерВерсии);
			Для Каждого ВариантНастройки Из СКД.ВариантыНастроек Цикл
				УстановитьПользовательскийПараметр(ВариантНастройки.Настройки, 
				                                    Имя,
													Документы.упоВерсияПланаПроекта.ПустаяСсылка(),
													"_" + Имя + "_");
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры	

// Добавляет к источнику схемы запроса внутреннее соединение с таблицей.
//
// Параметры:
//	Источник					- ИсточникСхемыЗапроса  - источник схемы запроса.
//	ПсевдонимТаблицыСоединения	- Строка	- псевдоним таблицы соединения.
// 	СтрокаСоединения			- Строка 	- условие соединения.
//
Процедура ДобавитьВнутреннееСоединениеВИсточник(Источник, ПсевдонимТаблицыСоединения, СтрокаСоединения) Экспорт
	
	ИндексПоследнего = Источник.Соединения.Количество();
	Источник.Соединения.Добавить(ПсевдонимТаблицыСоединения, СтрокаСоединения);
	Источник.Соединения[ИндексПоследнего].ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;	
	
КонецПроцедуры

// Инициализирует компоновщик настроек и формирует СКД отчета по его настройкам (см. модуль объекта отчета).
//
// Параметры:
//	ОтчетОбъект - ОтчетОбъект - источник настроек.
//	КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - приемник настроек, требующий инициализации.
//
Процедура ИнициализироватьСКДиКомпоновщикНастроекОтчета(ОтчетОбъект, КомпоновщикНастроек) Экспорт
	
	СКД = ОтчетОбъект.СхемаКомпоновкиДанных;
	
	НастройкиОбъекта = Новый Структура;
	Попытка
		НастройкиОбъекта = ОтчетОбъект.ПолучитьНастройкиОтчета();
	Исключение
	КонецПопытки;
	
	ДобавитьДополнительныеНаборыДанныхСКД(СКД, НастройкиОбъекта);
	ДобавитьДополнительныеПараметрыСКД(СКД, НастройкиОбъекта);
	ДобавитьПараметрВыбораДляПоляПроект(СКД);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	
КонецПроцедуры

#Область ПредставлениеПроектнойЗадачи

// Используется для получения представления Проектной задачи с учетом признака ЗадачаОтменена
//
// Параметры:
//	Название - Строка - Название проектной задачи
//	ЗадачаОтменена - Булево - Признак отмененой задачи
//	ЯвляетсяЗадачейВыбранныхВерсий - Булево - Признак задачи, которая не входит в выбранный тип версии
//											  или в выбранную версию. Используется в отчете упоТрудозатратыПоУровнямПланирования 
//
// Возвращаемое значение:
//  Строка - Новое представление проектной задачи.
//
Функция ПолучитьПредставлениеПроектнойЗадачи(Название, ЗадачаОтменена, ЯвляетсяЗадачейВыбранныхВерсий = Истина) Экспорт
	
	ТипЗначения = ТипЗнч(ЯвляетсяЗадачейВыбранныхВерсий);
	Если ТипЗначения = Тип("Булево") И Не ЯвляетсяЗадачейВыбранныхВерсий Тогда
		Представление = ПолучитьПредставлениеПроектнойЗадачиНеЯвляетсяЗадачейВыбранныхВерсий();
		Возврат Представление;
	КонецЕсли;
	
	Представление = Название;	
	ТипЗначения = ТипЗнч(ЗадачаОтменена);
	Если ТипЗначения <> Тип("Булево") Тогда
		Возврат Представление;
	КонецЕсли;
	
	Если ЗадачаОтменена Тогда
		Префикс = упоПроектыИЗадачиОбщие.ПрефиксОтмененнойЗадачи();
		Представление = Префикс + Представление;		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции	

#КонецОбласти

#Область ПредставлениеПричинОтклонения

// Получает строковое представление для списка причин отклонения проектной задачи.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача
//  Версия			 - ДокументСсылка.упоВерсияПланаПроекта, Неопределено
// 
// Возвращаемое значение:
//  Строка - строковое представление причин отклонений.
//
Функция ПолучитьПредставлениеПричинОтклонений(ПроектнаяЗадача, Версия = Неопределено) Экспорт 
	
	Если Не упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПричиныОтклонений() Тогда
		Возврат "";
	КонецЕсли;
	
	Если Версия = Неопределено Тогда
		Версия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПричиныОтклонений();
	Запрос.УстановитьПараметр("Ссылка", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("текВерсия", Версия);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ШаблонПричины = "%1, %2";
	ФорматПериодаДень =  ФорматПериодаДень();
	МассивПричин = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Причина = СтрШаблон(ШаблонПричины, Формат(Выборка.ДатаИзменений, ФорматПериодаДень), Выборка.Причина);
		МассивПричин.Добавить(Причина);
	КонецЦикла;
	Представление = СтрСоединить(МассивПричин, "; ");
	
	Возврат Представление;
	
КонецФункции //

#КонецОбласти

Процедура ДобавитьВТВерсийПоСценариюВНаборыДанных(НаборыДанных, Знач ОсновнойНаборДанных)
		
	ИмяВремТаблицыВерсийПоСценарию = ИмяВремТабВерсийПоСценарию();
	Для Каждого НаборДанных Из НаборыДанных Цикл
		
		Если НаборДанных.Имя = ОсновнойНаборДанных Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоОбъект = ТипЗнч(НаборДанных) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных");
		Если ЭтоОбъект Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоОбъединение = ТипЗнч(НаборДанных) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных");
		Если ЭтоОбъединение Тогда
			НаборыДанныхОбъединения = НаборДанных.Элементы;
			ДобавитьВТВерсийПоСценариюВНаборыДанных(НаборыДанныхОбъединения, ОсновнойНаборДанных);
		КонецЕсли;
		
		ВставитьВременнуюТаблицуВТекстЗапроса = СтрНайти(НаборДанных.Запрос, ИмяВремТаблицыВерсийПоСценарию) > 0
			И СтрНайти(НаборДанных.Запрос, "ПОМЕСТИТЬ " + ИмяВремТаблицыВерсийПоСценарию) = 0;
		Если ВставитьВременнуюТаблицуВТекстЗапроса Тогда
			ВставитьВТекстЗапросаВремТабСВерсиямиПоСценарию(НаборДанных.Запрос);
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры

// Возвращает стандартную настройку полей периодов. Вызывается из модуля объекта отчета при определении 
// настроек объекта отчета.
// 
// Возвращаемое значение:
//  Массив - настройка полей периодов.
//
Функция СтандартнаяНастройкаОбъекта_Периоды() Экспорт
	
	МассивПолейПериода = Новый Массив;
	МассивПолейПериода.Добавить(Новый Структура("ПериодГод", 		"ПериодГод"));
	МассивПолейПериода.Добавить(Новый Структура("ПериодКвартал", 	"ПериодКвартал"));
	МассивПолейПериода.Добавить(Новый Структура("ПериодМесяц", 		"ПериодМесяц"));
	МассивПолейПериода.Добавить(Новый Структура("ПериодНеделя", 	"ПериодНеделя"));
	МассивПолейПериода.Добавить(Новый Структура("ПериодДень", 		"ПериодДень"));
	
	Возврат МассивПолейПериода;
	
КонецФункции

// Заполняет настройки отбора отчета из источника настроек.
//
// Параметры:
//  КомпоновщикНастроекПриемника - КомпоновщикНастроекКомпоновкиДанных - приемник настроек.
//  НастройкиИсточника - НастройкиКомпоновкиДанных - источник переносимых настроек.
//
Процедура ДополнитьОтборКомпоновщика(КомпоновщикНастроекПриемника, НастройкиИсточника) Экспорт
	
	ПоляИсключения = Новый Массив;
	ОтборКомпоновщика = КомпоновщикНастроекПриемника.Настройки.Отбор;
	
	КопируемыеЭлементыОтбора = НастройкиИсточника.Отбор.Элементы;
	ЭлементыОтбораИсточника = ОтборКомпоновщика.Элементы;
	
	ДополнитьОтборКомпоновщикаРекурсивно(ЭлементыОтбораИсточника, КопируемыеЭлементыОтбора, ПоляИсключения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗначениеМакетаОформленияБезОформления() Экспорт

	Возврат "Не использовать макет";
	
КонецФункции  

// Создает дополнительные группировки полей для переноса сроков ПЗ из общих итогов.
//
// Параметры:
//  НастройкиКомпоновкиДанных   - НастройкиКомпоновкиДанных - настройки компоновщика отчета.
//  НастройкиОбъектаОтчета      - см. метод ПолучитьНастройкиОтчета() модуля объекта отчета.
//
Процедура ПеренестиПоляСроковВДополнительнуюИнформацию(НастройкиКомпоновкиДанных, НастройкиОбъектаОтчета) Экспорт
	
	ТаблицаСодержащаяОсновныеНастройки = ТаблицаСодержащаяОсновныеНастройки(НастройкиКомпоновкиДанных);
	Если ТаблицаСодержащаяОсновныеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсновныеКолонкиТаблицы = ТаблицаСодержащаяОсновныеНастройки.Колонки;
	ИменаПолейДляВыводаВДопИнформацию = ИменаПолейСроковПроектныхЗадач(НастройкиОбъектаОтчета);
	Для Каждого Колонка Из ОсновныеКолонкиТаблицы Цикл
		СписокВыбранныхПолей = Новый Соответствие;
		ВыбранныеПоляСКД = Колонка.Выбор.Элементы;
		ЗаполнитьСписокВыбранныхПолей(СписокВыбранныхПолей, ВыбранныеПоляСКД, ВыбранныеПоляСКД);
		
		// Найдем поле сроков в колонке. Если есть, то отключаем использование. Иначе создаем и отключаем.
		Для Каждого ИмяПоля Из ИменаПолейДляВыводаВДопИнформацию Цикл
			ИскомоеПоле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			ИндексНайденногоПоля = СписокВыбранныхПолей.Получить(ИскомоеПоле);
			Если ИндексНайденногоПоля <> Неопределено Тогда
				НайденноеПоле = Колонка.Выбор.Элементы[ИндексНайденногоПоля];
				НайденноеПоле.Использование = Ложь;
			Иначе
				НовоеПоле = ВыбранныеПоляСКД.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				НовоеПоле.Поле = ИскомоеПоле;
				НовоеПоле.Использование = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Добавим доп. информацию.
	ДобавитьГруппировкуДопИнформации(ОсновныеКолонкиТаблицы, ИменаПолейДляВыводаВДопИнформацию);
	ДобавитьГруппировкуВКонец = Истина;
	ДобавитьГруппировкуДопИнформации(ОсновныеКолонкиТаблицы, ИменаПолейДляВыводаВДопИнформацию, ДобавитьГруппировкуВКонец);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьФорматПолю(Настройки, Формат, ИмяПоля)
	
	ЭлементыУсловногоОформления = Настройки.УсловноеОформление.Элементы;
	
	ЭлементУсловногоОформления = ЭлементыУсловногоОформления.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	
	Оформление = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Формат");
	Оформление.Значение = Формат;
	Оформление.Использование = Истина; 
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Использование = Истина;
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);	
	
КонецПроцедуры

Процедура ДобавитьСтрокуВПредставлениеРекурсивно(СтрокиКолонки, Представление)
	
	Для Каждого СтрокаКолонка Из СтрокиКолонки.ПоляГруппировки.Элементы Цикл
		
		Представление = Представление + СтрокаКолонка.Поле + ",";
		
		Если  СтрокиКолонки.Структура.Количество() > 0 Тогда
			
			Для Каждого ЭлементСтруктуры Из СтрокиКолонки.Структура Цикл
				
				ДобавитьСтрокуВПредставлениеРекурсивно(ЭлементСтруктуры,Представление);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает добавленный набор данных.
//
// Параметры:
//	СКД				- Схема компоновки данных	- схема компоновки данных.
//	Имя				- Строка					- имя набора данных.
//	ИсточникДанных	- Строка					- имя источника данных.
//	ТекстЗапроса	- Строка					- текст запроса для получения данных набора.
//			  
// Возвращаемое значение:
//	НаборДанныхЗапросСхемыКомпоновкиДанных - Описание набора данных схемы компоновки данных.
//
Функция ДобавитьНаборДанных(СКД, Имя, ИсточникДанных, ТекстЗапроса, АвтоЗаполнениеДоступныхПолей = Истина)
	
	НаборДанных 			   = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя 		   = Имя;
	НаборДанных.ИсточникДанных = ИсточникДанных;
	НаборДанных.Запрос 		   = ТекстЗапроса;
	НаборДанных.АвтоЗаполнениеДоступныхПолей = АвтоЗаполнениеДоступныхПолей;
	
	Возврат НаборДанных;
	
КонецФункции

// Процедура добавляет поле компоновки данных.
//
// Параметры:
//	НаборДанных		- НаборДанныхЗапросСхемыКомпоновкиДанных - описание набора данных схемы компоновки данных.
//	Поле			- Строка 								 - имя поля набора данных, для которого делается описание.
//	ПутьКДанным		- Строка 								 - путь к данным, под которым поле будет фигурировать в настройках и выражениях.
//	НеГруппировка	- Булево 								 - определяет, будет ли доступно поле для группировки.
//	НеПоле			- Булево 								 - определяет, будет ли доступно поле для выбора.
//	НеПорядок		- Булево 								 - определяет, будет ли доступно поле для упорядочивания.
//	НеУсловие		- Булево 								 - определяет, будет ли доступно поле для отбора.
//
Процедура ДобавитьПолеКомпоновки(НаборДанных,
								 Поле,
								 ПутьКДанным,
								 НеГруппировка = Ложь,
								 НеПоле = Ложь,
								 НеПорядок = Ложь,
								 НеУсловие = Ложь,
								 ЭлементыОформления = Неопределено,
								 Заголовок = Неопределено,
								 ТипЗначения = Неопределено,
								 ВыражениеПредставления = Неопределено,
								 ОграничениеИспользования = Неопределено)
	
	ПолеКомпоновки = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));		
	ПолеКомпоновки.Поле = Поле;
	ПолеКомпоновки.ПутьКДанным = ПутьКДанным;
	ПолеКомпоновки.ОграничениеИспользованияРеквизитов.Группировка = НеГруппировка;
	ПолеКомпоновки.ОграничениеИспользованияРеквизитов.Поле = НеПоле;
	ПолеКомпоновки.ОграничениеИспользованияРеквизитов.Порядок = НеПорядок;
	ПолеКомпоновки.ОграничениеИспользованияРеквизитов.Условие = НеУсловие;
	Если ОграничениеИспользования <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПолеКомпоновки.ОграничениеИспользования, ОграничениеИспользования);
	КонецЕсли;
	Если ЭлементыОформления <> Неопределено Тогда
		Для Каждого Эл Из ЭлементыОформления Цикл
			ПолеКомпоновки.Оформление.УстановитьЗначениеПараметра(Эл.Ключ, Эл.Значение);
		КонецЦикла;
	КонецЕсли;
	Если Заголовок <> Неопределено Тогда
		ПолеКомпоновки.Заголовок = Заголовок;
	КонецЕсли;	
	Если ТипЗначения <> Неопределено Тогда
		ПолеКомпоновки.ТипЗначения = ТипЗначения;	
	КонецЕсли;
	Если ВыражениеПредставления <> Неопределено Тогда
		ПолеКомпоновки.ВыражениеПредставления = ВыражениеПредставления;
	КонецЕсли; 	
	
КонецПроцедуры

// Процедура добавляет связь наборов данных в схему компоновки данных.
//
// Параметры:
//	СКД					- Схема компоновки данных 	- схема компоновки данных.
//	НаборДанныхИсточник	- Строка					- имя набора данных, от которого будет осуществляться связь.
//	НаборДанныхПриемник	- Строка					- имя набора данных, к которому будет осуществляться связь.
//	ВыражениеИсточник	- Строка					- выражение, по которому будет определяться значение связи источника.
//	ВыражениеПриемник	- Строка					- выражение, по которому будет определяться значение связи приемника.			  
//
Процедура ДобавитьСвязьНаборовДанных(СКД,
									 НаборДанныхИсточник, 
									 НаборДанныхПриемник, 
									 ВыражениеИсточник, 
									 ВыражениеПриемник,
									 РазрешенСписокПараметров = Ложь,
									 Параметр = Неопределено,
									 ЭтоОбязательнаяСвязь = Истина)
	
	СвязьНаборовДанных 	= СКД.СвязиНаборовДанных.Добавить();
	СвязьНаборовДанных.НаборДанныхИсточник 		= НаборДанныхИсточник;
	СвязьНаборовДанных.НаборДанныхПриемник 		= НаборДанныхПриемник;
	СвязьНаборовДанных.ВыражениеИсточник   		= ВыражениеИсточник;
	СвязьНаборовДанных.ВыражениеПриемник   		= ВыражениеПриемник;
	СвязьНаборовДанных.РазрешенСписокПараметров = РазрешенСписокПараметров;
	СвязьНаборовДанных.Обязательная = ЭтоОбязательнаяСвязь;
	Если РазрешенСписокПараметров Тогда 
		СвязьНаборовДанных.Параметр 			= Параметр;
	КонецЕсли;	
		
КонецПроцедуры

// Процедура добавляет поле ресурса в схему компоновки данных.
//
// Параметры:
//	СКД			- СхемаКомпоновкиДанных - схема компоновки данных.
//	Выражение   - Строка 				- содержит выражение, по которому будет осуществляться расчет итога по полю.
//	ПутьКДанным - Строка 				- содержит путь к данным поля, для которого описывается формула расчета итога.
//
Процедура ДобавитьПолеРесурса(СКД, Выражение, ПутьКДанным, МассивГруппировок = Неопределено)
	
	ПолеРесурса 			= СКД.ПоляИтога.Добавить();
	ПолеРесурса.Выражение 	= Выражение;
	ПолеРесурса.ПутьКДанным = ПутьКДанным;
	
	Если МассивГруппировок <> Неопределено Тогда
		Для Каждого Группировка Из МассивГруппировок Цикл
			ПолеРесурса.Группировки.Добавить(Группировка);		
		КонецЦикла; 			
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьЗаголовкиПолейВыбораПоДоступнымПолямРекурсивно(ЭлементыВыбора, ДоступныеПоляВыбора)
	
	Для Каждого ЭлементВыбора Из ЭлементыВыбора Цикл				
		Если ТипЗнч(ЭлементВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда						
			УстановитьЗаголовкиПолейВыбораПоДоступнымПолямРекурсивно(ЭлементВыбора.Элементы, ДоступныеПоляВыбора);
		Иначе	
			ДоступноеПоле = ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
			Если ДоступноеПоле <> Неопределено Тогда
				ЭлементВыбора.Заголовок = ДоступноеПоле.Заголовок;						
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

Процедура ДобавитьПерсональнуюНастройку(СтруктураНастроек, ИмяНастройки, ЗначениеПоУмолчанию)
	
	ИмяГруппыНастроек = "НастройкиРаботыСОтчетами";
	
	Значение = ХранилищеОбщихНастроек.Загрузить(ИмяГруппыНастроек, ИмяНастройки);
	Если Значение = Неопределено Или ИмяНастройки = "МакетОформленияОтчетов" И Значение = "" Тогда 
		Значение = ЗначениеПоУмолчанию;
		ХранилищеОбщихНастроек.Сохранить(ИмяГруппыНастроек, ИмяНастройки, Значение);
	КонецЕсли;
	СтруктураНастроек.Вставить(ИмяНастройки, Значение);

КонецПроцедуры

Процедура СнятьОтборПоПоказателям(Отчет)
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Отбор = Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Если ЭлементОтбора.Представление = НСтр("ru = 'Не выводить незаполненные движения'") Тогда
			ОтборПоказатели = ЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	Если ОтборПоказатели <> Неопределено Тогда
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ОтборПоказатели);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПараметрВыбораДляПоляПроект(СхемаКомпоновки)
	
	Для Каждого НаборДанных Из СхемаКомпоновки.НаборыДанных Цикл
		ПолеПроект = НаборДанных.Поля.Найти("Проект");
		Если ПолеПроект <> Неопределено Тогда
			ПараметрыРедактирования = ПолеПроект.ПараметрыРедактирования;
			ПараметрыВыбора = ПараметрыРедактирования.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПараметрыВыбора"));
			Если ПараметрыВыбора <> Неопределено Тогда
				ПараметрВыбораПоКомпоненту = ПараметрыВыбора.Значение.Найти("Отбор.Компонент");
				Если ПараметрВыбораПоКомпоненту = Неопределено Тогда
					ПараметрыВыбора.Использование = Истина;
					НовыйПараметрВыбора = ПараметрыВыбора.Значение.Добавить();
					НовыйПараметрВыбора.Имя = "Отбор.Компонент";
					НовыйПараметрВыбора.Значение = Перечисления.упоКомпоненты.Проект;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ЗаменаТипаВерсии

// Функция выполняет замену в тексте запроса типа версии из настроек на указанную.
//
// Параметры:
//	ТекстЗапроса			- Строка	- текст запроса.
//	ТипПлана			- ПеречислениеСсылка.упоТипПланаПроекта	- выбранный тип плана проекта.
//	НастройкиЗаменыВерсии - Структура - заменяемая версия 
//
// Возвращаемое значение:
//	Текст			- Строка	- текст запроса.
//
Функция ВыполнитьЗаменуТипаВерсииВТекстеЗапроса(Знач ТекстЗапроса, ТипПлана, НастройкиЗаменыВерсии) Экспорт 
	
	Если ТипПлана = НастройкиЗаменыВерсии.ТипПлана Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;	

	ОтборПоСценарию = ЭтоОтборПоСценарию(ТипПлана);
	
	ТипВерсииСтрокаЗамены = ТипВерсииСтрокойПоТипуПлана(ТипПлана);	
	
	МассивЧастей = Новый Массив;
	ЭтоЗаменаНеТекущейВерсии = НастройкиЗаменыВерсии.Свойство("ЭтоЗаменаНеТекущейВерсии");
	мРегистрыЗамены = РегистрыЗамены(ЭтоЗаменаНеТекущейВерсии, ТипВерсииСтрокаЗамены, ОтборПоСценарию);	
		
	Для Каждого КлючЗначение Из мРегистрыЗамены Цикл
					
		ПолноеИмяРегистра 		= КлючЗначение.Ключ;
		ПолноеИмяРегистраЗамены = КлючЗначение.Значение;
		
		// Нельзя заменить все таблицы сразу, т.к. они могут иметь разные псевдонимы. 
		ЧислоВхождений = СтрЧислоВхождений(ТекстЗапроса, ПолноеИмяРегистра);
		
		Если ЧислоВхождений = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Для Сч = 1 По ЧислоВхождений Цикл					
			ТекстЗапроса = ВыполнитьЗаменуВЧастиТекстаСВхождением(ТекстЗапроса, 
													ПолноеИмяРегистра, 
													ПолноеИмяРегистраЗамены, 
													НастройкиЗаменыВерсии.ТипВерсии,
													ТипВерсииСтрокаЗамены,
													МассивЧастей,
													ЭтоЗаменаНеТекущейВерсии,
													ОтборПоСценарию);
		КонецЦикла;		
		МассивЧастей.Добавить(ТекстЗапроса);
		
		ТекстЗапроса = СтрСоединить(МассивЧастей);
		
		МассивЧастей.Очистить();
		
	КонецЦикла;
	
	
	Если ОтборПоСценарию Тогда
		ВставитьВТекстЗапросаВремТабСВерсиямиПоСценарию(ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
		
КонецФункции

Функция ВыполнитьЗаменуВЧастиТекстаСВхождением(Текст, 
												ПолноеИмяРегистра, 
												ПолноеИмяРегистраЗамены,
												ТипВерсииСтрока,
												ТипВерсииСтрокаЗамены, 
												МассивЧастей,
												ЭтоЗаменаНеТекущейВерсии,
												ОтборПоСценарию = Ложь)
												
	ДлинаИмениРегистра = СтрДлина(ПолноеИмяРегистра);  	
	ПозицияНачалоЗамены = СтрНайти(Текст, ПолноеИмяРегистра);
		
	Псевдоним = ПсевдонимТаблицыЗамены(Текст, ПолноеИмяРегистра);	
	
	// Где заменять.
	ПозицияПсевдоним = СтрНайти(Текст, Псевдоним, , ПозицияНачалоЗамены + ДлинаИмениРегистра + 1);		
	ПозицияКонецЗамены = СтрНайти(Текст, ПолноеИмяРегистра, , ПозицияПсевдоним + СтрДлина(Псевдоним));	
	Если ПозицияКонецЗамены = 0 Тогда 
		ПозицияКонецЗамены = СтрДлина(Текст) + 1;
	КонецЕсли;	
	
	ЧастьТекста = Лев(Текст, ПозицияКонецЗамены - 1);				
	
	// Что заменять.	
	Если ПолноеИмяРегистра = "РегистрСведений.упоВерсииПроекта" Тогда			
		Если ОтборПоСценарию Тогда
			ОтборПоВерсии = УсловиеОтбораВерсииПоВерсиямСценария(Псевдоним);
			ЧастьТекста = СтрЗаменить(ЧастьТекста, 	Псевдоним + "." + ТипВерсииСтрока, ОтборПоВерсии);
		Иначе
			ЧастьТекста = СтрЗаменить(ЧастьТекста, 	Псевдоним + "." + ТипВерсииСтрока,  Псевдоним + "." + ТипВерсииСтрокаЗамены);
		КонецЕсли;
		
	Иначе		
		
		Если ЭтоЗаменаНеТекущейВерсии Тогда
			ЧастьТекста = ТекстЗапросаУдалениеСвязиСТаблицей(ЧастьТекста, "РегистрСведений.упоВерсииПроекта", Псевдоним);
		КонецЕсли;
		
		ПозицияКонецПсевдонима = ПозицияПсевдоним + СтрДлина(Псевдоним);

		ИмяИПсевдонимРегистра = Сред(ЧастьТекста, ПозицияНачалоЗамены, ПозицияКонецПсевдонима - ПозицияНачалоЗамены);	
		ТекстЗамены = ТекстЗаменыАктуальныеПланыТрудозатрат(ПолноеИмяРегистраЗамены, Псевдоним, ТипВерсииСтрокаЗамены, ЭтоЗаменаНеТекущейВерсии, ОтборПоСценарию);
		ЧастьТекста = СтрЗаменить(ЧастьТекста, ИмяИПсевдонимРегистра, ТекстЗамены);
		Если Не ЭтоЗаменаНеТекущейВерсии Тогда
			// Замена отсутствующего измерения "Проект".
			ЧастьТекста = СтрЗаменить(ЧастьТекста, Псевдоним + ".Проект ", Псевдоним + ".Операция.Проект ");
			ЧастьТекста = СтрЗаменить(ЧастьТекста, Псевдоним + ".Проект.", Псевдоним + ".Операция.Проект.");
		КонецЕсли;
		
	КонецЕсли;			
	
	МассивЧастей.Добавить(ЧастьТекста);
		
	Возврат Сред(Текст, ПозицияКонецЗамены);

КонецФункции

Функция ТекстЗапросаУдалениеСвязиСТаблицей(ЧастьТекста, ИмяТаблицы, ПсевдонимТаблицы)

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ЧастьТекста);
	ЕстьУдаленныеСвязи = Ложь;
	Для каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТипЗнч(Пакет) <> Тип("ЗапросВыбораСхемыЗапроса") Тогда 
			Продолжить;
		КонецЕсли;
		Для Каждого Оператор Из Пакет.Операторы Цикл
			Для Каждого Источник Из Оператор.Источники Цикл
				Если Источник.Источник.Псевдоним <> ПсевдонимТаблицы Тогда
					Продолжить;
				КонецЕсли;
				мУдалить = Новый Массив;
				Для Каждого Соединение Из Источник.Соединения Цикл
					Если Соединение.Источник.Источник.ИмяТаблицы = ИмяТаблицы Тогда
						мУдалить.Вставить(0, Источник.Соединения.Индекс(Соединение));
					КонецЕсли;	
				КонецЦикла;	
				Для Каждого Индекс Из мУдалить Цикл
					Источник.Соединения.Удалить(Индекс);
				КонецЦикла;	
				ЕстьУдаленныеСвязи = Истина;
				Прервать;
			КонецЦикла;
			Если Не ЕстьУдаленныеСвязи Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Источник Из Оператор.Источники Цикл 
				Если Источник.Источник.ИмяТаблицы <> ИмяТаблицы Тогда
					Продолжить;
				КонецЕсли;	
				Оператор.Источники.Удалить(Оператор.Источники.Индекс(Источник));
				Прервать;
			КонецЦикла;	
			Прервать;						
		КонецЦикла;
		Если ЕстьУдаленныеСвязи Тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗаменыАктуальныеПланыТрудозатрат(ИмяРегистраЗамены, ПсевдонимТаблицы, ТипВерсииСтрокаЗамены, ЭтоЗаменаНеТекущейВерсии, ОтборПоСценарию = Ложь)
 
	Если ОтборПоСценарию Тогда
		
			
		ТекстЗамены  = "%1 КАК %2
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ %3 КАК %3
						|		ПО %2.Версия = %3.Версия";
		ИмяТаблицыВерсийПоСценарию = ИмяВремТабВерсийПоСценарию();
					
 
		ТекстЗамены = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗамены, 
																	ИмяРегистраЗамены, 
																	ПсевдонимТаблицы, 
																	ИмяТаблицыВерсийПоСценарию);
		
	Иначе

	
		Если ЭтоЗаменаНеТекущейВерсии И ТипВерсииСтрокаЗамены = "Текущая" Тогда
			ТекстЗамены  = "%1 КАК %2";
		Иначе	
			ТекстЗамены  = "%1 КАК %2
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
							|		ПО %2.Версия = упоВерсииПроекта.Версия
							|			И (упоВерсииПроекта.%3)";
		КонецЕсли;
	
		ТекстЗамены = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗамены, 
																		ИмяРегистраЗамены, 
																		ПсевдонимТаблицы, 
																		ТипВерсииСтрокаЗамены);
			
	КонецЕсли;
																	
	Возврат ТекстЗамены;
	
КонецФункции

Функция ПсевдонимТаблицыЗамены(Текст, ИмяРегистра)
	
	ДлинаИмени = СтрДлина(ИмяРегистра);  
	ПозицияЗамены = СтрНайти(Текст, ИмяРегистра);
	
	ПозицияКонецИмениРегистра = ПозицияЗамены + ДлинаИмени + 1;
	
	ПозицияКонецСтроки = СтрНайти(Текст, Символы.ПС, , ПозицияКонецИмениРегистра);
	Если ПозицияКонецСтроки = 0 Тогда
		// Запрос написан в одну строку, задаем отрывок поиска.
		ОтрывокПоиска = 100;
		ПозицияКонецСтроки = ПозицияКонецИмениРегистра + ОтрывокПоиска; 
	КонецЕсли;		
	
	ОтрывокПоиска = Сред(Текст, ПозицияКонецИмениРегистра, ПозицияКонецСтроки - ПозицияКонецИмениРегистра);
	МассивПодстрокОтрывка = СтрРазделить(ОтрывокПоиска, " ", Ложь);
	
	ЗабратьПсевдоним = Ложь;
	ЕстьПсевдоним = Ложь;
	Псевдоним = "";
	
	Для Каждого ПодстрокаОтрывка Из МассивПодстрокОтрывка Цикл
		Если ЗабратьПсевдоним Тогда
			Псевдоним = ПодстрокаОтрывка;
			ЕстьПсевдоним = Истина;
			Прервать;
		КонецЕсли;	
		Если ПодстрокаОтрывка = "КАК" Тогда			
			ЗабратьПсевдоним = Истина;
		ИначеЕсли ПодстрокаОтрывка = "СОЕДИНЕНИЕ" 
			Или ПодстрокаОтрывка = "ГДЕ" 
			Или ПодстрокаОтрывка = ";" Тогда
			Прервать;
		Иначе	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Псевдоним;
	
КонецФункции

Функция РегистрыЗамены(ЭтоЗаменаНеТекущейВерсии, ТипВерсииСтрокаЗамены, ОтборПоСценарию = Ложь)
	
	СоответствиеИмен = Новый Соответствие;
	Если ЭтоЗаменаНеТекущейВерсии Тогда
		Если ТипВерсииСтрокаЗамены = "Текущая" 
			И Не ОтборПоСценарию Тогда
			
			СоответствиеИмен.Вставить("РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямВерсии", 
				"РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия");
			СоответствиеИмен.Вставить("РегистрСведений.упоАктуальныеПланыТрудозатратСводноВерсии", 
				"РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия");
		Иначе
			СоответствиеИмен.Вставить("РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямВерсии", 
				"РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямВерсии");
			СоответствиеИмен.Вставить("РегистрСведений.упоАктуальныеПланыТрудозатратСводноВерсии", 
				"РегистрСведений.упоАктуальныеПланыТрудозатратСводноВерсии");
		КонецЕсли;	
	Иначе	
		СоответствиеИмен.Вставить("РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", 
			"РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямВерсии");
		СоответствиеИмен.Вставить("РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", 
			"РегистрСведений.упоАктуальныеПланыТрудозатратСводноВерсии");
	КонецЕсли;	
	СоответствиеИмен.Вставить("РегистрСведений.упоВерсииПроекта", 
		"");
	
	Возврат СоответствиеИмен;
	
КонецФункции

Функция ТипВерсииСтрокойПоТипуПлана(ТипПлана) Экспорт
	
	Если ТипПлана = Перечисления.упоТипПланаПроекта.Договорной Тогда
		ТипВерсии = "Договорная";	
	ИначеЕсли ТипПлана = Перечисления.упоТипПланаПроекта.Базовый Тогда
		ТипВерсии = "Базовая";
	Иначе
		ТипВерсии = "Текущая";
	КонецЕсли;	
	
	Возврат ТипВерсии;
	
КонецФункции

Функция ТекстЗапросаДляПолученияДанныхПоТипуВерсии(ТипВерсии, ТекстЗапроса)
	
	ПолныйТекстЗапроса = Новый Массив;
	ВерсииВыбранногоТипа = ТекстЗапросаДляПолученияВерсийПоТипуВерсии();
	ВерсииВыбранногоТипа = СтрЗаменить(ВерсииВыбранногоТипа, "%ТипВерсии", ТипВерсии);
	ПолныйТекстЗапроса.Добавить(ВерсииВыбранногоТипа);
	ПолныйТекстЗапроса.Добавить(ОбщегоНазначения.РазделительПакетаЗапросов());
		
	ПолныйТекстЗапроса.Добавить(ТекстЗапроса);
	Возврат СтрСоединить(ПолныйТекстЗапроса);	
	
КонецФункции

Функция ТекстЗапросаДляПолученияВерсийПоТипуВерсии()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВерсииПроекта.Проект КАК Проект,
	               |	упоВерсииПроекта.Версия КАК Версия,
	               |	упоВерсииПроекта.Текущая КАК Текущая,
	               |	упоВерсииПроекта.ВерсияВключаетДанныеВыполнения КАК ВерсияВключаетДанныеВыполнения,
	               |	упоВерсииПроекта.%ТипВерсии КАК ТипВерсии
	               |ПОМЕСТИТЬ ВерсииПроектов
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	(упоВерсииПроекта.Текущая
	               |			ИЛИ упоВерсииПроекта.%ТипВерсии)
	               |{ГДЕ
	               |	упоВерсииПроекта.Проект.* КАК Проект}
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииПроектов.Проект КАК Проект,
	               |	ВерсииПроектов.Версия КАК Версия
	               |ПОМЕСТИТЬ ВерсииВыбранногоТипВерсии
	               |ИЗ
	               |	ВерсииПроектов КАК ВерсииПроектов
	               |ГДЕ
	               |	ВерсииПроектов.ТипВерсии
	               |	И ВерсииПроектов.ВерсияВключаетДанныеВыполнения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииПроектов.Проект КАК Проект,
	               |	ВерсииПроектов.Версия КАК Версия
	               |ПОМЕСТИТЬ ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе
	               |ИЗ
	               |	ВерсииПроектов КАК ВерсииПроектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВерсииВыбранногоТипВерсии КАК ВерсииВыбранногоТипВерсии
	               |		ПО ВерсииПроектов.Проект = ВерсииВыбранногоТипВерсии.Проект
	               |ГДЕ
	               |	ВерсииВыбранногоТипВерсии.Проект ЕСТЬ NULL
	               |	И ВерсииПроектов.Текущая
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииВыбранногоТипВерсии.Проект КАК Проект,
	               |	ВерсииВыбранногоТипВерсии.Версия КАК Версия
	               |ПОМЕСТИТЬ ВерсииВыбранногоТипа
	               |ИЗ
	               |	ВерсииВыбранногоТипВерсии КАК ВерсииВыбранногоТипВерсии
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе.Проект,
	               |	ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе.Версия
	               |ИЗ
	               |	ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе КАК ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗаписатьСхемуВФайлXML(СКД, ИмяФайла, ПолучитьТекст = Ложь) Экспорт
// Функция также используется отдельно для отладочной записи СКД в файл.

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 
		СКД, 
		"dataCompositionSchema", 
		"http://v8.1c.ru/8.1/data-composition-system/schema",
		НазначениеТипаXML.Явное);
		
	ЗаписьXML.Закрыть();
	
	Если ПолучитьТекст Тогда
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ИмяФайла);
		ТекстXML = ТекстДок.ПолучитьТекст();
		Возврат ТекстXML;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыгрузитьСхемуВФайлXML(АдресСхемыКомпоновкиДанных, УникальныйИдентификатор) Экспорт
			
	ИмяТемпФайла = ПолучитьИмяВременногоФайла("xml");
		
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		
	ЗаписатьСхемуВФайлXML(СхемаКомпоновкиДанных, ИмяТемпФайла);
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяТемпФайла), УникальныйИдентификатор);
	
	Файл = Новый Файл(ИмяТемпФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяТемпФайла);
	КонецЕсли;
		
	Возврат АдресФайла; 
	
КонецФункции

Процедура ИзменитьТекстЗапросаОсновногоНабораДанныхСКДПоТипуПлана(ОсновнаяСхемаКомпоновки, ТипПлана, НастройкиЗаменыВерсии)
	
	Если Не ЗначениеЗаполнено(ТипПлана) 
		Или ТипПлана = НастройкиЗаменыВерсии.ТипПлана 
		И ТипЗнч(ТипПлана) = Тип("ПеречислениеСсылка.упоТипПланаПроекта") Тогда
		Возврат;		
	КонецЕсли;	
	
	Если ТипЗнч(ОсновнаяСхемаКомпоновки.НаборыДанных[0]) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
		
		Для Каждого ЭлементНабора Из ОсновнаяСхемаКомпоновки.НаборыДанных[0].Элементы Цикл
			
			Если ТипЗнч(ЭлементНабора) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда																					
				ЭлементНабора.Запрос = ВыполнитьЗаменуТипаВерсииВТекстеЗапроса(
															ЭлементНабора.Запрос,
															ТипПлана,
															НастройкиЗаменыВерсии);																					
			КонецЕсли;	
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ОсновнаяСхемаКомпоновки.НаборыДанных[0]) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда											
		ОсновнаяСхемаКомпоновки.НаборыДанных[0].Запрос = ВыполнитьЗаменуТипаВерсииВТекстеЗапроса(
															ОсновнаяСхемаКомпоновки.НаборыДанных[0].Запрос,
															ТипПлана,
															НастройкиЗаменыВерсии);
	КонецЕсли;				
	
КонецПроцедуры

Процедура ПрименитьНастройкуТипПлана(СтруктураНастроек, ОсновнаяСхемаКомпоновки, КомпоновщикНастроек) Экспорт
	
	Если СтруктураНастроек.Свойство("ТипПлана") Тогда
		// Перенос выбранной настройки формы в структуру настроек отчета.		
		ПН = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("_ТипПлана_");
		Если ПН <> Неопределено Тогда
			СтруктураНастроек.ТипПлана = ПН.Значение;
		КонецЕсли;	
		
		Если СтруктураНастроек.Свойство("НастройкиЗаменыВерсии") Тогда
			НастройкиЗаменыВерсии = СтруктураНастроек.НастройкиЗаменыВерсии;
		Иначе
			НастройкиЗаменыВерсии = Новый Структура("ТипВерсии, ТипПлана", "Текущая", Перечисления.упоТипПланаПроекта.Текущий);
		КонецЕсли;	 
		ИзменитьТекстЗапросаОсновногоНабораДанныхСКДПоТипуПлана(ОсновнаяСхемаКомпоновки, СтруктураНастроек.ТипПлана, НастройкиЗаменыВерсии);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура УстановитьИерархиюПЗПоТипуВерсии(СКД, ОсновнойНаборДанных, СтруктураНастроек, Знач ТипВерсии, ОтборПоСценарию = Ложь)
						
	// Иерархия.
    ИмяПоляПЗДляИерархии = Неопределено;
	СтруктураНастроек.Свойство("ИмяПоляПЗДляИерархииПоВерсии", ИмяПоляПЗДляИерархии);		
	Если ИмяПоляПЗДляИерархии = Неопределено Тогда
		ИмяПоляПЗДляИерархии = "ПроектнаяЗадача";
	КонецЕсли;	
	
	ТекстЗапросаИерархия = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проекты.Ссылка КАК ПроектнаяЗадача,
	|	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	|	Проекты.упоКорневойПроект КАК Проект,
	|	Проекты.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача
	|ПОМЕСТИТЬ втОТбор
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Ссылка В(&ПроектныеЗадачи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	втОтбор.ПроектнаяЗадача КАК %ИмяПоляПЗ,
	|	ЕСТЬNULL(Проекты.Ссылка, втОтбор.Проект) КАК ЗадачаРодитель,
	|	втОтбор.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	|	втОтбор.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача
	|{ВЫБРАТЬ
	|	ПроектнаяЗадача.* КАК %ИмяПоляПЗ,
	|	ЗадачаРодитель.* КАК ЗадачаРодитель,
	|	СсылкаНаПроектнуюЗадачу,
	|	ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача}
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			{(НЕОПРЕДЕЛЕНО) КАК Поле2},
	|			ПроектнаяЗадача В
	|				(ВЫБРАТЬ
	|					втОТбор.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу
	|				ИЗ
	|					втОТбор КАК втОТбор) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	|			И (упоВерсииПроекта.%ТипВерсии)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОТбор КАК втОтбор
	|		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = втОтбор.СсылкаНаПроектнуюЗадачу
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка))
	|			И упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = Проекты.СсылкаНаПроектнуюЗадачу
	|			И (НЕ Проекты.ПометкаУдаления)   
	| {ГДЕ
	|	втОтбор.ПроектнаяЗадача КАК %ИмяПоляПЗ,
	|	(ЕСТЬNULL(Проекты.Ссылка, втОтбор.Проект)) КАК ЗадачаРодитель}
	|
	| ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втОТбор.ПроектнаяЗадача,
	|	Значение(Справочник.Проекты.ПустаяСсылка),
	|	втОтбор.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	|	втОтбор.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача
	|ИЗ
	|	втОТбор КАК втОТбор 
	|ГДЕ 
	|	НЕ втОТбор.ЭтоПроектнаяЗадача
	|{ГДЕ
	|	втОТбор.ПроектнаяЗадача КАК %ИмяПоляПЗ, 
	|	(ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК ЗадачаРодитель}";
	
	Если ОтборПоСценарию Тогда
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		ТекстЗапросаИерархия = СтрЗаменить(ТекстЗапросаИерархия, "%ТипВерсии", УсловиеОтбора);
	Иначе

		ТекстЗапросаИерархия = СтрЗаменить(ТекстЗапросаИерархия, "%ТипВерсии", ТипВерсии);
	КонецЕсли;
	
	ТекстЗапросаИерархия = СтрЗаменить(ТекстЗапросаИерархия, "%ИмяПоляПЗ", ИмяПоляПЗДляИерархии);

	НаборДанныхИерархия = ДобавитьНаборДанных(СКД, "Иерархия", "ИсточникДанных1", ТекстЗапросаИерархия, Ложь);
	ДобавитьПолеКомпоновки(НаборДанныхИерархия, "НазваниеЗадачи", "НазваниеЗадачи");
	ДобавитьПолеКомпоновки(НаборДанныхИерархия, ИмяПоляПЗДляИерархии, ИмяПоляПЗДляИерархии);
	ДобавитьПолеКомпоновки(НаборДанныхИерархия, "ЗадачаРодитель", "ЗадачаРодитель");
	ДобавитьПолеКомпоновки(НаборДанныхИерархия, "СсылкаНаПроектнуюЗадачу", "СсылкаНаПроектнуюЗадачу");
	
	ДобавитьСвязьНаборовДанных(СКД, 
		"Иерархия", 
		"Иерархия", 
		"ЗадачаРодитель", 
		ИмяПоляПЗДляИерархии, 
		Истина, 
		"ПроектныеЗадачи");
	
	ДобавитьСвязьНаборовДанных(СКД,
		ОсновнойНаборДанных,
		"Иерархия", 
		ИмяПоляПЗДляИерархии,           
		ИмяПоляПЗДляИерархии,
		Истина,
		"ПроектныеЗадачи");
	
	// Проверка иерархии.

	ТекстЗапросаПроверкаИерархии = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                               |	Проекты.Ссылка КАК ПроектнаяЗадача,
	                               |	Проекты.СсылкаНаПроектнуюЗадачу КАК СсылкаНаПроектнуюЗадачу,
	                               |	Проекты.упоКорневойПроект КАК Проект
	                               |ПОМЕСТИТЬ втОТбор
	                               |ИЗ
	                               |	Справочник.Проекты КАК Проекты
	                               |ГДЕ
	                               |	Проекты.Ссылка В(&ПроектныеЭтапы)
	                               |;
	                               |
	                               |////////////////////////////////////////////////////////////////////////////////
	                               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                               |	Проекты.Ссылка КАК ПроектнаяЗадачаПроверкаИерархии,
	                               |	втОтбор.ПроектнаяЗадача КАК ЗадачаРодительПроверкаИерархии
	                               |{ВЫБРАТЬ
	                               |	ПроектнаяЗадачаПроверкаИерархии,
	                               |	ЗадачаРодительПроверкаИерархии}
	                               |ИЗ
	                               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК упоСвойстваПроектныхЗадачСрезПоследних
	                               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	                               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	                               |			И (упоВерсииПроекта.%ТипВерсии)
	                               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОТбор КАК втОтбор
	                               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = втОтбор.СсылкаНаПроектнуюЗадачу
	                               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка))
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	                               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
	                               |			И (НЕ Проекты.ПометкаУдаления)
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	втОТбор.ПроектнаяЗадача,
	                               |	втОТбор.ПроектнаяЗадача
	                               |ИЗ
	                               |	втОТбор КАК втОТбор";

	Если ОтборПоСценарию Тогда
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		ТекстЗапросаПроверкаИерархии = СтрЗаменить(ТекстЗапросаПроверкаИерархии, "%ТипВерсии", УсловиеОтбора);
	Иначе
		ТекстЗапросаПроверкаИерархии = СтрЗаменить(ТекстЗапросаПроверкаИерархии, "%ТипВерсии", ТипВерсии);
	КонецЕсли;

	НаборДанныхПроверкаИерархии = ДобавитьНаборДанных(СКД, 
		"ПроверкаИерархии", 
		"ИсточникДанных1", 
		ТекстЗапросаПроверкаИерархии, 
		Ложь);
	
	ОграничениеИспользования = НовоеОграничениеИспользованияПоля();
	
	ДобавитьПолеКомпоновки(НаборДанныхПроверкаИерархии, 
		"ПроектнаяЗадачаПроверкаИерархии", 
		"ПроектнаяЗадачаПроверкаИерархии",
		,,,,,,,, 
		ОграничениеИспользования);
	ДобавитьПолеКомпоновки(НаборДанныхПроверкаИерархии, 
		"ЗадачаРодительПроверкаИерархии", 
		"ЗадачаРодительПроверкаИерархии",
		,,,,,,,, 
		ОграничениеИспользования);
	
	ДобавитьСвязьНаборовДанных(СКД, 
		"ПроверкаИерархии", 
		"ПроверкаИерархии", 
		"ПроектнаяЗадачаПроверкаИерархии", 
		"ЗадачаРодительПроверкаИерархии",
		Истина, 
		"ПроектныеЭтапы");
	
	ПоляОсновногоНабораДанных = СКД.НаборыДанных[ОсновнойНаборДанных].Поля;
	ПолеПроектнаяЗадача = ПоляОсновногоНабораДанных.Найти(ИмяПоляПЗДляИерархии);
	ПолеПроектнаяЗадача.НаборДанныхПроверкиИерархии 			= "ПроверкаИерархии";
	ПолеПроектнаяЗадача.ПараметрНабораДанныхПроверкиИерархии 	= "ПроектныеЭтапы";
	
КонецПроцедуры

Функция УсловиеОтбораВерсииПоВерсиямСценария(Знач ПсевдонимТаблицы = "") Экспорт
	
	ЗапросВыбораВерсииИзВТ = ТекстЗапросаВыбораВерсииИзВремТабВерсийПоСценарию();
	
	Если СтрДлина(ПсевдонимТаблицы) > 0 Тогда
		ШаблонУсловияОтбораПоВерсии = "%1.Версия В
		|%2";
	Иначе
		ШаблонУсловияОтбораПоВерсии = "Версия В
		|%2";
	КонецЕсли;
	
	ОтборПоВерсиямСценария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУсловияОтбораПоВерсии,
		ПсевдонимТаблицы,
		ЗапросВыбораВерсииИзВТ);
	
	Возврат ОтборПоВерсиямСценария;

КонецФункции

Функция ТекстЗапросаВыбораВерсииИзВремТабВерсийПоСценарию()
	
	ШаблонЗапросаВыбораВерсииИзВТ = 
	"			(ВЫБРАТЬ
	|				%1.Версия
	|			ИЗ
	|				%1 КАК %1)";
	ИмяВТ = ИмяВремТабВерсийПоСценарию();
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗапросаВыбораВерсииИзВТ, ИмяВТ);
	Возврат ТекстЗапроса;
    
КонецФункции

Функция ТекстЗапросаВремТабСВерсиямиПоСценарию()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСценарииВерсий.Версия КАК Версия,
	               |	упоСценарииВерсий.Версия.Проект КАК Проект
	               |ПОМЕСТИТЬ ИМЯ_ВРЕМЕННОЙ_ТАБЛИЦЫ
	               |ИЗ
	               |	РегистрСведений.упоСценарииВерсий КАК упоСценарииВерсий
	               |ГДЕ
	               |	упоСценарииВерсий.Сценарий = &ТипПлана
	               |{ГДЕ
	               |	упоСценарииВерсий.Версия.Проект.*}";

	ИмяВременнойТаблицы = ИмяВремТабВерсийПоСценарию();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИМЯ_ВРЕМЕННОЙ_ТАБЛИЦЫ", ИмяВременнойТаблицы); 
	МассивТекстов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекстЗапроса);
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	МассивТекстов.Добавить(РазделительПакетаЗапросов);
	
	Возврат СтрСоединить(МассивТекстов);
		
КонецФункции 

Функция ЭтоОтборПоСценарию(ЗначениеПараметраОтбора) Экспорт

	Если ТипЗнч(ЗначениеПараметраОтбора) = Тип("СправочникСсылка.упоСценарии") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

Функция ТекстЗапросаДляПолученияДанныхПоСценарию(ТекстЗапроса)
		
	ПолныйТекстЗапроса = Новый Массив;
	ВерсииВыбранногоСценария = ТекстЗапросаДляПолученияВерсийПоСценарию();
	УсловиеОтбораВерсииПоВерсиямСценария = УсловиеОтбораВерсииПоВерсиямСценария();
	ВерсииВыбранногоСценария = СтрЗаменить(ВерсииВыбранногоСценария, "%ВерсииСценария", УсловиеОтбораВерсииПоВерсиямСценария);
	ПолныйТекстЗапроса.Добавить(ВерсииВыбранногоСценария);
	ПолныйТекстЗапроса.Добавить(ОбщегоНазначения.РазделительПакетаЗапросов());
		
	ПолныйТекстЗапроса.Добавить(ТекстЗапроса);
	Возврат СтрСоединить(ПолныйТекстЗапроса);	

КонецФункции

Функция ТекстЗапросаДляПолученияВерсийПоСценарию()
		
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВерсииПроекта.Проект КАК Проект,
	               |	упоВерсииПроекта.Версия КАК Версия,
	               |	упоВерсииПроекта.Текущая КАК Текущая,
	               |	упоВерсииПроекта.ВерсияВключаетДанныеВыполнения КАК ВерсияВключаетДанныеВыполнения
	               |ПОМЕСТИТЬ ВерсииПроектов
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	(упоВерсииПроекта.Текущая
	               |			ИЛИ упоВерсииПроекта.%ВерсииСценария)
	               |{ГДЕ
	               |	упоВерсииПроекта.Проект.* КАК Проект}
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииПроектов.Проект КАК Проект,
	               |	ВерсииПроектов.Версия КАК Версия
	               |ПОМЕСТИТЬ ВерсииВыбранногоТипВерсии
	               |ИЗ
	               |	ВерсииПроектов КАК ВерсииПроектов
	               |ГДЕ
	               |	ВерсииПроектов.%ВерсииСценария
	               |	И ВерсииПроектов.ВерсияВключаетДанныеВыполнения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииПроектов.Проект КАК Проект,
	               |	ВерсииПроектов.Версия КАК Версия
	               |ПОМЕСТИТЬ ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе
	               |ИЗ
	               |	ВерсииПроектов КАК ВерсииПроектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВерсииВыбранногоТипВерсии КАК ВерсииВыбранногоТипВерсии
	               |		ПО ВерсииПроектов.Проект = ВерсииВыбранногоТипВерсии.Проект
	               |ГДЕ
	               |	ВерсииВыбранногоТипВерсии.Проект ЕСТЬ NULL
	               |	И ВерсииПроектов.Текущая
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВерсииВыбранногоТипВерсии.Проект КАК Проект,
	               |	ВерсииВыбранногоТипВерсии.Версия КАК Версия
	               |ПОМЕСТИТЬ ВерсииВыбранногоТипа
	               |ИЗ
	               |	ВерсииВыбранногоТипВерсии КАК ВерсииВыбранногоТипВерсии
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе.Проект,
	               |	ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе.Версия
	               |ИЗ
	               |	ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе КАК ТекущиеВерсииПроектовКоторыхНетВВыбранномТипе";
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ВставитьВТекстЗапросаВремТабСВерсиямиПоСценарию(ТекстЗапроса) Экспорт

	ТекстЗапросаВТВерсийПоСценарию = ТекстЗапросаВремТабСВерсиямиПоСценарию();
	МассивТекстов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекстЗапросаВТВерсийПоСценарию);
	МассивТекстов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(МассивТекстов);

КонецПроцедуры

Функция ИмяВремТабВерсийПоСценарию()

	// Имя временной таблицы.
	Возврат "_ВТ_ВерсииПоСценарию";

КонецФункции	

#КонецОбласти

Процедура ДобавитьУсловноеОформлениеДляВыбранныхПолей(Настройки, Знач Поля, ФорматПоля, 
	ШиринаКолонок = Неопределено,
	ФорматПоляВыделятьОтрицательные = Неопределено,
	ГоризонтальноеПоложение = Неопределено)
	
	ЭлементыУсловногоОформления = Настройки.УсловноеОформление.Элементы;
	ПараметрыВывода = Настройки.ПараметрыВывода.Элементы;
	
	ЭлементУсловногоОформления = ЭлементыУсловногоОформления.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	
	Если ЗначениеЗаполнено(ФорматПоля) Тогда
		Оформление = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Формат");
		Оформление.Значение = ФорматПоля;
		Оформление.Использование = Истина; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШиринаКолонок) Тогда
		Оформление = ЭлементУсловногоОформления.Оформление.Элементы.Найти("МинимальнаяШирина");
		Оформление.Значение = ШиринаКолонок;
		Оформление.Использование = Истина; 
		Оформление = ЭлементУсловногоОформления.Оформление.Элементы.Найти("МаксимальнаяШирина");
		Оформление.Значение = ШиринаКолонок;
		Оформление.Использование = Истина; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФорматПоляВыделятьОтрицательные) Тогда
		Оформление = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ВыделятьОтрицательные");
		Оформление.Значение = ФорматПоляВыделятьОтрицательные;
		Оформление.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоризонтальноеПоложение) Тогда
		Оформление = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ГоризонтальноеПоложение");
		Оформление.Значение = ГоризонтальноеПоложение;
		Оформление.Использование = Истина;
	КонецЕсли;
	
	Если Не ТипЗнч(Поля) = Тип("Массив") Тогда
		Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Поля);
	КонецЕсли;
	
	Для Каждого ИмяПоля Из Поля Цикл
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Использование = Истина;
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьОтборВНастройки(ЭлементыОтбора, ОтборНастройкиКомпоновки, ДополнительныеПараметры = Неопределено) Экспорт
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") 
					И ДополнительныеПараметры.Свойство("НеКопироватьПоказатели") Тогда
										
				ИмяПоля = Строка(ЭлементОтбора.ЛевоеЗначение);
				Если Лев(ИмяПоля, 1) = "_" Тогда
					Продолжить;
				КонецЕсли;	
					
			КонецЕсли;		
			
			НовыйЭлемент = ОтборНастройкиКомпоновки.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементОтбора);
			
		Иначе
			
			НовыйЭлемент  = ОтборНастройкиКомпоновки.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементОтбора);
			
			СкопироватьОтборВНастройки(ЭлементОтбора.Элементы, НовыйЭлемент.Элементы, ДополнительныеПараметры);
			
		КонецЕсли;		
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ЗаполнитьОтборПоОтборуКомпоновщика(Отбор, ОтборКомпоновщика, ПустоеЗначение) Экспорт 
    
    ЗаполнитьЗначенияСвойств(Отбор, ОтборКомпоновщика, "Использование, Представление");
    
    Если ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
        Отбор.ВидСравнения = ВидСравнения.Больше;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
        Отбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
        Отбор.ВидСравнения = ВидСравнения.ВИерархии;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
        Отбор.ВидСравнения = ВидСравнения.ВСписке;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
        Отбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
        Отбор.ВидСравнения = ВидСравнения.Меньше;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
        Отбор.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
        Отбор.ВидСравнения = ВидСравнения.НеВИерархии;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
        Отбор.ВидСравнения = ВидСравнения.НеВСписке;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
        Отбор.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
        Отбор.ВидСравнения = ВидСравнения.НеРавно;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
        Отбор.ВидСравнения = ВидСравнения.НеСодержит;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
        Отбор.ВидСравнения = ВидСравнения.Равно;
    ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
        Отбор.ВидСравнения = ВидСравнения.Содержит;		
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
        Отбор.ВидСравнения = ВидСравнения.НеРавно;
	    Отбор.Значение = ПустоеЗначение;
		Возврат;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
        Отбор.ВидСравнения = ВидСравнения.Равно;
	    Отбор.Значение = ПустоеЗначение;	
		Возврат;
    Иначе
       // Не нашли соответствие - не применяем отбор. 
        Отбор.Использование = Ложь;
        Возврат;
    КонецЕсли;
    
    Отбор.Значение = ОтборКомпоновщика.ПравоеЗначение;
    
КонецПроцедуры

Процедура УстановитьПользовательскийПараметр(НастройкиКомпоновки, 
											ИмяПараметра, 
											ЗначениеПараметра, 											
											ИдентификаторПН = Неопределено)
											
	Если ИдентификаторПН = Неопределено Тогда
		ИдентификаторПН = Новый УникальныйИдентификатор;
	КонецЕсли;	
											
	ПараметрПериод = НастройкиКомпоновки.ПараметрыДанных.Элементы.Добавить();
	ПараметрПериод.ИдентификаторПользовательскойНастройки 	= ИдентификаторПН;
	ПараметрПериод.Значение 								= ЗначениеПараметра;
	ПараметрПериод.Параметр 								= Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ПараметрПериод.Использование 							= Истина; 
	ПараметрПериод.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;	
	
КонецПроцедуры

Процедура УстановитьФиксациюВТабличномДокументе(ТабличныйДокумент, ПараметрыВывода)
	
	// Обход бага рендеринга диаграмм (платформа 8.3.17): 
	// если в табличном документе с диаграммой есть фиксация, 
	// то диаграмма не отрисовывается, пока не начнешь прокрутку документа.
	ВДокументеЕстьДиаграмма = ТабличныйДокументСодержитДиаграмму(ТабличныйДокумент);
	Если ВДокументеЕстьДиаграмма Тогда
		СнятьФиксациюВТабличномДокументе(ТабличныйДокумент);
		Возврат;
	КонецЕсли;
	
	ГоризонтальноеРасположениеОбщихИтогов = ПараметрыВывода.Найти("ВертикальноеРасположениеОбщихИтогов");
	
	Если ГоризонтальноеРасположениеОбщихИтогов.Использование
		И (ГоризонтальноеРасположениеОбщихИтогов.Значение = РасположениеИтоговКомпоновкиДанных.НачалоИКонец
			Или ГоризонтальноеРасположениеОбщихИтогов.Значение = РасположениеИтоговКомпоновкиДанных.Начало) Тогда
		
		ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.ФиксацияСверху + 1;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТабличныйДокументСодержитДиаграмму(ТабличныйДокумент)
	
	ВДокументеЕстьДиаграмма = Ложь;
	Для Каждого РисунокДокумента Из ТабличныйДокумент.Рисунки Цикл
		Если РисунокДокумента.ТипРисунка = ТипРисункаТабличногоДокумента.Диаграмма Тогда
			ВДокументеЕстьДиаграмма = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат ВДокументеЕстьДиаграмма;
	
КонецФункции

Процедура СнятьФиксациюВТабличномДокументе(ТабличныйДокумент)
	
	ТабличныйДокумент.ФиксацияСверху = 0;
	ТабличныйДокумент.ФиксацияСлева = 0;
	
КонецПроцедуры

#Область ДополнениеСКДПриИспользованииПолей

Процедура ДополнитьСКДПроцентыПЗ(СКД, ТипВерсии, ОсновнойНаборДанных, СтруктураНастроек, 
	ПроверятьИспользованиеПолей, КомпоновщикНастроек, ОтборПоСценарию = Ложь)
	
	Если ПроверятьИспользованиеПолей Тогда
		Если КомпоновщикНастроек = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		Если Не ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, "ПроцентГотовностиПроектнойЗадачи") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	// Добавим проценты готовности в основной набор.
	ОсновнойНабор = СКД.НаборыДанных.Найти(ОсновнойНаборДанных);
	ТекстЗапроса = ОсновнойНабор.Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	Оператор = ПакетЗапросов.Операторы[0];
	
	// Проценты.
	ИсточникПроцентыПЗ = Оператор.Источники.Добавить(
		"РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних", 
		"ПроцентыПЗ");
	ИсточникПроцентыПЗ.Источник.Параметры[0].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникПроцентыПЗ.Источник.Параметры[1].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1 = ПроцентыПЗ.ПроектнаяЗадача", 
		СтруктураНастроек.ИмяПоляПЗДляСвязиСОсновнымНабором);
	Соединение = Оператор.Источники[0].Соединения.Добавить("ПроцентыПЗ", УсловиеСоединения);
	Оператор.Источники[0].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
   	ВыбранноеПоле =  Оператор.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ПроцентыПЗ.ПроцентГотовности, 0)");
	ПакетЗапросов.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "ПроцентГотовностиПроектнойЗадачи";
	
	// Версии.
	ИсточникВерсияПроцентыПЗ = Оператор.Источники.Добавить(
		"РегистрСведений.упоВерсииПроекта", 
		"упоВерсииПроектаПроцентыПЗ");
	ИсточникВерсияПроцентыПЗ.Соединения.Очистить();
	ТекстУсловия = "ПроцентыПЗ.Версия = упоВерсииПроектаПроцентыПЗ.Версия И (упоВерсииПроектаПроцентыПЗ.%1)";

	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, УсловиеОтбора);
	Иначе	
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, ТипВерсии);	
	КонецЕсли;
	
	ДобавитьВнутреннееСоединениеВИсточник(ИсточникПроцентыПЗ, "упоВерсииПроектаПроцентыПЗ", УсловиеСоединения);
		
	Если Не ОсновнойНабор.АвтоЗаполнениеДоступныхПолей Тогда
		ПакетЗапросов.ПоляВыбораКомпоновкиДанных.Добавить("ПроцентГотовностиПроектнойЗадачи");	
	КонецЕсли;
	
	ТекстЗапросаПроценты = СхемаЗапроса.ПолучитьТекстЗапроса();

	ОсновнойНабор.Запрос = ТекстЗапросаПроценты;
	
	Оформление = Новый Структура("ГоризонтальноеПоложение, Формат", ГоризонтальноеПоложение.Лево, "ЧДЦ=2;");
	
	ДобавитьПолеКомпоновки(ОсновнойНабор, "ПроцентГотовностиПроектнойЗадачи", 
												"ПроцентГотовностиПроектнойЗадачи", , , , , Оформление);
	
	// На уровне группировки "Проект" не рассчитываем процент готовности, т.к. не работает отбор по ПроектнойЗадаче.
	Группировки = Новый Массив;
	Группировки.Добавить("ПроектнаяЗадача");
	Группировки.Добавить("ПроектнаяЗадача Иерархия");
	ДобавитьПолеРесурса(СКД, "ПроцентГотовностиПроектнойЗадачи", "ПроцентГотовностиПроектнойЗадачи", Группировки);
	
	Группировки = Новый Массив;
	Группировки.Добавить("ОбщийИтог");
	// Для использования польз.полей без непосредственного вывода ПроцентаГотовностиПроектнойЗадачи подошел 
	// только такой расчет. ДобавитьПолеРесурса(СКД, "0", "ПроцентГотовностиПроектнойЗадачи", Группировки) - не работает.
	ДобавитьПолеРесурса(СКД, "ПроцентГотовностиПроектнойЗадачи*0", "ПроцентГотовностиПроектнойЗадачи", Группировки);
	
	// Добавим проценты готовности в иерархию.
	НаборИерархия = СКД.НаборыДанных.Найти("Иерархия");
	ТекстЗапроса = НаборИерархия.Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	// Поместим данные иерархии во временную таблицу, если не помещены.
	ПакетИерархия = СхемаЗапроса.ПакетЗапросов[1];
	ИмяИсточника = "ВТ_Иерархия";
	Если ПакетИерархия.ТаблицаДляПомещения = "" Тогда
		ПакетИерархия.ТаблицаДляПомещения = ИмяИсточника;
		ПакетЗапросовИерархияИтоговый = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		ОператорИерархияИтоговый = ПакетЗапросовИерархияИтоговый.Операторы[0];
		ОператорИерархияИтоговый.Источники.Добавить(ИмяИсточника, ИмяИсточника);
		Для Каждого Колонка Из ПакетИерархия.Колонки Цикл
			ИмяПоля = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку("%1.%2", 
						ИмяИсточника, 
						Колонка.Псевдоним);
			ВыбранноеПоле = ОператорИерархияИтоговый.ВыбираемыеПоля.Добавить(ИмяПоля);
		КонецЦикла;	
	Иначе
		ПакетЗапросовИерархияИтоговый = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	КонецЕсли;
	Оператор = ПакетЗапросовИерархияИтоговый.Операторы[0];
	
	// Проценты ПЗ.
	ИсточникПроцентыПЗИерархия = Оператор.Источники.Добавить(
		"РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних", 
		"ПроцентыПЗ");
	ИсточникПроцентыПЗИерархия.Источник.Параметры[0].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникПроцентыПЗИерархия.Источник.Параметры[1].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.СсылкаНаПроектнуюЗадачу = ПроцентыПЗ.ПроектнаяЗадача", 
		ИмяИсточника);
	Соединение = Оператор.Источники[0].Соединения.Добавить("ПроцентыПЗ", УсловиеСоединения);
	Оператор.Источники[0].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
	
	// Версии ПЗ.
	ИсточникВерсияПроцентыПЗ = Оператор.Источники.Добавить("РегистрСведений.упоВерсииПроекта", 
															"упоВерсииПроектаПроцентыПЗ");
	ТекстУсловия = "ПроцентыПЗ.Версия = упоВерсииПроектаПроцентыПЗ.Версия И (упоВерсииПроектаПроцентыПЗ.%1)";

	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, УсловиеОтбора);
	Иначе	
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, ТипВерсии);
	КонецЕсли;
	
	ДобавитьВнутреннееСоединениеВИсточник(ИсточникПроцентыПЗИерархия, "упоВерсииПроектаПроцентыПЗ", УсловиеСоединения); 
		
	// Проценты проекта.
	ИсточникПроцентыПроектИерархия = Оператор.Источники.Добавить(
		"РегистрСведений.упоПроцентыГотовностиПроектов.СрезПоследних", 
		"ПроцентыПроект");
	ИсточникПроцентыПроектИерархия.Источник.Параметры[0].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.ПроектнаяЗадача = ПроцентыПроект.Проект", 
		ИмяИсточника);
	Соединение = Оператор.Источники[0].Соединения.Добавить("ПроцентыПроект", УсловиеСоединения);
	Оператор.Источники[0].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
	
	// Версии проекта.
	ИсточникВерсияПроцентыПроект = Оператор.Источники.Добавить("РегистрСведений.упоВерсииПроекта", 
																"упоВерсииПроектаПроцентыПроект");
	ТекстУсловия = "ПроцентыПроект.Версия = упоВерсииПроектаПроцентыПроект.Версия И (упоВерсииПроектаПроцентыПроект.%1)";

	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, УсловиеОтбора);
	Иначе	
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, ТипВерсии);	
	КонецЕсли;
	
	ДобавитьВнутреннееСоединениеВИсточник(ИсточникПроцентыПроектИерархия, "упоВерсииПроектаПроцентыПроект", УсловиеСоединения); 

	ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку("ВЫБОР
							|	КОГДА %1.ЭтоПроектнаяЗадача
							|		ТОГДА ЕСТЬNULL(ПроцентыПЗ.ПроцентГотовности, 0)
							|	ИНАЧЕ ЕСТЬNULL(ПроцентыПроект.ПроцентГотовности, 0)
							|КОНЕЦ",
							ИмяИсточника);
	ВыбранноеПоле = Оператор.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
	ПакетЗапросовИерархияИтоговый.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = 
		"ПроцентГотовностиПроектнойЗадачи";
	
	Оператор.ВыраженияОтбораКомпоновкиДанных.Очистить();
	Для каждого ВыбираемоеПоле Из Оператор.ВыбираемыеПоля Цикл
		Оператор.ВыраженияОтбораКомпоновкиДанных.Добавить(ВыбираемоеПоле);
	КонецЦикла;
	
	ПакетЗапросовИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Очистить();
	Для каждого Колонка Из ПакетЗапросовИерархияИтоговый.Колонки Цикл
		ПакетЗапросовИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(Колонка);
	КонецЦикла;	
	
	ДобавитьПолеКомпоновки(НаборИерархия, 
							"ПроцентГотовностиПроектнойЗадачи", 
							"ПроцентГотовностиПроектнойЗадачи", 
							,
							,
							,
							,
							Оформление);
	
	ТекстЗапросаПроцентыИерархия = СхемаЗапроса.ПолучитьТекстЗапроса();
	НаборИерархия.Запрос = ТекстЗапросаПроцентыИерархия;
	
КонецПроцедуры

Процедура ДополнитьСКДСрокиПЗ(СКД, ТипВерсии, ОсновнойНаборДанных, СтруктураНастроек, 
	ПроверятьИспользованиеПолей, КомпоновщикНастроек, ОтборПоСценарию = Ложь)
	
	Если ПроверятьИспользованиеПолей Тогда
		Если КомпоновщикНастроек = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		Если Не ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, "ДатаНачала")
			И Не ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, "ДатаЗавершения")
			И Не ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, "ДатаНачалаПрогноз")
			И Не ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, "ДатаЗавершенияПрогноз") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ОсновнойНабор = СКД.НаборыДанных.Найти(ОсновнойНаборДанных);
	ТекстЗапроса = ОсновнойНабор.Запрос;
	
	// Добавим сроки в основной набор.
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	Оператор = ПакетЗапросов.Операторы[0];
	
	// Сроки.
	ИсточникСрокиПЗ = Оператор.Источники.Добавить(
		"РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних", 
		"СрокиПЗ");
	ИсточникСрокиПЗ.Источник.Параметры[0].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникСрокиПЗ.Источник.Параметры[1].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1 = СрокиПЗ.ПроектнаяЗадача", 
		СтруктураНастроек.ИмяПоляПЗДляСвязиСОсновнымНабором);
	Соединение = Оператор.Источники[0].Соединения.Добавить("СрокиПЗ", УсловиеСоединения);
	ВыбранноеПоле =  Оператор.ВыбираемыеПоля.Добавить("СрокиПЗ.ДатаНачалаПлан");
	ПакетЗапросов.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "ДатаНачала";
	ВыбранноеПоле =  Оператор.ВыбираемыеПоля.Добавить("СрокиПЗ.ДатаЗавершенияПлан");
	ПакетЗапросов.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "ДатаЗавершения";
	
	// Версии.
	ИсточникВерсияСрокиПЗ = Оператор.Источники.Добавить(
		"РегистрСведений.упоВерсииПроекта", 
		"упоВерсииПроектаСрокиПЗ");
	ИсточникВерсияСрокиПЗ.Соединения.Очистить();
	ТекстУсловия = "СрокиПЗ.Версия = упоВерсииПроектаСрокиПЗ.Версия И (упоВерсииПроектаСрокиПЗ.%1)";
	
	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, УсловиеОтбора);
	Иначе	
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, ТипВерсии);	
	КонецЕсли;
	
	ДобавитьВнутреннееСоединениеВИсточник(ИсточникСрокиПЗ, "упоВерсииПроектаСрокиПЗ", УсловиеСоединения);

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		
		// Прогнозные сроки.
		ИсточникПрогнозныеСрокиПЗ = Оператор.Источники.Добавить(
			"РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних", 
			"ПрогнозныеСрокиПЗ");
		ИсточникПрогнозныеСрокиПЗ.Источник.Параметры[0].Выражение = 
			Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
		ИсточникПрогнозныеСрокиПЗ.Источник.Параметры[1].Выражение = 
			Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
		// Соединим левым соединением с таблицей СрокиПЗ, т.к. плановые сроки есть всегда.
		УсловиеСоединения = "СрокиПЗ.ПроектнаяЗадача = ПрогнозныеСрокиПЗ.ПроектнаяЗадача
		|  И СрокиПЗ.Версия = ПрогнозныеСрокиПЗ.Версия";
		Соединение = ИсточникСрокиПЗ.Соединения.Добавить("ПрогнозныеСрокиПЗ", УсловиеСоединения);
		ВыбранноеПоле =  Оператор.ВыбираемыеПоля.Добавить("ПрогнозныеСрокиПЗ.ДатаНачалаПрогноз");
		ПакетЗапросов.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "ДатаНачалаПрогноз";
		ВыбранноеПоле =  Оператор.ВыбираемыеПоля.Добавить("ПрогнозныеСрокиПЗ.ДатаЗавершенияПрогноз");
		ПакетЗапросов.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "ДатаЗавершенияПрогноз"; 
		
	КонецЕсли;
	
	Если Не ОсновнойНабор.АвтоЗаполнениеДоступныхПолей Тогда
		ПакетЗапросов.ПоляВыбораКомпоновкиДанных.Добавить("ДатаНачала");
		ПакетЗапросов.ПоляВыбораКомпоновкиДанных.Добавить("ДатаЗавершения");  
		
		Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
			ПакетЗапросов.ПоляВыбораКомпоновкиДанных.Добавить("ДатаНачалаПрогноз");
			ПакетЗапросов.ПоляВыбораКомпоновкиДанных.Добавить("ДатаЗавершенияПрогноз");
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстЗапросаСроки = СхемаЗапроса.ПолучитьТекстЗапроса();

	ОсновнойНабор.Запрос = ТекстЗапросаСроки;
	
	Оформление = Новый Структура("ГоризонтальноеПоложение, Формат", ГоризонтальноеПоложение.Лево, ФорматПериодаДень());
	
	ДобавитьПолеКомпоновки(ОсновнойНабор, 
							"ДатаНачала", 
							"ДатаНачала", 
							, 
							, 
							, 
							, 
							Оформление);
							
	ДобавитьПолеКомпоновки(ОсновнойНабор, 
							"ДатаЗавершения", 
							"ДатаЗавершения",
							, 
							, 
							, 
							, 
							Оформление);
							
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
							
		ДобавитьПолеКомпоновки(ОсновнойНабор, 
								"ДатаНачалаПрогноз", 
								"ДатаНачалаПрогноз", 
								, 
								, 
								, 
								, 
								Оформление,
								НСтр("ru = 'Дата начала, прогноз'"));
								
		ДобавитьПолеКомпоновки(ОсновнойНабор, 
								"ДатаЗавершенияПрогноз", 
								"ДатаЗавершенияПрогноз",
								, 
								, 
								, 
								, 
								Оформление,
								НСтр("ru = 'Дата завершения, прогноз'"));   
	КонецЕсли;							
	
	Группировки = Новый Массив;
	Группировки.Добавить("ПроектнаяЗадача");
	Группировки.Добавить("ПроектнаяЗадача Иерархия");
	ДобавитьПолеРесурса(СКД, "ДатаНачала", "ДатаНачала", Группировки);
	ДобавитьПолеРесурса(СКД, "ДатаЗавершения", "ДатаЗавершения", Группировки); 
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		ДобавитьПолеРесурса(СКД, "ДатаНачалаПрогноз", "ДатаНачалаПрогноз", Группировки);
		ДобавитьПолеРесурса(СКД, "ДатаЗавершенияПрогноз", "ДатаЗавершенияПрогноз", Группировки);
	КонецЕсли;
	
	// Отключим вывод дат в общих итогах.
	Группировки = Новый Массив;
	Группировки.Добавить("ОбщийИтог");
	ДобавитьПолеРесурса(СКД, "0", "ДатаНачала", Группировки);
	ДобавитьПолеРесурса(СКД, "0", "ДатаЗавершения", Группировки);  
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		ДобавитьПолеРесурса(СКД, "0", "ДатаНачалаПрогноз", Группировки);
		ДобавитьПолеРесурса(СКД, "0", "ДатаЗавершенияПрогноз", Группировки);
	КонецЕсли;
		
	// Добавим сроки в иерархию.
	НаборИерархия = СКД.НаборыДанных.Найти("Иерархия");
	ТекстЗапроса = НаборИерархия.Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	// Поместим данные иерархии во временную таблицу, если не помещены.
	ПакетИерархия = СхемаЗапроса.ПакетЗапросов[1];
	ИмяИсточника = "ВТ_Иерархия";
	Если ПакетИерархия.ТаблицаДляПомещения = "" Тогда
		ПакетИерархия.ТаблицаДляПомещения = ИмяИсточника;
		ПакетЗапросовИерархияИтоговый = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		ОператорИерархияИтоговый = ПакетЗапросовИерархияИтоговый.Операторы[0];
		ОператорИерархияИтоговый.Источники.Добавить(ИмяИсточника, ИмяИсточника);
		Для Каждого Колонка Из ПакетИерархия.Колонки Цикл
			ИмяПоля = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку("%1.%2", 
						ИмяИсточника, 
						Колонка.Псевдоним);
			ВыбранноеПоле = ОператорИерархияИтоговый.ВыбираемыеПоля.Добавить(ИмяПоля);
		КонецЦикла;	
	Иначе
		ПакетЗапросовИерархияИтоговый = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	КонецЕсли;
	
	// Сроки по проекту рассчитываем в отдельной временной таблице.
	ПакетСрокиПроекта = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	СхемаЗапроса.ПакетЗапросов.Сдвинуть(ПакетСрокиПроекта, -1);
	ТекстЗапросаСрокиПроекта = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                               |    ВерсииПроекта.Проект КАК СсылкаНаПроект,
                               |    МИНИМУМ(ПлановыеСроки.ДатаНачалаПлан) КАК ДатаНачала,
                               |    МАКСИМУМ(ПлановыеСроки.ДатаЗавершенияПлан) КАК ДатаЗавершения
                               |ИЗ
                               |    РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК ПлановыеСроки
                               |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК СвойстваПроектныхЗадач
                               |            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
                               |            ПО СвойстваПроектныхЗадач.Версия = ВерсииПроекта.Версия
                               |                И (ВерсииПроекта.%1)
                               |        ПО ПлановыеСроки.Версия = СвойстваПроектныхЗадач.Версия
                               |            И ПлановыеСроки.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
                               |            И (НЕ СвойстваПроектныхЗадач.ЗадачаОтменена)
                               |{ГДЕ
                               |    ВерсииПроекта.Проект.* КАК СсылкаНаПроект}
                               |
                               |СГРУППИРОВАТЬ ПО
                               |    ВерсииПроекта.Проект";

	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		ТекстЗапросаСрокиПроекта = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапросаСрокиПроекта, УсловиеОтбора);
	Иначе	
		ТекстЗапросаСрокиПроекта = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапросаСрокиПроекта, ТипВерсии);	
	КонецЕсли;

	ПакетСрокиПроекта.УстановитьТекстЗапроса(ТекстЗапросаСрокиПроекта);
	ПакетСрокиПроекта.ТаблицаДляПомещения = "ВТ_СрокиПроекта";
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
	
		ПакетПрогнозныеСрокиПроекта = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		СхемаЗапроса.ПакетЗапросов.Сдвинуть(ПакетПрогнозныеСрокиПроекта, -1);
		ТекстЗапросаПрогнозныеСрокиПроекта = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                               |    ВерсииПроекта.Проект КАК СсылкаНаПроект,
	                               |    МИНИМУМ(ПрогнозныеСроки.ДатаНачалаПрогноз) КАК ДатаНачалаПрогноз,
	                               |    МАКСИМУМ(ПрогнозныеСроки.ДатаЗавершенияПрогноз) КАК ДатаЗавершенияПрогноз
	                               |ИЗ
	                               |    РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних КАК ПрогнозныеСроки
	                               |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК СвойстваПроектныхЗадач
	                               |            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
	                               |            ПО СвойстваПроектныхЗадач.Версия = ВерсииПроекта.Версия
	                               |                И (ВерсииПроекта.%1)
	                               |        ПО ПрогнозныеСроки.Версия = СвойстваПроектныхЗадач.Версия
	                               |            И ПрогнозныеСроки.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
	                               |            И (НЕ СвойстваПроектныхЗадач.ЗадачаОтменена)
	                               |ГДЕ
	                               |    (ПрогнозныеСроки.ДатаНачалаПрогноз <> ДАТАВРЕМЯ(1, 1, 1)
	                               |            ИЛИ ПрогнозныеСроки.ДатаЗавершенияПрогноз <> ДАТАВРЕМЯ(1, 1, 1))
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |    ВерсииПроекта.Проект";

		Если ОтборПоСценарию Тогда 
			УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
			ТекстЗапросаПрогнозныеСрокиПроекта = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстЗапросаПрогнозныеСрокиПроекта, УсловиеОтбора);
		Иначе
			ТекстЗапросаПрогнозныеСрокиПроекта =
				упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапросаПрогнозныеСрокиПроекта, ТипВерсии);	
		КонецЕсли;

		ПакетПрогнозныеСрокиПроекта.УстановитьТекстЗапроса(ТекстЗапросаПрогнозныеСрокиПроекта);
		ПакетПрогнозныеСрокиПроекта.ТаблицаДляПомещения = "ВТ_ПрогнозныеСрокиПроекта";  
		
	КонецЕсли;
	
	// Сроки ПЗ.
	Оператор = ПакетЗапросовИерархияИтоговый.Операторы[0];
	
	ИсточникСрокиПЗИерархия = Оператор.Источники.Добавить(
		"РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних", 
		"СрокиПЗ");
	ИсточникСрокиПЗИерархия.Источник.Параметры[0].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникСрокиПЗИерархия.Источник.Параметры[1].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.СсылкаНаПроектнуюЗадачу = СрокиПЗ.ПроектнаяЗадача", 
		ИмяИсточника);
	Соединение = Оператор.Источники[0].Соединения.Добавить("СрокиПЗ", УсловиеСоединения);
	
	// Версии ПЗ.
	ИсточникВерсияСрокиПЗ = Оператор.Источники.Добавить("РегистрСведений.упоВерсииПроекта", 
															"упоВерсииПроектаСрокиПЗ");
	ТекстУсловия = "СрокиПЗ.Версия = упоВерсииПроектаСрокиПЗ.Версия И (упоВерсииПроектаСрокиПЗ.%1)";
	
	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, УсловиеОтбора);
	Иначе	
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, ТипВерсии);
	КонецЕсли;
	
	ДобавитьВнутреннееСоединениеВИсточник(ИсточникСрокиПЗИерархия, "упоВерсииПроектаСрокиПЗ", УсловиеСоединения); 
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		
		// Прогнозные сроки ПЗ.
		ИсточникПрогнозныеСрокиПЗИерархия = Оператор.Источники.Добавить(
			"РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних", 
			"ПрогнозныеСрокиПЗ");
		ИсточникПрогнозныеСрокиПЗИерархия.Источник.Параметры[0].Выражение = 
			Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
		ИсточникПрогнозныеСрокиПЗИерархия.Источник.Параметры[1].Выражение = 
			Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
		// Соединим левым соединением с таблицей СрокиПЗ, т.к. плановые сроки есть всегда.
		УсловиеСоединения = "СрокиПЗ.ПроектнаяЗадача = ПрогнозныеСрокиПЗ.ПроектнаяЗадача
		|  И СрокиПЗ.Версия = ПрогнозныеСрокиПЗ.Версия";
		Соединение = ИсточникСрокиПЗИерархия.Соединения.Добавить("ПрогнозныеСрокиПЗ", УсловиеСоединения); 
		
	КонецЕсли;
	
	// Сроки проекта.
	ИсточникСрокиПроектИерархия = Оператор.Источники.Добавить(
		"ВТ_СрокиПроекта", 
		"ВТ_СрокиПроекта");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.ПроектнаяЗадача = ВТ_СрокиПроекта.СсылкаНаПроект", 
		ИмяИсточника);
	Соединение = Оператор.Источники[0].Соединения.Добавить("ВТ_СрокиПроекта", УсловиеСоединения);
	
	ШаблонВыбранноеПоле = "ВЫБОР
							|	КОГДА %1.ЭтоПроектнаяЗадача
							|		ТОГДА ЕСТЬNULL(СрокиПЗ.ДатаНачалаПлан, 0)
							|	ИНАЧЕ ЕСТЬNULL(ВТ_СрокиПроекта.ДатаНачала, 0)
							|КОНЕЦ";
	ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
							ШаблонВыбранноеПоле,
							ИмяИсточника,
							"ДатаНачала");
	ВыбранноеПоле = Оператор.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
	ПакетЗапросовИерархияИтоговый.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = 
		"ДатаНачала";
	
	ШаблонВыбранноеПоле = "ВЫБОР
							|	КОГДА %1.ЭтоПроектнаяЗадача
							|		ТОГДА ЕСТЬNULL(СрокиПЗ.ДатаЗавершенияПлан, 0)
							|	ИНАЧЕ ЕСТЬNULL(ВТ_СрокиПроекта.ДатаЗавершения, 0)
							|КОНЕЦ";
	ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
							ШаблонВыбранноеПоле,
							ИмяИсточника,
							"ДатаЗавершения");
	ВыбранноеПоле = Оператор.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
	ПакетЗапросовИерархияИтоговый.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = 
		"ДатаЗавершения";

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		
		// Прогнозные сроки проекта.
		ИсточникСрокиПроектИерархия = Оператор.Источники.Добавить(
			"ВТ_ПрогнозныеСрокиПроекта", 
			"ВТ_ПрогнозныеСрокиПроекта");
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1.ПроектнаяЗадача = ВТ_ПрогнозныеСрокиПроекта.СсылкаНаПроект", 
			ИмяИсточника);
		Соединение = Оператор.Источники[0].Соединения.Добавить("ВТ_ПрогнозныеСрокиПроекта", УсловиеСоединения);
		
		ШаблонВыбранноеПоле = "ВЫБОР
								|	КОГДА %1.ЭтоПроектнаяЗадача
								|		ТОГДА ЕСТЬNULL(ПрогнозныеСрокиПЗ.ДатаНачалаПрогноз, 0)
								|	ИНАЧЕ ЕСТЬNULL(ВТ_ПрогнозныеСрокиПроекта.ДатаНачалаПрогноз, 0)
								|КОНЕЦ";
		ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
								ШаблонВыбранноеПоле,
								ИмяИсточника,
								"ДатаНачалаПрогноз");
		ВыбранноеПоле = Оператор.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
		ПакетЗапросовИерархияИтоговый.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = 
			"ДатаНачалаПрогноз";
		
		ШаблонВыбранноеПоле = "ВЫБОР
								|	КОГДА %1.ЭтоПроектнаяЗадача
								|		ТОГДА ЕСТЬNULL(ПрогнозныеСрокиПЗ.ДатаЗавершенияПрогноз, 0)
								|	ИНАЧЕ ЕСТЬNULL(ВТ_ПрогнозныеСрокиПроекта.ДатаЗавершенияПрогноз, 0)
								|КОНЕЦ";
		ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
								ШаблонВыбранноеПоле,
								ИмяИсточника,
								"ДатаЗавершенияПрогноз");
		ВыбранноеПоле = Оператор.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
		ПакетЗапросовИерархияИтоговый.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = 
			"ДатаЗавершенияПрогноз";   
		
	КонецЕсли;
	
	Оператор.ВыраженияОтбораКомпоновкиДанных.Очистить();
	Для каждого ВыбираемоеПоле Из Оператор.ВыбираемыеПоля Цикл
		Оператор.ВыраженияОтбораКомпоновкиДанных.Добавить(ВыбираемоеПоле);
	КонецЦикла;
	
	ПакетЗапросовИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Очистить();
	Для каждого Колонка Из ПакетЗапросовИерархияИтоговый.Колонки Цикл
		ПакетЗапросовИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(Колонка);
	КонецЦикла;	
	
	ДобавитьПолеКомпоновки(НаборИерархия, 
							"ДатаНачала", 
							"ДатаНачала", 
							,
							,
							,
							,
							Оформление);
							
	ДобавитьПолеКомпоновки(НаборИерархия, 
							"ДатаЗавершения", 
							"ДатаЗавершения", 
							,
							,
							,
							,
							Оформление);
							
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
								
		ДобавитьПолеКомпоновки(НаборИерархия, 
								"ДатаНачалаПрогноз", 
								"ДатаНачалаПрогноз", 
								,
								,
								,
								,
								Оформление,
								НСтр("ru = 'Дата начала, прогноз'"));
								
		ДобавитьПолеКомпоновки(НаборИерархия, 
								"ДатаЗавершенияПрогноз", 
								"ДатаЗавершенияПрогноз", 
								,
								,
								,
								,
								Оформление,
								НСтр("ru = 'Дата завершения, прогноз'"));     
								
	КонецЕсли;
	
	ТекстЗапросаСрокиИерархия = СхемаЗапроса.ПолучитьТекстЗапроса();
	НаборИерархия.Запрос = ТекстЗапросаСрокиИерархия;
	
КонецПроцедуры

Процедура ДополнитьСКДСрокиПоВерсии(СКД, СрокиПоВерсиям, ИмяОсновногоНабораДанных, СтруктураНастроек,
		ПроверятьИспользованиеПолей, КомпоновщикНастроек)
	
	ОсновнойНабор = СКД.НаборыДанных.Найти(ИмяОсновногоНабораДанных);
	НаборИерархия = СКД.НаборыДанных.Найти("Иерархия");
	
	ИспользуютсяПрогнозныеСроки = упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков();
	
	Для НомерВерсии = 1 По СрокиПоВерсиям Цикл
		НомерВерсииСтрокой = Строка(НомерВерсии);
		ИмяПоляДатаНачалаПоВерсии = "ДатаНачалаПоВерсии" + НомерВерсииСтрокой;
		ИмяПоляДатаЗавершенияПоВерсии = "ДатаЗавершенияПоВерсии" + НомерВерсииСтрокой;
		ИмяПоляДатаНачалаПрогнозПоВерсии = "ДатаНачалаПрогнозПоВерсии" + НомерВерсииСтрокой;
		ИмяПоляДатаЗавершенияПрогнозПоВерсии = "ДатаЗавершенияПрогнозПоВерсии" + НомерВерсииСтрокой;
		
		Если ПроверятьИспользованиеПолей Тогда
			Если КомпоновщикНастроек = Неопределено Тогда
				Возврат;
			КонецЕсли;
			Если НЕ ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, ИмяПоляДатаНачалаПоВерсии)
				И НЕ ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, ИмяПоляДатаЗавершенияПоВерсии)
				И НЕ ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, ИмяПоляДатаНачалаПрогнозПоВерсии)
				И НЕ ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, ИмяПоляДатаЗавершенияПрогнозПоВерсии) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Добавим сроки по версии в основной набор данных.
		ДобавитьСрокиПоВерсииВОсновнойНаборДанных(ОсновнойНабор, НомерВерсииСтрокой, СтруктураНастроек, ИспользуютсяПрогнозныеСроки);
		
		// Добавим сроки по версии в набор данных "Иерархия".
		ДобавитьСрокиПоВерсииВНаборДанныхИерархия(НаборИерархия, НомерВерсииСтрокой, СтруктураНастроек, ИспользуютсяПрогнозныеСроки);
		
		Группировки = Новый Массив;
		Группировки.Добавить("ПроектнаяЗадача");
		Группировки.Добавить("ПроектнаяЗадача Иерархия");
		ДобавитьПолеРесурса(СКД, ИмяПоляДатаНачалаПоВерсии, ИмяПоляДатаНачалаПоВерсии, Группировки);
		ДобавитьПолеРесурса(СКД, ИмяПоляДатаЗавершенияПоВерсии, ИмяПоляДатаЗавершенияПоВерсии, Группировки);
		Если ИспользуютсяПрогнозныеСроки Тогда
			ДобавитьПолеРесурса(СКД, ИмяПоляДатаНачалаПрогнозПоВерсии, ИмяПоляДатаНачалаПрогнозПоВерсии, Группировки);
			ДобавитьПолеРесурса(СКД, ИмяПоляДатаЗавершенияПрогнозПоВерсии, ИмяПоляДатаЗавершенияПрогнозПоВерсии, Группировки);
		КонецЕсли;
		
		// Отключим вывод дат в общих итогах.
		Группировки = Новый Массив;
		Группировки.Добавить("ОбщийИтог");
		ДобавитьПолеРесурса(СКД, "0", ИмяПоляДатаНачалаПоВерсии, Группировки);
		ДобавитьПолеРесурса(СКД, "0", ИмяПоляДатаЗавершенияПоВерсии, Группировки);
		Если ИспользуютсяПрогнозныеСроки Тогда
			ДобавитьПолеРесурса(СКД, "0", ИмяПоляДатаНачалаПрогнозПоВерсии, Группировки);
			ДобавитьПолеРесурса(СКД, "0", ИмяПоляДатаЗавершенияПрогнозПоВерсии, Группировки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСрокиПоВерсииВОсновнойНаборДанных(ОсновнойНабор, НомерВерсииСтрокой, СтруктураНастроек, ИспользуютсяПрогнозныеСроки)
	
	// Получим шаблон запроса версий.
	ТекстЗапросаВерсии = ТекстЗапросаВерсииПоНомеру();
	ТекстЗапросаВерсии = СтрЗаменить(ТекстЗапросаВерсии, "_Номер", НомерВерсииСтрокой);
	
	ТекстЗапросаОсновногоНабораДанных = ОсновнойНабор.Запрос;
	СхемаЗапросаОсновнойНабор = Новый СхемаЗапроса;
	СхемаЗапросаОсновнойНабор.УстановитьТекстЗапроса(ТекстЗапросаОсновногоНабораДанных);
	
	ПакетЗапросаОсновногоНабораИтоговый =
		СхемаЗапросаОсновнойНабор.ПакетЗапросов[СхемаЗапросаОсновнойНабор.ПакетЗапросов.Количество() - 1];
	ОператорОсновногоПакетаЗапроса = ПакетЗапросаОсновногоНабораИтоговый.Операторы[0];
	
	ИмяТаблицыСрокиПоВерсии = "СрокиПЗПоВерсии" + НомерВерсииСтрокой;
	ИмяТаблицыПрогнозныеСрокиПоВерсии = "ПрогнозныеСрокиПЗПоВерсии" + НомерВерсииСтрокой;
	ИмяВременнойТаблицыВерсии = "ВТ_Версии" + НомерВерсииСтрокой;
	
	ИмяТаблицыСрокиПоВерсии = "СрокиПЗПоВерсии" + НомерВерсииСтрокой;
	ИмяТаблицыПрогнозныеСрокиПоВерсии = "ПрогнозныеСрокиПЗПоВерсии" + НомерВерсииСтрокой;
	ИмяВременнойТаблицыВерсии = "ВТ_Версии" + НомерВерсииСтрокой;
	
	ИмяПоляДатаНачалаПоВерсии = "ДатаНачалаПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыНачалаПоВерсии = СтрШаблон(НСтр("ru = 'Дата начала по версии %1'"), НомерВерсииСтрокой);
	ИмяПоляДатаЗавершенияПоВерсии = "ДатаЗавершенияПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыЗавершенияПоВерсии = СтрШаблон(НСтр("ru = 'Дата завершения по версии %1'"), НомерВерсииСтрокой);
	
	ИмяПоляДатаНачалаПрогнозПоВерсии = "ДатаНачалаПрогнозПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыНачалаПрогнозПоВерсии = СтрШаблон(НСтр("ru = 'Дата начала, прогноз по версии %1'"), НомерВерсииСтрокой);
	ИмяПоляДатаЗавершенияПрогнозПоВерсии = "ДатаЗавершенияПрогнозПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыЗавершенияПрогнозПоВерсии = СтрШаблон(НСтр("ru = 'Дата завершения, прогноз по версии %1'"), НомерВерсииСтрокой);
	
	ВременнаяТаблицаВерсииПоНомеру = СхемаЗапросаОсновнойНабор.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	ВременнаяТаблицаВерсииПоНомеру.УстановитьТекстЗапроса(ТекстЗапросаВерсии);
	ВременнаяТаблицаВерсииПоНомеру.ТаблицаДляПомещения = ИмяВременнойТаблицыВерсии;
	СхемаЗапросаОсновнойНабор.ПакетЗапросов.Сдвинуть(ВременнаяТаблицаВерсииПоНомеру, -1);
	
	ИсточникСрокиПЗПоВерсии = ОператорОсновногоПакетаЗапроса.Источники.Добавить(
			"РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних",
			ИмяТаблицыСрокиПоВерсии);
	ИсточникСрокиПЗПоВерсии.Источник.Параметры[0].Выражение =
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникСрокиПЗПоВерсии.Источник.Параметры[1].Выражение =
		Новый ВыражениеСхемыЗапроса(СтрШаблон("Версия В
				|     (ВЫБРАТЬ
				|     %1.Версия КАК Версия
				|     ИЗ
				|     %1 КАК %1) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}", ИмяВременнойТаблицыВерсии));
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 = %2.ПроектнаяЗадача",
			СтруктураНастроек.ИмяПоляПЗДляСвязиСОсновнымНабором,
			ИмяТаблицыСрокиПоВерсии);
	Соединение = ОператорОсновногоПакетаЗапроса.Источники[0].Соединения.Добавить(ИмяТаблицыСрокиПоВерсии, УсловиеСоединения);
	
	ВыбранноеПоле = ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Добавить(ИмяТаблицыСрокиПоВерсии + ".ДатаНачалаПлан");
	ПакетЗапросаОсновногоНабораИтоговый.Колонки[ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Количество() - 1].Псевдоним =
		ИмяПоляДатаНачалаПоВерсии;
	ВыбранноеПоле = ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Добавить(ИмяТаблицыСрокиПоВерсии + ".ДатаЗавершенияПлан");
	ПакетЗапросаОсновногоНабораИтоговый.Колонки[ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Количество() - 1].Псевдоним =
		ИмяПоляДатаЗавершенияПоВерсии;
	
	Если ИспользуютсяПрогнозныеСроки Тогда
		ИсточникПрогнозныеСрокиПЗ = ОператорОсновногоПакетаЗапроса.Источники.Добавить(
				"РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних",
				ИмяТаблицыПрогнозныеСрокиПоВерсии);
		ИсточникПрогнозныеСрокиПЗ.Источник.Параметры[0].Выражение =
			Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
		ИсточникПрогнозныеСрокиПЗ.Источник.Параметры[1].Выражение =
			Новый ВыражениеСхемыЗапроса(СтрШаблон("Версия В
					|     (ВЫБРАТЬ
					|     %1.Версия КАК Версия
					|     ИЗ
					|     %1 КАК %1) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}", ИмяВременнойТаблицыВерсии));
		// Соединим левым соединением с таблицей СрокиПЗ, т.к. плановые сроки есть всегда.
		УсловиеСоединения = СтрШаблон("%1.ПроектнаяЗадача = %2.ПроектнаяЗадача
				|  И %1.Версия = %2.Версия", ИмяТаблицыСрокиПоВерсии, ИмяТаблицыПрогнозныеСрокиПоВерсии);
		Соединение = ИсточникСрокиПЗПоВерсии.Соединения.Добавить(ИмяТаблицыПрогнозныеСрокиПоВерсии, УсловиеСоединения);
		
		ВыбранноеПоле = ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Добавить(
				ИмяТаблицыПрогнозныеСрокиПоВерсии + ".ДатаНачалаПрогноз");
		ПакетЗапросаОсновногоНабораИтоговый.Колонки[ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Количество() - 1].Псевдоним =
			ИмяПоляДатаНачалаПрогнозПоВерсии;
		ВыбранноеПоле = ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Добавить(
				ИмяТаблицыПрогнозныеСрокиПоВерсии + ".ДатаЗавершенияПрогноз");
		ПакетЗапросаОсновногоНабораИтоговый.Колонки[ОператорОсновногоПакетаЗапроса.ВыбираемыеПоля.Количество() - 1].Псевдоним =
			ИмяПоляДатаЗавершенияПрогнозПоВерсии;
	КонецЕсли;
	
	Если НЕ ОсновнойНабор.АвтоЗаполнениеДоступныхПолей Тогда
		ПакетЗапросаОсновногоНабораИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(ИмяПоляДатаНачалаПоВерсии);
		ПакетЗапросаОсновногоНабораИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(ИмяПоляДатаЗавершенияПоВерсии);
		
		Если ИспользуютсяПрогнозныеСроки Тогда
			ПакетЗапросаОсновногоНабораИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(ИмяПоляДатаНачалаПрогнозПоВерсии);
			ПакетЗапросаОсновногоНабораИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(ИмяПоляДатаЗавершенияПрогнозПоВерсии);
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстЗапросаСДобавленнымиСрокамиПоВерсии = СхемаЗапросаОсновнойНабор.ПолучитьТекстЗапроса();
	ОсновнойНабор.Запрос = ТекстЗапросаСДобавленнымиСрокамиПоВерсии;
	
	Оформление = Новый Структура("ГоризонтальноеПоложение, Формат", ГоризонтальноеПоложение.Лево, ФорматПериодаДень());
	
	ДобавитьПолеКомпоновки(ОсновнойНабор,
		ИмяПоляДатаНачалаПоВерсии,
		ИмяПоляДатаНачалаПоВерсии,
		,
		,
		,
		,
		Оформление,
		СинонимПоляДатыНачалаПоВерсии);
	
	ДобавитьПолеКомпоновки(ОсновнойНабор,
		ИмяПоляДатаЗавершенияПоВерсии,
		ИмяПоляДатаЗавершенияПоВерсии,
		,
		,
		,
		,
		Оформление,
		СинонимПоляДатыЗавершенияПоВерсии);
	
	Если ИспользуютсяПрогнозныеСроки Тогда
		ДобавитьПолеКомпоновки(ОсновнойНабор,
			ИмяПоляДатаНачалаПрогнозПоВерсии,
			ИмяПоляДатаНачалаПрогнозПоВерсии,
			,
			,
			,
			,
			Оформление,
			СинонимПоляДатыНачалаПрогнозПоВерсии);
		
		ДобавитьПолеКомпоновки(ОсновнойНабор,
			ИмяПоляДатаЗавершенияПрогнозПоВерсии,
			ИмяПоляДатаЗавершенияПрогнозПоВерсии,
			,
			,
			,
			,
			Оформление,
			СинонимПоляДатыЗавершенияПрогнозПоВерсии);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСрокиПоВерсииВНаборДанныхИерархия(НаборИерархия, НомерВерсииСтрокой, СтруктураНастроек, ИспользуютсяПрогнозныеСроки)
	
	// Получим шаблон запроса версий.
	ТекстЗапросаВерсии = ТекстЗапросаВерсииПоНомеру();
	ТекстЗапросаВерсии = СтрЗаменить(ТекстЗапросаВерсии, "_Номер", НомерВерсииСтрокой);
	
	ТекстЗапросаНабораДанныхИерархия = НаборИерархия.Запрос;
	СхемаЗапросаНаборДанныхИерархия = Новый СхемаЗапроса;
	СхемаЗапросаНаборДанныхИерархия.УстановитьТекстЗапроса(ТекстЗапросаНабораДанныхИерархия);
	
	ИмяТаблицыСрокиПоВерсии = "СрокиПЗПоВерсии" + НомерВерсииСтрокой;
	ИмяТаблицыПрогнозныеСрокиПоВерсии = "ПрогнозныеСрокиПЗПоВерсии" + НомерВерсииСтрокой;
	ИмяВременнойТаблицыВерсии = "ВТ_Версии" + НомерВерсииСтрокой;
	
	ИмяПоляДатаНачалаПоВерсии = "ДатаНачалаПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыНачалаПоВерсии = СтрШаблон(НСтр("ru = 'Дата начала по версии %1'"), НомерВерсииСтрокой);
	ИмяПоляДатаЗавершенияПоВерсии = "ДатаЗавершенияПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыЗавершенияПоВерсии = СтрШаблон(НСтр("ru = 'Дата завершения по версии %1'"), НомерВерсииСтрокой);
	
	ИмяПоляДатаНачалаПрогнозПоВерсии = "ДатаНачалаПрогнозПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыНачалаПрогнозПоВерсии = СтрШаблон(НСтр("ru = 'Дата начала, прогноз по версии %1'"), НомерВерсииСтрокой);
	ИмяПоляДатаЗавершенияПрогнозПоВерсии = "ДатаЗавершенияПрогнозПоВерсии" + НомерВерсииСтрокой;
	СинонимПоляДатыЗавершенияПрогнозПоВерсии = СтрШаблон(НСтр("ru = 'Дата завершения, прогноз по версии %1'"), НомерВерсииСтрокой);
	
	// Поместим данные иерархии во временную таблицу, если не помещены.
	ПакетИерархия = СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов[1];
	ИмяИсточника = "ВТ_Иерархия";
	Если ПакетИерархия.ТаблицаДляПомещения = "" Тогда
		ПакетИерархия.ТаблицаДляПомещения = ИмяИсточника;
		ПакетЗапросаИерархияИтоговый = СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		ОператорПакетаЗапросаИерархия = ПакетЗапросаИерархияИтоговый.Операторы[0];
		ОператорПакетаЗапросаИерархия.Источники.Добавить(ИмяИсточника, ИмяИсточника);
		Для Каждого Колонка Из ПакетИерархия.Колонки Цикл
			ИмяПоля = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку("%1.%2",
					ИмяИсточника,
					Колонка.Псевдоним);
			ВыбранноеПоле = ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Добавить(ИмяПоля);
		КонецЦикла;
	Иначе
		ПакетЗапросаИерархияИтоговый = СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов[
			СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Количество() - 1];
		ОператорПакетаЗапросаИерархия = ПакетЗапросаИерархияИтоговый.Операторы[0];
	КонецЕсли;
	
	ВременнаяТаблицаВерсииПоНомеру = СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	ВременнаяТаблицаВерсииПоНомеру.УстановитьТекстЗапроса(ТекстЗапросаВерсии);
	ВременнаяТаблицаВерсииПоНомеру.ТаблицаДляПомещения = ИмяВременнойТаблицыВерсии;
	СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Сдвинуть(ВременнаяТаблицаВерсииПоНомеру, -1);
	
	ИмяТаблицыСрокиПоВерсииПроект = "ВТ_СрокиПроекта" + НомерВерсииСтрокой;
	ПакетСрокиПроекта = СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Сдвинуть(ПакетСрокиПроекта, -1);
	ТекстЗапросаСрокиПроекта = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    ВерсииПроекта.Проект КАК СсылкаНаПроект,
		|    МИНИМУМ(ПлановыеСроки.ДатаНачалаПлан) КАК ДатаНачала,
		|    МАКСИМУМ(ПлановыеСроки.ДатаЗавершенияПлан) КАК ДатаЗавершения
		|ИЗ
		|    РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2},
		|            Версия В
		|                (ВЫБРАТЬ
		|                    %1.Версия КАК Версия
		|                ИЗ
		|                    %1 КАК %1) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК ПлановыеСроки
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК СвойстваПроектныхЗадач
		|            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
		|            ПО СвойстваПроектныхЗадач.Версия = ВерсииПроекта.Версия
		|        ПО ПлановыеСроки.Версия = СвойстваПроектныхЗадач.Версия
		|            И ПлановыеСроки.Версия = СвойстваПроектныхЗадач.Версия
		|            И ПлановыеСроки.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
		|            И (НЕ СвойстваПроектныхЗадач.ЗадачаОтменена)
		|{ГДЕ
		|    ВерсииПроекта.Проект.* КАК СсылкаНаПроект}
		|
		|СГРУППИРОВАТЬ ПО
		|    ВерсииПроекта.Проект";
	ТекстЗапросаСрокиПроекта = СтрШаблон(ТекстЗапросаСрокиПроекта, ИмяВременнойТаблицыВерсии);
	ПакетСрокиПроекта.УстановитьТекстЗапроса(ТекстЗапросаСрокиПроекта);
	ПакетСрокиПроекта.ТаблицаДляПомещения = ИмяТаблицыСрокиПоВерсииПроект;
	
	Если ИспользуютсяПрогнозныеСроки Тогда
		ИмяТаблицыПрогнозныеСрокиПоВерсииПроект = "ВТ_СрокиПроектаПрогноз" + НомерВерсииСтрокой;
		
		ПакетПрогнозныеСрокиПроекта = СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		СхемаЗапросаНаборДанныхИерархия.ПакетЗапросов.Сдвинуть(ПакетПрогнозныеСрокиПроекта, -1);
		ТекстЗапросаПрогнозныеСрокиПроекта = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|    ВерсииПроекта.Проект КАК СсылкаНаПроект,
			|    МИНИМУМ(ПрогнозныеСроки.ДатаНачалаПрогноз) КАК ДатаНачалаПрогноз,
			|    МАКСИМУМ(ПрогнозныеСроки.ДатаЗавершенияПрогноз) КАК ДатаЗавершенияПрогноз
			|ИЗ
			|    РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних КАК ПрогнозныеСроки
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК СвойстваПроектныхЗадач
			|            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
			|            ПО СвойстваПроектныхЗадач.Версия = ВерсииПроекта.Версия
			|            И ВерсииПроекта.Версия В
			|                (ВЫБРАТЬ
			|                    %1.Версия КАК Версия
			|                ИЗ
			|                    %1 КАК %1)
			|        ПО ПрогнозныеСроки.Версия = СвойстваПроектныхЗадач.Версия
			|            И ПрогнозныеСроки.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
			|            И (НЕ СвойстваПроектныхЗадач.ЗадачаОтменена)
			|ГДЕ
			|    (ПрогнозныеСроки.ДатаНачалаПрогноз <> ДАТАВРЕМЯ(1, 1, 1)
			|            ИЛИ ПрогнозныеСроки.ДатаЗавершенияПрогноз <> ДАТАВРЕМЯ(1, 1, 1))
			|
			|СГРУППИРОВАТЬ ПО
			|    ВерсииПроекта.Проект";
		
		ТекстЗапросаПрогнозныеСрокиПроекта = СтрШаблон(ТекстЗапросаПрогнозныеСрокиПроекта, ИмяВременнойТаблицыВерсии);
		ПакетПрогнозныеСрокиПроекта.УстановитьТекстЗапроса(ТекстЗапросаПрогнозныеСрокиПроекта);
		ПакетПрогнозныеСрокиПроекта.ТаблицаДляПомещения = ИмяТаблицыПрогнозныеСрокиПоВерсииПроект;
	КонецЕсли;
	
	// Соединяем сроки ПЗ по версии.
	ИсточникСрокиПоВерсииПЗИерархия = ОператорПакетаЗапросаИерархия.Источники.Добавить(
			"РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних",
			ИмяТаблицыСрокиПоВерсии);
	ИсточникСрокиПоВерсииПЗИерархия.Источник.Параметры[0].Выражение =
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникСрокиПоВерсииПЗИерархия.Источник.Параметры[1].Выражение =
		Новый ВыражениеСхемыЗапроса(СтрШаблон("Версия В
				|     (ВЫБРАТЬ
				|     %1.Версия КАК Версия
				|     ИЗ
				|     %1 КАК %1) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}", ИмяВременнойТаблицыВерсии));
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1.СсылкаНаПроектнуюЗадачу = %2.ПроектнаяЗадача",
			ИмяИсточника, ИмяТаблицыСрокиПоВерсии);
	Соединение = ОператорПакетаЗапросаИерархия.Источники[0].Соединения.Добавить(ИмяТаблицыСрокиПоВерсии, УсловиеСоединения);
	
	Если ИспользуютсяПрогнозныеСроки Тогда
		ИсточникПрогнозныеСрокиПЗИерархия = ОператорПакетаЗапросаИерархия.Источники.Добавить(
				"РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних",
				ИмяТаблицыПрогнозныеСрокиПоВерсии);
		ИсточникПрогнозныеСрокиПЗИерархия.Источник.Параметры[0].Выражение =
			Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
		ИсточникПрогнозныеСрокиПЗИерархия.Источник.Параметры[1].Выражение =
			Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
		// Соединим левым соединением с таблицей СрокиПЗ, т.к. плановые сроки есть всегда.
		УсловиеСоединения = СтрШаблон("%1.ПроектнаяЗадача = %2.ПроектнаяЗадача
				|  И %1.Версия = %2.Версия", ИмяТаблицыСрокиПоВерсии, ИмяТаблицыПрогнозныеСрокиПоВерсии);
		Соединение = ИсточникСрокиПоВерсииПЗИерархия.Соединения.Добавить(ИмяТаблицыПрогнозныеСрокиПоВерсии, УсловиеСоединения);
	КонецЕсли;
	
	// Соединяем сроки проекта.
	ИсточникСрокиПроектИерархия = ОператорПакетаЗапросаИерархия.Источники.Добавить(
			ИмяТаблицыСрокиПоВерсииПроект,
			ИмяТаблицыСрокиПоВерсииПроект);
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1.ПроектнаяЗадача = %2.СсылкаНаПроект",
			ИмяИсточника, ИмяТаблицыСрокиПоВерсииПроект);
	Соединение = ОператорПакетаЗапросаИерархия.Источники[0].Соединения.Добавить(ИмяТаблицыСрокиПоВерсииПроект, УсловиеСоединения);
	
	ШаблонВыбранноеПоле = "ВЫБОР
		|	КОГДА %1.ЭтоПроектнаяЗадача
		|		ТОГДА ЕСТЬNULL(%2.ДатаНачалаПлан, 0)
		|	ИНАЧЕ ЕСТЬNULL(%3.ДатаНачала, 0)
		|КОНЕЦ";
	ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонВыбранноеПоле,
			ИмяИсточника,
			ИмяТаблицыСрокиПоВерсии,
			ИмяТаблицыСрокиПоВерсииПроект);
	ВыбранноеПоле = ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
	ПакетЗапросаИерархияИтоговый.Колонки[ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Количество() - 1].Псевдоним =
		ИмяПоляДатаНачалаПоВерсии;
	
	ШаблонВыбранноеПоле = "ВЫБОР
		|	КОГДА %1.ЭтоПроектнаяЗадача
		|		ТОГДА ЕСТЬNULL(%2.ДатаЗавершенияПлан, 0)
		|	ИНАЧЕ ЕСТЬNULL(%3.ДатаЗавершения, 0)
		|КОНЕЦ";
	ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонВыбранноеПоле,
			ИмяИсточника,
			ИмяТаблицыСрокиПоВерсии,
			ИмяТаблицыСрокиПоВерсииПроект);
	ВыбранноеПоле = ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
	ПакетЗапросаИерархияИтоговый.Колонки[ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Количество() - 1].Псевдоним =
		ИмяПоляДатаЗавершенияПоВерсии;
	
	Если ИспользуютсяПрогнозныеСроки Тогда
		ИсточникСрокиПроектИерархия = ОператорПакетаЗапросаИерархия.Источники.Добавить(
				ИмяТаблицыПрогнозныеСрокиПоВерсииПроект,
				ИмяТаблицыПрогнозныеСрокиПоВерсииПроект);
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1.ПроектнаяЗадача = %2.СсылкаНаПроект",
				ИмяИсточника,
				ИмяТаблицыПрогнозныеСрокиПоВерсииПроект);
		Соединение = ОператорПакетаЗапросаИерархия.Источники[0].Соединения.Добавить(ИмяТаблицыПрогнозныеСрокиПоВерсииПроект,
				УсловиеСоединения);
		
		ШаблонВыбранноеПоле = "ВЫБОР
			|	КОГДА %1.ЭтоПроектнаяЗадача
			|		ТОГДА ЕСТЬNULL(%2.ДатаНачалаПрогноз, 0)
			|	ИНАЧЕ ЕСТЬNULL(%3.ДатаНачалаПрогноз, 0)
			|КОНЕЦ";
		ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонВыбранноеПоле,
				ИмяИсточника,
				ИмяТаблицыПрогнозныеСрокиПоВерсии,
				ИмяТаблицыПрогнозныеСрокиПоВерсииПроект);
		ВыбранноеПоле = ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
		ПакетЗапросаИерархияИтоговый.Колонки[ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Количество() - 1].Псевдоним =
			ИмяПоляДатаНачалаПрогнозПоВерсии;
		
		ШаблонВыбранноеПоле = "ВЫБОР
			|	КОГДА %1.ЭтоПроектнаяЗадача
			|		ТОГДА ЕСТЬNULL(%2.ДатаЗавершенияПрогноз, 0)
			|	ИНАЧЕ ЕСТЬNULL(%3.ДатаЗавершенияПрогноз, 0)
			|КОНЕЦ";
		ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонВыбранноеПоле,
				ИмяИсточника,
				ИмяТаблицыПрогнозныеСрокиПоВерсии,
				ИмяТаблицыПрогнозныеСрокиПоВерсииПроект);
		ВыбранноеПоле = ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
		ПакетЗапросаИерархияИтоговый.Колонки[ОператорПакетаЗапросаИерархия.ВыбираемыеПоля.Количество() - 1].Псевдоним =
			ИмяПоляДатаЗавершенияПрогнозПоВерсии;
	КонецЕсли;
	
	ОператорПакетаЗапросаИерархия.ВыраженияОтбораКомпоновкиДанных.Очистить();
	Для Каждого ВыбираемоеПоле Из ОператорПакетаЗапросаИерархия.ВыбираемыеПоля Цикл
		ОператорПакетаЗапросаИерархия.ВыраженияОтбораКомпоновкиДанных.Добавить(ВыбираемоеПоле);
	КонецЦикла;
	
	ПакетЗапросаИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Очистить();
	Для Каждого Колонка Из ПакетЗапросаИерархияИтоговый.Колонки Цикл
		ПакетЗапросаИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(Колонка);
	КонецЦикла;
	
	Оформление = Новый Структура("ГоризонтальноеПоложение, Формат", ГоризонтальноеПоложение.Лево, ФорматПериодаДень());
	
	ДобавитьПолеКомпоновки(НаборИерархия,
		ИмяПоляДатаНачалаПоВерсии,
		ИмяПоляДатаНачалаПоВерсии,
		,
		,
		,
		,
		Оформление,
		СинонимПоляДатыНачалаПоВерсии);
	
	ДобавитьПолеКомпоновки(НаборИерархия,
		ИмяПоляДатаЗавершенияПоВерсии,
		ИмяПоляДатаЗавершенияПоВерсии,
		,
		,
		,
		,
		Оформление,
		СинонимПоляДатыЗавершенияПоВерсии);
	
	Если ИспользуютсяПрогнозныеСроки Тогда
		ДобавитьПолеКомпоновки(НаборИерархия,
			ИмяПоляДатаНачалаПрогнозПоВерсии,
			ИмяПоляДатаНачалаПрогнозПоВерсии,
			,
			,
			,
			,
			Оформление,
			СинонимПоляДатыНачалаПрогнозПоВерсии);
		
		ДобавитьПолеКомпоновки(НаборИерархия,
			ИмяПоляДатаЗавершенияПрогнозПоВерсии,
			ИмяПоляДатаЗавершенияПрогнозПоВерсии,
			,
			,
			,
			,
			Оформление,
			СинонимПоляДатыЗавершенияПрогнозПоВерсии);
	КонецЕсли;
	
	ТекстЗапросаСДобавленнымиСрокамиПоВерсииИерархия = СхемаЗапросаНаборДанныхИерархия.ПолучитьТекстЗапроса();
	НаборИерархия.Запрос = ТекстЗапросаСДобавленнымиСрокамиПоВерсииИерархия;
	
КонецПроцедуры

Процедура ДополнитьСКДСрокиФактПЗ(СКД, ТипВерсии, ОсновнойНаборДанных, СтруктураНастроек, 
	ПроверятьИспользованиеПолей, КомпоновщикНастроек, ОтборПоСценарию = Ложь)
	
	Если ПроверятьИспользованиеПолей Тогда
		Если КомпоновщикНастроек = Неопределено Тогда
			Возврат;
		КонецЕсли;	
		Если Не ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, "ДатаНачалаФакт")
			И Не ПолеИспользуетсяВОтчете(КомпоновщикНастроек.Настройки, "ДатаЗавершенияФакт") Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ОсновнойНабор = СКД.НаборыДанных.Найти(ОсновнойНаборДанных);
	ТекстЗапроса = ОсновнойНабор.Запрос;
	
	// Добавим фактические сроки в основной набор.
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	Оператор = ПакетЗапросов.Операторы[0];
	
	// Фактические сроки.
	ИсточникСрокиФактПЗ = Оператор.Источники.Добавить(
		"РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних", 
		"СрокиФактПЗ");
	ИсточникСрокиФактПЗ.Источник.Параметры[0].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникСрокиФактПЗ.Источник.Параметры[1].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1 = СрокиФактПЗ.ПроектнаяЗадача", 
		СтруктураНастроек.ИмяПоляПЗДляСвязиСОсновнымНабором);
	Соединение = Оператор.Источники[0].Соединения.Добавить("СрокиФактПЗ", УсловиеСоединения);
	Оператор.Источники[0].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
   	ВыбранноеПоле =  Оператор.ВыбираемыеПоля.Добавить("СрокиФактПЗ.ДатаНачала");
	ПакетЗапросов.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "ДатаНачалаФакт";
	ВыбранноеПоле =  Оператор.ВыбираемыеПоля.Добавить("СрокиФактПЗ.ДатаЗавершения");
	ПакетЗапросов.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = "ДатаЗавершенияФакт";
	
	// Версии.
	ИсточникВерсияСрокиФактПЗ = Оператор.Источники.Добавить(
		"РегистрСведений.упоВерсииПроекта", 
		"упоВерсииПроектаСрокиФактПЗ");
	ИсточникВерсияСрокиФактПЗ.Соединения.Очистить();
	ТекстУсловия = "СрокиФактПЗ.Версия = упоВерсииПроектаСрокиФактПЗ.Версия И (упоВерсииПроектаСрокиФактПЗ.%1)";

	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, УсловиеОтбора);
	Иначе	
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, ТипВерсии);	
	КонецЕсли;

	ДобавитьВнутреннееСоединениеВИсточник(ИсточникСрокиФактПЗ, "упоВерсииПроектаСрокиФактПЗ", УсловиеСоединения);
		
	Если Не ОсновнойНабор.АвтоЗаполнениеДоступныхПолей Тогда
		ПакетЗапросов.ПоляВыбораКомпоновкиДанных.Добавить("ДатаНачалаФакт");
		ПакетЗапросов.ПоляВыбораКомпоновкиДанных.Добавить("ДатаЗавершенияФакт");
	КонецЕсли;
	
	ТекстЗапросаСрокиФакт = СхемаЗапроса.ПолучитьТекстЗапроса();

	ОсновнойНабор.Запрос = ТекстЗапросаСрокиФакт;
	
	Оформление = Новый Структура("ГоризонтальноеПоложение, Формат", ГоризонтальноеПоложение.Лево, ФорматПериодаДень());
	
	ДобавитьПолеКомпоновки(ОсновнойНабор, 
							"ДатаНачалаФакт", 
							"ДатаНачалаФакт", 
							, 
							, 
							, 
							, 
							Оформление);
							
	ДобавитьПолеКомпоновки(ОсновнойНабор, 
							"ДатаЗавершенияФакт", 
							"ДатаЗавершенияФакт",
							, 
							, 
							, 
							, 
							Оформление);
	
	Группировки = Новый Массив;
	Группировки.Добавить("ПроектнаяЗадача");
	Группировки.Добавить("ПроектнаяЗадача Иерархия");
	ДобавитьПолеРесурса(СКД, "ДатаНачалаФакт", "ДатаНачалаФакт", Группировки);
	ДобавитьПолеРесурса(СКД, "ДатаЗавершенияФакт", "ДатаЗавершенияФакт", Группировки);
	
	// Добавим фактические сроки в иерархию.
	НаборИерархия = СКД.НаборыДанных.Найти("Иерархия");
	ТекстЗапроса = НаборИерархия.Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	// Поместим данные иерархии во временную таблицу, если не помещены.
	ПакетИерархия = СхемаЗапроса.ПакетЗапросов[1];
	ИмяИсточника = "ВТ_Иерархия";
	Если ПакетИерархия.ТаблицаДляПомещения = "" Тогда
		ПакетИерархия.ТаблицаДляПомещения = ИмяИсточника;
		ПакетЗапросовИерархияИтоговый = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
		ОператорИерархияИтоговый = ПакетЗапросовИерархияИтоговый.Операторы[0];
		ОператорИерархияИтоговый.Источники.Добавить(ИмяИсточника, ИмяИсточника);
		Для Каждого Колонка Из ПакетИерархия.Колонки Цикл
			ИмяПоля = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку("%1.%2", 
						ИмяИсточника, 
						Колонка.Псевдоним);
			ВыбранноеПоле = ОператорИерархияИтоговый.ВыбираемыеПоля.Добавить(ИмяПоля);
		КонецЦикла;	
	Иначе
		ПакетЗапросовИерархияИтоговый = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	КонецЕсли;
	
	// Фактические сроки по проекту рассчитываем в отдельной временной таблице.
	ПакетСрокиФактПроекта = СхемаЗапроса.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	СхемаЗапроса.ПакетЗапросов.Сдвинуть(ПакетСрокиФактПроекта, -1);
	ТекстЗапросаСрокиФактПроекта = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                               |	упоВерсииПроекта.Проект КАК СсылкаНаПроект,
	                               |	МИНИМУМ(ВЫБОР
	                               |			КОГДА упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	                               |				ТОГДА ДАТАВРЕМЯ(3000, 1, 1)
	                               |			ИНАЧЕ упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала
	                               |		КОНЕЦ) КАК ДатаНачалаФакт,
	                               |	МАКСИМУМ(ВЫБОР
	                               |			КОГДА упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	                               |				ТОГДА ДАТАВРЕМЯ(3000, 1, 1)
	                               |			ИНАЧЕ упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения
	                               |		КОНЕЦ) КАК ДатаЗавершенияФакт
	                               |ИЗ
	                               |	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	                               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК упоСвойстваПроектныхЗадачСрезПоследних
	                               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	                               |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	                               |				
	                               |		ПО упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	                               |			И упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	                               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	                               |{ГДЕ
	                               |	упоВерсииПроекта.Проект.* КАК СсылкаНаПроект}
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	упоВерсииПроекта.Проект";
	                           
	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		ТекстЗапросаСрокиФактПроекта = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапросаСрокиФактПроекта, УсловиеОтбора);	
	Иначе	
		ТекстЗапросаСрокиФактПроекта = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапросаСрокиФактПроекта, ТипВерсии);	
	КонецЕсли;
	
	ПакетСрокиФактПроекта.УстановитьТекстЗапроса(ТекстЗапросаСрокиФактПроекта);
	ПакетСрокиФактПроекта.ТаблицаДляПомещения = "ВТ_СрокиФактПроекта";
	
	// Фактические сроки ПЗ.
	Оператор = ПакетЗапросовИерархияИтоговый.Операторы[0];
	
	ИсточникСрокиФактПЗИерархия = Оператор.Источники.Добавить(
		"РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних", 
		"СрокиФактПЗ");
	ИсточникСрокиФактПЗИерархия.Источник.Параметры[0].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(НЕОПРЕДЕЛЕНО) КАК Поле2}");
	ИсточникСрокиФактПЗИерархия.Источник.Параметры[1].Выражение = 
		Новый ВыражениеСхемыЗапроса("{(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.СсылкаНаПроектнуюЗадачу = СрокиФактПЗ.ПроектнаяЗадача", 
		ИмяИсточника);
	Соединение = Оператор.Источники[0].Соединения.Добавить("СрокиФактПЗ", УсловиеСоединения);
	Оператор.Источники[0].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
	
	// Версии ПЗ.
	ИсточникВерсияСрокиФактПЗ = Оператор.Источники.Добавить("РегистрСведений.упоВерсииПроекта", 
															"упоВерсииПроектаСрокиФактПЗ");
	ТекстУсловия = "СрокиФактПЗ.Версия = упоВерсииПроектаСрокиФактПЗ.Версия И (упоВерсииПроектаСрокиФактПЗ.%1)";

	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, УсловиеОтбора);
	Иначе	
		УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловия, ТипВерсии);
	КонецЕсли;
	
	ДобавитьВнутреннееСоединениеВИсточник(ИсточникСрокиФактПЗИерархия, "упоВерсииПроектаСрокиФактПЗ", УсловиеСоединения); 
	
	// Фактические сроки проекта.
	ИсточникСрокиФактПроектИерархия = Оператор.Источники.Добавить(
		"ВТ_СрокиФактПроекта", 
		"ВТ_СрокиФактПроекта");
	УсловиеСоединения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1.ПроектнаяЗадача = ВТ_СрокиФактПроекта.СсылкаНаПроект", 
		ИмяИсточника);
	Соединение = Оператор.Источники[0].Соединения.Добавить("ВТ_СрокиФактПроекта", УсловиеСоединения);
	Оператор.Источники[0].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
	
	ШаблонВыбранноеПоле = "ВЫБОР
							|	КОГДА %1.ЭтоПроектнаяЗадача
							|		ТОГДА ЕСТЬNULL(СрокиФактПЗ.ДатаНачала, 0)
							|	ИНАЧЕ ЕСТЬNULL(ВЫБОР
							|						КОГДА ВТ_СрокиФактПроекта.ДатаНачалаФакт = ДАТАВРЕМЯ(3000, 1, 1)
							|							ТОГДА ДАТАВРЕМЯ(1, 1, 1)
							|						ИНАЧЕ ВТ_СрокиФактПроекта.ДатаНачалаФакт
							|					КОНЕЦ, 0)
							|КОНЕЦ";
	ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
							ШаблонВыбранноеПоле,
							ИмяИсточника,
							"ДатаНачалаФакт");
	ВыбранноеПоле = Оператор.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
	ПакетЗапросовИерархияИтоговый.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = 
		"ДатаНачалаФакт";
	
	ШаблонВыбранноеПоле = "ВЫБОР
							|	КОГДА %1.ЭтоПроектнаяЗадача
							|		ТОГДА ЕСТЬNULL(СрокиФактПЗ.ДатаЗавершения, 0)
							|	ИНАЧЕ ЕСТЬNULL(ВЫБОР
							|						КОГДА ВТ_СрокиФактПроекта.ДатаЗавершенияФакт = ДАТАВРЕМЯ(3000, 1, 1)
							|							ТОГДА ДАТАВРЕМЯ(1, 1, 1)
							|						ИНАЧЕ ВТ_СрокиФактПроекта.ДатаЗавершенияФакт
							|					КОНЕЦ, 0)
							|КОНЕЦ";
	ТекстВыбранноеПоле = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
							ШаблонВыбранноеПоле,
							ИмяИсточника,
							"ДатаЗавершенияФакт");
	ВыбранноеПоле = Оператор.ВыбираемыеПоля.Добавить(ТекстВыбранноеПоле);
	ПакетЗапросовИерархияИтоговый.Колонки[Оператор.ВыбираемыеПоля.Количество() - 1].Псевдоним = 
		"ДатаЗавершенияФакт";     
	
	Оператор.ВыраженияОтбораКомпоновкиДанных.Очистить();
	Для каждого ВыбираемоеПоле Из Оператор.ВыбираемыеПоля Цикл
		Оператор.ВыраженияОтбораКомпоновкиДанных.Добавить(ВыбираемоеПоле);
	КонецЦикла;
	
	ПакетЗапросовИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Очистить();
	Для каждого Колонка Из ПакетЗапросовИерархияИтоговый.Колонки Цикл
		ПакетЗапросовИерархияИтоговый.ПоляВыбораКомпоновкиДанных.Добавить(Колонка);
	КонецЦикла;	
	
	ДобавитьПолеКомпоновки(НаборИерархия, 
							"ДатаНачалаФакт", 
							"ДатаНачалаФакт", 
							,
							,
							,
							,
							Оформление);
							
	ДобавитьПолеКомпоновки(НаборИерархия, 
							"ДатаЗавершенияФакт", 
							"ДатаЗавершенияФакт", 
							,
							,
							,
							,
							Оформление);
	
	ТекстЗапросаСрокиФактИерархия = СхемаЗапроса.ПолучитьТекстЗапроса();
	НаборИерархия.Запрос = ТекстЗапросаСрокиФактИерархия;
	
КонецПроцедуры

Процедура ДобавитьНаборДанныхСрокиПроекта(СКД, ОсновнойНаборДанных, ТипВерсии, ОтборПоСценарию, СтруктураНастроек)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                   |    упоВерсииПроекта.Проект КАК Проект,
                   |    МИНИМУМ(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан) КАК ДатаНачалаПроект,
                   |    МАКСИМУМ(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан) КАК ДатаЗавершенияПроект
                   |ПОМЕСТИТЬ ВТ_СрокиПроекта
                   |{ВЫБРАТЬ
                   |    Проект.*}
                   |ИЗ
                   |    РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК упоСрокиПроектныхЗадачСрезПоследних
                   |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК упоСвойстваПроектныхЗадачСрезПоследних
                   |            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
                   |            ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
                   |                И (упоВерсииПроекта.%1)
                   |        ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
                   |            И упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
                   |            И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
                   |{ГДЕ
                   |    упоВерсииПроекта.Проект.* КАК Проект}
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    упоВерсииПроекта.Проект
                   |;
                   |  
				   | //#ТекстЗапроса_ПрогнозныеСроки#
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |    ВТ_СрокиПроекта.Проект КАК Проект,
                   |    ВТ_СрокиПроекта.ДатаНачалаПроект КАК ДатаНачалаПроект,
                   |    ВТ_СрокиПроекта.ДатаЗавершенияПроект КАК ДатаЗавершенияПроект
                   |    //#Поля_ПрогнозныеСроки#
                   |ИЗ
                   |    ВТ_СрокиПроекта КАК ВТ_СрокиПроекта
                   |        //#Соединение_ПрогнозныеСроки#";

	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//#ТекстЗапроса_ПрогнозныеСроки#",
			"////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|    ВерсииПроекта.Проект КАК Проект,
			|    МИНИМУМ(ПрогнозныеСроки.ДатаНачалаПрогноз) КАК ДатаНачалаПрогноз,
			|    МАКСИМУМ(ПрогнозныеСроки.ДатаЗавершенияПрогноз) КАК ДатаЗавершенияПрогноз
			|ПОМЕСТИТЬ ВТ_ПрогнозныеСрокиПроекта
			|ИЗ
			|    РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК ПрогнозныеСроки
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК СвойстваПроектныхЗадач
			|            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииПроекта
			|            ПО СвойстваПроектныхЗадач.Версия = ВерсииПроекта.Версия
			|               И (ВерсииПроекта.%1)
			|        ПО ПрогнозныеСроки.Версия = СвойстваПроектныхЗадач.Версия
			|            И ПрогнозныеСроки.ПроектнаяЗадача = СвойстваПроектныхЗадач.ПроектнаяЗадача
			|            И (НЕ СвойстваПроектныхЗадач.ЗадачаОтменена)
			|ГДЕ
			|    (ПрогнозныеСроки.ДатаНачалаПрогноз <> ДАТАВРЕМЯ(1, 1, 1)
			|            ИЛИ ПрогнозныеСроки.ДатаЗавершенияПрогноз <> ДАТАВРЕМЯ(1, 1, 1))
			|
			|СГРУППИРОВАТЬ ПО
			|    ВерсииПроекта.Проект
			|; ");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//#Поля_ПрогнозныеСроки#",  
			"    , ВТ_ПрогнозныеСрокиПроекта.ДатаНачалаПрогноз КАК ДатаНачалаПрогнозПроект
	        |    , ВТ_ПрогнозныеСрокиПроекта.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогнозПроект"); 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//#Соединение_ПрогнозныеСроки#",  
			"        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрогнозныеСрокиПроекта КАК ВТ_ПрогнозныеСрокиПроекта
            |        ПО ВТ_СрокиПроекта.Проект = ВТ_ПрогнозныеСрокиПроекта.Проект");
		
	КонецЕсли;
	
	Если ОтборПоСценарию Тогда 
		УсловиеОтбора = УсловиеОтбораВерсииПоВерсиямСценария();
		ТекстЗапроса = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, УсловиеОтбора);
	Иначе	
		ТекстЗапроса = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, ТипВерсии);
	КонецЕсли;
	
	НаборДанныхСрокиПроектов = ДобавитьНаборДанных(СКД, "СрокиПроектов", "ИсточникДанных1", ТекстЗапроса);
	
	Оформление = Новый Структура("ГоризонтальноеПоложение, Формат", ГоризонтальноеПоложение.Лево, ФорматПериодаДень());
	ОграничениеИспользования = НовоеОграничениеИспользованияПоля();
	ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов, "Проект", "Проект",
		Истина,
		Истина,
		Истина,
		Истина);
	ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов, "ДатаНачалаПроект", "ДатаНачалаПроект",
		,
		,
		,
		,
		Оформление, "Дата начала (проект)",
		,
		,
		ОграничениеИспользования);
	ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов, "ДатаЗавершенияПроект", "ДатаЗавершенияПроект",
		,
		,
		,
		,
		Оформление, "Дата завершения (проект)",
		,
		,
		ОграничениеИспользования);
		
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
			
		ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов, "ДатаНачалаПрогнозПроект", "ДатаНачалаПрогнозПроект",
			,
			,
			,
			,
			Оформление, "Дата начала, прогноз (проект)",
			,
			,
			ОграничениеИспользования);
		ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов, "ДатаЗавершенияПрогнозПроект", "ДатаЗавершенияПрогнозПроект",
			,
			,
			,
			,
			Оформление, "Дата завершения, прогноз (проект)",
			,
			,
			ОграничениеИспользования);   
			
	КонецЕсли;
	
	Группировки = Новый Массив;
	Группировки.Добавить("Проект");
	ДобавитьПолеРесурса(СКД, "ДатаНачалаПроект", "ДатаНачала", Группировки);
	ДобавитьПолеРесурса(СКД, "ДатаЗавершенияПроект", "ДатаЗавершения", Группировки);
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		ДобавитьПолеРесурса(СКД, "ДатаНачалаПрогнозПроект", "ДатаНачалаПрогноз", Группировки);
		ДобавитьПолеРесурса(СКД, "ДатаЗавершенияПрогнозПроект", "ДатаЗавершенияПрогноз", Группировки);
	КонецЕсли;
	
	ДобавитьСвязьНаборовДанных(СКД, ОсновнойНаборДанных, "СрокиПроектов", СтруктураНастроек.ИмяПоляПроект, "Проект");
	
КонецПроцедуры

Процедура ДобавитьНаборДанныхСрокиПроектаПоВерсии(СКД, ОсновнойНаборДанных, КоличествоВерсий, СтруктураНастроек)
	
	ИспользуютсяПрогнозныеСроки = упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков();
	
	Для НомерВерсии = 1 По КоличествоВерсий Цикл
		ИмяПоляДатаНачалаПоВерсии = "ДатаНачалаПоВерсии" + НомерВерсии;
		ИмяПоляДатаЗавершенияПоВерсии = "ДатаЗавершенияПоВерсии" + НомерВерсии;
		
		ИмяПоляДатаНачалаПрогнозПоВерсии = "ДатаНачалаПрогнозПоВерсии" + НомерВерсии;
		ИмяПоляДатаЗавершенияПрогнозПоВерсии = "ДатаЗавершенияПрогнозПоВерсии" + НомерВерсии;
		
		ИмяПоляДатаНачалаПроектаПоВерсии = "ДатаНачалаПоВерсииПроект" + НомерВерсии;
		ИмяПоляДатаЗавершенияПроектаПоВерсии = "ДатаЗавершенияПоВерсииПроект" + НомерВерсии;
		
		ИмяПоляДатаНачалаПроектаПрогнозПоВерсии = "ДатаНачалаПрогнозПоВерсииПроект" + НомерВерсии;
		ИмяПоляДатаЗавершенияПроектаПрогнозПоВерсии = "ДатаЗавершенияПрогнозПоВерсииПроект" + НомерВерсии;
		
		ТекстЗапросаСроковПроектовПоВерсии = ТекстЗапросаСроковПроектовПоВерсии();
		ТекстЗапросаСроковПроектовПоВерсии = СтрЗаменить(ТекстЗапросаСроковПроектовПоВерсии, "_Номер", НомерВерсии);
		
		НаборДанныхСрокиПроектов = ДобавитьНаборДанных(СКД, "СрокиПроектовПоВерсии" + НомерВерсии, "ИсточникДанных1",
			ТекстЗапросаСроковПроектовПоВерсии);
		
		Оформление = Новый Структура("ГоризонтальноеПоложение, Формат", ГоризонтальноеПоложение.Лево, ФорматПериодаДень());
		ОграничениеИспользования = НовоеОграничениеИспользованияПоля();
		ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов, "Проект", "Проект",
			Истина,
			Истина,
			Истина,
			Истина);
		ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов,
			ИмяПоляДатаНачалаПроектаПоВерсии, ИмяПоляДатаНачалаПроектаПоВерсии,
			,
			,
			,
			,
			Оформление, СтрШаблон("Дата начала по версии %1 (проект)", НомерВерсии),
			,
			,
			ОграничениеИспользования);
		ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов,
			ИмяПоляДатаЗавершенияПроектаПоВерсии, ИмяПоляДатаЗавершенияПроектаПоВерсии,
			,
			,
			,
			,
			Оформление, СтрШаблон("Дата завершения по версии %1 (проект)", НомерВерсии),
			,
			,
			ОграничениеИспользования);
		
		Если ИспользуютсяПрогнозныеСроки Тогда
			
			ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов,
				ИмяПоляДатаНачалаПроектаПрогнозПоВерсии, ИмяПоляДатаНачалаПроектаПрогнозПоВерсии,
				,
				,
				,
				,
				Оформление, СтрШаблон("Дата начала, прогноз, по версии %1 (проект)", НомерВерсии),
				,
				,
				ОграничениеИспользования);
			ДобавитьПолеКомпоновки(НаборДанныхСрокиПроектов,
				ИмяПоляДатаЗавершенияПроектаПрогнозПоВерсии, ИмяПоляДатаЗавершенияПроектаПрогнозПоВерсии,
				,
				,
				,
				,
				Оформление, СтрШаблон("Дата завершения, прогноз, по версии %1 (проект)", НомерВерсии),
				,
				,
				ОграничениеИспользования);
			
		КонецЕсли;
		
		Группировки = Новый Массив;
		Группировки.Добавить(СтруктураНастроек.ИмяПоляПроект);
		ДобавитьПолеРесурса(СКД, ИмяПоляДатаНачалаПроектаПоВерсии, ИмяПоляДатаНачалаПоВерсии, Группировки);
		ДобавитьПолеРесурса(СКД, ИмяПоляДатаЗавершенияПроектаПоВерсии, ИмяПоляДатаЗавершенияПоВерсии, Группировки);
		
		Если ИспользуютсяПрогнозныеСроки Тогда
			ДобавитьПолеРесурса(СКД, ИмяПоляДатаНачалаПроектаПрогнозПоВерсии, ИмяПоляДатаНачалаПрогнозПоВерсии, Группировки);
			ДобавитьПолеРесурса(СКД, ИмяПоляДатаЗавершенияПроектаПрогнозПоВерсии, ИмяПоляДатаЗавершенияПрогнозПоВерсии, Группировки);
		КонецЕсли;
		
		ДобавитьСвязьНаборовДанных(СКД, ОсновнойНаборДанных, "СрокиПроектовПоВерсии" + НомерВерсии, СтруктураНастроек.ИмяПоляПроект, "Проект");
	КонецЦикла;
	
КонецПроцедуры

Функция ПолеИспользуетсяВОтчете(Настройки, ИмяИскомоеПоле, МассивПользовательскихПолей = Неопределено)
	
	ИскомоеПоле = Новый ПолеКомпоновкиДанных(ИмяИскомоеПоле);
	Если МассивПользовательскихПолей = Неопределено Тогда
		МассивПользовательскихПолей = Новый Массив;
	КонецЕсли;	
	
	// выбранные поля
	Если ПолеИспользуетсяВВыбранныхПолях(Настройки.Выбор, ИскомоеПоле, МассивПользовательскихПолей) Тогда
		Возврат Истина;
	КонецЕсли;	
	
	// отбор
	Если ПолеИспользуетсяВОтборе(Настройки.Отбор, ИскомоеПоле, МассивПользовательскихПолей) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// оформление
	Если ПолеИспользуетсяВУсловномОформлении(Настройки.УсловноеОформление, ИскомоеПоле, МассивПользовательскихПолей) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// сортировка
	Если ПолеИспользуетсяВСортировке(Настройки.Порядок, ИскомоеПоле, МассивПользовательскихПолей) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// группировка
	Если ПолеИспользуетсяВСтруктуре(Настройки.Структура, ИскомоеПоле, МассивПользовательскихПолей) Тогда
		Возврат Истина;
	КонецЕсли;	
	
	// пользовательские поля
	Если МассивПользовательскихПолей.Количество() > 0 Тогда
		Если ПолеИспользуетсяВПользовательскихПолях(Настройки.ПользовательскиеПоля.Элементы, 
				ИскомоеПоле, ИмяИскомоеПоле, МассивПользовательскихПолей) Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

Функция ПолеИспользуетсяВВыбранныхПолях(ПоляВыбора, ИскомоеПоле, МассивПользовательскихПолей)
	
	Для каждого ПолеВыбора Из ПоляВыбора.Элементы Цикл
		Если Не ПолеВыбора.Использование Тогда
			Продолжить;
		КонецЕсли;	
		Если ТипЗнч(ПолеВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			Если ПолеВыбора.Поле = ИскомоеПоле Тогда
				Возврат Истина;
			КонецЕсли;
			ПолеПутьКДанным = Строка(ПолеВыбора.Поле);
			Если СтрНайти(ПолеПутьКДанным, "ПользовательскиеПоля.") <> 0 
				И МассивПользовательскихПолей.Найти(ПолеПутьКДанным) = Неопределено Тогда
				МассивПользовательскихПолей.Добавить(ПолеПутьКДанным);
			КонецЕсли;	
		ИначеЕсли ТипЗнч(ПолеВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Если ПолеИспользуетсяВВыбранныхПолях(ПолеВыбора, ИскомоеПоле, МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Ложь; 
	
КонецФункции

Функция ПолеИспользуетсяВОтборе(ПоляОтбора, ИскомоеПоле, МассивПользовательскихПолей)
	
	Для каждого ПолеОтбор Из ПоляОтбора.Элементы Цикл
		Если Не ПолеОтбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ПолеОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
			Если ПолеОтбор.ЛевоеЗначение = ИскомоеПоле Тогда
				Возврат Истина;
			Иначе	
				ПолеПутьКДанным = Строка(ПолеОтбор.ЛевоеЗначение);
				Если СтрНайти(ПолеПутьКДанным, "ПользовательскиеПоля.") <> 0 
					И МассивПользовательскихПолей.Найти(ПолеПутьКДанным) = Неопределено Тогда
					МассивПользовательскихПолей.Добавить(ПолеПутьКДанным);
				КонецЕсли;
			КонецЕсли;	
		ИначеЕсли ТипЗнч(ПолеОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Если ПолеИспользуетсяВОтборе(ПолеОтбор, ИскомоеПоле, МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолеИспользуетсяВУсловномОформлении(ПоляУсловногоОформления, ИскомоеПоле, МассивПользовательскихПолей)
	
	Для каждого ПолеУО Из ПоляУсловногоОформления.Элементы Цикл
		Если Не ПолеУО.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если ПолеИспользуетсяВОтборе(ПолеУО.Отбор, ИскомоеПоле, МассивПользовательскихПолей) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолеИспользуетсяВСортировке(ПоляПорядка, ИскомоеПоле, МассивПользовательскихПолей)
	
	Для каждого ПолеПорядка Из ПоляПорядка.Элементы Цикл
		Если Не ПолеПорядка.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если ПолеПорядка.Поле = ИскомоеПоле Тогда
			Возврат Истина;
		КонецЕсли;	
		ПолеПутьКДанным = Строка(ПолеПорядка.Поле);
		Если СтрНайти(ПолеПутьКДанным, "ПользовательскиеПоля.") <> 0 
			И МассивПользовательскихПолей.Найти(ПолеПутьКДанным) = Неопределено Тогда
			МассивПользовательскихПолей.Добавить(ПолеПутьКДанным);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолеИспользуетсяВСтруктуре(ЭлементыСтруктуры, ИскомоеПоле, МассивПользовательскихПолей)
	
	Для каждого ЭлементСтруктуры Из ЭлементыСтруктуры Цикл
		
		Если Не ЭлементСтруктуры.Использование Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") 
			Или ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаТаблицыКомпоновкиДанных") 
			Или ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
			
			Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				Если Не ПолеГруппировки.Использование Тогда
					Продолжить;
				КонецЕсли;
				Если ПолеГруппировки.Поле = ИскомоеПоле Тогда
					Возврат Истина;
				КонецЕсли;
				ПолеПутьКДанным = Строка(ПолеГруппировки.Поле);
				Если СтрНайти(ПолеПутьКДанным, "ПользовательскиеПоля.") <> 0 
					И МассивПользовательскихПолей.Найти(ПолеПутьКДанным) = Неопределено Тогда
					МассивПользовательскихПолей.Добавить(ПолеПутьКДанным);
				КонецЕсли;	
			КонецЦикла;
			
			Если ПолеИспользуетсяВСтруктуре(ЭлементСтруктуры.Структура, ИскомоеПоле, МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;	
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			
			Если ПолеИспользуетсяВСтруктуре(ЭлементСтруктуры.Строки, ИскомоеПоле, МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;	
			Если ПолеИспользуетсяВСтруктуре(ЭлементСтруктуры.Колонки, ИскомоеПоле, МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;	
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			
			Если ПолеИспользуетсяВСтруктуре(ЭлементСтруктуры.Серии, ИскомоеПоле, МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;	
			Если ПолеИспользуетсяВСтруктуре(ЭлементСтруктуры.Точки, ИскомоеПоле, МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
			
			Если ПолеИспользуетсяВОтчете(ЭлементСтруктуры.Настройки, Строка(ИскомоеПоле), МассивПользовательскихПолей) Тогда
				Возврат Истина;
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции	

Функция ПолеИспользуетсяВПользовательскихПолях(ПользовательскиеПоля, ИскомоеПоле, ИмяИскомоеПоле, МассивПользовательскихПолей)
	
	Для Каждого ПользовательскоеПоле Из ПользовательскиеПоля Цикл
		Если МассивПользовательскихПолей.Найти(ПользовательскоеПоле.ПутьКДанным) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ПользовательскоеПоле) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ТекстВыраженияДетальныхЗаписей = ПользовательскоеПоле.ПолучитьВыражениеДетальныхЗаписей();
			Если СтрНайти(ТекстВыраженияДетальныхЗаписей, ИмяИскомоеПоле) > 0 Тогда 
				Возврат Истина;
			КонецЕсли;	
			ТекстВыраженияИтоговыхЗаписей = ПользовательскоеПоле.ПолучитьВыражениеИтоговыхЗаписей();
			Если СтрНайти(ТекстВыраженияИтоговыхЗаписей, ИмяИскомоеПоле) > 0 Тогда 
				Возврат Истина;
			КонецЕсли;	
		Иначе 	
			Для Каждого ЭлементПользовательскоеПоле Из ПользовательскоеПоле.Варианты.Элементы Цикл
				Если Не ЭлементПользовательскоеПоле.Использование Тогда
					Продолжить;
				КонецЕсли;
				Если ПолеИспользуетсяВОтборе(ЭлементПользовательскоеПоле.Отбор, ИскомоеПоле, Новый Массив) Тогда
					Возврат Истина;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Функция ПолучитьПредставлениеПроектнойЗадачиНеЯвляетсяЗадачейВыбранныхВерсий()
	
	Возврат НСтр("ru = '(В выбранной версии проекта задача отсутствует)'");
	
КонецФункции

Процедура ОбработатьЗаголовкиПолейСВерсиями(СтруктураНастроек, ОсновнаяСхемаКомпоновкиДанных, Настройки)
    
    СтруктураПараметров = Новый Структура();
    Для каждого Элемент Из Настройки.ПараметрыДанных.Элементы Цикл
        
        ИмяПараметра = Строка(Элемент.Параметр);
        ЗначениеПараметра = Элемент.Значение;
        
        Если (ИмяПараметра = "Версия1" ИЛИ ИмяПараметра = "Версия2") 
            И ЗначениеЗаполнено(ЗначениеПараметра)
            И (ТипЗнч(ЗначениеПараметра) = Тип("ДокументСсылка.упоВерсияПланаПроекта") 
                ИЛИ ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.упоСценарии")) Тогда
            СтруктураПараметров.Вставить(ИмяПараметра, ЗначениеПараметра);   	        
        КонецЕсли;
        
    КонецЦикла; 

    КоличествоУказанныхВерсий = СтруктураПараметров.Количество(); 
    
    Если КоличествоУказанныхВерсий = 0 Тогда
        Возврат;	
    КонецЕсли;
    
    Для Версия = 1 По КоличествоУказанныхВерсий Цикл
        ВерсияСсылка = СтруктураПараметров["Версия" + Версия]; 
        НаименованиеВерсии = ?(ТипЗнч(ВерсияСсылка) = Тип("ДокументСсылка.упоВерсияПланаПроекта"),
            упоВерсионирование.ПолучитьНаименованиеВерсии(ВерсияСсылка), ВерсияСсылка.Наименование);
        СтруктураПараметров.Вставить("НаименованиеВерсии" + Версия, НаименованиеВерсии);   	        
    КонецЦикла;
           
    ОбработатьЗаголовкиПолейГруппировокРекурсивно(
        Настройки.Выбор.Элементы, СтруктураПараметров);
        
    ОсновнойНаборДанных = Неопределено;
    ИмяНабораДанных = Неопределено;
    Если СтруктураНастроек.Свойство("ИмяНабораДанных", ИмяНабораДанных) Тогда
        ОсновнойНаборДанных = ОсновнаяСхемаКомпоновкиДанных.НаборыДанных.Найти(ИмяНабораДанных);
    КонецЕсли;
    
    Если ОсновнойНаборДанных <> Неопределено Тогда
        ОбработатьЗаголовкиКоллекцииПолей(СтруктураНастроек, 
            ОсновнойНаборДанных.Поля, СтруктураПараметров);    
    КонецЕсли;
        
    ОбработатьЗаголовкиКоллекцииПолей(СтруктураНастроек, 
        ОсновнаяСхемаКомпоновкиДанных.ВычисляемыеПоля, СтруктураПараметров);
        
    СрокиПоВерсиям = Неопределено;
    СтруктураНастроек.Свойство("СрокиПоВерсиям", СрокиПоВерсиям); 
    СрокиПоВерсиям = ?(СрокиПоВерсиям = Неопределено, 0, СрокиПоВерсиям);
    Если СрокиПоВерсиям <> 0 Тогда
        Для Версия = 1 По СрокиПоВерсиям Цикл
            ИмяНабораДанных = "СрокиПоВерсии" + Версия;
            
            ОбработатьЗаголовкиКоллекцииПолей(СтруктураНастроек, 
                ОсновнаяСхемаКомпоновкиДанных.НаборыДанных[ИмяНабораДанных].Поля, СтруктураПараметров);
        КонецЦикла;
    КонецЕсли;        
            
КонецПроцедуры

Процедура ВыполнитьЗаменуТекста(Поле, Параметры)
    
    ЗаголовокПоля = Поле.Заголовок;
         
    Если Параметры.Свойство("Версия1") И СтрНайти(ЗаголовокПоля, НСтр("ru = 'по версии 1'")) Тогда
        ЗаголовокПоля = СтрЗаменить(ЗаголовокПоля, "по версии 1", "(%1)");	
        Поле.Заголовок = СтрШаблон(ЗаголовокПоля, Параметры.НаименованиеВерсии1);
    ИначеЕсли Параметры.Свойство("Версия2") И СтрНайти(ЗаголовокПоля, НСтр("ru = 'по версии 2'")) Тогда 
        ЗаголовокПоля = СтрЗаменить(ЗаголовокПоля, "по версии 2", "(%1)");	
        Поле.Заголовок = СтрШаблон(ЗаголовокПоля, Параметры.НаименованиеВерсии2);
    КонецЕсли;

КонецПроцедуры

Процедура ОбработатьЗаголовкиКоллекцииПолей(СтруктураНастроек, КоллекцияПолей, Параметры)

    ПоляСВерсиями = Неопределено;
    
    Если Не СтруктураНастроек.Свойство("ПоляСВерсиями", ПоляСВерсиями) Тогда
        Возврат;	
    КонецЕсли; 
            
    Для каждого НаименованиеПоля Из ПоляСВерсиями Цикл
    
        Поле = КоллекцияПолей.Найти(НаименованиеПоля);
        
        Если Поле = Неопределено Тогда
            Продолжить;	
        КонецЕсли;
        
        ВыполнитьЗаменуТекста(Поле, Параметры);
        
    КонецЦикла;

КонецПроцедуры

Процедура ОбработатьЗаголовкиПолейГруппировокРекурсивно(КоллекцияГруппВыбранныхПолей, Параметры)
    
    Для каждого Группа Из КоллекцияГруппВыбранныхПолей Цикл
        
        Если ТипЗнч(Группа) <> Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
            Продолжить;	
        КонецЕсли;
        
        Если Группа.Элементы.Количество() Тогда
            ОбработатьЗаголовкиПолейГруппировокРекурсивно(Группа.Элементы, Параметры);    	
        КонецЕсли;
        
        ВыполнитьЗаменуТекста(Группа, Параметры);
        
    КонецЦикла;

КонецПроцедуры

Функция НовоеОграничениеИспользованияПоля()
	
	ОграничениеИспользования = Новый Структура;
	ОграничениеИспользования.Вставить("Группировка", Истина);
	ОграничениеИспользования.Вставить("Поле", Истина);
	ОграничениеИспользования.Вставить("Порядок", Истина);
	ОграничениеИспользования.Вставить("Условие", Истина);
	
	Возврат ОграничениеИспользования;
	
КонецФункции

Функция ТекстЗапросаПричиныОтклонений()
			
	ТекстЗапросаПричинОтклонения = "ВЫБРАТЬ
	                               |	упоПричиныОтклоненийСрезПоследних.Версия КАК Версия,
	                               |	упоПричиныОтклоненийСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                               |	упоПричиныОтклоненийСрезПоследних.Пользователь КАК Пользователь,
	                               |	упоПричиныОтклоненийСрезПоследних.Сотрудник КАК Сотрудник,
	                               |	упоПричиныОтклоненийСрезПоследних.АвторИзменений КАК АвторИзменений,
	                               |	упоПричиныОтклоненийСрезПоследних.ДатаИзменений КАК ДатаИзменений,
	                               |	упоПричиныОтклоненийСрезПоследних.Комментарий КАК Комментарий,
	                               |	упоПричиныОтклоненийСрезПоследних.Причина КАК Причина,
	                               |	упоПричиныОтклоненийСрезПоследних.Отмена КАК Отмена
	                               |ИЗ
	                               |	РегистрСведений.упоПричиныОтклонений.СрезПоследних(
	                               |			,
	                               |			Версия = &текВерсия
	                               |				И ПроектнаяЗадача = &Ссылка) КАК упоПричиныОтклоненийСрезПоследних
	                               |ГДЕ
	                               |	НЕ упоПричиныОтклоненийСрезПоследних.Отмена
	                               |
	                               |УПОРЯДОЧИТЬ ПО
	                               |	ДатаИзменений УБЫВ";
	
	Возврат ТекстЗапросаПричинОтклонения;	
		
КонецФункции // 

Функция ТекстЗапросаВерсииПоНомеру()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    упоВерсииПроекта.Версия КАК Версия
		|ИЗ
		|    РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|ГДЕ
		|    упоВерсииПроекта.Версия = &Версия_Номер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|    упоСценарииВерсий.Версия
		|ИЗ
		|    РегистрСведений.упоСценарииВерсий КАК упоСценарииВерсий
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|        ПО упоСценарииВерсий.Версия = упоВерсииПроекта.Версия
		|ГДЕ
		|    упоСценарииВерсий.Сценарий = &Версия_Номер";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСроковПроектовПоВерсии()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    упоВерсииПроекта.Версия КАК Версия
		|ПОМЕСТИТЬ ВТ_Версии
		|ИЗ
		|    РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|ГДЕ
		|    упоВерсииПроекта.Версия = &Версия_Номер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|    упоСценарииВерсий.Версия
		|ИЗ
		|    РегистрСведений.упоСценарииВерсий КАК упоСценарииВерсий
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|        ПО упоСценарииВерсий.Версия = упоВерсииПроекта.Версия
		|ГДЕ
		|    упоСценарииВерсий.Сценарий = &Версия_Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    Сроки.Версия.Проект КАК Проект,
		|    МИНИМУМ(НАЧАЛОПЕРИОДА(Сроки.ДатаНачалаПлан, ДЕНЬ)) КАК ДатаНачалаПоВерсииПроект_Номер,
		|    МАКСИМУМ(НАЧАЛОПЕРИОДА(Сроки.ДатаЗавершенияПлан, ДЕНЬ)) КАК ДатаЗавершенияПоВерсииПроект_Номер,
		|    Сроки.Версия КАК Версия
		|ПОМЕСТИТЬ ВТ_ПлановыеСроки
		|ИЗ
		|    РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		|            {(НЕОПРЕДЕЛЕНО) КАК Поле2},
		|            Версия В
		|                (ВЫБРАТЬ
		|                    ВТ_Версии.Версия КАК Версия
		|                ИЗ
		|                    ВТ_Версии КАК ВТ_Версии) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК Сроки
		|{ГДЕ
		|    Сроки.ПроектнаяЗадача.Проект.* КАК Проект}
		|
		|СГРУППИРОВАТЬ ПО
		|    Сроки.Версия,
		|    Сроки.ПроектнаяЗадача.Проект,
		|    Сроки.Версия.Проект
		|;
		|
		| //#ТекстЗапроса_ПрогнозныеСроки#
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВТ_ПлановыеСроки.Проект КАК Проект,
		|    ВТ_ПлановыеСроки.ДатаНачалаПоВерсииПроект_Номер КАК ДатаНачалаПоВерсииПроект_Номер,
		|    ВТ_ПлановыеСроки.ДатаЗавершенияПоВерсииПроект_Номер КАК ДатаЗавершенияПоВерсииПроект_Номер,
		|    ВТ_ПлановыеСроки.Версия КАК Версия
		|    //#Поля_ПрогнозныеСроки#
		|ИЗ
		|    ВТ_ПлановыеСроки КАК ВТ_ПлановыеСроки
		|        //#Соединение_ПрогнозныеСроки#";
	
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков() Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//#ТекстЗапроса_ПрогнозныеСроки#",
			"////////////////////////////////////////////////////////////////////////////////
			 |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |    ПрогнозныеСроки.Версия.Проект КАК Проект,
			 |    МИНИМУМ(НАЧАЛОПЕРИОДА(ПрогнозныеСроки.ДатаНачалаПрогноз, ДЕНЬ)) КАК ДатаНачалаПрогноз,
			 |    МАКСИМУМ(НАЧАЛОПЕРИОДА(ПрогнозныеСроки.ДатаЗавершенияПрогноз, ДЕНЬ)) КАК ДатаЗавершенияПрогноз,
			 |    ПрогнозныеСроки.Версия КАК Версия
			 |ПОМЕСТИТЬ ВТ_ПрогнозныеСроки
			 |ИЗ
			 |    РегистрСведений.упоПрогнозныеСрокиПроектныхЗадач.СрезПоследних(
			 |            {(НЕОПРЕДЕЛЕНО) КАК Поле2},
			 |            Версия В
			 |                (ВЫБРАТЬ
			 |                    ВТ_Версии.Версия КАК Версия
			 |                ИЗ
			 |                    ВТ_Версии КАК ВТ_Версии) {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК ПрогнозныеСроки
			 |ГДЕ
			 |    (ПрогнозныеСроки.ДатаНачалаПрогноз <> ДАТАВРЕМЯ(1, 1, 1)
			 |            ИЛИ ПрогнозныеСроки.ДатаЗавершенияПрогноз <> ДАТАВРЕМЯ(1, 1, 1))
			 |
			 |СГРУППИРОВАТЬ ПО
			 |    ПрогнозныеСроки.Версия,
			 |    ПрогнозныеСроки.ПроектнаяЗадача.Проект,
			 |    ПрогнозныеСроки.Версия.Проект
			 |;");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//#Поля_ПрогнозныеСроки#",  
			"    , ВТ_ПрогнозныеСроки.ДатаНачалаПрогноз КАК ДатаНачалаПрогнозПоВерсииПроект_Номер
			|    , ВТ_ПрогнозныеСроки.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогнозПоВерсииПроект_Номер"); 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//#Соединение_ПрогнозныеСроки#",  
			"        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрогнозныеСроки КАК ВТ_ПрогнозныеСроки
			|        ПО ВТ_ПлановыеСроки.Версия = ВТ_ПрогнозныеСроки.Версия");
		
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДополнитьОтборКомпоновщикаРекурсивно(ЭлементыОтбораИсточника, КопируемыеЭлементыОтбора, ПоляИсключения)
	
	ЕстьОтбор = Ложь;
	Для Каждого Стр Из КопируемыеЭлементыОтбора Цикл
		Если Стр.Использование Тогда
			ЕстьОтбор = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОтбор Тогда
		Для Каждого ЭлементОтбор Из ЭлементыОтбораИсточника Цикл
			Если НЕ ТипЗнч(ЭлементОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				Если (ЭлементОтбор.Использование И Строка(ЭлементОтбор.ЛевоеЗначение) = "Проект") Тогда
					ЭлементОтбор.Использование = Ложь;
				КонецЕсли;
			Иначе
				ЭлементОтбор.Использование = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого КопируемыйЭлементОтбора Из КопируемыеЭлементыОтбора Цикл
		Если ПоляИсключения.Найти(КопируемыйЭлементОтбора.ЛевоеЗначение) = Неопределено Тогда
			ТипДобавляемогоЭлемента = ТипЗнч(КопируемыйЭлементОтбора);
			ЭлементОтбора = ЭлементыОтбораИсточника.Добавить(ТипДобавляемогоЭлемента);
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, КопируемыйЭлементОтбора);
		КонецЕсли;
		
		Если ТипДобавляемогоЭлемента = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ДополнитьОтборКомпоновщикаРекурсивно(ЭлементОтбора.Элементы, КопируемыйЭлементОтбора.Элементы, ПоляИсключения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Имена полей сроков проектных задач.
//
// Параметры:
//  НастройкиОбъектаОтчета   - Структура - см. метод ПолучитьНастройкиОтчета() модуля объекта отчета.
// 
// Возвращаемое значение:
//  Массив из Строка
//
Функция ИменаПолейСроковПроектныхЗадач(НастройкиОбъектаОтчета)
	
	ИменаКолонок = Новый Массив;
	
	НуженРасчетСроковПЗ = НастройкиОбъектаОтчета.Свойство("ИмяПоляПЗ")
		И НастройкиОбъектаОтчета.Свойство("Сроки");
	НуженРасчетСроковФактПЗ = НастройкиОбъектаОтчета.Свойство("ИмяПоляПЗ")
		И НастройкиОбъектаОтчета.Свойство("СрокиФакт");
	НуженРасчетСроковПоВерсии = НастройкиОбъектаОтчета.Свойство("ИмяПоляПЗ")
		И НастройкиОбъектаОтчета.Свойство("ВыборВерсии");
	
	ИспользуютсяПрогнозныеСроки = упоИнтеграцияКлиентСервер.ДоступенФункционалПрогнозныхСроков();
	
	Если НуженРасчетСроковПЗ Тогда
		ИменаКолонок.Добавить("ДатаНачала");
		ИменаКолонок.Добавить("ДатаЗавершения");
		Если ИспользуютсяПрогнозныеСроки Тогда
			ИменаКолонок.Добавить("ДатаНачалаПрогноз");
			ИменаКолонок.Добавить("ДатаЗавершенияПрогноз");
		КонецЕсли;
	КонецЕсли;
	
	Если НуженРасчетСроковФактПЗ Тогда
		ИменаКолонок.Добавить("ДатаНачалаФакт");
		ИменаКолонок.Добавить("ДатаЗавершенияФакт");
	КонецЕсли;
	
	Если НуженРасчетСроковПоВерсии Тогда
		КоличествоВерсий = НастройкиОбъектаОтчета.ВыборВерсии.СрокиПоВерсиям;
		Для НомерВерсии = 1 По КоличествоВерсий Цикл
			ИменаКолонок.Добавить("ДатаНачалаПоВерсии" + НомерВерсии);
			ИменаКолонок.Добавить("ДатаЗавершенияПоВерсии" + НомерВерсии);
			Если ИспользуютсяПрогнозныеСроки Тогда
				ИменаКолонок.Добавить("ДатаНачалаПрогнозПоВерсии" + НомерВерсии);
				ИменаКолонок.Добавить("ДатаЗавершенияПрогнозПоВерсии" + НомерВерсии);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИменаКолонок;
	
КонецФункции

Процедура ЗаполнитьСписокВыбранныхПолей(ЗаполняемыйСписок, ВыбранныеПоля, ВыбранныеПоляВерхнийУровень, ИсключаяНеиспользуемые = Ложь) Экспорт
	
	Для Каждого ВыбранноеПоле Из ВыбранныеПоля Цикл
		Если ТипЗнч(ВыбранноеПоле) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			Если ИсключаяНеиспользуемые И ВыбранноеПоле.Использование Тогда
				ЗаполняемыйСписок.Вставить(ВыбранноеПоле.Поле, ВыбранныеПоляВерхнийУровень.Индекс(ВыбранноеПоле));
			ИначеЕсли Не ИсключаяНеиспользуемые Тогда
				ЗаполняемыйСписок.Вставить(ВыбранноеПоле.Поле, ВыбранныеПоляВерхнийУровень.Индекс(ВыбранноеПоле));
			КонецЕсли;
		ИначеЕсли ТипЗнч(ВыбранноеПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ЗаполнитьСписокВыбранныхПолей(ЗаполняемыйСписок, ВыбранноеПоле.Элементы, ВыбранныеПоляВерхнийУровень, ИсключаяНеиспользуемые);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьВыборПолейДополнительнойИнформации(НастройкиКомпоновкиДанных, НастройкиОбъектаОтчета)
	
	ТаблицаСодержащаяОсновныеНастройки = ТаблицаСодержащаяОсновныеНастройки(НастройкиКомпоновкиДанных);
	Если ТаблицаСодержащаяОсновныеНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеПоляОтчета = Новый Соответствие;
	ВыбранныеПоляОтчетаНастройкиКомпоновки = НастройкиКомпоновкиДанных.Выбор.Элементы;
	ИсключаяНеиспользуемые = Истина;
	ЗаполнитьСписокВыбранныхПолей(ВыбранныеПоляОтчета, ВыбранныеПоляОтчетаНастройкиКомпоновки,
		ВыбранныеПоляОтчетаНастройкиКомпоновки, ИсключаяНеиспользуемые);
	
	ОсновныеКолонкиТаблицы = ТаблицаСодержащаяОсновныеНастройки.Колонки;
	ИменаПолейДляВыводаВДопИнформацию = ИменаПолейСроковПроектныхЗадач(НастройкиОбъектаОтчета);
	Для Каждого Колонка Из ОсновныеКолонкиТаблицы Цикл
		ПараметрНастройки = Колонка.ПараметрыВывода.Элементы.Найти("Заголовок");
		Если Не (ПараметрНастройки <> Неопределено И ПараметрНастройки.Значение = "ДополнительнаяИнформацияСроки") Тогда
			Продолжить;
		КонецЕсли;
		
		ВыбранныеПоляДопИнформации = Новый Соответствие;
		ВыбранныеПоляДопИнформацииНастройкиКомпоновки = Колонка.Выбор.Элементы;
		ЗаполнитьСписокВыбранныхПолей(ВыбранныеПоляДопИнформации, ВыбранныеПоляДопИнформацииНастройкиКомпоновки,
			ВыбранныеПоляДопИнформацииНастройкиКомпоновки);
		
		// Найдем поле сроков в колонке. Если есть, то отключаем использование. Иначе создаем и отключаем.
		БылаВключенаХотяБыОднаКолонка = Ложь;
		Для Каждого ИмяПоля Из ИменаПолейДляВыводаВДопИнформацию Цикл
			ИскомоеПолеВВыбранныхПоляхОтчета = Новый ПолеКомпоновкиДанных(ИмяПоля);
			ИндексНайденногоПоля = ВыбранныеПоляОтчета.Получить(ИскомоеПолеВВыбранныхПоляхОтчета);
			
			ИскомоеПолеВДопИнформации = Новый ПолеКомпоновкиДанных(ИмяПоля);
			ИндексНайденногоПоляВДопИнформации = ВыбранныеПоляДопИнформации.Получить(ИскомоеПолеВДопИнформации);
			Если ИндексНайденногоПоляВДопИнформации <> Неопределено Тогда
				Использование = ИндексНайденногоПоля <> Неопределено;
				ВыбранныеПоляДопИнформацииНастройкиКомпоновки[ИндексНайденногоПоляВДопИнформации].Использование =
					Использование;
				Если Использование И Не БылаВключенаХотяБыОднаКолонка Тогда
					БылаВключенаХотяБыОднаКолонка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Колонка.Использование = БылаВключенаХотяБыОднаКолонка;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьГруппировкуДопИнформации(КоллекцияГруппировокДляРазмещения, ИменаДобавляемыхПолей, ДобавитьВКонец = Ложь)
	
	Если ДобавитьВКонец Тогда
		ДополнительнаяИнформация = КоллекцияГруппировокДляРазмещения.Добавить();
		ДополнительнаяИнформация.Имя = "ДополнительнаяИнформацияСроки";
	Иначе
		ДополнительнаяИнформация = КоллекцияГруппировокДляРазмещения.Вставить(0);
		ДополнительнаяИнформация.Имя = "ДополнительнаяИнформацияСроки";
	КонецЕсли;
	
	ВариантИспользования = ДополнительнаяИнформация.ПараметрыВывода.Элементы.Найти("ВариантИспользованияГруппировки");
	ВариантИспользования.Использование = Истина;
	ВариантИспользования.Значение = ВариантИспользованияГруппировкиКомпоновкиДанных.ДополнительнаяИнформация;
	
	Для Каждого ИмяПоля Из ИменаДобавляемыхПолей Цикл
		НовоеПоле = ДополнительнаяИнформация.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		НовоеПоле.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаСодержащаяОсновныеНастройки(НастройкиКомпоновкиДанных)
	
	ТаблицаСодержащаяОсновныеНастройки = Неопределено;
	
	Для Каждого ЭлементСтруктуры Из НастройкиКомпоновкиДанных.Структура Цикл
		Если ЭлементСтруктуры.Имя = "Основная таблица" Тогда
			ТаблицаСодержащаяОсновныеНастройки = ЭлементСтруктуры;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаСодержащаяОсновныеНастройки;
	
КонецФункции

Функция ФорматПериодаДень()
	
	Возврат "ДФ='dd.MM.yyyy'";
	
КонецФункции

Функция ФорматПериодаМесяц()
	
	Возврат "ДФ='ММMM yyyy'";
	
КонецФункции

Функция ФорматПериодаГод()
	
	Возврат "ДФ='yyyy'";
	
КонецФункции

Функция ФорматПериодаКвартал()
	
	СтрокаПояснения = НСтр("ru = 'кв.'");
	Возврат СтрШаблон("ДФ='к ''%1'' yyyy'", СтрокаПояснения);
	
КонецФункции

Функция ФорматПериодаНеделя()
	
	СтрокаПояснения = НСтр("ru = 'неделя '");
	Возврат СтрШаблон("ДФ=""'%1' dd.MM.yyyy""", СтрокаПояснения);
	
КонецФункции

Функция ТекстЗапросаДляПолученияПоказателейОтставания()

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Проекты.Ссылка КАК ПроектнаяЗадача,
		|	ВЫБОР
		|		КОГДА НЕ упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности
		|		КОГДА упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|				И НЕ Проекты.упоКорневойПроект.упоЕдиницаВремениПоУмолчанию = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА Проекты.упоКорневойПроект.упоЕдиницаВремениПоУмолчанию
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.РабочийДень)
		|	КОНЕЦ КАК ЕдиницаНормированияДлительности,
		|	ВЫБОР
		|		КОГДА НЕ упоСвойстваПроектныхЗадач.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|			ТОГДА упоСвойстваПроектныхЗадач.КалендарьЗадачи
		|		КОГДА упоСвойстваПроектныхЗадач.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|				И НЕ КалендариПроектов.КалендарьПроекта = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|			ТОГДА КалендариПроектов.КалендарьПроекта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|	КОНЕЦ КАК Календарь,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиБП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА НАЧАЛОПЕРИОДА(СрокиБП.ДатаЗавершенияПлан, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ)
		|	КОНЕЦ КАК Дата1,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиБП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(СрокиБП.ДатаЗавершенияПлан, ДЕНЬ)
		|	КОНЕЦ КАК Дата2,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиБП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК ЗнакОтклонения,
		|	упоСвойстваПроектныхЗадач.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта
		|ПОМЕСТИТЬ ВТ_ЗадачиБП
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
		|		ПО (Версии.Версия = упоСвойстваПроектныхЗадач.Версия)
		|			И (Версии.Текущая)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК СрокиБП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииБП
		|			ПО (ВерсииБП.Версия = СрокиБП.Версия)
		|				И (ВерсииБП.Базовая)
		|		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = СрокиБП.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК КалендариПроектов
		|		ПО (КалендариПроектов.Проект = Проекты.упоКорневойПроект)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК СтатусыПЗ
		|		ПО (СтатусыПЗ.Версия = упоСвойстваПроектныхЗадач.Версия)
		|			И (СтатусыПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадач.ПроектнаяЗадача)
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) <> НАЧАЛОПЕРИОДА(СрокиБП.ДатаЗавершенияПлан, ДЕНЬ)
		|	И НЕ СрокиБП.ДатаЗавершенияПлан = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ СтатусыПЗ.СтатусЗадачи В (ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена), ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Закрыта))
		|	И НЕ упоСвойстваПроектныхЗадач.ЗадачаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА упоРабочиеКалендариСрезПоследних.День МЕЖДУ ВТ_ЗадачиБП.Дата1 И ВТ_ЗадачиБП.Дата2
		|				ТОГДА упоРабочиеКалендариСрезПоследних.КоличествоЧасов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоЧасов,
		|	ВТ_ЗадачиБП.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ЗадачиБП.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
		|	ВТ_ЗадачиБП.Календарь КАК Календарь,
		|	ВТ_ЗадачиБП.Дата1 КАК Дата1,
		|	ВТ_ЗадачиБП.Дата2 КАК Дата2,
		|	ВТ_ЗадачиБП.ЗнакОтклонения КАК ЗнакОтклонения,
		|	ВТ_ЗадачиБП.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта
		|ПОМЕСТИТЬ ВТ_ЗадачиБПСЧасами
		|ИЗ
		|	ВТ_ЗадачиБП КАК ВТ_ЗадачиБП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
		|		ПО ВТ_ЗадачиБП.Календарь = упоРабочиеКалендариСрезПоследних.Календарь
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗадачиБП.ЕдиницаНормированияДлительности,
		|	ВТ_ЗадачиБП.Дата1,
		|	ВТ_ЗадачиБП.Дата2,
		|	ВТ_ЗадачиБП.ЗнакОтклонения,
		|	ВТ_ЗадачиБП.ДлительностьБезУчетаКалендаряПроекта,
		|	ВТ_ЗадачиБП.ПроектнаяЗадача,
		|	ВТ_ЗадачиБП.Календарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Проекты.Ссылка КАК ПроектнаяЗадача,
		|	ВЫБОР
		|		КОГДА НЕ упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности
		|		КОГДА упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|				И НЕ Проекты.упоКорневойПроект.упоЕдиницаВремениПоУмолчанию = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА Проекты.упоКорневойПроект.упоЕдиницаВремениПоУмолчанию
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.РабочийДень)
		|	КОНЕЦ КАК ЕдиницаНормированияДлительности,
		|	ВЫБОР
		|		КОГДА НЕ упоСвойстваПроектныхЗадач.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|			ТОГДА упоСвойстваПроектныхЗадач.КалендарьЗадачи
		|		КОГДА упоСвойстваПроектныхЗадач.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|				И НЕ КалендариПроектов.КалендарьПроекта = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|			ТОГДА КалендариПроектов.КалендарьПроекта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|	КОНЕЦ КАК Календарь,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиТП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА НАЧАЛОПЕРИОДА(СрокиТП.ДатаЗавершенияПлан, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ)
		|	КОНЕЦ КАК Дата1,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиТП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(СрокиТП.ДатаЗавершенияПлан, ДЕНЬ)
		|	КОНЕЦ КАК Дата2,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиТП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК ЗнакОтклонения,
		|	упоСвойстваПроектныхЗадач.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта
		|ПОМЕСТИТЬ ВТ_ЗадачиТП
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
		|		ПО (Версии.Версия = упоСвойстваПроектныхЗадач.Версия)
		|			И (Версии.Текущая)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК СрокиТП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииТП
		|			ПО (ВерсииТП.Версия = СрокиТП.Версия)
		|				И (ВерсииТП.Текущая)
		|		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = СрокиТП.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК КалендариПроектов
		|		ПО (КалендариПроектов.Проект = Проекты.упоКорневойПроект)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК СтатусыПЗ
		|		ПО (СтатусыПЗ.Версия = упоСвойстваПроектныхЗадач.Версия)
		|			И (СтатусыПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадач.ПроектнаяЗадача)
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) <> НАЧАЛОПЕРИОДА(СрокиТП.ДатаЗавершенияПлан, ДЕНЬ)
		|	И НЕ СрокиТП.ДатаЗавершенияПлан = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ СтатусыПЗ.СтатусЗадачи В (ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена), ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Закрыта))
		|	И НЕ упоСвойстваПроектныхЗадач.ЗадачаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА упоРабочиеКалендариСрезПоследних.День МЕЖДУ ВТ_ЗадачиТП.Дата1 И ВТ_ЗадачиТП.Дата2
		|				ТОГДА упоРабочиеКалендариСрезПоследних.КоличествоЧасов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоЧасов,
		|	ВТ_ЗадачиТП.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ЗадачиТП.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
		|	ВТ_ЗадачиТП.Календарь КАК Календарь,
		|	ВТ_ЗадачиТП.Дата1 КАК Дата1,
		|	ВТ_ЗадачиТП.Дата2 КАК Дата2,
		|	ВТ_ЗадачиТП.ЗнакОтклонения КАК ЗнакОтклонения,
		|	ВТ_ЗадачиТП.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта
		|ПОМЕСТИТЬ ВТ_ЗадачиТПСЧасами
		|ИЗ
		|	ВТ_ЗадачиТП КАК ВТ_ЗадачиТП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
		|		ПО ВТ_ЗадачиТП.Календарь = упоРабочиеКалендариСрезПоследних.Календарь
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗадачиТП.ЕдиницаНормированияДлительности,
		|	ВТ_ЗадачиТП.Дата1,
		|	ВТ_ЗадачиТП.Дата2,
		|	ВТ_ЗадачиТП.ЗнакОтклонения,
		|	ВТ_ЗадачиТП.ДлительностьБезУчетаКалендаряПроекта,
		|	ВТ_ЗадачиТП.ПроектнаяЗадача,
		|	ВТ_ЗадачиТП.Календарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Проекты.Ссылка КАК ПроектнаяЗадача,
		|	ВЫБОР
		|		КОГДА НЕ упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности
		|		КОГДА упоСвойстваПроектныхЗадач.ЕдиницаНормированияДлительности = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|				И НЕ Проекты.упоКорневойПроект.упоЕдиницаВремениПоУмолчанию = ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.ПустаяСсылка)
		|			ТОГДА Проекты.упоКорневойПроект.упоЕдиницаВремениПоУмолчанию
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоЕдиницыВремени.РабочийДень)
		|	КОНЕЦ КАК ЕдиницаНормированияДлительности,
		|	ВЫБОР
		|		КОГДА НЕ упоСвойстваПроектныхЗадач.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|			ТОГДА упоСвойстваПроектныхЗадач.КалендарьЗадачи
		|		КОГДА упоСвойстваПроектныхЗадач.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|				И НЕ КалендариПроектов.КалендарьПроекта = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|			ТОГДА КалендариПроектов.КалендарьПроекта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|	КОНЕЦ КАК Календарь,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиДП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА НАЧАЛОПЕРИОДА(СрокиДП.ДатаЗавершенияПлан, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ)
		|	КОНЕЦ КАК Дата1,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиДП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(СрокиДП.ДатаЗавершенияПлан, ДЕНЬ)
		|	КОНЕЦ КАК Дата2,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) > НАЧАЛОПЕРИОДА(СрокиДП.ДатаЗавершенияПлан, ДЕНЬ)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК ЗнакОтклонения,
		|	упоСвойстваПроектныхЗадач.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта
		|ПОМЕСТИТЬ ВТ_ЗадачиДП
		|ИЗ
		|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
		|		ПО (Версии.Версия = упоСвойстваПроектныхЗадач.Версия)
		|			И (Версии.Текущая)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК СрокиДП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК ВерсииДП
		|			ПО (ВерсииДП.Версия = СрокиДП.Версия)
		|				И (ВерсииДП.Договорная)
		|		ПО упоСвойстваПроектныхЗадач.ПроектнаяЗадача = СрокиДП.ПроектнаяЗадача
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК КалендариПроектов
		|		ПО (КалендариПроектов.Проект = Проекты.упоКорневойПроект)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК СтатусыПЗ
		|		ПО (СтатусыПЗ.Версия = упоСвойстваПроектныхЗадач.Версия)
		|			И (СтатусыПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадач.ПроектнаяЗадача)
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(&ДатаАктуальности, ДЕНЬ) <> НАЧАЛОПЕРИОДА(СрокиДП.ДатаЗавершенияПлан, ДЕНЬ)
		|	И НЕ СрокиДП.ДатаЗавершенияПлан = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ СтатусыПЗ.СтатусЗадачи В (ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена), ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Закрыта))
		|	И НЕ упоСвойстваПроектныхЗадач.ЗадачаОтменена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА упоРабочиеКалендариСрезПоследних.День МЕЖДУ ВТ_ЗадачиДП.Дата1 И ВТ_ЗадачиДП.Дата2
		|				ТОГДА упоРабочиеКалендариСрезПоследних.КоличествоЧасов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоЧасов,
		|	ВТ_ЗадачиДП.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ЗадачиДП.ЕдиницаНормированияДлительности КАК ЕдиницаНормированияДлительности,
		|	ВТ_ЗадачиДП.Календарь КАК Календарь,
		|	ВТ_ЗадачиДП.Дата1 КАК Дата1,
		|	ВТ_ЗадачиДП.Дата2 КАК Дата2,
		|	ВТ_ЗадачиДП.ЗнакОтклонения КАК ЗнакОтклонения,
		|	ВТ_ЗадачиДП.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта
		|ПОМЕСТИТЬ ВТ_ЗадачиДПСЧасами
		|ИЗ
		|	ВТ_ЗадачиДП КАК ВТ_ЗадачиДП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК упоРабочиеКалендариСрезПоследних
		|		ПО ВТ_ЗадачиДП.Календарь = упоРабочиеКалендариСрезПоследних.Календарь
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗадачиДП.ЕдиницаНормированияДлительности,
		|	ВТ_ЗадачиДП.Дата1,
		|	ВТ_ЗадачиДП.Дата2,
		|	ВТ_ЗадачиДП.ЗнакОтклонения,
		|	ВТ_ЗадачиДП.ДлительностьБезУчетаКалендаряПроекта,
		|	ВТ_ЗадачиДП.ПроектнаяЗадача,
		|	ВТ_ЗадачиДП.Календарь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндикаторыОбъединенные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	МАКСИМУМ(ИндикаторыОбъединенные.ОтставаниеОтБП) КАК ОтставаниеОтБП,
		|	МАКСИМУМ(ИндикаторыОбъединенные.ОтставаниеОтТП) КАК ОтставаниеОтТП,
		|	МАКСИМУМ(ИндикаторыОбъединенные.ОтставаниеОтДП) КАК ОтставаниеОтДП
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ВТ_ЗадачиБПСЧасами.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|		ВЫБОР
		|			КОГДА НЕ ВТ_ЗадачиБПСЧасами.ДлительностьБезУчетаКалендаряПроекта
		|				ТОГДА ВТ_ЗадачиБПСЧасами.ЗнакОтклонения * (ВТ_ЗадачиБПСЧасами.КоличествоЧасов - ЧасовВДате2.КоличествоЧасов) / ВТ_ЗадачиБПСЧасами.ЕдиницаНормированияДлительности.Коэффициент
		|			ИНАЧЕ ВТ_ЗадачиБПСЧасами.ЗнакОтклонения * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ЗадачиБПСЧасами.Дата1, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТ_ЗадачиБПСЧасами.Дата2, ДЕНЬ), ЧАС) / ВТ_ЗадачиБПСЧасами.ЕдиницаНормированияДлительности.Коэффициент
		|		КОНЕЦ КАК ОтставаниеОтБП,
		|		0 КАК ОтставаниеОтТП,
		|		0 КАК ОтставаниеОтДП
		|	ИЗ
		|		ВТ_ЗадачиБПСЧасами КАК ВТ_ЗадачиБПСЧасами
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК ЧасовВДате2
		|			ПО ВТ_ЗадачиБПСЧасами.Дата2 = ЧасовВДате2.День
		|				И ВТ_ЗадачиБПСЧасами.Календарь = ЧасовВДате2.Календарь
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ЗадачиТПСЧасами.ПроектнаяЗадача,
		|		0,
		|		ВЫБОР
		|			КОГДА НЕ ВТ_ЗадачиТПСЧасами.ДлительностьБезУчетаКалендаряПроекта
		|				ТОГДА ВТ_ЗадачиТПСЧасами.ЗнакОтклонения * (ВТ_ЗадачиТПСЧасами.КоличествоЧасов - ЧасовВДате2.КоличествоЧасов) / ВТ_ЗадачиТПСЧасами.ЕдиницаНормированияДлительности.Коэффициент
		|			ИНАЧЕ ВТ_ЗадачиТПСЧасами.ЗнакОтклонения * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ЗадачиТПСЧасами.Дата1, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТ_ЗадачиТПСЧасами.Дата2, ДЕНЬ), ЧАС) / ВТ_ЗадачиТПСЧасами.ЕдиницаНормированияДлительности.Коэффициент
		|		КОНЕЦ,
		|		0
		|	ИЗ
		|		ВТ_ЗадачиТПСЧасами КАК ВТ_ЗадачиТПСЧасами
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК ЧасовВДате2
		|			ПО ВТ_ЗадачиТПСЧасами.Дата2 = ЧасовВДате2.День
		|				И ВТ_ЗадачиТПСЧасами.Календарь = ЧасовВДате2.Календарь
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ЗадачиДПСЧасами.ПроектнаяЗадача,
		|		0,
		|		0,
		|		ВЫБОР
		|			КОГДА НЕ ВТ_ЗадачиДПСЧасами.ДлительностьБезУчетаКалендаряПроекта
		|				ТОГДА ВТ_ЗадачиДПСЧасами.ЗнакОтклонения * (ВТ_ЗадачиДПСЧасами.КоличествоЧасов - ЧасовВДате2.КоличествоЧасов) / ВТ_ЗадачиДПСЧасами.ЕдиницаНормированияДлительности.Коэффициент
		|			ИНАЧЕ ВТ_ЗадачиДПСЧасами.ЗнакОтклонения * РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ЗадачиДПСЧасами.Дата1, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТ_ЗадачиДПСЧасами.Дата2, ДЕНЬ), ЧАС) / ВТ_ЗадачиДПСЧасами.ЕдиницаНормированияДлительности.Коэффициент
		|		КОНЕЦ
		|	ИЗ
		|		ВТ_ЗадачиДПСЧасами КАК ВТ_ЗадачиДПСЧасами
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних КАК ЧасовВДате2
		|			ПО ВТ_ЗадачиДПСЧасами.Дата2 = ЧасовВДате2.День
		|				И ВТ_ЗадачиДПСЧасами.Календарь = ЧасовВДате2.Календарь) КАК ИндикаторыОбъединенные
		|
		|СГРУППИРОВАТЬ ПО
		|	ИндикаторыОбъединенные.ПроектнаяЗадача";
	
	Возврат ТекстЗапроса;	
	
КонецФункции

Функция МакетОформленияОтчетовИзСтиля()
	
	ИмяСтиля = ХранилищеОбщихНастроек.Загрузить("Конфигурация/Оформление", "СтильОформления");
	Если ИмяСтиля = "упоСтильITLand" Тогда
		ИмяМакетаОформление = "упоОформлениеОтчетовITLand";
	Иначе
		ИмяМакетаОформление = "ОформлениеОтчетовБежевый";
	КонецЕсли;
	
	Возврат ИмяМакетаОформление;
	
КонецФункции

#КонецОбласти