///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Предназначена для настройки вариантов интерактивной настройки выгрузки по сценарию узла.
// Для настройки необходимо установить значения свойств параметров в необходимые значения.
//
// Параметры:
//     Получатель - ПланОбменаСсылка - Узел, для которого производится настройка.
//     Параметры  - Структура        - Параметры для изменения. Содержит поля:
//
//         ВариантБезДополнения - Структура     - настройки типового варианта "Не добавлять".
//                                                Содержит поля:
//             Использование - Булево - флаг разрешения использования варианта. По умолчанию Истина.
//             Порядок       - Число  - порядок размещения варианта на форме помощника, сверху вниз. По умолчанию 1.
//             Заголовок     - Строка - позволяет переопределить название типового варианта.
//             Пояснение     - Строка - позволяет переопределить текст пояснения варианта для пользователя.
//
//         ВариантВсеДокументы - Структура      - настройки типового варианта "Добавить все документы за период".
//                                                Содержит поля:
//             Использование - Булево - флаг разрешения использования варианта. По умолчанию Истина.
//             Порядок       - Число  - порядок размещения варианта на форме помощника, сверху вниз. По умолчанию 2.
//             Заголовок     - Строка - позволяет переопределить название типового варианта.
//             Пояснение     - Строка - позволяет переопределить текст пояснения варианта для пользователя.
//
//         ВариантПроизвольныйОтбор - Структура - настройки типового варианта "Добавить данные с произвольным отбором".
//                                                Содержит поля:
//             Использование - Булево - флаг разрешения использования варианта. По умолчанию Истина.
//             Порядок       - Число  - порядок размещения варианта на форме помощника, сверху вниз. По умолчанию 3.
//             Заголовок     - Строка - позволяет переопределить название типового варианта.
//             Пояснение     - Строка - позволяет переопределить текст пояснения варианта для пользователя.
//
//         ВариантДополнительно - Структура     - настройки дополнительного варианта по сценарию узла.
//                                                Содержит поля:
//             Использование            - Булево            - флаг разрешения использования варианта. По умолчанию Ложь.
//             Порядок                  - Число             - порядок размещения варианта на форме помощника, сверху
//                                                            вниз. По умолчанию 4.
//             Заголовок                - Строка            - название варианта для отображения на форме.
//             ИмяФормыОтбора           - Строка            - Имя формы, вызываемой для редактирования настроек.
//             ЗаголовокКомандыФормы    - Строка            - Заголовок для отрисовки на форме команды открытия формы
//                                                            настроек.
//             ИспользоватьПериодОтбора - Булево            - флаг того, что необходим общий отбор по периоду. По
//                                                            умолчанию Ложь.
//             ПериодОтбора             - СтандартныйПериод - значение периода общего отбора, предлагаемого по
//                                                            умолчанию.
//
//             Отбор                    - ТаблицаЗначений   - содержит строки с описанием подробных отборов по сценарию
//                                                            узла.
//                                                            Содержит колонки:
//                 ПолноеИмяМетаданных - Строка                - полное имя метаданных регистрируемого объекта, отбор
//                                                               которого описывает строка.
//                                                               Например "Документ._ДемоПоступлениеТоваров". Можно
//                                                               использовать специальные  значения "ВсеДокументы" и
//                                                               "ВсеСправочники" для отбора соответственно всех
//                                                               документов и всех справочников, регистрирующихся на
//                                                               узле Получатель.
//                 ВыборПериода        - Булево                - флаг того, что данная строка описывает отбор с общим
//                                                               периодом.
//                 Период              - СтандартныйПериод     - значение периода общего отбора для метаданных строки,
//                                                               предлагаемого по умолчанию.
//                 Отбор               - ОтборКомпоновкиДанных - отбор по умолчанию. Поля отбора формируются в
//                                                               соответствии с общим правилами формирования полей
//                                                               компоновки. Например, для указания отбора по реквизиту
//                                                               документа "Организация", необходимо использовать поле
//                                                               "Ссылка.Организация".
Процедура НастроитьИнтерактивнуюВыгрузку(Получатель, Параметры) Экспорт
	
	// Настраиваем стандартные варианты.
	Параметры.ВариантБезДополнения.Использование     = Истина;
	Параметры.ВариантБезДополнения.Порядок           = 2;
	Параметры.ВариантВсеДокументы.Использование      = Ложь;
	Параметры.ВариантПроизвольныйОтбор.Использование = Ложь;
	
	// Настраиваем вариант дополнения по сценарию узла.
	Параметры.ВариантДополнительно.Использование  = Ложь;
	Параметры.ВариантДополнительно.Порядок        = 1;
	
КонецПроцедуры

// Возвращает представление отбора для варианта дополнения выгрузки по сценарию узла.
// См. описание "ВариантДополнительно" в процедуре "НастроитьИнтерактивнуюВыгрузку".
//
// Параметры:
//     Получатель - ПланОбменаСсылка - Узел, для которого определяется представление отбора.
//     Параметры  - Структура        - Характеристики отбора. Содержит поля:
//         ИспользоватьПериодОтбора - Булево            - флаг того, что необходимо использовать общий отбор по периоду.
//         ПериодОтбора             - СтандартныйПериод - значение периода общего отбора.
//         Отбор                    - ТаблицаЗначений   - содержит строки с описанием подробных отборов по сценарию
//                                                        узла.
//                                                        Содержит колонки:
//                 ПолноеИмяМетаданных - Строка                - полное имя метаданных регистрируемого объекта, отбор
//                                                               которого описывает строка.
//                                                               Например "Документ._ДемоПоступлениеТоваров". Могут
//                                                               быть использованы специальные  значения "ВсеДокументы"
//                                                               и "ВсеСправочники" для отбора соответственно всех
//                                                               документов и всех справочников, регистрирующихся на
//                                                               узле Получатель.
//                 ВыборПериода        - Булево                - флаг того, что данная строка описывает отбор с общим
//                                                               периодом.
//                 Период              - СтандартныйПериод     - значение периода общего отбора для метаданных строки.
//                 Отбор               - ОтборКомпоновкиДанных - поля отбора. Поля отбора формируются в соответствии с
//                                                               общим правилами формирования полей компоновки.
//                                                               Например, для указания отбора по реквизиту документа
//                                                               "Организация", будет использовано поле
//                                                               "Ссылка.Организация".
//
// Возвращаемое значение: 
//     Строка - описание отбора.
//
Функция ПредставлениеОтбораИнтерактивнойВыгрузки(Получатель, Параметры) Экспорт
	
	Возврат "";
	
КонецФункции

// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ЭтоПланОбменаXDTO = Истина;
	Настройки.ФорматОбмена = "http://v8.1c.ru/8.1/data/enterprise";
	
	ВерсииФормата = Новый Соответствие;
	ВерсииФормата.Вставить("1.0", упоПереходСУПРОФ);
	Настройки.ВерсииФорматаОбмена = ВерсииФормата;
	
	Настройки.НазначениеПланаОбмена = "СинхронизацияСДругойПрограммой";
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки 	 = Истина;
	Настройки.Алгоритмы.НастроитьИнтерактивнуюВыгрузку 			 = Истина;
	Настройки.Алгоритмы.ПредставлениеОтбораИнтерактивнойВыгрузки = Истина;
	
	Настройки.Алгоритмы.ОбработчикПроверкиПараметровУчета           = Истина;
	Настройки.Алгоритмы.ОбработчикПроверкиОграниченийПередачиДанных = Истина;
	Настройки.Алгоритмы.ОбработчикПроверкиЗначенийПоУмолчанию 		= Истина;
	
	Настройки.Алгоритмы.ПриПодключенииККорреспонденту = Истина;
	
	Настройки.Алгоритмы.ПриОпределенииПоддерживаемыхОбъектовФормата 			   = Истина;
	Настройки.Алгоритмы.ПриОпределенииПоддерживаемыхКорреспондентомОбъектовФормата = Истина;
	
	Настройки.Алгоритмы.ПередНастройкойСинхронизацииДанных = Истина;
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника  = НСтр("ru = 'Настройки синхронизации данных через универсальный формат'");
	//ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Ложь;	
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = НСтр("ru = 'УПО 1.3'"); 
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = НСтр("ru='Переход с УПО 1.3'");
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена = НСтр("ru = 'Переход с УПО 1.3 с помощью синхронизации данных через универсальный формат'");
	ОписаниеВарианта.ЗаголовокУзлаПланаОбмена = НСтр("ru = 'Переход с УПО 1.3'");
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = НСтр("ru = 'Данная настройка позволяет осуществить переход с конфигурации Управление Проектной Организацией, ред. 1.3.'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.упоПереходНаPM.Форма.ПодробнаяИнформация";
	ОписаниеВарианта.ПоддерживаетсяСопоставлениеДанных = Ложь;
	
КонецПроцедуры

// Обработчик события при подключении к корреспонденту.
// Событие возникает при успешном подключении к корреспонденту и получении версии конфигурации корреспондента
// при настройке обмена с использованием помощника через прямое подключение
// или при подключении к корреспонденту через Интернет.
// В обработчике можно проанализировать версию корреспондента и,
// если настройка обмена не поддерживается с корреспондентом указанной версии, то вызвать исключение.
//
// Параметры:
//	ВерсияКорреспондента - Строка - версия конфигурации корреспондента, например, "2.1.5.1".
//
Процедура ПриПодключенииККорреспонденту(ВерсияКорреспондента) Экспорт
	
КонецПроцедуры

// Возвращает строковое представление варианта синхронизации документов,
// в зависимости от установленного режима выгрузки документов; 
//
// Параметры:
//  РежимВыгрузкиДокументов - ПеречислениеСсылка.РежимыВыгрузкиОбъектовОбмена - режим выгрузки документов.
//
// Возвращаемое значение:
//  Строка - строковое представление варианта выгрузки документов.
//
Функция ОпределитьВариантСинхронизацииДокументов(РежимВыгрузкиДокументов) Экспорт
	
	ВариантСинхронизацииДокументов = "";
	
	//Если РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию Тогда
		
	//	ВариантСинхронизацииДокументов = "АвтоматическаяСинхронизация"
		
	//ИначеЕсли РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВручную Тогда
		
	//	ВариантСинхронизацииДокументов = "ИнтерактивнаяСинхронизация"
		
	//ИначеЕсли РежимВыгрузкиДокументов = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать Тогда
		
		ВариантСинхронизацииДокументов = "НеСинхронизировать";
		
	//КонецЕсли;
	
	Возврат ВариантСинхронизацииДокументов;
	
КонецФункции

// Возвращает строковое представление варианта синхронизации справочников,
// в зависимости от установленного режима выгрузки справочников; 
//
// Параметры:
//  РежимВыгрузкиСправочников - ПеречислениеСсылка.РежимыВыгрузкиОбъектовОбмена - режим выгрузки справочников.
//
// Возвращаемое значение:
//  Строка - строковое представление варианта выгрузки справочников.
//
Функция ОпределитьВариантСинхронизацииСправочников(РежимВыгрузкиСправочников) Экспорт
	
	ВариантСинхронизацииСправочников = "";
	
	//Если РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию Тогда
		
	//	ВариантСинхронизацииСправочников = "АвтоматическаяСинхронизация";
		
	//ИначеЕсли РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости Тогда
		
	//	ВариантСинхронизацииСправочников = "СинхронизироватьПоНеобходимости";
		
	//ИначеЕсли РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать Тогда
		
		ВариантСинхронизацииСправочников = "НеСинхронизировать";
		
	//КонецЕсли;
	
	Возврат ВариантСинхронизацииСправочников;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Проверяет корректность настройки параметров учета.
//
// Параметры:
//	Отказ - Булево - Признак невозможности продолжения настройки обмена из-за некорректно настроенных параметров учета.
//	Получатель - ПланОбменаСсылка - Узел обмена, для которого выполняется проверка параметров учета.
//	Сообщение - Строка - Содержит текст сообщения о некорректных параметрах учета.
//
Процедура ОбработчикПроверкиПараметровУчета(Отказ, Получатель, Сообщение) Экспорт
	
КонецПроцедуры

// Проверяет заполненность на узле ограничений передачи данных, необходимых для корректного 
// формирования сообщения обмена. Используется только для планов обмена XDTO.
// Выполняется перед началом формирования сообщения обмена для корреспондента.
//
// Параметры:
//  Отказ - Булево - признак, что настройки ограничений на узле не соответствуют настройкам обмена.
//  ПараметрыОбработчика - Структура - параметры для выполнения проверки.
//    * Корреспондент - ПланОбменаОбъект - узел плана обмена, соответствующий корреспонденту.
//    * ПоддерживаемыеОбъектыXDTO - Массив - содержит перечень объектов формата, которые могут быть приняты корреспондентом,
//                                       и отправка которых поддерживается в этой базе.
//  СообщениеОбОшибке - Строка - содержит текст о некорректно заполненных (не заполненных) ограничениях.
//
Процедура ОбработчикПроверкиОграниченийПередачиДанных(Отказ, ПараметрыОбработчика, СообщениеОбОшибке = "") Экспорт
	
КонецПроцедуры

// Проверяет заполненность на узле значений по умолчанию, необходимых для корректной 
// загрузки сообщения обмена. Используется только для планов обмена XDTO.
// Выполняется перед началом загрузки сообщения обмена, полученного от корреспондента.
//
// Параметры:
//  Отказ - Булево - признак, что на узле обмена заполнены не все значения по умолчанию.
//  ПараметрыОбработчика - Структура - параметры для выполнения проверки.
//    * Корреспондент - ПланОбменаОбъект - узел плана обмена, соответствующий корреспонденту.
//    * ПоддерживаемыеОбъектыXDTO - Массив - содержит перечень объектов формата, которые могут быть отправлены корреспондентом,
//                                       и получение которых поддерживается в этой базе.
//  СообщениеОбОшибке - Строка - сообщение об ошибке, которое будет фиксироваться в протоколе выполнения обмена.
//
Процедура ОбработчикПроверкиЗначенийПоУмолчанию(Отказ, ПараметрыОбработчика, СообщениеОбОшибке = "") Экспорт
	
КонецПроцедуры

// См. ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ПриОпределенииПоддерживаемыхОбъектовФормата.
//
Процедура ПриОпределенииПоддерживаемыхОбъектовФормата(ПоддерживаемыеОбъекты, Режим, УзелОбмена = Неопределено) Экспорт
	
КонецПроцедуры

// Вызывается после определения состава поддерживаемых конфигурацией-корреспондентом объектов формата.
//  Предоставляет возможность дополнить или ограничить состав данных, которые могут участвовать в обмене.
//  Используется только для планов обмена XDTO.
//
// Параметры:
//  УзелОбмена				 - ПланОбменаСсылка	 - узел плана обмена, соответствующий корреспонденту.
//  ПоддерживаемыеОбъекты	 - ТаблицаЗначений	 - см. ОбменДаннымиXDTOСервер.ПоддерживаемыеОбъектыФорматаКорреспондента.
//  Режим					 - Строка			 - Вид запрашиваемой информации. Возможные значения: "Отправка" - запрос объектов формата,
//  			для которых поддерживается отправка; "Получение" - запрос объектов, для которых поддерживается получение;
//  			"ОтправкаПолучение" - запрос всех поддерживаемых объектов формата.
//
Процедура ПриОпределенииПоддерживаемыхКорреспондентомОбъектовФормата(УзелОбмена, ПоддерживаемыеОбъекты, Режим) Экспорт
	
КонецПроцедуры

// Вызывается перед началом настройки правил отправки и получения данных.
// Позволяет переопределить необходимость открытия помощника настройки, и саму форму помощника.
// 
// Параметры:
//  Контекст - Структура - контекст выполнения операции.
//    * Корреспондент - ПланОбменаСсылка - узел плана обмена, соответствующий корреспонденту.
//    * ИдентификаторНастройки - Строка - идентификатор варианта настройки. См. ПриПолученииВариантовНастроекОбмена.
//    * НачальнаяНастройка - Булево - Истина, если обработчик вызывается при начальной настройке синхронизации.
//  НастройкаВыполнена - Булево - исходящий параметр. Истина, если настройка правил отправки и получения не требуется.
//                                Если Ложь, то форма настройки синхронизации не будет открыта.
//  ИмяФормыПомощника - Строка - исходящий параметр. Имя формы, которая будет открыта для настройки синхронизации,
//                               если НастройкаВыполнена = Ложь. Если в теле обработчика не переопределить значение,
//                               будет открыта форма, указанная в описании варианта настройки, или форма по умолчанию
//                               (форма узла).
//
Процедура ПередНастройкойСинхронизацииДанных(Контекст, НастройкаВыполнена, ИмяФормыПомощника) Экспорт
	НастройкаВыполнена = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбменДанными

#КонецОбласти

#КонецОбласти

#КонецЕсли
