
&НаКлиенте
Процедура ФорматированноеЗначениеКартыПриИзменении(Элемент)
	ДлинаИдентификатора = СтрДлина(Запись.ФорматированноеЗначениеКарты);
	Если ДлинаИдентификатора = 9 Тогда
		Запись.ЗначениеКарты = ПеревестиКодыКарт(Запись.ФорматированноеЗначениеКарты);
	КонецЕсли;
КонецПроцедуры

// Функция - Перевести коды карт
//
// Параметры:
//  Идентификатор - Строка - Строка в формате 000,00000
// 
// Возвращаемое значение:
//  Итог - Строка в HEX
//
&НаСервере
Функция ПеревестиКодыКарт(Идентификатор)
	
	Код = Идентификатор;
	Запятая = СтрНайти(Код, ",");
	Если Запятая = 0 Тогда
		Сообщить("Неверный код карты: " + Идентификатор);
		Возврат ""
	КонецЕсли;
	ЛевЧасть = Число(Лев(Код, Запятая - 1));
	ПравЧасть = Число(Сред(Код, Запятая + 1));
	Лев = Прав("00" + Из_10_В_Любую(ЛевЧасть), 2);
	Прав = Прав("0000" + Из_10_В_Любую(ПравЧасть), 4);
	Итог = "" + Лев + Прав;
	Возврат Итог;
КонецФункции

&НаСервере
Функция Из_10_В_Любую(Знач Значение=0,Нотация=16) Экспорт
	Если Нотация<=0 Тогда Возврат("") КонецЕсли;
	Значение=Число(Значение);
	Если Значение<=0 Тогда 
		Возврат("0") 
	КонецЕсли;
	Значение=Цел(Значение);
	Результат="";
	Пока Значение>0 Цикл
		Результат=Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%Нотация+1,1)+Результат;
		Значение=Цел(Значение/Нотация) ;
	КонецЦикла;
	Возврат Результат;
КонецФункции