#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Если Не ДополнительныеСвойства.Свойство("ПринудительноеОбновление") Тогда
			Отказ = Истина;
			упоФункцииОбщегоНазначенияКлиентСервер.Исключение_ЭтоОбъектДругойКонфигурации();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МодульупоПроектнаяПродукция = ОбщегоНазначения.ОбщийМодуль("упоПроектнаяПродукция");
	МодульупоПроектнаяПродукция.УстановитьПараметрыНабораСвойств(Значение);
	
КонецПроцедуры
 #КонецОбласти

#КонецЕсли