
&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш1_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка)И ЗначениеЗаполнено(КонтрагентПартнера) И (РольДоступна("ПолныеПрава") Или РольДоступна("ИКТ_СотрудникСЭБ")) Тогда
		Черный = Ложь;
		Сервый = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
		|ИЗ
		|	РегистрСведений.ИКТ_НедобросовестныеКонтрагенты КАК ИКТ_НедобросовестныеКонтрагенты
		|ГДЕ
		|	(ИКТ_НедобросовестныеКонтрагенты.Контрагент = &Контрагент
		|			ИЛИ ИКТ_НедобросовестныеКонтрагенты.ИНН = &ИНН)
		|	И ИКТ_НедобросовестныеКонтрагенты.Список = &Черный";	
		Запрос.УстановитьПараметр("ИНН", КонтрагентПартнера.ИНН);
		Запрос.УстановитьПараметр("Контрагент", КонтрагентПартнера);
		Запрос.УстановитьПараметр("Черный", Перечисления.ИКТ_ВариантыСписковКонтрагентов.Черный);	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 0 Тогда	
			Черный = Истина;
		ИначеЕсли Ложь Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
			|ИЗ
			|	РегистрСведений.ИКТ_НедобросовестныеКонтрагенты КАК ИКТ_НедобросовестныеКонтрагенты
			|ГДЕ
			|	ИКТ_НедобросовестныеКонтрагенты.Список = &Черный
			|	И ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента ПОДОБНО &НаименованиеКонтрагента";		
			Запрос.УстановитьПараметр("НаименованиеКонтрагента", ИКТ_ДополнительныеНастройкиСистемы.ИКТ_НаименованиеКонтрагента(КонтрагентПартнера));
			Запрос.УстановитьПараметр("Черный", Перечисления.ИКТ_ВариантыСписковКонтрагентов.Черный);		
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда	
				Черный = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// + SN GM Горовой 28.11.2025	//Серый список
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_НедобросовестныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
		|ИЗ
		|	РегистрСведений.ИКТ_НедобросовестныеКонтрагенты КАК ИКТ_НедобросовестныеКонтрагенты
		|ГДЕ
		|	(ИКТ_НедобросовестныеКонтрагенты.Контрагент = &Контрагент
		|			ИЛИ ИКТ_НедобросовестныеКонтрагенты.ИНН = &ИНН)
		|	И ИКТ_НедобросовестныеКонтрагенты.Список = &Серый";	
		Запрос.УстановитьПараметр("ИНН", КонтрагентПартнера.ИНН);
		Запрос.УстановитьПараметр("Контрагент", КонтрагентПартнера);
		Запрос.УстановитьПараметр("Серый", Перечисления.ИКТ_ВариантыСписковКонтрагентов.Серый);	
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда	
			Серый = Истина;
		КонецЕсли;
		ГруппаКоманд = Элементы.Вставить("ГруппаЧС", Тип("ГруппаФормы"),Элементы.ФормаКоманднаяПанель, Элементы.КомандыЭДО);
		ГруппаКоманд.Заголовок = "Черный список";
		КН  = ДобавитьКнопкуНаФорму(ЭтаФорма.Элементы, Команды, "ДобавитьВСерыйСписок", "В серый список", "ДобавитьВСерыйСписок"
		, ГруппаКоманд,,,);
		КН = ДобавитьКнопкуНаФорму(ЭтаФорма.Элементы, Команды, "ДобавитьВЧерныйСписок", "В черный список", "ДобавитьВЧерныйСписок"
		, ГруппаКоманд,,,);
		КН = ДобавитьКнопкуНаФорму(ЭтаФорма.Элементы, Команды, "ОткрытьЧерныйСписок", "Открыть список", "ОткрытьЧерныйСписок"
		, ГруппаКоманд,,,);
		КН = ДобавитьКнопкуНаФорму(ЭтаФорма.Элементы, Команды, "ИсторияЧерныйСписок", "История изменения", "ОткрытьЧерныйСписокИстория"
		, ГруппаКоманд,,,);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Параметры:
//  Элементы               - ВсеЭлементыФормы
//  Команды               - КомандыФормы
//  ИмяКнопки               - Строка
//  Синоним               - Строка
//  ИмяДействия           - Строка
//  ГруппаРодитель           - ГруппаФормы (По умолчанию = Неопределено)
//  ТолькоВоВсехДействиях - Булево (По умолчанию = Ложь)
//  Картинка               - Картинка (По умолчанию = Неопределено)
//  Пометка               - Булево (По умолчанию = Ложь) 
//
Функция ДобавитьКнопкуНаФорму(Элементы, Команды, ИмяКнопки, Синоним, ИмяДействия
	, ГруппаРодитель = Неопределено,  ТолькоВоВсехДействиях = Ложь, Картинка = Неопределено, Пометка = Ложь) Экспорт
	
	ИмяКоманды = "Команда" + ИмяКнопки;
	
	// Добавляем новую команду обработки выбора вида операции.
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие = ИмяДействия;
	Если Картинка <> Неопределено Тогда
		Команда.Картинка = Картинка;
	КонецЕсли;
	Если ГруппаРодитель = Неопределено Тогда
		НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"));
	Иначе    
		НоваяКнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаРодитель);
	КонецЕсли;
	НоваяКнопка.Вид                           = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НоваяКнопка.ИмяКоманды                 = ИмяКоманды;
	НоваяКнопка.Заголовок                  = Синоним;
	НоваяКнопка.ТолькоВоВсехДействиях     = ТолькоВоВсехДействиях;
	НоваяКнопка.Пометка                 = Пометка;
	Возврат НоваяКнопка;
	
КонецФункции // ДобавитьКнопкуНаФорму()

&НаКлиенте
Процедура ОткрытьЧерныйСписокИстория(Команда) 
	
	П = Новый Структура();
	П.Вставить("Ссылка", КонтрагентПартнера);
	
	ОткрытьФорму("РегистрСведений.ИКТ_НедобросовестныеКонтрагентыИстория.ФормаСписка", П);
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЧерныйСписок(Команда) 
	
	П = Новый Структура();
	П.Вставить("Ссылка", КонтрагентПартнера);
	
	ОткрытьФорму("РегистрСведений.ИКТ_НедобросовестныеКонтрагенты.ФормаСписка", П);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВЧерныйСписок(Команда) 
	
	ДобавитьВЧерныйСписокНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВЧерныйСписокНаСервере()
	
	Если ЗначениеЗаполнено(КонтрагентПартнера) Тогда
		
		НовЗапись = РегистрыСведений.ИКТ_НедобросовестныеКонтрагенты.СоздатьМенеджерЗаписи();
		НовЗапись.ИНН = КонтрагентПартнера.ИНН;
		НовЗапись.Контрагент = КонтрагентПартнера;
		НовЗапись.НаименованиеКонтрагента = ИКТ_ДополнительныеНастройкиСистемы.ИКТ_НаименованиеКонтрагента(КонтрагентПартнера, Истина);
		НовЗапись.Список = Перечисления.ИКТ_ВариантыСписковКонтрагентов.Черный;
		НовЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСерыйСписок(Команда) 
	
	ДобавитьВСерыйСписокНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВСерыйСписокНаСервере()
	
	Если ЗначениеЗаполнено(КонтрагентПартнера) Тогда
		НовЗапись = РегистрыСведений.ИКТ_НедобросовестныеКонтрагенты.СоздатьМенеджерЗаписи();
		НовЗапись.ИНН = КонтрагентПартнера.ИНН;
		НовЗапись.Контрагент = КонтрагентПартнера;
		НовЗапись.НаименованиеКонтрагента = ИКТ_ДополнительныеНастройкиСистемы.ИКТ_НаименованиеКонтрагента(КонтрагентПартнера, Истина);
		НовЗапись.Список = Перечисления.ИКТ_ВариантыСписковКонтрагентов.Серый;
		НовЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры