////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции БСП.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция ЭтоПолноправныйПользовательИБ проверяет,
// является ли полноправным текущий пользователь ИБ или
// пользователь ИБ заданного пользователя (обычного или внешнего).
// Полноправными считается:
// а) пользователь ИБ при пустом списке пользователей ИБ,
//    если основная роль не задана или ПолныеПрава,
// б) пользователь ИБ с ролью ПолныеПрава.
//
// Параметры:
//  Пользователь - Неопределено - (проверяется текущий пользователь ИБ),
//					Справочник.Пользователи, Справочник.ВнешниеПользователи
//					(осуществляется поиск пользователя ИБ по уникальному
//					идентификатору, заданному в реквизите ИдентификаторПользователяИБ,
//					если пользователь ИБ не найден, возвращается Ложь).
//
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЭтоПолноправныйПользовательИБ(Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Пользователь) И Пользователь <> АвторизованныйПользователь() Тогда
		ИДПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИДПользователяИБ);
		Если ПользовательИБ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	КонецЕсли;
	
	ТекПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПользовательИБ.УникальныйИдентификатор = ТекПользовательИБ.УникальныйИдентификатор Тогда
		
		Если ЗначениеЗаполнено(ПользовательИБ.Имя) Тогда
			
			ИДПользователяИБ = ТекПользовательИБ.УникальныйИдентификатор;
			МДПолныеПрава = Метаданные.Роли.ПолныеПрава;
			ТемпПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИДПользователяИБ);
			
			Возврат РольДоступна("ПолныеПрава") ИЛИ ТемпПользовательИБ.Роли.Содержит(МДПолныеПрава);
			
		Иначе
			// Авторизован пустой пользователь - список пользователей пуст,
			// если основная роль пустая - все права разрешены.
			Если Метаданные.ОсновнаяРоль = Неопределено ИЛИ
				 Метаданные.ОсновнаяРоль = Метаданные.Роли.ПолныеПрава Тогда
				
				Возврат Истина;
				
			Иначе
				
				Возврат Ложь;
				
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		Возврат ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава);
		
	КонецЕсли;
	
КонецФункции
	
// Функция АвторизованныйПользователь возвращает
// текущего пользователя сеанса.
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи.
// 
Функция АвторизованныйПользователь() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Пользователи.ТекущийПользователь();
	
КонецФункции

// Возвращает текстовое представление числа с единицей измерения в правильном склонении и числе.
//
// Параметры:
//  Число - Число - любое целое число.
//	ПараметрыПредметаИсчисления - Строка - варианты написания единицы измерения в родительном падеже для одной,
//										   для двух и для пяти единиц, разделитель - запятая.
//										   Пример: "минуту,минуты,минут".
//
// Возвращаемое значение:
//  Строка - текстовое представление количества единиц, число записывается цифрами.
Функция ЧислоЦифрамиПредметИсчисленияПрописью(Знач Число, Знач ПараметрыПредметаИсчисления) Экспорт

	Результат = Формат(Число,"ЧН=0");
	
	МассивПредставлений = Новый Массив;
	
	Позиция = Найти(ПараметрыПредметаИсчисления, ",");
	Пока Позиция > 0 Цикл
		Значение = СокрЛП(Лев(ПараметрыПредметаИсчисления, Позиция-1));
		ПараметрыПредметаИсчисления = Сред(ПараметрыПредметаИсчисления, Позиция + 1);
		МассивПредставлений.Добавить(Значение);
		Позиция = Найти(ПараметрыПредметаИсчисления, ",");
	КонецЦикла;
	
	Если СтрДлина(ПараметрыПредметаИсчисления) > 0 Тогда
		Значение = СокрЛП(ПараметрыПредметаИсчисления);
		МассивПредставлений.Добавить(Значение);
	КонецЕсли;	
	
	Если Число >= 100 Тогда
		Число = Число - Цел(Число / 100)*100;
	КонецЕсли;
	
	Если Число > 20 Тогда
		Число = Число - Цел(Число/10)*10;
	КонецЕсли;
	
	Если Число = 1 Тогда
		Результат = Результат + " " + МассивПредставлений[0];
	ИначеЕсли Число > 1 И Число < 5 Тогда
		Результат = Результат + " " + МассивПредставлений[1];
	Иначе
		Результат = Результат + " " + МассивПредставлений[2];
	КонецЕсли;
	
	Возврат Результат;	
			
КонецФункции

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1	 - Строка	 - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2	 - Строка	 - второй сравниваемый номер версии.
// 
// Возвращаемое значение:
//  Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = РазложитьСтрокуВМассивПодстрок(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
		                    НСтр("ru = 'Неправильный формат строки версии: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = РазложитьСтрокуВМассивПодстрок(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
	                         НСтр("ru = 'Неправильный формат строки версии: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
//  Параметры в строке задаются как %<номер параметра>. Нумерация параметров
//  начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки	 - Строка	 - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра")
//  Параметр1			 - Строка	 - параметр.
//  Параметр2			 - Строка	 - параметр.
//  Параметр3			 - Строка	 - параметр.
//  Параметр4			 - Строка	 - параметр.
//  Параметр5			 - Строка	 - параметр.
//  Параметр6			 - Строка	 - параметр.
//  Параметр7			 - Строка	 - параметр.
//  Параметр8			 - Строка	 - параметр.
//  Параметр9			 - Строка	 - параметр.
// 
// Возвращаемое значение:
//  Строка - текстовая строка с подставленными параметрами. 
//
// Пример:
//  Строка = ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк")
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1,	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Если СтрокаПодстановки = Неопределено ИЛИ СтрДлина(СтрокаПодстановки) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = "";
	НачПозиция = 1;
	Позиция = 1;
	Пока Позиция <= СтрДлина(СтрокаПодстановки) Цикл
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		Если СимволСтроки <> "%" Тогда
			Позиция = Позиция + 1;
			Продолжить;
		КонецЕсли;
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, Позиция - НачПозиция);
		Позиция = Позиция + 1;
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		
		Если СимволСтроки = "%" Тогда
			Позиция = Позиция + 1;
			НачПозиция = Позиция;
			Продолжить;
		КонецЕсли;
		
		Попытка
			НомерПараметра = Число(СимволСтроки);
		Исключение
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + СимволСтроки);
		КонецПопытки;
		
		Если СимволСтроки = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли СимволСтроки = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли СимволСтроки = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли СимволСтроки = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли СимволСтроки = "5" Тогда
			ЗначениеПараметра = Параметр5;
		ИначеЕсли СимволСтроки = "6" Тогда
			ЗначениеПараметра = Параметр6;
		ИначеЕсли СимволСтроки = "7" Тогда
			ЗначениеПараметра = Параметр7;
		ИначеЕсли СимволСтроки = "8" Тогда
			ЗначениеПараметра = Параметр8;
		ИначеЕсли СимволСтроки = "9" Тогда
			ЗначениеПараметра = Параметр9;
		Иначе
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + ЗначениеПараметра);
		КонецЕсли;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = "";
		Иначе
			ЗначениеПараметра = Строка(ЗначениеПараметра);
		КонецЕсли;
		Результат = Результат + ЗначениеПараметра;
		Позиция = Позиция + 1;
		НачПозиция = Позиция;
	
	КонецЦикла;
	
	Если (НачПозиция <= СтрДлина(СтрокаПодстановки)) Тогда
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, СтрДлина(СтрокаПодстановки) - НачПозиция + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает номер версии конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС – номер сборки, который будет удален.
// 
// Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
Функция ВерсияКонфигурацииБезНомераСборки(Знач Версия) Экспорт
	
	Массив = РазложитьСтрокуВМассивПодстрок(Версия, ".");
	
	Если Массив.Количество() < 3 Тогда
		Возврат Версия;
	КонецЕсли;
	
	Результат = "[Редакция].[Подредакция].[Релиз]";
	Результат = СтрЗаменить(Результат, "[Редакция]",    Массив[0]);
	Результат = СтрЗаменить(Результат, "[Подредакция]", Массив[1]);
	Результат = СтрЗаменить(Результат, "[Релиз]",       Массив[2]);
	
	Возврат Результат;
КонецФункции

// Функция "расщепляет" строку на подстроки, используя заданный
//  разделитель. Разделитель может иметь любую длину.
//  Если в качестве разделителя задан пробел, рядом стоящие пробелы
//  считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр игнорируются.
//  Например,
//  РазложитьСтрокуВМассивПодстрок(",один,,,два", ",") возвратит массив значений из пяти элементов,
//  три из которых - пустые строки, а
//  РазложитьСтрокуВМассивПодстрок(" один   два", " ") возвратит массив значений из двух элементов.
//
// Параметры:
//  Стр			 - Строка	 - которую необходимо разложить на подстроки.
//  Разделитель	 - Строка	 - разделитель, по умолчанию - запятая.
// 
// Возвращаемое значение:
//  Массив - массив значений, элементы которого - подстроки.
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр, Поз - 1));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				Если (СокрЛП(Стр) <> "") Тогда
					МассивСтрок.Добавить(Стр);
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз - 1));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции 

// Проверяет, что на объект с ссылкой Ссылка ссылаются существующие объекты информационной базы.
//
// Параметры:
//  СсылкаИлиМассивСсылок	 - Массив, ДокументСсылка, СправочникСсылка - проверямая ссылка или массив ссылок.
//
// Возвращаемое значение:
//	Число - количестов ссылок.
//
Функция ПроверитьНаОбъектыИмеютсяСсылкиВИБ(Знач СсылкаИлиМассивСсылок) Экспорт
	
	Если ТипЗнч(СсылкаИлиМассивСсылок) = Тип("Массив") Тогда
		МассивСсылок = СсылкаИлиМассивСсылок;
	Иначе
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(СсылкаИлиМассивСсылок);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСсылок = НайтиПоСсылкам(МассивСсылок);
	СлужебныеОбъекты = ПолучитьИсключенияПоискаСсылок();
	Исключения = Новый Массив;
	Для Каждого ОписаниеСсылки Из ТаблицаСсылок Цикл
		Если СлужебныеОбъекты.Найти(ОписаниеСсылки.Метаданные.ПолноеИмя()) <> Неопределено Тогда
			Исключения.Добавить(ОписаниеСсылки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаИсключение Из Исключения Цикл
		ТаблицаСсылок.Удалить(СтрокаИсключение);
	КонецЦикла;
	
	Возврат ТаблицаСсылок.Количество() > 0;
	
КонецФункции

// Возвращает список имен объектов метаданных,
//  которые могут ссылаться на различные объекты метаданных без влияния на бизнес-логику приложения,
//  Пример:
//  Для документ "Реализация товаров и услуг" настроена подсистема версионирования объектов,
//  и подсистема свойств. При этом на экземпляр документа может быть множество ссылок
//  в информационной базе (из других документов, регистров). Часть ссылок имеют значение для бизнес-логики
//  (например движения по регистрам). Другая часть ссылок - "техногенные" ссылки на объект из объектов ИБ,
//  которые относятся к подсистеме версионирования объектов и подсистеме свойств. Такие техногенные
//  ссылки должны быть отфильтрованы в обработке удаления помеченных и при поиске ссылок на объект
//  в подсистеме запрета редактирования ключевых реквизитов.
// 
// Возвращаемое значение:
//  Массив - массив строк, например, "РегистрСведений.ВерсииОбъектов".
//
Функция ПолучитьИсключенияПоискаСсылок() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Метаданные.РегистрыСведений.КурсыВалют.ПолноеИмя());
	Массив.Добавить(Метаданные.РегистрыСведений.ДополнительныеСведения.ПолноеИмя());
	
	Возврат Массив;
	
КонецФункции

// Процедура принимает в качестве параметра форму и для всех реквизитов,
//  для которых определен механизм, блокирует их редактирование.
//
// Параметры:
//  Форма								 - УправляемаяФорма	 - форма объекта, для которой применяется механизм
//  НаименованиеГруппыДляКнопкиЗапрета	 - Строка			 - если требуется поместить кнопку разрешения
//  	редактирования в специальное место - передается группа на форме.
//
Процедура ЗаблокироватьРеквизиты(Форма, НаименованиеГруппыДляКнопкиЗапрета = Неопределено) Экспорт
	
	// Проверяем, что форма подготовлена (созданы необходимые реквизиты и элементы формы).
	ФормаПодготовлена = Ложь;
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		Если РеквизитФормы.Имя = "__ПараметрыЗапретаРедактирования" Тогда
			ФормаПодготовлена = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ФормаПодготовлена Тогда
		ПодготовитьФорму(Форма, Форма.Объект.Ссылка, НаименованиеГруппыДляКнопкиЗапрета);
	КонецЕсли;
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		РазрешитьИзменение = Истина;
	Иначе
		РазрешитьИзменение = Ложь;
	КонецЕсли;
	
	// Блокируем редактирование реквизитов.
	Для Каждого ОписаниеБлокируемогоРеквизита Из Форма.__ПараметрыЗапретаРедактирования Цикл
		Для Каждого ОписаниеЭлементаФормы Из ОписаниеБлокируемогоРеквизита.БлокируемыеЭлементы Цикл
			ЭлементФормы = Форма.Элементы.Найти(ОписаниеЭлементаФормы.Значение);
			Если ЭлементФормы <> Неопределено Тогда
				Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы")
				 ИЛИ ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Тогда
					ЭлементФормы.ТолькоПросмотр = НЕ РазрешитьИзменение;
				Иначе
					ЭлементФормы.Доступность = РазрешитьИзменение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ОписаниеБлокируемогоРеквизита.РазрешитьИзменение = РазрешитьИзменение;
	КонецЦикла;
	
КонецПроцедуры

// Проверить, что значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение       - ссылка на объект, - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  Булево       - Истина, если тип значения ссылочный.
//
Функция ЗначениеСсылочногоТипа(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Задачи.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция ВидОбъектаПоСсылке возвращает имя вида объектов метаданных
// по ссылке на объект.
//
// Не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  Строка       - имя вида объектов метаданных, например, "Справочник", "Документ" ...
// 
Функция ВидОбъектаПоСсылке(Ссылка) Экспорт
	
	Возврат ВидОбъектаПоТипу(ТипЗнч(Ссылка));
	
КонецФункции 

// Функция возвращает имя вида объектов метаданных по типу объекта.
// Не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  Тип       - Тип прикладного объекта, определенный в конфигурации.
//
// Возвращаемое значение:
//  Строка       - имя вида объектов метаданных, например, "Справочник", "Документ".
// 
Функция ВидОбъектаПоТипу(Тип) Экспорт
	
	Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Справочник";
	
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Документ";
	
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "БизнесПроцесс";
	
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланВидовХарактеристик";
	
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланСчетов";
	
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланВидовРасчета";
	
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Задача";
	
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланОбмена";
	
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Перечисление";
	
	Иначе
		ВызватьИсключение ПодставитьПараметрыВСтроку(
			НСтр("ru='Неверный тип значения параметра (%1)'"), Строка(Тип));
	КонецЕсли;
	
КонецФункции 

// Возвращает менеджер объекта по ссылке на объект.
//
// Не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ...
// 
Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
	
	ИмяОбъекта = Ссылка.Метаданные().Имя;
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Справочники[ИмяОбъекта];
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Документы[ИмяОбъекта];
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат БизнесПроцессы[ИмяОбъекта];
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовХарактеристик[ИмяОбъекта];
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыСчетов[ИмяОбъекта];
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовРасчета[ИмяОбъекта];
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Задачи[ИмяОбъекта];
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыОбмена[ИмяОбъекта];
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Перечисления[ИмяОбъекта];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Проверить, что описание типа состоит из единственного типа значения и
//  совпадает с нужным типом.
//
// Параметры:
//  ОписаниеТипа - ОписаниеТипа	
//  ТипЗначения	 - ТипЗначения
// 
// Возвращаемое значение:
//  Булево - Совпадает или нет.
//
Функция ОписаниеТипаСостоитИзТипа(ОписаниеТипа, ТипЗначения) Экспорт
	
	Если ОписаниеТипа.Типы().Количество() = 1
	   И ОписаниеТипа.Типы().Получить(0) = ТипЗначения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
// Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИменаРеквизитов - Строка или Структура - если Строка, то имена реквизитов, 
//               перечисленные через запятую, в формате требований к свойствам структуры.
//               Например, "Код, Наименование, Родитель".
//               Если Структура, то в качестве ключа передается псевдоним поля для
//               возвращаемой структуры с результатом, а в качестве значения (опционально) 
//               - фактическое имя поля в таблице. 
//               Если значение не определено, то имя поля берется из ключа.
// 
// Возвращаемое значение:
//  Структура    - содержит список свойств, как список имен в строке
//                 ИменаРеквизитов, со значениям реквизитов, прочитанных
//                 из информационной базы.
// 
Функция ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов) Экспорт

	Если ТипЗнч(ИменаРеквизитов) = Тип("Структура") Тогда
		СтруктураРеквизитов = ИменаРеквизитов;
	ИначеЕсли ТипЗнч(ИменаРеквизитов) = Тип("Строка") Тогда
		СтруктураРеквизитов = Новый Структура(ИменаРеквизитов);;
	Иначе
		ВызватьИсключение упоФункцииБСП.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверный тип второго параметра ИменаИлиСтруктураРеквизитов: %1'"), 
			Строка(ТипЗнч(ИменаРеквизитов)));
	КонецЕсли;

	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), СокрЛП(КлючИЗначение.Значение), СокрЛП(КлючИЗначение.Ключ));
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
			|	ПсевдонимЗаданнойТаблицы." + ИмяПоля + " КАК " + Псевдоним;
	КонецЦикла;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|" + ТекстПолей + "
		|ИЗ
		|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
		|ГДЕ
		|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
		|");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);

	Возврат Результат;
КонецФункции

// Функция ПолучитьЗначениеРеквизита возвращает значение
// реквизита, прочитанного из информационной базы по ссылке на объект.
// 
// Если доступа к реквизиту нет, возникнет исключение прав доступа.
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ПолучитьЗначенияРеквизитов(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Является ли объект группой.
//  В качестве параметра может принимать только справочник или ПВХ.
//
// Параметры:
//  Объект	 - СправочникОбъект, ПланВидовХарактеристикОбъект
// 
// Возвращаемое значение:
//  Булево
//
Функция ОбъектЯвляетсяГруппой(Объект) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Если ЭтоСправочник(МетаданныеОбъекта)
		И НЕ (МетаданныеОбъекта.Иерархический 
		И МетаданныеОбъекта.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗначениеСсылочногоТипа(Объект) Тогда
		Возврат Объект.ЭтоГруппа;
	КонецЕсли;
	
	Ссылка = Объект.Ссылка;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПолучитьЗначениеРеквизита(Ссылка, "ЭтоГруппа");
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Справочник".
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных	 - объект метаданных, для которого необходимо определить принадлежность к заданному типу.
// 
// Возвращаемое значение:
//  Булево - Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоСправочник(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаСправочники();
	
КонецФункции

// Возвращает значение для идентификации общего типа "Регистры сведений".
//
// Возвращаемое значение:
//	Строка - значение для идентификации общего типа "Регистры сведений".
//
Функция ИмяТипаРегистрыСведений() Экспорт
	
	Возврат "РегистрыСведений";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Регистры накопления".
//
// Возвращаемое значение:
//	Строка - значение для идентификации общего типа "Регистры накопления".
//
Функция ИмяТипаРегистрыНакопления() Экспорт
	
	Возврат "РегистрыНакопления";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Регистры бухгалтерии".
//
// Возвращаемое значение:
//	Строка - значение для идентификации общего типа "Регистры бухгалтерии".
//
Функция ИмяТипаРегистрыБухгалтерии() Экспорт
	
	Возврат "РегистрыБухгалтерии";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Регистры расчета".
//
// Возвращаемое значение:
//	Строка - значение для идентификации общего типа "Регистры расчета".
//
Функция ИмяТипаРегистрыРасчета() Экспорт
	
	Возврат "РегистрыРасчета";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Документы".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаДокументы() Экспорт
	
	Возврат "Документы";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Справочники".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаСправочники() Экспорт
	
	Возврат "Справочники";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Перечисления".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаПеречисления() Экспорт
	
	Возврат "Перечисления";
	
КонецФункции

// Возвращает значение для идентификации общего типа "ПланыОбмена".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаПланыОбмена() Экспорт
	
	Возврат "ПланыОбмена";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Планы видов характеристик".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаПланыВидовХарактеристик() Экспорт
	
	Возврат "ПланыВидовХарактеристик";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Бизнес-процессы".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаБизнесПроцессы() Экспорт
	
	Возврат "БизнесПроцессы";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Задачи".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаЗадачи() Экспорт
	
	Возврат "Задачи";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Планы счетов".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаПланыСчетов() Экспорт
	
	Возврат "ПланыСчетов";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Планы видов расчета".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаПланыВидовРасчета() Экспорт
	
	Возврат "ПланыВидовРасчета";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Константы".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаКонстанты() Экспорт
	
	Возврат "Константы";
	
КонецФункции

// Возвращает значение для идентификации общего типа "Журналы документов".
//
// Возвращаемое значение:
//	Строка - значение для идентификации типа.
//
Функция ИмяТипаЖурналыДокументов() Экспорт
	
	Возврат "ЖурналыДокументов";
	
КонецФункции

// Возвращает имя базового типа по переданному значению объекта метаданных.
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, по которому необходимо определить базовый тип.
// 
// Возвращаемое значение:
//  Строка - имя базового типа по переданному значению объекта метаданных.
//
Функция ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) Экспорт
	
	Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаДокументы();
		
	ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаСправочники();
		
	ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПеречисления();
		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыСведений();
		
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыНакопления();
		
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыБухгалтерии();
		
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыРасчета();
		
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыОбмена();
		
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыВидовХарактеристик();
		
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаБизнесПроцессы();
		
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаЗадачи();
		
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыСчетов();
		
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыВидовРасчета();
		
	ИначеЕсли Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаКонстанты();
		
	ИначеЕсли Метаданные.ЖурналыДокументов.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаЖурналыДокументов();
		
	Иначе
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

// Возвращает описание предмета в виде текстовой строки.
//
// Параметры:
//  СсылкаНаПредмет	 - ЛюбаяСсылка	 - объект ссылочного типа.
// 
// Возвращаемое значение:
//  Строка - представление.
//
Функция ПредметСтрокой(СсылкаНаПредмет) Экспорт
	
	Результат = "";
	
	Если ПустаяСтрока(Результат) Тогда
		Если СсылкаНаПредмет = Неопределено ИЛИ СсылкаНаПредмет.Пустая() Тогда
			Результат = НСтр("ru = 'не задан'");
		ИначеЕсли Метаданные.Документы.Содержит(СсылкаНаПредмет.Метаданные()) Тогда
			Результат = Строка(СсылкаНаПредмет);
		Иначе
			ПредставлениеОбъекта = СсылкаНаПредмет.Метаданные().ПредставлениеОбъекта;
			Если ПустаяСтрока(ПредставлениеОбъекта) Тогда
				ПредставлениеОбъекта = СсылкаНаПредмет.Метаданные().Представление();
			КонецЕсли;
			Результат = упоФункцииБСП.ПодставитьПараметрыВСтроку(
				"%1 (%2)", Строка(СсылкаНаПредмет), ПредставлениеОбъекта);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Загружает настройку из общего хранилища настроек.
//
// Параметры:
//  Объект		 - Строка - ключ объекта настройки.
//  Настройка	 - Строка - ключ загружаемых настроек.
//
// Возвращаемое значение:
//	Произвольный - настройки, загруженные из хранилища.
//
Функция ХранилищеОбщихНастроекЗагрузить(Объект, Настройка) Экспорт
	
	Возврат ХранилищеОбщихНастроек.Загрузить(Объект, Настройка);
	
КонецФункции

// Сохраняет настройку в хранилище общих настроек и обновляет повторно используемые значения.
//
// Параметры:
//  Объект		 - Строка 		- ключ объекта настройки.
//  Настройка	 - Строка 		- ключ сохраняемых настроек.
//  Значение	 - Произвольный -  настройки, которые нужно сохранить в хранилище.
//
Процедура ХранилищеОбщихНастроекСохранитьИОбновитьПовторноИспользуемыеЗначения(Объект, Настройка, Значение) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(Объект, Настройка, Значение);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Сохраняет настройку в хранилище общих настроек.
//
// Параметры:
//  Объект		 - Строка 		- ключ объекта настройки.
//  Настройка	 - Строка 		- ключ сохраняемых настроек.
//  Значение	 - Произвольный -  настройки, которые нужно сохранить в хранилище.
//
Процедура ХранилищеОбщихНастроекСохранить(Объект, Настройка, Значение) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(Объект, Настройка, Значение);
	
КонецПроцедуры

// Возвращает "корректную" версию конфигурации.
//
// Параметры:
//  СтрокаВерсии - Строка - "неочищенная" версия.
//
// Возвращаемое значение:
//	Строка - версия конфигурации в нужном виде.
//
Функция ВерсияКонфигурации(Знач СтрокаВерсии) Экспорт
	
	КоличествоСлешей	= СтрЧислоВхождений(СтрокаВерсии, "/");
	ПозицияПервогоСлеша = Найти(СтрокаВерсии, "/");
	
	Если КоличествоСлешей <> 0 Тогда
				
		Если КоличествоСлешей = 1 Тогда
			
			СтрокаВерсии = Сред(СтрокаВерсии, ПозицияПервогоСлеша + 1, СтрДлина(СтрокаВерсии) - ПозицияПервогоСлеша);
			
		ИначеЕсли КоличествоСлешей = 2 Тогда
			
			СтрокаБезПервогоБлока = Сред(СтрокаВерсии, ПозицияПервогоСлеша + 1, СтрДлина(СтрокаВерсии) - ПозицияПервогоСлеша);
			ПозицияВторогоСлеша = Найти(СтрокаБезПервогоБлока, "/");
			СтрокаВерсии = Сред(СтрокаБезПервогоБлока, ПозицияВторогоСлеша + 1, СтрДлина(СтрокаБезПервогоБлока) - ПозицияВторогоСлеша);
			
		КонецЕсли;
			
	КонецЕсли;

	Возврат СтрокаВерсии;
	
КонецФункции

// Последняя версия отображения изменений системы.
//
// Параметры:
//  ИмяПользователя	 - Строка - имя пользователя, для которого получается значение последней версии.
//  ИмяКонфигурации	 - Строка - имя конфигурации, для которой получается последняя версия.
//
// Возвращаемое значение:
//	Произвольный - последняя версия.
//
Функция ПоследняяВерсияОтображенияИзмененийСистемы(Знач ИмяПользователя = Неопределено, ИмяКонфигурации) Экспорт
	
	Если ИмяПользователя = Неопределено Тогда
		ИмяПользователя = ИмяПользователя();
	КонецЕсли;
	
	ПоследняяВерсия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбновлениеИБ",
		"ПоследняяВерсияОтображенияИзмененийСистемы" + ИмяКонфигурации, , , ИмяПользователя);
		
	Возврат ПоследняяВерсия;
	
КонецФункции

// Получает массив версий больше заданной.
//
// Параметры:
//  Разделы	 - СписокЗначений 	- список версий.
//  Версия	 - Строка 			- версия, для которой надо найти более поздние версии.
//
// Возвращаемое значение:
//	Массив - массив версий (тип элемента - строковый).
//
Функция ПолучитьВерсииБольшеЗаданной(Разделы, Версия) Экспорт 
	
	Результат = Новый Массив;
	
	Если Версия = Неопределено Тогда
		Версия = "";		
	КонецЕсли; 
	
	ВесВерсии = ОбновлениеИнформационнойБазыСлужебный.ВесВерсии(Версия);
	
	Для Каждого ЭлементСписка Из Разделы Цикл
		
		Если ЭлементСписка.Значение <= ВесВерсии Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ЭлементСписка.Представление);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает табличный документ - описание обновлений.
//
// Параметры:
//  ДокументОписаниеОбновлений	 - ТабличныйДокумент 	- табличный документ, в который выводится информация.
//  МакетОписаниеОбновлений		 - ТабличныйДокумент 	- табличный документ с описанием обновлений.
//  Разделы						 - СписокЗначений 		- список разделов.
//  ВыводитьЗаголовки			 - Булево				- признак необходимости вывода заголовков.
//
// Возвращаемое значение:
//	ТабличныйДокумент - табличный документ с описанием обновлений.
//
Функция ДокументОписаниеОбновлений(ДокументОписаниеОбновлений,
								   МакетОписаниеОбновлений,
								   Знач Разделы,
								   ВыводитьЗаголовки = Истина) Экспорт
	
	Если Разделы.Количество() = 0 Или МакетОписаниеОбновлений = Неопределено Тогда
		Возврат ДокументОписаниеОбновлений;
	КонецЕсли;
		
	Для Каждого Версия Из Разделы Цикл
		ВывестиОписаниеИзменений(Версия, ДокументОписаниеОбновлений, МакетОписаниеОбновлений, ВыводитьЗаголовки);
	КонецЦикла;
	
	Возврат ДокументОписаниеОбновлений;
	
КонецФункции

// Получает массив описаний подсистем конфигурации.
//
// Возвращаемое значение:
//	Массив - массив с описанием подсистем. Тип значения элемента массива - строка.
//
Функция ПолучитьМассивОписанийПодсистемКонфигурации() Экспорт
	
	МодулиПодсистем = Новый Массив;
	МассивПодсистем = Новый Массив;
	
	ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем(МодулиПодсистем);
	
	Для Каждого МодульПодсистемы Из МодулиПодсистем Цикл
		
		ОписаниеПодсистемы = ПолучитьСтруктуруОписанияПодсистемы();
		
		Модуль = ОбщегоНазначения.ОбщийМодуль(МодульПодсистемы);
		Модуль.ПриДобавленииПодсистемы(ОписаниеПодсистемы);
		
		МассивПодсистем.Добавить(ОписаниеПодсистемы);
		
	КонецЦикла;
	
	Возврат МассивПодсистем;
	
КонецФункции

// Получает структуру описания подсистемы. см.СтандартныеПодсистемыПовтИсп.НовоеОписаниеПодсистемы()
//
// Возвращаемое значение:
//	Структура - структура описания подсистемы. Свойства:
//		* Имя 					- Строка - имя подсистемы.
//		* Версия 				- Строка - версия подсистемы.
//		* ТребуемыеПодсистемы 	- Массив - массив связанных подсистем.
//
Функция ПолучитьСтруктуруОписанияПодсистемы() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Имя",    "");
	Описание.Вставить("Версия", "");
	Описание.Вставить("ТребуемыеПодсистемы", Новый Массив);
	Описание.Вставить("ИдентификаторИнтернетПоддержки", "");
	
	// Свойство устанавливается автоматически.
	Описание.Вставить("ЭтоКонфигурация", Ложь);
	
	// Имя основного модуля библиотеки.
	// Может быть пустым для конфигурации.
	Описание.Вставить("ОсновнойСерверныйМодуль", "");
	
	// Режим выполнения отложенных обработчиков обновления.
	// По умолчанию Последовательно.
	Описание.Вставить("РежимВыполненияОтложенныхОбработчиков", "Последовательно");
	Описание.Вставить("ПараллельноеОтложенноеОбновлениеСВерсии", "");
	
	// Режим выполнения обработчиков начального заполнения при переходе
	// с другой программы.
	Описание.Вставить("ЗаполнятьДанныеНовыхПодсистемПриПереходеСДругойПрограммы", Ложь);
	
	Возврат Описание;
	
КонецФункции

// Возвращает максимальный размер файла провайдера.
//
// Возвращаемое значение:
//	Число - максимальный размер файла.
//
Функция МаксимальныйРазмерФайлаОбщий() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МаксимальныйРазмерФайла = Константы.МаксимальныйРазмерФайла.Получить();
	
	Если МаксимальныйРазмерФайла = Неопределено
	 ИЛИ МаксимальныйРазмерФайла = 0 Тогда
		
		МаксимальныйРазмерФайла = 50 * 1024 * 1024; // 50 Мб.
		Константы.МаксимальныйРазмерФайла.Установить(МаксимальныйРазмерФайла);
		
	КонецЕсли;
	
	Возврат МаксимальныйРазмерФайла;
	
КонецФункции

// Значение реквизита, прочитанного из информационной базы по ссылке на объект.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  ИмяРеквизита       - Строка - имя получаемого реквизита.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя, и в случае,
//                                    - если есть ограничение на уровне записей, то возвращается Неопределено;
//                                    - если нет прав для работы с таблицей, то возникнет исключение.
//                              - если Ложь, то возникнет исключение при отсутствии прав на таблицу
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Произвольный - зависит от типа значения прочитанного реквизита.
//               - если в параметр Ссылка передана пустая ссылка, то возвращается Неопределено.
//               - если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//                 то возвращается Неопределено.
//
Функция ЗначениеРеквизитаОбъектаВызовСервера(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);	

КонецФункции

// Структура, содержащая значения реквизитов, прочитанные из информационной базы по ссылке на объект.
//
// Если необходимо зачитать реквизит независимо от прав текущего пользователя,
// то следует использовать предварительный переход в привилегированный режим.
//
// Параметры:
//  Ссылка    - ЛюбаяСсылка - объект, значения реквизитов которого необходимо получить.
//            - Строка      - полное имя предопределенного элемента, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//                       требований к свойствам структуры.
//                       Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                       псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                       значения (опционально) фактическое имя поля в таблице.
//                       Если ключ задан, а значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//                       к свойствам структуры.
//  ВыбратьРазрешенные - Булево - если Истина, то запрос к объекту выполняется с учетом прав пользователя, и в случае,
//                                    - если есть ограничение на уровне записей, то все реквизиты вернутся 
//                                      со значением Неопределено;
//                                    - если нет прав для работы с таблицей, то возникнет исключение.
//                              - если Ложь, то возникнет исключение при отсутствии прав на таблицу 
//                                или любой из реквизитов.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//            - если в параметр Реквизиты передана пустая строка, то возвращается пустая структура.
//            - если в параметр Ссылка передана пустая ссылка, то возвращается структура, 
//              соответствующая именам реквизитов со значениями Неопределено.
//            - если в параметр Ссылка передана ссылка несуществующего объекта (битая ссылка), 
//              то все реквизиты вернутся со значением Неопределено.
//
Функция ЗначенияРеквизитовОбъектаВызовСервера(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные); 
	
КонецФункции

// См.ОбщегоНазначения.ЗначениеРеквизитаОбъектов 
//
Функция ЗначениеРеквизитаОбъектовВызовСервера(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);
	
КонецФункции

// Функция - Вариант отчета по имени отчета ключу варианта
//
// Параметры:
//  ИмяОтчета	 - Строка - Имя отчета. 
//  КлючВарианта - Строка - Ключ варианта отчета.
// 
// Возвращаемое значение:
//  Справочники.ВариантыОтчетов.Ссылка - ссылка на найденный вариант отчета, либо Неопределено,
//  									 если не нашли.
//
Функция ВариантОтчетаПоИмениОтчетаКлючуВарианта(ИмяОтчета, КлючВарианта) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолноеИмя = Метаданные.Отчеты[ИмяОтчета].ПолноеИмя(); 
	
	ИдентификаторОтчета = Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(ПолноеИмя, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВариантыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет = &Отчет
	|	И ВариантыОтчетов.КлючВарианта = &КлючВарианта";
	Запрос.УстановитьПараметр("Отчет", ИдентификаторОтчета);
	Запрос.УстановитьПараметр("КлючВарианта", КлючВарианта);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
		
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

// См. ОбщегоНазначения.ОписаниеТипаВсеСсылки
//
Функция ОписаниеТипаВсеСсылки() Экспорт 
	
	Возврат ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	
КонецФункции

// Устанавливает/снимает использование набора свойств. Cм. УправлениеСвойствами.УстановитьПараметрыНабораСвойств
//
// Параметры:
//  ИмяНабораСвойств - Строка
//  Использование	 - Булево
//
Процедура УстановитьИспользованиеНабораСвойств(ИмяНабораСвойств, Использование = Истина) Экспорт
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Использование;
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств(ИмяНабораСвойств, ПараметрыНабора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вывести описания изменений в указанной версии.
//
// Параметры:
//  НомерВерсии  – Строка - номер версии, для которого выводится описание из макета
//                          табличного документа МакетОписаниеОбновлений в табличный документ 
//                          ДокументОписаниеОбновлений.
//
Процедура ВывестиОписаниеИзменений(Знач НомерВерсии,
								   ДокументОписаниеОбновлений, 
								   МакетОписаниеОбновлений,
								   ВыводитьЗаголовки = Истина)
	
	Номер = СтрЗаменить(НомерВерсии, ".", "_");
	
	Если МакетОписаниеОбновлений.Области.Найти("Шапка" + Номер) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыводитьЗаголовки Тогда
		ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Шапка" + Номер));	
	КонецЕсли; 
	
	ДокументОписаниеОбновлений.НачатьГруппуСтрок("Версия" + Номер);
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Версия" + Номер));
	ДокументОписаниеОбновлений.ЗакончитьГруппуСтрок();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Отступ"));
	
КонецПроцедуры

// Подготавливает форму, для подсистемы.
// Добавляется реквизит __ПараметрыЗапретаРедактирования тип ФиксированноеСоответствие (см. выше).
//
Процедура ПодготовитьФорму(Форма, Ссылка, НаименованиеГруппыДляКнопкиЗапрета = Неопределено)
	
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	ОписаниеТиповМассив = Новый ОписаниеТипов("СписокЗначений");
	
	// Добавляем реквизит на форму.
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("__ПараметрыЗапретаРедактирования", Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяРеквизита",ОписаниеТиповСтрока100, "__ПараметрыЗапретаРедактирования"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Представление",ОписаниеТиповСтрока100, "__ПараметрыЗапретаРедактирования"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РазрешитьИзменение",ОписаниеТиповБулево, "__ПараметрыЗапретаРедактирования"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("БлокируемыеЭлементы",ОписаниеТиповМассив, "__ПараметрыЗапретаРедактирования"));
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	БлокируемыеРеквизиты = упоФункцииБСП.МенеджерОбъектаПоСсылке(Ссылка).ПолучитьБлокируемыеРеквизитыОбъекта();
	
	Для Каждого БлокируемыйРеквизит Из БлокируемыеРеквизиты Цикл
		
		ОписаниеРеквизита = Форма.__ПараметрыЗапретаРедактирования.Добавить();
		
		ИнформацияОБР = РазложитьСтрокуВМассивПодстрок(БлокируемыйРеквизит, ";");
		
		ОписаниеРеквизита.ИмяРеквизита = ИнформацияОБР[0];
		
		Если ИнформацияОБР.Количество() > 1 Тогда
			БлокируемыеЭлементы = РазложитьСтрокуВМассивПодстрок(ИнформацияОБР[1], ",");
			Для Каждого БлокируемыйЭлемент Из БлокируемыеЭлементы Цикл
				ОписаниеРеквизита.БлокируемыеЭлементы.Добавить(СокрЛП(БлокируемыйЭлемент));
			КонецЦикла;
		КонецЕсли;
		
		ЗаполнитьСвязанныеЭлементы(ОписаниеРеквизита.БлокируемыеЭлементы, Форма, ОписаниеРеквизита.ИмяРеквизита);
		
		Если Ссылка.Метаданные().Реквизиты.Найти(ОписаниеРеквизита.ИмяРеквизита) <> Неопределено Тогда
			Если ЗначениеЗаполнено(Ссылка.Метаданные().Реквизиты[ОписаниеРеквизита.ИмяРеквизита].Синоним) Тогда
				Представление = Ссылка.Метаданные().Реквизиты[ОписаниеРеквизита.ИмяРеквизита].Синоним;
			Иначе
				Представление = Ссылка.Метаданные().Реквизиты[ОписаниеРеквизита.ИмяРеквизита].Имя;
			КонецЕсли;
		ИначеЕсли ЭтоСтандартныйРеквизит(Ссылка, ОписаниеРеквизита.ИмяРеквизита) Тогда
			Если ЗначениеЗаполнено(Ссылка.Метаданные().СтандартныеРеквизиты[ОписаниеРеквизита.ИмяРеквизита].Синоним) Тогда
				Представление = Ссылка.Метаданные().СтандартныеРеквизиты[ОписаниеРеквизита.ИмяРеквизита].Синоним;
			Иначе
				Представление = Ссылка.Метаданные().СтандартныеРеквизиты[ОписаниеРеквизита.ИмяРеквизита].Имя;
			КонецЕсли;
		ИначеЕсли Ссылка.Метаданные().ТабличныеЧасти.Найти(ОписаниеРеквизита.ИмяРеквизита) <> Неопределено Тогда
			Если ЗначениеЗаполнено(Ссылка.Метаданные().ТабличныеЧасти[ОписаниеРеквизита.ИмяРеквизита].Синоним) Тогда
				Представление = Ссылка.Метаданные().ТабличныеЧасти[ОписаниеРеквизита.ИмяРеквизита].Синоним;
			Иначе
				Представление = Ссылка.Метаданные().ТабличныеЧасти[ОписаниеРеквизита.ИмяРеквизита].Имя;
			КонецЕсли;
		КонецЕсли;
		
		ОписаниеРеквизита.Представление = Представление;
		
		ОписаниеРеквизита.РазрешитьИзменение = Ложь;
		
	КонецЦикла;
	
	// Команду формы добавляем только если установлена роль "РедактированиеРеквизитовОбъектов".
	
	Если упоФункцииБСП.ЭтоПолноправныйПользовательИБ()
		И ПравоДоступа("Редактирование", Ссылка.Метаданные()) Тогда
		
		// Добавляем команду.
		Команда = Форма.Команды.Добавить("РазрешитьРедактированиеРеквизитовОбъекта");
		Команда.Заголовок = НСтр("ru = 'Разрешить редактирование реквизитов объекта'");
		Команда.Действие = "Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта";
		Команда.Картинка = БиблиотекаКартинок.РазрешитьРедактированиеРеквизитовОбъекта;
		Команда.ИзменяетСохраняемыеДанные = Ложь;
		
		// Добавляем кнопку на форму.
		Если НаименованиеГруппыДляКнопкиЗапрета <> Неопределено Тогда
			РодительскаяГруппа = НаименованиеГруппыДляКнопкиЗапрета;
		Иначе
			РодительскаяГруппа = Форма.КоманднаяПанель;
		КонецЕсли;
		
		Кнопка = Форма.Элементы.Добавить("РазрешитьРедактированиеРеквизитовОбъекта", Тип("КнопкаФормы"), РодительскаяГруппа);
		Кнопка.ТолькоВоВсехДействиях = Истина;
		Кнопка.ИмяКоманды = "РазрешитьРедактированиеРеквизитовОбъекта";
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет, что текущий реквизит это стандартный реквизит объекта.
//
Функция ЭтоСтандартныйРеквизит(Ссылка, Наименование)
	
	Для Каждого ОписаниеСтандартногоРеквизита Из Ссылка.Метаданные().СтандартныеРеквизиты Цикл
		Если ОписаниеСтандартногоРеквизита.Имя = Наименование Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// По переданному имени реквизита объекта возвращает имя элемента формы,
// ссылающегося на него.
//
Процедура ЗаполнитьСвязанныеЭлементы(МассивСвязанныхЭлементов, Форма, ИмяРеквизита)
	
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		
		Если (ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И ЭлементФормы.Вид <> ВидПоляФормы.ПолеНадписи)
			ИЛИ ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Тогда
			
			РазложенныйПутьКДанным = РазложитьСтрокуВМассивПодстрок(ЭлементФормы.ПутьКДанным, ".");
			Если РазложенныйПутьКДанным.Количество() = 2 И РазложенныйПутьКДанным[1] = ИмяРеквизита Тогда
				МассивСвязанныхЭлементов.Добавить(ЭлементФормы.Имя);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти