////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции инициализации системы.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняется при интерактивном начале работы пользователя с областью данных или в локальном режиме.
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	упоИнициализацияСистемыСервер.ПриНачалеРаботыСистемы();
	
	упоФункцииЗащитыКлиент.ПриНачалеРаботыСистемы();
	
КонецПроцедуры

#КонецОбласти
