
#Область ПрограммныйИнтерфейс

// При проверке доступности системы лицензирования производится проверка на доступность ролей.
//  По умолчанию это роли "упоИспользованиеЗащищенногоФункционалаРМ" и "ПолныеПрава".
//  В этой процедуре можно дополнить массив ИменаРолей своими ролями. Таким образом, пользователям, у которых будут
//  доступны добавленные роли, будет доступна система лицензирования.
//  Пример: ИменаРолей.Добавить("упоБазовыеПраваPM");
//
// Параметры:
//  ИменаРолей	 - Массив	 - имена ролей.
//
Процедура ПриПроверкеДоступностиСистемыЛицензирования(ИменаРолей) Экспорт
	
КонецПроцедуры

// Переопределяет значение заданное в функции упоИнтеграцияВызовСервера.ЭтоERPУХ
//
// Параметры:
//  ЭтоERPУХ - Булево	 - Признак того, что конфигурация является ERP+УХ
//
Процедура ПриОпределенииПризнакаЭтоERPУХ(ЭтоERPУХ) Экспорт
КонецПроцедуры

// Переопределяет тексты запроса для построения дерева хозопераций.
//
// Параметры:
//  ТекстыЗапроса	 - Массив	 - тексты запросов по документам дерева хозопераций.
//  ТаблицыВыборки	 - Массив	 - имена документов дерева хозопераций.
//
Процедура ДобавитьДокументыВДеревоХозопераций(ТекстыЗапроса, ТаблицыВыборки) Экспорт
	
	// Пример:
	// ТекстЗапроса = 
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	// |	ТаблицаДокумента.Ссылка КАК ДокументЗаказ,
	// |	ТаблицаДокумента.Проект КАК Проект,
	// |	ТаблицаДокумента.ДатаОтгрузки КАК ДатаНач,
	// |	NULL КАК ДатаКон,
	// |	ТаблицаДокумента.Автор КАК Ответственный,
	// |	ТаблицаДокумента.ВалютаДокумента КАК ВалютаДокумента,
	// |	ТаблицаДокумента.СуммаДокумента КАК СуммаДокумента
	// |ПОМЕСТИТЬ ЗаказыПокупателя
	// |ИЗ
	// |	Документ.ЗаказПокупателя КАК ТаблицаДокумента
	// |ГДЕ
	// |	ТаблицаДокумента.Проект В(&СписокПроектныхЗадач)
	// |	И &УсловиеОтбораПроведенТаблица"; // Условие для вывода проведенных или всех подряд 
	// Если заполнение происходит из табличной части документа, то нужно использовать "И &УсловиеОтбораПроведенСсылка"
	// ТекстыЗапроса.Добавить(ТекстЗапроса);
	// ТаблицыВыборки.Добавить("ЗаказыПокупателя");	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработкаСобытийПослеЗаписиДанныхВНеподчиненныхРегистрах

// См. упоРаспределениеТрудозатратВызовСервера.лОтразитьПлановыеТрудозатратыЗадачи
//
// Параметры:
//  АктуальныеПланыТрудозатратСводноТекущаяВерсия - ТаблицаЗначений - таблица актуальных трудозатрат.
//
Процедура ПослеЗаписи_АктуальныеТрудозатратыСводноТекущаяВерсия(АктуальныеПланыТрудозатратСводноТекущаяВерсия) Экспорт

КонецПроцедуры

// См. упоИерархияИПолномочияСервер.ЗаписатьАктуальногоРуководителяПроектнойЗадачи
//
Процедура ПослеЗаписи_АктуальныйРуководительПроектнойЗадачи(Задача, РуководительПроектнойЗадачи) Экспорт

КонецПроцедуры

// См. упоЗаданияСервер.ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий
//
Процедура ПослеЗаписи_СрокиЗадания(Задание, ДатаНачала, ДатаОкончания) Экспорт

КонецПроцедуры

// См. упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания
//
Процедура ПослеЗаписи_СтатусКомментарийЗадания(Задание, Статус, Комментарий = "") Экспорт

КонецПроцедуры

#КонецОбласти

Процедура СформироватьЗапросыСвязанныхДокументов(МассивИменСвязанныхОбъектов, МассивТаблицВыборки,
		МассивТекстов, ТолькоПроведенные) Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Проекты"));
	ОписаниеТиповПроект = Новый ОписаниеТипов(МассивТипов);
	
	Для Каждого ЭлементСостава Из Метаданные.КритерииОтбора.СвязанныеДокументы.Состав Цикл
		ПолноеИмяЭлементаСостава = ЭлементСостава.ПолноеИмя();
		ЭтоДокументСчетФактура = Ложь;
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
			ЭтоДокументСчетФактура = СтрНачинаетсяС(ПолноеИмяЭлементаСостава, "Документ.СчетФактура");
		КонецЕсли;	
						
		Если ЭлементСостава.Тип = ОписаниеТиповПроект 
			ИЛИ ЭтоДокументСчетФактура Тогда
			СтруктураПутьКДанным = упоФункцииОбщегоНазначенияСервер.РазобратьПутьКОбъектуМетаданных(ЭлементСостава.ПолноеИмя());
			ИспользоватьДанныеТабличнойЧасти = ЗначениеЗаполнено(СтруктураПутьКДанным.ИмяТаблЧасти);
			СтруктураИменРеквизитов = ПолучитьСтруктуруИменРеквизитовОбъекта(СтруктураПутьКДанным.ВидОбъекта,
					ИспользоватьДанныеТабличнойЧасти);
			МассивИменСвязанныхОбъектов.Добавить(СтруктураПутьКДанным.ВидОбъекта);
			ИспользоватьТабличнуюЧасть = СтруктураПутьКДанным.ПутьКДанным = "ТабличнаяЧасть";
			ШаблонЗапроса = СформироватьШаблонЗапросаСвязанныхДокументов(ИспользоватьТабличнуюЧасть, ТолькоПроведенные);
			МассивИмениТаблицыВыборки = Новый Массив;
			МассивИмениТаблицыВыборки.Добавить(СтруктураПутьКДанным.ВидОбъекта);
			Если ИспользоватьДанныеТабличнойЧасти Тогда
				МассивИмениТаблицыВыборки.Добавить(СтруктураПутьКДанным.ИмяТаблЧасти);
			КонецЕсли;
			
			ИмяТаблицыВыборки = СтрСоединить(МассивИмениТаблицыВыборки);
			
			Если МассивТаблицВыборки.Найти(ИмяТаблицыВыборки) = Неопределено Тогда
				ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗапроса,
						СтруктураПутьКДанным.ВидОбъекта,
						СтруктураИменРеквизитов.ОбъектРасчетов,
						СтруктураПутьКДанным.ИмяТаблЧасти,
						СтруктураПутьКДанным.ИмяРеквизита,
						СтруктураИменРеквизитов.ДатаНач,
						СтруктураИменРеквизитов.ДатаКон,
						СтруктураИменРеквизитов.Ответственный,
						СтруктураИменРеквизитов.ВалютаДокумента,
						СтруктураИменРеквизитов.СуммаДокумента);
				МассивТекстов.Добавить(ТекстЗапроса);
				МассивТаблицВыборки.Добавить(ИмяТаблицыВыборки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьСвойстваСерии(Серии, Активные) Экспорт 

	

КонецПроцедуры

// Переопределяет таблицы для хранения данных, извлекаемых из файла MS Project. 
//
// Параметры:
//   Данные – Структура - содержит пустые таблицы для хранения данных.
//
// Возвращаемое значение:
//   Структура   – содержит пустые таблицы для хранения данных.
//
Функция ДополнитьСтруктуруДляРазбораДанныхMSP(Данные) Экспорт 
	
	Возврат Данные;
	
КонецФункции

// Переопределяет тип значения атрибута проектной задачи. 
//
// Параметры:
//   ПолеПроектнойЗадачи – Строка - имя атрибута проектной задачи.
//
// Возвращаемое значение:
//   Неопределено, ОписаниеТипов  – тип значения атрибута проектной задачи.
//
Функция ТипЗначенияДополнительногоАтрибута(ПолеПроектнойЗадачи) Экспорт 

	Возврат Неопределено;
	
КонецФункции

// Переопределяет получение значения атрибута проектной задачи.
//
// Параметры:
//   СтрокаАтрибута – Структура - содержит параметры атрибута.
//   Док – ДокументОбъект.упоПроектнаяЗадача - проектная задача для которой определяется атрибут.
//   Переопределено – Булево - признак, что значение переопределено.
//
Процедура ПолучитьЗначениеДопАтрибута(СтрокаАтрибута, Док, Переопределено) Экспорт
	
	Переопределено = Ложь;
	
КонецПроцедуры  

// Переопределяет структуру мапинга данных, извлекаемых из
// файла MSP на колонки таблиц значений.
//
// Параметры:
//  ТипУзла  – Строка - имя узла XML-документа.
//  Мапинг  - Структура – содержит правила мапинга данных.
//  СписокДат - СписокЗначений – содержит список полей в которых хранятся сроки.
//
Процедура ДополнитьКартуМапингаПолейMSP(ТипУзла, Мапинг, СписокДат) Экспорт

КонецПроцедуры         

// Переопределяет список узлов XML файла.
//
// Параметры:
//  СписокУзлов  – СписокЗначений - содержит имена узлов для обработки.
//
Процедура ДополнитьСписокУзлов(СписокУзлов) Экспорт
	
КонецПроцедуры 

// Переопределяет разбор узла XML файла.
//
// Параметры:
//  СтруктраПараметров  – Структура - содержит дополнительные параметры для разбора узла.
//  ТекСтрокаТЗ – СтрокаТаблицыЗначений - содержит строку таблицы значений с данными по проектной задаче.
//  НуженМапингПолей  – Булево - признак, что нужно получить карту мапинга полей MSP.
//
Процедура ДополнитьРазборУзела(СтруктраПараметров, ТекСтрокаТЗ, НуженМапингПолей) Экспорт
	
КонецПроцедуры

// Переопределяет проектные задачи, которыми фиксируется содержание проекта в ИБ.
//
// Параметры:
//  Параметры  – Структура - содержит дополнительные параметры для определения проектной задачи.
//  Документ  – ДокументОбъект.упоПроектнаяЗадача - проектная задача.
//
Процедура ПереопределитьПроектнуюЗадачу(Параметры, Документ) Экспорт
	
КонецПроцедуры

// Переопределяет сроки проектной задачи.
//
// Параметры:
//  Документ  – ДокументОбъект.упоПроектнаяЗадача - проектная задача.
//  СтрокаПЗ – СтрокаТаблицыЗначений - содержит строку таблицы значений с данными по проектной задаче.
//  Параметры  – Структура - содержит дополнительные параметры для определения сроков проектной задачи.
//
Процедура ПереопределитьДатыПЗ(Док, СтрокаПЗ, Параметры) Экспорт
	
КонецПроцедуры

//Записывает дополнительные данные по проектным задачам, которыми фиксируется содержание проекта в ИБ.
//
// Параметры:
//  Параметры  – Структура - набор параметров (настроек).
//  Данные  – Структура - содержит таблицы, которые заполняются данными в процессе разбора и проверки.
//  СписокДокументов - Структура - структура таблиц документов (проектных задач) по типам.
//
Процедура ЗаписатьДополнительныеДанныеПроекта(Параметры, Данные, СписокДокументов) Экспорт
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруИменРеквизитовОбъекта(ИмяОбъекта, ИзТабличнойЧасти = Ложь)
	
	СтруктураИменРеквизитов = Новый Структура;
	СтруктураИменРеквизитов.Вставить("ДатаНач", 		"NULL");
	СтруктураИменРеквизитов.Вставить("ДатаКон", 		"NULL");
	СтруктураИменРеквизитов.Вставить("Ответственный", 	"NULL");
	СтруктураИменРеквизитов.Вставить("ВалютаДокумента", "NULL");
	СтруктураИменРеквизитов.Вставить("СуммаДокумента", 	"0");
	СтруктураИменРеквизитов.Вставить("ОбъектРасчетов", 	"НЕОПРЕДЕЛЕНО");
	
	Если ИмяОбъекта = "АктВыполненныхРабот" Тогда
		
		//СтруктураИменРеквизитов.ДатаНач 		= "Объект.Ссылка.ДатаПлатежа";
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Ссылка.Автор";     
		
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
			
			СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.ВалютаДокумента";
			
			Если ИзТабличнойЧасти Тогда
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.Сумма";
			Иначе
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";	
			КонецЕсли;	
			
		Иначе
		
			СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.Валюта";
			СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаСНДС";

		КонецЕсли;
	
	ИначеЕсли ИмяОбъекта = "ЗаказКлиента" Тогда
		
		СтруктураИменРеквизитов.ДатаНач 		= "Объект.ДатаОтгрузки";
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Автор";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Валюта";
		СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";
		
	ИначеЕсли ИмяОбъекта = "ЗаказНаПроизводство" Тогда
		
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Ответственный";
		
	ИначеЕсли ИмяОбъекта = "ЗаказПокупателя" Тогда
		
		СтруктураИменРеквизитов.ДатаНач 		= "Объект.ДатаОтгрузки";
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Автор";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.ВалютаДокумента";
		СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";	
		
	// Для заказа поставщику важен порядок следования условий
	ИначеЕсли ИмяОбъекта = "ЗаказПоставщику" И упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		
		СтруктураИменРеквизитов.ДатаНач 		= "Объект.ДатаПоступления";
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Автор";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.ВалютаДокумента";
		СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";
		
	ИначеЕсли ИмяОбъекта = "ЗаказПоставщику" Тогда
		
		СтруктураИменРеквизитов.ДатаНач 		= "Объект.ДатаПоступления";
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Автор";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Валюта";
		СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";  
		
	ИначеЕсли ИмяОбъекта = "ПоступлениеБезналичныхДенежныхСредств" Тогда
		
		СтруктураИменРеквизитов.ДатаНач 		= "Объект.Ссылка.ДатаВходящегоДокумента";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.Валюта";
		СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.Сумма";
		СтруктураИменРеквизитов.ОбъектРасчетов  = "Объект.ОбъектРасчетов.Объект";
				
	ИначеЕсли ИмяОбъекта = "ПриобретениеТоваровУслуг" Тогда
		
		//СтруктураИменРеквизитов.ДатаНач 		= "Объект.Ссылка.ДатаПлатежа";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.Валюта";
		СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаСНДС";
		
	ИначеЕсли ИмяОбъекта = "ПриходныйКассовыйОрдер" Тогда
		
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Ссылка.Кассир";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.Валюта";
		СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.Сумма";
		СтруктураИменРеквизитов.ОбъектРасчетов  = "Объект.ОбъектРасчетов.Объект";
		
	ИначеЕсли ИмяОбъекта = "РасходныйКассовыйОрдер" Тогда
		
		Если ИзТабличнойЧасти Тогда
			СтруктураИменРеквизитов.Ответственный 	= "Объект.Ссылка.Кассир";
			СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.Валюта";
			СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.Сумма";
			СтруктураИменРеквизитов.ОбъектРасчетов = "Объект.ЗаявкаНаРасходованиеДенежныхСредств";
		Иначе
			СтруктураИменРеквизитов.Ответственный 	= "Объект.Кассир";
			СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Валюта";
			СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";
		КонецЕсли;
		
	ИначеЕсли ИмяОбъекта = "РеализацияТоваровУслуг" Тогда
		
		//СтруктураИменРеквизитов.ДатаНач 		= "Объект.Ссылка.ДатаПлатежа";
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5() Тогда
			СтруктураИменРеквизитов.ДатаКон 		= "Объект.Ссылка.Дата";
		Иначе	
			СтруктураИменРеквизитов.ДатаКон 		= "Объект.Ссылка.ДатаРаспоряжения";
		КонецЕсли;	
		СтруктураИменРеквизитов.Ответственный 	= "Объект.Ссылка.Автор";
		СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.Валюта";
		СтруктураИменРеквизитов.СуммаДокумента  = "Объект.СуммаСНДС";
		
	ИначеЕсли ИмяОбъекта = "СписаниеБезналичныхДенежныхСредств" Тогда
		
		Если ИзТабличнойЧасти Тогда
			СтруктураИменРеквизитов.ДатаНач 		= "Объект.Ссылка.ДатаВходящегоДокумента";
			СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.Валюта";
			СтруктураИменРеквизитов.СуммаДокумента  = "Объект.Сумма";
			СтруктураИменРеквизитов.ОбъектРасчетов = "Объект.ОбъектРасчетов.Объект";
		Иначе     
			СтруктураИменРеквизитов.ДатаНач 		= "Объект.ДатаВходящегоДокумента";
			СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Валюта";
			СтруктураИменРеквизитов.СуммаДокумента  = "Объект.СуммаДокумента";
		КонецЕсли;
		
	ИначеЕсли ИмяОбъекта = "ПоступлениеВКассу" ИЛИ
		ИмяОбъекта = "ПоступлениеНаСчет" ИЛИ
		ИмяОбъекта = "РасходИзКассы" ИЛИ 
		ИмяОбъекта = "РасходСоСчета" Тогда
		
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
			
			Если ИзТабличнойЧасти Тогда
				СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.ВалютаДенежныхСредств";
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаПлатежа";	
			Иначе
				СтруктураИменРеквизитов.ВалютаДокумента = "Объект.ВалютаДенежныхСредств";
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";	
			КонецЕсли;
			
		КонецЕсли;	
		
	ИначеЕсли ИмяОбъекта = "РасходнаяНакладная"
		ИЛИ ИмяОбъекта = "ПриходнаяНакладная" Тогда
	
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
			
			Если ИзТабличнойЧасти Тогда
				СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.ВалютаДокумента";
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.Сумма";	
			Иначе
				СтруктураИменРеквизитов.ВалютаДокумента = "Объект.ВалютаДокумента";
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";	
			КонецЕсли;
			
		КонецЕсли;		
		
	ИначеЕсли ИмяОбъекта = "СчетФактураПолученный" Тогда
	
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
			
			Если ИзТабличнойЧасти Тогда
				СтруктураИменРеквизитов.ВалютаДокумента = "Объект.Ссылка.ВалютаДокумента";
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.Ссылка.СуммаДокумента";	
			Иначе
				СтруктураИменРеквизитов.ВалютаДокумента = "Объект.ВалютаДокумента";
				СтруктураИменРеквизитов.СуммаДокумента 	= "Объект.СуммаДокумента";	
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат СтруктураИменРеквизитов;
		
КонецФункции

Функция СформироватьШаблонЗапросаСвязанныхДокументов(ИспользоватьТабличнуюЧасть, ТолькоПроведенные)
	
	СтруктураУсловий = ПолучитьСтруктуруДинамическихУсловийЗапроса(ИспользоватьТабличнуюЧасть, ТолькоПроведенные);
	
	МассивТекстаЗапроса = Новый Массив;
	МассивТекстаЗапроса.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Объект.Ссылка КАК ДокументЗаказ,
		|	%2 КАК ОбъектРасчетов,
		|	%4 КАК Проект,
		|	%5 КАК ДатаНач,
		|	%6 КАК ДатаКон,
		|	%7 КАК Ответственный,
		|	%8 КАК ВалютаДокумента,
		|	СУММА(%9) КАК СуммаДокумента,
		|   0 КАК СуммаДоход,
		|   0 КАК СуммаРасход 
		|ПОМЕСТИТЬ %1%3
		|ИЗ
		|	Документ.%1");
	МассивТекстаЗапроса.Добавить(СтруктураУсловий.ПутьКТабличнойЧасти);
	МассивТекстаЗапроса.Добавить("%3 КАК Объект
		|ГДЕ
		|	Объект.%4 В(&СписокПроектныхЗадач)
		|	");
	МассивТекстаЗапроса.Добавить(СтруктураУсловий.УсловиеПроведения);
	МассивТекстаЗапроса.Добавить("
		|	
		|СГРУППИРОВАТЬ ПО
		|	Объект.Ссылка,
		|	%2,
		|	Объект.%4");
	ШаблонЗапроса = СтрСоединить(МассивТекстаЗапроса);
	
	Возврат ШаблонЗапроса;
	
КонецФункции

Функция ПолучитьСтруктуруДинамическихУсловийЗапроса(ИспользоватьТабличнуюЧасть, ТолькоПроведенные)
	
	СтруктураУсловий = Новый Структура("ПутьКТабличнойЧасти, УсловиеПроведения", "", "");
	
	СтруктураУсловий.ПутьКТабличнойЧасти = ?(ИспользоватьТабличнуюЧасть, ".", "");
	
	Если ТолькоПроведенные Тогда
		СтруктураУсловий.УсловиеПроведения = ?(ИспользоватьТабличнуюЧасть, "И Объект.Ссылка.Проведен", "И Объект.Проведен");
	КонецЕсли;
	
	Возврат СтруктураУсловий;
	
КонецФункции

#КонецОбласти

