
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ДанныеВыбора = Новый СписокЗначений;
    МассивИсключения = Новый Массив; 
    ПеречислениеМенеджер = Перечисления.упоВидРаспределенияОПРиОХРпоПодразделениям; 
	
	Если Не (ИспользуетсяМодульСогласованиеЧасов() Или ИспользуетсяПодсистемаСогласованиеТрудозатрат()) Тогда
        МассивИсключения.Добавить(ПеречислениеМенеджер.ПоСогласованнымЧасам);
        МассивИсключения.Добавить(ПеречислениеМенеджер.ПоСтоимостиСогласованныхЧасов);
	КонецЕсли;      
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределенияОПРОХР() Тогда
        МассивИсключения.Добавить(ПеречислениеМенеджер.НаУказанныеПодразделения);
        МассивИсключения.Добавить(ПеречислениеМенеджер.ПоПрямым);
	КонецЕсли;		
	
    Запрос = Новый Запрос; 
    Запрос.УстановитьПараметр("МассивИсключения", МассивИсключения);
    
    Запрос.Текст = "ВЫБРАТЬ
    |    Перечисление.Ссылка КАК Ссылка
    |ИЗ
    |    Перечисление.упоВидРаспределенияОПРиОХРпоПодразделениям КАК Перечисление
    |ГДЕ
    |    НЕ Перечисление.Ссылка В (&МассивИсключения)";
    
    РезультатЗапроса = Запрос.Выполнить();        
    ДанныеВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));    
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяМодульСогласованиеЧасов()
	
	Возврат упоИнтеграция.ИспользуетсяМодульСогласованиеЧасов();
	
КонецФункции // ЕстьМодульСогласованиеЧасов()

Функция ИспользуетсяПодсистемаСогласованиеТрудозатрат()

	Возврат Константы.упоИспользоватьПодсистемуСогласованиеТрудозатрат.Получить();

КонецФункции // ИспользуетсяПодсистемаСогласованияЧасов()
 
#КонецОбласти

#КонецЕсли
