////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с проектами и задачами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает значение устаревших реквизитов
// (требуются для совместимости с функционалом редакции 1)
// по значению реквизита ТипПроектнойЗадачи.
//
// Параметры:
//	ЗадачаОбъект - ДокументСсылка.упоПроектнаяЗадача, ДокументОбъект.упоПроектнаяЗадача - задача,
//					для которой нужно узнать и записть тип.
//
Процедура ЗаписатьТипЗадачи(ЗадачаОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(ЗадачаОбъект.ТипПроектнойЗадачи) Тогда
		УстановитьТипЗадачи(ЗадачаОбъект);
	КонецЕсли; 	
	
	Если ЗадачаОбъект.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Этап") Тогда
		ЗадачаОбъект.ЭтоМодельПакетаРабот = Ложь;                                                                  
		ЗадачаОбъект.ЭтоПакетРабот = Ложь;
		ЗадачаОбъект.ЭтоВеха = Ложь;		
	ИначеЕсли ЗадачаОбъект.ТипПроектнойЗадачи = 
		ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.ПакетРабот") Тогда
		ЗадачаОбъект.ЭтоМодельПакетаРабот = Ложь;
		ЗадачаОбъект.ЭтоПакетРабот = Истина;
		ЗадачаОбъект.ЭтоВеха = Ложь;		
	ИначеЕсли ЗадачаОбъект.ТипПроектнойЗадачи = 
		ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот") Тогда
		ЗадачаОбъект.ЭтоМодельПакетаРабот = Истина;
		ЗадачаОбъект.ЭтоПакетРабот = Истина;
		ЗадачаОбъект.ЭтоВеха = Ложь;		
	ИначеЕсли ЗадачаОбъект.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Веха") Тогда
		ЗадачаОбъект.ЭтоМодельПакетаРабот = Ложь;
		ЗадачаОбъект.ЭтоПакетРабот = Ложь;		
		ЗадачаОбъект.ЭтоВеха = Истина;		
	КонецЕсли; 
	
	Если ЗадачаОбъект.ТипПроектнойЗадачи = 
		ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот") Тогда
		Если Не ЗначениеЗаполнено(ЗадачаОбъект.ЕдиницаНормированияДлительности) Тогда
			ЗадачаОбъект.ЕдиницаНормированияДлительности = ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.РабочийДень");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

// Устанавливает видимость элементов формы проектной задачи.
//
// Параметры:
//  Объект			 - ДокументСсылка.упоПроектнаяЗадача, ДокументОбъект.упоПроектнаяЗадача	 - объект,
//  	из которого берутся значения реквизитов для установки видимости элементов.
//  Форма			 - УправляемаяФорма	 - форма, на которой необходимо установить видимость элементов.
//  СтруктураСвойств - Структура		 - структура предварительно полученных проектных опций. Передается в случае,
//  	если проектные опции были получены в вызывающем объекте и нет необходимости их повторно инициировать.
//
Процедура УстановитьВидимостьЭлементовФормыПроектнойЗадачи(Объект, Форма, СтруктураСвойств = Неопределено) Экспорт
	
	Если СтруктураСвойств = Неопределено Тогда
		СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Форма.ИспользоватьАналитикуКонтрагентДляСС = СтруктураСвойств.ИспользоватьАналитикуКонтрагентДляСС;
	
	Элементы.СтраницаФинансы.Видимость = ЭтоЗадачаСФинансами(СтруктураСвойств);
	
	// Доходы
	Элементы.СтраницаПланДоходов.Видимость = СтруктураСвойств.ВедетсяБюджетДоходов;
	Элементы.РамкаГруппыРаспределениеПоПодразделениям.Видимость = СтруктураСвойств.ДоходыПоПодразделениям;

	Элементы.РаспределениеДоходовГруппаОбъемыПоПодразделениям.Видимость = СтруктураСвойств.ДоходыПоОбъемам 
		И Не СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
		
	Элементы.ПланДоходовЗаполнитьПоРолям.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
	Элементы.РаспределениеДоходовЗаполнитьПоРолям.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
	Элементы.ПланДоходовЗаполнитьПоПланамРесурсов.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту 
		Или СтруктураСвойств.ПланироватьЗатратыНаМатериалы;		
	Элементы.РаспределениеДоходовЗаполнитьПоПланамРесурсов.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту
		Или СтруктураСвойств.ПланироватьЗатратыНаМатериалы;
	Элементы.ПланДоходовЗаполнитьПоПлануМатериальныхРесурсов.Видимость = СтруктураСвойств.ПланироватьЗатратыНаМатериалы;	
	Элементы.РаспределениеДоходовЗаполнитьПоПлануМатериальныхРесурсов.Видимость = 
		СтруктураСвойств.ПланироватьЗатратыНаМатериалы;
		
	Элементы.РаспределениеДоходовРаспределитьПоПериодамПланДоходов.Видимость = СтруктураСвойств.ДоходыПоОбъемам 
		И Не СтруктураСвойств.ДоходыПоНатуральнымПоказателям;

	// Расходы
	Элементы.СтраницаПланРасходов.Видимость = СтруктураСвойств.ВедетсяБюджетРасходов;
	Элементы.ГруппаРаспределениеРасходов.Видимость = СтруктураСвойств.РасходыПоПодразделениям;
	
	Элементы.РаспределениеРасходовГруппаОбъемыПоПодразделениям.Видимость = СтруктураСвойств.РасходыПоПодразделениям
		И СтруктураСвойств.РасходыПоОбъемам 
		И Не СтруктураСвойств.РасходыПоНатуральнымПоказателям;
		
	Элементы.ПланРасходовЗаполнитьПоТрудовымРесурсам.Видимость = СтруктураСвойств.ВедетсяБюджетРасходов 
		И СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
		
	Элементы.ПланРасходовПланРасходов_ЗаполнитьЗатраты.Видимость = СтруктураСвойств.ПланироватьЗатратыНаМатериалы
		Или СтруктураСвойств.ПланироватьТрудозатратыПоПроекту
		Или СтруктураСвойств.ПланироватьДополнительныеЗатратыПоЗадаче;
		
	Элементы.ПодменюЗаполнитьПоТрудовымРесурсам.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту; 
	
	Элементы.РаспределениеРасходовРаспределитьПоПериодамПланРасходов.Видимость = СтруктураСвойств.РасходыПоПодразделениям
		И СтруктураСвойств.РасходыПоОбъемам 
		И Не СтруктураСвойств.РасходыПоНатуральнымПоказателям;

	// Доп.затраты
	Элементы.СтраницаДопЗатраты.Видимость = СтруктураСвойств.ПланироватьДополнительныеЗатратыПоЗадаче;
	Элементы.ДополнительныеЗатратыГруппаНастройкиБДР.Видимость = СтруктураСвойств.ПланироватьДополнительныеЗатратыПоЗадаче
		И Объект.ВключитьДопЗатратыВПланРасходов;
	Элементы.ГруппаРаспределениеДополнительныхЗатрат.Видимость = СтруктураСвойств.ПланироватьДополнительныеЗатратыПоЗадаче 
		И Объект.ВключитьДопЗатратыВПланРасходов 
		И СтруктураСвойств.РасходыПоПодразделениям;
		
	Элементы.РаспределениеДополнительныхЗатратГруппаОбъемыПоПодразделениям.Видимость = 
		СтруктураСвойств.РасходыПоПодразделениям
		И СтруктураСвойств.РасходыПоОбъемам 
		И Не СтруктураСвойств.РасходыПоНатуральнымПоказателям;
	
		
	// Объемы
	Элементы.СтраницаПланВыпуска.Видимость 		= СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	Элементы.СтраницаОсвоенныеОбъемы.Видимость 	= СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	
	Элементы.СубпродуктыГруппаНастройкиБДР.Видимость = Объект.ВключитьСубпродуктыВПланДоходов;
	
	Элементы.ГруппаРаспределениеОбъемовПоПодразделениям.Видимость = 
		УчетСубпродуктовПоПодразделениям(СтруктураСвойств, Объект.ВключитьСубпродуктыВПланДоходов);
		
	Элементы.ГруппаРаспределениеОбъемовПоПодразделениямРаспределениеПоПрофилю.Видимость = 
		УчетДоходныхОбъемовПоПодразделениям(СтруктураСвойств, Объект.ВключитьСубпродуктыВПланДоходов);
		
	Элементы.СубпродуктыГруппаЗаполнитьПоРолям.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
	Элементы.СубпродуктыПоПодразделениямГруппаЗаполнитьПоРолям.Видимость = 
		СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
				
	// Трудозатраты
	ПрименитьСвойство_ПланироватьТрудозатратыПоПроекту(Элементы, 
		СтруктураСвойств.ПланироватьТрудозатратыПоПроекту);
		
	ПрименитьСвойство_УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат(Элементы, 
		СтруктураСвойств.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат);
	
	Элементы.УровеньПланированияТрудозатратДляБДР.Доступность = Объект.ВключитьТрудРесурсыВПланРасходов;
	
	Элементы.ГруппаРаспределениеПотребностейРаспределениеПоПрофилю.Видимость = СтруктураСвойств.РасходыПоОбъемам 
		Или Объект.ВключитьМатРесурсыВПланРасходов;
	
	// Мат.затраты
	Элементы.СтраницаМатериалыИОборудование.Видимость = СтруктураСвойств.ПланироватьЗатратыНаМатериалы;
	
	Элементы.МатериальныеРесурсыГруппаНастройкиБДР.Видимость = Объект.ВключитьМатРесурсыВПланРасходов;
	
	Элементы.ГруппаРаспределениеПотребностей.Видимость = 
		УчетМатРесурсовПоПодразделениям(СтруктураСвойств, Объект.ВключитьМатРесурсыВПланРасходов);
		
	Элементы.РаспределениеПотребностейГруппаСпособПривязки.Видимость = СтруктураСвойств.РасходыПоНатуральнымПоказателям
		Или (СтруктураСвойств.РасходыПоОбъемам И Объект.ВключитьМатРесурсыВПланРасходов);
	Элементы.ГруппаРаспределениеПотребностейРаспределениеПоПрофилю.Видимость = 
		СтруктураСвойств.РасходыПоНатуральнымПоказателям 
		Или (СтруктураСвойств.РасходыПоОбъемам И Объект.ВключитьМатРесурсыВПланРасходов);
    Элементы.РаспределениеПотребностейГруппаКоличествоСуммаРаспределение.Видимость = 
		СтруктураСвойств.РасходыПоНатуральнымПоказателям 
		Или (СтруктураСвойств.РасходыПоОбъемам И Объект.ВключитьМатРесурсыВПланРасходов);
		
	Элементы.РаспределениеПотребностейРаспределитьПоПериодамМатРесурсы.Видимость = 
		СтруктураСвойств.РасходыПоНатуральнымПоказателям Или (СтруктураСвойств.РасходыПоОбъемам
		И Объект.ВключитьМатРесурсыВПланРасходов);
	
	// ДДС
	ПрименитьСвойство_ВедетсяБюджетДвиженияДенежныхСредств(Элементы, 
		СтруктураСвойств.ВедетсяБюджетДвиженияДенежныхСредств,
		Ложь);
	
	// Сроки
	Элементы.ДатаНачалаПлан.АвтоОтметкаНезаполненного 		= Объект.РучнойВводСроков;
	Элементы.ДатаНачалаПлан.Доступность 					= Объект.РучнойВводСроков И Не Объект.ЭтоВеха;
	Элементы.ДатаЗавершенияПлан.АвтоОтметкаНезаполненного 	= Объект.РучнойВводСроков;
	Элементы.ДатаЗавершенияПлан.Доступность 				= Объект.РучнойВводСроков;
	
	Элементы.ГруппаДлительность.Видимость = Объект.ЭтоМодельПакетаРабот;
	
	Элементы.ЕдиницаНормированияДлительности.ТолькоПросмотр = Объект.ДлительностьБезУчетаКалендаряПроекта;
	
	// Связи
	Элементы.СтраницаСоставЗадачи.Видимость = Не Объект.ЭтоПакетРабот И Не Объект.ЭтоМодельПакетаРабот;
	Элементы.ПредупреждениеОНеактивностиСвязейДляРасчетаСроков.Видимость = Объект.РучнойВводСроков;
	
	// Заказы
	Элементы.СтраницаЗаказыПокупателей.Видимость = СтруктураСвойств.ИспользоватьЗаказыКлиентов 
		И СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	Элементы.СтраницаЗаказыПоставщикам.Видимость = СтруктураСвойств.ИспользоватьЗаказыПоставщикам;
	Элементы.СтраницаЗаказыНаПроизводство2_1.Видимость = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	Элементы.СтраницаЗаказыНаПроизводство2_2.Видимость = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	
КонецПроцедуры

// Устанавливает тип проектной задачи.
//
// Параметры:
//  ЗадачаОбъект - ДокументСсылка.упоПроектнаяЗадача, ДокументОбъект.упоПроектнаяЗадача - задача,
//					для которой нужно установить тип.
//
Процедура УстановитьТипЗадачи(ЗадачаОбъект) Экспорт

	ЗадачаОбъект.ТипПроектнойЗадачи = ПолучитьТипЗадачи(ЗадачаОбъект);
	
КонецПроцедуры

// Возвращает тип проектной задачи.
//
// Параметры:
//  ЗадачаОбъект - ДокументСсылка.упоПроектнаяЗадача, ДокументОбъект.упоПроектнаяЗадача, Структура 
//	- задача или ее свойства, для которой нужно установить тип.
//					
// Возвращаемое значение:
//	ПеречислениеСсылка.упоТипПроектнойЗадачи   - Тип проектной задачи.
//
Функция ПолучитьТипЗадачи(ЗадачаОбъект) Экспорт

	Если ЗадачаОбъект.ЭтоВеха Тогда
		ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Веха");
	ИначеЕсли ЗадачаОбъект.ЭтоМодельПакетаРабот Тогда
		ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот");
	ИначеЕсли ЗадачаОбъект.ЭтоПакетРабот Тогда 		
		ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.ПакетРабот");
	Иначе
		ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Этап");
	КонецЕсли; 
	
	Возврат ТипПроектнойЗадачи;

КонецФункции

// Возвращает заголовок кнопки смены статуса в панели статусов проекта.
//
// Параметры:
//  Статус  - ПеречислениеСсылка.упоСостояниеСтатусаПроекта - статус.
//
// Возвращаемое значение:
//	Строка   - заголовок кнопки.
//
Функция ПолучитьЗаголовокКнопкиПоСтатусу(Знач Статус) Экспорт
	Возврат ?(ЗначениеЗаполнено(Статус), Статус, "Без статуса");
КонецФункции

// Возвращает статус по имени кнопки.
//
// Параметры:
//  ИмяКнопки  - Строка - имя кнопки.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.упоСостояниеСтатусаПроекта - статус.
//
Функция ПолучитьСтатусПоИмениКнопки(Знач ИмяКнопки) Экспорт
	
	ИмяСтатуса = СтрЗаменить(ИмяКнопки, "КнопкаСтатуса", "");
	
	Возврат ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаПроекта." 
		+ ?(ИмяСтатуса = "БезСтатуса", "ПустаяСсылка", ИмяСтатуса));
		
КонецФункции

// Возвращает имя кнопки смены статуса в панели статусов проекта по статусу.
//
// Параметры:
//  Статус  - ПеречислениеСсылка.упоСостояниеСтатусаПроекта - статус.
//
// Возвращаемое значение:
//   Строка   - имя кнопки.
//
Функция ПолучитьИмяКнопкиПоСтатусу(Статус) Экспорт
	Возврат "КнопкаСтатуса" + ?(ЗначениеЗаполнено(Статус), Статус, "БезСтатуса");
КонецФункции

// Обновляет дату привязки в строке.
//
// Параметры:
//  Сроки		 - Структура							 - свойства:
//  							* НачалоПлан		- Дата - дата начала.
//  							* ЗавершениеПлан	- Дата - дата окончания.
//  Проект		 - СправочникСсылка.Проекты				 - проект.
//  НекаяСтрока	 - ДанныеФормыЭлементКоллекции, Структура	 - данные строки.
//
Процедура ОбновитьДатуПривязкиВСтроке(Сроки, Проект, НекаяСтрока) Экспорт
	
	Если Не ЗначениеЗаполнено(Сроки) Тогда
		ДатаНач = Неопределено;
	ИначеЕсли НекаяСтрока.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоЗадачи") Тогда
		ДатаНач = Сроки.НачалоПлан;
	ИначеЕсли НекаяСтрока.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НачалоПроекта")
		И Сроки.Свойство("НачалоПланПроект") Тогда
		ДатаНач = Сроки.НачалоПланПроект;
	ИначеЕсли НекаяСтрока.СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеЗадачи") Тогда
		ДатаНач = Сроки.ЗавершениеПлан;
	ИначеЕсли НекаяСтрока.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.ЗавершениеПроекта")
		И Сроки.Свойство("ЗавершениеПланПроект") Тогда
		ДатаНач = Сроки.ЗавершениеПланПроект;
	Иначе
		Возврат;
	КонецЕсли;
	
	Задержка = НекаяСтрока.Задержка;
	НоваяДатаПривязки = упоУправлениеФормамиСервер.РассчитатьЗадержкуПоКалендарю(ДатаНач, Задержка, Проект);	
	
	Если НЕ НекаяСтрока.ДатаПривязки = НоваяДатаПривязки Тогда
		НекаяСтрока.ДатаПривязки = НоваяДатаПривязки;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет заполнение профиля распределения и даты привязки в строке,
//  для которой установлен способ привязки "По профилю" или "К конкретной дате".
//
// Параметры:
//  Объект						 - ДокументОбъект, СправочникОбъект, ДанныеФормы - объект, для табличных частей которого делается проверка.
//  СтрокаПроверки				 - СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекции - строка табличной части,
//  для которой выполняется проверка.
//  НаименованиеТабличнойЧасти	 - Строка											 - имя табличной части, для которой выполняется проверка.
//  ПредставлениеТабличнойЧасти	 - Строка											 - представление табличной части в сообщении об ошибке.
//  Отказ						 - Булево											 - флаг успешности проверки.
//  НомерСтроки					 - Число
//
Процедура ПроверитьЗаполнениеСпособаПривязки(Объект, 
											СтрокаПроверки, 
											НаименованиеТабличнойЧасти, 
											ПредставлениеТабличнойЧасти, 
											Отказ, 
											Знач НомерСтроки = Неопределено) Экспорт
	
	ИмяПоляПрофильРаспределения = "ПрофильРаспределения";
	ИмяПоляДатаПривязки = "ДатаПривязки";
	ИмяПоляСпособПривязки = "СпособПривязки";
	Если НаименованиеТабличнойЧасти = "ПараметрыРасчета" Тогда
		ИмяПоляСпособПривязки = "ВидПривязки";
	ИначеЕсли НаименованиеТабличнойЧасти = "ДополнительныеЗатраты" Тогда
		ИмяПоляСпособПривязки = "СпособПривязкиДоходовРасходов";	
		ИмяПоляПрофильРаспределения = "ПрофильРаспределенияДоходовРасходов";
		ИмяПоляДатаПривязки = "ДатаПривязкиДоходовРасходов";
	КонецЕсли;
	
	Если НомерСтроки = Неопределено Тогда
		НомерСтроки = СтрокаПроверки.НомерСтроки;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("УправляемаяФорма") Тогда 				
		КлючДанных = Неопределено;
		ПутьКДанным = "";
	ИначеЕсли ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		КлючДанных = Объект.Ссылка;
		ПутьКДанным = "Объект";
	Иначе	
		КлючДанных = Объект;
		ПутьКДанным = "Объект";
	КонецЕсли;	
	
	ШаблонСообщения = НСтр("ru = 'В строке №%1 табличной части ""%2"": Необходимо заполнить значение реквизита ""%3""'");
	
	Если ЭтоСпособПривязкиПоПрофилю(СтрокаПроверки[ИмяПоляСпособПривязки])
		И Не ЗначениеЗаполнено(СтрокаПроверки[ИмяПоляПрофильРаспределения]) Тогда				
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
																				НомерСтроки, 
																				ПредставлениеТабличнойЧасти, 
																				"Профиль распределения");
		Поле = ИмяПоляДляСообщения(НаименованиеТабличнойЧасти, 
									Объект[НаименованиеТабличнойЧасти].Индекс(СтрокаПроверки), 
									ИмяПоляПрофильРаспределения);
							
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КлючДанных, Поле, ПутьКДанным, Отказ);
		
	ИначеЕсли ЭтоСпособПривязкиНаДату(СтрокаПроверки[ИмяПоляСпособПривязки])
		И Не ЗначениеЗаполнено(СтрокаПроверки[ИмяПоляДатаПривязки]) Тогда		
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
																				НомерСтроки, 
																				ПредставлениеТабличнойЧасти, 
																				"Дата привязки");				
		Поле = ИмяПоляДляСообщения(НаименованиеТабличнойЧасти, 
									Объект[НаименованиеТабличнойЧасти].Индекс(СтрокаПроверки), 
									ИмяПоляДатаПривязки);
				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КлючДанных, Поле, ПутьКДанным, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

// Получить статус задачи по проценту готовности
//
// Параметры:
//  ПроцентГотовности	 - Число	 - Процент готовности.
//  ТекущийСтатус		 - 	ПеречислениеСсылка.упоСостояниеСтатусаЗадачи - 
//								Установленный на данный момент статус (Необязательный).
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.упоСостояниеСтатусаЗадачи - Статус задачи. 
//
Функция ПолучитьСтатусЗадачиПоПроцентуГотовности(ПроцентГотовности, ТекущийСтатус = Неопределено) Экспорт
			
	Если ПроцентГотовности > 100 Тогда
		
		ПроцентГотовности = 100;
		
	ИначеЕсли ПроцентГотовности < 0 Тогда
		
		ПроцентГотовности = 0;
		
	КонецЕсли;
	
	Если ПроцентГотовности = 100 Тогда
		
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта") Тогда
			Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта"); 
		Иначе			
			Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Завершена");
		КонецЕсли;
		
	ИначеЕсли ПроцентГотовности = 0 Тогда
		
		Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Запланирована");
		
	ИначеЕсли ПроцентГотовности > 0 И ПроцентГотовности < 100 Тогда
		
		Статус = ПредопределенноеЗначение("Перечисление.упоСостояниеСтатусаЗадачи.Выполняется");
		
	Иначе 
		
		Статус = Неопределено;
		
	КонецЕсли;
	
	Возврат Статус;

КонецФункции 

// Устанавливает видимость элементов формы задачи при редактировании в структуре проекта.
//
// Параметры:
//  Форма	 - УправляемаяФорма	 - форма, на которой необходимо установить видимость элементов.
//
Процедура УстановитьВидимостьЭлементовФормыЗадачиСтруктуры(Форма, СтруктураСвойств = Неопределено) Экспорт
	
	Если СтруктураСвойств = Неопределено Тогда
		СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Форма.Проект);
	КонецЕсли;
	
	Форма.ИспользоватьАналитикуКонтрагентДляСС = СтруктураСвойств.ИспользоватьАналитикуКонтрагентДляСС;
	Форма.УказыватьПодразделениеРолиПриПланированииТР = СтруктураСвойств.УказыватьПодразделениеРолиПриПланированииТР;
	
	Элементы = Форма.Элементы;
	
	Если Элементы.СтраницаТрудовыеРесурсыРоли.Видимость Тогда
		
		Элементы.СтраницаТрудовыеРесурсыРоли.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
		Элементы.УровеньПланированияТрудозатратДляБДР.Доступность = Форма.ВключитьТрудРесурсыВПланРасходов;
		
	КонецЕсли;
	
	Если Элементы.СтраницаНазначенныеТрудовыеРесурсы.Видимость Тогда
		
		Элементы.СтраницаНазначенныеТрудовыеРесурсы.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
		
	КонецЕсли;
	
	Если Элементы.СтраницаМатериальныеРесурсы.Видимость Тогда
		
		Элементы.СтраницаМатериальныеРесурсы.Видимость = СтруктураСвойств.ПланироватьЗатратыНаМатериалы;
		Элементы.ГруппаМатериальныеРесурсыПоПодразделениям.Видимость =
			УчетМатРесурсовПоПодразделениям(СтруктураСвойств, Форма.ВключитьМатРесурсыВПланРасходов);
		Элементы.МатериальныеРесурсыГруппаНастройкиБДР.Видимость = Форма.ВключитьМатРесурсыВПланРасходов;
		Элементы.МатериальныеРесурсыПоПодразделениямГруппаОбъемыПоПодразделениям.Видимость =
			СтруктураСвойств.РасходыПоНатуральнымПоказателям
			Или (СтруктураСвойств.РасходыПоОбъемам и Форма.ВключитьМатРесурсыВПланРасходов);
		Элементы.МатериальныеРесурсыПоПодразделениямПрофильДатаПривязки.Видимость =
			СтруктураСвойств.РасходыПоНатуральнымПоказателям
			Или (СтруктураСвойств.РасходыПоОбъемам и Форма.ВключитьМатРесурсыВПланРасходов);
		
		ПараметрыОтбора = Новый Структура("СпособПривязки",
				ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную"));
		ЕстьРучноеРаспределение = Форма.МатериальныеРесурсыПоПодразделениям.НайтиСтроки(ПараметрыОтбора).Количество() > 0;
		
		Элементы.МатериальныеРесурсыПоПодразделениямГруппаРаспределение.Видимость =
			(СтруктураСвойств.РасходыПоНатуральнымПоказателям
				Или (СтруктураСвойств.РасходыПоОбъемам И Форма.ВключитьМатРесурсыВПланРасходов)) И ЕстьРучноеРаспределение;
				
		Элементы.МатериальныеРесурсыПоПодразделениямРаспределитьПоПериодамМатРесурсы.Видимость =
			СтруктураСвойств.РасходыПоНатуральнымПоказателям
			Или (СтруктураСвойств.РасходыПоОбъемам и Форма.ВключитьМатРесурсыВПланРасходов);
			
	КонецЕсли;
	
	Если Элементы.СтраницаСубпродукты.Видимость Тогда
		
		Элементы.СтраницаСубпродукты.Видимость = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
		Элементы.ГруппаСубпродуктыПоПодразделениям.Видимость =
			УчетСубпродуктовПоПодразделениям(СтруктураСвойств, Форма.ВключитьСубпродуктыВПланДоходов);
		Элементы.СубпродуктыПоПодразделениямГруппаОбъемыПоПодразделениям.Видимость =
			УчетДоходныхОбъемовПоПодразделениям(СтруктураСвойств, Форма.ВключитьСубпродуктыВПланДоходов);
		Элементы.СубпродуктыГруппаНастройкиБДР.Видимость = Форма.ВключитьСубпродуктыВПланДоходов;
		Элементы.СубпродуктыГруппаЗаполнитьПоРолям.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
		Элементы.СубпродуктыПоПодразделениямГруппаЗаполнитьПоРолям.Видимость =
			СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
			
	КонецЕсли;
	
	Если Элементы.СтраницаПланДоходов.Видимость Тогда
		
		Элементы.СтраницаПланДоходов.Видимость = СтруктураСвойств.ВедетсяБюджетДоходов;
		Элементы.ГруппаПланДоходовПоПодразделениям.Видимость = СтруктураСвойств.ДоходыПоПодразделениям;
		Элементы.ПланДоходовПоПодразделениямГруппаОбъемы.Видимость = СтруктураСвойств.ДоходыПоОбъемам
			И Не СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
		Элементы.ПланДоходовЗаполнитьПоРолям.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
		Элементы.ПланДоходовПоПодразделениямЗаполнитьПоРолям.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
		Элементы.ПланДоходовЗаполнитьПоПланамРесурсов.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту
			Или СтруктураСвойств.ПланироватьЗатратыНаМатериалы;
		Элементы.ПланДоходовПоПодразделениямЗаполнитьПоПланамРесурсов.Видимость =
			СтруктураСвойств.ПланироватьТрудозатратыПоПроекту Или СтруктураСвойств.ПланироватьЗатратыНаМатериалы;
		Элементы.ПланДоходовПоПодразделениямРаспределитьПоПериодамПланДоходов.Видимость = СтруктураСвойств.ДоходыПоОбъемам
			И Не СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
		Элементы.ПланДоходов_ЗаполнитьПоПлануМатериальныхРесурсов.Видимость = 
			СтруктураСвойств.ПланироватьЗатратыНаМатериалы;	
		Элементы.ПланДоходовПоПодразделениямЗаполнитьПоПлануМатериальныхРесурсов.Видимость = 
			СтруктураСвойств.ПланироватьЗатратыНаМатериалы;
			
	КонецЕсли;
	
	Если Элементы.СтраницаПланРасходов.Видимость Тогда
		
		Элементы.СтраницаПланРасходов.Видимость = СтруктураСвойств.ВедетсяБюджетРасходов;
		Элементы.ГруппаПланРасходовПоПодразделениям.Видимость = СтруктураСвойств.РасходыПоПодразделениям;
		Элементы.ПланРасходовПоПодразделениямГруппаОбъемы.Видимость = СтруктураСвойств.РасходыПоОбъемам
			И Не СтруктураСвойств.РасходыПоНатуральнымПоказателям;
		Элементы.ПодменюЗаполнитьПоТрудовымРесурсам.Видимость = СтруктураСвойств.ПланироватьТрудозатратыПоПроекту;
		Элементы.ПланРасходовПланРасходов_ЗаполнитьЗатраты.Видимость = СтруктураСвойств.ПланироватьЗатратыНаМатериалы
			Или СтруктураСвойств.ПланироватьТрудозатратыПоПроекту
			Или СтруктураСвойств.ПланироватьДополнительныеЗатратыПоЗадаче;
		Элементы.ПланРасходовПоПодразделениямРаспределитьПоПериодамПланРасходов.Видимость = СтруктураСвойств.РасходыПоОбъемам
			И Не СтруктураСвойств.РасходыПоНатуральнымПоказателям;

	КонецЕсли;
	
	Если Элементы.СтраницаДДС.Видимость Тогда
		
		ПрименитьСвойство_ВедетсяБюджетДвиженияДенежныхСредств(Элементы,
			СтруктураСвойств.ВедетсяБюджетДвиженияДенежныхСредств,
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает представление табличной части задачи по имени в метаданных.
//
// Параметры:
//  ИмяТабличнойЧасти			 - Строка	 - имя табличной части в метаданных.
//  ПредставлениеДляДокумента	 - Булево	 - признак представления для документа проектная задача
//  	или для формы задачи в структуре проекта.
// 
// Возвращаемое значение:
//  Строка - представление табличной части.
//
Функция ПредставлениеТабличнойЧастиЗадачи(ИмяТабличнойЧасти, ПредставлениеДляДокумента = Истина) Экспорт
			
	Если ИмяТабличнойЧасти = "МатериальныеРесурсы" Тогда		
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Материалы и оборудование / Потребности'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'План потребностей'");	
		КонецЕсли;					
		
	ИначеЕсли ИмяТабличнойЧасти = "Субпродукты" Тогда	
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Объемы / План выпуска'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'План выпуска'");	
		КонецЕсли;		
		
	ИначеЕсли ИмяТабличнойЧасти = "ПланРасходов" Тогда			
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Фин. планы / План расходов'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'План расходов'");	
		КонецЕсли;	
		
	ИначеЕсли ИмяТабличнойЧасти = "ПланДоходов" Тогда			
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Фин. планы / План доходов'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'План доходов'");
		КонецЕсли;		
		
	ИначеЕсли ИмяТабличнойЧасти = "ДополнительныеЗатраты" Тогда			
		
		ПредставлениеТЧ = НСтр("ru = 'Дополнительные затраты'");		
		
	ИначеЕсли ИмяТабличнойЧасти = "ТрудовыеРесурсы" Или ИмяТабличнойЧасти = "ТрудовыеРесурсыРоли" Тогда			
		
		ПредставлениеТЧ = НСтр("ru = 'Роли трудовых ресурсов'");		
		
	ИначеЕсли ИмяТабличнойЧасти = "ДвиженияДенежныхСредств" Тогда			
		
		ПредставлениеТЧ = НСтр("ru = 'Фин. планы / План движения денежных средств'");		
		
	ИначеЕсли ИмяТабличнойЧасти = "ПотребностиВМашинахМеханизмах" Тогда			
		
		ПредставлениеТЧ = НСтр("ru = 'Машины / механизмы'");		
		
	ИначеЕсли ИмяТабличнойЧасти = "ПредусловияЗадачи" Тогда	
		
		ПредставлениеТЧ = НСтр("ru = 'Предусловия'");		
		
	ИначеЕсли ИмяТабличнойЧасти = "РаспределениеПотребностей" 
		Или ИмяТабличнойЧасти = "МатериальныеРесурсыПоПодразделениям" Тогда			
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Материалы и оборудование / Распределение потребностей'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'Распределение плана потребностей'");
		КонецЕсли;		
		
	ИначеЕсли ИмяТабличнойЧасти = "РаспределениеОбъемов" Или ИмяТабличнойЧасти = "СубпродуктыПоПодразделениям" Тогда			
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Объемы / Распределение объемов'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'Распределение плана выпуска'");
		КонецЕсли;				
		
	ИначеЕсли ИмяТабличнойЧасти = "РаспределениеДоходов" Или ИмяТабличнойЧасти = "ПланДоходовПоПодразделениям" Тогда			
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Фин. планы / Распределение доходов'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'Распределение плана доходов'");
		КонецЕсли;		
		
	ИначеЕсли ИмяТабличнойЧасти = "РаспределениеРасходов" Или ИмяТабличнойЧасти = "ПланРасходовПоПодразделениям" Тогда			
		
		Если ПредставлениеДляДокумента Тогда
			ПредставлениеТЧ = НСтр("ru = 'Фин. планы / Распределение расходов'");
		Иначе
			ПредставлениеТЧ = НСтр("ru = 'Распределение плана расходов'");
		КонецЕсли;
		
	ИначеЕсли ИмяТабличнойЧасти = "РаспределениеДополнительныхЗатрат" Тогда			
		
		ПредставлениеТЧ = НСтр("ru = 'Распределение дополнительных затрат'");
		
	ИначеЕсли ИмяТабличнойЧасти = "ПланПоступлений" Тогда			
		
		ПредставлениеТЧ = НСтр("ru = 'Фин. планы / План поступлений'");
		
	ИначеЕсли ИмяТабличнойЧасти = "ПланВыплат" Тогда			
		
		ПредставлениеТЧ = НСтр("ru = 'Фин. планы / План выплат'");
	
	Иначе
		
		ПредставлениеТЧ = "";
		
	КонецЕсли;			
				
	Возврат ПредставлениеТЧ;			
	
КонецФункции

// Имя подчиненной таблицы по имени основной
//
// Параметры:
//  ИмяОсновнойТаблицы	 - Строка	 - имя основной таблицы-владельца
//  ИмяДляДокументаПЗ	 - Булево	 - признак вызова из формы документа Проектная задача (Ложь - вызов из формы задачи структуы проекта).
// 
// Возвращаемое значение:
//  Строка - имя подчиненной таблицы.
//
Функция ИмяПодчиненнойТаблицыПоИмениОсновной(ИмяОсновнойТаблицы, ИмяДляДокументаПЗ = Ложь) Экспорт
		
	Если ИмяОсновнойТаблицы = "МатериальныеРесурсы" Тогда
		ИмяПодчиненнойТаблицы = ?(ИмяДляДокументаПЗ, "РаспределениеПотребностей", ИмяОсновнойТаблицы + "ПоПодразделениям");
	ИначеЕсли ИмяОсновнойТаблицы = "Субпродукты" Тогда	
		ИмяПодчиненнойТаблицы = ?(ИмяДляДокументаПЗ, "РаспределениеОбъемов", ИмяОсновнойТаблицы + "ПоПодразделениям");
	ИначеЕсли ИмяОсновнойТаблицы = "ПланДоходов" Тогда
		ИмяПодчиненнойТаблицы = ?(ИмяДляДокументаПЗ, "РаспределениеДоходов", ИмяОсновнойТаблицы + "ПоПодразделениям");
	ИначеЕсли ИмяОсновнойТаблицы = "ПланРасходов" Тогда
		ИмяПодчиненнойТаблицы = ?(ИмяДляДокументаПЗ, "РаспределениеРасходов", ИмяОсновнойТаблицы + "ПоПодразделениям");
	ИначеЕсли ИмяОсновнойТаблицы = "ДоходныеОбъемы" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеДоходныхОбъемов";
	ИначеЕсли ИмяОсновнойТаблицы = "РасходныеОбъемы" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеРасходныхОбъемов";
	ИначеЕсли ИмяОсновнойТаблицы = "Доходы" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеДоходов";
	ИначеЕсли ИмяОсновнойТаблицы = "Расходы" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеРасходов";
	ИначеЕсли ИмяОсновнойТаблицы = "ЗатратыМатРесурсовФакт" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеЗатрат";
	ИначеЕсли ИмяОсновнойТаблицы = "ДополнительныеЗатраты" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеДополнительныхЗатрат";	
	Иначе
		ИмяПодчиненнойТаблицы = "";
	КонецЕсли;	
			
	Возврат ИмяПодчиненнойТаблицы;				
		
КонецФункции	

// Данные подчиненной таблицы по периодам по имени владельца.
//
// Параметры:
//  ИмяОсновнойТаблицы	 - Строка	 - имя основной таблицы-владельца
//  ИмяДляДокументаПЗ	 - Булево	 - признак вызова из формы документа Проектная задача (Ложь - вызов из формы задачи структуы проекта).
// 
// Возвращаемое значение:
//  Структура
//
Функция ДанныеПодчиненнойТаблицыПоПериодамПоИмениВладельца(ИмяОсновнойТаблицы, ИмяДляДокументаПЗ = Ложь) Экспорт
	
	Если Не ИмяДляДокументаПЗ Тогда
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	ИмяПодчиненнойТаблицы = "";
	ИндексСтрокиРаспределения = "";
	ИсточникПлана = Неопределено;
	колонкиСуммы = Новый Массив;
	колонкиСуммы.Добавить("Сумма");
	колонкиСуммы.Добавить("Количество");			
	колонкиОтбора = "Период, ИсточникПлана";
						
	Если ИмяОсновнойТаблицы = "РаспределениеПотребностей" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеРасходовПоПериодам";
		ИндексСтрокиРаспределения = "ИндексСтрокиРаспределениеПоРолям";
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты");
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеОбъемов" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеДоходовПоПериодам";
		ИндексСтрокиРаспределения = "ИндексСтрокиРаспределениеПоРолям";
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.Объемы");
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеДополнительныхЗатрат" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеРасходовПоПериодам";
		ИндексСтрокиРаспределения = "ИндексСтрокиРаспределениеПоРолям";
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты");
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеДоходов" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеДоходовПоПериодам";
		ИндексСтрокиРаспределения = "ИндексСтрокиРаспределенияДоходов";
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы");
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеРасходов" Тогда
		ИмяПодчиненнойТаблицы = "РаспределениеРасходовПоПериодам";
		ИндексСтрокиРаспределения = "ИндексСтрокиРаспределенияРасходов";
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы");
	Иначе
		Возврат Неопределено; // Возврат.
	КонецЕсли;
	
	ДанныеПодчиненнойТаблицы = Новый Структура;
	ДанныеПодчиненнойТаблицы.Вставить("ИмяПодчиненнойТаблицы", ИмяПодчиненнойТаблицы);
	ДанныеПодчиненнойТаблицы.Вставить("ИндексСтрокиРаспределения", ИндексСтрокиРаспределения);
	ДанныеПодчиненнойТаблицы.Вставить("ИсточникПлана", ИсточникПлана);
	ДанныеПодчиненнойТаблицы.Вставить("колонкиСуммы", колонкиСуммы);
	ДанныеПодчиненнойТаблицы.Вставить("колонкиОтбора", колонкиОтбора);
													
	Возврат ДанныеПодчиненнойТаблицы;
	
КонецФункции

// Имя таблицы владельца по имени подчиненной.
//
// Параметры:
//  ИмяОсновнойТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяТаблицыВладельцаПоИмениПодчиненной(ИмяОсновнойТаблицы) Экспорт
									
	Если ИмяОсновнойТаблицы = "РаспределениеДополнительныхЗатрат" Тогда
		ИмяТаблицыВладельца = "ДополнительныеЗатраты";
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеДоходов" Или ИмяОсновнойТаблицы = "ПланДоходовПоПодразделениям" Тогда
		ИмяТаблицыВладельца = "ПланДоходов";
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеРасходов" Или ИмяОсновнойТаблицы = "ПланРасходовПоПодразделениям" Тогда
		ИмяТаблицыВладельца = "ПланРасходов";
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеПотребностей" 
		Или ИмяОсновнойТаблицы = "МатериальныеРесурсыПоПодразделениям" Тогда
		ИмяТаблицыВладельца = "МатериальныеРесурсы";
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеОбъемов" 
		Или ИмяОсновнойТаблицы = "СубпродуктыПоПодразделениям" Тогда
		ИмяТаблицыВладельца = "Субпродукты";	
	Иначе
		ИмяТаблицыВладельца = "";
	КонецЕсли;
	
	Возврат ИмяТаблицыВладельца;
	
КонецФункции

// Имя таблицы владельца по имени подчиненной для проверки на дубли.
//
// Параметры:
//  ИмяОсновнойТаблицы	 - Строка
//  ИмяДляДокументаПЗ	 - Булево - признак вызова функции из документа Проектная задача (а не из структуры).
// 
// Возвращаемое значение:
//  Строка
//
Функция ТаблицаВладелецДляПроверкиНаДубли(ИмяОсновнойТаблицы) Экспорт
		
	Если ИмяОсновнойТаблицы = "РаспределениеДополнительныхЗатрат" Тогда
		ИмяТаблицыВладельца = "ДополнительныеЗатраты";
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеДоходов" 
		Или ИмяОсновнойТаблицы = "ПланДоходовПоПодразделениям" Тогда
		ИмяТаблицыВладельца = "ПланДоходов";
	ИначеЕсли ИмяОсновнойТаблицы = "РаспределениеРасходов" Или
		ИмяОсновнойТаблицы = "ПланРасходовПоПодразделениям" Тогда
		ИмяТаблицыВладельца = "ПланРасходов";
	Иначе
		ИмяТаблицыВладельца = "";
	КонецЕсли;
	
	Возврат ИмяТаблицыВладельца;
	
КонецФункции

// Представление пустой фазы
// 
// Возвращаемое значение:
//  ПредставлениеПустойФазы - Строка
//
Функция ПредставлениеПустойФазы() Экспорт	
	Возврат НСтр("ru = 'Стартовая'");
КонецФункции

// Возвращает единицу измерения по умолчанию для расчета в формах Проектной задачи и Шаблона проектной задачи.
// 
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма Проектной задачи, форма Шаблона проектной задачи.
//  ЭтоШаблонПроектнойЗадачи - Булево - опреляет, что расчет идет для шаблона проектной задачи.
// 
// Возвращаемое значение:
//  СправочникСсылка.упоЕдиницыВремени - единица измерения.
//
Функция ЕдИзмеренияПоУмолчанию(ЭтаФорма, ЭтоШаблонПроектнойЗадачи = Ложь) Экспорт
	
	Если ЭтаФорма.Объект.ДлительностьБезУчетаКалендаряПроекта Тогда		
		Возврат ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.Сутки");		
	Иначе				
		Если Не ЭтоШаблонПроектнойЗадачи И ЗначениеЗаполнено(ЭтаФорма.ЕдиницаВремениПоУмолчанию) Тогда
			Возврат ЭтаФорма.ЕдиницаВремениПоУмолчанию;
		Иначе
			Возврат ПредопределенноеЗначение("Справочник.упоЕдиницыВремени.РабочийДень");
		КонецЕсли;		
	КонецЕсли;
	
КонецФункции

// Возвращает массив строк подчиненной таблицы по подразделениям.
//
// Параметры:
//  СтрокаВладелец	 	- СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекция - строка владелец.
//  ТаблицаРаспределения - 	ТабличнаяЧасть, ДанныеФормыКоллекция - набор подчиненных строк.
//	ТолькоНаличие	- Булево - признак неполного перебора строк (возврат при первом найденном значении).
//								
// Возвращаемое значение:
//  Массив - строки подчиненной таблицы по подразделениям.
//
Функция ПолучитьСтрокиРаспределенияПоПодразделениям(СтрокаВладелец, ТаблицаРаспределения, ТолькоНаличие = Ложь) Экспорт 
	
	МассивСтрок = Новый Массив;
	
	Если СтрокаВладелец.ИндексСтрокРаспределения = Неопределено Тогда
		Возврат МассивСтрок;
	КонецЕсли;
						
	Для Каждого СтрокаРаспределения Из ТаблицаРаспределения Цикл
		Если СтрокаРаспределения.ИндексСтрокиВладельца = СтрокаВладелец.ИндексСтрокРаспределения Тогда
			МассивСтрок.Добавить(СтрокаРаспределения);
			Если ТолькоНаличие Тогда
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат МассивСтрок;
	
КонецФункции

// Возвращает массив строк подчиненной таблицы по периодам.
//
// Параметры:
//  СтрокаВладелец						 - СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекция - строка владелец.
//  ТаблицаРаспределенияПоПериодам		 - ТабличнаяЧасть, ДанныеФормыКоллекция				 - набор подчиненных строк.
//  ИмяПоляИндексРаспределенияПоПериодам - Строка											 - имя поля связи родителя.
//  ТолькоНаличие						 - Булево											 - признак неполного перебора строк (возврат при первом найденном значении).
//  ИсточникПлана						 - Перечисление.упоИсточникПланаДоходовИРасходов, Неопределено	 - Источник плана
// 
// Возвращаемое значение:
//  Массив - строки подчиненной таблицы по периодам.
//
Функция ПолучитьСтрокиРаспределенияПоПериодам(СтрокаВладелец, 
											ТаблицаРаспределенияПоПериодам, 
											ИмяПоляИндексРаспределенияПоПериодам, 
											ТолькоНаличие = Ложь, 
											ИсточникПлана = Неопределено) Экспорт
									
	МассивСтрок = Новый Массив;
		
	ЕстьИсточникПлана =	ЕстьРеквизитИсточникПлана(СтрокаВладелец);
		
	Если ЕстьИсточникПлана Тогда
		Если ИсточникПлана = Неопределено Тогда
			ИсточникПланаРаспределения = СтрокаВладелец.ИсточникПлана;	
		Иначе	
			ИсточникПланаРаспределения = ИсточникПлана;	
		КонецЕсли;
	Иначе
		ИсточникПланаРаспределения = Неопределено;	
	КонецЕсли;
		
	Для Каждого СтрокаРаспределения Из ТаблицаРаспределенияПоПериодам Цикл
		
		ЭтоПодчиненнаяСтрока = СтрокаРаспределения[ИмяПоляИндексРаспределенияПоПериодам] 
								= СтрокаВладелец.ИндексСтрокРаспределенияПоПериодам;
		Если Не ЭтоПодчиненнаяСтрока Тогда
			Продолжить;
		КонецЕсли;	
										
		Если ЕстьИсточникПлана Тогда
			ЭтоСтрокаИсточника = СтрокаРаспределения.ИсточникПлана = ИсточникПланаРаспределения; 
		Иначе
			ЭтоСтрокаИсточника = Истина;
		КонецЕсли;	
		
		Если Не ЭтоСтрокаИсточника Тогда
			Продолжить;
		КонецЕсли;	
										
		МассивСтрок.Добавить(СтрокаРаспределения);
		
		Если ТолькоНаличие Тогда
			Прервать;
		КонецЕсли;	
				
	КонецЦикла;	
	
	Возврат МассивСтрок;
				
КонецФункции

// Возвращает массив строк подчиненной таблицы по периодам.
//
// Параметры:
//  СтрокаТаблицы	- СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекция - строка владелец.
//  ТаблицаРаспределения - 	ТабличнаяЧасть, ДанныеФормыКоллекция - набор подчиненных строк распределения.
//  ТаблицаРаспределенияПоПериодам - ТабличнаяЧасть, ДанныеФормыКоллекция - набор подчиненных строк периодов.
//  ИмяПоляИндексРаспределенияПоПериодам - 	Строка - имя поля связи родителя.
//  ИсточникПлана - Перечисление.упоИсточникПланаДоходовИРасходов, Неопределено - Источник плана. Задается при обработке
// 		 табличных частей РаспределениеПотребностей, РаспределениеОбъемов, поскольку в них нет реквизита ИсточникПлана.
//
Процедура УдалитьСтрокуРаспределенияПоПодразделениям(СтрокаТаблицы, 
													ТаблицаРаспределения, 
													ТаблицаРаспределенияПоПериодам, 
													ИмяПоляИндексРаспределенияПоПериодам, 
													ИсточникПлана = Неопределено) Экспорт
	
	СтрокиРаспределенияПоПериодам = упоПроектыИЗадачиОбщие.ПолучитьСтрокиРаспределенияПоПериодам(СтрокаТаблицы, 
																								ТаблицаРаспределенияПоПериодам, 
																								ИмяПоляИндексРаспределенияПоПериодам, 
																								, 
																								ИсточникПлана);	
	Для Каждого СтрокаРаспределенияПоПериодам Из СтрокиРаспределенияПоПериодам Цикл				
		ТаблицаРаспределенияПоПериодам.Удалить(СтрокаРаспределенияПоПериодам);					
	КонецЦикла; 	
	
	ТаблицаРаспределения.Удалить(СтрокаТаблицы);
	
КонецПроцедуры

// Очищает строки распределения с подчиненными строками периодов.
//
// Параметры:
//  ТаблицаРаспределения - 	ТабличнаяЧасть, ДанныеФормыКоллекция - набор подчиненных строк распределения.
//  ТаблицаРаспределенияПоПериодам - ТабличнаяЧасть, ДанныеФормыКоллекция - набор подчиненных строк периодов.
//  ИмяПоляИндексРаспределенияПоПериодам - 	Строка - имя поля связи родителя.
//  ИсточникПлана - Перечисление.упоИсточникПланаДоходовИРасходов, Неопределено - Источник плана
//
Процедура ОчиститьСтрокиРаспределенияПоПодразделениям(ТаблицаРаспределения, ТаблицаРаспределенияПоПериодам, 
	ИмяПоляИндексРаспределенияПоПериодам, ИсточникПлана = Неопределено) Экспорт
				
	Сч = ТаблицаРаспределения.Количество() - 1;	
	// Очистить распределение.
	Пока Сч >= 0 Цикл 
		СтрокаРаспределения = ТаблицаРаспределения[Сч];
		упоПроектыИЗадачиОбщие.УдалитьСтрокуРаспределенияПоПодразделениям(СтрокаРаспределения, ТаблицаРаспределения, 
			ТаблицаРаспределенияПоПериодам, ИмяПоляИндексРаспределенияПоПериодам, ИсточникПлана);		
		Сч = Сч - 1;	
	КонецЦикла;
	
КонецПроцедуры

// Возвращает префикс для изменения представления для задач с признаком ЗадачаОтменена
//
// Возвращаемое значение:
//	Строка - Префикс
//
Функция ПрефиксОтмененнойЗадачи() Экспорт
	
	Префикс = НСтр("ru = '<ОТМЕНЕНА>'");
	Возврат Префикс;
	
КонецФункции

// Возвращает структуру сроков проектной задачи для передачи в расчетные методы.
//
// Параметры:
//  ДатаНачала		 - Дата - дата начала задачи.
//  ДатаЗавершения	 - Дата - дата завершения задачи.
// 
// Возвращаемое значение:
//  Структура - структура сроков.
//
Функция СтруктураСроки(ДатаНачала, ДатаЗавершения) Экспорт
	
	СтруктураСроки = Новый Структура;
	СтруктураСроки.Вставить("НачалоПлан", ДатаНачала);
	СтруктураСроки.Вставить("ЗавершениеПлан", ДатаЗавершения);
	
	Возврат СтруктураСроки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьСвойство_ВедетсяБюджетДвиженияДенежныхСредств(Элементы, 
																ВедетсяБюджетДвиженияДенежныхСредств,
																ЭтоФормаСтруктуры = Истина)
		
	Элементы.СтраницаДДС.Видимость = ВедетсяБюджетДвиженияДенежныхСредств;	
		
	Элементы.ВключитьПланДоходовВБДДС.Доступность 	= ВедетсяБюджетДвиженияДенежныхСредств;
	Элементы.ВключитьПланРасходовВБДДС.Доступность 	= ВедетсяБюджетДвиженияДенежныхСредств;	
		
	Если ЭтоФормаСтруктуры Тогда		
		Элементы.СхемаОплатыПоУмолчаниюДоходы.Доступность 	= ВедетсяБюджетДвиженияДенежныхСредств;
		Элементы.СхемаОплатыПоУмолчаниюРасходы.Доступность 	= ВедетсяБюджетДвиженияДенежныхСредств;
	Иначе	
		Элементы.СхемаОплатыБДДСДоход.Доступность 			= ВедетсяБюджетДвиженияДенежныхСредств;
		Элементы.СхемаОплатыБДДСРасход.Доступность 			= ВедетсяБюджетДвиженияДенежныхСредств;
	КонецЕсли;
	
КонецПроцедуры		
		
Процедура ПрименитьСвойство_УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат(Элементы, 
																						УчитыватьПериодРегистрацииНормСтоимости)
		
	Элементы.КнопкаПересчитатьПоНормеТР.Доступность 			= Не УчитыватьПериодРегистрацииНормСтоимости;
	Элементы.ТрудовыеРесурсыСтоимость.ТолькоПросмотр 			= УчитыватьПериодРегистрацииНормСтоимости;
	Элементы.ТрудовыеРесурсыОбщСтоимость.ТолькоПросмотр 		= УчитыватьПериодРегистрацииНормСтоимости;
	Элементы.ТрудовыеРесурсыВнешняяСтоимость.ТолькоПросмотр 	= УчитыватьПериодРегистрацииНормСтоимости;
	Элементы.ТрудовыеРесурсыОбщВнешняяСтоимость.ТолькоПросмотр 	= УчитыватьПериодРегистрацииНормСтоимости;
	
	Если УчитыватьПериодРегистрацииНормСтоимости Тогда
		ЦветНовый = Новый Цвет(135, 135, 135);
	Иначе
		ЦветНовый = Новый Цвет;
	КонецЕсли;
	
	Элементы.ТрудовыеРесурсыСтоимость.ЦветТекстаЗаголовка 			= ЦветНовый;
	Элементы.ТрудовыеРесурсыСтоимость.ЦветТекста 					= ЦветНовый;
	Элементы.ТрудовыеРесурсыСтоимость.ЦветТекстаПодвала 			= ЦветНовый;

	Элементы.ТрудовыеРесурсыОбщСтоимость.ЦветТекстаЗаголовка 		= ЦветНовый;
	Элементы.ТрудовыеРесурсыОбщСтоимость.ЦветТекста 				= ЦветНовый;
	Элементы.ТрудовыеРесурсыОбщСтоимость.ЦветТекстаПодвала 			= ЦветНовый;

	Элементы.ТрудовыеРесурсыВнешняяСтоимость.ЦветТекстаЗаголовка 	= ЦветНовый;
	Элементы.ТрудовыеРесурсыВнешняяСтоимость.ЦветТекста 			= ЦветНовый;
	Элементы.ТрудовыеРесурсыВнешняяСтоимость.ЦветТекстаПодвала 		= ЦветНовый;

	Элементы.ТрудовыеРесурсыОбщВнешняяСтоимость.ЦветТекстаЗаголовка = ЦветНовый;
	Элементы.ТрудовыеРесурсыОбщВнешняяСтоимость.ЦветТекста 			= ЦветНовый;
	Элементы.ТрудовыеРесурсыОбщВнешняяСтоимость.ЦветТекстаПодвала 	= ЦветНовый;		
		
КонецПроцедуры

Процедура ПрименитьСвойство_ПланироватьТрудозатратыПоПроекту(Элементы, 
		ПланироватьТрудозатратыПоПроекту)

	Элементы.СтраницаТрудовыеРесурсы.Видимость 	= ПланироватьТрудозатратыПоПроекту;		
	Элементы.СтраницаИсполнители.Видимость 		= ПланироватьТрудозатратыПоПроекту;
	Элементы.СтраницаМашиныМеханизмы.Видимость 	= ПланироватьТрудозатратыПоПроекту;

КонецПроцедуры

Функция УчетСубпродуктовПоПодразделениям(СтруктураСвойств, ВключитьСубпродуктыВПланДоходов)
	
	Возврат СтруктураСвойств.ДоходыПоПодразделениям 
			И (ВключитьСубпродуктыВПланДоходов Или СтруктураСвойств.ДоходыПоНатуральнымПоказателям);	
	
КонецФункции	

Функция УчетДоходныхОбъемовПоПодразделениям(СтруктураСвойств, ВключитьСубпродуктыВПланДоходов)
	
	Возврат (ВключитьСубпродуктыВПланДоходов И СтруктураСвойств.ДоходыПоОбъемам) 
			Или СтруктураСвойств.ДоходыПоНатуральнымПоказателям;	
	
КонецФункции

Функция УчетМатРесурсовПоПодразделениям(СтруктураСвойств, ВключитьМатРесурсыВПланРасходов)
	
	Возврат СтруктураСвойств.РасходыПоПодразделениям
			И (ВключитьМатРесурсыВПланРасходов Или СтруктураСвойств.РасходыПоОбъемам);	
	
КонецФункции
			
Функция ЭтоЗадачаСФинансами(СтруктураСвойств)

	ЗадачаБезФинансов = Не СтруктураСвойств.ВедетсяБюджетДвиженияДенежныхСредств
		И Не СтруктураСвойств.ВедетсяБюджетДоходов
		И Не СтруктураСвойств.ВедетсяБюджетРасходов;
	
	Возврат Не ЗадачаБезФинансов;

КонецФункции // ()

Функция ЭтоСпособПривязкиПоПрофилю(СпособПривязки)	
	
	Если СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
		Возврат Истина;
	ИначеЕсли СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения") Тогда
		Возврат Истина;
	ИначеЕсли СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.ПоПрофилюРаспределения") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ЭтоСпособПривязкиНаДату(СпособПривязки)	
	
	Если СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда
		Возврат Истина;
	ИначеЕсли СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату") Тогда
		Возврат Истина;
	ИначеЕсли СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиСхемОплаты.НаДату") Тогда
		Возврат Истина;
	ИначеЕсли СпособПривязки = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НаДату") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ИмяПоляДляСообщения(ИмяТабличнойЧасти, НомерСтроки, ИмяПоля)
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1[%2].%3", 
			ИмяТабличнойЧасти, 
			НомерСтроки, 
			ИмяПоля);
	
КонецФункции	

// Возвращает признак наличия реквизита ИсточникПлана в полученной строке данных.
//
// Параметры:
//  СтрокаДанных - СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекция, Структура - проверяемая строка.
//								
// Возвращаемое значение:
//  Булево - признак наличия реквизита.
//
Функция ЕстьРеквизитИсточникПлана(СтрокаДанных)
	
	ЕстьРеквизит = Ложь;
	
	Если ТипЗнч(СтрокаДанных) = Тип("ДанныеФормыЭлементКоллекции")
		Или ТипЗнч(СтрокаДанных) = Тип("Структура") Тогда	
		
		ЕстьРеквизит = СтрокаДанных.Свойство("ИсточникПлана");
		
	Иначе
		
		ШаблонИсточник = Новый Структура("ИсточникПлана", "");
		ЗаполнитьЗначенияСвойств(ШаблонИсточник, СтрокаДанных);
		
		ЕстьРеквизит = ШаблонИсточник.ИсточникПлана <> "";
		
	КонецЕсли;
	
	Возврат ЕстьРеквизит;
	
КонецФункции	

#КонецОбласти