
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПерейти(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Подключение) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена строка подключения к источнику данных. Переход невозможен.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.Подключение");
		Возврат;	
	КонецЕсли; 
	
	Попытка			
		ПерейтиПоНавигационнойСсылке(Объект.Подключение);	
	Исключение
		Инфо = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиент.СообщитьПользователю(Инфо.Причина.Описание);			
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти
