
&НаСервере
Процедура ДолжностьШтатногоРасписанияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДолжностьШтатногоРасписания) Тогда 
		
		Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда 
			Объект.Код = СокрЛП(Объект.ДолжностьШтатногоРасписания.ID_ДолжностьS);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда 
			Объект.Наименование = СокрЛП(Объект.ДолжностьШтатногоРасписания.Наименование);     
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда 
			Объект.ФизическоеЛицо = ПолучитьФизическоеЛицо();     
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда 
			Объект.Родитель = Объект.ДолжностьШтатногоРасписания.ИКТ_ФункциональныйРуководительФР;     
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьШтатногоРасписанияПриИзменении(Элемент)
	ДолжностьШтатногоРасписанияПриИзмененииНаСервере();
КонецПроцедуры

Функция ПолучитьФизическоеЛицо()
	
	ФизЛицоСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗанятостьПозицийШтатногоРасписанияСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ЗанятостьПозицийШтатногоРасписания.СрезПоследних(&ДатаСреза, ПозицияШтатногоРасписания = &ПозицияШтатногоРасписания) КАК ЗанятостьПозицийШтатногоРасписанияСрезПоследних
		|ГДЕ
		|	ЗанятостьПозицийШтатногоРасписанияСрезПоследних.ВидЗанятостиПозиции = &ВидЗанятостиПозиции";
	
	Запрос.УстановитьПараметр("ПозицияШтатногоРасписания", Объект.ДолжностьШтатногоРасписания);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("ВидЗанятостиПозиции", Перечисления.ВидыЗанятостиПозицийШтатногоРасписания.Занята);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		ФизЛицоСсылка = Выборка.ФизическоеЛицо;
				
	КонецЦикла; 
	
	Возврат ФизЛицоСсылка;
	
КонецФункции
