
&После("ОбработкаЗаполнения")
Процедура Расш1_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 06.08.2026 
	Если Пользователи.РолиДоступны("ИКТ_ВсеПроекты") Тогда
		Возврат;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_Воронеж") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.Воронеж;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_Красноярск") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.Красноярск;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_СанктПетербург") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.СанктПетербург;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПортфельПроектов = РодительВерхнегоУровняПоРоли;
	//[+]} ИКТ №20612
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура Расш1_ПередЗаписью(Отказ)

	//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 06.08.2026 
	Если Пользователи.РолиДоступны("ИКТ_ВсеПроекты") Тогда
		Возврат;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_Воронеж") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.Воронеж;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_Красноярск") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.Красноярск;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_СанктПетербург") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.СанктПетербург;
	Иначе
		Возврат;
	КонецЕсли;
	
	РодительВерхнегоуровняПоПортфелю = НайтиВерхнегоРодителя(ПортфельПроектов);
	
	Если РодительВерхнегоуровняПоПортфелю <> РодительВерхнегоУровняПоРоли Тогда
		Отказ = Истина;                                 
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Группа портфелей [%1] текущего портфеля проектов [%2] не сообтветсует допустимой группе [%3]!'"), 
			РодительВерхнегоуровняПоПортфелю,
			ПортфельПроектов,
			РодительВерхнегоУровняПоРоли));
	КонецЕсли;
	//[+]} ИКТ №20612
	
КонецПроцедуры

//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 06.08.2026 
Функция НайтиВерхнегоРодителя(Элемент)

	Возврат ?(ЗначениеЗаполнено(Элемент.Родитель), НайтиВерхнегоРодителя(Элемент.Родитель), Элемент)

КонецФункции
//[+]} ИКТ №20612
	
