
#Область ПрограммныйИнтерфейс

#Область ОбработчикиФормы

// Обработка заполнения объекта Проект.
//
// Параметры:
//  Объект				 - СправочникОбъект.Проекты
//  ДанныеЗаполнения	 - Структура
//  ТекстЗаполнения		 - Строка
//  СтандартнаяОбработка - Булево
//
Процедура ОбъектОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Проекты") Тогда
		
		Объект.упоСтатьяРасходовРаспределенияЗарплаты = упоРаспределениеЗарплатыНастройкиСервер.ПолучитьЗначениеСтатьиРасходаРаспределения();
		
		Если НЕ ЗначениеЗаполнено(Объект.упоСтатьяРасходовРаспределенияЗарплаты) Тогда
			ТекстСообщения = НСтр("ru = 'В параметрах подсистемы РМ, раздел ""Модуль распределения ЗП"", не установлена статья расходов по зарплате.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Если упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("РежимУчетаВзносов") = 1 Тогда
			Объект.упоРежимУчетаВзносов = 1;
			Объект.упоСтатьяРасходовВзносов = упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("СтатьяРасходовВзносов");
		Иначе
			Объект.упоРежимУчетаВзносов = 0;
			Объект.упоСтатьяРасходовВзносов = ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОтражениеЗарплатыВБухУчете

Процедура ДанныеДляОтраженияЗарплатыВБухучете(ДанныеДляОтражения, ПериодРегистрации, РежимЗагрузки, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	ПараметрыВыполнения.Вставить("КонецПериода", КонецМесяца(ПериодРегистрации));
	ПараметрыВыполнения.Вставить("ИспользоватьСогласованныеЧасы", 
		упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("ИспользоватьСогласованныеЧасы"));
	
	Если НЕ ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры.Вставить("НачисленнаяЗарплатаИВзносыБезРаспредения", 
			ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы.Скопировать());
	КонецЕсли;
	
	ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы = РазбитьПоПЗ(ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы, 
		ПараметрыВыполнения, РежимЗагрузки, ДополнительныеПараметры);
	
КонецПроцедуры

Функция ПолучитьДанныеДляОтраженияЗарплатыВБухучете(Организация, ПериодРегистрации, ДополнительныеПараметры = Неопределено) Экспорт
	
	МодульОтражениеЗарплатыВБухучете = ОбщегоНазначения.ОбщийМодуль("ОтражениеЗарплатыВБухучете");
	МодульЗарплатаКадры = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадры");
	
	ДанныеДляОтражения = МодульОтражениеЗарплатыВБухучете.НоваяСтруктураДанныеДляОтраженияЗарплатыВБухучете();
	
	Если МодульЗарплатаКадры.ИспользоватьСтатьиФинансированияЗарплата() Тогда
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		МодульОтражениеЗарплатыВБухучетеРасширенный = ОбщегоНазначения.ОбщийМодуль("ОтражениеЗарплатыВБухучетеРасширенный");
		
		МодульОтражениеЗарплатыВБухучетеРасширенный.СведенияОБухучетеНачисленийИВзносовПоСтатьямФинансирования(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);
		
		ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы = МодульОтражениеЗарплатыВБухучете.ТаблицаНачисленийИВзносовДляБухучета(МенеджерВременныхТаблиц);
		
	Иначе
		
		МодульОтражениеЗарплатыВУчете = ОбщегоНазначения.ОбщийМодуль("ОтражениеЗарплатыВУчете");
		
		ТаблицаНачислений = МодульОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеНачислений(Организация, ПериодРегистрации);
		ТаблицаВзносов = МодульОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеВзносов(Организация, ПериодРегистрации);
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		МодульОтражениеЗарплатыВБухучете.ДанныеНачисленийИВзносов(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ТаблицаНачислений, ТаблицаВзносов);
		ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы = МодульОтражениеЗарплатыВБухучете.ТаблицаНачисленийИВзносовДляБухучета(МенеджерВременныхТаблиц);
		
	КонецЕсли;
	
	ДанныеДляОтраженияЗарплатыВБухучете(ДанныеДляОтражения, ПериодРегистрации, ДополнительныеПараметры);
	
	Возврат ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы;
	
КонецФункции

Процедура ЗаполнитьТаблицуНачисленнаяЗарплатаИВзносы(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Организация = Объект.Организация;
	ПериодРегистрации = Объект.ПериодРегистрации;
	ДокументСсылка = Объект.Ссылка;
	
	СписокТаблиц = Новый СписокЗначений;
	СписокТаблиц.Добавить("НачисленнаяЗарплатаИВзносы");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументСсылка", ДокументСсылка);
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("ПериодРегистрации", ПериодРегистрации);
	СтруктураПараметров.Вставить("СписокТаблиц", СписокТаблиц);
	СтруктураПараметров.Вставить("СтрокаСписокТаблиц", "НачисленнаяЗарплатаИВзносы");
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	
	Парам = Новый Структура;
	
	ИмяТаблицыИсточник = "НачисленнаяЗарплатаИВзносыПоФизлицам";
	ВыгружаемыеКолоноки = МассивВыгружаемыхКолонок();
	ТаблицаИсточник = Объект[ИмяТаблицыИсточник].Выгрузить( , СтрСоединить(ВыгружаемыеКолоноки, ","));
	
	ТаблицаИсточник.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаИсточник.Колонки.Добавить("ДатаНачала", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаИсточник.Колонки.Добавить("ПериодПринятияРасходов", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаИсточник.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаИсточник.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаИсточник.Колонки.Добавить("СтатьяФинансирования",
		Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	
	ТаблицаИсточник.Колонки["ПодразделениеПредприятия"].Имя = "ПодразделениеУчетаЗатрат";
	
	ДанныеДляОтражения = Новый Структура;
	ДанныеДляОтражения.Вставить("НачисленнаяЗарплатаИВзносы", ТаблицаИсточник);
	
	ДополнительныеПараметры = Новый Структура("РежимЗагрузки", 1);
	упоРаспределениеЗарплатыСервер.ДанныеДляОтраженияЗарплатыВБухучете(ДанныеДляОтражения, ПериодРегистрации, 1,
		ДополнительныеПараметры);
		
	Если ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	СвернутьДанныеДляОтраженияЗарплатыВБухучете(ДанныеДляОтражения);
	ЗаполнитьПодразделениеВТаблице(ДанныеДляОтражения, СтруктураПараметров, АдресХранилища);
	ЗаполнениеПослеВыполненияДлительнойОперации(Объект, СписокТаблиц, ДанныеДляОтражения, АдресХранилища);
	
КонецПроцедуры

Процедура ДобавитьТаблицаСхемаОтраженияНачисленийPM_ERPВДопСвойства(Организация, ПериодРегистрации, ДополнительныеСвойства, Отказ) Экспорт
	
	Если Отказ
		ИЛИ НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	ДопПарам = Новый Структура;
	ТаблицаСхемаОтраженияНачисленийPM_ERP = ПолучитьДанныеДляОтраженияЗарплатыВБухучете(Организация, ПериодРегистрации, ДопПарам);
	
	ТаблицаСхемаОтраженияНачисленийPM_ERP.Колонки.Добавить("ДокументОтражения");
	ТаблицаСхемаОтраженияНачисленийPM_ERP.Колонки.Добавить("ПериодРегистрации");
	ТаблицаСхемаОтраженияНачисленийPM_ERP.Колонки.Добавить("Номер");
	
	Номер = 0;
	Для Каждого Строка Из ТаблицаСхемаОтраженияНачисленийPM_ERP Цикл
		Номер = Номер + 1;
		Строка.ПериодРегистрации = ПериодРегистрации;
		Строка.Номер = Номер;
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ТаблицаСхемаОтраженияНачисленийPM_ERP", ТаблицаСхемаОтраженияНачисленийPM_ERP);
	
	Если НЕ ДопПарам = Неопределено И ДопПарам.Свойство("НачисленнаяЗарплатаИВзносыБезРаспредения") Тогда
		ДополнительныеСвойства.Вставить("НачисленнаяЗарплатаИВзносыБезРаспредения", ДопПарам.НачисленнаяЗарплатаИВзносыБезРаспредения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьДвижения_упоСхемаОтраженияНачисленийPM_ERP(Ссылка, ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = Неопределено;
	
	ПараметрыВыполнения = Новый Структура("Ссылка, ПериодРегистрации", Ссылка, Ссылка.ПериодРегистрации);
	Таблица = ПолучитьТаблицаСхемаОтраженияНачисленийPM_ERP(ПараметрыВыполнения);
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = Движения.упоСхемаОтраженияНачисленийPM_ERP;
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Загрузить(Таблица);
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Отказ = Истина;
		
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'РаспределениеЗарплаты'"), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете, Ссылка, ПредставлениеОшибки);
		
		ТекстСообщения = НСтр("ru = 'Не удалось записать схему отражения начислений. См. Журнал регистрации.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтразитьДвижения_упоНачисленияЗарплатаИВзносы(Ссылка, ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	Если упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("УчетВоВнешнейСистеме") Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = Неопределено;
	
	Если НЕ ДополнительныеСвойства.Свойство("НачисленнаяЗарплатаИВзносыБезРаспредения", Таблица) Тогда
		Таблица = Новый ТаблицаЗначений;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.упоНачисленияЗарплатаИВзносы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПериодРегистрации.Установить(Ссылка.ПериодРегистрации);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если Таблица.Количество() Тогда
		
		Таблица.Колонки.Добавить("ПериодРегистрации");
		Таблица.Колонки.Добавить("Номер");
		
		Таблица.ЗаполнитьЗначения(Ссылка.ПериодРегистрации, "ПериодРегистрации");
		
		сч = 1;
		Для Каждого Строка Из Таблица Цикл
			Строка["Номер"] = сч;
			сч = сч + 1;
		КонецЦикла;
		
		НаборЗаписей.Загрузить(Таблица);
		
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Отказ = Истина;
		
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'РаспределениеЗарплаты'"), УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете, Ссылка, ПредставлениеОшибки);
		
		ТекстСообщения = НСтр("ru = 'Не удалось записать начисления зарплаты. См. Журнал регистрации.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьОтчетНаФорму_ОтражениеЗарплатыВФинансовомУчете(Форма) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ИмяПодменюОтчеты = "ПодменюОтчетыСмТакже";
	ЭлементПодменюОтчеты = Элементы.Найти(ИмяПодменюОтчеты);
	
	Если ЭлементПодменюОтчеты <> Неопределено Тогда
		
		МетаОтчет = Метаданные.Отчеты.упоСхемаОтраженияЗарплатыERP_PM;
		
		ИмяКоманды = "ОткрытьОтчет_" + МетаОтчет.Имя;
		
		НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "Подключаемый_" + ИмяКоманды;
		НоваяКоманда.Заголовок = МетаОтчет.Синоним;
		
		НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементПодменюОтчеты);
		НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;
		
		ИмяКоманды = "ОткрытьОтчет_" + "упоНачисленияИВзносыВнешние";
		
		НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "Подключаемый_" + ИмяКоманды;
		НоваяКоманда.Заголовок = "Начисления и взносы из внешней системы";
		
		НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементПодменюОтчеты);
		НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКомандыНаФорму_ОтражениеЗарплатыВФинансовомУчете(Форма) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыПоставщикам();
	
	Элементы = Форма.Элементы;
	
	ЭлементПодменюНачисленнаяЗарплатаИВзносы = Элементы.Найти("НачисленнаяЗарплатаИВзносыЗаполнить");
	Если ЭлементПодменюНачисленнаяЗарплатаИВзносы <> Неопределено Тогда
		
		Если Форма.ИмяФормы =
			"Документ.ОтражениеЗарплатыВФинансовомУчете.Форма.ФормаДокумента" Тогда
			
			ИмяКоманды = "упоРаспределитьПоТрудозатратамPM";
			Синоним = "Распределить по трудозатратам PM";
			
			НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "Подключаемый_" + ИмяКоманды;
			НоваяКоманда.Заголовок = Синоним;
			НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
			
			НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементПодменюНачисленнаяЗарплатаИВзносы);
			НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			
			ЭлементПодменю = Элементы.Найти("ФормаГлобальныеКоманды");
			ЭлементВставка = Элементы.Найти("ФормаОбщаяКомандаДополнительныеСведенияКоманднаяПанель");
			Если ЭлементПодменю <> Неопределено И ЭлементВставка <> Неопределено Тогда
				ИмяКоманды = "упоЗагрузитьExcelНачисленнаяЗарплата";
				Синоним = "Загрузить из Excel";
				
				НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
				НоваяКоманда.Действие = "Подключаемый_" + ИмяКоманды;
				НоваяКоманда.Заголовок = Синоним;
				
				НовыйЭлемент = Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементПодменю, ЭлементВставка);
				НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
				НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Форма.ИмяФормы =
			"Документ.ОтражениеЗарплатыВФинансовомУчете.Форма.ФормаСпискаФизическихЛиц" Тогда
			
			ИмяКоманды = "упоЗаполнитьНачисленияPM";
			Синоним = "Заполнить начисления PM";
			
			НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "Подключаемый_" + ИмяКоманды;
			НоваяКоманда.Заголовок = Синоним;
			НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
			
			НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементПодменюНачисленнаяЗарплатаИВзносы);
			НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			НовыйЭлемент.ИмяКоманды = ИмяКоманды;
			
			ИмяКоманды = "упоНастроитьСоответствияНачисленийPM";
			НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "Подключаемый_" + ИмяКоманды;
			НоваяКоманда.Заголовок = НСтр("ru = 'Настроить соответствия начислений'");
			НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
			НоваяКоманда.Картинка = БиблиотекаКартинок.ПереключитьАктивность;
			НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура ЗаполнитьВидОперацииСтрокиТабеля(СтрокаТабеля) Экспорт
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ИспользоватьПодсистему() Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(СтрокаТабеля.Задача);
	
	ЭтоЗаданиеПЗ =
		ТипЗначения = Тип("СправочникСсылка.упоЗадания") И ЗначениеЗаполнено(СтрокаТабеля.ПроектнаяЗадача);
	ЭтоПЗ =
		ТипЗначения = Тип("ДокументСсылка.упоПроектнаяЗадача") И ЗначениеЗаполнено(СтрокаТабеля.ПроектнаяЗадача);
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабеля.Задача) Тогда
		Если НЕ ЗначениеЗаполнено(СтрокаТабеля.ПроектнаяЗадача) Тогда
			Возврат;
		КонецЕсли;
		
		ЭтоПЗ = Истина;
	КонецЕсли;
	
	Если ЭтоПЗ ИЛИ ЭтоЗаданиеПЗ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации КАК ВидОперации
		               |ИЗ
		               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		               |			,
		               |			ПроектнаяЗадача = &Ссылка
		               |				И Версия = &ТекущаяВерсияПроекта) КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект = Проекты.Ссылка
		               |ГДЕ
		               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
		               |	И Проекты.Компонент = ЗНАЧЕНИЕ(Перечисление.упоКомпоненты.ОбщефирменнаяДеятельность)";
		
		ТекущаяВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(СтрокаТабеля.ПроектнаяЗадача);
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаТабеля.ПроектнаяЗадача);
		Запрос.УстановитьПараметр("ТекущаяВерсияПроекта", ТекущаяВерсияПроекта);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			СтрокаТабеля.ВидОперации =
				?(ЗначениеЗаполнено(Выборка.ВидОперации),
					Выборка.ВидОперации,
					Справочники.упоВидыОпераций.Явка);
		Иначе
			СтрокаТабеля.ВидОперации = Справочники.упоВидыОпераций.Явка;
		КонецЕсли;
		
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.упоВнепроектныеЗадачи") Тогда
		
		СтрокаТабеля.ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТабеля.Задача, "ВидОперации");
		
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.упоПричиныПотерьРабочегоВремени") Тогда
		
		СтрокаТабеля.ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТабеля.Задача, "ВидОперации");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСвойствоЭтоНовый(Объект, ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Объект.ЭтоНовый());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереместитьПроектВАрхив(ПроектныйЭлемент, ДополнительныеСвойства, Отказ) Экспорт
	
	ЭтоНовый = Ложь;
	Если НЕ ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый) Тогда
		ЭтоНовый = Ложь;
	КонецЕсли;
	
	Если Отказ ИЛИ НЕ ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаАрхивНаправленийДеятельности = упоРаспределениеЗарплатыНастройкиСервер.ПолучитьЗначениеГруппаАрхив();
	
	Если НЕ ЗначениеЗаполнено(ГруппаАрхивНаправленийДеятельности) Тогда
		Возврат;
	КонецЕсли;
	
	Результат =
		ОбщегоНазначения
		.ЗначенияРеквизитовОбъекта(ПроектныйЭлемент, "ЭтоПроектнаяЗадача, Родитель, ЭтоАктируемаяЗадача, СсылкаНаПроектнуюЗадачу");
	
	ПроектныйЭлементРодитель = Результат.Родитель;
	ЭтоПроектнаяЗадача = Результат.ЭтоПроектнаяЗадача;
	ЭтоАктируемаяЗадача = Результат.ЭтоАктируемаяЗадача;
	СсылкаНаПроектнуюЗадачу = Результат.СсылкаНаПроектнуюЗадачу;
	
	СтруктураСвязи = упоСвязьПроектаСНаправлениемДеятельности.ПолучитьНаправлениеДеятельностиПоЭлементу(ПроектныйЭлемент);
	СвязанноеНД_Элемент_Ссылка = СтруктураСвязи.НаправлениеДеятельностиЭлемент;
	СвязанноеНД_Группа_Ссылка = СтруктураСвязи.НаправлениеДеятельностиГруппа;
	
	Если Не ЗначениеЗаполнено(СвязанноеНД_Группа_Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	НужноОбновитьСвязь = Ложь;
	
	Если СвязанноеНД_Группа_Ссылка.Родитель <> ГруппаАрхивНаправленийДеятельности Тогда
		НужноОбновитьСвязь = Истина;
		
		Попытка
			СвязанноеНД_Группа_Объект = СвязанноеНД_Группа_Ссылка.ПолучитьОбъект();
			СвязанноеНД_Группа_Объект.Родитель = ГруппаАрхивНаправленийДеятельности;
			СвязанноеНД_Группа_Объект.Записать();
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
					Строка(ПроектныйЭлемент),
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ПроектныйЭлемент, , , Отказ);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Если НужноОбновитьСвязь Тогда
		
		НаборЗаписей = РегистрыСведений.упоСвязьПроектаСНаправлениемДеятельности.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПроектныйЭлемент.Установить(ПроектныйЭлемент);
		Запись = НаборЗаписей.Добавить();
		Запись.ПроектныйЭлемент = ПроектныйЭлемент;
		Запись.НаправлениеДеятельностиЭлемент = СвязанноеНД_Элемент_Ссылка;
		Запись.НаправлениеДеятельностиГруппа = СвязанноеНД_Группа_Ссылка;
		Запись.ПроектныйЭлементПроектнаяЗадача = СсылкаНаПроектнуюЗадачу;
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РазбитьПоПЗ(ТаблицаИсточник, ПараметрыВыполнения, РежимЗагрузки, ДополнительныеПараметры = Неопределено)
	
	// Режим загрузки:
	// - 0: на основе данных, полученных типовым механизмом ERP при помощи функции "ОтражениеЗарплатыВБухучетеРасширенный.ДанныеДляОтраженияЗарплатыВБухучете".
	// - 1: на основе таблицы документа.
	
	Таблица = ТаблицаИсточник.Скопировать();
	
	Таблица.Колонки.Добавить("Начисление", Новый ОписаниеТипов("СправочникСсылка.упоНачисленияPM"));
	Таблица.Колонки.Добавить("НачислениеСоответствие");
	Таблица.Колонки.Добавить("КоэффициентРаспределения", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(7, 6)));
	Таблица.Колонки.Добавить("Часы", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("ЧасыВсего", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("ИД", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	Таблица.Колонки.Добавить("ПодразделениеИспользованиеВремени", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	
	Для Каждого Строка Из Таблица Цикл
		Строка["Начисление"] = ?(ЗначениеЗаполнено(Строка["упоНачислениеPM"]), Строка["упоНачислениеPM"], Строка["Начисление"]);
	КонецЦикла;
	
	КолонкиГруппировок = Новый Массив;
	КолонкиСуммирования = Новый Массив;
	
	ТичЧисло = Тип("Число");
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если Колонка.ТипЗначения.СодержитТип(ТичЧисло) Тогда
			КолонкиСуммирования.Добавить(Колонка.Имя);
		Иначе
			КолонкиГруппировок.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	СтрокаКолонкиГруппировок = СтрСоединить(КолонкиГруппировок, ",");
	СтрокаКолонкиСуммирования = СтрСоединить(КолонкиСуммирования, ",");
	
	Таблица.Свернуть(СтрокаКолонкиГруппировок, СтрокаКолонкиСуммирования);
	
	Таблица = ПолучитьРезультатЗапроса(Таблица, ПараметрыВыполнения, КолонкиГруппировок, КолонкиСуммирования);
	
	Если Таблица <> Неопределено Тогда	
		Таблица.Свернуть(СтрокаКолонкиГруппировок, СтрокаКолонкиСуммирования);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьРезультатЗапроса(ИсходнаяТаблица, ПараметрыЗапроса, КолонкиГруппировок, КолонкиСуммирования)
	
	ИмяКолонкиНачисление = упоРаспределениеЗарплатыНастройкиСервер.ИмяКолонкиНачисленияСоответствияВДокументе();
	
	ТекстГруппировки = "";
	ТекстСуммирования = "";
	ИмяТаблицы = "Т";
	
	КолвоГруппировок = КолонкиГруппировок.Количество() - 1;
	Для сч = 0 По КолвоГруппировок Цикл
		Эл = КолонкиГруппировок[сч];
		Поле = ИмяТаблицы + "." + Эл + " КАК " + Эл + ?(сч = КолвоГруппировок, "", ",");
		ТекстГруппировки = ТекстГруппировки + Поле;
	КонецЦикла;
	
	КолвоСуммирования = КолонкиСуммирования.Количество() - 1;
	Для сч = 0 По КолвоСуммирования Цикл
		Эл = КолонкиСуммирования[сч];
		Поле = ИмяТаблицы + "." + Эл + " КАК " + Эл + ?(сч = КолвоСуммирования, "", ",");
		ТекстСуммирования = ТекстСуммирования + Поле;
	КонецЦикла;
	
	ТекстПолей = ТекстГруппировки + ?(КолонкиСуммирования.Количество(), ",", "") + ТекстСуммирования;
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Для Каждого Эл Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Эл.Ключ, Эл.Значение);
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапросаВТ_ВсеРабочееВремя(Новый Структура("ИспользоватьСогласованныеЧасы", ПараметрыЗапроса.ИспользоватьСогласованныеЧасы));
	Запрос.Выполнить();
	
	МассивПроекты = ПолучитьПроектыПериодНачислений(Запрос);
	Т_ГруппировкаЗадач = ТаблицаСвязиЗадачПоПризнакуАктируемости(МассивПроекты);
	Т_ГруппировкаЗадач.Свернуть("Потомок, Родитель");
	
	Запрос.УстановитьПараметр("Т", ИсходнаяТаблица);
	Запрос.УстановитьПараметр("Т_ГруппировкаЗадач", Т_ГруппировкаЗадач);
	
	Запрос.Текст = "ВЫБРАТЬ
		|    Т_ГруппировкаЗадач.Родитель КАК Родитель,
		|    Т_ГруппировкаЗадач.Потомок КАК Потомок
		|ПОМЕСТИТЬ Т_ГруппировкаЗадач
		|ИЗ
		|    &Т_ГруппировкаЗадач КАК Т_ГруппировкаЗадач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВсеРабочееВремя.ПериодНачислений КАК ПериодНачислений,
		|    ВсеРабочееВремя.ФизическоеЛицо КАК ФизическоеЛицо,
		|    ВсеРабочееВремя.ВидОперацииПМ КАК ВидОперацииПМ,
		|    ЕСТЬNULL(Т_ГруппировкаЗадач.Родитель, ВсеРабочееВремя.ЗадачаПричина) КАК ЗадачаПричина,
		|    ВсеРабочееВремя.Начисление КАК Начисление,
		|    ВсеРабочееВремя.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|    ВсеРабочееВремя.Часы КАК Часы,
		|    ВсеРабочееВремя.Проект КАК Проект,     
		|	 ВсеРабочееВремя.Подразделение КАК Подразделение 
		|ПОМЕСТИТЬ ВсеРабочееВремяСгруппированная
		|ИЗ
		|    ВсеРабочееВремя КАК ВсеРабочееВремя
		|        ЛЕВОЕ СОЕДИНЕНИЕ Т_ГруппировкаЗадач КАК Т_ГруппировкаЗадач
		|        ПО ВсеРабочееВремя.ЗадачаПричина = Т_ГруппировкаЗадач.Потомок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВсеРабочееВремяСгруппированная.ПериодНачислений КАК ПериодНачислений,
		|    ВсеРабочееВремяСгруппированная.ФизическоеЛицо КАК ФизическоеЛицо,
		|    ВсеРабочееВремяСгруппированная.ВидОперацииПМ КАК ВидОперацииПМ,
		|    ВсеРабочееВремяСгруппированная.ЗадачаПричина КАК ЗадачаПричина,
		|    ВсеРабочееВремяСгруппированная.Начисление КАК Начисление,
		|    ВсеРабочееВремяСгруппированная.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|    ВсеРабочееВремяСгруппированная.Часы КАК Часы,
		|    ВсеРабочееВремяСгруппированная.Проект КАК Проект    
		|ИЗ
		|    ВсеРабочееВремяСгруппированная КАК ВсеРабочееВремяСгруппированная";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивПодзапросов = Новый Массив;
	
	МассивПодзапросов.Добавить(ТекстЗапросаПервыйПодзапрос());
	МассивПодзапросов.Добавить(ТекстЗапросаСоответствиеНачислений());
	МассивПодзапросов.Добавить(ТекстЗапросаИспользованиеВремени());
	МассивПодзапросов.Добавить(ТекстЗапросаИтоговыйПодзапрос());
	
	Запрос.Текст = СтрСоединить(МассивПодзапросов, " ; ");
	
	СтатьяРасходовРаспределения = упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("СтатьяРасходовРаспределения");
	
	Запрос.УстановитьПараметр("СтатьяРасходовРаспределения", СтатьяРасходовРаспределения);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
		
	Если НЕ РезультатЗапроса[4].Пустой() Тогда

		ВывестиСообщениеОНевозможностиРаспределения(РезультатЗапроса[4]);
					
		Возврат Неопределено;
		
	КонецЕсли;	
	
	Если НЕ РезультатЗапроса[5].Пустой() Тогда
		
		Рез = РаспределитьНачисленияФизЛиц(РезультатЗапроса[5], ИсходнаяТаблица);
		
		ИсходнаяТаблица.Очистить();
		
		Для Каждого СтрокаРез Из Рез Цикл
			НоваяСтрока = ИсходнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРез);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ИсходнаяТаблица;
	
КонецФункции

Функция ТекстЗапросаПервыйПодзапрос()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|   Т.ФизическоеЛицо КАК ФизическоеЛицо,
		|   Т.Сотрудник КАК Сотрудник,
		|   Т.Подразделение КАК Подразделение,
		|   Т.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
		|   Т.ДатаНачала КАК ДатаНачала,
		|   Т.ВидОперации КАК ВидОперации,
		|   Т.Начисление КАК Начисление,
		|   Т.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|   Т.СпособРасчетов КАК СпособРасчетов,
		|   Т.СтатьяФинансирования КАК СтатьяФинансирования,
		|   Т.СтатьяРасходов КАК СтатьяРасходов,
		|   Т.НеОблагаетсяНДФЛ КАК НеОблагаетсяНДФЛ,
		|   Т.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|   Т.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
		|   Т.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
		|   Т.ВзносыВсего КАК ВзносыВсего,
		|   Т.Сумма КАК Сумма,
		|   Т.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
		|   Т.ПФРСПревышения КАК ПФРСПревышения,
		|   Т.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
		|   Т.ПФРСтраховая КАК ПФРСтраховая,
		|   Т.ПФРНакопительная КАК ПФРНакопительная,
		|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|   Т.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
		|   Т.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
		|   Т.ФСС КАК ФСС,
		|   Т.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
		|   Т.ФФОМС КАК ФФОМС,
		|   Т.ТФОМС КАК ТФОМС,
		|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
		|   Т.упоКорСпособОтраженияЗарплатыВБухучете КАК упоКорСпособОтраженияЗарплатыВБухучете,
		|   Т.упоКорПодразделениеУчетаЗатрат КАК упоКорПодразделениеУчетаЗатрат,
		|	Т.%1 КАК НачислениеERP_ЗУП     
		|ПОМЕСТИТЬ Т_Источник
		|ИЗ
		|   &Т КАК Т";
	
	ИмяКолонкиНачисление = упоРаспределениеЗарплатыНастройкиСервер.ИмяКолонкиНачисленияСоответствияВДокументе();
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, ИмяКолонкиНачисление);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаИтоговыйПодзапрос()
	
    ТекстЗапроса =
		"ВЫБРАТЬ
		|	Т.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Т.Сотрудник КАК Сотрудник,
		|	Т.Подразделение КАК Подразделение,
		|	Т.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
		|	Т.ДатаНачала КАК ДатаНачала,
		|	Т.ВидОперации КАК ВидОперации,
		|	Т.Начисление КАК Начисление,
		|	Т.СпособРасчетов КАК СпособРасчетов,
		|	Т.СтатьяФинансирования КАК СтатьяФинансирования,
		|	Т.СтатьяРасходов КАК СтатьяРасходов,
		|	Т.НеОблагаетсяНДФЛ КАК НеОблагаетсяНДФЛ,
		|	Т.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	Т.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
		|	Т.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
		|	Т.ВзносыВсего КАК ВзносыВсего,
		|	Т.Сумма КАК Сумма,
		|	Т.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
		|	Т.ПФРСПревышения КАК ПФРСПревышения,
		|	Т.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
		|	Т.ПФРСтраховая КАК ПФРСтраховая,
		|	Т.ПФРНакопительная КАК ПФРНакопительная,
		|	Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	Т.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
		|	Т.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
		|	Т.ФСС КАК ФСС,
		|	Т.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
		|	Т.ФФОМС КАК ФФОМС,
		|	Т.ТФОМС КАК ТФОМС,
		|	Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
		|	ЕСТЬNULL(втИспользованиеВремени.СпособОтраженияЗарплатыВБухучете, Т.СпособОтраженияЗарплатыВБухучете) КАК СпособОтраженияЗарплатыВБухучете,
		|	втИспользованиеВремени.ВидОперацииПМ КАК ВидОперацииПМ,
		|	втИспользованиеВремени.ЗадачаПричина КАК ЗадачаПричина,
		|	ЕСТЬNULL(втИспользованиеВремени.Часы, 0) КАК Часы,
		|	Т.НачислениеСоответствие КАК НачислениеСоответствие,
		|	ЕСТЬNULL(втИспользованиеВремени.Подразделение, НЕОПРЕДЕЛЕНО) КАК ПодразделениеИспользованиеВремени,
		|	Т.упоКорСпособОтраженияЗарплатыВБухучете КАК упоКорСпособОтраженияЗарплатыВБухучете,
		|	Т.упоКорПодразделениеУчетаЗатрат КАК упоКорПодразделениеУчетаЗатрат,
		|	Т.НачислениеERP_ЗУП КАК НачислениеERP_ЗУП
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	Т КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ втИспользованиеВремени КАК втИспользованиеВремени
		|		ПО Т.ФизическоеЛицо = втИспользованиеВремени.ФизическоеЛицо
		|			И Т.НачислениеСоответствие = втИспользованиеВремени.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_Результат.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Результат.ФизическоеЛицо,
		|	ВТ_Результат.СпособОтраженияЗарплатыВБухучете
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ВТ_Результат.ЗадачаПричина) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_Результат.Сотрудник КАК Сотрудник,
		|	ВТ_Результат.Подразделение КАК Подразделение,
		|	ВТ_Результат.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
		|	ВТ_Результат.ДатаНачала КАК ДатаНачала,
		|	ВТ_Результат.ВидОперации КАК ВидОперации,
		|	ВТ_Результат.Начисление КАК Начисление,
		|	ВТ_Результат.СпособРасчетов КАК СпособРасчетов,
		|	ВТ_Результат.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ВТ_Результат.СтатьяРасходов КАК СтатьяРасходов,
		|	ВТ_Результат.НеОблагаетсяНДФЛ КАК НеОблагаетсяНДФЛ,
		|	ВТ_Результат.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	ВТ_Результат.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
		|	ВТ_Результат.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
		|	ВТ_Результат.ВзносыВсего КАК ВзносыВсего,
		|	ВТ_Результат.Сумма КАК Сумма,
		|	ВТ_Результат.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
		|	ВТ_Результат.ПФРСПревышения КАК ПФРСПревышения,
		|	ВТ_Результат.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
		|	ВТ_Результат.ПФРСтраховая КАК ПФРСтраховая,
		|	ВТ_Результат.ПФРНакопительная КАК ПФРНакопительная,
		|	ВТ_Результат.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	ВТ_Результат.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	ВТ_Результат.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
		|	ВТ_Результат.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
		|	ВТ_Результат.ФСС КАК ФСС,
		|	ВТ_Результат.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
		|	ВТ_Результат.ФФОМС КАК ФФОМС,
		|	ВТ_Результат.ТФОМС КАК ТФОМС,
		|	ВТ_Результат.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	ВТ_Результат.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	ВТ_Результат.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	ВТ_Результат.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
		|	ВТ_Результат.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	ВТ_Результат.ВидОперацииПМ КАК ВидОперацииПМ,
		|	ВТ_Результат.ЗадачаПричина КАК ЗадачаПричина,
		|	ВТ_Результат.Часы КАК Часы,
		|	ВТ_Результат.НачислениеСоответствие КАК НачислениеСоответствие,
		|	ВТ_Результат.ПодразделениеИспользованиеВремени КАК ПодразделениеИспользованиеВремени,
		|	ВТ_Результат.упоКорСпособОтраженияЗарплатыВБухучете КАК упоКорСпособОтраженияЗарплатыВБухучете,
		|	ВТ_Результат.упоКорПодразделениеУчетаЗатрат КАК упоКорПодразделениеУчетаЗатрат,
		|	ВТ_Результат.НачислениеERP_ЗУП КАК НачислениеERP_ЗУП
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|ИТОГИ
		|	СУММА(Часы)
		|ПО
		|	ФизическоеЛицо,
		|	Начисление,
		|	ДатаНачала,
		|	НачислениеERP_ЗУП";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСоответствиеНачислений()
	
	Если упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("ИспользоватьСоответствиеНачислений") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|   Т.ФизическоеЛицо КАК ФизическоеЛицо,
			|   Т.Сотрудник КАК Сотрудник,
			|   Т.Подразделение КАК Подразделение,
			|   Т.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
			|   Т.ДатаНачала КАК ДатаНачала,
			|   Т.ВидОперации КАК ВидОперации,
			|   Т.Начисление КАК Начисление,
			|   Т.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
			|   Т.СпособРасчетов КАК СпособРасчетов,
			|   Т.СтатьяФинансирования КАК СтатьяФинансирования,
			|   Т.СтатьяРасходов КАК СтатьяРасходов,
			|   Т.НеОблагаетсяНДФЛ КАК НеОблагаетсяНДФЛ,
			|   Т.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
			|   Т.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
			|   Т.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
			|   Т.ВзносыВсего КАК ВзносыВсего,
			|   Т.Сумма КАК Сумма,
			|   Т.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
			|   Т.ПФРСПревышения КАК ПФРСПревышения,
			|   Т.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
			|   Т.ПФРСтраховая КАК ПФРСтраховая,
			|   Т.ПФРНакопительная КАК ПФРНакопительная,
			|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
			|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|   Т.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
			|   Т.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
			|   Т.ФСС КАК ФСС,
			|   Т.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
			|   Т.ФФОМС КАК ФФОМС,
			|   Т.ТФОМС КАК ТФОМС,
			|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
			|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
			|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
			|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
			|   ЕСТЬNULL(упоСоответствиеВидовНачисленийPM_ERP.ВидНачисленияPM, Т.Начисление) КАК НачислениеСоответствие,        
			|    Т.упоКорСпособОтраженияЗарплатыВБухучете КАК упоКорСпособОтраженияЗарплатыВБухучете,
			|    Т.упоКорПодразделениеУчетаЗатрат КАК упоКорПодразделениеУчетаЗатрат,
			|	 Т.НачислениеERP_ЗУП        
			|ПОМЕСТИТЬ Т
			|ИЗ
			|   Т_Источник КАК Т
			|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеВидовНачисленийPM_ERP КАК упоСоответствиеВидовНачисленийPM_ERP
			|       ПО Т.Начисление = упоСоответствиеВидовНачисленийPM_ERP.ВидНачисленияERP";
		
	Иначе
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|   Т.ФизическоеЛицо КАК ФизическоеЛицо,
			|   Т.Сотрудник КАК Сотрудник,
			|   Т.Подразделение КАК Подразделение,
			|   Т.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
			|   Т.ДатаНачала КАК ДатаНачала,
			|   Т.ВидОперации КАК ВидОперации,
			|   Т.Начисление КАК Начисление,
			|   Т.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
			|   Т.СпособРасчетов КАК СпособРасчетов,
			|   Т.СтатьяФинансирования КАК СтатьяФинансирования,
			|   Т.СтатьяРасходов КАК СтатьяРасходов,
			|   Т.НеОблагаетсяНДФЛ КАК НеОблагаетсяНДФЛ,
			|   Т.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
			|   Т.ВидНачисленияОплатыТрудаДляНУ КАК ВидНачисленияОплатыТрудаДляНУ,
			|   Т.ПериодПринятияРасходов КАК ПериодПринятияРасходов,
			|   Т.ВзносыВсего КАК ВзносыВсего,
			|   Т.Сумма КАК Сумма,
			|   Т.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
			|   Т.ПФРСПревышения КАК ПФРСПревышения,
			|   Т.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
			|   Т.ПФРСтраховая КАК ПФРСтраховая,
			|   Т.ПФРНакопительная КАК ПФРНакопительная,
			|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
			|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|   Т.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикам,
			|   Т.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерам,
			|   Т.ФСС КАК ФСС,
			|   Т.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
			|   Т.ФФОМС КАК ФФОМС,
			|   Т.ТФОМС КАК ТФОМС,
			|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
			|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
			|   Т.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
			|   Т.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
			|   Т.Начисление КАК НачислениеСоответствие,
			|   Т.упоКорСпособОтраженияЗарплатыВБухучете КАК упоКорСпособОтраженияЗарплатыВБухучете,
			|   Т.упоКорПодразделениеУчетаЗатрат КАК упоКорПодразделениеУчетаЗатрат,
			|   Т.НачислениеERP_ЗУП КАК НачислениеERP_ЗУП
			|ПОМЕСТИТЬ Т
			|ИЗ
			|   Т_Источник КАК Т
			|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоответствиеВидовНачисленийPM_ERP КАК упоСоответствиеВидовНачисленийPM_ERP
			|       ПО Т.Начисление = упоСоответствиеВидовНачисленийPM_ERP.ВидНачисленияERP";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаИспользованиеВремени()
	
	Возврат
	"ВЫБРАТЬ
	|	1 КАК НомерПодзапроса,
	|   ВсеРабочееВремя.ПериодНачислений КАК ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо КАК ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ КАК ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина КАК ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM КАК Начисление,
	|   СпособыОтраженияЗарплатыВБухУчете.Ссылка КАК СпособОтраженияЗарплатыВБухучете,
	|   СУММА(ВсеРабочееВремя.Часы) КАК Часы,
	|	ВсеРабочееВремя.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ втИспользованиеВремени
	|ИЗ
	|   ВсеРабочееВремяСгруппированная КАК ВсеРабочееВремя
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаправленияДеятельности КАК НаправленияДеятельности
	|           ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияЗарплатыВБухУчете КАК СпособыОтраженияЗарплатыВБухУчете
	|           ПО НаправленияДеятельности.Ссылка = СпособыОтраженияЗарплатыВБухУчете.НаправлениеДеятельности
	|       ПО ВсеРабочееВремя.ЗадачаПричина = НаправленияДеятельности.упоПроектнаяЗадачаЗеркало
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|       ПО ВсеРабочееВремя.ЗадачаПричина.упоКорневойПроект = Проекты.Ссылка
	|ГДЕ
	|   ТИПЗНАЧЕНИЯ(ВсеРабочееВремя.ЗадачаПричина) = ТИП(Справочник.Проекты)
	|   И ВсеРабочееВремя.ЗадачаПричина.ЭтоПроектнаяЗадача
	|   И ВсеРабочееВремя.ЗадачаПричина.ЭтоАктируемаяЗадача
	|   И ВсеРабочееВремя.ВидОперацииПМ.РазделУчета = ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача)
	|   И НЕ ВсеРабочееВремя.ВидОперацииПМ.Служебный
	|   И НЕ СпособыОтраженияЗарплатыВБухУчете.Ссылка.ПометкаУдаления
	|   И НЕ Проекты.Компонент = ЗНАЧЕНИЕ(Перечисление.упоКомпоненты.ОбщефирменнаяДеятельность)
	|
	|СГРУППИРОВАТЬ ПО
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   СпособыОтраженияЗарплатыВБухУчете.Ссылка,        
	|	ВсеРабочееВремя.Подразделение    
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2, 
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,
	|   СУММА(ВсеРабочееВремя.Часы),
	|	ВсеРабочееВремя.Подразделение КАК Подразделение        
	|ИЗ
	|   ВсеРабочееВремяСгруппированная КАК ВсеРабочееВремя
	|ГДЕ
	|   ТИПЗНАЧЕНИЯ(ВсеРабочееВремя.ЗадачаПричина) = ТИП(Справочник.упоВнепроектныеЗадачи)
	|   И ВсеРабочееВремя.ВидОперацииПМ.РазделУчета = ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача)
	|
	|СГРУППИРОВАТЬ ПО
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,
	|	ВсеРабочееВремя.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3, 
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,
	|   СУММА(ВсеРабочееВремя.Часы),
	|	ВсеРабочееВремя.Подразделение КАК Подразделение
	|ИЗ
	|   ВсеРабочееВремяСгруппированная КАК ВсеРабочееВремя
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|       ПО ВсеРабочееВремя.ЗадачаПричина.упоКорневойПроект = Проекты.Ссылка
	|ГДЕ
	|   ТИПЗНАЧЕНИЯ(ВсеРабочееВремя.ЗадачаПричина) = ТИП(Справочник.Проекты)
	|   И ВсеРабочееВремя.ЗадачаПричина.ЭтоПроектнаяЗадача
	|   И ВсеРабочееВремя.ЗадачаПричина.ЭтоАктируемаяЗадача
	|   И ВсеРабочееВремя.ВидОперацииПМ.РазделУчета = ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача)
	|   И Проекты.Компонент = ЗНАЧЕНИЕ(Перечисление.упоКомпоненты.ОбщефирменнаяДеятельность)
	|
	|СГРУППИРОВАТЬ ПО
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.СпособОтраженияЗарплатыВБухучете,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,
	|	ВсеРабочееВремя.Подразделение
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4, 
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,
	|   СУММА(ВсеРабочееВремя.Часы),
	|	ВсеРабочееВремя.Подразделение КАК Подразделение        
	|ИЗ
	|   ВсеРабочееВремяСгруппированная КАК ВсеРабочееВремя
	|ГДЕ
	|   ТИПЗНАЧЕНИЯ(ВсеРабочееВремя.ЗадачаПричина) = ТИП(Справочник.упоПричиныПотерьРабочегоВремени)
	|   И ВсеРабочееВремя.ВидОперацииПМ.РазделУчета = ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени)
	|
	|СГРУППИРОВАТЬ ПО
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,        
	|	ВсеРабочееВремя.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5, 
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,
	|   СУММА(ВсеРабочееВремя.Часы),
	|	ВсеРабочееВремя.Подразделение КАК Подразделение
	|ИЗ
	|   ВсеРабочееВремяСгруппированная КАК ВсеРабочееВремя
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|       ПО ВсеРабочееВремя.ЗадачаПричина.упоКорневойПроект = Проекты.Ссылка
	|ГДЕ
	|   ТИПЗНАЧЕНИЯ(ВсеРабочееВремя.ЗадачаПричина) = ТИП(Справочник.Проекты)
	|   И ВсеРабочееВремя.ЗадачаПричина.ЭтоПроектнаяЗадача
	|   И ВсеРабочееВремя.ЗадачаПричина.ЭтоАктируемаяЗадача
	|   И ВсеРабочееВремя.ВидОперацииПМ.РазделУчета = ЗНАЧЕНИЕ(Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача)
	|   И ВсеРабочееВремя.ВидОперацииПМ.Служебный    
	|   И НЕ Проекты.Компонент = ЗНАЧЕНИЕ(Перечисление.упоКомпоненты.ОбщефирменнаяДеятельность)
	|
	|СГРУППИРОВАТЬ ПО
	|   ВсеРабочееВремя.ПериодНачислений,
	|   ВсеРабочееВремя.ФизическоеЛицо,
	|   ВсеРабочееВремя.ВидОперацииПМ,
	|   ВсеРабочееВремя.ЗадачаПричина,
	|   ВсеРабочееВремя.ВидОперацииПМ.ВидНачисленияPM,
	|   ВсеРабочееВремя.СпособОтраженияЗарплатыВБухучете,
	|   ВсеРабочееВремя.ВидОперацииПМ.СпособОтраженияЗарплаты,
	|	ВсеРабочееВремя.Подразделение";
	
КонецФункции

Функция ТекстЗапросаВТ_ВсеРабочееВремя(Парам)
	
	ИспользоватьСогласованныеЧасы = Неопределено;
	Если НЕ Парам.Свойство("ИспользоватьСогласованныеЧасы", ИспользоватьСогласованныеЧасы) Тогда
		ИспользоватьСогласованныеЧасы = Ложь;
	КонецЕсли;
	
	Если ИспользоватьСогласованныеЧасы Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(упоИспользованиеРабочегоВремени.День, МЕСЯЦ) КАК ПериодНачислений,
			|	упоИспользованиеРабочегоВремени.Подразделение КАК Подразделение,
			|	упоИспользованиеРабочегоВремени.ТрудовойРесурс.ФизическоеЛицо КАК ФизическоеЛицо,
			|	упоИспользованиеРабочегоВремени.ВидОперации КАК ВидОперацииПМ,
			|	упоИспользованиеРабочегоВремени.ЗадачаПричина КАК ЗадачаПричина,
			|	НЕОПРЕДЕЛЕНО КАК Начисление,
			|	НЕОПРЕДЕЛЕНО КАК СпособОтраженияЗарплатыВБухучете,
			|	СУММА(0) КАК Часы,
			|	ВЫБОР
			|		КОГДА упоИспользованиеРабочегоВремени.ЗадачаПричина ССЫЛКА Справочник.Проекты
			|			ТОГДА упоИспользованиеРабочегоВремени.ЗадачаПричина.упоКорневойПроект
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Проект
			|ПОМЕСТИТЬ ВсеРабочееВремя
			|ИЗ
			|	РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
			|ГДЕ
			|	упоИспользованиеРабочегоВремени.День МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НЕ упоИспользованиеРабочегоВремени.ТрудовойРесурс.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	НАЧАЛОПЕРИОДА(упоИспользованиеРабочегоВремени.День, МЕСЯЦ),
			|	упоИспользованиеРабочегоВремени.Подразделение,
			|	упоИспользованиеРабочегоВремени.ТрудовойРесурс.ФизическоеЛицо,
			|	упоИспользованиеРабочегоВремени.ВидОперации,
			|	упоИспользованиеРабочегоВремени.ЗадачаПричина,
			|	ВЫБОР
			|		КОГДА упоИспользованиеРабочегоВремени.ЗадачаПричина ССЫЛКА Справочник.Проекты
			|			ТОГДА упоИспользованиеРабочегоВремени.ЗадачаПричина.упоКорневойПроект
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СогласованныеТрудозатратыЗаПериод.ПериодМесяц,
			|	СогласованныеТрудозатратыЗаПериод.Подразделение,
			|	СогласованныеТрудозатратыЗаПериод.Ресурс.ФизическоеЛицо,
			|	СогласованныеТрудозатратыЗаПериод.ВидОперации,
			|	Проекты.Ссылка,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	СУММА(СогласованныеТрудозатратыЗаПериод.СогласованныеЧасыОборот),
			|	СогласованныеТрудозатратыЗаПериод.ПроектнаяЗадача.Проект
			|ИЗ
			|	РегистрНакопления.упоСогласованныеТрудозатраты.Обороты(&НачалоПериода, &КонецПериода, Авто, ) КАК СогласованныеТрудозатратыЗаПериод
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
			|		ПО СогласованныеТрудозатратыЗаПериод.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
			|ГДЕ
			|	&ИспользоватьСогласованныеЧасы
			|	И НЕ СогласованныеТрудозатратыЗаПериод.Ресурс.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	СогласованныеТрудозатратыЗаПериод.ПериодМесяц,
			|	СогласованныеТрудозатратыЗаПериод.Подразделение,
			|	СогласованныеТрудозатратыЗаПериод.Ресурс.ФизическоеЛицо,
			|	СогласованныеТрудозатратыЗаПериод.ВидОперации,
			|	СогласованныеТрудозатратыЗаПериод.ПроектнаяЗадача.Проект,
			|	Проекты.Ссылка";
		
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|    НАЧАЛОПЕРИОДА(упоИспользованиеРабочегоВремени.День, МЕСЯЦ) КАК ПериодНачислений,
			|    упоИспользованиеРабочегоВремени.Подразделение КАК Подразделение, 
			|    упоИспользованиеРабочегоВремени.ТрудовойРесурс.ФизическоеЛицо КАК ФизическоеЛицо,
			|    упоИспользованиеРабочегоВремени.ВидОперации КАК ВидОперацииПМ,
			|    упоИспользованиеРабочегоВремени.ЗадачаПричина КАК ЗадачаПричина,
			|    НЕОПРЕДЕЛЕНО КАК Начисление,
			|    НЕОПРЕДЕЛЕНО КАК СпособОтраженияЗарплатыВБухучете,
			|    упоИспользованиеРабочегоВремени.Трудозатраты КАК Часы,
			|    ВЫБОР
			|        КОГДА упоИспользованиеРабочегоВремени.ЗадачаПричина ССЫЛКА Справочник.Проекты
			|            ТОГДА упоИспользованиеРабочегоВремени.ЗадачаПричина.упоКорневойПроект
			|        ИНАЧЕ НЕОПРЕДЕЛЕНО
			|    КОНЕЦ КАК Проект 
			|ПОМЕСТИТЬ ВсеРабочееВремя
			|ИЗ
			|    РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
			|ГДЕ
			|    упоИспользованиеРабочегоВремени.День МЕЖДУ &НачалоПериода И &КонецПериода
			|    И НЕ упоИспользованиеРабочегоВремени.ТрудовойРесурс.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
			|";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьПроектыПериодНачислений(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
		|    ВсеРабочееВремя.Проект КАК Проект
		|ИЗ
		|    ВсеРабочееВремя КАК ВсеРабочееВремя
		|ГДЕ
		|    НЕ ВсеРабочееВремя.Проект = НЕОПРЕДЕЛЕНО
		|
		|СГРУППИРОВАТЬ ПО
		|    ВсеРабочееВремя.Проект";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Проект");
	
КонецФункции

Функция РаспределитьНачисленияФизЛиц(РезультатЗапроса, Контейнер)
	
	ИмяКолонкиНачисление = упоРаспределениеЗарплатыНастройкиСервер.ИмяКолонкиНачисленияСоответствияВДокументе();
	
	НачисленнаяЗарплатаИВзносыПоФизлицам = Контейнер.Скопировать();
	
	МассивСуммовыеПоказатели = МассивСуммовыеПоказатели();
	ИмяКолонкиНачисления = упоРаспределениеЗарплатыНастройкиСервер.ИмяКолонкиНачисленияСоответствияВДокументе();
	
	КолонкиДляСуммированияСтрокой = СтрСоединить(МассивСуммовыеПоказатели, ",");
	КолонкиДляСуммирования = Новый Структура(КолонкиДляСуммированияСтрокой);
	
	Выборка_ФизическоеЛицо = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИД = 0;
	
	Пока Выборка_ФизическоеЛицо.следующий() Цикл
		
		ИД = ИД + 1;
		Выборка_ВидОперации = Выборка_ФизическоеЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка_ВидОперации.Следующий() Цикл
			
			Выборка_ДатаНачала = Выборка_ВидОперации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка_ДатаНачала.Следующий() Цикл
				
				Выборка_НачислениеERP_ЗУП = Выборка_ДатаНачала.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ТаблицаКоэфНачисленияERP_ЗУП = ПолучитьТаблицаКоэфНачисленияERP_ЗУП(Выборка_НачислениеERP_ЗУП, НачисленнаяЗарплатаИВзносыПоФизлицам);
				
				Пока Выборка_НачислениеERP_ЗУП.Следующий() Цикл
					
					КоэффициентыНачисленияERP_ЗУП = ТаблицаКоэфНачисленияERP_ЗУП.Найти(Выборка_НачислениеERP_ЗУП.НачислениеERP_ЗУП, ИмяКолонкиНачисление);
					
					ЧасовВсего = Выборка_НачислениеERP_ЗУП.Часы;
					КоэффициентыРаспределения = Новый Массив;
					МассивСпособОтражения = Новый Массив;
					МассивНачислениеСоответствие = Новый Массив;
					МассивПодразделениеИспользованиеВремени = Новый Массив;
					
					ПараметрыОтбора = Новый Структура("ФизическоеЛицо, Начисление, ДатаНачала");
					ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка_НачислениеERP_ЗУП);
					ПараметрыОтбора.Вставить(ИмяКолонкиНачисления, Выборка_НачислениеERP_ЗУП.НачислениеERP_ЗУП);
					
					Найдено = НачисленнаяЗарплатаИВзносыПоФизлицам.НайтиСтроки(ПараметрыОтбора);
					
					Если Найдено.Количество() Тогда
						
						СтрокаТаблицыКакСтруктура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Найдено[0]);
						
						Если Найдено.Количество() > 1 Тогда
							Для сч = 1 По Найдено.Количество() - 1 Цикл
								
								Для Каждого СуммовойПоказатель Из КолонкиДляСуммирования Цикл
									СтрокаТаблицыКакСтруктура[СуммовойПоказатель.Ключ] = СтрокаТаблицыКакСтруктура[СуммовойПоказатель.Ключ] + Найдено[сч][СуммовойПоказатель.Ключ];
								КонецЦикла;
								
							КонецЦикла;
						КонецЕсли;
						
						Выборка = Выборка_НачислениеERP_ЗУП.Выбрать();
						Пока Выборка.следующий() Цикл
							МассивСпособОтражения.Добавить(Выборка.СпособОтраженияЗарплатыВБухучете);
							МассивНачислениеСоответствие.Добавить(Выборка.НачислениеСоответствие);
							КоэффициентыРаспределения.Добавить(Выборка.Часы);
							МассивПодразделениеИспользованиеВремени.Добавить(Выборка.ПодразделениеИспользованиеВремени);
						КонецЦикла;
						
						РезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(1, КоэффициентыРаспределения, 6);
						
						Если РезультатРаспределения = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						Для Каждого СуммовойПоказатель Из КолонкиДляСуммирования Цикл
							КолонкиДляСуммирования[СуммовойПоказатель.Ключ] =
								ОбщегоНазначения.
								РаспределитьСуммуПропорциональноКоэффициентам(
									СтрокаТаблицыКакСтруктура[СуммовойПоказатель.Ключ], РезультатРаспределения, 2);
						КонецЦикла;
						
						КолЭлементов = РезультатРаспределения.Количество() - 1;
						
						Для сч = 0 По КолЭлементов Цикл
							
							НоваяСтрока = НачисленнаяЗарплатаИВзносыПоФизлицам.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыКакСтруктура, , КолонкиДляСуммированияСтрокой);
							
							НоваяСтрока.СпособОтраженияЗарплатыВБухучете = МассивСпособОтражения[сч];
							НоваяСтрока.НачислениеСоответствие = МассивНачислениеСоответствие[сч];
							НоваяСтрока.КоэффициентРаспределения = РезультатРаспределения[сч] * КоэффициентыНачисленияERP_ЗУП["КоэфСумма"];
							НоваяСтрока.Часы = КоэффициентыРаспределения[сч] * КоэффициентыНачисленияERP_ЗУП["КоэфСумма"];
							НоваяСтрока.ЧасыВсего = ЧасовВсего * КоэффициентыНачисленияERP_ЗУП["КоэфСумма"];
							НоваяСтрока.ИД = ИД;
							
							Если ЗначениеЗаполнено(МассивПодразделениеИспользованиеВремени[сч]) Тогда
								НоваяСтрока.ПодразделениеИспользованиеВремени = МассивПодразделениеИспользованиеВремени[сч];
							КонецЕсли;
							
							Для Каждого СуммовойПоказатель Из КолонкиДляСуммирования Цикл
								Если СуммовойПоказатель.Значение = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								НоваяСтрока[СуммовойПоказатель.Ключ] = СуммовойПоказатель.Значение[сч];
							КонецЦикла;
							
						КонецЦикла;
						
						сч = Найдено.Количество() - 1;
						Пока сч >= 0 Цикл
							НачисленнаяЗарплатаИВзносыПоФизлицам.Удалить(Найдено[сч]);
							сч = сч - 1;
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НачисленнаяЗарплатаИВзносыПоФизлицам;
	
КонецФункции

Функция ПолучитьТаблицаКоэфНачисленияERP_ЗУП(Выборка, НачисленнаяЗарплатаИВзносыПоФизлицам)
	
	ИмяКолонкиНачисления = упоРаспределениеЗарплатыНастройкиСервер.ИмяКолонкиНачисленияСоответствияВДокументе();
	МассивСуммовыеПоказатели = МассивСуммовыеПоказатели();
	КолонкиДляСуммированияСтрокой = СтрСоединить(МассивСуммовыеПоказатели, ",");
	КолонкиДляСуммирования = Новый Структура(КолонкиДляСуммированияСтрокой);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить(ИмяКолонкиНачисления);
	
	Для Каждого ИмяКолонки Из МассивСуммовыеПоказатели Цикл
		Таблица.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура("ФизическоеЛицо, Начисление, ДатаНачала");
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Выборка);
		ПараметрыОтбора.Вставить(ИмяКолонкиНачисления, Выборка.НачислениеERP_ЗУП);
		
		Найдено = НачисленнаяЗарплатаИВзносыПоФизлицам.НайтиСтроки(ПараметрыОтбора);
		
		Если Найдено.Количество() Тогда
			Для Каждого СтрокаНайдено Из Найдено Цикл
				НоваяСтрока = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНайдено);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Таблица.Свернуть(ИмяКолонкиНачисления, КолонкиДляСуммированияСтрокой);
	Выборка.Сбросить();
	
	Для Каждого ИмяКолонки Из МассивСуммовыеПоказатели Цикл
		Таблица.Колонки.Добавить("Коэф" + ИмяКолонки);
		РаспределяемаяСумма = Таблица.Итог(ИмяКолонки);
		МассивКоэффициенты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(1, Таблица.ВыгрузитьКолонку(ИмяКолонки), 4);
		
		Если НЕ МассивКоэффициенты = Неопределено Тогда
			Таблица.ЗагрузитьКолонку(МассивКоэффициенты, "Коэф" + ИмяКолонки);
		Иначе
			Таблица.ЗаполнитьЗначения(0, "Коэф" + ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция МассивСуммовыеПоказатели()
	
	МассивКолонок = Новый Массив;
	
	МассивКолонок.Добавить("ПФРДоПредельнойВеличины");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки");
	МассивКолонок.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка");
	МассивКолонок.Добавить("ПФРНаДоплатуЛетчикам");
	МассивКолонок.Добавить("ПФРНаДоплатуШахтерам");
	МассивКолонок.Добавить("ПФРНакопительная");
	МассивКолонок.Добавить("ПФРПоСуммарномуТарифу");
	МассивКолонок.Добавить("ПФРСПревышения");
	МассивКолонок.Добавить("ПФРСтраховая");
	МассивКолонок.Добавить("Сумма");
	МассивКолонок.Добавить("ТФОМС");
	МассивКолонок.Добавить("ФСС");
	МассивКолонок.Добавить("ФССНесчастныеСлучаи");
	МассивКолонок.Добавить("ФФОМС");
	МассивКолонок.Добавить("ВзносыПоЕдиномуТарифу");
	
	Возврат МассивКолонок;
	
КонецФункции

Функция ТаблицаСвязиЗадачПоПризнакуАктируемости(МассивПроекты)
	
	Т_Результат = Новый ТаблицаЗначений;
	
	Т_Результат.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	Т_Результат.Колонки.Добавить("Потомок", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	
	Если НЕ упоРаспределениеЗарплатыНастройкиСервер.ЗначениеНастройкиПодсистемы("ОтражатьНеактируемыеТрудозатраты") Тогда
		Возврат Т_Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", МассивПроекты);
	
	Запрос.Текст = ТекстЗапросаИерархияЗадач();

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Т_Результат;
	КонецЕсли;
	
	Таблица = РезультатЗапроса.Выгрузить();
	Т_Актируемые = Таблица.СкопироватьКолонки();
	
	КолвоЭлементов = Таблица.Количество() - 1;
	Соответствие = Новый Соответствие;
	
	Для сч = 0 По КолвоЭлементов Цикл
		
		СтрокаТаблицы = Таблица[сч];
		
		Если СтрокаТаблицы.ЭтоАктируемаяЗадача Тогда
			НоваяСтрока = Т_Актируемые.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Родитель) Тогда
			Продолжить;
		КонецЕсли;
		
		ДочерниеЭлементы = Соответствие.Получить(СтрокаТаблицы.Родитель);
		Если ДочерниеЭлементы = Неопределено Тогда
			Соответствие.Вставить(СтрокаТаблицы.Родитель, Новый Массив);
			ДочерниеЭлементы = Соответствие.Получить(СтрокаТаблицы.Родитель);
		КонецЕсли;
		
		ДочерниеЭлементы.Добавить(СтрокаТаблицы);
		
	КонецЦикла;
	
	ПолучитьНеактируемыеЭтапыПроектаВГлубинуДерева(Т_Актируемые, Т_Результат, Соответствие);
	
	Возврат Т_Результат;
	
КонецФункции

Функция ТекстЗапросаИерархияЗадач()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
    |   Проекты.КодСДР КАК КодСДР,
    |   Проекты.Ссылка КАК СсылкаНаЗеркальныйПроект,
    |   Проекты.упоКорневойПроект КАК КорневойПроект
    |ПОМЕСТИТЬ ВТ_ДопСвойстваПЗ
    |ИЗ
    |   Справочник.Проекты КАК Проекты
    |ГДЕ
    |   Проекты.Ссылка В ИЕРАРХИИ(&Проект)
    |   И Проекты.ЭтоПроектнаяЗадача
    |
    |ИНДЕКСИРОВАТЬ ПО
    |   ПроектнаяЗадача
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   упоВерсииПроекта.Проект КАК Проект,
    |   упоВерсииПроекта.Версия КАК Версия
    |ПОМЕСТИТЬ ВТ_ТекущиеВерсииПроектов
    |ИЗ
    |   РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
    |ГДЕ
    |   упоВерсииПроекта.Проект В(&Проект)
    |   И упоВерсииПроекта.Текущая
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
    |   ПроектныеЗадачи.Версия КАК Версия,
    |   ПроектныеЗадачи.ЗадачаРодитель КАК Родитель,
    |   ПроектныеЗадачи.ПроектнаяЗадача КАК ЗадачаСсылка,
    |   ПроектныеЗадачи.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
    |   ПроектныеЗадачи.НазваниеЗадачи КАК НазваниеЗадачи,
    |   ПроектныеЗадачи.ДлительностьМоделиПакетаРабот КАК Длительность,
    |   ПроектныеЗадачи.ЭтоПакетРабот КАК ЭтоПакетРабот,
    |   ПроектныеЗадачи.ЭтоВеха КАК ЭтоВеха,
    |   ПроектныеЗадачи.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот
    |ПОМЕСТИТЬ ВТ_СвойстваПЗ
    |ИЗ
    |   РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
    |           ,
    |           Версия В
    |               (ВЫБРАТЬ
    |                   ВТ_ТекущиеВерсииПроектов.Версия КАК Версия
    |               ИЗ
    |                   ВТ_ТекущиеВерсииПроектов КАК ВТ_ТекущиеВерсииПроектов)) КАК ПроектныеЗадачи
    |ГДЕ
    |   НЕ ПроектныеЗадачи.ЗадачаОтменена
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТ_ДопСвойстваПЗ.КорневойПроект КАК КорневойПроект,
    |   ВТ_ДопСвойстваПЗ.КодСДР КАК КодСДР,
    |   ВТ_ДопСвойстваПЗ.СсылкаНаЗеркальныйПроект КАК СсылкаНаЗеркальныйПроект,
    |   ВТ_СвойстваПЗ.Родитель КАК Родитель,
    |   ВТ_СвойстваПЗ.ЗадачаСсылка КАК ЗадачаСсылка,
    |   ВТ_СвойстваПЗ.ЭтоАктируемаяЗадача КАК ЭтоАктируемаяЗадача,
    |   ВТ_СвойстваПЗ.НазваниеЗадачи КАК НазваниеЗадачи,
    |   ВТ_СвойстваПЗ.Длительность КАК Длительность,
    |   ВТ_СвойстваПЗ.ЭтоПакетРабот КАК ЭтоПакетРабот,
    |   ВТ_СвойстваПЗ.ЭтоВеха КАК ЭтоВеха,
    |   ВТ_СвойстваПЗ.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот
    |ИЗ
    |   ВТ_СвойстваПЗ КАК ВТ_СвойстваПЗ
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДопСвойстваПЗ КАК ВТ_ДопСвойстваПЗ
    |       ПО ВТ_СвойстваПЗ.ЗадачаСсылка = ВТ_ДопСвойстваПЗ.ПроектнаяЗадача
    |
    |УПОРЯДОЧИТЬ ПО
    |   КодСДР";
    
    Возврат ТекстЗапроса;
    
КонецФункции

Процедура ПолучитьНеактируемыеЭтапыПроектаВГлубинуДерева(Дерево, Т_Результат, Соответствие)
	
	Для Каждого СтрокаТаблицы Из Дерево Цикл
		
		Если НЕ СтрокаТаблицы.ЭтоАктируемаяЗадача Тогда
			Продолжить;
		КонецЕсли;
		
		АктируемаяЗадача = СтрокаТаблицы.СсылкаНаЗеркальныйПроект;
		ПолучитьНеактированныеДочерниеЭлементыВГлубину(АктируемаяЗадача, СтрокаТаблицы, Т_Результат, Соответствие);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьНеактированныеДочерниеЭлементыВГлубину(АктируемаяЗадача, СтрокаТаблицы, Т_Результат, Соответствие)
	
	ДочерниеЭлементы = Соответствие.Получить(СтрокаТаблицы.ЗадачаСсылка);
	
	Если ДочерниеЭлементы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПотомок Из ДочерниеЭлементы Цикл
		
		Если НЕ СтрокаПотомок.ЭтоАктируемаяЗадача Тогда
			
			НоваяСтрока = Т_Результат.Добавить();
			НоваяСтрока.Родитель = АктируемаяЗадача;
			НоваяСтрока.Потомок = СтрокаПотомок.СсылкаНаЗеркальныйПроект;
			
			ПолучитьНеактированныеДочерниеЭлементыВГлубину(АктируемаяЗадача, СтрокаПотомок, Т_Результат, Соответствие);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицаСхемаОтраженияНачисленийPM_ERP(ПараметрыВыполнения)
	
	Запрос = Новый Запрос;
	
	Для Каждого КЗ Из ПараметрыВыполнения Цикл
		Запрос.УстановитьПараметр(КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	 &ПериодРегистрации КАК ПериодРегистрации,
		|    Таблица.Ссылка КАК ДокументОтражения,          
		|    Таблица.НомерСтроки КАК Номер,    
		|    Таблица.ФизическоеЛицо, 
		|    Таблица.ПодразделениеПредприятия,
		|    Таблица.ВидОперации,
		|    Таблица.СпособОтраженияЗарплатыВБухучете,
		|    Таблица.ОблагаетсяЕНВД,
		|    Таблица.Сумма,
		|    Таблица.ПФРСтраховая,
		|    Таблица.ПФРНакопительная,
		|    Таблица.ПФРПоСуммарномуТарифу,
		|    Таблица.ПФРНаДоплатуЛетчикам,
		|    Таблица.ПФРНаДоплатуШахтерам,
		|    Таблица.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|    Таблица.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|    Таблица.ФСС,
		|    Таблица.ФФОМС,
		|    Таблица.ТФОМС,
		|    Таблица.ФССНесчастныеСлучаи,
		|    Таблица.ВзносыВсего,
		|    Таблица.ВидНачисленияОплатыТрудаДляНУ,
		|    Таблица.ПФРДоПредельнойВеличины,
		|    Таблица.ПФРСПревышения,
		|    Таблица.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|    Таблица.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|    Таблица.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|    Таблица.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка,
		|    Таблица.СпособРасчетов,    
		|	 &ПериодРегистрации КАК ДатаНачала,    
		|	 0 КАК ЧасыВсего,
		|	 Таблица.упоПодразделение КАК Подразделение,
		|	 Неопределено КАК ПодразделениеУчетаЗатрат,
		|	 Неопределено КАК Сотрудник,
		|	 Неопределено КАК СтатьяРасходов,
		|	 Неопределено КАК СтатьяФинансирования,
		|	 Таблица.упоНачислениеPM КАК НачислениеPM,
		|	 Таблица.упоНачислениеERP КАК НачислениеERP,
		|	 Таблица.упоНачислениеЗУП КАК НачислениеЗУП,
		|    Таблица.упоЧасы КАК Часы,
		|    Таблица.упоКоэффициент КАК КоэффициентРаспределения,
		|    Таблица.ВзносыПоЕдиномуТарифу КАК ВзносыПоЕдиномуТарифу
		|ИЗ
		|    Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносыПоФизлицам КАК Таблица
		|ГДЕ
		|    Таблица.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура СвернутьДанныеДляОтраженияЗарплатыВБухучете(РезультатЗаполнения)
	
	МодульОтражениеЗарплатыВБухучете = ОбщегоНазначения.ОбщийМодуль("ОтражениеЗарплатыВБухучете");
	МодульОтражениеЗарплатыВБухучете.СвернутьДанныеДляОтраженияЗарплатыВБухучете(РезультатЗаполнения,
		"Сотрудник,ДатаНачала");
	
КонецПроцедуры

Процедура ЗаполнитьПодразделениеВТаблице(ДанныеДляЗаполнения, Параметры, АдресХранилища)
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("НачисленнаяЗарплатаИВзносы");
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		
		Колонка = ДанныеДляЗаполнения[ИмяТаблицы].Колонки.Найти("МестоВСтруктуреПредприятия");
		Если Колонка <> Неопределено Тогда
			Колонка.Имя = "ПодразделениеПредприятия";
		Иначе
			ДанныеДляЗаполнения[ИмяТаблицы].Колонки.Добавить(
				"ПодразделениеПредприятия", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
		КонецЕсли;
		
		Колонка = ДанныеДляЗаполнения[ИмяТаблицы].Колонки.Найти("Подразделение");
		Если Колонка <> Неопределено Тогда
			ДанныеДляЗаполнения[ИмяТаблицы].Колонки.Удалить(Колонка);
		КонецЕсли;
		
		Если ИмяТаблицы = "НачисленнаяЗарплатаИВзносы" Тогда
			
			Таблица = ДанныеДляЗаполнения[ИмяТаблицы];
			
			Для Каждого Строка Из Таблица Цикл
				упоПодразделение = Строка["ПодразделениеИспользованиеВремени"];
				Если упоПодразделение = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ЗначениеСоответствия = упоИнтеграцияВызовСервера.НайтиСвязанныйЭлементСтруктурыИлиПодразделения(упоПодразделение);
				Строка["ПодразделениеПредприятия"] = ?(ЗначениеЗаполнено(ЗначениеСоответствия), ЗначениеСоответствия,
						Строка["ПодразделениеУчетаЗатрат"]);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатЗаполнения = Новый Структура("РезультатОтраженияЗарплаты", ДанныеДляЗаполнения);
	ПоместитьВоВременноеХранилище(РезультатЗаполнения, АдресХранилища);
	
КонецПроцедуры

Процедура ЗаполнениеПослеВыполненияДлительнойОперации(Объект, СписокТаблиц, Результат, АдресХранилища)
	
	СтрокаСписокТаблиц = "";
	
	Если СписокТаблиц.Количество() = 0 Или СписокТаблиц.НайтиПоЗначению("НачисленнаяЗарплатаИВзносы") <> Неопределено Тогда
		Объект.НачисленнаяЗарплатаИВзносы.Очистить();
		Объект.НачисленнаяЗарплатаИВзносыПоФизлицам.Очистить();
		СтрокаСписокТаблиц = "НачисленнаяЗарплатаИВзносы,";
	КонецЕсли;
	
	Результат.Вставить("АдресХранилища", АдресХранилища);
	Результат.Вставить("СтрокаСписокТаблиц", СтрокаСписокТаблиц);
	Результат.Вставить("СписокТаблиц", СписокТаблиц);
	Результат.Вставить("ТекстОповещения", "");
	Результат.Вставить("ПояснениеОповещения", "");
	Результат.Вставить("ЕстьДанныеДляЗаполнения", Ложь);
	Результат.Вставить("Сводно", Объект.Сводно);
	Результат.Вставить("ЗаполнятьАналитики", Истина);
	Результат.Вставить("НеПерезаполнятьСпособРасчетов", Истина);
	
	Документы.ОтражениеЗарплатыВФинансовомУчете.ЗаполнениеПослеВыполненияДлительнойОперации(Объект, Результат);
	
КонецПроцедуры

Функция МассивВыгружаемыхКолонок()
	
	Массив = Новый Массив;
	
	Массив.Добавить("ВзносыВсего");
	Массив.Добавить("ВзносыПоЕдиномуТарифу");
	Массив.Добавить("ВидНачисленияОплатыТрудаДляНУ");
	Массив.Добавить("ВидОперации");
	Массив.Добавить("НеОблагаетсяНДФЛ");
	Массив.Добавить("ОблагаетсяЕНВД");
	Массив.Добавить("ПодразделениеПредприятия");
	Массив.Добавить("ПФРДоПредельнойВеличины");
	Массив.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
	Массив.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки");
	Массив.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка");
	Массив.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
	Массив.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки");
	Массив.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка");
	Массив.Добавить("ПФРНаДоплатуЛетчикам");
	Массив.Добавить("ПФРНаДоплатуШахтерам");
	Массив.Добавить("ПФРНакопительная");
	Массив.Добавить("ПФРПоСуммарномуТарифу");
	Массив.Добавить("ПФРСПревышения");
	Массив.Добавить("ПФРСтраховая");
	Массив.Добавить("СпособОтраженияЗарплатыВБухучете");
	Массив.Добавить("СпособРасчетов");
	Массив.Добавить("Сумма");
	Массив.Добавить("ТФОМС");
	Массив.Добавить("ФСС");
	Массив.Добавить("ФССНесчастныеСлучаи");
	Массив.Добавить("ФФОМС");
	Массив.Добавить("ФизическоеЛицо");
	Массив.Добавить("упоНачислениеPM");
	Массив.Добавить("упоНачислениеERP");
	Массив.Добавить("упоНачислениеЗУП");
	Массив.Добавить("упоКорСпособОтраженияЗарплатыВБухучете");
	Массив.Добавить("упоПодразделение");
	Массив.Добавить("упоКорПодразделениеУчетаЗатрат");
	
	Возврат Массив;
	
КонецФункции

Процедура ВывестиСообщениеОНевозможностиРаспределения(РезультатЗапроса)
	
	ФизЛицаСпособыОтражения = Новый Соответствие;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпособыОтраженияЗарплатыФизЛица = ФизЛицаСпособыОтражения[Выборка.ФизическоеЛицо];
		Если ЗначениеЗаполнено(СпособыОтраженияЗарплатыФизЛица) Тогда
			СпособОтраженияСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("""%1""",
				Выборка.СпособОтраженияЗарплатыВБухучете);
			СпособыОтраженияЗарплатыФизЛица.Добавить(СпособОтраженияСтрокой);	
		Иначе
			СпособыОтраженияЗарплатыФизЛица = Новый Массив;
			СпособОтраженияСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("""%1""",
				Выборка.СпособОтраженияЗарплатыВБухучете);
			СпособыОтраженияЗарплатыФизЛица.Добавить(СпособОтраженияСтрокой);	
			ФизЛицаСпособыОтражения.Вставить(Выборка.ФизическоеЛицо, СпособыОтраженияЗарплатыФизЛица);
		КонецЕсли;
		
	КонецЦикла;
	
	ШаблонСообщения = 
		НСтр("ru = 'Для физического лица ""%1"" по способам отражения в учете %2 уже были распределены трудозатраты. '")
		+ НСтр("ru = 'Повторное распределение будет некорректно.'");
	
	Для каждого ФизЛицоСпособОтражения Из ФизЛицаСпособыОтражения Цикл
		СпособыОтраженияСтрокой = СтрСоединить(ФизЛицоСпособОтражения.Значение, ", ");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
		ФизЛицоСпособОтражения.Ключ, СпособыОтраженияСтрокой);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти