////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с формами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает валюту договора.
//
// Параметры:
//  Договор	 - СправочникСсылка.ДоговорыКонтрагентов - договор.
//
// Возвращаемое значение:
//	СправочникСсылка.Валюты - валюта договора.
//
Функция ВернутьВалютуДоговора(Договор) Экспорт
	
	Возврат упоУправлениеДоговорамиСервер.ВалютаДоговораКонтрагента(Договор);
	
КонецФункции

// Получает массив имен основных отчетов для проекта.
//
// Возвращаемое значение:
//	Массив - значения - строки-имена отчетов.
//
Функция ПолучитьМассивИменОсновныхОтчетовДляПроекта() Экспорт
	
	Массив = Новый Массив;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Массив.Добавить("упоПланФактныйАнализПоПрограмме");
	КонецЕсли;
	Массив.Добавить("упоСкользящийБДРОбъемыБДДС");
	Массив.Добавить("упоПланФактныйАнализБДР_Подразделения");//БДР
	Массив.Добавить("упоДвиженияДенежныхСредствПланФактСКД");//ДДС
	Массив.Добавить("упоДоходыИРасходыПланФактСКД");//БДР
	Массив.Добавить("упоАнализ_БДР_по_БДДССКД");
	Массив.Добавить("упоСкользящийБДДСПроекта");//ДДС
	Массив.Добавить("упоСкользящийБДРПроекта");//БДР
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Массив.Добавить("упоПланФактныйАнализПоПрограмме");
		Массив.Добавить("упоПланФактныйАнализПоПортфелю");
	КонецЕсли;
	Массив.Добавить("упоТематическийПлан");
	Массив.Добавить("упоSКривая");
	Массив.Добавить("упоДинамикаЭкономикиПроекта");
	Массив.Добавить("упоБалансПроекта");
	Массив.Добавить("упоВыполненныеИПринятыеОбъемы");//Объемы
	Массив.Добавить("упоПланФактныйАнализРаспределенияОбъемов");//Объемы
	Массив.Добавить("упоОсвоенныеОбъемыEVA");//Объемы
	Массив.Добавить("упоОсвоенныйОбъемТрудозатратСКД");//Трудозатраты?	
	Если ПравоДоступа("Использование", Метаданные.Отчеты["упоЗатратыТрудовыхРесурсовПланФактСКД"]) Тогда	
		Массив.Добавить("упоЗатратыТрудовыхРесурсовПланФактСКД");//Трудозатраты	
	Иначе	
		Массив.Добавить("упоЗатратыТрудовыхРесурсовПланФактСКДБезФинансов");//Трудозатраты
	КонецЕсли;	
	Массив.Добавить("упоТрудозатратыПоУровнямПланирования");//Трудозатраты
	Массив.Добавить("упоРесурсыПроектаПланФактСКД");//Трудозатраты
	Если ПравоДоступа("Использование", Метаданные.Отчеты["упоЗатратыМатериальныхРесурсовПланФактСКД"]) Тогда	
		Массив.Добавить("упоЗатратыМатериальныхРесурсовПланФактСКД");	
	Иначе	
		Массив.Добавить("упоЗатратыМатериальныхРесурсовПланФактСКДБезФинансов");
	КонецЕсли;
	Массив.Добавить("упоДополнительныеЗатратыПланФактСКД");
	Массив.Добавить("упоСостояниеПроектныхЗадачСКД");
	Массив.Добавить("упоСрокиПроектаПланФактСКД");
	Массив.Добавить("упоАнализПроектовПоПоказателямСКД");
	Массив.Добавить("упоСравнениеВерсий");
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПричиныОтклонений() Тогда
		Массив.Добавить("упоФакторныйАнализПричинОтклонений");
	КонецЕсли;
	
	// Если у пользователя нет прав на использование отчета, исключим отчет из массива.
	ИндексМассива = Массив.ВГраница();
	Пока ИндексМассива >= 0 Цикл
		ИмяОтчета = Массив[ИндексМассива];
		Если НЕ ПравоДоступа("Использование", Метаданные.Отчеты[ИмяОтчета]) Тогда
			Массив.Удалить(ИндексМассива);
		КонецЕсли;
		
		ИндексМассива = ИндексМассива - 1;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Получает массив имен основных отчетов для проекта.
//
// Возвращаемое значение:
//	Массив - значения - структуры(ключ - строка - имя категории,
//						значение - массив строк - имена отчетов).
//
Функция ПолучитьМассивИменОсновныхОтчетовДляПроектаПоКатегориям() Экспорт
	
	МассивКатегорий = Новый Массив;
	
	// Категория "Портфели, программы".
	МассивОтчеты = Новый Массив;
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда 
		ДобавитьОтчетСПроверкойПрав("упоПланФактныйАнализПоПортфелю", МассивОтчеты);
		ДобавитьОтчетСПроверкойПрав("упоПланФактныйАнализПоПрограмме", МассивОтчеты);
	КонецЕсли;
	ДобавитьОтчетСПроверкойПрав("упоТематическийПлан", МассивОтчеты);
 
	МассивКатегорий.Добавить(Новый Структура("Описание", 
		ОписаниеКатегории("ПортфелиПрограммы", "Портфели, программы", МассивОтчеты))
		);
	
	// Категория "БДР, БДДС".	
	МассивОтчеты = Новый Массив;
	ДобавитьОтчетСПроверкойПрав("упоДоходыИРасходыПланФактСКД", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоПланФактныйАнализБДР_Подразделения", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоДвиженияДенежныхСредствПланФактСКД", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоАнализ_БДР_по_БДДССКД", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоСкользящийБДРПроекта", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоСкользящийБДДСПроекта", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоСкользящийБДРОбъемыБДДС", МассивОтчеты);
	
	МассивКатегорий.Добавить(Новый Структура("Описание", 
		ОписаниеКатегории("БдрБддс", "БДР, БДДС", МассивОтчеты))
		);
	
	// Категория "S-кривая, Баланс".
	МассивОтчеты = Новый Массив;
	ДобавитьОтчетСПроверкойПрав("упоSКривая", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоБалансПроекта", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоДинамикаЭкономикиПроекта", МассивОтчеты);
	
	МассивКатегорий.Добавить(Новый Структура("Описание", 
		ОписаниеКатегории("SкриваяБаланс", "S-кривая, Баланс", МассивОтчеты))
		);
	
	// Категория "Объемы".
	МассивОтчеты = Новый Массив;
	ДобавитьОтчетСПроверкойПрав("упоВыполненныеИПринятыеОбъемы", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоПланФактныйАнализРаспределенияОбъемов", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоОсвоенныеОбъемыEVA", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоОсвоенныйОбъемТрудозатратСКД", МассивОтчеты);
	
	МассивКатегорий.Добавить(Новый Структура("Описание", 
		ОписаниеКатегории("Объемы", , МассивОтчеты))
		);
	
	// Категория "Затраты".
	МассивОтчеты = Новый Массив;
	ОтчетДобавлен = ДобавитьОтчетСПроверкойПрав("упоЗатратыТрудовыхРесурсовПланФактСКД", МассивОтчеты);
	Если Не ОтчетДобавлен Тогда
		ДобавитьОтчетСПроверкойПрав("упоЗатратыТрудовыхРесурсовПланФактСКДБезФинансов", МассивОтчеты);
	КонецЕсли;
	ДобавитьОтчетСПроверкойПрав("упоТрудозатратыПоУровнямПланирования", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоТрудозатратыПоУровнямПланирования", МассивОтчеты, "Загрузка по заказчикам", "ЗагрузкаПоЗаказчикам");
	ДобавитьОтчетСПроверкойПрав("упоРесурсыПроектаПланФактСКД", МассивОтчеты);
	ОтчетДобавлен = ДобавитьОтчетСПроверкойПрав("упоЗатратыМатериальныхРесурсовПланФактСКД", МассивОтчеты);
	Если Не ОтчетДобавлен Тогда
		ДобавитьОтчетСПроверкойПрав("упоЗатратыМатериальныхРесурсовПланФактСКДБезФинансов", МассивОтчеты);
	КонецЕсли;
	ДобавитьОтчетСПроверкойПрав("упоДополнительныеЗатратыПланФактСКД", МассивОтчеты);
	
	МассивКатегорий.Добавить(Новый Структура("Описание", 
		ОписаниеКатегории("Затраты", , МассивОтчеты))
		);
	
	// Категория "Прочие".
	МассивОтчеты = Новый Массив;
	ДобавитьОтчетСПроверкойПрав("упоСостояниеПроектныхЗадачСКД", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоСрокиПроектаПланФактСКД", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоАнализПроектовПоПоказателямСКД", МассивОтчеты);
	ДобавитьОтчетСПроверкойПрав("упоСравнениеВерсий", МассивОтчеты);
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПричиныОтклонений() Тогда
		ДобавитьОтчетСПроверкойПрав("упоФакторныйАнализПричинОтклонений", МассивОтчеты);
	КонецЕсли;
	
	МассивКатегорий.Добавить(Новый Структура("Описание", 
		ОписаниеКатегории("Прочие", , МассивОтчеты))
		);
	
	Возврат МассивКатегорий;
	
КонецФункции

// Добавляет вызов отчетов проекта на форму.
//
// Параметры:
//  ЭтаФорма					 - УправляемаяФорма	 - форма, на которую надо добавить вызов отчетов.
//  ГруппаФормы					 - ГруппаФормы		 - группа, в которую добавляются кнопки для вызова отчетов.
//  ПрефиксКоманды				 - Строка			 - префикс команды.
//  ИмяОбработчикаКоманды		 - Строка			 - имя процедуры-обработчика команды.
//  МассивОтчетовПоКатегориям	 - Массив			 - массив строк с именами отчетов проекта.
//  МассивИсключений			 - Массив			 - массив строк с именами отчетов проекта, которые добавлять не нужно.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция ДобавитьВызовОтчетовПроектаНаФорму(ЭтаФорма,
										   ГруппаФормы, 
										   ПрефиксКоманды = "КомандаДляПроекта", 
										   ИмяОбработчикаКоманды = "ОткрытьОтчет",
										   МассивОтчетовПоКатегориям = Неопределено,
										   МассивИсключений = Неопределено) Экспорт 
	
	Если МассивОтчетовПоКатегориям = Неопределено Тогда
		МассивОтчетовПоКатегориям = ПолучитьМассивИменОсновныхОтчетовДляПроектаПоКатегориям();	
	КонецЕсли;	
	
	Для Каждого Категория Из МассивОтчетовПоКатегориям Цикл
		
		ЭлементКатегория = ЭтаФорма.Элементы.Добавить(ПрефиксКоманды + Категория.Описание.Имя, Тип("ГруппаФормы"), ГруппаФормы);
		ЭлементКатегория.Вид = ВидГруппыФормы.Подменю;
		ЭлементКатегория.Заголовок = Категория.Описание.Синоним;
		ЭлементКатегория.Картинка = БиблиотекаКартинок.Отчеты;
		
		Для Каждого ОписаниеОтчета Из Категория.Описание.Отчеты Цикл
			
			Если МассивИсключений <> Неопределено 
				И МассивИсключений.Найти(ОписаниеОтчета.Имя) <> Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			Если ОписаниеОтчета.Вариант <> Неопределено Тогда
								
			КонецЕсли;
			
			ПрефиксВариант = ?(ОписаниеОтчета.Вариант = Неопределено, "", "Вариант__" + ОписаниеОтчета.Вариант + "__");
			
			Команда = ЭтаФорма.Команды.Добавить(ПрефиксКоманды + ПрефиксВариант + ОписаниеОтчета.Имя);
			Команда.Действие = ИмяОбработчикаКоманды;
			Команда.Картинка = БиблиотекаКартинок.Отчет;
			Команда.Заголовок = ОписаниеОтчета.Синоним;
			Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
			
			ЭлементОтчет = ЭтаФорма.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), ЭлементКатегория);
			ЭлементОтчет.ИмяКоманды = Команда.Имя; 
			ЭлементОтчет.Вид = ВидКнопкиФормы.Гиперссылка;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

// Получает массив единиц нормирования длительности.
//
// Возвращаемое значение:
//	Массив - массив элеметов типа СправочникСсылка.упоЕдиницыВремени.
//
Функция ПолучитьМассивЕдиницНормированияДлительности() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоЕдиницыВремени.Ссылка
	               |ИЗ
	               |	Справочник.упоЕдиницыВремени КАК упоЕдиницыВремени
	               |ГДЕ
	               |	НЕ упоЕдиницыВремени.ПометкаУдаления";
 
    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// См. упоУправлениеДоговорамиСервер.ВалютаДоговораКонтрагента
//
Функция ВалютаПоДоговору(Договор) Экспорт
	
	Возврат упоУправлениеДоговорамиСервер.ВалютаДоговораКонтрагента(Договор);
	
КонецФункции

// Дополняет параметры выбора элемента параметры исключением по проекту.
//
// Параметры:
//  Элемент				 - ЭлементФормы - элемент, для которого дополняются параметры выбора.
//  Проект				 - СправочникСсылка.Проекты - проект - исключение.
//
Процедура ДобавитьПараметрыИсключитьПроект(Элемент, Проект) Экспорт
	
	Если Не ЗначениеЗаполнено(Проект) Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыВыбора = Новый Массив(Элемент.ПараметрыВыбора);	
	упоРаботаСФормамиКлиентСервер.УдалитьПараметрВыбораПоИмени("ИсключитьПроект, Проект", ПараметрыВыбора);
	
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ИсключитьПроект",	Истина));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Проект",				Проект));
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры	

// Ищет элемент условного оформления формы по его представлению.
//
// Параметры:
//  УсловноеОформление		 - УсловноеОформлениеКомпоновкиДанных - условное оформление формы.
//  Представление			 - Строка 	- представление элемента.
//
// Возвращаемое значение:
//	ЭлементУО, Неопределено - найденный элемент условного оформления.
//
Функция НайтиЭлементУсловногоОформленияПоПредставлению(УсловноеОформление, Представление) Экспорт
	
	ЭлементУО = Неопределено;
	
	сч = УсловноеОформление.Элементы.Количество() - 1;
	Пока сч >= 0 Цикл
		Элемент = УсловноеОформление.Элементы[сч];
		Если Элемент.Представление <> "" И СтрНайти(Элемент.Представление, Представление) <> 0 Тогда
			ЭлементУО = Элемент;
			Прервать;
		КонецЕсли;
		сч = сч - 1;
	КонецЦикла;
	
	Возврат ЭлементУО;
	
КонецФункции

// Заполняет актуальные наименования проектных задач в данных, где проектная задача представлена документом.
//
// Параметры:
//  МассивТабЧастей	 - Массив - табличные части для заполнения.
//
Процедура ЗаполнитьНаименованияПЗВТабличныхЧастях(МассивТабЧастей) Экспорт
	
	МассивПЗ = Новый Массив;
	Для Каждого ТабЧасть Из МассивТабЧастей Цикл
		ПЗ = ТабЧасть.Выгрузить(, "ПроектнаяЗадача");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПЗ, ПЗ, Истина);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(МассивПЗ) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК Название
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО упоВерсииПроекта.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |			И (упоВерсииПроекта.Текущая)";
	Запрос.УстановитьПараметр("МассивПЗ", МассивПЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого ТабЧасть Из МассивТабЧастей Цикл
		Для Каждого ТекСтрока Из ТабЧасть Цикл
			Выборка.НайтиСледующий(ТекСтрока.ПроектнаяЗадача, "ПроектнаяЗадача");
			ТекСтрока.НазваниеПроектнойЗадачи = Выборка.Название;
			
			Выборка.Сбросить();
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры 

#Область ПроектнаяЗадачаДокументСтруктура

// Создает структуру параметров для создания таблиц заказов поставщикам, заказов покупателей и заказов на производство.
// см.СоздатьТаблицыДокументовЗаказ().
//
// Параметры:
//  ВключитьПоУмолчанию	 - Будево - флаг создания всех таблиц по умолчанию.
// 
// Возвращаемое значение:
//  Структура - параметры создания.
//
Функция ПараметрыСозданияТаблицыЗаказовПоУмолчанию(ВключитьПоУмолчанию = Истина) Экспорт 
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаказПокупателя", ВключитьПоУмолчанию);
	Результат.Вставить("ЗаказПоставщику", ВключитьПоУмолчанию);
	
	ВключитьЗаказыНаПроизводство = ВключитьПоУмолчанию 
		И упоИнтеграцияКлиентСервер.ДоступенФункционалЗаказыНаПроизводствоERP();
	Результат.Вставить("ЗаказНаПроизводство", ВключитьЗаказыНаПроизводство);
	
	Результат.Вставить("ОбновлятьЗаголовки", Не ВключитьПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

// Создает табицы заказов поставщиком, заказов покупателей и заказов на производство 
// на форме задачи документа и задачи структуры.
//
// Параметры:
//  ЭтаФорма	 - УправляемаяФорма - форма размещения таблиц.
//  ПроектПЗ	 - СправочникСсылка.Проекты - проектная задача для отобора заказов в динамических списках.
//  Параметры	 - Структура - см.ПараметрыСозданияТаблицыЗаказовПоУмолчанию().
//
Процедура СоздатьТаблицыДокументовЗаказ(ЭтаФорма, ПроектПЗ, Знач Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыСозданияТаблицыЗаказовПоУмолчанию();
	КонецЕсли;
	
	Элементы = ЭтаФорма.Элементы;
	
	ДоступКФинИнформации = ЭтаФорма.ДоступКФинИнформации;
	
	ТаблицаЗаказыПоставщикам 		= ЭтаФорма.ТаблицаЗаказыПоставщикам;
	ТаблицаЗаказыПокупателей 		= ЭтаФорма.ТаблицаЗаказыПокупателей;
	ТаблицаЗаказыНаПроизводство 	= ЭтаФорма.ТаблицаЗаказыНаПроизводство;
	ТаблицаЗаказыНаПроизводство2_2 	= ЭтаФорма.ТаблицаЗаказыНаПроизводство2_2;
	
	ТипПолеФормы = Тип("ПолеФормы");
	
	Если Параметры.ЗаказПоставщику
		И ПравоДоступа("Просмотр", Метаданные.Документы.ЗаказПоставщику)
		И упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыПоставщикам() Тогда 
		
		ТаблицаЗаказыПоставщикам.ОсновнаяТаблица = "Документ.ЗаказПоставщику";
		ТаблицаЗаказыПоставщикам.ДинамическоеСчитываниеДанных = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаЗаказыПоставщикам, 
			"упоПроектнаяЗадача",
			ПроектПЗ, 
			ВидСравненияКомпоновкиДанных.Равно, 
			, 
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПоставщикамНомер", ТипПолеФормы, Элементы.ТаблицаЗаказыПоставщикам);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПоставщикам.Номер";
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПоставщикамДата", ТипПолеФормы, Элементы.ТаблицаЗаказыПоставщикам);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПоставщикам.Дата";
		НоваяКолонка.Формат = "ДФ=dd.MM.yyyy";
		
		Если Не ДоступКФинИнформации = "Отсутствует" Тогда
			НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПоставщикамСуммаДокумента", ТипПолеФормы, Элементы.ТаблицаЗаказыПоставщикам);
			НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПоставщикам.СуммаДокумента";
		КонецЕсли;
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПоставщикамПартнер", ТипПолеФормы, Элементы.ТаблицаЗаказыПоставщикам);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПоставщикам.Партнер";
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПоставщикамДатаПоступления", ТипПолеФормы, Элементы.ТаблицаЗаказыПоставщикам);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПоставщикам.ДатаПоступления";
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПоставщикамВалюта", ТипПолеФормы, Элементы.ТаблицаЗаказыПоставщикам);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПоставщикам.Валюта";
		
		Если ПравоДоступа("Изменение", Метаданные.Документы.ЗаказПоставщику) Тогда
			
			КомандаСформироватьЗаказыПоставщику = ЭтаФорма.Команды.Добавить("Подключаемый_ЗаказыПоставщику_Сформировать");
			КомандаСформироватьЗаказыПоставщику.Действие = "Подключаемый_ЗаказыПоставщику_Сформировать";
			
			КнопкаСформироватьЗаказыПоставщику = Элементы.Добавить("ТаблицаЗаказыПоставщикам_Сформировать", 
			Тип("КнопкаФормы"), Элементы.ТаблицаЗаказыПоставщикам.КоманднаяПанель);
			КнопкаСформироватьЗаказыПоставщику.ИмяКоманды = "Подключаемый_ЗаказыПоставщику_Сформировать";
			КнопкаСформироватьЗаказыПоставщику.Заголовок = НСтр("ru = 'Сформировать'");
			
		Иначе 
			Элементы.ТаблицаЗаказыПоставщикам.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если Параметры.ОбновлятьЗаголовки Тогда
			ЭлементСтраница = Элементы.СтраницаЗаказыПоставщикам;
			ЗаголовокСтраницы = упоИнтеграцияКлиентСервер.ЗаголовокСтраницыЗаказыПоставщикам();
			Если ЗначениеЗаполнено(ПроектПЗ) Тогда  
				ЭлементСтраница.Заголовок = ЗаголовокСтраницыДинамическогоСпискаСКоличеством(ТаблицаЗаказыПоставщикам, 
					ЗаголовокСтраницы);
			Иначе 
				ЭлементСтраница.Заголовок = ЗаголовокСтраницы;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Создаем колонки таблицы заказов клиентов.
	
	Если Параметры.ЗаказПокупателя 
		И ПравоДоступа("Просмотр", Метаданные.Документы.ЗаказКлиента)
		И упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыПокупателей() Тогда
		
		ТаблицаЗаказыПокупателей.ОсновнаяТаблица = "Документ.ЗаказКлиента";
		ТаблицаЗаказыПокупателей.ДинамическоеСчитываниеДанных = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаЗаказыПокупателей, "упоПроектнаяЗадача",
			ПроектПЗ, ВидСравненияКомпоновкиДанных.Равно, , Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПокупателейНомер", ТипПолеФормы, Элементы.ТаблицаЗаказыПокупателей);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПокупателей.Номер";
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПокупателейДата", ТипПолеФормы, Элементы.ТаблицаЗаказыПокупателей);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПокупателей.Дата";
		НоваяКолонка.Формат = "ДФ=dd.MM.yyyy";
		
		Если Не ДоступКФинИнформации = "Отсутствует" Тогда
			НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПокупателейСуммаДокумента", ТипПолеФормы, Элементы.ТаблицаЗаказыПокупателей);
			НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПокупателей.СуммаДокумента";
		КонецЕсли;
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПокупателейПартнер", ТипПолеФормы, Элементы.ТаблицаЗаказыПокупателей);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПокупателей.Партнер";
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПокупателейДатаОтгрузки", ТипПолеФормы, Элементы.ТаблицаЗаказыПокупателей);
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПокупателей.ДатаОтгрузки";
		
		НоваяКолонка = Элементы.Добавить("ТаблицаЗаказыПокупателейВалюта", ТипПолеФормы, Элементы.ТаблицаЗаказыПокупателей);
		НоваяКолонка.Заголовок = "Валюта";
		НоваяКолонка.ПутьКДанным = "ТаблицаЗаказыПокупателей.Валюта";
		
		Если ПравоДоступа("Изменение", Метаданные.Документы.ЗаказКлиента) Тогда
			
			КомандаСформироватьЗаказыКлиента = ЭтаФорма.Команды.Добавить("Подключаемый_ЗаказыПокупателей_Сформировать");
			КомандаСформироватьЗаказыКлиента.Действие = "Подключаемый_ЗаказыПокупателей_Сформировать";
			
			КнопкаСформироватьЗаказыКлиента = Элементы.Добавить("ТаблицаПодключаемый_ЗаказыПокупателей_Сформировать", 
				Тип("КнопкаФормы"), Элементы.ТаблицаЗаказыПокупателей.КоманднаяПанель);
			КнопкаСформироватьЗаказыКлиента.ИмяКоманды = "Подключаемый_ЗаказыПокупателей_Сформировать";
			КнопкаСформироватьЗаказыКлиента.Заголовок = НСтр("ru = 'Сформировать'");
			
		Иначе 
			Элементы.ТаблицаЗаказыПокупателей.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если Параметры.ОбновлятьЗаголовки Тогда
			ЭлементСтраница = Элементы.СтраницаЗаказыПокупателей;
			ЗаголовокСтраницы = упоИнтеграцияКлиентСервер.ЗаголовокСтраницыЗаказыПокупателей();
			Если ЗначениеЗаполнено(ПроектПЗ) Тогда  
				ЭлементСтраница.Заголовок = ЗаголовокСтраницыДинамическогоСпискаСКоличеством(ТаблицаЗаказыПокупателей, 
					ЗаголовокСтраницы);
			Иначе 
				ЭлементСтраница.Заголовок = ЗаголовокСтраницы;
			КонецЕсли;				
		КонецЕсли;
		
	КонецЕсли;
	
	// Создаем колонки таблицы заказов на производство.
	
	Если Параметры.ЗаказНаПроизводство Тогда
		Если упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством") Тогда 
			ИмяДокумента 	= "ЗаказНаПроизводство";
			ИмяЭлемента 	= "ТаблицаЗаказыНаПроизводство";
			ТаблицаЗаказыНаПроизводствоПереопределяемая = ТаблицаЗаказыНаПроизводство;
			
			ПараметрыСозданияТЧ = Новый Структура("ИмяДокумента, ИмяЭлемента, ТаблицаЗаказыНаПроизводствоПереопределяемая,
			| ПроектПЗ, ВерсияПроизводства", 
			ИмяДокумента, ИмяЭлемента, ТаблицаЗаказыНаПроизводствоПереопределяемая, ПроектПЗ, "2_1");
			
			СоздатьСтраницуТаблицыЗаказовНаПроизводство(Элементы, 
				ЭтаФорма.Команды, 
				ПараметрыСозданияТЧ, 
				Параметры.ОбновлятьЗаголовки);
				
		КонецЕсли;
		
		Если упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2") Тогда
			ИмяДокумента = "ЗаказНаПроизводство2_2";
			ИмяЭлемента  = "ТаблицаЗаказыНаПроизводство2_2";
			
			ТаблицаЗаказыНаПроизводствоПереопределяемая = ТаблицаЗаказыНаПроизводство2_2;
			
			ПараметрыСозданияТЧ = Новый Структура("ИмяДокумента, ИмяЭлемента, ТаблицаЗаказыНаПроизводствоПереопределяемая,
			| ПроектПЗ, ВерсияПроизводства", 
			ИмяДокумента, ИмяЭлемента, ТаблицаЗаказыНаПроизводствоПереопределяемая, ПроектПЗ, "2_2");
			
			СоздатьСтраницуТаблицыЗаказовНаПроизводство(Элементы, 
				ЭтаФорма.Команды, 
				ПараметрыСозданияТЧ, 
				Параметры.ОбновлятьЗаголовки);

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает заголовок страницы с добавленным количеством элементов динамического списка.
//
// Параметры:
//  ДинамическийСписок	 - ДинамическийСписок	 - список страницы.
//  ЗаголовокСтраницы	 - Строка				 - исходный заголовок формы.
// 
// Возвращаемое значение:
//  Строка
//
Функция ЗаголовокСтраницыДинамическогоСпискаСКоличеством(ДинамическийСписок, ЗаголовокСтраницы) Экспорт
	
	ТаблицаСписка = упоФункцииОбщегоНазначенияСервер.ПолучитьДанныеДинамическогоСписка(ДинамическийСписок);
	КоличествоСтрок = ТаблицаСписка.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		Заголовок = ЗаголовокСтраницы;
	Иначе
		Заголовок = СтрШаблон("%1 (%2)", ЗаголовокСтраницы, КоличествоСтрок);
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

#КонецОбласти

// Проверяет наличие динамического обновления и блокирует форму объекта для редактирования.
//
// Параметры:
//  Форма	 - УправляемаяФорма - проверяемая форма.
//
Процедура ПроверитьВерсияПрограммыОбновленаДинамическиЗаблокироватьОбъект(Форма) Экспорт
	
	Если СтандартныеПодсистемыСервер.ВерсияПрограммыОбновленаДинамически() Тогда
		Форма.ТолькоПросмотр = Истина;
		ТекстОшибки = НСтр("ru = 'Версия программы обновлена, для редактирования объекта требуется перезапустить сеанс.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Получает таблицу данных объекта в массиве для обработки на клиенте.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - объект, содержащий данные.
//
// Возвращаемое значение:
//   - Массив из Структура
//
Функция ТаблицаОбъектаВМассивеДляОбработкиНаКлиенте(Знач Объект, ИмяТаблицы) Экспорт
	
	ТаблицаДанныхМассив = Новый Массив;
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Возврат ТаблицаДанныхМассив;
	КонецЕсли;
	
	ТаблицаДанных = Объект[ИмяТаблицы].Выгрузить();
	ТаблицаДанныхМассив = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных);
	
	Возврат ТаблицаДанныхМассив;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, принадлежит ли договор контрагенту.
//
// Параметры:
//  Договор		 - СправочникСсылка.ДоговорыКонтрагентов	- договор.
//  Контрагент	 - СправочникСсылка.Контрагенты 			- контрагент.
//
// Возвращаемое значение:
//	Булево - результат проверки.
// 
Функция служ_ПроверитьДоговор(Договор, Контрагент) Экспорт
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() 
		ИЛИ упоИнтеграцияКлиентСерверПовтИсп.ЭтоDev2()
		Или упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если Договор.Контрагент = Контрагент Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Договор = Контрагент.упоОсновнойДоговорКонтрагента;
	
	Возврат Истина;
	
КонецФункции

// Пересчитывает стоимость материальных ресурсов или субпродуктов по норме стоимости.
//
Процедура ТаблицаРесурсов_ПересчитатьПоНормеСервер(Объект, ИмяТаблицыРесурсов,
	ИмяРеквизитаНорма = "НормаСтоимости", 
	ПересчитатьПодчиненную = Ложь,
	ИмяТаблицыРаспределения = "") Экспорт
	
	Если Объект[ИмяРеквизитаНорма].Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРесурсов = Объект[ИмяТаблицыРесурсов].Выгрузить();
	упоРесурсыИНормыВызовСервера.обРассчитатьСтоимостьРесурсовПоНорме(ТаблицаРесурсов, Объект, Объект[ИмяРеквизитаНорма]);
	
	Объект[ИмяТаблицыРесурсов].Загрузить(ТаблицаРесурсов);
	
	Если ПересчитатьПодчиненную Тогда
		
		ЕстьКолонкаПП = ТаблицаРесурсов.Колонки.Найти("ЭтоПП") <> Неопределено;
		
		Для Каждого СтрокаТаблицы Из ТаблицаРесурсов Цикл
			Если ЕстьКолонкаПП И СтрокаТаблицы.ЭтоПП Тогда
				Отбор = Новый Структура("ИндексСтрокиВладельца", СтрокаТаблицы.ИндексСтрокРаспределения);
				СтрокиРаспределения = Объект[ИмяТаблицыРаспределения].НайтиСтроки(Отбор);
				Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
					СтрокаРаспределения.Сумма = СтрокаТаблицы.ОбщСтоимость * (СтрокаРаспределения.ПроцентРаспределения / 100);
				КонецЦикла;
			Иначе
				упоРаботаСФормамиКлиентСервер.РаспределитьСуммуСтрокиВладельцаПоТаблицеРаспределения(
					СтрокаТаблицы, Объект[ИмяТаблицыРаспределения], "ОбщСтоимость", "Сумма", "Количество");
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеОтчета(Имя, Синоним = Неопределено, Вариант = Неопределено)
	
	Возврат Новый Структура("Имя, Синоним, Вариант", Имя, Синоним, Вариант);
	
КонецФункции

Функция ОписаниеКатегории(Имя, Синоним = Неопределено, МассивОтчетов)
	
	Если Синоним = Неопределено Тогда
		Синоним = Имя;		
	КонецЕсли; 
	
	Возврат Новый Структура("Имя, Синоним, Отчеты", Имя, Синоним, МассивОтчетов);
	
КонецФункции
 
Функция ДобавитьОтчетСПроверкойПрав(ИмяОтчета, МассивОтчетов, Синоним = Неопределено, Вариант = Неопределено)
	
	ОтчетДобавлен = Ложь; 
	
	ОтчетМетаданные = Метаданные.Отчеты[ИмяОтчета];
	
	Если ПравоДоступа("Использование", ОтчетМетаданные) Тогда
		ОписаниеОтчета = ОписаниеОтчета(ИмяОтчета, ?(Синоним = Неопределено, ОтчетМетаданные.Синоним, Синоним), Вариант);
		МассивОтчетов.Добавить(ОписаниеОтчета);
		
		ОтчетДобавлен = Истина; 
	КонецЕсли;	
	
	Возврат ОтчетДобавлен;
	
КонецФункции

#Область ПроектнаяПродукция

// Заполняет реквизиты для отображения Типа субпродукта при открытии формы.
//
// Параметры:
//  ТипСубпродукта	 - ПеречислениеСсылка.упоТипСубпродукта - тип субпродукта перечислением.
//  ТипПродуктаЧисло - Число - тип субпродукта числом.
//
Процедура ЗаполнитьРеквизитыТипПродукта(ТипСубпродукта, ТипПродуктаЧисло) Экспорт
	
	Если Не ЗначениеЗаполнено(ТипСубпродукта) Тогда
		ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.Номенклатура");
		ТипПродуктаЧисло = 0;
	Иначе
		ТипПродуктаЧисло = 
			упоИнтеграцияКлиентСервер.НомерТипаСубпродуктаПоПеречислению(ТипСубпродукта);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроектнаяЗадачаДокументСтруктура

Процедура СоздатьСтраницуТаблицыЗаказовНаПроизводство(Элементы, Команды, ПараметрыСозданияТЧ, ОбновлятьЗаголовки)
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалЗаказыНаПроизводствоERP() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяДокумента = ПараметрыСозданияТЧ.ИмяДокумента;
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Документы[ИмяДокумента]) Тогда
		Возврат;
	КонецЕсли;
	 
	ИмяЭлемента = ПараметрыСозданияТЧ.ИмяЭлемента; 
	ТаблицаЗаказыНаПроизводствоПереопределяемая = ПараметрыСозданияТЧ.ТаблицаЗаказыНаПроизводствоПереопределяемая;
	ПроектПЗ = ПараметрыСозданияТЧ.ПроектПЗ;
	ВерсияПроизводства = ПараметрыСозданияТЧ.ВерсияПроизводства; 
	
	ТаблицаЗаказыНаПроизводствоПереопределяемая.ОсновнаяТаблица = "Документ." + ИмяДокумента;
	ТаблицаЗаказыНаПроизводствоПереопределяемая.ДинамическоеСчитываниеДанных = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТаблицаЗаказыНаПроизводствоПереопределяемая, 
		"упоПроектнаяЗадача",
		ПроектПЗ, 
		ВидСравненияКомпоновкиДанных.Равно, 
		, 
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "Дата", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".Дата";
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "Подразделение", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.Заголовок = НСтр("ru = 'Подразделение-диспетчер'");
	НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".Подразделение";
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "Статус", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.Заголовок = НСтр("ru = 'Статус'");
	НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".Статус";
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "Приоритет", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".Приоритет";
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "НачатьНеРанее", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.Заголовок = нСтр("ru='Начать выпуск не ранее'", "ru");
	Если ИмяДокумента = "ЗаказНаПроизводство2_2" Тогда
		НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".Ссылка.НачатьНеРанее";
	КонецЕсли;
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "ЖелаемаяДатаВыпуска", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.Заголовок = нСтр("ru='Желаемая дата выпуска'", "ru");
	Если ИмяДокумента = "ЗаказНаПроизводство2_2" Тогда
		НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".Ссылка.ДатаПотребности";
	КонецЕсли;
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "ЗаказПодДеятельность", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.Заголовок = НСтр("ru = 'Заказ под деятельность'");
	НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".ЗаказПодДеятельность";
	
	НоваяКолонка = Элементы.Добавить(ИмяЭлемента + "Номер", Тип("ПолеФормы"), Элементы[ИмяЭлемента]);
	НоваяКолонка.ПутьКДанным = ИмяЭлемента + ".Номер";
	
	Если ПравоДоступа("Изменение", Метаданные.Документы[ИмяДокумента]) Тогда
		
		КомандаСформироватьЗаказыНаПроизводство = Команды.Добавить(
			"Подключаемый_ЗаказыНаПроизводство_Сформировать" + ВерсияПроизводства);
		КомандаСформироватьЗаказыНаПроизводство.Действие = "Подключаемый_ЗаказыНаПроизводство_Сформировать";
		
		КнопкаСформироватьЗаказыНаПроизводство = Элементы.Добавить(
			"ТаблицаПодключаемый_ЗаказыНаПроизводство_Сформировать" + ВерсияПроизводства, 
			Тип("КнопкаФормы"), 
			Элементы[ИмяЭлемента].КоманднаяПанель);
		КнопкаСформироватьЗаказыНаПроизводство.ИмяКоманды = "Подключаемый_ЗаказыНаПроизводство_Сформировать" + ВерсияПроизводства;
		КнопкаСформироватьЗаказыНаПроизводство.Заголовок = НСтр("ru = 'Сформировать'");
		
	Иначе
		Элементы[ИмяЭлемента].ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ОбновлятьЗаголовки Тогда
		ЭлементСтраница = Элементы["СтраницаЗаказыНаПроизводство" + ВерсияПроизводства];
		Если ВерсияПроизводства = "2_1" Тогда
			ЗаголовокСтраницы = упоИнтеграцияКлиентСервер.ЗаголовокСтраницыЗаказыНаПроизводство();
		Иначе
			ЗаголовокСтраницы = упоИнтеграцияКлиентСервер.ЗаголовокСтраницыЗаказыНаПроизводство2_2();
		КонецЕсли;
		Если ЗначениеЗаполнено(ПроектПЗ) Тогда  
			ЭлементСтраница.Заголовок = ЗаголовокСтраницыДинамическогоСпискаСКоличеством(ТаблицаЗаказыНаПроизводствоПереопределяемая, 
				ЗаголовокСтраницы);
		Иначе
			ЭлементСтраница.Заголовок = ЗаголовокСтраницы;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область РаботаСФормойПроектнойЗадачи

// Процедура - Установить ограничения использования функционала
//
// Параметры:
//  Элементы - ЭлементыФормы - элементы формы, на которую устанавливаются ограничения: 
//  упоПроектнаяЗадача.ФормаДокументаУправляемая или упоУпрощенныйВводСтруктурыПроекта.ФормаЗадачи
//
Процедура УстановитьОграниченияИспользованияФункционала(Элементы, ДанныеОбъекта = Неопределено) Экспорт 
	
	// Функционал Проектная продукция.
	ДоступенФункционалПП = упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция();
	ЕстьППВОбъекте = Ложь;
	Если ДоступенФункционалПП И ДанныеОбъекта <> Неопределено Тогда
		ЕстьППВОбъекте = ДанныеОбъекта.ТипСубпродукта = Перечисления.упоТипСубпродукта.ПроектнаяПродукция;
	КонецЕсли;
	
	ВидимостьЭлементовПП = ВидимостьЭлементовПроектнаяПродукция(ЕстьППВОбъекте);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ГруппаПроектнаяПродукция", 
		"Видимость", 
		ВидимостьЭлементовПП);
	
КонецПроцедуры

Функция ВидимостьЭлементовПроектнаяПродукция(ЕстьППВОбъекте) Экспорт 
	
	ДоступенФункционалПП = упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция();
	Если Не ДоступенФункционалПП Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИспользуетсяФункционалПП = ПолучитьФункциональнуюОпцию("упоИспользоватьПроектнуюПродукцию");
	Если ИспользуетсяФункционалПП Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ЕстьППВОбъекте;
	
КонецФункции

#КонецОбласти

#Область РаботаСФормойДобавлениеКолонокПериодов

// Получить таблицу периодов
//
// Параметры:
//  ТаблицаПериодов					 - ДанныеФормыКоллекция - таблица периодов
//  ТаблицаРаспределенияСПериодами	 - ТаблицаЗначений - таблица распределения
//  ПерезаполнитьТаблицуПериодов	 - Булево - признак перезаполнения таблицы периодов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с итогами по периодам
//
Функция ПолучитьТаблицуПериодов(ТаблицаПериодов, ТаблицаРаспределенияСПериодами, ПерезаполнитьТаблицуПериодов) Экспорт
	
	ТабПериодов = Новый ТаблицаЗначений;
	ТабИтоговРасходы = Новый ТаблицаЗначений;
	КолонкиСумм = "";
	
	Если ПерезаполнитьТаблицуПериодов Тогда
		
		ТабПериодов = ТаблицаРаспределенияСПериодами.Скопировать(,"Период");	 
		ТабПериодов.Свернуть("Период");
		ТабПериодов.Сортировать("Период");
		ТабПериодов.Колонки.Добавить("НомерКолонки");
		Сч = 0;
		ТаблицаПериодов.Очистить();
		
		Для Каждого ТекСтрока Из ТабПериодов Цикл
			
			Сч = Сч + 1;
			ТекСтрока.НомерКолонки = Сч;
			ЗаполнитьЗначенияСвойств(ТаблицаПериодов.Добавить(), ТекСтрока);
			ТабИтоговРасходы.Колонки.Добавить("Период" + Сч);
			КолонкиСумм = КолонкиСумм + ?(КолонкиСумм = "", "", ",") + "Период" + Сч;
			
		КонецЦикла;
		
	Иначе
		
		Сч = 0;
		ТабПериодов = ТаблицаПериодов.Выгрузить();
		
		Для Каждого ТекСтрока Из ТабПериодов Цикл
			
			Сч = Сч + 1;
			ТабИтоговРасходы.Колонки.Добавить("Период" + Сч);
			КолонкиСумм = КолонкиСумм + ?(КолонкиСумм = "", "", ",") + "Период" + Сч;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтрокаСумм = ТабИтоговРасходы.Добавить();
	Для Каждого ТекСтрока Из ТаблицаРаспределенияСПериодами Цикл
		
		Стр = ТабПериодов.Найти(ТекСтрока.Период, "Период");
		Если Не Стр = Неопределено Тогда
			
			Если СтрокаСумм["Период" + Стр.НомерКолонки] = Неопределено Тогда
				СтрокаСумм["Период" + Стр.НомерКолонки] = ТекСтрока.Сумма;
			Иначе
				СтрокаСумм["Период" + Стр.НомерКолонки] = ТекСтрока.Сумма + СтрокаСумм["Период" + Стр.НомерКолонки];	
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ТабИтоговРасходы.Свернуть(, КолонкиСумм);
	
	Возврат ТабИтоговРасходы;
	
КонецФункции	

// Распределение по периодам
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - Форма
//  ТаблицаПериодов	 - ДанныеФормыКоллекция - таблица периодов 
//  ИмяТЧ			 - Строка - имя табличной части для заполнения 
//  ТаблицаИтогов	 - ТаблицаЗначений - таблица итогов по периодам 
//  ДопКолонки		 - Соответствие - имя и представление дополнительных колонок,
//						которые будут выводиться вместе с периодом (например, коэффициенты)
//
Процедура РаспределениеПоПериодам(Форма, ТаблицаПериодов, ИмяТЧ, ТаблицаИтогов, ДопКолонки = Неопределено) Экспорт
	
	УдаляемыеРеквизиты = Новый Массив;
	УдаляемыеЭлементы = Новый Массив;
	Элементы = Форма.Элементы;
	
	Для Каждого ТекЭлемент Из Элементы[ИмяТЧ].ПодчиненныеЭлементы Цикл
		Если Не ТипЗнч(ТекЭлемент) = Тип("ПолеФормы") Тогда
			Продолжить;	
		КонецЕсли;
		 		
		Если СтрНайти(ТекЭлемент.Имя, ИмяТЧ + "Период") > 0 Тогда
			УдаляемыеЭлементы.Добавить(ТекЭлемент);
			УдаляемыеРеквизиты.Добавить(ТекЭлемент.ПутьКДанным);						
		КонецЕсли;
		
		Если ДопКолонки = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Для Каждого Элемент Из ДопКолонки Цикл
			
			Если СтрНайти(ТекЭлемент.Имя, ИмяТЧ + Элемент.Ключ) > 0 Тогда
				УдаляемыеЭлементы.Добавить(ТекЭлемент);
				УдаляемыеРеквизиты.Добавить(ТекЭлемент.ПутьКДанным);						
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
		
	Для Каждого ТекЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(ТекЭлемент);	
	КонецЦикла; 
	
	Если УдаляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(, УдаляемыеРеквизиты);	
	КонецЕсли; 
	 	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для Каждого ТекСтрока Из ТаблицаПериодов Цикл
		
		ПредставлениеПериода = Формат(ТекСтрока.Период, "ДФ='MMMM yyyy'");
		ОписаниеТипЧисло_15_2 = ОбщегоНазначения.ОписаниеТипаЧисло(15,2);
		Реквизит = Новый РеквизитФормы("Период" + ТекСтрока.НомерКолонки, 
			ОписаниеТипЧисло_15_2, 
			"Объект." + ИмяТЧ, 
			ПредставлениеПериода);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
		Если ДопКолонки = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Для Каждого Элемент Из ДопКолонки Цикл
			
			ОписаниеТипЧисло_15_4 = ОбщегоНазначения.ОписаниеТипаЧисло(15,4);
			Реквизит = Новый РеквизитФормы(Элемент.Ключ + ТекСтрока.НомерКолонки, 
				ОписаниеТипЧисло_15_4, 
				"Объект." + ИмяТЧ, 
				Элемент.Значение);
			ДобавляемыеРеквизиты.Добавить(Реквизит);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);	
	КонецЕсли;	
	
	Для Каждого ТекСтрока Из ТаблицаПериодов Цикл
		
		НоваяКолонка = Элементы.Добавить(ИмяТЧ + "Период" + ТекСтрока.НомерКолонки, Тип("ПолеФормы"), Элементы[ИмяТЧ]); 
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;				
		НоваяКолонка.ПутьКДанным = "Объект." + ИмяТЧ + ".Период" + ТекСтрока.НомерКолонки;			
		НоваяКолонка.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяКолонка.ТекстПодвала = Формат(ТаблицаИтогов.Итог("Период" + ТекСтрока.НомерКолонки), "ЧДЦ=2");		
		НоваяКолонка.ТолькоПросмотр = Истина;
		
		НоваяКолонка.Ширина = 7;
		НоваяКолонка.РастягиватьПоГоризонтали = Истина;
		НоваяКолонка.АвтоМаксимальнаяШирина = Ложь;
		НоваяКолонка.МаксимальнаяШирина = 12;
		
		Если ДопКолонки = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
				
		Для Каждого Элемент Из ДопКолонки Цикл
			
			НоваяКолонка = Элементы.Добавить(ИмяТЧ + Элемент.Ключ + ТекСтрока.НомерКолонки, Тип("ПолеФормы"), Элементы[ИмяТЧ]); 
			НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;				
			НоваяКолонка.ПутьКДанным = "Объект." + ИмяТЧ + "." + Элемент.Ключ + ТекСтрока.НомерКолонки;
			НоваяКолонка.ТолькоПросмотр = Истина;
			
		КонецЦикла;
		
	КонецЦикла;	 
		
КонецПроцедуры

// Заполнить колонки периодов данными на сервере
//
// Параметры:
//  Объект			 - ДанныеФормыСтруктура - объект для заполнения
//  ТаблицаПериодов	 - ДанныеФормыКоллекция - таблица периодов
//  Параметры		 - Структура - параметры для заполнения:
//		*ОсновнаяТаблица - Строка - имя основной таблицы
//		*ТаблицаСПериодами - Строка - имя таблицы с периодами
//		*СоответствиеКолонок - Соответствие - соответствие имен колонок
//		*ИндексОсновнойТЧ - Строка - имя индекса основной таблицы
//		*ИндексТЧПериодов - Строка - имя индекса таблицы периодов 
//
Процедура ЗаполнитьКолонкиПериодовДаннымиНаСервере(Объект, ТаблицаПериодов, Параметры) Экспорт
	
	ОсновнаяТаблица = Параметры.ОсновнаяТаблица;
	ТаблицаСПериодами = Параметры.ТаблицаСПериодами;
	СоответствиеКолонок = Параметры.СоответствиеКолонок;
	ИндексОсновнойТЧ = Параметры.ИндексОсновнойТЧ;
	ИндексТЧПериодов = Параметры.ИндексТЧПериодов; 
	
	Для Каждого ТекСтрока Из ТаблицаПериодов Цикл
		
		СтруктураПериод = Новый Структура("Период", ТекСтрока.Период); 
		НайденныеСтроки = Объект[ТаблицаСПериодами].НайтиСтроки(СтруктураПериод);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить; 	
		КонецЕсли;
		
		Для Каждого ТекНайденнаяСтрока Из НайденныеСтроки Цикл
			
			СтруктураИндекс = Новый Структура(ИндексОсновнойТЧ, ТекНайденнаяСтрока[ИндексТЧПериодов]);
			НайдСтроки = Объект[ОсновнаяТаблица].НайтиСтроки(СтруктураИндекс);
			
			Если НайдСтроки.Количество() > 0 Тогда
				
				Для Каждого Элемент Из СоответствиеКолонок Цикл
					НайдСтроки[0][Элемент.Ключ + ТекСтрока.НомерКолонки] = ТекНайденнаяСтрока[Элемент.Значение];	
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

