////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для печати шаблонов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполнить документ MS Word по выбранному шаблону.
//
// Параметры:
//  Этаформа	 - УправляемаяФорма - форма, являющаяся владельцем открываемой формы выбора шаблона.
//  Объект		 - ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора - 
//					ссылка на документ, из которого вызвана команда печати из шаблона MS Word.
//  Заголовок	 - Строка - заголовок создаваемого документа MS Word.
//
Процедура ЗаполнитьБланкДокумента(Этаформа, Объект, Заголовок = "") Экспорт
	
	СписокПараметр = упоПечатьШаблоновСервер.ПолучитьСписокДокументов(Объект);
	
	Контекст = Новый Структура;
	Контекст.Вставить("Объект", Объект);
	Контекст.Вставить("Заголовок", Заголовок);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьБланкДокументаОсновная", ЭтотОбъект, Контекст);
	
	ПараметрыОткрытия = Новый Структура("Файлы, Заголовок, СообщениеЗаголовок",
		СписокПараметр, НСтр("ru = 'Выбор шаблона'"), НСтр("ru = 'Выбор шаблонов для печати'"));
	ОткрытьФорму("ОбщаяФорма.упоФормаВопроса", ПараметрыОткрытия, ЭтаФорма, , , , ОписаниеОповещения);
	
КонецПроцедуры

// Заменяет шаблон в файле MS Word на текст.
//
// Параметры:
//  Word					 - COMОбъект - документ MS Word.
//  Закладка				 - Строка - подстрока-шаблон.
//  ДанныеВывода			 - Строка - текст, выводимый вместо шаблона.
//  ПеремещатьКурсор		 - Булево - признак необходимости перемещать курсор.
//  ПоместитьКурсорВНачало	 - Булево - признак необходимости поместить курсор в начало.
//  Искать					 - Булево - признак необходимости искать параметр.
//
// Возвращаемое значение:
//	Булево - признак того, что параметр для замены найден и замена выполнена.
//
Функция ЗаменитьШаблонВВордеНаТекст(Word,
	 								Закладка,
									ДанныеВывода,
									ПеремещатьКурсор = Ложь,
									ПоместитьКурсорВНачало = Ложь,
									Искать = Ложь) Экспорт
	 
	 Result 				= Истина;
	 ПараметрНайден 		= Ложь;
	 ДлинаБлокаВСимволах	= 150;
	 ТекстВывода 			= Строка(ДанныеВывода);
	 ДлинаСтроки 			= СтрДлина(ТекстВывода);
	 КоличествоБлоков 		= ДлинаСтроки / ДлинаБлокаВСимволах;
	 СимволовВыведено 		= 0;
	 
	 Если Цел(КоличествоБлоков) < КоличествоБлоков Тогда 
		 КоличествоБлоков  = Цел(КоличествоБлоков) + 1;
	 КонецЕсли;
	 
	 Пока Result Цикл 
		 
		 Если КоличествоБлоков > 1 Тогда 
			 Для Счетчик = 0 По КоличествоБлоков Цикл
				 Если КоличествоБлоков = Счетчик Тогда 
					 СтрокаВывода = Сред(ТекстВывода,(Счетчик * ДлинаБлокаВСимволах) + 1, ДлинаБлокаВСимволах);
				 Иначе
					 СтрокаВывода = Сред(ТекстВывода,(Счетчик * ДлинаБлокаВСимволах) + 1, ДлинаБлокаВСимволах) + Закладка;
				 КонецЕсли;
				 Result = Word.Selection.Find.Execute(Закладка, Истина, Истина, Ложь, , , Истина, , Ложь, СтрокаВывода); 	
			 КонецЦикла;
		 Иначе
			 Result = Word.Selection.Find.Execute(Закладка, Истина, Истина, Ложь, , , Истина, , Ложь, ТекстВывода); 	
		 КонецЕсли;
		 
		 Если ПараметрНайден = Ложь Тогда 
			 ПараметрНайден = Result;
		 КонецЕсли;
		 
		 Если ПоместитьКурсорВНачало Тогда
			 Word.Selection.HomeKey(6,);
		 КонецЕсли;
		 
		 Если Искать Тогда 
			 Возврат ПараметрНайден;
		 КонецЕсли;
		 
	 КонецЦикла;
	 
	 Если ПеремещатьКурсор Тогда
		 Word.Selection.GoTo(4, 2, 0, "");
	 КонецЕсли;
	 
	 Возврат ПараметрНайден;
	 
КонецФункции	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполнить документ MS Word по выбранному шаблону.
//
// Параметры:
//  МассивШаблонов			 - Массив
//  ДополнительныеПараметры	 - Структура - Структура, с ключами:
//  * Объект 		- ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора -
//  ссылка на документ, из которого вызвана команда печати из шаблона MS Word
//  * Заголовок	- Строка - заголовок создаваемого документа MS Word.
//
Процедура ЗаполнитьБланкДокументаОсновная(МассивШаблонов, ДополнительныеПараметры) Экспорт
#Если Не ВебКлиент И Не МобильноеПриложениеКлиент И Не МобильныйКлиент Тогда
	Если Не (ТипЗнч(МассивШаблонов) = Тип("Массив") И МассивШаблонов.ВГраница() > -1) Тогда 
		Возврат;
	КонецЕсли;
	
	Объект = ДополнительныеПараметры.Объект;
	Заголовок = ДополнительныеПараметры.Заголовок;
		
	МодульРаботаСФайламиСлужебныйКлиент 	   = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиент");
	МодульРаботаСФайламиСлужебныйКлиентСервер  = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиентСервер");
	МодульРаботаСФайламиВызовСервера    	   = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйВызовСервера");
	МодульРаботаСФайламиКлиент		    	   = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиент");
	
	МодульРаботаСФайламиСлужебныйКлиент.РабочийКаталогПользователя();
	ИмяКаталога = МодульРаботаСФайламиСлужебныйКлиент.ПерсональныеНастройкиРаботыСФайлами().ПутьКЛокальномуКэшуФайлов;
	
	ПараметрыЗаполения = упоПечатьШаблоновСервер.ПолучитьПарметрыЗаполнения();
	
	Word = Новый COMObject("Word.Application");
	
	Для каждого ЭлементМассива Из МассивШаблонов Цикл
		
		ДанныеФайла = Неопределено;
		СтрокаСообщения = "";
		
		УникальныйИдентификатор = ЭлементМассива.УникальныйИдентификатор();
		Результат = МодульРаботаСФайламиВызовСервера.ПолучитьДанныеФайлаИЗанятьФайл(
			ЭлементМассива,
			ДанныеФайла,
			СтрокаСообщения,
			УникальныйИдентификатор);
			
		Если Не Результат Тогда
			СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), СтрокаСообщения);
			ПоказатьОповещениеПользователя(НСтр("ru='Шаблон временно недоступен'"), , СтрокаСообщения, БиблиотекаКартинок.Информация32);
			Продолжить;
		КонецЕсли;
		
		РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
		
		ЕстьФайлСВерсиейВРабочемКаталоге = Ложь;
		Если РасширениеПодключено Тогда
			
			ПолноеИмяФайла = "";
			ДополнительныеПараметры.Вставить("ОткрытьФайл", Истина);
			ДополнительныеПараметры.Вставить("HWord", Word);
			ДополнительныеПараметры.Вставить("ПараметрыЗаполения", ПараметрыЗаполения);
			ДополнительныеПараметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
			
			Обработчик = Новый ОписаниеОповещения("ЗаполнитьБланкДокументаОсновнаяПродолжение",
				ЭтотОбъект, ДополнительныеПараметры);
			
			МодульРаботаСФайламиКлиент.ПолучитьФайлВерсииВРабочийКаталог(
				Обработчик, ДанныеФайла, ПолноеИмяФайла, УникальныйИдентификатор, ДополнительныеПараметры);
		КонецЕсли;
			
	КонецЦикла;
#КонецЕсли
КонецПроцедуры

// См. выше. Продолжение.
//
Процедура ЗаполнитьБланкДокументаОсновнаяПродолжение(Результат, ПараметрыВыполнения) Экспорт
	
	ПолноеИмяФайла = Результат.ПолноеИмяФайла;
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		ПолноеИмяФайла = Результат.ДанныеФайла.ПолноеИмяФайлаВРабочемКаталоге;
	КонецЕсли;
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Результат.ДополнительныеПараметры;
	
	Word = ДопПараметры.HWord;
	
	Word.Documents.Open(ПолноеИмяФайла, ,Результат.ДанныеФайла.НаЧтение);
		
	Word.ActiveWindow.Caption = ДопПараметры.Заголовок;
	Word.Visible = 0;
	
	ПараметрыЗаполения = ДопПараметры.ПараметрыЗаполения;
	Для каждого Параметр Из ПараметрыЗаполения Цикл
	
		НашлиПараметр = ЗаменитьШаблонВВордеНаТекст(Word, "{" + Параметр.Ключ + "}", "{" + Параметр.Ключ + "}", , Истина, Истина);
		
		Если НашлиПараметр = Ложь Тогда 
			Продолжить;
		КонецЕсли;
		
		Объект = ДопПараметры.Объект;
		РезультатВыполненияДействия = упоПечатьШаблоновСервер.ПолучитьРезультатВыполненияДействия(Параметр.Значение, Объект);
		
		Если ТипЗнч(РезультатВыполненияДействия) = Тип("Массив") Тогда 
			
			Если Не РезультатВыполненияДействия.Количество() = 0 Тогда 
				
				Рез = ЗаменитьШаблонВВордеНаТекст(Word, "{" + Параметр.Ключ + "}", "", Истина);
				
				Если Рез = Истина Тогда
					
					ЕстьСтрока = Истина;
					Word.Selection.MoveDown();
					Word.Selection.SelectRow();
					ТаблицаWord  = Word.Selection.Rows(1).Parent;
					ТаблицаWord.Rows(ТаблицаWord.Rows.Count()).Range().Copy();
					
					ШиринаКолонок = Новый Соответствие;
					Для каждого ЭлементМассива Из РезультатВыполненияДействия Цикл
						
						Если ЕстьСтрока Тогда
						
							ЕстьСтрока = Ложь;
							
						Иначе
							
							ТаблицаWord.Rows(ТаблицаWord.Rows.Count()).Range().Select();
							Word.Selection.InsertRowsBelow();
							КоличествоСтрок = ТаблицаWord.Rows.Count();
							Word.ActiveDocument.Range(ТаблицаWord.Rows(КоличествоСтрок).Range().Start, ТаблицаWord.Rows(КоличествоСтрок).Range().End - 1).Paste();

						КонецЕсли;
						
						Для каждого Колонка Из  ЭлементМассива Цикл
							
							СтрокаПоиска = "{" + Колонка.Ключ + "}";
							
							Word.Selection.SelectRow();
							
							Word.Selection.MoveDown();
							Word.Selection.MoveUp();   
							Word.Selection.SelectCell();
							Word.selection.Range.Characters.First.Select();
							Word.selection.MoveLeft();
							
							КолонкаЗначение = Колонка.Значение;
							Если ТипЗнч(КолонкаЗначение) = Тип("Дата") Тогда 
								КолонкаЗначение = Формат(КолонкаЗначение, "ДФ=dd.MM.yyyy");
							ИначеЕсли ТипЗнч(КолонкаЗначение) = Тип("Число") Тогда 
								КолонкаЗначение = Формат(КолонкаЗначение, "ЧДЦ=2");
							КонецЕсли;
							
							Если Не ЗначениеЗаполнено(КолонкаЗначение) Тогда 
								КолонкаЗначение = " ";
							КонецЕсли;
							
							ЗаменитьШаблонВВордеНаТекст(Word, СтрокаПоиска, КолонкаЗначение, Истина);	 
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Word.Selection.HomeKey(6, );
				
			КонецЕсли;
				
		Иначе
			
			Если ТипЗнч(РезультатВыполненияДействия) = Тип("Дата") Тогда 
				РезультатВыполненияДействия = Формат(РезультатВыполненияДействия, "ДФ=dd.MM.yyyy");
			ИначеЕсли ТипЗнч(РезультатВыполненияДействия) = Тип("Число") Тогда 
				РезультатВыполненияДействия = Формат(РезультатВыполненияДействия, "ЧДЦ=2");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Параметр.Ключ) Тогда
				Если Не ЗначениеЗаполнено(РезультатВыполненияДействия) Тогда
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = НСтр("ru = 'В информационной базе не установлено значение для параметра: '") + Параметр.Ключ;
					Сообщение.Сообщить();
				КонецЕсли;
				ЗаменитьШаблонВВордеНаТекст(Word, "{" + Параметр.Ключ + "}", РезультатВыполненияДействия , , Истина);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДопПараметры.Свойство("ОткрытьФайл") И ДопПараметры.ОткрытьФайл Тогда
		Word.Application.Visible = Истина; 	 
		Word.Application.WindowState = 2;
		Word.Application.WindowState = 1;
	КонецЕсли;
	
	МодульРаботаСФайламиВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйВызовСервера");	
	РаботаСФайламиСлужебныйВызовСервера.ОсвободитьФайл(Результат.ДанныеФайла, ДопПараметры.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
