
&После("ОбработкаЗаполнения")
Процедура Расш1_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//{[+] ИКТ №20664 (фрагмент ДОБАВЛЕН), Новоселов, 06.08.2026 Перенес доработки по 6568 с СНВМ
	Ведомость = Документы.ВедомостьНаВыплатуЗарплатыВБанк.ПустаяСсылка();
	Если ДанныеЗаполнения <> Неопределено
		И ДанныеЗаполнения.Свойство("МассивВедомостей") И ДанныеЗаполнения.МассивВедомостей.Количество() > 0 Тогда
		Ведомость = ДанныеЗаполнения.МассивВедомостей[0];
	КонецЕсли;
	Если ЗначениеЗаполнено(Ведомость) И ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк") Тогда
		РСБанка = Ведомость.ЗарплатныйПроект.РасчетныйСчет;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	БанковскиеСчетаОрганизаций.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
			|ГДЕ
			|	БанковскиеСчетаОрганизаций.Банк = &Банк
			|	И БанковскиеСчетаОрганизаций.НомерСчета = &НомерСчета";
		Запрос.УстановитьПараметр("Банк", Ведомость.ЗарплатныйПроект.Банк);
		Запрос.УстановитьПараметр("НомерСчета", Ведомость.ЗарплатныйПроект.РасчетныйСчет);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЭтотОбъект.БанковскийСчет = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка,
			|	Контрагенты.Партнер КАК Партнер
			|ИЗ
			|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО (БанковскиеСчетаКонтрагентов.Владелец = Контрагенты.Ссылка И БанковскиеСчетаКонтрагентов.НомерСчета = &НомерСчета)
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН
			|	И Контрагенты.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";
		Запрос.УстановитьПараметр("ИНН", Ведомость.ЗарплатныйПроект.Банк.ИНН);
		Запрос.УстановитьПараметр("НомерСчета", Ведомость.ЗарплатныйПроект.РасчетныйСчет);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЭтотОбъект.Контрагент = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		Этотобъект.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета", Ведомость.ЗарплатныйПроект.РасчетныйСчет);
	КонецЕсли;
	//[+]} ИКТ №20664
	
КонецПроцедуры
