
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРегистрацияФактическихДопЗатрат);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

// Производит автоматическое заполнение табличной части на основании планов дополнительных затрат.
//
// Параметры:
//  Объект	 - ДокументОбъект.упоРегистрацияФактическихДопЗатрат, ДанныеФормыСтруктура - Документ регистрации фактических 
//																						доп. затрат.
//
Процедура ЗаполнитьТабличнуюЧасть(Объект) Экспорт

	Объект.ДополнительныеЗатраты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", Объект.ПроектнаяЗадача);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РегПлан.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	РегПлан.ВидОперации КАК ВидОперации,
	               |	СУММА(РегПлан.Стоимость) КАК Стоимость
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДополнительныхЗатрат.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК РегПлан
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
	               |		ПО РегПлан.Версия = Версии.Версия
	               |			И (Версии.Текущая)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РегПлан.СтатьяЗатрат,
	               |	РегПлан.ВидОперации";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = Объект.ДополнительныеЗатраты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
