#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает изменяемые задачи и проекты.
//
// Параметры:
//  ДокументСсылка	- ДокументСсылка - документ распределения расходов. 
// 
// Возвращаемое значение:
//  Структура 		- содержит два поля с типом массив: МассивПроектов и МассивЗадач.
//
Функция ПолучитьИзменяемыеЗадачиИПроекты(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РаспределенныеРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	РаспределенныеРасходы.ПроектнаяЗадача.Проект КАК Проект
	               |ИЗ
	               |	Документ.упоРаспределениеРасходовПоПроектамФакт.РаспределенныеРасходы КАК РаспределенныеРасходы
	               |ГДЕ
	               |	РаспределенныеРасходы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ТаблицаПЗ = Запрос.Выполнить().Выгрузить();
	МассивЗадач = ТаблицаПЗ.ВыгрузитьКолонку("ПроектнаяЗадача");
	ТаблицаПЗ.Свернуть("Проект");
	МассивПроектов = ТаблицаПЗ.ВыгрузитьКолонку("Проект");
	
	Результат = Новый Структура("МассивПроектов, МассивЗадач", МассивПроектов, МассивЗадач);
	
	Возврат Результат;
	
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = КомандыОтчетов.Добавить();
    КомандаОтчет.Менеджер = Метаданные.Отчеты.упоРаспределениеРасходовПоПроектамФакт.ПолноеИмя();
    КомандаОтчет.Представление = НСтр("ru = 'Результат распределения'");
    КомандаОтчет.МножественныйВыбор = Истина;
    КомандаОтчет.Важность = "Обычное";
    КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "упоРезультатРаспределения");
	КомандаОтчет.КлючВарианта = "Основной";	
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(РаспределенныеРасходы.ПроектнаяЗадача.Проект, NULL КАК ИСТИНА))";
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли