
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ	(ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);	
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, 
			РежимЗаписиДокумента.Проведение, 
			Отказ, 
			Заголовок, 
			Истина);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	упоПроведениеДокументовВызовСервера.обУдалитьДвиженияДокумента(Отказ, ЭтотОбъект);
		
	Пакет = ПолучитьПакетДляФормированияДвижений();
	РезультатПакета = Пакет.ВыполнитьПакет();
	ИндексПоследнего = РезультатПакета.Количество() - 1;
	
	ФактДоходовИРасходовОбороты = РезультатПакета[ИндексПоследнего - 1].Выгрузить();
	ФактДоходовИРасходовПоДням = РезультатПакета[ИндексПоследнего].Выгрузить();
	
	СформироватьДвижения_упоФактДоходовИРасходовОбороты(ФактДоходовИРасходовОбороты);
	СформироватьДвижения_упоФактДоходовИРасходовПоДням(ФактДоходовИРасходовПоДням);
	
	Если Движения.упоФактДоходовИРасходовОбороты.Количество() Тогда
		Движения.упоФактДоходовИРасходовОбороты.Записать();
	КонецЕсли;
	
	Если Движения.упоФактДоходовИРасходовПоДням.Количество() Тогда
		Движения.упоФактДоходовИРасходовПоДням.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры 
 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПакетДляФормированияДвижений()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидЭлемента", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ИСТИНА КАК Активность,
	               |	&ВидЭлемента КАК ВидЭлемента,
	               |	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Период, МЕСЯЦ), ДЕНЬ) КАК Период,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.СтатьяРасходов КАК Статья,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Подразделение КАК Подразделение,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Валюта КАК Валюта,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	СУММА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Сумма) КАК Сумма,
	               |	СУММА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Сумма) КАК СуммаВалютная
	               |ИЗ
	               |	Документ.упоРаспределениеРасходовПоПроектамФакт.РаспределенныеРасходыПоПериодам КАК упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоРаспределениеРасходовПоПроектамФакт.РаспределенныеРасходы КАК упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы
	               |		ПО упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Ссылка = упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Ссылка
	               |			И (упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.ИндексСтрокиРаспределенияПоПериодам = упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.ИндексСтрокиРаспределенныхРасходов)
	               |ГДЕ
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Ссылка = &Ссылка
	               |	И упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.ПроектнаяЗадача,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.СтатьяРасходов,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Подразделение,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Валюта,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.СобствСилы_Субподряд,
	               |	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Период, МЕСЯЦ), ДЕНЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Активность,
	               |	&ВидЭлемента КАК ВидЭлемента,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Ссылка.Дата КАК Период,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.СтатьяРасходов КАК Статья,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Валюта КАК Валюта,
	               |	СУММА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Сумма) КАК Сумма,
	               |	СУММА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Сумма) КАК СуммаВалютная,
	               |	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Период, МЕСЯЦ), ДЕНЬ) КАК ДатаНачисления
	               |ИЗ
	               |	Документ.упоРаспределениеРасходовПоПроектамФакт.РаспределенныеРасходыПоПериодам КАК упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоРаспределениеРасходовПоПроектамФакт.РаспределенныеРасходы КАК упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы
	               |		ПО упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Ссылка = упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Ссылка
	               |			И (упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.ИндексСтрокиРаспределенияПоПериодам = упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.ИндексСтрокиРаспределенныхРасходов)
	               |ГДЕ
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Ссылка = &Ссылка
	               |	И упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.ПроектнаяЗадача,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.СтатьяРасходов,
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Валюта,
	               |	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходыПоПериодам.Период, МЕСЯЦ), ДЕНЬ),
	               |	упоРаспределениеРасходовПоПроектамФактРаспределенныеРасходы.Ссылка.Дата";
	
	Возврат Запрос;
	
КонецФункции 

Процедура СформироватьДвижения_упоФактДоходовИРасходовОбороты(ТаблицаЗадачФакта)
	
	ТаблицаДвижений = упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоФактДоходовИРасходовОбороты", , , Истина);
	
	Для Каждого СтрокаЗадачи Из ТаблицаЗадачФакта Цикл
		НоваяСтрока = ТаблицаДвижений.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадачи);		
	КонецЦикла;	
	
	Движения.упоФактДоходовИРасходовОбороты.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Процедура СформироватьДвижения_упоФактДоходовИРасходовПоДням(ТаблицаЗадачФакта)
	
	ТаблицаДвижений = упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоФактДоходовИРасходовПоДням", , , Истина);
	
	Для Каждого СтрокаЗадачи Из ТаблицаЗадачФакта Цикл
		НоваяСтрока = ТаблицаДвижений.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадачи);		
	КонецЦикла;	
	
	Движения.упоФактДоходовИРасходовПоДням.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли