////////////////////////////////////////////////////////////////////////////////
// Автоматизация назначения ограничений доступа по проектам
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработчикиРегламентныхЗаданий

// Обработчик регламентного задания "упоПересчетОграниченийДоступаПоПроектам".
//
Процедура упоПересчетОграниченийДоступаПоПроектам() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.упоПересчетОграниченийДоступаПоПроектам);
	
	ОбработатьПорциюОчереди();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

// Обработчик подписки на события "упоОграничениеДоступаПоПроектамПриЗаписи".
//
// Параметры:
//  Источник - СправочникОбъект.Проекты, СправочникОбъект.упоОграниченияДоступаПоПроектам - Источник
//  Отказ	 - Булево	 - Отказ.
//
Процедура упоДобавлениеВОчередьПересчетаОграниченийДоступаПоПроектамПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Проекты") И НЕ Источник.ЭтоПроектнаяЗадача  Тогда
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") И Источник.ДополнительныеСвойства.ЭтоНовый Тогда
			ДобавитьПроектВГруппыДоступаТекущегоПользователя(Источник.Ссылка);
		КонецЕсли;
	Иначе
		ДобавитьВОчередьПересчетаДанныеИсточника(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик подписки на события "упоОграничениеДоступаПоПроектамОбработкаПроведения".
//
// Параметры:
//  Источник		 - 	 - ДокументОбъект.упоРегистрацияПроекта, ДокументОбъект.упоИзменениеРуководителяПроекта,
//  	ДокументОбъект.упоРегистрацияДиспетчера, ДокументОбъект.упоОсвобождениеДиспетчера,
//  	ДокументОбъект.упоИзменениеРуководителяПроектнойЗадачи - Источник
//  Отказ			 - Булево
//  РежимПроведения	 - РежимПроведенияДокумента
//
Процедура ДокументыОграниченияДоступаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ДобавитьВОчередьПересчетаДанныеИсточника(Источник);
	 
КонецПроцедуры

// Обработчик подписки на события "упоОграничениеДоступаПоПроектамОбработкаУдаленияПроведения".
//
// Параметры:
//  Источник - ДокументОбъект.упоРегистрацияПроекта, ДокументОбъект.упоИзменениеРуководителяПроекта,
//			   ДокументОбъект.упоРегистрацияДиспетчера, ДокументОбъект.упоОсвобождениеДиспетчера,
//			   ДокументОбъект.упоИзменениеРуководителяПроектнойЗадачи - Источник
//  Отказ	 - Булево	 - Отказ.
//
Процедура ДокументыОграниченияДоступаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ДобавитьВОчередьПересчетаДанныеИсточника(Источник);
	
КонецПроцедуры

#КонецОбласти

// Обновить ограничения доступа по проектам по указанному объекту.
//
// Параметры:
//  Параметр - СправочникСсылка.Проекты, СправочникСсылка.Пользователи, Неопределено	 - Объект пересчет прав.
//																       Если Неопределено, тогда полный пересчет.
// 
// Возвращаемое значение:
//   Неопределено.
//
Функция ОбновитьОграниченияДоступаПоПроектам(Параметр = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивПользователей = ПолучитьПользователейДляПересчета(Параметр);
		
	Если МассивПользователей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаПрав = ПолучитьТаблицуНовыхПрав(МассивПользователей);	
		
	Для Каждого СтрокаПрав Из ТаблицаПрав Цикл
		
		ОбновитьГруппуДоступа(СтрокаПрав);
		
	КонецЦикла;
						
КонецФункции

// Добавить в очередь на пересчет прав
//
// Параметры:
//  ОбъектОчереди	 - СправочникСсылка.Проекты, СправочникСсылка.Пользователи	 - Объект очереди.
// 
// Возвращаемое значение:
//	Неопределено. 
//
Функция ДобавитьВОчередь(ОбъектОчереди) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.упоОчередьПересчетаОграниченийДоступаПоПроектам.СоздатьМенеджерЗаписи();
	Запись.Объект = ОбъектОчереди;
	Запись.Дата = ТекущаяДата();
	Запись.ДатаВМиллиСекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() + (ТекущаяДата() - ТекущаяУниверсальнаяДата());
	
	Запись.Записать();
	
КонецФункции 

// Удалить из очереди на пересчет прав
//
// Параметры:
//  ОбъектОчереди	 - СправочникСсылка.Проекты, СправочникСсылка.Пользователи	 - Объект очереди.
// 
// Возвращаемое значение:
//	Неопределено. 
//
Функция УдалитьИзОчереди(ОбъектОчереди) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.упоОчередьПересчетаОграниченийДоступаПоПроектам.СоздатьМенеджерЗаписи();
	Запись.Объект = ОбъектОчереди;
	Запись.Удалить();	
	
КонецФункции 

// Обрабатывает порцию записей из очереди на пересчет прав: обновляет по объекту права, а затем удаляет его из очереди.
//
// Возвращаемое значение:
//	Неопределено. 
//
Функция ОбработатьПорциюОчереди() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	               |	упоОчередьПересчетаОграниченийДоступаПоПроектам.Объект КАК ОбъектОчереди
	               |ИЗ
	               |	РегистрСведений.упоОчередьПересчетаОграниченийДоступаПоПроектам КАК упоОчередьПересчетаОграниченийДоступаПоПроектам
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	упоОчередьПересчетаОграниченийДоступаПоПроектам.ДатаВМиллиСекундах";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбновитьОграниченияДоступаПоПроектам(Выборка.ОбъектОчереди);	
		УдалитьИзОчереди(Выборка.ОбъектОчереди);
	КонецЦикла;
	
КонецФункции 

// Добавляет текущему пользователю права на переданный проект.
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты - Проект, доступ к которому предоставляется.
// 
// Возвращаемое значение:
//	Неопределено. 
//
Функция ДобавитьПроектВГруппыДоступаТекущегоПользователя(Проект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВидДоступаПроекты = ПолучитьВидДоступаПроекты();
	
	Пользователь = Пользователи.ТекущийПользователь();
	МассивГруппДоступа = ПолучитьАвтоматическиЗаполняемыеГруппыДоступаПользователя(Пользователь);
	
	Для Каждого ГруппаДоступа Из МассивГруппДоступа Цикл
		
		// Случай добавления запрещенного проекта не обрабатывается (не входит в сценарий автоматического назначения
		// групп доступа). Обрабатываются только разрешенные проекты при виде доступа "Все запрещены, кроме".
		СтрокаВидаДоступа = ГруппаДоступа.ВидыДоступа.Найти(ВидДоступаПроекты, "ВидДоступа");
		Если Не СтрокаВидаДоступа = Неопределено 
			И СтрокаВидаДоступа.ВсеРазрешены Тогда
			Продолжить;
		КонецЕсли;
		
		обГруппаДоступа = ГруппаДоступа.ПолучитьОбъект();
		
		НоваяСтрока = обГруппаДоступа.ЗначенияДоступа.Добавить();
		НоваяСтрока.ВидДоступа = ВидДоступаПроекты;
		НоваяСтрока.ЗначениеДоступа = Проект;
		
		обГруппаДоступа.Записать();
		
	КонецЦикла;
	
КонецФункции 

// Возвращает вид ограничения доступа - Проекты.
//
// Возвращаемое значение:
//	ЛюбаяСсылка - Ссылка на вид доступа.
//
Функция ПолучитьВидДоступаПроекты() Экспорт
	
	Возврат Справочники.Проекты.ПустаяСсылка();	
	
КонецФункции 

// Возвращает массив групп доступа, которые связаны с автоматическими назначениями 
//									ограничений по проектам указанного пользователя.
//
// Параметры:
//  Пользователь - СправчоникСсылка.Пользователи	 - Пользователь.
// 
// Возвращаемое значение:
//   Массив - Массив элементов с типом СправочникСсылка.ГруппыДоступа.
//
Функция ПолучитьАвтоматическиЗаполняемыеГруппыДоступаПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоОграниченияДоступаПоПроектам.ГруппаДоступа
	               |ИЗ
	               |	Справочник.упоОграниченияДоступаПоПроектам КАК упоОграниченияДоступаПоПроектам
	               |ГДЕ
	               |	упоОграниченияДоступаПоПроектам.Пользователь = &Пользователь
	               |	И НЕ упоОграниченияДоступаПоПроектам.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаДоступа");
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуНовыхПрав(МассивПользователей)
	
	ТаблицаПрав = Новый ТаблицаЗначений;
	ТаблицаПрав.Колонки.Добавить("Пользователь");
	ТаблицаПрав.Колонки.Добавить("ГруппаДоступа");
	ТаблицаПрав.Колонки.Добавить("ДобавляемыеПроекты");
	ТаблицаПрав.Колонки.Добавить("УдаляемыеПроекты");
	
	МассивСтрокаЗапроса = Новый Массив;
	МассивСтрокаЗапроса.Добавить(ПолучитьТекстДляЗапроса_СвязиПроектаИПользователя());
	МассивСтрокаЗапроса.Добавить(";");
	МассивСтрокаЗапроса.Добавить(ПолучитьТекстДляЗапроса_НовыеПраваПользователей());
	
	ТекстЗапроса = СтрСоединить(МассивСтрокаЗапроса, Символы.ПС);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("флУчитыватьПредыдущиеПрава", Истина);
	Запрос.УстановитьПараметр("флВсеПользователи", Ложь);
	Если МассивПользователей.Количество() = 1 Тогда
		Запрос.УстановитьПараметр("Пользователь", МассивПользователей[0]);
	Иначе
		Запрос.УстановитьПараметр("Пользователи", МассивПользователей);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "= &Пользователь", "В (&Пользователи)");
	КонецЕсли;
	Запрос.УстановитьПараметр("флВсеПроекты", Истина);
	Запрос.УстановитьПараметр("Проект", Справочники.Проекты.ПустаяСсылка());
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаПользователи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПользователи.Следующий() Цикл
		ВыборкаГруппыДоступа = ВыборкаПользователи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппыДоступа.Следующий() Цикл
			СтрокаПрав = ТаблицаПрав.Добавить();
			СтрокаПрав.Пользователь = ВыборкаПользователи.Пользователь;
			СтрокаПрав.ГруппаДоступа = ВыборкаГруппыДоступа.ГруппаДоступа;
			СтрокаПрав.ДобавляемыеПроекты = Новый Массив;
			СтрокаПрав.УдаляемыеПроекты = Новый Массив;
			ВыборкаПроекты = ВыборкаГруппыДоступа.Выбрать();
			Пока ВыборкаПроекты.Следующий() Цикл
				Если ВыборкаПроекты.ДобавитьПраво Тогда
					СтрокаПрав.ДобавляемыеПроекты.Добавить(ВыборкаПроекты.Проект);
				ИначеЕсли ВыборкаПроекты.УдалитьПраво Тогда
					СтрокаПрав.УдаляемыеПроекты.Добавить(ВыборкаПроекты.Проект);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаПрав;
	
КонецФункции 

Функция ПолучитьПользователейДляПересчета(Параметр)
	
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Пользователи") Тогда
		
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(Параметр);
		
	Иначе
		
		МассивСтрокаЗапроса = Новый Массив;
		МассивСтрокаЗапроса.Добавить(ПолучитьТекстДляЗапроса_СвязиПроектаИПользователя());
		МассивСтрокаЗапроса.Добавить(";");
		МассивСтрокаЗапроса.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ ВР.Пользователь ИЗ ТаблицаПользователиПроекты КАК ВР");
		
		ТекстЗапроса = СтрСоединить(МассивСтрокаЗапроса, Символы.ПС);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("флВсеПользователи", Истина);
		Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.ПустаяСсылка());
		Запрос.УстановитьПараметр("флУчитыватьПредыдущиеПрава", Истина);
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Проекты") Тогда
			Запрос.УстановитьПараметр("флВсеПроекты", Ложь);
			Запрос.УстановитьПараметр("Проект", Параметр);
		Иначе
			Запрос.УстановитьПараметр("флВсеПроекты", Истина);
			Запрос.УстановитьПараметр("Проект", Справочники.Проекты.ПустаяСсылка());
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		МассивПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
		
	КонецЕсли;
	
	Возврат МассивПользователей;
	
КонецФункции 

Функция ОбновитьГруппуДоступа(ПараметрыДоступа)
	
	ВидДоступаПроекты = ПолучитьВидДоступаПроекты();
	ОтборВидаДоступаПроекты = Новый Структура("ВидДоступа", ВидДоступаПроекты);
	
	ГруппаДоступаОб = ПараметрыДоступа.ГруппаДоступа.ПолучитьОбъект();
	
	СтрокаВидаДоступа = ГруппаДоступаОб.ВидыДоступа.Найти(ВидДоступаПроекты, "ВидДоступа");
	Если СтрокаВидаДоступа = Неопределено Тогда
		СтрокаВидаДоступа = ГруппаДоступаОб.ВидыДоступа.Добавить();
		СтрокаВидаДоступа.ВидДоступа = ВидДоступаПроекты;
		СтрокаВидаДоступа.ВсеРазрешены = Ложь;
	КонецЕсли;
	
	Для Каждого Проект Из ПараметрыДоступа.УдаляемыеПроекты Цикл
		ОтборВидаДоступаПроекты.Вставить("ЗначениеДоступа", Проект);
		СтрокиЗначенийДляОчистки = ГруппаДоступаОб.ЗначенияДоступа.НайтиСтроки(ОтборВидаДоступаПроекты);
		Если ЗначениеЗаполнено(СтрокиЗначенийДляОчистки) Тогда
			ГруппаДоступаОб.ЗначенияДоступа.Удалить(СтрокиЗначенийДляОчистки[0])
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Проект Из ПараметрыДоступа.ДобавляемыеПроекты Цикл
		НоваяСтрокаЗначенийДоступа = ГруппаДоступаОб.ЗначенияДоступа.Добавить();
		НоваяСтрокаЗначенийДоступа.ВидДоступа = ВидДоступаПроекты; 
		НоваяСтрокаЗначенийДоступа.ЗначениеДоступа = Проект; 
	КонецЦикла;
	
	ГруппаДоступаОб.Записать();
	
КонецФункции 

Функция ПолучитьТекстДляЗапроса_СвязиПроектаИПользователя(ПомещатьВоВременнуюТаблицу = Истина)
	
	Текст = "ВЫБРАТЬ
	        |	упоРуководителиПроектовСрезПоследних.Проект КАК Проект,
	        |	упоДиспетчерыСистемыСрезПоследних.Пользователь КАК Пользователь,
	        |	ЛОЖЬ КАК ТекущиеЗаписанныеПраваВСистеме
	        |ПОМЕСТИТЬ ТаблицаПользователиПроекты
	        |ИЗ
	        |	РегистрСведений.упоРуководителиПроектов.СрезПоследних(
	        |			,
	        |			&флВсеПроекты
	        |				ИЛИ Проект = &Проект) КАК упоРуководителиПроектовСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(
	        |				,
	        |				&флВсеПользователи
	        |					ИЛИ Пользователь = &Пользователь) КАК упоДиспетчерыСистемыСрезПоследних
	        |		ПО упоРуководителиПроектовСрезПоследних.РуководительПроекта = упоДиспетчерыСистемыСрезПоследних.Сотрудник
	        |			И (упоДиспетчерыСистемыСрезПоследних.ФлагУправления)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	упоРуководителиПроектовСрезПоследних.Проект,
	        |	упоДиспетчерыСистемыСрезПоследних.Пользователь,
	        |	ЛОЖЬ
	        |ИЗ
	        |	РегистрСведений.упоРуководителиПроектов.СрезПоследних(
	        |			,
	        |			&флВсеПроекты
	        |				ИЛИ Проект = &Проект) КАК упоРуководителиПроектовСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(
	        |				,
	        |				&флВсеПользователи
	        |					ИЛИ Пользователь = &Пользователь) КАК упоДиспетчерыСистемыСрезПоследних
	        |		ПО упоРуководителиПроектовСрезПоследних.КураторПроекта = упоДиспетчерыСистемыСрезПоследних.Сотрудник
	        |			И (упоДиспетчерыСистемыСрезПоследних.ФлагУправления)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	упоОграниченияДоступаПоПроектамДополнительныйДоступ.Объект,
	        |	упоОграниченияДоступаПоПроектамДополнительныйДоступ.Ссылка.Пользователь,
	        |	ЛОЖЬ
	        |ИЗ
	        |	Справочник.упоОграниченияДоступаПоПроектам.ДополнительныйДоступ КАК упоОграниченияДоступаПоПроектамДополнительныйДоступ
	        |ГДЕ
	        |	НЕ упоОграниченияДоступаПоПроектамДополнительныйДоступ.Ссылка.ПометкаУдаления
	        |	И (&флВсеПользователи
	        |			ИЛИ упоОграниченияДоступаПоПроектамДополнительныйДоступ.Ссылка.Пользователь = &Пользователь)
	        |	И (&флВсеПроекты
	        |			ИЛИ упоОграниченияДоступаПоПроектамДополнительныйДоступ.Объект = &Проект)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	Проекты.Ссылка,
	        |	Проекты.Автор,
	        |	ЛОЖЬ
	        |ИЗ
	        |	Справочник.Проекты КАК Проекты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК упоСтатусыПроектовСрезПоследних
	        |		ПО (упоСтатусыПроектовСрезПоследних.Проект = Проекты.Ссылка)
	        |ГДЕ
	        |	НЕ Проекты.ЭтоПроектнаяЗадача
	        |	И упоСтатусыПроектовСрезПоследних.Проект ЕСТЬ NULL
	        |	И (&флВсеПользователи
	        |			ИЛИ Проекты.Автор = &Пользователь)
	        |	И (&флВсеПроекты
	        |			ИЛИ Проекты.Ссылка = &Проект)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	упоРуководителиПроектныхЗадачСрезПоследних.ПроектнаяЗадача.Проект,
	        |	упоДиспетчерыСистемыСрезПоследних.Пользователь,
	        |	ЛОЖЬ
	        |ИЗ
	        |	РегистрСведений.упоРуководителиПроектныхЗадач.СрезПоследних(
	        |			,
	        |			&флВсеПроекты
	        |				ИЛИ ПроектнаяЗадача.Проект = &Проект) КАК упоРуководителиПроектныхЗадачСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(
	        |				,
	        |				&флВсеПользователи
	        |					ИЛИ Пользователь = &Пользователь) КАК упоДиспетчерыСистемыСрезПоследних
	        |		ПО упоРуководителиПроектныхЗадачСрезПоследних.РуководительПроектнойЗадачи = упоДиспетчерыСистемыСрезПоследних.Сотрудник
	        |			И (упоДиспетчерыСистемыСрезПоследних.ФлагУправления)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	        |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	        |				И (упоВерсииПроекта.Текущая)
	        |				И (&флВсеПроекты
	        |					ИЛИ упоВерсииПроекта.Проект = &Проект)
	        |		ПО упоРуководителиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	        |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа,
	        |	упоОграниченияДоступаПоПроектам.Пользователь,
	        |	ИСТИНА
	        |ИЗ
	        |	Справочник.упоОграниченияДоступаПоПроектам КАК упоОграниченияДоступаПоПроектам
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
	        |		ПО упоОграниченияДоступаПоПроектам.ГруппаДоступа = ГруппыДоступаЗначенияДоступа.Ссылка
	        |			И (ГруппыДоступаЗначенияДоступа.ВидДоступа = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
	        |ГДЕ
	        |	&флУчитыватьПредыдущиеПрава
	        |	И НЕ упоОграниченияДоступаПоПроектам.ПометкаУдаления
	        |	И (&флВсеПользователи
	        |			ИЛИ упоОграниченияДоступаПоПроектам.Пользователь = &Пользователь)
	        |	И (&флВсеПроекты
	        |			ИЛИ ГруппыДоступаЗначенияДоступа.ЗначениеДоступа = &Проект)";
	
	Если НЕ ПомещатьВоВременнуюТаблицу Тогда
		Текст = СтрЗаменить(Текст, "ПОМЕСТИТЬ ВременнаяТаблица", "");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции 

Функция ПолучитьТекстДляЗапроса_НовыеПраваПользователей()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТаблицаПользователиПроекты.Пользователь,
	        |	ТаблицаПользователиПроекты.Проект
	        |ПОМЕСТИТЬ ТекущиеПрава
	        |ИЗ
	        |	ТаблицаПользователиПроекты КАК ТаблицаПользователиПроекты
	        |ГДЕ
	        |	ТаблицаПользователиПроекты.ТекущиеЗаписанныеПраваВСистеме
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТаблицаПользователиПроекты.Пользователь,
	        |	ТаблицаПользователиПроекты.Проект
	        |ПОМЕСТИТЬ НужныПрава
	        |ИЗ
	        |	ТаблицаПользователиПроекты КАК ТаблицаПользователиПроекты
	        |ГДЕ
	        |	НЕ ТаблицаПользователиПроекты.ТекущиеЗаписанныеПраваВСистеме
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЕСТЬNULL(НужныПрава.Пользователь, ТекущиеПрава.Пользователь) КАК Пользователь,
	        |	ВЫБОР
	        |		КОГДА НужныПрава.Пользователь ЕСТЬ NULL
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК УдалитьПраво,
	        |	ВЫБОР
	        |		КОГДА ТекущиеПрава.Пользователь ЕСТЬ NULL
	        |			ТОГДА ИСТИНА
	        |		ИНАЧЕ ЛОЖЬ
	        |	КОНЕЦ КАК ДобавитьПраво,
	        |	ЕСТЬNULL(НужныПрава.Проект, ТекущиеПрава.Проект) КАК Проект
	        |ПОМЕСТИТЬ ИзмененияПравПользователей
	        |ИЗ
	        |	ТекущиеПрава КАК ТекущиеПрава
	        |		ПОЛНОЕ СОЕДИНЕНИЕ НужныПрава КАК НужныПрава
	        |		ПО ТекущиеПрава.Проект = НужныПрава.Проект
	        |			И ТекущиеПрава.Пользователь = НужныПрава.Пользователь
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ИзмененияПравПользователей.Пользователь КАК Пользователь,
	        |	ИзмененияПравПользователей.Проект КАК Проект,
	        |	ИзмененияПравПользователей.ДобавитьПраво КАК ДобавитьПраво,
	        |	ИзмененияПравПользователей.УдалитьПраво КАК УдалитьПраво
	        |ПОМЕСТИТЬ ПользователиСИзмененнымиПравами
	        |ИЗ
	        |	ИзмененияПравПользователей КАК ИзмененияПравПользователей
	        |ГДЕ
	        |	(ИзмененияПравПользователей.УдалитьПраво
	        |			ИЛИ ИзмененияПравПользователей.ДобавитьПраво)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПользователиСИзмененнымиПравами.Пользователь КАК Пользователь,
	        |	ПользователиСИзмененнымиПравами.Проект КАК Проект,
	        |	упоОграниченияДоступаПоПроектам.ГруппаДоступа КАК ГруппаДоступа,
	        |	ПользователиСИзмененнымиПравами.ДобавитьПраво КАК ДобавитьПраво,
	        |	ПользователиСИзмененнымиПравами.УдалитьПраво КАК УдалитьПраво
	        |ИЗ
	        |	ПользователиСИзмененнымиПравами КАК ПользователиСИзмененнымиПравами
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоОграниченияДоступаПоПроектам КАК упоОграниченияДоступаПоПроектам
	        |		ПО ПользователиСИзмененнымиПравами.Пользователь = упоОграниченияДоступаПоПроектам.Пользователь
	        |			И (НЕ упоОграниченияДоступаПоПроектам.ПометкаУдаления)
	        |ИТОГИ ПО
	        |	Пользователь,
	        |	ГруппаДоступа";
	
КонецФункции 

Процедура ДобавитьВОчередьПересчетаДанныеИсточника(Источник)
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.упоОграниченияДоступаПоПроектам") Тогда
		ИмяРеквизитаИсточника = "Пользователь";
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.упоРегистрацияПроекта") 
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.упоИзменениеРуководителяПроекта") 
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.упоИзменениеРуководителяПроектнойЗадачи") Тогда
		ИмяРеквизитаИсточника = "Проект";
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.упоРегистрацияДиспетчера") 
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.упоОсвобождениеДиспетчера") Тогда
		ИмяРеквизитаИсточника = "Пользователь";
	Иначе
		Возврат; // Возврат
	КонецЕсли;
		
	ДобавитьВОчередь(Источник[ИмяРеквизитаИсточника]);
	
КонецПроцедуры

#КонецОбласти

