
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 28.07.2026
	Если Пользователи.РолиДоступны("ИКТ_ВсеПроекты") Тогда
		Возврат;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_Воронеж") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.Воронеж;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_Красноярск") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.Красноярск;
	ИначеЕсли Пользователи.РолиДоступны("ИКТ_РуководительПроекта_СанктПетербург") Тогда
		РодительВерхнегоУровняПоРоли = Справочники.упоПортфелиПроектов.СанктПетербург;
	Иначе
	    РодительВерхнегоУровняПоРоли = Неопределено;
	КонецЕсли;
	
	Если РодительВерхнегоУровняПоРоли <> Неопределено Тогда // Отбор по портфелям
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		    |	Т.Ссылка КАК Проект,
			|	Т.ПортфельПроектов КАК ПортфельПроектов
			|ИЗ
			|	РегистрСведений.упоСписокВыбораПроектов КАК Т");
		ВсеПроекты = Запрос.Выполнить().Выгрузить();

		ОтобранныеПроекты = Новый Массив;		
		Для каждого Строка из ВсеПроекты Цикл
			Если ЗначениеЗаполнено(Строка.ПортфельПроектов) Тогда
				Если РодительВерхнегоУровняПоРоли = ПолучитьВерхнегоРодителя(Строка.ПортфельПроектов) Тогда
					ОтобранныеПроекты.Добавить(Строка.Проект);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе  // Отбор по текущему пользователю в команде, куратору 
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	упоВыделенныеТрудовыеРесурсыСрезПоследних.Проект КАК Проект
			|ИЗ
			|	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО (Пользователи.упоОсновнойТрудовойРесурс = упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс)
			|			И Пользователи.Ссылка = &ТекущийПользователь
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	упоРуководителиПроектовСрезПоследних.Проект
			|ИЗ
			|	РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК упоРуководителиПроектовСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоДиспетчерыСистемы КАК упоДиспетчерыСистемы
			|		ПО (упоРуководителиПроектовСрезПоследних.РуководительПроекта = упоДиспетчерыСистемы.Сотрудник
			|			ИЛИ упоРуководителиПроектовСрезПоследних.КураторПроекта = упоДиспетчерыСистемы.Сотрудник)
			|				И упоДиспетчерыСистемы.Пользователь = &ТекущийПользователь");
		Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
		
		ОтобранныеПроекты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект"); 
	КонецЕсли;
		
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ПравоеЗначение = ОтобранныеПроекты;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Отбор.Использование = Истина;
	//[+]} ИКТ №20612
	
КонецПроцедуры

//{[+] ИКТ №20612 (фрагмент ДОБАВЛЕН), Новоселов, 05.08.2026 
Функция ПолучитьВерхнегоРодителя(Элемент)

	Возврат ?(ЗначениеЗаполнено(Элемент.Родитель), ПолучитьВерхнегоРодителя(Элемент.Родитель), Элемент)

КонецФункции
//[+]} ИКТ №20612