
&После("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//{[+] ИКТ №17652 (фрагмент ДОБАВЛЕН), Новоселов, 04.05.2026 Оповещения при новом задании	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИКТ_Параметры = Новый Структура;
	ИКТ_ЗаполнитьПараметрыОповещения(ИКТ_Параметры);
	
	НедоступныеТранспортыОтправкиОповещений = Новый СписокЗначений;
	НедоступныеТранспортыПроверкаИТС = упоОповещенияВызовСервера.НедоступныеТранспортыОтправкиОповещенийПроверкаИТС();
	НедоступныеТранспортыОтправкиОповещений.ЗагрузитьЗначения(НедоступныеТранспортыПроверкаИТС);
	
	НайденноеЗначение = НедоступныеТранспортыОтправкиОповещений.НайтиПоЗначению(ИКТ_Параметры.Транспорт);
	Если НайденноеЗначение <> Неопределено Тогда
		ШаблонСообщения = НСтр("ru = 'Отправка оповещений через транспорт ""%1"" доступна только при наличии активной подписки ИТС.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(НайденноеЗначение));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачуВыделяемыеРесурсы.НомерСтроки КАК НомерСтроки,
		|	упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачуВыделяемыеРесурсы.Ресурс,
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Документ.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу.ВыделяемыеРесурсы КАК упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачуВыделяемыеРесурсы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачуВыделяемыеРесурсы.Ресурс = Пользователи.упоОсновнойТрудовойРесурс
		|ГДЕ
		|	упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачуВыделяемыеРесурсы.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДопПараметры = Новый Структура("СообщениеОбОшибках, Отправить", "", Ложь);
		РезОтправки = упоОповещенияВызовСервера.ДобавитьСообщение(
			ИКТ_Параметры.ВидСобытия, Ссылка, Выборка.Ресурс, ИКТ_Параметры.ВидПолучателя, Выборка.Пользователь, ИКТ_Параметры.Транспорт, ДопПараметры);
		
		Если Не ПустаяСтрока(ДопПараметры.СообщениеОбОшибках) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(
				НСтр(
					"ru = 'По строке %1 возникла ошибка при добавлении сообщения в очередь:
					|%2'"),
				Выборка.НомерСтроки,
				ДопПараметры.СообщениеОбОшибках);
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если РезОтправки <> Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(
				НСтр("ru = 'Сообщение по строке %1 было успешно добавлено в очередь.'"),
				Выборка.НомерСтроки);
			Сообщение.Сообщить();		
		КонецЕсли;
	КонецЦикла;
	//[+]} ИКТ №17652
	
КонецПроцедуры

//{[+] ИКТ №17652 (фрагмент ДОБАВЛЕН), Новоселов, 04.05.2026
Процедура ИКТ_ЗаполнитьПараметрыОповещения(ИКТ_Параметры)

	ИКТ_Параметры.Вставить("ВидСобытия",	Справочники.упоВидыСобытий.НазначениеНаПЗ);
	ИКТ_Параметры.Вставить("ВидПолучателя",	Справочники.упоВидыПолучателейОповещений.Пользователи);
	ИКТ_Параметры.Вставить("Транспорт",		Справочники.упоТранспортОповещений.Email)

КонецПроцедуры
//[+]} ИКТ №17652