
#Область СлужебныйПрограммныйИнтерфейс

// См. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы
//
Процедура ПриНачалеРаботыСистемы() Экспорт

	ПроверятьЛицензиюПриНачалеРаботыСистемы = упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ();
	
	Если Не ПроверятьЛицензиюПриНачалеРаботыСистемы Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОбОшибке = Ложь;
	ОписаниеОшибки = "";
	ЛицензияПодключена = ПроверитьПодключениеЛицензии(ОповеститьОбОшибке, ОписаниеОшибки);
	
	Если ЛицензияПодключена Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.упоПодключениеЗащитыPM");
	
КонецПроцедуры

Процедура ПроверкаЛицензирования() Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияПроверитьПодключениеЛицензии");
	ПодключитьОбработчикОжидания("ОбработчикОжиданияПроверитьПодключениеЛицензии", 60);
	
КонецПроцедуры

Функция ПроверитьПодключениеЛицензии(ОповеститьОбОшибке = Истина, ОписаниеОшибки = "") Экспорт
	
	ЛицензияПодключена = упоФункцииЗащитыСерверПовтИсп.МожноИспользоватьЗащищенныйКод();
	
	Если ЛицензияПодключена Тогда
		ОтключитьОбработчикОжидания("ОбработчикОжиданияПроверитьПодключениеЛицензии");
		Возврат ЛицензияПодключена;
	КонецЕсли;
	
	Если ОповеститьОбОшибке Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьНажатиеНаОповещениеЛицензирования", ЭтотОбъект);
		ТекстОповещения = НСтр("ru = 'Ошибка подключения лицензии'");
		ОписаниеОшибки = НСтр("ru = 'Ключ защиты не доступен; работа с функционалом ограничена.'");
		
		ПоказатьОповещениеПользователя(ТекстОповещения,
			ОписаниеОповещения,
			ОписаниеОшибки,
			,
			СтатусОповещенияПользователя.Важное);
		
	КонецЕсли;
	
	Возврат ЛицензияПодключена;
	
КонецФункции

Процедура ОбработатьНажатиеНаОповещениеЛицензирования(Параметры = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Обработка.слкМенеджерЛицензий.Форма", 
		ПараметрыФормы,
		,
		,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#КонецОбласти
