
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// {УПФ}
	упоИнтеграцияУПФСервер.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// {/УПФ}
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_упоСписокВыборЗначения(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// {УПФ}
	упоИнтеграцияУПФКлиент.ОповеститьОВыбореКлассификатораЕдИзм(ЭтотОбъект, ВыбранноеЗначение);
	// {/УПФ}
КонецПроцедуры	
	
#КонецОбласти
