#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборПоКомпоненту = Перечисления.упоКомпоненты.Проект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьГруппировки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура БыстрыйПоискПриИзменении(Элемент)
	
	УстановитьБыстрыйОтбор(БыстрыйПоиск);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКомпонентуПриИзменении(Элемент)
	
	УстановитьОтборПоКомпоненту(ОтборПоКомпоненту);
	УстановитьГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДан = Элементы.Список.ТекущиеДанные;
	
	Если ТекДан.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	Если Выбранные.НайтиПоЗначению(ТекДан.Проект) = Неопределено Тогда
		Выбранные.Добавить(ТекДан.Проект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ОповеститьОВыборе(Выбранные);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ВыбранныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого СтрокаТЧ Из ВыбранныеСтроки Цикл
		
		Если ТипЗнч(СтрокаТЧ) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		Выбранные.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьВсе(Команда)

	ВсеСтроки = ПолучитьВсеПроекты();

    Выбранные.ЗагрузитьЗначения(ВсеСтроки);
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция УстановитьБыстрыйОтбор(пСтрокаОтбора) 
	
	СтрокаОтбора = СокрЛП(пСтрокаОтбора);
	
	Использование = ЗначениеЗаполнено(СтрокаОтбора);
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			И ЭлементОтбора.Представление = "БыстрыйПоиск"
			И ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			
			ГруппаОтбора = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	ГруппаОтбора.Использование = Использование;
	Группировки = Список.Группировка.Элементы;
	
	Если Использование Тогда
		
		Для Каждого ЭлементОтбора Из ГруппаОтбора.Элементы Цикл
			ЭлементОтбора.ПравоеЗначение = СтрокаОтбора;
		КонецЦикла;
		
		// Убираем группировку, чтобы при поиске найденные строки выводились списком		
		Для Каждого ПолеГруппировки Из Группировки Цикл
			ПолеГруппировки.Использование = Ложь;
		КонецЦикла;
		
	Иначе	
		
		// Возвращаем убранные ранее группировки
		Для Каждого ПолеГруппировки Из Группировки Цикл
			ПолеГруппировки.Использование = Истина;
		КонецЦикла;
		
		Элементы.Список.ТекущаяСтрока = упоТекущийПроект;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоКомпоненту(ЗначениеОтбора)
	
	Использование = ЗначениеЗаполнено(ЗначениеОтбора);
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.Представление = "ОтборПоКомпоненту" 
			И ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	ЭлементОтбора.Использование = Использование;	
	Если Использование Тогда
		ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГруппировки()

	Список.Группировка.Элементы.Очистить();
		
	Если Не (упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Корп() 
		И ОтборПоКомпоненту = ПредопределенноеЗначение("Перечисление.упоКомпоненты.ПрограммаПроектов")) Тогда
		
		НоваяГруппировка = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НоваяГруппировка.Использование = Истина;
		НоваяГруппировка.Поле = Новый ПолеКомпоновкиДанных("ПортфельПроектов");
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсеПроекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Т.Ссылка КАК Проект
	               |ИЗ
	               |	РегистрСведений.упоСписокВыбораПроектов КАК Т";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивПроектов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПроектов.Добавить(Выборка.Проект);
	КонецЦикла;
	
	Возврат МассивПроектов;
	
КонецФункции

#КонецОбласти
