////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции общего назначения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. упоФункцииОбщегоНазначенияСервер.ЗаполнитьСтрокуПоУмолчанию
//
Функция ЗаполнитьСтрокуПоУмолчанию(Форма,
	Проект,
	ИмяКонтрагента,
	ИмяДоговора,
	СтрокаТЧ = Неопределено,
	ИмяТаблицы = "") Экспорт
	
	Возврат упоФункцииОбщегоНазначенияСервер.ЗаполнитьСтрокуПоУмолчанию(Форма,
		Проект,
		ИмяКонтрагента,
		ИмяДоговора,
		СтрокаТЧ,
		ИмяТаблицы);
	
КонецФункции

// Возвращает значения реквизитов объекта. См. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
//
// Параметры:
//  Ссылка		 - ЛюбаяСсылка
//  Реквизиты	 - Строка, Структура
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьСвойстваОбъекта(Ссылка, Реквизиты) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
КонецФункции

// Возвращает значения реквизитов объекта. См. ОбщегоНазначения.ЗначениеРеквизитаОбъекта.
//
// Параметры:
//  Ссылка	 - ЛюбаяСсылка
//  Свойство - Строка
// 
// Возвращаемое значение:
//  Произвольное
//
Функция ПолучитьСвойствоОбъекта(Ссылка, Свойство) Экспорт 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Свойство);
КонецФункции 

#КонецОбласти