
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяКоллекцииИконок") Тогда
		Элементы.Картинки.КартинкаСтрок = БиблиотекаКартинок[Параметры.ИмяКоллекцииИконок];		
	КонецЕсли; 
		
	Для Сч = 0 По ?(Параметры.Свойство("КоличествоИконок"), Параметры.КоличествоИконок, 105) Цикл
		НС = Картинки.Добавить();
		НС.Картинка = Сч;
		НС.Наименование = "Картинка №" + Сч;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьКартинку();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьКартинку();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьКартинку()
	
	 ТекДанные = Элементы.Картинки.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Закрыть(ТекДанные.Картинка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
