
Процедура ПриКопировании(ОбъектКопирования)
	//ГрафикСменности.Очистить();
	//Ответственный = Справочники.Пользователи.ПустаяСсылка();
	//
	//Для каждого стр Из ОбъектКопирования.ГрафикСменности Цикл
	//	НовыйГрафикСменности = ГрафикСменности.Добавить();
	//	
	//	НовыйГрафикСменности.Бригадир = стр.Бригадир;
	//КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр ИКТ_ОтработанноеВремяИзСКУД 
	Движения.ИКТ_ОтработанноеВремяИзСКУД.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ИКТ_ВводДанныхСКУДВходыВыходы.ПервыйВход, ДЕНЬ) КАК Дата,
	|	ИКТ_ВводДанныхСКУДВходыВыходы.Сотрудник,
	|	ИКТ_ВводДанныхСКУДВходыВыходы.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя) КАК ВидУчетаВремени,
	|	1 КАК Дни,
	|	СУММА(ВЫБОР
	|			КОГДА ИКТ_ВводДанныхСКУДВходыВыходы.ПоследнийВыход <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВЫРАЗИТЬ(РАЗНОСТЬДАТ(ИКТ_ВводДанныхСКУДВходыВыходы.ПервыйВход, ИКТ_ВводДанныхСКУДВходыВыходы.ПоследнийВыход, МИНУТА) / 60 КАК ЧИСЛО(5, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Часы,
	|	МИНИМУМ(ИКТ_ВводДанныхСКУДВходыВыходы.ПервыйВход) КАК ПервыйВход,
	|	МАКСИМУМ(ИКТ_ВводДанныхСКУДВходыВыходы.ПоследнийВыход) КАК ПоследнийВыход
	|ИЗ
	|	Документ.ИКТ_ВводДанныхСКУД.ВходыВыходы КАК ИКТ_ВводДанныхСКУДВходыВыходы
	|ГДЕ
	|	ИКТ_ВводДанныхСКУДВходыВыходы.Ссылка = &Ссылка
	|	И ИКТ_ВводДанныхСКУДВходыВыходы.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И (РАЗНОСТЬДАТ(ИКТ_ВводДанныхСКУДВходыВыходы.ПервыйВход, ИКТ_ВводДанныхСКУДВходыВыходы.ПоследнийВыход, МИНУТА) > 60
	|			ИЛИ ИКТ_ВводДанныхСКУДВходыВыходы.ПоследнийВыход = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	ИКТ_ВводДанныхСКУДВходыВыходы.Сотрудник,
	|	НАЧАЛОПЕРИОДА(ИКТ_ВводДанныхСКУДВходыВыходы.ПервыйВход, ДЕНЬ),
	|	ИКТ_ВводДанныхСКУДВходыВыходы.Ссылка.ПериодРегистрации";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ИКТ_ОтработанноеВремяИзСКУД.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;

КонецПроцедуры
