
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
//	СтруктураПараметров - Структура - параметры.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти, 
	СтруктураПараметров = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//	Объект				- ДокументСсылка.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу - документ-источник.
//  ИмяТабличнойЧасти 	- Строка - Имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект, ИмяТабличнойЧасти) Экспорт
	
	// Формируем запрос
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", Объект.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект));	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатрат,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ВариантРаспределения,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатратПоУровнюПланирования
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Версия = &текВерсия) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен
	               |АВТОУПОРЯДОЧИВАНИЕ";
			
	// Запускаем запрос
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Подготовить таблицу трудовых ресурсов Проектной задачи.
//
// Параметры:
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - проектная задача.
//	УникальныйИдентификаторДляВременногоХранилища - УникальныйИдентификатор - УИД временного хранилища.
// 
// Возвращаемое значение:
//  Строка - адрес во временном хранилище.
//
Функция ПодготовитьТаблицуТрудовыхРесурсовПроектнойЗадачи(ПроектнаяЗадача,
	УникальныйИдентификаторДляВременногоХранилища) Экспорт
	
	Перем ТаблицаОтбора;
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);
	
	НоваяСтрока = ТаблицаОтбора.Добавить();
	НоваяСтрока.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	НоваяСтрока.ВидСравнения  	= ВидСравненияКомпоновкиДанных.ВСписке;
	НоваяСтрока.Применение 		= ТипПримененияОтбораКомпоновкиДанных.Элементы;
	НоваяСтрока.Использование 	= Истина;
	НоваяСтрока.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	
	ЗапросТР = Новый Запрос;
	ЗапросТР.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                  |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Роль
	                  |ПОМЕСТИТЬ ВТ_РолиПЗ
	                  |ИЗ
	                  |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	                  |			,
	                  |			Версия = &Версия
	                  |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	                  |ГДЕ
	                  |	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
	                  |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость <> 0
	                  |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость <> 0)
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                  |	упоРолиТрудовыхРесурсовСрезПоследних.Ресурс КАК Ссылка
	                  |ИЗ
	                  |	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(
	                  |			,
	                  |			Роль В
	                  |				(ВЫБРАТЬ
	                  |					ВТ_РолиПЗ.Роль
	                  |				ИЗ
	                  |					ВТ_РолиПЗ КАК ВТ_РолиПЗ)) КАК упоРолиТрудовыхРесурсовСрезПоследних
	                  |ГДЕ
	                  |	упоРолиТрудовыхРесурсовСрезПоследних.РольНазначена";
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ПроектнаяЗадача);
	
	ЗапросТР.УстановитьПараметр("Версия", ТекВерсия);
	ЗапросТР.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	
	Результат = ЗапросТР.Выполнить();
	Если Результат.Пустой() Тогда
		МассивТР = Новый Массив;
	Иначе
		МассивТР = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	СписокТР = Новый СписокЗначений;
	СписокТР.ЗагрузитьЗначения(МассивТР);
	
	НоваяСтрока.ПравоеЗначение = СписокТР;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, УникальныйИдентификаторДляВременногоХранилища);
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли