
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем текущаяВерсия;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки.
		СтруктураОбязательныхПолей.Вставить("Проект");
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадача");
	ИначеЕсли ИмяТабличнойЧасти = "ВыделяемыеРесурсы" Тогда
		// Формирование структуры обязательных реквизитов табличной части ВыделяемыеРесурсы.
		СтруктураОбязательныхПолей.Вставить("Ресурс");
		СтруктураОбязательныхПолей.Вставить("РольРесурса");
		Если СвойстваПроекта.УказыватьПодразделениеРолиПриПланированииТР Тогда
			СтруктураОбязательныхПолей.Вставить("Подразделение");	
		КонецЕсли;
	ИначеЕсли ИмяТабличнойЧасти = "ОсвобождаемыеРесурсы" Тогда
		// Формирование структуры обязательных реквизитов табличной части ОсвобождаемыеРесурсы.
		СтруктураОбязательныхПолей.Вставить("Ресурс");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - Данные документа.
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеДокумента) = Тип("Структура") И ДанныеДокумента.Свойство("ЭтотОбъект")
		И ТипЗнч(ДанныеДокумента.ЭтотОбъект) = Тип("ДокументОбъект.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу") 
		И ДанныеДокумента.ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РесурсыВыделенные = ВыделяемыеРесурсы.Выгрузить(, "Ресурс, РольРесурса");
	РесурсыСнятые = ОсвобождаемыеРесурсы.Выгрузить(, "Ресурс, РольРесурса");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РД.Ресурс,
	               |	РД.РольРесурса
	               |ПОМЕСТИТЬ ВТРесурсыВыделенные
	               |ИЗ
	               |	&РесурсыВыделенные КАК РД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РД.Ресурс,
	               |	РД.РольРесурса
	               |ПОМЕСТИТЬ ВТРесурсыСнятые
	               |ИЗ
	               |	&РесурсыСнятые КАК РД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Влож.Ресурс
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТРесурсыВыделенные.Ресурс КАК Ресурс
	               |	ИЗ
	               |		ВТРесурсыВыделенные КАК ВТРесурсыВыделенные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТРесурсыСнятые.Ресурс
	               |	ИЗ
	               |		ВТРесурсыСнятые КАК ВТРесурсыСнятые) КАК Влож
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Влож.Ресурс
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(Влож.Ресурс) > 1";
	Запрос.УстановитьПараметр("РесурсыВыделенные", РесурсыВыделенные);
	Запрос.УстановитьПараметр("РесурсыСнятые", РесурсыСнятые);
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		// Все в порядке, ресурсы еще не были назначены на роли ПЗ.
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	МассивСообщениеОшибки = Новый Массив(3);
	МассивСообщениеОшибки[0] = НСтр("ru = 'Ресурс '");
	МассивСообщениеОшибки[2] = НСтр("ru = ' присутствует в документе несколько раз'");
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСообщениеОшибки[1] = Выборка.Ресурс;
				
		ТекстОшибки = СтрСоединить(МассивСообщениеОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЦикла;
			
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов при заполнении заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	// Заполенние структуры обязательных полей шапки.
	СтруктураОбязательныхПолей.Вставить("Проект");
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Функция формирует данные для заполнения заданной табличной части.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя табличной части.
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	// Формируем запрос
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатрат,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ВариантРаспределения,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатратПоУровнюПланирования
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Версия = &текВерсия) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен
	               |АВТОУПОРЯДОЧИВАНИЕ";
			
	// Запускаем запрос
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Правила для регистра "ВыделенныеТрудовыеРесурсы"
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоВыделенныеТрудовыеРесурсы.Метаданные().Имя, Правила);
	
	// Правила для табличной части "ВыделяемыеРесурсы" документа
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ВыделяемыеРесурсы", ПравилаТаблицы);
	
	// Делаем одно движение по данной ТЧ
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ВыделениеРесурсовНаПроект", ПравилаДвижения);
	
	// Правила связи
	ПравилаДвижения.Вставить("Версия", 		Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("Проект", "Шапка_Проект");
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Ресурс", "Ресурс");
	ПравилаДвижения.Вставить("РольРесурса", "РольРесурса");
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("РесурсВыделен", Новый Структура("Значение", Истина));
	ПравилаДвижения.Вставить("ДоляТрудозатрат", "ДоляТрудозатрат");
	ПравилаДвижения.Вставить("ВариантРаспределения", "ВариантРаспределения");
	ПравилаДвижения.Вставить("ДоляТрудозатратПоУровнюПланирования", "ДоляТрудозатратПоУровнюПланирования");
	
	// Правила для табличной части "ОсвобождаемыеРесурсы" документа
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ОсвобождаемыеРесурсы", ПравилаТаблицы);
	
	// Делаем одно движение по данной ТЧ
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОсвобождениеРесурсовСПроекта", ПравилаДвижения);
	
	// Правила связи
	ПравилаДвижения.Вставить("Версия", 		Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("Проект", "Шапка_Проект");
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Ресурс", "Ресурс");
	ПравилаДвижения.Вставить("РольРесурса", "РольРесурса");
	ПравилаДвижения.Вставить("Подразделение", "Подразделение");
	ПравилаДвижения.Вставить("РесурсВыделен", Новый Структура("Значение", Ложь));
	ПравилаДвижения.Вставить("ДоляТрудозатрат", Новый Структура("Значение", 0));	
	
	// Правила готовы
	Возврат ПравилаНаложения; 

КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда 
		Возврат;
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Проект = Основание.Проект;
		ПроектнаяЗадача = Основание.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	Если НЕ Отказ Тогда
		
		Движения.упоВыделенныеТрудовыеРесурсы.Записать();		
		
		Если ДополнительныеСвойства.Свойство("ВыполнитьДвиженияПоРегиструТрудозатратыПоДням") Тогда
			ВыполнитьДвиженияПоРегиструТрудозатратыПоДням = ДополнительныеСвойства.ВыполнитьДвиженияПоРегиструТрудозатратыПоДням;	
		Иначе
			ВыполнитьДвиженияПоРегиструТрудозатратыПоДням = Истина;
		КонецЕсли;
		Если ВыполнитьДвиженияПоРегиструТрудозатратыПоДням Тогда		
			упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(ПроектнаяЗадача, ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		упоЗадания.СинхронизироватьПорученияЗадач(ПроектнаяЗадача, ПроектнаяЗадача);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(ПроектнаяЗадача, ЭтотОбъект.Ссылка);
	
	упоЗадания.СинхронизироватьПорученияЗадач(ПроектнаяЗадача, Неопределено);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли