#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает последний актуальный документ изменения договора, за исключением переданного в параметре ДоговорИсключение.
//
// Параметры:
//  Договор - ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора - Ссылка на договор.
//  ДоговорИсключение - ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора - Ссылка на договор-исключение.
//
// Возвращаемое значение:
//  ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора   - Ссылка на дополнительное соглашение.
//
Функция ПолучитьПоследнийАктуальныйДокументИзмененияДоговора(Договор, ДоговорИсключение = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальнаяВерсияДоговораСрезПоследних.АктуальноеИзменениеДоговора КАК ИзменениеДоговора
	               |ИЗ
	               |	РегистрСведений.упоАктуальнаяВерсияДоговора.СрезПоследних(
	               |			&МоментВремени,
	               |			Договор = &Договор
	               |				И &АктуальноеИзменениеДоговора) КАК упоАктуальнаяВерсияДоговораСрезПоследних
	               |ГДЕ
	               |	упоАктуальнаяВерсияДоговораСрезПоследних.АктуальноеИзменениеДоговора.Проведен";
												
	Если ДоговорИсключение = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&МоментВремени", "");
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&АктуальноеИзменениеДоговора", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&АктуальноеИзменениеДоговора", "АктуальноеИзменениеДоговора <> &ДоговорИсключение");
	КонецЕсли;
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ДоговорИсключение", ДоговорИсключение);
	Запрос.УстановитьПараметр("МоментВремени", ?(ЗначениеЗаполнено(ДоговорИсключение), ДоговорИсключение.Дата, ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.ИзменениеДоговора;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.упоИзменениеСтатусаДоговора.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРегистрацияЮридическихУсловийДоговора);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ЭтоДополнительноеСоглашение");
	
КонецПроцедуры
 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные <> Неопределено 
		И Данные.Свойство("Номер") 
		И Данные.Свойство("Дата") 
		И Данные.Свойство("ЭтоДополнительноеСоглашение") Тогда
		Если Данные.ЭтоДополнительноеСоглашение Тогда
			Представление = НСтр("ru = 'Дополнительное соглашение %1 от %2'");
		Иначе	
			Представление = НСтр("ru = 'Регистрация юридических условий договора %1 от %2'");
		КонецЕсли;	
		
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, СокрЛП(Данные.Номер), Строка(Данные.Дата));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли