
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // нет внутренних печатных форм.
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт
	
	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	  
	Правила = Новый Структура();	
	
	ПравилаНаложения.Вставить(Движения.упоАктуальнаяВерсияДоговора.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("АктуальныйДоговор", ПравилаДвижения);
	
	Если ЭтоДополнительноеСоглашение Тогда
		ПравилаДвижения.Вставить("Договор", 					"Шапка_ДокументОснование");
		ПравилаДвижения.Вставить("АктуальноеИзменениеДоговора", "Шапка_Ссылка");
	Иначе
		ПравилаДвижения.Вставить("Договор", 					"Шапка_Ссылка");
	КонецЕсли;
	
	ПравилаупоЭтапыДоговора = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоЭтапыДоговора.Метаданные().Имя, ПравилаупоЭтапыДоговора);
	
	ПравилаТаблицы = Новый Структура();	
	ПравилаупоЭтапыДоговора.Вставить("Этапы", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("Этапы", ПравилаДвижения);
	ПравилаДвижения.Вставить("ДокументИзменения",			"Шапка_Ссылка");
	ПравилаДвижения.Вставить("Этап",						"Этап");
	ПравилаДвижения.Вставить("ЮридическиеУсловияДоговора",	"Шапка_Ссылка");
	ПравилаДвижения.Вставить("ЭтапРодитель",				"ЭтапРодитель");
	ПравилаДвижения.Вставить("ДатаНачала",					"ДатаНачала");
	ПравилаДвижения.Вставить("ДатаОкончания",				"ДатаОкончания");
	ПравилаДвижения.Вставить("Сумма",						"Сумма");
	
	ПравилаупоГрафикОплатыПоДоговору = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоГрафикОплатыПоДоговору.Метаданные().Имя, ПравилаупоГрафикОплатыПоДоговору);
	
	ПравилаТаблицы = Новый Структура();	
	ПравилаупоГрафикОплатыПоДоговору.Вставить("ГрафикОплаты", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ГрафикОплаты", ПравилаДвижения);
	ПравилаДвижения.Вставить("ДокументИзменения",			"Шапка_Ссылка");
	ПравилаДвижения.Вставить("Этап",						"Этап");
	ПравилаДвижения.Вставить("Статья",						"Статья");
	ПравилаДвижения.Вставить("Задержка",					"Задержка");
	ПравилаДвижения.Вставить("Сумма",						"Сумма");
	ПравилаДвижения.Вставить("ДатаОплаты",					"ДатаОплаты");
	
	
	ПравилаупоСвязьЭтаповДоговораСПроектнымКонтуром = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСвязьЭтаповДоговораСПроектнымКонтуром.Метаданные().Имя, 
		ПравилаупоСвязьЭтаповДоговораСПроектнымКонтуром);
	
	ПравилаТаблицы = Новый Структура();	
	ПравилаупоСвязьЭтаповДоговораСПроектнымКонтуром.Вставить("СвязиЭтаповДоговораСПроектнымКонтуром", ПравилаТаблицы);
	Если ЭтотОбъект.ИспользоватьЭтапы ИЛИ (ЭтоДополнительноеСоглашение И ДокументОснование.ИспользоватьЭтапы) Тогда 
		ПравилаДвижения = Новый Структура();
		ПравилаТаблицы.Вставить("СвязиЭтаповДоговораСПроектнымКонтуром", ПравилаДвижения);
		ПравилаДвижения.Вставить("ДокументИзменения",			"Шапка_Ссылка");
		Если ЭтоДополнительноеСоглашение Тогда
			ПравилаДвижения.Вставить("ЮридическиеУсловияДоговора",	"Шапка_ДокументОснование");
		Иначе	
			ПравилаДвижения.Вставить("ЮридическиеУсловияДоговора",	"Шапка_Ссылка");
		КонецЕсли;	
		ПравилаДвижения.Вставить("ЭтапДоговора",				"ЭтапДоговора");
		ПравилаДвижения.Вставить("ДоговорКонтрагента",			"ДоговорКонтрагента");
		ПравилаДвижения.Вставить("Проект",						"Проект");
		ПравилаДвижения.Вставить("ПроектнаяЗадача",				"ПроектнаяЗадача");
	КонецЕсли;
	
	Возврат ПравилаНаложения; 
	
КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()

// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	ДанныеДвижений.упоГрафикОплатыПоДоговору.Свернуть("ДокументИзменения, Этап, Статья, ДатаОплаты, Активность, Период, МоментВремени", "Задержка, Сумма");
	
КонецПроцедуры // ПодготовитьДанныеДвижений()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
		
	ОдинЭтапДоговораСвязанСОднимЭтапомПроекта = Истина;
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда
		Проект           = Основание;
		Организация      = упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(Основание, "Организация");
	ИначеЕсли ТипЗнч(Основание) = Тип("Структура") И Основание.Свойство("ЭтоДополнительноеСоглашение") Тогда
		ЭтотОбъект.ЭтоДополнительноеСоглашение = Основание.ЭтоДополнительноеСоглашение;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора") Тогда
		ДокументОснование = ПолучитьОсновнойРегистраторЮридическихУсловийДоговора(Основание);
		АктуальныйДокументРегистраторЮридическихУсловийДоговора = Документы.упоРегистрацияЮридическихУсловийДоговора.ПолучитьПоследнийАктуальныйДокументИзмененияДоговора(ДокументОснование);
		Если Не ЗначениеЗаполнено(АктуальныйДокументРегистраторЮридическихУсловийДоговора) Тогда
			АктуальныйДокументРегистраторЮридическихУсловийДоговора = ДокументОснование;
		КонецЕсли;

		ЭтоДополнительноеСоглашение = Истина;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект , Основание,
			"Контрагент, Организация, ВидДоговора, ИспользоватьЭтапы, Валюта, ТипЮридическихУсловийДоговора");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект , АктуальныйДокументРегистраторЮридическихУсловийДоговора,
			"ДетализацияПоДоговорамВзаиморасчетов, ДоговорВзаиморасчетов, ПоКаждомуЭтапуОтдельныйДоговорВзаиморасчетов, 
			|ДоговорСвязанСНесколькимиПроектами, Проект, ОдинЭтапДоговораСвязанСОднимЭтапомПроекта, СхемаОплаты, СпособУчетаАванса");
		ЭтотОбъект.СвязиЭтаповДоговораСПроектнымКонтуром.Загрузить(АктуальныйДокументРегистраторЮридическихУсловийДоговора.СвязиЭтаповДоговораСПроектнымКонтуром.Выгрузить());
		ЭтотОбъект.Этапы.Загрузить(АктуальныйДокументРегистраторЮридическихУсловийДоговора.Этапы.Выгрузить());
		ЭтотОбъект.ГрафикНачислений.Загрузить(АктуальныйДокументРегистраторЮридическихУсловийДоговора.ГрафикНачислений.Выгрузить());
		ЭтотОбъект.ГрафикОплаты.Загрузить(АктуальныйДокументРегистраторЮридическихУсловийДоговора.ГрафикОплаты.Выгрузить());
		ЭтотОбъект.СуммаДоговора = АктуальныйДокументРегистраторЮридическихУсловийДоговора.СуммаДоговора;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	Проект = Справочники.Проекты.ПустаяСсылка();
	ДокументОснование = Документы.упоРегистрацияЮридическихУсловийДоговора.ПустаяСсылка();
			
КонецПроцедуры // ПриКопировании()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.НомерДоговора) Тогда
		ЭтотОбъект.НомерДоговора = ЭтотОбъект.Номер;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда 
		упоУправлениеДоговорамиСервер.УстановитьПредставлениеДоговора(ЭтотОбъект, "Номер");
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	упоУправлениеДоговорамиСервер.ПроверитьВозможностьПроведенияДокументаРЮУДиДопоСогл(Ссылка, Отказ);
	Если НЕ Отказ = Истина Тогда 
		упоУправлениеДоговорамиСервер.АктуализироватьСтатусСправочникаДоговорыКонтрагентов(Ссылка, Ссылка, , "Проведение");
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	упоУправлениеДоговорамиСервер.АктуализироватьСтатусСправочникаДоговорыКонтрагентов(Ссылка, Ссылка, , "ОтменаПроведения");
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоДополнительноеСоглашение Тогда
		
		МассивНепроверяемыхРеквизитов = Новый Массив();
		МассивНепроверяемыхРеквизитов.Добавить("ВидДоговора");
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Валюта");
		
		Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл  			
			ПорядковыйНомер = ПроверяемыеРеквизиты.Найти(ЭлементМассива);
			Если ПорядковыйНомер <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ПорядковыйНомер);
			КонецЕсли; 			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	Если ЗначениеЗаполнено(Проект) Тогда
		СтрокаТаб.ЗначениеДоступа = Проект;
	Иначе
		СтрокаТаб.ЗначениеДоступа = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьОсновнойРегистраторЮридическихУсловийДоговора(ДокументОснование) Экспорт
	
	Если упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(ДокументОснование, "ЭтоДополнительноеСоглашение") Тогда
		Возврат ПолучитьОсновнойРегистраторЮридическихУсловийДоговора(
			упоФункцииБСП.ЗначениеРеквизитаОбъектаВызовСервера(ДокументОснование, "ДокументОснование"));
	Иначе
		Возврат ДокументОснование;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли