////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции проверки заполнения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция проверяет заполнение обязательных реквизитов объекта
// и формирует строку сообщений в случае незаполненности реквизитов.
// 
// Параметры: 
//  Объект			 - ОбъектСсылка 	- содержит ссылку на проверяемый объект.
//  ИмяТЧ			 - Строка 		- имя проверяемой табличной части.
//  СтрокаСообщений  - Строка 		- содержит строку сообщений.
// 
// Возвращаемое значение: 
//  Булево - Истина - все поля заполнены; Ложь - есть незаполненные поля.
// 
Функция ПроверитьЗаполнениеПолейШапки(Знач Объект, ИмяТЧ, СтрокаСообщений = "") Экспорт
	
	СтруктураОбязательныхПолей = упоЗаполнениеИПодборСервер.ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(Объект, ИмяТЧ);
	
	МетаданныеРеквизиты = Объект.Ссылка.Метаданные().Реквизиты;
	
	ПризнакЗаполнения = Истина;
	
	// Цикл по проверяемым полям
	Для Каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

		Значение = Объект[КлючЗначение.Ключ];
		Если НЕ ЗначениеЗаполнено(Значение) Тогда 
			
			Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда 
				// Отделить предопределенные поля
				ПризнакЗаполнения = Ложь;
				
				Если КлючЗначение.Ключ = "Код"
				 Или КлючЗначение.Ключ = "Наименование"
				 Или КлючЗначение.Ключ = "Владелец" Тогда
					ПредставлениеРеквизита = КлючЗначение.Ключ;
				Иначе
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
				КонецЕсли;
				
				Если Не СтрокаСообщений = "" Тогда
					СтрокаСообщений = СтрокаСообщений + Символы.ПС;
				КонецЕсли;
				СтрокаСообщений = СтрокаСообщений
								  + "Необходимо заполнить значение реквизита """
								  + СокрЛП(ПредставлениеРеквизита) + """";
			Иначе
				ПризнакЗаполнения = Ложь;
				
				Если Не СтрокаСообщений = "" Тогда
					СтрокаСообщений = СтрокаСообщений + Символы.ПС;
				КонецЕсли;
				СтрокаСообщений = СтрокаСообщений + КлючЗначение.Значение;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	Возврат ПризнакЗаполнения;
	
КонецФункции

#КонецОбласти