#Область ОписаниеПеременных

&НаКлиенте
Перем ТекстТ;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.упоСписокВыбораПроектов) Тогда 
		Отказ = Истина;		
	КонецЕсли;
	
	Если Не Отказ Тогда 
				
		упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Список, Отказ, СтандартнаяОбработка); 		
		
		упоТекущийПроект = ПараметрыСеанса.упоТекущийПроект;
		
		Элементы.Список.ТекущаяСтрока = упоТекущийПроект;	
				
		ОтборПоКомпоненту = Перечисления.упоКомпоненты.Проект;
		
		Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Корп() Тогда
			
			Если Параметры.Свойство("ОтборПоКомпоненту") Тогда
				ОтборПоКомпоненту = Параметры.ОтборПоКомпоненту;
			Иначе
				
				КомпонентТекущегоПроекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(упоТекущийПроект, "Компонент", Истина);				
				Если ЗначениеЗаполнено(КомпонентТекущегоПроекта) Тогда							
					ОтборПоКомпоненту = КомпонентТекущегоПроекта;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		упоРаботаСФормамиСервер.ДобавитьВызовОтчетовПроектаНаФорму(ЭтотОбъект, 
																	Элементы.ПодменюОтчеты, 
																	"КомандаОтчетаПроекта", 
																	"ОткрытьОтчет");
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом	
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КоманднаяПанельФормы);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	
	УстановитьОтборПоКомпоненту(ОтборПоКомпоненту);
	
	УстановитьВидимостьДоступностьЭлементов(ЭтаФорма);
	
	УстановитьГруппировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Список, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Список, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Список, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ИзмененСтатусПроекта" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Список, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Список, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Список, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ СПИСКА

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ВыбраннаяСтрока.Ключ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ Копирование И НЕ Группа Тогда
		Отказ = Истина;
		Основание = Новый Структура;
		Основание.Вставить("Наименование", БыстрыйПоиск);
		Основание.Вставить("Компонент", ОтборПоКомпоненту);
		ПараметрыНового = Новый Структура;
		ПараметрыНового.Вставить("Основание", Основание);
		ОткрытьФорму("Справочник.Проекты.ФормаОбъекта", ПараметрыНового, Элементы.Список);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура КомандаСделатьТекущим(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.Свойство("Проект") Тогда
		упоПроектыИЗадачиКлиент.УстановитьПроектТекущим(ТекДанные.Проект, ЭтаФорма);
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Команда не может быть выполнена для указанного объекта!'");
		упоРаботаСДиалогамиКлиент.упоПредупреждение(ТекстПредупреждения, 5);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйПоискПриИзменении(Элемент)
	УстановитьБыстрыйОтбор(БыстрыйПоиск); 
КонецПроцедуры

&НаКлиенте
Функция УстановитьБыстрыйОтбор(пСтрокаОтбора) 
	
	СтрокаОтбора = СокрЛП(пСтрокаОтбора);
	
	Использование = ЗначениеЗаполнено(СтрокаОтбора);
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			И ЭлементОтбора.Представление = "БыстрыйПоиск"
			И ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			
			ГруппаОтбора = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	ГруппаОтбора.Использование = Использование;
	Группировки = Список.Группировка.Элементы;
	
	Если Использование Тогда
		
		Для Каждого ЭлементОтбора Из ГруппаОтбора.Элементы Цикл
			ЭлементОтбора.ПравоеЗначение = СтрокаОтбора;
		КонецЦикла;
		
		// Убираем группировку, чтобы при поиске найденные строки выводились списком		
		Для Каждого ПолеГруппировки Из Группировки Цикл
			ПолеГруппировки.Использование = Ложь;
		КонецЦикла;
		
	Иначе	
		
		// Возвращаем убранные ранее группировки
		Для Каждого ПолеГруппировки Из Группировки Цикл
			ПолеГруппировки.Использование = Истина;
		КонецЦикла;
		
		Элементы.Список.ТекущаяСтрока = упоТекущийПроект;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтборПоКомпонентуПриИзменении(Элемент)
	УстановитьОтборПоКомпоненту(ОтборПоКомпоненту);
	УстановитьГруппировки();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКомпоненту(ЗначениеОтбора)
	
	Использование = ЗначениеЗаполнено(ЗначениеОтбора);
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.Представление = "ОтборПоКомпоненту" 
			И ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	ЭлементОтбора.Использование = Использование;
	Если Использование Тогда
		ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГруппировки()

	Список.Группировка.Элементы.Очистить();
		
	Если Не (упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Корп() 
		И ОтборПоКомпоненту = ПредопределенноеЗначение("Перечисление.упоКомпоненты.ПрограммаПроектов")) Тогда
		
		НоваяГруппировка = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НоваяГруппировка.Использование = Истина;
		НоваяГруппировка.Поле = Новый ПолеКомпоновкиДанных("ПортфельПроектов");;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементов(ЭтаФорма)
	
	Видимость = упоИнтеграцияКлиентСервер.ИспользуетсяОтборПоКомпонентамВСпискеПроектов();
	
	ЭтаФорма.Элементы.ОтборПоКомпоненту.Видимость = Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда) 
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ТекДанные.Свойство("Проект") Тогда
		упоРаботаСФормамиКлиент.ОткрытьОтчетПроектаПоСлужебнойКоманде(ЭтотОбъект, 
																		Команда, 
																		"КомандаОтчетаПроекта", 
																		ТекДанные.Проект);
	Иначе
		ВывестиПредупреждение(НСтр("ru = 'Команда не может быть выполнена для указанного объекта!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждение(ТекстПредупреждения, Таймаут = 0, Заголовок = "Предупреждение",
						   СписокПараметровЖурнала = Неопределено)
	
	упоРаботаСДиалогамиКлиент.упоПредупреждение(ТекстПредупреждения, Таймаут, Заголовок);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

////////////////////////////////////////////////////////////////////////////////
// УНИВЕРСАЛЬНЫЕ ОБРАБОТЧИКИ

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П6);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти
