
Функция ЭтоУОС(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ КАК ОбъектУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
		|ГДЕ
		|	ИКТ_СоответствиеОбъектов.ОбъектБУ ССЫЛКА Справочник.Организации
		|	И ИКТ_СоответствиеОбъектов.ОбъектУУ = &Организация";    
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции       

Функция ЭтоБухгалтерскаяОрганизация(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ КАК ОбъектУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
		|ГДЕ
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ ССЫЛКА Справочник.Организации
		|	И ИКТ_СоответствиеОбъектов.ОбъектБУ = &Организация";    
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции 

Функция ПолучитьОбъектУУ(ОбъектБУ) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ КАК ОбъектУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
		|ГДЕ
		|	ИКТ_СоответствиеОбъектов.ОбъектБУ = &ОбъектБУ";
	
	Запрос.УстановитьПараметр("ОбъектБУ", ОбъектБУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ОбъектУУ;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции     

Функция ПолучитьОбъектБУ(ОбъектУУ) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеОбъектов.ОбъектБУ КАК ОбъектБУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
		|ГДЕ
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ = &ОбъектУУ";
	
	Запрос.УстановитьПараметр("ОбъектУУ", ОбъектУУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ОбъектБУ;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции   

Функция ПолучитьДокументУУ(ДокументБУ) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
		|ГДЕ
		|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
	
	Запрос.УстановитьПараметр("ДокументБУ", ДокументБУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ДокументУУ;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции   

Функция ПолучитьДокументБУ(ДокументУУ) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
		|ГДЕ
		|	ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
	
	Запрос.УстановитьПараметр("ДокументУУ", ДокументУУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ДокументБУ;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции   

Функция ПолучитьСвязанныйОбъект(Организация, ПараметрОбъект) Экспорт  
	
	Если ЭтоБухгалтерскаяОрганизация(Организация) Тогда
		
		Возврат ПолучитьОбъектУУ(ПараметрОбъект); 
		
	ИначеЕсли ЭтоУОС(Организация) Тогда
		
		Возврат ПолучитьОбъектБУ(ПараметрОбъект);    
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;

КонецФункции     

Функция ПолучитьСвязанныйДокумент(Организация, ПараметрОбъект) Экспорт  
	
	Если НЕ ЗначениеЗаполнено(ПараметрОбъект) Тогда
	
		Возврат Неопределено;
	
	ИначеЕсли ЭтоБухгалтерскаяОрганизация(Организация) Тогда
		
		Возврат ПолучитьДокументУУ(ПараметрОбъект); 
		
	ИначеЕсли ЭтоУОС(Организация) Тогда
		
		Возврат ПолучитьДокументБУ(ПараметрОбъект);    
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;

КонецФункции  

Функция ВыполнитьЗаписьВСоответствиеДокументов(ДокументБУ, ДокументУУ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
		|ГДЕ
		|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ
		|	И ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
	
	Запрос.УстановитьПараметр("ДокументБУ", ДокументБУ.Ссылка);
	Запрос.УстановитьПараметр("ДокументУУ", ДокументУУ.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументБУ.Установить(ДокументБУ.Ссылка);
		НаборЗаписей.Отбор.ДокументУУ.Установить(ДокументУУ.Ссылка);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДокументБУ = ДокументБУ.Ссылка;
		НоваяЗапись.ДокументУУ = ДокументУУ.Ссылка;
		НаборЗаписей.Записать();  
		
	Иначе     
		
		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументБУ.Установить(ДокументБУ.Ссылка);   
		НаборЗаписей.Отбор.ДокументУУ.Установить(ДокументУУ.Ссылка);   
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
		
			Запись.ДокументБУ = ДокументБУ.Ссылка;
			Запись.ДокументУУ = ДокументУУ.Ссылка;
		
		КонецЦикла;
		
		НаборЗаписей.Записать();  
	
	КонецЕсли;

КонецФункции

Функция ВыполнитьЗаписьВСоответствиеОбъектов(ОбъектБУ, ОбъектУУ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеОбъектов.ОбъектБУ КАК ОбъектБУ,
		|	ИКТ_СоответствиеОбъектов.ОбъектУУ КАК ОбъектУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеОбъектов КАК ИКТ_СоответствиеОбъектов
		|ГДЕ
		|	ИКТ_СоответствиеОбъектов.ОбъектБУ = &ОбъектБУ
		|	И ИКТ_СоответствиеОбъектов.ОбъектУУ = &ОбъектУУ";
	
	Запрос.УстановитьПараметр("ОбъектБУ", ОбъектБУ.Ссылка);
	Запрос.УстановитьПараметр("ОбъектУУ", ОбъектУУ.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектБУ.Установить(ОбъектБУ.Ссылка);  
		НаборЗаписей.Очистить();
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ОбъектБУ = ОбъектБУ.Ссылка;
		НоваяЗапись.ОбъектУУ = ОбъектУУ.Ссылка;
		НаборЗаписей.Записать();  
		
	КонецЕсли;

КонецФункции

Функция ПолучитьСостояниеДокументаУУ(ДокументБУ, ДокументУУ) Экспорт   
	
	Если НЕ ЗначениеЗаполнено(ДокументУУ) Тогда
		
		Возврат Перечисления.ИКТ_СостояниеДокументовУОС.ДокументОтсутствует; 
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокументБУ) Тогда
		
		Возврат Перечисления.ИКТ_СостояниеДокументовУОС.ДокументОтсутствует;
	
	ИначеЕсли НЕ ПроверкаДокументовПройдена(ДокументБУ, ДокументУУ) Тогда
		
		Возврат Перечисления.ИКТ_СостояниеДокументовУОС.ДокументНеПрошелПроверку;   
		
	Иначе
		
		Возврат Перечисления.ИКТ_СостояниеДокументовУОС.ДокументСозданИПроверен;
	
	КонецЕсли;

КонецФункции         

Функция ПроверкаДокументовПройдена(ДокументБУ, ДокументУУ) Экспорт
	
	Отказ = Ложь;          
	
	Если ТипЗнч(ДокументБУ) <> ТипЗнч(ДокументУУ) Тогда
		Возврат Ложь;
	КонецЕсли;     
	
	Макет = ПолучитьОбщийМакет("ИКТ_РеквизитыДляПроверкиУОС");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(Макет);
	
	ПроверяемыеРеквизиты = "";
	
	Для Инд = 2 по ТабличныйДокумент.ВысотаТаблицы Цикл 
		
		ТипДокумента = ТабличныйДокумент.Область(Инд, 1).Текст;  
		
		Если Строка(ТипЗнч(ДокументБУ)) = ТипДокумента Тогда
			
			ПроверяемыеРеквизиты = ТабличныйДокумент.Область(Инд, 2).Текст;	
		    Прервать;
			
		КонецЕсли;
		
	КонецЦикла;   
	
	Если ПроверяемыеРеквизиты = "" Тогда
			
		Возврат Ложь;
	
	КонецЕсли;                                                                                                              
	
	МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроверяемыеРеквизиты, ",", Истина, Истина);  
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если ИмяРеквизита = "Организация" ИЛИ ИмяРеквизита = "Сотрудник" ИЛИ ИмяРеквизита = "Подразделение" Тогда
			
			РеквизитБУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБУ, ИмяРеквизита);
			РеквизитУУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументУУ, ИмяРеквизита);
			РеквизитУУРасчетный = ПолучитьОбъектУУ(РеквизитБУ);
			
			Если РеквизитУУ <> РеквизитУУРасчетный Тогда
				
				Отказ = Истина;	
				
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "Сотрудники.Сотрудник" Тогда  
			
			Если ДокументБУ.Сотрудники.Количество() <> ДокументУУ.Сотрудники.Количество() Тогда
			
				Отказ = Истина;	
			
			Иначе             
					
				ОрганизацияДокументБУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБУ, "Организация");	
			
				Для каждого СтрокаБУ Из ДокументБУ.Сотрудники Цикл 
					
					СотрудникБУ = СтрокаБУ.Сотрудник;
					
					СтрокаУУ = ДокументУУ.Сотрудники[СтрокаБУ.НомерСтроки - 1];
					СотрудникУУ = СтрокаУУ.Сотрудник; 
					СотрудникУУРасчетный = ПолучитьСвязанныйОбъект(ОрганизацияДокументБУ, СотрудникБУ);
				
					Если СотрудникУУРасчетный <> СотрудникУУ Тогда
						
						Отказ = Истина;	
						
					КонецЕсли;
				
				КонецЦикла;
			
			КонецЕсли;       
			
		ИначеЕсли ИмяРеквизита = "Сотрудники.ДатаНачала" Тогда  
			
			Если ДокументБУ.Сотрудники.Количество() <> ДокументУУ.Сотрудники.Количество() Тогда
			
				Отказ = Истина;	
			
			Иначе             
					
				Для каждого СтрокаБУ Из ДокументБУ.Сотрудники Цикл 
					
					ДатаНачалаБУ = СтрокаБУ.ДатаНачала;
					
					СтрокаУУ = ДокументУУ.Сотрудники[СтрокаБУ.НомерСтроки - 1];
					ДатаНачалаУУ = СтрокаУУ.ДатаНачала; 
				
					Если ДатаНачалаБУ <> ДатаНачалаУУ Тогда
						
						Отказ = Истина;	
						
					КонецЕсли;
				
				КонецЦикла;
			
			КонецЕсли;
			
		Иначе    
			
			РеквизитБУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБУ, ИмяРеквизита);
			РеквизитУУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументУУ, ИмяРеквизита);
			
			Если РеквизитБУ <> РеквизитУУ Тогда
				
				Отказ = Истина;	
				
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;         
	
	Если ДокументБУ.ПометкаУдаления Тогда
		Отказ = Истина;	
	Иначе
		Если НЕ ДокументБУ.Проведен Тогда
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
		
	Если ДокументУУ.ПометкаУдаления Тогда
		Отказ = Истина;	
	Иначе
		Если НЕ ДокументУУ.Проведен Тогда
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции 

Функция ВывестиСообщенияОПроверке(ДокументБУ, ДокументУУ, Статус) Экспорт
	
	Ошибки = Новый Массив;     
	Отказ = Ложь;
	
	Макет = ПолучитьОбщийМакет("ИКТ_РеквизитыДляПроверкиУОС");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(Макет);
	
	ПроверяемыеРеквизиты = "";
	
	Для Инд = 2 по ТабличныйДокумент.ВысотаТаблицы Цикл 
		
		ТипДокумента = ТабличныйДокумент.Область(Инд, 1).Текст;  
		
		Если Строка(ТипЗнч(ДокументБУ)) = ТипДокумента Тогда
			
			ПроверяемыеРеквизиты = ТабличныйДокумент.Область(Инд, 2).Текст;	
		    Прервать;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Если Статус = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИКТ_СоответствиеДокументов.ДатаИзменения КАК ДатаИзменения,
			|	ИКТ_СоответствиеДокументов.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
			|ГДЕ
			|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ
			|	И ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ
			|	И ИКТ_СоответствиеДокументов.СостояниеДокументаУУ = &СостояниеДокументаУУ";
		
		Запрос.УстановитьПараметр("ДокументБУ", ДокументБУ);
		Запрос.УстановитьПараметр("ДокументУУ", ДокументУУ);
		Запрос.УстановитьПараметр("СостояниеДокументаУУ", Статус);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ДатаИзменения = Неопределено;
		Пользователь = Неопределено;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДатаИзменения = ВыборкаДетальныеЗаписи.ДатаИзменения;
			Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
		КонецЦикла;
		
		Ошибки.Добавить(СтрШаблон("Игнорировать запись с документом БУ %1 и УОС %2. Установлено %3 пользователем %4", 
			ДокументБУ, ДокументУУ, ДатаИзменения, Пользователь));
		
	КонецЕсли;          
	
	Если НЕ ЗначениеЗаполнено(ДокументБУ) Тогда
		
		Ошибки.Добавить("Отсутствует документ БУ.");
		Возврат Ошибки;
	
	КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(ДокументУУ) Тогда
		
		Ошибки.Добавить("Отсутствует документ УОС.");
		Возврат Ошибки;
	
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты = "" Тогда
		
		Ошибки.Добавить(СтрШаблон("Не найден список проверяемых реквизитов для документа %1", ТипЗнч(ДокументБУ)));
		
		Возврат Ошибки;
	
	КонецЕсли;                                                                                                              
	
	МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроверяемыеРеквизиты, ",", Истина, Истина);  
	
	ШаблонСообщения = "Не совпадает реквизит %1 у документов %2 и %3";
	
	Для каждого ИмяРеквизита Из МассивРеквизитов Цикл
		
		Если ИмяРеквизита = "Организация" ИЛИ ИмяРеквизита = "Сотрудник" ИЛИ ИмяРеквизита = "Подразделение" Тогда
			
			РеквизитБУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБУ, ИмяРеквизита);
			РеквизитУУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументУУ, ИмяРеквизита);
			РеквизитУУРасчетный = ПолучитьОбъектУУ(РеквизитБУ);
			
			Если РеквизитУУ <> РеквизитУУРасчетный Тогда
				
				Ошибки.Добавить(СтрШаблон(ШаблонСообщения, ИмяРеквизита, ДокументБУ, ДокументУУ));
				
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "Сотрудники.Сотрудник" Тогда  
			
			Если ДокументБУ.Сотрудники.Количество() <> ДокументУУ.Сотрудники.Количество() Тогда
				
				Ошибки.Добавить(СтрШаблон("Не совпадает количество строк в табличной части Сотрудники в документах %1 и %2", ДокументБУ, ДокументУУ));
			
			Иначе             
					
				ОрганизацияДокументБУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБУ, "Организация");	
			
				Для каждого СтрокаБУ Из ДокументБУ.Сотрудники Цикл 
					
					СотрудникБУ = СтрокаБУ.Сотрудник;
					
					СтрокаУУ = ДокументУУ.Сотрудники[СтрокаБУ.НомерСтроки - 1];
					СотрудникУУ = СтрокаУУ.Сотрудник; 
					СотрудникУУРасчетный = ПолучитьСвязанныйОбъект(ОрганизацияДокументБУ, СотрудникБУ);
				
					Если СотрудникУУРасчетный <> СотрудникУУ Тогда
						
						Ошибки.Добавить(СтрШаблон("Не совпадает реквизит Сотрудник в строке %1 табличной части Сотркдники у документов %2 и %3", СтрокаБУ.НомерСтроки, ДокументБУ, ДокументУУ));
						
					КонецЕсли;
				
				КонецЦикла;
			
			КонецЕсли;       
			
		ИначеЕсли ИмяРеквизита = "Сотрудники.ДатаНачала" Тогда  
			
			Если ДокументБУ.Сотрудники.Количество() <> ДокументУУ.Сотрудники.Количество() Тогда
				
				Ошибки.Добавить(СтрШаблон("не совпадает количество строк в табличной части Сотрудники в документах %1 и %2", ДокументБУ, ДокументУУ));
			
			Иначе             
					
				Для каждого СтрокаБУ Из ДокументБУ.Сотрудники Цикл 
					
					ДатаНачалаБУ = СтрокаБУ.ДатаНачала;
					
					СтрокаУУ = ДокументУУ.Сотрудники[СтрокаБУ.НомерСтроки - 1];
					ДатаНачалаУУ = СтрокаУУ.ДатаНачала; 
				
					Если ДатаНачалаБУ <> ДатаНачалаУУ Тогда
						
						Ошибки.Добавить(СтрШаблон("Не совпадает реквизит Дата начала в строке %1 табличной части Сотркдники у документов %2 и %3", СтрокаБУ.НомерСтроки, ДокументБУ, ДокументУУ));
						
					КонецЕсли;
				
				КонецЦикла;
			
			КонецЕсли;
			
		Иначе    
			
			РеквизитБУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБУ, ИмяРеквизита);
			РеквизитУУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументУУ, ИмяРеквизита);
			
			Если РеквизитБУ <> РеквизитУУ Тогда
				
				Ошибки.Добавить(СтрШаблон(ШаблонСообщения, ИмяРеквизита, ДокументБУ, ДокументУУ));

			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;         

	Если ДокументБУ.ПометкаУдаления Тогда   
		Ошибки.Добавить(СтрШаблон("Документ %1 помечен на удаление.", ДокументБУ));
	Иначе
		Если НЕ ДокументБУ.Проведен Тогда  
			Ошибки.Добавить(СтрШаблон("Не проведен документ %1", ДокументБУ));
		КонецЕсли;
	КонецЕсли;
		
	Если ДокументУУ.ПометкаУдаления Тогда
		Ошибки.Добавить(СтрШаблон("Документ %1 помечен на удаление.", ДокументУУ));
	Иначе
		Если НЕ ДокументУУ.Проведен Тогда
			Ошибки.Добавить(СтрШаблон("Не проведен документ %1", ДокументУУ));
		КонецЕсли;
	КонецЕсли;
	
	Если Ошибки.Количество() = 0 Тогда
	
		Ошибки.Добавить("Ошибок при проверке не обнаружено.");
	
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции 

Функция СоздатьСвязанныйДокумент(ДокументИсточник) Экспорт
	
	ДокументНазначение = Неопределено;
	
	Если ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		ДокументНазначение = СоздатьПриемНаРаботу(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.Увольнение") Тогда
	
		ДокументНазначение = СоздатьУвольнение(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.КадровыйПеревод") Тогда
	
		ДокументНазначение = СоздатьКадровыйПеревод(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
	
		ДокументНазначение = СоздатьКадровыйПереводСписком(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.Отпуск") Тогда
	
		ДокументНазначение = СоздатьОтпуск(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.БольничныйЛист") Тогда
	
		ДокументНазначение = СоздатьБольничныйЛист(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.Командировка") Тогда
	
		ДокументНазначение = СоздатьКомандировка(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ИзменениеГрафикаРаботыСписком") Тогда
	
		ДокументНазначение = СоздатьИзменениеГрафикаРаботыСписком(ДокументИсточник); 
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		
		ДокументНазначение = СоздатьНачислениеЗарплаты(ДокументИсточник); 
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремени") Тогда
		
		ДокументНазначение = СоздатьТабельУчетаРабочегоВремени(ДокументИсточник);
		
	КонецЕсли;
	
	Возврат ДокументНазначение;

КонецФункции   

Функция СоздатьНачислениеЗарплаты(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;     
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация); 
	
	Для каждого Строка Из ДокументНазначение.Начисления Цикл
		
		Строка.Сотрудник = НайтиСоздатьСотрудника(Строка.Сотрудник);  
		
	КонецЦикла; 
	
	ДокументНазначение.ФизическиеЛица.Очистить();	
			
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    
	
	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьТабельУчетаРабочегоВремени(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;     
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация); 
	
	Для каждого Строка Из ДокументНазначение.ДанныеОВремени Цикл
		
		Строка.Сотрудник = НайтиСоздатьСотрудника(Строка.Сотрудник);  
		
		Для й = 1 По 31 Цикл
			
			Если ЗначениеЗаполнено(Строка["ВидВремени"+й]) Тогда
				ВидВремени = ПолучитьОбъектУУ(Строка["ВидВремени"+й]);
				Если ЗначениеЗаполнено(ВидВремени) Тогда
				
					 Строка["ВидВремени"+й] = ВидВремени;
				
				КонецЕсли;
				
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла; 
	
	ДокументНазначение.ФизическиеЛица.Очистить();	
	
		    
		
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    
	
	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьПриемНаРаботу(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;     
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Сотрудник = НайтиСоздатьСотрудника(ДокументИсточник.Сотрудник);    
	ДокументНазначение.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;   
	ДокументНазначение.Подразделение = НайтиСоздатьПодразделение(ДокументИсточник.Подразделение);
	ДокументНазначение.ДолжностьПоШтатномуРасписанию = Неопределено; 
	ДокументНазначение.Начисления.Очистить();     
	
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    
	
	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьУвольнение(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;  
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Сотрудник = НайтиСоздатьСотрудника(ДокументИсточник.Сотрудник);       
	
	ДокументНазначение.ВидРасчетаКомпенсацииУдержанияОтпуска = ПолучитьОбъектУУ(ДокументИсточник.ВидРасчетаКомпенсацииУдержанияОтпуска);
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    

	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьКадровыйПеревод(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;  
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Подразделение = НайтиСоздатьПодразделение(ДокументИсточник.Подразделение);  
	ДокументНазначение.Сотрудник = НайтиСоздатьСотрудника(ДокументИсточник.Сотрудник);       
	ДокументНазначение.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;   
	ДокументНазначение.ОбособленноеПодразделение = ?(Значениезаполнено(ДокументИсточник.ОбособленноеПодразделение), ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.ОбособленноеПодразделение), Неопределено);
	ДокументНазначение.ДолжностьПоШтатномуРасписанию = Неопределено; 
	
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    

	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьКадровыйПереводСписком(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;  
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Начисления.Очистить();
	
	Для каждого СтрокаТЧ Из ДокументНазначение.Сотрудники  Цикл
		СтрокаТЧ.Сотрудник = НайтиСоздатьСотрудника(СтрокаТЧ.Сотрудник);	
		СтрокаТЧ.Подразделение = НайтиСоздатьПодразделение(СтрокаТЧ.Подразделение);	
		СтрокаТЧ.ДолжностьПоШтатномуРасписанию = ПолучитьДолжностьПоШР(СтрокаТЧ.Сотрудник, ДокументНазначение.Дата);
		СтрокаТЧ.ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;   
	КонецЦикла;
	
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    

	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьОтпуск(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;  
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Сотрудник = НайтиСоздатьСотрудника(ДокументИсточник.Сотрудник);       
	ДокументНазначение.ВидРасчетаКомпенсацииОсновногоОтпуска = ПолучитьОбъектУУ(ДокументНазначение.ВидРасчетаКомпенсацииОсновногоОтпуска);
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    
	
	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьБольничныйЛист(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;  
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Сотрудник = НайтиСоздатьСотрудника(ДокументИсточник.Сотрудник);       
	
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    

	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьКомандировка(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;  
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Сотрудник = НайтиСоздатьСотрудника(ДокументИсточник.Сотрудник);       
	ДокументНазначение.ПланируемаяДатаВыплаты = ДокументИсточник.ПланируемаяДатаВыплаты;       
	
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    

	Возврат ДокументНазначение;
	
КонецФункции 

Функция СоздатьИзменениеГрафикаРаботыСписком(ДокументИсточник)

	ДокументНазначение = ДокументИсточник.Скопировать();   
	ДокументНазначение.Дата  = ДокументИсточник.Дата;  
	ДокументНазначение.Организация = ПолучитьСвязанныйОбъект(ДокументИсточник.Организация, ДокументИсточник.Организация);
	ДокументНазначение.Подразделение = НайтиСоздатьПодразделение(ДокументИсточник.Подразделение); 
	
	Для каждого СтрокаТЧ Из ДокументНазначение.Сотрудники  Цикл
		СтрокаТЧ.Сотрудник = НайтиСоздатьСотрудника(СтрокаТЧ.Сотрудник);	
	КонецЦикла;
	
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    

	Возврат ДокументНазначение;
	
КонецФункции 

Функция ПолучитьДолжностьПоШР(Сотрудник, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ДанныеДляПодбора.Сотрудник = Сотрудники.Ссылка
		|			И ДанныеДляПодбора.Наименование = Сотрудники.Наименование
		|			И (ДанныеДляПодбора.ИдентификаторЗаписи В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ДанныеДляПодбораСотрудниковОтбор.ИдентификаторЗаписи
		|				ИЗ
		|					РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудниковОтбор
		|				ГДЕ
		|					ДанныеДляПодбораСотрудниковОтбор.Сотрудник = ДанныеДляПодбора.Сотрудник
		|					И ДанныеДляПодбораСотрудниковОтбор.Наименование = ДанныеДляПодбора.Наименование
		|					И ДанныеДляПодбораСотрудниковОтбор.Начало <= &ДатаОкончания
		|				УПОРЯДОЧИТЬ ПО
		|					ДанныеДляПодбораСотрудниковОтбор.ПоДоговоруГПХ,
		|					ДанныеДляПодбораСотрудниковОтбор.Начало УБЫВ,
		|					ДанныеДляПодбораСотрудниковОтбор.Организация,
		|					ДанныеДляПодбораСотрудниковОтбор.Филиал,
		|					ДанныеДляПодбораСотрудниковОтбор.Подразделение))
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаОкончания", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ДолжностьПоШтатномуРасписанию;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции  

Функция ПолучитьДолжность(Сотрудник, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДляПодбора.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ДанныеДляПодбора.Сотрудник = Сотрудники.Ссылка
		|			И ДанныеДляПодбора.Наименование = Сотрудники.Наименование
		|			И (ДанныеДляПодбора.ИдентификаторЗаписи В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ДанныеДляПодбораСотрудниковОтбор.ИдентификаторЗаписи
		|				ИЗ
		|					РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудниковОтбор
		|				ГДЕ
		|					ДанныеДляПодбораСотрудниковОтбор.Сотрудник = ДанныеДляПодбора.Сотрудник
		|					И ДанныеДляПодбораСотрудниковОтбор.Наименование = ДанныеДляПодбора.Наименование
		|					И ДанныеДляПодбораСотрудниковОтбор.Начало <= &ДатаОкончания
		|				УПОРЯДОЧИТЬ ПО
		|					ДанныеДляПодбораСотрудниковОтбор.ПоДоговоруГПХ,
		|					ДанныеДляПодбораСотрудниковОтбор.Начало УБЫВ,
		|					ДанныеДляПодбораСотрудниковОтбор.Организация,
		|					ДанныеДляПодбораСотрудниковОтбор.Филиал,
		|					ДанныеДляПодбораСотрудниковОтбор.Подразделение))
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаОкончания", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Должность;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции

Функция НайтиСоздатьСотрудника(СотрудникИсточник) Экспорт
	
	НайденныйСотрудник = ПолучитьСвязанныйОбъект(СотрудникИсточник.ГоловнаяОрганизация, СотрудникИсточник);
	
	Если НайденныйСотрудник <> Неопределено Тогда
		
		Возврат НайденныйСотрудник;
	
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Сотрудники.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
			|	И Сотрудники.ГоловнаяОрганизация = &ГоловнаяОрганизация";
		
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ПолучитьСвязанныйОбъект(СотрудникИсточник.ГоловнаяОрганизация, СотрудникИсточник.ГоловнаяОрганизация));
		Запрос.УстановитьПараметр("ФизическоеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникИсточник, "ФизическоеЛицо"));
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
			ВыполнитьЗаписьВСоответствиеОбъектов(СотрудникИсточник, ВыборкаДетальныеЗаписи.Ссылка);
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		СотрудникНазначение = Справочники.Сотрудники.СоздатьЭлемент();  
		ОрганизацияНазначение = ПолучитьСвязанныйОбъект(СотрудникИсточник.ГоловнаяОрганизация, СотрудникИсточник.ГоловнаяОрганизация);
		СотрудникНазначение.ГоловнаяОрганизация = ОрганизацияНазначение;   
		СотрудникНазначение.Наименование = СотрудникИсточник.Наименование;
		СотрудникНазначение.ФизическоеЛицо = СотрудникИсточник.ФизическоеЛицо;
		СотрудникНазначение.ТекущийПроцентСевернойНадбавки = СотрудникИсточник.ТекущийПроцентСевернойНадбавки;
		СотрудникНазначение.УточнениеНаименования = СотрудникИсточник.УточнениеНаименования;
		СотрудникНазначение.ВАрхиве = Ложь;
		СотрудникНазначение.Записать();  
		
		ВыполнитьЗаписьВСоответствиеОбъектов(СотрудникИсточник, СотрудникНазначение);
		
		Возврат СотрудникНазначение.Ссылка;
	
	КонецЕсли;

КонецФункции

Функция НайтиСоздатьПодразделение(ПодразделениеИсточник) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПодразделениеИсточник) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденноеПодразделение = ПолучитьСвязанныйОбъект(ПодразделениеИсточник.ГоловнаяОрганизация, ПодразделениеИсточник);
	
	Если НайденноеПодразделение <> Неопределено Тогда
		
		Возврат НайденноеПодразделение;
	
	Иначе           
		
		ПодразделениеНазначение = ПодразделениеИсточник.Скопировать();     
		
		ОрганизацияНазначение = ПолучитьСвязанныйОбъект(ПодразделениеНазначение.ГоловнаяОрганизация, ПодразделениеНазначение.ГоловнаяОрганизация);	
		ПодразделениеНазначение.ГоловнаяОрганизация = ОрганизацияНазначение;  
		ПодразделениеНазначение.Владелец = ОрганизацияНазначение;  
		ПодразделениеНазначение.Родитель = Неопределено;  
		ПодразделениеНазначение.Записать();  
		
		ВыполнитьЗаписьВСоответствиеОбъектов(ПодразделениеИсточник, ПодразделениеНазначение);
		
		Возврат ПодразделениеНазначение.Ссылка;
	
	КонецЕсли;

КонецФункции

Процедура ИКТ_ПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;      
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоБухгалтерскаяОрганизация(Источник.Организация) Тогда
	
		Если НЕ Источник.ПометкаУдаления Тогда  
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
				|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ,
				|	ИКТ_СоответствиеДокументов.СостояниеДокументаУУ КАК СостояниеДокументаУУ
				|ИЗ
				|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
				|ГДЕ
				|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
			
			Запрос.УстановитьПараметр("ДокументБУ", Источник.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();    
			
			Если Выборка.Количество() = 0 Тогда   
				
				ЗаписьВСоответвиеДокументов(Источник.Ссылка);
				
			Иначе
				
				Выборка.Следующий();
				ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ);
				ЗаписьВСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ, Выборка.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент);
				
			КонецЕсли;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
				|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ,
				|	ИКТ_СоответствиеДокументов.СостояниеДокументаУУ КАК СостояниеДокументаУУ
				|ИЗ
				|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
				|ГДЕ
				|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
			
			Запрос.УстановитьПараметр("ДокументБУ", Источник.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить(); 
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ);
				
				Если ЗначениеЗаполнено(Выборка.ДокументУУ) Тогда
					
					ЗаписьВСоответвиеДокументов(,Выборка.ДокументУУ, Выборка.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент);
				
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;         
	
	Если ЭтоУОС(Источник.Организация) Тогда    
		
		Если ЗначениеЗаполнено(Источник.ИКТ_ДокументИсточник) И НЕ Источник.ПометкаУдаления Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
				|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ,
				|	ИКТ_СоответствиеДокументов.СостояниеДокументаУУ КАК СостояниеДокументаУУ
				|ИЗ
				|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
				|ГДЕ
				|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
			
			Запрос.УстановитьПараметр("ДокументБУ", Источник.ИКТ_ДокументИсточник);
			
			РезультатЗапроса = Запрос.Выполнить();   
			
			Если НЕ РезультатЗапроса.Пустой() Тогда 
				ЕстьЗаписьБУ = Истина;	
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				ИгнорироватьДокумент = Выборка.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент;	
			Иначе
				ЕстьЗаписьБУ = Ложь;   
				ИгнорироватьДокумент = Ложь;	
			КонецЕсли;
			
			Если ЕстьЗаписьБУ Тогда
			
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
					|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ,
					|	ИКТ_СоответствиеДокументов.СостояниеДокументаУУ КАК СостояниеДокументаУУ
					|ИЗ
					|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
					|ГДЕ
					|	ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
				
				Запрос.УстановитьПараметр("ДокументУУ", Источник.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();   
				
				Если Выборка.Количество() = 0 Тогда      
					
					НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ДокументБУ.Установить(Источник.ИКТ_ДокументИсточник);
					НаборЗаписей.Записать(); 
					
					ЗаписьВСоответвиеДокументов(Источник.ИКТ_ДокументИсточник, Источник.Ссылка, ИгнорироватьДокумент);
					
				Иначе       
					
					Выборка.Следующий();
					
					ОчиститьСоответвиеДокументов(Источник.ИКТ_ДокументИсточник, Источник.Ссылка);
					ЗаписьВСоответвиеДокументов(Источник.ИКТ_ДокументИсточник, Источник.Ссылка, ИгнорироватьДокумент);
					
				КонецЕсли;  
			
			Иначе
			
				ЗаписьВСоответвиеДокументов(, Источник.Ссылка);
			
			КонецЕсли;
			
		КонецЕсли;
			
		Если НЕ Источник.ПометкаУдаления Тогда  
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
				|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ,
				|	ИКТ_СоответствиеДокументов.СостояниеДокументаУУ КАК СостояниеДокументаУУ
				|ИЗ
				|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
				|ГДЕ
				|	ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
			
			Запрос.УстановитьПараметр("ДокументУУ", Источник.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Количество() = 0 Тогда
				
				ЗаписьВСоответвиеДокументов(, Источник.Ссылка);
				
			Иначе                   
				
				Выборка.Следующий();
				
				Если ЗначениеЗаполнено(Выборка.ДокументБУ) Тогда
				
					ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Источник.Ссылка);
					ЗаписьВСоответвиеДокументов(Выборка.ДокументБУ, Источник.Ссылка, Выборка.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент);
				
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
				|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ,
				|	ИКТ_СоответствиеДокументов.СостояниеДокументаУУ КАК СостояниеДокументаУУ
				|ИЗ
				|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
				|ГДЕ
				|	ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
			
			Запрос.УстановитьПараметр("ДокументУУ", Источник.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить(); 
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ);
				
				Если ЗначениеЗаполнено(Выборка.ДокументБУ) Тогда
					
					ЗаписьВСоответвиеДокументов(Выборка.ДокументБУ,, Выборка.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент);
					
				КонецЕсли;
					
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЕсли;  
	
	Источник.ИКТ_ДокументИсточник = Неопределено;

КонецПроцедуры     

Процедура ЗаписьВСоответвиеДокументов(ДокументБУ = Неопределено, ДокументУУ = Неопределено, ИгнорироватьДокумент = Ложь) Экспорт
		
	Если ДокументБУ = Неопределено И ДокументУУ = Неопределено Тогда
	
	ИначеЕсли ДокументБУ = Неопределено Тогда 
		
		ПустойДокумент = Документы[ТипДокумента(ДокументУУ)].ПустаяСсылка();
		
		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументУУ.Установить(ДокументУУ);
		НаборЗаписей.Отбор.ДокументБУ.Установить(ПустойДокумент);
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ДокументУУ = ДокументУУ;
		НоваяЗапись.ДокументБУ = ПустойДокумент;  
		Если ИгнорироватьДокумент Тогда
			НоваяЗапись.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент;
		КонецЕсли;
		НаборЗаписей.Записать();   
		
	ИначеЕсли ДокументУУ = Неопределено Тогда   
		
		ПустойДокумент = Документы[ТипДокумента(ДокументБУ)].ПустаяСсылка();
		
		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументБУ.Установить(ДокументБУ);
		НаборЗаписей.Отбор.ДокументУУ.Установить(ПустойДокумент);
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ДокументБУ = ДокументБУ;
		НоваяЗапись.ДокументУУ = ПустойДокумент;   
		Если ИгнорироватьДокумент Тогда
			НоваяЗапись.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент;
		КонецЕсли;
		НаборЗаписей.Записать();    
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументБУ.Установить(ДокументБУ);   
		Наборзаписей.Отбор.ДокументУУ.Установить(ДокументУУ);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДокументБУ = ДокументБУ;
		НоваяЗапись.ДокументУУ = ДокументУУ;  
		Если ИгнорироватьДокумент Тогда
			НоваяЗапись.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент;
		КонецЕсли;
		НаборЗаписей.Записать();   
		
	КонецЕсли;
	
КонецПроцедуры    

Процедура ОчиститьСоответвиеДокументов(ДокументБУ = Неопределено, ДокументУУ = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументБУ.Установить(ДокументБУ);
	НаборЗаписей.Отбор.ДокументУУ.Установить(ДокументУУ); 
	НаборЗаписей.Записать();       
	
КонецПроцедуры

Функция ТипДокумента(Документ) 
	
	Возврат Документ.Метаданные().Имя;

КонецФункции  

Процедура УстановитьСоответствиеПриЗаменеДокумента(ДокументБУ, ДокументУУ) Экспорт
	
	Если ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Подразделение, ДокументУУ.Подразделение);
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Сотрудник, ДокументУУ.Сотрудник);
		
	ИначеЕсли ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.Увольнение") Тогда
		
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Сотрудник, ДокументУУ.Сотрудник);
		
	ИначеЕсли ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.КадровыйПеревод") Тогда
		
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Подразделение, ДокументУУ.Подразделение);
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Сотрудник, ДокументУУ.Сотрудник);
		
	ИначеЕсли ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
		
		Для каждого СтрокаТЧ Из ДокументБУ.Сотрудники  Цикл  
			
			СтрокаУУ = ДокументУУ.Сотрудники[СтрокаТЧ.НомерСтроки - 1];
			ПодразделениеУУ = СтрокаУУ.Подразделение;
			СотрудникУУ = СтрокаУУ.Сотрудник;
			
			ВыполнитьЗаписьВСоответствиеОбъектов(СтрокаТЧ.Подразделение, ПодразделениеУУ);
			ВыполнитьЗаписьВСоответствиеОбъектов(СтрокаТЧ.Сотрудник, СотрудникУУ); 
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.Отпуск") Тогда
		
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Сотрудник, ДокументУУ.Сотрудник);
		
	ИначеЕсли ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.БольничныйЛист") Тогда
		
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Сотрудник, ДокументУУ.Сотрудник);
		
	ИначеЕсли ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.Командировка") Тогда
		
		ВыполнитьЗаписьВСоответствиеОбъектов(ДокументБУ.Сотрудник, ДокументУУ.Сотрудник);
		
	ИначеЕсли ТипЗнч(ДокументБУ) = Тип("ДокументСсылка.ИзменениеГрафикаРаботыСписком") Тогда
		
		Для каждого СтрокаТЧ Из ДокументБУ.Сотрудники  Цикл  
			
			СтрокаУУ = ДокументУУ.Сотрудники[СтрокаТЧ.НомерСтроки - 1];
			СотрудникУУ = СтрокаУУ.Сотрудник;
			
			ВыполнитьЗаписьВСоответствиеОбъектов(СтрокаТЧ.Сотрудник, СотрудникУУ); 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИКТ_ЗаполнитьПоказательНачисленоЮОС(Источник, Отказ, Замещение) Экспорт
	
	
	Период = Неопределено;
	Если Источник.Количество() > 0 Тогда
		
		Организация = Источник[0].Организация;
		Период 		= Источник[0].Период; 

	Иначе  
		
		Попытка
			Организация = Источник.Отбор.Регистратор.Значение.Организация;
			
			
			// ИКТ Воробьев Д.В, 19.11.2025 
			//Период = Источник.Отбор.Регистратор.Значение.ПериодРегистрации;
			Если ТипЗнч(Источник.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда   
				Период = Источник.Отбор.Регистратор.Значение.МесяцНачисления;
			Иначе 
				Период = Источник.Отбор.Регистратор.Значение.ПериодРегистрации;	
			КонецЕсли;
			// ИКТ Воробьев Д.В, 19.11.2025

		Исключение  
			Сообщить("Не определен тип регистратора");

			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	
	Если НЕ ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Организация) Тогда
				
		Возврат;
		
	КонецЕсли;
	
	ОргУУ = ИКТ_ЗП_УОС.ПолучитьОбъектУУ(Организация);
	
	// ИКТ Воробьев Д.В, 19.11.2025
	//ВидЗПЮОС = Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты.ПолучитьСсылку(Новый УникальныйИдентификатор("9c26f8ff-55da-11f0-8131-00155d008708")); 
	
	// найдем шаблон по показателю	   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыДокументовВводДанныхДляРасчетаЗарплатыПоказатели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты.Показатели КАК ВидыДокументовВводДанныхДляРасчетаЗарплатыПоказатели
	|ГДЕ
	|	ВидыДокументовВводДанныхДляРасчетаЗарплатыПоказатели.Показатель = &Показатель
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыДокументовВводДанныхДляРасчетаЗарплатыПоказатели.Ссылка";
	
	Запрос.УстановитьПараметр("Показатель", Справочники.ПоказателиРасчетаЗарплаты.НайтиПоРеквизиту("Идентификатор","НачисленнаяЗППоЮОС"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВидЗПЮОС = Выборка.Ссылка;	
	КонецЦикла;
	// ИКТ Воробьев Д.В, 19.11.2025
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДанныеДляРасчетаЗарплаты КАК ДанныеДляРасчетаЗарплаты
	|ГДЕ
	|	ДанныеДляРасчетаЗарплаты.Проведен
	|	И ДанныеДляРасчетаЗарплаты.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДанныеДляРасчетаЗарплаты.Организация = &Организация
	|	И ДанныеДляРасчетаЗарплаты.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", ОргУУ);  
	Запрос.УстановитьПараметр("ВидДокумента", ВидЗПЮОС);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.ДанныеДляРасчетаЗарплаты.СоздатьДокумент();
		Док.Дата = НачалоМесяца(Период);
		Док.Период = НачалоМесяца(Период); 
		Док.ПериодОкончания = НачалоМесяца(Период);
		
		Док.ВидДокумента = ВидЗПЮОС;
		//Начисленная з/п по ЮОС
		Док.Организация = ОргУУ;
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|				ТОГДА НачисленияУдержанияПоСотрудникам.Сумма
	|			КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
	|				ТОГДА -НачисленияУдержанияПоСотрудникам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НачисленияУдержанияПоСотрудникам.Организация = &Организация
	|	И НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанияПоСотрудникам.Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Док.ЗначенияПоказателей.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		 
		//Нстр.Объект = ВыборкаДетальныеЗаписи.Сотрудник;
		СотрудникУУ = ИКТ_ЗП_УОС.ПолучитьОбъектУУ(ВыборкаДетальныеЗаписи.Сотрудник);
		
		Если Не ЗначениеЗаполнено(СотрудникУУ) Тогда 
			Продолжить;
		КонецЕсли;
			
		Нстр = Док.ЗначенияПоказателей.Добавить(); 	
			
		Нстр.Объект = ИКТ_ЗП_УОС.ПолучитьОбъектУУ(ВыборкаДетальныеЗаписи.Сотрудник);
		
		НСтр.Показатель = Справочники.ПоказателиРасчетаЗарплаты.НайтиПоРеквизиту("Идентификатор","НачисленнаяЗППоЮОС");
		НСтр.Значение = ВыборкаДетальныеЗаписи.Сумма;
		НСтр.Период = НачалоМесяца(Период); 
		НСтр.ПериодОкончания = НачалоМесяца(Период);
		
	КонецЦикла;
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура СформироватьБольничныйОплаченныйФСС(Источник, Отказ, Замещать) Экспорт
	
	Период = Неопределено;
	//Если Источник.Количество() > 0 Тогда
	//	
	//	Организация = Источник[0].Организация;
	//	Период 		= Источник[0].Период; 
	//	Регистратор = Источник[0].Регистратор;
	//	Сотрудник 	= Источник[0].Сотрудник;
	//Иначе  
	//	
	Попытка
		Организация = Источник.Отбор.Регистратор.Значение.Организация;
		Период = Источник.Отбор.Регистратор.Значение.ПериодРегистрации;
		Регистратор = Источник.Отбор.Регистратор.Значение; 
		Сотрудник 	= Источник.Отбор.Регистратор.Значение.Сотрудник;
		
	Исключение  
		Сообщить("Не определен тип регистратора");
		
		Возврат;
	КонецПопытки;
	
		
	//КонецЕсли;
	
	Если НЕ ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Организация) Тогда
		
		
		Возврат;
		
	КонецЕсли; 
	
	ОргУУ = ИКТ_ЗП_УОС.ПолучитьОбъектУУ(Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(синПособияЗаСчетСредствФСС.СуммаВсего) КАК СуммаВсего
	|ИЗ
	|	РегистрНакопления.синПособияЗаСчетСредствФСС КАК синПособияЗаСчетСредствФСС
	|ГДЕ
	|	синПособияЗаСчетСредствФСС.Организация = &Организация
	|	И синПособияЗаСчетСредствФСС.ФизическоеЛицо = &ФизическоеЛицо
	|	И синПособияЗаСчетСредствФСС.Регистратор.ПериодРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Регистратор.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Регистратор.ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", Сотрудник.ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаВсего = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаВсего =  ВыборкаДетальныеЗаписи.СуммаВсего;
	КонецЦикла;
	
	//Если СуммаВсего = 0 Тогда
	//
	//	 Возврат;
	//
	//КонецЕсли;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДанныеДляРасчетаЗарплаты КАК ДанныеДляРасчетаЗарплаты
	|ГДЕ
	|	ДанныеДляРасчетаЗарплаты.Проведен
	|	И ДанныеДляРасчетаЗарплаты.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДанныеДляРасчетаЗарплаты.Организация = &Организация
	|	И ДанныеДляРасчетаЗарплаты.ВидДокумента = &ВидДокумента
	|	И ДанныеДляРасчетаЗарплаты.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", ОргУУ); 
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник); 
	
	ВидЗПЮОС = Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты.ПолучитьСсылку(Новый УникальныйИдентификатор("72fc2878-6228-11f0-8135-00155d008708")); 
	Запрос.УстановитьПараметр("ВидДокумента", ВидЗПЮОС);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.ДанныеДляРасчетаЗарплаты.СоздатьДокумент();
		Док.Дата = НачалоМесяца(Период);
		Док.Период = НачалоМесяца(Период); 
		Док.ПериодОкончания = НачалоМесяца(Период);
		
		Док.ВидДокумента = ВидЗПЮОС;
		//Начисленная з/п по ЮОС
		Док.Организация = ОргУУ;
		Док.Сотрудник = Сотрудник;
		
	КонецЕсли;
	
	
	
	
	Док.ЗначенияПоказателей.Очистить();	
	Нстр = Док.ЗначенияПоказателей.Добавить();
	Нстр.Объект = Сотрудник;
	НСтр.Показатель = Справочники.ПоказателиРасчетаЗарплаты.НайтиПоРеквизиту("Идентификатор","БольничныйОплаченныйФСС");
	НСтр.Значение = СуммаВсего;
	НСтр.Период = НачалоМесяца(Период); 
	НСтр.ПериодОкончания = НачалоМесяца(Период);
	
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
		
	
КонецПроцедуры

Процедура УдалитьЛишниеНачисления(ТаблицаДанных) Экспорт

	Индекс = 0;
	Пока Индекс < ТаблицаДанных.Количество() Цикл
		Строка = ТаблицаДанных[Индекс];
		
		Если  НЕ ИКТ_ЗП_УОС.ЭтоУОС(Строка.Сотрудник.ГоловнаяОрганизация) Тогда
			Прервать;
		КонецЕсли; 
		
		Если  НЕ Строка.Начисление.ИКТ_УУ ИЛИ Строка.Результат = 0 Тогда
			ТаблицаДанных.Удалить(Индекс); 
			Продолжить;
		КонецЕсли; 
		
		СтрокаУдалена = Ложь;
		Для каждого НачислениеУдалить Из Строка.ДолжностьПоШтатномуРасписанию.ИКТ_ИсключаемыеВидыРасчета Цикл
			
			Если  Строка.Начисление = НачислениеУдалить.Начисление  Тогда
				ТаблицаДанных.Удалить(Индекс);
				СтрокаУдалена = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		////Оплата МО при увольнении
		//Если Строка(Строка.Начисление.УникальныйИдентификатор()) = "8f911bb5-6ab5-11f0-8135-00155d008708" Тогда
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
		//	|	КадроваяИсторияСотрудников.Организация КАК Организация
		//	|ИЗ
		//	|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		//	|ГДЕ
		//	|	КадроваяИсторияСотрудников.Сотрудник = &Сотрудник
		//	|	И КадроваяИсторияСотрудников.Организация = &Организация
		//	|	И КадроваяИсторияСотрудников.ВидСобытия = &ВидСобытия";
		//	
		//	Запрос.УстановитьПараметр("ВидСобытия", Перечисления.ВидыКадровыхСобытий.Увольнение);
		//	Запрос.УстановитьПараметр("Организация", Строка.Сотрудник.ГоловнаяОрганизация);
		//	Запрос.УстановитьПараметр("Сотрудник", Строка.Сотрудник);
		//	
		//	РезультатЗапроса = Запрос.Выполнить();
		//	
		//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//	
		//	Если НЕ ВыборкаДетальныеЗаписи.Следующий() Тогда
		//		ТаблицаДанных.Удалить(Индекс);   
		//		СтрокаУдалена = Истина;
		//		
		//	КонецЕсли;
		//				
		//КонецЕсли;
		
		Если СтрокаУдалена Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		// -- ИКТ Воробьев Д.В, 19.05.2026
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ИКТ_ПрименениеНачислений.Организация КАК Организация,
		//|	ИКТ_ПрименениеНачислений.Начисление КАК Начисление
		//|ПОМЕСТИТЬ ВТ
		//|ИЗ
		//|	РегистрСведений.ИКТ_ПрименениеНачислений КАК ИКТ_ПрименениеНачислений
		//|ГДЕ
		//|	ИКТ_ПрименениеНачислений.Начисление = &Начисление
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ИКТ_ПрименениеНачислений.Организация КАК Организация,
		//|	ИКТ_ПрименениеНачислений.Начисление КАК Начисление
		//|ПОМЕСТИТЬ ВТ2
		//|ИЗ
		//|	РегистрСведений.ИКТ_ПрименениеНачислений КАК ИКТ_ПрименениеНачислений
		//|ГДЕ
		//|	ИКТ_ПрименениеНачислений.Начисление = &Начисление
		//|	И ИКТ_ПрименениеНачислений.Организация = &Организация
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ.Организация КАК Организация,
		//|	ВТ.Начисление КАК Начисление,
		//|	НЕ ВТ2.Организация ЕСТЬ NULL КАК Применяется
		//|ИЗ
		//|	ВТ КАК ВТ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
		//|		ПО ВТ.Начисление = ВТ2.Начисление
		//|			И ВТ.Организация = ВТ2.Организация";
		//
		//Запрос.УстановитьПараметр("Начисление", Строка.Начисление);
		//Запрос.УстановитьПараметр("Организация", Строка.Сотрудник.ГоловнаяОрганизация);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		//
		//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		//	
		//	Если НЕ ВыборкаДетальныеЗаписи.Применяется Тогда
		//		
		//		ТаблицаДанных.Удалить(Индекс);  
		//	Иначе
		//		Индекс = Индекс + 1;
		//		
		//	КонецЕсли; 
		//Иначе
		//	Индекс = Индекс + 1;
		//	
		//КонецЕсли; 
		// -- ИКТ Воробьев Д.В, 19.05.2026
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Индекс = 0;
	Пока Индекс < ТаблицаДанных.Количество() Цикл
		Строка = ТаблицаДанных[Индекс];
		
		Если  НЕ ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Строка.Сотрудник.ГоловнаяОрганизация) Тогда
			Прервать;
		КонецЕсли; 
		
		Если  Строка.Начисление.ИКТ_УУ  Тогда
			ТаблицаДанных.Удалить(Индекс); 
			Продолжить;
		КонецЕсли; 
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИКТ_ТранслироватьДокументДанныеДляРасчетаЗарплатыВУОСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ ЭтоБухгалтерскаяОрганизация(Источник.Организация) Тогда
	
		Возврат;	
	КонецЕсли; 
	
	Транслировать = УправлениеСвойствами.ЗначениеСвойства(Источник.ВидДокумента,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ТранслироватьВУОС_98ba2ccfa2264f0881cbb99cb0c2bf19"));
	
	Если НЕ Транслировать = Неопределено Тогда
		
		
		Если  НЕ Транслировать Тогда
			
			Возврат;
			
		КонецЕсли; 
	Иначе
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляРасчетаЗарплаты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДанныеДляРасчетаЗарплаты КАК ДанныеДляРасчетаЗарплаты
		|ГДЕ
		|	ДанныеДляРасчетаЗарплаты.ДокументИсточник = &ДокументИсточник
		|	И ДанныеДляРасчетаЗарплаты.Проведен";
	
	Запрос.УстановитьПараметр("ДокументИсточник", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ДокументНазначение = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();  
	Иначе 
		ДокументНазначение = Источник.Скопировать();  

	КонецЕсли;
	
	 
	ДокументНазначение.Дата  = Источник.Дата;     
	ДокументНазначение.Организация = ПолучитьОбъектУУ(Источник.Организация); 
	ДокументНазначение.ДокументИсточник = Источник.Ссылка;
	ДокументНазначение.ЗначенияПоказателей.Очистить();

	ВидУУ  = ПолучитьОбъектУУ(Источник.ВидДокумента);  
	Если ЗначениеЗаполнено(ВидУУ) Тогда
	
		ДокументНазначение.ВидДокумента = ВидУУ;
	
	КонецЕсли;
	Для каждого Строка Из Источник.ЗначенияПоказателей Цикл
		ОбъектУУ = ПолучитьОбъектУУ(Строка.Объект); 
		ПоказательУУ = ПолучитьОбъектУУ(Строка.Показатель);
		
		Если ЗначениеЗаполнено(ОбъектУУ) Тогда
			
			Нстр = ДокументНазначение.ЗначенияПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр,Строка);
			Нстр.Объект = ПолучитьОбъектУУ(Строка.Объект);
			
			Если ЗначениеЗаполнено(ПоказательУУ) Тогда
				
				Нстр.Показатель = ПоказательУУ;
				
			КонецЕсли;
			
		Иначе
			Сообщить("Не найдено соответствие для объекта " + Строка(Строка.Объект));
			
		КонецЕсли;
		
		
	КонецЦикла; 
	
	ДокументНазначение.ФизическиеЛица.Очистить();	
	
	
	
	ПрефиксОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументНазначение.Организация, "Префикс");
	ДокументНазначение.УстановитьНовыйНомер(ПрефиксОрганизации);    

	ДокументНазначение.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

Процедура ИКТ_УдалитьДокументДанныеДляРасчетаЗарплатыВУОС1ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если НЕ ЭтоБухгалтерскаяОрганизация(Источник.Организация) Тогда
		
		Возврат;	
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляРасчетаЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДанныеДляРасчетаЗарплаты КАК ДанныеДляРасчетаЗарплаты
	|ГДЕ
	|	ДанныеДляРасчетаЗарплаты.ДокументИсточник = &ДокументИсточник
	|	И ДанныеДляРасчетаЗарплаты.Проведен";
	
	Запрос.УстановитьПараметр("ДокументИсточник", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ДокументНазначение = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(); 
		ДокументНазначение.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьПраваУОС() Экспорт   
	
	Возврат ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ИКТ_СоответствиеОбъектов);  
	
КонецФункции