
&После("ОбработкаПроведения")
Процедура Расш1_ОбработкаПроведения(Объект, Отказ, РежимПроведения)
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//{[+] ИКТ №20906 (фрагмент ДОБАВЛЕН), Новоселов, 28.08.2026 Перенес и адаптировал доработки из Сторно (Задача 11726) / ПриобретениеТоваровУслуг (Задача 8968)
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Объект.Движения.ИКТ_ИсполнениеБюджета.Записывать = Истина;
		
		Выборка = ПолучитьДанныеДокумента(Объект.Ссылка);
		
		Пока Выборка.Следующий() Цикл			
			//Смотрим, где взять подразделение лимита и статью ДДС, по аналогии с отчетом "Исполнение бюджета"
			СтруктураСтатьяПодразделение = ПриобретениеТоваровУслугЛокализация.ПолучитьСтатьюДвиженияДенежныхСредствИПодразделение(Выборка);	
			
			//Делаем движения по регистру
			Движение = Объект.Движения.ИКТ_ИсполнениеБюджета.Добавить();
			
			Движение.Период			 = Объект.Дата;
			Движение.Организация	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Организация");
			Движение.Подразделение	 = СтруктураСтатьяПодразделение.ПодразделениеЛимита;
			Движение.ЗаказПоставщику = Выборка.ЗаказПоставщику;
			Движение.Сумма			 = Выборка.Сумма;
			Движение.СуммаРегл		 = Выборка.СуммаРегл;
			Движение.СуммаУпр		 = Выборка.СуммаУпр;
			Движение.СтатьяДвиженияДенежныхСредств = СтруктураСтатьяПодразделение.СтатьяДДС;
		КонецЦикла;
	КонецЕсли;
	//[+]} ИКТ №20906
	
КонецПроцедуры

//{[+] ИКТ №20906 (фрагмент ДОБАВЛЕН), Новоселов, 28.08.2026 
Функция ПолучитьДанныеДокумента(Ссылка)
	
	Запрос = Новый Запрос( 
		"ВЫБРАТЬ
		|	РасхожденияКорректировка.Ссылка КАК Ссылка,
		|	РасхожденияКорректировка.СписатьНаРасходы КАК СписатьНаРасходы,
		|	ВЫБОР
		|		КОГДА ПриобретениеТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
		|			ТОГДА ДокументАвансовыйОтчет.ИКТ_ЗаказПоставщику
		|		ИНАЧЕ РасхожденияКорректировка.ЗаказПоставщику
		|	КОНЕЦ КАК ЗаказПоставщику,
		|	РасхожденияКорректировка.СтатьяРасходов КАК СтатьяРасходов,
		|	ВЫБОР
		|		КОГДА РасхожденияКорректировка.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|			ТОГДА РасхожденияКорректировка.Подразделение
		|		ИНАЧЕ РасхожденияКорректировка.Ссылка.Подразделение
		|	КОНЕЦ КАК Подразделение,
		|	ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДС + СуммыДокументовВВалютахУчета.СуммаНДС, 0) КАК Сумма,
		|	ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДСРегл + СуммыДокументовВВалютахУчета.СуммаНДСРегл, 0) КАК СуммаРегл,
		|	ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДСУпр + СуммыДокументовВВалютахУчета.СуммаНДСУпр, 0) КАК СуммаУпр
		|ИЗ
		|	Документ.КорректировкаПриобретения.Расхождения КАК РасхожденияКорректировка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчета
		|		ПО РасхожденияКорректировка.Ссылка = СуммыДокументовВВалютахУчета.Регистратор
		|			И РасхожденияКорректировка.НомерСтроки = СуммыДокументовВВалютахУчета.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ПО (ПриобретениеТоваровУслуг.Ссылка = РасхожденияКорректировка.Ссылка.ДокументОснование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет КАК ДокументАвансовыйОтчет
		|		ПО (ДокументАвансовыйОтчет.Ссылка = ПриобретениеТоваровУслуг.АвансовыйОтчет)
		|ГДЕ
		|	СуммыДокументовВВалютахУчета.Регистратор = &Регистратор");
			
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
//[+]} ИКТ №20906