
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает изменяемые задачи и проекты.
//
// Параметры:
//  ДокументСсылка	- ДокументСсылка - Документ прогноза. 
// 
// Возвращаемое значение:
//  Структура 		- содержит два поля с типом массив: МассивПроектов и МассивЗадач.
//
Функция ПолучитьИзменяемыеЗадачиИПроекты(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоПрогнозТрудозатратДанные.ПроектнаяЗадачаЗеркало.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
	               |	упоПрогнозТрудозатратДанные.ПроектнаяЗадачаЗеркало.упоКорневойПроект КАК Проект
	               |ИЗ
	               |	Документ.упоПрогнозТрудозатратПоРолям.Данные КАК упоПрогнозТрудозатратДанные
	               |ГДЕ
	               |	упоПрогнозТрудозатратДанные.Ссылка = &Ссылка
	               |	И упоПрогнозТрудозатратДанные.Записывать
				   |	И НЕ упоПрогнозТрудозатратДанные.ПроектнаяЗадачаЗеркало.СсылкаНаПроектнуюЗадачу ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ТаблицаПЗ = Запрос.Выполнить().Выгрузить();
	МассивЗадач = ТаблицаПЗ.ВыгрузитьКолонку("ПроектнаяЗадача");
	ТаблицаПЗ.Свернуть("Проект");
	МассивПроектов = ТаблицаПЗ.ВыгрузитьКолонку("Проект");
	
	Результат = Новый Структура("МассивПроектов, МассивЗадач", МассивПроектов, МассивЗадач);
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(Данные.ПроектнаяЗадачаЗеркало.упоКорневойПроект, NULL КАК ИСТИНА))";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоПрогнозТрудозатратПоРолям);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли