
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ	(ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);	
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, РежимЗаписиДокумента.Проведение, Отказ, Заголовок, Истина);
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.ПроверитьДокументНаОтмененныеПЗ(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьВозможностьСписанияФактическихЗатрат(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	упоПроведениеДокументовВызовСервера.обУдалитьДвиженияДокумента(Отказ, ЭтотОбъект);
		
	Пакет = ПолучитьПакетДляФормированияДвижений();
	РезультатПакета = Пакет.ВыполнитьПакет();
	ИндексПоследнего = РезультатПакета.Количество() - 1;
	
	ДеревоТрудозатрат 					= РезультатПакета[ИндексПоследнего - 7].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТекущийПланТРПоЗадачам 				= РезультатПакета[ИндексПоследнего - 6].Выгрузить();
	ТекущийПланРаспределенияТРПоЗадачам = РезультатПакета[ИндексПоследнего - 5].Выгрузить();
	МассивЗадач 						= РезультатПакета[ИндексПоследнего - 4].Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
	ТаблицаИндексовСтрокРаспределения 	= РезультатПакета[ИндексПоследнего - 3].Выгрузить();
	ТаблицаЗадачФакта 					= РезультатПакета[ИндексПоследнего - 2].Выгрузить();
	ДеревоПроцентГотовности 			= РезультатПакета[ИндексПоследнего - 1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ФактическиеДатыНачалаИОкончания		= РезультатПакета[ИндексПоследнего].Выгрузить();
	
	// РС упоДанныеПлановТрудозатратРолей И упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.
			
	СформироватьДвижения_ПланаТрудовыхРесурсов(ДеревоТрудозатрат, ТекущийПланТРПоЗадачам, 
		ТекущийПланРаспределенияТРПоЗадачам, ТаблицаИндексовСтрокРаспределения);	
								 				
	Если АктуализироватьПланПредварительногоУровняПоОкончательному Тогда	
		
		МассивЗадачАктуализации = Новый Массив;
		СформироватьДвижения_ПредварительныйПоОкончательному(МассивЗадачАктуализации);	
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗадач, МассивЗадачАктуализации, Истина);
		
	КонецЕсли;	
	
	// Проверка отложенных трудозатрат.
	
	// Если очередь создана текущим проведенным документом, то ее не проверяем,
	// а если распроведенным, то очередь необходимо отразить.
	ДокументОтбора = Неопределено;
	Если ДополнительныеСвойства.Свойство("ДокументПроведенПередЗаписью") 
		И ДополнительныеСвойства.ДокументПроведенПередЗаписью Тогда
		ДокументОтбора = ЭтотОбъект.Ссылка;
	КонецЕсли;
	
	ЕстьОтложенныеТрудозатраты = 
		упоРаботаСОчередямиВызовСервера.ЕстьОтложенныеТрудозатраты(МассивЗадач, ДокументОтбора, Истина);
	
	Если ЕстьОтложенныеТрудозатраты Тогда
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;			
	
	//
	
	Если Движения.упоДанныеПлановТрудозатратРолей.Количество() Тогда
		Движения.упоДанныеПлановТрудозатратРолей.Записать();
	КонецЕсли;
	Если Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Количество() Тогда
		Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Записать();
	КонецЕсли;	
	
	ДопЗадачиДляАктуализацииТрудозатрат = Неопределено;
	Если ДополнительныеСвойства.Свойство("ДопЗадачиДляАктуализацииТрудозатрат", ДопЗадачиДляАктуализацииТрудозатрат) 
		И ДопЗадачиДляАктуализацииТрудозатрат <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗадач, ДопЗадачиДляАктуализацииТрудозатрат, Истина);	
	КонецЕсли;
	
	// РС упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.		
	СформироватьДвижения_ТрудозатратыРесурсовПоДням(МассивЗадач);
	
	// Факт трудозатрат.
	Если ЗаписыватьФактОтчетногоПериода Тогда	 	
		СформироватьДвижения_ТрудозатратыФакт(ТаблицаЗадачФакта);
		СформироватьДвижения_ИспользованиеРабочегоВремени(ТаблицаЗадачФакта);
	КонецЕсли;	
	
	// Проценты готовности и фактические сроки.
	Если ЗаписыватьПроцентГотовности Тогда		
		СформироватьДвижения_ПроцентыГотовности(ДеревоПроцентГотовности, РежимПроведения, Отказ);
		СформироватьДвижения_ФактическиеДатыНачалаИОкончанияПроектныхЗадач(ФактическиеДатыНачалаИОкончания);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ Тогда		
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если ДополнительныеСвойства.Свойство("НеОбновлятьДатуДокумента") Тогда
				НеОбновлятьДатуДокумента = ДополнительныеСвойства.НеОбновлятьДатуДокумента;
			Иначе
				НеОбновлятьДатуДокумента = Ложь;
			КонецЕсли;
			Если НЕ НеОбновлятьДатуДокумента Тогда
				Дата = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;	
		
		ЗаполнитьЗадачиИзБазыДляОбновленияТрудозатрат(РежимЗаписи);
		
		ДополнительныеСвойства.Вставить("ДокументПроведенПередЗаписью", ЭтотОбъект.Проведен);
		
	КонецЕсли;
				
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		СрокиПоУмолчанию = ПолучитьСрокиПоУмолчанию();
		ЭтотОбъект.НачалоПериода = СрокиПоУмолчанию.НачалоПериода;	
		ЭтотОбъект.КонецПериода = СрокиПоУмолчанию.КонецПериода;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		
		НачальноеЗаполнениеТекДокументаПоПроекту(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		НачальноеЗаполнениеТекДокументаПоСтруктуре(ДанныеЗаполнения);	
				
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры 
 
Процедура ПриКопировании(ОбъектКопирования)
	
	УровеньГруппировок = 3;
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
			
	МассивЗадач = Неопределено;
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДопЗадачиДляАктуализацииТрудозатрат", МассивЗадач) Тогда	
		упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(МассивЗадач, ЭтотОбъект.Ссылка);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьВозможностьСписанияФактическихЗатрат(Отказ)

	Если Не ЗаписыватьФактОтчетногоПериода Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляПроверки = Данные.Выгрузить(Новый Структура("ФактДругихДокументов, Записывать", Ложь, Истина), "ПроектнаяЗадачаЗеркало");
	Если Не ЗначениеЗаполнено(ДанныеДляПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	// Проведение в привилегированном режиме.
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПЗ.ПроектнаяЗадачаЗеркало КАК Задача
	               |ПОМЕСТИТЬ ПЗ
	               |ИЗ
	               |	&ПЗ КАК ПЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПЗ.Задача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
				   |	ПЗ.Задача.упоКорневойПроект КАК Проект,
				   |	&ДатаПроверкиСтатуса КАК ДатаСтатуса
				   |ИЗ
	               |	ПЗ КАК ПЗ";
				   
	ДатаПроверкиСтатуса = ДобавитьМесяц(НачалоПериода, - 1);
	Запрос.УстановитьПараметр("ДатаПроверкиСтатуса", ДатаПроверкиСтатуса);
	Запрос.УстановитьПараметр("ПЗ", ДанныеДляПроверки);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	КонецПериодаПроверкиСтатуса = КонецМесяца(ДатаПроверкиСтатуса);
	
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоОстановленнымПроектамЗаПериод(
		ТЗ, ДатаПроверкиСтатуса, КонецПериодаПроверкиСтатуса, Отказ);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоПроектамСУчетомСтатуса(
			ТЗ, ПараметрыСеанса.упоТекущийСотрудник, "ЗапланированУтвержден", Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.упоРазрешитьРаспределениеРабочегоВремениПоЗакрытымЗадачам.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПЗ = ТЗ.ВыгрузитьКолонку("ПроектнаяЗадача");  
	МассивЗаданий = Новый Массив;
	упоРаспределениеТрудозатратВызовСервера.ПроверитьВозможностьСписанияФактическихЗатратПоЗакрытымЗадачам(
		МассивПЗ, 
		МассивЗаданий,
		Отказ);
		
КонецПроцедуры

Функция ПолучитьПакетДляФормированияДвижений()
	
	РаспределениеОстатковПоПериодам = ТаблицаРаспределениеОстатковПоПериодам();
	
	Если ЗаписыватьФактОтчетногоПериода Тогда
		НачалоОтчетногоПериода = ДобавитьМесяц(ЭтотОбъект.НачалоПериода, -1);
	Иначе
		НачалоОтчетногоПериода = ЭтотОбъект.НачалоПериода;
	КонецЕсли;
	КонецОтчетногоПериода = КонецМесяца(НачалоОтчетногоПериода);
	
	ПоследнийРабочийДеньПериодаДокумента =
		ПоследнийРабочийДеньПериодаДокумента(НачалоОтчетногоПериода, КонецОтчетногоПериода);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("УровеньПланирования", УровеньПланированияРолей);
	Запрос.УстановитьПараметр("УровеньПланированияПредварительный", Перечисления.упоУровеньПланирования.Предварительный);
	Запрос.УстановитьПараметр("АктуализироватьПланПоФактическимДанным", АктуализироватьПланПоФактическимДанным);
	Запрос.УстановитьПараметр("РаспределениеОстатковПоПериодам", РаспределениеОстатковПоПериодам);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("ЗаписыватьФактОтчетногоПериода", ЗаписыватьФактОтчетногоПериода);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", КонецОтчетногоПериода);
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода", НачалоОтчетногоПериода);
	Запрос.УстановитьПараметр("ЗаписыватьПроцентГотовности", ЗаписыватьПроцентГотовности);
	Запрос.УстановитьПараметр("НеУменьшатьЗаписанныйПроцентГотовности", НеУменьшатьЗаписанныйПроцентГотовности);
	Запрос.УстановитьПараметр("ПоследнийРабочийДеньПериодаДокумента", ПоследнийРабочийДеньПериодаДокумента);
	// Проведение в привилегированном режиме.
	Запрос.Текст = "ВЫБРАТЬ
		|    РаспределениеОстатковПоПериодам.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    РаспределениеОстатковПоПериодам.Подразделение КАК Подразделение,
		|    РаспределениеОстатковПоПериодам.Роль КАК Роль,
		|    РаспределениеОстатковПоПериодам.Дата КАК Дата,
		|    РаспределениеОстатковПоПериодам.Трудозатраты КАК Трудозатраты
		|ПОМЕСТИТЬ РаспределениеОстатковПоПериодам
		|ИЗ
		|    &РаспределениеОстатковПоПериодам КАК РаспределениеОстатковПоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ЗадачиДокумента.Подразделение КАК Подразделение,
		|    ЗадачиДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    ЗадачиДокумента.ПроектнаяЗадачаЗеркало.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|    ЗадачиДокумента.Роль КАК Роль,
		|    ЗадачиДокумента.ДатаЗавершенияТП КАК ДатаЗавершенияТП,
		|    упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|    упоСвойстваПроектныхЗадачСрезПоследних.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
		|    упоВерсииПроекта.Версия КАК Версия,
		|    ЗадачиДокумента.ФактОтчетногоПериода КАК ФактОтчетногоПериода,
		|    упоСвойстваПроектныхЗадачСрезПоследних.ВидОперации КАК ВидОперации,
		|    ЗадачиДокумента.ПроцентГотовностиЗадачи КАК ПроцентГотовности,
		|    ЗадачиДокумента.ФактДругихДокументов КАК ФактДругихДокументов,
		|    упоВерсииПроекта.Проект КАК Проект,
		|    ЗадачиДокумента.ДатаНачалаФакт КАК ДатаНачалаФакт,
		|    ЗадачиДокумента.ДатаЗавершенияФакт КАК ДатаЗавершенияФакт
		|ПОМЕСТИТЬ ЗадачиДокумента
		|ИЗ
		|    Документ.упоПрогнозТрудозатратПоРолям.Данные КАК ЗадачиДокумента
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		|            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|            ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		|                И (упоВерсииПроекта.Текущая)
		|        ПО ЗадачиДокумента.ПроектнаяЗадачаЗеркало.СсылкаНаПроектнуюЗадачу = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|ГДЕ
		|    ЗадачиДокумента.Записывать
		|    И ЗадачиДокумента.Ссылка = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|    ЗадачиДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ЗадачиДокумента.Версия КАК Версия,
		|    ЗадачиДокумента.ДатаНачалаФакт КАК ДатаНачалаФакт,
		|    ЗадачиДокумента.ДатаЗавершенияФакт КАК ДатаЗавершенияФакт,
		|    ЗадачиДокумента.ПроектнаяЗадачаЗеркало.КодСДР КАК КодСДР,
		|    ЗадачиДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    ЗадачиДокумента.ПроцентГотовности КАК ПроцентГотовности,
		|    ЗадачиДокумента.ВидОперации КАК ВидОперации,
		|    ЗадачиДокумента.Проект КАК Проект
		|ПОМЕСТИТЬ РазличныеЗадачиДокумента
		|ИЗ
		|    ЗадачиДокумента КАК ЗадачиДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|    ЗадачиДокумента.Подразделение КАК Подразделение,
		|    ЗадачиДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ЗадачиДокумента.Роль КАК Роль,
		|    ЗадачиДокумента.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|    ЗадачиДокумента.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
		|    НормыСтоимостиВнутренние.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    ЕСТЬNULL(НормыСтоимостиВнутренние.ЕдСтоимость, 0) КАК ЕдСтоимость,
		|    ЕСТЬNULL(НормыСтоимостиВнутренние.ЕдиницаНормирования.Коэффициент, 1) КАК КоэффициентЕдНормирования,
		|    ЕСТЬNULL(НормыСтоимостиВнешние.ЕдСтоимость, 0) КАК ВнешняяЕдСтоимость,
		|    ЕСТЬNULL(НормыСтоимостиВнутренние.ЕдиницаНормирования.Коэффициент, 1) КАК ВнешняяКоэффициентЕдНормирования,
		|    ЗадачиДокумента.Версия КАК Версия,
		|    ЗадачиДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    НормыСтоимостиВнешние.ЕдиницаНормирования КАК ВнешняяЕдиницаНормирования,
		|    ЗадачиДокумента.ДатаЗавершенияТП КАК ДатаЗавершенияТП,
		|    ЗадачиДокумента.ФактОтчетногоПериода КАК ФактОтчетногоПериода,
		|    ЗадачиДокумента.ВидОперации КАК ВидОперации,
		|    ЗадачиДокумента.ФактДругихДокументов КАК ФактДругихДокументов,
		|    ЗадачиДокумента.Проект КАК Проект,
		|    ЕСТЬNULL(НормыСтоимостиПериодФакта.ЕдСтоимость, 0) * ЕСТЬNULL(НормыСтоимостиПериодФакта.ЕдиницаНормирования.Коэффициент, 1) КАК ПриведеннаяЕдСтоимостьФакта
		|ПОМЕСТИТЬ ЗадачиДокументаДопДанные
		|ИЗ
		|    ЗадачиДокумента КАК ЗадачиДокумента
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(, ) КАК НормыСтоимостиВнутренние
		|        ПО ЗадачиДокумента.Роль = НормыСтоимостиВнутренние.Ресурс
		|            И ЗадачиДокумента.НормаСтоимостиТрудовыхРесурсов = НормыСтоимостиВнутренние.Норма
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(, ) КАК НормыСтоимостиВнешние
		|        ПО ЗадачиДокумента.Роль = НормыСтоимостиВнешние.Ресурс
		|            И ЗадачиДокумента.ВнешняяНормаСтоимостиТрудовыхРесурсов = НормыСтоимостиВнешние.Норма
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(&КонецОтчетногоПериода, &ЗаписыватьФактОтчетногоПериода) КАК НормыСтоимостиПериодФакта
		|        ПО ЗадачиДокумента.Роль = НормыСтоимостиПериодФакта.Ресурс
		|            И ЗадачиДокумента.НормаСтоимостиТрудовыхРесурсов = НормыСтоимостиПериодФакта.Норма
		|
		|ИНДЕКСИРОВАТЬ ПО
		|    ПроектнаяЗадача,
		|    Роль,
		|    Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    упоФактТрудозатратПоДням.Операция КАК ПроектнаяЗадача,
		|    упоФактТрудозатратПоДням.Ресурс КАК Роль,
		|    упоФактТрудозатратПоДням.Подразделение КАК Подразделение,
		|    НАЧАЛОПЕРИОДА(упоФактТрудозатратПоДням.День, МЕСЯЦ) КАК Месяц,
		|    СУММА(упоФактТрудозатратПоДням.Трудозатраты) КАК Трудозатраты
		|ПОМЕСТИТЬ ТрудозатратыФактДоОтчетногоПериода
		|ИЗ
		|    РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|        ПО (&АктуализироватьПланПоФактическимДанным)
		|            И упоФактТрудозатратПоДням.Операция = РазличныеЗадачиДокумента.ПроектнаяЗадача
		|ГДЕ
		|    упоФактТрудозатратПоДням.День < &НачалоПериода
		|    И упоФактТрудозатратПоДням.УровеньПланирования = &УровеньПланированияПредварительный
		|
		|СГРУППИРОВАТЬ ПО
		|    упоФактТрудозатратПоДням.Операция,
		|    упоФактТрудозатратПоДням.Роль,
		|    упоФактТрудозатратПоДням.УровеньПланирования,
		|    упоФактТрудозатратПоДням.Подразделение,
		|    упоФактТрудозатратПоДням.Ресурс,
		|    НАЧАЛОПЕРИОДА(упоФактТрудозатратПоДням.День, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ТрудозатратыФактДоОтчетногоПериода.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ТрудозатратыФактДоОтчетногоПериода.Роль КАК Роль,
		|    ТрудозатратыФактДоОтчетногоПериода.Подразделение КАК Подразделение,
		|    ТрудозатратыФактДоОтчетногоПериода.Месяц КАК Месяц,
		|    ТрудозатратыФактДоОтчетногоПериода.Трудозатраты КАК Трудозатраты
		|ПОМЕСТИТЬ ТрудозатратыФактДоПериода
		|ИЗ
		|    ТрудозатратыФактДоОтчетногоПериода КАК ТрудозатратыФактДоОтчетногоПериода
		|ГДЕ
		|    ТрудозатратыФактДоОтчетногоПериода.Месяц < &НачалоОтчетногоПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|    ТрудозатратыФактДоОтчетногоПериода.ПроектнаяЗадача,
		|    ТрудозатратыФактДоОтчетногоПериода.Роль,
		|    ТрудозатратыФактДоОтчетногоПериода.Подразделение,
		|    ТрудозатратыФактДоОтчетногоПериода.Месяц,
		|    ТрудозатратыФактДоОтчетногоПериода.Трудозатраты
		|ИЗ
		|    ТрудозатратыФактДоОтчетногоПериода КАК ТрудозатратыФактДоОтчетногоПериода
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадачиДокумента КАК ЗадачиДокумента
		|        ПО ТрудозатратыФактДоОтчетногоПериода.ПроектнаяЗадача = ЗадачиДокумента.ПроектнаяЗадача
		|            И ТрудозатратыФактДоОтчетногоПериода.Подразделение = ЗадачиДокумента.Подразделение
		|            И ТрудозатратыФактДоОтчетногоПериода.Роль = ЗадачиДокумента.Роль
		|            И (ЗадачиДокумента.ФактДругихДокументов)
		|ГДЕ
		|    ТрудозатратыФактДоОтчетногоПериода.Месяц >= &НачалоОтчетногоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция КАК ПроектнаяЗадача,
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс КАК Роль,
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение КАК Подразделение,
		|    НАЧАЛОПЕРИОДА(упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День, МЕСЯЦ) КАК Месяц,
		|    СУММА(упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты) КАК Трудозатраты
		|ПОМЕСТИТЬ ТрудозатратыПланДоПериода
		|ИЗ
		|    РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|        ПО (НЕ &АктуализироватьПланПоФактическимДанным)
		|            И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Проект = РазличныеЗадачиДокумента.Проект
		|            И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция = РазличныеЗадачиДокумента.ПроектнаяЗадача
		|ГДЕ
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланирования
		|    И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День < &НачалоПериода
		|    И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы)
		|
		|СГРУППИРОВАТЬ ПО
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция,
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Роль,
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования,
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение,
		|    упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс,
		|    НАЧАЛОПЕРИОДА(упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ТрудозатратыПланДоПериода.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ТрудозатратыПланДоПериода.Роль КАК Роль,
		|    ТрудозатратыПланДоПериода.Подразделение КАК Подразделение,
		|    ТрудозатратыПланДоПериода.Месяц КАК Месяц,
		|    ТрудозатратыПланДоПериода.Трудозатраты КАК Трудозатраты
		|ПОМЕСТИТЬ ТрудозатратыДоПериода
		|ИЗ
		|    ТрудозатратыПланДоПериода КАК ТрудозатратыПланДоПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|    ТрудозатратыФактДоПериода.ПроектнаяЗадача,
		|    ТрудозатратыФактДоПериода.Роль,
		|    ТрудозатратыФактДоПериода.Подразделение,
		|    ТрудозатратыФактДоПериода.Месяц,
		|    ТрудозатратыФактДоПериода.Трудозатраты
		|ИЗ
		|    ТрудозатратыФактДоПериода КАК ТрудозатратыФактДоПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|    упоПрогнозТрудозатратПоРолямДанные.ПроектнаяЗадачаЗеркало.СсылкаНаПроектнуюЗадачу,
		|    упоПрогнозТрудозатратПоРолямДанные.Роль,
		|    упоПрогнозТрудозатратПоРолямДанные.Подразделение,
		|    &НачалоОтчетногоПериода,
		|    упоПрогнозТрудозатратПоРолямДанные.ФактОтчетногоПериода
		|ИЗ
		|    Документ.упоПрогнозТрудозатратПоРолям.Данные КАК упоПрогнозТрудозатратПоРолямДанные
		|ГДЕ
		|    упоПрогнозТрудозатратПоРолямДанные.Ссылка = &Документ
		|    И НЕ упоПрогнозТрудозатратПоРолямДанные.ФактДругихДокументов
		|    И упоПрогнозТрудозатратПоРолямДанные.ФактОтчетногоПериода > 0
		|    И &АктуализироватьПланПоФактическимДанным
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|    ЗадачиДокументаДопДанные.Подразделение КАК Подразделение,
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ЗадачиДокументаДопДанные.Роль КАК Роль,
		|    ЗадачиДокументаДопДанные.ДатаЗавершенияТП КАК ДатаЗавершенияТП,
		|    ТрудозатратыДоПериода.Месяц КАК Месяц,
		|    ТрудозатратыДоПериода.Трудозатраты КАК Трудозатраты,
		|    ЗадачиДокументаДопДанные.Версия КАК Версия,
		|    ЗадачиДокументаДопДанные.ВнешняяЕдиницаНормирования КАК ВнешняяЕдиницаНормирования,
		|    ЗадачиДокументаДопДанные.ВнешняяКоэффициентЕдНормирования КАК ВнешняяКоэффициентЕдНормирования,
		|    ЗадачиДокументаДопДанные.ВнешняяЕдСтоимость КАК ВнешняяЕдСтоимость,
		|    ЗадачиДокументаДопДанные.КоэффициентЕдНормирования КАК КоэффициентЕдНормирования,
		|    ЗадачиДокументаДопДанные.ЕдСтоимость КАК ЕдСтоимость,
		|    ЗадачиДокументаДопДанные.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    ЗадачиДокументаДопДанные.Проект КАК Проект
		|ПОМЕСТИТЬ ПолнаяТаблица
		|ИЗ
		|    ЗадачиДокументаДопДанные КАК ЗадачиДокументаДопДанные
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТрудозатратыДоПериода КАК ТрудозатратыДоПериода
		|        ПО ЗадачиДокументаДопДанные.ПроектнаяЗадача = ТрудозатратыДоПериода.ПроектнаяЗадача
		|            И ЗадачиДокументаДопДанные.Роль = ТрудозатратыДоПериода.Роль
		|            И ЗадачиДокументаДопДанные.Подразделение = ТрудозатратыДоПериода.Подразделение
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|    ЗадачиДокументаДопДанные.Подразделение,
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадачаЗеркало,
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадача,
		|    ЗадачиДокументаДопДанные.Роль,
		|    ЗадачиДокументаДопДанные.ДатаЗавершенияТП,
		|    упоПрогнозТрудозатратРаспределениеПоПериоду.Дата,
		|    упоПрогнозТрудозатратРаспределениеПоПериоду.Трудозатраты,
		|    ЗадачиДокументаДопДанные.Версия,
		|    ЗадачиДокументаДопДанные.ВнешняяЕдиницаНормирования,
		|    ЗадачиДокументаДопДанные.ВнешняяКоэффициентЕдНормирования,
		|    ЗадачиДокументаДопДанные.ВнешняяЕдСтоимость,
		|    ЗадачиДокументаДопДанные.КоэффициентЕдНормирования,
		|    ЗадачиДокументаДопДанные.ЕдСтоимость,
		|    ЗадачиДокументаДопДанные.ЕдиницаНормирования,
		|    ЗадачиДокументаДопДанные.Проект
		|ИЗ
		|    ЗадачиДокументаДопДанные КАК ЗадачиДокументаДопДанные
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПрогнозТрудозатратПоРолям.РаспределениеПоПериоду КАК упоПрогнозТрудозатратРаспределениеПоПериоду
		|        ПО ЗадачиДокументаДопДанные.ПроектнаяЗадачаЗеркало = упоПрогнозТрудозатратРаспределениеПоПериоду.ПроектнаяЗадачаЗеркало
		|            И ЗадачиДокументаДопДанные.Роль = упоПрогнозТрудозатратРаспределениеПоПериоду.Роль
		|            И ЗадачиДокументаДопДанные.Подразделение = упоПрогнозТрудозатратРаспределениеПоПериоду.Подразделение
		|            И (упоПрогнозТрудозатратРаспределениеПоПериоду.Ссылка = &Документ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|    ЗадачиДокументаДопДанные.Подразделение,
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадачаЗеркало,
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадача,
		|    ЗадачиДокументаДопДанные.Роль,
		|    ЗадачиДокументаДопДанные.ДатаЗавершенияТП,
		|    РаспределениеОстатковПоПериодам.Дата,
		|    РаспределениеОстатковПоПериодам.Трудозатраты,
		|    ЗадачиДокументаДопДанные.Версия,
		|    ЗадачиДокументаДопДанные.ВнешняяЕдиницаНормирования,
		|    ЗадачиДокументаДопДанные.ВнешняяКоэффициентЕдНормирования,
		|    ЗадачиДокументаДопДанные.ВнешняяЕдСтоимость,
		|    ЗадачиДокументаДопДанные.КоэффициентЕдНормирования,
		|    ЗадачиДокументаДопДанные.ЕдСтоимость,
		|    ЗадачиДокументаДопДанные.ЕдиницаНормирования,
		|    ЗадачиДокументаДопДанные.Проект
		|ИЗ
		|    ЗадачиДокументаДопДанные КАК ЗадачиДокументаДопДанные
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспределениеОстатковПоПериодам КАК РаспределениеОстатковПоПериодам
		|        ПО ЗадачиДокументаДопДанные.ПроектнаяЗадачаЗеркало = РаспределениеОстатковПоПериодам.ПроектнаяЗадачаЗеркало
		|            И ЗадачиДокументаДопДанные.Роль = РаспределениеОстатковПоПериодам.Роль
		|            И ЗадачиДокументаДопДанные.Подразделение = РаспределениеОстатковПоПериодам.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ПолнаяТаблица.Подразделение КАК Подразделение,
		|    ПолнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ПолнаяТаблица.Роль КАК Роль,
		|    ПолнаяТаблица.Месяц КАК Месяц,
		|    ПолнаяТаблица.Трудозатраты КАК Трудозатраты,
		|    ПолнаяТаблица.Проект КАК Проект,
		|    ПолнаяТаблица.Версия КАК Версия,
		|    &УровеньПланирования КАК УровеньПланирования,
		|    ПолнаяТаблица.ВнешняяЕдиницаНормирования КАК ВнешняяЕдиницаНормирования,
		|    ПолнаяТаблица.ВнешняяЕдСтоимость КАК ВнешняяЕдСтоимость,
		|    ПолнаяТаблица.ВнешняяКоэффициентЕдНормирования КАК ВнешняяКоэффициентЕдНормирования,
		|    ПолнаяТаблица.КоэффициентЕдНормирования КАК КоэффициентЕдНормирования,
		|    ПолнаяТаблица.ЕдСтоимость КАК ЕдСтоимость,
		|    ПолнаяТаблица.ЕдиницаНормирования КАК ЕдиницаНормирования
		|ИЗ
		|    ПолнаяТаблица КАК ПолнаяТаблица
		|ИТОГИ
		|    СУММА(Трудозатраты),
		|    МАКСИМУМ(Версия),
		|    МАКСИМУМ(ВнешняяЕдиницаНормирования),
		|    МАКСИМУМ(ВнешняяЕдСтоимость),
		|    МАКСИМУМ(ВнешняяКоэффициентЕдНормирования),
		|    МАКСИМУМ(КоэффициентЕдНормирования),
		|    МАКСИМУМ(ЕдСтоимость),
		|    МАКСИМУМ(ЕдиницаНормирования)
		|ПО
		|    Проект,
		|    ПроектнаяЗадача,
		|    Роль,
		|    Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Ресурс,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Версия КАК Версия,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ИсточникПлана КАК ИсточникПлана,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент КАК КоэффициентЕдИзмерения,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.СпособПривязки КАК СпособПривязки,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования КАК УровеньПланирования,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Количество КАК Количество,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость КАК Стоимость,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Основной КАК Основной,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ВнешняяСтоимость КАК ВнешняяСтоимость,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость КАК ОбщСтоимость
		|ИЗ
		|    РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, ) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|        ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = РазличныеЗадачиДокумента.Версия
		|            И (упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования = &УровеньПланирования)
		|            И упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = РазличныеЗадачиДокумента.ПроектнаяЗадача
		|ГДЕ
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы)
		|
		|УПОРЯДОЧИТЬ ПО
		|    Количество УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.Версия КАК Версия,
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.ПериодРаспределения КАК ПериодРаспределения,
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
		|    упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.Количество КАК Количество
		|ИЗ
		|    РегистрСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.СрезПоследних(, ) КАК упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|        ПО упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.Версия = РазличныеЗадачиДокумента.Версия
		|            И упоДанныеРаспределенияПланаТрудозатратРолейПоПериодамСрезПоследних.ПроектнаяЗадача = РазличныеЗадачиДокумента.ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    РазличныеЗадачиДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача
		|ИЗ
		|    РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    МАКСИМУМ(упоДанныеПлановТрудозатратРолейСрезПоследних.ИндексСтрокРаспределения) КАК ИндексСтрокРаспределения
		|ИЗ
		|    РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, ) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|        ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = РазличныеЗадачиДокумента.Версия
		|            И упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = РазличныеЗадачиДокумента.ПроектнаяЗадача
		|ГДЕ
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы)
		|
		|СГРУППИРОВАТЬ ПО
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадача КАК Операция,
		|    ЗадачиДокументаДопДанные.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    ЗадачиДокументаДопДанные.Роль КАК Роль,
		|    ЗадачиДокументаДопДанные.Подразделение КАК Подразделение,
		|    ЗадачиДокументаДопДанные.ВидОперации КАК ВидОперации,
		|    ЗадачиДокументаДопДанные.ВидОперации.РазделУчета КАК РазделУчетаВидаОперации,
		|    ЗадачиДокументаДопДанные.ФактОтчетногоПериода КАК Трудозатраты,
		|    ЗадачиДокументаДопДанные.ПриведеннаяЕдСтоимостьФакта * ЗадачиДокументаДопДанные.ФактОтчетногоПериода КАК Стоимость,
		|    &ПоследнийРабочийДеньПериодаДокумента КАК День
		|ИЗ
		|    ЗадачиДокументаДопДанные КАК ЗадачиДокументаДопДанные
		|ГДЕ
		|    &ЗаписыватьФактОтчетногоПериода
		|    И НЕ ЗадачиДокументаДопДанные.ФактДругихДокументов
		|    И ЗадачиДокументаДопДанные.ФактОтчетногоПериода > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    РазличныеЗадачиДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    РазличныеЗадачиДокумента.ПроцентГотовности КАК ПроцентГотовности,
		|    РазличныеЗадачиДокумента.Проект КАК Проект,
		|    РазличныеЗадачиДокумента.Версия КАК Версия,
		|    ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) КАК ПроцентГотовностиЗаписанный,
		|    &НеУменьшатьЗаписанныйПроцентГотовности
		|        И РазличныеЗадачиДокумента.ПроцентГотовности < ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) КАК ЭтоПроцентГотовностиИзРегистра,
		|    РазличныеЗадачиДокумента.КодСДР КАК КодСДР,
		|    РазличныеЗадачиДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало
		|ИЗ
		|    РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
		|                ,
		|                &ЗаписыватьПроцентГотовности
		|                    И &НеУменьшатьЗаписанныйПроцентГотовности) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
		|        ПО РазличныеЗадачиДокумента.Версия = упоПроцентыГотовностиПроектныхЗадачСрезПоследних.Версия
		|            И РазличныеЗадачиДокумента.ПроектнаяЗадача = упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|ГДЕ
		|    &ЗаписыватьПроцентГотовности
		|ИТОГИ ПО
		|    Проект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    РазличныеЗадачиДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    РазличныеЗадачиДокумента.Версия КАК Версия,
		|    РазличныеЗадачиДокумента.ДатаНачалаФакт КАК ДатаНачала,
		|    РазличныеЗадачиДокумента.ДатаЗавершенияФакт КАК ДатаЗавершения
		|ИЗ
		|    РазличныеЗадачиДокумента КАК РазличныеЗадачиДокумента
		|ГДЕ
		|    &ЗаписыватьПроцентГотовности
		|    И (РазличныеЗадачиДокумента.ДатаНачалаФакт <> ДАТАВРЕМЯ(1, 1, 1)
		|            ИЛИ РазличныеЗадачиДокумента.ДатаЗавершенияФакт <> ДАТАВРЕМЯ(1, 1, 1))";
	
	Возврат Запрос;
	
КонецФункции

Функция ПоследнийРабочийДеньПериодаДокумента(НачалоОтчетногоПериода, КонецОтчетногоПериода)
	
	ПоследнийРабочийДеньПериодаДокумента = КонецОтчетногоПериода;
	
	Если Не ЗаписыватьПроцентГотовности Тогда
		Возврат ПоследнийРабочийДеньПериодаДокумента;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", КонецОтчетногоПериода);
	Запрос.УстановитьПараметр("НачалоОтчетногоПериода", НачалоОтчетногоПериода);
	Запрос.УстановитьПараметр("РабочийКалендарь", Константы.упоРабочийКалендарьПоУмолчанию.Получить());
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегКалендарь.День КАК День
	|ИЗ
	|	РегистрСведений.упоРабочиеКалендари.СрезПоследних(
	|			,
	|			(День МЕЖДУ &НачалоОтчетногоПериода И &КонецОтчетногоПериода)
	|				И Календарь = &РабочийКалендарь) КАК РегКалендарь
	|ГДЕ
	|	РегКалендарь.КоличествоЧасов > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	День УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПоследнийРабочийДеньПериодаДокумента = Выборка.День;
	КонецЕсли;
	
	Возврат ПоследнийРабочийДеньПериодаДокумента;
	
КонецФункции

Функция СформироватьДвижения_ПланаТрудовыхРесурсов(ДеревоТрудозатрат, ТекущийПланТРПоЗадачам, ТекущийПланРаспределенияТРПоЗадачам, ТаблицаИндексовСтрокРаспределения)
	
	врРаспределениеТР = ТекущийПланРаспределенияТРПоЗадачам.СкопироватьКолонки();
	
	Измерения_упоДанныеПлановТрудозатратРолей = "";
	Для Каждого Измерение Из Метаданные.РегистрыСведений.упоДанныеПлановТрудозатратРолей.Измерения Цикл
		Измерения_упоДанныеПлановТрудозатратРолей = Измерения_упоДанныеПлановТрудозатратРолей + ?(ЗначениеЗаполнено(Измерения_упоДанныеПлановТрудозатратРолей), ", ", "") + Измерение.Имя;
	КонецЦикла;
	
	Измерения_упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам = "";
	Для Каждого Измерение Из Метаданные.РегистрыСведений.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Измерения Цикл
		Измерения_упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам = Измерения_упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам + ?(ЗначениеЗаполнено(Измерения_упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам), ", ", "") + Измерение.Имя;
	КонецЦикла;
		
	Для Каждого СтрокаПроекта Из ДеревоТрудозатрат.Строки Цикл       
		Для Каждого СтрокаПЗ Из СтрокаПроекта.Строки Цикл
			
			НайденнаяСтрока = ТаблицаИндексовСтрокРаспределения.Найти(СтрокаПЗ.ПроектнаяЗадача, "ПроектнаяЗадача");
			Если НайденнаяСтрока = Неопределено Или НайденнаяСтрока.ИндексСтрокРаспределения = Неопределено Тогда
				СчетчикИндекса = 1;
			Иначе
				СчетчикИндекса = НайденнаяСтрока.ИндексСтрокРаспределения + 1;
			КонецЕсли;	
			
			Для Каждого СтрокаРоли Из СтрокаПЗ.Строки Цикл
				Для Каждого СтрокаПодразделения Из СтрокаРоли.Строки Цикл
					
					Отбор = Новый Структура;
					Отбор.Вставить("Ресурс", СтрокаРоли.Роль);
					Отбор.Вставить("УровеньПланирования", УровеньПланированияРолей);
					Отбор.Вставить("Подразделение", СтрокаПодразделения.Подразделение);
					Отбор.Вставить("ПроектнаяЗадача", СтрокаПЗ.ПроектнаяЗадача);
					
					СтрокиТекущегоПлана = ТекущийПланТРПоЗадачам.НайтиСтроки(Отбор);
					
					Запись = Движения.упоДанныеПлановТрудозатратРолей.Добавить();
					Запись.Период = Дата;
					Запись.Активность = Истина;
					Запись.Версия = СтрокаПЗ.Версия;
					Запись.ПроектнаяЗадача = СтрокаПЗ.ПроектнаяЗадача;
					Запись.УровеньПланирования = УровеньПланированияРолей;
					Запись.Ресурс = СтрокаПодразделения.Роль;
					Запись.Подразделение = СтрокаПодразделения.Подразделение;
					Запись.ИсточникПлана = Перечисления.упоИсточникПланаТрудозатратРолей.Трудозатраты;
					
					Запись.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.Вручную;
					Запись.ИндексСтрокРаспределения = СчетчикИндекса;														
					СчетчикИндекса = СчетчикИндекса + 1;
					
					Если СтрокиТекущегоПлана.Количество() > 0 Тогда
						Запись.ПрофильРаспределения = СтрокиТекущегоПлана[0].ПрофильРаспределения;
						Если ЗначениеЗаполнено(СтрокиТекущегоПлана[0].КоэффициентЕдИзмерения) Тогда
							Запись.Количество = СтрокаПодразделения.Трудозатраты / СтрокиТекущегоПлана[0].КоэффициентЕдИзмерения;
						Иначе
							Запись.Количество = 0;
						КонецЕсли;
						Запись.Стоимость = СтрокиТекущегоПлана[0].Стоимость;
						Запись.ВнешняяСтоимость = СтрокиТекущегоПлана[0].ВнешняяСтоимость;
						Запись.Основной = СтрокиТекущегоПлана[0].Основной;
						Запись.ЕдиницаНормирования = СтрокиТекущегоПлана[0].ЕдиницаНормирования;
					Иначе
						Запись.ПрофильРаспределения = Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение;
						Запись.Количество = СтрокаПодразделения.Трудозатраты / СтрокаПодразделения.КоэффициентЕдНормирования;
						Запись.ЕдиницаНормирования = Справочники.упоЕдиницыВремени.Час;
						Запись.Стоимость = СтрокаПодразделения.ЕдСтоимость / СтрокаПодразделения.КоэффициентЕдНормирования;				
						Запись.ВнешняяСтоимость = СтрокаПодразделения.ВнешняяЕдСтоимость / СтрокаПодразделения.ВнешняяКоэффициентЕдНормирования;
					КонецЕсли;		
					
					Запись.ОбщСтоимость = Запись.Стоимость * Окр(Запись.Количество, 2);  
					Запись.ОбщВнешняяСтоимость = Запись.ВнешняяСтоимость * Окр(Запись.Количество, 2);  
					
					врРаспределениеТР.Очистить();
					ЗаписьРаспределение = Неопределено;
					
					Для Каждого СтрокаДетальная Из СтрокаПодразделения.Строки Цикл
						ЗаписьРаспределение = Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Добавить();
						ЗаписьРаспределение.Активность = Истина;
						ЗаписьРаспределение.Период = Дата;
						ЗаписьРаспределение.Версия = Запись.Версия;
						ЗаписьРаспределение.ПроектнаяЗадача =  Запись.ПроектнаяЗадача;
						ЗаписьРаспределение.ПериодРаспределения =  КонецМесяца(СтрокаДетальная.Месяц);
						ЗаписьРаспределение.ИндексСтрокиРаспределениеПоРолям =  Запись.ИндексСтрокРаспределения;			
						ЗаписьРаспределение.Количество =  СтрокаДетальная.Трудозатраты / Запись.ЕдиницаНормирования.Коэффициент;
						ЗаполнитьЗначенияСвойств(врРаспределениеТР.Добавить(), ЗаписьРаспределение);
					КонецЦикла;
					
					Для Каждого СтрокаТекущегоПлана Из СтрокиТекущегоПлана Цикл
						
						ПолноеСовпадение = Истина;						
						СтруктураИзмерений = Новый Структура(Измерения_упоДанныеПлановТрудозатратРолей);
						
						Для Каждого КлючЗначение Из СтруктураИзмерений Цикл
							Если СтрокаТекущегоПлана[КлючЗначение.Ключ] <> Запись[КлючЗначение.Ключ] Тогда
								ПолноеСовпадение = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если НЕ ПолноеСовпадение Тогда
							ЗаписьОбнуления = Движения.упоДанныеПлановТрудозатратРолей.Добавить();
							ЗаполнитьЗначенияСвойств(ЗаписьОбнуления, СтрокаТекущегоПлана, Измерения_упоДанныеПлановТрудозатратРолей);
							ЗаписьОбнуления.Активность = Истина;
							ЗаписьОбнуления.Период = Дата;
						КонецЕсли;
						
						СтруктураИзмерений = Новый Структура(Измерения_упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам);
						
						СтрокиРаспределения = ТекущийПланРаспределенияТРПоЗадачам.НайтиСтроки(Новый Структура("ИндексСтрокиРаспределениеПоРолям, ПроектнаяЗадача", СтрокаТекущегоПлана.ИндексСтрокРаспределения, СтрокаТекущегоПлана.ПроектнаяЗадача));
						Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
													
							ЗаполнитьЗначенияСвойств(СтруктураИзмерений, СтрокаРаспределения, Измерения_упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам); 
							Если врРаспределениеТР.НайтиСтроки(СтруктураИзмерений).Количество() = 0 Тогда
								ЗаписьОбнуления = Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Добавить();
								ЗаполнитьЗначенияСвойств(ЗаписьОбнуления, СтруктураИзмерений);	
								ЗаписьОбнуления.Активность = Истина;
								ЗаписьОбнуления.Период = Дата;
							КонецЕсли;
									
							ТекущийПланРаспределенияТРПоЗадачам.Удалить(СтрокаРаспределения);
							
						КонецЦикла;
						
						ТекущийПланТРПоЗадачам.Удалить(СтрокаТекущегоПлана);
						
					КонецЦикла;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
КонецФункции 

Функция СформироватьДвижения_ТрудозатратыРесурсовПоДням(МассивЗадач)
		
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(МассивЗадач, ЭтотОбъект.Ссылка);	
		   	
КонецФункции 

Процедура НачальноеЗаполнениеТекДокументаПоПроекту(Проект)

	ЭтотОбъект.Проекты.Добавить().Проект = Проект;
	ЭтотОбъект.ПорядокГруппировок = Перечисления.упоПорядокГруппировокПрогнозированиеТрудозатрат.ПроектЗадачаРольПодразделение;
	
	лСрокиПроекта = ПолучитьСрокиПроектаДляЗаполнения(Проект);
	
	ЭтотОбъект.НачалоПериода = лСрокиПроекта.НачалоПериода;
	ЭтотОбъект.КонецПериода = лСрокиПроекта.КонецПериода;	
	
КонецПроцедуры	

Процедура НачальноеЗаполнениеТекДокументаПоСтруктуре(Структура)
	
	Если Структура.Свойство("Проект") Тогда
		Проекты.Очистить();
		Проекты.Добавить().Проект = Структура.Проект;	
	КонецЕсли;
	Если Структура.Свойство("ПорядокГруппировок") Тогда
		ЭтотОбъект.ПорядокГруппировок = Структура.ПорядокГруппировок;	
	КонецЕсли;
	Если Структура.Свойство("НачалоПериода") И Структура.Свойство("КонецПериода") Тогда
		ЭтотОбъект.НачалоПериода = Структура.НачалоПериода;	
		ЭтотОбъект.КонецПериода = Структура.КонецПериода;	
	ИначеЕсли Структура.Свойство("Проект") Тогда
		СрокиПроекта = ПолучитьСрокиПроектаДляЗаполнения(Структура.Проект);
		ЭтотОбъект.НачалоПериода = СрокиПроекта.НачалоПериода;	
		ЭтотОбъект.КонецПериода = СрокиПроекта.КонецПериода;	
	Иначе
		СрокиПоУмолчанию = ПолучитьСрокиПоУмолчанию();
		ЭтотОбъект.НачалоПериода = СрокиПоУмолчанию.НачалоПериода;	
		ЭтотОбъект.КонецПериода = СрокиПоУмолчанию.КонецПериода;
	КонецЕсли;
	Если Структура.Свойство("Роли") Тогда
		ЭтотОбъект.Роли.Очистить();
		Для Каждого Роль ИЗ Структура.Роли Цикл
			ЭтотОбъект.Роли.Добавить().Роль = Роль;	
		КонецЦикла;
	КонецЕсли;
	Если Структура.Свойство("Проекты") Тогда
		ЭтотОбъект.Проекты.Очистить();
		Для Каждого Проект ИЗ Структура.Проекты Цикл
			ЭтотОбъект.Проекты.Добавить().Проект = Проект;	
		КонецЦикла;
	КонецЕсли;
	Если Структура.Свойство("УровеньПланированияРолей") Тогда
		ЭтотОбъект.УровеньПланированияРолей = Структура.УровеньПланированияРолей;
	КонецЕсли;
	Если Структура.Свойство("Комментарий") Тогда
		ЭтотОбъект.Комментарий = Структура.Комментарий;
	КонецЕсли;
	Если Структура.Свойство("ПоказатьДиаграмму") Тогда
		ЭтотОбъект.ПоказатьДиаграмму = Структура.ПоказатьДиаграмму;
	КонецЕсли;
	Если Структура.Свойство("АктуализироватьПланПоФактическимДанным") Тогда
		ЭтотОбъект.АктуализироватьПланПоФактическимДанным = Структура.АктуализироватьПланПоФактическимДанным;
	КонецЕсли;
	Если Структура.Свойство("ИсключатьЗадачиСПодчиненнымиПроектами") Тогда
		ЭтотОбъект.ИсключатьЗадачиСПодчиненнымиПроектами = Структура.ИсключатьЗадачиСПодчиненнымиПроектами;
	КонецЕсли;
	Если Структура.Свойство("Подразделения") Тогда
		ЭтотОбъект.ПодразделенияОтбор.Очистить();
		Для Каждого Подразделение Из Структура.Подразделения Цикл
			ЭтотОбъект.ПодразделенияОтбор.Добавить().Подразделение = Подразделение;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьСрокиПроектаДляЗаполнения(Проект) 
	
	лНачалоПериода = НачалоМесяца(упоПоказателиПроектовСервер.ПолучитьТекДатуДляПоказателейФОТ());
	лСрокиПроекта = упоПроектыИЗадачиСервер.ПолучитьПланируемыеСрокиПроекта(Проект, Неопределено, Ложь);
	лКонецПериода = лСрокиПроекта.ДатаЗавершенияПлан;	
	лКонецПериода = ?(ЗначениеЗаполнено(лКонецПериода), КонецМесяца(лКонецПериода), лКонецПериода);
	
	Возврат Новый Структура("НачалоПериода, КонецПериода", лНачалоПериода, лКонецПериода);
	
КонецФункции 

Функция ПолучитьСрокиПоУмолчанию() 
	
	лНачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	лКонецПериода = КонецМесяца(ДобавитьМесяц(лНачалоПериода, 5));
		
	Возврат Новый Структура("НачалоПериода, КонецПериода", лНачалоПериода, лКонецПериода);
	
КонецФункции 

Функция ПакетДляФормированияДвиженийПредварительныйПоОкончательному()
		
	ТаблицаТрудозатратыОконч = Движения.упоДанныеПлановТрудозатратРолей.Выгрузить(,
		"ПроектнаяЗадача, Подразделение, ЕдиницаНормирования, ИндексСтрокРаспределения, Количество");
	ТаблицаТрудозатратыОконч.Свернуть("ПроектнаяЗадача, Подразделение, ЕдиницаНормирования, ИндексСтрокРаспределения", 
		"Количество");
	
	ТаблицаТрудозатратыПоПериодамОконч = Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Выгрузить(,
		"ПроектнаяЗадача, ПериодРаспределения,ИндексСтрокиРаспределениеПоРолям, Количество");
	ТаблицаТрудозатратыПоПериодамОконч.Свернуть("ПроектнаяЗадача, ПериодРаспределения,ИндексСтрокиРаспределениеПоРолям",
	    "Количество");
	//
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Ссылка);		
	Запрос.УстановитьПараметр("УровеньПланированияПредварительный", Перечисления.упоУровеньПланирования.Предварительный);	
	Запрос.УстановитьПараметр("УровеньПланированияОкончательный", 	Перечисления.упоУровеньПланирования.Окончательный);	
	Запрос.УстановитьПараметр("РезервРПЗ", 							Справочники.упоСобственныеСилыСубподряд.РПО);		
	Запрос.УстановитьПараметр("СпособПривязкиВручную", 				Перечисления.упоСпособПривязкиРаспределения.Вручную);		
	Запрос.УстановитьПараметр("ТаблицаТрудозатратыОконч", 			ТаблицаТрудозатратыОконч);		
	Запрос.УстановитьПараметр("ТаблицаТрудозатратыПоПериодамОконч", ТаблицаТрудозатратыПоПериодамОконч);		
		
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Таблица.Подразделение КАК Подразделение,
	               |	ВЫРАЗИТЬ(Таблица.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени) КАК ЕдиницаНормирования,
	               |	ВЫРАЗИТЬ(Таблица.ИндексСтрокРаспределения КАК ЧИСЛО) КАК ИндексСтрокРаспределения,
	               |	Таблица.Количество КАК Количество
	               |ПОМЕСТИТЬ ТаблицаТрудозатратыОкончательный
	               |ИЗ
	               |	&ТаблицаТрудозатратыОконч КАК Таблица
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача,
	               |	ИндексСтрокРаспределения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Таблица.ПериодРаспределения КАК ПериодРаспределения,
	               |	ВЫРАЗИТЬ(Таблица.ИндексСтрокиРаспределениеПоРолям КАК ЧИСЛО) КАК ИндексСтрокиРаспределениеПоРолям,
	               |	Таблица.Количество КАК Количество
	               |ПОМЕСТИТЬ ТаблицаТрудозатратыПоПериодамОкончательный
	               |ИЗ
	               |	&ТаблицаТрудозатратыПоПериодамОконч КАК Таблица
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача,
	               |	ИндексСтрокиРаспределениеПоРолям
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПрогнозТрудозатратПоРолямДанные.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
	               |	упоПрогнозТрудозатратПоРолямДанные.Подразделение КАК Подразделение,
	               |	упоПрогнозТрудозатратПоРолямДанные.Подразделение.Родитель КАК ПодразделениеРодитель,
	               |	упоПрогнозТрудозатратПоРолямДанные.ПроектнаяЗадачаЗеркало.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадачаДокумент
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.упоПрогнозТрудозатратПоРолям.Данные КАК упоПрогнозТрудозатратПоРолямДанные
	               |ГДЕ
	               |	упоПрогнозТрудозатратПоРолямДанные.Ссылка = &Документ
	               |	И упоПрогнозТрудозатратПоРолямДанные.Записывать
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВТ_ДанныеДокумента.ПроектнаяЗадачаЗеркало.упоКорневойПроект КАК Проект
	               |ПОМЕСТИТЬ ВТ_ПроектыДокумента
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Проекты.Ссылка КАК Ребенок,
	               |	Проекты.Родитель КАК Родитель
	               |ПОМЕСТИТЬ ВТ_ПодчиненныеЗадачи
	               |ИЗ
	               |	ВТ_ПроектыДокумента КАК ВТ_ПроектыДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО ВТ_ПроектыДокумента.Проект = Проекты.упоКорневойПроект
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |	И Проекты.Родитель <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	Проекты.Ссылка,
	               |	Проекты.Ссылка
	               |ИЗ
	               |	ВТ_ПроектыДокумента КАК ВТ_ПроектыДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |		ПО ВТ_ПроектыДокумента.Проект = Проекты.упоКорневойПроект
	               |ГДЕ
	               |	НЕ Проекты.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ПодчиненныеЗадачи.Ребенок КАК Ребенок,
	               |	ВТ_ПодчиненныеЗадачи.Родитель КАК Родитель,
	               |	ВТ_ДанныеДокумента.ПодразделениеРодитель КАК ПодразделениеРодитель,
	               |	ВТ_ПодчиненныеЗадачи.Родитель.СсылкаНаПроектнуюЗадачу КАК РодительДокумент,
	               |	ВТ_ДанныеДокумента.Подразделение КАК Подразделение,
	               |	ВТ_ПодчиненныеЗадачи.Ребенок.СсылкаНаПроектнуюЗадачу КАК РебенокДокумент
	               |ПОМЕСТИТЬ ВТ_ПодразделенияПредварительногоУровня
	               |ИЗ
	               |	ВТ_ПодчиненныеЗадачи КАК ВТ_ПодчиненныеЗадачи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ПО ВТ_ПодчиненныеЗадачи.Ребенок = ВТ_ДанныеДокумента.ПроектнаяЗадачаЗеркало
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПодразделенияПредварительногоУровня.РебенокДокумент КАК РебенокДокумент,
	               |	ВТ_ПодразделенияПредварительногоУровня.Родитель КАК Родитель,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Версия КАК Версия,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Ресурс,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.СпособПривязки КАК СпособПривязки,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Количество КАК КоличествоЭтапа,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования КАК УровеньПланирования,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Основной КАК Основной
	               |ПОМЕСТИТЬ ВТ_ПланЭтаповПоПредварительномуУровню
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |			,
	               |			УровеньПланирования = &УровеньПланированияПредварительный
	               |				И Ресурс.СобствСилы_Субподряд <> &РезервРПЗ) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодразделенияПредварительногоУровня КАК ВТ_ПодразделенияПредварительногоУровня
	               |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = ВТ_ПодразделенияПредварительногоУровня.РодительДокумент
	               |			И упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение = ВТ_ПодразделенияПредварительногоУровня.Подразделение
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |				,
	               |				ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПодразделенияПредварительногоУровня.РодительДокумент КАК РодительДокумент
	               |					ИЗ
	               |						ВТ_ПодразделенияПредварительногоУровня КАК ВТ_ПодразделенияПредварительногоУровня)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО упоДанныеПлановТрудозатратРолейСрезПоследних.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	               |			И упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость <> 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Версия КАК Версия
	               |ПОМЕСТИТЬ ВТ_Версии
	               |ИЗ
	               |	ВТ_ПланЭтаповПоПредварительномуУровню КАК ВТ_ПланЭтаповПоПредварительномуУровню
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Версия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаТрудозатратыОкончательный.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТаблицаТрудозатратыОкончательный.Подразделение КАК Подразделение,
	               |	ТаблицаТрудозатратыПоПериодамОкончательный.ПериодРаспределения КАК ПериодРаспределения,
	               |	ТаблицаТрудозатратыПоПериодамОкончательный.Количество * ЕСТЬNULL(ТаблицаТрудозатратыОкончательный.ЕдиницаНормирования.Коэффициент, 1) КАК КоличествоЧасов
	               |ПОМЕСТИТЬ ВТ_ПланЗадачПоОкончательномуУровню
	               |ИЗ
	               |	ТаблицаТрудозатратыОкончательный КАК ТаблицаТрудозатратыОкончательный
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТрудозатратыПоПериодамОкончательный КАК ТаблицаТрудозатратыПоПериодамОкончательный
	               |		ПО ТаблицаТрудозатратыОкончательный.ПроектнаяЗадача = ТаблицаТрудозатратыПоПериодамОкончательный.ПроектнаяЗадача
	               |			И ТаблицаТрудозатратыОкончательный.ИндексСтрокРаспределения = ТаблицаТрудозатратыПоПериодамОкончательный.ИндексСтрокиРаспределениеПоРолям
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоНормыСтоимостиРесурсовСрезПоследних.Ресурс КАК Ресурс,
	               |	упоНормыСтоимостиРесурсовСрезПоследних.Норма КАК Норма,
	               |	упоНормыСтоимостиРесурсовСрезПоследних.ЕдСтоимость / ЕСТЬNULL(упоНормыСтоимостиРесурсовСрезПоследних.ЕдиницаНормирования.Коэффициент, 0) КАК ПриведеннаяСтоимостьНормы
	               |ПОМЕСТИТЬ ВТ_НормыСтоимости
	               |ИЗ
	               |	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
	               |			,
	               |			Ресурс В
	               |				(ВЫБРАТЬ
	               |					ВТ_ПланЭтаповПоПредварительномуУровню.Ресурс КАК Ресурс
	               |				ИЗ
	               |					ВТ_ПланЭтаповПоПредварительномуУровню КАК ВТ_ПланЭтаповПоПредварительномуУровню)) КАК упоНормыСтоимостиРесурсовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Версия КАК Версия,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Подразделение КАК Подразделение,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Ресурс КАК Ресурс,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	ВТ_ПланЗадачПоОкончательномуУровню.ПериодРаспределения КАК ПериодРаспределения,
	               |	СУММА(ВТ_ПланЗадачПоОкончательномуУровню.КоличествоЧасов / ЕСТЬNULL(ВТ_ПланЭтаповПоПредварительномуУровню.ЕдиницаНормирования.Коэффициент, 1)) КАК Количество,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.СпособПривязки КАК СпособПривязки,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	ЕСТЬNULL(ВТ_НормыСтоимости.ПриведеннаяСтоимостьНормы, 0) * ЕСТЬNULL(ВТ_ПланЭтаповПоПредварительномуУровню.ЕдиницаНормирования.Коэффициент, 1) КАК Стоимость,
	               |	ЕСТЬNULL(ВТ_НормыСтоимостиВнешн.ПриведеннаяСтоимостьНормы, 0) * ЕСТЬNULL(ВТ_ПланЭтаповПоПредварительномуУровню.ЕдиницаНормирования.Коэффициент, 1) КАК ВнешняяСтоимость,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Основной КАК Основной
	               |ПОМЕСТИТЬ ВТ_ПолнаяТаблица
	               |ИЗ
	               |	ВТ_ПланЭтаповПоПредварительномуУровню КАК ВТ_ПланЭтаповПоПредварительномуУровню
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПланЗадачПоОкончательномуУровню КАК ВТ_ПланЗадачПоОкончательномуУровню
	               |		ПО ВТ_ПланЭтаповПоПредварительномуУровню.Подразделение = ВТ_ПланЗадачПоОкончательномуУровню.Подразделение
	               |			И ВТ_ПланЭтаповПоПредварительномуУровню.РебенокДокумент = ВТ_ПланЗадачПоОкончательномуУровню.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НормыСтоимости КАК ВТ_НормыСтоимости
	               |		ПО ВТ_ПланЭтаповПоПредварительномуУровню.Ресурс = ВТ_НормыСтоимости.Ресурс
	               |			И ВТ_ПланЭтаповПоПредварительномуУровню.НормаСтоимостиТрудовыхРесурсов = ВТ_НормыСтоимости.Норма
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НормыСтоимости КАК ВТ_НормыСтоимостиВнешн
	               |		ПО ВТ_ПланЭтаповПоПредварительномуУровню.Ресурс = ВТ_НормыСтоимостиВнешн.Ресурс
	               |			И ВТ_ПланЭтаповПоПредварительномуУровню.ВнешняяНормаСтоимостиТрудовыхРесурсов = ВТ_НормыСтоимостиВнешн.Норма
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.ПроектнаяЗадача,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Ресурс,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Подразделение,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Версия,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.ЕдиницаНормирования,
	               |	ВТ_ПланЗадачПоОкончательномуУровню.ПериодРаспределения,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.СпособПривязки,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.ИндексСтрокРаспределения,
	               |	ВТ_ПланЭтаповПоПредварительномуУровню.Основной,
	               |	ЕСТЬNULL(ВТ_НормыСтоимости.ПриведеннаяСтоимостьНормы, 0) * ЕСТЬNULL(ВТ_ПланЭтаповПоПредварительномуУровню.ЕдиницаНормирования.Коэффициент, 1),
	               |	ЕСТЬNULL(ВТ_НормыСтоимостиВнешн.ПриведеннаяСтоимостьНормы, 0) * ЕСТЬNULL(ВТ_ПланЭтаповПоПредварительномуУровню.ЕдиницаНормирования.Коэффициент, 1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПолнаяТаблица.Версия КАК Версия,
	               |	ВТ_ПолнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_ПолнаяТаблица.Подразделение КАК Подразделение,
	               |	ВТ_ПолнаяТаблица.Ресурс КАК Ресурс,
	               |	ВТ_ПолнаяТаблица.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	&УровеньПланированияПредварительный КАК УровеньПланирования,
	               |	НЕОПРЕДЕЛЕНО КАК ПрофильРаспределения,
	               |	ВТ_ПолнаяТаблица.СпособПривязки КАК СпособПривязки,
	               |	ВТ_ПолнаяТаблица.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	ВТ_ПолнаяТаблица.Основной КАК Основной,
	               |	ВТ_ПолнаяТаблица.Стоимость КАК Стоимость,
	               |	ВТ_ПолнаяТаблица.ВнешняяСтоимость КАК ВнешняяСтоимость,
	               |	СУММА(ВТ_ПолнаяТаблица.Количество) КАК Количество,
	               |	СУММА(ВТ_ПолнаяТаблица.Количество * ВТ_ПолнаяТаблица.Стоимость) КАК ОбщСтоимость,
	               |	СУММА(ВТ_ПолнаяТаблица.Количество * ВТ_ПолнаяТаблица.ВнешняяСтоимость) КАК ОбщВнешняяСтоимость
	               |ИЗ
	               |	ВТ_ПолнаяТаблица КАК ВТ_ПолнаяТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПолнаяТаблица.Версия,
	               |	ВТ_ПолнаяТаблица.ПроектнаяЗадача,
	               |	ВТ_ПолнаяТаблица.Подразделение,
	               |	ВТ_ПолнаяТаблица.Ресурс,
	               |	ВТ_ПолнаяТаблица.ЕдиницаНормирования,
	               |	ВТ_ПолнаяТаблица.СпособПривязки,
	               |	ВТ_ПолнаяТаблица.ИндексСтрокРаспределения,
	               |	ВТ_ПолнаяТаблица.Стоимость,
	               |	ВТ_ПолнаяТаблица.ВнешняяСтоимость,
	               |	ВТ_ПолнаяТаблица.Основной
	               |ИТОГИ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПолнаяТаблица.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_ПолнаяТаблица.Подразделение КАК Подразделение,
	               |	ВТ_ПолнаяТаблица.Версия КАК Версия,
	               |	ВТ_ПолнаяТаблица.ПериодРаспределения КАК ПериодРаспределения,
	               |	СУММА(ВТ_ПолнаяТаблица.Количество) КАК Количество
	               |ИЗ
	               |	ВТ_ПолнаяТаблица КАК ВТ_ПолнаяТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПолнаяТаблица.Версия,
	               |	ВТ_ПолнаяТаблица.ПроектнаяЗадача,
	               |	ВТ_ПолнаяТаблица.ПериодРаспределения,
	               |	ВТ_ПолнаяТаблица.Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	МАКСИМУМ(ВложенныйЗапрос.ИндексСтрокРаспределения) КАК ИндексСтрокРаспределения
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ПланЭтаповПоПредварительномуУровню.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |		ВТ_ПланЭтаповПоПредварительномуУровню.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения
	               |	ИЗ
	               |		ВТ_ПланЭтаповПоПредварительномуУровню КАК ВТ_ПланЭтаповПоПредварительномуУровню
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТаблицаТрудозатратыОкончательный.ПроектнаяЗадача,
	               |		ТаблицаТрудозатратыОкончательный.ИндексСтрокРаспределения
	               |	ИЗ
	               |		ТаблицаТрудозатратыОкончательный КАК ТаблицаТрудозатратыОкончательный) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.ПроектнаяЗадача";	
	
	// Сборка текста запроса для подчиненных этапов.	
	упоПроектыИЗадачиСервер.ВставитьВТекстЗапросаПодчиненныеЗадачи(ТекстЗапроса, "ВТ_ПодчиненныеЗадачи", Истина, 5);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос;
			
КонецФункции	

Процедура СформироватьДвижения_ТрудозатратыФакт(ТаблицаЗадачФакта)
	
	ТаблицаДвижений = упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоФактТрудозатратПоДням");
	
	СводныйРесурс = Справочники.упоТрудовыеРесурсы.СводныйРесурс;	
	ВидОперацииЯвка = Справочники.упоВидыОпераций.Явка;
	
	Для Каждого СтрокаЗадачи Из ТаблицаЗадачФакта Цикл
		НоваяСтрока = ТаблицаДвижений.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадачи,, "Роль");		
		НоваяСтрока.Период = Дата;
		НоваяСтрока.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;
		НоваяСтрока.Роль = Неопределено;
		НоваяСтрока.Ресурс = СтрокаЗадачи.Роль;
		ЗаполнитьВидОперацииДвижения(НоваяСтрока, СтрокаЗадачи, ВидОперацииЯвка);
		
		НоваяСтрока = ТаблицаДвижений.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадачи);		
		НоваяСтрока.Период = Дата;
		НоваяСтрока.УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
		НоваяСтрока.Роль = СтрокаЗадачи.Роль;
		НоваяСтрока.Ресурс = СводныйРесурс;
		ЗаполнитьВидОперацииДвижения(НоваяСтрока, СтрокаЗадачи, ВидОперацииЯвка);
		
	КонецЦикла;	
	
	Движения.упоФактТрудозатратПоДням.Загрузить(ТаблицаДвижений);
	
	ТаблицаДвижений.Колонки.Операция.Имя = "ПроектнаяЗадача";		
	ТаблицаДвижений.Колонки.Трудозатраты.Имя = "КоличествоЧасов";		
	упоФункцииОбщегоНазначенияСервер.СвернутьТаблицуДвижений(ТаблицаДвижений, "упоФактТрудозатратСводно",, Ложь);
	
	Движения.упоФактТрудозатратСводно.Загрузить(ТаблицаДвижений);
	
	Если ТаблицаДвижений.Количество() Тогда
		Движения.упоФактТрудозатратПоДням.Записать();
		Движения.упоФактТрудозатратСводно.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвижения_ПроцентыГотовности(ДеревоПроцентГотовности, РежимПроведения, Отказ)
	
	Движения.упоСтатусыПроектныхЗадач.Записывать 							= Истина;
	Движения.упоПроцентыГотовностиПроектныхЗадач.Записывать 				= Истина;
	Движения.упоПроцентыГотовностиПроектов.Записывать 						= Истина;
	Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.Записывать 	= Истина;	
	
	НастройкиРасчета = Новый Структура;
	НастройкиРасчета.Вставить("УчитыватьТрудозатратыПриРасчетеГотовности", 
		Константы.упоУчитыватьТрудозатратыПриРасчетеПроцентаГотовности.Получить());
	НастройкиРасчета.Вставить("ИспДлитВместоПустТрудЗатДляРасчГотовности", 
		Константы.упоИспДлитВместоПустТрудЗатДляРасчГотовности.Получить());	
		
	МассивСообщений = Новый Массив;
	ШаблонТекстаПЗ = " - %1 %2: %3% (записанный %4%)";
	
	ТаблицаРучнойПроцентГотовности = ЭтотОбъект.Движения.упоПроцентыГотовностиПроектныхЗадач;
	
	Для Каждого СтрокаПроекта Из ДеревоПроцентГотовности.Строки Цикл				
		
		Для Каждого СтрокаПЗ Из СтрокаПроекта.Строки ЦИкл							
			Движение = ТаблицаРучнойПроцентГотовности.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаПЗ);
			Движение.Регистратор = Ссылка;
			Движение.Период = Дата;
			
			Если НеУменьшатьЗаписанныйПроцентГотовности
				И СтрокаПЗ.ЭтоПроцентГотовностиИзРегистра Тогда
				
				ТекстСобщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаПЗ,					
					СтрокаПЗ.КодСДР,
					СтрокаПЗ.ПроектнаяЗадачаЗеркало,
					СтрокаПЗ.ПроцентГотовности,
					СтрокаПЗ.ПроцентГотовностиЗаписанный);
				МассивСообщений.Добавить(ТекстСобщения);	
				
				Движение.ПроцентГотовности = СтрокаПЗ.ПроцентГотовностиЗаписанный;
				
			КонецЕсли;

		КонецЦикла;
		
		упоПроведениеДокументовСервер.АвтоматическийРасчетГотовности(ЭтотОбъект, Отказ, РежимПроведения, 
			, СтрокаПроекта.Проект, НастройкиРасчета);
			
		упоЗакрытиеЭтапа.УдалитьИзДвиженийСтатусовИПроцентовЗакрытыеЗадачи(ЭтотОбъект);
		
	КонецЦикла;
	
	Если МассивСообщений.Количество() > 0 Тогда
		ЗаголовокСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе %1 установлена опция ""Не уменьшать записанный процент готовности"". 
				|Для следующих задач проценты готовности не были изменены:'"),
			ЭтотОбъект.Ссылка);
		МассивСообщений.Вставить(0,ЗаголовокСообщения);
			
		ОбщегоНазначения.СообщитьПользователю(СтрСоединить(МассивСообщений, Символы.ПС));
	КонецЕсли;	
		
КонецПроцедуры	

Процедура СформироватьДвижения_ФактическиеДатыНачалаИОкончанияПроектныхЗадач(ФактическиеДатыНачалаИОкончания)
	
	Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.Записывать = Истина;
	Для Каждого СтрокаПЗ Из ФактическиеДатыНачалаИОкончания Цикл
		Движение = Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаПЗ);
		Движение.Регистратор = Ссылка;
		Движение.Период = Дата;		
	КонецЦикла;	
		
КонецПроцедуры

Процедура СформироватьДвижения_ПредварительныйПоОкончательному(МассивЗадачАктуализации)
	
	Пакет = ПакетДляФормированияДвиженийПредварительныйПоОкончательному();
	РезультатВыполненияПакета = Пакет.ВыполнитьПакет(); 	
	ИндексПоследнего = РезультатВыполненияПакета.Количество() - 1;
	
	РезультатДанные 				= РезультатВыполненияПакета[ИндексПоследнего - 2];
	РезультатДанныеРаспределения 	= РезультатВыполненияПакета[ИндексПоследнего - 1];
	РезультатИндексыРаспределения 	= РезультатВыполненияПакета[ИндексПоследнего];
	
	Если РезультатДанные.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = "упоДанныеПлановТрудозатратРолей";
	ТаблицаДвиженийТрудозатратыПредв = 
		упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру(ИмяРегистра,, Истина, Истина);			
		
	ИмяРегистра = "упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам";	
	ТаблицаДвиженийТрудозатратыПоПериодамПредв = 
		упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру(ИмяРегистра,, Истина, Истина);
		
	ТаблицаРаспределения = РезультатДанныеРаспределения.Выгрузить();
	ТаблицаРаспределения.Индексы.Добавить("ПроектнаяЗадача, Подразделение");
	
	СоответствиеПоследнихИндексовРаспределения = Новый Соответствие;
	Если Не РезультатИндексыРаспределения.Пустой() Тогда
		Выборка = РезультатИндексыРаспределения.Выбрать();		
		Пока Выборка.Следующий() Цикл
			СоответствиеПоследнихИндексовРаспределения.Вставить(Выборка.ПроектнаяЗадача, Выборка.ИндексСтрокРаспределения);	
		КонецЦикла;
	КонецЕсли;		
	
	Отбор = Новый Структура("ПроектнаяЗадача, Подразделение");
	Выборка = РезультатДанные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбщиеДанныеЗаполнения = Новый Структура("Регистратор, Период, Активность", 
		Ссылка, Дата, Истина);
	
	СпособПривязкиВручную = Перечисления.упоСпособПривязкиРаспределения.Вручную;
	
	Пока Выборка.Следующий() Цикл
		                                                                           
		ВыборкаДетально = Выборка.Выбрать();		 
		Пока ВыборкаДетально.Следующий() Цикл 				
						
			Движение = ТаблицаДвиженийТрудозатратыПредв.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ОбщиеДанныеЗаполнения);
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетально);
					
			Если ВыборкаДетально.СпособПривязки <> СпособПривязкиВручную Тогда					
				Движение.СпособПривязки = СпособПривязкиВручную;
				упоПроектыИЗадачиСервер.УстановитьИндексРаспределенияПоСоответствию(Движение, 
																					СоответствиеПоследнихИндексовРаспределения);
			КонецЕсли;
																				
			ИндексСтрокРаспределения = Движение.ИндексСтрокРаспределения;													
			
			ЗаполнитьЗначенияСвойств(Отбор,ВыборкаДетально); 			
			НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(Отбор);			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 				
				Движение = ТаблицаДвиженийТрудозатратыПоПериодамПредв.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, ОбщиеДанныеЗаполнения);
				ЗаполнитьЗначенияСвойств(Движение, НайденнаяСтрока);
				Движение.ИндексСтрокиРаспределениеПоРолям = ИндексСтрокРаспределения;
			КонецЦикла;
			
		КонецЦикла;
		
		МассивЗадачАктуализации.Добавить(Выборка.ПроектнаяЗадача);
		
	КонецЦикла;			
		
	// Актуализация.
	
	ДанныеАктуализацииРегистра = Новый Структура("Регистратор, Период, МассивЗадач, ИмяРегистра",
		Ссылка, 
		Дата, 
		МассивЗадачАктуализации);
		
	УсловиеОтбора = "УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный)";
	
	ДанныеАктуализацииРегистра.ИмяРегистра = "упоДанныеПлановТрудозатратРолей";	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(
															ТаблицаДвиженийТрудозатратыПредв,
															ДанныеАктуализацииРегистра,
															,
															,
															УсловиеОтбора);																
														
	ДанныеАктуализацииРегистра.ИмяРегистра = "упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам";			
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(
															ТаблицаДвиженийТрудозатратыПоПериодамПредв,
															ДанныеАктуализацииРегистра);
															
	Для Каждого СтрокаТаблицы Из ТаблицаДвиженийТрудозатратыПредв Цикл
		ЗаполнитьЗначенияСвойств(Движения.упоДанныеПлановТрудозатратРолей.Добавить(), СтрокаТаблицы);
	КонецЦикла;															
															
	Для Каждого СтрокаТаблицы Из ТаблицаДвиженийТрудозатратыПоПериодамПредв Цикл
		ЗаполнитьЗначенияСвойств(Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Добавить(), СтрокаТаблицы);
	КонецЦикла;																

КонецПроцедуры	

Процедура СформироватьДвижения_ИспользованиеРабочегоВремени(ТаблицаЗадачФакта)
	
	СводныйРесурс = Справочники.упоТрудовыеРесурсы.СводныйРесурс;	
	РазделУчетаПроектнаяЗадача = Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача;
	ВидОперацииЯвка = Справочники.упоВидыОпераций.Явка;
	
	ТаблицаДвижений = Движения.упоИспользованиеРабочегоВремени;
	ТаблицаДвижений.Записывать = Истина;
	
	Для Каждого СтрокаЗадачи Из ТаблицаЗадачФакта Цикл
		
		Движение = ТаблицаДвижений.Добавить();				
	    ЗаполнитьЗначенияСвойств(Движение, СтрокаЗадачи);		
		Движение.Регистратор = Ссылка;
		Движение.Период = Дата;
		Движение.ТрудовойРесурс = СводныйРесурс;
		Движение.РазделУчета = РазделУчетаПроектнаяЗадача;		
		Движение.ЗадачаПричина = СтрокаЗадачи.ПроектнаяЗадачаЗеркало;
		Движение.РабочееЗадание = СтрокаЗадачи.Операция;
		Движение.РольРесурса = СтрокаЗадачи.Роль;
		Движение.РасшифровкаТрудозатрат = "БезРасшифровки";
		ЗаполнитьВидОперацииДвижения(Движение, СтрокаЗадачи, ВидОперацииЯвка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидОперацииДвижения(Движение, СтрокаЗадачи, ВидОперацииЯвка)
	
	Если Не ЗначениеЗаполнено(СтрокаЗадачи.РазделУчетаВидаОперации) 
		Или Не ЗначениеЗаполнено(Движение.ВидОперации) Тогда
		Движение.ВидОперации = ВидОперацииЯвка;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьЗадачиИзБазыДляОбновленияТрудозатрат(РежимЗаписи)
	
	Если Не Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоДанныеПлановТрудозатратРолей.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей КАК упоДанныеПлановТрудозатратРолей
	               |ГДЕ
	               |	упоДанныеПлановТрудозатратРолей.Регистратор = &Ссылка";
			
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДопЗадачиДляАктуализацииТрудозатрат = Новый Массив;
	Пока Выборка.Следующий() Цикл		
		ДопЗадачиДляАктуализацииТрудозатрат.Добавить(Выборка.ПроектнаяЗадача);		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ДопЗадачиДляАктуализацииТрудозатрат", ДопЗадачиДляАктуализацииТрудозатрат);
	
КонецПроцедуры

#Область РаспределениеЗаПериодомДокумента

Функция ТаблицаРаспределениеОстатковПоПериодам()
	
	РаспределениеОстатковПоПериодам = РаспределениеПоПериоду.ВыгрузитьКолонки();
	
	ДатаЗаПериодомДокумента = КонецДня(КонецПериода) + 1;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ДатаЗаПериодомДокумента);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("УровеньПланирования", УровеньПланированияРолей);
	Запрос.УстановитьПараметр("ПрофильОтклонениеНаСледМесяц",
		Перечисления.упоПрофильПересчетаТрудозатрат.ОтклонениеНаМесяцПослеПериодаДокумента);
	// Проведение в привилегированном режиме.
	Запрос.Текст = "ВЫБРАТЬ
		|    Проекты.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
		|    упоПрогнозТрудозатратПоРолямДанные.Роль КАК Роль,
		|    упоПрогнозТрудозатратПоРолямДанные.Подразделение КАК Подразделение,
		|    упоПрогнозТрудозатратПоРолямДанные.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    упоПрогнозТрудозатратПоРолямДанные.ОстатокДоЗавершения КАК ОстатокДоЗавершения,
		|    упоПрогнозТрудозатратПоРолямДанные.Распределять КАК Распределять,
		|    упоПрогнозТрудозатратПоРолямДанные.ПрофильПересчетаТрудозатрат КАК ПрофильПересчетаТрудозатрат,
		|    Проекты.упоКорневойПроект КАК Проект,
		|    упоВерсииПроекта.Версия КАК ТекущаяВерсия,
		|    ВЫБОР
		|        КОГДА упоПрогнозТрудозатратПоРолямДанные.ПрофильПересчетаТрудозатрат = &ПрофильОтклонениеНаСледМесяц
		|            ТОГДА упоПрогнозТрудозатратПоРолямДанные.ТекущийПланДоОтчетногоПериода - упоПрогнозТрудозатратПоРолямДанные.ТекущийПланДоОтчетногоПериодаТрансляция + упоПрогнозТрудозатратПоРолямДанные.ТекущийПланОтчетногоПериода - упоПрогнозТрудозатратПоРолямДанные.ТекущийПланОтчетногоПериодаТрансляция - (упоПрогнозТрудозатратПоРолямДанные.ФактДоОтчетногоПериода + упоПрогнозТрудозатратПоРолямДанные.ФактОтчетногоПериода)
		|        ИНАЧЕ 0
		|    КОНЕЦ КАК ОтклонениеНаСледМесяцДоПериода
		|ПОМЕСТИТЬ втДанныеДокумента
		|ИЗ
		|    Документ.упоПрогнозТрудозатратПоРолям.Данные КАК упоПрогнозТрудозатратПоРолямДанные
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|            ПО Проекты.упоКорневойПроект = упоВерсииПроекта.Проект
		|                И (упоВерсииПроекта.Текущая)
		|        ПО упоПрогнозТрудозатратПоРолямДанные.ПроектнаяЗадачаЗеркало = Проекты.Ссылка
		|ГДЕ
		|    упоПрогнозТрудозатратПоРолямДанные.Ссылка = &Ссылка
		|    И упоПрогнозТрудозатратПоРолямДанные.Записывать
		|    И упоПрогнозТрудозатратПоРолямДанные.ОстатокДоЗавершения > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    втДанныеДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    втДанныеДокумента.Роль КАК Роль,
		|    втДанныеДокумента.Подразделение КАК Подразделение,
		|    втДанныеДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    втДанныеДокумента.ОстатокДоЗавершения КАК ОстатокДоЗавершения,
		|    втДанныеДокумента.Распределять КАК Распределять,
		|    втДанныеДокумента.ПрофильПересчетаТрудозатрат КАК ПрофильПересчетаТрудозатрат,
		|    ВЫБОР
		|        КОГДА упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи ЕСТЬ NULL
		|                ИЛИ упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи = ЗНАЧЕНИЕ(Справочник.упоРабочиеКалендари.ПустаяСсылка)
		|            ТОГДА упоКалендариПроектовСрезПоследних.КалендарьПроекта
		|        ИНАЧЕ упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи
		|    КОНЕЦ КАК Календарь,
		|    КОНЕЦПЕРИОДА(ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан, &Дата), ДЕНЬ) КАК ДатаЗавершения
		|ПОМЕСТИТЬ втДопДанныеДокумента
		|ИЗ
		|    втДанныеДокумента КАК втДанныеДокумента
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоКалендариПроектов.СрезПоследних КАК упоКалендариПроектовСрезПоследних
		|        ПО втДанныеДокумента.Проект = упоКалендариПроектовСрезПоследних.Проект
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		|        ПО втДанныеДокумента.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|            И втДанныеДокумента.ТекущаяВерсия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних КАК упоСрокиПроектныхЗадачСрезПоследних
		|        ПО втДанныеДокумента.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|            И втДанныеДокумента.ТекущаяВерсия = упоСрокиПроектныхЗадачСрезПоследних.Версия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Роль КАК Роль,
		|    упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Подразделение КАК Подразделение,
		|    втДанныеДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    СУММА(упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.ТрудозатратыТекущийПлан - упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.ТрудозатратыТекущийПланТрансляция - упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Трудозатраты - упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.ТрудозатратыТрансляция) КАК ОтклонениеНаСледующийМесяц,
		|    втДанныеДокумента.ОтклонениеНаСледМесяцДоПериода КАК ОтклонениеНаСледМесяцДоПериода
		|ПОМЕСТИТЬ втОтклонениеНаСледующийМесяц
		|ИЗ
		|    втДанныеДокумента КАК втДанныеДокумента
		|        ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПрогнозТрудозатратПоРолям.РаспределениеПоПериоду КАК упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду
		|        ПО втДанныеДокумента.Роль = упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Роль
		|            И втДанныеДокумента.Подразделение = упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Подразделение
		|            И втДанныеДокумента.ПроектнаяЗадачаЗеркало = упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.ПроектнаяЗадачаЗеркало
		|ГДЕ
		|    упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Ссылка = &Ссылка
		|    И НЕ втДанныеДокумента.Распределять
		|    И втДанныеДокумента.ПрофильПересчетаТрудозатрат = &ПрофильОтклонениеНаСледМесяц
		|    И упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Дата >= &НачалоПериода
		|    И упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Дата <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|    упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Роль,
		|    упоПрогнозТрудозатратПоРолямРаспределениеПоПериоду.Подразделение,
		|    втДанныеДокумента.ПроектнаяЗадачаЗеркало,
		|    втДанныеДокумента.ОтклонениеНаСледМесяцДоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ВложенныйЗапрос.Подразделение КАК Подразделение,
		|    ВложенныйЗапрос.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    ВложенныйЗапрос.Роль КАК Роль,
		|    ВложенныйЗапрос.Дата КАК Дата,
		|    СУММА(ВложенныйЗапрос.Трудозатраты) КАК Трудозатраты,
		|    МАКСИМУМ(ВложенныйЗапрос.ОстатокДоЗавершения) КАК ОстатокДоЗавершения,
		|    ВложенныйЗапрос.Календарь КАК Календарь,
		|    ВложенныйЗапрос.ДатаЗавершения КАК ДатаЗавершения
		|ПОМЕСТИТЬ втТрудозатратыПоПериодам
		|ИЗ
		|    (ВЫБРАТЬ
		|        втДопДанныеДокумента.Подразделение КАК Подразделение,
		|        втДопДанныеДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|        втДопДанныеДокумента.Роль КАК Роль,
		|        ЕСТЬNULL(НАЧАЛОПЕРИОДА(упоРабочиеКалендариСрезПоследних.День, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
		|        СУММА(0) КАК Трудозатраты,
		|        втДопДанныеДокумента.ОстатокДоЗавершения КАК ОстатокДоЗавершения,
		|        втДопДанныеДокумента.Календарь КАК Календарь,
		|        втДопДанныеДокумента.ДатаЗавершения КАК ДатаЗавершения
		|    ИЗ
		|        втДопДанныеДокумента КАК втДопДанныеДокумента
		|            ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРабочиеКалендари.СрезПоследних(
		|                    ,
		|                    Календарь В
		|                            (ВЫБРАТЬ
		|                                втДопДанныеДокумента.Календарь КАК Календарь
		|                            ИЗ
		|                                втДопДанныеДокумента КАК втДопДанныеДокумента)
		|                        И День > &КонецПериода) КАК упоРабочиеКалендариСрезПоследних
		|            ПО втДопДанныеДокумента.ДатаЗавершения >= упоРабочиеКалендариСрезПоследних.День
		|                И втДопДанныеДокумента.Календарь = упоРабочиеКалендариСрезПоследних.Календарь
		|    ГДЕ
		|        НЕ втДопДанныеДокумента.Распределять
		|    
		|    СГРУППИРОВАТЬ ПО
		|        втДопДанныеДокумента.ПроектнаяЗадачаЗеркало,
		|        втДопДанныеДокумента.Роль,
		|        втДопДанныеДокумента.Подразделение,
		|        втДопДанныеДокумента.ОстатокДоЗавершения,
		|        ЕСТЬNULL(НАЧАЛОПЕРИОДА(упоРабочиеКалендариСрезПоследних.День, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1)),
		|        втДопДанныеДокумента.Календарь,
		|        втДопДанныеДокумента.ДатаЗавершения
		|    
		|    ОБЪЕДИНИТЬ ВСЕ
		|    
		|    ВЫБРАТЬ
		|        втДопДанныеДокумента.Подразделение,
		|        втДопДанныеДокумента.ПроектнаяЗадачаЗеркало,
		|        втДопДанныеДокумента.Роль,
		|        ЕСТЬNULL(НАЧАЛОПЕРИОДА(упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1)),
		|        СУММА(ЕСТЬNULL(упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Трудозатраты, 0)),
		|        0,
		|        втДопДанныеДокумента.Календарь,
		|        втДопДанныеДокумента.ДатаЗавершения
		|    ИЗ
		|        втДопДанныеДокумента КАК втДопДанныеДокумента
		|            ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия
		|            ПО втДопДанныеДокумента.ПроектнаяЗадача = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Операция
		|                И втДопДанныеДокумента.Роль = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Ресурс
		|                И втДопДанныеДокумента.Подразделение = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Подразделение
		|    ГДЕ
		|        НЕ втДопДанныеДокумента.Распределять
		|        И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланирования
		|        И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День > &КонецПериода
		|        И упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.ИсточникПлана <> ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаТрудозатратРолей.Объемы)
		|    
		|    СГРУППИРОВАТЬ ПО
		|        втДопДанныеДокумента.ПроектнаяЗадачаЗеркало,
		|        втДопДанныеДокумента.Роль,
		|        втДопДанныеДокумента.Подразделение,
		|        ЕСТЬNULL(НАЧАЛОПЕРИОДА(упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.День, МЕСЯЦ), ДАТАВРЕМЯ(1, 1, 1)),
		|        втДопДанныеДокумента.Календарь,
		|        втДопДанныеДокумента.ДатаЗавершения) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|    ВложенныйЗапрос.Подразделение,
		|    ВложенныйЗапрос.ПроектнаяЗадачаЗеркало,
		|    ВложенныйЗапрос.Роль,
		|    ВложенныйЗапрос.Дата,
		|    ВложенныйЗапрос.Календарь,
		|    ВложенныйЗапрос.ДатаЗавершения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    втТрудозатратыПоПериодам.Подразделение КАК Подразделение,
		|    втТрудозатратыПоПериодам.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    втТрудозатратыПоПериодам.Роль КАК Роль,
		|    втТрудозатратыПоПериодам.Дата КАК Дата,
		|    втТрудозатратыПоПериодам.Трудозатраты КАК Трудозатраты,
		|    втТрудозатратыПоПериодам.ОстатокДоЗавершения КАК ОстатокДоЗавершения,
		|    ЕСТЬNULL(втОтклонениеНаСледующийМесяц.ОтклонениеНаСледМесяцДоПериода, 0) + ЕСТЬNULL(втОтклонениеНаСледующийМесяц.ОтклонениеНаСледующийМесяц, 0) КАК ОтклонениеНаСледующийМесяц,
		|    втТрудозатратыПоПериодам.Календарь КАК Календарь,
		|    втТрудозатратыПоПериодам.ДатаЗавершения КАК ДатаЗавершения
		|ИЗ
		|    втТрудозатратыПоПериодам КАК втТрудозатратыПоПериодам
		|        ЛЕВОЕ СОЕДИНЕНИЕ втОтклонениеНаСледующийМесяц КАК втОтклонениеНаСледующийМесяц
		|        ПО втТрудозатратыПоПериодам.Роль = втОтклонениеНаСледующийМесяц.Роль
		|            И втТрудозатратыПоПериодам.Подразделение = втОтклонениеНаСледующийМесяц.Подразделение
		|            И втТрудозатратыПоПериодам.ПроектнаяЗадачаЗеркало = втОтклонениеНаСледующийМесяц.ПроектнаяЗадачаЗеркало
		|
		|УПОРЯДОЧИТЬ ПО
		|    Дата
		|ИТОГИ
		|    СУММА(Трудозатраты),
		|    МАКСИМУМ(ОстатокДоЗавершения),
		|    МАКСИМУМ(ОтклонениеНаСледующийМесяц),
		|    МАКСИМУМ(Календарь),
		|    МАКСИМУМ(ДатаЗавершения)
		|ПО
		|    ПроектнаяЗадачаЗеркало,
		|    Подразделение,
		|    Роль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    втДопДанныеДокумента.Подразделение КАК Подразделение,
		|    втДопДанныеДокумента.ПроектнаяЗадачаЗеркало КАК ПроектнаяЗадачаЗеркало,
		|    втДопДанныеДокумента.Роль КАК Роль,
		|    втДопДанныеДокумента.Календарь КАК Календарь,
		|    &Дата КАК ДатаНачала,
		|    втДопДанныеДокумента.ДатаЗавершения КАК ДатаЗавершения,
		|    СУММА(втДопДанныеДокумента.ОстатокДоЗавершения) КАК Трудозатраты
		|ИЗ
		|    втДопДанныеДокумента КАК втДопДанныеДокумента
		|ГДЕ
		|    втДопДанныеДокумента.Распределять
		|
		|СГРУППИРОВАТЬ ПО
		|    втДопДанныеДокумента.Подразделение,
		|    втДопДанныеДокумента.ПроектнаяЗадачаЗеркало,
		|    втДопДанныеДокумента.Роль,
		|    втДопДанныеДокумента.Календарь,
		|    втДопДанныеДокумента.ДатаЗавершения";;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ИндексПоследнего = РезультатЗапроса.Количество() - 1;
	
	// 1. Распределение остатка без флага Распределять (с версии 4.2.14 флаг не используется).
	
	ВыборкаПодразделения = РезультатЗапроса[ИндексПоследнего - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодразделения.Следующий() Цикл
		
		ВыборкаПЗ = ВыборкаПодразделения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПЗ.Следующий() Цикл
			
			ВыборкаРоль = ВыборкаПЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРоль.Следующий() Цикл
				
				мТрудозатратыТекущийПлан = Новый Массив;
				мДаты = Новый Массив;
				
				ВыборкаДетально = ВыборкаРоль.Выбрать();
				Пока ВыборкаДетально.Следующий() Цикл
					мТрудозатратыТекущийПлан.Добавить(ВыборкаДетально.Трудозатраты);
					мДаты.Добавить(ВыборкаДетально.Дата);
				КонецЦикла;
				
				мТрудозатраты = МассивТрудозатратПоБазеПлановыхТрудозатрат(мТрудозатратыТекущийПлан,
						ВыборкаРоль.ОстатокДоЗавершения,
						ВыборкаРоль.ОтклонениеНаСледующийМесяц);
				
				// Если нет базы по трудозатратам, тогда распределяем по базе рабочих часов.
				Если мТрудозатраты = Неопределено Тогда
					// 4.2.15: включить расчет базы в запрос.
					Результат = упоПланированиеТрудозатратВызовСервера.МассивТрудозатратРавномерноПоМесяцамВПериоде(
							ДатаЗаПериодомДокумента,
							ВыборкаПЗ.ДатаЗавершения,
							ВыборкаПЗ.Календарь,
							ВыборкаРоль.ОстатокДоЗавершения,
							Истина);
					мДаты = Результат.Периоды;
					мТрудозатраты = Результат.Трудозатраты;
					
				КонецЕсли;
				
				ЗаполнитьРаспределениеОстатковПоПериодамПоБазеРаспределения(РаспределениеОстатковПоПериодам,
					ВыборкаРоль,
					мТрудозатраты,
					мДаты);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// 2. Распределение остатка по флагу Распределять (до версии 4.2.14).
	
	Если Не РезультатЗапроса[ИндексПоследнего].Пустой() Тогда
		
		Выборка = РезультатЗапроса[ИндексПоследнего].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Результат = упоПланированиеТрудозатратВызовСервера.МассивТрудозатратРавномерноПоМесяцамВПериоде(
					Выборка.ДатаНачала,
					Выборка.ДатаЗавершения,
					Выборка.Календарь,
					Выборка.Трудозатраты,
					Истина);
			
			ЗаполнитьРаспределениеОстатковПоПериодамПоБазеРаспределения(РаспределениеОстатковПоПериодам,
				Выборка,
				Результат.Трудозатраты,
				Результат.Периоды);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РаспределениеОстатковПоПериодам;
	
КонецФункции

Процедура ЗаполнитьРаспределениеОстатковПоПериодамПоБазеРаспределения(РаспределениеОстатковПоПериодам, 
																	СтрокаЗаполнения, 
																	МассивТрудозатрат, 
																	МассивДат)
	
	КоличествоДат = МассивДат.Количество()-1;
	Для ИндексЭлемента = 0 По КоличествоДат Цикл
		НоваяСтрока = РаспределениеОстатковПоПериодам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаполнения);
		НоваяСтрока.Дата = МассивДат[ИндексЭлемента];
		НоваяСтрока.Трудозатраты = МассивТрудозатрат[ИндексЭлемента];
	КонецЦикла;
	
КонецПроцедуры

Функция МассивТрудозатратПоБазеПлановыхТрудозатрат(мТрудозатратыТекущийПлан, 
													Знач ОстатокДоЗавершения, 
													Знач ОтклонениеНаСледующийМесяц)
			
	Если мТрудозатратыТекущийПлан.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	// Если по роли отработал профиль ОтклонениеНаМесяцПослеПериодаДокумента, то сумма отклонения 
	// переходит на следующий месяц после периода документа, а остаток до завершения за вычетом суммы отклонения 
	// распределяется после периода документа.										
	
	ЕстьОтклонениеНаСледМесяц = ОтклонениеНаСледующийМесяц > 0;					
	
	Если ЕстьОтклонениеНаСледМесяц Тогда
		
		СуммаПеренесенныхТрудозатрат = 0;
		мПеренесенныеТрудозатраты = ПеренестиОтклонениеТрудозатратНаСледующийМесяц(мТрудозатратыТекущийПлан, 
																				ОтклонениеНаСледующийМесяц,
																				СуммаПеренесенныхТрудозатрат);
				
		ОстатокДоЗавершения = ОстатокДоЗавершения - СуммаПеренесенныхТрудозатрат;
		Если ОстатокДоЗавершения < 0 Тогда 
			ОстатокДоЗавершения = 0;
		КонецЕсли;															
		
	КонецЕсли;	
	
	мТрудозатраты = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
																			ОстатокДоЗавершения, 
																			мТрудозатратыТекущийПлан, 
																			2);		
	
	Если ЕстьОтклонениеНаСледМесяц 
 		И мТрудозатраты <> Неопределено Тогда		
		
		Сч = мПеренесенныеТрудозатраты.Количество() - 1;
		Пока Сч >=0 Цикл
			мТрудозатраты.Вставить(0, мПеренесенныеТрудозатраты[Сч]);
			Сч = Сч - 1;
		КонецЦикла;															
		
	КонецЕсли;	
	
	Возврат мТрудозатраты; 
	
КонецФункции
 
Функция ПеренестиОтклонениеТрудозатратНаСледующийМесяц(МассивТрудозатрат, 
														ОтклонениеКРаспределению, 
														СуммаПеренесенныхТрудозатрат)
	
	МассивПеренесенныеОтклонения = Новый Массив;	
	
	КоличествоЭлементов = МассивТрудозатрат.Количество();
	Сч = -1;	
	Пока Сч < КоличествоЭлементов Цикл
		
		Если ОтклонениеКРаспределению = 0 Тогда
			Прервать;
		КонецЕсли;	
		
		Сч = Сч + 1;				
		
		Отклонение = МассивТрудозатрат[Сч] + ОтклонениеКРаспределению;	
		СуммаПеренесенныхТрудозатрат = СуммаПеренесенныхТрудозатрат + Отклонение;
		
		Если МассивТрудозатрат[Сч] < 0 Тогда
			ОтклонениеКРаспределению = ОтклонениеКРаспределению - МассивТрудозатрат[Сч];
			Отклонение = 0;
		Иначе 
			ОтклонениеКРаспределению = 0;	
		КонецЕсли;
		
		МассивПеренесенныеОтклонения.Добавить(Отклонение);		
					
	КонецЦикла;
	
	// Убираем перенесенный элемент из массива коэффициентов распределения.
	Пока Сч >=0 Цикл 
		МассивТрудозатрат.Удалить(Сч);
		Сч = Сч - 1;
	КонецЦикла;		
			
	Возврат МассивПеренесенныеОтклонения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли