//ИКТ_Новоселов_Добавлена кнопка "Распределить по документам распределения"_Задача№11252_20.11.2025<<
&НаСервере
&После("ПриСозданииНаСервере")
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ДобавитьРеквизитыНаФорму();

КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()
	
	// Добавление команды РаспределитьНаПоступления
	НоваяКоманда = Команды.Добавить("ИКТ_РаспределитьНаПоступления");
	НоваяКоманда.Действие = "ИКТ_РаспределитьНаПоступления";
	// Добавление на форму кнопки для команды РаспределитьНаПоступления
	Кнопка = Элементы.Вставить("ТоварыИКТ_РаспределитьНаПоступления", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель, Элементы.ГруппаТоварыПодобратьТовары);
	Кнопка.Заголовок = "Распределить на документы приобретения";
	Кнопка.ИмяКоманды = "ИКТ_РаспределитьНаПоступления";
	
	// Добавление на форму колонки ИКТ_КомментарийРаспределения
	НовыйЭлемент = Элементы.Вставить("ТоварыИКТ_КомментарийРаспределения", Тип("ПолеФормы"), Элементы.Товары, );	// Вставка в конец строки       
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.ИКТ_КомментарийРаспределения";

КонецПроцедуры

&НаКлиенте
Процедура ИКТ_РаспределитьНаПоступления(Команда)
	АдресСтрокКРаспределению = ПоместитьВыделенныеСтрокиВХранилище(Элементы.Товары.ВыделенныеСтроки);
	Если АдресСтрокКРаспределению = Неопределено Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отсутствуют строки к распределению на документы приобретения.';
															   |en = 'Lines to allocate among purchase documents are missing.'"));
	Иначе
		Обработчик = Новый ОписаниеОповещения("РаспределитьНаПоступленияЗавершение", ЭтотОбъект);
		Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка",       Объект.Ссылка);
		ПараметрыФормы.Вставить("Валюта",       Объект.Валюта);
		ПараметрыФормы.Вставить("ТаблицаСтрок", АдресСтрокКРаспределению);
		ОткрытьФорму("ОбщаяФорма.РаспределениеРасходовНаПоступления", ПараметрыФормы,,,,, Обработчик, Режим);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьВыделенныеСтрокиВХранилище(Знач ВыделенныеСтроки)
	ТаблицаСтрок = Новый ТаблицаЗначений;
	ТаблицаСтрок.Колонки.Добавить("НомерСтрокиДокумента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
	ТаблицаСтрок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));	// Добавление сведений о номенклатуре
	ТаблицаСтрок.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(1000)));
	ТаблицаСтрок.Колонки.Добавить("АналитикаРасходов", Документы.ТипВсеСсылки());
	ТаблицаСтрок.Колонки.Добавить("Сумма", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТаблицаСтрок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаСтрок.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	ТаблицаСтрок.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаСтрок.Колонки.Добавить("СтатьяРасходов", ПланыВидовХарактеристик.ТипВсеСсылки());
	
	Для Каждого ТекСтрока Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
		Если СтрокаТаблицы = Неопределено 
			ИЛИ ТипЗнч(СтрокаТаблицы.АналитикаРасходов) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Содержание = СтрокаТаблицы.ИКТ_Содержание;  // Добавлен перенос реквизита Содержание
		НоваяСтрока.НомерСтрокиДокумента = СтрокаТаблицы.НомерСтроки;
	КонецЦикла;
	
	Если ТаблицаСтрок.Количество() = 0 Тогда
		АдресВоВременномХранилище =  Неопределено;
	Иначе
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТаблицаСтрок, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат АдресВоВременномХранилище;
КонецФункции

&НаКлиенте
Процедура РаспределитьНаПоступленияЗавершение(РезультатЗакрытия, Параметры) Экспорт

	Если РезультатЗакрытия <> Неопределено Тогда
		ПеренестиРезультатВТабЧасть(РезультатЗакрытия);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПеренестиРезультатВТабЧасть(РезультатЗакрытия)

	КУдалению = Новый Массив();
	РезультатРаспределения = ПолучитьИзВременногоХранилища(РезультатЗакрытия.АдресВоВременномХранилище);
	СтруктураПересчетаСуммы = ПоляПересчетаСуммыНДСВСтрокеТЧ(ЭтаФорма);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	
	ОбрабатываемыеСтроки = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из РезультатРаспределения Цикл
		МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки",СтрокаТаблицы.НомерСтрокиДокумента));
		Если МассивСтрок.Количество() <> 1 Тогда
			СтрокаКЗаполнению = Объект.Товары.Добавить();
			ПриДобавленииСтрокиРасходов(ЭтотОбъект, СтрокаКЗаполнению);
	        СтрокаКЗаполнению.СписатьНаРасходы = Истина;  // Добавлено
		Иначе
			СтрокаКЗаполнению = МассивСтрок[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаКЗаполнению, СтрокаТаблицы);
		Если СокрЛП(СтрокаКЗаполнению.ИКТ_Содержание) = "" Тогда
			СтрокаКЗаполнению.ИКТ_Содержание = СтрокаТаблицы.Содержание;
		КонецЕсли;
		СтрокаКЗаполнению.ИКТ_КомментарийРаспределения = СтрокаТаблицы.КомментарийРаспределения;	
		Если СтрокаКЗаполнению.Количество <> 0 Тогда
			СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", Новый Структура("ИмяКоличества", "Количество"));
		Иначе
			СтруктураДействий.Удалить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках");
			СтрокаКЗаполнению.Цена = СтрокаКЗаполнению.Сумма;
		КонецЕсли;
		ОбрабатываемыеСтроки.Добавить(СтрокаКЗаполнению);
	КонецЦикла;
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		Объект.Товары);
	
	КУдалению = ПолучитьИзВременногоХранилища(РезультатЗакрытия.СтрокиКУдалению);
	Для Каждого СтрокаКУдалению Из КУдалению Цикл
		Объект.Товары.Удалить(СтрокаКУдалению.НомерСтрокиДокумента - 1);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоляПересчетаСуммыНДСВСтрокеТЧ(Форма)
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Форма.Объект);
	
	Возврат СтруктураПересчетаСуммы;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПриДобавленииСтрокиРасходов(Форма, Строка)

	НалогообложениеНДС = Форма.Объект.НалогообложениеНДС;
	ДоходыИРасходыКлиентСервер.ПриДобавленииСтрокиВТаблицу(Форма, Строка, "Объект.Расходы");
	Если НалогообложениеНДС <> ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС") Тогда
		Строка.СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС");
	КонецЕсли;

КонецПроцедуры
//>>ИКТ_Новоселов_Задача№11252_20.11.2025
