////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с заданиями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Изменяет страницу с кнопками изменения статуса в соответствии с ролью и текущим статусом.
//
// Параметры:
//  Форма	 	- Форма.
//  Параметры	- Структура: 
//					* ЯАвтор - Булево - я - автор.
//					* ЯИсполнитель - Булево - я - исполнитель.
//					* Статус - Перечисление.упоСтатусыЗаданий - статус.
//
Процедура ОбновитьДоступныеСтатусы(Форма, Параметры) Экспорт
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Если Параметры.Свойство("ВидЗадания") И Параметры.Свойство("Статус") Тогда
		
		Если Параметры.Статус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Отменено") Тогда
			Элементы.ГруппаИзменитьСтатус.ТекущаяСтраница = Элементы.СтраницаИзмененияНедоступны;
			Возврат;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидЗаданияСсылка", Параметры.ВидЗадания);
		Отбор.Вставить("ТекущийСтатусСсылка", Параметры.Статус);
		
		Роль = Неопределено;
		
		Если Параметры.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение")
			ИЛИ Параметры.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.ПроектноеРешение")
			ИЛИ Параметры.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование") Тогда
			Если Параметры.ЯИсполнитель И НЕ Параметры.ЯАвтор Тогда
				Роль = "Исполнитель";
			ИначеЕсли Параметры.ЯАвтор И НЕ Параметры.ЯИсполнитель Тогда
				Роль = "Автор";
			ИначеЕсли Параметры.ЯАвтор И Параметры.ЯИсполнитель Тогда
				Роль = "АвторИсполнитель";
			КонецЕсли;
			
			
		ИначеЕсли Параметры.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение") Тогда
			Если Параметры.ЯРуководительПроектнойЗадачи Тогда
				Роль = "РуководительПроектнойЗадачи";
			ИначеЕсли Параметры.ЯАвтор Тогда
				Роль = "Автор";
			КонецЕсли;  		
		КонецЕсли;
		
		Отбор.Вставить("Роль", Роль);
		
		НайденныеСтроки = Форма.ТаблицаДоступныеСтатусы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Элементы.ГруппаИзменитьСтатус.ТекущаяСтраница = Элементы.СтраницаИзмененияНедоступны;				
		Иначе
			ПереключитьСтраницуДоступныеСтатусы(Элементы, НайденныеСтроки[0].ИмяСтраницы);		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновление доступных статусов для нескольких заданий, выбранных на форме Работа с заданиями.
//
// Параметры:
//  Форма	 - УправляенмаяФорма - форма упоРаботаСЗаданиями.Форма.
//  Задания	 - Массив			 - выбранные задания.
//
Процедура ОбновитьДоступныеСтатусыДляНесколькихЗаданий(Форма, Задания) Экспорт
	
	ВозможныеКоманды = Новый Массив;
	
	Элементы = Форма.Элементы;
	
	ЕстьЗаданияБезДоступныхКоманд = Ложь;
	ЕстьЗаданияССинхронизациейСЗадачами = Ложь;
	
	Для Каждого ТекСтрока Из Задания Цикл
		Если ЕстьЗаданияБезДоступныхКоманд Тогда
			Прервать;	
		КонецЕсли;
		
		Если ТекСтрока.СинхронизируетсяСЗадачей Тогда
			ЕстьЗаданияССинхронизациейСЗадачами = Истина;
		КонецЕсли; 
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидЗадания", СтрЗаменить(Строка(ТекСтрока.ВидЗадания), " ", ""));
		Отбор.Вставить("ТекущийСтатус", СтрЗаменить(Строка(ТекСтрока.Статус), " ", ""));
		
		Роль = Неопределено;
		
		Если ТекСтрока.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение")
			ИЛИ ТекСтрока.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.ПроектноеРешение")
			ИЛИ ТекСтрока.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование") Тогда
			Если ТекСтрока.ЯИсполнитель И НЕ ТекСтрока.ЯАвтор Тогда
				Роль = "Исполнитель";
			ИначеЕсли ТекСтрока.ЯАвтор И НЕ ТекСтрока.ЯИсполнитель Тогда
				Роль = "Автор";
			ИначеЕсли ТекСтрока.ЯАвтор И ТекСтрока.ЯИсполнитель Тогда
				Роль = "АвторИсполнитель";
			КонецЕсли;			
			
		ИначеЕсли ТекСтрока.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение") Тогда
			Если ТекСтрока.ЯРуководительПроектнойЗадачи Тогда
				Роль = "РуководительПроектнойЗадачи";
			ИначеЕсли ТекСтрока.ЯАвтор Тогда
				Роль = "Автор";
			КонецЕсли;  		
		КонецЕсли;
		
		Отбор.Вставить("Роль", Роль);
		
		НеНашлиСтроки = Ложь;
		ДобавитьКомандуВСписок(Форма.ТаблицаДоступныеСтатусыСКомандами, Отбор, ВозможныеКоманды, НеНашлиСтроки);
		
		Отбор.Роль = Роль;
		НеНашлиСтрокиДляОтмены = Ложь;
		Если Отбор.Роль = "Автор" Или Отбор.Роль = "АвторИсполнитель" Тогда
			Отбор.Роль = "Автор";
			Отбор.ТекущийСтатус = "";			
			ДобавитьКомандуВСписок(Форма.ТаблицаДоступныеСтатусыСКомандами, Отбор, ВозможныеКоманды, НеНашлиСтрокиДляОтмены);
		Иначе
			НеНашлиСтрокиДляОтмены = Истина;	
		КонецЕсли;		
		
		Если НеНашлиСтроки И НеНашлиСтрокиДляОтмены Тогда
			ЕстьЗаданияБезДоступныхКоманд = Истина;	
		КонецЕсли;				
	КонецЦикла;
	
	Если ЕстьЗаданияБезДоступныхКоманд Тогда
		Элементы.ГруппаИзменитьСтатус.ТекущаяСтраница = Элементы.СтраницаИзмененияНедоступны;
		Возврат;
	КонецЕсли; 
	
	МассивКоманд = Новый Массив;
	КоличествоВидовЗаданий = Задания.Количество();	
	Для Каждого ТекЭлемент Из ВозможныеКоманды Цикл
		Если ТекЭлемент.Количество = КоличествоВидовЗаданий Тогда
			МассивКоманд.Добавить(ТекЭлемент.ЗаголовокКоманды);		
		КонецЕсли; 	
	КонецЦикла;
	
	Если МассивКоманд.Количество() > 0 Тогда
		УстановитьВидимостьКнопки(Форма, "");

		Для Каждого ТекКоманда Из МассивКоманд Цикл
			УстановитьВидимостьКнопки(Форма, ТекКоманда);	
		КонецЦикла;
		
		Элементы.ГруппаИзменитьСтатус.ТекущаяСтраница = Элементы.СтраницаСтатусыДляГруппыЗаданий;
		
		КомандаОтмененоДоступна = МассивКоманд.Найти("Отменено") <> Неопределено И Не ЕстьЗаданияССинхронизациейСЗадачами;
		Элементы.КнопкаСтатусыДляГруппыЗаданийОтменено.Видимость = КомандаОтмененоДоступна;
	Иначе
		Элементы.ГруппаИзменитьСтатус.ТекущаяСтраница = Элементы.СтраницаИзмененияНедоступны;	
	КонецЕсли;			
		    		
КонецПроцедуры

// Предлагает пользователю выбрать вид задания и создает его на основании переданной ссылки.
//
// Параметры:
//  Ссылка						 - 	СправочникСсылка, ДокументСсылка - Ссылка основания для задания.
//  ПараметрыВыполненияКоманды	 - Структура, Неопределено
//
Процедура СоздатьЗаданиеСВыборомВидаНаОсновании(Ссылка, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение"));
	
	Если упоЗаданияСервер.ИспользуютсяПроектныеРешения() Тогда 
		СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.ПроектноеРешение"));
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Ссылка, ПараметрыВыполненияКоманды", Ссылка, ПараметрыВыполненияКоманды);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакончитьСозданиеЗаданияНаОсновании", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выберите вид задания'"));
		
КонецПроцедуры

// Создание задания на основании объекта.
//
// Параметры:
//  ОписаниеКоманды	 - Структура
//
Процедура упоЗаданиеСоздатьНаОснованииОбъекта(ОписаниеКоманды) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник, Уникальность, Окно, НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ОписаниеКоманды.ДополнительныеПараметры);
	
	ПараметрКоманды = ОписаниеКоманды.ОбъектыОснований;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() = 1 Тогда
		ПараметрКоманды = ПараметрКоманды[0];
	Иначе 	
		Возврат;
	КонецЕсли;
	
	упоЗаданияКлиент.СоздатьЗаданиеСВыборомВидаНаОсновании(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

// Открывает форму Обработка.упоРаботаСЗаданиями.Форма с отборами по заданиям подразделения.
//
// Параметры:
//  Форма			 - УправляемаяФорма	 - Обработка.упоРаботаСЗаданиями.Форма
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача	 - задача, по которой выданы задания.
//
Процедура ОткрытьЗаданияПодразделениюПоЗадаче(Форма, ПроектнаяЗадача) Экспорт
	
	СтруктураЗаданияПодразделению = упоЗаданияСервер.ЗаданияПодразделениюПоЗадаче(ПроектнаяЗадача);
	
	Если СтруктураЗаданияПодразделению.КоличествоЗаданий = 0 Тогда
		ШаблонТекста = НСтр("ru = 'Пользователь ""%1"" не имеет доступа для просмотра выбранного задания'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, СтруктураЗаданияПодразделению.ТекущийСотрудник);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	ИначеЕсли СтруктураЗаданияПодразделению.КоличествоЗаданий = 1 Тогда
		ПоказатьЗначение(, СтруктураЗаданияПодразделению.ЗаданиеДляПозиционирования);
	Иначе	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПоказыватьТолькоЗаданияПодразделению", Истина);	
		ПараметрыФормы.Вставить("СвязаннаяСсылка", ПроектнаяЗадача);	
		ПараметрыФормы.Вставить("ВидЗадания", ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение"));
		ПараметрыФормы.Вставить("ТекущаяСтрока", СтруктураЗаданияПодразделению.ЗаданиеДляПозиционирования);
		ОткрытьФорму("Обработка.упоРаботаСЗаданиями.Форма", ПараметрыФормы, Форма, Строка(Форма.УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПереключитьСтраницуДоступныеСтатусы(Элементы, ИмяСтраницы)
	
	СтраницаДоступныеСтатусы = Элементы.ГруппаИзменитьСтатус.ПодчиненныеЭлементы.Найти(ИмяСтраницы);
	Если СтраницаДоступныеСтатусы = Неопределено Тогда
		СтраницаДоступныеСтатусы = Элементы.СтраницаИзмененияНедоступны;
	КонецЕсли;
	Элементы.ГруппаИзменитьСтатус.ТекущаяСтраница = СтраницаДоступныеСтатусы; 	
	
КонецПроцедуры

// Завершает ввод задания на осовании ссылки вызванный процедурой СоздатьЗаданиеСВыборомВидаНаОсновании.
//
// Параметры:
//  ДополнительныеПараметры, ВыбранныйЭлемент	 	- Параметры оповещения.
//
Процедура ЗакончитьСозданиеЗаданияНаОсновании(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	Иначе
		ВидЗадания = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидЗадания", ВидЗадания);
	ЗначенияЗаполнения.Вставить("Основание", ДополнительныеПараметры.Ссылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.упоЗадания.ФормаОбъекта", ПараметрыФормы, ДополнительныеПараметры.ПараметрыВыполненияКоманды);

КонецПроцедуры

Функция КомандыПоОтбору(ТаблицаДоступныеСтатусыСКомандами, Отбор)
	
	МассивКоманд = Новый Массив;
	
	//НайденныеСтроки = ТаблицаДоступныеСтатусыСКомандами.НайтиСтроки(Отбор);
	//Для Каждого ТекСтрока Из НайденныеСтроки Цикл
	//	МассивКоманд.Добавить(ТекСтрока.НовыйСтатус);	
	//КонецЦикла;
	Для Каждого ТекСтрока Из ТаблицаДоступныеСтатусыСКомандами Цикл
		Если ТекСтрока.Роль = Отбор.Роль
			И ВРег(ТекСтрока.ВидЗадания) = ВРег(Отбор.ВидЗадания)
			И ВРег(ТекСтрока.ТекущийСтатус) = ВРег(Отбор.ТекущийСтатус) Тогда
			МассивКоманд.Добавить(ТекСтрока.НовыйСтатус);	
		КонецЕсли;		
	КонецЦикла; 
	
	Возврат МассивКоманд;
	
КонецФункции
  
Процедура ДобавитьКомандуВСписок(ТаблицаДоступныеСтатусыСКомандами, Отбор, ВозможныеКоманды, НеНашлиСтроки)
	
	Если Отбор.Роль = "АвторИсполнитель" Тогда
		Отбор.Роль = "Автор";
		МассивКомандАвтор = КомандыПоОтбору(ТаблицаДоступныеСтатусыСКомандами, Отбор);
		
		Отбор.Роль = "Исполнитель";
		МассивКомандИсполнитель = КомандыПоОтбору(ТаблицаДоступныеСтатусыСКомандами, Отбор);
		
		Если МассивКомандАвтор.Количество() = 0 И МассивКомандИсполнитель.Количество() = 0 Тогда
			НеНашлиСтроки = Истина;
			Возврат;	
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКомандАвтор, МассивКомандИсполнитель, Истина);
		МассивКоманд = МассивКомандАвтор;
	Иначе
		МассивКоманд = КомандыПоОтбору(ТаблицаДоступныеСтатусыСКомандами, Отбор);		
		Если МассивКоманд.Количество() = 0 Тогда
			НеНашлиСтроки = Истина;
			Возврат;	
		КонецЕсли;
	КонецЕсли;
		
	Для Каждого ТекКоманда Из МассивКоманд Цикл
		Нашли = Ложь;
		Для Каждого ТекВозможнаяКоманда Из ВозможныеКоманды Цикл					
			Если ТекКоманда = ТекВозможнаяКоманда.ЗаголовокКоманды Тогда
				ТекВозможнаяКоманда.Количество = ТекВозможнаяКоманда.Количество + 1;
				Нашли = Истина;
				Прервать;	
			КонецЕсли;					 
		КонецЦикла; 
		Если Не Нашли Тогда
			Стр = Новый Структура("ЗаголовокКоманды, Количество", ТекКоманда, 1);
			ВозможныеКоманды.Добавить(Стр);	
		КонецЕсли;							
	КонецЦикла;		
				
КонецПроцедуры

Процедура УстановитьВидимостьКнопки(Форма, ИмяКоманды)
	
	Кнопки = Форма.Элементы.СтраницаСтатусыДляГруппыЗаданийГруппаКнопок.ПодчиненныеЭлементы;
	Если ИмяКоманды = "" Тогда
		Для Каждого ТекКнопка Из Кнопки Цикл
			ТекКнопка.Видимость = Ложь;	
		КонецЦикла;
	Иначе
		ТекКнопка = Кнопки.Найти("КнопкаСтатусыДляГруппыЗаданий" + ИмяКоманды);	
		Если Не ТекКнопка = Неопределено Тогда
			ТекКнопка.Видимость = Истина;	
		КонецЕсли; 
	КонецЕсли;	 
	
КонецПроцедуры

#КонецОбласти