
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = "ОборудованиеПродаваемое" Тогда
		СтруктураОбязательныхПолей.Вставить("ЦенаЗакупки");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
//  Заголовок    - Строка - содержит заголовок сообщения.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ, Заголовок) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		Если ПараметрыРасчета.Количество() = 0 Тогда
			СтрокаПараметрРасчета = ПараметрыРасчета.Добавить();
			СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПирНир");
			СтрокаПараметрРасчета.ПроцентНаценкиРедактируетсяВручную = Истина;
			СтрокаПараметрРасчета = ПараметрыРасчета.Добавить();
			СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Оборудование");
			СтрокаПараметрРасчета.ПроцентНаценкиРедактируетсяВручную = Истина;
			СтрокаПараметрРасчета = ПараметрыРасчета.Добавить();
			СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.ПНР");
			СтрокаПараметрРасчета.ПроцентНаценкиРедактируетсяВручную = Истина;
			СтрокаПараметрРасчета = ПараметрыРасчета.Добавить();
			СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.СМР");
			СтрокаПараметрРасчета.ПроцентНаценкиРедактируетсяВручную = Истина;
			СтрокаПараметрРасчета = ПараметрыРасчета.Добавить();
			СтрокаПараметрРасчета.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Прочие");
			СтрокаПараметрРасчета.ПроцентНаценкиРедактируетсяВручную = Истина;
		КонецЕсли;  		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверкаЗаполненияДатыАктирования(Отказ);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
Процедура ПроверкаЗаполненияДатыАктирования(Отказ)

	ИмяТабличнойЧасти = "ПараметрыРасчета";
	МетаданныеТабличнаяЧасть = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти];
	
	ПредставлениеТабличнойЧасти = МетаданныеТабличнаяЧасть.Представление();
	ТабличнаяЧасть = ЭтотОбъект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты = МетаданныеТабличнаяЧасть.Реквизиты;
	ИмяРеквизита = "ДатаАктирования";
	ПредставлениеРеквизита = МетаданныеРеквизиты[ИмяРеквизита].Представление();
	
	ПараметрыОтбора = Новый Структура("СуммаКонтрактаРедактируетсяВручную, ДатаАктирования", Истина, Дата(1,1,1));
	СтрокиСНезаполненнойДатойАктирования = ЭтотОбъект[ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаТаблицы Из СтрокиСНезаполненнойДатойАктирования Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СуммаКонтракта) Тогда
			Продолжить;
		КонецЕсли;	
		
		СтрокаНачалаСообщенияОбОшибке = НСтр("ru = 'В строке №%1 табличной части ""%2"": '");
		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		СтрокаНачалаСообщенияОбОшибке, СокрЛП(СтрокаТаблицы.НомерСтроки), ПредставлениеТабличнойЧасти);
		СтрокаСообщения = НСтр("ru = 'Необходимо заполнить значение реквизита ""%1""'");
		СтрокаСообщения = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(ПредставлениеРеквизита));
		ПолеСообщения =  "Объект." + ИмяТабличнойЧасти + "[" + Формат(ТабличнаяЧасть.Индекс(СтрокаТаблицы), "ЧН=0; ЧГ=0") 
			+ "]." + ИмяРеквизита;
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("Поле", ПолеСообщения);
		обСообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, "",,СтруктураСообщения);	
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти   

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли