#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Полный список доступен только из вкладки "Трудозатраты" проектной задачи.
	Если НЕ Параметры.Свойство("СнятьОграничения") Тогда			
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;	    
		
		ДанныеВыбора.Добавить(Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения);
		ДанныеВыбора.Добавить(Перечисления.упоСпособПривязкиДоходаРасхода.НаДату);	
	КонецЕсли;	

	// При вызове из статьи затрат убираем привязку к дате.
	Если Параметры.Свойство("БезДаты") Тогда			
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;	    
		
		ДанныеВыбора.Добавить(Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения);
		ДанныеВыбора.Добавить(Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно);	
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти