////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции интеграции с УПФ.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает имя группы, сформированное с учетом имени табличной части
// Например, если передано имя "Расход", то метод вернет строку "упоРасходГруппаПроектнаяЗадачаПроект"
//
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя таблицы формы
//
Функция ИмяГруппыТЧПоИмениТЧ(ИмяТабличнойЧасти) Экспорт
	
	ШаблонИмени = "упо%1ГруппаПроектнаяЗадачаПроект";
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмени, ИмяТабличнойЧасти);
	Возврат Результат;

КонецФункции    

// Возвращает имя группы для скрытия элемента "Проект"
// Например, если передано имя "Расход", то метод вернет строку "упоРасходГруппаДляСкрытияПроектаУНФа"
//
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя таблицы формы
//
Функция ИмяГруппыДляСкрытия(ИмяТабличнойЧасти) Экспорт
	
	ШаблонИмени = "упо%1ГруппаДляСкрытияПроектаУНФа";
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмени, ИмяТабличнойЧасти);
	Возврат Результат;

КонецФункции    

// Возвращает имя создаваемой группы в шапке, используется для изменения видимости элементов 
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяСоздаваемойГруппыДляНастройкиВидимостиЭлементов() Экспорт
	
	Возврат "упоГруппаПроектнаяЗадачаПроект";
	
КонецФункции

// Возвращает имя реквизита формы для последующего определения связанной статьи выбранного счета в форме выбора счета
// плана счетов "Управляемый"
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяРеквизитаДляОпределенияВыбораСвязанойСтатьи() Экспорт
	
	Возврат "упоВыборСтатьиДоходов_Расходов";
	
КонецФункции

// Возвращает имя вида заказа покупателя для создания на основании
//
// Возвращаемое значение:
//  Строка - Имя вида заказа
//
Функция ПолучитьИмяВидаЗаказаПокупателя() Экспорт
	Возврат	"ЗаказПокупателя";
КонецФункции

// Возвращает имя вида заказа поставщику для создания на основании
//
// Возвращаемое значение:
//  Строка - Имя вида заказа
//
Функция ПолучитьИмяВидаЗаказаПоставщику() Экспорт
	Возврат	"ЗаказПоставщику";
КонецФункции

// Возвращает имя параметра формы, предназначенного для определения выбора упаковки из Классификатора ед. измерения
//
// Возвращаемое значение:
//  Строка - Имя параметра
//
Функция ПолучитьИмяРеквизитаДляОпределенияВыбораУпаковки() Экспорт
	Возврат "упоЭтоВыборУпаковки";	
КонецФункции

//	Возвращает имена реквизитов необходимых для получения данные по распределения факта трудозатрат
//
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьИменаРеквизитовДляРаспределенияСуммыЗарплатыПоФактуТрудозатрат() Экспорт

	Возврат "Сотрудник, Сумма, НаправлениеДеятельности, Проект";
	
КонецФункции	

// Устанавливает для формы отчета ПлатежныйКалендарь доступность и состояние отборов по Проекту и Проектной задаче
//  в зависимости от значения реквизита упоОтражатьДанныеПоПроекту
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - Форма отчета ПлатежныйКалендарь
//
Процедура УстановитьСостояниеИДоступностьОтборовИОпций(Форма) Экспорт
	
	Если НЕ ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") ИЛИ
		 НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") ИЛИ
		 НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "упоОтображатьПроект") ИЛИ
	     НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "упоОтражатьДанныеПоПроекту") ИЛИ
		 НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "упоОтображатьПроектнуюЗадачу") ИЛИ
		 НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "упоОтражатьИерархиюИСтатус") Тогда
		 Возврат;
	КонецЕсли;	 
	
	// Значение и доступность опций  отображения строк "упоОтображатьПроект" и "упоОтображатьПроектнуюЗадачу" зависят от значения опции "упоОтражатьДанныеПоПроекту"
	// Если опция "упоОтражатьДанныеПоПроекту" установлена в значение "Истина" 
	// 	- автоматически устанавливаем в значение "Истина" опции "упоОтображатьПроект" и "упоОтображатьПроектнуюЗадачу"
	// 	и делаем связанные с ними элементы формы недоступными пользователю.
	Форма.Объект.упоОтображатьПроект = ?(Форма.Объект.упоОтражатьДанныеПоПроекту,
										 Истина,
										 Форма.Объект.упоОтображатьПроект);
	ЭлементупоОтображатьПроект = Форма.Элементы.Найти("упоОтображатьПроект");
	Если ЭлементупоОтображатьПроект <> Неопределено Тогда
		ЭлементупоОтображатьПроект.Доступность = НЕ Форма.Объект.упоОтражатьДанныеПоПроекту;
	КонецЕсли; 
	
	Форма.Объект.упоОтображатьПроектнуюЗадачу = ?(Форма.Объект.упоОтражатьДанныеПоПроекту,
										 		  Истина,
										 		  Форма.Объект.упоОтображатьПроектнуюЗадачу);
	ЭлементупоОтображатьПроектнуюЗадачу = Форма.Элементы.Найти("упоОтображатьПроектнуюЗадачу");
	Если ЭлементупоОтображатьПроектнуюЗадачу <> Неопределено Тогда
		ЭлементупоОтображатьПроектнуюЗадачу.Доступность = НЕ Форма.Объект.упоОтражатьДанныеПоПроекту;
	КонецЕсли;
	
	
	ЭлементупоОтражатьИерархиюИСтатус = Форма.Элементы.Найти("упоОтражатьИерархиюИСтатус");
	Если ЭлементупоОтражатьИерархиюИСтатус <> Неопределено Тогда
		ЭлементупоОтражатьИерархиюИСтатус.Доступность = Форма.Объект.упоОтражатьДанныеПоПроекту ИЛИ
														Форма.Объект.упоОтображатьПроектнуюЗадачу;
	КонецЕсли;

	Форма.Объект.упоОтражатьИерархиюИСтатус = ?(ЭлементупоОтражатьИерархиюИСтатус.Доступность,
												Форма.Объект.упоОтражатьИерархиюИСтатус,
												Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти   
	
  
