
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	// Если документ введен не на основании,
	// то интерфейс должен отработать эту ситуацию.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
		Если Объект.ПроектныеЗадачи.Количество() > 0 Тогда
			ЗаполнитьДопКолонкиПроектныхЗадач();
		КонецЕсли;	
	КонецЕсли;	
	
	ИнициализацияНаСервере();

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	ВывестиПредупреждение();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
  	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ЗаполнитьДопКолонкиПроектныхЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Оповестить("СменаСтатусаПроектнойЗадачи", Новый Структура("Проект", Объект.Проект), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	ЗаполнитьДопКолонкиПроектныхЗадач();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектНажатие(Элемент, СтандартнаяОбработка)
	
	Если Объект.Проведен Тогда
		СтандартнаяОбработка = Ложь;		
		ПоказатьЗначение(, Объект.Проект);	
	Иначе
		упоУправлениеФормамиКлиент.ОбработатьНажатиеНаГиперссылкуРеквизитаОбъекта(Объект, ЭтаФорма, "Проект", СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПроектныеЗадачи

&НаКлиенте
Процедура ПроектныеЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыПодбораСтруктура = Неопределено;
	ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "ПроектныеЗадачи");
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "ПроектнаяЗадача",
		Объект.ПроектныеЗадачи, ЭтаФорма, Истина, ПараметрыПодбораСтруктура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектныеЗадачиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "ПроектнаяЗадача",
		Объект.ПроектныеЗадачи, ЭтаФорма, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПроектныеЗадачиСтатусПриИзменении(Элемент)
	
	ТекущаяСтрокаПЗ = Элементы.ПроектныеЗадачи.ТекущиеДанные;
	упоПроектыИЗадачиКлиент.ПриИзмененииСтатусаПроектнойЗадачиВТаблицеФормы(ТекущаяСтрокаПЗ);
	
	УстановитьФактическиеСрокиПоУмолчанию(ТекущаяСтрокаПЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектныеЗадачиПроцентГотовностиПриИзменении(Элемент)
	
	ТекущаяСтрокаПЗ = Элементы.ПроектныеЗадачи.ТекущиеДанные;
	упоПроектыИЗадачиКлиент.ПриИзмененииПроцентаГотовностиПроектнойЗадачиВТаблицеФормы(ТекущаяСтрокаПЗ);
	
	УстановитьФактическиеСрокиПоУмолчанию(ТекущаяСтрокаПЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектныеЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ПодборВТЧФормы(Команды.Найти("ПроектныеЗадачиПодобрать"));

КонецПроцедуры

&НаКлиенте
Процедура ПроектныеЗадачиДатаНачалаФактПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииФактическихДат(Объект.ПроектныеЗадачи, Элементы.ПроектныеЗадачи.ТекущаяСтрока,
		Элемент.Имя, "ДатаНачалаФакт");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектныеЗадачиДатаЗавершенияФактПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииФактическихДат(Объект.ПроектныеЗадачи, Элементы.ПроектныеЗадачи.ТекущаяСтрока,
		Элемент.Имя, "ДатаЗавершенияФакт");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьЗадачами(Команда)
	
	ИмяТЧ = "ПроектныеЗадачи";
	
	Контекст = Новый Структура("ИмяТЧ", ИмяТЧ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЗадачамиЗавершение", ЭтотОбъект, Контекст);	
	упоЗаполнениеИПодборКлиент.НадоЗаполнятьТабличнуюЧастьДокумента(ЭтаФорма, Объект, ИмяТЧ, Объект[ИмяТЧ], , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадачамиЗавершение(НадоЗаполнять, ДополнительныеПараметры) Экспорт
	
	Если НадоЗаполнять Тогда
		ЗаполнитьТабличнуюЧастьДокумента(ДополнительныеПараметры.ИмяТЧ);
		ЗаполнитьДопКолонкиПроектныхЗадач();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСписаннымЧасам(Команда)
	
	Если Объект.ПроектныеЗадачи.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСписаннымЧасамЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Очистить табличную часть перед добавлением строк?'"), 
			РежимДиалогаВопрос.ДаНетОтмена, 120, КодВозвратаДиалога.Отмена);
				
	Иначе
			
		ЗаполнитьПоСписаннымЧасамЗавершение(Неопределено, Неопределено);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСписаннымЧасамЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	НадоЗаполнять = Истина;
	
	Если Объект.ПроектныеЗадачи.Количество() > 0 Тогда
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ПроектныеЗадачи.Очистить();
		ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
			НадоЗаполнять = Истина; 
		Иначе                  
			НадоЗаполнять = Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
	Если НадоЗаполнять Тогда
		
		ЗаполнитьПроектныеЗадачи();
		ЗаполнитьДопКолонкиПроектныхЗадач();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВТЧФормы(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
		  	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных, 
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		
	  
КонецПроцедуры
	
&НаКлиенте
Процедура РассчитатьПроцентГотовностиЭтаповПроектаПоДлительности(Команда)
	
	РассчитатьПроцентГотовностиЭтаповПроекта(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПроцентГотовностиЭтаповПроектаСУчетомТрудозатрат(Команда)
	
	РассчитатьПроцентГотовностиЭтаповПроекта(Истина);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПроцентГотовностиЭтаповПроекта(УчитыватьТрудозатратыПриРасчетеГотовности)
	
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		Возврат;
	КонецЕсли;
	
	Пар = Новый Структура;
	ДанныеДокумента = упоПроведениеДокументовВызовСервера.обПолучитьДанныеДокумента(Объект.Ссылка);
	СтруктураНастроекПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	
	Пар.Вставить("ТекущаяВерсия", ТекущаяВерсия);
	Пар.Вставить("Проект", Объект.Проект);
	Пар.Вставить("УчитыватьТрудозатратыПриРасчетеГотовности", УчитыватьТрудозатратыПриРасчетеГотовности);	
	Пар.Вставить("НастройкаУровняПланированияПриРасчетеГотовностиПроектов", СтруктураНастроекПроекта.НастройкаУровняПланированияПриРасчетеГотовностиПроектов);
	
	ТаблицаРучнойПроцентГотовности = Новый ТаблицаЗначений;
	ТаблицаРучнойПроцентГотовности.Колонки.Добавить("Задача");
	ТаблицаРучнойПроцентГотовности.Колонки.Добавить("Процент");
	Для Каждого СтрТз Из Объект.ПроектныеЗадачи Цикл
		НовСтр = ТаблицаРучнойПроцентГотовности.Добавить();
		НовСтр.Задача = СтрТз.ПроектнаяЗадача;
		НовСтр.Процент = СтрТз.ПроцентГотовности;
	КонецЦикла;
	Пар.Вставить("ТаблицаРучнойПроцентГотовности", ТаблицаРучнойПроцентГотовности);
	
	Результат = упоАктуализацияПроектаВызовСервера.обАктуализацияГотовностиПроектныхЗадач(Пар);
	
	Для Каждого ТекЗадача Из Результат.ДанныеЗадач Цикл
		
		Если ТипЗнч(ТекЗадача.Задача) = Тип("СправочникСсылка.Проекты") Тогда
			Продолжить;
		КонецЕсли;
		
		РезПоиска = Объект.ПроектныеЗадачи.НайтиСтроки(Новый Структура("ПроектнаяЗадача", ТекЗадача.Задача));
		Если РезПоиска.Количество() > 0 Тогда 
			ЗаполнитьПроцентГотовностиИФактическиеДаты(РезПоиска[0], ТекЗадача);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабличнуюЧастьДокумента(ИмяТЧ)
	
	ТаблицаДанных = Документы.упоРучнаяАктуализацияПроекта.СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект.Проект, ТекущаяВерсия);
	Объект[ИмяТЧ].Загрузить(ТаблицаДанных);
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.
	тОбъект = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);
	тОбъект.ОбработкаЗаполнения(ВыбранноеЗначение);
	ЗначениеВДанныеФормы(тОбъект, Объект);
    
    ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
    
	// И приведем гиперссылку в правильный вид.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроектныеЗадачи()
	
	РезультатЗапроса = Документы.упоРучнаяАктуализацияПроекта.ВыполнитьЗапросЗаполнениеПоСписаннымЧасам(Объект.Проект, ТекущаяВерсия);
	
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяСтрока = Объект.ПроектныеЗадачи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗапроса);
		ЗаполнитьПроцентГотовностиИФактическиеДаты(НоваяСтрока, РезультатЗапроса, Истина);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПроцентГотовностиИФактическиеДаты(СтрокаЗаполнения, ДанныеЗаполнения, ЗаполнятьСтатус = Ложь)
	
	СтрокаЗаполнения.ПроцентГотовности = ДанныеЗаполнения.Готовность;
	Если СтрокаЗаполнения.ПроцентГотовности > 100 Тогда
		СтрокаЗаполнения.ПроцентГотовности = 100;
	КонецЕсли;	
	
	Если СтрокаЗаполнения.ПроцентГотовности = 0 Тогда
		СтрокаЗаполнения.ДатаНачалаФакт = Дата(1,1,1);
		СтрокаЗаполнения.ДатаЗавершенияФакт = Дата(1,1,1);
		Если ЗаполнятьСтатус Тогда
			СтрокаЗаполнения.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Запланирована;
		КонецЕсли;			
	ИначеЕсли СтрокаЗаполнения.ПроцентГотовности = 100 Тогда
		Если Не ЗначениеЗаполнено(СтрокаЗаполнения.ДатаНачалаФакт) Тогда
			СтрокаЗаполнения.ДатаНачалаФакт = СтрокаЗаполнения.ДатаНачала; 
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(СтрокаЗаполнения.ДатаЗавершенияФакт) Тогда
			СтрокаЗаполнения.ДатаЗавершенияФакт = СтрокаЗаполнения.ДатаЗавершения;
		КонецЕсли;
		Если ЗаполнятьСтатус Тогда
			Если ДанныеЗаполнения.ТекущийСтатусЗадачи = СтрокаЗаполнения.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта Тогда
				СтрокаЗаполнения.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта;
			Иначе
				СтрокаЗаполнения.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Завершена;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(СтрокаЗаполнения.ДатаНачалаФакт) Тогда
			СтрокаЗаполнения.ДатаНачалаФакт = СтрокаЗаполнения.ДатаНачала;
		КонецЕсли;	
		СтрокаЗаполнения.ДатаЗавершенияФакт = Дата(1,1,1);
		Если ЗаполнятьСтатус Тогда
			СтрокаЗаполнения.Статус = Перечисления.упоСостояниеСтатусаЗадачи.Выполняется;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры	
			
&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	АдресХранилища = "";
	
	Если имяКоманды = "ПроектныеЗадачиПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец =  Элементы.ПроектныеЗадачи;
		ПараметрыПодбора.ИмяОбъектаВМетаданных =  "Документы.упоПроектнаяЗадача";
        ТаблицаФормы = Объект.ПроектныеЗадачи;
	    ИмяКолонки = "ПроектнаяЗадача";	
		
	КонецЕсли;
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
			
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
		
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыПодбора(имяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора(имяКоманды);
	
	СписокВидимыхКолонок.Добавить("КодСДР", "Код СДР");
	СписокВидимыхКолонок.Добавить("НазваниеПроектнойЗадачи", "Проектная задача"); 

	АдресХранилища  = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора(имяКоманды)
	
	  Перем ТаблицаОтбора;
		
	  упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	  
		  НоваяСтрока =  ТаблицаОтбора.Добавить();
		  
		  НоваяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		  НоваяСтрока.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
		  НоваяСтрока.Применение =  ТипПримененияОтбораКомпоновкиДанных.Элементы;
		  НоваяСтрока.Использование  = Истина;
		  НоваяСтрока.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
		  
		  // Получим все ПЗ по проекту, кроме текущей.
		  ЗапросПЗ = Новый Запрос;
		  ЗапросПЗ.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                    |	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		                    |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РуководительПроектнойЗадачи
		                    |ПОМЕСТИТЬ РПЗПроекта
		                    |ИЗ
		                    |	РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
		                    |ГДЕ
		                    |	упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача.Проект = &Проект
		                    |;
		                    |
		                    |////////////////////////////////////////////////////////////////////////////////
		                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                    |	Свойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
		                    |	Свойства.ЗадачаРодитель КАК ЗадачаРодитель
		                    |ПОМЕСТИТЬ СвойстваПроектныхЗадач
		                    |ИЗ
		                    |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		                    |			,
		                    |			Версия = &Версия
		                    |				И ПроектнаяЗадача.Проект = &Проект) КАК Свойства
		                    |ГДЕ
		                    |	НЕ Свойства.ЗадачаОтменена
		                    |;
		                    |
		                    |////////////////////////////////////////////////////////////////////////////////
		                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                    |	ЕСТЬNULL(Свойства.ПроектнаяЗадача, РПЗ.ПроектнаяЗадача) КАК ПроектнаяЗадача,
		                    |	ЕСТЬNULL(Свойства.ЗадачаРодитель, РПЗ.ПроектнаяЗадача.ЗадачаРодитель) КАК ЗадачаРодитель,
		                    |	ЕСТЬNULL(Свойства.ПроектнаяЗадача.Проект, РПЗ.ПроектнаяЗадача.Проект) КАК Проект,
		                    |	РПЗ.РуководительПроектнойЗадачи КАК РПЗ
		                    |ПОМЕСТИТЬ Данные
		                    |ИЗ
		                    |	СвойстваПроектныхЗадач КАК Свойства
		                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РПЗПроекта КАК РПЗ
		                    |		ПО Свойства.ПроектнаяЗадача = РПЗ.ПроектнаяЗадача
		                    |;
		                    |
		                    |////////////////////////////////////////////////////////////////////////////////
		                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                    |	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача
		                    |ИЗ
		                    |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Проекты
		                    |		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
		                    |		ПО Проекты.Проект = Данные.Проект";
							 
	 ЗапросПЗ.УстановитьПараметр("Проект", Объект.Проект);
	 ЗапросПЗ.УстановитьПараметр("Версия", ТекущаяВерсия);
	 
	 ТаблицаПЗ = ЗапросПЗ.Выполнить().Выгрузить();
	 
	 МассивПЗ = ТаблицаПЗ.ВыгрузитьКолонку("ПроектнаяЗадача");
	 
	 СписокЗадач = Новый СписокЗначений;
	 СписокЗадач.ЗагрузитьЗначения(МассивПЗ);
	 
	 НоваяСтрока.ПравоеЗначение = СписокЗадач;
	 
	 Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	  
КонецФункции

&НаСервере
Процедура ИнициализацияНаСервере()
		
	Если СтруктураКолонокТЧПроектныеЗадачи = Неопределено Тогда
		КлючиСтруктуры = "";
		Для каждого КолонкаПроектныеЗадачи Из Объект.ПроектныеЗадачи.Выгрузить().Колонки Цикл
			КлючиСтруктуры = КлючиСтруктуры + ?(ПустаяСтрока(КлючиСтруктуры), "", ",") + КолонкаПроектныеЗадачи.Имя;
		КонецЦикла;
		СтруктураКолонокТЧПроектныеЗадачи = Новый Структура(КлючиСтруктуры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруКолонок()
	
	Возврат СтруктураКолонокТЧПроектныеЗадачи;
	
КонецФункции

// Выполняет действия при подборе.
//
// Параметры:
//  НоваяСтрока		 - Структура, ДанныеФормыЭлементКоллекции - заполняемая строка.
//  ПараметрыПодбора - Структура - параметры подбора.
//
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(НоваяСтрока, ПараметрыПодбора) Экспорт
	
	СтруктураКолонок = ПолучитьСтруктуруКолонок();
	ЗаполнитьЗначенияСвойств(СтруктураКолонок, НоваяСтрока);
	
	ЗаполнитьДопКолонкиПроектныхЗадач(СтруктураКолонок);
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураКолонок);
	
	СтруктураДанныеСтроки = упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(СтруктураКолонок,
		ПараметрыПодбора.ПараметрыПодбораСписок, ПараметрыПодбора.СвойстваОбъекта);
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопКолонкиПроектныхЗадач(НоваяСтрока = Неопределено)
	
	МасПЗ = Новый Массив;
	МассивСтрок = Новый Массив;
	Если Не НоваяСтрока = Неопределено Тогда
		Если Не ЗначениеЗаполнено(НоваяСтрока.Статус) Тогда
			ПараметрыЗадачи = ПолучитьСтатусИГотовностьЗадачи(НоваяСтрока.ПроектнаяЗадача, ТекущаяВерсия);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыЗадачи);
		КонецЕсли;
		
		МасПЗ.Добавить(НоваяСтрока.ПроектнаяЗадача);
		МассивСтрок.Добавить(НоваяСтрока);
	Иначе
		МассивСтрок = Объект.ПроектныеЗадачи;
		Для Каждого СтрокаТЧ Из МассивСтрок Цикл
			МасПЗ.Добавить(СтрокаТЧ.ПроектнаяЗадача);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеДопКолонокПЗ = ПолучитьДанныеДопКолонокПроектныхЗадач(МасПЗ);
	НазванияПроектныхЗадач = упоПроектыИЗадачиСервер.НазванияПроектныхЗадач(МасПЗ);
	
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		НазваниеЗадачи = НазванияПроектныхЗадач.Получить(СтрокаТЧ.ПроектнаяЗадача);
		Если НазваниеЗадачи <> Неопределено Тогда
			СтрокаТЧ.НазваниеПроектнойЗадачи = НазваниеЗадачи;
		КонецЕсли;
		ДанныеДопКолонокСтроки = ДанныеДопКолонокПЗ.Получить(СтрокаТЧ.ПроектнаяЗадача);
		Если ДанныеДопКолонокСтроки <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеДопКолонокСтроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусИГотовностьЗадачи(Задача, ТекущаяВерсия) 
	
	Результат = Новый Структура("ПроцентГотовности, Статус", 0, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("Версия", ТекущаяВерсия);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) КАК ПроцентГотовности,
	               |	ЕСТЬNULL(упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи, НЕОПРЕДЕЛЕНО) КАК Статус
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ПроектнаяЗадача = &Задача) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &Версия
	               |					И ПроектнаяЗадача = &Задача) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
	               |		ПО упоСтатусыПроектныхЗадачСрезПоследних.Версия = упоПроцентыГотовностиПроектныхЗадачСрезПоследних.Версия
	               |			И упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДопКолонокПроектныхЗадач(МассивПЗ)
	
	Рез  = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	                |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ЭтоПакетРабот,
	                |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха
	                |ПОМЕСТИТЬ ВтСвойстваПЗ
	                |ИЗ
	                |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	                |			,
	                |			Версия = &Версия
	                |				И ПроектнаяЗадача В (&МассивПЗ)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	                |ГДЕ
	                |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ВтСвойстваПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                |	ВЫБОР
	                |		КОГДА ВтСвойстваПЗ.ЭтоВеха
	                |			ТОГДА 9
	                |		КОГДА ВтСвойстваПЗ.ЭтоПакетРабот
	                |				И ВтСвойстваПЗ.ЭтоМодельПакетаРабот
	                |			ТОГДА 6
	                |		КОГДА НЕ ВтСвойстваПЗ.ЭтоПакетРабот
	                |				И НЕ ВтСвойстваПЗ.ЭтоМодельПакетаРабот
	                |			ТОГДА 7
	                |		ИНАЧЕ 8
	                |	КОНЕЦ КАК Картинка,
	                |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	                |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершения
	                |ИЗ
	                |	ВтСвойстваПЗ КАК ВтСвойстваПЗ
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	                |				,
	                |				Версия = &Версия
	                |					И ПроектнаяЗадача В (&МассивПЗ)) КАК упоСрокиПроектныхЗадачСрезПоследних
	                |		ПО ВтСвойстваПЗ.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача";
	Запрос.УстановитьПараметр("МассивПЗ", МассивПЗ);
	Запрос.УстановитьПараметр("Версия", ТекущаяВерсия);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДопКолонкок = Новый Структура("Картинка, ДатаНачала, ДатаЗавершения");
		ЗаполнитьЗначенияСвойств(СтруктураДопКолонкок, Выборка);
		Рез.Вставить(Выборка.ПроектнаяЗадача, СтруктураДопКолонкок);
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции
	
// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ) Экспорт
	
	ПараметрыПодбораСтруктура= Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных = ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;	
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)
	
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРучнаяАктуализацияПроекта.Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);
		
	Иначе 
		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРучнаяАктуализацияПроекта.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура УстановитьФактическиеСрокиПоУмолчанию(СтрокаДерева)
		
	упоПроектыИЗадачиКлиент.УстановитьФактическиеСрокиПоУмолчанию(СтрокаДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждение()
	
	АвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта = АвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта();
	Элементы.НадписьПредупреждениеОбИспользованииАвтоматическогоРасчетаПроцентаГотовности.Видимость =
		АвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта()
	
	АвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта =
		Константы.упоАвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта.Получить();
	Возврат АвтоматическиРассчитыватьПроцентГотовностиЭтаповПроекта;
	
КонецФункции

#КонецОбласти
