
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		
		// Формирование структуры обязательных реквизитов шапки
		
		СтруктураОбязательныхПолей.Вставить("Ресурс");
		СтруктураОбязательныхПолей.Вставить("НормаСтоимости");
		СтруктураОбязательныхПолей.Вставить("Стоимость");
		
		Если ВидНормирования = Перечисления.упоВидНормированияСтоимостиРесурса.ПоВремени Тогда      
			СтруктураОбязательныхПолей.Вставить("ЕдиницаВремени");	
		ИначеЕсли ВидНормирования = Перечисления.упоВидНормированияСтоимостиРесурса.ПоКоличеству Тогда
			СтруктураОбязательныхПолей.Вставить("ЕдиницаИзмерения");
		КонецЕсли; 
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает значение служебного реквизита ВидНормирования
// в зависимости от типа и вида выбранного ресурса. 
//
Процедура УстановитьВидНормирования() Экспорт

	Если Не ЗначениеЗаполнено(Ресурс) Тогда
		Возврат;
	КонецЕсли;
		
	Если упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Ресурс) Тогда
		ВидНормирования = Перечисления.упоВидНормированияСтоимостиРесурса.ПоКоличеству;
		Возврат;
	КонецЕсли; 
	
	Если Ресурс.упоВидРесурса = Перечисления.упоВидРесурса.Материальный 
		И Ресурс.упоВидМатериальногоРесурса = Перечисления.упоВидМатериальногоРесурса.Материал Тогда
		ВидНормирования = Перечисления.упоВидНормированияСтоимостиРесурса.ПоКоличеству;
	Иначе
		ВидНормирования = Перечисления.упоВидНормированияСтоимостиРесурса.ПоВремени;
	КонецЕсли; 
	
КонецПроцедуры // УстановитьВидНормирования()
 
// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать
	// Если требуется добавлять в запись реквизиты шапки, отмечаем их
	// префиксом "Шапка_". 
	
	// Правила движения для регистра сведений УстановленныеНормыСтоимости
	Правила = Новый Структура();
	ПравилаНаложения.Вставить("упоНормыСтоимостиРесурсов", Правила);
	
	// Правила движения для шапки
	ПравилаТаблицы = Новый Структура();	
	Правила.Вставить("ШапкаДокумента", ПравилаТаблицы);
	
	ПравилаДвижения = Новый Структура();
	
	ПравилаТаблицы.Вставить("Движение_УстановкаНормыСтоимостиРесурса", ПравилаДвижения);
	ПравилаДвижения.Вставить("Ресурс", "Ресурс");
	ПравилаДвижения.Вставить("Норма", "НормаСтоимости");
	
	// Правила готовы
	Возврат ПравилаНаложения; 
	
КонецФункции // ПолучитьПравилаНаложенияРеквизитовНаРегистр()
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт

	// Заполним единицу нормирования.
	ТаблицаДвижений = ДанныеДвижений.упоНормыСтоимостиРесурсов;
	Если Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ЕдиницаВремени) Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(ЕдиницаВремени, "ЕдиницаНормирования");
	ИначеЕсли Не упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ЕдиницаИзмерения) Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(ЕдиницаИзмерения, "ЕдиницаНормирования");
	КонецЕсли;
	
	// Заполним стоимость одной единицы нормирования.
	Если Количество <> 0 Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Стоимость / Количество, "ЕдСтоимость");
	Иначе
		ТаблицаДвижений.ЗаполнитьЗначения(Стоимость, "ЕдСтоимость");
	КонецЕсли;
	                                     
КонецПроцедуры // ПодготовитьДанныеДвижений()

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснование = ТипЗнч(Основание);
	
	Если ТипОснование = Тип("Неопределено") Тогда 
		Возврат;	
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипОснование = Тип("СправочникСсылка.Номенклатура") 
		Или ТипОснование = Тип("СправочникСсылка.упоТрудовыеРесурсы")  
		Или ТипОснование = Тип("СправочникСсылка.упоРоли") 
		Или ТипОснование = Тип("СправочникСсылка.упоПроектнаяПродукция") Тогда      
		
		Ресурс = Основание;
		
	ИначеЕсли ТипОснование = Тип("СправочникСсылка.упоНормыСтоимости") Тогда
		
		НормаСтоимости = Основание;
		
	КонецЕсли; 

	Если ТипОснование = Тип("СправочникСсылка.Номенклатура") 
		Или ТипОснование = Тип("СправочникСсылка.упоПроектнаяПродукция") Тогда
		
			ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ЕдиницаИзмерения");	
	
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	УстановитьВидНормирования();
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения); 
	
	// Перед записью документа необходимо очистить "лишние" реквизиты стоимости
	// в противном случае универсальная процедура записи в регистры
	// запишет лишние данные о стоимости использования ресурса. 
	
	Если НЕ Отказ Тогда      
		Если ВидНормирования = Перечисления.упоВидНормированияСтоимостиРесурса.ПоВремени Тогда 
			ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
			Количество = 0;
		ИначеЕсли упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Ресурс) Или 
			ВидНормирования = Перечисления.упоВидНормированияСтоимостиРесурса.ПоКоличеству Тогда
				ЕдиницаВремени = Справочники.упоЕдиницыВремени.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Ресурс) 
		Или (Ресурс.упоВидРесурса = Перечисления.упоВидРесурса.Материальный 
		И Ресурс.упоВидМатериальногоРесурса = Перечисления.упоВидМатериальногоРесурса.Материал) Тогда
		
			ИндексРеквизитаЕдиницаВремени = ПроверяемыеРеквизиты.Найти("ЕдиницаВремени");
			Если ИндексРеквизитаЕдиницаВремени <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ИндексРеквизитаЕдиницаВремени);
			КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = Справочники.Проекты.ПустаяСсылка();
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли