
#Область ОписаниеПеременных

&НаКлиенте
Перем ПеременныеКлиента; // Хранит настройки выбора для поля ПериодПредставление.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства   
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтотОбъект, Объект, Отказ, СтандартнаяОбработка);
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтотОбъект, Объект);
	
	ОбновитьСоответствиеУровнейДерева();
	НастроитьСписокВыбораУровнейГруппировок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтотОбъект, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 
    
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		
	ЗаписатьДеревоПроектныхЗадачВТабличнуюЧасть(ДеревоПроектныеЗадачи, ТекущийОбъект.ПроектныеЗадачи, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды     
    
    ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтотОбъект, Объект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтотОбъект, Объект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "Задания_СтатусЗаданияИзменен" Тогда        
        ОбновитьСтатусСогласования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтотОбъект, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка);
	
    Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") 
        И Источник.ИмяФормы = "Справочник.упоЗадания.Форма.ФормаЭлемента" 
        И Источник.Объект.ОбъектБазы = Объект.Ссылка Тогда        
        ОбновитьСтатусСогласования();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ОбновитьСтатусСогласования();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораФормы = Новый Структура;
	
	// Для выбора значения.
	ЗначениеПериода = Новый СтандартныйПериод;
	ЗначениеПериода.ДатаНачала = Объект.НачалоПериода;
	
	Если НЕ ЗначениеЗаполнено(ЗначениеПериода.ДатаНачала) Тогда
		ЗначениеПериода.ДатаНачала = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
	ПараметрыВыбораФормы.Вставить("Значение", ЗначениеПериода);
	ПараметрыВыбораФормы.Вставить("Элемент", Элемент);
	
	// Для загрузки значения.
	ПараметрыВыбораФормы.Вставить("ПериодПредставлениеИмя", "ПериодПредставление");
	ПараметрыВыбораФормы.Вставить("ПериодЗначениеИмя", "НачалоПериода");
	ПараметрыВыбораФормы.Вставить("ИспользованиеИмя", "ПериодИспользование");
	Если ПериодСогласованияЧасов = ПредопределенноеЗначение("Перечисление.упоПериодыСогласованияТрудозатрат.Неделя") Тогда
		ПараметрыВыбораФормы.Вставить("ВидПериода", ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя"));
	Иначе
		ПараметрыВыбораФормы.Вставить("ВидПериода", ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"));
	КонецЕсли;
	
	ВыборПериодаИзВыпадающегоСписка(-1, ПараметрыВыбораФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.РуководительПроекта) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("РуководительПроекта", Объект.РуководительПроекта));
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("СкрыватьЭтапы", Истина);
		
		ОткрытьФорму("Справочник.Проекты.Форма.упоФормаСпискаУправляемая", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		ОбновитьТаблицуСДанными(Истина); 
		Возврат;
	КонецЕсли;
	
	Объект.РуководительПроекта = упоИерархияИПолномочияСервер.ПолучитьРуководителяПроекта(Объект.Проект);
	
	ОбновитьТаблицуСДанными();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
    
    Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
        ОбновитьТаблицуСДанными(Истина); 
        Возврат;
    КонецЕсли;
    
	Объект.РуководительПодразделения = упоИерархияИПолномочияСервер.ПолучитьРуководителяПодразделенияПоИерархии(
        Объект.Подразделение);
        
	ОбновитьТаблицуСДанными();
        
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.РуководительПодразделения) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		МассивПодразделенийРуководителя = 
        упоИерархияИПолномочияСервер.ПолучитьПодразделенияРуководителяБезИерархии(Объект.РуководительПодразделения);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", МассивПодразделенийРуководителя));
		
		ОткрытьФорму("Справочник.упоПодразделения.ФормаВыбора", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСогласованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, СогласованиеСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура УровеньГруппировокПриИзменении(Элемент)
	
	упоОперацииСДеревьямиКлиент.РазвернутьДеревоДоУровня(Элементы.ДеревоПроектныеЗадачи, 
		ЭтотОбъект.УровеньГруппировок, 
		ЭтотОбъект.СоотвУровняДерева);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПроектныеЗадачи

&НаКлиенте
Процедура ДеревоПроектныеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ДеревоПроектныеЗадачиАктируемыйЭтап" Тогда
		Если ТекДанные.ЭтоТрудовойРесурс Тогда
			ПоказатьЗначение(, ТекДанные.Сотрудник);
		ИначеЕсли ТекДанные.ЭтоПроект Тогда
			ПоказатьЗначение(, ТекДанные.ПроектнаяЗадача);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектныеЗадачиАктируемыйЭтапНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектныеЗадачиАктируемыйЭтапОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектныеЗадачиЧасыПризнОкончПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоПроектныеЗадачи.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступноЧасов = ТекДанные.ЧасыУказанные - ТекДанные.ЧасыНеПризнОконч;
	Если ТекДанные.ЧасыПризнОконч > ДоступноЧасов Тогда
		ТекДанные.ЧасыПризнОконч = ДоступноЧасов;
	КонецЕсли;
	
	ТекДанные.ЧасыОтклОконч = 
		ТекДанные.ЧасыУказанные - ТекДанные.ЧасыПризнОконч - ТекДанные.ЧасыНеПризнОконч;
	ТекДанные.СтоимостьПризнОконч = ТекДанные.ЧасыПризнОконч * ТекДанные.СтавкаПризнОконч;
	
	ПересчитатьИтогиТаблицыПроектныеЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектныеЗадачиЧасыНеПризнОкончПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоПроектныеЗадачи.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступноЧасов = ТекДанные.ЧасыУказанные - ТекДанные.ЧасыПризнОконч;
	Если ТекДанные.ЧасыНеПризнОконч > ДоступноЧасов Тогда
		ТекДанные.ЧасыНеПризнОконч = ДоступноЧасов;
	КонецЕсли;
	
	ТекДанные.ЧасыОтклОконч = ТекДанные.ЧасыУказанные - ТекДанные.ЧасыПризнОконч - ТекДанные.ЧасыНеПризнОконч;
	ТекДанные.СтоимостьНеПризнОконч = ТекДанные.ЧасыНеПризнОконч * ТекДанные.СтавкаНеПризнОконч;
	
	ПересчитатьИтогиТаблицыПроектныеЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектныеЗадачиНормаСтоимостиПризнОкончПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоПроектныеЗадачи.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.СтавкаПризнОконч = ПолучитьСтоимостьПоНорме(ТекДанные.Сотрудник, 
		ТекДанные.НормаСтоимостиПризнОконч, ПериодСогласованияЧасов, Объект.НачалоПериода);
	ТекДанные.СтоимостьПризнОконч = ТекДанные.ЧасыПризнОконч * ТекДанные.СтавкаПризнОконч;
	
	ПересчитатьИтогиТаблицыПроектныеЗадачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроектныеЗадачиНормаСтоимостиНеПризнОкончПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоПроектныеЗадачи.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.СтавкаНеПризнОконч = ПолучитьСтоимостьПоНорме(ТекДанные.Сотрудник, 
		ТекДанные.НормаСтоимостиНеПризнОконч, ПериодСогласованияЧасов, Объект.НачалоПериода);
	ТекДанные.СтоимостьНеПризнОконч = ТекДанные.ЧасыНеПризнОконч * ТекДанные.СтавкаНеПризнОконч;
	
	ПересчитатьИтогиТаблицыПроектныеЗадачи();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ОбновитьТаблицуСДанными();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСогласоватьТрудозатраты(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'Для согласования необходимо записать документ.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СогласующийРуководитель = ПолучитьОдинИзТрудовыхРесурсовРуководителяПодразделения(Объект.Подразделение);
	
	ПараметрыСогласования = Новый Структура;
	ПараметрыСогласования.Вставить("ОбъектБазы", Объект.Ссылка);
	ПараметрыСогласования.Вставить("Наименование", НСтр("ru = 'Согласовать документ: '") + Объект.Ссылка);
	ПараметрыСогласования.Вставить("ВидЗадания", ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование"));
	ПараметрыСогласования.Вставить("СогласующийРуководитель", СогласующийРуководитель);
	
	ОткрытьФорму("Справочник.упоЗадания.Форма.ФормаЭлемента", 
		Новый Структура("ЗначенияЗаполнения", ПараметрыСогласования), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыводитьИерархиюЗадач(Команда)
	
	ВыводитьИерархиюЗадач = НЕ ВыводитьИерархиюЗадач;
	Элементы.ДеревоПроектныеЗадачиВыводитьИерархиюЗадач.Пометка = ВыводитьИерархиюЗадач;
	
	ПерестроитьДеревоЗадач();
	РазвернутьДерево();
	
	НастроитьСписокВыбораУровнейГруппировок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыводитьПодразделение(Команда)
	
	ВыводитьПодразделение = НЕ ВыводитьПодразделение;
	Элементы.ДеревоПроектныеЗадачиВыводитьПодразделение.Пометка = ВыводитьПодразделение;
	
	ПерестроитьДеревоЗадач();
	РазвернутьДерево();
	
	НастроитьСписокВыбораУровнейГруппировок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСвернутьУровни(Команда)
	
	Если СоотвУровняДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	упоОперацииСДеревьямиКлиент.СвернутьСтрокиДерева(Элементы.ДеревоПроектныеЗадачи, СоотвУровняДерева);
	
	УстановитьУровеньГруппировок(ЭтотОбъект, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазвернутьУровни(Команда)
	
	упоОперацииСДеревьямиКлиент.РазвернутьСтрокиДерева(ЭтаФорма, "ДеревоПроектныеЗадачи");
	
	НастроитьСписокВыбораУровнейГруппировок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДатыЗапретаИзмененияДанных(Команда)
	
	ОткрытьФорму("РегистрСведений.ДатыЗапретаИзменения.Форма.ДатыЗапретаИзменения");
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияФормы()
	
	ЗаполнитьСтруктуруНастроек(Настройки);
	
	ЗаполнитьПериодНаФорме();
	
	ВыводитьИерархиюЗадач = Ложь;
	ВыводитьПодразделение = Истина;
	ВыводитьВидыОпераций = Константы.упоУчетСогласованныхТрудозатратПоВидамОпераций.Получить();
	
	Элементы.ДеревоПроектныеЗадачиВыводитьИерархиюЗадач.Пометка = ВыводитьИерархиюЗадач;
	Элементы.ДеревоПроектныеЗадачиВыводитьПодразделение.Пометка = ВыводитьПодразделение;
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	
		
	ДанныеФормыИзОбъекта();
	
	АдаптироватьНаименованияКолонок();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	Если ЭтотОбъект.ТолькоПросмотр Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"СогласоватьРуководителемПодразделения", "Доступность", Ложь);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДатыЗапретаИзменения") Тогда
		Если Не ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ДатыЗапретаИзменения) Тогда
			Элементы.КомандаОткрытьДатыЗапретаИзмененияДанных.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьНаименованияКолонок()
	
	СтруктураКолонок = СтруктураКолонокСПереносомЗаголовков();
	
	Для Каждого КлючЗначение Из СтруктураКолонок Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ДеревоПроектныеЗадачи" + КлючЗначение.Ключ, "Заголовок", КлючЗначение.Значение);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураКолонокСПереносомЗаголовков()
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("СтоимостьИтог", НСтр("ru = 'Стоимость
		|итог'"));
	СтруктураКолонок.Вставить("ПлановыйОбъем", НСтр("ru = 'Объем
		|(план)'"));
	СтруктураКолонок.Вставить("ЧасыУказанные", НСтр("ru = 'Часы
		|указанные'"));
	СтруктураКолонок.Вставить("ЧасыПризнОконч", НСтр("ru = 'Часы
		|согласованные'"));
	СтруктураКолонок.Вставить("ЧасыНеПризнОконч", НСтр("ru = 'Часы
		|по затратной'"));
	СтруктураКолонок.Вставить("СтавкаНеПризнОконч", НСтр("ru = 'Ставка
		|(по затратной)'")); 
		СтруктураКолонок.Вставить("НормаСтоимостиНеПризнОконч", НСтр("ru = 'Норма стоимости
		|(по затратной)'"));
	СтруктураКолонок.Вставить("СтоимостьНеПризнОконч", НСтр("ru = 'Стоимость
		|(по затратной)'"));
	СтруктураКолонок.Вставить("ЧасыОтклОконч", НСтр("ru = 'Часы
		|отклонены'"));
	
	Возврат СтруктураКолонок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОдинИзТрудовыхРесурсовРуководителяПодразделения(пПодразделение) 
	
	Результат = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(пПодразделение) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СпрПодр.Родитель = ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
		|			ТОГДА СпрПодр.Ссылка
		|		КОГДА СпрПодр.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
		|			ТОГДА СпрПодр.Родитель
		|		КОГДА СпрПодр.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
		|			ТОГДА СпрПодр.Родитель.Родитель
		|		КОГДА СпрПодр.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
		|			ТОГДА СпрПодр.Родитель.Родитель.Родитель
		|		КОГДА СпрПодр.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
		|			ТОГДА СпрПодр.Родитель.Родитель.Родитель.Родитель
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Родитель
		|ПОМЕСТИТЬ ПодрРодитель
		|ИЗ
		|	Справочник.упоПодразделения КАК СпрПодр
		|ГДЕ
		|	СпрПодр.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	упоРуководителиПодразделенийСрезПоследних.Руководитель
		|ПОМЕСТИТЬ Руководители
		|ИЗ
		|	РегистрСведений.упоРуководителиПодразделений.СрезПоследних(
		|			,
		|			Подразделение В
		|				(ВЫБРАТЬ
		|					ПодрРодитель.Родитель
		|				ИЗ
		|					ПодрРодитель КАК ПодрРодитель)) КАК упоРуководителиПодразделенийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(упоВладениеРесурсамиСрезПоследних.Ресурс) КАК Ресурс
		|ИЗ
		|	РегистрСведений.упоВладениеРесурсами.СрезПоследних(
		|			,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					Руководители.Руководитель
		|				ИЗ
		|					Руководители)) КАК упоВладениеРесурсамиСрезПоследних
		|ГДЕ
		|	упоВладениеРесурсамиСрезПоследних.ВладеетРесурсом";
		
		Запрос.УстановитьПараметр("Ссылка", пПодразделение);	
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Результат = Выборка.Ресурс;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусСогласования()
	
	СсылкаНаОбъект = Объект.Ссылка;
	СогласованиеСтатусЭлемент = Элементы.СогласованиеСтатус;
	
	Результат = Перечисления.упоСтатусыЗаданий.ПустаяСсылка();
	РезультатСсылка = Справочники.упоЗадания.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	упоЗадания.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ втЗадания
		               |ИЗ
		               |	Справочник.упоЗадания КАК упоЗадания
		               |ГДЕ
		               |	упоЗадания.ОбъектБазы = &СогласуемыйДокумент
		               |	И упоЗадания.ЭтоСогласованиеРодитель
		               |	И НЕ упоЗадания.ПометкаУдаления
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	упоЗаданияСтатусыСрезПоследних.Задание КАК Задание,
		               |	упоЗаданияСтатусыСрезПоследних.Статус КАК Статус,
		               |	упоЗаданияСтатусыСрезПоследних.Период КАК Период
		               |ИЗ
		               |	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(
		               |			,
		               |			Задание В
		               |				(ВЫБРАТЬ
		               |					втЗадания.Ссылка КАК Ссылка
		               |				ИЗ
		               |					втЗадания КАК втЗадания)) КАК упоЗаданияСтатусыСрезПоследних
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
		
		Запрос.УстановитьПараметр("СогласуемыйДокумент", СсылкаНаОбъект);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Результат = Выборка.Статус;
			РезультатСсылка = Выборка.Задание;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СогласованиеСтатусЭлемент.Видимость = Истина;
		СогласованиеСтатус = Результат;
	Иначе
		СогласованиеСтатусЭлемент.Видимость = Ложь;
		СогласованиеСтатус = НСтр("ru = ''");
	КонецЕсли;
	СогласованиеСсылка = РезультатСсылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПерестроитьДеревоЗадач()
	
	ЗаписатьДеревоПроектныхЗадачВТабличнуюЧасть(ДеревоПроектныеЗадачи, Объект.ПроектныеЗадачи, Настройки);
	
	ДанныеФормыИзОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиТаблицыПроектныеЗадачи()
	
	// Функция вызывается при изменении часов или нормы стоимости в форме, поэтому всегда имеем текущие данные.
	ТекущиеДанные = Элементы.ДеревоПроектныеЗадачи.ТекущиеДанные;
	
	// Получаем ее родителя.
	РодительСтрока = ТекущиеДанные.ПолучитьРодителя();
	
	РассчитатьИтогиРодителяСтроки(РодительСтрока);
	
	ПересчитатьИтогиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиДерева()
	
	ИтогПлановыйОбъем = 0;
	ИтогЧасыУказанные = 0;
	ИтогЧасыСогласованные = 0;
	
	Для Каждого СтрокаДерева Из ДеревоПроектныеЗадачи.ПолучитьЭлементы() Цикл
		ИтогПлановыйОбъем = ИтогПлановыйОбъем + СтрокаДерева.ПлановыйОбъем;
		ИтогЧасыУказанные = ИтогЧасыУказанные + СтрокаДерева.ЧасыУказанные;
		ИтогЧасыСогласованные = ИтогЧасыСогласованные + СтрокаДерева.ЧасыПризнОконч;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогиРодителяСтроки(РодительСтрока)
	
	ПодчиненныеСтроки = РодительСтрока.ПолучитьЭлементы();
	
	РодительСтрока.ЧасыПризнОконч = 0;
	РодительСтрока.ЧасыНеПризнОконч = 0;
	
	РодительСтрока.ЧасыОтклОконч = 0;
	РодительСтрока.ПлановыйОбъем = 0;
	
	РодительСтрока.СтоимостьПризнОконч = 0;
	РодительСтрока.СтоимостьНеПризнОконч = 0;
	
	Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
		
		РодительСтрока.ЧасыПризнОконч = РодительСтрока.ЧасыПризнОконч + ПодчиненнаяСтрока.ЧасыПризнОконч;
		РодительСтрока.ЧасыНеПризнОконч = РодительСтрока.ЧасыНеПризнОконч + ПодчиненнаяСтрока.ЧасыНеПризнОконч;
		РодительСтрока.ЧасыОтклОконч = РодительСтрока.ЧасыОтклОконч + ПодчиненнаяСтрока.ЧасыОтклОконч;
		РодительСтрока.ПлановыйОбъем = РодительСтрока.ПлановыйОбъем + ПодчиненнаяСтрока.ПлановыйОбъем;
		
		РодительСтрока.СтоимостьПризнОконч = РодительСтрока.СтоимостьПризнОконч + ПодчиненнаяСтрока.СтоимостьПризнОконч;
		РодительСтрока.СтоимостьНеПризнОконч = РодительСтрока.СтоимостьНеПризнОконч + ПодчиненнаяСтрока.СтоимостьНеПризнОконч;
		
	КонецЦикла;
	
	РодительСтрока.СтоимостьИтог = РодительСтрока.СтоимостьПризнОконч + РодительСтрока.СтоимостьНеПризнОконч;
	
	СледующийРодитель = РодительСтрока.ПолучитьРодителя();
	
    Если СледующийРодитель = Неопределено Тогда 
        Возврат; 
    КонецЕсли;
	
	РассчитатьИтогиРодителяСтроки(СледующийРодитель);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтоимостьПоНорме(Ресурс, Норма, ПериодСогласованияЧасов, НачалоПериода)
	
	Если ПериодСогласованияЧасов = Перечисления.упоПериодыСогласованияТрудозатрат.Неделя Тогда
		КонецПериода = КонецНедели(НачалоПериода);
	Иначе
        КонецПериода = КонецМесяца(НачалоПериода);
    КонецЕсли;
    
    СтоимостьПоНорме = упоРесурсыИНормыВызовСервера.обРассчитатьСтоимостьРесурсаПоНорме(Норма, Ресурс, 1, 
        КонецПериода); 
    
	Возврат СтоимостьПоНорме;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДеревоПроектныхЗадачВТабличнуюЧасть(Дерево, ТабЧасть, Настройки)
	
	МассивСтрокМаксимальногоУровня = Новый Массив;
	
	ТабЧасть.Очистить();
	СтрокиДерева = Дерево.ПолучитьЭлементы();
	ПолучитьМассивДетальныхСтрокДерева(СтрокиДерева, МассивСтрокМаксимальногоУровня);
	
	Для каждого СтрокаДерева Из МассивСтрокМаксимальногоУровня Цикл
		ЗаполнитьЗначенияСвойств(ТабЧасть.Добавить(), СтрокаДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьМассивДетальныхСтрокДерева(СтрокиДерева, МассивСтрок)
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		СтрокиНижнегоУровня = СтрокаДерева.ПолучитьЭлементы();
		
		Если СтрокиНижнегоУровня.Количество() Тогда
			ПолучитьМассивДетальныхСтрокДерева(СтрокиНижнегоУровня, МассивСтрок);
		Иначе
			МассивСтрок.Добавить(СтрокаДерева); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСтруктуруНастроек(Настройки)
	
	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда 
		Настройки = Новый Структура(); 
	КонецЕсли;
	
	КолонкиПоискВРодителе = Новый Структура("ПроектнаяЗадача,РабочееЗадание,Сотрудник,ЧасыУказанные");
	
	Настройки.Вставить("КолонкиПоискВРодителе", КолонкиПоискВРодителе);
	Настройки.Вставить("ГлубинаВнеПроектныхЗадач", 1);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНаФорме()
	
	СтандартныйПериодМесяц = Новый СтандартныйПериод;
	СтандартныйПериодМесяц.ДатаНачала = Объект.НачалоПериода;
	ПериодСогласованияЧасов = Константы.упоПериодСогласованияТрудозатрат.Получить();
	Если ПериодСогласованияЧасов = Перечисления.упоПериодыСогласованияТрудозатрат.Неделя Тогда
		ПериодПредставление = упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(СтандартныйПериодМесяц,
				Перечисления.ДоступныеПериодыОтчета.Неделя);
		Элементы.ПериодПредставление.Заголовок = "Неделя";
	Иначе
		ПериодПредставление = упоФункцииБСПКлиентСервер.ПредставлениеСтандартногоПериода(СтандартныйПериодМесяц,
				Перечисления.ДоступныеПериодыОтчета.Месяц);
		Элементы.ПериодПредставление.Заголовок = "Месяц";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВариантСтандартногоПериодаПоВиду(ВидПериода)
	Если ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День") Тогда
		Возврат ВариантСтандартногоПериода.Сегодня;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаНеделя;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Декада") Тогда
		Возврат ВариантСтандартногоПериода.ЭтаДекада;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотМесяц;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Квартал") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотКвартал;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Полугодие") Тогда
		Возврат ВариантСтандартногоПериода.ЭтоПолугодие;
	ИначеЕсли ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Год") Тогда
		Возврат ВариантСтандартногоПериода.ЭтотГод;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВыборПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат; // Отмена выбора.
	КонецЕсли;
	
	Если Результат = -1 Тогда // Начало выбора.
		// Чтение параметров для формирования списка из сохраненного значения периода.
		ПараметрыВыбора.Вставить("НачалоПериода", ПараметрыВыбора.Значение.ДатаНачала);
		ПараметрыВыбора.Вставить("Вариант", ПараметрыВыбора.Значение.Вариант);
		ИндексНачальногоЗначения = Неопределено;
	ИначеЕсли ТипЗнч(Результат.Значение) = Тип("Структура") Тогда
		// Чтение параметров для формирования списка из выбранного значения.
		ПараметрыВыбора.Вставить("НачалоПериода", Результат.Значение.НачалоПериода);
		ПараметрыВыбора.Вставить("Вариант", Результат.Значение.Вариант);
		ИндексНачальногоЗначения = Результат.Значение.ИндексНачальногоЗначения;
	Иначе
		// Загрузка результата выбора.
		ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора);
		Возврат;
	КонецЕсли;
	
	СписокПериодов = упоФункцииБСПКлиентСервер.СписокФиксированныхПериодов(ПараметрыВыбора.НачалоПериода, 
        ПараметрыВыбора.ВидПериода);
	
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбора.НачалоПериода);
	КонецЕсли;
	
    Если ПараметрыВыбора.Вариант = Неопределено 
        Или ПараметрыВыбора.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода", СписокПериодов[0].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант", Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 0);
		СписокПериодов[0].Значение = ОписаниеНавигационногоЭлемента;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода", СписокПериодов[8].Значение);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант", Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", 8);
		СписокПериодов[8].Значение = ОписаниеНавигационногоЭлемента;
		
		Если Не ПараметрыВыбора.Свойство("ВариантСтандартногоПериодаПоВиду") Тогда
			ПараметрыВыбора.Вставить("ВариантСтандартногоПериодаПоВиду", 
                ВариантСтандартногоПериодаПоВиду(ПараметрыВыбора.ВидПериода));
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода", ПараметрыВыбора.НачалоПериода);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант", ПараметрыВыбора.ВариантСтандартногоПериодаПоВиду);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", Неопределено);
		СписокПериодов.Добавить(ОписаниеНавигационногоЭлемента, НСтр("ru = 'Относительный...'"));
		
	Иначе
		
		СписокПериодов = упоФункцииБСПКлиентСервер.СписокВычисляемыхПериодов(ПараметрыВыбора.ВидПериода);
		
		Если ИндексНачальногоЗначения = Неопределено Тогда
			ИндексНачальногоЗначения = СписокПериодов.НайтиПоЗначению(ПараметрыВыбора.Вариант);
		КонецЕсли;
		
		ОписаниеНавигационногоЭлемента = Новый Структура;
		ОписаниеНавигационногоЭлемента.Вставить("НачалоПериода", ПараметрыВыбора.НачалоПериода);
		ОписаниеНавигационногоЭлемента.Вставить("Вариант", Неопределено);
		ОписаниеНавигационногоЭлемента.Вставить("ИндексНачальногоЗначения", Неопределено);
		СписокПериодов.Добавить(ОписаниеНавигационногоЭлемента, НСтр("ru = 'Фиксированный...'"));
		
	КонецЕсли;
	
	Если ИндексНачальногоЗначения = Неопределено Тогда
		ИндексНачальногоЗначения = СписокПериодов.Количество() - 1;
	КонецЕсли;
	
	Если ПеременныеКлиента = Неопределено Тогда
		
		ПеременныеКлиента = Новый Структура;
		
	КонецЕсли;
	
	ПеременныеКлиента.Вставить("ВыборПериодаИзВыпадающегоСписка", Новый Структура);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ПараметрыВыбора", ПараметрыВыбора);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("СписокПериодов", СписокПериодов);
	ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка.Вставить("ИндексНачальногоЗначения", ИндексНачальногоЗначения);
	Если Результат = -1 Тогда
		НачатьВыборПериодаИзВыпадающегоСписка();
	Иначе
		ПодключитьОбработчикОжидания("НачатьВыборПериодаИзВыпадающегоСписка", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСпискаЗавершение(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьТаблицуСДанными();
    
	Модифицированность = Истина;
	ВыборПериодаИзВыпадающегоСписка(РезультатВыбора, Контекст.ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборПериодаИзВыпадающегоСписка()
	Если ПеременныеКлиента.Свойство("ВыборПериодаИзВыпадающегоСписка") Тогда
		Контекст = ПеременныеКлиента.ВыборПериодаИзВыпадающегоСписка;
		ПеременныеКлиента.Удалить("ВыборПериодаИзВыпадающегоСписка");
		Оповещение = Новый ОписаниеОповещения("НачатьВыборПериодаИзВыпадающегоСпискаЗавершение", ЭтотОбъект, Контекст);
		ПоказатьВыборИзСписка(Оповещение, Контекст.СписокПериодов, Контекст.ПараметрыВыбора.Элемент, 
			Контекст.ИндексНачальногоЗначения);
	КонецЕслИ;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРезультатВыбораПериодаИзВыпадающегоСписка(Результат, ПараметрыВыбора)
	Значение = ПараметрыВыбора.Значение;
	
	// Запись результата выбора в данные формы и пользовательские настройки КД.
	Если ТипЗнч(Результат.Значение) = Тип("ВариантСтандартногоПериода") Тогда
		ЭтотОбъект[ПараметрыВыбора.ПериодПредставлениеИмя] = 
            ?(ПустаяСтрока(Результат.Представление), Строка(Результат.Значение), Результат.Представление);
		Значение.Вариант = Результат.Значение;
	Иначе
		НачалоПериода = упоФункцииБСПКлиентСервер.НачалоПериодаОтчета(ПараметрыВыбора.ВидПериода, Результат.Значение);
		КонецПериода = упоФункцииБСПКлиентСервер.КонецПериодаОтчета(ПараметрыВыбора.ВидПериода, Результат.Значение);
		
		ЭтотОбъект[ПараметрыВыбора.ПериодПредставлениеИмя] = Результат.Представление;
		
		Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Значение.ДатаНачала = НачалоПериода;
		Значение.ДатаОкончания = КонецПериода;
	КонецЕсли;
	
	Объект.НачалоПериода = Значение.ДатаНачала;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуСДаннымиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПроектныеЗадачи.Очистить();
	ДеревоПроектныеЗадачи.ПолучитьЭлементы().Очистить();
	
	ЗаполнитьДанныеФормыИзБазыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуСДанными(ПолнаяОчисткаДанных = Ложь)
	
	Если ДеревоПроектныеЗадачи.ПолучитьЭлементы().Количество() > 0 Тогда
		
		Если ПолнаяОчисткаДанных Тогда
			Объект.ПроектныеЗадачи.Очистить();
			ДеревоПроектныеЗадачи.ПолучитьЭлементы().Очистить();
			Возврат;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ОбновитьТаблицуСДаннымиЗавершение", ЭтотОбъект);
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Табличная часть будет очищена. Продолжить?';"), Режим, 0);
		
	Иначе
		
		Если ПолнаяОчисткаДанных Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьДанныеФормыИзБазыКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеФормыИзБазыКлиент()
	
	ЗаполнитьПоДаннымИзБазы = Истина;
	ДанныеФормыИзОбъекта(ЗаполнитьПоДаннымИзБазы);
	
	РазвернутьДерево();
	
	НастроитьСписокВыбораУровнейГруппировок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	ОбновитьСоответствиеУровнейДерева();
	
	// Разворачивание дерева.
	СтрокиДерева = ДеревоПроектныеЗадачи.ПолучитьЭлементы();
	Если СтрокиДерева.Количество() > 0 Тогда
		Для Каждого СтрокаДерева Из СтрокиДерева Цикл
			ИдентификаторСтрокиДерева = СтрокаДерева.ПолучитьИдентификатор();
			Элементы.ДеревоПроектныеЗадачи.Развернуть(ИдентификаторСтрокиДерева, Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область ЗаполнениеДерева

// Заполняет данные формы из объекта, при необходимости выполняет заполнение из регистра.
//
// Параметры:
//  ЗаполнитьПоДаннымИзБазы	 - Булево - признак необходимости заполнения документа по данным регистров.
//
&НаСервере
Процедура ДанныеФормыИзОбъекта(ЗаполнитьПоДаннымИзБазы = Ложь)
	
	СогласованиеОбъект = РеквизитФормыВЗначение("Объект");
	СогласованиеОбъект.ДополнительныеСвойства.Вставить("ВыводитьИерархиюЗадач", ВыводитьИерархиюЗадач);
	СогласованиеОбъект.ДополнительныеСвойства.Вставить("ВыводитьПодразделение", ВыводитьПодразделение);
	СогласованиеОбъект.ДополнительныеСвойства.Вставить("ВыводитьВидыОпераций", ВыводитьВидыОпераций);
	
	Если ЗаполнитьПоДаннымИзБазы Тогда
		ЗаполнитьПроектныеЗадачи(СогласованиеОбъект);
	КонецЕсли;
	
	ДЗ_ДеревоПроектныеЗадачи = РеквизитФормыВЗначение("ДеревоПроектныеЗадачи");
	ЗаполнитьДеревоПроектныхЗадачИзТабЧасти(ДЗ_ДеревоПроектныеЗадачи, СогласованиеОбъект);
	
	ИтогПлановыйОбъем = ДЗ_ДеревоПроектныеЗадачи.Строки.Итог("ПлановыйОбъем");
	ИтогЧасыУказанные = ДЗ_ДеревоПроектныеЗадачи.Строки.Итог("ЧасыУказанные");
	ИтогЧасыСогласованные = ДЗ_ДеревоПроектныеЗадачи.Строки.Итог("ЧасыПризнОконч");
	
	ЗначениеВРеквизитФормы(ДЗ_ДеревоПроектныеЗадачи, "ДеревоПроектныеЗадачи");
	
КонецПроцедуры

// Возвращает текст запроса с данными о стоимости, ставке, часах и т.д. по проекту.
// 
// Параметры:
//  Объект - ДокументОбъект.упоСогласованиеТрудозатрат
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаУказанныеЧасы(Объект)
	
	УчетСогласованныхЧасовПоВидамОпераций = Константы.упоУчетСогласованныхТрудозатратПоВидамОпераций.Получить();
	
	Текст1ПолеУчетПоВидуОперации = ?(УчетСогласованныхЧасовПоВидамОпераций, 
		" упоИспользованиеРабочегоВремени.ВидОперации КАК ВидОперации,", "");
	Текст1ГруппировкаПолейУчетПоВидуОперации = ?(УчетСогласованныхЧасовПоВидамОпераций, 
		", упоИспользованиеРабочегоВремени.ВидОперации", "");
	
	Текст2ПолеУчетПоВидуОперации = ?(УчетСогласованныхЧасовПоВидамОпераций, 
	" ТаблицаСНормами.ВидОперации КАК ВидОперации,", "");
	
	Текст3ПолеУчетПоВидуОперации = ?(УчетСогласованныхЧасовПоВидамОпераций, 
		" ТаблицаСоСтавкамиИРолями.ВидОперации КАК ВидОперации,", "");
	Текст3ГруппировкаПолейУчетПоВидуОперации = ?(УчетСогласованныхЧасовПоВидамОпераций, 
		", ТаблицаСоСтавкамиИРолями.ВидОперации", "");
	
	ТекстОтборПоВерсии = ?(ЗначениеЗаполнено(Объект.Проект), "Версия = &ТекВерсия", "");
	ТекстОтборПоПодразделению = ?(ЗначениеЗаполнено(Объект.Подразделение), "
			|	И упоИспользованиеРабочегоВремени.Подразделение = &Подразделение", "");
	ТекстОтборПоРуководителюПроекта = ?(ЗначениеЗаполнено(Объект.РуководительПроекта), "
			|	И (упоВерсииПроекта.Проект В (&МассивПроектов))", "");

	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	упоИспользованиеРабочегоВремени.ЗадачаПричина КАК Проект,
		|	упоИспользованиеРабочегоВремени.РабочееЗадание КАК ПроектнаяЗадача,
		|	упоСвойстваПроектныхЗадачСрезПоследних.Версия КАК Версия,
		|	упоИспользованиеРабочегоВремени.Подразделение КАК Подразделение,
		|	упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимости,
		|	упоИспользованиеРабочегоВремени.РабочееЗадание КАК РабочееЗадание,
		|	упоИспользованиеРабочегоВремени.ТрудовойРесурс КАК Сотрудник,
		|	упоИспользованиеРабочегоВремени.РольРесурса КАК Роль,
		|	&Текст1ПолеУчетПоВидуОперации
		|	СУММА(упоИспользованиеРабочегоВремени.Трудозатраты) КАК ЧасыУказанные,
		|	СУММА(упоИспользованиеРабочегоВремени.Трудозатраты) КАК ЧасыПризнПредвар,
		|	СУММА(упоИспользованиеРабочегоВремени.Трудозатраты) КАК ЧасыПризнОконч
		|ПОМЕСТИТЬ ТаблицаСНормами
		|ИЗ
		|	РегистрСведений.упоИспользованиеРабочегоВремени КАК упоИспользованиеРабочегоВремени
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, &ТекстОтборПоВерсии) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|			ПО (упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия)
		|				И (упоВерсииПроекта.Текущая)
		|				&ТекстОтборПоРуководителюПроекта
		|		ПО (упоИспользованиеРабочегоВремени.РабочееЗадание = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача)
		|			И (упоИспользованиеРабочегоВремени.День МЕЖДУ &ДатаНач И &ДатаКон)
		|			И (упоИспользованиеРабочегоВремени.РазделУчета = &РазделУчетаПроектнаяЗадача)
		|			&ТекстОтборПоПодразделению
 		|СГРУППИРОВАТЬ ПО
		|	упоИспользованиеРабочегоВремени.ЗадачаПричина,
		|	упоСвойстваПроектныхЗадачСрезПоследних.Версия,
		|	упоИспользованиеРабочегоВремени.ТрудовойРесурс,
		|	упоИспользованиеРабочегоВремени.РольРесурса,
		|	упоИспользованиеРабочегоВремени.РабочееЗадание,
		|	упоИспользованиеРабочегоВремени.Подразделение,
		|	упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов,
		|	упоИспользованиеРабочегоВремени.РабочееЗадание
		|	&Текст1ГруппировкаПолейУчетПоВидуОперации
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаСНормами.Проект,
		|	ТаблицаСНормами.ПроектнаяЗадача,
		|	ТаблицаСНормами.Версия,
		|	ТаблицаСНормами.Подразделение,
		|	&Текст2ПолеУчетПоВидуОперации
		|	ТаблицаСНормами.НормаСтоимости,
		|	ТаблицаСНормами.РабочееЗадание,
		|	ТаблицаСНормами.Сотрудник,
		|	ТаблицаСНормами.Роль,
		|	ТаблицаСНормами.ЧасыУказанные,
		|	ТаблицаСНормами.ЧасыПризнПредвар,
		|	ТаблицаСНормами.ЧасыПризнОконч,
		|	ЕСТЬNULL(упоНормыСтоимостиРесурсовСрезПоследних.ЕдСтоимость, 0) КАК Ставка,
		|	ЕСТЬNULL(упоНормыСтоимостиРесурсовСрезПоследних.ЕдСтоимость, 0) * ТаблицаСНормами.ЧасыУказанные КАК Стоимость,
		|	ЕСТЬNULL(упоНормыСтоимостиРесурсовСрезПоследнихЗатр.ЕдСтоимость, 0) КАК ЗатратнаяСтавка,
		|	ЕСТЬNULL(упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатрат, 0) КАК ДоляТрудозатрат
		|ПОМЕСТИТЬ ТаблицаСоСтавкамиИРолями
		|ИЗ
		|	ТаблицаСНормами КАК ТаблицаСНормами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(&ДатаКон, ) КАК упоНормыСтоимостиРесурсовСрезПоследних
		|		ПО ТаблицаСНормами.Сотрудник = упоНормыСтоимостиРесурсовСрезПоследних.Ресурс
		|			И ТаблицаСНормами.НормаСтоимости = упоНормыСтоимостиРесурсовСрезПоследних.Норма
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(&ДатаКон, Норма = &НормаСтоимостиЗатратная) КАК упоНормыСтоимостиРесурсовСрезПоследнихЗатр
		|		ПО ТаблицаСНормами.Сотрудник = упоНормыСтоимостиРесурсовСрезПоследнихЗатр.Ресурс
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(&ДатаКон, &ТекстОтборПоВерсии) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
		|		ПО ТаблицаСНормами.ПроектнаяЗадача = упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача
		|			И ТаблицаСНормами.Сотрудник = упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс
		|			И (упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаСоСтавкамиИРолями.Проект, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|			ТОГДА Проекты.Ссылка
		|		ИНАЧЕ ТаблицаСоСтавкамиИРолями.Проект
		|	КОНЕЦ КАК ПроектнаяЗадача,
		|	ТаблицаСоСтавкамиИРолями.Подразделение,
		|	&Текст3ПолеУчетПоВидуОперации
		|	ТаблицаСоСтавкамиИРолями.НормаСтоимости КАК НормаСтоимости,
		|	ТаблицаСоСтавкамиИРолями.РабочееЗадание,
		|	ТаблицаСоСтавкамиИРолями.Сотрудник,
		|	ТаблицаСоСтавкамиИРолями.Роль,
		|	Максимум(ТаблицаСоСтавкамиИРолями.ЧасыУказанные) КАК ЧасыУказанные,
		|	Максимум(ТаблицаСоСтавкамиИРолями.ЧасыПризнПредвар) КАК ЧасыПризнПредвар,
		|	Максимум(ТаблицаСоСтавкамиИРолями.ЧасыПризнОконч) КАК ЧасыПризнОконч,
		|	Максимум(ТаблицаСоСтавкамиИРолями.Ставка) КАК Ставка,
		|	Максимум(ТаблицаСоСтавкамиИРолями.Стоимость) КАК Стоимость,
		|	Максимум(ТаблицаСоСтавкамиИРолями.ЗатратнаяСтавка) КАК ЗатратнаяСтавка,
		|	СУММА(ЕСТЬNULL(упоПланТрудовыхРесурсовСрезПоследних.Количество, 0) * ТаблицаСоСтавкамиИРолями.ДоляТрудозатрат / 100) КАК ПлановыйОбъем,
		|	СУММА(ЕСТЬNULL(упоПланТрудовыхРесурсовСрезПоследних.ОбщСтоимость, 0) * ТаблицаСоСтавкамиИРолями.ДоляТрудозатрат / 100) КАК ПлановаяСтоимость
		|ИЗ
		|	ТаблицаСоСтавкамиИРолями КАК ТаблицаСоСтавкамиИРолями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, &ТекстОтборПоВерсии) КАК упоПланТрудовыхРесурсовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		|			ПО упоПланТрудовыхРесурсовСрезПоследних.Версия = упоВерсииПроекта.Версия
		|				И (упоВерсииПроекта.Текущая)
		|		ПО ТаблицаСоСтавкамиИРолями.ПроектнаяЗадача = упоПланТрудовыхРесурсовСрезПоследних.ПроектнаяЗадача
		|			И ТаблицаСоСтавкамиИРолями.Роль = упоПланТрудовыхРесурсовСрезПоследних.Ресурс
		|			И ТаблицаСоСтавкамиИРолями.Подразделение = упоПланТрудовыхРесурсовСрезПоследних.Подразделение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО ТаблицаСоСтавкамиИРолями.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		|			И (Проекты.ЭтоПроектнаяЗадача)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаСоСтавкамиИРолями.Проект, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|			ТОГДА Проекты.Ссылка
		|		ИНАЧЕ ТаблицаСоСтавкамиИРолями.Проект
		|	КОНЕЦ,
		|	ТаблицаСоСтавкамиИРолями.Подразделение,
		|	ТаблицаСоСтавкамиИРолями.НормаСтоимости,
		|	ТаблицаСоСтавкамиИРолями.РабочееЗадание,
		|	ТаблицаСоСтавкамиИРолями.Роль,
		|	ТаблицаСоСтавкамиИРолями.Сотрудник
		|	&Текст3ГруппировкаПолейУчетПоВидуОперации";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Текст1ПолеУчетПоВидуОперации", Текст1ПолеУчетПоВидуОперации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Текст1ГруппировкаПолейУчетПоВидуОперации", 
		Текст1ГруппировкаПолейУчетПоВидуОперации);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Текст2ПолеУчетПоВидуОперации", Текст2ПолеУчетПоВидуОперации);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Текст3ПолеУчетПоВидуОперации", Текст3ПолеУчетПоВидуОперации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Текст3ГруппировкаПолейУчетПоВидуОперации", 
		Текст3ГруппировкаПолейУчетПоВидуОперации);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтборПоВерсии", ТекстОтборПоВерсии);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтборПоПодразделению", ТекстОтборПоПодразделению);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтборПоРуководителюПроекта", ТекстОтборПоРуководителюПроекта);
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Заполняет табличную часть "Проектные задачи" на основании данных выборки из результата запроса.
//
// Параметры:
//  Объект - ДокументОбъект.упоУтверждениеТрудозатрат
//  ТекстЗапроса - Строка - см. ПолучитьТекстЗапросаУказанныеЧасы(). 
&НаСервереБезКонтекста
Процедура ЗаполнитьПроектныеЗадачи(СогласованиеОбъект)
	
	НормаСтоимостиЗатратная = Константы.упоНормаСтоимостиНесогласованныхТрудозатрат.Получить();
	
	ПериодСогласованияЧасов = Константы.упоПериодСогласованияТрудозатрат.Получить();
	Если ПериодСогласованияЧасов = Перечисления.упоПериодыСогласованияТрудозатрат.Неделя Тогда
		КонецПериода = КонецНедели(СогласованиеОбъект.НачалоПериода);
	Иначе
		КонецПериода = КонецМесяца(СогласованиеОбъект.НачалоПериода);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", СогласованиеОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон", КонецПериода);
	Если ЗначениеЗаполнено(СогласованиеОбъект.Проект) Тогда
		Запрос.УстановитьПараметр("ТекВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(СогласованиеОбъект.Проект));
	КонецЕсли;
	Запрос.УстановитьПараметр("Подразделение", СогласованиеОбъект.Подразделение);
	Запрос.УстановитьПараметр("РазделУчетаПроектнаяЗадача", Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("Ссылка", СогласованиеОбъект.Ссылка);
	Запрос.УстановитьПараметр("НормаСтоимостиЗатратная", НормаСтоимостиЗатратная);
	
	Если ЗначениеЗаполнено(СогласованиеОбъект.РуководительПроекта) Тогда
		МассивПроектов = ПолучитьМассивПроектовРуководителя(СогласованиеОбъект.РуководительПроекта);
		Запрос.УстановитьПараметр("МассивПроектов", МассивПроектов);
	КонецЕсли;
	
	Запрос.Текст = ПолучитьТекстЗапросаУказанныеЧасы(СогласованиеОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		НовСтрока = СогласованиеОбъект.ПроектныеЗадачи.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.НормаСтоимостиПризнОконч = Выборка.НормаСтоимости;
		НовСтрока.НормаСтоимостиНеПризнОконч = НормаСтоимостиЗатратная;
		НовСтрока.СтоимостьПризнОконч = Выборка.Стоимость;
		НовСтрока.СтавкаПризнОконч = Выборка.Ставка;
		НовСтрока.СтавкаНеПризнОконч = Выборка.ЗатратнаяСтавка;
		
	КонецЦикла;
	
	СогласованиеОбъект.ПроектныеЗадачи.Сортировать("Сотрудник, ПроектнаяЗадача, Подразделение");
	
КонецПроцедуры

// Заполняет реквизит формы дерево проектных задач на основании данных табличной части документа.
//
&НаСервереБезКонтекста
Процедура ЗаполнитьДеревоПроектныхЗадачИзТабЧасти(ДеревоПроектныхЗадач, Объект)
	
	ВыводитьВидыОпераций = Неопределено;
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ВыводитьВидыОпераций", ВыводитьВидыОпераций) Тогда
		ВыводитьВидыОпераций = Ложь;
	КонецЕсли;
	
	ВыводитьИерархиюЗадач = Объект.ДополнительныеСвойства.Свойство("ВыводитьИерархиюЗадач") И 
		Объект.ДополнительныеСвойства.ВыводитьИерархиюЗадач;
	
	МассивУровней = Новый Массив;
	Если Не ВыводитьИерархиюЗадач Тогда
		МассивУровней.Добавить("Проект");
	КонецЕсли;
	МассивУровней.Добавить("ПроектнаяЗадача");
	Если Объект.ДополнительныеСвойства.Свойство("ВыводитьПодразделение") Тогда
		Если Объект.ДополнительныеСвойства.ВыводитьПодразделение Тогда
			МассивУровней.Добавить("Подразделение");
		КонецЕсли;
	КонецЕсли;
	Если ВыводитьВидыОпераций Тогда
		МассивУровней.Добавить("ВидОперации");
	КонецЕсли;
	МассивУровней.Добавить("Сотрудник");
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPMO() Тогда
		МассивУровней.Добавить("РабочееЗадание");
	КонецЕсли;
	
	МассивСумм = Новый Массив;
	МассивСумм.Добавить("ЧасыУказанные");
	МассивСумм.Добавить("ЧасыПризнОконч");
	МассивСумм.Добавить("СтоимостьПризнОконч");
	МассивСумм.Добавить("ЧасыНеПризнОконч");
	МассивСумм.Добавить("СтоимостьНеПризнОконч");
	МассивСумм.Добавить("ОбъемПлановый");
	МассивСумм.Добавить("ЧасыОтклОконч");
	МассивСумм.Добавить("ПлановыйОбъем");
	
	ОписаниеИерархии = Новый Структура();
	Если ВыводитьИерархиюЗадач Тогда
		ОписаниеИерархии.Вставить("ПроектнаяЗадача", "ИЕРАРХИЯ");
	КонецЕсли;
	
	ТаблицаЗадач = Объект.ПроектныеЗадачи.Выгрузить();
	Если Не ВыводитьИерархиюЗадач Тогда
		ТаблицаЗадач.Колонки.Добавить("Проект", Новый ОписаниеТипов("СправочникСсылка.Проекты"));
		МассивЗадач = ТаблицаЗадач.ВыгрузитьКолонку("ПроектнаяЗадача");
		Проекты = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЗадач, "упоКорневойПроект");
		Для Каждого СтрокаТаблицы Из ТаблицаЗадач Цикл
			СтрокаТаблицы.Проект = Проекты[СтрокаТаблицы.ПроектнаяЗадача];
		КонецЦикла;
	КонецЕсли;
	
	врДеревоПроектныхЗадач = ПолучитьДеревоПоТЗ(ТаблицаЗадач, МассивУровней, ОписаниеИерархии, МассивСумм);
	
	упоФункцииОбщегоНазначенияСервер.ЗагрузитьДеревоЗначений(врДеревоПроектныхЗадач, ДеревоПроектныхЗадач);
	
	ВыполнитьДляСтрокДерева(ДеревоПроектныхЗадач);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДеревоПоТЗ(ТаблицаЗадач, МассивУровней, ОписаниеИерархии, МассивСумм)
	
	Возврат упоФункцииОбщегоНазначенияСервер.ПолучитьДеревоПоТЗ_V3(ТаблицаЗадач, 
		МассивУровней, 
		ОписаниеИерархии, 
		МассивСумм, 
		"АктируемыйЭтап", 
		, 
		Ложь);
		
КонецФункции

&НаСервереБезКонтекста
Процедура ВыполнитьДляСтрокДерева(Дерево)
	
	Для каждого Строка Из Дерево.Строки Цикл
		ВыполнитьДляСтрокДерева(Строка);
		
		РассчитатьСтоимостьИтогВСтроке(Строка);
		УстановитьФлагиИКартинкуВСтроке(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьФлагиИКартинкуВСтроке(СтрокаДерева)
	
	// Определение индекса картинки.
	// Поле дерева "ТипЗадачи" для определения картинки правильно устанавливать при получении задачи из базы, 
	// но поскольку таблица документа обрабатывается через общие функции без отдельного запроса, 
	// то определяем тип задачи в постобработке по косвенному признаку: если у группы с типом "Проект" 
	// есть родитель с типом "Проект", то считаем, что родитель является этапом и присваиваем ему ТипЗадачи = 1.
	
	ТипГруппировки = ТипЗнч(СтрокаДерева.АктируемыйЭтап);
	СтрокаДереваРодитель = СтрокаДерева.Родитель;
	ИмяУровня = "";
	
	Если СтрокаДереваРодитель = Неопределено Тогда
		Если ТипГруппировки = Тип("СправочникСсылка.Проекты")
			И Не ЗначениеЗаполнено(СтрокаДерева.АктируемыйЭтап.Родитель) Тогда 
			
			СтрокаДерева.ЭтоПроект = Истина;
			ИмяУровня = "Проект";
			
		КонецЕсли;
	Иначе
		Если ТипГруппировки = Тип("СправочникСсылка.упоТрудовыеРесурсы") Тогда
		
			Если ЗначениеЗаполнено(СтрокаДерева.Роль) Тогда
				СтрокаДерева.АктируемыйЭтап = СтрШаблон("%1 (%2)", СтрокаДерева.Сотрудник, СтрокаДерева.Роль);
			КонецЕсли;
			СтрокаДерева.ЭтоТрудовойРесурс = Истина;
			ИмяУровня = "Роль";
			
		ИначеЕсли ТипГруппировки = Тип("СправочникСсылка.упоПодразделения") Тогда
			
			ИмяУровня = "Подразделение";
			
		ИначеЕсли ТипГруппировки = Тип("СправочникСсылка.Проекты") Тогда
			
			ИмяУровня = "ПроектнаяЗадачаЗеркало";
			Если ТипЗнч(СтрокаДереваРодитель.АктируемыйЭтап) = Тип("СправочникСсылка.Проекты") Тогда
				СтрокаДереваРодитель.ТипЗадачи = 1;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаДерева.ИндексКартинки = 
		упоРаботаСФормамиКлиентСервер.ИндексКартинкиДокументаПланирования(ИмяУровня, СтрокаДерева);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьСтоимостьИтогВСтроке(пСтрока)
	
	Если пСтрока.Строки.Количество() = 0 Тогда
		пСтрока.СтоимостьИтог = 0;
	Иначе
		пСтрока.СтоимостьИтог = пСтрока.СтоимостьПризнОконч + пСтрока.СтоимостьНеПризнОконч;
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьМассивПроектовРуководителя(РуководительПроекта)

	МассивПроектов = Новый Массив();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоРуководителиПроектовСрезПоследних.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК упоРуководителиПроектовСрезПоследних
	|ГДЕ
	|	упоРуководителиПроектовСрезПоследних.РуководительПроекта = &РуководительПроекта";
	
	Запрос.УстановитьПараметр("РуководительПроекта", РуководительПроекта);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивПроектов;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивПроектов.Добавить(Выборка.Проект);
	КонецЦикла;
	
	Возврат МассивПроектов;

КонецФункции


#КонецОбласти

#Область УниверсальныеОбработчики

&НаКлиенте
Процедура УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
		П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтотОбъект, П1, П2, П3, П4, П5, П5, П6);
	
КонецПроцедуры

&НаКлиенте
Процедура УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
		П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецПроцедуры

&НаСервере
Процедура УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
		П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтотОбъект, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецПроцедуры

#КонецОбласти

#Область УровниГруппировки

&НаКлиенте
Процедура ОбновитьСоответствиеУровнейДерева()
	
	врСоотвУровняДерева = Новый Соответствие;
	КоличествоУровней = 
		упоОперацииСДеревьямиКлиент.ПолучитьКоличествоУровнейДерева(ДеревоПроектныеЗадачи, , врСоотвУровняДерева);
	СоотвУровняДерева = Новый ФиксированноеСоответствие(врСоотвУровняДерева);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьСписокВыбораУровнейГруппировок(Форма, ЗаполнитьУровень = Истина)
	
	Элемент_УровеньГруппировок = Форма.Элементы.УровеньГруппировок;
	
	Элемент_УровеньГруппировок.Доступность = Не Форма.ВыводитьИерархиюЗадач;
	
	СписокВыбора = Элемент_УровеньГруппировок.СписокВыбора;
	СписокВыбора.Очистить();
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить(НСтр("ru = 'Проекты'"));
	МассивГруппировок.Добавить(НСтр("ru = 'Задачи'"));
	Если Форма.ВыводитьПодразделение Тогда
		МассивГруппировок.Добавить(НСтр("ru = 'Подразделения'"));
	КонецЕсли;
	Если Форма.ВыводитьВидыОпераций Тогда
		МассивГруппировок.Добавить(НСтр("ru = 'Вид операции'"));
	КонецЕсли;
	МассивГруппировок.Добавить(НСтр("ru = 'Ресурс'"));
	
	КоличествоУровней = Форма.СоотвУровняДерева.Количество();
	КоличествоГруппировок = МассивГруппировок.Количество();
	КоличествоДобавленныхЗадачИерархии = КоличествоУровней - КоличествоГруппировок;
	
	Сч = -1;
	ИндексСписка = 0;
	Для Каждого Группировка Из МассивГруппировок Цикл
		Сч = Сч + 1;
		Если Сч > 0 Тогда
			ИндексСписка = Сч + КоличествоДобавленныхЗадачИерархии;// Группировка "Проект" всегда первая.
		КонецЕсли;
		СписокВыбора.Добавить(ИндексСписка, Группировка);
	КонецЦикла;
	
	Если ЗаполнитьУровень Тогда
		УстановитьУровеньГруппировок(Форма, ИндексСписка)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьУровеньГруппировок(Форма, Уровень)
	
	 Форма.УровеньГруппировок = Уровень;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти