
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов объекта.
// Для группы формируется только структура реквизитов шапки,
// для элемента формируется структура реквизитов шапки или табличной части.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ЭтотОбъект.ЭтоГруппа Тогда // для группы
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки
			СтруктураОбязательныхПолей.Вставить("Наименование");
		КонецЕсли;
	Иначе // для элемента
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки
			СтруктураОбязательныхПолей.Вставить("Наименование");
		ИначеЕсли ИмяТабличнойЧасти = "ПараметрыРасчета" Тогда			
			СтруктураОбязательныхПолей.Вставить("ВидПлатежа");			
			СтруктураОбязательныхПолей.Вставить("ВидПривязки");			
			СтруктураОбязательныхПолей.Вставить("Доля");			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Тип: Булево. Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
	Для Каждого СтрокаПараметр Из ПараметрыРасчета Цикл
		
		упоПроектыИЗадачиОбщие.ПроверитьЗаполнениеСпособаПривязки(ЭтотОбъект,
			СтрокаПараметр, "ПараметрыРасчета", "Параметры расчета", Отказ);
			
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоКода модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации кода.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоКода()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ОбъектКопирования – СправочникОбъект, исходный элемент, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда
		Возврат;	
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
КонецПроцедуры //ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи элемента.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
	Для Каждого СтрокаПараметр Из ЭтотОбъект.ПараметрыРасчета Цикл
		Если СтрокаПараметр.ВидПривязки <> Перечисления.упоСпособПривязкиСхемОплаты.НаДату Тогда
			СтрокаПараметр.ДатаПривязки = Дата("00010101000000"); 
		КонецЕсли;		
	КонецЦикла;
	
	лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	Если НЕ ЭтотОбъект.ПараметрыРасчета.Итог("Доля") = 100 Тогда 
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Сумма долей схемы оплаты должна быть равна 100%.'"), ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли