//ИКТ_Камалов_17.06.25<<
// Получает значение настройки из регистра дополнительных настроек
//
// Параметры:
//  ИмяНастройки  - Строка - ключ настройки в регистре
//  ЗначениеПоУмолчанию  - Произвольный - возвращается, если настройка не содержит значения
//                 или не найдена (дефолтно Неопределено)
//  Обязательно  - Булево - Необходимо обязательно получить значение из регистра, игнорируя
//                 значение по умолчанию (дефолтно Ложь)
//
// Возвращаемое значение:
//   Произвольный   - значение настройки из регистра, значение по умолчанию или Неопределено
//
Функция ПолучитьЗначение(ИмяНастройки, ЗначениеПоУмолчанию = Неопределено, Обязательно = Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИКТ_ДополнительныеНастройкиСистемы.Значение КАК Значение
	                      |ИЗ
	                      |	РегистрСведений.ИКТ_ДополнительныеНастройкиСистемы КАК ИКТ_ДополнительныеНастройкиСистемы
	                      |ГДЕ
	                      |	ИКТ_ДополнительныеНастройкиСистемы.Настройка = &Настройка");
	Запрос.УстановитьПараметр("Настройка", Врег(ИмяНастройки));
	Результат = Запрос.Выполнить().Выгрузить();

	Если Результат.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено_(Результат[0].Значение) Тогда
		Возврат ?(Обязательно, Неопределено, ЗначениеПоУмолчанию);
	КонецЕсли; 
	
	Возврат Результат[0].Значение;
КонецФункции // ПолучитьЗначение()

Функция ЗначениеЗаполнено_(Значение)
	Если ОбщегоНазначения.ОписаниеТипаВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат НЕ Значение.Пустая();
	Иначе
		Попытка
			Возврат ЗначениеЗаполнено(Значение);
		Исключение
			Возврат Неопределено; // При текущем составе регистра сюда исполнение дойти не должно
		КонецПопытки;
	КонецЕсли;
КонецФункции
//>>ИКТ_Камалов_17.06.25

Функция ИКТ_НаименованиеКонтрагента(Контрагент, БезПроцентов = Ложь) Экспорт //Для проверки по черному/серому списку 
	
	Результат = Контрагент.Наименование;
	Результат = СокрЛП(Результат);
	Результат = СтрЗаменить(Результат, Символ(34), "");	// Одинарная кавычка
    Результат = СтрЗаменить(Результат, """", "");
	Результат = СтрЗаменить(Результат, "«", "");  
	Результат = СтрЗаменить(Результат, "»", "");
	Результат = СтрЗаменить(Результат, "(", "");
	Результат = СтрЗаменить(Результат, ")", "");
	Результат = СтрЗаменить(Результат, "ЗАО", "");
	Результат = СтрЗаменить(Результат, "ПАО", "");
	Результат = СтрЗаменить(Результат, "АО", "");
	Результат = СтрЗаменить(Результат, "ООО", "");
	Результат = СтрЗаменить(Результат, "ИП", "");
	Результат = СтрЗаменить(Результат, "ЗАО", ""); 	
	
	Результат = СокрЛП(Результат);
	Если БезПроцентов Тогда
		Возврат Результат;
	КонецЕсли;
	Результат = "%" + Результат + "%";  
	
	Возврат Результат;
	
КонецФункции
