
#Область ПрограммныйИнтерфейс
// Выполняет действия при подборе.
//
// Параметры:
//  НоваяСтрока		 - Произвольный - не используется.
//  ПараметрыПодбора - Произвольный - не используется.
&НаКлиенте
Процедура ВыполнитьДействияПриПодборе(НоваяСтрока, ПараметрыПодбора) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНаименованияПроектныхЗадачВТаблицах();	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	//упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача", "");
	
	НастроитьВидимостьЭлементов();
	УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	НайтиДокументыПоПервичномуДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	упоАналитикаПоПодразделениямКлиент.УстановитьДоступностьДоговораИсполнителя(Объект.РаспределениеДоходов);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора);
	
	УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПрограммно(РежимЗаписи,Закрыть)
	
	Отказ = Ложь;
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписи);
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
	КлючиТаблиц = "ТаблицаВладелец,ТаблицаПодчиненная,ИмяКолонкиВладелец,ИмяКолонкиПодчиненная,ЕстьКоличество,ПредставлениеТаблицыРаспределения";
	ПараметрыТаблиц = Новый Массив;
	ПараметрыТаблиц.Добавить(Новый Структура(КлючиТаблиц, "Доходы", "РаспределениеДоходов", "Сумма", "Сумма", Истина, "'Доходы'"));
	ПараметрыТаблиц.Добавить(Новый Структура(КлючиТаблиц, "Расходы", "РаспределениеРасходов", "Сумма", "Сумма", Истина, "'Расходы'"));
		
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РежимЗаписи", РежимЗаписи);
	ДопПараметры.Вставить("Закрыть", Закрыть);

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьПрограммноЗавершение", ЭтотОбъект, ДопПараметры);
	
	упоАналитикаПоПодразделениямКлиент.ПроверитьРаспределениеПередЗаписью(Объект, ПараметрыТаблиц, Отказ, ОписаниеОповещения);
	
	Если Не Отказ Тогда
		ЗаписатьПрограммноЗавершение(Истина,ДопПараметры);	
	КонецЕсли;
	
КонецПроцедуры

// Завершение обработчика события завершения "Записать программно".
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
&НаКлиенте
Процедура ЗаписатьПрограммноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи",ДополнительныеПараметры.РежимЗаписи);
		
		Записать(ПараметрыЗаписи);
		Если ДополнительныеПараметры.Закрыть Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьНаименованияПроектныхЗадачВТаблицах();

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "СменаНастроекУчетаПодразделений" Тогда
		УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаРегистраторОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыПерехода = Новый Структура;
	ПараметрыПерехода.Вставить("СсылкаНаРегистратор", 	  		 Объект.СсылкаНаРегистратор);
	ПараметрыПерехода.Вставить("ПолеНаФормеСсылкаНаРегистратор", "Объект.СсылкаНаРегистратор");
	ПараметрыПерехода.Вставить("ИсточникДанных", 		  		 Объект.ИсточникДанных);
	ПараметрыПерехода.Вставить("ПолеНаФормеИсточникДанных", 	 "Объект.ИсточникДанных");
	упоИнтеграцияКлиент.ПерейтиПоСсылкеНаРегистратор(ПараметрыПерехода);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНесколькоДокументовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Элементы.ГруппаСтраницы.ТекущаяСтраница = ЭтаФорма.Элементы.СтраницаПервичныйДокумент;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоходы

&НаКлиенте
Процедура ДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект, "Доходы",
		"РаспределениеДоходов", Копирование, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Доходы",
		"РаспределениеДоходов", , Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "Доходы", "РаспределениеДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля = "Контрагент";
		Иначе 
			имяПоля = "Статья";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Доходы");		
		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля, Объект.Доходы, ЭтаФорма,
			Истина, ПараметрыПодбораСтруктура, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.Контрагенты") Тогда
			имяПоля = "Контрагент";
		Иначе 
			имяПоля = "Статья";
		КонецЕсли;
		
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Доходы");		
		упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
			Объект.Доходы, ЭтаФорма, Истина, ПараметрыПодбораСтруктура, Истина);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.Доходы.ТекущиеДанные;
	Если ТекСтрока <> Неопределено И НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Доходы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "Доходы"); 
	ДоходыДоговорПриИзменении(Элемент);  

КонецПроцедуры

&НаКлиенте
Процедура ДоходыДоговорПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма, "Доходы"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Доходы.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекущиеДанные.ЕдиницаИзмерения = упоЗаполнениеИПодборКлиент.ПолучитьЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуСтрокиТаблицы("Доходы");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Доходы.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадача) Тогда
		ТекДанные.НазваниеПроектнойЗадачи = "";
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадачи = ПолучитьОсновныеПараметрыЗадачи(ТекДанные.ПроектнаяЗадача);	
	ТекДанные.НазваниеПроектнойЗадачи = ПараметрыЗадачи.НазваниеЗадачи;	
	ТекДанные.Проект = ПараметрыЗадачи.Проект;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура РасходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределяемыеПередНачалоДобавления(ЭтаФорма, Объект, "Расходы",
		"РаспределениеРасходов", Копирование, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриАктивизацииСтроки(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Расходы",
		"РаспределениеРасходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПередУдалением(Элемент, Отказ)
	
	упоАналитикаПоПодразделениямКлиент.СтрокаРаспределяемаяПередУдалением(ЭтаФорма, Объект, "Расходы", "РаспределениеРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") 
		И ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(ВыбранноеЗначение[0].Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
		имяПоля = "Контрагент";
	Иначе 
		имяПоля = "Статья";
	КонецЕсли;
	
	ПараметрыПодбораСтруктура = Неопределено;
	ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Расходы");		
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, имяПоля, Объект.Расходы, ЭтаФорма,
		Истина, ПараметрыПодбораСтруктура, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура РасходыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) = Тип("СправочникСсылка.Контрагенты") Тогда
		имяПоля = "Контрагент";
	Иначе 
		имяПоля = "Статья";
	КонецЕсли;
	
	ПараметрыПодбораСтруктура = Неопределено;
	ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Расходы");		
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, имяПоля,
		Объект.Расходы, ЭтаФорма, Истина, ПараметрыПодбораСтруктура, Истина);	
		        	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекСтрока = Элементы.Расходы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ПараметрыПодбораСтруктура = Неопределено;
		ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, "Расходы");		
		ЗаполнитьЗначенияСвойств(ПараметрыПодбораСтруктура.СтруктураСтроки, ТекСтрока);		
		упоПодборВТабличнуюЧастьКлиент.ВыполнитьДействияПриПодборе(ПараметрыПодбораСтруктура.СтруктураСтроки, 
			ПараметрыПодбораСтруктура.ПараметрыПодбораСписок, ПараметрыПодбораСтруктура.СвойстваОбъекта);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ПараметрыПодбораСтруктура.СтруктураСтроки);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКонтрагентПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "Расходы"); 
	РасходыДоговорПриИзменении(Элемент);  

КонецПроцедуры

&НаКлиенте
Процедура РасходыДоговорПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПриИзмененииДоговора(ЭтаФорма, "Расходы"); 
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = упоЗаполнениеИПодборКлиент.ПолучитьЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуСтрокиТаблицы("Расходы");
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыПроектнаяЗадачаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Расходы.ТекущиеДанные;	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПроектнаяЗадача) Тогда
		ТекДанные.НазваниеПроектнойЗадачи = "";
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадачи = ПолучитьОсновныеПараметрыЗадачи(ТекДанные.ПроектнаяЗадача);	
	ТекДанные.НазваниеПроектнойЗадачи = ПараметрыЗадачи.НазваниеЗадачи;	
	ТекДанные.Проект = ПараметрыЗадачи.Проект;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеДоходов

&НаКлиенте
Процедура РаспределениеДоходовСобствСилы_СубподрядПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеДоходов", 
																						ИспользоватьАналитикуКонтрагентДляСС);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеДоходов.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовКонтрагентПодрядчикПриИзменении(Элемент)
	
	упоРаботаСФормамиКлиент.ПроверитьДоговор(ЭтаФорма, "РаспределениеДоходов", "КонтрагентПодрядчик", "ЗаказДоговорПодрядчика"); 

КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.Доходы, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.Доходы, 
		Элементы.РаспределениеДоходов, Объект, НоваяСтрока, Копирование);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Доходы", "РаспределениеДоходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеДоходовКоличествоПриИзменении(Элемент)
		
	ПриИзмененииКоличестваВРаспределении("Доходы", "РаспределениеДоходов");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеРасходов

&НаКлиенте
Процедура РаспределениеРасходовСобствСилы_СубподрядПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, 
																						"РаспределениеРасходов", 
																						ИспользоватьАналитикуКонтрагентДляСС);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовРольПриИзменении(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияРольПриИзменении(Элементы.РаспределениеРасходов.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПередНачаломДобавления(Элементы.Расходы, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияПриНачалеРедактирования(Элементы.Расходы, 
		Элементы.РаспределениеРасходов, Объект, НоваяСтрока, Копирование);	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Расходы", "РаспределениеРасходов", , Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Расходы", "РаспределениеРасходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовПослеУдаления(Элемент)
	
	упоАналитикаПоПодразделениямКлиент.ПересчитатьОстатокКРаспределению(ЭтаФорма, "Расходы", "РаспределениеРасходов", , Истина);
	упоАналитикаПоПодразделениямКлиент.СтрокиРаспределенияВладелецПриАктивизацииСтроки(ЭтаФорма, "Расходы", "РаспределениеРасходов", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовКоличествоПриИзменении(Элемент)
		
	ПриИзмененииКоличестваВРаспределении("Расходы", "РаспределениеРасходов");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте	
Процедура КопироватьСтрокуВладельцаВРаспределение(Команда)
	
	Если Команда.Имя = "ЗаполнитьПоВладельцуДоходы" Тогда
		
		ТекущаяСтрокаВладельца = Элементы.Доходы.ТекущиеДанные;
		ТаблицаВладелец = "Доходы";
		ТаблицаПодчиненная = "РаспределениеДоходов";
		имяКолонкиСумма = "Сумма";
		КопироватьКоличество = Истина;
		
	ИначеЕсли Команда.Имя = "ЗаполнитьПоВладельцуРасходы" Тогда
		
		ТекущаяСтрокаВладельца = Элементы.Расходы.ТекущиеДанные;
		ТаблицаВладелец = "Расходы";
		ТаблицаПодчиненная = "РаспределениеРасходов";
		имяКолонкиСумма = "Сумма";
		КопироватьКоличество = Истина;
	
	КонецЕсли;	
	
	Если ТекущаяСтрокаВладельца <> Неопределено Тогда
		упоРаботаСФормамиКлиент.УдалитьРаспределенныеСтрокиВладельца(Объект, ТаблицаПодчиненная, ТекущаяСтрокаВладельца, Ложь);
		упоАналитикаПоПодразделениямКлиент.СкопироватьСтрокуВладельцаВРаспределение(ЭтаФорма, Объект, ТекущаяСтрокаВладельца,
			ТаблицаВладелец, ТаблицаПодчиненная, имяКолонкиСумма, КопироватьКоличество); 
	КонецЕсли;
	
	упоАналитикаПоПодразделениямКлиент.РаспределениеОбъемовСубподрядСобсСилыПриИзменении(Элементы, ТаблицаПодчиненная);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровестиИЗакрыть(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПровести(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Проведение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗаписать(Команда)
	
	ЗаписатьПрограммно(РежимЗаписиДокумента.Запись, Ложь);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НайтиДокументыПоПервичномуДокументу()
	
	Если Не Объект.СозданПриЗагрузкеДанных Тогда
		Возврат;	
	КонецЕсли;
	
	ДокументыПоПервичномуДокументу.Параметры.УстановитьЗначениеПараметра("ИсточникДанных", Объект.ИсточникДанных);
	ДокументыПоПервичномуДокументу.Параметры.УстановитьЗначениеПараметра("СсылкаНаРегистратор", Объект.СсылкаНаРегистратор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	упоСинхронизацияФактическихДоходовИРасходов.Представление КАК ПредставлениеДокумента
	               |ИЗ
	               |	Документ.упоСинхронизацияФактическихДоходовИРасходов КАК упоСинхронизацияФактическихДоходовИРасходов
	               |ГДЕ
	               |	НЕ упоСинхронизацияФактическихДоходовИРасходов.ПометкаУдаления
	               |	И упоСинхронизацияФактическихДоходовИРасходов.СозданПриЗагрузкеДанных
	               |	И упоСинхронизацияФактическихДоходовИРасходов.ИсточникДанных = &ИсточникДанных
	               |	И упоСинхронизацияФактическихДоходовИРасходов.СсылкаНаРегистратор = &СсылкаНаРегистратор
	               |	И НЕ упоСинхронизацияФактическихДоходовИРасходов.Ссылка = &ЭтотДокумент";
	Запрос.УстановитьПараметр("ЭтотДокумент", 		 Объект.Ссылка);
	Запрос.УстановитьПараметр("ИсточникДанных", 	 Объект.ИсточникДанных);
	Запрос.УстановитьПараметр("СсылкаНаРегистратор", Объект.СсылкаНаРегистратор);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ТекстНадписи = НСтр("ru = 'Внимание! Найдены документы, соответствующие одному первичному документу'");
		НадписьНесколькоДокументов = ТекстНадписи;
		
		Элементы.НадписьНесколькоДокументов.Видимость = Истина;
		Элементы.ДокументыПоПервичномуДокументу.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьНаименованияПроектныхЗадачВТаблицах()
		
	МассивТабЧастей = Новый Массив;
	МассивТабЧастей.Добавить(Объект.Доходы);
	МассивТабЧастей.Добавить(Объект.Расходы);
	упоРаботаСФормамиСервер.ЗаполнитьНаименованияПЗВТабличныхЧастях(МассивТабЧастей);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновныеПараметрыЗадачи(ПроектнаяЗадача)
	
	Результат = Новый Структура("Проект, НазваниеЗадачи");
	
	Если Не ЗначениеЗаполнено(ПроектнаяЗадача) Тогда		
		Возврат Результат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.Версия.Проект КАК Проект,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	
	ЕстьВидимость = Объект.СозданПриЗагрузкеДанных;
	
	Элементы.СтраницаПервичныйДокумент.Видимость = ЕстьВидимость;
	Элементы.НадписьНесколькоДокументов.Видимость = Ложь;
	Элементы.ДокументыПоПервичномуДокументу.Видимость = Ложь;
		
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементов_АналитикаПоПодразделениям()
	
	//СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Объект.Проект);
	//ИспользоватьАналитикуКонтрагентДляСС = СтруктураСвойств.ИспользоватьАналитикуКонтрагентДляСС;
	//
	//Элементы.РаспределениеДоходов.Видимость = СтруктураСвойств.ДоходыПоПодразделениям;
	//
	//Элементы.ДоходыНоменклатура.Видимость = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	//Элементы.ДоходыЕдиницаИзмерения.Видимость = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	//Элементы.ДоходыКоличество.Видимость = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	//
	//Элементы.РаспределениеРасходов.Видимость = СтруктураСвойств.РасходыПоПодразделениям;
	//
	//Элементы.РасходыНоменклатура.Видимость = СтруктураСвойств.РасходыПоНатуральнымПоказателям;
	//Элементы.РасходыЕдиницаИзмерения.Видимость = СтруктураСвойств.РасходыПоНатуральнымПоказателям;
	//Элементы.РасходыКоличество.Видимость = СтруктураСвойств.РасходыПоНатуральнымПоказателям;
	//
	//Элементы.РаспределениеРасходовКоличество.Видимость = СтруктураСвойств.РасходыПоНатуральнымПоказателям;
	//Элементы.РаспределениеДоходовКоличество.Видимость = СтруктураСвойств.ДоходыПоНатуральнымПоказателям;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		Объект.Проект = ВыбранноеЗначение.Проект;
		Объект.ПроектнаяЗадача = ВыбранноеЗначение;
		упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "ПроектнаяЗадача", "");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// Подготавливает доп. параметры структуры подбора.
//
// Параметры:
//  ПараметрыПодбораСтруктура	 - 	 - 
//  ИмяТЧ						 - 	 - 
//
&НаКлиенте
Процедура ПодготовитьДопПараметрыСтруктурыПодбора(ПараметрыПодбораСтруктура, ИмяТЧ) Экспорт
	
	ПараметрыПодбораСтруктура = Новый Структура;
	
	ПараметрыПодбораСписок = Новый СписокЗначений();
	ПараметрыПодбораСписок.Добавить(ИмяТЧ, "ИмяТабличнойЧасти");
	
	СтруктураДанных = ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ); 
	
	ПараметрыПодбораСтруктура = Новый Структура;
	ПараметрыПодбораСтруктура.Вставить("ПараметрыПодбораСписок", ПараметрыПодбораСписок);
	ПараметрыПодбораСтруктура.Вставить("СтруктураСтроки", СтруктураДанных.СтруктураСтрокиТЧ);
	ПараметрыПодбораСтруктура.Вставить("СвойстваОбъекта", СтруктураДанных.СтруктураОбъекта);	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДопПараметрыСтруктурыПодбораСервер(ИмяТЧ)
	
	ДопПараметры = Новый Структура;	
	ДопПараметры.Вставить("СтруктураСтрокиТЧ", Новый Структура);
	ДопПараметры.Вставить("СтруктураОбъекта", Новый Структура);
	
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураСтрокиТЧ, ИмяТЧ);
	ПодготовитьКопиюДанныхОбъекта(ДопПараметры.СтруктураОбъекта);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ПодготовитьКопиюДанныхОбъекта(СтруктураПустая, ИмяТЧ = Неопределено)
	
	// Перенести код в модуль с повторным использованием значений.
	
	СтруктураПустая = Новый Структура;
	
	Если ИмяТЧ = Неопределено Тогда		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов.Реквизиты Цикл			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураПустая, Объект);		
	Иначе		
		Для Каждого РеквизитМетаданных Из Метаданные.Документы.упоРегистрацияФактическихДоходовИРасходов.ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл			
			СтруктураПустая.Вставить(РеквизитМетаданных.Имя);		
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтоимостьСтрокиТаблицы(Строка)
	
	Если Строка.Количество <> 0 Тогда		
		Строка.РассчитываемаяСтоимость = Строка.Сумма / Строка.Количество;
	Иначе
		Строка.РассчитываемаяСтоимость = 0;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтрокиТаблицы(ИмяТаблицы)
	
	ТекДанные = Элементы[ИмяТаблицы].ТекущиеДанные;	
	Если ТекДанные.РассчитываемаяСтоимость = 0 Или ТекДанные.Количество = 0 Тогда
		РассчитатьСтоимостьСтрокиТаблицы(ТекДанные);
		Возврат;
	КонецЕсли;	
	ТекДанные.Сумма = ТекДанные.РассчитываемаяСтоимость * ТекДанные.Количество;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличестваВРаспределении(ИмяТаблицы, ИмяТаблицыРаспределения)
	
	ТекущаяСтрока = Элементы[ИмяТаблицы].ТекущиеДанные;	
	Если ТекущаяСтрока = Неопределено Или ТекущаяСтрока.Количество = 0 
		Или ТекущаяСтрока.РассчитываемаяСтоимость = 0 И ТекущаяСтрока.Сумма <> 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущаяСтрокаРаспределения = Элементы[ИмяТаблицыРаспределения].ТекущиеДанные;		
		
	ТекущаяСтрокаРаспределения.Сумма = ТекущаяСтрока.РассчитываемаяСтоимость * ТекущаяСтрокаРаспределения.Количество;
		
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти