
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоКода модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации кода.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийСервер.ОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоКода()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ОбъектКопирования – СправочникОбъект, исходный элемент, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийСервер.ОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ДанныеЗаполнения    - Произвольный, значение, которое используется как основание для заполнения.
//  ТекстЗаполнения    - Строка, текст заполнения.
//  СтандартнаяОбработка    - Булево, флаг стандартной обработки.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийСервер.ОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи элемента.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ)	
	упоОбработчикиСобытийСервер.ОбъектПередЗаписью(ЭтотОбъект, Отказ);		
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли