
//ИКТ_Романов_9302 Добавил пересчёт процентов и новый реквизит в ТЧ_09.09.2025
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьЭлементыНаФорму();
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьЭлементыНаФорму()
		
	НовыйЭлемент = Элементы.Вставить("ИКТ_РасшифровкаПлатежа", Тип("ПолеФормы"), Элементы.ЭтапыГрафикаОплаты, Элементы.ЭтапыГрафикаОплатыСуммаПлатежа); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ЭтапыГрафикаОплаты.ИКТ_РасшифровкаПлатежа";
	
	СписокВыбора = НовыйЭлемент.СписокВыбора;
	СписокВыбора.Добавить("ПроизвольныйТекст","Произвольный текст");
	СписокВыбора.Добавить("ГарантийноеУдержание","Гарантийное удержание");
	СписокВыбора.Добавить("УдержаниеАванса","Удержание аванса");
	СписокВыбора.Добавить("УдержаниеАвансаЗаМатериалы","Удержание аванса за материалы");
	СписокВыбора.Добавить("УдержаниеАвансаЗаРаботы","Удержание аванса за работы");
	СписокВыбора.Добавить("ОплатаВыполненныхРабот","Оплата выполненных работ"); 
    
	НовыйЭлемент.УстановитьДействие("ОбработкаВыбора","ЭтапыГрафикаОплатыСуммаПлатежаОбработкаВыбора");
	
	//<<ИКТ_Новоселов_21.01.2026_Задача№13500 Добавил элемент Тип платежа в ТЧ ЭтапыОплаты
	НовыйЭлемент = Элементы.Вставить("ИКТ_ТипПлатежа", Тип("ПолеФормы"), Элементы.ЭтапыГрафикаОплаты, Элементы.ИКТ_РасшифровкаПлатежа); 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ЭтапыГрафикаОплаты.ИКТ_ТипПлатежа";
	НовыйЭлемент.Заголовок = "Тип платежа";
	//>>ИКТ_Новоселов_21.01.2026_Задача№13500
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыГрафикаОплатыСуммаПлатежаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)  
	
	ВыбранноеЗначение = ЭтапыГрафикаОплатыСуммаПлатежаОбработкаВыбораНаСервере(ВыбранноеЗначение,Объект.ДокументОснование,Объект.Договор);
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЭтапыГрафикаОплатыСуммаПлатежаОбработкаВыбораНаСервере(ВыбранноеЗначение,ДокументОснование,Договор)
	
	НовоеВыбранноеЗначение = "";
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"Договор"); 
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Договор = Договор;
	Иначе
		Возврат НовоеВыбранноеЗначение;	
	КонецЕсли;	
		
	Если ВыбранноеЗначение = "ПроизвольныйТекст" Тогда
		НовоеВыбранноеЗначение = "";
	ИначеЕсли ВыбранноеЗначение = "ГарантийноеУдержание" Тогда 
		НовоеВыбранноеЗначение = "Гарантийное удержание по договору " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"Наименование"); //<=ИКТ_Новоселов_05.02.2026_Задача№13500 Исправлено с "Гарантийный платеж ..."		
	ИначеЕсли ВыбранноеЗначение = "УдержаниеАвансаЗаМатериалы" Тогда
		НовоеВыбранноеЗначение = "Удержание авансового платежа за материалы по договору " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"Наименование"); //ИКТ_Пузырев, №12426, Исправил опечатку_17.10.2025
	ИначеЕсли ВыбранноеЗначение = "УдержаниеАвансаЗаРаботы" Тогда
		НовоеВыбранноеЗначение = "Удержание авансового платежа за работы по договору " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"Наименование");
	ИначеЕсли ВыбранноеЗначение = "ОплатаВыполненныхРабот" Тогда
		НовоеВыбранноеЗначение = "Оплата за выполнение строительно-монтажных работ по договору " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"Наименование");
	ИначеЕсли ВыбранноеЗначение = "УдержаниеАванса" Тогда
		НовоеВыбранноеЗначение = "Удержание авансового платежа по договору " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"Наименование");	
	КонецЕсли;
	
	Возврат НовоеВыбранноеЗначение; 
	
КонецФункции

&НаКлиенте
Процедура Расш1_ЭтапыГрафикаОплатыПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПересчитатьСуммуДокумента();  //<=[+] ИКТ №17954 (строка ДОБАВЛЕНА), Новоселов, 27.04.2026 
	ПересчитатьПроцентыЭтапаГрафика(); 

КонецПроцедуры 

&НаКлиенте
Процедура Расш1_ЭтапыГрафикаОплатыПослеУдаленияПосле(Элемент)
	
	ПересчитатьСуммуДокумента();  //<=[+] ИКТ №17954 (строка ДОБАВЛЕНА), Новоселов, 27.04.2026 
	ПересчитатьПроцентыЭтапаГрафика();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПроцентыЭтапаГрафика() 
	
	Если Объект.ЧастичнаяОплата Тогда
		
		Для Каждого Строка Из Объект.ЭтапыГрафикаОплаты Цикл
			
			Строка.ПроцентПлатежа = СколькоПроцентовЧислоОтЧисла(Строка.СуммаПлатежа,Объект.СуммаДокумента); 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СколькоПроцентовЧислоОтЧисла(Знач Число, Знач ОтЧисла, Знач ОкруглятьДо = 0) Экспорт

   Если ОтЧисла = 0 Тогда
       Возврат 0;
   КонецЕсли;

   Результат = (Число / ОтЧисла) * 100;

   Если ОкруглятьДо > 0 Тогда
       Результат = Окр(Результат, ОкруглятьДо);
   КонецЕсли;

   Возврат Результат;

КонецФункции
//ИКТ_Романов_09.09.2025

&НаСервере
&Вместо("УстановитьДоступностьЭлементовПоЧастичнойОплате")
Процедура Расш1_УстановитьДоступностьЭлементовПоЧастичнойОплате()
	
    //<<ИКТ_Новоселов_20.01.2026_Задача№13500 ЗАКОММЕНТИРОВАЛ: расшифровка платежа доступна при отключении частичой оплаты
    //МассивЭлементов = Новый Массив();

	//МассивЭлементов.Добавить("ЭтапыГрафикаОплаты");

	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "ТолькоПросмотр", Не Объект.ЧастичнаяОплата);
	//>>ИКТ_Новоселов_20.01.2026_Задача№13500
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаДокумента", "ТолькоПросмотр", Не Объект.ЧастичнаяОплата);
	
КонецПроцедуры

//<<ИКТ_Новоселов_11.02.2026_Задача№13500 Отключен контроль процентов оплаты
&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("РассчитатьИтоговыеПоказателиСчетаНаОплатуКлиенту")
Процедура Расш1_РассчитатьИтоговыеПоказателиСчетаНаОплатуКлиенту(Форма)

	ПроцентПлатежейОбщий = 0;
	ПредыдущееЗначениеДаты = Дата(1, 1, 1);
	Форма.НомерСтрокиПолнойОплаты = 0;
	Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
		ПроцентПлатежейОбщий = ПроцентПлатежейОбщий + ТекСтрока.ПроцентПлатежа;
		#Удаление
		ТекСтрока.ПроцентЗаполненНеВерно = (ПроцентПлатежейОбщий > 100);
		#КонецУдаления
		ТекСтрока.ДатаЗаполненаНеВерно = (ПредыдущееЗначениеДаты > ТекСтрока.ДатаПлатежа);
		ПредыдущееЗначениеДаты = ТекСтрока.ДатаПлатежа;
		Если ПроцентПлатежейОбщий = 100 Тогда
			Форма.НомерСтрокиПолнойОплаты = ТекСтрока.НомерСтроки;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
//>>ИКТ_Новоселов_20.01.2026_Задача№13500

//{[+] ИКТ №17954 (фрагмент ДОБАВЛЕН), Новоселов, 27.04.2026 Сумма документа рассчитывается по строкам с типом платежа Оплата
&НаСервере
Процедура ПересчитатьСуммуДокумента()
	
	ЕстьСтрокаОплата = Ложь;
	Объект.СуммаДокумента = 0;
	Для каждого Строка Из Объект.ЭтапыГрафикаОплаты Цикл
		Если Строка.ИКТ_ТипПлатежа = Перечисления.ИКТ_ТипПлатежа.Оплата Тогда
			Объект.СуммаДокумента = Объект.СуммаДокумента + Строка.СуммаПлатежа;
			ЕстьСтрокаОплата = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьСтрокаОплата Тогда
		Объект.СуммаДокумента = Объект.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюВместо(Отказ, ПараметрыЗаписи)
	
	// Типовой обработчик выполняется на клиенте, для измененной логики нужен серверный контекст, перенесено в ПередЗаписьюНаСервереПеред()
	
КонецПроцедуры

&НаСервере
Процедура Расш1_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СуммаЭтаповОплаты = Объект.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
		
		ЕстьСтрокаОплата = Ложь;
		СуммаЭтаповОплаты = 0;
		Для каждого Строка Из Объект.ЭтапыГрафикаОплаты Цикл
			Если Строка.ИКТ_ТипПлатежа = Перечисления.ИКТ_ТипПлатежа.Оплата Тогда
				СуммаЭтаповОплаты = СуммаЭтаповОплаты + Строка.СуммаПлатежа;
				ЕстьСтрокаОплата = Истина;
			КонецЕсли;
		КонецЦикла;

		Если Не ЕстьСтрокаОплата Тогда
			СуммаЭтаповОплаты = Объект.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
		КонецЕсли;

		Если Объект.СуммаДокумента = 0 Тогда
			Объект.СуммаДокумента = СуммаЭтаповОплаты;
			
		ИначеЕсли Объект.СуммаДокумента <> СуммаЭтаповОплаты Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Сумма этапов графика оплаты не совпадает с суммой документа.';
					 |en = 'Amount of payment milestones is not corresponding to the document amount.'"),
			ЭтаФорма,
			"СуммаДокумента",);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//[+]} ИКТ №17954