
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.упоИзменениеВладельцаРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияВладельцаРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияДиспетчера.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияРуководителяПодразделения.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоСмещениеВладельцаРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоИзменениеДолжностиСотрудника.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияСотрудника.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоОсвобождениеДиспетчера.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоСотрудники);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли      

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	ОтборНаложен = Ложь;
	МассивСотрудников	= Неопределено;
	
	Если Параметры.Отбор.Количество() Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора.ЗагрузитьЗначения(СотрудникиОбщегоПодбора(Параметры.СтрокаПоиска));

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СотрудникиОбщегоПодбора(СтрокаПоиска = "")
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСотрудники.Ссылка КАК Сотрудник
	               |ИЗ
	               |	Справочник.упоСотрудники КАК упоСотрудники
	               |ГДЕ
	               |	НЕ упоСотрудники.НеОтображать
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоСтроке
	               |				ТОГДА упоСотрудники.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	МассивСотрудников = ВыполнитьЗапросВыбораСотрудников(ТекстЗапроса, СтрокаПоиска);
	
	Возврат МассивСотрудников;
	
КонецФункции

Функция ВыполнитьЗапросВыбораСотрудников(ТекстЗапроса, СтрокаПоиска, ПараметрыЗапроса = Неопределено)
	
	МассивСотрудников = Новый Массив;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтборПоСтроке", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");

	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивСотрудников = Результат.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	КонецЕсли;
	
	Возврат МассивСотрудников;
	
КонецФункции

#КонецОбласти  

