
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка,,Ложь);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ПостроитьТаблицуФормыПоДаннымОбъекта(Истина);	
		ПостроитьДиаграмму(ЭтаФорма);
	КонецЕсли;	

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПодключитьОбработчикОжидания("СнятьВыделениеСтрок", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
			
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьЗаполнениеФормы(Отказ);
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
				
КонецПроцедуры
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ЗагрузитьТаблицуФормыВОбъект(ТекущийОбъект);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);		
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПостроитьТаблицуФормыПоДаннымОбъекта(Истина);	
	ПостроитьДиаграмму(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФормыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Неопределено ИЛИ ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если Поле.Имя = "ТаблицаФормыПроект" Тогда
		СтандартнаяОбработка = Ложь;
		Данные = ТаблицаФормы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ПоказатьЗначение(, Данные.Проект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЦелейПриИзменении(Элемент)
	
	Если СписокЦелей.Количество() > 1 Тогда
		СписокЦелей.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокЦелей.ВыгрузитьЗначения()));
	КонецЕсли;	
	
	СписокЦелейПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КолонкаПриИзменении(Элемент) 
	
	ТекДанные = Элементы.ТаблицаФормы.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		СтрокиКолонок = ТаблицаКолонок.НайтиСтроки(Новый Структура("ИмяКолонки", Элемент.Имя));
		Если СтрокиКолонок.Количество() > 0 Тогда
			Влияние = ТекДанные[Элемент.Имя];
			Вес = ОпределитьВесПоВлиянию(Влияние);
			ТекДанные[СтрокиКолонок[0].ИмяКолонкиВес] = Вес;
			ПосчитатьБаллВСтроке(ЭтаФорма, ТекДанные);
			ПостроитьДиаграмму(ЭтаФорма);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КолонкаВесПриИзменении(Элемент) 
	
	ТекДанные = Элементы.ТаблицаФормы.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		СтрокиКолонок = ТаблицаКолонок.НайтиСтроки(Новый Структура("ИмяКолонкиВес", Элемент.Имя));
		Если СтрокиКолонок.Количество() > 0 Тогда
			Вес = ТекДанные[Элемент.Имя];
			Влияние = ОпределитьВлияниеПоВесу(Вес);
			ТекДанные[СтрокиКолонок[0].ИмяКолонки] = Влияние;
			ПосчитатьБаллВСтроке(ЭтаФорма, ТекДанные);
			ПостроитьДиаграмму(ЭтаФорма);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьИнициативы(Команда)
	
	ЗаполнитьИнициативыСервер();
	
	ПодключитьОбработчикОжидания("СнятьВыделениеСтрок", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПриоритет(Команда)
	
	БаллыПроектов = БаллыПроектов();
	ЗаполнитьПриоритетПроектов(БаллыПроектов);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Приоритеты проектов заполнены.'"));
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Функция ПостроитьТаблицуФормыПоДаннымОбъекта(ПересчитатьИтоговыйБалл = Истина) 
	
	СоответствиеЦелейКолонкам = Новый Соответствие;
	
	ТипВлияние = Новый ОписаниеТипов("ПеречислениеСсылка.упоВлияниеЦелей");
	ТипВес = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0));
	
	МассивРеквизитов = Новый Массив;
	Для Каждого СтрокаКолонки Из ТаблицаКолонок Цикл
		МассивРеквизитов.Добавить("ТаблицаФормы." + СтрокаКолонки.ИмяКолонки);	
		МассивРеквизитов.Добавить("ТаблицаФормы." + СтрокаКолонки.ИмяКолонкиВес);
		Элементы.Удалить(Элементы.Найти(СтрокаКолонки.ИмяКолонки));
		Элементы.Удалить(Элементы.Найти(СтрокаКолонки.ИмяКолонкиВес));
	КонецЦикла;
	
	ИзменитьРеквизиты(, МассивРеквизитов);
	
	ТаблицаКолонок.Очистить();
	ТаблицаФормы.Очистить();
	СписокЦелей.Очистить();
		
	МассивРеквизитов = Новый Массив;
	Сч = 1;
	Для Каждого СтрокаЦели Из Объект.Цели Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаЦели.Цель) Тогда 
			Продолжить; 
		КонецЕсли;
		
		СписокЦелей.Добавить(СтрокаЦели.Цель);
		
		Имя = "КолонкаЦели" + Формат(Сч, "ЧН=; ЧГ=");
		ИмяВес = "КолонкаЦелиВес" + Формат(Сч, "ЧН=; ЧГ=");
					
		Реквизит = Новый РеквизитФормы(Имя, ТипВлияние, "ТаблицаФормы", Строка(СтрокаЦели.Цель), Истина);
		МассивРеквизитов.Добавить(Реквизит);		
		Реквизит = Новый РеквизитФормы(ИмяВес, ТипВес, "ТаблицаФормы", "Вес", Истина);
		МассивРеквизитов.Добавить(Реквизит);	
		
		СтрокаКолонки = ТаблицаКолонок.Добавить();
		СтрокаКолонки.Цель = СтрокаЦели.Цель;
		СтрокаКолонки.ИмяКолонки = Имя;
		СтрокаКолонки.ИмяКолонкиВес = ИмяВес;
		
		СоответствиеЦелейКолонкам.Вставить(СтрокаЦели.Цель, Новый Структура("ИмяКолонки, ИмяКолонкиВес", Имя, ИмяВес));
						
		Сч = Сч +1;
	КонецЦикла;	
	
	ИзменитьРеквизиты(МассивРеквизитов);
		
	УстановитьУсловноеОформлениеТаблицыФормы();	
		
	Для Каждого Строка Из Объект.БаллыПроектов Цикл
		
		СтрокаТаблицы = ТаблицаФормы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка);
		
		ЦветПроекта = СтрокаТаблицы.Проект.ЦветПроекта;
		Если ЗначениеЗаполнено(ЦветПроекта) Тогда
			КСЗ = упоФункцииОбщегоНазначенияСервер.ОписаниеЦвета(ЦветПроекта, 2);		
			СтрокаТаблицы.Цвет = Новый Цвет(КСЗ.Красный, КСЗ.Зеленый, КСЗ.Синий); 
		КонецЕсли;
				
		Для Каждого СтрокаКолонки Из ТаблицаКолонок Цикл
			СтрокаТаблицы[СтрокаКолонки.ИмяКолонки]	= Перечисления.упоВлияниеЦелей.нет;												
		КонецЦикла;	
				
		СтрокиРасчета = Объект.Расчет.НайтиСтроки(Новый Структура("Проект", СтрокаТаблицы.Проект));
		Для Каждого СтрокаРасчета Из СтрокиРасчета Цикл
			СтруктураИменКолонок = СоответствиеЦелейКолонкам.Получить(СтрокаРасчета.Цель);
			
			Если СтруктураИменКолонок <> Неопределено Тогда			
				СтрокаТаблицы[СтруктураИменКолонок.ИмяКолонки] = СтрокаРасчета.Влияние;
				СтрокаТаблицы[СтруктураИменКолонок.ИмяКолонкиВес] = СтрокаРасчета.Вес;			
			КонецЕсли;			
		КонецЦикла;
		
		Если ПересчитатьИтоговыйБалл Тогда
			ПосчитатьБаллВСтроке(ЭтаФорма, СтрокаТаблицы);
		КонецЕсли;	
		
	КонецЦикла;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВесВлияния(Влияние)
	
	Если Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.критичное") Тогда
		Делитель = 2;
	ИначеЕсли Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.сильное") Тогда		
		Делитель = 3;
	ИначеЕсли Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.среднее") Тогда		
		Делитель = 4;
	ИначеЕсли Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.незначительное") Тогда
		Делитель = 5;
	Иначе
		Делитель = 0;	
	КонецЕсли;
	
	Если Делитель = 0 Тогда
		Возврат 0;
	Иначе
		Возврат 100 / (Делитель*Делитель);
	КонецЕсли;	
		
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьВлияниеПоВесу(Вес) 
	
	Если Вес > 0 И Вес <= 10 Тогда
		Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.незначительное")
	ИначеЕсли Вес > 10 И Вес <= 25 Тогда
		Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.среднее")
	ИначеЕсли Вес > 25 И Вес <= 50 Тогда
		Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.сильное")
	ИначеЕсли Вес > 50 Тогда 			
		Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.критичное")
	Иначе
		Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.нет")
	КонецЕсли;

	Возврат Влияние;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьВесПоВлиянию(Влияние) 
	
	Если Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.критичное") Тогда
		Вес = 100;
	ИначеЕсли Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.незначительное") Тогда
		Вес = 10;
	ИначеЕсли Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.сильное") Тогда
		Вес = 50;
	ИначеЕсли Влияние = ПредопределенноеЗначение("Перечисление.упоВлияниеЦелей.среднее") Тогда
		Вес = 25;
	Иначе                                                                                     	
		Вес = 0;	
	КонецЕсли;
	
	Возврат Вес;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПостроитьДиаграмму(ЭтаФорма) 
	
	Диаграмма = ЭтаФорма.Диаграмма;
	Диаграмма.Очистить();	
	
	Диаграмма.ОписаниеПалитрыЦветов.ПалитраЦветов = ПалитраЦветовДиаграммы.Мягкая; 	
	Диаграмма.ПорядокСерийВЛегенде = ПорядокСерийВЛегендеДиаграммы.Обратный;
	
	СоответствиеТочек = Новый Соответствие;
	
	Для Каждого ЭлементСписка Из ЭтаФорма.СписокЦелей Цикл
		
		Точка = Диаграмма.Точки.Добавить();
		Точка.Значение = ЭлементСписка.Значение;
		Точка.Текст = ЭлементСписка.Значение;
		СоответствиеТочек.Вставить(ЭлементСписка.Значение, Точка);
		
	КонецЦикла;
	
	сч = ЭтаФорма.ТаблицаФормы.Количество() - 1;
	Пока сч >= 0 Цикл
		
		СтрокаПроекта = ЭтаФорма.ТаблицаФормы[сч];
		сч = сч - 1;	
		
		Серия = Диаграмма.Серии.Добавить(СтрокаПроекта.Проект);
		Если СтрокаПроекта.Цвет.Зеленый = 0 И СтрокаПроекта.Цвет.Синий = 0 И СтрокаПроекта.Цвет.Красный = 0 Тогда
		Иначе
			Серия.Цвет = СтрокаПроекта.Цвет;
		КонецЕсли;
		Серия.Текст = СтрокаПроекта.Проект;
		
		Для Каждого СтрокаКолонки Из ЭтаФорма.ТаблицаКолонок Цикл
			
			Точка = СоответствиеТочек.Получить(СтрокаКолонки.Цель);	
			Диаграмма.УстановитьЗначение(Точка, Серия, СтрокаПроекта[СтрокаКолонки.ИмяКолонкиВес]);
			
		КонецЦикла;

	КонецЦикла;			
	
КонецФункции

&НаСервере
Функция ЗагрузитьТаблицуФормыВОбъект(пОбъект)
	
	пОбъект.Расчет.Очистить();
	пОбъект.БаллыПроектов.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаФормы Цикл
		СтрокаПроект = пОбъект.БаллыПроектов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПроект, СтрокаТаблицы);
		Для Каждого СтрокаКолонки Из ТаблицаКолонок Цикл
			СтрокаОбъекта = пОбъект.Расчет.Добавить();
			СтрокаОбъекта.Цель = СтрокаКолонки.Цель;
			СтрокаОбъекта.Проект = СтрокаТаблицы.Проект;
			СтрокаОбъекта.Заявка = СтрокаТаблицы.Заявка;
			СтрокаОбъекта.Влияние = СтрокаТаблицы[СтрокаКолонки.ИмяКолонки];
			СтрокаОбъекта.Вес = СтрокаТаблицы[СтрокаКолонки.ИмяКолонкиВес];
		КонецЦикла;
	КонецЦикла;
	
	ОбновитьЦелиОбъекта();
		
КонецФункции

&НаСервере
Процедура ОбновитьЦелиОбъекта()
	
	Объект.Цели.Очистить();
	
	Для Каждого Элемент Из СписокЦелей Цикл
		НовСтр = Объект.Цели.Добавить();
		НовСтр.Цель = Элемент.Значение;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура СписокЦелейПриИзмененииСервер()
	
	ОбновитьЦелиОбъекта();	 
	
	ПостроитьТаблицуФормыПоДаннымОбъекта();		
	ПостроитьДиаграмму(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Функция ЗаполнитьИнициативыСервер() 
	
	ОбновитьПроектыОбъекта();		
	
	ПостроитьТаблицуФормыПоДаннымОбъекта();   
	ПостроитьДиаграмму(ЭтаФорма);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПосчитатьБаллВСтроке(ЭтаФорма, СтрокаТаблицы)
	
	СтрокаТаблицы.Балл = 0;
		
	Для Каждого СтрокаКолонок Из ЭтаФорма.ТаблицаКолонок Цикл				
		ВесВлияния = ВесВлияния(СтрокаТаблицы[СтрокаКолонок.ИмяКолонки]);				
		СтрокаТаблицы.Балл = СтрокаТаблицы.Балл + ВесВлияния;				
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПроектыОбъекта() 
	
	Запрос = Новый Запрос;
		
	ТекстЗапроса =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	упоСтатусыЗаявокНаПроектСрезПоследних.ЗаявкаНаПроект.Проект КАК Проект,
	                |	упоСтатусыЗаявокНаПроектСрезПоследних.ЗаявкаНаПроект КАК ЗаявкаНаПроект
	                |ИЗ
	                |	РегистрСведений.упоСтатусыЗаявокНаПроект.СрезПоследних(, ) КАК упоСтатусыЗаявокНаПроектСрезПоследних";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
								
	ПоляОтбора = Новый Массив;
	ПоляОтбора.Добавить("Подразделение");
	ПоляОтбора.Добавить("ПортфельПроектов");
	ПоляОтбора.Добавить("ПрограммаПроектов");
	
	ЕстьОтбор = Ложь;
	
	ШаблонУсловия = "Проекты.%1 = &%1";		
	МассивОтборов = Новый Массив;
	Для Каждого ПолеОтбора Из ПоляОтбора Цикл		
		Если ЗначениеЗаполнено(Объект[ПолеОтбора]) Тогда
			Запрос.УстановитьПараметр(ПолеОтбора, Объект[ПолеОтбора]);	
			МассивОтборов.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУсловия, ПолеОтбора));			
			ЕстьОтбор = Истина;
		КонецЕсли;
	КонецЦикла;

	Если ЕстьОтбор Тогда
		ТекстОтбора = "ЗаявкаНаПроект.Проект В (ВЫБРАТЬ
	              |	Проекты.Ссылка КАК Ссылка
	              |ИЗ
	              |	Справочник.Проекты КАК Проекты ГДЕ " + СтрСоединить(МассивОтборов, " И ") + ")";								
		
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[1].Выражение = 
			Новый ВыражениеСхемыЗапроса(ТекстОтбора);
	КонецЕсли;	
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Объект.БаллыПроектов.Очистить();		
	Иначе
		Объект.БаллыПроектов.Загрузить(Результат.Выгрузить());
	КонецЕсли;	
		
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицыФормы()
		
	МассивУОДляУдаления = Новый Массив;
	Для Каждого Элемент Из УсловноеОформление.Элементы Цикл
		Если Элемент.Представление = "#СЛУЖЕБНОЕ#" Тогда
			МассивУОДляУдаления.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из МассивУОДляУдаления Цикл
		УсловноеОформление.Элементы .Удалить(Элемент);	
	КонецЦикла;
	
	ЦветКрит = Новый Цвет(91, 155, 213);
	ЦветСил =  Новый Цвет(210, 222, 239);
	ЦветСред = Новый Цвет(234, 239, 247);
	ЦветСлаб = ЦветСил;
	ЦветНет = ЦветСред; 
	
	Для Каждого СтрокаКолонки Из ТаблицаКолонок Цикл
		
		Элемент = Элементы.Добавить(СтрокаКолонки.ИмяКолонки, Тип("ПолеФормы"), Элементы.ТаблицаФормыГруппаКолонок);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "ТаблицаФормы." + СтрокаКолонки.ИмяКолонки;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.Ширина = 14;
		Элемент.БыстрыйВыбор = Истина;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_КолонкаПриИзменении");
		
		Элемент = Элементы.Добавить(СтрокаКолонки.ИмяКолонкиВес, Тип("ПолеФормы"), Элементы.ТаблицаФормыГруппаКолонок);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "ТаблицаФормы." + СтрокаКолонки.ИмяКолонкиВес;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.Ширина = 4;
		Элемент.БыстрыйВыбор = Истина;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_КолонкаВесПриИзменении");
	
		ДобавитьУОПоПолю(СтрокаКолонки, Перечисления.упоВлияниеЦелей.критичное, ЦветКрит);
		ДобавитьУОПоПолю(СтрокаКолонки, Перечисления.упоВлияниеЦелей.сильное, ЦветСил);
		ДобавитьУОПоПолю(СтрокаКолонки, Перечисления.упоВлияниеЦелей.среднее, ЦветСред);
		ДобавитьУОПоПолю(СтрокаКолонки, Перечисления.упоВлияниеЦелей.незначительное, ЦветСлаб);
		ДобавитьУОПоПолю(СтрокаКолонки, Перечисления.упоВлияниеЦелей.нет, ЦветНет);
			
		НовоеУО = УсловноеОформление.Элементы.Добавить();	
		НовоеУО.Представление = "#СЛУЖЕБНОЕ#";
		НовоеУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		НовоеУО.Использование = Истина;
		Поле = НовоеУО.Поля.Элементы.Добавить();
		Поле.Использование = Истина;
		Поле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки);
		НовыйЭлементУООтбор = НовоеУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПоВесам");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементУООтбор.ПравоеЗначение = Истина;	
		
		НовоеУО = УсловноеОформление.Элементы.Добавить();	
		НовоеУО.Представление = "#СЛУЖЕБНОЕ#";
		НовоеУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		НовоеУО.Использование = Истина;
		Поле = НовоеУО.Поля.Элементы.Добавить();
		Поле.Использование = Истина;
		Поле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонкиВес);
		НовыйЭлементУООтбор = НовоеУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПоВесам");
		НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементУООтбор.ПравоеЗначение = Ложь;		
		
	КонецЦикла;	
	
КонецПроцедуры	
	
&НаСервере
Функция ДобавитьУОПоПолю(СтрокаКолонки, Влияние, Цвет) 
	
	НовоеУО = УсловноеОформление.Элементы.Добавить();	
	НовоеУО.Представление = "#СЛУЖЕБНОЕ#";
	НовоеУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);
	НовоеУО.Использование = Истина;
	Поле = НовоеУО.Поля.Элементы.Добавить();
	Поле.Использование = Истина;
	Поле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонки);
	Поле = НовоеУО.Поля.Элементы.Добавить();
	Поле.Использование = Истина;
	Поле.Поле = Новый ПолеКомпоновкиДанных(СтрокаКолонки.ИмяКолонкиВес);
	НовыйЭлементУООтбор = НовоеУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	НовыйЭлементУООтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаФормы."+СтрокаКолонки.ИмяКолонки);
	НовыйЭлементУООтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементУООтбор.ПравоеЗначение = Влияние;
	
КонецФункции

&НаКлиенте
Процедура СнятьВыделениеСтрок()
	
	Элементы.ТаблицаФормы.ТекущаяСтрока = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеФормы(Отказ)
	
	Для Каждого СтрокаТаблицы Из ТаблицаФормы Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Проект) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 не заполнен проект'"),
				СтрокаТаблицы.ПолучитьИдентификатор());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,);
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПриоритетПроектов(БаллыПроектов)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого КлючЗначение Из БаллыПроектов Цикл
		ПроектОбъект = КлючЗначение.Ключ.ПолучитьОбъект();
		Если ПроектОбъект.Приоритет <> КлючЗначение.Значение Тогда
			ПроектОбъект.Приоритет = КлючЗначение.Значение;
			ПроектОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция БаллыПроектов()
	
	БаллыПроектов = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаФормы Цикл
		БаллыПроектов.Вставить(СтрокаТаблицы.Проект, СтрокаТаблицы.Балл);
	КонецЦикла;
	
	Возврат БаллыПроектов;
	
КонецФункции

#КонецОбласти
