#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти 	- 	Строка - содержит имя табличной части объекта,
//                      	если параметр не указан, то структура формируется по шапке объекта.
//  СтруктураПараметров - 	Произвольный - структура параметров.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти,
	СтруктураПараметров = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	// Заполнение структуры обязательных полей шапки.
	СтруктураОбязательныхПолей.Вставить("Сотрудник");
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//	Объект - ДокументСсылка.упоСмещениеВладельцаРесурсов - Документ.
//  ИмяТабличнойЧасти - Строка - Имя табличной части.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект, ИмяТабличнойЧасти) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	Если ИмяТабличнойЧасти = "ТрудовыеРесурсы" Тогда
		Запрос.УстановитьПараметр("ВидРесурса", Перечисления.упоВидРесурса.Трудовой);
	ИначеЕсли ИмяТабличнойЧасти = "МатериальныеРесурсы" Тогда
		Запрос.УстановитьПараметр("ВидРесурса", Перечисления.упоВидРесурса.Материальный);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВладениеРесурсамиСрезПоследних.Ресурс
	               |ИЗ
	               |	РегистрСведений.упоВладениеРесурсами.СрезПоследних(
	               |			,
	               |			Сотрудник = &Сотрудник
	               |				И Ресурс.упоВидРесурса = &ВидРесурса) КАК ВладениеРесурсамиСрезПоследних
	               |ГДЕ
	               |	ВладениеРесурсамиСрезПоследних.ВладеетРесурсом = ИСТИНА
	               |АВТОУПОРЯДОЧИВАНИЕ";
		
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоСмещениеВладельцаРесурсов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли