
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	МенеджерРегистрация = Документы.упоРегистрацияСтоимостиРесурсов; 
	
	мКэшЗначений = Новый Структура;
	мКэшЗначений.Вставить("МассивВозможныхВидовРесурсов", МенеджерРегистрация.ПолучитьМассивВозможныхВидовРесурсов());
	мКэшЗначений.Вставить("СоответствиеВидовЕдиницНормирования", 
		МенеджерРегистрация.ПолучитьСоответствиеВидовЕдиницНормирования());
	мКэшЗначений.Вставить("ПредставленияВидовРесурсов", МенеджерРегистрация.ПолучитьПредставленияВидовРесурсов());
	
	Для Каждого КлючЗначение Из мКэшЗначений.ПредставленияВидовРесурсов Цикл
		Элементы.ТипРесурсов.СписокВыбора.Добавить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	ПрименитьОсобенностиВидаРесурса(ЭтаФорма);
	
	ТипРесурсовДоИзменения = Объект.ТипРесурсов;
	ВидРесурсаНоменклатура = Документы.упоРегистрацияСтоимостиРесурсов.ВидРесурсаНоменклатура();
	ВидРесурсаПроектнаяПродукция = Документы.упоРегистрацияСтоимостиРесурсов.ВидРесурсаПроектнаяПродукция();
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	     	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРесурсовОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()	
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ТипРесурсовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("МожноМенятьТип", Ложь);
	ДопПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	
	Если ТипРесурсовДоИзменения <> ВыбранноеЗначение
		И Не ПустаяСтрока(ВыбранноеЗначение)
		И Не (Объект.РегистрируемыеРесурсы.Количество() = 0) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ТипРегистрируемыхРесуровОбработкаВыбораЗавершение", ЭтотОбъект, ДопПараметры);
		
		ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Нет, НСтр("ru = 'Внимание'"));
		Возврат;
		
	ИначеЕсли Объект.РегистрируемыеРесурсы.Количество() = 0 Тогда
		
		ДопПараметры.МожноМенятьТип = Истина;
		
	КонецЕсли;
	
	ТипРегистрируемыхРесуровОбработкаВыбораЗавершение(Неопределено, ДопПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ТипРегистрируемыхРесуровОбработкаВыбораЗавершение(Ответ, ДопПараметры) Экспорт
	
	МожноМенятьТип = ДопПараметры.МожноМенятьТип;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		МожноМенятьТип = Истина;
	КонецЕсли;
	
	Если МожноМенятьТип Тогда
		
		Объект.ТипРесурсов = ДопПараметры.ВыбранноеЗначение;
		ТипРесурсовДоИзменения = ДопПараметры.ВыбранноеЗначение;
		
		Объект.РегистрируемыеРесурсы.Очистить();
		
		ПрименитьОсобенностиВидаРесурса(ЭтаФорма);
		
	Иначе // Вернемся к прежнему состоянию
						
		Объект.ТипРесурсов = ТипРесурсовДоИзменения;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьРесурсы(Команда)
	
	Если ПустаяСтрока(Объект.ТипРесурсов) Тогда
		Сообщение = НСтр("ru = 'Сначала необходимо выбрать тип ресурсов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли;
	
	ПараметрыПодбора = ПодготовитьДопПараметры();
	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры()
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	ПараметрыПодбора.ЭлементВладелец = Элементы.РегистрируемыеРесурсы;
	ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники." + СокрЛП(Объект.ТипРесурсов);
	ТаблицаФормы = Объект.РегистрируемыеРесурсы;
	ИмяКолонки = "Ресурс";
	
	СтруктураДоп = ДополнительныеПараметрыПодбора(ТаблицаФормы,  ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
	
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
		
КонецФункции

&НаКлиенте
Процедура РегистрируемыеРесурсыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыПодбораСтруктура = Неопределено;
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Ресурс",
		Объект.РегистрируемыеРесурсы, ЭтаФорма, Ложь, ПараметрыПодбораСтруктура);
	
	Если Объект.ТипРесурсов = ВидРесурсаНоменклатура Тогда
		
		КоллекцияНоменклатуры = Новый Массив;
		
		Для каждого Строка Из Объект.РегистрируемыеРесурсы Цикл
			КоллекцияНоменклатуры.Добавить(Строка.Ресурс);
		КонецЦикла;
		
		ЕдиницыИзмеренияНоменклатурСоответствие = ЕдиницыИзмеренияНоменклатур(КоллекцияНоменклатуры);
		
		Для каждого Строка Из Объект.РегистрируемыеРесурсы Цикл
			
			Строка.ЕдиницаНормирования = ЕдиницыИзмеренияНоменклатурСоответствие[Строка.Ресурс];
			
			упоРаботаСФормамиКлиент.ПроверитьНоменклатуруСтрокиНаЗаполнениеЕдИзмВТаблице(Объект, "РегистрируемыеРесурсы", Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Функция ДополнительныеПараметрыПодбора(ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
		
	СтруктураДоп = Новый Структура;
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");	
			
	СтруктураДоп.АдресХранилищаВыбранных  = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(
																			ЭтаФорма.УникальныйИдентификатор,
																			ТаблицаФормы, 
																			ИмяКолонки, 
																			СписокВидимыхКолонок);	
	СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора();
		
	Возврат СтруктураДоп;
			
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЗначениевТЧОбщая(ИмяКоманды)

	Если ИмяКоманды = "ЗаполнитьНормуСтоимости" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.упоНормыСтоимости"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов);
		ИмяТЧ = "РегистрируемыеРесурсы";
		ИмяКолонки = "НормаСтоимости";
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьЕдиницуНормирования" Тогда
			
		ОписаниеТиповП = Элементы.РегистрируемыеРесурсыЕдиницаНормирования.ОграничениеТипа;
		ИмяТЧ = "РегистрируемыеРесурсы";
		ИмяКолонки = "ЕдиницаНормирования";
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьСтоимость" Тогда
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Число"));	
		ОписаниеТиповП = Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15, 2));
		ИмяТЧ = "РегистрируемыеРесурсы";
		ИмяКолонки = "Стоимость";		
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
		
	ВведенноеЗначение = упоРаботаСФормамиКлиент.ЗаполнитьЗначениеВТЧ(Объект, ИмяТЧ, ИмяКолонки, ОписаниеТиповП);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНормуСтоимости(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕдиницуНормирования(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимость(Команда)
	
	ЗаполнитьЗначениевТЧОбщая(Команда.Имя);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора()
	
	Перем ТаблицаОтбора;
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	
	НоваяСтрока =  ТаблицаОтбора.Добавить();
	
	НоваяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	НоваяСтрока.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеРавно;
	НоваяСтрока.Применение =  ТипПримененияОтбораКомпоновкиДанных.Элементы;
	НоваяСтрока.Использование  = Истина;
	НоваяСтрока.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	НоваяСтрока.ПравоеЗначение = ПредопределенноеЗначение("Справочник.упоТрудовыеРесурсы.СводныйРесурс");			
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПрименитьОсобенностиВидаРесурса(ЭтаФорма) 
	
	МассивТипов = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Объект.ТипРесурсов) Тогда
		Для Каждого ВидРесурса Из ЭтаФорма.мКэшЗначений.МассивВозможныхВидовРесурсов Цикл
			МассивТипов.Добавить("СправочникСсылка." + ВидРесурса);
		КонецЦикла;
	Иначе
		МассивТипов.Добавить("СправочникСсылка." + ЭтаФорма.Объект.ТипРесурсов);
	КонецЕсли;	
	
	ОграничениеТипа = Новый ОписаниеТипов(СтрСоединить(МассивТипов, ", "));
	
	ЭтаФорма.Элементы.РегистрируемыеРесурсыРесурс.ОграничениеТипа = ОграничениеТипа;
	
	//
		
	ОграничениеТипаНормирования = Неопределено;
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.ТипРесурсов) Тогда
		ВидНормирования = ЭтаФорма.мКэшЗначений.СоответствиеВидовЕдиницНормирования.Получить(ЭтаФорма.Объект.ТипРесурсов);
		Если ЗначениеЗаполнено(ВидНормирования) Тогда
			ОграничениеТипаНормирования = Новый ОписаниеТипов("СправочникСсылка." + ВидНормирования);	
		КонецЕсли;
	КонецЕсли;	
	
	Если ОграничениеТипаНормирования = Неопределено Тогда
		МассивТипов = Новый Массив;
		Для Каждого КлючЗначение Из ЭтаФорма.мКэшЗначений.СоответствиеВидовЕдиницНормирования Цикл
			МассивТипов.Добавить("СправочникСсылка." + КлючЗначение.Значение);	
		КонецЦикла;
		МассивТипов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТипов);
		ОграничениеТипаНормирования = Новый ОписаниеТипов(СтрСоединить(МассивТипов, ", "));
	КонецЕсли;
	
	ЭтаФорма.Элементы.РегистрируемыеРесурсыЕдиницаНормирования.ОграничениеТипа = ОграничениеТипаНормирования;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаСервереБезКонтекста
Функция ЕдиницыИзмеренияНоменклатур(КоллекцияНоменклатуры)
    
    Если ТипЗнч(КоллекцияНоменклатуры) <> Тип("Массив") Тогда
        ЕдИзмНоменклатуры = упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры(КоллекцияНоменклатуры);
        
        Возврат ЕдИзмНоменклатуры; 
    КонецЕсли;
    
    ЕдиницыИзмеренияНоменклатурСоответствие = Новый Соответствие();
    
    Для каждого Номенклатура Из КоллекцияНоменклатуры Цикл
        
        ЕдИзмНоменклатуры = упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура);
        
        ЕдиницыИзмеренияНоменклатурСоответствие.Вставить(Номенклатура, ЕдИзмНоменклатуры);
        
    КонецЦикла;
    
	Возврат ЕдиницыИзмеренияНоменклатурСоответствие;       	
	
КонецФункции	

&НаСервереБезКонтекста
Функция ЕдиницаИзмеренияНоменклатуры(Номенклатура)

	Возврат упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура);       	
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытийТаблицыРегистрируемыеРесурсы

&НаКлиенте
Процедура РегистрируемыеРесурсыРесурсПриИзменении(Элемент)
	
	ТекДанные = Элементы.РегистрируемыеРесурсы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.ТипРесурсов = ВидРесурсаНоменклатура Или Объект.ТипРесурсов = ВидРесурсаПроектнаяПродукция Тогда
			ТекДанные.ЕдиницаНормирования = ЕдиницаИзмеренияНоменклатуры(ТекДанные.Ресурс);			
	КонецЕсли;
	
	упоРаботаСФормамиКлиент.ПроверитьОчиститьСводныйРесурс(ТекДанные.Ресурс);
	
	упоРаботаСФормамиКлиент.ПроверитьНоменклатуруСтрокиНаЗаполнениеЕдИзмВТаблице(Объект, "РегистрируемыеРесурсы", ТекДанные);
	
КонецПроцедуры

#КонецОбласти
