#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Преобразует формулу расчета
//
// Параметры:
//  Показатель		 - СправочникСсылка.упоПоказателиПроектов 	- показатель, рассчитываемый по формуле.
//  текСтрокаФормулы - Строка	- строка формулы, которуется требуется преобразовать.
//
// Возвращаемое значение:
//	строка - формула расчета показателя.
//
Функция ПолучитьФормулуРасчетаПоказателя(Показатель, текСтрокаФормулы = "") Экспорт
	
	Рез = текСтрокаФормулы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоПоказателиПроектовРасчетныеИндикаторы.Индикатор,
	               |	упоПоказателиПроектовРасчетныеИндикаторы.Представление,
	               |	упоПоказателиПроектовРасчетныеИндикаторы.Индикатор.Наименование КАК Имя
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов.РасчетныеИндикаторы КАК упоПоказателиПроектовРасчетныеИндикаторы
	               |ГДЕ
	               |	упоПоказателиПроектовРасчетныеИндикаторы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоПоказателиПроектов.строкаФормулы
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	               |ГДЕ
	               |	упоПоказателиПроектов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Показатель);
	РезЗапроса = Запрос.ВыполнитьПакет();
		
	Если ПустаяСтрока(Рез) Тогда
		Выборка = РезЗапроса[1].Выбрать();
		Если Выборка.Следующий() Тогда
			Рез = Выборка.строкаФормулы;	
		КонецЕсли;
	КонецЕсли;
	
	Выборка = РезЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез = СтрЗаменить(Рез,Выборка.Представление,"["+Выборка.Имя+"]");	
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоПоказателиПроектов);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СкрытьПроизвольныйПоказатель") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений();
		ПоказателиПодбора = ПоказателиПодбора(Параметры.СтрокаПоиска);
		ДанныеВыбора.ЗагрузитьЗначения(ПоказателиПодбора);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПоказателиПодбора(СтрокаПоиска = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоПоказателиПроектов.Ссылка КАК Показатель
	               |ИЗ
	               |	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	               |ГДЕ
	               |	НЕ упоПоказателиПроектов.ПометкаУдаления
	               |	И НЕ упоПоказателиПроектов.ЭтоГруппа
	               |	И НЕ упоПоказателиПроектов.ПринадлежностьПоказателя = ЗНАЧЕНИЕ(Перечисление.упоПринадлежностьПоказателя.Произвольный)
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоСтроке
	               |				ТОГДА упоПоказателиПроектов.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";	
		
	Запрос.УстановитьПараметр("ОтборПоСтроке", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	
	МассивПоказателей = Новый Массив;

	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивПоказателей = Результат.Выгрузить().ВыгрузитьКолонку("Показатель");
	КонецЕсли;
	
	Возврат МассивПоказателей;
	
КонецФункции

#КонецОбласти

#КонецЕсли