
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов объекта.
// Для группы формируется только структура реквизитов шапки,
// для элемента формируется структура реквизитов шапки или табличной части.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ЭтотОбъект.ЭтоГруппа Тогда // Для группы.
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки.
			СтруктураОбязательныхПолей.Вставить("Наименование");
		КонецЕсли;
	Иначе // Для элемента.
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки.
			СтруктураОбязательныхПолей.Вставить("Наименование");
			СтруктураОбязательныхПолей.Вставить("ТипИндикатора");
			СтруктураОбязательныхПолей.Вставить("ВидЗаполнения");
			Если ЭтотОбъект.ТипЗаполнения = 0 И ВидЗаполнения <> Перечисления.упоВидЗаполненияИндикатора.Вручную Тогда
				Если ЭтотОбъект.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.Общий Тогда
					СтруктураОбязательныхПолей.Вставить("ИмяПоляЗначения");
					СтруктураОбязательныхПолей.Вставить("ИмяПоляОбъекта");
					СтруктураОбязательныхПолей.Вставить("ИмяПоляЗначенияПЗ");
					СтруктураОбязательныхПолей.Вставить("ИмяПоляОбъектаПЗ");
				ИначеЕсли ЭтотОбъект.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроекта Тогда
					СтруктураОбязательныхПолей.Вставить("ИмяПоляЗначения");
					СтруктураОбязательныхПолей.Вставить("ИмяПоляОбъекта");
				ИначеЕсли ЭтотОбъект.ПринадлежностьПоказателя = Перечисления.упоПринадлежностьПоказателя.ТолькоДляПроектнойЗадачи Тогда
					СтруктураОбязательныхПолей.Вставить("ИмяПоляЗначенияПЗ");
					СтруктураОбязательныхПолей.Вставить("ИмяПоляОбъектаПЗ");
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяТабличнойЧасти = "_ПримерТабличнойЧасти" Тогда
			// Формирование структуры обязательных реквизитов табличной части _ПримерТабличнойЧасти.
			СтруктураОбязательныхПолей.Вставить("_ПримерРеквизита");
			СтруктураОбязательныхПолей.Вставить("_ПримерРеквизитаЧисло");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура выполняет действия при подборе в табличную часть.
//
// Параметры:
//  Строка			 - СтрокаТабличнойЧасти			 - строка, добавляемая в табличную часть при подборе
//  ПараметрыПодбора - СписокЗначений, Неопределено	 - не используется.
//
Процедура ВыполнитьДействияПриПодборе(Строка, ПараметрыПодбора = Неопределено) Экспорт 
	
	Отказ = Ложь;
	
	Если Строка.Индикатор = ЭтотОбъект.Ссылка Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Строка.Индикатор.ТипЗаполнения = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Строка.Индикатор.ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Автоматически Тогда
		// Должно быть совпадение по типам
		Если НЕ Строка.Индикатор.ТипИндикатора = ТипИндикатора Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщение = НСтр("ru = 'Нельзя использовать индикатор ""%1"" в формуле.'");
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, Строка.Индикатор);
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли;
	
	представлениеВФормуле = "[" + Строка.Индикатор + "]";
	
	// Проверим, нет ли этого представления уже в таблице
	//НайденныеСтроки = РасчетныеИндикаторы.НайтиСтроки(Новый Структура("Представление", представлениеВФормуле));
	//колво = НайденныеСтроки.Количество();
	//Если колво > 0 Тогда
	//	Строка.Представление = "[" + Строка.Индикатор + колво + "]";
	//Иначе
	//	Строка.Представление = представлениеВФормуле;
	//КонецЕсли;
	
	Строка.Представление = представлениеВФормуле;
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура();

КонецФункции // ПолучитьСтруктуруПечатныхФорм() 

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры
		
#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоКода модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации кода.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры // ПриУстановкеНовогоКода()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ОбъектКопирования – СправочникОбъект, исходный элемент, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
	ПредустановленныйКод = "";
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда 
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи элемента.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ)
	
	Если Предопределенный И НЕ (ДополнительныеСвойства.Свойство("РазрешитьЗаписьПредопределенных") 
										И ДополнительныеСвойства.РазрешитьЗаписьПредопределенных) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Запрещено изменение предопределенных'"));								
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную Тогда
		ТипЗаполнения = 0;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоГруппа И Не ЗначениеЗаполнено(ЭтотОбъект.Порядок) Тогда 
		МаксПорядок = ПолучитьМаксимальныйПорядокПоказателей();
		ЭтотОбъект.Порядок = МаксПорядок + 100;	
	КонецЕсли;

	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередЗаписью(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ВерсияПоказателя <> Ссылка.ВерсияПоказателя
		И Не ЭтотОбъект.ЭтоГруппа Тогда
		
		Если СтрДлина(СокрЛП(ОписаниеИзменений)) = 0 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Изменилась версия показателя. Необходимо заполнить описание изменений'");
			Сообщение.Поле = "Объект.ОписаниеИзменений";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от записи.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПриЗаписи(ЭтотОбъект, Отказ);
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  Отказ        - Булево, признак отказа от удаления объекта.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	упоОбработчикиСобытийВызовСервера.обСправочникОбъектПередУдалением(ЭтотОбъект, Отказ);
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора.Вручную
	 ИЛИ ((НЕ ВидЗаполнения = Перечисления.упоВидЗаполненияИндикатора) И (НЕ ТипЗаполнения = 0)) Тогда
		
		УдалитьЗначениеИзМассива("ИмяПоляОбъекта", ПроверяемыеРеквизиты);
		УдалитьЗначениеИзМассива("ИмяПоляЗначения", ПроверяемыеРеквизиты);
		УдалитьЗначениеИзМассива("ИмяПоляОбъектаПЗ", ПроверяемыеРеквизиты);
		УдалитьЗначениеИзМассива("ИмяПоляЗначенияПЗ", ПроверяемыеРеквизиты);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьЗначениеИзМассива(УдаляемоеЗначение, МассивЭлементов)
	
	ИндексЭлемента = МассивЭлементов.Найти(УдаляемоеЗначение);
	Если НЕ ИндексЭлемента = Неопределено Тогда
		МассивЭлементов.Удалить(ИндексЭлемента);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМаксимальныйПорядокПоказателей()
	
	Порядок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	упоПоказателиПроектов.Порядок
	|ИЗ
	|	Справочник.упоПоказателиПроектов КАК упоПоказателиПроектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	упоПоказателиПроектов.Порядок УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Порядок = Выборка.Порядок;
		
	КонецЕсли;
	
	Возврат Порядок;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли