
&Вместо("ИсточникОтчета")
Функция ИКТ_ИсточникОтчета(ИмяФормыСтр)
	
	МассивИмениФормы = СтрРазделить(ИмяФормыСтр, ".", Ложь);
	Если СтрНачинаетсяС(МассивИмениФормы[1], "ИКТ_РегламентированныйОтчет") Тогда
		Возврат МассивИмениФормы[1];
	КонецЕсли;
	
	Для Каждого ЭлементИмени Из МассивИмениФормы Цикл
		Если СтрНачинаетсяС(ЭлементИмени, "ИКТ_РегламентированныйОтчет") Тогда
			Возврат ЭлементИмени;
		КонецЕсли;
	КонецЦикла;
	Результат = ПродолжитьВызов(ИмяФормыСтр);
	Возврат Результат;
	
КонецФункции


