////////////////////////////////////////////////////////////////////////////////
// Распределение трудозатрат по профилям и перерасчеты трудозатрат.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПолучениеПлановыхТрудозатрат

// Получает из ИБ список рабочих заданий по текущему исполнителю и датам.
//
// Параметры:
//  ТрудовойРесурс	 - СправочникСсылка.упоТрудовыеРесурсы
//  НачалоПериода	 - Дата
//  КонецПериода	 - Дата
// 
// Возвращаемое значение:
//  ТаблицаЗначений - найденные рабочие задания.
//
Функция ПолучитьРабочиеЗадания(ТрудовойРесурс, НачалоПериода, КонецПериода) Экспорт 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТрудовойРесурс", 			ТрудовойРесурс);
	СтруктураПараметров.Вставить("НачалоПериода", 		НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода", 		КонецПериода);
	
	Запрос = ПолучитьЗапросРабочиеЗадания(СтруктураПараметров);
	
	Отказ = Ложь;
	ДополнитьЗапросПроектныеЗадачиИПоручения(Запрос, СтруктураПараметров, Отказ);

	Если Отказ Тогда
		Возврат Неопределено;
	Иначе
		РезультатЗапроса = Запрос.Выполнить();
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
КонецФункции

// Получает таблицу трудозатрат за неделю.
//
// Параметры:
//  ТаблицаРабочиеЗадания	 - ТаблицаЗначений	 - таблица, в которую будут записаны данные о трудозатратах.
//  СтруктураПараметров		 - Структура		 - Ключи:
//  		* ТрудовойРесурс - СправочникСсылка.упоТрудовыеРесурсы.
//  		* ДеньНачалаНедели - Дата.
//  		* ДеньКонецНедели - Дата.
//
Процедура ПолучитьТаблицуРабочихЗаданийЗаНеделюПоОперативнойЗагрузке(ТаблицаРабочиеЗадания, СтруктураПараметров) Экспорт

	Запрос = ПолучитьЗапросРабочиеЗадания(СтруктураПараметров);
	
	Запрос.Текст = Запрос.Текст + "
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////////////////////////
		|"
		
		+ "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		  |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача.Проект КАК Проект,
		  |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача КАК РабочееЗадание,
		  |	НАЧАЛОПЕРИОДА(упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя, ДЕНЬ) КАК День,
		  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя) КАК Трудозатраты,
		  |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Роль КАК Роль
		  |ПОМЕСТИТЬ втОперативнаяЗагрузка
		  |ИЗ
		  |	РегистрСведений.упоОперативнаяЗагрузкаСпециалистов.СрезПоследних(
		  |			,
		  |			ТрудовойРесурс = &Исполнитель
		  |				И ДатаВремя >= &ДатаНачала
		  |				И ДатаВремя <= &ДатаЗавершения) КАК упоОперативнаяЗагрузкаСпециалистовСрезПоследних
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		  |			ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
		  |				И (упоВерсииПроекта.Текущая)
		  |				И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		  |		ПО упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		  |ГДЕ
		  |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Занят
		  |	И НЕ упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача.Проект.ПометкаУдаления
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача,
		  |	НАЧАЛОПЕРИОДА(упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя, ДЕНЬ),
		  |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача.Проект,
		  |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Роль
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		  |	упоВерсииПроекта.Версия КАК Версия
		  |ПОМЕСТИТЬ втТекущаяВерсия
		  |ИЗ
		  |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		  |ГДЕ
		  |	упоВерсииПроекта.Текущая
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	Версия
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		  |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		  |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи
		  |ПОМЕСТИТЬ втСвойстваПроектныхЗадач
		  |ИЗ
		  |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		  |			,
		  |			ПроектнаяЗадача В
		  |					(ВЫБРАТЬ
		  |						втОперативнаяЗагрузка.РабочееЗадание
		  |					ИЗ
		  |						втОперативнаяЗагрузка КАК втОперативнаяЗагрузка
		  |			
		  |					ОБЪЕДИНИТЬ ВСЕ
		  |			
		  |					ВЫБРАТЬ
		  |						ВременнаяТаблица_РабочиеЗадания.РабочееЗадание
		  |					ИЗ
		  |						ВременнаяТаблица_РабочиеЗадания КАК ВременнаяТаблица_РабочиеЗадания)
		  |				И Версия В
		  |					(ВЫБРАТЬ
		  |						втТекущаяВерсия.Версия
		  |					ИЗ
		  |						втТекущаяВерсия КАК втТекущаяВерсия)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	ПроектнаяЗадача
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РабочееЗадание КАК ПроектнаяЗадача,
		  |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса КАК Роль,
		  |	МАКСИМУМ(упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение) КАК Подразделение
		  |ПОМЕСТИТЬ втПодразделения
		  |ИЗ
		  |	ВременнаяТаблица_РабочиеЗадания КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
		  |
		  |СГРУППИРОВАТЬ ПО
		  |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РабочееЗадание,
		  |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РабочееЗадание,
		  |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		  |	втОперативнаяЗагрузка.Проект КАК Проект,
		  |	втОперативнаяЗагрузка.РабочееЗадание КАК РабочееЗадание,
		  |	втОперативнаяЗагрузка.День КАК День,
		  |	втОперативнаяЗагрузка.Трудозатраты КАК Трудозатраты,
		  |	втОперативнаяЗагрузка.Роль КАК РольРесурса,
		  |	ИСТИНА КАК ЭтоПроектнаяЗадача,
		  |	3 КАК ТипЗадачи,
		  |	ЕСТЬNULL(втПодразделения.Подразделение, ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)) КАК Подразделение,
		  |	"""" КАК Наименование,
		  |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаПлан,
		  |	ЕСТЬNULL(упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершенияПлан
		  |ПОМЕСТИТЬ втРабочиеЗаданияВсеДанные
		  |ИЗ
		  |	втОперативнаяЗагрузка КАК втОперативнаяЗагрузка
		  |		ЛЕВОЕ СОЕДИНЕНИЕ втПодразделения КАК втПодразделения
		  |		ПО втОперативнаяЗагрузка.РабочееЗадание = втПодразделения.ПроектнаяЗадача
		  |			И втОперативнаяЗагрузка.Роль = втПодразделения.Роль
		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
		  |				,
		  |				Версия В
		  |					(ВЫБРАТЬ
		  |						втТекущаяВерсия.Версия
		  |					ИЗ
		  |						втТекущаяВерсия КАК втТекущаяВерсия)) КАК упоСрокиПроектныхЗадачСрезПоследних
		  |		ПО втОперативнаяЗагрузка.РабочееЗадание = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		  |			И втОперативнаяЗагрузка.День >= упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан
		  |			И втОперативнаяЗагрузка.День <= упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан
		  |
		  |ОБЪЕДИНИТЬ ВСЕ
		  |
		  |ВЫБРАТЬ
		  |	ВременнаяТаблица_РабочиеЗадания.Проект,
		  |	ВременнаяТаблица_РабочиеЗадания.РабочееЗадание,
		  |	ДАТАВРЕМЯ(1, 1, 1),
		  |	0,
		  |	ВременнаяТаблица_РабочиеЗадания.РольРесурса,
		  |	ВременнаяТаблица_РабочиеЗадания.ЭтоПроектнаяЗадача,
		  |	ВЫБОР
		  |		КОГДА ВременнаяТаблица_РабочиеЗадания.ЭтоПроектнаяЗадача
		  |			ТОГДА 3
		  |		ИНАЧЕ 2
		  |	КОНЕЦ,
		  |	ВременнаяТаблица_РабочиеЗадания.Подразделение,
		  |	"""",
		  |	ВременнаяТаблица_РабочиеЗадания.ДатаНачала,
		  |	ВременнаяТаблица_РабочиеЗадания.ДатаЗавершения
		  |ИЗ
		  |	ВременнаяТаблица_РабочиеЗадания КАК ВременнаяТаблица_РабочиеЗадания
		  |ГДЕ
		  |	НЕ ВременнаяТаблица_РабочиеЗадания.РабочееЗадание В
		  |				(ВЫБРАТЬ
		  |					втОперативнаяЗагрузка.РабочееЗадание
		  |				ИЗ
		  |					втОперативнаяЗагрузка КАК втОперативнаяЗагрузка)
		  |
		  |ИНДЕКСИРОВАТЬ ПО
		  |	РабочееЗадание
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |ВЫБРАТЬ
		  |	втРабочиеЗаданияВсеДанные.Проект КАК Проект,
		  |	втРабочиеЗаданияВсеДанные.РабочееЗадание КАК РабочееЗадание,
		  |	втРабочиеЗаданияВсеДанные.День КАК День,
		  |	втРабочиеЗаданияВсеДанные.Трудозатраты КАК Трудозатраты,
		  |	втРабочиеЗаданияВсеДанные.РольРесурса КАК РольРесурса,
		  |	втРабочиеЗаданияВсеДанные.ЭтоПроектнаяЗадача КАК ЭтоПроектнаяЗадача,
		  |	втРабочиеЗаданияВсеДанные.ТипЗадачи КАК ТипЗадачи,
		  |	втРабочиеЗаданияВсеДанные.Подразделение КАК Подразделение,
		  |	ВЫБОР
		  |		КОГДА втРабочиеЗаданияВсеДанные.РабочееЗадание ССЫЛКА Документ.упоПроектнаяЗадача
		  |			ТОГДА втСвойстваПроектныхЗадач.НазваниеЗадачи
		  |		ИНАЧЕ втРабочиеЗаданияВсеДанные.Наименование
		  |	КОНЕЦ КАК Наименование,
		  |	втРабочиеЗаданияВсеДанные.ДатаНачалаПлан КАК ДатаНачала,
		  |	втРабочиеЗаданияВсеДанные.ДатаЗавершенияПлан КАК ДатаОкончания
		  |ИЗ
		  |	втРабочиеЗаданияВсеДанные КАК втРабочиеЗаданияВсеДанные
		  |		ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваПроектныхЗадач КАК втСвойстваПроектныхЗадач
		  |		ПО втРабочиеЗаданияВсеДанные.РабочееЗадание = втСвойстваПроектныхЗадач.ПроектнаяЗадача
		  |ИТОГИ
		  |	МАКСИМУМ(Проект),
		  |	МАКСИМУМ(РольРесурса),
		  |	МАКСИМУМ(ЭтоПроектнаяЗадача),
		  |	МАКСИМУМ(ТипЗадачи),
		  |	МАКСИМУМ(Подразделение),
		  |	МАКСИМУМ(Наименование),
		  |	МАКСИМУМ(ДатаНачала),
		  |	МАКСИМУМ(ДатаОкончания)
		  |ПО
		  |	РабочееЗадание";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
	
		ВыборкаПроектнаяЗадача = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СоответствиеДниНедели = Новый Соответствие;
		СоответствиеДниНедели.Вставить(1, "Понедельник");
		СоответствиеДниНедели.Вставить(2, "Вторник");
		СоответствиеДниНедели.Вставить(3, "Среда");
		СоответствиеДниНедели.Вставить(4, "Четверг");
		СоответствиеДниНедели.Вставить(5, "Пятница");
		СоответствиеДниНедели.Вставить(6, "Суббота");
		СоответствиеДниНедели.Вставить(7, "Воскресенье");	
		
		Пока ВыборкаПроектнаяЗадача.Следующий() Цикл
			
			СтрокаПроектнаяЗадача = ТаблицаРабочиеЗадания.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПроектнаяЗадача, ВыборкаПроектнаяЗадача);
			
			Выборка = ВыборкаПроектнаяЗадача.Выбрать(); 					
			
			ИтогоПоСтроке = 0;
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Трудозатраты) Тогда
					ИмяКолонки = СоответствиеДниНедели.Получить(ДеньНедели(Выборка.День));
					СтрокаПроектнаяЗадача[ИмяКолонки] = Выборка.Трудозатраты;	
					ИтогоПоСтроке = ИтогоПоСтроке + Выборка.Трудозатраты;
				КонецЕсли;	
			КонецЦикла;
			
			СтрокаПроектнаяЗадача.ИтогоПоСтроке = ИтогоПоСтроке;
			
		КонецЦикла;
		
	КонецЕсли;


КонецПроцедуры

// Формирует таблицу из проектных задач, рабочих заданий и поручений.
//
// Параметры:
//  Форма			 - УправляемаяФорма	 - форма документа Распределение рабочего времени за неделю.
//  ТЧРабочиеЗадания - ТаблицаЗначений	 - таблица, повторяющая табличную часть Рабочие задания.
//  МРабочиеЗадания	 - ТаблицаЗначений
//  ДанныеДокумента	 - Структура.
//
Процедура ЗаполнитьРабочиеЗадания(Форма, ТЧРабочиеЗадания, МРабочиеЗадания, ДанныеДокумента) Экспорт

	РасшифровкаТрудозатрат 	= ДанныеДокумента.РасшифровкаТрудозатрат;
	ТрудовойРесурс 			= ДанныеДокумента.ТрудовойРесурс;
	ДеньНачалаНедели 		= ДанныеДокумента.ДеньНачалаНедели;
	ДеньКонецНедели 		= ДанныеДокумента.ДеньКонецНедели;
	
	ТЧРабочиеЗадания.Колонки.Добавить("НаименованиеЗадачи");
	ТЧРабочиеЗадания.Индексы.Добавить("РабочееЗадание");
	ТЧРабочиеЗадания.Индексы.Добавить("НаименованиеЗадачи");
	
	// Прежде, чем обновлять табличную часть, необходимо учесть
	// заданный пользователем режим автозаполнения.
	
	Если Константы.упоРазрешитьРаспределениеРабочегоВремениПоЗакрытымЗадачам.Получить()
		И ТЧРабочиеЗадания.Количество() > 0 Тогда
		
		// Необходимо проверить табличную часть на наличие уже закрытых рабочих заданий
		// и проектных задач.
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоПроектнаяЗадача.Ссылка КАК ПроектнаяЗадача,
		               |	упоПроектнаяЗадача.Проект КАК Проект
		               |ПОМЕСТИТЬ ПроектныеЗадачи
		               |ИЗ
		               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		               |ГДЕ
		               |	упоПроектнаяЗадача.Ссылка В(&СписокДокументов)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	упоВерсииПроекта.Версия КАК Версия
		               |ПОМЕСТИТЬ ПроектныеЗадачиСТекущимиВерсиями
		               |ИЗ
		               |	ПроектныеЗадачи КАК ПроектныеЗадачи
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |		ПО ПроектныеЗадачи.Проект = упоВерсииПроекта.Проект
		               |ГДЕ
		               |	упоВерсииПроекта.Текущая
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	РегПЗ.ПроектнаяЗадача КАК ДокСсылка
		               |ИЗ
		               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
		               |			,
		               |			(Версия, ПроектнаяЗадача) В
		               |				(ВЫБРАТЬ
		               |					ПроектныеЗадачиСТекущимиВерсиями.Версия,
		               |					ПроектныеЗадачиСТекущимиВерсиями.ПроектнаяЗадача
		               |				ИЗ
		               |					ПроектныеЗадачиСТекущимиВерсиями)) КАК РегПЗ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
		               |				,
		               |				(Версия, ПроектнаяЗадача) В
		               |					(ВЫБРАТЬ
		               |						ПроектныеЗадачиСТекущимиВерсиями.Версия,
		               |						ПроектныеЗадачиСТекущимиВерсиями.ПроектнаяЗадача
		               |					ИЗ
		               |						ПроектныеЗадачиСТекущимиВерсиями)) КАК упоСвойстваПроектныхЗадачСрезПоследних
		               |		ПО РегПЗ.Версия = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |			И РегПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
		               |ГДЕ
		               |	(РегПЗ.СтатусЗадачи = &ЗадачаЗавершена
		               |			ИЛИ РегПЗ.СтатусЗадачи = &ЗадачаЗакрыта)";
		
		
		ПараметрыЗапроса = Новый Структура();
		ПараметрыЗапроса.Вставить("СписокДокументов", ТЧРабочиеЗадания.ВыгрузитьКолонку("РабочееЗадание"));
		ПараметрыЗапроса.Вставить("ЗадачаЗавершена", Перечисления.упоСостояниеСтатусаЗадачи.Завершена);
		ПараметрыЗапроса.Вставить("ЗадачаЗакрыта", Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
		ТаблицаЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса).Выгрузить();
		
		СтрокиУдалить = Новый Массив();
		Для каждого СтрокаЗадача Из ТЧРабочиеЗадания Цикл
			Если НЕ ТаблицаЗапроса.Найти(СтрокаЗадача.РабочееЗадание, "ДокСсылка") = Неопределено Тогда
				СтрокиУдалить.Добавить(СтрокаЗадача);
			КонецЕсли; 
		КонецЦикла; 
		
		Для каждого СтрокаУдалить Из СтрокиУдалить Цикл
			ТЧРабочиеЗадания.Удалить(СтрокаУдалить);
		КонецЦикла; 

	КонецЕсли; 	
	
	// Теперь перегоняем данные, введенные пользователем, в кэш.
	
	Для каждого СтрокаЗадача Из ТЧРабочиеЗадания Цикл

		СтрокиКэш = МРабочиеЗадания.НайтиСтроки(Новый Структура("РабочееЗадание, Задание", СтрокаЗадача.РабочееЗадание, СтрокаЗадача.Задание));
		
		Если СтрокиКэш.Количество() = 0 Тогда

			СтрокаКэш = МРабочиеЗадания.Добавить();
		Иначе
			СтрокаКэш = СтрокиКэш[0];
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(СтрокаКэш, СтрокаЗадача);
		
	КонецЦикла; 
		
	Если Не ЗначениеЗаполнено(ДеньНачалаНедели) Тогда
		ТЧРабочиеЗадания.Очистить();
	КонецЕсли; 	

	// Удаляем те задания, которые не вписались в срок, и 
	// добавляем новые, если они есть.
	
	ТаблицаЗапроса = ПолучитьРабочиеЗадания(ТрудовойРесурс, ДеньНачалаНедели, ДеньКонецНедели);
	
	Если ТаблицаЗапроса = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокиУдалить = Новый Массив();
	
	Для каждого СтрокаЗадача Из ТЧРабочиеЗадания Цикл

		СтрокиЗапроса = ТаблицаЗапроса.НайтиСтроки(Новый Структура("РабочееЗадание, РольРесурса, Задание",
			СтрокаЗадача.РабочееЗадание, СтрокаЗадача.РольРесурса, СтрокаЗадача.Задание));

		Если СтрокиЗапроса.Количество() = 0 Тогда
			СтрокиУдалить.Добавить(СтрокаЗадача);	
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого СтрокаУдалить Из СтрокиУдалить Цикл
		
		// Удаляем также строки из ТЧ расшифровки.

		СтрокиРасшифровки = РасшифровкаТрудозатрат.НайтиСтроки(Новый Структура("РабочееЗадание, РольРесурса, Задание",
			СтрокаУдалить.РабочееЗадание, СтрокаУдалить.РольРесурса, СтрокаУдалить.Задание));
		Для каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
			РасшифровкаТрудозатрат.Удалить(СтрокаРасшифровки);
		КонецЦикла; 
		
		ТЧРабочиеЗадания.Удалить(СтрокаУдалить);
	КонецЦикла; 
	
	Для каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл

		 СтрокиЗадач = ТЧРабочиеЗадания.НайтиСтроки(Новый Структура("РабочееЗадание, РольРесурса, Задание", 
		 	СтрокаЗапроса.РабочееЗадание, СтрокаЗапроса.РольРесурса, СтрокаЗапроса.Задание));

		 Если СтрокиЗадач.Количество() = 0 Тогда		
			 СтрокаЗадача = ТЧРабочиеЗадания.Добавить();
			 
			 // Если данные есть в кэше, забираем их оттуда.

			 СтрокиКэша = МРабочиеЗадания.НайтиСтроки(Новый Структура("РабочееЗадание, РольРесурса, Задание",
			 	СтрокаЗапроса.РабочееЗадание, СтрокаЗапроса.РольРесурса, СтрокаЗапроса.Задание));


			 Если НЕ СтрокиКэша.Количество() = 0 Тогда	
				 СтрокаКэш = СтрокиКэша[0]; 
				 ЗаполнитьЗначенияСвойств(СтрокаЗадача, СтрокаКэш);
				 				 
				 // В документах, которые заполнялись в редакции 1, могла остаться пустая роль
				 // и/или пустой проект.
				 
				 Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаЗадача.РольРесурса) Тогда
					СтрокаЗадача.РольРесурса = СтрокаЗапроса.РольРесурса;
					СтрокаЗадача.Проект = СтрокаЗапроса.ЭтоПроектнаяЗадача;
				КонецЕсли; 		

				Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаЗадача.Подразделение) Тогда
					СтрокаЗадача.Подразделение = СтрокаЗапроса.Подразделение;
				КонецЕсли;
			
				Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаЗадача.Проект) Тогда
					СтрокаЗадача.Проект = СтрокаЗапроса.Проект;
				КонецЕсли; 		
				
			Иначе
				ЗаполнитьЗначенияСвойств(СтрокаЗадача, СтрокаЗапроса);
			КонецЕсли; 			
		Иначе
			
			// В документах, которые заполнялись в редакции 1, могла остаться пустая роль
			// и/или пустой проект.
			
			СтрокаЗадача = СтрокиЗадач[0];
			
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаЗадача.РольРесурса) Тогда
				СтрокаЗадача.РольРесурса = СтрокаЗапроса.РольРесурса;
				СтрокаЗадача.ЭтоПроектнаяЗадача = СтрокаЗапроса.ЭтоПроектнаяЗадача;
			КонецЕсли; 		

			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаЗадача.Подразделение) Тогда
				СтрокаЗадача.Подразделение = СтрокаЗапроса.Подразделение;
			КонецЕсли;
			
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаЗадача.Проект) Тогда
				СтрокаЗадача.Проект = СтрокаЗапроса.Проект;
			КонецЕсли; 		

		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

// Формирует таблицу из внепроектных задач.
//
// Параметры:
//  ТрудовойРесурс	 - СправочникСсылка.упоТрудовыеРесурсы.
//  ДеньНачалаНедели - Дата.
//  ДеньКонецНедели	 - Дата.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ЗаполнитьВнепроектныеЗадачи(ТрудовойРесурс, ДеньНачалаНедели, ДеньКонецНедели) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    СправочникупоЗадания.Код КАК Код,
		|    СправочникупоЗадания.Наименование КАК Наименование,
		|    СправочникупоЗадания.Автор КАК Автор,
		|    СправочникупоЗадания.АвторИзменений КАК АвторИзменений,
		|    СправочникупоЗадания.ДатаМодификации КАК ДатаМодификации,
		|    СправочникупоЗадания.ОписаниеЗадания КАК ОписаниеЗадания,
		|    упоСрокиЗаданий.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|    упоСрокиЗаданий.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
		|    СправочникупоЗадания.Ссылка КАК Задача,
		|    СправочникупоЗадания.Роль КАК Роль,
		|    СправочникупоЗадания.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ОсновнаяТаблица
		|ИЗ
		|    РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
		|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК СправочникупоЗадания
		|        ПО упоСрокиЗаданий.Задание = СправочникупоЗадания.Ссылка
		|ГДЕ
		|    СправочникупоЗадания.ВидЗадания = ЗНАЧЕНИЕ(Справочник.упоВидыЗаданий.Поручение)
		|    И СправочникупоЗадания.ПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|    И НЕ СправочникупоЗадания.ПометкаУдаления
		|    И упоСрокиЗаданий.ДатаНачалаПлан <= &ДатаОкончанияПлан
		|    И ВЫБОР
		|            КОГДА упоСрокиЗаданий.ДатаОкончанияПлан = ДАТАВРЕМЯ(1, 1, 1)
		|                ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
		|            ИНАЧЕ упоСрокиЗаданий.ДатаОкончанияПлан
		|        КОНЕЦ >= &ДатаНачалаПлан
		|    И СправочникупоЗадания.Исполнитель = &Исполнитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    ОсновнаяТаблица.Код КАК Код,
		|    ОсновнаяТаблица.Наименование КАК Наименование,
		|    ОсновнаяТаблица.Автор КАК Автор,
		|    ОсновнаяТаблица.АвторИзменений КАК АвторИзменений,
		|    ОсновнаяТаблица.ДатаМодификации КАК ДатаМодификации,
		|    ОсновнаяТаблица.ОписаниеЗадания КАК ОписаниеЗадания,
		|    ОсновнаяТаблица.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|    ОсновнаяТаблица.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
		|    ОсновнаяТаблица.Задача КАК Задача,
		|    ОсновнаяТаблица.Роль КАК Роль,
		|    ОсновнаяТаблица.Подразделение КАК Подразделение
		|ИЗ
		|    ОсновнаяТаблица КАК ОсновнаяТаблица
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
		|        ПО ОсновнаяТаблица.Задача = упоЗаданияСтатусыСрезПоследних.Задание
		|ГДЕ
		|    (ОсновнаяТаблица.ДатаНачалаПлан <> ДАТАВРЕМЯ(1, 1, 1)
		|            ИЛИ ОсновнаяТаблица.ДатаОкончанияПлан <> ДАТАВРЕМЯ(1, 1, 1)
		|            ИЛИ ЕСТЬNULL(упоЗаданияСтатусыСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.ПустаяССылка)) <> ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Завершено))
		|
		|УПОРЯДОЧИТЬ ПО
		|    ДатаНачалаПлан,
		|    Наименование";
	
	Запрос.УстановитьПараметр("Исполнитель", ТрудовойРесурс);
	Запрос.УстановитьПараметр("ДатаНачалаПлан", ДеньНачалаНедели);
	Запрос.УстановитьПараметр("ДатаОкончанияПлан", ДеньКонецНедели);
	
	ТаблицаВнепроектныеЗадачи = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаВнепроектныеЗадачи;
	
КонецФункции

// Выводит сообщение пользователю .
//
// Параметры:
//	РезультатЗапроса 		- Результат выполнения запроса
//	ТрудовойРесурс 			- Справочник.упоТрудовыеРесурсы
Процедура СообщитьОбОшибкахПроверкиПриПроведении(РезультатЗапроса, ТрудовойРесурс) Экспорт
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтрокиСообщения = Новый Массив;
	ТекстСообщения = НСтр("ru = 'По трудовому ресурсу %1 обнаружено превышение допустимого количества списываемых за день часов (в системе включено 24 часовое ограничение):
	|
	|'");	
	СтрокиСообщения.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТрудовойРесурс));
	ШаблонТекстаЕдЧисло = НСтр("ru = 'На %1 уже списано %2 документом: '");
	ШаблонТекста = НСтр("ru = 'На %1 уже списано %2. По документам: '");
	ШаблонСписано = НСтр("ru = ' списано %1'");
	ШаблонСписанияПревышения = НСтр("ru = 'Текущим документом списывается %1, превышение на %2.'");
	Пока Выборка.СледующийПоЗначениюПоля("День") Цикл
		
		ШаблонТекстаСообщения = ?(Выборка.КоличествоРегистраторов = 1, ШаблонТекстаЕдЧисло, ШаблонТекста);
		СтрокиСообщения.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаСообщения,
																						 Формат(Выборка.День, "ДФ=dd.MM.yyyy"),
																						 Выборка.ТрудозатратыТекущие));																						 
		ТекстСписанияПревышения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСписанияПревышения,
			Выборка.ТрудозатратыДокументаВДень, Выборка.Превышение);																			 
		Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
			СтрокиСообщения.Добавить(Выборка.Регистратор);
			Если Выборка.КоличествоРегистраторов > 1 Тогда
				СтрокиСообщения.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСписано, Выборка.Трудозатраты));
			КонецЕсли;
			СтрокиСообщения.Добавить("; ");
		КонецЦикла;
		
		СтрокиСообщения.Удалить(СтрокиСообщения.Количество() - 1);
		
		СтрокиСообщения.Добавить(Символы.ПС);		
		СтрокиСообщения.Добавить(ТекстСписанияПревышения);
		СтрокиСообщения.Добавить(Символы.ПС);
		СтрокиСообщения.Добавить(Символы.ПС);
		
	КонецЦикла;
		
	ТекстСообщения = СокрП(СтрСоединить(СтрокиСообщения));
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// Возвращает время начала дня.
// 
// Возвращаемое значение:
//  Дата
//
Функция ПолучитьВремяНачалаДня() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	ВремяНачалаРабочегоДня = Константы.упоВремяНачалаРабочегоДня.Получить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ЗначениеЗаполнено(ВремяНачалаРабочегоДня) Тогда
		ВремяНачалаРабочегоДня = Дата("00010101090000"); //09:00:00
	КонецЕсли;
	
	Возврат ВремяНачалаРабочегоДня;
	
КонецФункции

// Возвращает таблицу трудовых ресурсов с выбранным уровнем планирования.
//
// Параметры:
//  ИсходнаяТаблицаТрудовыхРесурсов		 - ТаблицаЗначений
//  КолонкаСтоимости					 - Строка
//  УровеньПланированияТрудозатратДляБДР - Перечисление.упоУровеньПланированияТрудозатратДляБДР, Перечисление.упоУровеньПланирования
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ТаблицаТрудовыхРесурсовПоУровням(ИсходнаяТаблицаТрудовыхРесурсов, КолонкаСтоимости, УровеньПланированияТрудозатратДляБДР = Неопределено) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапросаТрудовыеРесурсыПоУровнямПланирования(КолонкаСтоимости));
	
	КоличествоПолей = СхемаЗапроса.ПакетЗапросов[0].Колонки.Количество();
	
	ПоляВыбора = Новый Структура;
	ПоляВыбора.Вставить("ЕдиницаНормирования", "ЕдиницаНормирования");
	
	Сч = 0;
	Для Каждого ПолеВыбора Из ПоляВыбора Цикл
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить("ТаблицаТрудовыеРесурсы." + ПолеВыбора.Ключ);
		СхемаЗапроса.ПакетЗапросов[0].Колонки[КоличествоПолей + Сч].Псевдоним = ПолеВыбора.Значение;
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].ВыбираемыеПоля.Добавить("ТаблицаТрудовыеРесурсы." + ПолеВыбора.Значение);
		Сч = Сч + 1;
	КонецЦикла;
	
	СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор[0] = Новый ВыражениеСхемыЗапроса(
			"	ВЫБОР
			|		КОГДА &ВыбранУровеньПланирования
			|			ТОГДА ТаблицаТрудовыеРесурсы.УровеньПланирования = &УровеньПланирования
			|		КОГДА 1 В
			|				(ВЫБРАТЬ
			|					ВТДанныеОкончательногоУровня.Поле1
			|				ИЗ
			|					ВТДанныеОкончательногоУровня)
			|			ТОГДА ТаблицаТрудовыеРесурсы.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
			|		ИНАЧЕ ТаблицаТрудовыеРесурсы.УровеньПланирования <> ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
			|	КОНЕЦ");
	
	Если ТипЗнч(УровеньПланированияТрудозатратДляБДР)
		= Тип("ПеречислениеСсылка.упоУровеньПланированияТрудозатратДляБДР") Тогда
		УровеньПланирования = УровеньПланированияПоУровнюПланированияТрудозатратДляБДР(УровеньПланированияТрудозатратДляБДР);
	Иначе
		УровеньПланирования = УровеньПланированияТрудозатратДляБДР;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТрудовыеРесурсы", ИсходнаяТаблицаТрудовыхРесурсов);
	Запрос.УстановитьПараметр("ВыбранУровеньПланирования", ЗначениеЗаполнено(УровеньПланирования));
	Запрос.УстановитьПараметр("УровеньПланирования", УровеньПланирования);
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получает поручения.
//
// Параметры:
//  ДатаНачала 		- Дата - Дата начала.
//  ДатаОкончания 	- Дата - Дата окончания. 
//  Ресурс 			- СправочникСсылка.упоТрудовыеРесурсы - трудовой ресурс.
//
// Возвращаемое значение:
//  ТаблицаЗначений	- найденные рабочие задания.
//
Функция ПолучитьИЗаполнитьПоручения(ДатаНачала, ДатаОкончания, Ресурс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникупоЗадания.Код КАК Код,
	|	СправочникупоЗадания.Наименование КАК Наименование,
	|	СправочникупоЗадания.Автор КАК Автор,
	|	СправочникупоЗадания.АвторИзменений КАК АвторИзменений,
	|	СправочникупоЗадания.ДатаМодификации КАК ДатаМодификации,
	|	СправочникупоЗадания.ОписаниеЗадания КАК ОписаниеЗадания,
	|	упоСрокиЗаданий.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСрокиЗаданий.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	СправочникупоЗадания.Ссылка КАК Задача
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоЗадания КАК СправочникупоЗадания
	|		ПО упоСрокиЗаданий.Задание = СправочникупоЗадания.Ссылка
	|ГДЕ
	|	СправочникупоЗадания.ВидЗадания = ЗНАЧЕНИЕ(Справочник.упоВидыЗаданий.Поручение)
	|	И СправочникупоЗадания.ПроектнаяЗадача = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	И НЕ СправочникупоЗадания.ПометкаУдаления
	|	И упоСрокиЗаданий.ДатаНачалаПлан <= &ДатаОкончанияПлан
	|	И ВЫБОР
	|			КОГДА упоСрокиЗаданий.ДатаОкончанияПлан = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|			ИНАЧЕ упоСрокиЗаданий.ДатаОкончанияПлан
	|		КОНЕЦ >= &ДатаНачалаПлан
	|	И СправочникупоЗадания.Исполнитель = &Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновнаяТаблица.Код КАК Код,
	|	ОсновнаяТаблица.Наименование КАК Наименование,
	|	ОсновнаяТаблица.Автор КАК Автор,
	|	ОсновнаяТаблица.АвторИзменений КАК АвторИзменений,
	|	ОсновнаяТаблица.ДатаМодификации КАК ДатаМодификации,
	|	ОсновнаяТаблица.ОписаниеЗадания КАК ОписаниеЗадания,
	|	ОсновнаяТаблица.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ОсновнаяТаблица.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	ОсновнаяТаблица.Задача КАК Задача
	|ИЗ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
	|		ПО ОсновнаяТаблица.Задача = упоЗаданияСтатусыСрезПоследних.Задание
	|ГДЕ
	|	(ОсновнаяТаблица.ДатаНачалаПлан <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ОсновнаяТаблица.ДатаОкончанияПлан <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ЕСТЬNULL(упоЗаданияСтатусыСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.ПустаяССылка)) <> ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Завершено))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачалаПлан,
	|	Наименование";
	
	Запрос.УстановитьПараметр("ДатаНачалаПлан", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончанияПлан", ДатаОкончания);
	Запрос.УстановитьПараметр("Исполнитель", Ресурс);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции

#КонецОбласти

#Область ОтражениеПлановыхТрудозатрат

// Вызывает отложенное или оперативное отражение плановых трудозатрат в зависимости от настройки системы.
//
// Параметры:
//  Предмет					 - ДокументСсылка.упоПроектнаяЗадача, Массив - предмет отражения - одна или несколько проектных задач.
//  Источник				 - ДокументСсылка - документ-источник изменений в плановых трудозатратах 
// 		(см. регистраторы регистра упоДанныеПлановТрудозатратРолей).
//  НезаписанныеСрокиЗадач	 - Соответствие
//  НезаписанныеДанныеЗадач	 - Соответствие
//  ДвиженияДокумента		 - Движения
//
Процедура ОтразитьПлановыеТрудозатратыЗадачи(Предмет, Источник, 
	НезаписанныеСрокиЗадач = Неопределено, 
	НезаписанныеДанныеЗадач = Неопределено,
	ДвиженияДокумента = Неопределено) Экспорт
	
	ПроверитьПараметрОтраженияСИсключением(Предмет);

	Если упоРаботаСОчередямиВызовСервера.ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат() Тогда
		
		ДобавитьВОчередьОтраженияПлановыхТрудозатратЗадач(Предмет, Источник);
		
	Иначе
		
		лОтразитьПлановыеТрудозатратыЗадачи(Предмет, НезаписанныеСрокиЗадач, НезаписанныеДанныеЗадач, ДвиженияДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает проведение документов "Регистрация стоимости ресурса" и "Регистрация стоимости ресурсов".
// Ставим проектные задачи, в которых запланированы трудозатраты по роли или трудовому ресурсу, в очередь
// к отражению или актуализируем трудозатраты сразу, в зависимости от опции 
// "ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат". Попадают только те задачи, в проекте которых указано
// "УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат" или задана константа в параметрах РМ,
// задача не отменена, задача не в статусе "Закрыта" или "Завершена" и период изменения стоимости ресурса
// попадает в сроки задачи.
//
// Параметры:                    
//  Источник  - ДокументОбъект - документ "Регистрация стоимости ресурса" или "Регистрация стоимости ресурсов".
//  Отказ  - Булево - флаг отказа.
//  РежимПроведения  - РежимПроведенияДокумента - режим проведения документа.
//
Процедура РегистрацияСтоимостиРесурсовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ОтразитьТрудозатратыПриИзмененииНормСтоимости(Источник, Отказ);
	
КонецПроцедуры

// Обрабатывает отмену проведения документов "Регистрация стоимости ресурса" и "Регистрация стоимости ресурсов".
// Ставим проектные задачи, в которых запланированы трудозатраты по роли или трудовому ресурсу, в очередь
// к отражению или актуализируем трудозатраты сразу, в зависимости от опции 
// "ИспользоватьОтложенноеОтражениеПлановыхТрудозатрат". Попадают только те задачи, в проекте которых указано
// "УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат" или задана константа в параметрах РМ,
// задача не отменена, задача не в статусе "Закрыта" или "Завершена" и период изменения стоимости ресурса
// попадает в сроки задачи.
//
// Параметры:
//  Источник  - ДокументОбъект - документ "Регистрация стоимости ресурса" или "Регистрация стоимости ресурсов".
//  Отказ  - Булево - флаг отказа.
//
Процедура РегистрацияСтоимостиРесурсовУдалениеПроведения(Источник, Отказ) Экспорт
	
	ОтразитьТрудозатратыПриИзмененииНормСтоимости(Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти

// См. ПолучитьТаблицыРаспределенияТрудозатрат
//
Функция ПолучитьТаблицыРаспределенияТрудозатратПрокси(ВхДанные) Экспорт
	
	Если ТипЗнч(ВхДанные) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВхДанные);
		Возврат ПолучитьТаблицыРаспределенияТрудозатрат(ВхДанные);
	Иначе
		Возврат упоРаспределениеТрудозатратПовтИспВыз.ПолучитьТаблицыРаспределенияТрудозатрат(ВхДанные);
	КонецЕсли;
		
КонецФункции

// Строит таблицы распределения трудозатрат по профилям.
//
// Параметры:
//  ВхДанные - СправочникСсылка.упоПрофилиРаспределенияТрудозатрат, Массив	 - одиночный профиль распределения или массив,
//  	в случае, если нужно получить для нескольких профилей сразу.
// 
// Возвращаемое значение:
//  ТаблицаЗначений, ДеревоЗначений - сформированные таблицы.
//
Функция ПолучитьТаблицыРаспределенияТрудозатрат(ВхДанные) Экспорт
	
	// Разбираем входные данные и формируем структуру результата.
	
	ЭтоМассив = Неопределено;
	
	Результат = Новый ДеревоЗначений();
	Результат.Колонки.Добавить("Профиль");
	Результат.Колонки.Добавить("Загрузка");
	Результат.Колонки.Добавить("Трудозатраты");
	
	Если ТипЗнч(ВхДанные) = Тип("СправочникСсылка.упоПрофилиРаспределенияТрудозатрат") Тогда
		
		ЭтоМассив = Ложь; 		
		НоваяСтрока = Результат.Строки.Добавить();
		НоваяСтрока.Профиль = ВхДанные;
		
	ИначеЕсли ТипЗнч(ВхДанные) = Тип("Массив") Тогда
		
		// На всякий случай "свернем" массив, т.к. в исходных данных могли прийти дублирующеся элементы.
		
		НоваяТаблица = Новый ТаблицаЗначений();
		НоваяТаблица.Колонки.Добавить("Профиль");
		
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			НоваяТаблица.Добавить();
		КонецЦикла; 
		
		НоваяТаблица.ЗагрузитьКолонку(ВхДанные, "Профиль");
		НоваяТаблица.Свернуть("Профиль");
		
		ЭтоМассив = Истина;
		Для Счетчик = 1 По ВхДанные.Количество() Цикл
			Результат.Строки.Добавить();		
		КонецЦикла; 		
		Результат.Строки.ЗагрузитьКолонку(НоваяТаблица.ВыгрузитьКолонку("Профиль"), "Профиль");
		
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабПрофиль.Трудозатраты,
	|	ТабПрофиль.Загрузка,
	|	ТабПрофиль.Ссылка КАК Профиль
	|ИЗ
	|	Справочник.упоПрофилиРаспределенияТрудозатрат.ТаблицаРаспределения КАК ТабПрофиль
	|ГДЕ
	|	ТабПрофиль.Ссылка В(&СписокПрофилей)
	|	И ТабПрофиль.Ссылка.СпособРаспределения = Значение(Перечисление.упоСпособРаспределенияТрудозатрат.ПоТаблицеРаспределения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабПрофиль.Трудозатраты,
	|	ТабПрофиль.ДоляПериода,
	|	ТабПрофиль.Ссылка КАК Профиль
	|ИЗ
	|	Справочник.упоПрофилиРаспределенияТрудозатрат.ТаблицаРаспределенияПоПериоду КАК ТабПрофиль
	|ГДЕ
	|	ТабПрофиль.Ссылка В(&СписокПрофилей)
	|	И ТабПрофиль.Ссылка.СпособРаспределения = Значение(Перечисление.упоСпособРаспределенияТрудозатрат.ПоТаблицеРаспределенияСПериодами)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	100,
	|	СпрПрофиль.ЗагрузкаДляЛинейногоРаспределения,
	|	СпрПрофиль.Ссылка
	|ИЗ
	|	Справочник.упоПрофилиРаспределенияТрудозатрат КАК СпрПрофиль
	|ГДЕ
	|	СпрПрофиль.Ссылка В(&СписокПрофилей)
	|	И СпрПрофиль.СпособРаспределения = Значение(Перечисление.упоСпособРаспределенияТрудозатрат.РавномерноПоДням)";
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("СписокПрофилей", ВхДанные);
	
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса);
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Результат.Строки.Найти(Выборка.Профиль, "Профиль");
		Если НЕ СтрокаДанных = Неопределено Тогда
			СтрокаРезультат = СтрокаДанных.Строки.Добавить();
			СтрокаРезультат.Загрузка = Выборка.Загрузка;
			СтрокаРезультат.Трудозатраты = Выборка.Трудозатраты;
		КонецЕсли; 		
	КонецЦикла; 
	
	Если ЭтоМассив Тогда
		Возврат Результат;		
	Иначе
		Возврат Результат.Строки[0].Строки;
	КонецЕсли; 
	
КонецФункции

// Производит распределение трудозатрат в соответствии с
//  заданными профилями распределения.
//
// Параметры:
//  ТрудовыеРесурсы	 - ТаблицаЗначений - ресурсы, трудозатраты и профили для распределения.
//  Календарь		 - Справочник.упоРабочиеКалендари, Справочник.Проекты	 - календарь
//  	для определения рабочих дней и часов; проект - в этом случае
//  	календарь определяется по регистру сведений.
//  ДатаНачала		 - Дата - начало периода распределения.
//  ДатаЗавершения	 - Дата - завершение периода распределения.
//  ВывестиСообщение - Булево - флаг вывода сообщения
//  	в случае, если календарь не найден.
// 
// Возвращаемое значение:
//  ДеревоЗначений, Неопределено - данные распределения трудозатрат по дням.
//
Функция РаспределитьТрудозатратыПоПрофилям(Знач ТрудовыеРесурсы, Знач Календарь, ДатаНачала,
	ДатаЗавершения = Неопределено, ВывестиСообщение = Истина) Экспорт

	// Данные рабочих календарей будем кэшировать по мере расчета.
	
	РабочийКалендарь = ПолучитьРабочийКалендарь(Календарь);
	Если РабочийКалендарь = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	// Получаем данные профилей распределения, всех сразу.
	
	МассивПрофилейРаспределения = ТрудовыеРесурсы.ВыгрузитьКолонку("ПрофильРаспределения");
	
	ДанныеПрофилей = ПолучитьТаблицыРаспределенияТрудозатрат(МассивПрофилейРаспределения);
	
	// Работать будем не с переданной таблицей (это может быть и табличная
	// часть документа), а с собственной копией.
	ДанныеТрудозатрат = ПодготовитьТаблицуДанныеТрудозатрат(ТрудовыеРесурсы);
	
	// Поддерживаются два вида расчета:
	// 1) Задана только дата начала, дата завершения пустая.
	//    В этом случае рабочие дни и количество рабочих часов
	//    берется из рабочего календаря. Результатом расчета,
	//    помимо таблиц распределения, является дата завершения.
	// 2) Заданы и дата начала, и дата завершения. Смысл расчета
	//    состоит в том, чтобы "запихнуть" указанные трудозатраты
	//    в указанный период. При этом для любого трудового ресурса
	//    возможно сколь угодно большое превышение начисленных часов
	//    над количеством часов, которые были заданы в календаре.
	
	ОбратныйРасчет = НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ДатаЗавершения);
	
	ДанныеПериода = Новый Структура();
	
	Если ОбратныйРасчет Тогда
		// Вычисляем общее количество рабочих дней, которые содержатся
		// в заданном периоде.
		ДанныеПериода = упоРабочиеКалендариВызовСервера.обКоличествоРабочихДнейИЧасовВПериоде(РабочийКалендарь, ДатаНачала, ДатаЗавершения);		
	КонецЕсли; 
	
	// Рассчитаем данные для колонок ТЗ ДанныеТрудозатрат, например, таких как
	// "ПерегрузкаРесурса", "КоличествоЧасовПериода" и др.
	ДополнитьТаблицуДанныеТрудозатрат(ДанныеТрудозатрат, ДанныеПериода, ДанныеПрофилей, ОбратныйРасчет);
	
	// Данные, которые буду возвращены данной функцией.
	ТрудозатратыПоПрофилям = Неопределено;
	
	// Подготавливаем начальные данные рабочих календарей.
	ДанныеКалендаря = Новый Структура();
	Если ЗаполнитьДанныеКалендаря(ДанныеКалендаря, РабочийКалендарь, ДатаНачала, ДатаЗавершения,
		ВывестиСообщение, ОбратныйРасчет) Тогда
		
		// Строим общую таблицу исходных данных с учетом настроек профилей распределения.
		ДанныеРаспределения = ПолучитьДанныеРаспределения(ДанныеПрофилей, ДанныеТрудозатрат, ОбратныйРасчет);
		
		// Получим данные расчета или Неопределено в случае неудачи.
		ТрудозатратыПоПрофилям = ПолучитьДанныеРасчетаТрудозатратПоПрофилям(ДатаНачала, ДатаЗавершения, РабочийКалендарь, 
			ДанныеКалендаря, ДанныеТрудозатрат, ДанныеРаспределения, ОбратныйРасчет, ВывестиСообщение);
		
	КонецЕсли;
		
	Возврат ТрудозатратыПоПрофилям;	

КонецФункции

// Возвращает ссылку на профиль распределения, найденный по проценту загрузки.
//
// Параметры:
//  ПроцентЗагрузки	 - Число – процент загрузки.
// 
// Возвращаемое значение:
//  Справочник.упоПрофилиРаспределенияТрудозатрат - ссылка на профиль распределения.
//
Функция НайтиПрофильРаспределенияПоПроценту(ПроцентЗагрузки) Экспорт
	
	// Предполагаем, что процент означает, равномерную загрузку.
	// Равномерная загрузка на период.
	
	// Процент должен быть целым числом от 1 до 100.
	ПриведенныйПроцент = Цел(ПроцентЗагрузки);
	Если ПриведенныйПроцент < 1 Тогда
		ПриведенныйПроцент = 1;
	КонецЕсли;
	Если ПриведенныйПроцент > 100 Тогда
		ПриведенныйПроцент = 100;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Табл.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.упоПрофилиРаспределенияТрудозатрат.ТаблицаРаспределенияПоПериоду КАК Табл
	               |ГДЕ
	               |	Табл.Ссылка.ЗагруженИзMSP
	               |	И Табл.ДоляПериода = 100
	               |	И Табл.Трудозатраты = &Трудозатраты
	               |	И Табл.Ссылка.СпособРаспределения = ЗНАЧЕНИЕ(Перечисление.упоСпособРаспределенияТрудозатрат.ПоТаблицеРаспределенияСПериодами)
	               |	И НЕ Табл.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Трудозатраты", ПриведенныйПроцент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// Раз мы зашли сюда, то надо создать профиль распределения.
	НовыйПрофиль = Справочники.упоПрофилиРаспределенияТрудозатрат.СоздатьЭлемент();
	НовыйПрофиль.СпособРаспределения = Перечисления.упоСпособРаспределенияТрудозатрат.ПоТаблицеРаспределенияСПериодами;
	НовыйПрофиль.Наименование = НСтр("ru = 'Равномерно '") + Строка(ПриведенныйПроцент) 
		+ НСтр("ru = '% по 100% периоду (из MS Project)'");
	НовыйПрофиль.ЗагруженИзMSP = Истина;
	
	НоваяСтрокаРаспределения = НовыйПрофиль.ТаблицаРаспределенияПоПериоду.Добавить();
	НоваяСтрокаРаспределения.ДоляПериода = 100;
	НоваяСтрокаРаспределения.Трудозатраты = ПриведенныйПроцент;
	
	НовыйПрофиль.Комментарий = НСтр("ru = 'Создан автоматически при импорте из MS Project'");
	НовыйПрофиль.Записать();
	
	Возврат НовыйПрофиль.Ссылка;
	
КонецФункции

// Проверяет возможность списания фактических трудозатрат 
// по задачам в статусе "Завершена" или "Закрыта" и заданиям в статусе "Закрыто"
//
// Параметры:
//	ПроектныеЗадачи - Массив - Проектные задачи для проверки.		 
//	Задания - Массив - Задания для проверки.		 
//  Отказ	- Булево - признак отказа.
//
Процедура ПроверитьВозможностьСписанияФактическихЗатратПоЗакрытымЗадачам(ПроектныеЗадачи, 
	Задания, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСтатусыПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |ГДЕ
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи В(&СтатусыЗадачи)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоЗаданияСтатусыСрезПоследних.Задание КАК Задание,
	               |	упоЗаданияСтатусыСрезПоследних.Статус КАК СтатусЗадания,
	               |	упоЗаданияСтатусыСрезПоследних.Задание.Представление КАК ЗаданиеПредставление
	               |ИЗ
	               |	РегистрСведений.упоЗаданияСтатусы.СрезПоследних(, Задание В (&Задания)) КАК упоЗаданияСтатусыСрезПоследних
	               |ГДЕ
	               |	упоЗаданияСтатусыСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыЗаданий.Закрыто)"; 
	
	СтатусыЗадачи = Новый Массив;
	СтатусыЗадачи.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Завершена);
	СтатусыЗадачи.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
	
	Запрос.УстановитьПараметр("СтатусыЗадачи", СтатусыЗадачи);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	Запрос.УстановитьПараметр("Задания", Задания);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой()
		И РезультатЗапроса[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если Не РезультатЗапроса[0].Пустой() Тогда
		ШаблонТекста = НСтр("ru = 'По проектной задаче %1 нельзя вносить изменения фактических трудозатрат, т.к. она находится в статусе %2.'");
		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл   
			ИмяЗадачи = упоПроектыИЗадачиСервер.НазваниеПроектнойЗадачи(Выборка.ПроектнаяЗадача, Истина);
			ТекстСообщения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
								ШаблонТекста,
								ИмяЗадачи,
								Выборка.СтатусЗадачи);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;	
	
	Если Не РезультатЗапроса[1].Пустой() Тогда
		ШаблонТекста = НСтр("ru = 'По заданию ""%1"" нельзя вносить изменения фактических трудозатрат, т.к. оно находится в статусе %2.'");
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл   
			ТекстСообщения = упоФункцииОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
								ШаблонТекста,
								Выборка.Задание,
								Выборка.СтатусЗадания);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры	

// Проверяет возможность списания фактических трудозатрат 
// по задачам проекта в статусе "Остановлен"
//
// Параметры:
//	ДанныеПроверки - ТаблицаЗначений - проектные задачи для проверки.
//	Сотрудник - Справочник.упоСтрудники - сотрудник, который списывает фактические трудозатраты.
//  Отказ	- Булево - признак отказа.
//
Процедура ПроверитьВозможностьСписанияФактическихЗатратПоОстановленнымПроектам(ДанныеПроверки, 
	Сотрудник, Отказ) Экспорт

	ПроверитьВозможностьСписанияФактическихЗатратПоПроектамСУчетомСтатуса(ДанныеПроверки,
		Сотрудник,
		"Остановлен",
		Отказ);
	
КонецПроцедуры

// Проверяет возможность списания фактических трудозатрат 
// по задачам проекта в заданных статусах.
//
// Параметры:
//	ДанныеПроверки - ТаблицаЗначений - проектные задачи для проверки.
//	Сотрудник - Справочник.упоСтрудники - сотрудник, который списывает фактические трудозатраты.
//	СтрокаСтатусов - Строка - статусы проекта.
//  Отказ	- Булево - признак отказа.
//
Процедура ПроверитьВозможностьСписанияФактическихЗатратПоПроектамСУчетомСтатуса(ДанныеПроверки, 
	Сотрудник, СтрокаСтатусов, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос; 
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ДанныеПроверки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДанныеПроверки.Проект КАК Проект,
	               |	ДанныеПроверки.ДатаСтатуса КАК ДатаПроверкиСтатуса
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	&ДанныеПроверки КАК ДанныеПроверки
	               |ГДЕ
	               |	ДанныеПроверки.ДатаСтатуса <> ДАТАВРЕМЯ(1, 1, 1)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Данные.Проект КАК Проект,
	               |	Данные.ДатаПроверкиСтатуса КАК ДатаПроверкиСтатуса,
	               |	МАКСИМУМ(упоСтатусыПроектов.Период) КАК ПериодСтатусаПроектаНаДату
	               |ПОМЕСТИТЬ ВТ_СтатусыПроектаНаДатуПроверки
	               |ИЗ
	               |	Данные КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов КАК упоСтатусыПроектов
	               |		ПО Данные.Проект = упоСтатусыПроектов.Проект
	               |ГДЕ
	               |	НачалоПериода(упоСтатусыПроектов.Период) <= Данные.ДатаПроверкиСтатуса
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Данные.ПроектнаяЗадача,
	               |	Данные.Проект,
	               |	Данные.ДатаПроверкиСтатуса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Данные.Проект КАК Проект,
	               |	Данные.ДатаПроверкиСтатуса КАК ДатаПроверкиСтатуса,
	               |	ЕСТЬNULL(упоСтатусыПроектов.СтатусПроекта, ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Запланирован)) КАК СтатусПроекта
	               |ПОМЕСТИТЬ ВТ_СтатусПроектовНаДатуИтоговая
	               |ИЗ
	               |	Данные КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыПроектаНаДатуПроверки КАК ВТ_СтатусыПроектаНаДатуПроверки
	               |		ПО Данные.ПроектнаяЗадача = ВТ_СтатусыПроектаНаДатуПроверки.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов КАК упоСтатусыПроектов
	               |		ПО (ВТ_СтатусыПроектаНаДатуПроверки.Проект = упоСтатусыПроектов.Проект)
	               |			И (ВТ_СтатусыПроектаНаДатуПроверки.ПериодСтатусаПроектаНаДату = упоСтатусыПроектов.Период)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СтатусПроектовНаДатуИтоговая.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_СтатусПроектовНаДатуИтоговая.Проект КАК Проект,
	               |	ВТ_СтатусПроектовНаДатуИтоговая.СтатусПроекта КАК СтатусПроекта
	               |ПОМЕСТИТЬ ВТ_ПроектыСОтборомПоСтатусам
	               |ИЗ
	               |	ВТ_СтатусПроектовНаДатуИтоговая КАК ВТ_СтатусПроектовНаДатуИтоговая
	               |ГДЕ
	               |	ВТ_СтатусПроектовНаДатуИтоговая.СтатусПроекта В(&Статусы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПроектыСОтборомПоСтатусам.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_ПроектыСОтборомПоСтатусам.Проект КАК Проект,
	               |	ВТ_ПроектыСОтборомПоСтатусам.СтатусПроекта КАК СтатусПроекта
	               |ИЗ
	               |	ВТ_ПроектыСОтборомПоСтатусам КАК ВТ_ПроектыСОтборомПоСтатусам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК упоРуководителиПроектов
	               |		ПО ВТ_ПроектыСОтборомПоСтатусам.Проект = упоРуководителиПроектов.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК упоНастройкаАналитикиВРазрезеПодразделений
	               |		ПО ВТ_ПроектыСОтборомПоСтатусам.Проект = упоНастройкаАналитикиВРазрезеПодразделений.Объект";
	
	Статусы = Новый Массив;
	
	Если СтрокаСтатусов = "Остановлен" Тогда
		Статусы.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Остановлен);
		
		ТекстУсловия = "
			|ГДЕ
			|	(НЕ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
			|			ИЛИ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
			|				И упоРуководителиПроектов.РуководительПроекта <> &Сотрудник)";
		
	ИначеЕсли СтрокаСтатусов = "ЗапланированУтвержден" Тогда
		Статусы.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Запланирован);
		Статусы.Добавить(Перечисления.упоСостояниеСтатусаПроекта.Утвержден);
		
		ТекстУсловия = "
			|ГДЕ
			|	(НЕ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден)";
		
	Иначе
		ТекстИсключения = НСтр("ru = 'Передана строка статусов, для которой не предусмотрена обработка.'");
		ВызватьИсключение(ТекстИсключения);
		
	КонецЕсли;
	
	ЧастиТекстаЗапроса = Новый Массив;
	ЧастиТекстаЗапроса.Добавить(ТекстЗапроса);
	ЧастиТекстаЗапроса.Добавить(ТекстУсловия);
	
	Запрос.Текст = СтрСоединить(ЧастиТекстаЗапроса, Символы.ПС);	
	Запрос.УстановитьПараметр("ДанныеПроверки", ДанныеПроверки);
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.Параметры.Вставить("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ШаблонТекста = НСтр("ru = 'По проектной задаче %1 нельзя вносить изменения фактических трудозатрат, т.к. проект находится в статусе ""%2"".'");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяЗадачи = упоПроектыИЗадачиСервер.НазваниеПроектнойЗадачи(Выборка.ПроектнаяЗадача, Истина);
		ТекстСообщения = СтрШаблон(ШаблонТекста, ИмяЗадачи, Выборка.СтатусПроекта);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

// Получить таблицу распределения по периодам сводно
//
// Параметры:
//  ПериодАгрегации - ПеречислениеСсылка.упоПериодыАгрегацииЗатрат	 -  период агрегации
//  Дата		 - Дата	 		- дата периода
//  Сумма		 - Число	 	- сумма
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица результат
//
Функция ПолучитьТаблицуРаспределенияПоПериодамСводно(ПериодАгрегации, Дата, Сумма) Экспорт 
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Период");
	Результат.Колонки.Добавить("Сумма");
	
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.Период = КонецПериодаАгрегации(Дата, ПериодАгрегации);
	НоваяСтрока.Сумма = Сумма;
	
	Возврат Результат;
	
КонецФункции

// Заполняет план расходов по трудовым ресурсам.
// Вызывается интерактивно по команде заполнения в формах проектной задачи.
//
// Параметры:
//  Проект                                  - СправочникСсылка.Проекты
//  ПроектнаяЗадача                         - ДокументСсылка.упоПроектнаяЗадача
//  ТаблицаТрудовыеРесурсы                  - ТаблицаЗначений
//  ТаблицаТрудовыеРесурсыПоПериодам        - ТаблицаЗначений
//  ТаблицаПланРасходов                     - ТаблицаЗначений
//  ТаблицаРаспределениеРасходов            - ТаблицаЗначений, ДанныеФормыКоллекция
//  СтартовыйИндекс                         - Число - стартовый индекс распределения строк плана расходов.
//  СвернутьПоСтатьям                       - Булево - определяет, сворачивать ли основную ТЧ плана расходов по статьям.
//  УчитыватьПериодРегистрацииНормСтоимости - Булево
//
Процедура ЗаполнитьПланРасходовПоТрудовымРесурсам(Проект, ПроектнаяЗадача,
		ТаблицаТрудовыеРесурсы,
		ТаблицаТрудовыеРесурсыПоПериодам,
		ТаблицаПланРасходов,
		ТаблицаРаспределениеРасходов,
		СтартовыйИндекс = Неопределено,
		СвернутьПоСтатьям = Истина,
		УчитыватьПериодРегистрацииНормСтоимости = Ложь) Экспорт
	
	ЗначенияПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);
	ДатыПроектнойЗадачи = упоПроектыИЗадачиСервер.ПолучитьСрокиПроектнойЗадачи(ПроектнаяЗадача);
	ВнутренняяНормаСтоимости = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача,
			"НормаСтоимостиТрудовыхРесурсов");
	
	Если НЕ ЗначениеЗаполнено(ВнутренняяНормаСтоимости) Тогда
		ТекстСообщения = НСтр("ru = 'В настройках задачи %1 не указана внутренняя норма стоимости трудовых ресурсов.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаТрудовыеРесурсыДляЗаполненияПланаРасходов());
	Если УчитыватьПериодРегистрацииНормСтоимости Тогда
		ПараметрыОтбора = Новый Структура("УровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
		ЕстьДанныеОкончательногоУровняПланирования = ЗначениеЗаполнено(ТаблицаТрудовыеРесурсы.НайтиСтроки(ПараметрыОтбора));
		УровеньПланированияТрудозатрат = ?(ЕстьДанныеОкончательногоУровняПланирования,
				Перечисления.упоУровеньПланирования.Окончательный, Перечисления.упоУровеньПланирования.Предварительный);
		
		ТаблицаТрудозатратПоДням = ТаблицаСтоимостиТрудозатратПоДнямСУчетомПериодаНормСтоимости(ПроектнаяЗадача,
				УровеньПланированияТрудозатрат);
	Иначе
		ТаблицаТрудозатратПоДням = ТаблицаТрудозатратПоДнямДляРучногоЗаполненияПланаРасходов(Проект,
				ПроектнаяЗадача, ТаблицаТрудовыеРесурсы, ТаблицаТрудовыеРесурсыПоПериодам);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТрудозатратыПоДням", ТаблицаТрудозатратПоДням);
	
	ТаблицаРаспределениеПоСтатьям = Запрос.Выполнить().Выгрузить();
	СвернутьТаблицуПоПериодуАгрегацииДляЗаполненияПланаРасходов(ТаблицаРаспределениеПоСтатьям,
		ДатыПроектнойЗадачи.ДатаЗавершенияПлан);
	
	ЗаполнитьПланРасходовТрудовымиРесурсами(ТаблицаПланРасходов, ТаблицаРаспределениеПоСтатьям,
		ТаблицаТрудозатратПоДням, ЗначенияПоУмолчанию);
	Если СвернутьПоСтатьям Тогда
		ТаблицаПланРасходов.Свернуть("Статья, Валюта, ИндексСтрокРаспределения, ПрофильРаспределения, СпособПривязки,
			| ИсточникПлана, ПериодАгрегации, ДатаПривязки, Контрагент, Договор", "Сумма");
	КонецЕсли;
	
	//Заполнение распределения.
	ЗаполнитьРаспределениеПланаРасходовЗаполненногоПоТрудовымРесурсам(СтартовыйИндекс, Проект, ЗначенияПоУмолчанию,
		ТаблицаПланРасходов, ТаблицаРаспределениеРасходов, ТаблицаРаспределениеПоСтатьям, СвернутьПоСтатьям);
	
КонецПроцедуры

// Проверяет возможность списания фактических трудозатрат за период
// по задачам проекта в статусе остановлен.
//
// Параметры:
//	ДанныеПроверки	- ТаблицаЗначений - проектные задачи для проверки.
//	НачалоПериода	- Дата - дата начала периода.
//	КонецПериода	- Дата - дата конца периода.
//  Отказ			- Булево - признак отказа.
//
Процедура ПроверитьВозможностьСписанияФактическихЗатратПоОстановленнымПроектамЗаПериод(ДанныеПроверки,
	НачалоПериода, КонецПериода, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
		|	ДанныеПроверки.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ДанныеПроверки.Проект КАК Проект
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	&ДанныеПроверки КАК ДанныеПроверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Данные.Проект КАК Проект
		|ПОМЕСТИТЬ ВТ_ПроектыОстановленыНаНачалоПериода
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(&НачалоПериода, ) КАК упоСтатусыПроектовСрезПоследних
		|		ПО Данные.Проект = упоСтатусыПроектовСрезПоследних.Проект
		|ГДЕ
		|	упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Данные.Проект КАК Проект,
		|	упоСтатусыПроектов.СтатусПроекта КАК СтатусПроекта,
		|	МАКСИМУМ(упоСтатусыПроектов.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПроектыОстановленыВТечениеПериода
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов КАК упоСтатусыПроектов
		|		ПО Данные.Проект = упоСтатусыПроектов.Проект
		|ГДЕ
		|	упоСтатусыПроектов.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
		|	И упоСтатусыПроектов.Период >= &НачалоПериода
		|	И упоСтатусыПроектов.Период <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.ПроектнаяЗадача,
		|	Данные.Проект,
		|	упоСтатусыПроектов.СтатусПроекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПроектыОстановленыВТечениеПериода.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	ВТ_ПроектыОстановленыВТечениеПериода.Проект КАК Проект
		|ПОМЕСТИТЬ ВТ_ПроектыОстановлены
		|ИЗ
		|	ВТ_ПроектыОстановленыВТечениеПериода КАК ВТ_ПроектыОстановленыВТечениеПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПроектыОстановленыНаНачалоПериода.ПроектнаяЗадача,
		|	ВТ_ПроектыОстановленыНаНачалоПериода.Проект
		|ИЗ
		|	ВТ_ПроектыОстановленыНаНачалоПериода КАК ВТ_ПроектыОстановленыНаНачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПроектыОстановлены.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	упоРуководителиПроектов.РуководительПроекта КАК РуководительПроекта,
		|	упоСвойстваПЗ.НазваниеЗадачи КАК НазваниеЗадачи
		|ИЗ
		|	ВТ_ПроектыОстановлены КАК ВТ_ПроектыОстановлены
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних(, ) КАК упоРуководителиПроектов
		|		ПО ВТ_ПроектыОстановлены.Проект = упоРуководителиПроектов.Проект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК упоНастройкаАналитикиВРазрезеПодразделений
		|		ПО ВТ_ПроектыОстановлены.Проект = упоНастройкаАналитикиВРазрезеПодразделений.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПЗ
		|		ПО ВТ_ПроектыОстановлены.ПроектнаяЗадача = упоСвойстваПЗ.ПроектнаяЗадача
		|ГДЕ
		|	(НЕ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
		|			ИЛИ упоНастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
		|				И НЕ упоРуководителиПроектов.РуководительПроекта В (&СписокСотрудников))";
	
	СписокСотрудниковДиспетчера = упоИерархияИПолномочияВызовСервера.обПолучитьСписокСотрудниковДиспетчера(
		ПараметрыСеанса.ТекущийПользователь);

	Запрос.УстановитьПараметр("ДанныеПроверки", ДанныеПроверки);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудниковДиспетчера);
	Запрос.УстановитьПараметр("НачалоПериода", КонецДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
			
	НазванияПроектныхЗадач = Новый Массив;	
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НазванияПроектныхЗадач.Добавить(Выборка.НазваниеЗадачи);
	КонецЦикла;	
		
	Если ЗначениеЗаполнено(НазванияПроектныхЗадач) Тогда				

		Отказ = Истина;
		
		ШаблонСообщения = НСтр("ru = 'Проект находился в статусе ""Остановлен"" в заданном отчетном периоде, '")
			+ НСтр("ru = 'нельзя списывать фактические трудозатраты по задачам:
        	|%1'");

		ПроектныеЗадачиСтрокой = СтрСоединить(НазванияПроектныхЗадач, Символы.ПС);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ПроектныеЗадачиСтрокой);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура упоОтражениеПлановыхТрудозатратЗадач() Экспорт
		
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.упоОтражениеПлановыхТрудозатратЗадач);
	
	ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеРабочихЗаданий

Процедура ДобавитьВЗапросВременнуюТаблицуПоручения(Запрос, СтруктураПараметров)

	ТекстЗапроса = "
	|;
	|
	|//////////////////////////////////////////////////////////////////////
	|
	|"
	+ "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
      | упоРолиТрудовыхРесурсовСрезПоследних.Роль КАК Роль,
      | ЕСТЬNULL(упоСоставПодразделенийСрезПоследних.Подразделение, ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)) КАК Подразделение,
      | упоРолиТрудовыхРесурсовСрезПоследних.Ресурс КАК Ресурс
      |ПОМЕСТИТЬ втРольРесурса
      |ИЗ
      | РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(, Ресурс = &Исполнитель) КАК упоРолиТрудовыхРесурсовСрезПоследних
      |     ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоставПодразделений.СрезПоследних КАК упоСоставПодразделенийСрезПоследних
      |     ПО упоРолиТрудовыхРесурсовСрезПоследних.Роль = упоСоставПодразделенийСрезПоследних.Роль
      |         И (упоСоставПодразделенийСрезПоследних.ВходитВСостав)
      |ГДЕ
      | упоРолиТрудовыхРесурсовСрезПоследних.РольНазначена
      |
      |УПОРЯДОЧИТЬ ПО
      |	упоРолиТрудовыхРесурсовСрезПоследних.Период УБЫВ
      |;
      |
      |////////////////////////////////////////////////////////////////////////////////
      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
      | упоЗадания.ПроектнаяЗадача КАК РабочееЗадание,
      | упоЗадания.Задание КАК Задание,
      | упоЗадания.Проект КАК Проект,
      | упоЗадания.ДатаНачала КАК ДатаНачала,
      | ВЫБОР
      |     КОГДА НЕ ОстановленныеПроектыСПравомНаСписание.Проект ЕСТЬ NULL
      |         ТОГДА упоЗадания.ДатаОкончания
      |     КОГДА упоЗадания.ДатаОкончания >= ВТ_ДатыОстановкиПроектов.Период
      |         ТОГДА ВТ_ДатыОстановкиПроектов.Период
      |     ИНАЧЕ упоЗадания.ДатаОкончания
      | КОНЕЦ КАК ДатаОкончания,
      | ИСТИНА КАК ЭтоПроектнаяЗадача,
      | ВЫБОР
      |     КОГДА упоЗадания.Роль = ЗНАЧЕНИЕ(Справочник.упоРоли.ПустаяСсылка)
      |         ТОГДА ЕСТЬNULL(ВременнаяТаблица_РабочиеЗадания.РольРесурса, втРольРесурса.Роль)
	  |     ИНАЧЕ упоЗадания.Роль
      | КОНЕЦ КАК РольРесурса,
      | ВЫБОР
      |     КОГДА упоЗадания.Подразделение = ЗНАЧЕНИЕ(Справочник.упоПодразделения.ПустаяСсылка)
      |         ТОГДА ЕСТЬNULL(ВременнаяТаблица_РабочиеЗадания.Подразделение, втРольРесурса.Подразделение)
	  |     ИНАЧЕ упоЗадания.Подразделение
      | КОНЕЦ КАК Подразделение
      |ПОМЕСТИТЬ втЗадания
      |ИЗ
      | втОткрытыеПоручения КАК упоЗадания
      |     ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица_РабочиеЗадания КАК ВременнаяТаблица_РабочиеЗадания
      |     ПО упоЗадания.ПроектнаяЗадача = ВременнаяТаблица_РабочиеЗадания.РабочееЗадание
      |     ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних КАК СтатусыПроектныхЗадач
      |         ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
      |         ПО СтатусыПроектныхЗадач.Версия = упоВерсииПроекта.Версия
      |             И (упоВерсииПроекта.Текущая)
      |         ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних КАК упоСвойстваПроектныхЗадачСрезПоследних
      |         ПО СтатусыПроектныхЗадач.Версия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
      |             И СтатусыПроектныхЗадач.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
      |             И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
      |     ПО упоЗадания.ПроектнаяЗадача = СтатусыПроектныхЗадач.ПроектнаяЗадача
      |     ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК СтатусыПроектов
      |     ПО упоЗадания.Проект = СтатусыПроектов.Проект
      |     ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстановленныеПроектыСПравомНаСписание КАК ОстановленныеПроектыСПравомНаСписание
      |     ПО упоЗадания.Проект = ОстановленныеПроектыСПравомНаСписание.Проект
      |     ЛЕВОЕ СОЕДИНЕНИЕ втРольРесурса КАК втРольРесурса
      |     ПО (ИСТИНА)
      |     ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыОстановкиПроектов КАК ВТ_ДатыОстановкиПроектов
      |     ПО упоЗадания.Проект = ВТ_ДатыОстановкиПроектов.Проект
      |ГДЕ
      | СтатусыПроектныхЗадач.СтатусЗадачи В(&СписокСтатусовПЗ)
      | И (СтатусыПроектов.СтатусПроекта В (&СписокСтатусовПроектов)
      |         ИЛИ НЕ ОстановленныеПроектыСПравомНаСписание.Проект ЕСТЬ NULL)";	
	
	Запрос.Текст = Запрос.Текст + ТекстЗапроса;

КонецПроцедуры

Процедура ДополнитьТекстЗапросаПроектныеЗадачи(ТекстЗапроса, ВставитьРазделитель, ИсключитьЗадачиСЗаданиями = Ложь)

	Если ВставитьРазделитель Тогда
		ВставитьРазделитьВТекстЗапроса(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ВременнаяТаблица_РабочиеЗадания.РабочееЗадание,
	|   ЗНАЧЕНИЕ(Справочник.упоЗадания.ПустаяСсылка) КАК Задание,
	|	ВременнаяТаблица_РабочиеЗадания.Проект,
	|	ВременнаяТаблица_РабочиеЗадания.ДатаНачала,
	|	ВременнаяТаблица_РабочиеЗадания.ДатаЗавершения КАК ДатаОкончания,
	|	ВременнаяТаблица_РабочиеЗадания.ЭтоПроектнаяЗадача,
	|	ВременнаяТаблица_РабочиеЗадания.РольРесурса,
	|	ВременнаяТаблица_РабочиеЗадания.Подразделение
	|ИЗ
	|	ВременнаяТаблица_РабочиеЗадания КАК ВременнаяТаблица_РабочиеЗадания";
	
	Если ИсключитьЗадачиСЗаданиями Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ВременнаяТаблица_РабочиеЗадания.РабочееЗадание НЕ В (ВЫБРАТЬ 
		|															втЗадания.РабочееЗадание
		|														ИЗ
		|															втЗадания КАК втЗадания
		|														ГДЕ
		|															втЗадания.Задание.ЭтоЗаданиеИсполнителяПроектнойЗадачи)
		|";
		
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьТекстЗапросаПоручения(ТекстЗапроса, ВставитьРазделитель)
	
	Если ВставитьРазделитель Тогда
		ВставитьРазделитьВТекстЗапроса(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	втЗадания.РабочееЗадание,
		|	втЗадания.Задание,
		|	втЗадания.Проект,
		|	втЗадания.ДатаНачала,
		|	втЗадания.ДатаОкончания,
		|	втЗадания.ЭтоПроектнаяЗадача,
		|	втЗадания.РольРесурса,
		|	втЗадания.Подразделение
		|ИЗ
		|	втЗадания КАК втЗадания";
	
КонецПроцедуры

Процедура ВставитьРазделитьВТекстЗапроса(ТекстЗапроса)

	ТекстЗапроса = ТекстЗапроса + "
		|;
		|////////////////////////////////////////////////////////////////////
		|";	

КонецПроцедуры

// Получает запрос по рабочим заданиям трудового ресурса за период.
//
// Параметры:
//  СтруктураПараметров - Структура - Ключи:
//				   * ТрудовойРесурс.
//				   * НачалоПериода.
//				   * КонецПериода.
// 
Функция ПолучитьЗапросРабочиеЗадания(СтруктураПараметров) 
	
	СписокСтатусовПЗ = Новый Массив();
	СписокСтатусовПЗ.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаЗадачи.Запланирована"));
	СписокСтатусовПЗ.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаЗадачи.Выполняется"));
	
	СписокСтатусовПроектовНаТекущуюДату = Новый Массив();
	СписокСтатусовПроектовНаТекущуюДату.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаПроекта.Запланирован"));
	СписокСтатусовПроектовНаТекущуюДату.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаПроекта.Выполняется"));
	СписокСтатусовПроектовНаТекущуюДату.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаПроекта.Утвержден"));
	СписокСтатусовПроектовНаТекущуюДату.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаПроекта.Остановлен"));
	
	СписокСтатусовЗаданий = Новый Массив();
	СписокСтатусовЗаданий.Добавить(Перечисления.упоСтатусыЗаданий.Выдано);
	СписокСтатусовЗаданий.Добавить(Перечисления.упоСтатусыЗаданий.Выполняется);	
	СписокСтатусовЗаданий.Добавить(Перечисления.упоСтатусыЗаданий.Уточняется);
	СписокСтатусовЗаданий.Добавить(Перечисления.упоСтатусыЗаданий.Завершено);

	Если Константы.упоРазрешитьРаспределениеРабочегоВремениПоЗакрытымЗадачам.Получить() Тогда
		СписокСтатусовПЗ.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаЗадачи.Завершена"));
		СписокСтатусовЗаданий.Добавить(Перечисления.упоСтатусыЗаданий.Закрыто);
		Если Не Константы.упоСтрогийКонтрольИзмененияЗакрытыхЭтапов.Получить() Тогда
			СписокСтатусовПЗ.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта"));
		КонецЕсли;	
	КонецЕсли;
		
	временныеТаблицы = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = временныеТаблицы;
	
	Запрос.Параметры.Вставить("Исполнитель"		, СтруктураПараметров.ТрудовойРесурс);
	Запрос.Параметры.Вставить("ДатаНачала"		, СтруктураПараметров.НачалоПериода);
	Запрос.Параметры.Вставить("ДатаЗавершения"	, КонецДня(СтруктураПараметров.КонецПериода));
	Запрос.Параметры.Вставить("СписокСтатусовПЗ", СписокСтатусовПЗ);
	Запрос.Параметры.Вставить("СписокСтатусовПроектов", СписокСтатусовПроектовНаТекущуюДату);
	Запрос.Параметры.Вставить("ПустаяПроектнаяЗадача", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	Запрос.Параметры.Вставить("УровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
	Запрос.Параметры.Вставить("СотрудникТрудовогоРесурса", 
		упоРесурсыИРолиВызовСервера.обПолучитьТекущегоВладельцаРесурса(СтруктураПараметров.ТрудовойРесурс));
	Запрос.УстановитьПараметр("ПустойПроект", Справочники.Проекты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидЗаданияПоручение", Справочники.упоВидыЗаданий.Поручение);	
	Запрос.УстановитьПараметр("СписокСтатусовЗаданий", СписокСтатусовЗаданий);	
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	упоФактТрудозатратПоДням.Операция КАК Операция
	|ПОМЕСТИТЬ ВТ_ЗадачиСФактом
	|ИЗ
	|	РегистрСведений.упоФактТрудозатратПоДням КАК упоФактТрудозатратПоДням
	|ГДЕ
	|	упоФактТрудозатратПоДням.Ресурс = &Исполнитель
	|	И упоФактТрудозатратПоДням.УровеньПланирования = &УровеньПланирования
	|	И упоФактТрудозатратПоДням.День >= &ДатаНачала
	|	И упоФактТрудозатратПоДням.День <= &ДатаЗавершения
	|	И упоФактТрудозатратПоДням.Трудозатраты <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РесурсыПроекта.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	РесурсыПроекта.РольРесурса КАК РольРесурса,
	|	РесурсыПроекта.Подразделение КАК Подразделение,
	|	РесурсыПроекта.Проект КАК Проект,
	|	Версии.Версия КАК ТекущаяВерсия
	|ПОМЕСТИТЬ ВТ_НазначенныеПЗДоОтбораПоОтмененным
	|ИЗ
	|	РегистрСведений.упоВерсииПроекта КАК Версии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	|				,
	|				Ресурс = &Исполнитель
	|					И НЕ ПроектнаяЗадача = ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка)) КАК РесурсыПроекта
	|		ПО (РесурсыПроекта.Версия = Версии.Версия)
	|			И (Версии.Текущая)
	|			И (РесурсыПроекта.РесурсВыделен)
	|ГДЕ
	|	НЕ Версии.Проект.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_НазначенныеПЗДоОтбораПоОтмененным.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ_НазначенныеПЗДоОтбораПоОтмененным.РольРесурса КАК РольРесурса,
	|	ВТ_НазначенныеПЗДоОтбораПоОтмененным.Подразделение КАК Подразделение,
	|	ВТ_НазначенныеПЗДоОтбораПоОтмененным.Проект КАК Проект,
	|	ВТ_НазначенныеПЗДоОтбораПоОтмененным.ТекущаяВерсия КАК ТекущаяВерсия
	|ПОМЕСТИТЬ ВТ_НазначенныеПЗ
	|ИЗ
	|	ВТ_НазначенныеПЗДоОтбораПоОтмененным КАК ВТ_НазначенныеПЗДоОтбораПоОтмененным
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|				,
	|				(Версия, ПроектнаяЗадача) В
	|					(ВЫБРАТЬ
	|						ВТ_НазначенныеПЗДоОтбораПоОтмененным.ТекущаяВерсия,
	|						ВТ_НазначенныеПЗДоОтбораПоОтмененным.ПроектнаяЗадача
	|					ИЗ
	|						ВТ_НазначенныеПЗДоОтбораПоОтмененным)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ПО ВТ_НазначенныеПЗДоОтбораПоОтмененным.ТекущаяВерсия = упоСвойстваПроектныхЗадачСрезПоследних.Версия
	|			И ВТ_НазначенныеПЗДоОтбораПоОтмененным.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_НазначенныеПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ВТ_НазначенныеПЗ.РольРесурса КАК РольРесурса,
	|	ВТ_НазначенныеПЗ.Подразделение КАК Подразделение,
	|	ВТ_НазначенныеПЗ.Проект КАК Проект,
	|	ВТ_НазначенныеПЗ.ТекущаяВерсия КАК ТекущаяВерсия,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан
	|ПОМЕСТИТЬ ВТ_НазначенныеЗадачиСоСроками
	|ИЗ
	|	ВТ_НазначенныеПЗ КАК ВТ_НазначенныеПЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	|				,
	|				(Версия, ПроектнаяЗадача) В
	|					(ВЫБРАТЬ
	|						ВТ_НазначенныеПЗ.ТекущаяВерсия,
	|						ВТ_НазначенныеПЗ.ПроектнаяЗадача
	|					ИЗ
	|						ВТ_НазначенныеПЗ)) КАК упоСрокиПроектныхЗадачСрезПоследних
	|		ПО ВТ_НазначенныеПЗ.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|			И ВТ_НазначенныеПЗ.ТекущаяВерсия = упоСрокиПроектныхЗадачСрезПоследних.Версия
	|			И (упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан <= &ДатаЗавершения)
	|			И (упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан >= &ДатаНачала)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу КАК ПроектнаяЗадача,
	|	упоЗадания.Проект КАК Проект,
	|	упоЗадания.Ссылка КАК Задание,
	|	упоЗадания.Роль КАК Роль,
	|	упоЗадания.Подразделение КАК Подразделение,
	|	упоСрокиЗаданий.ДатаНачалаПлан КАК ДатаНачала,
	|	упоСрокиЗаданий.ДатаОкончанияПлан КАК ДатаОкончания
	|ПОМЕСТИТЬ втОткрытыеПоручения
	|ИЗ
	|	Справочник.упоЗадания КАК упоЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	|		ПО (упоСрокиЗаданий.Задание = упоЗадания.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоЗаданияСтатусы.СрезПоследних КАК упоЗаданияСтатусыСрезПоследних
	|		ПО упоЗадания.Ссылка = упоЗаданияСтатусыСрезПоследних.Задание
	|ГДЕ
	|	НЕ упоЗадания.ПометкаУдаления
	|	И упоСрокиЗаданий.ДатаНачалаПлан <= &ДатаЗавершения
	|	И упоСрокиЗаданий.ДатаОкончанияПлан >= &ДатаНачала
	|	И упоЗадания.Проект <> &ПустойПроект
	|	И упоЗадания.ВидЗадания = &ВидЗаданияПоручение
	|	И упоЗадания.Исполнитель = &Исполнитель
	|	И упоЗадания.ПроектнаяЗадача <> &ПустойПроект
	|	И упоЗаданияСтатусыСрезПоследних.Статус В(&СписокСтатусовЗаданий)
	|	И НЕ упоЗадания.Проект.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_НазначенныеЗадачиСоСроками.Проект КАК Проект
	|ПОМЕСТИТЬ ВТ_ОстановленныеПроектыСПравомНаСписание
	|ИЗ
	|	ВТ_НазначенныеЗадачиСоСроками КАК ВТ_НазначенныеЗадачиСоСроками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК НастройкаАналитикиВРазрезеПодразделений
	|		ПО ВТ_НазначенныеЗадачиСоСроками.Проект = НастройкаАналитикиВРазрезеПодразделений.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК СтатусыПроектов
	|		ПО ВТ_НазначенныеЗадачиСоСроками.Проект = СтатусыПроектов.Проект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РуководителиПроектов
	|		ПО ВТ_НазначенныеЗадачиСоСроками.Проект = РуководителиПроектов.Проект
	|ГДЕ
	|	НастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	|	И СтатусыПроектов.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	|	И РуководителиПроектов.РуководительПроекта = &СотрудникТрудовогоРесурса
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втОткрытыеПоручения.Проект
	|ИЗ
	|	втОткрытыеПоручения КАК втОткрытыеПоручения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК НастройкаАналитикиВРазрезеПодразделений
	|		ПО втОткрытыеПоручения.Проект = НастройкаАналитикиВРазрезеПодразделений.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК СтатусыПроектов
	|		ПО втОткрытыеПоручения.Проект = СтатусыПроектов.Проект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РуководителиПроектов
	|		ПО втОткрытыеПоручения.Проект = РуководителиПроектов.Проект
	|ГДЕ
	|	НастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	|	И СтатусыПроектов.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	|	И РуководителиПроектов.РуководительПроекта = &СотрудникТрудовогоРесурса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_НазначенныеПЗ.Проект КАК Проект,
	|	ВЫБОР
	|		КОГДА упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	|			ТОГДА упоСтатусыПроектовСрезПоследних.Период
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Период,
	|	упоСтатусыПроектовСрезПоследних.СтатусПроекта КАК СтатусПроекта
	|ПОМЕСТИТЬ ВТ_ДатыОстановкиПроектов
	|ИЗ
	|	ВТ_НазначенныеПЗ КАК ВТ_НазначенныеПЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(&ДатаЗавершения, ) КАК упоСтатусыПроектовСрезПоследних
	|		ПО ВТ_НазначенныеПЗ.Проект = упоСтатусыПроектовСрезПоследних.Проект
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НазначенныеПЗ.Проект,
	|	упоСтатусыПроектовСрезПоследних.СтатусПроекта,
	|	ВЫБОР
	|		КОГДА упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	|			ТОГДА упоСтатусыПроектовСрезПоследних.Период
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втОткрытыеПоручения.Проект,
	|	ВЫБОР
	|		КОГДА упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	|			ТОГДА упоСтатусыПроектовСрезПоследних.Период
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	упоСтатусыПроектовСрезПоследних.СтатусПроекта
	|ИЗ
	|	втОткрытыеПоручения КАК втОткрытыеПоручения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних(&ДатаЗавершения, ) КАК упоСтатусыПроектовСрезПоследних
	|		ПО втОткрытыеПоручения.Проект = упоСтатусыПроектовСрезПоследних.Проект
	|
	|СГРУППИРОВАТЬ ПО
	|	втОткрытыеПоручения.Проект,
	|	упоСтатусыПроектовСрезПоследних.СтатусПроекта,
	|	ВЫБОР
	|		КОГДА упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	|			ТОГДА упоСтатусыПроектовСрезПоследних.Период
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НазначенныеПЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_НазначенныеЗадачиСоСроками.ПроектнаяЗадача КАК РабочееЗадание,
	|	ВТ_НазначенныеЗадачиСоСроками.Проект КАК Проект,
	|	ВТ_НазначенныеЗадачиСоСроками.РольРесурса КАК РольРесурса,
	|	ВТ_НазначенныеЗадачиСоСроками.Подразделение КАК Подразделение,
	|	ВТ_НазначенныеЗадачиСоСроками.ДатаНачалаПлан КАК ДатаНачала,
	|	ИСТИНА КАК ЭтоПроектнаяЗадача,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОстановленныеПроектыСПравомНаСписание.Проект ЕСТЬ NULL
	|			ТОГДА ВТ_НазначенныеЗадачиСоСроками.ДатаЗавершенияПлан
	|		КОГДА ВТ_НазначенныеЗадачиСоСроками.ДатаЗавершенияПлан >= ВТ_ДатыОстановкиПроектов.Период
	|			ТОГДА ВТ_ДатыОстановкиПроектов.Период
	|		ИНАЧЕ ВТ_НазначенныеЗадачиСоСроками.ДатаЗавершенияПлан
	|	КОНЕЦ КАК ДатаЗавершения
	|ПОМЕСТИТЬ ВременнаяТаблица_РабочиеЗадания
	|ИЗ
	|	ВТ_НазначенныеЗадачиСоСроками КАК ВТ_НазначенныеЗадачиСоСроками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектов.СрезПоследних КАК упоСтатусыПроектовСрезПоследних
	|		ПО ВТ_НазначенныеЗадачиСоСроками.Проект = упоСтатусыПроектовСрезПоследних.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	|				,
	|				(Версия, ПроектнаяЗадача) В
	|					(ВЫБРАТЬ
	|						ВТ_НазначенныеЗадачиСоСроками.ТекущаяВерсия,
	|						ВТ_НазначенныеЗадачиСоСроками.ПроектнаяЗадача
	|					ИЗ
	|						ВТ_НазначенныеЗадачиСоСроками)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	|		ПО ВТ_НазначенныеЗадачиСоСроками.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстановленныеПроектыСПравомНаСписание КАК ВТ_ОстановленныеПроектыСПравомНаСписание
	|		ПО ВТ_НазначенныеЗадачиСоСроками.Проект = ВТ_ОстановленныеПроектыСПравомНаСписание.Проект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадачиСФактом КАК ВТ_ЗадачиСФактом
	|		ПО ВТ_НазначенныеЗадачиСоСроками.ПроектнаяЗадача = ВТ_ЗадачиСФактом.Операция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыОстановкиПроектов КАК ВТ_ДатыОстановкиПроектов
	|		ПО ВТ_НазначенныеЗадачиСоСроками.Проект = ВТ_ДатыОстановкиПроектов.Проект
	|ГДЕ
	|	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи В(&СписокСтатусовПЗ)
	|	И (упоСтатусыПроектовСрезПоследних.СтатусПроекта В (&СписокСтатусовПроектов)
	|			ИЛИ НЕ ВТ_ОстановленныеПроектыСПравомНаСписание.Проект ЕСТЬ NULL
	|			ИЛИ НЕ ВТ_ЗадачиСФактом.Операция ЕСТЬ NULL
	|				И (ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Завершена) В (&СписокСтатусовПЗ)
	|					ИЛИ ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаЗадачи.Закрыта) В (&СписокСтатусовПЗ)))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НазначенныеЗадачиСоСроками.ПроектнаяЗадача,
	|	ВТ_НазначенныеЗадачиСоСроками.Проект,
	|	ВТ_НазначенныеЗадачиСоСроками.РольРесурса,
	|	ВТ_НазначенныеЗадачиСоСроками.Подразделение,
	|	ВТ_НазначенныеЗадачиСоСроками.ДатаНачалаПлан,
	|	ВТ_НазначенныеЗадачиСоСроками.ДатаЗавершенияПлан,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОстановленныеПроектыСПравомНаСписание.Проект ЕСТЬ NULL
	|			ТОГДА ВТ_НазначенныеЗадачиСоСроками.ДатаЗавершенияПлан
	|		КОГДА ВТ_НазначенныеЗадачиСоСроками.ДатаЗавершенияПлан >= ВТ_ДатыОстановкиПроектов.Период
	|			ТОГДА ВТ_ДатыОстановкиПроектов.Период
	|		ИНАЧЕ ВТ_НазначенныеЗадачиСоСроками.ДатаЗавершенияПлан
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НазначенныеЗадачиСоСроками";

	Возврат Запрос;
	
КонецФункции

// Добавляет текст запроса по поручениям и устанавливает необходимые параметры.
//
// Параметры:
//	Запрос	- Запрос.
//	Отказ	- Булево - признак отказа.
Процедура ДополнитьЗапросПроектныеЗадачиИПоручения(Запрос, СтруктураПараметров, Отказ)
	
	ВариантРаспределения = Константы.упоВариантРаспределенияРабочегоВремени.Получить();
	
	ПравилоЗаполнения = Константы.упоПравилоРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи.Получить();
	Если ПравилоЗаполнения = Перечисления.упоПравилаРаспределенияРабочегоВремениНаЗаданияИПроектныеЗадачи.НеРаспределятьНаЗадачиПоКоторымЕстьЗадания Тогда
		ИсключитьЗадачиСЗаданиями = Истина;
	Иначе
		ИсключитьЗадачиСЗаданиями = Ложь;
	КонецЕсли;
	
	Если ВариантРаспределения = Перечисления.упоВариантыРаспределенияРабочегоВремени.ПоЗаданиямИПроектнымЗадачам Тогда
		
		ДобавитьВЗапросВременнуюТаблицуПоручения(Запрос, СтруктураПараметров);
		ДополнитьТекстЗапросаПоручения(Запрос.Текст, Истина);
		Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		ДополнитьТекстЗапросаПроектныеЗадачи(Запрос.Текст, Ложь, ИсключитьЗадачиСЗаданиями);
		
	ИначеЕсли ВариантРаспределения = Перечисления.упоВариантыРаспределенияРабочегоВремени.ТолькоПоЗаданиям Тогда
		ДобавитьВЗапросВременнуюТаблицуПоручения(Запрос, СтруктураПараметров);
		ДополнитьТекстЗапросаПоручения(Запрос.Текст, Истина);
		
	ИначеЕсли ВариантРаспределения = Перечисления.упоВариантыРаспределенияРабочегоВремени.ТолькоПоПроектнымЗадачам Тогда
		ДополнитьТекстЗапросаПроектныеЗадачи(Запрос.Текст, Истина);
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Нстр("ru = 'Не задано значение константы ""Вариант распределения рабочего времени""!'");
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Отражение

Процедура лОтразитьПлановыеТрудозатратыЗадачи(Предмет,
									   		НезаписанныеСрокиЗадач = Неопределено,
											НезаписанныеДанныеЗадач = Неопределено,
											ДвиженияДокумента = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//
	
	Если ТипЗнч(Предмет) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Если Не ЗначениеЗаполнено(Предмет) Тогда
			Возврат;
		КонецЕсли;
		МассивЗадач = Новый Массив;
		МассивЗадач.Добавить(Предмет);
	ИначеЕсли ТипЗнч(Предмет) = Тип("Массив") Тогда
		МассивЗадач = Предмет;
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректный тип задачи для отражения плановых трудозатрат.'");
	КонецЕсли;
	
	//
	
	МассивНаборовЗаписей = Новый Массив;
	СоответствиеДанныхПроектов = Новый Соответствие;
	ЕстьУчетПериодаРегистрацииНормСтоимости = Ложь;
	ПроектыСНастройкойУчетПериодаРегистрации = Новый Массив;
	
	//
	
	НаборЗаписей_упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия 
		= РегистрыСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.СоздатьНаборЗаписей();
	упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям_Пустая 
		= НаборЗаписей_упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Выгрузить();
	
	//
	
	Если НезаписанныеДанныеЗадач = Неопределено Тогда
		СтруктураНеобходимыхДанных = 
			Новый Структура("ДанныеЗадачи, ТрудовыеРесурсыТЧ, ТрудовыеРесурсыПоПериодам, ПланРасходовТЧ");
		ТаблицаДанных = 
			упоПроектыИЗадачиВызовСервера.обПолучитьДанныеПроектнойЗадачи(МассивЗадач, СтруктураНеобходимыхДанных);
		КоллекцияДанныхЗадач = ТаблицаДанных;
	Иначе
		КоллекцияДанныхЗадач = МассивЗадач;
	КонецЕсли;
	
	СоответствиеСтруктурНастроекПроектов = Новый Соответствие;
	МассивЗадачДляРасчетаНормыПоПериодам = Новый Массив;
	МассивЗадачДляРасчетаНормыСрезПоследних = Новый Массив;
	НезаписанныеТрудовыеРесурсы = Новый Массив;
	Для Каждого ТекЗадача Из КоллекцияДанныхЗадач Цикл
		
		Если НезаписанныеДанныеЗадач = Неопределено Тогда
			
			ПроектЗадачи = ТекЗадача.ДанныеЗадачи.Проект;
			ПроектнаяЗадача = ТекЗадача.ДанныеЗадачи.Ссылка;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				НезаписанныеТрудовыеРесурсы, 
				ТекЗадача.ДанныеЗадачи.ТрудовыеРесурсыТЧ.ВыгрузитьКолонку("Ресурс"), 
				Истина);
				
		Иначе
				
			ДанныеЗадачи = НезаписанныеДанныеЗадач.Получить(ТекЗадача);
			ПроектЗадачи = ДанныеЗадачи.Проект;
			ПроектнаяЗадача = ТекЗадача;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				НезаписанныеТрудовыеРесурсы, 
				ДанныеЗадачи.ТрудовыеРесурсы.ВыгрузитьКолонку("Ресурс"),
				Истина);
				
		КонецЕсли;
			
		СтруктураНастроекПроекта = СоответствиеСтруктурНастроекПроектов.Получить(ПроектЗадачи);
		Если СтруктураНастроекПроекта = Неопределено Тогда
			СтруктураНастроекПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ПроектЗадачи);
			СоответствиеСтруктурНастроекПроектов.Вставить(ПроектЗадачи, СтруктураНастроекПроекта);
			Если СтруктураНастроекПроекта.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда
				ЕстьУчетПериодаРегистрацииНормСтоимости = Истина;
				ПроектыСНастройкойУчетПериодаРегистрации.Добавить(ПроектЗадачи);
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураНастроекПроекта.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда
			МассивЗадачДляРасчетаНормыПоПериодам.Добавить(ПроектнаяЗадача);
		Иначе
			МассивЗадачДляРасчетаНормыСрезПоследних.Добавить(ПроектнаяЗадача);
		КонецЕсли;
				
	КонецЦикла;
	
	Результат = ТаблицыСтоимости(МассивЗадачДляРасчетаНормыСрезПоследних, 
		МассивЗадачДляРасчетаНормыПоПериодам, 
		НезаписанныеТрудовыеРесурсы);
	ТаблицаСтоимостиПоНорме 			= Результат.ТаблицаСтоимостиПоНорме;
	ТаблицаСтоимостиПоНормеПоПериодам 	= Результат.ТаблицаСтоимостиПоНормеПоПериодам;

	ДанныеЗаполнения = Новый Структура("Период, ВидОбъема, ВидЭлемента, ИсточникПлана", 
		  ТекущаяДатаСеанса(), 
		  Перечисления.упоВидЭлементаОбъемов.Расход, 
		  Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход,
		  Перечисления.упоИсточникПланаДоходовИРасходов.Трудозатраты);
	упоДанныеПлановТрудозатратРолейИтоговая = Неопределено;
	
	// Кешируем шаблоны таблиц и вспомогательные данные.
	ДанныеШаблоновТрансляции = Новый Структура;
	ДанныеШаблоновТрансляции.Вставить("Тип_ВидЭлементаПланаДоходовИРасходов", 
		Новый ОписаниеТипов("ПеречислениеСсылка.упоВидЭлементаПланаДоходовИРасходов"));
	ДанныеШаблоновТрансляции.Вставить("ШаблоныАктуализацииДДССформированы", Ложь);
	ДанныеШаблоновТрансляции.Вставить("ШаблонПланаДДС");
	ДанныеШаблоновТрансляции.Вставить("ШаблонАктуальныеПланыДДС");
	ДанныеШаблоновТрансляции.Вставить("ШаблонТаблицыРасходов");
	
	ПараметрыДопФункциональности = ПараметрыДопФункциональности();
	
	// Основной цикл обработки.
	
	Для Каждого ТекЗадача Из КоллекцияДанныхЗадач Цикл
		
		Если НезаписанныеДанныеЗадач = Неопределено Тогда;
			
			ДанныеЗадачи = ТекЗадача.ДанныеЗадачи;
			
			ПроектнаяЗадача = ДанныеЗадачи.Ссылка;
			ДатаНач = ДанныеЗадачи.Сроки.НачалоПлан;
			ДатаКон = ДанныеЗадачи.Сроки.ЗавершениеПлан;
			
			ТрудовыеРесурсыТЧ = ДанныеЗадачи.ТрудовыеРесурсыТЧ.Скопировать();
			
		Иначе
			
			ДанныеЗадачи = НезаписанныеДанныеЗадач.Получить(ТекЗадача);
			
			ПроектнаяЗадача = ТекЗадача;
			ДатаНач = ДанныеЗадачи.ДатаНачалаПлан;
			ДатаКон = ДанныеЗадачи.ДатаЗавершенияПлан;
			
			ТрудовыеРесурсыТЧ = ДанныеЗадачи.ТрудовыеРесурсы.Скопировать()
			
		КонецЕсли;
		
		ПроектЗадачи 							= ДанныеЗадачи.Проект;
		КалендарьЗадачи 						= ДанныеЗадачи.КалендарьЗадачи;
		ВидОперации 							= ДанныеЗадачи.ВидОперации;
		ТрудовыеРесурсыПоПериодам 				= ДанныеЗадачи.ТрудовыеРесурсыПоПериодам;
		ПланироватьТрудозатратыНаИсполнителей 	= ДанныеЗадачи.ПланироватьТрудозатратыНаИсполнителей;
		НормаСтоимостиТрудовыхРесурсов 			= ДанныеЗадачи.НормаСтоимостиТрудовыхРесурсов;
		ВнешняяНормаСтоимостиТрудовыхРесурсов 	= ДанныеЗадачи.ВнешняяНормаСтоимостиТрудовыхРесурсов;
		ВключитьПланРасходовВБДДС 				= ДанныеЗадачи.ВключитьПланРасходовВБДДС;
		ВключитьТрудРесурсыВПланРасходов 		= ДанныеЗадачи.ВключитьТрудРесурсыВПланРасходов;
		ТекущаяВерсияПроекта 					= ДанныеЗадачи.ТекущаяВерсияПроекта;
		УровеньПланированияТрудозатратДляБДР 	= ДанныеЗадачи.УровеньПланированияТрудозатратДляБДР;
		
		//
		
		Если НезаписанныеСрокиЗадач <> Неопределено Тогда
			СрокиЗадачи = НезаписанныеСрокиЗадач[ПроектнаяЗадача];
			Если СрокиЗадачи <> Неопределено Тогда
				ДатаНач = СрокиЗадачи.Результат.ДатаНачала;
				ДатаКон = СрокиЗадачи.Результат.ДатаЗавершения;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДатаНач) Или 
			Не ЗначениеЗаполнено(ДатаКон) Тогда
			Продолжить; // Продолжить
		КонецЕсли;
		
		//
		
		ДанныеПроекта = СоответствиеДанныхПроектов.Получить(ПроектЗадачи);
		Если ДанныеПроекта = Неопределено Тогда
			ДанныеПроекта = Новый Структура;
			ДанныеПроекта.Вставить("Календарь", упоПроектыИЗадачиСервер.ПолучитьКалендарьПроекта(ПроектЗадачи));
			СоответствиеДанныхПроектов.Вставить(ПроектЗадачи, ДанныеПроекта);
		КонецЕсли;
		
		СвойстваЗадачи = Новый Структура;
		СвойстваЗадачи.Вставить("ПроектнаяЗадача", 							ПроектнаяЗадача);
		СвойстваЗадачи.Вставить("ТекущаяВерсия",							ТекущаяВерсияПроекта);
		СвойстваЗадачи.Вставить("ДатаНач", 									ДатаНач);
		СвойстваЗадачи.Вставить("ДатаКон", 									ДатаКон);
		СвойстваЗадачи.Вставить("ВключитьТрудРесурсыВПланРасходов", 		ВключитьТрудРесурсыВПланРасходов);
		СвойстваЗадачи.Вставить("ВключитьПланРасходовВБДДС", 				ВключитьПланРасходовВБДДС);
		СвойстваЗадачи.Вставить("ПланироватьТрудозатратыНаИсполнителей", 	ПланироватьТрудозатратыНаИсполнителей);
		СвойстваЗадачи.Вставить("НормаСтоимостиТрудовыхРесурсов", 			НормаСтоимостиТрудовыхРесурсов);
		СвойстваЗадачи.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", 	ВнешняяНормаСтоимостиТрудовыхРесурсов);
		СвойстваЗадачи.Вставить("Проект", 									ПроектЗадачи);
		Если ЗначениеЗаполнено(КалендарьЗадачи) Тогда
			СвойстваЗадачи.Вставить("Календарь", КалендарьЗадачи);
		Иначе
			СвойстваЗадачи.Вставить("Календарь", ДанныеПроекта.Календарь);
		КонецЕсли;
		
		ТрудовыеРесурсыТЧИсходная = ТрудовыеРесурсыТЧ.Скопировать();
				
		// Когда в трудовых ресурсах появится колонка ПП - сворачивание можно будет убрать
		СвернутьТрудовыеРесурсыТЧ(ТрудовыеРесурсыТЧ);
		
		ИндексыБылоСтало = ИндексыСтрокРаспределенияПоПериодамДоИПослеСворачивания(ТрудовыеРесурсыТЧИсходная, 
			ТрудовыеРесурсыТЧ);

		ТрудозатратыПоДням = ПолучитьТрудозатратыПоДням(СвойстваЗадачи,
				ТрудовыеРесурсыТЧ,
				ТрудовыеРесурсыПоПериодам,
				ПараметрыДопФункциональности,
				ИндексыБылоСтало);
			
		Если ТрудозатратыПоДням = Неопределено Тогда 
			Продолжить; // Продолжить
		КонецЕсли;
		
		//
		
		Если ВключитьТрудРесурсыВПланРасходов Тогда
			
			ДанныеЗаполнения.Вставить("Версия", ТекущаяВерсияПроекта);
			ДанныеЗаполнения.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
			
			ПроверитьСформироватьШаблоныТрансляции(ДанныеШаблоновТрансляции);
			СводнаяТаблицаПланРасходов = ДанныеШаблоновТрансляции.ШаблонТаблицыРасходов.СкопироватьКолонки();
			
			СтартовыйИндекс =
				упоАналитикаПоПодразделениямКлиентСервер.
				ПолучитьИндексСтрокРаспределенияНовойСтроки(ДанныеЗадачи.ПланРасходов);
			
			ОтразитьТрудовыеРесурсыВПланеРасходов(ПроектЗадачи,
				ТрудовыеРесурсыТЧ,
				СводнаяТаблицаПланРасходов,
				УровеньПланированияТрудозатратДляБДР,
				СтартовыйИндекс);
			
			ПоляОтбора = Новый Массив;
			ПоляОтбора.Добавить("Ресурс");
			ПоляОтбора.Добавить("Подразделение");
			ПоляОтбора.Добавить("УровеньПланирования");
			
			СводнаяТаблицаПланРасходов.Индексы.Добавить(СтрСоединить(ПоляОтбора, ","));
			
			ОтборРесурсПодразделение = Новый Структура;
			Для Каждого ПолеОтбора Из ПоляОтбора Цикл
				ОтборРесурсПодразделение.Вставить(ПолеОтбора);
			КонецЦикла;
			
			ДетальнаяТаблицаПланРасходов = СводнаяТаблицаПланРасходов.СкопироватьКолонки();
			
		КонецЕсли;
		
		//
		
		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям = 
			упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям_Пустая.Скопировать();
			
		СтруктураНастроекПроекта = СоответствиеСтруктурНастроекПроектов.Получить(ПроектЗадачи);
					  
		ПараметрыРаспределения = Новый Структура("ДатаНачала, ДатаЗавершения, естьВалютнаясумма", ДатаНач, ДатаКон, Ложь); 
		
		Для каждого СтрокаРесурс Из ТрудозатратыПоДням.Строки Цикл	
			
			Если ТипЗнч(СтрокаРесурс.Ресурс) = Тип("СправочникСсылка.упоТрудовыеРесурсы") Тогда
				
				Если Не СтруктураНастроекПроекта.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда 
					
					СтрокаНормы = Неопределено;
					
					СтоимостьЧаса = ПолучитьСтоимостьЧасаРесурса(ТаблицаСтоимостиПоНорме, 
						СтрокаРесурс, НормаСтоимостиТрудовыхРесурсов, СтрокаНормы, Ложь);

					СтоимостьЧасаВнешняя = ПолучитьСтоимостьЧасаРесурса(ТаблицаСтоимостиПоНорме, 
						СтрокаРесурс, ВнешняяНормаСтоимостиТрудовыхРесурсов, СтрокаНормы, Ложь) ;
																							
				КонецЕсли;
				
			КонецЕсли;	
			
			Если СтруктураНастроекПроекта.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда
				
				СтрокиНорм = Неопределено;
				СтрокиВнешнихНорм = Неопределено;
				
				СтоимостьЧаса = ПолучитьСтоимостьЧасаРесурса(ТаблицаСтоимостиПоНормеПоПериодам, 
						СтрокаРесурс, НормаСтоимостиТрудовыхРесурсов, СтрокиНорм, Истина);

				СтоимостьЧасаВнешняя = ПолучитьСтоимостьЧасаРесурса(ТаблицаСтоимостиПоНормеПоПериодам, 
						СтрокаРесурс, ВнешняяНормаСтоимостиТрудовыхРесурсов, СтрокиВнешнихНорм, Истина);
				
				ДатаИзмененияНормы = Дата(1, 1, 1);	

				ДатаИзмененияВнешнийНормы = Дата(1, 1, 1);
											
			КонецЕсли;

			Если ВключитьТрудРесурсыВПланРасходов Тогда
				
				ЗаполнитьЗначенияСвойств(ОтборРесурсПодразделение, СтрокаРесурс);
				ПрофилиРесурсаБДР = СводнаяТаблицаПланРасходов.НайтиСтроки(ОтборРесурсПодразделение);
				
				ПериодыАгрегации = Новый Соответствие;
				СчКолонок = 1;
				Для Каждого ПрофильРасходовРесурса Из ПрофилиРесурсаБДР Цикл
					Если ПрофильРасходовРесурса.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно
						И ПериодыАгрегации[ПрофильРасходовРесурса.ПериодАгрегации] = Неопределено Тогда
						ПериодыАгрегации.Вставить(ПрофильРасходовРесурса.ПериодАгрегации, "КолонкаПериода_" + СчКолонок);
						СчКолонок = СчКолонок + 1;
					КонецЕсли;	
				КонецЦикла;	
				
				ЕстьСводныеПрофили  = ПериодыАгрегации.Количество() > 0;
				Если ЕстьСводныеПрофили Тогда
					ТаблицаПоДням = ШаблонТаблицыПоДням(ПериодыАгрегации);
				КонецЕсли;
				
				ОбщаяСуммаРесурса = 0;
				ОбщаяВнешСуммаРесурса = 0;
				
			КонецЕсли;
			
			ДатаОкончанияПроектнойЗадачиПлан = СвойстваЗадачи.ДатаКон;
			Для каждого СтрокаДень Из СтрокаРесурс.Строки Цикл
				
				Если СтруктураНастроекПроекта.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда 
					
					Если СтрокиНорм.Количество() Тогда
						// Найдем стоимость по норме трудового ресурса в текущий день.
						Если ДатаИзмененияНормы <= НачалоДня(СтрокаДень.День) Тогда
							СтоимостьЧаса = НайтиСтоимостьПоНормеЗаДень(СтрокиНорм, НачалоДня(СтрокаДень.День), ДатаИзмененияНормы);
						КонецЕсли;
					КонецЕсли;
					
					Если СтрокиВнешнихНорм.Количество() Тогда
						// Найдем стоимость по норме трудового ресурса в текущий день.
						Если ДатаИзмененияВнешнийНормы <= НачалоДня(СтрокаДень.День)  Тогда
							СтоимостьЧасаВнешняя = НайтиСтоимостьПоНормеЗаДень(СтрокиВнешнихНорм, 
								НачалоДня(СтрокаДень.День), 
								ДатаИзмененияВнешнийНормы);
						КонецЕсли;
					КонецЕсли;
					
					СтрокаДень.Стоимость = СтоимостьЧаса * СтрокаДень.Трудозатраты;
					СтрокаДень.ВнешняяСтоимость = СтоимостьЧасаВнешняя * СтрокаДень.Трудозатраты;

				КонецЕсли;
						
				Если Не ПланироватьТрудозатратыНаИсполнителей Тогда
					
					Движение = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям.Добавить();
					Движение.Проект = ПроектЗадачи;
					Движение.Операция = ПроектнаяЗадача;
					Движение.Ресурс = СтрокаРесурс.Ресурс;
					Движение.Подразделение = СтрокаРесурс.Подразделение;
					Движение.День = СтрокаДень.День;
					Движение.ИсточникПлана = СтрокаРесурс.ИсточникПлана;
					Движение.УровеньПланирования = СтрокаРесурс.УровеньПланирования;
					Движение.Трудозатраты = СтрокаДень.Трудозатраты;
					Движение.Стоимость = СтрокаДень.Стоимость;
					Движение.ВнешняяСтоимость = СтрокаДень.ВнешняяСтоимость;
					
				Иначе
					
					// А для таких проектных задач в данных оперативного планирования
					// фигурируют трудовые ресурсы, назначенные на выполнение задачи.
					
					Движение = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям.Добавить();
					Движение.Проект = ПроектЗадачи;
					Движение.Операция = ПроектнаяЗадача;
					Движение.Ресурс = СтрокаРесурс.Ресурс;
					Движение.Подразделение = СтрокаРесурс.Подразделение;
					Движение.Роль = СтрокаРесурс.Роль;
					Движение.День = СтрокаДень.День;
					Движение.ИсточникПлана = СтрокаРесурс.ИсточникПлана;
					Движение.УровеньПланирования = СтрокаРесурс.УровеньПланирования;
					Движение.Трудозатраты = СтрокаДень.Трудозатраты;

					Если ТипЗнч(СтрокаРесурс.Ресурс) = Тип("СправочникСсылка.упоТрудовыеРесурсы") Тогда
						
						Движение.Стоимость = СтоимостьЧаса * Движение.Трудозатраты;
						Движение.ВнешняяСтоимость = СтоимостьЧасаВнешняя * Движение.Трудозатраты;
						
					Иначе
						
						Движение.Стоимость = СтрокаДень.Стоимость;
						Движение.ВнешняяСтоимость = СтрокаДень.ВнешняяСтоимость;
						
					КонецЕсли;				
					
				КонецЕсли;
				
				Если ВключитьТрудРесурсыВПланРасходов Тогда
					
					ОбщаяСуммаРесурса = ОбщаяСуммаРесурса + Движение.Стоимость;
					ОбщаяВнешСуммаРесурса = ОбщаяВнешСуммаРесурса + Движение.ВнешняяСтоимость;
					
					Если ЕстьСводныеПрофили Тогда
						НоваяСтрока = ТаблицаПоДням.Добавить();
						НоваяСтрока.Сумма = Движение.Стоимость;
						
						Для Каждого ПериодАгрегации Из ПериодыАгрегации Цикл
							ДатаПривязки = Мин(ДатаОкончанияПроектнойЗадачиПлан,
								КонецПериодаАгрегации(СтрокаДень.День, ПериодАгрегации.Ключ));
							НоваяСтрока[ПериодАгрегации.Значение] = ДатаПривязки;
						КонецЦикла;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;

			Если ВключитьТрудРесурсыВПланРасходов Тогда
				
				СкорректироватьРазницуОкругленияСтоимостиТрудозатратПриТрансляцииВРасходы(СтрокаРесурс, 
					Движение, 
					ОбщаяСуммаРесурса, 
					ОбщаяВнешСуммаРесурса, 
					СтруктураНастроекПроекта.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат);
					
				Для Каждого ПрофильРасходаРесурса Из ПрофилиРесурсаБДР Цикл
					
					СуммаРаспределения = ОбщаяСуммаРесурса * ПрофильРасходаРесурса.ДоляСуммы / 100;
					
					Если ПрофильРасходаРесурса.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно Тогда
						
						КолонкаПериода = ПериодыАгрегации[ПрофильРасходаРесурса.ПериодАгрегации]; 
						Если ПериодыАгрегации.Количество() = 1 Тогда 
							ТаблицаДни = ТаблицаПоДням;
						Иначе
							ТаблицаДни = ТаблицаПоДням.Скопировать(, "Сумма," + КолонкаПериода);
						КонецЕсли;
						ТаблицаДни.Свернуть(КолонкаПериода, "Сумма");
						
						МассивКоэффициентов = ТаблицаДни.ВыгрузитьКолонку("Сумма");
						МассивСумм = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
							СуммаРаспределения, МассивКоэффициентов);
						
						КоличествоЭлементов = ?(МассивСумм = Неопределено, -1, МассивСумм.ВГраница());
						Для Сч = 0 По КоличествоЭлементов Цикл
							НоваяСтрока = ДетальнаяТаблицаПланРасходов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ПрофильРасходаРесурса, , "Сумма");
							НоваяСтрока.ДатаНачисления = ТаблицаДни[Сч][КолонкаПериода];
							НоваяСтрока.СуммаВалютная = МассивСумм[Сч];
						КонецЦикла;
					
					Иначе
						
						ПрофильРасходаРесурса.Сумма = СуммаРаспределения;
						упоАктуализацияПроектаВызовСервера.РаспределитьСуммуСтрокиБДР(ДетальнаяТаблицаПланРасходов, ПрофильРасходаРесурса, 
							ПараметрыРаспределения, ДанныеЗаполнения);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//
		
		упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям.Свернуть("Проект, Операция, УровеньПланирования, Ресурс, Роль,
		 |Подразделение, День, ИсточникПлана", "Трудозатраты, Стоимость, ВнешняяСтоимость"); 
		
		упоАктуальныеПланыТрудозатратСводноТекущаяВерсия = упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям.Скопировать();
		
		СконвертироватьТаблицуПоДнямВТаблицуПлановыхЗатратТрудовыхРесурсов(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия, 
																								ПроектнаяЗадача, 
																								ВидОперации);
																														
		//
			
		НаборЗаписей_упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия = 
			РегистрыСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.СоздатьНаборЗаписей();
		НаборЗаписей_упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Отбор.Операция.Установить(ПроектнаяЗадача);
		НаборЗаписей_упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия.Загрузить(
			упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсиям);
		
		НаборЗаписей_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия = 
			РегистрыСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.СоздатьНаборЗаписей();
		НаборЗаписей_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Отбор.ПроектнаяЗадача.Установить(ПроектнаяЗадача);
		НаборЗаписей_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Загрузить(
			упоАктуальныеПланыТрудозатратСводноТекущаяВерсия);
			
		// Заполнить стоимости в РС упоДанныеПлановТрудозатратРолей.
		Если ЕстьУчетПериодаРегистрацииНормСтоимости Тогда
			РассчитатьСтоимости_УчетПериодаРегистрацииНормСтоимости(ДвиженияДокумента, 
				упоДанныеПлановТрудозатратРолейИтоговая, 
				упоАктуальныеПланыТрудозатратСводноТекущаяВерсия, 
				ТрудовыеРесурсыТЧ, 
				ДанныеЗаполнения);
		КонецЕсли;
			
		//
		
		МассивНаборовЗаписей.Добавить(НаборЗаписей_упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия);
		МассивНаборовЗаписей.Добавить(НаборЗаписей_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия);
		
		//

		ПодготовитьНаборыЗаписей_ТрансляцияТрудРесурсов(СвойстваЗадачи, 
			ДетальнаяТаблицаПланРасходов, 
			ДвиженияДокумента, 
			МассивНаборовЗаписей, 
			СтруктураНастроекПроекта, 
			ДанныеЗаполнения, 
			ДанныеШаблоновТрансляции);
		
	КонецЦикла; // ТекЗадача Из КоллекцияДанныхЗадач
	
	Если ЕстьУчетПериодаРегистрацииНормСтоимости Тогда
		ПодготовитьНаборыЗаписей_УчетПериодаРегистрацииНормСтоимости(упоДанныеПлановТрудозатратРолейИтоговая, 
			МассивНаборовЗаписей, 
			ПроектыСНастройкойУчетПериодаРегистрации);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	КоличествоЗаписей = МассивНаборовЗаписей.ВГраница();
	Для Сч = 0 По КоличествоЗаписей Цикл
		МассивНаборовЗаписей[Сч].Записать();
		МассивНаборовЗаписей[Сч] = Неопределено;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура СкорректироватьРазницуОкругленияСтоимостиТрудозатратПриТрансляцииВРасходы(СтрокаРесурс, 
	Движение, 
	ОбщаяСуммаРесурса, 
	ОбщаяВнешСуммаРесурса, 
	УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат) 
	
	// При опции УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат = Истина изменение сроков задачи 
	//   может приводить к изменению общей суммы роли, т.к. общая сумма рассчитывается из дневных ставок 
	//   и период изменения ставки может добавиться или выпасть из новых сроков задачи. 
	// При опции УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат = Ложь изменение сроков задачи 
	//   не приводит к изменению общей стоимости, поэтому мы должны сделать корректировку округления, 
	//   которая сбрасывается на последний период расчета.
	Если УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат Тогда
		Возврат;
	КонецЕсли;
	
	// Затраты трудовых ресурсов не транслируются в БДР.
	Если ТипЗнч(СтрокаРесурс.Ресурс) = Тип("СправочникСсылка.упоТрудовыеРесурсы") Тогда
		Возврат;
	КонецЕсли;
	
	// Нижняя ветка условия необходима для "добивания" общей стоимости роли (ТР исключаем) в указанный период
	// после распределения этой суммы по параметрам в движения.
	// ЗначениеЗаполнено(СтрокаРесурс.Стоимость) - означает, что было распределение по доли трудозатрат.
	// В этом случае сравниваем общую стоимость и если есть разница, "кидаем" эту разницу на последнюю дату/движение.
	
	// Стоимость
	Если ЗначениеЗаполнено(СтрокаРесурс.Стоимость) И ОбщаяСуммаРесурса <> СтрокаРесурс.Стоимость Тогда
		Разница = СтрокаРесурс.Стоимость - ОбщаяСуммаРесурса;
		Движение.Стоимость = Движение.Стоимость + Разница;
		ОбщаяСуммаРесурса = СтрокаРесурс.Стоимость;
	КонецЕсли;
	// Внешняя стоимость
	Если ЗначениеЗаполнено(СтрокаРесурс.ВнешняяСтоимость) И ОбщаяВнешСуммаРесурса <> СтрокаРесурс.ВнешняяСтоимость Тогда
		Разница = СтрокаРесурс.ВнешняяСтоимость - ОбщаяВнешСуммаРесурса;
		Движение.ВнешняяСтоимость = Движение.ВнешняяСтоимость + Разница;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПараметрОтраженияСИсключением(Предмет)
	
	ТипПредмет = ТипЗнч(Предмет);
	Если ТипПредмет = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		Возврат;
	КонецЕсли;
	Если ТипПредмет = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ВызватьИсключение НСтр("ru = 'Некорректный параметр: ожидается проектная задача.'");
	
КонецПроцедуры

// Заполнить стоимости в РС упоДанныеПлановТрудозатратРолей.
Процедура РассчитатьСтоимости_УчетПериодаРегистрацииНормСтоимости(ДвиженияДокумента, 
	упоДанныеПлановТрудозатратРолейИтоговая, 
	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия, 
	ТрудовыеРесурсыТЧ, 
	ДанныеЗаполнения)
	
	ДобавитьВМассивНаборовЗаписей = Истина;
	Если ДвиженияДокумента <> Неопределено И ДвиженияДокумента.Свойство("упоДанныеПлановТрудозатратРолей") Тогда
		упоДанныеПлановТрудозатратРолей = ДвиженияДокумента.упоДанныеПлановТрудозатратРолей;
		ДобавитьВМассивНаборовЗаписей = Ложь;
	Иначе
		упоДанныеПлановТрудозатратРолей = ТрудовыеРесурсыТЧ.Скопировать();
		упоДанныеПлановТрудозатратРолей.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
		упоДанныеПлановТрудозатратРолей.ЗаполнитьЗначения(ДанныеЗаполнения.Период, "Период");
		КолонкаИндексСтрокРаспределенияПоПериодам
			= упоДанныеПлановТрудозатратРолей.Колонки.Найти("ИндексСтрокРаспределенияПоПериодам");
		КолонкаИндексСтрокРаспределения = упоДанныеПлановТрудозатратРолей.Колонки.Найти("ИндексСтрокРаспределения");
		Если КолонкаИндексСтрокРаспределенияПоПериодам <> Неопределено
			И КолонкаИндексСтрокРаспределения = Неопределено Тогда
			КолонкаИндексСтрокРаспределенияПоПериодам.Имя = "ИндексСтрокРаспределения";
		КонецЕсли;
	КонецЕсли;
	
	Отбор = Новый Структура("УровеньПланирования, Ресурс, Подразделение");
	Для Каждого СтрокаТЧ Из упоДанныеПлановТрудозатратРолей Цикл
		
		Если СтрокаТЧ.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор.УровеньПланирования = СтрокаТЧ.УровеньПланирования;
		Отбор.Ресурс = СтрокаТЧ.Ресурс;
		Отбор.Подразделение = СтрокаТЧ.Подразделение;
		
		СтрокиупоАктуальныеПланыТрудозатратСводноТекущаяВерсия =
			упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.НайтиСтроки(Отбор);
		ОбщСтоимость = 0;
		ОбщВнешняяСтоимость = 0;
		Для Каждого СтрокаСтоимости Из СтрокиупоАктуальныеПланыТрудозатратСводноТекущаяВерсия Цикл
			ОбщСтоимость = ОбщСтоимость + СтрокаСтоимости.Стоимость;
			ОбщВнешняяСтоимость = ОбщВнешняяСтоимость + СтрокаСтоимости.СтоимостьВнешняя;
		КонецЦикла;
		СтрокиупоДанныеПлановТрудозатратРолей = упоДанныеПлановТрудозатратРолей.НайтиСтроки(Отбор);
		ОбщееКоличествоЧасов = 0;
		Если СтрокиупоДанныеПлановТрудозатратРолей.Количество() > 0 Тогда
			Для Каждого СтрокаСтоимости Из СтрокиупоДанныеПлановТрудозатратРолей Цикл
				ОбщееКоличествоЧасов = ОбщееКоличествоЧасов
					+ (СтрокаСтоимости.ЕдиницаНормирования.Коэффициент * СтрокаСтоимости.Количество);
			КонецЦикла;
		КонецЕсли;
		
		Если ОбщееКоличествоЧасов <> 0 Тогда
			СтрокаТЧ.ОбщСтоимость = ОбщСтоимость / ОбщееКоличествоЧасов
				* (СтрокаТЧ.ЕдиницаНормирования.Коэффициент * СтрокаТЧ.Количество);
			СтрокаТЧ.ОбщВнешняяСтоимость = ОбщВнешняяСтоимость / ОбщееКоличествоЧасов
				* (СтрокаТЧ.ЕдиницаНормирования.Коэффициент * СтрокаТЧ.Количество);
		Иначе
			СтрокаТЧ.ОбщСтоимость = ОбщСтоимость;
			СтрокаТЧ.ОбщВнешняяСтоимость = ОбщВнешняяСтоимость;
		КонецЕсли;
		
		СтрокаТЧ.Стоимость = СтрокаТЧ.ОбщСтоимость / СтрокаТЧ.Количество;
		СтрокаТЧ.ВнешняяСтоимость = СтрокаТЧ.ОбщВнешняяСтоимость / СтрокаТЧ.Количество;
		
	КонецЦикла;
	
	Если ДобавитьВМассивНаборовЗаписей Тогда
		Если упоДанныеПлановТрудозатратРолейИтоговая = Неопределено Тогда
			упоДанныеПлановТрудозатратРолейИтоговая = упоДанныеПлановТрудозатратРолей.Скопировать();
		Иначе
			Для Каждого Строка Из упоДанныеПлановТрудозатратРолей Цикл
				НоваяСтрока = упоДанныеПлановТрудозатратРолейИтоговая.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицыСтоимости(МассивЗадачДляРасчетаНормыСрезПоследних,
		МассивЗадачДляРасчетаНормыПоПериодам,
		НезаписанныеТрудовыеРесурсы)
	
	Результат = Новый Структура("ТаблицаСтоимостиПоНорме, ТаблицаСтоимостиПоНормеПоПериодам");
	
	Запрос = Новый Запрос;
	Если МассивЗадачДляРасчетаНормыСрезПоследних.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("Ссылка", МассивЗадачДляРасчетаНормыСрезПоследних); 
		Запрос.УстановитьПараметр("НезаписанныеТрудовыеРесурсы", НезаписанныеТрудовыеРесурсы);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Рег.Ресурс,
			|	Рег.Норма,
			|	Рег.ЕдиницаНормирования.Коэффициент КАК КоэфПоНорме,
			|	Рег.ЕдСтоимость КАК СтоимостьЗаЕдиницуПоНорме,
			|	ВЫБОР
			|		КОГДА ВЫРАЗИТЬ(Рег.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени) ЕСТЬ NULL 
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА Рег.ЕдиницаНормирования ЕСТЬ NULL 
			|					ТОГДА 0
			|				ИНАЧЕ ВЫБОР
			|						КОГДА Рег.ЕдиницаНормирования.Коэффициент > 0
			|							ТОГДА Рег.ЕдСтоимость / Рег.ЕдиницаНормирования.Коэффициент
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК СтоимостьЧаса
			|ИЗ
			|	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
			|			,
			|			Ресурс В
			|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|					ВыделенныеТрудовыеРесурсы.Ресурс
			|				ИЗ
			|					РегистрСведений.упоВыделенныеТрудовыеРесурсы КАК ВыделенныеТрудовыеРесурсы
			|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
			|						ПО
			|							упоВерсииПроекта.Версия = ВыделенныеТрудовыеРесурсы.Версия И упоВерсииПроекта.Текущая
			|				ГДЕ
			|					ВыделенныеТрудовыеРесурсы.ПроектнаяЗадача В (&Ссылка))
			|			ИЛИ Ресурс В (&НезаписанныеТрудовыеРесурсы)) КАК Рег";
		
		Результат.ТаблицаСтоимостиПоНорме = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если МассивЗадачДляРасчетаНормыПоПериодам.Количество() > 0 Тогда
		
		Запрос.УстановитьПараметр("Ссылка", МассивЗадачДляРасчетаНормыПоПериодам);
		Запрос.УстановитьПараметр("НезаписанныеТрудовыеРесурсы", НезаписанныеТрудовыеРесурсы);
		Запрос.УстановитьПараметр("МаксимальнаяДата", Дата(3999, 12, 31));
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(Рег.Период, ДЕНЬ) КАК ПериодНачала,
			|	Рег.Ресурс КАК Ресурс,
			|	Рег.Норма КАК Норма,
			|	Рег.ЕдиницаНормирования.Коэффициент КАК КоэфПоНорме,
			|	Рег.ЕдСтоимость КАК СтоимостьЗаЕдиницуПоНорме,
			|	ВЫБОР
			|		КОГДА ВЫРАЗИТЬ(Рег.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени) ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА Рег.ЕдиницаНормирования ЕСТЬ NULL
			|					ТОГДА 0
			|				ИНАЧЕ ВЫБОР
			|						КОГДА Рег.ЕдиницаНормирования.Коэффициент > 0
			|							ТОГДА Рег.ЕдСтоимость / Рег.ЕдиницаНормирования.Коэффициент
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК СтоимостьЧаса
			|ПОМЕСТИТЬ ВТ_Рег
			|ИЗ
			|	РегистрСведений.упоНормыСтоимостиРесурсов КАК Рег
			|ГДЕ
			|	Рег.Ресурс В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				ВыделенныеТрудовыеРесурсы.Ресурс
			|			ИЗ
			|				РегистрСведений.упоВыделенныеТрудовыеРесурсы КАК ВыделенныеТрудовыеРесурсы
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
			|					ПО
			|						упоВерсииПроекта.Версия = ВыделенныеТрудовыеРесурсы.Версия
			|							И упоВерсииПроекта.Текущая
			|			ГДЕ
			|				ВыделенныеТрудовыеРесурсы.ПроектнаяЗадача В (&Ссылка))
			|	ИЛИ Рег.Ресурс В (&НезаписанныеТрудовыеРесурсы)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Рег.ПериодНачала КАК ПериодНачала,
			|	ВТ_Рег.Ресурс КАК Ресурс,
			|	ВТ_Рег.Норма КАК Норма,
			|	ВТ_Рег.КоэфПоНорме КАК КоэфПоНорме,
			|	ВТ_Рег.СтоимостьЗаЕдиницуПоНорме КАК СтоимостьЗаЕдиницуПоНорме,
			|	ВТ_Рег.СтоимостьЧаса КАК СтоимостьЧаса,
			|	МИНИМУМ(ЕСТЬNULL(ВТ_Рег1.ПериодНачала, &МаксимальнаяДата)) КАК ПериодОкончания
			|ИЗ
			|	ВТ_Рег КАК ВТ_Рег
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рег КАК ВТ_Рег1
			|		ПО ВТ_Рег.Ресурс = ВТ_Рег1.Ресурс
			|			И (ВТ_Рег1.Норма = ВТ_Рег.Норма)
			|			И ВТ_Рег.ПериодНачала < ВТ_Рег1.ПериодНачала
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Рег.ПериодНачала,
			|	ВТ_Рег.Ресурс,
			|	ВТ_Рег.Норма,
			|	ВТ_Рег.КоэфПоНорме,
			|	ВТ_Рег.СтоимостьЗаЕдиницуПоНорме,
			|	ВТ_Рег.СтоимостьЧаса";
		
		Результат.ТаблицаСтоимостиПоНормеПоПериодам = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьСформироватьШаблоныТрансляции(ДанныеШаблоновТрансляции)
	
	Если ДанныеШаблоновТрансляции.ШаблоныАктуализацииДДССформированы Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеШаблоновТрансляции.ШаблонПланаДДС = упоДвиженияДенежныхСредствСервер.ШаблонПланаДДС();
	ДанныеШаблоновТрансляции.ШаблонАктуальныеПланыДДС =
		упоФункцииОбщегоНазначенияСервер.ШаблонТаблицыЗначенийПоРегистру("упоАктуальныеПланыДвиженийДенежныхСредств");
	ДанныеШаблоновТрансляции.ШаблонТаблицыРасходов = ШаблонТаблицыРасходов();
	
	ДанныеШаблоновТрансляции.ШаблоныАктуализацииДДССформированы = Истина;
	
КонецПроцедуры

Процедура ПодготовитьНаборыЗаписей_ТрансляцияТрудРесурсов(СвойстваЗадачи,
		ДетальнаяТаблицаПланРасходов,
		ДвиженияДокумента,
		МассивНаборовЗаписей,
		СтруктураНастроекПроекта,
		ДанныеЗаполнения,
		ДанныеШаблоновТрансляции)
	
	Если Не СвойстваЗадачи.ВключитьТрудРесурсыВПланРасходов Тогда
		Возврат;
	КонецЕсли;
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ДетальнаяТаблицаПланРасходов, , Ложь);
	
	ДетальнаяТаблицаПланРасходов.Колонки.Ресурс.Имя = "Роль";
	
	СоздатьНаборЗаписейПоТаблице(ДетальнаяТаблицаПланРасходов, "упоДанныеПлановДоходовИРасходов",
		ДвиженияДокумента, МассивНаборовЗаписей, ДанныеЗаполнения);
	СоздатьНаборЗаписейПоТаблице(ДетальнаяТаблицаПланРасходов, "упоАктуальныеПланыДоходовИРасходов",
		ДвиженияДокумента, МассивНаборовЗаписей, ДанныеЗаполнения, Истина);
	
	// Расширенная аналитика по подразделениям.
	СоздатьНаборЗаписейПоТаблице(ДетальнаяТаблицаПланРасходов, "упоДанныеПлановДоходовИРасходовПодразделения",
		ДвиженияДокумента, МассивНаборовЗаписей, ДанныеЗаполнения);
	СоздатьНаборЗаписейПоТаблице(ДетальнаяТаблицаПланРасходов, "упоАктуальныеПланыДоходовИРасходовПодразделения",
		ДвиженияДокумента, МассивНаборовЗаписей, ДанныеЗаполнения);
	
	// Включение в план объемов.
	Если СтруктураНастроекПроекта.РасходыПоПодразделениям И СтруктураНастроекПроекта.РасходыПоОбъемам
		И Не СтруктураНастроекПроекта.РасходыПоНатуральнымПоказателям Тогда
		
		СоздатьНаборЗаписейПоТаблице(ДетальнаяТаблицаПланРасходов, "упоАктуальныеПланыВыполненияОбъемов",
			ДвиженияДокумента, МассивНаборовЗаписей, ДанныеЗаполнения);
	Иначе
		
		// Обнуление записей трансляции трудозатрат, если опции проектной модели изменились.
		СоздатьНаборЗаписейПоТаблице(Неопределено, "упоАктуальныеПланыВыполненияОбъемов",
			ДвиженияДокумента, МассивНаборовЗаписей, ДанныеЗаполнения, Истина);
		
	КонецЕсли;
	
	// Включение в план ДДС.
	Если СвойстваЗадачи.ВключитьПланРасходовВБДДС Тогда
		
		ПроверитьСформироватьШаблоныТрансляции(ДанныеШаблоновТрансляции);
		
		ТаблицаПланДДС = ДанныеШаблоновТрансляции.ШаблонПланаДДС.СкопироватьКолонки();
		ТаблицаДвиженийБДДС = ДанныеШаблоновТрансляции.ШаблонАктуальныеПланыДДС.СкопироватьКолонки();
		
		ТаблицаЗадач = ТаблицаЗадачи(СвойстваЗадачи.ПроектнаяЗадача, СвойстваЗадачи.ДатаНач, СвойстваЗадачи.ДатаКон);
		
		ДетальнаяТаблицаПланРасходов.Колонки.Добавить("ВидЭлемента", ДанныеШаблоновТрансляции.Тип_ВидЭлементаПланаДоходовИРасходов);
		ДетальнаяТаблицаПланРасходов.ЗаполнитьЗначения(Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход, "ВидЭлемента");
		
		ДополнитьДанныеПланаДДСДаннымиПланаБДР(ТаблицаПланДДС, ДетальнаяТаблицаПланРасходов, СвойстваЗадачи.ПроектнаяЗадача,
			СвойстваЗадачи.Проект);
		
		упоДвиженияДенежныхСредствСервер.ЗаполнитьТаблицуБДДСПоДаннымПланаДДС(ТаблицаДвиженийБДДС, ТаблицаПланДДС,
			ТаблицаЗадач, СвойстваЗадачи.ПроектнаяЗадача, Истина);
		
		// Переопределение данных заполнения.
		ДанныеЗаполнения.ИсточникПлана = Перечисления.упоИсточникПланаДДС.Трудозатраты;
		
		СоздатьНаборЗаписейПоТаблице(ТаблицаДвиженийБДДС, "упоАктуальныеПланыДвиженийДенежныхСредств",
			ДвиженияДокумента, МассивНаборовЗаписей, ДанныеЗаполнения, Истина);
		
		ДанныеЗаполнения.ИсточникПлана = Перечисления.упоИсточникПланаДоходовИРасходов.Трудозатраты;
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет данные средней стоимости в последних регистраторах для корректного отображения в данных табличных частей 
// проектной задачи. Перезаписывается весь набор записей регистраторов; при этом обновляются строки, полностью 
// совпадающие по аналитике, а также по количеству.
//
Процедура ПодготовитьНаборыЗаписей_УчетПериодаРегистрацииНормСтоимости(упоДанныеПлановТрудозатратРолейИтоговая, 
	МассивНаборовЗаписей, 
	ПроектыСНастройкойУчетПериодаРегистрации)
	
	Если упоДанныеПлановТрудозатратРолейИтоговая = Неопределено Тогда
		Возврат; // Нет учета по периодам регистрации.
	КонецЕсли;
	
	ВерсииПроектовСУчетомПериодаРегистрации = ВерсииПроектов(ПроектыСНастройкойУчетПериодаРегистрации);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеПлановТрудозатратРолей", упоДанныеПлановТрудозатратРолейИтоговая);
	Запрос.УстановитьПараметр("ВерсииПроектов", ВерсииПроектовСУчетомПериодаРегистрации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПлановТрудозатратРолей.Период КАК Период,
	               |	ДанныеПлановТрудозатратРолей.Версия КАК Версия,
	               |	ДанныеПлановТрудозатратРолей.УровеньПланирования КАК УровеньПланирования,
	               |	ДанныеПлановТрудозатратРолей.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДанныеПлановТрудозатратРолей.Ресурс КАК Ресурс,
	               |	ДанныеПлановТрудозатратРолей.Подразделение КАК Подразделение,
	               |	ДанныеПлановТрудозатратРолей.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	ДанныеПлановТрудозатратРолей.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ДанныеПлановТрудозатратРолей.СпособПривязки КАК СпособПривязки,
	               |	ДанныеПлановТрудозатратРолей.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	ДанныеПлановТрудозатратРолей.Количество КАК Количество,
	               |	ДанныеПлановТрудозатратРолей.Стоимость КАК Стоимость,
	               |	ДанныеПлановТрудозатратРолей.ОбщСтоимость КАК ОбщСтоимость,
	               |	ДанныеПлановТрудозатратРолей.ВнешняяСтоимость КАК ВнешняяСтоимость,
	               |	ДанныеПлановТрудозатратРолей.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
	               |	ДанныеПлановТрудозатратРолей.ИсточникПлана КАК ИсточникПлана
	               |ПОМЕСТИТЬ втТаблицаРасчета
	               |ИЗ
	               |	&ДанныеПлановТрудозатратРолей КАК ДанныеПлановТрудозатратРолей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблицаРасчета.Период КАК Период,
	               |	втТаблицаРасчета.Версия КАК Версия,
	               |	втТаблицаРасчета.УровеньПланирования КАК УровеньПланирования,
	               |	втТаблицаРасчета.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	втТаблицаРасчета.Ресурс КАК Ресурс,
	               |	втТаблицаРасчета.Подразделение КАК Подразделение,
	               |	втТаблицаРасчета.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	втТаблицаРасчета.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	втТаблицаРасчета.СпособПривязки КАК СпособПривязки,
	               |	втТаблицаРасчета.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	втТаблицаРасчета.Количество КАК Количество,
	               |	втТаблицаРасчета.Стоимость КАК Стоимость,
	               |	втТаблицаРасчета.ОбщСтоимость КАК ОбщСтоимость,
	               |	втТаблицаРасчета.ВнешняяСтоимость КАК ВнешняяСтоимость,
	               |	втТаблицаРасчета.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
	               |	втТаблицаРасчета.ИсточникПлана КАК ИсточникПлана,
	               |	втТаблицаРасчета.Версия В (&ВерсииПроектов) КАК УчетПериодаРегистрации
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	втТаблицаРасчета КАК втТаблицаРасчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Регистратор КАК Регистратор,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Версия КАК Версия
	               |ПОМЕСТИТЬ вт_КрайниеРегистраторы
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |			,
	               |			(Версия, УровеньПланирования, ПроектнаяЗадача, Ресурс, Подразделение, ЕдиницаНормирования, ПрофильРаспределения, СпособПривязки, ИндексСтрокРаспределения, ИсточникПлана) В
	               |				(ВЫБРАТЬ
	               |					вт.Версия КАК Версия,
	               |					вт.УровеньПланирования КАК УровеньПланирования,
	               |					вт.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |					вт.Ресурс КАК Ресурс,
	               |					вт.Подразделение КАК Подразделение,
	               |					вт.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |					вт.ПрофильРаспределения КАК ПрофильРаспределения,
	               |					вт.СпособПривязки КАК СпособПривязки,
	               |					вт.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |					вт.ИсточникПлана КАК ИсточникПлана
	               |				ИЗ
	               |					вт КАК вт)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДанныеПлановТрудозатратРолей.Регистратор КАК Регистратор,
	               |	упоДанныеПлановТрудозатратРолей.Период КАК Период,
	               |	упоДанныеПлановТрудозатратРолей.Версия КАК Версия,
	               |	упоДанныеПлановТрудозатратРолей.УровеньПланирования КАК УровеньПланирования,
	               |	упоДанныеПлановТрудозатратРолей.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановТрудозатратРолей.Ресурс КАК Ресурс,
	               |	упоДанныеПлановТрудозатратРолей.Подразделение КАК Подразделение,
	               |	упоДанныеПлановТрудозатратРолей.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	упоДанныеПлановТрудозатратРолей.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоДанныеПлановТрудозатратРолей.СпособПривязки КАК СпособПривязки,
	               |	упоДанныеПлановТрудозатратРолей.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	упоДанныеПлановТрудозатратРолей.Основной КАК Основной,
	               |	упоДанныеПлановТрудозатратРолей.Количество КАК Количество,
	               |	ВЫБОР
	               |		КОГДА упоДанныеПлановТрудозатратРолей.УчетПериодаРегистрации
	               |				И упоДанныеПлановТрудозатратРолей.Количество = ЕСТЬNULL(вт.Количество, 0)
	               |			ТОГДА ЕСТЬNULL(вт.Стоимость, 0)
	               |		ИНАЧЕ упоДанныеПлановТрудозатратРолей.Стоимость
	               |	КОНЕЦ КАК Стоимость,
	               |	ВЫБОР
	               |		КОГДА упоДанныеПлановТрудозатратРолей.УчетПериодаРегистрации
	               |				И упоДанныеПлановТрудозатратРолей.Количество = ЕСТЬNULL(вт.Количество, 0)
	               |			ТОГДА ЕСТЬNULL(вт.ОбщСтоимость, 0)
	               |		ИНАЧЕ упоДанныеПлановТрудозатратРолей.ОбщСтоимость
	               |	КОНЕЦ КАК ОбщСтоимость,
	               |	ВЫБОР
	               |		КОГДА упоДанныеПлановТрудозатратРолей.УчетПериодаРегистрации
	               |				И упоДанныеПлановТрудозатратРолей.Количество = ЕСТЬNULL(вт.Количество, 0)
	               |			ТОГДА ЕСТЬNULL(вт.ВнешняяСтоимость, 0)
	               |		ИНАЧЕ упоДанныеПлановТрудозатратРолей.ВнешняяСтоимость
	               |	КОНЕЦ КАК ВнешняяСтоимость,
	               |	ВЫБОР
	               |		КОГДА упоДанныеПлановТрудозатратРолей.УчетПериодаРегистрации
	               |				И упоДанныеПлановТрудозатратРолей.Количество = ЕСТЬNULL(вт.Количество, 0)
	               |			ТОГДА ЕСТЬNULL(вт.ОбщВнешняяСтоимость, 0)
	               |		ИНАЧЕ упоДанныеПлановТрудозатратРолей.ОбщВнешняяСтоимость
	               |	КОНЕЦ КАК ОбщВнешняяСтоимость,
	               |	упоДанныеПлановТрудозатратРолей.ИсточникПлана КАК ИсточникПлана
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		упоДанныеПлановТрудозатратРолей.Регистратор КАК Регистратор,
	               |		упоДанныеПлановТрудозатратРолей.Период КАК Период,
	               |		упоДанныеПлановТрудозатратРолей.Версия КАК Версия,
	               |		упоДанныеПлановТрудозатратРолей.УровеньПланирования КАК УровеньПланирования,
	               |		упоДанныеПлановТрудозатратРолей.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |		упоДанныеПлановТрудозатратРолей.Ресурс КАК Ресурс,
	               |		упоДанныеПлановТрудозатратРолей.Подразделение КАК Подразделение,
	               |		упоДанныеПлановТрудозатратРолей.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |		упоДанныеПлановТрудозатратРолей.ПрофильРаспределения КАК ПрофильРаспределения,
	               |		упоДанныеПлановТрудозатратРолей.СпособПривязки КАК СпособПривязки,
	               |		упоДанныеПлановТрудозатратРолей.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |		упоДанныеПлановТрудозатратРолей.Основной КАК Основной,
	               |		упоДанныеПлановТрудозатратРолей.Количество КАК Количество,
	               |		упоДанныеПлановТрудозатратРолей.Стоимость КАК Стоимость,
	               |		упоДанныеПлановТрудозатратРолей.ОбщСтоимость КАК ОбщСтоимость,
	               |		упоДанныеПлановТрудозатратРолей.ВнешняяСтоимость КАК ВнешняяСтоимость,
	               |		упоДанныеПлановТрудозатратРолей.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
	               |		упоДанныеПлановТрудозатратРолей.ИсточникПлана КАК ИсточникПлана,
	               |		упоДанныеПлановТрудозатратРолей.Версия В (&ВерсииПроектов) КАК УчетПериодаРегистрации
	               |	ИЗ
	               |		РегистрСведений.упоДанныеПлановТрудозатратРолей КАК упоДанныеПлановТрудозатратРолей
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_КрайниеРегистраторы КАК вт
	               |			ПО упоДанныеПлановТрудозатратРолей.Регистратор = вт.Регистратор
	               |				И упоДанныеПлановТрудозатратРолей.Версия = вт.Версия) КАК упоДанныеПлановТрудозатратРолей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО упоДанныеПлановТрудозатратРолей.Версия = вт.Версия
	               |			И упоДанныеПлановТрудозатратРолей.УровеньПланирования = вт.УровеньПланирования
	               |			И упоДанныеПлановТрудозатратРолей.ПроектнаяЗадача = вт.ПроектнаяЗадача
	               |			И упоДанныеПлановТрудозатратРолей.Ресурс = вт.Ресурс
	               |			И упоДанныеПлановТрудозатратРолей.Подразделение = вт.Подразделение
	               |			И упоДанныеПлановТрудозатратРолей.ЕдиницаНормирования = вт.ЕдиницаНормирования
	               |			И упоДанныеПлановТрудозатратРолей.ПрофильРаспределения = вт.ПрофильРаспределения
	               |			И упоДанныеПлановТрудозатратРолей.СпособПривязки = вт.СпособПривязки
	               |			И упоДанныеПлановТрудозатратРолей.ИндексСтрокРаспределения = вт.ИндексСтрокРаспределения
	               |			И упоДанныеПлановТрудозатратРолей.ИсточникПлана = вт.ИсточникПлана
	               |ИТОГИ ПО
	               |	Регистратор";
	
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		Выборка = ВыборкаРегистратор.Выбрать();
		
		НаборЗаписей_упоДанныеПлановТрудозатратРолей =
			РегистрыСведений.упоДанныеПлановТрудозатратРолей.СоздатьНаборЗаписей();
		НаборЗаписей_упоДанныеПлановТрудозатратРолей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = НаборЗаписей_упоДанныеПлановТрудозатратРолей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		
		МассивНаборовЗаписей.Добавить(НаборЗаписей_упоДанныеПлановТрудозатратРолей);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСтоимостьПоНормеЗаДень(СтрокиНорм, День, ДатаИзменения = Неопределено) Экспорт
	
	Результат = 0;
	
	Для Каждого СтрокаНормы Из СтрокиНорм Цикл
		
		Если СтрокаНормы.ПериодНачала <= День И День < СтрокаНормы.ПериодОкончания Тогда
			Результат = СтрокаНормы.СтоимостьЧаса;
            Если НЕ ДатаИзменения = Неопределено Тогда
                ДатаИзменения = СтрокаНормы.ПериодОкончания;
            КонецЕсли;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СвернутьЗатратыТрудовыхРесурсов(ТаблицаДвижений)
	
	Измерения_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия = "";
	Для Каждого Измерение Из Метаданные.РегистрыСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Измерения Цикл
		Измерения_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия = Измерения_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
											+ ?(ЗначениеЗаполнено(Измерения_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия), ", ", "") + Измерение.Имя;
	КонецЦикла;
	
	ТаблицаДвижений.Свернуть(Измерения_упоАктуальныеПланыТрудозатратСводноТекущаяВерсия, "СтоимостьВнешняя, Стоимость, КоличествоЧасов");				
	
КонецФункции

Функция СконвертироватьТаблицуПоДнямВТаблицуПлановыхЗатратТрудовыхРесурсов(ТаблицаПоДням, ПроектнаяЗадача, ВидОперации) 
		
	ТаблицаПоДням.Колонки.Трудозатраты.Имя = "КоличествоЧасов";
	ТаблицаПоДням.Колонки.Операция.Имя = "ПроектнаяЗадача";
	ТаблицаПоДням.Колонки.ВнешняяСтоимость.Имя = "СтоимостьВнешняя";

	ТаблицаПоДням.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("СправочникСсылка.упоВидыОпераций"));
	ТаблицаПоДням.Колонки.Добавить("Обнуление", Новый ОписаниеТипов("Булево"));
	
	ТаблицаПоДням.ЗаполнитьЗначения(ВидОперации, "ВидОперации");
	
	СвернутьЗатратыТрудовыхРесурсов(ТаблицаПоДням);   
	
КонецФункции

// Создает набор записей указанного регистра по таблице доходов и расходов.
//
// Параметры:
//  ИсходнаяТаблицаДвижений - ТаблицаЗначений - таблица, в которую будут записаны данные о трудозатратах.
//  ИмяРегистра - Строка - имя регистра, по которому записываются движения.
//  ДанныеДвижений - Структура - подготовленные к проведению движения ПЗ, если отражение вызвано 
//		непосредственно из документа ПЗ.
//  МассивНаборовЗаписей - Массив - массив наборов записей регистров, которые будут записаны при отражении.
//  ДанныеЗаполнения - Структура - данные заполнения строк.
//  ИспользоватьЗануление - Булево - признак необходимости использования зануления для регистра. 
//  ВАЖНО: Зануление не используется для регистров, содержащих данные ТЧ ПЗ, а также для регистров, где
//	записи трансляции трудозатрат модифицируются только от имени ПЗ.
//
Процедура СоздатьНаборЗаписейПоТаблице(ИсходнаяТаблицаДвижений, ИмяРегистра,  
	ДанныеДвижений, МассивНаборовЗаписей, ДанныеЗаполнения, ИспользоватьЗануление = Ложь)
	
	ЭтоДвиженияПЗ = НЕ ДанныеДвижений = Неопределено;
			
	Если ЭтоДвиженияПЗ Тогда		
		НаборЗаписей = ДанныеДвижений[ИмяРегистра];
	Иначе
		// Если ранее была загрузка данных из версии в проект, необходимо прежде очистить записи с регистратором по версии.
		РегистраторОтбор = ДанныеЗаполнения.Версия;
		ИмяИзмерения = "ПроектнаяЗадача";
		ИзмерениеОтбор = ДанныеЗаполнения.ПроектнаяЗадача;
		УдалитьЗаписиРегистраПоОтбору(ИмяРегистра, РегистраторОтбор, ИзмерениеОтбор, ИмяИзмерения);
		
		РегистраторОтбор = ДанныеЗаполнения.ПроектнаяЗадача;
		ИмяИзмерения = "ИсточникПлана";
		ИзмерениеОтбор = ДанныеЗаполнения.ИсточникПлана;
		УдалитьЗаписиРегистраПоОтбору(ИмяРегистра, РегистраторОтбор, ИзмерениеОтбор, ИмяИзмерения);
		
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДанныеЗаполнения.ПроектнаяЗадача);
		НаборЗаписей.Прочитать();
	КонецЕсли;
	
	ТолькоЗануление = ИсходнаяТаблицаДвижений = Неопределено И ИспользоватьЗануление = Истина;
	
	Если НЕ ТолькоЗануление Тогда
		
		ТаблицаДвижений = ИсходнаяТаблицаДвижений.Скопировать();		
		
		РеквизитКакИзмерение = Ложь;
		
		Если ИмяРегистра = "упоДанныеПлановДоходовИРасходовПодразделения" Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "ДатаНачисления");	
			РеквизитКакИзмерение = Истина;
		КонецЕсли;	
		
		упоФункцииОбщегоНазначенияСервер.СвернутьТаблицуДвижений(ТаблицаДвижений, ИмяРегистра, РеквизитКакИзмерение);							
									
		// Записи добавляются в исходный набор, в котором могут быть добавлены
		// записи обычного плана БДР (ИсточникПлана <> Трудозатраты).
		Для Каждого Движение Из ТаблицаДвижений Цикл
			НоваяЗапись = НаборЗаписей.Добавить();			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Движение);	
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ДанныеЗаполнения);		
			НоваяЗапись.Регистратор = ДанныеЗаполнения.ПроектнаяЗадача;
		КонецЦикла;	
		
	КонецЕсли;	
	
	// Зануление регистра.
	Если ИспользоватьЗануление Тогда				
		ДанныеОбработки = Новый Структура ("Регистратор, Период, МассивЗадач, ИмяРегистра",
			ДанныеЗаполнения.ПроектнаяЗадача, ДанныеЗаполнения.Период, ДанныеЗаполнения.ПроектнаяЗадача, ИмяРегистра);
		упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(НаборЗаписей, ДанныеОбработки,,,
			"Версия = &Версия И ИсточникПлана = &ИсточникПлана", 
			Новый Структура("Версия, ИсточникПлана", ДанныеЗаполнения.Версия, ДанныеЗаполнения.ИсточникПлана), 
			Ложь);	
	КонецЕсли;					
					
	Если НЕ ЭтоДвиженияПЗ Тогда
		МассивНаборовЗаписей.Добавить(НаборЗаписей);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЗаписиРегистраПоОтбору(ИмяРегистра, РегистраторОтбор, ИзмерениеОтбор, ИмяИзмерения = "")
	
	ЗаписиКУдалению = Новый Массив;
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(РегистраторОтбор);
	НаборЗаписей.Прочитать();
	Если Не НаборЗаписей.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяИзмерения) Тогда
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если ЗаписьНабора[ИмяИзмерения] = ИзмерениеОтбор Тогда
			ЗаписиКУдалению.Добавить(ЗаписьНабора);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЗаписьКУдалению Из ЗаписиКУдалению Цикл
		НаборЗаписей.Удалить(ЗаписьКУдалению);
	КонецЦикла;
	
	Если ЗаписиКУдалению.Количество() Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаРаспределениеПоСтатьямДляСводнойТаблицы()
	
	ТекстЗапроса = "ВЫБРАТЬ
		|	ТЗ.Ресурс КАК Ресурс,
		|	ТЗ.ОбщСтоимость КАК Стоимость,
		|	ТЗ.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ.Ресурс КАК Ресурс,
		|	ТЗ.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(упоРаспределениеРесурсовПоСтатьямЗатрат.СтатьяЗатрат, ЗНАЧЕНИЕ(Справочник.упоСтатьиЗатрат.ПустаяСсылка)) КАК Статья,
		|	СУММА(ВЫБОР
		|			КОГДА упоРаспределениеРесурсовПоСтатьямЗатрат.ДоляСуммы ЕСТЬ NULL
		|				ТОГДА ТЗ.Стоимость
		|			ИНАЧЕ ТЗ.Стоимость * (упоРаспределениеРесурсовПоСтатьямЗатрат.ДоляСуммы / 100)
		|		КОНЕЦ) КАК Сумма,
		|	упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты КАК СпособПривязки,
		|	ВЫБОР
		|		КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
		|			ТОГДА упоСтатьиЗатрат.ПрофильРаспределенияРасходовТрудозатраты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка)
		|	КОНЕЦ КАК ПрофильРаспределения,
		|	ВЫБОР
		|		КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно)
		|			ТОГДА упоСтатьиЗатрат.ПериодАгрегацииРасходовТрудозатраты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоПериодыАгрегацииЗатрат.ПустаяСсылка)
		|	КОНЕЦ КАК ПериодАгрегации,
		|	упоСтатьиЗатрат.КонтрагентРасходовТрудозатраты КАК Контрагент,
		|	упоСтатьиЗатрат.ДоговорРасходовТрудозатраты КАК Договор,
		|	ЕСТЬNULL(упоРаспределениеРесурсовПоСтатьямЗатрат.ДоляСуммы, 0) КАК ДоляСуммы
		|ИЗ
		|	ТЗ КАК ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРаспределениеРесурсовПоСтатьямЗатрат КАК упоРаспределениеРесурсовПоСтатьямЗатрат
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоСтатьиЗатрат КАК упоСтатьиЗатрат
		|			ПО упоРаспределениеРесурсовПоСтатьямЗатрат.СтатьяЗатрат = упоСтатьиЗатрат.Ссылка
		|		ПО ТЗ.Ресурс = упоРаспределениеРесурсовПоСтатьямЗатрат.Ресурс
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ.Ресурс,
		|	ТЗ.Подразделение,
		|	упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты,
		|	упоСтатьиЗатрат.КонтрагентРасходовТрудозатраты,
		|	упоСтатьиЗатрат.ДоговорРасходовТрудозатраты,
		|	ЕСТЬNULL(упоРаспределениеРесурсовПоСтатьямЗатрат.СтатьяЗатрат, ЗНАЧЕНИЕ(Справочник.упоСтатьиЗатрат.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
		|			ТОГДА упоСтатьиЗатрат.ПрофильРаспределенияРасходовТрудозатраты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно)
		|			ТОГДА упоСтатьиЗатрат.ПериодАгрегацииРасходовТрудозатраты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоПериодыАгрегацииЗатрат.ПустаяСсылка)
		|	КОНЕЦ,
		|	ЕСТЬNULL(упоРаспределениеРесурсовПоСтатьямЗатрат.ДоляСуммы, 0)";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить("ТЗ.ЕдиницаНормирования");
	
	СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить("ТЗ.УровеньПланирования");
	СхемаЗапроса.ПакетЗапросов[1].Операторы[0].ВыбираемыеПоля.Добавить("ТЗ.УровеньПланирования");
	
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаТрудовыеРесурсыПоУровнямПланирования(КолонкаСтоимости) Экспорт
	
	ТекстЗапроса = СтрЗаменить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	ТаблицаТрудовыеРесурсы.Ресурс,
				               |	ТаблицаТрудовыеРесурсы.Подразделение,
				               |	ТаблицаТрудовыеРесурсы.УровеньПланирования,
				               |	ТаблицаТрудовыеРесурсы.Количество,
				               |	ТаблицаТрудовыеРесурсы.%КолонкаСтоимости%
				               |ПОМЕСТИТЬ ВТТаблицаТрудовыеРесурсы
				               |ИЗ
				               |	&ТаблицаТрудовыеРесурсы КАК ТаблицаТрудовыеРесурсы
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ ПЕРВЫЕ 1
				               |	1 КАК Поле1
				               |ПОМЕСТИТЬ ВТДанныеОкончательногоУровня
				               |ИЗ
				               |	ВТТаблицаТрудовыеРесурсы КАК ТаблицаТрудовыеРесурсы
				               |ГДЕ
				               |	ТаблицаТрудовыеРесурсы.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
				               |	И ТаблицаТрудовыеРесурсы.Количество <> 0
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	ТаблицаТрудовыеРесурсы.Ресурс,
				               |	ТаблицаТрудовыеРесурсы.Подразделение,
							   |	ТаблицаТрудовыеРесурсы.УровеньПланирования,
				               |	СУММА(ТаблицаТрудовыеРесурсы.Количество) КАК Количество,
				               |	СУММА(ТаблицаТрудовыеРесурсы.%КолонкаСтоимости%) КАК %КолонкаСтоимости%
				               |ИЗ
				               |	ВТТаблицаТрудовыеРесурсы КАК ТаблицаТрудовыеРесурсы
				               |ГДЕ
				               |	ВЫБОР
				               |			КОГДА 1 В
				               |					(ВЫБРАТЬ
				               |						ВТДанныеОкончательногоУровня.Поле1
				               |					ИЗ
				               |						ВТДанныеОкончательногоУровня)
				               |				ТОГДА ТаблицаТрудовыеРесурсы.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
				               |			ИНАЧЕ ТаблицаТрудовыеРесурсы.УровеньПланирования <> ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
				               |		КОНЕЦ
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ТаблицаТрудовыеРесурсы.Ресурс,
				               |	ТаблицаТрудовыеРесурсы.Подразделение,
							   |	ТаблицаТрудовыеРесурсы.УровеньПланирования",
							   "%КолонкаСтоимости%", КолонкаСтоимости);
	Возврат ТекстЗапроса;
	
КонецФункции

// Заполняет план расходов по трудовым ресурсам при фоновом отражении затрат в БДР.
//
// Параметры:
//  Проект - СправочникСсылка.Проекты - проект ПЗ, указывается при заполнении из формы ПЗ.
//  ТаблицаТрудовыеРесурсы	- ТаблицаЗначенией - Табличная часть ТрудовыеРесурсы документа упоПроектнаяЗадача.
//  ТаблицаПланРасходов	- ТаблицаЗначений - Состав колонок см. ШаблонТаблицыРасходов().
//  УровеньПланированияТрудозатратДляБДР - ПеречислениеСсылка.упоУровеньПланированияТрудозатратДляБДР - отбор уровня
//      трудозатрат, которые пойдут в БДР,
//  	указывается при заполнении из отражения трудозатрат.
//
Процедура ОтразитьТрудовыеРесурсыВПланеРасходов(Проект, ТаблицаТрудовыеРесурсы, ТаблицаПланРасходов,
		УровеньПланированияТрудозатратДляБДР = Неопределено,
		Знач СтартовыйИндекс = 0) Экспорт
	
	ВалютаУпрУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	ЗначенияПоУмолчанию = упоАналитикаПоПодразделениямСервер.ПолучитьЗначенияДляПодстановкиПоУмолчанию(Проект);
	
	ДобавленныеСтрокиПланаРасходов = Новый Массив;
	
	КолонкаСтоимость = "ОбщСтоимость";
	ТаблицаТрудовыеРесурсыПоУровням = ТаблицаТрудовыхРесурсовПоУровням(ТаблицаТрудовыеРесурсы, КолонкаСтоимость,
			УровеньПланированияТрудозатратДляБДР);
	
	ТекстЗапроса = ТекстЗапросаРаспределениеПоСтатьямДляСводнойТаблицы();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТрудовыеРесурсыПоУровням);
	
	ТаблицаРаспределениеПоСтатьям = Запрос.Выполнить().Выгрузить();
		
	Для Каждого СтрокаРаспределенияПоСтатьям Из ТаблицаРаспределениеПоСтатьям Цикл
		
		НоваяСтрока = ТаблицаПланРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределенияПоСтатьям);
		НоваяСтрока.Валюта = ВалютаУпрУчета;
		
		НоваяСтрока.СобствСилы_Субподряд = упоАналитикаПоПодразделениямСервер.СССП_Роли(СтрокаРаспределенияПоСтатьям.Ресурс);
		Если Не ЗначениеЗаполнено(НоваяСтрока.СпособПривязки) Тогда
			НоваяСтрока.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения;
			НоваяСтрока.ПрофильРаспределения = ЗначенияПоУмолчанию.ПрофильРасходовПоУмолчанию;
		КонецЕсли;
		
    КонецЦикла;
    
	// Установим индекс строк распределения в разрезе статей.
	ТаблицаРаспределениеПоСтатьямКопия = ТаблицаРаспределениеПоСтатьям.Скопировать();
	ТаблицаРаспределениеПоСтатьямКопия.Свернуть("Статья");
	СтатьиЗатрат = ТаблицаРаспределениеПоСтатьямКопия.ВыгрузитьКолонку("Статья");
	
	ИндексСтрокРаспределения = СтартовыйИндекс;
	Для каждого Статья Из СтатьиЗатрат Цикл
		
		ПараметрыОтбора = Новый Структура("Статья", Статья);
		НайденныеСтроки = ТаблицаПланРасходов.НайтиСтроки(ПараметрыОтбора);
		
		Если Не НайденныеСтроки.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого Строка Из НайденныеСтроки Цикл
			Строка.ИндексСтрокРаспределения = ИндексСтрокРаспределения;
			Строка.ИндексСтрокиВладельца = ИндексСтрокРаспределения;
		КонецЦикла;
		
		ИндексСтрокРаспределения = ИндексСтрокРаспределения + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УровеньПланированияПоУровнюПланированияТрудозатратДляБДР(УровеньПланированияТрудозатратДляБДР)
	
	УровеньПланирования = Неопределено;
	
	Если УровеньПланированияТрудозатратДляБДР = Перечисления.упоУровеньПланированияТрудозатратДляБДР.ОкончательныйПоРолям Тогда
		УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;	
	ИначеЕсли УровеньПланированияТрудозатратДляБДР = Перечисления.упоУровеньПланированияТрудозатратДляБДР.ПредварительныйПоРолям Тогда
		УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;		
	КонецЕсли;
	
	Возврат УровеньПланирования;
	
КонецФункции	

Функция ШаблонТаблицыРасходов()
	
	ТабЧасти = Метаданные.Документы.упоПроектнаяЗадача.ТабличныеЧасти;
	
	Таблица = Новый ТаблицаЗначений;
	КолонкиТаблицы = Таблица.Колонки;
		
	Для Каждого Реквизит Из ТабЧасти.ПланРасходов.Реквизиты Цикл				
		ПроверитьДобавитьКолонку(КолонкиТаблицы, Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
		
	КолонкиТаблицы.Добавить("ДоляСуммы");
	КолонкиТаблицы.Добавить("Ресурс");
	КолонкиТаблицы.Добавить("Подразделение");
	КолонкиТаблицы.Добавить("УровеньПланирования");
	КолонкиТаблицы.Добавить("СобствСилы_Субподряд");	
	КолонкиТаблицы.Добавить("ДатаНачисления");	
	КолонкиТаблицы.Добавить("ЕдиницаНормирования");
	КолонкиТаблицы.Добавить("ИндексСтрокиВладельца");	
	КолонкиТаблицы.Добавить("СуммаВалютная");	
	
	Возврат Таблица;	
	
КонецФункции

Функция ШаблонТаблицыПоДням(ПериодыАгрегации)
	
	Таблица = Новый ТаблицаЗначений;
	Для Каждого ПериодАгрегации Из ПериодыАгрегации Цикл
		Таблица.Колонки.Добавить(ПериодАгрегации.Значение, Новый ОписаниеТипов("Дата"));
	КонецЦикла;
	Таблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	Возврат Таблица;
	
КонецФункции

Функция ТаблицаЗадачи(ПроектнаяЗадача, ДатаНач, ДатаКон)
	
	ТаблицаЗадач = Новый ТаблицаЗначений;
	ТаблицаЗадач.Колонки.Добавить("Задача");
	ТаблицаЗадач.Колонки.Добавить("ДатаНачала");
	ТаблицаЗадач.Колонки.Добавить("ДатаЗавершения");
	
	НоваяСтрока = ТаблицаЗадач.Добавить();
	НоваяСтрока.Задача = ПроектнаяЗадача;
	НоваяСтрока.ДатаНачала = ДатаНач;
	НоваяСтрока.ДатаЗавершения = ДатаКон;	
	
	Возврат ТаблицаЗадач;
	
КонецФункции	

Процедура ПроверитьДобавитьКолонку(КолонкиТаблицы, ИмяКолонки, ТипКолонки = Неопределено)
	Если КолонкиТаблицы.Найти(ИмяКолонки) = Неопределено Тогда
		КолонкиТаблицы.Добавить(ИмяКолонки, ТипКолонки);
	КонецЕсли;			
КонецПроцедуры	

Функция КонецПериодаАгрегации(Дата, Знач ВидПериодаАгрегации)
	
	МенеджерАгрегации = Перечисления.упоПериодыАгрегацииЗатрат;
	
	Если НЕ ЗначениеЗаполнено(ВидПериодаАгрегации) Тогда
		ВидПериодаАгрегации = МенеджерАгрегации.Месяц;
	КонецЕсли;
			
	Если ВидПериодаАгрегации = МенеджерАгрегации.Год Тогда
		КонецПериода = КонецГода(Дата);
	ИначеЕсли ВидПериодаАгрегации = МенеджерАгрегации.Полугодие Тогда		
		НомерМесяца = Месяц(Дата);
		Если НомерМесяца > 6 Тогда
			КонецПериода = КонецГода(Дата);
		Иначе
			КонецПериода = Дата(Год(Дата), 6, 30);
		КонецЕсли;	
	ИначеЕсли ВидПериодаАгрегации = МенеджерАгрегации.Квартал Тогда
		КонецПериода = КонецКвартала(Дата);
	ИначеЕсли ВидПериодаАгрегации = МенеджерАгрегации.Месяц Тогда
		КонецПериода = КонецМесяца(Дата);
	ИначеЕсли ВидПериодаАгрегации = МенеджерАгрегации.ДвеНедели Тогда
		НомерДня = День(Дата);
		Если НомерДня > 14 Тогда
			КонецПериода = КонецМесяца(Дата);
		Иначе
			КонецПериода = Дата(Год(Дата), Месяц(Дата), 14);
		КонецЕсли;	
	ИначеЕсли ВидПериодаАгрегации = МенеджерАгрегации.Декада Тогда
		НомерДня = День(Дата);
		Если НомерДня > 20 Тогда
			КонецПериода = КонецМесяца(Дата);
		ИначеЕсли НомерДня > 10 Тогда
			КонецПериода = Дата(Год(Дата), Месяц(Дата), 20);
		Иначе
			КонецПериода = Дата(Год(Дата), Месяц(Дата), 10);
		КонецЕсли;	
	ИначеЕсли ВидПериодаАгрегации = МенеджерАгрегации.Неделя Тогда
		НомерДня = День(Дата);
		Если НомерДня > 21 Тогда
			КонецПериода = КонецМесяца(Дата);		
		ИначеЕсли НомерДня > 14 Тогда
			КонецПериода = Дата(Год(Дата), Месяц(Дата), 21);	
		ИначеЕсли НомерДня > 7 Тогда
			КонецПериода = Дата(Год(Дата), Месяц(Дата), 14);		
		Иначе	
			КонецПериода = Дата(Год(Дата), Месяц(Дата), 7);
		КонецЕсли;
	ИначеЕсли ВидПериодаАгрегации = МенеджерАгрегации.День Тогда
		КонецПериода = Дата;	
	КонецЕсли;	
	
	КонецПериода = КонецДня(КонецПериода);
	
	Возврат КонецПериода;
	
КонецФункции

Процедура ДополнитьДанныеПланаДДСДаннымиПланаБДР(ТаблицаДДС, ТаблицаБДР, ПроектнаяЗадача, Проект)
	
	СхемаОплатыПЗ_Доходы = Неопределено;
	СхемаОплатыПЗ_Расходы = Неопределено;
	ПолучитьСхемыОплатыПроектнойЗадачи(ПроектнаяЗадача, СхемаОплатыПЗ_Доходы, СхемаОплатыПЗ_Расходы);
	
	ПараметрыРасчетаДДС = упоДвиженияДенежныхСредствКлиентСервер.ПараметрыРасчетаДДСПоБДР(ПроектнаяЗадача, Проект,,
		СхемаОплатыПЗ_Доходы, СхемаОплатыПЗ_Расходы,, Истина);
	
	упоДвиженияДенежныхСредствСервер.ДополнитьДанныеПланаДДСДаннымиПланаБДР(ТаблицаДДС, ТаблицаБДР, ПараметрыРасчетаДДС);
	
КонецПроцедуры

Процедура ПолучитьСхемыОплатыПроектнойЗадачи(ПроектнаяЗадача, СхемаОплатыПЗ_Доходы, СхемаОплатыПЗ_Расходы)

	Если ПроектнаяЗадача = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	СвойстваПЗ = "СхемаОплатыПоУмолчаниюДоходы, СхемаОплатыПоУмолчаниюРасходы"; 
	
	СхемыОплатыПЗ = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектнойЗадачи(ПроектнаяЗадача, СвойстваПЗ);
	
	СхемаОплатыПЗ_Доходы = СхемыОплатыПЗ.СхемаОплатыПоУмолчаниюДоходы;
	СхемаОплатыПЗ_Расходы = СхемыОплатыПЗ.СхемаОплатыПоУмолчаниюРасходы;
	
КонецПроцедуры

Функция ВерсииПроектов(Проекты)
	
	ВерсииПроектов = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Проекты) Тогда
		Возврат ВерсииПроектов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проекты", Проекты);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВерсииПроекта.Версия КАК Версия
	               |ИЗ
	               |	РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |ГДЕ
	               |	упоВерсииПроекта.Проект В (&Проекты)";
	
	Результат = Запрос.Выполнить();
	Версии = Результат.Выгрузить().ВыгрузитьКолонку("Версия");
	
	Возврат Версии;
	
КонецФункции

Процедура ДобавитьРесурс(Массив, Ресурс)
	
	Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.упоТрудовыеРесурсы") 
		Или ТипЗнч(Ресурс) = Тип("СправочникСсылка.упоРоли") Тогда
		Массив.Добавить(Ресурс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьТрудозатратыПриИзмененииНормСтоимости(ДокументРегистрация, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументРегистрация.ДополнительныеСвойства.Свойство("ОтключитьАвтоматическоеОтражениеТрудозатрат") Тогда
		Возврат;
	КонецЕсли;
	
	Ресурсы = РесурсыДокументаРегистрация(ДокументРегистрация);
	Если Не ЗначениеЗаполнено(Ресурсы)Тогда
		Возврат;
	КонецЕсли;
	
	ПроектныеЗадачи = ПроектныеЗадачиРесурсовНаДатуРегистрацииНормыСтоимости(Ресурсы, ДокументРегистрация.Дата);
	Если Не ЗначениеЗаполнено(ПроектныеЗадачи) Тогда
		Возврат;
	КонецЕсли;
	
	// Принудительная запись движений для получения актуальных норм стоимости при отражении внутри транзакции проведения.
	ДокументРегистрация.Движения.упоНормыСтоимостиРесурсов.Записать();
	
	ОтразитьПлановыеТрудозатратыЗадачи(ПроектныеЗадачи, ДокументРегистрация.Ссылка);
	
КонецПроцедуры

Функция РесурсыДокументаРегистрация(ДокументРегистрация)
	
	МассивРесурсов = Новый Массив;
	
	Если ТипЗнч(ДокументРегистрация.Ссылка) = Тип("ДокументСсылка.упоРегистрацияСтоимостиРесурса") Тогда
		ДобавитьРесурс(МассивРесурсов, ДокументРегистрация.Ресурс);
	ИначеЕсли ТипЗнч(ДокументРегистрация.Ссылка) = Тип("ДокументСсылка.упоРегистрацияСтоимостиРесурсов") Тогда
		Для Каждого Строка Из ДокументРегистрация.РегистрируемыеРесурсы Цикл
			ДобавитьРесурс(МассивРесурсов, Строка.Ресурс);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивРесурсов;
	
КонецФункции

Функция ПроектныеЗадачиРесурсовНаДатуРегистрацииНормыСтоимости(Ресурсы, Дата)
	
	ПроектныеЗадачи = Новый Массив;
	
	СтатусыИсключения = Новый Массив;
	СтатусыИсключения.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Завершена);
	СтатусыИсключения.Добавить(Перечисления.упоСостояниеСтатусаЗадачи.Закрыта);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРесурсов", Ресурсы);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивСтатусов", СтатусыИсключения);
	
	// Запрос выполняется в рамках проведения документов в привилегированном режиме при проведении.
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоТрудозатратыПлан.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_ПЗТР
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоТрудозатратыПлан
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК упоНастройкаАналитикиВРазрезеПодразделений
	               |		ПО упоТрудозатратыПлан.Проект = упоНастройкаАналитикиВРазрезеПодразделений.Объект
	               |			И (упоНастройкаАналитикиВРазрезеПодразделений.УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат)
	               |ГДЕ
	               |	упоТрудозатратыПлан.Ресурс В(&МассивРесурсов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоТрудозатратыПлан.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоВерсииПроекта.Версия КАК Версия,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_Сроки
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, ) КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСрокиПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПЗТР КАК ВТ_ПЗТР
	               |		ПО упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача = ВТ_ПЗТР.ПроектнаяЗадача
	               |ГДЕ
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан <= &Дата
	               |	И упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан >= &Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСтатусыПроектныхЗадачСрезПоследних.Версия КАК Версия,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ВТ_Статусы
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |			,
	               |			(Версия, ПроектнаяЗадача) В
	               |				(ВЫБРАТЬ
	               |					ВТ_Сроки.Версия КАК Версия,
	               |					ВТ_Сроки.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |				ИЗ
	               |					ВТ_Сроки КАК ВТ_Сроки)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	НЕ упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи В (&МассивСтатусов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			(Версия, ПроектнаяЗадача) В
	               |				(ВЫБРАТЬ
	               |					ВТ_Статусы.Версия КАК Версия,
	               |					ВТ_Статусы.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |				ИЗ
	               |					ВТ_Статусы КАК ВТ_Статусы)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ПроектныеЗадачи = Результат.Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
	КонецЕсли;
	
	Возврат ПроектныеЗадачи;
	
КонецФункции

Функция ПолучитьСтоимостьЧасаРесурса(ТаблицаСтоимостиПоНорме, СтрокаРесурс, НормаСтоимостиТрудовыхРесурсов,
		СтрокиНорм = Неопределено, УчитыватьПериодРегистрацииНормСтоимости)
	
	// Для полученных ресурсов получим единицу стоимости по норме.
	СтрокиНорм = ТаблицаСтоимостиПоНорме.НайтиСтроки(Новый Структура("Ресурс, Норма",
		СтрокаРесурс.Ресурс, НормаСтоимостиТрудовыхРесурсов));
	
	// Когда ТР назначен, но его норма стоимости не внесена, берем норму стоимости из его роли.
	Если Не ЗначениеЗаполнено(СтрокиНорм) Тогда								
		СтрокиНорм = ТаблицаСтоимостиПоНорме.НайтиСтроки(Новый Структура("Ресурс, Норма",
			СтрокаРесурс.Роль, НормаСтоимостиТрудовыхРесурсов)); 
	КонецЕсли;
		
	Если УчитыватьПериодРегистрацииНормСтоимости Тогда
		СтоимостьЧаса = 0;
	Иначе
		Если СтрокиНорм.Количество() Тогда
			// Пересчитаем стоимость по норме трудового ресурса.
			СтоимостьЧаса = СтрокиНорм[0].СтоимостьЧаса;
		Иначе
			// Если норма не зарегистрирована, пишем 0.
			СтоимостьЧаса = 0;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат СтоимостьЧаса;
	
КонецФункции

#КонецОбласти

#Область РаспределениеРесурсовПоДням

// Получает дерево трудозатрат ресурсов по дням.
//
// Параметры:
//  ТаблицаРесурсов  - ТаблицаЗначений - Таблица распределяемых ресурсов.
//                 
//  СтруктураПараметров  - Структура - Ключи: 
//                 * ДанныеДокумента - Структура.
//                 * Календарь - СправочникСсылка.упоРабочиеКалендари.
//                 * НачДата - Дата.
//                 * КонДата - Дата.
// Возвращаемое значение:
//  ДеревоЗначений.
//
Функция ПолучитьТрудозатратыПоДням(СвойстваЗадачи,
		ТрудовыеРесурсы_Роли,
		ТрудовыеРесурсыПоПериодам,
		ПараметрыРаспределения,
		ИндексыБылоСтало = Неопределено)
	
	Если Не ЗначениеЗаполнено(ТрудовыеРесурсы_Роли) Тогда
		Возврат СоздатьДеревоДанныеРасчета();
	КонецЕсли;
	
	ОбщаяТаблицаРесурсов = ДобавитьНазначенныеТрудовыеРесурсы(СвойстваЗадачи, ТрудовыеРесурсы_Роли);
	
	Если Не ЗначениеЗаполнено(ОбщаяТаблицаРесурсов) Тогда
		Возврат СоздатьДеревоДанныеРасчета();
	КонецЕсли;
	
	ТрудозатратыПоДням = РаспределитьПоДолеТрудозатрат_ПоПрофилям(ОбщаяТаблицаРесурсов,
		СвойстваЗадачи.Календарь, СвойстваЗадачи.ДатаНач, СвойстваЗадачи.ДатаКон);
	
	Если Не ЗначениеЗаполнено(ТрудозатратыПоДням) Тогда
		Возврат СоздатьДеревоДанныеРасчета();
	КонецЕсли;
	
	РаспределитьПоДолеТрудозатрат_ПоМесяцам(ОбщаяТаблицаРесурсов,
		ТрудовыеРесурсыПоПериодам,
		СвойстваЗадачи.Календарь,
		СвойстваЗадачи.ДатаНач,
		СвойстваЗадачи.ДатаКон,
		ТрудозатратыПоДням,
		ИндексыБылоСтало);
	
	Если ПараметрыРаспределения.ИспользуетсяРаспределениеРесурсовПоДням Тогда
		РаспределитьПоРучномуРаспределениюТР(СвойстваЗадачи.ПроектнаяЗадача, 
			ТрудовыеРесурсы_Роли, ОбщаяТаблицаРесурсов, ТрудозатратыПоДням);
	КонецЕсли;
		
	Если ПараметрыРаспределения.ИспользуетсяОперЗагрузка Тогда
		РаспределитьПоОперативнойЗагрузке(СвойстваЗадачи.ПроектнаяЗадача, 
			СвойстваЗадачи.ТекущаяВерсия, ОбщаяТаблицаРесурсов, ТрудозатратыПоДням);
	КонецЕсли;
	
	Возврат ТрудозатратыПоДням;
	
КонецФункции

// Перестраивает таблицу трудовых ресурсов для распределения трудозатрат
// в зависимости от режима, указанного в проектной задаче.
//
// Параметры:
//  ПроектнаяЗадача	– ДокументСсылка.упоПроектнаяЗадача. 
//  ТрудовыеРесурсы	– ТаблицаЗначений - исходная таблица
//					  трудовых ресурсов и профилей.
//
// Возвращаемое значение:
//   ТаблицаЗначений	- подготовленная таблица.
//
Функция ДобавитьНазначенныеТрудовыеРесурсы(СвойстваЗадачи, ТрудовыеРесурсы_Роли)
	
	ТрудовыеРесурсы_Роли.Колонки.Добавить("ВариантРаспределения",
		Новый ОписаниеТипов("ПеречислениеСсылка.упоВариантыРаспределенияТрудозатрат"));
	ТрудовыеРесурсы_Роли.Колонки.Добавить("Роль",
		Новый ОписаниеТипов("СправочникСсылка.упоРоли"));
	ТрудовыеРесурсы_Роли.ЗаполнитьЗначения(Перечисления.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат,
		"ВариантРаспределения");
	ТрудовыеРесурсы_Роли.Колонки.Добавить("ДоляТрудозатрат",
		Новый ОписаниеТипов("Число"));
	
	Если Не СвойстваЗадачи.ПланироватьТрудозатратыНаИсполнителей Тогда
		Возврат ТрудовыеРесурсы_Роли;
	КонецЕсли;
	
	// Получаем текущих исполнителей, назначенных на выполнение проектной задачи.
	
	ТекстЗапроса = ТекстНормыСтоимостиТекущихИсполнителейПЗ();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", СвойстваЗадачи.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекущаяВерсия", СвойстваЗадачи.ТекущаяВерсия);
	Запрос.УстановитьПараметр("ВариантПоДолеТрудозатрат",
		Перечисления.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат);
	Запрос.УстановитьПараметр("НормаСтоимости", СвойстваЗадачи.НормаСтоимостиТрудовыхРесурсов);
	Запрос.УстановитьПараметр("НормаСтоимостиВнешняя", СвойстваЗадачи.ВнешняяНормаСтоимостиТрудовыхРесурсов);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	ИндексПоследнего = РезультатПакета.ВГраница();
	
	НазначенныеТрудовыеРесурсы_ВнутрНорма = РезультатПакета[ИндексПоследнего - 1].Выгрузить();
	НазначенныеТрудовыеРесурсы_ВнешнНорма = РезультатПакета[ИндексПоследнего].Выгрузить();
	
	// Готовим таблицу для результата.
	
	ТаблицаРезультат = ТрудовыеРесурсы_Роли.СкопироватьКолонки();
	ТаблицаРезультат.Колонки.Удалить("Ресурс");
	ТаблицаРезультат.Колонки.Добавить("Ресурс",
		Новый ОписаниеТипов("СправочникСсылка.упоРоли, СправочникСсылка.упоТрудовыеРесурсы"));
	
	ОтборПоНорме = Новый Структура("РольРесурса, Подразделение");
	
	ОтборПоУровнюПланирования = Новый Структура("Ресурс, Подразделение, УровеньПланирования");
	ОтборПоУровнюПланирования.УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
	
	Для каждого СтрокаТР Из ТрудовыеРесурсы_Роли Цикл
		
		СтрокаРезультат = ТаблицаРезультат.Добавить();
		СтрокаРезультат.УровеньПланирования = СтрокаТР.УровеньПланирования;
		ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаТР);
		
		ОтборПоНорме.РольРесурса = СтрокаТР.Ресурс;
		ОтборПоНорме.Подразделение = СтрокаТР.Подразделение;
		
		ОтборПоУровнюПланирования.Ресурс = СтрокаТР.Ресурс;
		ОтборПоУровнюПланирования.Подразделение = СтрокаТР.Подразделение;
		ЕстьОкончательныйУровеньПоРоли = ТрудовыеРесурсы_Роли.НайтиСтроки(ОтборПоУровнюПланирования).Количество() <> 0;
		
		РассчитатьТаблицуРесурсовПоНормам(ТаблицаРезультат,
			НазначенныеТрудовыеРесурсы_ВнутрНорма,
			ОтборПоНорме,
			СтрокаТР,
			ЕстьОкончательныйУровеньПоРоли);
		
		РассчитатьТаблицуРесурсовПоНормам(ТаблицаРезультат,
			НазначенныеТрудовыеРесурсы_ВнешнНорма,
			ОтборПоНорме,
			СтрокаТР,
			ЕстьОкончательныйУровеньПоРоли,
			Истина);
		
	КонецЦикла;
	
	СуммовыеКолонки = Новый Соответствие();
	СуммовыеКолонки.Вставить("Количество", 			Истина);
	СуммовыеКолонки.Вставить("Стоимость", 			Истина);
	СуммовыеКолонки.Вставить("ОбщСтоимость", 		Истина);
	СуммовыеКолонки.Вставить("ВнешняяСтоимость", 	Истина);
	СуммовыеКолонки.Вставить("ОбщВнешняяСтоимость", Истина);
	
	упоСервисныеФункцииВызовСервера.СвернутьТЗ(ТаблицаРезультат, СуммовыеКолонки);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Процедура РассчитатьТаблицуРесурсовПоНормам(ТаблицаРезультат,
		ТаблицаНормыНазначенныхРесурсов,
		ОтборПоНорме,
		СтрокаТР,
		ЕстьОкончательныйУровеньПоРоли,
		ЭтоВнешняяСтоимость = Ложь)
	
	СтрокиЗапроса = ТаблицаНормыНазначенныхРесурсов.НайтиСтроки(ОтборПоНорме);
	
	Если СтрокиЗапроса.Количество() = 0 Тогда
		Возврат; // Никто не был назначен на выполнение роли.
	КонецЕсли;
	
	ШаблонИсключения = "%1,%2";
	Если ЭтоВнешняяСтоимость Тогда
		ИмяКолонкиСтоимость 		= "ВнешняяСтоимость";
		ИмяКолонкиОбщаяСтоимость 	= "ОбщВнешняяСтоимость";
		СвойстваИсключенияЗаполнения = СтрШаблон(ШаблонИсключения, "Стоимость", "ОбщСтоимость");
	Иначе
		ИмяКолонкиСтоимость 		= "Стоимость";
		ИмяКолонкиОбщаяСтоимость 	= "ОбщСтоимость";
		СвойстваИсключенияЗаполнения = СтрШаблон(ШаблонИсключения, "ВнешняяСтоимость", "ОбщВнешняяСтоимость");
	КонецЕсли;
	
	ОкончательныйУровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
	
	// На одну роль может быть назначено несколько исполнителей в этом
	// случае трудозатраты распределяются согласно заданными долям.
	
	Для Каждого СтрокаЗапроса Из СтрокиЗапроса Цикл
		
		ПропуститьОбработкуСтроки = Не НужнаОбработкаСтроки(СтрокаЗапроса,
				ЕстьОкончательныйУровеньПоРоли,
				СтрокаТР.УровеньПланирования);
		
		Если ПропуститьОбработкуСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРезультат = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаТР, , СвойстваИсключенияЗаполнения);
		СтрокаРезультат.Ресурс 						= СтрокаЗапроса.Ресурс;
		СтрокаРезультат.ВариантРаспределения 		= СтрокаЗапроса.ВариантРаспределения;
		СтрокаРезультат.Роль 						= СтрокаТР.Ресурс;
		СтрокаРезультат.Подразделение 				= СтрокаТР.Подразделение;
		СтрокаРезультат.ДоляТрудозатрат 		    = СтрокаЗапроса.ДоляТрудозатрат;    
		СтрокаРезультат.УровеньПланирования 		= ОкончательныйУровеньПланирования;
		СтрокаРезультат[ИмяКолонкиОбщаяСтоимость] 	= СтрокаЗапроса.ЕдСтоимость * СтрокаТР.Количество;
		СтрокаРезультат[ИмяКолонкиСтоимость] 		= СтрокаЗапроса.ЕдСтоимость;
		
		Если Не СтрокаЗапроса.ДоляТрудозатрат = 100 Тогда
			
			// Необходимо уменьшить плановые трудозатраты в соответствии с заданной долей.
			
			Коэффициент = СтрокаЗапроса.ДоляТрудозатрат / 100;
			
			СтрокаРезультат.Количество = Окр(СтрокаРезультат.Количество * Коэффициент, 2);
			СтрокаРезультат[ИмяКолонкиОбщаяСтоимость] = 
				Окр(СтрокаРезультат.Количество * СтрокаРезультат[ИмяКолонкиСтоимость], 2);
			
		КонецЕсли;
		
		Если ЭтоВнешняяСтоимость Тогда
			СтрокаРезультат.Количество = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстНормыСтоимостиТекущихИсполнителейПЗ()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Исполнители.Ресурс КАК Ресурс,
	               |	Исполнители.РольРесурса КАК РольРесурса,
	               |	Исполнители.ДоляТрудозатрат КАК ДоляТрудозатрат,
	               |	Исполнители.Подразделение КАК Подразделение,
	               |	Исполнители.ВариантРаспределения КАК ВариантРаспределения,
	               |	Исполнители.ДоляТрудозатратПоУровнюПланирования КАК ДоляТрудозатратПоУровнюПланирования,
	               |	НЕ(Исполнители.ДоляТрудозатрат = 0
	               |			И Исполнители.ВариантРаспределения = &ВариантПоДолеТрудозатрат) КАК РаспределениеКорректно
	               |ПОМЕСТИТЬ втИсполнители
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |			,
	               |			Версия = &ТекущаяВерсия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК Исполнители
	               |ГДЕ
	               |	Исполнители.РесурсВыделен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ресурс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоНормыСтоимостиРесурсов.Ресурс КАК Ресурс,
	               |	упоНормыСтоимостиРесурсов.ЕдСтоимость КАК ЕдСтоимость,
	               |	упоНормыСтоимостиРесурсов.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	упоНормыСтоимостиРесурсов.Норма КАК Норма
	               |ПОМЕСТИТЬ втНормыИсполнителей
	               |ИЗ
	               |	РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних(
	               |			,
	               |			Ресурс В
	               |					(ВЫБРАТЬ
	               |						втИсполнители.Ресурс
	               |					ИЗ
	               |						втИсполнители
	               |					ГДЕ
	               |						втИсполнители.РаспределениеКорректно)
	               |				И Норма В (&НормаСтоимости, &НормаСтоимостиВнешняя)) КАК упоНормыСтоимостиРесурсов
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ресурс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИсполнители.Ресурс КАК Ресурс,
	               |	втИсполнители.РольРесурса КАК РольРесурса,
	               |	втИсполнители.ДоляТрудозатрат КАК ДоляТрудозатрат,
	               |	втИсполнители.Подразделение КАК Подразделение,
	               |	втИсполнители.ВариантРаспределения КАК ВариантРаспределения,
	               |	ЕСТЬNULL(втНормыИсполнителей.ЕдСтоимость, 0) КАК ЕдСтоимость,
	               |	ЕСТЬNULL(втНормыИсполнителей.ЕдиницаНормирования, НЕОПРЕДЕЛЕНО) КАК ЕдиницаНормирования,
	               |	втИсполнители.ДоляТрудозатратПоУровнюПланирования КАК ДоляТрудозатратПоУровнюПланирования
	               |ИЗ
	               |	втИсполнители КАК втИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втНормыИсполнителей КАК втНормыИсполнителей
	               |		ПО втИсполнители.Ресурс = втНормыИсполнителей.Ресурс
	               |			И (втНормыИсполнителей.Норма = &НормаСтоимости)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втИсполнители.Ресурс КАК Ресурс,
	               |	втИсполнители.РольРесурса КАК РольРесурса,
	               |	втИсполнители.ДоляТрудозатрат КАК ДоляТрудозатрат,
	               |	втИсполнители.Подразделение КАК Подразделение,
	               |	втИсполнители.ВариантРаспределения КАК ВариантРаспределения,
	               |	ЕСТЬNULL(втНормыИсполнителей.ЕдСтоимость, 0) КАК ЕдСтоимость,
	               |	ЕСТЬNULL(втНормыИсполнителей.ЕдиницаНормирования, НЕОПРЕДЕЛЕНО) КАК ЕдиницаНормирования,
	               |	втИсполнители.ДоляТрудозатратПоУровнюПланирования КАК ДоляТрудозатратПоУровнюПланирования
	               |ИЗ
	               |	втИсполнители КАК втИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втНормыИсполнителей КАК втНормыИсполнителей
	               |		ПО втИсполнители.Ресурс = втНормыИсполнителей.Ресурс
	               |			И (втНормыИсполнителей.Норма = &НормаСтоимостиВнешняя)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция НужнаОбработкаСтроки(СтрокаЗапроса, ЕстьОкончательныйУровеньПоРоли, УровеньПланированияПоРоли)
	
	НужнаОбработкаСтроки = Истина;
	
	ВариантРаспределения = СтрокаЗапроса.ВариантРаспределения;
	
	Если ВариантРаспределения = Перечисления.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат Тогда
		
		Если УровеньПланированияПоРоли <> СтрокаЗапроса.ДоляТрудозатратПоУровнюПланирования Тогда
			НужнаОбработкаСтроки = Ложь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаЗапроса.ДоляТрудозатрат) Тогда
			НужнаОбработкаСтроки = Ложь;
		КонецЕсли;
		
	ИначеЕсли ВариантРаспределения = Перечисления.упоВариантыРаспределенияТрудозатрат.РучноеРаспределение 
		Или ВариантРаспределения = Перечисления.упоВариантыРаспределенияТрудозатрат.ПоОперативнойЗагрузке Тогда
		
		Если ЕстьОкончательныйУровеньПоРоли
			И УровеньПланированияПоРоли <> Перечисления.упоУровеньПланирования.Окончательный Тогда
			НужнаОбработкаСтроки = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НужнаОбработкаСтроки;
	
КонецФункции

Процедура РаспределитьПоОперативнойЗагрузке(ПроектнаяЗадача, Версия, ОбщаяТаблицаРесурсов, ТрудозатратыПоДням)
	
	Отбор = Новый Структура("ВариантРаспределения", Перечисления.упоВариантыРаспределенияТрудозатрат.ПоОперативнойЗагрузке);
	СтрокиПоОперативнойЗагрузке = ОбщаяТаблицаРесурсов.НайтиСтроки(Отбор);
	МассивИсполнителей = Новый Массив;
	Для Каждого СтрокаРесурсыПоОперативнойЗагрузке Из СтрокиПоОперативнойЗагрузке Цикл
		МассивИсполнителей.Добавить(СтрокаРесурсыПоОперативнойЗагрузке.Ресурс);
	КонецЦикла;
	
	РезультатТрудозатратыОперЗагрузка = ПолучитьДанныеОперативнойЗагрузкиИсполнителейПроектнойЗадачи(ПроектнаяЗадача, Версия, МассивИсполнителей);
	
	ВыборкаРесурс = РезультатТрудозатратыОперЗагрузка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРесурс.Следующий() Цикл
	
		ВыборкаРоль = ВыборкаРесурс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРоль.Следующий() Цикл
	
			ВыборкаПодразделение = ВыборкаРоль.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПодразделение.Следующий() Цикл
				
				СтрокаТрудозатратыПоДнямТрудовойРесурс = ТрудозатратыПоДням.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТрудозатратыПоДнямТрудовойРесурс, ВыборкаПодразделение);
				СтрокаТрудозатратыПоДнямТрудовойРесурс.УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
				
				ВыборкаДень = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаДень.Следующий() Цикл
					СтрокаТрудозатратыПоДнямДень = СтрокаТрудозатратыПоДнямТрудовойРесурс.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТрудозатратыПоДнямДень, ВыборкаДень);
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьПоРучномуРаспределениюТР(ПроектнаяЗадача, ТрудовыеРесурсы_Роли, ОбщаяТаблицаРесурсов, ТрудозатратыПоДням)
	
	Отбор = Новый Структура("ВариантРаспределения", Перечисления.упоВариантыРаспределенияТрудозатрат.РучноеРаспределение);
	СтрокиРучноеРаспределение = ОбщаяТаблицаРесурсов.НайтиСтроки(Отбор);
	МассивИсполнителейРучногоРаспределения = Новый Массив;
	Для Каждого СтрокаРесурсыРучноеРаспределение Из СтрокиРучноеРаспределение Цикл
		МассивИсполнителейРучногоРаспределения.Добавить(СтрокаРесурсыРучноеРаспределение.Ресурс);
	КонецЦикла;
	
	МассивРолей = ТрудовыеРесурсы_Роли.ВыгрузитьКолонку("Ресурс");
	
	РезультатТрудозатратыРучноеРаспределение = ПолучитьДанныеРучногоРаспределенияТрудозатратТРПроектнойЗадачи(
		ПроектнаяЗадача, 
		МассивРолей, 
		МассивИсполнителейРучногоРаспределения);
	
	ВыборкаРесурс = РезультатТрудозатратыРучноеРаспределение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРесурс.Следующий() Цикл
		
		СтрокаТрудозатратыПоДнямТрудовойРесурс = ТрудозатратыПоДням.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТрудозатратыПоДнямТрудовойРесурс, ВыборкаРесурс);
		СтрокаТрудозатратыПоДнямТрудовойРесурс.УровеньПланирования = Перечисления.упоУровеньПланирования.Окончательный;
		
		ВыборкаДень = ВыборкаРесурс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДень.Следующий() Цикл
			СтрокаТрудозатратыПоДнямДень = СтрокаТрудозатратыПоДнямТрудовойРесурс.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТрудозатратыПоДнямДень, ВыборкаДень);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Функция РаспределитьПоДолеТрудозатрат_ПоПрофилям(ОбщаяТаблицаРесурсов, Календарь, НачДата, КонДата) 
	
	ОтборСтрок = Новый Структура("ВариантРаспределения",  
						Перечисления.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат);
						
	ОтобранныеСтроки = ОбщаяТаблицаРесурсов.НайтиСтроки(ОтборСтрок);
	
	СтрокиПоПрофилю = Новый Массив;
	
	Для Каждого СтрокаПоДоле Из ОтобранныеСтроки Цикл
		Если СтрокаПоДоле.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаПоДоле.СпособПривязки) Тогда
			СтрокиПоПрофилю.Добавить(СтрокаПоДоле);
		КонецЕсли;
	КонецЦикла;
						
	ТаблицаРесурсовДляРаспределения = ОбщаяТаблицаРесурсов.Скопировать(СтрокиПоПрофилю);
		
	ТрудозатратыПоДням = РаспределитьТрудозатратыПоПрофилям(ТаблицаРесурсовДляРаспределения,
															Календарь,
															НачДата,
															КонДата);
															
	Возврат ТрудозатратыПоДням;					
	
КонецФункции

Процедура РаспределитьПоДолеТрудозатрат_ПоМесяцам(ОбщаяТаблицаРесурсов, ТрудовыеРесурсыПоПериодам, Календарь, НачДата,
	КонДата, ТрудозатратыПоДням, ИндексыБылоСтало) 
	
	ОтборСтрок = Новый Структура("СпособПривязки, ВариантРаспределения", 
		Перечисления.упоСпособПривязкиРаспределения.Вручную, 
		Перечисления.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат);
	ТемпТаблицаРесурсовДляРаспределенияСРучнойПривязкой = ОбщаяТаблицаРесурсов.Скопировать(ОтборСтрок);
	
	// Создадим ТЗ ТаблицаРесурсовДляРаспределенияСРучнойПривязкой и соберем в нее данные распределения
	// с учетом ручной привязки по месяцам. Далее дополним полученным результатом ТЗ ТрудозатратыПоДням.
	ТаблицаРесурсовДляРаспределенияСРучнойПривязкой = НоваяТаблицаРесурсовСРучнойПривязкой(ОбщаяТаблицаРесурсов);
	
	ДанныеПолногоПериода = ДанныеПолногоПериода(НачДата, КонДата);
	
	РаспределеныВсеСуммыЦикла = Ложь;
	
	Если ЗначениеЗаполнено(ИндексыБылоСтало) Тогда	
		ПересчитатьИндексыТрудовыхРесурсовПоПериодам(ТрудовыеРесурсыПоПериодам, ИндексыБылоСтало); 
	КонецЕсли;

	// Заполняем ТЗ ТаблицаРесурсовДляРаспределенияСРучнойПривязкой.
	Для каждого СтрокаТемпТаблицы Из ТемпТаблицаРесурсовДляРаспределенияСРучнойПривязкой Цикл
		
		ОтборСтрок = Новый Структура("ИндексСтрокиРаспределениеПоРолям", 
			СтрокаТемпТаблицы.ИндексСтрокРаспределенияПоПериодам);
		ИскомыеСтроки = ТрудовыеРесурсыПоПериодам.НайтиСтроки(ОтборСтрок);
		ДанныеРаспределенияПоПериодамДляСтрокиТемпТаблицы = ТрудовыеРесурсыПоПериодам.Скопировать(ИскомыеСтроки);
		ДанныеРаспределенияПоПериодамДляСтрокиТемпТаблицы.Сортировать("Период Возр");
		
		СуммаКРаспределению = СтрокаТемпТаблицы.ОбщСтоимость;
		СуммаВнешняяКРаспределению = СтрокаТемпТаблицы.ОбщВнешняяСтоимость;
		КоличествоКРаспределению = СтрокаТемпТаблицы.Количество;
		
		Для каждого СтрокаДанныеРаспределения Из ДанныеРаспределенияПоПериодамДляСтрокиТемпТаблицы Цикл
			
			НС = ТаблицаРесурсовДляРаспределенияСРучнойПривязкой.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаТемпТаблицы, , "Количество, ОбщСтоимость, ОбщВнешняяСтоимость");
			
			ДоляТрудозатрат = СтрокаТемпТаблицы.ДоляТрудозатрат; 
			ДоляТрудозатрат = ?(ДоляТрудозатрат = Неопределено Или ДоляТрудозатрат = 0, 100, ДоляТрудозатрат);
			
			КоличествоРаспределенияЗаПериод = Окр(СтрокаДанныеРаспределения.Количество * (ДоляТрудозатрат / 100), 2);
			
			Если КоличествоКРаспределению > КоличествоРаспределенияЗаПериод Тогда
				НС.Количество = КоличествоРаспределенияЗаПериод;
			Иначе
				НС.Количество = КоличествоКРаспределению;
			КонецЕсли;
			
			Если НС.Количество >= КоличествоКРаспределению Тогда
				НС.ОбщСтоимость = СуммаКРаспределению;
				НС.ОбщВнешняяСтоимость = СуммаВнешняяКРаспределению;
			Иначе
				Если СтрокаТемпТаблицы.Количество <> 0 Тогда
					НС.ОбщСтоимость = Окр(СтрокаТемпТаблицы.ОбщСтоимость/СтрокаТемпТаблицы.Количество * НС.Количество, 2);
					НС.ОбщВнешняяСтоимость = Окр(СтрокаТемпТаблицы.ОбщВнешняяСтоимость/СтрокаТемпТаблицы.Количество * НС.Количество, 2);
				Иначе
					НС.ОбщСтоимость = 0;
					НС.ОбщВнешняяСтоимость = 0;
				КонецЕсли;
			КонецЕсли;
			
			СуммаКРаспределению = СуммаКРаспределению - НС.ОбщСтоимость;
			СуммаВнешняяКРаспределению = СуммаВнешняяКРаспределению - НС.ОбщВнешняяСтоимость;
			КоличествоКРаспределению = КоличествоКРаспределению - НС.Количество;
			
			ПериодМесяц = НачалоКонецМесяцаВнутриПериода(СтрокаДанныеРаспределения.Период, ДанныеПолногоПериода);
			
			ТемпТрудозатратыПоДням = РаспределитьТрудозатратыПоПрофилям(ТаблицаРесурсовДляРаспределенияСРучнойПривязкой,
				Календарь,
				ПериодМесяц.ДатаНачала,
				КонецДня(ПериодМесяц.ДатаОкончания));
			
			// Дополним дерево ТрудозатратыПоДням полученными данными.
			Для каждого СтрокаТрудозатратыПоДням Из ТемпТрудозатратыПоДням.Строки Цикл
				
				ПараметрыОтбора = Новый Структура("Ресурс, Подразделение, УровеньПланирования, ИсточникПлана", 
					СтрокаТрудозатратыПоДням.Ресурс, 
					СтрокаТрудозатратыПоДням.Подразделение, 
					СтрокаТрудозатратыПоДням.УровеньПланирования,
					СтрокаТрудозатратыПоДням.ИсточникПлана);
				ТемпИскомыеСтроки = ТрудозатратыПоДням.Строки.НайтиСтроки(ПараметрыОтбора);
				Если ТемпИскомыеСтроки.Количество() = 0 Тогда
					СтрокаТрудозатратыПоДнямТрудовойРесурс = ТрудозатратыПоДням.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТрудозатратыПоДнямТрудовойРесурс, СтрокаТрудозатратыПоДням);
					СтрокаТрудозатратыПоДнямТрудовойРесурс.Стоимость = СтрокаТемпТаблицы.ОбщСтоимость;
					СтрокаТрудозатратыПоДнямТрудовойРесурс.ВнешняяСтоимость = СтрокаТемпТаблицы.ОбщВнешняяСтоимость;
					РаспределеныВсеСуммыЦикла = Истина;
				Иначе
					СтрокаТрудозатратыПоДнямТрудовойРесурс = ТемпИскомыеСтроки[0];
					СтрокаТрудозатратыПоДнямТрудовойРесурс.Трудозатраты = СтрокаТрудозатратыПоДнямТрудовойРесурс.Трудозатраты 
						+ СтрокаТрудозатратыПоДням.Трудозатраты;
					Если Не РаспределеныВсеСуммыЦикла Тогда
						СтрокаТрудозатратыПоДнямТрудовойРесурс.Стоимость = СтрокаТрудозатратыПоДнямТрудовойРесурс.Стоимость
							+ СтрокаТрудозатратыПоДням.Стоимость;
						СтрокаТрудозатратыПоДнямТрудовойРесурс.ВнешняяСтоимость = СтрокаТрудозатратыПоДнямТрудовойРесурс.ВнешняяСтоимость 
							+ СтрокаТрудозатратыПоДням.ВнешняяСтоимость;
					КонецЕсли;
					// Смущает следующая строка.
					СтрокаТрудозатратыПоДнямТрудовойРесурс.День = 
						Макс(СтрокаТрудозатратыПоДнямТрудовойРесурс.День, СтрокаТрудозатратыПоДням.День);
				КонецЕсли;
				
				Для каждого СтрокаДень Из СтрокаТрудозатратыПоДням.Строки Цикл
					СтрокаТрудозатратыПоДнямДень = СтрокаТрудозатратыПоДнямТрудовойРесурс.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТрудозатратыПоДнямДень, СтрокаДень);
				КонецЦикла;
				
			КонецЦикла;
			
			ТаблицаРесурсовДляРаспределенияСРучнойПривязкой.Очистить();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяТаблицаРесурсовСРучнойПривязкой(ОбщаяТаблицаРесурсов)
	
	ТаблицаРесурсовДляРаспределенияСРучнойПривязкой = ОбщаяТаблицаРесурсов.СкопироватьКолонки();
	ТаблицаРесурсовДляРаспределенияСРучнойПривязкой.Колонки.Удалить("Количество");
	ТаблицаРесурсовДляРаспределенияСРучнойПривязкой.Колонки.Добавить("Количество", 
		Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 5)));
		
	Возврат ТаблицаРесурсовДляРаспределенияСРучнойПривязкой;
	
КонецФункции

Функция ДанныеПолногоПериода(НачДата, КонДата)
	
	Результат = Новый Структура;
	Результат.Вставить("НачДата", НачДата);
	Результат.Вставить("КонДата", КонДата);
	Результат.Вставить("НачалоМесяцаПериод", НачалоМесяца(НачДата));
	Результат.Вставить("КонецМесяцаПериод", КонецМесяца(КонДата));
	
	Возврат Результат;
	
КонецФункции

Функция НачалоКонецМесяцаВнутриПериода(МесяцРаспределения, ДанныеПолногоПериода)
	
	// см.ДанныеПолногоПериода()
	НачалоПолногоПериода = ДанныеПолногоПериода.НачДата;
	КонецПолногоПериода = ДанныеПолногоПериода.КонДата;
	НачалоМесяцаПериод = ДанныеПолногоПериода.НачалоМесяцаПериод;
	КонецМесяцаПериод = ДанныеПолногоПериода.КонецМесяцаПериод;
	
	НачалоМесяцаСтрокаРаспределения = НачалоМесяца(МесяцРаспределения);
	КонецМесяцаСтрокаРаспределения = КонецМесяца(МесяцРаспределения);
	
	Если НачалоМесяцаСтрокаРаспределения = НачалоМесяцаПериод Тогда
		НачДатаПериода = Макс(НачалоМесяцаСтрокаРаспределения, НачалоПолногоПериода);
	Иначе
		НачДатаПериода = НачалоМесяцаСтрокаРаспределения;
	КонецЕсли;
	
	Если КонецМесяцаСтрокаРаспределения = КонецМесяцаПериод Тогда 
		КонДатаПериода = Мин(КонецПолногоПериода, КонецМесяца(НачДатаПериода));
	Иначе
		КонДатаПериода = КонецМесяца(НачДатаПериода);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаНачала", НачДатаПериода);
	Результат.Вставить("ДатаОкончания", КонДатаПериода);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеРучногоРаспределенияТрудозатратТРПроектнойЗадачи(ПроектнаяЗадача, МассивРолей, МассивИсполнителей)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДнямСрезПоследних.Ресурс КАК Ресурс,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДнямСрезПоследних.Роль,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДнямСрезПоследних.Дата КАК День,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДнямСрезПоследних.Подразделение КАК Подразделение,
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДнямСрезПоследних.Трудозатраты
	               |ИЗ
	               |	РегистрСведений.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.СрезПоследних(
	               |			,
	               |			ПроектнаяЗадача = &ПроектнаяЗадача
	               |				И Роль В (&МассивРолей)
	               |				И Ресурс В (&МассивИсполнителей)) КАК упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДнямСрезПоследних
	               |ГДЕ
	               |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДнямСрезПоследних.Трудозатраты <> 0
	               |ИТОГИ
	               |	МАКСИМУМ(Роль),
	               |	МАКСИМУМ(Подразделение)
	               |ПО
	               |	Ресурс";
	 
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	Запрос.УстановитьПараметр("МассивИсполнителей", МассивИсполнителей);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьДанныеОперативнойЗагрузкиИсполнителейПроектнойЗадачи(ПроектнаяЗадача, Версия, МассивИсполнителей)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс КАК Ресурс,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение КАК Подразделение,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса КАК Роль
	               |ПОМЕСТИТЬ втВыделенныеРесурсы
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |			,
	               |			Версия = &ТекВерсия
	               |				И Ресурс В (&МассивИсполнителей)
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ресурс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ТрудовойРесурс КАК Ресурс,
	               |	НАЧАЛОПЕРИОДА(упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя, ДЕНЬ) КАК День,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя) КАК Трудозатраты,
	               |	втВыделенныеРесурсы.Подразделение КАК Подразделение,
	               |	втВыделенныеРесурсы.Роль КАК Роль
	               |ИЗ
	               |	РегистрСведений.упоОперативнаяЗагрузкаСпециалистов.СрезПоследних(, ТрудовойРесурс В (&МассивИсполнителей)) КАК упоОперативнаяЗагрузкаСпециалистовСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втВыделенныеРесурсы КАК втВыделенныеРесурсы
	               |		ПО упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ТрудовойРесурс = втВыделенныеРесурсы.Ресурс
	               |ГДЕ
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ПроектнаяЗадача = &ПроектнаяЗадача
	               |	И упоОперативнаяЗагрузкаСпециалистовСрезПоследних.Занят
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ТрудовойРесурс,
	               |	НАЧАЛОПЕРИОДА(упоОперативнаяЗагрузкаСпециалистовСрезПоследних.ДатаВремя, ДЕНЬ),
	               |	втВыделенныеРесурсы.Подразделение,
	               |	втВыделенныеРесурсы.Роль
	               |ИТОГИ ПО
	               |	Ресурс,
	               |	Роль,
	               |	Подразделение";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("ТекВерсия", Версия);
	Запрос.УстановитьПараметр("МассивИсполнителей", МассивИсполнителей);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Создает дерево данных расчета.
// 
// Возвращаемое значение:
//  ДеревоЗначений - дерево с данными.
//
Функция СоздатьДеревоДанныеРасчета()
	
	ДанныеРасчета = Новый ДеревоЗначений();
	
	ДанныеРасчета.Колонки.Добавить("Ресурс",
		Новый ОписаниеТипов("СправочникСсылка.упоТрудовыеРесурсы, СправочникСсылка.упоРоли"));
	ДанныеРасчета.Колонки.Добавить("Роль",
		Новый ОписаниеТипов("СправочникСсылка.упоРоли"));
	ДанныеРасчета.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	ДанныеРасчета.Колонки.Добавить("УровеньПланирования", Новый ОписаниеТипов("ПеречислениеСсылка.упоУровеньПланирования"));
	ДанныеРасчета.Колонки.Добавить("ИсточникПлана",
		Новый ОписаниеТипов("ПеречислениеСсылка.упоИсточникПланаТрудозатратРолей"));
	
	// На уровне ресурса - дата завершения работ в целом, на уровне дня - рабочий день.
	ДанныеРасчета.Колонки.Добавить("День", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата))); 
	   
	// На уровне ресурса - общая длительность работ по календарю проекта,
	// на уровне дня - трудозатраты на конкретный день.
	ДанныеРасчета.Колонки.Добавить("Трудозатраты", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный))); 
												   
	ДанныеРасчета.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
												
	ДанныеРасчета.Колонки.Добавить("ВнешняяСтоимость", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));												
	
	Возврат ДанныеРасчета;
	
КонецФункции

Функция ШаблонТаблицыТрудозатратПоДнямДляЗаполненияПланаРасходов()
	
	ТаблицаТрудозатратПоДням = Новый ТаблицаЗначений;
	ТаблицаТрудозатратПоДням.Колонки.Добавить("Роль", Новый ОписаниеТипов("СправочникСсылка.упоРоли"));
	ТаблицаТрудозатратПоДням.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
	ТаблицаТрудозатратПоДням.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаТрудозатратПоДням.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаТрудозатратПоДням;
	
КонецФункции

#КонецОбласти

#Область ОчередьОтраженияПлановыхТрудозатрат

Процедура ОбработатьПорциюОтраженияПлановыхТрудозатратЗадач(ПроектныеЗадачи = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВсеЗадачи = ПроектныеЗадачи = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВсеЗадачи", ВсеЗадачи);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 2000
	               |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоОчередьОтраженияПлановыхТрудозатратЗадач.НомерПопытки КАК НомерПопытки,
	               |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ДатаВМиллиСекундах КАК ДатаВМиллиСекундах
	               |ИЗ
	               |	РегистрСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач КАК упоОчередьОтраженияПлановыхТрудозатратЗадач
	               |ГДЕ
	               |	НЕ упоОчередьОтраженияПлановыхТрудозатратЗадач.Ошибка
	               |	И (&ВсеЗадачи
	               |			ИЛИ упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача В (&ПроектныеЗадачи))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерПопытки,
	               |	упоОчередьОтраженияПлановыхТрудозатратЗадач.ДатаВМиллиСекундах";
	
	Если Не ВсеЗадачи Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 2000", "");	
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
				   	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка 
			лОтразитьПлановыеТрудозатратыЗадачи(Выборка.ПроектнаяЗадача);
			УдалитьИзОчередиОтраженияПлановыхТрудозатратЗадач(Выборка.ПроектнаяЗадача, Выборка.ДатаВМиллиСекундах);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписатьОшибкуВОчередьОтраженияПлановыхТрудозатратЗадач(Выборка.ПроектнаяЗадача, 
																	ОписаниеОшибки, Выборка.НомерПопытки + 1);
			ВызватьИсключение ОписаниеОшибки;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВОчередьОтраженияПлановыхТрудозатратЗадач(Предмет, Источник = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Дата = ТекущаяДата();
	ДатаВМиллиСекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() + (ТекущаяДата() - ТекущаяУниверсальнаяДата());
		
	Если ТипЗнч(Предмет) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		
		МассивЗадач = Новый Массив;
		МассивЗадач.Добавить(Предмет);
				
	ИначеЕсли ТипЗнч(Предмет) = Тип("Массив") Тогда
		
		МассивЗадач = Предмет;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Неправильный параметр'");
		
	КонецЕсли;	
	
	Для Каждого ПроектнаяЗадача Из МассивЗадач Цикл
		
		НаборЗаписей = РегистрыСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПроектнаяЗадача.Установить(ПроектнаяЗадача);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() <> 0 Тогда
			ЗаписиТолькоСОшибками = Истина;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Не Запись.Ошибка Тогда
					ЗаписиТолькоСОшибками = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ЗаписиТолькоСОшибками Тогда
				Продолжить;
			Иначе
				НаборЗаписей.Очистить();
			КонецЕсли;		
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();	
		ЗаполнитьНовуюЗаписьВОчереди(Запись, Источник, ПроектнаяЗадача, Дата, ДатаВМиллиСекундах);
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьНовуюЗаписьВОчереди(Запись, Источник, ПроектнаяЗадача,  
														Дата, ДатаВМиллиСекундах)
										
	Запись.ПроектнаяЗадача = ПроектнаяЗадача;										
	Запись.Источник = Источник;	
	Запись.Дата = Дата;
	Запись.ДатаВМиллиСекундах = ДатаВМиллиСекундах;
	Запись.Ошибка = Ложь;
	Запись.ОписаниеОшибки = "";
	
КонецПроцедуры

Функция ЗаписатьОшибкуВОчередьОтраженияПлановыхТрудозатратЗадач(ПроектнаяЗадача, ОписаниеОшибки, НомерПопытки) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроектнаяЗадача.Установить(ПроектнаяЗадача);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей[0];
	
	Запись.Ошибка = НомерПопытки > 4;
	Запись.ОписаниеОшибки = "" + ТекущаяДата() + ": " + ОписаниеОшибки;
	Запись.НомерПопытки = НомерПопытки;
	
	НаборЗаписей.Записать();
	
КонецФункции 

Функция УдалитьИзОчередиОтраженияПлановыхТрудозатратЗадач(ПроектнаяЗадача, ПредыдущаяДатаВМиллиСекундах = Неопределено) 
	
	УстановитьПривилегированныйРежим(Истина);
    
    Если НЕ ПредыдущаяДатаВМиллиСекундах = Неопределено 
        И ОчередьОбновилась(ПроектнаяЗадача, ПредыдущаяДатаВМиллиСекундах) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
	НаборЗаписей =  РегистрыСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПроектнаяЗадача.Установить(ПроектнаяЗадача);
	НаборЗаписей.Записать();
	
КонецФункции 

Функция ОчередьОбновилась(ПроектнаяЗадача, ПредыдущаяДатаВМиллиСекундах)

    Результат = Ложь; 
        
    Запрос = Новый Запрос("ВЫБРАТЬ
    |   упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
    |   упоОчередьОтраженияПлановыхТрудозатратЗадач.ДатаВМиллиСекундах КАК ДатаВМиллиСекундах
    |ИЗ
    |   РегистрСведений.упоОчередьОтраженияПлановыхТрудозатратЗадач КАК упоОчередьОтраженияПлановыхТрудозатратЗадач
    |ГДЕ
    |   упоОчередьОтраженияПлановыхТрудозатратЗадач.ПроектнаяЗадача = &ПроектнаяЗадача
    |   И НЕ упоОчередьОтраженияПлановыхТрудозатратЗадач.Ошибка
    |   И упоОчередьОтраженияПлановыхТрудозатратЗадач.ДатаВМиллиСекундах > &ПредыдущаяДатаВМиллиСекундах");
    
    Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);    
    Запрос.УстановитьПараметр("ПредыдущаяДатаВМиллиСекундах", ПредыдущаяДатаВМиллиСекундах);    
    
    РезультатЗапроса = Запрос.Выполнить();
        
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции // ОчередьОбновилась()

#КонецОбласти

#Область РаспределениеТрудозатратПоПрофилям

Функция ПодготовитьТаблицуДанныеТрудозатрат(ТрудовыеРесурсы)
	
	Если ТипЗнч(ТрудовыеРесурсы) = Тип("ТаблицаЗначений") Тогда
		ДанныеТрудозатрат = ТрудовыеРесурсы.Скопировать();
	Иначе
		ДанныеТрудозатрат = ТрудовыеРесурсы.Выгрузить();
	КонецЕсли; 
	
	// Дополним таблицу служебными колонками, они будут нужны для обратного расчета.
	
	ДанныеТрудозатрат.Колонки.Добавить("ПерегрузкаРесурса", Новый ОписаниеТипов("Булево"));
	ДанныеТрудозатрат.Колонки.Добавить("Трудозатраты");
	ДанныеТрудозатрат.Колонки.Добавить("КоличествоЧасовПериода");
	ДанныеТрудозатрат.Колонки.Добавить("СтоимостьЧаса");
	ДанныеТрудозатрат.Колонки.Добавить("ВнешняяСтоимостьЧаса");
	
	Возврат ДанныеТрудозатрат;
	
КонецФункции

Процедура ДополнитьТаблицуДанныеТрудозатрат(ДанныеТрудозатрат, ДанныеПериода, ДанныеПрофилей, ОбратныйРасчет)
	
	Для каждого СтрокаДанных Из ДанныеТрудозатрат Цикл
		
		// Теперь для каждого из трудовых ресурсов нужно пересчитать трудозатраты
		// в часы, а также сверить плановые трудозатраты
		// с максимальным количеством рабочих часов за период и оценить
		// вероятность "плановой перегрузки".
		
		СтрокаДанных.Трудозатраты = Окр(СтрокаДанных.Количество * СтрокаДанных.ЕдиницаНормирования.Коэффициент, 2);
		
		// Поскольку нужно будет считать распределение не 
		// только трудозатрат, но и стоимости, вычислим для
		// каждого трудового ресурса стоимость часа.
		
		СтрокаДанных.СтоимостьЧаса = 
			?(НЕ СтрокаДанных.Трудозатраты = 0, Окр(СтрокаДанных.ОбщСтоимость / СтрокаДанных.Трудозатраты, 2), 0);
			
		// TODO в некоторые моменты ОбщВнешняяСтоимость прилетает как Неопределено, вызывая ошибку
		// Истоки ошибки найти пока не удалось, поэтому пока принудительная инициализация.
		Если СтрокаДанных.ОбщВнешняяСтоимость = Неопределено Тогда
			СтрокаДанных.ОбщВнешняяСтоимость = 0;
		КонецЕсли;
		
		СтрокаДанных.ВнешняяСтоимостьЧаса = ?(НЕ СтрокаДанных.Трудозатраты = 0,
			Окр(СтрокаДанных.ОбщВнешняяСтоимость / СтрокаДанных.Трудозатраты, 2), 0);
		
		Если СтрокаДанных.ПрофильРаспределения.СпособРаспределения = 
			Перечисления.упоСпособРаспределенияТрудозатрат.ПоТаблицеРаспределенияСПериодами 
			И ОбратныйРасчет Тогда
			
			СтрокаДанных.КоличествоЧасовПериода = ДанныеПериода.КоличествоЧасов;
			
		Иначе
				
			Если НЕ ОбратныйРасчет Тогда
				
				СтрокаДанных.ПерегрузкаРесурса = Ложь;
				СтрокаДанных.КоличествоЧасовПериода = 0;
				
			Иначе			
				
				// Необходимо определить максимальное количество рабочих
				// часов, которое можно распределить по периоду с
				// учетом заданного профиля распределения.
				
				// Вначале простая проверка на общее количество часов.
				
				СтрокаПрофиль = ДанныеПрофилей.Строки.Найти(СтрокаДанных.ПрофильРаспределения, "Профиль");
				Если НЕ СтрокаПрофиль = Неопределено Тогда
					
					МаксимальноеКоличествоЧасов = ДанныеПериода.КоличествоЧасов;
					ВозможноеКоличествоЧасов = 0;
					
					Для каждого СтрокаТаблицыПрофиля Из СтрокаПрофиль.Строки Цикл
				    	ДоляТрудозатрат = (МаксимальноеКоличествоЧасов * СтрокаТаблицыПрофиля.Трудозатраты) / 100;
						КоличествоЧасовПериода = (ДоляТрудозатрат * СтрокаТаблицыПрофиля.Загрузка) / 100;
						ВозможноеКоличествоЧасов = ВозможноеКоличествоЧасов + КоличествоЧасовПериода;
					КонецЦикла;
					
				Иначе
					
					ВозможноеКоличествоЧасов = ДанныеПериода.КоличествоЧасов;
					
				КонецЕсли; 
				
				// Простая проверка показывает, что по заданному профилю
				// невозможно распределить заданное количество часов.
				
				Если ВозможноеКоличествоЧасов < СтрокаДанных.Трудозатраты 
					ИЛИ ВозможноеКоличествоЧасов = 0 ИЛИ ДанныеПериода.КоличествоДней = 0 Тогда
					
					СтрокаДанных.ПерегрузкаРесурса = Истина;
					СтрокаДанных.КоличествоЧасовПериода = ДанныеПериода.КоличествоЧасов;	
					
				Иначе
				
					// Но такая проверка еще не дает гарантии правильного распределения
					// при обратном расчете - проблема в том, что каждая строка профиля
					// распределения "занимает" минимум один день. И после обсчета
					// каждой из строк количество оставшихся дней (и, как следствие, количество
					// оставшихся рабочих часов) уменьшается, причем не пропорционально, а в
					// соответствие с полем "Загрузка" профиля распределения.
					
					// Поэтому запускаем более сложную проверку, которая попробует
					// определить вероятность "плановой перегрузки" с учетом вышеизложенного.
					
					// В качестве граничного условия принимаем, что количество рабочих часов
					// в рабочем дне в рамках одного рабочего календаря будет, как правило,
					// одинаковым, поэтому не тратим время и ресурсы на перебор календаря,
					// а работаем с "виртуальным" календарем.
					
					КоличествоЧасовЗаДень = ДанныеПериода.КоличествоЧасов / ДанныеПериода.КоличествоДней;			
					ОсталосьДнейПериода = ДанныеПериода.КоличествоДней;
					
					Для каждого СтрокаТаблицыПрофиля Из СтрокаПрофиль.Строки Цикл
						
						ДоляТрудозатрат = (СтрокаДанных.Трудозатраты * СтрокаТаблицыПрофиля.Трудозатраты) / 100;
						КоличествоЧасов = (КоличествоЧасовЗаДень * СтрокаТаблицыПрофиля.Загрузка) / 100;
						
						Если КоличествоЧасов = 0 Тогда
							Продолжить; // На всякий случай.
						КонецЕсли; 
						
						НужноСписатьДней = Окр(ДоляТрудозатрат / КоличествоЧасов, 0);
						НужноСписатьДней = ?(НужноСписатьДней < 1, 1, НужноСписатьДней);
						
						ОсталосьДнейПериода = ОсталосьДнейПериода - НужноСписатьДней;
						
						Если ОсталосьДнейПериода < 0 Тогда
							СтрокаДанных.ПерегрузкаРесурса = Истина;
							СтрокаДанных.КоличествоЧасовПериода = ДанныеПериода.КоличествоЧасов;
						КонецЕсли; 		
						
					КонецЦикла;
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; // Для каждого СтрокаДанных Из ДанныеТрудозатрат Цикл.
	
КонецПроцедуры

Функция ЗаполнитьКэшПериода(ДатаНачала, ДатаОкончания, ДанныеТрудозатрат)
	
	КэшПериода = Новый ТаблицаЗначений();
	КэшПериода.Колонки.Добавить("Ресурс");
	КэшПериода.Колонки.Добавить("Роль", Новый ОписаниеТипов("СправочникСсылка.упоРоли"));
	КэшПериода.Колонки.Добавить("УровеньПланирования");
	КэшПериода.Колонки.Добавить("Подразделение");
	КэшПериода.Колонки.Добавить("КонецПериода");
	КэшПериода.Колонки.Добавить("ИсточникПлана");

	Для каждого СтрокаДанных Из ДанныеТрудозатрат Цикл
		НоваяСтрока = КэшПериода.Добавить();
		НоваяСтрока.КонецПериода = НачалоДня(ДатаНачала) - 86400;
	КонецЦикла; 
	КэшПериода.ЗагрузитьКолонку(ДанныеТрудозатрат.ВыгрузитьКолонку("Ресурс"), "Ресурс");
	КэшПериода.ЗагрузитьКолонку(ДанныеТрудозатрат.ВыгрузитьКолонку("Роль"), "Роль");
	КэшПериода.ЗагрузитьКолонку(ДанныеТрудозатрат.ВыгрузитьКолонку("Подразделение"), "Подразделение");
	КэшПериода.ЗагрузитьКолонку(ДанныеТрудозатрат.ВыгрузитьКолонку("УровеньПланирования"), "УровеньПланирования");
    КэшПериода.ЗагрузитьКолонку(ДанныеТрудозатрат.ВыгрузитьКолонку("ИсточникПлана"), "ИсточникПлана");

	Возврат КэшПериода;
	
КонецФункции

Функция ЗаполнитьДанныеКалендаря(ДанныеКалендаря, РабочийКалендарь, ДатаНачала, ДатаЗавершения,
	ВывестиСообщение, ОбратныйРасчет)
	
	Отказ = Ложь;
	
	Если НЕ ДобавитьКалендарьНаГод(РабочийКалендарь, ДатаНачала, ДанныеКалендаря, ВывестиСообщение) Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если (НЕ Отказ) И (ОбратныйРасчет И НЕ Год(ДатаНачала) >= Год(ДатаЗавершения)) Тогда
		
		Для Счетчик = 1 По Год(ДатаЗавершения) - Год(ДатаНачала) Цикл
			
			Если НЕ ДобавитьКалендарьНаГод(РабочийКалендарь, ДобавитьМесяц(ДатаНачала, 12 * Счетчик),
				ДанныеКалендаря, ВывестиСообщение) Тогда
				
				Отказ = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат (Отказ = Ложь);
	
КонецФункции

Функция ПолучитьДанныеРаспределения(ДанныеПрофилей, ДанныеТрудозатрат, ОбратныйРасчет)
	
	// Строим общую таблицу исходных данных с учетом настроек профилей распределения.
	
	ДанныеРаспределения = Новый ТаблицаЗначений();
	ДанныеРаспределения.Колонки.Добавить("Ресурс");
	ДанныеРаспределения.Колонки.Добавить("Роль", Новый ОписаниеТипов("СправочникСсылка.упоРоли"));
	ДанныеРаспределения.Колонки.Добавить("Подразделение");
	ДанныеРаспределения.Колонки.Добавить("УровеньПланирования");
	ДанныеРаспределения.Колонки.Добавить("Трудозатраты");
	ДанныеРаспределения.Колонки.Добавить("ПерегрузкаРесурса", Новый ОписаниеТипов("Булево"));
	ДанныеРаспределения.Колонки.Добавить("Загрузка");
	ДанныеРаспределения.Колонки.Добавить("ПоДругомуМетоду", Новый ОписаниеТипов("Булево"));
	ДанныеРаспределения.Колонки.Добавить("ТрудозатратыВЧас");
	ДанныеРаспределения.Колонки.Добавить("ИсточникПлана");
	
	Для каждого СтрокаДанных Из ДанныеТрудозатрат Цикл
		
		СтрокаПрофиль = ДанныеПрофилей.Строки.Найти(СтрокаДанных.ПрофильРаспределения, "Профиль");
		Если СтрокаПрофиль = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрокаДанных.ПрофильРаспределения.СпособРаспределения =
			Перечисления.упоСпособРаспределенияТрудозатрат.ПоТаблицеРаспределенияСПериодами 
			И ОбратныйРасчет Тогда
			
			НачисленоТрудозатрат = 0;
			НачисленоЧасов = 0;
			Счетчик = 0;
			
			Для каждого СтрокаТаблицыПрофиля Из СтрокаПрофиль.Строки Цикл
				
				НоваяСтрока = ДанныеРаспределения.Добавить();
				НоваяСтрока.Ресурс = СтрокаДанных.Ресурс;
				НоваяСтрока.Роль = СтрокаДанных.Роль;
				НоваяСтрока.УровеньПланирования = СтрокаДанных.УровеньПланирования;
				НоваяСтрока.Подразделение = СтрокаДанных.Подразделение;
				НоваяСтрока.ИсточникПлана = СтрокаДанных.ИсточникПлана;

				// При расчете долей необходимо сразу учитывать погрешности округления.
				
				Счетчик = Счетчик + 1;
				
				Если НЕ Счетчик = СтрокаПрофиль.Строки.Количество() Тогда				
					КоличествоЧасовПериода = СтрокаДанных.КоличествоЧасовПериода * СтрокаТаблицыПрофиля.Загрузка / 100;
					НачисленоЧасов = НачисленоЧасов + КоличествоЧасовПериода;
					
					ДоляТрудозатрат = Окр((СтрокаДанных.Трудозатраты * СтрокаТаблицыПрофиля.Трудозатраты) / 100, 2);
					НачисленоТрудозатрат = НачисленоТрудозатрат + ДоляТрудозатрат;
				Иначе
					ДоляТрудозатрат = СтрокаДанных.Трудозатраты - НачисленоТрудозатрат;
					КоличествоЧасовПериода = СтрокаДанных.КоличествоЧасовПериода - НачисленоЧасов;
				КонецЕсли;
				
				НоваяСтрока.Трудозатраты = ДоляТрудозатрат;
				НоваяСтрока.ТрудозатратыВЧас = ?(ЗначениеЗаполнено(КоличествоЧасовПериода),
					ДоляТрудозатрат / КоличествоЧасовПериода, 0); // Показатель трудозатраты в час.
				НоваяСтрока.Загрузка = КоличествоЧасовПериода;
				
				НоваяСтрока.ПоДругомуМетоду = Истина;
				
			КонецЦикла;
			
		Иначе
		
			// В случае обратного расчета и "плановой перегрузки" ресурса
			// использовать профиль уже не имеет особого смысла, поэтому
			// перестраиваем его под равномерную загрузку.
			
			Если ОбратныйРасчет И СтрокаДанных.ПерегрузкаРесурса Тогда
				
				// В случае, когда количество периодов в профиле
				// превышает количество рабочих дней в периоде.
					
				НоваяСтрока = ДанныеРаспределения.Добавить();
				НоваяСтрока.Ресурс = СтрокаДанных.Ресурс;
				НоваяСтрока.Роль = СтрокаДанных.Роль;
				НоваяСтрока.Подразделение = СтрокаДанных.Подразделение;
				НоваяСтрока.УровеньПланирования = СтрокаДанных.УровеньПланирования;
				НоваяСтрока.ПерегрузкаРесурса = СтрокаДанных.ПерегрузкаРесурса;
				НоваяСтрока.Трудозатраты = СтрокаДанных.Трудозатраты;
				НоваяСтрока.ИсточникПлана = СтрокаДанных.ИсточникПлана;

				Если СтрокаДанных.КоличествоЧасовПериода = 0 Тогда
					НоваяСтрока.Загрузка = 100;
				Иначе
					НоваяСтрока.Загрузка = (СтрокаДанных.Трудозатраты / СтрокаДанных.КоличествоЧасовПериода) * 100;
				КонецЕсли; 
							
			Иначе
				
				// Во всех остальных случаях производится распределение
				// в соответствии с данными профиля.
				
				НачисленоТрудозатрат = 0;
				Счетчик = 0;
				
				Для каждого СтрокаТаблицыПрофиля Из СтрокаПрофиль.Строки Цикл
					
					НоваяСтрока = ДанныеРаспределения.Добавить();
					НоваяСтрока.Ресурс = СтрокаДанных.Ресурс;
					НоваяСтрока.Роль = СтрокаДанных.Роль;
					НоваяСтрока.УровеньПланирования = СтрокаДанных.УровеньПланирования;
					НоваяСтрока.Подразделение = СтрокаДанных.Подразделение;
					НоваяСтрока.ПерегрузкаРесурса = СтрокаДанных.ПерегрузкаРесурса;
					НоваяСтрока.Загрузка = СтрокаТаблицыПрофиля.Загрузка;
					НоваяСтрока.ИсточникПлана = СтрокаДанных.ИсточникПлана;
					
					// При расчете долей необходимо сразу учитывать погрешности округления.
					
					Счетчик = Счетчик + 1;
					
					Если НЕ Счетчик = СтрокаПрофиль.Строки.Количество() Тогда				
						ДоляТрудозатрат = Окр((СтрокаДанных.Трудозатраты * СтрокаТаблицыПрофиля.Трудозатраты) / 100, 2);
						НоваяСтрока.Трудозатраты = ДоляТрудозатрат;
						НачисленоТрудозатрат = НачисленоТрудозатрат + ДоляТрудозатрат;
					Иначе
						НоваяСтрока.Трудозатраты = СтрокаДанных.Трудозатраты - НачисленоТрудозатрат;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		
		 КонецЕсли;
		
	 КонецЦикла;
	 
	 Возврат ДанныеРаспределения;
	
КонецФункции

Функция ПолучитьДанныеРасчетаТрудозатратПоПрофилям(ДатаНачала, ДатаЗавершения, РабочийКалендарь,
	ДанныеКалендаря, ДанныеТрудозатрат, ДанныеРаспределения, ОбратныйРасчет, ВывестиСообщение)
	
	// Приступаем непосредственно к распределению трудозатрат.
	
	// Готовим структуру выходных данных.
	ДанныеРасчета = СоздатьДеревоДанныеРасчета();
	
	// Порядок строк исходной таблицы получился следующим:
	// ресурс_1 - период_1
	// ресурс_1 - период_2 
	// ресурс_1 - ...
	// ресурс_1 - период_М
	// ресурс_2 - период_1
	// ...
	// Это значит, что нет необходимости как-то выстраивать строки,
	// а достаточно просто идти по таблице прямым перебором.
	
	// "Даты перехода" между периодами для каждого трудового ресурса
	// будем кэшировать в отдельной таблице.
	КэшПериода = ЗаполнитьКэшПериода(ДатаНачала, ДатаЗавершения, ДанныеТрудозатрат);
	
	// Проходим по таблице исходных данных прямым перебором и рассчитываем трудозатраты.
	// Поправок на обратный расчет не делаем - эти поправки были внесены выше, при
	// расчете коэффициентов "плановой перегрузки".
	СтрокаПредыдущегоРасчета = Неопределено;
	
	РабочихЧасовВсего = 0;	
	
	Для каждого СтрокаДанныхРаспределения Из ДанныеРаспределения Цикл
		
		СтруктураОтбора = Новый Структура("Ресурс, Подразделение, УровеньПланирования, Роль, ИсточникПлана",
												СтрокаДанныхРаспределения.Ресурс, 
												СтрокаДанныхРаспределения.Подразделение, 
												СтрокаДанныхРаспределения.УровеньПланирования, 
												СтрокаДанныхРаспределения.Роль,
												СтрокаДанныхРаспределения.ИсточникПлана);
			
		масСтрокаДереваРесурс = ДанныеРасчета.Строки.НайтиСтроки(СтруктураОтбора);
		Если масСтрокаДереваРесурс.Количество() = 0 Тогда
			СтрокаДереваРесурс = ДанныеРасчета.Строки.Добавить();
			СтрокаДереваРесурс.Ресурс = СтрокаДанныхРаспределения.Ресурс;
			СтрокаДереваРесурс.УровеньПланирования = СтрокаДанныхРаспределения.УровеньПланирования;
			СтрокаДереваРесурс.Подразделение = СтрокаДанныхРаспределения.Подразделение;
			СтрокаДереваРесурс.Роль = СтрокаДанныхРаспределения.Роль;
			СтрокаДереваРесурс.ИсточникПлана = СтрокаДанныхРаспределения.ИсточникПлана;
		Иначе
			СтрокаДереваРесурс = масСтрокаДереваРесурс[0];
		КонецЕсли; 
		
		СтрокиДанныхТрудозатрат = ДанныеТрудозатрат.НайтиСтроки(СтруктураОтбора);
		Если СтрокиДанныхТрудозатрат.Количество() = 0 Тогда
			Продолжить; // Проверка на всякий случай, такого не должно быть в принципе.
		Иначе
			СтрокаДанныхТрудозатрат = СтрокиДанныхТрудозатрат[0];
		КонецЕсли;
		
		СтрокаДереваРесурс.Стоимость = СтрокаДереваРесурс.Стоимость + СтрокаДанныхТрудозатрат.ОбщСтоимость;
		СтрокаДереваРесурс.ВнешняяСтоимость = СтрокаДереваРесурс.ВнешняяСтоимость 
			+ СтрокаДанныхТрудозатрат.ОбщВнешняяСтоимость;
				
		СтрокиКэшПериода = КэшПериода.НайтиСтроки(СтруктураОтбора);
		Если СтрокиКэшПериода.Количество() = 0 Тогда
			Продолжить; // Проверка на всякий случай, такого не должно быть в принципе.
		Иначе
			СтрокаКэшПериода = СтрокиКэшПериода[0];
		КонецЕсли;			
		
		ТекДата = СтрокаКэшПериода.КонецПериода;
			
		Если Не СтрокаДанныхРаспределения.ПоДругомуМетоду = Неопределено И СтрокаДанныхРаспределения.ПоДругомуМетоду Тогда
			
			ОсталосьРаспределить = СтрокаДанныхРаспределения.Загрузка;
			
			НачисленоСтоимости = 0;
			НачисленоВнешнейСтоимости = 0;
			РаспределеноТрудозатрат = 0;
			СтоимостьПериода = СтрокаДанныхТрудозатрат.ОбщСтоимость;
			ВнешняяСтоимостьПериода = СтрокаДанныхТрудозатрат.ОбщВнешняяСтоимость;
			
			СтрокаРасчета = Неопределено;		
			Пока ОсталосьРаспределить > 0 Цикл

				ТекДата = ТекДата + 86400;	
							
				СтрокаДень = НайтиДеньКалендаря(РабочийКалендарь, ТекДата, ДанныеКалендаря, ВывестиСообщение);
				
				Если СтрокаДень = Неопределено Тогда
					Возврат Неопределено;
				КонецЕсли; 
				
				ДобавитьТрудозатраты = Ложь;
				ДлительностьПоКалендарю = 0;
				
				Если ОбратныйРасчет И НачалоДня(СтрокаДень.День) = НачалоДня(ДатаЗавершения) Тогда			
				
					Если Не СтрокаДень.КоличествоЧасов = 0 ИЛИ СтрокаРасчета = Неопределено Тогда
						
						Если Не СтрокаПредыдущегоРасчета = Неопределено 
							И (СтрокаПредыдущегоРасчета.Ресурс = СтрокаДереваРесурс.Ресурс
							И СтрокаПредыдущегоРасчета.Подразделение = СтрокаДереваРесурс.Подразделение
							И СтрокаПредыдущегоРасчета.УровеньПланирования = СтрокаДереваРесурс.УровеньПланирования)Тогда
							
							СтрокаРасчета = СтрокаПредыдущегоРасчета.СтрокаРасчета;
							ДлительностьПоКалендарю = СтрокаПредыдущегоРасчета.КоличествоЧасов;
							СтрокаПредыдущегоРасчета = Неопределено;
							ДобавитьТрудозатраты = Истина;
							
						Иначе
							
							СтрокаРасчета = СтрокаДереваРесурс.Строки.Добавить();
							СтрокаРасчета.День = СтрокаДень.День;
							ДлительностьПоКалендарю = СтрокаДень.КоличествоЧасов;
							
						КонецЕсли;
						
					КонецЕсли; 
									
					РабочихЧасовНужно = ОсталосьРаспределить * СтрокаДанныхРаспределения.ТрудозатратыВЧас;
					ОсталосьРаспределить = 0;
					
				ИначеЕсли Не СтрокаДень.КоличествоЧасов = 0 Тогда
					
					// В остальных случаях (нормальный расчет)
					// пропускаем дни с нулевым количеством рабочих часов.
					
					Если Не СтрокаПредыдущегоРасчета = Неопределено 
						И (СтрокаПредыдущегоРасчета.Ресурс = СтрокаДереваРесурс.Ресурс
						И СтрокаПредыдущегоРасчета.Подразделение = СтрокаДереваРесурс.Подразделение 
						И СтрокаПредыдущегоРасчета.УровеньПланирования = СтрокаДереваРесурс.УровеньПланирования)Тогда
						
						СтрокаРасчета = СтрокаПредыдущегоРасчета.СтрокаРасчета;
						ДлительностьПоКалендарю = СтрокаПредыдущегоРасчета.КоличествоЧасов;
						РабочихЧасовВсего = СтрокаПредыдущегоРасчета.КоличествоЧасов;
						
						СтрокаПредыдущегоРасчета = Неопределено;
						ДобавитьТрудозатраты = Истина;
						
					Иначе
						
						СтрокаРасчета = СтрокаДереваРесурс.Строки.Добавить();
						СтрокаРасчета.День = СтрокаДень.День;
						ДлительностьПоКалендарю = СтрокаДень.КоличествоЧасов;
						РабочихЧасовВсего = СтрокаДень.КоличествоЧасов;
						
					КонецЕсли;
					
					Если РабочихЧасовВсего > ОсталосьРаспределить Тогда
						РабочихЧасовВсего = ОсталосьРаспределить;
					КонецЕсли; 
					
					РабочихЧасовНужно = РабочихЧасовВсего * СтрокаДанныхРаспределения.ТрудозатратыВЧас;
					ОсталосьРаспределить = ОсталосьРаспределить - РабочихЧасовВсего;
					
				Иначе
					
					Продолжить;
					
				КонецЕсли; 
				
				СтоимостьНачислить = Окр(РабочихЧасовНужно * СтрокаДанныхТрудозатрат.СтоимостьЧаса, 2);
				НачисленоСтоимости = НачисленоСтоимости + СтоимостьНачислить;
				ВнешняяСтоимостьНачислить = Окр(РабочихЧасовНужно * СтрокаДанныхТрудозатрат.ВнешняяСтоимостьЧаса, 2);
				НачисленоВнешнейСтоимости = НачисленоВнешнейСтоимости + ВнешняяСтоимостьНачислить;
				
				Если РаспределеноТрудозатрат + Окр(РабочихЧасовНужно, 2) > СтрокаДанныхРаспределения.Трудозатраты Тогда
					РабочихЧасовНужно = СтрокаДанныхРаспределения.Трудозатраты - РаспределеноТрудозатрат;
				КонецЕсли;
				
				Если ДобавитьТрудозатраты Тогда
					СтрокаРасчета.Трудозатраты = СтрокаРасчета.Трудозатраты + РабочихЧасовНужно;
					СтрокаРасчета.Стоимость = СтрокаРасчета.Стоимость + СтоимостьНачислить;
					СтрокаРасчета.ВнешняяСтоимость = СтрокаРасчета.ВнешняяСтоимость + ВнешняяСтоимостьНачислить;
				Иначе
					СтрокаРасчета.Трудозатраты = РабочихЧасовНужно;
					СтрокаРасчета.Стоимость = СтоимостьНачислить;
					СтрокаРасчета.ВнешняяСтоимость = ВнешняяСтоимостьНачислить;
				КонецЕсли;
				
				РаспределеноТрудозатрат = РаспределеноТрудозатрат + Окр(РабочихЧасовНужно, 2);
				
				// На верхнем уровне дерева собираем данные по трудовому ресурсу в целом,
				// но при этом там нас интересуют общая длительность (только по рабочему 
				// календарю, без учета процентов загрузки и коэффициентов перегрузки)
				// и дата завершения работ трудовым ресурсом в целом по задаче.
				
				Если Не ЗначениеЗаполнено(СтрокаДереваРесурс.День) Тогда
					СтрокаДереваРесурс.День = СтрокаРасчета.День;
				Иначе
					СтрокаДереваРесурс.День = упоСервисныеФункцииВызовСервера.обМакс(СтрокаРасчета.День, СтрокаДереваРесурс.День);	
				КонецЕсли; 
				
				ТрудозатратыРесурса = СтрокаРасчета.Трудозатраты;
				
				Если Не ЗначениеЗаполнено(СтрокаДереваРесурс.Трудозатраты) Тогда
					СтрокаДереваРесурс.Трудозатраты = ТрудозатратыРесурса;
				Иначе
					СтрокаДереваРесурс.Трудозатраты = СтрокаДереваРесурс.Трудозатраты + ТрудозатратыРесурса;
				КонецЕсли; 
				
			КонецЦикла;
			
			Если НЕ СтрокаРасчета = Неопределено Тогда
			
				Если НЕ (РабочихЧасовВсего = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ДлительностьПоКалендарю)) 
					И ДлительностьПоКалендарю > РабочихЧасовВсего Тогда
					
					СтрокаКэшПериода.КонецПериода = НачалоДня(СтрокаРасчета.День) - 86400;
					
					СтрокаПредыдущегоРасчета = Новый Структура("СтрокаРасчета, КоличествоЧасов, Ресурс, Подразделение, УровеньПланирования",
						СтрокаРасчета,
						ДлительностьПоКалендарю - РабочихЧасовВсего,
						СтрокаДереваРесурс.Ресурс,
						СтрокаДереваРесурс.Подразделение,
						СтрокаДереваРесурс.УровеньПланирования);
					
				Иначе
					
					СтрокаКэшПериода.КонецПериода = НачалоДня(СтрокаРасчета.День);
					
					СтрокаПредыдущегоРасчета = Неопределено;
					
				КонецЕсли;
				
				Если НЕ СтоимостьПериода = НачисленоСтоимости Тогда
					СтрокаРасчета.Стоимость = СтрокаРасчета.Стоимость + (СтоимостьПериода - НачисленоСтоимости);
				КонецЕсли;
				
				Если НЕ ВнешняяСтоимостьПериода = НачисленоВнешнейСтоимости Тогда
					СтрокаРасчета.ВнешняяСтоимость = СтрокаРасчета.ВнешняяСтоимость 
						+ (ВнешняяСтоимостьПериода - НачисленоВнешнейСтоимости);
				КонецЕсли;
				
				Если НЕ СтрокаДанныхРаспределения.Трудозатраты = РаспределеноТрудозатрат Тогда
					СтрокаРасчета.Трудозатраты = СтрокаРасчета.Трудозатраты 
						+ (СтрокаДанныхРаспределения.Трудозатраты - РаспределеноТрудозатрат);
				КонецЕсли; 
			КонецЕсли;
			
		 Иначе
		
			ОсталосьРаспределить = СтрокаДанныхРаспределения.Трудозатраты;
			НачисленоСтоимости = 0;
			НачисленоВнешнейСтоимости = 0;
			СтоимостьПериода = Окр(СтрокаДанныхТрудозатрат.СтоимостьЧаса * СтрокаДанныхРаспределения.Трудозатраты, 2);
			ВнешняяСтоимостьПериода = Окр(СтрокаДанныхТрудозатрат.ВнешняяСтоимостьЧаса 
				* СтрокаДанныхРаспределения.Трудозатраты, 2);
			
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(ОсталосьРаспределить) Тогда
				
				Продолжить; // Проверка на всякий случай, такого не должно быть в принципе.
				
			КонецЕсли; 
			
			// Перебираем таблицу дней и распределяем трудозатраты по рабочим дням с учетом
			// процента загрузки (определяется настройкой профиля) и видом расчета (в случае
			// обратного расчета используем коэффициенты "плановой перегрузки", если они есть).
			
			СтрокаРасчета = Неопределено;		
			
			Пока ОсталосьРаспределить > 0 Цикл

				ТекДата = ТекДата + 86400;	
							
				СтрокаДень = НайтиДеньКалендаря(РабочийКалендарь, ТекДата, ДанныеКалендаря, ВывестиСообщение);
				
				Если СтрокаДень = Неопределено Тогда
					
					Возврат Неопределено;
					
				КонецЕсли; 
				
				// Может получиться следующая ситуация: по каким-то причинам (например, накапливание
				// погрешности округления на больших периодах) при обратном расчете мы выйдем
				// за установленную дату завершения периода. В этой ситуации поступаем следующим
				// образом: списываем весь остаток трудозатрат на последнюю дату периода
				// (дату завершения) и заканчиваем расчет. 
				
				// Если же это окажется нерабочий день, то допишем остаток трудозатрат к предыдущему
				// рабочему дню.
				
				ДлительностьПоКалендарю = 0;
				ЭтоПоследнийДень = Ложь;
				
				Если ОбратныйРасчет И НачалоДня(СтрокаДень.День) = НачалоДня(ДатаЗавершения) Тогда			
				
					Если НЕ СтрокаДень.КоличествоЧасов = 0 ИЛИ СтрокаРасчета = Неопределено Тогда
						СтрокаРасчета = СтрокаДереваРесурс.Строки.Добавить();				
						СтрокаРасчета.День = СтрокаДень.День;					
					КонецЕсли; 
									
					КорректировочнаяСуммаТрудозатраты = 0;
					КорректировочнаяСуммаСтоимость = 0;
					КорректировочнаяСуммаВнешняяСтоимость = 0;
					
					Если ОсталосьРаспределить > 0 // Еще осталось, что распределить - скорее всего, это погрешность.
						И (СтрокаДень.КоличествоЧасов = 0) // И этот последний календарный день периода - не рабочий день.
						И (Не СтрокаРасчета = Неопределено) // И есть данные за ПРЕДЫДУЩИЙ РАБОЧИЙ день.
						И (Не НачалоДня(СтрокаДень.День) = НачалоДня(СтрокаРасчета.День)) Тогда
						// И дата последнего календарного дня периода не равна последней рабочей дате периода.
						
						// Тогда данные последнего рабочего дня не должны затираться данными погрешности,
						// а должны дополнять их. Т.е. данные последнего рабочего дня периода = данные периода + погрешность расчетов,
						// а не просто погрешность расчетов.
						
						КорректировочнаяСуммаТрудозатраты = СтрокаРасчета.Трудозатраты;
						КорректировочнаяСуммаСтоимость = СтрокаРасчета.Стоимость;
						КорректировочнаяСуммаВнешняяСтоимость = СтрокаРасчета.ВнешняяСтоимость;
						
					КонецЕсли;
					
					РабочихЧасовНужно = КорректировочнаяСуммаТрудозатраты + ОсталосьРаспределить;
					СтоимостьНачислить = КорректировочнаяСуммаСтоимость + Окр(ОсталосьРаспределить * СтрокаДанныхТрудозатрат.СтоимостьЧаса, 2);
					ВнешняяСтоимостьНачислить = КорректировочнаяСуммаВнешняяСтоимость + Окр(ОсталосьРаспределить * СтрокаДанныхТрудозатрат.ВнешняяСтоимостьЧаса, 2);
					
					ДлительностьПоКалендарю = СтрокаДень.КоличествоЧасов;
					
					ОсталосьРаспределить = 0;
					НачисленоСтоимости = НачисленоСтоимости + СтоимостьНачислить - КорректировочнаяСуммаСтоимость;
					НачисленоВнешнейСтоимости = НачисленоВнешнейСтоимости + ВнешняяСтоимостьНачислить - КорректировочнаяСуммаВнешняяСтоимость;
					ЭтоПоследнийДень = Истина;
					
				ИначеЕсли НЕ СтрокаДень.КоличествоЧасов = 0 Тогда
					
					// В остальных случаях (нормальный расчет)
					// пропускаем дни с нулевым количеством рабочих часов.
					
					СтрокаРасчета = СтрокаДереваРесурс.Строки.Добавить();
					СтрокаРасчета.День = СтрокаДень.День;
					ДлительностьПоКалендарю = СтрокаДень.КоличествоЧасов;
					
					РабочихЧасовВсего = СтрокаДень.КоличествоЧасов;
					Если Не СтрокаДанныхРаспределения.ПоДругомуМетоду = Неопределено И СтрокаДанныхРаспределения.ПоДругомуМетоду Тогда
						РабочихЧасовНужно = РабочихЧасовВсего * СтрокаДанныхРаспределения.ТрудозатратыВЧас;
					Иначе
						РабочихЧасовНужно = Окр((РабочихЧасовВсего * СтрокаДанныхРаспределения.Загрузка) / 100, 2);
					КонецЕсли;
					
					Если РабочихЧасовНужно > ОсталосьРаспределить Тогда
						РабочихЧасовНужно = ОсталосьРаспределить;
						ЭтоПоследнийДень = Истина;
					КонецЕсли; 
					
					СтоимостьНачислить = Окр(РабочихЧасовНужно * СтрокаДанныхТрудозатрат.СтоимостьЧаса, 2);
					ВнешняяСтоимостьНачислить = Окр(РабочихЧасовНужно * СтрокаДанныхТрудозатрат.ВнешняяСтоимостьЧаса, 2);
					ОсталосьРаспределить = ОсталосьРаспределить - РабочихЧасовНужно;
					НачисленоСтоимости = НачисленоСтоимости + СтоимостьНачислить;
					НачисленоВнешнейСтоимости = НачисленоВнешнейСтоимости + ВнешняяСтоимостьНачислить;
					
				Иначе
					
					Продолжить;
					
				КонецЕсли; 
				
				СтрокаРасчета.Трудозатраты = РабочихЧасовНужно;
				СтрокаРасчета.Стоимость = СтоимостьНачислить;
				СтрокаРасчета.ВнешняяСтоимость = ВнешняяСтоимостьНачислить;
				
				// На верхнем уровне дерева собираем данные по трудовому ресурсу в целом,
				// но при этом там нас интересуют общая длительность (только по рабочему 
				// календарю, без учета процентов загрузки и коэффициентов перегрузки)
				// и дата завершения работ трудовым ресурсом в целом по задаче.
				
				Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаДереваРесурс.День) Тогда
					СтрокаДереваРесурс.День = СтрокаРасчета.День;
				Иначе
					СтрокаДереваРесурс.День = упоСервисныеФункцииВызовСервера.обМакс(СтрокаРасчета.День, СтрокаДереваРесурс.День);	
				КонецЕсли; 
				
				ТрудозатратыРесурса = ?(ЭтоПоследнийДень, СтрокаРасчета.Трудозатраты, СтрокаДень.КоличествоЧасов);
				
				Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(СтрокаДереваРесурс.Трудозатраты) Тогда
					СтрокаДереваРесурс.Трудозатраты = ТрудозатратыРесурса;
				Иначе
					СтрокаДереваРесурс.Трудозатраты = СтрокаДереваРесурс.Трудозатраты + ТрудозатратыРесурса;
				КонецЕсли; 
				
			КонецЦикла; 		
			
			// Обновляем данные в кэше "переходов между периодами" и учитываем погрешности
			// округления при расчетах стоимости трудозатрат .
			
			Если Не СтрокаРасчета = Неопределено Тогда
				
				СтрокаКэшПериода.КонецПериода = НачалоДня(СтрокаРасчета.День);
			
				Если НЕ СтоимостьПериода = НачисленоСтоимости Тогда
					СтрокаРасчета.Стоимость = СтрокаРасчета.Стоимость + (СтоимостьПериода - НачисленоСтоимости);
				КонецЕсли; 
				
				Если НЕ ВнешняяСтоимостьПериода = НачисленоВнешнейСтоимости Тогда
					СтрокаРасчета.ВнешняяСтоимость = СтрокаРасчета.ВнешняяСтоимость 
						+ (ВнешняяСтоимостьПериода - НачисленоВнешнейСтоимости);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат ДанныеРасчета;
	
КонецФункции

// Ищет строку, соответствующую заданному дню, в таблице рабочего
// календаря. В случае необходимости выполняет "переход" на следующий
// год.
//
// Параметры:
//	 РабочийКалендарь	- Справочник.упоРабочиеКалендари.
//   ДатаГода			- Дата, в пределах нужного года.
//   ДанныеКалендаря	- Структура, куда добавить данные.
//	 ВывестиСообщение	- Булево, флаг вывода сообщения
//						в случае, если календарь не найден.
//
// Возвращаемое значение:
//   СтрокаТаблицаЗначений, Неопределено – строка таблицы рабочих дней и часов.
//
Функция НайтиДеньКалендаря(РабочийКалендарь, ДатаГода, ДанныеКалендаря, ВывестиСообщение = Истина)

	// Получаем таблицу рабочего календаря на нужный год.
		
	ТаблицаДней = ПолучитьТаблицуРабочихДней(РабочийКалендарь, ДатаГода, ДанныеКалендаря, ВывестиСообщение);
	Если ТаблицаДней = Неопределено Тогда
		Возврат Неопределено; // Нет данных рабочего календаря.
	КонецЕсли; 
	
	СтрокаДень = ТаблицаДней.Найти(ДатаГода, "День"); 			
	Если СтрокаДень = Неопределено Тогда			
		
		// По каким-то причинам даты в календаре не оказалось
		// этого не должно произойти, проверка на всякий случай.
		
		Сообщение = НСтр("ru = 'Не удалось найти в рабочем календаре на %1 год дату %2.
                          |Результаты расчетов могут оказатся некорректными.'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение,
			Формат(Год(ДатаГода), "ЧГ=0"), Формат(ДатаГода, "ДФ=dd.MM.yyyy"));
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
		Возврат Неопределено;
		
	Иначе
		
		Возврат СтрокаДень;
		
	КонецЕсли; 	

КонецФункции

// Возвращает таблицу рабочих дней указанного года, при этом
// выполняем все операции по поиску и проверке.
//
// Параметры:
//	 РабочийКалендарь	- Справочник.упоРабочиеКалендари.
//   ДатаГода			- Дата, в пределах нужного года.
//   ДанныеКалендаря	- Структура, куда добавить данные.
//	 ВывестиСообщение	- Булево, флаг вывода сообщения
//						в случае, если календарь не найден.
//
// Возвращаемое значение:
//   ТаблицаЗначений, Неопределено	– таблица рабочих дней и часов.
//
Функция ПолучитьТаблицуРабочихДней(РабочийКалендарь, ДатаГода, ДанныеКалендаря, ВывестиСообщение = Истина)

	ИмяГода = "год_" + Формат(ДатаГода, "ДФ=yyyy");
	ТаблицаКалендаря = Неопределено;
	
	ТаблицаНайдена = ДанныеКалендаря.Свойство(ИмяГода, ТаблицаКалендаря);
	
	Если НЕ ТаблицаНайдена Тогда
		
		// Искомая дата в календаре отсутствует, попробуем добавить
		// в календарь недостающий год.
		
		Если НЕ ДобавитьКалендарьНаГод(РабочийКалендарь, ДатаГода, ДанныеКалендаря, ВывестиСообщение) Тогда
			Возврат Неопределено; // Нет данных по календарю.
		КонецЕсли; 
		
		Если НЕ ДанныеКалендаря.Свойство(ИмяГода, ТаблицаКалендаря) Тогда
			
			Если ВывестиСообщение Тогда
				Сообщение = НСтр("ru = 'Не удалось получить рабочий календарь на %1 год. Результаты расчетов могут оказатся некорректными.'");
				Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, СтрЗаменить(ИмяГода, "год_", ""));
				ОбщегоНазначения.СообщитьПользователю(Сообщение);
			КонецЕсли;
				
			Возврат Неопределено; // Проверка на всякий случай, такого не должно быть.
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	Возврат ТаблицаКалендаря;
	
КонецФункции

// Добавляет в структуру данных рабочего календаря рабочие
// дни указанного года.
//
// Параметры
//	 РабочийКалендарь	- Справочник.упоРабочиеКалендари.
//   ДатаГода			- Дата, в пределах нужного года.
//   ДанныеКалендаря	- Структура, куда добавить данные.
//	 ВывестиСообщение	- Булево, флаг вывода сообщения
//						в случае, если календарь не найден.
//
// Возвращаемое значение:
//   Булево		– результат операции (найдены данные года, или нет).
//
Функция ДобавитьКалендарьНаГод(РабочийКалендарь, ДатаГода, ДанныеКалендаря, ВывестиСообщение = Истина)

	ИмяГода = "год_" + Формат(Год(ДатаГода), "ЧГ=0");
	КалендарьГода = упоРабочиеКалендариВызовСервера.обПолучитьРабочийКалендарь(РабочийКалендарь, ДатаГода);
	
	Если Не КалендарьГода = Неопределено Тогда
		ДанныеКалендаря.Вставить(ИмяГода, КалендарьГода);
	ИначеЕсли ВывестиСообщение Тогда
		Сообщение = 
			НСтр("ru = 'Не удалось получить рабочий календарь на %1 год. Результаты расчетов могут оказатся некорректными.'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, СтрЗаменить(ИмяГода, "год_", ""));
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	КонецЕсли; 
	
	Возврат (Не КалендарьГода = Неопределено);

КонецФункции

Функция ПолучитьРабочийКалендарь(Календарь)
	
	РабочийКалендарь = Неопределено;
	
	Если ТипЗнч(Календарь) = Тип("СправочникСсылка.Проекты") Тогда
		
		Если НЕ упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Календарь) Тогда
			ОбъектРабочийКалендарь = Календарь.ПолучитьОбъект();
			РабочийКалендарь = ОбъектРабочийКалендарь.ПолучитьРабочийКалендарь();
		КонецЕсли; 
		
	Иначе
		
		РабочийКалендарь = Календарь;
		
	КонецЕсли;
	
	Возврат РабочийКалендарь;
	
КонецФункции

#КонецОбласти

Функция ТаблицаТрудозатратПоДнямДляРучногоЗаполненияПланаРасходов(Проект, ПроектнаяЗадача, ТаблицаТрудовыеРесурсы,
																ТаблицаТрудовыеРесурсыПоПериодам) Экспорт
	
	СрокиПроектнойЗадачи = упоПроектыИЗадачиСервер.ПолучитьСрокиПроектнойЗадачи(ПроектнаяЗадача);
	Календарь = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача,
			"КалендарьЗадачи");
	Если Не ЗначениеЗаполнено(Календарь) Тогда
		Календарь = упоПроектыИЗадачиСервер.ПолучитьКалендарьПроекта(Проект);
	КонецЕсли;
	НормаСтоимостиТрудовыхРесурсов = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача,
			"НормаСтоимостиТрудовыхРесурсов");
	ВнешняяНормаСтоимостиТрудовыхРесурсов = упоПроектыИЗадачиСервер.ПолучитьСвойствоПроектнойЗадачи(ПроектнаяЗадача,
			"ВнешняяНормаСтоимостиТрудовыхРесурсов");
	
	ПараметрыОтбора = Новый Структура("УровеньПланирования", Перечисления.упоУровеньПланирования.Окончательный);
	ЕстьДанныеОкончательногоУровняПланирования = ЗначениеЗаполнено(ТаблицаТрудовыеРесурсы.НайтиСтроки(ПараметрыОтбора));
	УровеньПланированияДляЗаполненияПланаРасходов = ?(ЕстьДанныеОкончательногоУровняПланирования,
		Перечисления.упоУровеньПланирования.Окончательный, Перечисления.упоУровеньПланирования.Предварительный);
	
	СвойстваЗадачи = Новый Структура;
	СвойстваЗадачи.Вставить("Проект", Проект);
	СвойстваЗадачи.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
	СвойстваЗадачи.Вставить("ТекущаяВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	СвойстваЗадачи.Вставить("ДатаНач", СрокиПроектнойЗадачи.ДатаНачалаПлан);
	СвойстваЗадачи.Вставить("ДатаКон", СрокиПроектнойЗадачи.ДатаЗавершенияПлан);
	СвойстваЗадачи.Вставить("ВключитьТрудРесурсыВПланРасходов", Ложь);
	СвойстваЗадачи.Вставить("ВключитьПланРасходовВБДДС", Ложь);
	СвойстваЗадачи.Вставить("ПланироватьТрудозатратыНаИсполнителей", Ложь);
	СвойстваЗадачи.Вставить("НормаСтоимостиТрудовыхРесурсов", НормаСтоимостиТрудовыхРесурсов);
	СвойстваЗадачи.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", ВнешняяНормаСтоимостиТрудовыхРесурсов);
	СвойстваЗадачи.Вставить("Календарь", Календарь);
	
	ПараметрыДопФункциональности = ПараметрыДопФункциональности();
	
	ДеревоТрудозатратПоДням = ПолучитьТрудозатратыПоДням(СвойстваЗадачи, 
		ТаблицаТрудовыеРесурсы, ТаблицаТрудовыеРесурсыПоПериодам, ПараметрыДопФункциональности);
	ТаблицаТрудозатратПоДням = ШаблонТаблицыТрудозатратПоДнямДляЗаполненияПланаРасходов();
	
	Для каждого СтрокаРоли Из ДеревоТрудозатратПоДням.Строки Цикл
		Если СтрокаРоли.УровеньПланирования <> УровеньПланированияДляЗаполненияПланаРасходов Тогда
			Продолжить;
		КонецЕсли;
		
		Роль = СтрокаРоли.Ресурс;
		Подразделение = СтрокаРоли.Подразделение;
		
		Для каждого ДетальныеДанныеРаспределения Из СтрокаРоли.Строки Цикл
			НоваяСтрока = ТаблицаТрудозатратПоДням.Добавить();
			НоваяСтрока.Роль = Роль;
			НоваяСтрока.Подразделение = Подразделение;
			НоваяСтрока.Период = ДетальныеДанныеРаспределения.День;
			НоваяСтрока.Стоимость = ДетальныеДанныеРаспределения.Стоимость;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаТрудозатратПоДням;
	
КонецФункции

Функция ИспользуетсяОперЗагрузка()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	упоОперативнаяЗагрузкаСпециалистов.ТрудовойРесурс КАК ТрудовойРесурс
		|ИЗ
		|	РегистрСведений.упоОперативнаяЗагрузкаСпециалистов КАК упоОперативнаяЗагрузкаСпециалистов");
		
		Результат = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Чтение записей регистра ""упоОперативнаяЗагрузкаСпециалистов""'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Во время выполнения действия произошла неизвестная ошибка.'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение
			НСтр("ru = 'Ошибка чтения признака использования оперативной загрузки. Обратитесь к администратору.'");
	КонецПопытки;
	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция ИспользуетсяРаспределениеРесурсовПоДням()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням.ПроектнаяЗадача КАК ПроектнаяЗадача
		                      |ИЗ
		                      |	РегистрСведений.упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням КАК упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням");
		
		Результат = Запрос.Выполнить();
		
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Чтение записей регистра ""упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням""'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Во время выполнения действия произошла неизвестная ошибка.'") + Символы.ПС +
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение
			НСтр("ru = 'Ошибка чтения признака использования распределения трудозатрат по дням. Обратитесь к администратору.'");
	КонецПопытки;
	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция ПараметрыДопФункциональности()
	
	ПараметрыДопФункциональности = Новый Структура;
	ПараметрыДопФункциональности.Вставить("ИспользуетсяОперЗагрузка", ИспользуетсяОперЗагрузка());
	ПараметрыДопФункциональности.Вставить("ИспользуетсяРаспределениеРесурсовПоДням", ИспользуетсяРаспределениеРесурсовПоДням());
	
	Возврат ПараметрыДопФункциональности;
	
КонецФункции

Функция ТаблицаСтоимостиТрудозатратПоДнямСУчетомПериодаНормСтоимости(ПроектнаяЗадача, УровеньПланированияТрудозатрат)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|   ПланТрудозатратПоДнямТекущаяВерсия.Ресурс КАК Роль,
		|   ПланТрудозатратПоДнямТекущаяВерсия.Подразделение КАК Подразделение,
		|   ПланТрудозатратПоДнямТекущаяВерсия.День КАК Период,
		|   ПланТрудозатратПоДнямТекущаяВерсия.Стоимость КАК Стоимость
		|ИЗ
		|   РегистрСведений.упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия КАК ПланТрудозатратПоДнямТекущаяВерсия
		|ГДЕ
		|   ПланТрудозатратПоДнямТекущаяВерсия.Операция = &ПроектнаяЗадача
		|   И ТИПЗНАЧЕНИЯ(ПланТрудозатратПоДнямТекущаяВерсия.Ресурс) = ТИП(Справочник.упоРоли)
		|   И ПланТрудозатратПоДнямТекущаяВерсия.УровеньПланирования = &УровеньПланирования";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("УровеньПланирования", УровеньПланированияТрудозатрат);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ЗаполнитьПланРасходовТрудовымиРесурсами(ТаблицаПланРасходов,
		ТаблицаРаспределениеПоСтатьям,
		ТаблицаТрудозатратПоДням,
		ЗначенияПоУмолчанию)
	
	ВалютаУпрУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	СтатьиБезЗаполненногоСпособаПривязки = Новый Соответствие;
	
	Для Каждого СтрокаРаспределенияПоСтатьям Из ТаблицаРаспределениеПоСтатьям Цикл
		НоваяСтрока = ТаблицаПланРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределенияПоСтатьям);
		НоваяСтрока.Валюта = ВалютаУпрУчета;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СпособПривязки) Тогда
			НоваяСтрока.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения;
			НоваяСтрока.ПрофильРаспределения = ЗначенияПоУмолчанию.ПрофильРасходовПоУмолчанию;
			Если СтатьиБезЗаполненногоСпособаПривязки.Получить(СтрокаРаспределенияПоСтатьям.Роль) = Неопределено Тогда
				СтатьиБезЗаполненногоСпособаПривязки.Вставить(СтрокаРаспределенияПоСтатьям.Роль, НоваяСтрока.Статья);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаРаспределенияПоСтатьям.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно Тогда
			НоваяСтрока.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.НаДату;
			НоваяСтрока.ДатаПривязки = СтрокаРаспределенияПоСтатьям.Период;
			НоваяСтрока.ПериодАгрегации = Перечисления.упоПериодыАгрегацииЗатрат.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	СообщитьОбОтсутствииСпособаПривязкиВСтатье(СтатьиБезЗаполненногоСпособаПривязки);
	
КонецПроцедуры

Процедура ЗаполнитьПланРасходовТрудовымиРесурсамиПоПериодамСводно(ДатыПроектнойЗадачи,
	ТаблицаРаспределеняПоСтатьям, ТаблицаПланРасходов, СтатьиБезЗаполненногоСпособаПривязки)
	
	ВалютаУпрУчета = ПараметрыСеанса.упоВалютаУправленческогоУчета;
	
	СвернутьТаблицуПоПериодуАгрегацииДляЗаполненияПланаРасходов(ТаблицаРаспределеняПоСтатьям,
		ДатыПроектнойЗадачи.ДатаЗавершенияПлан);
	
	Для Каждого СтрокаРаспределения Из ТаблицаРаспределеняПоСтатьям Цикл
		НоваяСтрока = ТаблицаПланРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
		НоваяСтрока.Валюта = ВалютаУпрУчета;
		НоваяСтрока.Сумма = СтрокаРаспределения.Сумма;
		
		НоваяСтрока.СпособПривязки = Перечисления.упоСпособПривязкиДоходаРасхода.НаДату;
		НоваяСтрока.ДатаПривязки = СтрокаРаспределения.Период;
		НоваяСтрока.ПериодАгрегации = Перечисления.упоПериодыАгрегацииЗатрат.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры

Процедура СвернутьТаблицуПоПериодуАгрегацииДляЗаполненияПланаРасходов(ТаблицаРаспределениеПоСтатьям,
		ДатаЗавершенияПроектнойЗадачиПлан)
	
	ДатаЗавершенияПроектнойЗадачиПлан = НачалоДня(ДатаЗавершенияПроектнойЗадачиПлан);
	
	ПараметрыОтбора = Новый Структура("СпособПривязки", Перечисления.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно);
	СтрокиСПравиломПоПериодамСводно = ТаблицаРаспределениеПоСтатьям.НайтиСтроки(ПараметрыОтбора);
	Если СтрокиСПравиломПоПериодамСводно.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из СтрокиСПравиломПоПериодамСводно Цикл
		Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Период) Тогда
			Продолжить;
		КонецЕсли;
		АгрегированныйПериод = НачалоДня(КонецПериодаАгрегации(НайденнаяСтрока.Период, НайденнаяСтрока.ПериодАгрегации));
		НайденнаяСтрока.Период = Мин(АгрегированныйПериод, ДатаЗавершенияПроектнойЗадачиПлан);
	КонецЦикла;
	
	ГруппыКолонок = КолонкиДляСверткиТаблицыТрудозатратДляЗаполненияПланаРасходов();
	СтрокаКолонокДляГруппировки = ГруппыКолонок.КолонкиГруппировок;
	СтрокаКолонокДляСуммирования = ГруппыКолонок.КолонкиСуммирования;
	
	ТаблицаРаспределениеПоСтатьям.Свернуть(СтрокаКолонокДляГруппировки, СтрокаКолонокДляСуммирования);
	
КонецПроцедуры

Функция КолонкиДляСверткиТаблицыТрудозатратДляЗаполненияПланаРасходов()
	
	ГруппыКолонок = Новый Структура;
	
	КолонкиГруппировки = Новый Массив;
	КолонкиГруппировки.Добавить("Роль");
	КолонкиГруппировки.Добавить("Подразделение");
	КолонкиГруппировки.Добавить("Статья");
	КолонкиГруппировки.Добавить("СпособПривязки");
	КолонкиГруппировки.Добавить("ПрофильРаспределения");
	КолонкиГруппировки.Добавить("ПериодАгрегации");
	КолонкиГруппировки.Добавить("Период");
	КолонкиГруппировки.Добавить("Контрагент");
	КолонкиГруппировки.Добавить("Договор");
	СтрокаКолонокДляГруппировки = СтрСоединить(КолонкиГруппировки, ",");
	ГруппыКолонок.Вставить("КолонкиГруппировок", СтрокаКолонокДляГруппировки);
	
	КолонкиДляСуммирования = Новый Массив;
	КолонкиДляСуммирования.Добавить("Сумма");
	СтрокаКолонокДляСуммирования = СтрСоединить(КолонкиДляСуммирования, ",");
	ГруппыКолонок.Вставить("КолонкиСуммирования", СтрокаКолонокДляСуммирования);
	
	Возврат ГруппыКолонок;
	
КонецФункции

Процедура СвернутьТрудовыеРесурсыТЧ(ТрудовыеРесурсыТЧ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧ", ТрудовыеРесурсыТЧ);
	
	Если ТрудовыеРесурсыТЧ.Колонки.Найти("Версия") = Неопределено Тогда
		Запрос.Текст = ТекстЗапросаСворачиванияТрудовыхРесурсовИзПроектнойЗадачи(); 
	Иначе
		Запрос.Текст = ТекстЗапросаСворачиванияТрудовыхРесурсовИзСтруктуры();
	КонецЕсли;	
	
	ТрудовыеРесурсыТЧ = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция ТекстЗапросаСворачиванияТрудовыхРесурсовИзСтруктуры()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧ.Ресурс КАК Ресурс,
	               |	ТЧ.Количество КАК Количество,
	               |	ТЧ.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	ТЧ.Стоимость КАК Стоимость,
	               |	ТЧ.ОбщСтоимость КАК ОбщСтоимость,
	               |	ТЧ.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТЧ.Подразделение КАК Подразделение,
	               |	ТЧ.ВнешняяСтоимость КАК ВнешняяСтоимость,
	               |	ТЧ.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
	               |	ТЧ.СпособПривязки КАК СпособПривязки,
	               |	ТЧ.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	ТЧ.УровеньПланирования КАК УровеньПланирования,
	               |	ТЧ.Версия КАК Версия,
	               |	ТЧ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТЧ.ИсточникПлана КАК ИсточникПлана
	               |ПОМЕСТИТЬ ТЧ
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.Ресурс КАК Ресурс,
	               |	СУММА(ТЧ.Количество) КАК Количество,
	               |	ТЧ.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	МАКСИМУМ(ТЧ.Стоимость) КАК Стоимость,
	               |	СУММА(ТЧ.ОбщСтоимость) КАК ОбщСтоимость,
	               |	ТЧ.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТЧ.Подразделение КАК Подразделение,
	               |	МАКСИМУМ(ТЧ.ВнешняяСтоимость) КАК ВнешняяСтоимость,
	               |	СУММА(ТЧ.ОбщВнешняяСтоимость) КАК ОбщВнешняяСтоимость,
	               |	ТЧ.СпособПривязки КАК СпособПривязки,
	               |	МИНИМУМ(ТЧ.ИндексСтрокРаспределенияПоПериодам) КАК ИндексСтрокРаспределенияПоПериодам,
	               |	ТЧ.УровеньПланирования КАК УровеньПланирования,
	               |	ТЧ.Версия КАК Версия,
	               |	ТЧ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТЧ.ИсточникПлана КАК ИсточникПлана
	               |ИЗ
	               |	ТЧ КАК ТЧ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЧ.Ресурс,
	               |	ТЧ.ЕдиницаНормирования,
	               |	ТЧ.ПрофильРаспределения,
	               |	ТЧ.Подразделение,
	               |	ТЧ.СпособПривязки,
	               |	ТЧ.УровеньПланирования,
	               |	ТЧ.Версия,
	               |	ТЧ.ПроектнаяЗадача,
	               |	ТЧ.ИсточникПлана";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ТекстЗапросаСворачиванияТрудовыхРесурсовИзПроектнойЗадачи()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧ.Ресурс КАК Ресурс,
	               |	ТЧ.Количество КАК Количество,
	               |	ТЧ.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	ТЧ.Стоимость КАК Стоимость,
	               |	ТЧ.ОбщСтоимость КАК ОбщСтоимость,
	               |	ТЧ.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТЧ.Подразделение КАК Подразделение,
	               |	ТЧ.ВнешняяСтоимость КАК ВнешняяСтоимость,
	               |	ТЧ.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
	               |	ТЧ.СпособПривязки КАК СпособПривязки,
	               |	ТЧ.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	ТЧ.УровеньПланирования КАК УровеньПланирования,
	               |	ТЧ.ИсточникПлана КАК ИсточникПлана
	               |ПОМЕСТИТЬ ТЧ
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.Ресурс КАК Ресурс,
	               |	СУММА(ТЧ.Количество) КАК Количество,
	               |	ТЧ.ЕдиницаНормирования КАК ЕдиницаНормирования,
	               |	МАКСИМУМ(ТЧ.Стоимость) КАК Стоимость,
	               |	СУММА(ТЧ.ОбщСтоимость) КАК ОбщСтоимость,
	               |	ТЧ.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	ТЧ.Подразделение КАК Подразделение,
	               |	МАКСИМУМ(ТЧ.ВнешняяСтоимость) КАК ВнешняяСтоимость,
	               |	СУММА(ТЧ.ОбщВнешняяСтоимость) КАК ОбщВнешняяСтоимость,
	               |	ТЧ.СпособПривязки КАК СпособПривязки,
	               |	МИНИМУМ(ТЧ.ИндексСтрокРаспределенияПоПериодам) КАК ИндексСтрокРаспределенияПоПериодам,
	               |	ТЧ.УровеньПланирования КАК УровеньПланирования,
	               |	ТЧ.ИсточникПлана КАК ИсточникПлана
	               |ИЗ
	               |	ТЧ КАК ТЧ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЧ.Ресурс,
	               |	ТЧ.ЕдиницаНормирования,
	               |	ТЧ.ПрофильРаспределения,
	               |	ТЧ.Подразделение,
	               |	ТЧ.СпособПривязки,
	               |	ТЧ.УровеньПланирования,
	               |	ТЧ.ИсточникПлана";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ТекстЗапросаТрудовыеРесурсыДляЗаполненияПланаРасходов()
	
	ТекстЗапроса = "ВЫБРАТЬ
		|    ТрудозатратыПоДням.Роль КАК Роль,
		|    ТрудозатратыПоДням.Подразделение КАК Подразделение,
		|    ТрудозатратыПоДням.Период КАК Период,
		|    ТрудозатратыПоДням.Стоимость КАК Стоимость
		|ПОМЕСТИТЬ ТрудозатратыПоДням
		|ИЗ
		|    &ТрудозатратыПоДням КАК ТрудозатратыПоДням
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    ТрудозатратыПоДням.Роль КАК Роль,
		|    ТрудозатратыПоДням.Подразделение КАК Подразделение,
		|    ЕСТЬNULL(упоРаспределениеРесурсовПоСтатьямЗатрат.СтатьяЗатрат, ЗНАЧЕНИЕ(Справочник.упоСтатьиЗатрат.ПустаяСсылка)) КАК Статья,
		|    СУММА(ВЫБОР
		|            КОГДА упоРаспределениеРесурсовПоСтатьямЗатрат.ДоляСуммы ЕСТЬ NULL
		|                ТОГДА ТрудозатратыПоДням.Стоимость
		|            ИНАЧЕ ТрудозатратыПоДням.Стоимость * (упоРаспределениеРесурсовПоСтатьямЗатрат.ДоляСуммы / 100)
		|        КОНЕЦ) КАК Сумма,
		|    упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты КАК СпособПривязки,
		|    ВЫБОР
		|        КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
		|            ТОГДА упоСтатьиЗатрат.ПрофильРаспределенияРасходовТрудозатраты
		|        ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка)
		|    КОНЕЦ КАК ПрофильРаспределения,
		|    ВЫБОР
		|        КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно)
		|            ТОГДА ТрудозатратыПоДням.Период
		|        ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|    КОНЕЦ КАК Период,
		|    ВЫБОР
		|        КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно)
		|            ТОГДА упоСтатьиЗатрат.ПериодАгрегацииРасходовТрудозатраты
		|        ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоПериодыАгрегацииЗатрат.ПустаяСсылка)
		|    КОНЕЦ КАК ПериодАгрегации,
		|    упоСтатьиЗатрат.КонтрагентРасходовТрудозатраты КАК Контрагент,
		|    упоСтатьиЗатрат.ДоговорРасходовТрудозатраты КАК Договор,
		|    ИСТИНА КАК ЭтоРольТрудовогоРесурса
		|ИЗ
		|    ТрудозатратыПоДням КАК ТрудозатратыПоДням
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРаспределениеРесурсовПоСтатьямЗатрат КАК упоРаспределениеРесурсовПоСтатьямЗатрат
		|            ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоСтатьиЗатрат КАК упоСтатьиЗатрат
		|            ПО упоРаспределениеРесурсовПоСтатьямЗатрат.СтатьяЗатрат = упоСтатьиЗатрат.Ссылка
		|        ПО ТрудозатратыПоДням.Роль = упоРаспределениеРесурсовПоСтатьямЗатрат.Ресурс
		|
		|СГРУППИРОВАТЬ ПО
		|    ЕСТЬNULL(упоРаспределениеРесурсовПоСтатьямЗатрат.СтатьяЗатрат, ЗНАЧЕНИЕ(Справочник.упоСтатьиЗатрат.ПустаяСсылка)),
		|    ТрудозатратыПоДням.Роль,
		|    ВЫБОР
		|        КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно)
		|            ТОГДА упоСтатьиЗатрат.ПериодАгрегацииРасходовТрудозатраты
		|        ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоПериодыАгрегацииЗатрат.ПустаяСсылка)
		|    КОНЕЦ,
		|    упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты,
		|    упоСтатьиЗатрат.ДоговорРасходовТрудозатраты,
		|    упоСтатьиЗатрат.КонтрагентРасходовТрудозатраты,
		|    ВЫБОР
		|        КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения)
		|            ТОГДА упоСтатьиЗатрат.ПрофильРаспределенияРасходовТрудозатраты
		|        ИНАЧЕ ЗНАЧЕНИЕ(Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка)
		|    КОНЕЦ,
		|    ТрудозатратыПоДням.Подразделение,
		|    ВЫБОР
		|        КОГДА упоСтатьиЗатрат.СпособПривязкиРасходовТрудозатраты = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.ПоПериодамСводно)
		|            ТОГДА ТрудозатратыПоДням.Период
		|        ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|    КОНЕЦ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура СообщитьОбОтсутствииСпособаПривязкиВСтатье(СтатьиБезЗаполненногоСпособаПривязки)
	
	ШаблонСообщенияНетПривязки = НСтр("ru = 'Для роли %1, в статье %2 не указан способ привязки.'");
	Для Каждого РольИСтатья Из СтатьиБезЗаполненногоСпособаПривязки Цикл
		Роль = РольИСтатья.Ключ;
		Статья = РольИСтатья.Значение;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщенияНетПривязки, Роль, Статья);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРаспределениеПланаРасходовЗаполненногоПоТрудовымРесурсам(СтартовыйИндекс,
		Проект,
		ЗначенияПоУмолчанию,
		ТаблицаПланРасходов,
		ТаблицаРаспределениеРасходов,
		ТаблицаРаспределениеПоСтатьям,
		СвернутьПоСтатьям)
	
	Если СтартовыйИндекс = Неопределено Тогда
		ИндексСтрокРаспределения = упоАналитикаПоПодразделениямКлиентСервер.ПолучитьИндексСтрокРаспределенияНовойСтроки(
				ТаблицаПланРасходов);
	Иначе
		ИндексСтрокРаспределения = СтартовыйИндекс
		КонецЕсли;
	Для Каждого СтрокаРасходов Из ТаблицаПланРасходов Цикл
		СтрокаРасходов.ИндексСтрокРаспределения = ИндексСтрокРаспределения;
		ИндексСтрокРаспределения = ИндексСтрокРаспределения + 1;
	КонецЦикла;
	
	НастройкиУчета = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	Индекс = 0;
	РолиБезСтоимости = Новый Массив;
	Для Каждого СтрокаТР Из ТаблицаПланРасходов Цикл
		
		Если СвернутьПоСтатьям Тогда
			ПараметрыОтбора = Новый Структура("Статья, Период", СтрокаТР.Статья, СтрокаТР.ДатаПривязки);
			ПодчиненныеСтроки = ТаблицаРаспределениеПоСтатьям.НайтиСтроки(ПараметрыОтбора);
		Иначе
			ПодчиненныеСтроки = Новый Массив;
			ПодчиненныеСтроки.Добавить(ТаблицаРаспределениеПоСтатьям.Получить(Индекс));
		КонецЕсли;
		Если НЕ ПодчиненныеСтроки.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаРаспределения Из ПодчиненныеСтроки Цикл
			
			НоваяСтрокаРаспределения = ТаблицаРаспределениеРасходов.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, СтрокаРаспределения);
			НоваяСтрокаРаспределения.ИндексСтрокиВладельца = СтрокаТР.ИндексСтрокРаспределения;
			НоваяСтрокаРаспределения.СобствСилы_Субподряд = упоАналитикаПоПодразделениямСервер.СССП_Роли(СтрокаРаспределения.Роль);
			
			Если Не НастройкиУчета.РасходыПоНатуральнымПоказателям Тогда
				НоваяСтрокаРаспределения.СпособПривязки = Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения;
				НоваяСтрокаРаспределения.ПрофильРаспределения = ЗначенияПоУмолчанию.ПрофильРасходовПоУмолчанию;
			КонецЕсли;
			
			Если СтрокаРаспределения.Сумма = 0 Тогда
				РолиБезСтоимости.Добавить(СтрокаРаспределения.Роль);
			КонецЕсли;
			
		КонецЦикла;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РолиБезСтоимости) Тогда
		ШаблонСообщенияНетСтоимости = НСтр("ru = 'В источнике не заполнена стоимость по ресурсам: 
				|%1.
				|Суммы расхода необходимо заполнить вручную.'");
		РолиСтрокой = СтрСоединить(РолиБезСтоимости, Символы.ПС);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщенияНетСтоимости, РолиСтрокой);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Функция ИндексыСтрокРаспределенияПоПериодамДоИПослеСворачивания(ТрудовыеРесурсыТЧИсходная, ТрудовыеРесурсыТЧ)
	
	Если ТрудовыеРесурсыТЧИсходная.Количество() = ТрудовыеРесурсыТЧ.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексыБылоСтало = Новый Соответствие;	
	
	Отбор = Новый Структура;
	
	Для каждого ИсходнаяСтрокаТР Из ТрудовыеРесурсыТЧИсходная Цикл
		
		Если ИсходнаяСтрокаТР.СпособПривязки <> Перечисления.упоСпособПривязкиРаспределения.Вручную Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор.Вставить("Ресурс", ИсходнаяСтрокаТР.Ресурс);
		Отбор.Вставить("ЕдиницаНормирования", ИсходнаяСтрокаТР.ЕдиницаНормирования);
		Отбор.Вставить("ПрофильРаспределения", ИсходнаяСтрокаТР.ПрофильРаспределения);
		Отбор.Вставить("Подразделение", ИсходнаяСтрокаТР.Подразделение);
		Отбор.Вставить("СпособПривязки", ИсходнаяСтрокаТР.СпособПривязки);
		Отбор.Вставить("УровеньПланирования", ИсходнаяСтрокаТР.УровеньПланирования);
		Отбор.Вставить("ИсточникПлана", ИсходнаяСтрокаТР.ИсточникПлана);
		
		СтрокиТР = ТрудовыеРесурсыТЧ.НайтиСтроки(Отбор);
		ИндексыБылоСтало.Вставить(ИсходнаяСтрокаТР.ИндексСтрокРаспределенияПоПериодам, 
			СтрокиТР[0].ИндексСтрокРаспределенияПоПериодам);
			
	КонецЦикла;
	
	Возврат ИндексыБылоСтало;
	
КонецФункции

Процедура ПересчитатьИндексыТрудовыхРесурсовПоПериодам(ТрудовыеРесурсыПоПериодам, ИндексыБылоСтало)

	Для каждого СтрокаТРПоПериодам Из ТрудовыеРесурсыПоПериодам Цикл		
		НовыйИндекс = ИндексыБылоСтало[СтрокаТРПоПериодам.ИндексСтрокиРаспределениеПоРолям];			
		СтрокаТРПоПериодам.ИндексСтрокиРаспределениеПоРолям = НовыйИндекс;			
	КонецЦикла;
	
	ТрудовыеРесурсыПоПериодам.Свернуть("ИндексСтрокиРаспределениеПоРолям, Период", "Количество");
	
КонецПроцедуры

#КонецОбласти
