
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	// Инициализация реквизита формы с целью определения необходимости дальнейшей проверки кол-ва введенных часов.
	НеПроверятьКоличествоРабочихЧасов = Константы.упоОтключитьПроверкуКоличестваРабочихЧасов.Получить();
		
	Если упоУправлениеФормамиСервер.ЭтоНовый(ЭтаФорма) Тогда
		
		Объект.ДеньНачалаНедели = НачалоНедели(ТекущаяДатаСеанса());
		Объект.ДеньКонецНедели = КонецНедели(Объект.ДеньНачалаНедели);  
		Для каждого СтрокаДляПроверки Из Объект.РабочиеЗадания Цикл
			СтрокаДляПроверки.ИтогоПоСтроке = СтрокаДляПроверки.Понедельник
				+ СтрокаДляПроверки.Вторник 
				+ СтрокаДляПроверки.Среда
				+ СтрокаДляПроверки.Четверг
				+ СтрокаДляПроверки.Пятница 
				+ СтрокаДляПроверки.Суббота
				+ СтрокаДляПроверки.Воскресенье;
		КонецЦикла;
		
		константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах = Константы.упоИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах.Получить();
	
		Если НЕ константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах Тогда
			Объект.ИспользоватьРасшифровкуТрудозатрат = Ложь;	
		Иначе
			Объект.ИспользоватьРасшифровкуТрудозатрат = упоПользователиВызовСервера.обПолучитьНастройкуПользователя("ИспользоватьРасшифровкуТрудозатрат");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ТрудовойРесурс) Тогда
			ТрудовойРесурсПриИзмененииСервер();
		КонецЕсли;
		
		УстановитьВидимостьРасшифровки(); 
		
		УстановитьДатыДнямНеделиВШапкиТаблиц(Объект, ЭтаФорма);
		
	КонецЕсли;
	
	ИнициализацияВыбораТрудовогоРесурса(); 
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект); 
    	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УдалитьСтрокиРасшифровкиНеСвязанныеСТабЧастями();
	
	ПроверкаЗаполненияРасшифровки(Отказ, ПараметрыЗаписи); 
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ, "");
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ЗаполнитьДопПараметрыРабочихЗаданий();
	
	ИспользоватьРасшифровку = Объект.ИспользоватьРасшифровкуТрудозатрат 
		И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах;
		
	ЗаполнитьСрокиЗадач();	
	ОпределитьВозможностьРедактированияЯчеек(ИспользоватьРасшифровку);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах = Константы.упоИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах.Получить();
	
	ЗаполнитьДопПараметрыРабочихЗаданий();
	
	ПредыдущаяДата = Объект.ДеньНачалаНедели;	
	
	ЗаполнитьСрокиЗадач();
	
	мРабочиеЗадания.Загрузить(Объект.РабочиеЗадания.Выгрузить());
	
	УстановитьВидимостьРасшифровки(); 
	
	УстановитьДатыДнямНеделиВШапкиТаблиц(Объект, ЭтаФорма);
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаИтогоЗаНеделю" Тогда
		СформироватьИтоги(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПоследняяМодификацияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификацияНажатие(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньНачалаНеделиПриИзменении(Элемент)
	
	ИзменитьНачалоНеделиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньНачалаНеделиРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьНачалоНеделиСервер(Направление);  
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовойРесурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура("Ссылка", СписокТрудовыхРесурсовПользователя);
	ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("Справочник.упоТрудовыеРесурсы.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрудовойРесурсПриИзменении(Элемент)
	ТрудовойРесурсПриИзмененииСервер();	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаРабочиеЗадания" Тогда
		ТекущаяТаблица = Элементы.РабочиеЗадания;
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаВнепроектныеЗадачи" Тогда
		ТекущаяТаблица = Элементы.ВнепроектныеЗадачи;
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаПотериВремени" Тогда
		ТекущаяТаблица = Элементы.ПотериВремени;	
	Иначе
		ТекущаяТаблица = Неопределено;
	КонецЕсли;
	
	Если ТекущаяТаблица <> Неопределено Тогда
		ОбновитьОтборРасшифровки(ТекущаяТаблица);
	КонецЕсли;
	
	Если ТекущаяСтраница.Имя = "СтраницаИтогоЗаНеделю" Тогда
		СформироватьИтоги(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРабочиеЗадания

&НаКлиенте
Процедура РабочиеЗаданияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПриАктивизацииСтроки(Элемент)
	
	ИзменитьНадписьДатыВвода("НадписьДатыВвода", "РабочиеЗадания");
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПонедельникПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.РабочиеЗадания, Элементы.РасшифровкаТрудозатратРабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияВторникПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.РабочиеЗадания, Элементы.РасшифровкаТрудозатратРабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияЧетвергПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.РабочиеЗадания, Элементы.РасшифровкаТрудозатратРабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПятницаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.РабочиеЗадания, Элементы.РасшифровкаТрудозатратРабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияСубботаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.РабочиеЗадания, Элементы.РасшифровкаТрудозатратРабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияВоскресеньеПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.РабочиеЗадания, Элементы.РасшифровкаТрудозатратРабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияСредаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.РабочиеЗадания, Элементы.РасшифровкаТрудозатратРабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.РабочиеЗадания.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Задание) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Задание);
	Иначе
		ПоказатьЗначение(,ТекущиеДанные.РабочееЗадание);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияРольРесурсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.РабочиеЗадания.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РольРесурса = ТекДанные.РольРесурса;
	Если ЗначениеЗаполнено(РольРесурса) И Не ПользователиКлиент.ЭтоПолноправныйПользователь() Тогда
		УстановитьПараметрыВыбораПодразделенияРоли(РольРесурса, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПриАктивизацииЯчейки(Элемент)
	
	Если Объект.ИспользоватьРасшифровкуТрудозатрат И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах Тогда
		ОбновитьОтборРасшифровки(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПослеУдаления(Элемент)
	
	УдалитьРасшифровкиСтрокиТЧ(Элемент.Имя, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияПроектОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЗаданияНаименованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВнепроектныеЗадачи

&НаКлиенте
Процедура ВнепроектныеЗадачиПриАктивизацииСтроки(Элемент)
	
	ИзменитьНадписьДатыВвода("НадписьДатыВводаВнепроектныеЗадачи", "ВнепроектныеЗадачи");
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Задача",  Объект.ВнепроектныеЗадачи, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Задача",  Объект.ВнепроектныеЗадачи, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиЗадачаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ВнепроектныеЗадачи.ТекущиеДанные;
	СтруктураЗаполнения = Новый Структура("ДатаНачала,
										   |ДатаОкончания,
										   |ТолькоПросмотрПонедельник,
										   |ТолькоПросмотрВторник,
										   |ТолькоПросмотрСреда,
										   |ТолькоПросмотрЧетверг,
										   |ТолькоПросмотрПятница,										   
										   |ТолькоПросмотрСуббота,
										   |ТолькоПросмотрВоскресенье");
	ЗаполнитьСрокиВнепроектногоЗаданияВСтроке(СтруктураЗаполнения, ТекущиеДанные.Задача);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиПонедельникПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ВнепроектныеЗадачи, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиВторникПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ВнепроектныеЗадачи, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиСредаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ВнепроектныеЗадачи, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиЧетвергПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ВнепроектныеЗадачи, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиПятницаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ВнепроектныеЗадачи, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиСубботаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ВнепроектныеЗадачи, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиВоскресеньеПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ВнепроектныеЗадачи, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиПриАктивизацииЯчейки(Элемент)
	
	Если Объект.ИспользоватьРасшифровкуТрудозатрат И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах Тогда
		ОбновитьОтборРасшифровки(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнепроектныеЗадачиПередУдалением(Элемент, Отказ)
	
	УдалитьРасшифровкиСтрокиТЧ(Элемент.Имя, Элемент.ТекущиеДанные);
	
	ОбновитьОтборРасшифровки(Элементы.ВнепроектныеЗадачи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПотериВремени

&НаКлиенте
Процедура ПотериВремениОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Причина", Объект.ПотериВремени, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Причина", 
		Объект.ПотериВремени, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениПриАктивизацииЯчейки(Элемент)
	
	Если Объект.ИспользоватьРасшифровкуТрудозатрат И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах Тогда
		ОбновитьОтборРасшифровки(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениПонедельникПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ПотериВремени, Элементы.РасшифровкаТрудозатратПотериВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениВторникПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ПотериВремени, Элементы.РасшифровкаТрудозатратПотериВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениСредаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ПотериВремени, Элементы.РасшифровкаТрудозатратПотериВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениЧетвергПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ПотериВремени, Элементы.РасшифровкаТрудозатратПотериВремени);
	
КонецПроцедуры

&НаКлиенте             
Процедура ПотериВремениПятницаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ПотериВремени, Элементы.РасшифровкаТрудозатратПотериВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениСубботаПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ПотериВремени, Элементы.РасшифровкаТрудозатратПотериВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениВоскресеньеПриИзменении(Элемент)
	
	ПриИзмененииКоличестваЧасов(Элемент, Элементы.ПотериВремени, Элементы.РасшифровкаТрудозатратПотериВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ПотериВремениПередУдалением(Элемент, Отказ)
	
	УдалитьРасшифровкиСтрокиТЧ(Элемент.Имя, Элемент.ТекущиеДанные);
	
	ОбновитьОтборРасшифровки(Элементы.ПотериВремени);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаТрудозатрат

&НаКлиенте
Процедура РасшифровкаТрудозатратВнепроектныеЗадачиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа,
	Параметр)
	
	ПроверитьВозможностьДобавленияРасшифровки(Элементы.ВнепроектныеЗадачи.ТекущийЭлемент, "ВнепроектныеЗадачи", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратПотериВремениПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПроверитьВозможностьДобавленияРасшифровки(Элементы.ПотериВремени.ТекущийЭлемент, "ПотериВремени", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратВнепроектныеЗадачиВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораВидаОперации(Элемент, Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи,
								   ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача"),
								   СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратПотериВремениВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораВидаОперации(Элемент, Элементы.РасшифровкаТрудозатратПотериВремени,
								   ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени"),
								   СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратРабочиеЗаданияВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораВидаОперации(Элемент, 
								   Элементы.РасшифровкаТрудозатратРабочиеЗадания,
								   ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача"),
								   СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратРабочиеЗаданияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПроверитьВозможностьДобавленияРасшифровки(Элементы.РабочиеЗадания.ТекущийЭлемент, "РабочиеЗадания", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратПотериВремениПослеУдаления(Элемент)
	
	ОбновитьДанныеТабличнойЧасти(Элементы.ПотериВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратПотериВремениПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И НоваяСтрока И (НЕ Копирование) Тогда
		ТекущаяСтрока.ВидОперации = ПолучитьВидОперацииПоЗадаче(Элементы.ПотериВремени.ТекущиеДанные.Причина); 		
        ЗаполнитьВидОперацииРасшифровки(ТекущаяСтрока, Элементы.ПотериВремени);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратПотериВремениПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ОбновитьДанныеТабличнойЧасти(Элементы.ПотериВремени);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратРабочиеЗаданияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И НоваяСтрока И (НЕ Копирование) Тогда
		ТекущаяСтрока.ВидОперации = ПредопределенноеЗначение("Справочник.упоВидыОпераций.Явка");
        ЗаполнитьВидОперацииРасшифровки(ТекущаяСтрока, Элементы.РабочиеЗадания);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратРабочиеЗаданияПослеУдаления(Элемент)
	
	ОбновитьДанныеТабличнойЧасти(Элементы.РабочиеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратВнепроектныеЗадачиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И НоваяСтрока И (НЕ Копирование) Тогда
		ТекущаяСтрока.ВидОперации = ПолучитьВидОперацииПоЗадаче(Элементы.ВнепроектныеЗадачи.ТекущиеДанные.Задача); 		
        ЗаполнитьВидОперацииРасшифровки(ТекущаяСтрока, Элементы.ВнепроектныеЗадачи);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратВнепроектныеЗадачиПослеУдаления(Элемент)
	
	ОбновитьДанныеТабличнойЧасти(Элементы.ВнепроектныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратРабочиеЗаданияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ОбновитьДанныеТабличнойЧасти(Элементы.РабочиеЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТрудозатратВнепроектныеЗадачиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ ОтменаРедактирования Тогда
		ОбновитьДанныеТабличнойЧасти(Элементы.ВнепроектныеЗадачи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаИспользоватьРасшифровку(Команда)
	
	Если Объект.ИспользоватьРасшифровкуТрудозатрат И Объект.РасшифровкаТрудозатрат.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("КомандаИспользоватьРасшифровкуЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения,"Текущие данные расшифровки будут очищены!
			|Продолжить?", РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Да);
		
	Иначе
		КомандаИспользоватьРасшифровкуЗавершение(Неопределено,Неопределено);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИспользоватьРасшифровкуЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьРасшифровку = Объект.ИспользоватьРасшифровкуТрудозатрат;
	
	Объект.ИспользоватьРасшифровкуТрудозатрат = НЕ ИспользоватьРасшифровку;
	Модифицированность = Истина;
	
	УстановитьВидимостьРасшифровки();   	
		
	Если НЕ ИспользоватьРасшифровку Тогда  
		Объект.РасшифровкаТрудозатрат.Очистить(); 
		ТаблицаРасшифровкаТрудозатрат.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьРабочиеЗадания(Команда)
	
	ЗаполнитьТаблицуРабочихЗаданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВТЧФормы(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
		  	
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);		
	  
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОперативнойЗагрузке(Команда)
	
	ЗаполнитьТаблицуРабочихЗаданий("ПоОперативнойЗагрузке");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВнепроектныеЗадачи(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВнепроектныеЗадачи.Количество() > 0 Тогда      
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьВнепроектныеЗадачиЗавершение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения,"Табличная часть будет изменена в соответствии со списком задач" + Символы.ПС 
			+ "трудового ресурса на указанный период." + Символы.ПС 
			+ "Возможно, при этом какие-то из уже введенных данных будут потеряны." + Символы.ПС
			+ "Продолжить?", РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Да);
		
	Иначе
			
		ЗаполнитьВнепроектныеЗадачиЗавершение(Неопределено,Неопределено);			
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВнепроектныеЗадачиЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда      
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьВнепроектныеЗадачиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация  = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВозможностьРедактированияЯчеек(ИспользоватьРасшифровку)
	
	ОпределитьВозможностьРедактированияЯчеекВТаблице("РабочиеЗадания", ИспользоватьРасшифровку, Истина);
	
	ОпределитьВозможностьРедактированияЯчеекВТаблице("ВнепроектныеЗадачи", ИспользоватьРасшифровку, Истина); 
	
	ОпределитьВозможностьРедактированияЯчеекВТаблице("ПотериВремени", ИспользоватьРасшифровку, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВозможностьРедактированияЯчеекВСтроке(СтрокаТабличнойЧасти, ИмяТаблицы)
	
	Для Каждого ДеньНедели Из СтруктураДниНедели Цикл
		
		ТаблицаДляПоиска = Объект.РасшифровкаТрудозатрат;
		МассивНайденныхРасшифровок = ПолучитьСтрокиРасшифровкиПоОтбору(ЭтаФорма, ТаблицаДляПоиска, ИмяТаблицы, СтрокаТабличнойЧасти, ДеньНедели.Ключ); 
		СтрокаТабличнойЧасти["ТолькоПросмотр" + ДеньНедели.Ключ] = ?(МассивНайденныхРасшифровок.Количество() > 1, Истина, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодразделение()
	
	ТекущееПодразделение = Объект.Подразделение;
	Объект.Подразделение = Справочники.упоПодразделения.ПустаяСсылка();
	
	// Датой актуальности является конец дня конца недели документа. 
	// Для корректного среза последних добавляем секунду.	
	ДатаАктуальности = КонецДня(Объект.ДеньКонецНедели) + 1;
	 
	ПолученныеЗначения = 
		упоРесурсыИРолиСервер.ПодразделениеИРольТрудовогоРесурсаНаЗаданнуюДату(Объект.ТрудовойРесурс, ДатаАктуальности);
		
	Объект.Подразделение = ПолученныеЗначения.Подразделение;
	РольПоУмолчанию = ПолученныеЗначения.Роль;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличестваЧасов(Элемент, ОсновнаяТаблица, ТаблицаРасшифровки)
	
	ПересчитатьЧасыВРасшифровке(ОсновнаяТаблица, ТаблицаРасшифровки);
	ПересчитатьСтрокуТабличнойЧасти(ОсновнаяТаблица.Имя);
	Если НЕ НеПроверятьКоличествоРабочихЧасов Тогда
		ПроверитьНа24Часа(Элемент, ОсновнаяТаблица);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Список задач

&НаКлиенте
Процедура ЗаполнитьТаблицуРабочихЗаданий(Режим = "")
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Режим",Режим);
	
	Если Объект.РабочиеЗадания.Количество() > 0 Тогда      
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТаблицуРабочихЗаданийЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Табличная часть будет изменена в соответствии со списком задач
				|трудового ресурса на указанный период.
				|Возможно, при этом какие-то из уже введенных данных будут потеряны.
				|Продолжить?'"), РежимДиалогаВопрос.ДаНет, 120, КодВозвратаДиалога.Да);
		
	Иначе
		
		ЗаполнитьТаблицуРабочихЗаданийЗавершение(Неопределено,ДополнительныеПараметры);			
		
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуРабочихЗаданийЗавершение(Ответ,ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда      
			Возврат;
		КонецЕсли; 
	
	Если ДополнительныеПараметры.Режим = "" Тогда		
		ОбновитьСписокЗадач();		
	ИначеЕсли ДополнительныеПараметры.Режим = "ПоОперативнойЗагрузке" Тогда
		ЗаполнитьПоОперативнойЗагрузкеНаСервере();	
	КонецЕсли;	
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗадач(ОчиститьЗадания = Ложь)
	
	Если ОчиститьЗадания Тогда	
		Объект.РабочиеЗадания.Очистить();
		мРабочиеЗадания.Очистить();
	КонецЕсли;
	
	тчРабочиеЗадания = Объект.РабочиеЗадания.Выгрузить();
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("РасшифровкаТрудозатрат", Объект.РасшифровкаТрудозатрат);
	ДанныеДокумента.Вставить("ТрудовойРесурс", Объект.ТрудовойРесурс);
	ДанныеДокумента.Вставить("ДеньНачалаНедели", Объект.ДеньНачалаНедели);
	ДанныеДокумента.Вставить("ДеньКонецНедели", Объект.ДеньКонецНедели);
	
	УстановитьПривилегированныйРежим(Истина);
	
	упоРаспределениеТрудозатратВызовСервера.ЗаполнитьРабочиеЗадания(ЭтаФорма, тчРабочиеЗадания, мРабочиеЗадания, ДанныеДокумента);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Сортируем по рабочим заданиям в рамках одного проекта
		
	Для каждого СтрокаТЧ Из тчРабочиеЗадания Цикл
		
		СтрокиКэша = мРабочиеЗадания.НайтиСтроки(Новый Структура("РабочееЗадание, РольРесурса, Задание",
			СтрокаТЧ.РабочееЗадание, СтрокаТЧ.РольРесурса, СтрокаТЧ.Задание));

		Если НЕ СтрокиКэша.Количество() = 0 Тогда	
			СтрокаКэш = СтрокиКэша[0]; 	
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаКэш);
		КонецЕсли;
	
	КонецЦикла; 
	
	Объект.РабочиеЗадания.Загрузить(тчРабочиеЗадания);
    
	ЗаполнитьДопПараметрыРабочихЗаданий();
	
	Объект.РабочиеЗадания.Сортировать("Проект возр, Наименование возр");
	
	ИспользоватьРасшифровку = Объект.ИспользоватьРасшифровкуТрудозатрат И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах;
	ОпределитьВозможностьРедактированияЯчеек(ИспользоватьРасшифровку);

КонецПроцедуры 

&НаСервере
Функция ЗаполнитьДопПараметрыРабочихЗаданий()
	
	УстановитьПривилегированныйРежим(Истина);
	МассивРабочихЗаданий = Объект.РабочиеЗадания.Выгрузить().ВыгрузитьКолонку("РабочееЗадание");	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК РабочееЗадание,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК Наименование
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивРабочихЗаданий)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО (упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И упоВерсииПроекта.Текущая)";
	Запрос.УстановитьПараметр("МассивРабочихЗаданий", МассивРабочихЗаданий);				   
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Объект.РабочиеЗадания.НайтиСтроки(Новый Структура("РабочееЗадание", Выборка.РабочееЗадание));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Наименование = Выборка.Наименование;
			// Добавление к названию ПЗ наименования поручения
			Если ЗначениеЗаполнено(НайденнаяСтрока.Задание) Тогда
				НайденнаяСтрока.Наименование = НайденнаяСтрока.Наименование + " / " + НайденнаяСтрока.Задание.Наименование;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;     
	
	
	Для Каждого СтрокаРЗ Из Объект.РабочиеЗадания Цикл
		
	// PM 4.2.15 Отключено: не должен документ дозаполняться данными, влияющими на проведение, после записи.	
	//	Если НЕ ЗначениеЗаполнено(СтрокаРЗ.РольРесурса) Тогда
	//		СтрокаРЗ.РольРесурса = РольПоУмолчанию;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(СтрокаРЗ.Подразделение) Тогда
	//		СтрокаРЗ.Подразделение = Объект.Подразделение;
	//	КонецЕсли;
	//	
		СтрокаРЗ.ТипЗадачи = ?(СтрокаРЗ.ЭтоПроектнаяЗадача, 3, 2);
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоОперативнойЗагрузкеНаСервере()
	
	Если Объект.РабочиеЗадания.Количество() > 0 Тогда
		Объект.РабочиеЗадания.Очистить();
	КонецЕсли;		
	
	ОчиститьРасшифровкуРазделаУчета(Перечисления.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача);
		
	ТаблицаРабочиеЗадания = Объект.РабочиеЗадания.Выгрузить(); 	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТрудовойРесурс", Объект.ТрудовойРесурс);
	СтруктураПараметров.Вставить("НачалоПериода", Объект.ДеньНачалаНедели);
	СтруктураПараметров.Вставить("КонецПериода", Объект.ДеньКонецНедели);
	
	УстановитьПривилегированныйРежим(Истина);

	упоРаспределениеТрудозатратВызовСервера.ПолучитьТаблицуРабочихЗаданийЗаНеделюПоОперативнойЗагрузке(ТаблицаРабочиеЗадания, СтруктураПараметров);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	ТаблицаРабочиеЗадания.Сортировать("Проект возр, Наименование возр");
	
	Объект.РабочиеЗадания.Загрузить(ТаблицаРабочиеЗадания);
	
	ИспользоватьРасшифровку = Объект.ИспользоватьРасшифровкуТрудозатрат И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах;
	ОпределитьВозможностьРедактированияЯчеек(ИспользоватьРасшифровку);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРасшифровкуРазделаУчета(РазделУчета)
	
	НайденныеСтроки = Объект.РасшифровкаТрудозатрат.НайтиСтроки(Новый Структура("РазделУчета", РазделУчета));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.РасшифровкаТрудозатрат.Удалить(НайденнаяСтрока);
	КонецЦикла;	 
	
КонецПроцедуры 	

////////////////////////////////////////////////////////////////////////////////
// Даты

&НаСервере
Процедура ИзменитьНачалоНеделиСервер(Направление = Неопределено)
	
	ЗаполнитьПодразделение();
	
	// необходимо проверять список текущих РЗ при изменении даты	
	Если НЕ ЗначениеЗаполнено(Объект.ДеньНачалаНедели) Тогда
		Объект.ДеньНачалаНедели = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Направление = Неопределено Тогда
		НоваяНеделя = НачалоНедели(Объект.ДеньНачалаНедели);
	Иначе
		НоваяНеделя = НачалоНедели(НачалоДня(Объект.ДеньНачалаНедели) + (604800 * Направление));
	КонецЕсли; 
	
	Объект.ДеньНачалаНедели = НоваяНеделя;
	Объект.ДеньКонецНедели = КонецНедели(Объект.ДеньНачалаНедели);
	
	ОчиститьЗадания = Объект.ДеньНачалаНедели <> НачалоНедели(ПредыдущаяДата);
	
	ОбновитьСписокЗадач(ОчиститьЗадания);
	
	ПредыдущаяДата = Объект.ДеньНачалаНедели;

	УстановитьДатыДнямНеделиВШапкиТаблиц(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДатыДнямНеделиВШапкиТаблиц(Объект, ЭтаФорма)
	
	СтруктураИменКолонок = Новый Структура(
		"Понедельник, Вторник, Среда, Четверг, Пятница, Суббота, Воскресенье",
		"Пн", "Вт", "Ср", "Чт", "Пт", "Сб", "Вс");
	
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("РабочиеЗадания");
	МассивТЧ.Добавить("ВнепроектныеЗадачи");
	МассивТЧ.Добавить("ПотериВремени");
	Для Каждого ИмяТЧ Из МассивТЧ Цикл
		УстановитьДатыВидимостьДнямНедели(Объект, ЭтаФорма, Объект.ДеньНачалаНедели, СтруктураИменКолонок, ИмяТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДатыВидимостьДнямНедели(Объект, ЭтаФорма, ДатаНачалаНедели, СтруктураИменКолонок, ИмяТаблицы)
	
	ТекДата = ДатаНачалаНедели;
	
	Шаблон = "%1 %2";
	
	Для Каждого ДеньНедели Из СтруктураИменКолонок Цикл
		
		ИмяКолонки = ИмяТаблицы + ДеньНедели.Ключ;
		ЭтаФорма.Элементы[ИмяКолонки].Заголовок = СтрШаблон(Шаблон, ДеньНедели.Значение, Формат(ТекДата, "ДФ=dd.MM"));
		
		ТекДата = КонецДня(ТекДата) + 1; // Начало следующего дня.
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Итоги

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьИтоги(ЭтаФорма)

	ЭтаФорма.ТаблицаИтого.Очистить();
	
	СтруктураКолонок = Новый Структура("Понедельник, Вторник, Среда, Четверг, Пятница, Суббота, Воскресенье, ИтогоПоСтроке");
	
	СоответствиеТаблиц = Новый Соответствие;
	СоответствиеТаблиц.Вставить(ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача"),
		"ВнепроектныеЗадачи");
	СоответствиеТаблиц.Вставить(ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача"),
		"РабочиеЗадания");
	СоответствиеТаблиц.Вставить(ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени"),
		"ПотериВремени");
	
	Для Каждого КлючЗначениеКолонок Из СтруктураКолонок Цикл
		ЭтаФорма["ТаблицаИтого_"+КлючЗначениеКолонок.Ключ] = 0;		
	КонецЦикла;
	
	Для Каждого КлючЗначениеТаблиц Из СоответствиеТаблиц Цикл
		НоваяСтрока = ЭтаФорма.ТаблицаИтого.Добавить();
		НоваяСтрока.РазделУчета = КлючЗначениеТаблиц.Ключ;
		Для Каждого КлючЗначениеКолонок Из СтруктураКолонок Цикл
			НоваяСтрока[КлючЗначениеКолонок.Ключ] = ЭтаФорма.Объект[КлючЗначениеТаблиц.Значение].Итог(КлючЗначениеКолонок.Ключ);			
			ЭтаФорма["ТаблицаИтого_" + КлючЗначениеКолонок.Ключ] = ЭтаФорма.ЭтаФорма["ТаблицаИтого_" + КлючЗначениеКолонок.Ключ] 
				+ НоваяСтрока[КлючЗначениеКолонок.Ключ]; 
		КонецЦикла; 			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуТабличнойЧасти(ТаблицаДанных)

	ТекДанные = Элементы[ТаблицаДанных].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекДанные.ИтогоПоСтроке = ТекДанные.Понедельник
		+ ТекДанные.Вторник 
		+ ТекДанные.Среда
		+ ТекДанные.Четверг
		+ ТекДанные.Пятница 
		+ ТекДанные.Суббота
		+ ТекДанные.Воскресенье;
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Расшифровка

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаОперации(Элемент, ТаблицаФормы, РазделУчета, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    Отбор = Новый Структура("РазделУчета", РазделУчета);	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	Контекст = Новый Структура;
	Контекст.Вставить("УИстроки",ТаблицаФормы.ТекущиеДанные.ПолучитьИдентификатор());

	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораВидаОперацииОсновная", ЭтотОбъект, Контекст);
	ОткрытьФорму("Справочник.упоВидыОпераций.ФормаВыбора", ПараметрыФормы, Элемент,,,, ОписаниеОповещения); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЧасыВРасшифровке(ОсновнаяТаблица, ТаблицаРасшифровки)
	
	ИмяТабличногоПоля 	=  ОсновнаяТаблица.Имя;
	ТекущаяСтрока 		=  ОсновнаяТаблица.ТекущиеДанные;
	ТекущаяКолонка 		=  ОсновнаяТаблица.ТекущийЭлемент;
	
	ДеньНедели = СтрЗаменить(ТекущаяКолонка.Имя, ИмяТабличногоПоля, "");

	ТаблицаДляПоиска = ТаблицаРасшифровкаТрудозатрат;
	МассивНайденныхРасшифровок = ПолучитьСтрокиРасшифровкиПоОтбору(ЭтаФорма, ТаблицаДляПоиска, ИмяТабличногоПоля, ТекущаяСтрока, ДеньНедели);
	
	Если МассивНайденныхРасшифровок <> Неопределено И МассивНайденныхРасшифровок.Количество() > 0 Тогда
		ТекущаяСтрокаРасшифровка = МассивНайденныхРасшифровок[0];
		ТекущаяСтрокаРасшифровка.ИтогоПоСтроке = ОсновнаяТаблица.ТекущиеДанные[ДеньНедели];
		ОбновитьДанныеТабличнойЧасти(ОсновнаяТаблица);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьДобавленияРасшифровки(ТекущаяКолонка, ИмяТаблицы, Отказ)
	
	ДоступностьРасшифровки = Ложь;
	
	Если Объект.ИспользоватьРасшифровкуТрудозатрат Тогда
	
		ДеньНедели = СтрЗаменить(ТекущаяКолонка.Имя, ИмяТаблицы, "");
		
		СмещениеДаты = Неопределено;		
		Если СтруктураДниНедели.Свойство(ДеньНедели, СмещениеДаты) Тогда 
			
			Если ИмяТаблицы = "РабочиеЗадания" Или ИмяТаблицы = "ВнепроектныеЗадачи" Тогда								
				
				ДоступностьРасшифровки = ПроверитьПопаданиеВСрокЗадачи(Элементы[ИмяТаблицы].ТекущиеДанные, 
																		ДеньНедели, 
																		СмещениеДаты, 
																		Объект.ДеньНачалаНедели);
																		
			Иначе
				ДоступностьРасшифровки = Истина;
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;	
		
	Если Не ДоступностьРасшифровки Тогда
		ТекстСообщения = НСтр("ru = 'Для ввода расшифровки выделите ячейку с трудозатратами.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;	
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокиРасшифровкиПоОтбору(ЭтаФорма, ТаблицаДляПоиска, ИмяТабличногоПоля, ТекущаяСтрока, Знач ДеньНедели,
	ОтборТабличнойЧасти = Неопределено, СтрокаСвойства = "")
	
	ЭтоСтраницаРабочиеЗадания = (ИмяТабличногоПоля = "РабочиеЗадания");
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ЭтаФорма.СтруктураДниНедели.Свойство(ДеньНедели) = Неопределено Тогда
		ДеньНедели = "ДеньНеделиНеУказан";
	КонецЕсли;	
	
	Если ИмяТабличногоПоля = "РабочиеЗадания" Тогда
		
		СтрокаСвойства = "РабочееЗадание,РольРесурса, Подразделение, ДеньНедели, РазделУчета, Задание";
	
		ОтборТабличнойЧасти = Новый Структура(СтрокаСвойства,
												ТекущаяСтрока["РабочееЗадание"],
												ТекущаяСтрока["РольРесурса"],
												ТекущаяСтрока["Подразделение"],												
												ДеньНедели,
												ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача"),
												ТекущаяСтрока["Задание"]);
		
	ИначеЕсли ИмяТабличногоПоля = "ВнепроектныеЗадачи" Тогда
		
		СтрокаСвойства = "Задача,ДеньНедели, РазделУчета"; 
		
		ОтборТабличнойЧасти = Новый Структура(СтрокаСвойства,
												ТекущаяСтрока["Задача"],
												ДеньНедели,
												ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача"));
		
	ИначеЕсли ИмяТабличногоПоля = "ПотериВремени" Тогда
		
		СтрокаСвойства = "Причина,ДеньНедели,РазделУчета";
		ОтборТабличнойЧасти = Новый Структура(СтрокаСвойства,
												ТекущаяСтрока["Причина"],
												ДеньНедели,
												ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени"));		
	КонецЕсли;
	
	МассивНайденныхРасшифровок = ТаблицаДляПоиска.НайтиСтроки(ОтборТабличнойЧасти);
	
	Возврат МассивНайденныхРасшифровок;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеТабличнойЧасти(Таблица)
	
	ИмяТаблицы 	=  Таблица.Имя;

	ТекущаяСтрока 		=  Таблица.ТекущиеДанные;
	ТекущаяКолонка 		=  Таблица.ТекущийЭлемент;
	ИмяКолонки = СтрЗаменить(ТекущаяКолонка.Имя, ИмяТаблицы, "");
	
	Отбор = Новый Структура;
	СтрокаСвойстваДляЗаполнения = "";
	
	ТаблицаДляПоиска = Объект.РасшифровкаТрудозатрат;
	МассивНайденныхРасшифровок = ПолучитьСтрокиРасшифровкиПоОтбору(ЭтаФорма, ТаблицаДляПоиска, ИмяТаблицы, ТекущаяСтрока, ИмяКолонки,
		Отбор, СтрокаСвойстваДляЗаполнения);
	
	Если МассивНайденныхРасшифровок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Строка Из МассивНайденныхРасшифровок Цикл
		Объект.РасшифровкаТрудозатрат.Удалить(Строка);
	КонецЦикла;	
	
	КоличествоЧасов = 0;
	
	Для Каждого Строка Из ТаблицаРасшифровкаТрудозатрат Цикл  		
		
		НоваяСтрока = Объект.РасшифровкаТрудозатрат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор, СтрокаСвойстваДляЗаполнения);
		
		КоличествоЧасов = КоличествоЧасов + Строка.ИтогоПоСтроке;
		
		ЗаполнитьЗначенияСвойств(Строка, НоваяСтрока);
		
	КонецЦикла;
	
	СделатьЯчейкуНедоступной = ?(ТаблицаРасшифровкаТрудозатрат.Количество() > 1, Истина, Ложь); 
	ТекущаяСтрока["ТолькоПросмотр" + ИмяКолонки] = СделатьЯчейкуНедоступной;
	
	ТекущаяСтрока[ИмяКолонки] = КоличествоЧасов; 
	ПересчитатьСтрокуТабличнойЧасти(ИмяТаблицы);
	
	Если НЕ НеПроверятьКоличествоРабочихЧасов Тогда
		ПроверитьНа24Часа(ТекущаяКолонка, Таблица);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборРасшифровки(ТаблицаФормы)
	
	ТаблицаРасшифровкаТрудозатрат.Очистить(); 
	
	ИмяТабличногоПоля 	=  ТаблицаФормы.Имя;
	ТекущаяСтрока 		=  ТаблицаФормы.ТекущиеДанные;
	ТекущаяКолонка 		=  ТаблицаФормы.ТекущийЭлемент;
	
	Если ТекущаяКолонка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДеньНедели = СтрЗаменить(ТекущаяКолонка.Имя, ИмяТабличногоПоля, "");
	Если НЕ СтруктураДниНедели.Свойство(ДеньНедели) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДляПоиска = Объект.РасшифровкаТрудозатрат;
	МассивНайденныхРасшифровок = ПолучитьСтрокиРасшифровкиПоОтбору(ЭтаФорма, ТаблицаДляПоиска, ИмяТабличногоПоля, ТекущаяСтрока, ДеньНедели);
	
	Если МассивНайденныхРасшифровок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Строка Из МассивНайденныхРасшифровок Цикл
		НоваяСтрока = ТаблицаРасшифровкаТрудозатрат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРасшифровкиСтрокиТЧ(ИмяТабличногоПоля, ТекущаяСтрока)
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяТабличногоПоля = "РабочиеЗадания" Тогда
		
		ОтборТабличнойЧасти = Новый Структура("РабочееЗадание, РольРесурса, Подразделение, ДеньНедели, РазделУчета, Задание",
			ТекущаяСтрока["РабочееЗадание"], ТекущаяСтрока["РольРесурса"], ТекущаяСтрока["Подразделение"], ,
			ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача"), ТекущаяСтрока["Задание"]);
	
	ИначеЕсли ИмяТабличногоПоля = "ВнепроектныеЗадачи" Тогда
		
		ОтборТабличнойЧасти = Новый Структура("Задача,ДеньНедели,РазделУчета",
			ТекущаяСтрока["Задача"], , ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача"));
	ИначеЕсли ИмяТабличногоПоля = "ПотериВремени" Тогда
		
		ОтборТабличнойЧасти = Новый Структура("Причина,ДеньНедели,РазделУчета",
			ТекущаяСтрока["Причина"], , ПредопределенноеЗначение("Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени"));
	КонецЕсли;
	
	Для Каждого мЭлементДеньНедели Из СтруктураДниНедели Цикл
		
		ОтборТабличнойЧасти.Вставить("ДеньНедели", мЭлементДеньНедели.Ключ);
		
		МассивНайденныхРасшифровок = Объект.РасшифровкаТрудозатрат.НайтиСтроки(ОтборТабличнойЧасти);
		
		// Нужно удалить расшифровку по этому дню
		Для каждого ЭлементНайденнаяРасшифровка Из МассивНайденныхРасшифровок Цикл
			Объект.РасшифровкаТрудозатрат.Удалить(ЭлементНайденнаяРасшифровка);
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНа24Часа(Элемент, Таблица)
	
	ИмяЭлемента = Элемент.Имя;

	ДеньНедели = СтрЗаменить(Элемент.Имя, Таблица.Имя, "");
	КоличествоЧасовДень = Объект.РабочиеЗадания.Итог(ДеньНедели) + Объект.ВнепроектныеЗадачи.Итог(ДеньНедели) 
		+ Объект.ПотериВремени.Итог(ДеньНедели);
	
	Если КоличествоЧасовДень > 24 Тогда
		ТекстСообщения = СтрЗаменить(НСтр("ru = 'За день недели ""%1"" введено больше 24 часов.'"), "%1", ДеньНедели);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ЧасовВсего = Объект.РабочиеЗадания.Итог("ИтогоПоСтроке") + Объект.ВнепроектныеЗадачи.Итог("ИтогоПоСтроке") 
		+ Объект.ПотериВремени.Итог("ИтогоПоСтроке");
	Если ЧасовВсего > 168 Тогда
		ТекстСообщения = НСтр("ru = 'За неделю введено больше 168 часов.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРасшифровки()
	
	ИспользоватьРасшифровку = Объект.ИспользоватьРасшифровкуТрудозатрат 
		И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах;
	
	Если константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах Тогда
		Элементы.КомандаИспользоватьРасшифровку.Пометка = ИспользоватьРасшифровку;
	Иначе
		Элементы.КомандаИспользоватьРасшифровку.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.РасшифровкаТрудозатратРабочиеЗадания.Видимость = ИспользоватьРасшифровку;
	Элементы.РасшифровкаТрудозатратВнепроектныеЗадачи.Видимость = ИспользоватьРасшифровку;
    Элементы.РасшифровкаТрудозатратПотериВремени.Видимость = ИспользоватьРасшифровку;
	Элементы.РабочиеЗаданияДобавить.Видимость = ИспользоватьРасшифровку;
	Элементы.РабочиеЗаданияУдалить.Видимость = ИспользоватьРасшифровку;
	Элементы.ВнепроектныеЗадачиДобавить.Видимость = ИспользоватьРасшифровку;
	Элементы.ВнепроектныеЗадачиУдалить.Видимость = ИспользоватьРасшифровку;
	Элементы.ПотериВремениДобавить.Видимость = ИспользоватьРасшифровку;
	Элементы.ПотериВремениУдалить.Видимость = ИспользоватьРасшифровку;
	
	ОпределитьВозможностьРедактированияЯчеек(ИспользоватьРасшифровку);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперацииПоЗадаче(Задача)
	
	Если Задача = Неопределено Тогда
		Возврат Справочники.упоВидыЗаданий.ПустаяСсылка();	
	КонецЕсли; 
		
	ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "ВидОперации");
	
	Возврат ВидОперации;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Трудовые ресурсы

&НаСервере
Процедура ИнициализацияВыбораТрудовогоРесурса()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РегТР.Ресурс
	               |ИЗ
	               |	РегистрСведений.упоВладениеРесурсами.СрезПоследних(
	               |			,
	               |			Сотрудник В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					РегДС.Сотрудник КАК Сотрудник
	               |				ИЗ
	               |					РегистрСведений.упоДиспетчерыСистемы.СрезПоследних(, Пользователь = &ТекПользователь) КАК РегДС
	               |				ГДЕ
	               |					РегДС.ФлагУправления = ИСТИНА)) КАК РегТР
	               |ГДЕ
	               |	РегТР.ВладеетРесурсом = ИСТИНА";
	
	РезультатЗапроса = упоСервисныеФункцииВызовСервера.обВыполнитьЗапрос(ТекстЗапроса, Новый Структура("ТекПользователь", Пользователи.ТекущийПользователь()));
	СписокТР = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ресурс");
	
	СписокТрудовыхРесурсовПользователя.ЗагрузитьЗначения(СписокТР);
	СписокТрудовыхРесурсовПользователя.СортироватьПоЗначению();

КонецПроцедуры

&НаСервере
Функция ТрудовойРесурсПриИзмененииСервер() 
	
	ПроверитьСоответствиеТрудовогоРесурсаПриИзменении();

	ЗаполнитьПодразделение();

	Если ЗначениеЗаполнено(Объект.ТрудовойРесурс) Тогда
		ОбновитьСписокЗадач();
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ПроверитьСоответствиеТрудовогоРесурсаПриИзменении()

	Если Не ЗначениеЗаполнено(Объект.ТрудовойРесурс) Тогда
		Объект.РабочиеЗадания.Очистить();
		Возврат;
	КонецЕсли; 
	
	Если Не упоРесурсыИРолиСервер.РесурсУправляетсяТекущимПользователем(Объект.ТрудовойРесурс) Тогда
		ТекстСообщения = НСтр("ru = 'Текущий пользователь не является владельцем выбранного трудового ресурса ""%1"".'");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Объект.ТрудовойРесурс), , "Объект.ТрудовойРесурс");
		
		Объект.ТрудовойРесурс = Справочники.упоТрудовыеРесурсы.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(имяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	 		
	АдресХранилища = "";
	
	Если имяКоманды = "ВнепроектныеЗадачиПодобрать" Тогда
		
		ПараметрыПодбора.ЭлементВладелец = Элементы.ВнепроектныеЗадачи;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.упоВнепроектныеЗадачи";
        ТаблицаФормы = Объект.ВнепроектныеЗадачи;
	    ИмяКолонки = "Задача";				
		
	ИначеЕсли имяКоманды = "ПотериВремениПодобрать" Тогда
			
		ПараметрыПодбора.ЭлементВладелец = Элементы.ПотериВремени;
		ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.упоПричиныПотерьРабочегоВремени";
        ТаблицаФормы = Объект.ПотериВремени;
	    ИмяКолонки = "Причина";		
		
	КонецЕсли;
	
	АдресХранилища = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки);
		
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = АдресХранилища;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьВнепроектныеЗадачиНаСервере()
	
	ТаблицаВнепроектныеЗадачи = упоРаспределениеТрудозатратВызовСервера.ЗаполнитьВнепроектныеЗадачи(Объект.ТрудовойРесурс,
		НачалоДня(Объект.ДеньНачалаНедели), 
		КонецДня(Объект.ДеньКонецНедели));
		
	Объект.ВнепроектныеЗадачи.Очистить();	
	Для каждого СтрокаТаблицы Из ТаблицаВнепроектныеЗадачи Цикл
	  СтрокаВнепроектныеЗадачи = Объект.ВнепроектныеЗадачи.Добавить(); 
      ЗаполнитьЗначенияСвойств(СтрокаВнепроектныеЗадачи,СтрокаТаблицы);
	  СтрокаВнепроектныеЗадачи.ДатаНачала = СтрокаТаблицы.ДатаНачалаПлан;
	  СтрокаВнепроектныеЗадачи.ДатаОкончания = СтрокаТаблицы.ДатаОкончанияПлан;
	КонецЦикла;	

	ОчиститьРасшифровкуРазделаУчета(Перечисления.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача);
		
	ИспользоватьРасшифровку = Объект.ИспользоватьРасшифровкуТрудозатрат 
		И константа_ИспользоватьРасшифровкуТрудозатратНаПроектныхЗадачах;
	
	ОпределитьВозможностьРедактированияЯчеекВТаблице("ВнепроектныеЗадачи", ИспользоватьРасшифровку, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатыНачалаОкончанияВСтроке(ТаблицаСроковЗадач, Строка, Задача)
	
	НайденнаяСтрока = ТаблицаСроковЗадач.Найти(Задача, "Задача");
	Если НайденнаяСтрока <> Неопределено Тогда
		Строка.ДатаНачала = НайденнаяСтрока.ДатаНачала;
		Строка.ДатаОкончания = НайденнаяСтрока.ДатаЗавершения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокиВнепроектногоЗаданияВСтроке(Строка, Задание)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСрокиЗаданий.ДатаНачалаПлан,
	               |	упоСрокиЗаданий.ДатаОкончанияПлан
	               |ИЗ
	               |	РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	               |ГДЕ
	               |	упоСрокиЗаданий.Задание = &Задание";
				   
	Запрос.УстановитьПараметр("Задание", Задание);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 		
		Строка.ДатаНачала = Выборка.ДатаНачалаПлан;
		Строка.ДатаОкончания = Выборка.ДатаОкончанияПлан; 		
	Иначе
		Строка.ДатаНачала = Дата(1, 1, 1);
		Строка.ДатаОкончания = Дата(1, 1, 1);
	КонецЕсли;
	
	ОпределитьВозможностьРедактированияЧасовНаДату(Строка);    	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокиЗадач()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Сроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	Сроки.ПроектнаяЗадача.Проект КАК Проект,
	               |	ЕСТЬNULL(Сроки.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	               |	ЕСТЬNULL(Сроки.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗавершения
	               |ПОМЕСТИТЬ втСрокиПроектнойЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивПроектныхЗадач)) КАК Сроки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
	               |		ПО Сроки.Версия = Версии.Версия
	               |			И (Версии.Текущая)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР
	               |		КОГДА упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	               |			ТОГДА упоСтатусыПроектовСрезПоследних.Период
	               |		ИНАЧЕ NULL
	               |	КОНЕЦ КАК ДатаОстановки,
	               |	упоСтатусыПроектовСрезПоследних.Проект КАК Проект
	               |ПОМЕСТИТЬ ВТ_ДатыОстановкиПроектов
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(
	               |			&КонецНедели,
	               |			Проект В
	               |				(ВЫБРАТЬ
	               |					втСрокиПроектнойЗадачи.Проект КАК Проект
	               |				ИЗ
	               |					втСрокиПроектнойЗадачи КАК втСрокиПроектнойЗадачи)) КАК упоСтатусыПроектовСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоНастройкаАналитикиВРазрезеПодразделений КАК НастройкаАналитикиВРазрезеПодразделений
	               |		ПО упоСтатусыПроектовСрезПоследних.Проект = НастройкаАналитикиВРазрезеПодразделений.Объект
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК РуководителиПроектов
	               |		ПО упоСтатусыПроектовСрезПоследних.Проект = РуководителиПроектов.Проект
	               |ГДЕ
	               |	НЕ(НастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусеОстановлен
	               |				И упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	               |				И НЕ(НастройкаАналитикиВРазрезеПодразделений.РазрешитьСписаниеЧасовНаПроектныеЗадачиПроектаВСтатусахЗапланированУтвержден
	               |						И упоСтатусыПроектовСрезПоследних.СтатусПроекта В (ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Запланирован), ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Утвержден)))
	               |				И РуководителиПроектов.РуководительПроекта = &СотрудникТрудовогоРесурса)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА упоСтатусыПроектовСрезПоследних.СтатусПроекта = ЗНАЧЕНИЕ(Перечисление.упоСостояниеСтатусаПроекта.Остановлен)
	               |			ТОГДА упоСтатусыПроектовСрезПоследних.Период
	               |		ИНАЧЕ NULL
	               |	КОНЕЦ,
	               |	упоСтатусыПроектовСрезПоследних.Проект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоЗадания.Ссылка КАК Задача,
	               |	ЕСТЬNULL(упоСрокиЗаданий.ДатаНачалаПлан, втСрокиПроектнойЗадачи.ДатаНачала) КАК ДатаНачала,
	               |	ВЫБОР
	               |		КОГДА НЕ ВТ_ДатыОстановкиПроектов.ДатаОстановки ЕСТЬ NULL
	               |			ТОГДА ВТ_ДатыОстановкиПроектов.ДатаОстановки
	               |		ИНАЧЕ ЕСТЬNULL(упоСрокиЗаданий.ДатаОкончанияПлан, втСрокиПроектнойЗадачи.ДатаЗавершения)
	               |	КОНЕЦ КАК ДатаЗавершения
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиЗаданий КАК упоСрокиЗаданий
	               |		ПО (упоСрокиЗаданий.Задание = упоЗадания.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСрокиПроектнойЗадачи КАК втСрокиПроектнойЗадачи
	               |		ПО (втСрокиПроектнойЗадачи.ПроектнаяЗадача = упоЗадания.ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыОстановкиПроектов КАК ВТ_ДатыОстановкиПроектов
	               |		ПО упоЗадания.Проект = ВТ_ДатыОстановкиПроектов.Проект
	               |ГДЕ
	               |	упоЗадания.Ссылка В(&МассивЗадач)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Сроки.ПроектнаяЗадача,
	               |	ЕСТЬNULL(Сроки.ДатаНачалаПлан, ДАТАВРЕМЯ(1, 1, 1)),
	               |	ВЫБОР
	               |		КОГДА НЕ ВТ_ДатыОстановкиПроектов.ДатаОстановки ЕСТЬ NULL
	               |			ТОГДА ВТ_ДатыОстановкиПроектов.ДатаОстановки
	               |		ИНАЧЕ ЕСТЬNULL(Сроки.ДатаЗавершенияПлан, ДАТАВРЕМЯ(1, 1, 1))
	               |	КОНЕЦ
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&МассивЗадач)) КАК Сроки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
	               |		ПО Сроки.Версия = Версии.Версия
	               |			И (Версии.Текущая)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыОстановкиПроектов КАК ВТ_ДатыОстановкиПроектов
	               |		ПО Сроки.ПроектнаяЗадача.Проект = ВТ_ДатыОстановкиПроектов.Проект";
				   
	МассивЗадач = Новый Массив();
	МассивПроектныхЗадач = Новый Массив();
	Для Каждого СтрокаЗадача Из Объект.РабочиеЗадания Цикл
		МассивЗадач.Добавить(?(ЗначениеЗаполнено(СтрокаЗадача.Задание), СтрокаЗадача.Задание, СтрокаЗадача.РабочееЗадание));
		МассивПроектныхЗадач.Добавить(СтрокаЗадача.РабочееЗадание);
	КонецЦикла;
	Для Каждого СтрокаЗадача Из Объект.ВнепроектныеЗадачи Цикл
		МассивЗадач.Добавить(СтрокаЗадача.Задача);
	КонецЦикла;
				   
	Запрос.УстановитьПараметр("МассивЗадач", МассивЗадач);	
	Запрос.УстановитьПараметр("МассивПроектныхЗадач", МассивПроектныхЗадач);
	Запрос.УстановитьПараметр("КонецНедели", Объект.ДеньКонецНедели);
	
	СотрудникТР = упоРесурсыИРолиВызовСервера.обПолучитьТекущегоВладельцаРесурса(Объект.ТрудовойРесурс);
	Запрос.УстановитьПараметр("СотрудникТрудовогоРесурса", СотрудникТР);
	
	ТаблицаСроковЗадач = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаЗадача Из Объект.РабочиеЗадания Цикл
		Задача = ?(ЗначениеЗаполнено(СтрокаЗадача.Задание), СтрокаЗадача.Задание, СтрокаЗадача.РабочееЗадание);
		ЗаполнитьДатыНачалаОкончанияВСтроке(ТаблицаСроковЗадач, СтрокаЗадача, Задача);
	КонецЦикла;
	
	Для Каждого СтрокаЗадача Из Объект.ВнепроектныеЗадачи Цикл
		Задача = СтрокаЗадача.Задача;
		ЗаполнитьДатыНачалаОкончанияВСтроке(ТаблицаСроковЗадач, СтрокаЗадача, Задача);
	КонецЦикла;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНадписьДатыВвода(ИмяЭлементаНадпись, ИмяТаблицы)
	
	текДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;    	
		
	лДатаНачала = текДанные.ДатаНачала;
	лДатаЗавершения = текДанные.ДатаОкончания;
	
	ИнфоСрокиЗадачи = "Сроки: [" + Формат(лДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(лДатаЗавершения, "ДФ=dd.MM.yyyy") + "]";  	

	ЭтаФорма[ИмяЭлементаНадпись] = ИнфоСрокиЗадачи;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВозможностьРедактированияЧасовНаДату(СтрокаТабличнойЧасти)
	
	Для Каждого ДанныеДняНедели Из СтруктураДниНедели Цикл
		ПроверитьПопаданиеВСрокЗадачи(СтрокаТабличнойЧасти, ДанныеДняНедели.Ключ, ДанныеДняНедели.Значение, Объект.ДеньНачалаНедели, Истина);	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ОпределитьВозможностьРедактированияЯчеекВТаблице(ИмяТаблицы, ИспользоватьРасшифровку, ПоСрокам = Ложь)
	
	Для Каждого СтрокаТаблицы Из Объект[ИмяТаблицы] Цикл	
		Если ИспользоватьРасшифровку Тогда 
			ОпределитьВозможностьРедактированияЯчеекВСтроке(СтрокаТаблицы, ИмяТаблицы);
		Иначе
			СтрокаТаблицы.ТолькоПросмотрПонедельник = Ложь;
			СтрокаТаблицы.ТолькоПросмотрВторник = Ложь;
			СтрокаТаблицы.ТолькоПросмотрСреда = Ложь;
			СтрокаТаблицы.ТолькоПросмотрЧетверг = Ложь;
			СтрокаТаблицы.ТолькоПросмотрПятница = Ложь;
			СтрокаТаблицы.ТолькоПросмотрСуббота = Ложь;
			СтрокаТаблицы.ТолькоПросмотрВоскресенье = Ложь;
		КонецЕсли;
		Если ПоСрокам Тогда
			ОпределитьВозможностьРедактированияЧасовНаДату(СтрокаТаблицы);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьПопаданиеВСрокЗадачи(СтрокаТабличнойЧасти, ИмяКолонки, СмещениеДаты, ДеньНачалаНедели, УстановитьТолькоПросмотр = Ложь)
	
	РедактированиеРазрешено = Истина;
	Дата = ДеньНачалаНедели + СмещениеДаты * 24 * 60 * 60;
	
	Если Дата < СтрокаТабличнойЧасти.ДатаНачала ИЛИ (Дата > СтрокаТабличнойЧасти.ДатаОкончания И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаОкончания)) Тогда
		РедактированиеРазрешено = Ложь;
		Если УстановитьТолькоПросмотр Тогда
			СтрокаТабличнойЧасти["ТолькоПросмотр" + ИмяКолонки] = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат РедактированиеРазрешено;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаОперацииОсновная(ВидОперации,ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ТаблицаРасшифровкаТрудозатрат.НайтиПоИдентификатору(ДополнительныеПараметры.УИстроки);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ВидОперации = ВидОперации;
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьШаблонТекстаСообщенияДляПроверкиРасшифровки(ИмяТабличнойЧасти)
	
	Если ИмяТабличнойЧасти = "РабочиеЗадания" Тогда
		ШаблонТекстаСообщения =
			НСтр("ru = 'На вкладке ""%1"" для рабочего задания ""%2"", роли трудового ресурса ""%3"" и подразделения ""%4""
			|не заполнен вид операции в расшифровке для дня ""%5""'");	 
	ИначеЕсли ИмяТабличнойЧасти = "ВнепроектныеЗадачи" Тогда
		ШаблонТекстаСообщения =
			НСтр("ru = 'На вкладке ""%1"" для задачи ""%2"" не заполнен вид операции в расшифровке для дня ""%3""'");	
	ИначеЕсли ИмяТабличнойЧасти = "ПотериВремени" Тогда
		ШаблонТекстаСообщения =
			НСтр("ru = 'На вкладке ""%1"" для причины ""%2"" не заполнен вид операции в расшифровке для дня ""%3""'");
	Иначе
		ШаблонТекстаСообщения = "";	
	КонецЕсли;
	
	Возврат ШаблонТекстаСообщения;
	
КонецФункции

&НаКлиенте
Процедура СообщитьПользователюОНезаполненостиВидаОперации(ИмяТабличнойЧасти, ШаблонТекстаСообщения, СтрокаРасшифровки, НазванияПЗРабочиеЗадания)
	
	Если ИмяТабличнойЧасти = "РабочиеЗадания" Тогда
		
		ЗаголовокПроверяемойСтраницы = Элементы.СтраницаРабочиеЗадания.Заголовок;			
		НаименованиеРабЗадания = НазванияПЗРабочиеЗадания[СтрокаРасшифровки.РабочееЗадание];			
		ТекстНеЗаполенныхДней = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаСообщения,
			ЗаголовокПроверяемойСтраницы, НаименованиеРабЗадания, СтрокаРасшифровки.РольРесурса,
			СтрокаРасшифровки.Подразделение, СтрокаРасшифровки.ДеньНедели);				
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстНеЗаполенныхДней);
		
	ИначеЕсли ИмяТабличнойЧасти = "ВнепроектныеЗадачи" Тогда
		
		ЗаголовокПроверяемойСтраницы = Элементы.СтраницаВнепроектныеЗадачи.Заголовок;						
		ТекстНеЗаполенныхДней = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаСообщения,
			ЗаголовокПроверяемойСтраницы, СтрокаРасшифровки.Задача, СтрокаРасшифровки.ДеньНедели);				
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстНеЗаполенныхДней);
		
	ИначеЕсли ИмяТабличнойЧасти = "ПотериВремени" Тогда
		
		ЗаголовокПроверяемойСтраницы = Элементы.СтраницаПотериВремени.Заголовок;						
		ТекстНеЗаполенныхДней = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаСообщения,
			ЗаголовокПроверяемойСтраницы, СтрокаРасшифровки.Причина, СтрокаРасшифровки.ДеньНедели);				
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстНеЗаполенныхДней);
		
	Иначе	
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполненияВидОперацииРасшифровкиДляТабЧасти(НайденныеСтроки, Отказ, ИмяТабличнойЧасти)
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;	
	
	Отказ = Истина;	
	ШаблонТекстаСообщения = ПолучитьШаблонТекстаСообщенияДляПроверкиРасшифровки(ИмяТабличнойЧасти);
	
	НазванияПЗРабочиеЗадания = Новый Соответствие;
	НужноПолучатьНаименованиеЗадачи = ИмяТабличнойЧасти = "РабочиеЗадания";
	Если НужноПолучатьНаименованиеЗадачи Тогда
		Для Каждого Строка Из Объект.РабочиеЗадания Цикл
			НазванияПЗРабочиеЗадания.Вставить(Строка.РабочееЗадание, Строка.Наименование);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровки Из НайденныеСтроки Цикл			
		СообщитьПользователюОНезаполненостиВидаОперации(ИмяТабличнойЧасти, ШаблонТекстаСообщения, СтрокаРасшифровки, НазванияПЗРабочиеЗадания);			
	КонецЦикла;
					
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияРасшифровки(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаТрудозатрат = Объект.РасшифровкаТрудозатрат;
	
	ИмяТабличнойЧасти = "РабочиеЗадания";
	
	РазделУчетаПроектнаяЗадача = 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача");
	ПустаяСсылкаупоВидыОпераций = 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.упоВидыОпераций.ПустаяСсылка");
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("РазделУчета", РазделУчетаПроектнаяЗадача);
	ОтборСтрок.Вставить("ВидОперации", ПустаяСсылкаупоВидыОпераций);
	НайденныеСтроки = РасшифровкаТрудозатрат.НайтиСтроки(ОтборСтрок);
	
	ПроверитьЗаполненияВидОперацииРасшифровкиДляТабЧасти(НайденныеСтроки, Отказ, ИмяТабличнойЧасти);	
	
	ИмяТабличнойЧасти = "ВнепроектныеЗадачи";
	РазделУчетаВнепроектнаяЗадача = 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача");
	ОтборСтрок.РазделУчета = РазделУчетаВнепроектнаяЗадача;
	НайденныеСтроки = РасшифровкаТрудозатрат.НайтиСтроки(ОтборСтрок);
	
	ПроверитьЗаполненияВидОперацииРасшифровкиДляТабЧасти(НайденныеСтроки, Отказ, ИмяТабличнойЧасти);
	
	ИмяТабличнойЧасти = "ПотериВремени";
	РазделУчетаПотеряРабочегоВремени = 
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени");
	ОтборСтрок.РазделУчета = РазделУчетаПотеряРабочегоВремени;
	НайденныеСтроки = РасшифровкаТрудозатрат.НайтиСтроки(ОтборСтрок);
	
	ПроверитьЗаполненияВидОперацииРасшифровкиДляТабЧасти(НайденныеСтроки, Отказ, ИмяТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтрокиРасшифровкиСвязанныеСТабЧастью(ИмяТЧ, СтрокиРасшифровкиСвязанныеСТабЧастями)
	
	ПараметрыОтбора = ПараметрыДляПоискаСвязанныхСтрок(ИмяТЧ);
	СтрокаСвойств = ПараметрыОтбора.СтрокаСвойств;
	РазделУчета = ПараметрыОтбора.РазделУчета;
	
	Отбор = Новый Структура(СтрокаСвойств);
	Отбор.РазделУчета = РазделУчета;
	Для Каждого Строка Из Объект[ИмяТЧ] Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, Строка);		
		НайденныеСтроки = Объект.РасшифровкаТрудозатрат.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СтрокиРасшифровкиСвязанныеСТабЧастями.Вставить(НайденнаяСтрока, Истина);
		КонецЦикла;		
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДляПоискаСвязанныхСтрок(ИмяТЧ)
	
	ПараметрыОтбора = Новый Структура("СтрокаСвойств, РазделУчета");
	Если ИмяТЧ = "РабочиеЗадания" Тогда
		ПараметрыОтбора.СтрокаСвойств = "РабочееЗадание,РольРесурса, Подразделение, РазделУчета, Задание";
		ПараметрыОтбора.РазделУчета = 
			ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоРазделУчетаРабочегоВремени.ПроектнаяЗадача");
	ИначеЕсли ИмяТЧ = "ВнепроектныеЗадачи" Тогда
		ПараметрыОтбора.СтрокаСвойств = "Задача, РазделУчета";
		ПараметрыОтбора.РазделУчета = 
			ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоРазделУчетаРабочегоВремени.ВнепроектнаяЗадача");
	ИначеЕсли ИмяТЧ = "ПотериВремени" Тогда		
		ПараметрыОтбора.СтрокаСвойств = "Причина, РазделУчета";
		ПараметрыОтбора.РазделУчета = 
			ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.упоРазделУчетаРабочегоВремени.ПотеряРабочегоВремени");			
	Иначе
		ПараметрыОтбора.СтрокаСвойств = "";		
	КонецЕсли;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокиРасшифровкиНеСвязанныеСТабЧастями()
	
	СтрокиРасшифровкиСвязанныеСТабЧастями = Новый Соответствие;
	
	ПолучитьСтрокиРасшифровкиСвязанныеСТабЧастью("РабочиеЗадания", СтрокиРасшифровкиСвязанныеСТабЧастями);	
	ПолучитьСтрокиРасшифровкиСвязанныеСТабЧастью("ВнепроектныеЗадачи", СтрокиРасшифровкиСвязанныеСТабЧастями);	
	ПолучитьСтрокиРасшифровкиСвязанныеСТабЧастью("ПотериВремени", СтрокиРасшифровкиСвязанныеСТабЧастями);
	
	СтрокиНеСвязанныеСТабЧастями = Новый Массив;
	Для Каждого Строка Из Объект.РасшифровкаТрудозатрат Цикл
		Если СтрокиРасшифровкиСвязанныеСТабЧастями[Строка] = Неопределено Тогда
			СтрокиНеСвязанныеСТабЧастями.Добавить(Строка);	
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из СтрокиНеСвязанныеСТабЧастями Цикл
		Объект.РасшифровкаТрудозатрат.Удалить(Строка);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораПодразделенияРоли(Роль, Элемент)
	
	НовыйМассив = Новый Массив;
	НовыйМассив.Добавить(Новый ПараметрВыбора("РесурсПодразделения", Роль));
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьВидОперацииРасшифровки(ТекущиеДанныеРасшифровка, Таблица)
    
    Если Не упоИнтеграцияEPMСервер.ИспользоватьПодсистемуРаспределениеЗарплаты() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы 	=  Таблица.Имя;
	
	ТекущаяСтрока =  Таблица.ТекущиеДанные;
	СтруктураСтроки = Новый Структура("Задача, ПроектнаяЗадача, ВидОперации");
	
	Если ИмяТаблицы = "РабочиеЗадания" Тогда
		СтруктураСтроки.Задача = ТекущаяСтрока.РабочееЗадание;
		СтруктураСтроки.ПроектнаяЗадача = ТекущаяСтрока.РабочееЗадание;
	ИначеЕсли ИмяТаблицы = "ВнепроектныеЗадачи" Тогда
		СтруктураСтроки.Задача = ТекущаяСтрока.Задача;
	ИначеЕсли ИмяТаблицы = "ПотериВремени" Тогда
		СтруктураСтроки.Задача = ТекущаяСтрока.Причина;
	КонецЕсли;
	
	ЗаполнитьВидОперацииРасшифровкиНаСервере(ТекущиеДанныеРасшифровка.ПолучитьИдентификатор(), СтруктураСтроки);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидОперацииРасшифровкиНаСервере(ИДСтроки, СтрокаВладелец)

    МодульРаспределениеЗарплатыСервер = ОбщегоНазначения.ОбщийМодуль("упоРаспределениеЗарплатыСервер");
	МодульРаспределениеЗарплатыСервер.ЗаполнитьВидОперацииСтрокиТабеля(СтрокаВладелец);
	
	СтрокаРасшифровки = ТаблицаРасшифровкаТрудозатрат.НайтиПоИдентификатору(ИДСтроки);
	Если СтрокаРасшифровки <> Неопределено Тогда
		СтрокаРасшифровки.ВидОперации = СтрокаВладелец.ВидОперации; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Соответствие хранит день недели и смещение даты этого дня
// относительно даты "ДеньНачалаНедели".
СтруктураДниНедели = Новый Структура;
СтруктураДниНедели.Вставить("Понедельник", 	0);
СтруктураДниНедели.Вставить("Вторник", 		1);
СтруктураДниНедели.Вставить("Среда", 		2);
СтруктураДниНедели.Вставить("Четверг", 		3);
СтруктураДниНедели.Вставить("Пятница", 		4);
СтруктураДниНедели.Вставить("Суббота", 		5);
СтруктураДниНедели.Вставить("Воскресенье", 	6);
