
&НаСервере
Процедура Расш1_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Булево"));
	ОписаниеТиповБулево = Новый ОписаниеТипов(МассивТипов);
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("ПерейтиНаФайлы", ОписаниеТиповБулево);
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	Если Параметры.Свойство("ПерейтиНаФайлы") Тогда
		ЭтаФорма.ПерейтиНаФайлы = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереходНаФайлы() Экспорт
	ПараметрКоманды = Объект.Ссылка;
	
	ПараметрыВыполненияКоманды = Новый Структура();
		ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
		ПараметрыВыполненияКоманды.Вставить("НавигационнаяСсылка", "e1cib/command/ОбщаяКоманда.ПрисоединенныеФайлы");
		ПараметрыВыполненияКоманды.Вставить("Параметры", Неопределено);
		ПараметрыВыполненияКоманды.Вставить("Уникальность", Истина);
		ПараметрыВыполненияКоманды.Вставить("Окно", ЭтаФорма.Окно);
		
	ИспользоватьДОДляХраненияФайловОбъекта =
		РаботаСФайламиСлужебныйКлиент.Используется1СДокументооборотДляХраненияФайловОбъекта(
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			ЭтотОбъект);
	
	Если ИспользоватьДОДляХраненияФайловОбъекта Тогда
		
		// ИнтеграцияС1СДокументооборотом
		РаботаСФайламиСлужебныйКлиент.ОткрытьФормуПрисоединенныеФайлы1СДокументооборот(
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды);
		// Конец ИнтеграцияС1СДокументооборотом
		
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  ПараметрКоманды);
		ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
		
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	Если ЭтаФорма.ПерейтиНаФайлы Тогда
		ПодключитьОбработчикОжидания("ПереходНаФайлы", 0.1, Истина);
		
		//ПереходНаФайлы(Объект.Ссылка, Пар);
	КонецЕсли;
КонецПроцедуры
