
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка);           
	
	ТипТэгаВыполняемыйКод = Перечисления.упоТипыТегов.ВыполняемыйКод;
	ТипТэгаКонстанта = Перечисления.упоТипыТегов.Константа;
	ТипТэгаРеквизитОбъекта = Перечисления.упоТипыТегов.РеквизитОбъекта;
	ТипТэгаВычисляемыйРеквизит = Перечисления.упоТипыТегов.ВычисляемыйРеквизит;
	ТипТэгаДопРеквизитОбъекта = Перечисления.упоТипыТегов.ДопРеквизитОбъекта;
	
	Если ЗначениеЗаполнено(Параметры.Источник) Тогда
		
		ИмяТаблицы = Параметры.Источник;
		Элементы.ИмяТаблицы.ТолькоПросмотр = Истина;
		
		Элементы.ИмяТаблицы.СписокВыбора.Очистить();
		Спис = упоОповещенияВызовСервера.ПолучитьСписокДоступныхТаблиц();
		Для Каждого Эл Из Спис Цикл
			Элементы.ИмяТаблицы.СписокВыбора.Добавить(Эл.Значение,Эл.Представление);
		КонецЦикла;
		
		ЗаполнитьСписокДоступныхРеквизитов();
		
	КонецЕсли;
	
	Параметры.Свойство("Условие", Условие);
	Параметры.Свойство("ДопРеквЗначениеУсловия", ДопРеквЗначениеУсловия);
	Параметры.Свойство("ДопРеквИмяТаблицы", ДопРеквИмяТаблицы);
	Параметры.Свойство("ДопРеквПолеЗначения", ДопРеквПолеЗначения);
	Параметры.Свойство("ДопРеквПолеСвязи", ДопРеквПолеСвязи);
	Параметры.Свойство("ДопРеквПолеУсловия", ДопРеквПолеУсловия);
	Параметры.Свойство("ТипТэга", ТипТэга);
	Параметры.Свойство("Значение", Значение);
	Параметры.Свойство("Представление", Представление);
	Параметры.Свойство("Идентификатор", Идентификатор);
	
	Если ЗначениеЗаполнено(Условие) Тогда
		Если ТипТэга = ТипТэгаРеквизитОбъекта 
			ИЛИ ТипТэга = ТипТэгаВычисляемыйРеквизит 
			ИЛИ ТипТэга = ПредопределенноеЗначение("Перечисление.упоТипыТегов.НавигационнаяСсылка") Тогда
			ИмяРеквизита = Условие;
			Поз = Найти(ИмяРеквизита,".");
			Пока Поз > 0 Цикл
				ИмяРеквизита = Сред(ИмяРеквизита,Поз+1);  		
				Поз = Найти(ИмяРеквизита,".");
			КонецЦикла;
		ИначеЕсли ТипТэга = ТипТэгаКонстанта Тогда
			ИмяРеквизита = Условие;
		ИначеЕсли ТипТэга = ТипТэгаВыполняемыйКод Тогда
			ВыполняемыйКод = Условие;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипТэга = ТипТэгаДопРеквизитОбъекта Тогда
		Если Не ПустаяСтрока(ДопРеквИмяТаблицы) Тогда
			ИмяРеквизита = ДопРеквИмяТаблицы + "." + ДопРеквПолеЗначения; 
		КонецЕсли;
		ЗаполнитьСвязанныеТаблицы(ИмяТаблицы);	
		Если ЗначениеЗаполнено(ДопРеквИмяТаблицы) Тогда
			ЗаполнитьСпискиВыбораДопРекв();
		КонецЕсли;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		
		ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ИмяТаблицы,"Ссылка");
		
		Если ОписаниеТипаРеквизита <> Неопределено Тогда
			Элементы.ИсточникСсылка.ОграничениеТипа = ОписаниеТипаРеквизита;
		КонецЕсли;
		
	Иначе
		Элементы.ИсточникСсылка.Видимость = Ложь;	
	КонецЕсли;
	
	Если ПустаяСтрока(ВыполняемыйКод) Тогда
		
		ВыполняемыйКод = НСтр("ru = '// Доступные переменные:	
		|//							""Источник"" - объект, связанный с событием
		|//							""ИсточникДопПараметр"" - дополнительный параметр источника 
		|//							""ПараметрыВозврата"" - структура
		|//							""Результат"" - переменная, в которой возвращается результат вычисления тэга
		|//											так же возможно вернуть туда структуру с ключами: ""Текст"" и ""HTML""
		|// Примеры:
		|//	1. Результат = Источник.СсылкаНаПроектнуюЗадачу.КрайнийСрок
		|//	2. Результат = Новый Структура(""Текст, HTML"", Источник.СсылкаНаПроектнуюЗадачу.КрайнийСрок, 
		|//	""<a href=>""+Источник.СсылкаНаПроектнуюЗадачу.КрайнийСрок+""</a>"")
		|'");	
		
	КонецЕсли;
	
	Инициализировать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
     
     упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
     
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
     
     упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
     
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.упоВидыСобытий.Форма.ФормаВыборТаблицыМетаданных" Тогда
		
		Если ВыбранноеЗначение.УИстроки = 1 Тогда
			ДопРеквИмяТаблицы = ВыбранноеЗначение.ИмяТаблицы;
			ПредставлениеТаблицы = ВыбранноеЗначение.ПредставлениеТаблицы;
			ДопРеквПолеЗначения = "";
			ДопРеквПолеСвязи = "";
			ДопРеквПолеУсловия = "";
			ДопРеквЗначениеУсловия = Неопределено;
			ЗаполнитьСпискиВыбораДопРекв();
			СформироватьПредставление();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
     
     упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
     
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
     
     упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
     
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
          
     упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
     
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
     
     упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
     
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
     
     упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
     
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
     
     упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
     
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
          
     упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
     
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
     
     упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);          
     
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
     
     упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);          
     
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
     
     упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
     
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
     П5 = Неопределено, П6 = Неопределено) 
     
     упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);     
     
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
     П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
     
     Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
     Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);     
     
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
     П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
     
     упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
          П5, П5, П6);
     
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипТэгаПриИзменении(Элемент)
	
	Инициализировать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяТаблицыПриИзменении(Элемент)
	
	ЗаполнитьСписокДоступныхРеквизитов();	
	СформироватьПредставление();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаПриИзменении(Элемент)
	
	СформироватьПредставление();
	Если ТипТэга = ТипТэгаДопРеквизитОбъекта Тогда
		
		ДопРеквИмяТаблицы = "";
		ДопРеквПолеЗначения = "";
		
		Остаток = ИмяРеквизита;
		Поз = Найти(Остаток,".");
		ЕстьТочка = Ложь;
		Пока Поз > 0 Цикл
			Остаток = Сред(Остаток,Поз+1);
			Поз = Найти(Остаток,".");
			ЕстьТочка = Истина;
		КонецЦикла;
		
		Если ЕстьТочка Тогда
			ДопРеквИмяТаблицы = СтрЗаменить(ИмяРеквизита,"." + Остаток,"");
			ДопРеквПолеЗначения = Остаток;
			ЗаполнитьСпискиВыбораДопРекв();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРеквПолеУсловияПриИзменении(Элемент)
	
	ОписаниеТипаРеквизита = Неопределено;
	
	Если ЗначениеЗаполнено(ДопРеквПолеУсловия) Тогда
		ОписаниеТипаРеквизита = упоОповещенияВызовСервера.ПолучитьОписаниеТипаРеквизита(ДопРеквИмяТаблицы,ДопРеквПолеУсловия);
	КонецЕсли;
	
	Если ОписаниеТипаРеквизита <> Неопределено Тогда
		Элементы.ДопРеквЗначениеУсловия.ОграничениеТипа = ОписаниеТипаРеквизита;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопРеквИмяТаблицыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Пар = Новый Структура("ИмяТаблицы,УИСтроки",ДопРеквИмяТаблицы,1);
	
	масНужныеТипы = Новый Массив;
	масНужныеТипы.Добавить("Справочники");
	масНужныеТипы.Добавить("РегистрыСведений");
	Пар.Вставить("масНужныеТипы",масНужныеТипы);
	
	масНужныеТаблицы = Новый Массив;
	Для Каждого СтрТз Из СвязанныеТаблицы Цикл
		масНужныеТаблицы.Добавить(СтрТз.ИмяТаблицы);	
	КонецЦикла;
	Пар.Вставить("масНужныеТаблицы",масНужныеТаблицы);
	
	ОткрытьФорму("Справочник.упоВидыСобытий.Форма.ФормаВыборТаблицыМетаданных",Пар,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДопРеквПолеЗначенияПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьИЗакрыть(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипТэга = ТипТэгаРеквизитОбъекта 
		ИЛИ ТипТэга = ТипТэгаВычисляемыйРеквизит 
		ИЛИ ТипТэга = ПредопределенноеЗначение("Перечисление.упоТипыТегов.НавигационнаяСсылка") Тогда
		Условие = ИмяТаблицы + "." + ИмяРеквизита;
	ИначеЕсли ТипТэга = ТипТэгаКонстанта Тогда
		Условие = ИмяРеквизита;
	ИначеЕсли ТипТэга = ТипТэгаВыполняемыйКод Тогда
		Условие = ВыполняемыйКод;
	Иначе
				
	КонецЕсли;
	
	Представление = СтрЗаменить(Представление," ","");
	
	Пар = Новый Структура("ТипТэга,Условие,Представление,Значение,ДопРеквЗначениеУсловия,ДопРеквИмяТаблицы,ДопРеквПолеЗначения,ДопРеквПолеСвязи,ДопРеквПолеУсловия");
	ЗаполнитьЗначенияСвойств(Пар,ЭтаФорма);
	Пар.Вставить("ИмяТаблицыИсточника", ИмяТаблицы);
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Пар.Вставить("Идентификатор", Идентификатор);
	КонецЕсли;
	
	ОповеститьОВыборе(Пар);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКод(Команда)
	
	ОчиститьСообщения();
	
	ТекстУспешногоЗавершения = "";
	Если упоОповещенияВызовСервера.ПроверитьКод(ВыполняемыйКод, ТекстУспешногоЗавершения, 
														ИсточникСсылка, ИсточникДопПараметр) Тогда
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ТекстУспешногоЗавершения);
		ТекстовыйДокумент.Показать("ru = 'Результат выполнения выражения на встроенном языке'");
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)

	Если Не ЗначениеЗаполнено(Форма.ТипТэга) Тогда
		Форма.Элементы.ИмяТаблицы.Видимость = Истина;
		Форма.Элементы.ИмяТаблицы.Доступность = Ложь;
		Форма.Элементы.ИмяРеквизита.Видимость = Ложь;
		Форма.Элементы.ВыполняемыйКод.Видимость = Ложь;
		Форма.Элементы.ГруппаШапкаВыполняемыйКод.Видимость = Ложь;
	ИначеЕсли Форма.ТипТэга = Форма.ТипТэгаВыполняемыйКод Тогда
		Форма.Элементы.ИмяТаблицы.Видимость = Истина;
		Форма.Элементы.ИмяТаблицы.Доступность = Ложь;
		Форма.Элементы.ИмяРеквизита.Видимость = Ложь;                 
		Форма.Элементы.ВыполняемыйКод.Видимость = Истина;
		Форма.Элементы.ГруппаШапкаВыполняемыйКод.Видимость = Истина;
	ИначеЕсли Форма.ТипТэга = Форма.ТипТэгаКонстанта Тогда
		Форма.Элементы.ИмяТаблицы.Видимость = Ложь;
		Форма.Элементы.ИмяТаблицы.Доступность = Ложь;
		Форма.Элементы.ИмяРеквизита.Видимость = Истина;
		Форма.Элементы.ИмяРеквизита.Заголовок = "Имя константы";
		Форма.Элементы.ВыполняемыйКод.Видимость = Ложь;
		Форма.Элементы.ГруппаШапкаВыполняемыйКод.Видимость = Ложь;
	Иначе 
		Форма.Элементы.ИмяТаблицы.Видимость = Истина;
		Форма.Элементы.ИмяТаблицы.Доступность = Истина;
		Форма.Элементы.ИмяРеквизита.Видимость = Истина;
		Форма.Элементы.ИмяРеквизита.Заголовок = "Имя реквизита";
		Форма.Элементы.ВыполняемыйКод.Видимость = Ложь;
		Форма.Элементы.ГруппаШапкаВыполняемыйКод.Видимость = Ложь;
	КонецЕсли;
	
	Если Форма.ТипТэга = Форма.ТипТэгаДопРеквизитОбъекта Тогда
		Форма.Элементы.ИмяРеквизита.Видимость = Ложь;
		Форма.Элементы.ДопРеквИмяТаблицы.Видимость = Истина;
		Форма.Элементы.ДопРеквПолеЗначения.Видимость = Истина;
		Форма.Элементы.ДопРеквПолеСвязи.Видимость = Истина;
		Форма.Элементы.ДопРеквПолеУсловия.Видимость = Истина;
		Форма.Элементы.ДопРеквЗначениеУсловия.Видимость = Истина;
	Иначе
		Форма.Элементы.ДопРеквИмяТаблицы.Видимость = Ложь;
		Форма.Элементы.ДопРеквПолеЗначения.Видимость = Ложь;
		Форма.Элементы.ДопРеквПолеСвязи.Видимость = Ложь;
		Форма.Элементы.ДопРеквПолеУсловия.Видимость = Ложь;
		Форма.Элементы.ДопРеквЗначениеУсловия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхРеквизитов()
	
	Элементы.ИмяРеквизита.СписокВыбора.Очистить();
	Если ТипТэга = ТипТэгаВычисляемыйРеквизит Тогда
		Спис = упоОповещенияВызовСервера.ПолучитьСписокВычисляемыхРеквизитов(ИмяТаблицы);	
	ИначеЕсли ТипТэга = ТипТэгаРеквизитОбъекта ИЛИ ТипТэга = Перечисления.упоТипыТегов.НавигационнаяСсылка Тогда
		Спис = упоОповещенияВызовСервера.ПолучитьСписокРеквизитовДляОповещений(ИмяТаблицы);
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого Эл Из Спис Цикл
		Элементы.ИмяРеквизита.СписокВыбора.Добавить(Эл.Имя,Эл.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязанныеТаблицы(ИмяВедущейТаблицы)
	
	// получим список таблиц, в которых может хранится конт. информация
	СвязанныеТаблицы.Очистить();
	Элементы.ИмяРеквизита.СписокВыбора.Очистить();
	
	мас = упоОповещенияПовтИсп.ПолучитьСвязанныеТаблицы(ИмяВедущейТаблицы);
	Для Каждого Эл Из мас Цикл
		новстр = СвязанныеТаблицы.Добавить();
		ЗаполнитьЗначенияСвойств(новстр,Эл);
		Если Не Эл.ЭтоПолеСвязи Тогда
			Элементы.ИмяРеквизита.СписокВыбора.Добавить(Эл.ИмяТаблицы + "." + Эл.ИмяРеквизита,Эл.ИмяТаблицы + "." + Эл.ИмяРеквизитаПредставление);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

&НаКлиенте
Процедура СформироватьПредставление()
	
	Если ТипТэга = ТипТэгаРеквизитОбъекта ИЛИ ТипТэга = ТипТэгаВычисляемыйРеквизит Тогда
		Представление = Элементы.ИмяТаблицы.ТекстРедактирования + ?(ПустаяСтрока(ИмяТаблицы),"",".") + Элементы.ИмяРеквизита.ТекстРедактирования;
	ИначеЕсли ТипТэга = ПредопределенноеЗначение("Перечисление.упоТипыТегов.НавигационнаяСсылка") Тогда	
		Представление = Элементы.ИмяТаблицы.ТекстРедактирования + ?(ПустаяСтрока(ИмяТаблицы),"",".") + Элементы.ИмяРеквизита.ТекстРедактирования+".НавигационнаяСсылка";
	ИначеЕсли ТипТэга = ТипТэгаКонстанта Тогда
		Представление = "Константа." + Элементы.ИмяРеквизита.ТекстРедактирования; 
	ИначеЕсли ТипТэга = ТипТэгаДопРеквизитОбъекта Тогда
		Представление = ДопРеквИмяТаблицы + ?(ПустаяСтрока(ДопРеквИмяТаблицы),"",".") + ДопРеквПолеЗначения;	
	КонецЕсли;
	
	Представление = СтрЗаменить(Представление," ","");
	
КонецПроцедуры

&НаСервере
Функция Инициализировать() 
	
	УправлениеДоступностью(ЭтаФорма);
	
	Если ТипТэга = ТипТэгаРеквизитОбъекта 
		ИЛИ ТипТэга = ТипТэгаВычисляемыйРеквизит 
		ИЛИ ТипТэга = ТипТэгаДопРеквизитОбъекта 
		ИЛИ ТипТэга = ПредопределенноеЗначение("Перечисление.упоТипыТегов.НавигационнаяСсылка") Тогда
		
		Если ТипТэга = ТипТэгаДопРеквизитОбъекта Тогда
			ЗаполнитьСвязанныеТаблицы(ИмяТаблицы);
		ИначеЕсли ЗначениеЗаполнено(ИмяТаблицы) Тогда
			ЗаполнитьСписокДоступныхРеквизитов();
		КонецЕсли;
		
	ИначеЕсли ТипТэга = ТипТэгаКонстанта Тогда
		
		Элементы.ИмяТаблицы.СписокВыбора.Очистить();
		Элементы.ИмяРеквизита.СписокВыбора.Очистить();
		Спис = упоОповещенияВызовСервера.ПолучитьСписокДоступныхКонстантДляШаблонаСообщения();
		Для Каждого Эл Из Спис Цикл
			Элементы.ИмяРеквизита.СписокВыбора.Добавить(Эл.Значение,Эл.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпискиВыбораДопРекв()
	ЗаполнитьСписокВыбораДопРеквПоляСвязи();
	ЗаполнитьСписокВыбораДопРеквПоляУсловия();
	ЗаполнитьСписокВыбораДопРеквПоляЗначения();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДопРеквПоляСвязи()
	
	Элементы.ДопРеквПолеСвязи.СписокВыбора.Очистить();
	
	ВремПолеСвязи = "";
	Для Каждого СтрТз Из СвязанныеТаблицы Цикл
		Если СтрТз.ИмяТаблицы = ДопРеквИмяТаблицы И СтрТз.ЭтоПолеСвязи Тогда
			Элементы.ДопРеквПолеСвязи.СписокВыбора.Добавить(СтрТз.ИмяРеквизита,СтрТз.ИмяРеквизитаПредставление);
			ВремПолеСвязи = СтрТз.ИмяРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	Если Элементы.ДопРеквПолеСвязи.СписокВыбора.Количество() = 1 Тогда
		ДопРеквПолеСвязи = ВремПолеСвязи;	
		Элементы.ДопРеквПолеСвязи.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДопРеквПоляУсловия()
	
	Элементы.ДопРеквПолеУсловия.СписокВыбора.Очистить();
	
	СписРеквизитов = упоОповещенияВызовСервера.ПолучитьСписокРеквизитовДляОповещений(ДопРеквИмяТаблицы);
	
	Для Каждого Эл Из СписРеквизитов Цикл
		Элементы.ДопРеквПолеУсловия.СписокВыбора.Добавить(Эл.Имя,Эл.Представление);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДопРеквПоляЗначения()
	
	Элементы.ДопРеквПолеЗначения.СписокВыбора.Очистить();
	
	СписРеквизитов = упоОповещенияВызовСервера.ПолучитьСписокРеквизитовДляОповещений(ДопРеквИмяТаблицы);
	
	Для Каждого Эл Из СписРеквизитов Цикл
		Элементы.ДопРеквПолеЗначения.СписокВыбора.Добавить(Эл.Имя,Эл.Представление);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
