#Область ПрограммныйИнтерфейс

#Область ПодпискиНаСобытия

// Обрабатывает запись документов: ставит проведенный документ проектного контура в очередь к отражению.
//
// Параметры:
//  Источник  - ДокументОбъект - первичный документ.
//  Отказ  - Булево - флаг отказа.
//
Процедура ПервичныеДокументыПроектногоБюджетированияПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании") Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;

	Если Источник.Проведен Тогда
		ПоставитьПервичныйДокументВОчередьКОтражению(Источник.Ссылка);
	Иначе
		ПроверитьУстановитьПометкуУдаления(Источник.Ссылка, Источник.ПометкаУдаления)
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает проведение документов: ставит проведенный документ проектного контура в очередь к отражению.
//
// Параметры:
//  Источник  - ДокументОбъект - первичный документ.
//  Отказ  - Булево - флаг отказа.
//  РежимПроведения  - РежимПроведенияДокумента - режим проведения документа.
//
Процедура ПервичныеДокументыПроектногоБюджетированияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании") Тогда
		Возврат;
	КонецЕсли;
	
	ПоставитьПервичныйДокументВОчередьКОтражению(Источник.Ссылка);
	
КонецПроцедуры

// Обрабатывает отмену проведения документов: удаляет исходный документ проектного контура из очереди к отражению.
//
// Параметры:
//  Источник  - ДокументОбъект - первичный документ.
//  Отказ  - Булево - флаг отказа.
//
Процедура ПервичныеДокументыПроектногоБюджетированияУдалениеПроведения(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументИспользовался = ДокументИспользовалсяВКонтуреПроектнойЭкономики(Источник.Ссылка);
	Если Не ДокументИспользовался Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьПервичныйДокументИзОчередиКОтражению(Источник.Ссылка);
	
КонецПроцедуры

// Проверяет изменение документа-основания в документе отражения факта: при изменении документа-основания формирует 
// дополнительное свойство объекта "ИзмененныйДокументОснование" для передачи ссылки на измененный документа-основания 
// в процедуру ДокументОтражениеВПроектномБюджетированииПриЗаписи(). Ситуация возможна при принудительной ручной очистке
// реквизита ДокументОснование.
//
// Параметры:
//  Источник  - ДокументОбъект.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//  Отказ  - Булево - флаг отказа.
//  РежимЗаписи  - РежимЗаписиДокумента - режим записи документа.
//  РежимПроведения  - РежимПроведенияДокумента - режим проведения документа.
//
Процедура ДокументОтражениеВПроектномБюджетированииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
		
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ДокументОснование");		
		Если ЗначениеЗаполнено(ДокументОснование) И ДокументОснование <> Источник.ДокументОснование Тогда
			Источник.ДополнительныеСвойства.Вставить("ИзмененныйДокументОснование", ДокументОснование);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

// Проверяет изменение документа-основания в документе отражения факта: при изменении документа-основания проверяет 
// дополнительное свойство объекта "ИзмененныйДокументОснование", установленное в подписке 
// ДокументОтражениеВПроектномБюджетированииПередЗаписью(), и при его заполненности ставит исходный документа-основание
// в очередь к отражению документа.
//
// Параметры:
//  Источник  - ДокументОбъект.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//  Отказ  - Булево - флаг отказа.
//
Процедура ДокументОтражениеВПроектномБюджетированииПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
	
	// Если ДокументОснование в документе отражение зачищен вручную.
	ИсходныйДокументОснование = Неопределено;
	Если Источник.ДополнительныеСвойства.Свойство("ИзмененныйДокументОснование", ИсходныйДокументОснование) 
		И ИсходныйДокументОснование.Проведен Тогда					
		
		ПоставитьПервичныйДокументВОчередьКОтражению(ИсходныйДокументОснование);
		
	КонецЕсли;	
		
КонецПроцедуры

// Обрабатывает проведение документа отражение факта: изменяет статус отраженного документа-основания.
//
// Параметры:
//  Источник  - ДокументОбъект.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//  Отказ  - Булево - флаг отказа.
//  РежимПроведения  - РежимПроведенияДокумента - режим проведения документа.
//
Процедура ДокументОтражениеВПроектномБюджетированииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Корректность документа отражения проверяется в модуле объекта, 
	// в обработке проведения имеем заполненный документ без ошибок.	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.ДокументОснование) Тогда 
		Возврат 
	КонецЕсли;
	
	Статус = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.Отражено;
	Если Источник.РучнаяКорректировка Тогда
		Статус = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОтраженоВручную;
	КонецЕсли;		
	ИзменитьСтатусПервичногоДокументаВОчередиКОтражению(Источник.ДокументОснование, Статус);			
	ОбновитьОшибкиОтраженияДокумента(Источник.ДокументОснование);
	
КонецПроцедуры

// Обрабатывает отмену проведения документа отражение факта: ставит документ-основание в очередь к отражению.
//
// Параметры:
//  Источник  - ДокументОбъект.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//  Отказ  - Булево - флаг отказа.
//
Процедура ДокументОтражениеВПроектномБюджетированииУдалениеПроведения(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.ДокументОснование) Тогда 
		Возврат 
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства; 
	Если НЕ ДополнительныеСвойства.Свойство("ОтменаПроведенияПоПервичномуДокументу") Тогда	
		ПоставитьПервичныйДокументВОчередьКОтражению(Источник.ДокументОснование, Ложь);	
	КонецЕсли;	
	
КонецПроцедуры

// Обрабатывает движения документов по РС.ОтражениеДокументовВРеглУчете: ставит документ-регистратор, 
// входящий в контур проектного бюджетирования, в очередь к отражению.
//
// Параметры:
//  Источник  - РегистрСведенийНаборЗаписей.ОтражениеДокументовВРеглУчете - набор записей регистра.
//  Отказ  - Булево - флаг отказа.
//  Замещение  - Булево - использование режима замещения при записи регистра.
//
Процедура ОтражениеДокументовВРеглУчетеПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
		
	Для Каждого Запись Из Источник Цикл
		ПоставитьПервичныйДокументВОчередьКОтражению(Запись.Регистратор);						
	КонецЦикла;	
	
КонецПроцедуры

// Обрабатывает движения документов по регистрам накопления 
// во время операции закрытия месяца: ставит документ-регистратор, 
// входящий в контур проектного бюджетирования, в очередь к отражению.
//
// Параметры:
//  Источник  - РегистрНакопленияНаборЗаписей - набор записей регистра.
//  Отказ  - Булево - флаг отказа.
//  Замещение  - Булево - использование режима замещения при записи регистра.
//
Процедура ОтражениеИзмененийРНВПроектномБюджетированииПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьОтражение = 
		ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	Если Не ИспользоватьОтражение Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗНЧ(Источник);
	Если ТипИсточника = Тип("РегистрНакопленияНаборЗаписей.упоФактДоходовИРасходовОбороты") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрЗакрытиеМесяца = упоПроектноеБюджетированиеПовтИсп.ДополнительноеЗначениеПараметраСеанса("ЗакрытиеМесяца");
	Если ПараметрЗакрытиеМесяца = Истина Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("РегистраторыНабора", Источник.ВыгрузитьКолонку("Регистратор")); 
		Запрос.УстановитьПараметр("СтатусыОтражено", упоПроектноеБюджетированиеПовтИсп.СтатусыОтражения("Отражено"));
		Запрос.Текст = "ВЫБРАТЬ
		               |	упоОтражениеДокументовВПроектномБюджетировании.Документ КАК Документ
		               |ИЗ
		               |	РегистрСведений.упоОтражениеДокументовВПроектномБюджетировании КАК упоОтражениеДокументовВПроектномБюджетировании
		               |ГДЕ
		               |	упоОтражениеДокументовВПроектномБюджетировании.Документ В(&РегистраторыНабора)
		               |	И упоОтражениеДокументовВПроектномБюджетировании.Статус В(&СтатусыОтражено)";
		
		УстановитьПривилегированныйРежим(Истина);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			ДокументыКОтражению = Результат.Выгрузить().ВыгрузитьКолонку("Документ");
			ПараметрыЗадания = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыКОтражению);
			
			упоРаботаСОчередямиВызовСервера.ЗапуститьФоновоеЗаданиеКонтекстСервера(
				"упоПроектноеБюджетированиеСервер.ПоставитьПервичныеДокументыВОчередьКОтражениюВФоне",
				ПараметрыЗадания,
				, 
				, 
				Истина);
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// См.ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд. 
//	
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
		
	Вид = ВидыПодключаемыхКоманд.Добавить();
    Вид.Имя         = "ПроектноеБюджетирование";    
	Вид.ИмяПодменю  = "ФормаГруппаКомандыФормы";	
    Вид.Заголовок   = НСтр("ru = 'Проектное бюджетирование'");
	
	Вид.Порядок = 50;
	Вид.Картинка = БиблиотекаКартинок.упоИнтерфейсФинансыПроектов16;
	Вид.Отображение = ОтображениеКнопки.Картинка;
	Вид.ВидГруппыФормы = ВидГруппыФормы.Подменю;		
	
КонецПроцедуры

// См.ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов. 
//
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
			
	Настройка = НастройкиПрограммногоИнтерфейса.Добавить();
    Настройка.Ключ          = "ДобавитьКомандыПроектногоБюджетирования";
    Настройка.ОписаниеТипов = Новый ОписаниеТипов("Булево");
    Настройка.ВидыПодключаемыхОбъектов = "Обработка";	
	
КонецПроцедуры

// См.ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту. 
//
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Документы.упоОтражениеФактаВПроектномБюджетировании) Тогда
		Возврат;
	КонецЕсли;
	
	ТипПараметра = Новый ОписаниеТипов(упоПроектноеБюджетированиеПовтИсп.ТипыДокументовПроектногоБюджетирования());
	
	Команда = Команды.Добавить();
	Команда.Вид = "ПроектноеБюджетирование";
	Команда.Идентификатор = "ПроектноеБюджетирование";
	Команда.Представление = НСтр("ru = 'Движения проектного бюджетирования'");
	Команда.Важность = "Важное";
	Команда.Порядок = 50;
	Команда.ОтображениеКнопки = ОтображениеКнопки.Картинка;
	Команда.Картинка = БиблиотекаКартинок.упоИнтерфейсФинансыПроектов16;
	Команда.ТипПараметра = ТипПараметра;
	Команда.ФункциональныеОпции = "упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании";
	Команда.ИзменяетВыбранныеОбъекты = Ложь;
	Команда.МножественныйВыбор = Ложь;
	Команда.Обработчик = "упоПроектноеБюджетированиеКлиент.Подключаемый_ОткрытьФормуОтраженияВПроектномБюджетировании";
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеПравила

// Возвращает фактические данные по правилу отражения факта в проектном бюджетировании.
//
// Параметры:
//  Правило  - СправочникСсылка.упоПравилаПолученияФактаДляПроектногоБюджетирования - правило отражения.
//  Параметры  - Структура - параметры выполнения правила отражения.
//  СтатусЗаполнения  - ПеречислениеСсылка.упоСтатусыОтраженияДокументовВПроектномБюджетировании - 
//		статус ошибки отражения документа.
//  ОшибкиПользователю  - Структура - см.ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю().
//
// Возвращаемое значение:
//  Соответствие - результат выполнения правила по разделам бюджетирования:
//		* Ключ - ПеречислениеСсылка.упоРазделыПравилПроектногоБюджетирования - раздел документа отражение факта.
//		* Значение - ТаблицаЗначений - результат выполнения правила.
//
Функция ФактБюджетированияПоПравилу(Правило, Параметры, СтатусЗаполнения = Неопределено, ОшибкиПользователю = Неопределено) Экспорт
	
	ДанныеРезультат = Новый Соответствие;
	
	ДокументОснование = Неопределено;
	Параметры.Свойство("ОтборПоРегистраторам", ДокументОснование);
			
	Если НЕ ПроверитьЗаполнениеПравила(Правило, ДокументОснование, ОшибкиПользователю) Тогда
		СтатусЗаполнения = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОтсутствуютПравилаОтражения;
		Возврат ДанныеРезультат;
	КонецЕсли;	
	
	ЭтоEPM = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();		
	Если ЭтоEPM И Правило.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.Бюджетирование Тогда 
		
		РезультатПравила = ФактПоПравилуПоСтатьямБюджетовERP(Правило, Параметры);																													
		
	Иначе	
		
		Отказ = Истина;
		ТекстОшибки = "";
		МенеджерПравила = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования;
		СхемаКомпоновкиДанных = МенеджерПравила.СхемаКомпоновкиДанныхПоНастройкам(Правило, Ложь, ТекстОшибки);											
		Если СхемаКомпоновкиДанных = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, "", ТекстОшибки, Правило);	
		Иначе	
			НастройкиКомпоновщика = НастройкиКомпоновщикаПравилаСПроверкой(СхемаКомпоновкиДанных, 
																			Правило, 
																			ДокументОснование, 
																			ОшибкиПользователю, 
																			Отказ);
		КонецЕсли;	
		
		Если Отказ Тогда
			СтатусОтражения = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОшибкаОтражения;				 
			Возврат ДанныеРезультат;
		КонецЕсли;
				
		ЗаполнитьРеквизитыПравила(СхемаКомпоновкиДанных, НастройкиКомпоновщика, Правило);		
		ЗаполнитьРесурсыПравила(СхемаКомпоновкиДанных, НастройкиКомпоновщика, Правило);
				
		ПолеПериодИмя = "Период";						
		ДобавитьПолеГруппировкиНастройкиКомпоновщика(НастройкиКомпоновщика, ПолеПериодИмя);
		ДобавитьПолеПорядкаНастройкиКомпоновщика(НастройкиКомпоновщика, ПолеПериодИмя);
		
		ПолеРегистраторИмя = "Регистратор";			
		ДобавитьПолеГруппировкиНастройкиКомпоновщика(НастройкиКомпоновщика, ПолеРегистраторИмя);					
		ДобавитьПоляОтбораПоПараметрам(НастройкиКомпоновщика, ПолеРегистраторИмя, Параметры.ОтборПоРегистраторам);		
		
		УстановитьОтборПоПериоду(СхемаКомпоновкиДанных, НастройкиКомпоновщика, Параметры);
		
		УстановитьОтборИзНастройки(СхемаКомпоновкиДанных, НастройкиКомпоновщика, Правило.НастройкиКомпоновкиДанных.Получить());					
		
		УстановитьОтборНаНулевыеРесурсы(НастройкиКомпоновщика);
					
		ОтключитьВыводОбщихИтоговНастройкиКомпоновщика(НастройкиКомпоновщика);
		
		Попытка
			РезультатПравила = РезультатВыполненияСКДТаблицаЗначений(СхемаКомпоновкиДанных, НастройкиКомпоновщика);
		Исключение
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, "", ОписаниеОшибки(), Правило);
			СтатусЗаполнения = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОшибкаОтражения;
			Возврат ДанныеРезультат;
		КонецПопытки;	
		
	КонецЕсли;	
	
	ДанныеРезультат.Вставить(Правило.Раздел, РезультатПравила);		
	
	РезультатПравилаРаспределитьПоПлановымДанным(Правило, РезультатПравила);	
	
	Возврат ДанныеРезультат;
	
КонецФункции

#КонецОбласти

#Область ОтражениеПервичныхДокументов

// Вызывает функцию ВыполнитьОтражениеДокументов() для фонового выполнения.
//
// Параметры:
//  ПараметрыОтражения  - Структура, Неопределено - параметры отражения первичного документа. 
//		Не используется, но является обязательным параметром при вызове через БСП - не удалять.
//  АдресРезультата  - Строка - Адрес временного хранилища для помещения результата. Не используется.
//
Процедура ВыполнитьОтражениеДокументовВФоне(ПараметрыОтражения, АдресРезультата = Неопределено) Экспорт
	
	Результат = ВыполнитьОтражениеДокументов();
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;	
	
КонецПроцедуры // ()

// Вызывает функцию ПоставитьПервичныеДокументыВОчередьКОтражению() для фонового выполнения.
//
// Параметры:
//  ПараметрыОтражения  - Структура, Неопределено - параметры отражения первичного документа.
//  АдресРезультата  - Строка - Адрес временного хранилища для помещения результата. Не используется.
//
Процедура ПоставитьПервичныеДокументыВОчередьКОтражениюВФоне(ПараметрыОтражения, АдресРезультата) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыОтражения) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыКОтражению = ПараметрыОтражения[0];
	
	ПоставитьПервичныеДокументыВОчередьКОтражению(ДокументыКОтражению);
	
КонецПроцедуры // ()

// Выполняет регистрацию массива документов в очереди к отражению документов в проектном бюджетировании.
//
// Параметры:
//  ДокументыКОтражению  - Массив - документы к постановке в очередь отражения.
//
Процедура ПоставитьПервичныеДокументыВОчередьКОтражению(ДокументыКОтражению) Экспорт
	
	Если ДокументыКОтражению = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого Документ Из ДокументыКОтражению Цикл
		ПоставитьПервичныйДокументВОчередьКОтражению(Документ);	
	КонецЦикла;

КонецПроцедуры // ()

// Устанавливает первичный документ в очередь к отражению, обновляет статус отражения документа, 
// очищает историю ошибок документа.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка - первичный документ.
//  НеПроверятьДокументОтражение  - Булево - признак безусловной отмены проведения связанного документа отражения.
//
Процедура ПоставитьПервичныйДокументВОчередьКОтражению(ДокументСсылка, НеПроверятьДокументОтражение = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ упоПроектноеБюджетированиеВызовСервера.ДокументПериодаИспользованияКонтураЭкономики(ДокументСсылка) 
		ИЛИ НЕ ДокументКонтураПроектнойЭкономики(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.КОтражению;	
	ОбновитьСтатусОтраженияДокумента(ДокументСсылка, Статус);
	ОбновитьОчередьДокументовКОтражению(ДокументСсылка);
	ОбновитьОшибкиОтраженияДокумента(ДокументСсылка);
	
	Если НеПроверятьДокументОтражение Тогда
		ОтменитьПроведениеСвязанногоДокументаОтражение(ДокументСсылка);
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Вызывает функцию УдалитьПервичныйДокументИзОчередиКОтражению() для фонового выполнения.
//
// Параметры:
//  ДокументыОчереди  - Массив - документы очереди.
//  АдресРезультата  - Строка - Адрес временного хранилища для помещения результата. Не используется.
//
Процедура УдалитьПервичныеДокументыИзОчередиКОтражениюВФоне(ДокументыОчереди, АдресРезультата = Неопределено) Экспорт
				
	Для Каждого Документ Из ДокументыОчереди Цикл
		УдалитьПервичныйДокументИзОчередиКОтражению(Документ);
	КонецЦикла;
			
КонецПроцедуры	

// Изменяет статус отражения первичного документа.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка - первичный документ.
//  Статус  - ПеречислениеСсылка.упоСтатусыОтраженияДокументовВПроектномБюджетировании - статус.
//  ИдентификаторЗаписи  - УникальныйИдентификатор - идентификатор выполняемой очереди сообщений в фоновом отражении.
//
Процедура ИзменитьСтатусПервичногоДокументаВОчередиКОтражению(ДокументСсылка, Статус, ИдентификаторЗаписи = Неопределено) Экспорт
	
	Если НЕ упоПроектноеБюджетированиеВызовСервера.ДокументПериодаИспользованияКонтураЭкономики(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусОтраженияДокумента(ДокументСсылка, Статус);
	
	Очистить = упоПроектноеБюджетированиеПовтИсп.СтатусыОтражения("Отражено").Найти(Статус) <> Неопределено;
	ОбновитьОчередьДокументовКОтражению(ДокументСсылка, Очистить, ИдентификаторЗаписи);	
	
	Если НЕ Очистить Тогда
		ОтменитьПроведениеСвязанногоДокументаОтражение(ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры	

// Изменяет данные об ошибках отражения первичного документа.
//
// Параметры:
//  Документ  - ДокументСсылка - первичный документ.
//  ОшибкиПравил  - ДокументОбъект.упоОтражениеФактаВПроектномБюджетировании.ОшибкиЗаполнения - 
//		ошибки табличной части документа Отражение, которые переносятся в регистр.
//
Процедура ОбновитьОшибкиОтраженияДокумента(Документ, ОшибкиПравил = Неопределено) Экспорт
	
	НЗ = РегистрыСведений.упоОшибкиОтраженияДокументовВПроектномБюджетировании.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Документ);
	НЗ.Прочитать();
	Если НЗ.Количество() > 0 Тогда		
		НЗ.Очистить();
	КонецЕсли;	
	
	Если ОшибкиПравил <> Неопределено Тогда
		Для Каждого ОшибкаПравила Из ОшибкиПравил Цикл
			Запись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ОшибкаПравила);
		    Запись.Документ = Документ;		
		КонецЦикла;
	КонецЕсли;	
	
	Если НЗ.Модифицированность() Тогда
		НЗ.Записать();
	КонецЕсли;	
				
КонецПроцедуры		
 
#КонецОбласти

#Область Прочие

// Обновляет элементы справочника упоПравилаПолученияФактаДляПроектногоБюджетирования 
// с произвольными запросами по предопределенным макетам СКД.
//
// Параметры:
//  ИменаМакетов	 - Строка, Массив, Неопределено - имена макетов, для которых необходимо обновить правила. 
//  Неопределено - обновление правил для всех макетов.
//
Процедура ОбновитьПредопределенныеПравилаПолученияФакта(ИменаМакетов = Неопределено) Экспорт
	
	ОписанияПравил = ОписанияПравил(ИменаМакетов);
	
	ПравилаПолученияФактаИБ = ПравилаПолученияФактаИБ(ОписанияПравил);
	
	Для Каждого ОписаниеПравила Из ОписанияПравил Цикл
		СоздатьОбновитьПравилоПолученияФакта(ОписаниеПравила, ПравилаПолученияФактаИБ);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает имя перечисления в метаданных по значению перечисления.
//
// Параметры:
//  ПеречислениеСсылка  - ПеречислениеСсылка - значение перечисления.
//                 
// Возвращаемое значение:
//   Строка - Имя перечисления.
//
Функция ИмяПеречисленияПоЗначению(ПеречислениеСсылка) Экспорт
	
	ИмяПеречисления = "";
	СинонимПеречисления = Строка(ПеречислениеСсылка);
	
	ЗначенияПеречисления = Метаданные.Перечисления[ПеречислениеСсылка.Метаданные().Имя].ЗначенияПеречисления;
	Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Синоним = СинонимПеречисления Тогда
			ИмяПеречисления = ЗначениеПеречисления.Имя;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ИмяПеречисления;
	
КонецФункции

// Возвращает соответствие аналитики статьи бюджетирования номеру аналитики статьи.
//
// Параметры:
//  СтатьяБюджетов - СправочникСсылка.СтатьиБюджетов - статья бюджетов.
//
// Возвращаемое значение:
//   Соответствие   - Соответствие аналитики статьи бюджетирования номеру статьи.
//
Функция НомераАналитикСтатьиБюджета(СтатьяБюджетов) Экспорт
	
	НомераАналитик = Новый Соответствие;
	
	ШаблонИмени = "ВидАналитики%1";
	
	Для НомерАналитики = 1 По 6 Цикл
		ИмяАналитики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмени, НомерАналитики);
		Аналитика = СтатьяБюджетов[ИмяАналитики];
		Если ЗначениеЗаполнено(Аналитика) Тогда	
			НомераАналитик.Вставить(Аналитика, НомерАналитики);							
	    КонецЕсли;
	КонецЦикла;
	
	Возврат НомераАналитик;
	
КонецФункции	

// Проверяет очередь документов к отражению на наличие документов до даты начала использования контура отражения.
// При нахождении таких документов удаляет их из очереди.
//
Процедура ПроверитьДокументыПериодаИспользованияКонтураОтражения() Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачалоИспользования = Константы.упоНачалоИспользованияОтраженияПервичныхДокументовВПроектномБюджетировании.Получить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ 
	                      |	упоОчередьДокументовКОтражениюВПроектномБюджетировании.Документ КАК Документ
	                      |ИЗ
	                      |	РегистрСведений.упоОчередьДокументовКОтражениюВПроектномБюджетировании КАК упоОчередьДокументовКОтражениюВПроектномБюджетировании
	                      |ГДЕ
	                      |	упоОчередьДокументовКОтражениюВПроектномБюджетировании.ПериодЗаписи < &НачалоИспользования");
	Запрос.УстановитьПараметр("НачалоИспользования", НачалоИспользования);
	Результат = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не Результат.Пустой() Тогда
		
		ДокументыКОтражению = Результат.Выгрузить().ВыгрузитьКолонку("Документ");
		
		ПараметрыЗадания = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыКОтражению);
		
		упоРаботаСОчередямиВызовСервера.ЗапуститьФоновоеЗаданиеКонтекстСервера(
			"упоПроектноеБюджетированиеСервер.УдалитьПервичныеДокументыИзОчередиКОтражениюВФоне",
			ПараметрыЗадания,
			,
			,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет наличие ошибок отражения по документу.
//
// Параметры:
//  Документ - ДокументСсылка	 - первичный документ отражения.
// 
// Возвращаемое значение:
//  Булево - наличие ошибок отражения.
//
Функция ЕстьОшибкиОтраженияДокумента(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ИСТИНА
	               |ИЗ
	               |	РегистрСведений.упоОшибкиОтраженияДокументовВПроектномБюджетировании КАК упоОшибкиОтраженияДокументовВПроектномБюджетировании
	               |ГДЕ
	               |	(ВЫРАЗИТЬ(упоОшибкиОтраженияДокументовВПроектномБюджетировании.Документ КАК Документ.%1)) = &Документ";
	
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, Документ.Метаданные().Имя);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Возвращает массив типов документов, используемых в проектном бюджетировании.
// Используется для подключения переопределяемых команд и для инициализации списка доступных
// типов документов в упоПравилаПолученияФактаДляПроектногоБюджетирования.
//                 
// Возвращаемое значение:
//   Массив - Типы документов
//
Функция ТипыДокументовПроектногоБюджетирования() Экспорт
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоАктуализацияПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоВерсияПланаПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоВозобновлениеПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоЗавершениеПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоЗакрытиеЭтапа"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеВладельцаРесурсов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеДолжностиСотрудника"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеПозицииСДР"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеРабочегоКалендаря"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеРуководителяПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеРуководителяПроектнойЗадачи"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеСоставаПодразделения"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоНазначениеТрудовыхРесурсовНаПроект"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоОсвобождениеДиспетчера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоОстановкаПроектныхРабот"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоПланированиеТрудозатратПоТрудовымРесурсам"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоПроектнаяЗадача"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРасчетКалендарногоПланаПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРасчетЦеныКонтракта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияВладельцаРесурсов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияДиспетчера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияИзмененийРисковПроектов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияМощностиРолей"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияОперативнойЗагрузкиСпециалистов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияПоказателейПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияДиспетчера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияРабочегоКалендаря"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияРолейТрудовогоРесурса"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияРуководителяПодразделения"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияСоставаПодразделения"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияСотрудника"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияСтоимостиРесурса"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияСтоимостиРесурсов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияДиспетчера"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияФактическиВыполненногоОбъема"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияФактическихДвиженийДенежныхСредств"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияФактическихДопЗатрат"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияФактическихДоходовИРасходов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияФактическихЗатратМатРесурсов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРучнаяАктуализацияПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСинхронизацияФактическиВыполненныхОбъемов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСинхронизацияФактическихДвиженийДенежныхСредств"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСинхронизацияФактическихДоходовИРасходов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСмещениеВладельцаРесурсов"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСмещениеРолейТрудовогоРесурса"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСохранениеДанныхПроекта"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСтартПроектныхРабот"));
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоУтверждениеПланаПроекта"));
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ИсключаемыеТипы.Добавить(упоФункцииОбщегоНазначенияКлиентСервер.упоТип("ДокументСсылка.СчетНаОплатуКлиенту"));
	КонецЕсли;
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоЗаявкаНаПроект"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоИзменениеСтатусаДоговора"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоКопированиеЗадачВСводныйПроект"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРасчетИтоговогоБаллаПроектов"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияПоказателейЭффективностиПроекта"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоРегистрацияЮридическихУсловийДоговора"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСводныйСтатусОтчетПоПроектам"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСоответствиеСтратегическимЦелям"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоСтатусОтчетПоПроекту"));
		ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.упоФормированиеБизнесПлана"));
	КонецЕсли;
	
	ИспользуемыеТипы = упоФункцииОбщегоНазначенияСервер.ТипыМетаданных_УбратьНеиспользуемые(Метаданные.Документы);
	
	Возврат ОбщегоНазначенияКлиентСервер.РазностьМассивов(ИспользуемыеТипы, ИсключаемыеТипы);
	
КонецФункции

// Имена правил проектного бюджетирования подсистемы "Согласование трудозатрат".
// Используется для отдельного обновления правил подсистемы.
// 
// Возвращаемое значение:
//  Массив
//
Функция ПравилаПроектногоБюджетированияДляПодсистемыСогласованиеТрудозатрат() Экспорт
	
	ИменаПравил = Новый Массив();
	ИменаПравил.Добавить("ДоходыРасходы_СогласованныеТрудозатраты");
	ИменаПравил.Добавить("ДоходыРасходы_СогласованныеТрудозатратыПоСтатьямФОТ");
	
	Возврат ИменаПравил;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает использование набора свойств.
//
Процедура УстановитьПараметрыНабораСвойств(Знач Использование = Неопределено) Экспорт
	
	Если Использование = Неопределено Тогда 
		Использование = ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании");
	КонецЕсли;
	
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Документ_упоОтражениеФактаВПроектномБюджетировании", 
		Использование);
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Справочник_упоПравилаПолученияФактаДляПроектногоБюджетирования",
		Использование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыполнениеПравила

#Область КомпоновкаДанных

Функция РезультатВыполненияСКДТаблицаЗначений(СхемаКомпоновкиДанных, 
	Знач НастройкиКомпоновщика, 
	ВнешниеНаборыДанных = Неопределено) Экспорт
	
	РезультатВыполнения = Новый ТаблицаЗначений;
	
	УстановитьПривилегированныйРежим(Истина);
		
	НастройкиКД = НастройкиКомпоновщика;
	Если ТипЗнч(НастройкиКомпоновщика) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		НастройкиКД = НастройкиКомпоновщика.ПолучитьНастройки();
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
													НастройкиКД,
													,
													,
													Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, , Истина);
			
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(РезультатВыполнения);
	РезультатВыполнения = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатВыполнения;	
	
КонецФункции

Функция КомпоновщикНастроекСхемыКомпоновкиДанных(СхемаКомпоновкиДанных, НастройкиКомпоновки = Неопределено) Экспорт
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));	
	Если НастройкиКомпоновки = Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе	
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	КонецЕсли;	
	
	Возврат КомпоновщикНастроек;
	
КонецФункции

Функция ДобавитьОтборНастройкиКомпоновщика(НастройкиКомпоновщика, ИмяОтбора, ЗначениеОтбора, ВидСравнения)  Экспорт
	
	ЭлементОтбора = Неопределено;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	
	Для Каждого Элемент Из НастройкиКомпоновщика.Отбор.Элементы Цикл		
		Если НЕ ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") 
			И Элемент.ЛевоеЗначение = ПолеОтбора Тогда
			ЭлементОтбора = Элемент;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = НастройкиКомпоновщика.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
		
	ЭлементОтбора.ЛевоеЗначение		= ПолеОтбора;
	ЭлементОтбора.ВидСравнения		= ВидСравнения;
	ЭлементОтбора.ПравоеЗначение	= ЗначениеОтбора;
	ЭлементОтбора.Использование		= Истина;
	
	Возврат ЭлементОтбора;
	
КонецФункции

Процедура ДобавитьСуммовойРесурсСКД(СхемаКомпоновкиДанных, ПутьКДанным, ВыражениеПоля = "Неопределено")
	
	ДобавитьВычисляемоеПолеСКД(СхемаКомпоновкиДанных, ПутьКДанным, ВыражениеПоля);
				
	НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	НовыйРесурс.ПутьКДанным = ПутьКДанным;
	НовыйРесурс.Выражение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("СУММА(%1)", НовыйРесурс.ПутькДанным);
			
КонецПроцедуры

Процедура ДобавитьВычисляемоеПолеСКД(СхемаКомпоновкиДанных, ПутьКДанным, ВыражениеПоля, ТипЗначения = Неопределено)
	
	ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Добавить();
	
	ВычисляемоеПоле.ПутьКДанным = ПутьКДанным;
	ВычисляемоеПоле.Выражение = ВыражениеПоля;
	Если НЕ ТипЗначения = Неопределено Тогда
		ВычисляемоеПоле.ТипЗначения = ТипЗначения;
	КонецЕсли;
			
КонецПроцедуры

Процедура ДобавитьПараметрСКД(СхемаКомпоновкиДанных, ИмяПараметра, ЗначениеПараметра)
	
	Если СхемаКомпоновкиДанных.Параметры.Найти(ИмяПараметра) = Неопределено Тогда
		
		ЗначенияЗаполнения = Новый Структура("Имя, Значение, ВключатьВДоступныеПоля, Использование, ОграничениеИспользования", 
			ИмяПараметра,
			ЗначениеПараметра,
			ЗначениеПараметра = Неопределено,
			ИспользованиеПараметраКомпоновкиДанных.Всегда,
			Истина);
		
		НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйПараметр, ЗначенияЗаполнения);
						
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтборНаНулевыеРесурсы(НастройкиКомпоновщика)
	
	ДобавитьОтборНастройкиКомпоновщика(НастройкиКомпоновщика, "Сумма", Неопределено, ВидСравненияКомпоновкиДанных.Заполнено);

КонецПроцедуры

Процедура ДобавитьПоляОтбораПоПараметрам(НастройкиКомпоновщика, ИмяОтбора, ЗначенияОтбора)
	
	Если НЕ ЗначениеЗаполнено(ЗначенияОтбора) Тогда
		Возврат;
	КонецЕсли;	
	
	ВидСравненияОтбора = ?(ТипЗНЧ(ЗначенияОтбора) = Тип("Массив"),
		ВидСравненияКомпоновкиДанных.ВСписке, ВидСравненияКомпоновкиДанных.Равно);
	
	ДобавитьОтборНастройкиКомпоновщика(НастройкиКомпоновщика, ИмяОтбора, ЗначенияОтбора, ВидСравненияОтбора);
		
КонецПроцедуры	

Процедура ДобавитьПолеПорядкаНастройкиКомпоновщика(НастройкиКомпоновщика, ИмяПоляПорядка)
	
	НовоеПолеПорядка = НастройкиКомпоновщика.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных")); 
	НовоеПолеПорядка.Поле = Новый ПолеКомпоновкиДанных(ИмяПоляПорядка);
	НовоеПолеПорядка.Использование = Истина;
		
КонецПроцедуры	

Процедура ДобавитьПолеГруппировкиНастройкиКомпоновщика(НастройкиКомпоновщика, ИмяГруппировки)
	
	СтруктураНастройкиКомпоновщика = НастройкиКомпоновщика.Структура;
	
	Если СтруктураНастройкиКомпоновщика.Количество() = 0 Тогда		
		Группировка = СтруктураНастройкиКомпоновщика.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		Группировка.Имя = ИмяГруппировки;
		Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		Группировка.Использование = Истина;
	Иначе
		Группировка = СтруктураНастройкиКомпоновщика[0];
	КонецЕсли;
			
	ПолеГруппировки = Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));	
	Если ЗначениеЗаполнено(ИмяГруппировки) Тогда
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяГруппировки);
	КонецЕсли;
	ПолеГруппировки.Использование = Истина;
		
КонецПроцедуры

Процедура ОтключитьВыводОбщихИтоговНастройкиКомпоновщика(НастройкиКомпоновщика) 
		
	НастройкиКомпоновщика.ПараметрыВывода.УстановитьЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ГоризонтальноеРасположениеОбщихИтогов"), 
		РасположениеИтоговКомпоновкиДанных.Нет);
	НастройкиКомпоновщика.ПараметрыВывода.УстановитьЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных("ВертикальноеРасположениеОбщихИтогов"), 
		РасположениеИтоговКомпоновкиДанных.Нет);
				
КонецПроцедуры

#КонецОбласти

#Область ПолучениеФактическихДанныхПоСтатьеERP

Функция ПолучитьТаблицуФактаПоПравилуERP(Параметры)
	
	МодульБюджетированиеСервер = ОбщегоНазначения.ОбщийМодуль("БюджетированиеСервер");
	
	ПараметрыБюджетирования = МодульБюджетированиеСервер.ШаблонПараметровПолученияФакта();
	ДополнитьПараметрыБюджетирования(ПараметрыБюджетирования, Параметры);
	
	НовыйКомпоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	ФактПоСтатьямБюджетов = МодульБюджетированиеСервер.ФактПоСтатьямБюджетов(
		НовыйКомпоновщик.Настройки, ПараметрыБюджетирования, Ложь, Ложь);
	
	Возврат ФактПоСтатьямБюджетов;
	
КонецФункции

Функция СкопироватьНаборДанных(СхемаКомпоновкиДанных, ИсходныйНаборДанных, ИмяТаблицы, ИмяПоля)
	
	НовыйНабор = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НовыйНабор, ИсходныйНаборДанных);
	НовыйНабор.Имя = ИмяТаблицы;
	
	Для Каждого ПолеИсходногоНабора Из ИсходныйНаборДанных.Поля Цикл
		НовоеПоле = НовыйНабор.Поля.Добавить(ТипЗНЧ(ПолеИсходногоНабора));
		ЗаполнитьЗначенияСвойств(НовоеПоле, ПолеИсходногоНабора);				
		Если НовоеПоле.Поле <> "ПолеСвязи" Тогда
			НовоеПоле.ПутьКДанным = ИмяПоля;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НовыйНабор;
	
КонецФункции	

Функция ТипыЗамещаемыхАналитикERP()
	
	ТипыЗамещаемыхАналитик = Новый Соответствие;
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.СтруктураПредприятия"), "Подразделение1");
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.Партнеры"), "Контрагент1");
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.НаправленияДеятельности"), "ПроектнаяЗадача1");
	ТипыЗамещаемыхАналитик.Вставить(Тип("СправочникСсылка.Проекты"), "ПроектнаяЗадача2");
	ТипыЗамещаемыхАналитик.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов"), "Статья1");
	ТипыЗамещаемыхАналитик.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"), "Статья1");
	ТипыЗамещаемыхАналитик.Вставить(Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"), "Статья2");
	
	Возврат ТипыЗамещаемыхАналитик;
	
КонецФункции	

// Выполняет замену типов данных ERP на типы данных PM по макету таблицы меппинга.
//
// Параметры:
//  ТаблицаФакт  - Таблица значений - входящая таблица для автозамены.
//  НомераАналитик  - Соответствие - см. упоПроектноеБюджетированиеСервер.НомераАналитикСтатьиБюджета.
//  Правило  - СправочникСсылка.упоПравилаПроектногоБюджетирования - правило трансляции.
//
Процедура ВыполнитьАвтозаменуАналитикERP(ТаблицаФакт, НомераАналитик, Правило)
		
	КолонкиТаблицы = ТаблицаФакт.Колонки;
	
	// Автозамена имен расчетных колонок.
	КолонкиАвтозамены = Новый Соответствие;
	КолонкиАвтозамены.Вставить("СуммаВВалюте", "СуммаВалютная");
	КолонкиАвтозамены.Вставить("СуммаРегл", "Сумма");
	КолонкиАвтозамены.Вставить("ВалютаХранения", "Валюта");
	
	Для Каждого КолонкаАвтозамены Из КолонкиАвтозамены Цикл
		СуществующаяКолонка = КолонкиТаблицы.Найти(КолонкаАвтозамены.Значение);
		Если СуществующаяКолонка <> Неопределено Тогда
			КолонкиТаблицы.Удалить(СуществующаяКолонка);
		КонецЕсли;
		НайденнаяКолонка = КолонкиТаблицы.Найти(КолонкаАвтозамены.Ключ);
		Если НайденнаяКолонка <> Неопределено И КолонкиТаблицы.Найти(КолонкаАвтозамены.Значение) = Неопределено Тогда
			НайденнаяКолонка.Имя = КолонкаАвтозамены.Значение;
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыСЗаполнениемПоАналитике = Правило.СопоставлениеРеквизитов.НайтиСтроки(
		Новый Структура("СпособЗаполнения", Истина)); 
	Если РеквизитыСЗаполнениемПоАналитике.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск сопоставляемых реквизитов. 
	ТипыЗамещаемыхАналитик = ТипыЗамещаемыхАналитикERP();
	ТипыРеквизитовПравила = упоПроектноеБюджетированиеПовтИсп.ТипыЗначенийРеквизитовРазделаПравила(Правило.Раздел);
	
	ШаблонИмениАналитика = "Аналитика%1";
	АналитикиСопоставления = Новый Соответствие;
	Для Каждого РеквизитСЗаполнениемПоАналитике Из РеквизитыСЗаполнениемПоАналитике Цикл
		
		ИмяРеквизита = РеквизитСЗаполнениемПоАналитике.Реквизит; 
		Аналитика = РеквизитСЗаполнениемПоАналитике.ЗначениеЗаполнения;		
		Если НЕ ЗначениеЗаполнено(Аналитика) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТипЗначенияРеквизита Из ТипыРеквизитовПравила[ИмяРеквизита].Типы() Цикл
			
			ТипЗначенияАналитики = Аналитика.ТипЗначения;
			Если ТипЗначенияАналитики.СодержитТип(ТипЗначенияРеквизита) Тогда
				Продолжить;
			КонецЕсли;		
			
			Для Каждого ПростойТипЗначенияАналитики Из ТипЗначенияАналитики.Типы() Цикл
				
				ИмяТаблицыМеппинга = ТипыЗамещаемыхАналитик[ПростойТипЗначенияАналитики];
				Если ИмяТаблицыМеппинга <> Неопределено Тогда					
					ИмяАналитики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениАналитика, 
						НомераАналитик[Аналитика]);			
					ДанныеАналитики = Новый Структура("ИмяРеквизита, ИмяТаблицыМеппинга", 
						ИмяРеквизита, ИмяТаблицыМеппинга);
					АналитикиСопоставления.Вставить(ИмяАналитики, ДанныеАналитики);
				КонецЕсли;
				
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;	
	
	СхемаКомпоновкиДанных = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ПолучитьМакет("МеппингАналитикERP");
	ПоляНабораТаблицыФакт = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	ВыбранныеПоляСхемыКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы;
	
	Для Каждого КолонкаТаблицы Из КолонкиТаблицы Цикл		
		НовоеПоле = ПоляНабораТаблицыФакт.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));		
		НовоеПоле.Поле = КолонкаТаблицы.Имя;
		НовоеПоле.ПутьКДанным = КолонкаТаблицы.Имя;		
		Если АналитикиСопоставления[КолонкаТаблицы.Имя] = Неопределено Тогда
			НовоеПоле = ВыбранныеПоляСхемыКомпоновки.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));	
			НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(КолонкаТаблицы.Имя);
		КонецЕсли;			
	КонецЦикла;
		
	КомпоновщикНастроек = КомпоновщикНастроекСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);			
	ВыбранныеПоляНастроек = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	 	
	Для Каждого АналитикаСопоставления Из АналитикиСопоставления Цикл
				
		ИмяАналитики = АналитикаСопоставления.Ключ;									
		ИмяПоля = АналитикаСопоставления.Значение.ИмяТаблицыМеппинга;
		ИмяТаблицы = ИмяПоля + ИмяАналитики;			
		ИмяРеквизита = АналитикаСопоставления.Значение.ИмяРеквизита;
		
		СкопироватьНаборДанных(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НаборыДанных.Найти(ИмяПоля), ИмяТаблицы, ИмяРеквизита);
		
		НоваяСвязь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();						
		НоваяСвязь.НаборДанныхИсточник = "ТаблицаФакт";
		НоваяСвязь.НаборДанныхПриемник = ИмяТаблицы;
		НоваяСвязь.ВыражениеИсточник = ИмяАналитики;					
		НоваяСвязь.ВыражениеПриемник = "ПолеСвязи";
		
		ВыбранноеПолеКД = ВыбранныеПоляНастроек.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));													
		ВыбранноеПолеКД.Поле = Новый ПолеКомпоновкиДанных(ИмяРеквизита);
		
	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаФакт", ТаблицаФакт);
	ТаблицаФакт = РезультатВыполненияСКДТаблицаЗначений(СхемаКомпоновкиДанных, 
														КомпоновщикНастроек.Настройки, 
														ВнешниеНаборыДанных);
	
КонецПроцедуры // ()

// Возвращает реквизиты правила, подлежашие автозамене. 
Функция РеквизитыАвтозаменыПравилаПоСтатьямERP(Раздел)
	
	РеквизитыАвтозамены = Новый Соответствие;
	РеквизитыАвтозамены.Вставить("Подразделение", "СправочникСсылка.упоПодразделения");
	РеквизитыАвтозамены.Вставить("Контрагент", "СправочникСсылка.Контрагенты");
	РеквизитыАвтозамены.Вставить("ПроектнаяЗадача", "ДокументСсылка.упоПроектнаяЗадача");	
	Если Раздел = Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить("СправочникСсылка.упоСтатьиЗатрат");
		МассивТипов.Добавить("СправочникСсылка.упоСтатьиДоходов");
		РеквизитыАвтозамены.Вставить("Статья", МассивТипов);
	Иначе
		РеквизитыАвтозамены.Вставить("СтатьяДДС", "СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	КонецЕсли;	
			
	Возврат РеквизитыАвтозамены;
	
КонецФункции	

Процедура ДобавитьОбязательныеКолонкиТаблицыФакта(КолонкиТаблицы, РеквизитыАвтозамены, Раздел)
	
	Для Каждого РеквизитАвтозамены Из РеквизитыАвтозамены Цикл
		Если КолонкиТаблицы.Найти(РеквизитАвтозамены.Ключ) = Неопределено Тогда 
			КолонкиТаблицы.Добавить(РеквизитАвтозамены.Ключ, Новый ОписаниеТипов(РеквизитАвтозамены.Значение));
		КонецЕсли;	
	КонецЦикла;	
	
	Если Раздел = Перечисления.упоРазделыПравилПроектногоБюджетирования.ДДС Тогда	
		ИмяКолонки = "ДатаДвижения"; 
		Если КолонкиТаблицы.Найти(ИмяКолонки) = Неопределено Тогда
			КолонкиТаблицы.Добавить(ИмяКолонки, Новый ОписаниеТипов("Дата"));	
		КонецЕсли;
		ИмяКолонки = "НаправлениеДвижения"; 
		Если КолонкиТаблицы.Найти(ИмяКолонки) = Неопределено Тогда
			КолонкиТаблицы.Добавить(ИмяКолонки, Новый ОписаниеТипов("ПеречислениеСсылка.упоНаправлениеДвиженияДенежныхСредств"));	
		КонецЕсли;			
	Иначе 
		ИмяКолонки = "ВидЭлемента";
		Если КолонкиТаблицы.Найти(ИмяКолонки) = Неопределено Тогда
			КолонкиТаблицы.Добавить(ИмяКолонки, Новый ОписаниеТипов("ПеречислениеСсылка.упоВидЭлементаПланаДоходовИРасходов"));	
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры	

Функция ФактПоПравилуПоСтатьямБюджетовERP(Правило, Параметры)
		
	ПравилоПолученияФактаПоСтатьямБюджетов = Правило.ПравилоПолученияФактаПоСтатьямБюджетов;
	
	Параметры.Вставить("ПравилоПоСтатьямБюджетов", ПравилоПолученияФактаПоСтатьямБюджетов);
		
	НомераАналитик = НомераАналитикСтатьиБюджета(ПравилоПолученияФактаПоСтатьямБюджетов.СтатьяБюджетов);
	
	ТаблицаФакт = ПолучитьТаблицуФактаПоПравилуERP(Параметры);
	
	Если ТаблицаФакт.Количество() = 0 Тогда
		Возврат ТаблицаФакт;
	КонецЕсли;	
		
	ВыполнитьАвтозаменуАналитикERP(ТаблицаФакт, НомераАналитик, Правило);
	
	КолонкиТаблицы = ТаблицаФакт.Колонки;
	
	РеквизитыАвтозамены = РеквизитыАвтозаменыПравилаПоСтатьямERP(Правило.Раздел);
	
	ДобавитьОбязательныеКолонкиТаблицыФакта(КолонкиТаблицы, РеквизитыАвтозамены, Правило.Раздел);
					
	Для Каждого СтрокаСопоставления Из Правило.СопоставлениеРеквизитов Цикл
			
		Аналитика = СтрокаСопоставления.ЗначениеЗаполнения;		
		Если Не ЗначениеЗаполнено(Аналитика) Тогда
			Продолжить;
		КонецЕсли;	
		
		ЭтоРеквизитАвтозамены = РеквизитыАвтозамены.Получить(СтрокаСопоставления.Реквизит) <> Неопределено; 
		
		Если НЕ СтрокаСопоставления.СпособЗаполнения Тогда			
			Если КолонкиТаблицы.Найти(СтрокаСопоставления.Реквизит) = Неопределено Тогда
				КолонкиТаблицы.Добавить(СтрокаСопоставления.Реквизит);			
			КонецЕсли;	
			ТаблицаФакт.ЗаполнитьЗначения(Аналитика, СтрокаСопоставления.Реквизит);	
		Иначе					
			НомерАналитики = НомераАналитик[Аналитика];
			Если НомерАналитики <> Неопределено Тогда				
				ИмяАналитики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Аналитика%1", НомерАналитики);
				КолонкаТаблицы = КолонкиТаблицы.Найти(ИмяАналитики);
				Если КолонкаТаблицы <> Неопределено Тогда					
					ИмяКолонки = СтрокаСопоставления.Реквизит;
					Если ЭтоРеквизитАвтозамены Тогда
						ИмяКолонки  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1%2", ИмяКолонки, "0"); 
						// Суффикс "0" зарезервирован для полей с заполнением из реквизита.
					КонецЕсли;						
					КолонкаТаблицы.Имя = ИмяКолонки;												
				КонецЕсли;				
			КонецЕсли;			
		КонецЕсли;
		
	КонецЦикла;	
			
	Для Каждого СтрокаФакт Из ТаблицаФакт Цикл
					
		Для Каждого РеквизитАвтозамены Из РеквизитыАвтозамены Цикл						
			// Если ячейка автозамены не заполнена указанным значением - подбираем значение из вариантов по приоритетам.
			Если НЕ ЗначениеЗаполнено(СтрокаФакт[РеквизитАвтозамены.Ключ]) Тогда
				Для НомерАвтозамены = 0 По 2 Цикл
					ИмяКолонкиВарианта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1%2", РеквизитАвтозамены.Ключ, НомерАвтозамены);
					Если КолонкиТаблицы.Найти(ИмяКолонкиВарианта) <> Неопределено 
						И ЗначениеЗаполнено(СтрокаФакт[ИмяКолонкиВарианта]) Тогда
						СтрокаФакт[РеквизитАвтозамены.Ключ] = СтрокаФакт[ИмяКолонкиВарианта];
						Прервать;
					КонецЕсли;									
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;	
		
		Если Правило.Раздел = Перечисления.упоРазделыПравилПроектногоБюджетирования.ДДС Тогда						
			СтрокаФакт.ДатаДвижения = СтрокаФакт.Период;
			Если ЗначениеЗаполнено(СтрокаФакт.СтатьяДДС) Тогда
				СтрокаФакт.НаправлениеДвижения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФакт.СтатьяДДС, "упоНаправлениеДвижения");
			КонецЕсли;	
		Иначе
			Если ЗначениеЗаполнено(СтрокаФакт.Статья) И НЕ ЗначениеЗаполнено(СтрокаФакт.ВидЭлемента) Тогда
				СтрокаФакт.ВидЭлемента = ?(ТипЗНЧ(СтрокаФакт.Статья) = Тип("СправочникСсылка.упоСтатьиЗатрат"), 
					Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход, 
					Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход);
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ТаблицаФакт;
	
КонецФункции	

Процедура ДополнитьПараметрыБюджетирования(ПараметрыБюджетирования, ПараметрыЗаполнения)
	
	ПараметрыБюджетирования.Вставить("ВызовИзEPM", Истина);
	ПараметрыБюджетирования.Вставить("ОтборПоРегистраторам");
	ПараметрыБюджетирования.Вставить("ПравилоПоСтатьямБюджетов");
	ПараметрыБюджетирования.ПоРегистратору = Истина;
	ПараметрыБюджетирования.ВозвращатьУпрИРеглСуммы = Истина;
	// Зафиксировано в версии EPM 2.5.10.84, что параметр не используется. Оставлен для совместимости с EPM 2.5.8.
	ПараметрыБюджетирования.Вставить("ВозвращатьСуммуВВалюте", Ложь); 
	ПараметрыБюджетирования.РежимПолученияДанных = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
		"Перечисление.РежимПолученияДанныхБюджетирования.Все");
	
	ЗаполнитьЗначенияСвойств(ПараметрыБюджетирования, ПараметрыЗаполнения);
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = ПараметрыЗаполнения.НачалоПериода;
	Период.ДатаОкончания = ПараметрыЗаполнения.КонецПериода;
	ПараметрыБюджетирования.Вставить("Период", Период);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыБюджетирования.Периодичность) Тогда
		ПараметрыБюджетирования.Периодичность = упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
			"Перечисление.Периодичность.День");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция НастройкиКомпоновщикаПравилаСПроверкой(СхемаКомпоновкиДанных, Правило, ДокументОснование, ОшибкиПользователю, Отказ)
			
	НастройкиКомпоновщика = Неопределено;
	ТекстОшибки = "";
	
	Если СхемаКомпоновкиДанных.НаборыДанных.Количество() = 0 Тогда							
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Правило ""%1"": Пустая схема компоновки данных в источнике (нет наборов данных).'"),
			Правило); 			   																	
			
	Иначе		
		
		ПоляНабораДанных = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;						
		Если ПоляНабораДанных.Количество() = 0 Тогда //Пустая схема.
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Правило ""%1"": Пустая схема компоновки данных в источнике (нет полей в наборе данных).'"),
				Правило); 			   																					
			
		ИначеЕсли ПроверитьНаличиеОбязательныхПолейСКД(ПоляНабораДанных, Правило, ДокументОснование, ОшибкиПользователю) Тогда												
			
			Попытка								
				
				НастройкиКомпоновки = Правило.НастройкиКомпоновкиДанных.Получить();
				
				НастройкиКомпоновщика = КомпоновщикНастроекСхемыКомпоновкиДанных(СхемаКомпоновкиДанных, НастройкиКомпоновки).ПолучитьНастройки();			
				Отказ = Ложь;
				
			Исключение				
				
				ТекстОшибки = ОписаниеОшибки();					
				
			КонецПопытки;
			
		КонецЕсли;			
		
	КонецЕсли;	
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, "", ТекстОшибки, Правило);		
	КонецЕсли;	
	
	Возврат НастройкиКомпоновщика;
	
КонецФункции

Функция ПроверитьНаличиеОбязательныхПолейСКД(ПоляНабораДанных, Правило, ДокументОснование, ОшибкиПользователю)	
	
	Успешно = Истина;
	
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Период");
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ОбязательныеПоля.Добавить("Регистратор");
	КонецЕсли;	
	ОбязательныеПоля.Добавить("Сумма");
	
	ТекстОтсутствуетОбязательноеПоле = НСтр("ru = 'В схеме правила ""%1"" отсутствует обязательное поле ""%2"".'");
			
	Для Каждого ОбязательноеПоле Из ОбязательныеПоля Цикл 
		
		Если ПоляНабораДанных.Найти(ОбязательноеПоле) = Неопределено Тогда			
			
			Успешно = Ложь;
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОтсутствуетОбязательноеПоле, 
				Правило, ОбязательноеПоле); 				   														
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, "" , ТекстОшибки, Правило, , ТекстОшибки);
			
		КонецЕсли;
		
	КонецЦикла;	
		
	Возврат Успешно;
	
КонецФункции

Функция ПроверитьЗаполнениеПравила(Правило, ДокументОснование, ОшибкиПользователю)
	
	Успешно = ЗначениеЗаполнено(Правило);
	
	Если НЕ Успешно И ЗначениеЗаполнено(ДокументОснование) Тогда
																			
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для типа документов ""%1"" не найдено действующее правило отражения.'"), 
			ДокументОснование.Метаданные().Синоним); 	
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, "", ТекстОшибки, Правило);
					    	
	КонецЕсли;	
			
	Возврат Успешно;
	
КонецФункции

Процедура ЗаполнитьРеквизитыПравила(СхемаКомпоновкиДанных, НастройкиКомпоновщика, Правило)  
		
	КэшТиповРеквизитов = упоПроектноеБюджетированиеПовтИсп.ТипыЗначенийРеквизитовРазделаПравила(Правило.Раздел);
				
	ПустоеЗначение = Новый Массив;
	ПустоеЗначение.Добавить(Тип("Неопределено"));
	ПустоеЗначение.Добавить(Тип("Null"));
    ТипПустоеЗначение = Новый ОписаниеТипов(ПустоеЗначение);
			
	Для Каждого СтрокаРеквизита Из Правило.СопоставлениеРеквизитов Цикл
									
		Если НЕ СтрокаРеквизита.СпособЗаполнения Тогда			    				
			ИмяПараметра = СтрокаРеквизита.Реквизит;				
			ДобавитьПараметрСКД(СхемаКомпоновкиДанных, ИмяПараметра, СтрокаРеквизита.ЗначениеЗаполнения);
			Выражение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("&%1", ИмяПараметра);
		Иначе				
			Выражение = СтрокаРеквизита.ЗначениеЗаполнения;
		КонецЕсли;
		    		
		Если ЗначениеЗаполнено(Выражение) Тогда
			ТипЗначения = КэшТиповРеквизитов[СтрокаРеквизита.Реквизит];			
		Иначе
			ТипЗначения = ТипПустоеЗначение;			
			Выражение = ?(ЗначениеЗаполнено(СтрокаРеквизита.Реквизит), "НЕОПРЕДЕЛЕНО", "NULL")
		КонецЕсли;
				
		ДобавитьВычисляемоеПолеСКД(СхемаКомпоновкиДанных, СтрокаРеквизита.Реквизит, Выражение, ТипЗначения);  
				
		ДобавитьПолеГруппировкиНастройкиКомпоновщика(НастройкиКомпоновщика, СтрокаРеквизита.Реквизит); 
				
	КонецЦикла;			
	
КонецПроцедуры

Процедура ЗаполнитьРесурсыПравила(СхемаКомпоновкиДанных, НастройкиКомпоновщика, Правило)
	
	ЕстьКоличество = Правило.Раздел = Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы;
	
	ПоляРесурсов = Новый Массив;
	ПоляРесурсов.Добавить("Сумма");
	
	ПоляНабора = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;
	Если ПоляНабора.Найти("СуммаВалютная") <> Неопределено Тогда
		ПоляРесурсов.Добавить("СуммаВалютная");
	КонецЕсли;		
	Если ЕстьКоличество И ПоляНабора.Найти("Количество") <> Неопределено Тогда
		ПоляРесурсов.Добавить("Количество");
	КонецЕсли;	
			
	Для каждого ИмяПоля Из ПоляРесурсов Цикл					
		
		ДобавитьСуммовойРесурсСКД(СхемаКомпоновкиДанных, ИмяПоля, ИмяПоля);
				
		ВыбранноеПолеКД = НастройкиКомпоновщика.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКД.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			
	КонецЦикла;
		
КонецПроцедуры	

Процедура УстановитьОтборПоПериоду(СхемаКомпоновкиДанных, НастройкиКомпоновщика, Параметры)
	
	ПоляПериода = Новый Массив;
	ПоляПериода.Добавить("НачалоПериода");
	ПоляПериода.Добавить("КонецПериода");
		
	Для Каждого ПолеПериода Из ПоляПериода Цикл
		Если Параметры.Свойство(ПолеПериода) И ЗначениеЗаполнено(Параметры[ПолеПериода]) Тогда 			
			Если СхемаКомпоновкиДанных.Параметры.Найти(ПолеПериода) <> Неопределено Тогда					
				НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра(
					Новый ПараметрКомпоновкиДанных(ПолеПериода), 
					Параметры[ПолеПериода]); 				
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры			

Процедура УстановитьОтборИзНастройки(СхемаПриемник, НастройкиПриемник, НастройкиИсточник)
	
	ЭлементыОтбораИсточник = НастройкиИсточник.Отбор.Элементы;
	ЭлементыОтбораПриемник = НастройкиПриемник.Отбор.Элементы;
	
	Для Каждого ЭлементОтбораИсточник Из ЭлементыОтбораИсточник Цикл
		Если ТипЗнч(ЭлементОтбораИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда			
			ДобавитьВОтборГруппуЭлементовРекурсивно(НастройкиПриемник.Отбор, ЭлементОтбораИсточник);		    		
		Иначе			
			ЗаполнитьЗначенияСвойств(ЭлементыОтбораПриемник.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")), 
				ЭлементОтбораИсточник);							
		КонецЕсли;
		
	КонецЦикла;
	
	// Нужно исправить настройки приемника, т.к. в отборе источника могут быть поля, которые недоступны в приемнике.
	// Восстановление настроек так же убирает поля, на которые нет прав на просмотр, чтобы этого не происходило
	// устанавливаем привилегированный режим.
	УстановитьПривилегированныйРежим(Истина);
	КомпоновщикНастроекЗапроса = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекЗапроса.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаПриемник));
	КомпоновщикНастроекЗапроса.ЗагрузитьНастройки(НастройкиПриемник);
	КомпоновщикНастроекЗапроса.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	НастройкиПриемник = КомпоновщикНастроекЗапроса.ПолучитьНастройки();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ДобавитьВОтборГруппуЭлементовРекурсивно(ОтборПриемник, ГруппаОтбораИсточник)
	
	НоваяГруппаПриемник = ОтборПриемник.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НоваяГруппаПриемник, ГруппаОтбораИсточник);
	
	Для Каждого ЭлементОтбораИсточник Из ГруппаОтбораИсточник.Элементы Цикл
		Если ТипЗнч(ЭлементОтбораИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ДобавитьВОтборГруппуЭлементовРекурсивно(НоваяГруппаПриемник, ЭлементОтбораИсточник);
		Иначе			
			ЗаполнитьЗначенияСвойств(НоваяГруппаПриемник.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")),
				ЭлементОтбораИсточник);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОтражениеПервичныхДокументов

// Выполняет отражение первичных документов, находящихся в очереди к отражению.
// Является методом регламентного задания упоОтражениеДокументовВПроектномБюджетировании.
//
Функция ВыполнитьОтражениеДокументов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.упоОтражениеДокументовВПроектномБюджетировании);
	
	ИдентификаторОчереди = Новый УникальныйИдентификатор;
	МенеджерОтражения = Документы.упоОтражениеФактаВПроектномБюджетировании; 
	
	СтатусыОтражения = упоПроектноеБюджетированиеПовтИсп.СтатусыОтражения("ОшибкиОтражения");
	СтатусыОтражения.Добавить(Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.КОтражению);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 100
	                      |	упоОчередьДокументовКОтражениюВПроектномБюджетировании.Документ КАК Документ
	                      |ИЗ
	                      |	РегистрСведений.упоОчередьДокументовКОтражениюВПроектномБюджетировании КАК упоОчередьДокументовКОтражениюВПроектномБюджетировании
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоОтражениеДокументовВПроектномБюджетировании КАК упоОтражениеДокументовВПроектномБюджетировании
	                      |		ПО упоОчередьДокументовКОтражениюВПроектномБюджетировании.Документ = упоОтражениеДокументовВПроектномБюджетировании.Документ
	                      |			И (упоОтражениеДокументовВПроектномБюджетировании.Статус В (&Статус))
	                      |			И (упоОчередьДокументовКОтражениюВПроектномБюджетировании.ИдентификаторЗаписи <> &ИдентификаторОчереди)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	упоОчередьДокументовКОтражениюВПроектномБюджетировании.ПериодЗаписи");
	Запрос.УстановитьПараметр("Статус", СтатусыОтражения);
	Запрос.УстановитьПараметр("ИдентификаторОчереди", ИдентификаторОчереди);
	
	ЕстьДокументы = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока ЕстьДокументы Цикл
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ЕстьДокументы = Ложь;
		Иначе
			Выборка = Результат.Выбрать();
			
			ОбщееКоличествоДокументов = Выборка.Количество();
			ОбработаноДокументов = 0;
			ПредыдущийПроцент = 0;
			
			Пока Выборка.Следующий() Цикл
				
				НачатьТранзакцию();
				
				Блокировка = Новый БлокировкаДанных;
				ИмяДокумента = Выборка.Документ.Метаданные().Имя;
				ЭлементБлокировки = Блокировка.Добавить("Документ." + ИмяДокумента);
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Документ); 
				Блокировка.Заблокировать();
				
				Попытка
					
					МенеджерОтражения.СоздатьЗаполнитьДокументОтражение(Выборка.Документ,,,ИдентификаторОчереди);
					
					ЗафиксироватьТранзакцию();
					
				Исключение
					
					ОтменитьТранзакцию();
					
					Текст = НСтр("ru = 'Ошибка при создании документа отражение: '") 
							+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписьЖурналаРегистрации(ИмяСобытияОтражениеДляЖР(), 
						УровеньЖурналаРегистрации.Ошибка,
						,
						, 
						Текст);
				КонецПопытки;
				
				ОбработаноДокументов = ОбработаноДокументов + 1;
				Процент = Окр(ОбработаноДокументов / ОбщееКоличествоДокументов * 100);
				ПроцентКратен = (Процент % 3) = 0; 	// Выбрана кратность 3% с целью уменьшить количество обращений для
													// сообщения прогресса (Рекомендация 1С - не более 100 за одну операцию).
													// При этом, у 3 достаточное количество делимых, чтобы отображать прогресс
													// при разном количестве документов с удовлетворительной частотой.
				Если Не (ПредыдущийПроцент = Процент)
					И ПроцентКратен Тогда
					ТекстПрогресса = НСтр("ru = 'Обрабатывается документ: '") + Выборка.Документ;
					ДлительныеОперации.СообщитьПрогресс(Процент, ТекстПрогресса); 
					ПредыдущийПроцент = Процент;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбновитьСтатусОтраженияДокумента(Документ, Статус = Неопределено, Очистить = Ложь)
			
	НЗ = РегистрыСведений.упоОтражениеДокументовВПроектномБюджетировании.СоздатьНаборЗаписей();	
	НЗ.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
	НЗ.Отбор.Документ.Установить(Документ);
	НЗ.Прочитать();
													
	Если НЗ.Количество() > 0 Тогда
		НЗ.Очистить();
	КонецЕсли;	
	
	Если НЕ Очистить Тогда
		Запись = НЗ.Добавить();
		Запись.Документ = Документ;
		Запись.Статус = Статус; 			
	КонецЕсли;	
	
	Если НЗ.Модифицированность() Тогда
		НЗ.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьОчередьДокументовКОтражению(Документ, Очистить = Ложь, ИдентификаторЗаписи = Неопределено)
	
	НЗ = РегистрыСведений.упоОчередьДокументовКОтражениюВПроектномБюджетировании.СоздатьНаборЗаписей();	
	НЗ.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
	НЗ.Отбор.Документ.Установить(Документ);
	НЗ.Прочитать();
													
	Если НЗ.Количество() > 0 Тогда
		НЗ.Очистить();
	КонецЕсли;	
	
	Если НЕ Очистить Тогда
		Запись = НЗ.Добавить();
		Запись.Документ = Документ;
		Запись.ПериодЗаписи = ПериодЗаписиДокумента(Документ);
		Если ЗначениеЗаполнено(ИдентификаторЗаписи) Тогда
			Запись.ИдентификаторЗаписи = ИдентификаторЗаписи;	 			
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЗ.Модифицированность() Тогда
		НЗ.Записать();
	КонецЕсли;	
	
	//
	//
	// Запись = РегистрыСведений.упоОчередьДокументовКОтражениюВПроектномБюджетировании.СоздатьМенеджерЗаписи();
	//// Запись.ДополнительныеСвойства.Вставить("упоИгнорироватьОповещения", Истина);
	// Запись.Документ = Документ;	    	
	// Запись.Прочитать();
	//
	// Если Очистить Тогда			
	//	Если Запись.Выбран() Тогда
	//		Запись.Удалить();
	//	КонецЕсли;	
	// Иначе		
	//	Если НЕ ЗначениеЗаполнено(ИдентификаторЗаписи) Тогда
	//		ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	//	КонецЕсли;			
	//	Запись.Документ = Документ;
	//	Запись.ПериодЗаписи = ПериодЗаписиДокумента(Документ);
	//	Запись.ИдентификаторЗаписи = ИдентификаторЗаписи;			
	//	Запись.Записать();		
	// КонецЕсли;			
	
КонецПроцедуры		

Функция ПериодЗаписиДокумента(ДокументОснование) Экспорт 
	
	// Упрощенный случай, когда период движений определяется датой документа; впоследствии разделить типам источника.
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");
	//Возврат ДокументОснование.Дата;
	
КонецФункции	

Функция ДокументКонтураПроектнойЭкономики(Документ)
	
	Возврат Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ЕстьПравилоДляДокумента(Документ);
	
КонецФункции	

Функция ДокументИспользовалсяВКонтуреПроектнойЭкономики(Документ)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК Использование
	               |ИЗ
	               |	РегистрСведений.упоОчередьДокументовКОтражениюВПроектномБюджетировании КАК упоОчередьДокументовКОтражениюВПроектномБюджетировании
	               |ГДЕ
	               |	упоОчередьДокументовКОтражениюВПроектномБюджетировании.Документ = &Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА
	               |ИЗ
	               |	РегистрСведений.упоОшибкиОтраженияДокументовВПроектномБюджетировании КАК упоОшибкиОтраженияДокументовВПроектномБюджетировании
	               |ГДЕ
	               |	упоОшибкиОтраженияДокументовВПроектномБюджетировании.Документ = &Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА
	               |ИЗ
	               |	РегистрСведений.упоОтражениеДокументовВПроектномБюджетировании КАК упоОтражениеДокументовВПроектномБюджетировании
	               |ГДЕ
	               |	упоОтражениеДокументовВПроектномБюджетировании.Документ = &Документ";		
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ОтменитьПроведениеСвязанногоДокументаОтражение(ДокументОснование)

	ДокументОтражение = Документы.упоОтражениеФактаВПроектномБюджетировании.ДокументОтражениеПоДокументуОснованию(ДокументОснование);
	Если ЗначениеЗаполнено(ДокументОтражение) И ДокументОтражение.Проведен Тогда
		ДокументОтражениеОбъект = ДокументОтражение.ПолучитьОбъект();
		ДокументОтражениеОбъект.ДополнительныеСвойства.Вставить("ОтменаПроведенияПоПервичномуДокументу", Истина);
		ДокументОтражениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);		
	КонецЕсли;		

КонецПроцедуры // ()

// Удаляет первичный документ из очереди к отражению, удаляет статус отражения документа, 
// очищает историю ошибок отражения.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка - первичный документ.
//
Процедура УдалитьПервичныйДокументИзОчередиКОтражению(ДокументСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Очистить = Истина;		
	ОбновитьСтатусОтраженияДокумента(ДокументСсылка, , Очистить);
	ОбновитьОчередьДокументовКОтражению(ДокументСсылка, Очистить);	
	ОбновитьОшибкиОтраженияДокумента(ДокументСсылка);
	
	ОтменитьПроведениеСвязанногоДокументаОтражение(ДокументСсылка);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

Процедура ПроверитьУстановитьПометкуУдаления(ПервичныйДокумент, ПометкаУдаления)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПометкаУдаления", ПометкаУдаления);
	ПараметрыОтбора.Вставить("ТекстОтбора", " И Не ДокументОтражения.ПометкаУдаления = &ПометкаУдаления");
	
	ДокументОтражения = Документы.упоОтражениеФактаВПроектномБюджетировании.
		ДокументОтражениеПоДокументуОснованию(ПервичныйДокумент, ПараметрыОтбора);
		
	Если ЗначениеЗаполнено(ДокументОтражения) Тогда
		ДокументОбъект = ДокументОтражения.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяСобытияОтражениеДляЖР()
	
	ИмяСобытия = НСтр("ru = 'Отражение первичных документов в проектном бюджетировании'");
	
	Возврат ИмяСобытия;
	
КонецФункции

#КонецОбласти

#Область РаспределениеПоПлановымДанным

Процедура РезультатПравилаРаспределитьПоПлановымДанным(Правило, ТаблицаДанных)
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, 
			"РаспределятьПоПлану, РаспределятьПоРасходам, Раздел");
	
	Если Не Реквизиты.РаспределятьПоПлану Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Реквизиты.Раздел = 
		Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы Тогда
		Возврат;
	КонецЕсли;	
			
	ПоляАналитикиБазы = ПоляАналитикиБазыРаспределения(Правило, Реквизиты.РаспределятьПоРасходам);
	Если ПоляАналитикиБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	КолонкиДанных = ТаблицаДанных.Колонки;
	// Дополнение колонок источника отсутствующими полями аналитики.
	Для Каждого ПолеАналитики Из ПоляАналитикиБазы Цикл
		Если КолонкиДанных.Найти(ПолеАналитики) = Неопределено Тогда
			КолонкиДанных.Добавить(ПолеАналитики);	
		КонецЕсли;	
	КонецЦикла;		
	
	ПоляОтбораБазы = Новый Массив;
	Если КолонкиДанных.Найти("ПроектнаяЗадача") <> Неопределено Тогда
		ПоляОтбораБазы.Добавить("ПроектнаяЗадача");
	КонецЕсли;
	
	ЕстьКолонкаСуммаУпр = ТаблицаДанных.Колонки.Найти("СуммаУпр") <> Неопределено;
	ЕстьКолонкаСуммаВалютная = ТаблицаДанных.Колонки.Найти("СуммаВалютная") <> Неопределено;
	ЕстьКолонкаКоличество = ТаблицаДанных.Колонки.Найти("Количество") <> Неопределено;

	ПоляРаспределенияДанных = Новый Массив;
	ПоляРаспределенияДанных.Добавить("Сумма");
	Если ЕстьКолонкаКоличество Тогда
		ПоляРаспределенияДанных.Добавить("Количество");
	КонецЕсли;
	Если ЕстьКолонкаСуммаУпр Тогда
		ПоляРаспределенияДанных.Добавить("СуммаУпр");
	КонецЕсли;
	Если ЕстьКолонкаСуммаВалютная Тогда
		ПоляРаспределенияДанных.Добавить("СуммаВалютная");
	КонецЕсли;
	
	Если ЕстьКолонкаСуммаУпр Тогда
		МеппингПолей = Новый Структура("Сумма, СуммаВалютная", "СуммаУпр", "Сумма");
	ИначеЕсли ЕстьКолонкаСуммаВалютная Тогда
		МеппингПолей = Новый Структура("Сумма, СуммаВалютная", "Сумма", "СуммаВалютная");
	Иначе
		МеппингПолей = Новый Структура("Сумма", "Сумма");
	КонецЕсли;

	МеппингПолей = упоДоходыИРасходыСервер.МеппингПолейИсточникаПоУмолчанию(МеппингПолей);	
		
	МассивЗадач = Новый Массив;	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		ПроектнаяЗадачаСтроки = СтрокаДанных[МеппингПолей.ПроектнаяЗадача];
		Если Не ЗначениеЗаполнено(ПроектнаяЗадачаСтроки) Тогда 
			Продолжить;
		КонецЕсли;				
		Если МассивЗадач.Найти(ПроектнаяЗадачаСтроки) = Неопределено Тогда 
			МассивЗадач.Добавить(ПроектнаяЗадачаСтроки);
		КонецЕсли;	
	КонецЦикла;		
	Если МассивЗадач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	БазаРаспределения = ПодготовитьБазуРаспределения(МассивЗадач, 
															ПоляОтбораБазы, 
															ПоляАналитикиБазы, 
															Реквизиты.РаспределятьПоРасходам);	
	Если БазаРаспределения = Неопределено Тогда
		Возврат;
	КонецЕсли;	
			
	упоДоходыИРасходыСервер.РаспределитьТаблицуДанныхПоБазе(ТаблицаДанных, 
															БазаРаспределения, 
															ПоляОтбораБазы, 
															ПоляАналитикиБазы, 
															ПоляРаспределенияДанных, 
															МеппингПолей);
		
КонецПроцедуры

Функция ПодготовитьБазуРаспределения(МассивЗадач, ПоляОтбораБазы, ПоляАналитикиБазы, РаспределятьПоРасходам)
					
	ДоходРасход = ?(РаспределятьПоРасходам, "Расход", "Доход");
	НастройкиОбработкиЗадач = упоДоходыИРасходыСервер.НастройкиОбработкиЗадачПоУмолчанию();
	
	// 1. План доходов/расходов по задачам.
	БазаРаспределения = упоДоходыИРасходыСервер.БазаРаспределения_ДоходыРасходыБезНДС(МассивЗадач, 
																					ПоляОтбораБазы, 
																					ПоляАналитикиБазы,
																					ДоходРасход, 
																					НастройкиОбработкиЗадач);
																				
	// 2. План доходных/расходов объемов по задачам.																			
	Если БазаРаспределения = Неопределено Тогда
		БазаРаспределения = упоДоходыИРасходыСервер.БазаРаспределения_ОбъемыБезНДС(МассивЗадач, 
																					ПоляОтбораБазы, 
																					ПоляАналитикиБазы, 
																					ДоходРасход, 
																					НастройкиОбработкиЗадач);
	КонецЕсли;
	
	// Получение данных по вложенным задачам.
	// 3.  План доходов/расходов по вложенным задачам.
	Если БазаРаспределения = Неопределено Тогда	
		МассивЗадачЗеркала = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(МассивЗадач);
					
		НастройкиОбработкиЗадач.ПроектнаяЗадачаКакСправочник = Истина;
		НастройкиОбработкиЗадач.ПолучитьДанныеВложенныхЗадач = Истина;
		НастройкиОбработкиЗадач.ВернутьПЗКакДокумент = Истина;
		
		БазаРаспределения = упоДоходыИРасходыСервер.БазаРаспределения_ДоходыРасходыБезНДС(МассивЗадачЗеркала, 
																					ПоляОтбораБазы, 
																					ПоляАналитикиБазы,
																					ДоходРасход,
																					НастройкиОбработкиЗадач);
	КонецЕсли;																				
	// 4.  План доходных/расходных объемов по вложенным задачам.
	Если БазаРаспределения = Неопределено Тогда
		БазаРаспределения = упоДоходыИРасходыСервер.БазаРаспределения_ОбъемыБезНДС(МассивЗадачЗеркала, 
																					ПоляОтбораБазы, 
																					ПоляАналитикиБазы,
																					ДоходРасход,
																					НастройкиОбработкиЗадач);
	КонецЕсли;	

	Возврат БазаРаспределения;
	
КонецФункции // ()

Функция ПоляАналитикиБазыРаспределения(Правило, РаспределятьПоРасходам)
			
	// Если заполняется факт расходов, а база распределения - доходы (и наоборот),
	// то из полей исключаем статью (разные типы).		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Правило);
	Запрос.УстановитьПараметр("ИсключаемаяАналитикаДоходовРасходов", ИсключаемаяАналитикаДоходовРасходов());
	ВидЭлемента = ?(РаспределятьПоРасходам, 
					Перечисления.упоВидЭлементаПланаДоходовИРасходов.Доход,
					Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход);
	Запрос.УстановитьПараметр("ВидЭлемента", ВидЭлемента);					
						
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СопоставлениеРеквизитов.Реквизит КАК Реквизит,
	               |	СопоставлениеРеквизитов.ЗначениеЗаполнения КАК ЗначениеЗаполнения,
	               |	СопоставлениеРеквизитов.ЗаполнятьПоРаспределению КАК ЗаполнятьПоРаспределению
	               |ПОМЕСТИТЬ втРеквизитыПравила
	               |ИЗ
	               |	Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования.СопоставлениеРеквизитов КАК СопоставлениеРеквизитов
	               |ГДЕ
	               |	СопоставлениеРеквизитов.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Реквизит
	               |ПОМЕСТИТЬ втИсключаемыеПоляАналитикиДоходовРасходов
	               |ИЗ
	               |	втРеквизитыПравила КАК втРеквизитыПравила
	               |ГДЕ
	               |	втРеквизитыПравила.Реквизит = ""ВидЭлемента""
	               |	И втРеквизитыПравила.ЗначениеЗаполнения = &ВидЭлемента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втРеквизитыПравила.Реквизит КАК Реквизит
	               |ИЗ
	               |	втРеквизитыПравила КАК втРеквизитыПравила
	               |ГДЕ
	               |	втРеквизитыПравила.ЗаполнятьПоРаспределению
	               |	И ВЫБОР
	               |			КОГДА ИСТИНА В
	               |					(ВЫБРАТЬ
	               |						втИсключаемыеПоляАналитикиДоходовРасходов.Реквизит КАК Реквизит
	               |					ИЗ
	               |						втИсключаемыеПоляАналитикиДоходовРасходов КАК втИсключаемыеПоляАналитикиДоходовРасходов)
	               |				ТОГДА НЕ втРеквизитыПравила.Реквизит В (&ИсключаемаяАналитикаДоходовРасходов)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	ПоляАналитикиБазы = Результат.Выгрузить().ВыгрузитьКолонку("Реквизит");

	Возврат ПоляАналитикиБазы;
	
КонецФункции	

Функция ИсключаемаяАналитикаДоходовРасходов()

	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить("Статья");	
		
	Возврат МассивЗначений;

КонецФункции // ()

#КонецОбласти

#Область ОбновлениеПредустановленныхПравил

// Обновление существующего или создание нового правила получения факта.
// Запись правила происходит в режиме обновления ИБ.
//
// Параметры:
//  ОписаниеПравила - Структура - заданное описание правила.
//  ПравилаПолученияФактаИБ - ТаблицаЗначений - описания сохраненных элементов правил из ИБ.
//
Процедура СоздатьОбновитьПравилоПолученияФакта(ОписаниеПравила, ПравилаПолученияФактаИБ)
	
	ИмяМакета 		= ОписаниеПравила.ИмяМакета;
	Раздел 			= ОписаниеПравила.Раздел;
	ТипыДокументов 	= ОписаниеПравила.ТипыДокументов;
	
	МенеджерПравила = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования;
	
	СтрокаСНайденнымЭлементом = ПравилаПолученияФактаИБ.Найти(ИмяМакета, "ПредустановленныйКод");
	Если СтрокаСНайденнымЭлементом <> Неопределено Тогда
		ПравилоОбъект = СтрокаСНайденнымЭлементом.Ссылка.ПолучитьОбъект();
		// Для существующих элементов сохраняем пользовательский признак отключения.
		ОписаниеПравила.Вставить("ОтключитьПравило", ПравилоОбъект.ОтключитьПравило);
	Иначе
		ПравилоОбъект = МенеджерПравила.СоздатьЭлемент();
	КонецЕсли;
	
	//
	ПравилоОбъект.Заполнить(Неопределено);
	
	ПравилоОбъект.Раздел = Раздел;
	ПравилоОбъект.ТипПравила = Перечисления.упоТипыПравилПроектногоБюджетирования.ПроизвольныйЗапрос;
	ПравилоОбъект.ФормироватьНаименованиеАвтоматически = Ложь;
	ПравилоОбъект.ПредустановленныйКод = ИмяМакета;
	
	ЗаполнитьЗначенияСвойств(ПравилоОбъект, ОписаниеПравила);
	
	СхемаКомпоновкиДанных = МенеджерПравила.ПолучитьМакет(ИмяМакета);
	
	ЗаполнитьТипыДокументаПравила(ПравилоОбъект, ТипыДокументов);
	
	УстановитьИндивидуальныеНастройкиПравила(ПравилоОбъект, СхемаКомпоновкиДанных);
	
	ЗаполнитьСопоставлениеРеквизитовПравила(ПравилоОбъект, СхемаКомпоновкиДанных);
	ЗаполнитьСхемуИНастройкиКомпоновкиПравила(ПравилоОбъект, СхемаКомпоновкиДанных);
	
	//
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПравилоОбъект, ,Истина);
	
КонецПроцедуры

Процедура ЗаполнитьВалютуПравилаВСопоставленииРеквизитов(Правило)
	
	// Заполнение валюты: при отключенном многовалютном учете в СКД недоступен 
	// справочник Валюты и реквизит надо заполнять из константы.
	
	СопоставлениеРеквизитов = Правило.СопоставлениеРеквизитов;
	СтрокаВалюта = СопоставлениеРеквизитов.Найти("Валюта", "Реквизит");
	Если СтрокаВалюта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВалютуИзКонстанты = Истина;
	Если ЗначениеЗаполнено(СтрокаВалюта.ЗначениеЗаполнения) Тогда
		МноговалютныйУчет = упоИнтеграция.ИспользуетсяМноговалютныйУчет();
		Если МноговалютныйУчет Тогда
			ЗаполнитьВалютуИзКонстанты = Ложь;
		Иначе
			СтрокаВалюта.ЗначениеЗаполнения = "";
			СтрокаВалюта.СпособЗаполнения = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнитьВалютуИзКонстанты Тогда
		Валюта = ПараметрыСеанса.упоВалютаУправленческогоУчета;
		СтрокаВалюта.ЗначениеЗаполнения = Валюта;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуИНастройкиКомпоновкиПравила(Правило, СхемаКомпоновкиДанных)
	
	Правило.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	Правило.НастройкиКомпоновкиДанных = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

Процедура ЗаполнитьСопоставлениеРеквизитовПравила(Правило, СхемаКомпоновкиДанных)
	
	СопоставлениеРеквизитов = Правило.СопоставлениеРеквизитов;
	НаборыРеквизитовРазделов = ШаблонРеквизитовРазделов(Правило.Раздел);
	
	СопоставлениеРеквизитов.Очистить();
	
	Для Каждого РеквизитРаздела Из НаборыРеквизитовРазделов Цикл
		НоваяСтрока = СопоставлениеРеквизитов.Добавить();
		НоваяСтрока.Реквизит = РеквизитРаздела.ИмяРеквизита;
	КонецЦикла;
	
	ЗаполнитьСопоставлениеРеквизитовРазделаАвтоматически(Правило, СхемаКомпоновкиДанных);
	
	ЗаполнитьВалютуПравилаВСопоставленииРеквизитов(Правило);
	
КонецПроцедуры

Процедура ЗаполнитьТипыДокументаПравила(Правило, ТипыДокументов)
	
	МетаданныеДокументы = Метаданные.Документы;
	ТипыДокументовПравила = Правило.ТипыДокументов;
	
	ТипыДокументовПравила.Очистить();
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		НоваяСтрока = ТипыДокументовПравила.Добавить();
		НоваяСтрока.ТипДокумента = ТипДокумента;
		НоваяСтрока.ТипДокументаСиноним = МетаданныеДокументы[ТипДокумента].Синоним;
	КонецЦикла;
	
КонецПроцедуры

// Установка индивидуальных настроек правила (преимущественно отборов).
//
// Параметры:
//  Правило					 - СправочникОбъект.упоПравилаПолученияФактаДляПроектногоБюджетирования - правило для модификации.
//  СхемаКомпоновкиДанных	 - СхемаКомпоновкиДанных - СКД правила для модификации.
//
Процедура УстановитьИндивидуальныеНастройкиПравила(Правило, СхемаКомпоновкиДанных)
	
	СоздатьОбновитьПравилоУПФ_РасходыУслугиНЗП(Правило, СхемаКомпоновкиДанных);
	
КонецПроцедуры

Процедура СоздатьОбновитьПравилоУПФ_РасходыУслугиНЗП (Правило, СхемаКомпоновки)
	
	Если НЕ Правило.ПредустановленныйКод = "УПФ_РасходыУслугиНЗП" Тогда 
		Возврат;
	КонецЕсли;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("СчетУчета.ТипСчета");
	
	ЭлементыОтбора = СхемаКомпоновки.НастройкиПоУмолчанию.Отбор.Элементы;
	ЭлементыОтбора.Очистить();
	
	ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ТипыСчетов.НезавершенноеПроизводство");
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
	
КонецПроцедуры

Функция ШаблонРеквизитовРазделов(Раздел)
	
	ИмяРаздела = упоПроектноеБюджетированиеСервер.ИмяПеречисленияПоЗначению(Раздел);
	
	МетаданныеДокументаОтражения = Метаданные.Документы.упоОтражениеФактаВПроектномБюджетировании;
	РеквизитыРаздела = МетаданныеДокументаОтражения.ТабличныеЧасти[ИмяРаздела].Реквизиты;
	
	ТипыРеквизитов = Новый ТаблицаЗначений;
	ТипыРеквизитов.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	ТипыРеквизитов.Колонки.Добавить("ТипРеквизита", Новый ОписаниеТипов("ОписаниеТипов"));
	
	МассивРеквизитыИсключить = Новый Массив;
	МассивРеквизитыИсключить.Добавить("Период");
	МассивРеквизитыИсключить.Добавить("Регистратор");
	МассивРеквизитыИсключить.Добавить("ПравилоОтражения");
	МассивРеквизитыИсключить.Добавить("Сумма");
	МассивРеквизитыИсключить.Добавить("СуммаВалютная");
	
	Если Раздел = Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы Тогда
		МассивРеквизитыИсключить.Добавить("Количество");
	КонецЕсли;
	
	Для Каждого РеквизитРаздела Из РеквизитыРаздела Цикл
		Если МассивРеквизитыИсключить.Найти(РеквизитРаздела.Имя) = Неопределено Тогда
			НоваяСтрока = ТипыРеквизитов.Добавить();
			НоваяСтрока.ИмяРеквизита = РеквизитРаздела.Имя;
			НоваяСтрока.ТипРеквизита = РеквизитРаздела.Тип;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТипыРеквизитов;
	
КонецФункции

Процедура ЗаполнитьСопоставлениеРеквизитовРазделаАвтоматически(Правило, СхемаКомпоновкиДанных = "")
	
	ВыраженияЗаполненияРеквизитов = ПоляСоответствияРеквизитовПоИсточникуДанных(Правило, СхемаКомпоновкиДанных);
	Если ВыраженияЗаполненияРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНастройки Из Правило.СопоставлениеРеквизитов Цикл
		
		Отбор = Новый Структура("Реквизит", СтрокаНастройки.Реквизит);
		НайденныеСтроки = ВыраженияЗаполненияРеквизитов.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()  = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатПоиска = НайденныеСтроки[0];
		Если ЗначениеЗаполнено(РезультатПоиска.Выражение) Тогда
			
			Если РезультатПоиска.Неоднозначно Тогда
				СтрокаНастройки.ЗначениеЗаполнения = "";
			Иначе
				СтрокаНастройки.ЗначениеЗаполнения = РезультатПоиска.Выражение;
			КонецЕсли;
			СтрокаНастройки.СпособЗаполнения = РезультатПоиска.СпособЗаполнения;
			
		Иначе
			СтрокаНастройки.ЗначениеЗаполнения = "";
			СтрокаНастройки.СпособЗаполнения = Ложь;
			НастроитьСопоставлениеРеквизитовНеЗаполняемыхИзСхемыДляУПФ(СтрокаНастройки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НастроитьСопоставлениеРеквизитовНеЗаполняемыхИзСхемыДляУПФ(СтрокаНастройки)
	
	Если НЕ упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаНастройки.Реквизит = "СобствСилы_Субподряд" Тогда
		
		СтрокаНастройки.ЗначениеЗаполнения = Справочники.упоСобственныеСилыСубподряд.СобственныеСилы;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПоляСоответствияРеквизитовПоИсточникуДанных(Правило, СхемаКомпоновкиДанных)
	
	ИсточникиЗаполненияРеквизитов = Новый Соответствие;
	ТипыИсточниковЗаполненияРеквизитов = Новый Соответствие;
	ТипыФинСтатейПоСтатьеБюджета = Новый Соответствие;
	ЗначенияЗаполненияРеквизитов = Новый Соответствие;
		
	КэшТиповРеквизитов = упоПроектноеБюджетированиеПовтИсп.ТипыЗначенийРеквизитовРазделаПравила(Правило.Раздел);		
	ВыраженияЗаполнения = ШаблонТаблицыЗаполнения();					    
   
    Если СхемаКомпоновкиДанных <> Неопределено 
        И СхемаКомпоновкиДанных.НаборыДанных.Количество() <> 0 Тогда
        
        ПоляНабора = СхемаКомпоновкиДанных.НаборыДанных[0].Поля;			
        Для Каждого ПолеНабора Из ПоляНабора Цикл
            Если ТипЗнч(ПолеНабора) = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных") Тогда
                Продолжить;
            КонецЕсли;
            Если ЗначениеЗаполнено(ПолеНабора.ТипЗначения) Тогда					
                ИсточникиЗаполненияРеквизитов.Вставить(ПолеНабора.ПутьКДанным, ПолеНабора.ТипЗначения);
                ЗначениеДляСохранения = ТипыИсточниковЗаполненияРеквизитов.Получить(ПолеНабора.ТипЗначения);
                Если ЗначениеДляСохранения = Неопределено Тогда
                    ЗначениеДляСохранения = Новый Массив;
                КонецЕсли;
                ЗначениеДляСохранения.Добавить(ПолеНабора.ПутьКДанным);
                ТипыИсточниковЗаполненияРеквизитов.Вставить(ПолеНабора.ТипЗначения, ЗначениеДляСохранения);					
            КонецЕсли;
        КонецЦикла;
        
    КонецЕсли;		
    
	Если ИсточникиЗаполненияРеквизитов.Количество() > 0 Тогда
	
		Для Каждого СтрокаСопоставления Из Правило.СопоставлениеРеквизитов Цикл
						
			ПоляСовпадающихТипов = Новый Массив;
			ПоляСодержащихТипов = Новый Массив;
						
			НоваяСтрока = ВыраженияЗаполнения.Добавить();			
			НоваяСтрока.СпособЗаполнения = Истина;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСопоставления, , "СпособЗаполнения");
			
	    	НоваяСтрока.ТипЗначения = КэшТиповРеквизитов[СтрокаСопоставления.Реквизит];			
			ИсточникЗаполненияАналитики = ТипыИсточниковЗаполненияРеквизитов.Получить(НоваяСтрока.ТипЗначения);
			Если Не ИсточникЗаполненияАналитики = Неопределено Тогда
				ПоляСовпадающихТипов = ИсточникЗаполненияАналитики;
			Иначе
				Для каждого ИсточникЗаполненияРеквизита Из ИсточникиЗаполненияРеквизитов Цикл
					Для каждого Тип Из ИсточникЗаполненияРеквизита.Значение.Типы() Цикл
						Если КэшТиповРеквизитов[СтрокаСопоставления.Реквизит].СодержитТип(Тип) Тогда
							ПоляСодержащихТипов.Добавить(ИсточникЗаполненияРеквизита.Ключ);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			ЗначенияСтатей = Новый Массив;
            Если СтрокаСопоставления.Реквизит = "Статья" ИЛИ СтрокаСопоставления.Реквизит = "СтатьяДДС" Тогда
                Для Каждого ТипФинСтатьиПоСтатьеБюджета Из ТипыФинСтатейПоСтатьеБюджета Цикл
                    Если НоваяСтрока.ТипЗначения.СодержитТип(ТипФинСтатьиПоСтатьеБюджета.Ключ) Тогда
                        Для Каждого ЗначениеСтатьи Из ТипФинСтатьиПоСтатьеБюджета.Значение Цикл
                            ЗначенияСтатей.Добавить(ЗначениеСтатьи);
                        КонецЦикла;
                    КонецЕсли;
                КонецЦикла;									
            КонецЕсли;	
                                   
            Если ПоляСовпадающихТипов.Количество() <> 0 Тогда                
                НоваяСтрока.Выражение = ПоляСовпадающихТипов[0];
                НоваяСтрока.Неоднозначно = ПоляСовпадающихТипов.Количество() > 1;	
                
            ИначеЕсли ПоляСодержащихТипов.Количество() <> 0 Тогда
                НоваяСтрока.Выражение = ПоляСодержащихТипов[0];
                НоваяСтрока.Неоднозначно = ПоляСодержащихТипов.Количество() > 1;
                
            ИначеЕсли ЗначенияСтатей.Количество() <> 0 Тогда																				
                НоваяСтрока.СпособЗаполнения = Ложь;
                НоваяСтрока.Выражение = ЗначенияСтатей[0];
                НоваяСтрока.Неоднозначно = ЗначенияСтатей.Количество() > 1;	
            КонецЕсли;            
										
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат ВыраженияЗаполнения;
		
КонецФункции

Функция ШаблонТаблицыЗаполнения()
	
	ТаблицаЗаполнения = Новый ТаблицаЗначений;
	ТаблицаЗаполнения.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка"));
	ТаблицаЗаполнения.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
	
	ТипыВыражения = Новый Массив;
	ТипыВыражения.Добавить("Строка");	
	ТипыВыражения.Добавить("СправочникСсылка.СтатьиДвиженияДенежныхСредств");
	ТипыВыражения.Добавить("СправочникСсылка.упоСтатьиДоходов"); 
	ТипыВыражения.Добавить("СправочникСсылка.упоСтатьиЗатрат");		
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ТипыВыражения.Добавить("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов");
	КонецЕсли;	
	ТаблицаЗаполнения.Колонки.Добавить("Выражение", Новый ОписаниеТипов(ТипыВыражения));
	
	ТаблицаЗаполнения.Колонки.Добавить("СпособЗаполнения", Новый ОписаниеТипов("Булево"));	
	ТаблицаЗаполнения.Колонки.Добавить("Неоднозначно", Новый ОписаниеТипов("Булево"));	
	
	Возврат ТаблицаЗаполнения;
	
КонецФункции

Функция ПравилаПолученияФактаИБ(ОписанияПравил)
	
	МакетыПравил = Новый Массив;
	Для Каждого ОписаниеПравил Из ОписанияПравил Цикл
		МакетыПравил.Добавить(ОписаниеПравил.ИмяМакета);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МакетыПравил", МакетыПравил);
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Наименование КАК Наименование,
	|	Т.ПредустановленныйКод КАК ПредустановленныйКод
	|ИЗ
	|	Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования КАК Т
	|ГДЕ
	|	Т.ПредустановленныйКод В (&МакетыПравил)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПредопределенный = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаПредопределенный;

КонецФункции

Функция ОписанияПравил(ИменаМакетов)
	
	Если ТипЗнч(ИменаМакетов) = Тип("Строка") Тогда
		мИменаМакетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИменаМакетов);
	Иначе
		мИменаМакетов = ИменаМакетов;
	КонецЕсли;
	
	ОписанияПравил = Новый Массив;
	
	ДобавитьОписанияПравил_PM(ОписанияПравил, мИменаМакетов);
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		ДобавитьОписанияПравил_ERP(ОписанияПравил, мИменаМакетов);
	ИначеЕсли упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		ДобавитьОписанияПравил_УПФ(ОписанияПравил, мИменаМакетов);
	КонецЕсли;
	
	Возврат ОписанияПравил;
	
КонецФункции

Процедура ДобавитьОписанияПравил_PM(ОписанияПравил, ИменаМакетов = Неопределено)
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить("упоТабельУчетаРабочегоВремени");
	ТипыДокументов.Добавить("упоРаспределениеРабочегоВремениЗаНеделю");
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "ДоходыРасходы_Трудозатраты";
	ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Трудозатраты'");
	ОписаниеПравила.ОтключитьПравило = Истина;
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "ДоходыРасходы_ТрудозатратыПоСтатьямФОТ";
	ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Трудозатраты по статьям ФОТ'");
	ОписаниеПравила.ОтключитьПравило = Истина;
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалСогласованиеТрудозатрат() Тогда
		ТипыДокументов = Новый Массив;
		ТипыДокументов.Добавить("упоСогласованиеТрудозатрат");
		
		ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
		ОписаниеПравила.ИмяМакета = "ДоходыРасходы_СогласованныеТрудозатраты";
		ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Согласованные трудозатраты'");
		ОписаниеПравила.ОтключитьПравило = Истина;
		ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
		
		ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
		ОписаниеПравила.ИмяМакета = "ДоходыРасходы_СогласованныеТрудозатратыПоСтатьямФОТ";
		ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Согласованные трудозатраты по статьям ФОТ'");
		ОписаниеПравила.ОтключитьПравило = Истина;
		ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОписанияПравил_ERP(ОписанияПравил, ИменаМакетов = Неопределено)
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить("ПрочиеДоходыРасходы");
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "ДоходыРасходы_РеклассификацияРасходов_Сумма";
	ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Реклассификация расходов, Сумма'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "ДоходыРасходы_РеклассификацияРасходов_СуммаБезНДС";
	ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Реклассификация расходов, СуммаБезНДС'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "ДоходыРасходы_РеклассификацияРасходов_СуммаРегл";
	ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Реклассификация расходов, СуммаРегл'");
	ОписаниеПравила.ТипыДокументов = ТипыДокументов;
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "ДоходыРасходы_РеклассификацияРасходов_СуммаМинусСуммаБезНДС";
	ОписаниеПравила.Наименование = НСтр("ru = 'Произвольный запрос: Реклассификация расходов, Сумма - СуммаБезНДС'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
КонецПроцедуры

Процедура ДобавитьОписанияПравил_УПФ(ОписанияПравил, ИменаМакетов = Неопределено)
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить("АвансовыйОтчет");
	ТипыДокументов.Добавить("АктВыполненныхРабот");
	
	ТипыДокументов.Добавить("НачислениеЗарплатыУНФ");
	ТипыДокументов.Добавить("НачислениеНалогов");
	ТипыДокументов.Добавить("ОприходованиеЗапасов");
	ТипыДокументов.Добавить("ПриходнаяНакладная");
	ТипыДокументов.Добавить("ПрочиеРасходы");
	ТипыДокументов.Добавить("РасходнаяНакладная");
	ТипыДокументов.Добавить("ПеремещениеЗапасов");
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "УПФ_ДоходыРасходы";
	ОписаниеПравила.Наименование = НСтр("ru = 'Фактические доходы и расходы'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	//
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить("ЗакрытиеМесяца");
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "УПФ_ДоходыРасходы_ФинансовыйРезультат";
	ОписаниеПравила.Наименование = НСтр("ru = 'Финансовый результат'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	//
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить("ПоступлениеВКассу");
	ТипыДокументов.Добавить("ПоступлениеНаСчет");
	ТипыДокументов.Добавить("РасходИзКассы");
	ТипыДокументов.Добавить("РасходСоСчета");
	
	ОписаниеПравила = ОписаниеПравила_ДДС(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "УПФ_ДДС";
	ОписаниеПравила.Наименование = НСтр("ru = 'Движения денежных средств'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	//
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить("АвансовыйОтчет");
	ТипыДокументов.Добавить("ПриходнаяНакладная");
	ТипыДокументов.Добавить("ДополнительныеРасходы");
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "УПФ_РасходыПоТоварам";
	ОписаниеПравила.ОтключитьПравило = Истина;
	ОписаниеПравила.Наименование = НСтр("ru = 'Фактические расходы по товарам'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
	//
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить("АвансовыйОтчет");
	ТипыДокументов.Добавить("ПриходнаяНакладная");
	
	ОписаниеПравила = ОписаниеПравила_ДоходыРасходы(ТипыДокументов);
	ОписаниеПравила.ИмяМакета = "УПФ_РасходыУслугиНЗП";
	ОписаниеПравила.ОтключитьПравило = Истина;
	ОписаниеПравила.Наименование = НСтр("ru = 'Фактические расходы по услугам НЗП'");
	ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов);
	
КонецПроцедуры

Процедура ДобавитьОписаниеПравилаСПроверкой(ОписанияПравил, ОписаниеПравила, ИменаМакетов)
	
	ДобавитьОписание = Ложь;
	
	Если ИменаМакетов = Неопределено Тогда
		ДобавитьОписание = Истина;
	Иначе
		ДобавитьОписание = ИменаМакетов.Найти(ОписаниеПравила.ИмяМакета) <> Неопределено;
	КонецЕсли;
	
	Если ДобавитьОписание Тогда
		ОписанияПравил.Добавить(ОписаниеПравила);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПравила_ДоходыРасходы(ТипыДокументов)
	
	ОписаниеПравила = ОписаниеПравила_Шаблон();
	ОписаниеПравила.Вставить("Раздел", Перечисления.упоРазделыПравилПроектногоБюджетирования.ДоходыРасходы);
	ОписаниеПравила.Вставить("ТипыДокументов", ТипыДокументов); 
	
	Возврат ОписаниеПравила;
	
КонецФункции

Функция ОписаниеПравила_ДДС(ТипыДокументов)
	
	ОписаниеПравила = ОписаниеПравила_Шаблон();
	ОписаниеПравила.Вставить("Раздел", Перечисления.упоРазделыПравилПроектногоБюджетирования.ДДС);
	ОписаниеПравила.Вставить("ТипыДокументов", ТипыДокументов);
	
	Возврат ОписаниеПравила;
	
КонецФункции

Функция ОписаниеПравила_Шаблон()
	
	ОписаниеПравила = Новый Структура;
	ОписаниеПравила.Вставить("Раздел", Неопределено);
	ОписаниеПравила.Вставить("ИмяМакета", "");
	ОписаниеПравила.Вставить("Наименование", "");
	ОписаниеПравила.Вставить("ОтключитьПравило", Ложь);
	ОписаниеПравила.Вставить("ТипыДокументов", Неопределено); 
	
	Возврат ОписаниеПравила;
	
КонецФункции

#КонецОбласти

#КонецОбласти
