
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	ОбработатьЗаполнение(); 

КонецПроцедуры

&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ИКТ_ДобавлениеИзменениеРеквизитовФормы(); 
	
	ДобавитьРеквизитыНаФорму(); 
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ДобавлениеИзменениеРеквизитовФормы()
	
	ГруппаДопРеквизиты = Элементы.Добавить("ДопРеквизиты", Тип("ГруппаФормы"), Элементы.Дополнительно);
    ГруппаДопРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДопРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаДопРеквизиты.Заголовок = "ДопРеквизиты";
	ГруппаДопРеквизиты.ОтображатьЗаголовок = Ложь; 
	ГруппаДопРеквизиты.Отображение = ОтображениеОбычнойГруппы.Нет;
			
	НовыйЭлемент = Элементы.Добавить("ИКТ_IDСКУД", Тип("ПолеФормы"), ГруппаДопРеквизиты);
	НовыйЭлемент.Заголовок = "ID СКУД";
	НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_IDСКУД";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость = Ложь; 
	НовыйЭлемент.Ширина = 7;
		
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ПриОткрытииПосле(Отказ)
	ПодключитьОбработчикОжидания("ИКТ_ОбновитьСостояниеОбменаСРеквест", 60, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если ИКТ_ЗП_УОС.ЕстьПраваУОС() Тогда
		ПроверитьНаличиеДокументаУОС(); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИКТ_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьРеквизиты(Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ОрганизацияПриИзмененииПосле(Элемент)
		
	ДобавитьРеквизитыНаФорму(); 
	
КонецПроцедуры


#Область ДоработкиЛС

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()  
	
	Если ИКТ_ЗП_УОС.ЕстьПраваУОС() Тогда
		НайденнаяКоманда = Команды.Найти("ОткрытьСвязанныйДокумент");   
		Если НайденнаяКоманда = Неопределено Тогда
			Команда = Команды.Добавить("ОткрытьСвязанныйДокумент"); 
			Команда.Заголовок = "ОткрытьСвязанныйДокумент";
			Команда.Действие  = "ОткрытьСвязанныйДокумент"; 
		КонецЕсли;
		
		НайденнаяКоманда = Команды.Найти("СоздатьСвязанныйДокумент");   
		Если НайденнаяКоманда = Неопределено Тогда
			Команда = Команды.Добавить("СоздатьСвязанныйДокумент"); 
			Команда.Заголовок = "СоздатьСвязанныйДокумент";
			Команда.Действие  = "СоздатьСвязанныйДокумент"; 
		КонецЕсли;
		
		ЭтоБухгалтерскаяОрганизация = ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Объект.Организация);
		ЭтоУОС = ИКТ_ЗП_УОС.ЭтоУОС(Объект.Организация);
		
		Элемент = Элементы.Найти("ИКТ_СоздатьСвязанныйДокумент"); 
		
		Если Элемент = Неопределено Тогда  
			
			Если ЭтоБухгалтерскаяОрганизация Тогда
				
				СвязанныйДокумент = ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка);
				
				Если НЕ ЗначениеЗаполнено(СвязанныйДокумент) Тогда
					НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СоздатьСвязанныйДокумент", Тип("КнопкаФормы"), Элементы.Шапка);
					НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка; 
					НовыйЭлемент.Заголовок = "Создать документ УОС";
					НовыйЭлемент.ИмяКоманды = "СоздатьСвязанныйДокумент";	
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			Если ЭтоБухгалтерскаяОрганизация Тогда
				Элемент.Видимость = Истина;
			Иначе
				Элемент.Видимость = Ложь; 
			КонецЕсли;
			
		КонецЕсли;      
		
		Элемент = Элементы.Найти("ИКТ_СвязанныйДокумент"); 
		
		Если Элемент = Неопределено Тогда  
			
			Если ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС Тогда
				
				СвязанныйДокумент = ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка);
				
				Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда
					
					НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СвязанныйДокумент", Тип("КнопкаФормы"), Элементы.Шапка);
					НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка; 
					НовыйЭлемент.Заголовок = СтрШаблон("%1 %2", ?(ЭтоУОС, "БУ", "УОС"), СвязанныйДокумент);
					НовыйЭлемент.ИмяКоманды = "ОткрытьСвязанныйДокумент";
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			Если ЭтоБухгалтерскаяОрганизация ИЛИ ЭтоУОС Тогда
				Элемент.Видимость = Истина;
			Иначе
				Элемент.Видимость = Ложь; 
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ИКТ_RequestСерверПривилегированный.ИКТ_ДобавитьЭлементыСостоянияРеквестНаФорму(ЭтаФорма, , Элементы.ДопРеквизиты);		
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Элемент = Элементы.Найти("ИКТ_IDСКУД");
		Если Элемент <> Неопределено И Объект.Организация.ИКТ_УУ Тогда 
			Элемент.Видимость = Истина;
		Иначе
			Элемент.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСвязанныйДокумент()
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ПолучитьСвязанныйДокумент());
	
	ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);

КонецПроцедуры    

&НаСервере
Функция ПолучитьСвязанныйДокумент()

	Возврат ИКТ_ЗП_УОС.ПолучитьСвязанныйДокумент(Объект.Организация, Объект.Ссылка); 

КонецФункции

&НаКлиенте
Процедура СоздатьСвязанныйДокумент()  
	
	Если НЕ Объект.Проведен ИЛИ Модифицированность Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед вводом документа УОС требуется провести документ.");
	
	Иначе
	
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("УОС", Истина);
		ПараметрыФормы.Вставить("ДокументИсточник", Объект.Ссылка);
		
		ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ОбработатьЗаполнение()
	
	Если Параметры.Свойство("УОС") И Параметры.УОС = Истина Тогда
			
		ОбъектДляКопирования = ИКТ_ЗП_УОС.СоздатьСвязанныйДокумент(Параметры.ДокументИсточник);
		ЗначениеВРеквизитФормы(ОбъектДляКопирования, "Объект");
		Объект.ИКТ_ДокументИсточник = Параметры.ДокументИсточник;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеДокументаУОС() 
	
	Оповестить("ИКТ_ЗаписанДокумент");
	
	Если НЕ ЭтоБухгалтерскаяОрганизация(Объект.Организация) ИЛИ НЕ Объект.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДокументУОС = ЕстьДокументУОС();
	
	Если ЕстьДокументУОС Тогда
		Возврат;
	КонецЕсли;  
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
	 
	ПоказатьВопрос(Оповещение, "Создать документ?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Не найден документ УОС.");    	

КонецПроцедуры    

&НаСервере
Функция ЭтоБухгалтерскаяОрганизация(Организация)

	Возврат ИКТ_ЗП_УОС.ЭтоБухгалтерскаяОрганизация(Объект.Организация);	

КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("УОС", Истина);
		ПараметрыФормы.Вставить("ДокументИсточник", Объект.Ссылка);
		
		ОткрытьФорму("Документ." + ТипДокумента(Объект.Ссылка) + ".Форма.ФормаДокумента", ПараметрыФормы);

	КонецЕсли;	
 
КонецПроцедуры   

&НаСервере
Функция ЕстьДокументУОС()   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
		|ГДЕ
		|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
	
	Запрос.УстановитьПараметр("ДокументБУ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Возврат ?(ЗначениеЗаполнено(Выборка.ДокументУУ), Истина, Ложь);	
	
	КонецЦикла;
	
    Возврат Ложь;

КонецФункции    

&НаСервере
Функция ТипДокумента(Документ) 
	
	Возврат Документ.Метаданные().Имя;

КонецФункции

&НаСервере
Процедура ПроверитьРеквизиты(Отказ)
	
	Возврат;
	
	Если НЕ ИКТ_ЗП_УОС.ЭтоУОС(Объект.Организация) Тогда
		Возврат;
	КонецЕсли; 
	
	//ШаблонСообщения = "Для сотрудника %1 не заполнен реквизит %2";
	//
	////Реквизиты в сотруднике
	//
	//Реквизит = Метаданные.Справочники.Сотрудники.Реквизиты.ИКТ_Должность;
	//ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сотрудник, Реквизит.Имя);
	//Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.Сотрудник, Реквизит.Синоним),,,,Отказ);
	//КонецЕсли;
	//
	//Реквизит = Метаданные.Справочники.Сотрудники.Реквизиты.ИКТ_АдминистративныйРуководительАР;
	//ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сотрудник, Реквизит.Имя);
	//Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.Сотрудник, Реквизит.Синоним),,,,Отказ);
	//КонецЕсли;
	//
	//Реквизит = Метаданные.Справочники.Сотрудники.Реквизиты.ИКТ_ФункциональныйРуководительФР;
	//ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сотрудник, Реквизит.Имя);
	//Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.Сотрудник, Реквизит.Синоним),,,,Отказ);
	//КонецЕсли;
	//
	//Реквизит = Метаданные.Справочники.Сотрудники.Реквизиты.ИКТ_ВышестоящийРуководительВР;
	//ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сотрудник, Реквизит.Имя);
	//Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.Сотрудник, Реквизит.Синоним),,,,Отказ);
	//КонецЕсли;
	//
	//Реквизит = Метаданные.Справочники.Сотрудники.Реквизиты.ИКТ_Грейд;
	//ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сотрудник, Реквизит.Имя);
	//Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.Сотрудник, Реквизит.Синоним),,,,Отказ);
	//КонецЕсли;
	
	//Реквизиты в штатном расписании  
	
	ШаблонСообщения = "Для позиции штатного расписания %1 не заполнен реквизит %2";
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_ДолжностьС;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_IDДолжностьС;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_НомерГруппыПодбора;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_ТипПроверкиКандидатовДБ;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_ВидИнцидентаПоКРВ;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_УровеньДоступа;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_Должность;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_Группа;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
	Реквизит = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ИКТ_Грейд;
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Имя);
	Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Объект.ДолжностьПоШтатномуРасписанию, Реквизит.Синоним),,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквест()
	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Объект.Организация.ИКТ_УУ Тогда
			
			Результат = ИКТ_RequestСерверПривилегированный.ПолучитьСоостояниеОбменаСРеквестПоОбъекту(Объект.Ссылка);
			
			Если Не ЗначениеЗаполнено(Результат.Период) Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Не выполнялся";
				
			ИначеЕсли Результат.Ошибка = Ложь и Результат.Выгружен = Ложь Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Объект в очереди на выгрузку";  
				
			ИначеЕсли Результат.Ошибка = Истина Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = СтрШаблон("Ошибка обмена. Дата выгрузки %1", Результат.Период);
				
			Иначе 
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен выполнен";
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен будет выполнен после записи объекта";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




