#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыборГруппИЭлементов") Тогда
		Если Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтоГруппа", Истина);
		ИначеЕсли Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы Тогда
			ЭтоВыборЭлементов = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	
	МодульНастройкаПорядкаЭлементовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НастройкаПорядкаЭлементовКлиент");
	
	МодульНастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(Список, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	
	МодульНастройкаПорядкаЭлементовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НастройкаПорядкаЭлементовКлиент");
	
	МодульНастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВнизВыполнить(Список, Элементы.Список);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьКлиент();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	ВыбратьКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКлиент() 
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Или
		ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТекДанные.ЭтоГруппа И ЭтоВыборЭлементов Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите элемент, а не группу.'"), , НСтр("ru = '1С:Предприятие'"));
		Возврат;
	КонецЕсли;
	
	ЭлементУПО = упоИнтеграцияВызовСервера.ПолучитьСвязаннуюСтатьюДР(ТекДанные.Ссылка);	
	ОповеститьОВыборе(ЭлементУПО);
	
КонецПроцедуры

#КонецОбласти
