
&ИзменениеИКонтроль("ЗаполнитьИменаРеквизитовПоХозяйственнойОперации")
Процедура Расш1_ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация, МассивВсехРеквизитов, МассивРеквизитовОперации)

	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("Валюта");
	МассивВсехРеквизитов.Добавить("ОрганизацияПолучатель");

	МассивВсехРеквизитов.Добавить("ПрочиеРасходы.КорСтатьяРасходов");
	МассивВсехРеквизитов.Добавить("ПрочиеРасходы.КорАналитикаРасходов");
	МассивВсехРеквизитов.Добавить("ПрочиеРасходы.СтатьяАктивовПассивов");
	МассивВсехРеквизитов.Добавить("ПрочиеРасходы.АналитикаАктивовПассивов");
	МассивВсехРеквизитов.Добавить("ПрочиеРасходы.ПредставлениеОтраженияВРеглУчете");

	МассивВсехРеквизитов.Добавить("ПрочиеДоходы.КорСтатьяДоходов");
	МассивВсехРеквизитов.Добавить("ПрочиеДоходы.КорАналитикаДоходов");
	МассивВсехРеквизитов.Добавить("ПрочиеДоходы.СтатьяАктивовПассивов");
	МассивВсехРеквизитов.Добавить("ПрочиеДоходы.АналитикаАктивовПассивов");
	МассивВсехРеквизитов.Добавить("ПрочиеДоходы.ПредставлениеОтраженияВРеглУчете");

	МассивРеквизитовОперации = Новый Массив;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы Тогда
		МассивРеквизитовОперации.Добавить("Валюта");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.СтатьяАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.АналитикаАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.ПредставлениеОтраженияВРеглУчете");

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеПрочихРасходов
		ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторнированиеПрочихРасходов Тогда
		#Вставка		//{[+] ИКТ №21104 (фрагмент ДОБАВЛЕН), Новоселов, 11.09.2026 
		МассивРеквизитовОперации.Добавить("Валюта");
		#КонецВставки	//[+]} ИКТ №21104
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.СтатьяАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.АналитикаАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.ПредставлениеОтраженияВРеглУчете");

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеклассификацияРасходов Тогда
		#Вставка		//{[+] ИКТ №21104 (фрагмент ДОБАВЛЕН), Новоселов, 11.09.2026 
		МассивРеквизитовОперации.Добавить("Валюта");
		#КонецВставки	//[+]} ИКТ №21104
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.КорСтатьяРасходов");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.КорАналитикаРасходов");

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеДоходы Тогда
		МассивРеквизитовОперации.Добавить("Валюта");
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.СтатьяАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.АналитикаАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.ПредставлениеОтраженияВРеглУчете");

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторнированиеПрочихДоходов Тогда
		#Вставка		//{[+] ИКТ №21104 (фрагмент ДОБАВЛЕН), Новоселов, 11.09.2026 
		МассивРеквизитовОперации.Добавить("Валюта");
		#КонецВставки	//[+]} ИКТ №21104
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.СтатьяАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.АналитикаАктивовПассивов");
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.ПредставлениеОтраженияВРеглУчете");

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеклассификацияДоходов Тогда
		#Вставка		//{[+] ИКТ №21104 (фрагмент ДОБАВЛЕН), Новоселов, 11.09.2026 
		МассивРеквизитовОперации.Добавить("Валюта");
		#КонецВставки	//[+]} ИКТ №21104
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.КорСтатьяДоходов");
		МассивРеквизитовОперации.Добавить("ПрочиеДоходы.КорАналитикаДоходов");

	ИначеЕсли ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПрочихРасходовМеждуФилиалами Тогда
		#Вставка		//{[+] ИКТ №21104 (фрагмент ДОБАВЛЕН), Новоселов, 11.09.2026 
		МассивРеквизитовОперации.Добавить("Валюта");
		#КонецВставки	//[+]} ИКТ №21104
		МассивРеквизитовОперации.Добавить("ОрганизацияПолучатель");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.КорСтатьяРасходов");
		МассивРеквизитовОперации.Добавить("ПрочиеРасходы.КорАналитикаРасходов");

	КонецЕсли;

КонецПроцедуры
