#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	// Заполнение структуры обязательных полей шапки.
	СтруктураОбязательныхПолей.Вставить("ТрудовойРесурс");
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
// 
// Параметры:
//	Объект 				- ДокументСсылка.упоСмещениеРолейТрудовогоРесурса - Документ.
//  ИмяТабличнойЧасти 	- Строка - Имя табличной части.
//	СтруктураПараметров - Произвольный - Не используется.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
// 
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект, ИмяТабличнойЧасти, СтруктураПараметров = Неопределено) Экспорт
	
	// Формируем запрос
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ресурс", Объект.ТрудовойРесурс);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РолиТрудовыхРесурсовСрезПоследних.Роль
	               |ИЗ
	               |	РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних(, Ресурс = &Ресурс) КАК РолиТрудовыхРесурсовСрезПоследних
	               |ГДЕ
	               |	РолиТрудовыхРесурсовСрезПоследних.РольНазначена = ИСТИНА
	               |АВТОУПОРЯДОЧИВАНИЕ";
		
	// Запускаем запрос
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоСмещениеРолейТрудовогоРесурса);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли