
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка);
	
	ПроектнаяЗадача = Параметры.ПроектнаяЗадача;
	СтруктураУдаляемыеОбъекты = Параметры.СтруктураУдаляемыеОбъекты;
	ПеречитатьОбъектНаФорме = Параметры.ПеречитатьОбъектНаФорме;
	ЭтоАвтоТест = Параметры.ЭтоАвтоТест;
	
	Заголовок = "Удаление проектной задачи """ + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "НазваниеПроектнойЗадачи") + """";
	Элементы.ДекорацияСообщение.Заголовок = Параметры.ТекстСообщения; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоАвтоТест Тогда
		ПодтверждениеУдаления();
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, , Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, , ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, , Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, , Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, , Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, , Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтветДа(Команда)
	ПодтверждениеУдаления(); 	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНет(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеУдаления()
	
	ТекстОшибки = "";
	УдалитьПроектнуюЗадачу(ПроектнаяЗадача, СтруктураУдаляемыеОбъекты, ТекстОшибки);
	Если ПустаяСтрока(ТекстОшибки) Тогда
		ТекстСообщения = НСтр("ru = 'Удаление завершено!'");
		Элементы.ОтветДа.Доступность = Ложь;
		
		ОповеститьОбИзменении(ПроектнаяЗадача);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось провести расчет календарного плана!
			|Для корректной работы рекомендуется провести расчет календарного плана вручную!'"); 		
	КонецЕсли;
	
	Элементы.ДекорацияСообщение.Заголовок = ТекстСообщения;
	Элементы.ДекорацияПредупреждение.Видимость = Ложь;
	
	Оповестить("УдалениеПроектнойЗадачи", , ВладелецФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьПроектнуюЗадачу(Знач ПроектнаяЗадача, СтруктураУдаляемыеОбъекты, ТекстОшибки)
	
	упоПроектыИЗадачиСервер.УдалитьПроектнуюЗадачу(ПроектнаяЗадача, СтруктураУдаляемыеОбъекты, ТекстОшибки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3,
		П4, П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти