
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Заполнение

// Выполняет заполнение документа отражения по правилам отражения.
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект.упоОтражениеФактаВПроектномБюджетировании - документ отражение для заполнения.
//  ИдентификаторЗаписи  - УникальныйИдентификатор - Идентификатор обработки очереди документов к отражению.
// 						Заполняется при вызове процедуры из процедуры обработки очереди сообщений к отражению.
//						Используется для фильтрации очереди сообщений.
//
Процедура ЗаполнитьДокументОтражениеПоПравилуОтражения(ДокументОбъект, ИдентификаторЗаписи = Неопределено) Экспорт
	
	ДокументОбъект.РучнаяКорректировка = Ложь;
	ДокументОбъект.СтатусЗаполнения = Неопределено;	
	ДокументОбъект.ДоходыРасходы.Очистить();
	ДокументОбъект.ДДС.Очистить();
	тчОшибкиЗаполнения = ДокументОбъект.ОшибкиЗаполнения;
	тчОшибкиЗаполнения.Очистить();
			
	ПравилаОтражения = ПравилаОтраженияПоДокументуОтражения(ДокументОбъект);
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда
		
		ПравилаОжиданияОтражения = ПравилаОжиданияОтраженияВРеглУчете(ПравилаОтражения, ДокументОбъект);
		
		Если ПравилаОжиданияОтражения.Количество() > 0 Тогда		
			ДокументОбъект.СтатусЗаполнения = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОжиданиеОтраженияВРеглУчете;								
			Для Каждого ПравилоОжидания Из ПравилаОжиданияОтражения Цикл			
				ДобавитьОшибку(тчОшибкиЗаполнения, ПравилоОжидания, ДокументОбъект.СтатусЗаполнения);				
			КонецЦикла;	
		КонецЕсли;			
		
	КонецЕсли;
	
	// Заполнение документа.	
	ПараметрыВыполнения = ПараметрыВыполненияПравила(ДокументОбъект);						
	Для Каждого ПравилоОтражения Из ПравилаОтражения Цикл
		
		ОшибкиПользователю = Неопределено;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполняетсяПравило", ПравилоОтражения);
		
		РезультатВыполненияПравила = упоПроектноеБюджетированиеСервер.ФактБюджетированияПоПравилу(ПравилоОтражения, ПараметрыВыполнения, ДокументОбъект.СтатусЗаполнения, ОшибкиПользователю);	
		
		Если ОшибкиПользователю <> Неопределено Тогда
			ДобавитьОшибку(тчОшибкиЗаполнения, ПравилоОтражения, СводныйТекстОшибокПользователя(ОшибкиПользователю));
			ДокументОбъект.СтатусЗаполнения = 
				Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОшибкаОтражения;
		КонецЕсли;
		
		Для Каждого РезультатРаздела Из РезультатВыполненияПравила Цикл
			
			ИмяТабЧасти = упоПроектноеБюджетированиеСервер.ИмяПеречисленияПоЗначению(РезультатРаздела.Ключ);
			ТабличнаяЧасть = ДокументОбъект[ИмяТабЧасти];							
			Для Каждого СтрокаРезультат Из РезультатРаздела.Значение Цикл
				НоваяСтрока = ТабличнаяЧасть.Добавить();						
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультат);
				НоваяСтрока.ПравилоОтражения = ПравилоОтражения;
			КонецЦикла;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	// Обработка ошибок заполнения.
	Если ЗначениеЗаполнено(ДокументОбъект.СтатусЗаполнения) Тогда 		
		Если ДокументОбъект.СтатусЗаполнения = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОтсутствуютПравилаОтражения Тогда			
			ДобавитьОшибку(тчОшибкиЗаполнения, ПравилоОтражения, СводныйТекстОшибокПользователя(ОшибкиПользователю));			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) Тогда			
			упоПроектноеБюджетированиеСервер.ИзменитьСтатусПервичногоДокументаВОчередиКОтражению(ДокументОбъект.ДокументОснование, ДокументОбъект.СтатусЗаполнения, ИдентификаторЗаписи);											
			упоПроектноеБюджетированиеСервер.ОбновитьОшибкиОтраженияДокумента(ДокументОбъект.ДокументОснование, тчОшибкиЗаполнения);
		КонецЕсли;			
	КонецЕсли;	
				
КонецПроцедуры	

// Вызывает функцию СоздатьЗаполнитьДокументОтражение() для фонового выполнения.
//
// Параметры:
//  ПараметрыВыполнения  - Структура, Неопределено - параметры отражения первичного документа.
//  АдресРезультата  - Строка - Адрес временного хранилища для помещения результата.
//
Процедура СоздатьЗаполнитьДокументОтражениеВФоне(ПараметрыВыполнения = Неопределено, АдресРезультата = Неопределено) Экспорт
		
	ДокументОтражение = Неопределено;
	ДокументОснование = Неопределено;
	ЗаписьБезПроведения = Неопределено;	
	ПараметрыВыполнения.Свойство("ДокументОтражение", ДокументОтражение);
	ПараметрыВыполнения.Свойство("ДокументОснование", ДокументОснование);
	ПараметрыВыполнения.Свойство("ЗаписьБезПроведения", ЗаписьБезПроведения);
	
	ДокументОтражение = СоздатьЗаполнитьДокументОтражение(ДокументОснование, ДокументОтражение, ЗаписьБезПроведения);
	
	ПоместитьВоВременноеХранилище(ДокументОтражение, АдресРезультата);
	
КонецПроцедуры	

// Выполняет создание и заполнение документа отражения по указанному документу основанию.
//
// Параметры:
//  ДокументОснование  - ДокументСсылка - первичный документ основание для отражения.
//  ДокументОтражение  - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражение для заполнения.
//  ЗаписьБезПроведения  - Булево - флаг отказа от проведения. 
//						Используется для заполнения движений при ручной корректировке документа.
//  ИдентификаторОчереди  - УникальныйИдентификатор - Идентификатор обработки очереди документов к отражению.
// 						Заполняется при вызове процедуры из процедуры обработки очереди сообщений к отражению.
//						Используется для фильтрации очереди сообщений.
//
// Возвращаемое значение:
//   ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражение.
//
Функция СоздатьЗаполнитьДокументОтражение(ДокументОснование, ДокументОтражение = Неопределено, ЗаписьБезПроведения = Ложь, ИдентификаторОчереди = Неопределено) Экспорт
	
	Успешно = Ложь;
	СтатусОшибка = Перечисления.упоСтатусыОтраженияДокументовВПроектномБюджетировании.ОшибкаОтражения;
	
	Если Не Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ЕстьПравилоДляДокумента(ДокументОснование) Тогда
		ОшибкаЗаполнения = Новый Структура("Документ, Комментарий", 
			ДокументОснование,
			НСтр("ru = 'Нет активных правил отражения'"));
		МассивОшибок = Новый Массив;
		МассивОшибок.Добавить(ОшибкаЗаполнения);
		упоПроектноеБюджетированиеСервер.ИзменитьСтатусПервичногоДокументаВОчередиКОтражению(ДокументОснование, 
																							СтатусОшибка, 
																							ИдентификаторОчереди);											
		упоПроектноеБюджетированиеСервер.ОбновитьОшибкиОтраженияДокумента(ДокументОснование, МассивОшибок);
		Возврат Неопределено;
	КонецЕсли;	
	
	ПараметрыЗаполнения = ПараметрыЗаполненияДокументаОтражение(ДокументОснование, ДокументОтражение, ИдентификаторОчереди);	
	
	Если ЗначениеЗаполнено(ДокументОтражение) Тогда
		ДокументОтражениеОбъект = ДокументОтражение.ПолучитьОбъект();		
	Иначе
		ДокументОтражениеОбъект = Документы.упоОтражениеФактаВПроектномБюджетировании.СоздатьДокумент();
	КонецЕсли;	
	    		
	Попытка
		
		ДокументОтражениеОбъект.Заполнить(ПараметрыЗаполнения.ЗначенияЗаполнения);

		Если ЗначениеЗаполнено(ДокументОтражениеОбъект.СтатусЗаполнения) ИЛИ ЗаписьБезПроведения Тогда
			РежимЗаписи = РежимЗаписиДокумента.Запись;	
		Иначе //Нет ошибок заполнения и принудительного вызова записи без проведения.
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;			
		
		ДокументОтражениеОбъект.ПометкаУдаления = Ложь;
		
		ДокументОтражениеОбъект.Записать(РежимЗаписи);					
		
		Успешно = Истина;

	Исключение
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ДокументОтражениеОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		ТекстОшибкиДокументВнеПериодаИспользованияКонтураЭкономики = ТекстОшибкиДокументВнеПериодаИспользованияКонтураЭкономики(ДокументОснование);
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отражение документов в проектном бюджетировании. Ошибка отражения документа %1'"),
			ДокументОснование);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка, , ДокументОснование, ОписаниеОшибки);
		
		ПравилоОтражения = Неопределено;
		ДокументОтражениеОбъект.ДополнительныеСвойства.Свойство("ВыполняетсяПравило", ПравилоОтражения);
		
		тчОшибкиЗаполнения = ДокументОтражениеОбъект.ОшибкиЗаполнения;
		
		Если СтрНайти(ОписаниеОшибки, ТекстОшибкиДокументВнеПериодаИспользованияКонтураЭкономики) > 0 Тогда
			ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Иначе
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецЕсли;
		ДобавитьОшибку(тчОшибкиЗаполнения, ПравилоОтражения, ПредставлениеОшибки);		
				
		упоПроектноеБюджетированиеСервер.ИзменитьСтатусПервичногоДокументаВОчередиКОтражению(ДокументОснование, 
																							СтатусОшибка, 
																							ИдентификаторОчереди);											
		упоПроектноеБюджетированиеСервер.ОбновитьОшибкиОтраженияДокумента(ДокументОснование, тчОшибкиЗаполнения);		
		
	КонецПопытки;	
	
	Возврат ДокументОтражениеОбъект.Ссылка;
	
КонецФункции

// Формирует текст ошибки соответствия документа основания периоду использования экономики проектов.
//
// Параметры:
//  ДокументОснование	 - ДокументСсылка	 - первичный документ основание для отражения
// 
// Возвращаемое значение:
//  Строка - текст сообщения.
//
Функция ТекстОшибкиДокументВнеПериодаИспользованияКонтураЭкономики(ДокументОснование) Экспорт

	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 не удалось отразить в проектном бюджетировании, так как документ не относится к периоду
				|использования контура ""Отражение первичных документов в проектном бюджетировании"".'"),
				ДокументОснование);
				
	Возврат ТекстСообщения;

КонецФункции

// Возвращает правила отражения факта по документу отражения факта. 
//
// Параметры:
//  ДокументОтражение - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
// Возвращаемое значение:
//   Массив - СправочникСсылка.упоПравилаПолученияФактаДляПроектногоБюджетирования - правила отражения факта.
//
Функция ПравилаОтраженияПоДокументуОснованию(ДокументОтражение) Экспорт
	
	ДокументОснование = ДокументОтражение.ДокументОснование;
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		ПравилаОтражения = ДокументОтражение.ПравилаОтражения.Выгрузить().ВыгрузитьКолонку("ПравилоОтражения");
	Иначе		
		ТипДокумента = ДокументОснование.Метаданные().Имя;
		ПравилаОтражения = Справочники.упоПравилаПолученияФактаДляПроектногоБюджетирования.ПравилаОтраженияПоТипамДокументов(ТипДокумента);
	КонецЕсли;	
	
	Возврат ПравилаОтражения;
	
КонецФункции	

// Возвращает документ отражение для первичного документа отражения факта в проектном бюджетировании.
//
// Параметры:
//  ДокументОснование  - ДокументСсылка - первичный документ.
//  ПараметрыОтбора  - Структура - структура дополнительных параметров для отбора в запросе. 
//		Ключ "ТекстОтбора" обрабатывается как произвольное текстовое условие переданных параметров.
//
// Возвращаемое значение:
//   ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
Функция ДокументОтражениеПоДокументуОснованию(ДокументОснование, ПараметрыОтбора = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	// Параметры отбора
	ЕстьПараметрыОтбора = ЗначениеЗаполнено(ПараметрыОтбора);
	Если ЕстьПараметрыОтбора Тогда
		
		ТекстОтбора = Неопределено;
		
		СобратьТекстОтбора = Не ПараметрыОтбора.Свойство("ТекстОтбора", ТекстОтбора);
		Если СобратьТекстОтбора Тогда
			МассивТекстовОтбора = Новый Массив;
			ШаблонТекста = " И %1 = %2";
		КонецЕсли;
		
		Для Каждого КлючЗначение Из ПараметрыОтбора Цикл
			Если КлючЗначение.Ключ = "ТекстОтбора" Тогда
				Продолжить;
			КонецЕсли;
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
			Если СобратьТекстОтбора Тогда
				МассивТекстовОтбора.Добавить(СтрШаблон(ШаблонТекста, КлючЗначение.Ключ, КлючЗначение.Значение));
			КонецЕсли;
		КонецЦикла;
		
		Если СобратьТекстОтбора Тогда
			ТекстОтбора = СтрСоединить(МассивТекстовОтбора);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДокументОтражения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.упоОтражениеФактаВПроектномБюджетировании КАК ДокументОтражения
	               |ГДЕ
	               |	ДокументОтражения.ДокументОснование = &ДокументОснование";
	
	Если ЕстьПараметрыОтбора Тогда
		Запрос.Текст = Запрос.Текст + ТекстОтбора;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат.Пустой() Тогда
		ДокументОтражение = Документы.упоОтражениеФактаВПроектномБюджетировании.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДокументОтражение = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ДокументОтражение;
	
КонецФункции

// Возвращает признак актуальности данных отражения документа в проектном бюджетировании.
//
// Параметры:
//  ДокументОснование  - ДокументСсылка - документ.
//
// Возвращаемое значение:
//   Булево - актуальность данных отражения документа. 
//
Функция ДанныеДокументаОтраженияАктуальны(ДокументОснование) Экспорт
	
	ДанныеАктуальны = Ложь;
		
	СтатусыДанныеАктуальны = упоПроектноеБюджетированиеПовтИсп.СтатусыОтражения("Отражено");
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	упоОтражениеДокументовВПроектномБюджетировании.Статус КАК Статус,
	                      |	упоОтражениеДокументовВПроектномБюджетировании.Документ КАК Документ,
	                      |	упоОтражениеДокументовВПроектномБюджетировании.Статус В (&СтатусыДанныеАктуальны) КАК ДанныеАктуальны
	                      |ИЗ
	                      |	РегистрСведений.упоОтражениеДокументовВПроектномБюджетировании КАК упоОтражениеДокументовВПроектномБюджетировании
	                      |ГДЕ
	                      |	упоОтражениеДокументовВПроектномБюджетировании.Документ = &Документ");
	Запрос.УстановитьПараметр("Документ", ДокументОснование);
	Запрос.УстановитьПараметр("СтатусыДанныеАктуальны", СтатусыДанныеАктуальны);
	
	Результат = Запрос.Выполнить();	
	Если НЕ Результат.Пустой() Тогда		
		Выборка = Результат.Выбрать();		
		Если Выборка.Следующий() Тогда			
			ДанныеАктуальны = Выборка.ДанныеАктуальны;			
		КонецЕсли;			
	КонецЕсли;	
	
	Возврат ДанныеАктуальны;
	
КонецФункции	

// Возвращает признак отражения документа в международном учете.
//
// Параметры:
//  ДокументОтражение  - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
// Возвращаемое значение:
//   Булево - актуальность данных отражения документа. 
//
Функция ДокументОтраженВМеждународномУчете(ДокументОтражение) Экспорт
	
	СтатусыОтражения = Новый Массив;
	СтатусыОтражения.Добавить(Перечисления.СтатусыОтраженияВМеждународномУчете.ОтраженоВУчете);	
	СтатусыОтражения.Добавить(Перечисления.СтатусыОтраженияВМеждународномУчете.ОтраженоВУчетеВручную);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ОтражениеДокументовВМеждународномУчете.Статус
	                      |ИЗ
	                      |	РегистрСведений.ОтражениеДокументовВМеждународномУчете КАК ОтражениеДокументовВМеждународномУчете
	                      |ГДЕ
	                      |	ОтражениеДокументовВМеждународномУчете.Регистратор = &ДокументОтражение
	                      |	И ОтражениеДокументовВМеждународномУчете.Статус В(&СтатусыОтражения)");
	Запрос.УстановитьПараметр("ДокументОтражение", ДокументОтражение);
	Запрос.УстановитьПараметр("СтатусыОтражения", СтатусыОтражения);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

// Заполняет представление проектных задач в форме.
//
// Параметры:
//  Объект  - УправляемаяФорма - форма - источник изменения.
//  ПроектнаяЗадача - ДокументСсылка.упоПроектнаяЗадача - проектная задача.
//
// Возвращаемое значение:
//  Соответствие   - соответствие проектных задач наименованиям:
//		*Ключ - ДокументСсылка.упоПроектнаяЗадача - проектная задача.
//		*Значение - Строка - наименовани проектной задачи.
//
Функция ОбновитьНаименованияПроектныхЗадач(Объект, ПроектнаяЗадача = Неопределено) Экспорт
	
	РазделыДокумента = Новый Массив;
	Если ПроектнаяЗадача = Неопределено Тогда
		РазделыДокумента.Добавить("ДДС");
		РазделыДокумента.Добавить("ДоходыРасходы");
	КонецЕсли;	
	
	НаименованияПроектныхЗадач = Новый Соответствие();
	
	ПроектныеЗадачи = Новый Массив;	
	Если ПроектнаяЗадача = Неопределено Тогда	
		Для Каждого РазделДокумента Из РазделыДокумента Цикл	
			Для Каждого СтрокаРаздела Из Объект[РазделДокумента] Цикл
				Если ЗначениеЗаполнено(СтрокаРаздела.ПроектнаяЗадача) И ПроектныеЗадачи.Найти(СтрокаРаздела.ПроектнаяЗадача) = Неопределено Тогда
					ПроектныеЗадачи.Добавить(СтрокаРаздела.ПроектнаяЗадача);
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	Иначе
		ПроектныеЗадачи.Добавить(ПроектнаяЗадача);
	КонецЕсли;	
				
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)";
	Результат = Запрос.Выполнить();		
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			НаименованияПроектныхЗадач.Вставить(Выборка.ПроектнаяЗадача, Выборка.НазваниеЗадачи);				
		КонецЦикла;	
	КонецЕсли;	
	
	Если ПроектнаяЗадача = Неопределено Тогда
		Для Каждого РазделДокумента Из РазделыДокумента Цикл
			Для Каждого СтрокаРаздела Из Объект[РазделДокумента] Цикл
				СтрокаРаздела.ПроектнаяЗадачаНаименование = НаименованияПроектныхЗадач[СтрокаРаздела.ПроектнаяЗадача];
			КонецЦикла;
		КонецЦикла;
	Иначе
		Возврат НаименованияПроектныхЗадач[ПроектнаяЗадача];
	КонецЕсли;	
				
КонецФункции

#КонецОбласти

#Область Проведение

// Возвращает данные для проведения документа.
//
// Параметры:
//  ДокументСсылка  - ДокументСсылка.упоОтражениеФактаВПроектномБюджетировании - документ отражения факта.
//
// Возвращаемое значение:
//   Структура: 
//   	* Ключ - Строка - имя регистра.
//   	* Значение - ТаблицаЗначений - данные для проведения документа.
//
Функция ДанныеПроведения(ДокументСсылка) Экспорт
	
	ТекстыЗапроса = Новый Массив;
	ТекстыЗапроса.Добавить(ТекстПроведениеPM());
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ОтражатьПоМФУ_ERP_2_4 = ОтражатьПоМФУ_ERP_2_4();
	
	Если ОтражатьПоМФУ_ERP_2_4 Тогда
		Запрос.УстановитьПараметр("ИспользоватьМеждународныйФинансовыйУчет", 
			ПолучитьФункциональнуюОпцию("ИспользоватьМеждународныйФинансовыйУчет"));
		ТекстыЗапроса.Добавить(ТекстПроведениеEPM());
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДанныеПроведения = Новый Структура;
	ДанныеПроведения.Вставить("упоФактДоходовИРасходовОбороты", Результат[2].Выгрузить());
	ДанныеПроведения.Вставить("упоФактДоходовИРасходовПоДням", Результат[3].Выгрузить());
	ДанныеПроведения.Вставить("упоФактДвиженийДенежныхСредств", Результат[4].Выгрузить());
	Если ОтражатьПоМФУ_ERP_2_4 Тогда
		ДанныеПроведения.Вставить("ОтражениеДокументовВМеждународномУчете", Результат[Результат.ВГраница()].Выгрузить());
	КонецЕсли;
	
	Возврат ДанныеПроведения;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоОтражениеФактаВПроектномБюджетировании);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") Тогда
		
		ДокументОснование = упоФункцииБСП.ПолучитьЗначениеРеквизита(Параметры.Ключ, "ДокументОснование");		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
					
			СтандартнаяОбработка = Ложь;
			
			ВыбраннаяФорма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"Документ.%1.ФормаОбъекта",
				ДокументОснование.Метаданные().Имя);			
			Параметры.Вставить("Ключ", ДокументОснование);
			
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ТекстПроведениеPM()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	упоОтражениеФактаВПроектномБюджетировании.Ссылка КАК Регистратор,
	               |	упоОтражениеФактаВПроектномБюджетировании.Дата,
	               |	упоОтражениеФактаВПроектномБюджетировании.ДокументОснование
	               |ПОМЕСТИТЬ втДанныеШапки
	               |ИЗ
	               |	Документ.упоОтражениеФактаВПроектномБюджетировании КАК упоОтражениеФактаВПроектномБюджетировании
	               |ГДЕ
	               |	упоОтражениеФактаВПроектномБюджетировании.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеШапки.Регистратор,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Период,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ПроектнаяЗадача,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Статья,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ВидЭлемента,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Подразделение,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Роль,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Номенклатура,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ЕдиницаИзмерения,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Контрагент,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Договор,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Валюта,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Сценарий,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.СобствСилы_Субподряд,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.КонтрагентПодрядчик,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Заказ_ДоговорПодрядчика,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ПравилоОтражения,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Регистратор КАК ДокументОснование,
	               |	СУММА(упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Сумма) КАК Сумма,
	               |	СУММА(упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.СуммаВалютная) КАК СуммаВалютная,
	               |	СУММА(упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Количество) КАК Количество
	               |ПОМЕСТИТЬ втДоходыРасходы
	               |ИЗ
	               |	втДанныеШапки КАК втДанныеШапки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоОтражениеФактаВПроектномБюджетировании.ДоходыРасходы КАК упоОтражениеФактаВПроектномБюджетированииДоходыРасходы
	               |		ПО втДанныеШапки.Регистратор = упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ПроектнаяЗадача,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Статья,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ВидЭлемента,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Подразделение,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Роль,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Номенклатура,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ЕдиницаИзмерения,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Контрагент,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Договор,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Валюта,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Сценарий,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.СобствСилы_Субподряд,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.КонтрагентПодрядчик,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Заказ_ДоговорПодрядчика,
	               |	втДанныеШапки.Регистратор,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Период,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.ПравилоОтражения,
	               |	упоОтражениеФактаВПроектномБюджетированииДоходыРасходы.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДоходыРасходы.Регистратор,
	               |	втДоходыРасходы.Период,
	               |	втДоходыРасходы.ПроектнаяЗадача,
	               |	втДоходыРасходы.Статья,
	               |	втДоходыРасходы.ВидЭлемента,
	               |	втДоходыРасходы.Подразделение,
	               |	втДоходыРасходы.Роль,
	               |	втДоходыРасходы.Номенклатура,
	               |	втДоходыРасходы.ЕдиницаИзмерения,
	               |	втДоходыРасходы.Контрагент,
	               |	втДоходыРасходы.Договор,
	               |	втДоходыРасходы.Валюта,
	               |	втДоходыРасходы.Сценарий,
	               |	втДоходыРасходы.СобствСилы_Субподряд,
	               |	втДоходыРасходы.КонтрагентПодрядчик,
	               |	втДоходыРасходы.Заказ_ДоговорПодрядчика,
	               |	втДоходыРасходы.ПравилоОтражения,
	               |	втДоходыРасходы.ДокументОснование,
	               |	втДоходыРасходы.Сумма,
	               |	втДоходыРасходы.СуммаВалютная,
	               |	втДоходыРасходы.Количество
	               |ИЗ
	               |	втДоходыРасходы КАК втДоходыРасходы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДоходыРасходы.Регистратор,
	               |	втДоходыРасходы.Период,
	               |	втДоходыРасходы.ПроектнаяЗадача,
	               |	втДоходыРасходы.Статья,
	               |	втДоходыРасходы.ВидЭлемента,
	               |	втДоходыРасходы.Контрагент,
	               |	втДоходыРасходы.Договор,
	               |	втДоходыРасходы.Период КАК ДатаНачисления,
	               |	втДоходыРасходы.Валюта,
	               |	втДоходыРасходы.ПравилоОтражения,
	               |	втДоходыРасходы.ДокументОснование,
	               |	СУММА(втДоходыРасходы.Сумма) КАК Сумма,
	               |	СУММА(втДоходыРасходы.СуммаВалютная) КАК СуммаВалютная
	               |ИЗ
	               |	втДоходыРасходы КАК втДоходыРасходы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втДоходыРасходы.ПроектнаяЗадача,
	               |	втДоходыРасходы.Статья,
	               |	втДоходыРасходы.ВидЭлемента,
	               |	втДоходыРасходы.Контрагент,
	               |	втДоходыРасходы.Договор,
	               |	втДоходыРасходы.Валюта,
	               |	втДоходыРасходы.Период,
	               |	втДоходыРасходы.Регистратор,
	               |	втДоходыРасходы.ПравилоОтражения,
	               |	втДоходыРасходы.ДокументОснование,
	               |	втДоходыРасходы.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втДанныеШапки.Регистратор,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Период,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.ПроектнаяЗадача,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.СтатьяДДС,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.НаправлениеДвижения,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Контрагент,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Договор,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.ДатаДвижения,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Валюта,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.ПравилоОтражения,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Регистратор КАК ДокументОснование,
	               |	СУММА(упоОтражениеФактаВПроектномБюджетированииДДС.Сумма) КАК Сумма,
	               |	СУММА(упоОтражениеФактаВПроектномБюджетированииДДС.СуммаВалютная) КАК СуммаВалютная
	               |ИЗ
	               |	втДанныеШапки КАК втДанныеШапки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоОтражениеФактаВПроектномБюджетировании.ДДС КАК упоОтражениеФактаВПроектномБюджетированииДДС
	               |		ПО втДанныеШапки.Регистратор = упоОтражениеФактаВПроектномБюджетированииДДС.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.ПроектнаяЗадача,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.СтатьяДДС,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.НаправлениеДвижения,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Контрагент,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Договор,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.ДатаДвижения,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Валюта,
	               |	втДанныеШапки.Регистратор,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Период,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.ПравилоОтражения,
	               |	упоОтражениеФактаВПроектномБюджетированииДДС.Регистратор";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстПроведениеEPM()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втДанныеШапки.Регистратор,
	               |	втДанныеШапки.Дата КАК Период,
	               |	втДанныеШапки.Дата КАК ДатаОтражения,
	               |	ЕСТЬNULL(Проекты.Организация, ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)) КАК Организация,
	               |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.упоФактПроектногоБюджетирования) КАК ХозяйственнаяОперация
	               |ПОМЕСТИТЬ втОтражение
	               |ИЗ
	               |	втДанныеШапки КАК втДанныеШапки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втДоходыРасходы КАК втДоходыРасходы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	               |				ПО упоПроектнаяЗадача.Проект = Проекты.Ссылка
	               |			ПО втДоходыРасходы.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка
	               |		ПО втДанныеШапки.Регистратор = втДоходыРасходы.Регистратор
	               |ГДЕ
	               |	&ИспользоватьМеждународныйФинансовыйУчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втОтражение.Период КАК Период,
	               |	втОтражение.Организация КАК Организация,
	               |	втОтражение.ДатаОтражения КАК ДатаОтражения,
	               |	втОтражение.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	втОтражение.Регистратор
	               |ПОМЕСТИТЬ ТаблицаДанные
	               |ИЗ
	               |	втОтражение КАК втОтражение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДанные.Период КАК Период,
	               |	ТаблицаДанные.Организация,
	               |	ТаблицаДанные.ДатаОтражения КАК ДатаОтражения,
	               |	ТаблицаДанные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	МАКСИМУМ(УчетнаяПолитикаМФУ.Период) КАК Месяц,
	               |	ТаблицаДанные.Регистратор
	               |ПОМЕСТИТЬ ПериодыУчетнойПолитики
	               |ИЗ
	               |	ТаблицаДанные КАК ТаблицаДанные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизацийДляМеждународногоУчета КАК УчетнаяПолитикаМФУ
	               |		ПО ТаблицаДанные.Организация = УчетнаяПолитикаМФУ.Организация
	               |			И ТаблицаДанные.ДатаОтражения >= УчетнаяПолитикаМФУ.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаДанные.Период,
	               |	ТаблицаДанные.Организация,
	               |	ТаблицаДанные.ДатаОтражения,
	               |	ТаблицаДанные.ХозяйственнаяОперация,
	               |	ТаблицаДанные.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПериодыУчетнойПолитики.Период КАК Период,
	               |	ПериодыУчетнойПолитики.Организация КАК Организация,
	               |	ПериодыУчетнойПолитики.ДатаОтражения КАК ДатаОтражения,
	               |	ПериодыУчетнойПолитики.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	УчетнаяПолитикаМФУ.УчетнаяПолитика КАК УчетнаяПолитика,
	               |	ПериодыУчетнойПолитики.Регистратор
	               |ПОМЕСТИТЬ ИсходнаяТаблица
	               |ИЗ
	               |	ПериодыУчетнойПолитики КАК ПериодыУчетнойПолитики
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизацийДляМеждународногоУчета КАК УчетнаяПолитикаМФУ
	               |		ПО ПериодыУчетнойПолитики.Организация = УчетнаяПолитикаМФУ.Организация
	               |			И ПериодыУчетнойПолитики.Месяц = УчетнаяПолитикаМФУ.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкиХозяйственныхОпераций.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	               |	ПравилаОтражения.УчетнаяПолитика КАК УчетнаяПолитика,
	               |	МАКСИМУМ(ШаблоныПроводок.РучноеУточнениеПроводки) КАК РучноеУточнениеПроводки
	               |ПОМЕСТИТЬ ПравилаОтражения
	               |ИЗ
	               |	Справочник.ШаблоныПроводокДляМеждународногоУчета КАК ШаблоныПроводок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	               |		ПО ШаблоныПроводок.Операция = НастройкиХозяйственныхОпераций.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаОтраженияВМеждународномУчете КАК ПравилаОтражения
	               |		ПО ШаблоныПроводок.Ссылка = ПравилаОтражения.ШаблонПроводки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НастройкиХозяйственныхОпераций.ХозяйственнаяОперация,
	               |	ПравилаОтражения.УчетнаяПолитика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаКОтражению.Период КАК Период,
	               |	ТаблицаКОтражению.Организация КАК Организация,
	               |	ТаблицаКОтражению.ДатаОтражения КАК ДатаОтражения,
	               |	ТаблицаКОтражению.УчетнаяПолитика КАК УчетнаяПолитика,
	               |	ВЫБОР
	               |		КОГДА ТаблицаКОтражению.Статус = 1
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияВМеждународномУчете.КОтражениюВУчетеВручную)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияВМеждународномУчете.КОтражениюВУчете)
	               |	КОНЕЦ КАК Статус,
	               |	ТаблицаКОтражению.Регистратор
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИсходнаяТаблица.Период КАК Период,
	               |		ИсходнаяТаблица.Организация КАК Организация,
	               |		ИсходнаяТаблица.ДатаОтражения КАК ДатаОтражения,
	               |		ИсходнаяТаблица.УчетнаяПолитика КАК УчетнаяПолитика,
	               |		МИНИМУМ(ВЫБОР
	               |				КОГДА ОтражениеДокументов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияВМеждународномУчете.ОтраженоВУчетеВручную)
	               |						ИЛИ ОтражениеДокументов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияВМеждународномУчете.КОтражениюВУчетеВручную)
	               |						ИЛИ ПравилаОтражения.РучноеУточнениеПроводки
	               |					ТОГДА 1
	               |				ИНАЧЕ 2
	               |			КОНЕЦ) КАК Статус,
	               |		ИсходнаяТаблица.Регистратор КАК Регистратор
	               |	ИЗ
	               |		ИсходнаяТаблица КАК ИсходнаяТаблица
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ПравилаОтражения КАК ПравилаОтражения
	               |			ПО ИсходнаяТаблица.УчетнаяПолитика = ПравилаОтражения.УчетнаяПолитика
	               |				И ИсходнаяТаблица.ХозяйственнаяОперация = ПравилаОтражения.ХозяйственнаяОперация
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтражениеДокументовВМеждународномУчете КАК ОтражениеДокументов
	               |			ПО ИсходнаяТаблица.Организация = ОтражениеДокументов.Организация
	               |				И (ОтражениеДокументов.Регистратор = &Ссылка)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ИсходнаяТаблица.Период,
	               |		ИсходнаяТаблица.Организация,
	               |		ИсходнаяТаблица.ДатаОтражения,
	               |		ИсходнаяТаблица.УчетнаяПолитика,
	               |		ИсходнаяТаблица.Регистратор) КАК ТаблицаКОтражению";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

Функция ПараметрыЗаполненияДокументаОтражение(ДокументОснование, ДокументОтражение, ИдентификаторОчереди = Неопределено)
	
	Параметры = Новый Структура;	
	
	Если Не ЗначениеЗаполнено(ДокументОтражение) Тогда
		ДокументОтражение = ДокументОтражениеПоДокументуОснованию(ДокументОснование);
	КонецЕсли;			
	
	ЗначенияЗаполнения = Новый Структура("РучнаяКорректировка, ДокументОснование", Ложь, ДокументОснование);
	
	Если ЗначениеЗаполнено(ДокументОтражение) Тогда		    								
		Параметры.Вставить("Ключ", ДокументОтражение);
		Если НЕ ЗначениеЗаполнено(ДокументОтражение.Дата) Тогда
			ЗначенияЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());	
		КонецЕсли;	
	Иначе
		ЗначенияЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
	КонецЕсли;
								
	ЗначенияЗаполнения.Вставить("ИдентификаторОчереди", ИдентификаторОчереди);			
	ЗначенияЗаполнения.Вставить("ЗаполнитьПоПравилу");			
		
	Параметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
	Возврат Параметры;
	
КонецФункции

Функция ПравилаОтраженияПоДокументуОтражения(ДокументОтражение)
	
	ПравилаОтражения = Новый Массив;
	
	Если ЗначениеЗаполнено(ДокументОтражение.ДокументОснование) Тогда						
		ПравилаОтражения = ПравилаОтраженияПоДокументуОснованию(ДокументОтражение);						
	Иначе				
		Для Каждого СтрокаПравилоОтражения Из ДокументОтражение.ПравилаОтражения Цикл			
			Если ПравилаОтражения.Найти(СтрокаПравилоОтражения.ПравилоОтражения) = Неопределено Тогда
				ПравилаОтражения.Добавить(СтрокаПравилоОтражения.ПравилоОтражения);
			КонецЕсли;	
		КонецЦикла;			
	КонецЕсли;	
	
	Возврат ПравилаОтражения;
	
КонецФункции	

Функция ПараметрыВыполненияПравила(ДокументОбъект)
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("Период");
	Параметры.Вставить("НачалоПериода", Дата(1,1,1));
	Параметры.Вставить("КонецПериода", Дата(1,1,1));	
	Параметры.Вставить("ОтборПоРегистраторам");
	
	Параметры.Вставить("ПоРегистратору", Истина);
	
	Если ЗначениеЗаполнено(ДокументОбъект.НачалоПериода) Тогда
		Параметры.Вставить("НачалоПериода", ДокументОбъект.НачалоПериода);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.ОкончаниеПериода) Тогда
		Параметры.Вставить("КонецПериода", КонецДня(ДокументОбъект.ОкончаниеПериода));						
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) Тогда									
		Параметры.Вставить("ОтборПоРегистраторам", ДокументОбъект.ДокументОснование);
	КонецЕсли;
			
	Возврат Параметры;
	
КонецФункции

Функция ПравилаОжиданияОтраженияВРеглУчете(ПравилаОтражения, ДокументОбъект)
	
	ПравилаОжиданияОтражения = Новый Массив;
		
	СтатусыОтражения = Новый Массив;
	СтатусыОтражения.Добавить(упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
		"Перечисление.СтатусыОтраженияДокументовВРеглУчете.ОтраженоВРеглУчете"));
	СтатусыОтражения.Добавить(упоФункцииОбщегоНазначенияКлиентСервер.упоПредопределенноеЗначение(
		"Перечисление.СтатусыОтраженияДокументовВРеглУчете.ОтраженоВУчетеВручную"));
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОтражениеДокументовВРеглУчете.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ОтражениеРегл
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|ГДЕ
	|	НЕ ОтражениеДокументовВРеглУчете.Статус В (&СтатусыОтражения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоПравилаПолученияФактаДляПроектногоБюджетирования.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Правила
	|ИЗ
	|	Справочник.упоПравилаПолученияФактаДляПроектногоБюджетирования КАК упоПравилаПолученияФактаДляПроектногоБюджетирования
	|ГДЕ
	|	упоПравилаПолученияФактаДляПроектногоБюджетирования.ОжидатьОтраженияВРеглУчете
	|	И упоПравилаПолученияФактаДляПроектногоБюджетирования.Ссылка В(&ПравилаОтражения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Правило
	|ИЗ
	|	Правила КАК Правила
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтражениеРегл КАК ОтражениеРегл
	|		ПО (ИСТИНА)";
	
	СхемаЗапроса  = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);		
			
	УсловияОтбора = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) Тогда
		УсловияОтбора.Добавить("ОтражениеДокументовВРеглУчете.Регистратор = &Регистратор");
	Иначе
		Если ЗначениеЗаполнено(ДокументОбъект.НачалоПериода) Тогда
			УсловияОтбора.Добавить("ОтражениеДокументовВРеглУчете.ДатаОтражения >= &НачалоПериода");
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДокументОбъект.ОкончаниеПериода) Тогда
			УсловияОтбора.Добавить("ОтражениеДокументовВРеглУчете.ДатаОтражения <= КонецПериода(&ОкончаниеПериода, ДЕНЬ)");	
		КонецЕсли;		
	КонецЕсли;	
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПравилаОтражения", ПравилаОтражения);
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("НачалоПериода", ДокументОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ДокументОбъект.ОкончаниеПериода);
	Запрос.УстановитьПараметр("СтатусыОтражения", СтатусыОтражения);
	
	Результат = Запрос.Выполнить();
    	
	Если НЕ Результат.Пустой() Тогда
		ПравилаОжиданияОтражения = Результат.Выгрузить().ВыгрузитьКолонку("Правило");
	КонецЕсли;
	
	Возврат ПравилаОжиданияОтражения;
			
КонецФункции	

// Компонует сводный текст ошибок, добавленных с помощью процедуры ДобавитьОшибкуПользователю().
//
// Параметры:
//  Ошибки  - Неопределено - возврат,
//            значение, установленное при использовании процедуры ДобавитьОшибкуПользователю().
//
Функция СводныйТекстОшибокПользователя(Ошибки)
			
	СтрокиОшибок = Новый Массив;
	
	Если Ошибки = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Для Каждого Ошибка Из Ошибки.СписокОшибок Цикл
		
		Если Ошибка.ИндексСтроки = Неопределено Тогда
			ИндексСтроки = Ошибка.НомерСтроки;
		Иначе
			ИндексСтроки = Ошибка.ИндексСтроки;
		КонецЕсли;
		
		Если Ошибки.ГруппыОшибок[Ошибка.ГруппаОшибок] <> Истина Тогда			
			СтрокиОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ошибка.ТекстДляОднойОшибки, 
				Формат(ИндексСтроки, "ЧН=0; ЧГ=")));
		Иначе			
			СтрокиОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ошибка.ТекстДляНесколькихОшибок, 
				Формат(Ошибка.НомерСтроки + 1, "ЧН=0; ЧГ=")));						
		КонецЕсли;
					
	КонецЦикла;
	
	СводныйТекст = СтрСоединить(СтрокиОшибок, Символы.ПС);
	
	Возврат СводныйТекст;
	
КонецФункции

Процедура ДобавитьОшибку(ОшибкиЗаполнения, Правило = Неопределено, Комментарий)
	
	НоваяОшибка = ОшибкиЗаполнения.Добавить();
	Если ЗначениеЗаполнено(Правило) Тогда
		НоваяОшибка.Правило = Правило;
	КонецЕсли;	
	НоваяОшибка.Комментарий = Комментарий;
	
КонецПроцедуры

Функция ОтражатьПоМФУ_ERP_2_4()	
	
	ОтражатьПоМФУ_ERP_2_4 = Ложь;
	
	ЭтоEPM = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM();
	Если ЭтоEPM Тогда
		ЭтоEPM_2_5 = упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM_2_5(ЭтоEPM);
		ОтражатьПоМФУ_ERP_2_4 = Не ЭтоEPM_2_5;
	КонецЕсли;	
	
	Возврат ОтражатьПоМФУ_ERP_2_4;
	
КонецФункции

#КонецОбласти

#КонецЕсли