
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
//  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("ЗаполнитьПоПравилу") Тогда
			ИдентификаторОчереди = Неопределено;
			ДанныеЗаполнения.Свойство("ИдентификаторОчереди", ИдентификаторОчереди);
			Документы.упоОтражениеФактаВПроектномБюджетировании
				.ЗаполнитьДокументОтражениеПоПравилуОтражения(ЭтотОбъект, ИдентификаторОчереди);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПравилаОтражения.Количество() = 0 Тогда
		ПроверяемыеРеквизиты.Добавить("ДокументОснование");
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
		
	Если ЭтотОбъект.РучнаяКорректировка Тогда
		СтатусЗаполнения = Неопределено;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Ложь Тогда 
		РежимЗаписи = Неопределено;
		ДополнительныеСвойства.Свойство("РежимЗаписи", РежимЗаписи);
		
		ПроверкаДокументаПоОснованию(РежимЗаписи, Отказ);
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Если ЗначениеЗаполнено(СтатусЗаполнения) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 содержит ошибки отражения.'"),
				Ссылка); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ДокументПериодаИспользования = упоПроектноеБюджетированиеВызовСервера
			.ДокументПериодаИспользованияКонтураЭкономики(ДокументОснование);
		Если Не ДокументПериодаИспользования Тогда
			ТекстОшибки = Документы.упоОтражениеФактаВПроектномБюджетировании
				.ТекстОшибкиДокументВнеПериодаИспользованияКонтураЭкономики(ДокументОснование);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	упоПроведениеДокументовСервер.ПодготовитьДвиженияКРегистрации(ЭтотОбъект);
	
	упоПроведениеДокументовСервер.ПровестиДокумент(ЭтотОбъект);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаДокументаПоОснованию(РежимЗаписи, Отказ)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		НужнаПроверкаПоОснованию = Ложь;
	Иначе
		НужнаПроверкаПоОснованию = ЗначениеЗаполнено(ДокументОснование); 
	КонецЕсли;
	
	Если Не НужнаПроверкаПоОснованию Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОтражение = Документы.упоОтражениеФактаВПроектномБюджетировании
		.ДокументОтражениеПоДокументуОснованию(ДокументОснование);
		
	Если ЗначениеЗаполнено(ДокументОтражение) 
		И ДокументОтражение <> Ссылка Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Для отражения документа %1 необходимо использовать существующий документ %2.'"),
			ДокументОснование,
			ДокументОтражение);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, "Объект.ДокументОснование", , Отказ);
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДокументОснованиеПомечен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ПометкаУдаления");
		
		Если ДокументОснованиеПомечен Тогда
			
			ТекстОшибки = НСтр("ru = 'Документ %1 не может быть проведен, так как первичный документ %2 помечен на удаление.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, 
				ЭтотОбъект.Ссылка,
				ДокументОснование);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, "Объект.ДокументОснование", , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
