
#Область ОписаниеПеременных

&НаКлиенте
Перем РазрешеноЗакрытиеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНастройкиЗащиты();
	
	ОписаниеОшибки = "";
	Параметры.Свойство("ОписаниеОшибки", ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазрешеноЗакрытиеФормы = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Не РазрешеноЗакрытиеФормы И Не ЗавершениеРаботы Тогда
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'Для продолжения работы необходимо подключить лицензию.'");
	КонецЕсли;

	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		ОписаниеОповещенияОЗакрытииБазы = Новый ОписаниеОповещения("ЗакрытьБазу", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'При закрытии окна сеанс будет завершен. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещенияОЗакрытииБазы, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПодключить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиМенеджераЗащитыНаСервере();
	
	ОписаниеОшибки = "";
	РазрешеноЗакрытиеФормы = слкМенеджерЗащиты.ПроверитьЛицензиюСеанса(Серия, ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОчиститьСообщения();
		слкМенеджерЗащиты.СообщитьОбОшибкеСЛК(ОписаниеОшибки);
	Иначе
		ОбновитьПовторноИспользуемыеЗначения();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	упоФункцииЗащитыКлиент.ПроверкаЛицензирования();
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		РазрешеноЗакрытиеФормы = Истина;  
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьБазу(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;	
	КонецЕсли;   
	
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиМенеджераЗащитыНаСервере()
	
	ФайлыДанных = Новый Соответствие;
	ФайлыДанных.Вставить(ФайлыДанныхКлюч, ФайлыДанныхЗначение);
	
	ПараметрыПодключенияСерииКлючейЗащиты = слкМенеджерЗащитыСервер.ПолучитьНастройкиМенеджераСерииЗащиты();
	ПараметрыПодключенияСерииКлючейЗащиты.Host = Host;
	ПараметрыПодключенияСерииКлючейЗащиты.Port = Port;
	ПараметрыПодключенияСерииКлючейЗащиты.ФайлыДанных = ФайлыДанных;
	
	слкМенеджерЗащитыСервер.СохранитьНастройкиМенеджераСерииЗащиты(Серия, ПараметрыПодключенияСерииКлючейЗащиты);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЗащиты();
	
	Серия = упоФункцииЗащитыСервер.ПолучитьОсновнуюСериюКлючей();
	
	МЗ = слкМенеджерЗащитыСервер.ПолучитьМенеджерСерииЗащиты(Серия);
	
	ПараметрыПодключения = МЗ.ПараметрыПодключения;
	
	Host = ПараметрыПодключения.Host;
	Port = ПараметрыПодключения.Port;
	ФайлыДанных = ПараметрыПодключения.ФайлыДанных;
	
	ИмяМакета = упоФункцииЗащитыСервер.ПолучитьИмяМакетаОсновныхФайловЗащиты();
	
	ФайлыДанныхКлюч = ИмяМакета;
	ФайлыДанныхЗначение = ФайлыДанных[ИмяМакета];
	
КонецПроцедуры

#КонецОбласти