////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для упрощения расчетов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. упоСервисныеФункцииСервер.ПолучитьСтроковоеПредставление
//
Функция обПолучитьСтроковоеПредставление(ОбъектДанных) Экспорт

	Возврат упоСервисныеФункцииСервер.ПолучитьСтроковоеПредставление(ОбъектДанных.Ссылка);

КонецФункции

// Функция формирует заголовок строки сообщения об ошибке в строке табличной части.
// 
// Параметры:
//  ПредставлениеТЧ - Строка - Имя табличной части.
//  НомерСтрокиТЧ   - Число - номер строки табличной части.
// 
// Возвращаемое значение:
//  Строка - сформированный заголовок сообщения.
// 
Функция обСформироватьЗаголовокОшибкиВСтрокеТЧ(ПредставлениеТЧ, НомерСтрокиТЧ) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'В строке №%1  табличной части ""%2"" некорректные данные:
		|'"),
		СокрЛП(НомерСтрокиТЧ), СокрЛП(ПредставлениеТЧ));								
	
КонецФункции

// Сервисная функция, получает минимальное значение из двух заданных.
//  Умеет работать со значениями, для кототорых не определены их значения.
//
// Параметры:
//  Значение1	 - Произвольный	 - первое значение или Неопределено.
//  Значение2	 - Произвольный	 - второе значение или Неопределено.
// 
// Возвращаемое значение:
//  Произвольный - минимальное значение. Неопределено, если для обоих значений не определены их значения.
//
Функция обМин(Значение1, Значение2) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение1) Тогда
		Возврат Значение2;
	ИначеЕсли НЕ ЗначениеЗаполнено(Значение2) Тогда
		Возврат Значение1;	
	Иначе
		Возврат Мин(Значение1, Значение2);
	КонецЕсли;
	
КонецФункции

// Сервисная функция, получает максимальное значение из двух заданных.
//  Умеет работать со значениями, для кототорых не определены их значения.
//
// Параметры:
//  Значение1	 - Произвольный	 - первое значение или Неопределено.
//  Значение2	 - Произвольный	 - второе значение или Неопределено.
// 
// Возвращаемое значение:
//  Произвольный - максимальное значение. Неопределено, если для обоих значений не определены их значения.
//
Функция обМакс(Значение1, Значение2) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение1) Тогда
		Возврат Значение2;
	ИначеЕсли НЕ ЗначениеЗаполнено(Значение2) Тогда
		Возврат Значение1;
	Иначе
		Возврат Макс(Значение1, Значение2);
	КонецЕсли;
	
КонецФункции

// Позволяет определить есть ли среди реквизитов шапки объекта
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита      - Строка - строковое имя искомого реквизита.
//  МетаданныеОбъекта - Метаданные - объект описания метаданных,
//                      среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Булево - нашли реквизит с таким именем.
//
Функция обЕстьРеквизитШапки(ИмяРеквизита, МетаданныеОбъекта) Экспорт
	
	Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Возврат Ложь; // Нет такого реквизита у шапки объекта.
	Иначе
		Возврат Истина; // Реквизит нашли.
	КонецЕсли;

КонецФункции

// Позволяет определить есть ли среди реквизитов табличной части объекта
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита      - Строка - строковое имя искомого реквизита.
//  МетаданныеОбъекта - Метаданные - объект описания метаданных,
//                      среди табличных частей которого производится поиск.
//  ИмяТабЧасти       - Строка - строковое имя табличной части документа,
//                      среди реквизитов которой производится поиск.
//
// Возвращаемое значение:
//  Булево - нашли реквизит с таким именем.
//
Функция обЕстьРеквизитТабЧасти(ИмяРеквизита, МетаданныеОбъекта, ИмяТабЧасти) Экспорт
	
	ТабЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабЧасти);
	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части у объекта.
		Возврат Ложь;
	Иначе
		Если ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			Возврат Ложь; // Нет такого реквизита у таб. части объекта.
		Иначе
			Возврат Истина; // Реквизит нашли.
		КонецЕсли;
	КонецЕсли;

КонецФункции

// Выполняет запрос по заданному тексту и параметрам.
//
// Параметры:
//  ТекстЗапроса	 - Строка
//  ПараметрыЗапроса - Структура, Неопределено
// 
// Возвращаемое значение:
//  РезультатЗапроса - результат выполненного запроса.
//
Функция обВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	
	Если НЕ ПараметрыЗапроса = Неопределено Тогда      
		Для каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла; 
	КонецЕсли; 

	Возврат Запрос.Выполнить();
	
КонецФункции
 
// Возвращает запрошенное слово в нужном падеже.
//
// Параметры:
//  Количество	 - Число - для которого определяется падеж.
//  Слово		 - Строка	 - слово, которое описывает количество.
// 
// Возвращаемое значение:
//  Строка - слово в требуемом падеже.
//
Функция обОпределитьПадеж(Знач Количество, Знач Слово) Экспорт

	Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Количество) Тогда      
		Возврат "";
	КонецЕсли; 
	
	Если Количество < 0 Тогда      
		Количество = - Количество;
	КонецЕсли; 
	
	МладшийРазряд = Число(Прав(Строка(Количество), 1));
	Падеж = Слово;
	
	Если Слово = "день" Тогда      
		Если МладшийРазряд = 1 Тогда      
			Падеж = "день";
		ИначеЕсли МладшийРазряд > 1 И МладшийРазряд < 5 И (Количество < 10 ИЛИ Количество > 20) Тогда
			Падеж = "дня";
		Иначе
			Падеж = "дней";
		КонецЕсли; 
	ИначеЕсли Слово = "час" Тогда      
		Если МладшийРазряд = 1 Тогда      
			Падеж = "час";
		ИначеЕсли МладшийРазряд > 1 И МладшийРазряд < 5 И (Количество < 10 ИЛИ Количество > 20) Тогда
			Падеж = "часа";
		Иначе
			Падеж = "часов";
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Падеж;
	
КонецФункции

// Определяет название месяца по его номеру.
//
// Параметры:
//  НомерМесяца		 - Число	 - номер месяца.
//  РодительныйПадеж - Булево	 - флаг указывает на необходимость вернуть название в родительном падеже.
// 
// Возвращаемое значение:
//  Строка - название месяца.
//
Функция обОпределитьИмяМесяца(НомерМесяца = 0, РодительныйПадеж = Ложь) Экспорт

	Если НомерМесяца < 1 ИЛИ НомерМесяца > 12 Тогда
		Возврат "";
	КонецЕсли; 
	
	СписокНазваний = Новый Массив();
	
	Если НЕ РодительныйПадеж Тогда
			
		СписокНазваний.Добавить("Январь");
		СписокНазваний.Добавить("Февраль");
		СписокНазваний.Добавить("Март");
		СписокНазваний.Добавить("Апрель");
		СписокНазваний.Добавить("Май");
		СписокНазваний.Добавить("Июнь");
		СписокНазваний.Добавить("Июль");
		СписокНазваний.Добавить("Август");
		СписокНазваний.Добавить("Сентябрь");
		СписокНазваний.Добавить("Октябрь");
		СписокНазваний.Добавить("Ноябрь");
		СписокНазваний.Добавить("Декабрь");
		
	Иначе
		
		СписокНазваний.Добавить("января");
		СписокНазваний.Добавить("февраля");
		СписокНазваний.Добавить("марта");
		СписокНазваний.Добавить("апреля");
		СписокНазваний.Добавить("мая");
		СписокНазваний.Добавить("июня");
		СписокНазваний.Добавить("июля");
		СписокНазваний.Добавить("августа");
		СписокНазваний.Добавить("сентября");
		СписокНазваний.Добавить("октября");
		СписокНазваний.Добавить("ноября");
		СписокНазваний.Добавить("декабря");
		
	КонецЕсли; 
	
	Возврат СписокНазваний[НомерМесяца - 1];

КонецФункции

// Убирает "системные" пробелы из числа, для "человеческого" представления в виде строки.
//
// Параметры:
//  ВхЧисло	 - Число - которое нужно привести к человеческому виду.
// 
// Возвращаемое значение:
//  Строка - строковое представление числа без пробелов.
//
Функция обУбратьПробелы(Знач ВхЧисло) Экспорт

	СтрЧисло = Формат(ВхЧисло, "ЧРГ=@");
	Возврат СтрЗаменить(СтрЧисло, "@", "");

КонецФункции
 
// Процедура сворачивает ТЗ по всем колонкам, кроме переданных для суммирования.
//
// Параметры:
//  ТЗ					 - Произвольный - любой тип, у которого есть метод "Свернуть".
//  пКолонкиСуммирования - Соответствие – Имена колонок, которые надо суммировать.
//	пКолонкиИсключения 	 - Структура - необязательный, колонки-исключения.
//
Процедура СвернутьТЗ(ТЗ, пКолонкиСуммирования, пКолонкиИсключения = Неопределено) Экспорт 
	
	Если НЕ ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиГруппировки = Новый Массив;
	КолонкиСуммирования = Новый Массив;
	
	Для каждого Колонка Из ТЗ.Колонки Цикл
		Если ЗначениеЗаполнено(пКолонкиИсключения) И 
			Не пКолонкиИсключения[Колонка.Имя] = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если пКолонкиСуммирования[Колонка.Имя] = Неопределено Тогда			
			КолонкиГруппировки.Добавить(Колонка.Имя);
		Иначе			
			КолонкиСуммирования.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ТЗ.Свернуть(СтрСоединить(КолонкиГруппировки, ","), СтрСоединить(КолонкиСуммирования, ","));
	
КонецПроцедуры

// Убирает из таблицы ссылок разрешенные ссылки.
//
// Параметры:
//  ТаблицаСсылок	 - ТаблицаЗначений	 - ТЗ, где:
//  	* Первая колонка - ЛюбаяСсылка -  исходная ссылка.
//  	* Вторая колонка - ЛюбаяСсылка - ссылка на объект, если найденная ссылка соответствует объектной таблице или значение,
//  	олицетворяющее запись необъектной таблицы.
//  	* Третья колонка - Строка -объект метаданных, которому соответствуют данные в которых найдена ссылка.
//
Процедура обУбратьИзТаблицыСсылокРазрешенныеСсылки(ТаблицаСсылок) Экспорт 
	
	колво = ТаблицаСсылок.Количество();
	Для Сч = 1 По колво Цикл
		ЭлементТаблицыСсылок = ТаблицаСсылок.Получить(колво - Сч);
		
		Ссылка = ЭлементТаблицыСсылок.Ссылка;
		Данные = ЭлементТаблицыСсылок.Данные;
		МетаданныеДанных = ЭлементТаблицыСсылок.Метаданные;
		ИмяМетаданных = МетаданныеДанных.ПолноеИмя();
		
		Если Лев(ИмяМетаданных,15) = "РегистрСведений" Тогда
			ИзмеренияРегистраСведений = МетаданныеДанных.Измерения;
			УдаляетсяРегистрСведений = Ложь;
			Для Каждого Измерение Из ИзмеренияРегистраСведений Цикл
				Если Измерение.Ведущее Тогда
					Если Ссылка = Данные[Измерение.Имя] Тогда
						УдаляетсяРегистрСведений = Истина;
						Прервать;
					КонецЕсли; 
				КонецЕсли;
			КонецЦикла;
			Если УдаляетсяРегистрСведений Тогда
				ТаблицаСсылок.Удалить(ЭлементТаблицыСсылок);
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Получает таблицу ссылок.
//
// Параметры:
//  пМассивСсылок - Массив Из ЛюбаяСсылка
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция обПолучитьТаблицуСсылок(пМассивСсылок) Экспорт 
	
	Если НЕ ТипЗнч(пМассивСсылок) = Тип("Массив") Тогда
		массивСсылок = Новый Массив;
		массивСсылок.Добавить(пМассивСсылок);
	Иначе
		массивСсылок = пМассивСсылок;
	КонецЕсли;
	
	ТаблицаСсылок = НайтиПоСсылкам(массивСсылок);
	обУбратьИзТаблицыСсылокРазрешенныеСсылки(ТаблицаСсылок);
	
	Возврат ТаблицаСсылок;
	
КонецФункции 

// Убирает из таблицы строки без СПД
//
// Параметры:
//  ТаблицаДвижений	 - ТаблицаДвижений, ТаблицаЗначений	 - содержит текущие движения по регистру "упоДанныеПроектнойПродукции".
//  ПроектнаяЗадача	 - ДокументСсылка.упоПроектнаяЗадача - ссылка на заданную проектную задачу.
//  текущаяВерсия	 - ДокументСсылка.упоВерсияПланаПроекта
//
Процедура УдалитьНоменклатуруИзРегистра(ТаблицаДвижений, ПроектнаяЗадача, текущаяВерсия) Экспорт 

	Индекс = ТаблицаДвижений.Количество() - 1; 
	
	Пока Индекс >= 0 Цикл 
		
		Строка = ТаблицаДвижений[Индекс];
		
		Если ПустаяСтрока(Строка.ПроектнаяПродукция) Тогда 
			
			ТаблицаДвижений.Удалить(Индекс); 
			
		КонецЕсли; 
		
		Индекс = Индекс - 1;  
		
	КонецЦикла;
		
КонецПроцедуры       

#КонецОбласти