#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПрогнозныеСрокиПроекта(Проект) Экспорт
	
	Результат = Новый Структура("ДатаНачалаПрогноз, ДатаЗавершенияПрогноз, СтатусСроков");
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПрогнозныеСрокиПроектовСрезПоследних.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
	               |	упоПрогнозныеСрокиПроектовСрезПоследних.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	               |	упоПрогнозныеСрокиПроектовСрезПоследних.СтатусСроков КАК СтатусСроков
	               |ИЗ
	               |	РегистрСведений.упоПрогнозныеСрокиПроектов.СрезПоследних(, Проект = &Проект) КАК упоПрогнозныеСрокиПроектовСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО (упоПрогнозныеСрокиПроектовСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |				И упоВерсииПроекта.Текущая)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ЗаписатьПрогнозныеСрокиПроекта(Проект, ДанныеСроков) Экспорт
		
	Документ = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.Проект = Проект;
	Документ.ДатаНачалаПрогноз = ДанныеСроков.ДатаНачалаПрогноз;
	Документ.ДатаЗавершенияПрогноз = ДанныеСроков.ДатаЗавершенияПрогноз;
	Документ.СтатусСроков = ДанныеСроков.СтатусСроков;
	Документ.ПерезаписатьПрогнозныеСрокиПроекта = Истина;
	
	Документ.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры

Функция ПолучитьМассивИменРеквизитовПрогнозныхСроков() Экспорт
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("СтатусСроков");
	МассивРеквизитов.Добавить("ДатаНачалаПрогноз");
	МассивРеквизитов.Добавить("ДатаЗавершенияПрогноз");
	
	Возврат МассивРеквизитов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти