#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упоВидЗаполненияИндикатора.Автоматически"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упоВидЗаполненияИндикатора.АвтоматическиВДокументе"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упоВидЗаполненияИндикатора.Вручную"));
	
КонецПроцедуры

#КонецОбласти