#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти	- Строка - содержит имя табличной части объекта,
//                      	если параметр не указан, то структура формируется по шапке объекта.
//  СтруктураПараметров	- Структура - не используется.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизитыДляВыполненияОперацииЗаполнить(ИмяТабличнойЧасти,
	СтруктураПараметров = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Функция формирует нужную таблицу значений для загрузки в табличную часть.
//
// Параметры:
//  Проект			 - СправочникСсылка.Проекты	 - проект.
//  ТекущаяВерсия	 - ДокументСсылка.упоВерсияПланаПроекта - версия проекта.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Готовая таблица значений.
//
Функция СформироватьТаблицуДанныхДляОперацииЗаполнить(Проект, ТекущаяВерсия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Версия", ТекущаяВерсия);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РегЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	РегЗадачи.ЭтоВеха КАК ЭтоВеха,
	               |	РегСтатус.СтатусЗадачи КАК Статус,
	               |	РегГотовность.ПроцентГотовности КАК ПроцентГотовности,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачалаФакт,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершенияФакт
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК РегЗадачи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК РегСтатус
	               |		ПО РегЗадачи.ПроектнаяЗадача = РегСтатус.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК РегГотовность
	               |		ПО РегЗадачи.ПроектнаяЗадача = РегГотовность.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК РегКодСДР
	               |		ПО РегЗадачи.ПроектнаяЗадача = РегКодСДР.СсылкаНаПроектнуюЗадачу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	               |		ПО РегЗадачи.ПроектнаяЗадача = упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |ГДЕ
	               |	НЕ РегЗадачи.ЗадачаОтменена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РегКодСДР.КодСДР";
		
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Функция выполняет запрос получения данных о проценте выполнения проектных задач по часам.
//
// Параметры:
//  Проект			 - СправочникСсылка.Проекты	 - проект.
//  ТекущаяВерсия	 - ДокументСсылка.упоВерсияПланаПроекта - версия проекта.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - выборка записей из результата запроса.
//
Функция ВыполнитьЗапросЗаполнениеПоСписаннымЧасам(Проект, ТекущаяВерсия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Версия", ТекущаяВерсия);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха
	               |ПОМЕСТИТЬ втСвойстваПроектныхЗадач
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия  = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |ГДЕ
	               |	НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СУММА(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов) КАК ДлительностьПлан
	               |ПОМЕСТИТЬ ТрудозатратыПланОкончательный
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
	               |ГДЕ
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Проект = &Проект
	               |	И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоРоли
	               |	И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТрудозатратыПланОкончательный.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	КОЛИЧЕСТВО(1) КАК Колво
	               |ПОМЕСТИТЬ КоличествоОкончательноеПоПЗ
	               |ИЗ
	               |	ТрудозатратыПланОкончательный КАК ТрудозатратыПланОкончательный
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТрудозатратыПланОкончательный.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СУММА(упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.КоличествоЧасов) КАК ДлительностьПлан
	               |ПОМЕСТИТЬ ТрудозатратыПланПредварительный
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоОкончательноеПоПЗ КАК ОкончательныйПлан
	               |		ПО упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача = ОкончательныйПлан.ПроектнаяЗадача
	               |ГДЕ
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Проект = &Проект
	               |	И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоРоли
	               |	И упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный)
	               |	И ЕСТЬNULL(ОкончательныйПлан.Колво, 0) = 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТрудозатратыПланОкончательный.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ТрудозатратыПланОкончательный.ДлительностьПлан КАК ДлительностьПлан
	               |ПОМЕСТИТЬ ТрудозатратыПлан
	               |ИЗ
	               |	ТрудозатратыПланОкончательный КАК ТрудозатратыПланОкончательный
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТрудозатратыПланПредварительный.ПроектнаяЗадача,
	               |	ТрудозатратыПланПредварительный.ДлительностьПлан
	               |ИЗ
	               |	ТрудозатратыПланПредварительный КАК ТрудозатратыПланПредварительный
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоФактТрудозатратСводно.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	СУММА(упоФактТрудозатратСводно.КоличествоЧасов) КАК ДлительностьФакт
	               |ПОМЕСТИТЬ ТрудозатратыФакт
	               |ИЗ
	               |	РегистрСведений.упоФактТрудозатратСводно КАК упоФактТрудозатратСводно
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСвойстваПроектныхЗадач КАК втСвойстваПроектныхЗадач
	               |		ПО упоФактТрудозатратСводно.ПроектнаяЗадача = втСвойстваПроектныхЗадач.ПроектнаяЗадача
	               |ГДЕ
	               |	упоФактТрудозатратСводно.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный)
	               |	И упоФактТрудозатратСводно.Ресурс ССЫЛКА Справочник.упоРоли
	               |	И упоФактТрудозатратСводно.ПроектнаяЗадача.Проект = &Проект
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоФактТрудозатратСводно.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	100 * ЕСТЬNULL(ТрудозатратыФакт.ДлительностьФакт / ТрудозатратыПлан.ДлительностьПлан, 0) КАК Готовность, 
	               |	ТрудозатратыПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	втСвойстваПроектныхЗадач.ЭтоВеха КАК ЭтоВеха,
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК ТекущийСтатусЗадачи,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачала,
	               |	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершения,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачалаФакт,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершенияФакт
	               |ИЗ
	               |	ТрудозатратыФакт КАК ТрудозатратыФакт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТрудозатратыПлан КАК ТрудозатратыПлан
	               |			ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваПроектныхЗадач КАК втСвойстваПроектныхЗадач
	               |			ПО ТрудозатратыПлан.ПроектнаяЗадача = втСвойстваПроектныхЗадач.ПроектнаяЗадача
	               |		ПО (ТрудозатратыПлан.ПроектнаяЗадача = ТрудозатратыФакт.ПроектнаяЗадача)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &Версия) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ПО ТрудозатратыФакт.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &Версия) КАК упоСрокиПроектныхЗадачСрезПоследних
	               |		ПО ТрудозатратыФакт.ПроектнаяЗадача = упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &Версия) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	               |		ПО ТрудозатратыФакт.ПроектнаяЗадача = упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача" ;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоРучнаяАктуализацияПроекта);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли