
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		// Формирование структуры обязательных реквизитов шапки.
		СтруктураОбязательныхПолей.Вставить("Проект");
	ИначеЕсли ИмяТабличнойЧасти = "ПроектныеЗадачи" Тогда
		// Формирование структуры обязательных реквизитов ТЧ.
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадача");
		СтруктураОбязательныхПолей.Вставить("Статус");
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	ПравилаНаложения = Новый Структура();
	
	// Для каждого из регистров описывается, по какой из таблиц документа
	// строится список движений, и какие реквизиты куда записать.
	
	// Правила для регистра "СтатусыПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоСтатусыПроектныхЗадач.Метаданные().Имя, Правила);
	
	// Правила для табличной части "ПроектныеЗадачи" документа.
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить(Метаданные().ТабличныеЧасти.ПроектныеЗадачи.Имя, ПравилаТаблицы);
		
	// Делаем одно движение по ТЧ документа.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ИзменениеСтатуса", ПравилаДвижения);
		
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "ПроектнаяЗадача");
	ПравилаДвижения.Вставить("СтатусЗадачи"   , "Статус");
	
	// Правила для регистра "ПроцентыГотовностиПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоПроцентыГотовностиПроектныхЗадач.Метаданные().Имя, Правила);
	
	// Правила для табличной части "ПроектныеЗадачи" документа.
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить(Метаданные().ТабличныеЧасти.ПроектныеЗадачи.Имя, ПравилаТаблицы);
	
	// Правила для регистра "ПроцентыГотовностиПроектов".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоПроцентыГотовностиПроектов.Метаданные().Имя, Правила);
		
	// Делаем одно движение по ТЧ документа.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ИзменениеПроцентаГотовности", ПравилаДвижения);
		
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача"  , "ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ПроцентГотовности", "ПроцентГотовности");
	
	// Правила для регистра "упоФактическиеДатыНачалаИОкончанияПроектныхЗадач".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.Метаданные().Имя, Правила);
	
	// Правила для табличной части "ПроектныеЗадачи" документа.
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить(Метаданные().ТабличныеЧасти.ПроектныеЗадачи.Имя, ПравилаТаблицы);
	
	// Делаем одно движение по ТЧ документа.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ИзменениеФактическихДат", ПравилаДвижения);
	
	// Правила связи.
	ПравилаДвижения.Вставить("Версия", Новый Структура("Значение", текущаяВерсия));
	ПравилаДвижения.Вставить("ПроектнаяЗадача"  , "ПроектнаяЗадача");
	ПравилаДвижения.Вставить("ДатаНачала", "ДатаНачалаФакт");
	ПравилаДвижения.Вставить("ДатаЗавершения", "ДатаЗавершенияФакт");
	
	// Возвращаем полученные правила.
	Возврат ПравилаНаложения; 

КонецФункции
 
// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
	
	
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Проект = ПараметрыСеанса.упоТекущийПроект;
		Возврат;
    КонецЕсли; 
    
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
    
    Если ТипЗнч(Основание) = Тип("Структура") Тогда
        Если Основание.Свойство("Проект") Тогда
            Проект = Основание.Проект;
            упоПроектыИЗадачиСервер.ПроверитьТипПроекта(Проект);
        КонецЕсли;        
    КонецЕсли;
    
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = Основание;
		упоПроектыИЗадачиСервер.ПроверитьТипПроекта(Проект);
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда 
		
		ЭтотОбъект.Проект = Основание.Проект;
		ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ЭтотОбъект.Проект);
		
		НоваяСтрока = ПроектныеЗадачи.Добавить();
		НоваяСтрока.ПроектнаяЗадача = Основание;
		
		ДанныеПроектнойЗадачи = ПолучитьДанныеПроектнойЗадачи(Основание, ТекущаяВерсия);
		
		Если ДанныеПроектнойЗадачи <> Неопределено Тогда 
			НоваяСтрока.Статус				= ДанныеПроектнойЗадачи.СтатусЗадачи;
			НоваяСтрока.ПроцентГотовности 	= ДанныеПроектнойЗадачи.ПроцентГотовности; 
			НоваяСтрока.ДатаНачалаФакт		= ДанныеПроектнойЗадачи.ДатаНачалаФакт;
			НоваяСтрока.ДатаЗавершенияФакт 	= ДанныеПроектнойЗадачи.ДатаЗавершенияФакт;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события.
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения); 	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект	- содержит сам объект.
//  Отказ        - Булево			- признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	упоПроведениеДокументовСервер.АвтоматическийРасчетГотовности(ЭтотОбъект, Отказ, РежимПроведения);
	
	упоЗакрытиеЭтапа.УдалитьИзДвиженийСтатусовИПроцентовЗакрытыеЗадачи(ЭтотОбъект);

	Если Движения.упоСтатусыПроектныхЗадач.Количество() Тогда
		Движения.упоСтатусыПроектныхЗадач.Записать();
	КонецЕсли;
	
	упоПроведениеДокументовСервер.РасчетФактическихДатНачалаИОкончанияПроектныхЗадач(ЭтотОбъект, Отказ);
	
	упоЗадания.СинхронизироватьПорученияЗадач(Проект);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеПроектнойЗадачи(ПроектнаяЗадача, ТекущаяВерсия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаНачала КАК ДатаНачала,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ДатаЗавершения КАК ДатаЗавершения,
	               |	упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втФактическиеСроки
	               |ИЗ
	               |	РегистрСведений.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоФактическиеДатыНачалаИОкончанияПроектныхЗадачСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи,
	               |	упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности КАК ПроцентГотовности,
	               |	втФактическиеСроки.ДатаНачала КАК ДатаНачалаФакт,
	               |	втФактическиеСроки.ДатаЗавершения КАК ДатаЗавершенияФакт
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСтатусыПроектныхЗадачСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &Версия
	               |					И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
	               |		ПО упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача = упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втФактическиеСроки КАК втФактическиеСроки
	               |		ПО упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача = втФактическиеСроки.ПроектнаяЗадача";
	
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ПроектнаяЗадача);
	Запрос.УстановитьПараметр("Версия", ТекущаяВерсия);
	
	Результат = Запрос.Выполнить();
	
	Возврат ?(Результат.Пустой(), Неопределено, Результат.Выгрузить()[0]);
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли