////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции БСП.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает массив описаний подсистем конфигурации.
//
// Возвращаемое значение:
//	Массив - массив структур с описанием подсистем.
//		(Свойства элемента-структуры см. в функции упоФункцииБСП.ПолучитьСтруктуруОписанияПодсистемы).
Функция ПолучитьМассивОписанийПодсистемКонфигурации() Экспорт
	
	МодулиПодсистем = Новый Массив;
	МассивПодсистем = Новый Массив;
	
	ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем(МодулиПодсистем);
	
	Для каждого МодульПодсистемы Из МодулиПодсистем Цикл
		
		ОписаниеПодсистемы = упоФункцииБСП.ПолучитьСтруктуруОписанияПодсистемы();
		
		Модуль = ОбщегоНазначения.ОбщийМодуль(МодульПодсистемы);
		Модуль.ПриДобавленииПодсистемы(ОписаниеПодсистемы);
		
		МассивПодсистем.Добавить(ОписаниеПодсистемы);
		
	КонецЦикла;
	
	Возврат МассивПодсистем;
	
КонецФункции

#КонецОбласти