
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ВебКлиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Функционал недоступен для веб-клиента.'"));
		Возврат;
	#КонецЕсли
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат;
	КонецЕсли;
	
	МодульупоПечатьШаблоновКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("упоПечатьШаблоновКлиент");	
	МодульупоПечатьШаблоновКлиент.ЗаполнитьБланкДокумента(ПараметрыВыполненияКоманды.Источник, ПараметрКоманды, НСтр("ru = 'Печать шаблона'"));
	
КонецПроцедуры

#КонецОбласти