//{[+] ИКТ №15792 (фрагмент ДОБАВЛЕН), Воробьев Дмитрий, 15.02.2026
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    ИКТ_ДобавлениеИзменениеРеквизитовФормы();
КонецПроцедуры //[+]} ИКТ №15434

//{[+] ИКТ №15792 (фрагмент ДОБАВЛЕН), Воробьев Дмитрий, 15.02.2026
&НаСервере
Процедура ИКТ_ДобавлениеИзменениеРеквизитовФормы()
	
	НовыйЭлемент = Элементы.Добавить("ИКТ_УУ", Тип("ПолеФормы"), Элементы.ТекстОписания);
	НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_УУ";		
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ИКТ_УУПриИзменении");
		
КонецПроцедуры //[+]} ИКТ №15434  

//{[+] ИКТ №15792 (фрагмент ДОБАВЛЕН), Воробьев Дмитрий, 15.02.2026
&НаКлиенте
Процедура ИКТ_УУПриИзменении(Элемент)
	УстановитьДоступностьКодаДоходаНДФЛ(ЭтаФорма);	
КонецПроцедуры //[+]} ИКТ №15434

//{[+] ИКТ №15792 (фрагмент ДОБАВЛЕН), Воробьев Дмитрий, 15.02.2026
&НаКлиентеНаСервереБезКонтекста
&После("УстановитьДоступностьКодаДоходаНДФЛ")
Процедура ИКТ_УстановитьДоступностьКодаДоходаНДФЛ(Форма)
	
	Если Форма.Объект.ИКТ_УУ Тогда 
		Форма.Элементы.ОблагаетсяНДФЛЧисло0.Доступность = Истина;
		Форма.Элементы.ОблагаетсяНДФЛЧисло1.Доступность = Истина;	
		Форма.Элементы.КодДоходаНДФЛ.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры //[+]} ИКТ №15434 

//{[+] ИКТ №15792 (фрагмент ДОБАВЛЕН), Воробьев Дмитрий, 15.02.2026
&НаКлиентеНаСервереБезКонтекста
&ИзменениеИКонтроль("УстановитьДоступностьКодаДоходаНДФЛ")
Процедура ИКТ_УстановитьДоступностьКодаДоходаНДФЛ1(Форма)

	ОбязательноЗаполнять = Форма.КатегорииКодДоходаНДФЛНеЗаполняется.Найти(Форма.Объект.КатегорияНачисленияИлиНеоплаченногоВремени) = Неопределено;

	#Вставка     
	ОбязательноЗаполнять = Не Форма.Объект.ИКТ_УУ;
	#КонецВставки
	Форма.Элементы.ОблагаетсяНДФЛЧисло0.Доступность = Форма.КодДоходаНДФЛДоступностьПоКатегории И Не ОбязательноЗаполнять;
	Форма.Элементы.ОблагаетсяНДФЛЧисло1.Доступность = Форма.КодДоходаНДФЛДоступностьПоКатегории;

	Если ОбязательноЗаполнять Тогда
		Форма.ОблагаетсяНДФЛ = 1;
	КонецЕсли;

	ДоступностьКодаНДФЛ = Форма.ОблагаетсяНДФЛ = 1 И Форма.КодДоходаНДФЛДоступностьПоКатегории;

	Форма.Элементы.КодДоходаНДФЛ.Доступность = ДоступностьКодаНДФЛ;
	Форма.Элементы.КодДоходаНДФЛ.АвтоОтметкаНезаполненного = ДоступностьКодаНДФЛ;
	Форма.Элементы.КодДоходаНДФЛ.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.Объект.КодДоходаНДФЛ);

	Если Форма.ОблагаетсяНДФЛ = 0 Тогда
		Форма.Объект.КодДоходаНДФЛ = Неопределено;
	КонецЕсли;

КонецПроцедуры //[+]} ИКТ №15434


