#Область ПрограммныйИнтерфейс

// Запускает фоновую регистрацию документов к отражению с передачей результата на клиент.
//
// Параметры:
//  ИмяПроцедуры - Строка - имя экспортной процедуры, которую необходимо выполнить в фоне.
//  ПараметрыПроцедуры - Структура - произвольные параметры вызова процедуры ИмяПроцедуры.
//  ИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор формы, 
//                       во временное хранилище которой надо поместить результат выполнения процедуры.
//
// Возвращаемое значение:
//  Структура          - результат выполнения задания (см.ДлительныеОперации.ВыполнитьВФоне()). 
//
Функция ЗапуститьФоновуюРегистрациюДокументовКОтражениюКонтекстКлиента(ИмяПроцедуры, Знач ПараметрыПроцедуры, Знач ИдентификаторФормы) Экспорт
	
	Возврат упоРаботаСОчередямиВызовСервера.ЗапуститьФоновоеЗаданиеКонтекстКлиента(
		ИмяПроцедуры, 
		ПараметрыПроцедуры, 
		ИдентификаторФормы,
		НаименованиеФоновогоЗаданияРегистрацииКОтражению());
	
КонецФункции

// Запускает фоновое отражение документов с передачей результата на клиент.
//
// Параметры:
//  ИмяПроцедуры - Строка - имя экспортной процедуры, которую необходимо выполнить в фоне.
//  ПараметрыПроцедуры - Структура - произвольные параметры вызова процедуры ИмяПроцедуры.
//  ИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор формы, 
//                       во временное хранилище которой надо поместить результат выполнения процедуры.
//
// Возвращаемое значение:
//  Структура          - результат выполнения задания (см.ДлительныеОперации.ВыполнитьВФоне()).
//
Функция ЗапуститьФоновоеОтражениеДокументовКонтекстКлиента(ИмяПроцедуры, Знач ПараметрыПроцедуры, Знач ИдентификаторФормы) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат упоРаботаСОчередямиВызовСервера.ЗапуститьФоновоеЗаданиеКонтекстКлиента(ИмяПроцедуры, 
		ПараметрыПроцедуры, 
		ИдентификаторФормы,
		НаименованиеФоновогоЗаданияОтражения());
	
КонецФункции

// Запускает фоновое задание отражения документов.
// Параметры:
//  ПараметрыПроцедуры - Структура - произвольные параметры вызова процедуры
//						"упоПроектноеБюджетированиеСервер.ВыполнитьОтражениеДокументовВФоне".
//
Процедура ЗапуститьФоновоеОтражениеДокументовКонтекстСервера(Знач ПараметрыПроцедуры) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяПроцедуры = "упоПроектноеБюджетированиеСервер.ВыполнитьОтражениеДокументовВФоне";
	
	упоРаботаСОчередямиВызовСервера.ЗапуститьФоновоеЗаданиеКонтекстСервера(ИмяПроцедуры,
		ПараметрыПроцедуры, 
		НаименованиеФоновогоЗаданияОтражения());
	
КонецПроцедуры

// Изменяет дополнительные параметры процедур и функций, разделенных в пользовательских и фоновых сеансах.
//
// Параметры:
//  Очистить  - Булево - признак удаления параметра.
//
Процедура УстановитьСнятьДополнительныйПараметрСеанса_ЗакрытиеМесяца(Очистить = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Параметр = "ЗакрытиеМесяца";
	
	Запись = РегистрыСведений.упоДополнительныеПараметрыСеанса.СоздатьМенеджерЗаписи();
	Запись.Параметр = Параметр;
	Запись.Прочитать();
	
	Если Очистить Тогда
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	Иначе
		Запись.Параметр = Параметр;
		Запись.Значение = Истина;
		Запись.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Добавляет в отчет информацию об актуальности отражения фактических данных. 
// Дату актуальности берет из настроек компоновщика.
// При наличии не отраженных документов выводит в отчет строку с предупреждающим сообщением.
//
// Параметры:
//  ДокументРезультат	 - ТабличныйДокумент - табличный документ, в который идет вывод отчета.
//  КомпоновщикНастроек	 - компоновщик настроек отчета, для которого проверяется актуальность.
//
Процедура ПроверитьАктуальностьФактическихДанных(ДокументРезультат, КомпоновщикНастроек) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("упоИспользоватьОтражениеПервичныхДокументовВПроектномБюджетировании") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПроверки = Дата(3999,12,31,23,59,59);
	Параметр = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Параметр);
	Если ЗначениеПараметра <> Неопределено Тогда
		ПериодОтчета = ЗначениеПараметра.Значение;
		Если ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания) Тогда
			ДатаПроверки = ПериодОтчета.ДатаОкончания;
		КонецЕсли;
	КонецЕсли;
		
	КоличествоНеотраженныхДокументов = КоличествоНеотраженныхДокументов(ДатаПроверки);
	НужнаНадпись = КоличествоНеотраженныхДокументов > 0;
		
	Если НужнаНадпись Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru ='В проектном бюджетировании ожидают отражения %1 документов'"),
			КоличествоНеотраженныхДокументов);
		
		ТаблицаПредупреждение = Новый ТабличныйДокумент;
		
		ОбластьПредупреждение = ТаблицаПредупреждение.Область(1,1,1,1);
		ОбластьПредупреждение.Текст = ТекстПредупреждения;
		ОбластьПредупреждение.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
		ОбластьПредупреждение.Шрифт = Новый Шрифт(ОбластьПредупреждение.Шрифт,,,Истина);
		
		ДокументРезультат.ВставитьОбласть(ТаблицаПредупреждение.Область(1,,1,), 
			ДокументРезультат.Область(1,,1,), 
			ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает количество неотраженных документов при проверке в отчетах, связанных с регистрами БДР, ДДС.
//
Функция КоличествоНеотраженныхДокументов(ДатаОкончания)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ 
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоОчередьДокументовКОтражениюВПроектномБюджетировании.Документ) КАК КоличествоНеотраженныхДокументов
	                      |ИЗ
	                      |	РегистрСведений.упоОчередьДокументовКОтражениюВПроектномБюджетировании КАК упоОчередьДокументовКОтражениюВПроектномБюджетировании
	                      |ГДЕ
	                      |	упоОчередьДокументовКОтражениюВПроектномБюджетировании.ПериодЗаписи <= &ДатаОкончания");
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КоличествоНеотраженныхДокументов;
	
КонецФункции

// Возвращает принадлежность документа к контуру проектного бюджетирования по дате.
//
// Параметры:
//  ДокументОснование	 - ДокументСсылка	 - проверяемый первичный документ.
// 
// Возвращаемое значение:
//  Булево - попадает ли документ с указанной датой в период использования проектного бюджетирования
//
Функция ДокументПериодаИспользованияКонтураЭкономики(ДокументОснование) Экспорт
	
	НачалоИспользованияЭкономикиПроектов = упоПроектноеБюджетированиеПовтИсп.НачалоИспользованияКонтураЭкономики();
	ПериодЗаписиДокумента = упоПроектноеБюджетированиеСервер.ПериодЗаписиДокумента(ДокументОснование);
	
	Возврат ПериодЗаписиДокумента >= НачалоИспользованияЭкономикиПроектов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Функция НаименованиеФоновогоЗаданияОтражения() 
	
	Возврат НСтр("ru = 'Отражение документов в проектном бюджетировании: Отражение в фоне.'");
	
КонецФункции

Функция НаименованиеФоновогоЗаданияРегистрацииКОтражению() 
	
	Возврат НСтр("ru = 'Отражение документов в проектном бюджетировании: Регистрация к отражению.'");
	
КонецФункции

#КонецОбласти
