
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем СвойстваПроекта;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ИмяТабличнойЧасти = Неопределено Тогда		
		СтруктураОбязательныхПолей.Вставить("ПроектнаяЗадача");
	ИначеЕсли ИмяТабличнойЧасти = "ЗатратыМатРесурсовФакт" Тогда
		СтруктураСвойств = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ЭтотОбъект.Проект);			
		РасходыПоНатуральнымПоказателям = СтруктураСвойств.РасходыПоНатуральнымПоказателям;				
		СтруктураОбязательныхПолей.Вставить("Ресурс");
		Если РасходыПоНатуральнымПоказателям Тогда
			СтруктураОбязательныхПолей.Вставить("Количество");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Процедура проверяет корректность данных документа для записи в базу.
// 
// Параметры:
//	ДанныеДокумента - Структура - данные документа.
//  Отказ        	- Булево - признак отказа от выполнения операции.
//  Заголовок   	- Строка - содержит заголовок сообщения.
// 
Процедура ПроверитьДанные(ДанныеДокумента, Отказ, Заголовок) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура для вызова при подборе ресурсов в табличную часть "МатериальныеРесурсы".
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти	 - строка табличной части "МатериальныеРесурсы".
//  ПараметрыПодбора	 - СписокЗначений - не используется. 
//
Процедура ВыполнитьДействияПриПодборе(Знач СтрокаТабличнойЧасти, ПараметрыПодбора = Неопределено) Экспорт

	упоРесурсыИНормыВызовСервера.обПриИзмененииРесурсаТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект,,Истина, "Статья"); 

КонецПроцедуры

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	
	Возврат Новый Структура(); // Нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

		
КонецПроцедуры

// Получает таблицу правил наложения реквизитов документа на измерения, ресурсы и реквизиты регистров.
//  Правила передаются в виде иерархическая структуры.
//
// Параметры:
//  ДанныеДокумента	 - Произвольный	 - не используется
// 
// Возвращаемое значение:
//  Структура - иерархический набор пар <ИмяРеквизитаДокумента>:<ИмяРеквизитаРегистра>.
//
Функция ПолучитьПравилаНаложенияРеквизитовНаРегистр(ДанныеДокумента) Экспорт

	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	
	ПравилаНаложения = Новый Структура();
		
	// Правила для регистра "упоФактЗатратМатериальныхРесурсов".
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактЗатратМатериальныхРесурсов.Метаданные().Имя, Правила);
	
	// Правила для табличной части "упоФактЗатратМатериальныхРесурсов" документа.
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ЗатратыМатРесурсовФакт", ПравилаТаблицы);
	
	// Делаем одно движение по данной ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеЗатратМатРесурсовПоФакту", ПравилаДвижения);
	
	// Правила связи.
	ПравилаДвижения.Вставить("ПроектнаяЗадача"       , "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Ресурс"                , "Ресурс");
	ПравилаДвижения.Вставить("ВидОперации"           , "ВидОперации");
	ПравилаДвижения.Вставить("КоличествоЕдНормирования", "Количество");
	ПравилаДвижения.Вставить("ЕдиницаНормирования"   , "ЕдиницаНормирования");
	ПравилаДвижения.Вставить("Стоимость"             , "ОбщСтоимость");
	
	// Правила для регистра "ФактическиеДоходыИРасходы".
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактДоходовИРасходовПоДням.Метаданные().Имя, Правила);
	
	ПравилаТаблицы = Новый Структура();
	Правила.Вставить("ЗатратыМатРесурсовФакт", ПравилаТаблицы);
	
	// Делаем одно движение по ТЧ.
	ПравилаДвижения = Новый Структура();
	ПравилаТаблицы.Вставить("ОпределениеФактическихДоходов", ПравилаДвижения);
	
	// Правила связи.
	ПравилаДвижения.Вставить("ПроектнаяЗадача", "Шапка_ПроектнаяЗадача");
	ПравилаДвижения.Вставить("Статья", "Статья");
	ПравилаДвижения.Вставить("ДатаНачисления", "ДатаНачисления");
	ПравилаДвижения.Вставить("ВидЭлемента", Новый Структура("Значение", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход));
	ПравилаДвижения.Вставить("Валюта", "Валюта");
	ПравилаДвижения.Вставить("СуммаВалютная", "ОбщСтоимость");
	ПравилаДвижения.Вставить("Контрагент", "Контрагент");
	ПравилаДвижения.Вставить("Договор", "Договор");
	
	Правила = Новый Структура();
	ПравилаНаложения.Вставить(Движения.упоФактДоходовИРасходовОбороты.Метаданные().Имя, Правила);
	
	// Правила готовы.
	Возврат ПравилаНаложения; 

КонецФункции

Процедура СвернутьТаблицуДвижений(ИмяРегистра, ТаблицаДвижений)
		
	КолонкиГруппировок	= "";
	КолонкиСуммирования = "";
	
	ТипЧисло = Тип("Число");
	
	РесурсыРегистра = Движения[ИмяРегистра].Метаданные().Ресурсы;
	Для каждого Ресурс Из РесурсыРегистра Цикл
		Если Ресурс.Тип.СодержитТип(ТипЧисло) Тогда
			КолонкиСуммирования = КолонкиСуммирования + ?(НЕ ПустаяСтрока(КолонкиСуммирования), ",", "") + Ресурс.Имя;
		Иначе
			КолонкиГруппировок = КолонкиГруппировок + ?(НЕ ПустаяСтрока(КолонкиГруппировок), ",", "") + Ресурс.Имя;
		КонецЕсли;	
	КонецЦикла;
		
	Для каждого Колонка Из ТаблицаДвижений.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если ИмяКолонки = "НомерСтроки" Тогда
			Продолжить;
		КонецЕсли;	
		Если Не РесурсыРегистра.Найти(ИмяКолонки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КолонкиГруппировок = КолонкиГруппировок + ?(НЕ ПустаяСтрока(КолонкиГруппировок), ",", "") + ИмяКолонки;
	КонецЦикла;
	ТаблицаДвижений.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
КонецПроцедуры	

// Получает подготовленные данные для движений по регистрам и обрабатывает их в соответствии со своими нуждами.
//
// Параметры:
//  ДанныеДокумента	 - Структура				 - структура данных документа.
//  ДанныеДвижений	 - Структура				 - структура данных движений по регистрам.
//  Отказ			 - Булево					 - признак отказа от записи документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - в данный параметр передается текущий режим проведения.
//
Процедура ПодготовитьДанныеДляДвижений(ДанныеДокумента, ДанныеДвижений, Отказ, РежимПроведения) Экспорт
			
	ТаблицаДвижения = ДанныеДвижений[Движения.упоФактЗатратМатериальныхРесурсов.Метаданные().Имя];	
		
	упоПроектыИЗадачиСервер.ЗаполнитьКоличествоПоКоличествуЕдНормированияМатериальныхЗатрат(ТаблицаДвижения);
	
	СвернутьТаблицуДвижений("упоФактЗатратМатериальныхРесурсов", ТаблицаДвижения);
		
	ТаблицаДвиженияФактическиеДоходыРасходы = ДанныеДвижений[Движения.упоФактДоходовИРасходовПоДням.Метаданные().Имя];
	ТаблицаДвиженияФактическиеДоходыРасходыПодразделения = ДанныеДвижений[Движения.упоФактДоходовИРасходовОбороты.Метаданные().Имя];
	
	// Документ должен проводиться, если в табличной части присутствует разная номенклатура от одного поставщика
	// или одна номенклатура от разных поставщиков.		
	СвернутьТаблицуДвижений("упоФактДоходовИРасходовПоДням", ТаблицаДвиженияФактическиеДоходыРасходы);
		
	Если ВключитьМатРесурсыВФактРасходов Тогда
		// Пересчет валютной суммы.
		упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвиженияФактическиеДоходыРасходы);
				
		текущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
				
		СвойстваПроведения = Новый Структура;
		СвойстваПроведения.Вставить("Проект", Проект);
		СвойстваПроведения.Вставить("Версия", текущаяВерсия);
		СвойстваПроведения.Вставить("ПроектнаяЗадача", текущаяВерсия);
		
		упоАналитикаПоПодразделениямСервер.ЗаполнитьОбщиеНастройкиУчетаПоПодразделениям(ЭтотОбъект, СвойстваПроведения);
		упоАналитикаПоПодразделениямСервер.ПодготовитьТаблицыДвижений(ЭтотОбъект, ДанныеДвижений, СвойстваПроекта, СвойстваПроведения, Отказ);
		
		СвернутьТаблицуДвижений("упоФактДоходовИРасходовОбороты", ТаблицаДвиженияФактическиеДоходыРасходыПодразделения);
		
	Иначе
		// Движений делать не нужно.
		ТаблицаДвиженияФактическиеДоходыРасходы.Очистить();
		ТаблицаДвиженияФактическиеДоходыРасходыПодразделения.Очистить();
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события.
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Основание    - Произвольный		- значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.упоПроектнаяЗадача") Тогда
		ЗаполнитьПоПЗ(Основание);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоПЗ(Основание)
	
	Проект = упоФункцииБСП.ПолучитьЗначениеРеквизита(Основание, "Проект");
	ПроектнаяЗадача = Основание;
	
	ПолучаемыеСвойства = "ВключитьМатРесурсыВПланРасходов, НормаСтоимости";
	СвойстваПЗ = упоПроектыИЗадачиСервер.ПолучитьСвойстваПроектнойЗадачи(Основание, ПолучаемыеСвойства);
	ВключитьМатРесурсыВФактРасходов = СвойстваПЗ.ВключитьМатРесурсыВПланРасходов;
	НормаСтоимости = СвойстваПЗ.НормаСтоимости;
	
	СвойстваПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Запрос.УстановитьПараметр("ТекВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	Запрос.УстановитьПараметр("ВидЭлемента", Перечисления.упоВидЭлементаПланаДоходовИРасходов.Расход);
	Запрос.УстановитьПараметр("ИсточникПлана", Перечисления.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты);
	
	// В зависимости от того, стоит ли флаг ВключитьМатРесурсыВПланРасходов - выбор ТЧ или из регистра.
	// Если по проекту не ведутся расходы по натуральным показателям, то количества в регистре нет и придется его расчитать.
	Если ВключитьМатРесурсыВФактРасходов Тогда
		Если СвойстваПроекта.РасходыПоНатуральнымПоказателям Тогда
			Запрос.Текст = ПолучитьТекстЗапросаКоличествоИзРС(СвойстваПроекта.РасходыПоПодразделениям);
			ИндексЗатратМатРесурсов = 2;
			ИндексРаспределениеЗатрат = 3;
		Иначе
			Запрос.Текст = ПолучитьТекстЗапросаКоличествоРасчетное(СвойстваПроекта.РасходыПоПодразделениям);
			ИндексЗатратМатРесурсов = 3;
			ИндексРаспределениеЗатрат = 6;
		КонецЕсли;
	Иначе
		Запрос.Текст = ПолучитьТекстЗапросаИзТЧ(СвойстваПроекта.РасходыПоПодразделениям);
		ИндексЗатратМатРесурсов = 0;
		ИндексРаспределениеЗатрат = 1;
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();	
	тзЗатратыМатРесурсов = Результат[ИндексЗатратМатРесурсов].Выгрузить();
	
	Если СвойстваПроекта.РасходыПоПодразделениям Тогда
		тзРаспределениеЗатрат = Результат[ИндексРаспределениеЗатрат].Выгрузить();
	КонецЕсли;
	
	Если ВключитьМатРесурсыВФактРасходов И СвойстваПроекта.РасходыПоПодразделениям Тогда
		РасчетноеКоличество = Не СвойстваПроекта.РасходыПоНатуральнымПоказателям;
		Если РасчетноеКоличество Тогда
			// Проверить распределение при расчетном количестве.
			тзИндексы = тзЗатратыМатРесурсов.Скопировать(, "ИндексСтрокРаспределенияИсходный");
			тзИндексы.Свернуть("ИндексСтрокРаспределенияИсходный");
			Отбор = Новый Структура("ИндексСтрокРаспределенияИсходный");
			Для Каждого Строка Из тзИндексы Цикл
				ЗаполнитьЗначенияСвойств(Отбор, Строка);
				НайденныеСтроки = тзЗатратыМатРесурсов.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() <= 1 Тогда
					Продолжить;
				КонецЕсли;	
				ОстатокКоличество = НайденныеСтроки[0].КоличествоТЧ;
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ОстатокКоличество = ОстатокКоличество - НайденнаяСтрока.Количество;
				КонецЦикла;	
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ОстатокКоличество;
			КонецЦикла;	
		КонецЕсли;
				
		// Индекс распределения надо заполнить с учетом даты начисления.
		ИндексСтрокРаспределения = -1;
		Отбор = Новый Структура("ИндексСтрокРаспределенияИсходный, ДатаНачисления");
		Если РасчетноеКоличество Тогда
			СоответствиеОстатокРаспределения = Новый Соответствие;
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.упоПодразделения"));
			ТЗ.Колонки.Добавить("Роль", Новый ОписаниеТипов("СправочникСсылка.упоРоли"));
			ТЗ.Колонки.Добавить("СобствСилы_Субподряд", Новый ОписаниеТипов("СправочникСсылка.упоСобственныеСилыСубподряд"));
			ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
			ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		КонецЕсли;	
		
		Для Каждого Строка Из тзЗатратыМатРесурсов Цикл
						
			ИндексСтрокРаспределения = ИндексСтрокРаспределения + 1;
			Строка.ИндексСтрокРаспределения = ИндексСтрокРаспределения;
			ЗаполнитьЗначенияСвойств(Отбор, Строка);
			НайденныеСтроки = тзРаспределениеЗатрат.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ИндексСтрокиВладельца = ИндексСтрокРаспределения;
			КонецЦикла;
			
			Если Не РасчетноеКоличество Тогда
				Продолжить;
			КонецЕсли;	
			
			Если НайденныеСтроки.Количество() = 1 Тогда
				НайденнаяСтрока.Количество = Строка.Количество;
				Продолжить;
			КонецЕсли;
			
			СоответствиеИндексСтроки = СоответствиеОстатокРаспределения.Получить(Строка.ИндексСтрокРаспределенияИсходный);
			Если СоответствиеИндексСтроки = Неопределено Тогда
				СоответствиеИндексСтроки = ТЗ.СкопироватьКолонки();
				СоответствиеОстатокРаспределения.Вставить(Строка.ИндексСтрокРаспределенияИсходный, СоответствиеИндексСтроки);
			КонецЕсли;	
			
			ОстатокКоличество = Строка.Количество;
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.Количество = Окр(Строка.Количество * НайденнаяСтрока.Сумма / НайденнаяСтрока.СуммаОбщая, 3); 
				ОстатокКоличество = ОстатокКоличество - НайденнаяСтрока.Количество;
				// Суммы и количества без разреза даты начисления тоже должны сойтись.
				ПараметрыРаспределения = Новый Структура("Подразделение, Роль, СобствСилы_Субподряд");
				ЗаполнитьЗначенияСвойств(ПараметрыРаспределения, НайденнаяСтрока);
				СтрокиРаспределения = СоответствиеИндексСтроки.НайтиСтроки(ПараметрыРаспределения);
				Если СтрокиРаспределения.Количество() = 0 Тогда
					СтрокаРаспределения = СоответствиеИндексСтроки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРаспределения, ПараметрыРаспределения);
					СтрокаРаспределения.Сумма = НайденнаяСтрока.СуммаОбъемы;
					СтрокаРаспределения.Количество = ?(Строка.ОбщСтоимостьТЧ = 0, 0, Строка.КоличествоТЧ * НайденнаяСтрока.СуммаОбъемы / Строка.ОбщСтоимостьТЧ);
				Иначе
					СтрокаРаспределения = СтрокиРаспределения[0];
				КонецЕсли;	
				СтрокаРаспределения.Сумма = СтрокаРаспределения.Сумма - НайденнаяСтрока.Сумма;
				СтрокаРаспределения.Количество = СтрокаРаспределения.Количество - НайденнаяСтрока.Количество;
			КонецЦикла;
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ОстатокКоличество;
			СтрокаРаспределения.Количество = СтрокаРаспределения.Количество - ОстатокКоличество;
		КонецЦикла;
		
		Если РасчетноеКоличество Тогда
			Для каждого СтрокаИндекса Из СоответствиеОстатокРаспределения Цикл
				ИндексСтрокиВладельца = Неопределено;
				Для Каждого Строка Из СтрокаИндекса.Значение Цикл
					ПараметрыРаспределения = Новый Структура("Подразделение, Роль, СобствСилы_Субподряд");
					ЗаполнитьЗначенияСвойств(ПараметрыРаспределения, Строка);
					Если ИндексСтрокиВладельца <> Неопределено Тогда
						ПараметрыРаспределения.Вставить("ИндексСтрокиВладельца", ИндексСтрокиВладельца);
					КонецЕсли;	
					НайденныеСтроки = тзРаспределениеЗатрат.НайтиСтроки(ПараметрыРаспределения);
					Если НайденныеСтроки.Количество() <> 0 Тогда
						НайденныеСтроки[0].Сумма = НайденныеСтроки[0].Сумма + Строка.Сумма;
						НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + Строка.Количество;
						Если ИндексСтрокиВладельца = Неопределено Тогда
							ИндексСтрокиВладельца = НайденныеСтроки[0].ИндексСтрокиВладельца; 
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;	
			КонецЦикла;	
		КонецЕсли;	
			
	КонецЕсли;
		
	ЗатратыМатРесурсовФакт.Загрузить(тзЗатратыМатРесурсов);
	Если СвойстваПроекта.РасходыПоПодразделениям Тогда
		РаспределениеЗатрат.Загрузить(тзРаспределениеЗатрат);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаИзТЧ(РасходыПоПодразделениям)
	
	МассивТекстовТаблиц = Новый Массив;
	
	МассивТекстовТаблиц.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	МатРесурсы.Валюта КАК Валюта,
	                             |	МатРесурсы.ВидОперации КАК ВидОперации,
	                             |	ВЫБОР
	                             |		КОГДА МатРесурсы.СпособПривязкиРасхода = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	                             |			ТОГДА МатРесурсы.ДатаПривязки
	                             |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                             |	КОНЕЦ КАК ДатаНачисления,
	                             |	МатРесурсы.Договор КАК Договор,
	                             |	МатРесурсы.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	                             |	МатРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	                             |	МатРесурсы.Контрагент КАК Контрагент,
	                             |	МатРесурсы.Номенклатура КАК Ресурс,
	                             |	МатРесурсы.Цена КАК Стоимость,
	                             |	МатРесурсы.СтатьяЗатрат КАК Статья,
	                             |	МатРесурсы.Количество КАК Количество,
	                             |	МатРесурсы.СуммаВалютная КАК ОбщСтоимость
	                             |ИЗ
	                             |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
	                             |			,
	                             |			ПроектнаяЗадача = &Ссылка
	                             |				И версия = &текВерсия) КАК МатРесурсы
	                             |ГДЕ
	                             |	МатРесурсы.Сумма <> 0");
	
	Если РасходыПоПодразделениям Тогда
		МассивТекстовТаблиц.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
                                     |  СУММА(упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная) КАК Сумма,
                                     |  СУММА(упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество) КАК Количество
                                     |ИЗ
                                     |  РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
                                     |          ,
                                     |          ПроектнаяЗадача = &Ссылка
                                     |              И версия = &текВерсия
                                     |              И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
                                     |ГДЕ
                                     |  (упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0
                                     |          ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
                                     |          ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.Количество <> 0)
                                     |
                                     |СГРУППИРОВАТЬ ПО
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд
                                     |
                                     |УПОРЯДОЧИТЬ ПО
                                     |  СобствСилы_Субподряд УБЫВ");
	КонецЕсли;
	
	Текст = СтрСоединить(МассивТекстовТаблиц, Символы.ПС + ";" + Символы.ПС); 
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТекстЗапросаКоличествоИзРС(РасходыПоПодразделениям)
	
	МассивТекстовТаблиц = Новый Массив;
	
	МассивТекстовТаблиц.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	МатРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                             |	МатРесурсы.Валюта КАК Валюта,
	                             |	МатРесурсы.ВидОперации КАК ВидОперации,
	                             |	ВЫБОР
	                             |		КОГДА МатРесурсы.СпособПривязкиРасхода = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	                             |			ТОГДА МатРесурсы.ДатаПривязки
	                             |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                             |	КОНЕЦ КАК ДатаНачисления,
	                             |	МатРесурсы.Договор КАК Договор,
	                             |	МатРесурсы.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	                             |	МатРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	                             |	МатРесурсы.Контрагент КАК Контрагент,
	                             |	МатРесурсы.Номенклатура КАК Ресурс,
	                             |	МатРесурсы.СтатьяЗатрат КАК Статья
	                             |ПОМЕСТИТЬ ВТ_МатРесурсы
	                             |ИЗ
	                             |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
	                             |			,
	                             |			ПроектнаяЗадача = &Ссылка
	                             |				И версия = &текВерсия) КАК МатРесурсы
	                             |ГДЕ
	                             |	МатРесурсы.Сумма <> 0
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	РегПлан.Валюта КАК Валюта,
	                             |	ВТ_МатРесурсы.ВидОперации КАК ВидОперации,
	                             |	РегПлан.ДатаНачисления КАК ДатаНачисления,
	                             |	РегПлан.Договор КАК Договор,
	                             |	РегПлан.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	                             |	МАКСИМУМ(ВТ_МатРесурсы.ИндексСтрокРаспределения) КАК ИндексСтрокРаспределения,
	                             |	РегПлан.Контрагент КАК Контрагент,
	                             |	РегПлан.Номенклатура КАК Ресурс,
	                             |	РегПлан.Статья КАК Статья,
	                             |	РегПлан.Количество КАК Количество,
	                             |	РегПлан.СуммаВалютная КАК ОбщСтоимость,
	                             |	РегПлан.Подразделение КАК Подразделение,
	                             |	РегПлан.Роль КАК Роль,
	                             |	РегПлан.СобствСилы_Субподряд КАК СобствСилы_Субподряд
	                             |ПОМЕСТИТЬ ВТ_ДанныеРегистра
	                             |ИЗ
	                             |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	                             |			,
	                             |			Версия = &ТекВерсия
	                             |				И ПроектнаяЗадача = &Ссылка
	                             |				И ВидЭлемента = &ВидЭлемента
	                             |				И ИсточникПлана = &ИсточникПлана) КАК РегПлан
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатРесурсы КАК ВТ_МатРесурсы
	                             |		ПО РегПлан.ПроектнаяЗадача = ВТ_МатРесурсы.ПроектнаяЗадача
	                             |			И РегПлан.Номенклатура = ВТ_МатРесурсы.Ресурс
	                             |			И РегПлан.ЕдиницаИзмерения = ВТ_МатРесурсы.ЕдиницаНормирования
	                             |			И РегПлан.Валюта = ВТ_МатРесурсы.Валюта
	                             |			И РегПлан.Статья = ВТ_МатРесурсы.Статья
	                             |			И РегПлан.Контрагент = ВТ_МатРесурсы.Контрагент
	                             |			И РегПлан.Договор = ВТ_МатРесурсы.Договор
	                             |			И (ВЫБОР
	                             |				КОГДА ВТ_МатРесурсы.ДатаНачисления = ДАТАВРЕМЯ(1, 1, 1)
	                             |					ТОГДА ИСТИНА
	                             |				ИНАЧЕ РегПлан.ДатаНачисления = ВТ_МатРесурсы.ДатаНачисления
	                             |			КОНЕЦ)
	                             |ГДЕ
	                             |	НЕ(РегПлан.Сумма = 0
	                             |				И РегПлан.СуммаВалютная = 0
	                             |				И РегПлан.Количество = 0)
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	РегПлан.Валюта,
	                             |	ВТ_МатРесурсы.ВидОперации,
	                             |	РегПлан.ДатаНачисления,
	                             |	РегПлан.Договор,
	                             |	РегПлан.ЕдиницаИзмерения,
	                             |	РегПлан.Контрагент,
	                             |	РегПлан.Номенклатура,
	                             |	РегПлан.Статья,
	                             |	РегПлан.Количество,
	                             |	РегПлан.СуммаВалютная,
	                             |	РегПлан.Подразделение,
	                             |	РегПлан.Роль,
	                             |	РегПлан.СобствСилы_Субподряд
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	ВТ_ДанныеРегистра.Валюта КАК Валюта,
	                             |	ВТ_ДанныеРегистра.ВидОперации КАК ВидОперации,
	                             |	ВТ_ДанныеРегистра.ДатаНачисления КАК ДатаНачисления,
	                             |	ВТ_ДанныеРегистра.Договор КАК Договор,
	                             |	ВТ_ДанныеРегистра.ЕдиницаНормирования КАК ЕдиницаНормирования,
	                             |	ВТ_ДанныеРегистра.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияИсходный,
	                             |	0 КАК ИндексСтрокРаспределения,
	                             |	ВТ_ДанныеРегистра.Контрагент КАК Контрагент,
	                             |	ВТ_ДанныеРегистра.Ресурс КАК Ресурс,
	                             |	ВТ_ДанныеРегистра.Статья КАК Статья,
	                             |	СУММА(ВТ_ДанныеРегистра.ОбщСтоимость) КАК ОбщСтоимость,
	                             |	СУММА(ВТ_ДанныеРегистра.Количество) КАК Количество,
	                             |	ВЫБОР
	                             |		КОГДА СУММА(ВТ_ДанныеРегистра.Количество) <> 0
	                             |			ТОГДА СУММА(ВТ_ДанныеРегистра.ОбщСтоимость) / СУММА(ВТ_ДанныеРегистра.Количество)
	                             |		ИНАЧЕ 0
	                             |	КОНЕЦ КАК Стоимость
	                             |ИЗ
	                             |	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	ВТ_ДанныеРегистра.ВидОперации,
	                             |	ВТ_ДанныеРегистра.Валюта,
	                             |	ВТ_ДанныеРегистра.Контрагент,
	                             |	ВТ_ДанныеРегистра.ДатаНачисления,
	                             |	ВТ_ДанныеРегистра.ЕдиницаНормирования,
	                             |	ВТ_ДанныеРегистра.Ресурс,
	                             |	ВТ_ДанныеРегистра.Статья,
	                             |	ВТ_ДанныеРегистра.Договор,
	                             |	ВТ_ДанныеРегистра.ИндексСтрокРаспределения");
	                             
	
	Если РасходыПоПодразделениям Тогда
		МассивТекстовТаблиц.Добавить("ВЫБРАТЬ
                                     |  ВТ_ДанныеРегистра.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияИсходный,
                                     |  0 КАК ИндексСтрокиВладельца,
                                     |  ВТ_ДанныеРегистра.ДатаНачисления КАК ДатаНачисления,
                                     |  ВТ_ДанныеРегистра.Подразделение КАК Подразделение,
                                     |  ВТ_ДанныеРегистра.Роль КАК Роль,
                                     |  ВТ_ДанныеРегистра.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                                     |  СУММА(ВТ_ДанныеРегистра.ОбщСтоимость) КАК Сумма,
                                     |  СУММА(ВТ_ДанныеРегистра.Количество) КАК Количество
                                     |ИЗ
                                     |  ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
                                     |
                                     |СГРУППИРОВАТЬ ПО
                                     |  ВТ_ДанныеРегистра.Подразделение,
                                     |  ВТ_ДанныеРегистра.Роль,
                                     |  ВТ_ДанныеРегистра.СобствСилы_Субподряд,
                                     |  ВТ_ДанныеРегистра.ИндексСтрокРаспределения,
                                     |  ВТ_ДанныеРегистра.ДатаНачисления
                                     |
                                     |УПОРЯДОЧИТЬ ПО
                                     |  СобствСилы_Субподряд УБЫВ");
	КонецЕсли;
	
	Текст = СтрСоединить(МассивТекстовТаблиц, Символы.ПС + ";" + Символы.ПС); 
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТекстЗапросаКоличествоРасчетное(РасходыПоПодразделениям)
	
	МассивТекстовТаблиц = Новый Массив;
	
	МассивТекстовТаблиц.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	МатРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                             |	МатРесурсы.Валюта КАК Валюта,
	                             |	МатРесурсы.ВидОперации КАК ВидОперации,
	                             |	ВЫБОР
	                             |		КОГДА МатРесурсы.СпособПривязкиРасхода = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	                             |			ТОГДА МатРесурсы.ДатаПривязки
	                             |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                             |	КОНЕЦ КАК ДатаНачисления,
	                             |	МатРесурсы.Договор КАК Договор,
	                             |	МатРесурсы.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	                             |	МатРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	                             |	МатРесурсы.Контрагент КАК Контрагент,
	                             |	МатРесурсы.Номенклатура КАК Ресурс,
	                             |	МатРесурсы.СтатьяЗатрат КАК Статья,
	                             |	СУММА(МатРесурсы.Количество) КАК Количество,
	                             |	СУММА(МатРесурсы.СуммаВалютная) КАК ОбщСтоимость
	                             |ПОМЕСТИТЬ ВТ_МатРесурсы
	                             |ИЗ
	                             |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
	                             |			,
	                             |			ПроектнаяЗадача = &Ссылка
	                             |				И версия = &текВерсия) КАК МатРесурсы
	                             |ГДЕ
	                             |	МатРесурсы.Сумма <> 0
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	МатРесурсы.ПроектнаяЗадача,
	                             |	МатРесурсы.Валюта,
	                             |	МатРесурсы.ВидОперации,
	                             |	МатРесурсы.Договор,
	                             |	МатРесурсы.ЕдиницаИзмерения,
	                             |	МатРесурсы.ИндексСтрокРаспределения,
	                             |	МатРесурсы.Контрагент,
	                             |	МатРесурсы.Номенклатура,
	                             |	МатРесурсы.СтатьяЗатрат,
	                             |	ВЫБОР
	                             |		КОГДА МатРесурсы.СпособПривязкиРасхода = ЗНАЧЕНИЕ(Перечисление.упоСпособПривязкиДоходаРасхода.НаДату)
	                             |			ТОГДА МатРесурсы.ДатаПривязки
	                             |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                             |	КОНЕЦ
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                             |	РегПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
	                             |	РегПлан.Валюта КАК Валюта,
	                             |	ВТ_МатРесурсы.ВидОперации КАК ВидОперации,
	                             |	РегПлан.ДатаНачисления КАК ДатаНачисления,
	                             |	РегПлан.Договор КАК Договор,
	                             |	РегПлан.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	                             |	МАКСИМУМ(ВТ_МатРесурсы.ИндексСтрокРаспределения) КАК ИндексСтрокРаспределения,
	                             |	РегПлан.Контрагент КАК Контрагент,
	                             |	РегПлан.Номенклатура КАК Ресурс,
	                             |	РегПлан.Статья КАК Статья,
	                             |	СУММА(РегПлан.СуммаВалютная) КАК СуммаВалютная
	                             |ПОМЕСТИТЬ ВТ_ДанныеРегистра
	                             |ИЗ
	                             |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	                             |			,
	                             |			Версия = &ТекВерсия
	                             |				И ПроектнаяЗадача = &Ссылка
	                             |				И ВидЭлемента = &ВидЭлемента
	                             |				И ИсточникПлана = &ИсточникПлана) КАК РегПлан
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатРесурсы КАК ВТ_МатРесурсы
	                             |		ПО РегПлан.ПроектнаяЗадача = ВТ_МатРесурсы.ПроектнаяЗадача
	                             |			И РегПлан.Номенклатура = ВТ_МатРесурсы.Ресурс
	                             |			И РегПлан.ЕдиницаИзмерения = ВТ_МатРесурсы.ЕдиницаНормирования
	                             |			И РегПлан.Валюта = ВТ_МатРесурсы.Валюта
	                             |			И РегПлан.Статья = ВТ_МатРесурсы.Статья
	                             |			И РегПлан.Контрагент = ВТ_МатРесурсы.Контрагент
	                             |			И РегПлан.Договор = ВТ_МатРесурсы.Договор
	                             |			И (ВЫБОР
	                             |				КОГДА ВТ_МатРесурсы.ДатаНачисления = ДАТАВРЕМЯ(1, 1, 1)
	                             |					ТОГДА ИСТИНА
	                             |				ИНАЧЕ РегПлан.ДатаНачисления = ВТ_МатРесурсы.ДатаНачисления
	                             |			КОНЕЦ)
	                             |ГДЕ
	                             |	НЕ(РегПлан.Сумма = 0
	                             |				И РегПлан.СуммаВалютная = 0
	                             |				И РегПлан.Количество = 0)
	                             |
	                             |СГРУППИРОВАТЬ ПО
	                             |	РегПлан.ПроектнаяЗадача,
	                             |	РегПлан.Валюта,
	                             |	ВТ_МатРесурсы.ВидОперации,
	                             |	РегПлан.ДатаНачисления,
	                             |	РегПлан.Договор,
	                             |	РегПлан.ЕдиницаИзмерения,
	                             |	РегПлан.Контрагент,
	                             |	РегПлан.Номенклатура,
	                             |	РегПлан.Статья
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	ВТ_ДанныеРегистра.Валюта КАК Валюта,
	                             |	ВТ_ДанныеРегистра.ВидОперации КАК ВидОперации,
	                             |	ВТ_ДанныеРегистра.ДатаНачисления КАК ДатаНачисления,
	                             |	ВТ_ДанныеРегистра.Договор КАК Договор,
	                             |	ВТ_ДанныеРегистра.ЕдиницаНормирования КАК ЕдиницаНормирования,
	                             |	ВТ_ДанныеРегистра.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	                             |	ВТ_ДанныеРегистра.Контрагент КАК Контрагент,
	                             |	ВТ_ДанныеРегистра.Ресурс КАК Ресурс,
	                             |	ВТ_ДанныеРегистра.Статья КАК Статья,
	                             |	ВТ_ДанныеРегистра.СуммаВалютная КАК СуммаВалютная,
	                             |	ВТ_МатРесурсы.Количество КАК КоличествоТЧ,
	                             |	ВТ_МатРесурсы.ОбщСтоимость КАК ОбщСтоимостьТЧ,
	                             |	ВТ_МатРесурсы.ДатаНачисления КАК ДатаНачисленияТЧ,
	                             |	ВЫБОР
	                             |		КОГДА ЕСТЬNULL(ВТ_МатРесурсы.ДатаНачисления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	                             |			ТОГДА ВТ_МатРесурсы.Количество
	                             |		КОГДА ЕСТЬNULL(ВТ_МатРесурсы.ОбщСтоимость, 0) = 0
	                             |			ТОГДА 0
	                             |		ИНАЧЕ ВТ_ДанныеРегистра.СуммаВалютная * ВТ_МатРесурсы.Количество / ВТ_МатРесурсы.ОбщСтоимость
	                             |	КОНЕЦ КАК Количество
	                             |ПОМЕСТИТЬ ВТ_ДанныеРегистраСКоличеством
	                             |ИЗ
	                             |	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МатРесурсы КАК ВТ_МатРесурсы
	                             |		ПО ВТ_ДанныеРегистра.ПроектнаяЗадача = ВТ_МатРесурсы.ПроектнаяЗадача
	                             |			И ВТ_ДанныеРегистра.ИндексСтрокРаспределения = ВТ_МатРесурсы.ИндексСтрокРаспределения
	                             |			И ВТ_ДанныеРегистра.Ресурс = ВТ_МатРесурсы.Ресурс
	                             |			И ВТ_ДанныеРегистра.ЕдиницаНормирования = ВТ_МатРесурсы.ЕдиницаНормирования
	                             |			И ВТ_ДанныеРегистра.Валюта = ВТ_МатРесурсы.Валюта
	                             |			И ВТ_ДанныеРегистра.Статья = ВТ_МатРесурсы.Статья
	                             |			И ВТ_ДанныеРегистра.Контрагент = ВТ_МатРесурсы.Контрагент
	                             |			И ВТ_ДанныеРегистра.Договор = ВТ_МатРесурсы.Договор
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	ВТ_ДанныеРегистраСКоличеством.Валюта КАК Валюта,
	                             |	ВТ_ДанныеРегистраСКоличеством.ВидОперации КАК ВидОперации,
	                             |	ВТ_ДанныеРегистраСКоличеством.ДатаНачисления КАК ДатаНачисления,
	                             |	ВТ_ДанныеРегистраСКоличеством.Договор КАК Договор,
	                             |	ВТ_ДанныеРегистраСКоличеством.ЕдиницаНормирования КАК ЕдиницаНормирования,
	                             |	ВТ_ДанныеРегистраСКоличеством.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияИсходный,
	                             |	0 КАК ИндексСтрокРаспределения,
	                             |	ВТ_ДанныеРегистраСКоличеством.Контрагент КАК Контрагент,
	                             |	ВТ_ДанныеРегистраСКоличеством.Ресурс КАК Ресурс,
	                             |	ВТ_ДанныеРегистраСКоличеством.Статья КАК Статья,
	                             |	ВЫРАЗИТЬ(ВТ_ДанныеРегистраСКоличеством.СуммаВалютная КАК ЧИСЛО(15, 2)) КАК ОбщСтоимость,
	                             |	ВЫРАЗИТЬ(ВТ_ДанныеРегистраСКоличеством.Количество КАК ЧИСЛО(15, 3)) КАК Количество,
	                             |	ВЫРАЗИТЬ(ВЫБОР
	                             |			КОГДА ВТ_ДанныеРегистраСКоличеством.Количество = 0
	                             |				ТОГДА 0
	                             |			ИНАЧЕ ВТ_ДанныеРегистраСКоличеством.СуммаВалютная / ВТ_ДанныеРегистраСКоличеством.Количество
	                             |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Стоимость,
	                             |	ВТ_ДанныеРегистраСКоличеством.КоличествоТЧ КАК КоличествоТЧ,
	                             |	ВТ_ДанныеРегистраСКоличеством.ОбщСтоимостьТЧ КАК ОбщСтоимостьТЧ,
	                             |	ВТ_ДанныеРегистраСКоличеством.ДатаНачисленияТЧ КАК ДатаНачисленияТЧ
	                             |ИЗ
	                             |	ВТ_ДанныеРегистраСКоличеством КАК ВТ_ДанныеРегистраСКоличеством");
	                             
	
	Если РасходыПоПодразделениям Тогда
		МассивТекстовТаблиц.Добавить("ВЫБРАТЬ РАЗРЕШЕННЫЕ
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца КАК ИндексСтрокРаспределения,
                                     |  ВТ_ДанныеРегистраСКоличеством.ДатаНачисления КАК ДатаНачисления,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.Роль КАК Роль,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                                     |  ЕСТЬNULL(ВТ_ДанныеРегистраСКоличеством.СуммаВалютная, 0) КАК Сумма,
                                     |  упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная КАК СуммаОбъемы
                                     |ПОМЕСТИТЬ ВТ_ДанныеОбъемов
                                     |ИЗ
                                     |  ВТ_ДанныеРегистраСКоличеством КАК ВТ_ДанныеРегистраСКоличеством
                                     |      ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоДанныеПлановОбъемовПодразделения.СрезПоследних(
                                     |              ,
                                     |              ПроектнаяЗадача = &Ссылка
                                     |                  И версия = &текВерсия
                                     |                  И ВидОбъема = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход)) КАК упоДанныеПлановОбъемовПодразделенияСрезПоследних
                                     |      ПО ВТ_ДанныеРегистраСКоличеством.ИндексСтрокРаспределения = упоДанныеПлановОбъемовПодразделенияСрезПоследних.ИндексСтрокиВладельца
                                     |ГДЕ
                                     |  (упоДанныеПлановОбъемовПодразделенияСрезПоследних.Сумма <> 0
                                     |          ИЛИ упоДанныеПлановОбъемовПодразделенияСрезПоследних.СуммаВалютная <> 0)
                                     |;
                                     |
                                     |////////////////////////////////////////////////////////////////////////////////
                                     |ВЫБРАТЬ
                                     |  ВТ_ДанныеОбъемов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
                                     |  ВТ_ДанныеОбъемов.ДатаНачисления КАК ДатаНачисления,
                                     |  СУММА(ВТ_ДанныеОбъемов.СуммаОбъемы) КАК СуммаОбъемы
                                     |ПОМЕСТИТЬ ВТ_ДанныеОбъемовСгруппированные
                                     |ИЗ
                                     |  ВТ_ДанныеОбъемов КАК ВТ_ДанныеОбъемов
                                     |
                                     |СГРУППИРОВАТЬ ПО
                                     |  ВТ_ДанныеОбъемов.ИндексСтрокРаспределения,
                                     |  ВТ_ДанныеОбъемов.ДатаНачисления
                                     |;
                                     |
                                     |////////////////////////////////////////////////////////////////////////////////
                                     |ВЫБРАТЬ
                                     |  ВТ_ДанныеОбъемов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределенияИсходный,
                                     |  0 КАК ИндексСтрокиВладельца,
                                     |  ВТ_ДанныеОбъемов.ДатаНачисления КАК ДатаНачисления,
                                     |  ВТ_ДанныеОбъемов.Подразделение КАК Подразделение,
                                     |  ВТ_ДанныеОбъемов.Роль КАК Роль,
                                     |  ВТ_ДанныеОбъемов.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
                                     |  ВТ_ДанныеОбъемов.Сумма КАК СуммаОбщая,
                                     |  ВЫБОР
                                     |      КОГДА ЕСТЬNULL(ВТ_ДанныеОбъемовСгруппированные.СуммаОбъемы, 0) = 0
                                     |          ТОГДА 0
                                     |      ИНАЧЕ ВТ_ДанныеОбъемов.Сумма * ВТ_ДанныеОбъемов.СуммаОбъемы / ВТ_ДанныеОбъемовСгруппированные.СуммаОбъемы
                                     |  КОНЕЦ КАК Сумма,
                                     |  ВТ_ДанныеОбъемов.СуммаОбъемы КАК СуммаОбъемы,
                                     |  0 КАК Количество
                                     |ИЗ
                                     |  ВТ_ДанныеОбъемов КАК ВТ_ДанныеОбъемов
                                     |      ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеОбъемовСгруппированные КАК ВТ_ДанныеОбъемовСгруппированные
                                     |      ПО ВТ_ДанныеОбъемов.ИндексСтрокРаспределения = ВТ_ДанныеОбъемовСгруппированные.ИндексСтрокРаспределения
                                     |          И ВТ_ДанныеОбъемов.ДатаНачисления = ВТ_ДанныеОбъемовСгруппированные.ДатаНачисления
                                     |
                                     |УПОРЯДОЧИТЬ ПО
                                     |  СобствСилы_Субподряд УБЫВ");
	КонецЕсли;
	
	Текст = СтрСоединить(МассивТекстовТаблиц, Символы.ПС + ";" + Символы.ПС); 
	Возврат Текст;
	
КонецФункции

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
	
	лмПроверитьЗаполнениеРеквизитов(Отказ);
	
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево			- признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект 	- содержит сам объект.
//  Отказ        - Булево 			- признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВключитьМатРесурсыВФактРасходов Тогда
		ПроверяемыеРеквизиты.Добавить("ЗатратыМатРесурсовФакт.Стоимость");	
		ПроверяемыеРеквизиты.Добавить("ЗатратыМатРесурсовФакт.Статья");
		ПроверяемыеРеквизиты.Добавить("ЗатратыМатРесурсовФакт.ДатаНачисления");
		ПроверяемыеРеквизиты.Добавить("ЗатратыМатРесурсовФакт.Валюта");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли