
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
	ЭлементОтбора = СписокДокументов.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = "ДатаС";             
	ЭлементОтбора.Использование = Ложь;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ДатаС;

	ЭлементОтбора = СписокДокументов.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = "ДатаПо";             
	ЭлементОтбора.Использование = Ложь;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = КонецДня(ДатаПо);
	
	ЭлементОтбора = СписокДокументов.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = "Статус";             
	ЭлементОтбора.Использование = Ложь;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеДокументаУОС");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Статус;
	
КонецПроцедуры

&НаСервере
Процедура ОтборПоДатеПриИзмененииНаСервере()  
	
	Эл = СписокДокументов.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("ДатаС");
	Если Эл <> Неопределено Тогда
		Эл.Использование = ОтборПоДате;
	КонецЕсли;         
  
	Эл = СписокДокументов.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("ДатаПо");
	Если Эл <> Неопределено И ЗначениеЗаполнено(ДатаПо) Тогда
		Эл.Использование = ОтборПоДате;
	КонецЕсли;         
  
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДатеПриИзменении(Элемент)
	ОтборПоДатеПриИзмененииНаСервере();
	СписокДокументовПриАктивизацииСтроки("");
КонецПроцедуры

&НаСервере
Процедура ДатаСПриИзмененииНаСервере()    
	
	Эл = СписокДокументов.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("ДатаС");
	Если Эл <> Неопределено Тогда
		Эл.ПравоеЗначение = ДатаС;
	КонецЕсли;        
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	ДатаСПриИзмененииНаСервере();   
	СписокДокументовПриАктивизацииСтроки("");
КонецПроцедуры

&НаСервере
Процедура ДатаПоПриИзмененииНаСервере() 
	
	Эл = СписокДокументов.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("ДатаПо");
	Если Эл <> Неопределено И ЗначениеЗаполнено(ДатаПо) Тогда
		Эл.ПравоеЗначение = КонецДня(ДатаПо);   
		Эл.Использование = ОтборПоДате;
	КонецЕсли;            
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	ДатаПоПриИзмененииНаСервере();   
	СписокДокументовПриАктивизацииСтроки("");
КонецПроцедуры

&НаСервере
Процедура ОтборПоСтатусуПриИзмененииНаСервере()
	
	Эл = СписокДокументов.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("Статус");
	Если Эл <> Неопределено Тогда
		Эл.Использование = ОтборПоСтатусу;
	КонецЕсли;               
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	ОтборПоСтатусуПриИзмененииНаСервере();  
	СписокДокументовПриАктивизацииСтроки("");
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	
	Эл = СписокДокументов.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("Статус");
	Если Эл <> Неопределено Тогда
		Эл.ПравоеЗначение = Статус;
	КонецЕсли;            
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();       
	СписокДокументовПриАктивизацииСтроки("");
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокДокументовДокументБУ" Тогда
		
		ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
		Документ = ТекущиеДанные.ДокументБУ;
	
	ИначеЕсли Поле.Имя = "СписокДокументовДокументУОС" Тогда    
		
		ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
		Документ = ТекущиеДанные.ДокументУОС;
		
	Иначе
		
		Возврат;
	
	КонецЕсли;   
	
	ТипДокумента = ТипДокумента(Документ);
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Ключ", Документ);
	ОткрытьФорму("Документ." + ТипДокумента + ".ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументУОС(Команда)    
	
	Текущиеданные = Элементы.СписокДокументов.ТекущиеДанные;
	Если Текущиеданные = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументБУ)  Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед вводом документа УОС ввести документ БУ.");
		Возврат;
	
	КонецЕсли;            
	
	Если НЕ ЗначениеРеквизитаОбъекта(Текущиеданные.ДокументБУ, "Проведен")  Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед вводом документа УОС требуется провести документ.");
	
	Иначе            
		
		ТипДокумента = ТипДокумента(Текущиеданные.ДокументБУ);
	
		ПараметрыФормы = Новый Структура;  
		ПараметрыФормы.Вставить("УОС", Истина);
		ПараметрыФормы.Вставить("ДокументИсточник", Текущиеданные.ДокументБУ);
		
		ОткрытьФорму("Документ." + ТипДокумента + ".ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;

КонецПроцедуры      

&НаСервере
Функция ТипДокумента(Документ) 
	
	Возврат Документ.Метаданные().Имя;

КонецФункции

&НаСервере
Функция РезультатПроверкиНаСервере(ДокументБУ, ДокументУОС, Статус)
	
	Возврат ИКТ_ЗП_УОС.ВывестиСообщенияОПроверке(ДокументБУ, ДокументУОС, Статус);

КонецФункции

&НаКлиенте
Процедура ОбновитьСостояние(Команда)  
	
	Элементы.СписокДокументов.Обновить();
	СписокДокументовПриАктивизацииСтроки("");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;         
	
	Если Элементы.СписокДокументов.ТекущийЭлемент.Имя = "СписокДокументовДокументБУ" Тогда
		Документ = ТекущиеДанные.ДокументБУ;
	ИначеЕсли Элементы.СписокДокументов.ТекущийЭлемент.Имя = "СписокДокументовДокументУОС" Тогда
		Документ = ТекущиеДанные.ДокументУОС;
	Иначе
		Возврат;
	КонецЕсли;    
	
	ТипДокумента = ТипДокумента(Документ);
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Ключ", Документ);
	ОткрытьФорму("Документ." + ТипДокумента + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьДокумент(Команда)  
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;         
	
	Если Элементы.СписокДокументов.ТекущийЭлемент.Имя = "СписокДокументовДокументБУ" Тогда
		Документ = ТекущиеДанные.ДокументБУ;     
		ДокументБУ = ТекущиеДанные.ДокументБУ;     
		ДокументУУ = ТекущиеДанные.ДокументУОС;     
	ИначеЕсли Элементы.СписокДокументов.ТекущийЭлемент.Имя = "СписокДокументовДокументУОС" Тогда
		Документ = ТекущиеДанные.ДокументУОС;    
		ДокументБУ = ТекущиеДанные.ДокументБУ;     
		ДокументУУ = ТекущиеДанные.ДокументУОС;     
	Иначе
		Возврат;
	КонецЕсли;   
	
	ТипДокумента = ?(ЗначениеЗаполнено(ДокументБУ), ТипДокумента(ДокументБУ), ТипДокумента(ДокументУУ));   
	
	ДокументОтбор = ?(Документ = ДокументБУ, ДокументУУ, ДокументБУ); 
	
	Если ЗначениеЗаполнено(ДокументОтбор) Тогда //Есть соответствующий документ
	
		ПараметрыФормы = Новый Структура("РежимВыбора",Истина);     
		
		ПараметрыОтбора = Новый Структура;     
		Организация = ЗначениеРеквизитаОбъекта(ДокументОтбор, "Организация"); 
		СвязаннаяОрганизация = ПолучитьСвязанныйОбъект(Организация, Организация);
		ПараметрыОтбора.Вставить("Организация", СвязаннаяОрганизация);
		
		Если ТипДокумента = "ПриемНаРаботу" Тогда
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "Увольнение" Тогда             
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "КадровыйПеревод" Тогда        
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "КадровыйПереводСписком" Тогда 
		
		Иначеесли ТипДокумента = "Отпуск" Тогда           
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "БольничныйЛист" Тогда   
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "Командировка" Тогда     
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "ИзменениеГрафикаРаботыСписком" Тогда
		
		КонецЕсли;    
		
	Иначе    
		
		Если ДокументБУ = Документ Тогда
		
			ДокументОтбор = ДокументБУ;	
		
		Иначе
		
			ДокументОтбор = ДокументУУ;	
		
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("РежимВыбора",Истина);     
		
		ПараметрыОтбора = Новый Структура;     
		СвязаннаяОрганизация = ЗначениеРеквизитаОбъекта(ДокументОтбор, "Организация"); 
		ПараметрыОтбора.Вставить("Организация", СвязаннаяОрганизация);
		
		Если ТипДокумента = "ПриемНаРаботу" Тогда
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "Увольнение" Тогда             
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "КадровыйПеревод" Тогда        
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "КадровыйПереводСписком" Тогда 
		
		Иначеесли ТипДокумента = "Отпуск" Тогда           
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "БольничныйЛист" Тогда   
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "Командировка" Тогда     
			
			ФизическоеЛицо = ЗначениеРеквизитаОбъекта(ДокументОтбор, "ФизическоеЛицо");
			ПараметрыОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
		Иначеесли ТипДокумента = "ИзменениеГрафикаРаботыСписком" Тогда
		
		КонецЕсли;  	
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);     
	
	ОткрытьФорму("Документ." + ТипДокумента + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма);   
	
КонецПроцедуры   

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные, КодЯзыка);	
КонецФункции
	

&НаСервере
Функция ПолучитьСвязанныйОбъект(Организация, ОбъектПараметр)

	Возврат ИКТ_ЗП_УОС.ПолучитьСвязанныйОбъект(Организация, ОбъектПараметр);

КонецФункции


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение); 
	
	ПодключитьОбработчикОжидания("ОтложенноеОбновление", 0.5, Истина);
	
КонецПроцедуры    

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранныйДокумент)
	
	Если ЗначениеЗаполнено(ДокументБУ) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
			|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
			|ИЗ
			|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
			|ГДЕ
			|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
		
		Запрос.УстановитьПараметр("ДокументБУ", ДокументБУ);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			
			ИКТ_ЗП_УОС.ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ);
			
			Если ЗначениеЗаполнено(Выборка.ДокументУУ) Тогда
				
				ИКТ_ЗП_УОС.ЗаписьВСоответвиеДокументов(,Выборка.ДокументУУ);
				
			КонецЕсли;
				
		КонецЦикла;   
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументУУ) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
			|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
			|ИЗ
			|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
			|ГДЕ
			|	ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
		
		Запрос.УстановитьПараметр("ДокументУУ", ДокументУУ);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ИКТ_ЗП_УОС.ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ);
			
			Если ЗначениеЗаполнено(Выборка.ДокументБУ) Тогда
				
				ИКТ_ЗП_УОС.ЗаписьВСоответвиеДокументов(Выборка.ДокументБУ);
				
			КонецЕсли;
				
		КонецЦикла;
	
	КонецЕсли;  
	
	Если Документ = ДокументБУ Тогда //Заменяем БУ Документ 
		
		Если ЗначениеЗаполнено(ВыбранныйДокумент) Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
				|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
				|ИЗ
				|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
				|ГДЕ
				|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ";
			
			Запрос.УстановитьПараметр("ДокументБУ", ВыбранныйДокумент);
			
			РезультатЗапроса = Запрос.Выполнить(); 
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ИКТ_ЗП_УОС.ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ);
				
				Если ЗначениеЗаполнено(Выборка.ДокументУУ) Тогда
					
					ИКТ_ЗП_УОС.ЗаписьВСоответвиеДокументов(,Выборка.ДокументУУ);
					
				КонецЕсли;
					
			КонецЦикла;   
			
		КонецЕсли;
	
	Иначе //Заменяем УУ Документ       
		
		Если ЗначениеЗаполнено(ВыбранныйДокумент) Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИКТ_СоответствиеДокументов.ДокументБУ КАК ДокументБУ,
				|	ИКТ_СоответствиеДокументов.ДокументУУ КАК ДокументУУ
				|ИЗ
				|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
				|ГДЕ
				|	ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
			
			Запрос.УстановитьПараметр("ДокументУУ", ВыбранныйДокумент);
			
			РезультатЗапроса = Запрос.Выполнить(); 
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ИКТ_ЗП_УОС.ОчиститьСоответвиеДокументов(Выборка.ДокументБУ, Выборка.ДокументУУ);
				
				Если ЗначениеЗаполнено(Выборка.ДокументБУ) Тогда
					
					ИКТ_ЗП_УОС.ЗаписьВСоответвиеДокументов(Выборка.ДокументБУ);
					
				КонецЕсли;
					
			КонецЦикла;
		
		КонецЕсли;  
	
	КонецЕсли;
	
	Если Документ = ДокументБУ Тогда //Заменяем БУ Документ 
		
		ИКТ_ЗП_УОС.ЗаписьВСоответвиеДокументов(ВыбранныйДокумент, ДокументУУ);
		
		Если ЗначениеЗаполнено(ВыбранныйДокумент) И ЗначениеЗаполнено(ДокументУУ) Тогда
		
			ИКТ_ЗП_УОС.УстановитьСоответствиеПриЗаменеДокумента(ВыбранныйДокумент, ДокументУУ);
		
		КонецЕсли;
		
	Иначе //Заменяем УУ Документ       
		
		ИКТ_ЗП_УОС.ЗаписьВСоответвиеДокументов(ДокументБУ, ВыбранныйДокумент);
		
		Если ЗначениеЗаполнено(ДокументБУ) И ЗначениеЗаполнено(ВыбранныйДокумент) Тогда
		
			ИКТ_ЗП_УОС.УстановитьСоответствиеПриЗаменеДокумента(ДокументБУ, ВыбранныйДокумент);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Документ = Неопределено;
	ДокументБУ = Неопределено;
	ДокументУУ = Неопределено;

КонецПроцедуры  

&НаСервере
Процедура ИгнорированиеДокументаНаСервере(ДокументБУ, ДокументУУ, Пометка)
	
	Если НЕ Пометка Тогда  

		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументБУ.Установить(ДокументБУ);   
		Наборзаписей.Отбор.ДокументУУ.Установить(ДокументУУ);    
		НаборЗаписей.Прочитать();
		Для каждого Запись Из НаборЗаписей Цикл      
			Запись.ДокументБУ = ДокументБУ;
			Запись.ДокументУУ = ДокументУУ;
			Запись.СостояниеДокументаУУ = Перечисления.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент;
			Запись.ДатаИзменения = ТекущаяДата();
			Запись.Пользователь = Пользователи.ТекущийПользователь();
		КонецЦикла;
		НаборЗаписей.Записать();   
	
	Иначе
	
		НаборЗаписей = РегистрыСведений.ИКТ_СоответствиеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументБУ.Установить(ДокументБУ);   
		Наборзаписей.Отбор.ДокументУУ.Установить(ДокументУУ);  
		НаборЗаписей.Прочитать();
		Для каждого Запись Из НаборЗаписей Цикл      
			Запись.ДокументБУ = ДокументБУ;
			Запись.ДокументУУ = ДокументУУ;
			Запись.СостояниеДокументаУУ = Неопределено;
			Запись.ДатаИзменения = Неопределено;
			Запись.Пользователь = Неопределено;
		КонецЦикла;
		НаборЗаписей.Записать();   
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИгнорированиеДокумента(Команда)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;         
	
	ДокументБУ = ТекущиеДанные.ДокументБУ;     
	ДокументУУ = ТекущиеДанные.ДокументУОС;     
	
	ИгнорированиеДокументаНаСервере(ДокументБУ, ДокументУУ, Элементы.ФормаИгнорированиеДокумента.Пометка); 
	
	Элементы.ФормаИгнорированиеДокумента.Пометка = НЕ Элементы.ФормаИгнорированиеДокумента.Пометка;
	
	ПодключитьОбработчикОжидания("ОтложенноеОбновление", 0.5, Истина);
	
КонецПроцедуры    

&НаКлиенте
Процедура ОтложенноеОбновление()
	
	Элементы.СписокДокументов.Обновить();
	СписокДокументовПриАктивизацииСтроки("");

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;       
	
	СостояниеДокумента = СостояниеДокумента(ТекущиеДанные.ДокументБУ, ТекущиеДанные.ДокументУОС);
	
	Элементы.ФормаИгнорированиеДокумента.Пометка = СостояниеДокумента = ПредопределенноеЗначение("Перечисление.ИКТ_СостояниеДокументовУОС.ИгнорироватьДокумент");
	
	Массив = РезультатПроверкиНаСервере(ТекущиеДанные.ДокументБУ, ТекущиеДанные.ДокументУОС, СостояниеДокумента);  
	
	РезультатПроверки = СтрСоединить(Массив, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИКТ_ЗаписанДокумент" Тогда
		Элементы.СписокДокументов.Обновить();
	    СписокДокументовПриАктивизацииСтроки("");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СостояниеДокумента(ДокументБУ, ДокументУУ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СоответствиеДокументов.СостояниеДокументаУУ КАК СостояниеДокументаУУ
		|ИЗ
		|	РегистрСведений.ИКТ_СоответствиеДокументов КАК ИКТ_СоответствиеДокументов
		|ГДЕ
		|	ИКТ_СоответствиеДокументов.ДокументБУ = &ДокументБУ
		|	И ИКТ_СоответствиеДокументов.ДокументУУ = &ДокументУУ";
	
	Запрос.УстановитьПараметр("ДокументБУ", ДокументБУ);
	Запрос.УстановитьПараметр("ДокументУУ", ДокументУУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СостояниеДокументаУУ
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции


