
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьОтборыТЧ();
		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Проект) Тогда
		ЗаполнитьДокументНаСервере();
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			РекурсивноПерезаполнитьПроцентДинамики(ДеревоЗадач);
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоРаботаСФормамиСервер.ДобавитьВызовОтчетовПроектаНаФорму(ЭтотОбъект, Элементы.ГруппаОтчеты,
		"КомандаОтчетаПроекта", "ОткрытьОтчет");
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Проект) Тогда
		РекурсивноРазвернутьДерево(ДеревоЗадач);
	КонецЕсли;
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ЗаполнитьДеревоЗадачНаФормеПоДаннымОбъекта();
	
	СтруктураТипыВопросаТаблиц = СтруктураТипыВопросаТаблиц();
	НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, Объект.ЗадачиАктивности);
	
КонецПроцедуры
  
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СтрокиДереваЗадачВОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	СтруктураТипыВопросаТаблиц = СтруктураТипыВопросаТаблиц();
	НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, Объект.ЗадачиАктивности);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВопросыВыполненныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипИНомерВопроса(Элемент, НоваяСтрока, Истина); 
		
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВыполняемыеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипИНомерВопроса(Элемент, НоваяСтрока, Истина);                                                    
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыБлижайшиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипИНомерВопроса(Элемент, НоваяСтрока, Истина); 

КонецПроцедуры

&НаКлиенте
Процедура ВопросыТребующиеРешенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипИНомерВопроса(Элемент, НоваяСтрока, Ложь); 

КонецПроцедуры

&НаКлиенте
Процедура ВопросыНаКонтролеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьТипИНомерВопроса(Элемент, НоваяСтрока, Ложь); 

КонецПроцедуры

&НаКлиенте
Процедура РискиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Риски.ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='Перезаполнить % динамики и вопросы на контроле?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ДокументОснованиеПриИзмененииЗавершение", ЭтотОбъект, Неопределено);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзмененииЗавершение(Результат, Параметр) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОснованиеПриИзмененииНаСервре();
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервре()
	// процент динамики
	РекурсивноПерезаполнитьПроцентДинамики(ДеревоЗадач);
	// вопросы на контроле
	ЗаполнитьВопросыНаСервере();
КонецПроцедуры

&НаСервере
Процедура РекурсивноПерезаполнитьПроцентДинамики(Дерево, Данные = Неопределено)
	Если Данные = Неопределено Тогда
		Данные = ПолучитьПроцентыВыполненияДокументаОснования();
	КонецЕсли;
	
	СтрокиДерева = Дерево.ПолучитьЭлементы();
	СтруктураПоиска = Новый Структура("ЗадачаСсылка");
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если ЗначениеЗаполнено(СтрокаДерева.ЗадачаСсылка) Тогда
			СтруктураПоиска.ЗадачаСсылка = СтрокаДерева.ЗадачаСсылка;
			НайденныеСтроки = Данные.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаДерева.ПроцентДинамики = 0;
			КонецЕсли;
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				СтрокаДерева.ПроцентДинамики = СтрокаДерева.ПроцентВыполненияЗадачи - НайденнаяСтрока.ПроцентВыполненияЗадачи;
			КонецЦикла;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаДерева.ПолучитьЭлементы()) Тогда
			РекурсивноПерезаполнитьПроцентДинамики(СтрокаДерева, Данные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроцентыВыполненияДокументаОснования()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаСсылка КАК ЗадачаСсылка,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ПроцентВыполненияЗадачи КАК ПроцентВыполненияЗадачи
	|ИЗ
	|	Документ.упоСтатусОтчетПоПроекту.СтатусЗадач КАК упоСтатусОтчетПоПроектуСтатусЗадач
	|ГДЕ
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка = &ДокументОснование");
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДокумент(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗадачПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВыполненныеОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтруктураТипыВопросаТаблиц = Новый Структура;
	СтруктураТипыВопросаТаблиц.Вставить("ВопросыВыполненные", 4);
	НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, Объект.ЗадачиАктивности);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВыполняемыеОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтруктураТипыВопросаТаблиц = Новый Структура;
	СтруктураТипыВопросаТаблиц.Вставить("ВопросыВыполняемые", 1);
	НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, Объект.ЗадачиАктивности);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросыБлижайшиеОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтруктураТипыВопросаТаблиц = Новый Структура;
	СтруктураТипыВопросаТаблиц.Вставить("ВопросыБлижайшие", 3);
	НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, Объект.ЗадачиАктивности);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗадачПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтруктураИндексовКартинок = ПолучитьТекущиеИндексыКартинокКоллекции();
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИндексКартинки = СтруктураИндексовКартинок.ИндексЭтоМодельПакетаРаботНов;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьВопросы(Команда)
	
	НайденныеСтроки = Объект.Вопросы.НайтиСтроки(Новый Структура("ТипВопроса", 2));	
	ПараметрыПроверки = Новый Структура("ПроверяемыйОбъект, НазваниеПроверяемогоОбъекта, ВыполняемаяОперация",
		НайденныеСтроки, Элементы.Группа17.Заголовок, "ЗаполнитьВопросы");
	
	ПроверитьЗаполненностьТаблицы(ПараметрыПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадачиАктивности(Команда)
	
	ПараметрыПроверки = Новый Структура("ПроверяемыйОбъект, НазваниеПроверяемогоОбъекта, ВыполняемаяОперация",
		Объект.ЗадачиАктивности, Элементы.СтраницаЗадачиАктивности.Заголовок, "ЗаполнитьЗадачиАктивности");
	
	ПроверитьЗаполненностьТаблицы(ПараметрыПроверки);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРиски(Команда)
	
	ЗаголовокРиски = НСтр("ru = 'Риски'");
	ПараметрыПроверки = Новый Структура("ПроверяемыйОбъект, НазваниеПроверяемогоОбъекта, ВыполняемаяОперация",
		Объект.Риски, ЗаголовокРиски, "ЗаполнитьРиски");
	
	ПроверитьЗаполненностьТаблицы(ПараметрыПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	ЗаполненныеТЧ = Новый Массив;	
	
	Если ДеревоЗадач.ПолучитьЭлементы().Количество() > 0 Тогда
		ЗаполненныеТЧ.Добавить(Элементы.СтраницаСтатусЗадач.Заголовок);
	КонецЕсли;
			
	Если Объект.ЗадачиАктивности.Количество() > 0 Тогда
		ЗаполненныеТЧ.Добавить(Элементы.СтраницаЗадачиАктивности.Заголовок);
	КонецЕсли;
	
	НайденныеСтроки = Объект.Вопросы.НайтиСтроки(Новый Структура("ТипВопроса", 2));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗаполненныеТЧ.Добавить(Элементы.Группа17.Заголовок);
	КонецЕсли;
	
	Если Объект.Риски.Количество() > 0 Тогда
		ЗаполненныеТЧ.Добавить(НСтр("ru = 'Риски'"));
	КонецЕсли;	
	
	ТекстВопроса = НСтр("ru = 'Перед заполнением требуется очистить данные%1. Продолжить?'");
	
	КоличествоЗаполненныхТЧ = ЗаполненныеТЧ.Количество();
	Если КоличествоЗаполненныхТЧ > 0 Тогда 
		
		ДобавкаКВопросуВЕдинственномЧисле = 
			НСтр("ru = ' и очистить таблицу ""%1""'");
		ДобавкаКВопросуВМножественномЧисле = 
			НСтр("ru = ' и очистить таблицы ""%1""'");
		
		Если КоличествоЗаполненныхТЧ = 1 Тогда
			ДобавкаКВопросу = ДобавкаКВопросуВЕдинственномЧисле;	
		Иначе
			ДобавкаКВопросу = ДобавкаКВопросуВМножественномЧисле;
		КонецЕсли;
		
		ЗаполненныеТЧСтрокой = СтрСоединить(ЗаполненныеТЧ, ", ");
		ДобавкаКВопросу = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ДобавкаКВопросу, ЗаполненныеТЧСтрокой);
		
	Иначе	
		
		ДобавкаКВопросу = "";
		
	КонецЕсли;
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ДобавкаКВопросу);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьДокументЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПЗ(Команда)
	
	ПроверяемыйОбъект = ДеревоЗадач.ПолучитьЭлементы();
	ПараметрыПроверки = Новый Структура("ПроверяемыйОбъект, НазваниеПроверяемогоОбъекта, ВыполняемаяОперация",
		ПроверяемыйОбъект, Элементы.СтраницаСтатусЗадач.Заголовок, "ЗаполнитьПЗ");
	
	ПроверитьЗаполненностьТаблицы(ПараметрыПроверки);	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСведенияОПроекте(Команда)
	
	ЗаголовокСведенияОПроекте = НСтр("ru = 'сведения о проекте'");
	ПараметрыВопроса = Новый Структура("ОчищаемыеДанные, ВыполняемаяОперация",
		ЗаголовокСведенияОПроекте, "ЗаполнитьСведенияОПроекте");	
		
	ПоказатьВопросОбОчисткеДанныхДокумента(ПараметрыВопроса);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСводныйСтатус(Команда)
	
	ЗаголовокСводныйСтатус = НСтр("ru = 'сводный статус'");
	ПараметрыВопроса = Новый Структура("ОчищаемыеДанные, ВыполняемаяОперация",
		ЗаголовокСводныйСтатус, "ЗаполнитьСводныйСтатус");	
		
	ПоказатьВопросОбОчисткеДанныхДокумента(ПараметрыВопроса);	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ОткрытьПроект(Команда)
	
	ПоказатьЗначение(, Объект.Проект);
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьОтчет(Команда) 
	
	упоРаботаСФормамиКлиент.ОткрытьОтчетПроектаПоСлужебнойКоманде(ЭтотОбъект, Команда, "КомандаОтчетаПроекта",
		Объект.Проект);
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСтатусыСроков(Команда)
	
	ПересчитатьСтатусыСроковНаСервере();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверхВопросыБлижайшие(Команда)
	ПереместитьСтроку("ЗадачиАктивности", "ВопросыБлижайшие", 3, "Вверх");
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверхВопросыВыполненные(Команда)	
	ПереместитьСтроку("ЗадачиАктивности", "ВопросыВыполненные", 4, "Вверх");
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверхВопросыВыполняемые(Команда)
	ПереместитьСтроку("ЗадачиАктивности", "ВопросыВыполняемые", 1, "Вверх");
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверхВопросыНаКонтроле(Команда)
	ПереместитьСтроку("Вопросы", "ВопросыНаКонтроле", 0, "Вверх", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверхВопросыТребующиеРешения(Команда)
	ПереместитьСтроку("Вопросы", "ВопросыТребующиеРешения", 0, "Вверх", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВнизВопросыБлижайшие(Команда)
	ПереместитьСтроку("ЗадачиАктивности", "ВопросыБлижайшие", 3, "Вниз");
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВнизВопросыВыполненные(Команда)	
	ПереместитьСтроку("ЗадачиАктивности", "ВопросыВыполненные", 4, "Вниз");
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВнизВопросыВыполняемые(Команда)
	ПереместитьСтроку("ЗадачиАктивности", "ВопросыВыполняемые", 1, "Вниз");
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВнизВопросыНаКонтроле(Команда)
	ПереместитьСтроку("Вопросы", "ВопросыНаКонтроле", 0, "Вниз", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВнизВопросыТребующиеРешения(Команда)
	ПереместитьСтроку("Вопросы", "ВопросыТребующиеРешения", 0, "Вниз", Ложь);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РекурсивноРазвернутьДерево(ТекДерево)
	Для Каждого СтрокаДерева Из ТекДерево.ПолучитьЭлементы() Цикл  		
		ид = СтрокаДерева.ПолучитьИдентификатор();
		Элементы.ДеревоЗадач.Развернуть(ид, Истина);
		Если СтрокаДерева.ПолучитьЭлементы().Количество() > 0 Тогда
			РекурсивноРазвернутьДерево(СтрокаДерева);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
		
&НаСервере
Процедура ЗаполнитьДеревоЗадачФормыПоДаннымБД()
	
	ЗагрузитьДанныеВПромежуточноеДерево();	
	ЗаполнитьДеревоЗадачФормыПоПромежуточномуДереву();   
	ТаблицаДанных.ПолучитьЭлементы().Очистить();	
	Документы.упоСтатусОтчетПоПроекту.ДополнитьДеревоЗадачНаФормеДопДанными(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		РекурсивноПерезаполнитьПроцентДинамики(ДеревоЗадач);
	КонецЕсли;
	
	ПересчитатьСтатусыСроковНаСервере();
		
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСведенияОПроектеСервер()

	Документы.упоСтатусОтчетПоПроекту.ЗаполнитьСведенияОПроекте(Объект);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСводныйСтатусНаСервере()
		
	СоответствиеТиповКолонкам = Новый Соответствие;
	СоответствиеТиповКолонкам.Вставить("Сроки", Перечисления.упоСтатусОтчетыСтатусыСроков);
	СоответствиеТиповКолонкам.Вставить("Ресурсы", Перечисления.упоСтатусОтчетыСтатусыРесурсов);
	СоответствиеТиповКолонкам.Вставить("Бюджеты", Перечисления.упоСтатусОтчетыСтатусыБюджетов);
	СоответствиеТиповКолонкам.Вставить("Риски", Перечисления.упоСтатусОтчетыСтатусыРисков);
	
	//
	
	КэшИндексов = Новый Соответствие;
	МаксимумыИндексов = Новый Структура;
	ТЗЗадач = Новый ТаблицаЗначений;
	Для Каждого КлючЗначение Из СоответствиеТиповКолонкам Цикл	
		КэшИндексов.Вставить(КлючЗначение.Ключ, ПолучитьИндексыПеречисления(КлючЗначение.Значение));
		МаксимумыИндексов.Вставить(КлючЗначение.Ключ, -1);
		ТЗЗадач.Колонки.Добавить(КлючЗначение.Ключ);
	КонецЦикла;	
	
	ДеревоЗадачВТЗ(ДеревоЗадач.ПолучитьЭлементы(), ТЗЗадач);
	
	Для Каждого СтрокаТЗ Из ТЗЗадач Цикл
		Для Каждого КлючЗначение Из КэшИндексов Цикл
			ЗначениеИндекса = КэшИндексов[КлючЗначение.Ключ].ИндексПоЗначению.Получить(СтрокаТЗ[КлючЗначение.Ключ]);
			Если ЗначениеИндекса = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МаксимумыИндексов[КлючЗначение.Ключ] = Макс(МаксимумыИндексов[КлючЗначение.Ключ], ЗначениеИндекса);
		КонецЦикла;
	КонецЦикла;
	
	МаксимумыЗначений = Новый Структура;
	Для Каждого КлючЗначение Из МаксимумыИндексов Цикл
		Если КлючЗначение.Значение = -1 Тогда
			ЗначениеПоИндексу = Неопределено;
		Иначе
			ЗначениеПоИндексу = КэшИндексов[КлючЗначение.Ключ].ЗначениеПоИндексу.Получить(КлючЗначение.Значение);		
		КонецЕсли;
		МаксимумыЗначений.Вставить(КлючЗначение.Ключ, ЗначениеПоИндексу);
	КонецЦикла;
	
	//
	
	Объект.СрокиСводно = МаксимумыЗначений.Сроки;
	Объект.РесурсыСводно = МаксимумыЗначений.Ресурсы;
	Объект.БюджетыСводно = МаксимумыЗначений.Бюджеты;
	Объект.РискиСводно = МаксимумыЗначений.Риски;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИндексыПеречисления(ПеречислениеМенеджер)
	Результат = Новый Структура("ИндексПоЗначению, ЗначениеПоИндексу", Новый Соответствие, Новый Соответствие);
	КоличествоЭлементов = ПеречислениеМенеджер;	
	Для Каждого ЗначениеПеречисления Из ПеречислениеМенеджер Цикл
		Индекс = ПеречислениеМенеджер.Индекс(ЗначениеПеречисления);	
		Результат.ИндексПоЗначению.Вставить(ЗначениеПеречисления, Индекс);
		Результат.ЗначениеПоИндексу.Вставить(Индекс, ЗначениеПеречисления);
	КонецЦикла;
	Возврат Результат; 
КонецФункции

&НаСервере
Процедура ЗаполнитьЗадачиАктивностиНаСервере()
	
	Объект.ЗадачиАктивности.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СрокиПлан.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	СрокиПлан.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	СрокиПлан.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	упоСвойстваПроектныхЗадачСрезПоследних.НазваниеЗадачи КАК НазваниеЗадачи,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот
	|ПОМЕСТИТЬ ВТ_Сроки
	|ИЗ
	|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК СрокиПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ПО СрокиПлан.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сроки.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	Сроки.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	Сроки.ДатаЗавершенияПлан КАК ДатаЗавершенияПлан,
	|	ВЫБОР
	|		КОГДА Сроки.ДатаЗавершенияПлан >= ДОБАВИТЬКДАТЕ(&ДатаДок, ДЕНЬ, -7)
	|				И Сроки.ДатаЗавершенияПлан <= &ДатаДок
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Выполненные,
	|	ВЫБОР
	|		КОГДА Сроки.ДатаНачалаПлан <= &ДатаДок
	|				И Сроки.ДатаЗавершенияПлан >= &ДатаДок
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Выполняемые,
	|	ВЫБОР
	|		КОГДА Сроки.ДатаНачалаПлан > &ДатаДок
	|				И Сроки.ДатаНачалаПлан <= ДОБАВИТЬКДАТЕ(&ДатаДок, ДЕНЬ, 7)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Ближайшие,
	|	Сроки.ЭтоМодельПакетаРабот КАК ЭтоМодель,
	|	Сроки.НазваниеЗадачи КАК НазваниеЗадачи
	|ПОМЕСТИТЬ ВТ_Упорядоченные
	|ИЗ
	|	ВТ_Сроки КАК Сроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сроки.НазваниеЗадачи КАК Вопрос,
	|	ВЫБОР
	|		КОГДА Сроки.Выполненные
	|			ТОГДА 4
	|		КОГДА Сроки.Выполняемые
	|			ТОГДА 1
	|		КОГДА Сроки.Ближайшие
	|			ТОГДА 3
	|	КОНЕЦ КАК ТипВопроса
	|ИЗ
	|	ВТ_Упорядоченные КАК Сроки
	|ГДЕ
	|	(Сроки.Выполненные
	|			ИЛИ Сроки.Выполняемые
	|			ИЛИ Сроки.Ближайшие)
	|	И Сроки.ЭтоМодель");
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("ДатаДок", НачалоДня(Объект.Дата));	
	Запрос.УстановитьПараметр("Версия", ЭтотОбъект.ТекущаяВерсия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ЗадачиАктивности.Добавить(), Выборка);
	КонецЦикла;
	
	СтруктураТипыВопросаТаблиц = СтруктураТипыВопросаТаблиц();
	НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, Объект.ЗадачиАктивности);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРискиНаСервере()
		
	Объект.Риски.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   Риски.Событие КАК СобытиеРиска,
    |   Риски.ТипРиска КАК ТипРиска,
    |   Риски.Последствие КАК Последствия,
    |   Риски.ТипРеакции КАК ТипРеакции,
    |   Риски.ВероятностьВозникновения КАК Вероятность,
    |   Риски.Риск.СтратегияРеагированияНаРискОписание КАК Действия,
    |   Риски.Риск.ОтветственныйЗаРеагированиеНаРиск КАК Ответственный,
    |   СтатусыРисков.Статус КАК Статус,
    |   Риски.Риск КАК Риск
    |ИЗ
    |   РегистрСведений.упоСвойстваРисковПроектовПлан.СрезПоследних(, Риск.Владелец = &Проект) КАК Риски
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыРисковПроектов.СрезПоследних КАК СтатусыРисков
    |       ПО Риски.Риск = СтатусыРисков.Риск");
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
        
    РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;		
	
	СоответствиеСтатусовРисков = Соответствие_СтатусыРисковПроектов_СтатусОтчетыСтатусыРисков();

    Выборка = РезультатЗапроса.Выбрать();    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Риски.Добавить(); 
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
		
		Если ЗначениеЗаполнено(Выборка.СобытиеРиска) Тогда
			НоваяСтрока.Риск = Выборка.СобытиеРиска;
		КонецЕсли;
		
		НоваяСтрока.Статус = СоответствиеСтатусовРисков[Выборка.Статус];
		
    КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыТЧ()

	СтруктураТипыВопросаТаблиц = СтруктураТипыВопросаТаблиц();

	Для Каждого Эл Из СтруктураТипыВопросаТаблиц Цикл 		
		Элементы[Эл.Ключ].ОтборСтрок = Новый ФиксированнаяСтруктура("ТипВопроса", Эл.Значение);
	КонецЦикла;                                       	 
	
	НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, Объект.ЗадачиАктивности);
	
КонецПроцедуры 

&НаКлиенте
Процедура СтрокиДереваЗадачВОбъект()
	
	Объект.СтатусЗадач.Очистить();
	
	СтрокиДереваЗадачВОбъектРекурсивно(ДеревоЗадач.ПолучитьЭлементы(), Объект.СтатусЗадач, Неопределено, 0);
	
КонецПроцедуры 

&НаКлиенте
Процедура СтрокиДереваЗадачВОбъектРекурсивно(СтрокиЗадач, Таблица, Родитель, Уровень)

	Для Каждого Строка Из СтрокиЗадач Цикл 
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Родитель = Родитель;
		НоваяСтрока.Уровень = Уровень;
		СтрокиДереваЗадачВОбъектРекурсивно(Строка.ПолучитьЭлементы(), Таблица, Строка.ЗадачаСсылка, Строка.Уровень + 1);
	КонецЦикла;	 

КонецПроцедуры 

&НаСервере
Процедура ДеревоЗадачВТЗ(СтрокиЗадач, Таблица)

	Для Каждого Строка Из СтрокиЗадач Цикл 
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		ДеревоЗадачВТЗ(Строка.ПолучитьЭлементы(), Таблица);
	КонецЦикла;	 

КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьДанныеВПромежуточноеДерево()
	
	врТаблицаДанных = РеквизитФормыВЗначение("ТаблицаДанных");
	
	врТаблицаДанных.Строки.Очистить();
	
	врТаблицаДанных.Колонки.Добавить("ЗапланированыРасходы", Новый ОписаниеТипов("Булево"));
	врТаблицаДанных.Колонки.Добавить("EV", Новый ОписаниеТипов("Число"));
	врТаблицаДанных.Колонки.Добавить("CV", Новый ОписаниеТипов("Число"));
	
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда      
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = ЗапросСписокЗадач();
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("текВерсия", ЭтотОбъект.ТекущаяВерсия);
	СтатусыОтбор = Новый Массив;
	СтатусыОтбор.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаЗадачи.Завершена"));
	СтатусыОтбор.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСостояниеСтатусаЗадачи.Закрыта"));
	Запрос.УстановитьПараметр("СтатусыЗавершеныЗакрыты", СтатусыОтбор);
	Запрос.УстановитьПараметр("Расход", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда      
		Возврат;
	КонецЕсли; 	
	
	СтруктураОтбора = Новый Структура("ЗадачаРодитель", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	СтрокиВерхнийУровень = РезультатЗапроса.НайтиСтроки(СтруктураОтбора);
	Если СтрокиВерхнийУровень.Количество() = 0 Тогда      
		// Если нет ни одной задачи верхнего уровня, дерево построить не получится
		Сообщение = НСтр(
			"ru = 'Не найдено ни одной проектной задачи верхнего уровня иерархии, дерево задач не может быть построено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли; 
	
	НовыеЭлементы = Новый СписокЗначений();
	
	СтруктураИндексовКартинок = ПолучитьТекущиеИндексыКартинокКоллекции();
	
	Для Каждого СтрокаВерхнийУровень Из СтрокиВерхнийУровень Цикл
		
		СтрокаДерева = врТаблицаДанных.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаВерхнийУровень);
		
		ЗаполнитьИндексКартинки(СтрокаДерева, СтруктураИндексовКартинок);
		
		НовыеЭлементы.Добавить(СтрокаДерева);
		
	КонецЦикла;
	
	врТаблицаДанных.Строки.Сортировать("КодСДР");
	
	Пока Истина Цикл
		
		НайденоНовыхЭлементов = 0;
		ЭлементыВерхнегоУровня = Новый СписокЗначений();
		ЭлементыВерхнегоУровня.ЗагрузитьЗначения(НовыеЭлементы.ВыгрузитьЗначения());
		НовыеЭлементы.Очистить();
		
		Для Каждого ЭлементРодитель Из ЭлементыВерхнегоУровня Цикл
			
			СтруктураОтбора = Новый Структура("ЗадачаРодитель", ЭлементРодитель.Значение.ПроектнаяЗадача);
			ПодчиненныеЗадачи = РезультатЗапроса.НайтиСтроки(СтруктураОтбора);
			СтрокаЗадачаРодитель = РезультатЗапроса.Найти(ЭлементРодитель.Значение.ПроектнаяЗадача, "ПроектнаяЗадача");
			
			Для Каждого СтрокаЗадача Из ПодчиненныеЗадачи Цикл
				
				СтрокаДерева = ЭлементРодитель.Значение.Строки.Добавить();	
				
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаЗадача);
								
				ЗаполнитьИндексКартинки(СтрокаДерева, СтруктураИндексовКартинок);
				
				НовыеЭлементы.Добавить(СтрокаДерева);
				НайденоНовыхЭлементов = НайденоНовыхЭлементов + 1;
			КонецЦикла;	
			
			ЭлементРодитель.Значение.Строки.Сортировать("КодСДР");
		КонецЦикла;	
		
		Если НайденоНовыхЭлементов = 0 Тогда      
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Бюджеты = Новый Структура;
	Бюджеты.Вставить("План", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусОтчетыСтатусыБюджетов.План"));
	Бюджеты.Вставить("Освоены", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусОтчетыСтатусыБюджетов.Освоены"));
	Бюджеты.Вставить("ПоГрафику", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусОтчетыСтатусыБюджетов.ПоГрафику"));
	Бюджеты.Вставить("Отклонения", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусОтчетыСтатусыБюджетов.Отклонения"));
	Бюджеты.Вставить("НеИсполняется", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.упоСтатусОтчетыСтатусыБюджетов.НеИсполняется"));
		
	ДанныеРодителя = Новый Структура("ЗапланированыРасходы, EV, CV", Ложь, 0, 0);	
	РекурсивноПосчитатьБюджеты(врТаблицаДанных, Бюджеты, ДанныеРодителя);
	
	врТаблицаДанных.Колонки.Удалить("ЗапланированыРасходы");
	врТаблицаДанных.Колонки.Удалить("EV");
	врТаблицаДанных.Колонки.Удалить("CV");
	
	ЗначениеВРеквизитФормы(врТаблицаДанных, "ТаблицаДанных");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИндексКартинки(Строка, СтруктураИндексовКартинок)
				
	Если Строка.ЭтоВеха Тогда      
		Строка.ИндексКартинки = СтруктураИндексовКартинок.ИндексЭтоВехаНов;
	ИначеЕсли Строка.ПакетРабот И НЕ Строка.МодельПакетаРабот Тогда      
		Строка.ИндексКартинки = СтруктураИндексовКартинок.ИндексЭтоПакетРаботНов;
	ИначеЕсли Строка.МодельПакетаРабот Тогда
		Строка.ИндексКартинки = СтруктураИндексовКартинок.ИндексЭтоМодельПакетаРаботНов;
	Иначе
		Строка.ИндексКартинки = СтруктураИндексовКартинок.ИндексЭтоЭтапНов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапросСписокЗадач()
		
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РегСвойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	РегСвойства.ЗадачаРодитель КАК ЗадачаРодитель,
	        |	РегСвойства.ЭтоПакетРабот КАК ЭтоПакетРабот,
	        |	РегСвойства.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	        |	РегСвойства.ЭтоВеха КАК ЭтоВеха,
	        |	РегСвойства.НазваниеЗадачи КАК НазваниеЗадачи
	        |ПОМЕСТИТЬ ДанныеПоЗадачам
	        |ИЗ
	        |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвойства
	        |ГДЕ
	        |	НЕ РегСвойства.НеВыводитьВСтатусОтчет
	        |	И НЕ РегСвойства.ЗадачаОтменена
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	РегСвойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	РегСвойства.ЗадачаРодитель КАК ЗадачаРодитель,
	        |	РегСвойства.ЭтоПакетРабот КАК ЭтоПакетРабот,
	        |	РегСвойства.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	        |	РегСвойства.ЭтоВеха КАК ЭтоВеха,
	        |	РегСвойства.НазваниеЗадачи КАК НазваниеЗадачи,
	        |	РегСДР.КодСДР КАК КодСДР,
	        |	РегСДР.Ссылка КАК СсылкаНаЗеркальныйПроект,
	        |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи,
	        |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи В (&СтатусыЗавершеныЗакрыты) КАК СтатусЗадачиЗакрытаИлиЗавершена
	        |ПОМЕСТИТЬ СписокЗадач
	        |ИЗ
	        |	ДанныеПоЗадачам КАК РегСвойства
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК РегСДР
	        |		ПО РегСвойства.ПроектнаяЗадача = РегСДР.СсылкаНаПроектнуюЗадачу
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
	        |				,
	        |				Версия = &текВерсия
	        |					И ПроектнаяЗадача В
	        |						(ВЫБРАТЬ
	        |							ДанныеПоЗадачам.ПроектнаяЗадача
	        |						ИЗ
	        |							ДанныеПоЗадачам)) КАК упоСтатусыПроектныхЗадачСрезПоследних
	        |		ПО РегСвойства.ПроектнаяЗадача = упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача
	        |ПОМЕСТИТЬ ОтборПоСтатусам
	        |ИЗ
	        |	СписокЗадач КАК СписокЗадач
	        |ГДЕ
	        |	НЕ СписокЗадач.СтатусЗадачиЗакрытаИлиЗавершена
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс КАК Роль
	        |ПОМЕСТИТЬ ЗапланированыеРолиПроектнойЗадачи
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыТрудозатратСводноТекущаяВерсия КАК упоАктуальныеПланыТрудозатратСводноТекущаяВерсия
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПоСтатусам КАК ОтборПоСтатусам
	        |		ПО упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача = ОтборПоСтатусам.ПроектнаяЗадача
	        |			И (упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Проект = &Проект)
	        |			И (упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс ССЫЛКА Справочник.упоРоли)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.ПроектнаяЗадача,
	        |	упоАктуальныеПланыТрудозатратСводноТекущаяВерсия.Ресурс
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача,
	        |	Роль
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	        |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса КАК Роль
	        |ПОМЕСТИТЬ ВыделенныеРолиНаПроектныеЗадачи
	        |ИЗ
	        |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	        |			,
	        |			Версия = &текВерсия
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						ОтборПоСтатусам.ПроектнаяЗадача
	        |					ИЗ
	        |						ОтборПоСтатусам)) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	        |ГДЕ
	        |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача,
	        |	Роль
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗапланированыеРолиПроектнойЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	МАКСИМУМ(ВЫБОР
	        |			КОГДА ВыделенныеРолиНаПроектныеЗадачи.ПроектнаяЗадача ЕСТЬ NULL
	        |				ТОГДА ЛОЖЬ
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ) КАК ЕстьВыделенныеРесурсыМаксимум,
	        |	МИНИМУМ(ВЫБОР
	        |			КОГДА ВыделенныеРолиНаПроектныеЗадачи.ПроектнаяЗадача ЕСТЬ NULL
	        |				ТОГДА ЛОЖЬ
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ) КАК ЕстьВыделенныеРесурсыМинимум
	        |ПОМЕСТИТЬ ОпределениеВыделенныхРесурсовПроектныхЗадач
	        |ИЗ
	        |	ЗапланированыеРолиПроектнойЗадачи КАК ЗапланированыеРолиПроектнойЗадачи
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВыделенныеРолиНаПроектныеЗадачи КАК ВыделенныеРолиНаПроектныеЗадачи
	        |		ПО ЗапланированыеРолиПроектнойЗадачи.ПроектнаяЗадача = ВыделенныеРолиНаПроектныеЗадачи.ПроектнаяЗадача
	        |			И ЗапланированыеРолиПроектнойЗадачи.Роль = ВыделенныеРолиНаПроектныеЗадачи.Роль
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗапланированыеРолиПроектнойЗадачи.ПроектнаяЗадача
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	СУММА(упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма) КАК РасходВсего
	        |ПОМЕСТИТЬ ТаблицаРасходов
	        |ИЗ
	        |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(
	        |			,
	        |			Версия = &текВерсия
	        |				И ПроектнаяЗадача В
	        |					(ВЫБРАТЬ
	        |						СписокЗадач.ПроектнаяЗадача
	        |					ИЗ
	        |						СписокЗадач)
	        |				И ВидЭлемента = &Расход) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	        |ГДЕ
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Сумма <> 0
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	упоФактДоходовИРасходовПоДням.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	СУММА(ВЫБОР
	        |			КОГДА упоФактДоходовИРасходовПоДням.ДатаНачисления <= &ТекущаяДата
	        |				ТОГДА упоФактДоходовИРасходовПоДням.Сумма
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК РасходТекФакт
	        |ПОМЕСТИТЬ ТаблицаРасходовФакт
	        |ИЗ
	        |	РегистрСведений.упоФактДоходовИРасходовПоДням КАК упоФактДоходовИРасходовПоДням
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокЗадач КАК СписокЗадач
	        |		ПО упоФактДоходовИРасходовПоДням.ПроектнаяЗадача = СписокЗадач.ПроектнаяЗадача
	        |ГДЕ
	        |	упоФактДоходовИРасходовПоДням.ВидЭлемента = &Расход
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	упоФактДоходовИРасходовПоДням.ПроектнаяЗадача
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ПроектнаяЗадача
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	СписокЗадач.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	СписокЗадач.ЗадачаРодитель КАК ЗадачаРодитель,
	        |	СписокЗадач.ЭтоПакетРабот КАК ПакетРабот,
	        |	СписокЗадач.ЭтоМодельПакетаРабот КАК МодельПакетаРабот,
	        |	СписокЗадач.ЭтоВеха КАК ЭтоВеха,
	        |	СписокЗадач.НазваниеЗадачи КАК НазваниеПроектнойЗадачи,
	        |	СписокЗадач.КодСДР КАК КодСДР,
	        |	СписокЗадач.СсылкаНаЗеркальныйПроект КАК СсылкаНаЗеркальныйПроект,
	        |	СписокЗадач.СтатусЗадачи КАК СтатусЗадачи,
	        |	ВЫБОР
	        |		КОГДА СписокЗадач.СтатусЗадачиЗакрытаИлиЗавершена
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусОтчетыСтатусыРесурсов.Освобождены)
	        |		КОГДА ОпределениеВыделенныхРесурсовПроектныхЗадач.ПроектнаяЗадача ЕСТЬ NULL
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусОтчетыСтатусыРесурсов.План)
	        |		КОГДА ОпределениеВыделенныхРесурсовПроектныхЗадач.ЕстьВыделенныеРесурсыМаксимум
	        |				И ОпределениеВыделенныхРесурсовПроектныхЗадач.ЕстьВыделенныеРесурсыМинимум
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусОтчетыСтатусыРесурсов.Выделены)
	        |		КОГДА ОпределениеВыделенныхРесурсовПроектныхЗадач.ЕстьВыделенныеРесурсыМаксимум
	        |				И НЕ ОпределениеВыделенныхРесурсовПроектныхЗадач.ЕстьВыделенныеРесурсыМинимум
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусОтчетыСтатусыРесурсов.Мало)
	        |		КОГДА НЕ ОпределениеВыделенныхРесурсовПроектныхЗадач.ЕстьВыделенныеРесурсыМаксимум
	        |				И НЕ ОпределениеВыделенныхРесурсовПроектныхЗадач.ЕстьВыделенныеРесурсыМинимум
	        |			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоСтатусОтчетыСтатусыРесурсов.Критично)
	        |	КОНЕЦ КАК Ресурсы,
	        |	ВЫБОР
	        |		КОГДА ТаблицаРасходов.РасходВсего ЕСТЬ NULL
	        |			ТОГДА ЛОЖЬ
	        |		ИНАЧЕ ИСТИНА
	        |	КОНЕЦ КАК ЗапланированыРасходы,
	        |	ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) КАК ПроцентВыполненияЗадачи,
	        |	ЕСТЬNULL(ТаблицаРасходов.РасходВсего, 0) * ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) / 100 КАК EV,
	        |	ЕСТЬNULL(ТаблицаРасходов.РасходВсего, 0) * ЕСТЬNULL(упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроцентГотовности, 0) / 100 - ЕСТЬNULL(ТаблицаРасходовФакт.РасходТекФакт, 0) КАК CV
	        |ИЗ
	        |	СписокЗадач КАК СписокЗадач
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОпределениеВыделенныхРесурсовПроектныхЗадач КАК ОпределениеВыделенныхРесурсовПроектныхЗадач
	        |		ПО СписокЗадач.ПроектнаяЗадача = ОпределениеВыделенныхРесурсовПроектныхЗадач.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоПроцентыГотовностиПроектныхЗадач.СрезПоследних(
	        |				,
	        |				Версия = &текВерсия
	        |					И ПроектнаяЗадача В
	        |						(ВЫБРАТЬ
	        |							СписокЗадач.ПроектнаяЗадача
	        |						ИЗ
	        |							СписокЗадач)) КАК упоПроцентыГотовностиПроектныхЗадачСрезПоследних
	        |		ПО СписокЗадач.ПроектнаяЗадача = упоПроцентыГотовностиПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасходов КАК ТаблицаРасходов
	        |		ПО СписокЗадач.ПроектнаяЗадача = ТаблицаРасходов.ПроектнаяЗадача
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасходовФакт КАК ТаблицаРасходовФакт
	        |		ПО СписокЗадач.ПроектнаяЗадача = ТаблицаРасходовФакт.ПроектнаяЗадача";
		
КонецФункции

&НаСервере
Процедура РекурсивноПосчитатьБюджеты(Дерево, Бюджеты, ДанныеРодителя)
	
	Для Каждого Строка Из Дерево.Строки Цикл
		ДанныеРодителяВнутр = Новый Структура("ЗапланированыРасходы, EV, CV", Ложь, 0, 0);	
		РекурсивноПосчитатьБюджеты(Строка, Бюджеты, ДанныеРодителяВнутр);
		Если ДанныеРодителяВнутр.ЗапланированыРасходы Тогда
			Строка.ЗапланированыРасходы = Макс(ДанныеРодителяВнутр.ЗапланированыРасходы, Строка.ЗапланированыРасходы);
			Строка.EV = ДанныеРодителяВнутр.EV + Строка.EV;
			Строка.CV = ДанныеРодителяВнутр.CV + Строка.CV;					
		КонецЕсли;
		ДанныеРодителя.ЗапланированыРасходы = Макс(ДанныеРодителя.ЗапланированыРасходы, Строка.ЗапланированыРасходы);
		ДанныеРодителя.EV = ДанныеРодителя.EV + Строка.EV;
		ДанныеРодителя.CV = ДанныеРодителя.CV + Строка.CV;
		
		// Заполним бюджеты
		CVПоделитьНаEV = 0;
		Если Строка.EV <> 0 Тогда
			CVПоделитьНаEV = Строка.CV / Строка.EV;			
		КонецЕсли;
		
		ОтклонениеEVОтCV = 0.25;
		
		Если Не Строка.ЗапланированыРасходы Тогда
			Строка.Бюджеты = Бюджеты.План;		
		ИначеЕсли CVПоделитьНаEV = 0 Тогда
			Строка.Бюджеты = Бюджеты.Освоены;
		ИначеЕсли CVПоделитьНаEV > 0 И CVПоделитьНаEV <= ОтклонениеEVОтCV Тогда
			Строка.Бюджеты = Бюджеты.ПоГрафику;
		ИначеЕсли CVПоделитьНаEV >= -ОтклонениеEVОтCV И CVПоделитьНаEV < 0 Тогда
			Строка.Бюджеты = Бюджеты.Отклонения;
		Иначе
			Строка.Бюджеты = Бюджеты.НеИсполняется;
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЗадачФормыПоПромежуточномуДереву()

	тТаблицаДанных = РеквизитФормыВЗначение("ТаблицаДанных");
	ДеревоЗадач.ПолучитьЭлементы().Очистить();
	
	ЗаполнитьСтрокиДереваЗадач(тТаблицаДанных, ДеревоЗадач.ПолучитьЭлементы(), 0);

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСтрокиДереваЗадач(СтрокаДерева, СтрокиЗадач, Уровень)

	Для Каждого СтрокаИсточник Из СтрокаДерева.Строки Цикл 	
		СписокСвойств = "ИндексКартинки, Ресурсы, СтатусЗадачи, ПроцентВыполненияЗадачи, Бюджеты";
		
		НоваяСтрока = СтрокиЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник, СписокСвойств);		
		
		НоваяСтрока.ЗадачаПредставление = СтрокаИсточник.НазваниеПроектнойЗадачи;		
		НоваяСтрока.ЗадачаСсылка = СтрокаИсточник.ПроектнаяЗадача;
		НоваяСтрока.Родитель = ?(СтрокаИсточник.Родитель = Неопределено, Неопределено, СтрокаИсточник.Родитель.ПроектнаяЗадача);
		НоваяСтрока.Уровень = Уровень;
		
		Если СтрокаИсточник.Строки.Количество() > 0 Тогда
			ЗаполнитьСтрокиДереваЗадач(СтрокаИсточник, НоваяСтрока.ПолучитьЭлементы(), Уровень + 1);
		КонецЕсли;
	КонецЦикла;                        	 

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДеревоЗадачНаФормеПоДаннымОбъекта()

	ДеревоЗадач.ПолучитьЭлементы().Очистить();
	
	тСтатусЗадач = Объект.СтатусЗадач;
	
	Если тСтатусЗадач.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
		
	СтрокиНайдено = тСтатусЗадач.НайтиСтроки(Новый Структура("Уровень", 0)); 
	
	ИндексыКартинокПЗ = ПолучитьСоответствиеИндексКартинкиПроектнымЗадачам();
	
	СтруктураИндексов = ПолучитьТекущиеИндексыКартинокКоллекции();
	
	Для Каждого Строка Из СтрокиНайдено Цикл 	
		НоваяСтрока = ДеревоЗадач.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		ЗаполнитьИндексКартинкиСтрокиДерева(НоваяСтрока, ИндексыКартинокПЗ, СтруктураИндексов);
		
		ВывестиПодчиненныеСтроки(НоваяСтрока.ПолучитьЭлементы(), тСтатусЗадач, Строка.ЗадачаСсылка, Строка.Уровень + 1,
			ИндексыКартинокПЗ, СтруктураИндексов);
	КонецЦикла;	 

КонецПроцедуры 

&НаСервере
Функция ПолучитьСоответствиеИндексКартинкиПроектнымЗадачам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоМодельПакетаРабот КАК МодельПакетаРабот,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоПакетРабот КАК ПакетРабот,
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ЭтоВеха КАК ЭтоВеха
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &текВерсия
	               |				И ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаСсылка КАК ЗадачаСсылка
	               |					ИЗ
	               |						Документ.упоСтатусОтчетПоПроекту.СтатусЗадач КАК упоСтатусОтчетПоПроектуСтатусЗадач
	               |					ГДЕ
	               |						упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка = &Ссылка
	               |						И упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаСсылка <> ЗНАЧЕНИЕ(Документ.упоПроектнаяЗадача.ПустаяСсылка))) КАК упоСвойстваПроектныхЗадачСрезПоследних";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("текВерсия", ЭтотОбъект.ТекущаяВерсия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураИндексовКартинок = ПолучитьТекущиеИндексыКартинокКоллекции();
	ИндексыКартинокПЗ = Новый Соответствие;
	СвойстваПЗ = Новый Структура("МодельПакетаРабот, ПакетРабот, ЭтоВеха, ИндексКартинки");
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СвойстваПЗ, Выборка);
		ЗаполнитьИндексКартинки(СвойстваПЗ, СтруктураИндексовКартинок);
		ИндексыКартинокПЗ.Вставить(Выборка.ПроектнаяЗадача, СвойстваПЗ.ИндексКартинки);
	КонецЦикла;
	
	Возврат ИндексыКартинокПЗ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИндексКартинкиСтрокиДерева(СтрокаДерева, ИндексыКартинокПЗ, СтруктураИндексов)
	
	НайденныйИндекс = ИндексыКартинокПЗ[СтрокаДерева.ЗадачаСсылка];
	Если НайденныйИндекс <> Неопределено Тогда
		СтрокаДерева.ИндексКартинки = НайденныйИндекс;
		Возврат;
	КонецЕсли;
		
	Если СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоВехаСтар Тогда
		СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоВехаНов;
	КонецЕсли;
	Если СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоПакетРаботСтар Тогда
		СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоПакетРаботНов;
	КонецЕсли;
	Если СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоМодельПакетаРаботСтар Тогда
		СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоМодельПакетаРаботНов;
	КонецЕсли;
	Если СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоЭтапСтар Тогда
		СтрокаДерева.ИндексКартинки = СтруктураИндексов.ИндексЭтоЭтапНов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТекущиеИндексыКартинокКоллекции()
	
	СтруктураИндексов = Новый Структура;
	СтруктураИндексов.Вставить("ИндексЭтоВехаСтар", 3);
	СтруктураИндексов.Вставить("ИндексЭтоВехаНов", 9);
	СтруктураИндексов.Вставить("ИндексЭтоПакетРаботСтар", 2);
	СтруктураИндексов.Вставить("ИндексЭтоПакетРаботНов", 8);
	СтруктураИндексов.Вставить("ИндексЭтоМодельПакетаРаботСтар", 0);
	СтруктураИндексов.Вставить("ИндексЭтоМодельПакетаРаботНов", 6);
	СтруктураИндексов.Вставить("ИндексЭтоЭтапСтар", 1);
	СтруктураИндексов.Вставить("ИндексЭтоЭтапНов", 7);
	
	Возврат СтруктураИндексов;
	
КонецФункции

&НаСервере
Процедура ВывестиПодчиненныеСтроки(СтрокиЗадач, Таблица, Родитель, Уровень, ИндексыКартинокПЗ, СтруктураИндексов)

	СтрокиНайдено = Таблица.НайтиСтроки( Новый Структура("Родитель, Уровень", Родитель, Уровень) ); 
	
	Для Каждого Строка Из СтрокиНайдено Цикл 	
		НоваяСтрока = СтрокиЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		ЗаполнитьИндексКартинкиСтрокиДерева(НоваяСтрока, ИндексыКартинокПЗ, СтруктураИндексов);
		
		ВывестиПодчиненныеСтроки(НоваяСтрока.ПолучитьЭлементы(), Таблица, Строка.ЗадачаСсылка, Уровень + 1,
			ИндексыКартинокПЗ, СтруктураИндексов);
	КонецЦикла;	 

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьТипВопросаПоТаблице(Строка, ИмяТаблицы)

	Если Строка = Неопределено Тогда 
		Возврат;
	КонецЕсли;                	
	
	Строка.ТипВопроса = СтруктураТипыВопросаТаблиц()[ИмяТаблицы];

КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция СтруктураТипыВопросаТаблиц()

	Структура = Новый Структура;
	
	Структура.Вставить("ВопросыТребующиеРешения", 0);
	Структура.Вставить("ВопросыВыполняемые", 1);
	Структура.Вставить("ВопросыНаКонтроле", 2);
	Структура.Вставить("ВопросыБлижайшие", 3);
	Структура.Вставить("ВопросыВыполненные", 4);
	
	Возврат Структура;

КонецФункции 

&НаСервере
Процедура ЗаполнитьВопросыНаСервере()
	// очистить вопросы на контроле (типВопроса = 2)
	НайденныеСтроки = Объект.Вопросы.НайтиСтроки(Новый Структура("ТипВопроса", 2));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.Вопросы.Удалить(НайденнаяСтрока);
	КонецЦикла;
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрошлыйОтчет.Вопрос КАК Вопрос,
	|	ПрошлыйОтчет.Описание КАК Описание,
	|	ПрошлыйОтчет.Решения КАК Решения,
	|	2 КАК ТипВопроса,
	|	ПрошлыйОтчет.Статус КАК Статус,
	|	ПрошлыйОтчет.Срок КАК Срок,
	|	ПрошлыйОтчет.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.упоСтатусОтчетПоПроекту.Вопросы КАК ПрошлыйОтчет
	|ГДЕ
	|	ПрошлыйОтчет.Ссылка = &ПрошлыйОтчет
	|	И (ПрошлыйОтчет.ТипВопроса = 2
	|				И ПрошлыйОтчет.Статус <> ЗНАЧЕНИЕ(Перечисление.упоСтатусОтчетыСтатусыВопросов.Выполнено)
	|			ИЛИ ПрошлыйОтчет.ТипВопроса = 0)");
	Запрос.УстановитьПараметр("ПрошлыйОтчет", Объект.ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Вопросы.Добавить(), Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьСтроку(ИмяТЧ, ИмяЭлементаТаблицы, ТипВопроса, НаправлениеПеремещения, ОбновлятьНумерацию = Истина)
	
	ТабличнаяЧасть = Объект[ИмяТЧ];
	ЭлементТаблица = Элементы[ИмяЭлементаТаблицы];	
	упоРаботаСФормамиКлиент.ПереместитьСтрокуВТаблице(ТабличнаяЧасть, ЭлементТаблица, НаправлениеПеремещения);
	
	Если ОбновлятьНумерацию Тогда
		СтруктураТипыВопросаТаблиц = Новый Структура;
		СтруктураТипыВопросаТаблиц.Вставить(ИмяЭлементаТаблицы, ТипВопроса);
		НумерацияСтрокТЧЗадачиАктивности(СтруктураТипыВопросаТаблиц, ТабличнаяЧасть);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтатусыСроковНаСервере()
	
	СтрокиДереваПроектныеЗадачи = ПолучитьСтрокиДереваИСсылкиНаПроектныеЗадачиИзДерева();	
	ДанныеПоПЗ = ПолучитьКалендарьИДанныеПоПроектнымЗадачам(Объект.Проект, 
															ЭтотОбъект.ТекущаяВерсия, 
															СтрокиДереваПроектныеЗадачи.ПроектныеЗадачи);	
	КалендарьПроекта = ДанныеПоПЗ.КалендарьПроекта;
	ЕдиницаВремениПоУмолчанию = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.упоЕдиницыВремени.РабочийДень");
	СвойстваПроектныхЗадач = ДанныеПоПЗ.СвойстваПроектныхЗадач;
	НачалоТекущегоДня = НачалоДня(ТекущаяДатаСеанса());
	
	// Создаем аналог строки дерева из упрощенного ввода структуры
	СтрокаДерева = Новый Структура;
	
	СтруктураИндексовКартинок = ПолучитьТекущиеИндексыКартинокКоллекции();
		
	ИндексКартинкиЭтоВехаСтар = СтруктураИндексовКартинок.ИндексЭтоВехаСтар;
	ИндексКартинкиЭтоВехаНов = СтруктураИндексовКартинок.ИндексЭтоВехаНов;
	
	Для Каждого Строка Из СтрокиДереваПроектныеЗадачи.СтрокиДерева Цикл
		
		СтрокаДерева.Вставить("СтатусСроков", Строка.Сроки);
		СтрокаДерева.Вставить("ПроцентГотовности", Строка.ПроцентВыполненияЗадачи);
		СтрокаДерева.Вставить("ДатаНачала", Строка.ДатаНачалаПлан);
		СтрокаДерева.Вставить("ДатаЗавершения", Строка.ДатаОкончанияПлан);
		СтрокаДерева.Вставить("Статус", Строка.СтатусЗадачи);		
		
		Если Строка.ИндексКартинки = ИндексКартинкиЭтоВехаСтар 
			Или Строка.ИндексКартинки = ИндексКартинкиЭтоВехаНов Тогда
			СтрокаДерева.Вставить("ЭтоВеха", Истина);
		Иначе
			СтрокаДерева.Вставить("ЭтоВеха", Ложь);
			// Так как мы не храним время в ДатаОкончанияПлан и если ДатаНачалаПлан и ДатаОкончанияПлан равны,
			// то при расчете длительности будем получать нулевую длительность, поэтому приводим ДатаЗавершения к концу дня.
			СтрокаДерева.ДатаЗавершения = КонецДня(СтрокаДерева.ДатаЗавершения);
		КонецЕсли;
		СвойстваПроектнойЗадачи = СвойстваПроектныхЗадач.Найти(Строка.ЗадачаСсылка, "ПроектнаяЗадача");
		Если СвойстваПроектнойЗадачи <> Неопределено Тогда
			СтрокаДерева.Вставить("ЕдиницаИзмерения", СвойстваПроектнойЗадачи.ЕдиницаИзмерения);
			СтрокаДерева.Вставить("ДлительностьБезУчетаКалендаряПроекта",
				СвойстваПроектнойЗадачи.ДлительностьБезУчетаКалендаряПроекта);
			СтрокаДерева.Вставить("КалендарьЗадачи", СвойстваПроектнойЗадачи.КалендарьЗадачи);			
		Иначе
			СтрокаДерева.Вставить("ЕдиницаИзмерения", ЕдиницаВремениПоУмолчанию);
			СтрокаДерева.Вставить("ДлительностьБезУчетаКалендаряПроекта", Ложь);
			СтрокаДерева.Вставить("КалендарьЗадачи", Справочники.упоРабочиеКалендари.ПустаяСсылка());
		КонецЕсли;
		СтрокаДерева.Вставить("ОтставаниеОтТекПлана", 0);		
		упоСтруктураПроектаКолонкиКлиентСервер.РассчитатьОтставаниеОтТекПлана(СтрокаДерева, Истина, КалендарьПроекта, 
			Неопределено, ЕдиницаВремениПоУмолчанию, НачалоТекущегоДня);			
		
		СтрокаДерева.Вставить("Длительность", 0);
		СтрокаДерева.Длительность = упоРасчетКалендарныхСроковРедакция3Сервер.РассчитатьДлительность(
			СтрокаДерева.ДатаНачала, СтрокаДерева.ДатаЗавершения, СтрокаДерева.ЕдиницаИзмерения,
			СтрокаДерева.КалендарьЗадачи, КалендарьПроекта, СтрокаДерева.ДлительностьБезУчетаКалендаряПроекта);	
			
		упоСтруктураПроектаКолонкиКлиентСервер.РассчитатьСтатусСроков(СтрокаДерева, Истина, НачалоТекущегоДня,
			СтрокаДерева.ЭтоВеха);	
			
		Строка.Сроки = СтрокаДерева.СтатусСроков;	
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКалендарьИДанныеПоПроектнымЗадачам(Проект, ТекущаяВерсия, ПроектныеЗадачи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоКалендариПроектовСрезПоследних.КалендарьПроекта КАК КалендарьПроекта
	|ИЗ
	|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК упоКалендариПроектовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ЕдиницаНормированияДлительности КАК ЕдиницаИзмерения,
	|	упоСвойстваПроектныхЗадачСрезПоследних.ДлительностьБезУчетаКалендаряПроекта КАК ДлительностьБезУчетаКалендаряПроекта,
	|	упоСвойстваПроектныхЗадачСрезПоследних.КалендарьЗадачи КАК КалендарьЗадачи
	|ИЗ
	|	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	|			,
	|			Версия = &текВерсия
	|				И ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоСвойстваПроектныхЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", ПроектныеЗадачи);
	Запрос.УстановитьПараметр("текВерсия", ТекущаяВерсия);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	КалендарьПроект = Справочники.упоРабочиеКалендари.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		КалендарьПроект = Выборка.КалендарьПроекта;
	КонецЕсли;
	
	СвойстваПроектныхЗадач = РезультатЗапроса[1].Выгрузить();
	СвойстваПроектныхЗадач.Индексы.Добавить("ПроектнаяЗадача");
	
	Возврат Новый Структура("КалендарьПроекта, СвойстваПроектныхЗадач", КалендарьПроект, СвойстваПроектныхЗадач);
		
КонецФункции

&НаСервере
Функция ПолучитьСтрокиДереваИСсылкиНаПроектныеЗадачиИзДерева()
	
	СтрокиДерева = Новый Массив;	
	Для Каждого Строка Из ДеревоЗадач.ПолучитьЭлементы() Цикл
		СтрокиДерева.Добавить(Строка);		
	КонецЦикла;
	
	ПроектныеЗадачи = Новый Массив;
	Для Каждого Строка Из СтрокиДерева Цикл		
		Если ЗначениеЗаполнено(Строка.ЗадачаСсылка) Тогда
			ПроектныеЗадачи.Добавить(Строка.ЗадачаСсылка);	
		КонецЕсли;
		ЭлементыСтроки = Строка.ПолучитьЭлементы();
		Для Каждого ЭлементСтроки Из ЭлементыСтроки Цикл
			СтрокиДерева.Добавить(ЭлементСтроки);
		КонецЦикла;		
	КонецЦикла;
	
	Возврат Новый Структура("СтрокиДерева, ПроектныеЗадачи", СтрокиДерева, ПроектныеЗадачи);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НумерацияСтрокТЧЗадачиАктивности(ТипыВопросаТаблиц, Таблица)

	// Для каждого типа вопроса своя нумерация
	ТекущийНомерСтрокиТипаВопроса = Новый Соответствие;
	
	Для Каждого Элемент Из ТипыВопросаТаблиц Цикл
		ТекущийНомерСтрокиТипаВопроса.Вставить(Элемент.Значение, 1);
	КонецЦикла;
	
	Для Каждого Строка Из Таблица Цикл
		
		ТекНомерСтроки = ТекущийНомерСтрокиТипаВопроса[Строка.ТипВопроса];
		
		Если ТекНомерСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.НомерВопроса = ТекНомерСтроки;
		
		ТекущийНомерСтрокиТипаВопроса.Вставить(Строка.ТипВопроса, ТекНомерСтроки + 1);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыйНомерВопросаПоТаблице(СтрокаТаблицы, Таблица)
	
	ТипВопроса = СтрокаТаблицы.ТипВопроса;
	
	МаксимальныйНомер = 0;
	Для Каждого Строка Из Таблица Цикл
		Если Строка.ТипВопроса = ТипВопроса Тогда
			МаксимальныйНомер = Макс(МаксимальныйНомер, Строка.НомерВопроса);
		КонецЕсли;
	КонецЦикла;
	
	СтрокаТаблицы.НомерВопроса = МаксимальныйНомер + 1;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипИНомерВопроса(Элемент, НоваяСтрока, УстанавливатьНомер)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	ИмяТаблицы = Элемент.Имя;
	
	Если НоваяСтрока Тогда 		
		УстановитьТипВопросаПоТаблице(ТекущиеДанные, ИмяТаблицы);
		Если УстанавливатьНомер Тогда
			УстановитьНовыйНомерВопросаПоТаблице(ТекущиеДанные, Объект.ЗадачиАктивности);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументНаСервере();
	
	РекурсивноРазвернутьДерево(ДеревоЗадач);  		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере() Экспорт
	
	ЭтотОбъект.ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Объект.Проект);
	
	ЗаполнитьДеревоЗадачФормыПоДаннымБД();
	ЗаполнитьСведенияОПроектеСервер();
	ЗаполнитьСводныйСтатусНаСервере();
	ЗаполнитьЗадачиАктивностиНаСервере();
	ЗаполнитьВопросыНаСервере();
	ЗаполнитьРискиНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполненностьТаблицы(ПараметрыПроверки)
	
	Если ПараметрыПроверки.ПроверяемыйОбъект.Количество() > 0 Тогда 
		 		
		ТекстВопроса = НСтр("ru = 'Перед заполнением требуется очистить таблицу ""%1"". Продолжить?'");		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса,
			ПараметрыПроверки.НазваниеПроверяемогоОбъекта);
		
		ОписаниеОповещения = 
			Новый ОписаниеОповещения("ПроверитьЗаполненностьТаблицыЗавершение", ЭтотОбъект, ПараметрыПроверки);
			
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
						 
	Иначе 
		
		ПроверитьЗаполненностьТаблицыЗавершение(КодВозвратаДиалога.Да, ПараметрыПроверки);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОбОчисткеДанныхДокумента(ПараметрыВопроса)
	
	ТекстВопроса = НСтр("ru = 'Перед заполнением требуется очистить %1. Продолжить?'");		
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса,
		ПараметрыВопроса.ОчищаемыеДанные);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьЗаполненностьТаблицыЗавершение", ЭтотОбъект,
		ПараметрыВопроса);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполненностьТаблицыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	ВыполняемаяОперация = ДополнительныеПараметры.ВыполняемаяОперация;
	Если ВыполняемаяОперация = "ЗаполнитьПЗ" Тогда		
		ЗаполнитьДеревоЗадачФормыПоДаннымБД();		
		РекурсивноРазвернутьДерево(ДеревоЗадач);		
	ИначеЕсли ВыполняемаяОперация = "ЗаполнитьВопросы" Тогда
		ЗаполнитьВопросыНаСервере();
	ИначеЕсли ВыполняемаяОперация = "ЗаполнитьЗадачиАктивности" Тогда
		ЗаполнитьЗадачиАктивностиНаСервере();
	ИначеЕсли ВыполняемаяОперация = "ЗаполнитьРиски" Тогда
		ЗаполнитьРискиНаСервере();
	ИначеЕсли ВыполняемаяОперация = "ЗаполнитьСведенияОПроекте" Тогда		
		ЗаполнитьСведенияОПроектеСервер();		
	Иначе
		ЗаполнитьСводныйСтатусНаСервере();
	КонецЕсли;	
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Соответствие_СтатусыРисковПроектов_СтатусОтчетыСтатусыРисков()
	
	СоответствиеСтатусовРисков = Новый Соответствие;
	
	СоответствиеСтатусовРисков.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыРисковПроектов.Актуален"),
		ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыРисков.Актуальны")); 
	
	СоответствиеСтатусовРисков.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыРисковПроектов.Закрыт"),
		ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыРисков.Закрыты"));
	
	СоответствиеСтатусовРисков.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыРисковПроектов.ПотерялАктуальность"),
		ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыРисков.НеАктуальны"));
	
	СоответствиеСтатусовРисков.Вставить(ПредопределенноеЗначение("Справочник.упоСтатусыРисковПроектов.Сработал"),
		ПредопределенноеЗначение("Перечисление.упоСтатусОтчетыСтатусыРисков.Сработали"));
	
	Возврат СоответствиеСтатусовРисков;
		
КонецФункции 

#КонецОбласти 


