
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
				
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, , Отказ, СтандартнаяОбработка); 		
		
	Параметры.Свойство("УИстроки", УИстроки);
	Параметры.Свойство("ИмяТаблицы", ИмяТаблицы);
	Параметры.Свойство("сРеквизитами", сРеквизитами);
	
	масНужныеТипы = Неопределено;
	Параметры.Свойство("масНужныеТипы", масНужныеТипы);
	
	масНужныеТаблицы = Неопределено;
	Параметры.Свойство("масНужныеТаблицы", масНужныеТаблицы);
	
	масТаблицыИсключения = Неопределено;
	Параметры.Свойство("масТаблицыИсключения", масТаблицыИсключения);
	
	Пар = Новый Структура;
	Пар.Вставить("масНужныеТипы", масНужныеТипы);
	Пар.Вставить("масНужныеТаблицы", масНужныеТаблицы);
	Пар.Вставить("масТаблицыИсключения", масТаблицыИсключения);
	Пар.Вставить("СокрПредставление", Истина);
	
	СписТаблиц = упоОповещенияВызовСервера.ПолучитьСписокДоступныхТаблиц(Пар);
	
	ТекущаяСтрока = Неопределено;
	ПредТип = "";
	КолТипы = дзТаблицыМД.ПолучитьЭлементы();
	счТипов = 0;
	Для Каждого Эл Из СписТаблиц Цикл
		
		ТекИмя = Эл.Значение;
		ТекПредставление = Эл.Представление;
		Поз = Найти(ТекИмя,".");
		Если Поз = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекТип = Лев(ТекИмя,Поз-1);
		Если ТекТип <> ПредТип Тогда
			новЭл = КолТипы.Добавить();
			новЭл.ИмяТаблицы = ТекТип;
			новЭл.Представление = ТекТип;
			новЭл.КодКартинки = 0;
			КолТаблицы = новЭл.ПолучитьЭлементы();
			счТипов = счТипов + 1;
		КонецЕсли;
		
		ПредТип = ТекТип;
		
		новЭл = КолТаблицы.Добавить();
		новЭл.ИмяТаблицы = ТекИмя;
		новЭл.Представление = ТекПредставление;	
		новЭл.КодКартинки = 1;
		Если ИмяТаблицы = текИмя Тогда
			ТекущаяСтрока = новЭл.ПолучитьИдентификатор();	
		КонецЕсли;
		
		Если сРеквизитами Тогда
			КолРеквизиты = новЭл.ПолучитьЭлементы();
			НовЭл = КолРеквизиты.Добавить();
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Элементы.дзТаблицыМД.ТекущаяСтрока = ТекущаяСтрока;	
	КонецЕсли;
	
	Если сРеквизитами Тогда
		ЭтаФорма.Заголовок = НСтр("ru = 'Выбор реквизита таблицы метаданных'");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма);
	
	Если счТипов = 1 Тогда
		КолТипы = дзТаблицыМД.ПолучитьЭлементы();
		Для Каждого Эл Из КолТипы Цикл
			Элементы.дзТаблицыМД.Развернуть(Эл.ПолучитьИдентификатор());	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Неопределено, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Неопределено, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Неопределено, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Неопределено, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Неопределено, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Неопределено, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);	
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура дзТаблицыМДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Выбрать(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	текДанные = Элементы.дзТаблицыМД.ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = текДанные.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Возврат;
	Иначе
		ТипТаблицы = Родитель.Представление;	
	КонецЕсли;
	
	Пар = Новый Структура("ИмяТаблицы,ПредставлениеТаблицы,УИстроки",текДанные.ИмяТаблицы,ТипТаблицы+"."+текДанные.Представление,УИстроки);
	
	ОповеститьОВыборе(Пар);
	
КонецПроцедуры

#КонецОбласти
