////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции проверки заполнения.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет заполнено ли переданное значение.
//
// Параметры:
//  Значение - Произвольный	 - Значение, заполнение которого надо проверить.
// 
// Возвращаемое значение:
//  Булево - Истина - значение не заполнено, ложь - иначе.
//
Функция обЗначениеНеЗаполнено(Значение) Экспорт

	Попытка
		
		Возврат Не ЗначениеЗаполнено(Значение);
		
	Исключение
		
		Результат = Ложь;
		ТипЗначения = ТипЗнч(Значение);
		
		// Сначала примитивные типы.
		Если Значение = Неопределено Тогда
			Результат = Истина;
		ИначеЕсли Значение = NULL Тогда
			Результат = Истина;
		ИначеЕсли ТипЗначения = Тип("Строка") Тогда
			Если СокрЛП(Значение) = "" Тогда
				Результат = Истина;
			КонецЕсли; 
		ИначеЕсли ТипЗначения = Тип("Число") Тогда
			Если Значение = 0 Тогда
				Результат = Истина;
			КонецЕсли; 
		ИначеЕсли ТипЗначения = Тип("Дата") Тогда
			Если Значение = Дата('00010101') Тогда
				Результат = Истина;
			КонецЕсли; 
		ИначеЕсли ТипЗначения = Тип("Булево") Тогда
			Результат = Ложь; // Булево будем считать не пустым.
			
			// Отдельное определение, так как конструкторов данного типа не существует.
		ИначеЕсли ТипЗначения = Тип("РежимПроведенияДокумента") Тогда
			Если Значение = РежимПроведенияДокумента.Неоперативный ИЛИ Значение = РежимПроведенияДокумента.Оперативный Тогда
				Результат = Ложь;
			КонецЕсли;
			
			// Для остальных будем считать значение пустым, если оно равно
			// дефолтному значению своего типа.
		Иначе
			Попытка
				Если Значение = Новый(ТипЗначения) Тогда
					Результат = Истина;
				КонецЕсли; 
			Исключение
				Результат = Ложь;
			КонецПопытки;
		КонецЕсли; 
		
		Возврат Результат;
		
	КонецПопытки;	

КонецФункции

// Предназначена для получения пустого значения заданного типа:
//  примитивного, или ссылочного.
//
// Параметры:
//  ЗаданныйТип	 - Тип	 - пустое значение которого нужно получить.
// 
// Возвращаемое значение:
//  Тип
//
Функция обПустоеЗначениеТипа(ЗаданныйТип) Экспорт
	
	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Новый (ЗаданныйТип);
	КонецЕсли;
	
КонецФункции

// Функция проверяет заполнение обязательных реквизитов объекта
// и формирует строку сообщений в случае незаполненности реквизитов.
// 
// Параметры: 
//  ЭтотОбъект                 - ОбъектСсылка - содержит ссылку на проверяемый объект.
//  СтруктураОбязательныхПолей - Структура - содержит перечень обязательных реквизитов и их значения.
//                               Реквизит - ключ поля структуры, значение реквизита - значение поля стурктуры.
//  СтрокаСообщений            - Строка - Содержит строку сообщений.
// 
// Возвращаемое значение: 
//	Булево - Истина - все поля заполнены; Ложь - есть незаполненные поля.
// 
Функция обПроверитьЗаполнениеПолейШапки(ЭтотОбъект, СтруктураОбязательныхПолей, СтрокаСообщений = "") Экспорт
	
	МетаданныеРеквизиты = ЭтотОбъект.Метаданные().Реквизиты;
	
	ПризнакЗаполнения = Истина;
	
	// Цикл по проверяемым полям.
	Для Каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

		Значение = ЭтотОбъект[КлючЗначение.Ключ];
		Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Значение) Тогда 
			
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(КлючЗначение.Значение) Тогда 
				// Отделить предопределенные поля.
				ПризнакЗаполнения = Ложь;
				
				Если КлючЗначение.Ключ = "Код"
				 Или КлючЗначение.Ключ = "Наименование"
				 Или КлючЗначение.Ключ = "Владелец" Тогда
					ПредставлениеРеквизита = КлючЗначение.Ключ;
				Иначе
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
				КонецЕсли;
				
				Если Не СтрокаСообщений = "" Тогда
					СтрокаСообщений = СтрокаСообщений + Символы.ПС;
				КонецЕсли;
				СтрокаСообщений = СтрокаСообщений
				                  + "Необходимо заполнить значение реквизита """
								  + СокрЛП(ПредставлениеРеквизита) + """";
			Иначе
				ПризнакЗаполнения = Ложь;
				
				Если Не СтрокаСообщений = "" Тогда
					СтрокаСообщений = СтрокаСообщений + Символы.ПС;
				КонецЕсли;
				СтрокаСообщений = СтрокаСообщений + КлючЗначение.Значение;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	Возврат ПризнакЗаполнения;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта
// и информирует пользователя о незаполненности реквизитов.
// Если хотя бы одно поле не заполнено, то выставляется флаг отказа от выполнения операции.
// 
// Параметры: 
//  ЭтотОбъект   - ОбъектСсылка - содержит ссылку на проверяемый объект.
//  СтруктураОбязательныхПолей - Структура - содержит перечень обязательных реквизитов и их значения.
//                               Реквизит - ключ поля структуры,
//                               значение реквизита - значение поля стурктуры.
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура обПроверитьЗаполнениеРеквизитовШапки(ЭтотОбъект, СтруктураОбязательныхПолей,
											   Отказ, Заголовок) Экспорт
	
	МетаданныеРеквизиты = ЭтотОбъект.Метаданные().Реквизиты;
	
	// Цикл по проверяемым полям.
	Для Каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

		Значение = ЭтотОбъект[КлючЗначение.Ключ];
		Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Значение) Тогда 
			
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(КлючЗначение.Значение) Тогда 
				// Отделить предопределенные поля.
				Если КлючЗначение.Ключ = "Код"
				 Или КлючЗначение.Ключ = "Наименование"
				 Или КлючЗначение.Ключ = "Владелец" Тогда
					ПредставлениеРеквизита = КлючЗначение.Ключ;
				Иначе
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
				КонецЕсли;
				СтрокаСообщения = "Необходимо заполнить значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """";
			Иначе
				СтрокаСообщения = КлючЗначение.Значение;
			КонецЕсли;
			
			СтруктураСообщения = Новый Структура;
			СтруктураСообщения.Вставить("Поле", "Объект." + КлючЗначение.Ключ);
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок,, СтруктураСообщения);

		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов табличной части объекта
//  и информирует пользователя о незаполненности реквизитов.
//  Если хотя бы одно поле не заполнено, то выставляется флаг отказа от выполнения операции.
//
// Параметры:
//  ЭтотОбъект					 - ОбъектСсылка	 - содержит ссылку на проверяемый объект.
//  ИмяТабличнойЧасти			 - Строка
//  СтруктураОбязательныхПолей	 - Структура	 - содержит перечень обязательных реквизитов и их значения.
//  	*Ключ поля структуры - реквизит,
//  	*Значение поля структуры - значение реквизита.
//  Отказ						 - Булево		 - Признак отказа от выполнения операции.
//  Заголовок					 - Строка		 - Содержит заголовок сообщения.
//
Процедура обПроверитьЗаполнениеРеквизитовТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти,
												СтруктураОбязательныхПолей, Отказ, Заголовок) Экспорт
												
	// ТЧ доп. реквизитов проверять не надо, у них своя проверка.
	Если ИмяТабличнойЧасти = "ДополнительныеРеквизиты" Тогда
		Возврат;	
	КонецЕсли; 	
	
	ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	ТабличнаяЧасть = ЭтотОбъект[ИмяТабличнойЧасти];
	МетаданныеРеквизиты = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;

	// Цикл по строкам табличной части.
	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		
		СтрокаНачалаСообщенияОбОшибке = НСтр("ru = 'В строке №%1 табличной части ""%2"": '");
		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СтрокаНачалаСообщенияОбОшибке, СокрЛП(СтрокаТаблицы.НомерСтроки), ПредставлениеТабличнойЧасти);

		// Цикл по проверяемым полям.
		Для Каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

			Значение = СтрокаТаблицы[КлючЗначение.Ключ];
			Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Значение) Тогда 
				
				Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(КлючЗначение.Значение) Тогда 
					ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();
					СтрокаСообщения = НСтр("ru = 'Необходимо заполнить значение реквизита ""%1""'");
					СтрокаСообщения = 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(ПредставлениеРеквизита));
				Иначе
					СтрокаСообщения = КлючЗначение.Значение;
				КонецЕсли;
				
				ПолеСообщения =  "Объект." + ИмяТабличнойЧасти + "[" + Формат(ТабличнаяЧасть.Индекс(СтрокаТаблицы), "ЧН=0; ЧГ=0") 
					+ "]." + КлючЗначение.Ключ;
				СтруктураСообщения = Новый Структура;
				СтруктураСообщения.Вставить("Поле", ПолеСообщения);
				обСообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, Отказ, Заголовок,,СтруктураСообщения);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных реквизитов шапки и табличных частей,
// если таковые есть и информирует пользователя о незаполненности реквизитов.
// Если хотя бы одно поле не заполнено, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  ЭтотОбъект   - ОбъектСсылка - ссылка на проверяемый объект.
//  Отказ        - Булево - Признак отказа от выполнения операции.
//  Заголовок    - Строка - Содержит заголовок сообщения.
// 
Процедура обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ, Заголовок = Неопределено) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Заголовок = Неопределено Тогда
		Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(ЭтотОбъект);
	КонецЕсли;

	// Проверить заполнение шапки объекта.
	СтруктураОбязательныхПолей = ЭтотОбъект.ПолучитьОбязательныеРеквизиты();
	обПроверитьЗаполнениеРеквизитовШапки(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проверить заполнение имеющихся табличных частей объекта.
	Для Каждого ТабличнаяЧасть Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
		СтруктураОбязательныхПолей = ЭтотОбъект.ПолучитьОбязательныеРеквизиты(ТабличнаяЧасть.Имя);
		обПроверитьЗаполнениеРеквизитовТабличнойЧасти(ЭтотОбъект, ТабличнаяЧасть.Имя,
													  СтруктураОбязательныхПолей, Отказ, Заголовок);
	КонецЦикла;
	
КонецПроцедуры

// Процедура проверяет заполнение обязательных полей формы регистра
//  и информирует пользователя о незаполненности полей.
//  Если хотя бы одно поле не заполнено, то выставляется флаг отказа от выполнения операции.
//
// Параметры:
//  МенеджерЗаписи	 - МенеджерЗаписи - менеджер записи регистра.
//  Отказ			 - Булево	 - Признак отказа от выполнения операции.
//
Процедура обПроверитьЗаполнениеПолейРегистра(МенеджерЗаписи, Отказ) Экспорт
	
	// Не надо проверять, если уже выставлен флаг отказа.
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;

	МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерЗаписи));
	РегистрСведенийМенеджер = РегистрыСведений[МетаданныеРегистра.Имя];
	НаборЗаписей = РегистрСведенийМенеджер.СоздатьНаборЗаписей();
	
	Заголовок = обСформироватьЗаголовокОшибкиПриЗаписи(НаборЗаписей.ЭтотОбъект);
	
	СтруктураОбязательныхПолей = НаборЗаписей.ПолучитьОбязательныеПоля();
	
	// Перебираем измерения.
	Для Каждого КлючЗначение Из СтруктураОбязательныхПолей.Измерения Цикл
		Значение = МенеджерЗаписи[КлючЗначение.Ключ];
		Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Значение) Тогда 
			Представление = МетаданныеРегистра.Измерения[КлючЗначение.Ключ].Представление();
			СтрокаСообщения = "Необходимо заполнить значение реквизита """ + СокрЛП(Представление) + """";
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	// Перебираем ресурсы.
	Для Каждого КлючЗначение Из СтруктураОбязательныхПолей.Ресурсы Цикл
		Значение = МенеджерЗаписи[КлючЗначение.Ключ];
		Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Значение) Тогда 
			Представление = МетаданныеРегистра.Ресурсы[КлючЗначение.Ключ].Представление();
			СтрокаСообщения = "Необходимо заполнить значение реквизита """ + СокрЛП(Представление) + """";
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	// Перебираем реквизиты.
	Для Каждого КлючЗначение Из СтруктураОбязательныхПолей.Реквизиты Цикл
		Значение = МенеджерЗаписи[КлючЗначение.Ключ];
		Если упоПроверкаЗаполненияВызовСервера.обЗначениеНеЗаполнено(Значение) Тогда 
			Представление = МетаданныеРегистра.Реквизиты[КлючЗначение.Ключ].Представление();
			СтрокаСообщения = "Необходимо заполнить значение реквизита """ + СокрЛП(Представление) + """";
			обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти