////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с оповещениями (повторого использования).
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает список доступных таблиц.
//
// Параметры:
//  НужныеТипы			 - Строка
//  НужныеТаблицы		 - Строка
//  ТаблицыИсключения	 - Строка
//  СокрПредставление	 - Булево
//  БезТабЧастей		 - Булево
// 
// Возвращаемое значение:
//  СписокЗначений
//
Функция ПолучитьСписокДоступныхТаблиц(НужныеТипы = "", НужныеТаблицы = "", ТаблицыИсключения = "", 
	СокрПредставление = Ложь, БезТабЧастей = Ложь) Экспорт
	
	Если ПустаяСтрока(НужныеТипы) Тогда
		масНужныеТипы = Неопределено;
	Иначе
		масНужныеТипы = упоОповещенияВызовСервера.РазложитьСтрокуВМассивПодстрок(НужныеТипы,",");
	КонецЕсли;
	
	Если ПустаяСтрока(НужныеТаблицы) Тогда
		масНужныеТаблицы = Неопределено;
	Иначе
		масНужныеТаблицы = упоОповещенияВызовСервера.РазложитьСтрокуВМассивПодстрок(НужныеТаблицы,",");
	КонецЕсли;
	
	Если ПустаяСтрока(ТаблицыИсключения) Тогда
		масТаблицыИсключения = Неопределено;
	Иначе
		масТаблицыИсключения = упоОповещенияВызовСервера.РазложитьСтрокуВМассивПодстрок(ТаблицыИсключения,",");
	КонецЕсли;
		
	Рез = Новый СписокЗначений;
	
	списОбщиеТипы = Новый СписокЗначений;
	списОбщиеТипы.Добавить("Справочники", НСтр("ru = 'Справочник'"));
	списОбщиеТипы.Добавить("Документы", НСтр("ru = 'Документ'"));
	списОбщиеТипы.Добавить("РегистрыСведений", НСтр("ru = 'Регистр сведений'"));
	списОбщиеТипы.Добавить("ПланыВидовХарактеристик", НСтр("ru = 'План видов характеристик'"));
	списОбщиеТипы.Добавить("Задачи", НСтр("ru = 'Задача'"));
	списОбщиеТипы.Добавить("БизнесПроцессы", НСтр("ru = 'Бизнес-процессы'"));
	
	МасУдалить = Новый Массив;
	Если масНужныеТипы <> Неопределено Тогда
		Для Каждого Эл Из списОбщиеТипы Цикл
			Если МасНужныеТипы.Найти(Эл.Значение) = Неопределено Тогда	
				МасУдалить.Добавить(Эл);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Эл Из МасУдалить Цикл
		списОбщиеТипы.Удалить(Эл);
	КонецЦикла;
	
	ПроверямыеВставкиИсключений = 
		упоФункцииОбщегоНазначенияСервер.ПроверяемыеВставкиСинонимовОбъектовМетаданныхДляИсключения();
	
	ШаблонПолный = "%1 %2.%3";
	ШаблонСокр = "%1.%2";
	
	Для Каждого ЭлТип Из списОбщиеТипы Цикл 
		
		ВремСписок = Новый СписокЗначений;
		Для Каждого ЭлМД Из Метаданные[ЭлТип.Значение] Цикл
			
			ПолноеИмя = ЭлМД.ПолноеИмя();
			
			Если Не ПравоДоступа("Чтение",ЭлМД) Тогда
				Продолжить; // Продолжить
			КонецЕсли;
			
			Если масТаблицыИсключения <> Неопределено Тогда
				Если масТаблицыИсключения.Найти(ПолноеИмя) <> Неопределено Тогда
					Продолжить; // Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если масНужныеТаблицы <> Неопределено Тогда
				Если масНужныеТаблицы.Найти(ПолноеИмя) = Неопределено Тогда
					Продолжить; // Продолжить
				КонецЕсли;
			КонецЕсли;
			
			ИспользованиеОбъекта = упоФункцииОбщегоНазначенияСервер.ИспользованиеОбъектаМетаданныхПоСинониму(ЭлМД.Синоним, 
				ПроверямыеВставкиИсключений);
			Если Не ИспользованиеОбъекта Тогда
				Продолжить; // Продолжить
			КонецЕсли;
			
			Если СокрПредставление Тогда
				ВремСписок.Добавить(ПолноеИмя, ЭлМД.Синоним);
			Иначе
				ВремСписок.Добавить(ПолноеИмя, ЭлТип.Представление + " " + ЭлМД.Синоним);
			КонецЕсли;
			
			Если (ЭлТип.Значение = "Справочники" Или ЭлТип.Значение = "Документы" 
				Или ЭлТип.Значение = "ПланыВидовХарактеристик") И Не БезТабЧастей Тогда
				
				Для Каждого ТабЧасть Из ЭлМД.ТабличныеЧасти Цикл
					
					ПолноеИмяТабЧасти = СтрШаблон(ШаблонСокр, ПолноеИмя, ТабЧасть.Имя);
					
					Если масТаблицыИсключения <> Неопределено Тогда
						Если масТаблицыИсключения.Найти(ПолноеИмяТабЧасти) <> Неопределено Тогда
							Продолжить; // Продолжить
						КонецЕсли;
					КонецЕсли;
					
					Если масНужныеТаблицы <> Неопределено Тогда
						Если масНужныеТаблицы.Найти(ПолноеИмяТабЧасти) = Неопределено Тогда
							Продолжить; // Продолжить
						КонецЕсли;
					КонецЕсли;
					
					Если СокрПредставление Тогда
						ПредставлениеЭлемента = СтрШаблон(ШаблонСокр, ЭлМД.Синоним, ТабЧасть.Синоним);
					Иначе
						ПредставлениеЭлемента = СтрШаблон(ШаблонПолный, ЭлТип.Представление, ЭлМД.Синоним, ТабЧасть.Синоним);
					КонецЕсли;
					ВремСписок.Добавить(ПолноеИмяТабЧасти, ПредставлениеЭлемента);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ВремСписок.СортироватьПоПредставлению();
		
		Для Каждого Эл Из ВремСписок Цикл
			Рез.Добавить(Эл.Значение,Эл.Представление);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

// Функция - Получить виды событий в доп свойства объекта.
//
// Параметры:
//  ПолноеИмя				 - Строка	 - Полное имя таблицы-источника.
//  СтруктВариантыИзменения	 - Структура - варианты изменения.
// 
// Возвращаемое значение:
//  Структура - * упоВидыСобытий - Соответствие.
//  *упоКодОпределенияДопПараметров - Соответствие.
//  *упоУсловияСобытий - Соответствие.
//  *НужныПредЗначения - Булево.
//
Функция ПолучитьВидыСобытийВДопСвойстваОбъекта(ПолноеИмя, СтруктВариантыИзменения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВидыСобытий = Новый Соответствие;
	УсловияСобытий = Новый Соответствие;
	КодДопПараметров = Новый Соответствие;
		
	НужныПредЗначения = Ложь;
	
	масВариантыИзменения = Новый Массив;
	Для Каждого КлючЗначения Из СтруктВариантыИзменения Цикл
		масВариантыИзменения.Добавить(КлючЗначения.Значение);		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытий.ЛогикаПримененияУсловийРегистрацииСобытия,
	               |	упоВидыСобытий.Ссылка КАК ВидСобытия,
	               |	упоВидыСобытий.ИспользоватьДляАнализаПредыдущиеЗначения,
	               |	упоВидыСобытий.КодОпределенияДопПараметра
	               |ПОМЕСТИТЬ ВтВидыСобытий
	               |ИЗ
	               |	Справочник.упоВидыСобытий КАК упоВидыСобытий
	               |ГДЕ
	               |	упоВидыСобытий.Используется
	               |	И НЕ упоВидыСобытий.ПометкаУдаления
	               |	И упоВидыСобытий.ВариантИзмененияОбъекта В(&масВариантыИзменения)
	               |	И упоВидыСобытий.Источник = &Источник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытийУсловияРегистрацииСобытия.РеквизитОбъекта,
	               |	упоВидыСобытийУсловияРегистрацииСобытия.ВидСравнения,
	               |	упоВидыСобытийУсловияРегистрацииСобытия.ЗначениеУсловия,
	               |	упоВидыСобытийУсловияРегистрацииСобытия.ПроверкаПоКоду,
	               |	упоВидыСобытийУсловияРегистрацииСобытия.ВыполняемыйКод,
	               |	упоВидыСобытийУсловияРегистрацииСобытия.Ссылка
	               |ПОМЕСТИТЬ ВтУсловия
	               |ИЗ
	               |	Справочник.упоВидыСобытий.УсловияРегистрацииСобытия КАК упоВидыСобытийУсловияРегистрацииСобытия
	               |ГДЕ
	               |	упоВидыСобытийУсловияРегистрацииСобытия.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ВидСобытия
	               |			ИЗ
	               |				ВтВидыСобытий КАК Т)
	               |	И упоВидыСобытийУсловияРегистрацииСобытия.Используется
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВтВидыСобытий.ЛогикаПримененияУсловийРегистрацииСобытия,
	               |	ВтВидыСобытий.ВидСобытия КАК ВидСобытия,
	               |	ВтУсловия.РеквизитОбъекта,
	               |	ВтУсловия.ВидСравнения,
	               |	ВтУсловия.ЗначениеУсловия,
	               |	ВтУсловия.ПроверкаПоКоду,
	               |	ВтУсловия.ВыполняемыйКод,
	               |	ВтВидыСобытий.ИспользоватьДляАнализаПредыдущиеЗначения,
	               |	ВтВидыСобытий.КодОпределенияДопПараметра
	               |ИЗ
	               |	ВтВидыСобытий КАК ВтВидыСобытий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВтУсловия КАК ВтУсловия
	               |		ПО ВтВидыСобытий.ВидСобытия = ВтУсловия.Ссылка
	               |ИТОГИ ПО
	               |	ВидСобытия";
				   
	Запрос.УстановитьПараметр("масВариантыИзменения", масВариантыИзменения);
	Запрос.УстановитьПараметр("Источник", ПолноеИмя);
	ВыборкаВиды = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВиды.Следующий() Цикл
				
		КодОпределенияДопПараметра = Неопределено;
		ЛогикаПримененияУсловийРегистрацииСобытия = Неопределено;		
		масУсловий = Новый Массив;
		ВыборкаУсловия = ВыборкаВиды.Выбрать();
		Пока ВыборкаУсловия.Следующий() Цикл
			НужныПредЗначения = НужныПредЗначения ИЛИ ВыборкаУсловия.ИспользоватьДляАнализаПредыдущиеЗначения;
			КодОпределенияДопПараметра = ВыборкаУсловия.КодОпределенияДопПараметра;
			Если ВыборкаУсловия.РеквизитОбъекта = Null Тогда
				Продолжить;
			КонецЕсли;
			масУсловий.Добавить(Новый Структура("РеквизитОбъекта,ВидСравнения,ЗначениеУсловия,ПроверкаПоКоду,ВыполняемыйКод",
								ВыборкаУсловия.РеквизитОбъекта,
								ВыборкаУсловия.ВидСравнения,
								ВыборкаУсловия.ЗначениеУсловия,
								ВыборкаУсловия.ПроверкаПоКоду,
								ВыборкаУсловия.ВыполняемыйКод));			
			ЛогикаПримененияУсловийРегистрацииСобытия = ВыборкаУсловия.ЛогикаПримененияУсловийРегистрацииСобытия;					
		КонецЦикла;
		
		ВидыСобытий.Вставить(ВыборкаВиды.ВидСобытия,Новый Структура("ЛогикаПримененияУсловий,ПолноеИмяОбъекта",
													ЛогикаПримененияУсловийРегистрацииСобытия,
													ПолноеИмя));
													
		Если ЗначениеЗаполнено(КодОпределенияДопПараметра) Тогда
			КодДопПараметров.Вставить(ВыборкаВиды.ВидСобытия, КодОпределенияДопПараметра);													
		КонецЕсли;

		УсловияСобытий.Вставить(ВыборкаВиды.ВидСобытия, масУсловий);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("упоВидыСобытий", ВидыСобытий);
	Результат.Вставить("упоКодОпределенияДопПараметров", КодДопПараметров);
	Результат.Вставить("упоУсловияСобытий", УсловияСобытий);
	Результат.Вставить("НужныПредЗначения", НужныПредЗначения);
	
	Возврат Результат;
	
КонецФункции

// Получает список реквизитов для оповещений.
//
// Параметры:
//  ИмяТаблицыИТабЧасти	 - Строка
// 
// Возвращаемое значение:
//  Массив
//
Функция ПолучитьСписокРеквизитовДляОповещений(ИмяТаблицыИТабЧасти) Экспорт
	
	Рез = Новый Массив;
	Ключи = "Имя,Представление,ИмяТаблицы";
	
	ИменаТаблиц = упоОповещенияВызовСервера.РазобратьИмяТаблицы(ИмяТаблицыИТабЧасти);
	
	ВидТаблицы = ИменаТаблиц.ВидТаблицы;
	ИмяТаблицы = ИменаТаблиц.ИмяТаблицы;
	ИмяТабЧасти = ИменаТаблиц.ИмяТабЧасти;
	ЭтоТабЧасть = ИменаТаблиц.ЭтоТабЧасть;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Рез;
	КонецЕсли;
	
	ВремСписок = Новый СписокЗначений;
	
	Если ВидТаблицы = "РегистрСведений" ИЛИ ВидТаблицы = "РегистрНакопления" ИЛИ ВидТаблицы = "РегистрБухгалтерии" ИЛИ ВидТаблицы = "РегистрРасчета" Тогда
		
		Для Каждого Рекв Из МетаданныеОбъекта.Измерения Цикл
			Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы(Рекв.Тип)));
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.Ресурсы Цикл
			Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы(Рекв.Тип)));
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
			Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы(Рекв.Тип)));
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы(Рекв.Тип)));
		КонецЦикла;
		
	ИначеЕсли ВидТаблицы = "Перечисление" Тогда
		
		
		Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы(Рекв.Тип)));
		КонецЦикла;
		
	Иначе
		
		Если ЭтоТабЧасть Тогда
			
			Для Каждого ТабЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
				
				Если ТабЧасть.Имя = ИмяТабЧасти Тогда
					
					ВремСписок = Новый СписокЗначений;
					Для Каждого Рекв Из ТабЧасть.Реквизиты Цикл
						
						Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы(Рекв.Тип)));
						
						//ВремСписок.Добавить(Рекв.Имя,Рекв.Синоним);
						
					КонецЦикла;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если ВидТаблицы = "Задача" И Рекв.Имя = "ТочкаМаршрута" Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяТаблицы = ИмяТаблицы(Рекв.Тип);
				Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы));
			КонецЦикла;
			
			Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
				Рез.Добавить(Новый Структура(Ключи, Рекв.Имя, ?(ПустаяСтрока(Рекв.Синоним), Рекв.Имя, Рекв.Синоним), ИмяТаблицы(Рекв.Тип)));
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Получает возможные доп. реквизиты и свойства.
//
// Параметры:
//  ИмяТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Массив, СписокЗначений - список свойств и доп.реквизитов.
//
Функция ПолучитьВозможныеДопРеквизитыИСвойства(ИмяТаблицы) Экспорт
	
	Результат = Новый Массив;
	
	ПараметрыТаблицы = упоОповещенияВызовСервера.РазобратьИмяТаблицы(ИмяТаблицы);
	
	ВидТаблицы = ПараметрыТаблицы.ВидТаблицы;
	ИмяТаблицы = ПараметрыТаблицы.ИмяТаблицы;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЭтоМетаданныеСсылочногоОбъекта(МетаданныеОбъекта) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИменаПредопределенных = УправлениеДоступомСлужебныйПовтИсп.ИменаПредопределенныхЭлементовСправочника(
			"НаборыДополнительныхРеквизитовИСведений");
	
	ИмяЭлемента = ВидТаблицы + "_" + МетаданныеОбъекта.Имя;
	ИмяЭлементаУдалить = "Удалить" + ВидТаблицы + "_" + МетаданныеОбъекта.Имя;
	Если ИменаПредопределенных.Найти(ИмяЭлемента) = Неопределено Тогда
		Если ИменаПредопределенных.Найти(ИмяЭлементаУдалить) = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Ссылка = УправлениеДоступомСлужебный.ПустаяСсылкаОбъектаМетаданных(МетаданныеОбъекта);
	
	Возврат УправлениеСвойствами.ПолучитьСписокСвойств(Ссылка, Истина, Истина);
	
КонецФункции

// Получает список вычисляемых реквизитов.
//
// Параметры:
//  ИмяТаблицы	 - Строка
// 
// Возвращаемое значение:
//  Массив
//
Функция ПолучитьСписокВычисляемыхРеквизитов(ИмяТаблицы) Экспорт
	
	Рез = Новый Массив;
	Ключи = "Имя,Представление,ИмяТаблицы";
	
	тзВсеРеквизиты = ПолучитьВсеВычисляемыеРеквизиты();
	РезПоиска = тзВсеРеквизиты.НайтиСтроки(Новый Структура("ИмяТаблицы",ИмяТаблицы));
	Для Каждого Эл Из РезПоиска Цикл
		Рез.Добавить(Новый Структура(Ключи,Эл.ИмяРеквизита,Эл.Представление,Ложь));	
	КонецЦикла;                       
	
	Возврат Рез;	
	
КонецФункции

// Получает тип вычисляемого реквизита.
//
// Параметры:
//  ИмяТаблицы	 - Строка
//  ИмяРеквизита - Строка
// 
// Возвращаемое значение:
//  Тип
//
Функция ПолучитьТипВычисляемогоРеквизита(ИмяТаблицы,ИмяРеквизита) Экспорт
	
	Рез = "";
	
	тзВсеРеквизиты = упоОповещенияВызовСервера.ПолучитьВсеВычисляемыеРеквизиты();
	РезПоиска = тзВсеРеквизиты.НайтиСтроки(Новый Структура("ИмяТаблицы,ИмяРеквизита",ИмяТаблицы,ИмяРеквизита));
	Для Каждого Эл Из РезПоиска Цикл
		Рез = Эл.ТипРеквизита;	
	КонецЦикла;                       
	
	Возврат Рез;
	
КонецФункции

// Получает выполняемый код вычисляемого реквизита.
//
// Параметры:
//  ИмяТаблицы	 - Строка
//  ИмяРеквизита - Строка
// 
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьВыполняемыйКодВычисляемогоРеквизита(ИмяТаблицы,ИмяРеквизита) Экспорт
	
	Рез = "";
	
	тзВсеРеквизиты = упоОповещенияВызовСервера.ПолучитьВсеВычисляемыеРеквизиты();
	РезПоиска = тзВсеРеквизиты.НайтиСтроки(Новый Структура("ИмяТаблицы,ИмяРеквизита",ИмяТаблицы,ИмяРеквизита));
	Для Каждого Эл Из РезПоиска Цикл
		Рез = Эл.ВыполняемыйКод;	
	КонецЦикла;                       
	
	Возврат Рез;
	
КонецФункции

// Получает все вычисляемые реквизиты.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьВсеВычисляемыеРеквизиты() Экспорт
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("ИмяТаблицы");
	тз.Колонки.Добавить("ИмяРеквизита");
	тз.Колонки.Добавить("ТипРеквизита");
	тз.Колонки.Добавить("ВыполняемыйКод");
	тз.Колонки.Добавить("Представление");
		
	Макет = Справочники.упоВидыСобытий.ПолучитьМакет("ВычисляемыеРеквизиты");
	
	НомСтр = 1;
	
	Пока 0 = 0 Цикл
		
		НомСтр = НомСтр + 1;
		
		ИмяТаблицы = СокрЛП(Макет.Область(НомСтр,1,НомСтр,1).Текст);
		
		Если ПустаяСтрока(ИмяТаблицы) Тогда
			Прервать;
		КонецЕсли;
		
		ИмяРеквизита = СокрЛП(Макет.Область(НомСтр,2,НомСтр,2).Текст);
		ТипРеквизита = СокрЛП(Макет.Область(НомСтр,3,НомСтр,3).Текст);
		ВыполняемыйКод = СокрЛП(Макет.Область(НомСтр,4,НомСтр,4).Текст);
		Представление = СокрЛП(Макет.Область(НомСтр,5,НомСтр,5).Текст);
		
		Если ПустаяСтрока(ИмяРеквизита) ИЛИ ПустаяСтрока(ВыполняемыйКод) Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = тз.Добавить();
		НовСтр.ИмяТаблицы = ИмяТаблицы;
		НовСтр.ИмяРеквизита = ИмяРеквизита;
		НовСтр.ТипРеквизита = ТипРеквизита;
		НовСтр.ВыполняемыйКод = ВыполняемыйКод;
		НовСтр.Представление = Представление;
		
	КонецЦикла;
	
	упоОповещенияПереопределяемый.СкорректироватьВычисляемыеРеквизиты(тз);

	Возврат тз;
	
КонецФункции

// Получает список возможных реквизитов для хранения адресов.
//
// Параметры:
//  ИмяТаблицыИТабЧасти	 - Строка
// 
// Возвращаемое значение:
//  СписокЗначений
//
Функция ПолучитьСписокВозможныхРеквизитовДляХраненияАдресов(ИмяТаблицыИТабЧасти) Экспорт
	
	Рез = Новый СписокЗначений;
	
	ИменаТаблиц = упоОповещенияВызовСервера.РазобратьИмяТаблицы(ИмяТаблицыИТабЧасти);
	
	ВидТаблицы = ИменаТаблиц.ВидТаблицы;
	ИмяТаблицы = ИменаТаблиц.ИмяТаблицы;
	ИмяТабЧасти = ИменаТаблиц.ИмяТабЧасти;
	ЭтоТабЧасть = ИменаТаблиц.ЭтоТабЧасть;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Рез;
	КонецЕсли;
	
	БезОграниченияТипа = Истина;
	ТипЧ = Тип("Число");
	ТипСтр = Тип("Строка");
	
	ВремСписок = Новый СписокЗначений;
	
	Если ВидТаблицы = "РегистрСведений" ИЛИ ВидТаблицы = "РегистрНакопления" ИЛИ ВидТаблицы = "РегистрБухгалтерии" ИЛИ ВидТаблицы = "РегистрРасчета" Тогда
		
		Для Каждого Рекв Из МетаданныеОбъекта.Измерения Цикл
			Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
				Рез.Добавить(Рекв.Имя,?(ПустаяСтрока(Рекв.Синоним),Рекв.Имя,Рекв.Синоним));	
			КонецЕсли;
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.Ресурсы Цикл
			Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
				Рез.Добавить(Рекв.Имя,?(ПустаяСтрока(Рекв.Синоним),Рекв.Имя,Рекв.Синоним));	
			КонецЕсли;
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
			Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
				Рез.Добавить(Рекв.Имя,?(ПустаяСтрока(Рекв.Синоним),Рекв.Имя,Рекв.Синоним));	
			КонецЕсли;
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
				Рез.Добавить(Рекв.Имя,?(ПустаяСтрока(Рекв.Синоним),Рекв.Имя,Рекв.Синоним));	
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ВидТаблицы = "Перечисление" Тогда
		
		Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
				Рез.Добавить(Рекв.Имя,?(ПустаяСтрока(Рекв.Синоним),Рекв.Имя,Рекв.Синоним));	
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Если ЭтоТабЧасть Тогда
			
			Для Каждого ТабЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
				
				Если ТабЧасть.Имя = ИмяТабЧасти Тогда
					
					ВремСписок = Новый СписокЗначений;
					Для Каждого Рекв Из ТабЧасть.Реквизиты Цикл
						
						Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
							ВремСписок.Добавить(Рекв.Имя,Рекв.Синоним);	                          	
						КонецЕсли;
						
					КонецЦикла;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
					Рез.Добавить(Рекв.Имя,?(ПустаяСтрока(Рекв.Синоним),Рекв.Имя,Рекв.Синоним));	
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
				Если БезОграниченияТипа ИЛИ Рекв.Тип.СодержитТип(ТипЧ) ИЛИ Рекв.Тип.СодержитТип(ТипСтр) Тогда
					ВремСписок.Добавить(Рекв.Имя,Рекв.Синоним);	                          	
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВремСписок.СортироватьПоПредставлению();
	Для Каждого Эл Из ВремСписок Цикл
		Рез.Добавить(Эл.Значение,Эл.Представление);			
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

// Получает представление таблицы.
//
// Параметры:
//  ИмяТаблицыИТабЧасти	 - Строка
// 
// Возвращаемое значение:
//  Строка
//
Функция ПолучитьПредставлениеТаблицы(ИмяТаблицыИТабЧасти) Экспорт
	
	ИменаТаблиц = упоОповещенияВызовСервера.РазобратьИмяТаблицы(ИмяТаблицыИТабЧасти);
	
	ВидТаблицы = ИменаТаблиц.ВидТаблицы;
	ИмяТаблицы = ИменаТаблиц.ИмяТаблицы;
	ИмяТабЧасти = ИменаТаблиц.ИмяТабЧасти;
	ЭтоТабЧасть = ИменаТаблиц.ЭтоТабЧасть;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат ИмяТаблицыИТабЧасти;
	КонецЕсли;
	
	ПредставлениеТаблицы = МетаданныеОбъекта.Синоним;
	ПредставлениеТабЧасти = "";
	
	Если ЭтоТабЧасть Тогда
		
		Для Каждого ТабЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			
			Если ТабЧасть.Имя = ИмяТабЧасти Тогда
				ПредставлениеТабЧасти = ТабЧасть.Синоним;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПолноеПредставление = ВидТаблицы + "." + ПредставлениеТаблицы + ?(ЭтоТабЧасть,"."+ПредставлениеТабЧасти,"");
		
	Возврат ПолноеПредставление;
	
КонецФункции

// Получает список доступных констант для шаблона сообщения.
// 
// Возвращаемое значение:
//  СписокЗначений
//
Функция ПолучитьСписокДоступныхКонстантДляШаблонаСообщения() Экспорт
	
	Рез = Новый СписокЗначений;
	
	Для Каждого ЭлМД Из Метаданные.Константы Цикл
		Если Не ПравоДоступа("Чтение",ЭлМД) Тогда
			Продолжить;
		КонецЕсли;
		Рез.Добавить(ЭлМД.Имя,ЭлМД.Синоним);
	КонецЦикла;
	
	Рез.СортироватьПоПредставлению();
	
	Возврат Рез;
	
КонецФункции

// Получает список доступных видов сравнений для реквизита.
//
// Параметры:
//  ПолноеИмяРеквизита	 - Строка
//  Источник			 - Строка
// 
// Возвращаемое значение:
//  СписокЗначений
//
Функция ПолучитьСписокДоступныхВидовСравненийДляРеквизита(Знач ПолноеИмяРеквизита, Источник = "") Экспорт
	
	МассивВидовСравнений = Новый Массив;
		
	ОписаниеТиповРеквизитов = ПолучитьОписаниеТипаРеквизитаИсточника(ПолноеИмяРеквизита, Источник);
	Если ОписаниеТиповРеквизитов = Неопределено ИЛИ ОписаниеТиповРеквизитов.Типы().Количество() = 0 Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Неопределено);
	Иначе
		МассивТипов = ОписаниеТиповРеквизитов.Типы();
	КонецЕсли;
	
	Для Каждого ТипРеквизита Из МассивТипов Цикл
		
		Если ТипРеквизита = Неопределено ИЛИ ТипРеквизита = Тип("Булево") Тогда 
			
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Равно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеРавно);
			
		ИначеЕсли ТипРеквизита = Тип("Число") Тогда
			
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Равно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеРавно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Больше);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.БольшеИлиРавно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Меньше);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.МеньшеИлиРавно);
			
		ИначеЕсли ТипРеквизита = Тип("Дата") Тогда
			
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Равно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеРавно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Больше);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.БольшеИлиРавно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Меньше);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.МеньшеИлиРавно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Интервал);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.ИнтервалВключаяГраницы);
			
		ИначеЕсли ТипРеквизита = Тип("Строка") Тогда
			
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Равно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеРавно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Содержит);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеСодержит);
			
		Иначе
			
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.Равно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеРавно);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.ВСписке);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеВСписке);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.ВИерархии);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеВИерархии);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.ВСпискеПоИерархии);
			МассивВидовСравнений.Добавить(Перечисления.упоВидыСравнения.НеВСпискеПоИерархии);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МассивВидовСравнений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВидовСравнений);
	СписокВидовСравнений = Новый СписокЗначений;
	СписокВидовСравнений.ЗагрузитьЗначения(МассивВидовСравнений);
	
	Возврат СписокВидовСравнений;
	
КонецФункции

// Возвращает имя таблицы.
//
// Параметры:
//  ОписаниеТипа - ОписаниеТипа
// 
// Возвращаемое значение:
//  Строка - имя таблицы.
//
Функция ИмяТаблицы(Знач ОписаниеТипа) Экспорт
	
	Если ОписаниеТипа = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Рез = "";;
	
	Если ОписаниеТипа.СодержитТип(Тип("Булево")) Тогда
		Рез = "";
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Число")) Тогда
		Рез = "";
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Дата")) Тогда
		Рез = "";
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("Строка")) Тогда
		Рез = "";
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("УникальныйИдентификатор")) Тогда
		Рез = "";
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("ХранилищеЗначения")) Тогда
		Рез = "";
	ИначеЕсли ОписаниеТипа.СодержитТип(Тип("ОписаниеТипов")) Тогда
		Рез = "";	

	Иначе
		Тип = ОписаниеТипа.Типы()[0];
		Ссылка = Новый(Тип); 
		МД = Ссылка.Метаданные();
		Рез = МД.ПолноеИмя();
	КонецЕсли;	
		
	Возврат Рез;
	
КонецФункции

// Возвращает список таблиц, в которых может хранится контактная информация.
//
// Параметры:
//  ИмяТаблицы	 - Строка	 - Полное имя ведущей таблицы, например Справочник.Контрагенты.
// 
// Возвращаемое значение:
//  Массив - структуры.
//
Функция ПолучитьСвязанныеТаблицы(ИмяТаблицы) Экспорт
	
	Рез = Новый Массив;
	
	Поз = Найти(ИмяТаблицы,".");
	Если Поз > 0 Тогда
		Вид = Лев(ИмяТаблицы,Поз-1);
	    Имя = Сред(ИмяТаблицы,Поз+1);
	Иначе
		Возврат Рез;
	КонецЕсли;
	
	Если Вид = "РегистрСведений" ИЛИ Вид = "РегистрНакопления" ИЛИ Вид = "РегистрБухгалтерии" ИЛИ Вид = "РегистрРасчета" Тогда
		Возврат Рез;
	КонецЕсли;
	
	ТипТаблицы = Тип(Вид + "Ссылка."+Имя); 
	МДтаб = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	МассивОбъектныхМетаданных = Новый Массив;
	МассивОбъектныхМетаданных.Добавить(Метаданные.Справочники);
	МассивОбъектныхМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	МассивОбъектныхМетаданных.Добавить(Метаданные.Документы);
	
	Для Каждого тМетаданные Из МассивОбъектныхМетаданных Цикл
		Для Каждого Эл Из тМетаданные Цикл
			//Для Каждого Эл Из Метаданные.Справочники Цикл
			
			ВремМас = Новый Массив;
			ЕстьПолеСвязи = Ложь;
			
			Для Каждого Рекв Из Эл.СтандартныеРеквизиты Цикл
				
				ЭтоПолеСвязи = Ложь;
				
				Если Эл = МДтаб И Рекв.Имя = "Ссылка" Тогда
					Продолжить;			
				ИначеЕсли Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;
			
			Для Каждого Рекв Из Эл.Реквизиты Цикл
				
				ЭтоПолеСвязи = Ложь;
				Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;
			
			Если ЕстьПолеСвязи Тогда
				Для Каждого ВремЭл Из ВремМас Цикл
					Рез.Добавить(ВремЭл);	
				КонецЦикла;
			КонецЕсли;
			
			Для Каждого ТабЧасть Из Эл.ТабличныеЧасти Цикл
				
				ВремМас = Новый Массив;
				ЕстьПолеСвязи = Ложь;
				
				Если Эл = МДтаб Тогда
					ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя()+"."+ТабЧасть.Имя,"Ссылка","Ссылка",Истина));
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				
				Для Каждого Рекв Из ТабЧасть.Реквизиты Цикл
					
					ЭтоПолеСвязи = Ложь;
					Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
						ЭтоПолеСвязи = Истина;
						ЕстьПолеСвязи = Истина;
					КонецЕсли;
					
					ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя()+"."+ТабЧасть.Имя,Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
					
				КонецЦикла;
				
				Если ЕстьПолеСвязи Тогда
					Для Каждого ВремЭл Из ВремМас Цикл
						Рез.Добавить(ВремЭл);	
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	МассивВидовРегистров = Новый Массив;
	МассивВидовРегистров.Добавить(Метаданные.РегистрыСведений);
	МассивВидовРегистров.Добавить(Метаданные.РегистрыНакопления);
	МассивВидовРегистров.Добавить(Метаданные.РегистрыБухгалтерии);
	МассивВидовРегистров.Добавить(Метаданные.РегистрыРасчета);
	
	Для Каждого ВидРегистра Из МассивВидовРегистров Цикл
		Для Каждого Эл Из ВидРегистра Цикл
			
			ВремМас = Новый Массив;
			ЕстьПолеСвязи = Ложь;
			
			Для Каждого Рекв Из Эл.Измерения Цикл
				
				ЭтоПолеСвязи = Ложь;
				Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;
			
			Для Каждого Рекв Из Эл.Ресурсы Цикл
				
				ЭтоПолеСвязи = Ложь;
				Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;
			
			Для Каждого Рекв Из Эл.Реквизиты Цикл
				
				ЭтоПолеСвязи = Ложь;
				Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;
			
			Для Каждого Рекв Из Эл.СтандартныеРеквизиты Цикл
				
				ЭтоПолеСвязи = Ложь;
				Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;		
			
			Если ЕстьПолеСвязи Тогда
				Для Каждого ВремЭл Из ВремМас Цикл
					Рез.Добавить(ВремЭл);	
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

// См. ПолучитьСвязанныеТаблицы
//
Функция ПолучитьТаблицыКонтИнфо(ИмяТаблицы) Экспорт
	
	Возврат ПолучитьСвязанныеТаблицы(ИмяТаблицы);
	
КонецФункции

// Возвращает список таблиц, в которых могут хранится контактные лица.
//
// Параметры:
//  ИмяТаблицы	 - Строка	 - Полное имя ведущей таблицы, например "Справочник.Контрагенты".
// 
// Возвращаемое значение:
//  Массив Из Структура
//
Функция ПолучитьТаблицыКонтЛицо(ИмяТаблицы) Экспорт
	
	Рез = Новый Массив;
	
	Поз = Найти(ИмяТаблицы,".");
	Если Поз > 0 Тогда
		Вид = Лев(ИмяТаблицы,Поз - 1);
		Имя = Сред(ИмяТаблицы,Поз + 1);
	Иначе
		Возврат Рез;
	КонецЕсли;
	
	ТипТаблицы = Тип(Вид + "Ссылка." + Имя); 
	МДтаб = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);
	
	//Для Каждого Эл Из Метаданные.Справочники Цикл
	
	МассивОбъектныхМетаданных = Новый Массив;
	МассивОбъектныхМетаданных.Добавить(Метаданные.Справочники);
	МассивОбъектныхМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	МассивОбъектныхМетаданных.Добавить(Метаданные.Документы);
	
	Для Каждого тМетаданные Из МассивОбъектныхМетаданных Цикл
		
		Для Каждого Эл Из тМетаданные Цикл
			
			ВремМас = Новый Массив;
			ЕстьПолеСвязи = Ложь;
			
			Для Каждого Рекв Из Эл.СтандартныеРеквизиты Цикл
				
				ЭтоПолеСвязи = Ложь;
				
				Если Эл = МДтаб И Рекв.Имя = "Ссылка" Тогда
					Продолжить;
				ИначеЕсли Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",
					Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;
			
			Для Каждого Рекв Из Эл.Реквизиты Цикл
				
				ЭтоПолеСвязи = Ложь;
				Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
					ЭтоПолеСвязи = Истина;
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",
					Эл.ПолноеИмя(),Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
				
			КонецЦикла;
			
			Если ЕстьПолеСвязи Тогда
				Для Каждого ВремЭл Из ВремМас Цикл
					Рез.Добавить(ВремЭл);
				КонецЦикла;
			КонецЕсли;
			
			Для Каждого ТабЧасть Из Эл.ТабличныеЧасти Цикл
				
				ВремМас = Новый Массив;
				ЕстьПолеСвязи = Ложь;
				
				Если Эл = МДтаб Тогда
					ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",
						Эл.ПолноеИмя()+"."+ТабЧасть.Имя,"Ссылка","Ссылка",Истина));
					ЕстьПолеСвязи = Истина;
				КонецЕсли;
				
				Для Каждого Рекв Из ТабЧасть.Реквизиты Цикл
					
					ЭтоПолеСвязи = Ложь;
					Если Рекв.Тип.СодержитТип(ТипТаблицы) Тогда
						ЭтоПолеСвязи = Истина;
						ЕстьПолеСвязи = Истина;
					КонецЕсли;
					ВремМас.Добавить(Новый Структура("ИмяТаблицы,ИмяРеквизита,ИмяРеквизитаПредставление,ЭтоПолеСвязи",
						Эл.ПолноеИмя()+"."+ТабЧасть.Имя,Рекв.Имя,Рекв.Синоним,ЭтоПолеСвязи));
					
				КонецЦикла;
				
				Если ЕстьПолеСвязи Тогда
					Для Каждого ВремЭл Из ВремМас Цикл
						Рез.Добавить(ВремЭл);
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

// Определяет тип таблицы.
//
// Параметры:
//  ИмяТаблицыИТабЧасти	 - Строка
// 
// Возвращаемое значение:
//  Строка
//
Функция ОпределитьТипТаблицы(ИмяТаблицыИТабЧасти) Экспорт
	
	ИменаТаблиц = упоОповещенияВызовСервера.РазобратьИмяТаблицы(ИмяТаблицыИТабЧасти,Истина);
	
	ВидТаблицы = ИменаТаблиц.ВидТаблицы;
	ИмяТаблицы = ИменаТаблиц.ИмяТаблицы;
	ИмяТабЧасти = ИменаТаблиц.ИмяТабЧасти;
	ЭтоТабЧасть = ИменаТаблиц.ЭтоТабЧасть;
	
	Попытка
		Рез = Тип(ВидТаблицы+"Ссылка."+ИмяТаблицы);
	Исключение
		Рез = Неопределено;
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции

// Получает описание типа реквизита.
//
// Параметры:
//  ПолноеИмя	 - Строка
//  ИмяРеквизита - Строка
// 
// Возвращаемое значение:
//  Тип, Неопределено
//
Функция ПолучитьОписаниеТипаРеквизита(ПолноеИмя, ИмяРеквизита = "") Экспорт
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		ИменаТаблиц = упоОповещенияВызовСервера.РазобратьИмяРеквизита(ПолноеИмя);
		ИмяРеквизита = ИменаТаблиц.ИмяРеквизита;
	Иначе
		ИменаТаблиц = упоОповещенияВызовСервера.РазобратьИмяТаблицы(ПолноеИмя,Истина);
	КонецЕсли;
	
	ВидТаблицы = ИменаТаблиц.ВидТаблицы;
	ИмяТаблицы = ИменаТаблиц.ИмяТаблицы;
	ИмяТабЧасти = ИменаТаблиц.ИмяТабЧасти;
	ЭтоТабЧасть = ИменаТаблиц.ЭтоТабЧасть;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ВидТаблицы+"."+ИмяТаблицы);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВидТаблицы = "РегистрСведений" ИЛИ ВидТаблицы = "РегистрНакопления" ИЛИ ВидТаблицы = "РегистрБухгалтерии" ИЛИ ВидТаблицы = "РегистрРасчета"  Тогда
		
		Для Каждого Рекв Из МетаданныеОбъекта.Измерения Цикл
			Если Рекв.Имя = ИмяРеквизита Тогда
				Возврат Рекв.Тип;	
			КонецЕсли;
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.Ресурсы Цикл
			Если Рекв.Имя = ИмяРеквизита Тогда
				Возврат Рекв.Тип;	
			КонецЕсли;	
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
			Если Рекв.Имя = ИмяРеквизита Тогда
				Возврат Рекв.Тип;	
			КонецЕсли;	
		КонецЦикла;
		Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			Если Рекв.Имя = ИмяРеквизита Тогда
				Возврат Рекв.Тип;	
			КонецЕсли;	
		КонецЦикла;		
		
	Иначе
		
		Если ЭтоТабЧасть Тогда
			
			Для Каждого ТабЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
				
				Если ТабЧасть.Имя = ИмяТабЧасти Тогда
					
					Для Каждого Рекв Из ТабЧасть.Реквизиты Цикл
						
						Если Рекв.Имя = ИмяРеквизита Тогда
							Возврат Рекв.Тип;
						КонецЕсли;
						
					КонецЦикла;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если Рекв.Имя = ИмяРеквизита Тогда
					Возврат Рекв.Тип;	
				КонецЕсли;	
			КонецЦикла;
			
			Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
				Если Рекв.Имя = ИмяРеквизита Тогда
					Возврат Рекв.Тип;	
				КонецЕсли;	                          	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает описание типа реквизита источника.
//
// Параметры:
//  ПолноеИмяРеквизита	 - Строка
//  Источник			 - Строка
// 
// Возвращаемое значение:
//  Тип, Неопределено
//
Функция ПолучитьОписаниеТипаРеквизитаИсточника(Знач ПолноеИмяРеквизита,Источник = "") Экспорт
	
	МасРекв = Новый Массив;
	
	Остаток = ПолноеИмяРеквизита;
	Поз = Найти(ПолноеИмяРеквизита,".");
	Пока Поз > 0 Цикл
		
		Подстрока = Лев(Остаток,Поз-1);
		Остаток = Сред(Остаток,Поз+1);
		МасРекв.Добавить(Подстрока);
		Поз = Найти(Остаток,".");
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(Остаток) Тогда
		МасРекв.Добавить(Остаток);
	КонецЕсли;
	
	Если МасРекв.Количество() < 2 Тогда
		// в первых двух элементах должны быть вид таблицы и имя таблицы
		Возврат Неопределено;
	КонецЕсли;
	
	ВидТаб = МасРекв[0];
	СокрИмяТаб = МасРекв[1];
	ИмяТаб = ВидТаб+"." + СокрИмяТаб;
	МасРекв.Удалить(0);
	МасРекв.Удалить(0);
	
	масРеквИТаб = Новый Массив;
	Если Найти(ИмяТаб,"РегистрСведений") > 0 ИЛИ Найти(ИмяТаб,"РегистрНакопления") > 0 ИЛИ Найти(ИмяТаб,"РегистрБухгалтерии") > 0 ИЛИ Найти(ИмяТаб,"РегистрРасчета") > 0 Тогда	
		ИмяРеквизита = "";
		ТипРеквизита = Неопределено;
	ИначеЕсли ВидТаб = "ДополнительныйРеквизит" ИЛИ ВидТаб = "ДополнительноеСведение" Тогда	
		Ссылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрИмяТаб));
		ИмяРеквизита = "";
		//ТипРеквизита = Ссылка.ТипЗначения.Типы()[0];
		ТипРеквизита = Ссылка.ТипЗначения;
	ИначеЕсли ВидТаб="Вычисляемый" Тогда
		ИмяРеквизита = "";
		ТипРеквизитаСтрока = ПолучитьТипВычисляемогоРеквизита(Источник,СокрИмяТаб);
		Попытка
			//ТипРеквизита = Тип(ТипРеквизитаСтрока);
			ТипРеквизита = Новый ОписаниеТипов(ТипРеквизитаСтрока);
		Исключение
			ТипРеквизита = Неопределено;	
		КонецПопытки;
	Иначе
		ИмяРеквизита = "Ссылка";
		ТипТаблицы = ОпределитьТипТаблицы(ИмяТаб);
		Попытка 
			ТипРеквизита = Новый ОписаниеТипов(ИмяТаб);
		Исключение 
			ТипРеквизита = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	масРеквИТаб.Добавить(Новый Структура("ИмяРеквизита,ИмяТаблицы,ТипРеквизита",ИмяРеквизита,ИмяТаб,ТипРеквизита));
	
	ПредИмяТаб = "";
	ЭтоТабЧасть = Ложь;
	Для Каждого ИмяРеквизита Из МасРекв Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяТаб);
		ТекОписаниеТипа = Неопределено;
		
		Нашли = Ложь;
		Если Найти(ИмяТаб,"РегистрСведений") > 0 ИЛИ Найти(ИмяТаб,"РегистрНакопления") > 0 ИЛИ Найти(ИмяТаб,"РегистрБухгалтерии") > 0 ИЛИ Найти(ИмяТаб,"РегистрРасчета") > 0 Тогда
			
			Для Каждого Рекв Из МетаданныеОбъекта.Измерения Цикл
				Если Рекв.Имя = ИмяРеквизита Тогда
					ТекОписаниеТипа = Рекв.Тип;	
					Нашли = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Нашли Тогда
				Для Каждого Рекв Из МетаданныеОбъекта.Ресурсы Цикл
					Если Рекв.Имя = ИмяРеквизита Тогда
						ТекОписаниеТипа = Рекв.Тип;
						Нашли = Истина;
						Прервать;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
			Если НЕ Нашли Тогда
				Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
					Если Рекв.Имя = ИмяРеквизита Тогда
						ТекОписаниеТипа = Рекв.Тип;
						Нашли = Истина;
						Прервать;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
			Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если Рекв.Имя = ИмяРеквизита Тогда
					ТекОписаниеТипа = Рекв.Тип;
					Нашли = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
		ИначеЕсли Найти(ИмяТаб,"Перечисление") > 0 Тогда
			
			Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если Рекв.Имя = ИмяРеквизита Тогда
					ТекОписаниеТипа = Рекв.Тип;
					Нашли = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
		Иначе
			
			Для Каждого Рекв Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				Если Рекв.Имя = ИмяРеквизита Тогда
					ТекОписаниеТипа = Рекв.Тип;
					Нашли = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
			Если НЕ Нашли Тогда
				Для Каждого Рекв Из МетаданныеОбъекта.Реквизиты Цикл
					Если Рекв.Имя = ИмяРеквизита Тогда
						ТекОписаниеТипа = Рекв.Тип;
						Нашли = Истина;
						Прервать;
					КонецЕсли;	                          	
				КонецЦикла;
			КонецЕсли;
			
			Если НЕ Нашли Тогда
				
				Для Каждого ТабЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
					
					Если ТабЧасть.Имя = ИмяРеквизита Тогда
						
						ЭтоТабЧасть = Истина;
						Нашли = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоТабЧасть Тогда
			ИмяТаб = ПредИмяТаб + "." + ИмяРеквизита;	
		Иначе
			ИмяТаб = ИмяТаблицы(ТекОписаниеТипа);
			ПредИмяТаб = ИмяТаб;
		КонецЕсли;
		
		Если ТекОписаниеТипа.Типы().Количество() > 0 Тогда
			//ТипРеквизита = ТекОписаниеТипа.Типы()[0];
			ТипРеквизита = ТекОписаниеТипа;
		Иначе
			ТипРеквизита = Неопределено;	
		КонецЕсли;
		
		масРеквИТаб.Добавить(Новый Структура("ИмяРеквизита,ИмяТаблицы,ТипРеквизита",ИмяРеквизита,ИмяТаб,ТипРеквизита));
		
	КонецЦикла;
	
	Если масРеквИТаб.Количество() > 0 Тогда
		Рез = масРеквИТаб[масРеквИТаб.Количество()-1].ТипРеквизита;
	Иначе
		Рез = Неопределено;
	КонецЕсли;
		
	Возврат Рез;
	
КонецФункции

// Получает текст вида сравнения.
//
// Параметры:
//  ВидСравнения - Перечисления.упоВидыСравнения
// 
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьТекстВидаСравнения(ВидСравнения) Экспорт
	
	Рез = Новый Структура;
	
	ВидСравненияНач = "=";
	ВидСравненияКон = "";
	ВидСравненияНач2 = "";
	ВидСравненияКон2 = "";
	ЭтоОтрицание = Ложь;
	ДваЗначения = Ложь;
	
	Если ВидСравнения = Перечисления.упоВидыСравнения.Равно Тогда
		ВидСравненияНач = "=";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.НеРавно Тогда
		ЭтоОтрицание = Истина;
		ВидСравненияНач = "=";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.Больше Тогда
		ВидСравненияНач = ">";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.БольшеИлиРавно Тогда
		ВидСравненияНач = ">=";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.Меньше Тогда
		ВидСравненияНач = "<";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.МеньшеИлиРавно Тогда
		ВидСравненияНач = "<=";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.Интервал Тогда
		ВидСравненияНач = ">";
		ВидСравненияНач2 = "<";
		ДваЗначения = Истина;
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.ИнтервалВключаяГраницы Тогда
		ВидСравненияНач = " Между ";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.Содержит Тогда
		ВидСравненияНач = " Подобно ";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.НеСодержит Тогда
		ЭтоОтрицание = Истина;
		ВидСравненияНач = " Подобно "
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.ВСписке Тогда
		ВидСравненияНач = " В (";
		ВидСравненияКон = ")";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.НеВСписке Тогда
		ЭтоОтрицание = Истина;
		ВидСравненияНач = " В (";
		ВидСравненияКон = ")";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.ВИерархии Тогда
		ВидСравненияНач = " В Иерархии (";
		ВидСравненияКон = ")";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.НеВИерархии Тогда
		ЭтоОтрицание = Истина;
		ВидСравненияНач = " В Иерархии (";
		ВидСравненияКон = ")";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.ВСпискеПоИерархии Тогда
		ВидСравненияНач = " В Иерархии (";
		ВидСравненияКон = ")";
	ИначеЕсли ВидСравнения = Перечисления.упоВидыСравнения.НеВСпискеПоИерархии Тогда
		ЭтоОтрицание = Истина;
		ВидСравненияНач = " В Иерархии (";
		ВидСравненияКон = ")";
	КонецЕсли;
	
	Рез.Вставить("ВидСравненияНач",ВидСравненияНач);
	Рез.Вставить("ВидСравненияКон",ВидСравненияКон);
	Рез.Вставить("ВидСравненияНач2",ВидСравненияНач2);
	Рез.Вставить("ВидСравненияКон2",ВидСравненияКон2);
	Рез.Вставить("ЭтоОтрицание",ЭтоОтрицание);
	Рез.Вставить("ДваЗначения",ДваЗначения);
	
	Возврат Рез;
	
КонецФункции

// Получает настройку использования событий.
// 
// Возвращаемое значение:
//  Булево - настройка использования событий.
//
Функция ПолучитьИспользоватьСобытия() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.упоИспользоватьОповещения.Получить();
	
КонецФункции

// Возвращает признак того, используются оповещения или нет.
// 
// Возвращаемое значение:
//  Булево
//
Функция ИспользоватьОповещения() Экспорт
	
	Возврат ПолучитьИспользоватьСобытия();
	
КонецФункции 

// Получает настройки транспорта.
//
// Параметры:
//  Транспорт	 - СправочникСсылка.упоТранспортОповещений
// 
// Возвращаемое значение:
//  Структура - настройки транспорта.
//
Функция ПолучитьНастройкиТранспорта(Транспорт) Экспорт
	
	Рез = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упоТранспортОповещений.ДоступнаТемаСообщения,
	|	упоТранспортОповещений.ДоступенТекстСообщенияВHTML,
	|	упоТранспортОповещений.ДоступнаНастройкаДляВидаСобытия,
	|	упоТранспортОповещений.ИмяМодуляОтправкиСообщений,
	|	упоТранспортОповещений.Параметры
	|ИЗ
	|	Справочник.упоТранспортОповещений КАК упоТранспортОповещений
	|ГДЕ
	|	упоТранспортОповещений.Ссылка = &Транспорт";
	Запрос.УстановитьПараметр("Транспорт",Транспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Рез.Вставить("ДоступнаТемаСообщения",Выборка.ДоступнаТемаСообщения);
		Рез.Вставить("ДоступенТекстСообщенияВHTML",Выборка.ДоступенТекстСообщенияВHTML);
		Рез.Вставить("ДоступнаНастройкаДляВидаСобытия",Выборка.ДоступнаНастройкаДляВидаСобытия);
		Рез.Вставить("ИмяМодуляОтправкиСообщений",Выборка.ИмяМодуляОтправкиСообщений);
		Рез.Вставить("ПараметрыТранспорта", Выборка.Параметры.Получить());
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

// Получает настройки транспорта для вида события.
//
// Параметры:
//  ВидСобытия	 - СправочникСсылка.упоВидыСобытий	 - вид события.
// 
// Возвращаемое значение:
//  Соответствие - настройки.
//
Функция ПолучитьНастройкиТранспортовДляВидаСобытия(ВидСобытия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоВидыСобытийТранспортОповещений.Транспорт КАК Транспорт,
	               |	упоВидыСобытийТранспортОповещений.НастройкаХЗ КАК НастройкаХЗ
	               |ИЗ
	               |	Справочник.упоВидыСобытий.ТранспортОповещений КАК упоВидыСобытийТранспортОповещений
	               |ГДЕ
	               |	упоВидыСобытийТранспортОповещений.Транспорт.ДоступнаНастройкаДляВидаСобытия
	               |	И упоВидыСобытийТранспортОповещений.Ссылка = &ВидСобытия";
	
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Транспорт, Выборка.НастройкаХЗ.Получить());			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - Получить дополнительные параметры выполнения кода для вида события.
//
// Параметры:
//  ВидСобытия	 - Вид события	 - СправочникСсылка.упоВидыСобытий.
// 
// Возвращаемое значение:
//  Структура - Дополнительные параметры выполнения кода.
//
Функция ПолучитьПараметрыВыполненияКода(ВидСобытия) Экспорт
	Результат = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВидыСобытийПараметрыВыполняемогоКода.ИмяПараметра,
	               |	упоВидыСобытийПараметрыВыполняемогоКода.Значение
	               |ИЗ
	               |	Справочник.упоВидыСобытий.ПараметрыВыполняемогоКода КАК упоВидыСобытийПараметрыВыполняемогоКода
	               |ГДЕ
	               |	упоВидыСобытийПараметрыВыполняемогоКода.Ссылка = &ВидСобытия";
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИмяПараметра, Выборка.Значение);
	КонецЦикла;
	Возврат Результат;
КонецФункции 

// Получает виды событий для подписки.
//
// Параметры:
//  ТаблицаПолучателя	 - Строка - Имя
//  ПодписчикСсылка		 - ЛюбаяСсылка
// 
// Возвращаемое значение:
//  ТаблицаЗначений - виды событий.
//
Функция ПолучитьВидыСобытийДляПодписки(ТаблицаПолучателя, ПодписчикСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустоеОграничениеДоступа", Справочники.упоОграниченияДоступаКОповещениям.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПодписчикСсылка", ПодписчикСсылка);
	Запрос.УстановитьПараметр("ТаблицаПолучателя", ТаблицаПолучателя);
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоВидыСобытийПолучатели.Ссылка КАК ВидСобытия,
	               |	упоВидыСобытийПолучатели.ВидПолучателя,
	               |	упоВидыСобытийПолучатели.Получатель,
	               |	упоВидыСобытийПолучатели.ОграничениеДоступа,
	               |	упоВидыСобытийПолучатели.Ссылка.Принудительное КАК Принудительное,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(упоОграниченияДоступаКОповещениямСостав.Элемент, НЕОПРЕДЕЛЕНО) = &ПодписчикСсылка
	               |				ИЛИ ЕСТЬNULL(упоОграниченияДоступаКОповещениямСостав.Элемент, НЕОПРЕДЕЛЕНО) В
	               |					(ВЫБРАТЬ
	               |						ГруппыДоступа.ГруппаДоступа
	               |					ИЗ
	               |						врГруппыДоступа КАК ГруппыДоступа)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПодписчикВСоставеОграничения,
	               |	ЕСТЬNULL(упоВидыСобытийПолучатели.ОграничениеДоступа.Условие, НЕОПРЕДЕЛЕНО) КАК Условие
	               |ПОМЕСТИТЬ Полная
	               |ИЗ
	               |	Справочник.упоВидыСобытий.Получатели КАК упоВидыСобытийПолучатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упоОграниченияДоступаКОповещениям.Состав КАК упоОграниченияДоступаКОповещениямСостав
	               |		ПО упоВидыСобытийПолучатели.ОграничениеДоступа = упоОграниченияДоступаКОповещениямСостав.Ссылка
	               |ГДЕ
	               |	НЕ упоВидыСобытийПолучатели.Ссылка.ПометкаУдаления
	               |	И упоВидыСобытийПолучатели.Ссылка.Используется
	               |	И упоВидыСобытийПолучатели.ВидПолучателя.ТаблицаПолучателя = &ТаблицаПолучателя
	               |	И (упоВидыСобытийПолучатели.Получатель = НЕОПРЕДЕЛЕНО
	               |			ИЛИ упоВидыСобытийПолучатели.Получатель = &ПодписчикСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Полная.ВидСобытия,
	               |	Полная.ВидПолучателя,
	               |	Полная.Получатель,
	               |	Полная.ОграничениеДоступа,
	               |	Полная.Принудительное,
	               |	Полная.Условие,
	               |	МАКСИМУМ(Полная.ПодписчикВСоставеОграничения) КАК ПодписчикВСоставеОграничения
	               |ПОМЕСТИТЬ Сгруп
	               |ИЗ
	               |	Полная КАК Полная
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Полная.ВидПолучателя,
	               |	Полная.Получатель,
	               |	Полная.ОграничениеДоступа,
	               |	Полная.Принудительное,
	               |	Полная.ВидСобытия,
	               |	Полная.Условие
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сгруп.ВидСобытия,
	               |	Сгруп.ВидПолучателя,
	               |	Сгруп.Получатель,
	               |	Сгруп.ОграничениеДоступа,
	               |	Сгруп.Принудительное,
	               |	Сгруп.ПодписчикВСоставеОграничения,
	               |	Сгруп.Условие
	               |ИЗ
	               |	Сгруп КАК Сгруп
	               |ГДЕ
	               |	(Сгруп.ОграничениеДоступа = &ПустоеОграничениеДоступа
	               |			ИЛИ Сгруп.ПодписчикВСоставеОграничения
	               |				И Сгруп.Условие = ЗНАЧЕНИЕ(Перечисление.упоУсловияОграниченияДоступаКОповещениям.ТолькоУказанные)
	               |			ИЛИ НЕ Сгруп.ПодписчикВСоставеОграничения
	               |				И Сгруп.Условие = ЗНАЧЕНИЕ(Перечисление.упоУсловияОграниченияДоступаКОповещениям.ВсеКромеУказанных))";
				   
	Если ТипЗнч(ПодписчикСсылка) = Тип("СправочникСсылка.Пользователи") ИЛИ 
		ТипЗнч(ПодписчикСсылка) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	СоставыГруппПользователей.ГруппаПользователей
		|ПОМЕСТИТЬ врГруппыПользователя
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|ГДЕ
		|	СоставыГруппПользователей.Используется
		|	И СоставыГруппПользователей.Пользователь = &ПодписчикСсылка 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
		|ПОМЕСТИТЬ врГруппыДоступа
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
		|	И (ГруппыДоступаПользователи.Пользователь = &ПодписчикСсылка
		|			ИЛИ ГруппыДоступаПользователи.Пользователь В
		|				(ВЫБРАТЬ
		|					ГруппыПользователя.ГруппаПользователей
		|				ИЗ
		|					врГруппыПользователя КАК ГруппыПользователя)) 
		|; 
		|" + ТекстЗапроса;	
		
	Иначе	
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	-2 КАК ГруппаДоступа
		|ПОМЕСТИТЬ врГруппыДоступа		
		|; 
		|" + ТекстЗапроса;
		
	КонецЕсли;
   
	Запрос.Текст = ТекстЗапроса;
				  	
	тз = Запрос.Выполнить().Выгрузить();
		
	Возврат тз;
	
КонецФункции

// Функция - Получить все элементы таблицы получателя
//
// Параметры:
//  ТаблицаПолучателя	 - Строка
// 
// Возвращаемое значение:
//  Массив - Массив получателей
//
Функция ПолучитьВсеЭлементыТаблицыПолучателя(ТаблицаПолучателя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаПолучателя.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Пользователи КАК ТаблицаПолучателя
			|		
			|ГДЕ
			|	НЕ ТаблицаПолучателя.ПометкаУдаления";	
			
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Пользователи", ТаблицаПолучателя);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоМетаданныеСсылочногоОбъекта(пМетаданные)
	
	Результат = Ложь;
	
	Для Каждого ОписаниеРеквизита Из пМетаданные.СтандартныеРеквизиты Цикл
		Если ОписаниеРеквизита.Имя = "Ссылка" Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
