
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитыНаФорму(); 
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	ДобавитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты);

КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("АдресДанныхПозицииВХранилище")
Функция ИКТ_АдресДанныхПозицииВХранилище()

	РеквизитыВДанные(Объект);

	ОписаниеПозиции = УправлениеШтатнымРасписанием.ОписаниеПозицииШтатногоРасписания();
	ЗаполнитьЗначенияСвойств(ОписаниеПозиции, Объект);
	ОписаниеПозиции.Вставить("Действие", Действие);
	ОписаниеПозиции.Вставить("ТекущееКоличествоСтавок", ТекущееКоличествоСтавок);
	ОписаниеПозиции.Вставить("ТекущийФОТ", ТекущийФОТ);

	ОписаниеПозиции.ПозицияШтатногоРасписания = РедактируемаяПозиция;

	// Класс условий труда
	ОписаниеПозиции.Вставить("КлассУсловийТруда", КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда);
	ОписаниеПозиции.Вставить("КлассУсловийТрудаДатаРегистрацииИзменений", КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений);

	// Начисления с показателями
	ОписаниеПозиции.Начисления = Объект.Начисления.Выгрузить();

	// Показатели и коэффициенты.
	ПоказателиПозиции =  Объект.Показатели.Выгрузить();
	ОписаниеПозиции.Вставить("Показатели",	ПоказателиПозиции);

	ОписаниеПозиции.ЕжегодныеОтпуска = Объект.ЕжегодныеОтпуска.Выгрузить();

	ОписаниеПозиции.Специальности = Объект.Специальности.Выгрузить();

	СтатистикаПерсоналаРасширенный.ПоместитьКатегориюПерсоналаВОписаниеПозиции(ЭтотОбъект, ОписаниеПозиции);

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
		МодульТарификационнаяОтчетностьУчрежденийФМБА = ОбщегоНазначения.ОбщийМодуль("ТарификационнаяОтчетностьУчрежденийФМБА");
		МодульТарификационнаяОтчетностьУчрежденийФМБА.ПоместитьТарификационнуюГруппуВОписаниеПозиции(ЭтотОбъект, ОписаниеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		МодульОрганизационнаяСтруктура = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		МодульОрганизационнаяСтруктура.ЗаполнитьМестоВСтруктуреПредприятияПоДаннымФормы(ЭтотОбъект, ОписаниеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		МодульУправленческаяЗарплатаФормы = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплатаФормы");
		МодульУправленческаяЗарплатаФормы.ПоместитьДанныеОНачисленияхВОписаниеПозиции(ЭтотОбъект, Объект, ОписаниеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала") Тогда
		МодульХарактеристикиПерсоналаФормы = ОбщегоНазначения.ОбщийМодуль("ХарактеристикиПерсоналаФормы");
		МодульХарактеристикиПерсоналаФормы.ПоместитьХарактеристикиПерсоналаВОписаниеПозиции(ЭтотОбъект, ОписаниеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ЛьготыСотрудников") Тогда
		МодульЛьготыСотрудников = ОбщегоНазначения.ОбщийМодуль("ЛьготыСотрудников");
		МодульЛьготыСотрудников.ПоместитьЛьготыВОписаниеПозиции(ЭтотОбъект, ОписаниеПозиции);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОбучениеРазвитие") Тогда
		МодульОбучениеРазвитие = ОбщегоНазначения.ОбщийМодуль("ОбучениеРазвитиеФормы");
		МодульОбучениеРазвитие.ПоместитьОбучениеВОписаниеПозиции(ЭтотОбъект, ОписаниеПозиции);
	КонецЕсли;
	#Вставка
	ОписаниеПозиции.Вставить("ИКТ_ДолжностьС", Объект.ИКТ_ДолжностьС);
	ОписаниеПозиции.Вставить("ИКТ_IDДолжностьС", Объект.ИКТ_IDДолжностьС);
	ОписаниеПозиции.Вставить("ИКТ_НомерГруппыПодбора", Объект.ИКТ_НомерГруппыПодбора);
	ОписаниеПозиции.Вставить("ИКТ_ТипПроверкиКандидатовДБ", Объект.ИКТ_ТипПроверкиКандидатовДБ);
	ОписаниеПозиции.Вставить("ИКТ_ВидИнцидентаПоКРВ", Объект.ИКТ_ВидИнцидентаПоКРВ);
	ОписаниеПозиции.Вставить("ИКТ_УровеньДоступа", Объект.ИКТ_УровеньДоступа);
	ОписаниеПозиции.Вставить("ИКТ_Должность", Объект.ИКТ_Должность);
	ОписаниеПозиции.Вставить("ИКТ_Группа", Объект.ИКТ_Группа);
	ОписаниеПозиции.Вставить("ИКТ_Грейд", Объект.ИКТ_Грейд);	
	ОписаниеПозиции.Вставить("ИКТ_НазваниеРазделаПерсонала", Объект.ИКТ_НазваниеРазделаПерсонала);
	ОписаниеПозиции.Вставить("ИКТ_ПроцентЗанятости", Объект.ИКТ_ПроцентЗанятости);
	ОписаниеПозиции.Вставить("ID_ДолжностьS", Объект.ID_ДолжностьS);
	ОписаниеПозиции.Вставить("ИКТ_АдминистративныйРуководительАР", Объект.ИКТ_АдминистративныйРуководительАР);
	ОписаниеПозиции.Вставить("ИКТ_БизнесЕдиница", Объект.ИКТ_БизнесЕдиница);
	ОписаниеПозиции.Вставить("ИКТ_ВышестоящийРуководительВР", Объект.ИКТ_ВышестоящийРуководительВР);
	ОписаниеПозиции.Вставить("ИКТ_Департамент", Объект.ИКТ_Департамент);
	ОписаниеПозиции.Вставить("ИКТ_ДоступКНД", Объект.ИКТ_ДоступКНД);
	ОписаниеПозиции.Вставить("ИКТ_НеУчитываетсяВKPI", Объект.ИКТ_НеУчитываетсяВKPI);
	ОписаниеПозиции.Вставить("ИКТ_СозданиеПремийШтраф", Объект.ИКТ_СозданиеПремийШтраф);
	ОписаниеПозиции.Вставить("ИКТ_СрокДействияСтатусаВакансии", Объект.ИКТ_СрокДействияСтатусаВакансии);
	ОписаниеПозиции.Вставить("ИКТ_ТрВодитУдостоверение", Объект.ИКТ_ТрВодитУдостоверение);
	ОписаниеПозиции.Вставить("ИКТ_ТребуетсяМедОсмотр", Объект.ИКТ_ТребуетсяМедОсмотр);
	ОписаниеПозиции.Вставить("ИКТ_ФункциональныйРуководительФР", Объект.ИКТ_ФункциональныйРуководительФР);
	#КонецВставки

	Возврат ПоместитьВоВременноеХранилище(ОписаниеПозиции, УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()  
	
	ЭтоУОС = ИКТ_ЗП_УОС.ЭтоУОС(ОрганизацияФормы);
	
	Если ЭтоУОС Тогда
		
		//Все реквезиты вместо 5 групп УОС поделены на 2 "лево" и "право"
		СтраницаУОС = Элементы.Добавить("СтраницаУОС", Тип("ГруппаФормы"), Элементы.СтраницыФормы);
		СтраницаУОС.Заголовок = "УОС";
		СтраницаУОС.Вид = ВидГруппыФормы.Страница;  
		
		ГруппаУОСОбщая = Элементы.Добавить("ГруппаУОСОбщая", Тип("ГруппаФормы"), Элементы.СтраницаУОС);
		ГруппаУОСОбщая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаУОСОбщая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаУОСОбщая.ОтображатьЗаголовок = Ложь;
		
		ГруппаУОСЛево = Элементы.Добавить("ГруппаУОСЛево", Тип("ГруппаФормы"), Элементы.ГруппаУОСОбщая);
		ГруппаУОСЛево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаУОСЛево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаУОСЛево.ОтображатьЗаголовок = Ложь;
		
		ГруппаУОСПраво = Элементы.Добавить("ГруппаУОСПраво", Тип("ГруппаФормы"), Элементы.ГруппаУОСОбщая);
		ГруппаУОСПраво.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаУОСПраво.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаУОСПраво.ОтображатьЗаголовок = Ложь;
		
		Элементы.ГруппаГрейд.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
		Элемент = Элементы.Найти("ИКТ_ДолжностьС"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ДолжностьС", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ДолжностьС";  
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;    
			НовыйЭлемент.Ширина = 20;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииДолжностиС")
		Иначе                     
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ДолжностьС",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_IDДолжностьС"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_IDДолжностьС", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_IDДолжностьС";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.ТолькоПросмотр = Истина; 
			НовыйЭлемент.Ширина = 10;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_IDДолжностьС",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_НомерГруппыПодбора"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_НомерГруппыПодбора", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_НомерГруппыПодбора";  
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;   
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
			НовыйЭлемент.Доступность = Ложь;	
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_НомерГруппыПодбора",
			"Видимость",
			Истина);
		КонецЕсли;   
		
		Элемент = Элементы.Найти("ИКТ_ТипПроверкиКандидатовДБ"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ТипПроверкиКандидатовДБ", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ТипПроверкиКандидатовДБ";  
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;      
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			НовыйЭлемент.Доступность = Ложь;	
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ТипПроверкиКандидатовДБ",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_ВидИнцидентаПоКРВ"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ВидИнцидентаПоКРВ", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ВидИнцидентаПоКРВ";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;     
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			НовыйЭлемент.Доступность = Ложь;	
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ВидИнцидентаПоКРВ",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_УровеньДоступа"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_УровеньДоступа", Тип("ПолеФормы"), ГруппаУОСЛево); 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_УровеньДоступа";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			НовыйЭлемент.Доступность = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_УровеньДоступа",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_Должность"); 
		Если Элемент = Неопределено Тогда 
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_Должность", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_Должность";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
			НовыйЭлемент.ТолькоПросмотр = Истина;     
			НовыйЭлемент.Ширина = 20;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_Должность",
			"Видимость",
			Истина);
		КонецЕсли; 
		
		Элемент = Элементы.Найти("ID_ДолжностьS"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ID_ДолжностьS", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ID_ДолжностьS";
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ID_ДолжностьS",
			"Видимость",
			Истина);
		КонецЕсли; 

		Элемент = Элементы.Найти("ИКТ_Группа"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_Группа", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_Группа";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина; 
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_Группа",
			"Видимость",
			Истина);
		КонецЕсли;  
		
		Элемент = Элементы.Найти("ИКТ_Грейд"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_Грейд", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_Грейд";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина; 
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_Грейд",
			"Видимость",
			Истина);
		КонецЕсли; 
		
		Элемент = Элементы.Найти("ИКТ_РазделПерсонала"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_РазделПерсонала", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			НовыйЭлемент.Заголовок = "Раздел персонала";
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_НазваниеРазделаПерсонала";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.Ширина = 20;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;  
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_РазделПерсонала",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_НазваниеРазделаПерсонала"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_НазваниеРазделаПерсонала", Тип("ПолеФормы"), ГруппаУОСЛево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Название раздела персонала";
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_НазваниеРазделаПерсонала.РазделПерсонала";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.Ширина = 20;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_НазваниеРазделаПерсонала",
			"Видимость",
			Истина);
		КонецЕсли;		
				
		Элемент = Элементы.Найти("ИКТ_ТрВодитУдостоверение"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ТрВодитУдостоверение", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ДолжностьС.ТрВодитУдостоверение";   
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ТрВодитУдостоверение",
			"Видимость",
			Истина);
		КонецЕсли;    
		
		Элемент = Элементы.Найти("ИКТ_ТребуетсяМедОсмотр"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ТребуетсяМедОсмотр", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ДолжностьС.ТребуетсяМедОсмотр";   
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ТребуетсяМедОсмотр",
			"Видимость",
			Истина);
		КонецЕсли;   
		
		Элемент = Элементы.Найти("ИКТ_СозданиеПремийШтраф"); 
		Если Элемент = Неопределено Тогда 
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СозданиеПремийШтраф", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ДолжностьС.СозданиеПремийШтраф";   
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_СозданиеПремийШтраф",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_НеУчитываетсяВKPI"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_НеУчитываетсяВKPI", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_НеУчитываетсяВKPI";   
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_НеУчитываетсяВKPI",
			"Видимость",
			Истина);
		КонецЕсли;

		
		Элемент = Элементы.Найти("ИКТ_СрокДействияСтатусаВакансии"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_СрокДействияСтатусаВакансии", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_СрокДействияСтатусаВакансии";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_СрокДействияСтатусаВакансии",
			"Видимость",
			Истина);
		КонецЕсли; 
		
		Элемент = Элементы.Найти("ИКТ_ПроцентЗанятости");
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ПроцентЗанятости", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ПроцентЗанятости";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.Ширина = 3;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ПроцентЗанятости",
			"Видимость",
			Истина);
		КонецЕсли;
						
		Элемент = Элементы.Найти("ИКТ_ДоступКНД"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ДоступКНД", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ДолжностьС.ДоступКНД";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.Ширина = 4;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ДоступКНД",
			"Видимость",
			Истина);
		КонецЕсли; 
				
		Элемент = Элементы.Найти("ИКТ_АдминистративныйРуководительАР"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_АдминистративныйРуководительАР", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_АдминистративныйРуководительАР";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_АдминистративныйРуководительАР",
			"Видимость",
			Истина);
		КонецЕсли;
		
		Элемент = Элементы.Найти("ИКТ_ФункциональныйРуководительФР"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ФункциональныйРуководительФР", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ФункциональныйРуководительФР";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ФункциональныйРуководительФР",
			"Видимость",
			Истина);
		КонецЕсли;   
		
		Элемент = Элементы.Найти("ИКТ_ВышестоящийРуководительВР"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ВышестоящийРуководительВР", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ВышестоящийРуководительВР";   
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;  
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ВышестоящийРуководительВР",
			"Видимость",
			Истина);
		КонецЕсли; 
		
		ИКТ_RequestСерверПривилегированный.ИКТ_ДобавитьЭлементыСостоянияРеквестНаФорму(ЭтаФорма, Элементы.СтраницыФормы);		
		ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();    
		
		Элемент = Элементы.Найти("ИКТ_БизнесЕдиница"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_БизнесЕдиница", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_БизнесЕдиница"; 
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_БизнесЕдиница",
			"Видимость",
			Истина);
		КонецЕсли; 
		
		Элемент = Элементы.Найти("ИКТ_Департамент"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_Департамент", Тип("ПолеФормы"), ГруппаУОСПраво);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_Департамент";
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_Департамент",
			"Видимость",
			Истина);
		КонецЕсли;  
		Элемент = Элементы.Найти("ИКТ_ИсключаемыеВидыРасчета"); 
		Если Элемент = Неопределено Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИКТ_ИсключаемыеВидыРасчета", Тип("ТаблицаФормы"),Элементы.ГруппаУОСОбщая);
			НовыйЭлемент.ПутьКДанным = "Объект.ИКТ_ИсключаемыеВидыРасчета";
			НовыйЭлемент.Заголовок = "Исключаемые виды расчета";

			НоваяКолонка = Элементы.Добавить("Начисление", Тип("ПолеФормы"), Элементы.ИКТ_ИсключаемыеВидыРасчета); 
			НоваяКолонка.Заголовок = "Начисление"; 
			НоваяКолонка.ПутьКДанным = "Объект.ИКТ_ИсключаемыеВидыРасчета.Начисление";
			НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ИКТ_ИсключаемыеВидыРасчета",
			"Видимость",
			Истина);
		КонецЕсли;  

	Иначе             
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ДолжностьС",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_IDДолжностьС",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_НомерГруппыПодбора",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ТипПроверкиКандидатовДБ",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ВидИнцидентаПоКРВ",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_УровеньДоступа",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_Должность",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_Группа",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_Грейд",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_РазделПерсонала",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_НазваниеРазделаПерсонала",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ПроцентЗанятости",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ТрВодитУдостоверение",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ДоступКНД",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_ТребуетсяМедОсмотр",
		"Видимость",
		Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИКТ_СозданиеПремийШтраф",
		"Видимость",
		Ложь);
		
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Результат = ИКТ_RequestСерверПривилегированный.ПолучитьСоостояниеОбменаСРеквестПоОбъекту(Объект.Ссылка);
		
		Если Не ЗначениеЗаполнено(Результат.Период) Тогда
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Не выполнялся";
			
		ИначеЕсли Результат.Ошибка = Ложь и Результат.Выгружен = Ложь Тогда
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Объект в очереди на выгрузку";  
			
		ИначеЕсли Результат.Ошибка = Истина Тогда
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = СтрШаблон("Ошибка обмена. Дата выгрузки %1", Результат.Период);
			
		Иначе 
			
			ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен выполнен";
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен будет выполнен после записи объекта";
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ГоловнаяОрганизацияПриИзменении(Элемент)
	ДобавитьРеквизитыНаФорму(); 
КонецПроцедуры      

&НаКлиенте
Процедура ПриИзмененииДолжностиС(Элемент)
	ПриИзмененииДолжностиСНаСервере(); 
КонецПроцедуры 

&НаСервере
Процедура ПриИзмененииДолжностиСНаСервере()  
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ИКТ_ДолжностьС, 
		"IDДолжностьС,НомерГруппыПодбора,ТипПроверкиКандидатовДБ,ВидИнцидентаПоКРВ,УровеньДоступа,Должность"); 
	
	Объект.ИКТ_IDДолжностьС = ЗначенияРеквизитов.IDДолжностьС;
	Объект.ИКТ_НомерГруппыПодбора = ЗначенияРеквизитов.НомерГруппыПодбора;
	Объект.ИКТ_ТипПроверкиКандидатовДБ = ЗначенияРеквизитов.ТипПроверкиКандидатовДБ;
	Объект.ИКТ_ВидИнцидентаПоКРВ = ЗначенияРеквизитов.ВидИнцидентаПоКРВ;
	Объект.ИКТ_УровеньДоступа = ЗначенияРеквизитов.УровеньДоступа;
	Объект.ИКТ_Должность = ЗначенияРеквизитов.Должность;
	
КонецПроцедуры     

&НаСервере
Процедура ДобавитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты)
	
	Если ИКТ_ЗП_УОС.ЭтоУОС(Объект.Владелец) Тогда
		Возврат;
	КонецЕсли;              
	
	ПроверяемыеРеквизиты.Добавить("ИКТ_ДолжностьС");
	ПроверяемыеРеквизиты.Добавить("ИКТ_IDДолжностьС");
	ПроверяемыеРеквизиты.Добавить("ИКТ_НомерГруппыПодбора");
	ПроверяемыеРеквизиты.Добавить("ИКТ_ТипПроверкиКандидатовДБ");
	ПроверяемыеРеквизиты.Добавить("ИКТ_ВидИнцидентаПоКРВ");
	ПроверяемыеРеквизиты.Добавить("ИКТ_УровеньДоступа");
	ПроверяемыеРеквизиты.Добавить("ИКТ_Должность");
	ПроверяемыеРеквизиты.Добавить("ИКТ_Группа");
	ПроверяемыеРеквизиты.Добавить("ИКТ_Грейд");
	
КонецПроцедуры
	 
