////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с закрытыми этапами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает признак "Строгий контроль изменения закрытых этапов"
//  из константы упоСтрогийКонтрольИзмененияЗакрытыхЭтапов
// 
// Возвращаемое значение:
//  Булево - результат проверки
//
Функция СтрогийКонтрольИзмененияЗакрытыхЭтапов() Экспорт
	Возврат Константы.упоСтрогийКонтрольИзмененияЗакрытыхЭтапов.Получить();
КонецФункции

// Возвращает регистры, при записи которых необходимо проверять отсутствие в записываемых движения закрытых задач.
// 
// Возвращаемое значение:
//  Структура - набор регистров проверки.
//
Функция ПолучитьСтруктуруПроверяемыхРегистров() Экспорт
	
	Результат = Новый Структура;
	
	// Актуальные планы
	
	Результат.Вставить("упоАктуальныеПланыВыполненияОбъемов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоАктуальныеПланыДвиженийДенежныхСредств", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоАктуальныеПланыДополнительныхЗатрат", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоАктуальныеПланыДоходовИРасходов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоАктуальныеПланыДоходовИРасходовПодразделения", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));	
	Результат.Вставить("упоАктуальныеПланыЗатратМатериальныхРесурсов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	//Результат.Вставить("упоАктуальныеПланыТрудозатратПоДнямТекущаяВерсия", ПолучитьСтруктуруРегистра("Операция"));
	//Результат.Вставить("упоАктуальныеПланыТрудозатратСводноТекущаяВерсия", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	
	// Данные планов
	
	Результат.Вставить("упоДанныеПлановВыпускаСубпродуктов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеПлановДвиженияДенежныхСредств", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеПлановДоходовИРасходов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеПлановДоходовИРасходовПодразделения", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеПлановОбъемовПодразделения", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеПлановПотребностейМатериальныхРесурсов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеПлановТрудозатратРолей", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеРаспределенияДоходовПоПериодам", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоДанныеРаспределенияРасходовПоПериодам", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));	
	
	Результат.Вставить("упоДанныеРаспределенияПланаТрудозатратТрудовыхРесурсовПоДням", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	
	// Сроки
	
	// Для закрытой/завершенной задачи может изменяться критический путь при изменении связанных задач.
	//Результат.Вставить("упоРасчетныеСрокиПроектныхЗадач", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоСрокиПроектныхЗадач", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	
	// Готовность
	
	Результат.Вставить("упоПроцентыГотовностиПроектныхЗадач", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоСтатусыПроектныхЗадач", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	
	// РС Факт
	
	Результат.Вставить("упоИспользованиеРабочегоВремени", ПолучитьСтруктуруРегистра("РабочееЗадание"));	
	
	Результат.Вставить("упоФактВыполненияОбъемовПоДням", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	Результат.Вставить("упоФактДвиженийДенежныхСредств", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	Результат.Вставить("упоФактДополнительныхЗатрат", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	Результат.Вставить("упоФактДоходовИРасходовПоДням", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	Результат.Вставить("упоФактЗатратМатериальныхРесурсов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	Результат.Вставить("упоФактическиеДатыНачалаИОкончанияПроектныхЗадач", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	Результат.Вставить("упоФактТрудозатратПоДням", ПолучитьСтруктуруРегистра("Операция"));
	Результат.Вставить("упоФактТрудозатратСводно", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	
	// РН
	
	Результат.Вставить("упоВыполненныеПринятыеОбъемы", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	Результат.Вставить("упоФактВыполненияОбъемовОбороты", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	Результат.Вставить("упоФактДоходовИРасходовОбороты", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	
	// Пока под вопросом 
	
	//Результат.Вставить("упоОперативнаяЗагрузкаСпециалистов", ПолучитьСтруктуруРегистра("ПроектнаяЗадача"));
	//Результат.Вставить("упоСвойстваПроектныхЗадач", ПолучитьСтруктуруРегистра("ПроектнаяЗадача", "Версия"));
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруРегистра(ИмяПоляПЗ, ИмяПоляВерсии = Неопределено)
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяПоляЗадачи", ИмяПоляПЗ);
	Если ИмяПоляВерсии <> Неопределено Тогда
		Результат.Вставить("ИмяПоляВерсии", ИмяПоляВерсии);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти
