
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура(); // нет внутренних печатных форм.

КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой 
//											  был выведен объект (выходной параметр).
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных
//											  табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  Основание    - Произвольный - значение, которое используется как основание для заполнения.
// 
Процедура ОбработкаЗаполнения(Основание) Экспорт
		
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
	ТрудозатратыСОкончНаПредв = Истина;
	ПереноситьНазначенныеТрудовыеРесурсы = Истина;
	
	Если ТипЗнч(Основание) = Тип("Структура") 
		И Основание.Свойство("Проект") Тогда
		
		СводныйПроект = Основание.Проект;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Проекты") Тогда 
		
		СводныйПроект = Основание;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьТаблицуСкопированныхРанееЗадач(ТекущаяВерсияПроекта, пМассивКопируемыхЗадач) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекВерсия", ТекущаяВерсияПроекта);
	Запрос.УстановитьПараметр("Задачи", пМассивКопируемыхЗадач);
	Запрос.Текст = "ВЫБРАТЬ
	               |	тСвойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	тСвойства.ПроектнаяЗадача.СкопированаВСводныйИзЗадачи КАК СкопированаВСводныйИзЗадачи,
	               |	тСвойства.ПроектнаяЗадача.ДокументОснование КАК ДокументОснование
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &ТекВерсия) КАК тСвойства
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
	               |		ПО тСвойства.ПроектнаяЗадача = упоПроектнаяЗадача.Ссылка
	               |			И (упоПроектнаяЗадача.СкопированаВСводныйИзЗадачи В (&Задачи))";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьНазначенныеТрудовыеРесурсыКопируемыхЗадач(Задачи) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задачи", Задачи);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс КАК ТрудовойРесурс,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса КАК Роль,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатрат КАК ДоляТрудозатрат,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатратПоУровнюПланирования КАК ДоляТрудозатратПоУровнюПланирования,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение КАК Подразделение,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ВариантРаспределения КАК ВариантРаспределения
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(, ПроектнаяЗадача В (&Задачи)) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО упоВыделенныеТрудовыеРесурсыСрезПоследних.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.Текущая)";
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект - содержит сам объект.
//  СтандартнаяОбработка – Булево - признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка - префикс, который будет использоваться для генерации номера.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  ОбъектКопирования – ДокументОбъект - исходный документ, который является источником копирования. 
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	КопируемыеЗадачи.Очистить();
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента - в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - в данный параметр передается текущий режим проведения.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Проведен И Не ДополнительныеСвойства.Свойство("упоБезусловноеВыполнение") Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Документ разрешено перепроводить только из формы документа.'") ,,,, Отказ);
			Возврат;
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отменять проведение документ разрешено только из формы документа.'") ,,,, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СтатусСводного = упоПроектыИЗадачиСервер.ПолучитьСтатусПроекта(СводныйПроект);
		Если Не ЗначениеЗаполнено(СтатусСводного) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Сводный проект не зарегистрирован.'") ,,,, Отказ);
			Возврат;
		ИначеЕсли СтатусСводного = Перечисления.упоСостояниеСтатусаПроекта.Завершен Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Сводный проект завершен.'") ,,,, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения); 
		
КонецПроцедуры

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект - содержит сам объект.
//  Отказ        - Булево - признак отказа от записи документа.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Функция ИсключенияКопированияРеквизитовПЗ()
	
	НеКопируютсяРеквизиты = Новый Массив;
	НеКопируютсяРеквизиты.Добавить("ЗадачаРодитель");
	НеКопируютсяРеквизиты.Добавить("РучнойВводСроков");
	НеКопируютсяРеквизиты.Добавить("Дата");
	НеКопируютсяРеквизиты.Добавить("Номер");
	НеКопируютсяРеквизиты.Добавить("Проведен");
	НеКопируютсяРеквизиты.Добавить("ПроектнаяЗадача");
	НеКопируютсяРеквизиты.Добавить("Автор");
	НеКопируютсяРеквизиты.Добавить("АвторИзменений");
	НеКопируютсяРеквизиты.Добавить("ДатаМодификации");
	НеКопируютсяРеквизиты.Добавить("ФлагИмпортаMSP");
	НеКопируютсяРеквизиты.Добавить("СкопированаВСводныйИзЗадачи");
	НеКопируютсяРеквизиты.Добавить("ДокументОснование");
	НеКопируютсяРеквизиты.Добавить("Проект");
	
	Возврат НеКопируютсяРеквизиты;
	
КонецФункции

Функция ИсключенияКопированияТабЧастейПЗ()
	
	НеКопируютсяТЧ = Новый Массив;
	
	НеКопируютсяТЧ.Добавить("ПредусловияЗадачи");
	
	Возврат НеКопируютсяТЧ;
	
КонецФункции

Функция КопированиеРазрешено(ТекущаяВерсия, СкопированныеЗадачиСводногоПроекта)
	
	Результат = Истина;
	
	Если упоРазграничениеДоступаВызовСервера.РазграничениеДоступаОтключено() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкопированныеЗадачиСводногоПроекта) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПроверяемыеСтатусы = упоПроектыИЗадачиСервер.СтатусыЗадачаЗакрытаЗавершена();
	ЗакрытыеЗавершенныеЗадачи = упоПроектыИЗадачиСервер.ЗадачиУказанныхСтатусов(СводныйПроект, 
		ПроверяемыеСтатусы, ТекущаяВерсия, СкопированныеЗадачиСводногоПроекта);
	Если ЗначениеЗаполнено(ЗакрытыеЗавершенныеЗадачи) Тогда
		ТекстыСообщений = Новый Массив;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В проекте ""%1"" не могут быть обновлены задачи:'"), СводныйПроект);
		ТекстыСообщений.Добавить(ТекстСообщения);
		ШаблонСписка = НСтр("ru = ' - %1 (статус ""%2"")'");
		Для Каждого ЗакрытаяЗавершеннаяЗадача Из ЗакрытыеЗавершенныеЗадачи Цикл
			ТекстСообщения = СтрШаблон(ШаблонСписка, 
				ЗакрытаяЗавершеннаяЗадача.НазваниеЗадачи, ЗакрытаяЗавершеннаяЗадача.СтатусЗадачи);
			ТекстыСообщений.Добавить(ТекстСообщения);
		КонецЦикла;
		ТекстСообщения = СтрСоединить(ТекстыСообщений, Символы.ПС);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СписокКопируемыхЗадач = КопируемыеЗадачи.ВыгрузитьКолонку("ПроектнаяЗадача");
	
	ТекущаяВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(СводныйПроект);
	
	ТаблицаСкопированныхРанее = ПолучитьТаблицуСкопированныхРанееЗадач(ТекущаяВерсия, СписокКопируемыхЗадач);
	СкопированныеЗадачиСводногоПроекта = ТаблицаСкопированныхРанее.ВыгрузитьКолонку("ПроектнаяЗадача");
	Если Не КопированиеРазрешено(ТекущаяВерсия, СкопированныеЗадачиСводногоПроекта) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПереноситьНазначенныеТрудовыеРесурсы Тогда
		ТаблицаНазначенныхТР = ПолучитьНазначенныеТрудовыеРесурсыКопируемыхЗадач(СписокКопируемыхЗадач);
	КонецЕсли;
	НужноПереноситьНазначенныеТрудовыеРесурсы = ПереноситьНазначенныеТрудовыеРесурсы И ЗначениеЗаполнено(ТаблицаНазначенныхТР);
	
	НеКопируютсяРеквизиты = ИсключенияКопированияРеквизитовПЗ();
	СтрокаИсключений = СтрСоединить(НеКопируютсяРеквизиты, ", ");
	НеКопируютсяТЧ = ИсключенияКопированияТабЧастейПЗ();
 
	//
	
	КэшСкопированных = Новый Соответствие;
	ОтборСкопированных = Новый Структура("ДокументОснование, СкопированаВСводныйИзЗадачи", Ссылка);
	Для Каждого СтрокаКопируемойЗадачи Из КопируемыеЗадачи Цикл
		ОтборСкопированных.СкопированаВСводныйИзЗадачи = СтрокаКопируемойЗадачи.ПроектнаяЗадача;
		СтрокиСкопированныхРаннееЭтимДокументом = ТаблицаСкопированныхРанее.НайтиСтроки(ОтборСкопированных);
		Если ЗначениеЗаполнено(СтрокиСкопированныхРаннееЭтимДокументом) Тогда
			СкопированнаяПЗ = СтрокиСкопированныхРаннееЭтимДокументом[0].ПроектнаяЗадача;
			КэшСкопированных.Вставить(СтрокаКопируемойЗадачи.ПроектнаяЗадача, СкопированнаяПЗ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКопируемойЗадачи Из КопируемыеЗадачи Цикл
		
		СсылкаНаОбновляемуюПЗ = КэшСкопированных.Получить(СтрокаКопируемойЗадачи.ПроектнаяЗадача);
		Если СсылкаНаОбновляемуюПЗ = Неопределено Тогда
			ОбъектЗадачи = Документы.упоПроектнаяЗадача.СоздатьДокумент();
		Иначе
			ОбъектЗадачи = СсылкаНаОбновляемуюПЗ.ПолучитьОбъект();
		КонецЕсли;
		
		//
		
		ДокументИсточник = СтрокаКопируемойЗадачи.ПроектнаяЗадача.ПолучитьОбъект();
		ДокументИсточник.ПолучитьДанныеВерсии(Неопределено);
		
		ЗаполнитьЗначенияСвойств(ОбъектЗадачи, ДокументИсточник, , СтрокаИсключений);
		Если НеКопируютсяРеквизиты.Найти("НазваниеПроектнойЗадачи") = Неопределено Тогда
			ОбъектЗадачи.НазваниеПроектнойЗадачи = ДокументИсточник.НазваниеПроектнойЗадачи + " [" +ДокументИсточник.Проект + "]";
		КонецЕсли;
		ОбъектЗадачи.РучнойВводСроков = ЗначениеЗаполнено(ОбъектЗадачи.ДатаНачалаПлан) 
			И ЗначениеЗаполнено(ОбъектЗадачи.ДатаЗавершенияПлан);
		ОбъектЗадачи.Проект = СводныйПроект;
		ОбъектЗадачи.ДокументОснование = Ссылка;
		ОбъектЗадачи.СкопированаВСводныйИзЗадачи = СтрокаКопируемойЗадачи.ПроектнаяЗадача;
		
		Для Каждого МетаданныеТЧ Из Метаданные.Документы.упоПроектнаяЗадача.ТабличныеЧасти Цикл
			ИмяТЧ = МетаданныеТЧ.Имя;
			Если НеКопируютсяТЧ.Найти(ИмяТЧ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбъектЗадачи[ИмяТЧ].Загрузить(ДокументИсточник[ИмяТЧ].Выгрузить()); 
		КонецЦикла;
		
		Если ТрудозатратыСОкончНаПредв Тогда
			СтрокиКУдалению = ОбъектЗадачи.ТрудовыеРесурсы.НайтиСтроки(
									Новый Структура("УровеньПланирования", 
									Перечисления.упоУровеньПланирования.Предварительный));
			Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
				СтрокиПодчТЧКУдалению = ОбъектЗадачи.ТрудовыеРесурсыПоПериодам.НайтиСтроки(
											Новый Структура("ИндексСтрокиРаспределениеПоРолям", 
											СтрокаКУдалению.ИндексСтрокРаспределенияПоПериодам));
				Для Каждого СтрокаПодчТЧКУдалению Из СтрокиПодчТЧКУдалению Цикл
					ОбъектЗадачи.ТрудовыеРесурсыПоПериодам.Удалить(СтрокаПодчТЧКУдалению);
				КонецЦикла;
				ОбъектЗадачи.ТрудовыеРесурсы.Удалить(СтрокаКУдалению);
			КонецЦикла;
			
			Для Каждого СтрокаТЧ Из ОбъектЗадачи.ТрудовыеРесурсы Цикл
				СтрокаТЧ.УровеньПланирования = Перечисления.упоУровеньПланирования.Предварительный;
			КонецЦикла;
		КонецЕсли;
		
		ОбъектЗадачи.ДополнительныеСвойства.Вставить("НеПроверятьРазграничениеДоступа", Истина);
		ОбъектЗадачи.ДополнительныеСвойства.Вставить("ДанныеВерсииПолучены", Истина);
		
		Попытка
			ОбъектЗадачи.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Копирование задач'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,, Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
			
			ТекстСообщения = НСтр("ru = 'Произошла ошибка при копировании задач. Подробнее см. журнал регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
			Возврат; // Возврат
			
		КонецПопытки;
		
		Если НужноПереноситьНазначенныеТрудовыеРесурсы Тогда
			
			Отбор = Новый Структура("ПроектнаяЗадача", СтрокаКопируемойЗадачи.ПроектнаяЗадача);
			НайденныеСтроки = ТаблицаНазначенныхТР.НайтиСтроки(Отбор);
			УдаляемыеСтроки = Новый Массив;
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если ОбъектЗадачи.ТрудовыеРесурсы.Найти(НайденнаяСтрока.Роль, "Ресурс") = Неопределено Тогда
					УдаляемыеСтроки.Добавить(НайденнаяСтрока);
					Продолжить;
				КонецЕсли;
				НайденнаяСтрока.ПроектнаяЗадача = ОбъектЗадачи.Ссылка;
			КонецЦикла;
			
			Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				ТаблицаНазначенныхТР.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НужноПереноситьНазначенныеТрудовыеРесурсы И ЗначениеЗаполнено(ТаблицаНазначенныхТР) Тогда
		
		НайденныйДокСсылка = Документы.упоСохранениеДанныхПроекта.НайтиПоРеквизиту("ДокументОснование", Ссылка);
		
		Если ЗначениеЗаполнено(НайденныйДокСсылка) Тогда
			ДокСохраненияДанныхПроекта = НайденныйДокСсылка.ПолучитьОбъект();
		Иначе
			ДокСохраненияДанныхПроекта = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент();
			ДокСохраненияДанныхПроекта.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ДокСохраненияДанныхПроекта.Проект = СводныйПроект;
		ДокСохраненияДанныхПроекта.ПерезаписатьНазначенныеТрудовыеРесурсы = Истина;
		ДокСохраненияДанныхПроекта.ДокументОснование = Ссылка;
		ДокСохраненияДанныхПроекта.НазначенныеТрудовыеРесурсы.Загрузить(ТаблицаНазначенныхТР);
		
		Попытка
			ДокСохраненияДанныхПроекта.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось провести: ""Сохранение данных проекта""!'", 
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,, Ссылка, ТекстСообщения); 
			
			ТекстСообщения = 
				НСтр("ru = 'Произошла ошибка при копировании назначенных трудовых ресурсов. Подробнее см. журнал регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
			Возврат; // Возврат
			
		КонецПопытки
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ТаблицаСкопированныхРанее = ПолучитьТаблицуСкопированныхРанееЗадач(СводныйПроект, КопируемыеЗадачи.ВыгрузитьКолонку("ПроектнаяЗадача"));
	
	Для Каждого СтрокаЗадачи Из ТаблицаСкопированныхРанее Цикл
		Если СтрокаЗадачи.ДокументОснование <> Ссылка Тогда
			Продолжить;
		КонецЕсли;
		СтруктураУдаляемыеОбъекты = упоПроектыИЗадачиСервер.ПолучитьУдаляемыеОбъекты(СтрокаЗадачи.ПроектнаяЗадача);
		упоПроектыИЗадачиСервер.УдалитьПроектнуюЗадачу(СтрокаЗадачи.ПроектнаяЗадача, СтруктураУдаляемыеОбъекты, "", Ложь);
	КонецЦикла;
	
	НайденныйДокСсылка = Документы.упоСохранениеДанныхПроекта.НайтиПоРеквизиту("ДокументОснование", Ссылка);
	Если ЗначениеЗаполнено(НайденныйДокСсылка) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденныйДокСсылка, "Проведен") Тогда
		НайденныйДок = НайденныйДокСсылка.ПолучитьОбъект();
		НайденныйДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;	
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
