
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ	(ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа) Тогда 
		Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);	
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, РежимЗаписиДокумента.Проведение, Отказ, Заголовок, Истина);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
			
	упоПроведениеДокументовСервер.ПодготовитьДвиженияКРегистрации(ЭтотОбъект);
	упоПроведениеДокументовСервер.ПровестиДокумент(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ЗначениеЗаполнено(Проект) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		НовыйПроект = Справочники.Проекты.СоздатьЭлемент();
		
		СтруктураНастроек = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(ПортфельПроектов);
		ЗаполнитьЗначенияСвойств(НовыйПроект, СтруктураНастроек);
		
		НовыйПроект.Наименование = НаименованиеПроекта;		
		НовыйПроект.упоРезультатыПроекта = РезультатыПроекта;
		НовыйПроект.упоЦельПроекта = ЦельПроекта;
		НовыйПроект.упоВыгоды = Выгоды;
		НовыйПроект.упоОбоснованиеПроекта = ОбоснованиеПроекта;
		НовыйПроект.упоНаправлениеИнвестиций = НаправлениеИнвестиций;		
		НовыйПроект.Подразделение = Подразделение;
		НовыйПроект.ПортфельПроектов = ПортфельПроектов;
		НовыйПроект.ПрограммаПроектов = ПрограммаПроектов;
		НовыйПроект.Компонент = Перечисления.упоКомпоненты.Проект;										
		НовыйПроект.ТипПроекта = ТипПроекта;
				
		НовыйПроект.Записать();
		
		ЭтотОбъект.Проект = НовыйПроект.Ссылка;
		
		УстановитьПривилегированныйРежим(Ложь);	
		
	КонецЕсли;	
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		ЗаполнитьПоПроекту(ДанныеЗаполнения);
	КонецЕсли;
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры 
 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоПроведениеДокументовВызовСервера.обУдалитьДвиженияДокумента(Отказ, ЭтотОбъект);
		
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

// Функция формирует структуру обязательных реквизитов шапки или заданной табличной части объекта.
// 
// Параметры: 
//  ИмяТабличнойЧасти - Строка - содержит имя табличной части объекта,
//                      если параметр не указан, то структура формируется по шапке объекта.
// 
// Возвращаемое значение: 
//  Структура         - содержит поля обязательных реквизитов,
//                      Ключ поля структуры - реквизит,
//                      Значение поля структуры = Неопределено.
// 
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	// Формирование структуры обязательных реквизитов шапки.
	Если Не ЗначениеЗаполнено(Проект) Тогда
		СтруктураОбязательныхПолей.Вставить("НаименованиеПроекта");	
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ - Булево 	- Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоПроекту(ДанныеЗаполнения)
		
	Реквизиты = "Наименование, ПортфельПроектов, ПрограммаПроектов, Подразделение, ТипПроекта, упоЦельПроекта, упоОбоснованиеПроекта, 
				|упоВыгоды, упоРезультатыПроекта, упоНаправлениеИнвестиций";
	ПолученныеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, Реквизиты, Истина);
	Проект = ДанныеЗаполнения;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПолученныеЗначения);
	НаименованиеПроекта = ПолученныеЗначения.Наименование;
	ЦельПроекта = ПолученныеЗначения.упоЦельПроекта;
	ОбоснованиеПроекта = ПолученныеЗначения.упоОбоснованиеПроекта;
	Выгоды = ПолученныеЗначения.упоВыгоды;
	РезультатыПроекта = ПолученныеЗначения.упоРезультатыПроекта;
	НаправлениеИнвестиций = ПолученныеЗначения.упоНаправлениеИнвестиций;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
