#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьРеквизитыПроектныхЗадачХранящихсяВРС(ТипПлана = Неопределено) Экспорт
	
	Если ТипПлана = Неопределено Тогда
		ТипПлана = Перечисления.упоТипПланаПроекта.Текущий;
	КонецЕсли;	
	
	ОтборПоСценарию = упоТиповыеОтчетыСервер.ЭтоОтборПоСценарию(ТипПлана);
		
	ТипВерсии = упоТиповыеОтчетыСервер.ТипВерсииСтрокойПоТипуПлана(ТипПлана);
	
	СвойстваПЗ = Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Ресурсы;
	
	СписокСвойствПЗ = Новый Массив;
	СписокСвойствПЗ.Добавить(",
		|	ВЫБОР
		|		КОГДА СвойстваПЗ.ЭтоВеха
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.Веха)
		|		КОГДА СвойстваПЗ.ЭтоПакетРабот
		|				ИЛИ СвойстваПЗ.ЭтоМодельПакетаРабот
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.Этап)
		|	КОНЕЦ КАК ТипПроектнойЗадачиПЗ,
		|	ВЫБОР
		|		КОГДА СвойстваПЗ.ЭтоВеха
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.Веха)
		|		КОГДА СвойстваПЗ.ЭтоПакетРабот
		|				ИЛИ СвойстваПЗ.ЭтоМодельПакетаРабот
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.Этап)
		|	КОНЕЦ КАК ТипПроектнойЗадачиПЗРесурс");
	
	ТекстШаблона = ",
	|	СвойстваПЗ.%1 КАК %1ПЗ,
	|	СвойстваПЗ.%1 КАК %1ПЗРесурс";
	
	ШаблонВыбранноеПолеКомпоновки = "%1ПЗ.*";
	ШаблонВыбранноеПолеКомпоновкиРесурс = "%1ПЗРесурс.*";
	ВыбранныеПоляКомпоновки = Новый Массив;
	ВыбранныеПоляКомпоновки.Добавить(СтрШаблон(ШаблонВыбранноеПолеКомпоновки, "ТипПроектнойЗадачи"));
	ВыбранныеПоляКомпоновки.Добавить(СтрШаблон(ШаблонВыбранноеПолеКомпоновкиРесурс, "ТипПроектнойЗадачи"));
	
	ШаблонПолеУсловияКомпоновки = "%1.* КАК %1ПЗ";
	ПоляУсловийКомпоновки = Новый Массив;
	ПоляУсловийКомпоновки.Добавить("(ВЫБОР
		|		КОГДА СвойстваПЗ.ЭтоВеха
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.Веха)
		|		КОГДА СвойстваПЗ.ЭтоПакетРабот
		|				ИЛИ СвойстваПЗ.ЭтоМодельПакетаРабот
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.упоТипПроектнойЗадачи.Этап)
		|	КОНЕЦ).* КАК ТипПроектнойЗадачиПЗ");
	
	Для Каждого СвойствоПЗ Из СвойстваПЗ Цикл
		Если СвойствоПЗ.Имя = "ЭтоВеха" Или СвойствоПЗ.Имя = "ЭтоПакетРабот" Или СвойствоПЗ.Имя = "ЭтоМодельПакетаРабот"
				Или НРег(Лев(СвойствоПЗ.Имя, СтрДлина("удалить"))) = "удалить" Тогда
			Продолжить;
		КонецЕсли;
		ТекстСвойства = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблона, СвойствоПЗ.Имя);
		СписокСвойствПЗ.Добавить(ТекстСвойства);
		
		ВыбранныеПоляКомпоновки.Добавить(СтрШаблон(ШаблонВыбранноеПолеКомпоновки, СвойствоПЗ.Имя));
		ВыбранныеПоляКомпоновки.Добавить(СтрШаблон(ШаблонВыбранноеПолеКомпоновкиРесурс, СвойствоПЗ.Имя));
		
		ПоляУсловийКомпоновки.Добавить(СтрШаблон(ШаблонПолеУсловияКомпоновки, СвойствоПЗ.Имя));
	КонецЦикла;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СвойстваПЗ.ПроектнаяЗадача КАК СсылкаНаПроектнуюЗадачу
				   |//СписокСвойствПЗ
	               |{ВЫБРАТЬ
	               |	СсылкаНаПроектнуюЗадачу.*,
	               |//ВыбранныеПоляКомпоновки}
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних({(НЕОПРЕДЕЛЕНО) КАК Поле2}, {(ПроектнаяЗадача) КАК СсылкаНаПроектнуюЗадачу}) КАК СвойстваПЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
	               |		ПО СвойстваПЗ.Версия = упоВерсииПроекта.Версия
	               |			И (упоВерсииПроекта.//Текущая)
	               |{ГДЕ
	               |	СвойстваПЗ.ПроектнаяЗадача.* КАК СсылкаНаПроектнуюЗадачу,
	               |//ПоляУсловийКомпоновки}";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//СписокСвойствПЗ", СтрСоединить(СписокСвойствПЗ));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ВыбранныеПоляКомпоновки", СтрСоединить(ВыбранныеПоляКомпоновки, "," + Символы.ПС));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПоляУсловийКомпоновки", СтрСоединить(ПоляУсловийКомпоновки, "," + Символы.ПС));
	
	Если ОтборПоСценарию Тогда
		ОтборПоВерсиямСценария = упоТиповыеОтчетыСервер.УсловиеОтбораВерсииПоВерсиямСценария();
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//Текущая", ОтборПоВерсиямСценария);
		упоТиповыеОтчетыСервер.ВставитьВТекстЗапросаВремТабСВерсиямиПоСценарию(ТекстЗапроса);
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//Текущая", ТипВерсии);
	КонецЕсли;
	
	Результат = Новый Структура("СвойстваПЗ, ТекстЗапроса", СвойстваПЗ, ТекстЗапроса);
	
	Возврат Результат; 
	
КонецФункции	
	
#КонецОбласти