#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(упоКорневойПроект)";
	
	// {УПФ}
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Ограничение.Текст = Ограничение.Текст +
		"	И ЗначениеРазрешено(Контрагент)";
	КонецЕсли;
	// {/УПФ} 

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	// {PM} 
	Документы.упоИзменениеРуководителяПроекта.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоНазначениеТрудовыхРесурсовНаПроект.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияПоказателейПроекта.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияФактическихДоходовИРасходов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияФактическихДвиженийДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРучнаяАктуализацияПроекта.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Документы.упоПланированиеТрудозатратПоТрудовымРесурсам.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		Документы.упоПрогнозТрудозатратПоРолям.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		Документы.упоЗаявкаНаПроект.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		Документы.упоРегистрацияПоказателейЭффективностиПроекта.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		Документы.упоРегистрацияЮридическихУсловийДоговора.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли; 
	// {/PM} 
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	// {ЧистыйPM}
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоЧистыйPM() Тогда
		Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.Проекты);
	КонецЕсли;
	// {/ЧистыйPM}
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитов

// Для использования в процедуре ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
// Возвращает блокируемые реквизиты объекта.
// 
// Возвращаемое значение:
//  Массив
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВедетсяБюджетДоходов; ДоходыПоПодразделениям, ДоходыПоОбъемам, ДоходыПоНатуральнымПоказателям");
	Результат.Добавить("ВедетсяБюджетРасходов; РасходыПоПодразделениям, РасходыПоОбъемам, РасходыПоНатуральнымПоказателям");
	
	Результат.Добавить("ПланироватьТрудозатратыПоПроекту; УчитыватьПериодРегистрацииНормСтоимостиПриРасчетеТрудозатрат");
	Результат.Добавить("ПланироватьЗатратыНаМатериалы");
	Результат.Добавить("ПланироватьДополнительныеЗатратыПоЗадаче");
	Результат.Добавить("ВедетсяБюджетДвиженияДенежныхСредств");
	Результат.Добавить("ХранитьВВерсияхПроцентыГотовСтатусыИФактСроки");
	
	Возврат Результат;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитов

#КонецОбласти

// Возвращает сроки проекта.
//
// Параметры:
//  пСсылкаНаПроект	 - СправочникСсылка.Проекты - проект.
//
// Возвращаемое значение:
//  Структура - структура с ключами:
//		* ДатаНачала - Дата - дата начала.
//		* ДатаЗавершения - Дата -дата завершения.
//
Функция ПолучитьСроки(пСсылкаНаПроект) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СрокиПЗ.ДатаНачалаПлан КАК Начало,
	               |	СрокиПЗ.ДатаЗавершенияПлан КАК Завершение
	               |ПОМЕСТИТЬ Сроки
	               |ИЗ
	               |	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК СрокиПЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО СрокиПЗ.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(Сроки.Начало) КАК ДатаНачала,
	               |	МАКСИМУМ(Сроки.Завершение) КАК ДатаЗавершения
	               |ИЗ
	               |	Сроки КАК Сроки";
	
	Запрос.УстановитьПараметр("Версия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(пСсылкаНаПроект));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	результат = Новый Структура("ДатаНачала, ДатаЗавершения");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(результат, Выборка);
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции

// Возвращает текущий рабочий календарь проекта
//
// Параметры:
//	ПроектСсылка - СправочникСсылка.Проекты - проект.
//
// Возвращаемое значение:
//	СправочникСсылка.упоРабочиеКалендари – рабочий календарь.
//
Функция ПолучитьРабочийКалендарь(ПроектСсылка) Экспорт

	// {PM}	
	Возврат упоПроектыИЗадачиСервер.ПолучитьКалендарьПроекта(ПроектСсылка);
	// {/PM}

КонецФункции

// Возвращает текущий статус проекта.
//
// Параметры:
//  Проект - СправочникСсылка.Проекты - ссылка на проект.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.упоСостояниеСтатусаПроекта – текущий статус проекта.
//
Функция ПолучитьСтатусПроекта(Проект) Экспорт
		
	Если Проект.Ссылка.Пустая() Тогда      
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Рег.СтатусПроекта
	               |ИЗ
	               |	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Статус = Результат.Выгрузить()[0].СтатусПроекта;
		Возврат Статус;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Возвращает текущего руководителя проекта.
//
// Параметры:
//	СсылкаНаПроект - СправочникСсылка.Проекты - проет, для которого надо получить текущего руководителя.
//
// Возвращаемое значение:
//   СправочникСсылка.упоСотрудники   – текущий руководитель.
//
Функция ПолучитьРуководителя(СсылкаНаПроект) Экспорт
	
	// {PM}	
	Возврат упоИерархияИПолномочияСервер.ПолучитьРуководителяПроекта(СсылкаНаПроект);
	// {/PM}
	
КонецФункции

// Функция - Обновляет предопределенные фазы проекта
//
// Параметры:
//  СсылкаНаПроект - СправочникСсылка.Проекты - Проект.
// 
Функция ОбновитьПредопределенныеФазы(СсылкаНаПроект)  Экспорт
	//УстановитьПривилегированныйРежим(Истина);
	//Запрос = Новый Запрос;
	//Запрос.Текст = "";
КонецФункции

// Возвращает недоступность указанных ролей 
// текущего пользователя для просмотра или редактирования Проекта.
//
// Возвращаемое значение:
//  Булево - Истина, если все указанные роли недоступны.
//
Функция ЕстьОграничениеРолейНаПросмотрРедактированиеПроектов() Экспорт
	
	МассивРазрешенныхРолей = Новый Массив;
	МассивРазрешенныхРолей.Добавить("ПолныеПрава");
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		МассивРазрешенныхРолей.Добавить("НастройкаНСИ");
	КонецЕсли;
	МассивРазрешенныхРолей.Добавить("упоЧтениеПроектов");
	МассивРазрешенныхРолей.Добавить("упоДобавлениеИзменениеПроектов");
	МассивРазрешенныхРолей.Добавить("упоТолькоПросмотр");
	
	Для каждого Элемент Из МассивРазрешенныхРолей Цикл
		Если РольДоступна(Элемент) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


// Получает контакты для документов взаимодействий согласно списку участников 
//
// Параметры:
//  Ссылка  - СправочникСсылка.Претензии - претензия по которой получаются контакты.
//
// Возвращаемое значение:
//   Массив   - массив, содержащий контакты.
//
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Возврат СделкиСервер.ПолучитьУчастниковПоТабличнойЧастиПредметаВзаимодействия(Ссылка);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)	
		
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") 
		И упоФункцииБСП.ПолучитьЗначениеРеквизита(Параметры.Ключ, "ЭтоПроектнаяЗадача") = Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ВыбраннаяФорма = "Документ.упоПроектнаяЗадача.ФормаОбъекта";
		Параметры.Вставить("Ключ", Параметры.Ключ.СсылкаНаПроектнуюЗадачу);
		
	ИначеЕсли ВидФормы = "ФормаОбъекта" И Параметры.Свойство("ЗначенияЗаполнения") И 
		ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") И Параметры.ЗначенияЗаполнения.Свойство("Родитель") Тогда
				
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Документ.упоПроектнаяЗадача.ФормаОбъекта";
		Параметры.Вставить("Основание", Параметры.ЗначенияЗаполнения.Родитель);
		Параметры.Вставить("РежимВыбораЗеркала", Истина);
		
	ИначеЕсли ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда
		
		// Принудительная косвенная установка параметров в случаях, когда невозможна прямая установка 
		// (при использовании промежуточного списка значений, например, в СКД при сравнении "ВСписке").
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Справочник.Проекты.Форма.упоФормаСпискаУправляемая";

		ЕстьПроект = Ложь;
		Если Параметры.Свойство("ТекущаяСтрока") Тогда
			Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("СправочникСсылка.Проекты") Тогда
				Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) И НЕ Параметры.ТекущаяСтрока.ЭтоПроектнаяЗадача Тогда
					ЕстьПроект = Истина;	
				КонецЕсли;
				// Открытие формы выбора из справочника ГруппыДоступа.ФормаЭлемента (список ограничений).
				Если Параметры.Свойство("ЭтоВыборЗначенияДоступа") Тогда
					ЕстьПроект = Истина;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		ВыборГруппИЭлементов = Неопределено;
		Параметры.Свойство("ВыборГруппИЭлементов", ВыборГруппИЭлементов);
		
		Если (Параметры.Свойство("ЭтоФормаВыбораПроектнойЗадачиКакПроекта") И Параметры.ЭтоФормаВыбораПроектнойЗадачиКакПроекта) 
			ИЛИ (Параметры.Свойство("ЭтоФормаВыбораПроектнойЗадачи") И Параметры.ЭтоФормаВыбораПроектнойЗадачи) Тогда
			
			// Оставляем как есть
			
		ИначеЕсли Параметры.Свойство("ЭтоФормаВыбораПроекта") 
			И (ЗначениеЗаполнено(Параметры.ЭтоФормаВыбораПроекта) И Параметры.ЭтоФормаВыбораПроекта) Тогда
			
			// Оставляем как есть
			
		ИначеЕсли ЕстьПроект Тогда
			
			Параметры.Вставить("ЭтоФормаВыбораПроекта", Истина);						
			
		ИначеЕсли ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы Тогда  
			
			// При открытии формы выбора проекта через Показать все, если у элемента
			// ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы, то открывается форма выбора ПЗ
			// Поэтому добавили отбор "ЭтоГруппа" для предотвращения подобной ситуации. Используется в 
			// модуле менеджера документа ЭкземплярБюджета
			Если Не (Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ЭтоГруппа") И Не Параметры.Отбор.ЭтоГруппа) Тогда
				
				Параметры.Вставить("ЭтоФормаВыбораПроектнойЗадачиКакПроекта", Истина);
				
			КонецЕсли;
			
		ИначеЕсли ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда
			
			Параметры.Вставить("ЭтоФормаВыбораПроекта", Истина);
			
		КонецЕсли;	
		
		// Принудительная установка возможности выбрать как элемент, так и группу посредством кнопки выбора.
		Если ВидФормы = "ФормаВыбора" 
				И Параметры.Свойство("ЭтоФормаВыбораПроекта") И Параметры.Свойство("ВыборГруппИЭлементов") Тогда
			
			ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
			
			Параметры.ВыборГруппИЭлементов = ВыборГруппИЭлементов;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ЭтоПроектнаяЗадача = Неопределено;
	
	ЕстьОтборЭтоПроектнаяЗадача = Параметры.Отбор.Свойство("ЭтоПроектнаяЗадача", ЭтоПроектнаяЗадача);
	Если ЭтоПроектнаяЗадача = Неопределено Тогда
		ЕстьОтборЭтоПроектнаяЗадача = Параметры.Свойство("ЭтоПроектнаяЗадача", ЭтоПроектнаяЗадача);
	КонецЕсли;
	
	Если ЕстьОтборЭтоПроектнаяЗадача Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметровПодбора = Новый Структура("СтрокаПоиска, ЭтоПроектнаяЗадача, КорневойПроект, ПроектИсключение", 
			Параметры.СтрокаПоиска,
			ЭтоПроектнаяЗадача);
		Если Параметры.Отбор.Свойство("упоКорневойПроект") Тогда
			СтруктураПараметровПодбора.Вставить("КорневойПроект", Параметры.Отбор.упоКорневойПроект);
		КонецЕсли;
		Если Параметры.Свойство("Проект") И Параметры.Свойство("ИсключитьПроект") Тогда
			СтруктураПараметровПодбора.Вставить("ПроектИсключение", Параметры.Проект);
		КонецЕсли;
		
		ПроектыДляВыбора = ПолучитьСписокПроектов(СтруктураПараметровПодбора.ЭтоПроектнаяЗадача, 
			СтруктураПараметровПодбора.КорневойПроект, 
			СтруктураПараметровПодбора.ПроектИсключение,
			СтруктураПараметровПодбора.СтрокаПоиска);
		
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.ЗагрузитьЗначения(ПроектыДляВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокПроектов(ЭтоПроектнаяЗадача = Ложь, КорневойПроект = Неопределено, ПроектИсключение = Неопределено, СтрокаПоиска = "")
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЭтоПроектнаяЗадача", ЭтоПроектнаяЗадача);
	Запрос.УстановитьПараметр("ОтборПоСтроке", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	Запрос.УстановитьПараметр("ОтборПоКорневомуПроекту", ЗначениеЗаполнено(КорневойПроект));
	Запрос.УстановитьПараметр("КорневойПроект", КорневойПроект);
	Запрос.УстановитьПараметр("ОтборПоПроектуИсключению", ЗначениеЗаполнено(ПроектИсключение));
	Запрос.УстановитьПараметр("ПроектИсключение", ПроектИсключение);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	               |	Проекты.Ссылка КАК Проект
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.ЭтоПроектнаяЗадача = &ЭтоПроектнаяЗадача
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоСтроке
	               |				ТОГДА Проекты.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоКорневомуПроекту
	               |				ТОГДА Проекты.упоКорневойПроект В (&КорневойПроект)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоПроектуИсключению
	               |				ТОГДА ВЫБОР
	               |						КОГДА Проекты.ЭтоПроектнаяЗадача
	               |							ТОГДА НЕ Проекты.упоКорневойПроект В (&ПроектИсключение)
	               |						ИНАЧЕ НЕ Проекты.Ссылка В (&ПроектИсключение)
	               |					КОНЕЦ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ Проекты.ПометкаУдаления
	               |	И НЕ Проекты.ЗадачаОтменена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Проекты.Представление";
						  
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");					  
	
КонецФункции

#КонецОбласти

//{{MRG[ <-> ]
#КонецЕсли
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//#КонецЕсли
//}}MRG[ <-> ]
