
#Область ПрограммныйИнтерфейс
 
// Получает структуру обязательных реквизитов.
//
// Параметры:
//  ИмяТабличнойЧасти	 - Строка, Неопределено	 - имя ТЧ.
// 
// Возвращаемое значение:
//  Структура - структура реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(ИмяТабличнойЧасти = Неопределено) Экспорт
	
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки.
			СтруктураОбязательныхПолей.Вставить("Наименование");				
		КонецЕсли;
	Иначе
		Если ИмяТабличнойЧасти = Неопределено Тогда
			// Формирование структуры обязательных реквизитов шапки.
			СтруктураОбязательныхПолей.Вставить("Наименование");
			Если упоВключитьПланРасходовВБДДС Тогда				
				СтруктураОбязательныхПолей.Вставить("упоСхемаОплатыПоУмолчаниюРасходы");				
			КонецЕсли;
			Если упоВключитьПланДоходовВБДДС Тогда
				СтруктураОбязательныхПолей.Вставить("упоСхемаОплатыПоУмолчаниюДоходы");				
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОбязательныхПолей;
	
КонецФункции

// Процедура проверяет заполнение обязательных реквизитов объекта.
// Если хотя бы один реквизит не заполнен, то выставляется флаг отказа от выполнения операции.
// 
// Параметры:
//  Отказ        - Булево - Признак отказа от выполнения операции.
// 
Процедура лмПроверитьЗаполнениеРеквизитов(Отказ) Экспорт
	// {PM}
	упоПроверкаЗаполненияВызовСервера.обПроверитьЗаполнениеРеквизитов(ЭтотОбъект, Отказ);
	// {/PM}
КонецПроцедуры

// Возвращает статус проекта (забирает из регистра)
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СостояниеСтатусаПроекта – текущий статус проекта.
//
Функция ПолучитьСтатусПроекта() Экспорт
	// {PM}
	Если ЭтоНовый() Тогда      
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Рег.СтатусПроекта
		|ИЗ
		|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК Рег";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Статус = Результат.Выгрузить()[0].СтатусПроекта;
		Возврат Статус;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	// {/PM}
КонецФункции

// Возвращает метод планирования проекта.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.упоМетодОперативногоПланирования - метод оперативного плаирования.
//
Функция ПолучитьМетодПланирования() Экспорт
	// {PM}
	Если ЭтоНовый() Тогда      
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегПр.МетодОперативногоПланирования
		|ИЗ
		|	РегистрСведений.упоКалендариПроектов.СрезПоследних(, Проект = &Проект) КАК РегПр";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Метод = Результат.Выгрузить()[0].МетодОперативногоПланирования;
		Возврат Метод;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	// {/PM}
КонецФункции

// Возвращает текущего руководителя проекта
//
// Возвращаемое значение:
//   Справочник.упоСотрудники   – текущий руководитель.
//
Функция ПолучитьРуководителя() Экспорт	
	// {PM}
	Возврат Справочники.Проекты.ПолучитьРуководителя(Ссылка);
	// {/PM}	
КонецФункции

// Возвращает текущий рабочий календарь проекта
//
// Возвращаемое значение:
//   СправочникСсылка.упоРабочиеКалендари – рабочий календарь.
//
Функция ПолучитьРабочийКалендарь() Экспорт
	// {PM}	
	Возврат Справочники.Проекты.ПолучитьРабочийКалендарь(Ссылка);
	// {/PM}
КонецФункции

// Устанавливает договору значение основного договора контрагента
//
// Параметры
//	Контрагент 	– СправочникСсылка.Контрагенты – Контрагент
//	Договор  	– СправочникСсылка.ДоговорыКонтрагента – Договор.
//
Процедура УстановитьОснДоговор(Контрагент,Договор)  Экспорт
	// {PM}
	Договор  = Контрагент.упоОсновнойДоговорКонтрагента;
	// {/PM}
КонецПроцедуры
 
// Функция возвращает доступные варианты печати документа, обрабатываемые в модуле объекта.
// 
// Возвращаемое значение: 
//  Структура - каждая строка которой соответствует одному из вариантов печати.
// 
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт 
	// {PM}
	Возврат Новый Структура();
	// {/PM}
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	// {PM}	
	упоОбработчикиСобытийСервер.ОбъектПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	// {/PM}	
КонецПроцедуры
 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	// {PM}	
	упоОбработчикиСобытийСервер.ОбъектОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	// {/PM}	
КонецПроцедуры
 
Процедура ПередУдалением(Отказ)	
	// {PM}	
	упоОбработчикиСобытийСервер.ОбъектПередУдалением(ЭтотОбъект, Отказ);
	// {/PM}	
КонецПроцедуры

#КонецЕсли

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	// {PM}
	упоЗаполнитьКорневойПроектПроекта();
	упоЗакрытиеЭтапа.ПроверкаПередЗаписью_ПроектыПередЗаписью(ЭтотОбъект, Отказ);
	упоОбработчикиСобытийСервер.ОбъектПередЗаписью(ЭтотОбъект, Отказ);
	// {/PM}
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Завершен = Ложь;
	ПлановаяДатаНачала = ТекущаяДатаСеанса();
	ПлановаяДатаОкончания = Дата(1,1,1);
	ДатаНачала = ТекущаяДатаСеанса();
	ПлановаяДатаОкончания = Дата(1,1,1);
	
	// {PM}
	упоОбработчикиСобытийСервер.ОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	// {/PM}
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.УстановитьПризнакАктивен(Ссылка, (НЕ Завершен) И (Не ПометкаУдаления));
	
	// {PM}
	упоОбработчикиСобытийСервер.ОбъектПриЗаписи(ЭтотОбъект, Отказ);
	упоОграниченияДоступаПоПроектам.упоДобавлениеВОчередьПересчетаОграниченийДоступаПоПроектамПриЗаписи(ЭтотОбъект,
		Отказ);
	// {/PM}
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// {PM}
	упоОбработчикиСобытийСервер.ОбъектОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	//{/PM}
	
	Если ЗначениеЗаполнено(ПлановаяДатаОкончания)
		И ПлановаяДатаНачала > ПлановаяДатаОкончания Тогда
		
		ТекстСообщения = НСтр("ru = 'Плановая дата окончания не должна быть меньше плановой даты начала.';
								|en = 'Planned end date cannot be less than planned start date.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		                                                  ЭтотОбъект,
		                                                  "ПлановаяДатаОкончания",
		                                                  ,
		                                                  Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания)
		И ДатаНачала > ДатаОкончания Тогда
		
		ТекстСообщения = НСтр("ru = 'Дата окончания не должна быть меньше даты начала.';
								|en = 'End date cannot be earlier than the start date.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		                                                  ЭтотОбъект,
		                                                  "ДатаОкончания",
		                                                  ,
		                                                  Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЭтоПроектнаяЗадача Тогда
		СтрокаТаб = Таблица.Добавить();
		СтрокаТаб.ЗначениеДоступа = Ссылка;
	Иначе
		СтрокаТаб = Таблица.Добавить();
		СтрокаТаб.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступЗапрещен;
	КонецЕсли;
		
КонецПроцедуры

// Заполнение реквизита упоКорневойПроект для проектов. Выполняется в целях сокращения ключей доступа 
// (см. Справочники.Проекты.ПриЗаполненииОграниченияДоступа).
//
Процедура упоЗаполнитьКорневойПроектПроекта()
	
	// Для задач значение заполняется в объектах задач.
	Если ЭтоПроектнаяЗадача Тогда
		Возврат;
	КонецЕсли;
	
	// Перезапись проекта.
	Если ЗначениеЗаполнено(упоКорневойПроект) 
		И упоКорневойПроект = Ссылка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		УИД = Новый УникальныйИдентификатор;
		СсылкаНаТекОбъект = Справочники.Проекты.ПолучитьСсылку(УИД);
		УстановитьСсылкуНового(СсылкаНаТекОбъект);
	Иначе
		СсылкаНаТекОбъект = Ссылка;
	КонецЕсли;
	
	упоКорневойПроект = СсылкаНаТекОбъект; 
	
КонецПроцедуры

#КонецОбласти