////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с подбором.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет табличную часть документа по заданному запросу.
//
// Параметры:
//  Форма             	– Форма 				- форма документа.
//  Объект            	– ДокументОбъект 		- собственно документ.
//  ТабличнаяЧасть    	– ТабличнаяЧасть 		- табличная часть документа.
//  ПравилаЗаполнения 	- Структура 			- правила и настройки процедуры заполнения.
//	ОбработкаОповещения - Описание оповещения	- Описание оповещения - Содержит имя процедуры,
//												которая должна быть выполнена после выбора варианта ответа.
//
// Возвращаемое значение:
//	Булево - результат выполнения операции.
//

// Заполняет табличную часть документа по заданному запросу.
//
// Параметры:
//  Форма				 - УправляемаяФорма - форма документа.
//  Объект				 - Документобъект	 - заполняемый документ.
//  ИмяТЧ				 - Строка
//  ДанныеТЧ			 - ДанныеФормыКоллекция
//  Подтверждение		 - Булево
//  ПравилаЗаполнения	 - Структура - правила и настройки процедуры заполнения.
//  ОбработкаОповещения	 - 			 - Описание оповещения	- Описание оповещения - Содержит имя процедуры,
//  			которая должна быть выполнена после выбора варианта ответа.
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция НадоЗаполнятьТабличнуюЧастьДокумента(Форма,
											 Объект,
											 ИмяТЧ,
											 ДанныеТЧ,
											 Подтверждение = Истина,
											 ПравилаЗаполнения = Неопределено,
											 ОбработкаОповещения) Экспорт
	
	// Проверяем заполнение необходимых реквизитов шапки объекта для выполнения операции.
	СтрокаСообщений = НСтр("ru = 'Операция ""Заполнить"" не выполнена: '");
	Результат = упоПроверкаЗаполненияКлиент.ПроверитьЗаполнениеПолейШапки(Объект, ИмяТЧ, СтрокаСообщений);
		
	Если Результат = Ложь Тогда
		упоРаботаСДиалогамиКлиент.упоПредупреждение(СтрокаСообщений);
		Возврат Ложь;
	КонецЕсли;
	
	Контекст = Новый Структура("СледующееОповещение", ОбработкаОповещения);
	
	// Подтверждаем у пользователя разрешение на выполнение операции, если оно требуется.
	Если Подтверждение = Истина И ДанныеТЧ.Количество() > 0 Тогда
   		ОписаниеОповещения = Новый ОписаниеОповещения("НадоЗаполнятьТабличнуюЧастьДокументаЗавершение", ЭтотОбъект, Контекст);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Перед заполнением табличная часть будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		НадоЗаполнятьТабличнуюЧастьДокументаЗавершение(КодВозвратаДиалога.Да, Контекст);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Обработчик завершения заполнения табличной часть документа.
//
// Параметры:
//  Результат				 - КодВозвратаДиалога	 - ответ.
//  ДополнительныеПараметры	 - Структура	 		 - структура дополнительных параметров.
//
Процедура НадоЗаполнятьТабличнуюЧастьДокументаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		НадоЗаполнять = Ложь;
	Иначе
		НадоЗаполнять = Истина;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.СледующееОповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.СледующееОповещение, НадоЗаполнять);
	КонецЕсли;	
	
КонецПроцедуры

// Возвращает единицу измерения номенклатуры по умолчанию.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
// 
// Возвращаемое значение:
//  СправочникСсылка.упоЕдиницыИЗмерения
//
Функция ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура) Экспорт

	ЕдиницаИзмерения = упоЗаполнениеИПодборСервер.ПолучитьЕдиницуИзмеренияНоменклатуры(Номенклатура);
	
	Возврат ЕдиницаИзмерения;

КонецФункции

#КонецОбласти