
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Если Не ДополнительныеСвойства.Свойство("ПринудительноеОбновление") Тогда
			Отказ = Истина;
			упоФункцииОбщегоНазначенияКлиентСервер.Исключение_ЭтоОбъектДругойКонфигурации();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	упоФункцииБСП.УстановитьИспользованиеНабораСвойств("Документ_упоРасчетЦеныКонтракта", Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли