////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции панели показателей.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму выбора поля, передавая в нее параметры.
//
// Параметры:
//  Форма				 - УправляемаяФорма - форма-владелец.
//  Элемент				 - Произвольный - не используется.
//  Отказ				 - Булево - признак отказа от выполнения стандартной операции.
//  Копирование			 - Произвольный - не используется.
//  Родитель			 - Произвольный - не используется.
//  Группа				 - Произвольный - не используется.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек.
//
Процедура ГруппировкаПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа,
	КомпоновщикНастроек) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("Событие"        , "Добавление");
	ПараметрыФормы.Вставить("ИсключенныеПоля", Форма.ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ПараметрыФормы.Вставить("ИсточникИД"  , Форма.УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
	
	Отказ = Истина;
	
КонецПроцедуры

// Добавляет в ТЧ строку с выбранным полем группировки.
//
// Параметры:
//  РезультатЗакрытия		 - Произвольный, Структура - данные выбранного поля.
//  ДополнительныеПараметры	 - Произвольный - не используется.
//  ТЧ						 - ДанныеФормыКоллекция - ТЧ, куда добавляется строка.
//
Процедура ГруппировкаПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры, ТЧ) Экспорт
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму выбора поля, передавая в нее параметры.
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - форма-владелец.
//  Элемент				 - Произвольный - не используется.
//  Отказ				 - Булево - признак отказа от выполнения стандартной операции.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек.
Процедура ГруппировкаПередНачаломИзменения(Форма, Элемент, Отказ, КомпоновщикНастроек) Экспорт
	
	Если Элемент.ТекущийЭлемент = Форма.Элементы.ГруппировкаПредставление Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
		ПараметрыФормы.Вставить("Режим"          , "Группировка");
		ПараметрыФормы.Вставить("Событие"        , "Изменение");
		ПараметрыФормы.Вставить("ИсключенныеПоля", Форма.ПолучитьЗапрещенныеПоля("Группировка"));
		ПараметрыФормы.Вставить("ТекущаяСтрока"  , Элемент.ТекущиеДанные.Поле);
		ПараметрыФормы.Вставить("ИсточникИД"  , Форма.УникальныйИдентификатор);
		
		ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, возникающий при завершении изменения.
//
// Параметры:
//  РезультатЗакрытия		 - Произвольный - результат работы с формой упоФормаВыбораДоступногоПоля.
//  ДополнительныеПараметры	 - Произвольный - не используется.
//  Элемент					 - Произвольный - ЭУ формы, для которого вызван обработчик.
Процедура ГруппировкаПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры, Элемент) Экспорт
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
		НоваяСтрока = Элемент.ТекущиеДанные;
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед началом добавления.
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - форма, из которой вызван обработчик.
//  Элемент				 - Произвольный - ЭУ, для которого вызван обработчик.
//  Отказ				 - Булево - признак стандартной обработки.
//  Копирование			 - Произвольный - не используется.
//  Родитель			 - Произвольный - не используется.
//  Группа				 - Произвольный - не используется.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД.
Процедура ОтборыПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа,
	КомпоновщикНастроек) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КомпоновщикНастроек"  , КомпоновщикНастроек);
	ПараметрыФормы.Вставить("Режим"                , "Отбор");
	ПараметрыФормы.Вставить("Событие"         	   , "Добавление");
	ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.ПолучитьЗапрещенныеПоля("Отбор"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"        , Неопределено);
	ПараметрыФормы.Вставить("ИсточникИД"  		   , Форма.УникальныйИдентификатор);
		
	ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
	
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события, вызываемый при окончании обавления.
//
// Параметры:
//	РезультатЗакрытия		 - Произвольный - результат работы с формой упоФормаВыбораДоступногоПоля.
//  ДополнительныеПараметры	 - Произвольный - не используется.
//  Элемент					 - Произвольный - ЭУ формы, для которого вызван обработчик.
Процедура ОтборыПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры, Элемент) Экспорт
	
	КомпоновщикНастроек =   ДополнительныеПараметры.КомпоновщикНастроек;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
		
		Если Элемент.ТекущаяСтрока = Неопределено Тогда
			ТекущаяСтрока = Неопределено;
		Иначе
			ТекущаяСтрока = КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		КонецЕсли;
		
		Если ТипЗнч(ТекущаяСтрока) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЭлементОтбора = ТекущаяСтрока.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ИначеЕсли ТипЗнч(ТекущаяСтрока) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ТекущаяСтрока.Родитель <> Неопределено Тогда
				ЭлементОтбора = ТекущаяСтрока.Родитель.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Иначе
				ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			КонецЕсли;
		Иначе
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;
		
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		
		ЭлементОтбора.ВидСравнения = ПараметрыВыбранногоПоля.ВидСравнения;
		
		Элемент.ТекущаяСтрока = КомпоновщикНастроек.Настройки.Отбор.ПолучитьИдентификаторПоОбъекту(ЭлементОтбора);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед началом изменения.
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - форма-владелец.
//  Элемент				 - Произвольный - не используется.
//  Отказ				 - Булево - признак отказа от выполнения стандартной операции.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек. 
Процедура ОтборыПередНачаломИзменения(Форма, Элемент, Отказ, КомпоновщикНастроек) Экспорт
	
	Если (Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 И ТипЗнч(Элемент.ТекущиеДанные.ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных")) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КомпоновщикНастроек"  , КомпоновщикНастроек);
		ПараметрыФормы.Вставить("Режим"                , "Отбор");
		ПараметрыФормы.Вставить("Событие"              , "Изменение");
		ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.ПолучитьЗапрещенныеПоля("Отбор"));
		ПараметрыФормы.Вставить("ТекущаяСтрока"        , Элемент.ТекущиеДанные.ЛевоеЗначение);
		ПараметрыФормы.Вставить("ИсточникИД"  		   , Форма.УникальныйИдентификатор);
				
		ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
		
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик события, вызываемый при окончании изменения.
//
// Параметры:
//  РезультатЗакрытия		 - Произвольный - результат работы с формой упоФормаВыбораДоступногоПоля.
//  ДополнительныеПараметры	 - Произвольный - не используется.
//  Элемент					 - Произвольный - ЭУ формы, для которого вызван обработчик.
Процедура ОтборыПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры, Элемент) Экспорт
	
	КомпоновщикНастроек = ДополнительныеПараметры.КомпоновщикНастроек;
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
		
		ТекущаяСтрока = КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		
		Если Найти(Элемент.ТекущийЭлемент.Имя, "ОтборыЛевоеЗначение") > 0 Тогда 
			ТекущаяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед началом добавления.
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - форма, из которой вызван обработчик.
//  Элемент				 - Произвольный - ЭУ, для которого вызван обработчик.
//  Отказ				 - Булево - признак стандартной обработки.
//  Копирование			 - Произвольный - не используется.
//  Родитель			 - Произвольный - не используется.
//  Группа				 - Произвольный - не используется.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД.
Процедура ДополнительныеПоляПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа,
	КомпоновщикНастроек) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КомпоновщикНастроек"  , КомпоновщикНастроек);
	ПараметрыФормы.Вставить("Режим"                , "Выбор");
	ПараметрыФормы.Вставить("Событие"         	   , "Добавление");
	ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.ПолучитьЗапрещенныеПоля("Выбор"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"        , Неопределено);
	ПараметрыФормы.Вставить("ИсточникИД"  		   , Форма.УникальныйИдентификатор);
		
	ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
	
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события, вызываемый при завершении добавления.
//
// Параметры:
//	РезультатЗакрытия		 - Произвольный - результат работы с формой упоФормаВыбораДоступногоПоля.
//  ДополнительныеПараметры	 - Произвольный - не используется.
//  ТЧ						 - ДанныеФормыКоллекция - ТЧ, куда добавляется строка.
Процедура ДополнительныеПоляПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры, ТЧ) Экспорт
	
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед началом изменения.
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - форма, из которой вызван обработчик.
//  Элемент				 - Произвольный - ЭУ, для которого вызван обработчик.
//  Отказ				 - Булево - признак стандартной обработки.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД.
Процедура ДополнительныеПоляПередНачаломИзменения(Форма, Элемент, Отказ, КомпоновщикНастроек) Экспорт
	
	Если Элемент.ТекущийЭлемент = Форма.Элементы.ДополнительныеПоляПредставление Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
		ПараметрыФормы.Вставить("Режим"                , "Выбор");
		ПараметрыФормы.Вставить("Событие"         	   , "Изменение");
		ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.ПолучитьЗапрещенныеПоля("Выбор"));
		ПараметрыФормы.Вставить("ТекущаяСтрока"        , Элемент.ТекущиеДанные.Поле);
		ПараметрыФормы.Вставить("ИсточникИД"  		   , Форма.УникальныйИдентификатор);
		
		ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед завершением изменения.
//
// Параметры:
//  РезультатЗакрытия		 - Произвольный - результат работы с формой упоФормаВыбораДоступногоПоля.
//  ДополнительныеПараметры	 - Произвольный - не используется.
//  Элемент					 - Произвольный - ЭУ формы, для которого вызван обработчик.
Процедура ДополнительныеПоляПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры,
	Элемент) Экспорт
		
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
		НоваяСтрока = Элемент.ТекущиеДанные;
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.Поле          = ПараметрыВыбранногоПоля.Поле;
		НоваяСтрока.Представление = ПараметрыВыбранногоПоля.Заголовок;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед началом добавления
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - форма, из которой вызван обработчик.
//  Элемент				 - Произвольный - ЭУ, для которого вызван обработчик.
//  Отказ				 - Булево - признак стандартной обработки.
//  Копирование			 - Произвольный - не используется.
//  Родитель			 - Произвольный - не используется.
//  Группа				 - Произвольный - не используется.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД.
Процедура СортировкаПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа,
	КомпоновщикНастроек) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КомпоновщикНастроек"  , КомпоновщикНастроек);
	ПараметрыФормы.Вставить("Режим"                , "Порядок");
	ПараметрыФормы.Вставить("Событие"         	   , "Добавление");
	ПараметрыФормы.Вставить("ИсключенныеПоля"      , Форма.ПолучитьЗапрещенныеПоля("Порядок"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"        , Неопределено);
	ПараметрыФормы.Вставить("ИсточникИД"  		   , Форма.УникальныйИдентификатор);
	
	ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
	
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события, вызываемый перед завершением добавления.
//
// Параметры:
//  РезультатЗакрытия		 - Произвольный - результат работы с формой упоФормаВыбораДоступногоПоля.
//  ДополнительныеПараметры	 - ДинамическийСписок - динамический список, из которого берутся параметры.
Процедура СортировкаПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		НоваяСтрока = ДополнительныеПараметры.КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		НоваяСтрока.Использование     = Истина;
		НоваяСтрока.Поле              = Новый ПолеКомпоновкиДанных(РезультатЗакрытия.Поле);
		НоваяСтрока.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед началом изменения.
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - форма, из которой вызван обработчик.
//  Элемент				 - Произвольный - ЭУ, для которого вызван обработчик.
//  Отказ				 - Булево - признак стандартной обработки.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД.
Процедура СортировкаПередНачаломИзменения(Форма, Элемент, Отказ, КомпоновщикНастроек) Экспорт
	
	Если Найти(Элемент.ТекущийЭлемент.Имя, "СортировкаПоле") = 1 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
		ПараметрыФормы.Вставить("Режим"          , "Порядок");
		ПараметрыФормы.Вставить("Событие"        , "Изменение");
		ПараметрыФормы.Вставить("ИсключенныеПоля", Форма.ПолучитьЗапрещенныеПоля("Порядок"));
		ПараметрыФормы.Вставить("ТекущаяСтрока"  , Элемент.ТекущиеДанные.Поле);
		ПараметрыФормы.Вставить("ИсточникИД"  		   , Форма.УникальныйИдентификатор);
		
		ОткрытьФорму("ОбщаяФорма.упоФормаВыбораДоступногоПоля", ПараметрыФормы);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события, вызываемый перед заверешением изменения.
//
// Параметры:
//  РезультатЗакрытия		 - Произвольный - результат работы с формой упоФормаВыбораДоступногоПоля.
//  ДополнительныеПараметры	 - ДинамическийСписок - динамический список, из которого берутся параметры.
//  Элемент					 - Произвольный - ЭУ формы, для которого вызван обработчик.
Процедура СортировкаПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДополнительныеПараметры, Элемент) Экспорт
		
	ПараметрыВыбранногоПоля = РезультатЗакрытия;
	
	Если ТипЗнч(ПараметрыВыбранногоПоля) = Тип("Структура") Тогда
		РедактируемаяСтрока = ДополнительныеПараметры.КомпоновщикНастроек.Настройки.Порядок.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
		
		РедактируемаяСтрока.Использование = Истина;
		РедактируемаяСтрока.Поле = Новый ПолеКомпоновкиДанных(ПараметрыВыбранногоПоля.Поле);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет поля ресурсов в список запрещенных полей.
//
// Параметры:
//  Форма				 - УправляемаяФорма, Форма - произвольный, не используется.
//  СписокПолей			 - СписокЗначений - список полей.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД.
Процедура ДобавитьПоляРесурсовВЗапрещенныеПоля(Форма, СписокПолей, КомпоновщикНастроек) Экспорт
	
	Для Каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы Цикл
		Если ДоступноеПоле.Ресурс Тогда
			СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// Заполняет группировку.
//
// Параметры:
//  ПолеВыбраннойГруппировки - ПолеКомпоновкиДанных - поле группировки.
//  Группировка				 - ГруппировкаКомпоновкиДанных - группировка.
Процедура ЗаполнитьГруппировку(ПолеВыбраннойГруппировки, Группировка) Экспорт
	
	ПолеГруппировки = Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование  = Истина;
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
	Если ПолеВыбраннойГруппировки.ТипГруппировки = 1 Тогда
		ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
	ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = 2 Тогда
		ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
	Иначе
		ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	КонецЕсли;
	Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
КонецПроцедуры

// Добавляет группировки в компоновщик.
//
// Параметры:
//  ПараметрыОтчета		 - Произвольный - параметры отчета.
//  КомпоновщикНастроек	 - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек СКД, в настройки которого 
//							добавляются группировки.
Процедура ДобавитьГруппировки(ПараметрыОтчета, КомпоновщикНастроек) Экспорт
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		СтруктураНастроек = КомпоновщикНастроек.Настройки.Структура;
	Иначе
		СтруктураНастроек = КомпоновщикНастроек;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураНастроек Цикл
		Группировка = ЭлементСтруктуры;
		Если Группировка.Имя = "Группировка" Тогда // Заполнить все поля группировки
			
			Если ТипЗнч(Группировка) = Тип("ГруппировкаКомпоновкиДанных") Тогда
				Родитель = Группировка.Родитель;
				ПерваяГруппировка = Истина;
				Индекс = Родитель.Структура.Индекс(Группировка);
				Родитель.Структура.Удалить(Группировка);
				Для Каждого ПолеВыбраннойГруппировки Из ПараметрыОтчета.Группировка Цикл 
					Если ПолеВыбраннойГруппировки.Использование Тогда
						Если ПерваяГруппировка Тогда
							Группировка = Родитель.Структура.Вставить(Индекс, Тип("ГруппировкаКомпоновкиДанных"));
							ПерваяГруппировка = Ложь;
						Иначе
							Группировка = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
						КонецЕсли;
						
						ПолеГруппировки = Группировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
						ПолеГруппировки.Использование  = Истина;
						ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных(ПолеВыбраннойГруппировки.Поле);
						Если ПолеВыбраннойГруппировки.ТипГруппировки = 1 Тогда
							ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
						ИначеЕсли ПолеВыбраннойГруппировки.ТипГруппировки = 2 Тогда
							ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
						Иначе
							ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
						КонецЕсли;
						Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
						Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

#Область НастройкаПоказателейДляКарточкиПроектов

// Вызывается при начале выбора настройки показателей для карточек проекта.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма	 - источник.
//  Элемент				 - ЭлементФормы		 - Элемент формы.
//  ДанныеВыбора		 - ДанныеВыбора		 - Данные выбора.
//  СтандартнаяОбработка - Булево			 - Признак стандартной обработки.
//  ВладелецФорма		 - УправляемаяФорма	 - форма-владелец.
//
Процедура упоНастройкаПоказателейДляКарточкиПроектовНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ВладелецФорма = Истина) Экспорт
	
	НастройкаПоказателейНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ВладелецФорма);
	
КонецПроцедуры

// Вызывается при начале выбора настройки показателей
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма - источник.
//  Элемент				 - ЭлементФормы - Элемент формы.
//  ДанныеВыбора		 - ДанныеВыбора		 - Данные выбора.
//  СтандартнаяОбработка - Булево - Признак стандартной обработки.
//  ВладелецФорма		 - УправляемаяФорма - форма-владелец.
//
Процедура НастройкаПоказателейНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ВладелецФорма = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ВладелецФорма Тогда
		Владелец = ЭтаФорма;
	Иначе
		Владелец = Элемент;
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура("ВозвращатьКлючНастройки", Истина);
	ОткрытьФорму("Обработка.упоПанельПоказателей.Форма.ФормаЗагрузкиНастройки", ПараметрыОткрытияФормы, Владелец);
	
КонецПроцедуры

// Вызывается при очистке настройки показателей для карточек проекта.
//
// Параметры:
//  ЭтаФорма	 - Форма-источник.
//  Элемент		 - Элемент формы.
//  СтандартнаяОбработка	 - Признак стандартной обработки.
//
Процедура упоНастройкаПоказателейДляКарточкиПроектовОчистка(ЭтаФорма, Элемент, СтандартнаяОбработка) Экспорт
	
	НастройкаПоказателейОчистка(ЭтаФорма, 
								Элемент, 
								СтандартнаяОбработка,
								"упоНастройкаПоказателейДляКарточкиПроектовНастройка",
								"упоНастройкаПоказателейДляКарточкиПроектов");
	
КонецПроцедуры

// Вызывается при очистке настройки показателей
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма	 - Форма-источник.
//  Элемент				 - ЭлементФормы		 - Элемент формы.
//  СтандартнаяОбработка - Булево			 - Признак стандартной обработки.
//  ПолеНастройки		 - Строка
//  ПолеПредставления	 - Строка
//
Процедура НастройкаПоказателейОчистка(ЭтаФорма, Элемент, СтандартнаяОбработка, ПолеНастройки, ПолеПредставления) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма[ПолеНастройки] = Неопределено;
	упоПанельПоказателейКлиентСервер.СформироватьПредставлениеНастройкиПоказателей(ЭтаФорма,
																				ПолеНастройки,
																				ПолеПредставления);
	
КонецПроцедуры

// Вызывается при выборе настройки показателей для карточек проекта.
//
// Параметры:
//  ЭтаФорма	 - Форма-источник.
//  ВыбранноеЗначение		 - Выбранное значение.
//  ИсточникВыбора	 - Источник выбора.
//
Процедура упоНастройкаПоказателейДляКарточкиПроектовОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора = Неопределено) Экспорт
	
	НастройкаПоказателейОбработкаВыбора(ЭтаФорма, 
										ВыбранноеЗначение,
										"упоНастройкаПоказателейДляКарточкиПроектовНастройка",
										"упоНастройкаПоказателейДляКарточкиПроектов");

КонецПроцедуры

// Вызывается при выборе настройки показателей.
//
// Параметры:
//  ЭтаФорма			 - УправляемаяФорма	 - Форма-источник.
//  ВыбранноеЗначение	 - Произвольный		 - Выбранное значение.
//  ПолеНастройки		 - Строка
//  ПолеПредставления	 - Строка
//
Процедура НастройкаПоказателейОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ПолеНастройки, ПолеПредставления) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("Источник") И ВыбранноеЗначение.Источник = "ЗагрузкаНастройкиПанелиПоказателей" Тогда
			ЭтаФорма[ПолеНастройки] = ВыбранноеЗначение;
			упоПанельПоказателейКлиентСервер.СформироватьПредставлениеНастройкиПоказателей(ЭтаФорма, ПолеНастройки ,ПолеПредставления);			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти