
&НаСервере
Процедура ИКТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ИКТ_RequestСерверПривилегированный.ИКТ_ДобавитьЭлементыСостоянияРеквестНаФорму(ЭтаФорма, , Элементы.ГруппаСообщенияОНевозможностиИзмененияДокумента); 
	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере(); 
	
	ИКТ_ДобавлениеИзменениеРеквизитовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИКТ_ПриОткрытииПосле(Отказ)
	ПодключитьОбработчикОжидания("ИКТ_ОбновитьСостояниеОбменаСРеквест", 60, Ложь);
КонецПроцедуры

#Область ДоработкиЛС

&НаКлиенте
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквест()
	
	ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ОбновитьСостояниеОбменаСРеквестНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Объект.Организация.ИКТ_УУ Тогда
			
			Результат = ИКТ_RequestСерверПривилегированный.ПолучитьСоостояниеОбменаСРеквестПоОбъекту(Объект.Ссылка);
			
			Если Не ЗначениеЗаполнено(Результат.Период) Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Не выполнялся";
				
			ИначеЕсли Результат.Ошибка = Ложь и Результат.Выгружен = Ложь Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Объект в очереди на выгрузку";  
				
			ИначеЕсли Результат.Ошибка = Истина Тогда
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = СтрШаблон("Ошибка обмена. Дата выгрузки %1", Результат.Период);
				
			Иначе 
				
				ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен выполнен";
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ИКТ_СостояниеОбменаRequest = "Обмен будет выполнен после записи объекта";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИКТ_ДобавлениеИзменениеРеквизитовФормы()
		
	НовыйЭлемент = Элементы.Добавить("ID_ДолжностьS", Тип("ПолеФормы"), Элементы.ПодразделениеДолжностьГруппа);
	НовыйЭлемент.Заголовок = "ID ДолжностьS";
	НовыйЭлемент.ПутьКДанным = "Объект.Позиции.ID_ДолжностьS";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры


#КонецОбласти