////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с формами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает дату периода, зашиврованную в имени программного элемента.
// 
// Параметры:
//  ЭлементСпискаПрограммноИмя - Строка - имя программного элемента.
// 
// Возвращаемое значение:
//  Дата - период.
// 
Функция ПолучитьЗашифрованныйПериод(Знач ЭлементСпискаПрограммноИмя) Экспорт
	
	// "Группа_РаспределениеОбъемов_Март_2014"
	Если Найти(ЭлементСпискаПрограммноИмя, "Группа_РаспределениеОбъемов_") > 0 Тогда
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Группа_РаспределениеОбъемов_", "");
	ИначеЕсли  Найти(ЭлементСпискаПрограммноИмя, "Группа_РаспределениеПотребностей_") > 0 Тогда
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Группа_РаспределениеПотребностей_", "");	
	ИначеЕсли  Найти(ЭлементСпискаПрограммноИмя, "Сумма_РаспределениеДополнительныхЗатрат_") > 0 Тогда
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Сумма_РаспределениеДополнительныхЗатрат_", "");	
	ИначеЕсли  Найти(ЭлементСпискаПрограммноИмя, "Сумма_РаспределениеРасходов_") > 0 Тогда
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Сумма_РаспределениеРасходов_", "");	
	ИначеЕсли  Найти(ЭлементСпискаПрограммноИмя, "Сумма_РаспределениеДоходов_") > 0 Тогда
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Сумма_РаспределениеДоходов_", "");
	ИначеЕсли  Найти(ЭлементСпискаПрограммноИмя, "Группа_ТрудовыеРесурсы_") > 0 Тогда
		ЭлементСпискаПрограммноИмя = СтрЗаменить(ЭлементСпискаПрограммноИмя,"Группа_ТрудовыеРесурсы_", "");
	КонецЕсли;
	
	Позиция_ = Найти(ЭлементСпискаПрограммноИмя, "_");
	
	ПодстрокаМесяц = Лев(ЭлементСпискаПрограммноИмя, Позиция_);
	ПодстрокаГод = СтрЗаменить(ЭлементСпискаПрограммноИмя,  ПодстрокаМесяц, "");
	
	ПодстрокаМесяц = СтрЗаменить(ПодстрокаМесяц, "_", "");	  
	МесяцЧислом = Число(ПодстрокаМесяц);
	ГодЧислом = Число(ПодстрокаГод);
	
	ЗашифрованныйПериод = КонецМесяца(Дата(ГодЧислом, МесяцЧислом, 1));
	
	Возврат ЗашифрованныйПериод;
	
КонецФункции

// Возвращает источник плана БДР по имени исходной таблицы.
//
// Параметры:
//  ТаблицаИсточник	 - Строка	 - имя исходной таблицы.
//  ТаблицаПриемник	 - Строка	 - имя таблицы-приемника.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.упоИсточникПланаДоходовИРасходов - источник плана.
//
Функция ИсточникПланаПоТаблице(ТаблицаИсточник, ТаблицаПриемник = "") Экспорт
	
	ТаблицаИсточникМатЗатраты = ТаблицаИсточник = "МатериальныеРесурсы" 
		Или ТаблицаИсточник = "РаспределениеПотребностей" Или ТаблицаИсточник = "МатериальныеРесурсыПоПодразделениям";
	ТаблицаИсточникСубпродукты = ТаблицаИсточник = "Субпродукты" 
		Или ТаблицаИсточник = "РаспределениеОбъемов" Или ТаблицаИсточник = "СубпродуктыПоПодразделениям";
	ТаблицаИсточникТрудозатраты = ТаблицаИсточник = "ТрудовыеРесурсыРоли" Или ТаблицаИсточник = "ТрудовыеРесурсы";
	ТаблицаПриемникТрудозатраты = ТаблицаПриемник = "ТрудовыеРесурсыРоли" Или ТаблицаПриемник = "ТрудовыеРесурсы";
	ТаблицаИсточникДопзатраты = ТаблицаИсточник = "ДополнительныеЗатраты" 
		Или ТаблицаИсточник = "РаспределениеДополнительныхЗатрат";
		
	Если ТаблицаИсточникДопзатраты Тогда
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты");
	ИначеЕсли ТаблицаИсточникМатЗатраты Тогда
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты");
	ИначеЕсли ТаблицаИсточникСубпродукты Тогда
		Если ТаблицаПриемникТрудозатраты Тогда
			ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаТрудозатратРолей.Объемы");
		Иначе
			ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.Объемы");
		КонецЕсли;
	ИначеЕсли ТаблицаИсточникТрудозатраты Тогда
		Если ТаблицаПриемникТрудозатраты Тогда
			ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаТрудозатратРолей.Трудозатраты");
		Иначе
			ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты");
		КонецЕсли;
	ИначеЕсли ТаблицаИсточник = "ДвиженияДенежныхСредств" Тогда
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДДС.ДДС");
	Иначе 
		ИсточникПлана = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.ДоходыРасходы");
	КонецЕсли;
	
	Возврат ИсточникПлана;
	
КонецФункции

// Проверяет, является ли строка таблицы строкой трансляции.
//
// Параметры:
//  ПроверяемаяСтрока	 - ДанныеФормыЭлементКоллекции	 - строка-владелец данных заполнения.
//  ИмяТаблицы			 - Строка
//  ИсточникТаблицы		 - упоИсточникПланаДДС, упоИсточникПланаДоходовИРасходов, упоИсточникПланаТрудозатратРолей, Неопределено - см. упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице
// 
// Возвращаемое значение:
//  Булево - результат проверки.
//
Функция ЭтоСтрокаТрансляции(ПроверяемаяСтрока, ИмяТаблицы, Знач ИсточникТаблицы = Неопределено) Экспорт
	
	ЭтоСтрокаТрансляции = Ложь;
	
	Если Не ПроверяемаяСтрока.Свойство("ИсточникПлана") Тогда
		Возврат ЭтоСтрокаТрансляции;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ПроверяемаяСтрока.ИсточникПлана) Тогда
		Возврат ЭтоСтрокаТрансляции;
	КонецЕсли;
		
	Если ИсточникТаблицы = Неопределено Тогда		
		ИсточникТаблицы = упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ИмяТаблицы);
	КонецЕсли;	
	
	ЭтоСтрокаТрансляции = ПроверяемаяСтрока.ИсточникПлана <> ИсточникТаблицы;				
	
	Возврат ЭтоСтрокаТрансляции;
	 					
КонецФункции

// Возвращает массив созданных программно элементов формы указанной таблицы распределения данных по периодам.
//
// Параметры:
//  Форма							 - УправляемаяФорма
//  ИмяТаблицыРаспределения			 - Строка	 - имя таблицы формы.
//  ИмяЭлементаТаблицыРаспределения	 - Строка
// 
// Возвращаемое значение:
//  Массив - список элементов формы
//
Функция ПолучитьЭлементыРаспределенияПоПериодам(Форма, ИмяТаблицыРаспределения, ИмяЭлементаТаблицыРаспределения = "") Экспорт
	
	Если ИмяЭлементаТаблицыРаспределения = "" Тогда
		ИмяЭлементаТаблицыРаспределения = ИмяТаблицыРаспределения;
	КонецЕсли;
	
	ШаблонИмениГруппы = "Группа_%1_";
	ШаблонИмениСуммы = "Сумма_%1_";
	
	ШаблонИмениГруппы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениГруппы,
		ИмяТаблицыРаспределения);
		
	ШаблонИмениСуммы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениСуммы,
		ИмяТаблицыРаспределения);	
		
	ЭлементыФормы = Новый Массив;
	Для Каждого ЭлементТаблицыРаспределения Из Форма.Элементы[ИмяЭлементаТаблицыРаспределения].ПодчиненныеЭлементы Цикл
		Если СтрНайти(ЭлементТаблицыРаспределения.Имя, ШаблонИмениГруппы) > 0 
			Или СтрНайти(ЭлементТаблицыРаспределения.Имя, ШаблонИмениСуммы) > 0 Тогда
			ЭлементыФормы.Добавить(ЭлементТаблицыРаспределения);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЭлементыФормы;
	
КонецФункции

// Удаляет параметры выбора из массива параметров выбора по имени или набору имен строкой разделенных символами ",;"
//
// Параметры:
//  Имя - Строка - Имя параметра или набор имен строкой вида "Реквизит1, Реквизит2".
//  ПараметрыВыбора	- Массив - Массив параметров выбора.
//
Процедура УдалитьПараметрВыбораПоИмени(Имя, ПараметрыВыбора) Экспорт
	
	НаборИменСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Имя, ",;");
	
	НаборИмен = Новый Массив;
	Для Каждого Имя Из НаборИменСтрок Цикл
		НаборИмен.Добавить(СокрЛП(Имя));	
	КонецЦикла;
	
	ИндексыНаУдаление = Новый СписокЗначений;
	Для Каждого ПараметрВыбора Из ПараметрыВыбора Цикл
		Для Каждого Имя Из НаборИмен Цикл		
			Если ПараметрВыбора.Имя = Имя Тогда
				ИндексПараметра = ПараметрыВыбора.Найти(ПараметрВыбора);
				ИндексыНаУдаление.Добавить(ИндексПараметра);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ИндексыНаУдаление.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Для Каждого Индекс Из ИндексыНаУдаление Цикл
		ПараметрыВыбора.Удалить(Индекс.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает наличие/отсутствие в таблице строк с признаком "Основной". 
// Используется в таблицах типа ТрудовыеРесурсы, Субпродукты для проверки того, 
// что в строка с признаком "Основной" в них единственная.
//
// Параметры:
//  Объект - Объект, ДанныеФормы, УпраляемаяФорма - объект-владелец проверяемой таблицы.
//  ИмяТаблицы - Строка - имя проверяемой таблицы.
//  ИмяКолонкиОсновной - Строка - имя проверяемой колонки.
// 
// Возвращаемое значение:
//  Булево - признак наличия строк с указанным признаком.
// 
Функция ВТаблицеЕстьСтрокаСПризнакомОсновной(Объект, ИмяТаблицы, ИмяКолонкиОсновной = "Основной") Экспорт
	
	Отбор = Новый Структура(ИмяКолонкиОсновной, Истина);
	
	Возврат Объект[ИмяТаблицы].НайтиСтроки(Отбор).Количество() > 0;
		
КонецФункции

// Устанавливает сумму/количество строки табличной части в зависимости от редактируемой колонки
//
// Параметры:
//  ТекущаяСтрока - СтрокаТаблицы - СтрокаТаблицы.
//  ИзменяемаяКолонка - Строка - Имя редактируемой колонки.
//
Процедура КоличествоСуммаПриИзменении(ТекущаяСтрока, ИзменяемаяКолонка) Экспорт
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзменяемаяКолонка = "Количество" Или ИзменяемаяКолонка = "Стоимость" Тогда
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Стоимость;
		
	Иначе
		
		Если ИзменяемаяКолонка = "Сумма" И ТекущаяСтрока.Стоимость <> 0 Тогда
			
			ТекущаяСтрока.Количество = ТекущаяСтрока.Сумма / ТекущаяСтрока.Стоимость;				
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Распределяет сумму по строкам подчиненной таблицы согласно коэффициентам.
//
// Параметры:
//		СтрокаВладелец - ДанныеФормыЭлементКоллекции, ДанныеФормыЭлементДерева, Структура - 
//							данные строки владельца.
//		ТаблицаРаспределения - Массив, ДанныеФормыКоллекция, ТабличнаяЧасть - данные таблицы распределения.
//		ИмяКолонкиТаблицыВладельца - Строка - имя колонки таблицы владельца, содержащей исходную сумму.
//		ИмяКолонкиТаблицыРаспределения - Строка - имя колонки подчиненной таблицы, в которую заполяются распределенные данные.
//		ИмяКолонкиКоэффициентовРаспределения - Строка - имя колонки подчиненной таблицы, содержащей коэффициент.
//		ПересчитатьКоэффициентыРаспределения - Булево - необходимость пересчета коэффициентов по данным строки владельца 
//			при условии, что имя колонки коэффициентов в них совпадают.
//
Процедура РаспределитьСуммуСтрокиВладельцаПоТаблицеРаспределения(СтрокаВладелец, ТаблицаРаспределения, 
	ИмяКолонкиТаблицыВладельца = "Сумма",
	ИмяКолонкиТаблицыРаспределения = "Сумма",
	ИмяКолонкиКоэффициентовРаспределения = "Процент",
	ПересчитатьКоэффициентыРаспределения = Ложь) Экспорт
	
	СуммаКРаспределению = СтрокаВладелец[ИмяКолонкиТаблицыВладельца];
	
	ИндексСтрокиТаблицыРаспределения = Неопределено;
	
	КоэффициентыКРаспределению = Новый Массив;
	
	Для Каждого ПодчиненнаяСтрока Из ТаблицаРаспределения Цикл
		Если ПодчиненнаяСтрока.ИндексСтрокиВладельца = СтрокаВладелец.ИндексСтрокРаспределения Тогда
			КоэффициентыКРаспределению.Добавить(ПодчиненнаяСтрока[ИмяКолонкиКоэффициентовРаспределения]);
			ИндексСтрокиТаблицыРаспределения = ТаблицаРаспределения.Индекс(ПодчиненнаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ИндексПоследнего = КоэффициентыКРаспределению.ВГраница();
	
	Если ИндексПоследнего = - 1 Тогда
		Возврат;
	ИначеЕсли ИндексПоследнего = 0 Тогда
		ТаблицаРаспределения[ИндексСтрокиТаблицыРаспределения][ИмяКолонкиТаблицыРаспределения] = СуммаКРаспределению;
		Если ПересчитатьКоэффициентыРаспределения Тогда
			ТаблицаРаспределения[ИндексСтрокиТаблицыРаспределения][ИмяКолонкиКоэффициентовРаспределения] = 
				СтрокаВладелец[ИмяКолонкиКоэффициентовРаспределения];
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ПересчитатьКоэффициентыРаспределения Тогда
		
		КоэффициентКРаспределению = СтрокаВладелец[ИмяКолонкиКоэффициентовРаспределения];
		
		КоэффициентыКРаспределению = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			КоэффициентКРаспределению, 
			КоэффициентыКРаспределению);
			
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КоэффициентыКРаспределению) Тогда
		Возврат;
	КонецЕсли;
	
	РаспределенныеСуммы = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКРаспределению, 
		КоэффициентыКРаспределению);
	
	Счетчик = 0;
	Для Каждого ПодчиненнаяСтрока Из ТаблицаРаспределения Цикл
		Если ПодчиненнаяСтрока.ИндексСтрокиВладельца = СтрокаВладелец.ИндексСтрокРаспределения Тогда
			
			Если ПересчитатьКоэффициентыРаспределения Тогда
				ПодчиненнаяСтрока[ИмяКолонкиКоэффициентовРаспределения] = КоэффициентыКРаспределению[Счетчик];
			КонецЕсли;
			
			ПодчиненнаяСтрока[ИмяКолонкиТаблицыРаспределения] = ?(РаспределенныеСуммы = Неопределено, 0, РаспределенныеСуммы[Счетчик]);
			Счетчик = Счетчик + 1;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

#Область РаботаСДиаграммойГанта

// Создает на диаграмме Ганта вертикальную линию отражающую текущую дату
// 
// Параметры:
//  Диаграмма - ДиаграммаГанта - диаграмма Ганта.
//
Процедура ВыделитьТекущуюДатуВДиаграмме(Диаграмма) Экспорт
	
	ТекДата = ТекущаяДата();
	
	ИнтервалыФона = Диаграмма.ИнтервалыФона;
	ИнтервалТекДень = ИнтервалыФона.Добавить(НачалоДня(ТекДата), КонецДня(ТекДата));
	ИнтервалТекДень.Цвет = Новый Цвет(0, 255, 0);
		 
КонецПроцедуры

#КонецОбласти

#Область ПроектнаяПродукция

// Настраивает страницу субпродуктов на форме документа ПЗ и в форме задачи структуры 
//	в зависимости от выбранного типа субпродукта.
//
// Параметры:
//  Элементы		 - ЭлементыФормы - элементы формы.
//  ТипСубпродукта	 - ПеречислениеСсылка.упоТипСубпродукта - тип субпродукта на форме.
//  ВызовИзСтруктуры - Будево - признак работы из формы задачи структуры проекта.
//
Процедура НастроитьСубпродуктыНаФормеПоТипуСубпродукта(Элементы, ТипСубпродукта, ВызовИзСтруктуры = Ложь) Экспорт
	
	ЭтоПП = 
		ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
		
	Если ВызовИзСтруктуры Тогда
		ПолеПроцентРаспределения = "СубпродуктыПоПодразделениямПроцентРаспределения";
		ПолеКоличество = "СубпродуктыПоПодразделениямКоличество";
	Иначе
		ПолеПроцентРаспределения = "РаспределениеОбъемовПроцентРаспределения";
		ПолеКоличество = "РаспределениеОбъемовКоличество";
	КонецЕсли;
		
	// Видимость
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СубпродуктыГруппаПроектнаяПродукция", "Видимость", ЭтоПП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СубпродуктыПоПодразделениямПП", "Видимость", ЭтоПП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		ПолеПроцентРаспределения, "Видимость", ЭтоПП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ТранслироватьЗатратыПоСубпродуктам", "Видимость", ЭтоПП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		ПолеКоличество, "ТолькоПросмотр", ЭтоПП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		ПолеКоличество, "Доступность", Не ЭтоПП);
		
	// Выше по стеку установлена видимость по проектным опциям, убираем видимость для ПП.
	Если ЭтоПП Тогда 
		ВидимостьКомандЗаполненияПоРолям = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"СубпродуктыГруппаЗаполнитьПоРолям", "Видимость", ВидимостьКомандЗаполненияПоРолям);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"СубпродуктыПоПодразделениямГруппаЗаполнитьПоРолям", "Видимость", ВидимостьКомандЗаполненияПоРолям);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"РаспределениеОбъемовРаспределениеОбъемовЗаполнитьПоРолям", "Видимость", ВидимостьКомандЗаполненияПоРолям);
	КонецЕсли;
	
	// Заголовок
	Если ЭтоПП Тогда
		ЗаголовокРесурса = НСтр("ru = 'Проектная продукция'");
	Иначе
		ЗаголовокРесурса = НСтр("ru = 'Номенклатура'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"СубпродуктыРесурс", "Заголовок", ЗаголовокРесурса);
	
	// Ограничение типа
	
	УстановитьТипСубпродуктаДляЭлемента(Элементы.СубпродуктыРесурс, ЭтоПП);
	
КонецПроцедуры //

// Устанавливает ограничение типа значения ресурса на форме по типу субпродукта:
//  проектная продукция, номенклатура или выбор из типов.
//
// Параметры:
//  Элемент					 - ЭлементФормы	 - элемент формы - ресурс.
//  ЭтоПроектнаяПродукция	 - Булево		 - признак типа субпродукта.
//  ВыбиратьТип				 - Булево
//
Процедура УстановитьТипСубпродуктаДляЭлемента(Элемент, ЭтоПроектнаяПродукция = Ложь, ВыбиратьТип = Ложь) Экспорт
	
	ТипыСубпродукта = Новый Массив;
	Если Не ВыбиратьТип Тогда
		Если ЭтоПроектнаяПродукция Тогда
			ТипыСубпродукта.Добавить(Тип("СправочникСсылка.упоПроектнаяПродукция"));
		Иначе
			ТипыСубпродукта.Добавить(Тип("СправочникСсылка.Номенклатура"));
		КонецЕсли;
	КонецЕсли;
	
	ТипыСубпродукта = Новый ОписаниеТипов(ТипыСубпродукта);
	Элемент.ОграничениеТипа = ТипыСубпродукта;
	
КонецПроцедуры

// Устанавливает ограничение типа значения ресурса на форме для ресурсов.
//
// Параметры:
// 		Элемент - ЭлементФормы - элемент формы - ресурс.
//
Процедура УстановитьТипРесурсаДляЭлемента(Элемент) Экспорт
	
	ТипыРесурса = Новый Массив;
	
	ТипыРесурса.Добавить(Тип("СправочникСсылка.упоТрудовыеРесурсы"));
	ТипыРесурса.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ТипыРесурса.Добавить(Тип("СправочникСсылка.упоРоли"));
	Если упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция() Тогда
		ТипыРесурса.Добавить(Тип("СправочникСсылка.упоПроектнаяПродукция"));
	КонецЕсли;
	
	ТипДляЭлемента = Новый ОписаниеТипов(ТипыРесурса);
	Элемент.ОграничениеТипа = ТипДляЭлемента;
		
КонецПроцедуры //

// Устанавливает видимость страниц заказов выпуска на форме задачи по типу субпродукта.
//
// Параметры:
//  Элементы		 - ЭлементыФормы - изменяемые элементы формы.
//  ТипСубпродукта	 - ПеречислениеСсылка.упоТипСубпродукта - тип субпродукта задачи.
//
Процедура УстановитьВидимостьСтраницЗаказовВыпускаПоТипуСубпродукта(Элементы, ТипСубпродукта) Экспорт
	
	ВидимостьЗаказов = 
		Не ТипСубпродукта = ПредопределенноеЗначение("Перечисление.упоТипСубпродукта.ПроектнаяПродукция");
	
	СтраницыЗаказовВыпуска = Новый Соответствие;
	СтраницыЗаказовВыпуска.Вставить("СтраницаЗаказыПокупателей", 
		ВидимостьЗаказов И упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыПокупателей());
	СтраницыЗаказовВыпуска.Вставить("СтраницаЗаказыНаПроизводство2_1",
		ВидимостьЗаказов И упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыНаПроизводство());
	СтраницыЗаказовВыпуска.Вставить("СтраницаЗаказыНаПроизводство2_2",
		ВидимостьЗаказов И упоИнтеграцияКлиентСервер.ИспользуетсяФункционалЗаказыНаПроизводство2_2());
	
	Для Каждого СтраницаЗаказов Из СтраницыЗаказовВыпуска Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			СтраницаЗаказов.Ключ, "Видимость", СтраницаЗаказов.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроектнаяЗадача
// Проверяет заполнена ли дата привязки в плане доходов, плане расходов, плане движения денежных средств.
// Выводит сообщение пользователю, для строк, в которых не заполнена дата привязки.
//
// Параметры:
//  Объект				 - ДокументОбъект, ФормаКлиентскогоПриложения
//  Отказ				 - Булево
//  Заголовок			 - Строка
//	ЕстьВкладкаФинПланы  - Булево
// 
Процедура ПроверитьЗаполнениеДатыПривязки(Объект, Отказ, Заголовок = Неопределено, 
	ЕстьВкладкаФинПланы = Ложь) Экспорт
	
	Если ЕстьВкладкаФинПланы Тогда
		ТекстВкладкаФинПланы = НСтр("ru = ' на вкладке ""Фин. планы""'");
	Иначе 
		ТекстВкладкаФинПланы = "";
	КонецЕсли;

	СпособПривязкиНаДату = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату");
	СпособПривязкиПоПрофилюРаспределения = ПредопределенноеЗначение(
		"Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения");
	ИсточникПланаТрудозатраты = ПредопределенноеЗначение("Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты"); 

	ТекстСообщения = НСтр("ru = 'Не заполнено значение ""%1"" в строке № %2%3 в ""%4""'");
	
	СинонимДатыПривязки = НСтр("ru = 'Дата привязки'");
	СинонимПрофиляРаспределения = НСтр("ru = 'Профиль распределения'");

	ИмяПлана = "";
	
	ПередаваемыеПараметры = Новый Структура;
	ПередаваемыеПараметры.Вставить("ТекстСообщения", ТекстСообщения);
	ПередаваемыеПараметры.Вставить("ТекстВкладкаФинПланы", ТекстВкладкаФинПланы);
	ПередаваемыеПараметры.Вставить("СинонимДатыПривязки", СинонимДатыПривязки);
	ПередаваемыеПараметры.Вставить("СинонимПрофиляРаспределения", СинонимПрофиляРаспределения);
	ПередаваемыеПараметры.Вставить("ИмяПлана", ИмяПлана);
	ПередаваемыеПараметры.Вставить("СпособПривязкиНаДату", СпособПривязкиНаДату);
	ПередаваемыеПараметры.Вставить("СпособПривязкиПоПрофилюРаспределения", СпособПривязкиПоПрофилюРаспределения);
	
	МассивОшибок = Новый Массив;
	
	ПланДоходов = Объект.ПланДоходов; 
	ПередаваемыеПараметры.ИмяПлана = НСтр("ru = 'Плане доходов'"); 
	НомерСтрокиДляСообщения = 0;
	
	Для Каждого лСтрока Из ПланДоходов Цикл
		
		НомерСтрокиДляСообщения = НомерСтрокиДляСообщения + 1;
		
		ДобавитьТекстОшибки(ПередаваемыеПараметры, Отказ, лСтрока, НомерСтрокиДляСообщения, МассивОшибок);

	КонецЦикла;
	
	ПланРасходов = Объект.ПланРасходов; 
	ПередаваемыеПараметры.ИмяПлана = НСтр("ru = 'Плане расходов'");
	НомерСтрокиДляСообщения = 0;

	Для Каждого лСтрока Из ПланРасходов Цикл
		
		НомерСтрокиДляСообщения = НомерСтрокиДляСообщения + 1; 

		Если лСтрока.ИсточникПлана = ИсточникПланаТрудозатраты Тогда
			Продолжить;
		КонецЕсли;	

		ДобавитьТекстОшибки(ПередаваемыеПараметры, Отказ, лСтрока, НомерСтрокиДляСообщения, МассивОшибок);

	КонецЦикла;
	
	ДвиженияДенежныхСредств = Объект.ДвиженияДенежныхСредств;
	ПередаваемыеПараметры.ИмяПлана = НСтр("ru = 'Плане движения денежных средств'");
	ПередаваемыеПараметры.СпособПривязкиНаДату = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДДС.НаДату");
	ПередаваемыеПараметры.СпособПривязкиПоПрофилюРаспределения = ПредопределенноеЗначение(
		"Перечисление.упоСпособПривязкиДДС.ПоПрофилюРаспределения");
	НомерСтрокиДляСообщения = 0;

	Для Каждого лСтрока Из ДвиженияДенежныхСредств Цикл
		
		НомерСтрокиДляСообщения = НомерСтрокиДляСообщения + 1; 

		ДобавитьТекстОшибки(ПередаваемыеПараметры, Отказ, лСтрока, НомерСтрокиДляСообщения, МассивОшибок);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда
		
		Если ЗначениеЗаполнено(Заголовок)Тогда
			МассивОшибок.Вставить(0, Заголовок);
		КонецЕсли;
		
    	ТекстСообщенияОбОшибке = СтрСоединить(МассивОшибок, Символы.ПС);
	
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ТекстСообщенияОбОшибке;
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
			
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс  

#Область РаботаСДокументамиПланирования

Функция ИндексКартинкиДокументаПланирования(ИмяГруппировки, СтрокаДерева, ЯркаяКартинка = Истина) Экспорт
	
	ИндексВКоллекции = -1;
		
	Если ИмяГруппировки = "Проект" Тогда
		ИндексВКоллекции = 1;
	ИначеЕсли ИмяГруппировки = "Роль" Тогда
		ИндексВКоллекции = 12;
	ИначеЕсли ИмяГруппировки = "Подразделение" Тогда
		ИндексВКоллекции = 10;
	ИначеЕсли ИмяГруппировки = "ПроектнаяЗадачаЗеркало"	Тогда
		Если СтрокаДерева.ТипЗадачи = 0 Тогда // модель пакета работ
			ИндексВКоллекции = 5;
		ИначеЕсли СтрокаДерева.ТипЗадачи = 1 Тогда // этап
			ИндексВКоллекции = 2;
		ИначеЕсли СтрокаДерева.ТипЗадачи = 5 Тогда // веха
			ИндексВКоллекции = 6;
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ЯркаяКартинка И ИндексВКоллекции <> -1 Тогда
		ИнтервалПереходаКНеЯркойКартинке = 29;
		ИндексВКоллекции = ИндексВКоллекции + ИнтервалПереходаКНеЯркойКартинке;
	КонецЕсли;
	
	Возврат ИндексВКоллекции;
	
КонецФункции

Процедура НастройкаПрогнозаПоУровнюПланирования(Форма, Знач УровеньПланирования = Неопределено) Экспорт
	
	Объект 	 = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Не ЗначениеЗаполнено(УровеньПланирования) Тогда
		УровеньПланирования = Объект.УровеньПланированияРолей;
	КонецЕсли;	
		
	УровеньПланированияОкончательный = 
		УровеньПланирования = ПредопределенноеЗначение("Перечисление.упоУровеньПланирования.Окончательный");
	
	Элементы.АктуализироватьПланПредварительногоУровняПоОкончательному.Доступность = УровеньПланированияОкончательный;
	
	Если Не УровеньПланированияОкончательный Тогда
		Объект.АктуализироватьПланПредварительногоУровняПоОкончательному = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

Процедура НастройкаПрогнозаПоПроцентуГотовности(Форма) Экспорт
	
	Объект 	 = Форма.Объект;
	Элементы = Форма.Элементы;		
	
	Если Не Объект.ЗаписыватьПроцентГотовности Тогда
		Объект.АвтоматическийРасчетПроцентаГотовности = Ложь;
		Объект.НеУменьшатьЗаписанныйПроцентГотовности = Ложь;
	КонецЕсли;	
	
	Если Не Объект.АвтоматическийРасчетПроцентаГотовности Тогда
		Объект.НеУменьшатьЗаписанныйПроцентГотовности = Ложь;
	КонецЕсли;	
		
	Элементы.АвтоматическийРасчетПроцентаГотовности.Доступность = Объект.ЗаписыватьПроцентГотовности 
																И Элементы.ЗаписыватьПроцентГотовности.Доступность;
	Элементы.НеУменьшатьЗаписанныйПроцентГотовности.Доступность = Объект.АвтоматическийРасчетПроцентаГотовности
																И Элементы.АвтоматическийРасчетПроцентаГотовности.Доступность;
	
КонецПроцедуры

Функция ВидимостьЭлемента(Элемент, Видимость) Экспорт 
	
	Если Элемент.Видимость <> Видимость Тогда
		Элемент.Видимость = Видимость;	
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РабочиеКалендари

Функция ЭтоФормаРабочегоКалендаря(СостИмени) Экспорт 
	
	ТребуетсяОбработкаФормы = Ложь;
	
	Если СостИмени.ТипМетаданных = "Справочник" Тогда
		Если СостИмени.ВидМетаданных = "упоРабочиеКалендари" Тогда
			ТребуетсяОбработкаФормы = СостИмени.ИмяФормы = "ФормаЭлементаУправляемая";
		КонецЕсли;
	ИначеЕсли СостИмени.ТипМетаданных = "Документ" Тогда
		Если СостИмени.ВидМетаданных = "упоИзменениеРабочегоКалендаря"
			Или СостИмени.ВидМетаданных = "упоРегистрацияРабочегоКалендаря" Тогда
			ТребуетсяОбработкаФормы = СостИмени.ИмяФормы = "ФормаДокументаУправляемая";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТребуетсяОбработкаФормы;
	
КонецФункции

Функция ИмяРеквизитаКалендарь(СостИмени) Экспорт
	
	ИмяРеквизитаКалендарь = "";
	
	Если СостИмени.ВидМетаданных = "упоРабочиеКалендари" Тогда
		ИмяРеквизитаКалендарь = "Ссылка";
	ИначеЕсли СостИмени.ВидМетаданных = "упоИзменениеРабочегоКалендаря"
			Или СостИмени.ВидМетаданных = "упоРегистрацияРабочегоКалендаря" Тогда
		ИмяРеквизитаКалендарь = "Календарь";
	КонецЕсли;
	
	Возврат ИмяРеквизитаКалендарь;
	
КонецФункции

Функция ИмяЭлемента_КомандаОптимизироватьРабочиеКалендари() Экспорт
	
	Возврат "КомандаОптимизироватьРабочиеКалендари";
	
КонецФункции

#КонецОбласти

Функция ПолучитьСтруктуруСоответствияКолонокДляПереносаСтрок(ТаблицаПриемник, ТаблицаИсточник = Неопределено) Экспорт
	
	СтруктураСоответствияКолонок = Новый Структура(
		"СоотвКолонокОсновныхТаблиц, СоотвКолонокТаблицРаспределения", Новый Структура, Новый Структура);
		
	Если ТаблицаПриемник = "ПланДоходов" Тогда
		
		// Колонка таблицы-приемника / колонка таблицы-источника.
		СтруктСоотОснКол = СтруктураСоответствияКолонок.СоотвКолонокОсновныхТаблиц;
		СтруктСоотОснКол.Вставить("Статья", "СтатьяДоходов");
		СтруктСоотОснКол.Вставить("Сумма", "ОбщСтоимость");
		СтруктСоотОснКол.Вставить("ИндексСтрокРаспределенияИсходнойТЧ", "ИндексСтрокРаспределения");
		СтруктСоотОснКол.Вставить("Валюта", "Валюта");
		СтруктСоотОснКол.Вставить("СпособПривязки", "СпособПривязки");
		СтруктСоотОснКол.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
		СтруктСоотОснКол.Вставить("ДатаПривязки", "ДатаПривязки");
		СтруктСоотОснКол.Вставить("Контрагент", "Контрагент");
		СтруктСоотОснКол.Вставить("Договор", "Договор");
		
		// Колонка таблицы-приемника / колонка таблицы-источника.
		СтруктСоотДопКол = СтруктураСоответствияКолонок.СоотвКолонокТаблицРаспределения;
		СтруктСоотДопКол.Вставить("Подразделение", "Подразделение");
		СтруктСоотДопКол.Вставить("Роль", "Роль");
		СтруктСоотДопКол.Вставить("СобствСилы_Субподряд", "СобствСилы_Субподряд");
		СтруктСоотДопКол.Вставить("КонтрагентПодрядчик", "КонтрагентПодрядчик");
		СтруктСоотДопКол.Вставить("ЗаказДоговорПодрядчика", "ЗаказДоговорПодрядчика");
		СтруктСоотДопКол.Вставить("Сумма", "Сумма");
		СтруктСоотДопКол.Вставить("ИндексСтрокРаспределенияПоПериодам", "ИндексСтрокРаспределенияПоПериодам");
        
	ИначеЕсли ТаблицаПриемник = "ПланРасходов" Тогда
										
		Если ТаблицаИсточник = "ДополнительныеЗатраты" ИЛИ ТаблицаИсточник = "РаспределениеДополнительныхЗатрат" Тогда
			
			// Колонка таблицы-приемника / колонка таблицы-источника.
			СтруктСоотОснКол = СтруктураСоответствияКолонок.СоотвКолонокОсновныхТаблиц;
			СтруктСоотОснКол.Вставить("Статья", "СтатьяЗатрат");
			СтруктСоотОснКол.Вставить("Сумма", "Стоимость");
			СтруктСоотОснКол.Вставить("ИндексСтрокРаспределенияИсходнойТЧ", "ИндексСтрокРаспределения");
			СтруктСоотОснКол.Вставить("СпособПривязки", "СпособПривязкиДоходовРасходов");
			СтруктСоотОснКол.Вставить("ПрофильРаспределения", "ПрофильРаспределенияДоходовРасходов");
			СтруктСоотОснКол.Вставить("ДатаПривязки", "ДатаПривязкиДоходовРасходов");
			СтруктСоотОснКол.Вставить("Контрагент", "КонтрагентДоходовРасходов");
			СтруктСоотОснКол.Вставить("Договор", "ДоговорДоходовРасходов");
			
		Иначе
			
			// Колонка таблицы-приемника / колонка таблицы-источника.
			СтруктСоотОснКол = СтруктураСоответствияКолонок.СоотвКолонокОсновныхТаблиц;
			СтруктСоотОснКол.Вставить("Статья", "СтатьяЗатрат");
			СтруктСоотОснКол.Вставить("Сумма", "ОбщСтоимость");
			СтруктСоотОснКол.Вставить("ИндексСтрокРаспределенияИсходнойТЧ", "ИндексСтрокРаспределения");
			СтруктСоотОснКол.Вставить("Валюта", "Валюта");
			СтруктСоотОснКол.Вставить("СпособПривязки", "СпособПривязки");
			СтруктСоотОснКол.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
			СтруктСоотОснКол.Вставить("ДатаПривязки", "ДатаПривязки");
			СтруктСоотОснКол.Вставить("Контрагент", "Контрагент");
			СтруктСоотОснКол.Вставить("Договор", "Договор");
			
		КонецЕсли;
		
		// Колонка таблицы-приемника / колонка таблицы-источника.
		СтруктСоотДопКол = СтруктураСоответствияКолонок.СоотвКолонокТаблицРаспределения;
		СтруктСоотДопКол.Вставить("Подразделение", "Подразделение");
		СтруктСоотДопКол.Вставить("Роль", "Роль");
		СтруктСоотДопКол.Вставить("СобствСилы_Субподряд", "СобствСилы_Субподряд");
		СтруктСоотДопКол.Вставить("Сумма", "Сумма");
		СтруктСоотДопКол.Вставить("СпособПривязки", "СпособПривязки");
		СтруктСоотДопКол.Вставить("ПрофильРаспределения", "ПрофильРаспределения");
        СтруктСоотДопКол.Вставить("ДатаПривязки", "ДатаПривязки");
		
	КонецЕсли;
	
	Возврат СтруктураСоответствияКолонок;
	
КонецФункции

Функция ОбновитьДанныеСвязаннойСтрокиОсновнойТаблицы(Объект, ИсходнаяСтрока, СвязаннаяТаблица, ТаблицаИсточник) Экспорт 
		
	СтруктураОтбора = Новый Структура("ИсточникПлана, ИндексСтрокРаспределенияИсходнойТЧ", 
		упоРаботаСФормамиКлиентСервер.ИсточникПланаПоТаблице(ТаблицаИсточник), ИсходнаяСтрока.ИндексСтрокРаспределения);
					
	НайденныеСтроки = Объект[СвязаннаяТаблица].НайтиСтроки(СтруктураОтбора);
	
	СтрокиНайдены = Не НайденныеСтроки.Количество() = 0; 
	
	Если СтрокиНайдены Тогда
		
		СтруктураСоответствияКолонок = ПолучитьСтруктуруСоответствияКолонокДляПереносаСтрок(СвязаннаяТаблица, ТаблицаИсточник);
		
		Для Каждого СтрокаДляОбновления Из НайденныеСтроки Цикл
		
			// Перенос значений в соотв. колонки основной таблицы.
			Для Каждого КИЗ Из СтруктураСоответствияКолонок.СоотвКолонокОсновныхТаблиц Цикл
				СтрокаДляОбновления[КИЗ.Ключ] = ИсходнаяСтрока[КИЗ.Значение];
			КонецЦикла; 
			
		КонецЦикла;

	КонецЕсли;
		
	Возврат СтрокиНайдены;
	
КонецФункции

Процедура НастройкаРаспределенияБДР_УстановитьДоступностьВидимостьЭлементовФормы(ЭтаФорма, Объект) Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	
	Элементы.СтавкаНДС.Доступность = Объект.ФлагВыделитьНДСДоходов 
										Или Объект.ФлагВыделитьНДСРасходов;	
	
	Элементы.ОтборСтатьиНДС.Доступность = Объект.ФлагВыделитьНДСРасходов;				
	Элементы.УчестьРасходы_ОтборСССП.Доступность = Объект.ФлагУчестьРасходы;	
	Элементы.РаспределитьПоТрудозатратам_ИсключитьСССП.Доступность = Объект.ФлагРаспределитьПоТрудозатратам;
	Элементы.СпособРаспределенияДоходовПоРасходам.Доступность = Объект.ФлагУчестьРасходы;
	
	Элементы.РаспределитьПланВыпускаТранслированныйНаДоход.Доступность = Объект.ФлагУчестьРасходы 
																			Или Объект.ФлагРаспределитьПоТрудозатратам;
																			
   	Элементы.ФлагРаспределитьПоТрудозатратам.Доступность =
		Объект.СпособРаспределенияДоходовПоРасходам <> ПредопределенноеЗначение("Перечисление.упоСпособыРаспределенияРасходовВОбработкеРаспределенияБДР.Пропорционально")
			Или Не Объект.ФлагУчестьРасходы;

КонецПроцедуры

Функция СообщениеДляБДРТрудозатратыИзменены(ИспользоватьОтложенноеОтражениеПлановыхТрудозатратЗадач, 
	СообщениеДляДокументаПЗ = Истина) Экспорт
	
	ТекстСообщения = 	НСтр("ru = 'ВНИМАНИЕ! Изменились расходы по трудовым ресурсам, включенным в БДР. '") +
						НСтр("ru = 'После %1 данные плана расходов будут обновлены.'"); 
		
	Если ИспользоватьОтложенноеОтражениеПлановыхТрудозатратЗадач Тогда
		ТекстУточнения = НСтр("ru = 'выполнения регламентного задания по отражению трудозатрат'"); 
	ИначеЕсли СообщениеДляДокументаПЗ Тогда
		ТекстУточнения = НСтр("ru = 'проведения задачи'");
	Иначе
		ТекстУточнения = НСтр("ru = 'записи структуры проекта'");
	КонецЕсли;					
		
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,	ТекстУточнения);	
	
КонецФункции

Функция ПараметрыПривязкиСтрокиРаспределенияПоСтрокеВладельцу(СтрокаВладелец,
	ИмяКолонкиСпособПривязки = "СпособПривязки",
	ИмяКолонкиПрофиль = "ПрофильРаспределения",
	ИмяКолонкиДата = "ДатаПривязки") Экспорт 
	
	ПараметрыПривязки = Новый Структура;
	ПараметрыПривязки.Вставить("СпособПривязки", 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПустаяСсылка"));
	ПараметрыПривязки.Вставить("ПрофильРаспределения", 
		ПредопределенноеЗначение("Справочник.упоПрофилиРаспределенияДоходовИРасходов.ПустаяСсылка"));
	ПараметрыПривязки.Вставить("ДатаПривязки", Дата(1, 1, 1));
		
	Если СтрокаВладелец[ИмяКолонкиСпособПривязки] = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения")
		Или СтрокаВладелец[ИмяКолонкиСпособПривязки] = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.ПоПрофилюРаспределения") Тогда
				
		ПараметрыПривязки.СпособПривязки = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения");
		ПараметрыПривязки.ПрофильРаспределения = СтрокаВладелец[ИмяКолонкиПрофиль];
				
	ИначеЕсли СтрокаВладелец[ИмяКолонкиСпособПривязки] = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату")
		Или СтрокаВладелец[ИмяКолонкиСпособПривязки] = 
			ПредопределенноеЗначение("Перечисление.упоСпособПривязкиДоходаРасхода.НаДату") Тогда
		
		ПараметрыПривязки.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.НаДату");
		ПараметрыПривязки.ДатаПривязки = СтрокаВладелец[ИмяКолонкиДата];
		
	ИначеЕсли СтрокаВладелец[ИмяКолонкиСпособПривязки] = 
		ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную") Тогда
				
		ПараметрыПривязки.СпособПривязки = ПредопределенноеЗначение("Перечисление.упоСпособПривязкиРаспределения.Вручную");			
		
	КонецЕсли;		
	
	Возврат ПараметрыПривязки;
	
КонецФункции

Функция ЭтоВызовЗадачиИзСтруктурыПроекта(Форма) Экспорт
	
	ВызовИзСтруктуры = Ложь;
	
	Если Форма.ИмяФормы = "Обработка.упоУпрощенныйВводСтруктурыПроекта.Форма.ФормаЗадачи" Тогда
		ВызовИзСтруктуры = Истина;
	КонецЕсли;
	
	Возврат ВызовИзСтруктуры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Процедура ДобавитьТекстОшибки(Параметры, Отказ, СтрокаПлана, НомерСтроки, МассивОшибок)

	ТекстСообщения = Параметры.ТекстСообщения;
	СинонимДатыПривязки = Параметры.СинонимДатыПривязки;
	СинонимПрофиляРаспределения = Параметры.СинонимПрофиляРаспределения;
	СпособПривязкиНаДату = Параметры.СпособПривязкиНаДату;
	СпособПривязкиПоПрофилюРаспределения = Параметры.СпособПривязкиПоПрофилюРаспределения;
	ТекстВкладкаФинПланы = Параметры.ТекстВкладкаФинПланы;
	ИмяПлана = Параметры.ИмяПлана;
	
	Если СтрокаПлана.СпособПривязки = СпособПривязкиНаДату 
		И НЕ ЗначениеЗаполнено(СтрокаПлана.ДатаПривязки) Тогда
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(ТекстСообщения, СинонимДатыПривязки, НомерСтроки, 
			ТекстВкладкаФинПланы, ИмяПлана);
		МассивОшибок.Добавить(СокрЛ(ТекстОшибки));
	ИначеЕсли СтрокаПлана.СпособПривязки = СпособПривязкиПоПрофилюРаспределения 
		И НЕ ЗначениеЗаполнено(СтрокаПлана.ПрофильРаспределения) Тогда
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(ТекстСообщения, СинонимПрофиляРаспределения,НомерСтроки, 
			ТекстВкладкаФинПланы, ИмяПлана); 
		МассивОшибок.Добавить(СокрЛ(ТекстОшибки));
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти