
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УдалитьСтрокиЗадачИзОбъекта(ВыделенныйПроект);
	СтрокиДереваЗадачВОбъект(ВыделенныйПроект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ВыделенныйПроект = Неопределено;
	ВыделенныйСтатусОтчет = Неопределено;
	Элементы.Проекты.ТекущаяСтрока = Неопределено;
	ОчиститьДеревоЗадачНаФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ПроектыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПриИзмененииВыделенногоПроекта", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПроектПриИзменении(Элемент)
	
	ЗаполнитьСведенияОПроектеВТекущейСтроке();
	ПриИзмененииВыделенногоПроекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыСтатусОтчетПриИзменении(Элемент)
	
	ЗаполнитьСведенияОПроектеВТекущейСтроке();
	ПриИзмененииВыделенногоПроекта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗадачПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьЗадачи(Команда)	
		
	Если НЕ ЗначениеЗаполнено(ВыделенныйПроект) Тогда 
		Возврат;
	КонецЕсли;
	
	ПроектСтатусОтчет = Новый Соответствие; 
	ПроектСтатусОтчет.Вставить(ВыделенныйПроект, ВыделенныйСтатусОтчет);		
	ЗаполнитьДеревоЗадачФормыПоДаннымБД(ПроектСтатусОтчет);
	
	Если ЗначениеЗаполнено(ВыделенныйСтатусОтчет) Тогда
		ЗаполнитьДеревоЗадачНаФормеПоДаннымОбъекта(ЭтаФорма, ВыделенныйПроект);	
	КонецЕсли;

	УдалитьСтрокиЗадачИзОбъекта(ВыделенныйПроект);
	СтрокиДереваЗадачВОбъект(ВыделенныйПроект);
	
	РазвернутьДеревоЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПроекты(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьПроектыВыбор", ЭтаФорма);
	ОткрытьФорму("Документ.упоСводныйСтатусОтчетПоПроектам.Форма.ФормаПодбораПроектов",, ЭтаФорма,,,, ОписаниеОповещения);

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура КомандаЗаполнитьЗадачиПоВсемПроектам(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Проекты) Тогда
		Возврат;	
	КонецЕсли;
	
	ПроектСтатусОтчет = Новый Соответствие; 
	Для каждого СтрокаТЧ Из Объект.Проекты Цикл
		ПроектСтатусОтчет.Вставить(СтрокаТЧ.Проект, СтрокаТЧ.СтатусОтчет);		
	КонецЦикла;
	
	Объект.Задачи.Очистить();
	
	ЗаполнитьДеревоЗадачФормыПоДаннымБД(ПроектСтатусОтчет);
	
	СтрокиДереваЗадачВОбъектРекурсивно(ДеревоЗадач.ПолучитьЭлементы(), Объект.Задачи);
	ОчиститьДеревоЗадачНаФорме(ЭтаФорма);
    ЗаполнитьДеревоЗадачНаФормеПоДаннымОбъекта(ЭтаФорма, ВыделенныйПроект);
	
	РазвернутьДеревоЗадач();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииВыделенногоПроекта() 
	
	УдалитьСтрокиЗадачИзОбъекта(ВыделенныйПроект);
	
	Если ПроектВСпискеПроектов(ВыделенныйПроект) Тогда 		
		СтрокиДереваЗадачВОбъект(ВыделенныйПроект);
	КонецЕсли;
	
	ОчиститьДеревоЗадачНаФорме(ЭтаФорма);
	
	//
	
	ТекущиеДанные = Элементы.Проекты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	ВыделенныйПроект = ТекущиеДанные.Проект;
	ВыделенныйСтатусОтчет = ТекущиеДанные.СтатусОтчет;
	ЗаполнитьДеревоЗадачНаФормеПоДаннымОбъекта(ЭтаФорма, ВыделенныйПроект);
	
	//
	
	РазвернутьДеревоЗадач();
	
КонецПроцедуры

&НаКлиенте
Функция ПроектВСпискеПроектов(пПроект) 
	Возврат Объект.Проекты.НайтиСтроки(Новый Структура("Проект", пПроект)).Количество() <> 0;	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧЗадачиПоСтатусОтчету(Проект, СтатусОтчет)

	Отбор = Новый Структура("Проект", Проект);
	НайденныеСтроки = Объект.Задачи.НайтиСтроки(Отбор);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.Задачи.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Проект КАК Проект,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаПредставление КАК ЗадачаПредставление,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаСсылка КАК ЗадачаСсылка,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.КодСДР КАК КодСДР,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.СтатусЗадачи КАК СтатусЗадачи,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Сроки КАК Сроки,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Ресурсы КАК Ресурсы,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Бюджеты КАК Бюджеты,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Риски КАК Риски,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ДатаНачалаПрогноз КАК ДатаНачалаПрогноз,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ДатаЗавершенияПрогноз КАК ДатаЗавершенияПрогноз,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ПроцентВыполненияЗадачи КАК ПроцентВыполненияЗадачи,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ПроцентДинамики КАК ПроцентДинамики,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Ответственный КАК Ответственный,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Комментарий КАК Комментарий,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.ИндексКартинки КАК ИндексКартинки,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Родитель КАК Родитель,
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Уровень КАК Уровень
	|ИЗ
	|	Документ.упоСтатусОтчетПоПроекту.СтатусЗадач КАК упоСтатусОтчетПоПроектуСтатусЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
	|		ПО упоСтатусОтчетПоПроектуСтатусЗадач.ЗадачаСсылка = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	|			И (упоСвойстваПроектныхЗадачСрезПоследних.ВыводитьВСводныйСтатусОтчет)
	|			И (НЕ упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаОтменена)
	|ГДЕ
	|	упоСтатусОтчетПоПроектуСтатусЗадач.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтатусОтчет);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Версия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Задачи.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры	
	
&НаСервере
Процедура ЗаполнитьДеревоЗадачФормыПоДаннымБД(ПроектСтатусОтчет)	
	
	Для Каждого Строка Из ПроектСтатусОтчет Цикл
		
		ТекПроект = Строка.Ключ;	
		ТекСтатусОтчет = Строка.Значение;
		
		Если ЗначениеЗаполнено(ТекСтатусОтчет) Тогда
			
			ОчиститьСтрокиДереваПроекта(ТекПроект);
			ЗаполнитьТЧЗадачиПоСтатусОтчету(ТекПроект, ТекСтатусОтчет);
			
		Иначе
			
			ЗагрузитьДанныеВПромежуточноеДерево(Неопределено, ТекПроект);
			ЗаполнитьДеревоЗадачФормыПоПромежуточномуДереву(ТекПроект);  
			ТаблицаДанных.ПолучитьЭлементы().Очистить();
			Документы.упоСтатусОтчетПоПроекту.ДополнитьДеревоЗадачСводногоНаФормеДопДанными(ЭтаФорма);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьДанныеВПромежуточноеДерево(ТекЗадача, ТекПроект)
		
	врТаблицаДанных = РеквизитФормыВЗначение("ТаблицаДанных");	
	врТаблицаДанных.Строки.Очистить();
	
	Если Не ЗначениеЗаполнено(ТекПроект) Тогда      
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос();	
	Запрос.Текст = ЗапросСписокЗадачПоПроекту();		
	Запрос.УстановитьПараметр("текВерсия", упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(ТекПроект));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда      
		Возврат;
	КонецЕсли; 
	
	СтруктураОтбора = Новый Структура("ЗадачаРодитель", Документы.упоПроектнаяЗадача.ПустаяСсылка());
	СтрокиВерхнийУровень = РезультатЗапроса.НайтиСтроки(СтруктураОтбора);
	Если СтрокиВерхнийУровень.Количество() = 0 Тогда      
		// Если нет ни одной задачи верхнего уровня, дерево построить не получится
		Сообщение = НСтр("ru = 'Не найдено ни одной проектной задачи верхнего уровня иерархии, дерево задач не может быть построено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли; 
	
	НовыеЭлементы = Новый СписокЗначений();
	
	Для каждого СтрокаВерхнийУровень Из СтрокиВерхнийУровень Цикл
		
		СтрокаДерева = врТаблицаДанных.Строки.Добавить();
		СтрокаДерева.ПроектнаяЗадача = СтрокаВерхнийУровень.ПроектнаяЗадача;
		СтрокаДерева.НазваниеПроектнойЗадачи = СтрокаВерхнийУровень.НазваниеЗадачи;
		СтрокаДерева.ПакетРабот = СтрокаВерхнийУровень.ЭтоПакетРабот;
		СтрокаДерева.МодельПакетаРабот = СтрокаВерхнийУровень.ЭтоМодельПакетаРабот;
		СтрокаДерева.ЭтоВеха = СтрокаВерхнийУровень.ЭтоВеха;
		СтрокаДерева.КодСДР = СтрокаВерхнийУровень.КодСДР;
		
		Если СтрокаДерева.ЭтоВеха Тогда      
			СтрокаДерева.ИндексКартинки = 3;
		ИначеЕсли СтрокаДерева.ПакетРабот И НЕ СтрокаДерева.МодельПакетаРабот Тогда      
			СтрокаДерева.ИндексКартинки = 2;
		ИначеЕсли СтрокаДерева.МодельПакетаРабот Тогда
			СтрокаДерева.ИндексКартинки = 0;
		Иначе
			СтрокаДерева.ИндексКартинки = 1;
		КонецЕсли;	
		
		СтрокаДерева.СсылкаНаЗеркальныйПроект = СтрокаВерхнийУровень.СсылкаНаЗеркальныйПроект;
		Если ЗначениеЗаполнено(ТекЗадача) И (СтрокаДерева.ПроектнаяЗадача = ТекЗадача 
			ИЛИ СтрокаДерева.СсылкаНаЗеркальныйПроект = ТекЗадача) Тогда      
			
			СтрокаДерева.ТекущаяЗадача = Истина;
			
		КонецЕсли; 
		
		НовыеЭлементы.Добавить(СтрокаДерева);
		
	КонецЦикла;
	
	врТаблицаДанных.Строки.Сортировать("КодСДР");
	
	Пока Истина Цикл
		
		НайденоНовыхЭлементов = 0;
		ЭлементыВерхнегоУровня = Новый СписокЗначений();
		ЭлементыВерхнегоУровня.ЗагрузитьЗначения(НовыеЭлементы.ВыгрузитьЗначения());
		НовыеЭлементы.Очистить();
		
		Для Каждого ЭлементРодитель Из ЭлементыВерхнегоУровня Цикл
			
			СтруктураОтбора = Новый Структура("ЗадачаРодитель", ЭлементРодитель.Значение.ПроектнаяЗадача);
			ПодчиненныеЗадачи = РезультатЗапроса.НайтиСтроки(СтруктураОтбора);
			СтрокаЗадачаРодитель = РезультатЗапроса.Найти(ЭлементРодитель.Значение.ПроектнаяЗадача, "ПроектнаяЗадача");
			
			Для Каждого СтрокаЗадача Из ПодчиненныеЗадачи Цикл
				
				СтрокаДерева = ЭлементРодитель.Значение.Строки.Добавить();	
				
				СтрокаДерева.ПроектнаяЗадача = СтрокаЗадача.ПроектнаяЗадача;
				СтрокаДерева.НазваниеПроектнойЗадачи = СтрокаЗадача.НазваниеЗадачи;
				СтрокаДерева.ПакетРабот = СтрокаЗадача.ЭтоПакетРабот;
				СтрокаДерева.МодельПакетаРабот = СтрокаЗадача.ЭтоМодельПакетаРабот;
				СтрокаДерева.ЭтоВеха = СтрокаЗадача.ЭтоВеха;
				СтрокаДерева.КодСДР = СтрокаЗадача.КодСДР;
				
				Если СтрокаДерева.ЭтоВеха Тогда      
					СтрокаДерева.ИндексКартинки = 3;
				ИначеЕсли СтрокаДерева.ПакетРабот И НЕ СтрокаДерева.МодельПакетаРабот Тогда      
					СтрокаДерева.ИндексКартинки = 2;
				ИначеЕсли СтрокаДерева.МодельПакетаРабот Тогда
					СтрокаДерева.ИндексКартинки = 0;
				Иначе
					СтрокаДерева.ИндексКартинки = 1;
				КонецЕсли;
				
				СтрокаДерева.СсылкаНаЗеркальныйПроект = СтрокаЗадача.СсылкаНаЗеркальныйПроект;
				Если ЗначениеЗаполнено(ТекЗадача) И (СтрокаДерева.ПроектнаяЗадача = ТекЗадача 
					ИЛИ СтрокаДерева.СсылкаНаЗеркальныйПроект = ТекЗадача) Тогда      
					
					СтрокаДерева.ТекущаяЗадача = Истина; 					
					
				КонецЕсли; 
				
				НовыеЭлементы.Добавить(СтрокаДерева);
				НайденоНовыхЭлементов = НайденоНовыхЭлементов + 1;
			КонецЦикла;	
			
			ЭлементРодитель.Значение.Строки.Сортировать("КодСДР");
		КонецЦикла;	
		
		Если НайденоНовыхЭлементов = 0 Тогда      
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(врТаблицаДанных, "ТаблицаДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиДереваЗадачВОбъект(пПроект)
	
	Если НЕ ЗначениеЗаполнено(пПроект) Тогда  
		Возврат;
	КонецЕсли;	
	
	СтрокиДереваЗадачВОбъектРекурсивно(ДеревоЗадач.ПолучитьЭлементы(), Объект.Задачи);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиЗадачИзОбъекта(пПроект)
	
	Найдено = Объект.Задачи.НайтиСтроки(Новый Структура("Проект", пПроект)); 
	КолСтрок = Найдено.Количество();
	
	Пока КолСтрок > 0 Цикл 
		Объект.Задачи.Удалить(Найдено[КолСтрок - 1]);			
		КолСтрок = КолСтрок - 1;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиДереваЗадачВОбъектРекурсивно(СтрокиЗадач, Таблица)

	Для Каждого Строка Из СтрокиЗадач Цикл 
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		СтрокиДереваЗадачВОбъектРекурсивно(Строка.ПолучитьЭлементы(), Таблица);
	КонецЦикла;	 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьДеревоЗадачНаФорме(ЭтаФорма) 
	ЭтаФорма.ДеревоЗадач.ПолучитьЭлементы().Очистить();
КонецПроцедуры

&НаСервере
Функция ЗапросСписокЗадачПоПроекту()
	
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	        |	РегСвойства.ПроектнаяЗадача КАК ПроектнаяЗадача,
	        |	РегСвойства.ЗадачаРодитель КАК ЗадачаРодитель,
	        |	РегСвойства.ЭтоПакетРабот КАК ЭтоПакетРабот,
	        |	РегСвойства.ЭтоМодельПакетаРабот КАК ЭтоМодельПакетаРабот,
	        |	РегСвойства.ЭтоВеха КАК ЭтоВеха,
	        |	РегСвойства.НазваниеЗадачи КАК НазваниеЗадачи,
	        |	РегСДР.КодСДР КАК КодСДР,
	        |	РегСДР.Ссылка КАК СсылкаНаЗеркальныйПроект
	        |ИЗ
	        |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &текВерсия) КАК РегСвойства
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК РегСДР
	        |		ПО РегСвойства.ПроектнаяЗадача = РегСДР.СсылкаНаПроектнуюЗадачу
	        |ГДЕ
	        |	РегСвойства.ВыводитьВСводныйСтатусОтчет
	        |	И НЕ РегСвойства.ЗадачаОтменена";
		
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоЗадачФормыПоПромежуточномуДереву(ТекПроект)

	тТаблицаДанных = РеквизитФормыВЗначение("ТаблицаДанных");
	
	// очистка старых данных
	ОчиститьСтрокиДереваПроекта(ТекПроект);

	СтрокиКорня = тТаблицаДанных.Строки;	
	
	ПеренестиСтрокиИзДереваВДеревоРекурсивно(СтрокиКорня, ДеревоЗадач.ПолучитьЭлементы(), 0, ТекПроект);
	
КонецПроцедуры 

&НаСервере
Процедура ПеренестиСтрокиИзДереваВДеревоРекурсивно(СтрокиДерева, СтрокиЗадач, Уровень, ТекПроект)

	Для Каждого СтрокаИсточник Из СтрокиДерева Цикл 	
			
		НоваяСтрока = СтрокиЗадач.Добавить();
		
		СписокСвойств = "ИндексКартинки";
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник, СписокСвойств);	
			
		НоваяСтрока.Проект = ТекПроект;	
		НоваяСтрока.ЗадачаПредставление = СтрокаИсточник.НазваниеПроектнойЗадачи;		
		НоваяСтрока.ЗадачаСсылка = СтрокаИсточник.ПроектнаяЗадача;
		НоваяСтрока.Уровень = Уровень;	
		
		НоваяСтрока.Родитель = ?(СтрокаИсточник.Родитель = Неопределено, Неопределено, СтрокаИсточник.Родитель.ПроектнаяЗадача);
		
		ПеренестиСтрокиИзДереваВДеревоРекурсивно(СтрокаИсточник.Строки, НоваяСтрока.ПолучитьЭлементы(), Уровень + 1, ТекПроект);
		
	КонецЦикла;                        	 

КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДеревоЗадачНаФормеПоДаннымОбъекта(ЭтаФорма, ТекПроект = Неопределено)

	тЗадачи = ЭтаФорма.Объект.Задачи;
	
	Если тЗадачи.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	Уровень = 0;
	
	ОтборСтрок = Новый Структура("Уровень", Уровень);
	Если ТекПроект <> Неопределено Тогда 
		ОтборСтрок.Вставить("Проект", ТекПроект);
	КонецЕсли;
	
	СтрокиНайдено = тЗадачи.НайтиСтроки(ОтборСтрок); 
	
	Для Каждого Строка Из СтрокиНайдено Цикл 	
		НоваяСтрока = ЭтаФорма.ДеревоЗадач.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ВывестиПодчиненныеСтроки(НоваяСтрока.ПолучитьЭлементы(), тЗадачи, Строка.ЗадачаСсылка, Строка.Проект, Уровень + 1);
	КонецЦикла;
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиПодчиненныеСтроки(СтрокиЗадач, Таблица, Родитель, ТекПроект, Уровень)
	
	СтрокиНайдено = Таблица.НайтиСтроки(Новый Структура("Родитель, Проект, Уровень", Родитель, ТекПроект, Уровень)); 
	
	Для Каждого Строка Из СтрокиНайдено Цикл 	
		НоваяСтрока = СтрокиЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		ВывестиПодчиненныеСтроки(НоваяСтрока.ПолучитьЭлементы(), Таблица, Строка.ЗадачаСсылка, ТекПроект, Уровень + 1);
	КонецЦикла;	 

КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСведенияОПроектеВТекущейСтроке()

	Документы.упоСтатусОтчетПоПроекту.ЗаполнитьСведенияОПроектеВСводном(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоЗадач(Дерево = Неопределено)
	Если Дерево = Неопределено Тогда
		Дерево = ДеревоЗадач.ПолучитьЭлементы();
	КонецЕсли;
	Для Каждого Элемент Из Дерево Цикл
		УИД = Элемент.ПолучитьИдентификатор();
		Элементы.ДеревоЗадач.Развернуть(УИД, Истина);
		РазвернутьДеревоЗадач(Элемент.ПолучитьЭлементы());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПроектыВыбор(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПодобратьПроектыВыборСервер(РезультатВыбора);
	
	Модифицированность = Истина;
	
	ПриИзмененииВыделенногоПроекта();
	
КонецПроцедуры 

&НаСервере
Процедура ПодобратьПроектыВыборСервер(РезультатВыбора)
	
	СтруктураПоиска = Новый Структура("Проект");
	
	Для Каждого ЭлементСписка Из РезультатВыбора Цикл
		
		СтруктураПоиска.Проект = ЭлементСписка.Значение;
		НайденныеСтроки = Объект.Проекты.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.Проекты.Добавить();
			НоваяСтрока.Проект = ЭлементСписка.Значение;
			
			Элементы.Проекты.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			
			ЗаполнитьСведенияОПроектеВТекущейСтроке();
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ОчиститьСтрокиДереваПроекта(ТекПроект)

	СтрокиДереваПроекты = ДеревоЗадач.ПолучитьЭлементы();
	
	СтрокиКУдалению = Новый Массив;
	
	Для Каждого Строка Из СтрокиДереваПроекты Цикл 		
		Если Строка.Проект = ТекПроект Тогда 
			СтрокиКУдалению.Добавить(Строка);
		КонецЕсли; 
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из СтрокиКУдалению Цикл 	
		СтрокиДереваПроекты.Удалить(УдаляемаяСтрока);	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти  
