
//100 - Сотрудники (пользователи) - обновляется 1 раз в час.
//101 - Должности С (типовые должности) - обновляется 1 раз в час.
//119 - Связи подчиненности (Руководители) - обновляется 1 раз в час, полное замещение справочника в Request.
//134 - Штатное расписание (Должности S) - обновляется 1 раз в час.
//137 - Опоздания (Нарушения КРВ) - обновляется 1 раз в час, полное замещение справочника в Request.
//173 - Замещения - обновляется 1 раз в час.
			  
			  
Функция ПодготовитьПараметрыСообщения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДействиеОбмена");
	Результат.Вставить("ОснованиеСобытияОбъект"); 
	Результат.Вставить("ДопАналитика");
	Результат.Вставить("ИмяСобытия"); 
	Результат.Вставить("СобытиеСсылка");
	Результат.Вставить("ДополнительныеПараметры");
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьСообщениеОбменаПоОснованиюСобытия(ПараметрыСообщения, Отказ) Экспорт   
	
	Результат = "";  
	
	Если Не ЗначениеЗаполнено(ПараметрыСообщения.ИмяСобытия) Тогда
		ОбработчикОбъекта = ПараметрыСообщения.ОснованиеСобытияОбъект.Метаданные().Имя; 
	Иначе
	    ОбработчикОбъекта = ПараметрыСообщения.ИмяСобытия; 
	Конецесли;
	
	Попытка
		
		Выполнить(СтрШаблон("Результат = СформироватьДанныеДляОтправкиВRequest%1(ПараметрыСообщения, Отказ)", ОбработчикОбъекта));
		
	Исключение 
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось подготовить данные для отправки в Request по причине: %1", ОписаниеОшибки())); 
				
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции 

Функция СформироватьДанныеДляОтправкиВRequestСотрудники(ПараметрыСообщения, Отказ)//100 
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат ПодготовитьСообщениеДляСотрудника(ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка, ПараметрыСообщения, Отказ);

КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestУтверждениеШтатногоРасписания(ПараметрыСообщения, Отказ) 
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат СформироватьДанныеДляОтправкиВRequestШтатноеРасписание(ПараметрыСообщения, Отказ)
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestШтатноеРасписание(ПараметрыСообщения, Отказ)//134 (УтверждениеШтатногоРасписания)
	
	ТаблицаВФормате = ПодготовитьТаблицуДляЗагрузкиВRequest("ШтатноеРасписание"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УтверждениеШтатногоРасписанияПозиции.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТ_ПозицияШР
		|ИЗ
		|	Документ.УтверждениеШтатногоРасписания.Позиции КАК УтверждениеШтатногоРасписанияПозиции
		|ГДЕ
		|	УтверждениеШтатногоРасписанияПозиции.Ссылка = &ДокСсылка
		|	И УтверждениеШтатногоРасписанияПозиции.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСПозициямиШтатногоРасписания.ЗакрытьПозицию)
		|	И УтверждениеШтатногоРасписанияПозиции.Позиция В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ СотрудникПользователя
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ТекущийПользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	СУММА(ЗанятостьПозицийШтатногоРасписанияИнтервальный.КоличествоСтавок) КАК КоличествоСтавок
		|ПОМЕСТИТЬ ВТ_ЗанятостьСтавок
		|ИЗ
		|	РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИнтервальный КАК ЗанятостьПозицийШтатногоРасписанияИнтервальный
		|ГДЕ
		|	НЕ ЗанятостьПозицийШтатногоРасписанияИнтервальный.ВидЗанятостиПозиции В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиПозицийШтатногоРасписания.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиПозицийШтатногоРасписания.Свободна))
		|	И &ДатаОстатков МЕЖДУ ЗанятостьПозицийШтатногоРасписанияИнтервальный.ДатаНачала И ЗанятостьПозицийШтатногоРасписанияИнтервальный.ДатаОкончания
		|	И ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтатноеРасписание.Наименование КАК НаименованиеШтатнойДолжности,
		|	ШтатноеРасписание.ID_ДолжностьS КАК IDШтатнойДолжности,
		|	ШтатноеРасписание.ИКТ_ДолжностьС.IDДолжностьС КАК IDДолжностиС,
		|	ПРЕДСТАВЛЕНИЕ(ШтатноеРасписание.ИКТ_ДолжностьС) КАК НаименованиеДолжностиС,
		|	ПРЕДСТАВЛЕНИЕ(ШтатноеРасписание.ИКТ_ДолжностьС) КАК ТекстДолжностиС,
		|	ШтатноеРасписание.ИКТ_Грейд КАК КатегорияСотрудника,
		|	ШтатноеРасписание.ДатаУтверждения КАК ДатаУтверждения,
		//|	ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.ИКТ_IDСП, """") КАК IDСтруктурыПредприятие,
		//|	ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.Наименование, """") КАК НаименованиеСтруктурыПредприятия, 
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.ИКТ_НаименованиеПолное, """") = """"
		//|			ТОГДА ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.Наименование, """")
		//|		ИНАЧЕ ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.ИКТ_НаименованиеПолное, """")
		//|	КОНЕЦ КАК НаименованиеПолноеСтруктурыПредприятия,  
		|	""50185764"" КАК IDОрганизационнойЕдиницы,
		|	""СНД"" КАК НаименованиеОрганизационнойЕдиницы,
       	|	СТРОКА(ШтатноеРасписание.Подразделение.ГоловнаяОрганизация.ИКТ_ОсновнаяОрганизация.НаименованиеСокращенное) КАК НаименованиеПолноеОрганизационнойЕдиницы,
		//|	ШтатноеРасписание.ИКТ_СозданиеПремийШтраф КАК ИКТ_СозданиеПремийШтраф,  
		|	ВЫБОР
		|		КОГДА ШтатноеРасписание.ИКТ_ДолжностьС.СозданиеПремийШтраф = Истина
		|			ТОГДА ""X""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ИКТ_СозданиеПремийШтраф,
		|	ШтатноеРасписание.ИКТ_ТребуетсяМедОсмотр КАК ИКТ_ТребуетсяМедОсмотр,
		//|	ШтатноеРасписание.ИКТ_НомерГруппы КАК ИКТ_Группа,
		|	ШтатноеРасписание.ИКТ_НомерГруппыПодбора КАК ИКТ_ГруппаПодбора,
		|	ШтатноеРасписание.ИКТ_БизнесЕдиница.ID КАК BE,
		|	ШтатноеРасписание.ИКТ_СрокДействияСтатусаВакансии КАК ИКТ_СрокДействияСтатусаВакансии,
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусШЕ,
		//|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ШтатноеРасписание.Ссылка) КАК ГУИД_1С,
		|	СТРОКА(ШтатноеРасписание.ID_ДолжностьS) + ""/001"" КАК ID_Должность_S,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы,
		|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ШтатноеРасписание.КоличествоСтавок - ЕСТЬNULL(ВТ_ЗанятостьСтавок.КоличествоСтавок, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СтатусВакансии
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|		ПО (МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция = ШтатноеРасписание.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СотрудникПользователя КАК СотрудникПользователя
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗанятостьСтавок КАК ВТ_ЗанятостьСтавок
		|		ПО (ВТ_ЗанятостьСтавок.ПозицияШтатногоРасписания = ШтатноеРасписание.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборСправочнику = ИСТИНА
		|				ТОГДА ШтатноеРасписание.Ссылка В (&Ссылка)
		|			ИНАЧЕ ШтатноеРасписание.Ссылка В
		|					(ВЫБРАТЬ
		|						ВТ_ПозицияШР.Позиция КАК Позиция
		|					ИЗ
		|						ВТ_ПозицияШР КАК ВТ_ПозицияШР)
		|		КОНЕЦ";
	
	Если ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект) = Тип("СправочникОбъект.ШтатноеРасписание")
		ИЛИ ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		
		Если ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект) = Тип("СправочникОбъект.ШтатноеРасписание") Тогда
			Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка);
		Иначе
			Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект);  
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОтборСправочнику", Истина); 
		Запрос.УстановитьПараметр("ДокСсылка", Документы.УтверждениеШтатногоРасписания.ПустаяСсылка());
		
	Иначе
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ДопАналитика);
		Запрос.УстановитьПараметр("ДокСсылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка);  
		Запрос.УстановитьПараметр("ОтборСправочнику", ЛОЖЬ);  
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C");
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса());   
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);  
	
	ТаблицаДанных1С = Запрос.Выполнить().Выгрузить();
	
	ЗаполнитьТаблицуДанныхПоРезультатуЗапроса(ТаблицаВФормате, ТаблицаДанных1С);		
					
	МассивДанных = ТаблицуЗначенийВМассивСтруктур(ТаблицаВФормате, "Заголовок");
	
	Если МассивДанных.Количество() = 0 Тогда 
		Отказ = Истина;
		Возврат "";
	КонецЕсли;   
		
	Возврат СформироватьТекстJSON(МассивДанных);
	
КонецФункции 

Функция СформироватьДанныеДляОтправкиВRequestИзменениеШтатногоРасписания(ПараметрыСообщения, Отказ) 
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат СформироватьДанныеДляОтправкиВRequestШтатноеРасписаниеИзменение(ПараметрыСообщения, Отказ)
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestШтатноеРасписаниеИзменение(ПараметрыСообщения, Отказ)//134 (ИзменениеШтатногоРасписания)
	
	ТаблицаВФормате = ПодготовитьТаблицуДляЗагрузкиВRequest("ШтатноеРасписание"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеШтатногоРасписанияПозиции.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТ_ПозицияШР
		|ИЗ
		|	Документ.ИзменениеШтатногоРасписания.Позиции КАК ИзменениеШтатногоРасписанияПозиции
		|ГДЕ
		|	ИзменениеШтатногоРасписанияПозиции.Ссылка = &ДокСсылка
		|	И ИзменениеШтатногоРасписанияПозиции.Действие <> ЗНАЧЕНИЕ(Перечисление.ДействияСПозициямиШтатногоРасписания.ЗакрытьПозицию)
		|	И ИзменениеШтатногоРасписанияПозиции.Позиция В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ СотрудникПользователя
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ТекущийПользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	СУММА(ЗанятостьПозицийШтатногоРасписанияИнтервальный.КоличествоСтавок) КАК КоличествоСтавок
		|ПОМЕСТИТЬ ВТ_ЗанятостьСтавок
		|ИЗ
		|	РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИнтервальный КАК ЗанятостьПозицийШтатногоРасписанияИнтервальный
		|ГДЕ
		|	НЕ ЗанятостьПозицийШтатногоРасписанияИнтервальный.ВидЗанятостиПозиции В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиПозицийШтатногоРасписания.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиПозицийШтатногоРасписания.Свободна))
		|	И &ДатаОстатков МЕЖДУ ЗанятостьПозицийШтатногоРасписанияИнтервальный.ДатаНачала И ЗанятостьПозицийШтатногоРасписанияИнтервальный.ДатаОкончания
		|	И ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтатноеРасписание.Наименование КАК НаименованиеШтатнойДолжности,
		|	ШтатноеРасписание.ID_ДолжностьS КАК IDШтатнойДолжности,
		|	ШтатноеРасписание.ИКТ_ДолжностьС.IDДолжностьС КАК IDДолжностиС,
		|	ПРЕДСТАВЛЕНИЕ(ШтатноеРасписание.ИКТ_ДолжностьС) КАК НаименованиеДолжностиС,
		|	ПРЕДСТАВЛЕНИЕ(ШтатноеРасписание.ИКТ_ДолжностьС) КАК ТекстДолжностиС,
		|	ШтатноеРасписание.ИКТ_Грейд КАК КатегорияСотрудника,
		|	ШтатноеРасписание.ДатаУтверждения КАК ДатаУтверждения,
		//|	ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.ИКТ_IDСП, """") КАК IDСтруктурыПредприятие,
		//|	ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.Наименование, """") КАК НаименованиеСтруктурыПредприятия, 
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.ИКТ_НаименованиеПолное, """") = """"
		//|			ТОГДА ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.Наименование, """")
		//|		ИНАЧЕ ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение.ИКТ_НаименованиеПолное, """")
		//|	КОНЕЦ КАК НаименованиеПолноеСтруктурыПредприятия,  
		|	""50185764"" КАК IDОрганизационнойЕдиницы,
		|	""СНД"" КАК НаименованиеОрганизационнойЕдиницы,
       	|	СТРОКА(ШтатноеРасписание.Подразделение.ГоловнаяОрганизация.ИКТ_ОсновнаяОрганизация.НаименованиеСокращенное) КАК НаименованиеПолноеОрганизационнойЕдиницы,
		//|	ШтатноеРасписание.ИКТ_СозданиеПремийШтраф КАК ИКТ_СозданиеПремийШтраф,  
		|	ВЫБОР
		|		КОГДА ШтатноеРасписание.ИКТ_ДолжностьС.СозданиеПремийШтраф = Истина
		|			ТОГДА ""X""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ИКТ_СозданиеПремийШтраф,
		|	ШтатноеРасписание.ИКТ_ТребуетсяМедОсмотр КАК ИКТ_ТребуетсяМедОсмотр,
		//|	ШтатноеРасписание.ИКТ_НомерГруппы КАК ИКТ_Группа,
		|	ШтатноеРасписание.ИКТ_НомерГруппыПодбора КАК ИКТ_ГруппаПодбора,
		|	ШтатноеРасписание.ИКТ_БизнесЕдиница.ID КАК BE,
		|	ШтатноеРасписание.ИКТ_СрокДействияСтатусаВакансии КАК ИКТ_СрокДействияСтатусаВакансии,
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусШЕ,
		//|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ШтатноеРасписание.Ссылка) КАК ГУИД_1С,
		|	СТРОКА(ШтатноеРасписание.ID_ДолжностьS) + ""/001"" КАК ID_Должность_S,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы,
		|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ШтатноеРасписание.КоличествоСтавок - ЕСТЬNULL(ВТ_ЗанятостьСтавок.КоличествоСтавок, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СтатусВакансии
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|		ПО (МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция = ШтатноеРасписание.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СотрудникПользователя КАК СотрудникПользователя
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗанятостьСтавок КАК ВТ_ЗанятостьСтавок
		|		ПО (ВТ_ЗанятостьСтавок.ПозицияШтатногоРасписания = ШтатноеРасписание.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборСправочнику = ИСТИНА
		|				ТОГДА ШтатноеРасписание.Ссылка В (&Ссылка)
		|			ИНАЧЕ ШтатноеРасписание.Ссылка В
		|					(ВЫБРАТЬ
		|						ВТ_ПозицияШР.Позиция КАК Позиция
		|					ИЗ
		|						ВТ_ПозицияШР КАК ВТ_ПозицияШР)
		|		КОНЕЦ";
	
	Если ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект) = Тип("СправочникОбъект.ШтатноеРасписание")
		ИЛИ ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		
		Если ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект) = Тип("СправочникОбъект.ШтатноеРасписание") Тогда
			Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка);
		Иначе
			Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект);  
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОтборСправочнику", Истина); 
		Запрос.УстановитьПараметр("ДокСсылка", Документы.УтверждениеШтатногоРасписания.ПустаяСсылка());
		
	Иначе
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ДопАналитика);
		Запрос.УстановитьПараметр("ДокСсылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка);  
		Запрос.УстановитьПараметр("ОтборСправочнику", ЛОЖЬ);  
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C");
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса());   
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);  
	
	ТаблицаДанных1С = Запрос.Выполнить().Выгрузить();
	
	ЗаполнитьТаблицуДанныхПоРезультатуЗапроса(ТаблицаВФормате, ТаблицаДанных1С);		
					
	МассивДанных = ТаблицуЗначенийВМассивСтруктур(ТаблицаВФормате, "Заголовок");
	
	Если МассивДанных.Количество() = 0 Тогда 
		Отказ = Истина;
		Возврат "";
	КонецЕсли;   
		
	Возврат СформироватьТекстJSON(МассивДанных);
	
КонецФункции 

Функция СформироватьДанныеДляОтправкиВRequestИКТ_ДолжностиС(ПараметрыСообщения, Отказ)//101
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ТаблицаВФормате = ПодготовитьТаблицуДляЗагрузкиВRequest("Должности"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ СотрудникПользователя
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ТекущийПользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДолжностиС.Наименование КАК НазваниеДолжностиС,
		|	ДолжностиС.IDДолжностьС КАК КодДолжностиС,
		|	ДолжностиС.ДоступКНД КАК ДоступКНД,
		|	ДолжностиС.ТрВодитУдостоверение КАК ТрВодитУдостоверение,
		|	"""" КАК АртикулДолжностиС,
		|	ИСТИНА КАК ПолнаяПроверка,
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусАктивности,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДолжностиС.Ссылка) КАК ГУИД_1С,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы,
		|	ЕСТЬNULL(СотрудникПользователя.ФизическоеЛицо.ИКТ_ТабельныйНомер, """") КАК ТабельныйНомерИнициатораЗаписи
		|ИЗ
		|	Справочник.ИКТ_ДолжностиС КАК ДолжностиС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СотрудникПользователя КАК СотрудникПользователя
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ДолжностиС.Ссылка В(&Ссылка)";
	
	Если ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект) = Тип("СправочникОбъект.ИКТ_ДолжностиС") Тогда
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка); 
	Иначе
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект); 
	КонецЕсли;
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C");
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);
	
	ТаблицаДанных1С = Запрос.Выполнить().Выгрузить();
		
	ЗаполнитьТаблицуДанныхПоРезультатуЗапроса(ТаблицаВФормате, ТаблицаДанных1С);
	
	МассивДанных = ТаблицуЗначенийВМассивСтруктур(ТаблицаВФормате, "Заголовок");
	
	Если МассивДанных.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат "";
	КонецЕсли;
	
	Возврат СформироватьТекстJSON(МассивДанных);
	
КонецФункции 

Функция СформироватьДанныеДляОтправкиВRequestИКТ_Руководители(ПараметрыСообщения, Отказ)//119
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда 
		
		Возврат ПодготовитьИнформациюПоЭскалацииСвязей(ПолучитьСотрудниковУОС(), ПараметрыСообщения, Отказ);
		
	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;	
КонецФункции 

Функция СформироватьДанныеДляОтправкиВRequestЗамещения(ПараметрыСообщения, Отказ)//173
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Замещения Тогда 
		
		Возврат ПодготовитьИнформациюПоЗамещения(ПараметрыСообщения, Отказ);
	   		
	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;	
КонецФункции 

Функция ПолучитьСотрудниковУОС()
	
	Сотрудники = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗанятостьПозицийШтатногоРасписанияСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЗанятостьПозицийШтатногоРасписания.СрезПоследних(&ДатаСреза, ГоловнаяОрганизация.ИКТ_УУ = ИСТИНА) КАК ЗанятостьПозицийШтатногоРасписанияСрезПоследних
		|ГДЕ
		|	ЗанятостьПозицийШтатногоРасписанияСрезПоследних.ВидЗанятостиПозиции = &ВидЗанятостиПозиции
		|	И ЗанятостьПозицийШтатногоРасписанияСрезПоследних.Сотрудник.ВАрхиве = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("ВидЗанятостиПозиции", Перечисления.ВидыЗанятостиПозицийШтатногоРасписания.Занята);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Сотрудники.Добавить(Выборка.Сотрудник);
				
	КонецЦикла; 
	
	Возврат Сотрудники;
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestПриемНаРаботу(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Сотрудники Тогда
		
		Возврат ПодготовитьСообщениеДляСотрудника(ПараметрыСообщения.ОснованиеСобытияОбъект.Сотрудник, ПараметрыСообщения, Отказ); 
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда 
		
		Сотрудники = ПолучитьСотрудниковУОС();
		
		Возврат ПодготовитьИнформациюПоЭскалацииСвязей(Сотрудники, ПараметрыСообщения, Отказ);
				
	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestПриемНаРаботуСписком(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ПараметрыСообщения.ДопАналитика) Тогда  
		
		Сотрудники = ПараметрыСообщения.ДопАналитика;
		
	Иначе
		
		Сотрудники = ПараметрыСообщения.ОснованиеСобытияОбъект.Сотрудники.ВыгрузитьКолонку("Сотрудник");    
		
	КонецЕсли;  
	
	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Сотрудники Тогда
		
		Возврат ПодготовитьСообщениеДляСотрудника(Сотрудники, ПараметрыСообщения, Отказ); 
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда 
		
		Сотрудники = ПолучитьСотрудниковУОС();
		
		Возврат ПодготовитьИнформациюПоЭскалацииСвязей(Сотрудники, ПараметрыСообщения, Отказ); 
		
	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestУвольнение(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Сотрудники Тогда
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Удаление;
		
		Возврат ПодготовитьСообщениеДляСотрудника(ПараметрыСообщения.ОснованиеСобытияОбъект.Сотрудник, ПараметрыСообщения, Отказ); 
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда 
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Удаление;
		
		Сотрудники = ПолучитьСотрудниковУОС();
		
		Возврат ПодготовитьИнформациюПоЭскалацииСвязей(Сотрудники, ПараметрыСообщения, Отказ); 

	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestУвольнениеСписком(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСообщения.ДопАналитика) Тогда  
		
		Сотрудники = ПараметрыСообщения.ДопАналитика;
		
	Иначе
		
		Сотрудники = ПараметрыСообщения.ОснованиеСобытияОбъект.Сотрудники.ВыгрузитьКолонку("Сотрудник");    
		
	КонецЕсли;   
	
	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Сотрудники Тогда
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Удаление;
		
		Возврат ПодготовитьСообщениеДляСотрудника(Сотрудники, ПараметрыСообщения, Отказ); 
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда 
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Удаление;
		
		Сотрудники = ПолучитьСотрудниковУОС();
		
		Возврат ПодготовитьИнформациюПоЭскалацииСвязей(Сотрудники, ПараметрыСообщения, Отказ); 
		
	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestКадровыйПеревод(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Сотрудники Тогда
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Изменение;
		
		Возврат ПодготовитьСообщениеДляСотрудника(ПараметрыСообщения.ОснованиеСобытияОбъект.Сотрудник, ПараметрыСообщения, Отказ); 
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда 
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Изменение;
		
		Сотрудники = ПолучитьСотрудниковУОС();
		
		Возврат ПодготовитьИнформациюПоЭскалацииСвязей(Сотрудники, ПараметрыСообщения, Отказ);
		
	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;

КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestКадровыйПереводСписком(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПараметрыСообщения.ДопАналитика) Тогда  
		
		Сотрудники = ПараметрыСообщения.ДопАналитика;
		
	Иначе
				
		Сотрудники = ПараметрыСообщения.ОснованиеСобытияОбъект.Сотрудники.ВыгрузитьКолонку("Сотрудник");    
		
	КонецЕсли;   
	
	ТипСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ТипСобытия");
	
	Если ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.Сотрудники Тогда
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Изменение;
		
		Возврат ПодготовитьСообщениеДляСотрудника(Сотрудники, ПараметрыСообщения, Отказ); 
		
	ИначеЕсли ТипСобытия = Перечисления.ИКТ_RequestТипыСобытий.ЭскалацияСвязей Тогда 
		
		ПараметрыСообщения.ДействиеОбмена = Перечисления.ИКТ_ДействияОбмена.Изменение;
		
		Сотрудники = ПолучитьСотрудниковУОС();
		
		Возврат ПодготовитьИнформациюПоЭскалацииСвязей(Сотрудники, ПараметрыСообщения, Отказ); 
		
	Иначе
		
		Отказ = Истина;
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция ПодготовитьСообщениеДляСотрудника(Сотрудники, ПараметрыСообщения, Отказ)//100
	
	ТаблицаВФормате = ПодготовитьТаблицуДляЗагрузкиВRequest("Сотрудники"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ СотрудникПользователя
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &ТекущийПользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадроваяИсторияСотрудников.Период КАК Период,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|			КОГДА КадроваяИсторияСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)
		|				ТОГДА КадроваяИсторияСотрудников.Период
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ) КАК ДатаПриема,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КадроваяИсторияСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|				ТОГДА КадроваяИсторияСотрудников.Период
		|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|		КОНЕЦ) КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТ_ДатыПриемаУвольнения
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|ГДЕ
		|	КадроваяИсторияСотрудников.Сотрудник В(&Ссылка)
		|	И КадроваяИсторияСотрудников.ВидСобытия В (ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием), ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение))
		|
		|СГРУППИРОВАТЬ ПО
		|	КадроваяИсторияСотрудников.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	СУММА(ЗанятостьПозицийШтатногоРасписанияИнтервальный.КоличествоСтавок) КАК КоличествоСтавок
		|ПОМЕСТИТЬ ВТ_ЗанятостьСтавок
		|ИЗ
		|	РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИнтервальный КАК ЗанятостьПозицийШтатногоРасписанияИнтервальный
		|ГДЕ
		|	НЕ ЗанятостьПозицийШтатногоРасписанияИнтервальный.ВидЗанятостиПозиции В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиПозицийШтатногоРасписания.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиПозицийШтатногоРасписания.Свободна))
		|	И &ДатаОстатков МЕЖДУ ЗанятостьПозицийШтатногоРасписанияИнтервальный.ДатаНачала И ЗанятостьПозицийШтатногоРасписанияИнтервальный.ДатаОкончания
		|	И ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗанятостьПозицийШтатногоРасписанияИнтервальный.ПозицияШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо.ИКТ_ТабельныйНомер КАК ТабельныйНомер,
		|	Сотрудники.ФизическоеЛицо.ФИО КАК ФИО,
		|	ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ID_ДолжностьS, """") КАК IDШтатнойДолжности,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_ДолжностьС), """") КАК НаименованиеДолжностиС,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_ДолжностьС.IDДолжностьС), """") КАК IDДолжностиС,
		|	"""" КАК IDОбъектаРеквест,
		|	ЕСТЬNULL(ФизическиеЛицаКонтактнаяИнформация.Представление, """") КАК ЭлектроннаяПочта,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ДатаУтверждения КАК ДатаУтвержденияШтатнойДолжности,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_НазваниеРазделаПерсонала.Наименование КАК НазваниеРазделаПерсонала,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.Наименование КАК НаименованиеШтатнойДолжности,
		|	""50185764"" КАК IDОрганизационнойЕдиницы,
		|	СТРОКА(КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.Подразделение.ГоловнаяОрганизация.ИКТ_ОсновнаяОрганизация.НаименованиеСокращенное) КАК НаименованиеОрганизационнойЕдиницы,
		|	Сотрудники.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
		|	Сотрудники.ФизическоеЛицо.Пол КАК ПолФизическогоЛица,
		|	КадроваяИсторияСотрудниковСрезПоследних.Период КАК ДатаНазначенияНаДолжностьС,
		|	КадроваяИсторияСотрудниковСрезПоследних.Период КАК ДатаНазначенияНаШтатнуюДолжность,
		|	ВТ_ДатыПриемаУвольнения.ДатаПриема КАК ДатаПриема,
		|	ВТ_ДатыПриемаУвольнения.ДатаУвольнения КАК ДатаУвольнения,
		|	ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_ПроцентЗанятости, 0) КАК ПроцентЗанятости,
		|	ДокументыФизическихЛицПаспорт.Серия КАК СерияПаспорта,
		|	ДокументыФизическихЛицПаспорт.Номер КАК НомерПаспорта,
		|	ДокументыФизическихЛицПаспорт.ДатаВыдачи КАК ДатаНачалаДействияПаспорта,
		|	ДокументыФизическихЛицПаспорт.СрокДействия КАК ДатаОкончанияДействияПаспорта,
		|	ДокументыФизическихЛицЗагранПаспорт.Серия КАК ЗагранПаспортСерия,
		|	ДокументыФизическихЛицЗагранПаспорт.Номер КАК ЗагранПаспортНомер,
		|	ДокументыФизическихЛицЗагранПаспорт.СрокДействия КАК ЗагранПаспортСрокДействия,
		|	ДокументыФизическихЛицЗагранПаспорт.ФамилияЛатиницей КАК ЗагранПаспортФамилия,
		|	ДокументыФизическихЛицЗагранПаспорт.ИмяЛатиницей КАК ЗагранПаспортИмя,
		|	"""" КАК ЗагранПаспортОтчество,
		|	ВЫБОР
		|		КОГДА ДокументыФизическихЛицВУ.Серия ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ВодительскоеУдостоверение,
		|	ДокументыФизическихЛицВУ.Серия КАК СерияВУ,
		|	ДокументыФизическихЛицВУ.Номер КАК НомерВУ,
		|	ДокументыФизическихЛицВУ.ДатаВыдачи КАК ДатаНачалаДействияВУ,
		|	ДокументыФизическихЛицВУ.СрокДействия КАК ДатаОкончанияДействияВУ,
		|	ЕСТЬNULL(НакопленныеСтажиФизическихЛиц.РазмерМесяцев, 0) КАК СтажРазмерМесяцев,
		|	ЕСТЬNULL(НакопленныеСтажиФизическихЛиц.РазмерДней, 0) КАК СтажДень,
		|	Сотрудники.ГоловнаяОрганизация.Наименование КАК НазваниеЮрЛица,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_Департамент.Наименование КАК КороткоеНазваниеДепартамента,
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусСотрудника,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Сотрудники.Ссылка) КАК ГУИД_1С,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы,
		|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ДатыПриемаУвольнения.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(ВТ_ДатыПриемаУвольнения.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтатусЗанятости,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_Грейд КАК КатегорияДолжности,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_БизнесЕдиница.ID КАК BE,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_НазваниеРазделаПерсонала.РазделПерсонала КАК РазделПерсонала,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_УровеньДоступа КАК УровниСотрудников,
		|	""X"" КАК Флаг,
		|	Сотрудники.Код КАК ТабельныйНомерЮОС,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.КоличествоСтавок, 0) - ЕСТЬNULL(ВТ_ЗанятостьСтавок.КоличествоСтавок, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК СтатусТабельногоНомераЮОС,
		|	Сотрудники.ГоловнаяОрганизация.ИКТ_IDЮрЛица КАК IDЮрЛица,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_Департамент.ИКТ_IDДепартамента КАК IDДепартамента
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|			ПО КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗанятостьСтавок КАК ВТ_ЗанятостьСтавок
		|			ПО КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию = ВТ_ЗанятостьСтавок.ПозицияШтатногоРасписания
		|		ПО (КадроваяИсторияСотрудниковСрезПоследних.Сотрудник = Сотрудники.Ссылка)
		|			И (КадроваяИсторияСотрудниковСрезПоследних.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|		ПО (ФизическиеЛицаКонтактнаяИнформация.Ссылка = Сотрудники.ФизическоеЛицо)
		|			И (ФизическиеЛицаКонтактнаяИнформация.Вид = &EmailФизЛица)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПриемаУвольнения КАК ВТ_ДатыПриемаУвольнения
		|		ПО Сотрудники.Ссылка = ВТ_ДатыПриемаУвольнения.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицПаспорт
		|		ПО Сотрудники.ФизическоеЛицо = ДокументыФизическихЛицПаспорт.Физлицо
		|			И (ДокументыФизическихЛицПаспорт.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)) 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицЗагранПаспорт
		|		ПО Сотрудники.ФизическоеЛицо = ДокументыФизическихЛицЗагранПаспорт.Физлицо
		|			И (ДокументыФизическихЛицЗагранПаспорт.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицВУ
		|		ПО Сотрудники.ФизическоеЛицо = ДокументыФизическихЛицВУ.Физлицо
		|			И (ДокументыФизическихЛицВУ.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НакопленныеСтажиФизическихЛиц КАК НакопленныеСтажиФизическихЛиц
		|		ПО Сотрудники.ФизическоеЛицо = НакопленныеСтажиФизическихЛиц.ФизическоеЛицо
		|			И (НакопленныеСтажиФизическихЛиц.ВидСтажа.Код = ""000000003"")
		|ГДЕ
		|	Сотрудники.Ссылка В(&Ссылка)
		|	И Сотрудники.ИКТ_НеСоздаватьИнцидентыКРВ = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудники); 
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C");
	Запрос.УстановитьПараметр("EmailФизЛица", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);  
	
	ТаблицаДанных1С = Запрос.Выполнить().Выгрузить(); 
	
	ТаблицаДанных1С.Колонки.Добавить("СтажГод", Новый ОписаниеТипов("Число"));
	ТаблицаДанных1С.Колонки.Добавить("СтажМесяц", Новый ОписаниеТипов("Число")); 
	
	Для каждого стр из ТаблицаДанных1С Цикл
		
		Стр.СтажГод           = Цел(Стр.СтажРазмерМесяцев / 12);
		Стр.СтажМесяц         = Стр.СтажРазмерМесяцев - Стр.СтажГод * 12; 
		Стр.IDДолжностиС      = СтрЗаменить(Стр.IDДолжностиС," ","");
		Стр.ТабельныйНомерЮОС = Прав(Стр.ТабельныйНомерЮОС,6);
		
		Если ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботу") ИЛИ ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка) = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда 
			Стр.СтатусЗанятости = 3;
			Стр.СтатусТабельногоНомераЮОС = 3;
		ИначеЕсли ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка) = Тип("ДокументСсылка.Увольнение") ИЛИ ТипЗнч(ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка) = Тип("ДокументСсылка.УвольнениеСписком") Тогда 	
			Стр.СтатусЗанятости = 0;
			Стр.СтатусТабельногоНомераЮОС = 0;
		Иначе	
			Стр.СтатусЗанятости = 3;
			Стр.СтатусТабельногоНомераЮОС = 3;
		КонецЕсли;
			
	КонецЦикла;
		
	ЗаполнитьТаблицуДанныхПоРезультатуЗапроса(ТаблицаВФормате, ТаблицаДанных1С);
	
	МассивДанных = ТаблицуЗначенийВМассивСтруктур(ТаблицаВФормате, "Заголовок");
	
	Если МассивДанных.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат "";
	КонецЕсли;
	
	Возврат СформироватьТекстJSON(МассивДанных);
	
КонецФункции

Функция ПодготовитьИнформациюПоЭскалацииСвязей(Сотрудники, ПараметрыСообщения, Отказ)//119
	
	ТаблицаВФормате = ПодготовитьТаблицуДляЗагрузкиВRequest("ЭскалацияСвязей"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусЗаписи, 
		|	""1234567890123456789012345"" КАК КлючЗаписи,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы,
		|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_АдминистративныйРуководительАР КАК АдминистративныйРуководительАР,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_ФункциональныйРуководительФР КАК ФункциональныйРуководительФР,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_ВышестоящийРуководительВР КАК ВышестоящийРуководительВР
		|ПОМЕСТИТЬ ВТ_ДанныеСотрудника
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&ДатаСобытия, Сотрудник В (&Ссылка)) КАК КадроваяИсторияСотрудниковСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|			ПО КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
		|		ПО (КадроваяИсторияСотрудниковСрезПоследних.Сотрудник = Сотрудники.Ссылка)
		|			И (КадроваяИсторияСотрудниковСрезПоследних.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|ГДЕ
		|	Сотрудники.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеСотрудника.ДолжностьПоШтатномуРасписанию.ID_ДолжностьS КАК IDШтатнойДолжности,
		|	ВТ_ДанныеСотрудника.АдминистративныйРуководительАР.Код КАК КодРуководителя,
		|	""004"" КАК ТипСвязи,
		|	ВТ_ДанныеСотрудника.Сотрудник.ФизическоеЛицо.ИКТ_ТабельныйНомер КАК ТабельныйНомер,
		|	ВТ_ДанныеСотрудника.АдминистративныйРуководительАР.ФизическоеЛицо.ИКТ_ТабельныйНомер КАК ТабельныйНомерРуководителя,
		|	""подчиняется в дисц. отн."" КАК НаименованиеСвязи,
		|	ВТ_ДанныеСотрудника.СтатусЗаписи КАК СтатусЗаписи,
		|	ВТ_ДанныеСотрудника.КлючЗаписи КАК КлючЗаписи,
		|	ВТ_ДанныеСотрудника.ИмяВнешнейСистемы КАК ИмяВнешнейСистемы
		|ИЗ
		|	ВТ_ДанныеСотрудника КАК ВТ_ДанныеСотрудника
		|ГДЕ
		|	ЕСТЬNULL(ВТ_ДанныеСотрудника.АдминистративныйРуководительАР.ФизическоеЛицо.ИКТ_ТабельныйНомер, """") <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеСотрудника.ДолжностьПоШтатномуРасписанию.ID_ДолжностьS,
		|	ВТ_ДанныеСотрудника.ФункциональныйРуководительФР.Код,
		|	""005"",
		|	ВТ_ДанныеСотрудника.Сотрудник.ФизическоеЛицо.ИКТ_ТабельныйНомер,
		|	ВТ_ДанныеСотрудника.ФункциональныйРуководительФР.ФизическоеЛицо.ИКТ_ТабельныйНомер,
		|	""подчиняется в функц. отн."",
		|	ВТ_ДанныеСотрудника.СтатусЗаписи,
		|	ВТ_ДанныеСотрудника.КлючЗаписи,
		|	ВТ_ДанныеСотрудника.ИмяВнешнейСистемы
		|ИЗ
		|	ВТ_ДанныеСотрудника КАК ВТ_ДанныеСотрудника
		|ГДЕ
		|	ЕСТЬNULL(ВТ_ДанныеСотрудника.ФункциональныйРуководительФР.ФизическоеЛицо.ИКТ_ТабельныйНомер, """") <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДанныеСотрудника.ДолжностьПоШтатномуРасписанию.ID_ДолжностьS,
		|	ВТ_ДанныеСотрудника.ВышестоящийРуководительВР.Код,
		|	""Z06"",
		|	ВТ_ДанныеСотрудника.Сотрудник.ФизическоеЛицо.ИКТ_ТабельныйНомер,
		|	ВТ_ДанныеСотрудника.ВышестоящийРуководительВР.ФизическоеЛицо.ИКТ_ТабельныйНомер,
		|	""подчиняется вышест. рук."",
		|	ВТ_ДанныеСотрудника.СтатусЗаписи,
		|	ВТ_ДанныеСотрудника.КлючЗаписи,
		|	ВТ_ДанныеСотрудника.ИмяВнешнейСистемы
		|ИЗ
		|	ВТ_ДанныеСотрудника КАК ВТ_ДанныеСотрудника
		|ГДЕ
		|	ЕСТЬNULL(ВТ_ДанныеСотрудника.ВышестоящийРуководительВР.ФизическоеЛицо.ИКТ_ТабельныйНомер, """") <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудники);
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C"); 
	Запрос.УстановитьПараметр("ДатаСобытия", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);
	
	ТаблицаДанных1С = Запрос.Выполнить().Выгрузить();  
	
	Для каждого стр из ТаблицаДанных1С Цикл
		
		Стр.КодРуководителя = Прав(стр.КодРуководителя, 8);
		
		Стр.КлючЗаписи = Строка(СокрЛП(стр.IDШтатнойДолжности) + "/" + СокрЛП(стр.КодРуководителя) + "/" + СокрЛП(стр.ТипСвязи) + "/" + "001");
		
	КонецЦикла;
	
	ЗаполнитьТаблицуДанныхПоРезультатуЗапроса(ТаблицаВФормате, ТаблицаДанных1С);		
					
	МассивДанных = ТаблицуЗначенийВМассивСтруктур(ТаблицаВФормате, "Заголовок");
	
	Если МассивДанных.Количество() = 0 Тогда 
		Отказ = Истина;
		Возврат "";
	Иначе
		Отказ = Ложь;
	КонецЕсли;   
	
	Возврат СформироватьТекстJSON(МассивДанных);
	
КонецФункции 

Функция ПодготовитьИнформациюПоЗамещения(ПараметрыСообщения, Отказ)//173
	
	ТаблицаВФормате = ПодготовитьТаблицуДляЗагрузкиВRequest("Замещения"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИКТ_ЗаместителиRequest.ЗамещаемыйПользователь КАК ЗамещаемыйПользователь,
	               |	ИКТ_ЗаместителиRequest.ЗаместительПользователь КАК ЗаместительПользователь,
	               |	ИКТ_ЗаместителиRequest.ДатаНачала КАК ДатаНачала,
	               |	ИКТ_ЗаместителиRequest.ДатаОкончания КАК ДатаОкончания,
	               |	ИКТ_ЗаместителиRequest.ДатаЗаписи КАК ДатаЗаписи,
	               |	ИКТ_ЗаместителиRequest.ЗамещаемыйID КАК ЗамещаемыйID,
	               |	ИКТ_ЗаместителиRequest.ЗаместительID КАК IDЗаместителя,
	               |	""12345678"" КАК IDШтатнойДолжностиЗамещаемого,
	               |	ИКТ_ЗаместителиRequest.ЗамещаемыйФизЛицо КАК ЗамещаемыйФизЛицо,
	               |	ИКТ_ЗаместителиRequest.ЗаместительФизЛицо КАК ЗаместительФизЛицо,
	               |	""001"" КАК COUNT,
	               |	""001"" КАК CUR_FLTID,
	               |	""001"" КАК CUR_FLTNM,
	               |	""1234567890123456789012345"" КАК КлючЗаписи,
	               |	""1"" КАК СтатусЗаписи,
	               |	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы
	               |ИЗ
	               |	РегистрСведений.ИКТ_ЗаместителиRequest КАК ИКТ_ЗаместителиRequest";
	
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C"); 
	Запрос.УстановитьПараметр("ДатаСобытия", Новый Граница(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыСообщения.СобытиеСсылка, "ДатаСобытия"), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);
	
	ТаблицаДанных1С = Запрос.Выполнить().Выгрузить();  
	
	Для каждого стр из ТаблицаДанных1С Цикл
				
		IDШтатнойДолжностиЗамещаемого = "";
		
		Если ЗначениеЗаполнено(Стр.ЗамещаемыйФизЛицо) Тогда
			
			IDШтатнойДолжностиЗамещаемого =  ПолучитьIDДолжности(Стр.ЗамещаемыйФизЛицо); 	
			
			Если НЕ ЗначениеЗаполнено(IDШтатнойДолжностиЗамещаемого) Тогда
				IDШтатнойДолжностиЗамещаемого = ПолучитьIDДолжностиПоСпрРуководители(Стр.ЗамещаемыйФизЛицо);
			КонецЕсли;
			
		КонецЕсли;
			
		Если IDШтатнойДолжностиЗамещаемого = "0" Тогда 
			IDШтатнойДолжностиЗамещаемого = "";
		КонецЕсли;	
		
		Стр.IDШтатнойДолжностиЗамещаемого = IDШтатнойДолжностиЗамещаемого;
		
		Стр.КлючЗаписи = Строка(стр.IDШтатнойДолжностиЗамещаемого + "/" + "001");		
		
	КонецЦикла;
	
	КолВо = ТаблицаДанных1С.Количество();
	
	Инд = 0;
	
	Пока Инд < КолВо Цикл
		
		Строка  = ТаблицаДанных1С[Инд];
		
		НеНужноУдалять = ЗначениеЗаполнено(Строка.ЗамещаемыйФизЛицо) И ЗначениеЗаполнено(Строка.IDШтатнойДолжностиЗамещаемого);
			
		Если Не НеНужноУдалять Тогда
			
			ТаблицаДанных1С.Удалить(Строка);			
			
			КолВо = КолВо - 1;
		Иначе
			Инд = Инд + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьТаблицуДанныхПоРезультатуЗапроса(ТаблицаВФормате, ТаблицаДанных1С);

	МассивДанных = ТаблицуЗначенийВМассивСтруктур(ТаблицаВФормате, "Заголовок");
	
	Если МассивДанных.Количество() = 0 Тогда 
		Отказ = Истина;
		Возврат "";
	Иначе
		Отказ = Ложь;	
	КонецЕсли;   
	
	Возврат СформироватьТекстJSON(МассивДанных);
	
КонецФункции

Функция ПолучитьIDДолжности(ЗамещаемыйФизЛицо) 
	
	ID = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ID_ДолжностьS КАК Должность_ID
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	               |			&ДатаСобытия,
	               |			Организация.ИКТ_УУ = ИСТИНА
	               |				И ГоловнаяОрганизация.ИКТ_УУ = ИСТИНА
	               |				И ФизическоеЛицо = &ФизическоеЛицо) КАК КадроваяИсторияСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСобытия",ТекущаяДата());
	Запрос.УстановитьПараметр("ФизическоеЛицо",ЗамещаемыйФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ID = СокрЛП(Выборка.Должность_ID);		
	КонецЦикла;
	
	Возврат ID;
	
КонецФункции	   

Функция ПолучитьIDДолжностиПоСпрРуководители(ЗамещаемыйФизЛицо) 
	
	ID = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИКТ_Руководители.Код КАК Должность_ID
	               |ИЗ
	               |	Справочник.ИКТ_Руководители КАК ИКТ_Руководители
	               |ГДЕ
	               |	ИКТ_Руководители.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо",ЗамещаемыйФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ID = СокрЛП(Выборка.Должность_ID);		
	КонецЦикла;
	
	Возврат ID;
	
КонецФункции	
	
Функция СформироватьДанныеДляОтправкиВRequestИзменениеГрафикаРаботы(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СобытияОбменаRequest.ОснованиеСобытия КАК ОснованиеСобытия,
		|	ИКТ_СобытияОбменаRequest.ДопАналитика КАК ДопАналитика,
		|	ИКТ_СобытияОбменаRequest.ДатаСобытия КАК ДатаСобытия
		|ПОМЕСТИТЬ ВТ_ДАнныеСобытия
		|ИЗ
		|	Справочник.ИКТ_СобытияОбменаRequest КАК ИКТ_СобытияОбменаRequest
		|ГДЕ
		|	ИКТ_СобытияОбменаRequest.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрафикРаботыСотрудников.ДействуетДо КАК ДействуетДо,
		|	ГрафикРаботыСотрудников.Сотрудник.ФизическоеЛицо.ИКТ_ТабельныйНомер КАК ИКТ_ТабельныйНомер,
		|	ГрафикРаботыСотрудников.ГрафикРаботы.Наименование КАК ГрафикРаботыНаименование,
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ГрафикРаботыСотрудников.ГрафикРаботы)) КАК ГрафикРаботыГУИД,
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусСобытия,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы
		|ИЗ
		|	РегистрСведений.ГрафикРаботыСотрудников КАК ГрафикРаботыСотрудников
		|ГДЕ
		|	(ГрафикРаботыСотрудников.Период, ГрафикРаботыСотрудников.Сотрудник, ГрафикРаботыСотрудников.ГрафикРаботы) В
		|			(ВЫБРАТЬ
		|				ВТ_ДАнныеСобытия.ДатаСобытия КАК ДатаСобытия,
		|				ВТ_ДАнныеСобытия.ДопАналитика КАК ДопАналитика,
		|				ВТ_ДАнныеСобытия.ОснованиеСобытия
		|			ИЗ
		|				ВТ_ДАнныеСобытия КАК ВТ_ДАнныеСобытия)";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.СобытиеСсылка);
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C"); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураДанных = Новый Структура();

	Если Выборка.Следующий() Тогда   
		
		СтруктураДанных.Вставить("ExchangeSysName", "SND_1C");
		СтруктураДанных.Вставить("ExchangeRoute", "ИКТ_10");
		СтруктураДанных.Вставить("OperationStatus", Выборка.СтатусСобытия);
		СтруктураДанных.Вставить("Key", Строка(ПараметрыСообщения.СобытиеСсылка.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("Variables", Новый Массив);
		
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "PERNR", Выборка.ИКТ_ТабельныйНомер));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ВРег("ENDDATE"), Формат(Выборка.ДействуетДо,"ДФ=yyyyMMdd; ДП=99991231")));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ВРег("WorkScheduleName"), Выборка.ГрафикРаботыНаименование));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ВРег("WorkScheduleXX__CUR_KEY"), Выборка.ГрафикРаботыГУИД));
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат СформироватьТекстJSON(СтруктураДанных);
			
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestИКТ_RequestРаботаНеПоГрафику(ПараметрыСообщения, Отказ)//128 КРВ
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусСобытия,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы,
		|	ИКТ_RequestРаботаНеПоГрафику.ПервыйВход КАК ПервыйВход,
		|	ИКТ_RequestРаботаНеПоГрафику.ПоследнийВыход КАК ПоследнийВыход,
		|	ИКТ_RequestРаботаНеПоГрафику.ОтработаноЧасов КАК ОтработаноЧасов,
		|	ИКТ_RequestРаботаНеПоГрафику.Сотрудник.ФизическоеЛицо.ИКТ_ТабельныйНомер КАК ИКТ_ТабельныйНомер,
		|	ИКТ_RequestРаботаНеПоГрафику.Организация.ИКТ_IDЮрЛица КАК ИКТ_IDЮрЛица,
		|	ИКТ_RequestРаботаНеПоГрафику.ДатаИнцидента КАК ДатаИнцидента,
		|	ИКТ_RequestРаботаНеПоГрафику.Сотрудник.Наименование КАК СотрудникНаименование,
		|	КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.ИКТ_БизнесЕдиница.ID КАК BE,
		|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.ИКТ_ВремяНачалаРаботы КАК ВремяНачалаРаботыПоГрафику,
		|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.ИКТ_ВремяОкончанияРаботы КАК ВремяОкончанияРаботыПоГрафику,
		|	РАЗНОСТЬДАТ(КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.ИКТ_ВремяНачалаРаботы, КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.ИКТ_ВремяОкончанияРаботы, ЧАС) - 1 КАК НормаВремениВДень,
		|	ИКТ_RequestРаботаНеПоГрафику.ОтработаноВремени КАК ОтработаноВремени
		|ИЗ
		|	Документ.ИКТ_RequestРаботаНеПоГрафику КАК ИКТ_RequestРаботаНеПоГрафику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
		|		ПО ИКТ_RequestРаботаНеПоГрафику.Сотрудник = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ИКТ_RequestРаботаНеПоГрафику.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИКТ_RequestРаботаНеПоГрафикуВидыИнцидентов.ВидИнцидента КАК ВидИнцидента
		|ИЗ
		|	Документ.ИКТ_RequestРаботаНеПоГрафику.ВидыИнцидентов КАК ИКТ_RequestРаботаНеПоГрафикуВидыИнцидентов
		|ГДЕ
		|	ИКТ_RequestРаботаНеПоГрафикуВидыИнцидентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C"); 
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатШапка = ПакетыЗапроса[0];
	РезультатВидыИнцидентов = ПакетыЗапроса[1];
	
	ВыборкаВидыИнцидентов = РезультатВидыИнцидентов.Выбрать();
	
	ВозможныеИнциденты = Новый Структура; // Ключ - тэг инцидент, значение - тег значения инцидента
	ВозможныеИнциденты.Вставить("XX__CUR_FLTNM_002", "SS__LATE_TIME_002");
	ВозможныеИнциденты.Вставить("XX__CUR_FLTNM_003", "SS__LATE_TIME_003");
	ВозможныеИнциденты.Вставить("XX__CUR_FLTNM_004", "SS__LATE_TIME_004");
	ВозможныеИнциденты.Вставить("XX__CUR_FLTNM_005", "SS__LATE_TIME_005");
	ВозможныеИнциденты.Вставить("XX__CUR_FLTNM_006", "SS__LATE_TIME_006");
	
	Выборка = РезультатШапка.Выбрать();
	
	СтруктураДанных = Новый Структура();

	Если Выборка.Следующий() Тогда   
		
		СтруктураДанных.Вставить("ExchangeSysName", "SND_1C");
		СтруктураДанных.Вставить("ExchangeRoute", "ИКТ_128");//128 - Контроль рабочего времени.
		СтруктураДанных.Вставить("OperationStatus", Выборка.СтатусСобытия);
		СтруктураДанных.Вставить("Key", Строка(ПараметрыСообщения.СобытиеСсылка.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("Variables", Новый Массив);
		
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "PERNR", Выборка.ИКТ_ТабельныйНомер));
		
		ВремяНачалаРаботыПоГрафику    = ?(ЗначениеЗаполнено(Выборка.ВремяНачалаРаботыПоГрафику),Выборка.ВремяНачалаРаботыПоГрафику,Константы.ИКТ_ВремяНачалаРаботы.Получить());
		ВремяОкончанияРаботыПоГрафику = ?(ЗначениеЗаполнено(Выборка.ВремяОкончанияРаботыПоГрафику),Выборка.ВремяОкончанияРаботыПоГрафику,Константы.ИКТ_ВремяОкончанияРаботы.Получить());
		
		// + Здесь нужно переделать всё.
		Если ЗначениеЗаполнено(Выборка.НормаВремениВДень) Тогда 
			НормаВремениВДень = ?(Число(Выборка.НормаВремениВДень)>0,Выборка.НормаВремениВДень,"8");
		Иначе
			НормаВремениВДень = "8";
		КонецЕсли;		
        // - Здесь нужно переделать всё.
		
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "DATA", Формат(Выборка.ДатаИнцидента,"ДФ=yyyyMMdd; ДП=99991231")));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "ENAME", Выборка.СотрудникНаименование));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "BUKRS", Выборка.BE)); 
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SOBEG", Формат(ВремяНачалаРаботыПоГрафику,"ДЛФ=T")));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SOEND", Формат(ВремяОкончанияРаботыПоГрафику,"ДЛФ=T")));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SOLLZ", НормаВремениВДень)); 
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "GJAHR", Формат(Выборка.ДатаИнцидента,"ДФ=yyyy; ДП=9999")));//Финансовый год
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "IS_FLEXIBLE_SCHEDULE", ""));//Гибкий график
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "MAINVACATION", ""));//Дней отпуска
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "BIRTHVACATION", "0"));//Отпуск за Д.Р. 1 или 0
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "H3VACATION", ""));
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SS__LATE_TIME", ""));//Время опоздания или время раннего ухода в минутах 
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "XX__CUR_FLTID", "001"));

		Пока ВыборкаВидыИнцидентов.Следующий() Цикл
			
			Если ВыборкаВидыИнцидентов.ВидИнцидента = Перечисления.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Недоработка Тогда
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "XX__CUR_FLTNM_002", "Менее 7,5 на работе")); 
				ОтработаноСекунд = ?(ЗначениеЗаполнено(Выборка.ОтработаноВремени), Выборка.ОтработаноВремени - '00010101', Выборка.ОтработаноЧасов * 3600);
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SS__LATE_TIME_002", Формат(ОтработаноСекунд, "ЧЦ=6; ЧВН=; ЧГ=0"))); 
				ВозможныеИнциденты.Удалить("XX__CUR_FLTNM_002");
			КонецЕсли;
			  
			Если ВыборкаВидыИнцидентов.ВидИнцидента = Перечисления.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Опоздание Тогда
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "XX__CUR_FLTNM_003", "Опоздание 30 мин")); 
				ОпозданиеСекунд = (Выборка.ПервыйВход - НачалоДня(Выборка.ПервыйВход)) - (ВремяНачалаРаботыПоГрафику - '00010101');
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SS__LATE_TIME_003", Формат(ОпозданиеСекунд, "ЧЦ=6; ЧВН=; ЧГ=0"))); 
				ВозможныеИнциденты.Удалить("XX__CUR_FLTNM_003");
			КонецЕсли;
		
			Если ВыборкаВидыИнцидентов.ВидИнцидента = Перечисления.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.УходРаньше Тогда
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "XX__CUR_FLTNM_004", "Ранний уход 30 мин")); 
				РаннийУходСекунд = (ВремяОкончанияРаботыПоГрафику - '00010101') - (Выборка.ПоследнийВыход - НачалоДня(Выборка.ПоследнийВыход));
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SS__LATE_TIME_004", Формат(РаннийУходСекунд, "ЧЦ=6; ЧВН=; ЧГ=0"))); 
				ВозможныеИнциденты.Удалить("XX__CUR_FLTNM_004");
			КонецЕсли;
		
			Если ВыборкаВидыИнцидентов.ВидИнцидента = Перечисления.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.Отсутствие Тогда
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "XX__CUR_FLTNM_005", "Не вышел на работу")); 
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SS__LATE_TIME_005", "000000")); 
				ВозможныеИнциденты.Удалить("XX__CUR_FLTNM_005");
			КонецЕсли;
		
			Если ВыборкаВидыИнцидентов.ВидИнцидента = Перечисления.ИКТ_RequestВидыИнцидентовРаботыНеПоГрафику.ПриходСОтсутствием Тогда
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "XX__CUR_FLTNM_006", "Приход с отсутствием")); 
				СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SS__LATE_TIME_006", "000000")); 
				ВозможныеИнциденты.Удалить("XX__CUR_FLTNM_006");
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого ДанныеИнцидента из ВозможныеИнциденты Цикл //Добавляем переменные всех возможных инцидентов, которые остались
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ДанныеИнцидента.Ключ, "")); 
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ДанныеИнцидента.Значение, ""));
		КонецЦикла;
		
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "JUPER", Выборка.ИКТ_IDЮрЛица));  
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ВРег("FirstEntry"), Формат(Выборка.ПервыйВход,"ДФ=yyyyMMddHHmmss; ДП=99991231246060")));//Передаем дату и время
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ВРег("LastExit"), Формат(Выборка.ПоследнийВыход,"ДФ=yyyyMMddHHmmss; ДП=99991231246060")));//Передаем дату и время		
		СтруктураДанных.Variables.Добавить(Новый Структура("name,value", ВРег("HoursWorkedOut"), Выборка.ОтработаноЧасов));
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат СформироватьТекстJSON(СтруктураДанных);
			
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestЛC_ВводПланаKPI(ПараметрыСообщения, Отказ)
	
	Если ПараметрыСообщения.ОснованиеСобытияОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусСобытия,
		|	&ИмяВнешнейСистемы КАК ИмяВнешнейСистемы,
		|	ЕСТЬNULL(ЛC_ВводПланаKPIСостав.Сотрудник.ФизическоеЛицо.ИКТ_ТабельныйНомер, """") КАК ИКТ_ТабельныйНомер,
		|	ЕСТЬNULL(ЛC_ВводПланаKPIСостав.Ссылка.Организация.ИКТ_IDЮрЛица, """") КАК ИКТ_IDЮрЛица,
		|	ЛC_ВводПланаKPIСостав.Месяц КАК Месяц,
		|	ЕСТЬNULL(ЛC_ВводПланаKPIСостав.ЦелевойПоказатель.Код, """") КАК ЦелевойПоказательКод,
		|	ЕСТЬNULL(ЛC_ВводПланаKPIСостав.ЦелевойПоказатель.Наименование, """") КАК ЦелевойПоказательНаименование,
		|	ЕСТЬNULL(ЛC_ВводПланаKPIСостав.Ссылка.Руководитель.ФизическоеЛицо.ИКТ_ТабельныйНомер, """") КАК РуководительИКТ_ТабельныйНомер,
		|	ВЫБОР
		|		КОГДА ЛC_ВводПланаKPIСостав.Ссылка.Утвержден
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Утвержден,
		|	ЕСТЬNULL(ЛC_ВводПланаKPIСостав.Ссылка.Утвердил.ФизическоеЛицо.ИКТ_ТабельныйНомер, """") КАК УтвердилИКТ_ТабельныйНомер,
		|	ЛC_ВводПланаKPIСостав.Ссылка.ДатаУтверждения КАК ДатаУтверждения,
		|	ЕСТЬNULL(ЛC_ВводПланаKPIСостав.ДолжностьПоШтатномуРасписанию.ID_ДолжностьS, """") КАК IDШтатнойДолжности,
		|	ЛC_ВводПланаKPIСостав.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛC_ВводПланаKPI.Состав КАК ЛC_ВводПланаKPIСостав
		|ГДЕ
		|	ЛC_ВводПланаKPIСостав.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(СтатусСобытия),
		|	МАКСИМУМ(ИмяВнешнейСистемы),
		|	МАКСИМУМ(ИКТ_IDЮрЛица),
		|	МАКСИМУМ(РуководительИКТ_ТабельныйНомер),
		|	МАКСИМУМ(Утвержден),
		|	МАКСИМУМ(УтвердилИКТ_ТабельныйНомер),
		|	МАКСИМУМ(ДатаУтверждения)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);
	Запрос.УстановитьПараметр("ИмяВнешнейСистемы", "SND_1C"); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураДанных = Новый Структура(); 
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		Выборка = ВыборкаСсылка.Выбрать(); 
		
		СтруктураДанных.Вставить("ExchangeSysName", "SND_1C");
		СтруктураДанных.Вставить("ExchangeRoute", "ИКТ_30");
		СтруктураДанных.Вставить("OperationStatus", ВыборкаСсылка.СтатусСобытия);
		СтруктураДанных.Вставить("Key", Строка(ПараметрыСообщения.СобытиеСсылка.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("Variables", Новый Массив);

		Пока Выборка.Следующий() Цикл   
						
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "PERNR", Выборка.ИКТ_ТабельныйНомер));
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "JUPER", Выборка.ИКТ_IDЮрЛица));  
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "APPROVED_PERNR", Выборка.УтвердилИКТ_ТабельныйНомер)); 
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "APPROVED", Выборка.Утвержден)); 
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "APPROVED_DATE", Формат(Выборка.ДатаУтверждения,"ДФ=yyyyMMdd; ДП=99991231"))); 
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "HEAD_PERNR", Выборка.РуководительИКТ_ТабельныйНомер));  
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "HEAD_PERNR", Выборка.РуководительИКТ_ТабельныйНомер));  
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "INDICATOR_CODE", Выборка.ЦелевойПоказательКод));  
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "INDICATOR_NAME", Выборка.ЦелевойПоказательНаименование)); 
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SJOB_ID", Выборка.IDШтатнойДолжности)); 
			СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "MONTH", Формат(Выборка.Месяц,"ДФ=yyyyMMdd; ДП=99991231"))); 
			
		КонецЦикла;
	
	КонецЦикла;
	
	Если СтруктураДанных.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СформироватьТекстJSON(СтруктураДанных);
			
КонецФункции

Функция ПолучитьМассивФайловПоДоговору(ДоговорСсылка)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентовПрисоединенныеФайлы.Наименование КАК Наименование,
		|	ДоговорыКонтрагентовПрисоединенныеФайлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК ДоговорыКонтрагентовПрисоединенныеФайлы
		|ГДЕ
		|	ДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла = &ДоговорСсылка
		|	И ДоговорыКонтрагентовПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ДДФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Ссылка);
		Исключение 
			Продолжить;
		КонецПопытки; 
		
		Результат.Добавить(
			Новый Структура("File,FileName,FileExtension",
			Base64Строка(ДДФайла),
			Выборка.Наименование,
			Выборка.Расширение));
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

Функция СформироватьДанныеДляОтправкиВRequestИКТ_СобытияТехСбойСКУД(ПараметрыСообщения, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИКТ_СобытияТехСбойСКУД.Организация.ИКТ_IDЮрЛица КАК ИКТ_IDЮрЛица,
		|	ИКТ_СобытияТехСбойСКУД.ДатаСобытия КАК ДатаСобытия,
		|	ВЫБОР
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Удаление)
		|			ТОГДА 3
		|		КОГДА &ДействиеОбмена = ЗНАЧЕНИЕ(Перечисление.ИКТ_ДействияОбмена.Изменение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК СтатусСобытия,
		|	ИКТ_СобытияТехСбойСКУД.КоличествоСотрудников КАК КоличествоСотрудников,
		|	ИКТ_СобытияТехСбойСКУД.КоличествоСотрудниковСИнцидентами КАК КоличествоСотрудниковСИнцидентами,
		|	ИКТ_СобытияТехСбойСКУД.ПроцентИнцидентов КАК ПроцентИнцидентов,
		|	ИКТ_СобытияТехСбойСКУД.БизнесЕдиница.ID КАК БизнесЕдиницаID
		|ИЗ
		|	Справочник.ИКТ_СобытияТехСбойСКУД КАК ИКТ_СобытияТехСбойСКУД
		|ГДЕ
		|	ИКТ_СобытияТехСбойСКУД.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСообщения.ОснованиеСобытияОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДействиеОбмена", ПараметрыСообщения.ДействиеОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("ExchangeSysName", "SND_1C");
	СтруктураДанных.Вставить("ExchangeRoute", "ИКТ_176");//176 - Тех. сбой СКУД
	СтруктураДанных.Вставить("OperationStatus", Выборка.СтатусСобытия);
	СтруктураДанных.Вставить("Key", Строка(ПараметрыСообщения.СобытиеСсылка.УникальныйИдентификатор()));
	СтруктураДанных.Вставить("Variables", Новый Массив);
	СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "DAT", Формат(Выборка.ДатаСобытия,"ДФ=yyyyMMdd; ДП=99991231")));
	СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "ORGEH", Выборка.ИКТ_IDЮрЛица));  
	СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "SOTR_TOTAL", Выборка.КоличествоСотрудников));  
	СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "BEZ_OTMETOK", Выборка.КоличествоСотрудниковСИнцидентами));  
	СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "PROTSUT", Выборка.ПроцентИнцидентов));  
	СтруктураДанных.Variables.Добавить(Новый Структура("name,value", "WERKS", Выборка.БизнесЕдиницаID));  
	
	Возврат СформироватьТекстJSON(СтруктураДанных);

КонецФункции  

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуДанныхПоРезультатуЗапроса(ТаблицаВФормате, ТаблицаДанных1С);
		
	Для каждого СтрРезультат Из ТаблицаДанных1С Цикл   
		
		СтрТЗ = ТаблицаВФормате.Добавить();
		
		Для каждого Колонка из ТаблицаВФормате.Колонки Цикл 
			
			Если ТаблицаДанных1С.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(СтрРезультат[Колонка.Имя]) = Тип("Дата") Тогда
				СтрТЗ[Колонка.Имя] = Формат(СтрРезультат[Колонка.Имя],"ДФ=yyyyMMdd; ДП=99991231");
			ИначеЕсли ТипЗнч(СтрРезультат[Колонка.Имя]) = Тип("Булево") Тогда
				СтрТЗ[Колонка.Имя] = Формат(СтрРезультат[Колонка.Имя],"БЛ=; БИ=X");
			ИначеЕсли ТипЗнч(СтрРезультат[Колонка.Имя]) = Тип("Число") Тогда
				СтрТЗ[Колонка.Имя] = Формат(СтрРезультат[Колонка.Имя],"ЧН=0; ЧГ=0");
			Иначе
				СтрТЗ[Колонка.Имя] = СтрРезультат[Колонка.Имя];
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьТаблицуДляЗагрузкиВRequest(ИмяМетода)
	
	ОписаниеТаблицы = ПолучитьОписаниеТаблицыПоМетоду(ИмяМетода);
	
	Если ОписаниеТаблицы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТЗ = Новый ТаблицаЗначений;
	
	Для каждого ОписаниеКолонки из ОписаниеТаблицы Цикл  
		
		ТипЗначенияКолонки = ПолучитьТипЗначенияКолонки(ОписаниеКолонки);
		
		Если ТипЗначенияКолонки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТЗ.Колонки.Добавить(ОписаниеКолонки.ИмяКолонки1С, ТипЗначенияКолонки, ОписаниеКолонки.ИмяКолонкиRequest);
		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции 

Функция ПолучитьОписаниеТаблицыПоМетоду(ИмяМетода)
	
	ОписаниеТаблицы = Новый ТаблицаЗначений;
	
	Попытка
		
		Макет = ПолучитьОбщийМакет("ИКТ_RequestОписаниеТаблиц");
		
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область(ИмяМетода));
		Построитель.Выполнить();
		
		ОписаниеТаблицы = Построитель.Результат.Выгрузить();
		
	Исключение  
		
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		
	КонецПопытки;
	
	Возврат ОписаниеТаблицы;
	
КонецФункции
		
Функция ПолучитьТипЗначенияКолонки(ОписаниеКолонки) 
	
	Если ВРег(ОписаниеКолонки.ТипЗначения) = "СТРОКА" Тогда
		
		Если ЗначениеЗаполнено(ОписаниеКолонки.ДлинаСтроки) Тогда
			
			Возврат Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(Число(ОписаниеКолонки.ДлинаСтроки)));
			
		Иначе
			
			Возврат Новый ОписаниеТипов("Строка");
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ОписаниеКолонки.ТипЗначения) = "ЧИСЛО" Тогда
		
		ДлинаЧисла = ?(ЗначениеЗаполнено(ОписаниеКолонки.ДлинаЧисла), Число(ОписаниеКолонки.ДлинаЧисла), 10);
		ТочностьЧисла = ?(ЗначениеЗаполнено(ОписаниеКолонки.ТочностьЧисла), Число(ОписаниеКолонки.ТочностьЧисла), 0);
		
		Возврат Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(ДлинаЧисла, ТочностьЧисла));
		
	ИначеЕсли ВРег(ОписаниеКолонки.ТипЗначения) = "ДАТА" Тогда
		
		Если ЗначениеЗаполнено(ОписаниеКолонки.ЧастиДаты) Тогда
			
			Возврат Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты[ОписаниеКолонки.ЧастиДаты]));
			
		Иначе
			
			Возврат Новый ОписаниеТипов("Дата");
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ОписаниеКолонки.ТипЗначения) = "БУЛЕВО" Тогда	
		
		Возврат Новый ОписаниеТипов("Булево");  
			
	КонецЕсли;  
				
КонецФункции

Функция ТаблицуЗначенийВМассивСтруктур(ТаблицаЗначений, КлючКолонки = "Имя")
	
	МассивДанных = Новый Массив;
	
	Для каждого стр из ТаблицаЗначений Цикл
		
		ДанныеСтроки = Новый Структура;
		
		Для каждого Колонка из ТаблицаЗначений.Колонки Цикл
			
			ДанныеСтроки.Вставить(Колонка[КлючКолонки], стр[Колонка.Имя]);
			
		КонецЦикла;
		
		МассивДанных.Добавить(ДанныеСтроки);
		
	КонецЦикла; 
	
	Возврат МассивДанных;
	
КонецФункции

Функция СформироватьТекстJSON(ДанныеБазы) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(); 
	
	ЗаписатьJSON(ЗаписьJSON, ДанныеБазы);
		
	ТекстJSON = ЗаписьJSON.Закрыть();
		
	Возврат ТекстJSON;
	
КонецФункции

Функция ПрочитатьТекстJSON(ИмяФайла = "", ТекстЗапроса = "") Экспорт
	
	Попытка 
		
		ЧтениеJSON = Новый ЧтениеJSON;
		Если ЗначениеЗаполнено(ИмяФайла) Тогда
			ЧтениеJSON.ОткрытьФайл(ИмяФайла);
		ИначеЕсли ЗначениеЗаполнено(ТекстЗапроса) Тогда 
			ЧтениеJSON.УстановитьСтроку(ТекстЗапроса);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
			
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
		
		Возврат ДанныеЗапроса;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ОбменДаннымиRequest", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки() + Символы.ПС + ?(ЗначениеЗаполнено(ТекстЗапроса), ТекстЗапроса, ИмяФайла)); 
		
	КонецПопытки;
	
КонецФункции

Функция ИмяБазы1С()
	
	ЗаголовокСистемы = Константы.ЗаголовокСистемы.Получить();
	
	Если Не ЗначениеЗаполнено(ЗаголовокСистемы) Тогда
		
		ЗаголовокСистемы = "1С SNGM";
		
	КонецЕсли;
	
	Возврат ЗаголовокСистемы;
	
КонецФункции

Функция ИспользоватьОбменСРексвест() Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Константы.ИКТ_RequestПараметрыСоединения) Тогда 
		Возврат Ложь;		
	КонецЕсли;
	
	Результат = Истина;
		
	НастройкиОбмена = Обработки.ИКТ_RequestПараметрыСоединения.ПолучитьПараметрыСоединенияСRequest();
	
	Если НастройкиОбмена = Неопределено Тогда
		Результат = Ложь;
	ИначеЕсли НастройкиОбмена.Свойство("ИспользоватьОбменСRequest") = Ложь Тогда
		Результат = Ложь;
	ИначеЕсли НастройкиОбмена.ИспользоватьОбменСRequest = Ложь Тогда
		Результат = Ложь;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти