
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоСобственныеСилыСубподряд);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИсключитьНДС") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтрокаПоиска = "";
		Если Параметры.Свойство("СтрокаПоиска") Тогда
			СтрокаПоиска = Параметры.СтрокаПоиска;
		КонецЕсли;
				
		СССПИсключение = Справочники.упоСобственныеСилыСубподряд.НДС;
				
		ДанныеВыбора = ДанныеВыбораСССП(СССПИсключение, СтрокаПоиска);		
								
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеВыбораСССП(СССПИсключение, СтрокаПоиска = "")
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ОтборПоСтроке", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");
	Запрос.УстановитьПараметр("СССПИсключение", СССПИсключение);
		
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
	               |	упоСобственныеСилыСубподряд.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.упоСобственныеСилыСубподряд КАК упоСобственныеСилыСубподряд
	               |ГДЕ
	               |	НЕ упоСобственныеСилыСубподряд.Ссылка В (&СССПИсключение)
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоСтроке
	               |				ТОГДА упоСобственныеСилыСубподряд.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);	
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти


#КонецЕсли
