////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции работы с отладкой.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается перед записью в регистр.
//
// Параметры:
//  Источник	 - Произвольный - не используется, зарезервирован.
//  Отказ		 - Произвольный - не используется, зарезервирован.
//  Замещение	 - Произвольный - не используется, зарезервирован.
//
// Возвращаемое значение:
//	Неопределено - не возвращает ничего.
//
Функция упоПередЗаписьюВРегистрПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	
	
КонецФункции

// Вызывается при записи в регистр.
//
// Параметры:
//  Источник	 - Произвольный - не используется, зарезервирован.
//  Отказ		 - Произвольный - не используется, зарезервирован.
//  Замещение	 - Произвольный - не используется, зарезервирован.
//
// Возвращаемое значение:
//	Неопределено - не возвращает ничего.
//
Функция упоПриЗаписиВРегистрПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	
	
КонецФункции

// Функция - Декомпиляция элементов
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - Декомпилируемая форма.
// 
// Возвращаемое значение:
//  Булево - Получилось или нет.
//
Функция ДекомпиляцияЭлементов(ЭтаФорма) Экспорт
	
	// Вычислить выражение в точке остановки в "ПриСозданииНаСервере": 
	// упоОтладкаСервер.ДекомпиляцияЭлементов(ЭтаФорма)
	
	Если ЭтаФорма.Параметры.Свойство("ДекомпиляцияЭлементов") Тогда
		Обработка = ВнешниеОбработки.Создать(ЭтаФорма.Параметры.ДекомпиляцияЭлементов.ИмяПодключеннойОбработки, Ложь);
		Обработка.ОпределитьВнутренниеСвойстваЭлементов(ЭтаФорма);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция - Декомпиляция условного оформления
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма условное оформление которое декомпилируется.
// 
// Возвращаемое значение:
//  Булево - Получилось или нет.
//
Функция ДекомпиляцияУсловногоОформления(ЭтаФорма) Экспорт
	
	// Вычислить выражение в точке остановки в "ПриСозданииНаСервере":
	// упоОтладкаСервер.ДекомпиляцияУсловногоОформления(ЭтаФорма)
	
	Если ЭтаФорма.Параметры.Свойство("ДекомпиляцияУсловногоОформления") Тогда
		Обработка = ВнешниеОбработки.Создать(ЭтаФорма.Параметры.ДекомпиляцияУсловногоОформления.ИмяПодключеннойОбработки, Ложь);
		Обработка.ОпределитьКодУсловногоОформления(ЭтаФорма);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти