////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с заданиями.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет обязательность указания проектной задачи в задании с видом "Обсуждение".
//
// Параметры:
//  Проект	 - СправочникСсылка.Проекты.
// 
// Возвращаемое значение:
//  Булево - результат выполнения проверки.
//
Функция ПроверитьОбязательностьУказанияПроектнойЗадачиВОбсуждении(Проект) Экспорт

	СтруктураСвойствПроекта = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	Возврат НЕ СтруктураСвойствПроекта.РазрешитьСозданиеОбсужденийБезУказанияПроектнойЗадачи;
	
КонецФункции

// Возвращает настройку отложенной синхронизация поручений задач.
// 
// Возвращаемое значение:
//  Булево - см.Константы.упоОтложеннаяСинхронизацияПорученийЗадач
//
Функция ОтложеннаяСинхронизацияПорученийЗадач() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.упоОтложеннаяСинхронизацияПорученийЗадач.Получить();
КонецФункции

// Кэширует цвета для оформления на странице комментариев в форме работы с заданиями.
// 
// Возвращаемое значение:
//  Соответствие - цвета оформления страницы комментариев.
//
Функция ЦветаСтатусовВКомментариях() Экспорт
	
	ЦветаСтатуса = Новый Соответствие;
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Выдано, "<span class='new'><b>" + Перечисления.упоСтатусыЗаданий.Выдано + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Выполняется, "<span class='inwork'><b>" + Перечисления.упоСтатусыЗаданий.Выполняется + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Уточняется, "<span class='clarify'><b>" + Перечисления.упоСтатусыЗаданий.Уточняется + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Завершено, "<span class='done'><b>" + Перечисления.упоСтатусыЗаданий.Завершено + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Отменено, "<span class='refused'><b>" + Перечисления.упоСтатусыЗаданий.Отменено + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Закрыто, "<span class='closed'><b>" + Перечисления.упоСтатусыЗаданий.Закрыто + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Открыто, "<span class='open'><b>" + Перечисления.упоСтатусыЗаданий.Открыто + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.НаСогласовании, "<span class='inwork'><b>" + Перечисления.упоСтатусыЗаданий.НаСогласовании + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.Согласовано, "<span class='done'><b>" + Перечисления.упоСтатусыЗаданий.Согласовано + "</b></span>");
	ЦветаСтатуса.Вставить(Перечисления.упоСтатусыЗаданий.НеСогласовано, "<span class='new'><b>" + Перечисления.упоСтатусыЗаданий.НеСогласовано + "</b></span>");

	Возврат ЦветаСтатуса;
	
КонецФункции

// Кэширует макет страницы для вывода комментариев в форме работы с заданиями.
// 
// Возвращаемое значение:
//  ТекстовыйДокумент - макет страницы комментариев.
//
Функция МакетСтраницыКомментарии() Экспорт

	ТекстHTML = Обработки.упоРаботаСЗаданиями.ПолучитьМакет("МакетСтраницыКомментарии").ПолучитьТекст();
	
	Если упоИнтеграцияКлиентСервер.ДоступнаНастройкаСтилей()
		И упоИнтеграцияКлиентСервер.ИспользуетсяСтильОформленияITLand() Тогда
		ТекстHTML = СтрЗаменить(ТекстHTML, "FBED9E", "f4fafb");
	КонецЕсли;
	
	Возврат ТекстHTML;
	
КонецФункции

#КонецОбласти