#Область ОписаниеПеременных

&НаКлиенте
Перем РежимРедактирования;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
	УстановитьДоступностьЭлементов(ЭтаФорма);
	
	ИзменитьОтображениеЭлементовПоВидуЗадания(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();  
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ИмяЭлементаКоманднойПанели", "КоманднаяПанельФормы");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьОтборВДинамическомСписке();
	
	упоИнтеграция.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);	
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КоманднаяПанельФормы);
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если Не Параметры.Свойство("АвтоТест") Тогда
		ОбрабатыватьНовыйКакЗаписанный = Параметры.Свойство("ЗапретРедактированияРеквизитов_НовыйКакЗаписанный") 
			И Параметры.ЗапретРедактированияРеквизитов_НовыйКакЗаписанный;
		// СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект, 
			Элементы.КоманднаяПанельФормы, , Объект, ОбрабатыватьНовыйКакЗаписанный);
		// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
	КонецЕсли;
	
	ОграничитьВыборПроектнойПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоЗаданияКлиент.ОбновитьДоступныеСтатусы(ЭтаФорма, СтруктураРолей);
	
	Если УстановитьМодифицированность Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
	УстановитьЗаголовокСтраницыПодчиненныхОтложенно();
	
	ОграничитьВыборТрудовыхРесурсовПоСПД();
	
	УстановитьДоступностьВыбораРолиПодразделения();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.ПустаяСсылка") Тогда
		Оповестить("ЗаписьНовогоЗадания", , Объект.Ссылка);
	КонецЕсли;
	Если ПараметрыЗаписи.Свойство("НовыеСогласующиеЛица") Тогда
		СписокСогласующиеЛица = Новый СписокЗначений;
		СписокСогласующиеЛица.ЗагрузитьЗначения(ПараметрыЗаписи.НовыеСогласующиеЛица);
		Оповестить("ЗаписьЗадания_НовыеСогласующиеЛица", Новый Структура("СогласующиеЛица", СписокСогласующиеЛица), Объект.Ссылка);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("ЭтоЗаданиеПодразделению, Проект, Исполнитель", 
		Объект.ЭтоЗаданиеПодразделению, Объект.Проект, Объект.Исполнитель);
	Оповестить("ЗаписьЗадания", ПараметрыОповещения, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	Элементы.ПодчиненныеЗадания.Обновить();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПолеИстории = ПолучитьОписание(Объект.Ссылка);
	КонецЕсли;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьКорректностьПризнакаОсновноеЗадание();
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НовыеСогласующиеЛица") Тогда
		ПараметрыЗаписи.Вставить("НовыеСогласующиеЛица", ТекущийОбъект.ДополнительныеСвойства.НовыеСогласующиеЛица);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
	ЭтоОткрытоеЗадание = Источник = Объект.Ссылка;
	
	Если ИмяСобытия = "Задания_СтатусЗаданияИзменен" Тогда
				
		Если НЕ Параметр.Закрытие И Параметр.Задание = Объект.Ссылка Тогда
		
			ЭтотОбъект.ТекущийСтатус = Параметр.Статус;
			ОбновитьДоступныеСтатусы();
			СтруктураСрокиФакт = упоЗаданияСервер.ПолучитьФактическиеСрокиЗадания(Объект.Ссылка);
			ДатаНачалаФакт = СтруктураСрокиФакт.ДатаНачалаФакт;
			ДатаОкончанияФакт = СтруктураСрокиФакт.ДатаОкончанияФакт;
			
			УстановитьДоступностьЭлементов(ЭтаФорма);
			
			УстановитьЗаголовокСтраницыПодчиненныхОтложенно();
			Элементы.ПодчиненныеЗадания.Обновить();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзменениеТекущегоСотрудника" Тогда
		
		ТекущийСотрудник = ПолучитьТекущегоСотрудника();
		ОбновитьДоступныеСтатусы(); 
		
	ИначеЕсли ИмяСобытия = "ЗаписьНовогоЗадания" Тогда
		
		Если ЭтоОткрытоеЗадание Тогда
			
			Если Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение") Тогда
				ЭтотОбъект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Открыто");
			ИначеЕсли Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование") Тогда	
				ЭтотОбъект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.НаСогласовании");
				СоздатьПодчиненныеСогласования();
			Иначе
				ЭтотОбъект.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выдано");
			КонецЕсли;
			упоЗаданияСервер.ЗаписатьВРегистрСтатусЗадания(Объект.Ссылка, ТекущийСтатус);
			
			//ТекущийСтатус = упоЗаданияСервер.ПолучитьСтатусЗадания(Объект.Ссылка);
			ОбновитьДоступныеСтатусы();
			клОбновитьОписание();
			
		КонецЕсли;
		
		УстановитьЗаголовокСтраницыПодчиненныхОтложенно();
		
	ИначеЕсли ИмяСобытия = "ЗаписьЗадания_НовыеСогласующиеЛица" Тогда
		
		Если ЭтоОткрытоеЗадание Тогда
			СоздатьКопированиемТекущегоНаСервере(Параметр.СогласующиеЛица);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоОткрытоеЗадание Тогда
		Заголовок = СформироватьЗаголовок(Объект.ВидЗадания, Ложь, Объект.Наименование, ЭтотОбъект.ТекущийСтатус);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("СписокИсполнителей") Тогда
			СоздатьКопированиемТекущегоНаСервере(ВыбранноеЗначение.СписокИсполнителей);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект, Элементы.КоманднаяПанельФормы);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
	
	упоЗаданияСервер.ДобавитьИзменитьЗаписьВРегистреСрокиЗаданий(Объект.Ссылка, ДатаНачалаПлан, ДатаОкончанияПлан);
	
	УстановитьОтборВДинамическомСписке();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоЗаданиеИсполнителяПроектнойЗадачиПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭтоЗаданиеИсполнителяПроектнойЗадачиПриИзмененииЗавершение",
		ЭтотОбъект);
	
	Если Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи Тогда	
		ТекстВопроса = НСтр("ru = 'При ручной установке опции проверьте, что исполнитель задания входит в число трудовых '")
			+ НСтр("ru = 'ресурсов связанной проектной задачи, иначе при изменениях в этой задаче задание будет отменено. '")
			+ НСтр("ru = 'Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкрытьИсторию(Команда)
	
	КнопкаСкрытьИсторию = ЭтаФорма.Элементы.СкрытьИсторию;
	КнопкаСкрытьИсторию.Пометка = НЕ КнопкаСкрытьИсторию.Пометка;
		
	Элемент = ЭтаФорма.Элементы.ИсторияСобытий;
	Элемент.Видимость = Не Элемент.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ЭтоОсновноеЗаданиеПроектнойЗадачиПриИзменении(Элемент)
	
	ПроверитьКорректностьПризнакаОсновноеЗадание();
	ИзменитьОтображениеЭлементовПоВидуЗадания(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьПризнакаОсновноеЗадание() 
	
	Если ЗначениеЗаполнено(Объект.ПроектнаяЗадача) ИЛИ НЕ Объект.ЭтоОсновноеЗаданиеПроектнойЗадачи Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеТекст = НСтр("ru = 'Нельзя установить признак ""Основное"" на задание без указания проектной задачи.'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеТекст);
	Объект.ЭтоОсновноеЗаданиеПроектнойЗадачи = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПолеКомментарияПриИзменении(Элемент)
	
	РежимРедактирования = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеКомментарияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РежимРедактирования = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеЗаданияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	СсылкаПустая = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	ДополнительныеПараметры = Новый Структура("СсылкаПустая",СсылкаПустая);
	
	Если СсылкаПустая Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодчиненныеЗаданияПередНачаломДобавленияЗавершение",ЭтотОбъект,ДополнительныеПараметры);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "ru = ""Создание подчиненных заданий возможно только после записи текущего задания. Записать?""";
		ПоказатьВопрос(ОписаниеОповещения,НСтр(Текст), Режим, 0);
		Возврат;
				
	КонецЕсли;
	
	ПодчиненныеЗаданияПередНачаломДобавленияЗавершение(Неопределено,ДополнительныеПараметры)
	
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеЗаданияПередНачаломДобавленияЗавершение(Ответ,ДополнительныеПараметры)  Экспорт
	
	Если ДополнительныеПараметры.СсылкаПустая Тогда    		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли; 		
		Записать(); 		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("АвторСотрудник", 		ТекущийСотрудник);
	ЗначенияЗаполнения.Вставить("Родитель", 			Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("ДатаНачалаПлан", 		ДатаНачалаПлан);
	ЗначенияЗаполнения.Вставить("ДатаОкончанияПлан", 	ДатаОкончанияПлан);
	ЗначенияЗаполнения.Вставить("Основание", 			Объект.Ссылка); 

	ПараметрыФормы.Вставить("Основание", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.упоЗадания.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектнаяЗадачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		СтандартнаяОбработка = Ложь;	
		ОткрытьФорму("Обработка.упоВыборПроектнойЗадачи.Форма.ОсновнаяФормаУправляемая",
			Новый Структура("Проект, ВозвращатьСсылкуНаЗеркальныйПроект", Объект.Проект, Истина), Элемент);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаданияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Заголовок = СформироватьЗаголовок(Объект.ВидЗадания, Ложь, Объект.Наименование, ТекущийСтатус);
	Иначе
		Заголовок = СформироватьЗаголовок(Объект.ВидЗадания, Истина);
	КонецЕсли;
	
	Если Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование") Тогда 		
		Объект.ЭтоСогласованиеРодитель = Истина;
		Объект.ВидСогласования = ПредопределенноеЗначение("Перечисление.упоВидыСогласований.Параллельное");
	Иначе
		Объект.ЭтоСогласованиеРодитель = Ложь;
		Объект.ВидСогласования = ПредопределенноеЗначение("Перечисление.упоВидыСогласований.ПустаяСсылка");
	КонецЕсли;
	
	ИзменитьОтображениеЭлементовПоВидуЗадания(ЭтаФорма);
	Если Не Элементы.ГруппаРольИПодразделение.Видимость Тогда
		Объект.Роль = Неопределено;
		Объект.Подразделение = Неопределено;
	КонецЕсли;
	
	ОбновитьДоступныеСтатусы();
	УстановитьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадание(Команда)
	
	текущееЗадание = Элементы.ПодчиненныеЗадания.ТекущиеДанные;	
	Если текущееЗадание <> Неопределено Тогда 
		ОткрытьФорму("Справочник.упоЗадания.ФормаОбъекта", Новый Структура("Ключ", текущееЗадание.Ссылка)); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Комментировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Объект не записан!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ПолеКомментария = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Введите комментарий!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	КомментарийЗадания = СтрЗаменить(ПолеКомментария, Символы.ПС, "<br>");
	ПолеКомментария = "";

	упоЗаданияСервер.ЗаписатьКомментарийЗадания(Объект.Ссылка, КомментарийЗадания);
	
	клОбновитьОписание();
			
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКопированиемТекущего(Команда)
	
	СсылкаПустая = НЕ ЗначениеЗаполнено(Объект.Ссылка); 
	ДополнительныеПараметры = Новый Структура("СсылкаПустая", СсылкаПустая);
	
	Если СсылкаПустая Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьКопированиемТекущегоЗавершение", 
														ЭтотОбъект, ДополнительныеПараметры);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = НСтр("ru = ""Создание подчиненных заданий возможно только после записи текущего задания. Записать?""");
		
		ПоказатьВопрос(ОписаниеОповещения, Текст, Режим, 0);
		Возврат;
				
	КонецЕсли;
	
	СоздатьКопированиемТекущегоЗавершение(Неопределено, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКопированиемТекущегоЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.СсылкаПустая Тогда
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли; 
		
		Записать();
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.упоЗадания.Форма.ФормаИсполнители", , ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатус(Команда)
	
	НовыйСтатусЗадания = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий." + Команда.Имя);
	ОбработатьКомандуИзмененияСтатуса(НовыйСтатусЗадания, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусИЗакрыть(Команда)
	
	НовыйСтатусЗадания = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий." + СтрЗаменить(Команда.Имя, "ИЗакрыть", ""));
	ОбработатьКомандуИзмененияСтатуса(НовыйСтатусЗадания, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуИзмененияСтатуса(НовыйСтатусЗадания, ЗакрытьПослеСменыСтатуса) 
	
	Если Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи 
		И НовыйСтатусЗадания = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Отменено") Тогда
		Сообщение = 
			НСтр("ru = 'Текущее Задание не может быть отменено, так как синхронизируется с Задачей (реквизит ""Синхронизировать с задачей"").'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли;
	СменитьСтатусЗадания(НовыйСтатусЗадания, ЗакрытьПослеСменыСтатуса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеЗаданияПриАктивизацииСтроки(Элемент)
	
	Если ИдетУстановкаЗаголовкаСтраницыПодчиненных Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьЗаголовокСтраницыПодчиненныхОтложенно();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеЗаданияПриИзменении(Элемент)
	
	УстановитьЗаголовокСтраницыПодчиненныхОтложенно();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьОтображениеЭлементовПоВидуЗадания(Форма)
	
	Форма.Элементы.РешениеОПереходеВСледующуюФазу.Видимость = Ложь;
	
	Если Форма.Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение") Тогда
		Форма.Элементы.СтраницаОписание.Заголовок = "Описание и сроки";
		Форма.Элементы.СтраницаКонтролеры.Видимость = Истина;
		Форма.Элементы.ЭтоОсновноеЗаданиеПроектнойЗадачи.Видимость = Истина;
		Форма.Элементы.Декорация5.Видимость = Ложь;
		Форма.Элементы.ОписаниеРезультата.Заголовок = "Результат выполнения";
		Форма.Элементы.ГруппаСрокиПлан.Видимость = Истина;
		Форма.Элементы.ГруппаСрокиПрогноз.Видимость = Истина;
		Форма.Элементы.ГруппаСрокиФакт.Видимость = Истина;
		Форма.Элементы.СтраницаСогласующие.Видимость = Ложь;
		Форма.Элементы.Исполнитель.Видимость = Истина;
		Форма.Элементы.ВидСогласования.Видимость = Ложь;
		Форма.Элементы.ЭтоЗаданиеПодразделению.Видимость = Истина;
		Форма.Элементы.ГруппаРольИПодразделение.Видимость = Истина;
		
	ИначеЕсли Форма.Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение") Тогда
		Форма.Элементы.СтраницаОписание.Заголовок = "Тема";
		Форма.Элементы.ОписаниеРезультата.Заголовок = "Итог";
		Форма.Элементы.ЭтоОсновноеЗаданиеПроектнойЗадачи.Видимость = Ложь;
		Форма.Элементы.Декорация5.Видимость = Истина;
		Форма.Элементы.СтраницаКонтролеры.Видимость = Ложь;
		Форма.Элементы.ГруппаСрокиПлан.Видимость = Ложь;
		Форма.Элементы.ГруппаСрокиПрогноз.Видимость = Ложь;
		Форма.Элементы.ГруппаСрокиФакт.Видимость = Ложь;
		Форма.Элементы.СтраницаСогласующие.Видимость = Ложь;
		Форма.Элементы.Исполнитель.Видимость = Истина;
		Форма.Элементы.ВидСогласования.Видимость = Ложь;
	    Форма.Элементы.ЭтоЗаданиеПодразделению.Видимость = Ложь;		
		Форма.Объект.ЭтоЗаданиеПодразделению = Ложь;
		Форма.Элементы.ГруппаРольИПодразделение.Видимость = Ложь;
		
	ИначеЕсли Форма.Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.ПроектноеРешение") Тогда
		Форма.Элементы.СтраницаОписание.Заголовок = "Описание и сроки";
		Форма.Элементы.СтраницаКонтролеры.Видимость = Истина;
		Форма.Элементы.ЭтоОсновноеЗаданиеПроектнойЗадачи.Видимость = Истина;
		Форма.Элементы.Декорация5.Видимость = Истина;
		Форма.Элементы.ОписаниеРезультата.Заголовок = "Проектное решение";
		Форма.Элементы.ГруппаСрокиПлан.Видимость = Истина;
		Форма.Элементы.ГруппаСрокиПрогноз.Видимость = Истина;
		Форма.Элементы.ГруппаСрокиФакт.Видимость = Истина;
		Форма.Элементы.СтраницаСогласующие.Видимость = Ложь;
		Форма.Элементы.Исполнитель.Видимость = Истина;
		Форма.Элементы.ВидСогласования.Видимость = Ложь;
		Форма.Элементы.ЭтоЗаданиеПодразделению.Видимость = Ложь;
		Форма.Объект.ЭтоЗаданиеПодразделению = Ложь;
		Форма.Элементы.ГруппаРольИПодразделение.Видимость = Ложь;
		
		Если Форма.Объект.ЭтоОсновноеЗаданиеПроектнойЗадачи Тогда
			Форма.Элементы.РешениеОПереходеВСледующуюФазу.Видимость = Истина;
		КонецЕсли;
		
	ИначеЕсли Форма.Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование") Тогда
		Форма.Элементы.СтраницаОписание.Заголовок = "Описание и сроки";
		Форма.Элементы.СтраницаКонтролеры.Видимость = Истина;
		Форма.Элементы.ЭтоОсновноеЗаданиеПроектнойЗадачи.Видимость = Истина;
		Форма.Элементы.Декорация5.Видимость = Ложь;
		Форма.Элементы.ОписаниеРезультата.Заголовок = "Результат выполнения";
		Форма.Элементы.ГруппаСрокиПлан.Видимость = Истина;
		Форма.Элементы.ГруппаСрокиПрогноз.Видимость = Истина;
		Форма.Элементы.ГруппаСрокиФакт.Видимость = Истина;
		Если Форма.Объект.ЭтоСогласованиеРодитель Тогда
			Форма.Элементы.СтраницаСогласующие.Видимость = Истина;
			Форма.Элементы.Исполнитель.Видимость = Ложь; 
			Форма.Элементы.ВидСогласования.Видимость = Истина;
		Иначе
			Форма.Элементы.СтраницаСогласующие.Видимость = Ложь;
			Форма.Элементы.Исполнитель.Видимость = Истина; 
			Форма.Элементы.ВидСогласования.Видимость = Ложь;
		КонецЕсли;	
		Форма.Элементы.ЭтоЗаданиеПодразделению.Видимость = Ложь;
		Форма.Объект.ЭтоЗаданиеПодразделению = Ложь;
		Форма.Элементы.ГруппаРольИПодразделение.Видимость = Истина;
		
	КонецЕсли; 	
	
	Форма.Элементы.ВидЗаданияПодразделению.Видимость = Форма.Элементы.ЭтоЗаданиеПодразделению.Видимость;
	Форма.Элементы.ВидЗаданияПодразделению.Доступность = Форма.Объект.ЭтоЗаданиеПодразделению;
	
	УстановитьОтметкуНезаполненного(Форма);
	
КонецПроцедуры

&НаСервере
Функция УстановитьОтборВДинамическомСписке()
	
	Если Объект.Ссылка.Пустая() Тогда
		ПодчиненныеЗадания.Параметры.УстановитьЗначениеПараметра("Родитель", Неопределено);
	Иначе
		// Используем однократную установку отбора.
		Если Не ОтборДинамическогоСпискаУстановлен Тогда
			ПодчиненныеЗадания.Параметры.УстановитьЗначениеПараметра("Родитель", Объект.Ссылка);
			ОтборДинамическогоСпискаУстановлен = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура СменитьСтатусЗадания(НовыйСтатус, ЗакрытьПослеСменыСтатуса)
		
	ДополнительныеПараметры = Новый Структура("НовыйСтатус, ЗакрытьПослеСменыСтатуса", НовыйСтатус, ЗакрытьПослеСменыСтатуса);
	ОписаниеОповещения = Новый ОписаниеОповещения("СменитьСтатусЗаданияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если СписокСтатусовСПредупреждением.НайтиПоЗначению(НовыйСтатус) <> Неопределено Тогда	
		ТекстВопроса = НСтр("ru = 'Статус задания будет изменен на ""%1"". Продолжить?'");
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, НовыйСтатус);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатусЗаданияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи 
		И (ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто")
		   Или ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено")) Тогда
		   
		Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = Ложь;
		Объект.ЗавершеноЗакрытоВручную = Истина;
		Модифицированность = Истина;
		
	ИначеЕсли Не Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи И Объект.ЗавершеноЗакрытоВручную
		И (ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Завершено") 
		   И ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выполняется") 
			Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто") 
				И ДополнительныеПараметры.НовыйСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Выдано")) Тогда
		
		Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = Истина;
		Объект.ЗавершеноЗакрытоВручную = Ложь;
		Модифицированность = Истина;		
		
	КонецЕсли;
		
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	КомментарийЗадания = СтрЗаменить(ПолеКомментария, Символы.ПС, "<br>");
	ПолеКомментария = "";
	
	Успешно = упоЗаданияСервер.УстановитьСтатусЗадания(Объект.Ссылка, ДополнительныеПараметры.НовыйСтатус, КомментарийЗадания,, Ложь);
	
	клОбновитьОписание();
	
	Если Успешно Тогда
		ПараметрыОповещения = Новый Структура ("Проект, ЭтоЗаданиеПодразделению,Статус, Закрытие, Задание", 
		                            Объект.Проект,
									Объект.ЭтоЗаданиеПодразделению,
									ДополнительныеПараметры.НовыйСтатус,
									ДополнительныеПараметры.ЗакрытьПослеСменыСтатуса,
									Объект.Ссылка);
		Оповестить("Задания_СтатусЗаданияИзменен", ПараметрыОповещения, ЭтаФорма); 
							
		Если ДополнительныеПараметры.ЗакрытьПослеСменыСтатуса Тогда							
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;	
	    
КонецПроцедуры

&НаКлиенте
Процедура клОбновитьОписание()
	
	Если ЭтоРежимРедактирования() Тогда
		Возврат;
	КонецЕсли;
	
	ПолеИстории = ПолучитьОписание(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоРежимРедактирования()
	
	Если РежимРедактирования = Неопределено Тогда
		РежимРедактирования = Ложь;
	КонецЕсли;
	
	Если РежимРедактирования Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОписание(пЗадание)
	
	Возврат Обработки.упоРаботаСЗаданиями.ПолучитьОписание(пЗадание);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_Обновить_текЗадание()
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЯИсполнительЯАвторЯКонтролер(Задание, ТекущийСотрудник, ПроектнаяЗадача, Исполнитель = Неопределено)
	
	СтруктураРолей = упоЗаданияСервер.ПолучитьСтруктуруРолей(Задание, ТекущийСотрудник, ПроектнаяЗадача, Исполнитель);
	
	Возврат СтруктураРолей;

КонецФункции

&НаСервере
Процедура СоздатьКопированиемТекущегоНаСервере(Знач ПодчиненныеСписокИсполнителей)
	
	ЗаданиеОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("ДатаНачалаПлан", ДатаНачалаПлан);
	СтруктураРеквизитов.Вставить("ДатаОкончанияПлан", ДатаОкончанияПлан);

	упоЗаданияСервер.СоздатьПодчиненныеЗаданияКопированиемТекущего(ЗаданиеОбъект, СтруктураРеквизитов, ПодчиненныеСписокИсполнителей);	
	
	Элементы.ПодчиненныеЗадания.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	Если НЕ ЗначениеЗаполнено(Форма.Объект.Родитель) Тогда 
		Форма.Элементы.Родитель.Видимость = Ложь; 
	КонецЕсли;
	
	Если Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.упоСтатусыЗаданий.Закрыто") Тогда
		Форма.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Форма.СтруктураРолей.ЯАвтор Тогда
		Форма.Элементы.Группа6.ТолькоПросмотр = Истина;
		Форма.Элементы.Группа5.ТолькоПросмотр = Истина;
		Форма.Элементы.ОписаниеЗадания.ТолькоПросмотр = Истина;
		Форма.Элементы.ГруппаСрокиПлан.ТолькоПросмотр = Истина;
		Форма.Элементы.СтраницаКонтролеры.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьДоступностьРезультатаВыполнения(Форма);
	
	ВидимостьЭтоЗаданиеИсполнителяПроектнойЗадачи = Ложь;
	Если Форма.Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение") Тогда
		ВидимостьЭтоЗаданиеИсполнителяПроектнойЗадачи = ЗначениеЗаполнено(Форма.Объект.ПроектнаяЗадача);
	КонецЕсли;
	Форма.Элементы.ЭтоЗаданиеИсполнителяПроектнойЗадачи.Видимость = ВидимостьЭтоЗаданиеИсполнителяПроектнойЗадачи;
	Форма.Элементы.ЭтоЗаданиеИсполнителяПроектнойЗадачи.Доступность = 
		ВидимостьЭтоЗаданиеИсполнителяПроектнойЗадачи И НЕ(Форма.Объект.ЭтоЗаданиеПодразделению);
		
	Если Форма.Элементы.ЭтоЗаданиеИсполнителяПроектнойЗадачи.Видимость И Форма.Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи Тогда
		Форма.Элементы.ГруппаСрокиПланДаты.ТолькоПросмотр = Истина;
	Иначе
		Форма.Элементы.ГруппаСрокиПланДаты.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРезультатаВыполнения(Форма)
	
	Форма.Элементы.ГруппаРезультатВыполнения.ТолькоПросмотр = НЕ Форма.СтруктураРолей.ЯИсполнитель;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектнаяЗадачаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Проект) ИЛИ НЕ ЗначениеЗаполнено(Объект.ПортфельПроекта) Тогда
		СтруктураСвойств = ПолучитьПроектИПортфельПроектнойЗадачи(Объект.ПроектнаяЗадача);
		Если СтруктураСвойств <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
				Объект.Проект = СтруктураСвойств.Проект;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ПортфельПроекта) Тогда 
				Объект.ПортфельПроекта = СтруктураСвойств.ПортфельПроекта;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДоступныеСтатусы();
	УстановитьДоступностьЭлементов(ЭтаФорма);
	Если Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи Тогда
		УстановитьСрокиПоПроектнойЗадаче();
	КонецЕсли;
	
	ПроверитьКорректностьПризнакаОсновноеЗадание();
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектИПортфельПроектнойЗадачи(ПроектнаяЗадача)
	
	Перем СтруктураСвойств;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.упоКорневойПроект КАК Проект,
	               |	Проекты.упоКорневойПроект.ПортфельПроектов КАК ПортфельПроекта
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |ГДЕ
	               |	Проекты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПроектнаяЗадача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураСвойств = Новый Структура;
		СтруктураСвойств.Вставить("Проект", Выборка.Проект);
		СтруктураСвойств.Вставить("ПортфельПроекта", Выборка.ПортфельПроекта);
	КонецЕсли;
	
	Возврат СтруктураСвойств;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущегоСотрудника()

	ТекущийСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	
	Возврат ТекущийСотрудник;

КонецФункции

&НаКлиенте
Процедура ОбновитьДоступныеСтатусы()
	
	СтруктураРолей = ЯИсполнительЯАвторЯКонтролер(Объект.Ссылка, ТекущийСотрудник, Объект.ПроектнаяЗадача, Объект.Исполнитель);
	СтруктураРолей.Вставить("Статус", ТекущийСтатус);
	СтруктураРолей.Вставить("ВидЗадания", Объект.ВидЗадания);
	упоЗаданияКлиент.ОбновитьДоступныеСтатусы(ЭтаФорма, СтруктураРолей);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьЗаголовок(ВидЗадания, ЭтоНовый, СтрокаНаименование = "", Статус = "")
	
	СтрокаВидЗадания = ?(ЗначениеЗаполнено(ВидЗадания), Строка(ВидЗадания), "Задание");
	
	Если ЭтоНовый Тогда
		
		ЗаголовокФормы = СтрокаВидЗадания + " (создание)";
		
	Иначе	
		ЗаголовокФормы =  СтрокаНаименование
						+ " (" 
						+ СтрокаВидЗадания
						+ ") | Статус: " + Статус; 	
		
	КонецЕсли;
					
	Возврат ЗаголовокФормы;					
	
КонецФункции

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Объект.ПортфельПроекта = ПолучитьПортфельПроектаНаСервере(Объект.Проект);
	
	РезультатПроверки = ПроверитьСоответствиеПроектнойЗадачиПроекту(Объект.Проект, Объект.ПроектнаяЗадача);	
	Если РезультатПроверки.ОчиститьПроект Тогда
	    Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		Объект.ПроектнаяЗадача = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		ПроверитьКорректностьПризнакаОсновноеЗадание();
		ОбновитьДоступныеСтатусы();
	ИначеЕсли РезультатПроверки.ОчиститьПроектнуюЗадачу Тогда
		Объект.ПроектнаяЗадача = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		ПроверитьКорректностьПризнакаОсновноеЗадание();
		ОбновитьДоступныеСтатусы();		
	КонецЕсли;
	
	УстановитьОтметкуНезаполненного(ЭтаФорма);
	УстановитьДоступностьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПортфельПроектаНаСервере(Проект)
	
	ПортфельПроекта = Проект.ПортфельПроектов;
	Возврат ПортфельПроекта;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьСоответствиеПроектнойЗадачиПроекту(Проект, ПроектнаяЗадача)
	
	РезультатПроверки = Новый Структура();
	РезультатПроверки.Вставить("ОчиститьПроект", ЗначениеЗаполнено(Проект) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "ЭтоПроектнаяЗадача"));
	РезультатПроверки.Вставить("ОчиститьПроектнуюЗадачу", НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "упоКорневойПроект") = Проект);
	
	Возврат РезультатПроверки;

КонецФункции

&НаСервере
Процедура СоздатьПодчиненныеСогласования()

	ПодчиненныеСписокИсполнителей = Новый СписокЗначений;
	
	Если Объект.ВидСогласования = ПредопределенноеЗначение("Перечисление.упоВидыСогласований.Параллельное") Тогда
		// Создаем подчиненные согласования для всех
		ПодчиненныеСписокИсполнителей.ЗагрузитьЗначения(Объект.СогласующиеЛица.Выгрузить().ВыгрузитьКолонку("СогласующееЛицо"));
		
	ИначеЕсли Объект.ВидСогласования = ПредопределенноеЗначение("Перечисление.упоВидыСогласований.Последовательное") Тогда  
		// Создаем подчиненные согласования для следующего согласующего
		Для Каждого СтрокаСогласующееЛицо Из Объект.СогласующиеЛица Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаСогласующееЛицо.Статус) Тогда
				ПодчиненныеСписокИсполнителей.Добавить(СтрокаСогласующееЛицо.СогласующееЛицо);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СоздатьКопированиемТекущегоНаСервере(ПодчиненныеСписокИсполнителей);
 
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	СписокСтатусовСПредупреждением.ЗагрузитьЗначения(упоЗаданияСервер.ПолучитьМассивСтатусовСПредупреждением());
	
	// Таблица доступных статусов
	ТЗДоступныеСтатусы = упоЗаданияСервер.ДобавитьКнопкиИзмененияСтатуса(ЭтаФорма, Истина);	
	ЗначениеВРеквизитФормы(ТЗДоступныеСтатусы, "ТаблицаДоступныеСтатусы");
	
	// Статус задания и заголовок
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекущийСтатус = упоЗаданияСервер.ПолучитьСтатусЗадания(Объект.Ссылка);
		Заголовок = СформироватьЗаголовок(Объект.ВидЗадания, Ложь, Объект.Наименование, ТекущийСтатус);
	Иначе
		Заголовок = СформироватьЗаголовок(Объект.ВидЗадания, Истина);
	КонецЕсли;
	
	// Текущий сотрудник
	ТекущийСотрудник = ПараметрыСеанса.упоТекущийСотрудник;
	
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось определить текущего сотрудника!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	// Сроки
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтруктураСроки = упоЗаданияСервер.ПолучитьСрокиЗадания(Объект.Ссылка);
		Если СтруктураСроки <> Неопределено Тогда
			ДатаНачалаПлан = СтруктураСроки.ДатаНачалаПлан;
			ДатаОкончанияПлан = СтруктураСроки.ДатаОкончанияПлан;
			ДатаНачалаФакт = СтруктураСроки.ДатаНачалаФакт;
			ДатаОкончанияФакт = СтруктураСроки.ДатаОкончанияФакт;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		СтруктураСроки = упоЗаданияСервер.ПолучитьСрокиЗадания(Параметры.ЗначениеКопирования);
		ДатаНачалаПлан = СтруктураСроки.ДатаНачалаПлан;
		ДатаОкончанияПлан = СтруктураСроки.ДатаОкончанияПлан;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ПроектнаяЗадача) Тогда
		
		УстановитьСрокиПоПроектнойЗадаче();
		
	КонецЕсли;
	
	// Флаг "ЭтоСогласованиеРодитель"
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		И Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование") Тогда
		
		Объект.ЭтоСогласованиеРодитель = Истина;
		
	КонецЕсли;
	
	// Роли
	СтруктураРолей = ЯИсполнительЯАвторЯКонтролер(Объект.Ссылка, 
		ТекущийСотрудник, 
		Объект.ПроектнаяЗадача, 
		Объект.Исполнитель);
	СтруктураРолей.Вставить("Статус", ТекущийСтатус);
	СтруктураРолей.Вставить("ВидЗадания", Объект.ВидЗадания);
	
	// Согласующие лица
	СогласующийРуководитель = Неопределено;
	Если Параметры.ЗначенияЗаполнения.Свойство("СогласующийРуководитель", СогласующийРуководитель) 
		И ЗначениеЗаполнено(СогласующийРуководитель) Тогда
		
		СтрокаСогласующий = Объект.СогласующиеЛица.Добавить();
		СтрокаСогласующий.СогласующееЛицо = СогласующийРуководитель;
		
	КонецЕсли;
	
	// Ограничение типа объекта
	ИспользуемыеТипы = упоФункцииОбщегоНазначенияСервер.ТипыМетаданных_УбратьНеиспользуемые();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ОбъектБазы", "ОграничениеТипа", Новый ОписаниеТипов(ИспользуемыеТипы));

	СформироватьСписокВыбораВидыЗаданий();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтметкуНезаполненного(Форма)

	Если Форма.Объект.ВидЗадания = ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение") Тогда
		Форма.Элементы.Проект.АвтоОтметкаНезаполненного = Истина;
		Форма.Элементы.Проект.ОтметкаНезаполненного = Истина;
		НужноУказатьЗадачу = упоЗаданияСерверПовтИсп.ПроверитьОбязательностьУказанияПроектнойЗадачиВОбсуждении(Форма.Объект.Проект); 
		Форма.Элементы.ПроектнаяЗадача.АвтоОтметкаНезаполненного = НужноУказатьЗадачу;
		Форма.Элементы.ПроектнаяЗадача.ОтметкаНезаполненного = НужноУказатьЗадачу;
	Иначе
		Форма.Элементы.Проект.АвтоОтметкаНезаполненного = Ложь;
		Форма.Элементы.Проект.ОтметкаНезаполненного = Ложь;
		Форма.Элементы.ПроектнаяЗадача.АвтоОтметкаНезаполненного = Ложь;
		Форма.Элементы.ПроектнаяЗадача.ОтметкаНезаполненного = Ложь;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция УстановитьСрокиПоПроектнойЗадаче()
	
	СсылкаНаПроектнуюЗадачу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПроектнаяЗадача, "СсылкаНаПроектнуюЗадачу");
	СтруктураСроки = Документы.упоПроектнаяЗадача.ПолучитьСроки(СсылкаНаПроектнуюЗадачу);
	Если СтруктураСроки <> Неопределено Тогда
		ДатаНачалаПлан = СтруктураСроки.ДатаНачала;
		ДатаОкончанияПлан = СтруктураСроки.ДатаЗавершения;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокСтраницыПодчиненныхОтложенно() 
	
	ПодключитьОбработчикОжидания("УстановитьЗаголовокСтраницыПодчиненныхКлиент", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокСтраницыПодчиненныхКлиент() 
	
	УстановитьЗаголовокСтраницыПодчиненных(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСтраницыПодчиненных(ЭтаФорма)
	
	ЭтаФорма.ИдетУстановкаЗаголовкаСтраницыПодчиненных = Истина;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда
		КоличествоПодчиненных = ПолучитьКоличествоПодчиненных(ЭтаФорма.Объект.Ссылка);
	Иначе
		КоличествоПодчиненных = 0;
	КонецЕсли;
	
	НовыйЗаголовок = НСтр("ru = 'Подчиненные задания'");
	Если КоличествоПодчиненных <> 0 Тогда
		НовыйЗаголовок = НовыйЗаголовок + " (" + Формат(КоличествоПодчиненных, "ЧДЦ=; ЧН=; ЧГ=") + ")";
	КонецЕсли;
	
	Если ЭтаФорма.Элементы.СтраницаПодчиненныеЗадания.Заголовок <> НовыйЗаголовок Тогда
		ЭтаФорма.Элементы.СтраницаПодчиненныеЗадания.Заголовок = НовыйЗаголовок; 
	КонецЕсли;
	
	ИдетУстановкаЗаголовкаСтраницыПодчиненных = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоПодчиненных(Ссылка) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упоЗадания.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.упоЗадания КАК упоЗадания
	               |ГДЕ
	               |	НЕ упоЗадания.ПометкаУдаления
	               |	И упоЗадания.Родитель = &Родитель";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Количество;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЭтоЗаданиеИсполнителяПроектнойЗадачиПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи = Ложь;
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(ЭтаФорма);
	Если Объект.ЭтоЗаданиеИсполнителяПроектнойЗадачи Тогда
		УстановитьСрокиПоПроектнойЗадаче();
		Если Объект.ЗавершеноЗакрытоВручную Тогда
			Объект.ЗавершеноЗакрытоВручную = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РольПриИзменении(Элемент)
	
	УстановитьДоступностьВыбораРолиПодразделения();
	ЗаполнитьПодразделениеПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Роль) И Элементы.ГруппаРольИПодразделение.Видимость Тогда
		Оповещение = Новый ОписаниеОповещения("ИсполнительПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Перезаполнить реквизиты ''Роль'' и ''Подразделение''?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ИсполнительПриИзмененииЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
    УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Функция СформироватьСписокИсполнителейПоСПД(ПроектнаяЗадача, ПроектнаяПродукция)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоПроектнаяПродукцияРолиТР.Ссылка КАК Ссылка,
	               |	упоПроектнаяПродукцияРолиТР.РольТР КАК РольТР
	               |ПОМЕСТИТЬ РолиСПД
	               |ИЗ
	               |	Справочник.упоПроектнаяПродукция.РолиТР КАК упоПроектнаяПродукцияРолиТР
	               |ГДЕ
	               |	упоПроектнаяПродукцияРолиТР.Ссылка = &ПроектнаяПродукция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Рег.Ресурс КАК Ресурс,
	               |	Рег.Подразделение КАК Подразделение,
	               |	Рег.УровеньПланирования КАК УровеньПланирования,
	               |	упоРолиТрудовыхРесурсовСрезПоследних.Ресурс КАК ТрудовойРесурс
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(, ПроектнаяЗадача = &ПроектнаяЗадача) КАК Рег
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРолиТрудовыхРесурсов.СрезПоследних КАК упоРолиТрудовыхРесурсовСрезПоследних
	               |		ПО Рег.Ресурс = упоРолиТрудовыхРесурсовСрезПоследних.Роль
	               |			И (упоРолиТрудовыхРесурсовСрезПоследних.РольНазначена)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК Версии
	               |		ПО Рег.Версия = Версии.Версия
	               |			И (Версии.Текущая),
	               |	РолиСПД КАК РолиСПД
	               |ГДЕ
	               |	(Рег.Количество <> 0
	               |			ИЛИ Рег.Стоимость <> 0
	               |			ИЛИ Рег.ВнешняяСтоимость <> 0)
	               |	И Рег.Ресурс В
	               |			(ВЫБРАТЬ
	               |				РолиСПД.РольТР КАК РольТР
	               |			ИЗ
	               |				РолиСПД КАК РолиСПД)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Рег.Ресурс";
	
	Запрос.Параметры.Вставить("ПроектнаяЗадача", ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу);
	Запрос.Параметры.Вставить("ПроектнаяПродукция", ПроектнаяПродукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Возврат Новый Массив();		
	
	КонецЕсли; 
		
	МассивТрудовойРесурс = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТрудовойРесурс");
	
	Возврат МассивТрудовойРесурс;

КонецФункции

&НаСервере
Процедура ОграничитьВыборПроектнойПродукции()
	
	ПроектнаяПродукцияДоступна = упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция();
		
	Если ПроектнаяПродукцияДоступна Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбъектБазы = Элементы.Найти("ОбъектБазы");
	
	Если ЭлементОбъектБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Справочник_упоПроектнаяПродукция = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени("Справочник.упоПроектнаяПродукция");
		
	Если Справочник_упоПроектнаяПродукция = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИсходноеОграничениеТипа = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы, "ОбъектБазы", "ОграничениеТипа");
	
	Если ИсходноеОграничениеТипа = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	ВычитаемыеТипы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("СправочникСсылка.упоПроектнаяПродукция"));
	
	ОграничениеТипа = Новый ОписаниеТипов(ИсходноеОграничениеТипа, ,ВычитаемыеТипы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОбъектБазы", "ОграничениеТипа", ОграничениеТипа);

КонецПроцедуры

&НаКлиенте
Процедура ОграничитьВыборТрудовыхРесурсовПоСПД()
	
	Если Не упоИнтеграцияКлиентСервер.ИспользуетсяФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не упоИнтеграцияКлиентСервер.ЭтоПроектнаяПродукция(Объект.ОбъектБазы) Тогда
		Возврат;
	КонецЕсли;
	
	ТрудовыеРесурсы = СформироватьСписокИсполнителейПоСПД(Объект.ПроектнаяЗадача, Объект.ОбъектБазы);
	
	ОтборРесурсов = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ТрудовыеРесурсы));
	СписокПараметровВыбора = Новый Массив;
	СписокПараметровВыбора.Добавить(ОтборРесурсов);
	
	Элементы.Исполнитель.ПараметрыВыбора = Новый ФиксированныйМассив(СписокПараметровВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВыбораРолиПодразделения()
	
	Если ЗначениеЗаполнено(Объект.Роль) Тогда
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
	Иначе
		Объект.Подразделение = Неопределено;
		Элементы.Подразделение.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРолей = ЯИсполнительЯАвторЯКонтролер(Объект.Ссылка, ТекущийСотрудник, Объект.ПроектнаяЗадача, Объект.Исполнитель);
	СтруктураРолей.Вставить("Статус", ТекущийСтатус);
	упоЗаданияКлиент.ОбновитьДоступныеСтатусы(ЭтаФорма, СтруктураРолей);
	УстановитьДоступностьРезультатаВыполнения(ЭтаФорма);
	Если Элементы.ГруппаРольИПодразделение.Видимость Тогда
		ЗаполнитьРольПодразделениеПоУмолчанию(Объект.Исполнитель, Объект.ПроектнаяЗадача, ДатаНачалаПлан, Объект.Роль, Объект.Подразделение);
		
		УстановитьДоступностьВыбораРолиПодразделения();
		ПодразделенияРоли = упоРесурсыИРолиВызовСервера.обПолучитьМассивПодразделенийРоли(Объект.Роль,
				?(ЗначениеЗаполнено(ДатаНачалаПлан), ДатаНачалаПлан, ОбщегоНазначенияКлиент.ДатаСеанса()));
		УстановитьПараметрыВыбораПодразделения(ПодразделенияРоли);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодразделениеПоУмолчанию()
	
	ПодразделенияРоли = упоРесурсыИРолиВызовСервера.обПолучитьМассивПодразделенийРоли(Объект.Роль,
		?(ЗначениеЗаполнено(ДатаНачалаПлан), ДатаНачалаПлан, ОбщегоНазначенияКлиент.ДатаСеанса()));
	Если ПодразделенияРоли.Количество() Тогда
		Объект.Подразделение = ПодразделенияРоли[0];
	КонецЕсли;
	
	// Заодно установим параметры выбора подразделения.
	УстановитьПараметрыВыбораПодразделения(ПодразделенияРоли);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРольПодразделениеПоУмолчанию(Исполнитель, ПроектнаяЗадача, Знач ДатаНачалаПлан, Роль, Подразделение)
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачалаПлан) Тогда
		ДатаНачалаПлан = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПроектнаяЗадача) Тогда
		РольИПодразделениеИсполнителя = упоРесурсыИРолиСервер.ПодразделениеИРольТрудовогоРесурсаНаЗаданнуюДату(Исполнитель, 
			ТекущаяДатаСеанса());
	Иначе
		РольИПодразделениеИсполнителя = упоРесурсыИРолиСервер.РольПодразделениеТрудовогоРесурсаПоЗадаче(Исполнитель,
			ПроектнаяЗадача.СсылкаНаПроектнуюЗадачу);
		Если Не ЗначениеЗаполнено(РольИПодразделениеИсполнителя.Роль) Тогда
			РольИПодразделениеИсполнителя = упоРесурсыИРолиСервер.ПодразделениеИРольТрудовогоРесурсаНаЗаданнуюДату(Исполнитель,
				ДатаНачалаПлан);
		КонецЕсли;
	КонецЕсли;
	
	Роль = РольИПодразделениеИсполнителя.Роль;
	Подразделение = РольИПодразделениеИсполнителя.Подразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораПодразделения(ПодразделенияРоли)

	СписокВыбора = Новый ФиксированныйМассив(ПодразделенияРоли);
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", СписокВыбора);
	
	СписокПараметровВыбора = Новый Массив;
	СписокПараметровВыбора.Добавить(ПараметрВыбора);
	
	Элементы.Подразделение.ПараметрыВыбора = Новый ФиксированныйМассив(СписокПараметровВыбора);

КонецПроцедуры

&НаСервере
Процедура СформироватьСписокВыбораВидыЗаданий()
	
	ИспользоватьНормированиеИПроектныеРешения = ПолучитьФункциональнуюОпцию("упоИспользоватьНормированиеИПроектныеРешения");
	
	СписокВыбора = ЭтаФорма.Элементы.ВидЗадания.СписокВыбора; 
		
	СписокВыбора.Очистить();
	
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Обсуждение"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Поручение"));
	Если ИспользоватьНормированиеИПроектныеРешения Тогда
		СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.ПроектноеРешение"));
	КонецЕсли;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.упоВидыЗаданий.Согласование"));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитов

#КонецОбласти
