#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТипСвязиУПОпоСтроке(строкаСвязи) Экспорт
	
	Соответствие = упоСтруктураПроектаКлиентСерверПовтИсп.ПолучитьСоответствиеТипСвязиPMПоСтроке();
	
	Результат = Соответствие.Получить(строкаСвязи);
	
	Если Результат = Неопределено Тогда
		
		Результат = ПредопределенноеЗначение("Перечисление.упоТипСвязи.ОкончаниеНачало");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтрокуПоТипуСвязиУПО(ТипСвязиУПО) Экспорт
	
	Соответствие = упоСтруктураПроектаКлиентСерверПовтИсп.ПолучитьСоответствиеСтрокиПоТипуСвязиPM();
	
	Результат = Соответствие.Получить(ТипСвязиУПО);
	
	Если Результат = Неопределено Тогда
		
		Результат = Соответствие.Получить(ПредопределенноеЗначение("Перечисление.упоТипСвязи.ОкончаниеНачало"));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеТипСвязиPMПоСтроке() Экспорт 
	
	Результат = Новый Соответствие;
	
	Обратное = упоСтруктураПроектаКлиентСерверПовтИсп.ПолучитьСоответствиеСтрокиПоТипуСвязиPM();
	
	Для Каждого КлючЗначение Из Обратное Цикл
		Результат.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

Функция ПолучитьСоответствиеСтрокиПоТипуСвязиPM() Экспорт 
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.упоТипСвязи.ОкончаниеНачало"), "ОН");
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.упоТипСвязи.НачалоНачало"), "НН");
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.упоТипСвязи.НачалоОкончание"), "НО");
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.упоТипСвязи.ОкончаниеОкончание"), "ОО");
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти
