#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт

	Документы.упоРегистрацияМощностиРолей.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияРолейТрудовогоРесурса.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияСоставаПодразделения.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияСтоимостиРесурса.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Документы.упоРегистрацияСтоимостиРесурсов.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Справочники.упоРоли);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	
	ОтборНаложен = Ложь;
	ПодразделенияРолей 	= Неопределено;
	МассивРолей			= Неопределено;
	
	Если Параметры.Отбор.Свойство("ПодразделенияРолей", ПодразделенияРолей) Тогда
		
		Если ТипЗнч(ПодразделенияРолей) = Тип("СправочникСсылка.упоПодразделения") Тогда
			Подразделения = Новый Массив;
			Подразделения.Добавить(ПодразделенияРолей);
		ИначеЕсли ТипЗнч(ПодразделенияРолей) = Тип("Массив") 
			Или ТипЗнч(ПодразделенияРолей) = Тип("СписокЗначений") Тогда
			Подразделения = ПодразделенияРолей;
		Иначе
			Подразделения = Неопределено;
		КонецЕсли;
		
		Если Подразделения <> Неопределено Тогда
			ДанныеВыбора.ЗагрузитьЗначения(РолиПодразделений(Подразделения, Параметры.СтрокаПоиска));
			ОтборНаложен = Истина;
		КонецЕсли;
		
	ИначеЕсли Параметры.Отбор.Свойство("ОтборПоРолям", МассивРолей) Тогда 
		
		Если МассивРолей <> Неопределено Тогда
			ДанныеВыбора.ЗагрузитьЗначения(РолиДокумента(МассивРолей, Параметры.СтрокаПоиска));
			ОтборНаложен = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОтборНаложен Тогда
		
		ДанныеВыбора.ЗагрузитьЗначения(РолиОбщегоПодбора(Параметры.СтрокаПоиска));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РолиПодразделений(Подразделения, СтрокаПоиска = "") Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Рег.Роль КАК Роль
		|ИЗ
		|	РегистрСведений.упоСоставПодразделений.СрезПоследних(, Подразделение В (&Подразделения)) КАК Рег
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоРоли КАК упоРоли
		|		ПО Рег.Роль = упоРоли.Ссылка
		|			И (НЕ упоРоли.НеОтображать)
		|			И (Рег.ВходитВСостав)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоСтроке
		|				ТОГДА Рег.Роль.Наименование ПОДОБНО &СтрокаПоиска
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	ПараметрыЗапроса = Новый Структура("Подразделения", Подразделения);
	МассивРолей = ВыполнитьЗапросВыбораРолей(ТекстЗапроса, СтрокаПоиска, ПараметрыЗапроса);
	
	Возврат МассивРолей;
	
КонецФункции

Функция РолиДокумента(Роли, СтрокаПоиска = "") Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРоли.Ссылка КАК Роль
	               |ИЗ
	               |	Справочник.упоРоли КАК упоРоли
	               |ГДЕ
	               |	упоРоли.Ссылка В(&МассивРолей)
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоСтроке
	               |				ТОГДА упоРоли.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ упоРоли.НеОтображать";
	
	ПараметрыЗапроса = Новый Структура("МассивРолей", Роли);
	МассивРолей = ВыполнитьЗапросВыбораРолей(ТекстЗапроса, СтрокаПоиска, ПараметрыЗапроса);
	
	Возврат МассивРолей;
	
КонецФункции

Функция РолиОбщегоПодбора(СтрокаПоиска = "")
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упоРоли.Ссылка КАК Роль
	               |ИЗ
	               |	Справочник.упоРоли КАК упоРоли
	               |ГДЕ
	               |	НЕ упоРоли.НеОтображать
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоСтроке
	               |				ТОГДА упоРоли.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	МассивРолей = ВыполнитьЗапросВыбораРолей(ТекстЗапроса, СтрокаПоиска);
	
	Возврат МассивРолей;
	
КонецФункции

Функция ВыполнитьЗапросВыбораРолей(ТекстЗапроса, СтрокаПоиска, ПараметрыЗапроса = Неопределено)
	
	МассивРолей = Новый Массив;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОтборПоСтроке", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаПоиска + "%");

	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивРолей = Результат.Выгрузить().ВыгрузитьКолонку("Роль");
	КонецЕсли;
	
	Возврат МассивРолей;
	
КонецФункции

#КонецОбласти

#КонецЕсли