////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с договорами.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проставляет картинки этапов в строках дерева значенеий.
//
// Параметры:
//  СтрокиВетки	 - КоллекцияСтрокДереваЗначений - коллекция строк ДЗ.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ПроставитьКартинкиЭтапов(СтрокиВетки) Экспорт
	
	Для каждого Строка Из СтрокиВетки Цикл
		
		ЭлементыСтроки = Строка.ПолучитьЭлементы();
		Если Строка.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Веха") Тогда
			Строка["ТипЭлемента"] = 3;
		ИначеЕсли Строка.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.Этап") Тогда
			Строка["ТипЭлемента"] = 1;
		ИначеЕсли Строка.ТипПроектнойЗадачи = ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.ПакетРабот") Тогда
			Строка["ТипЭлемента"] = 2;
		ИначеЕсли Строка.ТипПроектнойЗадачи = 
			ПредопределенноеЗначение("Перечисление.упоТипПроектнойЗадачи.МодельПакетаРабот") Тогда
			Строка["ТипЭлемента"] = 0;
		КонецЕсли;
		
		ПроставитьКартинкиЭтапов(ЭлементыСтроки);
		
	КонецЦикла;
	
КонецФункции

// Заглушка. Возвращает Неопределено.
//
// Параметры:
//  Объект	 - Произвольный - не используется.
//
// Возвращаемое значение:
//  Неопределено - в любом случае.
//
Функция ПересчитатьИтогиВсегоГрафикаДляУсловногоОформления(Объект) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Применяет отбор строк к элементам формы.
//
// Параметры:
//  Элементы - ВсеЭлементыФормы - элементы формы.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ПрименитьОтборСтрок(Элементы) Экспорт
	
	Если Элементы.ИспользоватьОтбор.Пометка = Истина Тогда 
		Элементы.ГрафикОплаты.ОтборСтрок = Новый ФиксированнаяСтруктура("Этап", Элементы.ДеревоЭтапов.ТекущиеДанные.Этап);
	Иначе
		Элементы.ГрафикОплаты.ОтборСтрок = Неопределено
	КонецЕсли;
	
КонецФункции

// Удаляет строки из дерева графика оплаты.
//
// Параметры:
//  ВеткаДляУдаления - ДанныеФормыДерево, ДанныеФормыЭлементДерева - ветка дерева для удаления.
//  Таблица 		 - ДанныеФормыКоллекция - табличная часть.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция УдалитьСтрокиИзГрафикаОплаты(ВеткаДляУдаления, Таблица) Экспорт
	
	Для Каждого Строки Из ВеткаДляУдаления.ПолучитьЭлементы() Цикл
		УдалитьСтрокиИзГрафикаОплаты(Строки, Таблица);
		УдалитьСтрокиИзТЧПоотбору(Строки.Этап, Таблица);
	КонецЦикла;
	
	УдалитьСтрокиИзТЧПоотбору(ВеткаДляУдаления.Этап, Таблица);
	
КонецФункции

// Обработчик события, вызываемый перед окончанием редактирования дерева этапов.
//
// Параметры:
//  Элемент				 - ТаблицаФормы - таблица формы - дерево.
//  НоваяСтрока			 - Булево - признак того, что вводится новая строка.
//  ОтменаРедактирования - Булево - признак отмены редактирования строки.
//  Отказ				 - Булево - признак отказа от стандартного редактирования.
//  СхемаОплаты			 - СправочникСсылка.упоСхемыОплаты - схема оплаты.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ДеревоЭтаповПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ,
	СхемаОплаты) Экспорт
	
	Если НоваяСтрока = Истина Тогда 
		ТекущиеДанные = Элемент.ТекущиеДанные; 
		Если ТекущиеДанные = Неопределено Тогда 
			Отказ = Истина;
			Возврат Неопределено;
		КонецЕсли;
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Если Не Родитель = Неопределено Тогда 
			ТекущиеДанные.ЭтапРодитель = Родитель.Этап;
		КонецЕсли;
	КонецЕсли;
	
	Если НоваяСтрока Тогда 
		ТекущиеДанные.СхемаОплаты = СхемаОплаты;
	КонецЕсли;
	
КонецФункции

// Возникает при движении курсора в поле приемнике данных - дереве этапов.
//
// Параметры:
//  ЭтаФорма				 - УправляемаяФорма - форма, на которой расположен элемент управления "ДеревоЭтапов".
//  Элемент					 - Произвольный - не используется.
//  ПараметрыПеретаскивания	 - ПараметрыПеретаскивания - содержит перетаскиваемое значение, тип действия и возможные 
//									действия при перетаскивании.
//  СтандартнаяОбработка	 - Булево - признак стандартной обработки.
//  Строка					 - Строка - идентификатор родителя.
//  Поле					 - Произвольный - не используется.
//
Процедура ДеревоЭтаповПроверкаПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка,
	Строка, Поле) Экспорт
	
	СтандартнаяОбработка = Ложь;
	РеквизитДерево = ЭтаФорма["ДеревоЭтапов"];
	ИДНовыйРодитель = Строка;
	НовыйРодитель = ?(ИДНовыйРодитель = Неопределено, Неопределено, 
		РеквизитДерево.НайтиПоИдентификатору(ИДНовыйРодитель));
	МассивИДПереносимыхЭлементов = ПараметрыПеретаскивания.Значение;
	
	Для каждого ИДПереносимыйЭлемент Из МассивИДПереносимыхЭлементов Цикл
		ПереносимыйЭлемент = РеквизитДерево.НайтиПоИдентификатору(ИДПереносимыйЭлемент);
		Если НЕ ПроверитьВозможностьПереноса(ПереносимыйЭлемент, НовыйРодитель) Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Обработчик команды "Повысить уровень задачи".
//
// Параметры:
//  Элементы	 - ВсеЭлементыФормы - элементы формы.
//  ДеревоЭтапов - ДанныеФормыДерево - дерево этапов.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция КомандаПовыситьУровеньЗадачи(Элементы, ДеревоЭтапов) Экспорт

	ДополнительныеДанные = упоОперацииСДеревьямиКлиент.ПовыситьУровеньЗадачи(Элементы, ДеревоЭтапов, "ДеревоЭтапов",,, Истина);
	ВетвиДерева = ДеревоЭтапов.ПолучитьЭлементы();
	упоУправлениеДоговорамиКлиент.ПроставитьКартинкиЭтапов(ВетвиДерева);
	упоУправлениеДоговорамиКлиентСервер.ПересчитатьВетвьДрева(ВетвиДерева)
	
КонецФункции

// Обработчик команды "Понизить уровень задачи".
//
// Параметры:
//  Элементы	 - ВсеЭлементыФормы - элементы формы.
//  ДеревоЭтапов - ДанныеФормыДерево - дерево этапов.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция КомандаПонизитьУровеньЗадачи(Элементы, ДеревоЭтапов) Экспорт
	
	ДополнительныеДанные = упоОперацииСДеревьямиКлиент.ПонизитьУровеньЗадачи(Элементы, ДеревоЭтапов, "ДеревоЭтапов",,, Истина);
	ВетвиДерева = ДеревоЭтапов.ПолучитьЭлементы();
	упоУправлениеДоговорамиКлиент.ПроставитьКартинкиЭтапов(ВетвиДерева);
	упоУправлениеДоговорамиКлиентСервер.ПересчитатьВетвьДрева(ВетвиДерева);
	
КонецФункции

// Обработчик события начала выбора Графика оплаты этапа
//
// Параметры:
//  ДеревоЭтапов		 - ДанныеФормыДерево - дерево этапов.
//  Элемент				 - Произвольный - элемент управления формы.
//  ДанныеВыбора		 - Произвольный - выбранное значение.
//  СтандартнаяОбработка - Булево - признак отказа от стандартной обработки события.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ГрафикОплатыЭтапНачалоВыбора(ДеревоЭтапов, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Список = Новый СписокЗначений;
	
	СформироватьСписокВыбораЭтапа(ДеревоЭтапов.ПолучитьЭлементы(),Список); 
	
	Форма = ОткрытьФорму("Справочник.упоЭтапыДоговоров.ФормаВыбора",, Элемент, Новый УникальныйИдентификатор);
	ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = Список;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.Использование = Истина;
	
КонецФункции

// Обработчик события автоподбора таблицы формы Графика оплаты.
//
// Параметры:
//  ДеревоЭтапов		 - ДанныеФормыДерево - дерево этапов.
//  Элемент				 - Произвольный - элемент управления формы. 
//  Текст				 - Строка - текст.
//  ДанныеВыбора		 - Произвольный - выбранное значение.
//  Параметры			 - Произвольный - не используется.
//  Ожидание			 - Произвольный - не используется.
//  СтандартнаяОбработка - Булево - признак использования стнадрантной обработки.
//
// Возвращаемое значение:
//	Неопределено - не возвращает значение.
//
Функция ГрафикОплатыЭтапАвтоПодбор(ДеревоЭтапов, Элемент, Текст, ДанныеВыбора, Параметры, Ожидание,
	СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	СформироватьСписокВыбораЭтапа(ДеревоЭтапов.ПолучитьЭлементы(), ДанныеВыбора, Текст);
	
КонецФункции

// Проверяет возможность подчинения одного типа элемента другому в дереве
// Параметры:
//	Элемент - ДанныеФормыЭлементДерева - подчиняемый элемент
//	Родитель - ДанныеФормыЭлементДерева - элемент-родитель 
//	Отказ - Булево
Процедура ПроверитьВозможностьПодчинения(Элемент, Родитель, Отказ) Экспорт

	// Типы элементов:
	// 0 - Модель
	// 1 - Этап
	// 2 - Пакет
	// 3 - Доход
	// 4 - Расход
	// 5 - Поступление
	// 6 - Выплата
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивВозможныхРодителей = Новый Массив;
	Если Элемент.ТипЭлемента = 0 ИЛИ Элемент.ТипЭлемента = 1 ИЛИ Элемент.ТипЭлемента = 2 Тогда
		МассивВозможныхРодителей.Добавить(1);
	ИначеЕсли Элемент.ТипЭлемента = 3 ИЛИ Элемент.ТипЭлемента = 4 Тогда
		МассивВозможныхРодителей.Добавить(0);
		МассивВозможныхРодителей.Добавить(1);
		МассивВозможныхРодителей.Добавить(2);
	ИначеЕсли Элемент.ТипЭлемента = 5 ИЛИ Элемент.ТипЭлемента = 6 Тогда
		МассивВозможныхРодителей.Добавить(3);
	    МассивВозможныхРодителей.Добавить(4);
	КонецЕсли;	
	
	Если ТипЗнч(Родитель) <> Тип("ДанныеФормыДерево") 
		И МассивВозможныхРодителей.Найти(Родитель.ТипЭлемента) = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;  	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УдалитьСтрокиИзТЧПоотбору(Этап, ТабличнаяЧасть)
	
	МассивСтрокдляУдаления = ТабличнаяЧасть.НайтиСтроки(Новый Структура("Этап", Этап));
	Для каждого Строка Из МассивСтрокдляУдаления Цикл
		ТабличнаяЧасть.Удалить(Строка);
	КонецЦикла;
	
КонецФункции

Функция ПроверитьВозможностьПереноса(ПереносимыйЭлемент, Знач НовыйРодитель)
	
	Если НовыйРодитель <> Неопределено Тогда
		Отказ = Ложь;  		
		ПроверитьВозможностьПодчинения(ПереносимыйЭлемент, НовыйРодитель, Отказ);
		Если Отказ Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Пока НЕ НовыйРодитель = Неопределено Цикл
		Если ПереносимыйЭлемент = НовыйРодитель Тогда
			Возврат Ложь;
		КонецЕсли;
		НовыйРодитель = НовыйРодитель.ПолучитьРодителя();	
	КонецЦикла; 
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьСписокВыбораЭтапа(СтрокиДереве, Список, Текст = "")
	
	Для Каждого СтрокаДерева Из СтрокиДереве Цикл
		
		Если СтрЧислоВхождений(Строка(СтрокаДерева.Этап), Текст) ИЛИ Текст = "" Тогда 
			Если СтрокаДерева.ИндексКартинки = 0 Тогда 
				Список.Добавить(СтрокаДерева.Этап, СтрокаДерева.Этап);
			КонецЕсли;
		КонецЕсли;
		
		СформироватьСписокВыбораЭтапа(СтрокаДерева.ПолучитьЭлементы(), Список, Текст);
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти