// Элементы формы адаптированы из формы элемента справочника НаправленияДеятельности.
//
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиЗаполнения = упоСвязьПроектаСНаправлениемДеятельности.ПолучитьНастройкиЗаполненияСвязанногоНД();
	
	Если ТипЗНЧ(НастройкиЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиЗаполнения);
		
		Если НастройкиЗаполнения.Свойство("УчетДенежныхСредствРаздельно") 
			И НастройкиЗаполнения.УчетДенежныхСредствРаздельно Тогда
			СпособУчетаДС = "РаздельныйУчет";
		ИначеЕсли НастройкиЗаполнения.Свойство("УчетДенежныхСредствПоКорреспонденции") 
			И НастройкиЗаполнения.УчетДенежныхСредствПоКорреспонденции Тогда
			СпособУчетаДС = "ПоКорреспонденции";
		Иначе
			УчетДенежныхСредств = Ложь;
		КонецЕсли;
		
		Если НастройкиЗаполнения.Свойство("НалогообложениеНДСОпределяетсяВДокументе")
			И НастройкиЗаполнения.НалогообложениеНДСОпределяетсяВДокументе Тогда
			РежимНалогообложения = 1;
		Иначе
			РежимНалогообложения = 0;
		КонецЕсли;
		
		Элементы.НалогообложениеНДС.Доступность = РежимНалогообложения = 0;
		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоEPM() Тогда

		Элементы.ГруппаОбособлениеСверхПотребностиОтступ.Видимость = 
			упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов");
		Элементы.ГруппаРежимНалогообложения.Видимость = 
			упоФункцииОбщегоНазначенияСервер.упоПолучитьФункциональнуюОпцию("ИспользоватьРаздельныйУчетПоНалогообложению");
		
		МенеджерНаправленияДеятельности = ОбщегоНазначения.ОбщийМодуль("Справочники.НаправленияДеятельности");
		ПараметрыЗаполнения = МенеджерНаправленияДеятельности.ПараметрыЗаполненияНалогообложениеНДСПродажи();
	
		МодульУчетНДСУП = ОбщегоНазначения.ОбщийМодуль("УчетНДСУП");
	
		МодульУчетНДСУП.ЗаполнитьСписокВыбораНалогообложенияНДСПродажи(
			Элементы.НалогообложениеНДС, 
			НалогообложениеНДС, 
			ПараметрыЗаполнения, 
			УчетНДСКэшированныеЗначенияПараметров);
			
	КонецЕсли;
		
	УстановитьДоступностьЭлементов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
		
	ЗаписатьНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНаСервере();
	
	ЭтаФорма.Закрыть();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетЗатратПриИзменении(Элемент)
				
	Если Не УчетЗатрат Тогда
		УчетДенежныхСредств = Ложь;
		УчетДенежныхСредствРаздельно = Ложь;
		УчетДенежныхСредствПоКорреспонденции = Ложь;
		УчетВнеоборотныхАктивов = Ложь;
	КонецЕсли;

	УстановитьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСредстваПриИзменении(Элемент)
		
	Если УчетДенежныхСредств Тогда
		УчетДенежныхСредствРаздельно = Истина;
		СпособУчетаДС = "РаздельныйУчет";
	Иначе
		УчетДенежныхСредствРаздельно = Ложь;
		УчетДенежныхСредствПоКорреспонденции = Ложь;
		СпособУчетаДС = "";
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаДСПриИзменении(Элемент)
	
	УчетДенежныхСредствРаздельно = СпособУчетаДС = "РаздельныйУчет";
	УчетДенежныхСредствПоКорреспонденции = НЕ УчетДенежныхСредствРаздельно;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимНалогообложенияПриИзменении(Элемент)
	
	Если РежимНалогообложения = 1 Тогда		
		НалогообложениеНДС = Неопределено;			
	КонецЕсли;
	
	Элементы.НалогообложениеНДС.Доступность = РежимНалогообложения = 0;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()

	Если Не УчетЗатрат Тогда
		УчетДенежныхСредствРаздельно = Ложь;
		УчетДенежныхСредствПоКорреспонденции = Ложь;
		УчетВнеоборотныхАктивов = Ложь;
	КонецЕсли;
	
	МассивРеквизитов = ЭтаФорма.ПолучитьРеквизиты();
	НастройкиЗаполнения = Новый Структура();
	// Настройки Статус и ТипНаправленияДеятельности заполняются при получении настроек.
	Для Каждого РеквизитФормы Из МассивРеквизитов Цикл
		Если РеквизитФормы.Имя = "СпособУчетаДС" Тогда
			Если ЭтаФорма[РеквизитФормы.Имя] = "РаздельныйУчет" Тогда
				НастройкиЗаполнения.Вставить("УчетДенежныхСредствРаздельно", Истина);
			Иначе
				НастройкиЗаполнения.Вставить("УчетДенежныхСредствПоКорреспонденции", Истина);
			КонецЕсли;
		ИначеЕсли РеквизитФормы.Имя = "РежимНалогообложения" Тогда
			НастройкиЗаполнения.Вставить("НалогообложениеНДСОпределяетсяВДокументе", НЕ ЭтаФорма[РеквизитФормы.Имя] = 0);
		Иначе
			НастройкиЗаполнения.Вставить(РеквизитФормы.Имя, ЭтаФорма[РеквизитФормы.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	упоСвязьПроектаСНаправлениемДеятельности.СохранитьНастройкиЗаполненияСвязанногоНД(НастройкиЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ГруппаДенежныеСредстваВнеоборотныеАктивы.Доступность = УчетЗатрат;
	Элементы.ГруппаОбособлениеСверхПотребностиОтступ.Доступность = УчетЗатрат;

	Элементы.ГруппаСпособУчетаДС.Доступность = УчетДенежныхСредств;

КонецПроцедуры


#КонецОбласти
