#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("НачалоПериода",НачалоПериода);
	Параметры.Свойство("КонецПериода",КонецПериода);
	Параметры.Свойство("УИстроки",УИстроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Пар = Новый Структура("НачалоПериода,КонецПериода,УИстроки",НачалоПериода,КонецПериода,УИстроки);
	ОповеститьОВыборе(Пар);
КонецПроцедуры

#КонецОбласти