// Получает последний номер для реквизита справочника
// Параметры:
//
//	НачалоДиапазона - Строка - Длина 8 символов.
//	КонецДиапазона  - Строка - Длина 8 символов.
//	ИмяТипаСправочника - Строка.
//	ИмяРеквизита - Строка.
//
Функция ПолучитьНовыйНомер(НачалоДиапазона, КонецДиапазона, ИмяТипаСправочника, ИмяРеквизита) Экспорт
		
	Ошибка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	" + ИмяТипаСправочника + "." + ИмяРеквизита + " КАК Номер
		|ИЗ
		|	Справочник." + ИмяТипаСправочника + " КАК " + ИмяТипаСправочника + "
		|ГДЕ
	    |	ПОДСТРОКА(СТРОКА(" + ИмяТипаСправочника + "." + ИмяРеквизита + "), 1, 2) ПОДОБНО &ШаблонНомера
		|
		|УПОРЯДОЧИТЬ ПО
		|	" + ИмяТипаСправочника + "."  + ИмяРеквизита + " УБЫВ";  
	
	Запрос.УстановитьПараметр("ШаблонНомера", Лев(НачалоДиапазона, 2));	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	                                                    
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Попытка
			НомерЧислом = Число(Прав(ВыборкаДетальныеЗаписи.Номер, 6));
			Номер = НомерЧислом + 1;
		Исключение	
			Ошибка = Истина;
		КонецПопытки;	
	КонецЦикла;
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		НомерЧислом = Число(Прав(НачалоДиапазона, 6));	//назначение первого номера по диапазону
		Номер = НомерЧислом + 1;
	КонецЕсли;
	
	Если Номер > Число(Прав(КонецДиапазона, 6)) Тогда
		Ошибка = Истина;
	КонецЕсли;
	
	Если Не Ошибка Тогда
		Возврат "SD" + Строка(Формат(Номер, "ЧЦ=6; ЧВН=; ЧГ=0"));
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
