
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр = "(*.xml)|*.xml";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ПараметрыФормы = Новый Структура("ПутьКФайлуПоказателей", ДиалогВыбораФайла.ПолноеИмяФайла);
		ОткрытьФорму("Обработка.упоВыгрузкаПоказателейПроектов.Форма.Форма",
			ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти