
#Область ПрограммныйИнтерфейс

// Удаляет имя реквизита "Валюта" из массива ПроверяемыеРеквизиты.
//
// Параметры:
//  ПроверяемыеРеквизиты - Массив
//
Процедура УдалитьЭлементВалютаИзПроверяемыхРеквизитов(ПроверяемыеРеквизиты) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	ИндексВалюты = ПроверяемыеРеквизиты.Найти("Валюта");
	Если ИндексВалюты <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ИндексВалюты);
	КонецЕсли;
	
КонецПроцедуры

// См. упоИнтеграцияУПФСервер.ЗаказыДляПерезаполненияПоПроектнойЗадаче
//
Функция ЗаказыДляПерезаполненияПоПроектнойЗадаче(ПроектнаяЗадача) Экспорт 
	Возврат упоИнтеграцияУПФСервер.ЗаказыДляПерезаполненияПоПроектнойЗадаче(ПроектнаяЗадача);
КонецФункции

// См. упоИнтеграцияУПФСервер.ПерезаполнитьЗаказыНаСервере
//
Процедура ПерезаполнитьЗаказыНаСервере(ДополнительныеПараметры) Экспорт 
	упоИнтеграцияУПФСервер.ПерезаполнитьЗаказыНаСервере(ДополнительныеПараметры);
КонецПроцедуры

// См. упоИнтеграцияУПФСервер.ПолучитьДанныеДляЗаполненияЗаказов
//
Функция ПолучитьДанныеДляЗаполненияЗаказов(ПроектнаяЗадача, ВидДокумента) Экспорт

	Возврат упоИнтеграцияУПФСервер.ПолучитьДанныеДляЗаполненияЗаказов(ПроектнаяЗадача, ВидДокумента);	
	
КонецФункции	

// См. упоИнтеграцияУПФСервер.УпаковкаЕдИзмСвязаннаяСКлассификаторомЕдИзм
//
Функция УпаковкаЕдИзмСвязаннаяСКлассификаторомЕдИзм(КлассификаторЕдиницИзмерения) Экспорт
	
	Возврат упоИнтеграцияУПФСервер.УпаковкаЕдИзмСвязаннаяСКлассификаторомЕдИзм(КлассификаторЕдиницИзмерения);
	
КонецФункции

// См. упоИнтеграцияУПФСервер.ПолучитьДанныеРаспределенияЗарплатыПоФактуТрудозатрат
//
Функция ПолучитьДанныеРаспределенияЗарплатыПоФактуТрудозатрат(ДанныеДокумента) Экспорт
	
	Возврат упоИнтеграцияУПФСервер.ПолучитьДанныеРаспределенияЗарплатыПоФактуТрудозатрат(ДанныеДокумента);
	
КонецФункции

// См. упоИнтеграцияУПФСервер.ПолучитьСвойствоВедетсяБюджетДвиженияДенежныхСредств
Функция ПолучитьСвойствоВедетсяБюджетДвиженияДенежныхСредств(ПроектнаяЗадача) Экспорт 
	
	Возврат упоИнтеграцияУПФСервер.ПолучитьСвойствоВедетсяБюджетДвиженияДенежныхСредств(ПроектнаяЗадача); 
	
КонецФункции  

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПодписок

// Обработчик подписки упоОбработкаПолученияФормыУпаковкиЕдиницыИзмерения
//
Процедура ОбработкаПолученияФормыУпаковкиЕдиницыИзмерения(Источник, ВидФормы, Параметры,
	ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоУПФ() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ИмяПараметраВыборУпаковки = упоИнтеграцияУПФКлиентСервер.ПолучитьИмяРеквизитаДляОпределенияВыбораУпаковки();
	Параметры.Вставить(ИмяПараметраВыборУпаковки, Истина);
	
	ВыбраннаяФорма = "Справочник.КлассификаторЕдиницИзмерения.%1";
	ВыбраннаяФорма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ВыбраннаяФорма, ВидФормы);
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Ключ") Тогда			
			ЭлементСтруктуры = НайтиСвязанныйЭлементУпаковки(Параметры.Ключ);
			Параметры.Вставить("Ключ", ЭлементСтруктуры);
		КонецЕсли;
		
	ИначеЕсли ВидФормы = "ФормаСписка" Тогда 
		
		Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
			ЭлементСтруктуры = НайтиСвязанныйЭлементУпаковки(Параметры.ТекущаяСтрока);
			Параметры.Вставить("ТекущаяСтрока", ЭлементСтруктуры);
		КонецЕсли;
		
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
				
		Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
			ЭлементСтруктуры = НайтиСвязанныйЭлементУпаковки(Параметры.ТекущаяСтрока);
			Параметры.Вставить("ТекущаяСтрока", ЭлементСтруктуры);
		КонецЕсли;
		
		Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Ссылка") Тогда
			
			Если ТипЗнч(Параметры.Отбор.Ссылка) = Тип("Массив") Тогда
				
				ОтборМассив = НайтиСвязанныеЭлементыУпаковок(Параметры.Отбор.Ссылка);
				
				Параметры.Отбор.Ссылка.Очистить();
				Для Каждого ЭлементОтбор Из ОтборМассив Цикл
					Параметры.Отбор.Ссылка.Добавить(ЭлементОтбор); 
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СинхронизацияЕдиницИзмерения

Функция НайтиСвязанныеЭлементыУпаковок(Упаковки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.КлассификаторЕдИзм КАК КлассификаторЕдИзм
	|ИЗ
	|	РегистрСведений.упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм КАК упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм
	|ГДЕ
	|	упоСоответствиеКлассификаторовЕдИзмИУпаковокЕдИзм.Упаковка В(&Упаковки)";
	
	Запрос.УстановитьПараметр("Упаковки", Упаковки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Классификаторы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Классификаторы.Добавить(Выборка.КлассификаторЕдИзм);		
	КонецЦикла;
	
	Возврат Классификаторы;
	
КонецФункции

Функция НайтиСвязанныйЭлементУпаковки(Упаковка)
	
	Упаковки = Новый Массив;
	Упаковки.Добавить(Упаковка);
	
	Классификаторы = НайтиСвязанныеЭлементыУпаковок(Упаковки);
	
	Классификатор = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	Если Классификаторы.Количество() <> 0 Тогда
		Классификатор = Классификаторы[0];
	КонецЕсли;	
	
	Возврат Классификатор;
	
КонецФункции

#КонецОбласти

#КонецОбласти