
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Проект = Неопределено;
	Если Параметры.Свойство("Проект", Проект) И ЗначениеЗаполнено(Проект) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФазыПроекта = ФазыПроекта(Проект, Параметры.СтрокаПоиска);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ФазыПроекта);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФазыПроекта(Проект, СтрокаПоиска = "")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("ОтборПоНаименованию", ЗначениеЗаполнено(СтрокаПоиска));
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрШаблон("%1%2%1", "%", СтрокаПоиска));
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	               |	упоФазыПроектов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.упоФазыПроектов КАК упоФазыПроектов
	               |ГДЕ
	               |	упоФазыПроектов.Владелец = &Проект
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоНаименованию
	               |				ТОГДА упоФазыПроектов.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
