
Функция ДелегированиеПроходаРазрешитьПроходPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтрокаJS = Запрос.ПолучитьТелоКакСтроку();
	Объект = ИКТ_SigurApi.ПрочитатьJSONСтроку(СтрокаJS);
	ОтветСтрук = Новый Структура;
	Если ИКТ_SigurApi.РазрешитьПроход(Объект.keyHex, Объект.direction, Объект.accessPoint) Тогда
		ОтветСтрук.Вставить("allow","true");
	Иначе
		ОтветСтрук.Вставить("allow","false");
	КонецЕсли;
	
	СтрокаJSON = ИКТ_SigurApi.ЗаписатьJSONСтроку(ОтветСтрук);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
КонецФункции

Функция СобытияПроходаЗаписатьПроходPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтрокаJS = Запрос.ПолучитьТелоКакСтроку();
	СобытияПрохода = ИКТ_SigurApi.ПрочитатьJSONСтроку(СтрокаJS);
	ОтветСтрук = Новый Структура;
	ОтветСтрук.Вставить("confirmedLogId",ИКТ_СКУД.ЗаписатьСобытияПрохода(СобытияПрохода));
	
	СтрокаJSON = ИКТ_SigurApi.ЗаписатьJSONСтроку(ОтветСтрук);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
	
	Возврат Ответ;
КонецФункции


