
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка); 		
	
	// Если документ введен не на основании,
	// то интерфейс должен отработать эту ситуацию.
	упоУправлениеФормамиСервер.ПроверитьДокументОснование(Объект, ЭтаФорма, "Проект");
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьНадписьПоследняяМодификация();
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.лмПроверитьЗаполнениеРеквизитов(Отказ);
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьНадписьПоследняяМодификация();
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьНазначаемыеРоли(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры 
	
&НаКлиенте
Процедура ПодобратьОсвобождаемыеРоли(Команда)
	
	ПараметрыПодбора = ПодготовитьДопПараметры(Команда.Имя);
	упоПодборВТабличнуюЧастьКлиент.ПодборВТабличнуюЧасть(ПараметрыПодбора.ИмяОбъектаВМетаданных,
		ПараметрыПодбора.ЭлементВладелец, ПараметрыПодбора.ДопПараметры, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьОсвобождаемыеРесурсы(Команда)
	
	ИмяТЧ = "ОсвобождаемыеРесурсы";
	
	Контекст = Новый Структура("ИмяТЧ",ИмяТЧ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьОсвобождаемыеРесурсыЗавершение", ЭтотОбъект, Контекст);	
	
	упоЗаполнениеИПодборКлиент.НадоЗаполнятьТабличнуюЧастьДокумента(ЭтаФорма, Объект, ИмяТЧ, Объект[ИмяТЧ],,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОсвобождаемыеРесурсыЗавершение(НадоЗаполнять,ДополнительныеПараметры) Экспорт
	
	Если НадоЗаполнять Тогда
		ЗаполнитьТабличнуюЧастьДокумента(ДополнительныеПараметры.ИмяТЧ);	
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПроектНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	упоУправлениеФормамиКлиент.НадписьДокументОснованиеНажатие(Объект, ЭтаФорма, "Проект");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыделяемыеРесурсы

&НаКлиенте
Процедура ВыделяемыеРесурсыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Ресурс",
		Объект.ВыделяемыеРесурсы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделяемыеРесурсыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Ресурс",
		Объект.ВыделяемыеРесурсы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсвобождаемыеРесурсы

&НаКлиенте
Процедура ОсвобождаемыеРесурсыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьОбработкаВыбора(ВыбранноеЗначение, "Ресурс",
		Объект.ОсвобождаемыеРесурсы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсвобождаемыеРесурсыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	упоПодборВТабличнуюЧастьКлиент.ТабличнаяЧастьПеретаскивание(ПараметрыПеретаскивания.Значение, "Ресурс",
		Объект.ОсвобождаемыеРесурсы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьПоследняяМодификация()
	
	НадписьПоследняяМодификация = упоУправлениеФормамиКлиент.ФормаНадписьПоследняяМодификация(Объект);		
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Перенаправим заполнение реквизитов документа
	// процедуре модуля.	
	тОбъект = упоУправлениеФормамиСервер.ПолучитьОбъектПоДаннымФормы(Объект);
	тОбъект.ОбработкаЗаполнения(ВыбранноеЗначение);
	ЗначениеВДанныеФормы(тОбъект, Объект);
	
	// И приведем гиперссылку в правильный вид.
	упоУправлениеФормамиСервер.ЗаполнитьГиперссылку(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДопПараметры(ИмяКоманды)
	
	Перем ПараметрыПодбора;
	
	упоПодборВТабличнуюЧастьКлиент.ПодготовитьСтруктуруПараметровПодбора(ПараметрыПодбора);
	
	ПараметрыПодбора.ИмяОбъектаВМетаданных = "Справочники.упоТрудовыеРесурсы";
	Если ИмяКоманды = "ПодобратьНазначаемыеРоли" Тогда
		ПараметрыПодбора.ЭлементВладелец = Элементы.ВыделяемыеРесурсы;
		ТаблицаФормы = Объект.ВыделяемыеРесурсы;
	ИначеЕсли ИмяКоманды = "ПодобратьОсвобождаемыеРоли" Тогда
		ПараметрыПодбора.ЭлементВладелец = Элементы.ОсвобождаемыеРесурсы;
		ТаблицаФормы = Объект.ОсвобождаемыеРесурсы;
	КонецЕсли;
	ИмяКолонки = "Ресурс";
		
	СтруктураДоп = ДополнительныеПараметрыПодбора(ИмяКоманды, ТаблицаФормы, ИмяКолонки,
		ПараметрыПодбора.ДопПараметры.СписокВидимыхКолонок);
		
	ПараметрыПодбора.ДопПараметры.ВыбранныеЗначения = СтруктураДоп.АдресХранилищаВыбранных;
	ПараметрыПодбора.ДопПараметры.ТаблицаОтбор = СтруктураДоп.АдресХранилищаОтбора;
	
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Функция ДополнительныеПараметрыПодбора(ИмяКоманды, ТаблицаФормы,  ИмяКолонки, СписокВидимыхКолонок)
	
	СтруктураДоп  = Новый Структура;
	СтруктураДоп.Вставить("АдресХранилищаВыбранных");
	СтруктураДоп.Вставить("АдресХранилищаОтбора");
	
	Если ИмяКоманды = "ПодобратьНазначаемыеРоли"
	 ИЛИ ИмяКоманды = "ПодобратьОсвобождаемыеРесурсы" Тогда
		СтруктураДоп.АдресХранилищаОтбора = ПодготовитьТаблицуОтбораПодбора(имяКоманды);
	КонецЕсли;

	АдресХранилища = упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуВыбранныхЗначений(ЭтаФорма.УникальныйИдентификатор,
		ТаблицаФормы, ИмяКолонки, СписокВидимыхКолонок);
	СтруктураДоп.АдресХранилищаВыбранных = АдресХранилища;
	
	Возврат СтруктураДоп;
	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуОтбораПодбора(ИмяКоманды)
	
	Перем ТаблицаОтбора;
	
	упоПодборВТабличнуюЧастьСервер.ПодготовитьТаблицуОтбора(ТаблицаОтбора);	  
	
	Если ИмяКоманды = "ПодобратьНазначаемыеРоли"
	 ИЛИ ИмяКоманды = "ПодобратьОсвобождаемыеРесурсы" Тогда
		
		НоваяСтрока =  ТаблицаОтбора.Добавить();
		
		НоваяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		НоваяСтрока.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		НоваяСтрока.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
		НоваяСтрока.Использование = Истина;
		НоваяСтрока.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	упоТрудовыеРесурсы.Ссылка
						|ИЗ
						|	Справочник.упоТрудовыеРесурсы КАК упоТрудовыеРесурсы";
		
		ТаблицаРолей = Запрос.Выполнить().Выгрузить();
		
		МассивРолей = ТаблицаРолей.ВыгрузитьКолонку("Ссылка");
		
		СписокЗадач = Новый СписокЗначений;
		СписокЗадач.ЗагрузитьЗначения(МассивРолей);
		
		НоваяСтрока.ПравоеЗначение = СписокЗадач;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, ЭтаФорма.УникальныйИдентификатор);
	  
КонецФункции

&НаСервере
Функция ЗаполнитьТабличнуюЧастьДокумента(ИмяТЧ)
	
	ТаблицаДанных = Документы[Объект.Ссылка.Метаданные().Имя].СформироватьТаблицуДанныхДляОперацииЗаполнить(Объект, ИмяТЧ);
	Объект[ИмяТЧ].Загрузить(ТаблицаДанных);
	
КонецФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);	
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено)
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
		П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти
