////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с оповещениями (переопределяемый модуль).
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Корректирует вычисляемые реквизиты.
//
// Параметры:
//  тзРеквизиты	 - Произвольный	 - не используется.
// 
// Возвращаемое значение:
//  Неопределено - не возвращает значение.
//
Функция СкорректироватьВычисляемыеРеквизиты(тзРеквизиты) Экспорт
	
КонецФункции

#КонецОбласти