
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Проект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.упоСохранениеДанныхПроекта);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТекущуюВерсиюРеализации() Экспорт
	
	Возврат 34;
	
КонецФункции

Функция ПолучитьОбъектДляСохраненияДанныхПроекта(Проект, День = Неопределено, 
											НеПолучатьДокументыМеняющиеЗакрытиеЗадачи = Истина) Экспорт

	ДокументСохранение = Неопределено;												
	
	ОдинДокументВДень = Константы.упоСоздаватьДокументСохранениеДанныхПроектаОдинЗаДень.Получить();
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если ОдинДокументВДень Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	упоСохранениеДанныхПроекта.Ссылка
		|ИЗ
		|	Документ.упоСохранениеДанныхПроекта КАК упоСохранениеДанныхПроекта
		|ГДЕ
		|	упоСохранениеДанныхПроекта.Проведен
		|	И упоСохранениеДанныхПроекта.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И упоСохранениеДанныхПроекта.Проект = &Проект И упоСохранениеДанныхПроекта.ВерсияРеализации = &ВерсияРеализации
		|
		|УПОРЯДОЧИТЬ ПО
		|	упоСохранениеДанныхПроекта.Дата УБЫВ";
		
		Если День = Неопределено Тогда
			ТекДата = ТекущаяДата();
		Иначе
			ТекДата = День;
		КонецЕсли;
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ТекущаяДата));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата));
		Запрос.УстановитьПараметр("ВерсияРеализации", ПолучитьТекущуюВерсиюРеализации());
		Запрос.УстановитьПараметр("Проект", Проект);
		
		ДокументСохранениеСсылка = Неопределено;
		ДокументСохранение = Неопределено;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументСохранениеСсылка = Выборка.Ссылка
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументСохранениеСсылка) 
			И упоЗакрытиеЭтапаПовтИспСеанс.СтрогийКонтрольИзмененияЗакрытыхЭтапов() Тогда
			
			МассивИгнорируемыхТЧ = Новый Массив;
			МассивИгнорируемыхТЧ.Добавить("КодыСДР");
			МассивИгнорируемыхТЧ.Добавить("Связи");
			МассивПроектныхЗадач = упоПроектыИЗадачиВызовСервера.ПолучитьМассивЗадачСохраненияДанныхПроекта(ДокументСохранениеСсылка, МассивИгнорируемыхТЧ);
			
			Если НеПолучатьДокументыМеняющиеЗакрытиеЗадачи И упоЗакрытиеЭтапа.ЕстьЗакрытаяЗадача(МассивПроектныхЗадач) Тогда
				ДокументСохранениеСсылка = Неопределено;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументСохранениеСсылка) Тогда
			ДокументСохранение = ДокументСохранениеСсылка.ПолучитьОбъект();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДокументСохранение = Неопределено Тогда
		ДокументСохранение = Документы.упоСохранениеДанныхПроекта.СоздатьДокумент(); 				
		ДокументСохранение.Проект = Проект;
	КонецЕсли;
	
	ДокументСохранение.Дата = ТекущаяДата;
	
	ДокументСохранение.ДополнительныеСвойства.Вставить("ОдинДокументВДень", ОдинДокументВДень);
	
	Возврат ДокументСохранение;
				   
КонецФункции

#КонецОбласти