
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработчик события ПриУстановкеНовогоНомера модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - СправочникОбъект, содержит сам объект.
//  СтандартнаяОбработка – Булево, признак выполнения стандартной (системной) обработки события..
//                 продолжение описания параметра. 
//  Префикс      – Строка, префикс, который будет использоваться для генерации номера.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события ПриКопировании модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  ОбъектКопирования – ДокументОбъект, исходный документ, который является источником копирования. 
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриКопировании(ОбъектКопирования)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ОбработкаЗаполнения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Основание    - Произвольный, значение, которое используется как основание для заполнения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Неопределено") Тогда 
		Возврат;	
	КонецЕсли; 
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаЗаполнения(ЭтотОбъект, Основание);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
//  РежимЗаписи  - РежимЗаписиДокумента, в параметр передается текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(ВерсияРеализации) Тогда
		ВерсияРеализации = Документы.упоСохранениеДанныхПроекта.ПолучитьТекущуюВерсиюРеализации();
	КонецЕсли;	
		
КонецПроцедуры // ПередЗаписью()

// Обработчик события ПриЗаписи модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отказа от записи документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПриЗаписи(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события ПередУдалением модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак удаления документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ПередУдалением(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПередУдалением()

// Обработчик события ОбработкаПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак проведения документа.
//  РежимПроведения - РежимПроведенияДокумента, в данный параметр передается текущий режим проведения.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = обСформироватьЗаголовокОшибкиПриПроведении(ЭтотОбъект);
	
	ПроверятьРазграничениеДоступа = Не (ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа")
		И ДополнительныеСвойства.НеПроверятьРазграничениеДоступа);
	Если ПроверятьРазграничениеДоступа Тогда 
		упоРазграничениеДоступаВызовСервера.обПроверитьПравилаРазграничения(ЭтотОбъект, 
			РежимЗаписиДокумента.Проведение, Отказ, Заголовок, Истина);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	ЭтоПроведениеПоТекущейВерсии = УстановитьВерсиюПроекта(ДополнительныеСвойства);
	
	ЗаполнитьМассивыИзмененныхЗадач();
	
	СформироватьДвижения_упоСвойстваПроектныхЗадач();
	СформироватьДвижения_упоСвойстваПроектов();
	СформироватьДвижения_упоПрогнозныеСрокиПроектныхЗадач();
	СформироватьДвижения_упоПрогнозныеСрокиПроектов();
	СформироватьДвижения_ПроцентыГотовности(Отказ, РежимПроведения);
	СформироватьДвижение_упоПредусловияПроектныхЗадач();
	СформироватьДвижения_упоКодыСДР();
	СформироватьДвижение_упоСтатусыПроектныхЗадач();
	СформироватьДвижения_Сроки();
	
	ЗаписатьДвиженияРегистра("упоСвойстваПроектныхЗадач");
	
	СформироватьДвижения_упоДанныеПлановТрудозатратРолей();
	
	ЗаписатьДвиженияРегистра("упоДанныеПлановТрудозатратРолей");
	ЗаписатьДвиженияРегистра("упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам");
	
	упоПроведениеДокументовСервер.АвтоматическийРасчетГотовности(ЭтотОбъект, Отказ, РежимПроведения);
	
	упоЗакрытиеЭтапа.УдалитьИзДвиженийСтатусовИПроцентовЗакрытыеЗадачи(ЭтотОбъект);
	
	// При автоматическом расчете процента готовности в движения могут быть добавлены вышестоящие этапы.
	// Их фактические даты начала и окончания тоже надо пересчитать.
	РасчетФактическихДатНачалаИОкончанияПроектныхЗадач(Отказ);
	
	Если Отказ Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	СформироватьДвижения_упоВыделенныеТрудовыеРесурсы();
	
	ЗаписатьДвиженияРегистра("упоВыделенныеТрудовыеРесурсы");
	ЗаписатьДвиженияРегистра("упоСрокиПроектныхЗадач");
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПричиныОтклонений() Тогда
		СформироватьДвижение_упоПричиныОтклонений();
		ЗаписатьДвиженияРегистра("упоПричиныОтклонений");
	КонецЕсли;
	
	ФлагЗаписатьДвиженияОбъемов = Ложь;
	
	Если ПерезаписатьМатериальныеРесурсы Или ПерезаписатьВключитьМатРесурсыВПланРасходов Тогда
		
		СформироватьДвижения_упоДанныеПлановМатериальныхРесурсов();
		
		// Записанные движения используются при формировании актуальных планов.
		ЗаписатьДвиженияРегистра("упоДанныеПлановПотребностейМатериальныхРесурсов");
		ЗаписатьДвиженияРегистра("упоДанныеРаспределенияРасходовПоПериодам");
		
		ФлагЗаписатьДвиженияОбъемов = Истина;
		
		СформироватьДвижения_упоАктуальныеПланыЗатратМатериальныхРесурсов();
		
	КонецЕсли;
		
	Если ПерезаписатьСубпродукты ИЛИ ПерезаписатьВключитьСубпродуктыВПланДоходов Тогда
		
		СформироватьДвижения_упоДанныеПлановВыпускаСубпродуктов();
		
		// Записанные движения используются при формировании актуальных планов.
		ЗаписатьДвиженияРегистра("упоДанныеПлановВыпускаСубпродуктов");
		ЗаписатьДвиженияРегистра("упоДанныеРаспределенияДоходовПоПериодам");
		
		ФлагЗаписатьДвиженияОбъемов = Истина;
		
	КонецЕсли;
	
	Если упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Если ЭтотОбъект["ПерезаписатьПроектнуюДокументацию"] Тогда
			СформироватьДвижения_упоДанныеПроектнойПродукции();
			ЗаписатьДвиженияРегистра("упоДанныеПроектнойПродукции");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПроектныеЗадачи)	Или ПерезаписатьСубпродукты Тогда
			СформироватьДвижения_упоСтатусыПроектнойПродукции();
		КонецЕсли;
	КонецЕсли;
	
	Если ФлагЗаписатьДвиженияОбъемов Тогда
		ЗаписатьДвиженияРегистра("упоДанныеПлановОбъемовПодразделения");
	КонецЕсли;
	
	Если ПерезаписатьПланДоходов Или ПерезаписатьПланРасходов Или ПерезаписатьВключитьМатРесурсыВПланРасходов 
		Или ПерезаписатьВключитьТрудРесурсыВПланРасходов Тогда
		
		СформироватьДвижения_упоДанныеПлановДоходовИРасходов(ЭтотОбъект.Версия);
		ЗаписатьДвиженияРегистра("упоДанныеПлановДоходовИРасходов");
		ЗаписатьДвиженияРегистра("упоДанныеПлановДоходовИРасходовПодразделения");
		ЗаписатьДвиженияРегистра("упоДанныеРаспределенияДоходовПоПериодам");
		
	КонецЕсли;
	
	Если ПерезаписатьДвиженияДенежныхСредств Или ПерезаписатьВключитьМатРесурсыВПланРасходов 
		Или ПерезаписатьВключитьТрудРесурсыВПланРасходов Тогда
		
		СформироватьДвижение_упоДанныеПлановДвиженияДенежныхСредств();
		ЗаписатьДвиженияРегистра("упоДанныеПлановДвиженияДенежныхСредств");
		
	КонецЕсли;
	
	// Сроки и трансляция.
	
	АктуализироватьЗадачиПоСрокамИТрансляции(Отказ);
	
	ЗаписатьДвиженияРегистра("упоСтатусыПроектныхЗадач");
	
	Если ЭтоПроведениеПоТекущейВерсии Тогда
		
		// Трудозатраты
		
		упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(
			ДополнительныеСвойства.МассивЗадачСИзмененнымиТрудозатратами, ЭтотОбъект.Ссылка);
		
		//
		
		СоздатьОбновитьСвязанныйЭлементСправочникаПроекты(Отказ);
		
		упоИерархияИПолномочияСервер.АктуализироватьРуководителейВсехПроектныхЗадачПроекта(Проект);
		
		упоЗадания.СинхронизироватьПорученияЗадач(Проект, ДополнительныеСвойства.МассивЗадачСИзмененнымиНазначеннымиТР);
		
		ОбновитьСвязанныеПроекты();
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения модуля объекта.
// 
// Параметры: 
//  ЭтотОбъект   - ДокументОбъект, содержит сам объект.
//  Отказ        - Булево, признак отмены проведения документа.
// 
// Возвращаемое значение: 
//  Нет.
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	упоОбработчикиСобытийВызовСервера.обДокументОбъектОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
	ЗаполнитьМассивыИзмененныхЗадач();
	
	упоРаспределениеТрудозатратВызовСервера.ОтразитьПлановыеТрудозатратыЗадачи(ДополнительныеСвойства.МассивЗадачСИзмененнымиТрудозатратами, ЭтотОбъект.Ссылка);	
	
	упоЗадания.СинхронизироватьПорученияЗадач(Проект, Неопределено);	
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает структуру с именами свойств регистра упоСвойстваПроектныхЗадач
// и текущим значениями свойств заданных проектных задач
//
// Параметры:
//	Версия - ДокументСсылка.упоВерсияПланаПроекта - Версия проекта 
//	ПроектныеЗадачи - Массив из ДокументСсылка.упоПроектнаяЗадача - Список проектных задач
//
// Возвращаемое значение:
//	Структура - возвращаема структура
//	 * МассивСвойств - Массив из Строка - Массив имен свойств регистра упоСвойстваПроектныхЗадач
//	 * ТаблицаТекущиеСвойства - ТаблицаЗначений - Значения текущих свойств проектных задач
//
Функция СформироватьДанныеПоТекущимСвойстваПроектныхЗадач(Версия, ПроектныеЗадачи) Экспорт
	
	МассивСвойствДляЗапроса = Новый Массив;
	МассивСвойств = Новый Массив;
	Для Каждого МСвойство Из Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Ресурсы Цикл
		МассивСвойствДляЗапроса.Добавить("упоСвойства." + МСвойство.Имя);
		МассивСвойств.Добавить(МСвойство.Имя);
	КонецЦикла;
	Для Каждого МСвойство Из Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Реквизиты Цикл
		МассивСвойствДляЗапроса.Добавить("упоСвойства." + МСвойство.Имя);
		МассивСвойств.Добавить(МСвойство.Имя);
	КонецЦикла;
	Для Каждого МСвойство Из Метаданные.РегистрыСведений.упоСвойстваПроектныхЗадач.Измерения Цикл
		МассивСвойствДляЗапроса.Добавить("упоСвойства." + МСвойство.Имя);
		МассивСвойств.Добавить(МСвойство.Имя);
	КонецЦикла;	
	ТекстЗапросаПоляСвойств = СтрСоединить(МассивСвойствДляЗапроса, ",");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	"+ТекстЗапросаПоляСвойств+"
				   |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ПроектнаяЗадача В (&МассивПроектныхЗадач)) КАК упоСвойства";
				   
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("МассивПроектныхЗадач", ПроектныеЗадачи);	
	ТаблицаТекущиеСвойства = Запрос.Выполнить().Выгрузить();
	ТаблицаТекущиеСвойства.Индексы.Добавить("ПроектнаяЗадача");	
	
	Возврат Новый Структура("МассивСвойств, ТаблицаТекущиеСвойства", МассивСвойств, ТаблицаТекущиеСвойства);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьДвиженияРегистра(ИмяРегистра)
	Если Движения[ИмяРегистра].Количество() Тогда
		Движения[ИмяРегистра].Записать();
	КонецЕсли;
КонецФункции 

#Область Актуализация_по_срокам_и_трансляции

// Актуализирует финансовые данные для задач, у которых изменились сроки или признак трансляции данных в БДР.
//
// Параметры: 
//  Отказ        - Булево, признак отмены проведения документа.
//  
Процедура АктуализироватьЗадачиСФинансамиИТрансляцией(ДанныеДокумента, ДанныеДвиженийФинансов, Отказ) 

	Если ДополнительныеСвойства.МассивЗадачТрансляции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	СоответствиеСроковЗадач = Новый Соответствие;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	упоСрокиПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаНачалаПлан КАК ДатаНачала,
	|	упоСрокиПроектныхЗадачСрезПоследних.ДатаЗавершенияПлан КАК ДатаЗавершения
	|ИЗ
	|	РегистрСведений.упоСрокиПроектныхЗадач.СрезПоследних(
	|			,
	|			Версия = &Версия
	|				И ПроектнаяЗадача В (&ПроектнаяЗадача)) КАК упоСрокиПроектныхЗадачСрезПоследних");
	Запрос.УстановитьПараметр("Версия", ЭтотОбъект.Версия);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", ДополнительныеСвойства.МассивЗадачТрансляции);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСроки = Новый Структура("ДатаНачала, ДатаЗавершения", Выборка.ДатаНачала, Выборка.ДатаЗавершения);
		СоответствиеСроковЗадач.Вставить(Выборка.ПроектнаяЗадача, Новый Структура("Результат", СтруктураСроки));					
	КонецЦикла;
		
	// Финансы
	
	ДопПараметрыРасчета = Новый Структура("ПолныйПересчетИзИсходныхДанных,
		|упоДанныеПлановПотребностейМатериальныхРесурсов_ДвиженияПодготовлены,
		|упоДанныеПлановВыпускаСубпродуктов_ДвиженияПодготовлены,
		|ЭтоДанныеСФинансамиИТрансляцией",
		Истина, Истина, Истина, Истина);			
	упоАктуализацияПроектаВызовСервера.РассчитатьФинансовыеПланы(ЭтотОбъект,
																  ДанныеДвиженийФинансов,
																  ДанныеДокумента,
																  СоответствиеСроковЗадач, 
																  ДополнительныеСвойства.МассивЗадачТрансляции,
																  ЭтотОбъект.Версия,
																  Отказ,
																  ДопПараметрыРасчета);
																  
	Если ДополнительныеСвойства.МассивЗадачТрансляции.Количество() > 0 Тогда
		ЗанулитьДанныеТрудозатратДСС(ДанныеДвиженийФинансов);
	КонецЕсли;	
	
КонецПроцедуры

Процедура АктуализироватьРаспределяемыеПоСрокам(ДанныеДокумента, ДанныеДвиженийФинансов, Отказ) 
	
	Если Не ДополнительныеСвойства.МассивЗадачАктуализацииПоСрокам.Количество() Тогда
		Возврат;
	КонецЕсли;	
	
	НезаписанныеСрокиЗадачи = Новый Соответствие;
	Для Каждого СтрокаСроки Из Сроки Цикл
		Если ДополнительныеСвойства.МассивЗадачАктуализацииПоСрокам.Найти(СтрокаСроки.ПроектнаяЗадача) <> Неопределено Тогда
			СтруктураСроки = Новый Структура;
			СтруктураСроки.Вставить("ДатаНачала", СтрокаСроки.ДатаНачалаПлан);
			СтруктураСроки.Вставить("ДатаЗавершения", СтрокаСроки.ДатаЗавершенияПлан);
			НезаписанныеСрокиЗадачи.Вставить(СтрокаСроки.ПроектнаяЗадача, Новый Структура("Результат", СтруктураСроки));		
		КонецЕсли;	
	КонецЦикла;
	
	// Финансы
	
	ДопПараметрыРасчета = Новый Структура("ПолныйПересчетИзИсходныхДанных,
		|упоДанныеПлановПотребностейМатериальныхРесурсов_ДвиженияПодготовлены,
		|упоДанныеПлановВыпускаСубпродуктов_ДвиженияПодготовлены,
		|ЭтоДанныеСФинансамиИТрансляцией",
		Ложь, 
		Ложь, 
		Ложь,
		Истина);
	упоАктуализацияПроектаВызовСервера.РассчитатьФинансовыеПланы(ЭтотОбъект,
																  ДанныеДвиженийФинансов,
																  ДанныеДокумента,
																  НезаписанныеСрокиЗадачи, 
																  ДополнительныеСвойства.МассивЗадачАктуализацииПоСрокам,
																  ЭтотОбъект.Версия,
																  Отказ, 
																  ДопПараметрыРасчета);
					
КонецПроцедуры

Процедура АктуализироватьЗадачиПоСрокамИТрансляции(Отказ)
	
	ДанныеДокумента = упоПроведениеДокументовВызовСервера.обПолучитьДанныеДокумента(Ссылка);
	ДанныеДокумента.Вставить("ТекущаяВерсияПроекта", ЭтотОбъект.Версия);
	
	ДанныеДвиженийФинансов = Новый Структура();	
	ДанныеДвиженийФинансов.Вставить("упоСрокиПроектныхЗадач");			
	ДанныеДвиженийФинансов.Вставить("упоДанныеПлановПотребностейМатериальныхРесурсов");
	ДанныеДвиженийФинансов.Вставить("упоДанныеПлановВыпускаСубпродуктов");
	ДанныеДвиженийФинансов.Вставить("упоДанныеПлановДвиженияДенежныхСредств");
	ДанныеДвиженийФинансов.Вставить("упоАктуальныеПланыДвиженийДенежныхСредств");
	ДанныеДвиженийФинансов.Вставить("упоАктуальныеПланыДоходовИРасходов");
	ДанныеДвиженийФинансов.Вставить("упоАктуальныеПланыВыполненияОбъемов");
	ДанныеДвиженийФинансов.Вставить("упоАктуальныеПланыДоходовИРасходовПодразделения");
	
	Для Каждого КлючЗначение Из ДанныеДвиженийФинансов Цикл
		ДанныеДвиженийФинансов.Вставить(КлючЗначение.Ключ, Движения[КлючЗначение.Ключ].Выгрузить());
	КонецЦикла;		
	
	АктуализироватьРаспределяемыеПоСрокам(ДанныеДокумента, ДанныеДвиженийФинансов, Отказ);	
	
	АктуализироватьЗадачиСФинансамиИТрансляцией(ДанныеДокумента, ДанныеДвиженийФинансов, Отказ);
	
	Для Каждого КлючЗначение Из ДанныеДвиженийФинансов Цикл
		Если КлючЗначение.Ключ = "упоСрокиПроектныхЗадач" Тогда
			Продолжить;
		КонецЕсли; 		
		упоФункцииОбщегоНазначенияСервер.ЗаполнитьСистемныеПоляТаблицыДвиженийРегистраСведений(КлючЗначение.Значение, Ссылка, Дата);		
		Движения[КлючЗначение.Ключ].Загрузить(КлючЗначение.Значение);
	КонецЦикла;	

КонецПроцедуры

Процедура ЗанулитьДанныеТрудозатратДСС(ДанныеДвиженийФинансов)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроектныеЗадачиТРНеВБДДС.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втПроектныеЗадачиУдалитьТрансляциюТРВБДДС
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		упоСохранениеДанныхПроектаПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |	ИЗ
	               |		Документ.упоСохранениеДанныхПроекта.ПроектныеЗадачи КАК упоСохранениеДанныхПроектаПроектныеЗадачи
	               |	ГДЕ
	               |		упоСохранениеДанныхПроектаПроектныеЗадачи.Ссылка = &Ссылка
	               |		И (НЕ упоСохранениеДанныхПроектаПроектныеЗадачи.ВключитьПланРасходовВБДДС
	               |			ИЛИ НЕ упоСохранениеДанныхПроектаПроектныеЗадачи.ВключитьТрудРесурсыВПланРасходов)) КАК ПроектныеЗадачиТРНеВБДДС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &Версия
	               |					И НЕ Регистратор = &Ссылка) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО ПроектныеЗадачиТРНеВБДДС.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И (упоСвойстваПроектныхЗадачСрезПоследних.ВключитьПланРасходовВБДДС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Версия КАК Версия,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.СтатьяДДС КАК СтатьяДДС,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.НаправлениеДвижения КАК НаправлениеДвижения,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Контрагент КАК Контрагент,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Договор КАК Договор,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ДатаДвижения КАК ДатаДвижения,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.Валюта КАК Валюта,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	               |	упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних.ВидПлатежа КАК ВидПлатежа,
	               |	0 КАК Сумма,
	               |	0 КАК СуммаВалютная
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДвиженийДенежныхСредств.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДДС.Трудозатраты)
	               |				И ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВБДДС.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВБДДС КАК втПроектныеЗадачиУдалитьТрансляциюТРВБДДС)) КАК упоАктуальныеПланыДвиженийДенежныхСредствСрезПоследних";
	
	Запрос.УстановитьПараметр("Версия", ЭтотОбъект.Версия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ДанныеДвиженийФинансов.упоАктуальныеПланыДвиженийДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьМассивыИзмененныхЗадач()
	
	Если ДополнительныеСвойства.Свойство("СписокНовыхЗадач") 
		И НЕ ДополнительныеСвойства.СписокНовыхЗадач.Количество() = 0 Тогда
		СписокНовыхЗадач = ДополнительныеСвойства.СписокНовыхЗадач;
	Иначе
		СписокНовыхЗадач = Неопределено
	КонецЕсли;
	
	//
	
	// При программном создании документа данное доп. свойство может быть заполнено. Например,
	// при изменении трансляции доп. затрат.
	Если Не ДополнительныеСвойства.Свойство("МассивЗадачТрансляции") Тогда
		ДополнительныеСвойства.Вставить("МассивЗадачТрансляции", Новый Массив);
	КонецЕсли;
	
	Если ПерезаписатьВключитьМатРесурсыВПланРасходов Или ПерезаписатьВключитьСубпродуктыВПланДоходов
		Или ПерезаписатьВключитьТрудРесурсыВПланРасходов
		Или ПерезаписатьВключитьПланДоходовВБДДС Или ПерезаписатьСхемаОплатыПоУмолчаниюДоходы
		Или ПерезаписатьВключитьПланРасходовВБДДС Или ПерезаписатьСхемаОплатыПоУмолчаниюРасходы Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачТрансляции,
			ПроектныеЗадачи.ВыгрузитьКолонку("ПроектнаяЗадача"));
		
	КонецЕсли;
	
	Если ПерезаписатьМатериальныеРесурсы Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачТрансляции,
			МатериальныеРесурсы.ВыгрузитьКолонку("ПроектнаяЗадача"), Истина);
			
	КонецЕсли;
	
	Если ПерезаписатьСубпродукты Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачТрансляции,
			Субпродукты.ВыгрузитьКолонку("ПроектнаяЗадача"), Истина);
			
	КонецЕсли;
	
	Если ПерезаписатьПланДоходов Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачТрансляции,
			ПланДоходов.ВыгрузитьКолонку("ПроектнаяЗадача"), Истина);
			
	КонецЕсли;
	
	Если ПерезаписатьПланРасходов Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачТрансляции,
			ПланРасходов.ВыгрузитьКолонку("ПроектнаяЗадача"), Истина);
			
	КонецЕсли;
	
	Если ПерезаписатьДвиженияДенежныхСредств Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачТрансляции,
			ДвиженияДенежныхСредств.ВыгрузитьКолонку("ПроектнаяЗадача"), Истина);
			
	КонецЕсли;
	
	// Задачи, которые будут транслироваться, исключаются из задач, которые актуализируются по срокам,
	// т.к. актуализация происходит при трансляции.
	
	МассивЗадачСИзмененнымиСроками = Сроки.ВыгрузитьКолонку("ПроектнаяЗадача");
	
	ДополнительныеСвойства.Вставить("МассивЗадачАктуализацииПоСрокам", Новый Массив);
	Если ДополнительныеСвойства.МассивЗадачТрансляции.Количество() > 0 Тогда
		Для Каждого Задача Из МассивЗадачСИзмененнымиСроками Цикл
			Если ДополнительныеСвойства.МассивЗадачТрансляции.Найти(Задача) = Неопределено Тогда
				ДополнительныеСвойства.МассивЗадачАктуализацииПоСрокам.Добавить(Задача);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ДополнительныеСвойства.МассивЗадачАктуализацииПоСрокам = МассивЗадачСИзмененнымиСроками;
	КонецЕсли;
	
	//
	
	ДополнительныеСвойства.Вставить("МассивЗадачСИзмененнымиНормами", Новый Массив);
	Если ПерезаписатьНормуСтоимостиТрудовыхРесурсов Тогда
		ДополнительныеСвойства.МассивЗадачСИзмененнымиНормами = ПроектныеЗадачи.ВыгрузитьКолонку("ПроектнаяЗадача");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МассивЗадачСИзмененнымиРолями", Новый Массив);
	Если ПерезаписатьТрудовыеРесурсыРоли Тогда
		МассивЗадачСИзмененнымиРолями = ТрудовыеРесурсыРоли.ВыгрузитьКолонку("ПроектнаяЗадача");
		ДополнительныеСвойства.МассивЗадачСИзмененнымиРолями = 
			ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗадачСИзмененнымиРолями);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МассивЗадачСИзмененнымиНазначеннымиТР", Новый Массив);
	Если ПерезаписатьНазначенныеТрудовыеРесурсы Тогда
		МассивЗадачСИзмененнымиНазначеннымиТР = НазначенныеТрудовыеРесурсы.ВыгрузитьКолонку("ПроектнаяЗадача");
		ДополнительныеСвойства.МассивЗадачСИзмененнымиНазначеннымиТР = 
			ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗадачСИзмененнымиНазначеннымиТР);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МассивЗадачТрансляцииТР", Новый Массив);
	Если ПерезаписатьВключитьТрудРесурсыВПланРасходов
		Или ПерезаписатьВключитьПланРасходовВБДДС 
		Или ПерезаписатьСхемаОплатыПоУмолчаниюРасходы Тогда
		ДополнительныеСвойства.Вставить("МассивЗадачТрансляцииТР", ПроектныеЗадачи.ВыгрузитьКолонку("ПроектнаяЗадача"));
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("МассивЗадачСИзмененнымиТрудозатратами", Новый Массив);
	ДополнитьМассивСИсключениями(ДополнительныеСвойства.МассивЗадачСИзмененнымиТрудозатратами,
		МассивЗадачСИзмененнымиСроками, СписокНовыхЗадач);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачСИзмененнымиТрудозатратами,
		ДополнительныеСвойства.МассивЗадачСИзмененнымиНазначеннымиТР, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеСвойства.МассивЗадачСИзмененнымиТрудозатратами,
		ДополнительныеСвойства.МассивЗадачСИзмененнымиРолями, Истина);
	ДополнитьМассивСИсключениями(ДополнительныеСвойства.МассивЗадачСИзмененнымиТрудозатратами,
		ДополнительныеСвойства.МассивЗадачСИзмененнымиНормами, СписокНовыхЗадач);
	ДополнитьМассивСИсключениями(ДополнительныеСвойства.МассивЗадачСИзмененнымиТрудозатратами,
		ДополнительныеСвойства.МассивЗадачТрансляцииТР, СписокНовыхЗадач);
	
КонецПроцедуры

Процедура ОбновитьСвязанныеПроекты()
	
	ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов =
		Константы.упоАвтоматическийРасчетСроковСвязанныхПроектов.Получить();
	Если Не ИспользоватьАвтоматическийРасчетСроковСвязанныхПроектов Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сроки) Тогда
		Возврат;
	КонецЕсли;
	
	ПроектныеЗадачиСНовымиСроками = Сроки.ВыгрузитьКолонку("ПроектнаяЗадача");
	упоРасчетКалендарныхСроковРедакция3Сервер.ПриИзмененииСроковЗадачНеобходимоПересчитатьПроекты(
		ПроектныеЗадачиСНовымиСроками);
	
КонецПроцедуры

Функция ПараметрыЗаполненияНовойЗадачи()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПланироватьТрудозатратыНаИсполнителей", Истина);
	СтруктураПараметры.Вставить("Объект", Неопределено);
	
	ПроектныеОпции = упоАналитикаПоПодразделениямСервер.ЗаполнитьПараметрыУчетаПоПодразделениям(Проект);
	СтруктураПараметры.Вставить("НормаСтоимости", Константы.упоНормаСтоимостиПоУмолчанию.Получить());
	СтруктураПараметры.Вставить("НормаСтоимостиОбъемы");
	СтруктураПараметры.Вставить("НормаСтоимостиТрудовыхРесурсов", ПроектныеОпции.НормаСтоимостиТрудовыхРесурсов);
	СтруктураПараметры.Вставить("ВнешняяНормаСтоимостиТрудовыхРесурсов", ПроектныеОпции.ВнешняяНормаСтоимостиТрудовыхРесурсов);
	
	Реквизиты = Новый Структура("ВключитьСубпродуктыВПланДоходов, ВключитьМатРесурсыВПланРасходов, 
			|ВключитьТрудРесурсыВПланРасходов, ВключитьПланРасходовВБДДС, ВключитьПланДоходовВБДДС",
			"ВключитьСубпродуктыВПланДоходов", "ВключитьМатРесурсыВПланРасходов", "ВключитьТрудРесурсыВПланРасходов",
			"упоВключитьПланРасходовВБДДС", "упоВключитьПланДоходовВБДДС", "упоТипСубпродукта");
	РеквизитыПроекта = упоФункцииБСП.ЗначенияРеквизитовОбъектаВызовСервера(Проект, Реквизиты);
	
	Для Каждого КлючЗначение Из РеквизитыПроекта Цикл
		СтруктураПараметры.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат СтруктураПараметры;
	
КонецФункции

Процедура ЗаполнитьРесурсВыводитьВСводныйСтатусОтчет(НайденыТекущиеСвойства, Движение, СтрокаТекущиеСвойства)
	
	ТипПроектнойЗадачи = упоПроектыИЗадачиСервер.ПолучитьТипПроектнойЗадачи(Движение);
	
	Если Не НайденыТекущиеСвойства Тогда		
		упоПроектыИЗадачиСервер.ЗаполнитьРеквизитВыводитьВСводныйСтатусОтчет(ТипПроектнойЗадачи, Движение);		
		Возврат;		
	КонецЕсли;
	
	ТипПроектнойЗадачиВРегистре = упоПроектыИЗадачиСервер.ПолучитьТипПроектнойЗадачи(СтрокаТекущиеСвойства);
	
	Если ТипПроектнойЗадачи <> ТипПроектнойЗадачиВРегистре Тогда		
		упоПроектыИЗадачиСервер.ЗаполнитьРеквизитВыводитьВСводныйСтатусОтчет(ТипПроектнойЗадачи, Движение);		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьДвижения_упоКодыСДР()
	
	Если НЕ ПерезаписатьКодыСДР Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если КодыСДР.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КодыСДР", КодыСДР);
		Запрос.УстановитьПараметр("Версия", ЭтотОбъект.Версия);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	КодыСДР.КодСДР КАК КодСДР,
		               |	КодыСДР.ПроектнаяЗадача КАК ПроектнаяЗадача
		               |ПОМЕСТИТЬ вт
		               |ИЗ
		               |	&КодыСДР КАК КодыСДР
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Проекты.Ссылка КАК ПроектнаяЗадача,
		               |	вт.КодСДР КАК КодСДР,
		               |	&Версия КАК Версия,
		               |	&Дата КАК Период,
		               |	&Ссылка КАК Регистратор,
		               |	ИСТИНА КАК Активность
		               |ИЗ
		               |	вт КАК вт
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		               |		ПО вт.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу";
		
		Движения.упоКодыСДР.Загрузить(Запрос.Выполнить().Выгрузить());
		
	Иначе
		
		Для Каждого СтрокаТЧ Из ПроектныеЗадачи Цикл
			
			Движение = Движения.упоКодыСДР.Добавить();
			
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
			ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Движение);
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		// Проведение в привилегированном режиме.
		Запрос.Текст = "ВЫБРАТЬ
		               |	Проекты.КодСДР,
		               |	Проекты.Ссылка КАК ПроектнаяЗадача
		               |ИЗ
		               |	Документ.упоСохранениеДанныхПроекта.ПроектныеЗадачи КАК упоСохранениеДанныхПроектаПроектныеЗадачи
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		               |		ПО упоСохранениеДанныхПроектаПроектныеЗадачи.ПроектнаяЗадача = Проекты.СсылкаНаПроектнуюЗадачу
		               |ГДЕ
		               |	упоСохранениеДанныхПроектаПроектныеЗадачи.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.упоКодыСДР.Добавить();
			
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Движение);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецФункции 

Функция СформироватьДвижения_упоСвойстваПроектов()
	
	Если НЕ ПерезаписатьДатуСтартаПроекта Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Движение = Движения.упоСвойстваПроектов.Добавить();
	Движение.Проект = Проект;
	Движение.ДатаСтарта = ДатаСтартаПроекта;
	ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Движение);

КонецФункции 

Функция СформироватьДвижения_упоПрогнозныеСрокиПроектныхЗадач()
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект["ПерезаписатьПрогнозныеСрокиПроектныхЗадач"] Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьДвиженияПоТаблице(ЭтотОбъект["ПрогнозныеСрокиПроектныхЗадач"], Движения.упоПрогнозныеСрокиПроектныхЗадач);
	
КонецФункции 

Функция СформироватьДвижения_упоПрогнозныеСрокиПроектов()
	
	Если упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект["ПерезаписатьПрогнозныеСрокиПроекта"] Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Движение = Движения.упоПрогнозныеСрокиПроектов.Добавить();
	Движение.Проект = Проект;
	Движение.ДатаНачалаПрогноз = ЭтотОбъект["ДатаНачалаПрогноз"];
	Движение.ДатаЗавершенияПрогноз = ЭтотОбъект["ДатаЗавершенияПрогноз"];
	Движение.СтатусСроков = ЭтотОбъект["СтатусСроков"];
	
	ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Движение);

КонецФункции 

Функция СформироватьДвижения_ПроцентыГотовности(Отказ, РежимПроведения)
	
	Если НЕ ПерезаписатьПроцентГотовности Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьДвиженияПоТаблице(ПроцентыГотовности, Движения.упоПроцентыГотовностиПроектныхЗадач);
	
КонецФункции 

Функция СформироватьДвижения_Сроки()
	
	Если Не ПерезаписатьСрокиПроекта Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьДвиженияПоТаблице(Сроки, Движения.упоСрокиПроектныхЗадач);
	ЗаполнитьДвиженияПоТаблице(РасчетныеСроки, Движения.упоРасчетныеСрокиПроектныхЗадач);
	ЗаполнитьДвиженияПоТаблице(ФактическиеСроки, Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач);
	
КонецФункции 

Функция СформироватьДвижение_упоПредусловияПроектныхЗадач()
	
	ЗаполнитьДвиженияПоТаблице(Связи, Движения.упоПредусловияПроектныхЗадач);
	
КонецФункции 

Функция СформироватьДвижение_упоСтатусыПроектныхЗадач()
	
	Если Не ПерезаписатьСтатусыЗадач Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьДвиженияПоТаблице(Статусы, Движения.упоСтатусыПроектныхЗадач);
	
КонецФункции 


Функция СформироватьДвижение_упоПричиныОтклонений()
	
	Если НЕ ПерезаписатьПричиныОтклонений Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьДвиженияПоТаблице(ПричиныОтклонений, Движения.упоПричиныОтклонений);
	
КонецФункции

Функция СформироватьДвижения_упоДанныеПлановТрудозатратРолей() 
	
	Если НЕ ПерезаписатьТрудовыеРесурсыРоли Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	// Проведение в привилегированном режиме.
	Запрос.Текст = "ВЫБРАТЬ
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Ресурс КАК Ресурс,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Количество КАК Количество,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.СпособПривязки КАК СпособПривязки,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ПрофильРаспределения КАК ПрофильРаспределения,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.УровеньПланирования КАК УровеньПланирования,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Основной КАК Основной,
		|    ВЫБОР
		|        КОГДА &ВерсияРеализации >= 30
		|            ТОГДА упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Подразделение
		|        ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(упоСоставПодразделенийСрезПоследних.Подразделение, НЕОПРЕДЕЛЕНО))
		|    КОНЕЦ КАК Подразделение,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Отмена КАК Отмена,
		|    упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|    упоСвойстваПроектныхЗадачСрезПоследних.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ИзменениеРаспределения КАК ИзменениеРаспределения,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ИсточникПлана КАК ИсточникПлана
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|    Документ.упоСохранениеДанныхПроекта.ТрудовыеРесурсыРоли КАК упоСохранениеДанныхПроектаТрудовыеРесурсыРоли
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСоставПодразделений.СрезПоследних(, ) КАК упоСоставПодразделенийСрезПоследних
		|        ПО упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Ресурс = упоСоставПодразделенийСрезПоследних.Роль
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(, Версия = &Версия) КАК упоСвойстваПроектныхЗадачСрезПоследних
		|        ПО упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
		|ГДЕ
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Ссылка = &Ссылка
		|    И (упоСоставПодразделенийСрезПоследних.ВходитВСостав ЕСТЬ NULL
		|            ИЛИ упоСоставПодразделенийСрезПоследних.ВходитВСостав)
		|
		|СГРУППИРОВАТЬ ПО
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ПроектнаяЗадача,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Ресурс,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ЕдиницаНормирования,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.УровеньПланирования,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Основной,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Количество,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Подразделение,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.СпособПривязки,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ПрофильРаспределения,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.Отмена,
		|    упоСвойстваПроектныхЗадачСрезПоследних.НормаСтоимостиТрудовыхРесурсов,
		|    упоСвойстваПроектныхЗадачСрезПоследних.ВнешняяНормаСтоимостиТрудовыхРесурсов,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ИзменениеРаспределения,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ИндексСтрокРаспределенияПоПериодам,
		|    упоСохранениеДанныхПроектаТрудовыеРесурсыРоли.ИсточникПлана
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ДанныеДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ДанныеДокумента.Ресурс КАК Ресурс,
		|    ДанныеДокумента.Количество КАК Количество,
		|    ДанныеДокумента.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    ДанныеДокумента.УровеньПланирования КАК УровеньПланирования,
		|    ДанныеДокумента.Основной КАК Основной,
		|    ДанныеДокумента.Подразделение КАК Подразделение,
		|    ДанныеДокумента.Отмена КАК Отмена,
		|    ДанныеДокумента.СпособПривязки КАК СпособПривязки,
		|    ДанныеДокумента.ПрофильРаспределения КАК ПрофильРаспределения,
		|    ДанныеДокумента.НормаСтоимостиТрудовыхРесурсов КАК НормаСтоимостиТрудовыхРесурсов,
		|    ДанныеДокумента.ВнешняяНормаСтоимостиТрудовыхРесурсов КАК ВнешняяНормаСтоимостиТрудовыхРесурсов,
		|    ДанныеДокумента.ЕдиницаНормирования.Коэффициент КАК КоэффициентЕдИзмерения,
		|    ВЫБОР
		|        КОГДА упоНормыСтоимостиРесурсовСрезПоследних.Норма ЕСТЬ NULL
		|            ТОГДА 0
		|        КОГДА ВЫРАЗИТЬ(упоНормыСтоимостиРесурсовСрезПоследних.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени).Коэффициент = 0
		|            ТОГДА 0
		|        ИНАЧЕ упоНормыСтоимостиРесурсовСрезПоследних.ЕдСтоимость / ВЫРАЗИТЬ(упоНормыСтоимостиРесурсовСрезПоследних.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени).Коэффициент
		|    КОНЕЦ КАК СтоимостьЧаса,
		|    ВЫБОР
		|        КОГДА упоНормыСтоимостиРесурсовСрезПоследнихВнешн.Норма ЕСТЬ NULL
		|            ТОГДА 0
		|        КОГДА ВЫРАЗИТЬ(упоНормыСтоимостиРесурсовСрезПоследнихВнешн.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени).Коэффициент = 0
		|            ТОГДА 0
		|        ИНАЧЕ упоНормыСтоимостиРесурсовСрезПоследнихВнешн.ЕдСтоимость / ВЫРАЗИТЬ(упоНормыСтоимостиРесурсовСрезПоследнихВнешн.ЕдиницаНормирования КАК Справочник.упоЕдиницыВремени).Коэффициент
		|    КОНЕЦ КАК СтоимостьЧасаВнешн,
		|    ДанныеДокумента.Количество * ДанныеДокумента.ЕдиницаНормирования.Коэффициент КАК КоличествоВЧасах,
		|    ДанныеДокумента.ИзменениеРаспределения КАК ИзменениеРаспределения,
		|    ДанныеДокумента.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
		|    ДанныеДокумента.ИсточникПлана КАК ИсточникПлана
		|ПОМЕСТИТЬ ДанныеДокументаСоСтоимостями
		|ИЗ
		|    ДанныеДокумента КАК ДанныеДокумента
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних КАК упоНормыСтоимостиРесурсовСрезПоследних
		|        ПО ДанныеДокумента.Ресурс = упоНормыСтоимостиРесурсовСрезПоследних.Ресурс
		|            И ДанныеДокумента.НормаСтоимостиТрудовыхРесурсов = упоНормыСтоимостиРесурсовСрезПоследних.Норма
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоНормыСтоимостиРесурсов.СрезПоследних КАК упоНормыСтоимостиРесурсовСрезПоследнихВнешн
		|        ПО ДанныеДокумента.Ресурс = упоНормыСтоимостиРесурсовСрезПоследнихВнешн.Ресурс
		|            И ДанныеДокумента.ВнешняяНормаСтоимостиТрудовыхРесурсов = упоНормыСтоимостиРесурсовСрезПоследнихВнешн.Норма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|    ДанныеДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ДанныеДокумента.Ресурс КАК Ресурс,
		|    ДанныеДокумента.УровеньПланирования КАК УровеньПланирования,
		|    ДанныеДокумента.ИсточникПлана КАК ИсточникПлана
		|ПОМЕСТИТЬ втПроектныеЗадачи
		|ИЗ
		|    ДанныеДокумента КАК ДанныеДокумента
		|
		|ИНДЕКСИРОВАТЬ ПО
		|    ПроектнаяЗадача,
		|    Ресурс,
		|    УровеньПланирования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Ресурс,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.СпособПривязки КАК СпособПривязки,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования КАК УровеньПланирования,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Количество КАК Количество,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент КАК КоэффициентЕдИзмерения,
		|    ВЫБОР
		|        КОГДА упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент = 0
		|            ТОГДА 0
		|        ИНАЧЕ упоДанныеПлановТрудозатратРолейСрезПоследних.Количество * упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент
		|    КОНЕЦ КАК КоличествоЧасов,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость КАК Стоимость,
		|    ВЫБОР
		|        КОГДА упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент = 0
		|            ТОГДА 0
		|        ИНАЧЕ упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость / упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент
		|    КОНЕЦ КАК СтоимостьЧаса,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость КАК Стоимость1,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщСтоимость КАК ОбщСтоимость,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.Основной КАК Основной,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ВнешняяСтоимость КАК ВнешняяСтоимость,
		|    ВЫБОР
		|        КОГДА упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент = 0
		|            ТОГДА 0
		|        ИНАЧЕ упоДанныеПлановТрудозатратРолейСрезПоследних.ВнешняяСтоимость / упоДанныеПлановТрудозатратРолейСрезПоследних.ЕдиницаНормирования.Коэффициент
		|    КОНЕЦ КАК СтоимостьЧасаВнешняя,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ОбщВнешняяСтоимость КАК ОбщВнешняяСтоимость,
		|    упоДанныеПлановТрудозатратРолейСрезПоследних.ИсточникПлана КАК ИсточникПлана
		|ПОМЕСТИТЬ ДанныеРегистра
		|ИЗ
		|    РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
		|            ,
		|            Версия = &Версия
		|                И (ПроектнаяЗадача, Ресурс, УровеньПланирования) В
		|                    (ВЫБРАТЬ
		|                        втПроектныеЗадачи.ПроектнаяЗадача,
		|                        втПроектныеЗадачи.Ресурс,
		|                        втПроектныеЗадачи.УровеньПланирования
		|                    ИЗ
		|                        втПроектныеЗадачи КАК втПроектныеЗадачи)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
		|ГДЕ
		|    (упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
		|            ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость <> 0
		|            ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ВнешняяСтоимость <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    ДанныеДокументаСоСтоимостями.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|    ДанныеДокументаСоСтоимостями.Ресурс КАК Ресурс,
		|    ВЫБОР
		|        КОГДА ДанныеДокументаСоСтоимостями.Отмена
		|            ТОГДА 0
		|        ИНАЧЕ ДанныеДокументаСоСтоимостями.Количество
		|    КОНЕЦ КАК Количество,
		|    ДанныеДокументаСоСтоимостями.ЕдиницаНормирования КАК ЕдиницаНормирования,
		|    ДанныеДокументаСоСтоимостями.УровеньПланирования КАК УровеньПланирования,
		|    ВЫБОР
		|        КОГДА ДанныеДокументаСоСтоимостями.Отмена
		|            ТОГДА 0
		|        КОГДА ДанныеРегистра.СтоимостьЧаса ЕСТЬ NULL
		|                ИЛИ ДанныеРегистра.СтоимостьЧаса = 0
		|            ТОГДА ДанныеДокументаСоСтоимостями.СтоимостьЧаса * ДанныеДокументаСоСтоимостями.КоэффициентЕдИзмерения
		|        ИНАЧЕ ДанныеРегистра.СтоимостьЧаса * ДанныеДокументаСоСтоимостями.КоэффициентЕдИзмерения
		|    КОНЕЦ КАК Стоимость,
		|    ВЫБОР
		|        КОГДА ДанныеДокументаСоСтоимостями.Отмена
		|            ТОГДА 0
		|        КОГДА ДанныеРегистра.СтоимостьЧаса ЕСТЬ NULL
		|                ИЛИ ДанныеРегистра.СтоимостьЧаса = 0
		|            ТОГДА ДанныеДокументаСоСтоимостями.СтоимостьЧаса
		|        ИНАЧЕ ДанныеРегистра.СтоимостьЧаса
		|    КОНЕЦ * ДанныеДокументаСоСтоимостями.КоличествоВЧасах КАК ОбщСтоимость,
		|    ДанныеДокументаСоСтоимостями.Основной КАК Основной,
		|    ВЫБОР
		|        КОГДА &ВерсияРеализации >= 32
		|            ТОГДА ДанныеДокументаСоСтоимостями.СпособПривязки
		|        ИНАЧЕ &СпособПривязкиПоПрофилю
		|    КОНЕЦ КАК СпособПривязки,
		|    ВЫБОР
		|        КОГДА &ВерсияРеализации >= 32
		|            ТОГДА ДанныеДокументаСоСтоимостями.ПрофильРаспределения
		|        ИНАЧЕ ЕСТЬNULL(ДанныеРегистра.ПрофильРаспределения, &ПрофильРаспределенияПоУмолчанию)
		|    КОНЕЦ КАК ПрофильРаспределения,
		|    ВЫБОР
		|        КОГДА &ВерсияРеализации >= 30
		|            ТОГДА ДанныеДокументаСоСтоимостями.Подразделение
		|        ИНАЧЕ ЕСТЬNULL(ДанныеРегистра.Подразделение, ДанныеДокументаСоСтоимостями.Подразделение)
		|    КОНЕЦ КАК Подразделение,
		|    ДанныеДокументаСоСтоимостями.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределения,
		|    ВЫБОР
		|        КОГДА ДанныеДокументаСоСтоимостями.Отмена
		|            ТОГДА 0
		|        КОГДА ДанныеРегистра.СтоимостьЧасаВнешняя ЕСТЬ NULL
		|                ИЛИ ДанныеРегистра.СтоимостьЧасаВнешняя = 0
		|            ТОГДА ДанныеДокументаСоСтоимостями.СтоимостьЧасаВнешн
		|        ИНАЧЕ ДанныеРегистра.СтоимостьЧасаВнешняя
		|    КОНЕЦ * ДанныеДокументаСоСтоимостями.КоэффициентЕдИзмерения КАК ВнешняяСтоимость,
		|    ВЫБОР
		|        КОГДА ДанныеДокументаСоСтоимостями.Отмена
		|            ТОГДА 0
		|        КОГДА ДанныеРегистра.СтоимостьЧасаВнешняя ЕСТЬ NULL
		|                ИЛИ ДанныеРегистра.СтоимостьЧасаВнешняя = 0
		|            ТОГДА ДанныеДокументаСоСтоимостями.СтоимостьЧасаВнешн
		|        ИНАЧЕ ДанныеРегистра.СтоимостьЧасаВнешняя
		|    КОНЕЦ * ДанныеДокументаСоСтоимостями.КоличествоВЧасах КАК ОбщВнешняяСтоимость,
		|    ДанныеДокументаСоСтоимостями.ИзменениеРаспределения
		|        ИЛИ ДанныеДокументаСоСтоимостями.Отмена КАК ИзменениеРаспределения,
		|    ДанныеДокументаСоСтоимостями.ИсточникПлана КАК ИсточникПлана
		|ИЗ
		|    ДанныеДокументаСоСтоимостями КАК ДанныеДокументаСоСтоимостями
		|        ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
		|        ПО (ДанныеРегистра.ПроектнаяЗадача = ДанныеДокументаСоСтоимостями.ПроектнаяЗадача)
		|            И (ДанныеРегистра.Ресурс = ДанныеДокументаСоСтоимостями.Ресурс)
		|            И (ДанныеРегистра.УровеньПланирования = ДанныеДокументаСоСтоимостями.УровеньПланирования)
		|            И (ДанныеРегистра.ИсточникПлана = ДанныеДокументаСоСтоимостями.ИсточникПлана)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Версия", ЭтотОбъект.Версия);
	Запрос.УстановитьПараметр("ВерсияРеализации", ВерсияРеализации);
	Запрос.УстановитьПараметр("СпособПривязкиПоПрофилю", 
		Перечисления.упоСпособПривязкиРаспределения.ПоПрофилюРаспределения);
	Запрос.УстановитьПараметр("ПрофильРаспределенияПоУмолчанию", 
		Справочники.упоПрофилиРаспределенияТрудозатрат.РавномерноеРаспределение);
	
	ТаблицаТрудовыеРесурсыРоли = Запрос.Выполнить().Выгрузить();
	
	Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Очистить();
	ТаблицаТрудовыеРесурсыРолиПоПериодам = ТрудовыеРесурсыРолиПоПериодам.Выгрузить();
	ТаблицаТрудовыеРесурсыРолиПоПериодам.Индексы.Добавить("ПроектнаяЗадача, Ресурс, УровеньПланирования");
	СтрокаОтбора = Новый Структура("ПроектнаяЗадача, Ресурс, УровеньПланирования");
	Для Каждого СтрокаТрудовыеРесурсыРоли Из ТаблицаТрудовыеРесурсыРоли Цикл
		
		Если НЕ СтрокаТрудовыеРесурсыРоли.ИзменениеРаспределения Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаОтбора, СтрокаТрудовыеРесурсыРоли);
		СтрокиРаспределения = ТаблицаТрудовыеРесурсыРолиПоПериодам.НайтиСтроки(СтрокаОтбора);
		Для Каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
			НоваяЗапись = Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам.Добавить();
			НоваяЗапись.ИндексСтрокиРаспределениеПоРолям = СтрокаТрудовыеРесурсыРоли.ИндексСтрокРаспределения;
			НоваяЗапись.ПроектнаяЗадача = СтрокаТрудовыеРесурсыРоли.ПроектнаяЗадача;
			НоваяЗапись.ПериодРаспределения = СтрокаРаспределения.Период;
			НоваяЗапись.Количество = СтрокаРаспределения.Количество;
			ЗаполнитьСтандартныеПараметрыДляЗаписиРС(НоваяЗапись);
		КонецЦикла;
		
	КонецЦикла;
	
	//
	
	Движения.упоДанныеПлановТрудозатратРолей.Загрузить(ТаблицаТрудовыеРесурсыРоли);
	Для Каждого Запись Из Движения.упоДанныеПлановТрудозатратРолей Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
	КонецЦикла;
	
	//
	ТаблицаРольПроектнаяЗадачаУровеньПланирования = СформироватьТаблицуОтбораЗануления_упоДанныеПлановТрудозатратРолей(
		ТаблицаТрудовыеРесурсыРоли);
	
	ДанныеАктуализацииРегистра = Новый Структура;
	ДанныеАктуализацииРегистра.Вставить("ИмяРегистра", 	"упоДанныеПлановТрудозатратРолей");
	ДанныеАктуализацииРегистра.Вставить("Регистратор", 	Ссылка);
	ДанныеАктуализацииРегистра.Вставить("Период", 		Дата);
	ДанныеАктуализацииРегистра.Вставить("МассивЗадач", 	ДополнительныеСвойства.МассивЗадачСИзмененнымиРолями);
	
	ДопПараметрыАктуализацииРегистра = Новый Структура;
	ДопПараметрыАктуализацииРегистра.Вставить("ТаблицаОтбора", ТаблицаРольПроектнаяЗадачаУровеньПланирования);
	ДопПараметрыАктуализацииРегистра.Вставить("Версия", ЭтотОбъект.Версия);
	
	ДопОтбор = "Версия = &Версия";
	
	ДопОтборСоединение = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбора КАК ТаблицаОтбора
	|ПО Регистр.УровеньПланирования = ТаблицаОтбора.УровеньПланирования
	| И Регистр.ПроектнаяЗадача = ТаблицаОтбора.ПроектнаяЗадача
	| И Регистр.Ресурс = ТаблицаОтбора.Ресурс
	| И Регистр.ИсточникПлана = ТаблицаОтбора.ИсточникПлана";
	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(
		Движения.упоДанныеПлановТрудозатратРолей, 
		ДанныеАктуализацииРегистра,
		,
		,
		ДопОтбор,ДопПараметрыАктуализацииРегистра, 
		Ложь,
		ДопОтборСоединение);
	
	//
	СтрокаСвертки = "ПроектнаяЗадача, ИндексСтрокРаспределения";
	ТаблицаДляАктуализацииРаспределения = ТаблицаТрудовыеРесурсыРоли.Скопировать(
		Новый Структура("ИзменениеРаспределения", Истина), 
		СтрокаСвертки);
	ТаблицаДляАктуализацииРаспределения.Свернуть(СтрокаСвертки);
	
	МассивЗадач = ТаблицаДляАктуализацииРаспределения.ВыгрузитьКолонку("ПроектнаяЗадача");

	ДопПараметрыАктуализацииРегистра = Новый Структура;
	ДопПараметрыАктуализацииРегистра.Вставить("ТаблицаОтбора", ТаблицаДляАктуализацииРаспределения);
	ДопПараметрыАктуализацииРегистра.Вставить("Версия", ЭтотОбъект.Версия);
	
	ДопОтбор = "Версия = &Версия";
	
	ДопОтборСоединение = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбора КАК ТаблицаОтбора
	|ПО Регистр.ПроектнаяЗадача = ТаблицаОтбора.ПроектнаяЗадача
	| И Регистр.ИндексСтрокиРаспределениеПоРолям = ТаблицаОтбора.ИндексСтрокРаспределения";
	
	ДанныеАктуализацииРегистра.МассивЗадач = МассивЗадач;
	ДанныеАктуализацииРегистра.ИмяРегистра = "упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам";
	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(
		Движения.упоДанныеРаспределенияПланаТрудозатратРолейПоПериодам, 
		ДанныеАктуализацииРегистра,
		,
		, 
		ДопОтбор, 
		ДопПараметрыАктуализацииРегистра, 
		Ложь,
		ДопОтборСоединение);
	
КонецФункции

Функция СформироватьТаблицуОтбораЗануления_упоДанныеПлановТрудозатратРолей(ТаблицаТрудовыеРесурсыРоли)
	
	// Отбор по источнику плана необходим при добавлении идентичной строки трудозатрат вручную.
	СтрокаСвертки = "УровеньПланирования, ПроектнаяЗадача, Ресурс, ИсточникПлана";
	ТаблицаРольПроектнаяЗадачаУровеньПланирования = ТаблицаТрудовыеРесурсыРоли.Скопировать(, СтрокаСвертки);
	ТаблицаРольПроектнаяЗадачаУровеньПланирования.Свернуть(СтрокаСвертки);
	
	// В исторических данных могут оставаться строки с незаполненным источником плана. 
	// Такие строки необходимо добавить в отбор зануления, если идет движение по строке с источником плана = Трудозатраты.
	Сч = ТаблицаРольПроектнаяЗадачаУровеньПланирования.Количество() - 1;
	Пока Сч >= 0 Цикл
		
		СтрокаТаблицы = ТаблицаРольПроектнаяЗадачаУровеньПланирования[Сч];
		Сч = Сч - 1;

		Если СтрокаТаблицы.ИсточникПлана <> Перечисления.упоИсточникПланаТрудозатратРолей.Трудозатраты Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаРольПроектнаяЗадачаУровеньПланирования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , "ИсточникПлана");
		// Здесь ИсточникПлана = Неопределено (нюансы таблиц значений, выгруженных из результата запроса).
		// В явном виде присвоим пустую ссылку, иначе не сработают отборы по базе.
		НоваяСтрока.ИсточникПлана = Перечисления.упоИсточникПланаТрудозатратРолей.ПустаяСсылка();
		
	КонецЦикла;
	
	Возврат ТаблицаРольПроектнаяЗадачаУровеньПланирования;
	
КонецФункции

Функция СформироватьДвижения_упоВыделенныеТрудовыеРесурсы()
	
	Если НЕ ПерезаписатьНазначенныеТрудовыеРесурсы Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Версия", ЭтотОбъект.Версия);
	Запрос.УстановитьПараметр("ВерсияРеализации", ВерсияРеализации);
	Запрос.УстановитьПараметр("УровеньПланированияПоУмолчанию", Перечисления.упоУровеньПланирования.Окончательный);
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.Подразделение КАК Подразделение,
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.Роль КАК Роль,
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.Отмена КАК Отмена,
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.ВариантРаспределения КАК ВариантРаспределения,
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.ДоляТрудозатратПоУровнюПланирования КАК ДоляТрудозатратПоУровнюПланирования,
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.ДоляТрудозатрат КАК ДоляТрудозатрат
	               |ПОМЕСТИТЬ ДанныеДокумента
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.НазначенныеТрудовыеРесурсы КАК упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаНазначенныеТрудовыеРесурсы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Ресурс КАК Роль,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.Подразделение КАК Подразделение,
	               |	упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования КАК УровеньПланирования,
	               |	ВЫБОР
	               |		КОГДА упоДанныеПлановТрудозатратРолейСрезПоследних.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Окончательный)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИндексУровеньПланирования
	               |ПОМЕСТИТЬ ВТ_Роли_ПЗ
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановТрудозатратРолей.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И (Ресурс, ПроектнаяЗадача) В
	               |					(ВЫБРАТЬ
	               |						ВТ.Роль,
	               |						ВТ.ПроектнаяЗадача
	               |					ИЗ
	               |						ДанныеДокумента КАК ВТ)) КАК упоДанныеПлановТрудозатратРолейСрезПоследних
	               |ГДЕ
	               |	(упоДанныеПлановТрудозатратРолейСрезПоследних.Количество <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.Стоимость <> 0
	               |			ИЛИ упоДанныеПлановТрудозатратРолейСрезПоследних.ВнешняяСтоимость <> 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Роли_ПЗ.Роль КАК Роль,
	               |	ВТ_Роли_ПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	МАКСИМУМ(ВТ_Роли_ПЗ.ИндексУровеньПланирования) КАК ИндексУровеньПланирования
	               |ПОМЕСТИТЬ ВТ_Роли_Максимум
	               |ИЗ
	               |	ВТ_Роли_ПЗ КАК ВТ_Роли_ПЗ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Роли_ПЗ.ПроектнаяЗадача,
	               |	ВТ_Роли_ПЗ.Роль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Роли_ПЗ.Роль КАК Роль,
	               |	ВТ_Роли_ПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ВТ_Роли_ПЗ.Подразделение КАК Подразделение,
	               |	ВТ_Роли_ПЗ.УровеньПланирования КАК УровеньПланирования,
	               |	ВТ_Роли_ПЗ.ИндексУровеньПланирования КАК ИндексУровеньПланирования
	               |ПОМЕСТИТЬ ВТ_Роли
	               |ИЗ
	               |	ВТ_Роли_ПЗ КАК ВТ_Роли_ПЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Роли_Максимум КАК ВТ_Роли_Максимум
	               |		ПО ВТ_Роли_ПЗ.Роль = ВТ_Роли_Максимум.Роль
	               |			И ВТ_Роли_ПЗ.ПроектнаяЗадача = ВТ_Роли_Максимум.ПроектнаяЗадача
	               |			И ВТ_Роли_ПЗ.ИндексУровеньПланирования = ВТ_Роли_Максимум.ИндексУровеньПланирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДанныеДокумента.ТрудовойРесурс КАК ТрудовойРесурс,
	               |	ДанныеДокумента.Роль КАК Роль,
	               |	ДанныеДокумента.Отмена КАК Отмена,
	               |	ВЫБОР
	               |		КОГДА &ВерсияРеализации >= 30
	               |			ТОГДА ДанныеДокумента.Подразделение
	               |		ИНАЧЕ ВТ_Роли.Подразделение
	               |	КОНЕЦ КАК Подразделение,
	               |	ДанныеДокумента.ВариантРаспределения КАК ВариантРаспределения,
	               |	ДанныеДокумента.ДоляТрудозатрат КАК ДоляТрудозатрат,
	               |	ВЫБОР
	               |		КОГДА &ВерсияРеализации >= 32
	               |			ТОГДА ДанныеДокумента.ДоляТрудозатратПоУровнюПланирования
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_Роли.УровеньПланирования, ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный))
	               |	КОНЕЦ КАК УровеньПланирования
	               |ПОМЕСТИТЬ ДанныеДокументаСПодразделением
	               |ИЗ
	               |	ДанныеДокумента КАК ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Роли КАК ВТ_Роли
	               |		ПО ДанныеДокумента.ПроектнаяЗадача = ВТ_Роли.ПроектнаяЗадача
	               |			И ДанныеДокумента.Роль = ВТ_Роли.Роль
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Ресурс КАК Ресурс,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Проект КАК Проект,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РольРесурса КАК РольРесурса,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.Подразделение КАК Подразделение,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатрат КАК ДоляТрудозатрат,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ДоляТрудозатратПоУровнюПланирования КАК ДоляТрудозатратПоУровнюПланирования,
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.ВариантРаспределения КАК ВариантРаспределения
	               |ПОМЕСТИТЬ ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.упоВыделенныеТрудовыеРесурсы.СрезПоследних(
	               |			,
	               |			Версия = &Версия И (ПроектнаяЗадача, Ресурс) В
	               |				(ВЫБРАТЬ
	               |					ВР.ПроектнаяЗадача,
	               |					ВР.ТрудовойРесурс
	               |				ИЗ
	               |					ДанныеДокумента КАК ВР)) КАК упоВыделенныеТрудовыеРесурсыСрезПоследних
	               |ГДЕ
	               |	упоВыделенныеТрудовыеРесурсыСрезПоследних.РесурсВыделен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеДокумента.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ДанныеДокумента.ТрудовойРесурс КАК Ресурс,
	               |	ДанныеДокумента.Роль КАК РольРесурса,
	               |	ВЫБОР
	               |		КОГДА &ВерсияРеализации >= 31
	               |			ТОГДА ДанныеДокумента.ДоляТрудозатрат
	               |		ИНАЧЕ ЕСТЬNULL(ДанныеРегистра.ДоляТрудозатрат, 100)
	               |	КОНЕЦ КАК ДоляТрудозатрат,
	               |	ВЫБОР
	               |		КОГДА &ВерсияРеализации >= 31
	               |			ТОГДА ДанныеДокумента.ВариантРаспределения
	               |		ИНАЧЕ ЕСТЬNULL(ДанныеРегистра.ВариантРаспределения, ЗНАЧЕНИЕ(Перечисление.упоВариантыРаспределенияТрудозатрат.ПоДолеТрудозатрат))
	               |	КОНЕЦ КАК ВариантРаспределения,
	               |	ВЫБОР
	               |		КОГДА &ВерсияРеализации >= 32
	               |			ТОГДА ДанныеДокумента.УровеньПланирования
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ ДанныеРегистра.ДоляТрудозатратПоУровнюПланирования ЕСТЬ NULL
	               |					ТОГДА ДанныеРегистра.ДоляТрудозатратПоУровнюПланирования
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ДанныеДокумента.УровеньПланирования = ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный)
	               |							ТОГДА ЗНАЧЕНИЕ(Перечисление.упоУровеньПланирования.Предварительный)
	               |						ИНАЧЕ &УровеньПланированияПоУмолчанию
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ДоляТрудозатратПоУровнюПланирования,
	               |	ВЫБОР
	               |		КОГДА &ВерсияРеализации >= 30
	               |			ТОГДА ДанныеДокумента.Подразделение
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ДанныеДокумента.Роль = ЕСТЬNULL(ДанныеРегистра.РольРесурса, НЕОПРЕДЕЛЕНО)
	               |					ТОГДА ЕСТЬNULL(ДанныеРегистра.Подразделение, ДанныеДокумента.Подразделение)
	               |				ИНАЧЕ ДанныеДокумента.Подразделение
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА ДанныеДокумента.Отмена
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК РесурсВыделен,
	               |	ДанныеДокумента.ПроектнаяЗадача.Проект КАК Проект
	               |ИЗ
	               |	ДанныеДокументаСПодразделением КАК ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	               |		ПО (ДанныеРегистра.ПроектнаяЗадача = ДанныеДокумента.ПроектнаяЗадача)
	               |			И (ДанныеРегистра.Ресурс = ДанныеДокумента.ТрудовойРесурс)";
				   
	ТаблицаВыделенныеРесурсы = Запрос.Выполнить().Выгрузить();
	
	ТаблицаВыделенныеРесурсы.Свернуть("ПроектнаяЗадача, Ресурс, РольРесурса, ДоляТрудозатрат, ВариантРаспределения, 
									| ДоляТрудозатратПоУровнюПланирования, Подразделение, РесурсВыделен, Проект");
	
	Движения.упоВыделенныеТрудовыеРесурсы.Загрузить(ТаблицаВыделенныеРесурсы);
	
	Для Каждого Запись Из Движения.упоВыделенныеТрудовыеРесурсы Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
	КонецЦикла;
	
КонецФункции 

Процедура ДополнитьМассивСИсключениями(МассивПриемник, МассивИсточник, СписокИсключений = Неопределено) 
	
	Если СписокИсключений = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПриемник, МассивИсточник, Истина);
		
	Иначе
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			
			Если СписокИсключений.НайтиПоЗначению(Значение) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруКолонокСвертывания(ИмяТаблицы)
	
	КолонкиГруппировок = "";
	КолонкиСумм = "";
	
	Если ИмяТаблицы = "упоДанныеПлановОбъемовПодразделения" Тогда
		КолонкиГруппировок = "ПроектнаяЗадача, ВидОбъема, Подразделение, Роль, СпособПривязки, ПрофильРаспределения, ДатаНачисления, 
			|Заказ_ДоговорПодрядчика, СобствСилы_Субподряд, КонтрагентПодрядчик, ИндексСтрокиВладельца, ИндексСтрокРаспределенияПоПериодам";
		КолонкиСумм = "Сумма, СуммаВалютная, Количество";
	ИначеЕсли ИмяТаблицы = "упоДанныеПлановДоходовИРасходовПодразделения" Тогда
		КолонкиГруппировок = "ПроектнаяЗадача, ВидЭлемента, Подразделение, Роль, СпособПривязки, ПрофильРаспределения, ДатаНачисления, 
			|Заказ_ДоговорПодрядчика, СобствСилы_Субподряд, КонтрагентПодрядчик, ИндексСтрокиВладельца, ИндексСтрокРаспределенияПоПериодам,
			|ИсточникПлана";
		КолонкиСумм = "Сумма, СуммаВалютная, Количество";
	ИначеЕсли ИмяТаблицы = "упоДанныеПлановДоходовИРасходовБезПрофиля" Тогда
		КолонкиГруппировок = "ПроектнаяЗадача, ВидЭлемента, Подразделение, Роль, ДатаНачисления, Заказ_ДоговорПодрядчика,
			|СобствСилы_Субподряд, КонтрагентПодрядчик, ИндексСтрокиВладельца, ИндексСтрокРаспределенияПоПериодам,
			|ИсточникПлана";
		КолонкиСумм = "Сумма, СуммаВалютная, Количество";	
	КонецЕсли;
	
	СтруктураКолонок = Новый Структура("КолонкиГруппировок, КолонкиСумм", КолонкиГруппировок, КолонкиСумм);
	Возврат СтруктураКолонок;
	
КонецФункции

Функция СформироватьДвижения_упоДанныеПлановМатериальныхРесурсов() 

	Если НЕ ПерезаписатьМатериальныеРесурсы Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;		
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.Ресурс КАК Номенклатура,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ВидОперации КАК ВидОперации,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ЕдиницаНормирования КАК ЕдиницаИзмерения,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.Контрагент КАК Контрагент,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.Договор КАК Договор,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.СпособПривязкиПотребности КАК СпособПривязки,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ДатаЗаказа КАК ДатаЗаказа,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.СпособПривязки КАК СпособПривязкиРасхода,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ДатаПривязки КАК ДатаПривязки,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.Стоимость КАК Цена,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаМатериальныеРесурсы.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаМатериальныеРесурсы.Количество
	               |	КОНЕЦ КАК Количество,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаМатериальныеРесурсы.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаМатериальныеРесурсы.ОбщСтоимость
	               |	КОНЕЦ КАК СуммаВалютная,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.Отмена КАК Отмена
	               |ПОМЕСТИТЬ втМатериальныеРесурсы
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.МатериальныеРесурсы КАК упоСохранениеДанныхПроектаМатериальныеРесурсы
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсы.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Роль КАК Роль,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Подразделение КАК Подразделение,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.СпособПривязки КАК СпособПривязки,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ДатаПривязки КАК ДатаПривязки,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Отмена
	               |				ИЛИ втМатериальныеРесурсы.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Количество
	               |	КОНЕЦ КАК Количество,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Отмена
	               |				ИЛИ втМатериальныеРесурсы.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Сумма
	               |	КОНЕЦ КАК СуммаВалютная,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Отмена КАК Отмена,
	               |	втМатериальныеРесурсы.Валюта КАК Валюта
	               |ПОМЕСТИТЬ втМатериальныеРесурсыПоПодразделениям
	               |ИЗ
	               |	втМатериальныеРесурсы КАК втМатериальныеРесурсы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.МатериальныеРесурсыПоПодразделениям КАК упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям
	               |		ПО втМатериальныеРесурсы.ПроектнаяЗадача = упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ПроектнаяЗадача
	               |			И втМатериальныеРесурсы.ИндексСтрокРаспределения = упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.ИндексСтрокиВладельца
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПодразделениям.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втМатериальныеРесурсы.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	втМатериальныеРесурсы.Номенклатура КАК Номенклатура,
	               |	втМатериальныеРесурсы.ВидОперации КАК ВидОперации,
	               |	втМатериальныеРесурсы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	втМатериальныеРесурсы.Валюта КАК Валюта,
	               |	втМатериальныеРесурсы.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	втМатериальныеРесурсы.Контрагент КАК Контрагент,
	               |	втМатериальныеРесурсы.Договор КАК Договор,
	               |	втМатериальныеРесурсы.СпособПривязки КАК СпособПривязки,
	               |	втМатериальныеРесурсы.ДатаЗаказа КАК ДатаЗаказа,
	               |	втМатериальныеРесурсы.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
	               |	втМатериальныеРесурсы.СпособПривязкиРасхода КАК СпособПривязкиРасхода,
	               |	втМатериальныеРесурсы.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	втМатериальныеРесурсы.ДатаПривязки КАК ДатаПривязки,
	               |	втМатериальныеРесурсы.Количество КАК Количество,
	               |	втМатериальныеРесурсы.Цена КАК Цена,
	               |	втМатериальныеРесурсы.СуммаВалютная КАК СуммаВалютная,
	               |	0 КАК Сумма,
	               |	втМатериальныеРесурсы.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	втМатериальныеРесурсы.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	втМатериальныеРесурсы.Отмена КАК Отмена
	               |ИЗ
	               |	втМатериальныеРесурсы КАК втМатериальныеРесурсы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втМатериальныеРесурсыПоПодразделениям.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Расход) КАК ВидОбъема,
	               |	втМатериальныеРесурсыПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	втМатериальныеРесурсыПоПодразделениям.Роль КАК Роль,
	               |	втМатериальныеРесурсыПоПодразделениям.Подразделение КАК Подразделение,
	               |	втМатериальныеРесурсыПоПодразделениям.СпособПривязки КАК СпособПривязки,
	               |	втМатериальныеРесурсыПоПодразделениям.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	втМатериальныеРесурсыПоПодразделениям.ДатаПривязки КАК ДатаНачисления,
	               |	втМатериальныеРесурсыПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	втМатериальныеРесурсыПоПодразделениям.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	втМатериальныеРесурсыПоПодразделениям.Валюта КАК Валюта,
	               |	втМатериальныеРесурсыПоПодразделениям.Количество КАК Количество,
	               |	втМатериальныеРесурсыПоПодразделениям.СуммаВалютная КАК СуммаВалютная,
	               |	0 КАК Сумма,
	               |	втМатериальныеРесурсыПоПодразделениям.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	               |	втМатериальныеРесурсыПоПодразделениям.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	втМатериальныеРесурсыПоПодразделениям.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	втМатериальныеРесурсыПоПодразделениям.Отмена КАК Отмена
	               |ИЗ
	               |	втМатериальныеРесурсыПоПодразделениям КАК втМатериальныеРесурсыПоПодразделениям
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты) КАК ИсточникПлана,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.Период КАК ПериодРаспределения,
	               |	втМатериальныеРесурсыПоПодразделениям.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.Количество КАК Количество,
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.Сумма КАК Сумма
	               |ИЗ
	               |	втМатериальныеРесурсыПоПодразделениям КАК втМатериальныеРесурсыПоПодразделениям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.МатериальныеРесурсыПоПериодам КАК упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам
	               |		ПО втМатериальныеРесурсыПоПодразделениям.ПроектнаяЗадача = упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.ПроектнаяЗадача
	               |			И втМатериальныеРесурсыПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.ИндексСтрокиРаспределениеПоРолям
	               |			И (НЕ втМатериальныеРесурсыПоПодразделениям.Отмена)
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаМатериальныеРесурсыПоПериодам.Ссылка = &Ссылка";
					   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);					   
	
	РезультатыПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатыПакета.ВГраница();
	
	ТаблицаМатериальныеРесурсы = РезультатыПакета[ИндексПоследнегоЗапроса - 2].Выгрузить();
	ТаблицаМатериальныеРесурсыПоПодразделениям = РезультатыПакета[ИндексПоследнегоЗапроса - 1].Выгрузить();
	ТаблицаМатериальныеРесурсыПоПериодам = РезультатыПакета[ИндексПоследнегоЗапроса].Выгрузить();			
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаМатериальныеРесурсы);
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаМатериальныеРесурсыПоПодразделениям);
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаМатериальныеРесурсыПоПериодам);
	
	Движения.упоДанныеПлановПотребностейМатериальныхРесурсов.Загрузить(ТаблицаМатериальныеРесурсы);
	Для Каждого Запись Из Движения.упоДанныеПлановПотребностейМатериальныхРесурсов Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
	КонецЦикла;
	
	ТаблицаДвиженийПоПодразделениям = ТаблицаМатериальныеРесурсыПоПодразделениям.Скопировать();
	СтруктураКолонокСвертывания = ПолучитьСтруктуруКолонокСвертывания("упоДанныеПлановОбъемовПодразделения");
	ТаблицаДвиженийПоПодразделениям.Свернуть(СтруктураКолонокСвертывания.КолонкиГруппировок, СтруктураКолонокСвертывания.КолонкиСумм);
	Движения.упоДанныеПлановОбъемовПодразделения.Загрузить(ТаблицаДвиженийПоПодразделениям);
	Для Каждого Запись Из Движения.упоДанныеПлановОбъемовПодразделения Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);		
	КонецЦикла;
	
	
	Движения.упоДанныеРаспределенияРасходовПоПериодам.Загрузить(ТаблицаМатериальныеРесурсыПоПериодам);
	Для Каждого Запись Из Движения.упоДанныеРаспределенияРасходовПоПериодам Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);		
	КонецЦикла;
	
	// Зануление. Основную таблицу и таблицу по подразделениям занулять не надо, т.к. зануление (отмена) идет в строках документа.
	
	ОтборИзменениеРаспределения = Новый Структура("ИзменениеРаспределения", Истина);
	
	ПоляСвертки = "ПроектнаяЗадача, ИндексСтрокРаспределенияПоПериодам";
	ТаблицаДляАктуализацииРаспределения = ТаблицаМатериальныеРесурсыПоПодразделениям.Скопировать(ОтборИзменениеРаспределения, 
													ПоляСвертки);
	ТаблицаДляАктуализацииРаспределения.Свернуть(ПоляСвертки);
	
	МассивЗадач = ТаблицаДляАктуализацииРаспределения.ВыгрузитьКолонку("ПроектнаяЗадача");

	ДопПараметрыАктуализацииРегистра = Новый Структура;
	ДопПараметрыАктуализацииРегистра.Вставить("ТаблицаОтбора", ТаблицаДляАктуализацииРаспределения);
	ДопПараметрыАктуализацииРегистра.Вставить("Версия", ЭтотОбъект.Версия);
	
	ДопОтбор = "Версия = &Версия";
	
	ДопОтборСоединение = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбора КАК ТаблицаОтбора
	|ПО Регистр.ПроектнаяЗадача = ТаблицаОтбора.ПроектнаяЗадача
	| И Регистр.ИндексСтрокиРаспределениеПоРолям = ТаблицаОтбора.ИндексСтрокРаспределенияПоПериодам";
	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(Движения.упоДанныеРаспределенияРасходовПоПериодам, 
			Новый Структура ("Регистратор, Период, МассивЗадач, ИмяРегистра",
				Ссылка, Дата, МассивЗадач, "упоДанныеРаспределенияРасходовПоПериодам"),,,
			ДопОтбор, ДопПараметрыАктуализацииРегистра, Ложь, ДопОтборСоединение);
			 				
КонецФункции

Функция СформироватьДвижения_упоДанныеПлановВыпускаСубпродуктов() 

	Если НЕ ПерезаписатьСубпродукты Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Актуализация по срокам пройдет штатно в актуализации фин.планов.
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаСубпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаСубпродукты.Ресурс КАК Номенклатура,
	               |	упоСохранениеДанныхПроектаСубпродукты.Контрагент КАК Контрагент,
	               |	упоСохранениеДанныхПроектаСубпродукты.Договор КАК Договор,
	               |	упоСохранениеДанныхПроектаСубпродукты.ЕдиницаНормирования КАК ЕдиницаИзмерения,
	               |	упоСохранениеДанныхПроектаСубпродукты.СпособПривязкиВыпуска КАК СпособПривязки,
	               |	упоСохранениеДанныхПроектаСубпродукты.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
	               |	упоСохранениеДанныхПроектаСубпродукты.ДатаВыпуска КАК ДатаВыпуска,
	               |	упоСохранениеДанныхПроектаСубпродукты.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаСубпродукты.Стоимость КАК Цена,
	               |	упоСохранениеДанныхПроектаСубпродукты.Скорость КАК Скорость,
	               |	упоСохранениеДанныхПроектаСубпродукты.Основной КАК Основной,
	               |	упоСохранениеДанныхПроектаСубпродукты.СтатьяДоходов КАК СтатьяДоходов,
	               |	упоСохранениеДанныхПроектаСубпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаСубпродукты.СпособПривязки КАК СпособПривязкиДоходов,
	               |	упоСохранениеДанныхПроектаСубпродукты.ДатаПривязки КАК ДатаПривязки,
	               |	упоСохранениеДанныхПроектаСубпродукты.Комментарий КАК Комментарий,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаСубпродукты.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаСубпродукты.Количество
	               |	КОНЕЦ КАК Количество,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаСубпродукты.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаСубпродукты.ОбщСтоимость
	               |	КОНЕЦ КАК СуммаВалютная,
	               |	упоСохранениеДанныхПроектаСубпродукты.Коэффициент КАК Коэффициент,
	               |	упоСохранениеДанныхПроектаСубпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	упоСохранениеДанныхПроектаСубпродукты.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаСубпродукты.Отмена КАК Отмена
	               |ПОМЕСТИТЬ втСубпродукты
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.Субпродукты КАК упоСохранениеДанныхПроектаСубпродукты
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаСубпродукты.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Роль КАК Роль,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Подразделение КАК Подразделение,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.СпособПривязки КАК СпособПривязки,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ДатаПривязки КАК ДатаПривязки,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Отмена
	               |				ИЛИ втСубпродукты.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Количество
	               |	КОНЕЦ КАК Количество,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Отмена
	               |				ИЛИ втСубпродукты.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Сумма
	               |	КОНЕЦ КАК СуммаВалютная,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Отмена КАК Отмена,
	               |	втСубпродукты.Валюта КАК Валюта
	               |ПОМЕСТИТЬ втРаспределениеПоПодразделениям
	               |ИЗ
	               |	втСубпродукты КАК втСубпродукты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.СубпродуктыПоПодразделениям КАК упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям
	               |		ПО втСубпродукты.ПроектнаяЗадача = упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ПроектнаяЗадача
	               |			И втСубпродукты.ИндексСтрокРаспределения = упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.ИндексСтрокиВладельца
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПодразделениям.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втСубпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	втСубпродукты.Номенклатура КАК Номенклатура,
	               |	втСубпродукты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	втСубпродукты.Валюта КАК Валюта,
	               |	втСубпродукты.Контрагент КАК Контрагент,
	               |	втСубпродукты.Договор КАК Договор,
	               |	втСубпродукты.ЗадержкаЗаказа КАК ЗадержкаЗаказа,
	               |	втСубпродукты.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	втСубпродукты.ДатаПривязки КАК ДатаПривязки,
	               |	втСубпродукты.Количество КАК Количество,
	               |	втСубпродукты.Цена КАК Цена,
	               |	втСубпродукты.СуммаВалютная КАК СуммаВалютная,
	               |	0 КАК Сумма,
	               |	втСубпродукты.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	втСубпродукты.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	втСубпродукты.Отмена КАК Отмена,
	               |	втСубпродукты.Скорость КАК Скорость,
	               |	втСубпродукты.Основной КАК Основной,
	               |	втСубпродукты.Коэффициент КАК Коэффициент,
	               |	втСубпродукты.СтатьяДоходов КАК СтатьяДоходов,
	               |	втСубпродукты.СпособПривязкиДоходов КАК СпособПривязкиДоходов,
	               |	втСубпродукты.СпособПривязки КАК СпособПривязки,
	               |	втСубпродукты.ДатаВыпуска КАК ДатаВыпуска
	               |ИЗ
	               |	втСубпродукты КАК втСубпродукты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втРаспределениеПоПодразделениям.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаОбъемов.Доход) КАК ВидОбъема,
	               |	втРаспределениеПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	втРаспределениеПоПодразделениям.Роль КАК Роль,
	               |	втРаспределениеПоПодразделениям.Подразделение КАК Подразделение,
	               |	втРаспределениеПоПодразделениям.СпособПривязки КАК СпособПривязки,
	               |	втРаспределениеПоПодразделениям.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	втРаспределениеПоПодразделениям.ДатаПривязки КАК ДатаНачисления,
	               |	втРаспределениеПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	втРаспределениеПоПодразделениям.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	втРаспределениеПоПодразделениям.Валюта КАК Валюта,
	               |	втРаспределениеПоПодразделениям.Количество КАК Количество,
	               |	втРаспределениеПоПодразделениям.СуммаВалютная КАК СуммаВалютная,
	               |	0 КАК Сумма,
	               |	втРаспределениеПоПодразделениям.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	               |	втРаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	втРаспределениеПоПодразделениям.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	втРаспределениеПоПодразделениям.Отмена КАК Отмена
	               |ИЗ
	               |	втРаспределениеПоПодразделениям КАК втРаспределениеПоПодразделениям
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПериодам.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Объемы) КАК ИсточникПлана,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПериодам.Период КАК ПериодРаспределения,
	               |	втРаспределениеПоПодразделениям.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПериодам.ИндексСтрокиРаспределениеПоРолям КАК ИндексСтрокиРаспределениеПоРолям,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПериодам.Количество КАК Количество,
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПериодам.Сумма КАК Сумма
	               |ИЗ
	               |	втРаспределениеПоПодразделениям КАК втРаспределениеПоПодразделениям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.СубпродуктыПоПериодам КАК упоСохранениеДанныхПроектаСубпродуктыПоПериодам
	               |		ПО втРаспределениеПоПодразделениям.ПроектнаяЗадача = упоСохранениеДанныхПроектаСубпродуктыПоПериодам.ПроектнаяЗадача
	               |			И втРаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = упоСохранениеДанныхПроектаСубпродуктыПоПериодам.ИндексСтрокиРаспределениеПоРолям
	               |			И (НЕ втРаспределениеПоПодразделениям.Отмена)
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаСубпродуктыПоПериодам.Ссылка = &Ссылка";					   						   
	
	РезультатыПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатыПакета.ВГраница();
	
	ОсновнаяТаблица = РезультатыПакета[ИндексПоследнегоЗапроса - 2].Выгрузить();
	ТаблицаПоПодразделениям = РезультатыПакета[ИндексПоследнегоЗапроса - 1].Выгрузить();
	ТаблицаПоПериодам = РезультатыПакета[ИндексПоследнегоЗапроса].Выгрузить();
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ОсновнаяТаблица);
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаПоПодразделениям);
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаПоПериодам);
	
	Движения.упоДанныеПлановВыпускаСубпродуктов.Загрузить(ОсновнаяТаблица);
	Для Каждого Запись Из Движения.упоДанныеПлановВыпускаСубпродуктов Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
	КонецЦикла;
	
	ТаблицаДвиженийПоПодразделениям = ТаблицаПоПодразделениям.Скопировать();
	СтруктураКолонокСвертывания = ПолучитьСтруктуруКолонокСвертывания("упоДанныеПлановОбъемовПодразделения");
	ТаблицаДвиженийПоПодразделениям.Свернуть(СтруктураКолонокСвертывания.КолонкиГруппировок, СтруктураКолонокСвертывания.КолонкиСумм);
	
	ЗаполнитьДвиженияПоТаблице(ТаблицаДвиженийПоПодразделениям, Движения.упоДанныеПлановОбъемовПодразделения);
	ЗаполнитьДвиженияПоТаблице(ТаблицаПоПериодам, Движения.упоДанныеРаспределенияДоходовПоПериодам);
	
	// Зануление. Основную таблицу и таблицу по подразделениям занулять не надо, т.к. зануление (отмена) идет в строках документа.
	
	ОтборИзменениеРаспределения = Новый Структура("ИзменениеРаспределения", Истина);
	
	ПоляСвертки = "ПроектнаяЗадача, ИндексСтрокРаспределенияПоПериодам";
	ТаблицаДляАктуализацииРаспределения = ТаблицаПоПодразделениям.Скопировать(ОтборИзменениеРаспределения, 
													ПоляСвертки);
	ТаблицаДляАктуализацииРаспределения.Свернуть(ПоляСвертки);
	
	МассивЗадач = ТаблицаДляАктуализацииРаспределения.ВыгрузитьКолонку("ПроектнаяЗадача");

	ДопПараметрыАктуализацииРегистра = Новый Структура;
	ДопПараметрыАктуализацииРегистра.Вставить("ТаблицаОтбора", ТаблицаДляАктуализацииРаспределения);
	ДопПараметрыАктуализацииРегистра.Вставить("Версия", ЭтотОбъект.Версия);
	
	ДопОтбор = "Версия = &Версия";
	
	ДопОтборСоединение = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбора КАК ТаблицаОтбора
	|ПО Регистр.ПроектнаяЗадача = ТаблицаОтбора.ПроектнаяЗадача
	| И Регистр.ИндексСтрокиРаспределениеПоРолям = ТаблицаОтбора.ИндексСтрокРаспределенияПоПериодам";
	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(Движения.упоДанныеРаспределенияДоходовПоПериодам, 
			Новый Структура ("Регистратор, Период, МассивЗадач, ИмяРегистра",
				Ссылка, Дата, МассивЗадач, "упоДанныеРаспределенияДоходовПоПериодам"),,,
			ДопОтбор, ДопПараметрыАктуализацииРегистра, Ложь, ДопОтборСоединение);
			 				
КонецФункции

Функция СформироватьДвижения_упоАктуальныеПланыЗатратМатериальныхРесурсов() 

	Если НЕ ПерезаписатьМатериальныеРесурсы Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивЗадач = МатериальныеРесурсы.ВыгрузитьКолонку("ПроектнаяЗадача");
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Версия", ЭтотОбъект.Версия);
	Запрос.УстановитьПараметр("ПроектныеЗадачи", МассивЗадач);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Номенклатура КАК Ресурс,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ВидОперации КАК ВидОперации,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаНормирования,
	               |	СУММА(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество) КАК КоличествоЕдНормирования,
	               |	СУММА(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма) КАК Стоимость,
	               |	СУММА(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество) КАК Количество
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановПотребностейМатериальныхРесурсов.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ПроектнаяЗадача В (&ПроектныеЗадачи)) КАК упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних
	               |ГДЕ
	               |	(упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Количество <> 0
	               |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Сумма <> 0
	               |			ИЛИ упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.СуммаВалютная <> 0)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ПроектнаяЗадача,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.Номенклатура,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ВидОперации,
	               |	упоДанныеПлановПотребностейМатериальныхРесурсовСрезПоследних.ЕдиницаИзмерения";
	
	Результат = Запрос.Выполнить();
	
	ТаблицаАктуальныеПланыЗатратМатериальныхРесурсов = Результат.Выгрузить();
	упоПроектыИЗадачиСервер.ЗаполнитьКоличествоПоКоличествуЕдНормированияМатериальныхЗатрат(ТаблицаАктуальныеПланыЗатратМатериальныхРесурсов);
	
	Движения.упоАктуальныеПланыЗатратМатериальныхРесурсов.Загрузить(ТаблицаАктуальныеПланыЗатратМатериальныхРесурсов);
	Для Каждого Запись Из Движения.упоАктуальныеПланыЗатратМатериальныхРесурсов Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);		
	КонецЦикла;
				
	ДанныеАктуализацииРегистра = Новый Структура("Регистратор, Период, МассивЗадач, ИмяРегистра",
		Ссылка, Дата, МассивЗадач);
	УсловиеОтбора = "Версия = &Версия";
	ПараметрОтбора = Новый Структура("Версия", ЭтотОбъект.Версия);
		
	ДанныеАктуализацииРегистра.ИмяРегистра = "упоАктуальныеПланыЗатратМатериальныхРесурсов";	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(Движения.упоАктуальныеПланыЗатратМатериальныхРесурсов, ДанныеАктуализацииРегистра,,,
		УсловиеОтбора, ПараметрОтбора, Ложь);
				 				
КонецФункции

Функция СформироватьДвижения_упоДанныеПлановДоходовИРасходов(Версия) 

	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ВалютаУпрУчета", ПараметрыСеанса.упоВалютаУправленческогоУчета);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроектныеЗадачиТРНеВПланеРасходов.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		упоСохранениеДанныхПроектаПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |	ИЗ
	               |		Документ.упоСохранениеДанныхПроекта.ПроектныеЗадачи КАК упоСохранениеДанныхПроектаПроектныеЗадачи
	               |	ГДЕ
	               |		упоСохранениеДанныхПроектаПроектныеЗадачи.Ссылка = &Ссылка
	               |		И НЕ упоСохранениеДанныхПроектаПроектныеЗадачи.ВключитьТрудРесурсыВПланРасходов) КАК ПроектныеЗадачиТРНеВПланеРасходов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |				,
	               |				Версия = &Версия
	               |					И НЕ Регистратор = &Ссылка) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ПО ПроектныеЗадачиТРНеВПланеРасходов.ПроектнаяЗадача = упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача
	               |			И (упоСвойстваПроектныхЗадачСрезПоследних.ВключитьТрудРесурсыВПланРасходов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход) КАК ВидЭлемента,
	               |	упоСохранениеДанныхПроектаПланДоходов.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланДоходов.Статья КАК Статья,
	               |	упоСохранениеДанныхПроектаПланДоходов.Контрагент КАК Контрагент,
	               |	упоСохранениеДанныхПроектаПланДоходов.Договор КАК Договор,
	               |	упоСохранениеДанныхПроектаПланДоходов.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаПланДоходов.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходов.СпособПривязки КАК СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходов.ДатаПривязки КАК ДатаПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходов.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходов.Отмена КАК Отмена,
	               |	СУММА(упоСохранениеДанныхПроектаПланДоходов.Сумма) КАК Сумма,
	               |	упоСохранениеДанныхПроектаПланДоходов.ИсточникПлана КАК ИсточникПлана,
	               |	ЗНАЧЕНИЕ(Перечисление.упоПериодыАгрегацииЗатрат.ПустаяСсылка) КАК ПериодАгрегации
	               |ПОМЕСТИТЬ втПланДоходовРасходов
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.ПланДоходов КАК упоСохранениеДанныхПроектаПланДоходов
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПланДоходов.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоСохранениеДанныхПроектаПланДоходов.ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланДоходов.Статья,
	               |	упоСохранениеДанныхПроектаПланДоходов.Контрагент,
	               |	упоСохранениеДанныхПроектаПланДоходов.Договор,
	               |	упоСохранениеДанныхПроектаПланДоходов.Валюта,
	               |	упоСохранениеДанныхПроектаПланДоходов.ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходов.СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходов.ДатаПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходов.ИндексСтрокРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходов.ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходов.Отмена,
	               |	упоСохранениеДанныхПроектаПланДоходов.ИсточникПлана,
	               |	ЗНАЧЕНИЕ(Перечисление.упоПериодыАгрегацииЗатрат.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход),
	               |	упоСохранениеДанныхПроектаПланРасходов.ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланРасходов.Статья,
	               |	упоСохранениеДанныхПроектаПланРасходов.Контрагент,
	               |	упоСохранениеДанныхПроектаПланРасходов.Договор,
	               |	упоСохранениеДанныхПроектаПланРасходов.Валюта,
	               |	упоСохранениеДанныхПроектаПланРасходов.ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходов.СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланРасходов.ДатаПривязки,
	               |	упоСохранениеДанныхПроектаПланРасходов.ИндексСтрокРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходов.ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходов.Отмена,
	               |	СУММА(упоСохранениеДанныхПроектаПланРасходов.Сумма),
	               |	упоСохранениеДанныхПроектаПланРасходов.ИсточникПлана,
	               |	упоСохранениеДанныхПроектаПланРасходов.ПериодАгрегации
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.ПланРасходов КАК упоСохранениеДанныхПроектаПланРасходов
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПланРасходов.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоСохранениеДанныхПроектаПланРасходов.ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланРасходов.Статья,
	               |	упоСохранениеДанныхПроектаПланРасходов.Контрагент,
	               |	упоСохранениеДанныхПроектаПланРасходов.Договор,
	               |	упоСохранениеДанныхПроектаПланРасходов.Валюта,
	               |	упоСохранениеДанныхПроектаПланРасходов.ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходов.СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланРасходов.ДатаПривязки,
	               |	упоСохранениеДанныхПроектаПланРасходов.ИндексСтрокРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходов.ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходов.Отмена,
	               |	упоСохранениеДанныхПроектаПланРасходов.ИсточникПлана,
	               |	упоСохранениеДанныхПроектаПланРасходов.ПериодАгрегации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ВидЭлемента,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПроектнаяЗадача,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Статья,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Контрагент,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Договор,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.Валюта,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПрофильРаспределения,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.СпособПривязки,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ДатаПривязки,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ИндексСтрокРаспределения,
	               |	ИСТИНА,
	               |	ИСТИНА,
	               |	0,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ИсточникПлана,
	               |	упоДанныеПлановДоходовИРасходовСрезПоследних.ПериодАгрегации
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановДоходовИРасходов.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты)
	               |				И ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов КАК втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов)) КАК упоДанныеПлановДоходовИРасходовСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втПланДоходовРасходов.ВидЭлемента КАК ВидЭлемента,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Роль КАК Роль,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Подразделение КАК Подразделение,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.СпособПривязки КАК СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ДатаПривязки КАК ДатаПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ЗаказДоговорПодрядчика КАК ЗаказДоговорПодрядчика,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	               |	СУММА(ВЫБОР
	               |			КОГДА упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Отмена
				   |				ИЛИ втПланДоходовРасходов.Отмена
	               |				ТОГДА 0
	               |			ИНАЧЕ упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Сумма
	               |		КОНЕЦ) КАК СуммаВалютная,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Отмена КАК Отмена,
	               |	втПланДоходовРасходов.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИсточникПлана КАК ИсточникПлана
	               |ПОМЕСТИТЬ втРаспределениеПоПодразделениям
	               |ИЗ
	               |	втПланДоходовРасходов КАК втПланДоходовРасходов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.ПланДоходовПоПодразделениям КАК упоСохранениеДанныхПроектаПланДоходовПоПодразделениям
	               |		ПО втПланДоходовРасходов.ПроектнаяЗадача = упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ПроектнаяЗадача
	               |			И втПланДоходовРасходов.ИндексСтрокРаспределения = упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИндексСтрокиВладельца
	               |			И (втПланДоходовРасходов.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход))
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.СобствСилы_Субподряд,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Роль,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Подразделение,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ДатаПривязки,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.КонтрагентПодрядчик,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ЗаказДоговорПодрядчика,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИндексСтрокиВладельца,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИндексСтрокРаспределенияПоПериодам,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.Отмена,
	               |	втПланДоходовРасходов.Валюта,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПодразделениям.ИсточникПлана,
	               |	втПланДоходовРасходов.ВидЭлемента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втПланДоходовРасходов.ВидЭлемента,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.СобствСилы_Субподряд,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Роль,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Подразделение,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ДатаПривязки,
	               |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИндексСтрокиВладельца,
	               |	СУММА(ВЫБОР
	               |			КОГДА упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Отмена
	               |				ИЛИ втПланДоходовРасходов.Отмена
	               |				ТОГДА 0
	               |			ИНАЧЕ упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Сумма
	               |		КОНЕЦ),
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИндексСтрокРаспределенияПоПериодам,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Отмена,
	               |	втПланДоходовРасходов.Валюта,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИсточникПлана
	               |ИЗ
	               |	втПланДоходовРасходов КАК втПланДоходовРасходов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.ПланРасходовПоПодразделениям КАК упоСохранениеДанныхПроектаПланРасходовПоПодразделениям
	               |		ПО втПланДоходовРасходов.ПроектнаяЗадача = упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ПроектнаяЗадача
	               |			И втПланДоходовРасходов.ИндексСтрокРаспределения = упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИндексСтрокиВладельца
	               |			И (втПланДоходовРасходов.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход))
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.СобствСилы_Субподряд,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Роль,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Подразделение,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.СпособПривязки,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ДатаПривязки,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИндексСтрокиВладельца,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИндексСтрокРаспределенияПоПериодам,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИзменениеРаспределения,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.Отмена,
	               |	втПланДоходовРасходов.Валюта,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПодразделениям.ИсточникПлана,
	               |	втПланДоходовРасходов.ВидЭлемента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Роль,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Подразделение,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокиВладельца,
	               |	0,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИндексСтрокРаспределенияПоПериодам,
	               |	ИСТИНА,
	               |	ИСТИНА,
	               |	&ВалютаУпрУчета,
	               |	упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана
	               |ИЗ
	               |	РегистрСведений.упоДанныеПлановДоходовИРасходовПодразделения.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты)
	               |				И ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов КАК втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов)) КАК упоДанныеПлановДоходовИРасходовПодразделенияСрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втПланДоходовРасходов.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	втПланДоходовРасходов.Статья КАК Статья,
	               |	втПланДоходовРасходов.ВидЭлемента КАК ВидЭлемента,
	               |	втПланДоходовРасходов.Валюта КАК Валюта,
	               |	втПланДоходовРасходов.СпособПривязки КАК СпособПривязки,
	               |	втПланДоходовРасходов.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	втПланДоходовРасходов.ДатаПривязки КАК ДатаПривязки,
	               |	втПланДоходовРасходов.Контрагент КАК Контрагент,
	               |	втПланДоходовРасходов.Договор КАК Договор,
	               |	ВЫБОР
	               |		КОГДА втПланДоходовРасходов.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Объемы)
	               |				ИЛИ втПланДоходовРасходов.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.МатериальныеЗатраты)
	               |				ИЛИ втПланДоходовРасходов.ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.ДополнительныеЗатраты)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоСубпродуктИлиПотребность,
	               |	втПланДоходовРасходов.ИсточникПлана КАК ИсточникПлана,
	               |	втПланДоходовРасходов.ПериодАгрегации КАК ПериодАгрегации,
	               |	втПланДоходовРасходов.ИндексСтрокРаспределения КАК ИндексСтрокРаспределения,
	               |	0 КАК Сумма,
	               |	втПланДоходовРасходов.Сумма КАК СуммаВалютная,
	               |	втПланДоходовРасходов.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	втПланДоходовРасходов.Отмена КАК Отмена
	               |ИЗ
	               |	втПланДоходовРасходов КАК втПланДоходовРасходов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втРаспределениеПоПодразделениям.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	втРаспределениеПоПодразделениям.ВидЭлемента КАК ВидЭлемента,
	               |	втРаспределениеПоПодразделениям.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	втРаспределениеПоПодразделениям.Роль КАК Роль,
	               |	втРаспределениеПоПодразделениям.Подразделение КАК Подразделение,
	               |	втРаспределениеПоПодразделениям.СпособПривязки КАК СпособПривязки,
	               |	втРаспределениеПоПодразделениям.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	втРаспределениеПоПодразделениям.ДатаПривязки КАК ДатаНачисления,
	               |	втРаспределениеПоПодразделениям.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	втРаспределениеПоПодразделениям.ЗаказДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	втРаспределениеПоПодразделениям.Валюта КАК Валюта,
	               |	втРаспределениеПоПодразделениям.СуммаВалютная КАК СуммаВалютная,
	               |	0 КАК Сумма,
	               |	0 КАК Количество,
	               |	втРаспределениеПоПодразделениям.ИндексСтрокиВладельца КАК ИндексСтрокиВладельца,
	               |	втРаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам КАК ИндексСтрокРаспределенияПоПериодам,
	               |	втРаспределениеПоПодразделениям.ИсточникПлана КАК ИсточникПлана,
	               |	втРаспределениеПоПодразделениям.ИзменениеРаспределения КАК ИзменениеРаспределения,
	               |	втРаспределениеПоПодразделениям.Отмена КАК Отмена
	               |ИЗ
	               |	втРаспределениеПоПодразделениям КАК втРаспределениеПоПодразделениям
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаПланДоходовПоПериодам.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПериодам.ИсточникПлана КАК ИсточникПлана,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПериодам.Период КАК ПериодРаспределения,
	               |	втРаспределениеПоПодразделениям.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПериодам.ИндексСтрокиРаспределенияДоходов КАК ИндексСтрокиРаспределенияДоходов,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПериодам.Количество КАК Количество,
	               |	упоСохранениеДанныхПроектаПланДоходовПоПериодам.Сумма КАК Сумма
	               |ИЗ
	               |	втРаспределениеПоПодразделениям КАК втРаспределениеПоПодразделениям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.ПланДоходовПоПериодам КАК упоСохранениеДанныхПроектаПланДоходовПоПериодам
	               |		ПО втРаспределениеПоПодразделениям.ПроектнаяЗадача = упоСохранениеДанныхПроектаПланДоходовПоПериодам.ПроектнаяЗадача
	               |			И втРаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = упоСохранениеДанныхПроектаПланДоходовПоПериодам.ИндексСтрокиРаспределенияДоходов
	               |			И (НЕ втРаспределениеПоПодразделениям.Отмена)
	               |			И (втРаспределениеПоПодразделениям.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Доход))
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПланДоходовПоПериодам.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаПланРасходовПоПериодам.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПериодам.ИсточникПлана КАК ИсточникПлана,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПериодам.Период КАК ПериодРаспределения,
	               |	втРаспределениеПоПодразделениям.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПериодам.ИндексСтрокиРаспределенияРасходов КАК ИндексСтрокиРаспределенияРасходов,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПериодам.Количество КАК Количество,
	               |	упоСохранениеДанныхПроектаПланРасходовПоПериодам.Сумма КАК Сумма
	               |ИЗ
	               |	втРаспределениеПоПодразделениям КАК втРаспределениеПоПодразделениям
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упоСохранениеДанныхПроекта.ПланРасходовПоПериодам КАК упоСохранениеДанныхПроектаПланРасходовПоПериодам
	               |		ПО втРаспределениеПоПодразделениям.ПроектнаяЗадача = упоСохранениеДанныхПроектаПланРасходовПоПериодам.ПроектнаяЗадача
	               |			И втРаспределениеПоПодразделениям.ИндексСтрокРаспределенияПоПериодам = упоСохранениеДанныхПроектаПланРасходовПоПериодам.ИндексСтрокиРаспределенияРасходов
	               |			И (НЕ втРаспределениеПоПодразделениям.Отмена)
	               |			И (втРаспределениеПоПодразделениям.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.упоВидЭлементаПланаДоходовИРасходов.Расход))
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПланРасходовПоПериодам.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Версия КАК Версия,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Статья КАК Статья,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ВидЭлемента КАК ВидЭлемента,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Контрагент КАК Контрагент,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Договор КАК Договор,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.Валюта КАК Валюта,
	               |	упоАктуальныеПланыДоходовИРасходовСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	               |	0 КАК Сумма,
	               |	0 КАК СуммаВалютная
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходов.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты)
	               |				И ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов КАК втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов)) КАК упоАктуальныеПланыДоходовИРасходовСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Версия КАК Версия,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Статья КАК Статья,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ВидЭлемента КАК ВидЭлемента,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Контрагент КАК Контрагент,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Договор КАК Договор,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Валюта КАК Валюта,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Подразделение КАК Подразделение,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Роль КАК Роль,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Номенклатура КАК Номенклатура,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Сценарий КАК Сценарий,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ДатаНачисления КАК ДатаНачисления,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.Заказ_ДоговорПодрядчика КАК Заказ_ДоговорПодрядчика,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СобствСилы_Субподряд КАК СобствСилы_Субподряд,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.КонтрагентПодрядчик КАК КонтрагентПодрядчик,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.СпособПривязки КАК СпособПривязки,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ПериодАгрегации КАК ПериодАгрегации,
	               |	упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних.ИсточникПлана КАК ИсточникПлана,
	               |	0 КАК Сумма,
	               |	0 КАК СуммаВалютная,
	               |	0 КАК Количество
	               |ИЗ
	               |	РегистрСведений.упоАктуальныеПланыДоходовИРасходовПодразделения.СрезПоследних(
	               |			,
	               |			Версия = &Версия
	               |				И ИсточникПлана = ЗНАЧЕНИЕ(Перечисление.упоИсточникПланаДоходовИРасходов.Трудозатраты)
	               |				И ПроектнаяЗадача В
	               |					(ВЫБРАТЬ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |					ИЗ
	               |						втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов КАК втПроектныеЗадачиУдалитьТрансляциюТРВПланРасходов)) КАК упоАктуальныеПланыДоходовИРасходовПодразделенияСрезПоследних";					   						   
	
	РезультатыПакета = Запрос.ВыполнитьПакет();
	ИндексПоследнегоЗапроса = РезультатыПакета.ВГраница();
	
	ОсновнаяТаблица = РезультатыПакета[ИндексПоследнегоЗапроса - 5].Выгрузить();
	ТаблицаПоПодразделениям = РезультатыПакета[ИндексПоследнегоЗапроса - 4].Выгрузить();
	ТаблицаДоходовПоПериодам = РезультатыПакета[ИндексПоследнегоЗапроса - 3].Выгрузить();
	ТаблицаРасходовПоПериодам = РезультатыПакета[ИндексПоследнегоЗапроса - 2].Выгрузить();
	ОсновнаяТаблицаАктуальные = РезультатыПакета[ИндексПоследнегоЗапроса - 1].Выгрузить();
	ТаблицаПоПодразделениямАктуальные = РезультатыПакета[ИндексПоследнегоЗапроса].Выгрузить();
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ОсновнаяТаблица);
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаПоПодразделениям);
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДоходовПоПериодам);
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаРасходовПоПериодам);
	
	Движения.упоДанныеПлановДоходовИРасходов.Загрузить(ОсновнаяТаблица);
	Для Каждого Запись Из Движения.упоДанныеПлановДоходовИРасходов Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
	КонецЦикла;
	
	ТаблицаДвиженийПоПодразделениям = ТаблицаПоПодразделениям.Скопировать();
	СтруктураКолонокСвертывания = ПолучитьСтруктуруКолонокСвертывания("упоДанныеПлановДоходовИРасходовПодразделения");
	ТаблицаДвиженийПоПодразделениям.Свернуть(СтруктураКолонокСвертывания.КолонкиГруппировок, СтруктураКолонокСвертывания.КолонкиСумм);
	ТаблицаДвиженийПоПодразделениям.Сортировать("Сумма");
	
	ТаблицаДвиженийБезУчетаПрофиля = ТаблицаПоПодразделениям.Скопировать(); 
	ИспользоватьИнкрементВремени = ИспользоватьИнкрементВДвиженияхПланаДР(ТаблицаДвиженийПоПодразделениям,
		ТаблицаДвиженийБезУчетаПрофиля);
	
	ЗаполнитьДвиженияПоТаблице(ТаблицаДвиженийПоПодразделениям, Движения.упоДанныеПлановДоходовИРасходовПодразделения);
	// Обновим период для уникальности записей при кейсе, когда у строки-родителя меняется только
	// способ привязки/профиль распределения. 
	
	Если ИспользоватьИнкрементВремени Тогда
		ИнкрементаВремени = 0;
		Для каждого Движение Из Движения.упоДанныеПлановДоходовИРасходовПодразделения Цикл
			Движение.Период = Движение.Период + ИнкрементаВремени;
			ИнкрементаВремени = ИнкрементаВремени + 1;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьДвиженияПоТаблице(ТаблицаДоходовПоПериодам, Движения.упоДанныеРаспределенияДоходовПоПериодам);
	ЗаполнитьДвиженияПоТаблице(ТаблицаРасходовПоПериодам, Движения.упоДанныеРаспределенияРасходовПоПериодам);
	
	Движения.упоАктуальныеПланыДоходовИРасходов.Загрузить(ОсновнаяТаблицаАктуальные);
	Для Каждого Запись Из Движения.упоАктуальныеПланыДоходовИРасходов Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
	КонецЦикла;
	
	Движения.упоАктуальныеПланыДоходовИРасходовПодразделения.Загрузить(ТаблицаПоПодразделениямАктуальные);
	Для Каждого Запись Из Движения.упоАктуальныеПланыДоходовИРасходовПодразделения Цикл
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
	КонецЦикла;
	
	// Зануление. Основную таблицу и таблицу по подразделениям занулять не надо, т.к. зануление (отмена) идет в строках документа.
	
	ОтборИзменениеРаспределения = Новый Структура("ИзменениеРаспределения", Истина);
	
	ПоляСвертки = "ПроектнаяЗадача, ИндексСтрокРаспределенияПоПериодам";
	ТаблицаДляАктуализацииРаспределения = ТаблицаПоПодразделениям.Скопировать(ОтборИзменениеРаспределения, 
													ПоляСвертки);
	ТаблицаДляАктуализацииРаспределения.Свернуть(ПоляСвертки);
	
	МассивЗадач = ТаблицаДляАктуализацииРаспределения.ВыгрузитьКолонку("ПроектнаяЗадача");

	ДопПараметрыАктуализацииРегистра = Новый Структура;
	ДопПараметрыАктуализацииРегистра.Вставить("ТаблицаОтбора", ТаблицаДляАктуализацииРаспределения);
	ДопПараметрыАктуализацииРегистра.Вставить("Версия", Версия);
	
	ДопОтбор = "Версия = &Версия";
	
	ДопОтборСоединение = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОтбора КАК ТаблицаОтбора
	|ПО Регистр.ПроектнаяЗадача = ТаблицаОтбора.ПроектнаяЗадача
	| И Регистр.ИндексСтрокиРаспределениеПоРолям = ТаблицаОтбора.ИндексСтрокРаспределенияПоПериодам";
	
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(Движения.упоДанныеРаспределенияДоходовПоПериодам, 
			Новый Структура ("Регистратор, Период, МассивЗадач, ИмяРегистра",
				Ссылка, Дата, МассивЗадач, "упоДанныеРаспределенияДоходовПоПериодам"),,,
			ДопОтбор, ДопПараметрыАктуализацииРегистра, Ложь, ДопОтборСоединение);
			
	упоАктуализацияПроектаВызовСервера.АктуализироватьДанныеРегистраСведений(Движения.упоДанныеРаспределенияРасходовПоПериодам, 
			Новый Структура ("Регистратор, Период, МассивЗадач, ИмяРегистра",
				Ссылка, Дата, МассивЗадач, "упоДанныеРаспределенияРасходовПоПериодам"),,,
			ДопОтбор, ДопПараметрыАктуализацииРегистра, Ложь, ДопОтборСоединение);
			
КонецФункции

Процедура СформироватьДвижение_упоДанныеПлановДвиженияДенежныхСредств()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.СтатьяДДС КАК СтатьяДДС,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.Контрагент КАК Контрагент,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.Договор КАК Договор,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.НаправлениеДвижения КАК НаправлениеДвижения,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.СпособПривязки КАК СпособПривязки,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.Задержка КАК Задержка,
	               |	ВЫБОР
	               |		КОГДА упоСохранениеДанныхПроектаДвиженияДенежныхСредств.Отмена
	               |			ТОГДА 0
	               |		ИНАЧЕ упоСохранениеДанныхПроектаДвиженияДенежныхСредств.СуммаВалютная
	               |	КОНЕЦ КАК СуммаВалютная,
	               |	0 КАК Сумма,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.ДатаПривязки КАК ДатаПривязки,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.Валюта КАК Валюта,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.ПрофильРаспределения КАК ПрофильРаспределения,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.ВидПлатежа КАК ВидПлатежа,
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.Отмена КАК Отмена
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.ДвиженияДенежныхСредств КАК упоСохранениеДанныхПроектаДвиженияДенежныхСредств
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаДвиженияДенежныхСредств.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ТаблицаДвижений = РезультатЗапроса.Выгрузить();
	
	упоМодульВалютногоУчета.ЗаполнитьСуммуУправленческогоУчета(ТаблицаДвижений);
	
	ЗаполнитьДвиженияПоТаблице(ТаблицаДвижений, Движения.упоДанныеПлановДвиженияДенежныхСредств);
	
КонецПроцедуры

Процедура СформироватьДвижения_упоДанныеПроектнойПродукции() 
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.Ссылка КАК Ссылка,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.НомерСтроки КАК НомерСтроки,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.ПроектнаяПродукция КАК ПроектнаяПродукция,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.Последовательность КАК Последовательность,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.СкоростьВыполнения КАК СкоростьВыполнения,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.НомерСвязи КАК НомерСвязи,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.ДатаНачала КАК ДатаНачала,
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.ПроектнаяПродукция КАК упоСохранениеДанныхПроектаПроектнаяПродукция
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПроектнаяПродукция.Ссылка = &Ссылка";
	
	РезультатыПакета = Запрос.Выполнить();	
	ОсновнаяТаблица = РезультатыПакета.Выгрузить();
	
	Движения.упоДанныеПроектнойПродукции.Загрузить(ОсновнаяТаблица);
	
	Для Каждого Запись Из Движения.упоДанныеПроектнойПродукции Цикл 
		
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Запись);
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвижения_упоСтатусыПроектнойПродукции()
	
	Если Не упоИнтеграцияКлиентСервер.ДоступенФункционалПроектнаяПродукция() Тогда
		Возврат;
	КонецЕсли;
	
	// Предварительная проверка необходимости дальнейшей обработки: должна быть отмененная ПП или отмененные ПЗ, 
	// у которых потенциально может быть ПП.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	упоСохранениеДанныхПроектаСубпродукты.Ресурс КАК ПроектнаяПродукция
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.Субпродукты КАК упоСохранениеДанныхПроектаСубпродукты
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаСубпродукты.Ссылка = &Ссылка
	               |	И упоСохранениеДанныхПроектаСубпродукты.Ресурс ССЫЛКА Справочник.упоПроектнаяПродукция
	               |	И упоСохранениеДанныхПроектаСубпродукты.Отмена
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	упоСохранениеДанныхПроектаПроектныеЗадачи.ПроектнаяЗадача
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.ПроектныеЗадачи КАК упоСохранениеДанныхПроектаПроектныеЗадачи
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПроектныеЗадачи.Ссылка = &Ссылка
	               |	И упоСохранениеДанныхПроектаПроектныеЗадачи.ЗадачаОтменена";
	РезультатЗапроса = Запрос.Выполнить();
	ТребуетсяОбработка = Не РезультатЗапроса.Пустой();
	
	Если Не ТребуетсяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Версия", ЭтотОбъект.Версия);
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Версия КАК Версия,
	               |	упоСохранениеДанныхПроектаСубпродукты.Ресурс КАК ПроектнаяПродукция,
	               |	упоСохранениеДанныхПроектаСубпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	МИНИМУМ(упоСохранениеДанныхПроектаСубпродукты.Отмена) КАК Отмена
	               |ПОМЕСТИТЬ УдаленныеСПД_Субпродукты
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.Субпродукты КАК упоСохранениеДанныхПроектаСубпродукты
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаСубпродукты.Ссылка = &Ссылка
	               |	И упоСохранениеДанныхПроектаСубпродукты.Ресурс ССЫЛКА Справочник.упоПроектнаяПродукция
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упоСохранениеДанныхПроектаСубпродукты.Ресурс,
	               |	упоСохранениеДанныхПроектаСубпродукты.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСохранениеДанныхПроектаПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ УдаленныеПЗ
	               |ИЗ
	               |	Документ.упоСохранениеДанныхПроекта.ПроектныеЗадачи КАК упоСохранениеДанныхПроектаПроектныеЗадачи
	               |ГДЕ
	               |	упоСохранениеДанныхПроектаПроектныеЗадачи.Ссылка = &Ссылка
	               |	И упоСохранениеДанныхПроектаПроектныеЗадачи.ЗадачаОтменена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Версия КАК Версия,
	               |	упоПроектнаяПродукция.Ссылка КАК ПроектнаяПродукция,
	               |	УдаленныеПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ УдаленныеСПД_ПЗ
	               |ИЗ
	               |	УдаленныеПЗ КАК УдаленныеПЗ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упоПроектнаяПродукция КАК упоПроектнаяПродукция
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоСтатусыПроектнойПродукции.СрезПоследних(
	               |					,
	               |					Версия = &Версия
	               |						И ПроектнаяЗадача В
	               |							(ВЫБРАТЬ
	               |								УдаленныеПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |							ИЗ
	               |								УдаленныеПЗ КАК УдаленныеПЗ)) КАК упоСтатусыПроектнойПродукцииСрезПоследних
	               |			ПО упоПроектнаяПродукция.ПроектнаяЗадача = упоСтатусыПроектнойПродукцииСрезПоследних.ПроектнаяЗадача
	               |				И упоПроектнаяПродукция.Ссылка = упоСтатусыПроектнойПродукцииСрезПоследних.ПроектнаяПродукция
	               |		ПО УдаленныеПЗ.ПроектнаяЗадача = упоПроектнаяПродукция.ПроектнаяЗадача
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА упоСтатусыПроектнойПродукцииСрезПоследних.Статус ЕСТЬ NULL
	               |				ТОГДА ИСТИНА
	               |			КОГДА упоСтатусыПроектнойПродукцииСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.упоСтатусыПроектнойПродукции.Неактивно)
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УдаленныеСПД_Субпродукты.Версия КАК Версия,
	               |	УдаленныеСПД_Субпродукты.ПроектнаяПродукция КАК ПроектнаяПродукция,
	               |	УдаленныеСПД_Субпродукты.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ИЗ
	               |	УдаленныеСПД_Субпродукты КАК УдаленныеСПД_Субпродукты
	               |ГДЕ
	               |	УдаленныеСПД_Субпродукты.Отмена
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УдаленныеСПД_ПЗ.Версия,
	               |	УдаленныеСПД_ПЗ.ПроектнаяПродукция,
	               |	УдаленныеСПД_ПЗ.ПроектнаяЗадача
	               |ИЗ
	               |	УдаленныеСПД_ПЗ КАК УдаленныеСПД_ПЗ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МодульупоПроектнаяПродукция = ОбщегоНазначения.ОбщийМодуль("упоПроектнаяПродукция");
	
	МодульупоПроектнаяПродукция.УстановитьСтатусПроектнойПродукции(РезультатЗапроса.Выгрузить(), Дата);
	
КонецПроцедуры

Процедура СоздатьОбновитьСвязанныйЭлементСправочникаПроекты(Отказ)
	
	Если Отказ Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеОбновлятьЭлементыСправочникаПроекты") 
		И ДополнительныеСвойства.НеОбновлятьЭлементыСправочникаПроекты Тогда
		Возврат; // Возврат
	КонецЕсли;
	
	Для Каждого СтрокаПЗ Из ПроектныеЗадачи Цикл
		
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить("Ссылка", СтрокаПЗ.ПроектнаяЗадача);
		СтруктураСвойств.Вставить("ЗадачаРодитель", СтрокаПЗ.ЗадачаРодитель);
		СтруктураСвойств.Вставить("НазваниеПроектнойЗадачи", СтрокаПЗ.НазваниеЗадачи);
		СтруктураСвойств.Вставить("Проект", ЭтотОбъект.Проект);
		СтруктураСвойств.Вставить("Проведен", Истина);
		СтруктураСвойств.Вставить("ПометкаУдаления", Ложь);
		СтруктураСвойств.Вставить("ДополнительныеСвойства", Новый Структура("НеИзменятьКодСДР", Истина));
		СтруктураСвойств.Вставить("ЭтоАктируемаяЗадача", СтрокаПЗ.ЭтоАктируемаяЗадача);
		СтруктураСвойств.Вставить("ЗадачаОтменена", СтрокаПЗ.ЗадачаОтменена);
		
		Ошибка = упоПроектыИЗадачиСервер.СоздатьОбновитьСвязанныйЭлементСправочникаПроекты(СтруктураСвойств);
		
		Отказ = ?(Отказ, Отказ, Ошибка);
		
	КонецЦикла; 
	
КонецПроцедуры

// Заполняет движения регистра по переданной таблице.
//
// Параметры:
//  ТабЧасть		 - ТаблицаЗначений, ТабличнаяЧасть	 - таблица-источник для формирования движений.
//  ДвиженияРегистра - КоллекцияЗначенийСвойстваОбъектаМетаданных. - движения регистра-приемника. 
//
Процедура ЗаполнитьДвиженияПоТаблице(Таблица, ДвиженияРегистра)
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Движение = ДвиженияРегистра.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Движение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Движение)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Версия) Тогда
		Движение.Версия = ЭтотОбъект.Версия;
	КонецЕсли;
	Движение.Регистратор = Ссылка;
	Движение.Период = Дата;
	Движение.Активность = Истина;
	
КонецПроцедуры 

Процедура СформироватьДвижения_упоСвойстваПроектныхЗадач()
	
	ПараметрыЗаполненияНовойЗадачи = ПараметрыЗаполненияНовойЗадачи();
	
	МассивПЗ = ПроектныеЗадачи.ВыгрузитьКолонку("ПроектнаяЗадача");
	ДанныеПоТекСвойствам = СформироватьДанныеПоТекущимСвойстваПроектныхЗадач(ЭтотОбъект.Версия, МассивПЗ);
	
	МассивСвойств = ДанныеПоТекСвойствам.МассивСвойств;
	ТаблицаТекущиеСвойства = ДанныеПоТекСвойствам.ТаблицаТекущиеСвойства;
	
	МассивИменРеквизитовТабличнойЧастиПроектныеЗадачи = Новый Массив;
	МассивИменРеквизитовТабличнойЧастиПроектныеЗадачиНовых = Новый Массив;
	РеквизитыТабличнойЧастиПроектныеЗадачи = ЭтотОбъект.Метаданные().ТабличныеЧасти.ПроектныеЗадачи.Реквизиты;
	Для Каждого РеквизитТабличнойЧастиПроектныеЗадачи Из РеквизитыТабличнойЧастиПроектныеЗадачи Цикл
		Если МассивСвойств.Найти(РеквизитТабличнойЧастиПроектныеЗадачи.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивИменРеквизитовТабличнойЧастиПроектныеЗадачи.Добавить(РеквизитТабличнойЧастиПроектныеЗадачи.Имя);
		Если ПараметрыЗаполненияНовойЗадачи.Свойство(РеквизитТабличнойЧастиПроектныеЗадачи.Имя) Тогда
			МассивИменРеквизитовТабличнойЧастиПроектныеЗадачиНовых.Добавить(РеквизитТабличнойЧастиПроектныеЗадачи.Имя);	
		КонецЕсли;
	КонецЦикла;	
	СтрокаИменаСвойствДляЗаписи = СтрСоединить(МассивИменРеквизитовТабличнойЧастиПроектныеЗадачи, ",");
	СтрокаИменаСвойствДляЗаписиНовых = СтрСоединить(МассивИменРеквизитовТабличнойЧастиПроектныеЗадачиНовых, ",");
		
	Для Каждого СтрокаТЧ Из ПроектныеЗадачи Цикл
		
		Движение = Движения.упоСвойстваПроектныхЗадач.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТЧ);
		
		СтрокаТекущиеСвойства = ТаблицаТекущиеСвойства.Найти(СтрокаТЧ.ПроектнаяЗадача, "ПроектнаяЗадача");
		НайденыТекущиеСвойства = СтрокаТекущиеСвойства <> Неопределено;
		Если НайденыТекущиеСвойства Тогда
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТекущиеСвойства,, СтрокаИменаСвойствДляЗаписи);
		Иначе
			СтрокаТекущиеСвойства = ПараметрыЗаполненияНовойЗадачи;	
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТекущиеСвойства,, СтрокаИменаСвойствДляЗаписиНовых);	
		КонецЕсли;	
		
		ЗаполнитьРесурсВыводитьВСводныйСтатусОтчет(НайденыТекущиеСвойства, Движение, СтрокаТекущиеСвойства);
		
		Если НЕ ПерезаписатьНормуСтоимостиТрудовыхРесурсов Тогда
			Движение.НормаСтоимостиТрудовыхРесурсов = СтрокаТекущиеСвойства.НормаСтоимостиТрудовыхРесурсов;
		КонецЕсли;
		Если НЕ ПерезаписатьНормуСтоимости Тогда
			Движение.НормаСтоимости = СтрокаТекущиеСвойства.НормаСтоимости;
		КонецЕсли;
		Если НЕ ПерезаписатьНормуСтоимостиОбъемы Тогда
			Движение.НормаСтоимостиОбъемы = СтрокаТекущиеСвойства.НормаСтоимостиОбъемы;
		КонецЕсли;
		Если НЕ ПерезаписатьВключитьМатРесурсыВПланРасходов Тогда
			Движение.ВключитьМатРесурсыВПланРасходов = СтрокаТекущиеСвойства.ВключитьМатРесурсыВПланРасходов;
		КонецЕсли;
		Если ВерсияРеализации < 33 Тогда
			Движение.Объект = СтрокаТекущиеСвойства.Объект;
		КонецЕсли;
		Если ВерсияРеализации < 34 Тогда
			Движение.ВнешняяНормаСтоимостиТрудовыхРесурсов = СтрокаТекущиеСвойства.ВнешняяНормаСтоимостиТрудовыхРесурсов;
		КонецЕсли;
		
		Движение.Длительность = 
			Движение.ДлительностьМоделиПакетаРабот * Движение.ЕдиницаНормированияДлительности.Коэффициент;
		
		ЗаполнитьСтандартныеПараметрыДляЗаписиРС(Движение);

	КонецЦикла;
	
КонецПроцедуры 

// Смена записываемй версии производится программно через доп.свойство "Версия". По умолчанию - текущая версия проекта.
// ВАЖНО: в текущей версии реализации не формируются актуальные трудозатраты по версии.
//
Функция УстановитьВерсиюПроекта(ДополнительныеСвойства)
	
	ТекВерсия = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Проект);
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Версия) Тогда
		
		ДополнительныеСвойства.Свойство("Версия", ЭтотОбъект.Версия);
		Если Не ЗначениеЗаполнено(ЭтотОбъект.Версия) Тогда 
			ЭтотОбъект.Версия = ТекВерсия;
		КонецЕсли;
		
	КонецЕсли;
	
	// Версия проекта должна быть в доп.свойствах для корректного построения иерархии при расчете процентов готовности.
	ДополнительныеСвойства.Вставить("Версия", ЭтотОбъект.Версия);
	
	ЭтоПроведениеПоТекущейВерсии = ЭтотОбъект.Версия = ТекВерсия;
	
	Возврат ЭтоПроведениеПоТекущейВерсии;
	
КонецФункции

// Фактические даты расчитываются при изменениях строки структуры интерактивно и записываются напрямую 
// табличной частью документа СДП. Дополнительный расчет требуется для случая автоматического расчета 
// % готовности этапов, когда в движениях появляются записи по этапам, отсутствующие в ТЧ документа. 
// Для этих записей рассчитываем фактические даты начала/окончания.
//
Процедура РасчетФактическихДатНачалаИОкончанияПроектныхЗадач(Отказ)
	
	// Отключение автоматического расчета требуется при свертке регистров.
	Если ДополнительныеСвойства.Свойство("ОтключитьАвтоматическийРасчетГотовности") 
		И ДополнительныеСвойства.ОтключитьАвтоматическийРасчетГотовности = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Косвенный признак расчета этапов - количество записей статусов, 
	// превышающее количество измененных фактических дат.
	НуженРасчетФактическихДат = Движения.упоФактическиеДатыНачалаИОкончанияПроектныхЗадач.Количество() 
		<> Движения.упоСтатусыПроектныхЗадач.Количество();
		
	Если Не НуженРасчетФактическихДат Тогда
		Возврат;
	КонецЕсли;
	
	упоПроведениеДокументовСервер.РасчетФактическихДатНачалаИОкончанияПроектныхЗадач(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Функция ИспользоватьИнкрементВДвиженияхПланаДР(ТаблицаДвиженийПоПодразделениям, 
	ТаблицаДвиженийБезУчетаПрофиля)
	
	ИспользоватьИнкрементВремени = Истина;
	
	СтруктураКолонокСвертывания = ПолучитьСтруктуруКолонокСвертывания("упоДанныеПлановДоходовИРасходовБезПрофиля");
	ТаблицаДвиженийБезУчетаПрофиля.Свернуть(СтруктураКолонокСвертывания.КолонкиГруппировок, 
		СтруктураКолонокСвертывания.КолонкиСумм);

	Если ТаблицаДвиженийПоПодразделениям.Количество() = ТаблицаДвиженийБезУчетаПрофиля.Количество() Тогда 
		ИспользоватьИнкрементВремени = Ложь;
	КонецЕсли;
	
	Возврат ИспользоватьИнкрементВремени;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
                        |en = 'Invalid object call on the client.'");
#КонецЕсли
