////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с разграничемнием доступа.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Базовая Функция. Для заданного документа по его правилам определяет отказ от текущего режима документа.
// 
// Параметры:
//  ЭтотОбъект - ДокументОбъект - документ.
//  Режим     - РежимЗаписиДокумента, Строка - Если режим записи, то проведение или отмена проведения.
//				Если строка, то режим открытия формы (используется по умолчанию).
//  Отказ     - Булево - признак отказа от режима документа.
//  Заголовок - Строка - текст заголовка сообщения.
//	ВыводитьСообщенияОРазграниченииПрав - Булево - признак необходимости выводить сообщения о разграничении прав.
//											По умолчанию = ложь и запись делается только в ЖР.
// 
// Возвращаемое значение:
//  Булево - признак отказа.
//
Функция обПроверитьПравилаРазграничения(ЭтотОбъект, Режим = "Форма", Отказ = Ложь, Заголовок = "", 
	ВыводитьСообщенияОРазграниченииПрав = Ложь) Экспорт
		
	// Если уже был отказ, то отменяем действия функции.
	Если Отказ = Истина Тогда
		Возврат ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверка правил доступа может быть директивно отключена
	// либо администратором ИБ (при помощи константы)
	// либо разработчиком, временно, для проведения некоей операции (при помощи параметра сеанса).
		
	Если РазграничениеДоступаОтключено() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получим правила для данного документа.
	ПравилаОбъекта = ПолучитьПравилаРазграничения(ЭтотОбъект.Ссылка);
	// Скорректируем правила в соответствии с доп. свойствами объекта.
	КорректироватьПравилаРазграниченияОбъекта(ПравилаОбъекта, ЭтотОбъект);
		
	Если ПравилаОбъекта = Неопределено Тогда
		// Для данного документа правила не имеют смысла.
		Возврат Ложь;
	КонецЕсли;	
	
	Если ТипЗнч(ПравилаОбъекта) = Тип("Массив") Тогда
		ВсеПравила = ПравилаОбъекта;
	Иначе
		ВсеПравила = Новый Массив;
		ВсеПравила.Добавить(ПравилаОбъекта);
	КонецЕсли;
		
	Для Каждого Правила Из ВсеПравила Цикл
		
		// Получим данные для разграничения правил данного документа.
		Данные = ПолучитьДанныеРазграничения(Правила);
			
		ОписаниеПравила = Неопределено;
		ВидОграничения	= Неопределено;
		
		// Ищем правило для разграничения по существованию актуализации проекта.
		Если Правила.Свойство("АктуализацияПроекта", ОписаниеПравила) Тогда
			Если Данные.АктуализацияПроекта = Истина Тогда
				Если ОписаниеПравила.Свойство("Есть", ВидОграничения) Тогда				
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						СтрокаСообщения = НСтр("ru = 'По этому проекту уже была проведена актуализация.'");
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						Возврат Истина;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;					
		
		ПрерватьВыполнение = Ложь;
		
		НашлосьОграничение = ЕстьОграничениеПоСтатусамПроектов(Правила, 
																Данные, 
																ЭтотОбъект, 
																ПрерватьВыполнение, 
																Режим, 
																Отказ, 
																Заголовок, 
																ВыводитьСообщенияОРазграниченииПрав);
		Если ПрерватьВыполнение Тогда
			Возврат НашлосьОграничение;
		КонецЕсли;		
				
		НашлосьОграничение = ЕстьОграничениеПоСтатусамЗадач(Правила, 
																Данные, 
																ЭтотОбъект, 
																ПрерватьВыполнение, 
																Режим, 
																Отказ, 
																Заголовок, 
																ВыводитьСообщенияОРазграниченииПрав);
		Если ПрерватьВыполнение Тогда
			Возврат НашлосьОграничение;
		КонецЕсли;
				
		НашлосьОграничение = ЕстьОграничениеПоВладению(Правила, 
																Данные, 
																ЭтотОбъект, 
																ПрерватьВыполнение, 
																Режим, 
																Отказ, 
																Заголовок, 
																ВыводитьСообщенияОРазграниченииПрав);
		Если ПрерватьВыполнение Тогда
			Возврат НашлосьОграничение;
		КонецЕсли;		
									
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Устанавливает доступ к колонке табличной части.
//
// Параметры:
//  ТП			 - Произвольный - табличная часть.
//  ИмяКолонки	 - Строка 		- имя колонки.
//  Доступ		 - Строка 		- значения: "Отсутствует" (по умолчанию), "Просмотр", "Редактирование".
//  УправляемаяФорма - Булево 		- признак вызова из управляемой формы.
//
// Возвращаемое значение:
//	Неопределено - не возвращает зачение.
//
Функция обУстановитьДоступККолонке(ТП, ИмяКолонки, Доступ = "Отсутствует", УправляемаяФорма = Ложь) Экспорт
	
	Если УправляемаяФорма Тогда
		
		Если Доступ = "Отсутствует" Тогда
			ТП[ИмяКолонки].Видимость = Ложь;
		ИначеЕсли Доступ = "Просмотр" Тогда
			ТП[ИмяКолонки].ТолькоПросмотр = Истина;
		ИначеЕсли Доступ = "Редактирование" Тогда
			ТП[ИмяКолонки].Видимость = Истина;
			ТП[ИмяКолонки].ТолькоПросмотр = Ложь;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЕсли; 
	
	Колонки = ТП.Колонки;
	Если Доступ = "Отсутствует" Тогда
		Колонки[ИмяКолонки].Видимость = Ложь;
		Колонки[ИмяКолонки].ИзменятьНастройку = Ложь;
		Попытка 
			ТП.ОтборСтрок.Удалить(ТП.ОтборСтрок.Индекс(ТП.ОтборСтрок[ИмяКолонки]));
		Исключение
		КонецПопытки;
	ИначеЕсли Доступ = "Просмотр" Тогда
		Колонки[ИмяКолонки].ТолькоПросмотр = Истина;
	ИначеЕсли Доступ = "Редактирование" Тогда
		Колонки[ИмяКолонки].Видимость = Истина;
		Колонки[ИмяКолонки].ТолькоПросмотр = Ложь;
		Колонки[ИмяКолонки].ИзменятьНастройку = Истина;
	КонецЕсли;
	
КонецФункции

// Устанавливает доступ к колонкам табличной части.
//
// Параметры:
//  ЭлементыФормы 	- ЭлементыФормы - элементы формы.
//  ИменаКолонок	- Массив, СписокЗначений - имя колонки.
//  Доступ		 	- Строка - значения: "Отсутствует" (по умолчанию), "Просмотр", "Редактирование".
//
// Возвращаемое значение:
//	Неопределено - не возвращает зачение.
//
Процедура УстановитьДоступККолонкамТабличнойЧасти(ЭлементыФормы, ИменаКолонок, Доступ = "Отсутствует") Экспорт
	
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		обУстановитьДоступККолонке(ЭлементыФормы, ИмяКолонки, Доступ, Истина);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает доступность финансовой информации.
//
// Возвращаемое значение:
//	Строка - доступность финансовой информации. "Отсутствует", "Просмотр" или "Редактирование".
//
Функция обДоступностьФинансовойИнформации() Экспорт
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("упоДоступностьФинансовойИнформацииРедактирование") Тогда
		Результат = "Редактирование";
	ИначеЕсли РольДоступна("упоПроектнаяЗадачаРедактированиеТолько_ДР_ДДС") Тогда
		Результат = "РедактированиеТолько_ДР_ДДС";
	ИначеЕсли РольДоступна("упоДоступностьФинансовойИнформацииПросмотр") Тогда
		Результат = "Просмотр";
	Иначе
		Результат = "Отсутствует";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция - Разграничение доступа отключено
// 
// Возвращаемое значение:
//  Булево - Результат
//
Функция РазграничениеДоступаОтключено() Экспорт 
	
	Возврат ПараметрыСеанса.упоОтключитьПроверкуОграничений 
		Или Константы.упоОтключитьРазграничениеДоступаКДокументам.Получить();
	
КонецФункции 

// Функция - Разграничение доступа отключено для объекта
//
// Параметры:
//  Объект	 - ДокументОбъект, СправочникОбъект, НаборЗаписей - Проверяемый объект
// 
// Возвращаемое значение:
//  Булево - Результат
//
Функция РазграничениеДоступаОтключеноДляОбъекта(Объект) Экспорт
	
	Отключено = Объект.ДополнительныеСвойства.Свойство("НеПроверятьРазграничениеДоступа") 
		И Объект.ДополнительныеСвойства.НеПроверятьРазграничениеДоступа;
		
	Отключено = Отключено Или РазграничениеДоступаОтключено();
	
	Возврат Отключено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Внутренняя процедура. Добавляет правило в заданную структура по заданному ключу и значению.
// Предварительно по определенному закону преобразовывает значение в бинарный вид (в разработке).
// 
// Параметры:
//  Правило - Структура, содержит общее правило.
//  Ключ    - Строка, имя ключа струтуры,  название некоторого значения правила.
//  Правило - Строка, собственно само значение правила.
// 
Процедура _ДобавитьПравило(Правило, Ключ, Значение)
	
	// Фильтруем значения без ограничений.
	Если Значение = "+++" Тогда
		Возврат;
	КонецЕсли;
	
	Правило.Вставить(Ключ, Значение);
	
КонецПроцедуры

// Внутренняя функция. Проверяет ограничение по заданному значению правила и режиму поведения документа.
// Так же, формирует сообщение для нужного режима документа, по заданному тексту.
// 
// Параметры:
//  Режим           - РежимЗаписиДокумента:
//                         - Проведение, режим проведение документа.
//                         - ОтменаПроведения, режим отмены проведения документа.
//                  - Строка:
//                         - "Форма", режим открытия формы.
//  ВидОграничения  - Строка, значение некоего правила.
//  СтрокаСообщения - Строка, текст сообщения.
//  Отказ           - Булево, признак отказа от режима документа.
//  Заголовок       - Строка, текст заголовка сообщения.
// 
// Возвращаемое значение:
// 	Булево - Истина, есть ограничение по значению правила. Ложь, нет ограничения по значению правила.
// 
Функция _ЕстьОграничение(Режим, ВидОграничения)

	ЕстьОграничение = Ложь;

	Если Режим = РежимЗаписиДокумента.Проведение Тогда
		Если ВидОграничения = "---" Или ВидОграничения = "+--" Или ВидОграничения = "--+" Или ВидОграничения = "+-+" Тогда
			// Запрещаем проведение.
			ЕстьОграничение = Истина;
		КонецЕсли;
	ИначеЕсли Режим = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ВидОграничения = "---" Или ВидОграничения = "+--" Или ВидОграничения = "-+-" Или ВидОграничения = "++-" Тогда
			// Запрещаем отмену проведения.
			ЕстьОграничение = Истина;
		КонецЕсли;
	ИначеЕсли Режим = "Форма" Тогда
		Если ВидОграничения = "---" Или ВидОграничения = "-+-" Или ВидОграничения = "--+" Или ВидОграничения = "-++" Тогда
			// Признак только чтение.
			ЕстьОграничение = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОграничение;

КонецФункции

Функция ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав = Ложь, СсылкаНаОбъект = Неопределено) 
	
	ПараметрыОшибки = Новый Структура;
	ПараметрыОшибки.Вставить("Событие", "Ограничение доступа");
	ПараметрыОшибки.Вставить("Уровень", УровеньЖурналаРегистрации.Ошибка);		
	ПараметрыОшибки.Вставить("Комментарий", СтрокаСообщения);		
	Если СсылкаНаОбъект <> Неопределено И ТипЗнч(СсылкаНаОбъект) <> Тип("Структура") Тогда
		ПараметрыОшибки.Вставить("Данные", СсылкаНаОбъект);
	Иначе	
		ПараметрыОшибки.Вставить("Данные", Неопределено);
	КонецЕсли;		
	обСообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок, ПараметрыОшибки, , ВыводитьСообщенияОРазграниченииПрав);
		
КонецФункции

// Внутренняя функция. Проверяет принадлежность заданного значения заданному списку значений.
// 
// Параметры:
//  Список   - СписокЗначений.
//  Значение - Произвольный.
// 
// Возвращаемое значение:
//	Булево - Истина, значение есть в списке; Ложь, значения нет в списке.
// 
Функция _ЕстьВСписке(Список, Значение)
	
	// РЛС.
	Если ТипЗнч(Значение) = Тип("Соответствие") Тогда
		естьВСписке = Ложь;
		Для каждого элементЗначения Из Значение Цикл
			Если НЕ Список.НайтиПоЗначению(элементЗначения.Ключ) = Неопределено Тогда
				естьВСписке = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат естьВСписке;
	Иначе
		Если Список.НайтиПоЗначению(Значение) = Неопределено Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
	
// Функция для заданного документа формирует набор правил поведения.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.
// 
// Возвращаемое значение:
//   Структура - сформированный набор правил, в начале структуры идут параметры документа,
//                 затем структура набора правил: ОписаниеПравила - Структура,
//                 содержит поля вида: название правила и его значение.
// 
Функция ПолучитьПравилаРазграничения(ДокументСсылка)
	
	Правила = Новый Структура;
	Правила.Вставить("Проект");
	Правила.Вставить("МассивПроектов");
	Правила.Вставить("ПроектнаяЗадача");
	Правила.Вставить("МассивПроектныхЗадач");
	Правила.Вставить("Подразделение");
	Правила.Вставить("ОбъектБазовогоПлана");
	
	Если ТипЗнч(ДокументСсылка) = Тип("Структура") Тогда
		Если ДокументСсылка.ИмяОбъекта = "упоУпрощенныйВводСтруктурыПроекта" Тогда
			
			// Ограничение по статусу проекта.
			Правила.Вставить("Проект", ДокументСсылка.Проект);
			
			ОписаниеПравила = Новый Структура;
			Правила.Вставить("СтатусПроекта", ОписаниеПравила);
			
			_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
			_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
			_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
			_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
			_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
						
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоРегистрацияПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "---");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "---");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		_ДобавитьПравило(ОписаниеПравила, "Остановлен"  , "---");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "+++");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоУтверждениеПланаПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "---");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		_ДобавитьПравило(ОписаниеПравила, "Остановлен"  , "---");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "???");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоСтартПроектныхРабот.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "---");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		_ДобавитьПравило(ОписаниеПравила, "Остановлен"  , "---");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "+++");
		
		// Ограничение по существованию актуализации.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("АктуализацияПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Есть", "++-");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоЗавершениеПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++"); 	
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Остановлен"  , "+++");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "???");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоВозобновлениеПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "---");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "---"); 	
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Остановлен"  , "+++");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "???");	
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоОстановкаПроектныхРабот.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "---");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "---");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "+++");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "+++");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоРасчетКалендарногоПланаПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоАктуализацияПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "---");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "---");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоРучнаяАктуализацияПроекта.Имя) Тогда
		
		МассивПроектныхЗадач = ПолучитьЗадачиРучнойАктуализации(ДокументСсылка);
		
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		Правила.Вставить("МассивПроектныхЗадач", МассивПроектныхЗадач);
	
		ОписаниеПравила = Новый Структура;
		
		// Ограничение по статусу проекта.
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "---");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "---");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");		
		
		// Ограничение по руководителю проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"   ,  "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");

		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоСохранениеДанныхПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "+++");
		
		// Ограничение по руководителю проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЭ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");		
		
		МассивИгнорируемыхТЧ = Новый Массив;
		МассивИгнорируемыхТЧ.Добавить("РасчетныеСроки");
		МассивПроектныхЗадач = упоПроектыИЗадачиСервер.ПолучитьМассивЗадачСохраненияДанныхПроекта(ДокументСсылка, МассивИгнорируемыхТЧ);
		
		Правила.Вставить("МассивПроектныхЗадач", МассивПроектныхЗадач);
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоПрогнозТрудозатратПоРолям.Имя) Тогда
		
		ДанныеПрогноза = ПолучитьДанныеПрогнозаТрудозатратПоРолям(ДокументСсылка);
		
		Правила.Вставить("МассивПроектов", ДанныеПрогноза.МассивПроектов);
		Правила.Вставить("МассивПроектныхЗадач", ДанныеПрогноза.МассивЗадач);
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектов", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
		
		// Ограничение по статусу проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусыПроектов", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
		
		// Ограничение по статусу проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусыПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         	, "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирована"  	, "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется"    	, "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершена"		, "---");	
		_ДобавитьПравило(ОписаниеПравила, "Закрыта"			, "---");
		
	ИначеЕсли упоИнтеграцияКлиентСервер.ДоступенФункционалРаспределениеКосвенныхРасходов()
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоРаспределениеРасходовПоПроектамФакт.Имя) Тогда
		
		ДанныеРаспределения = ПолучитьДанныеРаспределенияРасходовПоПроектам(ДокументСсылка);
		
		Правила.Вставить("МассивПроектов", ДанныеРаспределения.МассивПроектов);
		Правила.Вставить("МассивПроектныхЗадач", ДанныеРаспределения.МассивЗадач);
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектов", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
		
		// Ограничение по статусу проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусыПроектов", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
		
		// Ограничение по статусу проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусыПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         	, "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирована"  	, "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется"    	, "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершена"		, "+++");	
		_ДобавитьПравило(ОписаниеПравила, "Закрыта"			, "---");
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоПланированиеТрудозатратПоТрудовымРесурсам.Имя) Тогда
		
		ДанныеПрогноза = ПолучитьДанныеПланированияТрудозатратПоТрудовымРесурсам(ДокументСсылка);
		
		Правила.Вставить("МассивПроектов", ДанныеПрогноза.МассивПроектов);
		Правила.Вставить("МассивПроектныхЗадач", ДанныеПрогноза.МассивЗадач);
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектов", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
		
		// Ограничение по статусу проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусыПроектов", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководителиПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
							
		// Ограничение по статусу проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусыПроектныхЗадач", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         	, "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирована"  	, "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется"    	, "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершена"		, "---");
		_ДобавитьПравило(ОписаниеПравила, "Закрыта"			, "---");
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоПроектнаяЗадача.Имя) Тогда
		Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Проект");
		
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по статусу проектной задачи.
		Правила.Вставить("ПроектнаяЗадача", ДокументСсылка);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроектнойЗадачи", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Запланирована", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется"  , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершена"    , "---");
		_ДобавитьПравило(ОписаниеПравила, "Закрыта"		 , "---");
		
		// Ограничение по руководителю проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроектнойЗадачи", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
								
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоИзменениеРуководителяПроекта.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "+++");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроект.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");

	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоИзменениеРуководителяПроектнойЗадачи.Имя) Тогда
		
		ПроектныеДанные = ПроектПроектныеЗадачиДокумента(ДокументСсылка);
		
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ПроектныеДанные.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");					
		
		// Ограничение по статусу проектной задачи.
		Правила.Вставить("ПроектнаяЗадача", ПроектныеДанные.ПроектнаяЗадача);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроектнойЗадачи", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Запланирована", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется"  , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершена"    , "---");
		_ДобавитьПравило(ОписаниеПравила, "Закрыта"		 , "---");
		
		// Ограничение по руководителю проектной задачи.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроектнойЗадачи", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");		
		_ДобавитьПравило(ОписаниеПравила, "РПЭ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "---");		
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоНазначениеТрудовыхРесурсовНаПроектнуюЗадачу.Имя) Тогда
		ПроектнаяЗадача = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ПроектнаяЗадача");
		Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроектнаяЗадача, "Проект");
		
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "+++");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "---");
		
		// Ограничение по руководителю проектной задачи.
		Правила.Вставить("ПроектнаяЗадача", ПроектнаяЗадача);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроектнойЗадачи", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоЗакрытиеЭтапа.Имя) Тогда
		// Ограничение по статусу проекта.
		Правила.Вставить("Проект", ДокументСсылка.Проект);
		
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("СтатусПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "Нет"         , "---");
		_ДобавитьПравило(ОписаниеПравила, "Запланирован", "---");
		_ДобавитьПравило(ОписаниеПравила, "Утвержден"   , "---");
		_ДобавитьПравило(ОписаниеПравила, "Выполняется" , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Завершен"    , "+++");
		
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоРегистрацияПоказателейПроекта.Имя) 
		Или (Не упоИнтеграцияКлиентСерверПовтИсп.ЭтоPM_Проф() 
		И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка." + Метаданные.Документы.упоРегистрацияПоказателейЭффективностиПроекта.Имя)) Тогда
		
		ПроектДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Проект");
		
		ПроектнаяЗадачаДокумент = упоПроектыИЗадачиСервер.НайтиСвязанныйЭлементПроекта(ПроектДокумента);
		ЕстьПЗ = ЗначениеЗаполнено(ПроектнаяЗадачаДокумент);
		
		Правила.Вставить("Проект", ПроектДокумента);
		Если ЕстьПЗ Тогда
			Правила.Вставить("ПроектнаяЗадача", ПроектнаяЗадачаДокумент);
		КонецЕсли;	
				
		// Ограничение по руководителю проекта.
		ОписаниеПравила = Новый Структура;
		Правила.Вставить("РуководительПроекта", ОписаниеПравила);
		Если ЕстьПЗ Тогда
			Правила.Вставить("РуководительПроектнойЗадачи", ОписаниеПравила);
		КонецЕсли;	
		
		_ДобавитьПравило(ОписаниеПравила, "РП"    , "+++");
		Если ЕстьПЗ Тогда 
			_ДобавитьПравило(ОписаниеПравила, "РПЗ"   , "+++");
		КонецЕсли;	
		_ДобавитьПравило(ОписаниеПравила, "Прочие", "---");				
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Правила;
	
КонецФункции

// Корректирует правила в соответствии с доп. свойствами объекта.
//
// Параметры:
//  ПравилаОбъекта	 - Структура	 - правила разграничения объекта.
//  ЭтотОбъект		 - Произвольный	 - объект, у которого проверяем доп. свойства и правила которого корректируем.
//
Процедура КорректироватьПравилаРазграниченияОбъекта(ПравилаОбъекта, ЭтотОбъект)
	
	Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект." + Метаданные.Документы.упоСохранениеДанныхПроекта.Имя) Тогда
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЕстьПравоИзменятьЧужиеПроектныеЗадачи")
			И ЭтотОбъект.ДополнительныеСвойства.ЕстьПравоИзменятьЧужиеПроектныеЗадачи = Истина Тогда
			
			Если ПравилаОбъекта.Свойство("РуководителиПроектныхЗадач") 
				И ТипЗнч(ПравилаОбъекта.РуководителиПроектныхЗадач) = Тип("Структура")
				И ПравилаОбъекта.РуководителиПроектныхЗадач.Свойство("Прочие") Тогда
				
				ПравилаОбъекта.РуководителиПроектныхЗадач.Удалить("Прочие")
			
			КонецЕсли;
		
		КонецЕсли;
		
	// Если проводится документ ПЗ, созданный вручную или полученный при разворачивании из шаблона, 
	// то его свойства еще не записаны. Поэтому родителя для определения РПЭ берем непосредственно из документа.	
	ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект." + Метаданные.Документы.упоПроектнаяЗадача.Имя) Тогда
				
		ПравилаОбъекта.Вставить("ПроектнаяЗадачаРодитель", ЭтотОбъект.ЗадачаРодитель);					
			
	КонецЕсли;
	
КонецПроцедуры

// Функция по заданному набору правил документа, запрашивает необходимые данные из БД.
// 
// Параметры:
//  Правила - Структура, сформированный набор правил, в начале структуры идут параметры документа,
//                            затем структура набора правил: ОписаниеПравила - Структура,
//                            содержит поля вида: название правила и его значение.
// 
// Возвращаемое значение:
//	Структура - сформированный набор параметров для правил.
// 
Функция ПолучитьДанныеРазграничения(Правила)
	
	Данные = Новый Структура;
	Данные.Вставить("СтатусПроекта");
	Данные.Вставить("СтатусыПроектов");
	
	Данные.Вставить("СтатусПроектнойЗадачи");
	Данные.Вставить("СтатусыПроектныхЗадач");
	
	Данные.Вставить("РуководительПроекта");
	Данные.Вставить("РуководителиПроектов");
	
	Данные.Вставить("РуководительПроектнойЗадачи");
	Данные.Вставить("РуководителиПроектныхЗадач");
	
	Данные.Вставить("РуководительПроектногоЭтапа");	
	
	Данные.Вставить("АктуализацияПроекта");	
	
	Запрос = Новый Запрос;
	
	ТекВерсияПроекта = упоВерсионирование.ПолучитьТекущуюВерсиюПроекта(Правила.Проект);
	
	Запрос.УстановитьПараметр("Проект"         , Правила.Проект);
	Запрос.УстановитьПараметр("текВерсия"      , ТекВерсияПроекта);
	Запрос.УстановитьПараметр("ПроектнаяЗадача", Правила.ПроектнаяЗадача);
	Запрос.УстановитьПараметр("Объект"         , Правила.ОбъектБазовогоПлана);
	
	Если Не Правила.Проект = Неопределено Тогда
		// Получим статус проекта.
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыПроектов.СтатусПроекта
			|ИЗ
			|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект = &Проект) КАК СтатусыПроектов";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Данные.Вставить("СтатусПроекта", РезультатЗапроса.Выгрузить()[0].СтатусПроекта);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Не Правила.ПроектнаяЗадача = Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыПроектныхЗадач.СтатусЗадачи КАК СтатусЗадачи
			|ИЗ
			|	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
			|			,
			|			Версия = &текВерсия
			|				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК СтатусыПроектныхЗадач";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Данные.Вставить("СтатусПроектнойЗадачи", РезультатЗапроса.Выгрузить()[0].СтатусЗадачи);
		КонецЕсли;
	КонецЕсли;
				
	// Получим данные по руководителю проекта.
	Если НЕ Правила.Проект = Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РуководителиПроектов.РуководительПроекта
			|ИЗ
			|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект = &Проект) КАК РуководителиПроектов";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Данные.Вставить("РуководительПроекта", РезультатЗапроса.Выгрузить()[0].РуководительПроекта);
		КонецЕсли;
	КонецЕсли;
	
	// Получим данные по руководителям и статусам проектов.
	Если НЕ Правила.МассивПроектов = Неопределено Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РуководителиПроектов.Проект,
			|	РуководителиПроектов.РуководительПроекта
			|ИЗ
			|	РегистрСведений.упоРуководителиПроектов.СрезПоследних(, Проект В (&МассивПроектов)) КАК РуководителиПроектов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	упоСтатусыПроектовСрезПоследних.Проект,
			|	упоСтатусыПроектовСрезПоследних.СтатусПроекта
			|ИЗ
			|	РегистрСведений.упоСтатусыПроектов.СрезПоследних(, Проект В (&МассивПроектов)) КАК упоСтатусыПроектовСрезПоследних";			
		Запрос.УстановитьПараметр("МассивПроектов", Правила.МассивПроектов); 	
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Данные.Вставить("РуководителиПроектов", РезультатЗапроса[0].Выгрузить());	
		Данные.Вставить("СтатусыПроектов", РезультатЗапроса[1].Выгрузить());	
	КонецЕсли;	
	
	// Получим данные по руководителю проектной задачи и этапа-родителя.
	Если НЕ Правила.ПроектнаяЗадача = Неопределено Тогда
		
		// РПЗ
		
		РПЗ = упоИерархияИПолномочияСервер.ПолучитьВсехРуководителейПроектнойЗадачиПоИерархии(Правила.ПроектнаяЗадача);
		Данные.Вставить("РуководительПроектнойЗадачи", РПЗ);
		
		// РПЭ
		
		РПЭ = Неопределено;
		
		Если Правила.Свойство("ПроектнаяЗадачаРодитель") Тогда 			
			РПЭ = упоИерархияИПолномочияСервер.ПолучитьРуководителяПроектнойЗадачиПоИерархии(Правила.ПроектнаяЗадачаРодитель);										
		Иначе				
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РуководительПроектногоЭтапа
			               |ИЗ
			               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
			               |			,
			               |			Версия = &ТекВерсия
			               |				И ПроектнаяЗадача = &ПроектнаяЗадача) КАК упоСвойстваПроектныхЗадачСрезПоследних
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
			               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда				
				РПЭ = Выборка.РуководительПроектногоЭтапа;
			КонецЕсли;			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(РПЭ) Тогда	
			Данные.Вставить("РуководительПроектногоЭтапа", РПЭ); 
		КонецЕсли;
			
	КонецЕсли;
	
	// Получим данные по руководителям проектных задач.
	Если НЕ Правила.МассивПроектныхЗадач = Неопределено Тогда
		ТаблицаПЗ = ПолучитьРуководителейПЗ(Правила.МассивПроектныхЗадач, ТекВерсияПроекта);
		Данные.Вставить("РуководителиПроектныхЗадач", ТаблицаПЗ);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоПроектнаяЗадача.Ссылка КАК ПроектнаяЗадача,
		               |	упоПроектнаяЗадача.Проект КАК Проект
		               |ПОМЕСТИТЬ ПроектныеЗадачиСПроектами
		               |ИЗ
		               |	Документ.упоПроектнаяЗадача КАК упоПроектнаяЗадача
		               |ГДЕ
		               |	упоПроектнаяЗадача.Ссылка В(&МассивЗадач)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПроектныеЗадачиСПроектами.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	упоВерсииПроекта.Версия КАК Версия
		               |ПОМЕСТИТЬ ТекущиеВерсииПроектныхЗадач
		               |ИЗ
		               |	ПроектныеЗадачиСПроектами КАК ПроектныеЗадачиСПроектами
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоВерсииПроекта КАК упоВерсииПроекта
		               |		ПО ПроектныеЗадачиСПроектами.Проект = упоВерсииПроекта.Проект
		               |			И (упоВерсииПроекта.Текущая)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	упоСтатусыПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
		               |	упоСтатусыПроектныхЗадачСрезПоследних.СтатусЗадачи КАК СтатусЗадачи
		               |ИЗ
		               |	РегистрСведений.упоСтатусыПроектныхЗадач.СрезПоследних(
		               |			,
		               |			(Версия, ПроектнаяЗадача) В
		               |				(ВЫБРАТЬ
		               |					ТекущиеВерсииПроектныхЗадач.Версия,
		               |					ТекущиеВерсииПроектныхЗадач.ПроектнаяЗадача
		               |				ИЗ
		               |					ТекущиеВерсииПроектныхЗадач)) КАК упоСтатусыПроектныхЗадачСрезПоследних";
		Запрос.УстановитьПараметр("МассивЗадач", Правила.МассивПроектныхЗадач);					   
		Данные.Вставить("СтатусыПроектныхЗадач", Запрос.Выполнить().Выгрузить());		

	КонецЕсли;
	
	Если Правила.Свойство("АктуализацияПроекта") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Док.Ссылка
			|ИЗ
			|	Документ.упоАктуализацияПроекта КАК Док
			|ГДЕ
			|	Док.Проект = &Проект
			|	И Док.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Док.Ссылка
			|ИЗ
			|	Документ.упоРучнаяАктуализацияПроекта КАК Док
			|ГДЕ
			|	Док.Проект = &Проект
			|	И Док.Проведен";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Данные.Вставить("АктуализацияПроекта", Истина);
		Иначе
			Данные.Вставить("АктуализацияПроекта", Ложь);
		КонецЕсли;
	КонецЕсли;
		
	Возврат Данные;
	
КонецФункции

Функция ПолучитьЗадачиРучнойАктуализации(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	упоРучнаяАктуализацияПроектаПроектныеЗадачи.ПроектнаяЗадача КАК ПроектнаяЗадача 
	               |ИЗ
	               |	Документ.упоРучнаяАктуализацияПроекта.ПроектныеЗадачи КАК упоРучнаяАктуализацияПроектаПроектныеЗадачи
	               |ГДЕ
	               |	упоРучнаяАктуализацияПроектаПроектныеЗадачи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПроектнаяЗадача");
КонецФункции

Функция ПолучитьДанныеПрогнозаТрудозатратПоРолям(Ссылка)
	Возврат Документы.упоПрогнозТрудозатратПоРолям.ПолучитьИзменяемыеЗадачиИПроекты(Ссылка);		
КонецФункции

Функция ПолучитьДанныеРаспределенияРасходовПоПроектам(Ссылка)
	Возврат Документы.упоРаспределениеРасходовПоПроектамФакт.ПолучитьИзменяемыеЗадачиИПроекты(Ссылка);		
КонецФункции

Функция ПолучитьДанныеПланированияТрудозатратПоТрудовымРесурсам(Ссылка)
	Возврат Документы.упоПланированиеТрудозатратПоТрудовымРесурсам.ПолучитьИзменяемыеЗадачиИПроекты(Ссылка);		
КонецФункции

Функция ПолучитьРуководителейПЗ(МассивПЗ, ТекВерсия)
	
	ТаблицаПЗ = Новый ТаблицаЗначений;
	ТаблицаПЗ.Колонки.Добавить("ПроектнаяЗадача", Новый ОписаниеТипов("ДокументСсылка.упоПроектнаяЗадача"));
	Для Каждого ПЗ Из МассивПЗ Цикл
		ТаблицаПЗ.Добавить().ПроектнаяЗадача = ПЗ;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПЗ", ТаблицаПЗ);
	Запрос.УстановитьПараметр("МассивЗадач", МассивПЗ);
	Запрос.УстановитьПараметр("ТекВерсия", ТекВерсия);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача
	               |ПОМЕСТИТЬ ТаблицаПЗ
	               |ИЗ
	               |	&ТаблицаПЗ КАК ТаблицаПЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упоСвойстваПроектныхЗадачСрезПоследних.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК РуководительПроектногоЭтапа
	               |ПОМЕСТИТЬ РуководителиПроектныхЭтапов
	               |ИЗ
	               |	РегистрСведений.упоСвойстваПроектныхЗадач.СрезПоследних(
	               |			,
	               |			Версия = &ТекВерсия
	               |				И ПроектнаяЗадача В (&МассивЗадач)) КАК упоСвойстваПроектныхЗадачСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	               |		ПО упоСвойстваПроектныхЗадачСрезПоследних.ЗадачаРодитель = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПЗ.ПроектнаяЗадача КАК ПроектнаяЗадача,
	               |	упоРуководителиПроектныхЗадачАктуальные.РуководительПроектнойЗадачи КАК Руководитель,
	               |	упоРуководителиПроектовСрезПоследних.РуководительПроекта КАК РуководительПроекта,
	               |	РуководителиПроектныхЭтапов.РуководительПроектногоЭтапа КАК РуководительПроектногоЭтапа
	               |ИЗ
	               |	ТаблицаПЗ КАК ТаблицаПЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектныхЗадачАктуальные КАК упоРуководителиПроектныхЗадачАктуальные
	               |		ПО ТаблицаПЗ.ПроектнаяЗадача = упоРуководителиПроектныхЗадачАктуальные.ПроектнаяЗадача
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упоРуководителиПроектов.СрезПоследних КАК упоРуководителиПроектовСрезПоследних
	               |		ПО ТаблицаПЗ.ПроектнаяЗадача.Проект = упоРуководителиПроектовСрезПоследних.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РуководителиПроектныхЭтапов КАК РуководителиПроектныхЭтапов
	               |		ПО ТаблицаПЗ.ПроектнаяЗадача = РуководителиПроектныхЭтапов.ПроектнаяЗадача";				   
				   
	ТаблицаПЗ = Запрос.Выполнить().Выгрузить();
	ТаблицаПЗ.Индексы.Добавить("Руководитель");
	
	Возврат ТаблицаПЗ;				   
					   
КонецФункции   					   

Функция обЗапретитьРедактированиеРеквизитовПроекта(Проект, СтатусПроекта, ТолькоПросмотр) Экспорт
	
	Если Не ЗначениеЗаполнено(СтатусПроекта) Тогда
		Возврат ТолькоПросмотр;
	КонецЕсли;
	
	РуководительКураторПроекта = упоИерархияИПолномочияСервер.ПолучитьРуководителяИКуратораПроекта(Проект);
	Результат = ТолькоПросмотр Или Не (упоРесурсыИРолиВызовСервера.обУправляетсяДиспетчером(ПользователиКлиентСервер.АвторизованныйПользователь(), РуководительКураторПроекта.РуководительПроекта) 
							Или упоРесурсыИРолиВызовСервера.обУправляетсяДиспетчером(ПользователиКлиентСервер.АвторизованныйПользователь(), РуководительКураторПроекта.КураторПроекта)
							Или РольДоступна("упоРедактированиеКарточекПроектов")
							Или РольДоступна("ПолныеПрава")
							Или РазграничениеДоступаОтключено());	
	Возврат Результат;
	
КонецФункции

Функция ПроектПроектныеЗадачиДокумента(Ссылка, ПроверятьШапку = Истина, ПроверятьТабЧасти = Ложь)
	
	ПроектныеДанные = Новый Структура("Проект, ПроектнаяЗадача, МассивПроектов, МассивПроектныхЗадач");		
	
	ТолькоШапка = ПроверятьШапку И Не ПроверятьТабЧасти;
	
	Если Не ТолькоШапка Тогда
		ПроектныеДанные.МассивПроектов = Новый Массив;
		ПроектныеДанные.МассивПроектныхЗадач = Новый Массив;		
	КонецЕсли;
			
	ПоляЗапроса = Новый Структура;
	
	ТипПроектнаяЗадача = Тип("ДокументСсылка.упоПроектнаяЗадача");
	
	МетаДок = Ссылка.Метаданные();	
	Если ПроверятьШапку Тогда
		Для Каждого Реквизит Из МетаДок.Реквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ТипПроектнаяЗадача) Тогда			
				ПоляЗапроса.Вставить("Шапка", Реквизит.Имя);
			КонецЕсли;				
		КонецЦикла;
	КонецЕсли;		
	Если ПроверятьТабЧасти Тогда
		Для Каждого ТабЧасть Из МетаДок.ТабличныеЧасти Цикл
			СтруктураТЧ = Новый Структура(ТабЧасть.Имя);
			МассивПолей = Новый Массив;
			Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипПроектнаяЗадача) Тогда
					ПоляЗапроса.Вставить(ТабЧасть.Имя, Реквизит.Имя);
				КонецЕсли;	
			КонецЦикла;		
		КонецЦикла;
	КонецЕсли;	
		
	ТекстыЗапроса = Новый Массив;
	
	Для Каждого ЭлементСтруктуры Из ПоляЗапроса Цикл
		Если ПроверятьШапку И ЭлементСтруктуры.Ключ = "Шапка" Тогда
			ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ВЫБРАТЬ
				|	Документ.%1 КАК ПроектнаяЗадача,
				|	Документ.%1.Проект КАК Проект
				|ИЗ
				|	Документ.%2 КАК Документ
				|ГДЕ
	        	|	Документ.Ссылка = &Ссылка
				|", ЭлементСтруктуры.Значение, МетаДок.Имя);
			ТекстыЗапроса.Добавить(ТекстЗапроса);
		Иначе 
			ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ				
				|	Документ.%1 КАК ПроектнаяЗадача,
				|	Документ.%1.Проект КАК Проект
				|ИЗ
				|	Документ.%2.%3 КАК Документ
				|ГДЕ
	        	|	Документ.Ссылка = &Ссылка
				|", ЭлементСтруктуры.Значение, МетаДок.Имя, ЭлементСтруктуры.Ключ);
			ТекстыЗапроса.Добавить(ТекстЗапроса);
		КонецЕсли;	
	КонецЦикла;	
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, 
		"ОБЪЕДИНИТЬ ВСЕ
		|");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();			
	Если Результат.Пустой() Тогда
		Возврат ПроектныеДанные;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл		
		Если ТолькоШапка Тогда
			ПроектныеДанные.ПроектнаяЗадача = Выборка.ПроектнаяЗадача;
			ПроектныеДанные.Проект = Выборка.Проект;
		Иначе	
			Если ПроектныеДанные.МассивПроектныхЗадач.Найти(Выборка.ПроектнаяЗадача) = Неопределено Тогда
				ПроектныеДанные.МассивПроектныхЗадач.Добавить(Выборка.ПроектнаяЗадача);
			КонецЕсли;
			Если ПроектныеДанные.МассивПроектов.Найти(Выборка.Проект) = Неопределено Тогда
				ПроектныеДанные.МассивПроектов.Добавить(Выборка.Проект);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
		
	Возврат ПроектныеДанные;
	
КонецФункции

// Ищем правила для разграничения по владению.
Функция ЕстьОграничениеПоВладению(Правила, Данные, ЭтотОбъект, ПрерватьВыполнение,
	Режим, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав)  
	
	ПрерватьВыполнение = Ложь;
	ОписаниеПравила = Неопределено;
	ВидОграничения	= Неопределено;
	
	// Получим список сотрудников, которыми управляет текущий пользователь.
	СписокСотрудников = упоИерархияИПолномочияСервер.СотрудникиДиспетчера(Пользователи.ТекущийПользователь(), Истина);
	
	// Ищем правило для разграничения по руководителям проектных задач.
	Если Правила.Свойство("РуководителиПроектныхЗадач", ОписаниеПравила) Тогда
		
		НетРазрешений = Ложь;
		
		МассивСообщений = Новый Массив;
		МассивСообщений.Добавить(
			СтрШаблон(НСтр("ru = 'Пользователь ""%1"" не имеет полномочий на выполнение этой операции с задачами:'"),
				Пользователи.ТекущийПользователь()));
		
		СтрокаСообщения = НСтр("ru = '	- %1 (%2)'");
		
		Для Каждого СтрокаПроектнойЗадачи Из Данные.РуководителиПроектныхЗадач Цикл
			
			Если _ЕстьВСписке(СписокСотрудников, СтрокаПроектнойЗадачи.РуководительПроекта) Тогда
				Если ОписаниеПравила.Свойство("РП", ВидОграничения) Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(СтрокаПроектнойЗадачи.ПроектнаяЗадача);
						МассивСообщений.Добавить(СтрШаблон(СтрокаСообщения, Зеркало, СтрокаПроектнойЗадачи.ПроектнаяЗадача));
						
						НетРазрешений = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли _ЕстьВСписке(СписокСотрудников, СтрокаПроектнойЗадачи.Руководитель) Тогда
				Если ОписаниеПравила.Свойство("РПЗ", ВидОграничения) Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(СтрокаПроектнойЗадачи.ПроектнаяЗадача);
						МассивСообщений.Добавить(СтрШаблон(СтрокаСообщения, Зеркало, СтрокаПроектнойЗадачи.ПроектнаяЗадача));
						
						НетРазрешений = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли _ЕстьВСписке(СписокСотрудников, СтрокаПроектнойЗадачи.РуководительПроектногоЭтапа) Тогда
				Если ОписаниеПравила.Свойство("РПЭ", ВидОграничения) Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(СтрокаПроектнойЗадачи.ПроектнаяЗадача);
						МассивСообщений.Добавить(СтрШаблон(СтрокаСообщения, Зеркало, СтрокаПроектнойЗадачи.ПроектнаяЗадача));
						
						НетРазрешений = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если ОписаниеПравила.Свойство("Прочие", ВидОграничения) Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(СтрокаПроектнойЗадачи.ПроектнаяЗадача);
						МассивСообщений.Добавить(СтрШаблон(СтрокаСообщения, Зеркало, СтрокаПроектнойЗадачи.ПроектнаяЗадача));
						
						НетРазрешений = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НетРазрешений Тогда
			ОбработатьОграничение(СтрСоединить(МассивСообщений, Символы.ПС), Отказ, Заголовок, 
				ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
			ПрерватьВыполнение = Истина;
			Возврат Истина;
		КонецЕсли;
		
	/////////////////////////////////////////////////////
		
	// Ищем правило для разграничения по руководителю проектной задачи.
	ИначеЕсли Правила.Свойство("РуководительПроектнойЗадачи", ОписаниеПравила) Тогда
		
		СтрокаСообщения = НСтр("ru = 'Пользователь ""%1"" не имеет полномочий на выполнение этой операции.'"); 
		
		ЕстьРПЗ = _ЕстьВСписке(СписокСотрудников, Данные.РуководительПроектнойЗадачи);
		ЕстьРПЭ = _ЕстьВСписке(СписокСотрудников, Данные.РуководительПроектногоЭтапа);
		
		Если _ЕстьВСписке(СписокСотрудников, Данные.РуководительПроекта) Тогда
			Если ОписаниеПравила.Свойство("РП", ВидОграничения) Тогда
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
												
					СтрокаСообщения = 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь());	
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;

				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ЕстьРПЗ Или ЕстьРПЭ Тогда
			
			ЕстьПраваРПЗ = ЕстьРПЗ;
			Если ЕстьРПЗ И ОписаниеПравила.Свойство("РПЗ", ВидОграничения) Тогда						
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда														
					ЕстьПраваРПЗ = Ложь;
				КонецЕсли;			
			КонецЕсли;
													
			ЕстьПраваРПЭ = ЕстьРПЭ;
			Если ЕстьРПЭ И ОписаниеПравила.Свойство("РПЭ", ВидОграничения) Тогда						
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда														
					ЕстьПраваРПЭ = Ложь;
				КонецЕсли;			
			КонецЕсли;

			Если Не (ЕстьПраваРПЗ Или ЕстьПраваРПЭ) Тогда
														
				СтрокаСообщения =
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь());
				ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
				
				ПрерватьВыполнение = Истина;
				Возврат Истина;
				
			КонецЕсли;	
						
		Иначе
			Если ОписаниеПравила.Свойство("Прочие", ВидОграничения) Тогда						
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
												
					СтрокаСообщения =
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь());
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;

				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	// Ищем правило для разграничения по руководителю проекта.
	ИначеЕсли Правила.Свойство("РуководительПроекта", ОписаниеПравила) Тогда
		
		СтрокаСообщения = НСтр("ru = 'Пользователь ""%1"" не имеет полномочий на выполнение этой операции.'");
		
		Если _ЕстьВСписке(СписокСотрудников, Данные.РуководительПроекта) Тогда
			Если ОписаниеПравила.Свойство("РП", ВидОграничения) Тогда						
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
												
					СтрокаСообщения =
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь());
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоРасчетКалендарногоПланаПроекта") 
			ИЛИ (ТипЗнч(ЭтотОбъект) = Тип("ДанныеФормыСтруктура")
			И ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.упоРасчетКалендарногоПланаПроекта")) Тогда 
			ТаблицаРуководителейПЗ = упоИерархияИПолномочияСервер.ПолучитьРуководителейПроектныхЗадачПроекта(ЭтотОбъект.Проект);				
			
			Если ТаблицаРуководителейПЗ <> Неопределено Тогда
				
				Для Каждого Сотрудник Из СписокСотрудников Цикл					
					Если ТаблицаРуководителейПЗ.Найти(Сотрудник.Значение, "РуководительПроектнойЗадачи") <> Неопределено Тогда						
						
						ПрерватьВыполнение = Истина;
						Возврат Ложь;												
						
					КонецЕсли;					
				КонецЦикла; 
				
			КонецЕсли; 
		ИначеЕсли  ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоРегистрацияПроекта") 
			ИЛИ ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоУтверждениеПланаПроекта")
			ИЛИ ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоЗавершениеПроекта")
			ИЛИ ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоВозобновлениеПроекта")
			ИЛИ ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.упоСтартПроектныхРабот") Тогда
			
			Если Пользователи.ЭтоПолноправныйПользователь( , , Ложь) Тогда
				ПрерватьВыполнение = Истина;
				Возврат Ложь;	
			КонецЕсли;	
			
			Если Данные.РуководительПроекта <> Неопределено Тогда
				РуководительПроекта = Данные.РуководительПроекта;
			Иначе 
				РуководительПроекта = ЭтотОбъект.РуководительПроекта;
			КонецЕсли;
			
			Если Не _ЕстьВСписке(СписокСотрудников, РуководительПроекта) Тогда
				
				СтрокаСообщения =
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь());
				ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
				
				ПрерватьВыполнение = Истина;
				Возврат Истина;
				
			КонецЕсли;	
		Иначе
			Если ОписаниеПравила.Свойство("Прочие", ВидОграничения) Тогда						
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
												
					СтрокаСообщения = 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь());
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);										
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;					
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	// Ищем правило для разграничения по руководителям проектов.
	ИначеЕсли Правила.Свойство("РуководителиПроектов", ОписаниеПравила) Тогда
		
		Для Каждого Проект Из Правила.МассивПроектов Цикл
			
			ДанныеРП = Данные.РуководителиПроектов.Найти(Проект, "Проект"); 
			
			Если ДанныеРП = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаСообщения = НСтр("ru = 'Пользователь ""%1"" не имеет полномочий на выполнение этой операции с проектом ""%2"".'");
			
			Если _ЕстьВСписке(СписокСотрудников, ДанныеРП.РуководительПроекта) Тогда
				Если ОписаниеПравила.Свойство("РП", ВидОграничения) Тогда							
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
														
						СтрокаСообщения =
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь(), Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;
																		
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если ОписаниеПравила.Свойство("Прочие", ВидОграничения) Тогда							
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
														
						СтрокаСообщения = 
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, Пользователи.ТекущийПользователь(), Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;												
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;					
	
	Возврат Ложь;
	
КонецФункции

// Ищем правило для разграничения по статусу/статусам проектных задач.
Функция ЕстьОграничениеПоСтатусамЗадач(Правила, Данные, ЭтотОбъект, ПрерватьВыполнение,
	Режим, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав)  
		
	ПрерватьВыполнение = Ложь;
	ОписаниеПравила = Неопределено;
	ВидОграничения	= Неопределено;

	// Ищем правило для разграничения по статусу проектной задачи.
	Если Правила.Свойство("СтатусПроектнойЗадачи", ОписаниеПравила) Тогда
					
		Если ОписаниеПравила.Свойство("Запланирована", ВидОграничения) Тогда
			Если Данные.СтатусПроектнойЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Запланирована Тогда
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проектная задача находится в состоянии ""Запланирована"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Выполняется", ВидОграничения) Тогда
			Если Данные.СтатусПроектнойЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Выполняется Тогда					
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проектная задача находится в состоянии ""Выполняется"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Завершена", ВидОграничения) Тогда
			Если Данные.СтатусПроектнойЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Завершена Тогда					
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проектная задача находится в состоянии ""Завершена"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Закрыта", ВидОграничения) Тогда
			Если Данные.СтатусПроектнойЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта Тогда					
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проектная задача находится в состоянии ""Закрыта"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;			
		
	КонецЕсли; // Правило по статусу проектной задачи.
	
	// Ищем правило для разграничения по статусам проектных задач.
	Если Правила.Свойство("СтатусыПроектныхЗадач", ОписаниеПравила) Тогда
		
		НашлосьОграничение = Ложь;
		
		ШаблонСообщения = НСтр("ru = 'Проектная задача ""%1"" (%2) находится в состоянии ""%3"".'");
		
		Для Каждого ПроектнаяЗадача Из Правила.МассивПроектныхЗадач Цикл							
			
			ДанныеСтатуса = Данные.СтатусыПроектныхЗадач.Найти(ПроектнаяЗадача, "ПроектнаяЗадача");
			
			Если ДанныеСтатуса = Неопределено Тогда
				Продолжить;
			КонецЕсли;											
			
			Если ОписаниеПравила.Свойство("Запланирована", ВидОграничения) Тогда
				Если ДанныеСтатуса.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Запланирована Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(ПроектнаяЗадача);
													
						СтрокаСообщения = СтрШаблон(ШаблонСообщения, Зеркало, ПроектнаяЗадача, "Запланирована");
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						НашлосьОграничение = Истина;
						Продолжить;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Выполняется", ВидОграничения) Тогда
				Если ДанныеСтатуса.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Выполняется Тогда						
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(ПроектнаяЗадача);
						                                                            							
						СтрокаСообщения = СтрШаблон(ШаблонСообщения, Зеркало, ПроектнаяЗадача, "Выполняется");
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						НашлосьОграничение = Истина;
						Продолжить;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Завершена", ВидОграничения) Тогда
				Если ДанныеСтатуса.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Завершена Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(ПроектнаяЗадача);
													
						СтрокаСообщения = СтрШаблон(ШаблонСообщения, Зеркало, ПроектнаяЗадача, "Завершена");
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						НашлосьОграничение = Истина;
						Продолжить;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Закрыта", ВидОграничения) Тогда
				Если ДанныеСтатуса.СтатусЗадачи = Перечисления.упоСостояниеСтатусаЗадачи.Закрыта Тогда						
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						Зеркало = упоПроектыИЗадачиВызовСервера.обНайтиСвязанныйЭлементПроекта(ПроектнаяЗадача);
													
						СтрокаСообщения = СтрШаблон(ШаблонСообщения, Зеркало, ПроектнаяЗадача, "Закрыта");
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						НашлосьОграничение = Истина;
						Продолжить;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;				
			
		КонецЦикла;
		
		Если НашлосьОграничение Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли; // Правило по статусам проектных задач.	
	
	Возврат Ложь;
	
КонецФункции	

// Ищем правило для разграничения по статусу/статусам проектов.
Функция ЕстьОграничениеПоСтатусамПроектов(Правила, Данные, ЭтотОбъект, ПрерватьВыполнение,
	Режим, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав)
	
	ПрерватьВыполнение = Ложь;
	ОписаниеПравила = Неопределено;
	ВидОграничения	= Неопределено;

	// Ищем правило для разграничения по статусу проекта.
	Если Правила.Свойство("СтатусПроекта", ОписаниеПравила) Тогда
		
		Если ОписаниеПравила.Свойство("Нет", ВидОграничения) Тогда
			Если Данные.СтатусПроекта = Неопределено Тогда					
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Для выполнения этой операции проект необходимо вначале зарегистрировать.'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Запланирован", ВидОграничения) Тогда
			Если Данные.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Запланирован Тогда			
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проект находится в состоянии ""Запланирован"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Утвержден", ВидОграничения) Тогда
			Если Данные.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Утвержден Тогда					
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проект находится в состоянии ""Утвержден"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);						
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Выполняется", ВидОграничения) Тогда
			Если Данные.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Выполняется Тогда				
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проект находится в состоянии ""Выполняется"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);						
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Завершен", ВидОграничения) Тогда
			Если Данные.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Завершен Тогда			
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проект находится в состоянии ""Завершен"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);						
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеПравила.Свойство("Остановлен", ВидОграничения) Тогда
			Если Данные.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Остановлен Тогда
				Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
					
					СтрокаСообщения = НСтр("ru = 'Проект находится в состоянии ""Остановлен"".'");
					ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);						
					
					ПрерватьВыполнение = Истина;
					Возврат Истина;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; // Правило по статусу проекта.
	
	// Ищем правило для разграничения по статусам проектов.
	Если Правила.Свойство("СтатусыПроектов", ОписаниеПравила) Тогда
		
		Для Каждого Проект Из Правила.МассивПроектов Цикл
			
			ДанныеСтатуса = Данные.СтатусыПроектов.Найти(Проект, "Проект");
			
			Если ОписаниеПравила.Свойство("Нет", ВидОграничения) Тогда
				Если ДанныеСтатуса = Неопределено ИЛИ ДанныеСтатуса.СтатусПроекта = Неопределено Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						СтрокаСообщения = НСтр("ru = 'Для выполнения этой операции проект ""&1"" необходимо вначале зарегистрировать.'");
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&1", Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);						
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеСтатуса = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Запланирован", ВидОграничения) Тогда
				Если ДанныеСтатуса <> Неопределено И ДанныеСтатуса.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Запланирован Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						СтрокаСообщения = НСтр("ru = 'Проект ""&1"" находится в состоянии ""Запланирован"".'");
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&1", Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Утвержден", ВидОграничения) Тогда
				Если ДанныеСтатуса.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Утвержден Тогда	
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						СтрокаСообщения = НСтр("ru = 'Проект ""&1"" находится в состоянии ""Утвержден"".'");
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&1", Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Выполняется", ВидОграничения) Тогда
				Если ДанныеСтатуса.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Выполняется Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						СтрокаСообщения = НСтр("ru = 'Проект ""&1"" находится в состоянии ""Выполняется"".'");
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&1", Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Завершен", ВидОграничения) Тогда
				Если Данные.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Завершен Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						СтрокаСообщения = НСтр("ru = 'Проект ""&1"" находится в состоянии ""Завершен"".'");
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&1", Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ОписаниеПравила.Свойство("Остановлен", ВидОграничения) Тогда
				Если Данные.СтатусПроекта = Перечисления.упоСостояниеСтатусаПроекта.Остановлен Тогда
					Если _ЕстьОграничение(Режим, ВидОграничения) Тогда
						
						СтрокаСообщения = НСтр("ru = 'Проект ""&1"" находится в состоянии ""Остановлен"".'");
						СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "&1", Проект);
						ОбработатьОграничение(СтрокаСообщения, Отказ, Заголовок, ВыводитьСообщенияОРазграниченииПрав, ЭтотОбъект.Ссылка);
						
						ПрерватьВыполнение = Истина;
						Возврат Истина;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; // Правило по статусу проектов.	
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти