
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	упоОповещенияВызовСервера.ПриСозданииНаСервереФормТиповыхОповещений(ЭтаФорма, Объект);
	
	упоОбработчикиСобытийСервер.ФормаПриСозданииНаСервере(ЭтаФорма, Объект, Отказ, СтандартнаяОбработка);           
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ПрочитатьПараметры(Параметры.ЗначениеКопирования);
	КонецЕсли;	
	
	ОбновитьИнформациюПоМодулю();
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	упоОбработчикиСобытийКлиент.ФормаПриОткрытии(ЭтаФорма, Объект);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриПовторномОткрытии(ЭтаФорма, Объект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	стрПараметры = Новый Структура;
	Для Каждого СтрТз Из тзПараметры Цикл
		стрПараметры.Вставить(СтрЗаменить(СтрТз.ИмяПараметра," ",""),СтрТз.ЗначениеПараметра);	
	КонецЦикла;
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(стрПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПриЗаписиНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упоОбработчикиСобытийСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ПрочитатьПараметры(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упоОбработчикиСобытийКлиент.ФормаПослеЗаписи(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаПередЗакрытием(ЭтаФорма, 
													Объект, 
													Отказ, 
													СтандартнаяОбработка, 
													ЗавершениеРаботы, 
													ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	упоОбработчикиСобытийКлиент.ФормаПриЗакрытии(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаОповещения(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	упоОбработчикиСобытийКлиент.ФормаВнешнееСобытие(ЭтаФорма, Объект, Источник, Событие, Данные);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриЗагрузкеДанныхИзНастроекНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПриСохраненииДанныхВНастройкахНаСервере(ЭтаФорма, Объект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упоОбработчикиСобытийСервер.ФормаОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаАктивизации(ЭтаФорма, АктивныйОбъект, Источник);          
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	упоОбработчикиСобытийКлиент.ФормаОбработкаЗаписиНового(ЭтаФорма, НовыйОбъект, Источник, СтандартнаяОбработка);          
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	упоОбработчикиСобытийСервер.ФормаПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);     
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПрочитатьПараметры(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	упоОбработчикиСобытийСервер.ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#Область УниверсальныеОбработчики

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2 = Неопределено, П3 = Неопределено, П4 = Неопределено,
	П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийКлиент.ФормаУниверсальныйОбработчикСобытийФормыНаКлиенте(ЭтаФорма, П1, П2, П3, П4, П5, П5, П6);     
	
КонецФункции

&НаКлиенте
Функция Подключаемый_УниверсальныйОбработчикСобытийКлиентСВызовомСервера(П1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	Подключаемый_УниверсальныйОбработчикСобытийКлиент(П1, П2, П3, П4, П5, П6);
	Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнч(П1), П1.Имя, П2, П3, П4, П5, П6);     
	
КонецФункции

&НаСервере
Функция Подключаемый_УниверсальныйОбработчикСобытийСервер(ТипЗнчП1, ИмяП1, П2 = Неопределено, П3 = Неопределено,
	П4 = Неопределено, П5 = Неопределено, П6 = Неопределено) 
	
	упоОбработчикиСобытийСервер.ФормаУниверсальныйОбработчикСобытийФормыНаСервере(ЭтаФорма, ТипЗнчП1, ИмяП1, П2, П3, П4,
	П5, П5, П6);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяМодуляОтправкиСообщенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	МассивМодулей = упоОповещенияВызовСервера.ПолучитьМассивМодулейТранспортов();
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(МассивМодулей);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяМодуляОтправкиСообщенийПриИзменении(Элемент)
	ЗаполнитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыТранспортаПриАктивизацииСтроки(Элемент)
		
	ТекДанные = Элементы.ПараметрыТранспорта.ТекущиеДанные;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(ТекДанные.ЗначениеПараметра));
	Элементы.ПараметрыТранспортаЗначениеПараметра.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройки()
	
	ОбновитьИнформациюПоМодулю();
	
	Попытка
		ИсполняемыйМодуль = Вычислить(Объект.ИмяМодуляОтправкиСообщений);
		НастройкиТранспорта = ИсполняемыйМодуль.ПолучитьНастройкиТранспорта();
		ЗаполнитьЗначенияСвойств(Объект, НастройкиТранспорта);
		Если НастройкиТранспорта.Свойство("ПараметрыТранспорта") Тогда;
			ВремПараметры = НастройкиТранспорта.ПараметрыТранспорта;
			тзПараметры.Очистить();
			Для Каждого Эл Из ВремПараметры Цикл
				НовСтр = тзПараметры.Добавить();
				НовСтр.ИмяПараметра = Эл.Ключ;
				НовСтр.ЗначениеПараметра = Эл.Значение;
			КонецЦикла;
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()) + "'");
		Сообщение.Сообщить();
	КонецПопытки;
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Функция ОбновитьИнформациюПоМодулю() 
	
	УдалитьДобавленныеЭлементы();
	
	Попытка
		ИсполняемыйМодуль = Вычислить(Объект.ИмяМодуляОтправкиСообщений);
		Информация = ИсполняемыйМодуль.Информация();
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Информация);
	Исключение
	КонецПопытки;
	
	Попытка
		ИсполняемыйМодуль = Вычислить(Объект.ИмяМодуляОтправкиСообщений);
		ИсполняемыйМодуль.ВыводНаФормуДополнительнойИнформации(ЭтаФорма);
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;	
	
КонецФункции

&НаСервере
Функция УдалитьДобавленныеЭлементы()
	МассивРеквизитовНаУдаление = Новый Массив;
	Для Каждого СтрокаЭлемента Из ДобавленныеЭлементы Цикл
		Тип = НРег(СтрокаЭлемента.Тип);
		Если Тип = "реквизит" Тогда	
			МассивРеквизитовНаУдаление.Добавить(СтрокаЭлемента.Имя);	
		ИначеЕсли Тип = "элемент" Тогда
			Элемент = Элементы.Найти(СтрокаЭлемента.Имя);
			Если Элемент <> Неопределено Тогда
				Элементы.Удалить(Элемент);
			КонецЕсли;
		ИначеЕсли Тип = "команда" Тогда	
			Команда = Команды.Найти(СтрокаЭлемента.Имя);
			Если Команда <> Неопределено Тогда
				Команды.Удалить(Команда);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если МассивРеквизитовНаУдаление.Количество() Тогда
		Попытка
			ИзменитьРеквизиты(, МассивРеквизитовНаУдаление);
		Исключение
		КонецПопытки;
	КонецЕсли;
	ДобавленныеЭлементы.Очистить();
КонецФункции 

&НаКлиенте
Функция Подключаемый_ОткрытьНавигационнуюСсылкуПоЗаголовкуКоманды(Команда) 
	ПерейтиПоНавигационнойСсылке(ПолучитьЗаголовокКоманды(Команда.Имя));
КонецФункции

&НаСервере
Функция ПолучитьЗаголовокКоманды(ИмяКоманды) 
	Возврат Команды.Найти(ИмяКоманды).Заголовок;	
КонецФункции

&НаСервере
Функция УстановитьВидимостьДоступностьЭлементов() 
	Элементы.ПараметрыТранспорта.Видимость = тзПараметры.Количество();
КонецФункции

&НаСервере
Функция ПрочитатьПараметры(ТекущийОбъект) 
		
	стрПараметры = ТекущийОбъект.Параметры.Получить();
	тзПараметры.Очистить();
	Если ТипЗнч(стрПараметры) = Тип("Структура") Тогда
		Для Каждого Эл Из стрПараметры Цикл
			НовСтр = тзПараметры.Добавить();
			НовСтр.ИмяПараметра = Эл.Ключ;
			НовСтр.ЗначениеПараметра = Эл.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
