// Получает значение настройки из регистра дополнительных настроек
//
// Параметры:
//  ИмяНастройки  - Строка - ключ настройки в регистре
//  ЗначениеПоУмолчанию  - Произвольный - возвращается, если настройка не содержит значения
//                 или не найдена (дефолтно Неопределено)
//  Обязательно  - Булево - Необходимо обязательно получить значение из регистра, игнорируя
//                 значение по умолчанию (дефолтно Ложь)
//
// Возвращаемое значение:
//   Произвольный   - значение настройки из регистра, значение по умолчанию или Неопределено
//
Функция ПолучитьЗначение(ИмяНастройки, ЗначениеПоУмолчанию = Неопределено, Обязательно = Ложь) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИКТ_ДополнительныеНастройкиСистемы.Значение КАК Значение
	                      |ИЗ
	                      |	РегистрСведений.ИКТ_ДополнительныеНастройкиСистемы КАК ИКТ_ДополнительныеНастройкиСистемы
	                      |ГДЕ
	                      |	ИКТ_ДополнительныеНастройкиСистемы.Настройка = &Настройка");
	Запрос.УстановитьПараметр("Настройка", Врег(ИмяНастройки));
	Результат = Запрос.Выполнить().Выгрузить();

	Если Результат.Количество() = 0 ИЛИ НЕ ЗначениеРезультатаЗаполнено(Результат[0].Значение) Тогда
		Возврат ?(Обязательно, Неопределено, ЗначениеПоУмолчанию);
	КонецЕсли; 
	
	Возврат Результат[0].Значение;
	
КонецФункции // ПолучитьЗначение()

Функция ЗначениеРезультатаЗаполнено(Значение)
	
	Если ОбщегоНазначения.ОписаниеТипаВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат НЕ Значение.Пустая();
	Иначе
		Попытка
			Возврат ЗначениеЗаполнено(Значение);
		Исключение
			Возврат Неопределено; // При текущем составе регистра сюда исполнение дойти не должно
		КонецПопытки;
	КонецЕсли;
	
КонецФункции